{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:46:17.651066"
  },
  "content": "* *107A Sophia Road** is a site occupied by two buildings in Mount Sophia, Singapore. The first was completed in 1939 as the new premises of the City High School, which closed down as a result of the [Japanese Occupation of Singapore](/wiki/Japanese_Occupation_of_Singapore). The San Shan School moved into the building in 1947, and a second adjoining building was completed in 1953 due to the growing student population. The San Shan School moved out of the buildings in 1982. ## Description The first building is a two-storey mansion designed in a 'C'-shape with a central courtyard. The second building was designed in the [Art Deco](/wiki/Art_Deco) style and is located in front of the first building. It is three storeys tall and has a central feature which is \"adorned with strong vertical bands\" and accompanied by a flagpole. The front porch features an extended cantilevered canopy. The building's roof is flat and accompanied by horizontal ledges made of concrete. ## History The land on which the buildings stand was previously occupied by a \"luxurious\" private residence. In July 1936, then-City High School principal M. N. Samadar announced that the land on Sophia Road for the construction of a new premises for the school, which at the time had an enrollment of 492 students who were placed in 15 classes. The building was officially opened in 1939, with enrollment having increased to 720 by then. The school closed during the Japanese Occupation of Singapore, which lasted from 1942 to 1945. The buildings were derequisitioned on 4 October 1946, after which they were purchased by the Foochow Association for $80,000. The association planned to move the San Shan School into the buildings. However, the association was then told that the government had given the Military Police permission to occupy the premises, which were only to be made available to the school in December. In 1951, the school announced that it would be building a new building with 12 classrooms on the site for $150,000. It was to be completed in the middle of the following year. The foundation stone for the building was laid on 25 December. Chinese and English newspapers, as well as currency notes, were placed under the stone. In February 1981, the Foo Chow Association announced that it would be closing the San Shan School in the following year as a result of declining enrollment. The buildings were to be occupied by the [Nanyang Academy of Fine Arts](/wiki/Nanyang_Academy_of_Fine_Arts), which was to move in following the closing of the San Shan School. The academy paid the association a rent of $120 per year. However, the association announced in 1983 that the rent would be increased to $25,000 beginning in January of the following year. The academy moved out of the site in that year. In 1996, the government acquired the property, which was to be demolished to make way for the construction of the [North East MRT line](/wiki/North_East_Line). However, the buildings were not demolished and continued to be rented out. It later became the premises of the Cornerstone Training Centre. After the centre left the property, it was left vacant. 1°18′08″N 103°50′45″E﻿ / ﻿1.30228°N 103.84573°E﻿ / 1.30228; 103.84573\n",
  "language": "en",
  "processed_at": "2026-01-12T09:46:17.650631",
  "title": "107A Sophia Road",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/107A_Sophia_Road"
}