{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:46:21.952167"
  },
  "content": "Bungalows in SingaporeThe topic of this article **may not meet Wikipedia's general notability guideline**. Please help to demonstrate the notability of the topic by citing reliable secondary sources that are independent of the topic and provide significant coverage of it beyond a mere trivial mention. If notability cannot be shown, the article is likely to be merged, redirected, or deleted. *Find sources:* \"124 and 126/126A St. Patrick's Road\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(November 2024)* *(Learn how and when to remove this message)* **124 and 126/126A St. Patrick's Road** are two bungalows on Saint Patrick's Road in the Frankel subzone of [Bedok, Singapore](/wiki/Bedok). The two bungalows were integrated into a condominium complex in 2006. ## Description The single-storey [Victorian-style](/wiki/Victorian_architecture) bungalow at 124 St. Patrick's Road, which was built in the centre of the compound, features dual frontages, facing St. Patrick's Road on one end and facing Marine Parade Road on the other. The symmetrical house was \"planned in a linear fashion to maximize its view towards the sea\", with the double doors facing Marine Parade Road initially opening towards the sea. Both fronts feature \"generous\" verandahs, while turrets can be found on the roof parapet. The exterior of the bungalow features columns of the [Ionic order](/wiki/Ionic_order), \"elaborate\" motifs and \"intricate\" railings made of cast iron, while the interior features the original brass turn bolt knobs and latches. The windows are made of Peranakan Arabesque Glass. The two-storey bungalow at 126/126A St. Patrick's Road, which has a more \"compact\" floor plan, features a \"distinct\" pitched roof, a verandah on the ground floor and a \"repetition\" of windows. It also features a single-storey section at the rear, which contains the living area and the bedrooms. The central section of the building, which is windowless, is ventilated via with an 'air chimney'. The cornices, exterior and balustrades on the verandah on the upper floor of the bungalow feature ornate mouldings. According to the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority), \"While this bungalow has less elaborate features than the other one on the same site, its elegant proportions and the use of Classical orders give the bungalow a stately presence.\" ## History 124 St. Patrick's Road was completed in 1914 as a seafront estate. The estate belonged to prominent businessman Tan Soon Guan, who was the son of Tan Jiak Chuan, the grandson of Tan Beng Guan and the great-grandson of [Tan Kim Seng](/wiki/Tan_Kim_Seng). The bungalow at 126/126A St. Patrick's Road was completed in 1925. The buildings later lost their seafront to land reclamation works in the area. In 2005, the descendants of Tan sold the property to developer United Industrial Corporation, who planned to build a condominium on the site, for $65.5 million. The bungalow at 124 St. Patrick's Road was to be converted into the Majestic Clubhouse, which would house a spa, gym, theatre lounge, games room and reading room. It would also face a large swimming pool. The bungalow at 126/126A St. Patrick's Road was to be converted into two exclusive apartments, each priced at $3 million. The bungalows were renovated and restored, with handicap ramps and free-standing air conditioning units hidden behind timber enclosures being installed. Both bungalows were gazetted for conservation by the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) in September 2006. The restoration of the buildings received the Architectural Heritage Awards by the Urban Redevelopment Authority in 2010. 1°18′31″N 103°54′57″E﻿ / ﻿1.3085°N 103.9158°E﻿ / 1.3085; 103.9158\n",
  "language": "en",
  "processed_at": "2026-01-12T09:46:21.951522",
  "title": "124 and 126/126A St. Patrick's Road",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/124_and_126/126A_St._Patrick%27s_Road"
}