{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:46:23.133362"
  },
  "content": "Military unit The **126 Squadron \"Cougar\"** is a helicopter squadron of the [Republic of Singapore Air Force](/wiki/Republic_of_Singapore_Air_Force). Its motto is \"*Ready and Able*\", with the Cougar adopted as the squadron's motif. ## Unit history Formed initially on 16 September 1992 at Sembawang Air Base, the 126 Squadron consisted of fourteen newly purchased [Aérospatiale AS532UL Cougar](/wiki/Eurocopter_AS532_Cougar) medium lift helicopters, which were an upgraded version of the Super Puma helicopters then used by its sister squadron – [125 SQN](/wiki/125_Squadron,_Republic_of_Singapore_Air_Force). In 1998, the squadron was temporarily deployed at [Oakey Airbase](/wiki/Oakey_Army_Aviation_Centre), for operators to train with the [Eurocopter AS332 Super Puma](/wiki/Super_Puma) in a large training airspace. In 2023, a 25th-anniversary celebration was held at Oakey, which involved several high ranking dignitaries visiting and the unveiling of a commemorative tail design painted on a RSAF Chinook. After the CH-47F attained full operational capability for the RSAF, the squadron transitioned to a mix of CH-47SDs and CH-47Fs. ## Roles and Missions In May 1993, the RSAF deployed four Super Puma helicopters and 65 personnel to assist with the [United Nations Transitional Authority in Cambodia](/wiki/United_Nations_Transitional_Authority_in_Cambodia) in conducting the [1993 Cambodian general election](/wiki/1993_Cambodian_general_election), where they ferried election officials and conducted aerial policing. This was the RSAF's first every UN peacekeeping mission. ## Aircraft operated 1. 14× AS532UL Cougars (1996–2023) 2. ??x CH-47SD Chinooks (2023–present) 3. ??x CH-47F Chinooks (2023–present) ## Photo gallery - RSAF web page on 126 Sqn & Sembawang Air Base(SBAB) This Singapore-related article is a stub. You can help Wikipedia by expanding it.\n",
  "language": "en",
  "processed_at": "2026-01-12T09:46:23.132779",
  "title": "126 Squadron, Republic of Singapore Air Force",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/126_Squadron,_Republic_of_Singapore_Air_Force"
}