{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:46:27.417907"
  },
  "content": "Republic of Singapore Air Force fighter unitMilitary unit The **140 Squadron \"Osprey\"** of the [Republic of Singapore Air Force](/wiki/Republic_of_Singapore_Air_Force) currently operates twelve [F-16 Fighting Falcon](/wiki/F-16_Fighting_Falcon) of the F-16C/D Block 52 version. Based in [Tengah Air Base](/wiki/Tengah_Air_Base), the squadron goes by the [motto](/wiki/Motto) \"*Stand Firm in Defence*\" with the Osprey adopted as its mascot. ## History The Squadron was set up in September 1970 as Singapore's first Air Defence Fighter Squadron and received their first aircraft - twenty refurbished [Hawker Hunters](/wiki/Hawker_Hunter) aircraft in July 1970. The Hawker Hunters served faithfully for twenty years, after which they were replaced by the [F-16A/Bs](/wiki/F-16_Fighting_Falcon) in 1990. These were, in turn, replaced by newer F-16C/Ds in 2000 and were subsequently transferred to [Royal Thai Air Force](/wiki/Royal_Thai_Air_Force) the same year. The Squadron celebrated its 50th anniversary in 2020. ## Information The tail is adorned with a red checkered tailband. The squadron's logo is centered with the serial number on the base of the tail. This scheme was already applied during the F-16A/B era. ## Achievements 140 Squadron is also a consistent winner in the annual [Singapore Armed Forces Best Unit Competition](/wiki/Singapore_Armed_Forces_Best_Unit_Competition) for the Air Force, having emerged as the Best Fighter Squadron since the competition's inception back in 1985. Namely: 1985, 1987, 1991, 1992, 1993, 1994, 1996, 1999, 2003, 2006, 2007, 2009, 2016. 140 Squadron won the Best Squadron for the Hotshot Challenge 2016. It celebrated its 45th anniversary in 2015 and won the Best Fighter Squadron. ## Aircraft operated 1. **46× Hawker Hunters** (1970–1992) 2. **8× F-16A/B Fighting Falcons** (1990–2004) 3. **12× F-16C/D Fighting Falcons** (2003–present) ## Latest photo - RSAF web page on 140 Sqn & Tengah Air Base (TAB) This Singapore-related article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T09:46:27.417427",
  "title": "140 Squadron, Republic of Singapore Air Force",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/140_Squadron,_Republic_of_Singapore_Air_Force"
}