{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:46:29.859994"
  },
  "content": "Townhouse in Bukit Merah, Singapore **141 Neil Road** is a [townhouse](/wiki/Townhouse) located along [Neil Road](/wiki/Neil_Road) in the Blair Plain district of [Bukit Merah](/wiki/Bukit_Merah), Singapore. Near Singapore's [Chinatown](/wiki/Chinatown,_Singapore), 141 Neil Road was built in the early 1880s, with its first owner being Chinese banker Lim Yew Teok. In 1991, it was gazetted for conservation, and its last occupant died in 2006. It was subsequently put up for sale by [Knight Frank](/wiki/Knight_Frank) in 2019 and purchased by the Portabella family in 2020. The Portabella family donated 141 Neil Road to the [National University of Singapore](/wiki/National_University_of_Singapore) (NUS) for research purposes relating to the conservation and maintenance of townhouses and shophouses. Since 2023, NUS has been undertaking the restoration of 141, along with research into the maintenance of heritage sites such as 141. This is expected to be completed by 2027. The architecture and appearance of 141 Neil Road is that of typical townhouses and shophouses built in Singapore's First Transitional style. To facilitate the restoration works on the building, NUS set up the Architectural Conservation Laboratory (ArClab) to help conduct research on 141's temperature, meteorological statistics, and the incorporation of [green technology](/wiki/Environmental_technology). ## Site The [townhouse](/wiki/Townhouse) is located at 141 [Neil Road](/wiki/Neil_Road), in the Blair Plain conservation area of [Bukit Merah](/wiki/Bukit_Merah). Blair Plain was named after John Blair (died 1898), a general manager of the [Tanjong Pagar Dock Company](/wiki/Tanjong_Pagar_Dock_Company) from 1881 to 1896. The Blair Plain conservation area, which was gazetted for conservation on 25 October 1991, is mainly made up of shophouses and townhouses. It is located near the [Outram Park MRT station](/wiki/Outram_Park_MRT_station) and will be to the under construction [Cantonment MRT station](/wiki/Cantonment_MRT_station). 141 Neil Road is also near the Cantonment Tower [Housing and Development Board](/wiki/Housing_and_Development_Board) flats and several condominiums. The townhouse is long and narrow, measuring 7 metres (23 ft) by 50 metres (160 ft), and faces north–south. 141 Neil Road's appearance is similar to that of a shophouse, but has been residential since it was built, and thus does not include a shopfront on the first floor. ## History 141 Neil Road was constructed as a townhouse in the early 1880s as Neil Road 56–5. As immigration to Singapore increased near the end of the 19th-century, [Chinatown](/wiki/Chinatown,_Singapore) quickly became overpopulated with Chinese immigrants, leading many to seek alternative locations. This led to an increase in popularity for the Blair Plain–Neil Road area, especially due to its infrastructure and vicinity to the [port](/wiki/Port_of_Singapore). Neil Road 56–5 would eventually be purchased by Chinese banker Lim Yew Teok in 1913.[a] Lim would live there till his death in 1925. In 1991, 141 Neil Road was gazetted for conservation as part of the Blair Plain conservation area. The last occupant of 141 Neil Road was Lim Chhui Ngor, the great-granddaughter of Lim, who died in 2006 without a will. Following her death, the building was auctioned in 2019 for [S$](/wiki/Singapore_dollar)4.8 million ([US$](/wiki/USD)3.52 million) by [Knight Frank](/wiki/Knight_Frank). 141 Neil Road was then purchased by the Portabella family in March 2020, a family that own 13 other shophouses.[b] In 2022, the Portabellas donated 141 Neil Road to the [National University of Singapore](/wiki/National_University_of_Singapore) (NUS) for the purpose of studying the conservation and maintenance of both townhouses and shophouses. Their donation was supported with [S$](/wiki/Singapore_dollar)2 million ([US$](/wiki/USD)1.45 million) for the costs of restoration and repair works for the townhouse. In response, the NUS's Department of Architecture opened the Architectural Conservation Laboratory (ArClab) at 141 Neil Road in January 2022. At the opening of ArClab, [National Development Minister](/wiki/Ministry_of_National_Development_(Singapore)) [Desmond Lee](/wiki/Desmond_Lee_(Singaporean_politician)) spoke about conservation and restoration efforts for heritage sites in Singapore. Lee also spoke about how the restoration of 141 Neil Road would help train NUS students and teach the public about built heritage. Present at the opening were Ricardo Jr Portabella, a member of the Portabella family, and Ho Puay Peng, head of NUS's Department of Architecture. Restoration works on 141 Neil Road began in early 2023 and are expected to be completed in 2027. ### Restoration and research works NUS's ArClab restoration works have to follow the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority)'s guidelines, as conserved buildings such as 141 Neil Road fall under their care. ArClab is focusing on using [green technology](/wiki/Environmental_technology) and replacing broken elements of the building. ArClab's principal investigator, Nikhil Joshi, further explained that the use of green technology was to lower the building's carbon emissions and make it [carbon neutral](/wiki/Net-zero_emissions). Some methods used to lower the emissions were prioritising the natural light and ventilation of the townhouse. Furthermore, a 3D model of 141 was created to monitor humidity, cracks, and issues with the building. It was created using [LiDAR](/wiki/Lidar) scanners and also helps to digitally archive the building. Certain elements of 141 that had deteriorated were reconstructed and [3D-printed](/wiki/3D_printing) to be replaced. These 3D-printed elements were further strengthened with nano coatings, sanded, cleaned, and assembled before being added. To monitor the building's energy consumption, three small [weather stations](/wiki/Weather_station) were placed in the building – one in the front yard, one in the building's [air well](/wiki/Air_well_(ventilation)), and one in the backyard. These monitored 141's meteorological conditions, including temperature, humidity, [cloud cover](/wiki/Cloud_cover), and [wind speed](/wiki/Wind_speed). The weather stations recorded that a natural [wind tunnel](/wiki/Wind_tunnel) ran through 141, from north to south, or, from the front yard to the backyard. Initial assumptions were that the wind tunnel would run south to north, due to the [sea breeze](/wiki/Sea_breeze). To further check the townhouse's temperature, temperature sensors were placed on the roof, with the future benefit of monitoring the best areas to place solar panels. Joshi stated that the highest temperature recorded was up to 58 °C (136 °F) and showed that the roof tiles were not reflecting sunlight well. The townhouse's internal temperatures were up to 4 °C (39 °F) below the exterior's, while both temperatures were similar during the night. Overall, 141's internal temperatures range from 28 °C (82 °F) to 33 °C (91 °F) during the day. To refurbish the building while still maintaining its natural elements was described as \"challenging\" by Joshi. 141 Neil Road's nearby developments such as [high-rises](/wiki/Tower_block) might disrupt its natural ventilation methods as they tower over and potentially block the natural ventilation. As has been done with previous shophouses, air-conditioning could be added to solve the ventilation issue, but would affect 141's low carbon emissions. Some alternatives to this include solar-powered thermal absorption systems, however they are not prevalent in Singapore, and ceiling fans. ## Architecture ### Exterior 141 Neil Road's exterior appearance is that of a typical Singaporean townhouse: long and slender. It measures 7 metres (23 ft) wide, 50 metres (160 ft) long, and is 14 metres (46 ft) tall, covering a total land area of 297 square metres (3,200 sq ft), with a gross [floor area](/wiki/Floor_area) of 447 square metres (4,810 sq ft). It is three storeys tall, although half of it is a \"partial third storey\", serving mainly as attic space. At its northern and southern end, there are small courtyards. The southern courtyard (the back) is larger, and leads to a back alley. The design of its exterior is known as the First Transitional style, which utilises simple designs and a moderate amount of decorations but still maintains diverse aesthetics throughout. The entrance in the northern courtyard includes a Pintu Pagar, a type of Malaysian half-gate that is made of wood. Some decorations by the entrance include [reliefs](/wiki/Relief), decorative qianci [zh], and a Chinese [\"fortune\" character](/wiki/Fu_(character)) (福; *fú*) hung above the door. Before restoration works on the building, its exterior ceramic reliefs were damaged, the glazed tiles having suffered [water damage](/wiki/Water_damage) and the wooden windows' varnish needing replacing. The townhouse's roof tiles, which were from France, also needed replacing. These v-shaped roof tiles were traditionally handmade and wood-fired, but had to be replaced over the years. New roof tiles made during the restoration originated from Thailand and Japan and maintained the v-shape of the original tiles. The new tiles will reflect sunlight better and were made [porous](/wiki/Porosity) to trap rainwater, with space in-between the tiles to help in ventilation. To further improve 141's ventilation, [lime](/wiki/Lime_(material)) was used as a plaster on the walls. The lime plaster would be more \"breathable\" than the typical cement plaster, while also reducing mould growth by allowing moisture to escape better. Studies were also carried out to make the lime plaster accurate to the original lime plaster used in the townhouse's construction. ### Interior The building's interior is made up of two storeys, with a third floor in the southern half of the house. There is a staircase in the building that goes from the first floor to the attic, with a separate spiral staircase in the backyard that goes up to the third floor. Thus, the building's tallest point is at its back. The interior contains many ornate tiles, such as Japanese tiles, which were manufactured by Danto Kaisha [Wikidata] and feature depictions of citrons and pomegranates; English tiles, that were manufactured by [Alfred Meakin](/wiki/Alfred_Meakin_Ltd) and have illustrations of pink water lilies that are located on the staircase; and [Art Nouveau](/wiki/Art_Nouveau)-style tiles, of which their origins are unknown but suspected to be from either Belgium or England. There is an [air well](/wiki/Air_well_(ventilation)) located in the building, which was a common feature of shophouses that allowed natural light and ventilation to enter the house. The interior also has a natural [wind tunnel](/wiki/Wind_tunnel) that travels from the front yard to the backyard, which might explain why previous residents preferred to place their furniture by the wall to benefit from the wind tunnel. During the restoration works by ArClab, a ground-floor window by the rear is being converted into a wide doorway. This will increase [cross-ventilation](/wiki/Cross_ventilation) and make the townhouse wheelchair-accessible. - [145 Neil Road](/wiki/145_Neil_Road) – another conserved building along Neil Road - [Baba House](/wiki/Baba_House) – another conserved building along Neil Road, also owned by NUS ### Notes ### Citations ### Bibliography - Savage, Victor R.; [Yeoh, Brenda](/wiki/Brenda_Yeoh) (15 October 2022). *Singapore Street Names: A Study of Toponymics* (4th ed.). [Marshall Cavendish](/wiki/Marshall_Cavendish). [ISBN](/wiki/ISBN_(identifier)) 9789815009231. - Wei, Xintong; Zhou, Haoming; Joshi, Nikhil; Tang, Muyuan (25 April 2024). \"Beyond Preservation: Heritage as an Educational Practice Process at 141 Neil Road, Singapore\". *Buildings*. **14** (5): 1225. [doi](/wiki/Doi_(identifier)):10.3390/buildings14051225. - ArClab official website\n",
  "language": "en",
  "processed_at": "2026-01-12T09:46:29.859598",
  "title": "141 Neil Road",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/141_Neil_Road"
}