{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:46:35.052229"
  },
  "content": "Military unit The **144 Squadron \"Blackite\"** of the [Republic of Singapore Air Force](/wiki/Republic_of_Singapore_Air_Force) was a fighter-bomber squadron based at [Paya Lebar Air Base](/wiki/Paya_Lebar_Air_Base), the squadron goes by the [motto](/wiki/Motto) \"*Dare To Excel*\" with the [black kite](/wiki/Black_kite) adopted as its mascot. ## History 144 Squadron was formed in 1979 as one of the RSAF's fighter squadrons operating in the interceptor role, catapulting the RSAF into the supersonic era upon delivery of the original F-5E/F Tiger. The squadron initially operated the supersonic [F-5E/F Tiger II](/wiki/Northrop_F-5#F-5E_and_F-5F_Tiger_II) fighter aircraft, but has been operating the locally modified & improved [F-5S/T Tiger-IIs](/wiki/Northrop_F-5#F-5E_and_F-5F_Tiger_II) fighter aircraft since the early 1990s, these were retrofitted with new state-of-the-art avionics giving the aircraft capability of carrying out both air-to-air and air-to-ground missions. 144 Squadron has since been disbanded after the retirement of the [F-5S/T Tiger-IIs](/wiki/Northrop_F-5#F-5E_and_F-5F_Tiger_II) in September 2015. ## Achievements The squadron clinched the coveted Best Fighter Squadron award ([Singapore Armed Forces Best Unit Competition](/wiki/Singapore_Armed_Forces_Best_Unit_Competition)) in 1995, 2005, 2009, and 2015. It first won the title in 1995. It is regarded by many as the best fighter squadron in the RSAF, having dominated many local and international exercises. Operating the oldest fighter platform in the RSAF ORBAT requires superior skills, capability and professionalism, thus the squadron handpicks the top pilot graduates to join the team. ## Mascot The Blackite is 144 Squadron's adopted mascot. The Squadron's “Dare to Excel” motto amplifies the Blackite character; a mysterious bird that is unpredictable and deadly, but strikes her prey with precision and readiness at all times. Coupled with team excellence, perseverance, dedication and professionalism, the men and women of 144 Squadron Team Blackites do “Dare to Excel”. ## Aircraft operated - 15 [F-5S Tiger IIs](/wiki/Northrop_F-5#Variants) - 7 [F-5T Tiger IIs](/wiki/Northrop_F-5#Variants) ## Latest photo - RSAF web page on 144 Squadron & Paya Lebar Air Base (PLAB) This Singapore-related article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T09:46:35.051665",
  "title": "144 Squadron, Republic of Singapore Air Force",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/144_Squadron,_Republic_of_Singapore_Air_Force"
}