{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:46:37.049574"
  },
  "content": "Townhouse in Bukit Merah, Singapore **145 Neil Road** is a [townhouse](/wiki/Townhouse) on [Neil Road](/wiki/Neil_Road) in [Bukit Merah, Singapore](/wiki/Bukit_Merah). It was gazetted for conservation as part of the Blair Plain Conservation Area. ## Description The townhouse was decorated with cut porcelain pieces [zh]. It also features plaster relief mouldings depicting animals \"rich in Chinese symbolism\". According to the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority), the building is a \"good example of a towkay's townhouse from the turn of the 20th century.\" The exterior of the building is currently painted in blue and features Chinese-language inscriptions, as well as friezes and glazed Peranakan tiles. Its doors and windows are made of timber. The building's [five-foot way](/wiki/Five-foot_way) features flooring made of cement. The floors of the ground floor feature tiles made of terracotta. An open-air courtyard can be found within the building. The courtyard's centrepiece is a waterspout in the shape of a carp. The carp symbolises \"perseverance and abundance\" in [Chinese mythology](/wiki/Fish_in_Chinese_mythology). The walls in the courtyard feature \"antiquated pigmented cement wall tiles\". An iron gate can be found on the second storey. ## History The townhouse served as the family home of Kway Mee Koo (1876–1940), a local builder. It was gazetted for conservation by the Urban Redevelopment Authority as part of the Blair Plain Conservation Area. By 2014, the property had already belonged to the family of businesswoman Ho Renyung for around 20 years. The townhouse was rented out to tenants before she returned to Singapore and decided to make the building her permanent residence. From September 2011 to January 2013, the building underwent restoration at an estimated cost of $1,210,319. This involved repairing the doors, windows, tiles and floors, as well as restoring its original blue-coloured paint. Tiles sourced from [Malacca](/wiki/Malacca) were used to replace damaged ones. Mark John Wee served as the project's architect. During restoration works, a wall in the courtyard collapsed, revealing the original red and yellow-coloured tiles. The building also received an extension with a kitchen on the first storey and a master bedroom on the floor above. A doorframe which supported a plaque was \"salvaged\" and is now used on the second-storey staircase leading up to the attic in the attic. In 2014, the restoration project received the \"Category B\" Award at the Urban Redevelopment Authority Heritage Awards. - [141 Neil Road](/wiki/141_Neil_Road) – another conserved building along Neil Road 1°16′38″N 103°50′16″E﻿ / ﻿1.2772°N 103.8377°E﻿ / 1.2772; 103.8377\n",
  "language": "en",
  "processed_at": "2026-01-12T09:46:37.049082",
  "title": "145 Neil Road",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/145_Neil_Road"
}