{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:46:38.886318"
  },
  "content": "Military unit The **145 Squadron \"Hornet\"** is a strike fighter squadron of the [Republic of Singapore Air Force](/wiki/Republic_of_Singapore_Air_Force) based currently at [Changi Airbase (East)](/wiki/Changi_Airbase_(East)) which is a new [airbase](/wiki/Airbase), opened in 2004, to the east of [Singapore Changi Airport](/wiki/Singapore_Changi_Airport) on reclaimed land. Due to ongoing construction works for Changi Airport Terminal 5 & runway expansion, this flight squadron is based at [Tengah Airbase](/wiki/Tengah_Airbase). With the [hornet](/wiki/Hornet) as its mascot, the squadron's [motto](/wiki/Motto) is \"*Swift & Valiant*\". ## History First formed on 1 April 1984 at Tengah Air Base, the founding CO was Capt Chir C. P \" Hawkeye \", the squadron flew the [A-4S Skyhawk](/wiki/A-4_Skyhawk) and later, the locally upgraded [A-4SU Super Skyhawk](/wiki/A-4SU_Super_Skyhawk), along with her sister squadron, the [142 Squadron](/wiki/142_Squadron,_Republic_of_Singapore_Air_Force). When the A-4SU was retired from active combat service, however, 142 Squadron was disbanded, while the 145 Squadron was retained to operate the newly upgraded F-16Ds from the new air base, an unsurprising decision considering the fact that the 145 Squadron had emerged as the best fighter squadron for five consecutive years since the year 2000 in the annual [Singapore Armed Forces Best Unit Competition](/wiki/Singapore_Armed_Forces_Best_Unit_Competition). ## New role The twenty aircraft of the squadron are upgraded versions of the F-16D Block 52, hence known as the Block 52+ or F-16D+, are equipped with state-of-the-art Conformal Fuel Tanks, an enhanced radar with greater detection range and improved mapping capabilities, and an improved targeting pod, this enables the squadron to conduct precision day and night operations at a greater combat range and duration. This made it a unique squadron within the RSAF as all its aircraft are tandem seaters and every mission is flown with a Pilot and Weapon System Officer (WSO), until the arrival of the F-15SG Eagles with 142 and 149 Squadrons. ## Information The tail is adorned with a toned down squadron logo in the center of the tail with the serial number on the base. It is the only fighter squadron which chose an insect as its mascot. ## Achievements The squadron clinched the Best Fighter Squadron award in the following years: 1998, 2000, 2012 and 2014. ## Aircraft operated 1. **16× T/A-4SU Super Skyhawks** (1984–2004) 2. **20× F-16D+ Fighting Falcons** (2004–present) ## Latest photo - RSAF web page on 145 Sqn & Changi Air Base (CAB) This Singapore-related article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T09:46:38.885843",
  "title": "145 Squadron, Republic of Singapore Air Force",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/145_Squadron,_Republic_of_Singapore_Air_Force"
}