{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:46:43.848682"
  },
  "content": "Shophouses in Kallang, Singapore **161 Lavender Street** is a row of shophouses on Lavender Street in the [Lavender](/wiki/Lavender,_Singapore) subzone of [Kallang, Singapore](/wiki/Kallang). Completed by philanthropist [Lee Kong Chian](/wiki/Lee_Kong_Chian) in the 1930s, it was gazetted for conservation as part of the [Jalan Besar Secondary Settlement](/wiki/Jalan_Besar) conservation area. ## Description The row of 11 pre-war shophouses features an \"Art Deco Front facade with pastel hues\". It features a triple frontage onto Lavender Street, Foch Road and Tyrwhitt Road with 10 covered parking lots. A pediment at the top of the building depicts soldiers bearing the [Flag of the Republic of China](/wiki/Flag_of_the_Republic_of_China). [Majolica](/wiki/Majolica) wall tiles made in Belgium can also be found within the building. On the exterior of the building, plaster reliefs depicting Chinese characters were placed above windows. ## History The shophouses were built by prominent businessman philanthropist Lee Kong Chian, the founder of the [Lee Foundation](/wiki/Lee_Foundation), in the 1930s. It is believed that the depictions on the building's pediment were a result of Lee's \"ardent\" support for Chinese revolutionary [Sun Yat-sen](/wiki/Sun_Yat-sen). The building was gazetted for conservation by the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority), which placed it within the Jalan Besar Secondary Settlement Conservation. It later underwent restoration works, which involved replacing missing Majolica tiles with replicas, and the installation of a drainpipe which was \"sensitively integrated\" with a column. A modern four-storey rear extension to the shophouses was also built. It was designed to \"match\" the rest of the building in scale. According to the authority, the \"solid and void expression\" of the extension \"complements the conserved building.\" This was allowed as the shophouses were placed in a 'Secondary Settlement' conservation area. The restoration project received the Urban Redevelopment Authority Architectural Heritage Award in 1995. The building was placed on the Jalan Besar Heritage Trail by the [National Heritage Board](/wiki/National_Heritage_Board_(Singapore)) in 2012. On 12 July 2022, Hafary Holdings acquired the property for $71.28 million. The company then announced its intention to convert the building into a flagship store. Its occupants then included \"popular\" cafes Apartment Coffee and Glacier. 1°18′46″N 103°51′39″E﻿ / ﻿1.31287°N 103.86092°E﻿ / 1.31287; 103.86092\n",
  "language": "en",
  "processed_at": "2026-01-12T09:46:43.848123",
  "title": "161 Lavender Street",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/161_Lavender_Street"
}