{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:46:45.184817"
  },
  "content": "Military unit The **165 Squadron** is an [Air Defence Group](/wiki/Anti-aircraft_warfare) squadron of the [Air Defence and Operations Command](/wiki/Air_Defence_and_Operations_Command), [Republic of Singapore Air Force](/wiki/Republic_of_Singapore_Air_Force). It operates the [Rapier missile](/wiki/Rapier_missile) purchased from [British Aerospace](/wiki/British_Aerospace) since 1983, providing air defence cover against low-flying aircraft. With its [motto](/wiki/Motto), \"*Pride in Protection*\", the squadron conducted its first live-firing exercise at the Royal Artillery Range in [Hebrides](/wiki/Hebrides), the United Kingdom in July 1984, and participated in its first overseas deployment exercise in 1985 in Exercise Air Thai-Sing (now known as [Exercise Cope Tiger](/wiki/Exercise_Cope_Tiger)) at Chandy Range in [Thailand](/wiki/Thailand). ## History The 165 Squadron, then known as 165 SADA, was officially formed on 1 August 1983 with the acquisition of the [Rapier missile](/wiki/Rapier_missile) after an air defence study in 1978. Formed at [Changi Camp](/wiki/Changi_Camp), it was established on 1 September 1985, before becoming fully operationally ready a year later. In 1987, the battalion shifted to [Lim Chu Kang Camp II](/wiki/Lim_Chu_Kang_Camp_II), where it is currently located. Full-time National Servicemen were added to its ranks in 1988. In July 2006, ADSD became ADOC (Air Defence Operations Command) and ADB became ADG (Air Defence Group). It current operates the Surface-to-Air PYthon and DERby - Short Range ([SPYDER-SR](/wiki/SPYDER)) ground-based air defence system. - Official website This Singapore-related article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T09:46:45.184323",
  "title": "165 Squadron, Republic of Singapore Air Force",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/165_Squadron,_Republic_of_Singapore_Air_Force"
}