{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:46:47.223599"
  },
  "content": "Establishment of Singapore as a British trading port The signing of the **Treaty of Singapore** on 6 February 1819 is officially recognised as the founding of modern-day Singapore. The Treaty allowed the [British East India Company](/wiki/East_India_Company) to open up a trading post in [Singapore](/wiki/Singapore), marking the beginning of a British settlement. As Singapore was also a major trading port in ancient times, it is also often referred to as the **founding of modern Singapore** to reflect the fact that the [history of Singapore stretches back further](/wiki/Early_history_of_Singapore). Since its signing, both the previous [British colonial government](/wiki/List_of_governors_of_Singapore) and the present [government of Singapore](/wiki/Government_of_Singapore) has held major commemorative events at every [golden jubilee](/wiki/Golden_jubilee) intervals, in 1869 (50th), 1919 (100th), 1969 (150th) and 2019 (200th), to mark Singapore's modern founding. A treaty of central importance to the modern [history of Singapore](/wiki/History_of_Singapore) and its [national mythos](/wiki/National_mythos), its legacy remains complex, with both critical and pragmatic views about what it represents and means for the country. ## History In the late 18th century, the commercial and trading activities between the [British Empire](/wiki/British_Empire) and the [Qing Empire](/wiki/Qing_dynasty) became more and more frequent, and the need for setting up British bases in the middle of the navigation routes was also increasing. As a result, the UK started looking for ways to set up trading posts in the region. In 1786 and 1791, the British East India Company signed treaties with the Sultan of [Kedah](/wiki/Kedah_Sultanate) to acquire [Penang](/wiki/Penang) in the [Malay Peninsula](/wiki/Peninsular_Malaysia). And in 1795, during the [First Coalition War](/wiki/War_of_the_First_Coalition) in [Europe](/wiki/Europe), [William V](/wiki/William_V,_Prince_of_Orange) of the [Netherlands](/wiki/Netherlands) was in exile in England. He issued a series of letters, later known as the \"[Kew Letters](/wiki/Kew_Letters)\", to overseas Dutch colonies, instructing the local governors to temporarily transfer the control of the Dutch colonies to the UK for safekeeping, including [Malacca](/wiki/Malacca_City), [Padang](/wiki/Padang), and other places. In 1811, the death of Sultan [Mahmud Shah III](/wiki/Mahmud_Shah_III_of_Johor) of [Johor](/wiki/Johor) immediately triggered the question of which one of his two sons would succeed to the throne as the new sultan. The elder son, [Tengku Hussein](/wiki/Hussein_Shah_of_Johor), was not in Johor at that time because he was having his wedding in [Pahang](/wiki/Pahang). His younger brother, [Tengku Abdul Rahman](/wiki/Abdul_Rahman_Muazzam_Shah_of_Johor), then took the opportunity and ascended the throne. Tengku Hussein was subsequently sent into exile in [Penyengat Island](/wiki/Penyengat_Island) of the [Riau Archipelago](/wiki/Riau_Archipelago). In 1814, the situation in Europe stabilised. Britain and the Netherlands signed an [agreement](/wiki/Anglo-Dutch_Treaty_of_1814) to return the original Dutch colonies back. Later, the influence of the Netherlands in the region gradually recovered and increased, and they began levying heavy taxes on ships anchored in their colonies in the area, including British ships. Consequently, the British East India Company began to look for another base in the region. On 22 March 1818, Sir [Stamford Raffles](/wiki/Stamford_Raffles) became the Lieutenant-Governor of Bencoolen, now known as [Bengkulu](/wiki/Bengkulu), in [Indonesia](/wiki/Indonesia). In the autumn of that same year, in order to counter the Dutch influence in the region, he went to India and successfully persuaded the governor there to support him in finding a suitable location in the southeast of the [Strait of Malacca](/wiki/Strait_of_Malacca) to open up a new British post. On the other hand, on 28 November of the same year, the Netherlands reached an agreement with Sultan Abdul Rahman, the younger son, to establish a garrison camp in [Riau](/wiki/Riau_Islands), giving the Netherlands the control over the main shipping channels in the Malacca Strait. Then, Raffles arrived in Singapore on 28 January 1819. He immediately arranged to meet with the [Temenggong](/wiki/Temenggong_of_Johor), [Abdul Rahman](/wiki/Temenggong_Abdul_Rahman), the local noble in charge of maintaining law and order. They signed a provisional agreement two days later to allow the UK to establish a trading post there, and the [Union Jack](/wiki/Union_Jack) was hoisted. Since the Temenggong was subordinate to the sultan, the sovereign of Johor, the approval of the sultan was needed to finalise the treaty. However, the younger son Abdul Rahman was the sultan at that moment and had a close relationship with the Netherlands. It was near impossible for Raffles to get the signature from Sultan Abdul Rahman. Yet, Raffles was aware of the succession dispute, and so he decided to made good use of it. He arranged the elder son Tengku Hussein to be brought in to Singapore from Riau. Tengku Hussein was, then, declared the rightful heir and proclaimed as Sultan of Johor. On 6 February 1819, Raffles, Sultan Hussein, and Temenggong Abdul Rahman signed the Treaty of Singapore in a public ceremony, and the Union Jack was once again hoisted afterwards. This is now recognised as the official founding of modern Singapore. ## 1819 Singapore Treaty The Treaty of Singapore was written in both [English](/wiki/English_language) and [Malay](/wiki/Malay_language). The treaty authorised the British East India Company to \"maintain a factory or factories on any part of His Highness’s hereditary Dominions\". Here, the word \"factory\" had a different meaning in the past. It used to mean \"an establishment for factors and merchants carrying on business in a foreign country\" or more simply \"trading post\". In exchange, the British were obliged to provide monetary compensation for Sultan Hussein and Temenggong Abdul Rahman. The UK would need to respectively pay 5,000 [Spanish dollars](/wiki/Spanish_dollars) and 3,000 Spanish dollars every year to Sultan Hussein and Temenggong Abdul Rahman. Sultan Hussein also assured that the company would be protected from enemies in return for the same commitment from the UK, but Britain was not to get involved in internal conflicts. In addition, Sultan Hussein and Temenggong Abdul Rahman guaranteed the UK that they would “not enter into any treaty with any other nation... nor admit or consent to the settlement in any part of their Dominions of any other power European or American”. ### Disputes Not long after the signing of the treaty, both Sultan Hussein and Temenggong Abdul Rahman sent letters to [Yang di-Pertuan Muda of Riau](/wiki/Yang_di-Pertuan_Muda_of_Riau) Raja Ja'afar and the Dutch about them having been forced to enter into the treaty. It was also said that Sultan Hussein had been pressured into accepting the sultanship. But less than a month, on 1 March 1819, the UK demanded Temenggong Abdul Rahman and Sultan Hussein to sign a statement saying they gave their consent to the British to start a trading post there. Temenggong Abdul Rahman also told Britain that he had made the complaint to try to prevent retaliation from the Dutch. ## Commemoration for major anniversaries The Singapore government has organised different commemorative activities to mark major anniversaries of Singapore's modern foundation. The last one was in 2019 for the bicentennial. ### Semicentennial: 50th Anniversary (1869) [Cavenagh Bridge](/wiki/Cavenagh_Bridge) was opened in 1869 to celebrate the 50th anniversary of the modern foundation of Singapore. It was named after the last Governor of the [Straits Settlements](/wiki/Straits_Settlements) from 1859 to 1867, Sir [William O. Cavenagh](/wiki/Orfeur_Cavenagh). The bridge is the oldest surviving suspension bridge across the Singapore River. In August 2019, the bicentennial year, the government designated the bridge a national monument. ### Centennial: 100th Anniversary (1919) The colonial government formed two special committees a year prior to the centennial to come up with ideas for the occasion. One of the committees, the Centenary Memorial Committee, decided to set up a fund for higher education and building a local university. The fund then led to the establishment of Raffles College, which would ultimately become today's [National University of Singapore](/wiki/National_University_of_Singapore). The anniversary was designated as a public holiday and named \"Centenary Day\". In the morning, [Governor Arthur Young](/wiki/Arthur_Young_(colonial_administrator)) unveiled a new commemoration plaque on the plinth of the existing bronze Statue of Raffles to kick off the celebration, recognising the role that Raffles had played in the foundation of modern Singapore. Commemorative events on Centenary Day included a thanksgiving service at [St Andrew's Cathedral](/wiki/St_Andrew%27s_Cathedral,_Singapore), boat races, parades, and others. Festivities were held and enjoyed by every major ethnic group in Singapore, including Arab, Tamil, Muslim, Eurasian, and Jewish communities. ### Sesquicentennial: 150th Anniversary (1969) The year 1969 saw the 150th anniversary of the foundation of modern Singapore and the fourth year of independence from Malaysia. At that time, the Singaporean government had already been arranging and organising different celebrations for a year. The then Prime Minister [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) decided to deliver a speech on 6 February to start the year-long series of celebrations, corresponding to the date when the Treaty of Singapore was signed. The government did not only issue commemorative stamps and gold coins but also notably invited the [British royal family](/wiki/British_royal_family) to attend commemorative events. [Princess Alexandra](/wiki/Princess_Alexandra,_The_Honourable_Lady_Ogilvy) accepted the invitation to visit Singapore on behalf of [Queen Elizabeth II](/wiki/Elizabeth_II). During the seven-day visit, Princess Alexandra attended the [Singapore National Day Parade](/wiki/Singapore_National_Day_Parade) and interacted with Singaporeans in addition to participating in commemorative events for the sesquicentennial. Moreover, there were different exhibitions, concerts, sports competitions, and other programmes to celebrate the 150th anniversary. ### Bicentennial: 200th Anniversary (2019) To coordinate and organise activities to commemorate the 200th anniversary, the government established the Bicentennial Office in late 2017, more than a year earlier. When 2019 came, Prime Minister [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) held a ceremony to launch the year-long commemoration on 28 January, the day when Raffles landed in Singapore for the first time. The government and more than 200 organisations, along with 3,800 volunteers, jointly coordinated and prepared various commemorative events. These included concerts, light festivals, historical exhibitions, and many more. Commemorative stamps and banknotes were also specifically designed and issued. The government also handed out special bicentennial social and tax benefits to those in need. ## Debate In Singapore, there have been debates and different opinions about 6 February 1819 and its meaning and whether it should be celebrated or commemorated at all. For some, the historical event represents the start of colonisation, and therefore, unethical and repressive and any commemoration of it amounts to glorification of oppression. Others have more positive views about the colonial rule with the positive outcome in various areas, such as the development of Singapore's economy by converting it as a free port leading to increased trade in the early years and providing good education and legal systems. - History portal - British Empire portal - Singapore portal\n",
  "language": "en",
  "processed_at": "2026-01-12T09:46:47.223176",
  "title": "1819 Singapore Treaty",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/1819_Singapore_Treaty"
}