{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:46:49.051370"
  },
  "content": "Mutiny in British SingaporePart of a series on the[History of Singapore](/wiki/History_of_Singapore)[Early history](/wiki/Early_history_of_Singapore) (pre-1819)[Srivijaya](/wiki/Srivijaya)650–1377[Temasek](/wiki/Temasek), [Long Ya Men](/wiki/Long_Ya_Men), [Ban Zu](/wiki/Ban_Zu)c.14th century[Kingdom of Singapura](/wiki/Kingdom_of_Singapura)1299–1398[Majapahit](/wiki/Majapahit)1398–1400[Malacca Sultanate](/wiki/Malacca_Sultanate)1400–1528[Johor Sultanate](/wiki/Johor_Sultanate)1528–1819British colonial era (1819–1942)[Founding](/wiki/Founding_years_of_modern_Singapore)1819–1826[Straits Settlements](/wiki/Singapore_in_the_Straits_Settlements)1826–1867[Crown colony](/wiki/Singapore_in_the_Straits_Settlements#Crown_colony_(1867–1942))1867–1942[Japanese Occupation](/wiki/Japanese_occupation_of_Singapore) (1942–1945)[Fall of Singapore](/wiki/Fall_of_Singapore)1942[Sook Ching](/wiki/Sook_Ching)1942[Double Tenth incident](/wiki/Double_Tenth_incident)1943[Post-war period](/wiki/Colony_of_Singapore) (1945–1962)[First Legislative Council](/wiki/History_of_Singapore#First_Legislative_Council_(1948–1951))1948–1951[Maria Hertogh riots](/wiki/Maria_Hertogh_riots)1950[Second Legislative Council](/wiki/History_of_Singapore#Second_Legislative_Council_(1951–1955))1951–1955[Anti-National Service Riots](/wiki/1954_National_Service_riots)1954[Internal self-government](/wiki/Self-governance_of_Singapore) (1955–1963)[Hock Lee bus riots](/wiki/Hock_Lee_bus_riots)1955[Singapore Glass Factory strikes](/wiki/Singapore_Glass_Factory_strikes)1960[Pulau Senang prison riots](/wiki/Pulau_Senang_prison_riots)1963[Merger with Malaysia](/wiki/History_of_the_State_of_Singapore_(Malaysia)) (1963–1965)[Singaporean referendum](/wiki/1962_Singaporean_integration_referendum)1962[Operation Coldstore](/wiki/Operation_Coldstore)1963[Race riots in Singapore](/wiki/1964_race_riots_in_Singapore)1964[MacDonald House bombing](/wiki/MacDonald_House_bombing)1965[Republic of Singapore](/wiki/History_of_the_Republic_of_Singapore) (1965–present)[ASEAN Declaration](/wiki/ASEAN_Declaration) ([ASEAN](/wiki/Association_of_Southeast_Asian_Nations))1967[1969 race riots of Singapore](/wiki/1969_race_riots_of_Singapore)1969[Laju incident](/wiki/Laju_incident)1974[Operation Spectrum](/wiki/Operation_Spectrum)1987[Asian financial crisis](/wiki/1997_Asian_financial_crisis#Singapore)1997[Embassies attack plot](/wiki/Singapore_embassies_attack_plot)2001[H1N1 pandemic](/wiki/2009_swine_flu_pandemic_in_Asia#Singapore)2009–2010[Bus drivers' strike](/wiki/2012_Singapore_bus_drivers%27_strike)2012[Little India riot](/wiki/2013_Little_India_riot)2013[2018 North Korea–United States Singapore Summit](/wiki/2018_North_Korea%E2%80%93United_States_Singapore_Summit)2018[COVID-19 pandemic](/wiki/COVID-19_pandemic_in_Singapore)2020–2022By topic - [Timeline](/wiki/Timeline_of_Singaporean_history) - [Riots](/wiki/List_of_riots_in_Singapore) - [Military](/wiki/Military_history_of_Singapore) Singapore portal - v - t - e The **1915 Singapore Mutiny**, (also known as the **1915 Sepoy Mutiny** or the **Mutiny of the 5th Light Infantry**) was a [mutiny](/wiki/Mutiny) of elements of the [British Indian Army](/wiki/British_Indian_Army)'s [5th Light Infantry](/wiki/5th_Light_Infantry) in [British Singapore](/wiki/British_Singapore). Up to half of the regiment, which consisted of [Indian Muslims](/wiki/Indian_Muslim) predominantly from [Rajput](/wiki/Rajput) background, mutinied on 15 February 1915 due to rumours that they would be sent to fight against the largely Muslim [Ottoman Empire](/wiki/Ottoman_Empire) as part of the [Middle Eastern theatre of World War I](/wiki/Middle_Eastern_theatre_of_World_War_I). The mutineers killed 36 soldiers and civilians before the mutiny was suppressed by [Allied](/wiki/Allies_of_World_War_I) forces. After the mutiny, more than 205 mutineers were tried by [court-martial](/wiki/Court-martial), and 47 were publicly [executed by firing squad](/wiki/Execution_by_firing_squad). ## Background ### 5th Light Infantry The [5th Light Infantry](/wiki/5th_Light_Infantry) was a long established regiment in the Indian Army, dating from 1803. and had a good military record. It was initially known as the 2nd Battalion, 21st Bengal Native Infantry and was re-designated as the 42nd Bengal Native (Light) Infantry in 1843. After the Indian Mutiny, also known as the [Indian Rebellion of 1857](/wiki/Indian_Rebellion_of_1857), the surviving Bengal regiments were renumbered in 1861 and consequently the 42nd became the 5th Bengal Native (Light) Infantry. Following army reforms, the word ‘’Native’’ was dropped the regiment simply became known as the 5th Light Infantry. The regiment was well known for several battle honours, which included the Arakan, Afghanistan and Kandahar 1842, Ghunze 1842, Kabul and Moodkee, Ferozeshah and Sobroan 1857. It also fought in the [Second Afghan War](/wiki/Second_Anglo-Afghan_War) of 1879–80 and the [Third Burmese War](/wiki/Third_Anglo-Burmese_War) of 1885–87, which led to the British annexation of Burma and its tributary Shan states. Immediately prior to World War One, the regiment was employed in garrison duties in India. On 10 October 1914, the 5th Light Infantry was stationed in [Nowgong](/wiki/Nowgong,_Chhatarpur) when it was posted to Singapore to replace the [King's Own Yorkshire Light Infantry](/wiki/King%27s_Own_Yorkshire_Light_Infantry), which had been ordered to France. Unusually for 1914–15 the 5th Light Infantry was an entirely Muslim unit, mainly comprising [Ranghars](/wiki/Ranghar) (Muslims of [Rajput](/wiki/Rajput) origin) and [Pathans](/wiki/Pathan), commanded by British and Indian officers. Upon arrival in Singapore, the 5th Light Infantry was based in Alexandra Barracks. ### Disunity and discontent in regiment Even before its departure from India the 5th Light Infantry suffered from weak senior leadership and discord amongst its British officers (see details of Court of Inquiry report below). To compound the problem, the sepoys themselves were divided into two major cliques. One was led by the [Subedar Major](/wiki/Subedar-major) Khan Mohamed Khan and [Subedar](/wiki/Subedar) Wahid Ali and the other consisted of Subedar Dunde Khan plus [Jemadar](/wiki/Jemadar) Chiste Khan and Abdul Ali Khan. According to the Court of Inquiry, discipline was compromised by this division and any particular policy innovation or other measure taken within the regiment was likely to be opposed by one faction or the other. The sepoys were also reportedly unable to adjust and adapt to the living conditions in their new environment. While in India, the sepoys had a constant supply of goat meat and milk but because it was difficult to receive a constant supply of goats in Singapore, they had to make do with a substitute – chicken - and very little milk. The sepoys resorted to buying their own meat and milk to make up for the insufficient amounts they received and the use of the [dollar](/wiki/Straits_dollar) versus the rupee irked them further. The Court of Inquiry report, as well as contemporary accounts of the mutiny, saw it to be essentially an isolated affair - resulting from internal problems arising within a single poorly-led unit on overseas service. The possibility of German or Turkish involvement was closely examined but otherwise wider political and social implications were generally ignored. ## Mutiny On 27 January 1915, Colonel Martin announced that the 5th Light Infantry was to be transferred to Hong Kong for further garrison duties, replacing another Indian regiment. However, rumours were circulated among the sepoys that they might instead be sent to Europe or to the Ottoman Empire to fight against their Muslim co-religionists. Three Indian officers, Subedar Dunde Khan, Jemedar Chiste Khan, and Jemedar Ali Khan, were later to be identified by a court of enquiry as key conspirators in the matter. When the final order to sail to Hong Kong aboard the *Nile* arrived in February 1915, they and other ringleaders among the sepoys decided that it was time to rebel. On the morning of 15 February, the [General Officer Commanding](/wiki/General_Officer_Commanding) Singapore addressed a farewell parade of the regiment, complimenting the sepoys on their excellent turnout and referring to their departure the next day, without mentioning Hong Kong as the destination. At 3:30 pm on the afternoon of the same day, four Rajput companies of the eight companies making up the 5th Light Infantry mutinied. The mostly Pathan sepoys of the remaining four companies did not join the mutiny but scattered in confusion. Two British officers of the regiment, Captain Perceval Boyce and Lt. Harold Elliott, were killed as they attempted to restore order. The mutineers divided themselves into three groups. A party of 100 went to obtain ammunition from Tanglin Barracks, where 309 Germans, including crew members from the German light cruiser [SMS *Emden*](/wiki/SMS_Emden_(1906)), had been interned by the British. The mutineers fired on the camp guards and officers without warning, killing ten British guards, three [Johore troops](/wiki/Royal_Johor_Military_Force) present in the camp and one German internee. Amongst the dead were Second Lieutenant John Love Montgomerie, Rifles; Sergeant G. Wald, (Reserve) Engineers; Corporal D. McGilvray, Rifles; Corporal G.O. Lawson, Cyclist Scouts; Lance Corporal J.G.E. Harper, Rifles; Private B.C. Cameron, Rifles; Private F.S. Drysdale, Rifles; Private A.J.G. Holt, Rifles and Stoker 1st Class C. F. Anscombe, HMS Cadmus. Three Britons and one German were wounded but survived the attack, as did eight [Royal Army Medical Corps](/wiki/Royal_Army_Medical_Corps) personnel in the camp hospital, including one who managed to escape under heavy fire to raise the alarm. The mutineers tried to persuade the Germans to join them, but many of the latter were shaken by the sudden violence and reluctant to do so. Some German sailors and reservists wanted to join with the mutineers, but the majority adopted a neutral stance, refusing to accept rifles from the Indians. Thirty-five Germans escaped but the rest remained in the barracks. As it was the middle of the [Chinese New Year](/wiki/Chinese_New_Year), most of the Chinese Volunteers Corps were on leave, leaving Singapore almost defenceless against the mutiny. The British government was caught unprepared, and other mutineers went on a killing spree at [Keppel Harbour](/wiki/Keppel_Harbour) and [Pasir Panjang](/wiki/Pasir_Panjang), killing 19 European and local civilians. [Martial law](/wiki/Martial_law) was imposed and every available man from [HMS *Cadmus*](/wiki/HMS_Cadmus_(1903)) went ashore to join with British, Malay and Chinese Volunteer units and the small number of British regular troops forming part of the garrison. British [Vice-Admiral](/wiki/Vice-Admiral) Sir [Martyn Jerram](/wiki/Martyn_Jerram) sent a radio message requesting help from any allied warships nearby. A group of mutineers laid siege to the bungalow of the commanding officer of the 5th Light Infantry, Lieutenant-Colonel E. V. Martin, which effectively blocked the route into Singapore Town. Martin and a detachment of the hastily mobilised Malay States Volunteer Rifles held out through the night of the 15th, under sporadic fire. Loyal sepoys who tried to join them were ordered to \"go to a safe place\" to prevent them from being confused in the dark with mutineers. With daylight, the defenders were successful in retaking the regimental barracks, at the cost of one killed and five wounded. The mutineers scattered, and despite sniper fire, the general population stayed calm while volunteers, sailors and marines fought sporadic skirmishes with the mutineers. ### Malay States Guides Attached to the 5th Light Infantry at Alexandra Barracks were a detachment of 97 Indian officers and men of the Malay States Guides (MSG) Mule Battery. Raised in 1896 for the internal garrisoning of the Federated Malay States, the regiment was recruited from Sikhs, Pathans and Punjabis in both India and Malaya. The British officer commanding the battery was shot dead by an unknown sniper as he hastened to the gun park. The MSG gunners then dispersed when a large body of 5th Light Infantry mutineers approached their lines. The MSG artillery pieces were abandoned but not brought into action by the mutineers. Seven men of the MSG were subsequently arrested in Outram Road, Singapore while they were carrying rifles, which had been fired. They were court-martialed and sentenced to a year in prison. ### Killing of civilians Among the civilian fatalities during the mutiny were thirteen British men; one British woman, Mrs. G.B. Woolcombe (her death was later assumed by the British authorities to have possibly been unintended); two Chinese women; one Chinese man; and two Malay men. The fact that only one British woman was killed was often ignored in the reports that followed the mutiny. For instance, in a long letter detailing her experience during the mutiny, a British woman who was an eyewitness to the incident misleadingly wrote in to *The Times* that the sepoys had \"deliberately shot at every European man or woman they saw\" and that \"21 English men and women were buried yesterday\" (26 March 1915). Sir Evelyn Ellis, a member of the Legislative Council in Singapore and of the official court of enquiry that investigated the mutiny, publicly described the revolt as \"part of a scheme for the murder of women and children\". More than 15 years later, in 1932, a journalist in Penang, George Bilainkin, wrote that during the mutiny, the sepoys had \"knifed and shot white men and women indiscriminately\". ## Final suppression On 17 February, the French cruiser *[Montcalm](/wiki/French_armoured_cruiser_Montcalm),* followed by the Russian auxiliary cruiser *Orel* and Japanese warships *[Otowa](/wiki/Japanese_cruiser_Otowa)* and *[Tsushima](/wiki/Japanese_cruiser_Tsushima)* arrived. Seventy-five Japanese sailors, 22 Russians and 190 French marines were landed to round up mutineers who had taken refuge in the jungle to the north of Singapore. They were joined in this operation by 60 soldiers of the 36th Sikhs who were passing through Singapore, plus Singaporean police, British sailors and Malay States Volunteer Rifles. Lacking strong leadership, the mutiny had started to lose direction – a large number of the mutineers surrendered immediately, and the rest scattered in small groups into the jungles. Many tried to cross the [Strait of Johore](/wiki/Strait_of_Johore), but were quickly rounded up by the Royal Johor Military Force. While local media spoke of serious battles there were in fact only minor skirmishes between the allied landing parties and the now demoralized mutineers. By the evening of 17 February, 432 mutineers had been captured. On 20 February, companies of the [1st/4th Battalion, King's Shropshire Light Infantry (Territorials)](/wiki/King%27s_Shropshire_Light_Infantry) arrived from Rangoon to relieve the sailors and the marines. They succeeded in quickly rounding up the last of the mutineers. ### Russian role and reservations News of the mutiny reached the Russian Consul-General in Singapore, N.A. Rospopov, on the morning of 16 February 1915 through a Russian citizen who was a patient at a charity hospital in Singapore. As offices were closed for the Chinese New Year and the town was in a state of siege, Rospopov had difficulty finding formal and conclusive information about the mutiny through official sources. It was only a day later, on 17 February, that the Russians, having been advised by their Japanese allies, dispatched the *Orel* to assist the British in putting down the mutiny. It was only on the 18 February that Rospopov eventually received a telegram from the Ministry of Foreign Affairs and another from the Commander of the Russian Pacific Squadron, Admiral Schulz (Шульц, Максимилиан Фёдорович [ru]), instructing the *Orel* to depart quickly for Singapore from Penang and to exercise \"extreme caution and military preparedness en route\". The *Orel* brought with it 40 men, 2 machine-guns, and a doctor. Within 15 minutes of its arrival, the Russians were preparing for military action at the end of the railway line in the northern part of Singapore to intercept any fleeing mutineers. The Russians were successful in capturing an estimated 180 mutineers. On 25 February a detachment of 22 Russian sailors had skirmished with sepoys. The latter dispersed but later that evening exchanged heavy fire with a [picket](/wiki/Picket_(military)) of five Russians, wounding two. As a result of the incident, published works on the 1915 mutiny described that the Russians \"among all the Allies ... had the closest encounter with near disaster avoided\". Besides military involvement, the *Orel* also temporarily provided shelter for some of the residents who had evacuated the town. Rospopov reported on the 21 February that the *Orel* had to unexpectedly take in 42 women and 15 children aboard as a fire had broken out on board their other ship. Although the Russians were quick to come to the aid of the British, the Anglo-Russian relationship was fraught with an underlying sense of distrust rooted in a long-standing history of competition. Just decades before the mutiny of 1915, Russia and Britain were already locked in imperialist rivalry. Spurred by the last tsar's Asiatic Mission and his visit to South East Asia as part of [his world tour of 1891](/wiki/Eastern_journey_of_Nicholas_II), the Russian government appointed its first ethnic-Russian Consul, V. Vyvodtsev, to Singapore as early as 1890. The Russian presence in Southeast Asia during the last quarter of the 19th century was meant not only to safeguard its economic and strategic position in China but also to carefully observe the designs and advances of its imperialist rivals in the region, foremost among them being the British empire. Anglo-Russian relationship took a turn for the worse during the latter half of the 19th century when both Britain and Russia were locked in competition for Afghanistan and Persia as well as when Britain halted Russian advancement into the Balkans and Turkey. Britain's alignment with Japan as an ally worsened Anglo-Russian relationship with the outbreak of the Russo-Japanese war of 1904–05. This history of suspicion and rivalry explains why Rospopov sent a secret telegram on 21 February expressing his reservations at placing the *Orel* and its accompanying men and guns under the command of the British military in Singapore. Eventually the French admiral was able to assuage the fears of Rospopov and assured him that Russian aid at this point would serve as a good means to strengthen Anglo-Russian relations. When the mutiny was finally quelled, the Russian captain Vinokurov reportedly remarked to the British Governor to Singapore that the Russian assistance in suppressing the mutiny \"would unite the two countries better than any treaty\". ### Japanese role and reservations On 16 February 1915, the Third Squadron of the Japanese Navy received a telegram from the Military Attaché Araki Jiro via Ma-Kung in the Formosa Straits (the main base of the Squadron) requesting Japanese help. The *Otowa* and *Tsushima* were sent immediately for Singapore. Although help was sent and well received by the British Navy in Singapore, the Japanese Navy was hesitant about doing so initially. Commanding Officer of the Third Squadron, Rear Admiral Tsuchiya Mitsukane apparently expressed his displeasure in dispatching help as he believed that being a signatory of the [Anglo-Japanese Alliance](/wiki/Anglo-Japanese_Alliance), Japan should not interfere in the internal affairs of another country without attaching collateral conditions. Also, Tsuchiya had recalled how a British ship once anchored at [Chilung](/wiki/Chilung) had refused to help put down a Taiwanese revolt against Japan. Seeing that he had no choice but to follow orders from the Japanese Government and Naval Headquarters, Tsuchiya secretly advised his land forces not to kill or wound any sepoy intentionally but to simply encourage them to surrender as the former had no enmity with the latter. According to The General Staff of the British Military Headquarters, \"in reality the Japanese did not do much...and it was found desirable to disband them as early as possible\". This was apparently in reference to the organisation by their consul-general of 190 armed special constables from the Japanese community in Singapore. However, from the point of view of Japanese politicians, Japan's involvement in suppressing the mutiny was also a form of projecting Japanese power and strength in the region. ## Inquiry and public executions On 23 February 1915, a Court of Inquiry, headed by Brigadier-General [F. A. Hoghton](/wiki/Frederick_Aubrey_Hoghton), was held, at first meeting *in camera* but then in public sessions. It prepared a 450-page report dated 15 May 1915. Although extensive discord amongst both officers and men of the 5th Light Infantry was identified, the cause of the mutiny was not conclusively established. The focus of the report was on possible external German influences, plus internal regimental causes of the mutiny. More than 205 sepoys were tried by [court-martial](/wiki/Court-martial), and 47 were publicly executed, including Kassim Mansoor. Most soldiers killed were Muslims from the [Hisar district](/wiki/Hisar_district) and [Rohtak district](/wiki/Rohtak_district) of current [Haryana](/wiki/Haryana) state of India. Nur Alam Shah was not put on trial, although he was exposed as an active Indian nationalist with links to Ghadar. Instead, he was detained and deported, as the British did not want to stir up trouble among their Muslim subjects. Sixty-four mutineers were transported for life, and 73 were given terms of imprisonment ranging from seven to 20 years. The public executions by firing squad took place at [Outram Prison](/wiki/Outram_Prison), and were witnessed by an estimated 15,000 people. *[The Straits Times](/wiki/The_Straits_Times)* reported: > An enormous crowd, reliably estimated at more than 15,000 people, was packed on the slopes of Sepoy Lines looking down on the scene. The square as before was composed of regulars, local volunteers and Shropshire under the command of Colonel Derrick of the Singapore Volunteer Corps (SVC). The firing party consisted of men from the various companies of SVC under Captain Tongue and Lieutenant Blair and Hay. The remnants of the 5th Light Infantry, numbering 588 sepoys plus seven British and Indian officers, left Singapore on 3 July 1915 to see active service in the [Cameroons](/wiki/Cameroons) and [German East Africa](/wiki/German_East_Africa). They were not accompanied by Colonel Martin, who was heavily criticised by a court of inquiry and then retired from the Army. In 1922 the 5th Light Infantry was disbanded. Much the same fate befell the [Malay States Guides](/wiki/Malay_States_Guides); they were sent to [Kelantan](/wiki/Kelantan) in [Malaya](/wiki/British_Malaya) to quell [Tok Janggut](/wiki/Tok_Janggut)'s uprising at [Pasir Puteh](/wiki/Pasir_Puteh) in April 1915. Afterwards the Guides were sent to fight in Africa and were disbanded in 1919. ## Causes ### Ineffectiveness of commanding officer The specifically military grievances that led to the mutiny of the 5th Light Infantry centred on the personality of the commanding officer at the time, Lieutenant-Colonel E. V. Martin. He had been promoted from major in the regiment, but the previous colonel had reported that he was unpopular with his fellow officers and that he inspired little respect among the men. His appointment led to disunity amongst the British officers, which was reflected by division among the Indian officers over the promotion to commissioned rank of a colour-havildar. The issues, which might, under ordinary circumstances, have been of limited impact, were aggregated by the disruptive external influences of the Ghadar Party propaganda noted above and the entry of Turkey into the war. According to the Court of Inquiry, 'the prime cause of this lamentable episode' was the responsibility of Colonel Martin. Described as a \"loner\" for whom officers had little respect, Martin's primary fault was that he was too trusting, to the point of naivety. While he cared for the welfare of his men and saw that their living conditions were improved, he was described as being too much of a \"soldier’s friend\", to the point that other British officers found that this attitude and work ethic of Martin's severely undermined their authority over the sepoys. Over time, that served to erode the respect that the British officers and even the sepoys had for him. Colonel Egerton at the India Office commented that the British officers serving under Colonel Martin were comparable to \"sheep without a shepherd\", avoiding and avoided by Martin whom they should have looked to for guidance. The sepoys were accused of deftly noticing this discontent and disunity among their British officers and then taking advantage of it to mutiny. ### Role of pan-Islamism Within less than a week of the mutiny, a Court of Inquiry was set up to investigate and collect evidence for the trial for the mutineers. Although the Court of Inquiry was meant to take place behind closed doors, in accordance with standard military procedures, the proceeding was held in public instead. According to Harper and Miller this was to give the public the impression that the mutineers “were being tried for mutiny and shooting with intent to kill and not, as alleged for refusal to go to the Ottoman Empire\". Although the Court of Inquiry was clearly trying to downplay the link between Turkey and the mutiny, with the declassification of new documents and evidence, another perception has emerged in explaining the cause of the mutiny and that is the role of pan-Islamism. Contrary to official British colonial authorities, the mutiny was not an isolated case of a purely local affair but was instead part of a wider anti-British and pro-Muslim battle. When Turkey decided to join in the war on the side of the Central Powers (Germany, Austria-Hungary and Italy), the Ottoman Sultan, Mehmed V. Reshad (1844–1918) declared a jihad against the Allied Powers (Britain, France and Russia) and issued a fatwa calling on Muslims all around the world to throw their lot with the Caliphate. This move had a huge impact on Muslims throughout the world as the Ottoman Sultan was revered as the Caliph of Islam and long considered by Indian Muslims as the final bulwark of Muslim power following the collapse of the Mughal empire in India. Overnight, Muslims serving under the British Army, such as the sepoys, faced an existential dilemma and their loyalty being torn between their ummah (community, brotherhood) and their British colonial superiors. For the Muslim sepoys in the 5th Light Infantry, interaction with Kasim Mansur, who was an Indian Muslim merchant in Singapore, served to fuel this sense of divided loyalties further. Kasim Mansur together with a local imam, Nur Alam Shah, would often host members of the 5th Light Infantry at Mansur's home and it was then that the duo persuaded the Muslim sepoys to adhere to the fatwa issued by the Ottoman Sultan. They were encouraged to turn their guns against their British commanding officers and contribute towards the war against the kafirs who were battling Muslim brothers who were defending the Caliphate in the West. It was within this context that the plan was hatched for the mutiny. ### Global connection It is difficult to identify any one reason as being the main cause or catalyst of the mutiny. However, a recent perspective has emerged of the role of global connections. The mutiny had revealed the permeable nature of colonial boundaries and the way that external influences affected the [British possessions](/wiki/British_possessions) in Southeast Asia. The sepoys of the 5th Light Infantry were constantly receiving information about what was happening outside Singapore. The British Court of Inquiry speculated that as the news of the fatwa issued by the Ottoman Sultan spread, an anti-British movement spearheaded by the [Ghadar Party](/wiki/Ghadar_Movement) was also disseminating special pamphlets in a variety of languages which were reaching the sepoys through secret channels. Acrimonious slogans against the British only fuelled the anti-colonial sentiment among the sepoys. Some of the slogans were “the wicked English and their allies are now attacking Islam, but the German Emperor and the Sultan of Turkey have sworn to liberate Asia from the tyranny. Now is the time to rise.... Only your strength and religious zeal are required”. The sepoys were clearly being bombarded with a lot of anti-British sentiments while being stationed on the small island of Singapore. However, Ghadar sources in the United States of America revealed that there was very little evidence to connect the Singapore Mutiny to the Ghadar Party itself, and even though the Ghadar Party did seek to take credit for the mutiny after the event, the Ghadar Party headquarters in San Francisco had so little contact with the accused in the ensuing trials that its publications were reporting that the \"Indians of Singapore were still executing the British\" and that \"some of the portion is under the possession of the Ghadar party\" as late as April 1915. There was also awareness in Singapore of the [Komagata Maru incident](/wiki/Komagata_Maru_incident) in which Canadian authorities refused to allow a ship with 376 Indian passengers to land and forced them to stay aboard for two months in difficult conditions. On its way back to India, while the ship docked in Singapore, the Governor-General of Singapore remarked that “though the ship had no communication with the land, yet it left a bad effect” on the Indian troops stationed there. It appears that information was reaching the sepoys through a wide range of channels, from origins as diverse and distant as North America, Britain, the Ottoman Empire and India. Much of this information was obtained locally, but even so it was being mediated through a host of international and external actors, including a wide array of Indians from across the subcontinent, British officers and Arab and Malay co-religionists. ## Aftermath ### Setting up of Special Branch Unit and other related initiatives The 1915 mutiny was a watershed event in the way that the British viewed security in their Malayan colonies. More importance than ever was placed on political intelligence, espionage, and the surveillance of potential subversives. Following the mutiny, a political intelligence bureau was established in Singapore under direct command and control of Major General Dudley Howard Ridout, General-Officer-Commanding (GOC) Singapore. This eventually paved the way for the formation of the [Criminal Intelligence Department](/wiki/Security_and_Intelligence_Division) ([Special Branch](/wiki/Special_Branch#Singapore)) set up in 1919. Other institutions were also formed with the purpose of providing feedback and monitoring activities on the ground. To enhance the protection of its crown colony further from internal skirmishes and attacks, in August 1915, the legislative council passed the Reserve Force and Civil Guard Ordinance. This was the first Act passed in a British colony which imposed compulsory military service on all male subjects between the ages of 15 and 55 who were not in the armed forces, volunteers, or police. Additionally, a Reserve force in the Volunteer Corps was created for fit men over the age 40. From the slew of new initiatives enforced, it was clear that the British had taken the debacle of the mutiny as a serious lesson to learn from and to prevent from happening again. ### In literature Currently, there are only two fictional works in English that deal with the subject of the Singapore mutiny. The first is Isobel Mountain's novel, *A Maiden in Malaya*, written shortly after the mutiny in 1919. The other is *Rogue Raider: The Tale of Captain Lauterbach and the Singapore Mutiny*, written in 2006. The two stories deal with very different narratives. In Mountain's novel, the plot revolves around a romance between the protagonist Elizabeth Tain and Peter Fenton, a rubber planter. The author projects the mutineers in a standard imperial or colonialist interpretation, with the mutineers being painted in wholly unattractive colours, with no redeeming qualities while hinting at their lustful nature. Mountain's representation of the sepoys can be considered an echo of the colonial reportage of the rogue sepoys. Barley, however, took on a humorous tone and revolved around the adventures of the Captain Julius Lauterbach of the German Imperial Navy. The humorous nature of the book underplays and potentially undermines the actual set of events. Supported by the [Singapore Film Commission](/wiki/Media_Development_Authority#Singapore_Film_Commission) and the Singapore High Commission in India, [Daljit Ami](/wiki/Daljit_Ami) made an [Objectifs Residency](/wiki/Objectifs#Residency)-sponsored 2017 feature-length documentary *Singapore Mutiny – A Reclamation* in English and *Saada Singapore* in Punjabi. ## Commemoration To commemorate the event and the British soldiers and civilians killed during the mutiny, two memorial [tablets](/wiki/Memorial_Plaque) were erected at the entrance of the [Victoria Memorial Hall](/wiki/Victoria_Memorial_Hall) and four [plaques](/wiki/Commemorative_plaque) in [St Andrew's Cathedral](/wiki/St_Andrew%27s_Cathedral,_Singapore). In addition, three roads were later named in memory of three of the casualties as Walton Road, Harper Road, Holt Road, after Gunner Philip Walton of the Singapore Volunteer Artillery, Corporal J. Harper and Private A.J.G. Holt respectively. - Indians in Singapore - [Indian National Army in Singapore](/wiki/Indian_National_Army_in_Singapore) - [Indian Singaporeans](/wiki/Indian_Singaporeans) - [History of Singaporean Indians](/wiki/History_of_Singaporean_Indians) - Context - [History of Indian influence on Southeast Asia](/wiki/History_of_Indian_influence_on_Southeast_Asia) - [Indian diaspora](/wiki/Indian_diaspora) - [Indianisation](/wiki/Indianisation) ### Notes ### Bibliography - Barley, Nigel (2006). *Rogue Raider – The Tale of Captain Lauterbach and the Singapore Mutiny*. Singapore: Monsoon Books. [ISBN](/wiki/ISBN_(identifier)) 978-981-05-5949-6. - Comber, Leon (2009). \"The Singapore Mutiny (1915) and the Genesis of Political Intelligence in Singapore\". *Intelligence and National Security*. **24** (4): 529–41. [doi](/wiki/Doi_(identifier)):10.1080/02684520903069462. [S2CID](/wiki/S2CID_(identifier)) 154217090. - Harper, R. W. E. & Miller, Harry (1984). *Singapore Mutiny*. Singapore: Oxford University Press. [ISBN](/wiki/ISBN_(identifier)) 978-0-19-582549-7. - \"Indian Mutiny in Singapore, 1915: People who Observed the Scene and People who Heard the News\" (PDF). *New Zealand Journal of Asian Studies, volume 11, No. 1*. June 2009. Archived from the original (PDF) on 13 January 2015. Retrieved 18 February 2013. - \"Vivid Story of Singapore Mutiny\". *The New York Times*. 2 May 1915. p. 7.\n",
  "language": "en",
  "processed_at": "2026-01-12T09:46:49.050899",
  "title": "1915 Singapore Mutiny",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/1915_Singapore_Mutiny"
}