{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:46:57.245238"
  },
  "content": "1954 civil unrest in Singapore**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **is written like a personal reflection, personal essay, or argumentative essay** that states a Wikipedia editor's personal feelings or presents an original argument about a topic. Please help improve it by rewriting it in an encyclopedic style. *(March 2021)* *(Learn how and when to remove this message)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"1954 National Service riots\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(March 2021)* *(Learn how and when to remove this message)*This article cites its sources **but does not provide page references**. Please help improve it by providing page numbers for existing citations. *(April 2019)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)*Part of a series on the[History of Singapore](/wiki/History_of_Singapore)[Early history](/wiki/Early_history_of_Singapore) (pre-1819)[Srivijaya](/wiki/Srivijaya)650–1377[Temasek](/wiki/Temasek), [Long Ya Men](/wiki/Long_Ya_Men), [Ban Zu](/wiki/Ban_Zu)c.14th century[Kingdom of Singapura](/wiki/Kingdom_of_Singapura)1299–1398[Majapahit](/wiki/Majapahit)1398–1400[Malacca Sultanate](/wiki/Malacca_Sultanate)1400–1528[Johor Sultanate](/wiki/Johor_Sultanate)1528–1819British colonial era (1819–1942)[Founding](/wiki/Founding_years_of_modern_Singapore)1819–1826[Straits Settlements](/wiki/Singapore_in_the_Straits_Settlements)1826–1867[Crown colony](/wiki/Singapore_in_the_Straits_Settlements#Crown_colony_(1867–1942))1867–1942[Japanese Occupation](/wiki/Japanese_occupation_of_Singapore) (1942–1945)[Fall of Singapore](/wiki/Fall_of_Singapore)1942[Sook Ching](/wiki/Sook_Ching)1942[Double Tenth incident](/wiki/Double_Tenth_incident)1943[Post-war period](/wiki/Colony_of_Singapore) (1945–1962)[First Legislative Council](/wiki/History_of_Singapore#First_Legislative_Council_(1948–1951))1948–1951[Maria Hertogh riots](/wiki/Maria_Hertogh_riots)1950[Second Legislative Council](/wiki/History_of_Singapore#Second_Legislative_Council_(1951–1955))1951–1955Anti-National Service Riots1954[Internal self-government](/wiki/Self-governance_of_Singapore) (1955–1963)[Hock Lee bus riots](/wiki/Hock_Lee_bus_riots)1955[Singapore Glass Factory strikes](/wiki/Singapore_Glass_Factory_strikes)1960[Pulau Senang prison riots](/wiki/Pulau_Senang_prison_riots)1963[Merger with Malaysia](/wiki/History_of_the_State_of_Singapore_(Malaysia)) (1963–1965)[Singaporean referendum](/wiki/1962_Singaporean_integration_referendum)1962[Operation Coldstore](/wiki/Operation_Coldstore)1963[Race riots in Singapore](/wiki/1964_race_riots_in_Singapore)1964[MacDonald House bombing](/wiki/MacDonald_House_bombing)1965[Republic of Singapore](/wiki/History_of_the_Republic_of_Singapore) (1965–present)[ASEAN Declaration](/wiki/ASEAN_Declaration) ([ASEAN](/wiki/Association_of_Southeast_Asian_Nations))1967[1969 race riots of Singapore](/wiki/1969_race_riots_of_Singapore)1969[Laju incident](/wiki/Laju_incident)1974[Operation Spectrum](/wiki/Operation_Spectrum)1987[Asian financial crisis](/wiki/1997_Asian_financial_crisis#Singapore)1997[Embassies attack plot](/wiki/Singapore_embassies_attack_plot)2001[H1N1 pandemic](/wiki/2009_swine_flu_pandemic_in_Asia#Singapore)2009–2010[Bus drivers' strike](/wiki/2012_Singapore_bus_drivers%27_strike)2012[Little India riot](/wiki/2013_Little_India_riot)2013[2018 North Korea–United States Singapore Summit](/wiki/2018_North_Korea%E2%80%93United_States_Singapore_Summit)2018[COVID-19 pandemic](/wiki/COVID-19_pandemic_in_Singapore)2020–2022By topic - [Timeline](/wiki/Timeline_of_Singaporean_history) - [Riots](/wiki/List_of_riots_in_Singapore) - [Military](/wiki/Military_history_of_Singapore) Singapore portal - v - t - e In December 1953, the British colonial government in [Singapore](/wiki/Colony_of_Singapore) passed the [National Service Ordinance](/wiki/National_service_in_Singapore), requiring all male British subjects and Federal citizens between the ages of 18–20 to register for part-time National Service. The deadline for registration was on 12 May 1954 and those who failed to register would be either jailed or fined. On 12 May 1954, students from the Chinese Middle Schools did not register themselves for National Service. In light of the impending deadline for registration and with requests from the Chinese students, [Chief Secretary](/wiki/Chief_Secretary,_Singapore) [William Goode](/wiki/William_Allmond_Codrington_Goode) would later meet representatives from the affected student body in the government house on 13 May 1954. On 13 May 1954, students gathered to present their petition to Chief Secretary William Goode. However, the peaceful [demonstration](/wiki/Demonstration_(protest)) turned into a clash between the police and students. More than 2 dozen people were injured and 48 students were arrested. The demonstration of 13 May 1954 was followed by further demonstrations and proved a key moment in galvanising popular opposition to colonial rule. ## Background Following the end of the Japanese Occupation in 1945, the British sought to regain political control over Singapore, which was a vital strategic centre to them. The British Military Administration was set up, focusing on the reorientation of the state in order to meet post-war crises. The British set sights to bolster social and economic life, and to secure their footing in Singapore. Of the social programmes that the government laid out, the most far-reaching and critical was education. The British envisioned setting up \"national schools\", prioritising English-medium education and undermining vernacular education. With that, Chinese schools were starved of funding, resulting in anger and resentments among the Chinese students and teachers. This led to a rise in anti-colonial sentiments. This growing anti-colonial sentiment was further fuelled by the larger anti-colonial sentiment that was also happening outside Singapore. Winning freedom for colonies in Africa and Asia played a part in instilling hope in the progressive left in Singapore, that independence may come one day. In 1948, the outbreak of communist insurrection in the Malayan jungles saw the declaration of emergency in Singapore. The declaration of emergency, which was to last for almost a decade, saw heightened security control. Singapore was turned into a police state; progressives and anti-colonial activists were rounded up; and political repression suspended all forms of left-wing politics in Singapore. While organised opposition to colonial rule was difficult, the period was nevertheless plagued with social discontent and stirrings of anti-colonial and nationalistic sentiments, in view of the British's plan to consolidate and maintain rule following the Japanese occupation. ## 13 May 1954 In December 1953, the National Service Ordinance was passed, requiring the registration of all male British subjects and Federal citizens between the ages of 18-20 for part-time military training. After the announcement was made regarding the National Service draft, personnel involved were to register for the call-up from 8 April to 12 May 1954. By 12 May 1954, students from the Chinese Middle Schools still did not register themselves for National Service (NS). In light of the impending deadline for registration and with requests from the Chinese students, Chief Secretary William Goode would meet representatives from the affected student body in the government house on 13 May 1954. This day however, resulted in a clash between Chinese Middle School students and riot squads. More than two dozen were reportedly injured and nearly 50 students were arrested. Of those arrested, 7 were convicted of obstructing the police. Following the riot, students re-assembled in Chung Cheng High School and only dispersed in the afternoon on 14 May 1954. On 18 May 1954, a delegation of students (the 55-member Chinese Middle Schools Student Delegation) met the Chinese Chamber of Commerce (CCC), requesting the CCC's help to speak to the British government on their behalf. However, the only concrete result from this meeting was having their school holidays being pushed forward by 2 weeks to deny students the opportunity to rally together. Having their school holidays pushed forward, this action prompted a second massive sit in by the students which took place on 23 May 1954 in Chung Cheng High School. However, due to the prevention of food supplies from reaching these students, the group dispersed. The third massive sit in took place in the Chinese High School on 2 June 1954. This time, students requested for the postponement of call-up for National Service. Though, the lack of response from the government saw the students going on hunger strike on 15 June. The students only dispersed on 24 June. Constant negotiations were made back and forth between the students and the government in the following days. However, due to the resistance put up by the students, the attempt to recruit male youths for National Service took a back seat. The aftermath of 13 May 1954 resulted in the conviction of 8 students for obstructing the police during the demonstration, as well as further tightening of control over the students by the British. ## Interpretations of 13 May 1954 Different historical interpretations have been taken to the incidents occurring on and following 13 May 1954. The incidents have been characterised as a communist subversion, as an Anti-Colonial Movement, and as a bottom up, spontaneous response to particular events. ### Communist subversion In the 1950s, the Chinese students were one of the largest groups involved in demonstrations. Their motivations have been consistently credited to communist manipulation – through a [united front strategy](/wiki/United_front). The united front strategy was a political tool employed by the [Malayan Communist Party](/wiki/Malayan_Communist_Party) (MCP) with aims of regathering and rebuilding their strength, which was greatly depleted in jungle fighting during the earlier years of the State of Emergency between 1948 and 1960. The strategy focused on building relations and contacts with workers, peasants and students, emphasising on how plans and arrangements should be made in order to gain mass. According to Singh (2008), the first step of this strategy was to engage students through the exploitation of communal issues. Singh quotes an MCP directive as saying: > The work of winning over the school children is very important and must not be overlooked. Especially in circumstances where the enemy is stronger than we are, the work of winning support from school children and organising them is more important than military activities. According to Lee (1996), the reason why the MCP started the mass movement from students can be attributed to two major reasons. First, the MCP recognised these Chinese students as a valuable political force and worked towards systematically absorbing them into the communist movement. Second, during this period of time, members of the Town Committee (a secret organisation operating underground as the executive arm of the Malayan Communist Party, with its mobile headquarters on the borders of Malaya and Thailand) were arrested, leaving only the cells in charge of propaganda, and cells in the Chinese Middle School, intact. The propaganda sector consisted of few people, but the student sector had many members. Thus, it was the student sector which had the manpower to launch the open united front struggle when the time came. However, in order to mobilise and arouse the students, an issue had to be capitalised upon. The National Service Ordinance was chosen to serve this purpose. In Lee's book, he also mentioned that in the eyes of the communists themselves, the agitation over national service was a great success. Lee made this statement based on a following comment by Ng Meng Chang (a student cadre): > .... said that the tremendous success of the May 13 incident was beyond expectation... this was the most successful student struggle ever since the emergency regulations... Lee also concluded by saying that the incident had seen the creation of many prospective student leaders, who were to be supported and become future pillars of the student movement. This statement was drawn from unpublished statements of ex-detainees. 13 May 1954, as Communist subversion, was seen in the context of the cold war and in supporting this position, sources from scholars such as Lee (1996) and Singh (2008) are largely drawn from colonial media. ### Anti-Colonial Movement Following the declaration of emergency in 1948, the political instability left in Singapore grew vastly, both in size and power in 1954. This was attributed to large levels of economic exploitation and the social injustice felt by the people, which then saw subsequent calls for self-governance and democracy. This was especially so for the Chinese when the decision was made by the British to prioritise English-medium education over vernacular education. That resulted in friction between the Chinese community and the British authorities. Anger and anti-colonial resentments were felt within the Chinese community, for English language represented colonial domination. In 1954, both the Chinese leadership and student activists faced further pressures when the British made English the only language to be used in the legislative assembly. The Chinese middle school students had however, also moved out of the parameters of strictly Chinese-focused issues by linking themselves to a larger historical context of anti-colonial movement. The Chinese students, together with the Socialist Club members of the University of Malaya, identified themselves with the students of China, India, and Indonesia who also played a role in their country's liberation. Both the English and Chinese-educated students were seen to be working together to resist colonial rule, and that the socialist club had a hand in organising \"13 May 1954\". This was in view that copies of the *Fajar Publication (Issue 7*) were found in the Chinese High Schools. With that, amidst the Chinese student's demonstration, the hostels of students from the socialist club were also raided by the police on 28 May 1954, and 8 members of the [University Socialist Club](/wiki/University_Socialist_Club) were charged with sedition for articles printed in the *Fajar Publication*. According to Loh (2013), this particular issue, dated 10 May 1954, and titled as \"Aggression in Asia\", was one that involved critical views on the ongoing Anglo-American Military initiative to form the Southeast Asia Treaty Organisation (SEATO). In addition, the issue also contained comments on the National Service Bill which was passed in Singapore earlier on. It argued that pressing students into military service was in no way \"national\" for it entailed \"a colonial people to be trained to fight wars in the making of which they have no part – no choice of their foes or allies. Though we are not fit to rule ourselves, we are not unfit to die for other people's interests.\" Loh bases his opinion largely from the *Fajar Publication* itself. Anti-colonial sentiment was overwhelming, but the colonial authorities looked upon them as the result of communist agitation. Common hatred of exploitation, British rule and the declaration of Emergency paved the way for \"13 May 1954\", a resistance seen to be driven by overwhelming \"leftist resentments against the British\", with the rank and file on the ground taking initiative and moving without proper direction and control. In the view of scholars like Quee, Tan & Hong and Barr, & Trocki, 13 May 1954 represented the convergence of notions of nationalism, with help from the English-educated. The student resistance was very focused and uncompromising. It was evident that they were pushing the boundaries as far as the emergency regulations would allow, and anti-colonialism was the main engine driving their cause. ### Spontaneous response to particular events The riot can also be explained as a spontaneous response to events surrounding the National Service Ordinance. Singaporean historian, [Thum Ping Tjin](/wiki/Thum_Ping_Tjin), argues that the National Service Ordinance was actually supported by the Chinese, based upon Chinese press reports that recalled the heroic defence of Singapore by volunteers in 1942. Community leaders also praised the ordinance and called upon the Chinese community to fulfill their task of defending the country.\" Thum bases his opinion largely from Chinese sources such as the *Nanyang Siang Pao, Nanfang Evening Post* and *Sin Chew Jit Poh*. In Thum's view, \"13th May 1954\" was an event triggered by the flawed implementation of the system. Some overage students had been forced to miss examinations or leave school as a result of a call up. The lack of documents sent to these young men to explain the purpose of national service caused many to believe that they would be sent into the Malayan jungle to fight for the British. Students were also turned down time and again by the government when all they wanted was to seek clarifications regarding National Service. In addition, miscommunication and translation regarding the term \"National Service\" resulted in adverse sentiments among these Chinese Middle School students for it was mistranslated as *minzhong fuwu*, 民众服务, which literally meant \"servitude by the masses\", a term with demeaning connotations implying the mass of the people acting as indentured servants of the elite. This discontent and miscommunication was further fuelled by the ineffective registration process whereby Chinese Middle School students were provoked by the disruptive and authoritative conduct of the government team, who sent teams into Chung Cheng High School without warning, and went from class to class to distribute registration forms, disrupting lessons. Teachers who refused to halt their lessons were also forced to leave the classrooms, leaving students outraged and refusing to register for national service. This episode was repeated again on 23 April 1954 at the Chinese High School. On 13 May 1954 itself, representatives from the affected students made preparations to meet William Goode in government house to negotiate the ordinance. The crowd (approximately 1000 people) that assembled in the vicinity of the government house to give their support were actually students from the Chinese inter-schools sports competition — just a 30-minute walk away at [Jalan Besar Stadium](/wiki/Jalan_Besar_Stadium) via Serangoon Road and Bukit Timah Road. The students were there to await the outcome of the meeting, and it was not a planned protest. In the days following 13 May 1954, tensions arose due to the \"difficulties posed to the students by the Governor\", when all that the students wanted was a form of written assurance for the postponement of national service for all students who are still schooling. According to Thum, once again drawing his opinions from Chinese sources, the process of appeal was made difficult for the students. For instance, their first petition was returned to them unopened because it was not submitted through \"proper channels\". With that, the students resubmitted their petition by registered mail however, the petition was again, returned to the students with the instruction that petitions from students should be submitted through the principal and management committee of their school. This was done, but there was no reply from the government once again. ## Significance of 13 May 1954 The aftermath of 13 May 1954 saw the formation of the Singapore Chinese Middle School Students Union (SCMSSU), and it was under the banner of SCMSSU that the 1950s saw more intense left-wing activities, for example, the [Hock Lee Bus riots.](/wiki/Hock_Lee_bus_riots) 13 May 1954 also has a crucial significance in the politics in Singapore, for it was this event that enforced unity between students, labour workers and the People's Action Party (PAP), then led by [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) and leftist trade union leaders [Lim Chin Siong](/wiki/Lim_Chin_Siong) and [Fong Swee Suan](/wiki/Fong_Swee_Suan). The Chinese students' engaged Lee, then a practising lawyer, to defend the seven students who were charged for obstructing the police on 13 May 1954. Prior to this, Lee was also involved in fighting the case for the Fajar 8. Although the seven students were eventually still sentenced to three months imprisonment, this episode allowed Lee to build connections with the Chinese (especially the students and trade union workers), a group that was crucial in supporting his victory in the 1959 elections. The 1959 election was the first full internal self-government granted by the British authority, and the People's Action Party led by Lee won 43 out of 51 seats in the legislative assembly, forming the government. However, this landslide victory would not have been possible without the support from the Chinese community, especially that of the labour unions, as the Chinese made up the majority population in Singapore. The PAP appealed to the Chinese community by promoting workers' rights and establishing policies that aimed to abolish Emergency Regulations, putting an end to colonialist exploitation. This was important for the Chinese community who had then been fighting for their place throughout colonial ruling. - [Chinese Middle School Riot](/wiki/Chinese_middle_schools_riots) - [Hock Lee Bus Riots](/wiki/Hock_Lee_Bus_Riots) - [List of riots in Singapore](/wiki/List_of_riots_in_Singapore) - [Operation Coldstore](/wiki/Operation_Coldstore)\n",
  "language": "en",
  "processed_at": "2026-01-12T09:46:57.244703",
  "title": "1954 National Service riots",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/1954_National_Service_riots"
}