{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:48:13.078963"
  },
  "content": "1989 murder of a coffeeshop caretaker at Beach Road, Singapore On 2 February 1989, in a coffeeshop in [Yishun](/wiki/Yishun), [Singapore](/wiki/Singapore), 65-year-old coffeeshop caretaker **Ang Chye** ([Chinese](/wiki/Simplified_Chinese_characters): 洪财; [pinyin](/wiki/Pinyin): *Hóng Cái*) was murdered. Three men were arrested for the murder and later acquitted in 1992, and another man was later arrested and convicted of the murder. The three former suspects sued the government and an investigating police officer for false arrest and malicious prosecution; however their claims were dismissed. ## Murder and initial investigations On 2 February 1989, a shop assistant reported to work at a coffeeshop at Block 780 Yishun Ring Road at about 6 am. He discovered the body of the coffeeshop caretaker Ang Chye lying face upwards and covered in blood. Ang had died of multiple stab wounds which were believed to be inflicted by a screwdriver. Ang's bicycle was found thrown near the food stall. The murder was believed to have taken place several hours earlier, when Ang was working his night shift. About $2,000 cash, several cartons of cigarettes and about five crates of beer and stout from the shop, as well as Ang's $600 cash, watch, bank book and identity card were reported missing. Over the next few weeks, through the [Lunar New Year](/wiki/Lunar_New_Year) festive season, police interviewed over 50 persons living in the surrounding Yishun housing estate. This led to the arrest of four suspects, Zainal Kuning, brothers Salahuddin Ismail and Mohamad Bashir Ismail, and Abdul Hannan bin Ahmad, who were all charged with murder. According to Abdul Hannan's confession, he was the lookout man in the burglary and the other three had entered the coffeeshop. The murder charge against Abdul Hannan was subsequently reduced to housebreaking, leaving the three to stand trial for Ang's murder. ## Trial proceedings ### Trial of Zainal, Salahuddin and Mohmad Bashir On 2 March 1992, Zainal Kuning, Salahuddin Ismail and Mohmad Bashir Ismail stood trial for the murder of Ang Chye. The prosecution was led by Deputy Public Prosecutor (DPP) [Bala Reddy](/wiki/Bala_Reddy), Zainal was represented by [J B Jeyaretnam](/wiki/J._B._Jeyaretnam), Salahuddin by B. Ganesh, and Mohmad Bashir by M. Amaladass. The trial judges were Justice [T. S. Sinnathuray](/wiki/T._S._Sinnathuray) and Judicial Commissioner M P H Rubin. The prosecution relied on the evidence of Abdul Hannan, who confessed to being the lookout man, and the investigating officer Assistant Superintendent (ASP) Michael Chan Sin Mian. The defence argued that Zainal, Salahuddin and Mohmad Bashir were not even present at the crime scene. On 2 April, the murder charge against Mohmad Bashir was reduced to housebreaking. Jeyaretnam informed the trial judges that he intended to call Inspector Lau Yeow Khoon, a police fingerprint expert, as a witness to support his stand that a Mohamed Sulaiman Samsudin was the actual culprit in the case. Sulaiman had allegedly told some people at a void deck that he was involved in a robbery and a killing at a coffee shop, and showed them scald marks on his body caused by the victim throwing hot water at him. Sulaiman denied this when he was summoned to court. He also completely denied he had been to the Yishun coffee shop at all and that the fingerprints on the crate were his. Inspector Lau testified that two fingerprints left on a beer crate at the crime scene matched Sulaiman and not any of the three accused. In view of the new evidence, DPP Reddy dropped all charges against the three accused. Justice Sinnathuray acquitted them of all charges, citing that the identification of the fingerprint as Sulaiman's has cast reasonable doubt on the prosecution's evidence. Abdul Hannan, who had implicated the three in the case and completed a 14-month prison term for housebreaking, was investigated for giving false evidence. ### Trial of Sulaiman The prosecution consisted of DPP Lim Yew Jin and DPP Malcolm B.H. Tan. Sulaiman was assigned defence counsel M. N. Swami and Victor Yip, and the trial judge was Justice S. Rajendran. Sulaiman intended to plead guilty to his charge of murder; however the courts do not accept guilty pleas for capital cases. Pathologist professor [Chao Tzee Cheng](/wiki/Chao_Tzee_Cheng) testified that the stab wounds could have been caused by a screwdriver, an ice pick or a crowbar. As some of the wounds were clustered, they could have been caused when Ang was restrained or unconscious. Sulaiman testified that he and his accomplice Jahpar Osman had broken into the shop to steal from it when Ang saw him and threw hot water at him. He realised he was holding a screwdriver and used it to attack him. On 16 February 1994, Sulaiman was found guilty of murdering Ang and was [sentenced to death](/wiki/Capital_punishment_in_Singapore). ## Lawsuit After their acquittal, Zainal Kuning, Salahuddin Ismail and Mohmad Bashir Ismail sued the government as well as the investigating officer ASP Michael Chan. The plaintiffs were represented by J. B. Jeyaretnam; ASP Chan and the government were represented by Senior State Counsel [Lee Seiu Kin](/wiki/Lee_Seiu_Kin), and the case was heard by Judicial Commissioner (JC) Lim Teong Qwee. The plaintiffs claimed that there was no reasonable or [probable cause](/wiki/Probable_cause) for prosecuting them, and that they were not told what they were arrested for. They alleged that their arrests were illegal, and that ASP Chan had tortured them and forced them to confess to the murder. The defendants denied the allegations, pleading that Zainal, Salahuddin and Mohmad Bashir had admitted to the crime without any inducement, threat or promise from the police, and that the police officers did not use any violence throughout the investigation. ASP Chan stated that he did not bear any malice towards the plaintiffs, and that after interviewing them, he was convinced that they had committed the crime. After a 19-day hearing, JC Lim found that there was no false imprisonment or evidence of malice by the police, and that there was reasonable and probable cause for ASP Chan to charge the plaintiffs. As such, he dismissed the plaintiffs' damages claims with costs. The plaintiffs appealed this decision. In the appeal, Jeyaretnam tried to get the notes of police investigations admitted in court, but this was not allowed as it was against public interest. He also tried to point out inadequacies in the police investigations. Even though the police did not find the men's fingerprints or blood at the crime scene, ASP Chan did not follow up on this. He also did not follow up on a letter from Zainal's original lawyer which contained information about the crime. As for the three men's allegations of torture, they were examined by doctors, who did not find evidence of torture or mistreatment. The appeal court, consisting of M. Karthigesu, L. P. Thean, and Goh Joon Seng, dismissed the appeal. They ruled that the appellants had not proved that the prosecution was malicious, as they did not prove that the prosecution was motivated by a reason other than the pursuit of justice. ## Aftermath Following the acquittal of Zainal Kuning, Salahuddin Ismail and Mohmad Bashir Ismail, the opposition [Workers' Party](/wiki/Workers%27_Party_(Singapore)), of which Zainal’s lawyer J. B. Jeyaretnam was Secretary-General, called for a commission of inquiry to be set up to examine the procedures and methods adopted by the police in their criminal investigations. - [Capital punishment in Singapore](/wiki/Capital_punishment_in_Singapore) - [List of major crimes in Singapore](/wiki/List_of_major_crimes_in_Singapore)\n",
  "language": "en",
  "processed_at": "2026-01-12T09:48:13.078424",
  "title": "1989 Yishun coffeeshop murder",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/1989_Yishun_coffeeshop_murder"
}