{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:48:17.695486"
  },
  "content": "Singaporean political scandal Between April and October 1995, Singapore's [Senior Minister](/wiki/Senior_Minister_of_Singapore) [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) and his son [Deputy Prime Minister](/wiki/Deputy_Prime_Minister_of_Singapore) [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) engaged in a series of transactions with Hotel Properties Limited (HPL) that became the subject of a [political scandal](/wiki/Political_scandal) after they were made known to the public in April 1996. At the direction of [Prime Minister](/wiki/Prime_Minister_of_Singapore) [Goh Chok Tong](/wiki/Goh_Chok_Tong), the [Monetary Authority of Singapore](/wiki/Monetary_Authority_of_Singapore) (MAS) investigated the Lees' purchase of units at two HPL-developed condominiums, for which they had received over a million dollars in discounts. Goh subsequently cleared them of any wrongdoing and the discounts were donated to charity. ## Background On 22 April 1996, the [Stock Exchange of Singapore](/wiki/Stock_Exchange_of_Singapore) (SES) censured Hotel Properties Limited (HPL), a publicly listed real estate company, for not having been \"forthcoming\" about the discounts that it had given to several individuals, including [Senior Minister](/wiki/Senior_Minister_of_Singapore) [Lee Kuan Yew](/wiki/Lee_Kuan_Yew)'s brother and HPL director Lee Suan Yew. The SES noted that discounted property sales to directors and their relatives were subject to shareholder approval, yet HPL had taken up to 11 months to disclose transactions such as Lee Suan Yew's. However, the SES did not mention transactions directly involving Lee Kuan Yew or his son, [Deputy Prime Minister](/wiki/Deputy_Prime_Minister_of_Singapore) Lee Hsien Loong, in its statement. Nevertheless, Lee Kuan Yew and his son acknowledged in a joint statement dated 23 April 1996 that \"unsolicited discounts\" ranging from 5 to 12 per cent had been applied to their purchase of units at the HPL-developed Nassim Jade and Scotts 28 condominiums. Lee and his son each purchased a unit at the 39-unit Nassim Jade in April 1995; Lee Kuan Yew received a 7 per cent discount and paid [S$](/wiki/Singapore_dollar)3.57 million (US$2.53 million), whereas Lee Hsien Loong received a 12 per cent discount and paid S$3.64 million. They purchased another two units at the 136-unit Scotts 28 in October 1995, each costing S$2.7 million after a five per cent discount. According to the Lees, the Nassim Jade discounts had been \"unilaterally\" given by HPL, while the Scotts 28 discounts had only been made known to them on 1 April 1996. In total, the discounts received by Lee Kuan Yew and Lee Hsien Loong amounted to approximately S$1.05 million, or S$416,261 and S$632,127 respectively. ## Reactions ### Hotel Properties Limited At a press conference on 20 May 1996, HPL's Thio Gim Hock revealed that Lee Kuan Yew's wife [Kwa Geok Choo](/wiki/Kwa_Geok_Choo) had been present at Nassim Jade's pre-launch on 13 April 1995. Having been invited to the pre-launch by Lee's brother Suan Yew, Kwa purchased a unit on Lee's behalf on the same day. On the other hand, in accordance with company policy on interactions with government officials, neither Lee Kuan Yew nor Lee Hsien Loong had been invited to the pre-launch. HPL founder and managing director [Ong Beng Seng](/wiki/Ong_Beng_Seng) insisted that no preferential treatment had been given to Kwa or the rest of Lee's family, yet he maintained that he was \"a businessman, not a pontificator ... (who) did what a businessman would have done.\" Ong also called Lee Hsien Loong an \"exemplary customer\" who paid a \"damn good price\" for a unit at Nassim Jade that was 170 square feet (16 square metres) larger than the one that he had originally intended to buy. Since he could have refused to change his mind or negotiated for a lower price, Ong argued that the 12 per cent discount given to Lee Hsien Loong for his April 1995 purchase was \"incidental\". ### Goh Chok Tong [Prime Minister](/wiki/Prime_Minister_of_Singapore) [Goh Chok Tong](/wiki/Goh_Chok_Tong) stated that he had first heard \"rumours\" about the Lees' apartment purchases in March 1996. Although he believed that there was \"nothing wrong with cabinet ministers purchasing properties to live in or for investment, or selling their own properties\", he also had to \"(dispel) ... the market perception of impropriety.\" Goh promptly directed the [Monetary Authority of Singapore](/wiki/Monetary_Authority_of_Singapore) (MAS)—led by [Minister for Finance](/wiki/Ministry_of_Finance_(Singapore)) [Richard Hu](/wiki/Richard_Hu)―to launch an investigation into the sales. Following the MAS' investigation and a meeting with the [Cabinet](/wiki/Cabinet_of_Singapore), Goh cleared the Lees of any wrongdoing. At the same time, he announced that he would personally vet all future property purchases by ministers, with a view to extending this rule to all civil servants. ### Monetary Authority of Singapore The report on the Lees' apartment purchases was drafted by MAS deputy managing director Koh Beng Seng. Describing the incident as a \"public perception problem\", Minister for Finance Richard Hu presented the MAS' findings to Parliament on 21 May 1996. He found that the prices paid by the Lees were \"reasonable\", but \"their actions had become entangled with the complex schemes used by developers, involving movable list prices and variable discounts.\" ### Lee Kuan Yew In a 90-minute-long address to [Parliament](/wiki/Parliament_of_Singapore) on 21 May 1996, Lee Kuan Yew defended his wife, who he claimed managed all of their finances, and described the transactions with HPL as \"open and aboveboard\". He declared that \"I am here after 37 years in office because I have never taken advantage financially of my position.\" However, Lee also referred to the discounts as \"the way business is done\" and called for his critics to \"grow up\". Lee admitted on 23 May that he had initially been sceptical about Ong Beng Seng's intentions. However, he eventually concluded that Ong was a \"straightforward businessman\" and that there was \"no need for anybody to run away from him as if he's a leper.\" Lee also said that he was \"very proud\" of Koh Beng Seng: \"He could have returned the favours I did him ... But he did not hand the report to me.\" ### Lee Hsien Loong \"Taken aback\" by the public response to the matter, Lee Hsien Loong also spoke to Parliament on 21 May 1996, so as to \"dispel any lingering doubt\". He clarified that he had been looking to make \"long-term investments to provide for my family.\" Lee added that he had learnt of Nassim Jade and Scotts 28 from his mother and that neither he nor his wife, [Ho Ching](/wiki/Ho_Ching), had ever met with any of HPL's directors apart from his uncle, Suan Yew. Lee concluded that \"the high standard of honesty and integrity which the [People's Action Party](/wiki/People%27s_Action_Party) has established is one of Singapore's most precious assets.\" The Lees initially offered to repay the amount saved, but Goh Chok Tong refused to accept the cheques that they had sent to the government. After consulting a select group of ministers including Richard Hu, [Teo Chee Hean](/wiki/Teo_Chee_Hean), and [Wong Kan Seng](/wiki/Wong_Kan_Seng), they decided to donate the discounts to charity instead. ### Tang Liang Hong In a 1996 interview with [Hong Kong](/wiki/Hong_Kong)-based magazine *[Yazhou Zhoukan](/wiki/Yazhou_Zhoukan)*, opposition politician and lawyer [Tang Liang Hong](/wiki/Tang_Liang_Hong) opined that \"professional bodies\" such as the [Commercial Affairs Department](/wiki/Commercial_Affairs_Department) or the [Corrupt Practices Investigation Bureau](/wiki/Corrupt_Practices_Investigation_Bureau) ought to have handled the investigation of the Lees' property purchases. Tang made similar claims regarding the Lees' transactions with HPL at three [Workers' Party](/wiki/Workers%27_Party_(Singapore)) rallies on 31 December 1996. The Lees subsequently sued Tang for [libel](/wiki/Libel). In January 1997, [High Court](/wiki/High_Court_of_Singapore) judge [Lai Kew Chai](/wiki/Lai_Kew_Chai) ruled that worldwide assets belonging to Tang and his wife (valued at S$11.2 million) were to be [frozen](/wiki/Asset_freezing). Tang, who was represented by [J. B. Jeyaretnam](/wiki/J._B._Jeyaretnam), unsuccessfully sought to [disqualify](/wiki/Judicial_disqualification) Lai by claiming that Lai was \"close\" to the plaintiffs. Tang further alleged that Lai had a \"pecuniary interest\" in the case because he had also purchased a discounted unit at Nassim Jade on the same day as the Lees. Lai countered that he had done so \"separately and independently\". In May 1997, judge [Chao Hick Tin](/wiki/Chao_Hick_Tin) ruled that Tang's comments constituted \"extreme aggravation\" and awarded Lee Kuan Yew and Lee Hsien Loong S$1.05 million and S$950,000 in respective damages. *Yazhou Zhoukan* was ordered to pay SGD$900,000 in damages.\n",
  "language": "en",
  "processed_at": "2026-01-12T09:48:17.694975",
  "title": "1995 Hotel Properties Limited apartment sales",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/1995_Hotel_Properties_Limited_apartment_sales"
}