{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:48:25.516268"
  },
  "content": "Haze over the Southeast Asia region in mid-1997This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"1997 Southeast Asian haze\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(September 2012)* *(Learn how and when to remove this message)*[Southeast Asian haze](/wiki/Southeast_Asian_haze) seriesHaze in [Borneo](/wiki/Borneo), (/wiki/2019_Southeast_Asian_haze)History1990s - 1997 Southeast Asian haze - [1997 Indonesian forest fires](/wiki/1997_Indonesian_forest_fires) 2000s - [2005 Malaysian haze](/wiki/2005_Malaysian_haze) - [2006 Southeast Asian haze](/wiki/2006_Southeast_Asian_haze) - [2009 Southeast Asian haze](/wiki/2009_Southeast_Asian_haze) 2010s - [2010 Southeast Asian haze](/wiki/2010_Southeast_Asian_haze) - [2013 Southeast Asian haze](/wiki/2013_Southeast_Asian_haze) - [2015 Southeast Asian haze](/wiki/2015_Southeast_Asian_haze) - [2016 Malaysian haze](/wiki/2016_Malaysian_haze) - [2016 Southeast Asian haze](/wiki/2016_Southeast_Asian_haze) - [2017 Southeast Asian haze](/wiki/2017_Southeast_Asian_haze) - [2019 Southeast Asian haze](/wiki/2019_Southeast_Asian_haze) Key topics - [Chemical equator](/wiki/Chemical_equator) - Deforestation - [in Borneo](/wiki/Deforestation_in_Borneo) - [in Indonesia](/wiki/Deforestation_in_Indonesia) - [Mega Rice Project](/wiki/Mega_Rice_Project) - [Peat swamp forest](/wiki/Peat_swamp_forest) - [Borneo](/wiki/Borneo_peat_swamp_forests) Responses - [ASEAN Agreement on Transboundary Haze Pollution](/wiki/ASEAN_Agreement_on_Transboundary_Haze_Pollution) - [Operation Haze](/wiki/Operation_Haze) - [Transboundary Haze Pollution Act 2014](/wiki/Transboundary_Haze_Pollution_Act_2014) - [People's Movement to Stop Haze](/wiki/People%27s_Movement_to_Stop_Haze) See also - [Air pollution in Malaysia](/wiki/Air_pollution_in_Malaysia) - [API](/wiki/Air_Pollution_Index) - [Singapore PSI](/wiki/Pollutant_Standards_Index) - [Social and environmental impact of palm oil](/wiki/Social_and_environmental_impact_of_palm_oil) Category - v - t - e The **1997 Southeast Asian haze** was an international [air pollution](/wiki/Air_pollution) disaster that occurred during the second half of 1997, its after-effects causing widespread atmospheric visibility and health problems within [Southeast Asia](/wiki/Southeast_Asia). Considered the most severe [Southeast Asian haze](/wiki/Southeast_Asian_haze) event of all time, the total costs of the 1997 haze are estimated at [US$](/wiki/United_States_dollar)9 billion, due mainly to health care and disruption of air travel and business activities. The influence of the [1997 fires in Kalimantan and Sumatra](/wiki/1997_Indonesian_forest_fires) on ambient air quality was evident by July and peaked in September/October before weakening by November, when the delayed [monsoonal rain](/wiki/Monsoon) extinguished the fires and improved air quality within the region. During the peak episode, satellite imagery (NASA/TOMS aerosol index maps) showed a haze layer that expanded over an area of more than 3,000,000 km2 (1,200,000 sq mi), covering large parts of [Sumatra](/wiki/Sumatra) and [Kalimantan](/wiki/Kalimantan). Its northward extension partially reached [Malaysia](/wiki/Malaysia), [Singapore](/wiki/Singapore), [Brunei](/wiki/Brunei), [Thailand](/wiki/Thailand) and the [Philippines](/wiki/Philippines) and its westward extension reached [Sri Lanka](/wiki/Sri_Lanka). During this period, [particulate matter](/wiki/Atmospheric_particulate_matter) concentrations frequently exceeded national ambient air quality standards. Monthly mean horizontal visibility at most locations in Sumatra and Kalimantan in September was below 1 km (0.62 mi) and daily maximum visibility was frequently below 100 metres (330 ft). ## Countries affected - [Indonesia](/wiki/Indonesia) - [Singapore](/wiki/Singapore) - [Malaysia](/wiki/Malaysia) - [Thailand](/wiki/Thailand) - [Brunei](/wiki/Brunei) - [Philippines](/wiki/Philippines) - [Sri Lanka](/wiki/Sri_Lanka) ## Causes The 1997 Southeast Asian haze was caused mainly by [slash-and-burn](/wiki/Slash-and-burn) techniques adopted by farmers in Indonesia. Slash and burn has been extensively used for many years as the cheapest and easiest means to clear the lands for traditional agriculture. Fire is also used during the long fallow rotation of the so-called jungle rubber in Sumatra and Kalimantan to remove most of the [biomass](/wiki/Biomass), including the woody parts before new plantations are re-established. Fire may also be deliberately used as a weapon to claim property on the islands and provinces where land ownership is not clear, an action taken by both [smallholders](/wiki/Smallholding) and large operators alike. After burning out its previous owner, the smallholder or large operator plants their own crops there, gaining de facto control over the disputed land [*citation needed*]. During the dry season, dry fuels readily ignite and lead to large wildfires, and due to the [1997–98 El Niño event](/wiki/1997%E2%80%9398_El_Ni%C3%B1o_event), the dry season in Southeast Asia was even drier than normal. These accidental fires may have the same underlying socio-economic and institutional problems. In cases like this, fire suppression can be very difficult and costly especially when they reach the highly flammable peat-swamp areas. ## Effects [Atmospheric particulate matter](/wiki/Atmospheric_particulate_matter) was the form of air pollutant that predominantly contributed to the haze and degradation in ambient air quality standards during this crisis. In all countries affected by the smoke [haze](/wiki/Haze), an increase of acute health outcomes was observed. Health effects; included emergency room visits due to respiratory symptoms such as [asthma](/wiki/Asthma), [upper respiratory infection](/wiki/Upper_respiratory_infection), decreased lung function as well as eye and skin irritation, were caused mainly by this [particulate matter](/wiki/Granular_material). In Singapore, for instance, health surveillance showed a 30% increase in hospital attendance due to air quality related symptoms. Generally, children and the elderly, as well as those with pre-existing respiratory and [cardiac diseases](/wiki/Cardiac_disease) were the most susceptible to adverse health outcomes from the [haze](/wiki/Haze) exposure. The smoke haze episode has added to the urban and industrial air pollution in [Southeast Asia](/wiki/Southeast_Asia), causing it to reach alarming levels in many metropolitan areas. By scattering and absorbing light, the fire-related particulate also resulted in reduced [visibility](/wiki/Visibility); impairing transportation by air, land and water and seriously affecting the economies of Indonesia, Malaysia and Singapore. Among the economic sectors affected most were air, land and sea transportation, construction, tourism and agricultural industries. EEPSEA/[WWF](/wiki/World_Wide_Fund_for_Nature) estimated the economic value of the damages caused by the 1997 fires and haze. They estimated one billion US$ from haze-related damages for Indonesia only. The damages to Malaysia and Singapore are figured at 0.4 billion US$. Including the fire related damages, the total damages are estimated to amount to 4.5 billion US$. However, a variety of the damages such as decreased quality of life, [loss of biodiversity](/wiki/Loss_of_biodiversity) and atmospheric impacts are difficult to establish. Fire-related smoke haze episodes also reveal a social component: a large part of the population in Southeast Asia do not have the financial means to buy protective measures such as respiratory masks and air conditioning, nor are they able to refrain from outdoor work when air pollution is high. - [2005 Malaysian haze](/wiki/2005_Malaysian_haze) - [2006 Southeast Asian haze](/wiki/2006_Southeast_Asian_haze) - [2013 Southeast Asian haze](/wiki/2013_Southeast_Asian_haze) - [2015 Southeast Asian haze](/wiki/2015_Southeast_Asian_haze) - [2016 Southeast Asian haze](/wiki/2016_Southeast_Asian_haze) - [2019 Southeast Asian haze](/wiki/2019_Southeast_Asian_haze) - [Air quality index](/wiki/Air_quality_index) - [Asian brown cloud](/wiki/Asian_brown_cloud) - [Borneo peat swamp forests](/wiki/Borneo_peat_swamp_forests) - [Deforestation in Borneo](/wiki/Deforestation_in_Borneo) - [Haze](/wiki/Haze) - [Pollutant Standards Index](/wiki/Pollutant_Standards_Index) - [Slash and burn](/wiki/Slash_and_burn) - [Southeast Asian haze](/wiki/Southeast_Asian_haze) - [Garuda Indonesia Flight 152](/wiki/Garuda_Indonesia_Flight_152) ### Background sources - Investigating the haze transport from 1997 biomass burning in Southeast Asia: Its impact upon Singapore : Asia - The Asian Forest Fires of 1997-1998 - The 1997-98 Air Pollution Episode in Southeast Asia Generated by Vegetation Fires in Indonesia - Hazy Solutions in Struggle to Stop People Burning Indonesia's Forests - Jakarta Globe. 3°S 105°E﻿ / ﻿3°S 105°E﻿ / -3; 105\n",
  "language": "en",
  "processed_at": "2026-01-12T09:48:25.515880",
  "title": "1997 Southeast Asian haze",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/1997_Southeast_Asian_haze"
}