{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:48:20.105052"
  },
  "content": "Regional financial crisis that struck East and Southeast Asia in 1997–1998 The **1997 Asian financial crisis** gripped much of [East](/wiki/East_Asia) and [Southeast Asia](/wiki/Southeast_Asia) during the late 1990s. The crisis began in [Thailand](/wiki/Thailand) in July 1997 before spreading to several other countries with a ripple effect, raising fears of a worldwide economic meltdown due to [financial contagion](/wiki/Financial_contagion). However, the recovery in 1998–1999 was rapid, and worries of a meltdown quickly subsided. Originating in Thailand on 2 July, where it was known as the [Tom Yum Kung](/wiki/Tom_yum) crisis ([Thai](/wiki/Thai_language): วิกฤตต้มยำกุ้ง), it followed the financial collapse of the [Thai baht](/wiki/Thai_baht) after the Thai government was forced to [float](/wiki/Floating_currency) the baht due to lack of [foreign currency](/wiki/List_of_circulating_currencies) to support its [currency peg](/wiki/Fixed_exchange_rate) to the [U.S. dollar](/wiki/U.S._dollar). [Capital flight](/wiki/Capital_flight) ensued almost immediately, beginning an international chain reaction. At the time, Thailand had acquired a burden of [foreign debt](/wiki/Foreign_debt). As the crisis spread, other Southeast Asian countries and later [Japan](/wiki/Japan) and [South Korea](/wiki/South_Korea) saw slumping currencies, devalued stock markets and other asset prices, and a precipitous rise in [private debt](/wiki/Private_debt). Foreign [debt-to-GDP ratios](/wiki/Debt-to-GDP_ratio) rose from 100% to 167% in the four large [Association of Southeast Asian Nations](/wiki/Association_of_Southeast_Asian_Nations) (ASEAN) economies in 1993–1996, then shot up beyond 180% during the worst of the crisis. In South Korea, the ratios rose from 13% to 21% and then as high as 40%, while the other northern [newly industrialized countries](/wiki/Newly_industrialized_country) fared much better. Only in Thailand and South Korea did debt service-to-exports ratios rise. South Korea, [Indonesia](/wiki/Indonesia) and Thailand were the countries most affected by the crisis. [Hong Kong](/wiki/Hong_Kong), [Laos](/wiki/Laos), [Malaysia](/wiki/Malaysia) and the [Philippines](/wiki/Philippines) were also hurt by the slump. [Brunei](/wiki/Brunei), [mainland China](/wiki/China), Japan, [Singapore](/wiki/Singapore), [Taiwan](/wiki/Taiwan), and [Vietnam](/wiki/Vietnam) were less affected, although all suffered from a general loss of confidence and subsidence of demand throughout the region. Although most of the governments of Asia had seemingly sound [fiscal policies](/wiki/Fiscal_policies), the [International Monetary Fund](/wiki/International_Monetary_Fund) (IMF) stepped in to initiate a $40 billion program to stabilize the currencies of South Korea, Thailand, and Indonesia, economies particularly hard-hit by the crisis. However, the efforts to stem a global economic crisis did little to stabilize the domestic situation in Indonesia. After 31 years in power, Indonesian dictator [Suharto](/wiki/Suharto) was [forced to step down](/wiki/Fall_of_Suharto) on 21 May 1998 in the wake of widespread rioting that followed sharp price increases caused by a drastic devaluation of the [rupiah](/wiki/Indonesian_rupiah). The effects of the crisis lingered through 1998, where many important [stocks](/wiki/Stock) fell in Wall Street as a result of a dip in the values of the currencies of [Russia](/wiki/Russia) and [Latin American](/wiki/Latin_America) countries, which weakened those countries' demand for U.S. exports. In 1998, growth in the Philippines dropped to virtually zero. Only Singapore proved relatively insulated from the shock, but nevertheless suffered serious hits in passing, mainly due to its status as a major financial hub and its geographical proximity to Malaysia and Indonesia. By 1999, however, analysts saw signs that the [economies of Asia](/wiki/Economy_of_Asia) were beginning to recover. After the crisis, economies in East and Southeast Asia worked together toward financial stability and better financial supervision. ## Credit bubbles and fixed currency exchange rates The causes of the debacle are many and disputed. Thailand's economy developed into an [economic bubble](/wiki/Economic_bubble) fueled by [hot money](/wiki/Hot_money). More and more was required as the size of the bubble grew. The same type of situation happened in Malaysia and Indonesia, which had the added complication of what was called \"[crony capitalism](/wiki/Crony_capitalism)\". The short-term capital flow was expensive and often highly conditioned for quick [profit](/wiki/Profit_(economics)). Development money went in a largely uncontrolled manner to certain people only – not necessarily the best suited or most efficient, but those closest to the centers of power. Weak corporate governance also led to inefficient investment and declining profitability. Until 1999, Asia attracted almost half of the total [capital](/wiki/Capital_(economics)) inflow into [developing countries](/wiki/Developing_country). The economies of Southeast Asia in particular maintained high interest rates attractive to foreign investors looking for a high [rate of return](/wiki/Rate_of_return). As a result, the region's economies received a large inflow of money and experienced a dramatic run-up in asset prices. At the same time, the regional economies of Thailand, Malaysia, Indonesia, Singapore and South Korea experienced high growth rates, of 8–12% GDP, in the late 1980s and early 1990s. This achievement was widely acclaimed by financial institutions including the IMF and [World Bank](/wiki/World_Bank), and was known as part of the \"[Asian economic miracle](/wiki/Four_Asian_Tigers)\". In the mid-1990s, [Thailand](/wiki/Thailand), [Indonesia](/wiki/Indonesia) and [South Korea](/wiki/South_Korea) had large private [current account](/wiki/Current_account_(balance_of_payments)) deficits, and the maintenance of [fixed exchange rates](/wiki/Fixed_exchange_rate) encouraged external borrowing and led to excessive exposure to [foreign exchange risk](/wiki/Foreign_exchange_risk) in both the financial and corporate sectors. In the mid-1990s, a series of external shocks began to change the economic environment. The [devaluation](/wiki/Devaluation) of the Chinese [renminbi](/wiki/Renminbi) and the Japanese [yen](/wiki/Yen), subsequent to the latter's strengthening due to the [Plaza Accord](/wiki/Plaza_Accord) of 1985, the raising of U.S. interest rates which led to a strong U.S. dollar, and the sharp decline in semiconductor prices, all adversely affected their growth. As the [U.S. economy](/wiki/U.S._economy) recovered from a recession in the early 1990s, the [U.S. Federal Reserve Bank](/wiki/U.S._Federal_Reserve_Bank) under [Alan Greenspan](/wiki/Alan_Greenspan) began to raise U.S. interest rates to head off [inflation](/wiki/Inflation). This made United States bonds a more attractive investment destination relative to Southeast Asia, which had been attracting hot money flows through high short-term interest rates, and raised the value of the U.S. dollar. For the Southeast Asian nations which had currencies pegged to the U.S. dollar, the higher U.S. dollar caused their own exports to become more expensive and less competitive in the global markets. Southeast Asia's export growth slowed dramatically in the spring of 1996, deteriorating their current account position. Some economists have advanced the growing exports of China as a factor contributing to ASEAN nations' export growth slowdown, though these economists maintain the main cause of their crises was excessive real estate speculation. China had begun to compete effectively with other Asian exporters particularly in the 1990s after the implementation of a number of export-oriented reforms. Other economists dispute China's impact, noting that both ASEAN and China experienced simultaneous rapid export growth in the early 1990s. Many economists believe that the Asian crisis was created not by market psychology or technology, but by policies that distorted incentives within the lender–borrower relationship. The resulting large quantities of [credit](/wiki/Credit_(finance)) that became available generated a highly [leveraged](/wiki/Leverage_(finance)) economic climate, and pushed up asset prices to an unsustainable level, particularly those in non-productive sectors of the economy such as real-estate. These asset prices eventually began to collapse, causing individuals and companies to [default](/wiki/Default_(finance)) on debt obligations. ## Panic among lenders and withdrawal of credit The resulting panic among lenders led to a large withdrawal of credit from the crisis countries, causing a [credit crunch](/wiki/Credit_crunch) and further bankruptcies. In addition, as foreign investors attempted to withdraw their money, the [exchange market](/wiki/Foreign_exchange_market) was flooded with the currencies of the crisis countries, putting [depreciative](/wiki/Depreciation_(currency)) pressure on their exchange rates. To prevent currency values collapsing, these countries' governments raised domestic interest rates to exceedingly high levels (to help diminish [flight of capital](/wiki/Capital_flight) by making lending more attractive to investors) and intervened in the exchange market, buying up any excess domestic currency at the [fixed exchange rate](/wiki/Fixed_exchange_rate) with [foreign reserves](/wiki/Foreign_reserves). Neither of these policy responses could be sustained for long, as several countries had insufficient levels of foreign exchange reserves. Very high interest rates, which can be extremely damaging to a healthy economy, wreaked further havoc on economies in an already fragile state, while the central banks were hemorrhaging foreign reserves, of which they had finite amounts. When it became clear that the tide of capital fleeing these countries was not to be stopped, the authorities ceased defending their fixed exchange rates and allowed their currencies to [float](/wiki/Floating_exchange_rate). The resulting depreciated value of those currencies meant that foreign currency-denominated [liabilities](/wiki/Liability_(accounting)) grew substantially in domestic currency terms, causing more bankruptcies and further deepening the crisis. Other economists, including [Joseph Stiglitz](/wiki/Joseph_Stiglitz) and [Jeffrey Sachs](/wiki/Jeffrey_Sachs), have downplayed the role of the real economy in the crisis compared to the financial markets. The rapidity with which the crisis happened has prompted Sachs and others to compare it to a classic [bank run](/wiki/Bank_run) prompted by a sudden risk shock. Sachs pointed to strict monetary and contractionary fiscal policies implemented by the governments on the advice of the IMF in the wake of the crisis, while [Frederic Mishkin](/wiki/Frederic_Mishkin) points to the role of [asymmetric information](/wiki/Asymmetric_information) in the financial markets that led to a \"[herd mentality](/wiki/Herd_mentality)\" among investors that magnified a small risk in the real economy. The crisis has thus attracted attention from [behavioral economists](/wiki/Behavioral_economics) interested in [market psychology](/wiki/Market_psychology). Another possible cause of the sudden risk shock may also be attributable to the [handover of Hong Kong sovereignty on 1 July 1997](/wiki/Transfer_of_sovereignty_over_Hong_Kong). During the 1990s, hot money flew into the Southeast Asia region through [financial hubs](/wiki/Financial_hub), especially Hong Kong. The investors were often ignorant of the actual fundamentals or risk profiles of the respective economies, and once the crisis gripped the region, the political uncertainty regarding the future of Hong Kong as an Asian financial centre led some investors to withdraw from Asia altogether. This shrink in investments only worsened the financial conditions in Asia[*better source needed*] (subsequently leading to the depreciation of the [Thai baht](/wiki/Thai_baht) on 2 July 1997). Several case studies on the topic of the application of [network analysis](/wiki/Social_network_analysis) of a financial system help to explain the [interconnectivity](/wiki/Interconnectivity) of [financial markets](/wiki/Financial_market), as well as the significance of the robustness of [hubs](/wiki/Network_theory#Assortative_and_disassortative_mixing) (or main nodes). Any [negative externalities](/wiki/Externality#Examples) in the hubs creates a [ripple effect](/wiki/Ripple_effect) through the financial system and the economy (as well as any connected economies) as a whole. The foreign ministers[*who?*] of the 10 ASEAN countries believed that the well co-ordinated manipulation of their currencies was a deliberate attempt to destabilize the ASEAN economies[*citation needed*]. Malaysian Prime Minister [Mahathir Mohamad](/wiki/Mahathir_Mohamad) accused [George Soros](/wiki/George_Soros) and other currency traders of ruining Malaysia's economy with [currency speculation](/wiki/Currency_speculation). Soros [claims to have been a buyer](/wiki/George_Soros#Economic_crisis_in_the_1990s_and_2000s) of the ringgit during its fall, having [sold it short](/wiki/Short_(finance)) in 1997. At the 30th ASEAN Ministerial Meeting held in [Subang Jaya](/wiki/Subang_Jaya), Malaysia, the foreign ministers issued a joint declaration on 25 July 1997 expressing serious concern and called for further intensification of ASEAN's cooperation to safeguard and promote ASEAN's interest in this regard. Coincidentally, on that same day, the central bankers of most of the affected countries were at the EMEAP (Executive Meeting of East Asia Pacific) meeting in Shanghai, and they failed to make the \"New Arrangement to Borrow\" operational. A year earlier, the finance ministers of these same countries had attended the 3rd [APEC](/wiki/APEC) finance ministers meeting in [Kyoto](/wiki/Kyoto), Japan, on 17 March 1996, and according to that joint declaration, they had been unable to double the amounts available under the \"General Agreement to Borrow\" and the \"Emergency Finance Mechanism\". ## IMF role The scope and the severity of the collapses led to an urgent need for outside intervention. Since the countries melting down were among the richest in their region, and in the world, and since hundreds of billions of dollars were at stake, any response to the crisis was likely to be cooperative and international. The [International Monetary Fund](/wiki/International_Monetary_Fund) created a series of [bailouts](/wiki/Bail_out_(finance)) (\"rescue packages\") for the most-affected economies to enable them to avoid [default](/wiki/Default_(finance)), tying the packages to currency, banking and financial system reforms. Due to IMF's involvement in the financial crisis, the term IMF Crisis became a way to refer to the Asian Financial Crisis in countries that were affected.[*unreliable source?*][*better source needed*] ### Economic reforms The IMF's support was conditional on a series of economic reforms, the \"[structural adjustment](/wiki/Structural_adjustment) package\" (SAP). The SAPs called on crisis-struck nations to reduce government spending and deficits, allow [insolvent](/wiki/Insolvency) banks and financial institutions to fail, and aggressively raise interest rates. The reasoning was that these steps would restore confidence in the nations' fiscal [solvency](/wiki/Solvency), penalize insolvent companies, and protect currency values. Above all, it was stipulated that IMF-funded capital had to be administered rationally in the future, with no favored parties receiving funds by preference. In at least one of the affected countries the restrictions on foreign ownership were greatly reduced. There were to be adequate government controls set up to supervise all financial activities, ones that were to be independent, in theory, of private interest. Insolvent institutions had to be closed, and insolvency itself had to be clearly defined. In addition, financial systems were to become \"transparent\", that is, provide the kind of financial information used in the West to make financial decisions. As countries fell into crisis, many local businesses and governments that had taken out loans in US dollars, which suddenly became much more expensive relative to the local currency which formed their earned income, found themselves unable to pay their creditors. The dynamics of the situation were similar to that of the [Latin American debt crisis](/wiki/Latin_American_debt_crisis). The effects of the SAPs were mixed and their impact controversial. Critics, however, noted the contractionary nature of these policies, arguing that in a [recession](/wiki/Recession), the traditional [Keynesian](/wiki/Keynesian) response was to increase [government](/wiki/Government) spending, prop up major companies, and lower interest rates. The reasoning was that by stimulating the economy and staving off [recession](/wiki/Recession), governments could restore confidence while preventing [economic loss](/wiki/Pure_economic_loss). They pointed out that the U.S. government had pursued expansionary policies, such as lowering interest rates, increasing government spending, and cutting taxes, when the United States itself entered a recession in 2001, and arguably the same in the fiscal and monetary policies during the [2008 financial crisis](/wiki/2008_financial_crisis). Many commentators in retrospect criticized the IMF for encouraging the developing economies of Asia down the path of \"fast-track capitalism\", meaning liberalization of the financial sector (elimination of restrictions on capital flows), maintenance of high domestic interest rates to attract [portfolio investment](/wiki/Portfolio_investment) and bank capital, and pegging of the national currency to the dollar to reassure foreign investors against currency risk. ### IMF and high interest rates The conventional high-interest-rate economic strategy is normally employed by monetary authorities to attain the chain objectives of tightened [money supply](/wiki/Money_supply), discouraged [currency speculation](/wiki/Currency_speculation), stabilized exchange rate, curbed currency depreciation, and ultimately contained [inflation](/wiki/Inflation). In the Asian meltdown, highest IMF officials rationalized their prescribed high interest rates as follows: From then IMF First Deputy managing director, [Stanley Fischer](/wiki/Stanley_Fischer) in 1998: > When their governments \"approached the IMF, the reserves of Thailand and South Korea were perilously low, and the Indonesian Rupiah was excessively depreciated. Thus, the first order of business was... to restore confidence in the currency. To achieve this, countries have to make it more attractive to hold domestic currency, which in turn, requires increasing interest rates temporarily, even if higher interest costs complicate the situation of weak banks and corporations... > Why not operate with lower interest rates and a greater devaluation? This is a relevant tradeoff, but there can be no question that the degree of devaluation in the Asian countries is excessive, both from the viewpoint of the individual countries, and from the viewpoint of the international system. Looking first to the individual country, companies with substantial foreign currency debts, as so many companies in these countries have, stood to suffer far more from... currency (depreciation) than from a temporary rise in domestic interest rates.... Thus, on macroeconomics... monetary policy has to be kept tight to restore confidence in the currency.... From the then IMF managing director [Michel Camdessus](/wiki/Michel_Camdessus): > To reverse (currency depreciation), countries have to make it more attractive to hold domestic currency, and that means temporarily raising interest rates, even if this (hurts) weak banks and corporations. ## Countries/Regions affected ### Thailand From 1985 to 1996, Thailand's economy grew at an average of over 9% per year, the highest economic growth rate of any country at the time. Inflation was kept reasonably low within a range of 3.4–5.7%. The baht was pegged at 25 to the U.S. dollar. On 14 and 15 May 1997, the [Thai baht](/wiki/Thai_baht) was hit by massive speculative attacks. On 30 June 1997, Prime Minister [Chavalit Yongchaiyudh](/wiki/Chavalit_Yongchaiyudh) said that he would not devalue the baht. However, Thailand lacked the foreign reserves to support the USD–Baht currency peg, and the Thai government was eventually forced to float the Baht, on 2 July 1997, allowing the value of the Baht to be set by the currency market. This caused a chain reaction of events, eventually culminating into a region-wide crisis. Thailand's booming economy came to a halt amid massive layoffs in finance, [real estate](/wiki/Real_estate), and construction that resulted in huge numbers of workers returning to their villages in the countryside and 600,000 foreign workers being sent back to their home countries. The baht devalued swiftly and lost more than half of its value. The baht reached its lowest point of 56 units to the U.S. dollar in January 1998. The Thai stock market dropped 75%. Finance One, the largest Thai finance company until then, collapsed. On 11 August 1997, the IMF unveiled a rescue package for Thailand with more than $17 billion, subject to conditions such as passing laws relating to bankruptcy (reorganizing and restructuring) procedures and establishing strong regulation frameworks for banks and other financial institutions. The IMF approved on 20 August 1997, another bailout package of $2.9 billion. Poverty and inequality increased while employment, wages and social welfare all declined as a result of the crisis. Following the 1997 Asian financial crisis, income in the northeast, the poorest part of the country, rose by 46 percent from 1998 to 2006. Nationwide poverty fell from 21.3 to 11.3 percent. Thailand's [Gini coefficient](/wiki/Gini_coefficient), a measure of [income inequality](/wiki/Income_inequality), fell from .525 in 2000 to .499 in 2004 (it had risen from 1996 to 2000) versus 1997 Asian financial crisis. By 2001, Thailand's economy had recovered. The increasing tax revenues allowed the country to balance its budget and repay its debts to the IMF in 2003, four years ahead of schedule. The Thai baht continued to appreciate to 29 Baht to the U.S. dollar in October 2010. ### Indonesia In June 1997, Indonesia seemed far from crisis. Unlike Thailand, Indonesia had low inflation, a [trade surplus](/wiki/Trade_surplus) of more than $900 million, huge foreign exchange reserves of more than $20 billion, and a good banking sector. However, a large number of Indonesian corporations had been borrowing in U.S. dollars. This practice had worked well for these corporations during the preceding years, as the [rupiah](/wiki/Rupiah) had strengthened respective to the dollar; their effective levels of debt and financing costs had decreased as the local currency's value rose. In July 1997, when Thailand floated the baht, Indonesia's monetary authorities widened the rupiah [currency trading band](/wiki/Currency_trading_band) from 8% to 12%. As a result, the rupiah suddenly came under severe attack in August. Therefore, on the 14th of the month, the managed floating exchange regime was replaced by a free-floating exchange rate arrangement. The rupiah dropped further due to the shift. The IMF came forward with a rescue package of $23 billion, but the rupiah was sinking further amid fears over corporate debts, massive selling of rupiah, and strong demand for dollars. The rupiah and the [Jakarta Stock Exchange](/wiki/Jakarta_Stock_Exchange) touched a historic low in September. [Moody's](/wiki/Moody%27s) eventually downgraded Indonesia's long-term debt to \"[junk bond](/wiki/Junk_bond)\". Although the rupiah crisis began in July and August 1997, it intensified in November when the effects of that summer devaluation showed up on corporate balance sheets. Companies that had borrowed in dollars had to face the higher costs imposed upon them by the rupiah's decline, and many reacted by buying dollars through selling rupiah, undermining the value of the latter further. Before the crisis, the exchange rate between the rupiah and the dollar was roughly 2,600 rupiah to 1 U.S. dollar. The rate plunged to over 11,000 rupiah to 1 U.S. dollar on 9 January 1998, with spot rates over 14,000 during 23–26 January and trading again over 14,000 for about six weeks during June–July 1998. On 31 December 1998, the rate was almost exactly 8,000 to 1 U.S. dollar. Indonesia lost 13.5% of its GDP that year. In February 1998, President [Suharto](/wiki/Suharto) sacked the incumbent Bank Indonesia governor, [J. Soedradjad Djiwandono](/wiki/J._Soedradjad_Djiwandono), but this proved insufficient. Amidst [widespread rioting in May 1998](/wiki/May_1998_riots_of_Indonesia), Suharto resigned under public pressure and Vice President [B. J. Habibie](/wiki/B._J._Habibie) replaced him. As a result of the financial crisis that hit the country, many factors arising from all aspects, including sports broadcasting on Indonesian television, including: - [ANTV](/wiki/ANTV) lost their television rights to broadcast the [1998 Formula One World Championship](/wiki/1998_Formula_One_World_Championship) despite their Formula One broadcasting rights contract in Indonesia lasting until 1999. As a result, the 1998 season was not aired on Indonesian television. [RCTI](/wiki/RCTI) finally re-secured the broadcast rights for the (/wiki/1999_Formula_One_World_Championship) to (/wiki/2001_Formula_One_World_Championship) season after their last aired on (/wiki/1996_Formula_One_World_Championship) season before the broadcast rights was secured by [MNC TV](/wiki/MNC_TV) (previously known as TPI) for (/wiki/2002_Formula_One_World_Championship) until (/wiki/2004_Formula_One_World_Championship) season. - ANTV also stopped the coverage of [1997–98 Serie A](/wiki/1997%E2%80%9398_Serie_A), [1997–98 Bundesliga](/wiki/1997%E2%80%9398_Bundesliga), and the [1997–98 La Liga](/wiki/1997%E2%80%9398_La_Liga), before the end of their respective seasons. However, it did not affect the [1997–98 FA Premier League](/wiki/1997%E2%80%9398_FA_Premier_League), as they had already broadcast it with [SCTV](/wiki/SCTV_(TV_network)) up to the end of the season before [Indosiar](/wiki/Indosiar) secured broadcasting rights alongside [SCTV](/wiki/SCTV_(TV_network)) for [1998–99 FA Premier League](/wiki/1998%E2%80%9399_FA_Premier_League) until [1999–2000 FA Premier League](/wiki/1999%E2%80%932000_FA_Premier_League) season. - All television stations had limited broadcast schedules, with an average closedown at 11:30 pm or 12:00 am. TPI had limited broadcasing schedules during March until the start of April when they closedown their broadcast at 7:30 pm for weekdays and 10:45 pm since April until 19 December 1998, during the start of Ramadan that year. Additionally, the [Indonesian motorcycle Grand Prix](/wiki/Indonesian_motorcycle_Grand_Prix), which was held at [Sentul](/wiki/Sentul_International_Circuit), was dropped from the 1998 [Superbike](/wiki/1998_Superbike_World_Championship) and [MotoGP](/wiki/1998_Grand_Prix_motorcycle_racing_season) calendar. It did not return to the calendar until 2022 when the grand prix was held on [Mandalika International Street Circuit](/wiki/Mandalika_International_Street_Circuit). [World Rally Championship](/wiki/World_Rally_Championship) also dropped the [Rally Indonesia](/wiki/Rally_Indonesia) from [their 1998 calendar](/wiki/1998_World_Rally_Championship). ### South Korea\n",
  "language": "en",
  "processed_at": "2026-01-12T09:48:20.104596",
  "title": "1997 Asian financial crisis",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/1997_Asian_financial_crisis"
}