{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:48:27.657480"
  },
  "content": "1999-2000 torture case in Singapore The **1999 Ang Mo Kio torture case** refers to the torture and imprisonment of a 14-year-old girl which occurred between 15 December 1999 and 2 January 2000 in [Ang Mo Kio](/wiki/Ang_Mo_Kio), Singapore. The girl was tortured and abused in a [Housing and Development Board](/wiki/Housing_and_Development_Board) flat in Ang Mo Kio in one of the most horrific cases in Singapore's history. The perpetrators of the case were three sisters Ong Li Xia, Ong Lay Hua and Ong Lay Hiong, and their boyfriends, Neo Soo Kai, Melvin Yeo Yew Beng, and Yeo Kim Han. ## Torture Over the 17 days, the victim was kicked, punched and slapped by the three girls and their boyfriends. Neo hit her with a metal chair, causing her to fall on her face and one of her teeth to fall out, and on another occasion tied her to a chair and scalded her with boiling water. She was also forced to strip naked and perform indecent acts. She was [held captive](/wiki/False_imprisonment) in the house and not allowed to go home. She was allowed to call her family, but was afraid to tell them what was happening and told her family that she was fine. On [New Year's Eve](/wiki/New_Year%27s_Eve), while the girls and their boyfriends were out celebrating, the victim was tied to the sofa and her mouth taped shut. She was released on 2 January 2000. She was badly scarred and was subsequently sent to hospital, where she stayed for 34 days. ## Trial and sentencing District Judge Seng Kwang Boon presided over the joint trial of Neo Soo Kai, Neo's girlfriend, and Melvin Yeo Yew Beng. On 19 July 2000, Neo Soo Kai was sentenced to seven years' jail and 14 [strokes of the cane](/wiki/Caning_in_Singapore), Neo's girlfriend was sentenced to two years' jail, and Melvin Yeo was sentenced to six years behind bars and caned 16 strokes. Trial judge Judicial Commissioner (JC) Amarjeet Singh presided over the joint trial of Ong Li Xia and Yeo Kim Han. On 24 July 2000, JC Singh passed his judgement. Ong was convicted of a total of seven charges, of which the most serious were one each of instigating the victim to perform unnatural sexual acts on a dog, intrusion of sexual privacy, and pouring hot water on the victim. The respective sentences for these charges were two years, six months and three years respectively, and JC Singh ordered them to run consecutively while the remaining lesser charges were to run concurrently with the three serious charges. As such, Ong was jailed for a total of five years and six months. Yeo was sentenced for seven charges, including the same three most serious charges as Ong. JC Singh similarly ordered Yeo's jail terms to run consecutively for the three most serious charges, while those of the lesser charges were to run concurrently. However, JC Singh mentioned that Yeo Kim Han was 17 years old, a member of a [lion dance](/wiki/Lion_dance) troupe and had gone overseas for performances, which showed that he was of a higher level of maturity and should be held to a higher level of culpability for the same offences. As such, he sentenced Yeo to a greater sentence of four years, six months and three years plus six strokes of the cane respectively for the three serious charges. Two of his lesser charges, namely rioting and causing hurt with a weapon, also included two and four strokes of the cane respectively. In all, Yeo was sentenced to a total of seven and a half years' imprisonment and 12 strokes of the cane. ## In media The case was re-enacted in Singaporean crime shows [True Files](/wiki/True_Files) in 2002 and [In Cold Blood](/wiki/In_Cold_Blood_(Singaporean_TV_series)) in 2011. - [List of major crimes in Singapore](/wiki/List_of_major_crimes_in_Singapore)\n",
  "language": "en",
  "processed_at": "2026-01-12T09:48:27.656995",
  "title": "1999 Ang Mo Kio torture case",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/1999_Ang_Mo_Kio_torture_case"
}