{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:49:21.215555"
  },
  "content": "* *2 Cable Road** is a bungalow on Cable Road in [Tanglin, Singapore](/wiki/Tanglin). Completed in 1913, it was built for [Municipal Commissioner](/wiki/Municipal_Commission_of_Singapore) [Mohamed Namazie](/wiki/Mirza_Mohamed_Ali_Namazie). ## Description The two-storey [black and white bungalow](/wiki/Black_and_white_bungalow), which was designed in the [Edwardian style](/wiki/Edwardian_architecture) with tropical influences, features a \"distinctive\" [porte-cochère](/wiki/Porte-coch%C3%A8re) set 45 degrees from the building's main body. According to the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority), this was, at the time of the bungalow's construction, \"quite a popular configuration at the time.\" A verandah can be found above the porch. The bungalow features a \"pyramidal\" roof topped by a \"lantern-like jack roof\" above the porch. The authority writes that the building's rooms were \"organized in terms of their use and patterns of circulation through the house rather than subscribing to any notion of Classical symmetry.\" ## History The bungalow was built in 1913 for Municipal Commissioner Mohamed Namazie. It was designed by [David McLeod Craik](/wiki/David_McLeod_Craik) in one of his first projects as an employee of prominent architectural firm [Swan & Maclaren Architects](/wiki/Swan_%26_Maclaren_Architects). The bungalow was gazetted for conservation by the Urban Redevelopment Authority and designated a Good Class Bungalow. In 2003, the bungalow was purchased by Vanguard Interiors managing director K.T. Ong, who resides at the house with his wife and his two adult children. Ong decided to restore the bungalow, with planning and designing beginning in 2006. The restoration of the bungalow, which cost nearly $4 million and for which he commissioned architects Rene Tan and Quek Tse Kwang, began in 2008 and was completed in 2009. The [encaustic tiles](/wiki/Encaustic_tile) made of clay and the timber balustrades on the bungalow's main staircase were retained. However, the doors and windows, which had fallen into an \"advanced state of disrepair\" were removed and replaced. The verandah and the porch were both enclosed by frameless glass to allow for air conditioning. A \"modern, abstract and simple\" extension was added, with a linear pool leading up to the bungalow with the extension's wings on either side, which were built for his children. The project received a Category B award at the 2011 Urban Redevelopment Authority Architectural Heritage Awards. 1°17′46″N 103°49′31″E﻿ / ﻿1.29610°N 103.82532°E﻿ / 1.29610; 103.82532\n",
  "language": "en",
  "processed_at": "2026-01-12T09:49:21.215137",
  "title": "2 Cable Road",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/2_Cable_Road"
}