{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:49:23.046577"
  },
  "content": "Building in Rochor, Singapore **2 Kampong Kapor Road**, formerly the **Kampong Kapor Community Centre**, is a building on Kampong Kapor Road in [Rochor, Singapore](/wiki/Rochor). It formerly served as a community centre for the [Kampong Kapor](/wiki/Kampong_Kapor_Constituency) neighbourhood. ## History The two-storey building was completed for $110,000 in 1971 to replace an older community centre which burned down in a fire caused by arson in the previous year. It featured a roof garden, a library, a television room and space for court games such as basketball. It was the first community centre to feature a roof garden, which was to make way for a third floor if the centre needed an expansion. The funds for its construction were raised by the Kampong Kapor's Citizen Consultative. The centre was officially opened by then-[President of Singapore](/wiki/President_of_Singapore) [Benjamin Sheares](/wiki/Benjamin_Sheares) on 21 October 1971. At the opening ceremony, he was received by then-Member of Parliament for the Kampong Kapor Constituency [Yeo Toon Chia](/wiki/Yeo_Toon_Chia). This made the centre the first to have been opened by a president. By 1985, *[The Straits Times](/wiki/The_Straits_Times)* reported that the free television offered at the centre was still popular amongst elderly Indian men and construction workers, even though most households in Singapore had a television set by then. The newspaper noted that the number of people watching the television set at the centre increased on Thursdays and Fridays, which is when Tamil-language films were played. An official from the [People's Action Party](/wiki/People%27s_Action_Party) claimed that this was due to the centre's location, which was within [Little India](/wiki/Little_India,_Singapore). The building eventually ceased to function as a community centre. In September 2013, the Maya Dance Theatre held several performances at the building. It has also housed Singai Tamil Singam and arts organisation Apsar Asia. From 2014 to 2016, the building was occupied by the Boxfit Gym. By November 2020, the NATC Institute, a private education institute, had occupied the building. 1°18′23″N 103°51′15″E﻿ / ﻿1.30637°N 103.85425°E﻿ / 1.30637; 103.85425\n",
  "language": "en",
  "processed_at": "2026-01-12T09:49:23.046049",
  "title": "2 Kampong Kapor Road",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/2_Kampong_Kapor_Road"
}