{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:48:33.155795"
  },
  "content": "Disease outbreak in SingaporeThis article includes a list of general references, but **it lacks sufficient corresponding inline citations**. Please help to improve this article by introducing more precise citations. *(June 2022)* *(Learn how and when to remove this message)* In the **2005 dengue outbreak in Singapore**, a significant rise in the number of [dengue fever](/wiki/Dengue_fever) cases was reported in Singapore, becoming the country's worst health crisis since the 2003 [SARS](/wiki/SARS) epidemic. In October 2005, there were signs that the dengue fever outbreak had peaked, as the number of weekly cases had declined and the outbreak of this [infectious disease](/wiki/Infectious_disease) declined by the end of 2005. ## Status of outbreak **Status** (as of 31 December 2005)Number of cases14,209Number of deaths27 In 2005 there were a total of 14,209 dengue fever cases and 27 people died, a record death toll that would not be surpassed until (/wiki/2020_dengue_outbreak_in_Singapore). The outbreak peaked in the months of September and October, when it caused hospitals to cancel some elective surgery due to the need to allocate more beds for dengue patients.[*citation needed*] Singapore's health-care system is helping to maintain a low fatality rate at 0.2% (2005), which is lower than Southeast Asia's regional average of 0.8% in 2004, according to the [World Health Organization](/wiki/World_Health_Organization).[*citation needed*] The [National Environment Agency](/wiki/National_Environment_Agency) (NEA) said that the dengue fever problem may be worsening because of higher temperatures and changes in viral strains. The mean temperature has risen to 28.2 °C (82.8 °F) from 27.8 °C in 2003.[*citation needed*] In the second week of September, more than 100 new cases were reported daily and many were admitted to public hospitals. Health Minister [Khaw Boon Wan](/wiki/Khaw_Boon_Wan) said that one of the concerns is that more Singaporeans are infected with Dengue Type 3, which is a new strain of the dengue virus.[*citation needed*] Some experts, such as Dr [Paul Reiter](/wiki/Paul_Reiter), Professor of [Entomology](/wiki/Entomology) at the [Pasteur Institute](/wiki/Pasteur_Institute) in France, suggested that Singapore's success in suppressing the dengue has partly contributed to this year sudden increase in dengue cases. The population born over the last two decades has a low [herd immunity](/wiki/Herd_immunity) and therefore more susceptible to the virus. In January 2006, Environment and Water Resources Minister [Yaacob Ibrahim](/wiki/Yaacob_Ibrahim) declared the dengue outbreak is under control with average 84 cases weekly compared to a peak of more than 700. ## Inter-ministerial and inter-agency committees In September, an inter-ministerial committee headed by [Minister for the Environment and Water Resources](/wiki/Minister_for_the_Environment_and_Water_Resources), [Yaacob Ibrahim](/wiki/Yaacob_Ibrahim), was formed to tackle the dengue outbreak. [Yaacob Ibrahim](/wiki/Yaacob_Ibrahim) delivered a ministerial statement on the issue in the [parliament](/wiki/Parliament_of_Singapore) on 19 September. An inter-agency Dengue Coordination Committee and a community-centred Dengue Watch Committee have also been established. The Dengue Coordination Committee involves the permanent secretaries of the Environment, Health, and National Development ministries, and chief executive officers of key government statutory boards, and it aims to ensure that the various policy initiatives by the various ministries are well-coordinated. [Land Transport Authority](/wiki/Land_Transport_Authority) (LTA) would make sure that bus-stops, [Mass Rapid Transit](/wiki/Mass_Rapid_Transit_(Singapore)) stations, construction sites are free of mosquito breeding. [Singapore Land Authority](/wiki/Singapore_Land_Authority) (SLA) were also stepping up their checks on vacant state land and properties, while the [Housing and Development Board](/wiki/Housing_and_Development_Board) (HDB) and town councils are stepping up the cleaning of common areas. The Dengue Watch Committee is chaired by Khoo Tsai Kee who is the Senior Parliamentary Secretary for the Environment and Water Resources. He will co-ordinate with the five mayors in Singapore to reach out to the 84 advisers and the town councils, to oversee dengue prevention measures at the community level.[*citation needed*] A panel of experts had also been set up to advise the government on anti-dengue measures. The panel is chaired by Dr Chee Yam Cheng, Clinical Professor and Assistant chief executive officer of [National Healthcare Group](/wiki/National_Healthcare_Group).[*citation needed*] ## Preventive measures [Singapore in 2005](/wiki/2005_in_Singapore)Events - [117th IOC Session](/wiki/117th_IOC_Session) - [Avian influenza preparedness](/wiki/Singaporean_measures_against_avian_influenza) - Dengue outbreak - [Murder of Huang Na](/wiki/Murder_of_Huang_Na) - [Hurricane Katrina relief effort](/wiki/Singaporean_response_to_Hurricane_Katrina) - [Kashmir earthquake relief effort](/wiki/Singaporean_response_to_2005_Kashmir_earthquake) - [NKF controversy](/wiki/National_Kidney_Foundation_Singapore_scandal) - [Police MRT Unit established](/wiki/Public_Transport_Security_Command) - [Presidential election](/wiki/2005_Singaporean_presidential_election) - [Execution of Van Tuong Nguyen](/wiki/Van_Tuong_Nguyen) Others - [Counter-terrorism in Singapore](/wiki/Counter-terrorism_in_Singapore) - [Integrated resorts proposal](/wiki/Integrated_resort) - [Singapore Flyer proposal](/wiki/Singapore_Flyer) - v - t - e Singapore launched a number of measures to contain the dengue outbreak, including public awareness campaigns and regular [fogging](/wiki/Agriculture) with [insecticides](/wiki/Insecticide). 4,200 volunteers, 970 environmental control officers hired by construction sites, 350 so-called *\"mozzie busters\"* made up of girl guides and scouts, have participated in the preventive efforts.[*citation needed*] The [Ministry of Health](/wiki/Ministry_of_Health_(Singapore)) stepped up its monitoring of common mosquito breeding sites and launched an online map listing \"hotspots\" for the insects. Residents who allow [mosquitoes](/wiki/Mosquito) to breed in their homes can be fined between S$100 to S$200, and heavier penalties may be issued for construction sites found with standing water. The number of officers conducting such checks have tripled since the start of the year to 360, and may increase to 510 by December.[*citation needed*] The [National Environment Agency](/wiki/National_Environment_Agency) has allocated an additional S$7.5 million on top of its existing S$2.5 million budget to clear drains of [stagnant water](/wiki/Stagnant_water) where mosquitoes breed. [Singapore Land Authority](/wiki/Singapore_Land_Authority) has also stepped up its checks on vacant state properties.[*citation needed*] On 10 September, [National Environment Agency](/wiki/National_Environment_Agency) started collecting blood samples from residents of [Sims Avenue](/wiki/Sims_Avenue), a dengue hotspot, to help track the infection. The residents were asked to provide voluntarily 5 millilitres of blood sample and a swab of [saliva](/wiki/Saliva) for the study. The samples were to be analysed for [antibodies](/wiki/Antibodies) against dengue infection in the last 2 months. The [National Parks Board](/wiki/National_Parks_Board) (NParks) is considering removing broad-leafed plants which may breed mosquitoes. These plants like [palm trees](/wiki/Palm_tree) or any plants with [axils](/wiki/Axil) capable of trapping water, are potential breeding sites. Some town councils had removed some or all palm trees in their jurisdictions. Additional trimming of palm trees had been done by NParks to reduce potential breeding sites. As holes in tree trunks are also a concern, NParks had regularly filling these holes with sands. NParks has engaged 16 pest companies to prevent mosquito breeding in the parks it manages. Due to the dengue threat, some schools are cancelling excursions to the parks. By end of October, town councils are to employ dedicated pest control officers and engage in more frequent drain cleanings. ### Community response Health Minister [Khaw Boon Wan](/wiki/Khaw_Boon_Wan) urged the public to help in the fight against the disease. As households are common breeding grounds for [mosquitos](/wiki/Mosquito) and are less accessible for fogging, residents can help by checking for stagnant water in their households and neighbourhood and ensuring no blockage of drains. Due to the short life cycle of *[Aedes aegypti](/wiki/Aedes_aegypti)* [mosquitos](/wiki/Mosquito) (7 to 10 days), frequent checks are necessary to eradicate dengue. These checks only take several minutes and could potentially save lives.[*citation needed*] Dr Kevin Palmer, [World Health Organization](/wiki/World_Health_Organization)'s regional adviser for mosquito-borne diseases, said that it is important for ordinary residents to play their part. He added that fogging alone was not effective as winds could blow the insecticide away. [Yaacob Ibrahim](/wiki/Yaacob_Ibrahim) also said that fogging only kills adult mosquitoes, but not the [larva](/wiki/Larva) and therefore less effective compared to removing breeding sites. Singapore residents are also arming themselves with anti-mosquito products including [insecticides](/wiki/Insecticide), [repellents](/wiki/Insect_repellent) and electronic mosquito traps. For repellents, experts are recommending those with an active ingredients, such as [DEET](/wiki/DEET) which provide more effective and lasting protection.[*citation needed*] As a preventive measure, some residents bought a perennial grass plant, [Citronella](/wiki/Pelargonium_citrosum), and placing it at their home to repel mosquitos. The plant gives off a strong lemon-like fragrance which supposedly repels mosquitoes. To prevent the spread of the virus, those who are already infected with dengue are encouraged to use mosquito repellents, wear long-sleeved clothing and sleep under mosquito nets to prevent mosquitoes from biting them again and spreading the virus to others.[*citation needed*] ### Weekend blitz Minister for the Environment and Water Resources Yaacob Ibrahim informed Parliament that NEA officers with volunteers would conduct weekend blitz campaigns over six weeks, covering all estates, to destroy mosquito-breeding sites. #### First blitz, 17–18 September On the weekend of 17–18 September, more than 700 officers and volunteers launched a house-to-house campaign to remove breeding sites at four neighbourhoods, in what Minister [Mah Bow Tan](/wiki/Mah_Bow_Tan) described as *\"sort of a carpet-combing exercise\"*. The four neighbourhoods involved in the weekend blitz are [Ang Mo Kio](/wiki/Ang_Mo_Kio), [Yishun](/wiki/Yishun), [Hougang](/wiki/Hougang) and [Marsiling](/wiki/Marsiling), which are among the worst affected regions.[*citation needed*] In this *\"search-and-destroy\"* operation, mosquito-fighting *\"commandos\"* combed the streets, checked the drains, looked at the bins and the roof structures at all estates to seek and destroy breeding sites. They found 172 mosquito-breeding sites, mainly flower pot trays, water containers, litter in open area and tree holes. #### Second blitz, 24–25 September In the following weekend, the blitz was continued and covered five other areas such as [Toa Payoh](/wiki/Toa_Payoh)/[Bishan](/wiki/Bishan,_Singapore), [Tampines](/wiki/Tampines), [Choa Chu Kang](/wiki/Choa_Chu_Kang), [Bedok](/wiki/Bedok) and [Boon Lay](/wiki/Boon_Lay)/[Jurong](/wiki/Jurong), and 220 breeding sites were found and destroyed. #### Third blitz, 1–2 October More than one thousand volunteers were involved in this third blitz to cover areas including [Kallang](/wiki/Kallang), [West Coast](/wiki/West_Coast,_Singapore) and [Jurong East](/wiki/Jurong_East). 187 breeding sites were found and removed. ## Treatment In September, Singapore experienced a drastic rise of dengue cases. In the first week alone, 547 new cases were reported and many required hospital care. As the treatment lasts about 10 days, many hospitals across Singapore are experiencing shortage of hospitals beds. To cope with the strain, hospitals are postponing non-emergency operations to accommodate the dengue patients. General practitioners and polyclinics are on high alert to check for cases of dengue and are ordering more patients to have their blood tested for suspected dengue. The test, which takes fifteen minutes, is based on [platelet](/wiki/Platelet) count; dengue sufferers have 100,000 or lower platelet count as compared to 140,000 to 400,000 of a healthy person. If a suspected dengue patient is diagnosed, the patient will be referred to a hospital for more accurate testing.[*citation needed*] ## Dengue diagnostic kits In July 2005, a Singapore life science start-up company [Veredus Laboratories](/wiki/Veredus_Laboratories) launched a DNA- and RNA-based diagnostic kits for dengue, [avian influenza](/wiki/Avian_influenza) and [malaria](/wiki/Malaria). The kit is based on technologies licensed from [A*STAR](/wiki/A*STAR) and the [National University of Singapore](/wiki/National_University_of_Singapore). Another Singapore company Attogenix Biosystems has also developed a biochip called AttoChip which has successfully undergone an independent clinical trial conducted by [Tan Tock Seng Hospital](/wiki/Tan_Tock_Seng_Hospital) and is 98 percent accurate. The AttoChip identifies genes, viruses and bacteria-causing diseases from a blood sample. It can detect the presence of the dengue virus within two to three days of the onset of the virus. - [Mosquito control](/wiki/Mosquito#Control) - [2006 dengue outbreak in Pakistan](/wiki/2006_dengue_outbreak_in_Pakistan) - [2013 dengue outbreak in Singapore](/wiki/2013_dengue_outbreak_in_Singapore) - Sale of anti-mosquito products up at pharmacies, supermarkets – [Channel NewsAsia](/wiki/Channel_NewsAsia) (15 September 2005) - Dengue-hit Singapore to scour city for mosquitos – [Reuters](/wiki/Reuters) (14 September 2005) - Singapore out to destroy dengue mosquitoes – [Channel NewsAsia](/wiki/Channel_NewsAsia) (14 September 2005) - Aedes mosquito breeding patterns may have changed: experts – [Channel NewsAsia](/wiki/Channel_NewsAsia) (12 September 2005) - ENV to study how fogging practices are conducted – [Channel NewsAsia](/wiki/Channel_NewsAsia) (11 September 2005) - Health Minister seeks to reduce dengue cases by half Archived 1 October 2007 at the [Wayback Machine](/wiki/Wayback_Machine) – [Channel NewsAsia](/wiki/Channel_NewsAsia) (11 September 2005) - Current fogging practices ineffective in killing the Aedes mosquitoes – [Channel NewsAsia](/wiki/Channel_NewsAsia) (11 September 2005) - Inter-ministerial committee formed to tackle dengue situation – [Channel NewsAsia](/wiki/Channel_NewsAsia) (9 September 2005) - More hospitals receive dengue patients to relieve overcrowding – [Channel NewsAsia](/wiki/Channel_NewsAsia) (8 September 2005) - NEA to get blood, saliva samples in Sims Ave to test for dengue cases – [Channel NewsAsia](/wiki/Channel_NewsAsia) (8 September 2005) - NEA offers more funds to Town Councils to fight dengue – [Channel NewsAsia](/wiki/Channel_NewsAsia) (6 September 2005) - Singapore Escalates Fight Against Record Surge of Dengue Fever – bloomberg.com (2 September 2005) - Seven dead this year as dengue fever hits Singapore – [Reuters](/wiki/Reuters) (1 September 2005) - Doctors on high alert for dengue cases – [Channel NewsAsia](/wiki/Channel_NewsAsia) (1 September 2005) - https://web.archive.org/web/20051013060753/http://www.dengue.gov.sg/ – official website for Campaign Against Dengue - Dengue Hotspots – [Ministry of Health](/wiki/Ministry_of_Health_(Singapore)) - Dengue Prevention Checklist – [National Environment Agency](/wiki/National_Environment_Agency) - FAQs on Dengue – [Ministry of Health](/wiki/Ministry_of_Health_(Singapore)) - Weekly Infectious Diseases Bulletin – [Ministry of Health](/wiki/Ministry_of_Health_(Singapore))\n",
  "language": "en",
  "processed_at": "2026-01-12T09:48:33.155359",
  "title": "2005 dengue outbreak in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/2005_dengue_outbreak_in_Singapore"
}