{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:48:40.576804"
  },
  "content": "Haze over the Southeast Asia region in mid-2006[Southeast Asian haze](/wiki/Southeast_Asian_haze) seriesHaze in [Borneo](/wiki/Borneo), (/wiki/2019_Southeast_Asian_haze)History1990s - [1997 Southeast Asian haze](/wiki/1997_Southeast_Asian_haze) - [1997 Indonesian forest fires](/wiki/1997_Indonesian_forest_fires) 2000s - [2005 Malaysian haze](/wiki/2005_Malaysian_haze) - 2006 Southeast Asian haze - [2009 Southeast Asian haze](/wiki/2009_Southeast_Asian_haze) 2010s - [2010 Southeast Asian haze](/wiki/2010_Southeast_Asian_haze) - [2013 Southeast Asian haze](/wiki/2013_Southeast_Asian_haze) - [2015 Southeast Asian haze](/wiki/2015_Southeast_Asian_haze) - [2016 Malaysian haze](/wiki/2016_Malaysian_haze) - [2016 Southeast Asian haze](/wiki/2016_Southeast_Asian_haze) - [2017 Southeast Asian haze](/wiki/2017_Southeast_Asian_haze) - [2019 Southeast Asian haze](/wiki/2019_Southeast_Asian_haze) Key topics - [Chemical equator](/wiki/Chemical_equator) - Deforestation - [in Borneo](/wiki/Deforestation_in_Borneo) - [in Indonesia](/wiki/Deforestation_in_Indonesia) - [Mega Rice Project](/wiki/Mega_Rice_Project) - [Peat swamp forest](/wiki/Peat_swamp_forest) - [Borneo](/wiki/Borneo_peat_swamp_forests) Responses - [ASEAN Agreement on Transboundary Haze Pollution](/wiki/ASEAN_Agreement_on_Transboundary_Haze_Pollution) - [Operation Haze](/wiki/Operation_Haze) - [Transboundary Haze Pollution Act 2014](/wiki/Transboundary_Haze_Pollution_Act_2014) - [People's Movement to Stop Haze](/wiki/People%27s_Movement_to_Stop_Haze) See also - [Air pollution in Malaysia](/wiki/Air_pollution_in_Malaysia) - [API](/wiki/Air_Pollution_Index) - [Singapore PSI](/wiki/Pollutant_Standards_Index) - [Social and environmental impact of palm oil](/wiki/Social_and_environmental_impact_of_palm_oil) Category - v - t - e The **2006 Southeast Asian haze** was an air pollution event caused by continuous, uncontrolled burning from \"[slash and burn](/wiki/Slash_and_burn)\" cultivation in [Indonesia](/wiki/Indonesia), which affected several countries in the Southeast Asian region and beyond, including [Malaysia](/wiki/Malaysia), [Singapore](/wiki/Singapore), southern [Thailand](/wiki/Thailand), and as far away as [Saipan](/wiki/Saipan); the effects of the [haze](/wiki/Haze) may have even spread to [South Korea](/wiki/South_Korea). Local sources of industrial pollution also, inadvertently, contributed to increases in air [toxicity](/wiki/Toxicity) (particularly in already-polluted areas); notably at-risk areas included communities close to textile factories, fertilizer plants, meat-packing plants, industrialised dairy farms, shipping ports, and [oil refineries](/wiki/Oil_refineries). Air quality was lower, overall, for residents of more densely populated cities. In the highly urban and industrialised [Klang Valley](/wiki/Klang_Valley) of Malaysia, in particular, the surrounding elevated terrain acted as a natural retainer of polluted air, aggravating the situation as the haze set in. There is also a link to [El Niño](/wiki/El_Ni%C3%B1o). The haze was made worse than during previous occurrences by the [El Niño-Southern Oscillation](/wiki/El_Ni%C3%B1o-Southern_Oscillation) which delayed the year's monsoon season. Fires in Kalimantan produce great amounts of smoke, burn a long time and are difficult to extinguish because they are on [peatland](/wiki/Peat), and once lit the fires can burn for months and release gases that produce [sulphuric acid](/wiki/Sulphuric_acid). Air quality across the region appeared to improve in late October as heavy rainfall doused fires in Indonesia. ## Countries affected ### Brunei [Brunei](/wiki/Brunei), an independent [sultanate](/wiki/Sultanate) that is surrounded by [East Malaysia](/wiki/East_Malaysia)'s [Sarawak](/wiki/Sarawak) state on [Borneo](/wiki/Borneo), had been affected by the haze from [Kalimantan](/wiki/Kalimantan). Rains brought some relief, and on 8 October, the [Pollutant Standards Index](/wiki/Pollutant_Standards_Index) had dropped to 46, which is within the \"good\" range. There was a brief spell of clear skies during the first week of [Hari Raya](/wiki/Hari_Raya_Aidilfitri), following a spell of rainy weather. But the haze returned on 31 October, with the Department of Environment, Parks and Recreation recording a PSI of 49. ### Indonesia The fires originated mostly in [Kalimantan](/wiki/Kalimantan), the Indonesian part of [Borneo](/wiki/Borneo), and on [Sumatra](/wiki/Sumatra), where they are set by [swidden](/wiki/Swidden) agriculturists employed by agroforestry concerns to clear land to grow pulp woods or market crops ahead of the [growing](/wiki/Tillage) season. Satellite images taken over Borneo on 4 October revealed no less than 561 \"hot spots\" areas where fires had been set. Officials in neighbouring countries accused Indonesian officials of doing nothing to stop the fires, though forestry ministry officials said they had [firefighters](/wiki/Firefighting) “working” to douse the [blazes](/wiki/Forest_fire) on state-controlled land. However, they conceded that “most” of the fires were on private land. Indonesia planned to deploy its military to aid fire fighting effort. To recruit more people to man the fire line, the government offered two days off for civil servants who volunteered for fire duty. But the country lacked adequate equipment for fighting forest fires, having aeroplanes that were far too small to carry enough water to douse the flames. In a bid to obtain bigger aircraft, the government leased two [Beriev Be-200](/wiki/Beriev_Be-200) aircraft from [Russia](/wiki/Russia), which are capable of skimming over water and taking on loads for sustained firefighting efforts.[*citation needed*] The planes, which were flown and maintained by Russian crew, began operations on 1 November. The fires forced schools to close, delayed and cancelled airline flights, disrupted shipping, and forced Indonesians to don [face masks](/wiki/Mask). Cities affected include [Pontianak](/wiki/Pontianak,_Indonesia), [West Kalimantan](/wiki/West_Kalimantan), [Palangkaraya](/wiki/Palangkaraya), [Central Kalimantan](/wiki/Central_Kalimantan) and [Pekanbaru](/wiki/Pekanbaru), [Riau](/wiki/Riau). The haze was blamed for a [Mandala Airlines](/wiki/Mandala_Airlines) flight from [Balikpapan](/wiki/Balikpapan), the provincial capital of [East Kalimantan](/wiki/East_Kalimantan), skidding off the runway upon landing at [Tarakan](/wiki/Tarakan,_East_Kalimantan) on 3 October, when visibility was reported at around 400 metres. It has caused breathing problems for people in [Riau](/wiki/Riau) and in [Jambi Province](/wiki/Jambi). On 21 October 12 airlines cancelled domestic flights from [Soekarno-Hatta International Airport](/wiki/Soekarno-Hatta_International_Airport) due to smog at many destinations, including Jambi, [Banjarmasin](/wiki/Banjarmasin), [Jayapura](/wiki/Jayapura), [Semarang](/wiki/Semarang), [Surabaya](/wiki/Surabaya), [Bengkulu](/wiki/Bengkulu), [Denpasar](/wiki/Denpasar), [Makassar](/wiki/Makassar), Pekanbaru and [Padang](/wiki/Padang,_Indonesia). A 20 October report by Malaysian government news agency [BERNAMA](/wiki/BERNAMA) offered a first-hand account of the scene in Kalimantan: \"The suffocating smell of smoke, sore throat and eyes got worse when this reporter and a photographer stepped foot in central Kalimantan, forcing them to put on face masks. Throughout the 200-kilometre journey from Banjarmasin to Palangkaraya, what could be seen of the forests on both sides of the road was a landscape of blackish soil with smoke still billowing from the ground in some areas and of withering trees and plants. The area was foggy and dusty as the air was filled with flying ashes and other particles.\" Local villagers, the report said, appeared to be unconcerned with the smog, saying it was \"normal\". \"If we do not burn the forest, where are we going to get our food from?\" a villager said. On the environmental front, fires destroyed 1 km2 of the [Tesso Nilo National Park](/wiki/Tesso_Nilo_National_Park) in [Riau Province](/wiki/Riau). At the [Tanjung Puting National Park](/wiki/Tanjung_Puting_National_Park) in [Central Kalimantan](/wiki/Central_Kalimantan), the haze adversely affected the [orangutans](/wiki/Orangutan). ### Malaysia The effects of the haze started in early July and affected the northern [Malaysian](/wiki/Malaysia) states severely. However, the haze had cleared substantially throughout [Peninsular Malaysia](/wiki/Peninsular_Malaysia) from 29 August 2006 due to the arrival of the rainy season. The rain reduced the number of hotspots throughout Sumatra and the Malay Peninsula. On 30 August 2006, *[The Star](/wiki/The_Star_(Malaysia))* reported that Kuala Lumpur would be free of haze during the Independence Day. In the late evening just before midnight on 31 August 2006, the visibility in the Klang Valley was recorded to be very good. Unfortunately, the haze returned again in late September when Muslim Malaysians were experiencing [Ramadan](/wiki/Ramadan). This was partly due to a change of wind direction towards the southwest, partially caused by [Typhoon Xangsane](/wiki/Typhoon_Xangsane). The worst hit place was [Kuching](/wiki/Kuching). The Sarawak state government had declared that schools would close if the API breaches the 300 mark. The worst affected area in Peninsular Malaysia is [Johor Bahru](/wiki/Johor_Bahru) which recorded an API of 150 on 7 and 8 October. For now, [*when?*] many people are wearing [masks](/wiki/Mask) to prevent themselves from inhaling excessive amounts of haze. On 7 October, [visibility](/wiki/Visibility) in parts of [East Malaysia](/wiki/East_Malaysia) fell to 300 metres. On or about 9 October, the worst of the haze in Peninsular seemed to be in the state of [Negeri Sembilan](/wiki/Negeri_Sembilan), where [visibility](/wiki/Visibility) in [Sepang](/wiki/Sepang) fell briefly to 500 metres and the [API](/wiki/Air_Pollution_Index) in [Nilai](/wiki/Nilai) reached 198, before the rain relieved the haze partially. Shortly thereafter changing winds caused conditions to improve rapidly. [Sarawak](/wiki/Sarawak) has started [cloud seeding](/wiki/Cloud_seeding) attempts to try to encourage rainfall that will help relieve the haze. Each cloud seeding session costs at least [RM](/wiki/Ringgit_Malaysia)50,000 (roughly US$14,000). On 21 October, the winds has changed direction and started to blow the hazes away from Malaysia, and the following day, heavy rain has cleared the haze. Later on 26 October, the heavy rain returned again, and there were isolated showers in [Klang Valley](/wiki/Klang_Valley). [The Star](/wiki/The_Star_(Malaysia)) reported that the hazy days are soon coming to an end as the [monsoon](/wiki/Monsoon) season is approaching. #### Air pollution index Daily average API readings in October 2006Date[George Town](/wiki/George_Town,_Penang)[Kuala Lumpur](/wiki/Kuala_Lumpur)[Malacca Town](/wiki/Malacca_Town)[Johor Bahru](/wiki/Johor_Bahru)[Kuantan](/wiki/Kuantan)[Kuching](/wiki/Kuching)1382726505393228384648461123503857825212546082916678179568931036986163661101961088013678110194157100Unavailable86368124134139789631579866887810289084778472112670134947871122764170997180134979697172801463938589808115698590132987816627811011410861176097112129110681860106901248768195710084105757020578791128696321417582109667522377976956070233480739565662441767487615325474326554232263136374941332724283443523528284952574653292639606048493028424260515131245052725378Daily average API readings in November 2006Date[George Town](/wiki/George_Town,_Penang)[Kuala Lumpur](/wiki/Kuala_Lumpur)[Malacca Town](/wiki/Malacca_Town)[Johor Bahru](/wiki/Johor_Bahru)[Kuantan](/wiki/Kuantan)[Kuching](/wiki/Kuching)1325444594261231334553405033544285336534406037565060534553571407363456587047697374261724854834574663495294758416249511042513152484011314328493933122744324642381322342246433514333645585136 0–50 Good 51–100 Moderate 101–200 Unhealthy 201–300 Very unhealthy 301- Hazardous ### Singapore While the haze largely spared Singapore with 24-hour [Pollutant Standards Index](/wiki/Pollutant_Standards_Index) readings within the \"Good\" range for 15 days in September and the rest in the \"Moderate\" range and no higher than a reading of 66, its harmful effects became more prevalent in October. On 7 October 2006, the 3-hour PSI reading breached the 100 mark at 8 a.m. and entered unhealthy levels for the first time in the year, as winds from neighbouring [Sumatra](/wiki/Sumatra) blew the haze to Singapore. At 10 a.m., it hit 130, the highest in three years, before subsiding to 80 at 4 p.m. and climbing rapidly to 150 at 9 p.m., the worst since 1997, before ending the day at 136, still in the unhealthy range. Although the air quality was set to improve with the arrival of the [Northeast monsoon](/wiki/Northeast_monsoon) rains in mid-October, southeasterly winds extended the hazy season. A mild [El Niño](/wiki/El_Ni%C3%B1o) effect delayed the starting of the showers to late October or early November, or even until the end of November. The prolonged haze could be attributed to the extended dry season, which put the rains on hold and affected wind patterns which brought the haze to Singapore. Intermittent showers could occur in the pre-monsoon period, but these would do little in increasing air quality. The unpredictable winds in the pre-monsoon period could bring haze from either Sumatra or Kalimantan. Air quality remained in the moderate range for the next week until 14 October, when the 3-hour PSI readings gradually increased from 53 at 6 a.m. to peak at an unhealthy 116 at 10 p.m. This time, majority of the haze came from [Kalimantan](/wiki/Kalimantan). Similarly, on 15 October, the PSI readings increased from 69 at 6 a.m. to 98 at 3 p.m. and 4 p.m., 3 points short of reaching the unhealthy range. This eased to 82 by midnight. As winds remained southeasterly, haze from Kalimantan blew across the [South China Sea](/wiki/South_China_Sea) to Singapore. The next day, on 16 October, the PSI stayed in the 80s in the morning, before shooting up once again into the unhealthy range, hitting a high of 130 at 4 p.m. and 5 p.m. The 3-hour PSI remained in unhealthy levels for 8 consecutive hours, between 2 p.m. and 9 p.m. The haze obscured the sun, and symptoms of exposure to haze resurfaced in the general population. The 24-hour PSI for 16 October reached 98, just 3 points short of unhealthy. Visibility dropped to as low as 1 km in some areas, compared to the usual 20 km. The PSI on 17 October gradually increased from the moderate range in the morning to slip into the unhealthy range at 4 p.m., reaching 106, before declining back to 100 in the moderate range at 10 p.m. The hazy conditions were expected to persist. On 19 October, the PSI crept into the unhealthy range at 106 at 2 p.m., peaking at 113 at 4 p.m. The National Environment Agency reported that the situation would not improve the next day. Throughout the early morning on 20 October, the PSI kept in the 90s, before reaching a high of 103 at 8 a.m. This dropped to 74 by 7 p.m., although the PSI remained in the 90s in the afternoon. Even though rain fell in some areas, this was not enough to \"alleviate the haze situation\". The [NEA](/wiki/National_Environment_Agency) forecast thunderstorms over the weekend, but the southeasterly winds would continue to prevail. The 24-hour PSI on 20 October also reached the unhealthy range at 102. Later in October, though, the situation began to improve, with the PSI hitting a low of 11 at 2 p.m. on 26 October. However, in early November, intermonsoonal winds brought slight haze back to Singapore, with the 3-hour PSI in the moderate range most of the time. The highest 3-hour average PSI recorded prior to that point 226 in September 1997. #### Impact While some Singaporeans began donning face masks, others frequented shopping malls and public places like [VivoCity](/wiki/VivoCity), with many shopping before [Deepavali](/wiki/Deepavali) at [Little India](/wiki/Little_India,_Singapore), and going to [Geylang Serai](/wiki/Geylang_Serai)'s annual [Hari Raya](/wiki/Hari_Raya) bazaar. Stallholders said that the haze had not affected their business. However, Singaporeans generally kept indoors, with some staying away from [East Coast Park](/wiki/East_Coast_Park). The government announced plans for a haze action plan if the situation became \"extremely dangerous\", which included priority treatment for haze-related illnesses. Health Minister [Khaw Boon Wan](/wiki/Khaw_Boon_Wan) said that there was \"very little that (could) be done to stop the haze\", and advised people to remain indoors, especially those with prior respiratory conditions. Some minor haze-related illness began to surface, but free clinics across the island did not report any increase in patients with this symptoms. However, attendance figures at [polyclinics](/wiki/Polyclinic) islandwide increased by 600 cases to about 15,000 cases of haze-related conditions in the first week of October as compared to the same period last month. This is despite the [National Healthcare Group](/wiki/National_Healthcare_Group) reporting that the number of people \"complaining of the same ailments\" has decreased from the same period last year. [Air purifier](/wiki/Air_purifier) sales shot up during the hazy period. [Best Denki](/wiki/Best_Denki), an electronic store, sold [S$](/wiki/Singapore_dollar)350,000 worth of air purifiers and related items in 4 days, a 300 percent increase. However, experts from the Institute of Environmental Science & Engineering at the [Nanyang Technological University](/wiki/Nanyang_Technological_University) said that only some of these products, like High Efficiency Particulate [air filters](/wiki/Air_filter), would effectively remove small particles from air. Other kinds of air purifiers like [ionizing purifiers](/wiki/Air_ionizer) gave off [ozone](/wiki/Ozone) which could cause symptoms similar to those caused by the haze. The experts recommended regularly cleaning the filter media and opening windows to get some fresh air at night. The [western region](/wiki/West_Region,_Singapore), which includes [Boon Lay](/wiki/Boon_Lay), [Choa Chu Kang](/wiki/Choa_Chu_Kang) and [Jurong](/wiki/Jurong), seemed to be the \"[epicentre](/wiki/Epicentre)\" of the haze. Residents there complained of the worse conditions in their area, saying that it felt \"hotter than usual\", and health problems were more widespread. The air quality levels in the west may have consistently been the worst, but only by several points. Some speculated that the more polluted air was caused by the many construction sites and [industrial parks](/wiki/Industrial_park) in [Jurong](/wiki/Jurong), but NEA refuted this, claiming that they did not contribute to the haze. Polyclinics in Jurong and [Bukit Batok](/wiki/Bukit_Batok) had an increase of 20 percent admission for patients with respiratory problems and [asthma](/wiki/Asthma). Schools islandwide restricted outdoor activities and had to rethink post-examination activities and training or revert to wet-weather programmes. The [Singapore Sports School](/wiki/Singapore_Sports_School)'s swim team had to cut back on training when the haze reached unhealthy levels even though they were in the midst of various international competitions. The [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)) recommended that schools suspend all outdoor activities when the PSI reading passes 100, but some schools chose to move indoors regardless of the PSI. Many Singaporean \"fitness buffs\" also made the move indoors. [Fitness clubs](/wiki/Fitness_club) reported increases in turn-outs and check-ins, utilising gym facilities rather than outdoor activities. [Rock climbers](/wiki/Rock_climbing) were also affected, and began to move activities indoors instead. The haze also caused increased sales and rental of entertainment [VCD](/wiki/Video_CD) and DVD titles, but cinema attendance was unchanged. The National Environment Agency website received about 170,000 hits on 14 October, as compared to the usual 60,000, and caused the server to temporarily go down due to the sheer volume of traffic. According to economists, Singapore suffered a US$50 million economic loss due to the onset of the haze in 2006. #### PSI readings 24-hour PSI readings in October 2006Date[North](/wiki/North_Region,_Singapore)[South](/wiki/Central_Region,_Singapore)[East](/wiki/East_Region,_Singapore)[West](/wiki/West_Region,_Singapore)[Central](/wiki/Central_Area,_Singapore)Overall140413834374127073716870733556254615862439513952415254953415445546566555805780711712810112211212887386711098010994952505252521059565759555911676460717071126563607166711350464354475414635758725772159289939388931689949198929817858086928492188478759279921976717381728120979896102961022175797581818122737167747374237481797780812452464558515825383333443844263129323836382729222431283128393838464246295245375250523052505053515331555148565356**Avg****62.7****62.9****59.3****68.6****62.6****69.4** 0–50 Good 51–100 Moderate 101–200 Unhealthy 201–300 Very unhealthy 301- Hazardous ### Thailand In July, the southern [Thai](/wiki/Thailand) provinces of [Pattani](/wiki/Pattani_Province) and [Satun](/wiki/Satun_Province) suffered an on-and-off bout of smog, with the levels of pollutants in Satun being high enough to constitute a health hazard. In all, seven provinces were affected by the haze in July and August. Haze was again reported on 6 October, with respiratory illnesses and eye irritation reported in [Narathiwat](/wiki/Narathiwat_Province). Visibility and air quality were also affected in [Songkhla](/wiki/Songkhla_Province), Satun and [Yala](/wiki/Yala_Province). Health warnings were issued and [surgical masks](/wiki/Surgical_mask) were issued to residents. Three days later, meteorological officials reported that the haze had thinned to almost normal visibility. Strong winds in the region brought haze from Indonesia back into Songkhla, Satun, Pattani, Yala and Narathiwat provinces on 17 October. Visibility in Yala and Songkhla was reduced to less than a kilometre, and officials warned fishermen going out to the [Andaman Sea](/wiki/Andaman_Sea) and [Gulf of Thailand](/wiki/Gulf_of_Thailand) to \"stay vigilant\". Drivers were also asked to turn on their headlights. ## ASEAN Ministerial Meeting on Transboundary Haze Pollution Malaysia and Singapore criticised the way Indonesia handled the issue. Both urged the latter to ratify the [ASEAN Agreement on Transboundary Haze Pollution](/wiki/ASEAN_Agreement_on_Transboundary_Haze_Pollution). The Malaysian Environment Minister [Azmi Khalid](/wiki/Azmi_Khalid) said \"Frustration is an understatement\", directed toward Indonesia. There was also a protest in front of the Indonesia embassy in Kuala Lumpur, organised by local political parties. Singaporean Prime Minister Lee Hsien Loong expressed disappointment toward Indonesia soon after Azmi Khalid made his view public. In response to the letter, Indonesian President apologised for the regional haze. Indonesia has earlier stated that it lacked the resources to combat the burning effectively. Singapore proposed regional talks on the haze, to be held in Singapore. Indonesia, however, requested such talks to be held in [Pekan Baru](/wiki/Pekan_Baru), [Kalimantan](/wiki/Kalimantan) instead. The request was agreed to and talks were held on 13 October 2006. At the meeting, Malaysia proposed the setting up of a regional fund to help combat the environmental disaster. With the arrival of the northeastern winter [monsoons](/wiki/Monsoons) in December, the haze problem was effectively ended for 2006. - [1997 Southeast Asian haze](/wiki/1997_Southeast_Asian_haze) - [2005 Malaysian haze](/wiki/2005_Malaysian_haze) - [2013 Southeast Asian haze](/wiki/2013_Southeast_Asian_haze) - [2015 Southeast Asian haze](/wiki/2015_Southeast_Asian_haze) - [Air quality index](/wiki/Air_quality_index) - [Haze](/wiki/Haze) - [Pollutant Standards Index](/wiki/Pollutant_Standards_Index) - [Slash and burn](/wiki/Slash_and_burn) - [Asian brown cloud](/wiki/Asian_brown_cloud) ## Imagery - NASA MODIS imagery of fires - Latest schematic of area affected by haze over the region - Latest hotspot map - National Environment Agency -online forms Current PSI readings in Singapore - Haze alert News archive at [Channel NewsAsia](/wiki/Channel_NewsAsia) 3°21′17″N 117°35′48″E﻿ / ﻿3.35468°N 117.59654°E﻿ / 3.35468; 117.59654\n",
  "language": "en",
  "processed_at": "2026-01-12T09:48:40.576321",
  "title": "2006 Southeast Asian haze",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/2006_Southeast_Asian_haze"
}