{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:48:33.344958"
  },
  "content": "2006-07 floods in Southeast Asia Region The **2006–2007 Southeast Asian floods** were a series of [floods](/wiki/Flood) that mostly affected Malaysia from 18 December 2006 to 13 January 2007. The floods were caused by above average rainfall, which was attributed to [Typhoon Utor (2006)](/wiki/Typhoon_Utor_(2006)) which had hit the Philippines and Vietnam a few days earlier. By the third week of January 2007, Johor had been affected by a larger flood. [Singapore](/wiki/Singapore) and certain parts of [Indonesia](/wiki/Indonesia) were flooded due to the same typhoon. Throughout the week starting 18 December 2006, a series of [floods](/wiki/Flood) hit [Johor](/wiki/Johor), [Malacca](/wiki/Malacca), [Pahang](/wiki/Pahang) and [Negeri Sembilan](/wiki/Negeri_Sembilan). During this period, these southern Malaysian states, along with [Singapore](/wiki/Singapore), experienced abnormally high rainfall which resulted in massive floods. The rainfall recorded in the city of [Johor Bahru](/wiki/Johor_Bahru) on 19 December amounted to 289mm compared to the average annual rainfall of the city which is 2400mm. In Singapore, the 24-hour rainfall recorded on 20 December was 366 mm, the third highest recorded rainfall in 75 years. The flooding began when torrential downpours since Sunday caused rivers and dams to overflow. Weather officials described the flooding as the worst in the area in a century. At least six people died. Later that week, beginning 22 December, [North Sumatra](/wiki/North_Sumatra) experienced abnormally high rainfall which also caused flooding. ## Causes Typhoon Utor was blamed for heavy rains of up to 350 mm within 24 hours in southern Peninsular Malaysia, specifically [Johor](/wiki/Johor), [Negeri Sembilan](/wiki/Negeri_Sembilan), [Malacca](/wiki/Malacca) and [Pahang](/wiki/Pahang), causing massive floods within the southern region on 18 December 2006, which were considered as the worst in the history of the southern region of Malaysia. However, there were also reports a few days earlier that adverse weather was not to be blamed on the typhoon. The worst-affected areas were [Segamat](/wiki/Segamat) and [Kota Tinggi](/wiki/Kota_Tinggi), where both towns were totally inaccessible via land transport routes after all main roads leading to those towns were flooded. As of 4 January 2007, the floods had claimed 15 lives. Heavy rains were expected in [Penang](/wiki/Penang), [Perak](/wiki/Perak), [Kelantan](/wiki/Kelantan) and other states in the northern region during this period. ## Areas affected ### Indonesia The floods affected areas such as [Aceh](/wiki/Aceh) and [North Sumatra](/wiki/North_Sumatra), leaving many homeless. The floods lasted for a week starting on 22 December. An estimated 400,000 people were displaced at the peak of the flooding with at least 118 people dead and 155 people missing as of 29 December 2006. ### Malaysia #### Johor Several districts in Johor including [Batu Pahat](/wiki/Batu_Pahat), [Johor Bahru](/wiki/Johor_Bahru), [Kluang](/wiki/Kluang), [Kota Tinggi](/wiki/Kota_Tinggi), [Mersing](/wiki/Mersing), [Muar](/wiki/Muar_(town)), [Pontian](/wiki/Pontian,_Johor) and [Segamat](/wiki/Segamat) were flooded. Between 60,000 and 70,000 people had been evacuated in the state while food shortage at relief centres had been reported. Flooded roads disrupted the delivery of aid to flood centres. Most of the flood victims had been living without clean water or electricity for days. According to health authorities, reports of water-borne diseases were on the rise. In some areas, looting was reported after floodwaters receded. The second bout of flooding, which was larger than the first one, had almost paralysed Johor after all 8 districts were submerged by the flood. The areas worst affected by the second flood were [Batu Pahat](/wiki/Batu_Pahat) and [Kluang](/wiki/Kluang). Both waves of the flood disaster were considered as the costliest flood in Malaysian history, with the total cost of damage caused by the floods standing at RM 1.5 billion. In the early morning of 12 January 2007, floodwaters were slowly rising at Jalan Jaffar in Kota Tinggi, while the residents were all shifting their goods in preparation for the second flood. In the morning of 13 January 2007 around 4:00 a.m., the Sungai Semberong bridge at Batu 5, Jalan [Kluang](/wiki/Kluang)-[Mersing](/wiki/Mersing) (**[Federal route 50](/wiki/Malaysia_Federal_Route_50)**) collapsed after being washed by strong currents. ### Malacca In [Malacca](/wiki/Malacca) , 3,193 people from 691 families from Melaka Tengah, [Alor Gajah](/wiki/Alor_Gajah) and [Jasin](/wiki/Jasin_District) left their homes due to rising waters. A total of 35 relief centres were opened, with the floods regarded the worst for the three districts in 15 years. #### Pahang In [Pahang](/wiki/Pahang), more than 2,000 people were evacuated in several areas in [Rompin](/wiki/Rompin), especially in [Bandar Tun Abdul Razak](/wiki/Bandar_Tun_Abdul_Razak). After more than 10 hours of continuous rain, people in Kampung Rekoh in Bandar Tun Abdul Razak were evacuated to nearby community halls. Other affected areas were Kampung Kurnia, Yayasan Estate and Yayasan Estate II. More than 6,000 residents, including settlers in nine Felda Selancar schemes, were also stranded because of two badly damaged bridges in the area. #### Negeri Sembilan In [Negeri Sembilan](/wiki/Negeri_Sembilan), the various government departments in charge of flood relief in the state were fully prepared and on standby, said Menteri Besar Datuk Seri [Mohamad Hasan](/wiki/Mohamad_Hasan_(politician)).[*citation needed*] Flooded areas include [Gemas](/wiki/Gemas) and [Gemencheh](/wiki/Gemencheh) and a total of 80 people have been evacuated so far.[*citation needed*] ### Singapore Continuous heavy rain since Monday, 18 December drenched Singapore, resulting in the third highest rainfall of 366mm recorded on Tuesday. The heaviest rain Singapore recorded was 512.4mm on 2 December 1978, followed by 469mm in December 1969. Severe floods affected areas such as Thomson, Mandai and Olive Road, severely affecting the business in Goodwood Florist as it is a low lying area. By 11pm, floodwaters have subsided in all flooded areas of Singapore except Olive Road. ## Reactions ### Prime Minister's response Malaysian Prime Minister, [Abdullah Ahmad Badawi](/wiki/Abdullah_Ahmad_Badawi) expressed his sadness over the disaster. When the flooding started, he just finished a 3-day visit to [Venezuela](/wiki/Venezuela) and had just left for a vacation. He was back in Malaysia by 23 December 2006.[*citation needed*] ### Disaster Relief Several government agencies and NGOs provided assistance and aid to the victims during and after the floods. The [Malaysian Red Crescent Society](/wiki/Malaysian_Red_Crescent_Society) distributed hygiene kits to victims. The organisation also deployed several boats to the affected areas. [MERCY Malaysia](/wiki/Mercy_Malaysia) deployed 78 volunteers and also appealed for public donations to assist the victims. The [Tzu Chi Foundation](/wiki/Tzu_Chi) mobilised over 4,200 volunteers from both Malaysia and Singapore and have helped over 46,000 flood victims in 4 states. ### International response Aid was given to Malaysia by various international non-governmental organisations and countries such as United Sikhs, Red Crescent, United States of America, and Taiwan. [*citation needed*] The [Singapore Red Cross Society](/wiki/Singapore_Red_Cross) sent volunteers to assist in the state of Johor. The society also sent aid worth RM22,600. The [United States](/wiki/United_States) government, through the U.S. Agency for International Development (USAID) provided $50,000 through the U.S. Embassy to the [Malaysian Red Crescent](/wiki/Malaysian_Red_Crescent) to support emergency relief efforts. The [IFRC](/wiki/IFRC) allocate CHF 50,000 (US$41,425) from the Federation's Disaster Relief Emergency Fund (DREF) on 25 December 2006 to support the Malaysian Red Crescent's initial relief efforts. - [Floods in Malaysia](/wiki/Floods_in_Malaysia) - [2007 Jakarta flood](/wiki/2007_Jakarta_flood) - Tangang, Fredolin T. (2008). \"On the roles of the northeast cold surge, the Borneo vortex, the Madden-Julian Oscillation, and the Indian Ocean Dipole during the extreme 2006/2007 flood in southern Peninsular Malaysia\". *Geophysical Research Letters*. **35** (14): L14S07. [Bibcode](/wiki/Bibcode_(identifier)):2008GeoRL..3514S07T. [doi](/wiki/Doi_(identifier)):10.1029/2008GL033429. [S2CID](/wiki/S2CID_(identifier)) 140577044.\n",
  "language": "en",
  "processed_at": "2026-01-12T09:48:33.344495",
  "title": "2006–2007 Southeast Asian floods",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/2006%E2%80%932007_Southeast_Asian_floods"
}