{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:48:37.709259"
  },
  "content": "The **Wee Shu Min elitism controversy** occurred in October 2006 in [Singapore](/wiki/Singapore). Wee Shu Min, daughter of [parliament member](/wiki/Parliament_of_Singapore) [Wee Siew Kim](/wiki/Wee_Siew_Kim) and a then eighteen-year-old student on Raffles Junior College's Humanities scholarship programme, found herself in controversy after posting on her blog what were viewed by some Singaporeans to be [elitist](/wiki/Ivory_tower), naïve, and insensitive statements against heartlanders. Dismissing the views of Derek Wee who voiced concerns on [job security](/wiki/Job_security) and [age discrimination](/wiki/Age_discrimination) on his blog, she shot back with a take-no-prisoners diatribe, calling Derek a \"stupid crackpot\", belonging to \"the sadder class\" and overreliant on the government. Her post also called for Derek to \"get out of my elite uncaring face\". Her response triggered an avalanche of criticism, as it came on the heels of the sensational suicide of an individual (said to be facing financial difficulties) at [Chinese Garden MRT station](/wiki/Chinese_Garden_MRT_station). As a result, her name topped [Technorati](/wiki/Technorati)'s search terms for a week. She has since appeared to have apologised on another blog and shut down her own. ## Response In response to the controversy, Wee Siew Kim stated that he supported Shu Min's point in principle and that \"*people cannot take the brutal truth,*\" but he and Shu Min's college principal also expressed disappointment and counselled her to be more sensitive towards others. Wee also claimed that his daughter's privacy had been violated. Critics pointed out however, that he appeared to have endorsed her elitist remarks and failed to address values such as empathy and humility, and that he was apologising for the tone, but not the content of his daughter's response. In 2019, after a remark made by [Raffles Girls' School](/wiki/Raffles_Girls%27_School)'s staff on the school's relocation to a neighbourhood estate, concerns about elitist sensibilities, similar to Wee, were raised again. ## Public backlash Two days after Wee Siew Kim first spoke out in *[The Straits Times](/wiki/The_Straits_Times)*, he made a public apology to those who were offended by statements made in his interview, in particular Derek Wee. Commentators used the controversy as evidence that Singapore was suffering from increasing signs that [political elitism](/wiki/Elitism), \"smarter-than-thou\" snobbery and [class consciousness](/wiki/Class_consciousness) anxiety were creeping into its [meritocracy](/wiki/Meritocratic) model, a widening [social stratification](/wiki/Social_stratification) that will cause long-term implications for Singaporean society, and [problems in the education system](/wiki/Education_in_Singapore#Criticisms) that need to be addressed. The controversy was subsequently raised and hotly debated again in the opening session of the [Parliament](/wiki/Parliament_of_Singapore) by fellow MP [Sin Boon Ann](/wiki/Sin_Boon_Ann), who pointed out that elitism was now an open secret in several aspects of Singapore society, including education, the [military](/wiki/Singapore_Armed_Forces) and the civil service, commenting that it is necessary \"(to) break down the institution of snobbery within our society.\"\n",
  "language": "en",
  "processed_at": "2026-01-12T09:48:37.708806",
  "title": "2006 Singapore elitism controversy",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/2006_Singapore_elitism_controversy"
}