{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:48:42.362729"
  },
  "content": "Diplomatic incident in Bukit Panjang, Singapore The **Singapore Romanian diplomat incident** occurred on 15 December 2009, when three pedestrians were struck in a [hit-and-run](/wiki/Hit_and_run_(vehicular)) in the Singapore suburb of [Bukit Panjang](/wiki/Bukit_Panjang). The vehicle, a black [Audi A6](/wiki/Audi_A6) bearing [diplomatic license plates](/wiki/Diplomatic_license_plates), was later identified as being driven by Dr Silviu Ionescu, at the time [Chargé d'Affaires ad interim](/wiki/Charg%C3%A9_d%27affaires#Chargés_d'affaires_ad_interim) of the Romanian Embassy in Singapore. At approximately 3 am, the vehicle ran two red lights and hit the pedestrians on a pedestrian crossing, injuring two and killing one. Approximately 40 minutes after the incident, Ionescu reported the vehicle as being stolen. The car was later found abandoned in [Sungei Kadut](/wiki/Sungei_Kadut) approximately 4 hours after the collisions. Singapore began an investigation into the incident. Romanian authorities also commenced an investigation into the incident on 6 January 2010, and formally indicted Ionescu on charges on 2 February. A Singapore coroner's inquiry held in early March 2010 determined the vehicle had not been stolen and was being driven by Ionescu at the time of the incident. Ionescu, who had left Singapore three days after the incident, declined to return to Singapore for the proceedings. Singapore authorities have used diplomatic law to interview Ionescu's driver, but Romania has declined several requests to [extradite](/wiki/Extradition) Ionescu himself. Ionescu was arrested by Romanian authorities in May 2010. His trial in Romania began in July 2010, and in March 2013, he was sentenced to 3 years' jail after being found guilty of manslaughter, negligent bodily injury and leaving the scene of a crash. Ionescu appealed, with the result arriving in February 2014, with the Court of Appeal upholding his conviction and doubling his sentence from 3 years to 6 years. ## Incident At approximately 3 am on 15 December 2009, Malaysians Tong Kok Wai, 30, his friend Bong Hwee How, 24, and Singaporean Muhd Haris Abu Talib, 18, were on a [pedestrian crossing](/wiki/Pedestrian_crossing) in Bukit Panjang. Eyewitnesses reported seeing a black Audi A6 with diplomatic license plates run through two red traffic lights before hitting the three men. Bong suffered severe head injuries, including [post-traumatic amnesia](/wiki/Post-traumatic_amnesia). Tong suffered the most severe of injuries. After three days in hospital, he slipped into a coma and was pronounced [brain dead](/wiki/Brain_death) on 18 December 2009. He was taken off [life support](/wiki/Life_support) on 25 December. The abandoned Audi was later recovered by police in the [Sungei Kadut](/wiki/Sungei_Kadut) neighbourhood. Ionescu had reported the vehicle as stolen approximately 40 minutes after the incident. According to his police statement, Ionescu drove the car to his diplomatic office shortly before 3 am. Shortly thereafter, he noticed the car was missing, at which time he reported it stolen. He then asked his driver, Marius Trusca, to drive him around in search of the car. After 20 minutes of searching, he took a taxi to his private residence. Police reports filed in a Singapore court differ from Ionescu's account. Police say Ionescu's driver was not working the night of the incident and was not called in to look for the vehicle until almost 9 am, rather than 3 am as reported by Ionescu. Three days after the incident, Ionescu returned to Romania. ## Investigation The Romanian government recalled Ionescu from his post in Singapore with effect from 5 January 2010 and the case was referred to the Romanian Prosecutor's Office. On 6 January, the Romanian prosecutor's office opened a criminal investigation and officially requested information about the case from Singaporean authorities. The Romanian Foreign Ministry also suspended Ionescu from his duties following the Romanian Prosecutor's Office's starting of a criminal investigation regarding the incident. It also distanced itself from Ionescu since he was excused from his diplomatic position, saying his statements carry the weight of any common citizen. On 28 January, Singapore police revealed they had evidence that Ionescu was the driver in the hit-and-run. His presence, as well as that of his Romanian driver, was requested for the coroner's inquest into Tong's death. Singapore completed a coroner's inquiry into the events on 31 March 2010. Based on the witnesses (one of whom identified Ionescu as the driver at the time of the incident) and evidence presented by police in the coroner's inquiry, it was concluded that Ionescu was the driver of the vehicle at the time of the incident. In response to the allegations, Ionescu said, \"Honestly, I don't believe in the court of Singapore\". Since the coroner's inquiry, a \"joint technical committee\" was established between Singapore and Romania, which intended to pursue legal action against Ionescu. Pending such action, Singapore has filed 13 charges against Ionescu and as well as issued an [arrest warrant](/wiki/Arrest_warrant) against him. The Romanian government seized a property in Bucharest belonging to Ionescu on 3 February 2010 with the aim of \"satisfying the claims of the civil parties.\" Meanwhile, [Interpol](/wiki/Interpol) issued an international arrest warrant for Ionescu in April 2012. ## Arrest and trial Ionescu was arrested by Romanian authorities in May 2010. On 1 July, the Romanian State Prosecutor charged Ionescu with culpable homicide, grievous bodily harm with intent, deserting the place of an accident and providing false evidence to the police. On 27 March 2013, a Bucharest district court found Ionescu guilty of manslaughter, negligent bodily injury and leaving the scene of an accident, and sentenced him to three years' jail. Ionescu's appeal kept him out of jail and led to the case being brought to the Bucharest's Court of Appeal, with Ionescu twice filing for postponements. On 13 February 2014, the Court of Appeal upheld his conviction and doubled his sentence from 3 years to 6 years, after taking into account the State Prosecution Service's arguments that Ionescu showed no remorse for a grave crime which he continued to deny despite the weight of the evidence against him, and that he had deformed Romania's international reputation. In response, the Singapore government welcomed the decision. ## Public response As Ionescu could not be brought back to Singapore for trial due to [diplomatic immunity](/wiki/Diplomatic_immunity) and the absence of an [extradition treaty](/wiki/Extradition) between Singapore and Romania, the incident triggered public outrage in Singapore. There was also an outcry in Malaysia as the deceased was a Malaysian working in Singapore. The family of the deceased sought help from the Malaysian government, but was turned down as it was considered an internal matter between Singapore and Romania. ## Death of Ionescu On 9 December 2014, Ionescu died in a Bucharest jail hospital due to cardiorespiratory problems. It was less than a year after his final sentencing. 1°22′35.1″N 103°46′23.8″E﻿ / ﻿1.376417°N 103.773278°E﻿ / 1.376417; 103.773278\n",
  "language": "en",
  "processed_at": "2026-01-12T09:48:42.362190",
  "title": "2009 Singapore Romanian diplomat incident",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/2009_Singapore_Romanian_diplomat_incident"
}