{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:48:49.084203"
  },
  "content": "Haze over the Southeast Asia region in mid-2010[Southeast Asian haze](/wiki/Southeast_Asian_haze) seriesHaze in [Borneo](/wiki/Borneo), (/wiki/2019_Southeast_Asian_haze)History1990s - [1997 Southeast Asian haze](/wiki/1997_Southeast_Asian_haze) - [1997 Indonesian forest fires](/wiki/1997_Indonesian_forest_fires) 2000s - [2005 Malaysian haze](/wiki/2005_Malaysian_haze) - [2006 Southeast Asian haze](/wiki/2006_Southeast_Asian_haze) - [2009 Southeast Asian haze](/wiki/2009_Southeast_Asian_haze) 2010s - 2010 Southeast Asian haze - [2013 Southeast Asian haze](/wiki/2013_Southeast_Asian_haze) - [2015 Southeast Asian haze](/wiki/2015_Southeast_Asian_haze) - [2016 Malaysian haze](/wiki/2016_Malaysian_haze) - [2016 Southeast Asian haze](/wiki/2016_Southeast_Asian_haze) - [2017 Southeast Asian haze](/wiki/2017_Southeast_Asian_haze) - [2019 Southeast Asian haze](/wiki/2019_Southeast_Asian_haze) Key topics - [Chemical equator](/wiki/Chemical_equator) - Deforestation - [in Borneo](/wiki/Deforestation_in_Borneo) - [in Indonesia](/wiki/Deforestation_in_Indonesia) - [Mega Rice Project](/wiki/Mega_Rice_Project) - [Peat swamp forest](/wiki/Peat_swamp_forest) - [Borneo](/wiki/Borneo_peat_swamp_forests) Responses - [ASEAN Agreement on Transboundary Haze Pollution](/wiki/ASEAN_Agreement_on_Transboundary_Haze_Pollution) - [Operation Haze](/wiki/Operation_Haze) - [Transboundary Haze Pollution Act 2014](/wiki/Transboundary_Haze_Pollution_Act_2014) - [People's Movement to Stop Haze](/wiki/People%27s_Movement_to_Stop_Haze) See also - [Air pollution in Malaysia](/wiki/Air_pollution_in_Malaysia) - [API](/wiki/Air_Pollution_Index) - [Singapore PSI](/wiki/Pollutant_Standards_Index) - [Social and environmental impact of palm oil](/wiki/Social_and_environmental_impact_of_palm_oil) Category - v - t - e The **2010 Southeast Asian haze** was an [air pollution](/wiki/Air_pollution) crisis that affected many [Southeast Asian](/wiki/Southeast_Asia) countries such as [Indonesia](/wiki/Indonesia), [Malaysia](/wiki/Malaysia) and [Singapore](/wiki/Singapore) during October 2010. The crisis occurred during the dry season, whilst forest fires were being illegally set off by Indonesian [smallholders](/wiki/Smallholding) residing in the districts of [Dumai](/wiki/Dumai) and [Bengkalis](/wiki/Bengkalis), in the [Riau province](/wiki/Riau) of [Sumatra](/wiki/Sumatra). These farmers adopted the [slash-and-burn](/wiki/Slash_and_burn) method to clear off land rapidly for future farming opportunities. Due to the [El Niño](/wiki/El_Ni%C3%B1o) weather pattern, the [westerly winds](/wiki/Westerly_wind_burst) carried [haze](/wiki/Haze) towards Indonesia's neighboring countries causing the air quality in Malaysia and Singapore to dip to an unhealthy range for several days. The hazy conditions not only resulted in the reduction in air quality but also caused poor visibility, multiple closures of schools in Malaysia and an influx of [respiratory illnesses](/wiki/Respiratory_disease). The recorded air quality in Singapore was the worst it had been since 2006, and on October 18 the hotspot count in Sumatra reached a maximum of 358. Despite ministers meeting up a week before the crisis for the 6th meeting of the [Association of Southeast Asian Nation (ASEAN)](/wiki/Association_of_Southeast_Asian_Nations) agreement, whereby issues on the transboundary haze and methods to tackle [forest fires](/wiki/Wildfire) were discussed, the [Indonesian government](/wiki/Government_of_Indonesia) failed to successfully regulate and enforce laws on [illegal logging](/wiki/Illegal_logging_in_Indonesia). This caused Indonesia to face much criticism from neighboring countries. On 24 October 2010, rainy conditions returned to Indonesia which helped reduce haze production and provided relief to air quality levels. ## Causes Forest fires are mainly set off illegally by farmers who adopt the slash-and-burn method to clear large areas of [peat](/wiki/Peat) and land for future plantation opportunities such as [palm oil](/wiki/Palm_oil_production_in_Indonesia) and [pulp wood](/wiki/Pulpwood) plantations. Despite the illegality of slash-and-burn land clearing in Indonesia, smallholders adopt this method due to its perceived economical and environmental benefits. Not only is slash-and-burn considered efficient and cost-effective, it is also believed to be advantageous towards [crop yield](/wiki/Crop_yield) and growth. [Ash](/wiki/Ash) is produced and used as [fertilizers](/wiki/Fertilizer) by smallholders due to its ability to enhance soil nutrients, balance soil pH levels, eradicate pests as well as prevent the growth of weeds. Furthermore, as alternate land clearing methods are known to be more expensive and less beneficial, farmers tend to ignore the law and continue with illegal logging activities. Peatland fires were the origin of 90% of the smoke created during these burns, and they can generate up to 6 times more [particulate matter](/wiki/Particulate_pollution) than normal land fires. Additionally, these fires burn 3 to 4 meters underground, making them much harder to extinguish. A further cause were the El Niño weather conditions in 2010, which delayed the [monsoon season](/wiki/Wet_season), causing a [drought](/wiki/Drought) and impacting water and crop supplies. These weather patterns pressured farmers to make up for lost time by illegally setting off forest fires to clear land at a rapid rate. The dry conditions in Indonesia together with the [combustible litter](/wiki/Ash) left behind from past illegal logging activities played a major role in turning forests and peatlands into potential fire starters. The large amount of dense smoke produced from the forest fires in Sumatra was then carried by the westerly winds across the [Straits of Malacca](/wiki/Strait_of_Malacca) polluting and deteriorating the air quality in Malaysia, and Singapore. ## Countries affected ### Malaysia The cloud of thick [smog](/wiki/Smog) produced from the forest fires in Indonesia drifted across Malaysia's west coast affecting the capital of Malaysia, [Kuala Lumpur](/wiki/Kuala_Lumpur) and other areas such as [Malacca](/wiki/Malacca_City) and [Johor](/wiki/Johor). [Muar](/wiki/Muar_(town)), a coastal town located in Johor, experienced a hazardous [Air Pollution Index](/wiki/Air_quality_index) (API) of 432 while the air quality in Malacca deteriorated to an unhealthy API of 106. In response, government hospitals and clinics were placed on standby to cater to the high influx of haze-related respiratory illnesses. As a preventive measure, schools in Muar were shut down to prevent any adverse respiratory illnesses to children. [Respiratory masks](/wiki/Dust_mask) were also distributed to the public. Vessels traveling along the Malacca Straits were also advised to travel with caution due to the poor visibility which fell to 2 nautical miles. ### Singapore The transboundary haze crisis in Singapore lasted for approximately 4 days from 20 October to 23 October 2010. During this period, the overall 24-hour [Pollutant Standard Index](/wiki/Pollutant_Standards_Index) (PSI), recorded by the [National Environment Agency](/wiki/National_Environment_Agency) (NEA) was mainly in the high-moderate range while the hourly PSI crept into the unhealthy range of 108. This was the highest PSI recorded since 2006 and the first time in 4 years that the PSI had reached the unhealthy range in Singapore. A nationwide health advisory was issued by the NEA whereby the public was advised to stay hydrated and to refrain from participating in outdoor activities due to the poor air quality and visibility. Until the 2010 Southeast Asian haze, Singapore had not experienced a haze-related incidence for a decade, with air quality remaining in the 'good' to 'moderate' range. **Pollutant Standard Index Recorded in Singapore by National Environment Agency during the 2010 Southeast Asian Haze** Date:NorthSouthEastWestCentralOverall19 October 2010513933563933-5620 October 2010707263806763-8021 October 2010728477837972-8422 October 2010879295969387-9323 October 2010827973818173-8224 October 2010333344363933-44 Prior to August 2012, NEA provided 24-hourly PSI updates on the air quality in Singapore once a day at 4pm. Since then, NEA has increased the frequency of PSI updates from once a day to 3 times day to hourly PSI updates in June 2013 for a more accurate representation of the air quality experienced in Singapore. ## Negative impacts ### Economic Due to the transboundary haze, a drop in the percentage of tourists visiting affected countries can be seen during these periods due to the air pollution experienced. During this crisis, travel warnings are often issued out to warn tourists about the deterioration in the air quality and the lack of visibility. The lack of visibility can bring about many disruptions to the economy, trade and daily life. Transportation services like [aviation](/wiki/Aviation), [maritime](/wiki/Maritime_transport) and land public transport systems are delayed and often put on hold affecting tourism and the daily lives of many individuals. [Singapore](/wiki/Economy_of_Singapore) and [Malaysia](/wiki/Economy_of_Malaysia) are countries that rely heavily on trade as being a major source of income and, due to poor visibility, [cargo ships](/wiki/Cargo_ship) carrying goods are forced to travel with caution at a slower pace, delaying the shipment process. Furthermore, outdoor constructions are also affected due to the unsafe working conditions. Not only does this deter tourists from visiting the affected countries, it may also deter prospective [migrants](/wiki/Migrant_worker) who are considering migrating over to seek better living conditions and to take up future job opportunities. During the worst haze experienced in 1997 which lasted for 3 months, Southeast Asia incurred an estimated loss of $9 billion to health expenses, air travel, retailers, hotels, trade, businesses and tourism. ### Health As countries such as Malaysia and Singapore are not affected by the transboundary haze throughout the entire year, but usually only during certain months of the year for a short period of time, residents of the affected countries are often prone to short-term health effects brought by the haze rather than long term effects. Individuals who have encountered short term exposure may experience symptoms such as irritation to the eyes, nose and throat due to the haze particles. Those who are elderly, young, pregnant, [asthmatic](/wiki/Asthma) and with poor immunity such as respiratory illness, [lung diseases](/wiki/Respiratory_disease) and [cardiovascular diseases](/wiki/Cardiovascular_disease) are more susceptible to the effects of the haze. When air quality is low, a higher chance of developing breathing difficulties can arise causing multiple health complications and a higher influx of patients in hospitals and clinics. ### Environmental Indonesia's forest is home to over 3000 animal and plant species such as the [Sumatran tigers](/wiki/Sumatran_tiger), [Komodo dragons](/wiki/Komodo_dragon) and [orangutans](/wiki/Orangutan). The destruction of forests by burning practices not only brings about multiple environmental consequences such as [soil erosion](/wiki/Soil_erosion), [water pollution](/wiki/Water_pollution), [global warming](/wiki/Global_warming) and [climate change](/wiki/Climate_change_in_Indonesia) but also threatens the livelihood of multiple animal species pushing many of them to the brink of extinction. Approximately 80% of Indonesia was forested in the 1960s, however less than 50% remains forested today. This is due to [urbanization](/wiki/Urbanization_in_Indonesia), [corruption](/wiki/Corruption_in_Indonesia) and illegal logging activities such as the slash and burn method, which poses a great threat to [biodiversity](/wiki/Biodiversity). For instance, due to burning land clearing methods practiced by smallholders, many species of animals and plants are unable to withstand the high temperatures of heat and fail to escape the fires or successfully migrate to a new home. Additionally, fire land clearing practices contributes a significant release of [greenhouse gases](/wiki/Greenhouse_gas) such as [carbon dioxide](/wiki/Carbon_dioxide_in_Earth%27s_atmosphere), [methane](/wiki/Methane) and [nitrous oxide](/wiki/Nitrous_oxide). Such release of greenhouse gases from peatland fires aids in the exacerbation of global warming and has the ability to affect a change on the region's climate and weather. It is known that Indonesia is ranked as one of the world's highest carbon emitters with approximately 900 million tons of carbon emitted into the atmosphere in 2010. ## Preventive measures ### Strengthening governance When it comes to issues regarding the transboundary haze and illegal logging, there is no quick or short-term solution. To curb the magnitude and the impact of the haze, the Indonesian government must implement stricter policies and regulations regarding land access and management. Even though policies and regulations such as obtaining certifications and rights for clearing land purposes are in place, these policies still often fall short due to poor enforcement of laws and corrupt government officials in Indonesia. As a result, when it comes to illegal logging through the use of the slash-and-burn method, perpetrators continue to violate the zero-burning policy without fear of repercussion. This in turn influences other smallholders to follow suit, making it hard for government officials to monitor and enforce laws thoroughly. Thus, many government officials end up overlooking those who violate the law while some even go to the extent of rendering aid in the rule-breaking process for a small fee. Over the years, there have been many examples of corrupt government officials aiding smallholders and plantation companies in the violation of the rules and regulations set by the Indonesian government. For instance, even though a regulation prohibiting the establishment of [oil palm](/wiki/Elaeis_guineensis) plantations on peatlands which extend more than 3 meters underground has been implemented, it is known that more than 25% of oil palm plantations in Indonesia violates that rule. Additionally, companies such as the [Duta Palma](/wiki/Duta_Palma) which is notoriously known for participating in illegal logging activities manage to escape routine checks by government officials due to the company's deep ties with the Indonesian military. Furthermore, even though many companies and smallholders have had their land clearing licenses revoked due to their participation in the [1997 Southeast Asian Haze](/wiki/1997_Southeast_Asian_haze), it is known that many of them still continue to ignore the law by clearing land using the slash-and-burn method. Additionally, educating and holding smallholders accountable for succumbing to illegal land clearing practices is also imperative in reducing the occurrence of illegal logging. ### ASEAN Agreement On 13 October 2010, the 6th ASEAN meeting was conducted whereby the transboundary haze issues were discussed. Countries such as Singapore and Malaysia also pledged to support and render aid to Indonesia in its fight against illegal logging and forest fires. Despite having the 6th ASEAN meeting held a week before the 2010 transboundary haze crisis, Indonesia failed to enforce its logging laws in Sumatra leaving forests vulnerable to destruction. This led to the arise in political tension with neighboring countries like Malaysia and Singapore. In order to successfully monitor and minimize the effects of slash and burn activities, the use of techniques to detect emissions and to interpret fire patterns is crucial. Hence, the implementation of the development of a Fire Danger Rating System (FDRS) was endorsed by ministers during the meeting as a measure to monitor hotspots and predict potential fire outbreak areas. This system provides the ability to monitor the ignition, occurrence and spread of forest fires based on various conditions such as weather, fuel and soil. ASEAN has also set a goal to be a haze-free region by 2020. However, Indonesia may be at risk of losing their leadership position in ASEAN despite being one of ASEAN's founders and having one of the largest economy in Southeast Asia if the government does not uphold and tighten the rules and regulations on illegal logging. ### Education The education of smallholders is imperative for a notable improvement in the transboundary haze. Although Indonesia's government has banned the clearing of land using the slash and burn method, farmers often disregard the law and continue to clear land illegally using burning practices. This is mainly due to the weak law enforcement and the reluctance to change based on hardened beliefs. Even though the Indonesian government has attempted to educate and motivate the public on adopting fire-free land clearing alternatives, many smallholders still believe that the benefits of the slash-and-burn method still outweigh the cost of fire-free land clearing practices. Hence, Indonesia has implemented incentives in the form of rewards and assistance to those who are willing to adopt fire-free land clearing alternatives and to those who comply with Indonesia's zero burning policy. For instance, smallholders are rewarded with funds should they have manage to have a year free of unpermitted burning practices. Thus, in order for a change to happen, education and public support is important in aiding smallholders to grasp the magnitude and negative impact the slash and burn method has on the environment and neighboring countries.\n",
  "language": "en",
  "processed_at": "2026-01-12T09:48:49.083555",
  "title": "2010 Southeast Asian haze",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/2010_Southeast_Asian_haze"
}