{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:48:45.553740"
  },
  "content": "Swiss national convicted for vandalism in Singapore In June 2010, Swiss national Oliver Fricker was sentenced to five months in prison and three [strokes of the cane](/wiki/Caning_in_Singapore) under the Singapore [Vandalism Act](/wiki/Vandalism_Act_(Singapore)) and Protected Areas and Protected Places Act. Fricker pleaded guilty to cutting through the fence of an [SMRT](/wiki/SMRT_Corporation) Changi train depot with an accomplice and spray painting two MRT train cars with the words \"McKoy Banos\", a widely documented signature of graffiti artists who have vandalised trains around the world. Fricker was arrested on 25 May, two days before he was to leave for a new job in Switzerland. An arrest warrant was also issued for his British accomplice, Dane Alexander Lloyd. ## The case The crime was committed at Singapore train operator SMRT's [Changi train depot](/wiki/Changi_Depot) in the early hours of 17 May 2010: Fricker and his friend, Dane Alexander Lloyd, had scouted out the location earlier in the day on 16 May and returned after midnight to commit the offence; each carried a bag, mainly of spray paints obtained by Lloyd before his arrival in Singapore on 15 May. Lloyd cut a hole in the security fence well away from the main road, using a wire cutter brought by Fricker. On a train carriage (a [Kawasaki Heavy Industries C151](/wiki/Kawasaki_Heavy_Industries_C151) train, carriage number 1048) nearest to the fence, Fricker spray-painted the word \"McKoy\" on the left while Lloyd spray-painted the word \"Banos\" next to it; Lloyd took photographs of the vandalised carriages before both left through the hole in the fence. They flagged a taxi and went to [Boat Quay](/wiki/Boat_Quay) for a drink before returning to Fricker's residence overlooking [Marina Bay](/wiki/Marina_Bay,_Singapore) in the prime business district, where Lloyd showed Fricker the photographs before they went to sleep. The next day, they left for Hong Kong for a holiday; Fricker returned three days later, while Lloyd decided to stay in Hong Kong. Fricker was arrested on 25 May, two days before he was due to leave for a new job in Switzerland. His laptop computer was found to contain 53 images, one video file of vandalised trains, and emails ordering paint; the wire cutter was also found in his possession. The evidence left Fricker with little choice but to plead guilty in the hope of a more lenient sentence. Lloyd is said to have planned the act before his arrival in Singapore. The \"McKoy Banos\" slogan has appeared on graffiti found and documented throughout the world, particularly on metro trains. \"McKoy Banos\" is believed to be the names of two persons who were the graphic artists; but Fricker says they simply copied the name after seeing it elsewhere. Since October 2008, Fricker, aged 32, had been working in Singapore as an IT consultant for [Zurich](/wiki/Zurich)-based Comit AG, specialising in financial industry software. During his time in Singapore, he had spray-painted legally on one of the graffiti walls at Singapore's Youth Park, next to [Orchard Road](/wiki/Orchard_Road). Before his court trial, he had been freed on [bail](/wiki/Bail) of SGD 100,000. Lloyd, aged 29, is a British national based in Hong Kong. Fricker said he first met Lloyd in Australia in 1997. On this occasion, Lloyd was in Singapore for three days as a tourist. Police had issued an arrest warrant for Lloyd earlier in June and British media reported that Interpol affiliated countries had been asked to provide information about him. SMRT Corporation reported the incident to police only on 19 May, two days after the breach, because staff thought the brightly coloured graffiti was an advertisement. It was seen by many commuters and even posted on to YouTube; this may have alerted the authorities. SMRT said the graffiti caused about SGD 11,000-worth of damage to two train carriages. Prosecutors did not specify how Fricker was identified, saying only that the evidence came from police investigations. ## Sentence On 25 June 2010, Fricker pleaded guilty to two charges of vandalism and trespassing in a protected place. A third charge, that he had committed an act of vandalism by cutting the fence of the depot, was taken into consideration. Fricker asked only that he not be given a \"punitive custodial sentence\", and his lawyer then argued in mitigation: - that Fricker had shown genuine remorse and co-operated fully with police investigations; - he was \"cajoled\" by Lloyd into committing the crimes and made a one-off mistake \"while inebriated\" after drinking several beers; - he pursued his passion as purely graphic art; - the graffiti had not incited hatred, and left no lasting damage; and - he was a model expatriate worker, contributing to Singapore since his arrival in the city in 2008. Fricker was sentenced to five months in prison (three for vandalism and two for trespassing) and three strokes of the cane (for vandalism). Judge [See Kee Oon](/wiki/See_Kee_Oon) said of Fricker's actions \"he was fully conscious of the criminal nature of the act and must be prepared to face the consequences\", and agreed with the [Public Prosecutor](/wiki/Public_Prosecutor) that the defendant had committed a very serious offence that had \"alarmed the general public\" and \"shaken their confidence in the security of protected places\". Under the 1966 [Vandalism Act](/wiki/Vandalism_Act_(Singapore)), vandals could be sentenced to three years imprisonment, fined a maximum of SGD 2,000 and given a minimum of three strokes of the cane. For entering a protected place under the Protected Areas and Protected Places Act, Fricker could have been sentenced to a maximum of two years imprisonment and fined up to SGD 1,000. Fricker was immediately taken into custody by court police to begin his sentence, but his lawyer said he was appealing for a reduced sentence. ## Public outcry The breach at Changi train depot was Singapore's biggest security lapse since a suspected terrorist leader, [Mas Selamat bin Kastari](/wiki/Mas_Selamat_bin_Kastari), escaped from detention in February 2008. Transport systems, other high-traffic public areas, and foreign embassies are all regarded as potential terrorist targets in Southeast Asia. The Changi depot case caused an outcry from the public in the media and on the internet, most of it not towards the vandals but directed at the authorities for the lax security of public transportation and protected installations in general. Some of the major concerns were: - how easily high-security premises were penetrated simply by cutting a hole in the fence that went unnoticed for days; - consequences if the intruders had been terrorists instead of merely vandals; - whether security measures and enforcement in other sensitive, protected facilities were similarly slack; - random checks by journalists on other depots, bus interchanges and power plants also exposed some shortcomings. ## Security aftermath Immediately after the incident, SMRT increased the number of security personnel and patrols, installed more cameras, added razor wires to perimeter fences, and engaged a security consultant to conduct a comprehensive audit of its systems. Another public transport operator, [SBS Transit](/wiki/SBS_Transit), also beefed up its security presence and announced plans to replace wired fencing with mesh fencing around its train depot at Sengkang. Other measures would include removal of shrubs and hedges along perimeter fencing and placement of [concertina wires](/wiki/Concertina_wire). On 11 June 2010, the Public Transport Security Committee (PTSC) announced a \"comprehensive\" security review of the public transport network over the following six months. PTSC, chaired by the [Land Transport Authority](/wiki/Land_Transport_Authority) (LTA), is a multi-agency committee formed in 2004 to ensure that security reviews, recommendations and improvements are made to enhance public transport security. On 27 June 2010, the LTA said it was assessing whether to impose penalties on SMRT for the security breach. ## Appeal Fricker appealed against the two-month jail sentence for trespassing. He argued that it should have been ordered to run concurrently with the three-month sentence for vandalism, with the effect that he should only serve three months' imprisonment altogether. The prosecution cross-appealed, arguing that the prison sentence for trespass was manifestly inadequate. The case was heard on 18 August 2010. Judge of Appeal [V. K. Rajah](/wiki/V._K._Rajah) increased Fricker's sentence for trespassing from two months to four and declined to order that it should run concurrently with the vandalism sentence, making his total sentence of imprisonment seven months. The judge stated that, had the prosecution appealed the vandalism sentence, he probably would have increased that too. He said Fricker should \"count himself fortunate that he has not received his just deserts in full\". Fricker's act, he noted, must be \"unequivocally deplored\", while like-minded offenders must be deterred from copycat offending. At the appeal, the prosecution was given permission to adduce additional evidence to the effect that in 2001 Fricker had been convicted in Switzerland of multiple incidents of damaging public property. However, the Court said that it did not take this into consideration as the prosecution had provided insufficient information about the earlier conviction. Fricker's caning, postponed pending the appeal, would now be carried out. ## Release Fricker was released from [Changi Prison](/wiki/Changi_Prison) on 15 November 2010 after spending less than five months there, having received one-third remission for good behaviour. He immediately flew back to Zurich, where he was arrested by police for suspected graffiti offences in Switzerland. - [Caning of Michael Fay](/wiki/Caning_of_Michael_Fay), American teenager sentenced to six strokes of the cane (later reduced to four) in 1994 - [Utah & Ether](/wiki/Utah_%26_Ether), who vandalised another train depot in August 2011 undetected until a book on their vandalistic acts was published in 2016 ## Notes - [EXCLUSIVE VANDALIZED] SMRT C151 047-048 Graffiti Drawing – Departing Kembangan (Westbound) on [YouTube](/wiki/YouTube_video_(identifier)) by ongyouyuan1907 showing the vandalized MRT train\n",
  "language": "en",
  "processed_at": "2026-01-12T09:48:45.553255",
  "title": "2010 Singapore train depot trespass and vandalism case",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/2010_Singapore_train_depot_trespass_and_vandalism_case"
}