{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:48:53.770436"
  },
  "content": "Outbreak of dengue in Singapore In the **2013 dengue outbreak in Singapore**, a significant rise in the number of [dengue fever](/wiki/Dengue_fever) cases was reported in [Singapore](/wiki/Singapore). The outbreak began in January, with the number of infections beginning to surge in April, before eventually reaching a peak of 842 dengue cases in the week of 16–22 June 2013. This figure was far beyond the highest number of cases per week in the previous three years. Although there were concerns that the rate of infection could exceed 1,000 per week, these fears did not materialize. As official data showed, more than 13,000 people were infected with dengue as of mid-July in 2013, fast nearing the total of 14,209 infections in the [2005 dengue outbreak](/wiki/2005_dengue_outbreak_in_Singapore), the worst year on record. The 2005 record was surpassed in the week of 4–10 August, when the total number of cases of reached 14,217. The year ended with a total of 22,170 people infected with the disease, a record that would stand until (/wiki/2020_dengue_outbreak_in_Singapore). ## Status of outbreak **Status** *(as of 31 December 2013)*Number of cases22,170Number of deaths8 ## Timeline ### February - **16 February**: 322 people contract dengue in the past week, the highest in five and a half years. A total of 1,442 cases are recorded in the first six weeks of the year. ### April - **14 April**: After several weeks where the number of weekly cases hovered around 300, a rapid surge in the first two-week of April takes the figure up to 492 weekly cases. The [National Environment Agency](/wiki/National_Environment_Agency) (NEA) attributed the spike to an increase in the DENV-1 [serotype](/wiki/Serotype) of the [dengue virus](/wiki/Dengue_virus). Because that strain was less common, the local community was more susceptible to it. ### May - **29 May**: Dengue claimed its first death in Singapore in 2013. The victim was diagnosed as having viral fever on 23 May at [Tan Tock Seng Hospital](/wiki/Tan_Tock_Seng_Hospital)'s Emergency Department. He was then discharged with the advice to return if his condition worsened. He subsequently returned to Tan Tock Seng Hospital on 26 May and was diagnosed with dengue fever. He then died from dengue shock syndrome on 29 May. ### June - **7 June**: The total number of cases exceeds 9,000. - **9 June**: A second person died from dengue in Singapore. He was tested positive for dengue on 8 June, but his condition deteriorated. - **18 June**: The total number of cases exceeds 10,000. - **22 June**: 842 new dengue cases are recorded in the week of 16–22 June 2013, marking the peak number of weekly infections for the year. The total number of dengue cases would pass the 11,000 mark soon after. - **25 June**: Two deaths due to dengue were reported. The third victim was admitted to [Khoo Teck Puat Hospital](/wiki/Khoo_Teck_Puat_Hospital) emergency department (ED) on 22 June 2013 with fever and low blood pressure. He was then sent to the [Intensive Care Unit](/wiki/Intensive_Care_Unit) (ICU) diagnosed with a dengue shock syndrome, kidney failure and liver inflammation. His condition deteriorated and died on 25 June 2013.An Indonesian male was also pronounced dead on 25 June 2013 and has become the fourth person to die from dengue in Singapore. The victim contracted dengue fever overseas between 10 and 21 June 2013 and was subsequently sent to Tan Tock Seng Hospital's Emergency Department on 23 June 2013 after a prolonged 3-day fever. His condition started to deteriorate on 24 June 2013 in the Intensive Care unit (ICU). ### July - **8 July**: A fifth person dies from dengue. The patient was a 66-year-old Chinese male who had multi-organ failure from severe dengue shock syndrome. He had initially gone to the Emergency Department on 2 July with fever and lethargy, and subsequent tests confirmed dengue fever. He was admitted and transferred to the ICU after deterioration, but continued to deteriorate and died on the morning of 8 July. - **16 July**: The total number of dengue cases crosses the 13,000 mark. ### August - **10 August**: The total number of cases of reached 14,217 in the week of 4–10 August, surpassing the previous record of 14,209 from the [2005 outbreak](/wiki/2005_dengue_outbreak_in_Singapore). - **13 August**: A 52-year-old Chinese male becomes the sixth death due to dengue. He was first seen at Jurong Polyclinic on 29 June 2013 with a two-day history of fever. He returned to the polyclinic a few days later as he was still having fever and was referred by the polyclinic to the [National University Hospital](/wiki/National_University_Hospital) (NUH) emergency department. He was admitted to NUH's Medical Intensive Care Unit on the same day and was diagnosed with Dengue Shock Syndrome. The patient's condition improved transiently after dialysis and supportive therapy but he remained critically ill with low blood counts. The patient's condition deteriorated after he developed pneumonia with septic shock on 11 August 2013 and he died on 13 August 2013. ### September - **30 September**:A 35-year-old Chinese woman died of dengue on Monday, becoming the seventh death in 2013. The patient, who lived at Yishun Ring Road, had gone to the Khoo Teck Puat Hospital's Emergency Department on 28 September 2013 with a history of fever, chest pain, lethargy, nausea and loss of appetite and had intermittent fever for three weeks. She was diagnosed with dengue fever and admitted but her condition deteriorated after admission and she was transferred to the Intensive Care Unit on the same day. Despite these measures, the patient died on 30 September 2013 at 5:05 am. ### November - **16 November**: A 53-year-old woman became the seventh local dengue death case this year, and the overall eighth death. In a joint statement, the [Ministry of Health](/wiki/Ministry_of_Health_(Singapore)) and the NEA said the dengue patient lived at Hougang Street 22. The woman, who was first seen at Tan Tock Hospital's Emergency Department on 11 November, had a history of fever. She was diagnosed with dengue and admitted. Her condition deteriorated and she died on 16 November. ### December - **13 December**: The total number of cases reaches 21,324, exceeding 150% of the previous record. Dengue fever deaths in SingaporeDateVictimNationalityLocation of dengue contracted29 May 2013Victim 1 SingaporeanHougang Avenue 19 June 2013Victim 2 SingaporeanAng Mo Kio Avenue 325 June 2013Victim 3 SingaporeanSembawang Road25 June 2013Victim 4 Indonesian*Overseas (Indonesia)*8 July 2013Victim 5 SingaporeanTanglin Halt Road13 August 2013Victim 6 SingaporeanCorporation Walk30 September 2013Victim 7 SingaporeanYishun Ring Road16 November 2013Victim 8 SingaporeanHougang Street 22 ## Preventive measures In March, multiple warning signs surfaced of the impending outbreak. The less common DENV-1 serotype of the dengue virus supplanted DENV-2 as the dominant strain of the virus in circulation, jumping from around 20–30% to over half of new infections. This switch threatened to drive a strong surge in infections during the upcoming mid-year dengue peak season. [Epidemiological modelling](/wiki/Epidemiological_modelling) provided corroboration, forecasting a peak of up to 800 cases per week in June. Based on this, warnings about the epidemic risk were issued through the government's Inter-Agency Dengue Task Force. NEA stepped up [vector control](/wiki/Vector_control) measures, and a community awareness campaign was initiated. The amount of [government budget](/wiki/Government_budget) allocated to combat dengue would eventually be increased by more than 20% compared to recent years. In April, the NEA began using a new community alert system. Colour-coded banners would be put up in dengue-hit areas, using the three traffic light colours green, yellow and red to indicate the number of cases in the neighbourhood. As part of NEA's vector control measures, routine inspections were conducted to check for potential mosquito breeding sites in homes, public areas of housing estates, and construction sites. On 14 June 2013, the head of NEA announced that more officers would be recruited to conduct these checks. NEA also indicated that it would resort to hiring a locksmith to forcibly gain access to conduct inspections if homeowners fail to cooperate; this happened to ten homes after the residents did not respond to notices sent to them. The [People's Association](/wiki/People%27s_Association_(Singapore)) (PA) announced that they would recruit 10,000 volunteer \"dengue fighters\" to assist NEA officers during house visits. Penalties were levied as a consequence of these inspections, even government organizations were not exempt. On 5 June 2013, Sembawang-Nee Soon [Town Council](/wiki/Town_Council_(Singapore)) was fined [S$](/wiki/Singapore_dollar)200 for allowing mosquitoes to breed in water tanks the council controlled. Officers from the NEA found mosquito larvae in water tanks at the rooftops of Blocks 896C and 899A in Woodlands. The [Singapore Land Authority](/wiki/Singapore_Land_Authority) incurred S$2000 in fines for ten breeding spots discovered in vacant buildings and plots of land under its management from January to June 2013. NEA also announced that [insect repellent](/wiki/Insect_repellent) would be distributed to every household in the country in July and August, to \"help residents protect themselves from mosquito bites and thus break the chain of transmission.\" - [Dengue fever outbreaks](/wiki/Dengue_fever_outbreaks) (worldwide) - Official website for Dengue cases in Singapore - Interactive tracking Singapore's dengue epidemic\n",
  "language": "en",
  "processed_at": "2026-01-12T09:48:53.769955",
  "title": "2013 dengue outbreak in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/2013_dengue_outbreak_in_Singapore"
}