{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:48:54.755839"
  },
  "content": "Widespread epidemic of Zika fever An [epidemic](/wiki/Epidemic) of [Zika fever](/wiki/Zika_fever), caused by [Zika virus](/wiki/Zika_virus), began in [Brazil](/wiki/Brazil) and affected other countries in the Americas from April 2015 to November 2016. The [World Health Organization](/wiki/World_Health_Organization) (WHO) declared the end of the epidemic in November 2016, but noted that the virus still represents \"a highly significant and long term problem\". It is estimated that 1.5 million people were infected by Zika virus in Brazil, with over 3,500 cases of infant [microcephaly](/wiki/Microcephaly) reported between October 2015 and January 2016. The epidemic also affected other parts of [South](/wiki/South_America) and [North America](/wiki/North_America), as well as several islands in the Pacific. Zika virus spread to Brazil from Oceania in 2013 or 2014. Brazil notified the WHO of an illness characterized by skin rash in March 2015, and Zika was identified as the cause in May 2015. In February 2016, the WHO declared the outbreak a [Public Health Emergency of International Concern](/wiki/Public_Health_Emergency_of_International_Concern) as evidence grew that Zika can cause birth defects as well as neurological problems. The virus can be [transmitted](/wiki/Vertical_transmission) from a pregnant woman to her fetus, and can cause [microcephaly](/wiki/Microcephaly) and other severe brain anomalies in the infant. Zika infections in adults can result in [Guillain–Barré syndrome](/wiki/Guillain%E2%80%93Barr%C3%A9_syndrome). In approximately one in five cases, Zika virus infections result in Zika fever, a minor illness that causes symptoms such as [fever](/wiki/Fever) and a [rash](/wiki/Rash). Prior to the outbreak, Zika was considered a mild infection, as most infections are asymptomatic, making it difficult to determine precise estimates of the number of cases. The virus is [spread](/wiki/Mosquito-borne_disease) mainly by the *[Aedes aegypti](/wiki/Aedes_aegypti)* [mosquito](/wiki/Mosquito), which is commonly found throughout the tropical and subtropical Americas. It can also be spread by the *[Aedes albopictus](/wiki/Aedes_albopictus)* (\"Asian tiger\") mosquito, which is distributed as far north as the [Great Lakes](/wiki/Great_Lakes) region in North America. People infected with Zika can [transmit](/wiki/Sexually_transmitted_infection) the virus to their sexual partners. A number of countries were issued [travel warnings](/wiki/Travel_warning), and the outbreak was expected to reduce [tourism](/wiki/Tourism) significantly. Several countries took the unusual step of advising their citizens to delay pregnancy until more was known about the virus and its impact on fetal development. Furthermore, the outbreak raised concerns regarding the safety of athletes and spectators at the [2016 Summer Olympics](/wiki/2016_Summer_Olympics) and [Paralympics](/wiki/2016_Summer_Paralympics) in Rio de Janeiro. ## Epidemiology Number of Zika cases, 2015–16 CountryAutochthonous casesImported casesTotal casesDeaths[a]ConfirmedSuspectedAfrica [Angola](/wiki/Angola)22 [Cape Verde](/wiki/Cape_Verde)27,4577,459 [Guinea-Bissau](/wiki/Guinea-Bissau)1010 [Madagascar](/wiki/Madagascar)11 [Réunion](/wiki/R%C3%A9union)22 [South Africa](/wiki/South_Africa)11AmericasConfirmedSuspectedImportedTotalDeaths [Anguilla](/wiki/Anguilla)744152 [Antigua and Barbuda](/wiki/Antigua_and_Barbuda)143932409 [Argentina](/wiki/Argentina)261,821271,874 [Aruba](/wiki/Aruba)286147649 [Bahamas](/wiki/The_Bahamas)21324 [Barbados](/wiki/Barbados)37653690 [Belize](/wiki/Belize)49537586 [Bermuda](/wiki/Bermuda)55 [Bolivia](/wiki/Bolivia)1297184851 [Bonaire](/wiki/Bonaire)6060 [Brazil](/wiki/Brazil)[b]109,596200,465310,0616 [Canada](/wiki/Canada)374374 [Cayman Islands](/wiki/Cayman_Islands)2920110240 [Chile](/wiki/Chile)2929 [Colombia](/wiki/Colombia)8,82696,546105,372 [Costa Rica](/wiki/Costa_Rica)1,4532,618324,103 [Cuba](/wiki/Cuba)33033 [Curaçao](/wiki/Cura%C3%A7ao)820820 [Dominica](/wiki/Dominica)791,1501,229 [Dominican Republic](/wiki/Dominican_Republic)3274,8935,220 [Ecuador](/wiki/Ecuador)8122,722153,549 [El Salvador](/wiki/El_Salvador)5111,35311,404 [French Guiana](/wiki/French_Guiana)4839,7001010,193 [Grenada](/wiki/Grenada)108314422 [Guadeloupe](/wiki/Guadeloupe)37930,84531,224 [Guatemala](/wiki/Guatemala)4662,7853,251 [Guyana](/wiki/Guyana)66 [Haiti](/wiki/Haiti)52,9552,960 [Honduras](/wiki/Honduras)29831,86332,161 [Jamaica](/wiki/Jamaica)1867,0527,238 [Martinique](/wiki/Martinique)1236,68036,692 [Mexico](/wiki/Mexico)6,642156,657 [Nicaragua](/wiki/Nicaragua)2,04432,047 [Panama](/wiki/Panama)5172,089422,648 [Paraguay](/wiki/Paraguay)12583595 [Peru](/wiki/Peru)14518163 [Puerto Rico](/wiki/Puerto_Rico)34,07012134,1915 [Saba](/wiki/Saba_(island))99 [Saint Barthélemy](/wiki/Saint_Barth%C3%A9lemy)61900961 [Saint Kitts and Nevis](/wiki/Saint_Kitts_and_Nevis)26532558 [Saint Lucia](/wiki/Saint_Lucia)50822872 [Saint Martin](/wiki/Collectivity_of_Saint_Martin)2002,8253,025 [Saint Vincent and the Grenadines](/wiki/Saint_Vincent_and_the_Grenadines)38156194 [Sint Eustatius](/wiki/Sint_Eustatius)1616 [Sint Maarten](/wiki/Sint_Maarten)62168230 [Suriname](/wiki/Suriname)7232,7553,4784 [Trinidad and Tobago](/wiki/Trinidad_and_Tobago)6431644 [Turks and Caicos Islands](/wiki/Turks_and_Caicos_Islands)121153130 [United States](/wiki/United_States)2365,5905,826 [Uruguay](/wiki/Uruguay)11 [Venezuela](/wiki/Venezuela)2,38059,14761,527 [British Virgin Islands](/wiki/British_Virgin_Islands)385189 [U.S. Virgin Islands](/wiki/United_States_Virgin_Islands)60380321,408AsiaConfirmedSuspectedImportedTotalDeaths [China](/wiki/China)2323 [Hong Kong](/wiki/Hong_Kong)11 [Israel](/wiki/Israel)99 [Japan](/wiki/Japan)77 [Malaysia](/wiki/Malaysia)8210 [Maldives](/wiki/Maldives)11 [Myanmar](/wiki/Myanmar)11 [Philippines](/wiki/Philippines)39645 [Singapore](/wiki/Singapore)4351436 [South Korea](/wiki/South_Korea)1414 [Taiwan](/wiki/Taiwan)1313 [Thailand](/wiki/Thailand)6806803 [Vietnam](/wiki/Vietnam)141141EuropeConfirmedSuspectedImportedTotalDeaths [Austria](/wiki/Austria)4242 [Belgium](/wiki/Belgium)121121 [Canary Islands](/wiki/Canary_Islands)33 [Czech Republic](/wiki/Czech_Republic)1313 [Denmark](/wiki/Denmark)88 [Finland](/wiki/Finland)77 [France](/wiki/France)1,1411,141 [Germany](/wiki/Germany)5656 [Greece](/wiki/Greece)22 [Hungary](/wiki/Hungary)22 [Ireland](/wiki/Republic_of_Ireland)1616 [Italy](/wiki/Italy)101101 [Luxembourg](/wiki/Luxembourg)22 [Madeira](/wiki/Madeira)22 [Malta](/wiki/Malta)22 [Netherlands](/wiki/Netherlands)109109 [Norway](/wiki/Norway)3030 [Poland](/wiki/Poland)22 [Portugal](/wiki/Portugal)1818 [Romania](/wiki/Romania)33 [Russia](/wiki/Russia)99 [Slovakia](/wiki/Slovakia)33 [Slovenia](/wiki/Slovenia)77 [Spain](/wiki/Spain)311311 [Sweden](/wiki/Sweden)3535 [Switzerland](/wiki/Switzerland)2828 [United Kingdom](/wiki/United_Kingdom)244244OceaniaConfirmedSuspectedImportedTotalDeaths [American Samoa](/wiki/American_Samoa)547067767 [Australia](/wiki/Australia)7676 [Fiji](/wiki/Fiji)1717 [Kosrae](/wiki/Kosrae) ([FSM](/wiki/Federated_States_of_Micronesia))128294 [Marshall Islands](/wiki/Marshall_Islands)23436 [Nauru](/wiki/Nauru)11 [New Caledonia](/wiki/New_Caledonia)7373 [New Zealand](/wiki/New_Zealand)9797 [Papua New Guinea](/wiki/Papua_New_Guinea)66 [Samoa](/wiki/Samoa)1010 [Solomon Islands](/wiki/Solomon_Islands)302302 [Tonga](/wiki/Tonga)362,0102,046 [Vanuatu](/wiki/Vanuatu)11TotalConfirmedSuspectedImportedTotalDeathsWorldwide174,667528,1578,557711,38118 As early as August 2014, physicians in [Natal](/wiki/Natal,_Rio_Grande_do_Norte), in [northeastern Brazil](/wiki/Northeast_Region,_Brazil) began to investigate an outbreak of illness characterized by a flat pinkish rash, bloodshot eyes, fever, joint pain and headaches. While the symptoms resembled [dengue fever](/wiki/Dengue_fever), testing ruled out this and several other potential causes. By March 2015, the illness had spread to [Salvador](/wiki/Salvador,_Bahia), [Bahia](/wiki/Bahia) and had appeared in three different states. Then, in May 2015, researchers from the [Federal University of Bahia](/wiki/Federal_University_of_Bahia) and the [Evandro Chagas Institute](/wiki/Evandro_Chagas_Institute) determined, using the [RT-PCR technique](/wiki/Reverse_transcription_polymerase_chain_reaction), that the illness was an outbreak of Zika virus. Although, the first confirmed Zika virus infection in Brazil were diagnosed in a returning traveller in March 2015. The [Zika virus](/wiki/Zika_virus) was first isolated in 1947, in a [rhesus monkey](/wiki/Rhesus_monkey) in a forest near [Entebbe](/wiki/Entebbe), [Uganda](/wiki/Uganda). Although serologic evidence indicated additional human exposure during subsequent decades in parts of Africa and Asia, before the [2007 Yap Islands Zika virus outbreak](/wiki/2007_Yap_Islands_Zika_virus_outbreak), only 14 cases of human Zika virus disease had been documented. Researchers generally believe the virus was brought to Brazil by an infected traveler who had been exposed to the virus in [French Polynesia](/wiki/French_Polynesia), who was then bitten by a mosquito that then infected others. [Phylogenetic](/wiki/Phylogenetics) analysis of the first Brazilian infections have strongly indicated that the circulating virus is the Asian, rather than African, strain of the virus, and was genetically similar to the virus found in the [outbreak in French Polynesia](/wiki/2013_Zika_virus_outbreak_in_French_Polynesia). It appears Zika's route – from Africa and Asia to Oceania and then the Americas – may mirror that of [chikungunya](/wiki/Epidemiology_of_chikungunya) and [dengue](/wiki/Dengue), both of which are now [endemic](/wiki/Endemic_(epidemiology)) in a large portion of the Americas. The specific event that brought the virus to Brazil was uncertain until March 2016. Brazilian researchers had suggested that the Zika virus arrived during the [2014 FIFA World Cup](/wiki/2014_FIFA_World_Cup) tournament. French researchers speculated the virus arrived shortly afterwards, in August 2014, when canoeing teams from French Polynesia, [New Caledonia](/wiki/New_Caledonia), [Easter Island](/wiki/Easter_Island), and the [Cook Islands](/wiki/Cook_Islands), which [had been or were experiencing Zika outbreaks](/wiki/2013%E2%80%932014_Zika_virus_outbreaks_in_Oceania), attended the [Va'a](/wiki/Va%27a) World Sprint Championships in [Rio de Janeiro](/wiki/Rio_de_Janeiro). However, the outbreak in French Polynesia is known to have peaked and declined precipitously by February 2014, lending doubt to the suggestion the virus arrived later that year in Brazil with spectators and competitors. In March 2016, a study published in *[Science](/wiki/Science_(journal))*, which developed a \"[molecular clock](/wiki/Molecular_clock)\" based on the count of virus mutations in a relatively small sample, suggested Zika virus arrived in the Americas (most likely in Brazil) from French Polynesia between May and December 2013, well before the World Cup and Va'a Championships. In the *Science* article, Faria and colleagues managed to trace the origins of the virus strain that is circulating in Brazil and found that this strain has little genetic variability when compared to the strain of French Polynesia; after relating the number of travellers arriving in Brazil from French Polynesia with the cases reported and the events happening in that year, the team was able to deduce that the virus arrived in Brazil in 2013 during the [Confederation Cup](/wiki/2013_FIFA_Confederations_Cup), when Tahiti's team played against other teams in a few Brazilian cities, which attracted many tourists from both places. Zika virus usually has very mild, or no symptoms, so it took almost a year for Brazil to confirm the first case of the disease. By then the outbreak was already widespread. Factors associated with the rapid spread of Zika virus in Brazil include the non-immune population, high population density, tropical climate and inadequate control of *Aedes* mosquitoes in the country. The Zika virus epidemic also revealed structural problems of the health system, in particular in public health services and basic sanitation in Brazil. The above average warm temperatures of 2015–2016 caused by a [strong El Nino](/wiki/2014%E2%80%9316_El_Ni%C3%B1o_event) created an environment conducive to the spread of the Zika Virus in Brazil. The 2015 -16 El Nino increased ocean and ground surface temperatures to above average . January 2016 brought about nine consecutive months with temperatures 1.04 °C above the global average. It is important to note, however, that while South America had areas experiencing 2.0 °C above average temperatures (for 1981–2010), areas including Argentina, Southern Brazil and Uruguay experienced temperatures 0.5 °C below average. Precipitation is another crucial factor to consider as Eastern Brazil and other areas in southern South America experienced high amounts of precipitation in early 2016. The environmental conditions of increased rainfall and higher average temperatures in the South American region, lead to both a longer mosquito season and a higher mosquito density which created an environment in which the Zika carrying Aedes aegypti and Aedes albopictus mosquitoes can thrive. Looking forward, climate models suggest that regions favorable to the Aedes mosquitoes will grow, widening the range of Zika and other mosquito-carried diseases. The potential for epidemics will spread inland and into other regions of the world, not just in tropical environments. Confirmed cases have been reported in 40 countries or territories in South America, North America, and the Caribbean, as well as 16 in the western Pacific and one in Africa since the beginning of 2015 (*see table*). Many countries with no cases of mosquito transmission have reported travel-related Zika cases: people who moved or came home from a Zika-affected region before they showed symptoms (*see table*). ## Transmission Zika is a [mosquito-borne disease](/wiki/Mosquito-borne_disease). The resurgence of *[Aedes aegypti](/wiki/Aedes_aegypti)*'s worldwide distribution over the past 2–3 decades makes it one of the most widely distributed mosquito species. In 2015, *[Aedes albopictus](/wiki/Aedes_albopictus)* was present in [tropical](/wiki/Tropical), [subtropical](/wiki/Subtropical), and [temperate](/wiki/Temperate) regions of the Americas, reaching as far north as the [Great Lakes](/wiki/Great_Lakes) of North America and, internationally, living alongside *Aedes aegypti* in some tropical and subtropical regions. The *Aedes aegypti* mosquito usually bites in the morning and afternoon hours, and can be identified by the white stripes on its legs. The mosquito species (*Aedes aegypti*, mainly, and *Aedes albopictus*) that can spread Zika virus can also spread dengue, [chikungunya](/wiki/Chikungunya), and [yellow fever](/wiki/Yellow_fever). Zika can also be [sexually transmitted](/wiki/Sexually_transmitted_infection) between partners of both genders. Sexual transmission of Zika has been documented in nine countries—Argentina, Canada, Chile, France, Italy, New Zealand, Peru, Portugal, and the United States—during this outbreak. Zika is transmitted from pregnant women to the fetus (\"[vertical transmission](/wiki/Vertical_transmission)\"), and causes microcephaly and other severe brain anomalies in infants born of women infected with the virus. Zika infections in adults can cause [Guillain–Barré syndrome](/wiki/Guillain%E2%80%93Barr%C3%A9_syndrome). ## Diagnosis Symptoms are similar to other [flaviviruses](/wiki/Flavivirus) such as dengue fever or the [alphavirus](/wiki/Alphavirus) that causes chikungunya, but are milder in form and usually last two to seven days. It is estimated that 80% of cases are [asymptomatic](/wiki/Asymptomatic). The main clinical symptoms in symptomatic patients are low-grade fever, [conjunctivitis](/wiki/Conjunctivitis), transient joint pain (mainly in the smaller joints of the hands and feet) and [maculopapular rash](/wiki/Maculopapular_rash) that often starts on the face and then spreads throughout the body. It is difficult to diagnose Zika virus infection based on clinical signs and symptoms alone due to overlaps with other [arboviruses](/wiki/Arbovirus) that are endemic to similar areas. The methods currently available to test for Zika antibodies cross-react with dengue antibodies. An [IgM](/wiki/Immunoglobulin_M)-positive result in a dengue or Zika [ELISA](/wiki/ELISA) test can only be considered indicative of a recent flavivirus infection. Plaque-reduction neutralization tests (PRINT) can be performed and may be specific. The Zika virus can be identified by [RT-PCR](/wiki/RT-PCR) in acutely ill patients. RT-PCR testing of serum and tissue samples can be used to detect the presence of the Zika virus. However, the RT-PCR test with serum is only helpful while the virus is still in the blood which is generally within the first week of the illness. After this period other methods should be used to determine if the virus is still present in the body. A test for IgM antibodies has seen to be effective over longer periods of time, as these antibodies can be present starting 4 days after the beginning of the illness and up to 12 weeks after that. However, it is suggested that a PRINT test be performed following a test for IgM antibodies to help eliminate false positives resulting from other flaviviruses. The PRINT test looks for viral-specific neutralizing antibodies. However, this test can still produce false positive results, for Zika, in individuals who have received immunization for or had previously been exposed to other flaviviruses. ## Containment and control ### The Americas Several countries, including Colombia, Ecuador, [El Salvador](/wiki/El_Salvador), and [Jamaica](/wiki/Jamaica), advised women to postpone getting pregnant until more was known about the risks. Plans were announced by the authorities in Rio de Janeiro, Brazil, to try to prevent the spread of the Zika virus during the [2016 Summer Olympics](/wiki/2016_Summer_Olympics) in Rio. The [health ministry of Peru](/wiki/Ministry_of_Health_(Peru)) installed more than 20,000 [ovitraps](/wiki/Ovitrap) during the 2015 dengue outbreak. The same ovitraps will be used to monitor a potential Zika outbreak in tropical regions of Peru. On January 15, 2016, because of the \"growing evidence of a link between Zika and microcephaly\" the [Centers for Disease Prevention and Control](/wiki/Centers_for_Disease_Prevention_and_Control) (CDC) issued a [travel warning](/wiki/Travel_warning) advising pregnant women to consider postponing travel to Brazil as well as the following countries and territories where Zika fever had been reported: Colombia, El Salvador, [French Guiana](/wiki/French_Guiana), [Guatemala](/wiki/Guatemala), [Haiti](/wiki/Haiti), [Honduras](/wiki/Honduras), [Martinique](/wiki/Martinique), [Mexico](/wiki/Mexico), [Panama](/wiki/Panama), [Paraguay](/wiki/Paraguay), [Suriname](/wiki/Suriname), [Venezuela](/wiki/Venezuela), and the [Commonwealth of Puerto Rico](/wiki/Puerto_Rico). On January 20, the [Ministry of Health of Chile](/wiki/Ministry_of_Health_(Chile)) published a health notice. On January 22, eight more countries and territories were added to the list of those affected: [Barbados](/wiki/Barbados), Bolivia, Ecuador, [Guadeloupe](/wiki/Guadeloupe), [Saint Martin](/wiki/Saint_Martin_(island)), [Guyana](/wiki/Guyana), [Cape Verde](/wiki/Cape_Verde), and [Samoa](/wiki/Samoa). On February 1, [Costa Rica](/wiki/Costa_Rica) and [Nicaragua](/wiki/Nicaragua) were added to the list, bringing the number of countries and territories affected to 28. The agency issued additional guidelines and suggested that women thinking about becoming pregnant consult with their [physicians](/wiki/Physician) before traveling. Canada issued a similar travel advisory. Questions have been raised about the readability and effectiveness of the press releases issued by the WHO/PAHO, CDC, and the ministries of health of affected countries with the average readability of a press release by the WHO measured at 17.1 on the Flesch Kincaid grade level readability test. On February 5, after the laboratory confirmation of a Zika virus infection in the U.S. in a non-traveler, which was linked to sexual contact with an infected partner, the CDC issued interim guidelines for prevention of sexual transmission of Zika virus for the United States. These guidelines recommend that men who reside in or have traveled to an area of active Zika virus transmission who have a pregnant partner should abstain from sexual activity or consistently and correctly use condoms during sex for the duration of the pregnancy. The guidelines recommend that pregnant women discuss any possible Zika exposure with their male partners. The guidelines recommend that non-pregnant women and their partners consider taking similar measures. On February 8, CDC elevated its response efforts to a Level 1 activation, the highest response level at the agency. The CDC then issued a statement on February 23 further encouraging adherence to this guidance after 14 reports of possible sexual transmission of the virus were under investigation. A bill, [Zika Authorization Plan Act of 2016](/wiki/Zika_Authorization_Plan_Act_of_2016) (H.R. 4562), was introduced in the second session of the United States [114th Congress](/wiki/114th_United_States_Congress) by Representative [Curt Clawson](/wiki/Curt_Clawson) (R-FL) on February 12, 2016, aimed at reducing the spread of the virus. [Paraguay](/wiki/Paraguay) reported its first case of Zika in a pregnant woman on March 11. On March 18, CDC cautioned men who have been infected with Zika from attempting to conceive children due to probability of virus transfer from man to woman during sexual activity which in turn can affect the fetus, under this caution, men are advised not to try conception until six months after the infection. Colombia reported its first cases of microcephaly associated to the Zika virus on April 14, 2016. The CDC authorized emergency use of a Zika Virus RNA Qualitative test on April 28 to detect Zika virus in the blood of patients who have symptoms of Zika virus infection and live in or have traveled to an area with ongoing Zika virus transmission. This is the first commercial test to detect Zika virus authorized by the [United States Food and Drug Administration](/wiki/United_States_Food_and_Drug_Administration) for emergency use. On May 6, [Major League Baseball](/wiki/Major_League_Baseball) announced that a series of games between the [Miami Marlins](/wiki/Miami_Marlins) and [Pittsburgh Pirates](/wiki/Pittsburgh_Pirates) scheduled to be played at the end of the month in [San Juan, Puerto Rico](/wiki/San_Juan,_Puerto_Rico) would be relocated to [Marlins Park](/wiki/Marlins_Park) in [Miami, Florida](/wiki/Miami,_Florida) after a number of players on each team voiced concerns regarding the threat of Zika exposure. By mid-August at least 37 people had contracted the virus in neighborhoods near the city of Miami, Florida, though officials estimated that the actual number of infections was much higher due to under-reporting of mild illness. It was determined in June that travelers to Dominican Republic lead New York City in positive Zika tests. The first-affected area in the continental United States, the [Wynwood](/wiki/Wynwood) neighborhood of Miami, was declared Zika-free in September, 2016. After the virus stopped circulating in [South Beach](/wiki/South_Beach), all of Florida was declared Zika-free in December, 2016. One case of local transmission was reported in Texas up until September, 2017. As of 2018, Zika remains endemic in Puerto Rico, but the number of cases was reduced from about 8,000 reported per month at the peak in August 2016 to about 10 reported per month in April 2017. ### Asia Following the spread of Zika infection into Southeast Asia in June 2016, [Singapore](/wiki/Singapore), [Thailand](/wiki/Thailand) and [Vietnam](/wiki/Vietnam) become the most heavily affected. Singapore has planned to release an army of mosquitoes that contain the *[Wolbachia](/wiki/Wolbachia)* bacteria to fight the Aedes aegypti mosquito population. The [Association of Southeast Asian Nations](/wiki/Association_of_Southeast_Asian_Nations) (ASEAN) members have increased information sharing and joint research on the virus. On September 30, Thailand confirmed that two babies have been born with microcephaly. Prior to the case, Thailand has allowed abortion for pregnant women that have been affected by birth defects. Malaysia is still undecided on the issue, with doctors there letting the mother make the decision whether or not to abort. Rentokil, a Malaysian pest company, has designed an Integrated Mosquito Management (IMM) program to curb the spread of Aedes mosquito. On October 17, Zika was declared as endemic in Vietnam by the country [Health Ministry](/wiki/Ministry_of_Health_(Vietnam)) due to the number of local cases. Vietnam confirmed that one baby has been born with microcephaly on October 31. Following the rise of local Zika infection cases in the [Philippines](/wiki/Philippines), the virus have also been declared as endemic by the country [Health Department](/wiki/Department_of_Health_(Philippines)). The government of the republic hosting the \"One Philippines against Zika\" national summit on October 28 with church in the country has joint fight to curb the spread of the virus by issuing a pastoral guidance to help raise awareness about the mosquito-borne disease among local communities. [Taiwan](/wiki/Taiwan) has also seen an increase of infection, most of the cases are believed to be imported from other countries. On October 27, [Myanmar](/wiki/Myanmar) reported its first imported case on a pregnant foreign woman. ### International Governments or health agencies such as those of Australia, Canada, China, Hong Kong, Indonesia, Ireland, Japan, Malaysia, New Zealand, Philippines, Singapore, South Korea, Taiwan, the United Kingdom, United States as well the European Union issued travel warnings. The warnings are predicted to have an effect on the tourism industry in affected countries. To prevent the transmission of the Zika virus, WHO recommends using [insect repellent](/wiki/Insect_repellent), wearing long-sleeved clothes to cover the body, and using screens and [mosquito nets](/wiki/Mosquito_net) to exclude flying insects from dwellings or sleeping areas. It is also vital to eliminate any standing water near homes to minimize breeding areas for mosquitoes. Authorities can treat larger water containers with recommended [larvicides](/wiki/Larvicide). Furthermore, the [Centers for Disease Control and Prevention](/wiki/Centers_for_Disease_Control_and_Prevention) (CDC) recommends that containers holding water near homes either be sealed or scrubbed once per week, because mosquito eggs can stick to them. On February 1, 2016, WHO declared the cluster of microcephaly cases and other neurological disorders a Public Health Emergency of International Concern, which may reduce the number of visitors to the Rio Olympics in 2016. The designation has been applied in the past to the [Ebola outbreak in 2014](/wiki/West_African_Ebola_virus_epidemic), the outbreak of [polio](/wiki/Poliomyelitis) in Syria in 2013, and the [2009 flu pandemic](/wiki/2009_flu_pandemic). South Korea held an emergency meeting in response to the WHO declaration on February 2, 2016. A second meeting of the WHO-convened emergency committee, held on March 8, 2016, reaffirmed the situation's status as a Public Health Emergency of International Concern. The committee reported that evidence was increasing for a causal relationship between Zika virus and microcephaly and other neurological conditions, and called for continued research, aggressive mosquito control, and improved surveillance and communication of risks to the public. The report stated that pregnant women should be advised not to travel to affected areas, and should use safe sex practices if their partners lived in or travelled to affected areas throughout their pregnancy. On March 9, 2016, WHO announced that research should prioritise prevention and diagnosis, not treatment, and in particular non-live vaccines suitable for pregnant women and those of childbearing age, novel mosquito control measures, and diagnostic tests that can detect dengue and chikungunya as well as Zika. ### Responses In January 2016, it was announced that, in response to the Zika virus outbreak, Brazil's National Biosafety Committee approved the releases of more genetically modified *Aedes aegypti* mosquitoes throughout their country. Previously, in July 2015, [Oxitec](/wiki/Oxitec) had published results of a test in the [Juazeiro](/wiki/Juazeiro) region of Brazil, of so-called \"self-limiting\" mosquitoes, to fight dengue, chikungunya, and Zika viruses. They concluded that mosquito populations were reduced by over 90% in the test region. Male genetically modified mosquitoes mate with females in the wild and transmit a self-limiting gene that causes the resulting offspring to die before reaching adulthood and thus diminishes the local mosquito population. In January 2016 the technique was being used to try to combat the [Zika virus](/wiki/Zika_virus) in the town of [Piracicaba](/wiki/Piracicaba), São Paulo. On February 1, 2016, the WHO declared the current Zika virus outbreak an international public health emergency, and the Brazilian President released a decree that increased local and federal pest control agents' access to private property required by mobilization actions for the prevention and elimination of *Aedes* mosquito outbreaks in the country. Some experts have proposed combatting the spread of the Zika virus by breeding and releasing mosquitoes that have either been genetically modified to prevent them from transmitting pathogens or that have been infected with the *[Wolbachia](/wiki/Wolbachia)* bacterium, thought to inhibit the spread of viruses. Another proposed technique consists of using radiation to [sterilize male larvae](/wiki/Sterile_insect_technique) so that when they mate, they produce no progeny. Male mosquitoes do not bite or spread disease. In February, the Brazilian federal government mobilized 60% of the country's [Armed Forces](/wiki/Brazilian_Armed_Forces), or about 220,000 soldiers, to warn and educate the populations of 350 [municipalities](/wiki/Municipalities_of_Brazil) on how to reduce mosquito breeding grounds. A joint statement on the sharing of data and results on the Zika outbreak in the Americas and future public health emergencies was issued on February 10, 2016, by a group of more than 30 global health bodies. The statement reinforces a similar consensus statement issued by WHO in September 2015. The statement calls for free access to all data as rapidly and widely as possible. In February 2016, [Google](/wiki/Google) announced that they were donating $1 million via [UNICEF](/wiki/UNICEF) to fight the spread of the Zika virus and offering professional personnel to help to determine where it will hit next. ## Prevention and treatment While there are no known cures for Zika, there have been recent developments in Zika vaccination. Three vaccine designs are showing high confidence levels of protection against the Zika virus. Scientists have conducted tests on the rhesus monkey, and human trials began in late 2016. This preventative treatment is promising, but it will take years before it is available for widespread usage. British experts are clear that any of the vaccines would take considerable time to develop. Dr Ed Wright, a senior lecturer and virologist at the University of Westminster, said: \"All of the vaccines currently under development are many years away from being licensed and available for widespread public use.\" Jonathan Ball, professor of molecular virology at the University of Nottingham, said: \"We knew that these vaccines worked in mice and now the researchers have shown that they also protect non-human primates from Zika virus infection.\" \"The next step will be to see if these vaccines are safe and the scientists hope to start early trials in humans to address this.\" Kineta, a Seattle-based biotech company, is actively working on treatments and has received an undisclosed amount of funding from National Institute of Allergy and Infectious Disease, one of the National Institutes of Health, to carry on the research. Kineta CEO Dr Shawn Iadonato said in a statement. \"We are eager to expand testing of our broad spectrum antivirals in Zika virus as they have shown compelling efficacy across other flaviviruses such as Dengue and West Nile and have the potential for long-term development.\" As of July 26, 2016, Inovio Pharmaceuticals, Inc. dosed the first subject in its multi-center phase I trial to evaluate Inovio's Zika DNA vaccine (GLS-5700). In addition to the previously announced US FDA approval for the conduct of the study, Health Canada's Health Products and Food Branch has also approved this study, which will be conducted at clinical sites in Miami, Philadelphia, and Quebec City. The phase I, open-label, dose-ranging study of 40 healthy adult volunteers is evaluating the safety, tolerability and immunogenicity of GLS-5700 administered with the CELLECTRA-3P device, Inovio's proprietary intradermal DNA delivery device. In preclinical testing, this synthetic vaccine induced robust antibody and T cell responses – the immune responses necessary to fight viral infections – in small and large animal models. [Direct Relief](/wiki/Direct_Relief), an emergency response organization, established a Zika Fund and fulfilled requests for supplies in 14 affected countries. ## Challenges to US response In May 2017, the [Government Accountability Office](/wiki/Government_Accountability_Office) published a report, \"Emerging Infectious Diseases: Actions Needed to Address the Challenges of Responding to Zika Virus Disease Outbreak\", to correspond with an associated House subcommittee hearing. The GAO said that even though scientific breakthroughs have increased in recent years, the United States remains unprepared to handle a Zika virus outbreak. Timothy Persons, head scientist at the GAO, listed areas of limited research that damage the United States' ability to effectively respond to a Zika outbreak, including an accurate record of the number of cases in the United States, components associated with transmission from mothers to children (especially regarding pregnancy), risk of transmission through bodily fluid as related to the potential for [sexual transmission](/wiki/Transmission_(medicine)) of the virus, impact of prior exposure to Zika and other [arboviruses](/wiki/Arbovirus), and both short-term and long-term outcomes. Recent outbreaks have been connected to an alarming a spike in [microcephaly](/wiki/Microcephaly), a birth defect that inhibits the proper development of a baby's brain, and [Guillain-Barré syndrome](/wiki/Guillain%E2%80%93Barr%C3%A9_syndrome), which causes paralysis. Other challenges include the lack of a safe and effective vaccine, a complicated diagnostic process, and faltering support for research funding in the federal government. Dr. Anthony Fauci, director of the [National Institute of Allergy and Infectious Diseases](/wiki/National_Institute_of_Allergy_and_Infectious_Diseases) (NIAID), said \"There aren't any federally licensed vaccines or specific therapeutics currently available to prevent or treat Zika.\" Zika is often difficult to distinguish from other illnesses that are spread by mosquitoes, like [dengue](/wiki/Dengue_fever), [West Nile](/wiki/West_Nile_fever), and [chikungunya](/wiki/Chikungunya), among others. President Trump's budget proposal for 2018 proposed stripping $800 billion from Medicaid over ten years. Democratic Representative [Frank Pallone](/wiki/Frank_Pallone) of New Jersey said that this decision \"endangers our ability to manage public health emergencies like Zika.\" ## Controversies Some efforts to contain the spread of Zika virus have been controversial. Oxitec, the company behind the \"self-limiting\" mosquitoes, which pass on a fatal gene to their offspring, released in Brazil, has faced criticism from environmental groups, who fear that releasing a new mosquito strain into the wild will damage the ecosystem. In the short term, the concern is that a drop in the mosquito population could affect the populations of other species. Supporters claim that the environmental impact of the \"self-limiting\" mosquitoes will be minimal, since only one species of mosquito is being targeted and the genetically modified mosquitoes are still safe for predators to eat. Oxitec Product Development Manager Derric Nimmo likened the process to \"going in with a scalpel and taking away *Aedes aegypti*, leaving everything untouched.\" Since *Aedes aegypti* is an imported [invasive species](/wiki/Invasive_species) in Brazil, some experts expect that its eradication will have little impact on the environment. However, other environmentalists emphasize that the long-term consequences of eliminating an entire species cannot be predicted. Government recommendations that women delay pregnancy have also proven to be controversial. [Human](/wiki/Human_rights) and [reproductive rights](/wiki/Reproductive_rights) groups have deemed the recommendations irresponsible and difficult to follow, since women alone are tasked with avoiding pregnancy despite having little control to do so. A 2012 study suggests that 56% of pregnancies in [Latin America](/wiki/Latin_America) and the [Caribbean](/wiki/Caribbean) are unplanned (compared to an average unplanned pregnancy rate of 40% worldwide). Access to [contraceptives](/wiki/Birth_control) might be limited in regions where the [Roman Catholic Church](/wiki/Catholic_Church) is predominant, such as in [El Salvador](/wiki/El_Salvador). Anti-[abortion](/wiki/Abortion) laws in much of the region leave women with no recourse once they become pregnant. Aside from three countries where abortion is widely available (French Guiana, Guyana, and [Uruguay](/wiki/Uruguay)) and three countries where abortion is allowed in cases of fetal malformation ([Colombia](/wiki/Colombia), [Mexico](/wiki/Mexico), and Panama), most of the region only permits abortion in the cases of [rape](/wiki/Rape), [incest](/wiki/Incest), or danger to the mother's health. In El Salvador, abortion is illegal under all circumstances. On February 5, 2016, the [UN High Commissioner for Human Rights](/wiki/Office_of_the_United_Nations_High_Commissioner_for_Human_Rights) urged Latin American governments to consider repealing their policies regarding contraception and abortion, emphasizing that \"upholding human rights is essential to an effective public health response\". On February 16, 2016, the Vatican condemned the UN for its call to action, deeming it \"an illegitimate response\" to the Zika crisis and emphasizing that \"a diagnosis of microcephaly in a child should not warrant a death sentence\". On February 18, 2016, after a trip to Latin America, [Pope Francis](/wiki/Pope_Francis) stated that \"avoiding pregnancy is not an absolute evil\" in cases such as the Zika virus outbreak. His comments sparked speculation that the use of contraception may be morally permissible in the prevention of the Zika virus. ## Scientific communication and concerns The 2015–2016 Zika virus outbreak became an important topic on many social media sites, especially on Twitter. An analysis of Twitter posts on February 2, 2016, showed that 50 tweets per minute were posted about Zika, many of which contained the hashtags #salud, which means health in Spanish as well as #who, which served as a reference to the World Health Organization. The epidemic also caused a rise in tweets from college students upset that their spring break trips and study abroad plans had been changed or cancelled due to the virus' spread. Many studies have been conducted on the connections and impact of social media mentions of Zika. One analysis found that the primary topics discussed on Twitter before the peak of the outbreak regarding Zika included Zika's impact, reactions to Zika, pregnancy and microcephaly, transmission routes of Zika, and case reports. During the summer of 2016 when Zika was spreading at a much faster rate, this social media analysis determined that the major topics on Twitter regarding Zika had become concerns about the spread of Zika, criticism of Congress, news about Zika, and scientific information about Zika. The same study also found that tweets from reputable institutions and people holding scientific credentials demonstrated the ability of Twitter as a source to spread information quickly on the internet. Another study found that the Centers for Disease Control and Prevention as well as the general public showed similar concerns about Zika. The CDC's posts on Twitter during the outbreak focused on symptoms and education for Zika. However, the public had more of a tendency to focus concern on the consequences of Zika on women and infants, such as microcephaly. While there was concern for children on social media, this concern was lacking in countries largely impacted by Zika virus, such as Brazil. In Brazil, struggling mothers of infants with microcephaly caused by Zika have used support systems on social media on the cellphone chat app called [WhatsApp](/wiki/WhatsApp) or on [Facebook](/wiki/Facebook) pages that can help connect mothers in need of supplies and money to donors. The heavy traditional news and social media coverage of the virus spreading did cause concern over lack of reliability. Research has found that between May and June 2016, four out of five social media posts about Zika provided accurate information, but inaccurate posts were much more popular. This led many researchers to worry about the quality of information being spread and shared on social media. Google Trends showed that Zika did not become a trending topic for the media until January 2016. A study done found that 81 percent of the most popular posts on Facebook about Zika did contain truthful information, but posts spreading false information were far more popular. Initial media reports on Zika in the United States focused on reassuring viewers and readers that Zika was not a threat in the United States. Studies have found that real-time social media updates are desirable methods for communication during the emergence of infectious diseases. However, misinformation is common and data control in the cyber world has become a growing necessity. Many people criticized the lack of governmental response from the U.S. Government in the wake of the crisis. The United States was criticized for a lack of preparedness in terms of an ability to contain a virus outbreak in the United States. The Obama Administration requested an emergency supplemental appropriation of $1.86 billion for both domestic and international response to the crisis. In response to this request, Congress redirected $589 million from funds previously dedicated to Ebola instead of allocating new funds. Another criticism regarding Zika funding had to do with the fact that Congress members still took vacation in July 2016 before allocating any of the funds requested in February 2016. In August 2016, the Centers for Disease Control and Prevention reported that they had spent $194 million of the initial $222 million allocation to fight Zika virus. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases said that the NIAID was running out of funds, which would substantially slow down the development of vaccines. Although the government faced criticism for not responding strongly enough to the Zika outbreak, the government eventually provided funding of $1.1 billion for Zika in October 2016. It took congress nearly seven months to agree to this allocation, which left many prevention and education projects without funding for a substantial amount of time. Senate Democrats urged Republicans to approve the full amount of funding more quickly rather than waiting for major transmission of Zika virus to begin in the United States. In 2017, public health experts are still concerned about the failure of the Zika response in the United States. Many officials failed to provide information about Zika's sexual transmission. New York City subway systems had posters about mosquitos while all local cases reported had been picked up elsewhere or transmitted sexually. Many experts believe that the United States lacked severely in providing the public with information to prevent sexual transmission of the virus. Portal: - Viruses - [Zika virus outbreak timeline](/wiki/Zika_virus_outbreak_timeline) - [Health crisis](/wiki/Health_crisis) ## Feather references - Zika virus infection at the Pan American Health Organization - Zika Virus at the US Centers for Disease Control and Prevention - Zika outbreak in the Americas and the Pacific at the European Centre for Disease Prevention and Control - Short Answers to Hard Questions (New York Times) - Risk map for the spread of Zika to 100 cities worldwide (UNSW Australia) - All the reported cases of Zika in the United States (Washington Post) - Zika Response Funding: In Brief [Congressional Research Service](/wiki/Congressional_Research_Service) - Zika virus 1947 to 2016 – interactive maps (esri UK) - Official Map of Zika-transmitting Mosquitoes in the US\n",
  "language": "en",
  "processed_at": "2026-01-12T09:48:54.755405",
  "title": "2015–16 Zika virus epidemic",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/2015%E2%80%9316_Zika_virus_epidemic"
}