{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:49:00.495186"
  },
  "content": "Haze over the Southeast Asia region in mid-2016This article may **require cleanup** to meet Wikipedia's quality standards. The specific problem is: **This is a very general article which reads like the [Southeast Asian haze](/wiki/Southeast_Asian_haze) article. Rewrite needed to address the 2016 situation.** Please help improve this article if you can. *(April 2023)* *(Learn how and when to remove this message)* The **2016 Southeast Asian Haze** was a transnational haze crisis that affected several nations. Smog is a recurring problem with transboundary air pollution brought on by fires. The 2016 haze that took place affected several countries in [Southeast Asia](/wiki/Southeast_Asia), including [Indonesia](/wiki/Indonesia), [Malaysia](/wiki/Malaysia) and [Singapore](/wiki/Singapore). It brought negative effects towards the environment and brought an impact on people's health and the economy. In some Southeast Asian nations, air quality deteriorates to dangerous levels as a result of excessive quantities of airborne particulate matter from burning biomass. ## Cause The haze was caused by Indonesian agricultural fires in [Sumatra](/wiki/Sumatra) and [Kalimantan](/wiki/Kalimantan). The fires are attributed to the employment of unlawful [slash-and-burn](/wiki/Slash-and-burn) farming techniques by companies and individual farmers to clear land for plantations that produce [palm oil](/wiki/Palm_oil), pulp, and [paper](/wiki/Paper). Indonesians in the state of Sumatra and Kalimantan and Riau have been heavily affected. In many places the haze has become such an established problem that schools were left open, offering significant exposure risks to the young and vulnerable of the region. It is for this reason that GE has partnered with local customers to distribute vitamins and 2,500 high quality masks to affected areas of Sumatra. ## Environment The Southeast Asian Haze harmed the environment. Haze has an impact on agriculture as well since it interferes with photosynthesis. This is because the leaves are covered in insoluble aerosols, which can reduce photosynthesis, yields, carbon dioxide absorption, and greenhouse effect. As a significant source of greenhouse gas emissions in the area and a detriment to species and ecosystems, the haze also has a significant negative influence on the environment as stated before. Political conflicts have arisen in the region as a result of the global problem of the haze. In addition to directly causing rainforest fires, the haze also negatively affects the health and reproductive of local animals, including orangutans, birds, and [amphibians](/wiki/Amphibian). Additionally, it has been hypothesized that haze influences marine habitats. Researchers are slightly better educated about plants. The particulates and chemicals in the haze interfere with plants' ability to reproduce and perform photosynthesis by adhering to leaves and weakening the sun's rays. Additionally, smoke hinders insects' capacity to pollinate flowers. A study found the effects of haze pollution in Southeast Asia to significantly impact farmers at a local level too, resulting in the decline in crop quantity and quality as well as [soil quality](/wiki/Soil_quality). ## Human health According to Sutopo Purwo Nugroho, spokesman for the National Disaster Management Agency, as many as 168,000 people in affected areas of Indonesia were seeking medical attention for respiratory issues. These solutions represent only a modest effort to address these issues. Although the immediate effects are stunning, determining the long-term hazard might be challenging. The contaminants can seriously harm one's health over the long run in addition to causing irritation to the eyes and [respiratory system](/wiki/Respiratory_system). Southeast Asian haze has high concentrations of PM10 and PM2.5 particles, which are small enough to be inhaled and can exacerbate or even cause respiratory diseases like [asthma](/wiki/Asthma). Short-term exposure to high levels of haze particles may irritate the eyes, nose, and throat in healthy people (i.e., continuous exposure to unhealthy daily average PSI levels over the course of a few days). Most of the time, this irritation goes away on its own. Any exposure is short-term in nature (i.e. continuous exposure to unhealthy daily average PSI levels over a period of a few days) and such exposure may vary from year to year. As international studies are based on long term exposure to air pollution, there is little robust data on the longer-term effects of episodic short-term exposures to haze like the pattern seen in Singapore. In general, children, elderly, and people with chronic lung disease or heart disease are more sensitive to the health effects of haze, and should adopt the preventive measures in the MOH health advisory when air quality is poor. The size of particles is directly linked to their potential for causing health problems. Small particles less than 10 micrometers in diameter pose the greatest problems, because they can get deep into human lungs, and some may even get into the bloodstream. Exposure to such particles can affect both the lungs and the heart. Numerous scientific studies have linked particle pollution exposure to a variety of problems, including: premature death in people with heart or lung disease, nonfatal heart attacks, irregular heartbeat, aggravated asthma, decreased lung function, increased respiratory symptoms, such as irritation of the airways, coughing or difficulty breathing. People with heart or lung diseases, children, and older adults are the most likely to be affected by particle pollution exposure.\n",
  "language": "en",
  "processed_at": "2026-01-12T09:49:00.494738",
  "title": "2016 Southeast Asian haze",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/2016_Southeast_Asian_haze"
}