{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:49:08.286748"
  },
  "content": "Smoke haze over the Southeast Asia region[Southeast Asian haze](/wiki/Southeast_Asian_haze) seriesHaze in [Borneo](/wiki/Borneo), 2019History1990s - [1997 Southeast Asian haze](/wiki/1997_Southeast_Asian_haze) - [1997 Indonesian forest fires](/wiki/1997_Indonesian_forest_fires) 2000s - [2005 Malaysian haze](/wiki/2005_Malaysian_haze) - [2006 Southeast Asian haze](/wiki/2006_Southeast_Asian_haze) - [2009 Southeast Asian haze](/wiki/2009_Southeast_Asian_haze) 2010s - [2010 Southeast Asian haze](/wiki/2010_Southeast_Asian_haze) - [2013 Southeast Asian haze](/wiki/2013_Southeast_Asian_haze) - [2015 Southeast Asian haze](/wiki/2015_Southeast_Asian_haze) - [2016 Malaysian haze](/wiki/2016_Malaysian_haze) - [2016 Southeast Asian haze](/wiki/2016_Southeast_Asian_haze) - [2017 Southeast Asian haze](/wiki/2017_Southeast_Asian_haze) - 2019 Southeast Asian haze Key topics - [Chemical equator](/wiki/Chemical_equator) - Deforestation - [in Borneo](/wiki/Deforestation_in_Borneo) - [in Indonesia](/wiki/Deforestation_in_Indonesia) - [Mega Rice Project](/wiki/Mega_Rice_Project) - [Peat swamp forest](/wiki/Peat_swamp_forest) - [Borneo](/wiki/Borneo_peat_swamp_forests) Responses - [ASEAN Agreement on Transboundary Haze Pollution](/wiki/ASEAN_Agreement_on_Transboundary_Haze_Pollution) - [Operation Haze](/wiki/Operation_Haze) - [Transboundary Haze Pollution Act 2014](/wiki/Transboundary_Haze_Pollution_Act_2014) - [People's Movement to Stop Haze](/wiki/People%27s_Movement_to_Stop_Haze) See also - [Air pollution in Malaysia](/wiki/Air_pollution_in_Malaysia) - [API](/wiki/Air_Pollution_Index) - [Singapore PSI](/wiki/Pollutant_Standards_Index) - [Social and environmental impact of palm oil](/wiki/Social_and_environmental_impact_of_palm_oil) Category - v - t - e A large [air pollution](/wiki/Air_pollution) crisis affected several countries in [Southeast Asia](/wiki/Southeast_Asia) from February to September 2019, including [Brunei](/wiki/Brunei), [Indonesia](/wiki/Indonesia), [Malaysia](/wiki/Malaysia), the [Philippines](/wiki/Philippines), [Singapore](/wiki/Singapore), [Thailand](/wiki/Thailand), and [Vietnam](/wiki/Vietnam). Thailand began to experience a [haze](/wiki/Haze) in February that lasted until May, peaking in March and April. Indonesia began to experience haze between June and July. Malaysia was affected from August, while Singapore, Brunei, and Vietnam experienced haze in September. It was the latest occurrence of the [Southeast Asian haze](/wiki/Southeast_Asian_haze), a long-term issue that occurs in varying intensity during every dry season in the region. It was mainly caused by [forest fires](/wiki/Forest_fires) resulting from illegal [slash-and-burn](/wiki/Slash-and-burn) clearing performed on behalf of the [palm oil](/wiki/Palm_oil) industry in Indonesia, principally on the islands of [Sumatra](/wiki/Sumatra) and [Borneo](/wiki/Borneo), which then spread quickly in the [dry season](/wiki/Dry_season). ## Background and causes ### Northern [ASEAN](/wiki/ASEAN) nations Most of the hotspots for the northern countries of South East Asia (Thailand, Myanmar, Cambodia, Laos, Vietnam, and the Philippines) occurred from January to May 2019, particularly in March and April 2019. There have been fires in forested lands in northern Thailand with farmlands in Pa Phru Kuan Kreng of [Nakhon Si Thammarat Province](/wiki/Nakhon_Si_Thammarat_Province) in southern Thailand. ### Southern ASEAN nations Forest fires in Indonesia cause the trans-boundary haze in Indonesia, Malaysia, and Singapore almost every year. These fires clear land for [palm oil](/wiki/Palm_oil) [plantations](/wiki/Plantation), and are known to be started by [smallholding](/wiki/Smallholding) subcontractors who supply large companies that claim to discourage the practice but admit the [chain of custody](/wiki/Chain_of_custody) is a \"complicated web.\" This web is further complicated by the fact that financing of oil palm industries come from numerous banks. Most of these banks are from Asia, including Singapore, Malaysia and Indonesia, that have funded billions of dollars towards deforestation for oil palm and pulp and paper industries. In 2019, fires have been burning in multiple provinces of [Sumatra](/wiki/Sumatra) and [Kalimantan](/wiki/Kalimantan) within Indonesia. These regions possess large areas of [peatland](/wiki/Peatland), which is highly combustible during the [dry season](/wiki/Dry_season). Peatlands in these areas are extremely vulnerable to combustion because they are originally wetlands and rarely ever burn. However, these peatlands are drained and dried for agriculture use, making them extremely susceptible to burning. [Peat](/wiki/Peat), which is made up of layers of dead vegetation and other organic matter, contributes heavily to carbon emissions when it is burnt, because of its high density and carbon content. According to the Asean Specialised Meteorological Centre, most of the hotspots for Indonesia and Malaysia occurred in August and September 2019. As of September 2019, Indonesia has had a total of over 20,000 hotspots in 2019, while Malaysia has had over 2,000 hotspots. On 12 September 2019 alone, there were 1,188 hot spots in Kalimantan provinces and 431 hot spots in Sumatra provinces. In June 2019, forest fires in the Malaysian state of [Sarawak](/wiki/Sarawak) on the island of [Borneo](/wiki/Borneo) resulted in the Malaysian city of [Miri](/wiki/Miri) being affected by haze. ## Affected countries ### Brunei On 7 September 2019, Brunei experienced haze, which its government attributed to hot spots across the Indonesian border in the [Kalimantan](/wiki/Kalimantan) provinces of Borneo. ### Indonesia Following the previous critical [2015 Southeast Asian haze](/wiki/2015_Southeast_Asian_haze) that traced its origin in Indonesia, forest fires in the country returned in July with 42,740 hectares (105,600 acres) of land burned across the country that caused trans-boundary haze towards Malaysia and Singapore. The government sent 9000 military, police and disaster agency personnel to fight the fires. In 2019, there were thousands of fires started in [Indonesia](/wiki/Indonesia), most of them set to clear land for plantations that make [palm oil](/wiki/Palm_oil). Fires created smoke that disrupted air travel and sickened people. Indonesia environment minister said [smog](/wiki/Smog) was also from fires ignited from hotspots in [Malaysia](/wiki/Malaysia) and [Vietnam](/wiki/Vietnam). [Indonesia's Disaster Mitigation Agency](/wiki/Indonesian_National_Board_for_Disaster_Management) said more than 3,600 fires had been detected on the islands of [Sumatra](/wiki/Sumatra) and [Borneo](/wiki/Borneo) by weather satellites. Malaysia sent a diplomatic note urging Indonesia to take immediate action to address the fires. Malaysia shut more than 400 schools and sent half a million face masks to the area to combat poor air quality. Rainy weather arrived from 24 September 2019 in six provinces, namely Riau, Jambi, South Sumatra, West Kalimantan, Central Kalimantan, and South Kalimantan, bringing much needed relief from the choking haze past few weeks. As of September, there were 885,026 cases of severe respiratory infections due to the haze; 291,807 came from [South Sumatra](/wiki/South_Sumatra), 268,591 from [Riau](/wiki/Riau), and 163,662 from [West Kalimantan](/wiki/West_Kalimantan). ### Malaysia Early in February, forest and peatlands in [Pahang](/wiki/Pahang) caught fire. In early August, [Klang](/wiki/Klang_(city)) was shrouded in dense haze caused by fires in [Riau](/wiki/Riau), which was exacerbated by a fire at a nearby forest reserve. Major cities and towns in the state of Sarawak, such as [Kuching](/wiki/Kuching), were also affected by haze from hot spots in Kalimantan. Malaysia also activated its National Action Plan for Open Burning and its existing National Haze Action Plan on 14 August, as air quality in Kuala Baram and [Miri](/wiki/Miri,_Malaysia) reached hazardous levels. In [Rompin](/wiki/Rompin_District), [Pahang](/wiki/Pahang), the [Air Pollution Index](/wiki/Air_Pollution_Index) (API) recorded on the 18th of August was 223, which is categorized as being \"very unhealthy\". Several other Malaysian states and federal territories such as [Kuala Lumpur](/wiki/Kuala_Lumpur), [Negeri Sembilan](/wiki/Negeri_Sembilan), [Penang](/wiki/Penang), [Putrajaya](/wiki/Putrajaya) and [Selangor](/wiki/Selangor) were also affected by haze from Sumatra in Indonesia while the state of Sarawak had been affected by fires in the state since July and from neighbouring Kalimantan, Indonesia since August. 2.4 hectares of forest also burned in [Johor](/wiki/Johor) in August. [Spotify](/wiki/Spotify) Malaysia created a playlist called *Hazed and Confused* that included songs about fire and burning. ### Philippines On 17 September 2019, based on the initial report of regional offices of the Environment Management Bureau (EMB), it was confirmed by the agency and the authorities of [General Santos](/wiki/General_Santos) that prolonged hazy skies were experienced in [Mindanao](/wiki/Mindanao) and the [Visayas](/wiki/Visayas), particularly [Cebu City](/wiki/Cebu_City). Hazy conditions have also been experienced in [Koronadal](/wiki/Koronadal), [Tupi](/wiki/Tupi,_South_Cotabato), and [Davao City](/wiki/Davao_City). ### Singapore On 26 August 2019, there was slight haze in Singapore, with conditions gradually improving over the day. This was possibly due to fires in Sumatra, Indonesia, or Johor, Malaysia. On 9 September 2019, there was again slight haze in Singapore, possibly due to an increase in hot spots in Sumatra, Indonesia. These slightly hazy conditions persisted. At 4pm on 14 September 2019, the 24-hour [Pollutant Standards Index](/wiki/Pollutant_Standards_Index) (PSI) entered the \"unhealthy\" range of above 100 for the first time since (/wiki/2016_Southeast_Asian_haze), starting from 103 in western Singapore. The PSI steadily climbed up with all parts of Singapore registering \"unhealthy\" PSI readings at 1am the next day, peaking at 124 from 5am to 8am in western Singapore. Despite this, the air quality improved over the next two days, resulting in the PSI dropping back to \"moderate\" levels. However, on 18 September 2019, the haze returned to Singapore, resulting in the PSI increasing to \"unhealthy\" levels. This caused [Firefly](/wiki/Firefly_(airline)) to cancel all flights from [Seletar Airport](/wiki/Seletar_Airport) for the next two days. The next day, the PSI peaked at 154 around 4am in southern Singapore before improving progressively, with all parts of Singapore registering a \"moderate\" level by 9pm. On 21 September 2019, the PSI hit unhealthy levels once again, with fears that the haze could affect a [Formula 1 race](/wiki/Singapore_Grand_Prix). The PSI stayed in the unhealthy range for most of the next day, with rain forecasted to bring relief should it happen. Rain came on 23 September 2019, with subsequent showers that brought relief from the haze. This resulted in the [National Environment Agency](/wiki/National_Environment_Agency) (NEA) forecasting healthy PSI readings since the haze first hit Singapore two weeks ago. ### Thailand Early in March, an area in northern Thailand was engulfed by haze from forest fires in [Chiang Mai](/wiki/Chiang_Mai_Province) and [Chiang Rai](/wiki/Chiang_Rai_Province) provinces as well as from the border with [Myanmar](/wiki/Myanmar). Million hectares of forested lands in Chiang Mai, Chiang Rai, [Lampang](/wiki/Lampang_Province), [Lamphun](/wiki/Lamphun_Province), [Mae Hong Son](/wiki/Mae_Hong_Son_Province), [Nan](/wiki/Nan_Province), [Phayao](/wiki/Phayao_Province), [Phrae](/wiki/Phrae_Province) and [Tak](/wiki/Tak_Province) provinces were destroyed. Furthermore, in July, around 2,318.88 hectares (5,730.1 acres) of forest and farmlands in Pa Phru Kuan Kreng of Nakhon Si Thammarat Province and surrounding areas in southern Thailand have been destroyed by fires. In September, haze from Indonesia plantation fires reached the southern area of Thailand especially in [Phuket City](/wiki/Phuket_City). The Air Quality Index in Phuket reached about 158 as of 9am on 23 September 2019. ### Vietnam After the [2019 Vietnam forest fires](/wiki/2019_Vietnam_forest_fires) affected central Vietnam in mid-June and dissipated in August, the southern area of Vietnam especially [Ho Chi Minh City](/wiki/Ho_Chi_Minh_City) began to be covered with heavy smog in September. Through monitoring and air pollution test results show that forest fires in Indonesia combined with the city large emissions become the main cause of heavy air pollution in the southern region of Vietnam. ## Response from authorities and joint agreement In August, all of the involved countries reached an agreement to prevent land and forest fires that are causing transboundary haze pollution with the hope to achieve a haze-free [Association of Southeast Asian Nations](/wiki/Association_of_Southeast_Asian_Nations) (ASEAN) by the year 2020. ### Brunei The Department of Environment, Parks and Recreation of Brunei (JASTRe) set to introduce a law that will tackle \"rampant open burning\" in the country to mitigate bush and forest fires. ### Indonesia Indonesian President [Joko Widodo](/wiki/Joko_Widodo) has instructed the country's [National Board for Disaster Management](/wiki/Indonesian_National_Board_for_Disaster_Management) (BNPB), [National Armed Forces](/wiki/Indonesian_National_Armed_Forces) (TNI), and the [National Police](/wiki/Indonesian_National_Police) (POLRI) to deal with the fires in Sumatra and Kalimantan. The President also threatens to sack firefighters if the forest fires are not tackled immediately. ### Malaysia [Malaysian Maritime Enforcement Agency](/wiki/Malaysian_Maritime_Enforcement_Agency) (MMEA) has dispatched two flights using the [Bombardier CL415](/wiki/Canadair_CL-415) aircraft carrying 198,000 litres of water to fight forest fire in [Miri](/wiki/Miri,_Malaysia). On 19 August 2019, Datuk Amar [Douglas Uggah Embas](/wiki/Douglas_Uggah_Embas), the Deputy Chief Minister of Sarawak, announced that principals would be given discretion on closing their schools if API reading became 'unhealthy'. On September 10, the National Disaster Management Agency (Nadma) sent 500,000 face masks to Sarawak amid worsening trans-boundary haze in the state. The state of [Johor](/wiki/Johor)'s Education Department closed down all schools and kindergartens in [Pontian](/wiki/Pontian_District), [Muar](/wiki/Muar_(town)) and [Tangkak](/wiki/Tangkak) on September 15 because of the haze, affecting over 64,000 students. Putrajaya and Selangor also announce the closure of 25 and 138 schools respectively for the 17th of September as the haze situation worsened in those areas. In addition, school in Sarawak and Negeri Sembilan were asked to close too, bringing the total of schools shut to 636. During 19–21 September, all schools in Kuala Lumpur, Putrajaya, Selangor, and Penang, totaling at 1,658 schools, were closed. Alongside that, 119 schools in Kedah, 147 in Perak, and 59 in Negeri Sembilan followed the closing on September 19. The number of schools closed kept increasing steadily, with the total number of schools closed peaking at 2,459, affecting about 1,732,842 students as of 11pm on 18 September 2019. The Malaysian [Energy, Science, Technology, Environment and Climate Change](/wiki/Ministry_of_Energy,_Science,_Technology,_Environment_and_Climate_Change_(Malaysia)) Ministry said they wanted concerted efforts taken in accordance with the [ASEAN Agreement on Transboundary Haze Pollution](/wiki/ASEAN_Agreement_on_Transboundary_Haze_Pollution) ratified by member countries. Malaysian [Health Ministry](/wiki/Ministry_of_Health_(Malaysia)) has cautioned members of the public to cut down on outdoor physical activities and urged them to wear face masks, umbrellas and caps when outdoors as well advising people to drink plenty of water and to seek immediate treatment if they were not well. The Menteri Besar of Selangor has announced that the state will confiscate land in the state where farmers persist with open burning as well. On 18 September 2019, the [Ministry of Education](/wiki/Ministry_of_Education_(Malaysia)) announced new standard operating procedures (SOPs) for school closures. The new guidelines state that school closures must be announced by 6pm daily should the API rises above 200. In addition, all outdoor activities must be stopped if the API exceeds 100. ### Singapore The [National Environment Agency](/wiki/National_Environment_Agency) of Singapore also started issuing daily advisories on the haze. Meanwhile, the [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)) said that air purifiers are ready should the haze worsen, with closure of schools when the Pollutant Standards Index reaches 300 and above. Similarly, several agencies like [Sport Singapore](/wiki/Sport_Singapore) and [MINDEF](/wiki/Ministry_of_Defence_(Singapore)) have announced plans to deal with the haze. In addition, Singapore has a stockpile of 16 million [N95](/wiki/Respirator) masks should the haze continue to deteriorate further. The [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)) said that students could take their [PSLE](/wiki/PSLE) and national examinations indoors, with air purifiers to be turned on if required. ### Thailand Thailand's [Nakhon Si Thammarat Province](/wiki/Nakhon_Si_Thammarat_Province) Governor Chamroen Tippayaponthada has offered a [฿](/wiki/Thai_baht)5,000 reward for evidence leading to the arrest of anyone suspected of starting the forest fires in the province. As a result of the haze from Indonesia reaching southern Thailand in September, Phuket Provincial Health Office (PPHO) has issued a health advisory along with the distribution of free health masks to people. - [Southeast Asia haze](/wiki/Southeast_Asian_haze) - [2015 Southeast Asian haze](/wiki/2015_Southeast_Asian_haze) - [2019 Vietnam forest fires](/wiki/2019_Vietnam_forest_fires) - Media related to 2019 Southeast Asian haze at Wikimedia Commons Portals: - Asia - Environment\n",
  "language": "en",
  "processed_at": "2026-01-12T09:49:08.286236",
  "title": "2019 Southeast Asian haze",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/2019_Southeast_Asian_haze"
}