{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:49:10.542754"
  },
  "content": "Outbreak of dengue in Singapore In the **2020 dengue outbreak in Singapore**, a record-breaking number of [dengue fever](/wiki/Dengue_fever) cases was reported in [Singapore](/wiki/Singapore). This was part of the wider [2019–2020 dengue fever epidemic](/wiki/2019%E2%80%932020_dengue_fever_epidemic) which also affected several neighbouring countries in Southeast Asia. A locally uncommon strain of the [dengue virus](/wiki/Dengue_virus) — one that the local populace would be more susceptible to – had begun to reemerge toward the end of 2019. This contributed to a four-year high in the number of people infected in the first six weeks of 2020, establishing a high baseline for disease incidence even before the onset of the peak dengue season in the middle of the year. There was a steep climb in the rate of infection beginning in May, and by early July the total number of cases for the year was projected to surpass the previous high of 22,170 recorded in the [2013 outbreak](/wiki/2013_dengue_outbreak_in_Singapore). The weekly disease incidence would reach a historic peak of 1,792 new cases during the week of 19–25 July. This surge of infections drove the cumulative number of cases to 22,403 on 5 August 2020, breaking the 2013 record. On 14 October, the number of deaths due to dengue reached 28, surpassing the previous record from the [2005 outbreak](/wiki/2005_dengue_outbreak_in_Singapore). The year ended with a total of 35,315 dengue fever cases, including 54 instances of dengue haemorrhagic fever, a more severe form of the disease. 32 deaths were attributed to the disease. ## Timeline ### January - **15 January**: The [National Environment Agency](/wiki/National_Environment_Agency) (NEA) warned about the reemergence of the DENV-3 strain of the [dengue virus](/wiki/Dengue_virus), which had not been common in Singapore in the past three decades, meaning that the local population would be more susceptible to it. ### February - **8 February**: A four-year high in the number of people infected in the first six weeks of the year is reported, at 2,130 cases. ### May - **11 May**: Senior Parliamentary Secretary at the [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)) and [Ministry of Trade and Industry](/wiki/Ministry_of_Trade_and_Industry_(Singapore)) [Low Yen Ling](/wiki/Low_Yen_Ling) contracted dengue. ### June - **9 June**: Infection rates doubled in the span of five weeks, from 390 new cases a week to 872. The cumulative number of cases in the year crosses the milestone of 10,000 cases. - **12 June**: 895 infections are recorded in the first five and a half days of the [epidemiological week](/wiki/Epidemiological_week), breaking the record for number of cases in a week. ### July - **23 July**: Outgoing [Minister for Transport](/wiki/Ministry_of_Transport_(Singapore)) [Khaw Boon Wan](/wiki/Khaw_Boon_Wan) was hospitalised for dengue fever, just days ahead of his retirement following the [2020 general election](/wiki/2020_Singaporean_general_election). Due to a high temperature, he had been admitted to an [isolation ward](/wiki/Isolation_ward) as a precaution, but was later tested negative for COVID-19. - **25 July**: The peak weekly disease incidence for the year occurs in the week of 19–25 July, which had a historic 1,792 infections, more than doubling the previous record of 891 cases in 2014. ### August - **5 August**: The [previous record for number of cases in a year](/wiki/2013_dengue_outbreak_in_Singapore) is surpassed when the number of cases reaches 22,403. ### October - **14 October**: The number of deaths due to dengue rises to 28, surpassing the [previous high recorded in 2005](/wiki/2005_dengue_outbreak_in_Singapore). ## Epidemiology ### Resurgence of less common DENV-3 strain There are four strains of dengue virus, DENV-1 to DENV-4. Infection with one [serotype](/wiki/Serotype) confers [immunity](/wiki/Immunity_(medical)) against it, but not the others. Since 2016, DENV-2 had been the dominant strain in Singapore, causing the majority of infections. There had not been an outbreak of the less common DENV-3 in Singapore for nearly three decades, so the local population had lower immunity against it and was more susceptible to infection when DENV-3 returned as the dominant strain from January to April 2020. This contributed to an unusually high number of infections even before the start of the mid-year peak dengue season, which in turn increased the momentum of dengue transmission. ### Concurrent COVID-19 pandemic #### Challenges faced by healthcare system Response against the dengue outbreak was complicated by the concurrent [COVID-19 pandemic](/wiki/COVID-19_pandemic) (and vice versa), with the simultaneous outbreaks putting strain on the [local healthcare system](/wiki/Healthcare_in_Singapore). Before the development and widespread availability of accurate [COVID-19 tests](/wiki/COVID-19_tests), doctors faced challenges in rendering the correct diagnosis, as the two diseases share some of the same early symptoms, and have clinical and laboratory characteristics in common. In February, during the early stages of the coronavirus pandemic, two patients in Singapore initially recorded [false-positive](/wiki/False-positive) test results for dengue and were thus misdiagnosed before later being found to actually have [COVID-19](/wiki/COVID-19); this included one patient who was originally reported as the first to have been infected with both diseases. The discovery of such false-positive cases uncovered the risk of [healthcare-associated infections](/wiki/Healthcare-associated_infection), since mistaking COVID-19 for dengue could lead to the adoption of a lower level of [infection control](/wiki/Infection_control) than would actually be required. Consequently, additional care had to be taken during the hospital [triage](/wiki/Triage) process, with full precautions taken when screening patients, until COVID-19 could be eliminated as a possibility. Conversely, protective measures against COVID-19 can create bottlenecks in healthcare systems and lead to delays in diagnosis; confirmation that a patient does not pose a COVID-19 risk requires two consecutive negative test results obtained at least 24 hours apart. However, dengue fever is also potentially deadly, and failure to treat it promptly during its critical phase can negatively impact survival outcomes. Therefore, \"detailed and strict\" protocols needed to be developed and implemented to distinguish between the two diseases and conduct necessary treatment while managing the risk of COVID-19 transmission. #### Impact of COVID-19 lockdown measures The [\"circuit breaker\" measures](/wiki/2020%E2%80%9321_Singapore_circuit_breaker_measures) implemented by the [Government of Singapore](/wiki/Government_of_Singapore) to contain the spread of COVID-19 contributed to an increase in dengue cases among the general population between April and June. The *[Aedes aegypti](/wiki/Aedes_aegypti)* [mosquito](/wiki/Mosquito), the primary [vector](/wiki/Disease_vector) for dengue, is a daytime feeder that dwells in indoor environments. When all schools and 95% of workplaces were closed due to the stay-at-home-order, it forced a dramatic shift in the mobility patterns of all school-aged children and a majority of working-age adults. As more people remained at home during the day due to the lockdown, this increased the number of prospective [hosts](/wiki/Host_(biology)) for mosquitoes to target, helping fuel an increase in disease spread. A study carried out by the NEA and the School of Public Health at the [National University of Singapore](/wiki/National_University_of_Singapore) performed [difference in differences](/wiki/Difference_in_differences) statistical analysis to determine how changes in mobility patterns during the circuit breaker period impacted dengue infection rates. After compensating for other factors such as weather (which affects mosquito breeding and activity), seasonal effects (a surge of dengue infections is usually observed in the mid-year peak season), and the higher initial number of cases at the beginning of 2020, the study found that there were 37.2% more dengue infections (with a 95% [confidence interval](/wiki/Confidence_interval) of 19.9%–49.8%) than would have otherwise occurred without the stay-at-home-order. Working-age adults represented the bulk of the additional infections, as they spent more time working from homes with natural ventilation, rather than at their workplaces, most of which are better protected against mosquitoes due to air-conditioning. Schoolchildren were affected to a lesser extent, experiencing a 12% increase in the number of cases compared to the norm. The reopening of schools partway through the circuit breaker has been postulated as a possible reason, as well as the fact that students would usually be home before dusk, a time of peak mosquito biting activity. The COVID-19 lockdown also had an undesirable effect on mosquito breeding. The stoppage of construction work meant that construction sites were maintained only by skeleton crews and as such more prone to accumulation of [stagnant water](/wiki/Stagnant_water) from regular rainfall, leading to more mosquito breeding sites. Vector control inspections conducted at construction sites from April to June 2020 found that 18% them harboured mosquito breeding areas, triple the amount compared to the prior three months. A labour shortage caused by COVID-19 infections among the migrant worker population forced some landscaping works to be deferred, leading to an increase in untrimmed vegetation that provided a hospitable environment for mosquitoes. Residential areas also experienced an increase in mosquito breeding throughout the stay-at-home-order, with a sharp rise in the number of mosquito breeding sites found by vector control inspectors in homes and common areas of [public housing blocks](/wiki/Public_housing_in_Singapore) during this period, amounting to five times that of the two months prior. This was despite a sustained publicity campaign that exhorted the community to take preventive measures to eliminate potential breeding habitats, and contrary to expectations that residents, being confined to their homes, would be better able to implement the necessary steps. Public health experts have suggested that this could be because housekeeping demands actually increased during this period, with residents having to divide their time between [remote work](/wiki/Remote_work) and [child care](/wiki/Child_care), along with the need to prepare additional meals. On the other hand, the circuit breaker period led to a decrease in dengue infections among the migrant workforce population in Singapore. This demographic group mostly lives in densely-packed shared dormitories, and were thus disproportionately impacted by COVID-19. To help contain the spread of COVID-19, strict quarantine protocols were implemented to confine workers to their dormitories, with several being declared as \"isolation areas\". These measures are estimated to have led to a 68.5% reduction in the risk of contracting dengue fever for these foreign workers, or about 432 fewer cases over the duration of the quarantine, highlighting the elevated risk of dengue that migrant workers routinely face when at work. ## Preventive measures The NEA conducted public communications and outreach campaigns to increase awareness and encourage the community to take preventive steps to prevent the spread of dengue. In light of the outbreak, its annual National Dengue Prevention Campaign, which usually takes place during the mid-year peak dengue season, was brought forward to March, and extended to cover a two-month duration until May. NEA also took preventive [vector control](/wiki/Vector_control) measures against the *Aedes aegypti* mosquito, working with [town councils](/wiki/Town_Council_(Singapore)) to eliminate stagnant water and prevent mosquito breeding and coordinate chemical treatment with [insecticides](/wiki/Insecticides) and [larvicides](/wiki/Larvicides) in dengue clusters to reduce the mosquito population. This included an \"intensive\" two-week exercise as the outbreak peaked in July. Over the course of the year, about 1 million inspections were conducted of homes, common areas of housing estates, construction sites and other premises to root out mosquito breeding habitats, uncovering about 23,400 instances. After the number of mosquito breeding sites found in home inspections quintupled during the COVID-19 circuit breaker period, the NEA further tightened enforcement with increased fines from 15 July onward. During the peak dengue season between June and October, the [Ministry of Health](/wiki/Ministry_of_Health_(Singapore)) and NEA distributed over 300,000 bottles of mosquito repellent to dengue patients to prevent them from getting bitten, thus helping to break the [chain of transmission](/wiki/Disease_transmission) and protect others around them. In August, another 46,000 bottles were given to students of 37 schools in dengue-hit areas. The NEA expanded ongoing studies of new vector control methods involving the release of male mosquitoes carrying the *[Wolbachia](/wiki/Wolbachia)* bacteria into the field to mate with wild (non-*Wolbachia*-carrying) females. The resulting eggs are unable to hatch, leading to a decline in the mosquito population, with a reduction of up to 90% being observed.\n",
  "language": "en",
  "processed_at": "2026-01-12T09:49:10.542284",
  "title": "2020 dengue outbreak in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/2020_dengue_outbreak_in_Singapore"
}