{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:49:08.649036"
  },
  "content": "Preventative measure by the Government of Singapore to ease community spread of COVID-19 The **2020–21 Singapore circuit breaker measures** were a [stay-at-home order](/wiki/Stay-at-home_order) and *[cordon sanitaire](/wiki/Cordon_sanitaire_(medicine))* implemented as a preventive measure by the [Government of Singapore](/wiki/Government_of_Singapore) in response to the [COVID-19 pandemic in the country](/wiki/COVID-19_pandemic_in_Singapore) on 7 April 2020. The measures were brought into legal effect by the Minister for Health with the COVID-19 (Temporary Measures) (Control Order) Regulations 2020, published on 7 April 2020. Singapore had relatively few COVID-19 cases before the emergence of the [Delta](/wiki/SARS-CoV-2_Delta_variant) and [Omicron](/wiki/SARS-CoV-2_Omicron_variant) variants from 8 May 2021 to 29 March 2022. With its relative success in curbing the early spread of the virus in Singapore, the term \"circuit breaker\" and its measures was subsequently adopted by other countries, particularly in [Canada](/wiki/COVID-19_pandemic_in_Canada) and the [United Kingdom](/wiki/COVID-19_pandemic_in_the_United_Kingdom). ## Chronology Singapore recorded its first COVID-19 case on 23 January 2020. With that, many Singaporeans have purchased and worn masks when not at home; practiced social distancing and on 7 February 2020, Singapore raised the [Disease Outbreak Response System Condition](/wiki/Disease_Outbreak_Response_System_Condition) (DORSCON) level from Yellow to Orange in response to additional local cases of uncertain origin. ### Prelude (27 March) On 24 March, the Multi-Ministry Task Force announced stricter measures to combat the spread of COVID-19, after a huge spike in cases originating from returning Singaporeans in the community. These measures include the closure of entertainment venues, tuition and enrichment centres and places of worship. Malls, retail establishments and tourist attractions were required to reduce their crowd density to stay open. Gatherings of more than 10 people outside work and school are prohibited. ### Lockdown measures On 3 April 2020, Prime Minister [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) announced a nationwide partial lockdown, known as a *circuit breaker*, to contain the spread of COVID-19 in Singapore. These measures came after an increase of unlinked cases over the preceding month, as well as the risk of a huge cluster of infections. Most of the workplaces were converted to [remote work](/wiki/Remote_work) as default during the lockdown and schools were transitioned to [home-based learning](/wiki/Distance_education) thereafter. As dining-in is a high-risk activity; all food establishments were only allowed to offer take-away, drive-thru and delivery of food. Non-essential advertising at shopping centres are not allowed to be shown or advertised and only advertising from essential service offers and safe management measures such as mask wearing and social distancing are allowed. These measures only took effect from 7 April 2020 to 1 June 2020, 16 May 2021 to 13 June 2021 and 22 July 2021 to 9 August 2021. On 14 April, [Minister for National Development](/wiki/Ministry_of_National_Development_(Singapore)) [Lawrence Wong](/wiki/Lawrence_Wong) announced that the wearing of masks became compulsory when not at home with immediate effect, with fines and prosecution for offenders who refuse to do so. ### Tightened measures (21 April) After discovering that the unknown number of cases was greater than expected, Prime Minister Lee Hsien Loong announced on 21 April an extension of the circuit breaker to 1 June. Existing measures were also tightened until 4 May initially, including shrinking the list of essential services, such as closing all close-contact service providers such as hair salons, as well as restricting entry to certain hotspots like wet markets and some essential retail franchises going by the last digit of one's ID number. Popular markets used an odd/even date entry restriction; ID ending with odd numbers are only allowed entry on odd dates of the month and ID ending with even numbers are only allowed entry on even dates on the month. On 21 April, the Ministry of Education brought forward the 4-week school holidays for all MOE Kindergartens, primary, secondary and Pre-University students, which are usually held in June, to May. Institutes of Higher Learning extended their Home-based Learning. The Singapore franchise of [McDonald's](/wiki/McDonald%27s) also shut all of its restaurants islandwide, as a response to a number of its employees being infected. ### Relaxed measures (2 May) Some restrictions were relaxed progressively in stages to prepare for the end of the circuit breaker on 1 June. [Traditional Chinese medicine](/wiki/Traditional_Chinese_medicine) (TCM) shops and essential condo activities were allowed to reopen on 5 May, followed by businesses like home-based bakeries, some food shops, barbers (only basic haircuts), manufacturing of confectionery, and laundry shops on 12 May. Schools resumed face-to-face lessons for smaller groups in graduating cohorts and those requiring urgent assistance on 19 May. On 8 May, the MOH announced that all TCM shops are allowed to sell retail products again from 12 May, after receiving feedback from seniors that travelling to the initially allowed 130 TCM medical halls was too far for them. ## SafeEntry and TraceTogether The Ministry of Health mandated the use of [SafeEntry](/wiki/SafeEntry) and [TraceTogether](/wiki/TraceTogether), which is also called *TraceTogether-only SafeEntry* (TT-only SE) during the COVID-19 pandemic. Scanning in/out using the *TraceTogether-only SafeEntry* (TT-only SE) either through the TraceTogether app or token was made mandatory for all Singaporeans and at all places such as cinemas, restaurants, workplaces, schools and shopping malls for contact tracing purposes. These included the device called SafeEntry Gateway (Check in and check out) to enable users to scan in and out. In addition, TraceTogether also showed vaccination status and pre-event testing (PET) status whether the person test positive or negative for COVID-19. Tokens could be collected from the community centres and vending machines. ## Post-circuit breaker (reopening) Earlier in 2020, three planned phases of reopening were announced, which were part of a wider zero-COVID effort. These phases ended on 8 May 2021 because of the Delta variant. - Phase 1 (a loosened form of Heightened Alert) started on 2 June 2020. This phase allowed for gatherings and home visits of up to 5 people, but no dining-in and unmasked activity is allowed. - Phase 2 ran between 19 June 2020 (with dining-in and unmasked activity of up to 2 persons) and 17 July 2020 (with dining-in and unmasked activity of up to 5 persons). - Phase 3 officially started on 28 December 2020 and ended on 8 May 2021. Restrictions due to new Variants of Concern ([Delta](/wiki/SARS-CoV-2_Delta_variant) and [Omicron](/wiki/SARS-CoV-2_Omicron_variant)) started on 8 May 2021 and ended on 29 March 2022, during which gatherings of more than five people were prohibited. Two separate lockdowns ran from 16 May 2021 to 13 June 2021 and 23 July to 9 August 2021, but in between 14 June 2021 and 23 July 2021, the government only allowed a reopening similar to Phase 1 of June 2020. The government then changed the reopening plan to only allow vaccinated persons to use certain services from August 2021. In addition, it was announced on 14 December 2020 that the [Pfizer-BioNTech vaccine](/wiki/BNT162b2) was approved for use in Singapore, with the first batch slated for around end of December 2020. On 3 February 2021, the [Moderna vaccine](/wiki/Moderna_vaccine) was approved for use in Singapore, with the first batch arriving around March 2021. Subsequent batches for both vaccines were planned to arrive throughout 2021. A successful [mass vaccination campaign](/wiki/COVID-19_vaccination_in_Singapore) was launched that achieved very high vaccination rate. ## Non-compliance Through 2021, there were several high-profile instances of people, such as Phoon Chiu Yoke, refusing to abide by the circuit breaker regulations. - [COVID-19 lockdowns](/wiki/COVID-19_lockdowns) - [COVID-19 lockdown in China](/wiki/COVID-19_lockdown_in_China) - [COVID-19 lockdown in India](/wiki/COVID-19_lockdown_in_India) - [COVID-19 lockdown in Italy](/wiki/COVID-19_lockdown_in_Italy) - [COVID-19 community quarantines in the Philippines](/wiki/COVID-19_community_quarantines_in_the_Philippines) - [Enhanced community quarantine in Luzon](/wiki/Enhanced_community_quarantine_in_Luzon) - [Indonesia large-scale social restrictions](/wiki/Indonesia_large-scale_social_restrictions) - [Malaysian movement control order](/wiki/Malaysian_movement_control_order) Portals: - COVID-19 - Singapore - Medicine - Viruses\n",
  "language": "en",
  "processed_at": "2026-01-12T09:49:08.648557",
  "title": "2020–21 Singapore circuit breaker measures",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/2020%E2%80%9321_Singapore_circuit_breaker_measures"
}