{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:49:12.672710"
  },
  "content": "Trade restriction The **Malaysian chicken export ban** was announced on 23 May 2022 by Malaysian prime minister [Ismail Sabri Yaakob](/wiki/Ismail_Sabri_Yaakob), restricting the export of 3.6 million chickens a month and to be implemented until a stabilisation of chicken inflation and the domestic supply. [Malaysia](/wiki/Malaysia) exported poultry meat worth US$18.9 million in 2020, making it the 49th largest exporter of the product in the world. The ban was imposed amidst surging chicken prices due to a chicken shortage and rising prices for the domestic market. The ban was partially lifted in June, allowing export of kampung and black chickens to [Singapore](/wiki/Singapore). It was fully lifted on 11 October that year. ## Background This article is part of a series about[Ismail Sabri Yaakob](/wiki/Ismail_Sabri_Yaakob)Personal life - [Muhaini Zainal Abidin](/wiki/Muhaini_Zainal_Abidin) Prime Minister of Malaysia - [Cabinet](/wiki/Ismail_Sabri_cabinet) - [Keluarga Malaysia](/wiki/Keluarga_Malaysia) - [Political crisis](/wiki/2020%E2%80%932022_Malaysian_political_crisis) - [International trips](/wiki/List_of_international_prime_ministerial_trips_made_by_Ismail_Sabri_Yaakob) - [COVID-19 pandemic](/wiki/COVID-19_pandemic_in_Malaysia) - [economic](/wiki/Economic_impact_of_the_COVID-19_pandemic_in_Malaysia) - [politics](/wiki/Impact_of_the_COVID-19_pandemic_on_politics_in_Malaysia) - [social](/wiki/Social_impact_of_the_COVID-19_pandemic_in_Malaysia) - [Movement control order](/wiki/Malaysian_movement_control_order) - [12th Malaysia Plan](/wiki/Twelfth_Malaysia_Plan) - [Floods](/wiki/2021%E2%80%932022_Malaysian_floods) - [Chicken export ban](/wiki/Malaysian_chicken_export_ban) - Gallery - Quotes - v - t - e In 2022, Malaysia encountered a chicken shortage due to increased cost of chicken production, disease infection amongst the chicken population and poor weather conditions. It was exacerbated by the ongoing [Russo–Ukrainian War](/wiki/Russo-Ukrainian_war_(2022%E2%80%93present)), leading to a [global supply chain disruption](/wiki/2021%E2%80%932022_global_supply_chain_crisis) and the [2021–2023 inflation surge](/wiki/2021%E2%80%932022_inflation_surge). Under a [price control](/wiki/Price_control) scheme in force between 5 February and 5 June, the Malaysian government imposed a ceiling price of RM8.90 per kg of chicken. Despite the scheme, local grocers were pricing chicken as high as RM17 per kg as the ceiling price was believed to be economically unsustainable. ### Lifting of ban #### Partial lift After a cabinet decision by the government of Malaysia on 8 June, the export ban was partially lifted to allow kampung and black chickens to be exported to Singapore. On 15 June, it was reported by [*The Straits Times*](/wiki/The_Straits_Times) that exports had resumed for kampung chickens on the same day and would resume for black chickens three days later. #### Ban fully lifted On 9 October, the [Singapore Food Agency](/wiki/Singapore_Food_Agency) announced that Malaysia's Department of Veterinary Services had informed them that the chicken export ban would be lifted on 11 October; the ban was lifted as scheduled. ## Impact and legacy The impact of the poultry export ban was especially felt in neighbouring Singapore, which, at the time of the ban, had been sourcing 34% of its poultry supply from Malaysia as live chickens, to be slaughtered and chilled locally. In addressing the issue, the [Government of Malaysia](/wiki/Government_of_Malaysia) planned to set up cold storage facilities under the [Ministry of Agriculture and Food Industries and agencies](/wiki/Ministry_of_Agriculture_and_Food_Industries_(Malaysia)) and Malaysian officials promised to restore the supply by [Hari Raya Haji](/wiki/Hari_Raya_Haji) of 2022. [Hawkers](/wiki/Hawker_centre) and restaurants in Singapore serving fresh chicken were initially affected, including hawkers selling the country's popular national dish of [Hainanese chicken rice](/wiki/Hainanese_chicken_rice), many using fresh chicken as the main ingredient. As a result, frozen chicken had to be temporarily used by some stores instead. On 18 June 2022, the export ban was partially lifted, allowing exports of *kampung* (village) and [black chicken](/wiki/Ayam_Cemani) to Singapore. Commercial broiler chicken, which made up the bulk of the chicken export to Singapore, remained banned. ### Malaysia #### Government To address the shortage of chicken, the [Ministry of Agriculture and Food Security](/wiki/Ministry_of_Agriculture_and_Food_Security_(Malaysia)) planned to create a buffer stock of chicken and optimise existing cold storage facilities under its Industries and agencies. Subsidy claims process for chicken farmers were also to be simplified. The authorities would also recognise overseas slaughterhouses and abolish permits needed to import chickens to increase the country's chicken supply. As of June 2022, claims of cartels controlling the price and supply of chicken were under Malaysian investigation. #### Farmers The ban was poorly received by chicken farmers and suppliers in Malaysia. They had made most of their profits from selling their chicken to Singapore, due to the strength of the Singapore dollar (SGD) over the Malaysian ringgit (RM/MYR), and were not content with the severe reduction of profits, with some becoming unable to sustain their businesses. They were also afraid that the ban would permanently destroy the Singaporean market for Malaysian chicken by diversifying Singaporean chicken imports. On 30 July 2022, [Democratic Action Party](/wiki/Democratic_Action_Party) (DAP) politician [Ong Kian Ming](/wiki/Ong_Kian_Ming) stated that the ban had done long-term economic damage to Malaysian farmers. ### Singapore The sudden chicken export ban by Malaysia made the Singaporean authorities realise that they have to further diversify their chicken imports and reduce their percentage of chicken supplies from Malaysia. Shortly after the ban was announced, other neighbouring countries such as [Indonesia](/wiki/Indonesia) and [Thailand](/wiki/Thailand) quickly came forward to capitalise on the situation and get their slice of Singapore's chicken import market, attracted by its willing demand backed by the strong Singapore dollar (SGD). By end-June, Singapore significantly increased its chicken supply especially from Indonesia and Thailand along with a few other countries. #### Indonesia–Singapore deals Not long after the ban, Singapore and Indonesia began negotiations over the possibility of Indonesia exporting chickens to Singapore. A deal was agreed when on 30 June 2022, Singapore approved Indonesia as the country's new source of frozen and chilled chicken. On 21 July 2022, a second Indonesian company began supplying chickens to Singapore. On 21 July 2022, Indonesia announced that they will be willing to set up a large chicken farm in [Batam](/wiki/Batam), a city in the [Riau Islands](/wiki/Riau_Islands), specifically for exports to Singapore. These chickens would be fresh as well, as Batam and Singapore are geographically close. It is believed that such a farm could begin operations in 2023. Similarly, Singapore already had a deal with Indonesia for years to import fresh [pork](/wiki/Pork) from a farm located on an island close to Batam, known as [Bulan Island](/wiki/Bulan_Island). On 28 July 2022, another Indonesian firm announced that they will be setting up three farms on the island of [Bintan](/wiki/Bintan) to supply live chicken to Singapore starting from the end of that year.\n",
  "language": "en",
  "processed_at": "2026-01-12T09:49:12.672267",
  "title": "2022 Malaysian chicken export ban",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/2022_Malaysian_chicken_export_ban"
}