{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:49:19.160585"
  },
  "content": "* *259 Ang Mo Kio Avenue 2** is a building on Ang Mo Kio Avenue 2 in [Ang Mo Kio, Singapore](/wiki/Ang_Mo_Kio). It is the only circular block to have been built by the [Housing and Development Board](/wiki/Housing_and_Development_Board). ## History In 1979, the Housing and Development Board announced that it be building seven \"new-look\" blocks over the following years, with the block at 259 Ang Mo Kio Avenue 2 being among them. The 25-storey building was to have 96 units in total, with four circular five-room flats on each floor. The water tank on the building's roof was also designed to be round in shape. A spokesperson from the board stated that the board was \"experimenting with this new design\", and that it had yet to decide if it would continue using it elsewhere. The residential units, which were balloted on 4 September 1981 following its completion in the previous month, were the first \"Model A\" flats to be completed, costing $112,800 each. The building featured aluminium sliding doors and windows, walls made of bricks instead of hollow blocks, internal walls painted with emulsion instead of cement paint and ceramic tiles in both the kitchens and the bathrooms. After a tour of the building in August following its completion, Chen Eng Cheng of the *New Nation* wrote that although the units were two sqm larger than other units of its kind, much of the space was taken up by \"practically unusable acute corners\". Chen also noted that the design was not \"practical\" and that the circular shape of the units, which resulted in a higher construction cost, were \"inflexible\" and a \"plain waste of money.\" A few days later, a spokesperson from the Housing and Development Board announced that the circular design would not be used for blocks elsewhere, and that 259 Ang Mo Kio Avenue 2 was \"meant as a landmark to give the town a distinct identity.\" The block is often known as the \"Clover Block\" it resembles a [clover](/wiki/Clover) when viewed from above. It has been placed on the Ang Mo Kio Heritage Trail by the [National Heritage Board](/wiki/National_Heritage_Board_(Singapore)), as well as [Docomomo Singapore](/wiki/Docomomo_International)'s \"Modernist 100\" list of \"significant modernist buildings in Singapore.\" The building has since been renamed The Clover @ Kebun Baru. 1°22′07″N 103°49′54″E﻿ / ﻿1.36863°N 103.83154°E﻿ / 1.36863; 103.83154\n",
  "language": "en",
  "processed_at": "2026-01-12T09:49:19.160071",
  "title": "259 Ang Mo Kio Avenue 2",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/259_Ang_Mo_Kio_Avenue_2"
}