{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:49:26.983718"
  },
  "content": "* *30 Meyer Road** is a bungalow on [Meyer Road, Singapore](/wiki/Meyer_Road). Designed by colonial architect Eric Vernon Miller, it was purchased by entrepreneur [Jack Sim](/wiki/Jack_Sim), who restored the building. ## History The building may have been completed in the late 1920s. The first owner of the property was Arab merchant Shaikh Omar Abdullah Bamadhaj, a trustee of the management committee of the [Masjid Haji Yusoff](/wiki/Masjid_Haji_Yusoff). In the 1930s, the bungalow housed Parkview, a \"European Kindergarten and Preparatory Boarding School.\" In 1936, the house was sold to Rahma Ezekiel, the widow of Manasseh Isaac Ezekiel, the first optometrist on the island, for $7,000. Her sons Elias and Abraham Ezekiel inherited the property upon her death in 1941, after which it remained in a trust until 1992. The two-storey building features \"square patterned transom windows on its ground level and semi-circular patterned windows on its upper levels.\" The building was worked on by architect Eric Vernon Miller, who made several additions and alterations to the house, including reinforced spiral and circular staircases, as well as a bathroom made with reinforced concrete. In 1992, entrepreneur Jack Sim bought the house for $902,000. By then, it had been 10 months since the property had been put on the market. Sim is an advocate for the preservation of local heritage, owning a conserved shophouse on Serangoon Road, another conserved shophouse on Race Course Road, and the Malaqa House on Heeren Street in [Malacca](/wiki/Malacca). He then acquired the land behind the building for $330,000, allowing him to install a pool, a small pavilion and a waterfall. He named the building \"Fort House\" after [Fort Tanjong Katong](/wiki/Fort_Tanjong_Katong), which once stood nearby. By then, the roof had been \"ravaged by termites\" and the living room floor had \"caved in\" due to flooding in the area. Sim spent $500,000 renovating and restoring the bungalow, which involved rebuilding the house. A new roof was built, the floor was raised by 45 cm, the ceramic tiles on the floor were replaced by granite and the rusted windows of cast iron were replaced with windows made of [chengal wood](/wiki/Neobalanocarpus). However, the main staircase, and the floorboards on the second storey of the building, which were made of [balau wood](/wiki/Shorea_laevis), survive. As of 2021, Sim was using the bungalow to store his art collection. 1°17′53″N 103°53′09″E﻿ / ﻿1.29819°N 103.88577°E﻿ / 1.29819; 103.88577\n",
  "language": "en",
  "processed_at": "2026-01-12T09:49:26.983301",
  "title": "30 Meyer Road",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/30_Meyer_Road"
}