{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:49:29.145568"
  },
  "content": "Building at Chinatown, Singapore **321 New Bridge Road** is a building on [New Bridge Road](/wiki/New_Bridge_Road) in [Chinatown, Singapore](/wiki/Chinatown,_Singapore). It serves as the current premises of the Kong Chow Wui Koon clan, who moved into the building in 1924. It currently houses the Kong Chow Cultural Centre and previously housed the clan's Kong Chow School. ## Description The three-storey semi-detached building has been described by the [National Heritage Board](/wiki/National_Heritage_Board_(Singapore)) website *Roots* as \"modern for its time yet accentuated with traditional and classical ornaments.\" Its \"otherwise plain\" plaster façade features decorative symbols and Chinese characters. A plaque featuring Chinese calligraphy by [Wu Chaoshu](/wiki/Wu_Chaoshu) hangs above the building's main entrance. The calligraphic characters inscribed on the plaque mean \"Kong Chow Weu Koon\". The couplet was completed by Huang Zijing in 1924. The main hall of the building can be found on the ground floor. The second storey features a music hall used by the clan's Cantonese opera and song troupe. A martial arts hall can be found on the third storey, while the fourth features a temple and an open area. ## History The Kong Chow Wui Koon moved into the building from its former premises at Upper Chin Chew Street upon its completion in 1924. The building was designed by local architecture firm Westerhout & Oman, which was founded by architects Johannes Bartholomew Westerhout and William Campbell Oman. The Kong Chow Wui Koon Free School, which provided children in the Chinatown area who were living in poverty with free education, was established in the upper floor of the building in 1929. The number of academic and extracurricular activities held at the school grew from 1930 to 1939. It reopened in 1945 following the [Japanese occupation of Singapore](/wiki/Japanese_occupation_of_Singapore). Additional classes catering to overage students were introduced soon after. As a result of the growing student population, the second floor of the building was also used by the school. In 1949, the school was renamed the Kong Chow School. Classes for Primary Five and Six students were also introduced. In this period, the school, which had eight teaching staff, had around 400 students. The number of students had grown to over 500 by the 1950s, with nine classes in the morning and afternoon sessions. Night classes were also held to cater towards overage students who had missed their education as a result of the Japanese occupation from 1942 to 1945. These classes were conducted in English and Chinese. However, by the 1960s, enrollment began to decline. The school closed down in 1968. In June 1985, the *[Lianhe Wanbao](/wiki/Lianhe_Wanbao)* reported that the building was \"fast becoming a popular tourist attraction.\" The article noted that since late August 1984 over 15,000 tourists. who were \"predominantly Caucasians, Japanese or Koreans\", had visited the building in groups of 20 to 60 while led by tour guides. In 2013, the building underwent a $600,000 renovation which included the installation of a lift, after which Kong Chow Cultural Centre was opened in the building. The museum features 50 story boards depicting the history of the clan, a plaque presented to the clan by [Queen Elizabeth II](/wiki/Queen_Elizabeth_II) in 1953 and a broadsword. The building has been designated a \"point of interest\" on the Chinatown Clans & Associations Trail by the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority). 1°16′51″N 103°50′28″E﻿ / ﻿1.28095°N 103.84106°E﻿ / 1.28095; 103.84106\n",
  "language": "en",
  "processed_at": "2026-01-12T09:49:29.145033",
  "title": "321 New Bridge Road",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/321_New_Bridge_Road"
}