{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:49:32.579010"
  },
  "content": "Historic bungalow in Orchard Road, Singapore **38 Oxley Road** is an eight-bedroom two-storey [bungalow](/wiki/Bungalow#Singapore_and_Malaysia) located near [Orchard Road](/wiki/Orchard_Road), [Singapore](/wiki/Singapore). The house was built in the late 19th century and was the residence of the first [prime minister of Singapore](/wiki/Prime_minister_of_Singapore), [Lee Kuan Yew](/wiki/Lee_Kuan_Yew), from the 1940s until his death in 2015. The first meeting of the [People's Action Party](/wiki/People%27s_Action_Party) (PAP) occurred in the basement. In 2017, it became central to a dispute in Singapore among Lee's children, [Lee Hsien Loong](/wiki/Lee_Hsien_Loong), [Lee Hsien Yang](/wiki/Lee_Hsien_Yang) and [Lee Wei Ling](/wiki/Lee_Wei_Ling), over its use and demolition. Lee Kuan Yew had originally willed the house to Lee Hsien Loong, who later sold it to Lee Hsien Yang in 2015 at market price, on the condition that both of them would donate half of the value to charity. Lee's will included a condition that his daughter Lee Wei Ling be allowed to stay there. She died on 9 October 2024, opening a range of plausible options for the house as set out by the Ministerial Committee in 2018. The options are to (i) retain the property by gazetting it as a National Monument or for conservation; (ii) retain the dining room and demolish the rest of the property; or (iii) allow the property to be demolished fully and allow for the site to be redeveloped. In 2025, the government announced their intentions to gazette it as a [national monument](/wiki/National_monuments_of_Singapore). ## History Built in 1898 and commissioned by Dutch merchant Hermann Cornelius Verloop, the area in which the house was located was named after British doctor [Thomas Oxley](/wiki/Thomas_Oxley_(British_surgeon)), who owned a [nutmeg](/wiki/Nutmeg) plantation on the location in the late 1840s. It was named Castor, and was one of a pair of identical houses. Its twin, Pollux, at 40 Oxley Road, has been demolished. The area was acquired by a Jewish merchant named [Manasseh Meyer](/wiki/Manasseh_Meyer). The house was vacated by its European owners during the [Japanese occupation](/wiki/Japanese_occupation_of_Singapore) and taken over by Japanese civilians. Kuan Yew and his family moved into the residence after the war. In 1950, Lee's wife [Kwa Geok Choo](/wiki/Kwa_Geok_Choo) moved into the house. The meetings of the PAP were regularly held in the basement in 1954. The building continued to serve as the residence of Lee throughout his tenure as prime minister and his first born son, third [prime minister of Singapore](/wiki/Prime_minister_of_Singapore) [Lee Hsien Loong](/wiki/Lee_Hsien_Loong), was raised here. Fortifications and a guardhouse were added to the house in 1965 after Singapore separated from the [Federation of Malaysia](/wiki/Malaysia). Maintenance of the house was understood to be minimal. The Lees had a contractor/housekeeper, Teow Seng Hua, to take care of minor repair works that were required. ## Dispute over the house In an interview in 2011, Lee Kuan Yew expressed that he wanted his house demolished after his death or kept as a closed residence for his family and descendants. This view was also reinforced in his memoirs and writings. His first will was made that year in August 2011, with the estate—including the Oxley House, Cluny House and other assets—divided equally to his three children. In his seventh and final will made in December 2013, Lee Kuan Yew willed the house to his eldest son, Lee Hsien Loong, with a clause asking for its demolition after his daughter who was staying there moved out. The house was subject to a government deliberation of whether to conserve the house for historical reasons in 2011. Lee Kuan Yew had met with the [Cabinet](/wiki/Cabinet_of_Singapore) then and made known his preferred option to demolish the house. However, it was the Cabinet's opinion that the house should be preserved due to its historic significance. In later discussions with the family, Lee Kuan Yew is quoted by his eldest son in a parliamentary debate as agreeing to preserve the building: \"Demolish the private living spaces to preserve the privacy of the family, keep the basement dining room, which [is] of historical significance, strengthen the structure which [is] decaying, and create a new and separate living area, so that the house could be lived in\". Documents released by the [Prime Minister's Office](/wiki/Prime_Minister%27s_Office_(Singapore)), [Ho Ching](/wiki/Ho_Ching), wife of Lee Hsien Loong, emailed the family in early 2012 with detailed plans about how the house would be renovated. Ho said that if there were objections to renting out the house after it was renovated, Hsien Loong's family could move in with Wei Ling. Development application from [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) (URA) was granted in April that year. Lee Kuan Yew had also amended two subsequent versions of his will to remove a previous demolition clause. In September 2012, Lee Kuan Yew was under the impression that the Cabinet had decided on gazetting the house and wrote to his lawyer Kwa Kim Li: \"Although it has been gazetted as a heritage house, it is still mine as owner... Cabinet has opposed tearing it down and rebuilding, because 2 PMs have lived in the house, me and Loong\". His lawyer checked and informed him it was not true that the house has been gazetted. A final will was made in 2013, to reinstate an equal share among his children. The will is a reversion to the first will, with the demolition clause drafted by his daughter-in-law Lee Suet Fern. In documents shown by the siblings, Lee Kuan Yew initialed directly beneath the demolition clause and personally drafted an additional codicil to his will in January 2014, which they claim was witnessed by his secretary and bodyguard. Lee Hsien Yang and Lee Wei Ling were also made the legal executors of the estate of Lee Kuan Yew. After Lee Kuan Yew's death, the will was read in April 2015. Lee Kuan Yew's estate was divided equally among the three siblings, the Oxley house was inherited by his eldest son, with a clause for Lee Wei Ling to stay in it for as long as she desires. Lee Hsien Loong believed the final will was made without full knowledge of the elder Lee, but did not pursue the issue through legal channels. Instead, he raised the issue to Deputy Prime Minister [Teo Chee Hean](/wiki/Teo_Chee_Hean) about doubts on drafting of the last will on 23 April 2015. [Probate](/wiki/Probate) on the will was granted in October 2015 without objections. Lee Hsien Loong then offered to sell the house to Lee Wei Ling for a nominal $1, with the condition that if the government were to acquire the property later, any future sale proceeds would go to charity. She rejected the offer. Subsequently, his brother Lee Hsien Yang took up an alternative offer by Lee Hsien Loong to purchase it at market valuation, conditional on both of them donating 50% each of the value to charity. Lee Hsien Loong sold the house to his brother under those terms and revealed later that he had donated 100% of his own proceeds to charity. However, according to Lee Wei Ling, Lee Hsien Loong was deceitful in his statements. As part of the agreement in 2015, Lee Hsien Loong was said to have endorsed the demolition clause in the final will and promised to recuse himself from all government decisions on the house. The siblings questioned why a ministerial committee was set up in 2016 to discuss the issue, and why Lee Hsien Loong made the [statutory declaration](/wiki/Statutory_declaration) with the intent to influence the committee decision. [Lucien Wong](/wiki/Lucien_Wong), Hsien Loong's private attorney, represented him in the affairs as Hsien Loong and his siblings stopped talking to each other directly. On 14 June 2017, Lee Hsien Loong's siblings made a public statement on Facebook, alleging that he had abused his office as prime minister to prevent the demolition and that he wished to move into the house to inherit the political capital of his father. They also alleged that various organs of state such as the [National Heritage Board](/wiki/National_Heritage_Board_(Singapore)) (NHB), [Ministry of Culture, Community and Youth](/wiki/Ministry_of_Culture,_Community_and_Youth) (MCCY), [Prime Minister's Office](/wiki/Prime_Minister%27s_Office_(Singapore)) (PMO) and the ministerial committee have been involved in the private dispute. They further claimed that he had used state authorities to harass them and that they intended to flee the country. These claims were denied by Lee Hsien Loong who expressed disappointment at his family for publicising what he called a \"family matter\". The Public Service Division under the Prime Minister's Office in charge of [civil service](/wiki/Civil_Service_(Singapore)) confirmed on 27 June that it conducted polls with its officers to assess their views on the dispute, saying that the allegations \"go beyond private matters and extend to the conduct and integrity of the Government and our public institutions\". A special two-day parliamentary session was called by Lee Hsien Loong to explain his involvement in the saga, and ministers defended their positions in the feud. While past politicians have always used litigation to counter any allegations of nepotism, Lee Hsien Loong claimed that he did not want to sue his siblings, leading some to question if the \"government is arbitrary when it comes to dealing with serious criticism\". The younger siblings offered a truce, saying they would stop posting attacks on social media and work to resolve the matter privately with their eldest brother. In a response to [CNBC](/wiki/CNBC) in October 2017, Lee Hsien Loong remarked that he is not sure that the family feud has been resolved, and that he had not communicated with his siblings. On 2 April 2018, Deputy Prime Minister Teo Chee Hean, chairman of the four-member ministerial committee, said that the panel did not make any recommendations as no decision is required at this point, since Lee Wei Ling is still living in the house. He added that the decision will be made by the future government. The panel offered three options—to gazette and preserve 38 Oxley Road as a national monument, to demolish all but the dining room (which was a meeting area for the founding members of the People's Action Party) and convert the dining area to a viewing gallery or integrate it to a research or heritage centre, or to demolish and redevelop 38 Oxley Road completely for residential or state uses. After the death of [Lee Wei Ling](/wiki/Lee_Wei_Ling) on 8 October 2024, the issue reopened with [Lee Hsien Yang](/wiki/Lee_Hsien_Yang) announcing that he intends to have the house demolished, following the will of their father, and have a new private dwelling built. An application to demolish the house was made on 21 October, however the [National Heritage Board](/wiki/National_Heritage_Board_(Singapore)) indicated on 24 October 2024 that they are assessing if the property should be gazetted and preserved as a national monument, thus suspending the demolishment application. ## Reactions [Deputy Prime Minister](/wiki/Deputy_Prime_Minister_of_Singapore) [Heng Swee Keat](/wiki/Heng_Swee_Keat) claimed that the debate in Parliament is an example of the government being transparent. [Tan Cheng Bock](/wiki/Tan_Cheng_Bock) called out Heng's understanding of transparency as \"deeply flawed\", noting during his [Progress Singapore Party](/wiki/Progress_Singapore_Party)'s launch that the Oxley Road saga was not properly addressed, as not all sides privy to the issue, especially Lee Hsien Yang, were present in Parliament to give their side of the story. In 2019, Lee Hsien Loong sent a defamation letter to [The Online Citizen](/wiki/The_Online_Citizen)'s editor, Terry Xu on an article which repeated claims that he had tried to preserve the house contrary to his father's wishes, which was proven false. It escalated to a libel lawsuit in which Xu was found guilty liable for S$210,000 in damages, which Lee donated to charity. ## National monument In November 2025, the government announced their intentions to gazette the house as a national monument and convert it into a heritage park. This decision was disapproved by Lee Hsien Yang, the owner of the house, arguing that such a decision \"tramples\" on Lee Kuan Yew's wish to have the house demolished. On 12 December 2025, the [Ministry of Culture, Community and Youth](/wiki/Ministry_of_Culture,_Community_and_Youth) gazetted 38 Oxley Road as a national monument. It remains undetermined as to which parts of the house would be demolished or retained since its elevation into a national monument. Any sort of demolition will make it the second national monument after the [Cathay Building](/wiki/Cathay_Building) to have parts of its structure demolished. - [Zhonghandi](/wiki/Zhonghandi) ([Chinese](/wiki/Chinese_language): 中翰第, the ancestral residence of Lee Kuan Yew in [Dabu](/wiki/Dabu_County), [Meizhou](/wiki/Meizhou), [China](/wiki/China)) ̼ Media related to 38 Oxley Road at Wikimedia Commons 1°17′53″N 103°50′27″E﻿ / ﻿1.297919°N 103.840781°E﻿ / 1.297919; 103.840781\n",
  "language": "en",
  "processed_at": "2026-01-12T09:49:32.578523",
  "title": "38 Oxley Road",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/38_Oxley_Road"
}