{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:49:38.699579"
  },
  "content": "Lottery in Singapore and MalaysiaThis article **relies largely or entirely on a single source**. Relevant discussion may be found on the talk page. Please help improve this article by introducing citations to additional sources. *Find sources:* \"4-Digits\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(December 2025)* **4-Digits** (abbreviation: **4-D**) is a [lottery](/wiki/Lottery) in , [Singapore](/wiki/Singapore), and Malaysia. Individuals play by choosing any number from 0000 to 9999. Then, twenty-three winning numbers are drawn each time. If one of the numbers matches the one that the player has bought, a prize is won. A draw is conducted to select these winning numbers. 4-Digits is a fixed-odds game. [Magnum 4D](/wiki/Magnum_Corporation) is the first legalised 4D Operator licensed by the [Malaysian Government](/wiki/Malaysian_Government) to operate 4D. Soon thereafter, other lottery operators followed suit, as this is a very popular game in Singapore and Malaysia. The recently launched Daily Derby 4D Blue and Green and 5D jackpots of WTL-M is also growing popular now. [Singapore Pools](/wiki/Singapore_Pools) is the sole provider of gambling games in Singapore. 4-D and lottery 6/49 are two of the most popular. A similar 4-door game with its prize structure fully revealed can be found in Taiwan and Cambodia. 4-Digits is somewhat similar to \"Pick 4\" in the United States, Canada 5-Digits \"[Pick 5](/wiki/Pick_5)\", and Jackpot in Germany and Malaysia. ## 4D The 4-D game is believed to have originated in [Kedah](/wiki/Kedah) in 1951, based on evidence during a gambling [trial](/wiki/Trial_(law)) in a [Singapore court](/wiki/Singapore_court) in 1956. [*citation needed*] A schoolboy decided to [raffle](/wiki/Raffle) his bicycle for 100 $1 tickets, each bearing two digits. The winner would be the one whose ticket number matched the last two digits of the first prize ticket in a Malaysian Turf Club [sweepstake](/wiki/Sweepstake). This led to the 2-D lottery, which in turn gave rise to 3-D and later, 4-D, betting games which were wildly popular in Singapore and Malaysia from the 1950s. [*citation needed*] The [Singapore Turf Club](/wiki/Singapore_Turf_Club) was the first to introduce the 4-D draw in Singapore in May 1966, offering a [S$](/wiki/S$)2,000 first prize for a $1 ticket. It stopped offering it in May 2004 when its sister company Singapore Pools took over all the draws. Singapore Pools launched computerised betting for 4-D on 31 May 1986, and it got off to an auspicious start when the winning number for the first prize in the inaugural draw turned out to be 8838. The number \"8\" sounds like *fā* (Chinese: 发) or \"prosper\" in [Mandarin](/wiki/Mandarin_Chinese) and is traditionally a favourite among punters. Punters welcomed the new 4-D product and the company's [turnover](/wiki/Revenue) that year increased 215%, to over [S$](/wiki/Singapore_dollar)283 million. ## Methods of play Ordinary entry refers to a specific number. Example: 1234. 4-D Roll substitutes any one of the four digits with 'R'. (i.e. R123, 1R23, 12R3 and 123R) where 'R' denotes all digits from 0 to 9. Only one digit can be substituted with 'R'. For example, if you mark R234, you are actually buying 10 Ordinary Entries (i.e. 0234, 1234, 2234, 3234... 9234). System entry is a bet on all the possible permutations of a 4-D number, for example the number 1234 has 24 permutations (1234, 2341, 3412, 4123...). iBet is a System Entry bet priced from $1, regardless of the number of permutations. Quick pick is bet on a random number selected by a computer. ## Variances ### Singapore In Singapore, 4-D draws are conducted every Wednesday, Saturday and Sunday at 1830h (SG/HK Time) at Singapore Pools' main branch at 210 [Middle Road](/wiki/Middle_Road,_Singapore). Anyone above the age of 18 can attend the draws. An independent external [auditor](/wiki/Auditor) and five draw officials are involved in the draw process. Before the draw, a specially designed computer is run to [randomly](/wiki/Random) select the draw machine and the set of draw balls to be used. A [backup](/wiki/Backup) machine is also chosen. The selected draw balls, numbered 0 to 9, are [weighed](/wiki/Weigh) to ensure that their individual weights are within an acceptable margin of error. This is to ensure that each ball has practically the same chance of being drawn. The selected machines, secured under lock and numbered [seal](/wiki/Seal_(emblem)) in a storage room, is transferred to the draw hall, along with the balls. The balls are loaded into the draw machine in front of the [audience](/wiki/Audience). A member of the audience is then invited to press the start switch on the control panel, launching the draw. The balls in the draw machine, made up of four transparent cylinders, spin until a ball is sucked into a groove found in each cylinder. The drawing process, starting from the consolation prizes, is repeated until all 23 sets of winning numbers are drawn. ### Malaysia In Malaysia, there are four main 4D providers – [Sports Toto](/wiki/Sports_Toto), [Magnum 4D](/wiki/Magnum_Corporation), Derby Blue and Derby Green and Dà Mǎ Cǎi. Dà Mǎ Cǎi is run by Pan Malaysian Pools Sdn. Bhd. All 4 are independent private companies accredited and approved by Government of Malaysia. These 4D operators are known as Number Forecast Operators. Malaysia 4D draws daily and some on every Wednesday, Saturday and Sunday, which coincide with Singapore's 4D draw. However, sometimes, there will be a special draw on Tuesday. Magnum 4D offers the classic 4D game – the player picks a 4 digit number and chooses the amount he wants to bet. There are \"Big\" and \"Small\" Forecasts. A \"Small\" bet will warrant higher winnings, but the player will only win if his number comes up in the first, second or third places. The winnings are lower for a \"Big\" bet, but in addition to the first, second and third places, there are 10 \"Special\" numbers which pay RM180 for a RM1 bet, and 10 \"consolation\" numbers which pay RM60 for a RM1 bet. Magnum is the first legalised 4D operator to be awarded the licence by the Malaysian Government. In September 2009, Magnum introduced a new game which is an extension of the popular 4D game but with a parimutuel element; this game was copyrighted by Magnum. This game is more popular than the other Lotto games in Malaysia, and This year best number for 1st prize is 8734. Dà Mǎ Cǎi (大马彩; literally \"Pan-Malaysia Lottery\" in [Mandarin](/wiki/Mandarin_Chinese)) has a 3D game as well as 4D (which they call 1+3D). Unlike the 1+3D, the 3D only has first, second, and third places. Prizes are significantly lower than 1+3D, the top prize being RM660 for Big First place. Their 1+3D follows the same structure as the Magnum 4D. Dà Mǎ Cǎi also have 3D and 1+3D Jackpot Games. The latest product introduced from Dà Mǎ Cǎi is Dà Mǎ Cǎi Jackpot in January 2014 with a minimum payout of 1.8 million for Jackpot 1. In December 2016 Dà Mǎ Cǎi provide mobile betting channel \"dmcGO\" apps (IOS and Android) Sports Toto, in addition to the basic 4D played the same way as Magnum and Dà Mǎ Cǎi, runs 5D and 6D games as well. Unlike 4D, 5D and 6D do not have \"Big\" and \"Small\" Forecasts. First prize for 6D is RM100,000 and first prize for 5D is RM15,000. If the last 4, 3, or 2 digits of your 5D number (or the last 5, 4, 3, or 2 digits of your 6D number) match the first prize number, you still get a prize. Sports Toto also offers three lottery games, similar to those seen in Western countries. These are Star Toto 6/50, Power Toto 6/55 & Supreme Toto 6/58. The last number indicates the highest number – Star Toto 6/50 requires the player to pick 6 numbers from 1 to 50. The Supreme Toto 6/58 has the highest prizes (first prize is a minimum of more than RM8.8 million) but the probability of winning is lower than the others games as there are more numbers. WTL-M Daily Derby 4D and 5D Jackpots is almost the same as the above three. It runs 4D and 5D games. 4D's are daily and monthly two 5D's. The prize structure is like One first prize, One second prize, One third prize, Ten Special and Ten consolation prizes. - Mak Mun San (8 July 2007). \"4-D a winner? You bet\". *[The Straits Times](/wiki/The_Straits_Times)*. p. 48.\n",
  "language": "en",
  "processed_at": "2026-01-12T09:49:38.699004",
  "title": "4-Digits",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/4-Digits"
}