{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:49:41.511368"
  },
  "content": "* *42 Waterloo Street** is a historic bungalow on [Waterloo Street](/wiki/Waterloo_Street) in [downtown Singapore](/wiki/Central_Area,_Singapore), which currently houses Centre 42. ## Description The two-storey building is symmetrical and features high ceilings, tall windows and a red pitched tile roof, and it is surrounded by a garden compound. It initially featured plastic mouldings, which were removed in renovations. Its windows and doors have been painted green while the building itself has been painted blue with white fringes. ## History The bungalow was built sometime before 1893. It served as the residence to the De Souza family until 1917, after which it was leased out to the Cornelius family. In 1969, the building was converted from a residential to a commercial building. Dharmapala P Company, a metal engraving company, occupied the bungalow in the 1970s. It was restored sometime after this. Prior to 1988, when the building was earmarked for redevelopment, there were around 50 tenants living in it. In 1999, the building underwent a $1.3 million renovation under the [National Arts Council](/wiki/National_Arts_Council,_Singapore) Arts Housing Scheme, after which theatre organisation Action Theatre moved into the bungalow. The newly-renovated building featured indoor studios, two outdoor performance spaces and two rehearsal rooms. It also featured a cafe. The main theatre was on the bungalow's second floor. The building was officially reopened on 12 November, with diplomat and professor [Tommy Koh](/wiki/Tommy_Koh) being the guest of honour at the opening ceremony. Action Theatre moved to the Aliwal Arts Centre in 2012, after which the National Arts Council converted the building into Centre 42, which aimed to \"nurture both established and emerging playwrights as well as develop new works.\" It was to be the first local institution dedicated to playwriting. The building was then painted blue. The building is one of several on Waterloo Street to have been renovated under the scheme, along with the [Stamford Arts Centre](/wiki/Stamford_Arts_Centre), the [Singapore Calligraphy Centre](/wiki/Singapore_Calligraphy_Centre), which houses the Chinese Calligraphy Society of Singapore, [54-58 Waterloo Street](/wiki/54-58_Waterloo_Street), which currently houses The Theatre Practice, and [60 Waterloo Street](/wiki/60_Waterloo_Street), which currently houses Dance Ensemble Singapore. 1°17′54″N 103°51′03″E﻿ / ﻿1.29843°N 103.85083°E﻿ / 1.29843; 103.85083\n",
  "language": "en",
  "processed_at": "2026-01-12T09:49:41.510809",
  "title": "42 Waterloo Street",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/42_Waterloo_Street"
}