{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:49:45.611439"
  },
  "content": "* *54-58 Waterloo Street** is a row of three consecutive and adjoining terrace houses on [Waterloo Street](/wiki/Waterloo_Street) in [downtown Singapore](/wiki/Central_Area,_Singapore), which currently houses The Theatre Practice. ## Description The buildings are classified as [Vernacular](/wiki/Vernacular_architecture) [Classical](/wiki/Classical_architecture) Urban Row Houses. All three have tall ceilings and windows, as well as openings and [pilasters](/wiki/Pilasters) featuring classic mouldings. ## History All three houses were built in the early 1900s. In the 1910s, 56 Waterloo Street was owned by Mohammed Cassim Mansor. Lim Sin Tat and his family lived at 58 Waterloo Street until the 1930s, while Philip Julian Low Gek Seng lived at 54 Waterloo Street from the 1920s to the later 1940s. Aik Hua Hang Finance Limited moved into 56 Waterloo Street in 1961. In 1965, the Watch Traders and Makers' Association moved into 56 Waterloo Street. The building underwent heavy renovations, which were completed in late 1965. Then-[Minister of Finance](/wiki/Ministry_of_Finance_(Singapore)) [Lim Kim San](/wiki/Lim_Kim_San) officially opened the building on 14 November. In the mid-1990s, the buildings were renovated and joined together by the [National Arts Council](/wiki/National_Arts_Council,_Singapore) as part of its Arts Housing Scheme. After the completion of renovations in 1997, it reopened as the Young Musicians' Society Arts Centre and Auditorium. It also had offices, a music library and a choral studio. The centre housed the [SYC Ensemble Singers](/wiki/SYC_Ensemble_Singers) choir. In 2016, The Theatre Practice, an arts organisation, moved into the building. 58 Waterloo Street also houses the Practice Tuckshop. The building is one of several on Waterloo Street to have been renovated under the Arts Housing Scheme, along with the [Stamford Arts Centre](/wiki/Stamford_Arts_Centre), [42 Waterloo Street](/wiki/42_Waterloo_Street), the [Singapore Calligraphy Centre](/wiki/Singapore_Calligraphy_Centre), which currently houses the Chinese Calligraphy Society Of Singapore, and [60 Waterloo Street](/wiki/60_Waterloo_Street), which currently houses Dance Ensemble Singapore. The houses caught on fire after midnight on 24 July 2023, costing The Theatre Practice over $200,000 in damages. 1°17′55″N 103°51′04″E﻿ / ﻿1.29861°N 103.85106°E﻿ / 1.29861; 103.85106\n",
  "language": "en",
  "processed_at": "2026-01-12T09:49:45.611005",
  "title": "54-58 Waterloo Street",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/54-58_Waterloo_Street"
}