{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:49:51.912967"
  },
  "content": "* *60 Waterloo Street** is a historic bungalow on [Waterloo Street](/wiki/Waterloo_Street) in [downtown Singapore](/wiki/Central_Area,_Singapore). A second four-storey building was constructed behind the bungalow when the Dance Ensemble Singapore moved into the bungalow in 1995. ## Description The two-storey building is symmetrical and features high ceilings, tall windows and a red pitched tile roof, and it is surrounded by a garden compound with a wrought iron gate. Arched doorways can be found on the ground floor while the French windows on the upper floor are covered with timbre louvred shutters. ## History The home served as the residence of A. S. Desker, a prominent member of the [Eurasian community of Singapore](/wiki/Eurasian_Singaporeans), and his wife, Mary Caroline Elisabeth. In 1919, the company owned by prominent businessman [Tan Kah Kee](/wiki/Tan_Kah_Kee) listed the building for rent. In 1923, the Massage Hall, which was owned by a Mrs Haru and a Miss Hana and was previously on [Bencoolen Street](/wiki/Bencoolen_Street), moved into the building. The business continued to operate until September 1941. After [World War II](/wiki/World_War_II), the building was purchased by the [Jewish Welfare Board](/wiki/Jewish_Welfare_Board_(Singapore)), after which it was converted into the old folks' home. The [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) took over ownership of the vacant building in 1983. In 1986, three businessmen rented the building from the authority and converted it into the Waterloo Food Paradise, an eating house 8 hawker stalls. The Tai Chuan Eating House occupied the building around 1990. From 1995 to 1996, the building underwent a $1.28 million renovation and restoration under the [National Arts Council](/wiki/National_Arts_Council,_Singapore) Arts Housing Scheme, after which theatre organisation Dance Ensemble Singapore moved into the bungalow, which then included five dance studios. It was officially reopened by Loh Meng See, then a [Member of Parliament](/wiki/Parliament_of_Singapore) representing the [Kampong Glam Group Representation Constituency](/wiki/Kampong_Glam_Group_Representation_Constituency), on 25 May 1996. A four-storey annex building, featuring eight dance studios, a music room, a conference room, two instructors' rooms and a costume room, was constructed behind the bungalow. The building is one of several on Waterloo Street to have been renovated under the scheme, along with the [Stamford Arts Centre](/wiki/Stamford_Arts_Centre), [42 Waterloo Street](/wiki/42_Waterloo_Street), the [Singapore Calligraphy Centre](/wiki/Singapore_Calligraphy_Centre), which houses the Chinese Calligraphy Society of Singapore, and [54-58 Waterloo Street](/wiki/54-58_Waterloo_Street), which currently houses The Theatre Practice. 1°17′56″N 103°51′04″E﻿ / ﻿1.29881°N 103.85116°E﻿ / 1.29881; 103.85116\n",
  "language": "en",
  "processed_at": "2026-01-12T09:49:51.912507",
  "title": "60 Waterloo Street",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/60_Waterloo_Street"
}