{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:49:54.078793"
  },
  "content": "1°17′48.2″N 103°53′21.1″E﻿ / ﻿1.296722°N 103.889194°E﻿ / 1.296722; 103.889194 **61 Meyer Road** was a bungalow on [Meyer Road, Singapore](/wiki/Meyer_Road). It was built by Sir [Manasseh Meyer](/wiki/Manasseh_Meyer), who died shortly after its completion. It then served as the residence of businessman Parkcane C. Hwang. ## History The bungalow was built by businessman and philanthropist Sir Manasseh Meyer, who built several other buildings on the road. However, he died in 1930, shortly after it was completed. His widow, Rebecca, then rented the house to the local branch of the [Bank of China](/wiki/Bank_of_China), after which the building became the private residence of Parkcane C. Hwang, the branch's founder. During [Subhas Chandra Bose](/wiki/Subhas_Chandra_Bose)'s trip to [Japanese-occupied Singapore](/wiki/Japanese_Occupation_of_Singapore), which lasted from July to August 1943, he stayed at the bungalow. According to historian [Nilanjana Sengupta](/wiki/Nilanjana_Sengupta) the rooms and balconies of the house \"were witness to much of the INA's wartime strategizing.\" He allegedly wrote the [Proclamation for the Provisional Government](/wiki/Azad_Hind) on 19 October 1943. Toward the end of the war, the cabinet of the [Indian Independence League](/wiki/Indian_Independence_League) gathered at the house to discuss plans for their surrender. [John Thivy](/wiki/John_Thivy) of the INA recommended that the bungalow house the Indian embassy. It was later demolished and replaced by a condominium. Amongst his supporters, the bungalow \"became a veritable shrine, despite — or because of — his fervent stand against the Empire.\" In February 1948, a civil suit was filed by Yeap Lian Seng and three others for the possession of the property, then occupied by Air Marshal Sir [Hugh Pughe Lloyd](/wiki/Hugh_Pughe_Lloyd). The plaintiffs alleged that they had acquired the house from the Meyer's estate in September of the previous year for $400,000 when it was occupied by Air Marshal Sir [George Clark Pirie](/wiki/George_Pirie_(RAF_officer)). They then wrote to Pirie, claiming that they would be \"glad\" if he continued to reside at the bungalow. However, when Lloyd replaced Pirie as its resident, the plaintiffs wrote to him, telling him that he did not have their consent to stay at the house and asking him to vacate the property. In response, Lloyd claimed that he was occupying the estate as a contractual tenant and not as a statutory tenant. Judge W. J. Thorogood decided in the plaintiffs' favour, giving Lloyd until 1 March to vacate the premises and ordering him to pay $900, the rent for December to February. Lloyd appealed the ruling and a stay of execution pending appeal was granted. The appeal failed, with the Full Court of Appeal holding that Pirie had been a statutory tenant and not a contractual tent. The building later became the residence of Yeap Teik Leong, the chairman of the [Ban Hin Lee Bank](/wiki/CIMB) in [Penang](/wiki/Penang) and the developer of The Adelphi. In April 1989, the bungalow was acquired by the [Hong Leong Group](/wiki/Hong_Leong_Group). It was later demolished and replaced by a condominium.\n",
  "language": "en",
  "processed_at": "2026-01-12T09:49:54.078225",
  "title": "61 Meyer Road",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/61_Meyer_Road"
}