{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:49:58.009801"
  },
  "content": "* *72-13**, formerly the **Bank of China No. 3 Warehouse**, is a former [Bank of China](/wiki/Bank_of_China) warehouse at the corner of Mohamed Sultan Road and Caseen Street within the [Singapore River Planning Area](/wiki/Singapore_River). It currently houses The Curators Academy and [Theatreworks](/wiki/TheatreWorks_(Singapore)). ## Description The two-storey building features rached entrances on the ground floor while the upper floor features timber windows with \"rare remaining example of cross-work timber lattice panels\", which was once a common feature among local buildings. The windows also feature iron bars, once a common feature among local warehouses, which were installed for security. The corner façade of the building features a \"roof pediment with decorative moulded plaster festoons.\" The interior of the building also features a large timber staircase accompanied with a goods slide. ## History The building, which was a rice warehouse owned by the [Bank of China](/wiki/Bank_of_China), was previously known as the Bank Of China No. 3 Warehouse. It was one of several godowns to have been built along the [Singapore River](/wiki/Singapore_River) by the first half of the 20th century. It was gazetted for conservation by the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) on 6 June 2014. In January 2004, it was announced that arts organisation [Theatreworks](/wiki/TheatreWorks_(Singapore)) would be moving into the building following renovation works. The warehouse was to be \"turned into two hip white cubes, buzzing with anything from performances and writers' weekends to workshops bringing together new media artists and technopreneurs.\" On 15 September 2005, arts organisation [Theatreworks](/wiki/TheatreWorks_(Singapore)) moved into the building at a cost of $2.9 million, of which $2.8 million was provided by the [National Arts Council](/wiki/National_Arts_Council,_Singapore). The warehouse featured a \"white box\" space with a capacity of 200 people. It was also to be used to hold exhibitions. Parvathi Nayar of *[The Business Times](/wiki/The_Business_Times_(Singapore))* described the newly-renovated building as \"theatrical, like a creative stage set for a play about construction, strewn with wires and planks, complete with soundtrack of banging and buzzing.\" 1°17′28″N 103°50′25″E﻿ / ﻿1.2912°N 103.8402°E﻿ / 1.2912; 103.8402\n",
  "language": "en",
  "processed_at": "2026-01-12T09:49:58.009300",
  "title": "72-13",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/72-13"
}