{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:50:00.187755"
  },
  "content": "Bungalow in Singapore **733 Mountbatten Road** is a bungalow on Mountbatten Road in [Mountbatten](/wiki/Mountbatten,_Singapore), Singapore. Built in 1929 by stock exchange broker Wong Leng Swee, the Anglo-Malay bungalow is an \"early-style\" bungalow. The house was the residence of the Wong family until the early 1990s. Following the URA's announcement to conserve 15 bungalows on Mountbatten Road in 1991, the house was conserved in 1993. It was purchased by businessman Ang Koon San to be his family's home in 1999, and was restored by his son, Ang Gin Wah, which took four years. ## Description The single-storey bungalow is designed in the Anglo-Malay style. It features the standard Malay house plan, with a verandah in the front, known as a serambi, a main core section, known as a rumah ibu and a kitchen in the back. The bungalow is elevated above the ground with several support piers, which protect the house against flooding. The [porte-cochère](/wiki/Porte-coch%C3%A8re) features columns of the [Corinthian order](/wiki/Corinthian_order). The bungalow also features a pediment displaying the Chinese characters \"我園\", which is the name of the bungalow in Chinese. ## History In 1927, stock exchange broker Wong Leng Swee brought a plot of land, and built the bungalow in 1929. An extension to the building was completed in 1957 while the current staircase leading up to the entrance was constructed in the 1960s. 733 Mountbatten Road was the home of the Wongs for 70 years until it was left vacant in the early 1990s. In September 1991, the building, along with 15 other properties in Mountbatten Road, was planned to be gazetted for conservation by the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) (URA). Some residents, including the former owners of 733 Mountbatten Road, opposed the URA's plan, which delayed the conservation until August 1993. In 1999, the bungalow was sold to businessman Ang Koon San, where he envisioned it to be a \"multi-generational home for his four children and their families\" consisting of a common family wing and three separate wings. By then, the bungalow was beginning to sink and covered in overgrown lalang, with its staircase railings crumbling and [asbestos](/wiki/Asbestos) on the ceiling. As the house was gazetted for conservation, Ang would have to retain the bungalow's original structure and architectural elements during restoration. In a later interview with *[The Straits Times](/wiki/The_Straits_Times)*, Ang said that he would have not purchased the property if his son, Ang Gin Wah, was not an architect, adding \"it would have been cheaper and faster to tear the house down than to conserve it\". According to Ang Gin Wah, he tried to get construction companies to carry out the works, but many refused, so he had to train four workers to restore the house. The restoration, which lasted for four years and costed [S$](/wiki/Singapore_dollar)800,000 (2004) ([US$](/wiki/USD)473,308.83), involved the replacing of damaged roof tiles, the revarnishing of the timber floors of the interior, and the restoration of the timber partitions. All of the original timber windows, each of which had around 40 parts, louvre parts and doors were disassembled piece by piece stripped of old paint, sanded down and reassembled. Glass from Australia was used to replace broken panels. Damaged fragments of the decorative plastic elements of the capitals of the columns were recreated and recast. A two storey extension was also built. In 2004, the bungalow's restoration received the Architectural Heritage Awards by the URA. In 2008, the restoration efforts received the Jury Commendation for Innovation at the [UNESCO Asia-Pacific Heritage Award](/wiki/UNESCO_Asia_Pacific_Heritage_Awards) for Culture Heritage Conservation. According to the jury, the renovations works resulted in a \"balance between the old and new\". 1°18′04″N 103°53′19″E﻿ / ﻿1.30102°N 103.88855°E﻿ / 1.30102; 103.88855 - Google Arts and Culture webpage\n",
  "language": "en",
  "processed_at": "2026-01-12T09:50:00.187279",
  "title": "733 Mountbatten Road",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/733_Mountbatten_Road"
}