{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:50:07.052617"
  },
  "content": "Radio station in Singapore **883Jia** is a Singaporean Chinese-language (and only bilingual) [internet radio](/wiki/Internet_radio) station owned by [So Drama! Entertainment](/wiki/So_Drama!_Entertainment). Formerly broadcast on 88.3 megacycles, it played Mandarin and English music from the 1980s up to the 2020s on the airwaves. The station also provides Cantonese, Japanese and Korean music offerings over their web platform. ## History Plans for launching the then-unnamed Mandarin radio station were announced at the official launch of [Power 98](/wiki/Power_98_(radio_station)) in October 1994, aiming at the Mandarin-speaking majority of the servicemen. Also known as Dongli 88.3, the radio station complemented its English radio station Power 98. At launch it played contemporary music from the 1980s with some backtracking to the mid-to-late 1980s. Like Power 98, it targeted listeners aged 18 to 35 who are national servicemen. Test transmissions of the 88.3 frequency leading to its launch date were made between 8:00 a.m. and 9:00 p.m. 883Jia was then relaunched in 2007 as Singapore's only bilingual station, playing both Mandarin and English songs. Effective 30 October 2025 at 11:59 p.m., 88.3 Jia and its sister station [Power 98](/wiki/Power_98_(radio_station)) ceased transmission on FM as both stations moved to the newly rebranded 'Kakee' app. Their [broadcasting license and franchise to own and operate radio stations](/wiki/Broadcast_law) was cancelled and surrendered to, and their former frequencies were recalled by [IMDA](/wiki/Infocomm_Media_Development_Authority). - [MOR Philippines](/wiki/MOR_Entertainment) [stations](/wiki/List_of_ABS-CBN_Corporation_channels_and_stations#My_Only_Radio_(defunct)) - [DWRR-FM](/wiki/DWRR-FM) - [List of radio stations in Singapore](/wiki/List_of_radio_stations_in_Singapore) - Official website This article about a radio station in Asia is a stub. You can help Wikipedia by expanding it. - v - t - e This article about media in Singapore is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T09:50:07.052144",
  "title": "883Jia",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/883Jia"
}