{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:50:12.424555"
  },
  "content": "Singaporean singer (born 1973) **Du Chengyi**,[a] known professionally as **A-Do** (阿杜; [Pe̍h-ōe-jī](/wiki/Pe%CC%8Dh-%C5%8De-j%C4%AB): *A-tō͘*), is a Singaporean singer. ## Career Du was a [construction foreman](/wiki/Construction_foreman) before being spotted by Singaporean producer Billy Koh in his company's talent search and was signed to [Ocean Butterflies](/wiki/Ocean_Butterflies) Music. He released his debut album in 2002. In 2012, Du left showbiz due to [panic disorder](/wiki/Panic_disorder).** Du originally planned to release an album in 2015, but the album was delayed due to his mother's illness. In 2018, Du returned to showbiz with a new album, *I Will Not Hide.* In 2022, Du joined Singapore media company 8028 Holdings. ## Personal life Du married Lai Weili (賴瑋莉; [Pe̍h-ōe-jī](/wiki/Pe%CC%8Dh-%C5%8De-j%C4%AB): *Lōa Úi-lī*) in January 2016. They dated before Du became a singer for 7 years. They re-established their relationship when Du was diagnosed with panic disorder. They had a child in May 2016. When Du returned to the media in 2018, he was criticized by fans for gaining weight.** Du, in interviews, clarified that his weight gain was caused by his medications for treating panic disorder.** His nephew, [Kenny Khoo](/wiki/Kenny_Khoo), has also been a singer since 2014. ## Discography ### Studio albums Date of releaseTitleRef30 May 2002*Night Fall*4 December 2002*Persevering*23 December 2003*Hello*21 December 2005*I...Do*8 January 2008*Do The Best*26 February 2010*Fear No More*25 May 2012*Ninth Time in Love*10 November 2018*I Will Not Hide* ### Singles YearTitleNotes2017\"Thousand Years Promise 一諾千年\"2017\"Too Good Man 爛好人\"2021For The Sake Of Love ## Awards and nominations YearAwardCategoryResult2002Singapore Hit AwardsBest New Act (Gold)Won2003Singapore Hit AwardsBest Local ArtisteWon ## Notes This article about a Singaporean musician is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T09:50:12.424124",
  "title": "A-do",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/A-do"
}