{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:50:28.181685"
  },
  "content": "Chocolate manufacturing companyThis article **relies excessively on references to primary sources**. Please improve this article by adding secondary or tertiary sources. *Find sources:* \"Aalst Chocolate\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(August 2015)* *(Learn how and when to remove this message)* **Aalst Chocolate** is a manufacturer of industrial [chocolates](/wiki/Chocolate) and compounds, gourmet chocolates and related products. It was established in 2003 in [Singapore](/wiki/Singapore), by Richard Lee and Connie Kwan, who are currently Chief Executive Officer and Chief Operating Officer respectively. They are the first chocolate factory to be fully owned and managed by Singaporeans. The company has an export network of over 45 countries globally, including countries such as the United States, India, China and the Middle East. Its customers include multinational and national branded [confectionery](/wiki/Confectionery), biscuits (cookies) and ice cream manufacturers and artisanal users of chocolate (chocolatiers, pastry chefs, bakeries and caterers). ## Company and operations The Aalst Chocolate factory is located in Singapore. The company distributes its products under brands such as: Aalst Chocolate, Cacao Ivory, Pâtissier, Aalst Home and Louella. Aalst Chocolate uses a [trigeneration](/wiki/Cogeneration) system in its chocolate production, which reduces [greenhouse gas](/wiki/Greenhouse_gas) emission by a total 4.9 million cubic feet a year. According to the company's website, the brand is a proponent of sustainable global sourcing. Cocoa ingredient sources include Latin America and West Africa. The company sold 10,650 tonnes (10,480 long tons; 11,740 short tons) of chocolate in 2014. Aalst Chocolate exports 98% of its products. ## Products Aalst Chocolate offers a range of chocolates and compounds for industrial and food service customers, as well as consumer products in certain markets. Under the Aalst Chocolate and Cacao Ivory brands, the company manufactures and supplies chocolates to confectionery, biscuits and ice cream manufacturers. Products include chocolate and compounds, as well as semi-finished chocolate products. They also offer customised chocolate recipes for food manufacturers. Under the Pâtissier brand, the company offers a wide range of products for [artisanal](/wiki/Artisanal) users of chocolate (chocolatiers, pastry chefs, bakeries and caterers). Products include [chocolate couvertures](/wiki/Couverture_chocolate) and Pâte À Glacer. In the consumer segment, the Aalst Home brand offers products such as chocolate chips, baking chocolate and fountain chocolate. In 2015, the company launched its luxury retail chocolate under the brand Louella Chocolate. Product offerings include artisanal [pralines](/wiki/Praline_(nut_confection)) and tasting squares. The Aalst Chocolate brand is trademarked and the company has filed four patents for some of its products, including the designs of some chocolate fillings and decorations. ## Food safety and certifications Aalst Chocolate is certified in accordance with the following certifications: - [HACCP](/wiki/Hazard_analysis_and_critical_control_points) - [GMP certified Grade A](/wiki/Good_manufacturing_practice) - [SIO 9001](/wiki/ISO_9000) - FSSC 22000 - [ISO 22000](/wiki/ISO_22000) - BizSafe Level 3 - [Halal](/wiki/Halal) - [Kosher](/wiki/Kosher_foods) ## Awards and accolades In 2007, the Pâtissier Signature Plus Dark 56% chocolate was awarded the 2 Star Superior Taste Award under by The International Taste & Quality Institute (ITQI). In 2013, Aalst Chocolate was named by Promising SME 500 as one of Singapore's top 500 Small & Medium Enterprise. In 2014, Aalst Chocolate was ranked in the 30th position in Business Time's annual Enterprise 50 ranking. In 2014, Pâtissier Grand 61 Dark Chocolate was awarded Monde Selection Gold award by The International Taste & Quality Institute (ITQI). In 2014, Enterprise 50 Award. - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T09:50:28.181237",
  "title": "Aalst Chocolate",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Aalst_Chocolate"
}