{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:50:38.201380"
  },
  "content": "[Tan Sri](/wiki/Malay_titles) **Abdul Samad bin Ismail** (18 April 1924 – 4 September 2008), who often went by the moniker **Pak Samad**, was a Malaysian journalist, writer and editor. He was also one of the founding members of the [People's Action Party](/wiki/People%27s_Action_Party) in Singapore. ## Early life Samad was born on 18 April 1924, in Singapore to [Javanese immigrant](/wiki/Javanese_people) parents, where he also attended [Victoria School](/wiki/Victoria_School). He completed a [Senior Cambridge](/wiki/Senior_Cambridge) [certificate](/wiki/General_Certificate_of_Education) as a cub reporter at the daily newspaper, *[Utusan Melayu](/wiki/Utusan_Melayu)*, where he began his career in journalism in 1940. Samad's family is \"very conscious\" of their Javanese heritage, and Samad himself spoke English with thick Javanese accent. ## Career During the [Japanese occupation of Malaya](/wiki/Japanese_occupation_of_Malaya) during [World War II](/wiki/World_War_II), Samad worked for the Japanese-supported newspaper, *Berita Malai*. He became editor of *Berita Malai* when he was just 21 years old. The British, who controlled Malaysia during the [colonial era](/wiki/European_colonisation_of_Southeast_Asia), returned following the Japanese defeat and briefly imprisoned Samad. He was released after a short time and returned to work at the *[Utusan Melayu](/wiki/Utusan_Melayu)*. Samad wrote extensively in support of Malaysian independence from the United Kingdom. He often met with the Malay supporters of independence, as well as the separatists who were against Dutch rule in nearby [Indonesia](/wiki/Indonesia). For his actions, Samad was arrested by the British authorities again in 1951. He was released from prison in 1953 and again returned to work at *Utusan Melayu*. Samad founded the [People's Action Party](/wiki/People%27s_Action_Party) (PAP) with [Lee Kuan Yew](/wiki/Lee_Kuan_Yew), the future [Prime Minister of Singapore](/wiki/Prime_Minister_of_Singapore). However, disagreements between Samad and both Lee and the *Utusan Melayu* resulted in his move to the city of [Kuala Lumpur](/wiki/Kuala_Lumpur). While in Kuala Lumpur, Samad became the head of the *[Berita Harian](/wiki/Berita_Harian)* newspaper and the managing editor of the [New Straits Times Press](/wiki/New_Straits_Times_Press) (NSTP) group. Samad promoted several social causes within his writing in post-independence Malaysia. He drew attention to social inequalities within Malaysian society, called for the national [standardisation](/wiki/Standardisation) of the [Malay language](/wiki/Malay_language) and reported on the sometimes complex relationship between race and [Malaysian politics](/wiki/Malaysian_politics). For his writings on social issues, which were popular with the public, Samad was arrested in 1976 under the [Internal Security Act](/wiki/Internal_Security_Act_(Malaysia)). He was finally released from prison five years later in 1981 under new prime minister [Mahathir Mohamad](/wiki/Mahathir_Mohamad). Samad rejoined the New Straits Times Press group following his release from prison as an editorial adviser. He retired from full-time journalism in 1988. ## Awards He was honoured for his contribution in 1992 by the [King of Malaysia](/wiki/King_of_Malaysia), who at the time was [Sultan Azlan Shah of Perak](/wiki/Sultan_Azlan_Shah_of_Perak). Samad also separately received the Pejuang Sastera (Literature Champion) for literature and journalism. He was also awarded the [Ramon Magsaysay Award](/wiki/Ramon_Magsaysay_Award) for [Journalism, Literature and Creative Communications Arts](/wiki/List_of_Magsaysay_awardees) in 1994 for his efforts in support of Malaysian independence, democratic [nation building](/wiki/Nation_building) and Malay cultural revival in Malaysia. ## Death Samad died on the evening of 4 September 2008, at Pantai Medical Centre in [Kuala Lumpur](/wiki/Kuala_Lumpur). He succumbed to a severe lung infection and kidney failure at the age of 84. Prior to this, he had been hospitalised in the intensive care unit since 24 August 2008, due to breathing difficulties. [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) sent his condolences to Samad's son, describing him as able and shrewd though with an innate ability to accept changed realities. In the condolence letter, Lee said that they were friends even though they had parted company politically. When Samad wanted to visit his family in Singapore, Lee had recommended that the entry ban on Samad be lifted. Samad was survived by his children (whom he had with his first wife, Hamidah Hassan), as well as his grandchildren and great grandchildren. He had ten children during his life, eight of whom are still living. He had two sons, Hamed and Kamal, and six daughters Maria, Norlin, Nuraina, Norazah, Nurazlin and Nurazrina. Nuraina is a former journalist who served as former managing editor at the New Straits Times. Samad's first wife, Hamidah Hassan, had died in 1990. He was buried at the [Muslim cemetery](/wiki/Bukit_Kiara_Muslim_Cemetery) in [Bukit Kiara](/wiki/Bukit_Kiara), where Hamidah was also buried. ## Honour ### Honour of Malaysia - Malaysia - Commander of the [Order of Loyalty to the Crown of Malaysia](/wiki/Order_of_Loyalty_to_the_Crown_of_Malaysia#Commander) (PSM) – **Tan Sri** (1992) - [Mass media in Malaysia](/wiki/Mass_media_in_Malaysia) - [Abdul Rahim Kajai](/wiki/Abdul_Rahim_Kajai) - [A. Samad Said](/wiki/A._Samad_Said) - [Aziz Ishak](/wiki/Aziz_Ishak) - [Ishak Haji Muhammad](/wiki/Ishak_Haji_Muhammad) - [Said Zahari](/wiki/Said_Zahari) - [Usman Awang](/wiki/Usman_Awang) - [Yusof Ishak](/wiki/Yusof_Ishak) - Chronology: Abdul Samad Ismail\n",
  "language": "en",
  "processed_at": "2026-01-12T09:50:38.200631",
  "title": "Abdul Samad Ismail",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Abdul_Samad_Ismail"
}