{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:50:40.830946"
  },
  "content": "* *[Abortion](/wiki/Abortion) in [Singapore](/wiki/Singapore)** is legal and widely accessible. It was formally legalised in 1974, being one of the first countries in [Asia](/wiki/Asia) to do so. It is available on request for [Singaporean citizens](/wiki/Singaporeans), [permanent residents](/wiki/Permanent_residency_in_Singapore), individuals with an issued student or work pass, individuals who have been a resident of Singapore for a minimum of four months as well as anyone married to a Singaporean citizen or a permanent resident. Foreigners may also obtain an abortion in Singapore if their lives are endangered. In Singapore, all surgical abortions are performed by a licensed [physician](/wiki/Physician) at both government and private hospitals and clinics throughout the country, with [nurse practitioners](/wiki/Nurse_practitioners), [pharmacists](/wiki/Pharmacists) and [midwives](/wiki/Midwives) able to provide medications. Abortions performed at a government clinic or hospital are available to be subsidised via [Medisave](/wiki/Medisave). There is no age limit for an abortion procedure in the country. Furthermore, full confidentiality is ensured by law; parental consent is not legally required over 14,[a] nor spousal consent for married women. Abortion is available on request as late as 24 weeks or six months of pregnancy, beyond that, when the woman's life is in danger. Singapore's laws on abortion are considered to be [progressive](/wiki/Progressivism). In 1994, Singapore was one of 179 members who signed the [International Conference on Population and Development Programme of Action](/wiki/International_Conference_on_Population_and_Development). This programme called for the liberalisation of abortion laws among other demands. The [Centre for Reproductive Rights](/wiki/Center_for_Reproductive_Rights) placed them in the most progressive category of five: \"On request\". In 1996, Singapore was one of 45 countries worldwide that allowed abortions on request. As of 2020, it is one of 67, out of a total 194 countries evaluated. ## History ### Prior to 1967 Before 1967, abortion was illegal in Singapore under sections 312–315 of the [Penal Code of Singapore](/wiki/Penal_Code_(Singapore)) unless it was necessary to save the life or protect the health of the pregnant woman. This Penal Code, similarly to other Commonwealth countries such as Australia and India, was based on legislation from the [United Kingdom](/wiki/United_Kingdom) in the nineteenth century as the country was under its colonial rule. In 1966, the Singapore Family Planning and Population Board (SFPPB) was launched in an attempt to control the high rate of population growth in Singapore. The board was in favour of induced abortion as it would aid in its mission. Soon after its creation it began a review of the government's abortion policy and its effectiveness. They concluded that induced abortion should be made available to more women, and they presented these findings to the Health Ministry of Singapore in 1967. In the same year, the laws were extended to allow abortions in cases of rape, congenital foetal malformation, failed contraception, or certain eugenics cases. Following this change, the rate of illegal abortions was still high. This raised concerns for the safety of Singaporean women. Parliamentary debate on this issue, among others, lead to a reform of abortion law in 1969. ### Legalisation The legalisation of abortion was not influenced by, but helped to regulate Singapore's high [population growth](/wiki/Population_growth) rate in the 1960s. It was successful, with the population growth rate falling from 2.8% to 0.1% in the 15 years after its introduction. There were 6,815 abortions carried out in Singapore in 2017, bringing the number to the lowest it has been since 1973. The *Abortion Act 1969* had a span of four years and the possibility of being extended to five. The parliamentary [whip](/wiki/Whip_(politics)) was lifted for this vote, allowing votes to accurately represent the members’ opinions. It was passed in Parliament with 32 for, 10 against, and one abstention. [Chua Sian Chin](/wiki/Chua_Sian_Chin), the Minister for Health, proposed that the purpose of the bill was designed to protect the health of women \"in the interests of humanity and human progress,\" and \"to ensure that the children born are wanted children.\" Under the bill, a termination of pregnancy could be granted under four circumstances: - The pregnancy threatened the health or life of the pregnant woman. - The woman's economic and family circumstances would not be suitable for a child. - The child, if born, may suffer from health issues or disability. - The pregnancy is a result of rape or incest. Initially, consent was required to terminate a pregnancy if the woman in question was unmarried and under 18. This bill was passed in Parliament on 29 December 1969, and it came into effect on 20 March 1970. ### Further liberalisation The *Abortion Act 1974* was passed in Parliament on 23 October 1974 to repeal and amend the Act from 1969. It closely resembled the previous legislation. The five circumstances in which a termination of pregnancy would be granted were removed, allowing the treatment on request. Also, the patient was the only person required to give consent for the procedure to go ahead. The *Termination of Pregnancy Act* put in place in 1985 brought no major changes aside from its name. In 1986, mandatory pre-abortion counselling was introduced. This applied to all women who were citizens or permanent residents, had two or fewer children, or had passed the [Primary School Leaving Examination](/wiki/Primary_School_Leaving_Examination). This was amended in 2015 to apply to all women. ### Graphical summary of history of Singaporean abortion law YearRisk to lifeRisk to healthRapeFetal impairmentEconomic or socialOn request1800s–19671967–19691969–1974[b]1974–present ## Abortion laws According to the *Termination of Pregnancy Act*, any woman who is a citizen of Singapore, holds a work pass under the *Employment of Foreign Manpower Act*, or has resided in Singapore for over four months is permitted to undergo a termination of pregnancy. This also applies to women whose spouse fulfils these criteria. These criteria do not apply to \"any treatment to terminate pregnancy which is immediately necessary to save the life of the pregnant woman\". The procedure must be undertaken by an authorised medical practitioner in an approved institution, with written consent from the patient. Breaches of these guidelines will result in a fine of up to $3000, three years imprisonment, or both. Unless under special circumstances, the pregnancy may not be terminated if it is older than 24 weeks, unless it will protect the life or health of the pregnant woman. If the pregnancy is between 16 and 24 weeks, the treatment must be carried out by an authorised medical practitioner with the correct qualifications. If a patient is undergoing a non-surgical treatment, it is not required that the medical practitioner have qualification, or that the process be undertaken in an approved institution. There is no consent required for a termination of pregnancy other than that of the pregnant woman. This remains true for minors. Any person found guilty of coercing or intimidating a woman against her will into terminating a pregnancy will be subject to a fine of up to $3000, three years imprisonment, or both. Conscientious objection is permitted for any member of the treatment process. This is overridden, however, when the life or health of the patient is at risk. The information surrounding the termination of pregnancy may not be shared without the permission of the patient. It is required that all women undertaking a termination of pregnancy participate in pre- and post-abortion counselling. After this counselling, they must wait 48 hours before commencing treatment. ## Statistics The *Termination of Pregnancy Act* guidelines require that all medical practitioners who complete a termination of a pregnancy must submit the details of the patient and the treatment to the Director of Medical Services. This includes the patient's name, marital status, and level of education, the number of children the woman has, and the date and method of termination. This information is kept confidential. Data on abortion numbers and rates in Singapore are recorded, but not widely reported, as it is considered unimportant. Statistics are most often released during parliamentary debate, or in questions to Members of Parliament (MPs). ### Number of abortions YearNo. Live BirthsNo. AbortionsRate of Abortions per 1000 women 15-4419704593419134.11971470883407719724967838067.5197348269525210.1197443268717513.31975399481287322.71976427831549626.31977383641644327.11978394411724627.61979407791699926.51980412171821928.41981422501899028.41982426541911028.61983405851910027.919844155622,19032.21985424842351234.01986383792303532.9198743616212261988529572013528198947669206191990511421866922.5199149114177982119924940217073201993502251647619.21994495541569018.21995486351450416.41996485771436515.91997473331382717.11998436641383817.71999433361375320004699713754200141451131402002407601274920033748512272152004371741207012.62005374921148220063831712032122007394901193320083982612222200939570123182010379671208220113965411940201242663106242013397209282201442232851520154218579422016412517212201739615681520183903964132019392796067202038590664820213867270562022356056597 There was a 673% rise in recorded abortions between 1970 and 1975, due to the sudden availability of treatment. This number continued to rise, reaching its peak in 1985, with 23,512 legal abortions. This number influenced the introduction of mandatory pre-abortion counselling for women in 1986. As a result, the number of abortions regulated, passing under 20,000 in 1990. Between 2003 and 2012, approximately 300 to 500 abortions were kept after pre-abortion counselling. In 2017, there were 6815 legal abortions carried out. ### Other statistics In 1970, the most common reason for abortion was economic limits or existing family size, explaining 90% of abortions. This continued to be the most common reason in 1983; however, it explained only 39% of procedures. Abortions are also commonly justified by marital status, domestic problems, and medical reasons. The least common reason, at a maximum of 4% between 1970 and 1983, was failed contraception. Between April 1984 and December 1985, the average age of single women presenting for abortion was 23.6. In 2002, the average age of women presenting had risen to 29.6 years old. The number of teenagers presenting for abortions has decreased. In 2005, 1279 women under 20 had abortions, followed by 1195 in 2009, 578 in 2013, and 343 in 2016. This is almost equal to the 332 babies born to teenagers in 2016. In 1999, 109 patients younger than 16 presented for an abortion, but in 2012, only 59 in this age bracket did. Teenagers are also less likely to have used contraceptives. In 1985, 69.75% of patients were married. By 2002, this had risen to 75.5%. A total of 58.3% had a secondary school education in 2002. ## Opinion Public opposition to the abortion laws in Singapore has been limited for a number of reasons. Singaporeans are split between several religions, diluting religious social influence. The laws were passed earlier than many other countries, particularly in Asia. As a result, there has not been extensive debate on the topic. ### Religious debate In 1967, the [Archbishop](/wiki/Archbishop) of the [Roman Catholic Archdiocese of Singapore](/wiki/Roman_Catholic_Archdiocese_of_Singapore) argued against the legalisation of abortion. Instead, he suggested that religious education could replace the need for abortions. During the parliamentary debate leading up to the legalisation of abortion in 1969, then [Minister of Health](/wiki/Ministry_of_Health_(Singapore)), [Chua Sian Chin](/wiki/Chua_Sian_Chin), argued that the stance of religious groups should not be considered in the debate on abortion. He explained that their input was an attempt to \"impose their will on the majority\". He followed this by suggesting that opposition to the *Abortion Bill* would be considered redundant in the future. The parliamentary whip was lifted during the subsequent debate to allow members of parliament to vote according to conscience, which allowed religious opposition within the governing [People's Action Party](/wiki/People%27s_Action_Party) (PAP) to be represented in the vote. Nevertheless, it was passed. The debate around religion and abortion continued through 2008, following an article in the *Straits Times* arguing that Singapore's abortion laws should be reviewed. Some readers replied, suggesting that restrictions on abortion would not cause an increase in birth rates, and would create more social inequality. There has not been any review of Singapore's abortion laws on religious grounds. Any medical professional may conscientiously object to performing a termination of pregnancy on the grounds of religious beliefs. The only case where personal objection is disregarded is if the patient's life is endangered by the pregnancy. - Singapore portal - Feminism portal - [Abortion law](/wiki/Abortion_law) - [Abortion debate](/wiki/Abortion_debate) - [History of abortion](/wiki/History_of_abortion) - [Demographics of Singapore](/wiki/Demographics_of_Singapore) - [Population planning in Singapore](/wiki/Population_planning_in_Singapore) ## Notes - Chen, A. J.; Emmanuel, S. C.; Ling, S. L.; Kwa, S. B. (May 1985). \"Legalized Abortion: The Singapore Experience\". *Studies in Family Planning*. **16** (3): 170–178. [doi](/wiki/Doi_(identifier)):10.2307/1967019. [JSTOR](/wiki/JSTOR_(identifier)) 1967019. [PMID](/wiki/PMID_(identifier)) 4012821. - Swee-Hock, Saw (2005). *Population Policies and Programmes in Singapore*. Singapore: Institute of Southeast Asian Studies (ISEAS). [ISBN](/wiki/ISBN_(identifier)) 978-981-230-548-0. [OCLC](/wiki/OCLC_(identifier)) 751691053.\n",
  "language": "en",
  "processed_at": "2026-01-12T09:50:40.830496",
  "title": "Abortion in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Abortion_in_Singapore"
}