{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:50:14.388525"
  },
  "content": "Singaporean company headquartered in TampinesThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"ABR Holdings\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(March 2023)* *(Learn how and when to remove this message)* **ABR Holdings Limited** is a Singaporean company headquartered in [Tampines](/wiki/Tampines). ABR is listed on the Mainboard of the [Singapore Exchange](/wiki/Singapore_Exchange). ABR is primarily involved in food services and property development. ## History Established in 1978, ABR first held the franchise for [Swensen's](/wiki/Swensen%27s) in Singapore. ABR first listed on the secondary board of the [SGX](/wiki/Singapore_Exchange), Sesdaq, on 11 May 1992; and was transferred to the Mainboard on 7 November 2008. In the late 1990s, an acquisition of the majority stake in ABR saw the injection of Europa Holdings into ABR. Europa had various lifestyle businesses including pubs, restaurants, and most notably, two country clubs, Raffles Town Club and Europa Country Club. ABR divested its interest in some brands and consolidated others. In 2003, ABR made a majority investment into FNA. On 10 February 2012, ABR announced that it entered into a conditional [sale and purchase agreement](/wiki/Sale_and_purchase_agreement) to sell its stake in FNA to its minority partner.[*citation needed*] ## Property In October 2018, ABR announced a proposed acquisition into a property development project in Kuala Lumpur, Malaysia. The project lands are located in the vicinity of [Pavilion Kuala Lumpur](/wiki/Pavilion_Kuala_Lumpur), a shopping centre situated in the [Bukit Bintang](/wiki/Bukit_Bintang) district. It is intended that a mixed commercial development will be developed on the project lands. On 1 January 2021, ABR announced that its joint venture company with LWH Holdings, Baywind Properties, had been awarded a tender for three freehold properties in Lorong N Telok Kurau, with a tendered price of S$23.6 million. The estimated total land size is 18,507.62 sq ft. ABR and LWH intend to develop the properties into apartments, subject to necessary approvals being obtained. - Companies portal - ABR Holdings Official Website\n",
  "language": "en",
  "processed_at": "2026-01-12T09:50:14.388116",
  "title": "ABR Holdings",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/ABR_Holdings"
}