{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:50:44.989520"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Abu Bakar bin Taha\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(July 2009)* *(Learn how and when to remove this message)* **Syed Abu Bakar bin Taha Alsagoff** ([Arabic](/wiki/Arabic_language): سيد أبو بكر بن طه السقاف **Saiyid Abū Bakr bin Ṭāhā al-saqqāf**) (1882, in Hadramaut, [Yemen](/wiki/Yemen) – 22 January 1956) was a well-known [Islamic](/wiki/Islamic) educator in Singapore. ## Life Abu Bakar bin Taha received his early education in his birthplace, [Seiyun](/wiki/Seiyun). Later, he went to [Mecca](/wiki/Mecca) to further his studies from some of the most prominent [ulama](/wiki/Ulama) at that time. After completing his studies in Mecca, he travelled to Singapore to propagate Islamic da’wah. Upon his arrival, he married Sherifa Aisyah Alsagoff from a well-known philanthropist Arab family in Singapore. He sat on the building committee for Madrasah Alsagoff, the first Madrasah in Singapore. In 1920, he returned to his home country to fulfill his dream of setting a modern madrasah. He became the first Headmaster of Madrasah Nahdah Ilmiah. In 1927, he went back to Singapore and stayed there for almost 30 years. His arrival coincided with opening of a Madrasah Aljunied at Victoria Street. The philanthropist, Syed Abdul Rahman Aljunied, who build it saw that Syed Abu Bakar was the most eligible to sit in its Headmaster's chair. He agreed but on two conditions: that Arabic Language was the medium of instruction, and its educational system must be modern. His conditions were well-received, and he ran the Madrasah with tight discipline. As Headmaster from 1927 to 1955, he built up the Madrasah's reputation as a premier Islamic educational institution in South East Asia. Students from all over the countries in this region came to the Madrasah to be his students. He even allowed a section of his house at Java Road to be used as free accommodation for these students, who also received free education at the Madrasah. Consequently, his students ran to hundreds, and many became prominent ulama themselves in their countries. Among them was Yahya Rajai from the Philippines who set up no less than 106 madrasahs all over [Sulu](/wiki/Sulu) and [Palawan](/wiki/Palawan) islands. During his tenure as Madrasah Aljunied's Headmaster, he wrote several famous books such as \"Tauhidul Khaliq wa Risalatu Anbiyaa-ihi\" which was printed 10 times, and \"Addurusut Tadrikiyah\" which was printed 15 times. The book Tauhidul Khaliq remained in use well into the early 1990s, more than 30 years after his death. Syed Abu Bakar bin Taha Alsagoff also sat in several committees, such as Majlis Penasihat Islam (before [Majlis Ugama Islam Singapura](/wiki/Majlis_Ugama_Islam_Singapura)), and Muslimin Trust Fund. He was also instrumental in establishing [Jamiyah](/wiki/Jamiyah_Singapore) in Singapore in 1932, and Kolej Islam in Kelang, Malaysia in 1949. And for 25 years, he was also the Headmaster for Madrasah Khairiyah in Singapore. It was due to his tireless contributions in Islamic educational field that he was named by several newspapers at that time as 'Pendidik Ulung' (Great Teacher), 'Tokoh Pendidik' (Prominent Educationist) and 'Pendidik Suatu Generasi' (A Generation's Teacher). In 1955, he returned to Hadramaut, after serving Singapore for more than 28 years. A year later, on Sunday, 22 January 1956, corresponding to 8 Jamadil Akhir 1375, he died peacefully. He left behind 11 children, including Sayed Ali Redha, chairman of Lembaga Biasiswa Kenangan Maulud (LBKM). ## Personal life Abu Bakar has a son, Ali Redha Alsagoff (1928–1998), who was the founder and President of Lembaga Biasiswa Kenangan Maulud or Prophet Muhammad's Birthday Memorial Scholarship Fund Board from 1965 to 1995. - [Masjid Al-Muttaqin](/wiki/Masjid_Al-Muttaqin) ## Notes - \"Syed Abu Bakar bin Taha Alsagoff\", *Sulaiman Jeem, Abdul Ghani Hamid, Aktivis Melayu/Islam di Singapura*, Singapore: Persatuan Wartawan Melayu Singapura, 1997 - \"Madrasah Aljunied al-Islamiah\", Nureza Ahmad, *Singapore National Library* - \"Al-Habib Abu Bakar bin Taha Alsagoff (Singapore)\", *Baalawi.com* - \"Warita Jul\", *Ogos 2000* - \"DISERTASI, Ilmiah, semasa dan cakna Ilmiah, semasa dan cakna \"\n",
  "language": "en",
  "processed_at": "2026-01-12T09:50:44.989067",
  "title": "Abu Bakar bin Taha",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Abu_Bakar_bin_Taha"
}