{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:50:48.303764"
  },
  "content": "[Grading in education](/wiki/Grading_in_education) - [Class rank](/wiki/Class_rank) - [Corrective feedback](/wiki/Corrective_feedback) - [Criterion-referenced test](/wiki/Criterion-referenced_test) - [Exam](/wiki/Exam) - [Grade inflation](/wiki/Grade_inflation) - [High-stakes testing](/wiki/High-stakes_testing) - [Inter-rater reliability](/wiki/Inter-rater_reliability) - [Intraclass correlation](/wiki/Intraclass_correlation) - [Norm-referenced test](/wiki/Norm-referenced_test) - [Psychological evaluation](/wiki/Psychological_evaluation) - [Psychometrics](/wiki/Psychometrics) - [Rubric](/wiki/Rubric_(academic)) - [Standardized test](/wiki/Standardized_test) - [Standards-based assessment](/wiki/Standards-based_assessment) - [Summative assessment](/wiki/Summative_assessment) - [Test score](/wiki/Test_score) - [Test validity](/wiki/Test_validity) Africa - [Egypt](/wiki/Academic_grading_in_Egypt) - [Kenya](/wiki/Academic_grading_in_Kenya) - [Morocco](/wiki/Academic_grading_in_Morocco) - [Nigeria](/wiki/Academic_grading_in_Nigeria) - [South Africa](/wiki/Academic_grading_in_South_Africa) - [Tunisia](/wiki/Academic_grading_in_Tunisia) North America - [Canada](/wiki/Academic_grading_in_Canada) - [Costa Rica](/wiki/Academic_grading_in_Costa_Rica) - [Mexico](/wiki/Academic_grading_in_Mexico) - [Nicaragua](/wiki/Academic_grading_in_Nicaragua) - [United States](/wiki/Academic_grading_in_the_United_States) South America - [Chile](/wiki/Academic_grading_in_Chile) - [Venezuela](/wiki/Academic_grading_in_Venezuela) Asia - [Bangladesh](/wiki/Academic_grading_in_Bangladesh) - [China](/wiki/Academic_grading_in_China) - [Hong Kong](/wiki/Academic_grading_in_Hong_Kong) - [India](/wiki/Academic_grading_in_India) - [Indonesia](/wiki/Academic_grading_in_Indonesia) - [Iran](/wiki/Academic_grading_in_Iran) - [Israel](/wiki/Academic_grading_in_Israel) - [Japan](/wiki/Academic_grading_in_Japan) - [Kyrgyzstan](/wiki/Academic_grading_in_Kyrgyzstan) - [Nepal](/wiki/Academic_grading_in_Nepal) - [Pakistan](/wiki/Academic_grading_in_Pakistan) - [Philippines](/wiki/Academic_grading_in_the_Philippines) - Singapore - [South Korea](/wiki/Academic_grading_in_South_Korea) - [Syria](/wiki/Academic_grading_in_Syria) - [Vietnam](/wiki/Academic_grading_in_Vietnam) Europe - **[ECTS](/wiki/ECTS_grading_scale)** - **[European Baccalaureate](/wiki/European_Baccalaureate)** - **[GPA in Europe](/wiki/Grading_systems_by_country#Europe)** - **[Latin honours](/wiki/Latin_honors)** - [Austria](/wiki/Academic_grading_in_Austria) - [Belarus](/wiki/Academic_grading_in_Belarus) - [Belgium](/wiki/Academic_grading_in_Belgium) - [Bosnia and Herzegovina](/wiki/Academic_grading_in_Bosnia_and_Herzegovina) - [Bulgaria](/wiki/Academic_grading_in_Bulgaria) - [Croatia](/wiki/Academic_grading_in_Croatia) - [Czech Republic](/wiki/Academic_grading_in_the_Czech_Republic) - [Denmark](/wiki/Academic_grading_in_Denmark) - [Finland](/wiki/Academic_grading_in_Finland) - [France](/wiki/Academic_grading_in_France) - [Germany](/wiki/Academic_grading_in_Germany) - [Greece](/wiki/Academic_grading_in_Greece) - [Hungary](/wiki/Academic_grading_in_Hungary) - [Iceland](/wiki/Academic_grading_in_Iceland) - [Ireland](/wiki/Academic_grading_in_the_Republic_of_Ireland) - [Italy](/wiki/Academic_grading_in_Italy) - [Latvia](/wiki/Academic_grading_in_Latvia) - [Liechtenstein](/wiki/Grading_in_education#Liechtenstein) - [Lithuania](/wiki/Academic_grading_in_Lithuania) - [Luxembourg](/wiki/Academic_grading_in_Luxembourg) - [Netherlands](/wiki/Academic_grading_in_the_Netherlands) - [Norway](/wiki/Academic_grading_in_Norway) - [Poland](/wiki/Academic_grading_in_Poland) - [Portugal](/wiki/Academic_grading_in_Portugal) - [Romania](/wiki/Academic_grading_in_Romania) - [Russia](/wiki/Academic_grading_in_Russia) - [Serbia](/wiki/Academic_grading_in_Serbia) - [Slovakia](/wiki/Academic_grading_in_Slovakia) - [Slovenia](/wiki/Academic_grading_in_Slovenia) - [Spain](/wiki/Academic_grading_in_Spain) - [Sweden](/wiki/Academic_grading_in_Sweden) - [Switzerland](/wiki/Academic_grading_in_Switzerland) - [Ukraine](/wiki/Academic_grading_in_Ukraine) - [United Kingdom](/wiki/Academic_grading_in_the_United_Kingdom) Oceania - [Australia](/wiki/Academic_grading_in_Australia) - [New Zealand](/wiki/Academic_grading_in_New_Zealand) - [Papua New Guinea](/wiki/Academic_grading_in_Papua_New_Guinea) - v - t - e [Singapore](/wiki/Singapore)'s grading system in schools is differentiated by the existence of many types of institutions with different education foci and systems. The grading systems that are used at Primary, Secondary, and Junior College levels are the most fundamental to the local education system, ## Primary schools Primary schools in Singapore implement a grading system along with an \"Achievement Band\" until the system disregarded the EM3 stream and concentrated on an \"Overall Grade\" scheme, which grades students as shown below. Students are then offered the subjects into either standard and foundational stream upon reaching Primary 5 depending on the performance, and which papers will be taken during the [Primary School Leaving Examination](/wiki/Primary_School_Leaving_Examination). ### Current scheme Since 2021, the *Achievement Level system* (AL) was adopted, which eliminates the scoring system to benefit the chances for placements in the Secondary Schools: Achievement Level Band scoring (Standard) Achievement Level BandRaw Marks[PSLE](/wiki/Primary_School_Leaving_Examination) PointAL190-1001AL285-892AL380-843AL475-794AL565-745AL645-646AL720-447AL80-198Achievement Level Band scoring (Foundational) Achievement Level BandRaw MarksPSLE PointAL A75-1006AL B30-747AL C0-298 Postings for the Secondary Schools are determined by the sum of all four subjects of English, Mathematics, Science and Mother Tongue, with a possible score between 4 and 32, with a minimum passing score of 30 (see below). Attaining a merit for Higher Chinese Language (Distinction/Merit/Pass) with a PSLE score of no more than 14 will be given priority; however, no scores are displayed and no scoring system is specified as such. The eventual scores would determine the placements for the Posting level through the Full Subject-Based Banding (Academic Streaming prior to 2023): Allocation to Levels Posting Level/StreamPSLE ScoreRemarksG1/Normal (Technical)25-30AL7 or better in English and Mathematics required.G2/Normal (Academic)21-25G3/Express4-22Eligible for Higher Mother Tongue (HMTL) if student's PSLE score is 8 or less; if student had a merit grade in HCL, the minimum score is relaxed to 14. ### Former scheme Between 2008 and 2021, students' scores are determined through the aggregate [T-score](/wiki/Standard_score) system, in which students are graded relative to their peers. Achievement Level Band scoring (Standard) Academic GradeRaw MarksA*91-100A75-90B60-74C50-59D35-49E20-34Ungraded/F0-19Achievement Level Band scoring (Foundational) Academic GradeRaw MarksA85-100B70-84C50-69D30-49Ungraded/F0-29 ## Secondary schools Secondary schools are the first institutions in Singapore to have implemented the \"Overall Grade\" grading system for academic subjects. Prior to 2023, the education system allows more students from the Normal (Academic) stream to partake the [GCE Ordinary (O) Level](/wiki/Singapore-Cambridge_GCE_Ordinary_Level) examinations for Mother Tongue and Mathematics for a year exempting them at [Normal (N) Level](/wiki/Singapore-Cambridge_GCE_Normal_Level), resulting with quasi-Ordinary Level grading systems although Subjects for Normal-Levels are computed along with it in their result slips. The Mother Tongue Syllabus B does not use the grading system, but instead graded as either a Merit, a Pass, or an Ungraded grade. Students are graded via the Overall Grade systems during their first three years in Secondary School, with a fourth year being different across different academic streams. Express or Special students are graded via the results from the O Levels in their fourth and final year, while Normal (Academic) use both the N and O Level results for their fourth and fifth years respectively; Normal (Technical) students would use either the N Level results or the Overall Grade format, depending on the school's method of learning. Grading for Ordinary Level GradePercentageRemarksA175-100Distinction may be given for top scoring students.A270-74B365-69B460-64C555-59C650-54Minimum passing grade in consideration.D745-49E840-44F90-39Grading for Normal Level GradePercentageRemarksA70-100B65-69C60-64D50-54Minimum passing grade in consideration.Ungraded0-49Results may not be displayed at [result slips](/wiki/Certificate_of_Secondary_Education). ### GPA and MSG In some Secondary Schools, the Grade Point Average (GPA) grading system is used. The GPA is usually calculated by taking the Grade Point of each subject, adding them together, then dividing the total by that number of subjects. The actual subjects counted towards the GPA computation differs between schools. For example, Victoria School gives its students the option to exclude applicable subjects from the GPA computation depending on the subject combination of the student. This GPA value is rounded to two decimal places, giving the student's GPA. Usually students with a requirement of both a pass in English Language and Mathematics with a minimum GPA of 3.0 are required to advance to the next year. For example, the former GPA table (before 2025) for [Raffles Girls' School](/wiki/Raffles_Girls%27_School) is as follows: GradePercentageGrade PointA+80-1004.0A70-793.6B+65-693.2B60-642.8C+55-592.4C50-542.0D45-491.6E40-441.2F0-400.8 For example, the GPA table for [Victoria School](/wiki/Victoria_School) (Integrated Programme) is as follows: GradePercentageGrade PointA+85-1004.0A70-84B+65-693.5B60-643.0C+55-592.5C50-542.045-491.5D40-441.035-390.5E20-340.0Ungraded0-20 However, the GPA table may differ from schools to schools and tracks; in the case of other schools such as [Hwa Chong Institution](/wiki/Hwa_Chong_Institution), [St. Joseph's Institution](/wiki/St._Joseph%27s_Institution), [School of Science and Technology](/wiki/School_of_Science_and_Technology,_Singapore), and [Victoria School](/wiki/Victoria_School) (Express), a similar grading system called the Mean Subject Grade (MSG) is used. The MSG table works similarly to the regular grading scheme (see above), with the number prefix being the determinant for the points; like in GPA, the points are calculated by average to the number of subjects taken, rounded to two decimal points. **Grading system for Raffles Institution** In 2025, the grading system for [Raffles Institution](/wiki/Raffles_Institution) has also changed to reduce student pressure for a high GPA; the new grading system is as follows: RP Grading System MarksRP Grade70 & aboveA60 – 69B50 – 59C45 – 49D44 & belowU ## Junior college level (GCE A and AO levels) Grading for Junior College GradePercentageH2 Rank PointH1 Rank PointRemarksA70-1002010Distinction may be given for top scoring students.B60-6917.58.75C55-59157.5D50-5412.56.25E45-49105Minimum passing grade at consideration.O/S35-4452.5Conditional Pass (denotes standard is at AO level only)U0-340May not be reflected in the Advanced-Level result certificate. Like in Secondary Schools, Junior College also have grading systems where grading systems are awarded for H1 or H2 subjects. H3 (previously Special papers before 2006) are instead awarded as either Distinction, Merit, Pass (H3 only) or Ungraded; as with Higher Mother Tongue subjects, these subjects does not influence the student's final score. In addition, some schools are also offering the [International Baccalaureate](/wiki/International_Baccalaureate) diploma program. To prevent [grade inflation](/wiki/Grade_inflation), percentage of the scores may be adjusted according to the cohort's performance, and as such the percentages are only approximate. Depending on Junior College's requirements, a D grade may be the minimum passing grade instead of an E grade, or Conditional Pass may be awarded, or both. The grades obtained for each A-level exam subjects will influence the student's rank point. A higher score provides a better chance at admission to university, for a maximum score of 90, based on the best scores from three H2 subjects and three H1 subjects (General Paper, coursework, and one best subject of their choice). Different local universities have different requirements as indicated on their Indicative Grade Profile. ## Institute of Technical Education and Polytechnics (NITEC and diplomas) Technical schools also adopt Grade Point Average system, as scores are computed through the grades obtained from a set of modules multiplied by the number of [credits](/wiki/Course_credit) given for the module (excluding modules which do not include in the GPA, industry attachments and on-the-job training, or exempted modules). The total is then divided by the cumulative number of credits for all modules taken. The grading are the same between ITE and polytechnics, but with different grading bands, which are as follows: Grading for ITE/Polytechnics PolytechnicsInstitute of Technical EducationRemarksScoreGradeGrade PointScoreGradeGrade Point80-100A4.080-100A4.0May be awarded Distinction (AD/Z) for top 5% of cohort.75-79B+3.570-79B3.070-74B3.065-69C+2.560-69C2.060-64C2.055-59D+1.550-59D1.050-54D1.0Minimum passing grade in consideration.0-49F0.00-49F0.0 And as with universities, the following conditions apply for most modules: - Modules with a grading system of either a Pass or Fail only award credits and does not impact the GPA. - Students failing to fulfill the percentage rate for the attendance requirements (based on the total number of hours in attendance and approved [leave of absence](/wiki/Leave_of_absence)), depending on the school's requirement, may be allowed to sit for the semestral exams, though only a non-graded pass (0.5) or a cap of D grade (1.0) would be factored if they passed. - Students who was absent for the semestral exams without a valid reason, or are caught with [dishonesty](/wiki/Academic_dishonesty), are considered to have failed the module. Students who failed the module must retake it and depending on the school's scoring system, either having a prior score overwritten or had both attempts computed. Modules which have passed, electives after exceeding the maximum number of attempts, or modules from the Polytechnic Foundation Programme, are not applicable for retaking. - Students are given an academic standing; students may be placed on [academic probation](/wiki/Academic_probation) (where most features from the school were revoked) if they have a low cumulative GPA (usually 1.0, 0.8 in NYP, or 1.4 in SP), or was [dismissed](/wiki/Expulsion_(education)) from the course of study if they fail to improve their GPA for consecutive semesters, if they have passed the maximum allowable time for graduation (double the number of years for their years of study), or failing a module for multiple times, whichever fulfill first. Students with a minimum cumulative GPA of 3.5 (NITEC) or 2.0 (Higher NITEC; 2.5 from 2027), including up to 0.2 bonus points for [Co-curricular activity](/wiki/Co-curricular_activity_(Singapore)) (CCA) and/or 0.1 point for passing Bridging Mathematics, was also taken into consideration for matriculation in polytechnics, though this applies to most diplomas; Higher NITEC students who have a cumulative GPA of 3.5 may exempt them their first year of studies providing if criteria have been met. Like in Junior Colleges, the student's GPA from the Polytechnics would determine the admission for universities, including international ones, although this is not guaranteed even though if the student's GPA is high and has graduated with a diploma with merit. ## University (degree) Like some Secondary schools, Institute of Technical Education and Polytechnics, universities also adopt the Grade Point Average (GPA) system. However, unlike the Polytechnics, different universities have different computation for their scoring schemes; most universities use a 5.0 point scale while some universities, such as Singapore Management University uses 4.0 point scale, as stated otherwise. Upon graduation, students will receive degree classification according to their CGPA/CAP. ### Grading Systems #### NUS/NTU/SIT/SUSS/SUTD GradeScore equivalent Universities/PointNUS/NTU/SIT/SUSSSUTDA+85-1005.05.3A80-845.0A-75-794.5B+70-744.0B65-693.5B-60-643.0C+55-592.5C50-542.0D+45-491.5D40-441.0F0-390.0 #### SMU GradeScore equivalent Universities/PointSMUA+86-1004.3A83-854.0A-80-823.7B+77-793.3B74-773.0B-70-732.7C+66-692.3C63-652.0C-60-621.7D+53-591.3D50-521.0F0-490.0 ### Degree Classifications #### NUS/NTU/SIT/SUSS/SUTD CAP/CGPAClassificationRemarksHonours DegreesBasic DegreesNUS/NTU/SUTD/SIT/SIT (DigiPen)*NUS**/NTU**/SUSSNUSNUS***/SUSS4.50 - 5.00Honours (Highest Distinction)First Class HonoursPass with Merit Pass with Merit At least A− in Honours thesis/project.4.00 - 4.49Honours (Distinction)Second Class (Upper)3.50 - 3.99Honours (Merit)Second Class (Lower)3.20 - 3.49HonoursThird Class3.00 - 3.19Pass2.00 - 2.99PassPassPass0.00 - 1.99Students will not graduate. *Student admitted prior to AY2012/2013 **Student admitted from AY2020 cohort onward ***Prior 2012 #### SMU CGPAClassification3.80 - 4.0Summa Cum Laude (With Highest Distinction)3.60 - 3.79Magna Cum Laude (With High Distinction)3.40 - 3.59Cum Laude (With Distinction)3.20 - 3.39High Merit3.00 - 3.19Merit **** #### Others Like polytechnics, universities also have an academic standing and a minimum GPA for graduation (usually 2.0), and with [honor](/wiki/Latin_honors) certification for reaching certain minimum thresholds for the following degrees: - For NAFA's master'a degree, the merit threshold is 4.5, while the minimum passing grade is 2.5. - For NAFA's graduate diploma, the merit threshold is 4.0. - For NUS' Doctor of Philosophy, master's degrees and Graduate diploma, the minimum passing grades are 3.5, 3.0 and 2.5, respectively; there are no merit certifications. ### Academic Termination Non-SUTD undergraduate students whose cumulative GPA fell below the passing threshold at the end of the current semester may be probated or dismissed altogether depending on the university's policy: - In NTU, if the cumulative GPA fell below 2.0 for three consecutive semesters. - In NUS, for undergraduates, if the CAP fell below 2.0 for two consecutive semesters; for master's degree, if the CAP is between 2.5 and 3.0 for three consecutive semesters, or below 2.5 for two consecutive semesters; for PhD degree, if the CAP is between 3.0 and 3.5 for three consecutive semesters, or below 3.0 for two consecutive semesters. There is no academic probation for graduate diploma. - In SIT, if the cumulative GPA fell below 2.0 for two consecutive semesters, or had one module failed three times; however, the student will be in probation if the GPA fell below 1.75 during their first semester. - In SMU, if the cumulative GPA fell below 2.0 or 2.5 for two consecutive semesters, depending on the course of study. - In SUSS, if the cumulative GPA fell below 2.0 for two consecutive semesters. For Law students, students will face academic termination if their cumulative GPA fell below 3.0 for two semesters. - If the GPA fell below the threshold at the end of the final semester of study, even though it is the first time this occurs, and if the student has passed all the modules.\n",
  "language": "en",
  "processed_at": "2026-01-12T09:50:48.303252",
  "title": "Academic grading in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Academic_grading_in_Singapore"
}