{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:50:52.631793"
  },
  "content": "Swiss cybersecurity and data protection technology company **Acronis International GmbH** is a Swiss global technology company specializing in cybersecurity and data protection software. Headquartered in Schaffhausen, Switzerland, the company develops solutions for backup, disaster recovery, endpoint management, and cybersecurity for managed service providers (MSPs), small- and medium-sized businesses (SMBs), and enterprise IT environments. In 2025, Swedish private equity firm **EQT** acquired a majority stake in Acronis. Acronis products support platforms such as [Microsoft 365](/wiki/Microsoft_365), Google Workspace, AWS, and Azure. ## History Acronis was founded in 2003 in Singapore by [Serg Bell](/wiki/Serg_Bell), Stanislav Protassov, and Ilya Zubarev as a spin-off from SWsoft (later known as Parallels), initially focusing on disk imaging and backup with its flagship product, Acronis True Image. It was incorporated in Switzerland in 2008. The company expanded through acquisitions, including GroupLogic in 2012, BackupAgent and nScaled in 2014. According to the company, Acronis True Image 2017 New Generation was the first personal [backup software](/wiki/Backup_software) to include behavioral-based anti-ransomware protection through its “Acronis Active Protection” feature, along with blockchain-based file notarization via “Acronis Notary.” Further acquisitions included 5nine Software in 2019, and DeviceLock and CyberLynx in 2020. That same year, Acronis launched its Cyber Protect platform, integrating backup and cybersecurity. The company supports integrations with platforms such as ConnectWise and Microsoft Azure. ## Financials In 2019, Acronis raised $147 million from Goldman Sachs, reaching a valuation of over $1 billion. A 2021 funding round of $250 million led by CVC Capital Partners increased its valuation to over $2.5 billion. In 2025, Acronis became majority-owned by EQT, a Swedish private equity firm headquartered in Stockholm. According to CEO Ezequiel Steiner, EQT's investment brings additional management \"brain power\" along with an enhanced understanding of the broader market, best practices, and benchmarking to Acronis. The acquisition is subject to federal regulatory approvals expected in 2025. ## Operations Acronis maintains offices in North America, Europe, Asia, and the Middle East, with R&D centers in Bulgaria, the United States, Israel, and Singapore. It operates a global network of cloud data centers and supports over 20,000 service providers protecting approximately 750,000 businesses worldwide. On September 15, 2025, the US [Director of National Intelligence](/wiki/Director_of_National_Intelligence) ordered the exclusion and removal of all Acronis products and services from the Intelligence Community. This order applies per FAR Subpart 4.23 only to intelligence community and sensitive compartmented information systems. The DNI order is based on a Federal Acquisition Security Council (FASC) recommendation. However, neither FASC nor the DNI have identified any vulnerabilities within Acronis products or processes. The order does not prevent Acronis or its partners serving any customers besides the US intelligence community. ## Leadership As of 2025, Acronis’s executive leadership includes CEO Jan-Jaap Jager who replaced Ezequiel Steiner, and Chairman [Warren Adelman](/wiki/Warren_Adelman). Following EQT’s majority acquisition, EQT partner [Johannes Reichel](/wiki/Johannes_Reichel) serves as a strategic Board representative. ## Recognition - In 2005, *PC World* awarded Acronis True Image 8.0 its World Class Award. - In 2017, *Time Magazine* recognized Acronis True Image as a leading cloud-based backup service. - In 2025, Acronis was named to *CRN’s Security 100* list for the fourth consecutive year. ## Governance As of the summer of 2025, the following individuals serve on the Acronis Board of Directors: - Warren Adelman – Chair (USA) - Johannes Reichel – EQT (Germany) - Daniel Williamson – CVC Capital Partners (Italy) - Holger Staude – Springcoast Partners (USA) - Charlie Ryan (Italy) - Stefan Gaiser (Germany) - [Serg Bell](/wiki/Serg_Bell) (Singapore) - [Comparison of disk cloning software](/wiki/Comparison_of_disk_cloning_software) - [List of disk cloning software](/wiki/List_of_disk_cloning_software) - [List of disk partitioning software](/wiki/List_of_disk_partitioning_software)\n",
  "language": "en",
  "processed_at": "2026-01-12T09:50:52.631321",
  "title": "Acronis",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Acronis"
}