{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:50:59.241157"
  },
  "content": "Customary laws in Minangkabau, Sumatra, IndonesiaThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Adat perpatih\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(January 2015)* *(Learn how and when to remove this message)* **Adat Perpatih** (also known as **Lareh Bodi Caniago** in Indonesia) are customary laws which originated in the [Minangkabau Highlands](/wiki/Minangkabau_Highlands) in [Sumatra](/wiki/Sumatra), [Indonesia](/wiki/Indonesia). It was founded by a [Minangkabau](/wiki/Minangkabau_people) leader named Sutan Balun, more famously known as Dato Perpatih Nan Sebatang. In [Malaysia](/wiki/Malaysia), Adat Perpatih is a combination of practices and rules of life for the [Minangkabau people](/wiki/Minangkabau_people) and other aborigines such as [Semang](/wiki/Semang), the [Temuan people](/wiki/Temuan_people), the Bersisi people and the [Jakun people](/wiki/Jakun_people), who were mainly farmers at that time. Over time, this custom has been practiced by many other ethnic groups, especially in [Negeri Sembilan](/wiki/Negeri_Sembilan), including part of [Malacca](/wiki/Malacca), in particular of [Masjid Tanah](/wiki/Masjid_Tanah), and part of [Johor](/wiki/Johor). ## Negeri Sembilan customs The system practices [democracy](/wiki/Democracy) in electing [chiefs](/wiki/Tribal_chief) and a [king](/wiki/King). Only men are eligible to be elected as leaders of their clan or tribe, while only women serve as leaders within the household, a role known as Ibu Soko. Their culture is [matrilineal](/wiki/Matrilineal), with property and land passed down exclusively from mother to daughter, while religious and political affairs are the responsibility of men. The ancestral land is guarded by male clan leaders and chieftains. An Adat Perpatih woman cannot sell the land or transfer it to her sons or any other men. If she has no daughters, she may pass the land to her granddaughters through her sons by adopting them into her clan and tribe, a process formalized in a ceremony called berkedim. Property or land acquired by a man is not included under this custom, although he may voluntarily add it to the ancestral inheritance. This custom is protected by the king. The monarchy is an [elective monarchy](/wiki/Elective_monarchy), unlike most others worldwide, and the royal families are [patrilineal](/wiki/Patrilineal). There is no exact date recorded when this custom created. But the custom was brought to the [Malay Peninsula](/wiki/Malay_Peninsula) (Peninsular Malaysia) by Minangkabau nomads in 14th century. This custom might have existed since 3000–4000 years ago based on its similarity with the [Oceanian](/wiki/Oceanian) people especially the [Polynesian people](/wiki/Polynesia#Culture) who like the Minangkabau also speak [Malayo-Polynesian languages](/wiki/Malayo-Polynesian_languages). This custom is also practised by the [Comorian](/wiki/Comoros#Kinship_and_Social_Structure) when the [Malayo-Polynesian](/wiki/Malayo-Polynesian) migrated to [Africa](/wiki/Africa) 2000 years ago. Adat perpatih is similar to [Oceanian](/wiki/Oceanian) matrilineal inheritance in the sense that both systems practise [inalienable possessions](/wiki/Inalienable_possessions). However the monarchy system is different. The [Palauan king and queen](/wiki/Palau#Culture) are brother and sister and each has their own spouses. ## Lareh Bodi Caniago (West Sumatra) **This section is empty.** You can help by adding to it. *Find sources:* \"search keywords\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(April 2023)* - [Minangkabau culture](/wiki/Minangkabau_culture) - [Culture of Indonesia](/wiki/Culture_of_Indonesia) - [Adat](/wiki/Adat)\n",
  "language": "en",
  "processed_at": "2026-01-12T09:50:59.240701",
  "title": "Adat perpatih",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Adat_perpatih"
}