{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:50:56.356439"
  },
  "content": "Customary law in Muslim regions **Adat** ([Arabic](/wiki/Arabic_language): عادات; [Lezgian](/wiki/Lezgian_language): Адат; [Chechen](/wiki/Chechen_language): Адат; [Avar](/wiki/Avar_language): Адат; [Malay](/wiki/Malay_language): عادت; [Chagatay](/wiki/Chagatay_language): ئادەت; [Urdu](/wiki/Urdu_language): عادت; [Pashto](/wiki/Pashto_language): عادت; [Serbian](/wiki/Serbian_language): адет *adet*) is a generic term derived from [Arabic](/wiki/Arabic_language) to describe a variety of [local customary practices](/wiki/Convention_(norm)) and traditions deemed compatible with Islam as observed by Muslim communities in the [Balkans](/wiki/Balkans), [North Caucasus](/wiki/North_Caucasus), [Central Asia](/wiki/Central_Asia), and [Southeast Asia](/wiki/Southeast_Asia). Despite its Arabic origin, the term adat resonates deeply throughout [Maritime Southeast Asia](/wiki/Maritime_Southeast_Asia), where due to colonial influence, its usage has been systematically institutionalised into various non-Muslim communities. Within the region, the term refers, in a broader sense, to the customary norms, rules, interdictions, and [injunctions](/wiki/Injunction) that guide individuals' conduct as members of the community and the sanctions and forms of address by which these norms and rules are upheld. Adat also includes the set of local and traditional laws and [dispute resolution](/wiki/Dispute_resolution) systems by which these societies are regulated. ## Origin The word *adat* is derived from the [Arabic](/wiki/Arabic) *ʿādā́t* (عادات), the plural form of *ʿā́da* (عادَة), meaning custom, or habit, and is considered synonymous with *[urf](/wiki/Urf)* (عرف), something which is commonly known or accepted. It generally refers to the result of long-standing convention, either deliberately adopted or the result of unconscious adaptation to circumstances, that has been followed where practical considerations have been uppermost. Prior to the arrival of Islam, the peoples of the [North Caucasus](/wiki/North_Caucasus) and [Central Asia](/wiki/Central_Asia) had long-established codes of legal and civil law, which in the Islamic period came to be known by the term *adat*. Adat in traditional Central Asian societies are guided by authoritative members of communities, usually councils of [Aqsaqals](/wiki/Aqsaqal). It is based on a tribal code of conduct and on centuries of experience in conflict resolution between individuals, communities, and tribes. In the North Caucasus, the traditional value codex of adat held that the [Teip](/wiki/Teip) ('clan') was the chief reference for loyalty, honor, shame, and collective responsibility. The [Russian Empire](/wiki/Russian_Empire)'s colonial administration did not interfere with local legal practices and delegated the administration at the local community level to the councils of aqsaqals and teips, as did the [Bolsheviks](/wiki/Bolsheviks) during the first years of the [revolution of 1917](/wiki/Russian_Revolution). The adat was practiced among the Central Asians and North Caucasians up until the early 1930s, before Soviet authorities banned its use and replaced it with civil law. In [Southeast Asia](/wiki/Southeast_Asia), the concept of adat and its meanings were first formulated in the Islamised [Malay-speaking world](/wiki/Malay_world), apparently to distinguish non-Islamic from Islamic practices. In the fifteenth century, the [Melaka](/wiki/Melaka_Sultanate) empire developed a code of international shipping law, *[Undang-Undang Laut Melaka](/wiki/Undang-Undang_Laut_Melaka)*, and a civil and commercial code, *[Undang-Undang Melaka](/wiki/Undang-Undang_Melaka)*, which was heavily Islamic but with extensive adat influences. These codes would later spread across the region and become the legal source for local jurisprudence in major regional sultanates like [Brunei](/wiki/Brunei_Sultanate), [Johor](/wiki/Johor_Sultanate), [Pattani](/wiki/Pattani_kingdom), and [Aceh](/wiki/Aceh_Sultanate). In the early decades of the twentieth century, in the [Dutch East Indies](/wiki/Dutch_East_Indies), the study of adat emerged as a specialised field of inquiry. Although associated with the needs of colonial administration, this study nevertheless gave rise to an active scholarly discipline that dealt with differing systems of adat comparatively. Among notable scholars in this study were [Cornelis van Vollenhoven](/wiki/Cornelis_van_Vollenhoven), Ter Haar, and [Christiaan Snouck Hurgronje](/wiki/Christiaan_Snouck_Hurgronje). Several key concepts that are still being used today within the customary law research in modern Indonesia are: *adatrecht* ('adat law'), *adatrechtskringen* ('adat law circles'), *beschikkingsrecht* (communal rights over land or 'right to avail'), and *adatrechtsgemeenschappen* ('adat law communities'). The adat law or adatrecht has been used by colonial governments as a legal term designating a prescriptive right, which was given currency as an independent legal entity apart from the [canon law](/wiki/Canon_law). Local indigenous laws and customs of all ethnic groups, including those of non-Muslims, began to be collectively termed as \"adat\" and were encoded into units of jural management, whereby legal pluralism in the East Indies was introduced. Under this scheme, based on a classification of adat systems as cultural geographic units, the Dutch divided the East Indies into at least nineteen adat law areas. ## Modern usage Adat is still enforced in the courts of Brunei, Malaysia, and Indonesia as personal law in certain aspects. In Malaysia, each state's constitution has empowered [Malay rulers](/wiki/Malay_rulers) as the head of Islam and Malay customs in their respective state. State councils known as *Majlis Agama Islam dan Adat Istiadat Melayu* (Council of Islam and Malay Customs) are responsible in advising the rulers as well as regulating both Islamic affairs and adat. Legal proceedings on matters related to Islamic affairs and adat (such as *harta sepencarian* or 'matrimonial property' cases) are carried out in [Syariah Court](/wiki/Syariah_Court). In [Sarawak](/wiki/Sarawak) and [Sabah](/wiki/Sabah), native adat laws of non-Malay indigenous communities were institutionalised through the establishment of courts known as *Mahkamah Bumiputera* ('[Bumiputra](/wiki/Bumiputra) courts') and *Mahkamah Anak Negeri* ('native courts'), respectively. A parallel system exists in [Peninsular Malaysia](/wiki/Peninsular_Malaysia) for ethnic Malays, called *Mahkamah Penghulu* ([Penghulu](/wiki/Penghulu)'s courts—[Mukim](/wiki/Mukim) headman courts) but with very limited jurisdiction. In Indonesia, adat rules are still of legal relevance in some areas, especially in most [Hindu](/wiki/Hindu) villages in [Bali](/wiki/Bali), the [Tenger area](/wiki/Tenggerese_people), and in the regions of [Yogyakarta](/wiki/Yogyakarta) and [Surakarta](/wiki/Surakarta). Following the [dissolution of the Soviet Union](/wiki/Dissolution_of_the_Soviet_Union), adat practices in Central Asia began to be resurrected in the 1990s among rural communities. This was largely due to a decay of legal and law-enforcement institutions in many parts of the region. Legal constitutions also contributed to this process, since they empowered some traditional institutions, such as councils of elders (aqsaqals), with some administrative authorities. In the North Caucasus, traditional, clan-based systems of self-government, which had been functioning underground since the 1950s, began to reappear in response to the federal government's neglect and local administrative impotence. Due to the loss of Islamic scholars and literature during the Stalinist years, the adat that emerged contained almost no elements of Islamic law. However, there is growing participation by Muslim scholars in adat proceedings, some of whom are now involved in important decisions in village assemblies and district administrations. ## Malay culture In the [Malay states](/wiki/Malay_states) of Southeast Asia, the Malay community may be classified formally and historically into two different groups: one following *[Adat temenggung](/wiki/Adat_temenggung)* and the other, *[Adat perpatih](/wiki/Adat_perpatih)*. *Adat temenggung* (customs or rules of [Temenggung](/wiki/Temenggung)) is the most common form of adat, which is [patrilineal](/wiki/Patrilineal) and more pervasive, and it can be found in the majority of Malay states. *Adat perpatih*, confined almost exclusively to [Negeri Sembilan](/wiki/Negeri_Sembilan), where dwell the descendants of the [Minangkabau](/wiki/Minangkabau_people) immigrants from [West Sumatra](/wiki/West_Sumatra), is associated with a [matrilineal](/wiki/Matrilineal) rule of descent and a political structure based upon the kinship system. Though both adat originated from tribal organizations in the past, it is in *Adat perpatih* that the remnants of tribal structure are clearly evident at present. To cite one instance, marriage between two persons belonging to the same clan is regarded as [incestuous](/wiki/Incestuous) and is strictly prohibited. The major concern with adat, both *temenggung* and *perpatih*, in the research and literature, has been with so-called undang-undang adat law, or [customary law](/wiki/Customary_law), or the definition of rights to property, rank, and other privileges in traditional Malay society. Studies of adat law have chiefly been preoccupied with the questions of its relationship to Islamic ([Sharia](/wiki/Sharia)) law and the legal cases to which such conflicts have given rise. In Malay culture, there are at least five different perspectives of adat: - ***Adatullah*** (عادت الله) – the absolute form of adat that refers to natural order created by Allah: the sun rises in the east and sets in the west. *Adatullah* may also refer to any practice that is almost absolutely based on [ahkam](/wiki/Ahkam) and the rules of Islam, like the concept of [musyawarah](/wiki/Musyawarah) (discussion) and muafakat (consensus) applied in the Malay kingship system. - ***Adat muhakamah*** (عادت محكمة) – the term refers to traditional laws, commandments, and orders compiled into legal codes by rulers to maintain social order and harmony. The adat laws, often blended together with Islamic laws, were the main written legal reference for Malay societies since the classical era and commonly referred to as *kanun*. The earliest example of *adat muhakamah* is the [Terengganu Inscription Stone](/wiki/Terengganu_Inscription_Stone) (1303), which contains a proclamation issued by the \"Sri Paduka Tuan\" of Terengganu, urging his subjects to extend and uphold Islam and providing ten basic laws for their guidance. Other notable Malay legal codes are *[Hukum Kanun Melaka](/wiki/Undang-Undang_Melaka)* (\"Laws of [Melaka](/wiki/Melaka_Sultanate)\"), *[Hukum Kanun Pahang](/wiki/Hukum_Kanun_Pahang)* (\"Laws of [Pahang](/wiki/Pahang)\"), *Undang-Undang Sembilan Puluh Sembilan* (\"99 Laws\") of [Perak](/wiki/Perak), *Hukum Kanun Brunei* (Laws of [Brunei](/wiki/Brunei_Sultanate)), and many others. - ***Adatunnah*** (عادتنه) – also commonly known as *resam* (norms), *adatunnah* is a form of adat derived from social norms that are perceived as having good moral values and do not go against either *adatullah* or *adat muhakamah*. Examples include [gotong royong](/wiki/Gotong_royong), organizing of rumah terbuka (a form of social event traditionally held at home during festive seasons, where well-wishers are received and which everyone, regardless of background, is invited to attend), and learning of the Malay martial art [Silat](/wiki/Silat_Melayu). - ***Adat istiadat*** (عادت إستعادت) – defined as rituals mainly performed during festive celebrations and formal ceremonies, such as the installation of [Malay rulers](/wiki/Malay_rulers). The purpose of these rituals is to prescribe proper etiquette, with the means of glorifying the celebrations and ceremonies. - ***Adat nenek moyang*** – refers to *adat istiadat* (rituals), practices derived from pre-Islamic elements that some scholars think are against the teachings of Islam. Although Islam has been deeply rooted in the life of Malay society for hundreds of years, many practices of *adat nenek moyang* have prevailed. Continuous efforts have been made by the [ulama](/wiki/Ulama) and community leaders to promote the discontinuation of such practices as *perayaan mandi safar* ([safar](/wiki/Safar) bath festival) and *tepung tawar* (plain flour ritual) when one enters a new house in Malaysia. However, among the Malays of Indonesia, the ulama supports such practices and believe that they do not go against the teachings of Islam. - [Urf](/wiki/Urf) ## Bibliography - Abazov, Rafis (2005), *Historical Dictionary of Turkmenistan (Historical Dictionaries of Asia, Oceania, and the Middle East)*, Scarecrow Press, [ISBN](/wiki/ISBN_(identifier)) 978-0-8108-5362-1 - Abdul Ghoffir Muhaimin (2011), *The Islamic Traditions of Cirebon: Ibadat and Adat Among Javanese Muslims*, Australian National University E-Press, [ISBN](/wiki/ISBN_(identifier)) 978-1-920942-30-4 - Amineh, Mehdi Parvizi (2010), *State, Society and International Relations in Asia*, Amsterdam University Press, [ISBN](/wiki/ISBN_(identifier)) 978-90-5356-794-4 - Buxbaum, David C. (1968), *Family Law and Customary Law in Asia:A Contemporary Legal Perspective*, Springer, [ISBN](/wiki/ISBN_(identifier)) 978-90-247-0348-7 - Cohen-Mor, Dalya (2001), *A Matter of Fate: The Concept of Fate in the Arab World as Reflected in Modern Arabic Literature*, Oxford University Press, [ASIN](/wiki/ASIN_(identifier)) B001AU68DW - Fauzia, Amelia (2013), *Faith and the State: A History of Islamic Philanthropy in Indonesia*, BRILL, [ISBN](/wiki/ISBN_(identifier)) 978-90-04-23397-3 - Hauser Schäublin, Brigitta (2013), *Adat and Indigeneity in Indonesia - Culture and Entitlements between Heteronomy and Self-Ascription*, Goettingen University Press, [ISBN](/wiki/ISBN_(identifier)) 978-3-86395-132-0 - Keanne, Webb (1997), *Signs of Recognition: Powers and Hazards of Representation in an Indonesian Society*, University of California Press, [ASIN](/wiki/ASIN_(identifier)) B003WOKXPS - Levinson, David et al. eds. *The Encyclopedia of Modern Asia* (6 vol Thomson-Gale, 2002) 1:11–17, on Malaysia. - Muhammad Ismail (2013), *Adat Melayu (Malay Adat)*, Persatuan Ilmuan Melayu Malaysia (Association of Malaysian Malay scholars), archived from the original on 13 December 2014 - Nagata, Judith Ann (1974), \"Adat in the City: Some Perceptions and Practices Among Urban Malays\", *Bijdragen tot de Taal-, Land- en Volkenkunde*, **130**: 91–109, [doi](/wiki/Doi_(identifier)):10.1163/22134379-90002708 - Ooi, Keat Gin (2004), *Southeast Asia: a historical encyclopedia, from Angkor Wat to East Timor*, ABC-CLIO, [ISBN](/wiki/ISBN_(identifier)) 1-57607-770-5 - Peletz, Michæl Gates (1992), *A Share of the Harvest: Kinship, Property and Social History Among the Malays of Rembau*, University of California Press, [ISBN](/wiki/ISBN_(identifier)) 978-0-520-08086-7 - Richmond, Walter Comins (2004), *Legal Pluralism in The Northwest Caucasus: The Role of Sharia Courts*, Carfax Publishing - Tengku Anuar Bin Tengku Dalam (1997), *Asas-Asas Kenegaraan Malaysia (The Principles of Malaysia's Nationhood)*, Al-Azim Press, [ISBN](/wiki/ISBN_(identifier)) 978-983-038-038-4 - Tsing, Anna Lowenhaupt; Abraham, Itty (2009), *Words in Motion: Toward a Global Lexicon*, Duke University Press Books, [ASIN](/wiki/ASIN_(identifier)) B00EHNZP7O - Zurcher, Christoph (2007), *The Post-Soviet Wars: Rebellion, Ethnic Conflict, and Nationhood in the Caucasus*, NYU Press, [ISBN](/wiki/ISBN_(identifier)) 978-0-8147-9709-9 - Paper on Adat\n",
  "language": "en",
  "processed_at": "2026-01-12T09:50:56.355967",
  "title": "Adat",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Adat"
}