{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:51:01.000226"
  },
  "content": "* *Additional Housing Grant** ([abbrev](/wiki/List_of_Singapore_abbreviations): **AHG**) was an additional subsidy over and above the regular market subsidy and [Central Provident Fund](/wiki/Central_Provident_Fund) Housing Grant that new and resale [Housing and Development Board](/wiki/Housing_and_Development_Board) flat buyers in Singapore can enjoy. It offsets the purchase price of a new or resale [HDB](/wiki/Housing_and_Development_Board) flat in Singapore, thereby reducing the housing loan a flat buyer needs to take. It was replaced by the Enhanced CPF Housing Grants in 2019. ## History The AHG was first introduced on 3 March 2006 to help lower-income citizen families buy their first [HDB](/wiki/Housing_and_Development_Board) flat. Under the AHG, households earning below the monthly income ceiling can qualify for an additional subsidy (refer table). The AHG has since undergone two enhancements. The first was in Aug 2007, and the second enhancement was on 6 February 2009. The increase in income ceiling from S$4,000 to S$5,000 increases the coverage of the AHG from 50 to 60 percent of resident households. In addition, the condition of continuous employment preceding the flat application is reduced from two years to one year. In September 2019, AHG was replaced by the Enhanced CPF Housing Grants. ## Scheme The AHG will only be given once to each eligible family. As with the current scheme, the enhanced grant is given to Singapore Citizen only (not Singapore Permanent Residence spouse or an undischarged bankrupt), and can only be used as capital payment for the flat purchase. The balance, if any, must be used to reduce the mortgage loan before a housing loan from [HDB](/wiki/Housing_and_Development_Board) can be granted. In addition to the current eligibility conditions to buy a new flat and the conditions of income ceiling and continuous employment, the family will have also to meet certain eligibility conditions, such as fulfilling a family nucleus, received any housing subsidies via various schemes and being not an undischarged bankrupt, to apply for the AHG.\n",
  "language": "en",
  "processed_at": "2026-01-12T09:51:00.999724",
  "title": "Additional CPF Housing Grant",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Additional_CPF_Housing_Grant"
}