{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:51:02.587109"
  },
  "content": "Singaporean guitarist **Addy *Cradle* Rasidi**, born in 1975, is a popular [Singaporean](/wiki/Singapore) [guitarist](/wiki/Guitar). ## Background ADDY began playing the guitar at the age of 10, and recorded his first album with the Singapore band *Teacher's Pet* ([Warner Music](/wiki/Warner_Music)) at 16, then *[Cradle](/wiki/Cradle_(band))* ([EMI](/wiki/EMI)) two years later. With the release of his first solo album, *Rahsia*, in 2003, he won the APM award for Best New Solo Artiste in 2004. In 2006, ADDY received the Compass Awards for Best Top Local Malay Pop Song (Mengapa Berdusta), for composer and lyricist. ADDY revived his band, *[Cradle](/wiki/Cradle_(band))*, in early 2007. They recorded an album, CERITERA AWAN, and it was released in September 2007. One of the songs, CERITERA AWAN, was chosen to be compiled in SINGAPORE MIDEM 2008 CD. [AYU](/wiki/AYU) from the album CERITERA AWAN won Best Song Of The Year 2008 at the Anugerah Planet Muzik Awards and CERITERA AWAN won Best Album Of The Year 2008 at the Anugerah Planet Muzik Awards 2008, ADDY recorded and released his first Guitar Instrumental Album [DIVINE](/wiki/DIVINE). ADDY, born and bred in Singapore, is the first artiste to be endorsed by IBANEZ and [DiMarzio](/wiki/DiMarzio) in Singapore. He is also endorsed by SWEE LEE Music Company. ADDY is known as [Addy Cradle](/wiki/Addy_Cradle) and Addy Rasidi. ADDY is a guitarist, singer, songwriter, composer, producer, sessionist and teacher. ADDY has his own recording studio called [EDENINC] where he does most of his work. ## Career In 2003, his album *Rahsia* was released on the MusicZone label. His third album *Transcendence - Legend Of Ryu Wuri* was released in 2017. The album came with a booklet which was an Asian folklore inspired. fantasy story. IT brought attention to him as a science fiction writer. ## Other artists and session work He provided guitar on most of the tracks for Shirlyn Tan's album, *Newfound Jealousy*. He also was the arranger on some of the tracks. ## Further info http://www.dimarzio.com/#/players/ & https://web.archive.org/web/20080518021358/http://www.ibanez.co.jp/artist/ibanez_artist_list.php?CATEGORY_ID=1 & https://web.archive.org/web/20091218082741/http://www.sweelee.com.sg/Artist_Addy2.htm http://www.myspace.com/addycradle http://www.myspace.com/cradle7 - Addy Cradle at [MySpace](/wiki/MySpace) This article about a Singaporean musician is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T09:51:02.586666",
  "title": "Addy Rasidi",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Addy_Rasidi"
}