{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:51:06.272564"
  },
  "content": "Subzone of Sembawang Planning Area in Singapore **Admiralty** is a subzone of the planning area of [Sembawang](/wiki/Sembawang), in the north of [Singapore](/wiki/Singapore). ## Overview The Admiralty area contains integrated development plans including Kampung Admiralty, which was launched in April 2014. The community centre for the neighbourhood, named \"ACE The Place Community Club\", is located at 120 Woodlands Avenue 1 near [Woodlands South MRT station](/wiki/Woodlands_South_MRT_station). It was officially opened on 2 March that year, replacing a void deck space at Block 547, Woodlands Drive 16 which had been in use since 2003. ## Etymology This name \"Admiralty\" reflects the area's association with the large British Naval Base (in the [Sembawang](/wiki/Sembawang) area) that was established between 1923 and 1941. Given that the residence of the Rear Admiral of the British Navy was located in this area, the road name probably reflects the Naval High Command. When the British began the construction of the Naval Base they laid out and developed Admiralty Road in 1923 which ran through the Naval Base area. The base was the key British installation in the region and was projected as the Asian bastion of the [British Empire](/wiki/British_Empire) between the world wars. The base lacked land-based defences which contributed towards the [fall of Singapore](/wiki/Fall_of_Singapore) in 1942 during the [Second World War](/wiki/Second_World_War). The British Prime Minister [Winston Churchill](/wiki/Winston_Churchill), who authorised removal of the covering garrison in [British Malaya](/wiki/British_Malaya) as [First Lord of the Admiralty](/wiki/First_Lord_of_the_Admiralty), recognised his error, stating \"I ought to have known, and I ought to have asked about this matter, amid the thousands of questions I put, was that the possibility of Singapore having no landward defenses no more entered my mind than that of a battleship being launched without a bottom\". ## Transportation Admiralty is connected to [Sembawang](/wiki/Sembawang) and [Yishun](/wiki/Yishun) via Gambas Avenue, the Woodlands and Senoko Industrial Parks via Woodlands Avenue 10, Central [Woodlands](/wiki/Woodlands,_Singapore) via Woodlands Avenue 7, [Marsiling](/wiki/Marsiling) via Woodlands Avenue 3 and Woodlands Square, and the Central Expressway via Woodlands Avenue 12. The district is also served by [Admiralty station](/wiki/Admiralty_MRT_station) on the [North-South Line](/wiki/North%E2%80%93South_Line_(Singapore)).\n",
  "language": "en",
  "processed_at": "2026-01-12T09:51:06.272073",
  "title": "Admiralty, Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Admiralty,_Singapore"
}