{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:51:10.588352"
  },
  "content": "Auxiliary police force in Singapore**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Aetos Security Management\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(December 2013)* *(Learn how and when to remove this message)* **A major contributor to this article appears to have a close connection with its subject.** It may require cleanup to comply with Wikipedia's content policies, particularly neutral point of view. Please discuss further on the talk page. *(July 2024)* *(Learn how and when to remove this message)*This article contains wording that **promotes the subject in a subjective manner without imparting real information**. Please remove or replace such wording and instead of making proclamations about a subject's importance, use facts and attribution to demonstrate that importance. *(April 2025)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* **AETOS Holdings**, a member of the [Surbana Jurong](/wiki/Surbana_Jurong) Group, is a security solutions provider based in [Singapore](/wiki/Singapore). It was established on 31 March 2004, following the merge of the three Auxiliary Police Forces. ## History ### Origins and organizational landmarks AETOS was established on 31 March 2004. Since its inception, it has merged the [Auxiliary Police](/wiki/Auxiliary_Police) Forces of CIAS ([Changi International Airport Services](/wiki/Changi_International_Airport_Services)), PSA Corporation, and ST Kinetics, following an amalgamation exercise initiated by Temasek Holdings. In 2009, AETOS secured the contract for the [Marina Bay](/wiki/Marina_Bay_Sands) Countdown Celebration event. On 13 October 2016, AETOS was acquired by Surbana Jurong, a Singaporean government-owned consultancy focused on infrastructure and urban development. On 26 January 2018, the company inaugurated its current headquarters at 5 Corporation Drive in Singapore. ### Operational history In 2007, AETOS participated in a joint security exercise at the Brani Container alongside [PSA](/wiki/PSA_International) Singapore Terminals, the [Singapore Police Force](/wiki/Singapore_Police_Force), and the [Ministry of Defence](/wiki/Ministry_of_defence), at the Brani Container Terminal, to simulate a security situation at the terminal. In 2016, facing recruitment challenges among Malaysian and Singaporean nationals, AETOS recruited Taiwanese nationals willing to work in Singapore. In 2018, some of the Taiwanese nationals were deployed to work at land checkpoints alongside Singaporeans. According to reports from [Radio Taiwan International](/wiki/Radio_Taiwan_International), some Taiwanese nationals reported challenges in continuing their work due to stress associated with their assigned job posts. In January 2018, AETOS announced the opening of its [Jurong West](/wiki/Jurong_West) office, which included a new command centre, indoor shooting ranges, and a cash processing centre. In September 2019, AETOS signed a teaming agreement with TRD Singapore to provide countermeasure services against UAVs in Singapore. In November 2019, AETOS signed an agreement with COSEM Safety & Security Services to provide integrated security and safety consultancy services. ### Crises and controversies In June 2017, the [Singapore Police Force](/wiki/Singapore_Police_Force) (SPF) announced the arrest of two AETOS officers stationed at the [Woodlands Checkpoint](/wiki/Woodlands_Checkpoint) for planning to travel to the [Middle East](/wiki/Middle_East) and join [ISIS](/wiki/Islamic_State). In September 2018, AETOS initiated an investigation into an AETOS officer who was reported to be sleeping while on guard duty. In January 2019, SPF officers had found an AETOS officer, who had been stationed at the Woodlands Checkpoint, dead with a gunshot wound to the head. On 15 April 2021, an AETOS officer was arrested for allegedly robbing a moneylender with a [Taurus Model 85 revolver](/wiki/Taurus_Model_85) he was found to have taken illegally when reporting for work. ## Company In 2006, AETOS Security Management established two subsidiaries, AETOS Security Consultants and AETOS Security Training and Consultancy, to support its unarmed security operations as well as its training and consultancy services. In 2015, AETOS was restructured and renamed AETOS Holdings Pte Ltd, comprising four subsidiaries: AETOS Security Management Pte Ltd (auxiliary police force), AETOS Guard Services (unarmed security officers), AETOS Training Academy, and AETOS Technology and Solutions. ### CSR activities From 1 April 2018 through 31 March 2019, the company was listed as a donor for [Esplanade – Theatres on the Bay](/wiki/Esplanade_%E2%80%93_Theatres_on_the_Bay). ### Personnel The first general manager was Andrew Tan (2004–2005). He was followed by Kelvin Tan (2005–2008). This position was re-designated as executive director in 2008 when Chua Chin Kiat took over. James Tan Chan Seng, the former Commissioner of the [Singapore Civil Defence Force](/wiki/Singapore_Civil_Defence_Force), served as the CEO from 2011 to 2019. On 27 March 2019, Alfred Fox was appointed CEO, with a start date of 16 April 2019. Quek Poh Huat, who oversaw AETOS' formation when the [PSA Corporation](/wiki/PSA_International), [ST Kinetics](/wiki/ST_Kinetics), and [Changi International Airport Services](/wiki/Dnata_Singapore) auxiliary police forces were integrated, stepped down as chairman on the same date and was replaced by [Chiang Chie Foo](/wiki/Chiang_Chie_Foo). On 1 May 2024, Jerry See was appointed as its new Senior Executive Director. See was succeeded by Alfred Fox, who assumed the role of Chief People and Culture Officer at SJ Group. #### Requirements Prospective candidates must pass background checks before participating in a seven-week residential training programme. Candidates with law enforcement experience participate in a three-week residential training programme. ### Training Until the opening of the Jurong West Office in 2018, prospective AETOS recruits conducted shooting practice at the [Old Police Academy](/wiki/Old_Police_Academy,_Singapore). ## Organization structure The AETOS team is composed of officers from the police force, military, and public service entities. AETOS' armed and unarmed officers are deployed to secure Singapore's airports, ports, key and strategic installations, as well as regional and local businesses and events. They also provide security services for events such as the Marina Bay Singapore Countdown, [Singapore Grand Prix](/wiki/Singapore_Grand_Prix), [Singapore Airshow](/wiki/Singapore_Airshow) and the [2015 Southeast Asian Games](/wiki/2015_Southeast_Asian_Games). ## Deployments Some deployment sites of armed and unarmed AETOS Security professionals include: - [PSA Corporation](/wiki/PSA_Corporation) - [Immigration & Checkpoints Authority](/wiki/Immigration_%26_Checkpoints_Authority) - [Esplanade - Theatres on the Bay](/wiki/Esplanade_-_Theatres_on_the_Bay) - [Singapore Cruise Centre](/wiki/Singapore_Cruise_Centre) - [Tanah Merah Ferry Terminal](/wiki/Tanah_Merah_Ferry_Terminal) - [Police Cantonment Complex](/wiki/Police_Cantonment_Complex) - [Singapore Changi Airport](/wiki/Singapore_Changi_Airport) (providing part of the airside services) - [Woodlands Checkpoint](/wiki/Johor%E2%80%93Singapore_Causeway) - Jurong Island Checkpoint - [Tan Tock Seng Hospital](/wiki/Tan_Tock_Seng_Hospital) - [Changi Prison](/wiki/Changi_Prison) - [Institute of Mental Health (Singapore)](/wiki/Institute_of_Mental_Health_(Singapore)) ### Events Major events secured by armed and unarmed AETOS Security professionals include: - Marina Bay Countdown Celebration - [Chingay Parade](/wiki/Chingay_Parade) - [Singapore F1 Grand Prix](/wiki/Singapore_Grand_Prix) - IISS Forum[*citation needed*] - [Singapore Airshow](/wiki/Singapore_Airshow) - [SEA Games 2015](/wiki/2015_SEA_Games) - [Shangri-La Dialogue](/wiki/Shangri-La_Dialogue) - [National Day Parade](/wiki/Singapore_National_Day_parade) ## Uniforms This section **does not cite any sources**. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed. *(December 2019)* *(Learn how and when to remove this message)* When AETOS was incorporated on 1 April 2004, AETOS officers continued to wear the uniforms worn by officers from the antecedent Auxiliary Police Forces, namely [Port of Singapore Authority](/wiki/Port_of_Singapore_Authority) Police (PSAP), [Singapore Technologies Kinetics](/wiki/Singapore_Technologies_Kinetics) Police (STKP) and [Changi International Airport Services](/wiki/Changi_International_Airport_Services) Police (CIASP).[*citation needed*] Under governmental direction, the uniform was modified to include distinguishing features to differentiate them from the uniforms worn by officers of the Singapore Police Force. The new uniforms featured a new corporate color, tartan blue, and the material changed from pure [polyester](/wiki/Polyester) to polyviscose. New buttons and badges on the cap and collars incorporating AETOS's logo were used in place of logos similar to the [Singapore Police Force](/wiki/Singapore_Police_Force).[*citation needed*] Owing to their former affiliation with the Singapore Police Force, AETOS officers initially wore tartan blue uniforms similar in design to those of the SPF. This similarity, dating back to the formation of the antecedent auxiliary police forces (PSA Police in 1947, STK Police in 1967, and CIAS Police in 1981), meant the general public could often not distinguish AETOS officers from regular police officers without close scrutiny; the tartan top was the primary distinguishing feature.[*citation needed*] As a result of several uniform reviews by the police and SIRD, Auxiliary Police Forces must wear uniforms with distinctive differences from those of their regular counterparts. AETOS retained the old metallic cap badges and collar lapels, while they were replaced with embroidered versions in the SPF. AETOS officers may also wear box caps, depending on operational requirements.[*citation needed*] ### Bibliography - Khurana, K.C. (31 December 2009). *Aviation Management: Global Perspectives*. New Delhi, India: Global India Publications. [ISBN](/wiki/ISBN_(identifier)) 978-9380228396. 1°19′49.26″N 103°50′11.84″E﻿ / ﻿1.3303500°N 103.8366222°E﻿ / 1.3303500; 103.8366222\n",
  "language": "en",
  "processed_at": "2026-01-12T09:51:10.587882",
  "title": "Aetos Security Management",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Aetos_Security_Management"
}