{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:51:12.262510"
  },
  "content": "Australian-based computer hardware company **A major contributor to this article appears to have a close connection with its subject.** It may require cleanup to comply with Wikipedia's content policies, particularly neutral point of view. Please discuss further on the talk page. *(March 2025)* *(Learn how and when to remove this message)* **Aftershock PC** is a [gaming computer](/wiki/Gaming_computer) manufacturer specialising in [gaming computers](/wiki/Gaming_computers) and systems. It is dual headquartered in [Singapore](/wiki/Singapore) and [Melbourne, Australia](/wiki/Melbourne,_Australia). ## History Aftershock PC was founded in 2012 by Marcus Wee, with his twin brother Joe Wee joining in 2013. Initially specialising in [gaming laptops](/wiki/Gaming_laptop) and notebooks, it expanded its products to include [gaming desktop computers](/wiki/Gaming_desktop_computer) in November 2014. In February 2022, Aftershock PC announced Aftershock Endgame, a new headquarters in Singapore with an experiential centre, a service centre, and a production bay. The headquarters officially opened to the public on 19 February 2022 at B Central, [Singapore](/wiki/Singapore). The same month, the company launched a custom keyboard e-store and physical experience center in partnership with [Singapore](/wiki/Singapore) keyboard company Tempest. ### Expansion into Malaysia Aftershock PC first entered the [Malaysian](/wiki/Malaysia) market in December 2014, and later re-entered in February 2018 under a new brand called Level51 PC, with support from Taiwanese laptop manufacturer [Clevo](/wiki/Clevo). The company introduced its products to the Malaysian market and opened its first showroom in [Sunway City](/wiki/Sunway_City). It later partnered with [Secretlab](/wiki/Secretlab), a long-time collaborator, to offer an in-store experience for its gaming chairs at Level51's showroom. In August 2022, Level51 PC rebranded to Aftershock PC to align its branding with Aftershock PC’s operations in Singapore and Australia. The rebrand was officially unveiled at Malaysia's IT Fair from August 26 to 28. ### Expansion into Australia In August 2018, Aftershock PC launched in [Australia](/wiki/Australia), opening its first showroom in [St Kilda, Melbourne](/wiki/St_Kilda,_Melbourne). In July 2021, the company opened a new 40,000 sqft headquarters in [Melbourne](/wiki/Melbourne). In 2023, the facility was heavily affected by flooding, resulting in a temporary disruption to operations, which were subsequently resumed. ## Products Aftershock PC manufactures a range of products including laptops, desktops, workstations, PC designs, gaming monitors, and peripheral devices such as mice and keyboards. Early models included the Titan, SM series, and Tremor. The company integrates components from major hardware suppliers such as [Intel](/wiki/Intel), [NVIDIA](/wiki/NVIDIA), and [AMD](/wiki/AMD), which continue to be used across its product lines as of 2024. Aftershock PC offers liquid-cooled desktop systems, including the Ultracore and Explorer models. Earlier versions of the Ultracore supported optional open-loop liquid cooling and customizable design elements. The Explorer model included a default open-loop cooling system with features such as hardline tubing and an open-air chassis. A 2022 version of the Ultracore was equipped with a liquid-cooled CPU and an internal layout designed for improved airflow. In the same year, the company introduced the Apex 15X EVO laptop, which featured the Glacier Core—an external liquid-cooling module. Aftershock PC released a workstation called the Horizon, a [small form factor](/wiki/Small_form_factor_PC) (SFF) desktop featuring thermal management and silent fan technology. Aftershock PC designed Bubble Tea PC, a water-cooling system that mimics the floating bobas in a bubble tea drink. At PAX Australia 2024, the company showcased Medusa gaming PC, featuring design elements inspired by ancient [Greek mythology](/wiki/Greek_mythology). Aftershock PC expanded into gaming monitors under its TECHYARD brand, offering OLED and esports-grade displays. - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T09:51:12.262136",
  "title": "Aftershock PC",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Aftershock_PC"
}