{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:51:14.525816"
  },
  "content": "Singaporean Armenian plant breeder **Ashkhen Hovakimian** (Agnes Joaquim) (b. 7 April 1854, Singapore - d. 2 July 1899, Singapore) was a [Singaporean](/wiki/Singaporean) Armenian who bred Singapore's first hybridised [orchid hybrid](/wiki/Orchideae), [*Vanda* 'Miss Joaquim'](/wiki/Vanda_%27Miss_Joaquim%27). Joaquim was inducted into the [Singapore Women's Hall of Fame](/wiki/Singapore_Women%27s_Hall_of_Fame) in 2015. ## Early life Hovakimian was the eldest daughter and second child of Parsick (Basil) Joaquim, an [Armenian](/wiki/Armenian_people) merchant and commercial agent, and Urelia Joaquim. Agnes was an avid [gardener](/wiki/Gardening) as was her mother. Besides her interest in gardening, Agnes was also an active member of the [Armenian Church](/wiki/Armenian_Apostolic_Church) and a skilled embroiderer. ## Singapore's national flower Agnes Joaquim won prizes at annual flower shows and famously won the prize for the rarest orchid at the 1899 annual flower show. The first prize was for a hybrid that was named after her, *Vanda* 'Miss Joaquim'. Already suffering from [cancer](/wiki/Cancer) at the time, she died three months after receiving this prize. In 1947, *Vanda* 'Miss Joaquim' was chosen as the most fitting emblem for the nascent Progressive Party. In 1957 it was chosen as the crest for the Malayan Orchid Society. But in April 1981, came the ultimate accolade. From a field of forty contenders, Vanda Miss Joaquim was selected as the [national flower](/wiki/Vanda_%27Miss_Joaquim%27) of Singapore. In [Tanjong Pagar](/wiki/Tanjong_Pagar), the *Vanda Miss Joaquim Pavilion* garden marks the site of Joaquim's former residence on the no longer extant Narcis Street, where the orchid was first bred. The pavilion and associated garden opened on 14 April 2002. A short distance away is the Vanda Miss Joaquim Park, located on Yan Kit Road, which \"commemorates the founder\" of the national flower, and the orchid itself. ## Family Agnes Joaquim's siblings were well known in Singapore. Narcis Street was named after her eldest brother Nerses (Narcis, born 2 December 1852). Her brothers, Joe (Joaquim, born 1 April 1856), Seth (born 11 September 1866) and John (born 17 June 1858) were well-known barristers. Joe was a founder of Braddell and Joaquim, a legal company, before founding his own firm of Joaquim Brothers. Two brothers, Arathoon (2 July 1864), followed by Simon (5 December 1867), served as Deputy Registrar of the Hackney Carriages Department. [*citation needed*] Josephine, Agnes Joaquim's grandniece, also has an orchid named after her, the *Vanda* 'Josephine' (also known as Vanda Miss Joaquim 'Josephine').[*citation needed*] Hovakimian's maternal grandfather, Isaiah Zachariah, was one of the members of Singapore's first Chamber of Commerce which met in 1837.[*citation needed*]\n",
  "language": "en",
  "processed_at": "2026-01-12T09:51:14.525389",
  "title": "Agnes Joaquim",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Agnes_Joaquim"
}