{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:51:16.316320"
  },
  "content": "Singaporean online travel agencyThis article **may lend undue weight to certain ideas, incidents, or controversies**. Please help improve it by rewriting it in a balanced fashion that contextualises different points of view. *(December 2025)* *(Learn how and when to remove this message)* **Agoda.com** is an online [travel agency](/wiki/Travel_agency) catering to customers around the world with operations in Singapore and [Bangkok](/wiki/Bangkok), Thailand. Founded by Robert Rosenstein and Michael Kenny, Agoda facilitates reservations for accommodation, flights, ground transportation, and activities. It is a subsidiary of [Booking Holdings](/wiki/Booking_Holdings). In Japan, since around 2024, reservation troubles have frequently occurred, drawing significant coverage in the [Japanese media](/wiki/Mass_media_in_Japan) and leading to calls for improvement from regulatory authorities. Agoda has faced criticism and legal actions in several countries, including Thailand, Taiwan, and Turkey, over unregistered hotel listings, misleading discounts and unfair competition practices. ## History Agoda was co-founded in 2005 by [American](/wiki/Americans) school friends Michael Kenny and Robert Rosenstein. Kenny had previously launched [Phuket](/wiki/Phuket)-based PlanetHoliday.com and PrecisionReservations.com, which were incorporated into Agoda. In 2007, Agoda was acquired by [Booking Holdings](/wiki/Booking_Holdings), formerly The Priceline Group. Agoda launched [iOS](/wiki/IOS) and [Android](/wiki/Android_(operating_system)) mobile apps in July 2011. After Booking Holdings acquired Israel-based startup Qlika in 2014, the Qlika team joined Agoda to automate and scale its marketing systems. In November 2014, the company opened a research center in [Tel Aviv](/wiki/Tel_Aviv). In May 2016, Booking Holdings acquired Taipei-based startup WooMoo, the creator of POP, a mobile app that focused on prototyping. Its team relocated to Bangkok. In May 2018, CEO and co-founder Rob Rosenstein became the chairman of Agoda and a strategic advisor to Booking Holdings. John Wroughton Brown, the COO, was promoted as the new CEO of Agoda, with Chief Product Officer [Omri Morgenshtern](/wiki/Omri_Morgenshtern), who joined the company as part of the Qlika acquisition, named as the new COO. In November 2018, Agoda launched airport transfers via a partnership with [Mozio](/wiki/Mozio). In September 2019, Agoda launched a brand refresh including a new logo, custom font, and cartoon mascots called Agojis based on the circles in the logo. In October 2019, flight bookings were introduced. In November 2019, Agoda launched B2B products including a white-label platform. In May 2020, Agoda announced the layoffs of 1,500 people due to the [COVID-19 pandemic](/wiki/COVID-19_pandemic). In June 2022, John Brown left the position of CEO, with then-Chief Product Officer Omri Morgenshtern becoming the new CEO. ## Illegal and unregistered hotels scam In April 2017, the Tourism Minister of Thailand called for Agoda among others to drop illegal and unregistered hotels. Agoda was the primary company criticized, and its success is part of what led the Ministry of Tourism & Sports to create a competitive hotel booking website. In 2018, Agoda cooperated with the Taipei City Government's request to remove illegal and unregistered Taipei hotels from its listings. In same year, Agoda faced legal action from the Turkish Travel Agencies Association due to alleged unfair competition. It faced a potential ban as part of this lawsuit. ## Misleading discount claims In October 2017, Agoda, among other hotel sites, was subject to a probe by the [Competition and Markets Authority](/wiki/Competition_and_Markets_Authority) in the United Kingdom. The probe was related to \"concerns about hidden charges, pressure selling tactics, misleading discount claims and the order in which results appear on the site pages.\" Agoda agreed to change how it operates in response to this probe. ## Non existent hotel booking fraud In December 2017, Agoda initially refused to give a refund to a customer that booked a non-existent hotel. Agoda eventually paid a refund following a fraud complaint filed with the Thai government. In 2019, Agoda was criticized for difficulties with customers removing their homes from the website. The customers cited customer service issues. In September 2025, Agoda laid off approximately 50 Singapore employees and included severance clauses prohibiting contact with government agencies or trade unions, threatening to revoke benefits if breached. Following strong condemnation from the [Ministry of Manpower](/wiki/Ministry_of_Manpower_(Singapore)) and [NTUC](/wiki/National_Trades_Union_Congress), Agoda apologized on September 19, acknowledging the clauses were \"inappropriate\". ### Surge in Booking Failures in Japan Source: On November 18, 2024, Route Inn Hotels [ja], a major hotel chain in Japan, issued a warning regarding room reservations sold through overseas booking sites such as Agoda. They noted issues such as being unable to confirm reservations, discrepancies in reservation details, and rooms being sold at significantly higher prices than those set by the hotel. On June 16, 2025, [Toyoko Inn](/wiki/Toyoko_Inn), another major hotal chain in Japan, also issued a warning on its official website, stating that some of the hotel room allocations provided to partner sites had been resold on overseas booking platforms such as Agoda, leading to problems. On June 19, [Fuji Dream Airlines](/wiki/Fuji_Dream_Airlines), Japanese regional airline, also issued a warning, reporting troubles with airline tickets purchased through Agoda, which is not a contracted travel agency. Furthermore, several issues have been reported regarding Agoda, including changing a room plan from \"one night with dinner\" to \"one night with two meals\" without the accommodation provider's consent, accepting reservations for smoking rooms at entirely non-smoking properties, and inflating accommodation fees. Other issues reported in Japanese news media include reservation information not being communicated to the accommodation provider or being transmitted incorrectly, resulting in the proper rooms not being secured; rooms being sold at significantly higher prices than the hotel's listed rates; bookings being sold as non-refundable; and reservations being canceled by Agoda just days before the scheduled stay. In response to these problems, [Japan Tourism Agency](/wiki/Japan_Tourism_Agency) (JTA) determined these actions to be breaches of obligation and issued a business improvement request to Agoda in March 2025. On June 24, 2025, Yoshiharu Hoshino, CEO of [Hoshino Resorts](/wiki/Hoshino_Resorts), posted on [Twitter](/wiki/Twitter) (X), quoting a *[Kyodo News](/wiki/Kyodo_News)* report on the JTA's improvement request to Agoda. He commented, \"Hoshino Resorts has no contract with the online travel agent AGODA, but there have been frequent cases where guests who booked through AGODA arrive and are unable to secure a room. Just recently, a guest who had booked through AGODA showed up at a hotel that was closed for maintenance. There is clearly a problem with AGODA's system\". According to an independent survey conducted by *[Nikkei](/wiki/Nikkei,_Inc.)*, about 20% of Agoda users have experienced some sort of trouble, such as \"the hotel they thought they had booked was not actually reserved\", \"their reservation was canceled without consent\", or \"the airline ticket did not match the conditions at the time of purchase\". Furthermore, about half of those who consulted Agoda about such issues were simply told to handle the matter themselves. On July 17, 2025, Agoda CEO Omri Morgenshtern issued a statement addressing the \"phantom inventory\" issue, announcing that Agoda had ceased handling inventory from specific third-party suppliers identified as the cause of the troubles. He also outlined measures such as the introduction of AI-based pre-monitoring systems and the strengthening of management systems for third-party suppliers. On the previous day, July 16, Japan Tourism Agency Commissioner Shigeki Murata stated at a press conference that the agency would continue to monitor the situation and the progress of the improvement measures. - Official website Portal: - Companies\n",
  "language": "en",
  "processed_at": "2026-01-12T09:51:16.315850",
  "title": "Agoda",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Agoda"
}