{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:51:18.993429"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Agreement between New Zealand and Singapore on a Closer Economic Partnership\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(December 2021)* *(Learn how and when to remove this message)* **The Agreement between New Zealand and Singapore on a Closer Economic Partnership** (CEP) entered into force on 1 January 2001. It is the most comprehensive [trading agreement](/wiki/Trade_agreement) that [New Zealand](/wiki/New_Zealand) has negotiated, with the exception of the [Closer Economic Relations](/wiki/Closer_Economic_Relations) agreement with [Australia](/wiki/Australia). The CEP aims to build on the close historical ties between [Singapore](/wiki/Singapore) and New Zealand by improving opportunities for trade in goods, services and investment. In September 1999, New Zealand and Singapore announced intentions to negotiate a trade agreement. The agreement was led by Philip Lewin on the New Zealand side. New Zealand PM [Helen Clark](/wiki/Helen_Clark) and PM [Goh Chok Tong](/wiki/Goh_Chok_Tong) signed the Agreement between New Zealand and Singapore on a Closer Economic Partnership (ANZSCEP), in a signing ceremony held on 14 November 2000 in Singapore. Singapore hosted the 1st Ministerial Review of the Agreement in November 2001, while New Zealand hosted the 2nd Ministerial Review of the Agreement in July 2004. The CEP is comprehensive, covering goods, services, investment and technical and hygiene/quarantine barriers to trade in goods. Over the 2 years since the agreement came into effect, Singapore's bilateral trade with New Zealand rose from $0.97 billion (2000) to S$1.09 billion (2002), an increase of 12.6%. Beyond providing improved market access, the ANZSCEP also brings economic cooperation between Singapore and New Zealand to new heights. In 2002, New Zealand set up her first overseas technology center in Singapore to support New Zealand companies in commercializing technologies and internationalizing business. This Singapore-related article is a stub. You can help Wikipedia by expanding it. - v - t - e This government of New Zealand–related article is a stub. You can help Wikipedia by expanding it. - v - t - e This article related to a [treaty](/wiki/Treaty) is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T09:51:18.992793",
  "title": "Agreement between New Zealand and Singapore on a Closer Economic Partnership",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Agreement_between_New_Zealand_and_Singapore_on_a_Closer_Economic_Partnership"
}