{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:51:26.199997"
  },
  "content": "Singaporean lawyer and first attorney-general of SingaporeThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Ahmad Mohamed Ibrahim\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(July 2023)* *(Learn how and when to remove this message)* **Ahmad bin Mohamed Ibrahim** (15 May 1916 – 17 April 1999) was a [Singaporean](/wiki/Singapore) lawyer and law professor who served as the first [Attorney-General of Singapore](/wiki/Attorney-General_of_Singapore) between 1965 and 1967. ## Early life Ahmad was educated at the Victoria Bridge School (now the [Victoria School](/wiki/Victoria_School)), [Raffles Institution](/wiki/Raffles_Institution_(Secondary)), and Raffles College (now the [National University of Singapore](/wiki/National_University_of_Singapore)). In 1936, he received the Queen's Scholarship (now the [President's Scholarship](/wiki/President%27s_Scholar)) to study at [St John's College](/wiki/St_John%27s_College,_Cambridge), [University of Cambridge](/wiki/University_of_Cambridge). He graduated in 1939 with 1st Class Economics Tripos I and 1st Class Law Tripos II, and attained a Masters in Law in 1965. He was awarded the Honorary Degree of Doctor of Laws (LL.D) from the University of Singapore on 5 June 1965. ## Career In 1948, Ahmad stood as an independent candidate in the Municipal Commission Election in Singapore and won. He became Singapore's first State Advocate General in 1959, and the nation's first non-British Attorney-General in 1966. He moved to [Malaysia](/wiki/Malaysia) in 1969. In 1972, he became the dean of the law faculty of the [University of Malaya](/wiki/University_of_Malaya). There he established the first law faculty in Malaysia. He was also later made Professor of Malaysian Law, and in 1984 [University of Malaya](/wiki/University_of_Malaya) honoured Ahmad with the highest academic title it could confer - Professor Emeritus. In 1984, Ahmad was instrumental in setting up the Kulliyyah of Laws at [International Islamic University Malaysia](/wiki/International_Islamic_University_Malaysia) (IIUM), and was made the Shaikh and the Dean of the Kulliyyah. In 2000, the Kulliyyah was named the \"Ahmad Ibrahim Kulliyyah\" in honour of Ahmad as the founding father of the Kulliyyah. Ahmad was a key individual in the merger talks between Singapore and Malaysia in the early 1960s. He was also the legal advisor in the Singapore delegation to the Malaysia Talks in London in 1963, which discussed independence from Britain. Former Singaporean deputy prime minister [Goh Keng Swee](/wiki/Goh_Keng_Swee) once described Ahmad as a man of \"tremendous breadth and depth of intellect, whose ability as a legal draftsman is unsurpassed in this country\". ## Personal life Ahmad was the brother of the actor Khalid Ibrahim, who used the stage name Cal Bellini. ## Honours - Malaysia - Commander of the [Order of Loyalty to the Crown of Malaysia](/wiki/Order_of_Loyalty_to_the_Crown_of_Malaysia#Commander) (P.S.M.) (1987) - https://web.archive.org/web/20080218160308/http://www.agc.gov.sg/aboutus/history.htm - National Library Board, Singapore. \"Tan Sri Datuk Professor Ahmad Ibrahim | Infopedia\". eresources.nlb.gov.sg. Retrieved 2014-12-27.\n",
  "language": "en",
  "processed_at": "2026-01-12T09:51:26.199548",
  "title": "Ahmad Mohamed Ibrahim",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Ahmad_Mohamed_Ibrahim"
}