{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:51:28.564958"
  },
  "content": "Industrial park in Singapore **Airport Logistics Park Singapore** (ALPS) is an [industrial park](/wiki/Industrial_park) created to support activities related to trade and [air cargo](/wiki/Air_cargo) at [Singapore Changi Airport](/wiki/Singapore_Changi_Airport). The park is a notable example of cooperation between the [government of Singapore](/wiki/Government_of_Singapore) and local business leaders to increase the business competitiveness of the country. The park is located next to the Changi Airfreight Centre. Access to the park is from Changi Coast Road. ## History The industrial park is a [free trade zone](/wiki/Free_trade_zone). The park was created in 2003 and officially opened by [Minister for Transport](/wiki/Minister_for_Transport_(Singapore)) [Yeo Cheow Tong](/wiki/Yeo_Cheow_Tong) on 20 March that year. The project was a joint venture between the [Civil Aviation Authority of Singapore](/wiki/Civil_Aviation_Authority_of_Singapore), the airport operator, and [JTC Corporation](/wiki/JTC_Corporation), the largest industrial land developer in the country. The cost of the facilities was initially [S$](/wiki/Singapore_dollar)35 million. ## Current use ### Free trade zone The logistics park is 26 [ha](/wiki/Hectare) in size. As a free trade zone, [customs](/wiki/Customs) formalities are reduced. This allows companies to trans-ship cargo to Singapore and later redistribute it to countries in the region. The proximity to the airport increases the efficiency of the process. Other logistics centres in Singapore include the Changi International LogisPark and the Banyan LogisPark. ### Companies Bax Global, B&H Worldwide, Exel, Expeditors, Menlo Worldwide, Nippon Express, UPS Supply Chain Solutions, Sandvik, SDV, Airmark Freight Services, AGI Freight, EGL Eagle Global Logistics, Geologistics, Global Airfreight Kerry Logistics, Kuehne & Nagel, KWE Kintetsu World Express, MOL Logistics, UPS Supply Chain Solutions and Schenker are among the tenants of the logistics park. Companies have publicly cited the increased warehousing and logistics benefits for relocating the park. Parts distribution for the Brazilian regional aircraft manufacturer, Embraer, is also located within the park. 1°22′30″N 104°00′14″E﻿ / ﻿1.3750173°N 104.0037703°E﻿ / 1.3750173; 104.0037703 This [Singapore](/wiki/Singapore) location article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T09:51:28.564468",
  "title": "Airport Logistics Park",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Airport_Logistics_Park"
}