{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:51:33.021869"
  },
  "content": "Consumer-electronics brand headquartered in SingaporeThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Akira\" brand – news **·** newspapers **·** books **·** scholar **·** JSTOR *(May 2025)* *(Learn how and when to remove this message)* **Akira** (or stylized **AKIRA**) is a [consumer electronics](/wiki/Consumer_electronics) brand originated and headquartered in [Singapore](/wiki/Singapore). The brand is known for its range of consumer electronics, including televisions, home appliances, and audio-visual equipment. It has a market coverage in over 60 countries in regions such as [ASEAN](/wiki/ASEAN), Africa, the Middle East, the [Commonwealth of Independent States](/wiki/Commonwealth_of_Independent_States), Russia, Eastern Europe and East Asia. ## History Akira's parent company, TT International Limited, was founded in Singapore on 1984, coming forth as a consumer electronics distributor and trading company. The company gained track from the surge of consumer demands for products with basic features at affordable prices, and expanded its distribution network. In the mid-1990s, the brand Akira was launched with twelve products. The trademark \"Akira\" was officially registered in Singapore in 1994, under **Akihabara Electric Corporation Ltd**. In the [Japanese](/wiki/Japanese_language) language, the word also signifies brightness and the morning sunshine. The brand was reorganised under **Akira International Pte Ltd.** in April 1998, prior to TT International listing on the [Singapore Exchange](/wiki/Singapore_Exchange) in June 2000. Akira entered the Russian market through [consignment](/wiki/Consignment) in 2002, with a high local demand over the quality and reliability of the equipment. This fueled the expansion of its dealer network into more than 50 cities across Russia within 2 years. Akira was listed as one of the fifteen companies recognised for its value at the Singapore Brand Awards in 2004. The brand was first listed one of the [Superbrands](/wiki/Superbrands) in the Singapore market on 10 March 2006, and was last listed for the recognition in 2016. Akira launched its European subsidiary, Akira Europe, in 2008 for expansion into the international market. ### Brand Ownership Change Akira has been heavily impacted since its parent company, TT International, followed through significant restructuring that begun in 2010, under a Scheme of Arrangement sanctioned by the [High Court of Singapore](/wiki/High_Court_of_Singapore). This favoured over judiciary management and liquidation of the financially troubled parent firm. A loan agreement was signed in bid to sustain Akira Corporation Pte Ltd on 9 December 2019, as part of a restructuring scheme was approved by the High Court of Singapore on 28 March 2019. This came after the liquidation of the failed Big Box Singapore development in September 2018. 6 April 2023, an agreement was inked for the acquisition of Akira International Pte Ltd, along with its subsidiary Akira Singapore Pte Ltd, to wholesale enterprise MSSS Pte Ltd. The acquisition was completed on 6 April 2024. Akira Corporation Pte Ltd remains under the ownership of TT International Pte Ltd. ## Products Akira offers a range of audio-visual products and home appliances for both residential and commercial customers. Its audio-visual products include LCD and [plasma TVs](/wiki/Plasma_TV), DVD and VCD players, home theatre systems, portable DVD players, and multimedia speakers. In addition, Akira provides a variety of home appliances such as air conditioners, refrigerators, washing machines, rice cookers, vacuum cleaners, and various kitchen devices, including microwave ovens, deep fryers, and toasters. The company also manufactures commercial products, including power generators and lighting systems. Akira has expanded into other categories such as telephones (corded and cordless) and private label bicycles. In the 2010s, Akira has introduced a premium product range that includes Full HD LCD TVs with motion enhancement features, energy-efficient air conditioners with inverter technology, and home appliances such as rice cookers with advanced heating elements and more efficient juicers. Akira was the first manufacturer to launch [3D Blu-ray](/wiki/Blu-ray) equipped [LED](/wiki/LED-backlit_LCD) [Smart TV](/wiki/Smart_TV) in the Singapore market. ## Partnership Akira was a sponsor of the [National Day Parade](/wiki/Singapore_National_Day_parade) in the 2000s, and was a main supporter of Swift Athletics track and field events since 2004. - [Creative Technologies](/wiki/Creative_Technologies)\n",
  "language": "en",
  "processed_at": "2026-01-12T09:51:33.021389",
  "title": "Akira (brand)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Akira_(brand)"
}