{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:51:35.471024"
  },
  "content": "Family of Arab Singaporeans of Yemeni origin The **al-Junaid family** ([Arabic](/wiki/Arabic): الجنيد) was a [Hadhrami](/wiki/Hadharem) family of merchants and traders who migrated to [Singapore](/wiki/Singapore) from [Palembang](/wiki/Palembang) in the 1820s. Setting up their business in Singapore, the family also established the oldest surviving mosque in Singapore, the [Masjid Omar Kampong Melaka](/wiki/Masjid_Omar_Kampong_Melaka) in 1820. The suburban area of [Aljunied](/wiki/Aljunied) and its adjoining MRT station is named after them. ## History The al-Junaid family were originally a family of traders and merchants who hailed from [Hadhramaut](/wiki/Hadhramaut). The family are a branch of the [Ba 'Alawi sada](/wiki/Ba_%27Alawi_sada), descendants of [Sayyid Ahmad al-Muhajir al-Uraydi al-Husayni](/wiki/Ahmad_al-Muhajir). Their business was originally based in [Palembang](/wiki/Palembang), which was under Dutch control at the time. Due to Singapore's status as a free port, the al-Junaid family found it profitable and migrated there. The patriarchs of the al-Junaid family, Syed Mohammed and [Syed Omar](/wiki/Syed_Omar_Aljunied), arrived in Singapore between 1820 and 1821. Syed Omar donated land under a [waqf](/wiki/Waqf) scheme for the construction of the [Masjid Omar Kampong Melaka](/wiki/Masjid_Omar_Kampong_Melaka), which was rebuilt by his son Syed Abdullah in 1855. Syed Omar also donated land to be used as a Muslim burial ground, now known as the [Jalan Kubor Cemetery](/wiki/Jalan_Kubor_Cemetery). The family resided in their mansion at High Street until they sold it in 1919, years after Syed Omar had died. In 1927, Syed Abdul Rahman al-Junaid, a former Justice of Peace, established a [madrasa](/wiki/Madrasa) (Islamic school) on Victoria Street, known as the [Madrasah Aljunied Al-Islamiah](/wiki/Madrasah_Aljunied_Al-Islamiah). In 1940, the family established a shophouse for textiles and fabric within Arab Street, known as *Toko Aljunied*, which still is in operation to this day. In 1994, the family and their distant relatives, the al-Saqqaf family had a dispute in court over the ownership of three shophouses near [Jalan Besar MRT station](/wiki/Jalan_Besar_MRT_station), which was eventually resolved in 2016 with the al-Saqqaf family winning the dispute in court. The early members of the family, including Syed Omar, were buried at the [Jalan Kubor Cemetery](/wiki/Jalan_Kubor_Cemetery), until their graves were exhumed in the early 2000s to be reinterred in the grounds of the [Masjid Omar Kampong Melaka](/wiki/Masjid_Omar_Kampong_Melaka). ## Legacy The [Aljunied](/wiki/Aljunied) neighbourhood and [Aljunied MRT station](/wiki/Aljunied_MRT_station) are named after this family. The oldest mosque they established, Masjid Omar Kampong Melaka, would be gazetted as a national monument of Singapore by the National Heritage Board in 2001. They are mainly remembered for their contributions to colonial early Singapore's economy and society. - [Alsagoff family](/wiki/Alsagoff_family) - [Alkaff family](/wiki/Alkaff_family) - [Arab Singaporeans](/wiki/Arab_Singaporeans) This article **needs additional or more specific categories**. Please help out by adding categories to it so that it can be listed with similar articles. *(March 2025)*\n",
  "language": "en",
  "processed_at": "2026-01-12T09:51:35.470550",
  "title": "Al-Junaid family",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Al-Junaid_family"
}