{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:51:38.607218"
  },
  "content": "Dutch economist (1910–1996) **Albert Winsemius** [PBC](/wiki/Darjah_Utama_Bakti_Cemerlang) (26 February 1910 – 4 December 1996) was a [Dutch](/wiki/Dutch_people) economist best known for serving as an economic adviser to [Singapore](/wiki/Singapore) between 1961 and 1984. He led the [United Nations](/wiki/United_Nations) Survey Mission to Singapore and played a major role in the formulation of Singapore's national economic development strategy. ## Career In 1960, Winsemius led the United Nations Expanded Programme for Technical Assistance (EPTA) team to examine Singapore's potential in industrialisation. Singapore had just attained self-government and was facing high unemployment and a growing population. Winsemius presented a ten-year development plan to transform Singapore from an [entrepot](/wiki/Entrepot) trading port to a centre of manufacturing and industrialisation. Winsemius's first emphasis was on creating jobs and attracting foreign investment. Labour-intensive industries, such as the production of shirts and pyjamas, were expanded. He also encouraged the [large-scale public housing programme](/wiki/Housing_and_Development_Board) since he believed that it would bolster the country's image, which would attract foreign investors.[*citation needed*] One of his earliest pieces of advice was not to remove the statue of [Stamford Raffles](/wiki/Stamford_Raffles), as it was a symbol of public acceptance of Singapore's British heritage and could alleviate concerns that investors have towards a new socialist government. With Winsemius's help, Singapore attracted large oil companies such as [Shell](/wiki/Royal_Dutch_Shell) and [Esso](/wiki/Esso) to establish refineries there. During his term as Chief Economic Adviser between 1961 and 1984, Winsemius worked closely with [Prime Minister](/wiki/Prime_Minister_of_Singapore) [Lee Kuan Yew](/wiki/Lee_Kuan_Yew), and key members of Lee's government such as [Goh Keng Swee](/wiki/Goh_Keng_Swee) and [Hon Sui Sen](/wiki/Hon_Sui_Sen). Later, Winesimus also had a close partnership with [Goh Chok Tong](/wiki/Goh_Chok_Tong), Lee's successor as Prime Minister. He visited Singapore two or three times a year to review economic performance indicators and to discuss macro-economic strategy with government planners. In the 1970s, Singapore was upgrading its industrial capacity to use higher technological methods, including [electronics](/wiki/Electronics). Winsemius personally went to persuade large Dutch electronics companies such as [Philips](/wiki/Philips) to set up production plants in Singapore. He also proposed for Singapore to be developed as a financial centre, as well as an international centre for air traffic and sea transport. Over the next twenty years, those predictions proved to be accurate. In 1983, Winsemius retired from his position as Singapore's economic adviser at the age of 74. He said, \"I leave with a saddened heart. It (Singapore) has become part of my life, more or less. It can do without me. It could do without me years ago. But it became part of my life. So I will shed a few tears, imaginary tears.\" ## Death Winsemius died of [pneumonia](/wiki/Pneumonia) in the Netherlands on 4 December 1996. In a letter of condolences to his family, [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) wrote, \"It was Singapore's good fortune that he [Winsemius] took a deep and personal interest in Singapore's development. Singapore and I personally are indebted to him for the time, energy and development he gave to Singapore. I am proud to have known him and to have been his friend.\" When asked about his life as an economist, Winsemius once said, \"There is quite a lot of satisfaction, perhaps not like that of, say, an architect who can look at something and say, 'I made it'. But there is that satisfaction in knowing that you have contributed to the well being of people you don't know....\"[*citation needed*] ## Personal life Winsemius married Aly Schreiber. They had a son, two daughters and eight grandchildren. Winsemius' son, [Pieter Winsemius](/wiki/Pieter_Winsemius), served as [Minister of Housing, Spatial Planning and the Environment](/wiki/List_of_Ministers_of_Infrastructure_of_the_Netherlands#List_of_Ministers_of_Housing) in the Dutch government from 1982 to 1986. Winsemius was a good friend of Singaporean politician [Devan Nair](/wiki/Devan_Nair), and kept a poem composed by Nair titled \"The [Yangtze](/wiki/Yangtze)'s Voyage Through History\" framed in his study. ## Awards In 1997, [Nanyang Technological University](/wiki/Nanyang_Technological_University) established the Albert Winsemius Professorship as a lasting tribute to Winsemius for his significant contributions to Singapore's economic development. For his contributions to Singapore's economic development, Winsemius was conferred several honours. In 1967, [Yusof Ishak](/wiki/Yusof_Ishak), the first [President of Singapore](/wiki/President_of_Singapore), awarded him the Distinguished Service Medal. In 1970, he was conferred an honorary degree by the [National University of Singapore](/wiki/National_University_of_Singapore). In 1976, he received the [National Trades Union Congress](/wiki/National_Trades_Union_Congress)' May Day Gold Medal of Honour. There is a lane in [Clementi](/wiki/Clementi,_Singapore) named after him. - [Economy of Singapore](/wiki/Economy_of_Singapore) Library resources about **Albert Winsemius** - Resources in your library - Resources in other libraries **By Albert Winsemius** - Resources in your library - Resources in other libraries - Media related to Albert Winsemius at Wikimedia Commons - Fact Sheet on the Albert Winsemius Professorship Archived 2016-03-06 at the [Wayback Machine](/wiki/Wayback_Machine)\n",
  "language": "en",
  "processed_at": "2026-01-12T09:51:38.606782",
  "title": "Albert Winsemius",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Albert_Winsemius"
}