{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:51:50.641058"
  },
  "content": "Singaporean professional wrestler **Lee Xin Yi** (born July 26, 1995) is a Singaporean [professional wrestler](/wiki/Professional_wrestler) who performs under the [ring name](/wiki/Ring_name) **Alexis Lee**. Lee is Singapore's first female professional wrestler. ## Professional wrestling career ### Singapore Pro Wrestling (2013–present) Alexis Lee debuted in 2013, as Singapore's first female wrestler. In 2017, SPW introduced a women's title called the SPW: Queen of Asia Championship, which Lee pursued on numerous attempts however never managing to win the belt herself. Alexis Lee has faced multiple world-renowned wrestlers including [Riho](/wiki/Riho), [Emi Sakura](/wiki/Emi_Sakura) and [Indi Hartwell](/wiki/Indi_Hartwell). In 2019, along with [Andruew Tang](/wiki/Andruew_Tang) and [Dante Chen](/wiki/Dante_Chen), Lee was invited to take part in [WWE](/wiki/WWE)'s 2019 China tryout, however was unfortunately unable to secure a WWE contract. In 2021, Alexis Lee teamed up with Nyc to win the SPW SEA Tag Team Championships. The duo held the belts for 485 days, the longest reigning tag team of all time, until being forced to vacate it due to Nyc getting injured. At SPW X: Astronomical Anniversary Day 2, Lee defeated [Mei Suruga](/wiki/Mei_Suruga) and [Riho](/wiki/Riho) in a [three-way match](/wiki/Three-way_match) to win the SPW Queen of Asia Championship. ### All Action Wrestling (2017–2018) Lee won the vacant AAW Women's Championship by defeating Katie Forbes. Lee would hold the belt for 147 days until losing to Roxy Ryot in 2018. ### Championship Wrestling Entertainment (2018–present) In 2018, Lee defeated [Amber Nova](/wiki/Amber_Nova) to win the CWE Vixen's Championship and has held the belt for over 1500 days, being the longest reigning CWE Vixen's Champion of all time. ## Championships and accomplishments - **All Action Wrestling** - AAW Women's Championship (1 time) - **Championship Wrestling Entertainment** - CWE Vixen's Championship (1 time, current) - ***[Pro Wrestling Illustrated](/wiki/Pro_Wrestling_Illustrated)*** - Ranked No. 148 of the top 250 women's wrestlers in the *[PWI Women's 250](/wiki/Pro_Wrestling_Illustrated)* in 2023 - **[Singapore Pro Wrestling](/wiki/Singapore_Pro_Wrestling)** - SPW Queen of Asia Championship (2 times, current) - SPW Southeast Asian Tag Team Championships (1 time) – with Nyc This biographical article related to [wrestling](/wiki/Wrestling) is a stub. You can help Wikipedia by expanding it. - v - t - e This Singaporean biographical article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T09:51:50.640564",
  "title": "Alexis Lee",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Alexis_Lee"
}