{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:51:40.654992"
  },
  "content": "This article includes a list of general references, but **it lacks sufficient corresponding inline citations**. Please help to improve this article by introducing more precise citations. *(March 2022)* *(Learn how and when to remove this message)*Subzone of Bukit Merah Planning Area in Singapore **Alexandra** is a subzone region located in the town of [Bukit Merah](/wiki/Bukit_Merah), [Singapore](/wiki/Singapore). The region consists of two non contiguous neighbourhoods: Alexendra Hill and Alexendra North. It is located along the road which the place had its name derived from, at the eastern border of the [Queenstown](/wiki/Queenstown,_Singapore) district. Alexandra North, which refers to the precinct near [Redhill MRT station](/wiki/Redhill_MRT_station), consists mainly of condominiums together with a [park](/wiki/Alexandra_Canal,_Singapore). Alexandra Hill, which is often referred to as Brickworks Estate or Rumah Tinggi, mainly consists of HDB flats and is also home to an [IKEA](/wiki/IKEA) showroom. There is also a shopping centre in the district which recently opened its doors in 2016, Alexandra Central, beside the IKEA building. ## Amenities **Hospitals** - [Alexandra Hospital](/wiki/Alexandra_Hospital) ## Notable places - [Depot Road Zhen Shan Mei Claypot Laksa](/wiki/Depot_Road_Zhen_Shan_Mei_Claypot_Laksa), food stall awarded Michelin Bib Gourmand in 2016. - [Kim Seng Road](/wiki/Kim_Seng_Road) - https://web.archive.org/web/20090302092032/http://infopedia.nl.sg/articles/SIP_741_2005-01-20.html - https://web.archive.org/web/20111008002706/http://heritagetrails.sg/content/915/Alexandra_Road.html 1°17′12″N 103°47′47″E﻿ / ﻿1.2868°N 103.7963°E﻿ / 1.2868; 103.7963 This [Singapore](/wiki/Singapore) location article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T09:51:40.654459",
  "title": "Alexandra, Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Alexandra,_Singapore"
}