{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:51:52.948850"
  },
  "content": "Singaporean actress and qigong trainer (1951–2023) **Alice Ho Soon Kim** [PBM](/wiki/Pingat_Bakti_Masyarakat) (1953 − 9 July 2023) was a Singaporean actress, [qigong](/wiki/Qigong) trainer and businesswoman. ## Life and career Ho began her acting career with minor roles in local television shows starting in 1997 and had appeared in more than 50 television series. She was known for having portrayed the role of \"Beansprout Auntie\" in the popular long-form series *[Holland V](/wiki/Holland_V_(TV_series))* (2003). Her last screen appearance was in the 2023 [Channel 8](/wiki/Channel_8_(Singaporean_TV_channel)) series *[The Sky is Still Blue](/wiki/The_Sky_is_Still_Blue)*. Aside from being an actress, Ho was an active qigong practitioner who co-founded the Qigong Shi Ba Shi Association Singapore (新加坡气功十八式协会) in 1987, and served as the chairman for 31 years before stepping down from her position in 2021 to serve as a consultant. A chief trainer at the association, Ho led teams to participate in various qigong tournament and exchange programmes organised by the International Health Qigong Federation. She won multiple gold medals in tournaments held by the federation and obtained a Health Qigong Duan 6 Diploma in 2018. ## Death On 9 July 2023, Ho died after suffering an infection from her [uterine](/wiki/Uterine) surgery. She was 72. The news of Ho's death first appeared on the front page of local evening daily *[Shin Min Daily News](/wiki/Shin_Min_Daily_News)*. Ho's daughter Cai Wenshan revealed in an interview with *Shin Min* that her mother had originally planned to participate in a qigong competition in Japan at the end of July, believing that she would have fully recovered within three weeks of the surgery. Near to 200 people were reported to have attended Ho's funeral. She was cremated at [Kong Meng San Phor Kark See Monastery](/wiki/Kong_Meng_San_Phor_Kark_See_Monastery) on 13 July 2023. ## Selected filmography Ho appeared in the following programmes and films: ### Television series - *Mr OK* (1999) - *[Hainan Kopi Tales](/wiki/Hainan_Kopi_Tales)* (2000) - *[Beautiful Connection](/wiki/Beautiful_Connection)* (2002) - *[Holland V](/wiki/Holland_V_(TV_series))* (2003) - *Ubin Boy* (2005−2007; 3 seasons) - *(/wiki/118_(TV_series))* (2014-2015) - *[Eat Already? 2](/wiki/Eat_Already%3F_2)* (2017) - *[The Sky is Still Blue](/wiki/The_Sky_is_Still_Blue)* (2023) ### Film - *4:30* (2005) - Alice Ho at [IMDb](/wiki/IMDb_(identifier)) This Singaporean biographical article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T09:51:52.948437",
  "title": "Alice Ho (actress)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Alice_Ho_(actress)"
}