{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:52:01.094521"
  },
  "content": "Demolished park in SingaporePart of a series on the[History of Singapore](/wiki/History_of_Singapore)[Early history](/wiki/Early_history_of_Singapore) (pre-1819)[Srivijaya](/wiki/Srivijaya)650–1377[Temasek](/wiki/Temasek), [Long Ya Men](/wiki/Long_Ya_Men), [Ban Zu](/wiki/Ban_Zu)c.14th century[Kingdom of Singapura](/wiki/Kingdom_of_Singapura)1299–1398[Majapahit](/wiki/Majapahit)1398–1400[Malacca Sultanate](/wiki/Malacca_Sultanate)1400–1528[Johor Sultanate](/wiki/Johor_Sultanate)1528–1819British colonial era (1819–1942)[Founding](/wiki/Founding_years_of_modern_Singapore)1819–1826[Straits Settlements](/wiki/Singapore_in_the_Straits_Settlements)1826–1867[Crown colony](/wiki/Singapore_in_the_Straits_Settlements#Crown_colony_(1867–1942))1867–1942[Japanese Occupation](/wiki/Japanese_occupation_of_Singapore) (1942–1945)[Fall of Singapore](/wiki/Fall_of_Singapore)1942[Sook Ching](/wiki/Sook_Ching)1942[Double Tenth incident](/wiki/Double_Tenth_incident)1943[Post-war period](/wiki/Colony_of_Singapore) (1945–1962)[First Legislative Council](/wiki/History_of_Singapore#First_Legislative_Council_(1948–1951))1948–1951[Maria Hertogh riots](/wiki/Maria_Hertogh_riots)1950[Second Legislative Council](/wiki/History_of_Singapore#Second_Legislative_Council_(1951–1955))1951–1955[Anti-National Service Riots](/wiki/1954_National_Service_riots)1954[Internal self-government](/wiki/Self-governance_of_Singapore) (1955–1963)[Hock Lee bus riots](/wiki/Hock_Lee_bus_riots)1955[Singapore Glass Factory strikes](/wiki/Singapore_Glass_Factory_strikes)1960[Pulau Senang prison riots](/wiki/Pulau_Senang_prison_riots)1963[Merger with Malaysia](/wiki/History_of_the_State_of_Singapore_(Malaysia)) (1963–1965)[Singaporean referendum](/wiki/1962_Singaporean_integration_referendum)1962[Operation Coldstore](/wiki/Operation_Coldstore)1963[Race riots in Singapore](/wiki/1964_race_riots_in_Singapore)1964[MacDonald House bombing](/wiki/MacDonald_House_bombing)1965[Republic of Singapore](/wiki/History_of_the_Republic_of_Singapore) (1965–present)[ASEAN Declaration](/wiki/ASEAN_Declaration) ([ASEAN](/wiki/Association_of_Southeast_Asian_Nations))1967[1969 race riots of Singapore](/wiki/1969_race_riots_of_Singapore)1969[Laju incident](/wiki/Laju_incident)1974[Operation Spectrum](/wiki/Operation_Spectrum)1987[Asian financial crisis](/wiki/1997_Asian_financial_crisis#Singapore)1997[Embassies attack plot](/wiki/Singapore_embassies_attack_plot)2001[H1N1 pandemic](/wiki/2009_swine_flu_pandemic_in_Asia#Singapore)2009–2010[Bus drivers' strike](/wiki/2012_Singapore_bus_drivers%27_strike)2012[Little India riot](/wiki/2013_Little_India_riot)2013[2018 North Korea–United States Singapore Summit](/wiki/2018_North_Korea%E2%80%93United_States_Singapore_Summit)2018[COVID-19 pandemic](/wiki/COVID-19_pandemic_in_Singapore)2020–2022By topic - [Timeline](/wiki/Timeline_of_Singaporean_history) - [Riots](/wiki/List_of_riots_in_Singapore) - [Military](/wiki/Military_history_of_Singapore) Singapore portal - v - t - e **Alkaff Gardens** (also known as the **Alkaff Lake Gardens** and briefly known as **Happy Garden** from 1940 to 1941) was a Japanese-style park once located east of the [Bidadari Cemetery](/wiki/Bidadari_Cemetery) from 1930 to 1964, on the present site of [Cedar Girls' Secondary School](/wiki/Cedar_Girls%27_Secondary_School) at [Bidadari, Singapore](/wiki/Bidadari,_Singapore). In the 1930s, the park was a popular leisure destination for dating couples and families. It featured as its centrepiece an artificial lake, which was drained in 1964. ## History Plans for building the park on the 10-acre site near Upper Serangoon Road and [Bidadari Cemetery](/wiki/Bidadari_Cemetery) first came into the mind of the Arab merchant Syed Abdul Rahman Shaik Alkaff, with his building contractor suggested in \"decorating the site with Japanese teahouses, sidewalks with granite chips, [Japanese Arch](/wiki/Torii) and bridges\". ### Opening The park was first created with the help of Japanese landscapers in 1929, with artificial hills and an artificial lake. The Alkaff Gardens was opened to the public in January 1930, the park was known as first [Japanese garden](/wiki/Japanese_garden) in Singapore and was an attraction for both visitors and residents alike. The tea-houses could be rented by people who visited the park and there were boating and fishing facilities. Robert Bradwell, on behalf of refreshment bar owner Sailoku Tajiri, applied for a first-class licence to sell [Asahi beer](/wiki/Asahi_beer) there, which was granted on 20 June 1930. A mosque known as the [Alkaff Mosque](/wiki/Masjid_Alkaff_Upper_Serangoon), which was situated close to the park and Upper Serangoon Road, was opened on 24 June 1932 for Muslim locals. In September 1935, new recreational amenities with a Chinese touch were added by a well-known Chinese merchant, with the construction of boathouses similar to the ones seen on the [Pearl River](/wiki/Pearl_River_(China)) near [Guangzhou](/wiki/Guangzhou) at that time. A few small Chinese pavilions were added around the lake, interspersed with Chinese flower plants. The part of the lake at the bottom of the southern slope of the hillock was covered with white and pink lotus flowers. The water-cycle was first introduced in Singapore and demonstrated on its lake in November 1936. The park later fell into disuse in late 1938. ### Reopening After about eighteen months or so, the park was leased to S. V. Salam, and subsequently renamed as **Happy Garden** on 28 January 1940. The park was reportedly expanded to 20 acres. The lake, which was the main attraction, was stocked with fishes, with fishing rods available for hire. In addition, boats, water-cycles and even motor-boats were available for hire. The refreshment booths there were manned by trained waitresses from [Java](/wiki/Java) and [Sumatra](/wiki/Sumatra). Visitors were able to rent small bungalows there for their picnic parties. The park was later reopened with free admission to the public on 8 February 1940, the first day of [Chinese New Year](/wiki/Chinese_New_Year), and remained open throughout the day and night, being lighted with hundreds of multi-coloured electric bulbs. ### World War II The park was requisitioned by the [British Army](/wiki/British_Army) in December 1941 in preparation for [World War II](/wiki/World_War_II). The Singapore Volunteer Field Ambulance Corps later moved into the park to set up their headquarters. #### Battle of Singapore During the [Battle of Singapore](/wiki/Battle_of_Singapore) in 1942, the Singapore Volunteer Field Ambulance Corps headquarters was supposedly spared from bombings by the [Imperial Japanese Army](/wiki/Imperial_Japanese_Army) warplanes due to the Red Cross sign laid on the grass. However soon after they evacuated from the park meant for another military unit to take over by the end of January, the park was bombed and shelled, destroying one of its two Japanese bridges and several buildings. #### Japanese occupation of Singapore Following the [Japanese occupation of Singapore](/wiki/Japanese_occupation_of_Singapore) in 1942, an armed guard was stationed at the park entrance. The premises was restricted to the public, not even the owner of the park, Syed Abdul Rahman Shaik Alkaff, was allowed to enter. It was later revealed that the park was used as one of the seven [Indian Army](/wiki/British_Indian_Army) personnel internment [POW camps](/wiki/POW_camp) under Lieutenant Colonel Nagar of [Royal Indian Army Service Corps](/wiki/Royal_Indian_Army_Service_Corps), who was under the supervision of the Imperial Japanese Army. The POW camp operated there until 1945. ### Postwar era By April 1948, the former Alkaff Gardens was largely forgotten and in disrepair, its lake water choked with weeds and all of its building structures having been taken down. Only a few people who lived nearby and had known the place visited there. Although neglected, the former park was one of the sites filmed by the [Shaw Brothers](/wiki/Shaw_Brothers)' [Malay Film Productions](/wiki/Malay_Film_Productions) to masquerade as an Egyptian garden for the Malay film *[Nilam](/wiki/Nilam_(film))* (1949). Other films by Malay Film Productions were filmed at the park included *Pembalasan* (1951) and *Di Perlimbahan* (1952). #### Sold to Sennett Realty Estate On 15 July 1950, the Alkaff Realty Co. Ltd. sold 170 acres of land, including the park, to C.W.A Sennett, the managing director of Sennett Realty Estate Co. Ltd., for [S](/wiki/Straits_dollar)$2 million. On 18 July 1950, a S$17 million plan for a 1,400-unit housing estate that is capable of housing 10,000 people was announced. The former park was to be obliterated and its lake filled up in the process. #### Proposal to preserve the park A number of Singapore residents wrote in protest and proposed that the Singapore Municipal Commissioners should take over the park to rehabilitate and preserve it. However, on 24 July 1950, neither the Singapore Municipal Commissioners nor the [Singapore Improvement Trust](/wiki/Singapore_Improvement_Trust) would be able to *save* the park, with the acting Municipal President [Thomas Percy Fergus McNeice](/wiki/Percy_McNeice) (1902–1998) saying that they and the Trust would not interfere with the proposed development scheme, as it would cost about S$2 million to take over the site and the commissioners would not spend so much money on a public park while the Sennett Realty Estate Co. Ltd. was reconsidering on the future of the park. On 28 July 1950, the claim of preserving the park was met with support from the [Singapore Progressive Party](/wiki/Singapore_Progressive_Party), which called on the authorities to take necessary action. One month later in August 1950, more than 1,000 people rushed to buy the 1,400 houses which the Sennett Realty Co. Ltd. had planned for its housing estate on the 170-acre land which included the former Alkaff Gardens, and by September, about 2,000 applications received by the company, in addition to the proposal to give up 20 acres to preserve the Alkaff Gardens, the company also planned to reserve 5 acres to build a school due to a number of applications received from local teachers. #### Preservation proposal successful Later on 28 September 1950, the Singapore Improvement Trust approved the building plan, with its trustees stipulating that the park to be preserved as an open space. ## Present On 23 April 1960, the residents of the Sennett Estate seek for the authorities to develop Alkaff Gardens, due to a lack of playground in their neighbourhood. ### Demolition > I am now rather shocked to see that delightful parkland previously known as Alkaff Gardens being slowly levelled, its huge shady trees being ruthlessly felled and its scenic lake about to be drained by workers of the P.W.D to make way for the school — Nature Lover, Vanishing parkland at Alkaff 'Gardens', *[The Straits Times](/wiki/The_Straits_Times)* Singapore, 23 May 1964, Page 17 However, it was reported on 23 May 1964 that despite the appeal made to the public to grow more trees to beat future drought, the former park was levelled, with its trees felled and its lake drained by workers hired by the [Public Works Department of Singapore](/wiki/Public_Works_Department_of_Singapore) to make way for a school. This was responded on 6 June 1964 by the director of education of Singapore Au Yee Pun that the demolition of the park was necessary due to the accordance with government policy to provide educational facilities to local students as near their homes as possible. The school known as Willow Avenue Secondary School was later built on the site and was officially opened on 25 July 1966. The school was closed in 1991 due to its declining enrollment of students, and the site was subsequently taken over by the nearby [Cedar Girls' Secondary School](/wiki/Cedar_Girls%27_Secondary_School) for its expansion. ### Alkaff Neighbourhood and the new Alkaff Lake Alkaff Gardens inspired plans, announced in 2013, for the construction of a new Alkaff Lake in [Bidadari Park](/wiki/Bidadari_Park), 500 m north of the site of the old lake. The area west of the site, formerly part of Bidadari Cemetery, houses the [build-to-order](/wiki/Build_to_order_(HDB)) project known as the Alkaff Neighbourhood, launched in 2015. - [Bidadari, Singapore](/wiki/Bidadari,_Singapore) - [Bidadari Cemetery](/wiki/Bidadari_Cemetery) - [Bidadari Park](/wiki/Bidadari_Park)\n",
  "language": "en",
  "processed_at": "2026-01-12T09:52:01.094052",
  "title": "Alkaff Gardens",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Alkaff_Gardens"
}