{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:51:58.758458"
  },
  "content": "Historic building in Singapore **Alkaff Arcade**, also known as **The Arcade**, was a historic building on [Collyer Quay](/wiki/Collyer_Quay) in Singapore. Completed in 1909 for the [Alkaff family](/wiki/Alkaff_family), it was the first indoor shopping centre on the island. Known for its [Moorish-style architecture](/wiki/Moorish_architecture), it was \"hailed as Singapore’s best-known waterfront landmark\". The building was demolished in 1978 to make way for an office tower. ## Description The \"solid and ornate\" featured arches and two [onion domes](/wiki/Onion_domes) in the Moorish style. It also featured a cast-iron façade, which was \"characteristic of 1900s Victorian architecture\". External pillars were decorated with coloured tiles while the interior featured mural ornamental tiles, most of which were green. At its completion, it was \"deemed to have broken the monotony of commercial architecture in Singapore.\" The building was primarily made of iron and cement, with fittings and inner floorings being constructed of wood. The building also served as a thoroughfare linking Collyer Quay to [Raffles Place](/wiki/Raffles_Place). *[The Straits Times](/wiki/The_Straits_Times)* wrote: \"Passing into the new thoroughfare, one is immediately by the solidity and excellence of workmanship of the ground floor shops on each side. The plate glass show windows run almost to the ground giving every facility a comprehensive display of wares and though perhaps a little bit more light would have been acceptable, the utmost use has quite evidently been made of the available space, and a little electricity will do the rest.\" The centre of the building featured a well leading up to a glass roof, providing \"ample\" air space. *The Straits Times* wrote that the ground floor \"should prove one of the coolest spots in town.\" There were staircases on either end of the ground floor leading to the first floor and then the second, both of which featured a gallery with offices on either side, after which the staircases would have led to the roof. The galleries of the upper floors featured iron pillars and railings. There was also a lift on either end. ## History Completed in 1909, the building was designed by prominent local architect [David McLeod Craik](/wiki/David_McLeod_Craik) of the architectural firm [Swan and Maclaren](/wiki/Swan_%26_Maclaren_Architects) for the Alkaff family, who were major property owners at the time. Other properties owned by the family included the Grand Hotel de l'Europe and the [Alkaff Gardens](/wiki/Alkaff_Gardens). Built for $146,000, it stood on land which was acquired by [Guthrie & Co](/wiki/Guthrie_(company)). It was the first indoor shopping centre in Singapore and \"rose above the neighbouring godowns of Collyer Quay.\" The building was officially opened on 27 November 1909, with the Alkaff's hosting a tiffin, which was attended by a \"large and representative company of local and professional businessmen\", in celebration. However, as Syed Shaikh bin Abdul Rahman Alkaff, the Alkaff responsible for the building's construction, could not speak English, [Charles Burton Buckley](/wiki/Charles_Burton_Buckley) spoke on his behalf. At its opening, *The Straits Times* called it a \"handsome specimen of design and building\" and \"possibly the most unique\" of the buildings which had been completed recently. The newspaper also praised the use of green in the interior, calling it \"restful on the eyes\" and a \"distinct advance on the rather barren interiors of many other local buildings. The first two floors were occupied by the offices of [The Peninsular and Oriental Steam Navigation Company](/wiki/P%26O), while the third storey was occupied by the offices of the [Standard Oil Company](/wiki/Standard_Oil). Piano manufacturers Moutrie & Co. occupied a ground-floor corner shop while Roneo Co. occupied an inner unit, also on the ground floor. The offices of accounting firm Evatt & Co. were located on the second storey. The building's tenants later included salons and tea rooms. It was \"one of Singapore's best-known landmarks which oversaw the waterfront for five generations\" and was \"still bustling with activity\" in the 1970s. Tsang Sau Yin of *[The Business Times](/wiki/The_Business_Times_(Singapore))* wrote in 1979 that the building \"stood on a prime site\" and that its name was \"synonymous with shopping.\" However, in an article for *BiblioAsia*, published by the [National Library Board](/wiki/National_Library_Board), Yu-Mei Balasingamchow wrote that the building \"seems to have made less of an impression as a shopping location\" than Change Alley. By the 1970s, the shops in the building mostly catered towards office workers in the area. Along with [Change Alley](/wiki/Change_Alley,_Singapore), it was one of two walkways connecting Collyer Quay to [Raffles Place](/wiki/Raffles_Place). However, the building had already begun to \"deteriorate\" and it was deemed a fire hazard. Betty L. Khoo of the *New Nation* wrote in June 1972 that the \"shafts of sunlight filtering through the skylight seemed to show up the sad and faded splendour and made clear the dirt stains on its walls.\" However, Khoo went on to write: \"It is an edifice which does the waterfront proud and if it disappears — the Arabic heritage may finally be submerged and totally absorbed into Singapore's corporate milieu.\" The Alkaff family had originally planned to redevelop the building into a modern office building, but eventually decided against that as there were already many office buildings being built in Singapore at the time. In 1973, it was sold to Singapura Developments for $12 million. By then, it was generating $18,000 a month through rent, which was \"lower than expected\". In 1978, the building was demolished to make way for The Arcade, a 20-storey office building completed in the early 1980s.\n",
  "language": "en",
  "processed_at": "2026-01-12T09:51:58.758030",
  "title": "Alkaff Arcade",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Alkaff_Arcade"
}