{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:52:08.677157"
  },
  "content": "Singaporean pool player (born 1996) **Aloysius Yapp** (/ˌæloʊˈɪʃəs/; [Chinese](/wiki/Simplified_Chinese_characters): 叶浚惟; [pinyin](/wiki/Pinyin): *Yè Jùnwéi*; born 2 May 1996) is a Singaporean professional [pool](/wiki/Pool_(cue_sports)) player. He was the world junior champion in [nine-ball](/wiki/Nine-ball) in 2014 and runner-up in the 2021. In 2025, Yapp defeated Jonas Souto Comino of Spain 13–1 in the final of the UK Open Pool Championship, claiming his first major open title. ## Career Yapp began playing pool at age eight. An alumnus of [Saint Patrick's School](/wiki/Saint_Patrick%27s_School,_Singapore), he dropped out of school in 2011 to turn professional, although he eventually completed his [GCE Ordinary Level](/wiki/GCE_Ordinary_Level) examinations at Coleman College. Reportedly the first professional pool player from Singapore, he won the inaugural Asian Junior Pool Championship in 2014. Later that year, he became the first Singaporean to claim a world title in pool when he won the World Junior Pool Championships (Under-19) in [Shanghai, China](/wiki/Shanghai,_China), beating Hsu Jui-an 11–10. In 2021, he claimed the Singapore National Snooker Championship, defeating defending champion [Peter Gilchrist](/wiki/Peter_Gilchrist_(billiards_player)) 4–2. In the quarter-finals of the 2021 [WPA World Ten-ball Championship](/wiki/WPA_World_Ten-ball_Championship), Yapp defeated [Jayson Shaw](/wiki/Jayson_Shaw), which moved him up to 8th in the world rankings; he ultimately finished in third place. In the [2021 U.S. Open Pool Championship](/wiki/2021_U.S._Open_Pool_Championship), Yapp survived a scare against [Wojciech Szewczyk](/wiki/Wojciech_Szewczyk) in the third round of the winners bracket by winning 11–10 before scoring upsets in quick succession against defending champion [Joshua Filler](/wiki/Joshua_Filler) 11–4 in the fourth round of the winners bracket and [Shane Van Boening](/wiki/Shane_Van_Boening) 11–5 in the Last 16. He went on to defeat both Rodrigo Geronimo and [Dennis Orcollo](/wiki/Dennis_Orcollo) by a scoreline of 11–6 in the quarterfinals and semifinals respectively, before losing to [Carlo Biado](/wiki/Carlo_Biado) 8–13 in the final, concluding his best finish in a major tournament. The following week, he won the CueSports International (CSI) Michigan 10-Ball Open, defeating [Roberto Gomez](/wiki/Roberto_Gomez_(pool_player)) 4–0, 4–2 in the final. He successfully defended his Michigan Open title the following year, defeating [Robbie Capito](/wiki/Robbie_Capito) 4–2, 4–1 in the final. The following month, he beat Chang Jung-Lin 7–6 in the final of the Sandcastle 9-Ball Open. In 2022, he won a bronze medal at the [2022 World Games](/wiki/2022_World_Games) in [Birmingham, Alabama](/wiki/Birmingham,_Alabama) for nine-ball. On October 18, 2024, team Asia ruled the inaugural [Reyes Cup](/wiki/Reyes_Cup) at the [Ninoy Aquino Stadium](/wiki/Ninoy_Aquino_Stadium) in [Manila](/wiki/Manila), Philippines. [Johann Chua](/wiki/Johann_Chua), Carlo Biado, Aloysius Yapp, [Duong Quoc Hoang](/wiki/Duong_Quoc_Hoang), and [Ko Pin Yi](/wiki/Ko_Pin-yi) make up the team, which is coached by the tournament namesake and greatest of all time [Efren Reyes](/wiki/Efren_Reyes). They defeated the European team with a decisive 11–6 final score. Team Europe is made up of Jayson Shaw, [Eklent Kaci](/wiki/Eklent_Ka%C3%A7i), [Francisco Sanchez Ruiz](/wiki/Francisco_S%C3%A1nchez_Ru%C3%ADz), [David Alcaide](/wiki/David_Alcaide), and [Mickey Krause](/wiki/Mickey_Krause). Yapp was named the first-ever Reyes Cup most valuable player for his outstanding performance throughout the event. A month later, Yapp successfully defended his title by winning back-to-back championships at the International Open Nine-ball in Florida. He defeated [Moritz Neuhausen](/wiki/Moritz_Neuhausen) of Germany, 13–6, and received $40,000 in prize money. In May 2025, Yapp won his first matchroom major open title, defeating Jonas Souto Comino of Spain with a superb 13–1 in the final of the UK Open Pool Championship at Telford International Centre. This significant triumph propelled him from fifth to second place in the matchroom world rankings, trailing [Fedor Gorst](/wiki/Fedor_Gorst) at the top. Yapp's victory has also solidified his position in the [Reyes Cup](/wiki/Reyes_Cup) rosters, securing a spot to represent Team Asia this year. In August, Yapp won the inaugural Florida Open beating Shane Van Boening in the finals and a week later he won the prestigious [US Open Nine-ball Championship](/wiki/US_Open_Nine-ball_Championship) against defending champion [Fedor Gorst](/wiki/Fedor_Gorst) and becoming the first pool player to win three consecutive World Nine-ball Tour (WNT) Open Majors (UK Open, Florida Open, US Open). ## Titles - 2025 International Open Nine-ball - 2025 International Bigfoot Ten-ball Challenge - 2025 [Reyes Cup](/wiki/Reyes_Cup) - 2025 [Formosa](/wiki/Formosa) Cup Taipei Open Nine-ball Championship - 2025 [US Open Nine-ball Championship](/wiki/US_Open_Nine-ball_Championship) - 2025 [Florida](/wiki/Florida) Open Nine-ball Championship - 2025 UK Open Nine-ball Championship - 2025 National Nine-ball Open Championship - 2024 International Open Nine-ball - 2024 [Reyes Cup](/wiki/Reyes_Cup) [(MVP)](/wiki/Most_valuable_player) - 2024 [Reyes Cup](/wiki/Reyes_Cup) - 2024 Batam Open Ten-ball Championship - 2023 International Open Nine-ball - 2023 Battle of the Bull Nine-ball - 2022 Meucci Classic Ten-ball - 2022 Meucci Classic Nine-ball - 2022 Predator Michigan Open Ten-ball - 2022 Sandcastle Nine-ball Open - 2021 Predator Michigan Open Ten-ball - 2017 [Southeast Asian Games Nine-ball Doubles](/wiki/Billiards_and_snooker_at_the_Southeast_Asian_Games) - 2017 Golden Break Nine-ball Open - 2014 [WPA World Nine-ball Junior championship](/wiki/List_of_WPA_World_Nine-ball_champions#Junior_champions)\n",
  "language": "en",
  "processed_at": "2026-01-12T09:52:08.676532",
  "title": "Aloysius Yapp",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Aloysius_Yapp"
}