{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:52:10.640926"
  },
  "content": "Luxury hotel group **Aman Resorts** is the trading entity of **Aman Group Sarl**, a [Swiss](/wiki/Switzerland)-headquartered multinational [hospitality company](/wiki/Hospitality_industry). Founded by Indonesian hotelier [Adrian Zecha](/wiki/Adrian_Zecha) in 1988, the company operates 35 properties in 20 countries. [Vladislav Doronin](/wiki/Vladislav_Doronin) is the [chief executive officer](/wiki/Chief_executive_officer), [chairman](/wiki/Chairperson), and owner. ## History ### Founding Founded in 1988, Aman Resorts' first destination was the result of hotelier [Adrian Zecha](/wiki/Adrian_Zecha)'s desire to build a holiday home in [Phuket](/wiki/Phuket). His plans soon developed into an idea to build a small boutique resort with Anil Thadani and two other friends. They invested their own money in the venture as no banks would lend for the project due to the small number of planned rooms. The resort opened as [Amanpuri](/wiki/Amanpuri) in 1988, with nightly rates reportedly five times higher than local competitors. By 1992, following the success of the first hotel, the group had expanded to include several resorts in Indonesia, a resort on [Bora Bora](/wiki/Bora_Bora) and one in the Alpine village of [Courchevel](/wiki/Courchevel). Later, Clement Vaturi acquired a majority stake in the company, thereby allowing the boutique hotels to be further conceptualized. ### First ownership dispute (1998) In 1998, Vaturi's controlling interest was acquired by Los Angeles-based [Colony Capital](/wiki/Colony_Capital), a real estate investment fund. A lawsuit between Vaturi and Colony Capital promised to drag on, and Colony Capital moved to protect its interests by taking a more active role in the company. At this time, Zecha resigned from his position at Aman and pursued other interests for the next two years. In 2000, Colony Capital and Vaturi settled their lawsuit, and Vaturi sold his shareholding interests to Lee Hing Development, a Hong Kong investment company. With controlling investors allowing full control over the company, Zecha returned as chairman and CEO. Over the next seven years, Aman launched retreats in Cambodia, India, Bhutan, Sri Lanka, and the Caribbean. On 27 November 2007, [DLF](/wiki/DLF_(company)), India's largest real estate company, acquired Lee Hing's controlling stake in Aman Resorts for $400 million, including debt of $150 million. ### Second ownership dispute (2014) In early February 2014, DLF sold Aman Resorts for $358 million to Aman Resorts Group, an investment company led by Russian businessman [Vladislav Doronin](/wiki/Vladislav_Doronin), which also included [Omar Amanat](/wiki/Omar_Amanat). The sale included all Aman properties except for the [Lodhi Hotel](/wiki/The_Lodhi) in Delhi. DLF sold Aman Resorts to reduce its debt and refocus on real estate after it had expanded into hotels, wind farms, and running export processing zones. In April, Zecha stepped down as chairman a second time, and the company relocated its headquarters from Singapore to London in June. Its corporate headquarters has since been moved to [Baar](/wiki/Baar,_Switzerland), Switzerland. Doronin assumed the position of chairman, and French hotelier Olivier Jolivet was appointed chief executive officer in 2014. ### Aman under Doronin (2015–present) In August 2015, Doronin became the sole owner of Aman when Pontwelly Holding Company took full ownership of Aman's hospitality business, Silverlink Resorts. Following this restructuring, Doronin and board director Alan Djanogly remain the only two directors. In February 2017, Roland Fasel joined Aman as chief operating officer, continuing a 25-plus-year career in luxury hospitality. Olivier Jolivet left the company the same year and Doronin assumed the position of chief executive officer. In 2020, Doronin unveiled Janu, a spin-off brand that operates larger hotels in Japan, Montenegro, and Saudi Arabia, reportedly aiming to become a slightly more affordable complement to Aman. The group's diversification strategy continued in 2021 with the launching of a clothing line, marking a shift towards becoming a self-proclaimed lifestyle brand. In August 2022, Aman New York opened at the [Crown Building](/wiki/Crown_Building_(Manhattan)). ## Hotels Each Aman property typically has a small number of rooms, usually fewer than 55. The brand is often characterised by media outlets to offer remarkable service, with many of its properties reportedly having a staff count typically of six staff to one guest. Outside urban settings, guest accommodation is typically provided in individual private villas, pavilions, or tents (in the case of Aman-i-Khás in India, Amanwana in Indonesia, and Amanpulo in the Philippines), and often includes private outdoor lounging and dining areas. Aman mandates a concern for cultural preservation, and several properties are said to have some historical background and importance. In Cambodia, for instance, the company acquired a ruined guest villa that had been built in the early 1960s by the country's [King Sihanouk](/wiki/King_Sihanouk). All architectural records of the villa had been destroyed, but the discovery of an old tourist book with pictures of the building allowed the company to closely replicate what had been lost. Since its establishment, Aman has been highly rated by *[Condé Nast Traveler](/wiki/Cond%C3%A9_Nast_Traveler),* Zagat Survey*,* Gallivanter's Guide*,* Harper's Hideaway\" and *[Travel & Leisure](/wiki/Travel_%26_Leisure)*. 34% of Aman [patrons](/wiki/Patron) reportedly originate from Europe, another 34% from Asia-Pacific, 28% from the Americas and 4% from the rest of the world. ## Architects Among the architects who have designed Aman properties are Emine Ögün, [Ed Tuttle](/wiki/Ed_Tuttle), [Jaya Ibrahim](/wiki/Jaya_Ibrahim), Jean-Michel Gathy (Denniston), [Kerry Hill](/wiki/Kerry_Hill), Marwan Al-Sayed, Mehmet Ögün, [Peter Muller](/wiki/Peter_Muller_(architect)), [Rick Joy](/wiki/Rick_Joy), [Turgut Cansever](/wiki/Turgut_Cansever). and [Francisco Mañosa](/wiki/Francisco_Ma%C3%B1osa). ## Controversy In January 2023 [Charles McGonigal](/wiki/Charles_McGonigal), a former high-ranking FBI official and global director of security for Aman Group, was arrested on charges of money laundering and for violating [US sanctions law](/wiki/Russia%E2%80%93United_States_relations). According to the [US Department of Justice](/wiki/United_States_Department_of_Justice), McGonigal conspired with a former Russian diplomat to assist [Oleg Deripaska](/wiki/Oleg_Deripaska), a sanctioned Russian oligarch. McGonigal’s hiring in the spring of 2022 was done through a very obscure process, according to Aman staffers, and raised many eyebrows because the previous director of corporate security was reassigned for no apparent reasons and because when reports that McGonigal was under investigation had surfaced and the first witnesses were scheduled to appear before the grand jury investigation of his conduct, he continued to be retained by the company. ## Locations As of 2025, the group operates a total of 36 properties in 20 countries: No.Hotel NameHotel LocationCountryOpening YearDesigner1Aman Kyoto[Kyoto](/wiki/Kyoto)Japan2019Kerry Hill2Aman Le Mélézin[Courchevel](/wiki/Courchevel)France1992Ed Tuttle3[Aman New York](/wiki/Crown_Building_(Manhattan))[New York City](/wiki/New_York_City)United States2022Jean-Michel Gathy of Denniston4Aman Summer Palace[Beijing](/wiki/Beijing)China2008Jean-Michel Gathy of Denniston and Jaya Ibrahim5Aman Sveti Stefan[Sveti Stefan](/wiki/Sveti_Stefan)Montenegro2008Jean-Michel Gathy of Denniston6Aman Tokyo[Tokyo](/wiki/Tokyo)Japan2014Kerry Hill7Aman Venice[Venice](/wiki/Venice)Italy2013Jean-Michel Gathy of Denniston and Elastic Architects8Aman Villas at Nusa Dua[Nusa Dua](/wiki/Nusa_Dua)Indonesia1992Kerry Hill, Danilo Capellini, and Dale Keller9Aman-i-Khas[Sawai Madhopur](/wiki/Sawai_Madhopur_district)India2003Jean-Michel Gathy of Denniston10Amanbagh[Alwar](/wiki/Alwar_district)India2005Ed Tuttle11Amandari[Ubud](/wiki/Ubud)Indonesia1989Peter Muller12Amandayan[Lijiang](/wiki/Lijiang)China2015Jaya Ibrahim13Amanemu[Shima](/wiki/Shima,_Mie)Japan2016Kerry Hill14Amanera[Río San Juan](/wiki/R%C3%ADo_San_Juan,_Dominican_Republic)Dominican Republic2015John Heah15Amanfayun[Hangzhou](/wiki/Hangzhou)China2010Jaya Ibrahim16[Amangalla](/wiki/Amangalla)[Galle](/wiki/Galle)Sri Lanka2005Kerry Hill17Amangani[Jackson Hole](/wiki/Jackson_Hole)United States1998Ed Tuttle18[Amangiri](/wiki/Amangiri)[Lake Powell](/wiki/Lake_Powell)United States2009Marwan Al-Sayed, Rick Joy, and Wendell Burnett19[Amanjena](/wiki/Amanjena)[Marrakesh](/wiki/Marrakesh)Morocco2000Ed Tuttle20[Amanjiwo](/wiki/Amanjiwo)[Magelang](/wiki/Magelang_Regency)Indonesia1997Ed Tuttle21[Amankila](/wiki/Amankila)[Karangasem](/wiki/Karangasem_Regency)Indonesia1992Ed Tuttle and Danilo Capellini22Amankora[Thimphu](/wiki/Thimphu)Bhutan2004Kerry Hill23[Amanoi](/wiki/Amanoi)[Ninh Hải](/wiki/Ninh_H%E1%BA%A3i_district)Vietnam2013Jean-Michel Gathy of Denniston24[Amanpulo](/wiki/Amanpulo)[Pamalican](/wiki/Pamalican)Philippines1993[Bobby Manosa](/wiki/Francisco_Ma%C3%B1osa)25[Amanpuri](/wiki/Amanpuri)[Phuket](/wiki/Phuket)Thailand1988Ed Tuttle26Amanrüya[Bodrum](/wiki/Bodrum)Turkey2011Turgut Cansever, Emine Ögün, and Mehmet Ögün27Amansara[Siem Reap](/wiki/Siem_Reap)Cambodia2002Kerry Hill28[Amantaka](/wiki/Amantaka)[Luang Prabang](/wiki/Luang_Prabang)Laos2009Jean-Michel Gathy of Denniston29Amanwana[Moyo](/wiki/Moyo_Island)Indonesia1993Jean-Michel Gathy of Denniston30Amanwella[Tangalle](/wiki/Tangalle)Sri Lanka2005Kerry Hill31Amanyangyun[Shanghai](/wiki/Shanghai)China2017Kerry Hill32Amanyara[Turks and Caicos Islands](/wiki/Turks_and_Caicos_Islands)United Kingdom2006Jean-Michel Gathy of Denniston33Amanzoe[Kranidi](/wiki/Kranidi)Greece2012Ed Tuttle34Janu Tokyo[Tokyo](/wiki/Tokyo)Japan2024Jean-Michel Gathy of Denniston35Rosa Alpina[a][Alta Badia](/wiki/Alta_Badia)Italy2020Jean-Michel Gathy of Denniston36Aman Nai Lert Bangkok[Bangkok](/wiki/Bangkok)Thailand2025Jean-Michel Gathy of Denniston ### Upcoming properties There are a total of 12 properties in the pipeline. No.Hotel NameHotel LocationCountryOpening Year1Aman Beverly Hills[Beverly Hills](/wiki/Beverly_Hills,_California)United States20272Aman Dubai[Dubai](/wiki/Dubai)United Arab Emirates20273Aman Miami Beach[Miami Beach](/wiki/Miami_Beach)United States20264Aman SingaporeSingaporeSingaporeTBD5Aman Niseko[Niseko](/wiki/Niseko)Japan20276Amanvari[Los Cabos](/wiki/Los_Cabos_Municipality)Mexico20267Janu Dubai[Dubai](/wiki/Dubai)United Arab Emirates20278Aman NisekoNisekoJapan20309Aman MaldivesMaldivesMaldivesTBD10Aman KaringaniKaringani Game ReserveMosambiqueTBD11AmansamarWadi SafarSaudi ArabiaTBD12AmancayaExumaBahamasTBD ## Related ventures While Aman presently has no footprint in [London](/wiki/London), it opened a standalone Aman [Spa](/wiki/Spa) in the basement floors of [The Connaught](/wiki/The_Connaught_(hotel)) in 2009. Designed by [Jaya Ibrahim](/wiki/Jaya_Ibrahim), the spa has five rooms and offers mainly Asian-based treatments, ranging from Thai hot herbal compresses to Himalayan crystal salt body scrubs. Aman operates a luxury [yacht](/wiki/Yacht) called Amandira, which launched in 2015 and sails through the waters of [Eastern Indonesia](/wiki/Eastern_Indonesia). The yacht, modeled after the traditional Indonesian sailing vessel [pinisi](/wiki/Pinisi), has five cabins that can accommodate up to 10 guests. In 2023, Aman opened Aman Residences Tokyo, the company's first standalone residential property, in the [Azabudai Hills](/wiki/Azabudai_Hills) skyscraper complex. Designed by [Pelli Clarke Pelli Architects](/wiki/C%C3%A9sar_Pelli) and [Yabu Pushelberg](/wiki/Yabu_Pushelberg), it encompasses 11 floors with 91 units in total, and ranks as the tallest residential towers in [Tokyo](/wiki/Tokyo). In December 2023, Aman launched Aman Interiors, presenting limited edition furniture collections in collaboration with Japanese architect [Kengo Kuma](/wiki/Kengo_Kuma). ## Gallery - Hotels portal ## Notes - Official website - Cohen, E. \"Subtlety and Luxury - Jean-Michel Gathy does it again at Amanyara in the Turks and Caicos,\" *Interior Design*, 1 July 2006.\n",
  "language": "en",
  "processed_at": "2026-01-12T09:52:10.640493",
  "title": "Aman Resorts",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Aman_Resorts"
}