{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:52:26.767001"
  },
  "content": "Residential town in SingaporePlanning Area and HDB Town in Central Region, Singapore **Ang Mo Kio** (/ˌɑːŋ ˌmoʊ ˈkjoʊ/) is a [planning area](/wiki/Planning_Areas_of_Singapore) and [residential town](/wiki/New_towns_of_Singapore) situated in the [North-East Region](/wiki/North-East_Region,_Singapore) of [Singapore](/wiki/Singapore).[a] Located approximately 11 km (6.8 miles) north of the [Downtown Core](/wiki/Downtown_Core) district, Ang Mo Kio is the 4th most populated planning area in the North-East region and ranks 11th in terms of population in the country overall. The planning area is located at the south-western corner of the North-East region, bordered by the planning areas of [Yishun](/wiki/Yishun) to the north, [Sengkang](/wiki/Sengkang) to the north-east, [Serangoon](/wiki/Serangoon) to the east, [Bishan](/wiki/Bishan,_Singapore) to the south and the [Central Water Catchment](/wiki/Central_Water_Catchment) to the west. Prior to urbanization, the area, much like other rural districts in Singapore at the time, was largely undeveloped, being mainly used for agricultural purposes, with uninhabited plots of land usually covered in dense [secondary forest](/wiki/Secondary_forest) or [swamps](/wiki/Swamp). Ang Mo Kio was subsequently redeveloped by the [Housing and Development Board](/wiki/Housing_and_Development_Board) (HDB) in 1973 as their seventh satellite town and the first to be built in [metric dimensions](/wiki/Metric_system), being fully completed by 1980. The first three town councils in the country were established in Ang Mo Kio in 1986, as part of a pilot project to better serve residents of HDB new towns. The concept eventually became adopted under the Town Council Act of 1988 which today, remains as the second-level of administration in Singapore. Ang Mo Kio today, much like its neighbouring towns, is largely urbanized. However, parks are still prevalent in the town as part of the country's green initiative. Parks include [Ang Mo Kio Town Garden East](/wiki/Ang_Mo_Kio_Town_Garden_East) and [Ang Mo Kio Town Garden West](/wiki/Ang_Mo_Kio_Town_Garden_West). Although not technically located within Ang Mo Kio itself, the [Bishan-Ang Mo Kio Park](/wiki/Bishan-Ang_Mo_Kio_Park) in the adjacent town of Bishan was designed to serve residents of both towns. The park itself straddles along the Ang Mo Kio–Bishan boundary, making it easily accessible from Ang Mo Kio. ## Etymology The origin of the name is contested. Old survey maps relate the area as \"Amokiah\" or the \"Mukim (region) of Ang Mo Kio\". The name was formerly written with the characters 红毛 *[âng-mô͘](/wiki/Ang_moh)*, literally \"[red hair](/wiki/Red_hair)\", and one possibility is that the name comes from red-haired tropical fruit [rambutan](/wiki/Rambutan), known as 红毛丹 *âng-mô͘-tan* in [Hokkien](/wiki/Minnan_(linguistics)). However, *âng-mô͘* can also be used figuratively to mean \"Western\" or \"[Caucasian person](/wiki/White_people)\". *Kio* in turn could be written either 桥 *kiô* \"bridge\", in which case the name would mean \"Caucasian's bridge\", or 茄 *kiô* \"[eggplant](/wiki/Eggplant)\", in which case 红毛茄 \"Western eggplant\" refers to the [tomato](/wiki/Tomato), which is not native to the region. There are no reports of tomatoes being grown in Ang Mo Kio, so the bridge theory is more likely; nevertheless, there are several commemorative tomato sculptures around Ang Mo Kio. Even assuming *kiô* refers to a bridge, the identity of the bridge remains unclear. One theory states that Ang Mo Kio had two bridges of significance: an old wooden bridge (*pang kio* in Hokkien) over the Sungei Tongkang river, and a newer concrete bridge on [Cheng San Road](/wiki/Cheng_San_Road) over a tributary of the [Kallang River](/wiki/Kallang_River). Since concrete in Hokkien is 红毛灰 *âng-mô͘-hoe* \"Western ash\", the bridge and consequently the area around it became known as 红毛桥 *âng-mô͘-kiô*, short for \"concrete bridge\". Alternatively, the name could refer to a bridge reputedly constructed under the supervision of British engineer [John Turnbull Thomson](/wiki/John_Turnbull_Thomson) at what is today the intersection of [Upper Thomson Road](/wiki/Upper_Thomson_Road) and Ang Mo Kio Ave 1. The area of Ang Mo Kio has also been historically referred to as 九条桥 *káu-tiâu-kiô* (romanized in some sources as *Kou Teu Kio*), meaning \"nine bridges\". In the 1970s, the area's official Chinese name was changed to 宏茂桥 (Hokkien: *Âng-mô͘-kiô*, Mandarin: *Hóng mào qiáo*), meaning \"Bridge of Expansiveness and Prosperity\", though the original 红毛桥 is often still used in unofficial contexts. ## Geography ### Location Ang Mo Kio Planning Area, as defined by the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority), sits within the North-East region of Singapore, and has a total area of about 1,336 ha (3,300 acres). [Yishun](/wiki/Yishun) bounds Ang Mo Kio to the north, [Sengkang](/wiki/Sengkang) to the northeast, [Serangoon](/wiki/Serangoon) to the east, [Bishan](/wiki/Bishan,_Singapore) to the south and [Central Water Catchment](/wiki/Central_Water_Catchment) to the west. The main component of the planning area is Ang Mo Kio New Town. The town itself has seven neighbourhoods, with Neighbourhood 1 to the west, cycling in an anti-clockwise direction to Neighbourhood 6 to the north, and ending with Neighbourhood 7 for the town centre. The town centre is located in the heart of Ang Mo Kio and is sandwiched by two town gardens set on natural hillocks. ### Subzones Ang Mo Kio Planning Area is officially divided into 12 subzones for urban planning and statistical purposes. SubzoneLocationNotable structuresAccessibilityAng Mo Kio Town CentreAreas around Ang Mo Kio Central 1, Ang Mo Kio Central 2 and Ang Mo Kio Central 3Ang Mo Kio Public Library, [Ang Mo Kio Bus Interchange](/wiki/Ang_Mo_Kio_Bus_Interchange) and [AMK Hub](/wiki/AMK_Hub)[Ang Mo Kio MRT station](/wiki/Ang_Mo_Kio_MRT_station) and buses[Cheng San](/wiki/Cheng_San)Estates along Ang Mo Kio Street 51, Ang Mo Kio Street 52, Ang Mo Kio Street 53 and Ang Mo Kio Street 54[Ang Mo Kio MRT station](/wiki/Ang_Mo_Kio_MRT_station), [Ang Mo Kio Town Garden East](/wiki/Ang_Mo_Kio_Town_Garden_East) and [Anderson Secondary School](/wiki/Anderson_Secondary_School)[Ang Mo Kio MRT station](/wiki/Ang_Mo_Kio_MRT_station) and buses[Chong Boon](/wiki/Chong_Boon)Southeast Ang Mo Kio[Deyi Secondary School](/wiki/Deyi_Secondary_School) and [Pathlight School](/wiki/Pathlight_School)Buses[Kebun Baru](/wiki/Kebun_Baru)Precincts west of Ang Mo Kio Town Centre[Ang Mo Kio Town Garden West](/wiki/Ang_Mo_Kio_Town_Garden_West), Kebun Baru Community Club, Kebun Baru Neighbourhood Police Post, [CHIJ Saint Nicholas Girls' School](/wiki/CHIJ_Saint_Nicholas_Girls%27_School), Horizon Green, The Panorama, Horizon Gardens and [Mayflower MRT station](/wiki/Mayflower_MRT_station)[Mayflower MRT station](/wiki/Mayflower_MRT_station) and buses[Sembawang Hills](/wiki/Sembawang_Hills)Estates along Seraya Crescent, Casuarina Road, Nemesu Avenue, Old Upper Thomson Road, Sembawang Hills Drive and Thomson Hills Drive[Sembawang Hills Food Centre](/wiki/Sembawang_Hills_Food_Centre)BusesShangri-LaSouthwest Ang Mo Kio[Mayflower MRT station](/wiki/Mayflower_MRT_station), [Mayflower Secondary School](/wiki/Mayflower_Secondary_School), Ang Mo Kio Primary School, [Ang Mo Kio Secondary School](/wiki/Ang_Mo_Kio_Secondary_School) and Ang Mo Kio Community Centre[Mayflower MRT station](/wiki/Mayflower_MRT_station), [Ang Mo Kio MRT station](/wiki/Ang_Mo_Kio_MRT_station) and busesTagoreNorthwest Ang Mo KioTeacher's Estate, Tagore Industrial Estate, Thomson Nature Park and [Lentor MRT station](/wiki/Lentor_MRT_station)[Lentor MRT station](/wiki/Lentor_MRT_station), [Springleaf MRT station](/wiki/Springleaf_MRT_station) and busesTownsvilleAreas around Ang Mo Kio Street 31 and Ang Mo Kio Street 32Ang Mo Kio Swimming Complex, Teck Ghee Neighbourhood Police Post and Townsville Primary SchoolBuses[Yio Chu Kang](/wiki/Yio_Chu_Kang)Areas north of Ang Mo Kio Town Centre[Yio Chu Kang MRT station](/wiki/Yio_Chu_Kang_MRT_station), [Yio Chu Kang Bus Interchange](/wiki/Yio_Chu_Kang_Bus_Interchange), [Yio Chu Kang Stadium](/wiki/Yio_Chu_Kang_Stadium), Yio Chu Kang Swimming Complex, [Ang Mo Kio Police Division](/wiki/Ang_Mo_Kio_Police_Division) Headquarters, Ang Mo Kio North Neighbourhood Police Post, Ang Mo Kio Fire Station, Ang Mo Kio Bus Depot (SBS Transit) and [Anderson Junior College](/wiki/Anderson_Junior_College)[Yio Chu Kang MRT station](/wiki/Yio_Chu_Kang_MRT_station) and busesYio Chu Kang EastNortheast Ang Mo Kio[Nanyang Polytechnic](/wiki/Nanyang_Polytechnic), [ITE College Central](/wiki/ITE_College_Central) and Amoy Quee Camp[Yio Chu Kang MRT station](/wiki/Yio_Chu_Kang_MRT_station) and busesYio Chu Kang NorthAreas bounded by [Seletar Expressway](/wiki/Seletar_Expressway), [Central Expressway](/wiki/Central_Expressway,_Singapore), Yio Chu Kang Road and Lentor AvenueSungei Seletar Simpang KiriBusesYio Chu Kang WestAreas bounded by Ang Mo Kio Avenue 5, Ang Mo Kio Avenue 6 and Yio Chu Kang RoadAnderson Primary School, [Presbyterian High School](/wiki/Presbyterian_High_School), [Yio Chu Kang Secondary School](/wiki/Yio_Chu_Kang_Secondary_School) and [Lentor MRT station](/wiki/Lentor_MRT_station)[Yio Chu Kang MRT station](/wiki/Yio_Chu_Kang_MRT_station), [Lentor MRT station](/wiki/Lentor_MRT_station) and buses ## History ### Background and early history The present-day Ang Mo Kio area remained largely uninhabited throughout the 19th century. Settlers were attracted to the area only around the start of the 20th century, as a result of the rubber boom. In the old maps of Singapore, much of the area was labelled as the Ang Mo Kio Forest Reserve with many plantation estates. In 1934, *[The Straits Times](/wiki/The_Straits_Times)* stated that the mukim of Ang Mo Kio referred to the area between [Thomson Road](/wiki/Thomson_Road,_Singapore) and Yio Chu Kang Road, and consisted of rubber plantations. In August 1938, a then-unnamed village along Thomson Road was named Ang Mo Kio Village by the Singapore Rural Board. ### Development of Ang Mo Kio New Town Initially, Ang Mo Kio was designated as an industrial area housing motor workshops which had to be relocated due to the Urban Renewal Programme, but the plans were then modified to include areas for homes and communal amenities. Plans for the new town were announced by the then-[Minister for Law](/wiki/Minister_for_Law) and [National Development](/wiki/Ministry_of_National_Development_(Singapore)) [E.W. Barker](/wiki/E.W._Barker) in August 1973. The new town was planned to have a total of 45,000 flats, and be demarcated by Upper Thomson and Yio Chu Kang Roads, located adjacent to the [Serangoon Gardens](/wiki/Serangoon_Gardens) estate. To make way for the new town, 200 acres (81 ha) of land at Teck Ghee village was cleared, with the residents affected rehoused at the [Sin Ming road estate](/wiki/Sin_Ming). The HDB referred to the new town as a \"new generation\" town, and stated that its design was intended to facilitate gracious living, with flats with larger floor areas and buildings constructed further apart from one another. In addition, the town was slated to have industrial areas, shopping amenities, schools, and a 110 acres (45 ha) garden. Ang Mo Kio was also planned as the focal point of Singapore's motor repair industry, housing the Registrar of Vehicles' headquarters, and was the first town designed in metric dimensions. The first flats in the new town were completed in 1975, and construction work on the initial section of the 28 ha (69 acres) town centre, and on the new town's area office, was underway by September 1976. The town centre was planned to comprise a pedestrian mall, which encompassed most of the town centre, a hawker centre, an open area and a bus terminal, and to cater to residents of the new town along with the adjacent Mayflower and Serangoon Gardens estates. In April 1978, the Housing and Development Board introduced a new numbering system for blocks and streets, in which the numbers of the blocks and streets correspond to the neighbourhood that they are located in, in Ang Mo Kio, and subsequently for new towns developed thereafter. Construction work on a $13.3 million industrial area along Ang Mo Kio Avenue 5 commenced in June 1979. This industrial area was, according to the [Jurong Town Corporation](/wiki/Jurong_Town_Corporation), the first of a new kind of industrial park built beside housing estates. The construction of a polyclinic to serve the new town also commenced in the same year. In 1981, a 1.6 ha (4.0 acres) facility for swimming along Ang Mo Kio Avenue 1 was completed at a cost of $4.7 million, and in July 1981, the polyclinic in Ang Mo Kio commenced operations. The design of the town won the Singapore Institute of Architects (SIA) Outstanding Buildings Award in 1983. The swimming complex at Avenue 1 also won the 1986 SIA Architectural Award for its unique \"tetrahedral skylight\" design. The large commercialization of the Ang Mo Kio throughout the mid-1970s and 1980s also saw the rise of neighbourhood [startup businesses](/wiki/Startup_company) that remain prominent throughout Ang Mo Kio Town Centre today. One in particular eventually became one of Singapore's largest supermarket chains, [Sheng Siong](/wiki/Sheng_Siong). ### The 1980s and 1990s A 6 ha (15 acres) area of land adjacent to Ang Mo Kio Avenues 3 and 8 was converted into a park and opened as Ang Mo Kio's first town garden in 1981. Plans for a 22 ha (54 acres) park along Ang Mo Kio Avenues 5 and 6 were confirmed by the HDB in August 1981, with construction of the park, by then named [Ang Mo Kio Town Garden West](/wiki/Ang_Mo_Kio_Town_Garden_West), commencing in March 1983. ## Infrastructure Following the norm in the 1970s, most of the flats are organised in 12-storey long blocks or 25-storey point blocks. In recent years, certain parts of the estate have been rebuilt as part of the long process of renewal. As a result, segments of higher blocks clustered together can be seen interleaved with the older blocks.[*citation needed*] With Ang Mo Kio becoming a matured estate, several plots of residential land have been cleared up and sold to private developers for redevelopment. Many private residential projects are being constructed on these sites. ### Transportation #### Road network The town's road system utilize a hierarchy of road sizes by design: the major roads are referred to as \"Avenues\", and the local-access roads referred to as \"Streets\". Ang Mo Kio Avenue 12 is an exception as it is a small road in an industrial estate in Ang Mo Kio. The town's avenues are arranged in a grid-like pattern, with the streets filtering traffic from the avenues to the individual blocks. The town itself is served by the [Central Expressway](/wiki/Central_Expressway,_Singapore), providing a rapid link from the town to the rest of the island via the expressway network. In the town's road numbering system, avenues running from east to west are assigned odd numbers, with numbers increasing from south to north, while north–south avenues are assigned even numbers, increasing from west to east. Street numbers consist of two digits, with the first digit corresponding to the neighbourhood it belongs to and the second running in numerical sequence. Ang Mo Kio Town was the first town to introduce this road numbering system, and it has since been replicated in other towns such as [Hougang](/wiki/Hougang), [Jurong West](/wiki/Jurong_West) and [Woodlands](/wiki/Woodlands,_Singapore). The newer towns such as [Sengkang](/wiki/Sengkang) and [Punggol](/wiki/Punggol) no longer follow this system. #### Mass Rapid Transit The town is well served by a multi-modal public transport system. Four [Mass Rapid Transit](/wiki/Mass_Rapid_Transit_(Singapore)) stations currently serve the town, which are on the [North–South Line](/wiki/North%E2%80%93South_Line_(Singapore)) and [Thomson–East Coast Line](/wiki/Thomson%E2%80%93East_Coast_Line). They are: - [Yio Chu Kang](/wiki/Yio_Chu_Kang_MRT_station) - [Ang Mo Kio](/wiki/Ang_Mo_Kio_MRT_station) - [Lentor](/wiki/Lentor_MRT_station) - [Mayflower](/wiki/Mayflower_MRT_station) [Lentor MRT station](/wiki/Lentor_MRT_station) is located along Lentor Drive, near the junction between Ang Mo Kio Avenue 4 and Yio Chu Kang Road within the Tagore subzone. [Mayflower MRT station](/wiki/Mayflower_MRT_station) is located along Ang Mo Kio Avenue 4, within the [Kebun Baru](/wiki/Kebun_Baru) subzone. The two stations were scheduled to be opened in 2020, but instead opened on 28 August 2021 due to the [COVID-19 pandemic](/wiki/COVID-19_pandemic). The line runs parallel to the North South line towards [Woodlands](/wiki/Woodlands,_Singapore) and the city centre as well as offering direct connections to the eastern parts of Singapore. In addition, the future [Teck Ghee station](/wiki/Teck_Ghee_MRT_station) on the [Cross Island MRT line](/wiki/Cross_Island_Line) will serve the town alongside the existing stations on the North South line and Thomson–East Coast line. The station will be located underneath Ang Mo Kio Avenue 6, between the junctions of Ang Mo Kio Street 31 and Ang Mo Kio Avenue 1 and will open in 2030 instead of 2029 due to the [COVID-19 pandemic](/wiki/COVID-19_pandemic). #### Bus The [Ang Mo Kio Bus Interchange](/wiki/Ang_Mo_Kio_Bus_Interchange) is directly linked to the [Ang Mo Kio MRT station](/wiki/Ang_Mo_Kio_MRT_station) via an underground pedestrian walkway, and provides feeder bus services from the MRT stations to each neighbourhood. [Yio Chu Kang MRT station](/wiki/Yio_Chu_Kang_MRT_station) is also served by bus services via the [Yio Chu Kang Bus Interchange](/wiki/Yio_Chu_Kang_Bus_Interchange) sited beside the station. Both bus interchanges offer trunk bus services to connect the town with the rest of the island, including a rapid connection to the city centre in the [Central Area](/wiki/Central_Area,_Singapore), as well as other financial and commercial districts in the [central region of Singapore](/wiki/Central_Region,_Singapore), including [Shenton Way](/wiki/Shenton_Way), [Orchard Road](/wiki/Orchard_Road), [Marina Centre](/wiki/Marina_Centre) and [Marine Parade](/wiki/Marine_Parade). ### Amenities Administrative, legal, medical, religious, and social services catering towards the general public may also be found in the Ang Mo Kio area, with a major community hospital, [Ang Mo Kio - Thye Hua Kwan Hospital](/wiki/Ang_Mo_Kio_-_Thye_Hua_Kwan_Hospital), that offers rehabilitative care. The parks in the area include [Ang Mo Kio Town Garden East](/wiki/Ang_Mo_Kio_Town_Garden_East), a 5 ha (12 acres) park adjacent to Ang Mo Kio MRT station, along with the 22 ha (54 acres) Ang Mo Kio Town Garden West adjacent to Ang Mo Kio Avenues 5 and 6. Several shopping malls are also found in Ang Mo Kio Central: - [AMK Hub](/wiki/AMK_Hub) - Broadway Plaza - Djitsun Mall - Jubilee Square Among these malls, AMK Hub is directly connected to the Ang Mo Kio Bus Interchange, and host a varieties of commercial including the Cathay Cineplex AMK Hub. ## Education Ang Mo Kio New Town has a total of seven primary schools, seven secondary schools, three tertiary institutions and two special needs schools as of 2024. The list is as follows: ### Primary schools - Anderson Primary School - Ang Mo Kio Primary School - [CHIJ St Nicholas Girls' School (Primary)](/wiki/CHIJ_Saint_Nicholas_Girls%27_School) - Jing Shan Primary School - Mayflower Primary School - Teck Ghee Primary School - Townsville Primary School (to be relocated to [Sembawang](/wiki/Sembawang) in 2029) ### Secondary schools - [Anderson Secondary School](/wiki/Anderson_Secondary_School) - [Ang Mo Kio Secondary School](/wiki/Ang_Mo_Kio_Secondary_School) - [CHIJ St Nicholas Girls' School (Secondary)](/wiki/CHIJ_Saint_Nicholas_Girls%27_School) - [Deyi Secondary School](/wiki/Deyi_Secondary_School) - [Mayflower Secondary School](/wiki/Mayflower_Secondary_School) - [Presbyterian High School](/wiki/Presbyterian_High_School) - [Yio Chu Kang Secondary School](/wiki/Yio_Chu_Kang_Secondary_School) ### Tertiary institutions - [Anderson Serangoon Junior College](/wiki/Anderson_Serangoon_Junior_College) - [ITE College Central](/wiki/ITE_College_Central) - [Nanyang Polytechnic](/wiki/Nanyang_Polytechnic) Several preschools can be found in Ang Mo Kio including the [Al-Muttaqin Mosque](/wiki/Al-Muttaqin_Mosque) Kindergarten, childcare centres operated by the [National Trades Union Congress](/wiki/National_Trades_Union_Congress) named My First Skool and also kindergartens managed under the [PAP Community Foundation](/wiki/PAP_Community_Foundation). Two special schools may also be found, Chaoyang School (APSN) which caters for children with mild intellectual disability aged 7–12 years old, and [Pathlight School](/wiki/Pathlight_School) with two campuses in Ang Mo Kio with a focus on autism. ## Notable places - [259 Ang Mo Kio Avenue 2](/wiki/259_Ang_Mo_Kio_Avenue_2), only circular housing block built by HDB ## Politics The jurisdiction of the area has been largely handled by Ang Mo Kio Town Council which oversees [Ang Mo Kio Group Representation Constituency](/wiki/Ang_Mo_Kio_Group_Representation_Constituency) since 1991, and also Kebun Baru and Yio Chu Kang SMCs since 2020. The former [Prime Minister of Singapore](/wiki/Prime_Minister_of_Singapore), [Lee Hsien Loong](/wiki/Lee_Hsien_Loong), is a member of Ang Mo Kio Town Council and the constituency of the same name. Another constituency had assumed control over part of Ang Mo Kio which was [Nee Soon Group Representation Constituency](/wiki/Nee_Soon_Group_Representation_Constituency) for the Kebun Baru division. In light of the [2020 general election](/wiki/2020_Singaporean_general_election), the Kebun Baru division of Nee Soon GRC will become an [SMC of its own](/wiki/Kebun_Baru_Single_Member_Constituency) and following the election victory, the constituency is now under the jurisdiction of Ang Mo Kio Town Council. Previously, the [Cheng San Group Representation Constituency](/wiki/Cheng_San_Group_Representation_Constituency) from 1988 to 2001 have handled parts of Ang Mo Kio such as Cheng San, Chong Boon and Jalan Kayu. Chong Boon was transferred to Ang Mo Kio GRC in 1997. [Yio Chu Kang Single Member Constituency](/wiki/Yio_Chu_Kang_Single_Member_Constituency) has handled parts of Ang Mo Kio from 2006 to 2011, and has since been returned into a [SMC](/wiki/Yio_Chu_Kang_Single_Member_Constituency) ahead of the 2020 elections. In the [2025 general election](/wiki/2025_Singaporean_general_election), [Jalan Kayu Single Member Constituency](/wiki/Jalan_Kayu_Single_Member_Constituency) was carved out from Ang Mo Kio GRC. ## Notes - Singapore portal\n",
  "language": "en",
  "processed_at": "2026-01-12T09:52:26.766645",
  "title": "Ang Mo Kio",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Ang_Mo_Kio"
}