{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:52:39.586169"
  },
  "content": "Secret societyCriminal organization **Ang Soon Tong** is a [secret society](/wiki/Secret_societies_in_Singapore) and gang based in [Singapore](/wiki/Singapore) and [Malaysia](/wiki/Malaysia) which has been active since the 1950s, mainly in the [Sembawang](/wiki/Sembawang) area of Singapore. The gang engages in criminal activities including drug trafficking, arms smuggling, illegal moneylending and illegal gambling. In 1998, a 19-year-old youth was arrested for setting up a website dedicated to the society. In 2020, an Ang Soon Tong member was sentenced to reformative probation for clashing with members of another gang. ## Notable members ### Soosay Sinnappen On 27 October 1990, Soosay Sinnappen, a Malaysian member of Ang Soon Tong, and his friend Kuppiah Saravanan confronted Lim Yeow Chuan, a transvestite who had allegedly stolen a gold chain from their friend in [Bugis](/wiki/Bugis,_Singapore). Lim refused to return the gold chain and denied stealing it, and even threatened the two men with a knife. This sparked a fight between Lim and the two men; Soosay disarmed Lim and fatally stabbed him a few times before leaving with Kuppiah. In January 1991, Singapore police arrested Kuppiah and Soosay. At the time, Soosay was also involved in the [murder of Sivapragasam Subramaniam](/wiki/Murder_of_Sivapragasam_Subramaniam). Both Kuppiah and Soosay were charged with the murder of Lim. Kuppiah was sentenced to five years' imprisonment and 12 [strokes of the cane](/wiki/Caning_in_Singapore) after the charge was reduced to robbery with hurt, while Soosay was sentenced to death for murder. After making an appeal, Soosay's charge was reduced to manslaughter and he was sentenced to nine years' imprisonment. For his involvement in Sivapragasam's murder, Soosay was found guilty and given a second sentence of four years' imprisonment and six strokes of the cane. ### Sagar Suppiah Retnam Sagar Suppiah Retnam, the headman of Ang Soon Tong in [Jurong](/wiki/Jurong), led 14 gang members to attack a rival gang, Gi Leng Hor, in [Marsiling](/wiki/Marsiling) in December 1990. They attacked six passersby whom they thought were Gi Leng Hor members, causing the death of one Sivapragasam Subramaniam and seriously injuring the other five. Sagar was arrested in Malaysia three years later, extradited to Singapore, and charged with the murder of Sivapragasam. He was found guilty and sentenced to death by the [High Court of Singapore](/wiki/High_Court_of_Singapore) on 31 May 1994. On 7 July 1995, Sagar was hanged after losing his appeal and plea for clemency to the [President of Singapore](/wiki/President_of_Singapore). The other members of Sagar's gang were sentenced to imprisonment of between 31 months and seven years (in addition to caning for some of them) for lesser charges of rioting and inflicting grievous hurt. ### Tan Chor Jin Tan Chor Jin, nicknamed \"One-eyed Dragon\", was a member of Ang Soon Tong. On 15 February 2006, Tan used a semi-automatic [Beretta](/wiki/Beretta) 0.22 calibre pistol to kill Lim Hock Soon, a nightclub owner, in [Serangoon](/wiki/Serangoon). After the shooting, Tan fled to Malaysia and attempted to travel to Thailand before he was arrested by Malaysian police in [Kuala Lumpur](/wiki/Kuala_Lumpur) and extradited to Singapore. In 2007, he was convicted of murder and [sentenced to death](/wiki/Capital_punishment_in_Singapore) by the [High Court of Singapore](/wiki/High_Court_of_Singapore). He was hanged at dawn on 9 January 2009. ## Incidents ### Gang fight over funeral banner In December 1995, Ang Soon Tong clashed with a rival gang, See Tong, over a funeral banner. The gang members were arrested and imprisoned. ### Murder of Leong Fook Weng Leong Fook Weng, a former Ang Soon Tong member, left the gang and joined another gang, Loh Kuan. Five Ang Soon Tong members, led by one See Chee Keong, decided to punish Leong for leaving their gang and attacked him on 17 May 2000. During the attack, See fatally stabbed Leong in the chest and neck with a blade hidden in a lighter. See fled to Thailand the next day and was only arrested in Cambodia in December 2000 while attempting to smuggle illegal drugs to Malaysia. He was charged in a Cambodian court and sentenced to 18 years' imprisonment for drug trafficking. After serving 13 years in a Cambodian prison, See received a royal pardon and was released on 26 November 2013 and deported to Singapore. Two of the other men involved in the attack, Robson Tay Teik Chai and William Ho Kay Wei, were arrested and charged in court in 2003. Tay was sentenced to nine years' imprisonment and 12 strokes of the cane for culpable homicide, while Ho was sentenced to six months' imprisonment for failing to report an alleged murder to the police. On 20 April 2016, See was sentenced to ten years' imprisonment for culpable homicide not amounting to murder. The two other fugitives, Ong Chin Huat and Lim Hin Teck, were still on the run at the time. ### Alleged harassment of Yishun resident by gang member In 2019, Julius Chen, a resident of [Yishun](/wiki/Yishun), alleged on social media that an Ang Soon Tong member had extorted S$100 from him. Chen apparently subsequently saw the member again at a coffee shop at Block 414 on 30 March 2019, where he attempted to retrieve his money. The member responded by claiming that he was an Ang Soon Tong member and made a phone call for backup. Six Indian men allegedly later arrived at the coffee shop, threatening Chen. The police later arrived and separated Chen and the gang, giving a warning to the gang. ### Extortion and assault in Klang, Malaysia 2015 Ang Soon Tong attempted to control areas in [Klang](/wiki/Klang_(city)), a city in Malaysia, by sending [parangs](/wiki/Parang_(knife)) and [katanas](/wiki/Katana) to gang members for them to use to assault two gardening contractors who refused to pay extortion money at a construction site in [Pulau Indah](/wiki/Pulau_Indah) on 4 September 2015. The gardening contractors were fatally injured and hospitalized. The [Royal Malaysia Police](/wiki/Royal_Malaysia_Police) later arrested 12 Ang Soon Tong members and issued a wanted notice for the local gang leader. - [Secret societies in Singapore](/wiki/Secret_societies_in_Singapore) - [Secret society](/wiki/Secret_society)\n",
  "language": "en",
  "processed_at": "2026-01-12T09:52:39.585719",
  "title": "Ang Soon Tong",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Ang_Soon_Tong"
}