{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:52:32.128028"
  },
  "content": "Public library in Singapore 1°22′29.17″N 103°50′43.56″E﻿ / ﻿1.3747694°N 103.8454333°E﻿ / 1.3747694; 103.8454333 **Ang Mo Kio Public Library** ([Simplified Chinese](/wiki/Simplified_Chinese): 宏茂桥社区图书馆) is one of the 26 public libraries established by the [National Library Board](/wiki/National_Library_Board) of [Singapore](/wiki/Singapore). Located along Ang Mo Kio Avenue 6 within walking distance of [Yio Chu Kang MRT station](/wiki/Yio_Chu_Kang_MRT_station), it serves the residents of the surrounding [Ang Mo Kio GRC](/wiki/Ang_Mo_Kio_Group_Representation_Constituency). As a standalone two-storey building, the library is a prominent landmark in central Ang Mo Kio. ## History **Ang Mo Kio Community Library** was officially opened on 17 August 1985 by [Yeo Toon Chia](/wiki/Yeo_Toon_Chia), then [Member of Parliament](/wiki/Member_of_Parliament) for [Ang Mo Kio Constituency](/wiki/Ang_Mo_Kio_Single_Member_Constituency), and was opened to the public on 19 August. The library was closed in March 2002 for renovation, and was officially reopened on 5 January 2003 by [Vivian Balakrishnan](/wiki/Vivian_Balakrishnan), then Minister of State for National Development. It was renamed as **Ang Mo Kio Public Library** in 2008. ### Relocation The library is slated to move into [AMK Hub](/wiki/AMK_Hub) in 2026, taking over the space formerly occupied by the [cinema](/wiki/Cathay_Cineplexes) at Level 4. It will improve accessiblity and convenience to patrons and commuters as the mall is located along major public transport nodes such as the MRT station and bus interchange. Following the move, the current site will be redeveloped into a healthcare facility to complement the neighbouring polyclinic, as stated on the URA Draft Master Plan 2025. ## Layout Covering an area of 4,277 m2, the library spans two levels and serves the residents of Ang Mo Kio GRC, which consists of [Chong Boon](/wiki/Chong_Boon), [Ang Mo Kio](/wiki/Ang_Mo_Kio), [Kebun Baru](/wiki/Kebun_Baru) and [Yio Chu Kang](/wiki/Yio_Chu_Kang). ### First floor - Children's collection - Adult fiction - Magazines - Cafe Galilee ### Second floor - Young people's collection - Adult non-fiction - Indian Library Services - containing the most comprehensive collection of [Tamil](/wiki/Tamil_language) print and audiovisual material among Singapore's libraries. - Chinese and Malay collections - Quiet Reading Room ([Newspapers](/wiki/Newspapers)) - National Library Board This article about a Singapore building or structure is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T09:52:32.127546",
  "title": "Ang Mo Kio Public Library",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Ang_Mo_Kio_Public_Library"
}