{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:52:40.935302"
  },
  "content": "Orthopedic surgeon **Ang Swee Chai** ([Chinese](/wiki/Chinese_language): 洪瑞钗) is an orthopedic surgeon and author. She is a co-founder of the charity [Medical Aid for Palestinians](/wiki/Medical_Aid_for_Palestinians). ## Early life and education Ang was born in [Penang](/wiki/Penang), Malaysia but raised in [Singapore](/wiki/Singapore). The family had also one son and two other daughters. She attended Kwong Avenue Primary School, [Raffles Girls' School](/wiki/Raffles_Girls%27_School_(Secondary)), and the [National University of Singapore](/wiki/National_University_of_Singapore) where she studied medicine. She then received a master's degree in Occupational Medicine in 1976. ## Career ### Medical career After graduating from NUS, she worked in Singapore's public hospitals. After joining her husband, Francis Khoo, in London, Ang trained to be an orthopaedic surgeon in Britain, where she obtained her [FRCS (Eng)](/wiki/FRCS_(Eng)) and completed her training in [Newcastle](/wiki/Newcastle_upon_Tyne). She later became the first female consultant orthopaedic surgeon at [St Bartholomew's Hospital](/wiki/St_Bartholomew%27s_Hospital) in London. ### Humanitarian missions In August 1982, Ang responded to an appeal for medical personnel from [Christian Aid](/wiki/Christian_Aid) to treat war casualties in [Lebanon](/wiki/Lebanon) and went to work at the Gaza Hospital near the Sabra and [Shatila refugee camp](/wiki/Shatila_refugee_camp) in [Beirut](/wiki/Beirut). The following month, she became witness to the [Sabra-Shatila](/wiki/Sabra_and_Shatila_massacre) massacre during the [Israeli invasion of Lebanon in 1982](/wiki/1982_Lebanon_War). She and two other hospital staff testified to [Israeli Kahan Commission](/wiki/Kahan_Commission) on the [Sabra and Shatila massacre](/wiki/Sabra_and_Shatila_massacre) in September 1982. Ang would also testify to the massacre in front of the [Kuala Lumpur War Crimes Commission](/wiki/Kuala_Lumpur_War_Crimes_Commission) in 2013, during a hearing that eventually found the State of Israel guilty of [genocide](/wiki/Genocide). With her husband, Francis Khoo, and some friends, Ang helped to form the British charity, [Medical Aid for Palestinians](/wiki/Medical_Aid_for_Palestinians), following the 1982 massacres. In 1988, Ang made her first trip to Gaza, where she worked as an orthopaedic surgeon at the Al Ahli Arab Hospital. During her time there, she also served as an ambulance driver amid ongoing conflict. In 2018, Ang joined the [Just Future For Palestine Flotilla](/wiki/Just_Future_For_Palestine_Flotilla), which attempted to run the [blockade of the Gaza Strip](/wiki/Blockade_of_the_Gaza_Strip) by Israel, to tend to the medical needs of Palestinians there. The boat that she was on was seized by Israeli forces before it could arrive at its intended destination. She was briefly detained before being deported back to United Kingdom. In 2024, Ang returned to Lebanon to treat patients injured by what she described as [\"pager attacks\" linked to Israeli operations](/wiki/2024_Lebanon_electronic_device_attacks). These explosive devices caused extensive trauma, including mutilated limbs, facial injuries, and brain damage. Reflecting on the spirit of her patients, she described a conversation with a man who had lost his hand but expressed no regret, saying it was the price he paid \"for standing with humanity and justice in Gaza.\" As of 2025, Ang has worked nearly 50 years in the United Kingdom's National Health Service (NHS), and over 43 years in support of the Palestinian people through direct medical care, advocacy, and education. ## Personal life In 1977, Ang married Singaporean human rights lawyer Francis Khoo. Two weeks after the marriage, she was briefly detained during a government crackdown on dissidents as the authority attempted to arrest her husband. She fled to [London](/wiki/London) to be with her husband and they were granted asylum there. Khoo died on 20 November 2011 in London of a suspected heart attack. Ang received her British passport in 1992, after applying for it in 1990 having had faced difficulties in her earlier travels to countries in Middle-East region to support or conduct humanitarian missions there as she was travelling on a refugee travel documentation. Singapore does not allow dual citizenship and would typically ask a dual-citizen to renounce one citizenship. However, she resisted renouncing her British citizenship as it would lose her her home and work in United Kingdom, and had also promised her husband that she would not give up on her Singaporean citizenship. Her Singaporean citizenship was stripped after a committee of inquiry was held in Singapore in 2020. ## Awards and honours In 1987, President [Yasser Arafat](/wiki/Yasser_Arafat) awarded Ang the [Star of Palestine](/wiki/Decorations,_medals_and_badges_of_Palestine#Decorations), the highest award for service to the Palestinian people. In 2016, Ang was inducted into the [Singapore Women's Hall of Fame](/wiki/Singapore_Women%27s_Hall_of_Fame). She was not able to receive the award in person due to the issue over her dual-citizenship at that time. In 2024, Ang received the HCS Fellow Award from Harvard Club Of Singapore. ## Talks and public engagements Ang has spoken publicly on numerous occasions about her experiences in war zones, the responsibilities of medical professionals in conflict, and the ongoing humanitarian crisis in Palestine. Her talks emphasize the power of compassion, justice, and small acts of resistance in the face of large-scale suffering.[*citation needed*] On 6 December 2013, she delivered a TEDx talk at University College London (UCL), titled *Making a Small Difference*, during UCL's first-ever TEDxWomen event. In the talk, she drew from her work in hospitals and conflict zones, particularly Palestine and Lebanon, to illustrate how seemingly small actions can have a profound impact on people's lives. The talk received a standing ovation and was described as \"refreshingly honest and incredibly moving.\" She has also participated in other speaking engagements, interviews, and humanitarian forums to raise awareness about medical ethics, refugee crises, and the Palestinian struggle.[*citation needed*] ## Controversies On 24 September 2014, *The* *Telegraph* reported that Ang had forwarded a video entitled \"CNN Goldman Sachs & the Zio Matrix\" featuring [Ku Klux Klan](/wiki/Ku_Klux_Klan) leader [David Duke](/wiki/David_Duke). Ang responded by saying \"I am concerned that if there is any truth in the video, that Jews control the media, politics and banking, what on earth is going on? I was worried.\" ## Publications - *From Beirut to Jerusalem : a woman surgeon with the Palestinians*. [OCLC](/wiki/OCLC_(identifier)) 123789315. - *从贝鲁特到耶路撒冷* (in Chinese). Translated by 林康. [ISBN](/wiki/ISBN_(identifier)) 9789670960050. (Chinese translation) - \"War surgery: Field manual. H. Husum, Swee Chai Ang & E. Fosse. Penang: Third World Network, 1995. 764 pp. Price US$100 (softcover), US$ 140 (hardcover) plus postage. Available to 'Third World' countries at US$ 25 (softcover), US$ 35 (hardcover) plus postage. ISBN 983-9747-14-2\". *Transactions of the Royal Society of Tropical Medicine and Hygiene*. **91** (3): 368. May–June 1997. [doi](/wiki/Doi_(identifier)):10.1016/S0035-9203(97)90116-4. ## External links - From Beirut to Jerusalem, by Ang Swee Chai\n",
  "language": "en",
  "processed_at": "2026-01-12T09:52:40.934819",
  "title": "Ang Swee Chai",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Ang_Swee_Chai"
}