{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:52:28.896109"
  },
  "content": "Police division in Singapore The **Ang Mo Kio Police Division** (or **'F' Division**) is one of the seven land divisions of the [Singapore Police Force](/wiki/Singapore_Police_Force). It was first established in 1965. It was previously located in Paya Lebar. In 1987, the division HQ moved to its present location (51 Ang Mo Kio Avenue 9 Singapore 569784) to better serve the public and meet its operational needs. Ang Mo Kio Division serves a residential population of over 1.1 million residents. Ang Mo Kio Division’s area of coverage includes mature housing estates such as Ang Mo Kio, Hougang and Serangoon. It also oversees young but rapidly-developing residential estates like Sengkang and Punggol. ## History 'F' Division was first formed in 1965 with its headquarters in the [Paya Lebar Police Station](/wiki/Singapore_Police_Force#Defunct_Units/Facilities) at Upper Paya Lebar Road. Changing demographies and the rapid development of the suburbs resulted in the shifting of the divisional headquarters to its present location in [Ang Mo Kio](/wiki/Ang_Mo_Kio) in 1987. When the [Toa Payoh Police Division](/wiki/Toa_Payoh_Police_Division) was closed in 1988, 'F' Division took over half its areas of control while [Tanglin Police Division](/wiki/Tanglin_Police_Division) took over the rest. Also, when the Geylang Police Division was closed in December 2000, 'F' Division took over 40% of its areas of control, while 50% came under the [Bedok Police Division](/wiki/Bedok_Police_Division) and the remainder went to [Central Police Division](/wiki/Central_Police_Division). In November 2018, [Woodlands Police Division](/wiki/Woodlands_Police_Division) was formed, and took over operations of three NPCs from Ang Mo Kio Police Division (Yishun North NPC, Yishun South NPC, Sembawang NPC). Prior to the reorganization, it was the largest police division in terms of residents served. ### Incidents - On 2 December 1973, PC Mohammed Sanusi bin Siraj, 26, was refuelling his police van at the [Paya Lebar Police Station](/wiki/Singapore_Police_Force#Defunct_Units.2FFacilities) when he spotted a police mini-bus rolling down a slope. He tried to stop the vehicle, but was run over instead. He died four hours later in hospital. - PC Mohd Sarwar S/O Mohd Afzal, 36, died in hospital from his injuries sustained in a traffic accident on 4 July 1985 when the patrol car he was driving collided into the back of a taxi in April 1985. - Police [national serviceman](/wiki/National_service_in_Singapore) SC/Cpl Arvin Rangoonathan, 20, was found dead in Yishun North Neighbourhood Police Centre in the morning of 2 July 2005 in the fourth-storey gymnasium. He was found to have shot himself in an attempt to play [Russian roulette](/wiki/Russian_roulette).[*citation needed*] - SSgt Noranzor bin Abdul Latiff, 32, lost control of his police motorbike along Yio Chu Kang Road near the Tamarind Road junction and died from internal chest injuries sustained after being thrown off his vehicle on 9 October 2005. His partner who was riding ahead of him was not involved in the accident. - SSSgt Jansen S.M. Xavier Santhansamy, an Investigations Officer, was found dead with a gunshot wound to his head at his residence in the morning of 6 February 2006. ## Establishments - Ang Mo Kio Division HQ - Ang Mo Kio North Neighbourhood Police Centre - Kebun Baru Neighbourhood Police Post - Ang Mo Kio South Neighbourhood Police Centre - Teck Ghee Neighbourhood Police Post - Hougang Neighbourhood Police Centre - Hougang Neighbourhood Police Post - Paya Lebar Neighbourhood Police Post - Punggol Neighbourhood Police Centre - Serangoon Neighbourhood Police Centre - Serangoon Garden Neighbourhood Police Post - Serangoon North Neighbourhood Police Post - Sengkang Neighbourhood Police Centre - Woodleigh Neighbourhood Police Centre - Ang Mo Kio Police Division\n",
  "language": "en",
  "processed_at": "2026-01-12T09:52:28.895563",
  "title": "Ang Mo Kio Police Division",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Ang_Mo_Kio_Police_Division"
}