{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:52:44.640253"
  },
  "content": "Treaty between the United Kingdom and the Netherlands The **Anglo-Dutch Treaty of 1824**, also known as the **Treaty of London** ([Dutch](/wiki/Dutch_language): *Verdrag van Londen*), was a treaty between the [United Kingdom](/wiki/United_Kingdom_of_Great_Britain_and_Ireland) and the [Netherlands](/wiki/United_Kingdom_of_the_Netherlands) in London on 17 March 1824. The treaty was to resolve disputes arising from the execution of the [Anglo-Dutch Treaty of 1814](/wiki/Anglo-Dutch_Treaty_of_1814). For the Dutch, it was signed by Hendrik Fagel and [Anton Reinhard Falck](/wiki/Anton_Reinhard_Falck), and for the British, [George Canning](/wiki/George_Canning) and [Charles Williams-Wynn](/wiki/Charles_Williams-Wynn_(1775%E2%80%931850)). ## History The Anglo-Dutch Treaty of 1824, designed to solve issues arising from British occupation of [Dutch colonial possessions](/wiki/Dutch_colonial_empire) during the [Napoleonic Wars](/wiki/Napoleonic_Wars), as well as trading rights existing for hundreds of years in the [Spice Islands](/wiki/Maluku_Islands) between the two nations, addressed a wide array of issues but did not clearly describe limitations of expansion by either side in [Maritime Southeast Asia](/wiki/Maritime_Southeast_Asia). The [British establishment of Singapore](/wiki/Founding_years_of_modern_Singapore) on the [Malay Peninsula](/wiki/Malay_Peninsula) in 1819 by Sir [Stamford Raffles](/wiki/Stamford_Raffles) exacerbated tensions between the two nations, especially as the Dutch claimed that the treaty signed between Raffles and the Sultan of Johor was invalid and that the [Sultanate of Johor](/wiki/Sultanate_of_Johore) was under the Dutch sphere of influence. Dutch trading rights in British India and former Dutch possessions in the area were also points of contention. In 1820, under pressure from British merchants with interests in the [Far East](/wiki/Far_East), negotiations to clarify the situation in Southeast Asia started. Negotiations between [Lord Castlereagh](/wiki/Lord_Castlereagh), Canning's predecessor, and Fagel started on 20 July 1820. The Dutch were adamant that the British should abandon Singapore, but Castlereagh was unsure exactly how Singapore had even been acquired. At first, only noncontroversial issues such as free navigation rights and the elimination of piracy were agreed upon. Discussions on the subject were suspended on 5 August 1820, and did not resume until 1823, when the commercial value of Singapore was understood by the British. Negotiations resumed in December 1823, centred around establishment of clear spheres of influence in the region. The Dutch, realising that the growth of Singapore could not be curbed, pressed for an exchange in which they would abandon their claims north of the [Strait of Malacca](/wiki/Strait_of_Malacca) and their [Indian colonies](/wiki/Dutch_India) in exchange for confirmation of their claims south of the strait, including the British colony of [Bencoolen](/wiki/British_Bencoolen). The final treaty was signed on 17 March 1824 by Fagel and Canning. The treaty was ratified by the UK on 30 April 1824 and by the Netherlands on 2 June 1824. The ratifications were exchanged at London on 8 June 1824. ## Terms - Subjects of the two nations were permitted to trade in territories of [British India](/wiki/British_India), [British Ceylon](/wiki/British_Ceylon), and modern-day [Indonesia](/wiki/Indonesia), [Singapore](/wiki/Singapore) and [Malaysia](/wiki/Malaysia) on the basis of \"[most favoured nation](/wiki/Most_favoured_nation)\" but had to obey local regulations. - Fees charged on the subjects and ships of the other nation were limited. - No further treaties with Eastern states that excluded trade with the other nation were to be made. - Civil and military forces were not to be used to hinder trade. - [Piracy](/wiki/Piracy) was to be opposed, no hiding places or protection to pirates were to be provided and the sale of pirated goods was not to be allowed. - Officials were not allowed to open new offices on East Indies islands without permission from their government in Europe. - British subjects to be given trade access with the [Maluku Islands](/wiki/Maluku_Islands), in particular with [Ambon](/wiki/Ambon_Island), [Banda](/wiki/Banda_Islands), and [Ternate](/wiki/Ternate). - The Netherlands ceded all establishments on the [Indian subcontinent](/wiki/Indian_subcontinent) ([Dutch India](/wiki/Dutch_India) from 1609) and any rights associated with them. - The UK ceded its factory of Fort Marlborough in [Bencoolen](/wiki/Bencoolen_Presidency) ([Bengkulu](/wiki/Bengkulu_City)) and all the British possessions on the island of [Sumatra](/wiki/Sumatra) to the Netherlands and would not establish another office on the island or make any treaty with its rulers. - The Netherlands ceded the city and fort of [Malacca](/wiki/Dutch_Malacca) and agreed not to open any office on the [Malay Peninsula](/wiki/Malay_Peninsula) or to make any treaty with its rulers. - The British withdrew its opposition to the occupation of the island of [Billiton](/wiki/Belitung) by the Netherlands. - The Netherlands withdrew its opposition to the occupation of the island of [Singapore](/wiki/Singapore) by the British. - The British agreed not to establish any office on the [Carimon Islands](/wiki/Karimun_Regency) or on the islands of [Batam](/wiki/Batam), [Bintan](/wiki/Bintan), [Lingin](/wiki/Lingga_Regency), or any of the other islands south of the strait of Singapore, or to make any treaties with the rulers of these places. - All transfers of property and establishments were to take place on 1 March 1825, with the return of [Java](/wiki/Java) to the Netherlands, as according to a Convention on Java of 24 June 1817, was settled, apart from a sum of 100,000 [pounds sterling](/wiki/Pounds_sterling), which was to be paid by the Netherlands in [London](/wiki/London) before the end of 1825. ## Implications The Anglo-Dutch Treaty of 1824 officially demarcated two territories: [Malaya](/wiki/British_Malaya), which was ruled by the United Kingdom; and the [Dutch East Indies](/wiki/Dutch_East_Indies), which was ruled by the Netherlands. The successor states of Malaya are Malaysia and Singapore, and the successor state of the Dutch East Indies is Indonesia. The line that separated the spheres of influence between the British and the Dutch ultimately became the [border between Indonesia and Malaysia](/wiki/Indonesia-Malaysia_Border) (with a small segment becoming the [border between Indonesia and Singapore](/wiki/Indonesia-Singapore_border)). The subsequent colonial influence also affected the [Malay language](/wiki/Malay_language) that was commonly spoken as a regional language between these islands, [diverging into](/wiki/Comparison_of_Indonesian_and_Standard_Malay) [Malaysian](/wiki/Malaysian_language) and [Indonesian](/wiki/Indonesian_language) variants. - [Anglo-Dutch Treaty of 1814](/wiki/Anglo-Dutch_Treaty_of_1814) - [Anglo-Dutch Treaties of 1870–1871](/wiki/Anglo-Dutch_Treaties_of_1870%E2%80%931871) - [Netherlands–United Kingdom relations](/wiki/Netherlands%E2%80%93United_Kingdom_relations) - [1824 in Singapore](/wiki/1824_in_Singapore) - Text in English - Webster, Anthony. (1998) *Gentlemen Capitalists: British Imperialism in Southeast Asia*, Tauris Academic Studies, New York, [ISBN](/wiki/ISBN_(identifier)) 1-86064-171-7.\n",
  "language": "en",
  "processed_at": "2026-01-12T09:52:44.639827",
  "title": "Anglo-Dutch Treaty of 1824",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Anglo-Dutch_Treaty_of_1824"
}