{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:52:47.964641"
  },
  "content": "Singaporean NGO and animal welfare charity **Animal Concerns Research and Education Society** (**ACRES**) is a [non-governmental organisation](/wiki/Non-governmental_organisation) and a registered [animal welfare](/wiki/Animal_welfare) [charity](/wiki/Charitable_organization) with the [Ministry of Culture, Community and Youth](/wiki/Ministry_of_Culture,_Community_and_Youth) (MCCY) in [Singapore](/wiki/Singapore). It aims to raise awareness of animal welfare issues, adopts animal research projects and their findings for public outreach and education, and partners with authorities and related parties. ## History The organization was founded in 2001 by [Louis Ng](/wiki/Louis_Ng) when he was still a [National University of Singapore](/wiki/National_University_of_Singapore) undergraduate. He began full-time work at ACRES upon his graduation in 2002. In November 2013, ACRES opened a wildlife sanctuary at their Wildlife Rescue Centre to house animals, including tortoises, turtles and iguanas, that were rescued from illegal wildlife trade. As of February 2017, ACRES has more than 100 wild animals waiting to be sent back into the wild in their native countries. In 2004, ACRES sent Blue, a vervet monkey, back to Zambia, and in 2006, Asha, a rhesus macaque, back to India. On 2 February 2017, Rahayu, a Malaysian giant turtle, was sent back to Malaysia after more than a year of negotiations with the Malaysian wildlife authorities. It was later the first reptile to be successfully released back into the wild. On 16 April 2018, six rescued reptiles, four giant Asian turtles, and two elongated tortoises were sent back to Malaysia, as ACRES' first mass repatriation. - Official website This Singapore-related article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T09:52:47.964273",
  "title": "Animal Concerns Research and Education Society",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Animal_Concerns_Research_and_Education_Society"
}