{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:52:48.829863"
  },
  "content": "South Korean television companyTelevision channel **Aniplus Inc.** ([Korean](/wiki/Korean_language): 주식회사 애니플러스; [RR](/wiki/Revised_Romanization_of_Korean): *Jusighoesa Aniplus*) is a South Korean television channel and anime distributor. Founded in 2004, the company also operates different businesses including a [video on demand](/wiki/Video_on_demand) platform and a merchandising arm in its own country. Aniplus is owned by JJ MediaWorks, a VOD service provider. It distributes its programs outside its own platforms to clients such as [Netflix](/wiki/Netflix) and [Coupang Play](/wiki/Coupang#Coupang_Play). ## History The company originally started as a television station called SBN TV. Originally owned by C& Group, its parent company dissolved due to a [liquidity crisis](/wiki/Liquidity_crisis). JJ MediaWorks acquired the station in July 2009 and renamed the company to Aniplus Inc. the following month. The company launched the Aniplus television channel on December 7, 2009. Seung-Taek Jeon, the [CEO](/wiki/CEO) of JJ MediaWorks, became the new CEO of Aniplus following the acquisition. Aniplus launched an independent television feed for Southeast Asia called Aniplus Asia in 2013. The following year, Aniplus established its subsidiary Plus Media Networks Asia in Singapore to handle anime and Korean drama distribution for the Southeast Asian market. In 2014, Aniplus entered the [art exhibition](/wiki/Art_exhibition) business by establishing a subsidiary named Media & Art. On February 7, 2020, Aniplus became listed on [KOSDAQ](/wiki/KOSDAQ). In the same month, the company fully acquired Korean drama production company WeMad to diversify its portfolio. On February 4, 2022, advertising agency NEGO Company became a subsidiary of Aniplus. On August 17, 2022, industrial design company Rowoon Company was acquired by Aniplus to strengthen its IP commercialization. Aniplus has 67.11% stake in the company. On November 8, 2022, private equity firm Keistone Partners announced that it and Aniplus would jointly acquire 87% stake in animation streaming company Laftel Inc. from RIDI Corporation, the owner of [Manta](/wiki/Manta_(platform)) webtoon platform for 80 billion won. RIDI would invest 10 billion won in Aniplus to support the platform's growth. Aniplus owns 56.38% stake in Laftel, with 12.5% of it being a [call option](/wiki/Call_option). In April 2023, Aniplus had entered an acquisition deal of [Animax](/wiki/Animax_(South_Korean_TV_channel)), the second largest animation broadcaster and rival competitor in South Korea, with KC Global Media Entertainment. The deal was approved in June of the same year. The numbers were not disclosed, but sources close to the transaction suggested it was about 46 billion won. The deal made Aniplus the biggest anime distributor in South Korea. On October 4, 2024, it was announced that Aniplus Korea will discontinue some of its key core services effective December 31 due to various internal and external factors including the changes in landscape of media environment that focuses more on its stronger business venture in the area. The services that may affect the discountinuation include its live broadcast, VOD streaming and download functionalities; while the rest of owned and operated assets such as Laftel, Animax Korea and other offerings will remain unaffected. ## Aniplus Shop **Aniplus Shop** is the retailing division and collaboration cafe brand of Aniplus. On April 28, 2017,[*citation needed*] Aniplus opened its first store in [Hapjeong-dong](/wiki/Hapjeong-dong), Seoul. In May 2021, it was reported that the company planned to expand its store to five cities across the country within the third and fourth quarters of the year. On July 9, 2021, Aniplus Shop opened its second branch in [Daejeon](/wiki/Daejeon). The third location, located in [Gwangju](/wiki/Gwangju), was open on August 19, 2021. The latest store in [Seomyeon, Busan](/wiki/Seomyeon,_Busan) was open on October 28, 2021. ## Plus Media Networks Asia **Plus Media Networks Asia Pte. Ltd.** is a Singaporean subsidiary of Aniplus. It operates Aniplus Asia and a Korean entertainment channel named [K+](/wiki/K-Plus). ### Aniplus Asia Television channel Aniplus Asia is a Southeast Asian anime [pay television](/wiki/Pay_television) channel and anime distributor based in [Singapore](/wiki/Singapore). It is a sister channel of Aniplus. Launched in January 2013, it is currently available in Singapore and Indonesia. Most of Aniplus Asia programs come from its parent company Plus Media Networks Asia. The channel airs the notable anime series from Japan, which was premiered [day-and-date](/wiki/Day-and-date). Notable series include *[Attack on Titan](/wiki/Attack_on_Titan)*, *[The Promised Neverland](/wiki/The_Promised_Neverland)*, and *[Lycoris Recoil](/wiki/Lycoris_Recoil)*. Select programs are licensed from other distributors such as [Medialink](/wiki/Medialink) and Mighty Media. #### Television channel Aniplus Asia was first launched as part of Thai operator [TOT IPTV](/wiki/TOT_Public_Company_Limited)'s launch lineup on January 16, 2013. The channel was subsequently launched in Indonesia on Big TV in September of the same year. It was made available in Singapore on [Toggle.sg](/wiki/Toggle.sg) (now meWatch) on November 6, 2013, and on [Singtel TV](/wiki/Singtel_TV) on March 14, 2014. In April 2017, the channel was launched in Malaysia exclusively on [Astro Go](/wiki/Astro_(company)#Astro_Go). [Sky Cable](/wiki/Sky_Cable) picked up the channel in the Philippines the following month. On May 25, 2018, Aniplus Asia was made available on [Easy TV Home](/wiki/Easy_TV_(Philippines)) in the Philippines, but has ceased operations since September 30, 2019. In September 2018, the channel was added to [Cablelink](/wiki/Cablelink) in the Philippines. [Cignal](/wiki/Cignal) added the channel to its lineup in the Philippines on January 4, 2020. On April 1, 2021, Aniplus Asia ceased its transmission on [Astro Go](/wiki/Astro_(television)) in Malaysia and Royal Cable in the Philippines after the contract had expired, However, the channel resurfaced on Royal Cable among other alternatives following the lack of channel lineups due to [the closure of Disney-owned networks](/wiki/Disney_Networks_Group_Asia_Pacific#Disney_ownership_and_closure) in the region. In February 2023, Aniplus Asia appeared on [Unifi TV](/wiki/Unifi_TV) as a [video on demand](/wiki/Video_on_demand) channel alongside its sister channel [K+](/wiki/K-Plus).[*citation needed*] On May 1, 2023, the channel was removed from Sky Cable in the Philippines. Cablelink discontinued the channel in the Philippines on June 1, 2023. The channel was sunset on [AIS Play](/wiki/Advanced_Info_Service#AIS_Play) in Thailand from October 1, 2023., but Resume Airing on TrueID on 5 June 2025. In the Philippines, Cignal shut down the channel on January 1, 2024. #### Video on demand In August 2015, Aniplus Asia partnered with OTT platform [iflix](/wiki/Iflix) to distribute its titles via its VOD service. In September 2016, the channel was launched in Hong Kong on video streaming site [Le.com](/wiki/Le.com).[*citation needed*] Later in November, it was picked up by streaming website Tribe in Indonesia, and reached the Philippines in December of the same year. On July 25, 2017, Aniplus Asia announced that it has launched a VOD service on its website for residents in Singapore. On November 23, 2020, the original Korean Aniplus counterpart announced that Aniplus Asia was made available on demand via [Now TV](/wiki/Now_TV_(Hong_Kong)). Now TV terminated the VOD channel on June 30, 2024. As of 2024, Aniplus Asia has licensed its titles to other streaming services such as [Amazon Prime Video](/wiki/Amazon_Prime_Video), [Bilibili](/wiki/Bilibili), [Crunchyroll](/wiki/Crunchyroll), [Disney+](/wiki/Disney%2B), [iQIYI](/wiki/IQIYI), Netflix, and [WeTV](/wiki/Tencent_Video). As of September 19, 2025 it available for Samsung TV Plus FAST. #### Free-to-air programming block In June 2016, programming from Aniplus Asia started to be distributed in Thailand on free-to-air channel Now26 as a programming block via a partnership with Mediaplex International. In January 2017, [TV5](/wiki/TV5_(Philippine_TV_network)) revived its ANiMEGA anime programming block with titles from Aniplus Asia. The block premiered with *Attack on Titan: Junior High*, *[Myriad Colors Phantom World](/wiki/Myriad_Colors_Phantom_World)* and *[Kantai Collection](/wiki/Kantai_Collection_(TV_series))*, dubbed in Tagalog. #### Merchandising On July 25, 2017, Aniplus Asia announced that it has opened an [online store](/wiki/E-commerce) for anime merchandise on its website. #### Aniplus Cafe Singapore Aniplus Cafe Singapore is a collaboration cafe located at Esplanade Mall, Singapore. It was officially open on November 29, 2019 with [BanG Dream!](/wiki/BanG_Dream!) being its first theme. The cafe also sells merchandise from various anime series. ### K+ K+ is a Southeast Asian pay television channel focused on Korean entertainment. It was launched on September 17, 2014. ## Anime X Game Festival **Anime X Game Festival**, abbreviated **AGF**, is a South Korean [anime](/wiki/Anime_convention) and [video gaming convention](/wiki/Gaming_convention) held in [Goyang](/wiki/Goyang), [Gyeonggi Province](/wiki/Gyeonggi_Province), [South Korea](/wiki/South_Korea). Held for the first time in 2018, the convention is organized by Aniplus and [Sony Music Entertainment Japan](/wiki/Sony_Music_Entertainment_Japan). The convention is held annually on a weekend in November or December at the [Korea International Exhibition Center](/wiki/Korea_International_Exhibition_Center). Due to the [COVID-19 pandemic](/wiki/COVID-19_pandemic), the event was canceled in 2020 and 2021. The convention returned in 2022, with [Daewon Media](/wiki/Daewon_Media) and D&C Media becoming its co-hosts alongside Aniplus and Sony Music Japan. Much like other anime conventions, AGF features many events for attendees to take part in such as guest panels and concerts, as well as activities from exhibit booths and collaboration cafes. ### AGF History DatesLocationAtten.GuestsNovember 3–4, 2018[Korea International Exhibition Center](/wiki/Korea_International_Exhibition_Center) [Goyang](/wiki/Goyang), [Gyeonggi Province](/wiki/Gyeonggi_Province)20,000Hisanori Yoshida, Yoshiyuki Hirai, Seongah, Jooyoung, [Junta Terashima](/wiki/Junta_Terashima), [Hiroki Takahashi](/wiki/Hiroki_Takahashi), [Ayako Kawasumi](/wiki/Ayako_Kawasumi), Satoshi Tsuruoka, Yosuke Shiokawa, [Kaito Ishikawa](/wiki/Kaito_Ishikawa), [Asami Seto](/wiki/Asami_Seto), [Kazuhiko Inoue](/wiki/Kazuhiko_Inoue), [May'n](/wiki/May%27n), [Miho Okasaki](/wiki/Miho_Okasaki), Kanehira Yamamoto, [Maho Tomita](/wiki/Maho_Tomita), [Hinata Satō](/wiki/Hinata_Sat%C5%8D), [Yui Ogura](/wiki/Yui_Ogura), [Yoshitsugu Matsuoka](/wiki/Yoshitsugu_Matsuoka), [Haruka Tomatsu](/wiki/Haruka_Tomatsu), [Ayahi Takagaki](/wiki/Ayahi_Takagaki), [Asca](/wiki/Asca_(singer)), [Halca](/wiki/Halca), [Minako Kotobuki](/wiki/Minako_Kotobuki), and [Aki Toyosaki](/wiki/Aki_Toyosaki).December 14–15, 2019Korea International Exhibition Center Goyang, Gyeonggi Province35,970[Aimi](/wiki/Aimi_(actress)), [Miku Itō](/wiki/Miku_It%C5%8D), Shim Kyu-hyeok, Kim Hyun-wook, [Lee Yong-shin](/wiki/Lee_Yong-shin), SoundOrion, Jeong Hyewon, Jang Mi, Zad, [Kang Soo-jin](/wiki/Kang_Soo-jin_(voice_actor)), [Kim Seung-jun](/wiki/Kim_Seung-jun), [Chung Misook](/wiki/Chung_Misook), Kim Young-sun, Jeong Ok-ju, Kim So-hyung, So Yeon, Go Gu-in, [Sphere](/wiki/Sphere_(Japanese_band)), [Aina Aiba](/wiki/Aina_Aiba), [Momoyo Koyama](/wiki/Momoyo_Koyama), Bboong Bbang Kkyu, Choi Se-jun, Park Ju-kwang, Yuichi Jose, Anju Nitta, AZKi, KIHOW, Enako, DJ Tamu, DJ Kazu, Kimchi Kura, [Shoko Nakagawa](/wiki/Shoko_Nakagawa), [Nagi Yanagi](/wiki/Nagi_Yanagi), and May'n.December 3–4, 2022Korea International Exhibition Center Goyang, Gyeonggi Province47,774Raon, [Aguri Ōnishi](/wiki/Aguri_%C5%8Cnishi), [Shu Uchida](/wiki/Shu_Uchida), [Miyu Kubota](/wiki/Miyu_Kubota), [Natsuki Hanae](/wiki/Natsuki_Hanae), [Kensho Ono](/wiki/Kensho_Ono), [Yūya Hirose](/wiki/Y%C5%ABya_Hirose), [Hironobu Kageyama](/wiki/Hironobu_Kageyama), Seo Ban-seok, Cha Hyung-hoon, Min Seung-woo, Park Shi-yoon, [Ayaka Ōhashi](/wiki/Ayaka_%C5%8Chashi), [Amane Shindō](/wiki/Amane_Shind%C5%8D), [Yūka Nishio](/wiki/Y%C5%ABka_Nishio), DJ Kazu, [Konomi Kohara](/wiki/Konomi_Kohara), [Ai Kakuma](/wiki/Ai_Kakuma), [Daiki Hamano](/wiki/Daiki_Hamano), [Toshiki Masuda](/wiki/Toshiki_Masuda), [Shun'ichi Toki](/wiki/Shun%27ichi_Toki), Shiranui Flare, and Shirogane Noel.December 2–3, 2023Korea International Exhibition Center Goyang, Gyeonggi Province65,442DJ Kazu, [HoYoverse](/wiki/HoYoverse) DJ, Ayaka Ōhashi, [Kana Ueda](/wiki/Kana_Ueda), [Jōgi Shiraishi](/wiki/J%C5%8Dgi_Shiraishi), Azure, [Natsumi Kawaida](/wiki/Natsumi_Kawaida), [Mai Fuchigami](/wiki/Mai_Fuchigami), [Shintarō Asanuma](/wiki/Shintar%C5%8D_Asanuma), Masami Ito, [Taito Ban](/wiki/Taito_Ban), Min Seung-woo, Atsushi Kaneko, [Ayako Kawasumi](/wiki/Ayako_Kawasumi), [Rumi Okubo](/wiki/Rumi_Okubo), Kanou Yoshiki, Aina Aiba, Hina Aoki, Airi Kanna, Ayatsuno Yuni, [Daiki Yamashita](/wiki/Daiki_Yamashita), [Nobuhiko Okamoto](/wiki/Nobuhiko_Okamoto), [Yuki Kaji](/wiki/Yuki_Kaji), [Saori Hayami](/wiki/Saori_Hayami), [Kenichirou Matsuda](/wiki/Kenichirou_Matsuda), Kim Ha-ru, [Kengo Kawanishi](/wiki/Kengo_Kawanishi), [Junya Enoki](/wiki/Junya_Enoki), [Yoshino Aoyama](/wiki/Yoshino_Aoyama), [Ikumi Hasegawa](/wiki/Ikumi_Hasegawa), Ryushen, Machita Chima, Inui Toko, Hakui Koyori, [Sakamata Chloe](/wiki/Sakamata_Chloe), [QWER](/wiki/QWER), Akane Lize, Raon, TAK, and Charming_Jo with Annoying Box.December 7–8, 2024Korea International Exhibition Center Goyang, Gyeonggi Province[*needs update*]December 5–7, 2025Korea International Exhibition Center Goyang, Gyeonggi Province ## Other subsidiaries ### Media & Art Media & Art is an [event management](/wiki/Event_management) company specializing in art exhibition. In 2016, the company co-produced Korean drama series *[Secret Healer](/wiki/Secret_Healer)*. In June 2020, it was reported that Aniplus was developing exhibitions from webtoons and pursuing contracts overseas through the company. The following month, Media & Art opened a platform and art galleries under the name Groundseesaw. Groundseesaw produces exhibitions from domestic and international intellectual properties. ### WeMad WeMad is a South [Korean drama](/wiki/Korean_drama) [production company](/wiki/Production_company) founded on June 12, 2019 by Lee Hyun-wook, a former producer at Raemongraein [ko] (now [Artist Studio](/wiki/Artist_Company#Subsidiaries_and_brands)). Its notable works include *[The Red Sleeve](/wiki/The_Red_Sleeve)*, *[Love Scene Number](/wiki/Love_Scene_Number)* and *[Heartbeat](/wiki/Heartbeat_(South_Korean_TV_series))*. WeMad was acquired by Aniplus in 2020. ### Rowoon Company Rowoon Company is an industrial design company. It handles goods production process including planning, design, manufacturing, distribution and operation. The company also has a [brand licensing](/wiki/Brand_licensing) operation to produce and sell goods of licensed characters. Its subsidiary Rowoon Labs develops NFT and metaverse projects. ### Laftel Laftel is an animation streaming service. In addition to Japanese anime, the service also streams original Korean content and animated series adapted from webtoons. In 2022, it became a subsidiary of Aniplus and was reported to be expanding to Southeast Asia in the future. The service launched in Southeast Asia in January 2024. ### Animax Broadcasting Korea\n",
  "language": "en",
  "processed_at": "2026-01-12T09:52:48.829451",
  "title": "Aniplus",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Aniplus"
}