{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:52:50.962719"
  },
  "content": "British educationalist (1891–1973) **Anne Laugharne Phillips Griffith-Jones** [OBE](/wiki/Order_of_the_British_Empire) (15 April 1891 – 28 November 1973) was a British educationalist who founded [Singapore](/wiki/Singapore)'s Tanglin Preparatory School, which is now known as the [Tanglin Trust School](/wiki/Tanglin_Trust_School). ## Early years Born in [London](/wiki/London), England, Griffith-Jones was the youngest of 11 children and daughter of a [Welsh](/wiki/Welsh_people) [barrister](/wiki/Barrister) Griffth Jones and Anne Laugharne Phillips, who were married in 1873. (Her brother, John, was father of [Mervyn Griffith-Jones](/wiki/Mervyn_Griffith-Jones), the prosecuting barrister [later judge] involved in the 1960 [prosecution of Penguin Books](/wiki/R_v_Penguin_Books_Ltd) for the publication of [D. H. Lawrence](/wiki/D._H._Lawrence)'s *[Lady Chatterley's Lover](/wiki/Lady_Chatterley%27s_Lover)* and the 1963 trial of [Stephen Ward](/wiki/Stephen_Ward) relating to the [Profumo affair](/wiki/Profumo_affair).) She, along with many women of her time, had no formal qualifications. During [World War I](/wiki/World_War_I), she served as a welfare officer at a munitions factory in [Wales](/wiki/Wales), for which she was awarded an [MBE](/wiki/Member_of_the_Order_of_the_British_Empire). In 1923, Griffith-Jones came to [Singapore](/wiki/Singapore) to spend a three-month holiday with her brother, Oswald Phillips Griffith-Jones. After her vacation, she chose to stay in [Singapore](/wiki/Singapore) to dedicate her life to the education of [expatriate](/wiki/Expatriate) children, founding the Tanglin Day School which later became the [Tanglin Preparatory School](/wiki/Tanglin_Trust_School), where she became widely known as \"Miss Griff\". When the school first opened in March 1925, it functioned from a disused supper shed within the premises of the [Tanglin Club](/wiki/Tanglin_Club). It began with five students but soon began to grow rapidly. The school served the needs of children up to the age of eight. At the time, many British [expatriates](/wiki/Expatriate) living in Singapore had to send their children to [Britain](/wiki/Great_Britain) to attend [boarding school](/wiki/Boarding_school) at an early age. This meant being separated from their children for a lengthy period of time. Griffith-Jones saw the need to provide a British-style education in [Singapore](/wiki/Singapore) so that parents could postpone [boarding school](/wiki/Boarding_school) until their children were of an older age. > **A BETTER CHOICE** > > She (Griffith-Jones) was largely responsible for European children being able to remain with their parents in Malaya several years longer than was possible in pre-war days. ***Straits Budget*, 9 March 1939** In 1934, she opened a second school, the Tanglin Boarding School, in [Cameron Highlands](/wiki/Cameron_Highlands), Malaysia. The school was intended to serve as a \"near-by\" alternative for [expatriate](/wiki/Expatriate) families living in the region who would otherwise have to send their children to [boarding schools](/wiki/Boarding_school) in [Britain](/wiki/Great_Britain). Many of the children who attended the school in [Singapore](/wiki/Singapore) then went on to the [boarding school](/wiki/Boarding_school) in the [Cameron Highlands](/wiki/Cameron_Highlands), which catered for students up to the age of 13. At the end of 1938, the number of pupils at the school grew to 68. At both schools, there was much emphasis on the [British Empire](/wiki/British_Empire). In preparing the boys for English Preparatory Schools, she would teach them football, taking the forward line across the playing field and showing them how to pass the ball. Similarly at cricket, she demonstrated the \"straight bat\" and footwork at the crease. ## Second World War The two schools continued to grow until the outbreak of the [Second World War](/wiki/Second_World_War) (1942–1945). The [Japanese Occupation](/wiki/Japanese_occupation_of_Malaya,_North_Borneo_and_Sarawak) of the [Malay Peninsula](/wiki/Malay_Peninsula) forced the closure of both schools, as British [expatriates](/wiki/Expatriate) in the region (including Griffith-Jones) were interned by the [Japanese](/wiki/Empire_of_Japan) at [Singapore](/wiki/Singapore)'s [Changi Prison](/wiki/Changi_Prison) and Sime Road Camp. Throughout her confinement, she displayed the same qualities of organisation and leadership that were a feature of her everyday life. In the course of her imprisonment, she rose to the challenge of internment and set about establishing a school for the internees. After the war, the two schools reopened, but the school at the [Cameron Highlands](/wiki/Cameron_Highlands) failed to flourish. In 1948, it had to close due to an outbreak of [poliomyelitis](/wiki/Poliomyelitis). A second closure occurred during the [Malayan Emergency](/wiki/Malayan_Emergency) (1948–1960). The school had to be placed under full-time armed guard after the [Malayan National Liberation Army](/wiki/Malayan_Races_Liberation_Army) surrounded the school. In 1950, it was forced to close by the Federal Government for security reasons. Thereafter, the property was sold to the British War Office. ## Retirement In 1958, Griffith-Jones retired to the [Cameron Highlands](/wiki/Cameron_Highlands) and the British European Association, now the British Association of Singapore, took over the private company, 'Tanglin School Limited'. While residing at the resort, Griffith-Jones became actively involved in sport and social work. For many years, she served as Secretary of the Cameron Highlands Church (which is presently known as [All Souls' Church](/wiki/All_Souls%27_Church,_Cameron_Highlands)). In mid-1958, she offered to donate a site adjoining the former Slim School grounds for the erection of a school chapel. However, after consultation with the District Officer, it was established that the State Government would not alienate any further land to the British Forces based at the retreat. Subsequently, she transferred the land to the [Anglican Diocese](/wiki/Diocese_of_Singapore_and_Malaya) on the understanding that a small church would be built on it. The construction of the church commenced in 1958. The [Nissen hut](/wiki/Nissen_hut) structure was completed in September that same year. The name '[All Souls' Church](/wiki/All_Souls%27_Church,_Cameron_Highlands)' was given at the church's [consecration](/wiki/Consecration) on Thursday, 30 April 1959. The Right Rev H W Baines, Bishop of [Singapore](/wiki/Singapore) and [Malaya](/wiki/Peninsular_Malaysia), conducted the services. ## Awards Griffith-Jones received three awards during her lifetime. Her [MBE](/wiki/Member_of_the_Order_of_the_British_Empire), which she received in her twenties, was elevated to an [OBE](/wiki/Order_of_the_British_Empire) for her services to education. In 1962, the [Sultan](/wiki/Sultan) of [Pahang](/wiki/Pahang) bestowed on her the *Pingat Jasa Kebaktian* award for meritorious service. ## Death Griffith-Jones died in 1973 at the [Ipoh](/wiki/Ipoh) General Hospital after suffering a severe stroke. She was buried in [Tapah](/wiki/Tapah), Perak, in the foothills of the [Cameron Highlands](/wiki/Cameron_Highlands). In 2015, her grave was visited by a group of students from Singapore's [Tanglin Trust School](/wiki/Tanglin_Trust_School). They read out a prepared text and placed a floral tribute on her grave before leaving. - [All Souls' Church, Cameron Highlands](/wiki/All_Souls%27_Church,_Cameron_Highlands) - [Cameron Highlands](/wiki/Cameron_Highlands) - [Tanglin Trust School](/wiki/Tanglin_Trust_School) - Tanglin Trust School website - T90 Cameron Highlands Expedition www.YouTube.com\n",
  "language": "en",
  "processed_at": "2026-01-12T09:52:50.962291",
  "title": "Anne Griffith-Jones",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Anne_Griffith-Jones"
}