{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:52:53.318519"
  },
  "content": "Financial technology company **Ant International** is a [Singapore](/wiki/Singapore)-based financial technology company that provides [digital payment](/wiki/Electronic_payments), [digitization](/wiki/Digitization), and [financial services](/wiki/Financial_services) across international markets, including [Asia](/wiki/Asia), [Europe](/wiki/Europe), the [Middle East](/wiki/Middle_East), and [Latin America](/wiki/Latin_America). ## History Ant International was founded in 2023 as part of [Ant Group](/wiki/Ant_Group)’s initiative to expand its services beyond the [Chinese mainland](/wiki/Mainland_China). It initially operated as the global business arm of Ant Group, focusing on digital payments and financial services in international markets. In March 2024, Ant Group announced a restructuring of some of its operations into independently managed business units. As a result of this reorganization, Ant International became an independently operated company. Following its establishment, the company introduced several digital finance platforms and expanded its services globally. ## Business model Ant International operates a business model focused on providing digital payment and financial services to financial institutions and merchants. The company develops and manages platforms that facilitate [electronic payments](/wiki/Electronic_payments), [digital wallet](/wiki/Digital_wallet) interoperability, and financial services for businesses engaged in international trade. Its services include [Alipay+](/wiki/Alipay), solutions that links various regional e-wallets to support cross-border transactions; [Antom](/wiki/Antom), which provides merchant payment systems and related tools; [WorldFirst](/wiki/WorldFirst), a platform offering international payment and financial services for small and medium-sized enterprises; and Bettr, which supports the integration of credit services into third-party platforms. To enhance transaction security, Ant International employs an [artificial intelligence](/wiki/Artificial_intelligence)-based system known as *AI SHIELD*, which is intended to identify and address fraudulent activity during payment processing. ## Partnerships Ant International has formed collaborations with [Deutsche Bank](/wiki/Deutsche_Bank) and other notable global financial institutions to support the development and deployment of financial technologies such as [stablecoins](/wiki/Stablecoins). In partnership with [Barclays](/wiki/Barclays), the company has worked on artificial intelligence models aimed at improving foreign exchange forecasting and treasury-related functions. It has also partnered with [HSBC](/wiki/HSBC) to introduce tokenised deposit services in [Hong Kong](/wiki/Hong_Kong), using [blockchain technology](/wiki/Blockchain_technology). In Europe, Ant International has collaborated with [BNP Paribas](/wiki/BNP_Paribas) to develop infrastructure for cross-border payments, with the goal of enhancing the efficiency of international transactions. - [Ant Group](/wiki/Ant_Group) - [Alipay](/wiki/Alipay) - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T09:52:53.318074",
  "title": "Ant International",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Ant_International"
}