{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:50:16.205684"
  },
  "content": "Global logistics company **APL Logistics Ltd. (APLL)** is a [wholly owned subsidiary](/wiki/Subsidiary) of [Kintetsu World Express](/wiki/Kintetsu_World_Express), Inc. (KWE), a Japan-based [freight forwarding](/wiki/Freight_forwarder) and transportation company. As a [global supply chain](/wiki/Supply_chain) specialist, APL Logistics trades in more than 60 countries, serving the [automotive](/wiki/Automotive_industry), consumer, industrials, and [retail](/wiki/Retail) [verticals](/wiki/Vertical_market). Headquartered in Singapore and USA, APL Logistics has locations across the globe. ## History ### Pre-merger In 1980, in response to the increasing importance of Asian imports, U.S.-based [container transportation](/wiki/Containerization) and shipping company [APL](/wiki/American_President_Lines) created American Consolidation Services (ACS) to meet the needs of importers who wanted help in managing the flow of their Asian goods. As with similar such services, ACS was responsible for \"monitoring the movement of goods to consolidation points and managing the consolidation of goods and shipping according to the specifications of buyers.\" In 1996, ACS obtained a domestic [distribution](/wiki/Distribution_(business)) services license in China. Trying to take advantage of the burgeoning [Internet](/wiki/Internet), in 1999 it introduced one of the industry's first Web-based ordering and shipment tracking systems. It was during this period that APL rebranded the service as **APL Logistics**. ### Acquisition and incorporation In 1997, [Singapore-based](/wiki/Singapore) [Neptune Orient Lines](/wiki/Neptune_Orient_Lines) Ltd. (NOL) acquired APL in a [merger](/wiki/Merger_and_acquisitions) for US$825 million, a move that placed it within the top five of its industry. As the smaller and less established of the two entities, NOL adopted APL as its public [brand](/wiki/Brand) name following the merger. Previously, NOL had been carrying out [logistics services](/wiki/Third-party_logistics) under its Orient Container & Warehousing Services (OCWS) brand. To better focus on managing global supply chains, in 2000 NOL rebranded and [incorporated](/wiki/Incorporation_(business)) its logistics service as APL Logistics, and it commenced operations as a standalone sister company to APL. ### Early expansion, acquisitions, and innovation The following year, in 2001, APL Logistics’ acquired GATX Logistics for US$210 million to add [warehouse](/wiki/Warehouse) services to its offerings and increase its U.S. footprint in contract logistics, a move that it anticipated would increase its revenues by 70 percent, or approximately US$300 million. The acquisition gave it access to 21 million [square feet](/wiki/Square_feet) of warehouse space in North and [South America](/wiki/South_America). To expand its presence in [Europe](/wiki/Europe), later that year APL Logistics acquired 51 percent of German freight forwarding company Mare Logistik & Spedition GmbH, which gave it a retail logistics platform in the German market and access to the rapidly expanding Asia-Europe trade market. In 2005, it formed Holistica Solutions, a now defunct [joint venture](/wiki/Joint_venture), with UK-based distribution group [Christian Salvesen](/wiki/Christian_Salvesen) to create an integrated supply chain with an end-to-end transport service using APL's sea-freight and Salvensen's land-transport assets. In keeping with a philosophy of harnessing emerging technology for greater efficiency, in an attempt to find additional practical applications for [radio-frequency identification](/wiki/Radio-frequency_identification) (RFID) technology in logistics, NOL and APL Logistics teamed up with [Sun Microsystems](/wiki/Sun_Microsystems) in 2005 to establish a test center in Singapore. The center provided a live supply chain environment to evaluate RFID technology and application. APL Logistics achieved two firsts in 2006 when it became the first foreign logistics firm to obtain a license to operate in [Taiwan's](/wiki/Taiwan) Kaohsiung [Free Trade Zone](/wiki/Free_Trade_Zone) (FTZ) and when it teamed up with [Con-way Freight](/wiki/Con-way_Freight) and introduced OceanGuaranteed, the industry's first guaranteed [less-than-container load](/wiki/Containerization#Container_loading) (LCL) / [less than truckload](/wiki/Less_than_truckload_shipping) (LTL) service, offering door-to-door, day definite delivery from key ports in Asia to the U.S. In 2006, APL Logistics opened offices in [Spain](/wiki/Spain) and [Turkey](/wiki/Turkey). ### India That same year, 2006, parent company NOL won approval to operate [freight rail](/wiki/Freight_rail_transport) services in [India](/wiki/India). In a move designed to tap into the vast potential of India's transportation market, sister company APL set up a joint venture between APL India and HIPE (Hindustan Infrastructure Projects & Engineering Private Limited), which was eventually placed under APL Logistics. Named India Infrastructure and Logistics Private Limited (IILPL), the joint venture provides rail-based container transportation and logistics services in India and is marketed under the APL IndiaLinx brand. To improve efficiency, APL IndiaLinx introduced its first double-stack container train service in India in 2011. In 2014, IILPL became a wholly owned subsidiary of APL Logistics when the latter acquired the remaining 24 percent of HIPE's shares for US$10 million. In 2012, to take advantage of favorable changes made by the Indian government regarding private rail transportation, APL Logistics formed a joint venture with VASCOR called APL Logistics VASCOR Automotive. It was formed to support the need for improved domestic transportation of finished vehicles within India, which had been dependent on less-efficient and more damage prone road-based vehicle haulers navigating India's problematic road system. ### North America In 2008, APL Logistics began guaranteeing day-definite delivery of [full container loads](/wiki/Containerization) (FCL) to the U.S. It also introduced the first 1,000 containers dedicated to U.S. domestic transportation in 2011, becoming an asset-based player in the logistics space for the first time. In a move that linked origin ports in Asia to every major [North American](/wiki/North_America) market, APL Logistics and its trucking partner, Con-way Freight, introduced its OceanGuaranteed service to [Mexico](/wiki/Mexico) in 2009. Determined to strengthen the integration of its supply chain services, in 2012 the company acquired U.S.-based [customs broker](/wiki/Customs_broking) and freight forwarder Carmichael International Services for US$37 million. The acquisition gave APL Logistics expanded customs brokerage, trade compliance, and consultation capabilities. Further activity in North America included the 2013 launch of an online sales channel for Walmart in Mexico and the opening of a customs brokerage office in Laredo, Texas. In early 2015, APL Logistics and APL Logistics Americas incorporated a new company called APL Logistics de Mexico, S.A. DE C.V. to carry out transportation logistics operations in Mexico, with APLL owning 99.9 percent of the stock. ### Asia With an eye on the emerging Chinese automotive logistics market, in 2011 APL Logistics formed CMA Logistics (CMAL), a joint venture with Changan Minsheng. A year later, APL Logistics established APLL-Zhiqin, a joint venture partnership with China's Legend Holdings Ltd. and Beijing Willway Information Technology Co. Ltd. With offices and [hub](/wiki/Transport_hub) facilities in 30 Chinese locations, the joint venture had a transportation and distribution network spanning over 2,000 cities and access to a wide range of multinational and local companies. In 2012, APL Logistics signed an agreement to acquire all the shares of APLL-Zhiqin from its partners. In 2009, APL Logistics launched flow center operations in [Dubai Logistics City's](/wiki/Dubai_World_Central) (DLC) international free trade zone; the new center was intended to accelerate reliable cargo movement across the [Middle East](/wiki/Middle_East) and reduce costs. In 2010, APL Logistics and Japan's [Sumitomo Warehouse Co.](/wiki/Sumitomo_Group) agreed on a joint marketing arrangement that allowed them to take advantage of a broad international client base to support each other through business leads and joint sales efforts. The deal called for APL Logistics to make its global services available to Sumitomo customers, and in return, [Osaka-based](/wiki/Osaka) Sumitomo offered its warehousing and other logistical capabilities in [Japan](/wiki/Japan) to APL Logistics’ customers. In a bid to improve transit time efficiency for shippers and improve costs, in 2010 APL Logistics opened a 114,000 square foot container freight station located near two special economics zones in [Chittagong](/wiki/Chittagong), Bangladesh's largest and busiest port. The next year, to further broaden service offerings to customers in the apparel sector, the company opened two quality assurance centers in Bangladesh. Located in the cities of [Dhaka](/wiki/Dhaka) and Chittagong, both centers are located near the majority of the country's garment manufactures. Further expanding its services in [Southeast Asia](/wiki/Southeast_Asia), in 2011 APL Logistics introduced containerized cross-border trucking between [Cambodia](/wiki/Cambodia) and [Vietnam](/wiki/Vietnam) to offer shippers a later cutoff time to reduce transit times by several days when production ran late. In 2015, to expand its footprint in Indonesia, APL Logistics announced that it had opened a new container freight station (CFS) at the Tungya Collins Terminal in Cakung, [North Jakarta](/wiki/North_Jakarta) to handle export consolidation and warehousing services. The facility is a 120,000 square foot storage and distribution facility with yard space with cross-docking capabilities, and it has an annual handling capacity of 21 million [cubic meters](/wiki/Cubic_metre). APL Logistics has five warehousing services in Indonesia that coordinate with 280 factories. The company also announced in 2015 that, together with a local investor, it had incorporated a new company in Vietnam named APL Logistics Vietnam Company Limited to handle the provision of goods warehousing, storage services, and freight transport agency services. APLL has a 98 percent stake in the new company. ### Sale to KWE In 2015, after parent company NOL suffered four consecutive years of loss, it sold APL Logistics to KWE for US$1.2 billion in order to strengthen its balance sheet and focus on returning APL, its container transportation and shipping operation, to profitability. The sale was finalized on May 29 after the parties secured all the necessary legal, regulatory, and shareholder approvals in Singapore and Japan. ## Current Joint Ventures ### VASCOR Ltd Created in 1987, VASCOR is a joint venture between APL Logistics and Fujitrans Corporation of Japan. VASCOR Ltd. is a third-party logistics (3PL) specialist dedicated to servicing the specific needs of the global automotive industry. ### Changan Minsheng APLL Logistics (CMAL) Established in 2001, Changan Minsheng APLL Logistics (CMAL) is a joint venture between Changan Minsheng and APL Logistics Co., Ltd. CMAL is a third-party automobile logistics provider and comprehensive logistics provider in the Chinese market. ### APL Logistics VASCOR Automotive APL Logistics VASCOR Automotive is a Delhi-based 3PL provider serving the automotive sector in India. Incorporated in 2012, the company is a joint venture of APL Logistics and VASCOR. It handles end-to-end bulk transportation of vehicles and parts from the assembly line to destination utilizing specialized railcars with additional services including tracking, inspection, repair, and final mile delivery. In 2014, it invested in high-capacity rail [rakes](/wiki/Train#Terminology) to gear up for expanded service through its AutoLinx service. ## Global infrastructure Operating in more than 110 locations in 60 countries, APL Logistics manages 200 logistics facilities covering over 20 million square feet globally. It employs more than 6,000 people across the world. APL Logistics is organized in the following seven geographical divisions: - Europe (based in Hamburg, Germany) - Latin America (based in Miami, FL) - Middle East and Africa (based in Dubai, UAE) - North America (based in Scottsdale, AZ) - North Asia (based in Shanghai, China) - South Asia (based in Mumbai, India) - South East Asia (based in Singapore) ## Major industries served APL Logistics operates worldwide within the following key industry sectors: - Automotive - Consumer - Industrials - Retail ## Services APL Logistics provides services for the four verticals it serves (automotive, industrials, consumer, and retail) as well as supply chain engineering, supply chain services, technology services, and customer service. Automotive - Inbound-to-manufacturing - Aftermarket parts - Finished vehicles - Intercontinental supply chain Industrials - Inbound and outbound freight - Process and program management - Aftermarket spare part support - [Supply chain collaboration](/wiki/Supply_chain_collaboration), optimization, and analysis - Warehousing and distribution Consumer - Consolidation and deconsolidation - In-country distribution - High-touch value added services - Lean warehousing Retail - Supply chain visibility, flexibility, and control - Omni channel - Order management - Consolidation - E-fulfillment Other Products and Services - Consolidation - Deconsolidation - Customs brokerage - Air and ocean freight management - Warehousing - Distribution - Supply chain consulting - Transportation management - Value-added services ## Leadership - Thad Bedard, President - Kevin Hideo Kosaka, Executive Vice President - Takayuki Maruyama, CFO - Fabio Duque, CCO & COO for the Americas and EMEA Regions - Waldo Basilla, CCO & COO for the Greater Asia Region - Maggie Barnard, CHRO - Hakan Yaren, CIO - David Glauber, General Counsel - Michael C. Pilver Jr., Vice President, Automotive\n",
  "language": "en",
  "processed_at": "2026-01-12T09:50:16.205213",
  "title": "APL Logistics",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/APL_Logistics"
}