{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:52:56.732519"
  },
  "content": "Ethnic group**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **possibly contains original research**. Please improve it by verifying the claims made and adding inline citations. Statements consisting only of original research should be removed. *(October 2016)* *(Learn how and when to remove this message)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Arab Singaporeans\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(October 2016)* *(Learn how and when to remove this message)*This article includes a list of general references, but **it lacks sufficient corresponding inline citations**. Please help to improve this article by introducing more precise citations. *(September 2023)* *(Learn how and when to remove this message)*Some of this article's listed sources **may not be reliable**. Please help improve this article by looking for better, more reliable sources. Unreliable citations may be challenged and removed. *(October 2016)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)*Ethnic group The majority of the [Arabs](/wiki/Arabs) in [Singapore](/wiki/Singapore) are [Hadharem](/wiki/Hadharem) and traced their ancestry to the southern Arabian Peninsula in [Hadramaut](/wiki/Hadramaut), [Yemen](/wiki/Yemen). The valley region was part of a confederacy once ruled by the Queen of Sheba. Hadramaut was mentioned in The Old Testament (Hazra Mavet). Its fertile areas, suitable for cultivation, had beguiled ancient Romans to call it, and all [South Arabia](/wiki/South_Arabia) in general, [Arabia Felix](/wiki/Arabia_Felix) (Happy Arabia). There is an extensive history of migration from Hadramaut with migrants often migrating for business and religious missionary-related causes as done before the mid-19th century, however the migration increased significantly following the monsoons of the Indian Ocean, war and economic crisis in Yemen, forced the Hadhramis to resettle in various parts of the world: [Hyderabad](/wiki/Hyderabad,_Andhra_Pradesh), [India](/wiki/India) (before 1947), [Dar-es-Salaam](/wiki/Dar-es-Salaam) and East Africa as well as [Malaya](/wiki/British_Malaya) and the [Netherlands East Indies](/wiki/Netherlands_East_Indies). The population of Hadramaut were historically divided into three different social categories, the higher ranking part aristocracy comprising the *Sada* or [*Sayeds*](/wiki/Sayyid), descendants of [Sayed Ahmed Al-Muhajir](/wiki/Ahmad_al-Muhajir) who migrated to Yemen to escape political conflicts of the caliphate. He was a descendant of [Imam Ali Al-Sajjad](/wiki/Ali_al-Sajjad). Males from this social class place the title Sayed before their names, and females place Sharifah or Sayeda. The lower ranking part of the aristocracy are the [*Mashaikh*](/wiki/Sheikh) or Sheikhs who are descendants of saints and scholars of the past, families of this social class often trace their lineage back to the [Quraysh](/wiki/Quraysh), thus being distantly related to the Sada such as in the case of the Al-Amoudi family who descend from [Abu Bakr Al-Siddiq](/wiki/Abu_Bakr), or the Ba'wazir family who descend from [Abbas ibn Abd al-Muttalib](/wiki/Abbas_ibn_Abd_al-Muttalib), uncle of the prophet Muhammad. Though not all of the Mashaikh belong to the Quraysh, many belong to local tribes of Yemen such as the Kindah. The third social class is the Qaba'il who are from the local tribes of Hadramaut and are known for their tribal lifestyle and taking of arms, families such as Al-Kathiri belong to this class along with the majority of Hadramaut. The Al Kathiri Sultanate had dominion over the southern region of the Arabian Peninsula. The tribes traced their roots to the ancient Banu Hamdan tribes, which reside in the Gulf Arab regions, East African countries, and in the Arab-speaking provinces of Iran such as Khuzestan. The Confederal [Harharah Sultanate](/wiki/Upper_Yafa) reigned over the State of Upper Yafa. The Sultanate had formed a military alliance with the British Aden Protectorate and the Protectorate of South Arabia. Its capital, Mahjaba, was located about 50 km northeast of Habilayn. ## History ### Hadhrami migration The early Arab settlers came to Singapore with wealth made in [Indonesia](/wiki/Indonesia). Being already familiar with [Malay](/wiki/Malays_(ethnic_group)) customs, they were accepted by the Malays living there. In 1824, the population of Singapore was 10,683. Out of this total, there were only 15 Arabs. In 1829, there were 34 Arabs with only 3 Arab women among them. Their population increased as follows: Year187118811891190119111921Total Arab Population in Singapore4658068069191,2261,286**Population of Arabs compared to the population of Malays in Singapore:** Year19311947195719701980Total Population of Singapore557,754938,1441,444,9292,074,5072,413,945Percentage of Malay Population37,373 (6.70%)70,331 (7.50%)135,662 (9.38%)268,175 (12.93%)351,508 (14.56%)Percentage of Arab Population1,939 (0.35%)2,588 (0.28%)3,471 (0.24%)2,186 (0.11%)2,491 (0.10%) *(Source: Lim Lu Sia, 1987:32)* The census for 1970s and 1980s is not believed to reflect the actual number of Arabs in Singapore. This is because a number of Arabs have been officially registered as “Malay”. After Singapore became an independent country in 1965, the ethnic Malays enjoyed educational benefits granted by the state. Some Arab families then listed the ethnicity of their children to \"Malay\" to receive these benefits. Because of intermarriage between Malay or Indian Muslim men and Arab women, some Malays and Indians have Arab ancestry. People of Arab descent matrilineally are not officially listed as Arabs as a person's race in Singapore, until 2010, was determined by his father's race. ### Contribution to Singapore The position and contribution of the Arabs to Singapore can be seen when a member of the Aljuneid clan was appointed as a member of the mostly European-dominated Chamber of Commerce in 1837. Two members of the Alsagoff clan, Syed Mohamed bin Ahmed Alsagoff and Syed Mohammed bin Syed Omar Alsagoff, served as Municipal Commissioners in 1872–1898 and 1928–1933 respectively. The Arabs formed their own association in 1946 which still exists today. The objectives then were to promote and enhance Islam as well as the use of Arabic language. By the time the Arab Association Singapore was founded, the Arab traders were the wealthiest community in Singapore. Syed Ali Mohammed Al-Juneid, for instance, donated a large plot of land near Victoria and Arab Streets to Tan Tock Seng’s hospital. He also built public wells across town to provide free water, at a time when none was being supplied by the municipality. The Al-Juneid family – after whom Aljunied Road is named – made large donations to the construction of the Town Hall (now the Victoria Memorial and Concert Hall), while paying for the building of public bridges. The Al-Kaff footbridge on the Singapore River takes its name from another prominent Arab family, which built the first Japanese Gardens opened to the public before World War II (where the Sennett private housing estate is today). The Arabs were also well known for their contribution to *[wakaf](/wiki/Waqf)* lands (Arab's land holdings charitable trust). The *wakaf* land of [Syed Mohamed Alsagoff](/wiki/Syed_Mohamed_Alsagoff) was formed in 1904 to help support efforts for orphanages, mosques and Islamic schools. Today, the [Madrasah Aljunied Al-Islamiah](/wiki/Madrasah_Aljunied_Al-Islamiah) and [Madrasah Alsagoff Al-Arabiah](/wiki/Madrasah_Alsagoff_Al-Arabiah) stand as a legacy of the contribution of the Arab community towards Islamic education in Singapore. Currently, almost the entire area Singapore central business district were once the *wakaf* lands which the government acquired in the 1970s with only the minimal compensation paid to the owners. ### Arab role in trade The Arabs had played a dominant role in trade in South East Asia since the fifteenth century. When [Sir Stamford Raffles](/wiki/Sir_Stamford_Raffles) founded Singapore in 1819, he attracted the Arab traders to his new city. By 1824, there were 15 Arabs out of a population of 10,683 and Raffles anticipated a rapid growth in Arab immigration. His blueprint for Singapore included plans for an Arab district. In his instructions to a Singapore housing committee in 1822, he stated: *\"The Arab population would require every consideration. No situation will be more appropriate for them than the vicinity of the Sultan’s residence...\"* (Buckley 1902:85) The first Arabs to arrive in Singapore in 1819 were two wealthy merchants from [Palembang](/wiki/Palembang), [Sumatra](/wiki/Sumatra). Their numbers gradually increased and by 1846, there were five important Arab merchant houses. The al-Junied [al-junaid] الجنيد family in Singapore grew to be a rich and influential as did the al-Kaffs [al-kāf] الكاف and the al-Saggoffs [al-saqqāf] السقاف. There are streets and even a town council named after them. The al-Saggoffs were spice traders and became influential by marrying into a royal family from the [Celebes](/wiki/Sulawesi). They acquired many properties, like the other Arab families, including the \"Perseverance Estate\" where they grew lemon grass. The estate is now considered to be the heart of the Muslim community in Singapore. As well as being successful merchants and land owners, the family became involved in civic affairs. The family members, at times, held civic office from the 1870s until 1965. The al-Kaff family arrived here in 1852. All these families lived in mansions of considerable opulence like the al-Kaff house. Today, the building is a restaurant called Alkaff Mansion as a gesture to preserve the name. Other than that, it has no other Hadhrami connection, either in architectural style or ownership. ### Arab business domination The Arabs dominated the businesses in Singapore, principally in oil and trade, during the [British colonial period](/wiki/British_Empire). Arabic culture had a strong influence on the local Malay culture through its religion. This is seen in the Middle Eastern-style architecture of the [mosques](/wiki/Mosques) in [Kampong Glam](/wiki/Kampong_Glam). In the heyday of Arab prosperity, the Arabs in Singapore maintained close links with Hadhramaut and large amounts of money were sent back to the homeland. The rich built themselves splendid houses, like the Alkaff house. They also sent their sons back to Hadhramaut for periods of time to enhance their identity as Hadhramis. This custom maintained their language and Hadhrami culture. It even resulted in some Malay being incorporated in the spoken Arabic of Hadhramaut (see Hadhrami Arabic). Hadhramaut was regarded as a cultural training ground of the young Arab men and the time spent there was the final preparation for manhood. Upon their return to Singapore, these young men would take their place in the family businesses. ### After World War II During [World War II](/wiki/World_War_II) it became impossible for the Hadhramis in Singapore to travel abroad but they continued to do so thereafter. However, after the Rent Control Act came into effect, Hadrami incomes were frozen and it became clear that the *wakaf* (trust) incomes would not be sufficient for the next generation. It was then that the Arab families took a keener interest in the education of their children. The richer families sent their children to [London](/wiki/London) to study and the children of others spent time working in [Aden](/wiki/Aden) rather than just going to Hadhramaut. The cultural and linguistic links were still maintained. However, the family incomes continued to decline. ### The 1960s In the 1960s, there came a major change. The independence of [South Yemen](/wiki/South_Yemen) with a [communist](/wiki/Communist) government in power put an end to the Singapore Hadramis returning home. At the same time, the economic developments in Singapore made the importance of the [English language](/wiki/English_language) and of obtaining an education even more essential. The new Arab generation had grown up without speaking Arabic and had lost both its identity and its affiliation with Hadhramaut. Some families, in the oil boom of the 1970s, tried sending their sons to [Saudi Arabia](/wiki/Saudi_Arabia) or [Arab States of the Persian Gulf](/wiki/Arab_States_of_the_Persian_Gulf), but it was not a success. The young men did not like living in Saudi Arabia as their prospects in Singapore were better than on the [Arabian Peninsula](/wiki/Arabian_Peninsula). ## Present day ### Singaporean Arabs census today Singapore is a cosmopolitan city state made up of various races. The 1990 census shows the Chinese as the majority with around 74% of the population, the indigenous Malays with 14%, the Indians at less than 10% and the balance placed in the category of \"others\". This \"others\" category includes, but is not limited to, Filipinos, Eurasians, Vietnamese and Arabs. The census shows Arabs to be around 7,000, but unofficial estimates place the actual number of Arabs at around 10,000. ### Arabs and wakaf (waqf وقف ) properties today The Singapore Arabs were major landlords, the large families having substantial properties held in trust, which ranged from private family trusts to public charitable trusts. Most of the land in today’s central business district of Singapore was once owned by Hadrami *wakafs*. These *wakafs*, bearing the family names, whether private or charitable, gave considerable prestige to the Arab community among the Muslims in Singapore. In recent years, four factors have affected the *wakafs* and undermined the status of the community. The first three factors have been a direct result of government policies. ## Notable Arab Singaporeans This section contains a list of notable Arab Singaporeans, people with Arab ancestry born or naturalized in Singapore. ### Business - [Syed Abdul Rahman Alsagoff](/wiki/Syed_Abdul_Rahman_Alsagoff) ([Arabic](/wiki/Arabic_language): سـيّـد عـبـد الـرّحـمـن الـسّـقّـاف, Saiyid ʿAbd ar-Raḥman as-Saqqāf): Businessman in the [spice trade](/wiki/Spice_trade) and philanthropist from [Hadhramawt](/wiki/Hadhramawt). He was a descendant of [Muhammad](/wiki/Muhammad), and his son [Ahmad](/wiki/Sayyid_Ahmad_ibn_%E2%80%98Abdur-Rahman_As-Saqqaf) was the son-in-law of [Hajjah Fatimah](/wiki/Hajjah_Fatimah). ### Entertainment - [Sheikh Haikel bin Sheikh Salim Bajrai](/wiki/Sheikh_Haikel) ([Arabic](/wiki/Arabic_language): شيخ هيكل شيخ سليم) *(born 1975)*: Rapper, actor and radio personality. - AB Shaik (Shaik Abu Bakar Banafe) A B Shaik is a DJ at Mediacorp's Malay News and Infotainment radio station, Warna 942. He joined the radio industry as a Ria 897 DJ in June 1991. For more than 20 years, since 1995, Shaik has been the resident voice-over talent for hundreds of TV and radio commercials, trailers, and TV documentaries. From a Producer/Presenter, Shaik helmed Ria 897 as Senior Programme Director (1999-2006) and moved on to be Senior Business Development Manager for Warna/Ria/Oli before he relinquished his appointment to be back as DJ in Warna 942. ### Politics - [Sayyid Abubakr bin Shaikh Al-Kaff](/wiki/Sayyid_Abubakr_bin_Shaikh_Al-Kaff) (c. 1890–1965), Yemeni pacifist and philanthropist. In 1936, Al-Kaff assisted British colonial administrator [Harold Ingrams](/wiki/Harold_Ingrams) in brokering a three year truce between warring [Qu'aiti](/wiki/Qu%27aiti) and [Kathiri](/wiki/Kathiri) tribes. ### Armed Forces - [Syed Mohamed Syed Ahmad Alsagoff](/wiki/Syed_Mohamed_Syed_Ahmad_Alsagoff) ([Arabic](/wiki/Arabic_language): سـيّـد مـحـمّـد سـيّـد أحـمـد الـسّـقّـاف **Saiyid Muḥammad Saiyid Aḥmad as-Saqqāf**): Commander, Singapore Armed Forces. Born in Singapore, he had his education at the Victoria School. He later joined the Malayan Armed Forces, the predecessor of the Malaysian Armed Forces, rising to the rank of Major-General before his retirement in the 1970s. When Singapore was part of Malaysia from 1963–1965, he was the Commander of the Singapore Armed Forces, holding the rank of Brigadier-General. The Singapore Armed Forces then consisted of the 4th Malaysian Infantry Brigade which had two infantry regiments of about 1,000 soldiers each. - [Arab diaspora](/wiki/Arab_diaspora) - [Arab Indonesians](/wiki/Arab_Indonesians) - [Hadhrami people](/wiki/Hadhrami_people) - [Jawi Peranakan](/wiki/Jawi_Peranakan) - [Jawi script](/wiki/Jawi_script) - [Tarim, Yemen](/wiki/Tarim,_Yemen) - [Malay Singaporeans](/wiki/Malay_Singaporeans) - Engseng Ho (7 November 2006). *The Graves of Tarim: Genealogy and Mobility Across the Indian Ocean*. University of California Press. [ISBN](/wiki/ISBN_(identifier)) 978-0-520-24453-5. - Ulrike Freitag; William G. Clarence-Smith (1997). *Hadhrami Traders, Scholars and Statesmen in the Indian Ocean, 1750s to 1960s*. BRILL. [ISBN](/wiki/ISBN_(identifier)) 90-04-10771-1. - Talib, Ameen Ali (1997-04-01). \"Hadramis in Singapore\". *Journal of Muslim Minority Affairs*. **17** (1): 89–96. [doi](/wiki/Doi_(identifier)):10.1080/13602009708716360. [ISSN](/wiki/ISSN_(identifier)) 1360-2004. - Hadijah Rahmat (2005). *Kilat senja: sejarah sosial dan budaya kampung-kampung di Singapura*. HSYang Pub. [ISBN](/wiki/ISBN_(identifier)) 978-981-05-0652-0. - Aljunied, Syed Muhd Khairudin (2007). \"The Role of Hadramis in Post-Second World War Singapore – A Reinterpretation\". *Immigrants & Minorities*. **25** (2): 163–183. [doi](/wiki/Doi_(identifier)):10.1080/02619280802018165. [ISSN](/wiki/ISSN_(identifier)) 0261-9288. [S2CID](/wiki/S2CID_(identifier)) 144316388. - Reminder of the Arab Presence in Singapore - The Arab Association Singapore - Infopedia\n",
  "language": "en",
  "processed_at": "2026-01-12T09:52:56.732076",
  "title": "Arab Singaporeans",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Arab_Singaporeans"
}