{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:53:01.345324"
  },
  "content": "Part of the [Early history of Singapore](/wiki/Early_history_of_Singapore)[Topynymy](/wiki/Names_of_Singapore)[Sabana](/wiki/Golden_Chersonese#Settlements)**[Temasek](/wiki/Temasek)** • [Long Ya Men](/wiki/Long_Ya_Men) • [Ban Zu](/wiki/Ban_Zu)*[Malay Annals](/wiki/Malay_Annals)***[Kingdom of Singapura](/wiki/Kingdom_of_Singapura)** • [Sang Nila Utama](/wiki/Sang_Nila_Utama) • [Parameswara](/wiki/Parameswara_of_Malacca)[Badang](/wiki/Badang)[Hang Nadim](/wiki/Hang_Nadim#In_legend_and_popular_culture)**[Sack of Singapore](/wiki/Sack_of_Singapore)**[Archaeology in Singapore](/wiki/Archaeology_in_Singapore)[Singapore Stone](/wiki/Singapore_Stone)[Fort Canning Hill](/wiki/Fort_Canning_Hill) Singapore portal - v - t - e **Archaeology in Singapore** is a niche but growing discipline. Although there is generally a lack of government support for [archeological](/wiki/Archeology) work, many [artifacts](/wiki/Artifact_(archaeology)) have been unearthed at sites around the island, helping to give a clearer picture of Singapore's history, both concerning the [early history of Singapore](/wiki/Early_history_of_Singapore) and its subsequent colonial settlement following the [founding of modern Singapore](/wiki/Founding_years_of_modern_Singapore), the former being particularly useful in revealing archaeological evidence reflecting references to settlements such as [Temasek](/wiki/Temasek), [Ban Zu](/wiki/Ban_Zu), [Long Ya Men](/wiki/Long_Ya_Men) and the [Kingdom of Singapura](/wiki/Kingdom_of_Singapura) in chronicles and records. ## Sites The first site excavation was carried out in 1984 by [John N. Miksic](/wiki/John_N._Miksic) at [Fort Canning](/wiki/Fort_Canning). Since then, places where site surveys have been carried out include: - Former [Drama Centre](/wiki/Drama_Centre) - [National Museum of Singapore](/wiki/National_Museum_of_Singapore) - [Punggol](/wiki/Punggol) - [Saint John's Island](/wiki/Saint_John%27s_Island) - [Singapore Management University](/wiki/Singapore_Management_University) campus There have been site excavations in these areas: - [Fort Canning](/wiki/Fort_Canning) - [Fort Tanjong Katong](/wiki/Fort_Tanjong_Katong) - [Padang](/wiki/Padang,_Singapore) - [Istana Kampong Glam](/wiki/Istana_Kampong_Glam) - [St. Andrew's Cathedral](/wiki/St._Andrew%27s_Cathedral,_Singapore) - Colombo Court - [Duxton Hill](/wiki/Duxton_Hill) - [Empress Place](/wiki/Empress_Place_Building) - [Old Parliament House](/wiki/Old_Parliament_House,_Singapore) - [Parliament House](/wiki/Parliament_House,_Singapore) ## Major finds At Fort Canning, the oldest archaeological site in Singapore, many artefacts dating back to the 14th century have been uncovered, including [ceramics](/wiki/Ceramic) from the [Yuan dynasty](/wiki/Yuan_dynasty) period, Indian glass beads, [Chinese porcelain](/wiki/Chinese_porcelain) ware and [copper](/wiki/Copper) coins. Although Fort Tanjong Katong, whose construction started only in 1879, was much newer than Fort Canning, a number of artifacts have also been unearthed there. 36 bags of marine ecofact and [coral](/wiki/Coral) samples were collected from the site and have been sent to the [Raffles Museum of Biodiversity Research](/wiki/Raffles_Museum_of_Biodiversity_Research) at the [National University of Singapore](/wiki/National_University_of_Singapore) (NUS) for analysis. Significant parts of the fort, which was demolished after [World War I](/wiki/World_War_I), were also found *[in situ](/wiki/In_situ)*. There were so many artifacts uncovered at the Padang that both the work period and the size of the test pit were lengthened. The artifacts include indigenous earthenware, Chinese trade ceramics, and coins from the [Tang](/wiki/Tang_dynasty), [Song](/wiki/Song_dynasty) and [Jin](/wiki/Jin_dynasty_(1115%E2%80%931234)) dynasties. Investigations in the south-east corner of Istana Kampong Glam indicate that a structure may have predated the existing Istana, which was built around 1842. This would support written accounts that have described a wooden structure that [Sultan Hussein](/wiki/Sultanate_of_Johor#Singapore_and_the_British) and his family lived in as early as 1830. The earliest dated artifacts unearthed are [Dutch East India Company](/wiki/Dutch_East_India_Company) and mid-Qing coins. Other artifacts recovered are mostly from the 19th and 20th centuries and include [Malay](/wiki/Malay_people) earthenware, [European](/wiki/Europe) transfer print ceramic, Japanese ceramic ware, and various species of marine [gastropods](/wiki/Gastropod) and [bivalves](/wiki/Bivalve). Excavations at St. Andrew's Cathedral have revealed artifacts dating from the 14th century to the 20th century, which suggest that the 14th-century settlement in Singapore extended well beyond the [Singapore River](/wiki/Singapore_River). ## Challenges In an interview with [Lianhe Zaobao](/wiki/Lianhe_Zaobao), Miksic, now an associate professor in the Southeast Asian Studies Program and the Asia Research Institute at NUS, lamented that \"Singapore is probably the only country in the world that does not employ state archaeologists. Even the government of Brunei, with a population one-tenth that of Singapore's, hires them.... Singapore has chosen to be different in this area, which is a very strange phenomenon.\" As there is no official support of archaeological work, there is no centralised storage space for excavated artifacts. Even those unearthed many years ago languish in the homes, storerooms or offices of excavation participants. For example, the artifacts from the Fort Tanjong Katong dig are currently housed in Mountbatten Community Club. In addition, there is no legislation requiring that archaeologists be consulted before construction works proceed, unlike in European countries. ## Promotion of archaeology Despite the abovementioned problems, there is still interest in Singapore's history before 1819. NUS has organised a course, \"History of Singapore before the Landing of Raffles\" annually since 1998, which attracts 250 to 500 interested students each time. Other means of promoting archaeology have included public talks, collaborative research between archaeologists and the National Parks Board, and encouraging community involvement in site surveys and excavations. The excavations at Fort Tanjong Katong and St. Andrew's Cathedral saw enthusiastic participation from members of the public, and there was dismay when the Fort Tanjong Katong excavation pits were filled in at the start of 2006, ostensibly to prevent [mosquitoes](/wiki/Mosquito) from breeding. - History portal - Singapore portal\n",
  "language": "en",
  "processed_at": "2026-01-12T09:53:01.344870",
  "title": "Archaeology of Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Archaeology_of_Singapore"
}