{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:53:05.065864"
  },
  "content": "Beverage company in Singapore The **Archipelago Brewery** was a [Singaporean](/wiki/Singapore) brewery owned by [Heineken Asia Pacific](/wiki/Heineken_Asia_Pacific) (formerly Asia Pacific Breweries). It labelled itself as \"Singapore's Craft Brewery\". ## History In August 1931, with a capital of 5,250,000 guilders N.V. Archipel Brouwerij Compagnie (Archipelago Brewery Co.) was formed in [Batavia](/wiki/Batavia,_Dutch_East_Indies) (now known as Jakarta). The board was formed by the firm, Geo Wehry and Co. This company imported all by Beck brewery in Bremen to brew Koentji (key) beer. The first brewery was built in Batavia, it was made of steel framing, something in the Dutch Indies virtually not been done before. Wehry was a trading company, which started out in trading tobacco. Wehry was later merged with Borsumij and then merged into the still existing Hagemeyer that time in the Dutch East Indies was established. Archipelago opened a brewery on Alexandra Road in Singapore in November 1933, in art-deco buildings designed by Hienrich Rudolf Arbenz, where it produced Anchor Beer. During [World War II](/wiki/World_War_II), the British deemed the brewery to be enemy territory due to its German ties and seized it in 1941. It was then bought by Malayan Breweries Ltd, which in 1990 was renamed Asia Pacific Breweries. In 2013, Asia Pacific Breweries merged to become [Heineken Asia Pacific](/wiki/Heineken_Asia_Pacific). Archipelago Brewery is currently [Heineken Asia Pacific](/wiki/Heineken_Asia_Pacific)'s craft brewing arm. The old Archipelago Brewery was re-commissioned on 24 July 2006, with international brewmaster, Fal Allen. Three variants of the Archipelago craft beers, namely Traveller's Wheat, Straits Pale and Traders Brown Ale were launched at Archipelago's flagship pub located on Circular Road in Singapore (now closed). The re-launch of Archipelago was consistent with Heineken Asia Pacific's objectives to add a new dimension to Singapore's beer industry; and to continue to grow its presence and stature locally. Archipelago Brewery produced boutique beers in small batches. In 2016, Archipelago Brewery brewed and sold 390,000 litres of beer. The Archipelago Brewery currently produces six permanent beers: Tropical Pale Ale, Singapore Blonde Ale, Belgian Wit, Summer IPA, Bohemian Lager and Irish Ale, in addition to limited edition or specialty beers. In May 2024 Heineken Asia Pacific announced it would be closing the brewery at the end of June that year. ## Specialty Brews The brewery created speciality brews which were sold as limited-release products, produced in much smaller quantities than the regular brews. Previous speciality brews included: - [Anderson Valley Brewing](/wiki/Anderson_Valley_Brewing_Company) collaboration Pale Ale – Fresh seedless red Californian grapes were squeezed and added to boil in the last 5 minutes, along with Nelson Sauvin and Pacifica hops to give it a subtle orange and gooseberry hop aroma. After a week of cold conditioning, the beer was flushed into a separate tank containing dry hopping bags full of freshly cut and sterilised passion fruit. ABV 4.6%, Bitterness 32 IBU, Colour 25EBC - 1925 Archi Mango IPA collaboration – Various hops were used in the boil and whirlpool to give it flavours of grapefruit, orange and passion fruit. Fresh Mango was added on the 4-day of fermentation along with generous amounts of Centennial hops to give it herbal lemon citrus aromas. ABV – 5.55% Bitterness – 45 IBU. - Renku Lager – Dry hopped with Challenger (UK) and a dash of Japanese green tea which provides a clean fresh aroma of evergreen, wood and green tea tones. - HOPSALE – American Pale Ale with 8 types of hops added throughout different stages of the brew. 5% ABV - COCO's Cream – Nitrogen saturated smooth pour cream ale made with a large amount of cooking chocolate. 4.2% ABV ## Awards YearOrganiserWinning VariantAwardCategory2008Brew NZSamuiSilverFruit/Spiced/Herb/Flavoured Beer, Fruit and Vegetable2008Brew NZExplorerSilverFrench and Belgian Style Ales, French-Belgian Style Saison2010[World Beer Cup](/wiki/World_Beer_Cup)Straits PaleSilverInternational Pale Ale2011The Brewing Industry International AwardsBelgian WitBronzeWheat Beer2011[Australian International Beer Awards](/wiki/Australian_International_Beer_Awards)Belgian WitSilverWitbier Style2011[Australian International Beer Awards](/wiki/Australian_International_Beer_Awards)Irish AleSilverBritish Style Pale Ale2011[Australian International Beer Awards](/wiki/Australian_International_Beer_Awards)Summer AleBronzeBritish Style Pale Ale2011[International Brewing Awards](/wiki/Brewing_Industry_International_Awards)Hickory Smoked IPABronzeSpecialty2011Brew NZBohemian LagerSilverInternational Lager Styles2011Brew NZIrish AleGoldBritish Ale Styles2011NZSummer AleSilverBritish Ale Styles2011Brew NZBelgian WitBronzeWheat & Other Grain Styles2011Japanese Beer AwardsIrish AleSilverIrish Ales category, only medal in the category2011Japanese Beer AwardsBohemian LagerSilverInternational Lager Styles, only medal in the category2011Japanese Beer AwardsSummer AleBronzeEnglish Style Summer Ales, only medal in the category2012[Australian International Beer Awards](/wiki/Australian_International_Beer_Awards)Summer AleBronzeEnglish Summer Ale2012[Australian International Beer Awards](/wiki/Australian_International_Beer_Awards)Irish AleBronzeAmerican Styly Red Draught2012[Australian International Beer Awards](/wiki/Australian_International_Beer_Awards)Belgian WitSilverBelgian Wit Draught2012International Beer Challenge UKBohemian LagerSilverLager2012International Beer Challenge UKIrish AleBronzeAles2012International Beer Challenge UKSake SorachiBronzeSpecialty2012Brewers Guild Awards NZBelgian WitGoldWheat & Other Grain Styles2012Japan International Beer AwardBohemian LagerGoldInternational – Style Lager2012Japan International Beer AwardSummer AleBronzeEnglish Style – Summer Ale2012Japan International Beer AwardBelgian WitBronzeBelgian-Style Witbier2014Japan International Beer AwardEnglish BitterSilverOrdinary Bitter2014Japan International Beer AwardBelgian WitBronzeBelgian-Style Witbier2016BeerFest Asia SingaporeBelgian WitGoldBelgian-Style Witbier2016BeerFest Asia SingaporeBlemished Flemish SaisonSilverSaison – Farmhouse - Archipelago Brewery Website Portals: - Singapore - Beer\n",
  "language": "en",
  "processed_at": "2026-01-12T09:53:05.065416",
  "title": "Archipelago Brewery",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Archipelago_Brewery"
}