{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:53:11.068427"
  },
  "content": "Road pricing scheme in Singapore The **Singapore Area Licensing Scheme** (**ALS**) was a [road pricing](/wiki/Road_pricing) scheme introduced in Singapore from 1975 to 1998 that charged drivers who were entering downtown Singapore. This was the first urban traffic [congestion pricing](/wiki/Congestion_pricing) scheme to be successfully implemented in the world. This scheme affected all roads entering a 6-square-kilometre area in the [Central Business District](/wiki/Central_Area,_Singapore) (CBD) called the \"Restricted Zone\" (RZ), later increased to 7.25 square kilometres to include areas that later became commercial in nature. The scheme was later replaced in 1998 by the [Electronic Road Pricing](/wiki/Electronic_Road_Pricing). ## Background The introduction of [congestion pricing](/wiki/Congestion_pricing) was one of a number of anti-congestion policies implemented in Singapore since the 1970s, in recognition of the country's land constraints, need of economic competitiveness, and to avoid the traffic gridlock that chokes many cities in the world. One key aspect of demand management in Singapore is the restraint of vehicle ownership, either through the imposition of high ownership costs or restriction on the actual growth of the car population. These measures have included high annual road tax, custom duties and vehicle registration fees. Besides fiscal deterrents, supply of motor vehicles was regulated since 1990, when a Vehicle Quota System was introduced. These high initial buy-in charges are considered as the price motorists pay for the luxury of owning a car and to cover part of the fixed costs associated with scaling basic road infrastructure. Then, use-related charges, such as fuel taxes (50% of final sale price), ALS or high parking rates are utilised by public authorities to further constraint travel. In parallel to the whole spectrum of [road pricing](/wiki/Road_pricing) measures, the government has invested heavily in public transport and implemented a park-and-ride scheme, with thirteen fringe car parks, hence providing car users a real alternative to switch travel modes. In summary, Singapore's urban and transport strategy allowed the users to have pro-transit \"carrots\" matching auto-restraint \"sticks\", and as a result, despite having one of the highest per capita incomes in Asia, 32% of Singaporean households owned cars in 2010. The ALS was first formulated and designed in 1973, under the leadership of a high level inter-ministerial committee, which recommended policies and measures to improve the urban transport situation back then. The ALS scheme was implemented only after a one-year public dialogue and some modifications were made based on the public's feedback. As detailed above, the ALS was sold as part of an overall package of road pricing measures and public transportation improvements that helped to gain public support. ## Scheme A total of 28 overhead gantries were set up along the boundaries of the RZ, including the areas surrounding Orchard Road. These gantries were monitored by auxiliary police officers who carried out visual checks and recorded any violations. Fines started at S$50. Users had to buy, in advance, a special paper licence at a cost of S$3 per day, which was sold at post offices, petrol stations, area licence sales booths or convenience stores, on a monthly or daily basis. This licence was displayed on the car windscreen or on the handle bars for motorcycles during hours of operation. Initially, they were 7.30 am to 9.30 am daily, except on Sundays and public holidays. However, it soon had to be extended to 10.15 am, to control the surge of vehicles waiting to enter just after 9.30 am. In 1989, the evening peak had to be restricted too, and in 1994, the ALS was extended from 7.30 am to 6.30 pm. In the first few years after the introduction of the ALS, passenger cars having four or more occupants, taxis, public buses and service vehicles were allowed into the zone without being charged. [Carpool](/wiki/Carpool) was exempted too, to better manage demand and to counter the belief that the scheme favoured the rich. Special carpool pick-up points were set up. In 1989 more users were required to pay the fee, as motorcycles and heavy vehicles made up about two-thirds of the traffic entering the RZ. Hence, with this review of the policy, only buses and emergency vehicles were exempted. Later, the exemption for carpools was abolished, because many private cars were picking up bus commuters just to avoid the payment. In 1980, the fee was increased to S$5, but in 1989 it was reduced back to S$3, due to the fact that now more vehicles were paying. In 1994, two levels of licence fees were established, to differentiate between daily permits and inter-peak licences. The paper licences vary in shape depending on the class of vehicle, and their colours varied from one month to another to deter fraud. The colour-coded licences also made it easier for the enforcement personnel to identify the vehicles during the restricted hours. For reason of traffic management, violating vehicles were not stopped at the gantries, but their number plates were taken down and their owner would receive an order to appear in court to pay the fine. The control was made only at the gantries, therefore, vehicles were free to move around or leave the RZ without having to pay the fee. ALS gantries were enforced by CISCO officers, who manually screened passing vehicles and book offending vehicles with fines. Prior to the end of the ALS and the beginning of Electronic Road Pricing (which rendered manual checks obsolete), 105 such officers were deployed. ## Impact According to the book *The Journey – Singapore's Land Transport Story*, the amount of traffic entering the Restricted Zone in June 1975 (before the ALS was introduced) was 32,500 vehicles, and after the beginning of the ALS in June 1975, the vehicle numbers dropped to only 7,700, between the hours of 7.30 am to 9.30 am, a 76% reduction; and 9% of the users switched to transit. The use of transit for work related trips into the RZ *\"sharply increased from 33% before the ALS to about 70% by 1983\"*. In 1994 ALS was extended to a full day, resulting in an immediate 9.3% drop in traffic in and out the RZ. The ALS, despite its simplicity, succeeded in effectively restraining congestion in the RZ for more than 20 years. Before the implementation of ALS and the other complementary measures, the motor vehicle fleet was growing at an annual rate of 6%, and in 1975 the traffic volume entering the RZ was about 100,000 vehicles. After the government intervention, the fleet slowed down to a moderate 4% rate of growth, and traffic entering the RZ was limited to only 230,000 vehicles in 1994. ## Road Pricing Scheme (RPS) extended In 1995, congestion pricing was also implemented in urban segments of three major expressways, starting with the East Coast Parkway (ECP). The RPS, as it was called, also operated manually with paper licences to enter the expressways. In 1997, the RPS was implemented in the Central Expressway and the Pan Island Expressway. After the implementation of RPS, the Central Expressway Average speed at peak hour went to 67 km/h from the previous average of 31 km/h. This extension was necessary because some through traffic was diverted by the ALS to routes that bypassed the RZ, increasing demand on these arterials and creating a need for expanding the capacity of the road network outside the RZ. Because of heavier demand, only the Central Expressway required a separate licence, not valid for the RZ. During this time, a more modern system was being planned, to charge every time a user entered the RZ, and thus, charges would reflect the true cost of driving at congested times. ## Electronic Road Pricing (ERP) Overall, the ALS was successful in ensuring smooth traffic flow in the Central Business District. After about 10 years of planning and testing, in September 1998, the Area Licensing Scheme was terminated as Singapore upgraded to the current [Electronic Road Pricing](/wiki/Electronic_Road_Pricing) system, which is completely automatic and allows passing the control gantries at normal speeds. The ERP system is still in use in Singapore, and many similar schemes were based on it,[*citation needed*] such as the [London congestion charge](/wiki/London_congestion_charge). - [Road pricing](/wiki/Road_pricing) - [Electronic toll collection](/wiki/Electronic_toll_collection) - [Edinburgh congestion charge](/wiki/Edinburgh_congestion_charge) - [Milan Area C](/wiki/Milan_Area_C) - [Milan Ecopass](/wiki/Ecopass) - [New York congestion pricing](/wiki/New_York_congestion_pricing) - [San Francisco congestion pricing](/wiki/San_Francisco_congestion_pricing) - [Stockholm congestion tax](/wiki/Stockholm_congestion_tax) ## Sources - [Cervero, Robert](/wiki/Robert_Cervero) (1998), *The Transit Metropolis*, Island Press, Washington, D.C., [ISBN](/wiki/ISBN_(identifier)) 1-55963-591-6 - Kian-Keong Chin (2005). \"Road Pricing – Singapore's 30 Years of Experience\" (PDF). Portals: - Economics - Environment - Singapore - Transport\n",
  "language": "en",
  "processed_at": "2026-01-12T09:53:11.067982",
  "title": "Area Licensing Scheme",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Area_Licensing_Scheme"
}