{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:53:13.661875"
  },
  "content": "Armenian church The **Armenian Church of Saint Gregory the Illuminator**, referred to locally as the **Armenian Church**, is the oldest surviving Christian church in [Singapore](/wiki/Singapore), located at [Hill Street](/wiki/Hill_Street,_Singapore) in the [Museum Planning Area](/wiki/Museum_Planning_Area), within the [Central Area](/wiki/Central_Area,_Singapore). The church was completed in 1835 and consecrated the next year. Originally a parish of the [Armenian Apostolic Church](/wiki/Armenian_Apostolic_Church), an [Oriental Orthodox](/wiki/Oriental_Orthodox) denomination, the last Armenian parish priest left in the late 1930s as Armenian population in Singapore dwindled. It was designated as a [national monument](/wiki/List_of_national_monuments_of_Singapore) in 1973. Armenian and Oriental Orthodox services are now regularly held at the church. ## History ### Foundation and early history The church was commissioned by the first twelve Armenian families that settled in Singapore. It was designed by [George Drumgoole Coleman](/wiki/George_Drumgoole_Coleman), the architect of many of Singapore's early buildings who also became the first [Superintendent](/wiki/Public_administration) of Public Works. The church is dedicated to [St Gregory the Illuminator](/wiki/Gregory_the_Illuminator), the first [Patriarch](/wiki/Patriarch_of_Armenia) of the [Armenian Church](/wiki/Armenian_Apostolic_Church). The [Armenians](/wiki/Armenians) were among the earliest merchants and traders to arrive in Singapore after [Sir Stamford Raffles](/wiki/Sir_Stamford_Raffles) established it as a trading port in 1819. The community already held religious services in Singapore by 1821, and the first priest, the Reverend Krikor Hovhannes (Gregory John), arrived in July 1827. A temporary chapel was set up at the back of John Little & Company at Commercial Square (today's [Raffles Place](/wiki/Raffles_Place)). The community started to raise funds for the construction of a new church in 1827. Over half the construction cost of 5,058.30 [Spanish dollars](/wiki/Spanish_dollar) was donated by the Armenian community in Singapore, with the rest coming from Armenians in [Java](/wiki/Java) and [India](/wiki/India), and a small portion from European and Chinese [merchants](/wiki/Merchant) in Singapore. The Armenian community was very small – the 1824 census counted only 16 members, and 34 in 1836 when the church opened – its contribution to the Armenian Church was therefore considerable in proportion, an indication of the prosperity and religious devotion of the Armenians. A request for land to build the church was made by the Armenian community in 1833, and the government granted the land at the foot of [Fort Canning](/wiki/Fort_Canning) in 1834. The foundation stone was laid on 1 January 1835 by the Supreme, [Archimandrite](/wiki/Archimandrite) Reverend Thomas Gregorian, who also opened and consecrated the new church on [Easter Sunday](/wiki/Easter_Sunday) in 1836. He was assisted by [Reverend](/wiki/Reverend) Khachig Hovhannes, the priest for the local community. It is the oldest surviving Christian church built in Singapore. The church has undergone a few modifications since it was first built. A bell turret designed by Coleman was deemed structurally unsound, and it was replaced first by a square tower in 1847, then again replaced in 1853 with the spire as it appears today, which was designed by George Maddock. In 1905, a two-storey [bungalow](/wiki/Bungalow) was built in 1905 by Nanajan Sarkies in memory of her late husband, John Shanazar Sarkies. In 1909, the church became the first building in Singapore with electricity. ### Later history The Armenian population in Singapore dwindled, and the last Armenian parish priest left in the late 1930s. In the late 1960s, when the Christian Cemetery at Fort Canning was cleared for a park, early Armenian tombstones there were moved into the Memorial Garden at the church ground. Tombstones from [Bukit Timah](/wiki/Bukit_Timah)-Cavenagh Road cemetery were also moved here. A number of tombstones of prominent Armenians in Singapore, such as members of the [Sarkies family](/wiki/Sarkies_brothers) of [Raffles Hotel](/wiki/Raffles_Hotel) fame, [Agnes Joaquim](/wiki/Agnes_Joaquim) who bred [Singapore's national flower](/wiki/Vanda_%27Miss_Joaquim%27) and Catchick Moses who founded the newspaper *[Straits Times](/wiki/The_Straits_Times)*, are placed here. The Memorial Garden however was never used as a burial ground. Armenian Street is named after the church and it was known earlier by its Chinese name *seng poh sin chu au* meaning \"the back of Seng Poh's new building\" (Tan Seng Poh was the first Chinese to serve on the Municipal Commission). The Armenian Church was [gazetted](/wiki/Gazette) as a [national monument](/wiki/National_Monuments_of_Singapore) on 6 July 1973. On 17 September 1979 *[vardapet](/wiki/Vardapet)* Daron Djerejian, an Armenian priest from [Nice](/wiki/Nice), France, visited the church and conducted a [Divine Liturgy](/wiki/Divine_Liturgy). At that point, the church had been abandoned religiously for decades. In 1985 the Armenian Church celebrated the 150th anniversary of the church. Archbishop Aghan Baliozian, the primate of the diocese of Australia, led a group of Armenian pilgrims from Australia, the Philippines, Hong Kong, Thailand, Japan, and San Francisco, U.S. to Singapore in June 1985. ### Current state [Divine Liturgy](/wiki/Divine_Liturgy) was performed at the church in 2001, on the occasion of the 1700th anniversary of adoption of Christianity as a state religion of Armenia. On 27 March 2011 some 160 Armenians from 20 countries gathered at the church to commemorate the 175th anniversary of the church. On 29 March 2016 by the Pontifical Order of [Karekin II](/wiki/Karekin_II), Supreme [Patriarch](/wiki/Patriarch#Oriental_Orthodox_Churches) and [Catholicos of All Armenians](/wiki/Catholicos_of_All_Armenians), Fr. Zaven Yazichyan, a member of the Brotherhood of Holy Etchmiadzin, was appointed to serve as the Pastor of the Armenian Spiritual Pastorates of Singapore, Myanmar and Dhaka. Yazichyan, who is based in [Yangon](/wiki/Yangon), Myanmar, visited Singapore five or six times a year to serve mass. Yazichyan was moved to be an assistant to the Grand Sacristan of the [Mother See of Holy Etchmiadzin](/wiki/Mother_See_of_Holy_Etchmiadzin) on 7 September 2017. Currently, visiting clergy from other countries occasionally preside over the [Divine Liturgy](/wiki/Divine_Liturgy) (Holy Badarak/Patarag), including Fr. Movses Sargsyan from Armenian College and Philanthropic Academy and Davidian Girls’ School in Kolkata before the severe outbreak of [COVID-19 in Singapore](/wiki/COVID-19_pandemic_in_Singapore) during the years of 2019 and 2020 and Archbishop Haigazoun Najarian (Primate of the Armenian Diocese of Australia and New Zealand) in 2018 and after the decline of COVID-19, most recently on 12 January 2025. On 20 May 2016 the church received a grant from the government of Singapore for restoration, which was still ongoing as of February 2017. In May 2018, the Armenian Heritage Gallery opened (visits only by appointment), featuring artifacts and other items collected from community archives in Singapore and elsewhere, sometimes also displaying traveling exhibits. There is currently an Armenian Community Centre in construction as an extension of the parsonage building built in 1905. Its completion is expected by mid-2025, completing the Singapore Armenian Heritage Centre, the first integrated Armenian cultural and heritage centre in Asia, comprising the Armenian Church Memorial Gardens and the Stations of the Cross outside in addition to the Armenian Community Centre and the Armenian Heritage Gallery. The small [Coptic Orthodox](/wiki/Coptic_Orthodox_Church_of_Alexandria) community in Singapore occasionally hold services in the building. The St. Mark Coptic Orthodox Church celebrates Holy Mass on the first Saturday evening and Sunday morning of each month. Additionally, the [Saint Flannán](/wiki/Flann%C3%A1n) Mission conducts Divine Liturgy at the church (previously 2nd and 4th Thursdays at 7p.m., currently first Thursday of each month), and the [Taizé Community](/wiki/Taiz%C3%A9_Community) holds regular prayers on Saturday evenings of every other month. Armenian lessons also take place on Sundays from 12 to 1:30p.m. for children 2 to 14 years of age. ## Architecture The existing Armenian Church, built primarily in the British [neoclassical style](/wiki/Neoclassical_style) with a few [eclectic](/wiki/Eclecticism) influences, is centrally-designed in the manner of the [Etchmiadzin Cathedral](/wiki/Etchmiadzin_Cathedral), the mother church of [Armenia](/wiki/Armenia). The church interior is circular, and said to resemble the round [Holy Sepulchre](/wiki/The_Holy_Sepulchre,_Cambridge) in [Cambridge](/wiki/Cambridge), England. The circle however is imposed within a square-cross plan, with projecting square [porticos](/wiki/Portico) in [Roman](/wiki/Roman_architecture) [Doric orders](/wiki/Doric_order). The [Palladian](/wiki/Palladian)-style design may have been inspired by the circular plan for [St Andrews's Church](/wiki/St_Andrew%27s_Church,_Chennai) in [Chennai](/wiki/Chennai), which is in turn derived from one of [James Gibbs](/wiki/James_Gibbs)' designs for [St Martin-in-the-Fields](/wiki/St_Martin-in-the-Fields) in London that was published in his *Book of Architecture*. The original [symmetrical](/wiki/Symmetrical) design by Coleman included neither [tower](/wiki/Tower) nor [spire](/wiki/Spire), instead it featured an [octagonal](/wiki/Octagon) [cone](/wiki/Cone_(geometry)) supporting a small [bell](/wiki/Church_bell) [turret](/wiki/Turret_(architecture)) with [Ionic](/wiki/Ionic_order) [columns](/wiki/Column). The current spire, designed by an English architect George Maddock, is the second to replace the original bell turret by Coleman. The original was first replaced in 1846 by a square tower with Doric [pilasters](/wiki/Pilasters). In 1853, the square tower was replaced by present spire that sits on an octagonal tower, and topped with a ball and cross. Maddock had the [pitched](/wiki/Pitch_(resin)) roof replaced by the present one and, to support the tower and spire, added the east portico around the apse where the [chancel](/wiki/Chancel) is. The semi-circular chancel with the raised grand altar is located opposite the main entrance. Probably at the same time the main entrance on the west portico was also widened. The [Tuscan](/wiki/Tuscan_order) [Doric](/wiki/Doric_order) porticos on the north, south and west fronts of the church are each topped with a triangular [pediment](/wiki/Pediment). Originally the east front simply had a bowed [apse](/wiki/Apse) with Tuscan Doric pilasters, however the bowed apse has since been boxed in by the portico on which the spire was built. The pediment on this portico is inscribed the date \"1835\", the year of the church's [foundation](/wiki/Foundation_(architecture)). The north, south and west porticos were designed to allow [horse carriages](/wiki/Horse_carriage) to pull into the [porches](/wiki/Porch), where ladies may then alight and step directly into the church without soiling their dresses. Coleman's design is adapted to suit Singapore's tropical [climate](/wiki/Climate); for instance, the wide [verandahs](/wiki/Verandah) give [shade](/wiki/Shade_(shadow)) and protect the timber-[louvred](/wiki/Louvre_(window)) windows on the ground floor from heavy downpours. The windows, in turn, diffuse the sunlight and induce cross [ventilation](/wiki/Ventilation_(architecture)). The [pews](/wiki/Pew) are backed with woven [rattan](/wiki/Rattan), a lighter, cooler and more comfortable material. Located within the church ground are the Memorial Garden and the [parsonage](/wiki/Parsonage), a two-storey [bungalow](/wiki/Bungalow) built in 1905 by Nanajan Sarkies in memory of her late husband, John Shanazar Sarkies. ## Gallery - [Armenians in Singapore](/wiki/Armenians_in_Singapore) Further reading - Norman Edwards, Peter Keys (1996), *Singapore – A Guide to Buildings, Streets, Places*, Times Books International, [ISBN](/wiki/ISBN_(identifier)) 9971-65-231-5 - Nadia Wright 'Respected Citizens: the history of Armenians in Singapore and Malaysia' Amassia Publishing 2003, Chapter 9. - Sarkissian, Margaret (1987). \"Armenians in South-East Asia\". *Crossroads: An Interdisciplinary Journal of Southeast Asian Studies*. **3** (2–3). Center for Southeast Asian Studies, [Northern Illinois University](/wiki/Northern_Illinois_University): 1–33. [JSTOR](/wiki/JSTOR_(identifier)) 40860241. - The History of Armenians in Singapore and Malaysia - Uniquely Singapore article - Armenian Church of St. Gregory the Illuminator Singapore - 360-degree virtual tour of the Armenian Church of St. Gregory the Illuminator Singapore 1°17′35″N 103°50′57.5″E﻿ / ﻿1.29306°N 103.849306°E﻿ / 1.29306; 103.849306\n",
  "language": "en",
  "processed_at": "2026-01-12T09:53:13.661379",
  "title": "Armenian Church, Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Armenian_Church,_Singapore"
}