{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:53:15.756203"
  },
  "content": "Street food stall in SingaporeThe topic of this article **may not meet Wikipedia's notability guidelines for companies and organizations**. Please help to demonstrate the notability of the topic by citing reliable secondary sources that are independent of the topic and provide significant coverage of it beyond a mere trivial mention. If notability cannot be shown, the article is likely to be merged, redirected, or deleted. *Find sources:* \"Armenian Street Char Kway Teow\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(July 2022)* *(Learn how and when to remove this message)* **Armenian Street Char Kway Teow** is a [street food](/wiki/Street_food) stall in Anchorvale Block 303 in [Anchorvale](/wiki/Anchorvale), [Singapore](/wiki/Singapore). The food stall was originally located at the corner of [Armenian Street](/wiki/Armenian_Street,_Singapore) and Loke Yew Street, and later relocated along Anchorvale Link. Two more outlets were established in 2013 and 2014. ## History Originally located at the corner of [Armenian Street](/wiki/Armenian_Street,_Singapore) and Loke Yew Street, the former of which being the street the stall was named after, the stall was founded by Tan Chong Chiah in 1949. The stall is known for its Si Hum Kway Teow dish, which is [Char Kway Teow](/wiki/Char_Kway_Teow) with added cockles. The stall participated in a Hawker Festival held at the [Goodwood Park Hotel](/wiki/Goodwood_Park_Hotel) in 1984. In 2001, the stall closed as the coffeeshop it was located in was to be demolished for redevelopment. The stall was later reopened along Anchorville Link by Tan's son, Tan Boon Kiat, in 2011. A new outlet was established in Tampines Round Market and Food Centre in 2013, and is currently being run by Boon Kiat's nephew, Wesley Tan. A third outlet was opened along Sin Ming Road, and was run by Tan's other son, Tan Boon Teck. However, the third outlet closed after Boon Teck was diagnosed with colon cancer in 2014. To pay for his treatment, Boon Teck offered to teach someone the family recipe used in the outlets for at least $10,000, and received supports from the owners of several other stalls, such as [The Fishball Story](/wiki/The_Fishball_Story) and The Masses, as well as the Open Stoves event at the [Singapore Food Festival](/wiki/Singapore_Food_Festival). ## Reception Lhu Wen Kai of *TheSmartLocal* ranked the stall as the thirteenth best Char Kway Teow stall in Singapore in 2015, and gave it a rating of 7.5 out of 10. Tan Hsueh Yun of *[The Straits Times](/wiki/The_Straits_Times)* included the stall in her list of the twenty best eating places in the northern part of Singapore in 2022. This [Singaporean cuisine](/wiki/Singaporean_cuisine)-related article is a stub. You can help Wikipedia by expanding it. - v - t - e This Asia-based restaurant or restaurant chain article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T09:53:15.755871",
  "title": "Armenian Street Char Kway Teow",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Armenian_Street_Char_Kway_Teow"
}