{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:53:22.072836"
  },
  "content": "This is a **list of the coats of arms** that are currently used in Singapore, or have been used during its history. ## National coat of arms Coat of ArmsDurationDescriptionComments1959–present[Coat of arms of Singapore](/wiki/Coat_of_arms_of_Singapore)The escutcheon [gules](/wiki/Gules), a [crescent](/wiki/Crescent) facing a [pentagon](/wiki/Pentagon) of five [mullets](/wiki/Star_(heraldry)) [argent](/wiki/Argent), supported by a lion [dexter](/wiki/Dexter_and_sinister) and a tiger [sinister](/wiki/Dexter_and_sinister) [rampant](/wiki/Attitude_(heraldry)#Rampant) [guardant](/wiki/Attitude_(heraldry)#Positions_indicating_direction) standing on two stalks of [padi](/wiki/Rice) (rice). ## Government Coat of ArmsDurationDescriptionComments1960–presentCoat of arms of the [President of the Republic of Singapore](/wiki/President_of_Singapore)Used by the [President of Singapore](/wiki/President_of_Singapore), the Presidential Crest features a red and white shield on which is emblazoned a lion carrying a stalk of [laurel](/wiki/Laurel_branch). Its shield is surmounted by a crescent moon and five stars, and encircled by an [orchid](/wiki/Orchid) wreath. Beneath the wreath flies a red banner with the word *Singapura* (the [Malay](/wiki/Malay_language) name of Singapore).1965–presentCoat of arms of the [Parliament of the Republic of Singapore](/wiki/Parliament_of_Singapore)The arms consist of the [coat of arms of Singapore](/wiki/Coat_of_arms_of_Singapore) and the [Mace of Parliament](/wiki/Parliament_of_Singapore#Speaker's_procession_and_the_Mace) which is a symbol of the authority of the [Speaker of Parliament](/wiki/Speaker_of_the_Parliament_of_Singapore).Coat of arms of the [Ministry of Defence](/wiki/Ministry_of_Defence_(Singapore))The arms are the coat of arms of Singapore over two swords saltirewise and encircled by an [orchid](/wiki/Orchid) wreath. The motto is \"*Yang Pertama Dan Utama*\" (meaning \"first and foremost\" in Malay). ## Military Coat of ArmsDurationDescriptionComments1960–presentEmblem of the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces)The emblem's escutcheon reads \"*Tentera Singapura*\" (meaning \"[Singapore Army](/wiki/Singapore_Army)\" in Malay). The national coat of arms sits in its interior. The motto is \"*Yang Pertama Dan Utama*\" (meaning \"first and foremost\" in Malay). Two stalks of laurel flank the escutcheon. The laurels are green for the Singapore Army and gold for the Singapore Armed Forces.1960–presentEmblem of the [Singapore Army](/wiki/Singapore_Army)1967–presentEmblem of the [Republic of Singapore Navy](/wiki/Republic_of_Singapore_Navy)The emblem contains the national coat of arms, and below it an anchor which epitomises naval roots and signifies continued adherence to naval values. The lion represents courage, nobility and sovereignty which symbolises the nation and how the RSN will act in defence of Singapore. The tiger represents fierce determination and aggressive deterrence in how the RSN will carry out the duty of protecting the nation. The laurels are the hallmark of excellence that reflects the professionalism and dedication that goes into the making of the RSN.1968–presentEmblem of the [Republic of Singapore Air Force](/wiki/Republic_of_Singapore_Air_Force)The emblem consists of the national coat of arms supported by the silver wings of the Air Force within a bowl of golden laurels.2022–presentEmblem of the [Digital and Intelligence Service](/wiki/Digital_and_Intelligence_Service)The design of the DIS emblem represents its support for the full spectrum of operations and its contributions towards the peace and security of Singapore. The networked globe, enveloped by criss-crossing rings, signifies the DIS' operating domain and its shared identify as a Service. The rings symbolises the DIS' ability to be agile and integrate across various operations, while the two electrons linking the globe and rings represents the digital domain which the DIS operates in. The golden laurels, a common feature of all SAF Services' crests, symbolise the DIS' commitment to achieving mission success, and the red banner represents the unity and loyalty of DIS personnel. ## Historical arms Coat of armsDurationPolitical entityDescriptionNotes1826–1942, 1945–1946Coat of arms of the [Straits Settlements](/wiki/Straits_Settlements)Shield: *Quarterly, the first quarter gules, issuant from the base a tower proper, on the battlements thereof a lion passant guardant Or; the second quarter argent, on a mount an areca nut palm tree proper; the third quarter also argent a sprig of the oil tree keruing proper; the fourth quarter azure in base on waves of the sea in front of a representation of the sun rising behind a mountain, a sailing yacht in full sail to the sinister, all proper.* Crest: *A demi-lion rampant guardant supporting in the paws a staff proper, thereon flying to the sinister a banner azure, charged with three imperial crowns Or.* The \"first quarter gules\" containing a lion on a tower represented Singapore.1946–1959Coat of arms of the [Colony of Singapore](/wiki/Colony_of_Singapore)Shield: *Gules, issuant from the base a tower proper, on the battlements thereof a lion passant guardant or.* Crest: *A demi-lion rampant guardant supporting in the paws a staff proper, thereon flying to the sinister a banner argent, on a pall reversed gules, an imperial crown or.* Used when Singapore was a Crown colony.1948Coat of arms of the Colony of SingaporeShield: *Gules, a tower issuant from the base proper; on the battlements thereof a lion passant guardant or; on a chief embattled of the last a pair of wings conjoined in base between two anchors azure* Crest: *on a wreath argent and azure on front of a palm tree fructed proper, issuant from a mount vert, a lion passant or.* Motto: *MAJULAH SINGAPURA* (Onward Singapore) Used when Singapore was a Crown colony. This was granted by letters patent of 9 April 1948, and replaced after five months. - [Coat of arms of Singapore](/wiki/Coat_of_arms_of_Singapore) - [List of Singaporean flags](/wiki/List_of_Singaporean_flags)\n",
  "language": "en",
  "processed_at": "2026-01-12T09:53:22.072418",
  "title": "Armorial of Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Armorial_of_Singapore"
}