{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:53:25.542191"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Art Elective Programme\" Singapore – news **·** newspapers **·** books **·** scholar **·** JSTOR *(March 2021)* *(Learn how and when to remove this message)* The **Art Elective Program (AEP)** is offered by schools in [Singapore](/wiki/Singapore) that have obtained permission from the [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)). This programme is also known as Higher Art and can also be offered as a [Singapore](/wiki/Singapore)-[Cambridge](/wiki/University_of_Cambridge) [General Certificate of Education](/wiki/General_Certificate_of_Education) [Ordinary Level](/wiki/GCE_Ordinary_Level) (O-level) subject. Lessons for the AEP are usually conducted in a separate classroom, sometimes after regular classes. Schools that offer AEP as a subject normally have an art room, a media lab and facilities to store and use art materials. In AEP, students learn how to design or work with digital art programs such as [Adobe Illustrator](/wiki/Adobe_Illustrator). Techniques with basic media such as pencil, pen, and paint are taught. The lessons also include Study Of the Visual Arts (SOVA), in which the students are taught to analyze works by renowned artists. ## History AEP was announced in 1983 by the Ministry of Education. It was conceived as an enrichment programme for students with an artistic flair. It was started in January 1984 by the Chinese High School and the Nanyang Girls' High School. AEP is designed to enable students with artistic abilities to undertake an enriched art programme. The AEP curriculum aims to develop students’ conceptual and analytical thinking and creativity. Samples of the AEP curriculum and students’ creative processes and artworks can be found in the catalogue published for the AEP exhibition. ## Projects Every year, students create at least two projects within the spectrum of art and design, such as photography or designing a logo. Projects are weighted heavily in the overall grade. ## Examinations Throughout the year the students prepare SOVA and Drawing and Painting papers. The four exams are Continual Assessments 1 and 2, Semester Assessments 1 and 2. Drawing and Painting examinations vary in duration and students are allowed to create an art piece over around 3 hours. Three weeks before the Drawing and Painting exams, students are given several themes to choose from. They then have three weeks to complete their Preparatory work for assigned task. The exam is marked according to five components: Investigation and Interpretation of Theme, Exploration and Development of Theme, Aesthetic Qualities, Control of Materials and Technical Processes and Personal Response. For the SOVA examination, students are tested on several artists whom they have studied. They examine selected artworks by these artists and interpret their styles and the methods applied to produce the artwork. This paper is considered a \"theory\" examination. ## AEP Schools - [Bukit Panjang Government High School](/wiki/Bukit_Panjang_Government_High_School) - [CHIJ Secondary (Toa Payoh)](/wiki/CHIJ_Secondary_(Toa_Payoh)) - [Hwa Chong Institution](/wiki/Hwa_Chong_Institution) - [Nanyang Girls High School](/wiki/Nanyang_Girls_High_School) - [Victoria School](/wiki/Victoria_School) - [Zhonghua Secondary School](/wiki/Zhonghua_Secondary_School) - [National Junior College](/wiki/National_Junior_College) (As an AEP center for students of other schools which are not AEP centers) Ref\n",
  "language": "en",
  "processed_at": "2026-01-12T09:53:25.541782",
  "title": "Art Elective Programme (Singapore)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Art_Elective_Programme_(Singapore)"
}