{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:53:27.853802"
  },
  "content": "* *This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)* **A major contributor to this article appears to have a close connection with its subject.** It may require cleanup to comply with Wikipedia's content policies, particularly neutral point of view. Please discuss further on the talk page. *(October 2013)* *(Learn how and when to remove this message)*The topic of this article **may not meet Wikipedia's notability guidelines for companies and organizations**. Please help to demonstrate the notability of the topic by citing reliable secondary sources that are independent of the topic and provide significant coverage of it beyond a mere trivial mention. If notability cannot be shown, the article is likely to be merged, redirected, or deleted. *Find sources:* \"Art Plural Gallery\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(March 2014)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)*Art gallery in Armenian Street, Singapore **Art Plural Gallery** is an art gallery in [Singapore](/wiki/Singapore). It shows [modern](/wiki/Modern_art) and [contemporary art](/wiki/Contemporary_art) and [design](/wiki/Design). It has been called one of the ten best contemporary art galleries in Singapore and in 2013 was named as one of the world's best new galleries. ## History The gallery was founded in 2011 by a Swiss art dealer, Frédéric de Senarclens. It occupies 1,100 square metres (12,000 sq ft) in a historic [Art Deco](/wiki/Art_Deco) building on Armenian Street, in the cultural district of [Singapore](/wiki/Singapore). It opened on 3 June 2011 with \"Avant Première\", which included works by [Marc Quinn](/wiki/Marc_Quinn), [Fernando Botero](/wiki/Fernando_Botero), [Fabienne Verdier](/wiki/Fabienne_Verdier), [Bernar Venet](/wiki/Bernar_Venet) and [Shirin Neshat](/wiki/Shirin_Neshat). Artists who have exhibited at the gallery include [Pablo Reinoso](/wiki/Pablo_Reinoso_(designer)), [Ian Davenport](/wiki/Ian_Davenport_(artist)),[*unreliable source?*] Bernar Venet, Shirin Neshat, Fabienne Verdier, Chun Kwang Young and [Qiu Jie](/wiki/Qiu_Jie). In early 2012 the gallery started its Emerging Artists programme to promote the work of promising artists at an early stage of their career. The programme offers the selected artist a first solo show in the gallery. Siddhartha Tawadey was the first artist to exhibit under this programme. By 2013 about 35% of the clients of the gallery were from [Singapore](/wiki/Singapore); some overseas clients visit the gallery. About 25% of sales are made online. ## Publications Catalogues published by the gallery include: - Olivia Ludlow (2011). *Regards Croisés: A Selection of Asian Contemporary Art*. - Henri-François Debailleux (2012). *Pablo Reinoso: Scribbling Power*. - Joséphine Matamoros (2012). *Tom Carr: Visualisation de la pensée*. Barcelona: Comanegra; Singapore: Art Plural Gallery. - Michael Stanley (2012). *Ian Davenport: Between the Lines*. - Caroline Ward (2013). *Chun Kwang Young*. - [Michael Peppiatt](/wiki/Michael_Peppiatt), Jane A Peterson (2014). *Art Plural: Voices of Contemporary Art*. Singapore: Gatehouse. 1°17′39″N 103°50′58″E﻿ / ﻿1.29417°N 103.84945°E﻿ / 1.29417; 103.84945\n",
  "language": "en",
  "processed_at": "2026-01-12T09:53:27.853350",
  "title": "Art Plural Gallery",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Art_Plural_Gallery"
}