{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:53:24.204302"
  },
  "content": "* *This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **contains promotional content**. Please help improve it by removing promotional language and inappropriate external links, and by adding encyclopedic text written from a neutral point of view. *(April 2025)* *(Learn how and when to remove this message)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Art Apart Fair\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(May 2025)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* **Art Apart Fair** is Singapore's first hotel-based boutique art fair. Initially called Worlds Apart Fair in January 2013, the success of the fair encouraged a second edition, later renamed as Art Apart Fair as part of a series of \"Apart Fairs\". Art Apart coincides with Singapore Art Week, an initiative launched by the [National Arts Council](/wiki/National_Arts_Council_(Singapore)), along with the [Singapore Tourism Board](/wiki/Singapore_Tourism_Board) and [Singapore Economic Development Board](/wiki/Economic_Development_Board). The fairs take place twice biannually – during January and June or July – in Singapore. Art Apart made its international debut in London in October 2014 at the Town Hall Hotel. It will be held in New York in October 2026. Art Apart Fair serves as a platform to provide support towards emerging artists with the potential to become established. The fair gives artists the opportunity to showcase their works and gain recognition among art lovers and collectors. In January 2014, some 33 galleries and 1,500 artists' work from countries such as Taiwan, China, Australia, Kazakhstan, Croatia, Japan, Vietnam, Austria, Cambodia, South Korea, Russia, Spain and Germany, were featured. Some of the galleries that have exhibited with Art Apart are South Korea's [Seoul Arts Centre](/wiki/Seoul_Arts_Centre), Shanghai's Nancy Gallery, Madrid's Jorge & Fernando Alcolea Gallery and Russia's Gallery 11.12. In comparison to other art fairs, Art Apart focuses on selecting galleries with emerging artists with a possibility of becoming established in their national or international market. To support the advancement of emerging artists, internationally renowned artworks by established artists were carefully selected and featured alongside emerging artists' works. This complimentary inclusion aimed to enhance and showcase the artistic abilities of the emerging talents, providing them with inspiration and encouragement to progress to the next level. Established artists artworks such as [Yayoi Kusama](/wiki/Yayoi_Kusama), [Thierry Noir](/wiki/Thierry_Noir), [Ernest Zacharevic](/wiki/Ernest_Zacharevic), [Christiaan Nagel](/wiki/Christiaan_Nagel) and many more were exhibited alongside emerging artists. Art Apart will continue to feature complimentary established artists works to augment the quality of each art show. Due to the high costs of exhibiting at art fairs and the presence of many artists struggling to succeed financially, there is an \"Adopt An Artist\" initiative, where a Patron of the Arts and sponsors help to fund these artists. Galleries that are invited to showcase new works at Art Apart also help support the emerging artists by paying for the exhibiting fee. Works have to be new and not shown at other art fairs before. Besides providing support for emerging artists, part of the revenue generated from the sales of art works and tickets goes towards helping the young and elderly in Singapore. One of the beneficiaries includes [Halogen Foundation](/wiki/Halogen_Foundation_(Singapore)), an educational charity that helps to develop young leaders and entrepreneurs. Another beneficiary is the Lions Befrienders Service Association, Singapore's largest direct service voluntary welfare organisation, that assists the elderly and helps them engage with the community. Art Apart, in partnership with the charity arm of the Ireland Funds Singapore, hosted a charity art show from March 3 to May 30, 2021. The show was curated by Rosalind Lim, the founder of Art Apart, and Dr Stanley Swee Han Quek, a renowned property developer. This fund raising art show was launched during the COVID-19 pandemic in 2021, a time when limited people were allowed to visit the show. To overcome this challenge, an online auction was organised in conjunction with an art exhibition, and successfully raised funds for [The Ireland Funds](/wiki/The_Ireland_Funds) Singapore Chapter ## History The idea of holding an art fair in a hotel first originated in 1994 as the [Gramercy International Art Fair](/wiki/The_Armory_Show_(art_fair)) in the rooms of [Gramercy Park Hotel](/wiki/Gramercy_Park_Hotel) in New York City. The fair was highly successful, and it is now renamed \"[The Armory Show](/wiki/The_Armory_Show_(art_fair))\". The concept of a hotel-based art fair breaks the conventional presentation of art in a whitewashed gallery space. Visitors are provided with a good idea of how these works would look like in a home setting, as they are being displayed in a more informal setting, such as on beds, table tops, chairs and even bathrooms. Inspired by this layout, Art Apart founder and director Rosalind Lim decided to bring the idea over to Singapore. With over 38 years of experience in diverse fields, such as Public Relations, Branding, Marketing and Event Management, she built the foundation for the first successful hotel art fair – the Worlds Apart Fair in January 2013 at [Conrad Centennial Singapore](/wiki/Conrad_Centennial_Singapore). The fair was later renamed Art Apart Fair and moved to [Parkroyal on Pickering](/wiki/Parkroyal), where the entire 14th floor – rooms, lobbies and corridors – is converted into art galleries. ## Singapore editions ### Worlds Apart Fair @ Conrad Hotel (First Edition January 2013) The inaugural edition of Worlds Apart Fair was held from 25 to 27 January 2013 in 40 rooms at [Conrad Centennial Singapore](/wiki/Conrad_Centennial_Singapore), and saw more than 3,000 visitors and buyers. The fair showcased some 3,400 art works, ranging from paintings and photography to video art, sculptures and installations. Worlds Apart Fair featured emerging contemporary artists from Asia, Africa, Lebanon, Europe, the Americas and Australia, with a greater focus on rising artists from Singapore. Some of the galleries that exhibited include [Vertical Submarine](/wiki/Vertical_Submarine) (Singapore), Villa Del Arte Galleries (Spain) and Art Bridge Contemporary (Korea). Two Chinese talents, Singaporean actor [Qi Yuwu](/wiki/Qi_Yuwu) and renowned Chinese artist [Feng Zhengjie](/wiki/Feng_Zhengjie) collaborated for the first time specially for this fair and presented their work 'Showcase on Print'. ### Art Apart Fair @ Park Royal on Pickering (Second Edition July 2013) Worlds Apart was renamed as Art Apart as part of a series of \"Apart Fairs\". The second edition of Art Apart was held from 5 to 7 July 2013 at [Parkroyal Collection Pickering](/wiki/Parkroyal_Collection_Pickering) and featured over 120 Asian artists and galleries. The art works were focused on Korea and revolved around themes such as \"[Korean Wave](/wiki/Korean_Wave)\", \"Asian Spirit\" and \"Butterfly Effect\". In addition to the display of artworks, the fair included talks by prominent artists and industry experts from around Asia. About 3,000 visitors attended Art Apart Fair 2nd Edition. ### Art Apart Fair @ Park Royal on Pickering (Third Edition January 2014) The third edition of Art Apart took place from 17 to 19 January 2014, showcased more than 1,500 art pieces from 12 countries, including Germany, South Korea, Russia and the Philippines. Besides housing exhibitions such as \"The Destruction of the Readymade Everyday\", the main theme for Art Apart 3rd Edition was \"The Artists' Garden\" – a selection of 100 artists from the 33 participating galleries. Over 4,000 people visited the art fair, an increase from the 2nd Edition. ### Art Apart Fair @ Park Royal on Pickering (Fourth Edition July 2014) The fourth edition of Art Apart was held from 18 to 20 July 2014, where more than 2,000 art pieces were exhibited, with a focus on works by Russian artists. The aim of the event was to introduce Eastern European Art, such as works from Moscow, Kazakhstan, Croatia and Slovenia. Apart from the display of art pieces, there were live paintings of portraits, talks by Russian art experts and Russian Art Performance. Similar to the previous edition, over 4,000 visitors visited Art Apart 4th Edition. ### Art Apart Fair @ Park Royal on Pickering (Fifth Edition January 2015) The fifth edition of Art Apart was held from 23 to 25 January 2015 at [Parkroyal Collection Pickering](/wiki/Parkroyal_Collection_Pickering) . Unlike past editions where the curations were focused on specific countries, such as Singapore, Korea and Russia, this edition showcased [contemporary art](/wiki/Contemporary_art), highlighted [conceptual art](/wiki/Conceptual_art) works and urban art works by street artists from all around the world. Some of the featured artists include emerging Russian artists [Rinat Voligamsi](/wiki/Rinat_Voligamsi) and Maxim Bashev, German artist Kaja el Attar and French artist Bruno Tanquerel. Eight galleries from the previous editions of Art Apart made a return, such as Utterly Art, Gaze Gallery and [Seoul Arts Centre](/wiki/Seoul_Arts_Centre). Over 4,000 visitors attended the fifth edition of the art fair. ### Art Apart Fair @ Park Royal on Pickering (Sixth Edition July 2015) The sixth edition of Art Apart was held from 17 to 19 July 2015. Art Apart Fair featured artworks from the Philippines. The finest Filipino galleries including Big and Small, Gallery Qube, Art Quartel and more showcased the best of contemporary Filipino artworks. Leading the pack of Filipino artists was glass artist Ramon Orlina, who showcased pieces from his stellar three decades in the industry. The art works of Ronald Ventura, the auctions record-holder for Southeast Asian paintings, as well as Geraldine Javier, Marina Cruz, Randy Salon and more were present at the sixth edition. ### Art Apart Fair @ Park Royal on Pickering (Seventh Edition January 2016) The seventh edition of Art Apart was held from 22 to 24 January 2016. Art Apart Fair featured the participation of more than 40 Singaporean artists as well as artists from Malaysia, Thailand, Korea, Iceland, America, Philippines, Russia and France. The Fair is possibly the largest ensemble of fresh, emerging Singaporean artists in an art fair and signals a shift in focus from previous editions that focused on a matrix of foreign artists and art genre. The Presidential Suite will be themed \"Mosaic\" and feature never-before-seen works of Benny Ong, Daniela Beltrani's curated selection of 12 Singapore-based artworks and Rosalind Lim's selection of designers-turned-artists, Hayden Ng and luxury shoe designer Mashizan Masjum. Author [Bryan Koh](/wiki/Bryan_Koh) will also be presenting his books at the Fair. ### Art Apart Fair @ Wisma Atria (Eighth Edition July 2016) The 71/2 Edition happened from 27 May to 5 July 2016 The eighth edition of Art Apart Fair was held from 11 July 2016 to 29 August 2016 at Wisma Atria on Orchard Road. 6,000 sq feet space in a shopping mall on Orchard Road . It focused on artists from North Asia and South East Asia. The fair showcased the works of 97 artists from countries such as Japan, Indonesia, Philippines and Singapore as well as lithographs of pieces by great artists such as [Henri Matisse](/wiki/Henri_Matisse) and Egon Schiele. Artists from Japan participating at Art Apart eighth edition were : Sakiko Asaoka, Masako Asaba, Naohiro Itoh, Yukari Ohhira, Ryotaro Okabe, Rie Osonoi, Hiroshi Kobayashi, Ayako Goshima, Koh Shimizu, Kazuyoshi Teramoto, Chihiro Fukumuro, Makoto Fujii, Nana Monda, Shinichi Wakasa, ### Art Apart Fair @ Pan Pacific Orchard (Ninth Edition January 2017) The Ninth Edition of Art Apart Fair was held at the [Pan Pacific Orchard](/wiki/Pan_Pacific_Orchard) from 7 to 11 January 2017. The art show featured 100 artists from Europe and Asia, represented art galleries and contained a section for private art collectors to showcase their art collections. Highlight of the show are video artist Filip Sterckx \"The Perit Chef\", Erica Hestu Wahyuni from Indonesia, Cezar Arro from the Philippines and architect Fong Hoo Cheong who created a huge sculpture with plastic chairs that is 3 storey high at the main entrance of the hotel. The art fair occupied space spanning 3 floors of the hotel rooms and the lobby and bar area. ### Art Apart Boutique Fair @ Goodwood Grand (Tenth Edition January 2018) Held at Goodwood Grand on Balmoral Road, where four large units newly built five storey bungalows were transformed into an art enclave from 25 to 28 January 2018. In celebration of Art Apart 10th edition, Art Apart featured artworks from both established and emerging artists. Mosaic wall artworks were designed by curator Rosalind Lim and artisans from China were flown to Singapore to create wall art that is four storeys high. All the artworks were sold together with the bungalows and it was the most successful art show in 2018 in terms of art sales revenue. The four bungalows were also sold for around $8 to $10 million each. ### Art Apart @ Isetan Wisma Atria (Eleventh Edition January 2018) The Art Apart Pop Up took place from January 13 to 30, 2018, at Isetan Wisma Atria. This exclusive peripheral art exhibition featured the works of renowned local Singapore artists that were highly sought after by art collectors. The event was organised in conjunction with Art Apart Goodwood Grand to commemorate its 10th Edition, hence it was referred to interchangeably as the tenth and a half or eleventh edition in the media. ### Art Apart Fair @ Temenggong (Special Edition- June 2018) The \"Natural Exchanges\" exhibition opened on 2 June 2018 at Temenggong 18/20, a venue dedicated to fostering cross-cultural exchange. This special edition marked the beginning of a series of exhibitions titled Art Apart @ Temenggong 18/20, a collaborative initiative set to occur regularly over the following two years. Ms. Rosalind Lim, the founder and Executive Director of Art Apart, highlighted the significance of this partnership: \"The Art Apart Fairs have provided a platform for emerging artists globally, with eleven editions in Singapore and one in London. These fairs, held twice a year, showcase artists from around the world in a brief 3-day show.\" The exhibition series at Temenggong 18/20, made possible by the venue partnership, focuses on individual artists each week, featuring a rotating lineup of solo artists to broaden participation. This format aims to support emerging artists in reaching a wider audience, offering educational programs to engage viewers. Since its establishment in 2012, Art Apart has curated the bi-annual Art Apart Fair, a boutique art fair showcasing established collectables and emerging artists from Singapore and beyond. Situated in two black-and-white British Colonial Bungalows on Temenggong Road, Temenggong 18/20 is an initiative of The RICE Company Ltd, a non-profit arts and culture enterprise dedicated to providing opportunities for underserved communities. ### Art Apart Pop-Up @ Telok Ayer Art Club (Pop-Up May 2019) Opening to VIP guests on 5 May 2019 and to the public from 6 May to 11 May 2019 this is a pop-up art show featuring solo French artist Psscal Jalabert's artworks. Curated by Art Apart Founder and Director Rosalind Lim, the title of the show is \"Where Now\". \"Where Now\", allows the art viewers mind to ponder and meander through the thoughts of the artist in Space Time Continuum. This body of artworks took Pascal more than 10 years to complete. ### Art Apart Street Art @ Cooliv Waterfront (Twelfth Edition January 2020) Street art, a popular and influential art form, was chosen for its ability to resonate with its surroundings and themes. This genre of art often reflected local art scenes and provided social commentary on communal living and working spaces. The title \"Miles Apart – Transcending Street Art\" conveyed a message of interconnectivity, which was a concept present in various fields such as cybernetics, biology, and ecology. The idea that all parts of a system were interconnected and relied on each other highlighted the complexity and interconnected nature of the world. This concept was closely related to the observer effect and the butterfly effect, showing how small changes could have significant impacts. The body of work consisted of street art created on canvas, wood and other mediums. The street art was displayed in an open space gallery with a white-washed backdrop, creating an experiential arrangement for viewers. Communication of the art was done through social media and other appropriate channels, allowing for a wider audience to experience the work. The artisanal conceptualisation and materialisation of the street art focused on creating a distinct scene that reflected the generous co-living space in COOLIV. By showcasing selected art pieces in large sizes, the space exuded a sense of warmth and friendliness, creating a calming and serene atmosphere for visitors. Originally constructed in 1953, Cooliv is a 12-floor building featuring 156 rooms. The Singapore Land Authority took special care to preserve the unique heritage elements of the property, adding to the building's retro charm. This distinctive design made Cooliv an ideal canvas for the innovative creations of the street artists involved in the exhibition. ### Art Apart and Artxplor (Art for Charity Edition - May 2021) Art Apart in collaboration with the charity arm of the Ireland Funds Singapore organised a charity art show from 3 March to 30 May 2021, Proudly curated by Rosalind Lim, founder of Art Apart, and Dt Stanley Quek, a renowned property developer, to raise funds for the underprivileged Theme: \"Exploring the Senses of Art from Ireland and Asia\"- From the Emerald Isle to Emerald Hill - A charitable initiative by The Ireland Funds Singapore as part of its “Sense of Ireland” month-long celebration. All contemporary art enthusiasts were welcome to view 123 pieces of artworks by 29 artists from Ireland, Myanmar, Philippines, China, Malaysia, India, and Singapore. All proceeds from the auction sales of 23 pieces of artworks online were donated 100 percent to charity. All exhibition sales at Tanglin Shopping Centre had 25 percent of the sales proceeds donated to charity. It was a very successful event with 90 percent of artworks both online and at exhibition venue sold. ### Art Apart @ Zall Book Store (Zall Book Store Edition Oct to Dec 2021) This art show was held from 1 October to 31 December 2021 at Zall Book Store in Wheelock Place on Orchard Road . Artists selected for weekly solo show to include 100 years old established artist [Lim Tze Peng](/wiki/Lim_Tze_Peng) artworks, Michael Tan an established artist from Malaysia, and more than 10 Filipino emerging artists were also selected for this pop-up show. Prices of artworks from Lim Tze Peng ranging from $30k to $50K and 80 percent of his artworks were sold. ### Art Apart - \"The Art of Deception\" @ My Art Space ( My Art Space Edition January 2024) Following the challenges of the post-Covid era, Art Apart presented an intriguing edition titled \"The Art of Deception\" in January 2024. Art Director and Curator Rosalind Lim sourced works from artists in France during her art residency in March 2023, where she meticulously selected participants for this captivating exhibition. Renowned artists from France, including Ilona Tikvicki, Isabelle, Remi Ucheda, Alexandra Sa, Jerome Bauduin, Maxime, Vincent Bargis, and Marie Lannou, joined talents from Holland like Julia Winter and Singaporean artists [Lim Tze Peng](/wiki/Lim_Tze_Peng), Chankerk, and Debbie Ding to mark the occasion of Singapore Art Week 2024. ### Art Apart @ Park Royal on Pickering (Collectables Edition September 2025) [Parkroyal Collection Pickering](/wiki/Parkroyal_Collection_Pickering) from 18 to 22 September 2025., where an entire executive floor floor with 33 rooms of various sizes will be converted to art galleries, artist studios, music room for both sound and performance, book/poetry reading, podcast talk show hosting related to the arts and workshops. ## Overseas editions Unlike the Singapore editions, where the fairs are conducted biannually, the fairs held overseas – more specifically London and New York – take place once year. ### Art Apart London @ Town Hall Hotel (First Edition 2014) Art Apart made its international debut from 17 to 19 October 2014 at the Town Hall Hotel, in [Bethnal Green](/wiki/Bethnal_Green), East London. The show is believed to be the first hotel art fair that took place in London in a larger scale. The fair showcased over 2,000 contemporary works from more than 100 rising and mid-career artists, including artists such as Oscar Lett, Russell Marshall and Nikolai Ishchuk, occupying the entire second floor of the hotel. Besides featuring artists, art pieces by silversmiths, jewellers and makers, such as Hans Stofer and David Clarke were exhibited as well. Over 3,000 visitors were expected to be present for the Art Apart London 1st Edition.\n",
  "language": "en",
  "processed_at": "2026-01-12T09:53:24.203818",
  "title": "Art Apart Fair",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Art_Apart_Fair"
}