{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:53:37.134242"
  },
  "content": "* *Article 16 of the Constitution of the Republic of Singapore** guarantees the right to education and forbids discrimination in education based on religion, race, or heritage. ## Text of Article 16 Article 16 of the [Constitution of the Republic of Singapore](/wiki/Constitution_of_Singapore) states: > 16.—(1) Without prejudice to the generality of Article 12, there shall be no discrimination against any citizen of Singapore on the grounds only of religion, race, descent or place of birth — > > (a) in the administration of any educational institution maintained by a public authority, and, in particular, the admission of pupils or students or the payment of fees; or > (b) in providing out of the funds of a public authority financial aid for the maintenance or education of pupils or students in any educational institution (whether or not maintained by a public authority and whether within or outside Singapore). > (2) Every religious group has the right to establish and maintain institutions for the education of children and provide therein instruction in its own religion, and there shall be no discrimination on the ground only of religion in any law relating to such institutions or in the administration of any such law. > (3) No person shall be required to receive instruction in or to take part in any ceremony or act of worship of a religion other than his own. > > (4) For the purposes of clause (3), the religion of a person under the age of 18 years shall be decided by his parent or guardian. ## Today Currently, primary school admissions in Singapore have second-highest priority for children whose parents and siblings hold alumni membership for a particular school. Lawmakers and attorneys argue that this policy violates Article 16. This Singapore-related article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T09:53:37.133839",
  "title": "Article 16 of the Constitution of Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Article_16_of_the_Constitution_of_Singapore"
}