{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:53:34.099077"
  },
  "content": "* *Article 10 of the Constitution of the Republic of Singapore** forbids the government of [Singapore](/wiki/Singapore) from instituting slavery or forced labour. ## Text of Article 10 Article 10 of the [Constitution of the Republic of Singapore](/wiki/Constitution_of_Singapore) forbids slavery and forced labour (except in cases of imprisonment). However, the [Parliament of Singapore](/wiki/Parliament_of_Singapore) may institute [compulsory national service](/wiki/National_service_in_Singapore). It states: > 10.—(1) No person shall be held in slavery. > > (2) All forms of forced labour are prohibited, but Parliament may by law provide for compulsory service for national purposes. > > (3) Work incidental to the serving of a sentence of imprisonment imposed by a court of law shall not be taken to be forced labour within the meaning of this Article. ## Modern times Although the government of Singapore has not directly taken part in forced labour, it has been accused of turning a blind eye to the abuse of foreign domestic workers. According to the [Humanitarian Organization for Migration Economics](/wiki/Humanitarian_Organization_for_Migration_Economics), 80% of police reports made by the employers of domestic workers do not lead to charges. Nonetheless, domestic workers that receive warnings in lieu of prosecution can be barred from further employment despite a lack of a conviction. Domestic workers are also not included under the Employment Act, which excludes them from benefits such as sick leave. This Singapore-related article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T09:53:34.098577",
  "title": "Article 10 of the Constitution of Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Article_10_of_the_Constitution_of_Singapore"
}