{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:53:48.027915"
  },
  "content": "* *This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Asas '50\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(November 2019)* *(Learn how and when to remove this message)*This article's lead section **may be too long**. Please read the length guidelines and help move details into the article's body. *(November 2019)* *(Learn how and when to remove this message)*This article **is written like a personal reflection, personal essay, or argumentative essay** that states a Wikipedia editor's personal feelings or presents an original argument about a topic. Please help improve it by rewriting it in an encyclopedic style. *(October 2020)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* The **Writers' Movement '50** (**Angkatan Sasterawan 1950**), better known as **Asas '50**, is the first and oldest [literary association](/wiki/Literary_association) in post-war in Singapore. It was founded on 6 August 1950, with a stated philosophy of \"Art for Society\" (Seni untuk Masyarakat). Asas '50 was formed in the interest of developing Malaysian literature. Asas '50 currently works to promote and propagate literature through [seminars](/wiki/Seminar), [workshops](/wiki/Workshop), forums, dialogues, courses etc. One important event in the early history of Asas '50 was the debate on the purpose of literature. The debate was between two groups, the *Utusan Melayu* group, headed by Asraf and the *Majalah Hiburan* group headed by Hamzah Hussien. The crux of the debate was whether to follow \"Art for Society\" (Seni untuk Masyarakat) or \"Art for Art's Sake\" (Seni untuk Seni). According to researcher Athi Sivan (1997), Hamzah propagated the Gautierian called to distance Asas '50 from the left wing ideologies prevalent at that time in Singapore, especially in *Utusan Melayu*. The debate resulted in Hamzah leaving Asas '50 to form a new literary organisation. After this debate, Asas '50 became less active after 1955, when several of its main members (Keris Mas, Usman Awang, etc.) left to reside back in Malaya, while several loyal members remained in Singapore and continue to spearhead the association to this day. The philosophy held by Asas '50 was described by Keris Mas as follows: > In the field of literature, the proponents of ASAS 50 adopted a new breathe of style, employing a mode of [language](/wiki/Language) that is fresh, departing from the preceding genre of writers, propounding the themes of societal awareness, politics and culture with the aim of revitalising the spirit of freedom, the spirit of independence of a people (bangsa) of its own unique sense of [honour](/wiki/Honour) and [identity](/wiki/Identity_(social_science)), upholding [justice](/wiki/Justice) and combating [oppression](/wiki/Oppression)... We criticised societal backwardness and those whom we regard as the instruments responsible for the birth of such backwardness. We criticised [colonialism](/wiki/Colonialism) and its instruments, that is, the elite class, those whose consciousness have been frozen by the influence of [feudalism](/wiki/Feudalism) and [myths](/wiki/Myth), and [superstition](/wiki/Superstition) that has been enmeshed with religion. Asas '50 emphasized the use of literature as a means of achieving political change. It is led by Mohamed Pitchay Gani (President), Mohamed Latiff Mohamed (Deputy President), Yazid Hussein (vice-president), Abdul Samad Ali (Secretary), Hoirull Amri Tahiran (Secretary 2), Muhammad Herwanto Johari (Head of Youth and Head of Programmes), Namira Mazlan (Head of IT) and Irwan Jamal (Head of Publications).[*citation needed*] ## Seni Untuk Masyarakat With the motto *Seni Untuk Masyarakat* (Arts for the People), Asas '50 was inspired by the Indonesian writers movement, *Angkatan 45*. It promoted several aims: - To free Malay society from those elements of its culture which was obstructing or negating the pursuit of modernity and progress - To advance the intellectual awareness of the rakyat (Malay masses) towards the ideals of social justice, prosperity, peace and harmony; - To foster Malay nationalism; and - To refine and promote the Malay language as the lingua franca of Malaya. An attempt initiated by Asas '50 to absorb the [splinter](/wiki/Splinter_group) literary groups such as Grup Gelorasa and Pass into Asas '50 was carried out in 1974. A new [slogan](/wiki/Slogan) \"Literature for the Community\" was coined to provide a mutual understanding and mission among the new members of Asas '50. The slogan was intentionally generic and without ideological leanings. It was accepted by all the new members of Asas '50.[*citation needed*] However, the purpose of Asas '50 had also changed, as it was no longer necessary to fight for the independence and physical extrication of the community. For this reason, Asas '50's stated aim was to free the community from psychological and intellectual oppression left behind during the reign of the colonial masters and the [Japanese Occupation](/wiki/Japanese_occupation_of_Malaya).[*citation needed*] Asas '50's mission is still schooled in the concept of \"Literature for the Community\" even though it has since changed its slogan.[*citation needed*] ## Language Asas '50's worked towards the development of the [Malay language](/wiki/Malay_language) and was described by kakiseni.com as > the movement that championed the use and development of the Malay language A number of Asas '50 members are teachers and journalists.[*citation needed*] One contribution made by Asas '50 was the introduction of the [Roman script](/wiki/Latin_script) to Malay.[*citation needed*] The [Jawi writing](/wiki/Jawi_script) was initially the modus operandi. However, since the 3rd Malay Language Congress (Kongres Bahasa ke-3) in 1956, under the initiation of Asas '50, [Maritime Southeast Asia](/wiki/Maritime_Southeast_Asia) saw a reformation and revolution in the Malay language arena.[*citation needed*] As a result, Roman spelling was integrated into Malay and remains today. This change simplifies language learning, as Roman spelling is also used in the English language. Research and study of materials and sources from the West were thus made more accessible to Malaysians. Roman spelling has since eclipsed the use of Jawi in daily matters and in education. Only [Brunei](/wiki/Brunei) still practices the use of Jawi.[*citation needed*] ## Trends Asas '50 is the first registered Malay literary association. The association was also involved in the push towards independence for Malaya in the 1950s[*citation needed*] and the changes made to the Malay language via the 3rd Malay Language Congress (Kongres Bahasa ke-3). In the 1970s, Asas '50 initiated the Malay Literary Prize (Hadiah Sastera) which is now known as the Malay Literary Award (Anugerah Persuratan). This allowed the works and efforts of writers to be recognised and appreciated. Asas '50 was also recognised as the first Malay literary body in the region to hold the Regional Malay Literati Conference (Pertemuan Sasterawan Nusantara) in 1977. This has since been integrated and adopted as bi-annual event for the Malay literary scene in this region.[*citation needed*] The association is the first Malay association to have sealed a Memorandum of Understanding with the [National Library Board](/wiki/National_Library_Board) (NLB). In addition, Asas '50 has also published \"Leksikon\", a directory of descriptions of 70 important writers in Singapore from 1965 to 2005. The launch of \"Leksikon\" also made Asas '50 the first association to have held an event at the new NLB building at Victoria Street.[*citation needed*] Asas '50 has been the country's official representative in learning the development of the Malay literature in the region. The association works with regional literary associations such as Gapena ([Malaysia](/wiki/Malaysia)), Asterawani (Brunei), Horisons ([Indonesia](/wiki/Indonesia)) and others. Many of its members are also involved in activities organised and held by the [Dewan Bahasa dan Pustaka](/wiki/Dewan_Bahasa_dan_Pustaka) (DBP), Mastera and Mabbim.[*citation needed*] ## Youth wing The Asas '50 youth wing was started in 2002 with the mission of shaping the next generation of leaders and activists in the Malay literary scene. This aim was advocated for by Masuri S.N, who believed that the strength of an association is reliant on the youths, who will eventually receive the baton to carry the association into the next phase of its mission. The younger members of Asas '50 comprise a large portion of the trainee teachers of the [National Institute of Education](/wiki/National_Institute_of_Education) Townsville Campus. Today, a number of these members are appointment holders in the association's [executive committee](/wiki/Executive_committee). ## Publications To date, Asas '50 has published many books. However, a number of these publications were only produced in the early 2000s, but other books were published independently by members of Asas '50. Among the publications was the 2005 release of Abdul Ghani Hamid's *Petikan Rasa/Extracts of Feelings*. Funded by [National Arts Council](/wiki/National_Arts_Council_(Singapore)) via the Singapore [Cultural Medallion](/wiki/Cultural_Medallion) Grant, the book was a bilingual compilation of Abdul Ghani Hamid's poems and paintings. Another book published by Asas '50 was \"Memoir Perjalanan Mas\" in 2004.[*citation needed*] This historical biography of Muhammad Ariff Ahmad depicted the life and struggles of Mas.[*citation needed*] This book highlights the importance of Muhammad Ariff Ahmad in the Malay culture, language, and literary arena. Inadvertently, this book has become the unofficial documentation of the Malay literary movement history in Singapore.[*citation needed*] The publishing of the first Malay writer's directory called Leksikon was a collaborative effort with the NLB, and it was the first of its kind in the Singapore Malay literature.[*citation needed*] The book provides detailed information on the [creative writers](/wiki/Creative_writing) of Singapore since 1965.[*citation needed*] Another Asas '50 publication was an anthology of poems and [short stories](/wiki/Short_story) called \"Menyongsong Pelangi\" in 2005. This anthology comprises literary works contributed by young writers and is released in commemoration of Asas '50's 55 years celebration.[*citation needed*] ## Impact on Malay film industry [Jamil Sulong](/wiki/Jamil_Sulong) was a founder member of ASAS 50 and was a link for the Malay film industry in Singapore. Films by [P. Ramlee](/wiki/P._Ramlee) were influenced by Asas '50 as the objectives of those films mirrored those of the association. There were also other connections linking P.Ramlee to Asas '50.[*citation needed*] For example, Asraf's wife, Fatimah Murad, was the editor of P.Ramlee's film magazine called the \"Majalah Bintang.\" Thus, Asraf capitalised on this avenue and network to promote the ideologies held by Asas '50 as well as to trade views and opinions with P.Ramlee. Film critics have observed this ideological connection in the film \"[Bujang Lapok](/wiki/Bujang_Lapok)\".[*citation needed*] The film contained [satirical](/wiki/Satire) critique of the greater Malay culture of the time. Another trait prevalent in these films was the use of the actors' real name such as \"Ramlee\", \"Sudin\" and \"Aziz.\" This was P. Ramlee's method of highlighting the emotional reality of the time.[*citation needed*] ## Impact on local media and newspaper The local newspaper has also followed the principle of \"Literature for the Community\" by publishing literary works that spoke of the latest issues faced by the community.[*citation needed*] These poems, shorts stories, and essays focused on issues of the community from the social, religious, political, and economical perspectives.[*citation needed*] The number of literary works published in the local newspaper totaled 3,200 from 1,600 writers as of 1965. This reception has caused Singapore Malay literature to be referred to as \"newspaper literature (sastera akhbar).\" Inadvertently, Asas '50's mission was proliferated by the local newspaper, which held many of the same ideologies as the literary association.[*citation needed*] ## The Resource and Reference Compass The NLB has recognised Asas '50 for its \"Singapore Literary Pioneers Gallery\" and NLB Online Repository of Artistic Works (NORA) projects. This includes a [database](/wiki/Database) collection of Malay writers and [manuscripts](/wiki/Manuscript). Another project piloted by NLB and Asas '50 was the \"Potret Tun Seri Lanang.\" In this project, Asas '50 acted as the middleman in obtaining the literary works of the [Tun Sri Lanang](/wiki/Tun_Sri_Lanang) award winners, which included books, private collections, and more. These were displayed at the special collections section of the NLB. Asas '50 awards the Malay Literary Prize (Hadiah Sastera) to writers. ## Bibliography - Abdul Samat Ali & Mohamed Latiff Mohamed, ***Perjalananku : Karya Sayembara Cerpen Pelajar Menengah 2008***, Angkatan Sasterawan '50, Singapore, 2008. - Anuar Othman & Mana Sikana, ***Jatuh Ke Laut Menjadi Pulau : Pemikiran Sastera Malaysia & Singapura***, Anuar Othman & Associates Media Enterprise, Singapore, 2003. - Anwar Ridhwan, ***Jati Diri Pasca Asas '50***, Dewan Bahasa dan Pustaka, Kuala Lumpur, 1999. - Asmah Haji Omar, ***Ensiklopedia Bahasa Melayu***, Dewan Bahasa dan Pustaka, Kuala Lumpur, 2008. - Athi Sivan, ***Hamzah Hussin: Sekitar Pemikiran Seni untuk Seni***, Penerbit UKM, Bangi, 1997. - Masuri SN, ***Dalam Merenung Dalam***, Angkatan Sasterawan '50, Singapore, 2007. - Mohamed Latiff Mohamed, ***Bila Rama-Rama Patah Sayapnya***, Angkatan Sasterawan '50, Singapore, 2007. - Mohamed Pitchay Gani Bin Mohamed Abdul Aziz, ***Melayu Singapura Dalam Kritikan***, Angkatan Sasterawan '50, Singapore, 2002. - Mohamed Pitchay Gani Bin Mohamed Abdul Aziz, ***Leksikon: Direktori Penulis Melayu Singapura Pasca 1965***, National Library Board, Singapore, 2005. - Muhammad Ariff Ahmad, ***Perjalanan MAS***, Angkatan Sasterawan '50, Singapore, 2007. - Muhammad Ariff Ahmad, ***NILAM : Nilai Adat Melayu***, Majlis Pusat, Singapore, 2007. - Nirwana Haliza Bte Mohamed Halil, Sastera Sebagai Alat Alternatif Menangani Masalah Sosial ***in Aktivis Academic Journal 8***, National Institute of Education, Nanyang Technological University, Singapore, 2008. - Angkatan Sasterawan '50\n",
  "language": "en",
  "processed_at": "2026-01-12T09:53:48.027519",
  "title": "Asas '50",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Asas_%2750"
}