{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:53:54.789030"
  },
  "content": "Rugby team The **Asia Pacific Dragons**, also known as **APDs**, is a [rugby union](/wiki/Rugby_union) team based in Singapore that played in the [Global Rapid Rugby](/wiki/Global_Rapid_Rugby) Showcase Series of 2019. ## History The team is owned and managed by Carinat Sports Marketing based in Hong Kong. The team was founded in 2011 by bringing together the best players from the Pacific Islands and those with heritage in the Islands. It has subsequently focused on nurturing talent and promoting rugby. The team won its first match in Hong Kong against an invitational World XV to claim the inaugural Chartis Cup in 2011. The Asia Pacific Dragons successfully defended the cup against English club [Saracens](/wiki/Saracens_F.C.) in 2012. Initially, the APDs played 15-a-side rugby, then expanded to play [rugby sevens](/wiki/Rugby_sevens) and [rugby tens](/wiki/Rugby_tens). The team won the Hong Kong Football Club Tens in 2012 and the [Singapore Cricket Club Sevens](/wiki/Singapore_Cricket_Club_International_Rugby_Sevens) in 2013, and competed at the [World Club 10s](/wiki/World_Club_10s) in Singapore in 2014. In 2019, the Asia Pacific Dragons, based in Singapore, entered a full-time professional team in the Global Rapid Rugby competition. ## Personnel Coaches for the 2019 season: - [Hale T-Pole](/wiki/Hale_T-Pole) - Head of Rugby - [Ryan Martin](/wiki/Ryan_Martin_(rugby_union)) - Head Coach - [Lee Allan](/wiki/Lee_Allan) - Assistant Coach - Jonathan Leow - Team Manager - Asia portal - Sports portal - [Rugby union in Singapore](/wiki/Rugby_union_in_Singapore) - APDs Rugby page - Asia Pacific Dragons at Carinat.com ### Archives - Former official website of Asia Pacific Dragons at the [Wayback Machine](/wiki/Wayback_Machine) (archived 2014-12-16) This rugby union team article is a stub. You can help Wikipedia by expanding it. - v - t - e This article about sports in Singapore is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T09:53:54.788496",
  "title": "Asia Pacific Dragons",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Asia_Pacific_Dragons"
}