{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:53:51.065777"
  },
  "content": "Television channel **Asia Business News** (**ABN**) was a [Singapore](/wiki/Singapore)-based pan-Asian [business news](/wiki/Business_journalism) channel. Launched on 1 November 1993, it was owned through a partnership between [Dow Jones & Company](/wiki/Dow_Jones_%26_Company), [Tele-Communications Inc.](/wiki/Tele-Communications_Inc.), [Television New Zealand](/wiki/Television_New_Zealand), and other local investors. In December 1997, ABN announced that it would merge with its recently launched competitor, [CNBC Asia](/wiki/CNBC_Asia). ## History Asia Business News (ABN) was announced in February 1993 as a pan-Asian business news network focusing on markets in [Hong Kong](/wiki/Hong_Kong), Indonesia, the Philippines, Taiwan, and Thailand. The network was to be led by [Dow Jones & Company](/wiki/Dow_Jones_%26_Company) and [Tele-Communications Inc.](/wiki/Tele-Communications_Inc.) (TCI), with [Television New Zealand](/wiki/TVNZ) (TVNZ) holding a 36% stake and managing operations in Singapore. The Hong Kong–based Business News Network, Inc., and Singapore International Media Ventures also held minority stakes. Its managing editor was Christopher Graves. ABN launched on 1 November 1993. Despite being broadcast from Singapore, the channel's availability in the city-state was limited because private ownership of satellite dishes was still illegal. Its studios were located at [International Plaza](/wiki/International_Plaza_(Singapore)), using floors that had previously been used as a [car park](/wiki/Multistorey_car_park). An Indian branch, ABNi, was formed as a joint venture between ABN, the [Hinduja Group](/wiki/Hinduja_Group), and [TV18](/wiki/TV18). Starting on 1 September 1994, [Singapore Cable Vision](/wiki/StarHub_TV)'s NewsVision channel began carrying an hour of ABN programming daily from 7 to 8 p.m. every weeknight. In September 1995, TVNZ sold its stake in ABN to Dow Jones and TCI. That same year, the channel faced competition from the Hong Kong–based [CNBC Asia](/wiki/CNBC_Asia). Prior to CNBC Asia's launch, ABN CEO Paul France questioned whether the market could sustain two business news networks, contrasting ABN with CNBC by stating that ABN was not \"an Asian branch of an American company,\" but rather \"designed in Asia, for Asia.\" However, as early as November 1995, reports indicated that Dow Jones and CNBC were considering a merger of their international business networks in Asia and Europe. Discussions about a merger were renewed in November 1997, as both Dow Jones and CNBC were experiencing financial losses from their international ventures. In December 1997, Dow Jones announced a strategic partnership with [CNBC](/wiki/CNBC), under which they would merge their networks in Asia and Europe under the CNBC brand. Additionally, Dow Jones would enter into editorial partnerships for CNBC programming in the United States. CNBC Asia would relocate from Hong Kong to ABN's Singapore studios, resulting in the loss of 150 jobs, with many of whom were hired by the upstart [Bloomberg Television Asia–Pacific](/wiki/Bloomberg_Television#Current_channels) channel which took over the ABN's channel space and CNBC Asia's original Hong Kong headquarters. The merger was completed on 2 February 1998. ## Programmes This section **does not cite any sources**. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed. *(April 2024)* *(Learn how and when to remove this message)* - *Breakfast Briefing* - [*Asian Wall Street Journal on Air*](/wiki/The_Wall_Street_Journal_Asia) - *Trading Day* - *Asia Market Digest* - *Storyboard* - *[Far Eastern Economic Review](/wiki/Far_Eastern_Economic_Review) on Air* - *Money Talk* - *dot.com* - *Corporate Raiders* ## Anchors and presenters - Coco Quisumbing - [Martin Soong](/wiki/Martin_Soong) - Sydnie Kohara - Karen Koh - [Lynette Lithgow](/wiki/Lynette_Lithgow) ## Correspondents - Keiko Bang - Lisa Barron - Stuart Pallister - [Jim Sciutto](/wiki/Jim_Sciutto) - Chris Slaughter\n",
  "language": "en",
  "processed_at": "2026-01-12T09:53:51.065278",
  "title": "Asia Business News",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Asia_Business_News"
}