{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:50:20.523987"
  },
  "content": "Asian semiconductor equipment manufacturer **ASMPT** (formerly ASM Pacific Technology) is a [Singapore](/wiki/Singapore)-headquartered company listed in [Hong Kong](/wiki/Hong_Kong) that designs and manufactures machines and tools used in [semiconductor](/wiki/Semiconductor) and electronics assembly industries. It was originally the Asia division of [ASM International](/wiki/ASM_International) (ASM). ## History In 1975, [ASM](/wiki/ASM_International) founder Arthur del Prado went to Hong Kong for a business meeting with its customer [Philips](/wiki/Philips). During his time there, he took the opportunity to survey the prospects for the semiconductor industry in Hong Kong. Eventually he established ASM Pacific Technology (ASMPT) with Patrick Lam, an [electrical engineer](/wiki/Electrical_engineering) that del Prado recruited during his visit. At first, the company’s business was acting as an agent for the sales of semiconductor materials and shelf production in Asia. Originally ASMPT was an Asian sales branch of ASM which derived its revenue from the sale of encapsulation equipment from the [Netherlands](/wiki/Netherlands) and related materials from the U.S. By 1977, ASMPT had established a sizeable customer base and moved into small-scale production of mold bases. Soon it was producing custom-designed trim and form tools. In 1979, ASMPT made two landmark decisions. The first was to acquire a 10,000 square-foot industrial property to support its move into the production of [lead frames](/wiki/Lead_frame). The second was the acquisition of a [wire bonder](/wiki/Wire_bonder) manufacturing business in Hong Kong from an American company. In 1980, ASMPT looked into designing its own automated equipment. To do this, the company went on an aggressive recruitment spree to attract young engineering university graduates. In 1981, it launched a conversion kit that enabled manual aluminum wire bonder to operate semi-automatically. By 1984, it launched its fully-automatic wire bonders. In 1985, ASMPT produced its first die bonder aimed at LED manufacturers. By the end of the 1980s, the sales of leadframes and equipment provided steady profit streams for ASMPT. At the end of 1989, ASMPT opened a plant in [Shenzhen](/wiki/Shenzhen). ASMPT shifted its attention from manufacturing to [research and development](/wiki/Research_and_development) (R&D). Singapore was selected as its new R&D location due to tax incentives from the [Economic Development Board](/wiki/Economic_Development_Board). Former ASMPT CEO, Lee Wai-kwong stated that Hong Kong engineers would find a solution in the shortest possible time and be done with it while Singapore engineers would take longer to understand the root cause and come up with a more effective solution. ASMPT's growth was financed mainly through [retained earnings](/wiki/Retained_earnings) and bank loans. To expand further, ASMPT chose to become a [public company](/wiki/Public_company) to acquire additional funding. In January 1989, ASMPT held its [initial public offering](/wiki/Initial_public_offering) by listing on the [Hong Kong Stock Exchange](/wiki/Hong_Kong_Stock_Exchange) with del Prado as chairman and Lam as managing director. In 2011, ASMPT acquired the electronics assembly systems business of [Siemens](/wiki/Siemens). In 2014, ASMPT acquired DEK Printing Machines Ltd from the [Dover Corporation](/wiki/Dover_Corporation). ASMPT acquired AMICRA Microtechnologies GmbH in April 2018. In August 2018, ASMPT acquired [Critical Manufacturing](/wiki/Critical_Manufacturing). ASM has reduced its stake in ASMPT over the years. In 1997, 51% of ASMPT was owned by ASM. In 2013, it sold 11.9% of ASMPT making it no longer a [majority shareholder](/wiki/Majority_shareholder). By 2018, ASM's stake in ASMPT was at 25% and [Elliott Investment Management](/wiki/Elliott_Investment_Management) was pushing for ASM to divest from ASMPT. At that time one of the potential buyers was [TCL Technology](/wiki/TCL_Technology). In recent times, ASMPT has been exploring going private. It would later relist on the [Shanghai Stock Exchange STAR Market](/wiki/Shanghai_Stock_Exchange_STAR_Market) where it would obtain higher valuations. ASM supported the proposal although it would not divest its stake. In February 2021, ASM and EV Group partnered to develop die-to-wafer bonding techniques for 3d-IC. In August 2022, the company changed its name from ASM Pacific Technology to ASMPT to avoid confusion with ASM International. In March 2023 it was reported that [PAG](/wiki/PAG_(investment_firm)) was interested in acquiring ASMPT. In October 2024, it was reported that [Kohlberg Kravis Roberts](/wiki/Kohlberg_Kravis_Roberts) was considering acquiring ASMPT. - [ASM International](/wiki/ASM_International) - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T09:50:20.523522",
  "title": "ASMPT",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/ASMPT"
}