{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:54:05.625401"
  },
  "content": "Singaporean mimicry artist **Asokan Muniyandy** (died 12 October 2024) was a Singaporean artist and stage actor who was very well known in the film circles for impersonating veteran Indian actor [Sivaji Ganesan](/wiki/Sivaji_Ganesan). He received the moniker \"**Singapore Sivaji**\" (which later became his [stage name](/wiki/Stage_name)) for his ability to incorporate and channel Sivaji Ganesan's mannerisms on screen. ## Career Asokan plied his trade as a mimicry artiste in 2000 to prolong his career trajectory and career prospects in cine field. He began his career performing at grassroots events to prove his mettle and credentials in mimicry art. Over the years, he built up a reputation being one of the most-sought after performers at many grassroots events across other parts of the world, as he was often invited to perform in numerous charity and grassroots events in countries including Singapore, Malaysia and India. He was a regular face in cultural events predominantly in Malaysia and Singapore. In 2009, he dropped a twist in an exclusive interview with Tamil weekly newspaper *[Tabla!](/wiki/Tabla!)*, by insisting that he only began to impersonate iconic Tamil actor Sivaji Ganesan after being told by wellwishers and by his known associates about how he has an uncanny resemblance to Sivaji Ganesan. He apparently got widespread media attention and popularity after transforming himself into a lookalike doppelganger clone version of Sivaji Ganesan through applying make-up including foundation, lipstick, kohl and blusher. He also developed a keen interest in memorising and practicing about 80 film songs which had appeared in Sivaji Ganesan starrers. Asokan's final performance apparently made rounds on social media platforms with a huge buzz that had been hyped about him in a close-up, where he was seen to have been doing lip-syncing to the song \"Ullam Rendum\" from Sivaji Ganesan's 1974 film *[Sivagamiyin Selvan](/wiki/Sivagamiyin_Selvan)*, and coincidentally, it was moments before he had dramatically collapsed on the stage in an unexpected manner after doing the lip-syncing live performance on stage, leaving the audience stunned in tatters. ## Death He died on 12 October 2024 at the age of 60 and he was reportedly dead when he collapsed on stage during the live stage performance. His funeral was held on 15 October 2024 at Mandai Crematorium Hall. Former Singaporean parliamentarian MP Yee Chia Hsing made a tribute post indicating Asokan as someone who had the natural flair of being an engaging entertainer on the stage. He made the remarks after hearing about his demise, by recalling one of his memorable performances which he delivered at a Nanyang Community Club event in 2018.\n",
  "language": "en",
  "processed_at": "2026-01-12T09:54:05.624934",
  "title": "Asokan Muniyandy",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Asokan_Muniyandy"
}