{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:54:07.977299"
  },
  "content": "Government aided school in SingaporeThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Assumption English School\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(December 2018)* *(Learn how and when to remove this message)* **Assumption English School** (AES) is a co-educational government-aided Catholic secondary school in [Bukit Panjang](/wiki/Bukit_Panjang), [Singapore](/wiki/Singapore). It is one of the seven institutions governed by St Gabriel's Foundation. ## History AES was founded along Upper Bukit Timah Road in 1953 by the [Montfort Brothers of St. Gabriel](/wiki/Montfort_Brothers_of_St._Gabriel), as one of the three components of Boys' Town, a charity also run by the Montfort Brothers. It was then known as Boys' Town English School. By 1955, the school was established as a single-session full school with classes from Primary One to Secondary Four. In 1955, the first batch of students from the school sat for the School Certificate Examination. In 1973, the secondary school section of CHIJ Bukit Timah merged with Boys' Town English School to form a co-educational Catholic school. The new school then took on the name of Assumption English School in honour of the [Assumption](/wiki/Assumption_of_Mary) of [Saint Mary](/wiki/Mary,_mother_of_Jesus). In 1989, the school decided to upgrade its facilities to better meet the demands of education in the years ahead. In December 1992, the primary school section of AES closed and its students transferred to St. Anthony's Primary School. The construction of a new school building for AES started in 1993 at a cost of S$20 million. The new building was officially opened on 16 August 1997 by President [Ong Teng Cheong](/wiki/Ong_Teng_Cheong). From 2013 to 2015, the school was upgraded under the [Ministry of Education](/wiki/Ministry_of_Education_(Singapore))'s [PRIME](/wiki/Programme_for_Rebuilding_and_Improving_Existing_Schools) scheme at a cost of S$40 million. During this time, the school temporarily occupied a site at [Queensway](/wiki/Queenstown,_Singapore). It moved back to its Upper Bukit Timah Road campus on 28 December 2015 and the upgraded school building was opened on 7 July 2017 by Education Minister [Ng Chee Meng](/wiki/Ng_Chee_Meng). ## Alumni - [Dante Chen](/wiki/Dante_Chen): WWE Superstar This Singapore school-related article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T09:54:07.976877",
  "title": "Assumption English School",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Assumption_English_School"
}