{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:54:15.096799"
  },
  "content": "Commercial offices in Tanglin, Singapore **Atbara House** is an historic house on Gallop Road in the [Singapore Botanic Gardens](/wiki/Singapore_Botanic_Gardens). It is often regarded as the first [Black and White House](/wiki/Black_and_white_bungalow) in Singapore, despite it not actually being a black and white house. ## History The Atbara House was built in 1898 by John Burkinshaw, who commissioned [Swan & MacLaren](/wiki/Swan_%26_MacLaren) architect [Regent Alfred John Bidwell](/wiki/Regent_Alfred_John_Bidwell). The building was built on the land of the former Cluny Estate, and was named after the [Atbarah River](/wiki/Atbarah_River) in Sudan. Charles MacArthur, chairman of the [Straits Trading Company](/wiki/Straits_Trading_Company), purchased the building from Burkinshaw in 1903. It was later sold to W. Lowther Kemp in 1916. In 1923, the Straits Trading Company leased the building to the French government, who converted it to an embassy in 1939. The Singapore government acquired the Atbara House from the Straits Trading Company in 1990. Restoration works were carried out on both the Atbara House and the [Inverturret](/wiki/Inverturret) by the [Singapore Land Authority](/wiki/Singapore_Land_Authority) in 2012. In 2015, it was announced that the house would be a part of the Gallop Extension of the Singapore Botanic Gardens. In 2016, the [National Parks Board](/wiki/National_Parks_Board) awarded the tender of the Gallop Extension to Kay Ngee Tan Architects. The house, along with the rest of the extension, opened to the public on 13 March 2021. As of 2022[update], it housed the Forest Discovery Centre @ OCBC Arboretum gallery. The house was featured in a 2006 book, *Black and White: The Singapore House, 1898–1941*, under the heading \"Oldest Black and White House?\". However, the heading of the section led to the misconception that the Atbara House was the first Black and White House in Singapore, despite it only being a \"close relative\" of the Black and White Houses.\n",
  "language": "en",
  "processed_at": "2026-01-12T09:54:15.096284",
  "title": "Atbara House",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Atbara_House"
}