{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:33:23.368778"
  },
  "content": "Bilateral relations [Australia](/wiki/Australia) and [Singapore](/wiki/Singapore) share longstanding and multifaceted relations, elevated by the establishment of the Comprehensive Strategic Partnership (CSP) in 2015. Australia was the first country to establish diplomatic relations with Singapore upon its independence in 1965. Both countries also work closely in multilateral fora and enjoy warm people-to-people relations. Australia has a High Commission in Singapore, while Singapore has a High Commission in [Canberra](/wiki/Canberra). The Australian High Commission at 25 [Napier Road](/wiki/Napier_Road,_Singapore) was built between 1976 and 1977 to a design by prominent Australian firm [Godfrey and Spowers](/wiki/Godfrey_and_Spowers). Completed at a cost of [AU$](/wiki/Australian_dollar)4.2 million, the high commission [chancery](/wiki/Chancery_(diplomacy)) was officially opened by the Minister for Foreign Affairs, [Andrew Peacock](/wiki/Andrew_Peacock), on 21 January 1977. The two nations have an annual meeting between the Prime Ministers, the most recent being the 7th Singapore-Australia Annual Leaders' Meeting in Singapore in June 2023. They also hold biennial high-level talks through the Singapore-Australia Joint Ministerial Committee (SAJMC), the latest being the 13th SAJMC meeting in Canberra, Australia in 2023. ## Country Comparison Common name[Singapore](/wiki/Singapore)[Australia](/wiki/Australia)Official name [Republic of Singapore](/wiki/Singapore) [Commonwealth of Australia](/wiki/Australia)Coat of armsFlagPopulationArea[Time zone(s)](/wiki/List_of_time_zones_by_country)19 [a]Capital [Singapore](/wiki/Singapore) ([City-state](/wiki/City-state)) [Canberra](/wiki/Canberra)Largest city [Singapore](/wiki/Singapore) ([City-state](/wiki/City-state)) [Sydney](/wiki/Sydney)GovernmentUnitary dominant-party parliamentary constitutional republicUnitary parliamentary constitutional monarchyEstablishedHead of state [Tharman Shanmugaratnam](/wiki/Tharman_Shanmugaratnam) [Charles III](/wiki/Charles_III) (Governor-General: ## Trade and investment The Singapore-Australia Free Trade Agreement (SAFTA) was signed by then-Australian Minister for Trade [Mark Vaile](/wiki/Mark_Vaile) and then-Singapore Minister for Trade and Industry [George Yeo](/wiki/George_Yeo) in Singapore on 17 February 2003, and entered into force on 28 July 2003. The SAFTA is Australia's first bilateral free trade agreement since the 1983 Closer Economic Relations Trade Agreement with [New Zealand](/wiki/New_Zealand) and one of Singapore's earliest trade agreements. The third and latest review of the SAFTA was completed in 2016. The revised SAFTA entered into force in December 2017. Trade and investment is sizeable between the two countries. Singapore is Australia's fifth largest trading partner (A$46.8 billion in 2021-22) and fifth largest source of foreign direct investment (A$148 billion in 2022). ### Optus Singaporean company, [Singtel](/wiki/Singtel) is the owner of major Australian telecommunications company [Optus](/wiki/Optus). At the time of purchasing Optus in 2001, the deal was the largest event ever for a Singaporean company valued at approximately A$8.5 billion. ### Digital Economy Agreement In August 2020, Singapore and Australia signed the Digital Economy Agreement to boost bilateral cooperation in trade facilitation, digital identities, fintech, and e-payments. ### Green Economy Agreement Minister for Trade and Industry [Gan Kim Yong](/wiki/Gan_Kim_Yong) and Australian Minister for Trade and Tourism [Don Farrell](/wiki/Don_Farrell) signed the Singapore-Australia Green Economy Agreement on 18 October 2022, in the presence of Prime Minister [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) and Australian Prime Minister [Anthony Albanese](/wiki/Anthony_Albanese), as part of the 7th Singapore-Australia Leaders’ Meeting in Canberra, Australia. ### Chamber of Commerce AustCham Singapore is the peak business body representing the interests of Australian business in Singapore. The origins of the current AustCham go back to the Singapore Australian Business Council (SABC) which was founded in 1977 when a group of Australians with business interests in Singapore met on a regular basis at the Australian High Commission. In 1981, the Singapore Australian Business Council (SABC) was formally registered. Then on 15 June 2001, SABC changed its name to the \"Australian Chamber of Commerce, Singapore\" (AustCham Singapore) in order to better reflect the role played by the organisation in the Singapore business community. The Australian Chamber of Commerce Singapore continues to be a member organisation which fosters, and provides a forum for business links between Australia and Singapore. ## Military cooperation Singapore and Australia enjoy close defence ties, founded on substantive interactions and common perspectives on many issues. The [Singapore Armed Forces](/wiki/Singapore_Armed_Forces) train in Australia, both unilaterally and bilaterally with the [Australian Defence Force](/wiki/Australian_Defence_Force). In March 2020, Singapore and Australia signed the Treaty on Military Training and Training Area Development, a key deliverable of the CSP. Building on 30 years of Singapore’s training in Australia, the Treaty underpins the A$2.25 billion investment to jointly develop military training areas, as well as advanced training facilities in Central and North Queensland, which will benefit both armed forces and deepen defence cooperation. Singapore and Australia have been partners in the [Five Power Defence Arrangements](/wiki/Five_Power_Defence_Arrangements) since 1971 and are both members of the ASEAN Defence Ministers' Meeting-Plus. Due to airspace and land constraints, the [Republic of Singapore Air Force](/wiki/Republic_of_Singapore_Air_Force) (RSAF) maintains a number of overseas bases including two in Australia. The RSAF's 130 Squadron is based in [RAAF Base Pearce](/wiki/RAAF_Base_Pearce), [Western Australia](/wiki/Western_Australia), and its [126 Squadron](/wiki/126_Squadron,_Republic_of_Singapore_Air_Force) is based in the [Oakey Army Aviation Centre](/wiki/Oakey_Army_Aviation_Centre), [Queensland](/wiki/Queensland). ## Multilateral cooperation The two countries are members of the [Commonwealth](/wiki/Commonwealth_of_Nations) and each attend the [Heads of Government Meeting](/wiki/Commonwealth_Heads_of_Government_Meeting) held every two years to further Commonwealth member's relations. The two countries also work closely at international organisations such as the [United Nations](/wiki/United_Nations), the [G20](/wiki/G20), the [World Trade Organization](/wiki/World_Trade_Organization) and the ASEAN Regional Forum. - [Singaporean Australian](/wiki/Singaporean_Australian) - [Foreign relations of Singapore](/wiki/Foreign_relations_of_Singapore) - [Foreign relations of Australia](/wiki/Foreign_relations_of_Australia) ## Notes - Austin, Ian Patrick, ed. (2011). *Australia-Singapore relations: successful bilateral relations in a historical and contemporary context*. Singapore : Joondalup, W.A: Select Pub. ; Faculty Business & Law, Edith Cowan University. [ISBN](/wiki/ISBN_(identifier)) 978-981-4022-81-1. - Jolly, Ione Maria. \"Identity, Community and Place: The Post-World War II Eurasian Exodus from Malaysia and Singapore to Australia\" (PhD dissertation, Charles Darwin University (Australia); ProQuest Dissertations & Theses, 2017. 28911383. - McCarthy, John. \"Singapore and Australian defence 1921–1942.\" *Australian Outlook* 25.2 (1971): 165-180. - McDougall, Derek. \"The Evolution of Australia's Defence Policy in relation to Malaysia-Singapore, 1964–1971.\" *Journal of Southeast Asian Studies* 3.1 (1972): 97-110. - Widmaier, Wesley W. \"Australian Foreign Policy Stability and Instability: Imperial Friendships and Crises from the Great Depression to the Fall of Singapore.\" *Australian Journal of Politics & History* 70.3 (2024): 532-547. online - Singapore-Australia Free Trade Agreement\n",
  "language": "en",
  "processed_at": "2026-01-12T11:33:23.368381",
  "title": "Australia–Singapore relations",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Military_cooperation_between_Australia_and_Singapore"
}