{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:54:27.403179"
  },
  "content": "Aviation industry in SingaporeThis article needs to be **updated**. The reason given is: not fresh. Please help update this article to reflect recent events or newly available information. *(March 2023)* **Aviation in Singapore** is a key component of the [Singaporean economy](/wiki/Economy_of_Singapore). Besides currently the fourth [busiest airport](/wiki/World%27s_busiest_airports_by_passenger_traffic) and the seventh [busiest air cargo hub](/wiki/World%27s_busiest_airports_by_cargo_traffic) in Asia, the Singaporean aviation industry is also a significant aerospace maintenance, repair and overhaul centre. The aviation industry is a significant contributor to the Singapore economy. In 2009, it contributed S$14.2 billion (5.4%) in direct and in-direct value-add to the Singaporean GDP. This included S$8.7 billion of direct contribution from the sector, S$3.1 billion through indirect contributions from the sector's supply chain and S$2.4 billion from [consumer spending](/wiki/Consumer_spending) by employees of the aviation sector and its supply chain. 58,000 [direct jobs](/wiki/Direct_jobs) were available in the industry, rising to 119,000 jobs if the entire [supply chain](/wiki/Supply_chain) is included. Out of the 58,000 direct jobs, aerospace manufacturing companies employed approximately 18,000 people, airline companies employed 15,000, while 24,000 worked in the airports and ground service companies. The sector also directly contributed S$1.5 billion in taxes in 2009.[*citation needed*] Airlines registered in Singapore were also major contributors to the economy, employing over 15,000 in Singapore and providing a further 11,000 jobs in the supply chain in 2009. Overall, these airlines contribute over S$5.5 billion to the economy and supported 34,000 jobs in Singapore.[*citation needed*] ## History This section may **require cleanup** to meet Wikipedia's quality standards. No cleanup reason has been specified. Please help improve this section if you can. *(June 2011)* *(Learn how and when to remove this message)* In 1937, the Wearne Brothers launched the first commercial air service between Singapore and [Malaya](/wiki/Malay_Peninsula). It was called [Wearne Air Services](/wiki/Wearne_Air_Services). On 28 June 1937, a [de Havilland Dragon Rapide](/wiki/De_Havilland_Dragon_Rapide) aircraft, the Governor Raffles, took off from Singapore to [Kuala Lumpur](/wiki/Kuala_Lumpur) and [Penang](/wiki/Penang). It was the inaugural commercial air service between these three cities by Wearnes Air Services. The WAS services ceased with the onset of [World War II](/wiki/World_War_II) Japanese occupation of Malaya and Singapore. After the war, the air service was not continued. [Malayan Airways](/wiki/Malayan_Airways) was established on 1 May 1947, by the [Ocean Steamship Company](/wiki/Ocean_Steamship_Company) of [Liverpool](/wiki/Liverpool), the [Straits Steamship Company](/wiki/Straits_Steamship_Company_Limited) of Singapore and [Imperial Airways](/wiki/Imperial_Airways). The airline's first flight was a chartered flight from the British Straits Settlement of Singapore to Kuala Lumpur on 2 April 1947 using an [Airspeed Consul](/wiki/Airspeed_Consul) twin-engined aeroplane. Regular weekly scheduled flights quickly followed from Singapore to Kuala Lumpur, Ipoh and Penang from 1 May 1947 with the same aircraft type. The airline continued to expand during the rest of the 1940s and 1950s, as other British Commonwealth airlines (such as [BOAC](/wiki/BOAC) and Qantas Empire Airways) provided technical assistance, as well as assistance in joining IATA. By 1955, Malayan Airways' fleet had grown to include a large number of [Douglas DC-3s](/wiki/Douglas_DC-3), and went public in 1957. Other aircraft operated in the first two decades included the [Douglas C-54 Skymaster](/wiki/Douglas_C-54_Skymaster), the [Vickers Viscount](/wiki/Vickers_Viscount), the [Lockheed 1049 Super Constellation](/wiki/Lockheed_1049_Super_Constellation), the [Bristol Britannia](/wiki/Bristol_Britannia), [de Havilland Comet 4](/wiki/De_Havilland_Comet_4) and the [Fokker F27](/wiki/Fokker_F27). In 1957, the airline became a state-run stock corporation. When Malaya, Singapore, Sabah and Sarawak formed the Federation of Malaysia in 1963, the airline's name was changed, from \"Malayan Airways\" to \"Malaysian Airways\". MAL also took over [Borneo Airways](/wiki/Borneo_Airways). In 1966, following Singapore's separation from the federation, the airline's name was changed again, to Malaysia-Singapore Airlines (MSA). The next year saw a rapid expansion in the airline's fleet and route, including the purchase of MSA's first Boeing aircraft, the [Boeing 707s](/wiki/Boeing_707), as well the completion of a new high-rise headquarters in Singapore. [Boeing 737s](/wiki/Boeing_737) were added to the fleet soon after. MSA ceased operations in 1972, when political disagreements between Singapore and Malaysia resulted in the formation of two entities: [Singapore Airlines](/wiki/Singapore_Airlines) and [Malaysian Airlines System](/wiki/Malaysian_Airlines_System). Singapore Airlines kept all 10 of MSA's Boeing 707s and 737s, retained the international routes out of Singapore as well as the existing corporate headquarters in the city, with J.Y. Pillay, former joint chief of MSA as its first chairperson. Female flight attendants continued to wear the sarong kebaya uniform, which had been first introduced in 1968. A local start-up advertising company, Batey Ads, was given the right to market the airline, eventually selecting the [sarong](/wiki/Sarong) and [kebaya](/wiki/Kebaya)-clad air stewardesses as an icon for the airline and calling them Singapore Girls. ## Market As a result of an almost non-existent domestic market, Singapore has to place immediate emphasis on opening up the international market for its own airlines, as well as to allow foreign airlines to establish operations there. Singapore has [Air Services Agreements](/wiki/Air_Services_Agreement) with over 90 countries and territories, and has the most liberal aviation policy in Southeast Asia It has been an active advocate of [open skies](/wiki/Open_skies), and has concluded over 30 [Open Skies Agreements](/wiki/Open_Skies_Agreement), 18 of which are in the [European Union](/wiki/European_Union), two in the [Association of Southeast Asian Nations](/wiki/Association_of_Southeast_Asian_Nations), five out of six members of the [Cooperation Council for the Arab States of the Gulf](/wiki/Cooperation_Council_for_the_Arab_States_of_the_Gulf), two in the [Union of South American Nations](/wiki/Union_of_South_American_Nations) and four members of the [Pacific Islands Forum](/wiki/Pacific_Islands_Forum). On 9 June 2006, it became the first Asian country to conclude a \"horizontal\" aviation agreement with the [European Union](/wiki/European_Union). On 2 October 2007, Singapore became the second country to be allowed [cabotage](/wiki/Cabotage) rights within the United Kingdom in a fully liberal aviation agreement. Singapore was also the first Asian country to conclude an [Open Skies Agreement](/wiki/Open_Skies_Agreement) with the United States in 1997, and has significant liberal agreements with the United Arab Emirates. Air service rights between Singapore-based carriers are allocated by the Air Traffic Rights Committee, established on 3 October 2003 in reaction to the awarding of multiple Air Operators Certificates in Singapore. The ATRC allocates [air rights](/wiki/Freedoms_of_the_air) with a five-year validity. Unused rights for periods exceeding six months rights awarded but subsequently unable to meet pre-determined performance criteria will be returned to the pool for reallocation. Incumbent Singapore Airlines and its subsidiary airlines were allowed to retain all of their existing rights up to 2013, after which they will also carry a five-year validity and be subjected to the \"use-it-or-lose-it\" principle. ### Open skies agreements CountryConcludedEffective[Rights](/wiki/Freedoms_of_the_air)Source[Albania](/wiki/Albania)19 January 2015[Austria](/wiki/Austria)[Bahrain](/wiki/Bahrain)7 April 20051st to 6th freedoms; 7th freedom for cargo only[Barbados](/wiki/Barbados)17 July 2013[Belgium](/wiki/Belgium)[Belize](/wiki/Belize)11 May 20171st to 6th freedoms; 7th freedom for cargo only[Brunei Darussalam](/wiki/Brunei_Darussalam)1 May 2001 27 December 200421 December 20011st to 6th freedoms; 7th freedom for cargo only [Bulgaria](/wiki/Bulgaria)22 October 20091st to 6th freedoms[Burundi](/wiki/Burundi)16 February 20161st to 6th freedoms; 7th freedom for cargo only[Chile](/wiki/Chile)1 May 20019 April 20021st to 6th freedoms; 7th freedom for cargo only[Cook Islands](/wiki/Cook_Islands)23 July 20061st to 6th freedoms; 7th freedom for cargo only[Costa Rica](/wiki/Costa_Rica)[Czech Republic](/wiki/Czech_Republic)19 January 20091st to 6th freedoms[Denmark](/wiki/Denmark)29 January 20081st to 6th freedoms; 7th freedom for cargo only[Finland](/wiki/Finland)[Germany](/wiki/Germany)[Iceland](/wiki/Iceland)23 January 20091st to 7th freedoms[Ireland](/wiki/Ireland)13 December 20061st to 6th freedoms[Kuwait](/wiki/Kuwait)4 November 20081st to 6th freedoms[Lithuania](/wiki/Lithuania)20 October 20091st to 7th freedoms[Luxembourg](/wiki/Luxembourg)[Malta](/wiki/Malta)8 August 20081 December 20101st to 7th freedoms[New Zealand](/wiki/New_Zealand)1 May 200121 December 20011st to 6th freedoms; 7th freedom for cargo only[Norway](/wiki/Norway)29 January 20081st to 6th freedoms; 7th freedom for cargo only[Oman](/wiki/Oman)20 January 20091st to 6th freedoms[Peru](/wiki/Peru)27 August 20091st to 6th freedoms; 7th freedom for cargo only[Portugal](/wiki/Portugal)27 February 200820101st to 6th freedoms[Qatar](/wiki/Qatar)1988[Romania](/wiki/Romania)27 November 20081st to 6th freedoms[Samoa](/wiki/Samoa)9 November 20021st to 6th freedoms; 7th freedom for cargo only[Slovakia](/wiki/Slovakia)22 November 200722 November 20071st to 6th freedoms[Slovenia](/wiki/Slovenia)[Solomon Islands](/wiki/Solomon_Islands)16 February 20161st to 6th freedoms; 7th freedom for cargo only[Spain](/wiki/Spain)[Sri Lanka](/wiki/Sri_Lanka)1 October 2003 4 August 20051st to 7th freedoms [Sweden](/wiki/Sweden)29 January 20081st to 6th freedoms; 7th freedom for cargo only[Thailand](/wiki/Thailand)27 December 20041st to 6th freedoms[Tonga](/wiki/Tonga)20 January 20041st to 6th freedoms; 7th freedom for cargo only[United Arab Emirates](/wiki/United_Arab_Emirates)26 February 20041st to 9th freedoms[United Kingdom](/wiki/United_Kingdom)2 October 2007March 20081st to 9th freedoms[United States](/wiki/United_States)1 May 200121 December 20011st to 6th freedoms; 7th freedom for cargo only[Uruguay](/wiki/Uruguay)2 October 2013[Zambia](/wiki/Zambia)27 November 20081st to 6th freedoms Singapore has attempted to conclude an open skies agreement with Australia since 1996, but was met with numerous obstacles. There are similar hurdles trying to conclude OSAs with other countries such as Indonesia and the Philippines, mostly due to protectionist stances and a fear that it will not be a balanced agreement. ### Air service agreements CountryLatest conclusionRightsSourceAustralia23 September 2003All destinations (Unlimited passenger/cargo; unlimited via most intermediate points; 5th freedom except to US)Brazil29 June 2010All destinations (Unlimited passenger/cargo via any intermediate points), 5th freedom passenger and cargo to any destinationCanada7 November 2007All destinations (Unlimited passenger/cargo via selected intermediate points)China30 November 2005All destinations (Unlimited passenger/cargo, 5th freedom cargo to selected destinations)Colombia27 August 2009All destinations (8 passenger; 8 cargo; to increase to 14 each by January 2011)Ecuador27 August 2009All destinations (56, 5th freedom passenger; unlimited, 7th freedom cargo)France29 November 2002Paris (7)Greece8 June 2006Japan19 September 2008Tokyo-Haneda (28), Tokyo-Narita (5th freedom to US), all other destinations (Unlimited passenger/cargo; 5th freedom passenger flights to US via Osaka and Nagoya)Kenya18 January 2010All destinations (Unlimited; 5th freedom with some restrictions)Malaysia14 April 2009Alor Setar (28), Bintulu (28), Ipoh (42), Labuan (28), Kerteh (28), Kota Bahru (28), Kota Kinabalu (42), Kuala Lumpur (Unlimited), Kuala Terengganu (28), Kuantan (28), Kuching (42) Langkawi (42), Malacca (28), Miri (28) Penang (70), Sandakan (28), Sibu (28), Tawau (28); unlimited cargo rights to all listed destinationsPhilippines8 May 2009Cebu, Davao, Manila, Manila-Clark (with 5th freedom except to Canada/US)Saudi Arabia22 August 2008Dammam (Unlimited), (14; 5th freedom to selected destinations)Ukraine2 June 2024All destinations (Unlimited) *Figures in brackets refer to maximum frequencies per week.* There was much difficulties in attempts to open up the Singapore-Malaysia sector, until 2008. ## Low-cost travel Partly in response from competition from [AirAsia](/wiki/AirAsia) based in neighbouring Malaysia, Singapore-based low-cost airlines only began to operate from the year 2004 when [Valuair](/wiki/Valuair) launched its maiden flight on 5 May 2004. In rapid succession, two of the largest airlines operating out of [Singapore Changi Airport](/wiki/Singapore_Changi_Airport) began operating their competing carriers, namely [Singapore Airlines](/wiki/Singapore_Airlines)' [Tiger Airways](/wiki/Tiger_Airways) and [Qantas](/wiki/Qantas)' [Jetstar Asia](/wiki/Jetstar_Asia), who began commercial flights on 15 September 2004 and 25 November 2004 respectively. A planned Singapore-affiliated airline by [AirAsia](/wiki/AirAsia) was scuttled when it failed to obtain an air operator's certificate from the Singaporean authorities, possibly in retaliation to the Indonesian ban on all new low-cost flights into the country by non-Indonesian carriers. The physical size of Singapore meant practically all low-cost air routes have to be international in nature, imposing greater risks on the airlines with the greater dependence on aviation negotiations between Singapore and its markets. With relatively limited air rights on offer in the Southeast Asian region, the three airlines had to contend with flying to a select number of destinations where air rights are available, resulting in intense, direct competition on specific routes. The Singapore-Bangkok sector, for example, saw all three Singapore-based carriers, as well as AirAsia flying the route prior to market consolidation. The airlines were able to take advantage of subsequent liberation of air rights between Singapore, Brunei and Thailand in late 2004, although key destinations such as Kuala Lumpur remain closed to all low-cost airlines. With soaring fuel prices, limited markets, and the [impact](/wiki/Countries_affected_by_the_2004_Indian_Ocean_earthquake) from the [2004 Indian Ocean earthquake](/wiki/2004_Indian_Ocean_earthquake), the low-cost aviation industry went into a consolidation phase, with Valuair, the only low-cost airline without a major stakeholder, becoming the first casualty when it was merged with Jetstar Asia Airways on 24 July 2005. The airline was still operated like a separate airline, however, due to regulatory restrictions on its flights to Indonesia, where Jetstar Asia had no access after the Indonesian ban. The fiscal fortunes of the two remaining players began to diverge, however, when it became apparent that Jetstar Asia was struggling, while Tiger Airways was doing relatively well. Keen interest by low-cost carriers to serve the highly protected Singapore-Kuala Lumpur market was one of the primary reasons in bringing forward a partial liberation of the route despite possible business impact particular on Malaysia Airlines. Both countries inked an agreement on 23 November 2007 to allow up to two flights a day for low-cost carriers from each country from 1 February 2008. The route will be fully liberalised on 1 December 2008, with a possibility of opening up other routes between Singapore and secondary Malaysian cities in planned meetings in early 2008. ## Corporate aviation This section **does not cite any sources**. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed. *(July 2025)* *(Learn how and when to remove this message)* [Seletar Airport](/wiki/Seletar_Airport) serves as a hub for corporate aircraft sales and servicing. Although presently limited by runway length for operations of ultra-long range aircraft, Seletar is home to manufacturer approved service centres, such as [Jet Aviation](/wiki/Jet_Aviation) (for [Gulfstream Aerospace](/wiki/Gulfstream_Aerospace), [Bombardier](/wiki/Bombardier_Aerospace) and [Cessna](/wiki/Cessna)) and [Hawker Pacific Aerospace](/wiki/Hawker_Pacific_Aerospace) ([Hawker Beechcraft](/wiki/Hawker_Beechcraft) and [Dassault Falcon](/wiki/Dassault_Falcon)). It is also the home base for several smaller charter aircraft operations serving regional corporate travel and aeromedical evacuations. ## Airport security Security for the country's three international passenger airports comes under the purview of the Airport Police Division of the [Singapore Police Force](/wiki/Singapore_Police_Force), although resources are concentrated at [Singapore Changi Airport](/wiki/Singapore_Changi_Airport) where scheduled passenger traffic dominates. [Seletar Airport](/wiki/Seletar_Airport), which specialises in handling non-scheduled and training flights, is seen as posing less of a security issue. Since the [September 11, 2001 attacks](/wiki/September_11,_2001_attacks), and the naming of Changi Airport as a terrorism target by the [Jemaah Islamiyah](/wiki/Jemaah_Islamiyah), the airport's security has been stepped up. Roving patrol teams composed of two soldiers and a police officer armed with machine guns patrol the terminals at random. Assisting the state organisations, are the security services provided by the ground handlers, namely that of the [Singapore Airport Terminal Services](/wiki/Singapore_Airport_Terminal_Services)'s [SATS Security Services](/wiki/SATS_Security_Services), and the [Aetos Security Management Private Limited](/wiki/Aetos_Security_Management_Private_Limited), formed from a merger of the [Changi International Airport Services](/wiki/Changi_International_Airport_Services)'s airport security unit and that of other companies to become a single island-wide [auxiliary police](/wiki/Auxiliary_police) company. These officers man check-in counters to screen luggage, control movements into restricted areas, and so forth. Since 2005, an upgrade in screening technology and rising security concerns led to all luggage-screening processes to be conducted behind closed-doors. Plans are also in place to install over 400 cameras around the airport to monitor passenger activity around the clock and to check on suspicious parcels and activity to prevent bomb attacks similar to the [2005 Songkhla bombings](/wiki/2005_Songkhla_bombings) in [Southern Thailand](/wiki/Southern_Thailand) where [Hat Yai International Airport](/wiki/Hat_Yai_International_Airport) was targeted. Tenders to incorporate such a system was called in late September 2005. - [Airport Logistics Park](/wiki/Airport_Logistics_Park) - [Asian Aerospace](/wiki/Asian_Aerospace) - [Civil Aviation Authority of Singapore](/wiki/Civil_Aviation_Authority_of_Singapore) - [Seletar Airport](/wiki/Seletar_Airport) - [Singapore Changi Airport](/wiki/Singapore_Changi_Airport) - Singapore Civil Aviation History - First paying passenger on a flight - Air Force Museum - Aerophilately in Singapore - Singapore Air Cargo Directory - Changi nurtures ailing avbusiness - Asian Aerospace and Defense Industry News (Singapore)\n",
  "language": "en",
  "processed_at": "2026-01-12T09:54:27.402712",
  "title": "Aviation in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Aviation_in_Singapore"
}