{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:54:27.750605"
  },
  "content": "Bakery chain in Asia **Awfully Chocolate** is a bakery chain in Asia. It is known for its all-chocolate cake and other desserts. It has 17 locations including shops, cafes and restaurants. ## History Awfully Chocolate was founded by Lyn Lee, who left her job as an attorney to start the business in 1998. Its first store was in [Katong](/wiki/Katong) in [Singapore](/wiki/Singapore). Only one type of cake was sold: a round six-inch chocolate fudge cake called the \"all-chocolate cake\". The store had an unusual [minimalist](/wiki/Minimalism) design in dark brown and white, with the cakes not on display. It received early attention for not looking like a typical cake store and for its similarly minimalist-looking single product. Its second store, at Cluny Court, was opened in 2004. By 2007 there were 17 franchise locations in China, Taiwan and Hong Kong. It later opened a cafe called Ninethirty. ## Products ### Cakes The all-chocolate cake was Awfully Chocolate's first product. It was sold in whole 6-inch cakes. Half a year later, the chocolate banana cake was introduced, followed by the chocolate, rum and cherry cake for Christmas in December 1999. ### Ice Cream In 2005, Hei Ice Cream was released, the company's signature dark chocolate [ice cream](/wiki/Ice_cream). They were served in containers that resemble [American Chinese take-out food boxes](/wiki/Oyster_pail), with the Chinese character \"hei\" that means \"dark\". ### Seasonal products Every Christmas, Awfully Chocolate sells log cakes based on its original all-chocolate cake. - Official website This [Singaporean corporation or company](/wiki/List_of_companies_of_Singapore) article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T09:54:27.750139",
  "title": "Awfully Chocolate",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Awfully_Chocolate"
}