{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:54:31.292670"
  },
  "content": "Singaporean medicated oil **Axe Brand Universal Oil** or more commonly referred to as **Axe Oil** or **Axe Brand Medicated Oil** is a [mentholated](/wiki/Menthol) topical ointment used to relieve common ailments, discomfort, and pains. Originally introduced in 1928, Axe Oil has been manufactured by the [Singaporean](/wiki/Singapore) firm Leung Kai Fook Medical Company or LKF Medical as the primary offering of its Axe Brand line of products. Predominantly used in Asia, it has also expanded to Western and African countries, such as Kuwait and Kenya. In 2015, as part of Singapore's jubilee celebration, the company was one of five heritage brands to be awarded the SG50-Ipos Award by the [Intellectual Property Office of Singapore](/wiki/Intellectual_Property_Office_of_Singapore) (IPOS). ## Usage Axe Oil is a mild, transparent fluid that quickly evaporates upon exposure to air. It is suitable for relief of [headaches](/wiki/Headache), [nasal congestion](/wiki/Nasal_congestion), [colds](/wiki/Common_cold), [stomach-aches](/wiki/Abdominal_pain), insect bites, [dizziness](/wiki/Dizziness), [rheumatic pains](/wiki/Rheumatism) and muscular pain. The instructions provided by LKF Medical recommend the application of a few drops and a gentle massage over the affected area. For nasal congestion, 2-3 drops can be applied to a handkerchief or tissue paper and inhaled. For relief of flatulence and stomach discomfort, the oil can be applied to the navel region and covered with a hot towel. ### Precautions Axe Oil is only for external use and should not be consumed. Care should be taken to avoid the eyes, mucous membranes, or any open wounds. If signs of allergy or irritation are observed, usage should be discontinued and medical advice sought. ### Alternative uses In Africa, the medicated oil is sometimes used as a perfume or a mosquito repellent. It is claimed that Axe Oil can be used to remove ink stains and paint from hands or even fingerprints. Purportedly, the fluid can be employed as a makeshift lubricant (e.g. for door hinges). ## History ### Establishment After moving from China to Singapore, LKF Medical's founder, Leung Yun Chee, met with German physician Dr. Schmeidler, who gave him a formula for a medicated oil containing menthol, camphor, and eucalyptus oil. Leung was impressed by its wide range of applications and he founded the Leung Kai Fook Medical Company. He adopted the axe as the product's logo because customers would recognize it. The outbreak of the [Pacific War](/wiki/Pacific_War) saw many businesses struggle but this was an unexpected opportunity as the [Japanese occupation of Singapore](/wiki/Japanese_occupation_of_Singapore) cut off overseas competitors and permitted Axe Brand to capture significant market share in Malaya. ### Post-war expansion To promote the product, Leung distributed pamphlets with famous stories on one side and Axe Brand advertisements on the other to increase the visibility of its products. Additionally, Leung used other marketing tactics and founded a series of newspapers to feature Axe Brand advertisements. Notably, [*Shin Min Daily News* *(新民日报)*](/wiki/Shin_Min_Daily_News) was founded by Leung in collaboration with Hong Kong novelist [Jin Yong](/wiki/Jin_Yong) on 18 March 1967. In 1970, production was moved from a small cottage factory in South Bridge Road to a seven-story factory in Macpherson with Shin Min Daily News based on the building's top floor. ### Internationalisation The colour of the packaging uses a green and blue livery as symbols for the sky, water and land. The Managing Director of the firm claimed that this symbolises the company's vision for globalisation where consumers could find Axe Oil wherever these three elements exist. In the 1970s, [Saudi Arabia](/wiki/Saudi_Arabia) became the first significant foreign market as it proved popular with [Hajj](/wiki/Hajj) pilgrims who suffered from ailments on their annual journeys to [Mecca](/wiki/Mecca). As the popularity of Axe Brand grew among pilgrims, it spread to other [Middle Eastern](/wiki/Middle_East) nations such as the [UAE](/wiki/United_Arab_Emirates) and [Jordan](/wiki/Jordan). Since then, Axe Oil has seen success in [China](/wiki/China), [Hong Kong](/wiki/Hong_Kong) and [African](/wiki/Africa). A manufacturing facility was established in 1993 at [Shunde, Guangdong](/wiki/Shunde,_Foshan). Meanwhile, a factory in [Johor Bahru](/wiki/Johor_Bahru) was expanded to accommodate additional production lines. Concurrently, the company invested in property and the travel industry in Hong Kong while setting up the US$65 million Hotel Landmark Canton in Guangzhou. In 2002, the Singapore factory was expanded with the acquisition of a large warehouse adjacent to the existing plant; to reduce labour costs arising from high local wages, manufacturing operations were automated with a production line running at over 100 bottles per minute. A few new derivative products such as an Axe Brand Inhaler and Red Flower Oil were added to target ailments such as nasal congestion and rheumatic or muscular pain respectively. Presently, Axe Oil is produced in four [Good Manufacturing Practice (GMP)](/wiki/Good_manufacturing_practice) certified factories in Singapore, Malaysia, China, and Indonesia. The company has around 600 employees worldwide, with approximately 200 in its Singapore HQ and factory complex. ## Incidents ### Counterfeits Following the success of LKF Medical's Hong Kong Branch, there were reports of competitors selling imitation versions of the Axe Brand Red Flower Oil. It was reported that Neo Beng Hock pleaded guilty for the sale of 5,000 dozen bottles of counterfeit Axe Brand Oil products along Leng Kee Road. ### Advertisement misplacement In 2021, national broadsheet paper [*The Straits Times*](/wiki/The_Straits_Times) reported on the [River Valley High School attack](/wiki/River_Valley_High_School_attack) where an axe was used in the murder and below the article is an Axe Brand advertisement placed by LKF Medical. Axe Brand apologised in a Facebook post and explained that the advertisement was 'not intentional' and that it was booked well in advance in December 2020. *The Straits Times* later stated that the juxtaposition was 'inadvertent and unfortunate' and apologised for it. - [Vicks VapoRub](/wiki/Vicks_VapoRub) - [Tiger Balm](/wiki/Tiger_Balm) - [Eu Yan Sang](/wiki/Eu_Yan_Sang) - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T09:54:31.292277",
  "title": "Axe Brand Universal Oil",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Axe_Brand_Universal_Oil"
}