{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:54:32.315659"
  },
  "content": "Singaporean multinational food company **Ayam Brand** (simply known as **Ayam**) is a multinational food company, specialising in prepared foods, including seafood, canned fish ([sardines](/wiki/Sardines_as_food), [mackerel](/wiki/Mackerel_as_food), [tuna](/wiki/Tuna#As_food)) and canned vegetables, especially baked beans. Ayam's product offerings vary by country. The sole owner of Ayam Brand is a company called Ayam S.A.R.L. ## History Alfred Clouet, a [French](/wiki/French_Third_Republic) citizen, founded Ayam Brand in 1892 in Singapore, which at that time was a [part](/wiki/Straits_Settlements) of [British Malaya](/wiki/British_Malaya). The business focused on supplying food for colonial staff. They also produced building materials. At that historic era, the food brand was created to be a seal of quality, as [canned food](/wiki/Canned_food) was then regarded as a luxury, inaccessible to the general public. Clouet used a rooster as the logo of the brand; it was a [symbol of his home country](/wiki/Gallic_rooster). The brand name was generated by local traders and consumers, as they started referring to the canned sardines or salmon as Ayam Brand (*ayam* being the [Malay](/wiki/Malay_language) word for 'chicken' or 'rooster'). In 1954, the company was taken over by the Denis Frères Group of Companies. The name of the founder can still be found in some distribution company names: A.Clouet & Co. (KL) Sdn. Bhd. For Malaysia, Clouet Trading Pte. Ltd. for Singapore or A. Clouet (Australia) Pty. Ltd. for [Australia](/wiki/Australia) – [New Zealand](/wiki/New_Zealand). Active in Malaya in the 19th and first half of the 20th centuries, the brand expanded out of its historical boundaries after the 1950s. Ayam Brand is a brand leader in specific Asian markets such as Malaysia, Singapore, Brunei, Thailand, Indonesia and Hong Kong for mass market products such as sardines, tuna, coconut or baked beans, while it is centred around Asian cuisine in Australia, [New Zealand](/wiki/New_Zealand), [France](/wiki/France), and the [United Kingdom](/wiki/United_Kingdom). - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T09:54:32.315024",
  "title": "Ayam Brand",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Ayam_Brand"
}