{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:54:42.185034"
  },
  "content": "Hotel chain **Azerai** is a [Singapore](/wiki/Singapore)-based multinational hotel chain. The company currently operates three hotels in [Vietnam](/wiki/Vietnam). The company was founded by [Indonesian](/wiki/Indonesians)-[hotelier](/wiki/Hotelier) [Adrian Zecha](/wiki/Adrian_Zecha), and commenced operations in 2017 with the opening of the group's first hotel in [Luang Prabang](/wiki/Luang_Prabang), [Laos](/wiki/Laos). ## History After leaving [Aman Resorts](/wiki/Aman_Resorts) in 2014, Adrian Zecha founded Azerai to operate affordable-luxury lodging, competing in the 3-4 star hotel category. The brand operates small hotels, each typically having no more than 80 rooms, and targets the [millennial](/wiki/Millennials) demographic. The company's background is traced back to the Serai Hotel in [Karangasem](/wiki/Karangasem_Regency), founded by Zecha to offer various frills and design features reminiscent of an Aman Resort albeit competing at a lower, affordable price point. The Serai concept later served as the precursor of Azerai after The Serai was rebranded to create the first [Alila](/wiki/Alila_Hotels_and_Resorts) hotel. The company's name originated from a portmanteau of Zecha's initials and the now-defunct Serai brand, the latter's name of which was derived from the suffix of the [Persian](/wiki/Persian_language) word *[caravanserai](/wiki/Caravanserai)*. In an interview with Hong Kong's *Prestige* magazine, Zecha stated that \"Azerai resorts are designed in an elegant, refined and understated manner, and seek to embrace and blend into the locations in which they are set\". In 2017, the first Azerai opened in Luang Prabang, occupying the premises of the 53-room Phousi Hotel. The hotel closed in 2018 and reopened as an [Avani Hotel](/wiki/Avani_Hotels_%26_Resorts) operated by Thailand-based [Minor International](/wiki/Minor_International). Following its closure in Luang Prabang, the company opened Azerai Can Tho in Vietnam in 2018, which was followed by second hotel in Hue in 2019. In 2019, *[Time](/wiki/Time_(magazine))* magazine named Azerai La Residence in its list of the world's greatest places to stay. ## Properties Azerai operates three hotels in Vietnam, with one hotel planned for Indonesia. **Vietnam** - Azerai Resort, [Cần Thơ](/wiki/C%E1%BA%A7n_Th%C6%A1) - Azerai La Residence, [Huế](/wiki/Hu%E1%BA%BF) - Azerai Ke Ga Bay, [Tân Thành](/wiki/T%C3%A2n_Th%C3%A0nh_B%C3%ACnh) - previously Princess D'Annam Resort **Indonesia** - Azerai Ungasan, [Bali](/wiki/Bali) (planned)\n",
  "language": "en",
  "processed_at": "2026-01-12T09:54:42.184551",
  "title": "Azerai",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Azerai"
}