{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:54:43.768476"
  },
  "content": "Malaysian politician **Mohamed Azmin bin Ali** ([Jawi](/wiki/Jawi_alphabet): محمد عزمين بن علي; born 25 August 1964) is a Malaysian politician who has served as the State [Leader of the Opposition](/wiki/Leader_of_the_Opposition) of Selangor and Member of the [Selangor State Legislative Assembly](/wiki/Selangor_State_Legislative_Assembly) (MLA) for [Hulu Kelang](/wiki/Hulu_Kelang_(state_constituency)) since August 2023. Formerly a member of the [Malaysian Parliament](/wiki/Dewan_Rakyat) for [Gombak](/wiki/Gombak_(federal_constituency)) from 2008 to 2022, Azmin served in the cabinets of [Muhyiddin Yassin](/wiki/Muhyiddin_Yassin) and [Ismail Sabri Yaakob](/wiki/Ismail_Sabri_Yaakob) as [Senior Minister of the Economic Cluster](/wiki/Senior_Minister_of_Malaysia) and [Minister of International Trade and Industry](/wiki/Minister_of_Investment,_Trade_and_Industry_(Malaysia)) from 2020 to 2022. A member of [Malaysian United Indigenous Party](/wiki/Malaysian_United_Indigenous_Party) (BERSATU), which is a component party of [Perikatan Nasional](/wiki/Perikatan_Nasional) (PN) coalition. He also served as MLA for [Bukit Antarabangsa](/wiki/Bukit_Antarabangsa_(state_constituency)) from 2008 to 2023 and for Hulu Kelang from 1999 to 2004. He has also served as the 4th Secretary-General of BERSATU since November 2024. He served as the 2nd Secretary-General of PN from December 2024 to his resignation in January 2026, Information Chief of PN and Member of the Supreme Council of BERSATU. He is also widely regarded as a key figure in the [2020–2022 Malaysian political crisis](/wiki/2020%E2%80%932022_Malaysian_political_crisis), playing an important role in the fall of the PH federal government in February 2020. ## Early years and education This section **does not cite any sources**. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed. *(August 2025)* *(Learn how and when to remove this message)* Mohamed Azmin Ali was born on 25 August 1964 in [Singapore](/wiki/Singapore) (then a state of Malaysia) to Ali Omar and Che Tom Yahaya. His father worked for the [British Army](/wiki/British_Army) as a clerk. Shortly after the separation, his family later moved to [Kuala Lumpur](/wiki/Kuala_Lumpur). He began his education at Gurney Road Primary School, then [Setapak High School](/wiki/Setapak_High_School), and ended it at Jalan Cheras Technical Institute. He studied at the [University of Minnesota](/wiki/University_of_Minnesota) before earning a degree in economics and mathematics, and later continued his master's degree. During his study, he was actively involved in student politics. He received [Bachelor of Science](/wiki/Bachelor_of_Science) (BSc) in [Economics](/wiki/Economics) and [Mathematics](/wiki/Mathematics) from the University of Minnesota. He later completed his [Master of Education](/wiki/Master_of_Education)'s degree (MEd) from the same institute where he met Shamsidar Taharin, his future wife. While studying, Azmin taught modern and additional mathematics. One of his notable students was [Razali Ibrahim](/wiki/Razali_Ibrahim), a former deputy minister, when they were in [MRSM Terendak](/wiki/MRSM_Terendak). He also attended an executive training programme at the [University of Oxford](/wiki/University_of_Oxford). ## Political career ### Early career In 1987, following advice from the Prime Minister [Mahathir Mohamad](/wiki/Mahathir_Mohamad), Azmin started working for [Anwar Ibrahim](/wiki/Anwar_Ibrahim), who was then a Minister in Mahathir's [Barisan Nasional](/wiki/Barisan_Nasional) government. Azmin served as Anwar's personal secretary through Anwar's appointment as Deputy Prime Minister in 1993 and until Mahathir sacked Anwar in 1998. Azmin remained close to Anwar following the dismissal and they both became founders of the opposition Parti Keadilan Nasional (KeADILan), which later became the [People's Justice Party](/wiki/People%27s_Justice_Party_(Malaysia)) or Parti Keadilan Rakyat (PKR). ### State assemblyman and parliamentarian Azmin's political career began after he won the [Hulu Kelang](/wiki/Hulu_Kelang_(state_constituency)) state assembly seat in the [1999 election](/wiki/1999_Malaysian_general_election). Keadilan entered the [1999 general elections](/wiki/1999_Malaysian_general_election) amidst voter anger over Anwar's dismissal and subsequent imprisonment. Azmin was elected [Selangor State Assemblyman](/wiki/Selangor_State_Assembly) for [Hulu Kelang](/wiki/Hulu_Kelang). However, he was barred from participating in the [2004 general elections](/wiki/2004_Malaysian_general_election) due to his conviction for lying in court during the trial against Anwar. He was unable to defend the seat in the [2004 election](/wiki/2004_Malaysian_general_election) after being barred for allegedly lying in court during the trial against Anwar. The [High Court](/wiki/High_Courts_of_Malaysia) and [Court of Appeal](/wiki/Court_of_Appeal_of_Malaysia) have since acquitted him. Azmin returned to national politics in the [2008 general elections](/wiki/2008_Malaysian_general_election), winning the [Gombak](/wiki/Gombak_(federal_constituency)) parliamentary seat and [Bukit Antarabangsa](/wiki/Bukit_Antarabangsa_(state_constituency)) state seat in Selangor. Meanwhile, in 2010, he won an internal PKR election for the party's deputy presidency. He replaced Syed Husin, who did not seek re-election. He was reelected as the party's deputy president in 2018 after a close election against [Rafizi Ramli](/wiki/Rafizi_Ramli). In the [2013 general elections](/wiki/2013_Malaysian_general_election) and [2018 general elections](/wiki/2018_Malaysian_general_election) he managed to clinch both seats again. He lost the Gombak seat in the [2022 election](/wiki/2022_Malaysian_general_election). He did not contest the Bukit Antarabangsa state seat in the [2023 Selangor state election](/wiki/2023_Selangor_state_election) and instead contest the Hulu Kelang state seat, which he won. ### Menteri Besar of Selangor Azmin became the [Menteri Besar of Selangor](/wiki/Menteri_Besar_of_Selangor) on 23 September 2014, following the resignation of the PKR incumbent [Khalid Ibrahim](/wiki/Abdul_Khalid_Ibrahim). His ascension to the post followed months of internal political wrangling within the [Pakatan Rakyat](/wiki/Pakatan_Rakyat) coalition that led the state. Khalid had been the Menteri Besar since the coalition of PKR, the [Democratic Action Party](/wiki/Democratic_Action_Party_(Malaysia)) (DAP) and the [Pan-Malaysian Islamic Party](/wiki/Pan-Malaysian_Islamic_Party) (PAS) won a majority in the Selangor State Assembly in the 2008 election. In early 2014, PKR's national leader, Anwar Ibrahim, then a federal parliamentarian sought to contest the Selangor State Assembly seat of [Kajang](/wiki/Kajang) in a [by-election](/wiki/2014_Kajang_by-election). The so-called \"[Kajang Move](/wiki/Kajang_Move)\" would have allowed Anwar to oust Khalid as Menteri Besar with PKR's support. However, after Anwar's conviction for sodomy weeks before the by-election, his wife [Wan Azizah Wan Ismail](/wiki/Wan_Azizah_Wan_Ismail) assumed PKR's nomination for the by-election in his place and won the seat. Khalid resigned as Menteri Besar after PKR withdrew its support for his leadership later in the year. PKR, with the DAP's support, nominated Wan Azizah to replace him, but both the [Sultan of Selangor](/wiki/Sultan_of_Selangor) (who appoints the Menteri Besar) and the third coalition party, PAS, sought other options. The Sultan requested that each coalition party submit three names for his consideration. PKR and the DAP submitted only Wan Azizah's name, while PAS submitted others. On 22 September, the Sultan announced the appointment of Azmin. He was sworn into office the following morning. Azmin was the sole recipient of the [Order of the Crown of Selangor](/wiki/Order_of_the_Crown_of_Selangor) in Knight Grand Commander class (S.P.M.S) in 2015, which carries the title 'Dato' Seri' in conjunction with the 70th birthday of the Sultan of Selangor [Sultan Sharafuddin Idris Shah](/wiki/Sharafuddin_of_Selangor) on 11 December 2015. Azmin was once again reelected as the Menteri Besar of Selangor in the aftermath of [2018 Malaysian general election](/wiki/2018_Malaysian_general_election) after defending his [Bukit Antarabangsa](/wiki/Bukit_Antarabangsa_(state_constituency)) state seat. He was sworn into title on the evening of 11 May 2018 at [Istana Alam Shah](/wiki/Istana_Alam_Shah). ### Minister of Economic Affairs Following the aftermath of the [2018 General Election](/wiki/2018_Malaysian_general_election), Azmin was named as one of the ministers in the newly elected [Prime Minister](/wiki/Prime_Minister_of_Malaysia) [Mahathir Mohamad](/wiki/Mahathir_Mohamad)'s [cabinet](/wiki/Seventh_Mahathir_cabinet) on 18 May 2018. He is to head the newly established [Ministry of Economic Affairs](/wiki/Ministry_of_Economic_Affairs_(Malaysia)). He was sworn in as the Minister of Economic Affairs on 21 May 2018 at [Istana Negara](/wiki/Istana_Negara,_Jalan_Duta). His term ended on 24 February 2020 after the dissolution of cabinet following the resignation of Mahathir Mohamad as Malaysia's Prime Minister per article 43(5) of the [Constitution of Malaysia](/wiki/Constitution_of_Malaysia), that allowed the [Yang di-Pertuan Agong](/wiki/Yang_di-Pertuan_Agong) to revoke the appointment of ministers. ### Change of allegiance On the morning of 23 February 2020, Azmin held a meeting with several [lawmakers](/wiki/Lawmaker) from [Parti Keadilan Rakyat](/wiki/Parti_Keadilan_Rakyat) (PKR) and twenty others at Sheraton Hotel, [Petaling](/wiki/Petaling), amidst the rumour of a formation of a new [coalition](/wiki/Coalition_government) at the [parliament of Malaysia](/wiki/Parliament_of_Malaysia). He and his faction in PKR, went to the [Istana Negara](/wiki/Istana_Negara,_Jalan_Tuanku_Abdul_Halim) on the evening to seek a meeting with the [Yang di-Pertuan Agong](/wiki/Yang_di-Pertuan_Agong), [Abdullah of Pahang](/wiki/Abdullah_of_Pahang). Leaders from other five political parties; [Bersatu](/wiki/Parti_Pribumi_Bersatu_Malaysia)'s [Muhyiddin Yassin](/wiki/Muhyiddin_Yassin), [UMNO](/wiki/United_Malays_National_Organisation)'s [Ahmad Zahid Hamidi](/wiki/Ahmad_Zahid_Hamidi), [GPS](/wiki/Gabungan_Parti_Sarawak)'s [Abang Johari Openg](/wiki/Abang_Johari_Openg), [Warisan](/wiki/Parti_Warisan_Sabah)'s [Shafie Apdal](/wiki/Shafie_Apdal) and [PAS](/wiki/Parti_Islam_Se-Malaysia)'s [Hadi Awang](/wiki/Hadi_Awang) were also in attendance. It was speculated that the leaders were there to brief the Agong about the recent political development; formation of a new coalition government and to declare their support for a new prime minister, effectively blocking PKR's president [Anwar Ibrahim](/wiki/Anwar_Ibrahim) from the position. After the meeting, several opposition party leaders, including UMNO's [Ismail Sabri Yaakob](/wiki/Ismail_Sabri_Yaakob) and PAS' Hadi Awang then joined Azmin's supporters at Sheraton Hotel. On the next day, 24 February, PKR's general secretary, [Saifuddin Nasution Ismail](/wiki/Saifuddin_Nasution_Ismail) announced in a press conference at the party's headquarters that Azmin and [Minister of Housing and Local Government](/wiki/Minister_of_Housing_and_Local_Government_(Malaysia)), [Zuraida Kamaruddin](/wiki/Zuraida_Kamaruddin) who is also the vice president of PKR had been sacked from the party. Saifuddin explained that they were expelled due to their actions on 23 October which was against the party's principle regarding the position of prime minister. Azmin later announced that he will be forming an independent bloc at the parliament along with Zuraida and other nine MPs who had decided to exit the party following his expulsion. However, on 28 February 2020, a representative from Bersatu confirmed that Azmin and his faction had joined the party. Azmin said, 'immoral sexual practices' by [Anwar](/wiki/Anwar_Ibrahim) caused him to lose faith in the PKR president. Azmin said he doubted the full pardon status granted by the [Yang di-Pertuan Agong](/wiki/Yang_di-Pertuan_Agong) against Anwar. He added that he was still committed to fighting and eliminating corruption even though he had joined Bersatu. He also denied that he was responsible for the [Pakatan Harapan](/wiki/Pakatan_Harapan) (PH) government's fall in February last year.[*citation needed*] He was named as one of the four senior ministers alongside [Ismail Sabri Yaakob](/wiki/Ismail_Sabri_Yaakob), [Fadillah Yusof](/wiki/Fadillah_Yusof) and [Mohd Radzi Md Jidin](/wiki/Mohd_Radzi_Md_Jidin) in [Muhyiddin cabinet](/wiki/Muhyiddin_cabinet) on 9 March 2020. The positions were established by [Muhyiddin Yassin](/wiki/Muhyiddin_Yassin), the eighth prime minister as a substitute for the [deputy prime minister](/wiki/Deputy_Prime_Minister_of_Malaysia) position. Although the four ministers were of equal standings, Azmin was designated by the prime minister to preside over the cabinet's meeting in his absence. ## Controversies and issues ### Victim of hacking In late 2011, Israeli private detective Tamir Mori ordered the mercenary Indian hack-for-hire firm [Appin](/wiki/Appin_(company)) to hack more than 40 targets, including Azmin. ### Alleged leaked sex tape On 12 June 2019, it was reported that Azmin was filmed in Sandakan, Sabah being intimate with another man, his own political aide Haziq Abdul Aziz, in a video circulating on social media. Azmin denied his involvement. Muhammad Haziq Abdul Aziz later confirmed his involvement in the act with the minister and urged authorities to investigate him. Until 16 July 2019, nine people had been arrested by [Royal Malaysia Police](/wiki/Royal_Malaysia_Police) in the investigation regarding their involvement in making and distribution of the lewd video, including Haziq who had admitted he was the person in the video, and [Farhash Wafa Salvador Rizal Mubarak](/wiki/Farhash_Wafa_Salvador_Rizal_Mubarak) who is PKR Perak state chairman and is also [Anwar Ibrahim](/wiki/Anwar_Ibrahim)'s political secretary. On 18 July 2019, the [Inspector General of Police](/wiki/Inspector_General_of_Police), [Abdul Hamid Bador](/wiki/Abdul_Hamid_Bador) stated that although the video was authentic, the individual in the video is unidentifiable. He also stated that the group of individuals who made the video were paid thousand of Ringgits, and the video circulation was masterminded by a leader of a political party, with the intention to degrade and defame someone's reputation. ### Land grab in Selangor While serving as a Selangor State Assembly back-bencher, Azmin highlighted cases of corruption linked to land and forest matters. During his own tenure as Selangor Menteri Besar, Azmin made several land-use decisions that have also been called into question. In particular, Azmin approved the issuance of quarry licences to his political aids. These licences were inside the Bukit Lagong forest reserve, next to the [Forest Research Institute Malaysia](/wiki/Forest_Research_Institute_Malaysia). ### Instigation of Sheraton Move Following the political infighting within Pakatan Harapan and Perikatan Nasional Government, [Bersatu](/wiki/Bersatu) President [Muhyiddin Yassin](/wiki/Muhyiddin_Yassin) together with [PAS](/wiki/Malaysian_Islamic_Party) President [Abdul Hadi Awang](/wiki/Abdul_Hadi_Awang) and [PKR](/wiki/People%27s_Justice_Party_(Malaysia))'s defected members led by Azmin Ali formed the [Perikatan Nasional](/wiki/Perikatan_Nasional) and worked alongside [UMNO](/wiki/UMNO) leader [Ismail Sabri Yaakob](/wiki/Ismail_Sabri_Yaakob) to fill the [power vacuum](/wiki/Power_vacuum) after the resignation of then-Prime Minister [Mahathir Mohamad](/wiki/Mahathir_Mohamad). The alliance produced a simple majority in the Malaysian Government, resulting in political instability that led to the Malaysian political crisis. ### Voters file suit against Azmin Ten registered voters in the [Gombak parliamentary constituency](/wiki/Gombak_(federal_constituency)) have filed a suit against their parliament member, Mohamed Azmin Ali. The [plaintiffs](/wiki/Plaintiff) claim that Mohamed Azmin's representations were false and that he only wanted their votes. The ten also claimed that they had relied on those representations to vote for the defendant's [2018 General Election](/wiki/2018_Malaysian_general_election). They seek damages, including aggravated or exemplary damages, interests, costs and other orders deemed fit by the court. \"By breaching these representations, the defendant had violated constitutional rights, especially the principles of parliamentary democracy and representative democracy,\" they said in a statement of claim. The plaintiffs are applying for a declaration that the defendant has breached his [fiduciary](/wiki/Fiduciary) duties and the duties owed and deceived them. ## Personal life Azmin is married to Shamshida Tahrin, a finance graduate also from the University of Minnesota. The couple have three sons and three daughters. He lives in Ampang. In addition to an elder brother, Azman Ali, among his younger brothers are television host and celebrity [Azwan Ali](/wiki/Azwan_Ali_(actor)), and motivator Arpah Ali, while his younger sister is [Ummi Hafilda Ali](/wiki/Ummi_Hafilda_Ali), a prosecution witness in the [sodomy trial](/wiki/Anwar_Ibrahim_sodomy_trials) of jailed former deputy prime minister Anwar Ibrahim. ## Election results [Selangor State Legislative Assembly](/wiki/Selangor_State_Legislative_Assembly) YearConstituencyCandidateVotesPctOpponent(s)VotesPctBallots castMajorityTurnout1999**N18 [Hulu Kelang](/wiki/Hulu_Kelang_(state_constituency))****Mohamed Azmin Ali** ([**KeADILan**](/wiki/Parti_Keadilan_Nasional))**9,185****53.32%**[Fuad Hassan](/wiki/Fuad_Hassan_(Malaysian_politician)) ([UMNO](/wiki/United_Malays_National_Organisation))8,03946.67%17,3951,14676.65%(/wiki/2008_Selangor_state_election)**N19 [Bukit Antarabangsa](/wiki/Bukit_Antarabangsa_(state_constituency))****Mohamed Azmin Ali** ([**PKR**](/wiki/Parti_Keadilan_Rakyat))**11,731****52.91%**Haslinda Mohd Zerain ([UMNO](/wiki/United_Malays_National_Organisation))10,35046.68%22,3971,38172.99%(/wiki/2013_Selangor_state_election)**Mohamed Azmin Ali** ([**PKR**](/wiki/Parti_Keadilan_Rakyat))**16,502****56.81%**Mohamad Nadzim Ibrahim ([UMNO](/wiki/United_Malays_National_Organisation))12,45842.89%29,3524,04485.16%(/wiki/2018_Selangor_state_election)**Mohamed Azmin Ali** ([**PKR**](/wiki/People%27s_Justice_Party_(Malaysia)))**30,892****79.64%**Salwa Yunus ([UMNO](/wiki/United_Malays_National_Organisation))5,38013.87%39,05725,51284.44%Syarifah Haslizah Syed Ariffin ([PAS](/wiki/Pan-Malaysian_Islamic_Party))2,3115.96%Ahmad Kamarudin ([PRM](/wiki/Parti_Rakyat_Malaysia))1160.30%[Mohamed Azwan Ali](/wiki/Azwan_Ali_(actor)) ([IND](/wiki/Independent_politician))900.23%(/wiki/2023_Selangor_state_election)**N18 [Hulu Kelang](/wiki/Hulu_Kelang_(state_constituency))****Mohamed Azmin Ali** ([**BERSATU**](/wiki/Malaysian_United_Indigenous_Party))**25,597****51.63%**[Juwairiya Zulkifli](/wiki/Juwairiya_Zulkifli) ([PKR](/wiki/Parti_Keadilan_Rakyat))23,98048.37%49,8441,61769.52%[Parliament of Malaysia](/wiki/Dewan_Rakyat) YearConstituencyCandidateVotesPctOpponent(s)VotesPctBallots castMajorityTurnout(/wiki/2008_Malaysian_general_election)**P098 [Gombak](/wiki/Gombak_(federal_constituency))****Mohamed Azmin Ali** ([**PKR**](/wiki/Parti_Keadilan_Rakyat))**40,334****53.92%**Said Anuar Said Ahmad ([UMNO](/wiki/United_Malays_National_Organisation))33,46744.74%75,6196,86776.26%(/wiki/2013_Malaysian_general_election)**Mohamed Azmin Ali** ([**PKR**](/wiki/Parti_Keadilan_Rakyat))**54,827****51.82%**[Rahman Ismail](/wiki/Rahman_Ismail) ([UMNO](/wiki/United_Malays_National_Organisation))50,09347.34%107,1624,73486.92%Said Nazar Abu Baker ([IND](/wiki/Independent_(politician)))4740.45%(/wiki/2018_Malaysian_general_election)**Mohamed Azmin Ali** ([**PKR**](/wiki/People%27s_Justice_Party_(Malaysia)))**75,113****63.10%**Abdul Rahim Pandak Kamaruddin ([UMNO](/wiki/United_Malays_National_Organisation))26,39222.17%119,97548,72185.43%Khairil Nizam Khirudin ([PAS](/wiki/Pan-Malaysian_Islamic_Party))17,53714.73%(/wiki/2022_Malaysian_general_election)Mohamed Azmin Ali ([BERSATU](/wiki/Malaysian_United_Indigenous_Party))59,53835.99%**[Amirudin Shari](/wiki/Amirudin_Shari)** ([**PKR**](/wiki/People%27s_Justice_Party_(Malaysia)))**72,267****43.69%**165,42612,72980.01%[Megat Zulkarnain Omardin](/wiki/Megat_Zulkarnain_Omardin) ([UMNO](/wiki/United_Malays_National_Organisation))30,72318.57%Aziz Jamaludin Mohd Tahir ([PUTRA](/wiki/Parti_Bumiputera_Perkasa_Malaysia))2,2231.34%Zulkifli Ahmad ([IND](/wiki/Independent_politician))6750.41% ## Honours ### Honours of Malaysia - [Selangor](/wiki/Selangor) - Knight Grand Commander of the [Order of the Crown of Selangor](/wiki/Order_of_the_Crown_of_Selangor) (SPMS) – **Dato' Seri** (2015) - Companion of the [Order of the Crown of Selangor](/wiki/Order_of_the_Crown_of_Selangor) (SMS) (1992) - [Kedah](/wiki/Kedah) - Knight Grand Companion of the [Order of Loyalty to the Royal House of Kedah](/wiki/Order_of_Loyalty_to_the_Royal_House_of_Kedah) (SSDK) – **Dato' Seri** (2022) - Personal biography - Official blog Assembly seatsPreceded by[Fuad Hassan](/wiki/Fuad_Hassan) **Member of the [Selangor State Legislative Assembly](/wiki/Selangor_State_Legislative_Assembly) for [Hulu Kelang](/wiki/Hulu_Kelang_(state_constituency))** 1999–2004Succeeded byAhmad BujangPreceded byAzman Wahid **Member of the [Selangor State Legislative Assembly](/wiki/Selangor_State_Legislative_Assembly) for [Bukit Antarabangsa](/wiki/Bukit_Antarabangsa_(state_constituency))** 2008–2023Succeeded by[Mohd Kamri Kamaruddin](/wiki/Mohd_Kamri_Kamaruddin)Preceded by[Saari Sungib](/wiki/Saari_Sungib) **Member of the [Selangor State Legislative Assembly](/wiki/Selangor_State_Legislative_Assembly) for [Hulu Kelang](/wiki/Hulu_Kelang_(state_constituency))** 2023–present**Incumbent**[Parliament of Malaysia](/wiki/Parliament_of_Malaysia)Preceded by[Rahman Ismail](/wiki/Rahman_Ismail) **Member of the [Dewan Rakyat](/wiki/Dewan_Rakyat) for [Gombak](/wiki/Gombak_(federal_constituency))** 2008–2022Succeeded by[Amirudin Shari](/wiki/Amirudin_Shari)Party political offices**New office** **Vice President of the [People's Justice Party](/wiki/People%27s_Justice_Party_(Malaysia))** 2001–2010Succeeded by[Nurul Izzah Anwar](/wiki/Nurul_Izzah_Anwar), [Tian Chua](/wiki/Tian_Chua), [Fuziah Salleh](/wiki/Fuziah_Salleh), [Mansor Othman](/wiki/Mansor_Othman)Preceded by[Syed Husin Ali](/wiki/Syed_Husin_Ali) **Deputy President of the [People's Justice Party](/wiki/People%27s_Justice_Party_(Malaysia))** 2010–2020Succeeded by[Rafizi Ramli](/wiki/Rafizi_Ramli)**New office** **Information Chief of [Perikatan Nasional](/wiki/Perikatan_Nasional)** 2020–present**Incumbent** **Chairman of the International Bureau of the [Malaysian United Indigenous Party](/wiki/Malaysian_United_Indigenous_Party)** 2020–presentPolitical officesPreceded by[Khalid Ibrahim](/wiki/Khalid_Ibrahim) **[Menteri Besar of Selangor](/wiki/Menteri_Besar_of_Selangor)** 2014–2018Succeeded by[Amirudin Shari](/wiki/Amirudin_Shari)**New ministerial post** **[Minister of Economic Affairs](/wiki/Minister_of_Economic_Affairs_(Malaysia))** 2018–2020**Vacant**Title next held by**[Rafizi Ramli](/wiki/Rafizi_Ramli)** ***as [Minister of Economy](/wiki/Minister_of_Economy_(Malaysia))*** **[Senior Minister for the Economic Cluster](/wiki/Senior_Minister_of_Malaysia)** 2020–2022**Position abolished** Preceded by[Darell Leiking](/wiki/Darell_Leiking) **[Minister of International Trade and Industry](/wiki/Minister_of_International_Trade_and_Industry_(Malaysia))** 2020–2022Succeeded by[Tengku Zafrul Aziz](/wiki/Tengku_Zafrul_Aziz)Preceded by[Rizam Ismail](/wiki/Rizam_Ismail) **[Leader of the Opposition](/wiki/Leader_of_the_Opposition) of [Selangor](/wiki/Selangor_State_Legislative_Assembly)** 2023–present**Incumbent**Portals: - Malaysia - Biography - Politics\n",
  "language": "en",
  "processed_at": "2026-01-12T09:54:43.768072",
  "title": "Azmin Ali",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Azmin_Ali"
}