{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:54:46.465598"
  },
  "content": "* *B1G1** is the [registered trademark](/wiki/Registered_trademark) and [brand](/wiki/Brand) of BUY1GIVE1 PTE LTD, a Singapore-based registered business organization, [social enterprise](/wiki/Social_enterprise) and [non-profit organization](/wiki/Nonprofit_organization). It was registered as a Private Limited Liability company in 2007. B1G1 operates on a subscription basis with a transaction-based charity giving model designed for [small and medium enterprises](/wiki/Small_and_medium_enterprises) (SMEs) around the world. It presents itself as an effective way to contribute to charitable organizations. Through B1G1, business members can donate money to B1G1's vetted charity partners, called \"B1G1 Worthy Causes\". ## History While participating in a business program run by Paul Dunn, Masami Sato and some other entrepreneurs came up with the initial idea based on the concept of 'Buy One Give One' that led to the founding of B1G1. The co-founders of B1G1 established the headquarters of Buy1GIVE1 PTE LTD in [Singapore](/wiki/Singapore) in 2007. Sato was a founder while Dunn took on the role of Chairman. ## Structure B1G1 is a [social enterprise](/wiki/Social_enterprise), composed of a [for-profit corporation](/wiki/For-profit_corporation), Buy1GIVE1 LTD, and a registered Society, B1G1 Giving. This structure provides *a specific transaction-based giving model* to [SMEs](/wiki/Small_and_medium_enterprises) around the world. ## Philosophy The B1G1 philosophy is based on creating a world where every business transaction simultaneously results in an impact made in the world (through a small donation), hence 'Buy One Give One'. In contrast with the [Corporate Social Responsibility](/wiki/Corporate_Social_Responsibility) (CSR) adopted by large companies, the B1G1 approach concentrates on building habitual giving while establishing a deeper sense of meaning in everyday business activities. ## Membership model B1G1's members generally consist of [small and medium-sized enterprises (SMEs)](/wiki/Small_and_Medium_Enterprises) worldwide. Companies have the option of a monthly or yearly subscription, which provides them with a suite of impact-tracking widgets and access to a vetted network of charity projects to support. B1G1 depends on this model for financial viability, and 100% of contributions made by B1G1 members are directly passed on to charity partners chosen by the members. Many members are currently from Australia, United Kingdom, and New Zealand, including companies such as [Minimonos](/wiki/Minimonos), Logistics Bureau, [Xero](/wiki/Xero_(software)), Headway Recruitment and [Thavibu Gallery](/wiki/Thavibu_Gallery). ## Charity Partners (B1G1 Worthy Causes) B1G1 Worthy Causes are the [NGOs](/wiki/NGO) that provide specific charity projects for B1G1 members to support. In October 2020, B1G1's website listed more than 500 projects from around the world. Each project is also tagged with the relevant [UN Sustainable Development Goals](/wiki/UN_Sustainable_Development_Goals) (SDGs).[*citation needed*] In order to qualify as a B1G1 Worthy Cause, each NGO has to meet two-tiered criteria set by the B1G1 GIVING Board and go through a five-step process before being approved. Some charity partners include World Youth International, Child's Dream, and the John Fawcett Foundation.[*citation needed*] ## Media coverage B1G1 was featured in *[Forbes](/wiki/Forbes) Russia online* in December 2010, Springwise in March 2012 and August 2010, and *[Mashable](/wiki/Mashable)* in November 2010. *Voice of America* wrote in its November 2011 article about the buy-one, give-one model of giving and used B1G1 as a strong example of the new trend of transaction-based giving. Two of the co-founders Masami Sato and Paul Dunn have been invited to speak at numerous engagements, including *TEDxSingapore* and *TEDxChCh*, independently organized *[TED](/wiki/TED_Talk)* events. Sato also gave speeches titled \"A Habit Worth Sharing\" (2010) and \"Imagine a More Giving World and Life\"(2012) Paul Dunn's speeches in 2010, titled \"Wow and Woow\"(*TEDxChCh*) and \"[i]nspire\"(*TEDxSingapore*). Masami Sato was described in an article, \"One of Earth Angels who is changing the world\" by *Insight Magazine Australia*, October 2011 edition. - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T09:54:46.465136",
  "title": "B1G1",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/B1G1"
}