{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:54:50.834712"
  },
  "content": "Musical artist **Baby K** (born **Claudia Judith Nahum**; 5 February 1983) is an Italian singer-songwriter and rapper. She is mainly known for her hits \"[Killer](/wiki/Killer_(Baby_K_and_Tiziano_Ferro_song))\", recorded with [Tiziano Ferro](/wiki/Tiziano_Ferro), and \"[Roma-Bangkok](/wiki/Roma-Bangkok)\", a duet with [Giusy Ferreri](/wiki/Giusy_Ferreri), which was the best-selling single of 2015 in Italy and the first video of hers to receive the [Vevo](/wiki/Vevo_Certified) certificate. Since 2008, she published three EPs and three studio albums which entered in the top ten [Italian Albums Chart](/wiki/Italian_Albums_Chart). She had six top ten [Singles Chart](/wiki/Italian_singles_chart)'s songs, including the topper \"[Roma-Bangkok](/wiki/Roma-Bangkok)\" with [Giusy Ferreri](/wiki/Giusy_Ferreri), and two number two songs \"[Voglio ballare con te](/wiki/Voglio_ballare_con_te)\" and \"Da zero a cento\". Baby K has sold over 1,1 million copies in Italy, including a diamond certification, and received a [MTV Italian Music Awards](/wiki/MTV_Italian_Music_Awards), three [Wind Music Awards](/wiki/Wind_Music_Awards) and the Lunezia Prize for *Musical-Literary Value* for her songwriting process. As of 2022, Baby K has 7 entries in the top 10 best selling singles in Italy, over 20 Platinum certifications and three music videos that surpassed 100 million views each. The following year she was named amongst Keymaker Records, [Federica Carter](/wiki/Federica_Carta_(singer)), [Darkoo](/wiki/Darkoo) and [Marco Mengoni](/wiki/Marco_Mengoni) as [Pandora's](/wiki/Pandora_(service)) Italy most streamed artistes. ## Early life Born to Italian parents in Singapore, having spent her first years of her life in [Jakarta](/wiki/Jakarta), and raised in London, in the suburb of Pinner she now resides in Milan, Italy. She attended the *Harrow School of Young Musicians*, where she was able to take part in a musical tour in Europe. In 2000, she returned to Italy after an absence of ten years, working on hip hop radio programs. ## Career Her first act as an artist in the rap scene came in 2008, when with the Quadrato Basement, she recorded her first album, SOS, an EP with 5 tracks. About two years later she released the single \"Femmina alfa\" (Female Alpha), which had over 10,000 downloads during the first few months. In 2013, she released her first official solo album *[Una seria](/wiki/Una_seria)*, produced by Sony Music, which achieved remarkable success, reaching the top spot on the rankings of iTunes and the tenth position in the ranking officer FIMI. On 13 May, Baby K was the opening act of the only Italian stop of the [Azealia Banks](/wiki/Azealia_Banks) tour. Baby K was also nominated in the category of Best New Artist at the Pepsi [MTV Awards](/wiki/MTV_Awards) in 2013, winning the prize. In September 2013, she released a new single \"[Killer](/wiki/Killer_(Baby_K_and_Tiziano_Ferro_song))\", with [Tiziano Ferro](/wiki/Tiziano_Ferro) which became her first top10 single on the Italian Singles Chart. Then releases the single \"Sei sola\" always with Tiziano Ferro and \"Una seria\" with [Fabri Fibra](/wiki/Fabri_Fibra). In 2015, her single \"[Roma-Bangkok](/wiki/Roma-Bangkok)\", which features [Giusy Ferreri](/wiki/Giusy_Ferreri), peaked at number one on the Italian music charts for weeks, receiving the diamond certification with 500.000 sales. The song reached international charts including [Finland](/wiki/Finland), France and [Switzerland](/wiki/Switzerland). On 11 September 2015 the second studio album *[Kiss Kiss Bang Bang](/wiki/Kiss_Kiss_Bang_Bang_(Baby_K_album))* is released, debuting at position number 4 of Italian albums Chart. On 23 October 2015 the third single Chiudo gli occhi e salto, in collaboration with [Federica Abbate](/wiki/Federica_Abbate), went into radio rotation. In 2017 the single \"[Voglio ballare con te](/wiki/Voglio_ballare_con_te)\" was released, sung together with Andrés Dvicio, whose video reached 100 million views on YouTube, becoming Baby K's second Vevo Certified and sold over 250.000 copies. In 2018 he published the hit \"Da zero a cento\" which debuted in second place on the FIMI chart and sold over 150,000 copies and the single \"Come no\". On 18 November 2018, he released the album *[Icona](/wiki/Icona_(album))*, which includes previous hits and debuts at number six on the FIMI chart. On 31 May 2019 the singer released the unreleased single \"Playa\", not on the album, which became her fifth top10 single on Italian Chart and sold over 100.000 copies. She received two [Wind Music Awards](/wiki/Wind_Music_Awards) for her multi platinum hits. On 6 March 2020, Baby K single \"Buenos Aires\" was released as the lead single for her upcoming studio album. In July 2020 the rapper released the song \"Non mi basta più\" with the Italian [influencer](/wiki/Influencer) [Chiara Ferragni](/wiki/Chiara_Ferragni). ## Discography **Album** - *[Una seria](/wiki/Una_seria)* (2013) - *[Kiss Kiss Bang Bang](/wiki/Kiss_Kiss_Bang_Bang_(Baby_K_album))* (2015) - *[Icona](/wiki/Icona_(album))* (2018) - *Donna sulla Luna* (2021) ## Filmography YearTitleRoleNotes2016*Zeta: Una storia hip-hop*HerselfCameo appearance2016*[Finding Dory](/wiki/Finding_Dory)*Additional voicesItalian dub2019*[Red Shoes and the Seven Dwarfs](/wiki/Red_Shoes_and_the_Seven_Dwarfs)*Snow White/Red Shoes (voice)Italian dub ## Tours **Headlining** - Killer Party (2013) - Una Seria Tour (2013) **Opening** - [Nicki Minaj](/wiki/Nicki_Minaj) – [Pink Friday Tour](/wiki/Pink_Friday_Tour) (2012) **Guest** - [Lali](/wiki/Lali_Esp%C3%B3sito) – [Soy Tour](/wiki/Soy_Tour) (2017) - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T09:54:50.834265",
  "title": "Baby K (artist)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Baby_K_(artist)"
}