{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:54:51.529667"
  },
  "content": "Singaporean actor (1920–2019) **Bai Yan** (born **Yan Boyuan**; 5 May 1920 – 19 August 2019) was a [Singaporean](/wiki/Singaporean) actor. He was a multi-disciplined performer, ranging from theatre to dance and a magician. Affectionately known as \"Uncle Bai Yan\", he is a household name in the Singapore television dramas scene. ## Career Bai started his acting career in the 1930s when he joined the Yin Yue Music And Dance Troupe. In the 1940s before World War II, he came to Singapore with the troupe. In 1985, [Singapore Broadcasting Corporation](/wiki/Singapore_Broadcasting_Corporation) invited Bai to join the company and he acted in his first television serial *Blossoms In The Sun*. In 1996, Bai was awarded the [Special Achievement Award](/wiki/Star_Awards_for_Special_Achievement_Award) at the [3rd Star Awards Ceremony](/wiki/Star_Awards_1996) and then retired from acting. After retirement, Bai was still active in performance at old folk's homes with magic, songs and dance. ## Personal life and death Bai met his wife Ye Qing in a song and dance troupe in Singapore where they perform together. During World War II, Bai fled Singapore to Penang, Malaysia with the troupe and was engaged with Ye while in Penang. They married in 1944 and had three children. Ye died in 2016 at the age of 94. His love story with Ye was featured in a 2018 [Channel NewsAsia](/wiki/Channel_NewsAsia) documentary, *Love in A Time of Change: Love Is A Stage: Bai Yan & Ye Qing*. In August 2019, Bai was hospitalised for [pneumonia](/wiki/Pneumonia) and died 10 days later on 19 August, aged 99. He celebrated his 100th lunar birthday 3 months prior to this. ## Awards YearCeremonyAwardNominated workResult1996[Star Awards](/wiki/Star_Awards_1996)[Special Achievement Award](/wiki/Star_Awards_for_Special_Achievement_Award)—N/aWon This article about a Singaporean actor is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T09:54:51.529034",
  "title": "Bai Yan (actor)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Bai_Yan_(actor)"
}