{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:54:53.893392"
  },
  "content": "Indonesian and Malaysian traditional clothing **Baju Kurung** ([Jawi](/wiki/Jawi_script): باجو كوروڠ‎) is a traditional attire of [Malays](/wiki/Malays_(ethnic_group)) and traditionally worn by women in [Brunei](/wiki/Brunei), [Indonesia](/wiki/Indonesia), [Malaysia](/wiki/Malaysia), [Singapore](/wiki/Singapore) and southern [Thailand](/wiki/Thailand). This type of traditional attire is the [national dress](/wiki/National_dress) of [Brunei](/wiki/Brunei) and [Malaysia](/wiki/Malaysia). In Indonesia, this dress is also worn as a regional attire, commonly observed on the island of [Sumatra](/wiki/Sumatra), particularly by the ethnic [Malay](/wiki/Malay_Indonesians) and [Minangkabau](/wiki/Minangkabau_people) women. ## Etymology A Baju Kurung is a loose-fitting full-length dress, consisting of a blouse and a skirt. It is loosely translated as \"enclosed dress\". Although Baju Kurung is the generic term of the attire for both males and females, in modern Malaysia, the female dress is referred to as Baju Kurung while the male dress is referred to as [Baju Melayu](/wiki/Baju_Melayu). The terms Baju Kurung for male is however, retained in Singapore. ## History According to the [Chinese script](/wiki/Chinese_script), the Malay community, both men and women in the 13th century only wore a covering of the lower body. During its development, Malay women wear a sarong with a \"[kemben](/wiki/Kemben)\" pattern, that is, wrapping the [sarong](/wiki/Sarong) around the chest. Pants also began to be worn in the \"Aceh Scissors\" style, namely pants that were just below the knee. But then trade brought with it foreign cultural influences. Goods from [China](/wiki/China), [India](/wiki/India), and the [Middle East](/wiki/Middle_East) also arrived. Apart from trade, this also exposes the Malay community to the way the foreigner dresses. Malays also adopted [Islam](/wiki/Islam) as their religion, and this affected the way they dressed because in this new religion there was an obligation to cover up the *[awrat](/wiki/Awrat)* of both women and men. In Malaysia, baju kurung is one of the oldest Malay clothing styles. The person who popularized it was Tun Hassan Temenggong, son of [Bendahara Seri Maharaja Tun Mutahir](/wiki/Tun_Mutahir_of_Malacca), in the 15th century [Malacca Sultanate](/wiki/Sultanate_of_Malacca). Malacca was enjoying its golden era during this period until the Portuguese conquered Malacca in 1511. It was one of the strongest sultanates in the [Malay Archipelago](/wiki/Malay_Archipelago) and was a center of entrepot trade, with traders from China, India, and the Middle East. According to the [Malay annals](/wiki/Malay_annals), [Sultan Mansur Shah](/wiki/Mansur_Shah_of_Malacca), the sixth Malaccan ruler, banned Malay women from wearing only a [sarong](/wiki/Sarong) from the bust downwards. With the guides from Tun Hassan Temenggong, the traditional [Baju Melayu](/wiki/Baju_Melayu) and Baju Kurung were born, adopting different elements from China, India, and the Middle East. The style of clothing then remained largely unchanged over the next three and a half centuries. Another version of Baju Kurung emerged in its successor state, [Johor-Riau sultanate](/wiki/Johor_Sultanate). The earlier Baju Kurung was longer and looser. This new style of Baju Kurung is known as Baju Kurung Teluk Belanga, named after the capital of the sultanate during that time, [Telok Blangah](/wiki/Telok_Blangah) in modern-day [Singapore](/wiki/Singapore). It was popularised by Sultan [Abu Bakar of Johor](/wiki/Abu_Bakar_of_Johor) in the late 19th century and continue to \"not only survived but prospered\" in modern Malaysia, pointing to its popularity during the Islamisation of Malaysia in the 1970s and 1980s. ## Attire components Baju The *Baju* (blouse) has long sleeves and extends to between the hips and knees. It is usually made from traditional Malay textiles from [Indonesian](/wiki/Indonesia) provinces ([Jambi](/wiki/Jambi), [South Sumatra](/wiki/South_Sumatra), [West Sumatra](/wiki/West_Sumatra), [North Sumatra](/wiki/North_Sumatra), [Riau](/wiki/Riau), and [Riau Archipelago](/wiki/Riau_Archipelago)) and Malaysian states ([Pahang](/wiki/Pahang), [Terengganu](/wiki/Terengganu) or [Kelantan](/wiki/Kelantan)), or sometimes even from imported silk from China, Taiwan, Turkey, the UAE or India. Sarong *Baju Kurung* is usually paired with a [sarong](/wiki/Sarong) (skirt), and the sarong itself is worn with *ikatan ombak mengalun*, which is a wavy-style fold. These folds can be seen on the left or right side of the sarong. Traditionalists prefer sarong fabric from peninsular Malaysia's eastern states of Pahang, Terengganu, and Kelantan, where the culture of batik and other hand-designed fabrics such as *[songket](/wiki/Songket)* and *[tenun](/wiki/Tenun_Pahang_Diraja)* are still strong. Kain Dagang *Kain Dagang*, also known as *[samping](/wiki/Samping)* is a type of [sarong](/wiki/Sarong) cloths used as a veil when outdoor. This cloth is used to protect oneself from the scorching sun. When indoor, *Kain Dagang* will be tied at the waist or hung on the arm. Scarf The scarf is usually slung over the shoulder. If one's wearing a *Kain Dagang*, instead of wearing a long scarf, they usually opt for a traditional veil such as *[Keringkam](/wiki/Kerikam#Tudung_Keringkam)*. The *Keringkam* is a kind of short embroidered scarf. In the more conservative states in northern Malaysia, a woman will often wear a *Baju Kurung* with a [headscarf](/wiki/Headscarf) (*tudung*). ## Varieties There are five versions of Baju Kurungs that are the most popular. All five of these variations were developed in the Malay peninsula and were gazetted as Malaysia's intangible cultural heritage in 2015. ### Baju Kurung Teluk Belanga Baju Kurung Teluk Belanga or Baju Kurung Johor was first introduced during the reign of [Sultan Abu Bakar](/wiki/Abu_Bakar_of_Johor) to commemorate the move of Johor's capital from [Teluk Belanga](/wiki/Teluk_Belanga) to [Tanjung Puteri](/wiki/Johor_Bahru) in 1866 (now known as Johor Bahru). Sultan Abu Bakar ordered that the woman's dress be down to below the knee with its neckline smooth and not baggy. Teluk Belanga style has no collar and the neckline is stitched in various forms of embroidery known as *mata lalat*, *tulang belut* or *insang pari*. During the reign of [Sultan Ibrahim](/wiki/Ibrahim_of_Johor), the dress was changed at the suggestion of the [Jaafar bin Haji Muhammad](/wiki/Jaafar_Muhammad), the first [Menteri Besar of Johor](/wiki/Menteri_Besar_of_Johor), where a pocket was added onto the Baju Kurung. Today, Teluk Belanga style is synonymous with standard traditional Baju Kurung. ### Baju Kurung Cekak Musang Baju Kurung Cekak Musang is almost identical to Baju Kurung Teluk Belanga except on the neck. It was originally from Teluk Belanga. Cekak Musang style has a standing collar with holes for five buttons including two buttons for the collar. The collar is only one finger wide. This style of Baju Kurung is believed to have received influence from India and China. ### Baju Kurung Kedah Baju Kurung Kedah is believed to have been influenced by Thailand, as the style resembles a short blouse worn in southern Thailand. It is made short to the level of the hips and is usually worn with [batik](/wiki/Batik) cloth without much decoration. Kedah style is considered to be a loose dress and popular daily wear in the northern states of Malaysia. Kedah style has a neck with Teluk Belanga style. ### Baju Kurung Pahang Baju Kurung Pahang or also known as Baju Kurung Riau-Pahang reveals the historical relationship between the two Malay states of [Riau](/wiki/Riau) and [Pahang](/wiki/Pahang). This style was inspired by Tengku Ampuan Mariam, the daughter of [Sultan Ahmad Al-Muazam Shah](/wiki/Ahmad_Mu%CA%BDazzam). Tengku Ampuan Mariam was married to [Sultan Badrul Alam Shah](/wiki/Sulaiman_Badrul_Alam_Shah_of_Terengganu). Many collections of Pahang style were collected from Terengganu and Pahang. In contrast to the standard Baju Kurung, Pahang style has a Cekak Musang collar with seven or nine buttons. ### Baju Kurung Perak Baju Kurung Perak or Baju Puteri Perak (Princess of Perak's dress) is a unique dress due to the replacement of the sarong with the use of pants. This style was inspired by the Perak and Aceh royalties. Just like Malay men's [Baju Melayu](/wiki/Baju_Melayu), pants are worn with [samping](/wiki/Samping) of various styles. The Perak style has a collar with Cekak Musang style and resembles [Acehnese](/wiki/Acehnese_people) women's clothing. ## Baju melayu for men The Cekak Musang style also normally has three pockets – two at the bottom, and one at the upper left breast. The Teluk Belanga style normally has only two pockets both at the bottom. The Baju Melayu is a loosely fitting shirt with long sleeves, worn with long pants with a Kain Dagang which is wrapped around the middle of the body from the stomach to the knee and sometimes lower. This cloth is usually a three-quarter length or full sarong-style cloth made of kain [songket](/wiki/Songket), [Tenun Pahang Diraja](/wiki/Tenun_Pahang_Diraja), or other woven materials with traditional patterns. ## Cultural significance Baju Kurung is worn to attend weddings, religious ceremonies, and official functions. In Malaysia, generally, all the Malay women wear traditional dresses as formal attire including primary and secondary school students. The Baju Kurung is also worn by non-Malays females (including Malaysia's ethnic Chinese, Indian and native Bornean minorities). This can be partially due to the Baju Kurung being one of the approved styles of dress for female civil servants and one of the approved styles of uniform for female school students. However, its peak sales occur in the month of [Ramadan](/wiki/Ramadan) on the Muslim calendar, mostly due to the upcoming \"Hari Raya Aidilfitri\" (Malay for [Eid al-Fitr](/wiki/Eid_al-Fitr)) after Ramadan ends which is celebrated by Muslims worldwide. ## Modern usage and innovations In line with the changes in the cut and shape, to produce a more modern and creative design, Baju Kurung is also decorated with embroidery, filigree, beads, and sequins. The material to produce Baju Kurung also changed. Now, there is a wide selection of materials including satin, organza, chiffon, silk, batik, linen, and more. These changes are made to suit the current situation or the event to be attended in addition to trying to imitate the style of foreign cuts that may be intended to look more elegant. There are now various variations of Baju Kurung and it is known as Baju Kurung Moden. The modern Baju Kurung commonly uses lively colors and geometric patterns. In line with the changing times, various fashion styles, and modern design Baju Kurung has been accepted by the community. The design of the Baju Kurung is now more contemporary but still retains its original features. - Clothing portal - Fashion portal - Indonesia portal - Malaysia portal - Singapore portal - [National costume of Indonesia](/wiki/National_costume_of_Indonesia) - [Malaysian cultural outfits](/wiki/Malaysian_cultural_outfits) - [Culture of Indonesia](/wiki/Culture_of_Indonesia) - [Culture of Malaysia](/wiki/Culture_of_Malaysia) ### Cited texts - Frisk, Sylvia (2009). *Submitting to God: Women and Islam in Urban Malaysia*. NIAS Press. [ISBN](/wiki/ISBN_(identifier)) 978-8776940485. Retrieved 16 January 2010. - Sandborg, Kirsten (1993). Broch-Due, Rudie and Bleie (ed.). *Carved flesh/cast selves: gendered symbols and social practices*. Berg Publishers. [ISBN](/wiki/ISBN_(identifier)) 0854968687. Retrieved 16 January 2010.\n",
  "language": "en",
  "processed_at": "2026-01-12T09:54:53.893027",
  "title": "Baju Kurung",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Baju_Kurung"
}