{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:54:56.026392"
  },
  "content": "Malay traditional clothing **Baju Melayu** ([Jawi](/wiki/Jawi_script): باجو ملايو‎) is a traditional [Malay](/wiki/Malays_(ethnic_group)) costume men in [Malaysia](/wiki/Malaysia), [Brunei](/wiki/Brunei), [Singapore](/wiki/Singapore), parts of [Indonesia](/wiki/Indonesia) (especially [Sumatra](/wiki/Sumatra) and [Kalimantan](/wiki/Kalimantan)), [southern Philippines](/wiki/Southern_Philippines), and [southern Thailand](/wiki/Southern_Thailand); it originated from the court of [Malacca Sultanate](/wiki/Malacca_Sultanate). In its formal form, baju Melayu is the [national dress](/wiki/National_dress) of [Malaysia](/wiki/Malaysia) and [Brunei](/wiki/Brunei), typically worn during official events and functions. A basic combination of this attire comes in two main parts. The first being the *baju* (long-sleeved shirt) itself which has either a raised stiff collar known as the *cekak musang* (\"fox's leash\"), or the round neckline with a short slit opening down the front known as the *teluk belanga*; the second part is the trousers called *celana* or *seluar*. The two parts are made out of the same type of fabric which is usually cotton, or a mixture of polyester and cotton.[*citation needed*] In a formal attire, a skirt-type adornment is added, which is either the [samping](/wiki/Samping), made out of [songket](/wiki/Songket), [tenun](/wiki/Tenun_Pahang_Diraja) cloth or the [sarong](/wiki/Sarong), made out of cotton or a polyester mix. The attire altogether is completed with a black or dark-colored headgear called the [songkok](/wiki/Songkok). For a ceremonial attire (*sepersalinan*) commonly worn during cultural functions, the [songkok](/wiki/Songkok) ia replaced with the [tengkolok](/wiki/Tengkolok). The normal *baju* can sometimes be substituted with a combination of *tekua* (a type of short sleeves jacket). In a more elaborate dress, *baju sikap* or *baju layang* (a type of coat) and *pending* (ornamental belt buckle) are worn. Optional accessories include a kris tucked into the *samping* folded at the waist, and a traditional *capal* (sandal). ## Name The term 'baju Melayu' literally means '[Malay](/wiki/Malays_(ethnic_group)) [shirt](/wiki/Shirt)'. The earliest literary reference to the term comes from the [Malay Annals](/wiki/Malay_Annals), written sometime between 15th to 16th centuries; it however might refer to clothing worn by Malays during that time in general, rather than a specific type of outfit. Another alternative term is the *[baju kurung](/wiki/Baju_kurung)* ([Jawi](/wiki/Jawi_script): باجو كوروڠ‎) that means 'concealed' or 'enclosed dress'; it is thought to be introduced later by Temenggung Tun Hasan[*who?*] during the reign of [Sultan Mahmud Shah](/wiki/Sultan_Mahmud_Shah) that conceals most of the body, as the name suggests. It was this term, that embodies the philosophical foundation for the dress of both men and women, that became popular for the next hundreds of years after [Melaka Sultanate](/wiki/Melaka_Sultanate). *Baju kurung* still refers to traditional outfits for both sexes in [Singapore](/wiki/Singapore), but the term in Malaysia refers to the women's outfit only. ## History > *Men and women have their hair in a knot, and are clad with a single piece of cloth. Girls of rich families wear four or five golden circles on their foreheads, and the daughters of the common people use strings of colored glass beads instead.* — *[Xingcha Shenglan](/wiki/Xingcha_Shenglan)*. The early Malay clothing style, like most of the tropical world, was simple and using a single piece of cloth for both sexes. This was the description by [Fei Xin](/wiki/Fei_Xin), a [Chinese Muslim](/wiki/Chinese_Muslim) and an Arabic scholar who wrote an account about pre-Islamic [Pahang](/wiki/Old_Pahang_Kingdom) in the *[Xingcha Shenglan](/wiki/Xingcha_Shenglan)*. The rise of Melaka Sultanate in the 15th century brought about significant changes to the Malay clothing style. As an important trading port, Melaka emerged not only as a commercial, but also a cultural and religious centre. The strong infusion of Islamic values as well as the extensive influence brought by multi-ethnic trading communities, encouraged the development of different aspects of Malay culture; language, literature, arts and cultures. The strong Islamic influence had transformed the early Malay clothing styles in accordance to Islamic values. The first literary reference to 'Baju Melayu' was from the [Malay Annals](/wiki/Malay_Annals) written during the heyday of Melaka Sultanate. The [Malay Annals](/wiki/Malay_Annals) attributes the introduction of court protocol and dress codes and other rules to [Sultan Muhammad Shah](/wiki/Muhammad_Shah_of_Malacca) (1424-1444). The legal code of the sultanate, *[Undang-Undang Melaka](/wiki/Undang-Undang_Melaka)* is also thought first promulgated in this period. During Muhammad Shah's reign, it was decreed that the manner of Malay dress must be distinct from those of the foreign lands, be it from *atas angin* (Arab, India and Europe) or *bawah angin* (China and Khmer). It was believed that from this era, the early form of a distinctive Malay dress, consisting of the basic *kain* (cloth), *baju* (shirt), and *[destar](/wiki/Tengkolok)* (headdress), began to take shape in Melakan society. In later years of the sultanate, a proper ceremonial dress of a Malay men, called *lima persalinan* ('five clothing parts') which was described in the *[Hikayat Hang Tuah](/wiki/Hikayat_Hang_Tuah)*, is said to appear during the reign of [Sultan Mansur Shah](/wiki/Mansur_Shah_of_Malacca) (1459–1477). The five basic parts are garment (*baju*), bottom (*seluar*), headgear (*destar*), sash (*sebai*), waist (kain samping). Further improvisations took place during the reign of [Sultan Mahmud Shah](/wiki/Mahmud_Shah_of_Malacca) (1488-1511), when Temenggung Tun Hassan introduced an expanded version of the shirt with a more loose-fitting shape and lengthened sleeves to wrist level. It was said that the term *Baju Kurung* ('concealed dress') was then coined for the creation as it successfully concealed most of body parts. The clothing style along with other Malay cultural values were then spread through [Malayisation](/wiki/Malayisation) of the region, by many succeeding Malay sultanates. The Melakan style of dress remains in Malay societies for the next hundreds of years before it was brought again to the fore during the reign of [Abu Bakar of Johor](/wiki/Abu_Bakar_of_Johor) (1862-1895). Numerous reforms were undertaken during his rule, including the modernisation of Malay clothing style. A more elegant style of *Baju Kurung* was introduced with a shortened hem of the shirt to the level of the back, three pockets and a round neckline with a short slit opening down the front. The style was named after the former capital of [Johor](/wiki/Johor), [Telok Blangah](/wiki/Telok_Blangah), and was introduced by Dato' [Jaafar Muhammad](/wiki/Jaafar_Muhammad), who would become the first [Menteri Besar of Johor](/wiki/Menteri_Besar_of_Johor). It was said that the new style was invented to differentiate Abu Bakar's followers clothing style with that old Melakan clothing style worn by the descendants of [Sultan Hussin](/wiki/Hussein_Shah_of_Johor) and their followers that resided in [Istana Kampong Glam](/wiki/Istana_Kampong_Glam). Another popular style called *Cekak Musang* was also said to had been introduced during the reign of Abu Bakar by a resident of Teluk Belanga called Haji Othman or Tuan Busu or Wan Busu. Initially called *Baju Wan*, it has the same cut with *Teluk Belanga* style but with a high collar split and tighten with 5 buttons. This style went on to become the most popular style until modern times, while the Teluk Belanga style remains a unique clothing style to the state of Johor. ## Styles The traditional Baju Melayu commonly features a form of *baju* (shirt) with four *pesak* (side panels) and two *kekek* (small gussets) under the armholes so that they fit and hang well., although the more contemporary adaptations tend to omit these features in their design. The *baju* is traditionally worn by men with trousers called the *seluar*. The *seluar* are traditionally wide at the top, fastened with a running string called tali, and closer at the legs where it extends to below the knees. The styles of seluar include the *seluar Aceh*, *seluar gadah* which reaches to the ankles and *seluar pendek* which terminates at about the middle of the thighs. The *seluar panjang* are long and are sometimes buttoned at the feet. The different styles of Baju Melayu can be generally distinguished in the neck opening design of the *baju*, as well as the wearing styles and combinations, depending on status and regions. But the most common syles of Baju Melayu are as follows: ### Teluk Belanga This style is named after [Telok Blangah](/wiki/Telok_Blangah) in [Singapore](/wiki/Singapore), where the administrative capital of [Johor](/wiki/Johor) was located under the rule of [Temenggong Daeng Ibrahim](/wiki/Temenggong_Daeng_Ibrahim). His son [Abu Bakar](/wiki/Abu_Bakar_of_Johor) who succeeded in 1862, initiated various reforms during his administration including the introduction of the new style of Malay dress. In 1866, following the shift of the capital to [Tanjung Puteri](/wiki/Johor_Bahru) (later known as Johor Bahru), in commemorating the event, the new style of Baju Melayu was named after the old capital. Among modifications done to included a shortened hem of the shirt to the level of the back and three front pockets. The most striking feature of this style is that the shirt's neck opening is hemmed with stiff stitching called *tulang belut* (literally eel's spine) and ends with a small loop at the top of one side to fit a singular button known as *kancing*. A type of button, set in a cluster of diamonds is called *kunang-kunang sekebun*, while the golden button is called *garam sebuku*. The shirt is worn together with a [samping](/wiki/Samping) or [sarong](/wiki/Sarong) which either wrapped below the shirt ('dagang dalam') or above the shirt ('dagang luar'). In the past, only members of the royal family and aristocrats were allowed to wear the samping in *dagang luar* style. ### Cekak Musang The style literally means the 'fox's leash', a name used to describe the design of its collar. It was also introduced during the reign of Sultan Abu Bakar, by a resident of [Telok Blangah](/wiki/Telok_Blangah) called Haji Othman or Tuan Busu or Wan Busu. Its original name was *Baju Wan* and comes with the same cut with Teluk Belanga, but with a raised collar. The [placket](/wiki/Placket) of the *baju* will seem to form a third of the *baju* from the top when it is worn with the *kain samping* or *kain sarung*. However, the hemline of the *baju* actually runs to the middle of the lap. The placket typically has three to five buttonholes and is fastened together by dress studs called *kancing* or *sitat* which are not unlike those used in Western-style formal [dress shirts](/wiki/Dress_shirt). The studs usually have screw-on backs and can be made from a variety of materials including gold, silver, and precious or semi-precious stones. The studs may also be connected with a light metal chain which will be concealed behind the shirt when the placket is fastened. Contrary to Teluk Belanga style, the samping in this style is typically worn above the baju, in a style known as *dagang dalam*. This style of Baju Melayu is considered the most common throughout the region and has been adopted as the formal dress in Malaysia and Brunei. In other parts of Southeast Asia, a type of dress identical to the *Cekak Musang* style is also commonly known as *Teluk Belanga* or its other spelling variants;*taruk balanga* ([Maranao](/wiki/Maranao_people)-[Tausūg](/wiki/Taus%C5%ABg_people)) and *taluak balango* ([Minangkabau](/wiki/Minangkabau_people)). ### Kolar Tunku The third but less known style is Kolar Tunku. It was originally made for the first [Prime Minister of Malaysia](/wiki/Prime_Minister_of_Malaysia), [Tunku Abdul Rahman](/wiki/Tunku_Abdul_Rahman) and has the same cut as Cekak Musang and Teluk Belanga but different collar's design. It took inspiration from [Mandarin collar](/wiki/Mandarin_collar) that comes with rounded collar's corner. Unlike Cekak Musang style, it has no button at the collar, leaving only three buttons on the placket. ## Adaptations The Baju Melayu is also the source of inspiration for a number of uniforms worn by several uniformed services and martial arts organizations. The official [full dress uniform](/wiki/Full_dress_uniform) or *baju istiadat* ('ceremonial uniform'), or uniform number 1 for the [enlisted rank](/wiki/Enlisted_rank) personnel of the [Malaysian Armed Forces](/wiki/Malaysian_Armed_Forces), is inspired from the wearing style of Baju Melayu, by having white tunic coats and trousers, worn together with dark green songkok and green and gold brocade [samping](/wiki/Samping). This tradition dates back to the establishment of the [Royal Malay Regiment](/wiki/Royal_Malay_Regiment) in 1932. Its original regimental [service dress uniform](/wiki/Service_dress_uniform), consisted of a green velvet songkok, spotless white top and trousers as well as a green and red silk samping. In modern times, the [Central Band of the Royal Malay Regiment](/wiki/Central_Band_of_the_Royal_Malay_Regiment) that commonly perform in the ceremonial dress, became the most senior and the official central band of the [Malaysian Army](/wiki/Malaysian_Army) that is dedicated to providing ceremonial honours and music to the [Yang di-Pertuan Agong](/wiki/Yang_di-Pertuan_Agong), the [Prime Minister](/wiki/Prime_Minister_of_Malaysia), the [Chief Justice](/wiki/Chief_Justice_of_Malaysia), the [President of the Senate](/wiki/President_of_the_Dewan_Negara), and the [Speaker of the House of Representatives](/wiki/Speaker_of_the_Dewan_Rakyat). In the Police force, the design of the ceremonial uniform for the non-gazetted officers of the [Royal Malaysian Police](/wiki/Royal_Malaysian_Police) is identical to that of armed forces, but comes with blue and black brocade samping. An almost similar design can also be found adopted in the full-dress uniform of the [Royal Brunei Armed Forces](/wiki/Royal_Brunei_Armed_Forces) with only differences are in colour variants. In traditional [Silat](/wiki/Silat_Melayu) trainings, the uniform is commonly consist of a baggy black trousers and a black long sleeves baju melayu. Some schools require the practitioners to wear *bengkung* (belts) during training, with different colours signifying different rank, while some silat schools replace the bengkung with a modern buckled belt. Headdress is optional but donning a black [bandana](/wiki/Bandana) is popular. A [sarong](/wiki/Sarong) can also be worn along with a roll of cloth which could be used as a bag, a blanket or a weapon ## Occasions for usage The Baju Melayu is commonly worn by Malay men in [Southeast Asia](/wiki/Southeast_Asia) during major Islamic festival celebrations like [Eid ul-Fitr](/wiki/Eid_ul-Fitr), [Eid al-Adha](/wiki/Eid_al-Adha) and [Islamic New Year](/wiki/Islamic_New_Year), particularly in countries with significant Malay populations; [Brunei](/wiki/Brunei), [Indonesia](/wiki/Indonesia), [Malaysia](/wiki/Malaysia), [Singapore](/wiki/Singapore), [Thailand](/wiki/Thailand), and [Philippines](/wiki/Philippines). In Brunei and Malaysia where Malays are the dominant ethnicity, Baju Melayu is the national dress for men. Day to day usage is maintained in general religious occasions, like visiting mosques or for a religious gathering, or in other social functions like weddings. A full Cekak Musang attire in black, worn together with a black [songkok](/wiki/Songkok) and [samping](/wiki/Samping) embroidered with gold thread, is considered a formal dress. It is the national attire required by protocol during official national events, especially highly formal ones like the official celebration of the [Yang di-Pertuan Agong](/wiki/Yang_di-Pertuan_Agong) or [Sultan of Brunei](/wiki/Sultan_of_Brunei)'s birthday, the sworn in of a Prime Minister and cabinet members, and the appointment of ambassadors. Malaysian ambassadors presenting their credentials to foreign heads of state are also required to wear the black Baju Melayu. The white Baju Melayu is worn by the royalties when mourning the passing away of a member of the royal family. In civil service, Baju Melayu is an alternative formal attire to be worn on Fridays or in any highly ceremonial events. Some private companies also allowed their male workers to wear Baju Melayu on Fridays, whereas others have it as a policy. Baju Melayu is also adopted as the formal uniform for Fridays in both primary and secondary public schools. In Indonesia, both the *Baju Melayu* in both collar styles (and other Malay clothes such as *Baju Kurung*) is popular in provinces with large Malay populations such as [Riau](/wiki/Riau), the [Riau Islands](/wiki/Riau_Islands), [West Kalimantan](/wiki/West_Kalimantan) and a few other provinces mainly in [Sumatera](/wiki/Sumatera) and other places where the presence of ethnic Malays are dominant. Recently, the *Baju Melayu* has become more popular and is not only worn at traditional events, but also on informal occasions. Government officials in [Riau](/wiki/Riau) and other places wear them proudly during official events (even national events). The [Betawi](/wiki/Betawi_people) version of *Baju Melayu* is called *Baju Demang*, because Betawi are also part of the big [Malay](/wiki/Malays_(ethnic_group)) tradition, its customs and attire is similar to the Malay. Other local indigenous Malay ethnics in Indonesia also have their own style of *Baju Melayu* probably which have the same similarities such as the usage of the [Songkok](/wiki/Songkok) as the headdress for men and *kain samping*. - Clothing portal - Fashion portal - Malaysia portal - Indonesia portal - [Malaysian cultural outfits](/wiki/Malaysian_cultural_outfits) - [Culture of Malaysia](/wiki/Culture_of_Malaysia) - [National costume of Indonesia](/wiki/National_costume_of_Indonesia) - [Culture of Indonesia](/wiki/Culture_of_Indonesia) - [Barong tagalog](/wiki/Barong_tagalog) ## Notes ## Bibliography - Abdul Samad Ahmad (1979), *Sulalatus Salatin*, Dewan Bahasa dan Pustaka, [ISBN](/wiki/ISBN_(identifier)) 978-983-62-5601-0, archived from the original on 12 October 2013 - [Abdullah Abdul Kadir](/wiki/Abdullah_Abdul_Kadir) (2005). Amin Sweeney (ed.). *Karya lengkap Abdullah bin Abdul Kadir Munsyi* (in Malay). Jakarta : Kepustakaan Populer Gramedia [in collaboration with] [Ecole francaise d'Extreme-Orient](/wiki/Ecole_francaise_d%27Extreme-Orient). [ISBN](/wiki/ISBN_(identifier)) 978-9799-101-16-7. - Chavalit, Khunying Maenmas; Phromsuthirak, Maneepin (2000). *Costumes in ASEAN*. Bangkok :The National ASEAN Committee on Culture and Information of Thailand. [ISBN](/wiki/ISBN_(identifier)) 9747102838.`{{cite book}}`: CS1 maint: publisher location (link) - Condra, Jill (2013). *Encyclopedia of National Dress Traditional Clothing around the World*. Holtzbrinck. [ISBN](/wiki/ISBN_(identifier)) 978-0313-376-36-8. - Farrer, Douglas S. (2009), *Shadows of the Prophet: Martial Arts and Sufi Mysticism*, Springer, [ISBN](/wiki/ISBN_(identifier)) 978-1402093555 - Koh, Jaime. \"Baju kurong\". Archived from the original on 30 November 2021. - [Leyden, John](/wiki/John_Leyden) (1821), *Malay Annals (translated from the Malay language)*, Longman, Hurst, Rees, Orme and Brown - Linehan, William (1973), *History of Pahang*, Malaysian Branch Of The Royal Asiatic Society, Kuala Lumpur, [ISBN](/wiki/ISBN_(identifier)) 978-0710-101-37-2 - [Logan, James Richardson](/wiki/James_Richardson_Logan) (1852), *The Journal Of The Indian Archipelago And Eastern Asia*, vol. 6, Kraus Reprint - Mohd Said Bin Haji Sulaiman (2008). *Pakai Patut Melayu* (in Malay). Penerbit Universiti Kebangsaan Malaysia. [ISBN](/wiki/ISBN_(identifier)) 978-9679-428-00-1. - Mokhtar Mohd Tohar (2010). *Protocol and etiquette in managing and attending functions*. Penerbit Universiti Putra Malaysia. [ISBN](/wiki/ISBN_(identifier)) 978-9673-441-45-7. - Omar Ali (2023). \"Our Story\". Archived from the original on 2 April 2023. - Royal Johor Council. \"Pakaian Tradisional Johor\". Retrieved 20 July 2023. - Selvanayagam, Grace Inpam (1991). *Songket: Malaysia's Woven Treasure - Hardcover*. Oxford University Press. [ISBN](/wiki/ISBN_(identifier)) 978-0195-889-28-4. - Siti Zainon Ismail (2006). *Pakaian Cara Melayu* (in Malay). Penerbit Universiti Kebangsaan Malaysia. [ISBN](/wiki/ISBN_(identifier)) 978-9679-427-40-0. - Teh, Alan (2019). \"Enduring charm of the baju kurung\". [New Straits Times](/wiki/New_Straits_Times). Archived from the original on 18 April 2022. - Teh, Alan (2022). \"Malaya's finest regiment\". [New Straits Times](/wiki/New_Straits_Times). Archived from the original on 21 June 2022. - The Borneo Post (2019). \"Kuching-born M'sian ambassador presents his credentials to Pope Francis\". Archived from the original on 14 June 2021. - Zaharah Othman (2022). \"Royal Malay Regiment takes pride of place at Queen's Jubilee\". Archived from the original on 18 April 2023.\n",
  "language": "en",
  "processed_at": "2026-01-12T09:54:56.025932",
  "title": "Baju Melayu",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Baju_Melayu"
}