{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:54:57.735006"
  },
  "content": "Malaysian dish ***Bak kut teh*** (also spelt **bah kut teh** and abbreviated **BKT**; [Chinese](/wiki/Traditional_Chinese_characters): 肉骨茶; [Pe̍h-ōe-jī](/wiki/Pe%CC%8Dh-%C5%8De-j%C4%AB): *Bah-kut-tê*, [Teochew](/wiki/Teochew_dialect) Pe̍h-uē-jī: *nêg8-gug4-dê5*) is a pork rib dish cooked in broth popularly served in [Malaysia](/wiki/Malaysia) and [Singapore](/wiki/Singapore) where there is a predominant [Hoklo](/wiki/Hoklo_people) and [Teochew](/wiki/Teochew_people) community. The name literally translates from the [Hokkien](/wiki/Hokkien) dialect as \"meat bone tea\", and it usually consists of [pork ribs](/wiki/Pork_ribs) simmered in a [broth](/wiki/Broth) of herbs and spices (including [star anise](/wiki/Star_anise), [cinnamon](/wiki/Cinnamon), [cloves](/wiki/Cloves), *[dong quai](/wiki/Dong_quai)*, [fennel](/wiki/Fennel) seeds and garlic) for hours. However, it can also be made with seafood, chicken and other meat. Despite its name, there is in fact no tea in the dish itself; the name refers to a strong [oolong](/wiki/Oolong) [Chinese tea](/wiki/Chinese_tea) which is usually served alongside the soup in the belief that it dilutes or dissolves the copious amount of fat consumed in this dish. Additional ingredients may include [offal](/wiki/Offal), varieties of mushroom, [choy sum](/wiki/Chinese_cabbage), and pieces of dried [tofu](/wiki/Tofu) or fried tofu puffs. Additional Chinese herbs may include *yu zhu* (玉竹, rhizome of [Solomon's seal](/wiki/Polygonatum)) and *ju zhi* ([buckthorn](/wiki/Rhamnus_(plant)) fruit), which give the soup a sweeter, slightly stronger flavor. Light and [dark soy sauce](/wiki/Dark_soy_sauce) are also added to the soup during cooking, with varying amounts depending on the variant – the [Teochew's](/wiki/Teochew_people) version is lighter than the [Hokkiens](/wiki/Fujian_cuisine)'. The dish can be garnished with chopped coriander or green onions and a sprinkling of fried shallots. In Malaysia, it is often served with strips of fried dough called *[you char kway](/wiki/Youtiao)* ([Chinese](/wiki/Traditional_Chinese_characters): 油炸鬼/粿). Soy sauce (usually dark soy sauce, but light soy sauce is also offered sometimes) is preferred as a condiment, with which chopped chilli padi (Bird's eyes chili) and minced garlic is taken together. Tea of various kinds, for example the [Tieguanyin](/wiki/Tieguanyin) (鐵觀音, 铁观音) variety which is popular in the Klang Valley area of Malaysia, is also usually served in the belief that it dilutes or dissolves the copious amount of fat consumed in this dish. In Singapore, similarly the Teochew variant dish is served with a side of [youtiao](/wiki/Youtiao) cut into small pieces, meant to be dipped into the soup of the dish before consumption. Braised pig trotters are also an option that can be ordered as a side together with the dish and dark soy sauce with chilli padi is preferred as a condiment. Tea, prepared in a [kung fu tea ceremony](/wiki/Gongfu_tea_ceremony) is also served in restaurants specialising in the dish. *Bak kut teh* is usually eaten for breakfast or lunch. The [Hokkien](/wiki/Fujian_cuisine) and [Teochew](/wiki/Chaozhou_cuisine) are traditionally tea-drinking cultures and this aspect runs deep in their cuisines. ## History *Bak kut teh* is commonly consumed in both Malaysia and Singapore. The origin of *bak kut teh* is unclear, but it is believed to have been brought over from [Fujian](/wiki/Fujian), China said to be based on a [Quanzhou](/wiki/Quanzhou) dish of beef ribs stewed with herbs known as *niu pai* (\"beef steak\"). In Malaysia, the dish is popularly associated with [Klang](/wiki/Klang_(city)), where the locals believe it to be the place of origin of *bak kut teh*. There are a number of claims for the invention of the dish; one claimed that a local *sinseh* (a Chinese physician) invented the dish in the 1930s, while another claimed he brought the recipe from his hometown in Fujian, China, in the 1940s. The dish is also claimed to have been invented in [Port Klang](/wiki/Port_Klang) for coolies working at the port to supplement their meagre diet and as a tonic to boost their health in the early 20th century. The dish was popular among early Chinese immigrants, many of whom had also come from Fujian. The [Teochew](/wiki/Teochew_people) variant was developed in Singapore and was sold along areas located beside the [Singapore River](/wiki/Singapore_River), specifically in [Clarke Quay](/wiki/Clarke_Quay) and [River Valley](/wiki/River_Valley,_Singapore) after the end of [World War II](/wiki/World_War_II). Established in 1925, owners of Pek Sin Choon claims that it had been supplying tea to bak kut teh stalls since its founding, but the business records were lost during World War II and the oldest preserved record by the business dates back to 1938. It is believed that the Singaporean version of the dish had at least been around since 1938, with evidence from Pek Sin Choon, which had been supplying tea to a bak kut teh stall, Nankin Street Bak Kut Teh, selling the Hokkien version of the dish in Maxwell Food Centre. The stall was founded by Teo Han Poh, the kitchen helper of Ong Say Bak Kut Teh (李旺世肉骨茶). Ong Say Bak Kut Teh was originally founded in the 1920s but was closed in 1989 due to redevelopment, leading to Teo starting her own bak kut teh business with the same recipe that was passed to her. By the 1960s, *bak kut teh* had become a popular street fare in Singapore. Certain business has been focused mainly on serving this dish, and developed their business from traditional humble pushcart into a [restaurant chain](/wiki/Restaurant_chain), one such example would be Song Fa Bak Kut Teh, which was founded as a pushcart stall in 1969. ### Disputes over origin The question of its origin has been the subject of a dispute between Malaysia and Singapore; in 2009, the tourism minister of Malaysia, [Ng Yen Yen](/wiki/Ng_Yen_Yen), claimed that *bak kut teh* is a dish of Malaysian origin, and that neighbouring countries had \"hijacked\" many of Malaysia's original dishes. ## Varieties There are numerous variants of *bak kut teh* with its cooking style closely influenced by the prevailing Chinese enclave of a certain geographical location. There are three main types of *bak kut teh*. - The [Teochew](/wiki/Teochew_people) style, which is light in colour but uses more [pepper](/wiki/Black_pepper) and garlic in the soup. - The [Hoklo](/wiki/Hoklo_(ethnic_group)) (Hokkien), uses a variety of herbs and soy sauce creating a more fragrant, textured and darker soup. - The [Cantonese](/wiki/Cantonese_people), with a soup-drinking culture ([Canton cuisine](/wiki/Canton_cuisine)), add medicinal herbs as well to create a stronger flavoured soup. The main visual difference between the Hokkien and Teochew version of *bak kut teh* is that the Hokkiens use more dark soy sauce and thus the soup base is characteristically darker in colour. In addition, a dry form of *bak kut teh* has also recently become increasingly popular within Malaysia, especially in Klang town. Although called *dry*, the broth is in fact reduced to a thicker gravy, to which other ingredients such as wolfberries, dried dates, dried chillies and dried squid are added. Unlike the original rib soup, the dry version has a tangier, sharper taste and is more akin to a herbal stew than the classical broth. It is often recommended locally in Malaysia as an excellent hangover cure. In Malaysia, a less fatty variation of *bak kut teh* made with chicken is called *[chik kut teh](/wiki/Ginseng_chicken_soup)*. It also serves as a *[halal](/wiki/Halal)* version of the dish catered to [Muslims](/wiki/Muslims), whose religion [forbids them to consume pork](/wiki/Religious_restrictions_on_the_consumption_of_pork). Bak kut teh is popular among the [Chinese Indonesian](/wiki/Chinese_Indonesian) community in the [Riau Islands](/wiki/Riau_Islands), [Indonesia](/wiki/Indonesia). Vegetarian bak kut teh also can be found in [Malaysia](/wiki/Malaysia). Instead of using meat, oyster mushroom is used. ## Malaysian national record On 22 November 2008, the Malaysian Klang Chinese Chamber of Commerce and Industry (KCCCI) collaborated with five *bak kut teh* sellers in Klang to cook the world's biggest bowl of the Hokkien variant of *bak kut teh*. The bowl was 182.88 cm in diameter and 91.44 cm in height, and contained 500 kg of meat, 450 kg of soup and 50 kg of herbal medicine, and has been listed in the Malaysian Book of Record. ## Recognition *Bak kut teh* was recognised as an object of national heritage of Malaysia on 23 February 2024. - Food portal - Malaysia portal - Singapore portal - [Sekba](/wiki/Sekba) - [List of Chinese soups](/wiki/List_of_Chinese_soups) - [List of soups](/wiki/List_of_soups) - Media related to Bak kut teh at Wikimedia Commons\n",
  "language": "en",
  "processed_at": "2026-01-12T09:54:57.734533",
  "title": "Bak kut teh",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Bak_kut_teh"
}