{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:55:03.802343"
  },
  "content": "Government school in Novena, Singapore The former **Balestier Hill Secondary School** ([Abbreviation](/wiki/Abbreviation): **BHSS**) was a secondary school in [Novena](/wiki/Novena,_Singapore), [Singapore](/wiki/Singapore). The school was merged into [Beatty Secondary School](/wiki/Beatty_Secondary_School) in 2017. ## History ### Founding On 24 June 1964, the Minister of Education, [Ong Pang Boon](/wiki/Ong_Pang_Boon), declared the school open as \"Balestier Hill Integrated Secondary Technical School\". It was one of the first six secondary technical schools to be opened in Singapore, and was an \"integrated\" school because it had both Chinese and English streams. The school was located at Balestier Hill, named after [Joseph Balestier](/wiki/Joseph_Balestier), the first United States [Consul](/wiki/Consul_(representative)) of Singapore. Cheong Pak Lo was the principal. In 1975, the school song was rewritten by two teachers, Chew Y.C. and Yeo S.B.. The school song had both English and Chinese lyrics, that were sung together. This was likely to cater to students from both the English and Chinese streams. The school was later renamed simply as Balestier Hill Technical School. In 1986, the Chinese stream was discontinued; the year after, the Alumni Association had its inaugural AGM. In 1992, the school was renamed Balestier Hill Secondary School and relocated from [Balestier Road](/wiki/Balestier_Road) to [Dunearn Road](/wiki/Dunearn_Road) to allow the building of new premises. In 1994, the first Balestierian of the Year Award was given to the pupil who contributed service to the school and performed best in studies and ECA. In 1997, a handing-over ceremony took place and the school began operations at the new site. The next year, the old school crest was changed to its present form. In 2000, the school was opened by Sinnakaruppan Ramasamy, which is the MP for Moulmein. ### Absorption of Monk's Hill & Rangoon Secondary Schools In 2001, Rangoon Secondary School merged with Balestier Hill Secondary School. In 2007, [Monk's Hill Secondary School](/wiki/Monk%27s_Hill_Secondary_School) merged with Balestier Hill Secondary School. The merged school operates from the current site at 11, Novena Rise. In January 2017, the school was permanently closed and was merged into [Beatty Secondary School](/wiki/Beatty_Secondary_School), due to the low enrolment of the school and the decentralisation of students in the Novena and Whampoa area. - Official website - Full chart of the school's history This Singapore school-related article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T09:55:03.801968",
  "title": "Balestier Hill Secondary School",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Balestier_Hill_Secondary_School"
}