{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:55:09.979256"
  },
  "content": "Part of the [Early history of Singapore](/wiki/Early_history_of_Singapore)[Topynymy](/wiki/Names_of_Singapore)[Sabana](/wiki/Golden_Chersonese#Settlements)**[Temasek](/wiki/Temasek)** • [Long Ya Men](/wiki/Long_Ya_Men) • Ban Zu*[Malay Annals](/wiki/Malay_Annals)***[Kingdom of Singapura](/wiki/Kingdom_of_Singapura)** • [Sang Nila Utama](/wiki/Sang_Nila_Utama) • [Parameswara](/wiki/Parameswara_of_Malacca)[Badang](/wiki/Badang)[Hang Nadim](/wiki/Hang_Nadim#In_legend_and_popular_culture)**[Sack of Singapore](/wiki/Sack_of_Singapore)**[Archaeology in Singapore](/wiki/Archaeology_in_Singapore)[Singapore Stone](/wiki/Singapore_Stone)[Fort Canning Hill](/wiki/Fort_Canning_Hill) Singapore portal - v - t - e ***Ban Zu*** or ***Banzu*** ([Chinese](/wiki/Chinese_language): 班卒; [pinyin](/wiki/Pinyin): *Bānzú*; [Wade–Giles](/wiki/Wade%E2%80%93Giles): *Pan-tsu*; [Malay](/wiki/Malay_language): *Pancur*) was a port settlement believed to have thrived in [Singapore](/wiki/Singapore) during the 14th century. It is proposed to be located on [Fort Canning Hill](/wiki/Fort_Canning_Hill) and the area on the north bank of the [Singapore River](/wiki/Singapore_River) basin between the hill and the sea. It was mentioned by the Chinese traveller [Wang Dayuan](/wiki/Wang_Dayuan) in his work *[Daoyi Zhilüe](/wiki/Daoyi_Zhil%C3%BCe)* together with *[Long Ya Men](/wiki/Long_Ya_Men)* as the two settlements that made up *[Temasek](/wiki/Temasek)*. It may have been abandoned before 1400 after an attack by either the Siamese or the [Majapahit](/wiki/Majapahit). ## Name *Ban Zu* is likely a [Chinese transcription](/wiki/Transcription_into_Chinese_characters) of the Malay word *pancur* meaning \"spring of water\". Pancur is a common placename in the region. [Fansur](/wiki/Fansur) (Pansur) in [Sumatra](/wiki/Sumatra) was known to the Arabs in the 10th century, and Fansur was also the name of a capital of Johor in the 16th century. A spring used to exist on the west side of Fort Canning Hill, called *pancur larangan* or \"forbidden spring\" in Malay, where the women of the royal household in old [Singapura](/wiki/Kingdom_of_Singapura) were said to bathe in. ## Historical accounts Historical information on *Ban Zu* comes from the Yuan dynasty work *[Daoyi Zhilüe](/wiki/Daoyi_Zhil%C3%BCe)* written by Wang Dayuan. *Ban Zu* was described as being located behind on a hill behind *[Long Ya Men](/wiki/Long_Ya_Men)* of *Temasek*. Its relationship with *Long Ya Men* is uncertain, and the descriptions of the people in *Banzu* and *Long Ya Men* are different, including their clothing. While the people of *Long Ya Men* were said to be prone to acts of piracy, the people of *Ban Zu* were described as honest. > This locality is the hill behind *Long Ya Men*. It resembles a truncated coil. It rises to a hollow summit, [surrounded] by interconnected terraces, so that the people's dwellings encircle it. The soil is poor and grain scarce. The climate is irregular, for there is heavy rain in summer, when it is rather cool. By custom and disposition [the people] are honest. They wear their hair short, with turbans of gold-brocaded satin, and red-oiled cloths [covering] their bodies. They boil sea-water to obtain salt and ferment rice to make spirits called *ming chia*. They are under a chieftain. — Wang Dayuan, translation by [Paul Wheatley](/wiki/Paul_Wheatley_(geographer)). Wang reported that the local produce of *Ban Zu* were [hornbill casques](/wiki/Hornbill_ivory), [lakawood](/wiki/Lakawood) of medium quality, and cotton. They traded in silk cloths, iron bars, local cotton prints, red gold, porcelain, and iron utensils. Wang's accounts suggest that the city of *Temasek* was moated and gated, and that the Siamese attacked the city moat of *Temasek* with around 70 ships a few years before he visited. The city however successfully resisted the attack for a month until the Siamese left when Javanese envoys happened to pass by. ## Description and archaeology *Ban Zu* is believed by some scholars to be located on today's [Fort Canning Hill](/wiki/Fort_Canning_Hill) and its nearby areas. Ruins of an old city wall in Singapore were still visible by the early 19th century when the British arrived, but have since been obliterated by the development of Singapore. [Stamford Raffles](/wiki/Stamford_Raffles) mentioned the lines of the old city and its defences, and the British [Resident](/wiki/Resident_(title)) [John Crawfurd](/wiki/John_Crawfurd) wrote about the ruins in some details. Crawfurd described in 1822 the ancient city as being roughly triangular in shape with a base of around a mile in length. It was bounded to the north by remnants of a wall nearly a mile long, around 16 feet (5 m) wide and about 8–9 feet (3 m) high along present day [Stamford Road](/wiki/Stamford_Road), the east by the sea, and the west by a salt creek that would overflow at high water. A fresh water rivulet formed a kind of a moat alongside the wall. Although Wang Dayuan mentioned that *Ban Zu* was gated, no opening was apparent along this wall according to Crawfurd. Crawfurd also noted the remains of buildings, some of brick foundation, on the west and northern side of Fort Canning Hill. Among these are ruins of a terrace 40 feet (12 m) square near the top of the hill that he took to be a temple, with another terrace almost as big on the northern slope of the hill that [local Malays](/wiki/Malay_Singaporeans) believed to be the tomb of [Iskandar Shah](/wiki/Iskandar_Shah) (who actually died in Malacca). Crawfurd also mentioned ancient fruit trees cultivated in the gardens, and found pottery fragments and Chinese coins, the earliest of which were dated to the 10th-century [Song dynasty](/wiki/Song_dynasty). In 1928, a cache of gold ornaments dating to the mid-14th century was discovered at Fort Canning Hill while the [Fort Canning reservoir](/wiki/Fort_Canning_Service_Reservoir) was being excavated. These include a pair of near-identical flexible armlets, a finger ring inscribed with a bird-like motif, three pairs of circular rings (perhaps earrings), an elliptical ornament, and a jewelled clasp with a disc-and-conch motif. Some of these including the clasp were lost during the [Japanese occupation of Singapore](/wiki/Japanese_occupation_of_Singapore) in the Second World War. The remaining ornaments have since been reappraised; the gold armband was recently identified as a *[singhamukha](/wiki/Simhamukha)* as opposed to its former identification as a Javanese *kala* motif and two of the circular ornaments bore Hindu-Buddhist references. Archaeological excavations were conducted on [Fort Canning](/wiki/Fort_Canning) by [John Miksic](/wiki/John_Miksic) in 1984, later expanded to nearby area bounded by the hill, the banks of the [Singapore River](/wiki/Singapore_River) and the sea, such as the [Parliament House Complex](/wiki/Parliament_House,_Singapore), [Empress Place](/wiki/Empress_Place_Building) and other locations. The excavations confirmed the presence of a thriving settlement and a trade port here during the 14th century. The artefacts found show that Fort Canning Hill was occupied by the elites, with perhaps a royal palace. It was also the location of artisanal workshops where glass may be recycled, as well as religious activities, although it was not a major ceremonial center. The entire Fort Canning Hill area therefore may have been once dotted with various buildings of political, religious and commercial significance. In areas near the hill, evidence of commercial activities and metal working have been found. Analyses of Chinese porcelain found indicate occupation of the site from the late 13th to mid-15th century, while evidence of earthenware manufacture may date the existence of a settlement to the 12th century. The royal centre on Fort Canning Hill may have been abandoned before 1400 after the attacks by either the Siamese or the [Majapahit](/wiki/Majapahit) as suggested by historical accounts. - [History of Singapore](/wiki/History_of_Singapore) - [Kingdom of Singapura](/wiki/Kingdom_of_Singapura) - [Archaeology in Singapore](/wiki/Archaeology_in_Singapore)\n",
  "language": "en",
  "processed_at": "2026-01-12T09:55:09.978794",
  "title": "Ban Zu",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Ban_Zu"
}