{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:55:13.600538"
  },
  "content": "Singaporean multi-brand music company **BandLab Technologies** is a [Singaporean](/wiki/Singapore) company founded in 2015 that operates a social music platform, called [BandLab](/wiki/BandLab), and also owns a variety of music-related brands, including [Harmony](/wiki/Harmony_Company) and [Heritage Guitars](/wiki/Heritage_Guitars); media platforms *Guitar.com*, *[NME](/wiki/NME)*, *[Uncut](/wiki/Uncut_(magazine))* and *MusicTech.com* ; and musical instrument retailer and distributor Swee Lee. In December 2021, the company announced a reorganisation under the newly formed parent company Caldecott Music Group (CMG). BandLab Technologies is the music technology division of CMG. ## History BandLab Technologies was founded in 2015 by Kuok Meng Ru and Steve Skillings. Kuok was a Singaporean mathematics graduate from Cambridge University who is the son of agribusiness conglomerate [Wilmar International](/wiki/Wilmar_International)'s billionaire founder and CEO [Kuok Khoon Hong](/wiki/Kuok_Khoon_Hong), and Skillings was the developer of the JamHub audio mixer. Kuok is also the owner of music retailer Swee Lee, acquired in 2012. BandLab Technologies' first product, a Cloud Digital Audio Workstation (DAW) called BandLab, was released in November 2015. In July 2016, the company acquired Composr, an [iOS](/wiki/IOS) app for recording audio and making music. The app and its users were integrated into BandLab. In September, the company acquired MONO Creators Inc, an American manufacturer of instrument cases, straps and accessories. Also in September, BandLab Technologies acquired 49% of American music magazine *[Rolling Stone](/wiki/Rolling_Stone)* from publisher [Wenner Media](/wiki/Wenner_Media). In September 2017, the company acquired Chew.tv, a video streaming service for DJs. The service was renamed Chew By BandLab, and was integrated into BandLab's web platform. Also in September, the company signed a sales and marketing partnership with Heritage Guitars. In November, the company announced it was relaunching the Harmony Company guitar and [Teisco](/wiki/Teisco) musical instrument brand names. In February 2018, BandLab Technologies acquired [digital audio workstation](/wiki/Digital_audio_workstation) [Sonar](/wiki/Cakewalk_Sonar) from musical instrument company [Gibson](/wiki/Gibson_(guitar_company)), after Gibson acquired and closed Sonar's developer, parent [Cakewalk](/wiki/Cakewalk_(company)). Sonar was renamed [Cakewalk by BandLab](/wiki/Cakewalk_by_BandLab). In October, the company acquired brands including *The Guitar Magazine* and *MusicTech* from UK-based publisher Anthem Publishing. In January 2019, BandLab Technologies sold its 49% stake in Rolling Stone to American publishing company [Penske Media](/wiki/Penske_Media). In May, the company bought the music publications *[NME](/wiki/NME)* and *[Uncut](/wiki/Uncut_(magazine))* from United Kingdom publisher [TI Media](/wiki/TI_Media). In August, the company announced that it was integrating its livestreaming service Chew into BandLab and renaming it as BandLab Live. In July 2020, the company released BandLab Albums, software for digital distribution for independent artists. In October 2020, the company reported that 22 million people were using the BandLab app. In March 2021, BandLab Technologies reported that there were 30 million people using the app. In November 2021, BandLab acquired DIY artist services platform [ReverbNation](/wiki/ReverbNation) for an undisclosed sum. In December 2021, the company announced a new parent company, Caldecott Music Group. Caldecott Music Group (CMG) oversees three divisions: BandLab Technologies (technology and software), NME Networks (media), and Vista Musical Instruments (manufacturing, retail, and distribution). In February 2023, it was announced BandLab had acquired the beat marketplace company, Airbit. ## Brands Brands within the BandLab Technologies division of CMG: - [BandLab](/wiki/BandLab) – a free online Cloud Digital Audio Workstation (DAW) tool for creating music and collaborating with other musicians. It works in a browser or with a standalone app. BandLab includes BandLab Albums, a digital distribution tool for musicians, allowing them to also create exclusive content for listeners such as demo tracks and behind-the-scenes videos. The tool also includes BandLab Live, a livestreaming feature. - [Cakewalk](/wiki/Cakewalk_by_BandLab) – a digital audio workstation formerly known as Sonar. Brands now under NME Networks, a division of CMG (previously part of BandLab Technologies): - *Guitar.com* – a music news website that also published *The Guitar Magazine* (published from 1991 to 2021). It ceased physical magazine publication in December 2021, announcing it would focus solely on the digital offering from January 2022 onwards. - lab.fm – an online music publication. - *MusicTech* – an online music technology publication. - *NME* – formally known as *New Musical Express*, a UK-based [music journalism](/wiki/Music_journalism) website and former print publication. Brands now under Vista Musical Instruments, CMG (previously part of BandLab Technologies): - Harmony Company – originally America's largest musical instrument manufacturer, relaunched in 2018 by BandLab with guitars and amplifiers. - Heritage Guitars – a United States–based guitar manufacturer. - MONO – a manufacturer of instrument cases, straps and accessories. - Teisco – a brand of musical effects pedals. - Swee Lee – a Southeast Asian musical instrument distributor and retailer. ## Business model BandLab Technologies does not charge for its software or digital musical content, but instead focuses on retail, manufacturing and media advertising sales. - Official website - BandLab website\n",
  "language": "en",
  "processed_at": "2026-01-12T09:55:13.600130",
  "title": "BandLab Technologies",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/BandLab_Technologies"
}