{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:55:20.409573"
  },
  "content": "Austronesian ethnic groupEthnic group The **Banjarese**[a] ([Banjar](/wiki/Banjar_language): *Urang Banjar*, [Jawi script](/wiki/Jawi_script): اورڠ بنجر; [Indonesian](/wiki/Indonesian_language): *Orang Banjar*) or simply **Banjar**, are an [Austronesian](/wiki/Austronesian_peoples) [ethnic group](/wiki/Ethnic_group) native to the [Banjar regions](/wiki/Banjar_Region) (notably [Banjarmasin](/wiki/Banjarmasin), [Banjarbaru](/wiki/Banjarbaru), [Banjar Regency](/wiki/Banjar_Regency), etc.) in the [southeastern Kalimantan](/wiki/South_Kalimantan) regions of [Indonesia](/wiki/Indonesia). Nowadays, Banjarese diaspora can be found in neighbouring Banjar regions as well; including [Kotabaru Regency](/wiki/Kotabaru_Regency), the southeastern regions of [Central Kalimantan](/wiki/Central_Kalimantan), southernmost regions of [East Kalimantan](/wiki/East_Kalimantan), and [some provinces of Indonesia](/wiki/Provinces_of_Indonesia) in general. The Banjarese diaspora community also can be found in neighbouring countries of Indonesia, such as [Brunei](/wiki/Brunei_Darussalam), [Malaysia](/wiki/Malaysia) (notably in [Perak](/wiki/Perak), [Selangor](/wiki/Selangor), [Kedah](/wiki/Kedah) and [Johor](/wiki/Johor) with significant minorities in [Sabah](/wiki/Sabah)), and [Singapore](/wiki/Singapore). ## Etymology [Etymologically](/wiki/Etymology), the word *Banjar* is derived from terminology in the Janyawai dialect of [Ma'anyan](/wiki/Ma%27anyan_language) language, which rooted from [Old Javanese](/wiki/Old_Javanese_language) language. It is initially used to identified the [Ma'anyan](/wiki/Ma%27anyan_people), [Meratus Dayak](/wiki/Meratus_Dayak), and [Ngaju](/wiki/Ngaju_people) people who are already \"Javanized\" when the [Javanese](/wiki/Javanese_people) people arrived in the [southeastern Kalimantan regions](/wiki/South_Kalimantan) to establish their civilization. The term *banjar* (ꦧꦚ꧀ꦗꦂ) itself in Javanese language is a short form of a verb *mbanjarke* (ꦩ꧀ꦧꦚ꧀ꦗꦂꦏꦺ), which means \"to separate and rearrange\" literally. It is 'common knowledge' within the communities of South Kalimantan that the Banjarese people were formerly part of larger [Dayak](/wiki/Dayak_people) community. ## History [Austronesian people](/wiki/Austronesian_people) migrated to Borneo around 2500 BC. Later circa 400 AD, [Sumatran](/wiki/Sumatra) brought their culture to Borneo. This cultural fusion led to the birth of the Upper Banjar language (Bahasa Banjar Hulu). In 520 AD, Sumatran immigrants formed the [Buddhist](/wiki/Buddhist) Kingdom of Tanjungpuri in the present-day region of [Tanjung](/wiki/Tanjung_(city)), [Tabalong](/wiki/Tabalong_Regency). In the 14th century, Empu Jatmika migrating from Keling, [Kediri](/wiki/Kediri_Kingdom) built the [Hindu](/wiki/Hindu) Kingdom of [Negara Dipa](/wiki/Negara_Dipa) by the river of Tapin. Which later came to be ruled under [Majapahit](/wiki/Majapahit)'s [Rajasa dynasty](/wiki/Rajasa_dynasty). This was the start of the [Javanese](/wiki/Javanese_people)-style courts in South Kalimantan. This [Hindu](/wiki/Hinduism_in_Indonesia) era in South Kalimantan remained influential period in South Kalimantan's history. [Negara Dipa](/wiki/Negara_Dipa) was succeeded by the Hindu Kingdom of [Negara Daha](/wiki/Negara_Daha) in the 15th century. According to history, Prince Samudera, the rightful heir to the kingdom of Negara Daha, was forced to flee the court of because of his uncle's revolt against him. He was accepted by the people of Bandar Masih (Bandar: port, Masih: Malay people). Supported by the [Sultanate of Demak](/wiki/Sultanate_of_Demak) in [Java](/wiki/Java), he formed a new Islamic [Banjar Kingdom](/wiki/Sultanate_of_Banjar) in 1526 with Bandar Masih as its capital. The name of Bandar Masih was later changed to its present name [Banjarmasin](/wiki/Banjarmasin). Since the 19th century, migration of the Banjarese people went as far as the east coast of [Sumatra](/wiki/Sumatra) and [Malaysia](/wiki/Malaysia). In Malaysia and Singapore, Banjarnese people are classified as part of the [Ethnic Malay](/wiki/Ethnic_Malay). ## Sub-ethnicities The Banjar people can be divided into three ethnicities based on the locations of the assimilation between the Malays, the local Dayaks ([Dayak Bukit](/wiki/Meratus_Dayak), [Dayak Ma'anyan](/wiki/Ma%27anyan_people), [Dayak Lawangan](/wiki/Lawangan_people), [Dayak Ngaju](/wiki/Ngaju_people), Dayak Barangas, and [Bakumpai](/wiki/Bakumpai_people)), and the [Javanese people](/wiki/Javanese_people). 1. The Banjarnese Pahuluan, who live in the valleys by the upriver of [Meratus mountain](/wiki/Meratus_Mountains) ranges. 2. The Banjar Batang Banyu, who live in the valleys by the river of Negara. 3. The Banjar Kuala, who live in Banjarmasin and Martapura. ## Language The native language of Banjarese people is Banjarese language (*Basa Banjar*; *Jaku Banjar*), it is an [Austronesian language](/wiki/Austronesian_languages) of the [Malayic branch](/wiki/Malayic_languages) predominantly spoken in the [southeastern Kalimantan](/wiki/South_Kalimantan) regions. The Banjarese language is the *de facto* [lingua franca](/wiki/Lingua_franca) for various indigenous community especially in South Kalimantan, as well as [Central Kalimantan](/wiki/Central_Kalimantan) (notably in [Seruyan Regency](/wiki/Seruyan_Regency) and [Sukamara Regency](/wiki/Sukamara_Regency)) and [East Kalimantan](/wiki/East_Kalimantan) in general. ### Sample text #### Universal Declaration of Human Rights The following texts are the [Universal Declaration of Human Rights](/wiki/Universal_Declaration_of_Human_Rights) in Banjarese language along with the original declaration in English. EnglishBanjarese**Universal Declaration of Human Rights****Parnyatan Hak Urang Barataan****Article 1****Ujah 1***All human beings are born free and equal in dignity and rights. They are endowed with reason and conscience and should act towards one another in a spirit of brotherhood.**Sagala urang hiput babar lik sapala awak barataan. Urang sanyaan dibari nugaraha baakal maigungakan, handak bakawalan nang mambawa sumangat sapaadingan.* #### Simple conversation Here are examples of simple conversation in Banjarese language: Banjarese*sapa ngaran pian?*Englishwhat is your name?Banjarese*ngaran ulun ...*Englishmy name is ...Banjarese*ulun handak bailang kasidin*EnglishI want to visit there ## Religion Most Banjarese are adherents of [Islam](/wiki/Islam). Islam first arrived in the South Kalimantan region around the 15th century. ## Cuisine ## Culture Generally, Banjar cultural customs are rooted in the [Kaharingan](/wiki/Kaharingan) religious rituals, which, after mass conversion to Islam, were modified to align with their new faith, Islam. One example is the *baayun anak* tradition, which in the past was a child-blessing ritual for Kaharingan followers involving the recitation of Balian mantras. Today, in the Islamic Banjar tradition, *baayun anak* no longer uses Balian mantras but instead involves the recitation of Quranic verses and [salawat](/wiki/Salawat) for the Prophet [Muhammad](/wiki/Muhammad). The Banjar have a cultural practice of putting [infants to sleep](/wiki/Infant_sleep) in an upright sling made of tied fabric. The practice is called \"bapukung.\" ### Banjar House Banjar house refers to the traditional house of the Banjar people. Traditional Banjar architecture is characterized by symbolic elements, emphasis on the roof, ornamental and decorative designs, the use of ulin wood as the primary building material, and a symmetrical layout. Banjar traditional houses have distinct styles and carvings that began to develop before 1871 and continued until 1935. Among the various types of Banjar houses, the *[Bubungan Tinggi](/wiki/Bubungan_Tinggi)* type holds the highest status and is the most well-known, as it was once the residence of the king. Today, *Bubungan Tinggi* remains the iconic traditional house of the Banjar people. ### Oral traditions The oral traditions of the Banjar people are significantly influenced by Malay, Arabic, and Chinese cultures. Banjar oral traditions, which later evolved into art forms, began to develop around the 18th century, including *Madihin* and *Lamut*. ***Madihin*** is derived from the Arabic word *madah* **(ﻤﺪﺡ)**, meaning praise. It is an anonymous folk poetry form that serves as entertainment, delivered orally or in written form in the Banjar language, adhering to specific physical and mental structures according to the conventions of Banjar folklore in South Kalimantan. Meanwhile, ***Lamut*** is a storytelling tradition that conveys messages and values related to Banjar religion, society, and culture. *Lamut* originated in China and was initially performed in the [Chinese language](/wiki/Chinese_language). However, after being introduced to the Banjar region by Chinese traders, the language was adapted to the Banjar language. ### Folk theatre The only traditional theatrical art that developed on the island of Kalimantan is ***mamanda***. Mamanda is a traditional theater art originating from South Kalimantan. Compared to other performing arts, Mamanda is more similar to *[lenong](/wiki/Lenong)* in terms of the interaction between the actors and the audience. This interaction encourages the audience to actively share funny comments, which helps make the atmosphere more lively. The difference is that *lenong* has evolved with the times, whereas *mamanda* tends to follow a monotonous storyline centered around a royal court. In m*amanda*, the characters are fixed, such as the *Raja, Perdana Menteri, Mangkubumi, Wazir, Panglima Perang, Harapan Pertama , Harapan Kedua, Khadam (Clown/Adjutant), Permaisuri,* and *Sandut (Putri)*. These characters must appear in every performance. To keep things fresh, additional characters are often introduced, such as the *Raja dari Negeri Seberang, Perompak, Jin, Kompeni*, and other supporting characters to enrich the story. It is believed that the term *mamanda* was used because, in the play, the characters such as the *Wazir,* *Menteri,* and *Mangkubumi* are addressed by the *Raja* as *pamanda* or *mamanda*. *Mamanda* etymologically comes from the word \"mama\" (*mamarina*), meaning uncle in the Banjar language, and “nda”, which means *honorable*. Therefore, *mamanda* refers to an *honorable uncle*, a respectful term used for a family member in the kinship system. ### Music One of the traditional music arts of the Banjar people is *Musik Panting*. This music is called *panting* because it is dominated by the instrument known as *panting*, a type of [gambus](/wiki/Qanb%C5%ABs) (lute) that uses strings (panting), hence the name *musik panting*. Originally, Musik Panting comes from the Tapin region in South Kalimantan. The *panting* itself is a plucked string instrument that resembles the Arabic gambus, but it is smaller in size. In the past, *musik panting* was played solo, with only one person performing. As time progressed and musical tastes evolved, it was found that *musik panting* could be more captivating when played along with other instruments. Today, it is commonly accompanied by instruments such as the *babun* ([gendang](/wiki/Kendang)), *agung* ([gong](/wiki/Gong)), and *piul* (violin), with several musicians performing together. The person who first gave it the name *musik panting* was A. Sarbaini. To this day, this music remains a well-known traditional music form originating from South Kalimantan. In addition, there is another traditional music art of the Banjar people called *Musik Kentung*. This music originates from the Banjar Regency, specifically from Sungai Alat village in Astambul and Bincau village in [Martapura](/wiki/Martapura,_South_Kalimantan). Today, *Musik Kentung* is becoming increasingly rare. In the past, the instruments were used in competitions. These competitions were not only judged by the sound but also involved magical elements, such as whether the opponent’s instrument would break or fail to produce sound during the contest. ### Dances Banjar dance art is divided into two types: dances developed in the royal palace (keraton) and dances developed by the Banjar people. Palace dance is characterized by the term *baksa*, derived from the [Javanese](/wiki/Javanese_language) word *beksan*, which signifies the refinement of movements in the choreography. These dances have existed for hundreds of years since the Hindu era, but their movements and costumes have been adjusted to fit the present-day context. For example, certain movements considered inappropriate according to Islamic customs have been slightly modified. ## Relations with Dayaks This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Banjar people\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(October 2022)* *(Learn how and when to remove this message)* The relationship between the Banjar people and the neighboring Dayaks have always been good. Some Dayaks who had converted to Islam have also assimilated into the Banjar culture and call themselves Banjar. The Dayaks also think of the Banjars as their brothers and sisters. This is further strengthened by the fact there are many inter-marriages between the Banjars and the Dayaks, even among the members of the royalty. For example, Biang Lawai, a wife of a Banjar king, was of Dayak Ngaju ethnicity. This means that the Banjarese kings and queens have Dayak lineage in their blood. According to Meratus Dayak legends, Banjarese and Meratus are descendants of related brothers of Datung Ayuh or Sandayuhan who was the ancestor of Meratus Dayak, while Bambang Basiwara or Intingan who was the ancestors of Bajarese. In the legends, Sandayuhan is strong and good at fighting, while Intingan has weaker physique but greater intelligence. This relationship grew strong when both ethnicities faced colonization by the Dutch in the 18th century. Some of the warriors involved in [Banjar War](/wiki/Banjar_War) are of Dayak ethnicity or have Dayak lineage in their blood. ## Gallery - Indonesia portal - Malaysia portal - [Banjar Malaysians](/wiki/Malaysians_of_Indonesian_descent) - [Banjar Singaporeans](/wiki/Malays_in_Singapore#The_Banjar) - [Banjarese language](/wiki/Banjarese_language) - [Banjarese architecture](/wiki/Banjarese_architecture) - [Banjarmasin](/wiki/Banjarmasin) - [South Kalimantan](/wiki/South_Kalimantan) ## Notes 1. de Bruyn, W.K.H.F.; *Bijdrage tot de kennis van de Afdeeling Hoeloe Soengai,* (*Zuider a Ooster Afdeeling van Borneo*), 19--. 2. Broersma, R.;Handel en Bedrijf in Zuiz Oost Borneo, S'Gravenhage, G. Naeff, 1927. 3. Eisenberger, J.; Kroniek de Zuider en Ooster Afdeeling van Borneo, Bandjermasin, Drukkerij Lim Hwat Sing, 1936. 4. Bondan, A.H.K.; Suluh Sedjarah Kalimantan, Padjar, Banjarmasin, 1953. 5. Ras, J.J.; Hikajat Bandjar, A study in Malay Histiography, N.V. de Ned. Boeken, Steen Drukkerij van het H.L. Smits S'Graven hage, 1968. 6. Heekeren, C. van.; Helen, Hazen en Honden Zuid Borneo 1942, Den Haag, 1969. 7. Riwut, Tjilik; Kalimantan Memanggil, Penerbit Endang, Djakarta. 8. Saleh, Idwar; Sejarah Daerah Tematis Zaman Kebangkitan Nasional (1900–1942) di Kalimantan Selatan, Depdikbud, Jakarta, 1986. ## Notes - Media related to Banjar people at Wikimedia Commons\n",
  "language": "en",
  "processed_at": "2026-01-12T09:55:20.409208",
  "title": "Banjar people",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Banjar_people"
}