{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:55:22.277056"
  },
  "content": "Singaporean multinational hospitality brand **A major contributor to this article appears to have a close connection with its subject.** It may require cleanup to comply with Wikipedia's content policies, particularly neutral point of view. Please discuss further on the talk page. *(December 2023)* *(Learn how and when to remove this message)* **Banyan Group Limited** (formerly known as **Banyan Tree Holdings**) is a [Singaporean](/wiki/Singapore) multinational hospitality brand that was established in 1994. It manages and [develops](/wiki/Land_development) [resorts](/wiki/Resort), [hotels](/wiki/Hotel_chain) and [spas](/wiki/Spa) in Asia, Europe, North America, and Africa. The group comprises 12 global brands, including the flagship brand Banyan Tree. Currently, the Group operates more than 70 hotels and resorts, over 60 spas and galleries, and 14 branded residences in over 20 countries. ## History Banyan Tree started when founder [Ho Kwon Ping](/wiki/Ho_Kwon_Ping) and his wife [Claire Chiang](/wiki/Claire_Chiang) came across a plot of land while they were on holiday in Bang Tao Bay, on the western coast of [Phuket](/wiki/Phuket_Province) in the [Andaman Sea](/wiki/Andaman_Sea). They purchased the land and embarked on a regeneration programme, reintroducing indigenous plants. Ten years later, in 1994, the first resort, Banyan Tree Phuket, was built.[*citation needed*] In 2009, Banyan Tree Global Foundation was created as part of Banyan Group Limited. In December 2016, Banyan Tree entered into a partnership with a French hospitality company, [Accor](/wiki/Accor). As part of the deal, Accor would invest €16 million to Banyan Tree in exchange for a 5% stake in the company, with the option to purchase an additional 5% stake. In 2015, the Banyan Group launched Cassia in outposts like Bintan and Phuket which focused on extended stays with amenities like fully equipped kitchens. On 26 November, Banyan Group and [Mandai Wildlife Group](/wiki/Mandai_Wildlife_Group) officially opened Mandai Rainforest Resort by Banyan Tree—Banyan’s 100th property and its first in Singapore—situated within the Mandai Wildlife Reserve as the first resort located inside a major wildlife and nature destination in the city. This is also Banyan Group's 100th property overall. Scheduled to open in early 2026, Ubuyu will be Banyan Group’s first safari resort, located in Tanzania’s Ruaha National Park. The eco-luxury retreat will feature six artisan-crafted villas inspired by Maasai architecture, overlooking the Great Ruaha River and blending into the surrounding savannah where wildlife roams freely. ## Brands As of July 2023[update], the company operates 70 resorts and hotels. Under its management are also 63 spas, 64 retail galleries, and three championship golf courses in 23 countries. Banyan Tree currently markets its properties under ten brands, including Banyan Tree, Angsana, Laguna, Cassia, Dhawa, Garrya, Homm, Baynan Tree Escape, Banyan Tree Veya, and Folio. - [Banyan](/wiki/Banyan) - [Banyan Tree AlUla](/wiki/Banyan_Tree_AlUla) - Hwee, Chua Chei; De Meyer, Arnoud (2001). Banyan Tree Resorts and Hotels: Building the Physical Product (Report). [INSEAD](/wiki/INSEAD) via [The Case Centre](/wiki/The_Case_Centre). Retrieved 22 July 2025. - Rajshekar, N; Kumar, G. Saradhi (2004). Growth Strategies of Banyan Tree (Report). IBS Case Development Center via [The Case Centre](/wiki/The_Case_Centre). Retrieved 22 July 2025. - Yang, Xia; Tan, Shirley (2007). Banyan Tree Hotels and Resorts, 2003: International Marketing Management (Report). Asian Business Case Centre. Retrieved 22 July 2025. - Enz, Cathy A.; Farhoomand, Ali; Ng, Pauline (2008). Banyan Tree: Sustainability of a Brand During Rapid Global Expansion (Report). Asia Case Research Centre, [The University of Hong Kong](/wiki/The_University_of_Hong_Kong) via [The Case Centre](/wiki/The_Case_Centre). Retrieved 22 July 2025. - Wang, Heli; Lau, Cubie; Bhattacharya, Lipika (15 October 2023). Banyan Tree Group: Sustainability Through Shared Value (Report). [Singapore Management University](/wiki/Singapore_Management_University) via [The Case Centre](/wiki/The_Case_Centre). Retrieved 22 July 2025. Media related to Banyan Tree Holdings at Wikimedia Commons - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T09:55:22.276605",
  "title": "Banyan Group",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Banyan_Group"
}