{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:55:23.818668"
  },
  "content": "Defunct English merchant bank **Barings Bank** was a British [merchant bank](/wiki/Merchant_bank) based in London. It was one of England's oldest merchant banks after [Berenberg Bank](/wiki/Berenberg_Bank), Barings' close collaborator and German representative. It was founded in 1762 by [Francis Baring](/wiki/Sir_Francis_Baring,_1st_Baronet), a British-born member of the German–British [Baring family](/wiki/Baring_family) of merchants and bankers. In 1802, Barings and Hope & Co. were called on to facilitate the largest land purchase in history: the [Louisiana Purchase](/wiki/Louisiana_Purchase), which doubled the size of the United States. It is regarded as \"one of the most historically significant trades of all time\". Barings helped to finance the United States government during the [War of 1812](/wiki/War_of_1812). By 1818, Barings was called \"the sixth great European power\", after England, France, Prussia, Austria and Russia. In the 1820s Barings ceded dominance in the City of London to the rival firm of [N M Rothschild & Sons](/wiki/N_M_Rothschild_%26_Sons). The bank collapsed in 1995 after suffering losses of £827 million (£2 billion in 2023) resulting from fraudulent investments, primarily in [futures contracts](/wiki/Futures_contract), conducted by its employee [Nick Leeson](/wiki/Nick_Leeson) working at its office in [Singapore](/wiki/Singapore). ## History ### 1762–1889 Barings Bank was founded in 1762 as the John and Francis Baring Company by [Sir Francis Baring, 1st Baronet](/wiki/Sir_Francis_Baring,_1st_Baronet), with his older brother [John Baring](/wiki/John_Baring_(1730%E2%80%931816)) as a mostly [silent partner.](/wiki/Partnership#Silent_partners) They were sons of [John (né Johann) Baring](/wiki/Johann_Baring), wool trader of [Exeter](/wiki/Exeter), born in [Bremen](/wiki/Bremen), [Germany](/wiki/Germany). The company started business in offices off [Cheapside](/wiki/Cheapside) in London, and within a few years moved to larger quarters in [Mincing Lane](/wiki/Mincing_Lane). Barings gradually diversified from wool into many other commodities, providing financial services for the rapid growth of international trade, including the lucrative [slave trade](/wiki/History_of_slavery) which enriched the family and the business considerably and allowed significant expansion of the bank's activities and prestige. The success of Baring's was greatly influenced by establishment of a network of corresponding houses. One of the most valuable connections was [Hope & Co.](/wiki/Hope_%26_Co.), the most powerful merchant bank of [Amsterdam](/wiki/Amsterdam), at that time Europe's leading financial centre. Hope & Co played a major part in the finances of the [Dutch East India Company (VOC)](/wiki/Dutch_East_India_Company_(VOC)) and during the [Seven Years' War](/wiki/Seven_Years%27_War) (1756–1763) [Thomas Hope](/wiki/Thomas_Hope_(1704%E2%80%931779)) and his brother Adrian profited from the Netherlands' neutral position. In 1774, Barings started business in North America. By 1790, Barings had greatly expanded its resources, both through Francis's efforts in London and by association with Hope & Co. In 1793, the increased business necessitated a move to larger quarters in Devonshire Square. In 1796, the bank helped to finance the purchase of about 1 million acres (4000 km2) of remote land that became part of the US state of [Maine](/wiki/Maine). In 1800, John retired and the company was reorganized as Francis Baring and Co.. Francis's new partners were his eldest son Thomas (later to be [Sir Thomas Baring, 2nd Baronet](/wiki/Sir_Thomas_Baring,_2nd_Baronet)) and son-in-law, Charles Wall. Then, in 1802, Barings and Hope & Co. were called on to facilitate the largest land purchase in history: the [Louisiana Purchase](/wiki/Louisiana_Purchase), which doubled the size of the United States. It is regarded as \"one of the most historically significant trades of all time\". This was accomplished even though Britain was at war with France and the sale helped to finance [Napoleon](/wiki/Napoleon)'s war effort. Technically, the United States purchased Louisiana from Barings and Hope, not from Napoleon. Baring was willing to help Napoleon in the short term because he, and British politicians who backed him, predicted that American expansion into Louisiana would ensure Barings' profits in Britain. After a $3 million down payment in gold, the remainder of the purchase was made in United States bonds, which Napoleon sold to Barings through Hope & Co. of Amsterdam at a price of $87.50 per $100 face value (a discount of one-eighth). Francis's second son [Alexander Baring, 1st Baron Ashburton](/wiki/Alexander_Baring,_1st_Baron_Ashburton), working for Hope & Co., made the arrangements in Paris with [François Barbé-Marbois](/wiki/Fran%C3%A7ois_Barb%C3%A9-Marbois), director of the Public Treasury. Alexander then sailed to the United States and back to pick up the bonds and deliver them to France. In 1803, Francis began to withdraw from active management, bringing in Thomas's younger brothers Alexander and Henry to become partners in 1804. The new partnership was called Baring Brothers & Co., which it remained until 1890. The offspring of these three brothers became the future generations of Barings leadership. In 1806, the company relocated to 8 [Bishopsgate](/wiki/Bishopsgate), where it stayed for the remaining life of the company. The building underwent several expansions and refurbishments, and was ultimately replaced with a new high-rise building in 1981. Barings helped to finance the United States government during the [War of 1812](/wiki/War_of_1812). By 1818, Barings was called \"the sixth great European power\", after England, France, Prussia, Austria and Russia. A fall-off in business and some poor leadership in 1820s caused Barings to cede its dominance in the City of London to the rival firm of [N M Rothschild & Sons](/wiki/N_M_Rothschild_%26_Sons). Barings remained a powerful firm, however, and in the 1830s the leadership of new American partner [Joshua Bates](/wiki/Joshua_Bates_(financier)), together with [Thomas Baring (1799–1873)](/wiki/Thomas_Baring_(1799%E2%80%931873)), son of [Sir Thomas Baring, 2nd Baronet](/wiki/Sir_Thomas_Baring,_2nd_Baronet), began a turnaround. Bates advocated a shift in Barings' efforts from Europe to the Americas, believing that greater opportunity lay in the West. In 1832, a Barings office was established in Liverpool specifically to capitalise on new North American opportunities. In 1843, Barings became an exclusive agent to the US government. Barings was appointed by [Sir Robert Peel](/wiki/Sir_Robert_Peel) to supply \"Indian corn\" ([maize](/wiki/Maize)) to Ireland for famine relief between November 1845 and July 1846, after the staple potato crop failed. The company declined to act beyond 1846, when the government instructed it to restrict its purchases to within Britain. Baring Brothers stated it would refuse future commissions in famine relief, with the blame this could so easily entail. Its position as the prime purchaser of Indian corn was assumed by Erichson, a corn factor of Fenchurch St, London. In 1851, Baring and Bates brought in another American, [Russell Sturgis](/wiki/Russell_Sturgis_(1805%E2%80%931887)), as a partner. Despite the embarrassment to his partners caused by his sympathies for the South in the [American Civil War](/wiki/American_Civil_War), Sturgis proved a capable banker. Baring did not deal in U.S. bonds, but it did help fund the American purchases of armaments. After the death of Bates in 1864, Sturgis gradually assumed a leadership role. In the 1850s and 1860s, the commercial credit business provided the firm with its basic income. Thomas Baring's nephew Edward, son of [Henry Baring](/wiki/Henry_Baring), became a partner in 1856. By the 1870s, under the emerging leadership of \"Ned\" Baring, later [Edward Baring, 1st Baron Revelstoke](/wiki/Edward_Baring,_1st_Baron_Revelstoke), Barings were increasingly involved in international securities, especially from the United States, Canada, and Argentina. Barings cautiously and successfully ventured into the North American railroad boom following the Civil War. A new railroad town was renamed [Revelstoke, British Columbia](/wiki/Revelstoke,_British_Columbia), in honour of the leading partner of the bank that enabled the completion of the [Canadian-Pacific Railway](/wiki/Canadian-Pacific_Railway). Barings also helped to finance major railways including the [Atchison, Topeka and Santa Fe Railway](/wiki/Atchison,_Topeka_and_Santa_Fe_Railway). \"Ned Baring\" had a daughter, [Margaret Baring](/wiki/Margaret_Baring), who was a great-grandmother of [Diana, Princess of Wales](/wiki/Diana,_Princess_of_Wales). In 1886, the bank helped broker the listing of the [Guinness](/wiki/Guinness) brewery. ### Panic of 1890 In the late 1880s, daring efforts in underwriting got the firm into serious trouble through overexposure to Argentine and Uruguayan debt. In 1890, Argentine president [Miguel Juárez Celman](/wiki/Miguel_Ju%C3%A1rez_Celman) was forced to resign following the [Revolución del Parque](/wiki/Revoluci%C3%B3n_del_Parque), and the country was close to defaulting on its debt payments. This crisis finally exposed the vulnerability of Barings, which lacked sufficient reserves to support the Argentine bonds. Through the organisational skills of the governor of the Bank of England, [William Lidderdale](/wiki/William_Lidderdale), a consortium of banks was arranged, headed by former governor [Henry Hucks Gibbs](/wiki/Hucks_Gibbs,_1st_Baron_Aldenham) and his family firm of [Antony Gibbs & Sons](/wiki/Antony_Gibbs_%26_Sons), to bail Barings out and support a bank restructuring. The resulting turmoil in financial markets became known as the [Panic of 1890](/wiki/Panic_of_1890). ### Reduced role: 1891–1929 The rescue avoided what could have been a worldwide financial collapse, but Barings never regained its dominant position. A [limited liability company](/wiki/Limited_liability_company)—Baring Brothers & Co., Ltd.—was formed, to which the viable business of the old partnership was transferred. The assets of the old house and several partners were taken over and liquidated to repay the rescue consortium, with guarantees provided by the Bank of England. Lord Revelstoke and others lost their partnerships along with their personal fortunes, which were pledged to support the bank. Nearly 10 years elapsed before the debts were paid. Revelstoke did not live to see this accomplished, dying in 1897. Barings did not return to issuance on a substantial scale until 1900, concentrating on securities in the United States and Argentina. It operated under the leadership of Edward's son [John Baring, 2nd Baron Revelstoke](/wiki/John_Baring,_2nd_Baron_Revelstoke), in the early years of the 20th century. The company's restraint during this period cost it its pre-eminence in the world of finance, but later paid dividends when its refusal to take a chance on financing Germany's recovery from World War I saved it some of the most painful losses incurred by other British banks at the onset of the [Great Depression](/wiki/Great_Depression). ### 1929–1992 During the Second World War, the British government used Barings to liquidate assets in the United States and elsewhere to help finance the war effort. After the war, Barings was overtaken in size and influence by other banking houses, but remained an important player in the market until 1995. The bank decided to enter the UK securities market buying Henderson Crosthwaite, a [stockbroker](/wiki/Stockbroker), in May 1984 and Wilson & Watford, a [stock jobber](/wiki/Stock_jobber), in November 1985. ### 1992–1995 Barings was brought down in 1995 by a massive trading loss caused by fraudulent trading by its head [derivatives](/wiki/Derivative_(finance)) trader in [Singapore](/wiki/Singapore) since 1992, [Nick Leeson](/wiki/Nick_Leeson). Leeson was supposed to be [arbitraging](/wiki/Arbitrage), seeking to profit from differences in the prices of [Nikkei 225](/wiki/Nikkei_225) futures contracts listed on the [Osaka Securities Exchange](/wiki/Osaka_Securities_Exchange) in Japan and on the [Singapore International Monetary Exchange](/wiki/Singapore_International_Monetary_Exchange) (SIMEX). However, instead of buying on behalf of clients on one market and immediately selling on another market for a small profit, using the strategy approved by his superiors, Leeson started undertaking such trades using the bank's own money, gambling on the future direction of the Japanese markets. According to [Eddie George](/wiki/Edward_George,_Baron_George), Governor of the [Bank of England](/wiki/Bank_of_England), Leeson began doing this at the end of January 1992. Due to a series of internal and external events, his unhedged losses escalated rapidly. #### Internal control Leeson was general manager for Barings' trading on SIMEX. Barings circumvented normal accounting, internal control and audit safeguards by making Leeson head of settlement operations for SIMEX, charged with ensuring accurate accounting for the unit. These positions would normally have been held by different employees. With authority to settle his own trades, Leeson was able to operate with no supervision from London—an arrangement that made it easier for him to hide his losses. After the collapse, several observers placed much of the blame on the bank's own deficient internal control and risk management practices. A number of people had raised concerns over Leeson's activities but were ignored. #### Corruption Because of the absence of oversight, Leeson was able to make seemingly small gambles in the futures [arbitrage](/wiki/Arbitrage) market at Barings Futures Singapore and cover up his shortfalls by reporting losses as gains to Barings in London. Specifically, Leeson altered the branch's [error account](/wiki/Error_account), subsequently known by its account number 88888 as the \"five-eights account\", to prevent the London office from receiving the standard daily reports on trading, price and status. Leeson claimed the losses started when one of his colleagues bought 20 contracts when she should have sold them, costing Barings £20,000. By December 1994, Leeson had cost Barings £200 million. He reported to [British tax authorities](/wiki/HMRC) a £102 million profit. If the company had uncovered his true financial dealings then, collapse might have been avoided as Barings still had £350 million of capital. #### Kobe earthquake Using the hidden five-eights account, Leeson began to trade aggressively in futures and options on SIMEX. His decisions routinely resulted in losses of substantial sums and he used money entrusted to the bank by subsidiaries for use in their own accounts. He falsified trading records in the bank's computer systems and used money intended for margin payments on other trading. As a result, he appeared to be making substantial profits. However, his luck ran out when the [Kobe earthquake](/wiki/Great_Hanshin_earthquake) upset the Asian financial markets—and with them, Leeson's investments. Leeson bet on a rapid recovery by the Nikkei, which failed to materialise. #### Discovery On 23 February 1995, Leeson left Singapore to fly to [Kuala Lumpur](/wiki/Kuala_Lumpur). Barings Bank auditors discovered the fraud around the time that Barings' chairman Peter Baring received a confession note from Leeson. Leeson's activities had generated losses totalling £827 million ($1.3 billion), twice the bank's available trading capital. The collapse cost another £100 million. The Bank of England attempted an unsuccessful weekend bailout, and employees around the world did not receive their bonuses. Barings was declared insolvent on 26 February 1995, and administrators began managing the finances of Barings Group and its subsidiaries. The same day, the Board of Banking Supervision of the Bank of England launched an investigation led by Britain's Chancellor of the Exchequer; its report was released on 18 July 1995. Leeson was captured in Frankfurt on 2 March and extradited to Singapore on 23 November, 272 days after fleeing. He was sentenced to six years and six months imprisonment, served in Singapore's [Changi Prison](/wiki/Changi_Prison), for his wrongdoings. #### Aftermath Dutch bank [ING](/wiki/ING_Group) purchased Barings Bank in 1995 for the nominal sum of £1 and took over all of Barings' liabilities, forming the subsidiary ING Barings. In 2001, ING sold the US-based operations to [ABN Amro](/wiki/ABN_Amro) for $275 million and folded the rest of ING Barings into its European banking division. This left only the asset management division, [Baring Asset Management](/wiki/Barings_Asset_Management). In March 2005, BAM was split and sold by ING to [MassMutual](/wiki/MassMutual), which acquired BAM's investment management activities and the rights to use the Baring Asset Management name, and [Northern Trust](/wiki/Northern_Trust), which acquired BAM's Financial Services Group. Barings Bank no longer has a separate corporate existence, although the *Barings* name still lives on as the MassMutual subsidiary Baring Asset Management. In March 2016, a merger was announced with other asset management subsidiaries of MassMutual, creating a new \"Barings\" headquartered in Charlotte, NC. Baring Private Equity International was acquired by its respective management teams, which today include [Baring Vostok Capital Partners](/wiki/Baring_Vostok_Capital_Partners) in Russia, [GP Investments](/wiki/GP_Investments) in Brazil, [Baring Private Equity Asia](/wiki/Baring_Private_Equity_Asia) and Baring Private Equity Partners India. ## The Baring Foundation The Baring Foundation was established as a charitable foundation in 1969 and survived the collapse of Barings Bank. By 2019, the foundation had provided £120 million in grant funding. ## In popular culture and fiction On 5 April 2007, *[The Guardian](/wiki/The_Guardian)* newspaper reported that [KPMG](/wiki/KPMG), the liquidators of Barings, had sold a [trading jacket](/wiki/Trading_jacket) thought to have been worn by Nick Leeson while trading on SIMEX in Singapore. The jacket was offered for sale on [eBay](/wiki/EBay) but it failed to reach its reserve price despite a highest bid of £16,100. It was subsequently sold for £21,000. In October 2007 a similar jacket used by Leeson's team but not thought to have been worn by Leeson himself sold at auction for £4,000. ### Fiction The 1999 film *[Rogue Trader](/wiki/Rogue_Trader_(film))* is a fictionalized account of the bank's downfall based upon Leeson's autobiography *Rogue Trader: How I Brought Down Barings Bank and Shook the Financial World*. In the historical novel *[Stone's Fall](/wiki/Stone%27s_Fall)* (2009) by [Iain Pears](/wiki/Iain_Pears), Barings and its role in the [Panic of 1890](/wiki/Baring_crisis) play a significant part in the story's structure. In the novel *[Around the World in Eighty Days](/wiki/Around_the_World_in_Eighty_Days)* (1872) by [Jules Verne](/wiki/Jules_Verne), [Phileas Fogg](/wiki/Phileas_Fogg)'s bet is guaranteed by a cheque for £20,000 drawn on Barings Bank: > As today is Wednesday, the 2nd of October, I shall be due in London in this very room of the Reform Club, on Saturday, the 21st of December, at a quarter before nine p.m.; or else the twenty thousand pounds, now deposited in my name at Barings, will belong to you, in fact and in right, gentlemen. Here is a cheque for the amount. In the song \"When you're lying awake\" from the operetta *[Iolanthe](/wiki/Iolanthe)* (1882) by [Gilbert and Sullivan](/wiki/Gilbert_and_Sullivan), Barings is mentioned towards the end (as Baring, together with Rothschild). - Banks portal - [CITIC Pacific#2008 foreign exchange losses controversy](/wiki/CITIC_Pacific#2008_foreign_exchange_losses_controversy) - [Leonard Ingrams](/wiki/Leonard_Ingrams), former [Managing Director](/wiki/Managing_Director) and founder of [Garsington Opera](/wiki/Garsington_Opera). - [List of trading losses](/wiki/List_of_trading_losses) - *[Re Barings plc (No.5)](/wiki/Re_Barings_plc_(No.5))* 1 BCLC 433 - *[Rogue Trader](/wiki/Rogue_Trader_(film))* – 1999 film starring Ewan McGregor - [1992 Indian stock market scam](/wiki/1992_Indian_stock_market_scam) - [NSE co-location scam](/wiki/NSE_co-location_scam) - Drummond, Helga (2007). *The Dynamics of Organizational Collapse: The Case of Barings Bank*. London: Routledge. [ISBN](/wiki/ISBN_(identifier)) 978-0-415-39961-6. - Fay, Stephen (1997). *The Collapse of Barings*. New York: W. W. Norton. [ISBN](/wiki/ISBN_(identifier)) 0-393-04055-0. - Gapper, John; Denton, Nicholas (1995). *All That Glitters: The Fall of Barings*. London: Hamish Hamilton. [ISBN](/wiki/ISBN_(identifier)) 0-241-13699-7. - Hay, Mark Edward (2024). *Transatlantic Finance in the Age of Revolutions. Hope, Baring, and the Financing of the Sale and Purchase of Louisiana*. Cham, Switzerland: Palgrave Macmillan. [doi](/wiki/Doi_(identifier)):10.1007/978-3-031-65232-5. [ISBN](/wiki/ISBN_(identifier)) 978-3-031-65231-8.. - Herring, Richard J. \"BCCI & Barings: Bank Resolutions Complicated by Fraud and Global Corporate Structure.\" in *Systemic Financial Crises: Resolving Large Bank Insolvencies* pp (2005): 321-345. online - Hunt, Luke; Heinrich, Karen (1996). *Barings Lost: Nick Leeson and the Collapse of Barings Plc*. Singapore: Butterworth-Heinemann Asia. [ISBN](/wiki/ISBN_(identifier)) 981-00-6802-6. - Jacque, Laurent L. (2010). *Global Derivative Debacles: From Theory to Malpractice*. Singapore: World Scientific. Chapter 10: \"Barings\", pp. 143–178. [ISBN](/wiki/ISBN_(identifier)) 978-981-283-770-7. - Körnert, Jan. \"The Barings crises of 1890 and 1995: causes, courses, consequences and the danger of domino effects.\" *Journal of International financial markets, institutions and money* 13.3 (2003): 187-209. - Leeson, Nicholas William; Whitley, Edward (1996). [*Rogue Trader: How I Brought down Barings Bank and Shook the Financial World*](/wiki/Rogue_Trader_(book)). Boston: [Little, Brown](/wiki/Little,_Brown). [ISBN](/wiki/ISBN_(identifier)) 0-316-51856-5. - Mezrich, Ben (2004). *Ugly Americans*. New York: HarperCollins. [ISBN](/wiki/ISBN_(identifier)) 0-06-057500-X. - Rawnsley, Judith H.; Leeson, Nicholas William (1995). *Total Risk: Nick Leeson and the Fall of Barings Bank*. New York: Harper Business. [ISBN](/wiki/ISBN_(identifier)) 0-88730-781-7. - Read, Charles. (2023). *Calming the Storms: The Carry Trade, the Banking School and British Financial Crises Since 1825.* Palgrave Macmillan. pp. 268−270. - [Ziegler, Philip](/wiki/Philip_Ziegler) (1988). *The Sixth Great Power: Barings 1762–1929*. London: Collins. [ISBN](/wiki/ISBN_(identifier)) 0-00-217508-8. - The Baring Archive - \"The Collapse of Barings Bank\" - \"The Collapse of Barings\" *[The New York Times](/wiki/The_New_York_Times)* - \"Sir Miles Rivett-Carnac, Bt\" – *Daily Telegraph* obituary - The story of Barings bank Archived 2020-01-27 at the [Wayback Machine](/wiki/Wayback_Machine) - Timeline of Barings bank Archived 2020-02-26 at the [Wayback Machine](/wiki/Wayback_Machine) - Barings – the people Archived 2020-02-26 at the [Wayback Machine](/wiki/Wayback_Machine)\n",
  "language": "en",
  "processed_at": "2026-01-12T09:55:23.818274",
  "title": "Barings Bank",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Barings_Bank"
}