{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:55:29.686715"
  },
  "content": "The **Battle of Sarimbun Beach** was the first stage of the [Japanese](/wiki/Empire_of_Japan) [assault on Singapore](/wiki/Battle_of_Singapore) in February 1942 during [World War II](/wiki/World_War_II). [Sarimbun Beach](/wiki/Sarimbun_Reservoir), in the northwestern corner of mainland [Singapore](/wiki/Singapore), was the area in which Japanese troops, under the direction of Lieutenant-General [Tomoyuki Yamashita](/wiki/Tomoyuki_Yamashita), first attacked [Allied](/wiki/Allies_of_World_War_II) forces (predominantly British) in Singapore. The commander of all Allied forces in Singapore, Lieutenant-General [Arthur Percival](/wiki/Arthur_Percival), did not expect the Japanese to make their main attack on the island from the northwest and subsequently failed to reinforce the [22nd Australian Brigade](/wiki/8th_Division_(Australia)), which took the brunt of the Japanese assault. The main Japanese objective to be attained following their landing at Sarimbun Beach was the capture of [Tengah Airfield](/wiki/Tengah_Air_Base#RAF_Tengah). ## Prelude Percival gave Major-General [Gordon Bennett](/wiki/Gordon_Bennett_(general))'s two brigades, from the [8th Australian Division](/wiki/8th_Division_(Australia)), responsibility for the north-western sector of the island. The terrain was primarily [mangrove swamp](/wiki/Mangrove_swamp) and tropical forest, broken up by rivers and creeks. The 22nd Australian Infantry Brigade (Brigadier [Harold Taylor](/wiki/Harold_Burfield_Taylor)) and most of the Australian [2/4th Australian Machine Gun Battalion](/wiki/2/4th_Machine_Gun_Battalion_(Australia)), was assigned a sector 10 mi (16 km) wide along Sarimbun Beach with the Jind Infantry Battalion of the [Indian States Forces](/wiki/Imperial_Service_Troops), which was guarding Tengah and a company of [Dalforce](/wiki/Dalforce), a guerilla militia recruited from Singaporean Chinese. The 27th Australian Infantry Brigade was assigned an adjoining 4,000 yd (3,700 m) wide area to the north, adjoining the causeway. The 2/4th Australian Machine Gun Battalion was distributed among the infantry units. ## Battle At 10:30 p.m. on 8 February, Australian machine-gunners opened fire on vessels carrying the first wave of 4,000 Japanese troops from the IJA's 5th and 18th Divisions towards Singapore Island. The Japanese wasted no time in assaulting Sarimbun Beach, which was held by the 22nd Australian Brigade. Fierce fighting raged throughout the night in the area but the increasing Japanese strength in numbers – as well as their superiority in artillery, tanks, planes and military intelligence – eventually began to take their toll on the ill-reinforced defenders. The Japanese managed to exploit several gaps in the thinly-spread Allied defence line along the coast, such as via small rivers, streams and creeks. By midnight, the two Australian brigades involved in the defence of the beach had lost communications with each other and the 22nd Brigade was forced to retreat in confusion. At 1.00am, yet more Japanese troops were landed and the last Australian reserves went into the fray of the battle. Towards dawn on 9 February, some elements of the 22nd Australian Brigade had been overrun or surrounded and the [2/18th Australian Infantry Battalionin](/wiki/2/18th_Battalion_(Australia)) the centre, had lost more than half of its personnel. The [2/20th Australian Infantry Battalion](/wiki/2/20th_Battalion_(Australia)), holding on to the right flank, was also heavily committed in resisting the Japanese troops. The [2/19th Australian Infantry Battalion](/wiki/2/19th_Battalion_(Australia)), to the left side, was being outflanked, and only \"B\" Company was left to face the initial landings and assaults by the Japanese. Percival did not reinforce the depleted 22nd Australian Brigade until Tengah Airfield was threatened with capture. Before some British and Indian infantry reinforcements arrived, the badly-battered Australian and Singaporean defence units, along with the Jinds, retreated to the \"[Jurong Line](/wiki/Battle_of_Kranji#Jurong-Kranji_defence_line)\", stretching south from the village of Bulim east of the airfield. Tengah Airfield was taken by the Japanese at around mid-day on 9 February. ## Aftermath Shortly after dark on 9 February, three British [Fairmile B motor launches](/wiki/Fairmile_B_motor_launch) were sent on a raid up the western channel of the [Straits of Johor](/wiki/Straits_of_Johor) at the area of the coastline adjoining Sarimbun Beach. Their primary objective was to attack Japanese landing-craft and disrupt enemy communications. They came under fire from enemy forces on both shores (coming from Malaya to the north and Sarimbun Beach to the south) but pressed on almost as far as the [Causeway](/wiki/Johor-Singapore_Causeway). A few Japanese landing-craft were sunk before the launches returned to Singapore, suffering minimal to almost no damage. Some Allied soldiers saw this as an example of effective defensive tactics that were used too little and too late by their senior commanders. - [Malayan Campaign](/wiki/Malayan_Campaign) - [Japanese order of battle during the Malayan Campaign](/wiki/Japanese_order_of_battle_during_the_Malayan_Campaign) - Lionel Wigmore, 1957, *[Australia in the War of 1939–1945](/wiki/Australia_in_the_War_of_1939%E2%80%931945), Volume IV – The Japanese Thrust*, (1st ed.; Australian War Memorial: Canberra). - Frank Owen, 2001, *The Fall of Singapore*, Penguin Books, [ISBN](/wiki/ISBN_(identifier)) 0-14-139133-2 - Germaine Foo-Tan, 2004, \"1942 – Sarimbun Beach Battle\" (Singapore Ministry of Defence).\n",
  "language": "en",
  "processed_at": "2026-01-12T09:55:29.686248",
  "title": "Battle of Sarimbun Beach",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Battle_of_Sarimbun_Beach"
}