{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:55:28.741788"
  },
  "content": "1942 battle during Japan's invasion of Singapore in World War II The **Battle of Bukit Timah** (10–12 February 1942), was part of the final stage of the [Empire of Japan](/wiki/Empire_of_Japan)'s [invasion](/wiki/Battle_of_Singapore) of [Singapore](/wiki/Singapore) during [World War II](/wiki/World_War_II). ## Battle On 8 February 1942, the Japanese landed a large force on the western side of Singapore Island. Throughout the following days, further troops were landed and heavy fighting followed as they pushed the mainly Australian defenders from the [22nd Brigade](/wiki/22nd_Brigade_(Australia)) back from their positions on the coast. On 10 February further landings were made against the northern positions occupied by the [27th Brigade](/wiki/27th_Brigade_(Australia)) between the River Kranji and the Causeway, and steadily the British and Commonwealth lines were pushed back south-east towards the centre of the island. As the Japanese began advancing towards the strategically important Bukit Timah which offered vital supplies including water, British, Indian, and Australian troops from a variety of units fought actions along the [Bukit Timah Road](/wiki/Bukit_Timah_Road) in an effort to blunt the advance. As the Japanese 5th Division, with armoured support, advanced down the Choa Chu Kang Road, British troops and Chinese volunteers from the irregular [Dalforce](/wiki/Dalforce) engaged in desperate hand-to-hand fighting, but being poorly equipped, they were forced back and by midnight the Japanese had occupied Bukit Timah. On 11 February, two British brigades attempted a counter-attack, but this was turned back; the following day, the [Japanese Imperial Guards](/wiki/Imperial_Guard_(Japan)), outflanked the British positions from the north, and forced them to withdraw. Dalforce was engaged in further fighting, which resulted in heavy Japanese casualties; in revenge the Japanese killed a large number of Chinese civilians nearby after the fighting. ## Memorial In 1995, a plaque was put at [Bukit Timah Nature Reserve](/wiki/Bukit_Timah_Nature_Reserve) to commemorate the Battle of Bukit Timah and [World War II](/wiki/Japanese_occupation_of_Singapore). - [History of Singapore](/wiki/History_of_Singapore) - [Battle of Singapore](/wiki/Battle_of_Singapore) - [Japanese order of battle during the Malayan Campaign](/wiki/Japanese_order_of_battle_during_the_Malayan_Campaign) - [Malaya Command](/wiki/Malaya_Command) CitationsBibliography - Coulthard-Clark, Chris (1998). *Where Australians Fought: The Encyclopaedia of Australia's Battles*. St Leonards, New South Wales: Allen & Unwin. [ISBN](/wiki/ISBN_(identifier)) 1-86448-611-2. - Hall, Timothy (1983). *The Fall of Singapore 1942*. North Ryde, New South Wales: Metheun Australia. [ISBN](/wiki/ISBN_(identifier)) 0-454-00433-8.\n",
  "language": "en",
  "processed_at": "2026-01-12T09:55:28.741339",
  "title": "Battle of Bukit Timah",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Battle_of_Bukit_Timah"
}