{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:55:32.741511"
  },
  "content": "2005 Singaporean film ***Be with Me*** is a 2005 Singaporean [drama film](/wiki/Drama_(film_and_television)) directed by [Eric Khoo](/wiki/Eric_Khoo). The film is inspired by the life of [deafblind](/wiki/Deafblindness) teacher [Theresa Poh Lin Chan](/wiki/Theresa_Poh_Lin_Chan). It [premiered](/wiki/Premiere) as the [Director's Fortnight](/wiki/Director%27s_Fortnight) selection in the [2005 Cannes Film Festival](/wiki/2005_Cannes_Film_Festival). It was also the official entry from Singapore for the [78th Academy Awards](/wiki/78th_Academy_Awards) in the foreign language category. In December 2005, the academy body disqualified the film on grounds that the dialogue is mainly in English. Out of 93 minutes, the film only has two and a half minutes of dialogue. *Be with Me* is the first film in Singapore to explicitly feature a [lesbian relationship](/wiki/LGBT_rights_in_Singapore). ## Cast - Ng Sway Ah as Father - Sanwan Bin Rais as Security Supervisor - [Theresa Poh Lin Chan](/wiki/Theresa_Poh_Lin_Chan) as herself - John Cheong Puk Fai as Sam's father - [Elizabeth Choy](/wiki/Elizabeth_Choy) as herself - Leong Kooi Eng as Mother - Lim Poey Huang as Jackie's mother - Seet Keng Yew as Fatty Koh - Shaun Koh as Sam's brother - [Ezann Lee](/wiki/Ezann_Lee) as Jackie - Poh Huat Lim as Brother - Sherry Lim as Sam's mother - Toh Cheng Onn as Neighbour - Lynn Poh as Ann - Chiew Sung Ching as Shopkeeper - Jason Tan as Brian - [Royston Tan](/wiki/Royston_Tan) - Samantha Tan as Sam - Maximilan Wong as Neighbour's son - Lawrence Yong as Son - Seet Keng Yew as Security Guard ## Release *Be with Me* premiered at the Director's Fortnight selection of the 2005 Festival de Cannes. ## Reception Ong Sor Fern of *[The Straits Times](/wiki/The_Straits_Times)* rated the film 4 stars out of 5 and wrote, \"The way Khoo has marshalled his technical skills in the service of more characterisation and story marks a new stage in his development.\" Geoffrey Eu of *[The Business Times](/wiki/Business_Times_(Singapore))* gave the film a rating of \"B-\" and wrote that \"Chan's story overwhelms everything else around it and the result is a film that is elegant but uneven in tempo - the soft-edged style is there in abundance, but the movie's progress is perhaps not as smooth as it could be.\" - Official website - *Be with Me* at [IMDb](/wiki/IMDb_(identifier)) This article related to a Singaporean film is a stub. You can help Wikipedia by expanding it. - v - t - e This article about a 2000s romantic drama film is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T09:55:32.741032",
  "title": "Be with Me",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Be_with_Me"
}