{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:55:34.681435"
  },
  "content": "* *Beaulieu House** is a bungalow on Beaulieu Road in [Sembawang, Singapore](/wiki/Sembawang). Initially the holiday residence of a local Jewish family, it later served as the residence of Vice-Admiral [Geoffrey Layton](/wiki/Geoffrey_Layton). ## Description The building was built in a [Neoclassical style](/wiki/Neoclassical_architecture). It features elegant ornamentation and plaster details. The building's portico rests on simple columns while its rooftop patio features cast-iron balustrades. The front of the building features a verandah accompanied with a cast-iron railing and terazzo clay floor tiles. The floor of the main hall is decorated with [encaustic tiles](/wiki/Encaustic_tiles). The interior also features high ceilings. There is a popular but unsubstatianted theory that the building was named after an Admiral Beaulieu who lived there in the 1930s. ## History The building was probably constructed in the 1910s and served as the holiday home for a local Jewish family by the name of David. The property was acquired by the local government in 1923. In March 1924, it was announced that the house would serve as the residence of Supeintending Civil Engineer C. H. Cole and his family, who hosted religious services and exhibitions of the Singapore Art Club at the building. From 1940 to 1942, the building served as the residence of Vice-Admiral [Geoffrey Layton](/wiki/Geoffrey_Layton), who was serving at the nearby [Singapore Naval Base](/wiki/Singapore_Naval_Base). After the end of the [Japanese occupation of Singapore](/wiki/Japanese_occupation_of_Singapore), the building served as the residence of several senior fleet officers serving at the base, including Rear-Admiral Francis Brian P. Brayne-Nicholls, who served as the Chief of Staff of the Far East Fleet. In January 1968, the British government announced that it would be withdrawing its forces in the far east. Ownership of the facilities within the naval base, including the Beaulieu House, was transferred over to the Singapore government. In November 1978, the [Parks and Recreation Department](/wiki/National_Parks_Board) announced that the building would be incorporated into a new park, which was named the [Sembawang Park](/wiki/Sembawang_Park) and opened in the following year. A restaurant owned by Lim Hock Lye opened in the building in 1981. From 2001 to November 2003, the building underwent major renovations. On 8 November 2005, the building was gazetted for conservation. 1°27′48″N 103°50′13″E﻿ / ﻿1.46339°N 103.83683°E﻿ / 1.46339; 103.83683\n",
  "language": "en",
  "processed_at": "2026-01-12T09:55:34.680895",
  "title": "Beaulieu House, Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Beaulieu_House,_Singapore"
}