{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:55:38.028137"
  },
  "content": "Planning area and planned town in East Region, SingaporePlanning Area and HDB Town in East Region, Singapore **Bedok** ([IPA](/wiki/International_Phonetic_Alphabet): /bəˈdoʊk/ *bə-DOHK*) is a [planning area](/wiki/Planning_areas_of_Singapore) and [residential town](/wiki/New_towns_of_Singapore) located in the geographical region of [Tanah Merah](/wiki/Tanah_Merah,_Singapore) along the south-eastern coast of the [East Region](/wiki/East_Region,_Singapore) of [Singapore](/wiki/Singapore). Bedok is bounded by five other planning areas: [Paya Lebar](/wiki/Paya_Lebar) to the north, [Hougang](/wiki/Hougang) to the northwest, [Tampines](/wiki/Tampines) to the northeast and east, [Geylang](/wiki/Geylang) to the west and [Marine Parade](/wiki/Marine_Parade) to the southwest. It also shares a maritime boundary with the [Singapore Strait](/wiki/Singapore_Strait) to the south and southeast. Bedok has a history of evidenced human settlement dating back to the 14th century. The area was originally a fishing village and agriculture centre, but it became a residential and commercial hub with development. In addition to its commercial development, Bedok has several green spaces and parks, including [Bedok Reservoir Park](/wiki/Bedok_Reservoir_Park) and [East Coast Park](/wiki/East_Coast_Park). Bedok is the second most populous planning area in the country, being home to 274,360 residents. This high demographic is largely explained by the cheaper public housing in the planning area, due to its relatively distant location from the [Central Area](/wiki/Central_Area,_Singapore) (city centre). Besides public housing developments, private residences are also prevalent in the area, most of which are found in the neighbourhoods of Bayshore, Frankel Avenue and [Siglap](/wiki/Siglap), in western and southwestern Bedok. ## Overview ### Etymology The origin of the name \"Bedok\" likely comes from the Malay word for \"[drum](/wiki/Bedug)\", a reference to the sound of drums heard in the area during traditional festivals and ceremonies. Its use was known as early as 1604 in [Manuel Godinho de Erédia](/wiki/Manuel_Godinho_de_Er%C3%A9dia)'s map of Singapore. The map refers to the Bedok River (present-day Sungei Bedok) as *Sune Bodo*. ### History As part of the [Tanah Merah](/wiki/Tanah_Merah,_Singapore) region, Bedok's history is largely influenced by its coastal frontier. The general area known as Bedok today was first mentioned in maps dating to the pre-Raffles era. After Singapore was [colonised by the British in 1819](/wiki/Founding_years_of_modern_Singapore), Simpang Bedok became an ethnically mixed community consisting of [Chinese](/wiki/Chinese_Singaporeans) and [Malay](/wiki/Malay_Singaporeans) peoples. Before the 1960s, Bedok's primary source of income was [coconut](/wiki/Coconut), which was harvested from the plantations found in the Siglap subzone. Fishing was another primary source of income for the villagers of Simpang Bedok at the time. The modern development of Bedok began in 1966, when reclamation works along the coastal area began. In the following decade, Bedok was transformed by the [Housing and Development Board](/wiki/Housing_and_Development_Board) (HDB) into the country's fifth self-contained new town, with the first residential flats emerging in the vicinity by 1975. Following the [Fall of Saigon](/wiki/Fall_of_Saigon) that same year, [Bedok Jetty](/wiki/Bedok_Jetty) became a focal point for [Vietnamese refugees](/wiki/Vietnamese_boat_people) landing in Singapore during [Operation Thunderstorm](/wiki/Operation_Thunderstorm). Bedok Town has been developed since 1973, with newer roads such as Bedok Plain, Bedok Highway, and Bedok Heights being built until 1975. New Upper Changi Road was fully built and opened in 1979. Development was completed at that time, except for Bedok Reservoir and Kaki Bukit, which were developed later between 1983 and 1988. ## Geography ### Location Bedok Planning Area is located within the East Region of Singapore, along the southeastern coast of [Singapore Island](/wiki/Singapore_Island). It is bounded by [Paya Lebar](/wiki/Paya_Lebar) to the north, [Hougang](/wiki/Hougang) to the northwest, [Tampines](/wiki/Tampines) to the northeast and east, [Geylang](/wiki/Geylang) to the west, and [Marine Parade](/wiki/Marine_Parade) to the southwest. Bedok New Town sits within the Bedok Planning Area. ### Subzones Bedok is divided into 8 subzones: Name of estatesLocationNotable structuresAccessibilityBayshoreAreas along Bayshore Road[East Coast Park](/wiki/East_Coast_Park), [Upper East Coast Bus Terminal](/wiki/Upper_East_Coast_Bus_Terminal), [Bedok Jetty](/wiki/Bedok_Jetty), [Temasek Secondary School](/wiki/Temasek_Secondary_School) as well as the [Bayshore MRT station](/wiki/Bayshore_MRT_station), [Bedok South MRT station](/wiki/Bedok_South_MRT_station) (U/C) and [Sungei Bedok MRT station](/wiki/Sungei_Bedok_MRT_station) (U/C)[Bayshore MRT station](/wiki/Bayshore_MRT_station) and busesBedok NorthAreas along Bedok North Road[Tanah Merah MRT station](/wiki/Tanah_Merah_MRT_station), [Bedok MRT station](/wiki/Bedok_MRT_station), [Bedok Bus Interchange](/wiki/Bedok_Bus_Interchange), Bedok Town Centre, [Bedok Stadium](/wiki/Bedok_Stadium), Bedok Swimming Complex, Bedok Tennis Centre, Bedok Sports Hall, [Bedok Mall](/wiki/Bedok_Mall), [Bedok Point](/wiki/Bedok_Point), [Bedok Public Library](/wiki/Bedok_Public_Library), Bedok Polyclinic, Seu Teck Sean Tong Yiang Sin Sia, Kampong Chai Chee Community Centre, Fengshan Community Club, Fengshan Primary School, St Anthony's Canossian Primary & Secondary School[Tanah Merah MRT station](/wiki/Tanah_Merah_MRT_station), [Bedok MRT station](/wiki/Bedok_MRT_station) and buses[Bedok Reservoir](/wiki/Bedok_Reservoir)Areas surrounding Bedok Reservoir[Bedok Town Park](/wiki/Bedok_Town_Park), [Bedok Reservoir](/wiki/Bedok_Reservoir), Bedok Reservoir Park, Damai Primary School, [Damai Secondary School](/wiki/Damai_Secondary_School) and [Bedok Reservoir MRT station](/wiki/Bedok_Reservoir_MRT_station)Buses and [Bedok Reservoir MRT station](/wiki/Bedok_Reservoir_MRT_station)Bedok SouthEstates along Bedok South RoadBedok Community Centre, Bedok Green Primary School, [Bedok View Secondary School](/wiki/Bedok_View_Secondary_School), [Bedok South Secondary School](/wiki/Bedok_South_Secondary_School), Temasek Primary School, [Temasek Junior College](/wiki/Temasek_Junior_College) and Yuan Meng Shih TempleBedok MRT station, Tanah Merah MRT station, and busesFrankelAreas along Telok Kurau Road and Siglap RoadTelok Kurau Park, Opera Estate Primary School, CHIJ (Katong) Primary School, [Saint Patrick's School](/wiki/Saint_Patrick%27s_School,_Singapore), [124 and 126/126A St. Patrick's Road](/wiki/124_and_126/126A_St._Patrick%27s_Road)[Kembangan MRT station](/wiki/Kembangan_MRT_station), [Marine Terrace MRT station](/wiki/Marine_Terrace_MRT_station) and buses[Kaki Bukit](/wiki/Kaki_Bukit,_Singapore)Northwest BedokKaki Bukit Industrial Estate, [Eunos Community Club](/wiki/Eunos_Community_Club), [Kaki Bukit MRT station](/wiki/Kaki_Bukit_MRT_station) and [Bedok North MRT station](/wiki/Bedok_North_MRT_station)Buses, [Kaki Bukit MRT station](/wiki/Kaki_Bukit_MRT_station) and [Bedok North MRT station](/wiki/Bedok_North_MRT_station)[Kembangan](/wiki/Kembangan,_Singapore)Areas around [Kembangan MRT station](/wiki/Kembangan_MRT_station) and Chai Chee Estate[Kembangan MRT station](/wiki/Kembangan_MRT_station), Kampong Kembangan Community Club, The Buddhist Union, Hong San Si Temple, Kampong Kembangan Neighbourhood Police Post, Chai Chee Neighbourhood Police Post, Chai Chee Fire Post, Bedok South Neighbourhood Police Centre, Chai Chee United Temple, NPS International School and Ping Yi Secondary School[Kembangan MRT station](/wiki/Kembangan_MRT_station) and buses[Siglap](/wiki/Siglap)Areas along Marine Vista and Siglap Link[East Coast Park](/wiki/East_Coast_Park), [Victoria School](/wiki/Victoria_School), [Victoria Junior College](/wiki/Victoria_Junior_College), Ean Keng Si Buddhist Temple and the [Siglap MRT station](/wiki/Siglap_MRT_station)[Siglap MRT station](/wiki/Siglap_MRT_station) and buses ## Infrastructure Bedok New Town covers a land area close to 9.4 km2 (3.6 sq mi) with some 42% occupied for residential use. It was formerly a hilly region, and hence the focal point of orientation of the town is the special [landscaped](/wiki/Landscape_architecture) park and sports complex built on the higher ground of the town. The residential blocks, as well as the industrial area, are planned based on the neighbourhood concept. There is also a town centre situated between the present [Bedok Mall](/wiki/Bedok_Mall) and the former [Bedok Point](/wiki/Bedok_Point) site. Plans for an integrated complex the size of three football fields were revealed in 2014. This complex, Heartbeat @ Bedok, houses a sports centre, library, clinic, centre for the elderly, and the Kampong Chai Chee Community Club. The complex is located in the Bedok Town centre and was completed in 2017. ### Residential development Some 58,000 units of [flats](/wiki/Apartment) were built by the HDB in Bedok New Town. As one of the older towns, the majority of the flats are 3-room or 4-room. There are also some 2,700 and 583 units of executive and Housing and Urban Development Corporation flats. It provides housing for some 200,000 residents. ### Transportation There are currently nine [Mass Rapid Transit](/wiki/Mass_Rapid_Transit_(Singapore)) stations in the Bedok planning area across three lines, the [East West line](/wiki/East_West_MRT_line), the [Downtown line](/wiki/Downtown_Line) and the [Thomson–East Coast line](/wiki/Thomson%E2%80%93East_Coast_Line). Three lines run parallel to one another and do not have an interchange station in Bedok. However, the Tanah Merah MRT station of EWL is an interchange station with the Changi Airport branch line (CG). The nine stations are: - **EW4** **CG** [Tanah Merah](/wiki/Tanah_Merah_MRT_station) (Until 2040) - **EW5** [Bedok](/wiki/Bedok_MRT_station) - **EW6** [Kembangan](/wiki/Kembangan_MRT_station) - **DT28** [Kaki Bukit](/wiki/Kaki_Bukit_MRT_station) - **DT29** [Bedok North](/wiki/Bedok_North_MRT_station) - **DT30** [Bedok Reservoir](/wiki/Bedok_Reservoir_MRT_station) - **TE27** [Marine Terrace](/wiki/Marine_Terrace_MRT_station) - **TE28** [Siglap](/wiki/Siglap_MRT_station) - **TE29** [Bayshore](/wiki/Bayshore_MRT_station) The future stations of the [Thomson-East Coast line](/wiki/Thomson%E2%80%93East_Coast_Line) are currently under construction and will be operational in 2026 under stage 5. The line will run south of the planning area and have an interchange station with the Downtown line at Sungei Bedok station, which will also be the terminus for both lines. The two future stations are: - **TE30** [Bedok South](/wiki/Bedok_South_MRT_station) - **TE31** **DT37** [Sungei Bedok](/wiki/Sungei_Bedok_MRT_station) The Bedok Bus Interchange opened in 1979, as part of the Bedok Town Centre, located along Bedok North Road and between Block 203 and 207, next to community amenities such as a food centre, library, and sports complex, with the allocated Block 207A. There were thirty-three end-on berths with ten services occupying it and six sawtooth berths, each occupying three bus services in the original facility. Several bus services were moved to the interchange from Chai Chee Bus Terminal when it closed in 1985. [Bedok MRT station](/wiki/Bedok_MRT_station) opened in 1989 at the south of the original facility, complementing the bus interchange to serve people travelling within Bedok town and also the nearby [East Coast Park](/wiki/East_Coast_Park). On 19 November 2011, after operating from the original facility for 32 years, the bus interchange moved to its temporary facility west of the original facility, at the junction of Bedok North Drive and Bedok North Avenue 1, to allow the original facility to be redeveloped into [Bedok Mall](/wiki/Bedok_Mall). The new Bedok Integrated Transport Hub (ITH) began operations on 30 November 2014. It is the 7th air-conditioned bus interchange in Singapore. ### Parks The parks in the area include Bedok Town Park, located beside the Pan Island Expressway between Bedok North Road and Bedok Avenue 3, and the Bedok Reservoir Park alongside [Bedok Reservoir](/wiki/Bedok_Reservoir). Bedok Town Park park has been designated with the code 9V-0005 by the international [Parks On The Air](/wiki/Parks_On_The_Air) award program, and so is regularly 'activated' by [Amateur radio](/wiki/Amateur_radio) operators using portable equipment. ## Politics In early days, Bedok has been heavily organized into several constituencies over the years, and by (/wiki/1976_Singaporean_general_election), a namesake [Bedok Constituency](/wiki/Bedok_Constituency) was carved from [Siglap Constituency](/wiki/Siglap_Constituency) with [Sha'ari Tadin](/wiki/Sha%27ari_Tadin) being the first MP for the area. Towards the end of 1980s as its population grew rapidly and with the introduction of the [Group Representation Constituency](/wiki/Group_Representation_Constituency) (GRC) scheme, the electoral boundaries were redrawn to include the [namesake GRC](/wiki/Bedok_GRC) while other constituencies of the planning area were organized into GRCs of Aljunied GRC, [Eunos](/wiki/Eunos_GRC), [Marine Parade](/wiki/Marine_Parade_GRC) and [Tampines](/wiki/Tampines_GRC) while retaining other constituencies such as [Joo Chiat](/wiki/Joo_Chiat_SMC) and [Fengshan](/wiki/Fengshan_SMC). In 1997, Bedok GRC become the present-day [East Coast GRC](/wiki/East_Coast_GRC) following the addition of [Changi](/wiki/Changi) (until 2025 with the creation of [Pasir Ris-Changi GRC](/wiki/Pasir_Ris-Changi_GRC)) in the recent redistricting of constituencies, along with most of other Bedok constituencies. As of (/wiki/2025_Singaporean_general_election), Bedok has been represented under three different constituencies: [Aljunied GRC](/wiki/Aljunied_GRC) (northern Bedok along with [Kaki Bukit](/wiki/Kaki_Bukit,_Singapore) and [Bedok Reservoir](/wiki/Bedok_Reservoir)), [East Coast GRC](/wiki/East_Coast_GRC) (divisions covering most of Bedok, Joo Chiat, Siglap and Bayshore), and [Marine Parade-Braddell Heights GRC](/wiki/Marine_Parade-Braddell_Heights_GRC) (Frankel and Kembangan divisions). Since 1988, the [Workers' Party](/wiki/Workers%27_Party_(Singapore)) had frequently contest there in the areas of Bedok including the aforementioned GRCs. Their first victory was in the [2011 election](/wiki/2011_Singaporean_general_election) when WP won Aljunied GRC, capturing the northern areas of Bedok under the flagship of then-secretary general [Low Thia Khiang](/wiki/Low_Thia_Khiang), who took charge of the Bedok Reservoir-Punggol division, and its present secretary-general [Pritam Singh](/wiki/Pritam_Singh), who took charge of the Eunos division. Despite this, PAP had still retained the other constituencies albeit only by narrow margins. The areas of Bedok has also been under charge by many prominent ministers including [Maliki Osman](/wiki/Maliki_Osman), [Lee Yock Suan](/wiki/Lee_Yock_Suan), [Raymond Lim](/wiki/Raymond_Lim) and [Lim Swee Say](/wiki/Lim_Swee_Say), former [Senior Minister](/wiki/Senior_Minister_of_Singapore) [S. Jayakumar](/wiki/S._Jayakumar_(Singaporean_politician)), previous [speakers](/wiki/Speaker_of_the_Parliament_of_Singapore) [Tan Soo Khoon](/wiki/Tan_Soo_Khoon) and [Abdullah Tarmugi](/wiki/Abdullah_Tarmugi), and [Deputy Prime Minister](/wiki/Deputy_Prime_Minister_of_Singapore) [Heng Swee Keat](/wiki/Heng_Swee_Keat). As of 2025, East Coast was led by minister [Edwin Tong](/wiki/Edwin_Tong) and other four MPs [Jessica Tan Soon Neo](/wiki/Jessica_Tan_Soon_Neo), [Tan Kiat How](/wiki/Tan_Kiat_How), [Dinesh Vasu Dash](/wiki/Dinesh_Vasu_Dash) and [Hazlina Abdul Halim](/wiki/Hazlina_Abdul_Halim), while Marine Parade-Braddell Heights was overseen by [Muhammad Faishal Ibrahim](/wiki/Muhammad_Faishal_Ibrahim), who returned to that GRC (then as Marine Parade GRC back in 2006) after representing [Nee Soon GRC](/wiki/Nee_Soon_GRC) from 2011 to 2025. ## Education The following is the list of schools in Bedok as of 2024: ### Primary schools - Bedok Green Primary School - Damai Primary School (to be relocated to [Tampines](/wiki/Tampines) in 2029) - Fengshan Primary School - Opera Estate Primary School - Red Swastika School - St. Anthony's Canossian Primary School - St. Stephen's School - Telok Kurau Primary School - Temasek Primary School - Yu Neng Primary School ### Secondary schools - [Anglican High School](/wiki/Anglican_High_School,_Singapore) - [Bedok Green Secondary School](/wiki/Bedok_Green_Secondary_School) - [Bedok South Secondary School](/wiki/Bedok_South_Secondary_School) - Bedok View Secondary School - [Damai Secondary School](/wiki/Damai_Secondary_School) - [St. Anthony's Canossian Secondary School](/wiki/Saint_Anthony%27s_Canossian_Secondary_School) - [Temasek Secondary School](/wiki/Temasek_Secondary_School) ### Junior colleges - [Temasek Junior College](/wiki/Temasek_Junior_College) (as of 2024, the campus has been temporarily relocated to [Tampines](/wiki/Tampines) whilst the Bedok campus is undergoing renovations) ### Other schools - Katong School (APSN) - NPS International School ## Hawker centres As of 2020[update], 10 major hawker centres are located in Bedok that serves local Singaporean cuisine. They are: - Fengshan Market & Food Centre - Bedok Interchange Hawker Centre - Blk 216 Bedok Food Centre & Market - Kaki Bukit 511 Market & Food Centre - Bedok 538 Market & Food Centre - Blk 16 Bedok South Market & Food Centre - The Marketplace @ 58 - Bedok Food Centre - The Bedok Market Place - Blk 630 Bedok Reservoir Market & Food Centre ## In popular culture The popular blockbuster Singaporean drama known as *[It Takes Two](/wiki/It_Takes_Two_(Singaporean_TV_series))* was filmed around the area and that the [protagonists](/wiki/Protagonist) and their family are all living together in the [HDB](/wiki/Housing_and_Development_Board) [Flats](/wiki/Public_housing_in_Singapore) as neighbours under one roof and that Blk 216 Bedok Market and Hawker Centre was also another filming location for the drama as well, where both of the [protagonist](/wiki/Protagonist)'s families sell [handmade fishball noodles](/wiki/Mee_pok) at their respective stalls. - URA Draft Masterplan 2013 Bedok - Victor R Savage, Brenda S A Yeoh (2003), *Toponymics – A Study of Singapore Street Names*, Eastern Universities Press, [ISBN](/wiki/ISBN_(identifier)) 981-210-205-1 - From National Library Board Singapore, Infopedia website. - Chin, Daryl. (, 2014). Bedok residents to get a new sports complex, library, and community club under one roof by 2017. The Straits Times. Bedok residents to get new sports complex, library and community club under one roof by 2017\n",
  "language": "en",
  "processed_at": "2026-01-12T09:55:38.027624",
  "title": "Bedok",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Bedok"
}