{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:55:39.618543"
  },
  "content": "Shopping mall in Bedok, Singapore **Bedok Mall** is a suburban shopping mall in [Bedok](/wiki/Bedok), [Singapore](/wiki/Singapore). It is part of a mixed development, consisting of shops and apartments, that is also integrated with the [Bedok MRT station](/wiki/Bedok_MRT_station) and the [Bedok Bus Interchange](/wiki/Bedok_Bus_Interchange). It was built on the site of the old Bedok bus interchange. The mall is linked to the MRT station at its Basement 2 and to the Bus Interchange at its Level 2. The mall is next to the Bedok Interchange Hawker Centre. ## History The [Land Transport Authority](/wiki/Land_Transport_Authority) announced in 2009 that the former Bedok Bus Interchange will be redeveloped into an integrated transport hub comprising an air-conditioned bus interchange, a retail mall and a residential complex. To facilitate construction works for the integrated hub, Bedok Bus Interchange was moved to a temporary site next to its original location in late 2011. At the same time, CapitaLand, the developer of the site, launched Bedok Mall and Bedok Residences as an integrated development. Originally slated to be completed in 2014, Capitaland announced that Bedok Mall would open in late 2013, six months earlier than expected. It also announced that the mall had secured anchor tenants FairPrice Finest, Best Denki and Uniqlo. Bedok Mall was opened on 3 December 2013, with 80% of the shops opened. On 30 November 2014, the air-conditioned Bedok Bus Interchange opened and Bedok Residences was completed in June 2015. Located at the town centre of Bedok, the integrated retail and residential development comprises a 3-storey lifestyle and family shopping mall and eight 15-storey residential towers called Bedok Residences. - [Bedok Point](/wiki/Bedok_Point) - Official website This article about a Singapore building or structure is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T09:55:39.618020",
  "title": "Bedok Mall",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Bedok_Mall"
}