{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:55:46.384984"
  },
  "content": "1°19′58.13″N 103°56′12.76″E﻿ / ﻿1.3328139°N 103.9368778°E﻿ / 1.3328139; 103.9368778 The **Bedok Police Division** (or **'G' Division**) is one of the seven land divisions of the [Singapore Police Force](/wiki/Singapore_Police_Force). Bedok Division covers approximately 114 square kilometres of the eastern sector of Singapore. The building became operational on 1 August 1987 when the former Joo Chiat Police Station at East Coast Road was closed down. Bedok Division initially comprised seven Neighbourhood Police Centres (NPC) and 16 Neighbourhood Police Posts (NPP). The seven NPCs are Bedok North, Bedok South, Changi, Geylang, Marine Parade, Pasir Ris and Tampines. Bedok Division serves about 800 thousand residents in private and public housing estates within our boundaries. In addition, scattered throughout the division's jurisdiction are several industrial estates, as well as other commercial, sporting and recreational facilities, which include the Singapore Sports Hub, East Coast Park, Our Tampines Hub and Downtown East. In January 2022, Bedok South NPC and Bedok North NPC were merged to form Bedok NPC. ## History Previously headquartered at [Joo Chiat Police Station](/wiki/Singapore_Police_Force#Defunct_Units/Facilities) in East Coast Road under the former NPP system, the present headquarters took over jurisdiction of the division on 1 August 1987. The rest of the NPCs came online when the NPC system was implemented here on 17 December 2000. When the Geylang Police Division was closed in December 2000, 'G' Division took over half of its areas of control, while the rest came under the [Ang Mo Kio Police Division](/wiki/Ang_Mo_Kio_Police_Division) and [Central Police Division](/wiki/Central_Police_Division), thus extending its responsibilities to critical areas and sites around [Geylang Road](/wiki/Geylang_Road) and the [National Stadium](/wiki/National_Stadium,_Singapore), where major events regularly require support from the entire division and beyond, such as during the [National Day Parade](/wiki/Singapore_National_Day_Parade) when it is held there. Other major events handled by the division include the [Singapore Airshow](/wiki/Singapore_Airshow) exhibitions in Changi, and the [Hari Raya Puasa](/wiki/Hari_Raya_Puasa) bazaars at [Geylang Serai](/wiki/Geylang_Serai). ## Establishments - Bedok Division HQ - Bedok Neighbourhood Police Centre - Kaki Bukit Neighbourhood Police Post - Eunos Neighbourhood Police Post - Bedok Neighbourhood Police Post - Chai Chee Neighbourhood Police Post - Kampong Kembangan Neighbourhood Police Post - Siglap Neighbourhood Police Post - Tanah Merah Neighbourhood Police Post - Changi Neighbourhood Police Centre - Changkat Neighbourhood Police Post - Geylang Neighbourhood Police Centre - Geylang Serai Neighbourhood Police Post - Joo Chiat Neighbourhood Police Post - Kampong Ubi Neighbourhood Police Post - Marine Parade Neighbourhood Police Centre - Marine Parade Neighbourhood Police Post - Pasir Ris Neighbourhood Police Centre - Tampines Neighbourhood Police Centre - Tampines East Neighbourhood Police Post - Tampines North Neighbourhood Police Post ## Kovan double murders Senior Staff Sergeant Iskandar bin Rahmat, a 14-year veteran investigation officer from Bedok Police Division, was convicted and sentenced to death in the Kovan Double Murders case. Iskandar has been on death row since 2023, after failing in his appeal and request for president clemency against the death sentence for killing a car workshop owner and the man's son on 10 July 2013; the case received extensive media attention and became known as the Kovan Double Murders. Iskandar was found to be motivated to rob Tan Boon Sin, 67 and Tan Chee Heong, 42 to clear his bank debts. Iskandar defended his actions, claiming that he had planned a rob-and-run job and that he reacted in self defence when the father-son pair attacked him separately. The [High Court](/wiki/High_Court_(Singapore)) rejected his defence and sentenced him to death. The [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore) also later rejected his defence and other arguments that were brought up only towards the end of the case, saying that \"accused persons should and are expected to put their best case forward at the earliest time possible\". 12 years after the murders, Iskandar was hanged on 5 February 2025. - Bedok Police Division\n",
  "language": "en",
  "processed_at": "2026-01-12T09:55:46.384561",
  "title": "Bedok Police Division",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Bedok_Police_Division"
}