{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:55:54.114085"
  },
  "content": "Malay Islamic bathing traditionThe topic of this article **may not meet Wikipedia's general notability guideline**. Please help to demonstrate the notability of the topic by citing reliable secondary sources that are independent of the topic and provide significant coverage of it beyond a mere trivial mention. If notability cannot be shown, the article is likely to be merged, redirected, or deleted. *Find sources:* \"Belimau\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(April 2016)* *(Learn how and when to remove this message)* The **Belimau** bath is a [Malay Indonesian](/wiki/Malay_Indonesians) tradition, observed in order to welcome the month of [Ramadan](/wiki/Ramadan), especially in [Bangka Belitung](/wiki/Bangka_Belitung) and [Riau](/wiki/Riau) provinces. The tradition has been carried down for generations among the [Minangkabau people](/wiki/Minangkabau_people) before Islam arrived in Indonesia, as they were praciticing [Hinduism](/wiki/Hinduism_in_Indonesia), whereby this ceremony could have been inspired by [Makara Sankranti](/wiki/Makar_Sankranti). Belimau consists of washing or bathing for physical and spiritual purification using [limau](/wiki/Calamansi) water. In the Pacific Islands, the Belimau tradition ended about 300 years ago, but it was revived around 2006. Since then, local governments have promoted the Belimau bath tradition as a part of [religious tourism](/wiki/Religious_tourism). The Belimau Bath ceremony is held once a year, one week before Ramadan. - Ramadan in Indonesia - [Islam in Indonesia](/wiki/Islam_in_Indonesia) This [Islam-related](/wiki/Islam) article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T09:55:54.113594",
  "title": "Belimau",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Belimau"
}