{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:55:58.200793"
  },
  "content": "Head of the Malay nobility**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **relies excessively on references to primary sources**. Please improve this article by adding secondary or tertiary sources. *Find sources:* \"Bendahara\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(August 2018)* *(Learn how and when to remove this message)*This article includes a list of references, related reading, or external links, **but its sources remain unclear because it lacks inline citations**. Please help improve this article by introducing more precise citations. *(April 2020)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* A ***bendahara*** ([Jawi](/wiki/Jawi_script): بندهار‎) was an important administrative position within classical [Malay](/wiki/Malays_(ethnic_group)) kingdoms comparable to a [vizier](/wiki/Vizier) prior to the [European colonisation of Southeast Asia](/wiki/European_colonisation_of_Southeast_Asia) during the 19th century. A *bendahara* was appointed by a [sultan](/wiki/Sultan) and was a hereditary post with candidates selected from the male descendants of the *bendahara*. The *bendahara* and the sultan often shared the same lineage, and the former could at times be more powerful than the sultan. ## Tasks of the *bendahara* The closest post which is comparable to the post of the [vizier](/wiki/Vizier) as the Malay kingdoms were Islamic kingdoms. As the *bendahara* was the head of the nobility, the status conferred certain responsibility. The *bendahara* was the backbone of the Malay Sultanate. For the ancient kingdoms of [Malacca](/wiki/Malacca_Sultanate) and [Johor](/wiki/Johor_Sultanate), there were many tasks and responsibilities but the primary ones were:[*citation needed*] - coronation and installation of the sultan - responsibility of the welfare of the sultan - adviser to the sultan on affairs of the state based on [Sharia](/wiki/Sharia) and [Adat](/wiki/Adat) (Prevailing norms and values) - responsibility over royal marriages, births and funerals - responsibility over royal succession if the sultan dies without an heir - acting as a [vicegerent](/wiki/Vicegerent) if the sultan is still young - acting on any command of the sultan. The legitimacy of the sultan lay with the *bendahara*. The *bendahara* always consulted the other nobles before arriving at a decision. The *bendahara* and nobles did this for the well-being of the subjects and was essential if there were problems in the state. These tasks were more extensive than any vizier or the modern prime minister.[*citation needed*] The involvement of the British and the Dutch in the administration of the Malay States and the subsequent independence of Malaysia and Indonesia has reduced the *bendahara* to a symbolic title. ## History Though it is unclear when the title was first used, the [Sultanate of Malacca](/wiki/Sultanate_of_Malacca) had several influential *bendaharas*. The most famous is [Tun Perak](/wiki/Tun_Perak). Under Tun Perak's service which spanned several sultans, Malacca reached its height in the late 15th century. According to the *[Malay Annals](/wiki/Malay_Annals)* and the *[Hikayat Hang Tuah](/wiki/Hikayat_Hang_Tuah)*, the *bendahara* secretly saved the life of [Hang Tuah](/wiki/Hang_Tuah), a [laksamana](/wiki/Laksamana) the sultan had ordered killed. In 1612, *Bendahara* [Tun Sri Lanang](/wiki/Tun_Sri_Lanang) of the [Sultanate of Johor](/wiki/Sultanate_of_Johor) was commissioned by Sultan Alauddin Riaayat Shah of Johor to compile Malay history and record it into a book. The book is known as the *Malay Annals* and is an important literary piece in [Malay language](/wiki/Malay_language) history. In 1699, *Bendahara* Abdul Jalil became Sultan Abdul Jalil IV of Johor after the previous sultan, [Mahmud Shah II](/wiki/Mahmud_Shah_II) was murdered, leaving no heir behind. After the rule of Sultan Abdul Jalil IV, the *bendahara* was awarded [Pahang](/wiki/Pahang) as his personal fief. *Bendahara* Tun Abbas and his descendants ruled Pahang continuously until [Tun Mutahir](/wiki/Tun_Mutahir_of_Pahang), was deposed in a [civil war](/wiki/Pahang_Civil_War) in 1863. The current [Terengganu](/wiki/Terengganu) sultanate was founded by Sultan Zainal Abidin I of Terengganu in 1708. He was the son of [Tun Habib Abdul Majid](/wiki/Tun_Habib_Abdul_Majid), a 17th-century *bendahara* of Johor.[*citation needed*] ## *Bendahara* of Malacca and Johor - Tun Perpatih Muka Berjajar, Bendahara - Tun Perpatih Tulus, Bendahara of Malacca - Raden Bagus, Bendahara of Malacca - Raden Anum, Bendahara Sri Amar DiRaja, Bendahara of Malacca - Tun Perpatih Sedang, Bendahara Sri Wak Raja, Bendahara of Malacca - Tun Perpatih Putih, Bendahara Paduka Tuan, Bendahara of Malacca - [Tun Perak](/wiki/Tun_Perak), Bendahara Paduka Raja, Bendahara of Malacca - [Tun Mutahir](/wiki/Tun_Mutahir_of_Malacca), Bendahara Seri Maharaja, Bendahara of Malacca - Tun Rosmawe, Bendahara Paduka Tuan, Bendahara of Malacca After the fall of Malacca to the Portuguese, the Malacca Sultanate was succeeded by the Johore Sultanate. - Tun Khoja, Bendahara Paduka Raja, Bendahara of Johore - Tun Biajid, Bendahara Seri Maharaja, Bendahara of Johore - Tun Mahmud, Bendahara Tun Narawangsa, Bendahara of Johore - Tun Isap Misai, Bendahara Seri Maharaja, Bendahara of Johore - [Tun Sri Lanang](/wiki/Tun_Sri_Lanang), Bendahara Paduka Raja, Bendahara of Johore. He was captured by the Achenese forces and opted to remain in Acheh. The following Bendaharas were sidelined by the palace following the rise of Laksamana Paduka Tuan: - Tun Anum, Bendahara Seri Maharaja, Bendahara of Johore - Tun Jenal, Bendahara Paduka Raja, Bendahara of Johore - Tun Mat Ali, Bendahara Paduka Tuan, Bendahara of Johore - Tun Rantau, Bendahara Seri Maharaja, Bendahara of Johore. He was captured by the Jambi forces. - [Tun Habib Abdul Majid](/wiki/Tun_Habib_Abdul_Majid), Bendahara Seri Maharaja, Bendahara Padang Saujana, restored the position of the Bendahara in the palace. - Tun Abdul Jalil, Bendahara Paduka Raja, became Sultan Abdul Jalil IV of Johor, following the death of [Sultan Mahmud II](/wiki/Mahmud_Shah_II_of_Johor). - Tun Abdullah, Bendahara Seri Maharaja, Bendahara of Johore - Tun Abdul Jamal, Bendahara Paduka Raja, Bendahara of Johore - Tun Abbas, Bendahara Seri Maharaja, Bendahara of Johore - Tun Hassan, Bendahara Seri Maharaja, Bendahara of Johore - Tun Abdul Majid, Bendahara Paduka Raja, Bendahara of Johore After the succession of Sultan Mahmud Shah III in Johor, the *Bendahara* of Johor were granted Pahang as a personal fief. Thereafter the *Bendahara* of Johor were known as the *Bendahara* in Pahang. They are also known as \"Raja Bendahara\" for their status as the rulers of Pahang and as a [vassal](/wiki/Vassal) state of the Johore Sultanate. ### *Bendahara* in Pahang - [Tun Abdul Majid](/wiki/Tun_Abdul_Majid_of_Pahang), Raja Bendahara Pahang I (1777–1802) - [Tun Muhammad](/wiki/Tun_Muhammad_of_Pahang), Raja Bendahara Pahang II - [Tun Koris](/wiki/Tun_Koris_of_Pahang), Bendahara Paduka Raja, Raja Bendahara Pahang III (1803–1806) - [Tun Ali](/wiki/Tun_Ali_of_Pahang), Bendahara Siwa Raja, Raja Bendahara Pahang IV (1806–1847) - [Tun Mutahir](/wiki/Tun_Mutahir_of_Pahang), Bendahara Seri Maharaja, Raja Bendahara Pahang V (1847–1863). He was the last reigning Raja *Bendahara* of Pahang. He was ousted by his brother Wan Ahmad who was later proclaimed as Sultan of Pahang after the dismemberment of the Raja *Bendahara* rule in Pahang. ## *Bendahara* in Brunei In Brunei, the title of Pengiran *Bendahara* was given to [royal family members](/wiki/House_of_Bolkiah) and to serve as a significant [military commander](/wiki/Commanding_officer). - [Awang Pateh Berbai](/wiki/Sultan_Ahmad_of_Brunei) (until 1408) became the first Bendahara of Brunei and given title of [Pengiran Bendahara](/wiki/Vizier_(Brunei)). He would hold this position until his accession as [Sultan of Brunei](/wiki/Sultan_of_Brunei). - [Raja Sakam](/wiki/Bendahara_Sakam) is known locally as a [folk hero](/wiki/Folk_hero) and the son of [Sultan Abdul Kahar](/wiki/Abdul_Kahar). In 1578, he led the forces of [Brunei](/wiki/Bruneian_Sultanate_(1368%E2%80%931888)) to successfully fight against the [Spanish](/wiki/Spanish_Empire) in [Kota Batu](/wiki/Kota_Batu,_Brunei) during the [Castilian War](/wiki/Castilian_War). - Pengiran Seri Ratna was to be appointed as the new bendahara of the planned [Spanish](/wiki/Spanish_Empire) [tributary state](/wiki/Tributary_state) of Brunei during the [Castilian War](/wiki/Castilian_War). - [Abdul Hakkul Mubin](/wiki/Abdul_Hakkul_Mubin) was the bendahara when he and his follower [garroted](/wiki/Garrote) [Sultan Muhammad Ali](/wiki/Muhammad_Ali_(Brunei)), resulting in the [Brunei Civil War](/wiki/Bruneian_Civil_War_of_1660). - [Muhyiddin](/wiki/Muhyiddin_of_Brunei) was the bendahara installed by Sultan Abdul Hakkul Mubin, where he would later go up against during the Brunei Civil War. - Pengiran Anak Untong was the non-*gahara* (pure royal lineage) son of [Sultan Hussin Kamaluddin](/wiki/Hussin_Kamaluddin). He moved to [Sabah](/wiki/Sabah) and made his home in the \"Dumpil Meruntum\" region—land that his father had given him. - [Pengiran Muda Muhammad Alam](/wiki/Muhammad_Alam) was the bendahara prior to his accession to the throne in 1826. - [Pengiran Muda Hashim](/wiki/Pengiran_Muda_Hashim) was the bendahara from the 1830s until his assassination in 1846. - Pengiran Muhammad Yusuf (Usop) was the bendahara for a short period following the absence of Pengiran Muda Hashim. Even now, the [wazir](/wiki/Vizier_(Brunei)) class of [aristocracy](/wiki/Aristocracy) still goes by the title bendahara, although they now refer to it as Pengiran Bendahara Seri Maharaja Permaisuara. - Pengiran Anak Besar Muhammad (1883–1917) was the grandson of Sultan Muhammad Kanzul Alam. He was bestowed the title in 1883 by [Sultan Abdul Momin](/wiki/Abdul_Momin). - Pengiran Anak Abdul Rahman (1917–1943) was the grandson of [Sultan Hashim Jalilul Alam Aqamaddin](/wiki/Hashim_Jalilul_Alam_Aqamaddin). He was bestowed the title in 1947 by [Sultan Muhammad Jamalul Alam II](/wiki/Muhammad_Jamalul_Alam_II). - [Pengiran Muda Omar Ali Saifuddien](/wiki/Omar_Ali_Saifuddien_III) (1947–1950) was the son of Sultan Muhammad Jamalul Alam II. He was bestowed the title in 1947 by his brother, [Sultan Ahmad Tajuddin](/wiki/Ahmad_Tajuddin). - Pengiran Anak Muhammad Yassin (1950–1952) was the grandson of [Sultan Omar Ali Saifuddin II](/wiki/Omar_Ali_Saifuddin_II). He was bestowed the title in 1947 by Sultan Omar Ali Saifuddien III. - [Pengiran Anak Hashim](/wiki/Hashim_Abdul_Rahman) (1950–1951) was the great-grandson of Sultan Hashim Jalilul Alam Aqamaddin. He was betsowed the title in 1952 by Sultan Omar Ali Saifuddien III. - [Pengiran Muda Sufri Bolkiah](/wiki/Prince_Sufri_Bolkiah) (1979–present) is the son of Sultan Omar Ali Saifuddien III. He was bestowed the title in 1979 by his brother, [Sultan Hassanal Bolkiah](/wiki/Hassanal_Bolkiah). ## Modern-day usage In modern [Malaysia](/wiki/Malaysia), it is typical to refer to the equivalent position as *[menteri besar](/wiki/Heads_of_state_governments_of_Malaysia)*, a title used in states that retain [state monarchies](/wiki/Monarchies_of_Malaysia). Though a bendahara's duties are similar to those of a head of government, the two terms are not interchangeable. One clear difference is in the amount of political power. In ancient times, the bendahara was typically the highest-ranking official after the sultan but the sultan retained ultimate authority. The sultan was not answerable to the bendahara. Current titles used: - Tengku Bendahara of Selangor - Tengku Sharif Bendahara of Perlis - Tengku Sri Bendahara Raja of Terengganu - Tunku Bendahara of Kedah - Tengku Bendahara of Kelantan - Tengku Arif Bendahara of Pahang - Tunku Aris Bendahara of Johor - Bendahara Paduka Raja of Perak (1528–1770) / Raja Bendahara of Perak (1770–1958) / Bendahara Seri Maharaja of Perak (since 1958) In [Indonesia](/wiki/Indonesia), a [treasurer](/wiki/Treasurer) is commonly referred to as *bendahara*. In Malaysia the equivalent term for the treasurer of a small organisation is *bendahari*. In the [Philippines](/wiki/Philippines), the term *bendahara* was recorded by [Antonio Pigafetta](/wiki/Antonio_Pigafetta) during the [Ferdinand Magellan](/wiki/Ferdinand_Magellan) expedition to refer to the Prime Minister of the [Rajahnate of Cebu](/wiki/Rajahnate_of_Cebu) who was the brother of Rajah Humabon, king of that Polity. - [Raja bendahara](/wiki/Raja_bendahara) - [Laksamana](/wiki/Laksamana) - [Shahbandar](/wiki/Shahbandar) - [Temenggung](/wiki/Temenggung) ## Bibliography - R.O. Windstedt, *Bendaharas and Temenggungs*, Journal of Malayan Branch of Royal Asiatic Society, Vol X part I, 1932 - R.O. Windstedt, *Early Rulers of Perak, Pahang and Acheh*, Journal of Malayan Branch of Royal Asiatic Society, Vol X part I, 1932 - R.O. Windstedt, *A History of Johore*, Journal of Malayan Branch of Royal Asiatic Society, Vol X part III, 1932 - (Tun) Suzana (Tun) Othman, *Institusi Bendahara; Permata Melayu yang hilang*, 2002, [ISBN](/wiki/ISBN_(identifier)) 983-40566-6-4 - (Tun) Suzana (Tun) Othman, *Tun Seri Lanang: Sejarah dan Warisan Tokoh Melayu Tradisional*, 2008, [ISBN](/wiki/ISBN_(identifier)) 978-983-43485-6-4 - (Tun) Suzana (Tun) Othman, *Perang bendahara Pahang, 1857-63: pensejarahan semula menelusi peranan British*, 2007, [ISBN](/wiki/ISBN_(identifier)) 978-983-195-282-5\n",
  "language": "en",
  "processed_at": "2026-01-12T09:55:58.200333",
  "title": "Bendahara",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Bendahara"
}