{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:56:05.843391"
  },
  "content": "Bakery chain in Singapore **Bengawan Solo** is a [Singaporean](/wiki/Singapore) [bakery](/wiki/Bakery) chain. It has 45 outlets islandwide with a factory at 23 Woodlands Link. The bakery is known for making and selling [Indonesian](/wiki/Indonesians) style [kueh](/wiki/Kueh), [buns](/wiki/Bun), [cakes](/wiki/Cakes), [cookies](/wiki/Cookies) and [mooncakes](/wiki/Mooncake) because the owner and founder, Anastasia Liew, is an Indonesian who migrated to Singapore from Palembang in early 1970s. All products are prepared at the central kitchen in [Woodlands](/wiki/Woodlands,_Singapore) and delivered to the stores 2-3 times daily. Pandan Chiffon, Lapis Cake, Pineapple Tarts, Pandan Cheese Rolls, Lapis Sagu, Ondeh-Ondeh and various Cookies are some of the most popular items in the shop. ## History Bengawan Solo was founded in 1975 by [Anastasia Tjendri-Liew](/wiki/Anastasia_Tjendri-Liew), an [Indonesian-Chinese](/wiki/Indonesian-Chinese) who emigrated from [Palembang](/wiki/Palembang), [Indonesia](/wiki/Indonesia) to Singapore. Tjendri-Liew had initially started an unlicensed home baking business producing [butter](/wiki/Butter), [kueh lapis](/wiki/Kue_lapis), and [chiffon cakes](/wiki/Chiffon_cake) in her [HDB](/wiki/Housing_and_Development_Board) apartment at [Marine Parade](/wiki/Marine_Parade), which was popular such that she supplied her products to supermarkets and shops (such as a department store in [Lucky Plaza](/wiki/Lucky_Plaza)) before officers from the [Ministry of Environment](/wiki/Ministry_of_Sustainability_and_the_Environment) shutdown her business in 1979. However, since the demand for Tjendri-Liew's baking products continued, she decided to open a shop in Marine Terrace a few months later. Tjendri-Liew managed to secure a low starting rent of S$1,200 only because the shop was vacant for 1–2 years due to the previous tenants not doing well. She decided to name her business Bengawan Solo, named after the Indonesian [song](/wiki/Bengawan_Solo_(song)) and [river](/wiki/Bengawan_Solo_River) of the same name. Her business continued to remain popular, only increasing further following a positive review from a newspaper. Urged by her customers to set up a shop in a more 'central location', Tjendri-Liew opened Bengawan Solo's second outlet in 1983 at Centrepoint shopping mall, [Orchard Road](/wiki/Orchard_Road). Following the opening of three more outlets, by 1987, Bengawan solo needed a central kitchen. The kitchen, which was a 'first' for Singapore's confectionery industry, was built on a 9,500 sq ft. plot of land in Harvey Road. Other future baking companies followed suit, utilising a 'centre kitchen' to supply its outlets. - Official website This food and/or confectionery corporation or company-related article is a stub. You can help Wikipedia by expanding it. - v - t - e This [Singaporean corporation or company](/wiki/List_of_companies_of_Singapore) article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T09:56:05.842890",
  "title": "Bengawan Solo (company)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Bengawan_Solo_(company)"
}