{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:56:19.789835"
  },
  "content": "* *This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **relies excessively on references to primary sources**. Please improve this article by adding secondary or tertiary sources. *Find sources:* \"Bethany Independent-Presbyterian Church Singapore\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(October 2010)* *(Learn how and when to remove this message)*This article **relies largely or entirely on a single source**. Relevant discussion may be found on the talk page. Please help improve this article by introducing citations to additional sources. *Find sources:* \"Bethany Independent-Presbyterian Church Singapore\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(October 2010)* *(Learn how and when to remove this message)*Church in Singapore , Singapore **Bethany Independent-Presbyterian Church** (IPC) is an independent church located between the [Paya Lebar](/wiki/Paya_Lebar) and [Serangoon](/wiki/Serangoon) areas of central [Singapore](/wiki/Singapore). It is the mother church of the IPC Family, which spans [Singapore](/wiki/Singapore), [India](/wiki/India), [Australia](/wiki/Australia) and [Myanmar](/wiki/Myanmar). The church's teachings and practices are based on a belief in the [inerrancy](/wiki/Biblical_inerrancy) of the [Bible](/wiki/Bible) and its final authority in faith and life. The church maintains a [Bible study](/wiki/Bible_study_(Christian)) resource on its website as well as audio and video recordings of weekly messages. ## History Bethany IPC grew out of a Sunday School outreach to the [Seletar](/wiki/Seletar) Hills estate by Bible Presbyterian Church of Singapore. It was founded as a house church in 1973 with 25 members and moved to its current location at 301 Upper Paya Lebar Road, Singapore 534934 in 1993. ## Sunday Worship Services - Morning Worship 10.30am - Teens’ Worship 10.30am - Children's Worship 10.30am - Evening Worship 4pm - Bilingual Worship 4pm ## Ministries ### Sunday School The [Sunday School](/wiki/Sunday_School) Ministry caters to children and adults. It aims to instruct every Christian in the [Word of God](/wiki/Word_of_God_(Bible)) and equip each one for effective service. ### Weekday Meetings - Bible Studies - Prayer Meetings ### Fellowship groups - Young People's Group - Young Adults’ Group - Adults’ Ministry and Discipleship groups ### Camps & seminars - Family Camp (March school holidays) - Young Adults’ Group Seminar (2-3 times/ year) - Youth Conference (December school holidays) - Junior Camp (June school holidays) ### Music ministry - Choirs (One Voice, Youth, Evergreens, Crossroads, Remnant) - Handbells & Chimes - Official website This article about a church building or other Christian place of worship in Singapore is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T09:56:19.789335",
  "title": "Bethany Independent-Presbyterian Church Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Bethany_Independent-Presbyterian_Church_Singapore"
}