{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:56:20.810659"
  },
  "content": "Historical building in Singapore **Beulah House** is a bungalow on Gilstead Road in [Novena, Singapore](/wiki/Novena,_Singapore). It housed an eye clinic before it was acquired by the [Life Bible-Presbyterian Church](/wiki/Life_Bible-Presbyterian_Church) in 1990. ## Description The bungalow was designed \"in concept, but not in totality\" in the [Edwardian Baroque](/wiki/Edwardian_architecture) style, which was common in Singapore before the rise in popularity of Art Deco and Modernism on the island. The asymmetrical building features a turret with a conical roof of \"fish-scale\" tiles made of clay. The turret also features \"ornate\" decorative dentils and relief mouldings. The ground floor features semi-circular arches featuring keystones, as well as plaster panels with mouldings and cornices. The original gateposts, which were shifted to allow for a wider entrance, remain standing. ## History The local authorities approved plans for a single-storey bungalow on the site on 14 October 1919. A revised plan, which included two two-storey bungalows with an attached workers' quarters was approved on 24 November. The bungalow was likely built somewhere between 1919 and 1920. The developer of the project was Florence Boudewyn. One of the bungalows was later demolished and redeveloped into high-rise apartments, while the other housed an eye clinic for several decades. Over the years, the remaining bungalow received \"many unauthorised ad hoc extensions and alterations.\" In 1990, the bungalow was acquired by the [Life Bible-Presbyterian Church](/wiki/Life_Bible-Presbyterian_Church), which is located across the road from the bungalow. The church had reportedly been seeking to purchase the property for several decades as a \"potential expansion to the Church activities.\" On 10 February 1992, the church received approval from the authorities to use the building as a hostel. It was gazetted for conservation by the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) on 19 May 2003. The church later restored the building, which involved removing the alterations it had received, including its mezzanine flooring and the boarding up of its arches windows and floors, and reinstating and recovering its original features, such as its terrazzo flooring. Broken tiles were replaced by identical ones made in Vietnam. It was renamed the Beulah House by the church and serves as a venue for the church's \"supplementary activities\". The restoration project received the Urban Redevelopment Authority Architectural Heritage Award in 2009. 1°18′55″N 103°50′20″E﻿ / ﻿1.31536°N 103.83879°E﻿ / 1.31536; 103.83879\n",
  "language": "en",
  "processed_at": "2026-01-12T09:56:20.810212",
  "title": "Beulah House",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Beulah_House"
}