{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:56:27.311691"
  },
  "content": "Park in Bidadari, Singapore The **Bidadari Park** is a wooded [urban park](/wiki/Urban_park) located at [Bidadari](/wiki/Bidadari,_Singapore), bounded by Bidadari Park Drive and Upper Aljunied Road, in Singapore. ## Background The site was once part of the Malay section of the [Bidadari Cemetery](/wiki/Bidadari_Cemetery) before exhumation took place from 2001 to 2006, which also included about 68,000 Malay graves, most of which were reburied at the Pusara Abadi Cemetery in [Choa Chu Kang](/wiki/Choa_Chu_Kang). With exhumation of the cemetery having been completed by 2006, flora and fauna thrived at the site and it became a resting spot for migratory birds and endangered species, with sightings of almost 146 bird species. The area's greenery and higher terrain made it a common stopover point for migratory birds since the 2000s. Thus, in 2012, the [Nature Society](/wiki/Nature_Society_(Singapore)) submitted a proposal to conserve a portion of the park for bird populations to continue to reside or nest there. The park officially opened on 3 September 2024, with the original woodland consisting of more than 300 trees retained as the park's core habitat to benefit migratory birds. ## Features ### Alkaff Lake A 1.8-hectare artificial lake, Alkaff Lake is Singapore's first [stormwater retention pond](/wiki/Retention_basin), capable of holding up to 40,000 cubic metres of water to prevent flash floods. To ensure public safety, the lake is equipped with automatic water level sensors, warning lights, and multi-language audio announcements which activate when water levels approach 2 metres. Alkaff Lake connects water to downstream drainage systems along Happy Avenue, before discharging to Pelton Canal and eventually the [Kallang River](/wiki/Kallang_River). ### Raptor Nest Platform The first raptor nest platform in Singapore's parks, the 20-metre tall platform provides a nesting site for [raptors](/wiki/Raptor_(bird)) in the park. The platform aims to preserve Bidadari's role as a stopover site for migratory birds. ### Memorial Garden The park is currently in integration with the nearby [Bidadari Garden](/wiki/Bidadari_Garden) which was first built in 2004. The integrated space will be known as the **Memorial Garden**, due for completion in late 2025. Christian, Muslim and Hindu artefacts from the original Bidadari Garden will be preserved to honor the site's heritage.\n",
  "language": "en",
  "processed_at": "2026-01-12T09:56:27.311277",
  "title": "Bidadari Park",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Bidadari_Park"
}