{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:56:29.018298"
  },
  "content": "Waterpark in Singapore (1977–2016) **Big Splash** was a [waterpark](/wiki/Waterpark) located at [East Coast Park](/wiki/East_Coast_Park) in [Singapore](/wiki/Singapore) that operated between 1977 and 2006. It was later redeveloped into a dining and recreation area named **Playground @ Big Splash**, which opened in 2008. The site was demolished in 2017. ## History Big Splash was built in 1977 by Singapore Aquatic Sports Pte Ltd (owned by Goldhill Properties) on a 2.8-hectare site of the [reclaimed land](/wiki/Reclaimed_land) in the new East Coast Park. It was a project of the Parks and Recreation Department of the [Ministry of National Development](/wiki/Ministry_of_National_Development_(Singapore)), and built at the cost of S$6 million. The waterpark featured an 85-metre-long (279 ft) [water slide](/wiki/Water_slide), said at the time to be the longest and highest in the world. There were several other pools, including a wave pool and a 200 m-long (660 ft) flow pool, as well as facilities such as an open-air theatre, a restaurant and food kiosks, and an arcade. The park opened on 23 July 1977 at 8 a.m. All 5 of the pools in the complex were filled with sea water and had a sand bottom to create the impression of a beach. The largest pool (at the base of the 85-metre slide) was reported to be able to accommodate 1,380 people. Admission fees were $1.50 for adults and $1.00 for children for the first two hours on weekdays, with a subsequent fee of $0.50 for every subsequent two hours; on weekends the admission fees were $2.00 for adults and $1.50 for children for the first two hours and $1 and $0.50 respectively for every subsequent two hours. The air-conditioned restaurant was said to have pioneered the 'tank to table' concept of serving seafood. From 1986 until at least 2002, Big Splash was owned by Potential Investments Pte Ltd. Although Big Splash was initially very popular, over the decades it declined and became less attractive. In 2002, it was closed for a four-month facelift, reopening with new facilities such as a dive school and a bicycle kiosk. In 2006 it closed for major redevelopment. When it reopened as Playground @ Big Splash in March 2008, the water slides and pools were gone and the entire compound had been redeveloped into a dining and lifestyle destination. It was home to a range of dining options, from fast food outlets and casual cafes to upmarket restaurants and bars, as well as an inline skating school, mini-golf course, gym and other amenities. In July 2016 it was announced that Playground @ Big Splash will close in October 2016. The last day of operations was 21 October 2016. The site lease had expired and was returned to the government for redevelopment. Its structures was later demolished in 2017 while its iconic tower was preserved for upcoming future recreational developments. In March 2021, the Coastal PlayGrove was completed on the former site of Big Splash and was officially opened on 28 March 2021. - Official website - Big Splash on Facebook\n",
  "language": "en",
  "processed_at": "2026-01-12T09:56:29.017808",
  "title": "Big Splash, Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Big_Splash,_Singapore"
}