{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:56:34.475665"
  },
  "content": "Retail technology company **Bindo** is an American [retail](/wiki/Retail) [technology](/wiki/Technology) company, headquartered in [New York, NY](/wiki/New_York,_NY) with APAC headquarters in [Hong Kong](/wiki/Hong_Kong). Its core product is a cloud-based [point of sale](/wiki/Point_of_sale) system that enables online shopping for the end consumer. Bindo's [hyperlocal](/wiki/Hyperlocal) marketplace allows merchants to run their stores and merchandise online and connect them with consumers in their neighborhood. Bindo creates a real-time product graph that connects brands, consumers, and merchants. ## History Bindo was founded in October 2010, by JoMing Au, Brad Lauster and Jason Ngan. It was initially started by two friends, Ngan and Au, who both sold electronics on eCommerce websites during their college days. After graduation, Au worked in aerospace and Ngan in financial engineering. After a while, on the side, they started to work on Bindo with the initial intention of trying to index available local inventory online. Ngan then met Lauster who shared a vision that shopping online at local stores shouldn’t be so difficult. They then decided to work together to create a marketplace to strengthen local economies by indexing the products and making it accessible through the local stores. Bindo was initially launched in [Manhattan](/wiki/Manhattan). The idea to start a hyperlocal marketplace got the attention of social media expert [Gary Vaynerchuk](/wiki/Gary_Vaynerchuk), who then went on to become one of Bindo’s investors. Bindo had gained 180,000 customers and processed over $500 million in sales. in May 2014, Bindo raised $1.8 MM, mainly led by Vaynerchuk, Singapore-based East Ventures and New York-based [Metamorphic Ventures](/wiki/Metamorphic_Ventures), along with angel investors. ## Reception After its beta launch in Manhattan, the application grabbed the attention of 180,000 customers. According to critics, the application is similar to other POS application launched in the recent past. Ngan later clarified that Bindo POS differentiates from its other iPad POS competitors by focusing more on building a hyperlocal marketplace and building an online-to-offline network. - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T09:56:34.475068",
  "title": "Bindo",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Bindo"
}