{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:56:38.367078"
  },
  "content": "R&D Hub in Singapore **Biopolis**[a] is a [research and development](/wiki/Research_and_development) centre for [biomedical sciences](/wiki/Health_sciences) in [Singapore](/wiki/Singapore). It is located at [one-north](/wiki/One-north) in [Buona Vista](/wiki/Buona_Vista), and is close to the [National University of Singapore](/wiki/National_University_of_Singapore), the [Singapore Polytechnic](/wiki/Singapore_Polytechnic), the [Singapore Institute of Technology](/wiki/Singapore_Institute_of_Technology), the [National University Hospital](/wiki/National_University_Hospital), the [Singapore Science Park](/wiki/Singapore_Science_Park), [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)), [ESSEC](/wiki/ESSEC) Business School, [INSEAD](/wiki/INSEAD) Business School, and [Fusionopolis](/wiki/Fusionopolis). This campus is dedicated to providing space for biomedical research and development activities and promoting [peer review](/wiki/Peer_review) and [collaboration](/wiki/Collaboration) among the private and public [scientific community](/wiki/Scientific_community). ## Development ### Phase 1 *Biopolis Phase 1*, designed by world-renowned architect [Zaha Hadid](/wiki/Zaha_Hadid), is a 185,000 m2 (2,000,000 ft²) biomedical complex of seven buildings that were constructed from June 2003 to March 2004 at a cost of S$500 million. They are namely: Nanos, Genome, Helios, Chromos, Proteos, Matrix and Centros. Several government agencies, publicly funded research institutes and research labs of pharmaceutical and biotechnological companies are located there. ### Phase 2 *Biopolis Phase 2* was completed in October 2006 with a seven-storey 37,000 m2 complex comprising two blocks, Neuros and Immunos. The two blocks will house private research institutes focused on [neuroscience](/wiki/Neuroscience) and [immunology](/wiki/Immunology) respectively. The complex cost S$70 million and constructed over 18 months. The new addition increases the Biopolis research complex to a total of 222,000 m2, or about half the size of [Suntec City](/wiki/Suntec_City). ### Phase 3 *Biopolis Phase 3*, comprising two blocks, Synapse and Amnios, was awarded to Crescendas Group by JTC Corporation under a design-build-own-operate basis with a 30+30 year lease. It started construction in the 3rd quarter of 2009 and was completed in the 2nd quarter of 2011. It measures 41,505 square meters in total, containing space for laboratories, research facilities, offices and retail operations. ### Phase 4 *Biopolis Phase 4*, the [Procter & Gamble](/wiki/Procter_%26_Gamble) Singapore Innovation Centre, was announced by JTC Corporation on 25 January 2010, and opened on 28 March 2014. It is the largest investment in a private research facility in Singapore at S$250 million. ### Phase 5 *Biopolis Phase 5*, consisting of Nucleos, was completed in 2014. It is used for pre-clinical trials. ### Phase 6 On 27 November 2019, Senior Minister of State for Trade and Industry [Koh Poh Koon](/wiki/Koh_Poh_Koon) announced that *Biopolis Phase 6* will be built by mid-2022 to meet demand from biotechnology start-ups. The expansion of Biopolis is part of initiatives to better support such start-ups. *Biopolis Phase 6* will add a further 35,000 sq m for research activities (including 2,000 sq m of laboratory spaces), with 6,000 sq m more for office and retail space. On 16 March 2020, [JTC Corporation](/wiki/JTC_Corporation) awarded the site to Ho Bee, which will design the 12-storey building, named Elementum, with elements of nature, technology and wellness incorporated. ## Features ### Amenities For the general public, Biopolis has eight shops, four [restaurants](/wiki/Restaurant), four [cafes](/wiki/Coffeehouse), a 300-seater [food court](/wiki/Food_court), a [fast food](/wiki/Fast_food) restaurant, a [pub](/wiki/Pub) and a childcare centre. ### Function rooms For its members, Biopolis has a 480-seater [auditorium](/wiki/Auditorium) and four 250-seater lecture [theaters](/wiki/Theaters). It also has 13 meeting rooms. ## Accommodation The Rochester is a major development in Vista Xchange at one-north. The [mixed-use development](/wiki/Mixed-use_development) comprises private residences, serviced apartments, hotel rooms, recreational and retail facilities. one-north Residences is another completed residential project in one-north. ## Biopolis arts programme An initiative of the one-north arts program, one-north Development Group (oDG) of [JTC Corporation](/wiki/JTC_Corporation) launched the first Biopolis Arts Program@one-north on 14 May 2002. oDG supports the nurturing of the local and overseas arts community, by way of co-developing and funding the art programs in one-north. All major developmental projects in one-north will be encouraged to contribute towards the funding of significant artwork in-situ. ## Notes - Official homepage - Singapore Acts as Haven for Stem Cell Research *The New York Times*, 16 August 2006 - Singapore's Biomedical Sciences Initiative - Singapore - The Biopolis of Asia 1°18′09″N 103°47′30″E﻿ / ﻿1.30250°N 103.79167°E﻿ / 1.30250; 103.79167\n",
  "language": "en",
  "processed_at": "2026-01-12T09:56:38.366631",
  "title": "Biopolis",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Biopolis"
}