{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:56:42.495007"
  },
  "content": "Rice-based dish from South Asia**This article contains [Hindi](/wiki/Devanagari), [Urdu](/wiki/Urdu_alphabet), [Arabic](/wiki/Arabic_alphabet), and [Persian](/wiki/Persian_alphabet) text.** Without proper rendering support, you may see [question marks, boxes](/wiki/Specials_(Unicode_block)#Replacement_character), unjoined letters running left to right, misplaced vowels, missing conjuncts, or other symbols instead of [Hindi](/wiki/Devanagari), [Urdu](/wiki/Urdu_alphabet) or [Arabic](/wiki/Arabic_alphabet), an appropriate script. **Biryani** is a [mixed rice dish](/wiki/Mixed_rice_dish) originating in [South Asia](/wiki/South_Asia), traditionally made with rice, meat ([chicken](/wiki/Chicken_as_food), [goat](/wiki/Goat_meat), [beef](/wiki/Beef)) or seafood ([prawns](/wiki/Shrimp_and_prawn_as_food) or [fish](/wiki/Fish_as_food)), vegetables, and [spices](/wiki/Spices). It was present in [Mughal-era India](/wiki/Mughal_Empire), though the precise date and place of origin are debated. It is thought to derive from a [Persian](/wiki/Persian_cuisine) rice dish, either *[pilau](/wiki/Pilaf)* or *birinj biryan*. The historian of food [Lizzie Collingham](/wiki/Lizzie_Collingham) states that the dish makes use of slow-cooking as in Persian pilau, combined with Persian-style yoghurt-[marinated](/wiki/Marinated) meat and a spicy [Indian](/wiki/Indian_cuisine) style of cooking; she suggests the dish was developed in the Mughal court kitchens. Biryani is one of the most popular dishes in South Asia and among the [South Asian diaspora](/wiki/South_Asian_diaspora). The dish is often associated with [the region's Muslim population](/wiki/Islam_in_South_Asia). Similar dishes are prepared in many other countries, often with local variations, and often brought there by South Asian diaspora populations. Biryani is the most-ordered dish on Indian online food ordering and delivery services, is used in weddings and celebrations throughout the region, and has been described as the most popular dish in India. ## Etymology The word biryani ([Hindi](/wiki/Hindi_language): बिरयानी, [Urdu](/wiki/Urdu_language): بریانی) is derived from *biryan* or *beriyan* ([Persian](/wiki/Persian_language): بریان), which means \"to fry\" or \"to roast\", said by [Merriam-Webster](/wiki/Merriam-Webster) probably to be related to [Sanskrit](/wiki/Sanskrit_language): भृज्जति *bhṛjjati* with the same meaning. The usage is from the Persian phrase *birinj biryan* (with [Persian](/wiki/Persian_language): برنج birinj, \"rice\"), meaning \"fried rice\". ## Origin ### Historical sources [Pilau](/wiki/Pilaf) (Persian: پلو 'plo', \"rice\") is a Persian rice dish, attested by the polymath and physician [Avicenna](/wiki/Avicenna) in 10th century Persia. The [Mughal](/wiki/Mughal_Empire) text *[Ain-i-Akbari](/wiki/Ain-i-Akbari)* (written 1589–1596), from the time of the emperor [Akbar](/wiki/Akbar), mentions both pilau and biryani, listing ingredients with required quantities for each: > Secondly, [dishes] in which meat and rice, &c., are used ... 2. *Duzdbiryán*. 10 [s[eer]](/wiki/Seer_(unit)) rice, 3½ s. [g'hí](/wiki/Ghee); 10 s. meat; ½ s. salt: this gives five dishes. 3. *Qimah Paláo*. Rice and meat as in the preceding; 4 s. g'hí; 1 s. peeled gram; 2 s. onions; ½ s. salt; ¼ s. fresh ginger, and pepper; cuminseed, cardamums and cloves, 1 d[han]. of each: this gives five dishes.[a] The *Ain-i-Akbari* further names a dish of spiced mutton as a biryani, this time without mentioning rice: > Thirdly, meats with spices... *Biryán*. For a whole *[Dashmandi](/wiki/Badakhshan)* sheep, take 2 [s[eer]](/wiki/Seer_(unit)) salt; 1 s[eer] [g'hí](/wiki/Ghee); 2 [m[āshā]](/wiki/Indian_units_of_measurement) saffron, cloves, pepper, cuminseed: it is made in various ways.\"[a] [Mughal](/wiki/Mughal_Empire) biryani timeline Period/EmperorDatesEvent([Timur](/wiki/Timur))(1370–1405)(No record of it in Central Asia at that time)[Akbar](/wiki/Akbar)1556–1605Mention of recipes in *[Ain-i-Akbari](/wiki/Ain-i-Akbari)* (1589–1596)[Shah Jahan](/wiki/Shah_Jahan)1628–1658Brief description by [Sebastien Manrique](/wiki/Sebastien_Manrique) in 1641[Aurangzeb](/wiki/Aurangzeb)1658–1707Mention in letters to his son, [Bahadur Shah I](/wiki/Bahadur_Shah_I)[Bahadur Shah Zafar](/wiki/Bahadur_Shah_Zafar)1837–1857RecipeKey: () and red background: Unrecorded The Portuguese priest [Sebastien Manrique](/wiki/Sebastien_Manrique) described rice dishes on sale in the tent-city of the next Mughal emperor [Shah Jahan](/wiki/Shah_Jahan) as he travelled to [Lahore](/wiki/Lahore) in 1641. Manrique distinguished \"Persian\" pilau from \"Mogol\" biryani: > Among these dishes the principal and most substantial were the rich and aromatic Mogol Bringes [biryanis][b] and Persian pilaos of different hues\". The dish is mentioned, too, in letters of the emperor [Aurangzeb](/wiki/Aurangzeb) to his son. For example: > Exalted son, I remember the savour of your '[khichidi](/wiki/Khichri)' and 'biryani' during the winter. Truly the 'kabuli' cooked by Islam Khan does not surpass them (in point of relish and savour). I wanted to have from you (in my service) Saliman, who cooks 'biryani'; but you did not allow him to serve as my cook. If you happen to find a pupil of his, skilful in the art of cookery, you will send him to me. According to the historian Rana Safvi, the earliest actual recipe is from the later Mughal period, from [Bahadur Shah Zafar](/wiki/Bahadur_Shah_Zafar)'s time. ### Analysis The historian of food [K. T. Achaya](/wiki/K._T._Achaya) states that pilau is \"of older usage in India\" than biryani, indicating that it could have been a precursor of biryani. The historian of food [Lizzie Collingham](/wiki/Lizzie_Collingham) writes that the modern biryani developed in India (Hindustan) in the royal kitchens of the [Mughal Empire](/wiki/Mughal_Empire), specifically during the rule of the emperor [Akbar](/wiki/Akbar) (1556–1605), and is a mix of the native spicy rice dishes of South Asia, Persian yoghurt-[marinated](/wiki/Marinated) meat, and the Persian [pilau](/wiki/Pilaf) style of garnished rice. Collingham writes that \"in the kitchens [of the Mughal court]... the [delicately flavoured Persian](/wiki/Persian_cuisine) pilau met the pungent and spicy rice dishes of Hindustan to create the classic [Mughlai dish](/wiki/Mughlai_cuisine), biryani\". The cookery writer Pratibha Karan states that biryani is of Indian origin, derived from pilau which Muslim traders and invaders brought with them. She speculates that pilau was an army dish in medieval India. Armies would prepare a one-pot dish of rice with any available red meat. Over time, the dish became biryani due to different methods of cooking. In the view of the historian of Islamic cuisine Salma Hussein and others, biryani came to South Asia from Persia before the Mughal era, most probably arriving in South India's [Deccan region](/wiki/Deccan_Plateau), brought by travelling soldier-statesmen and pilgrims. It has also been suggested that the dish was introduced from [Persia](/wiki/Persia) by the Mughals. Another variant theory, that biryani came to India with [Timur](/wiki/Timurid_dynasty)'s invasion, appears to be incorrect because there is no record of biryani having existed in his native region of Central Asia during that period. ## Ingredients Ingredients for biryani vary according to the region and the type of meat and vegetables used. Meat (chicken, goat, beef, lamb, prawn or fish) is the prime ingredient with rice. Vegetables are sometimes added. Navratan biryani tends to use sweeter, richer ingredients such as [cashews](/wiki/Cashew), [sultanas](/wiki/Sultana_(grape)) (*kishmish*), and fruits such as apple and [pineapple](/wiki/Pineapple). The spices and [condiments](/wiki/Condiment) used in biryani may include [fennel seeds](/wiki/Fennel_seeds), [ghee](/wiki/Ghee) (clarified butter), [nutmeg](/wiki/Nutmeg), [mace](/wiki/Mace_(spice)), [pepper](/wiki/Black_pepper), [cloves](/wiki/Clove), [cardamom](/wiki/Cardamom), [cinnamon](/wiki/Cinnamon), [bay leaves](/wiki/Bay_leaf), [coriander](/wiki/Coriander), [mint](/wiki/Mentha), [ginger](/wiki/Ginger), onions, tomatoes, [green chilies](/wiki/Green_chilies), [star anise](/wiki/Star_anise), and garlic. The premium varieties include [saffron](/wiki/Saffron). Some commercial recipes for biryani include aromatic essences such as mitha [attar](/wiki/Attar), [kewra](/wiki/Kewra) and [rose water](/wiki/Rose_water). Dried sour [prunes](/wiki/Prune) (*alu bukhara*) may be added. In *nasi briyani* and other variants made in Southeast Asian countries such as [Malaysia](/wiki/Malaysia), Singapore, and [Indonesia](/wiki/Indonesia), local spices and aromatics such as [pandan](/wiki/Pandanus_amaryllifolius) leaf may be added. Biryani may be served with side dishes such as *[raita](/wiki/Raita)* (yoghurt with cucumber, tomato, etc), fried or curried [aubergine](/wiki/Aubergine) (*brinjal*), [salad](/wiki/Salad), or a curried side such as *ande ka salan* (with boiled eggs) or *[mirchi ka salan](/wiki/Mirchi_ka_salan)* (with chili peppers). Dietary variations include adding [eggs](/wiki/Eggs_as_food), [potatoes](/wiki/Potato), and substituting meat with [paneer](/wiki/Paneer) or vegetables, especially in [Hindu](/wiki/Hindu_Vegetarianism) or non-religious [vegetarian](/wiki/Vegetarian) variants. ## Preparation styles ### *Pakki* and *kacchi* biryani Biryani can be cooked using one of two techniques, *pakki* (\"cooked\") and *kacchi* (\"raw\"). In a *pakki biryani*, the ingredients are cooked separately (at least in part) and then arranged in layers. The different layers can be individually coloured and flavoured with a brightly-coloured spice such as turmeric or saffron. In a *kacchi biryani*, layers are arranged in a pot which is then [sealed and cooked slowly](/wiki/Dum_pukht) (Dum cooking) for the food to steam in its own liquid. ### Difference between biryani and pilau [Pilau](/wiki/Pilaf) is a mixed rice dish popular in the [cuisines of the Indian subcontinent](/wiki/Cuisines_of_the_Indian_subcontinent), Central Asia, and [Middle Eastern cuisine](/wiki/Middle_Eastern_cuisine). Opinions differ on the differences between the dishes, if any. The [British-era](/wiki/British_Raj) author [Abdul Halim Sharar](/wiki/Abdul_Halim_Sharar) mentions that biryani has a stronger curried taste due to a greater amount of spices. According to Delhi-based historian [Sohail Hashmi](/wiki/Sohail_Hashmi), pilau tends to be plainer than biryani, and consists of meat or vegetables cooked with rice with the bottom layered with potatoes or onions. Biryani contains more gravy, and is often cooked longer, leaving the meat (and vegetables, if present) more tender, and the rice more flavoured. Biryani is cooked with additional dressings and often has a light layer of [scorched rice](/wiki/Scorched_rice) at the bottom. Author Pratibha Karan states that while the terms are often applied arbitrarily, the main distinction is that a biryani consists of two layers of rice with a layer of meat (and vegetables, if present) in the middle, while the pilau is not layered. Author [Colleen Taylor Sen](/wiki/Colleen_Taylor_Sen) lists the following distinctions between biryani and pilau: - Biryani is the primary dish in a meal, while pilau is usually a secondary accompaniment to a larger meal. - *Biryanis* have more complex and stronger spices than pilau. ## Varieties ### In the Indian subcontinent There are many types of biryani in the Indian subcontinent. Biryani is the single most-ordered dish in Indian online food ordering and delivery services, and has been described as the most popular dish in India. The names of variants are often based on their region or city of origin. Some have taken the name of the shop that sells it, as in Fakhruddin Biriyani in [Dhaka](/wiki/Dhaka), Students biryani in [Karachi](/wiki/Karachi), Lucky biryani in Bandra, Mumbai and Baghdadi biryani in [Colaba](/wiki/Colaba), Mumbai. *Biryanis* are often specific to the Muslim communities where they originate; they are usually the defining dishes of those communities. In 2009, the Deccani Biryani Makers Association submitted 'Hyderabadi Biryani' for a [geographical indication](/wiki/Geographical_indication), but the attempt failed as they were unable to provide documentary evidence of its historical origin. ### Outside the Indian subcontinent Varieties of biryani have arisen in many countries, and was often spread to such places by South Asian diaspora populations. For example in Myanmar, *danpauk* (ဒံပေါက်) is a mainstay at festive events such as weddings. On the Persian Gulf, biryani (Persian: برياني) is usually saffron-based with chicken, while in Indonesia *[nasi kebuli](/wiki/Nasi_kebuli)* is an spicy steamed rice dish cooked in goat meat broth, milk and *[ghee](/wiki/Ghee)*. In Thailand the dish is known as *khao mhok* ([Thai](/wiki/Thai_language): ข้าวหมก), using chicken, beef or fish, topped with fried garlic and served with a green sour sauce. ## In culture Biryani forms \"the centrepiece of countless Indian holidays and weddings\". In Bangladesh, kacchi biryani with mutton has been described as \"the quintessential wedding dish\" of [Old Dhaka](/wiki/Old_Dhaka), largely replacing the murg (chicken) pulao that was favoured in the 20th century for special occasions across the subcontinent. In [Delhi](/wiki/Delhi), the Muslim festival of [Bakr Eid](/wiki/Eid_al-Adha) was marked by biryani at dinner, using the mutton from the goats slaughtered in memory of the prophet [Abraham](/wiki/Abraham), who had shown he was willing even to sacrifice his own son. Biryani is used across the Indian Subcontinent in celebrations. Annual biryani festivals have been held in cities such as [Ambur](/wiki/Ambur), [Islamabad](/wiki/Islamabad) and [Karachi](/wiki/Karachi). South Asian diaspora populations have held their own festivals, for example by the North American Indian Muslim Association in North America. Biryani festivals have been held more widely in places such as Singapore and Qatar. - [Bannu pulao](/wiki/Bannu_pulao) - [Fried rice](/wiki/Fried_rice) - [Kabuli pulao](/wiki/Kabuli_pulao) - [Jollof rice](/wiki/Jollof_rice) - [Tehri](/wiki/Tehri_(dish)) - [Paella](/wiki/Paella) - [List of rice dishes](/wiki/List_of_rice_dishes) ## Notes\n",
  "language": "en",
  "processed_at": "2026-01-12T09:56:42.494541",
  "title": "Biryani",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Biryani"
}