{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:56:45.666733"
  },
  "content": "Planning Area and HDB Town in Central Region, SingaporePlanning Area and HDB Town in Central Region, Singapore **Bishan** (/ˈbiːʃɑːn/ *BEE-shahn*), also known as **Peck San**, **Bishan New Town** or **Bishan Town**, is a [planning area](/wiki/Planning_Areas_of_Singapore) and [matured residential town](/wiki/New_towns_of_Singapore) located at the northernmost portion of the [Central Region](/wiki/Central_Region,_Singapore) of [Singapore](/wiki/Singapore). Statistically, the area is ranked the 38th biggest in terms of geographical size and the 22nd most populated planning area in the country. It is located at the most Central point of Singapore, and it comprises Upper Thomson, Marymount, Shunfu, Sin Ming, Bishan North and Bishan East. There are also many private residential properties in Bishan. Bishan is ranked 15th in terms of population density. Apart from its boundary with the [Central Water Catchment](/wiki/Central_Catchment_Nature_Reserve) in the west, Bishan borders three other planning areas: [Ang Mo Kio](/wiki/Ang_Mo_Kio) to the north, [Toa Payoh](/wiki/Toa_Payoh) to the south, and [Serangoon](/wiki/Serangoon) to the east. What is now Bishan today was once land that belonged to [Kwong Wai Siew Peck San Theng](/wiki/Singapore_Kwong_Wai_Siew_Peck_San_Theng), a century old cemetery that mainly served the [Cantonese](/wiki/Cantonese_people) and [Hakka](/wiki/Hakka_people) communities in Singapore. Following the establishment of the cemetery in 1870, the first human settlements began to appear in the area, forming what eventually became Kampong San Teng. During the [Battle of Singapore](/wiki/Battle_of_Singapore) in 1942, Peck San Theng was the site of a fierce firefight between the invading Japanese forces and the defending British. The subsequent [fall of the island to the Japanese](/wiki/Japanese_occupation_of_Singapore) that same year eventually made Peck San Theng a place of refuge for most of the Singapore population. In 1973, Peck San Theng ceased accepting burials, and six years later, following a government lease, the land was acquired for development. Graves were then exhumed between 1982 and 1984, paving the way for the construction of Bishan New Town in 1983. Today, Peck San Theng remains in operation, although it has since been converted into a [columbarium](/wiki/Columbarium). Bishan New Town became the first in Singapore to depart from the [brutalist](/wiki/Brutalist_architecture) design seen in most previous [Housing and Development Board](/wiki/Housing_and_Development_Board) (HDB) towns. Instead of slab-like residential blocks that were built in uniformed rows, apartment blocks in Bishan varied in height and were often dislocated. Flats within the town also featured [pitched roofs](/wiki/Roof_pitch) which have since become closely associated with the skyline of Bishan. The town is also home to three of Singapore's most prestigious educational institutions: [Catholic High School](/wiki/Catholic_High_School,_Singapore), [Raffles Girls' School](/wiki/Raffles_Girls%27_School), and [Raffles Institution](/wiki/Raffles_Institution). ## Etymology Bishan derived its name from the [Cantonese](/wiki/Cantonese_language) term for large [burial ground](/wiki/Burial_ground), *Peck San Theng* ([Chinese](/wiki/Simplified_Chinese_characters): 碧山亭; [pinyin](/wiki/Pinyin): *bìshāntíng*), which literally translates as \"pavilions on the green\". This term reflects the neighbourhood's origins as a burial ground that was established in 1870 by [Cantonese](/wiki/Cantonese_people) and [Hakka](/wiki/Hakka_people) immigrants. This burial ground has since been redeveloped and the original graves were relocated to the nearby [Peck San Theng Temple](/wiki/Kwong_Wai_Siew_Peck_San_Theng). ## Geography ### Location The Bishan planning area, as demarcated by the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) (URA), is situated in the [Central Region](/wiki/Central_Region,_Singapore) of Singapore, bounded by planning areas of [Ang Mo Kio](/wiki/Ang_Mo_Kio) to the north, [Toa Payoh](/wiki/Toa_Payoh) to the south and [Serangoon](/wiki/Serangoon) to the east. Bishan New Town sits within this planning area. ### Subdivisions The Bishan planning area is further subdivided into three subzones, which are divided into three roughly vertical areas in the Bishan planning area as follows (from east to west): SubzoneLocationNotable Places[Bishan East](/wiki/Bishan_East)Bordered by the [Central Expressway](/wiki/Central_Expressway,_Singapore) (CTE)/Ang Mo Kio Avenue 1 to the north and east, Bishan Road to the west and Braddell Road to the south.[Bishan MRT station](/wiki/Bishan_MRT_station) [Junction 8](/wiki/Junction_8) Bishan Community Club[Marymount](/wiki/Marymount,_Singapore)Bordered by Bishan Road to the east and Marymount Road to the west.[Bishan-Ang Mo Kio Park](/wiki/Bishan-Ang_Mo_Kio_Park) (east section) Bishan Active Park[Upper Thomson](/wiki/Upper_Thomson)Bordered by Marymount Road to the east and the [Central Water Catchment](/wiki/Central_Water_Catchment) to the west.[Marymount MRT station](/wiki/Marymount_MRT_station) [Upper Thomson MRT station](/wiki/Upper_Thomson_MRT_station) [Bishan-Ang Mo Kio Park](/wiki/Bishan-Ang_Mo_Kio_Park) (west section) [Windsor Nature Park](/wiki/Windsor_Nature_Park) [Thomson Plaza](/wiki/Thomson_Plaza) ## Demographics As of the General Household Survey from [SingStat](/wiki/Singapore_Department_of_Statistics) in 2015, Bishan's population consisted of 90,700 people, with 85.1% Chinese, 4.1% Malay, 7.7% Indian and 3.0% Others. The population density was 11,564 residents per square kilometre (29,652.1/mi2), ranking as the 15th planning area in Singapore by population density. SubzoneChineseMalaysIndiansOthersTotalBishan East24,0201,4602,56079028,820Marymount27,0901,2702,30088031,540Upper Thomson26,1001,0402,1401,06030,340**Total****77,220****3,760****7,000****2,720****90,700** Based on the 2023 population trends from SingStat, Bishan had a total of 31,600 households, with 63.5% being Housing and Development Board (HDB) housing, 26.2% being condominiums, and 9.8% being landed properties. SubzoneHDBCondoLandedOthersTotalBishan East8,2901,5900509,930Marymount6,8601,630760409,290Upper Thomson4,9205,0602,3406012,380**Total****20,070****8,280****3,100****150****31,600** ## History Peck San Theng cemetery was established in 1870 on the site of present-day Bishan by [Cantonese](/wiki/Cantonese_people) and [Hakka](/wiki/Hakka_people) immigrants. People began to settle around the cemetery, and Kampong San Theng and Soon Hock Village, which lay within Kampong San Theng grounds, soon grew in size. Singapore Kwong Wai Siew Peck San Theng, a federation of 16 Cantonese [clans](/wiki/Clan) in Singapore, managed and ran Kampong San Theng. This settlement grew over time to accommodate nearly 2000 inhabitants at the beginning of the 20th century. During [World War II](/wiki/World_War_II), the Peck San Theng cemetery became a battle ground between British and Japanese forces. The 2nd Battalion of the [Cambridgeshire Regiment](/wiki/Cambridgeshire_Regiment) had engaged the Japanese forces on 14 February 1942 over the nearby strategically important [MacRitchie Reservoir](/wiki/Macritchie_Reservoir). The Japanese also bombed Kampong San Teng, which resulted in significant civilian casualties. The battle ended the next day, 15 February, when [the British surrendered](/wiki/Battle_of_Singapore#Fall_of_Singapore) to the Japanese. At that point, British troops were still holding out along Braddell Road. During the [Japanese Occupation of Singapore](/wiki/Japanese_Occupation_of_Singapore), this area became a refuge for people trying to evade the Japanese because the Japanese occupiers were afraid to enter the cemetery. After the war, the graves of Peck San Theng became a known gangster hideout, and gang-related crimes became rife in the area. In 1973, the government ordered the cemetery to be closed and mandated that no fresh burials were allowed to be done within the cemetery. The government later acquired this cemetery land from the Kwong Wai Siew Peck San Theng foundation for [SGD$](/wiki/Singapore_Dollar)$4.95 million in 1979. As compensation, the government gave 3 hectares of the land back to the foundation for the foundation to build a [columbarium](/wiki/Columbarium). The foundation subsequently built a multi-story columbarium complex on this land. In the early 1970s, the [Housing Development Board](/wiki/Housing_Development_Board) (HDB) built the first housing estate which was located at Sin Ming Road along with clusters of industrial sectors. The first blocks of residential flats were numbered Block 22–26, now known as Sin Ming Ville. In late 2021, it was announced that Block 26 Sin Ming Industrial Estate will be demolished to make way for redevelopment. Sin Ming industrial estate is also known to be a popular destination for matters relating to automotive needs as the estate houses mainly vehicle workshops and establishments specialising in vehicle sales, maintenance, registration as well as inspection. To date, many of the low rise workshops have since been demolished and relocated to the nearby Sin Ming Autocare and Sin Ming Autocity high rise complexes. Plans are underway for the vacated lands to be redeveloped for residential use. In addition to Sin Ming Ville, the development of Lakeview Estate was simultaneously completed somewhere in mid 1977. Lakeview Estate was segregated into two segments with fourteen low rise blocks numbered Blocks 1-14 and three high rise flats numbered Blocks 97A, 97B and 97C. The low rise blocks consisted of shophouses and a wet market with food centre located at Block 9 whereas the high rise flats consist of HUDC apartment units. Later in the late 1990s, the low rise segment of Lakeview Estate was demolished and it remains vacant to date. By the 1980s, HDB had already begun expanding the area into a satellite housing estate to meet the rising demand for housing from Singapore's then-growing population. The residents in Kampong San Teng were resettled and a mass exhumation of the 170,000 graves were carried out in 1980. Redevelopment of the area officially started in 1982. On this land, HDB planned to construct 24,600 residential units distributed across 4 distinct neighbourhoods: Bishan East, Bishan North, Bishan West (subsequently renamed Sin Ming Garden Estate in 1988) and Shunfu Estate, of which Bishan East will be the largest. In 2011, after plans to construct the [North–South Corridor](/wiki/North%E2%80%93South_Corridor,_Singapore) (NSC) expressway was announced to ease congestion along Marymount Road and the [Central Expressway](/wiki/Central_Expressway,_Singapore) (CTE), Marymount Terrace was [acquired](/wiki/Eminent_domain) by the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) (URA) and later demolished. In 2018, Shunfu Ville HUDC flats were demolished to make way for the Jadescape Condominium project. The first five blocks of housing units were completed by 1985. There were initial fears of a poor demand for houses in Bishan due to prevailing local superstitions about bad [fengshui](/wiki/Fengshui) since they were built on a former cemetery. However, the first batch of houses were all snapped up during their launch to buyers who were attracted by the central location of Bishan. ## Sports Bishan Sports Centre, formerly known as Bishan Sports and Recreation Centre, houses sporting facilities such as a [sports hall](/wiki/Bishan_Sports_Hall), a [stadium](/wiki/Bishan_Stadium), a dance studio and a swimming complex. Managed by [Sport Singapore](/wiki/Sport_Singapore), these sporting facilities cater to both the general public and professional athletes. Several major national and international level sporting events has been held at the Bishan Sports Centre, including the [2009 Asian Youth Games](/wiki/2009_Asian_Youth_Games) and the [2010 Youth Olympic Games](/wiki/2010_Youth_Olympic_Games). Bishan Sports Hall, which serves as the primary venue for [gymnastics](/wiki/Gymnastics) competitions in Singapore, has hosted gymnastic competitions as part of the [2009 Asian Youth Games](/wiki/2009_Asian_Youth_Games), [2010 Youth Olympic Games](/wiki/2010_Youth_Olympic_Games) and the [2015 SEA Games](/wiki/2015_SEA_Games). It is also the venue for national-level gymnastics competition in Singapore. Similarly, the 4,200-seat Bishan Stadium has hosted the [athletics](/wiki/Sport_of_athletics) and [football](/wiki/Association_football) competitions at the 2010 Youth Olympic Games and the 2015 SEA Games respectively. Bishan Stadium is the home of the [Lion City Sailors](/wiki/Lion_City_Sailors_FC), a professional football club that plays in [Singapore Premier League](/wiki/Singapore_Premier_League). Opened in 2008, the Bishan Active park also offers sporting facilities to the residents of Bishan. This 24,000 [square metres](/wiki/Square_metres) park houses facilities such as a [roller blading](/wiki/Roller_blading) track, [basketball](/wiki/Basketball) courts and a [beach volleyball](/wiki/Beach_volleyball) court, augmenting the facilities found at the Bishan Sports Centre. ## Infrastructure ### Transport Bishan is connected by road to the rest of Singapore via the [Central Expressway](/wiki/Central_Expressway,_Singapore) (CTE), a major expressway connecting Northern parts of Singapore with its city centre. In addition it has its own [Mass Rapid Transit](/wiki/Mass_Rapid_Transit_(Singapore)) (MRT) station, the [Bishan MRT station](/wiki/Bishan_MRT_station), which is an interchange station on both the [North–South Line](/wiki/North%E2%80%93South_Line_(Singapore)) (NSL) and [Circle Line](/wiki/Circle_Line_(Singapore)) (CCL). Bishan also has a [bus interchange](/wiki/Bishan_Bus_Interchange) that provides bus services to other parts of Singapore (such as Changi and Punggol). There are also feeder bus services that operate within the neighbourhood. The [Kallang](/wiki/Kallang) Park Connector, which begins in Bishan, provides a cycling route between Bishan and the Central Business District along the [Kallang River](/wiki/Kallang_River). This 10 kilometres (6.2 mi) route was the first [park connector](/wiki/Park_connector) that was constructed in Singapore. [Marymount MRT station](/wiki/Marymount_MRT_station) is a station on the CCL that serves residents living in Shunfu, Thomson, Sin Ming and Jalan Pemimpin. Both [Bright Hill station](/wiki/Bright_Hill_MRT_station) and [Upper Thomson station](/wiki/Upper_Thomson_MRT_station) are MRT stations on the [Thomson–East Coast Line](/wiki/Thomson%E2%80%93East_Coast_Line) (TEL) that provide connection between the [Sin Ming](/wiki/Sin_Ming) and [Thomson](/wiki/Thomson,_Singapore) area of Bishan with the northern parts and Central Business District of Singapore. The upcoming [Cross Island Line](/wiki/Cross_Island_Line) will also have connections with the TEL at Bright Hill station. ### Commercial areas Bishan currently has 8 commercial areas. - The [Junction 8 Shopping Centre](/wiki/Junction_8_Shopping_Centre), run by [CapitaLand](/wiki/CapitaLand), is situated at Bishan Central near the [Bishan MRT station](/wiki/Bishan_MRT_station) and [Bishan Bus Interchange](/wiki/Bishan_Bus_Interchange). - The Bishan North Shopping Mall is a non-air-conditioned commercial complex consisting of a wet market and a wide range of shops that specialise in the sale of day-to-day products. Contrary to its name, it is not a shopping mall. - [Thomson Plaza](/wiki/Thomson_Plaza) is a shopping centre located at [Upper Thomson Road](/wiki/Upper_Thomson_Road). - Thomson V One and Two is a residential and commercial complex that comes with a mall featuring shoebox sized retail units on the ground floor and basement levels. The site used to be a wet market. - Thomson Imperial Court and Sin Ming Plaza, are residential complexes with retail outlets on the ground floor and basement levels. Thomson Imperial Court is built on the site of the now demolished Imperial Theatre. - Midview City is an industrial and commercial complex located at Sin Ming specialising in a wide range of trades and businesses. - Jalan Pemimpin Industrial Area is an industrial and commercial area located near to Marymount specialising in a wide range of trades and businesses. ### Parks The parks in the area comprise [Bishan-Ang Mo Kio Park](/wiki/Bishan-Ang_Mo_Kio_Park) and Bishan Harmony Park. Bishan-Ang Mo Kio Park is situated along Ang Mo Kio Avenue 1, and covers an area of 63 hectares (160 acres). The [Kallang River](/wiki/Kallang_River) runs through the middle of the park, and can be crossed via a number of foot bridges and stepping stones. The park also sports ponds and fishing spots. Located at the junction of Bishan Road and Braddell Road, Bishan Harmony Park serves the surrounding neighbourhoods, and comprises a garden maze, two barbecue pits, a fitness corner and a skate park. Built at a cost of S$1 million, the park opened in June 2009. ## Education In 1936, the Kwong Wai Siew Peck San Theng foundation established a village school in the former Kampong San Teng to provide free education to the farming families living in the vicinity. The Kwong Wai Shiu Peck San Theng School (广惠肇碧山亭学校) was initially housed on the foundation's temple premises. Starting with 60 students, the school gradually expanded to the point where it started an afternoon session to cater to the demand. The school had to stop classes during the [Japanese occupation of Singapore](/wiki/Japanese_occupation_of_Singapore) but lessons soon resumed in 1945. In 1957, the school shifted into a new school compound situated at the entrance of a cemetery compound near [Upper Thomson](/wiki/Upper_Thomson). The new school compound had 6 classrooms and could cater to 450 students in two school sessions. The Kwong Wai Shiu Peck San Theng School was also integrated into [Singapore's mainstream education system](/wiki/Education_in_Singapore) that year. In 1981, due to changes in Singapore's national educational policy, governmental funding to the school was halted and the Kwong Wai Shiu Peck San Theng School soon closed down. In addition, Shin Min Public School (淡申律公立新民学校) was located at Sin Ming Road from 1945 to 1986, closing due to low enrollment. The school's site is currently occupied by the Amtech Building. Since its redevelopment in the 1980s, Bishan has become home to several educational institutions. According to the [Ministry of Education](/wiki/Ministry_of_Education,_Singapore), there are four [primary schools](/wiki/Primary_schools) and seven [secondary schools](/wiki/Secondary_education_in_Singapore) that are located within Bishan. [Raffles Institution](/wiki/Raffles_Institution), one of the oldest educational institutions in Singapore, has been located in Bishan since 1990. This campus houses both of the institution's secondary and high school sections. [Raffles Girls' School](/wiki/Raffles_Girls%27_School_(Secondary)) has also relocated to the area. Other notable schools located in Bishan include [Ai Tong School](/wiki/Ai_Tong_School), a primary school founded by Chinese pioneers in 1912, and [Catholic High School](/wiki/Catholic_High_School,_Singapore), a [Special Assistance Plan](/wiki/Special_Assistance_Plan) school that names Singapore Prime Minister [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) as one of its alumni. The prominent schools of Bishan are namely [Guangyang Secondary School](/wiki/Guangyang_Secondary_School), [Kuo Chuan Presbyterian Secondary School](/wiki/Kuo_Chuan_Presbyterian_Secondary_School) and Kuo Chuan Presbyterian Primary School. In addition, at Bishan North, there are [Whitley Secondary School](/wiki/Whitley_Secondary_School) of Bishan Street 24 and Peirce Secondary School is located at Sin Ming Walk. Despite bearing the name Peirce Secondary School, the school was actually a subordinate branch of [Bishan Park Secondary School](/wiki/Bishan_Park_Secondary_School) when it first started operating off the latter's campus in 1994. The [Ministry of Education](/wiki/Ministry_of_Education,_Singapore) announced [Bishan Park Secondary School](/wiki/Bishan_Park_Secondary_School) as one of the schools to be affected by the merger programme. As a result, it was absorbed by Peirce Secondary School in 2018. The Bishan campus of the [Institute of Technical Education](/wiki/Institute_of_Technical_Education) (ITE) was established in 1994 as part of the government's plan to revamp Singapore's [vocational education](/wiki/Vocational_education) system. It provided vocational courses in subjects such as [accountancy](/wiki/Accountancy) and [business](/wiki/Business). In 2005, this campus became part of [ITE College Central](/wiki/ITE_College_Central) during a major revamp of the ITE system. This campus was subsequently closed in 2012 and relocated to the new ITE College Central mega-campus in [Ang Mo Kio](/wiki/Ang_Mo_Kio). The old facilities of ITE Bishan subsequently became a temporary holding site for schools which are undergoing renovation. It has since been demolished to make way for the new HDB [Build-to-order](/wiki/Build_to_order_(HDB)) (BTO) project Bishan Ridges. In addition to mainstream schools, a campus of the [Ministry of Education Language Centre](/wiki/Ministry_of_Education_Language_Centre) (MOELC), where students get to learn additional foreign languages such as [French](/wiki/French_language) and [German](/wiki/German_language), is located in Bishan. The Singapore branches of the [Girl Guides Association](/wiki/Girl_Guides_Singapore) and the [Scouts Association](/wiki/The_Singapore_Scout_Association) are also headquartered in Bishan. A new junior college named [Eunoia Junior College](/wiki/Eunoia_Junior_College) was later built at the site of former Nature Park Golf Driving Range located at Sin Ming Avenue by late 2019. Other than schools ranging from primary to tertiary, there are also nurseries and kindergartens scattered across Bishan estate. ## Housing The town is a mixture of three, four and five-room [HDB](/wiki/Housing_Development_Board) flats. The majority of the flats are four roomed, with a few being three or five. There are some with balconies, and some are penthouse mansionettes. Blocks numbered with \"1\" as the first digit are generally smaller and more connected with the town center. Blocks numbered with 2 as the first digit are more spread out and generally larger in size. They also tend to be the largest flats in the whole estate, with flat sizes ranging from 1650 square feet to 1700 square feet, some of the largest HDB flats in Singapore. Other numbers tend to be smaller and are usually from 1300 square feet to 1500 square feet. Sin Ming Ville (Block 22-26) is excluded from this category. There are also various condominiums in Bishan including the Sky Habitat, Clover by the Park and Country Grandeur. As is with [Serangoon New Town](/wiki/Serangoon_New_Town), it was built in an area with a large extent of pre-existing private housing, resulting in a disjointed town layout. The oldest public housing blocks were located around [Upper Thomson](/wiki/Upper_Thomson) as housing for the surrounding industrial estate. When the area was designated as a new town, the main housing area was built in the vicinity of [Bishan MRT station](/wiki/Bishan_MRT_station), with neighbourhoods built in Bishan North and Shunfu. Newer blocks were also built in Upper Thomson, while the old blocks were refurbished. ## Politics The entirety of the Bishan planning area was originally under the jurisdiction of the four-member (previously five-member) [Bishan-Toa Payoh Group Representative Constituency](/wiki/Bishan-Toa_Payoh_GRC) (GRC), which was first formed during the [1997 Singaporean general election](/wiki/1997_Singaporean_general_election). Bishan-Toa Payoh GRC remained uncontested under the incumbent [People's Action Party](/wiki/People%27s_Action_Party) (PAP), until the [2011 Singaporean general election](/wiki/2011_Singaporean_general_election) where the incumbent team, led by former [Deputy Prime Minister](/wiki/Deputy_Prime_Minister_of_Singapore) [Wong Kan Seng](/wiki/Wong_Kan_Seng), defeated then-[Potong Pasir SMC](/wiki/Potong_Pasir_SMC) and [Singapore People's Party](/wiki/Singapore_People%27s_Party) (SPP) secretary-general [Chiam See Tong](/wiki/Chiam_See_Tong). Ahead of the [2020 Singaporean general election](/wiki/2020_Singaporean_general_election), incumbent [Member of Parliament](/wiki/Members_of_the_Singapore_Parliament) (MP) [Josephine Teo](/wiki/Josephine_Teo)'s division was carved into the new [Marymount Single Member Constituency](/wiki/Marymount_Single_Member_Constituency) (SMC) while Teo went on to helm the neighbouring [Jalan Besar GRC](/wiki/Jalan_Besar_GRC). Currently, the MPs overseeing the Bishan areas are [Chee Hong Tat](/wiki/Chee_Hong_Tat) (overseeing eastern Thomson), [Elysa Chen](/wiki/Elysa_Chen) (overseeing most of Thomson, Shun Fu and east Bishan) and [Gan Siow Huang](/wiki/Gan_Siow_Huang) (north Bishan, under the Marymount SMC). - Bishan-Toa Payoh Town Council\n",
  "language": "en",
  "processed_at": "2026-01-12T09:56:45.666294",
  "title": "Bishan, Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Bishan,_Singapore"
}