{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:56:50.771827"
  },
  "content": "The **Bishop of Singapore** is the diocesan bishop for the [Anglican Diocese of Singapore](/wiki/Anglican_Diocese_of_Singapore), founded in 1909. ## History of the See The history of the **Anglican See of Singapore**, now known as the [Diocese of Singapore](/wiki/Anglican_Diocese_of_Singapore), traces its roots to the establishment of a British trading post on the island in 1819. Early Anglican ministry was provided by East India Company ship chaplains until the first full-time colonial chaplain, the Reverend Robert Burns, was appointed in 1826. Singapore was initially part of the vast Diocese of Calcutta in British India. A permanent church building, St. Andrew's, was eventually consecrated in 1837 and became the cathedral church in 1870 after the jurisdiction transferred to the Diocese of Labuan and Sarawak in 1869. The current Diocese of Singapore was formally constituted as a separate entity in 1909, covering the Straits Settlements, Peninsular Malaya, and other surrounding regions, under its first bishop, Charles J. Ferguson-Davie. This organizational shift marked the transition from a system of colonial chaplaincies to a more structured local diocese, a process that accelerated post-World War II with the rise of local nationalism and the move towards Asian leadership. The diocese has since become part of the Province of the Anglican Church of South East Asia, established in 1996, and has expanded its mission work into several other countries in the region. ## List of bishops - 1881 [George Hose](/wiki/George_Hose), Bishop of Singapore, Labuan & Sarawak - 1909 [Charles Ferguson-Davie](/wiki/Charles_Ferguson-Davie) - 1927 [Basil Roberts](/wiki/Basil_Roberts) (1887–1947) - 1941 [Leonard Wilson](/wiki/Leonard_Wilson) - 1949 [Henry Baines](/wiki/Henry_Baines_(bishop)) - 1961 [Kenneth Sansbury](/wiki/Kenneth_Sansbury) - 1966 [Chiu Ban It](/wiki/Chiu_Ban_It) - 1982 [Moses Tay](/wiki/Moses_Tay) ([Archbishop of South East Asia](/wiki/Archbishop_of_South_East_Asia), 1996–2000) - 2000 [John Chew](/wiki/John_Chew) (Archbishop of South East Asia, 2006–2012) - 2012 [Rennis Ponniah](/wiki/Rennis_Ponniah) - 2020 [Titus Chung](/wiki/Titus_Chung) (consecrated 18 October 2020) This Singapore-related article is a stub. You can help Wikipedia by expanding it. - v - t - e This [Anglicanism](/wiki/Anglicanism)-related article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T09:56:50.771266",
  "title": "Bishop of Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Bishop_of_Singapore"
}