{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:56:56.689595"
  },
  "content": "Singaporean electric car sharing company **BlueSG** (stylised as **blueSG**) is a [Singaporean](/wiki/Singapore) company providing [electric](/wiki/Electric_car) [car sharing](/wiki/Carsharing) and electric car charging services. Announced in September 2017, the company, a subsidiary of Goldbell, launched the service in December of the same year, with 30 charging stations and 80 [all-electric](/wiki/Electric_car) [Bolloré Bluecar](/wiki/Bollor%C3%A9_Bluecar) for public use on a paid subscription basis. On 5 February 2021, it was announced that BlueSG was to be acquired by Goldbell Group, a Singaporean commercial vehicles and industrial equipment distribution and leasing company, with the acquisition completed in October 2021. The company's charging stations were also sold and acquired by [TotalEnergies](/wiki/TotalEnergies). As of December 2020, the company had 374 charging stations located across Singapore and a fleet of 667 cars. ## History In June 2016, [Bolloré](/wiki/Bollor%C3%A9) signed an agreement with the [Land Transport Authority (LTA)](/wiki/Land_Transport_Authority) and the [Economic Development Board](/wiki/Economic_Development_Board) to develop an electric car-sharing programme. On 27 September 2017, BlueSG announced with LTA to launch Singapore's first large scale [electric car sharing](/wiki/Carsharing) programme, with the service's electric car supplied by Bolloré. The company also opened their Asia-Pacific headquarters for its e-mobility, energy management and system integration business for the region. Bolloré used to operate several similar electric car-sharing services such as [Autolib'](/wiki/Autolib%27) in [Paris](/wiki/Paris), BlueIndy in [Indianapolis](/wiki/Indianapolis) and [Bluecity](/wiki/Bluecity) in [London](/wiki/London), but failed to achieve scalability and has since ceased to operate in these 3 cities. Construction of the charging stations began at the end of September 2017 and in December 2017, the service was officially opened to the public with 30 charging stations and 80 cars located throughout the island. BlueSG planned to expand the service to offer 2,000 charging points in 500 charging locations, with 400 charging points open for public use and 1,000 [electric cars](/wiki/Electric_car) deployed by 2020. In January 2018, within the first 3 weeks of operations, over 3,000 members signed up for the service, with 5,000 rentals completed. In December 2018, it was announced that BlueSG will open its charging stations to privately owned electric vehicles from the first quarter of 2019. The charging service was officially launched in April 2019, with a total of 25 charging stations open to privately owned electric vehicles on a yearly subscription basis. In April 2019, BlueSG released 99 charging points, which is around 13 per cent of its network of 755 chargers at 191 stations, across 25 locations for public use. It had also promised to release 20 per cent of its projected of 2,000 chargers by 2020. ### Acquisition by Goldbell and TotalEnergies In February 2021, Goldbell Group, a Singaporean company, announced it had acquired BlueSG from Bolloré and the acquisition was finalised by October of the same year, after being in discussions since June 2020. According to Singapore's [Accounting and Corporate Regulatory Authority](/wiki/Accounting_and_Corporate_Regulatory_Authority), BlueSG has been in a deficit since its launch, with the company making a loss of S$9.3 million in 2019. After the acquisition was completed in October 2021, Goldbell would be investing around S$70 million in the company within the next 5 years to expand BlueSG's services and fleet, with plans to introduce different models of electric vehicles into its fleet and to set up a new research and development centre that will be developing new mobility technologies and algorithms and to expand the service regionally. On 28 July 2021, it was announced that the network of 1,500 BlueSG charging stations was sold to [TotalEnergies](/wiki/TotalEnergies), which would continue to operate and maintain the charging stations. ### Temporary suspension On 4 August 2025, it was announced that BlueSG would pause its car-sharing service from 8 August as part of a major relaunch and the introduction of a new service in 2026, while also laying off a portion of its workforce. BlueSG was criticised for the sudden announcement with only four days' notice, which caught both customers and employees off guard. ## Operations and fleet Anyone aged 21 years and above with a valid [Singapore](/wiki/Singapore) driving license, [ASEAN](/wiki/Association_of_Southeast_Asian_Nations) driving license or an International driver's permit can sign up for the service through the BlueSG mobile application or their official website. Users can choose between 2 rental plans, with per minute fees of S$0.36 (increased from S$0.33 from 1 March 2021). An available car can be booked through the mobile application or at the charging station itself. A parking space can also be reserved through the application prior to returning the car to the charging station, or users can park at any available lot that is not already reserved. BlueSG introduced 2 rental packages on 1 October 2019, with the packages originally available for durations of 3 hours and 5 hours rentals respectively, which were only available from Monday to Friday. On 1 March 2021, with per minute fees increased to S$0.36, the prices for the rental packages was also revised and the 5 hour package was replaced with a 4 hours one instead. As of March 2024, the rates for the Corsa-E was revised to S$0.52 per minute, rental packages were also revised to 2 hours and 3 hours only available at different prices for weekdays and weekends, with the 4 hours package removed. The table below summaries the subscription types available, the subscription fees, pricing for the per minute rates and rental packages: BlueSG service fees and use rates PlanMembershipSubscription feesCar ModelRates per minuteRemarksPremium6 Months[S$](/wiki/Singapore_dollar)18 per monthBlueCarS$0.3640 minutes free rental per monthCorsa-ES$0.52BasicNo CommitmentS$8 per monthBlueCarS$0.36—N/aCorsa-ES$0.52BlueSG rental packages rates Rental PackagesAvailabilityRatesRemarks2 hoursWeekdays (until Friday 3pm or eve of public holiday)$17.86—N/aWeekends (Friday 3pm onwards) - Sunday (or until eve of public holiday)$22.903 hoursWeekdays (until Friday 3pm or eve of public holiday)$28.14Weekends (Friday 3pm onwards) - Sunday (or until eve of public holiday)$36.06Private EV charging service The BlueSG charging service was officially launched in April 2019, with users having to sign up for the charging services through BlueSG's official website and a yearly subscription fee will be charged in addition to per-minute charging fees. The table below summaries the subscription types available for the charging service: BlueSG charging service fees and use rates PlanMembershipSubscription feesRatesRemarksCharging Service1 Year[S$](/wiki/Singapore_dollar)20 per yearS$1 per hourS$1 per hour (First 3 hours) S$2 per hour (Subsequent charges) ### Fleet The service uses the all-electric [Bolloré Bluecar](/wiki/Bollor%C3%A9_Bluecar), which were adapted to suit Singapore's [left-hand traffic](/wiki/Left-_and_right-hand_traffic). It is a three-door [hatchback](/wiki/Hatchback) [electric car](/wiki/Electric_car) with four seats and has a 30 [kWh](/wiki/Kilowatt_hour) [lithium metal polymer (LMP) battery](/wiki/Lithium_polymer_battery), coupled to a [supercapacitor](/wiki/Supercapacitor), that provides an [electric range](/wiki/All-electric_range) of 250 km (160 mi) in urban use, and a maximum speed of 120 km/h (75 mph). The [Opel Corsa-e](/wiki/Opel_Corsa#Corsa-e) was introduced to the fleet in October 2022. It is a five-door [hatchback](/wiki/Hatchback) [electric car](/wiki/Electric_car) with five seats and with a 50 [kWh](/wiki/Kilowatt_hour) lithium-ion battery pack, which has an estimated range of 337 km (209 mi), which is longer than the range of the Bluecar. The car also features fast charging which allows it to be recharged from 10 to 80 percent capacity in 30 minutes, although there are no fast chargers in BlueSG stations. In July 2023, BlueSG unveiled its latest addition to the fleet, a Singaporean-assembled, \"First 100\" edition [Hyundai Ioniq 5](/wiki/Hyundai_Ioniq_5). It is a five-door [SUV](/wiki/SUV) [electric car](/wiki/Electric_car) with five seats and has a 77 [kWh](/wiki/Kilowatt_hour) lithium-ion battery pack, enabling a maximum driving range of 507 km (315 mi). Being the one and only fleet vehicle of its kind, it features a distinct livery and colour as compared to the rest of the fleet. The car bears the license plate \"EVS1L\", designating it as the inaugural car among the 100. The car is accessible only via advance reservations and special rental packages, which cost S$90 and S$200 for 6-hour and 24-hour durations respectively. ### Gallery ## Controversies As with most car sharing companies in Singapore, BlueSG has come into the spotlight for its high excess fees against its users in an event of an accident or maintenance issues with the vehicle, including minor ones, with growing calls to regulate the industry and increase [consumer protections](/wiki/Consumer_protection) from such [predatory practices](/wiki/Unfair_business_practices). In 2021, a BlueSG user was charged SG$1,000 for a flat tyre. In 2022, a BlueSG user was charged almost S$10,000 excluding a further third-party charge of S$5,000 to S$8,000 – totaling up to S$18,000 – after the car was damaged from hitting a garbage can. In 2025, a BlueSG employee was charged for exploiting the system for free rides and for driving without a [driving licence](/wiki/Driving_licence_in_Singapore) on 150 occasions between 2023 and 2024. As a customer service agent, he misused his access to BlueSG's internal database, adjusting rental durations to zero minutes so that he could drive for free. The employee was sentenced to seven months and six weeks imprisonment and was banned from obtaining any driving licence for three years. From 2024 to 2025, BlueSG began charging customers without active accounts, citing a system upgrade as the reason. The company did not notify affected users and continued collecting subscription fees until each customer contacted them individually. Operations were abruptly suspended from 8 August 2025, described as a \"strategic pause,\" with plans to relaunch in 2026. - [Autolib'](/wiki/Autolib%27) - [Bluecity](/wiki/Bluecity) - [GetGo](/wiki/GetGo_(carsharing_company)) - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T09:56:56.689060",
  "title": "blueSG",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/BlueSG"
}