{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:57:08.077139"
  },
  "content": "Singaporean mobile appThis article **contains promotional content**. Please help improve it by removing promotional language and inappropriate external links, and by adding encyclopedic text written from a neutral point of view. *(February 2023)* *(Learn how and when to remove this message)* **Bondee** is a virtual avatar [social networking app](/wiki/Social_networking_service) developed by Singapore-based tech firm Metadream. It is a platform for connecting and interacting with others by using a personalized figure-style avatar. Launched in January 2023, the app quickly gained popularity in Asia and topped App Store charts in several countries. ## History and development Metadream, an independent Singapore-based tech company, acquired the intellectual property (IP) rights for True.ly in May 2022. It was founded by investors from the United States and Australia, with [research and development](/wiki/Research_and_development) (R&D) and operational bases in Japan and South Korea, as well as data centers in Singapore, Japan, and the US, to ensure product safety and meet data security requirements. The company plans to establish regional operation centers in additional countries (such as Thailand and the Philippines) to serve local users. On November 15, 2022, it was announced that information technology (IT) [startup company](/wiki/Startup_company), Metadream, would launch Bondee, a figure-style avatar messenger application. The virtual avatar application was then officially launched on January 17, 2023. ## Features Bondee is a messenger application that allows users to send and receive messages from friends and acquaintances, \"express their current mood, condition, situation,\" or others through a \"figure-style\" avatar, and \"exhibit\" it to the other person using the app. It is available on operating systems such as iOS 13.0 and above and Android 8.0 and up versions. Upon opening the app, users would be able to customize their personal \"3D virtual\" self from a \"wide selection\" of avatars, hairstyles, clothing, shoes, and accessories; then, they would be redirected to create a virtual space or home with pieces of furniture, fixtures, and fittings. Users can also participate in \"virtual\" activities such as camping, swinging, dancing, sailing, visiting each other's rooms with friends, and leaving notes. ## Reception Bondee topped [App Store](/wiki/App_store) charts in multiple countries and had over five million downloads on [Google Play](/wiki/Google_Play), \"record-breaking\" seven months faster than [Instagram](/wiki/Instagram). Since its launch in January 2023, it has gained large popularity in Asia. The application's graphics are 3D and customizable, allowing users to exhibit and pick their choices. Its interface was also compared to *[Animal Crossing](/wiki/Animal_Crossing), [Habbo Hotel](/wiki/Habbo),* and *[The Sims](/wiki/The_Sims)* for the game's functions. It also received mixed to positive reactions wherein the game was said to be \"lacking in some features\" regarding the ability to play games with friends. ## Controversy In late January 2023, Singapore-based social networking app Bondee faced allegations of unauthorized credit card transactions. Users shared screenshots online, claiming their bank accounts had been charged without consent. Bondee's parent company refuted these claims, stating that the app does not collect users' financial information. Cybersecurity experts noted that Bondee appears to be safe, as it does not request permissions beyond its scope. - Official website Archived 2023-03-25 at the [Wayback Machine](/wiki/Wayback_Machine)\n",
  "language": "en",
  "processed_at": "2026-01-12T09:57:08.076710",
  "title": "Bondee",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Bondee"
}