{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:57:16.307433"
  },
  "content": "The topic of this article **may not meet Wikipedia's notability guidelines for companies and organizations**. Please help to demonstrate the notability of the topic by citing reliable secondary sources that are independent of the topic and provide significant coverage of it beyond a mere trivial mention. If notability cannot be shown, the article is likely to be merged, redirected, or deleted. *Find sources:* \"Boon Lay Secondary School\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(April 2020)* *(Learn how and when to remove this message)*Government school in Boon Lay, Singapore **Boon Lay Secondary School** (**BLS**) is a government [secondary school](/wiki/Secondary_school) located in [Jurong West](/wiki/Jurong_West), [Singapore](/wiki/Singapore). ## History The school commenced operations in 1977 at a S$3.59 million campus at the junction of Boon Lay Way and Jalan Boon Lay, with 13 classes, seven of which were English-medium and the remaining six Chinese-medium. It was officially opened in 1979 by the then-[Member of parliament](/wiki/Member_of_parliament) for Boon Lay Ngeow Pack Hua. It became a solely English-medium school in 1998, and started operating single-session in 2000. In 1996 Boon Lay began enrolling deaf students. Specifically it educated deaf students who were required to use [sign language](/wiki/Sign_language) to communicate. In 2017 the [Government of Singapore](/wiki/Government_of_Singapore) designated [Beatty Secondary School](/wiki/Beatty_Secondary_School) as the school to educate deaf students who must use sign language, concentrating all such students at one school due to them numbering about 15. ### Principals Pre-Merger Post-Merger BothPrincipalYearsMr Ng Siok Yen1977-1981Mr Tan Kiok Ngiap1981-1982Mr Kiat Jun Ngin1982-1988Mr Toh Chye Seng1988-1992Mrs Yu Sing Tong1992-1995Ms Ong Pheng Ye1995-1997Ms Lui Yin Leng1997-2000Ms Peck Soo Hiong2000-2001Ms Doris Ho2001-2008Mr Victor Giam Chong Guan2008-2014Mr Tan Chor Pang2014-2019Mr Inderjit Singh2020-2025Mr Chan Zheng Ming2025- ### Merger with Pioneer Secondary In 2017, Boon Lay Secondary School absorbed [Pioneer Secondary School](/wiki/Pioneer_Secondary_School) due to falling enrolment in both schools. ## School identity and culture ### Crest The current school crest was introduced in November 2016, in order to commemorate the merger of the school with Pioneer Secondary from then on. It depicts two people moving as one moving towards their goals, embodying a teacher and student working together. Its resemblance to a ladder also calls for its students to spur on to greater heights. The crest is accompanied by the acronym of the school and its Chinese name, the latter indicating the school's early years as a Chinese-medium school. ### CCA Centric School As part of the phasing-out of streaming, Boon Lay has been dividing classes by their students' co-curricular activities (CCA) since 2017. The CCAs are also divided into houses, these are Garnet, Emerald, Morganite and Sapphire. ### List of CCAs Garnet[Chinese Orchestra](/wiki/Chinese_Orchestra)[Basketball](/wiki/Basketball)[National Civil Defence Cadet Corps](/wiki/National_Civil_Defence_Cadet_Corps)CyberAceEmerald[National Cadet Corps](/wiki/National_Cadet_Corps_(Singapore))[Netball](/wiki/Netball)[Contemporary Dance](/wiki/Contemporary_Dance)[Boys' Brigade](/wiki/Boys%27_Brigade_in_Singapore)Morganite[St John Brigade](/wiki/St_John_Singapore)Audio Video Aid[Choir](/wiki/Choir)[Concert Band](/wiki/Concert_Band)Sapphire[National Police Cadet Corps](/wiki/National_Police_Cadet_Corps)[Malay Dance](/wiki/Malays_(ethnic_group)#Performing_arts)[Musical Theatre](/wiki/Musical_Theatre)[Badminton](/wiki/Badminton) ## Notable alumni - [Ken Chu](/wiki/Ken_Chu): Member, Taiwanese boy band, [F4](/wiki/F4_(band)) - Official site This Singapore school-related article is a stub. You can help Wikipedia by expanding it.\n",
  "language": "en",
  "processed_at": "2026-01-12T09:57:16.306939",
  "title": "Boon Lay Secondary School",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Boon_Lay_Secondary_School"
}