{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:57:14.026538"
  },
  "content": "Place in Singapore **Boon Lay** ([simplified Chinese](/wiki/Simplified_Chinese_characters): 文礼; [traditional Chinese](/wiki/Traditional_Chinese_characters): 文禮, [Tamil](/wiki/Tamil_language): பூன் லே) is a neighbourhood located in the town of [Jurong West](/wiki/Jurong_West) in the [West Region of Singapore](/wiki/West_Region,_Singapore). Its borders very roughly correspond to the URA subzone of **Boon Lay Place**, situated within the Jurong West Planning Area. The subzone is a division of [West Coast Group Representation Constituency](/wiki/West_Coast_Group_Representation_Constituency), under the management of West Coast Town Council. The people living there are represented by member of parliament [Desmond Lee](/wiki/Desmond_Lee_(Singaporean_politician)). ## Etymology and history The subzone was named after Chew Boon Lay (周文禮), a prominent businessman in the late 19th century and early 20th century who owned the land where the precinct stands. The War Department of the colonial government of Singapore made a requisition of 1.012 km2 (0.391 sq mi) of land from his estate and the land was subsequently named Boon Lay after Chew. This led to the growth of Boon Lay Village in the 1940s, with a population of about 420 in the early 1960s. Boon Lay Place had earthworks begun in 1969 and had their HDB flats built since 1974. ## Neighbouring Areas ## Residential Areas The only private estate in the precinct is Summerdale, while the rest consists of estates built by the government. StreetBlock numberBoon Lay Avenue185–187, 216A-216B, 217A-217B, 218A-218DBoon Lay Drive167–172, 174–179, 180A-180C, 181A-181B, 183A-183D, 188–191, 196A-196B, 197A-197D, 198–206, 237A-B, 238A-B, 239A-B, 257–261, 262–267Boon Lay Place221, 207–209, 210–215 - those in *italic* are HDB's Built-To-Order(BTO) flats which are currently under construction. ## Transportation ### Roads The main roads in the precinct are [Jalan Boon Lay](/wiki/Jalan_Boon_Lay), Boon Lay Way, Corporation Road and Jurong West Avenue 2, which bounds the precinct and connects it to the rest of the island through linking with the [PIE](/wiki/Pan_Island_Expressway) (exits 34 and 36), with minor roads (Boon Lay Avenue, Boon Lay Drive and Boon Lay Place) winding through the various estates in the precinct. ### Public transport #### Connection to MRT The precinct is situated between [Boon Lay](/wiki/Boon_Lay_MRT_station) and [Lakeside](/wiki/Lakeside_MRT_station) stations. Connection **to both stations** is available through feeder bus services **240** and **246** and trunk bus services **30**, **154**, **157** and **180**, depending on direction of travel. #### Connection to other areas - Connection to [Nanyang](/wiki/Nanyang,_Singapore), [Gek Poh Ville](/wiki/Gek_Poh_Ville), [Hong Kah](/wiki/Hong_Kah), [Yuhua](/wiki/Yuhua,_Singapore), [Joo Koon](/wiki/Joo_Koon) and [Clementi](/wiki/Clementi,_Singapore) is available through trunk bus service **99**. - Connection to [Pioneer](/wiki/Pioneer,_Singapore), [Hong Kah](/wiki/Hong_Kah), [Yuhua](/wiki/Yuhua,_Singapore), [NUH](/wiki/National_University_Hospital), [One-North](/wiki/One-North), [Buona Vista](/wiki/Buona_Vista), [Tanglin Halt](/wiki/Tanglin_Halt), [Queenstown](/wiki/Queenstown,_Singapore) and [Bukit Merah](/wiki/Bukit_Merah) is available through trunk bus service **198**. - Connection to [Pioneer](/wiki/Pioneer,_Singapore), [Bukit Batok](/wiki/Bukit_Batok), [Bukit Timah](/wiki/Bukit_Timah), [Holland Village](/wiki/Holland_Village,_Singapore) and the city is available through trunk bus service **174**. - Direct connection to the city is available through express bus service **502**. ### Interstate bus services In addition to local buses, Malaysian [Inter-State Express Buses](/wiki/Coach_(vehicle)) start off from the former Savoy cinema to specific destinations in Malaysia as an alternative to the bus terminals located downtown such as those at Kallang Bahru Bus Terminal and Golden Mile Shopping Centre. Tickets can be bought from ticket agents at Boon Lay Shopping Centre. ## Schools There is 1 primary school (Boon Lay Garden), 2 secondary schools ([Boon Lay Secondary School](/wiki/Boon_Lay_Secondary_School) and [River Valley High](/wiki/River_Valley_High_School,_Singapore)) and many childcare centres in the precinct. ## Other facilities The town centre is located at Boon Lay Place and is where the residents of Boon Lay bond with each other while meeting their daily needs. It is accessible from all parts of the precinct through feeder bus service **240** and **246** and trunk bus service **99**. There are 2 churches (The Church of Saint Francis of Assisi and Jurong Church of Christ) and 1 Chinese temple known as Tuas Pek Kong Keng Temple (大士伯公宫) in the precinct and all of them are found in the town centre. There is a Boon Lay Hawker at the town centre where local food can be found. The precinct's community centre (**Boon Lay Community Centre**) is located at the junction of Boon Lay Place and Boon Lay Avenue, as part of the town centre. It was upgraded from 2010 to 2011. ### Boon Lay Shopping Centre Managed by [HDB](/wiki/Housing_and_Development_Board), this is the shopping centre that caters mainly to the residents of Boon Lay Place. An anchor tenant in this shopping centre is NTUC Fairprice. The shopping centre has been upgraded with new facilities likes elevators and escalators since late 2012. ### Book sources - Ong Chwee Im; [Chew Kheng Chuan](/wiki/Chew_Kheng_Chuan) & Evelyn Chew. (2002). Chew Boon Lay: A Family Traces its History. Singapore: The Compiler. [ISBN](/wiki/ISBN_(identifier)) 981-04-7740-6 - West Coast Town Council - Boon Lay Place @ sg.pagenation.com - URA – Planning Area Boundaries @ ura.gov.sg - NEA – List of Government Markets / Hawker Centres @ nea.gov.sg - SBS Transit- Upgrading of Boon Lay Bus Interchange - Boon Lay Constituency Website\n",
  "language": "en",
  "processed_at": "2026-01-12T09:57:14.026020",
  "title": "Boon Lay",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Boon_Lay"
}