{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:57:23.076356"
  },
  "content": "Singaporean chain of American restaurants **Botak Jones** is a national chain of [American food](/wiki/Cuisine_of_the_United_States) restaurants in [Singapore](/wiki/Singapore). The company was founded in 2003 by Bernard \"Bernie\" Allen Utchenik, following a few failed tries at the food industry. ## History The business began in 2003, when [former U.S. citizen](/wiki/List_of_former_United_States_citizens_who_relinquished_their_nationality) Bernard \"Bernie\" Allen Utchenik, also known as \"Botak\", established the first Botak Jones outlet in [Tuas](/wiki/Tuas), Singapore, after two failed food ventures. At least a year before the opening of the business, Utchenik was already running large advertisements for Botak Jones in the newspapers. In 2009, there were eleven Botak Jones locations islandwide in Singapore. In March 2013, Botak Jones was listed as one of the five best \"western food stalls\" by CEOs' Hawker Choices. Utchenik sold the business prior to mid-2013, when he opened a new restaurant, BJ's American Diner and Grill. ## Products Botak Jones' menu predominantly comprises American cuisine. Select outlets serve only [halal](/wiki/Halal) food, so as to cater to Muslim consumers. All of Botak Jones' food products are claimed to be free of \"chemical flavourings, tenderizers, binders and MSG\". Food items are served in relatively large portions, although \"Mini-Me\" portions are available for order. Botak Jones also offers catering services. In 2009, the company organised an [eating contest](/wiki/Eating_contest), where one had to wolf down a \"Botak Massive\" in the fastest time possible. Winning prizes included a holiday trip overseas. Botak Jones has also introduced a \"Botak Customer Appreciation Card\" scheme, by which customers get certain discounts after accumulating a certain amount of food purchases in cash. - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T09:57:23.075820",
  "title": "Botak Jones",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Botak_Jones"
}