{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:57:28.313367"
  },
  "content": "Singapore engineering companyThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Boustead Singapore\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(February 2025)* *(Learn how and when to remove this message)* **Boustead Singapore Limited** ([SGX](/wiki/Singapore_Exchange): F9D ) is an engineering services group listed on the [Singapore Exchange](/wiki/Singapore_Exchange) and headquartered in [Singapore](/wiki/Singapore). The group's engineering divisions specialise in energy-related engineering and industrial real estate solutions. Boustead also has a geospatial technology arm which distributes [Esri](/wiki/Esri) geographic information systems to major markets across Australia and South East Asia. Boustead is listed on the [MSCI Global](/wiki/MSCI_World) Small Cap Index for Singapore and the [FTSE](/wiki/FTSE_Group) ST Small Cap Index. ## History ### Early history [Edward Boustead](/wiki/Edward_Boustead), an English businessman, founded [Boustead & Co](/wiki/Boustead_%26_Co) in 1828. The [trading company](/wiki/Trading_company) specialised in import and export, offering goods such as banca tin, spices, saps, rattan, medicinal herbs, silk and tea widely available in [South East Asia](/wiki/South_East_Asia) in exchange for Western products like cloth, oil and machinery. With the development of a wide trading network in Singapore, trade credit and finance became increasingly important to banks, merchants, manufacturers and traders. Boustead & Co, being one of the largest trading houses of the Far East, was the first agent for [Hongkong and Shanghai Bank](/wiki/The_Hongkong_and_Shanghai_Banking_Corporation) in Singapore, offering banking facilities, accepting and discounting bills, giving loans and accepting deposits. ### Establishment of commodity markets By 1899, Singapore had become the world's main exporter of [tin](/wiki/Tin). Boustead & Co played a leading role as promoter and investor in the tin smelting facility on [Pulau Brani](/wiki/Pulau_Brani), constructed by the [Straits Trading Company](/wiki/Straits_Trading_Company). From that point onwards, Straits Tin became one of the leading businesses of Boustead & Co. During the late 1880s, Boustead & Co introduced [rubber](/wiki/Rubber) trees into Malaysia using seeds germinated by [Sir Henry Wickham](/wiki/Henry_Wickham_(explorer)) at [London's Botanical Gardens](/wiki/Royal_Botanic_Gardens,_Kew) located in Kew. Boustead & Co went on to be a leading rubber plantation manager and owner in [Malaysia](/wiki/Malaysia), acting as secretaries, registrars and agents for 49 plantations with a total planted area of 141,629 acres (573 km2). The company played a pioneering role in the development of commodity markets for tin, [oil](/wiki/Oil), rubber and [palm oil](/wiki/Palm_oil), among other commodities. All of these commodities played important roles in global development and industrialisation. In 1892, Boustead handled the first shipment of bulk oil to Penang. Shortly after, the Shell Trading and Transport Company was formed. Isaac Henderson, a Boustead partner was one of the founding directors of the new company, now known simply as [Shell](/wiki/Royal_Dutch_Shell). Boustead & Co represented Shell in its products including kerosene, motor spirit and fuel oil for shipping in Singapore and Penang, along with fabricating many installations for Shell's facility on [Pulau Bukom](/wiki/Pulau_Bukom). ### Shipping and marketing business By the 1860s, Boustead & Co entered the shipping and insurance business, to capture trading opportunities arising from the opening of the [Suez Canal](/wiki/Suez_Canal). The company's shipping division was the largest in Singapore, with 1,000 vessels in port which represented 60 owners and handled 500,000 tonnes per year. Boustead represented over 20 major shipping lines and numerous insurance agencies including the renowned Lloyd's, which Boustead represented for more than one century. Later on, the company diversified into businesses such as estate management, marketing and mining. The marketing division was the brand agent responsible for introducing some of the world's greatest brands to Singapore and the region. Boustead built a reputation as one of the most sought-after managing agencies of the Far East, and distributed and marketed brands such as [Baileys](/wiki/Baileys_Irish_Cream), [Bacardi](/wiki/Bacardi), [Cadbury's](/wiki/Cadbury_plc), [Del Monte](/wiki/Del_Monte_Foods), Dornbracht, Dow Consumer Products, Dupont Corian, [Gillette](/wiki/Gillette_(brand)), [Hennessy](/wiki/Hennessy), Hisamitsu Pharmaceutical, Jacobs Manufacturing, [Jim Beam](/wiki/Jim_Beam), Jockey, [Johnnie Walker](/wiki/Johnnie_Walker), Kao, Lloyd's, [Maidenform](/wiki/Maidenform), [Martini & Rossi](/wiki/Martini_%26_Rossi), [Moet & Chandon](/wiki/Moet_%26_Chandon), [Nestle](/wiki/Nestle), [Nissan](/wiki/Nissan), [Ovaltine](/wiki/Ovaltine), [Pedigree](/wiki/Pedigree_Petfoods), [Poggenpohl](/wiki/Poggenpohl), [Procter & Gamble](/wiki/Procter_%26_Gamble), [Sandvik](/wiki/Sandvik), Shell, Slazenger, [Smirnoff](/wiki/Smirnoff), [Speedo](/wiki/Speedo), [Suzuki](/wiki/Suzuki), Thomas Cook, Trebor and [Villeroy & Boch](/wiki/Villeroy_%26_Boch). ### War and restructuring Due to major political changes in Malaya and Singapore, the period of 1957 to 1965 saw Boustead & Co divided into three separate companies in Singapore, the [United Kingdom](/wiki/United_Kingdom) and Malaysia. Each company carried the same name and was listed on their respective stock exchanges. Boustead Singapore Limited was listed on the Singapore Stock Exchange on 17 October 1975. After the split, Boustead Singapore lost control of most of the assets and properties, which by default went to Malaysia due to their geographical presence. However, Boustead Singapore's trading arm held many contracts for the marketing and distribution of consumer goods, while the engineering division sought out new markets for its design and project management services. The company was able to grow its business, under the leadership of Boustead executives who had been with the company for a long time. The nature of the company's businesses in Singapore also began to change, with activities focused mainly on manufacturing and technical services. ### New leadership In 1996, Wong Fong Fui bought over Boustead Singapore, with the company centering its core operations on infrastructure-related engineering services and geo-spatial technology. ## Prominent people associated with Boustead's history Wealthy Malacca-born merchant, Chia Ann Siang joined Boustead & Co in 1848. During his time with Boustead & Co, he became a partner of the firm Geok Teat and Company. After working for 42 years, Chia decided to retire and went into the timber business. He was a wealthy landowner and a leading merchant in Singapore's history. Chia purchased a small hill which used to be the homes of clan associations and shophouses, named after himself as [Ann Siang Hill](/wiki/Ann_Siang_Hill). Edward Boustead commissioned [George Coleman](/wiki/George_Drumgoole_Coleman), the Irish leading architect of Singapore at that time, to design and build the headquarters of Boustead & Co. The warehouse was known as the house of seven and twenty pillars\", located around the corner from High Street. In 1834, Boustead partnered with German-born merchant, [Gustav Christian Schwabe](/wiki/Gustav_Christian_Schwabe) in the Singapore company. Schwabe and his cousin established Sykes Schwabe & Co in Liverpool. The Liverpool partner would export products like textiles, biscuits, brandies and steel to the East, while the Singapore partner would trade with Eastern produce such as coffee and spices. Singapore merchant, [Tan Kim Seng](/wiki/Tan_Kim_Seng), was a middleman in Boustead's trading activities. Tan was also a good friend of Edward Boustead. He helped to amass small shipments of produce from local traders for Boustead, who would then ship the produce to the West. Tan was well known for his contribution towards the building of Singapore's first public waterworks in 1857. Boustead & Co had a successful investment business in commodities, ships and properties, bringing new companies to the London Stock Exchange and private investors. Edward Boustead himself was a trusted advisor to retirees who wanted to invest their retirement and pension funds. One of these retirees was Captain Thomas Douglas Scott who was master mariner of Laju, the largest and fastest sailing ship on the China Seas in the late 1800s. ## Group structure Boustead's business divisions by category: **Energy engineering** - Boustead International Heaters (downstream oil & gas/petrochemicals) - Boustead Controls & Electrics (upstream oil & gas) **Real estate** - Boustead Projects (industrial facilities and industrial parks) **Geospatial** - [Boustead Geospatial Technologies](/wiki/ESRI_Australia) - [Esri Australia](/wiki/ESRI_Australia) - Esri Bangladesh - Esri Indonesia - Esri Malaysia - Esri Singapore **Healthcare** - Boustead Medical Care (BMEC) Holdings - BMEC - Beijing Pukang Sport & Medical Co ## Subsidiaries ### Energy engineering #### Downstream oil & gas Boustead International Heaters designs, engineers and supplies process heater systems, [waste heat recovery units](/wiki/Waste_heat_recovery_unit), [heat recovery steam generators](/wiki/Heat_recovery_steam_generator) and once through steam generators to the downstream oil & gas industries. Process heater systems are critical to the distillation and separation of crude oil and natural gas into the many [petroleum](/wiki/Petroleum) products (e.g. [asphalt](/wiki/Bitumen), heavy bunker oil, [diesel fuel](/wiki/Diesel_fuel), [gasoline](/wiki/Gasoline), [kerosene](/wiki/Kerosene), [LPG](/wiki/Liquefied_petroleum_gas), [LNG](/wiki/LNG), [GTL](/wiki/Gas_to_liquids)) that the world uses today. The process heaters division has participated in projects related to Shell's [Scotford Upgrader](/wiki/Scotford_Upgrader), the [Canadian Oil Sands](/wiki/Athabasca_Oil_Sands) and the [Pearl GTL](/wiki/Pearl_GTL) project in [Qatar](/wiki/Qatar). #### Upstream oil & gas Boustead Controls & Electrics designs, engineers and supplies process control systems and emergency/safety shutdown systems on oil & gas well platforms, [production platforms](/wiki/Production_platform) and [FPSOs](/wiki/Floating_Production_Storage_and_Offloading). ### Real estate Boustead Projects designs, builds and develops industrial facilities (e.g. logistics, manufacturing, office, R&D) and industrial parks for multinational corporations in industries ranging from [aviation](/wiki/Aviation), biomedical, high-tech manufacturing to lifestyle and logistics, among others. Boustead Projects has played a key role in building numerous industrial facilities within [JTC Corporation](/wiki/JTC_Corporation)'s industrial parks including the [Airport Logistics Park](/wiki/Airport_Logistics_Park) of Singapore and the knowledge-driven Paya Lebar iPark. Boustead Projects also delivered seven projects in [Seletar Aerospace Park](/wiki/Seletar_Aerospace_Park), a rapidly developing integrated aerospace hub in Singapore catering to global aerospace corporations which host and support aviation activities. The industrial real estate division holds a portfolio of properties leased out to MNCs in the aviation, high-tech manufacturing and logistics industries. ### Geospatial Boustead is a major shareholder of subsidiaries [Esri Australia](/wiki/ESRI_Australia) and Esri South Asia. Esri Inc has a global market share of 40%, with over 350,000 organisations using Esri GIS solutions[*buzzword*] in more than 200 countries worldwide.[*citation needed*] Geo-spatial technology applications include the management of homeland defence (e.g. anti-terrorism, police), natural resources (e.g. mining, oil & gas, timber), transportation networks (e.g. airports, ports, roads) and utility networks (e.g. power grids, water and sewage systems), among others. - [Boustead & Co](/wiki/Boustead_%26_Co)\n",
  "language": "en",
  "processed_at": "2026-01-12T09:57:28.312894",
  "title": "Boustead Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Boustead_Singapore"
}