{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:57:26.874326"
  },
  "content": "* *Boustead Institute** was a building located at the junction of Tanjong Pagar Road and Anson Road in Singapore which initially served as a hostel for seamen. It later housed the Toby's Paradise bar, and was demolished in the 1970s. ## History The institute was completed in June 1892. The construction of the building was funded with the money wealthy businessman [Edward Boustead](/wiki/Edward_Boustead) bequeathed upon his death in 1888 to finance the construction of a building for the seamen. It was formally opened on 2 July by the governor of the [Straits Settlements](/wiki/Straits_Settlements), [Cecil Clementi Smith](/wiki/Cecil_Clementi_Smith). The institute stood at the junction of Tanjong Pagar Road and Anson Road, and faced the Tanjong Pagar Police Station. During the [Japanese occupation of Singapore](/wiki/Japanese_occupation_of_Singapore), the building was converted into the Harbour headquarters. By the end of the occupation, the building had been completely stripped. In 1946, the building was temporarily converted into a courthouse for minor war crimes. The War Crimes Court No. 2 was located on the institute's second floor while the War Crimes Court No. 7 was located on the institute's ground floor. The institute officially reopened on 1 May 1947. The building was renovated and redecorated in May 1951. In 1958, the building was sold to Chan Wing Seng and his brother Chan Wing Fook. Following this, a bar, Toby, was established in the building. A year later, it became the Paradise bar. The building was demolished in the late 1970s to make way for port expansion works. 1°16′21″N 103°50′30″E﻿ / ﻿1.2724°N 103.8416°E﻿ / 1.2724; 103.8416\n",
  "language": "en",
  "processed_at": "2026-01-12T09:57:26.873938",
  "title": "Boustead Institute",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Boustead_Institute"
}