{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:57:25.442593"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Boustead & Co.\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(September 2015)* *(Learn how and when to remove this message)* **Boustead & Co.** is an asset management and corporate finance company created by [Edward Boustead](/wiki/Edward_Boustead) in 1828 that still exists today. ## History In 1828, Edward Boustead arrived in [Singapore](/wiki/Singapore) on board the British ship *Hindustan*. In the same year, he established a trading company, Boustead & Co. Boustead & Co specialised in import and export, offering goods such as banca tin, spices, saps, rattan, medicinal herbs, silk and tea widely available in [South East Asia](/wiki/South_East_Asia) in exchange for Western products like cloth, oil and machinery. Boustead & Co commissioned Irish civil architect, [George Drumgoole Coleman](/wiki/George_Drumgoole_Coleman) to design the company's headquarters alongside the [Singapore River](/wiki/Singapore_River). The warehouse was known as \"the house of seven and twenty pillars\", located around the corner from High Street. In 1834, Boustead & Co partnered with German-born merchant, [Gustav Christian Schwabe](/wiki/Gustav_Christian_Schwabe) in the Singapore company. Schwabe and his cousin established Sykes Schwabe & Co in [Liverpool](/wiki/Liverpool). The Liverpool partner would export products like textiles, biscuits, brandies and steel to the East, while the Singapore partner would trade with Eastern produce such as coffee and spices. The freedom of port made Singapore an ideal market for trading among imported manufacturers. Import of Western commodities such as textiles and machinery had to be balanced with exports of Eastern produce such as copra, coconut, pepper and tapioca. Boustead & Co had a \"Balance of Trade\", where demand for goods from the East had to be balanced with demand for goods from the West. Singapore merchant, [Tan Kim Seng](/wiki/Tan_Kim_Seng), was a middleman in Boustead's trading activities. He was also a good friend of Boustead. Tan amassed small shipments of produce from local traders for Boustead, who would then ship the produce to the West. ## Role in development of Singapore Boustead & Co. was the first agent for [Hongkong and Shanghai Bank](/wiki/The_Hongkong_and_Shanghai_Banking_Corporation) in Singapore, offering banking facilities to businesses. Brokers and sellers could draw a specific percentage of advances against the value of their goods stored in the Boustead warehouse. Such financing was called \"trust receipts\", where the merchant would hold the goods in trust for the banks. As trade credit and finance became increasingly important to banks, merchants, manufacturers and traders, Boustead & Co strengthened its position against competing houses—including the reputable trading houses of [Jardine Matheson](/wiki/Jardine_Matheson), [Guthrie & Co Ltd](/wiki/Guthrie_(company)), [Harrisons and Crosfield Ltd](/wiki/Elementis), Maclaine, Watson and Co Ltd, [Sime Darby & Co Ltd](/wiki/Sime_Darby), and others—by establishing a wide trading network and became one of the leading British merchant banking houses, greatly contributing to Singapore's trading activities and economy. In 1850, the London headquarters was established to oversee the other offices in Hong Kong, [Manila](/wiki/Manila), [Shanghai](/wiki/Shanghai) and Singapore. During the late 1880s, Boustead & Co took advantage of the introduction of the rubber tree to Malaysia and eventually became a leading rubber plantation manager and owner of 49 rubber plantations with a total planted area of 141,629 acres. In 1892 Boustead & Co handled the first shipment of bulk oil to Penang and shortly after this the Shell Transport and Trading Company was formed with Isaac Henderson acting as one of its original directors. Boustead represented and operated on Shell's behalf in Penang until 1920 when Shell opened its own branch. By 1899, Singapore had become the world's main exporter of tin. Boustead & Co played a leading role as promoter and investor in the tin smelting facility on Pulau Brani, constructed by the [Straits Trading Company](/wiki/Straits_Trading_Company). From that point forward, Straits Tin became one of the leading businesses of Boustead & Co. Over the decades, the excellent reputation of Boustead & Co allowed it to attract some of the world's most famous brands to give it agency rights in Singapore and around the region. Some of the famous brand names that became synonymous with Boustead were [Cadbury's](/wiki/Cadbury%27s), [Nestlé](/wiki/Nestl%C3%A9), [Del Monte](/wiki/Del_Monte_Foods), [Gillette](/wiki/Gillette_(brand)), [Procter & Gamble](/wiki/Procter_%26_Gamble), [Johnnie Walker](/wiki/Johnnie_Walker), [Hennessy](/wiki/Hennessy), [Moët & Chandon](/wiki/Mo%C3%ABt_%26_Chandon), [Nissan](/wiki/Nissan), [Suzuki](/wiki/Suzuki) and Thomas Cook. ## 20th and 21st centuries After [Edward Boustead](/wiki/Edward_Boustead)'s death in 1888, Boustead & Co.'s associates took over the business. Boustead Plc (formerly known as Taiping Rubber Plantations Limited) was founded in 1910 and eventually listed as Boustead Plc on the [London Stock Exchange](/wiki/London_Stock_Exchange). Having survived World War I, Boustead & Co continued to play a significant role in the expansion of Singapore as the world's largest port, with a booming business in cargo, freight handling, insurance and ship services. By 1940 Boustead & Co represented over 20 major shipping lines and numerous insurance agencies including the renowned [Lloyd's of London](/wiki/Lloyd%27s_of_London), which Boustead would represent for more than a century. After World War II, Malaysia declared independence from the British in August 1957 and Singapore declared independence from Malaysia in 1965. This saw Boustead & Co split into three entities, Boustead plc in London, [Boustead Holdings Berhad](/wiki/Boustead_Holdings_Berhad) in Malaysia and [Boustead Singapore Limited](/wiki/Boustead_Singapore_Limited) which listed on the [Singapore Stock Exchange](/wiki/Singapore_Exchange) on 17 October 1975. In 2012 Boustead Limited originated from Boustead plc and was renamed later Boustead & Co Ltd, which is the holding company for financial services, including corporate finance, principal investing and asset management. In 2014 Boustead & Co. co-founded Noble Tree Property Investment, a property company focused on [socially responsible investing](/wiki/Socially_responsible_investing) that develops, owns, lets and sells affordable housing and specialty supported housing developments across the United Kingdom. In 2015 Boustead & Co. founded Boustead Asset Management Ltd in [Mauritius](/wiki/Mauritius) to serve as the investment advisor to Boustead Investment Fund, a social [impact investment](/wiki/Impact_investment) fund with a focus on investing in socially responsible investments. The asset manager and fund are regulated by the [Financial Services Commission](/wiki/Financial_Services_Commission_(Mauritius)) in Mauritius (FSC) and were granted a Collective Investment Scheme Manager Licence and Category 1 Global Business Licence by the FSC. - Companies portal - Official Website\n",
  "language": "en",
  "processed_at": "2026-01-12T09:57:25.442143",
  "title": "Boustead & Co.",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Boustead_%26_Co."
}