{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:57:30.841866"
  },
  "content": "Singaporean youth organizationThis article **contains promotional content**. Please help improve it by removing promotional language and inappropriate external links, and by adding encyclopedic text written from a neutral point of view. *(February 2011)* *(Learn how and when to remove this message)* **The Boys' Brigade in Singapore** is a youth uniformed group and part of the global [Boys' Brigade](/wiki/Boys%27_Brigade) movement which has been present in [Singapore](/wiki/Singapore) since 1930. It currently consists of over 900 officers and 5,600 Boys in over 130 Companies. The current Brigade President is Patrick Koh Ley Boon and the Honorary President is Lieutenant-General (Ret) [Winston Choo](/wiki/Winston_Choo), the former [Chief of Defence Force](/wiki/Chief_of_Defence_Force_(Singapore)) of the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces). The [President of Singapore](/wiki/President_of_Singapore) is the Patron of the Boys' Brigade in Singapore. ## History The [Boys' Brigade](/wiki/Boys%27_Brigade) was introduced to Singapore by [James Milner Fraser](/wiki/James_Milner_Fraser), an architect from [Britain](/wiki/UK). He was a former member of the 23rd Aberdeen and the 23rd London Companies. On 12 January 1930, Fraser started the 1st Singapore Company at [Prinsep Street Presbyterian Church](/wiki/Prinsep_Street_Presbyterian_Church). With the aid of ex-Sergeant Quek Eng Moh of the 1st [Swatow](/wiki/Swatow) Company, he assembled 12 local Boys to form the company. In August 1930, when the company was officially enrolled at the Boys' Brigade Headquarters in London, the membership consisted of 40 youths. The company chaplain was Reverend William Murray and Fraser's lieutenants were John McNeish (formerly of 76th [Glasgow](/wiki/Glasgow)) and Dong Chui Sing. [Bible class](/wiki/Bible_study_(Christian)), drill, concerts, wayfaring, [signalling](/wiki/International_Code_of_Signals), [first aid](/wiki/First_aid), swimming, fencing, [tumbling](/wiki/Tumbling_(gymnastics)) and other forms of physical recreation formed the core of the Boys' Brigade syllabus. In 1931, the first camp was held at the Singapore Volunteer Camp at [Siglap](/wiki/Siglap). The 2nd Singapore Company was formed at [Kampong Kapor Methodist Church](/wiki/Kampong_Kapor_Methodist_Church) in February 1931. By 1936, the Singapore Battalion had 200 members. The 3rd Singapore Company was founded in 1933 at the [Anglo-Chinese Continuation School](/wiki/Anglo-Chinese_Continuation_School). In 1934, the 5th Singapore Company was founded at Choon Guan Presbyterian Boys School, the 4th Company at Geylang Methodist Church, and the 6th Singapore at Paya Lebar Methodist Church. The Battalion Colors were presented to the battalion by [Frank Cooper Sands](/wiki/Frank_Cooper_Sands)(former brigade chairman of the Singapore Officers' Council and later an honorary vice-president of the Battalion) in 1936 and the drill competition was introduced. Fraser served as the Battalion President from 1936 to 1956. In 1940, he handed the captaincy of the 1st Singapore Company over to one of his Boys, S. P. Chua. During the war years of 1942 to 1945, the Brigade's activities were suspended. The Battalion destroyed its Colors to avoid destruction in the war, but some of the drums were stored in a room at Prinsep Headquarters. After the war, S. P. Chua revived the 1st Singapore Company. By 1950, the Battalion membership had reached its pre-war membership. On 7 May 1967, the brigade held a fundraising walk from [Anglo-Chinese School](/wiki/Anglo-Chinese_School_(Barker_Road)) to [Dunearn Road](/wiki/Dunearn_Road), covering 9 miles (14 km). The walk was [flagged off](/wiki/Flag_off) by [Tan Boon Chiang](/wiki/Tan_Boon_Chiang), honorary president of the brigade, and about 350 boys participated. By 1968, there were 28 companies in Singapore. In 1971, the [President of the Republic of Singapore](/wiki/President_of_the_Republic_of_Singapore) became the Battalion's Patron. As the Brigade approached its 85th anniversary in 2015, it conducted its first Trooping of Colours parade and reunion dinner in over a decade with the then Education Minister [Heng Swee Keat](/wiki/Heng_Swee_Keat) as the Guest-of-Honor. In December 2023, the Brigade moved to its new Headquarters at 10 Kwong Avenue from 105 Ganges Avenue. ## Organisation ### Headquarters A list of honorary office-bearers include: PositionBearerPatronMr [Tharman Shanmugaratnam](/wiki/Tharman_Shanmugaratnam) President of the Republic of SingaporeHonorary PresidentLG (Ret) [Winston Choo](/wiki/Winston_Choo) Wee Leong, MSM(Military), PPA(E), PPA(E) Military, PBMHonorary Vice-presidents (Clerical)Bishop Dr Titus Chung (Anglican) Bishop Lu Guan Hoe (Lutheran) Bishop Dr Gordon Wong (Methodist) Rev Dr Christopher Chia (Presbyterian)Honorary Vice-presidents (Lay)Dr Lee Soo Ann, PBM Mr Sam Tan Boon Yeow, PBM Mr Peter Tay Yew Beng Mr Peter Foo Chien Ho, PBM Mr Choo Gim Kang Mr Tan Kok Heng, PPA,PP,PBS Dr Ho Yew Kee, PBS, PBM Mr Poh Leong Berg **The Brigade Executive** The Brigade Executive is the decision-making body of The Boys Brigade. In January 2007, the Brigade implemented the Cluster Structure and grouped the BB Companies into 10 clusters with an average of 10 to 15 Companies in each cluster. These clusters are similar to the school clusters of the Ministry of Education. PositionBearerBrigade PresidentMr Patrick Koh Ley BoonVice-presidentsMr Timothy Tan Jiat Meng (Finance & Infrastructure) Dr Andrew Yong Yun Leong (Future Operations) Mr Oliver Loke Jia Wen (Innovation & Learning) Mr Daniel Lim Wei Chong (Strategic Partnership) Brigade SecretaryMr Wilson Tan Teck HianAssistant Brigade SecretaryMr Ho Yew KeongBrigade TreasurerMr Chong Loi FoongBrigade ChaplainRevd Daniel Tong Wee HwaAssociate Brigade ChaplainRevd Benjamin FongStanding Committees ChairmenMr Alex Lum Kah Heng (Activities) Mr Lim Choo Siang (Facilities) Mr Caleb Cheong(Training) Mr Gerard Su Jin Song (Juniors Programme) Ms Philisa Neo Ching Lu (Seniors Programme) Mr Kenneth Cheng Zemin (Primers Programme) Cluster RepresentativesRevd Daniel Tay Ban Hong (North 1) Mr Foo Jia Ming (North 2) Ms May Seah Yi (North 3) Mr Daryl Chen Weiming (South 1) Mr Brendan Loon Kin Yip (South 2) Mr Low Jian Xin (East 1) Mr Andy Chua Kok Hwang (East 2) Mr Gabriel Leng Chengda (West 1) Mr David Oh Tai Wai (West 2) Ms Avery Ho Yi Ling (West 3) Executive DirectorMr Desmond Koh **The Brigade Office** The Brigade Office implements the strategic plans developed by the Brigade Executive. PositionBearerExecutive DirectorMr Desmond KohDeputy Executive DirectorMs Ang Hui Leng ### Companies Each BB Company is managed by a partnership of members from the sponsoring church and the school where the company is based, if present. They are led by the Chaplain and Captain from the church, and typically assisted by a team of Teachers-in-Charge of the school. Assisting them are Officers, Primers and other VALs either from the church, from other churches or as former members of the Company. BB Companies are identified by a unique number, with an exception of Companies catered for the Primers Programme. In general, the smaller the number is, the earlier the Company was founded. For example, the 1st Singapore Company has the longest history in Singapore. While this is true for most Companies, the same cannot be said for certain Companies as the number was \"recycled\" (especially in the 1980s and early 1990s). The majority of the Companies are catered for the Seniors Programme. Companies with a \"J\" indicate the Juniors Programme. Every Company also has a sponsoring school where new boys are recruited annually, and weekly parades are held. The BB companies in Singapore are divided into 10 Clusters – North 1, North 2, North 3, East 1, East 2, South 1, South 2, West 1, West 2 and West 3. Each Company is categorised into the appropriate Cluster based on its geographical location. CompanySponsoring ChurchSponsoring SchoolStatus1stPrinsep Street Presbyterian ChurchYusof Ishak Secondary SchoolActive1JPrinsep Street Presbyterian ChurchPioneer Primary SchoolActive2ndKampong Kapor Methodist Church[Victoria School](/wiki/Victoria_School)Active4thFaith Community Baptist ChurchWhitley Secondary SchoolDefunct5JLiving Praise Presbyterian ChurchKuo Chuan Presbyterian Primary SchoolActive5thAdam Road Presbyterian ChurchKuo Chuan Presbyterian Secondary SchoolActive7JChurch of the AscensionSt Andrew's School (Junior)Active7thChapel of the Holy SpiritSt Andrew's School (Secondary)Active8JFairfield Methodist ChurchRadin Mas Primary SchoolActive9thChurch of the Good ShepherdWestwood Secondary SchoolActive10thToa Payoh Methodist ChurchBeatty Secondary SchoolActive11thLight of Christ Church Woodlands[Christ Church Secondary School](/wiki/Christ_Church_Secondary_School)Active12BRJ**A**Barker Road Methodist Church[Anglo-Chinese School (Primary)](/wiki/Anglo-Chinese_School_(Primary))Active12BR**A**Barker Road Methodist Church[Anglo-Chinese School (Barker Road)](/wiki/Anglo-Chinese_School_(Barker_Road))Active12JBarker Road Methodist ChurchAnglo-Chinese School (Junior)Active12IBarker Road Methodist Church[Anglo-Chinese School (Independent)](/wiki/Anglo-Chinese_School_(Independent))Active13thGlory Joy Christian ChurchSembawang Secondary SchoolActive14thAll Saints' Church (English Congregation)[Anglican High School](/wiki/Anglican_High_School,_Singapore)Active16JGood Gifts City ChurchInternational Community SchoolActive17thCharis Methodist Church[Loyang View Secondary School](/wiki/Loyang_View_Secondary_School)Active19thYishun Christian Church (Lutheran)Yishun Town Secondary SchoolActive20JJesus My King ChurchGreendale Primary SchoolActive21JChristalite Methodist ChapelGeylang Methodist School (Primary)Active21stChristalite Methodist Chapel[Geylang Methodist School (Secondary)](/wiki/Geylang_Methodist_School_(Secondary))Active22JAng Mo Kio Presbyterian ChurchAnderson Primary SchoolActive23rdPentecost Methodist ChurchSpringfield Secondary SchoolActive24JSt John's – St. Margaret's ChurchFuhua Primary SchoolActive25thFaith Methodist ChurchHillgrove Secondary SchoolActive27thAng Mo Kio Presbyterian Church[Presbyterian High School](/wiki/Presbyterian_High_School)Active28JNew Life Baptist ChurchShuqun Primary SchoolActive28thJurong Christian ChurchYuhua Secondary SchoolActive29JBethesda Hall (Ang Mo Kio)Mayflower Primary SchoolActive31stAng Mo Kio Methodist ChurchBowen Secondary SchoolActive32ndFull Gospel AssemblyHeritage Academy @ Thomson CampusActive33JAldersgate Methodist ChurchFairfield Methodist School (Primary)Active33rdAldersgate Methodist ChurchFairfield Methodist School (Secondary)Active34thAdam Road Presbyterian ChurchMarsiling Secondary SchoolActive35JFairfield Methodist ChurchZhangde Primary SchoolActive36thChurch of the Epiphany (English Congregation)Compassvale Secondary SchoolActive37thFaith Community Baptist ChurchHougang Secondary SchoolActive38JS-Word Evangelical Free ChurchKeming Primary SchoolActive39thLutheran Church of Our RedeemerSwiss Cottage Secondary SchoolActive40thBedok Methodist ChurchChangkat Changi Secondary SchoolActive41JFaith Community Baptist Church[Tao Nan School](/wiki/Tao_Nan_School)Active42JAdam Road Presbyterian ChurchNanyang Primary SchoolActive44thWoodlands Evangelical Free ChurchFuchun Secondary SchoolDefunct45thLiving Sanctuary Brethren Church[Xinmin Secondary School](/wiki/Xinmin_Secondary_School)Active46thGeylang Evangelical Free ChurchJunyuan Secondary SchoolActive47thTrinity Methodist ChurchSerangoon Garden Secondary SchoolActive48thBethel Presbyterian Church[Zhonghua Secondary School](/wiki/Zhonghua_Secondary_School)Active49JChapel of Christ the Redeemer[St Hilda's Primary School](/wiki/St_Hilda%27s_Primary_School)Active49thChapel of Christ the RedeemerSt Hilda's Secondary SchoolActive50thFairfield Methodist Church[Gan Eng Seng School](/wiki/Gan_Eng_Seng_School)Active52JSt John's Chapel[Pei Tong Primary School](/wiki/Pei_Tong_Primary_School)Active53rdImpact Life Church[Bukit Batok Secondary School](/wiki/Bukit_Batok_Secondary_School)Active55JBethesda CommunityFengshan Primary SchoolActive56JGlory Presbyterian Church (English)[Bukit Timah Primary School](/wiki/Bukit_Timah_Primary_School)Active57JGlory Presbyterian Church (English)Pei Hwa Presbyterian Primary SchoolActive58thNew Life Bible-Presbyterian ChurchRiverside Secondary SchoolActive59JSt John's ChapelGreenridge Primary SchoolActive60thKampong Kapor Methodist Church[Raffles Institution](/wiki/Raffles_Institution)Active61stChurch of Our SaviourQueensway Secondary SchoolActive62ndKingdomcity SingaporeOrchid Park Secondary SchoolActive64thSt John's Chapel[Ang Mo Kio Secondary School](/wiki/Ang_Mo_Kio_Secondary_School)Active66thAdam Road Presbyterian ChurchWoodlands Secondary SchoolActive67JChurch of the Good ShepherdQueenstown Primary SchoolActive68JBethesda CommunityValour Primary SchoolActive69JThe People's Bible ChurchXinghua Primary SchoolActive71JS-Word Evangelical Free ChurchSouth View Primary SchoolActive73rdFaith Community Baptist ChurchBukit View Secondary SchoolActive74thMount Hermon Bible Presbyterian ChurchKent Ridge Secondary SchoolActive75JPaya Lebar Methodist ChurchPunggol Primary SchoolActive76JToa Payoh Methodist ChurchFirst Toa Payoh Primary SchoolActive77thS-Word Evangelical Free ChurchChoa Chu Kang Secondary SchoolActive78JHebron Bible-Presbyterian ChurchYew Tee Primary SchoolActive80JCovenant Presbyterian ChurchFarrer Park Primary SchoolActive81JFaith Community Baptist ChurchTownsville Primary SchoolActive82ndCity Harvest ChurchBoon Lay Secondary SchoolActive83JFaith SanctuaryCedar Primary SchoolActive84thImpact Life ChurchUnity Secondary SchoolActive85thFaith Community Baptist ChurchJurong West Secondary SchoolActive86thFaith Community Baptist ChurchJurongville Secondary SchoolActive87thYishun Methodist Mission[Northbrooks Secondary School](/wiki/Northbrooks_Secondary_School)Active88JYishun Methodist MissionNaval Base Primary SchoolActive90JBukit Batok Presbyterian Church[Princess Elizabeth Primary School](/wiki/Princess_Elizabeth_Primary_School)Active91stBukit Panjang Gospel Chapel[Regent Secondary School](/wiki/Regent_Secondary_School)Active93rdLiving Sanctuary Brethren Church[Yuying Secondary School](/wiki/Yuying_Secondary_School)Active94thTrue Way Presbyterian Church[Nan Hua High School](/wiki/Nan_Hua_High_School)Active95JWestside Anglican ChurchWest Grove Primary SchoolActive98thTrue Grace Presbyterian ChurchGrace Orchard SchoolActive99thFaith Community Baptist Church[Canberra Secondary School](/wiki/Canberra_Secondary_School)Active100JTai Seng Christian ChurchNorth Vista Primary SchoolActive102JTai Seng Christian ChurchNorth View Primary SchoolActive106JSt Andrew's CathedralGan Eng Seng Primary SchoolActive107JS-Word Evangelical Free ChurchWestwood Primary SchoolActiveACJC PrimersBarker Road Methodist Church[Anglo-Chinese Junior College](/wiki/Anglo-Chinese_Junior_College)ActiveNP PrimersFaith Community Baptist Church[Ngee Ann Polytechnic](/wiki/Ngee_Ann_Polytechnic)ActiveNYP PrimersFaith Community Baptist Church[Nanyang Polytechnic](/wiki/Nanyang_Polytechnic)ActiveSP PrimersFaith Community Baptist Church[Singapore Polytechnic](/wiki/Singapore_Polytechnic)ActiveFGA PrimersFull Gospel AssemblyOpen UnitActiveITECC PrimersFull Gospel Assembly[ITE College Central](/wiki/ITE_College_Central)ActiveITECE PrimersBethesda Bedok-Tampines Church[ITE College East](/wiki/ITE_College_East)ActiveITECW PrimersGood Gifts City Church[ITE College West](/wiki/ITE_College_West)ActiveHQ Primers--Active **A** BR stands for \"Barker Road\" ## Programmes There are four programmes for different age groups: - Explorers Programme – 4 to 6 years old (Preschool, girls are eligible to enrol in this Programme) - Juniors Programme – 8 to 12 years old (Primary 2 to Primary 6) - Seniors Programme – 12 to 17 years old (Secondary 1 to Secondary 5) - Primers Programme – 17 to 21 years (Post-Secondary, Junior Colleges/Polytechnics/Institutes of Technical Education, girls are eligible to enrol in this Programme) ## Ranks **Boys** The ranks in the Seniors Programme include: - Recruit (REC) - [Private](/wiki/Private_(rank)) (PTE) - [Lance Corporal](/wiki/Lance_Corporal) (LCP) - [Corporal](/wiki/Corporal) (CPL) - [Sergeant](/wiki/Sergeant) (SGT) - [Staff Sergeant](/wiki/Staff_Sergeant) (SSG) - [Warrant Officer](/wiki/Warrant_Officer) (WO) **Primers** This ranks attainable by Primers include: - Cadet Lieutenant (CLT) - Senior Cadet Lieutenant (SCL) **Officers** This ranks attainable by Officers include: - [Officer Cadet](/wiki/Officer_Cadet) (OCT) - [Second Lieutenant](/wiki/Second_Lieutenant) (2LT) - [Lieutenant](/wiki/Lieutenant) (LTA) ## Uniforms ### Juniors' Programme There are three different dress codes for the Juniors' Programme for various functions and occasions. These include, in decreasing formality, the Day Dress, the Fatigue Dress and the PT Kit. ### Seniors' Programme There are five different dress codes for the Seniors' Programme for various functions and occasions. These include, in decreasing formality, the Ceremonial Dress, the Day Dress, the Musketry, the Fatigue Dress and the PT Kit. ### Primers There are four different dress codes for the Primers' Programme for various functions and occasions. These include, in decreasing formality, the Ceremonial Dress, the Day Dress, the Musketry and the Fatigue Dress. ### Officers There are six different dress codes for BB Officers for various functions and occasions. These include, in decreasing formality, the Ceremonial Dress, the Function Dress, the Day Dress, the Musketry, the Fatigue Dress and the PT Kit. ## Badges and awards ### Juniors' Programme BadgeProgrammeJP Gold AwardJuniorsWhite Achievement BadgeJuniorsGreen Achievement BadgeJuniorsPurple Achievement BadgeJuniorsBlue Achievement BadgeJuniorsRed Achievement BadgeJuniorsSilver Achievement BadgeJuniorsJunior One Year ServiceJuniorsJunior Three Year ServiceJuniorsBest Boy AwardJuniors ### Seniors' Programme Badge/AwardTypeLevelsAdventureCoreBasic & AdvanceAnti Drug Abuse (SANA)SouvenirBasicArts & CraftElectiveBasic & AdvanceAthleticsElectiveBasic & AdvanceBandsman'sElectiveBasic & AdvanceBugler'sElectiveBasic & AdvanceChristian EducationElectiveBasicGlobal AwarenessCoreBasic, Advance & MasterCommunity SpiritednessCoreBasic, Advance & MasterDrillCoreBasic & AdvanceDrummer'sElectiveBasic & AdvanceFirst AidElectiveBasic & AdvanceHeritageSouvenirBasicHobbiesElectiveBasic & AdvanceKayakingElectiveBasic & AdvanceMusketryElectiveBasic & AdvanceLeadership StarCoreBasic, Advance & MasterPiper'sElectiveBasic & AdvanceSailingElectiveBasic & AdvanceSportsman'sElectiveBasic & AdvanceSwimmingElectiveBasic & AdvanceTargetCoreBasicJuniors Programme LinkServiceN.ATotal DefenceSpecialBronze, Silver & GoldOne Year ServiceServiceN.AThree Year ServiceServiceN.ALong Year ServiceServiceN.AFounder's Award (Highest Award)SpecialN.ACross For HeroismSpecialN.ASenior Proficiency Award (2nd Highest Award)SpecialN.AIntermediary Proficiency Award (3rd Highest Award)SpecialN.ANational EventSpecialN.ABest Boy AwardSpecialN.A ### Primers' Programme Badge/AwardTypeAnchors AwardSpecialLong Year ServiceServicePresident's AwardSpecial ## Community The Boys' Brigade in Singapore aims to play an active role in contributing to society, and to inculcate these values to the Boys. ### BB CARES BB CARES, which stands for Community Activities Rallying Everyone to Serve involved BB companies organising activities to benefit welfare organisations of their choice. It is one of the events as part of the annual [President's Challenge](/wiki/President%27s_Challenge) event. ### Boys' Brigade Share-a-Gift The Boys' Brigade Share-a-Gift (BBSG), previously known as The Boys' Brigade Sharity Gift Box, is a major annual event held during the Christmas period whereby more than 3,500 BB Officers and Boys, along with volunteers from other various groups, are mobilised to help collect gifts such as food and beverages from people and distribute these items to the needy in Singapore. These beneficiaries include the disabled, welfare homes, the elderly, and low-income families. There are also wishes from the beneficiaries that people can help to fulfill with, such as those requesting for food or household items, or toys and mattresses from children or the elderly. Since the BBSG was started in 1988, it has been largely successful and has received great support from Singaporeans who have generously donated gifts over the years. From around 7,000 gifts collected in 1988, it has collected 428,000 gifts in 2006. Although the project did not meet its target donation by the close of the project on some occasions, the public would often continue to donate such that target was achieved within the next few weeks. In the last fifteen years, the BB has been working hand in hand with the [National Council of Social Service](/wiki/National_Council_of_Social_Service) (NCSS). On 7 July 2013, the Boys' Brigade Share-a-Gift (BBSG) project was conferred the Singapore Youth Award Medal of Commendation. BBSG was recognised for achieving, contributing and inspiring youths at significantly higher levels after being awarded the Singapore Youth Award in 2004. ### Boys' Brigade Learning Centre The [Boys' Brigade Learning Centre](/wiki/Boys%27_Brigade_Learning_Centre,_Cambodia) (BBLC) is an educational facility built and maintained by the Boys' Brigade in Proyouth Village, Puok Commune, Cambodia. ## Notable alumni - Chua Siak Phuang – Last founding member of the first Boys' Brigade Company in Singapore who died in 2010. - [Winston Choo](/wiki/Winston_Choo) – First Chief of Defence Force of the Singapore Armed Forces from 1974 to 1992 and held the rank of Lieutenant-General. - [VADM](/wiki/Vice_admiral) [Aaron Beng Yao Cheng](/wiki/Aaron_Beng) – 11th Chief of Defence Force of the Singapore Armed Forces. - [Andie Chen](/wiki/Andie_Chen) – Singaporean Actor, former BB Boy from 26th Company, Tanglin Secondary. - [Chiam See Tong](/wiki/Chiam_See_Tong) – former Leader of the Opposition and Member of [Parliament for Potong Pasir SMC](/wiki/Potong_Pasir_Single_Member_Constituency). - [Khoo Boon Hui](/wiki/Khoo_Boon_Hui) – former Commissioner of the Singapore Police Force. - [Boys' Brigade](/wiki/Boys%27_Brigade) - [Boys' Brigade Learning Centre, Cambodia](/wiki/Boys%27_Brigade_Learning_Centre,_Cambodia) - The Boys' Brigade in Singapore Official Site 1°17′29″N 103°49′54″E﻿ / ﻿1.29139°N 103.83167°E﻿ / 1.29139; 103.83167\n",
  "language": "en",
  "processed_at": "2026-01-12T09:57:30.841363",
  "title": "Boys' Brigade in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Boys%27_Brigade_in_Singapore"
}