{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:57:36.318710"
  },
  "content": "American businessman (born 1970) **Brandon Wade** (born **Lead Wey**; 1970) is an American businessman who is the founder and chief executive officer of InfoStream Group, an online dating company. He is a graduate of the [Massachusetts Institute of Technology](/wiki/Massachusetts_Institute_of_Technology) (MIT) and [MIT Sloan School of Management](/wiki/MIT_Sloan_School_of_Management) and a former software engineer. ## Early life Born in [Singapore](/wiki/Singapore) to [ethnic Chinese](/wiki/Chinese_Singaporeans) parents, Wade was raised in what he describes as a \"[Tiger Mom](/wiki/Tiger_parenting)–type of upbringing\" consisting of studying and not much else. While growing up in Singapore, Wade attended [Saint Andrew's Secondary School](/wiki/Saint_Andrew%27s_Secondary_School) and [Hwa Chong Junior College](/wiki/Hwa_Chong_Junior_College). In 1993, Wade graduated from [Massachusetts Institute of Technology](/wiki/Massachusetts_Institute_of_Technology) (MIT), where he received a [Bachelor of Science](/wiki/Bachelor_of_Science) in [electrical engineering](/wiki/Electrical_engineering) on an Overseas Merit Scholarship awarded by [Singapore's Public Service Commission](/wiki/Public_Service_Commission_(Singapore)). Upon graduating in 1993, Wade opted to stay in the United States, breaking his contractual obligation to return to Singapore and forcing his parents to pay about $300,000 in damages. Wade then enrolled in the [MIT Sloan School of Management](/wiki/MIT_Sloan_School_of_Management), where he graduated with a [Master of Business Administration](/wiki/Master_of_Business_Administration) in 1995. ## Career After completing his MBA, he moved to [New York City](/wiki/New_York_City) to work for technology consultants [Booz Allen](/wiki/Booz_Allen_Hamilton). He later joined [General Electric](/wiki/General_Electric) as a technology infrastructure manager. In 2006, Wade founded Seeking.com with the goal to connect people looking for romantic relationships that align with their personal goals. Wade served as CEO of the company from 2006 to 2022 and then rejoined the company as CEO in 2024. Wade is the author of two books titled *Seeking Arrangement: The Definitive Guide to Sugar Daddy and Mutually Beneficial Relationships* and *Connecting with the IN Crowd: How to Network, Hang Out, and Play with Millionaires Online*. In a 2014 essay for [CNN](/wiki/CNN) titled *\"Dating website founder says love doesn't exist*\", Wade wrote, \"Love is a concept invented by poor people.\" ### Dating websites In 2006, Wade founded the [sugar dating](/wiki/Sugar_dating) website [Seeking.com](/wiki/Seeking.com). In 2007, Wade launched a companion dating site WhatsYourPrice.com, a dating website where members bid for dates in an online auction environment. In May 2012 he launched MissTravel.com, which pairs 'generous' travelers with 'attractive' travelers who would love the opportunity to travel the world for free. And in May 2015, Wade launched OpenMinded.com, a dating website that caters to those who are monogamish with the goal of providing a safe and stigma-free environment that brings the ease and flexibility of online dating to the currently underserved world of open relationships. He further states the website caters to those looking to engage in 'ethical cheating'. - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T09:57:36.318232",
  "title": "Brandon Wade",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Brandon_Wade"
}