{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:57:49.744660"
  },
  "content": "1973 murder of a vegetable seller in Singapore On 15 September 1973, 24-year-old vegetable seller **Tan Eng Kim** ([Chinese](/wiki/Chinese_language): 陈荣林; [pinyin](/wiki/Pinyin): *Chén Rónglín*) was attacked and stabbed to death by another man at a coffee shop in [Bras Basah](/wiki/Bras_Basah), [Singapore](/wiki/Singapore). The killer was **Pehn Kwan Jin** ([Chinese](/wiki/Chinese_language): 彭广仁; [pinyin](/wiki/Pinyin): *Péng Guǎngrén*), a 25-year-old seaman who sought revenge against Tan due to a previous dispute, although Pehn denied that he killed Tan out of vengeance and claimed that it was Tan who tried to attack him and he only acted in self-defence. The defence was rejected and Pehn was found guilty of murdering Tan and [sentenced to death](/wiki/Capital_punishment_in_Singapore) in May 1974. Pehn's [appeals](/wiki/Appeal) were dismissed, and he was hanged on 16 April 1976. ## Murder On 15 September 1973, at about 2 am, a stabbing occurred inside a coffeeshop at [Bras Basah](/wiki/Bras_Basah), and one man was killed. The sole victim of the stabbing was identified as 24-year-old vegetable seller Tan Eng Kim, who resided at Woo Mon Chew Road, off [East Coast Road](/wiki/East_Coast_Road,_Singapore). Tan sustained a total of four stab wounds to his stomach and he collapsed outside the boys' toilet after staggering for a distance in the shop. Tan was rushed to Outram Hospital for emergency treatment, but died shortly after his admission to the hospital. It was eventually uncovered through investigations that Tan was likely killed in a possible gang clash and was involved in talks between two rival gangs, and one of the gangs had attacked Tan and killed him. Several witnesses, including the employees of the shop and patrons, were interviewed, and the police searched for any traces of murder weapons at the scene, but none were recovered. Tan's death was one of the two murder cases to happen within 24 hours during that week itself; a 30-year-old salesman named Kok Chee Onn was murdered outside a bar on the night of the date of Tan's murder. Professor [Chao Tzee Cheng](/wiki/Chao_Tzee_Cheng), a senior forensic pathologist, conducted an autopsy on the victim, and he found that out of the four stab wounds to Tan's corpse, one of them penetrated the heart and was sufficient in the ordinary course of nature to cause death. According to Professor Chao, the severity of the wound was such that it would have caused the death of Tan within ten minutes, due to the massive bleeding from the wound. He also stated that one of the other wounds had cut through the liver (but there was no major loss of blood) and some cuts were also found on the victim's left hand and arm. On 22 September 1973, it was announced that the police had arrested four gang members in separate locations across Singapore, and two of them were found to be connected to the murder of Tan Eng Kim, and one of these suspects would be charged with murder. On that same day, the same suspect, identified as 25-year-old seaman Pehn Kwan Jin, was charged with murder, an offence that mandated the [death penalty](/wiki/Capital_punishment_in_Singapore) under Section 302 of the [Penal Code](/wiki/Penal_Code_(Singapore)). If found guilty of murder, Pehn would be sentenced to hang. ## Trial of Pehn Kwan Jin On 13 May 1974, the murder trial of Pehn Kwan Jin began at the [High Court](/wiki/High_Court_of_Singapore). Pehn was represented by Goh Heng Leong while the prosecution was led by [Lawrence Ang](/wiki/Lawrence_Ang), and the trial was presided over by two trial judges – Justice Tan Ah Tah and Justice T Kulasekaram. The trial court was told that on the date of the murder, the deceased victim Tan Eng Kim was drinking together with his friend Chong Hwang Kee at the coffeeshop in Bras Basah. At the time, Pehn was also patronizing the shop with his friend Koh Teck Eng, and during a drinking session, Pehn told Koh that he wanted to hit someone. Although Koh advised Pehn to refrain from doing so, Pehn nonetheless stood up and paid the bill before he approached Tan and, in front of witnesses, he brandished a knife and plunged it into Tan's stomach. Tan tried to defend himself by taking a chair and hurling it at Pehn, but Pehn retaliated by throwing a chair at Tan, who managed to run to the back of the coffeeshop and lock the door behind him. Tan collapsed shortly after from his wounds and was taken to Outram Hospital, where he died upon his arrival. Pehn later fled from the coffeeshop but was caught at [Serangoon Road](/wiki/Serangoon) five days later. Koh, who appeared as a witness, testified that prior to the incident, he learned that Pehn had been assaulted by Tan and his friends sometime after the two, who were originally friends, fell out with each other. The prosecution therefore alleged that Pehn had a motive of wanting to seek revenge against Tan by stabbing him to death on 15 September 1974. Pehn had confessed to the police during his interrogation that he indeed stabbed Tan. Pehn opted to enter his defence in court. He testified that before the murder, he and Tan Eng Kim were friends for more than a year, before a misunderstanding between himself and another friend had caused them to drift apart. A month after they fell out, Pehn was reportedly assaulted by Tan and his two friends at a bar; Pehn was said to have been treated to unfriendly gazes from Tan, who would bump into him on purpose whenever he passed by him, and this led to Pehn asking Tan inside the toilet why he ignored him and did it to him. Tan responded by assaulting Pehn, who later reported the matter to Joo Chiat Police Station, but the news of the report reached Tan, who allegedly threatened a neighbour at knifepoint and probed him as to where Pehn lived. Turning to Tan's death, Pehn said that he only acted in self-defence when he killed Tan, and he recounted that after he and Koh arrived at the coffeeshop at 1 am, he saw Tan's gang outside the shop and he feared Tan was looking for him. Later, Tan and a friend (Chong Kwang Kee) sat at a table next to Pehn's and Pehn noticed Tan keeping a knife at his left thigh, and he believed Tan wanted to use it to harm him. Pehn said he tried to have a talk with Tan peacefully but Tan did not reply to him, and after Tan looked away he took a chance to snatch the knife from Tan, and this drove Tan into pushing Pehn down. Pehn testified that after seeing Tan about to grab something from the table, he went at him and got into a scuffle, during which Pehn stabbed Tan. Pehn said that he was unable to remember the full sequence of events as everything happened so suddenly, but the next thing he remembered was Tan arming himself with two knives and an iron rod inside the kitchen, and he had to hold onto the kitchen doorknob to prevent Tan coming out, before he made his escape. Pehn claimed he only acted in self-defence, and he denied murdering Tan out of revenge over their unsettled differences. He also denied telling Koh that he wanted to hit Tan prior to the stabbing. On 28 May 1974, Justice T Kulasekaram and Justice Tan Ah Tah delivered their verdict. Justice Kulasekaram, who pronounced the judgement in court, stated that there were three main contentions which both the judges arrived at when reaching the verdict. The first contention was they did not believe Pehn's claim that he wanted to settle his differences peacefully with Tan; the second was that they disbelieved Pehn's claim that he grabbed the knife from Tan; and the third point was the judges rejected Peng's claim that he only wielded the knife in self-defence after seeing Tan about to grab something from the counter. Due to these contentions, Justice Kulasekaram pronounced on behalf of the judges that Pehn's claim of self-defence should be dismissed, and given that Pehn had intentionally inflicted the knife wounds, such that one of the injuries was sufficient in the ordinary course of nature to cause death, there were sufficient grounds for the trial court to return a verdict of murder. Therefore, 25-year-old Pehn Kwan Jin was found guilty of murder, and [sentenced to death](/wiki/Capital_punishment_in_Singapore) by [hanging](/wiki/Hanging). Reportedly, Pehn, who was silent and expressionless at the time of sentencing, had tried to escape from the courtroom before the police officers could handcuff him. Pehn was quickly subdued by three of the officers present before he could successfully escape, and was led out of the courtroom. By October 1974, Pehn was one of the 15 people held on Singapore's [death row](/wiki/Death_row) awaiting their executions, and all of them were convicted of murder. Among the 14 others incarcerated on death row with Pehn, seven of them were responsible for the 1971 [Gold Bars triple murders](/wiki/Gold_Bars_triple_murders) (where a businessman and his two associates were killed for 120 gold bars), two of them were guilty of the 1972 [Amoy Street wine shop murder](/wiki/Amoy_Street_wine_shop_murder) and another one of them was [Chelliah Silvanathan](/wiki/Chelliah_Silvanathan), who killed a fellow gang member. ## Appeal and execution On 17 March 1975, the [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore) rejected Pehn Kwan Jin's [appeal](/wiki/Appeal), after finding that he had intentionally inflicted the fatal wound to Tan and caused his death, and they therefore upheld Pehn's death sentence and murder conviction. On the same date, the Court of Appeal also rejected the appeal of another murder convict on death row, and upheld the death sentence of the convict [Liew Ah Chiew](/wiki/Liew_Ah_Chiew), a former [National Serviceman](/wiki/National_service_in_Singapore) who was found guilty of murdering his superior, Hor Koon Seng, via a fatal shooting in 1974. Liew had since been hanged on 29 November 1975. On 18 December 1975, Pehn filed a motion for special leave to appeal to the [Privy Council](/wiki/Judicial_Committee_of_the_Privy_Council) in [London](/wiki/London). The motion was rejected by the Privy Council. On the same day, the Privy Council also rejected the appeals of both [K. Vijayan Krishnan](/wiki/K._Vijayan_Krishnan) and Jorge Belardo Belleza against their death sentences. Vijayan, a labourer from [Malaysia](/wiki/Malaysia), was found guilty of murdering a crane driver, Ahora Murthi Krishnasamy, in 1973, while Belleza, a [Filipino](/wiki/Filipinos)-born mechanic, was convicted of killing his lover, Alice Ong, in 1974. Belleza and Vijayan were both hanged since then. In February 1976, it was reported that Pehn and two other prisoners on [death row](/wiki/Death_row) appealed for clemency from the [President of Singapore](/wiki/President_of_Singapore) as a final recourse to escape the gallows. However, Pehn's clemency plea was rejected and his death sentence was finalized. According to a Singaporean Chinese newspaper *[Sin Chew Jit Poh](/wiki/Sin_Chew_Jit_Poh_(Singapore))*, 27-year-old Pehn Kwan Jin was hanged in [Changi Prison](/wiki/Changi_Prison) on the Friday morning of 16 April 1976, after spending nearly one year and twenty-three months on death row. - [Capital punishment in Singapore](/wiki/Capital_punishment_in_Singapore)\n",
  "language": "en",
  "processed_at": "2026-01-12T09:57:49.744205",
  "title": "Bras Basah coffeeshop murder",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Bras_Basah_coffeeshop_murder"
}