{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:57:45.406073"
  },
  "content": "Multipurpose building in Bras Basah, Singapore 1°17′48.14″N 103°51′13.44″E﻿ / ﻿1.2967056°N 103.8537333°E﻿ / 1.2967056; 103.8537333 **Bras Basah Complex** is a mixed-use building on Bain Street in [Bras Basah, Singapore](/wiki/Bras_Basah) that houses both residential and commercial units. From the 1980s to the early 2000s, it was known for its numerous bookstores, and had the Mandarin nickname \"Book City\" ([Chinese](/wiki/Simplified_Chinese_characters): 书城; [pinyin](/wiki/Pinyin): *Shū Chéng*). It was also a popular venue amongst [xinyao](/wiki/Xinyao) singers in the 1980s. ## History In October 1977, the [Housing and Development Board](/wiki/Housing_and_Development_Board) announced that the complex would be completed for $13 million by 1980 as part of the government's plan to \"revitalise the central area\". The complex was to feature a four-storey office and shopping podium underneath two blocks of twenty-one storey tall residential blocks which would have 240 units of 4-room flats. In addition to shops and offices, the podium would also house an eating house, a supermarket and emporium and a hall for social functions and recreation, accompanied with a carpark. The complex, which opened in 1980, was billed by the Housing and Development Board as the first \"book complex\" in Singapore. However, in November 1980, Francis Chin of the *New Nation* reported that out of the \"hundred-odd\" units only around 20 were occupied by bookstores, with only one bookstore on the ground floor. Additionally, Chin also wrote that, apart from the [Popular Bookstore](/wiki/Popular_Holdings) which took up \"nearly a quarter of the shop space on the first and third floors\" and a rental shop for Chinese books, the bookstores at the complex \"receive only the occasional passer-by.\" In December, Yow Pow Ang of *[The Straits Times](/wiki/The_Straits_Times)* reported that two book stores and a restaurant had closed down due to \"poor business and high rentals\", and that, out of the 40 bookshops, only around 10 sold books while the rest sold stationery and cassettes. Yow further reported that many of the bookshops that did sell books were small and sold the same books, with \"much price undercutting.\" According to a spokesperson from the Housing and Development Board, 106 of the 132 units at the complex were allocated for bookshops, with bookshops being allowed to occupy several units. By then, 29 of these units were still vacant. In January 1981, an [ad hoc](/wiki/Ad_hoc) committee of the booksellers at the complex announced their intention to form a merchants' association for the complex's shopowners and made several proposals to improve business at the complex, including a suggestion that an overhead bridge leading towards the shopping centre be built over [North Bridge Road](/wiki/North_Bridge_Road) to allow for safer and easier access to the complex. Academic publisher [World Scientific](/wiki/World_Scientific), which had been established in that year, was initially based within the complex. In 1985, the Bras Basah Shopowners' Association, which by May of that year represented 72 shopowners, began organising activities in an effort to \"turn the place into a centre of activities for youngsters.\" These activities included performances by Taiwanese singers Lin Huiping [zh] and Xu Wei, performances by local xinyao singers, drawing and colouring contests, [xiangsheng](/wiki/Xiangsheng) and dance performances. By then, business at the complex had declined as a result of the closure of the nearby Odeon Cinema in the previous year. However, a proposal for the installation of a roof over the open area was rejected. In the same year, 10 of the bookshop owners applied for permission to change trades. However, by June 1986, when they were given permission to do so, nine of the applicants had changed their minds. In 1989, a fiberglass roof costing $80,000 was installed over the complex's open area such that activities at the area would not be affected by inclement weather. According to *Roots*, which is published by the [National Heritage Board](/wiki/National_Heritage_Board_(Singapore)), the complex came to be known as a \"one-stop centre for educational books and art materials\" and was also a popular venue amongst xinyao singers looking to promote their music in the 1980s. In 2004, the tenants of the complex, which had been retiled and received a new coat of paint along with new lighting, decided to establish a management company by the following year to \"oversee the branding, advertising and promotion of the place.\" In 2005, the Bras Basah Merchants' Association announced that it intended to \"transform\" the complex into a \"centre for books and arts.\" In an attempt to draw younger customers, works on the complex's first major facelift, which was estimated to cost around $8 million, began in January 2013, with its first phase scheduled to be completed by early next year. A reunion concert featuring several pioneering xinyao singers, including [Eric Moo](/wiki/Eric_Moo) and [Dawn Gan](/wiki/Dawn_Gan), was held at the complex in 2014. In 2022, the Bras Basah Merchants' Association began organising more events to attract more customers. In the same year, Knowledge Book Centre, which had opened at the complex in 1981, closed down due to declining business, while other tenants, such as the Popular Books flagship store, the music store and anchor tenant Swee Lee and crafts supply store Art Friend were reportedly doing well. By March 2023, 18 of the complex's tenants were art galleries while another 10 were music schools and shops and a further 14 were printing shops. In December, Sophia Kuek of *[AsiaOne](/wiki/AsiaOne)* referred to the complex as a \"go-to spot for all things prints and art.\"\n",
  "language": "en",
  "processed_at": "2026-01-12T09:57:45.405419",
  "title": "Bras Basah Complex",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Bras_Basah_Complex"
}