{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:57:50.157123"
  },
  "content": "Singapore food corporationThis article **is in list format but may read better as prose**. You can help by converting this article, if appropriate. Editing help is available. *(November 2022)* **BreadTalk Group Private Limited** is a [Singaporean](/wiki/Singapore) [multinational](/wiki/Multinational_corporation) snack and beverage corporation headquartered in [Paya Lebar](/wiki/Paya_Lebar), [Singapore](/wiki/Singapore). ## History BreadTalk Group Pte. Ltd. was founded as a bakery brand in Singapore and opened its first outlet at [Bugis Junction](/wiki/Bugis_Junction) in July 2000. It was listed on the [Singapore Exchange](/wiki/Singapore_Exchange) in 2003. It has since expanded to more than 900 retail stores spread across 15 markets. Its brand portfolio consists of BreadTalk, Toast Box, Food Republic, Food Junction, Bread Society, Thye Moh Chan, The Icing Room, Sō Ramen, Butter Bean and Charlie Tea in Singapore. [Din Tai Fung](/wiki/Din_Tai_Fung), Song Fa Bak Kut Teh and Wu Pao Chun are franchised brands. The Group has a network of owned bakery outlets in Singapore, PRC, Malaysia, Hong Kong and Thailand as well as franchised bakery outlets across Asia, Europe and the Middle East. It also owns and operates the Din Tai Fung restaurants in Singapore, Thailand and the United Kingdom, as well as the Food Republic food atria in Singapore, China, Taiwan, Hong Kong and Malaysia. In December 2018, the Group opened its first Din Tai Fung restaurant in London. On 20 February 2019, BreadTalk Group bought out its Thai joint venture partner's 50% stake, The Minor Food Group, for S$6.96 million. BreadTalk Group announced on 2 September 2019 that it planned to buy Food Junction, a food court operator similar to Food Republic (a BreadTalk brand), for $80 million. The [Competition and Consumer Commission of Singapore](/wiki/Competition_and_Consumer_Commission_of_Singapore) allowed the acquisition on 15 October 2019 as the acquisition would not substantially reduce competition, and would also allow BreadTalk to better compete with other food operators. On 5 June 2020, the company was delisted from the Singapore Exchange. ## Company milestones Milestones**Year****Event**2003Established [PRC](/wiki/China) headquarters and opened its first outlet in [Shanghai](/wiki/Shanghai)2004Brought in [Din Tai Fung](/wiki/Din_Tai_Fung)2005Launched [Food Republic](/wiki/Food_Republic) (now under name Food Opera) at [Wisma Atria](/wiki/Wisma_Atria)2007Opened 100th international BreadTalk store in Shanghai2007Launched 1st Food Republic in [Kuala Lumpur](/wiki/Kuala_Lumpur), [Malaysia](/wiki/Malaysia)2008Opened inaugural BreadTalk stores in [Oman](/wiki/Oman)2009Launched 1st Bread Society outlet, an artisanal bakery in [ION Orchard](/wiki/ION_Orchard)2011Ground Breaking ceremony for the IHQ Building2012Global launch of concept BreadTalk outlet in Shanghai2015Launched a new global concept BreadTalk outlet in [VivoCity](/wiki/VivoCity)2016BreadTalk Group inked joint venture to enter the United Kingdom with Din Tai Fung restaurants2016BreadTalk inked an agreement to enter [Myanmar](/wiki/Myanmar) market2016Food Republic, Toast Box and BreadTalk opened outlets iAT [Shanghai Disneyland](/wiki/Shanghai_Disneyland)2017BreadTalk opens the first Myanmar outlet at Junction City Mall in Yangon2017Toast Box opens the first outlet at Terminal 3 of [Soekarno-Hatta International Airport](/wiki/Soekarno-Hatta_International_Airport), Jakarta2018BreadTalk Group inked a joint venture with Song Fa Bak Kut Teh to expand into new markets such as China and Thailand. Its first outlet opened in Shanghai2018BreadTalk Group enters a joint venture with Wu Pao Chun Bakery for expansion into four major cities in China.2018BreadTalk Group partners with Shenzhen Pindao to bring popular tea beverage brands [Nayuki](/wiki/Nayuki) and Tai Gai to Singapore and Thailand.2018BreadTalk partners with Som Datt Group for expansion into [India](/wiki/India)2018Food Republic opens its first Direct Operated Restaurant ‘Sergeant Kitchen’ in Bangkok in March 2018.2019BreadTalk Group opens the first Wu Pao Chun store in South East Asia2020BreadTalk Group opens its first Butter Bean outlet at [Funan](/wiki/Funan,_Singapore) mall2020BreadTalk Group opens its first Charlie Tea outlet at [Takashimaya Shopping Centre](/wiki/Takashimaya_Shopping_Centre), [Ngee Ann City](/wiki/Ngee_Ann_City)2020BreadTalk Group strikes deal with First Street Teochew Fish Soup and has opened the first new outlet under the partnership in BreadTalk IHQ ## Awards - SPBA Most Promising Brand Award 2002 - Design for Asia Award, Hong Kong Design Centre 2004 - Five Star Diamond Brand, World Brand Laboratory in Shanghai, PRC - World Branding Awards 2017 ## Other Brands ### Food Republic BreadTalk Group's Food Republic foodcourts in Singapore are situated in shopping malls such as [Wisma Atria](/wiki/Wisma_Atria), [Vivocity](/wiki/Vivocity) and [Suntec City](/wiki/Suntec_City). Overseas, there are food courts in [Hong Kong](/wiki/Hong_Kong) (also in [Silvercord](/wiki/Silvercord) of [Canton Road](/wiki/Canton_Road), [Tsim Sha Tsui](/wiki/Tsim_Sha_Tsui)), the [People's Republic of China](/wiki/People%27s_Republic_of_China), [Malaysia](/wiki/Malaysia), [Taiwan](/wiki/Taiwan) and [Thailand](/wiki/Thailand). ### Food Junction BreadTalk Group acquired Food Junction in 2019. ### Toast Box BreadTalk Group operates the Toast Box concept, serving mainly coffee and [kaya toast](/wiki/Kaya_toast) among other traditional and modern snacks. These Toast Box outlets are typically attached to the main BreadTalk outlet or in a Food Republic food court. There have been stand-alone stores in recent years. ### Din Tai Fung BreadTalk Group is the franchisee of [Taiwanese](/wiki/Republic_of_China) [Xiao Long Bao](/wiki/Xiao_Long_Bao) restaurant, [Din Tai Fung](/wiki/Din_Tai_Fung). It opened its first restaurant in the upscale Paragon shopping mall and has opened other outlets in the island, including one in [Bishan](/wiki/Bishan,_Singapore) and another in the basement annex of [Raffles City](/wiki/Raffles_City_Singapore). Din Tai Fung has 8 branches in Thailand. It was announced that BreadTalk Group has also been awarded the franchise to operate Din Tai Fung in the United Kingdom. This was the result of successful partnerships and the positive reputation that BreadTalk Group has had in managing the franchise in Singapore and Thailand. ### The Icing Room The Icing Room is the first-ever \"[Design-It-Yourself](/wiki/DIY)\" cakes and pastry shop. ### Thye Moh Chan This 70-year old Teochew bakery was acquired in 2013. ### Wu Pao Chun BreadTalk Group opened the first Wu Pao Chun store in South East Asia in May 2019. ### Bread Society Bread Society embraces traditional artisanal baking techniques using highly nutritious ingredients. ### Sanpoutei BreadTalk Group continued to partner with the Sanpou Group to expand its variety of ramen shops in Singapore. Since 2014, Sanpoutei, which specialises in Niigata-style shoyu ramen has been operating in Holland Village. Another outlet in Shaw Centre was subsequently added, in line with the successful product reception in Singapore. ### Sō Ramen Sō Ramen, originally known as Ramenplay, is a [ramen](/wiki/Ramen) restaurant. It also offers Koshihikari rice grown from [Niigata](/wiki/Niigata_Prefecture). ### Butter Bean Butter Bean is a home-grown brand by BreadTalk Group operating as a hip café concept. It offers contemporary twists to traditional Singaporean dishes. ### Charlie Tea Charlie Tea is a home-grown brand by BreadTalk Group specialising in a variety of tea beverages, including bubble tea, and baked goods. ## Controversies On 25 March 2015, BreadTalk pulled buns commemorating [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) off shelves after receiving flak from the public. Although the proceeds from sale of the buns were meant for charitable purposes, poor communication of intentions led to the misunderstanding. BreadTalk apologised publicly on its Facebook page. On 4 August 2015, BreadTalk stopped selling [soya milk](/wiki/Soy_milk) previously labelled \"freshly prepared\" as they confirmed (after being confronted with photographic evidence) that the product was repackaged [Yeo's](/wiki/Yeo_Hiap_Seng) soya milk packet drink. Prior to investigations, the company had initially denied that they were misleading customers. After the details had gone [viral](/wiki/Viral_marketing) online, Breadtalk eventually apologised for its actions. On 6 August 2015, the Consumers Association of Singapore warned Breadtalk they would pursue action if the practice continued. BreadTalk's China franchise was also accused of selling food with expired ingredients, although such a claim has yet to be proven. Seemingly contaminated wheatmeal and butter two years past its expiry date were among discoveries claimed by an undercover reporter at Hangzhou Guangqi Trade Co, in the eastern city of Hangzhou. On 10 June 2019, the [Public Utilities Board](/wiki/Public_Utilities_Board) (PUB) disclosed that BreadTalk was fined [S$](/wiki/S$)16,300 for repeated offences of illegal waste discharge into sewers, making it among 38 companies fined for similar offences. Prior to this, BreadTalk was charged with a fine of S$19,000 for six other incidents of illegal waste discharge. - [List of food companies](/wiki/List_of_food_companies)\n",
  "language": "en",
  "processed_at": "2026-01-12T09:57:50.156538",
  "title": "BreadTalk",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/BreadTalk"
}