{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:58:03.926015"
  },
  "content": "The **British Theatre Playhouse (BTP)** is a professional [theatrical](/wiki/Theatre) and [musical](/wiki/Musical_theatre) production company incorporated in Singapore in 2004. With the motto *Bringing to the World the Best in British Entertainment*, the BTP is internationally focused with a British connection, as well as it is a long-standing member of the Singaporean [British Chamber of Commerce](/wiki/British_Chamber_of_Commerce) and the European Chamber of Commerce. In 2012, the BTP also established a UK branch office, in order to work more closely with British playwrights, writers, actors, directors, musical directors, and set and costume designers. The company has produced, presented and successfully toured a series of highly successful British productions in [Singapore](/wiki/Singapore), [Malaysia](/wiki/Malaysia), [Indonesia](/wiki/Indonesia), [Thailand](/wiki/Thailand), [Sri Lanka](/wiki/Sri_Lanka), [UAE](/wiki/United_Arab_Emirates) and the [UK](/wiki/UK), and is currently looking to expand its production output in [Hong Kong](/wiki/Hong_Kong) and [India](/wiki/India). Its aim is to continue bringing to the audience shows which feature stars and other prominent stage, television and film actors, or music performers, from [London](/wiki/London)'s [West End](/wiki/West_End_theatre), as it has been the case with all its shows so far. So far, the BTP has produced 26 plays and musicals, making it a largely active production and touring company, as it has been steadily achieving at least 2 productions per year since its foundation. ## Founding history The founders of the British Theatre Playhouse are Cecilia Leong-Faulkner and John Faulkner. Cecilia and John met in Kuala Lumpur when Cecilia was working for American Express International in Kuala Lumpur which sponsored the play Bedroom Farce by Sir [Alan Ayckbourn](/wiki/Alan_Ayckbourn) CBE and John was appearing in a dinner-theatre play at [The Regent Hotel](/wiki/The_Regent_Hotel) for the late British actor and producer [Derek Nimmo](/wiki/Derek_Nimmo). The idea for the foundation of the BTP came to them over a dinner one evening back in 2002, two years before the foundation of the BTP in 2004, when a comment was made about the absence of British plays in Singapore. Cecilia is currently the managing director of the company. John Faulkner (also known by his equity performer's name Richard Denning) has worked as a producer, director and performer in London, UK, and in over twenty other countries. He is currently the artistic director of the BTP. Thanks to their long-standing promotion of the British culture in the area through the British Theatre Playhouse, Cecilia and John were also invited to meet [The Queen](/wiki/Elizabeth_II) and [Prince Philip](/wiki/Prince_Philip) on the occasion of the Queen's state visit to Singapore in March 2006.[*citation needed*] On another occasion, Cecilia was invited to meet [Prince William](/wiki/Prince_William) and his wife [Kate Middleton](/wiki/Kate_Middleton) when they officially visited Singapore in September 2012. Further to the above, Cecilia also collaborated with the welfare charity [The Mission to Seafarers](/wiki/The_Mission_to_Seafarers) and was thus invited to meet its Royal Patron, [Princess Anne](/wiki/Anne,_Princess_Royal), at a reception on board the [Royal Albatross](/wiki/Royal_Albatross_(ship)) yacht on 3 November 2016. [Prince Charles](/wiki/Charles,_Prince_of_Wales) and his wife, [Camilla, the Duchess of Cornwall](/wiki/Camilla,_Duchess_of_Cornwall) arrived in Singapore on 30 October 2017 on a royal visit to strengthen ties between Britain and Singapore/Asian countries. In conjunction with the visit, Cecilia was invited to meet Prince Charles and his wife at a VIP reception held at [Eden Hall](/wiki/Eden_Hall,_Singapore) hosted by the British High Commissioner, [Scott Wightman](/wiki/Scott_Wightman) and his wife, Anne Wightman. ## Patrons The British Theatre Playhouse has the honour to have distinguished patrons chosen to be special supporters of British Theatre in Singapore and the wider region. The Life Patron since the foundation of the BTP [Sir Alan Collins](/wiki/Alan_Stanley_Collins) KCVO CMG. Sir Alan Collins KCVO CMG is the former British High Commissioner to Singapore and former British Consul-General in New York, USA, as well as the Director General and Chief Executive of the [Commonwealth Business Council](/wiki/Commonwealth_Business_Council). Furthermore, HE Nikesh Metha has been the British High Commissioner to Singapore since July 2024. He is the current Patron of the British Theatre Playhouse, succeeding Mrs [Kara Owen](/wiki/Kara_Owen), who became the British High Commissioner to Singapore from 2019 - 2024. Mrs Kara Owen succeeded Mr. [Scott Wightman](/wiki/Scott_Wightman), who became British High Commissioner to Singapore in 2015, who in turn succeeded Mr. [Paul Madden](/wiki/Paul_Madden_(diplomat)) CMG FRGS (2007 - 2011). Moreover, in Malaysia, the British High Commissioner to Malaysia, Mr. Charles Hay, was the Patron of the British Theatre Playhouse in Malaysia, succeeding Mrs. [Victoria Treadwell](/wiki/Victoria_Treadell) CMG MVO. She succeeded Mr [Simon Featherstone](/wiki/Simon_Featherstone) CMG (2010 - 2014), after he succeeded Mr [Boyd McCleary](/wiki/Boyd_McCleary) CMG CVO (2006 - 2010). Mr. [Mark Kent](/wiki/Mark_Kent) also accepted to be the Patron and was the British High British Ambassador to Thailand. ## Honorary advisors The British Theatre Playhouse also has six Honorary Advisors. Steve Puckett has been a board member of the Charities Aid Foundation - South East Asia and the Lien Aid Foundation, as well as an Advisory Board Member of [Singapore Polytechnic](/wiki/Singapore_Polytechnic) and Director of Newcastle University International. He is also the Founder of various companies including the Singapore-based Asia-wide energy consulting company Tri-Zen. Previously, he was the President of the [British Chamber of Commerce](/wiki/British_Chamber_of_Commerce) in Singapore, the Chairman of the [Institution of Chemical Engineers](/wiki/Institution_of_Chemical_Engineers), and until the end of the 1990s he held senior executive positions at [ExxonMobil](/wiki/ExxonMobil). Stephen Mangham is one of the partners in Mangham Gaxiola McGarrybowen, which has been Singapore's biggest ever advertising agency start up. Prior to that, he used to be the chairman of the Ogilvy Singapore Group. Under Stephen's leadership, Ogilvy almost trebled their revenue and in less than six years they grew from 240 to 600 people. Mangham has graduated with a degree in law from [Oxford University](/wiki/Oxford_University). Sophie Brown trained as a [Chartered Accountant](/wiki/Chartered_Accountant) with [PwC](/wiki/PwC) in London in 1999 before working in the industry focusing on M&A and debt structuring. She has worked for private equity-owned, family-owned and FTSE 250 businesses and been Finance Director of several different companies. Damian Adams is a corporate lawyer and partner with the international law firm [Watson Farley & Williams](/wiki/Watson_Farley_%26_Williams). Based in Singapore since early 2000, Adams has over two decades of experience in structuring, negotiating, managing and executing complex cross-border investments and transactions – from greenfield, early-stage and growth capital investments to joint ventures, mergers and acquisitions. He advises venture capital fund managers, private equity and infrastructure investors and international organisations across various sectors, with a particular focus on advising founders, companies and investors on early and growth-stage financings. He has also been an active member of The [British Chamber of Commerce](/wiki/British_Chambers_of_Commerce) in Singapore for more than 15 years, serving variously as a Business Group Chair, Secretary and as an elected board member and President of the British Chamber of Commerce. Sharanjit Leyl who loved doing Arts related stories even as a financial journalist and is a big theatre fan. She has spent a quarter of a century in broadcasting at the [BBC](/wiki/BBC), [Bloomberg TV](/wiki/Bloomberg_Television) and the [CBC](/wiki/CBC_Television). She spent eighteen years with the BBC covering business and politics, anchoring from its Asia bureau and from London's Broadcasting House. She regularly anchored live on location on breaking stories such as the [Trump-Kim summits](/wiki/2018_North_Korea%E2%80%93United_States_Singapore_Summit), the [Hong Kong protests](/wiki/List_of_protests_in_Hong_Kong), the [Sri Lankan Easter Sunday bombings](/wiki/List_of_bombings_in_Sri_Lanka), and many other breaking news deployments. She's contributed to [BBC World Service radio](/wiki/BBC_World_Service) and written for the BBC news website. A Singaporean native, she's produced and presented BBC documentaries on TV and radio about her city. Sharanjit is now such a familiar face for viewers in Asia that she is regularly invited to moderate high-level debates for the [United Nations](/wiki/United_Nations), the [World Bank](/wiki/World_Bank), the [Asian Development Bank](/wiki/Asian_Development_Bank) and other multilateral and financial institutions. Sharanjit Leyl is the new Chancellor-Elect of [Bath Spa University](/wiki/Bath_Spa_University), succeeding Oscar winner [Jeremy Irons](/wiki/Jeremy_Irons). Susan Peh is the Chief Executive Officer of Adsan Law LLC and has been practicing law for over 37 years. She co-heads the Asset Recovery & Insolvency practice group and oversees the Private Clients Practice as well as the Charities and Pro Bono teams. Apart from the practice of law, Susan enjoys music. She was offered a place to study at the prestigious [Royal College of Music](/wiki/Royal_College_of_Music), London, which she had to give up for academia. Susan is a Licentiate of the Royal Schools of Music and a Fellow of the Trinity College of Music (London) in Piano Performing. She has won many piano competitions in Singapore including the First Prize (Open Section, Pianoforte division) in the First National Music Competition in 1980 and was the winner of the [Philips Award](/wiki/Phillips_Award) (First Prize, Open Section) of the Singapore Musical Society’s Annual Piano Competition. Susan serves as the Vice Chairman and one of the founding directors of Jazz Association (Singapore). She sits on the Board of Trustees of the SG Eco Fund. She also serves as Director at the Kwong Wai Shiu Hospital and is a mentor at the Young Women’s Leadership Connection. She believes in giving back to the community that helped build her up, and in creating a lasting legacy for future generations. ## Productions The British Theatre Playhouse has commissioned the third in a series of children's illustrated storybooks to bring back the popular storybook character, Covi, the little green dinosaur, to inspire youngsters during Christmas lockdown due to the COVID-19 pandemic. According to the founder and chief executive of the British Theatre Playhouse, Cecilia Leong-Faulkner, it is important to innovate as art can be re-imagined by tapping into the intellectual creativity of writers; novels are the theatre of the mind where readers can immerse themselves in another world. In the new book entitled Covi, the little Christmas dinosaur, Covi becomes a hero when he helps Santa deliver presents to children during a Christmas lockdown. Featured in the new book is a real-life hero, Harmonie-Rose Allen, a Paralympic gymnast and the first junior ambassador of a charity dedicated to fighting meningitis. Seven-year-old Harmonie-Rose lost all her arms and legs to meningitis when she was only 10-months old and has gone on to defy all the odds. The third Covi book has found positive reviews and was featured in [Good Morning Britain](/wiki/Good_Morning_Britain_(2014_TV_programme)) hosted by [Piers Morgan](/wiki/Piers_Morgan) and [Susanna Reid](/wiki/Susanna_Reid) and the author of the book, Susie Cullen was interviewed by BBC World New arranged. Through the British Theatre Playhouse's \"Give A Child A Book\" campaign, a total of 300 books were purchased and donated to the Singapore Children's Society, including $500 raised for the same charity. ### *Beatlemania - A Musical Journey performed by The Cavern Beatles* To celebrate the 65th anniversary of The Beatles, The British Theatre Playhouse created Beatlemania - A Musical Journey performed by The Cavern Beatles, direct from Liverpool, endorsed and authorised by the famous [Cavern Club](/wiki/The_Cavern_Club)**,** the birthplace of the Beatles. On 21 February 2025, the British High Commission in Singapore hosted a Meet and Greet for The Cavern Beatles held at the Crown and Anchor, attended by the British High Commissioner to Singapore, HE Nik Metha and the Deputy High Commissioner, Lucy Huges, and esteemed guests. On 22 February 2025, the show was presented at the British Theatre Playhouse's \"Art for Charity\" gala in Singapore at One Farrer Hotel, supporting the Business Times Budding Artists Fund and the [Singapore Cancer Society](/wiki/Singapore_Cancer_Society). The next day, on 23 February 2025, in collaboration with the Timbre Group Singapore, The Cavern Beatles performed to a full-house at Timbre+ One North's live music venue. After Singapore, the show then toured to Kuala Lumpur, where it was performed at PJPAC for the JWYE Foundation's charity gala, supporting underprivileged children through scholarships, tuition, resources, and opportunities for a brighter future. It was an honour for the Founder of the British Theatre Playhouse, Cecilia Leong-Faulkner, to introduce the performers to Her Majesty, HRH [Tunku Azizah](/wiki/Tunku_Azizah_Aminah_Maimunah_Iskandariah), the Queen of Pahang and former Permaisuri Agong, immediately after the show. ### *The Australian Bee Gees Show* In December 2023, the British Theatre Playhouse, in association with Worldwide Entertainment, brought The Australian Bee Gees direct from Las Vegas to perform for One Farrer Hotel's year-end revelry. You have to love the Bee Gees and their songs, which have made a cultural impact throughout the World. The event was a total sell-out and one of Singapore's best NYE gala events. ### *Big Girls Don't Cry* In February 2024, the British Theatre Playhouse brought Big Girls Don't Cry back to Singapore to present a charity gala performance and reception at the One Farrer Hotel to support two charities: the [Samaritans of Singapore](/wiki/Samaritans_of_Singapore) and the [United Nations High Commission for Refugees](/wiki/United_Nations_High_Commissioner_for_Refugees). In October 2022, with strict Covid-19 restrictions lifted, the British Theatre Playhouse, in association with Worldwide Entertainment, partnered with One Farrer Hotel to present a musical concert from London West End, *Big Girls Don't Cry*, inside the hotel's Grand Ballroom - the opening night attended by 550 people was a sell-out. ### *He Writes The Songs* In December 2019, the British Theatre Playhouse in association with Worldwide Entertainment collaborated with One Farrer Hotel, Singapore to present *He Write The Songs* - Barry's Ultimate Songbook at the hotel's sell-out New Year Eve's Ball on 31 December 2019. The show celebrates the hits of [Barry Manilow's](/wiki/Barry_Manilow_discography) finest. Tommy McPhee who hails from Scotland sang superbly hits from Barry's songbook including Can't Smile Without You, [Copacabana](/wiki/Copacabana_(song)), Mandy, [Bermuda Triangle](/wiki/Bermuda_Triangle_(song)), [Even Now](/wiki/Even_Now_(Barry_Manilow_song)), [Could It Be Magic](/wiki/Could_It_Be_Magic), I'd Really Love To See You Tonight. ### *A Christmas Carol* In December 2019, the British Theatre Playhouse teamed up with The British Club to produce and present *A Christmas Carol* at the club. A Christmas Carol is a one-man play adapted and performed by British actor, [Clive Francis](/wiki/Clive_Francis) who repeated his RSC performance as the misanthropic [Ebenezer Scrooge](/wiki/Ebenezer_Scrooge). He was inspired by Dickens first reading and performance of [A Christmas Carol](/wiki/A_Christmas_Carol) on 27 December 1853 at the Birmingham Town Hall. He brought to life a whole host of Dickensian characters, from the spectral [Jacob Marley](/wiki/Jacob_Marley) to the warm and loving [Bob Cratchit](/wiki/Bob_Cratchit) and his son [Tiny Rim](/wiki/Tiny_Tim_(A_Christmas_Carol)), not forgetting, of course, the ghosts of Christmas Past, Present and Future. ### *Stars of the West End Sing The Rock Musicals* In April 2019, the British Theatre Playhouse produced *Stars of the West End Sing The Rock Musicals* and the show went to Singapore and Kuala Lumpur, in association with Worldwide Entertainment. The British High Commissioner, [Scott Wightman](/wiki/Scott_Wightman), and the President of the British Chamber of Commerce, Dr Bicky Bhanghu attended the event with their spouses in Singapore. The event took place at One Farrer Hotel. In Kuala Lumpur, the British High Commissioner, [Charles Hay](/wiki/Charles_Hay_(diplomat)), distinguished Malaysian royalty YAM [Tunku Naquiyuddin](/wiki/Tunku_Naquiyuddin) and Tan Sri Dr [Jeffrey Cheah](/wiki/Jeffrey_Cheah), Chairman of Sunway Group attended the event held at Sunway Resort, Hotel and Spa. The show put on the same stage four leading stars from London's West End musicals - Ricardo Afonso, Shona Lindsay, Carole Stennett, Mike Sterling. In Stars of the West End Sing The Rock Musicals, the four leading stars introduced songs by legendary rock stars from the smash-hit musicals, such as We Will Rock You (Queen), Thriller Live (Michael Jackson), The Bodyguard (Whitney Houston), Tina (Tina Turner), Beautiful (Carole King), Grease, Dreamgirls and Motown The Musical. In September 2019, the British Theatre Playhouse in association with [Worldwide Entertainment](/wiki/Worldwide_Entertainment) took Stars of the West End sing The Rock Musicals to Kuala Lumpur at the invitation of [Eu Yan Sang](/wiki/Eu_Yan_Sang) to celebrate the company's 140th Anniversary at Berjaya Times Square Hotel. And a charity gala dinner and charity auction were organised by the Chairman of Eu Yan Sang Malaysia, Dato' Anne Eu to support The Tunku Azizah Fertility Foundation. At the event were The King of Malaysia, King Al-Sultan Abdullah and The Queen of Malaysia, Queen Azizah, the British High Commissioner, Charles Hay, the Chairman of Berjaya Corporation, Datuk Vincent Tan and fashion designer, Datuk Jimmy Choo. Over RM1,000,000 was raised for the charity founded by The Queen of Malaysia. Following the event in Kuala Lumpur, the show proceeded to Jakarta, hosted by the DoubleTree By Hilton Jakarta for one fantastic performance and evening. The four British stars who performed at the [Eu Yan Sang](/wiki/Eu_Yan_Sang)'s 140th Anniversary in Kuala Lumpur in the presence of The King and The Queen of Malaysia, and later at the DoubleTree by Hilton in Jakarta were Ross William Wild, Carole Stennett, Mike Sterling and Shona Lindsay. The four British stars who performed at the Hilton Group's 100th Anniversary-themed owners event in Bangkok were Ross William Wild, [Jenny Fitzpatrick](/wiki/Jenny_Fitzpatrick), Mike Sterling and Shona Lindsay. ### *The Definitive Rat Pack* In June and July 2018, the British Theatre Playhouse produced the Asian tour of *The Definitive Rat Pack* in Singapore, Kuala Lumpur and Dubai, in association with Worldwide Entertainment. The British Theatre Playhouse is renowned for its many years of presenting to audiences in Singapore and the rest of Southeast Asia with the very best in live entertainment brought from London's West End. This year they've extended their reach and Dubai is now included in their itinerary. The Rat Pack: Frank Sinatra, Dean Martin, and Sammy Davis Jr. were legendary singers and entertainers. *The Definitive Rat Pack* has played to audiences in all corners of the globe. Having met in London's West End in 2003 as the original cast of *The Rat Pack: Live from Las Vegas*, which earned an Olivier Award nomination, the British Theatre Playhouse welcomed Stephen Triffitt, Mark Adams and George Daniel Long, now known as *The Definitive Rat Pack*, to Singapore, Kuala Lumpur and Dubai. The production has toured internationally and, driven by UK performers and musicians, now widens the impact of musical theatre in Asia. The first event in Singapore was a public performance, and the second one was a charity gala in aid of the charity organisation The Business Times Budding Artists Fund and was attended by the new President of the Republic of Singapore Madam [Halimah Yacob](/wiki/Halimah_Yacob), the British High Commissioner Mr Scott Wightman, and the Malaysian High Commissioner Dato' Zulkifli Adnan. Both the events took place at One Farrer Hotel and Spa's Grand Ballroom. Likewise, there was a regular performance in Kuala Lumpur, and the event took place in the Grand Ballroom of Hilton Kuala Lumpur. Finally, there were two regular performances in Dubai, and the event took place in Dubai Opera. The Definitive Rat Pack in Singapore, Kuala Lumpur and Dubai featured a special guest Nancy Sinatra played by Hannah Lindsey and a swinging 9-piece band. ### *Tea with the Old Queen* In October 2017, the British Theatre Playhouse in association with The British Club of Singapore produced *Tea with the Old Queen*. Tea with the Old Queen is a comical, witty and poignant theatrical comedy revolving around the imaginary funny eccentricities of the British monarchy, as recorded in the fictional secret diaries of [William Tallon](/wiki/William_Tallon), an actual person who for more than 40 years worked as a Stewart and Page at [Clarence House](/wiki/Clarence_House) where [Queen Elizabeth the Queen Mother](/wiki/Queen_Elizabeth_the_Queen_Mother) lived, due to which he also came to be known as Backstairs Billy. The play was first written as well as directed and produced by the award-winning writer Graham Woolnough. Its current protagonist and the one in Singapore too is Ian Stark, as this is a one-man theatrical comedy. The theatrical comedy has entertained many audiences all these years in the UK, such as in Jermyn Street Theatre in London's West End (2016), Newcastle Theatre (2014), Bridlington Spa Theatre (2012), Guildford's’ Yvonne Arnauld Theatre (2012), Edinburgh Fringe (2012), King's Head Theatre in London (2017 & 2010), and many more. The show was attended by the President of The British Club of Singapore, Mr Damian Hills, and others. ### *Stars of the West End* In June and July 2017, the British Theatre Playhouse produced *Stars of the West End* in Singapore, Kuala Lumpur and Jakarta, in association with Worldwide Entertainment. The first event in Singapore was a regular performance, and the second one was a charity gala in aid of the charity organisation Food from the Heart and was attended by the President of the Republic of Singapore Dr [Tony Tan](/wiki/Tony_Tan), the British High Commissioner Mr Scott Wightman, and the EU Ambassador Dr Michael Pulch. Both the events took place at One Farrer Hotel and Spa. Likewise, there was a regular performance in Jakarta, attended by the Minister of Tourism Mr Ariel Yahya, and the Deputy British Ambassador and Head of Mission to Indonesia Ms Juliet Maric Capeling, and the event took place in [Ciputra Artpreneur Theatre](/wiki/Ciputra_Artpreneur). Finally, there was a charity gala alongside a performance in Kuala Lumpur attended by Tunku Ampuan Tuanku Najihah, and the event took place at the Gardens Ballroom of the Gardens Hotel in Kuala Lumpur. In Stars of the West End, four leading stars of some of the most successful musicals in the history of London's West End, such as *[The Phantom of the Opera](/wiki/The_Phantom_of_the_Opera_at_the_Royal_Albert_Hall)*, *[Les Misérables](/wiki/Les_Mis%C3%A9rables_(musical))*, *[Cats](/wiki/Cats_(musical))*, *[Chicago](/wiki/Chicago_(musical))*, *[Evita](/wiki/Evita_(musical))*, *[Jesus Christ Superstar](/wiki/Jesus_Christ_Superstar_(1996_London_Cast))*, *[Mamma Mia!](/wiki/Mamma_Mia!_(musical))*, *[Miss Saigon](/wiki/Miss_Saigon)*, *[West Side Story](/wiki/West_Side_Story)* and *[Wicked!](/wiki/Wicked_(musical))*, presented songs from the aforementioned musicals. The four leading stars in Singapore were Mike Sterling, Shona Lindsay, Tom Solomon and Jayne O’Mahony. In Kuala Lumpour and Jakarta, Jayne O’Mahony were replaced by Yildz Hussein. ### *Let's Dance – Paul Roberts Sings David Bowie* In November 2016, the British Theatre Playhouse collaborated with Worldwide Entertainment in order to present in Singapore *Let's Dance – Paul Roberts Sings David Bowie*. The show opened in Cé La Vi at [Marina Bay Sands](/wiki/Marina_Bay_Sands) on 10 November and lasted until 12 November 2016. The show was attended by the EU Ambassador to Singapore, Dr Michael Pulch, and his wife, Gabriele Pulch, and other important people of the local political and financial scene. [David Bowie](/wiki/David_Bowie) (8 January 1947 – 10 January 2016), used to be a British pop singer, songwriter and actor, famous for hits such as *Let's Dance*, *Space Oddity*, *Ziggy Stardust*, *China Girl*, and many more. Thus, he was one of the pop icons who influenced [Paul Roberts](/wiki/Paul_Roberts_(musician)), himself a singer, songwriter and actor and former lead singer of the British punk rock music band [The Stranglers](/wiki/The_Stranglers) for more than 15 years. The other band members who comprised the band for that particular show in Singapore was Andy Ellis (guitar), Martin Lawrie (keyboards), Kita Steur (bass) and Jason Day (drums). Also, when [Princess Anne](/wiki/Anne,_Princess_Royal) attended a charity event on 3 November for two charities of which she is the Patroness, [The Mission to Seafarers](/wiki/The_Mission_to_Seafarers) and [Riding for the Disabled](/wiki/Riding_for_the_Disabled_Association), Paul Roberts also performed there, after the respective arrangement of the BTP. ### *The Vortex* In April 2016, the BTP produced the play *[The Vortex](/wiki/The_Vortex)* by Sir [Noël Coward](/wiki/No%C3%ABl_Coward). This is the play that launched Coward's career as one of the great British dramatists with its scathing expose of London's high society in the 1920s. The play featured the distinguished British actress [Jane Seymour](/wiki/Jane_Seymour_(actress)) OBE, in the demanding role of Florence Lancaster, a high society and promiscuous beauty facing advancing years and lovers. Jane Seymour is famous for her role in the TV series [Dr Quinn, Medicine Woman](/wiki/Dr_Quinn,_Medicine_Woman), for which she won her second [Golden Globe Award](/wiki/Golden_Globe_Award) and got endeared by audiences worldwide, as well as for her role in the [James Bond](/wiki/James_Bond) film [Live and Let Die](/wiki/Live_and_Let_Die_(film)). This was Jane's first time on an Asian stage. Other actors and actresses included James Cartwright, Alex Spinney, Arthur Bostrom, Kate Malyon, Tracy Brabin, Julie Teal, John Fagan and John Faulkner. The play was directed by Bob Thomson, and Michael Holt was the set designer. The production opened at the Jubilee Hall Theatre of the [Raffles Hotel](/wiki/Raffles_Hotel) in Singapore from 27 April to 15 May 2016. An Art for Charity gala took place on 29 April to raise money for the International Committee of Red Cross as well as for Singapore Red Cross, and it was attended by The President of Singapore Dr [Tony Tan](/wiki/Tony_Tan) with his wife Mrs Mary Tan, the British High Commissioner in Singapore Mr Scott Wightman CMG that is one of the Patrons of the BTP, and the EU Ambassador in Singapore Dr Michael Pulch. ### *No Sex, Please – We're British* Previously, in May 2015, the BTP produced the play [*No Sex, Please – We're British*](/wiki/No_Sex_Please,_We%27re_British). This was one of the world's longest running comedies, running continuously for sixteen years in London's West End, and also one of the favourite forms of British theatre – farce. The play starred [Nick Wilton](/wiki/Nick_Wilton) and was directed by Alister Cameron, and enjoyed great success in both Singapore and Kuala Lumpur. In Singapore, the play was also attended by the President Dr [Tony Tan](/wiki/Tony_Tan). The opening night in Singapore was on 6 May at the [Raffles Hotel](/wiki/Raffles_Hotel)'s Jubilee Hall Theatre, followed by a Charity Gala Performance and Dinner on 8 May, the President Dr [Tony Tan](/wiki/Tony_Tan)'s visit on 14 May, and the Cheque Presentation to Breast Cancer Foundation on 19 June. Subsequently, the play moved to Kuala Lumpur for more shows from 19 to 22 May at the [Hotel Majestic Kuala Lumpur](/wiki/Hotel_Majestic_(Kuala_Lumpur)). The play featured the artists [Nick Wilton](/wiki/Nick_Wilton), Alister Cameron, Sarah-Jayne Butler, Harry Livingstone, Lynette McMorrough, John Faulkner, Clive Flint, Lisa Hurst and Adele Oni. Alister Cameron was also its director, and its set designer was Katy Tuxford. ### *Leo Sayer in Concert – 40 Years at the Top* Extending the horizons into the music world again, as it had done before too, the BTP presented two musical productions from the British-born singer [Leo Sayer](/wiki/Leo_Sayer), in January 2015. The name of the tour was *Leo Sayer in Concert – 40 Years at the Top*. The events premiered on 16 January with Cocktails at the [Eden Hall](/wiki/Eden_Hall), which is the official residence of the British High Commissioner in Singapore, continued with Leo Sayer Live in Singapore on 17 January at the [Esplanade - Theatres on the Bay's Concert Hall](/wiki/Esplanade_%E2%80%93_Theatres_on_the_Bay), and concluded with the After-Show party for the VIP guests to meet Leo Sayer later at the night of 17 January. The concert in Kuala Lumpur was held on 20 January at the [Kuala Lumpur City Centre's Convention Centre](/wiki/Kuala_Lumpur_Convention_Centre), with an After Show Party for the Queen of Malaysia [Kebawah Duli Yang Maha Mulia Seri Paduka Baginda Raja Permaisuri Agong](/wiki/Raja_Permaisuri_Agong), the Royal Princess of Pahang YAM Tengku Muhaini Sultan Ahmad Shah, and other VIPs to meet Leo Sayer after the show. The band included Ronnie Johnson (guitar), Elliot Henshaw (drums), Rob Taggart (keyboards) and Dave Troke (bass), under the consultancy of [Toby Cruse](/wiki/Toby_Cruse). ### *Yes, Prime Minister* In 2014, the BTP produced the quintessentially British award-winning comedy *[Yes, Prime Minister](/wiki/Yes,_Prime_Minister)* by Sir [Antony Jay](/wiki/Antony_Jay) CBE CVO and [Jonathan Lynn](/wiki/Jonathan_Lynn). Based on the successful [BBC](/wiki/BBC) television series by the same writers, the stage version had run for two years in London's West End in 2011 and 2012, followed by a successful tour in the UK in 2013. The play opened at [Raffles Hotel](/wiki/Raffles_Hotel)'s Jubilee Hall theatre on 8 May, followed by the Charity Gala Performance and Dinner on 9 May, lunch on 12 May at the [Eden Hall](/wiki/Eden_Hall,_Singapore), the visit of the Singaporean President Dr [Tony Tan](/wiki/Tony_Tan) on 17 May, and the Cheque Presentation on 19 May. Subsequently, the show toured to Kuala Lumpur for shows from 21 to 25 May, and Malaysia's Prime Minister Dato' Seri [Najib Razak](/wiki/Najib_Razak) also attended the play, as well as the Malaysian royalty YAM [Yang Amat Mulia Tunku Laxamana Tunku Dato' Seri Utama Naquiyuddin Tuanku Ja'afar](/wiki/Tunku_Naquiyuddin) Ibni Tuanku Ja’afar DK, DKYR, SPNS, SPMP, PPT, and the Chairman of the British Malaysian Chamber of Commerce Dato’ Seri Larry Gan. The play included the artists John McAndrew (Jim Hacker), Crispin Redman (Sir Humphrey Appleby), Antony Eden (Bernard Wooley), Sasha Waddell (Claire Sutton), David Warwick (The Kumranistan Ambassador) and John Faulkner (Simon Chester). The director was Robin Herford, and the set designer was Simon Higlett. ### *Agatha Christie's The Mousetrap* October 2013 saw the company's most successful production with sell-out nights by audiences in both Singapore and Kuala Lumpur as well as great success in Bangkok. The play was the world's longest running play, [Agatha Christie](/wiki/Agatha_Christie)'s *[The Mousetrap](/wiki/The_Mousetrap)*, and this production was part of the show's worldwide celebrations of the Diamond Anniversary of the first performance in London 60 years ago and the continuous run since then. The show was first presented in Bangkok from 27 to 29 September at Aksra Theatre, and was graced by the British Ambassador to Thailand Mr Mark Kent. The opening night in Singapore took place on 4 October at the [Raffles Hotel](/wiki/Raffles_Hotel)'s Jubilee Hall Theatre, followed by the [Eden Hall](/wiki/Eden_Hall) lunch on 7 October, and the Charity Gala Performance and Dinner on 10 October which was attended by Singapore's President Dr [Tony Tan](/wiki/Tony_Tan) and his wife Mrs Mary Tan. In Kuala Lumpur the show was presented from 16 to 20 October at the Auditorium DBKL and was attended by the former Prime Minister of Malaysia Dato’ Sri Dr Mahathir Mohaamad and his wife Dr Siti Hasmah. The artists of the play included Tim Wallers, Isla Carter, Richard Keightley, Sarah Whitlock, John Faulkner, Katherine Heath, Tony Boncza and Thomas Richardson; the director was Denise Silvey; and the set designer was Malcolm J. Mclnnes following the work of the original set of Roger Furse from 1952. ### *Louis Hoover's Salute to Sinatra* In a change of artistic orientation, the BTP also presented Louis Hoover's solo music show *Salute to Sinatra*, featuring a live 18-piece band on stage to back Louis Hoover, with songs from the celebrated career of [Frank Sinatra](/wiki/Frank_Sinatra). The events of the show started with an invitation for the VIPs to meet Louis Hoover on 17 October 2012, followed by the opening night and the Charity Gala Performance and Dinner on 18 October at the Sands Theatre of [Marina Bay Sands](/wiki/Marina_Bay_Sands), Singapore, which was also attended by the former President of Singapore Mr [S.R. Nathan](/wiki/S.R._Nathan). The artists included Louis Hoover himself with The Hollywood Orchestra and Melissa Tham; the musical director was [Toby Cruse](/wiki/Toby_Cruse); and the UK musicians were again Toby Cruse (piano/keyboards), Elliot Henshaw (drums), David Olney (bass), Robert Sydor (tenor sax/flute/clarinet) and Tony Dixon (lead trumpet). ### *Out of Order* Earlier in the same year of 2012, the BTP had produced [Ray Cooney](/wiki/Ray_Cooney) OBE's award-winning farce *[Out of Order](/wiki/Out_of_Order_(play)).* The show was presented at the [Raffles Hotel](/wiki/Raffles_Hotel)'s Jubilee Hall in Singapore, and later on at the Double Tree Hotel in Kuala Lumpur, with great box office success at both venues. The events for this show included a Meet-the-Cast Reception at Eden Hall on 9 April, a Charity Gala Performance and Dinner on 11 April, and the actual performances took place from 11 to 15 April at the Jubilee Hall Theatre of the [Raffles Hotel](/wiki/Raffles_Hotel). The opening night was also attended by the Singaporean President Dr [Tony Tan](/wiki/Tony_Tan) and his wife Mrs Mary Tan, the then British High Commissioner Mr [Antony Phillipson](/wiki/Antony_Phillipson), and the then President of the British Chamber of Commerce Mr Steve Puckett. The artists were [Nick Wilton](/wiki/Nick_Wilton), [Robin Kermode](/wiki/Robin_Kermode), Jolana Lee, Sasha Waddell, Paddy Navin, David Streames, Edward Grace, David Warwick and John Faulkner; the director was David Warwick; and the set designer was Katy Tuxford. ### *Buddy vs The Killer* As the BTP had diversified, since the appeal of musical shows in the region had become clear to its owners, an electrifying rock 'n roll show was produced in May 2011, called *Buddy Vs the Killer*. The show thus made its world premiere debut in Singapore, and after that it toured to Kuala Lumpur where it was presented at the Hilton Kuala Lumpur. It was devised by the British actor-musicians Billy Geraghty and Kevin Oliver Jones, and featured the songs of the rock 'n roll icons and [Buddy Holly](/wiki/Buddy_Holly) and [Jerry Lee Lewis](/wiki/Jerry_Lee_Lewis). Jerry used to be known as 'the Killer' and hence this title. This show started with rehearsals in the area of [Pimlico](/wiki/Pimlico) in London in April 2011. When everything was ready and everyone moved to Singapore, the show started with a Meet the Cast Party on 2 May at the [Eden Hall](/wiki/Eden_Hall), then from 4 to 8 May the doors opened at Jubilee Hall Theatre of the [Raffles Hotel](/wiki/Raffles_Hotel), followed by the British Night Charity Gala on 6 May at the same venue. The success of the musical led to the transfer of the production to the UK, to the [Wolverhampton Grand Theatre](/wiki/Grand_Theatre,_Wolverhampton) and the [Futurist Theatre](/wiki/Futurist_Theatre). For this musical, the artists were Billy Geraghty, Kevin Oliver Jones, Tom Connor, Tara Nelson, Adam Keast, Ally Holmes, Dan de Cruz and Jason Blackwater; the director was John Faulkner; the music director was Kevin Oliver Jones; and the set designer was Graham Lough. ### *From a Jack to a King* The BTP closed the decade with the production of the play *From a Jack to a King* by [Bob Carlton](/wiki/Bob_Carlton), which was presented at the [Raffles Hotel](/wiki/Raffles_Hotel)'s Jubilee Hall Theatre in Singapore, from 5 to 9 May 2010. The opening night was attended by the Minister for Education [Ng Eng Hen](/wiki/Ng_Eng_Hen) and his wife Ivy Ng, and the Director for the British Council Mark Howard. The following week, the musical production was also presented in Kuala Lumpur at the Hilton Kuala Lumpur. The artists included Peter Helmer, Matt Devitt, Steve Simmonds, Kevin Jones, Ally Holmes, Grant Dinwoodie, Sarah Whittuck, Maria Lawson and Jane Milligan. The director was Matt Devitt; the music director was Dai Watts; and the set and costume designer was Rodney Ford. ### *Blonde Bombshells of 1943* [Alan Plater](/wiki/Alan_Plater) CBE FRSL's *Blonde Bombshells of 1943* was produced and presented at the Raffles Hotel's Jubilee Hall Theatre, Singapore, from 29 October to 2 November 2008. It was one more musical produced by the BTP, achieving an equally impressive success. Subsequently, the musical play was presented in Kuala Lumpur at the Hilton Kuala Lumpur, and in Bangkok at the [Hilton Bangkok](/wiki/Bangkok_Hilton). The artists for this play were Alison Harding, Karen Paullada, Rosie Jenkins, Suzie Emmett, Barbara Hockaday, Sarah Whittuck, Jane Milligan and Oliver Chopping; the director was again John Faulkner; and the music director was Howard Gray. ### *The Rise and Fall of Little Voice* [Jim Cartwright](/wiki/Jim_Cartwright)'s *[The Rise and Fall of Little Voice](/wiki/The_Rise_and_Fall_of_Little_Voice)* was the first musical which was produced by the British Theatre Playhouse, opening its doors at the Jubilee Hall Theatre of the [Raffles Hotel](/wiki/Raffles_Hotel) in Singapore, from 16 to 21 January 2008. The opening night was honoured by the presence of the Singaporean President Mr [S.R. Nathan](/wiki/S.R._Nathan). After that, the musical play was also presented in Kuala Lumpur at the Hilton Kuala Lumpur, in Bangkok at the [Hilton Bangkok](/wiki/Bangkok_Hilton), and in Sri Lanka at the [Hilton Colombo](/wiki/Hilton_Colombo). For this play, the artists were James Cartwright, Sarah Duncan, John McArdle, Michelle McManus, Rachael Wood and John Faulkner. The director was Alexander Holt; the set designer was Norman Coates; and the music director was Stuart Barr. ### *Relatively Speaking* [*Relatively Speaking*](/wiki/Relatively_Speaking_(1965_play)) was a production of Sir [Alan Ayckbourn](/wiki/Alan_Ayckbourn) CBE. It was first presented from 2 to 6 May 2007 at the [Raffles Hotel](/wiki/Raffles_Hotel)'s Jubilee Hall Theatre in Singapore, and then toured to Kuala Lumpur in Malaysia, and Colombo in Sri Lanka. The artists were Jeremy Gittins, William Rycroft, Amanda Waldy and Marianne Oldham; the director was John Nolan; and the set designer was Norman Coates. ### *A Bedfull of Foreigners* *[A Bedfull of Foreigners](/wiki/A_Bedfull_of_Foreigners)* by [Dave Freeman](/wiki/Dave_Freeman_(British_writer)) was the BTP's previous production. It was presented from 15 to 19 November 2006 at the Jubilee Hall Theatre of [Raffles Hotel](/wiki/Raffles_Hotel) in Singapore, and then toured to Kuala Lumpur and was presented there at the Hilton Kuala Lumpur. [Nick Wilton](/wiki/Nick_Wilton), Jeremy Gittins, John Nolan, Kim Hartman, Corinna Powlesland, Emma Francis and John Faulkner were the artists for this play; [John Nolan](/wiki/John_Nolan_(British_actor)) was the director, and Norman Coates was the set designer. John Nolan has also participated in the [Batman](/wiki/Batman) films *[Batman Begins](/wiki/Batman_Begins)*, *[The Dark Knight](/wiki/The_Dark_Knight)* and *[The Dark Knight Rises](/wiki/The_Dark_Knight_Rises)*, produced by his nephews [Jonathan Nolan](/wiki/Jonathan_Nolan) and [Christopher Nolan](/wiki/Christopher_Nolan). ### *Private Lives* In April 2006, the BTP turned to the playwright Sir [Noël Coward](/wiki/No%C3%ABl_Coward), with a production of his most famous play, **[Private Lives](/wiki/Private_Lives)**. This celebrated the 76th anniversary of the original West End production back on 24 September 1930. The play first featured from 18 to 22 April in Singapore ([Raffles Hotel](/wiki/Raffles_Hotel)'s Jubilee Hall Theatre), and was attended by the former President of Singapore Mr [S.R. Nathan](/wiki/S.R._Nathan) and his wife Mrs Nathan, and the Minister for Trade and Industry Mr [Lim Hng Kiang](/wiki/Lim_Hng_Kiang) and his wife Mrs Lim. Subsequently, the show went on tour to Kuala Lumpur (Hilton Kuala Lumpur), and Penang (Eastern and Oriental Hotel), and afterwards to Bangkok ([Mandarin Oriental Bangkok](/wiki/Mandarin_Oriental_Bangkok)). Among the artists were Mary Tamm, Crispin Redman, Kitty Lucas and Nick Waring; the director was David Warwick; and the set designer was Nancy Surman. ### *Funny Money* 2005 marked the second year of the BTP. The company presented [Ray Cooney](/wiki/Ray_Cooney)'s hit farce **[Funny Money](/wiki/Funny_Money_(play))** at the [Shangri-La Hotel Singapore](/wiki/Shangri-La_Hotel_Singapore) from 3 to 7 May in a dinner-theatre format. The play was attended by the Founder of Singapore Mr [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) GCMG, CH, SPMJ and his wife Mrs Lee, the current Deputy Prime Minister of Singapore and then Defence Minister Mr [Teo Chee Hean](/wiki/Teo_Chee_Hean) and his wife Mrs Teo, and the former President British Chamber of Commerce and SE Director of [Rolls-Royce](/wiki/Rolls-Royce_Motors) Mr Jonathan Asherson. Then, the show was presented at the then new Hilton Hotel in Kuala Lumpur, where it was a sell-out. The artists included [Nick Wilton](/wiki/Nick_Wilton), [Kim Hartman](/wiki/Kim_Hartman), Patrick Moncton, [Louise Jameson](/wiki/Louise_Jameson) (*[Doctor Who](/wiki/Doctor_Who)*), John Nolan, David Warwick, John Faulkner and David Mercatali; the director was David Warwick; and the set designer was Katy Tuxford. ### *Oscar Wilde's The Importance of Being Earnest* From 12 to 17 October 2004, the BTP produced its second play. This was the world classic *[The Importance of Being Earnest](/wiki/The_Importance_of_Being_Earnest)* by [Oscar Wilde](/wiki/Oscar_Wilde), at the Jubilee Hall Theatre of the [Raffles Hotel](/wiki/Raffles_Hotel) in Singapore. ### *How the Other Half Loves* Sir [Alan Ayckbourn](/wiki/Alan_Ayckbourn)'s *[How the Other Half Loves](/wiki/How_the_Other_Half_Loves)* was the first show produced by the BTP. The production was presented in the dinner-theatre setting of Singapore's [Shangri-La Hotel](/wiki/Shangri-La_Hotel_Singapore) from 27 to 30 April 2004 and was a sell-out. The featured artists were Nigel Anthony, Louise Jameson, John McAndrew, Louise English, John Faulkner and Charlotte Chiew; the director was David Warwick; and the set designer was Katy Tuxford. ## British Theatre Playhouse Academy The company established a training arm, the British Theatre Playhouse Academy and teamed up with [Robin Kermode](/wiki/Robin_Kermode), English actor, best-selling author of Speak So Your Audience Will Listen, media personality and global coach to offer virtual business communication programs including Presentation Skills workshops and Public Speaking Masterclass aimed at leaders, corporate teams and individuals who want to land their message and ace their presentation. ## Contribution to the Community Believing in considerate corporate citizenship, the British Theatre Playhouse is also well known for its contribution to the community via raising money for various worthwhile causes and charities. In October 2004, the first year of BTP's operation, the BTP teamed up with Singapore Tatler and raised SGD 140,000 for the Community Chest of Singapore through [Oscar Wilde](/wiki/Oscar_Wilde)'s show *[The Importance of Being Earnest](/wiki/The_Importance_of_Being_Earnest)*. In the April of the same year, the BTP teamed up with Ikebana International on the occasion of the show *[How the Other Half Loves](/wiki/How_the_Other_Half_Loves)* and raised SGD 43,431 for Make-a-Wish Foundation. In May 2005, the BTP teamed up with Ikebana International and organised a charity gala to support the Canossian Home for the Hearing Impaired through the show *[Funny Money](/wiki/Funny_Money_(play))*. In April 2006, the BTP teamed up once again with Singapore Tatler to raise SGD 80,000 for the Community Chest of Singapore through *[Private Lives](/wiki/Private_Lives)*. Later in November, the BTP teamed up with the American Association of Singapore to raise SGD 100,000 for KK Hospital's Regional Outreach to Kids Fund through the play [*A Bedful of Foreigners*](/wiki/A_Bed_Full_Of_Foreigners). In May 2007, the BTP helped to raise SGD 35,000 for Make a Wish Foundation Singapore through the charity gala of the production [*Relatively Speaking*](/wiki/Relatively_Speaking_(1965_play)). Make a Wish Foundation is dedicated to granting heartfelt wishes of children between the ages of 3 and 18 who are challenged with a life-threatening illness or life-threatening medical conditions. In January 2008, the BTP helped to raise SGD 85,000 for Viva Foundation for Children with Cancer through the charity gala of the production *[The Rise and Fall of Little Voice](/wiki/The_Rise_and_Fall_of_Little_Voice)*. Later in October, the BTP helped to raise SGD 97,000 for the Fund MILK (Me I Love Kids), in order to help disadvantaged children 'who fall through the cracks of social safety net' with the play *Blonde Bombshells of 1943*. In October 2012, *Salute to Sinatra* raised SGD 72,000 for the Straits Times School Pocket Money Fund. Earlier in April of the same year, [*Out of Order*](/wiki/Out_of_Order_(play)) raised SGD 85,000 for the Business Times Budding Artists Fund. In May 2010, on the occasion of *From a Jack to a King*, the BTP teamed up with the Association of Women Doctors and raised SGD 93,000 for KK Hospital Health Endowment Fund. In May 2011, the BTP teamed up with the British Chamber of Commerce and the European Chamber of Commerce and raised SGD 130,000 for Viva Foundation for Children with Cancer, on the occasion of the production *Buddy vs the Killer.* In October 2013, SGD 80,000 was raised for HCA Hospice Care (Hong Kong - China - America) thanks to the charity gala of [Agatha Christie](/wiki/Agatha_Christie)'s *[The Mousetrap](/wiki/The_Mousetrap)*. In May 2014, the charity gala on the occasion of *[Yes, Prime Minister](/wiki/Yes,_Prime_Minister)* raised SGD 45,888 for Beautiful People and Singapore Committee for UN Movement. In January and May 2015, the BTP raised SGD 52,000 for the Breast Cancer Foundation through the charity galas that it organised on the occasion of the shows of *Leo Sayer in Concert – 40 Years At The Top* and [*No Sex Please – We're British*](/wiki/No_Sex_Please,_We%27re_British). In April 2016, $52,000 was raised by BTP for the [Singapore Red Cross](/wiki/Singapore_Red_Cross_Society) and the [International Committee of the Red Cross](/wiki/International_Committee_of_the_Red_Cross) to help those in need and save lives through a charity gala of *The Vortex* play starring British Hollywood actress [Jane Seymour](/wiki/Jane_Seymour_(actress)), OBE at Raffles Hotel. In November 2016, BTP supported the two favourite charities, The Mission of The Seafarers and Riding For The Disabled, of [Princess Anne](/wiki/Princess_Anne) by arranging Paul Roberts, ex-frontman of [The Stranglers](/wiki/The_Stranglers), to sing in her presence at a fundraising event on board the Royal Albatross and separately, by organising an exclusive gala dinner at CE LA VI with a performance of *Let's Dance - Paul Roberts sings David Bowie*, in association with Worldwide Entertainment. In June 2017, BTP teamed up with Food From The Heart in Singapore to raise $31,200 for the charity through a charity gala dinner with a *Stars of the West End* performance featuring four performers who played leading roles in some of the most successful musicals in the history of London's West End. In June 2018, the company raised S60,000 in aid of The Business Times Budding Artists Fund by organising a charity gala dinner with a performance of *The Definitive Rat Pack* in Singapore in association with [Worldwide Entertainment](/wiki/Worldwide_Entertainment). In October 2022, BTP raised close to $50,000 through the British Theatre Playhouse's \"Art for Charity\" gala dinner and show, *Big Girls Don't Cry***,** to support the #Engage Initiative, a cause of TRCL (The Rice Company Ltd) in Singapore. This is the second time that BTP has supported TRCL. The glamorous gala event was attended by [Eric Chua](/wiki/Eric_Chua), Senior Parliamentary Secretary for Culture, Community & Youth, the British High Commissioner, H.E. Kara Owen, the President of the British Chamber of Commerce, Damian Adams and by those many in Singapore that enjoy a wonderful evening of live entertainment. In February 2024, the company raised a total of $31,512 through the BTP \"Art for Charity\" gala reception and show featuring *Big Girls Don't Cry*. The funds raised were dedicated to supporting the [UNHCR](/wiki/United_Nations_High_Commissioner_for_Refugees) and [SOS](/wiki/Samaritans_of_Singapore). The event was graced by the presence of the British High Commissioner to Singapore, HE [Kara Owens](/wiki/Kara_Owen), and attracted notable sponsors such as [Diageo](/wiki/Diageo) and Infinity Jewels. In February 2025, the company raised a total of $28,000 through the BTP \"Art for Charity\" gala reception and show in Singapore, featuring *Beatlemania - A Musical Journey performed by The Cavern Beatles.* The funds raised were donated to the Business Times Budding Artists Fund and the [Singapore Cancer Society](/wiki/Singapore_Cancer_Society). The event was graced by the British High Commissioner to Singapore, HE Nikesh Metha, and his wife, Anna. ## Awards and Distinctions In 2006, the BTP produced **[Private Lives](/wiki/Private_Lives)** and this play was nominated for the category ‘Best Leisure Event’ by the [Singapore Tourism Board](/wiki/Singapore_Tourism_Board). Two years later, in 2008, the BTP was nominated and selected as one of the three finalists at Singapore's 'British Business Awards', awarded by the British Chamber of Commerce. The BTP currently also appears in the distinguished website Doing Business in Singapore. Equally impressively, in 2014, Cecilia became the face of the advertisements as a 'Community Star' finalist in the 15th Annual Business Awards in Singapore. In August 2019, Cecilia received from CMO Asia and Global MICE Congress & Awards the \"Most Influential Women Leaders\" Award (in the event entertainment industry).\n",
  "language": "en",
  "processed_at": "2026-01-12T09:58:03.925561",
  "title": "British Theatre Playhouse",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/British_Theatre_Playhouse"
}