{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:58:14.401229"
  },
  "content": "Bus Interchange in Buangkok **Buangkok Bus Interchange** is an air-conditioned [bus interchange](/wiki/Bus_station) located at [Buangkok](/wiki/Buangkok). It is situated within the Sengkang Grand Mall integrated development, comprising a 3-level retail mall, a hawker centre, a childcare centre, a community club, and a condominium. It is also linked with [Buangkok MRT station](/wiki/Buangkok_MRT_station) and serves the surrounding residential estates of [Buangkok](/wiki/Buangkok), [Compassvale](/wiki/Compassvale), and parts of [Hougang](/wiki/Hougang). ## History Plans for a new integrated commercial and residential project adjacent to Buangkok MRT station, which includes a new bus interchange, were officially unveiled in [Urban Redevelopment Authority's](/wiki/Urban_Redevelopment_Authority) (URA) Master Plan 2019. Buangkok Bus Interchange officially commenced operations on 1 December 2024, with three existing bus services, 110, 114 and 156, amended to the interchange on the same day. Compassvale Bus Interchange, which formerly housed service 110, ceased operations on the same day. ## Bus Contracting Model Under the [Bus Contracting Model](/wiki/Bus_contracting_model_of_Singapore), all bus services operating from Buangkok Bus Interchange were divided into 3 Bus Packages, operated by two different bus operators. ### List of Bus Services OperatorPackageRoutes**SBS Transit**Clementi156Sengkang-Hougang114**SMRT Buses**Woodlands110 This article about a Singapore building or structure is a stub. You can help Wikipedia by expanding it. - v - t - e This bus station-related article is a stub. You can help Wikipedia by expanding it. This Singapore bus-related article is a stub. You can help Wikipedia by expanding it. - v - t - e This article about transport in [Singapore](/wiki/Singapore) is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T09:58:14.400737",
  "title": "Buangkok Bus Interchange",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Buangkok_Bus_Interchange"
}