{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:58:26.632600"
  },
  "content": "Ethnic group The **Bugis-Malay**, also known as **Malay-Bugis**, **Melayu-Bugis** or **Peranakan Bugis**, refers to a cultural a cultural and ethnic group with heritage rooted in both [Malays](/wiki/Malays_(ethnic_group)) and [Bugis/Buginese](/wiki/Bugis) communities, typically comprising individuals of mixed Malay and [South Sulawesi](/wiki/South_Sulawesi) ancestry. This group descends from multiple waves of migration from South Sulawesi, particularly to [Johor](/wiki/Johor) and [Riau Archipelago](/wiki/Riau_Archipelago), as well as [Selangor](/wiki/Selangor), [Singapore](/wiki/Singapore) and other areas, between the 17th and early 20th centuries. These migrations, which took place from the 17th to the early 20th centuries, led to the establishment of significant Bugis communities in regions such as Johor, Riau, Selangor and Singapore. Over time, the Bugis integrated into local Malay societies, contributing to the region's political, economic and cultural development. ## Historical migrations The migrations represent a significant historical movement of peoples from [Sulawesi](/wiki/Sulawesi), Indonesia, to various regions across [Southeast Asia](/wiki/Southeast_Asia) spanning from the 17th to the 20th centuries. These migrations were driven by a combination of economic, political and cultural factors and played a crucial role in shaping the demographics and cultural landscapes of the Malay Peninsula, Sumatra and Borneo. ### Migration patterns and settlements The Bugis-Malays are descendants of various waves of migration from Sulawesi to the Malay Peninsula, Sumatra, and western Borneo. This movement began in the 17th century and continued through the 20th century. It is part of a broader pattern of Bugis migration across the region, which led to the establishment of significant Bugis diaspora communities in Southeast Kalimantan, Kutai, Java, Lombok, Aceh and Bali. In some locations, such as [Pagatan](/wiki/Kota_Pagatan) in South Kalimantan, the Bugis established a distinct diaspora identity, while in other areas, including [Batavia](/wiki/Batavia,_Dutch_East_Indies) (now Jakarta), Central Java, and [Siam](/wiki/Thailand) (now Thailand), their descendants assimilated into the larger local communities. ### Cultural and economic motivations The Bugis are renowned for their exceptional seafaring skills, as celebrated in their epic literary work, [La Galigo](/wiki/La_Galigo). This epic recounts the legendary voyages of Sawerigading, reflecting the Bugis' deep-rooted inclination towards exploration and travel. The cultural value of siri, which encompasses pride, honor and dignity, significantly motivated the Bugis to seek new opportunities. Maintaining their social status and personal honor through siri drove them to strive for self-improvement and resilience. Economic factors also played a pivotal role in the migration of the Bugis. The mid-19th century brought substantial economic growth to the Malay Archipelago, particularly in land cultivation and trade. This expansion created new opportunities that drew Bugis settlers, for instance in regions like Johor, where the authorities actively encouraged migration to boost economic development. The promise of economic advancement was a strong incentive for many Bugis families. ### Political influences Political changes further influenced Bugis migration patterns. The Dutch East India Company (VOC) established a monopoly over the region following the [Bongaya Agreement](/wiki/Treaty_of_Bongaya) and the conquest of [Makassar](/wiki/Makassar). This Dutch dominance, marked by the imposition of [Dutch currency](/wiki/Dutch_guilder) and [forced labor](/wiki/Forced_labour) practices, created economic and social pressures that led to widespread resentment among the local population. The forced labor system, particularly burdensome for lower-ranking Bugis nobles, contributed to widespread dissatisfaction and resistance. ### Impact and legacy In response to these economic and political pressures, many Bugis migrated to other parts of Indonesia and the Malay Peninsula, driven by the search for improved living conditions and economic opportunities, as well as a desire to escape oppressive circumstances. This migration resulted in the formation of Bugis communities across Southeast Asia, contributing to the region's cultural and demographic diversity. ## Historical influence of the Bugis in the Malay archipelago The fall of Makassar had a significant impact, prompting a large-scale migration towards the [Malay regions](/wiki/Malay_world) and other areas including [Bali](/wiki/Bali), [Java](/wiki/Java), [Borneo](/wiki/Borneo) and [Aceh](/wiki/Aceh). This exodus included not only the Bugis-Malays of Sulawesi but also the Bugis, Makassar and Mandarese people. The political and economic upheavals following the Makassar War and the subsequent Treaty of Bongaya, which disadvantaged the Gowa Kingdom, drove many Bugis and other inhabitants of Sulawesi to seek new opportunities and refuge from the turbulent political climate. The historical narrative of the Bugis in the Malay lands is characterized by their influential presence across various sultanates and regions. This migration led to the Bugis establishing significant settlements and playing key roles in the socio-political landscapes of several Malay sultanates, including Johor-Riau-Lingga-Pahang, Selangor and Kalimantan during periods of political instability. Known for their strategic alliances with local Malay rulers and their military capabilities, the Bugis were important in shaping regional politics and defense strategies. Their settlements in places like Linggi and Siak highlighted their expansion and integration into the socio-political fabric of the Malay Archipelago, making them notable figures in the region's historical development. Their presence in these regions contributed to the historical dynamics and development of the Malay Archipelago. ### Key regions Bugis migrants began to play a significant role in the Riau-Lingga-Johor-Pahang Sultanate and surrounding areas in the late 17th century. During this period, many Bugis people migrated from their homeland in South Sulawesi to the Malay regions along the [Malacca Strait](/wiki/Strait_of_Malacca), [Karimata Strait](/wiki/Karimata_Strait) and the [South China Sea](/wiki/South_China_Sea). Among those who migrated was the Bugis noble family of Opu Tentriborong Daeng Rilaka (Rilekke) with his five sons: [Daeng Parani](/wiki/Daeng_Parani), [Daeng Menambun](/wiki/Daeng_Menambun), [Daeng Marewah](/wiki/Daeng_Marewah), [Daeng Chelak](/wiki/Daeng_Chelak), and [Daeng Kemasi](/wiki/Daeng_Kemasi) (Kemase). They initially arrived in Negeri Siantan (now [Anambas Regency](/wiki/Anambas_Islands_Regency), Riau Islands) in the South China Sea. Prior to this migration, Bugis traders had already established a presence in the Malay regions during the [Malacca Sultanate](/wiki/Malacca_Sultanate) period, being recognized as prominent merchants in the eastern islands. #### Johor-Riau-Lingga-Pahang The Bugis first became prominently involved in the Johor-Riau-Lingga-Pahang Sultanate during a period of political instability following the \"Tragedi Seulas Nangka\" in 1699. This event, marked by the assassination of [Sultan Mahmud Shah II](/wiki/Mahmud_Shah_II_of_Johor), plunged the Sultanate into turmoil. [Raja Kecik](/wiki/Raja_Kecil), claiming descent from Sultan Mahmud, seized power and established himself as Sultan Abdul Jalil Rahmat Shah (1717–1722). Amidst these power struggles, the Bugis leaders, including Daeng Parani and Daeng Marewah, formed strategic alliances with local Malay rulers against Raja Kecik. Their military prowess and strategic acumen were crucial in these alliances, providing the strength needed to challenge Raja Kecik's authority. With the assistance of the Bugis, Sultan [Sulaiman Badrul Alam Shah I](/wiki/Sulaiman_Badrul_Alam_Shah_of_Johor) emerged victorious in 1722, reclaiming Johor-Riau-Lingga-Pahang from Raja Kecik's rule. This victory was not only a testament to the Bugis' military capabilities but also marked the beginning of their significant influence in the region. As a reward for their support, Daeng Marewah was appointed Yang Dipertuan Muda, a position crucial to maintaining stability and unity within the Sultanate. This appointment underscored the pivotal role the Bugis played in the political landscape of the Sultanate, establishing them as key power brokers and protectors of the Sultan's authority. #### Selangor Following their success in Johor-Riau, the Bugis leaders sought to consolidate their influence in Selangor. Their migration aimed to bolster military capabilities and gather resources to confront remaining adversaries, particularly Raja Kecik. During their absence, however, Raja Kecik reasserted control over Riau, prompting a swift Bugis response. The Bugis mobilized a formidable fleet and military force, led by Daeng Chelak, to retake Riau. Their campaign proved successful, restoring Riau under Sultan Sulaiman's authority. This victory solidified the Bugis' reputation as formidable military strategists and essential allies in the region. Post-victory, Daeng Chelak relocated to [Kuala Selangor](/wiki/Kuala_Selangor), where local residents requested him to remain as their ruler. Despite initial intentions to return to [Riau](/wiki/Riau_Islands), Daeng Chelak appointed [Raja Lumu](/wiki/Raja_Lumu) as his successor in Kuala Selangor, laying the groundwork for the Selangor Sultanate's establishment. Raja Lumu's rule marked the formal establishment of the [Selangor Sultanate](/wiki/Sultan_of_Selangor), further expanding Bugis influence in the Malay Peninsula. This strategic move not only secured their power but also ensured the stability and growth of Selangor under Bugis leadership, making it a significant political entity in the region. #### Linggi The Bugis influence extended to [Linggi](/wiki/Linggi), where 600 Bugis warriors under Daeng Marewah agreed to settle. This development worried the Dutch in Melaka due to Linggi's proximity. The Dutch, recognizing the Bugis' growing power, expressed their concerns to the Sultan of Johor on October 6, 1701. Similar apprehensions had arisen during Raja Kecik's rule, leading to attempts to block Bugis movements through Naning to prevent attacks on Rembau. The Bugis presence in the region signaled their strategic intent to expand and solidify their influence, much to the concern of colonial powers. The Bugis presence in Rembau lasted until October 1756, when [Daeng Kemboja](/wiki/Daeng_Kemboja) assembled forces to attack Melaka. They built fortresses in Klebang as bases for their operations, with support from Tengku Raja Said of Selangor. After nine months of conflict, the Bugis retreated to Linggi and Rembau Hilir following their defeat. Eventually, Daeng Kemboja and his forces relocated to Pedas, where they faced local resistance but ultimately secured their position. This persistent effort to establish dominance in Linggi exemplified the Bugis' determination to maintain their influence despite external opposition, further entrenching their presence in the region. #### Kedah The Bugis exerted significant influence in the Kedah Sultanate during the 18th century, marked by their strategic engagements amidst political upheaval and external pressures. Following initial diplomatic overtures and alliances, including marriages that solidified their position within local courts, Bugis leaders such as Daeng Parani and Daeng Marewah played pivotal roles in navigating Kedah's turbulent political landscape. Their military prowess was crucial in supporting [Sultan Abdullah Mukarram Shah](/wiki/Abdullah_Mukarram_Shah_of_Kedah) in defending against Siamese encroachments and internal rivalries, securing the Sultanate's sovereignty during periods of colonial confrontations and dynastic disputes. The Bugis intervention in Kedah was characterized by a series of military campaigns aimed at preserving royal authority and territorial integrity. Their alliances with local Malay rulers against external threats, including Siamese ambitions and rival factions within the Sultanate, underscored their strategic importance in regional politics. Through their adept military strategy and adaptive leadership, the Bugis not only bolstered Kedah's defenses but also contributed to its economic stability through maritime trade and resource management. Their legacy in Kedah highlights the enduring impact of Bugis influence on shaping the Sultanate's political trajectory and fostering alliances crucial for regional stability and growth. #### Sambas, Matan and Mempawah In Borneo, specifically in Sambas, Matan and Mempawah, the Bugis played pivotal roles in supporting local Malay kingdoms. In [Matan](/wiki/Matan_Kingdom), for instance, the intervention of the Five Bugis Brothers during a succession crisis restored Sultan Muhammad Zainuddin to power. This alliance was solidified through strategic marriages, such as that between Puteri Kesumba and Daeng Menambun, who established a new kingdom in [Mempawah](/wiki/Mempawah_Kingdom). These strategic alliances through marriage and political support highlighted the Bugis' ability to integrate and influence local politics, ensuring their presence and authority in Kalimantan. Similarly, in [Sambas](/wiki/Sultanate_of_Sambas), alliances through marriage, like that of Daeng Kemasi with Raden Tengah, strengthened Bugis influence. Daeng Kemasi eventually ascended as Raja Sambas, consolidating Bugis power in the region. Their influence extended beyond mere military support, embedding deeply into the socio-political fabric of these kingdoms. The Bugis' ability to navigate and dominate the complex political landscapes of Kalimantan underscored their strategic acumen and adaptability, making them indispensable allies and powerful rulers in these regions. ### Broader Malay world The Bugis significantly impacted various regions in Southeast Asia, notably influencing the political and economic landscapes of Siak, Perak, Singapore, Melaka, Jambi, Palembang, Bangka-Belitung, Terengganu, Sarawak and Patani. In [Siak](/wiki/Sultanate_of_Siak_Sri_Indrapura), the Bugis presence began with Daeng Tuagik, a prominent leader who played a critical role in establishing and consolidating the Sultanate of Siak Sri Indrapura. His leadership was essential in stabilizing the region amid conflicts, and his descendants, including figures like Datuk Bandar Jamal and Datuk Ibrahim, continued to shape the area's governance, fostering economic growth and political stability. In the 18th century, the Bugis made substantial contributions to [Perak](/wiki/Perak) by combating piracy and integrating into the local ruling elite. Leaders such as Daeng Selili were instrumental in maintaining coastal security and forming strategic alliances through marriage, which facilitated their integration into Perak's socio-political framework. Their military and administrative contributions significantly impacted the state's stability and governance, leaving a lasting influence on its historical development. Following the British establishment of a trading post in [Singapore](/wiki/Singapore) in 1819, the Bugis played a key role in the island's development. A group of 500 Bugis, led by Chieftain Arong Bilawa, settled in Singapore shortly after the British arrival. By 1824, the Bugis population had grown to around 1,851, constituting over 10 percent of the island's inhabitants. Their involvement was crucial in transforming Singapore into a major trading hub within the Malay Archipelago, underscoring their economic and cultural significance. The Bugis also extended their presence to Melaka, Terengganu, Sarawak, Jambi, Palembang, Bangka-Belitung and Patani. Their strategic alliances, military campaigns, and integration into local societies left a notable impact on these regions. Through their roles in governance, defense, and economic activities, the Bugis played a significant part in shaping regional dynamics and maintaining a lasting legacy across Southeast Asia. ## Culture and heritage ### Literature Bugis-Malay traditional literature encompasses significant works that capture the historical, cultural, and social interactions between the Bugis and Malay communities. Two notable examples are [Tuhfat al-Nafis](/wiki/Tuhfat_al-Nafis) and *Silsilah Melayu dan Bugis*. Tuhfat al-Nafis, attributed to Raja Ali Haji, details the history of the Malay-Bugis political structure during the 18th century, focusing on key events, alliances and conflicts within the Johor-Riau-Lingga Sultanate. Completed in the 1860s, this manuscript offers valuable insights into the political dynamics and cultural exchanges between the Bugis and Malay peoples. *Silsilah Melayu dan Bugis*, transcribed by Haji Abdullah bin Khairuddin in 1866, provides a genealogical record of the Bugis nobility and their roles within the Malay sultanates. The manuscript traces the ancestry and influence of Bugis families over generations, documenting significant historical events and social customs. Though often attributed to Raja Ali Haji, research has focused on its transcription and translation, revealing its importance in understanding the integration of Bugis culture and its impact on Malay society. Both manuscripts are crucial for studying the rich history and interactions of these communities in the Malay Archipelago. ### Traditional philosophy The *Sumpah Setia Melayu Bugis* (Malay-Bugis Oath of Allegiance) refers to a historic political pact and oath of loyalty formed between the Malay and the Bugis in the Johor-Riau Malay kingdom during the 18th century. This alliance marked a significant event in the history of the Malay Peninsula and the wider Archipelago, as it represented the first time an external ethnic group was formally integrated into the existing Malay political structure. The Bugis, who were initially outsiders, achieved a prominent status within the kingdom through this agreement. The oath was established following the Bugis' crucial role in aiding Raja Sulaiman of Johor-Riau in regaining his throne and restoring his authority. In recognition of their support, the Bugis were granted considerable political influence, including the creation of the hereditary position of Yang Dipertuan Muda (YDM). This position was unprecedented in traditional Malay governance and allowed the Bugis to take on significant administrative and political responsibilities within the kingdom. The Sumpah Setia Melayu Bugis had profound implications for the governance of Johor-Riau. The Yang Dipertuan Muda, as established by this oath, became a key figure in the administration of the kingdom, working alongside the Sultan to manage political affairs. This arrangement effectively positioned the Bugis as co-rulers and influential decision-makers, thereby reshaping the political landscape of the Johor-Riau Malay kingdom and demonstrating the evolving nature of regional alliances and power structures during this period. The pledge of allegiance included the following words: [Jawi script](/wiki/Jawi_script)[Rumi script](/wiki/Rumi_script)English translation ...جكالاو توان كڤد بوڬيس توانله كڤد ملايو دان جكالاو توان كڤد ملايو توانله كڤد بوڬيس دان جكالاو موسوه كڤد بوڬيس موسوهله كڤد ملايو دان جكالاو موسوه كڤد ملايو موسوهله كڤد بوڬيس مك بارڠسياڤا موڠكير دبينساكن الله سمڤأي انق چوچوڽ...\"‎ *...jikalau tuan kepada Bugis,* *tuanlah kepada Melayu* *dan jikalau tuan kepada Melayu* *tuanlah kepada Bugis* *dan jikalau musuh kepada Bugis* *musuhlah kepada Melayu* *dan jikalau musuh kepada Melayu* *musuhlah kepada Bugis* *maka barangsiapa mungkir* *dibinasakan Allah sampai anak cucunya...* \"... if he was an ally to the Buginese he shall then be an ally to the Malay and if he was an ally to the Malay he shall then be an ally to the Buginese and if he was a nemesis to the Buginese he shall then be a nemesis to the Malay and if he was a nemesis to the Malay he shall then be a nemesis to the Buginese if one ever betrayed calamity by Allah till his descendants...\" ### Traditional attire and textile The traditional attire and textiles of the Bugis-Malay people reflect a blend of cultural influences and historical evolution, showcasing a unique sartorial heritage. For men, the traditional outfit includes the [Baju Melayu](/wiki/Baju_Melayu), a traditional Malay shirt worn with a samping (a type of sarong) around the waist. This is complemented by a jacket and headgear, such as the [Tanjak](/wiki/Tengkolok). Notable styles include the Tanjak *Bugis Tak Balik*, symbolizing the remembrance of their ancestral land in South Sulawesi, and the *Sumange Oge* headgear, linked to the Malay Bugis descendants. The Tanjak Nakhoda Trong, named after a prominent Bugis captain from Pulau Trong in the Riau Islands, represents another significant variation of traditional Bugis headgear. For women, traditional attire typically features the [Baju Bodo](/wiki/Bodo_blouse), distinguished by its Bugis cuts and a belt, paired with a kain selish (a type of sarong). This attire highlights the fusion of Malay and Bugis styles, reflecting the craftsmanship and cultural blending. A prominent textile in Bugis-Malay attire is the *Kain Tenun Pahang*, introduced from Riau or Sulawesi around the 16th century. Renowned for its weaving and intricate patterns, refined by the Bugis leader Tok Tuan or Keraing Aji, *Kain Tenun Pahang* is used for both men's samping and women's sarongs or dresses. It often features gold thread, adding delicate motifs, and is favored for ceremonial attire, including weddings. ### Traditional weapon The Bugis [keris](/wiki/Kris), originating from South Sulawesi and extending to the Malay Peninsula, southern Sumatra and the Riau-Lingga archipelago, is a distinctive dagger known for its unique blade and hilt designs. Primarily forged for self-defense and combat, these krises are recognized for their thicker and heavier blades that provide enhanced strength and durability. They are often decorated with intricate pamor patterns and embellishments, including tuli-tuli and batir, reflecting the owner's social status. Among the various types of Bugis krises are the *Selayar Bugis*, the *Bugis Semenanjung* and the Bugis Terengganu keris. Each type represents a regional variant of this iconic weapon, highlighting the diversity and cultural significance of the Bugis kris across different areas. ### Performing arts The Bugis-Malay performing arts are characterized by a rich variety of traditional dance and music, reflecting their cultural heritage. Traditional dances often serve ceremonial purposes, such as welcoming esteemed guests or celebrating significant events. For instance, the Maduppa Busarak is a traditional welcome dance performed at palatial ceremonies to honor royalty and distinguished guests, showcasing the Bugis tradition of hospitality. Its contemporary adaptation, the Mappa Duppa, reflects the dance's influence in Pontian, Johor, and is performed during similar welcoming occasions. In addition to these ceremonial dances, the Poja Dance and the Tarian Zapin Cemara are notable elements of Bugis performing arts. The Poja Dance, performed during significant events like the opening of the Sultan Alam Shah Museum, is structured into three segments that celebrate and honor guests through specific movements and gestures. Meanwhile, the Tarian Zapin Cemara, believed to have originated from Sabak Bernam, is celebrated for its distinctive style and meaningful connection to local cultural traditions. These performances illustrate the richness of Bugis-Malay artistic expression and its role in preserving cultural heritage through dance and music. ### Traditional architecture Bugis-Malay houses in the Malay Peninsula reflect an adaptation of Bugis architectural traditions from South Sulawesi, Indonesia, illustrating the cultural adaptability of the Bugis people. These traditional homes preserve essential elements of Bugis architecture, such as the [cosmological](/wiki/Cosmology) layering of the house into three distinct zones: the upper layer for valuables, the central living space and the lower section for waste and domestic animals. However, Bugis-Malay houses in the Malay Peninsula have evolved to incorporate local architectural styles and practical considerations, such as the shift from the steeply pitched roofs of South Sulawesi to the 'limas' roof form, which is more suitable for the region's climate. The layout of Bugis-Malay houses in the Malay Peninsula typically features multiple sections or lontang, reflecting the traditional Bugis emphasis on spatial organization. Unlike the open-plan designs found in South Sulawesi, houses in the Malay Peninsula often include partitions, catering to local preferences for privacy and functional separation. Additionally, these houses commonly have a front section, known as ri saliweng, for receiving visitors, and a veranda or lego-lego, which serves as a communal space for relaxation and social interaction. The presence of two separate staircases in Bugis-Malay houses further highlights the integration of traditional Bugis design with local customs. One staircase is used for male guests, while the other provides access for females and connects to the kitchen and back areas. This adaptation aligns with cultural norms and practical needs, demonstrating how the Bugis community in the Malay Peninsula has successfully preserved key aspects of their heritage while blending with local traditions and environmental conditions. ### Naming system In general, Bugis-Malay descendants do not frequently use ancestral names unless they have inherited noble titles from their paternal side. Some Bugis-Malay families continue to use the traditional title \"Daeng,\" which reflects their Bugis heritage. However, others have adopted titles such as \"Raja\" and \"Engku,\" which are more aligned with Malay aristocratic traditions. This variation in title usage reflects the blending of Bugis and Malay cultures and the adaptation of titles that signify noble status within the context of the Johor-Riau Sultanate's social structure. In the Johor-Riau and Selangor Sultanate, the adoption of the title \"Raja\" by Bugis-Malay descendants originated from a unique socio-political adaptation. Raja Haji, born to a Bugis father, Daeng Cella’, and a Malay mother, Tengku Madak, was the first from his lineage to adopt the \"Raja\" title. Traditionally, Bugis nobility used titles like \"Daeng\" or \"Andi.\" This shift to \"Raja\" symbolized the integration and acculturation between Malay and Bugis cultures within the sultanate, aiming to harmonize their social structures and reduce ethnic distinctions. Over time, Bugis descendants in Johor-Riau embraced Malay culture and customs, including the use of \"Raja,\" leading to a unified noble identity that increasingly aligned with Malay heritage while diminishing their distinct Bugis roots. The title \"Engku,\" used by Bugis-Malay descendants in the Johor-Riau Sultanate, has a distinct origin rooted in socio-linguistic adaptation. The title emerged during the reign of Sultan Abdul Jalil, whose wife, Encik Nusamah, was of Acehnese descent. The term \"Tengku,\" derived from the Acehnese \"Teuku,\" was initially used to honor the maternal Acehnese heritage of their son. However, as Bugis settlers integrated into the Johor-Riau society, they found it difficult to pronounce \"Teuku\" correctly, leading to the mispronunciation \"Tengku.\" This adaptation was further complicated by the Malays' occasional use of \"Tengku\" in a satirical manner. To preserve their dignity and assert their noble status, the Bugis nobility began to use the title \"Engku\" as an alternative. This title not only distinguished them from the purely Malay nobility, who used titles like \"Tun\" and \"Tengku,\" but also signified their adaptation and integration into the broader social and cultural fabric of the Johor-Riau Sultanate, blending their Bugis heritage with the prevailing Malay aristocratic traditions. However, it is important to note that not all individuals bearing the titles \"Tengku\" and \"Raja\" are of Bugis-Malay descent, as these titles are also used by other Malay aristocratic families. ### Traditional cuisines The culinary traditions of the Melayu Bugis community represent a blend of cultural influences, showcasing the fusion of indigenous Malay traditions with Bugis elements from Sulawesi and highlighting a unique and distinct heritage. This rich culinary tradition is integral to their cultural and social ceremonies. Traditional foods such as [burasak](/wiki/Burasa), lepat loi, barongko, bejabuk ([serunding](/wiki/Serundeng)), and nasu mettih ([asam pedas](/wiki/Asam_pedas) ikan parang) are often served at significant events like weddings and the [Hari Raya](/wiki/Eid_al-Fitr) festival. These dishes represent the community's heritage and are frequently shared with those outside the community. Among the primary dishes, burasak and lepat loi are notable rice cakes, each distinctively wrapped in [banana](/wiki/Banana) or coconut [leaves](/wiki/Leaf). Nasu mettih, a type of asam pedas ikan parang, is recognized for its slightly dry, sour and spicy gravy. Side dishes such as [rendang](/wiki/Rendang) daging, daging masak kicap and ayam masak merah complement these main dishes, providing an array of flavors. Bejabuk (serunding), a dish made from shredded meat or coconut, is another popular accompaniment. The Bugis culinary tradition also includes a variety of sweet delicacies known as beppa-beppa ugi, typically served at weddings and other cultural celebrations. Sweets like bahulu fecak, barongko, didorok kaluku, karima, tarumbah and kek lapis are appreciated for their flavors and ingredients. These traditional foods continue to be celebrated and preserved by the Bugis community, ensuring that these culinary practices are passed down through generations. ## Bibliography\n",
  "language": "en",
  "processed_at": "2026-01-12T09:58:26.632200",
  "title": "Bugis-Malay",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Bugis-Malay"
}