{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:58:30.202970"
  },
  "content": "Subzone of Downtown Core Planning Area in Central Region, Singapore **Bugis Street**, sometimes referred to as **Boogie Street**, is a street in the area of **Bugis** ([IPA](/wiki/International_Phonetic_Alphabet): /ˈbʊɡɪs/; **Kampong Bugis** in [Malay](/wiki/Malay_language)), but now located within the [Bugis Junction](/wiki/Bugis_Junction) shopping mall. Bugis Street was renowned internationally from the 1950s to the 1980s for its nightly gathering of [transvestites](/wiki/Transvestites) and [transsexuals](/wiki/Transsexuals), a phenomenon that made it one of Singapore's most notable attractions for foreign visitors at the time. In the mid-1980s, Bugis Street underwent major urban redevelopment into a retail complex of modern shopping malls, restaurants, and nightspots mixed with regulated back-alley roadside vendors. Underground digging to construct the [Bugis MRT station](/wiki/Bugis_MRT_station) also caused the upheaval and termination of the nightly transgender gathering culture. Today, the original Bugis Street is now a cobblestoned, relatively wide avenue sandwiched between the buildings of the [Bugis Junction](/wiki/Bugis_Junction) shopping complex. Another lane presently touted as \"Bugis Street\" by the [Singapore Tourist Promotion Board](/wiki/Singapore_Tourist_Promotion_Board) is actually developed from New Bugis Street, formerly Albert Street, and is billed as \"the largest street-shopping location in Singapore\". ## History Bugis Street lies in an extensive area which was commonly referred to *Xiao Po* (小坡; 'little slope') by the Chinese-speaking community in the past. It stretched from [Tanjong Pagar](/wiki/Tanjong_Pagar), through Singapore's [Chinatown](/wiki/Chinatown), to Jalan Sultan. It was crammed with merchants and traders, making it one of the most vibrant economic zones of old Singapore.[*citation needed*] ### Pre-1950s Before the arrival of the [British](/wiki/Singapore_in_the_Straits_Settlements), there used to be a large canal which ran through the area where the [Bugis](/wiki/Bugis), a seafaring people from [South Sulawesi](/wiki/South_Sulawesi) province in [Indonesia](/wiki/Indonesia), would sail up, moor their boats, and trade. It was these people after whom the thoroughfare was named. The Bugis put their sailing skills to less benign uses and gained a reputation in the region as pirates. Many of them migrated to the present area from [Tanjungpinang](/wiki/Tanjungpinang) in January 1820 fleeing a battle between 400 Buginese and Dutch artillery soldiers in retaliation for the death of a chieftain murdered in a violent scuffle that ensued due to the Dutch captain apprehending several Bugis men [opening shots](/wiki/Celebratory_gunfire) celebrating a wedding of said chieftain's cousin. During the early colonial era, there used to be low mounds of whitish sand in the area, earning the street the familiar Hokkien ([Min Nan](/wiki/Min_Nan)) moniker of *Peh Soa Pu* or *Bai Sha Fu* in [Mandarin](/wiki/Mandarin_Chinese) (白沙浮; 'white sand mounds'). The [Cantonese](/wiki/Cantonese_people), however, referred to the street as *Hak Gaai* or *Hei Jie* in Mandarin (黑街; 'black street') as there were many clubs catering to the [Japanese](/wiki/Japanese_Singaporeans) in the 1940s. During the first half of the 20th century, commuters could travel from Bugis Street to anywhere else in *Xiao Po* via a tram service which ran along [North Bridge Road](/wiki/North_Bridge_Road), which was referred to by the Chinese-educated as *Xiao Po Da Ma Lu* (小坡大马路; 'little slope main road').[*citation needed*] Prior to the [second world war](/wiki/Second_world_war), Bugis had a high proportion of Japanese prostitutes, [Karayuki](/wiki/Karayuki-san)-san, highly concentrated within the area of Bugis Street, Malabar Street, and Hylam Street. Overcrowding and hygiene issues became a problem due to the lack of space in the early-style, two storey, shophouses. With many people using the same latrines and drinking water sources, diseases started to spread. A [cholera](/wiki/Cholera) outbreak occurred in 1896 in Bugis, Malabar, and Hylam Streets, leading to them being zoned off. The bad hygiene and poor ventilation due to overcrowding of the sites led to the [Singapore Improvement Trust](/wiki/Singapore_Improvement_Trust)'s attempt to demolish those buildings and rebuild the properties. This led to the infamous \"Bugis Street Case\" which over the course of multiple courts decisions, decided that it was not legal to commandeer a building and only pay the price of the land, which had been going on previously and the decision was made by 1937, that new houses should be built to alleviate overcrowding and problems that are associated instead of tearing it down and rebuilding, expecting change to occur. This established a new form of slum clearance in Singapore that was more closely tied to the rights of the citizen and the owner. ### 1950s–1980s After World War II, [hawkers](/wiki/Hawkers_(trade)) started gathering around the place to sell food and goods. There was initially also a small number of outdoor bars set up beside rat-infested drains.[*citation needed*] When [transvestites](/wiki/Transvestites) began to rendezvous in the area in the 1950s, they attracted increasing numbers of Western tourists. Due to this sudden boom in business, Bugis Street became a lively and bustling area, forming the heart of *Xiao Po*. It was one of Singapore's most famous tourist areas from the 1950s to the 1980s, renowned internationally, especially for the transvestites. The revenue uptick was considerable, providing a booster shot in the arm for the city's tourism industry. The street was popularly called *Boogie Street* by British and American servicemen. Veterans recall that the notorious drinking section began from [Victoria Street](/wiki/Victoria_Street,_Singapore) to [Queen Street](/wiki/Queen_Street,_Singapore). Halfway between Victoria and Queen Streets, there was an intersecting lane parallel to the main roads, also lined with *al fresco* bars. There was a public toilet with a flat roof with archival photos available, where jubilant rooftop transvestites would perform. Sojourning sailors would perform the ritualistic \"*dance of the flaming arseholes*\" on top of the toilet's roof. Compatriots on the ground would chant the signature \"*Haul 'em down you Zulu warrior*\" song whilst the sailors performed their act. While many were concerned about the public image and embarrassment that went along with it, the global concern of [HIV/AIDS](/wiki/HIV/AIDS) became more prevalent, with a growing suspicion of the activities that took place. Bugis Street was demolished as a way of not only controlling the population to become more orderly and normative, but also to prevent an HIV [epidemic](/wiki/Epidemic). There was also a fear that through [homosexuality](/wiki/Homosexuality_in_Singapore), the society and culture's perception would limit the island's growth, especially post independence. Allowing a site like Bugis Street would go against the idea of Singapore's nuclear family. This prompted the Singaporean authorities to see it as dissenting. By using an HIV scare and the economic benefits of inserting an MRT station and eventually a mall, the amount of resistance from most Singaporeans was expected to be minimal. In the mid-1980s, Bugis Street underwent major urban redevelopment into a retail complex of modern shopping malls, restaurants, and nightspots mixed with regulated back-alley roadside vendors. Underground digging to construct the [Bugis MRT station](/wiki/Bugis_MRT_station) prior also caused the upheaval and termination of the nightly transgender sex bazaar culture, marking the end of a colourful and unique era in Singapore's history.[*citation needed*] Tourist and local lamentation of the loss sparked attempts by the [Singapore Tourist Promotion Board](/wiki/Singapore_Tourist_Promotion_Board) (STPB) to stage some \"Ah Qua shows\" on wooden platforms, but these failed to pull in the crowds and were abandoned after a short time.[*citation needed*] ## In popular media One of the first films to feature Bugis Street was *[Pretty Polly](/wiki/Pretty_Polly_(film))* by [Guy Green](/wiki/Guy_Green_(filmmaker)) based on a short story by [Noël Coward](/wiki/No%C3%ABl_Coward). In 1979, American director [Peter Bogdanovich](/wiki/Peter_Bogdanovich) directed a [film adaption](/wiki/Saint_Jack_(film)) of the 1973 novel *[Saint Jack](/wiki/Saint_Jack)* in Singapore, with the same title. The film featured the now demolished [Empress Place](/wiki/Empress_Place_Building) hawker centre and Bugis Street. The film was later banned in Singapore due to the LGBT-related content but the ban was subsequently lifted in 2006, and the film received the [M18](/wiki/Infocomm_Media_Development_Authority#Films_and_TV) rating. In 1995, Chinese director [Yonfan](/wiki/Yonfan) directed a film, [*Bugis Street*](/wiki/Bugis_Street_(film)), about the lives of [Singaporean](/wiki/Singapore) [transvestites](/wiki/Transvestite) prior to the redevelopment of Bugis Street into a modern shopping district and the eradication of transvestite activities in the area. It was a Hong Kong-Singaporean co-production and featured [Michael Lam](/wiki/Michael_Lam) and [Hiep Thi Le](/wiki/Hiep_Thi_Le). It was a minor hit at the box office with a sexually-explicit [Restricted (Artistic)](/wiki/Infocomm_Media_Development_Authority#Films_and_TV) rating. In 2015, the restored version of the film was presented at the 26th [Singapore International Film Festival](/wiki/Singapore_International_Film_Festival) as *Bugis Street Redux*. The street is also known as Boogie Street in the Western popular culture. [Leonard Cohen](/wiki/Leonard_Cohen) wrote a song titled \"Boogie Street\" as a metaphor for a \"street of work and desire\" for his album *[Ten New Songs](/wiki/Ten_New_Songs)*. ## Transportation [Queen Street Bus Terminal](/wiki/Queen_Street_Bus_Terminal), also known as Ban San Bus Terminal, is a [bus terminal](/wiki/Bus_terminus) in [Singapore](/wiki/Singapore). It serves as the terminal for cross-border bus and taxi services to [Johor Bahru](/wiki/Johor_Bahru), [Malaysia](/wiki/Malaysia). - [List of transgender-related topics](/wiki/List_of_transgender-related_topics) - [Bugis Junction](/wiki/Bugis_Junction) - [Singapore transvestism and transsexualism](/wiki/Singapore_transvestism_and_transsexualism) - [Yawning Bread](/wiki/Yawning_Bread)'s account of Singapore's [transgender](/wiki/Transgender) and sex-change history: - \"Singapore News\". *Stonking*. Retrieved 10 April 2018. - Ommaney, F.D, *Eastern Windows*, 1960. London:Longmans. pp. 39–45\n",
  "language": "en",
  "processed_at": "2026-01-12T09:58:30.202493",
  "title": "Bugis Street",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Bugis_Street"
}