{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:58:28.270578"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Bugis Junction\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(December 2020)* *(Learn how and when to remove this message)*Shopping mall in Bugis, Singapore **Bugis Junction**, formerly known as **Parco Bugis Junction** is an integrated development located at [Victoria Street](/wiki/Victoria_Street,_Singapore), [Middle Road](/wiki/Middle_Road,_Singapore) and [North Bridge Road](/wiki/North_Bridge_Road) in [Bugis](/wiki/Bugis_Street), [Downtown Core](/wiki/Downtown_Core) in Singapore. The development consists of a [shopping mall](/wiki/Shopping_mall), an office tower and the [InterContinental Singapore](/wiki/InterContinental) Hotel. ## History Developed by Parco Holdings, **Parco Bugis Junction** was completed in July 1995 as a mixed development comprising a retail mall, an office tower and the InterContinental Singapore Hotel. The development incorporated three streets, Bugis Street, Malay Street and Hylam Street, where it was built upon and also rebuilt the old shophouses used to be on the three streets. These three streets were glass covered and fully airconditioned. Parco Bugis Junction was officially opened on 8 September 1995. Parco Bugis Junction's anchor tenant was [Seiyu](/wiki/Seiyu_Group)'s first department store in Singapore. The shopping mall initially comprised a cineplex by [United Artists](/wiki/Regal_Cinemas), a food court, and 112 specialty shops. The cinema was taken over by [Shaw Theatres](/wiki/Shaw_Organisation) in late 2001, after Shaw bought out United Artists' operations in Singapore. In 2005, Parco Holdings sold Parco Bugis Junction to CapitaLand and the shopping mall underwent major revamps and changed its tenant mix. In 2012, the mall was linked to [Bugis+](/wiki/Bugis%2B), a newer shopping mall located across Victoria Street via an overhead bridge when Iluma came under CapitaLand ownership. The mall itself underwent refurbishment works, such as converting the cinema into a gym and restaurants, and the video games arcade being replaced by a one-stop electronics and IT hub in 2016. - Official website This article about a Singapore building or structure is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T09:58:28.270143",
  "title": "Bugis Junction",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Bugis_Junction"
}