{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:58:33.230189"
  },
  "content": "Real estate development scheme**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **contains promotional content**. Please help improve it by removing promotional language and inappropriate external links, and by adding encyclopedic text written from a neutral point of view. *(April 2024)* *(Learn how and when to remove this message)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Build-to-Order\" Singapore – news **·** newspapers **·** books **·** scholar **·** JSTOR *(April 2024)* *(Learn how and when to remove this message)*This article **may need to be rewritten** to comply with Wikipedia's quality standards. Relevant discussion may be found on the talk page. You can help. The talk page may contain suggestions. *(April 2024)* *(Learn how and when to remove this message)* **Build to order** (**BTO**) is a [real estate development](/wiki/Real_estate_development) scheme enacted by the [Housing and Development Board](/wiki/Housing_and_Development_Board) (HDB), a statutory board responsible for [Singapore](/wiki/Singapore)'s public housing. First introduced in 2001, it was a flat allocation system that offered flexibility in timing and location for owners buying new public housing in the country. Under the scheme, Singaporeans select and apply for an apartment in their preferred location(s) from a list of launch sites. Originally, a tender for construction would be called only if the number of applicants is at least 70% of the number of apartments in a specific contract (50% since 2011), otherwise, the project would not be built. The scheme subsequently evolved, and the HDB now builds flats in advance of demand. ## History BTO replaced the predecessor Registration for Flats System (RFS) scheme, whereby the waiting time for new flat applicants was relatively shorter because flats were built ahead of demand. In comparison, the new BTO system requires a waiting period of about 3–4 years instead as such a system removes the need for the government to make projections ahead of demand. All BTO projects are designed by [Surbana Corporation](/wiki/Surbana_Corporation_Pte_Ltd), an infrastructure and urban development conglomerate owned by [Temasek Holdings](/wiki/Temasek_Holdings). To allow private sector a share of the public housing pie, HDB launched the [Design, Build and Sell Scheme](/wiki/Design,_Build_and_Sell_Scheme) (DBSS). The first pilot DBSS project at [Tampines](/wiki/Tampines) was built by private developer, Sim Lian Group, before subsequently being maintained by the HDB after construction. In 2011, then National Development Minister [Khaw Boon Wan](/wiki/Khaw_Boon_Wan) eventually ended the DBSS scheme indefinitely and all BTO projects are now strictly within the public sector. ### Sale of balance HDB has introduced a scheme under which eligible flat buyers in urgent need of accommodation, can ballot for leftover units that are reintroduced into the market, known as Sales of Balance flats (SBF). In February 2019, it was announced that starting from the middle of 2019, flat buyers will be able to apply for unsold BTO flats online anytime on a first-come, first-served basis, and book a flat by the next working day. This was intended to help citizens with an urgent need for housing. ### Evolution of the scheme In recent years, the HDB has been commencing construction for housing projects in advance of public demand. In October 2024, HDB chief executive Tan Meng Dui explained that construction work for project sites may begin months, and in some cases more than a year, before the actual launch of the project. In December 2024, it was announced that HDB had commenced structural works on various projects in Clementi, Toa Payoh, and Bukit Merah, before the projects had been launched for sale. ## Unique features - ASSURE 3 – New Extended [Warranty](/wiki/Warranty) Scheme Covering [Ceiling](/wiki/Ceiling) Leakage (5yrs), External Water [Seepage](/wiki/Seepage) (5yrs) and Spalling [Concrete](/wiki/Concrete) (10yrs) for New HDB Flats such as Tivela launched from March 2005. Defect Liability Period (DLP) – Previous HDB projects are offers a standard one-year to all purchasers of its new flats. During this period, any building defects are repaired at no cost to the lessees. - Premium apartment for 4, 4A and 5 rooms/loft unit – Internal square metres (90–96 m2, 101–103 m2 and 110–114 m2 / 111–120 m2) - Solid timber doors for all bedrooms - Semi-solid timber doors for bathrooms - Polished homogeneous/porcelain tiles & timber-strip for Living/Dining & Bedrooms - Standard apartment for 2, 3, 4 and 5 rooms - Internal square metres (40–55 m2, 65 m2, 90–94 m2 and 110–120 m2) - Semi-solid timber doors for all rooms (OCS) - Glazed ceramic tiles for Living/Dining & Bedrooms (OCS) - Optional Component Scheme (OCS) – More flexibility and choices to have floor finishes and internal timber doors installed. The opt-in basic cost are usually about 20~30% cheaper due to bulk purchases and less labour charges. But those who want variety of timber or bi-fold doors design, and better homogeneous/porcelain tiles or tiles/timber skirting can opt out of the schemes. - Universal Design (UD) – These include ramps at main entrance, levelled floors throughout the flat, wider internal corridors, bedroom and toilet doors, wheelchair-accessible common toilet, space provision for future installation of grab bars in all toilets, as well as easily accessible switch sockets, TV outlets and telephone outlets. New HDB Flats such as Fernvale Vista launched from July 2006. - Ferrolite Wall – HDB new patented wall using a material called [ferrocement](/wiki/Ferrocement), which is similar to concrete but uses less sand as it contains a steel wire mesh. A ferrolite wall uses 20 per cent less sand than a concrete one. It is less susceptible to cracking and heat from the sun and has better sound-insulation capabilities. It is a piloted project launched from 2006 for selective Fernvale Court, Treelodge and Kim Tian Green. ## BTO projects The demand for BTO flats was low in the first years, resulting in the cancellation of 5 projects as they did not meet the requirement of minimum 70% application ratio. However, once the demand recovered, HDB has launched between 20 and 40 BTO projects annually since 2010, which consists of 15,000–28,000 units. By the end of 2015, HDB had launched 251 BTO projects, comprising 168,453 units. Construction costs for 5-room, 4-room, 3-room & 2-room units respectively averaged about $160,000, $120,000, $80,000 & $40,000 (based on 2004 cost). This also include the cost of sub-contractors and construction of [multistorey car parks](/wiki/Multistorey_car_park), [lifts](/wiki/Elevator), electrical [substations](/wiki/Electrical_substation) (ESS), child-care centres, playgrounds, fitness corners, linkway shelters and general landscaping. - Buying Process (New Flats)\n",
  "language": "en",
  "processed_at": "2026-01-12T09:58:33.229640",
  "title": "Build-to-Order (Singapore)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Build-to-Order_(Singapore)"
}