{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:58:59.158076"
  },
  "content": "Planning area and residential town in West Region, SingaporeThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Bukit Panjang\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(June 2013)* *(Learn how and when to remove this message)*Planning Area and HDB Town in West Region, Singapore **Bukit Panjang** (/ˈbʊkɪt ˌpɑːndʒɑːŋ/ *BUUK-it PAHN-jahng*) is a [planning area](/wiki/Planning_Areas_of_Singapore) and [residential town](/wiki/New_towns_of_Singapore) located in the [West Region](/wiki/West_Region,_Singapore) of [Singapore](/wiki/Singapore). A portion of this town is situated on a low-lying elongated hill. The planning area is bounded by [Bukit Batok](/wiki/Bukit_Batok) to the west, [Choa Chu Kang](/wiki/Choa_Chu_Kang) to the northwest, [Sungei Kadut](/wiki/Sungei_Kadut) to the north, the [Central Water Catchment](/wiki/Central_Catchment_Nature_Reserve) to the east, and [Bukit Timah](/wiki/Bukit_Timah) to the south. Bukit Panjang New Town is located at the northern portion of the planning area. Bukit Panjang has an average elevation of 36m/118 ft. The town is categorised into seven subzones, namely Jelebu, Bangkit, Fajar, Saujana, Senja, Dairy Farm, and Nature Reserve. ## Etymology Bukit Panjang means \"long hill\" in [Malay](/wiki/Malay_language). It gets its name from the low hills which end south to [Bukit Timah](/wiki/Bukit_Timah). The roads in the town are named after the old 1960s kampung tracks (Lorong Petir, Lorong Pending, Jalan Fajar, Jalan Senja) which used to ply the area. ## History Bukit Panjang is a suburban town in western Singapore. Before redevelopment, Kampong Bukit Panjang used to exist in the area. Initially, instead of using the original place name, Bukit Panjang, there were plans to open up the new town using the name, Zhenghua, derived from Jalan Cheng Hwa that used to ply the area*.* However, Bukit Panjang was quickly reinstated following complaints. Development of the town and advanced earthworks begun on 15 June 1981. [Housing and Development Board](/wiki/Housing_and_Development_Board) (HDB) flats rose up by 20 May 1985, but only Blocks 1xx and 2xx were built so far. Neighbourhood 4 was up and running by 1989, and followed by Neighbourhood 5 and 6 which was the recent ones since 1995. In 1981, [S$](/wiki/Singapore_dollar)96 million was spent on widening canals to help prevent flooding in low-lying areas such as Bukit Panjang. ## Demographics ### Population history Resident Population 2000-2024YearPop.±%200096,560—2001107,150+11.0%2002112,190+4.7%2003114,230+1.8%2004117,700+3.0%2005119,720+1.7%2006120,910+1.0%2007122,590+1.4%2008124,660+1.7%2009127,500+2.3%2010128,730+1.0%2011129,400+0.5%2012130,960+1.2%2013131,490+0.4%2014133,020+1.2%2015139,030+4.5%2016141,380+1.7%2017141,930+0.4%2018140,820−0.8%2019139,280−1.1%2020138,270−0.7%2021134,720−2.6%2022137,020+1.7%2023138,940+1.4%2024138,050−0.6%2025136,360−1.2%Source: ### Age profile The data below is from the population report published by the Singapore Department of Statistics as of June 2025. Age group (years)MalesFemalesTotal population% of total population0–42,6602,4005,0603.715–93,0803,0006,0804.4610–143,5303,3906,9205.0715–193,6003,5307,1305.2320–244,0603,9608,0205.8825–294,6804,5409,2206.7630–345,1305,14010,2707.5335–394,8205,25010,0707.3840–444,5604,9709,5306.9945–494,2204,7608,9806.5950–544,7605,25010,0107.3455–594,7305,0609,7907.1860–645,1805,56010,7407.8865–694,9004,7709,6707.0970–743,4003,4006,8004.9975–792,0802,2104,2903.1580–848701,1502,0201.4885–894607001,1600.8590+2004306300.46Age group (years)MalesFemalesTotal population% of total population0–149,2708,79018,06013.2415–6445,74048,02093,76069.5865+11,91012,66024,57018.02 The population distribution of Bukit Panjang in 2025 demonstrates an ageing population structure. There is a higher population concentration among middle-aged and older groups, with males and females both peaking at the 60-64 age range at 3.80% and 4.08% respectively. This is closely followed by the 30-34 age range, with 3.76% being males and 3.77% being females. ### Household As of 2025, there were 112,590 people living in [HDB](/wiki/Housing_and_Development_Board) flats, representing 82.6% of the population. This is higher than the national proportion of HDB dwellers (75.8%), reflecting a greater prevalence of public housing in the area. Among the population, 52,680 residents, or 38.6% of the population, live in 4-Room HDB Flats, making it the most common type of dwelling. 20,050 residents (14.7%) live in condominiums and other apartments, while 3,150 residents (2.3%) reside in landed properties. As of 2020, the average household size in Bukit Panjang is 3.40. Among the 43,580 households in Bukit Panjang, the most common household size is four persons, representing 23.3% of total households. Bukit Panjang has a [home ownership](/wiki/Owner-occupancy) rate of 92.8% as of 2020. This is higher than the national home ownership rate of 87.9%, making Bukit Panjang the fourth-highest in home ownership rate among all planning areas in Singapore. This reflects a greater prevalence of homeowners in Bukit Panjang. ### Ethnicity Ethnic groups in Bukit Panjang (2000−2020) Year[Chinese](/wiki/Chinese_Singaporeans)[Malays](/wiki/Malay_Singaporeans)[Indians](/wiki/Indian_Singaporeans)Others[Pop.](/wiki/Population)PercentagePop.PercentagePop.PercentagePop.Percentage**2000**74,26676.91%15,79816.36%5,7355.94%7600.79%**2010**96,07974.63%20,59816%9,1617.12%2,8962.25%**2015**103,28074.29%22,23015.99%10,3007.41%3,2102.31%**2020**102,80074.35%21,69015.69%10,3407.48%3,4502.5% Consistent with the rest of Singapore, Bukit Panjang has an ethnically diverse population, with a majority Chinese population, constituting 74.35% of the population as of 2020, identical to the national proportion of 74.35%. In contrast, there is a higher proportion of Malays (15.69%) compared to the national proportion of 13.49%. ### Religion Consistent with the rest of Singapore, the largest religion in Bukit Panjang is [Buddhism](/wiki/Buddhism_in_Singapore), with 37,693 practising residents (31.38% of the population). The second most common group consists of residents with [no religion](/wiki/Irreligion_in_Singapore) (22,937 residents, 19.10%). [Islam](/wiki/Islam_in_Singapore) is also prominent in Bukit Panjang, with 20,325 Muslims (16.92%). [Christianity](/wiki/Christianity_in_Singapore) is practised by 19,792 residents (16.48%), with 7,077 Catholics (5.89%). Other religious affiliations include [Taoism](/wiki/Taoism_in_Singapore) and [other Chinese religions](/wiki/Chinese_folk_religion) (13,519 residents, 11.26%), [Hinduism](/wiki/Hinduism_in_Singapore) (5,239 residents, 4.36%), and [Sikhism](/wiki/Sikhism_in_Singapore) (365 residents, 0.30%). Compared to the national average of 8.79%, there is a significantly higher proportion of practising Taoists in Bukit Panjang. ### Education As of 2020, 97.1% of the population aged above 15 is literate, identical with the national literacy rate. 67.2% of residents are literate in two languages, with the most common language pair being English and Chinese (47.5%). 5.7% of Bukit Panjang residents are literate in three or more languages. 30,829 residents (28.8% of the population) in Bukit Panjang have attained a university qualification, lower than the national average of 32.1%. In contrast, 11,486 residents, or 10.7% of the population, have no educational qualifications. ### Language Languages most frequently spoken at home, Bukit Panjang (2020 census)Languagespercent[English](/wiki/Singapore_English)45.9%[Mandarin Chinese](/wiki/Mandarin_Chinese)32.8%[Malay](/wiki/Malay_Language)10.3%[Chinese dialects](/wiki/Chinese_dialects)7.8%[Tamil](/wiki/Tamil_Language)2.2%[Other Indian languages](/wiki/Languages_of_India)0.46%Others0.59% In Bukit Panjang, the proportion of residents using [English](/wiki/English_language) as the most frequently spoken language (45.9%) is lower than the national average of 48.3%. Additionally, there are 2,781 [Tamil](/wiki/Tamil_Language) speakers, representing 82.4% of the 3,373 [Indian language](/wiki/Languages_of_India) speakers in Bukit Panjang. ### Employment and income According to the 2020 Census of Population, 77,492 of residents aged 15 years and over in Bukit Panjang are employed, out of the 81,951 in the [labour force](/wiki/Workforce). This equates to an employment rate of 94.6%, slightly higher than the [national employment rate](/wiki/Employment_in_Singapore) of 94.2%. The remaining 38,161 residents aged above 15 (31.8%) in Bukit Panjang are outside the labour force. Among the employed residents in Bukit Panjang aged 15 years and over, most earn a gross monthly income of between S$3,000 and S$3,999, with 13.6% being in that category. This is closely followed by those earning between S$1,000 and S$1,999, constituting 13.4% of the population. 7.1% earn less than S$1,000 per month, while 5.6% earn above S$15,000 per month. According to the 2020 Census of Population, most resident households in Bukit Panjang earn a monthly household income of S$20,000 and over, constituting 12.3% of all households. The second highest category for monthly household income is households with no employed person, encompassing 10.1% of all households. ## Housing, amenities, and attractions The town consists of a mixture of old and new blocks of flats, condominiums and private housing. To date, there are three [community centres](/wiki/Community_center), namely Bukit Panjang Community Club, Zhenghua Community Club, and Senja-Cashew Community Club, which serve the entertainment, recreational, and educational needs of residents. Bukit Panjang Plaza is one of the well-known malls in Bukit Panjang. It is located in the heart of Bukit Panjang town and is near [Bukit Panjang LRT station](/wiki/Bukit_Panjang_LRT_station), [Bukit Panjang MRT station](/wiki/Bukit_Panjang_MRT_station), and [Bukit Panjang Bus Interchange](/wiki/Bukit_Panjang_Bus_Interchange). Located on Jelebu Road, the mall has been expanded twice throughout its existence to include more shops in the building. The mall is owned by CapitaRetail which is another retail-based [REIT](/wiki/REIT) by [CapitaLand](/wiki/CapitaLand). The mall houses the [Bukit Panjang Public Library](/wiki/Bukit_Panjang_Public_Library) as well as a [NTUC FairPrice](/wiki/NTUC_FairPrice) Finest supermarket. [Hillion Mall](/wiki/Hillion_Mall) is another well-known mall in Bukit Panjang, located along Petir Road. It is one of the more recent commercial facilities, which completed construction and was opened to the public on 24 February 2017. It is part of the Bukit Panjang Integrated Transport Hub, which shares the building with the [Bukit Panjang Bus Interchange](/wiki/Bukit_Panjang_Bus_Interchange), and directly links to the [Bukit Panjang MRT/LRT station](/wiki/Bukit_Panjang_MRT/LRT_station) through an underpass and above-ground link way respectively. There are other smaller commercial buildings equipped with food courts, supermarkets, and other basic shops to meet the basic necessities of the residents. They are commonly located within [HDB](/wiki/Housing_and_Development_Board) estates or small standalone buildings. Some of the more iconic buildings include [Junction 10](/wiki/Junction_10) located along Woodlands Road, Fajar Shopping Centre located along Fajar Road, Greenridge Shopping Centre located along Jelapang Road, and the Bukit Panjang Neighbourhood Centre located along Bangkit Road. Within the neighbourhood consists of two [hawker centres](/wiki/Hawker_centre); the Bukit Panjang Hawker Centre and Market and the Senja Hawker Centre. The former opened in 2015 while the latter opened in 2022. A healthcare facility located along Senja Road was opened on 2 October 2021 to house the Bukit Panjang Polyclinic and the Senja Care Home. The town has two major parks, namely Bukit Panjang Neighbourhood 5 Park and [Zhenghua Park](/wiki/Zhenghua_Park). Bukit Panjang Neighbourhood 5 Park is located adjacent to the Senja-Cashew Community Club and wraps around [Pang Sua Pond](/wiki/Pang_Sua_Pond), a man-made floating wetland. [Zhenghua Park](/wiki/Zhenghua_Park), located in the eastern part of Bukit Panjang, consists of a fitness area, [gazebos](/wiki/Gazebo), [playgrounds](/wiki/Playground), and a 2.5-kilometre [cycling](/wiki/Cycling) and [jogging](/wiki/Jogging) track that runs parallel to the [Bukit Timah Expressway](/wiki/Bukit_Timah_Expressway). ## Education Bukit Panjang has both primary and secondary schools within the neighbourhood, as well as other private institutions. ### Primary schools - Beacon Primary School - Bukit Panjang Primary School - CHIJ Our Lady Queen of Peace - Greenridge Primary School - West Spring Primary School - West View Primary School - Zhenghua Primary School ### Secondary schools - [Assumption English School](/wiki/Assumption_English_School) - Assumption Pathway School - [Greenridge Secondary School](/wiki/Greenridge_Secondary_School) - West Spring Secondary School - [Zhenghua Secondary School](/wiki/Zhenghua_Secondary_School) ### Private institutions - [German European School Singapore](/wiki/German_European_School_Singapore) - St Francis Methodist School - Trinity Theological College - St Francis Xavier Major Seminary ## Transportation ### Rail Bukit Panjang is served by the following MRT Stations on the [Downtown MRT line](/wiki/Downtown_Line) which opened on 27 December 2015 and provide residents with direct train access to the [Downtown Core](/wiki/Downtown_Core): - **DT1** – **BP6** [Bukit Panjang](/wiki/Bukit_Panjang_MRT_Station) - **DT2** [Cashew](/wiki/Cashew_MRT_station) It is also served by the following LRT Stations which connect it to nearby [Choa Chu Kang](/wiki/Choa_Chu_Kang) for commuters to access the [North–South MRT line](/wiki/North%E2%80%93South_Line_(Singapore)): - **BP7** [Petir](/wiki/Petir_LRT_station) - **BP8** [Pending](/wiki/Pending_LRT_station) - **BP9** [Bangkit](/wiki/Bangkit_LRT_station) - **BP10** [Fajar](/wiki/Fajar_LRT_station) - **BP11** [Segar](/wiki/Segar_LRT_station) - **BP12** [Jelapang](/wiki/Jelapang_LRT_station) - **BP13** [Senja](/wiki/Senja_LRT_station) The driverless and fully automated [Bukit Panjang LRT line](/wiki/Bukit_Panjang_LRT_line) was completed on 11 June 1999 at a cost of [S$](/wiki/Singapore_dollar)285 million. The rail line was intended to serve the growing town and act as a replacement to the many buses employed through the town, especially during rush hours. Originally opening with 14 stations, [Ten Mile Junction station](/wiki/Ten_Mile_Junction_LRT_station) permanently closed in 2019 after sighting low ridership, bringing the number to 13. Several petitions were presented by the residents of Bukit Panjang protesting the decision by [SMRT](/wiki/SMRT_Corporation) to replace the buses in Bukit Panjang with the LRT system. Some of the complaints were related to the fact that people preferred the previous bus system that covered most parts of the Bukit Panjang neighbourhoods such as bus service 190 and 972. The previous bus system was viewed as more efficient because it had many bus stops within walking distance; the LRT system has only 13 stations that are spaced hundreds of meters apart. The LRT system is expected to go through a major upgrading programme that is due to be completed by 2026. The programme will bring about a new signalling system, better condition monitoring, new power rails system and 19 new light rail vehicles. ### Bus The public bus system is predominantly run by [SMRT Buses](/wiki/SMRT_Buses). Of the SMRT buses based in Bukit Panjang, some are smaller feeder bus services that serve the various areas of the neighbourhood, while the rest are long-distance trunk services that serve as a [mode of transport](/wiki/Mode_of_transport) to other towns and to the city centre. Bus services start and end at [Bukit Panjang Bus Interchange](/wiki/Bukit_Panjang_Bus_Interchange). ### Road Bukit Panjang is bounded by two of Singapore's expressways — the [Bukit Timah Expressway](/wiki/Bukit_Timah_Expressway) (BKE) and [Kranji Expressway](/wiki/Kranji_Expressway) (KJE). The BKE is accessible via Bukit Panjang Road and Dairy Farm Road, while the KJE is accessible via Woodlands Road and Senja Road. Bukit Panjang also has a ring road running through the various parts of Bukit Panjang, the [Bukit Panjang Ring Road](/wiki/Ring_Roads_in_Singapore#Bukit_Panjang_Ring_Road). It acts as a feeder to the main arterial roads in the town. ### Cycling There is a total of 8.5 km-worth of [cycling paths](/wiki/Bike_path) around Bukit Panjang to facilitate active mobility as part of the [Land Transport Authority's](/wiki/Land_Transport_Authority) Walk-Cycle-Ride initiative. The first batch of cycling paths was constructed along Petir Road in 2018 by the Holland-Bukit Panjang Town Council. The network has since expanded to cover areas such as Fajar, Bangkit, Jelapang, and Senja. Together with the Pang Sua Park Connector, Bukit Panjang Park Connector, and Bukit Panjang (Woodlands Road to KJE) Park Connector, the cycling paths form the backbone of the town's 16 km cycling network. ## Politics Bukit Panjang is politically divided into two constituencies, namely the [Bukit Panjang Single Member Constituency](/wiki/Bukit_Panjang_Single_Member_Constituency) and the Cashew and Zhenghua wards of the [Holland-Bukit Timah Group Representation Constituency](/wiki/Holland-Bukit_Timah_Group_Representation_Constituency). Bukit Panjang SMC mainly consists of the Pending, Bangkit and Fajar areas. Its [Member of Parliament](/wiki/Member_of_Parliament) is [Liang Eng Hwa](/wiki/Liang_Eng_Hwa). Senja, Segar, and Jelapang are located in Zhenghua ward of Holland-Bukit Timah GRC where its Member of Parliament is [Edward Chia](/wiki/Edward_Chia). Petir, Gangsa, and Chestnut areas belong to the Cashew division of Holland-Bukit Timah GRC with its Member of Parliament being [Vivian Balakrishnan](/wiki/Vivian_Balakrishnan). ### Administration The Bukit Panjang area comes under the administrative lead of the Holland-Bukit Panjang Town Council, which oversees the management and maintenance of the many apartments (HDB flats) and commercial units in Bukit Panjang. Its Member of Parliament is [Liang Eng Hwa](/wiki/Liang_Eng_Hwa) since the [2020 general election](/wiki/2020_Singaporean_general_election). ## Notes ### Citations - Savage, Victor R.; [Yeoh, Brenda](/wiki/Brenda_Yeoh) (15 October 2022). *Singapore Street Names: A Study of Toponymics* (4th ed.). [Marshall Cavendish](/wiki/Marshall_Cavendish). [ISBN](/wiki/ISBN_(identifier)) 9789815009231. - Zhenghua Park (owned by the National Parks Board of Singapore) - SMRT Trains (Bukit Panjang LRT) - Holland-Bukit Panjang Town Council\n",
  "language": "en",
  "processed_at": "2026-01-12T09:58:59.157618",
  "title": "Bukit Panjang",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Bukit_Panjang"
}