{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:58:41.602645"
  },
  "content": "Public library in SingaporeThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Bukit Batok Public Library\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(December 2017)* *(Learn how and when to remove this message)* **Bukit Batok Public Library** is located at [Bukit Batok](/wiki/Bukit_Batok) on the third floor of [West Mall](/wiki/West_Mall) in [Singapore](/wiki/Singapore), next to [Bukit Batok MRT station](/wiki/Bukit_Batok_MRT_station). This is fifth [library](/wiki/Library) of the [National Library Board](/wiki/National_Library_Board) that is located inside a [shopping mall](/wiki/Shopping_mall). The library was officially opened on 21 November 1998 by Deputy Prime Minister, BG (NS) [Lee Hsien Loong](/wiki/Lee_Hsien_Loong). ## History The library begun operating soon after the [West Mall](/wiki/West_Mall) was opened. The library is headed by Lim Puay Ling. It is a fully computerised library with a collection of 202,151 publications. It has served more than 1,419,634 visitors and residents from the Bukit Batok and Bukit Gombak constituencies. As of 2001, it had 28,814 members and had given out 1,345,869 book loans. The library would be closed for renovation starting from 31 December 2023 and would reopen in 2025 in tandem with the mall's renovation works. ## About the library The library has a floor area of 1,270 square metres (13,700 sq ft). It is home to: - 191,492 [books](/wiki/Books) - 10,424 [serials](/wiki/Periodical_publication) - 235 [audiovisual](/wiki/Audiovisual) materials. The library includes a customer service counter, an adult/young people's section, a children's section, an activities room, 13 multimedia stations and a reference collection. Facilities in the library include borrower's enquiry, six borrowing stations, two bookdrop services, browsing shelves of books and periodicals in four main languages and multimedia services. ## RFID It was the first library in which the [Radio Frequency Identification](/wiki/Radio_Frequency_Identification) (RFID) Electronic Library Management System (ELiMS) was implemented. The Electronic Library Management System was developed together by Singapore Technologies LogiTrack and the National Library Board. The ELiMS system manages the tracking, distribution, circulation and flow of books in the library. The advantages of this technology are that it allows books to be cancelled immediately as they are returned through automated book-drops and the loan records of the borrowers are updated instantly. ## Programmes Two [storytelling](/wiki/Storytelling) sessions for children are conducted every Tuesday at 7:00 pm and 7:30 pm. Reading Bear programmes were organised for primary school. [Primary school](/wiki/Primary_school) children are also taken on class visits to the library featuring storytelling, craft, video shows and a tour of the library. Class visits for the [secondary school](/wiki/Secondary_school) students includes multimedia services. The multimedia service is a basic information literacy programme on Internet strategies, search tools and evaluation of websites. [Junior colleges](/wiki/Junior_colleges), schools and other institutions are offered bulk loan services and book promotions or institutional loans. [School holiday](/wiki/School_holiday) programmes include video screening, storytelling in four languages and art and craft sessions. Adults can enjoy educational and informative talks, workshops, user education programmes and library orientation tours. - [Bukit Batok](/wiki/Bukit_Batok) - [List of libraries in Singapore](/wiki/List_of_libraries_in_Singapore) - National Library Board - Infopedia Article This article about a Singapore building or structure is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T09:58:41.602184",
  "title": "Bukit Batok Public Library",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Bukit_Batok_Public_Library"
}