{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:58:42.460029"
  },
  "content": "Mixed-use development in Singapore **Bukit Canberra** ([Chinese](/wiki/Chinese_language): 武吉坎贝拉; [pinyin](/wiki/Pinyin): *Wǔ Jí Kǎn Bèi Lā*) is an integrated sports and community hub next to [Sembawang MRT station](/wiki/Sembawang_MRT_station). The hub houses facilities including an indoor sports hall, the largest ActiveSG gym in [Singapore](/wiki/Singapore), a six-lane sheltered swimming pool, and an eight-lane lap pool. There will also be 3 km of running trails, of various difficulties, passing throughout the development. It also houses a polyclinic, a senior care centre, and a [hawker centre](/wiki/Hawker_centre). ## History Plans for an integrated hub in sembawang was first announced in 2015,it was then planned for some parts of the hub such as the hawker centre to be ready by 2018. It was modelled after [Our Tampines Hub](/wiki/Our_Tampines_Hub). Construction started with a groundbreaking ceremony in 2018 and was originally scheduled to be opened in phases from first half of 2020 but was delayed due to the COVID-19 pandemic. The development was previously part of the demolished [Chong Pang](/wiki/Chong_Pang) Village, which housed a wet market and hawker centre before the 1980s. ## Facilities The integrated sports and community hub provides [Sembawang](/wiki/Sembawang) residents with amenities such as a hawker centre, polyclinic, a senior care centre, a childcare centre, and several parks. ### Hawker centre The 800-seat food and beverage facility has 43 operational stalls, selling a variety of Asian food, including halal food and Indian fare. About one-tenth of the stalls are operated by Sembawang residents. ### Sports hub Sports facilities at Bukit Canberra include an indoor sports hall, a swimming complex, and the biggest ActiveSG gym in Singapore. The indoor sports hall was the first to open on 23 October 2022, and can accommodate 12 badminton courts, or three basketball or volleyball courts. It has a retractable seating gallery that can hold up to 500 people. The swimming complex opened on 15 October 2023, and consists of four indoor and outdoor swimming pools, including an Olympic-sized one, and a wet playground area for children. ### Polyclinic and senior care centre In addition to a focus on providing primary care for ageing population in the northern part of Singapore, Sembawang Polyclinic will offer medical services for acute and chronic diseases, as well as women's health such as cervical and breast cancer screening. The polyclinic opened on 25 November 2023. ### Library The Canberra House, formerly known as the Admiralty House, will be refurbished into a public library.\n",
  "language": "en",
  "processed_at": "2026-01-12T09:58:42.459467",
  "title": "Bukit Canberra",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Bukit_Canberra"
}