{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:59:06.650218"
  },
  "content": "Protected area in Singapore The **Bukit Timah Nature Reserve** ([abbreviation](/wiki/Abbreviation): **BTNR**) is a 1.7-square-kilometre (0.66 sq mi) [nature reserve](/wiki/Nature_reserve) near the geographic centre of [Singapore](/wiki/Singapore), located on the slopes of [Bukit Timah Hill](/wiki/Bukit_Timah_Hill), the country's highest natural peak standing at a height of approximately 165 metres (541 ft), and parts of the surrounding area, located actually in [Bukit Panjang](/wiki/Bukit_Panjang). The nature reserve is about 15 kilometres (9.3 miles) from the [Downtown Core](/wiki/Downtown_Core), Singapore's central business district (CBD). Together with the neighbouring [Central Catchment Nature Reserve](/wiki/Central_Catchment_Nature_Reserve) (CCNR) in close proximity, it houses over 840 [species](/wiki/Species) of flowering plants and over 500 species of [fauna](/wiki/Fauna_(animals)). Today, it is one of the largest patches of primary [rainforest](/wiki/Rainforest) left in Singapore. The forest reserve was formally declared as an [ASEAN Heritage Park](/wiki/ASEAN_Heritage_Park) on 18 October 2011. ## Etymology The name *[Bukit Timah](/wiki/Bukit_Timah)* is borrowed from the tallest hill found in the area of the same name, which is also the tallest geographical location in all of Singapore. *Bukit* means hill in the [Malay language](/wiki/Malay_language), while *Timah* means tin. It is directly translated to English as \"Tin Hill\". The hill served as a [granite](/wiki/Granite) quarry for many years, but since the mid-1900s, all quarrying operations have been abandoned and the area converted into recreational and even filming locations. ## History In 1882, [Nathaniel Cantley](/wiki/Nathaniel_Cantley), the Superintendent of the [Singapore Botanic Gardens](/wiki/Singapore_Botanic_Gardens), was tasked with assessing the forests of the Straits Settlements. His recommendations led to the creation of several forest reserves, including Bukit Timah in 1883. While most reserves were exploited for timber, Bukit Timah was preserved. By 1937, many reserves were depleted due to development pressures, but Bukit Timah and two other areas remained protected for their flora and fauna. In 1951, the Nature Reserves Ordinance established formal protection for these areas, which were then managed by the Nature Reserves Board. Today, under the National Parks Act and managed by the [National Parks Board](/wiki/National_Parks_Board), these nature reserves continue to safeguard Singapore's indigenous flora and fauna. ## Activities The primary activities at Bukit Timah are strolling, running and hiking. There are also smaller groups of people who [rock-climb](/wiki/Rock_climbing) and [abseil](/wiki/Abseil) at the Dairy Farm quarry as well as [mountain biking](/wiki/Mountain_biking). There are specially-allocated mountain-bike [trails](/wiki/Trails) around the area and Bukit Timah Mountain Bike (MTB) Trail is located within the Reserve. The 6.5 km MTB trail loop around Bukit Timah Hill and stretched between Hinhinde Park and Dairy Farm Road. The trail represents a tropical rocky terrain with extended technical climbs and difficult descents at short intervals. For MTB Map trail rating, it is largely made up of black diamond sections with intermittent blue square sections. There are also short alternative double black diamond sections. The Reserve is popular among athletes training for mountain-climbing. There are a number of hiking trails. The blue trail is rated as \"easy\" and is 0.7 kilometres (0.43 mi) long, ending overlooking Hindhede Quarry. The red trail is also rated as \"easy\" and is 1.2 kilometres (0.75 mi) long. The green trail is rated as \"moderate to difficult\" and is 1.9 kilometres (1.2 mi) long. The yellow trail is rated as \"difficult\" and is 1.8 kilometres (1.1 mi) long. The red, green and yellow trails all end at the hut at the summit of Bukit Timah hill. The park has been designated with the code 9V-0007 by the international [Parks On The Air](/wiki/Parks_On_The_Air) award program, and so is regularly 'activated' by [Amateur Radio](/wiki/Amateur_Radio) operators using portable equipment. ## Wildlife ### Flora Some of the common plants there are the [rattan](/wiki/Rattan), [figs](/wiki/Figs), and [macaranga](/wiki/Macaranga). Two meninjau trees (*[Gnetum gnemon](/wiki/Gnetum_gnemon)*) stand near the visitor center. 18 different species of [dipterocarps](/wiki/Dipterocarp) live in the reserve, including the seraya (*[Shorea curtisii](/wiki/Shorea_curtisii)*) and *[Dipterocarpus caudatus](/wiki/Dipterocarpus_caudatus)*. [Fan palms](/wiki/Licuala) (*[Licuala ferruginea](/wiki/Licuala_ferruginea)*), [leaf litter plants](/wiki/Leaf_litter_plant) (*[Agrostistachys longifolia](/wiki/Agrostistachys_longifolia)*) thorny rattan and [ferns](/wiki/Fern) are also common. Fern species include [staghorn fern](/wiki/Platycerium) (*[Platycerium coronarium](/wiki/Platycerium_coronarium)*) and [bird's nest fern](/wiki/Bird%27s_nest_fern) (*[Asplenium nidus](/wiki/Asplenium_nidus)*). [Lichens](/wiki/Lichen) and fungus, such as [bracket fungus](/wiki/Bracket_fungus) are also found. ### Fauna #### Insects and arachnids Insects found within the reserve include [millipedes](/wiki/Millipede), [carpenter bees](/wiki/Carpenter_bee), and many different types of bird, insects and spiders. Common insect species include [cicadas](/wiki/Cicada) and [giant forest ants](/wiki/Giant_forest_ant) (*[Camponotus gigas](/wiki/Camponotus_gigas)*). Common spider species include the [golden orb-web spider](/wiki/Golden_orb-web_spider) (*[Nephila pilipes](/wiki/Nephila_pilipes)*) and the [St Andrew's Cross spider](/wiki/St_Andrew%27s_Cross_spider) (*Argiope mangal*). #### Arthropods The [Singapore freshwater crab](/wiki/Singapore_freshwater_crab) (*[Johora singaporensis](/wiki/Johora_singaporensis)*) is indigenous to Bukit Timah. #### Reptiles Reptiles in the reserve include the [reticulated python](/wiki/Reticulated_python) (*[Python reticulatus](/wiki/Python_reticulatus)*), the [paradise tree snake](/wiki/Paradise_tree_snake) (*[Chrysopelea paradisi](/wiki/Chrysopelea_paradisi)*) and the [common sun skink](/wiki/Common_sun_skink) (*[Eutropis multifasciata](/wiki/Eutropis_multifasciata)*). #### Mammals The [crab-eating macaque](/wiki/Crab-eating_macaque) (*Macaca fascicularis*), a species of monkey, is common in the reserve. The monkeys also enter the area surrounding the park and are common enough that there are concerns that interactions with people will alter their behaviour. Feeding the monkeys is prohibited, and visitors are urged to avoid staring at, baring teeth at or otherwise disturbing or threatening the monkeys. Monkeys are not the only mammals in the park. Other mammals include the [Malayan pangolin](/wiki/Malayan_pangolin) (*Manis javanica*), [Malayan colugo](/wiki/Malayan_colugo) (*Galeopterus variegatus*), [plantain squirrel](/wiki/Plantain_squirrel) (*Callosciurus notatus*) and [slender squirrel](/wiki/Slender_squirrel) (*Sundasciurus tenuis*). The colugos, which are generally nocturnal, can sometimes be seen clinging to trees during the day. Bukit Timah is the only place in Singapore where the [red-cheeked flying squirrel](/wiki/Red-cheeked_flying_squirrel) (*Hylopetes spadiceus*) is found. [Raffles' banded langur](/wiki/Raffles%27_banded_langur) monkey (*Presbytis femoralis*) was once found in Bukit Timah but the last individual from the Bukit Timah population died in 1987. The government hopes that the [Eco-Link@BKE](/wiki/Eco-Link@BKE) will allow the Raffles' banded langur to repopulate Bukit Timah from [Central Catchment](/wiki/Central_Catchment) once the vegetation matures. #### Birds The [greater racket-tailed drongo](/wiki/Greater_racket-tailed_drongo) is one of the most common birds at Bukit Timah (*[Dicrurus paradiseus](/wiki/Dicrurus_paradiseus)*). The drongos often follow monkeys through the forest and eat insects that are exposed by the monkeys' actions. Other bird species include the [Asian fairy bluebird](/wiki/Asian_fairy_bluebird) (*[Irena puella](/wiki/Irena_puella)*), the [red-crowned barbet](/wiki/Red-crowned_barbet) (*[Megalaima rafflesii](/wiki/Megalaima_rafflesii)*) and the [common emerald dove](/wiki/Common_emerald_dove) (*[Chalcophaps indica](/wiki/Chalcophaps_indica)*). Bukit Timah is one of only two places in Singapore where the red-crowned barbet is found, the other being the [Central Catchment Nature Reserve](/wiki/Central_Catchment_Nature_Reserve). The reserve, along with the adjacent Central Catchment Nature Reserve, has been identified by [BirdLife International](/wiki/BirdLife_International) as the Central Forest [Important Bird Area](/wiki/Important_Bird_Area) (IBA) because it supports populations of [vulnerable](/wiki/Vulnerable_species) [straw-headed bulbuls](/wiki/Straw-headed_bulbul) and [brown-chested jungle flycatchers](/wiki/Brown-chested_jungle_flycatcher). ## Eco-Link In 2011 the National Parks Board and the [Land Transport Authority](/wiki/Land_Transport_Authority) announced a plan to construct an ecological corridor, the [Eco-Link@BKE](/wiki/Eco-Link@BKE), at the [Bukit Timah Expressway](/wiki/Bukit_Timah_Expressway) to connect Bukit Timah Nature Reserve with the nearby [Central Catchment Nature Reserve](/wiki/Central_Catchment_Nature_Reserve). Construction was completed in late 2013. The Eco-Link is an [hourglass](/wiki/Hourglass) shaped bridge passing over the expressway, permitting wildlife to pass between the two reserves. Trees and shrubs native to Singapore are planted along the bridge, which provide food for the animals. The reserves had been separated since the expressway was built. After monitoring its effectiveness for a few years, the National Parks Board intends to consider opening the bridge to the public for guided walks. - [Bukit Timah](/wiki/Bukit_Timah) - [Park Connector Network](/wiki/Park_Connector_Network) (PCN) Library resources about **Bukit Timah Nature Reserve** - Resources in your library - Resources in other libraries - Bukit Timah Nature Reserve - Infopedia, Bukit Timah Nature Reserve[*dead link*] (National Library Board) - National Biodiversity Centre, Singapore[*permanent dead link*] - Ecologyasia.com – Bukit Timah\n",
  "language": "en",
  "processed_at": "2026-01-12T09:59:06.649736",
  "title": "Bukit Timah Nature Reserve",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Bukit_Timah_Nature_Reserve"
}