{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:58:55.631194"
  },
  "content": "Bus interchange in Singapore **Bukit Merah Bus Interchange** is a [bus interchange](/wiki/Bus_station) located in the [Bukit Merah](/wiki/Bukit_Merah) Town Centre in [Singapore](/wiki/Singapore). The interchange is located along Bukit Merah Central and serves the nearby residential estates of [Telok Blangah](/wiki/Telok_Blangah) and [Bukit Purmei](/wiki/Bukit_Purmei), as well as the commercial buildings in Bukit Merah Central. It is currently among the few bus interchanges in Singapore that does not have a direct link to an [MRT station](/wiki/Mass_Rapid_Transit_(Singapore)). However, several services link commuters to nearby MRT stations from the interchange. Services 5, 16 and 851 link the interchange to [Tiong Bahru](/wiki/Tiong_Bahru_MRT_station), Service 132 links to [Redhill](/wiki/Redhill_MRT_station), while Service 176 links to [Telok Blangah](/wiki/Telok_Blangah_MRT_station). ## History The interchange was constructed as part of a scheme to improve bus services in the [Telok Blangah](/wiki/Telok_Blangah) area. Operations at the interchange commenced on 28 September 1980, and it was officially opened on 14 February 1981, with Minister without Portfolio Lim Chee Onn attending the ceremony. ## Bus Contracting Model Under the [Bus Contracting Model](/wiki/Bus_contracting_model_of_Singapore), all bus services operating from Bukit Merah Bus Interchange were divided into 6 Bus Packages, operated by three different bus operators. ### List of Bus Services OperatorPackageRoutes**SBS Transit**Bishan-Toa Payoh139Bukit Merah5, 16, 16M, 57, 123, 131, 198, 272, 273Seletar851Sengkang-Hougang132, 153**SMRT Buses**Choa Chu Kang-Bukit Panjang75, 176**Tower Transit Singapore**Sembawang-Yishun167 - Interchanges and Terminals (SBS Transit) - Interchange/Terminal (SMRT Buses) This article about a Singapore building or structure is a stub. You can help Wikipedia by expanding it. - v - t - e This bus station-related article is a stub. You can help Wikipedia by expanding it. This Singapore bus-related article is a stub. You can help Wikipedia by expanding it. - v - t - e This article about transport in [Singapore](/wiki/Singapore) is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T09:58:55.630804",
  "title": "Bukit Merah Bus Interchange",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Bukit_Merah_Bus_Interchange"
}