{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:58:44.628755"
  },
  "content": "Hill in Singapore 1°16′45″N 103°47′30″E﻿ / ﻿1.2791°N 103.7918°E﻿ / 1.2791; 103.7918 **Bukit Chandu**[a] is a hill located within [Kent Ridge Park](/wiki/Kent_Ridge_Park) in Singapore. It was the site of the [Battle of Bukit Chandu](/wiki/Battle_of_Bukit_Chandu), a significant engagement that took place on 14 February 1942 during the [Battle of Singapore](/wiki/Battle_of_Singapore) in [World War II](/wiki/World_War_II). ## Etymology The name of the hill, Bukit Chandu, reflects its historical association with an opium-processing factory that once operated at its base. This connection to the former factory gave rise to the name, which translates from Malay as \"Opium Hill.\" ## History Bukit Chendu is the site of the Battle of Pasir Panjang during the February 1942 invasion by the Japanese. On this ridge, fewer than 100 [Malay Regiment](/wiki/1st_Malaya_Infantry_Brigade) soldiers waged against a [Japanese army](/wiki/18th_Division_(Imperial_Japanese_Army)) of 18,000. Despite being outnumbered many times over and later being out of bullets, they held their ground for two days, finally fighting hand-to-hand. Most were killed and many were tortured, their bodies subsequently found to have been mutilated. ## Attractions As appreciation for their gallantry, the [Reflections at Bukit Chandu](/wiki/Reflections_at_Bukit_Chandu) interpretive centre was established in a restored colonial bungalow at 31K Pepys Road, which opened on 15 February 2002, sixty years after the [fall of Singapore](/wiki/Fall_of_Singapore). The centre tells the battle history and honors the Malay Regiment's gallantry, which has been called an enduring record of grit and sacrifice. Now, Bukit Chendu represents Singapore's strengthand a commemoration to all the lives lost in the defense of Singapore. ## Notes\n",
  "language": "en",
  "processed_at": "2026-01-12T09:58:44.628322",
  "title": "Bukit Chandu",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Bukit_Chandu"
}