{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:59:10.580314"
  },
  "content": "Former train station in Bukit Timah, Singapore **Bukit Timah railway station** is a former [railway station](/wiki/Train_station) and crossing loop in [Bukit Timah](/wiki/Bukit_Timah), in the westernmost part of the [Central Region](/wiki/Central_Region,_Singapore) of Singapore. Opened on the dismantled Tank Road mainline in 1903, it was rebuilt on the current Singapore–Johor Bahru KTM Intercity mainline in 1932, until the Jurong line shut down and it became a crossing loop station in the late 1940s until closure. The station was a freight interchange for the now defunct Jurong line from 1965 to the early 1990s. The station closed in 2011, and it is now a conserved recreational building and museum that is part of the [Rail Corridor](/wiki/Rail_Corridor_(Singapore)). ## History ### Early years This station was the second to carry the name Bukit Timah and it was built on the new Deviation line from Bukit Batok to Tanjong Pagar in 1932. The original Bukit Timah Railway Station was a wooden construction at Pei Wah Avenue on the 1903 line from [Woodlands](/wiki/Woodlands_railway_station,_Singapore) to Singapore (River Valley Road) via [Newton](/wiki/Newton_railway_station,_Singapore). The Singapore station was replaced in 1907 when a new station was built at [Tank Road](/wiki/Tank_Road_railway_station) and the line extended to [Pasir Panjang](/wiki/Pasir_Panjang_railway_station), the old station at River Valley road became a goods only station incorporated into the later expanded Tank Road complex. When the line to Tanjong Pagar opened all passenger traffic on the line to Tank Road ceased and the old Bukit Timah Station was closed along with all the other stations on the old line which was closed to all traffic and lifted within a few years. The section from Tank Road to Tanjong Pagar continued for a short while to clear out all the freight and the section from Tanjong Pagar to Pasir Panjang was taken over by the Singapore Harbour Board. Passenger traffic continued from the new Bukit Timah station until 1965 when Singapore was expelled from Malaysia, after which customs and immigration facilities were set up at Tanjong Pagar. Previously they had been carried out on the train at Johore Bahru during a lengthy stop. The station is built in the style of traditional small town stations. Workers of the railways constituted of mainly Tamils and Malays, and were given much work privileges which include free medical facilities for themselves and their families. The station served as a commodities transport linkage for the then heavily industrialized Bukit Timah to other stations, allowing goods to be produced and transported efficiently. Numerous houses could be found along the vicinity of the railways. These houses ranges from typical metal sheds that provides services the railway staff's automobile needs to brick houses lived by residents. This station was between [Tanjong Pagar railway station](/wiki/Tanjong_Pagar_railway_station) at the southern end of Singapore island and [Woodlands Train Checkpoint](/wiki/Woodlands_Train_Checkpoint) at the northern end. It was a crossing loop station and signalling control house. The locomotive and two passenger coaches of a KTM train bound for [Kuala Lumpur](/wiki/Kuala_Lumpur) derailed near the Bukit Timah station just after 8am on 9 November 2010. None of the 60 passengers on board were injured. As a result of the derailment, all KTM train services from Singapore on the day of the incident were cancelled, southbound services terminated at JB Sentral and services the next day were rescheduled. ### Closure and conservation The station, along with the line between Woodlands at the northern edge of Singapore and Tanjong Pagar at the southern end, closed on 1 July 2011 and was returned to Singapore. The station was gazetted as a conserved building previously on 27 May that same year. Following closure, the railway track between Tanjong Pagar and Woodlands was removed. A few metres of track have been left between the platforms at Bukit Timah, as well as the iron bridge across Bukit Timah Road, immediately to the north of the station. The rest of the trackbed has been turfed over and is now open to the public as a linear park, as part of Singapore's [Nature Society](/wiki/Nature_Society_(Singapore)) and [URA](/wiki/Urban_Redevelopment_Authority)'s \"Rail Corridor\" project. The Bukit Timah station buildings were reopened to the public by the Singapore Land Authority on 16 September 2011. The buildings can be visited during daylight hours, but refurbishment or development would not occur until 2021 with the former track bed being refurbished into a recreational pavement while the former station was renovated into a museum and the former station master's house into a cafe. The next nearest station is at [King Albert Park MRT station](/wiki/King_Albert_Park_MRT_station) on the [Downtown line](/wiki/Downtown_Line), which opened on 27 December 2015. On 1 July 2022, after two years of restoration work, the Bukit Timah railway station officially re-opened to the public once again, as part of the new 4.3-hectare community space around the mid-point of the Rail Corridor. ## Gallery - [Malaysia–Singapore Points of Agreement of 1990](/wiki/Malaysia%E2%80%93Singapore_Points_of_Agreement_of_1990) - [Rail transport in Singapore](/wiki/Rail_transport_in_Singapore) ## Notes - Description at National Heritage Board's website Portals: - Singapore - Trains\n",
  "language": "en",
  "processed_at": "2026-01-12T09:59:10.579855",
  "title": "Bukit Timah railway station",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Bukit_Timah_railway_station"
}