{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:58:34.695706"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Bukit Batok\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(March 2016)* *(Learn how and when to remove this message)*Planning Area and HDB Town in West Region, Singapore **Bukit Batok** ([IPA](/wiki/International_Phonetic_Alphabet): /ˈbʊkɪt ˌbɑːtoʊk/ *BUUK-it BAH-tohk*), often abbreviated as **Bt Batok**, is a [planning area](/wiki/Planning_Areas_of_Singapore) and [residential town](/wiki/New_towns_of_Singapore) located in the eastern part of the [West Region](/wiki/West_Region,_Singapore) of [Singapore](/wiki/Singapore). Bukit Batok statistically ranks in as the 25th largest, the 10th most populous and the 9th most densely populated planning area in Singapore. It is bordered by six other planning areas - [Choa Chu Kang](/wiki/Choa_Chu_Kang) to the north and northwest, [Bukit Panjang](/wiki/Bukit_Panjang) to the northeast and east, [Clementi](/wiki/Clementi,_Singapore) to the south, [Bukit Timah](/wiki/Bukit_Timah) to the southeast, [Jurong East](/wiki/Jurong_East) to the southwest and [Tengah](/wiki/Tengah,_Singapore) to the west. Bukit Batok largely sits on [Gombak norite](/wiki/Norite), a geological formation that is found in high concentrations within the planning area itself, as well as in the western parts of neighbouring Cashew. It was this presence of the [igneous rock](/wiki/Igneous_rock) that made Bukit Batok a pivotal location for the [quarrying](/wiki/Quarry) industry in Singapore around the turn of the mid-20th century. ## Etymology Many differing accounts describe the origin of the name Bukit Batok. *Bukit* means \"hill\" in Malay, thus the name of the town gives the impression of it being hilly. *Batok*, however, has several interpretations. One version, according to a [Javanese](/wiki/Java_(island)) village chief of the village Gassing, that coconut trees grew in the hilly area and hence the area was named *batok*, the Javanese term for coconuts. The Chinese version is that the hills of solid [granite](/wiki/Granite), which is called *batu* in Malay, and then subsequently misnamed as *bato* and then finally *batok*. Another version was that hill looks like a human skull top and the words skull top was pronounced as *batok*. Others believe that *batok*, the Malay word for [cough](/wiki/Cough), is linked to the place either because of its cool air (causing [coughs](/wiki/Cough) and [colds](/wiki/Colds)), or due to the sound of [explosives](/wiki/Explosives) historically used at its granite [quarry](/wiki/Quarry), Little Guilin. ## History Before the 1940s, Bukit Batok was heavily dominated by rubber and pineapple plantations. At the start of the 1940s, industrialization began to gradually occur in Bukit Timah. [Ford factory](/wiki/Former_Ford_Factory) was one of the first factories to be built along Bukit Timah road near the current day's site. During the [battle of Singapore](/wiki/Battle_of_Singapore) in the [World War II](/wiki/World_War_II), Bukit Batok became a significant ground for both the [Allied](/wiki/Allies_of_World_War_II) and [Axis powers](/wiki/Axis_powers). The failed attempt by the [British](/wiki/British_Armed_Forces) to defend the vicinity during the [Battle of Bukit Timah](/wiki/Battle_of_Bukit_Timah) and their subsequent surrender on 15 February 1942 to the [Japanese](/wiki/Imperial_Japanese_Army) at the Ford Motor Factory was described by [Winston Churchill](/wiki/Winston_Churchill) as the \"[largest capitulation](/wiki/Battle_of_Singapore#Fall_of_Singapore)\" in British military history. Consequently, the British's plans to industrialize Bukit Timah was short-lived and put to an abrupt halt during World War II. The factories that were built before 1942 were swiftly taken over by the Japanese during their occupation of Singapore. Ford Factory, which sits at the bottom of the Bukit Batok Hill, was occupied by Nissan, the Japanese Multination Corporation, to supply military vehicles for the Imperial Japanese Army Force. Both Bukit Batok hill (current day Bukit Batok Nature Park) and Bukit Timah hill were considered as strategic hill grounds during the Japanese occupation. These locations were key to controlling the surrounding areas and thus were the site of the fiercest battles of the war. Following the successful conquest of Singapore, General Yamashita ordered 500 Australian prisoners of war to construct a Japanese war memorial, Syonan Chureito shrine, at the top of Bukit Batok Hill. Throughout the Japanese occupation, the Japanese officials and military personnel would frequently worship their emperor in the Syonan Chureito shrine. In addition, footages of these ceremonies would be broadcast as propaganda in Japan to ensure the citizens’ continuous support for the war. However, the shrine was ultimately destroyed by the Japanese themselves at the end of the World War II as they feared that the honour of the memorial would be tarnished by the returning British troops. After World War II, the British returned to Singapore. The areas around Ford Factory became known as the British's ‘colonial estate factories’ as the British resumed their plans to industrialize Bukit Batok. In addition to the development of factories, Bukit Batok began to be extensively quarried for granite. The Poh Kim Quarry, which lies in the heart of Bukit Batok Nature Park today, was one of the quarry sites in the vicinity. It was quarried for granite between the 1950s to the 1970s but was later abandoned due to the damage that the activities was causing to the Earth's core. After Singapore gained independence in 1965, the newly formed People's Action Party (PAP) government aggressively promoted the site as a lightweight industrial area. Development of Bukit Batok New Town began in December 1975, transforming the former village into a new town in the rough span of a decade. As a testament to its heritage, several norite formations and [ridges](/wiki/Ridge) remained preserved, most of which can be found at both [Bukit Batok Nature Park](/wiki/Bukit_Batok_Nature_Park) and [Bukit Batok Town Park](/wiki/Bukit_Batok_Town_Park) as a characteristic feature of the modern-day town. ## Geography ### Location Bukit Batok Planning Area is bordered by six other planning areas - [Choa Chu Kang](/wiki/Choa_Chu_Kang) to the north and northwest, [Bukit Panjang](/wiki/Bukit_Panjang) to the northeast and east, [Clementi](/wiki/Clementi,_Singapore) to the south, [Bukit Timah](/wiki/Bukit_Timah) to the southeast, [Jurong East](/wiki/Jurong_East) to the southwest and [Tengah](/wiki/Tengah,_Singapore) to the west. Bukit Batok New Town is located within Bukit Batok Planning Area. ### Subzones Bukit Batok Planning Area is divided into nine subzones: EstateLocationNotable placesAccessibility[Brickworks](/wiki/Brickworks,_Singapore)Areas bounded by Bukit Batok Road, Bukit Batok West Avenue 2 and Bukit Batok West Avenue 3[Millennia Institute](/wiki/Millennia_Institute), [Dulwich College Singapore](/wiki/Dulwich_College_Singapore) and Bukit Batok Hillside ParkBuses and [Tengah Park MRT station](/wiki/Tengah_Park_MRT_station) (future)Bukit Batok CentralAreas bounded by Bukit Batok West Avenue 6, Bukit Batok West Avenue 3, Bukit Batok Central, Bukit Batok East Avenue 3 and Bukit Batok East Avenue 6[Bukit Batok MRT station](/wiki/Bukit_Batok_MRT_station), [Bukit Batok Bus Interchange](/wiki/Bukit_Batok_Bus_Interchange), Bukit Batok Community Club, [Bukit Batok Public Library](/wiki/Bukit_Batok_Public_Library), [West Mall](/wiki/West_Mall), Bukit Batok Polyclinic, [Bukit View Secondary School](/wiki/Bukit_View_Secondary_School), Keming Primary School, Ling Hong Tong and Bukit Batok Joint Temple[Bukit Batok MRT station](/wiki/Bukit_Batok_MRT_station) and busesBukit Batok EastAreas bounded by Bukit Batok East Avenue 2, Bukit Batok East Avenue 3, Bukit Batok East Avenue 4, Bukit Batok East Avenue 5 and Bukit Batok East Avenue 6Bukit Batok East Community Club and Bukit Batok Neighbourhood Police Centre, Hock Thong Temple, See Thian Foh Temple and Masjid Ar-Raudhah MosqueBusesBukit Batok SouthAreas bounded by Bukit Batok East Avenue 1, 3 and 6; the Pan-Island Expressway, Toh Tuck Road and the western side of the landed houses along Jalan Jurong KechilBukit Batok Swimming Complex and [Bukit Batok Bus Depot](/wiki/Bukit_Batok_Bus_Depot)BusesBukit Batok WestAreas bounded by Bukit Batok Road, Bukit Batok West Avenue 3, Bukit Batok West Avenue 6, Bukit Batok Avenue 1 and the [Pan-Island Expressway](/wiki/Pan-Island_Expressway).[Bukit Batok Secondary School](/wiki/Bukit_Batok_Secondary_School), Princess Elizabeth Primary School, Guilin Combined Temple, Sattha Puchaniyaram Buddhist Temple and Bukit Batok Providence Presbyterian ChurchBuses and [Bukit Batok West MRT station](/wiki/Bukit_Batok_West_MRT_station) (future)[Gombak](/wiki/Bukit_Gombak)Northern Bukit Batok[Bukit Panjang MRT station](/wiki/Bukit_Panjang_MRT_station), [Cashew MRT station](/wiki/Cashew_MRT_station) and Bukit Gombak Community Centre[Bukit Panjang MRT station](/wiki/Bukit_Panjang_MRT_station), [Cashew MRT station](/wiki/Cashew_MRT_station) and buses[Guilin](/wiki/Guilin,_Singapore)Areas to the immediate north of Bukit Batok Central[Bukit Gombak MRT station](/wiki/Bukit_Gombak_MRT_station), [Bukit Batok Town Park](/wiki/Bukit_Batok_Town_Park), [Bukit Gombak Stadium](/wiki/Bukit_Gombak_Stadium), [Hillgrove Secondary School](/wiki/Hillgrove_Secondary_School) and Lianhua Primary School[Bukit Gombak MRT station](/wiki/Bukit_Gombak_MRT_station) and buses[Hillview](/wiki/Hillview,_Singapore)Eastern Bukit Batok[Hillview MRT station](/wiki/Hillview_MRT_station), [Old Ford Motor Factory](/wiki/Old_Ford_Motor_Factory) and [Bukit Batok Nature Park](/wiki/Bukit_Batok_Nature_Park)[Hillview MRT station](/wiki/Hillview_MRT_station), [Hume MRT station](/wiki/Hume_MRT_station) and busesHong Kah NorthAreas bounded by Bukit Batok Road, Bukit Batok West Avenue 2 and Bukit Batok West Avenue 5Bukit Batok Driving Centre, Hong Kah North Community Club, [Swiss Cottage Secondary School](/wiki/Swiss_Cottage_Secondary_School), [Dunearn Secondary School](/wiki/Dunearn_Secondary_School), Saint Anthony's Primary School, Zu-Lin Temple and Dazhong Primary School[Bukit Gombak MRT station](/wiki/Bukit_Gombak_MRT_station) and buses ## Demographics ### Population history Resident Population 2000-2024YearPop.±%2000126,640—2001126,840+0.2%2002129,260+1.9%2003130,100+0.6%2004132,680+2.0%2005135,420+2.1%2006138,230+2.1%2007140,400+1.6%2008141,450+0.7%2009144,290+2.0%2010144,200−0.1%2011143,380−0.6%2012142,620−0.5%2013142,310−0.2%2014141,560−0.5%2015139,270−1.6%2016138,040−0.9%2017138,290+0.2%2018144,410+4.4%2019153,740+6.5%2020158,030+2.8%2021160,150+1.3%2022164,560+2.8%2023168,560+2.4%2024167,750−0.5%2025165,830−1.1%Source: As of 2025, the most populous subzone of Bukit Batok is [Brickworks](/wiki/Brickworks,_Singapore), with a population of 30,920 residents. ### Age profile The data below is from the population report published by the Singapore Department of Statistics as of June 2025. Age Group (years)MalesFemalesTotal Population% of Total Population0–43,6303,4307,0604.265–94,2103,9508,1604.9210–143,8503,7207,5704.5615–194,1104,0808,1904.9420–244,5204,4108,9305.3825–295,1105,12010,2306.1730–345,9006,67012,5707.5835–396,6207,09013,7108.2740–445,4306,14011,5706.9845–495,2305,90011,1306.7150–545,7906,26012,0507.2655–595,8306,09011,9207.1960–646,1106,21012,3207.4365–695,6505,81011,4606.9170–744,3304,5308,8605.3475–792,5702,8305,4003.2680–841,0501,3902,4401.4785–895708601,4300.8690+2805908700.52Age group (years)MalesFemalesTotal population% of total population0–1411,69011,10022,79013.7415–6454,65057,970112,62067.9065+14,45016,01030,46018.36 The population distribution of Bukit Batok in 2025 demonstrates a balanced population structure. There is a higher population concentration among middle-aged groups, with a peak at the 35-39 age group at 8.27%. ### Household As of 2025, there were 129,890 people living in [HDB](/wiki/Housing_and_Development_Board) flats, representing 78.3% of the population. This is higher than the national proportion of HDB dwellers (75.8%). Among the population, 56,940 residents, or 34.3% of the population, live in 4-Room Flats, making it the most common type of dwelling. 29,390 residents (17.57%) live in condominiums and other apartments, while 5,480 (3.30%) live in landed properties. As of 2020, the average household size in Bukit Batok is 3.14. Among the 54,297 households in Bukit Batok, the most common household size is two persons (12,574 households), representing 23.8% of total households. This is closely followed by a household size of three persons (12,465 households, 23.0%). ### Ethnicity Ethnic groups in Bukit Batok (2000−2020) Year[Chinese](/wiki/Chinese_Singaporeans)[Malays](/wiki/Malay_Singaporeans)[Indians](/wiki/Indian_Singaporeans)Others[Pop.](/wiki/Population)PercentagePop.PercentagePop.PercentagePop.Percentage**2000**93,50273.83%21,56417.03%10,5468.33%1,0310.81%**2010**104,26672.31%20,48214.2%15,25710.58%4,1932.91%**2015**102,08073.29%19,57014.05%13,7309.86%3,9002.8%**2020**113,46071.8%25,24015.97%14,9509.46%4,3802.77% Consistent with the rest of Singapore, Bukit Batok has an ethnically diverse population, with a majority Chinese population, constituting 71.80% of the population as of 2020. This is lower than the national proportion of 74.35%. ### Religion Consistent with the rest of Singapore, the largest religion in Bukit Batok is [Buddhism](/wiki/Buddhism_in_Singapore), with 26,343 practising residents (29.9% of the population). The second most common group consists of residents with [no religion](/wiki/Irreligion_in_Singapore) (26,343 residents, 18.9%), followed closely by [Christianity](/wiki/Christianity_in_Singapore), with 25,851 (23.08%) practising residents, including 8,125 Catholics (5.84%). [Islam](/wiki/Islam_in_Singapore) is practised by 23,059 residents (16.6%). Other religious affiliations include [Taoism](/wiki/Taoism_in_Singapore) and [other Chinese religions](/wiki/Chinese_folk_religion) (12,344 residents, 8.87%), [Hinduism](/wiki/Hinduism_in_Singapore) (9,228 residents, 6.63%), and [Sikhism](/wiki/Sikhism_in_Singapore) (377 residents, 0.27%). ### Education As of 2020, 42,101 residents (33.4% of the population) in Bukit Batok have attained a university qualification, higher than the national average of 32.1%. In contrast, 12,735 residents, or 10.1% of the population, have no educational qualifications, slightly higher than the national average of 10.6%. 97.3% of the population aged above 15 is literate, similar to the national average of 97.1%. 66.0% of residents are literate in two languages, with the most common language pair being English and Chinese (44.8% of residents). Additionally, 7.4% of Bukit Batok residents are literate in three or more languages, higher than the national average of 6.9%. ### Language Languages most frequently spoken at home, Bukit Batok (2020 census)Languagespercent[English](/wiki/Singapore_English)46.2%[Mandarin Chinese](/wiki/Mandarin_Chinese)31.0%[Malay](/wiki/Malay_Language)10.1%[Chinese dialects](/wiki/Chinese_dialects)7.6%[Tamil](/wiki/Tamil_Language)3.4%[Other Indian languages](/wiki/Languages_of_India)0.96%Others0.78% In Bukit Batok, the proportion of residents using [English](/wiki/English_language) as the most frequently spoken language (46.15%) is slightly lower than the national average of 48.25%. Additionally, there are 4,860 [Tamil](/wiki/Tamil_Language) speakers, representing 77.9% of the total 6,241 [Indian language](/wiki/Languages_of_India) speakers. ### Employment and income According to the 2020 Census of Population, Bukit Batok has a [labour force](/wiki/Workforce) of 96,479 residents, of which 90,479 are employed. This equates to an employment rate of 93.8%, lower than the [national employment rate](/wiki/Employment_in_Singapore) of 94.2%. The remaining 42,704 residents aged above 15 in Bukit Batok (30.7%) are outside the labour force. Among the employed residents in Bukit Batok aged 15 years and over, most earn a gross monthly income of between S$1,000 and S$1,999, with 13.3% being in that category. This is followed closely by those earning between S$3,000 and S$3,999, constituting 12.8% of employed residents. 6.7% earn more than S$15,000 a month, while 6.2% earn less than S$1,000 per month. According to the 2020 Census of Population, most resident households in Bukit Batok earn a monthly household income of S$20,000 and over, constituting 13.2% of all households. The second most common category is households with no employed person, encompassing 11.0% of all households. ## Commercial activities Bukit Batok's main shopping complex *[West Mall](/wiki/West_Mall)* was opened in mid-1998. Developed by Alprop Pte. Ltd., a joint venture between the United Industrial Corporation (UIC) and Singapore Land, it has 7 storeys in total gross floor area of 283,000 sq ft (26,300 m2) on a land area of 106,000 sq ft (9,800 m2). It was built at a cost of S$170 million and houses amenities including a post office, Community Library and Cineplex, together with shops, restaurants and a supermarket. ## Transport There are two MRT stations in the Bukit Batok area: [Bukit Batok MRT station](/wiki/Bukit_Batok_MRT_station) and [Bukit Gombak MRT station](/wiki/Bukit_Gombak_MRT_station). The [Bukit Batok Bus Interchange](/wiki/Bukit_Batok_Bus_Interchange), sited near to Bukit Batok MRT station and West Mall, is of moderate size and nearly completely used by [Tower Transit Singapore](/wiki/Tower_Transit_Singapore). The interchange and most of the services were previously operated by Singapore Bus Services (the precursor of [SBS Transit](/wiki/SBS_Transit)), until 26 December 2000, when bus services were transferred to Trans-Island Bus Services (the precursor of [SMRT Buses](/wiki/SMRT_Buses)). SMRT Buses remained the operator until 29 May 2016, when only bus services 852 (until 2018, under Seletar Bus Package) and 61 and 991 were left with SMRT Buses. SBS Transit still has a bus depot in Bukit Batok. ## Public service and utility Bukit Batok has one fire station located at 80 Bukit Batok Rd, Singapore 658072. The HDB Branch is located at Bukit Batok Central. ## Education As of 2023[update], this area has a total of six primary schools and five secondary schools. These include Princess Elizabeth Primary School, Keming Primary School, Lianhua Primary School, St. Anthony's Primary School, Bukit View Primary School, Bukit View Secondary School, Bukit Batok Secondary School, Hillgrove Secondary School, Dunearn Secondary School. [Yusof Ishak Secondary School](/wiki/Yusof_Ishak_Secondary_School) relocated from Bukit Batok to its [Punggol](/wiki/Punggol) campus in 2022. [Millennia Institute](/wiki/Millennia_Institute), formed from the merger of [Jurong Institute](/wiki/Jurong_Institute) and [Outram Institute](/wiki/Outram_Institute), moved to its new campus off Bukit Batok West Avenue 3 in January 2007. Bukit Batok is also home to [Singapore Hotel and Tourism Education Centre](/wiki/Singapore_Hotel_and_Tourism_Education_Centre) (SHATEC). ## Recreation The Bukit Batok [swimming complex](/wiki/Swimming_(sport)) is located off East Avenue 6. There are many parks in the neighborhood, including the [Bukit Batok Town Park](/wiki/Bukit_Batok_Town_Park) and the [Bukit Batok Nature Park](/wiki/Bukit_Batok_Nature_Park). The CDANS Bukit Batok Country Club, for reservist members of the Civil Defence forces and their families, was opened in 1998. It offers a golf driving range, swimming pool, bowling alley and sports facilities for relatively affordable prices. The Civil Service Club Bukit Batok Clubhouse offers swimming, bowling and related recreational facilities to civil servants, their families and the public. It is located near Bukit Batok Town Centre and was opened on 1 March 2006. ## Politics The jurisdiction of Bukit Batok is shared by the [Jurong East-Bukit Batok Group Representation Constituency](/wiki/Jurong_East-Bukit_Batok_Group_Representation_Constituency) (Jurong East-Bukit Batok GRC), which has an office at Bukit Batok Central and manages much of Bukit Batok; [Bukit Gombak SMC](/wiki/Bukit_Gombak_SMC) and [Chua Chu Kang Group Representation Constituency](/wiki/Chua_Chu_Kang_Group_Representation_Constituency) (Chua Chu Kang GRC), which manages areas north of Bukit Batok West Avenue 3 and Bukit Batok Central. There are five [members of Parliament](/wiki/Members_of_the_Singapore_Parliament) representing various areas in Bukit Batok. The Bukit Batok SMC was a standalone single-member constituency by itself prior to the [1991 elections](/wiki/1991_Singaporean_general_election), which was later mainly consolidated into [Jurong GRC](/wiki/Jurong_GRC) until being carved out as an SMC in (/wiki/2015_Singaporean_general_election). In (/wiki/2025_Singaporean_general_election), Bukit Batok SMC was again consolidated into a GRC, this time renaming it to Jurong East-Bukit Batok GRC to incorporate the SMC. Its current MPs were Ministers of State [Rahayu Mahzam](/wiki/Rahayu_Mahzam) and [Murali Pillai](/wiki/Murali_Pillai). Previously, Bukit Batok was under the constituent of [Chai Chong Yii](/wiki/Chai_Chong_Yii) when Bukit Batok SMC was formed in 1972, followed by [Ong Chit Chung](/wiki/Ong_Chit_Chung) from 1988 until his death in office in 2008 and fellow Bukit Batok East MP [Halimah Yacob](/wiki/Halimah_Yacob) caretake this area for the time being. [David Ong](/wiki/David_Ong) succeeded the late Ong in 2011, but later vacated in March 2016 pertaining to an affair; Murali, a former branch secretary for Bukit Batok and a member part of the [Aljunied GRC](/wiki/Aljunied_GRC) in 2015, has since represented the area following his [by-election](/wiki/2016_Bukit_Batok_by-election) victory in May 2016. Bukit Gombak was a part of [Chua Chu Kang GRC](/wiki/Chua_Chu_Kang_GRC). Senior Ministers of State [Low Yen Ling](/wiki/Low_Yen_Ling) had been representing there from 2011 to 2025. In 2025, Bukit Gombak became a [SMC](/wiki/Bukit_Gombak_SMC) for the first time since (/wiki/1997_Singaporean_general_election) while most of Hong Kah North was absorbed into either Chua Chu Kang and Jurong East-Bukit Batok GRCs. Currently, Low, [Lee Hong Chuang](/wiki/Lee_Hong_Chuang) (who previously contested [Hougang SMC](/wiki/Hougang_SMC) in the 2015 and 2020 elections) and [Tan See Leng](/wiki/Tan_See_Leng) represent the Bukit Gombak areas following the election. - Media related to Bukit Batok at Wikimedia Commons\n",
  "language": "en",
  "processed_at": "2026-01-12T09:58:34.695229",
  "title": "Bukit Batok",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Bukit_Batok"
}