{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:59:13.933040"
  },
  "content": "Bus depot in Singapore **Bulim Bus Depot** is a [bus depot](/wiki/Bus_station) located along Bulim Avenue in [Jurong West](/wiki/Jurong_West), Singapore. The first bus depot to be built by the [Land Transport Authority](/wiki/Land_Transport_Authority), it serves 30 bus services under the Bulim Bus Package. Since 31 July 2015, the Bulim Bus Depot has been operated by [Tower Transit Singapore](/wiki/Tower_Transit_Singapore). The depot was officially opened by Hong Kah MP [Amy Khor](/wiki/Amy_Khor) on 6 December 2015. The depot accommodates about 500 buses and will be equipped with facilities for daily bus operations, bus maintenance and a rest area for bus drivers. ## History Announced by [Land Transport Authority](/wiki/Land_Transport_Authority) on 23 April 2013, the bus depot will be the first depot that LTA is developing and funding, as part of the review of the enhanced structural assistance that Government is providing the bus industry announced in Committee of Supply (COS) 2012. The depot is intended to accommodate the additional buses that will be brought in over the next few years. On 17 August 2014, part of the depot was opened for parking of SMRT's buses. The operator's existing bus depots and bus park were reaching full capacity, and the new facilities were necessary to support the growing number of buses as the overall bus capacity is progressively increased under the Bus Service Enhancement Programme (BSEP). On 31 July 2015, Land Transport Authority handed over the depot to [Tower Transit Singapore](/wiki/Tower_Transit_Singapore) which then allowed Tower Transit to prepare for its operations early, including fitting out the depot and training its bus captains and technicians. After the handover to the [Tower Transit Singapore](/wiki/Tower_Transit_Singapore), [SMRT Buses](/wiki/SMRT_Buses) remained in the depot until December 2024, when they came to a mutual agreement with [SBS Transit](/wiki/SBS_Transit) to swap their parking spaces in [Soon Lee Bus Depot](/wiki/Soon_Lee_Bus_Depot) and Bulim Bus Depot respectively. This Singapore bus-related article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T09:59:13.932280",
  "title": "Bulim Bus Depot",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Bulim_Bus_Depot"
}