{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:59:19.646450"
  },
  "content": "Plantation-style house in Singapore **Burkill Hall** is a historic bungalow in the [Singapore Botanic Gardens](/wiki/Singapore_Botanic_Gardens). It is the last Anglo-Malayan plantation-style house in the region and possibly in the world. ## History Constructed in 1868 to house the directors of the gardens, the building features broad [verandahs](/wiki/Verandah) and high ceilings to allow for more natural light and ventilation, and was originally known as the Director's House on the grounds of the Gardens, later renamed to Burkill Hall after [Isaac Burkill](/wiki/Isaac_Henry_Burkill) and [Humphrey Burkill](/wiki/Humphrey_Morrison_Burkill). The building was the residence of gardens superintendent Henry James Murton. The bungalow served as the residence of the first scientific director of the gardens, Sir [Henry Nicholas Ridley](/wiki/Henry_Nicholas_Ridley). In 1960, the building was painted both black and white by the [Public Works Department](/wiki/Public_Works_Department_(Singapore)), despite the original building being completely painted in white. In 2013, gardens director [Nigel Paul Taylor](/wiki/Nigel_Paul_Taylor) realised the error while doing research on the history of the bungalow, with all pictures of the building before 1959 showing the building being completely painted in white, and the building itself predating black and white bungalows. The building was subsequently repainted. The building is the last Anglo-Malayan plantation-style house in the region and possibly in the world. 1°18′44″N 103°48′49″E﻿ / ﻿1.31233°N 103.81366°E﻿ / 1.31233; 103.81366 This article about a Singapore building or structure is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T09:59:19.645999",
  "title": "Burkill Hall",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Burkill_Hall"
}