{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:59:23.543061"
  },
  "content": "Parades commemorating the circumcision ceremony of nobility in Kelantan, Malaysia The **Burung Petala Processions** (literary \"Celestial Bird Processions\") ([Malay](/wiki/Malay_language): *Perarakan Burung Petala*; [Jawi](/wiki/Jawi_script): ڤراراكن بوروڠ ڤتالا‎) referred to a series of imperial parades to commemorate the [circumcision](/wiki/Circumcision) ceremony of the [Kelantanese](/wiki/Kelantan) nobility. During the grand cavalcade, the prince and his royal entourage were celebrated around [Kota Bharu](/wiki/Kota_Bharu) via a large bird-like processional cart, notably the [grand chariot](/wiki/Float_(parade)) of 1933 known as **Burung Petala Indra** and *[tandu](/wiki/Litter_(vehicle))* **Burung Petalawati** of 1923. The processions were held three times between 1919 and 1933. ## Origin The celebration is rooted in the historical grand parades observed during the pre-Islamic era of the northern coast of [Malay Peninsula](/wiki/Malay_Peninsula). As noted from the old records from [Chi Tu](/wiki/Chi_Tu), the Chinese ambassador of the kingdom would be paraded under a similar fashion upon their arrival to the city state. This largely originated from the custom that holds every state delegations should be celebrated akin to the return of the gods from their heavenly abode. The kingdom managed to obtained strong diplomatic relationship with ancient China derived from the epic celebrations for its delegations. The birds were mobilised for official use, including during the enthronement of the prince, arrival of state delegations and during royal circumcision celebrations. While not in use, the bird would be nestled in a special chamber, with a courtier delegated with a task of conducting rituals to guard her spirit. There are several variants of the bird in [Pattani](/wiki/Pattani_Province), including *Gagak Suro* (raven), *Karawek* ([kalaviṅka](/wiki/Kalavi%E1%B9%85ka)), *Merak Mas* (golden peacock), [Garuda](/wiki/Garuda) and *Burung Singa* (lion bird). The procession was later recorded in great detail upon the arrival of the British colonial administrator in Kelantan from 1909. ### Malay customary practise In the traditional Malay custom, a child would usually be carried on the shoulder of his dad from his abode to the place where his circumcision will be held. But for the more affluent Malay families, the ceremony would be more lavish, the child would be transported on a processional carrier, in a form of boat or a small mosque-like structure by a group of men, a philosophical correspondence of a [rite of passage](/wiki/Rite_of_passage) from boys to men. More elaborate practise of the celebration would include a march of men with weapons, musical performance and even ceremonial foods being included in the parade. ### Early 20th century Kelantan Based on the record by Ghulam-Sarwar Yousof, it was narrated that the sultan had a dream about the Burung Petala Wati, the traditional guardian of Kelantan. Following the account, he ordered the construction of the mystical [Thunderbird](/wiki/Thunderbird_(cryptozoology)) for his prince. Another version of the origin of Petala Wati denotes a far more secular account, as it was believed that the construction of the ark was mainly to illustrate the grandeur of the Kelantanese monarch and to please the [British colonial resident](/wiki/Resident_(title)) at that time, who were intrigued by the local Malay culture, heritage and [folklore](/wiki/Malay_folklore). ## Construction ### Ornaments The design of the chariot emulated many ornamental figures derived from ancient [Malay mythology](/wiki/Malay_mythology), kingship and the tales from Malay [hikayats](/wiki/Hikayat). Based on the narration by Paul J. Coatalen in his interview with a local Malay Bomoh ([shaman](/wiki/Shaman)) about a parallel Kelantanese imperial vessel, he asserts that the ceremonial vehicle is a symbol of Malay mysticism adopted based upon the legendary promise made between the ancestors of the Kelantan king with a loyal warrior known as Isma Dewa Pekerma Raja. While based on the record between Coatalen and Haji Mubin Sheppard in “Processional Birds Of Kelantan” and “The Giant bird”, he asserted that there was a strong correlation between the [Royal barge](/wiki/Royal_barge) of Pertala Sri Kelantan with the [Hindu](/wiki/Hindu) epics, deriving [Helang](/wiki/Eagle), [Burung Camar Laut](/wiki/Gull), [Garuda](/wiki/Garuda) and [Jentayu](/wiki/Phoenix_(mythology)) as a source of identity and inspiration. This was heavily owed from the fact that the [Malayalised](/wiki/Malayisation) Hindu literature was highly celebrated during the period and the tales of Hikayat Maharaja Wana, Ramayana, Isma Dewa Perkerma Raja were often transmitted into the form of [Malay theater](/wiki/Bangsawan) and [Wayang kulit](/wiki/Wayang_kulit), thus become a norm by the Kelantanese Malay society. Based on Coatalen, despite the design and the name of Hindu mythologies were adopted in the bird art, it doesn't necessary bear any Hindu religious [syncretism](/wiki/Syncretism), instead the adoption was solely for cosmetic factors, he added. ### Assembly It would take three months to build each of the Petala Birds. The last of the birds was built long after the end of the [World War II](/wiki/World_War_II), solely constructed as a display upon the request of the [National Museum of Malaysia](/wiki/Muzium_Negara). The [tandu](/wiki/Litter_(vehicle)) was named Pertala Indra Maha Sakti and completed in 1963, constructed by the son of one of the assistant craftsman that built the earlier royal birds, Mohamed Noor bin Daud (Weh Burong); he was assisted by Awang bin Sulong and under the supervision Ismail Bakti. The resurrected bird was by far dwarfed in comparison of all her predecessors, nonetheless fine details in the woodcraft remains. Being the sole surviving Kelantanese artist with such expertise, it was largely emulated based on the artisan's childhood memory of helping his father constructing the bird. As of 2017, the sculpture is stored in the Kelantan Heritage Trust in [Kota Bharu](/wiki/Kota_Bharu). ### Design #### Petala Indra The Burung Petala Indra of 1933 stands 20 feet tall. It was constructed for Tengku Yunus, a 12-year-old, the third son of the crown prince, Raja Zainal Abidin. Reid, a photographer for The Straits Times Annual in Kelantan noted that several large trees in Kota Bharu have to be removed earlier, in order to maneuver the colossal monument during the celebration. A painted 10 foot square wooded pavilion was erected above colossal bird replica, holding with its [Singgora](/wiki/Singgora)-styled roof. A pair of ornamental [crest](/wiki/Crest_(heraldry)) carved with naga motives are attached onto each [bargeboard](/wiki/Bargeboard) and the roof tiers. The pavilion can carry up to 6 passengers inside. There were many prominent woodcarver involved in the project, including Encik Ismail, the head artisan for Petala Indra and Encik Long, a royal sculptor from the neighbouring [Kingdom of Besut](/wiki/Kingdom_of_Besut). #### Petalawati While the smaller pair of 1923 [tandu](/wiki/Litter_(vehicle)) Petala having a similar pavilion-styled platform with 3 tier [hipped roof](/wiki/Hipped_roof) with a crest. The beak of the replica was painted in gold and her fangs were made from elephant tusk. The bird was seen biting a venomous snake known as Ular Naga Bora that coiled around the bird's neck while her eyes were made from precious stones. The bird's main body was decorated by golden [Tinsel](/wiki/Tinsel) wraps. The fur on her head and neck were tailored from various [velvet](/wiki/Velvet) and [silks](/wiki/Silk), while the feathers on her wings and tail were cast from various glossy papers based on the hue of the rainbows. The bird shiny stood underneath the ray of sun. ### Inspiration There are two conflicting accounts for the identity of the bird, based on the characters in the assemble. #### Hikayat Isma Dewa Many believed that the processional cart was a personification of Sarung Dewa Purba Raksasa, a gigantic bird from the epic Raja Isma Dewa, a local [Kelantanese Malay lore](/wiki/Malaysian_literature). This is supported by the incorporation of a [crowned](/wiki/Crown_(headgear)) white [monkey](/wiki/Monkey) that stood beneath the Burung Petala Wati of 1923, the white monkey itself was a character from Hikayat Isma Dewa, a companion of the heroic character. The function of the monkey was to persuade the young prince to be as brave as his favourite hero in the saga. #### Hikayat Mahabharata Another view traces it to the mythical [garuda](/wiki/Garuda), particularly an account from the [Mahabharata](/wiki/Mahabharata). The act of the bird eating the serpent is a philosophical symbolism of destroying the evil. Based on this understanding, instead of Isma Dewa, the main idol in this version was [Vishnu](/wiki/Vishnu). This notion was largely observed by Haji Mubin Sheppard. ## Procession ### The Grand Parade The day of the [parade](/wiki/Parade) was the highlight of the [month](/wiki/Month) long festival. The carnival lavishly commenced from the [palatial gate](/wiki/Palace) of Kelantan and continued throughout the main avenues of [Kota Bharu](/wiki/Kota_Bharu) to an area known as Batu Peringatan in Padang Bank, passing through various government complex and the residence of other prominent members from the Kelantanese nobility. The grand parade was divided into 38 parts, with some of the performances were held on a moving stage. There are 300 members of the Malay regiment accompanying the chariot, it begins with a unit of speared men from the imperial court who wore black, followed by candlestick bearers wearing a red uniform and a unit of riflemen that would fire [celebratory gunshots](/wiki/Celebratory_gunfire) during the procession. Behind the military contingent was a group of female palatial maids wearing a yellow [shoulder cloth](/wiki/Sash), holding a pedestrial tray with ritualistic yellow [glutinous rice](/wiki/Glutinous_rice) known as *nasi semangat* to strengthen the prince's spirit before the [circumcision](/wiki/Circumcision). The maidens were followed by a royal guards armed with weaponry of [Keris](/wiki/Keris) and [swords](/wiki/Sword), while at their back was a group of maiden carrying a plethora of royal insignias: ceremonial box, handheld fan, silver container, Royal betel box, [incense burner](/wiki/Censer), silver water container and a multitude of other items from the imperial regalia. Following the royal entourage was an open platform of 5 Malay orchestras, staged by a [Menora](/wiki/Menora_(dance)) and [Mak Yong](/wiki/Mak_Yong) performance. While the closed platform behind was occupied by the court dancers, elegantly posed in their classical [Asyik](/wiki/Asyik) and [Joget](/wiki/Joget) costumes. However, in contrast to the preceding Menora and Makyong performers, they do not openly dance during the gala. Behind the court dancers was a [Wayang Kulit](/wiki/Wayang_Kulit) performance and a [Silat](/wiki/Silat) troop. The towering bird came after the performance. The climax of the imperial cavalcade, it ferried the prince together his two younger brothers with a senior religious clerics and the British resident at that time. The princes were seen to be donned under a richly woven ceremonial attire made from silk, they wore fine gold and jewelry with a keris nicely tucked around their waist. The chariot was mobilised by hundreds of men, all reciting the Islamic prayers and [selawat](/wiki/Salawat). The men were all individually selected by their village headman from their respected [kampung](/wiki/Kampung) throughout the kingdom. The entourage ends with a platform for the [percussion](/wiki/Percussion) and the Great Kelantan drum, Known as \"Rebana Besar\". Trailing behind the men was dozens of sons from the noble families of Kelantan and the older relatives of the prince, all were attending to usher the circumcision carnival. ### Developments after 1933 The Burung Petala Indra of 1933 was the last of its kind staged in Kelantan. Following the consultation from the local Kelantanese [ulema](/wiki/Ulema), it was firmly advised that the element of [deviation](/wiki/Shirk_(Islam)) from the Islamic teaching was present in the parade. Hence, following the verdict, all of the birds were destroyed by the authorities. The tradition however, is still survived although is under the verge of extinction across the border in [Pattani](/wiki/Pattani_Province), [Thailand](/wiki/Thailand). It is celebrated by the [Thai Malay](/wiki/Thai_Malay) community in the form of Burong Gagak Suro ([Thai](/wiki/Thai_language): บุหรงฆาเฆาะซูรอ; *Burong Kakosuro*), albeit it is usually celebrated in a smaller scale compared to its historical predecessors. ## Bibliography\n",
  "language": "en",
  "processed_at": "2026-01-12T09:59:23.542615",
  "title": "Burung Petala Processions",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Burung_Petala_Processions"
}