{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:59:26.942328"
  },
  "content": "Building in Singapore **Butterfly House**, also known as **23 Amber Road**, was a unique house, with a convex, semicircular plan, the 'wings' of which gave rise to the 'butterfly' nickname for the house. It is not, in fact, laid out on a true butterfly plan in the more usual [Arts and Crafts](/wiki/Arts_and_Crafts) sense of the name. It was the only historic residence in Singapore to be built using this plan form, and was unique in Southeast Asia. Most of the building, including its iconic curved wings were demolished in 2008 by developers in order to make way for a high-rise residential tower on the site, leaving only a small portion of the street-facing front of the house as a token facade to the generic residential tower behind, losing the part of the structure that gave the house its moniker. ## Description The Butterfly House was two-storeys tall, built in front of the sea and featured a unique plan form set out on a crescent, and featured a semi-circular verandah which was designed to catch the sea breeze. The house also had open verandahs along the entire sea facing side. However, due to [land reclamation](/wiki/Land_reclamation), by 2006, the building was no longer on the seafront. The street-facing front of the house featured a porte cochere, flanked by curving walls, which echoed the butterfly-shaped curved wings on the sea-facing side. ## History The Butterfly House was built in 1912 by Alexander William Cashin and was designed by prominent architect [Regent Alfred John Bidwell](/wiki/Regent_Alfred_John_Bidwell). Cashin then gave the building to his brother-in-law, D. Kitovitz. A proposal to conserve the building was first made in 2005. However, as the building took up almost all of the land within the gates of the house, the conservation building would cause a complete loss of development potential to the owner. In 2006, developers AG Capital lodged an option to buy and develop the site. The [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) gave AG Capital permission for total redevelopment. In response, more than 30 letters were sent to the government in protest of the redevelopment of the site. Several news articles were also written in protest of the demolition of the building. Eventually the development potential of the site was deemed to outweigh the heritage value of the unique historic building, and most of the historic house was demolished in favour of the redvelopment. In 2007, it was announced that the main body of the building, which consisted of the iconic 'wings' would be demolished and replaced by an 18-storey condominium, which would be completed in 2009. The complex would be connected to the remaining parts of the building, which only included the porte cochere and part of the stairwell of the house. The condominium complex was named The Aristo @ Amber.\n",
  "language": "en",
  "processed_at": "2026-01-12T09:59:26.941851",
  "title": "Butterfly House, Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Butterfly_House,_Singapore"
}