{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:59:50.076061"
  },
  "content": "Executive branch of the Singapore governmentThis article is part of a series on[Politics of Singapore](/wiki/Politics_of_Singapore)[Constitution](/wiki/Constitution_of_Singapore) - [Law](/wiki/Law_of_Singapore) - [Human rights](/wiki/Human_rights_in_Singapore) [Legislature](/wiki/Parliament_of_Singapore) - **[Parliament](/wiki/Parliament_of_Singapore)** - [Speaker](/wiki/Speaker_of_the_Parliament_of_Singapore) [Seah Kian Peng](/wiki/Seah_Kian_Peng) ([PAP](/wiki/People%27s_Action_Party)) - [Leader of the House](/wiki/Leader_of_the_House_(Singapore)) [Indranee Rajah](/wiki/Indranee_Rajah) ([PAP](/wiki/People%27s_Action_Party)) - [Leader of the Opposition](/wiki/Leader_of_the_Opposition_(Singapore)) [Pritam Singh](/wiki/Pritam_Singh_(Singaporean_politician)) ([WP](/wiki/Workers%27_Party_(Singapore))) - [14th Parliament](/wiki/14th_Parliament_of_Singapore) - [Constituencies](/wiki/Constituencies_of_Singapore) [Executive](/wiki/Government_of_Singapore#Composition) - **[President of Singapore](/wiki/President_of_Singapore)** ([list](/wiki/List_of_presidents_of_Singapore)) - [Tharman Shanmugaratnam](/wiki/Tharman_Shanmugaratnam) ([I](/wiki/Independent_politician)) - **[Prime Minister of Singapore](/wiki/Prime_Minister_of_Singapore)** - [Lawrence Wong](/wiki/Lawrence_Wong) ([PAP](/wiki/People%27s_Action_Party)) - Cabinet - [Ministries](/wiki/Organisation_of_the_Government_of_Singapore) - [The Reserves](/wiki/Reserves_of_the_Government_of_Singapore) [Judiciary](/wiki/Judicial_system_of_Singapore) - **[Supreme Court of Singapore](/wiki/Supreme_Court_of_Singapore)** - [Chief Justice](/wiki/Chief_Justice_of_Singapore) [Sundaresh Menon](/wiki/Sundaresh_Menon) - **[Court of Appeal](/wiki/Court_of_Appeal_of_Singapore)** - [Prakash](/wiki/Judith_Prakash) - [Tay](/wiki/Tay_Yong_Kwang) - [Chong](/wiki/Steven_Chong) - [Ang](/wiki/Belinda_Ang) - **[High Court](/wiki/High_Court_of_Singapore)** - [State Courts](/wiki/State_Courts_of_Singapore) [Elections](/wiki/Elections_in_Singapore) - [Presidential elections](/wiki/Presidential_elections_in_Singapore) - [General elections](/wiki/General_elections_in_Singapore) Singapore portal - [Other countries](/wiki/Outline_of_political_science#Politics_by_region) - v - t - e The **Cabinet of Singapore** forms the [executive branch](/wiki/Executive_(government)) of the [Government of Singapore](/wiki/Government_of_Singapore) together with the [President](/wiki/President_of_Singapore). It is led by the [Prime Minister](/wiki/Prime_Minister_of_Singapore) who is the [head of government](/wiki/Head_of_government). The Prime Minister is a [Member of Parliament](/wiki/Members_of_the_Singapore_Parliament) (MP) appointed by the president who in the president's judgment is likely to command the confidence of the majority of the [Members of Parliament](/wiki/Members_of_the_Singapore_Parliament) (MPs). The other ministers in the [Cabinet](/wiki/Cabinet_(politics)) are Members of Parliament appointed by the president acting in accordance with the advice of the prime minister. Ministers are prohibited from holding any [office of profit](/wiki/Office_of_profit) and from actively engaging in any commercial enterprise. The Cabinet has the general direction and control of the Government and is [collectively responsible](/wiki/Cabinet_collective_responsibility) to Parliament. It also has significant influence over lawmaking. Ministers may be designated by the prime minister to be in charge of particular [ministries](/wiki/Organisation_of_the_Government_of_Singapore), or as ministers in the [Prime Minister's Office](/wiki/Prime_Minister%27s_Office_(Singapore)). Singapore's ministers are the highest paid in the world. Prior to a salary review in 2011, the prime minister's annual salary was [S$](/wiki/Singapore_dollar)3.07 million, while the pay of ministerial-level officers ranged between S$1.58 million and S$2.37 million. On 21 May 2011, a committee was appointed by the prime minister to review the salaries of the prime minister as well as the president, political appointment holders, and Members of Parliament. Following the recommended wage reductions by the committee which were then debated and subsequently accepted in Parliament, the prime minister's salary was reduced by 36% (includes the removal of his pension) to S$2.2 million. Nonetheless, the prime minister remains the highest-paid political leader in the world. The earliest predecessor of the Cabinet was the Executive Council of the [Straits Settlements](/wiki/Straits_Settlements), introduced in 1877 to advise the [governor of the Straits Settlements](/wiki/List_of_British_Governors_of_the_Straits_Settlements). It wielded no executive power. In 1955, a Council of Ministers was created, made up of three *ex officio* Official Members and six Elected Members of the [Legislative Assembly of Singapore](/wiki/Legislative_Assembly_of_Singapore), appointed by the governor on the recommendation of the [leader of the house](/wiki/Leader_of_the_House_(Singapore)). Following the general elections that year, [David Saul Marshall](/wiki/David_Marshall_(Singaporean_politician)) became the first [Chief Minister of Singapore](/wiki/Chief_Minister_of_Singapore). Constitutional talks between Legislative Assembly representatives and the [Colonial Office](/wiki/Colonial_Office) were held from 1956 to 1958, and Singapore gained full internal self-government in 1959. The governor was replaced by the [Yang di-Pertuan Negara](/wiki/Yang_di-Pertuan_Negara), who had power to appoint to the post of prime minister the person most likely to command the authority of the Assembly, and other ministers of the Cabinet on the prime minister's advice. In the [1959 general elections](/wiki/1959_Singaporean_general_election), the [People's Action Party](/wiki/People%27s_Action_Party) (PAP) swept to power with 43 out of the 51 seats in the Assembly, and [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) became the first prime minister of Singapore. The executive branch of the Government of Singapore remained unchanged following Singapore's [merger with Malaysia](/wiki/Singapore_in_Malaysia) in 1963, and subsequent [independence](/wiki/History_of_the_Republic_of_Singapore#Independence_from_Malaysia) in 1965. ## History Up to the outbreak of [World War II](/wiki/World_War_II), [Singapore](/wiki/Singapore) was part of the [Crown colony](/wiki/Crown_colony) known as the [Straits Settlements](/wiki/Straits_Settlements) together with [Malacca](/wiki/Malacca) and [Penang](/wiki/Penang). The earliest predecessor of the Cabinet was arguably the Executive Council of the Straits Settlements that was introduced in 1877 by [letters patent](/wiki/Letters_patent) issued by [the Crown](/wiki/The_Crown), though its function was very different from that of today's Cabinet. The council, which was composed of \"such persons and constituted in such manner as may be directed\" by royal instructions, existed to advise the [Governor of the Straits Settlements](/wiki/List_of_British_Governors_of_the_Straits_Settlements) and wielded no executive power (including the [Colonial Secretary](/wiki/List_of_chief_secretaries_of_Singapore)). The Governor was required to consult the Executive Council on all affairs of importance unless they were too urgent to be laid before it, or if reference to it would prejudice the public service. In such urgent cases, the Governor had to inform the Council of the measures he had taken. Following the Second World War, the Straits Settlements were disbanded and Singapore became a Crown colony in its own right. The reconstituted Executive Council consisted of six officials and four nominated \"unofficials\". In February 1954, the Rendel Constitutional Commission under the chairmanship of Sir [George William Rendel](/wiki/George_William_Rendel), which had been appointed to comprehensively review the constitution of the Colony of Singapore, rendered its report. Among other things, it recommended that a Council of Ministers be created, composed of three *ex officio* Official Members and six Elected Members of the [Legislative Assembly of Singapore](/wiki/Legislative_Assembly_of_Singapore) appointed by the Governor on the recommendation of the Leader of the House, who would be the leader of the largest political party or [coalition of parties](/wiki/Coalition_government) having majority support in the legislature. The recommendation was implemented in 1955. In the general election held that year, the [Labour Front](/wiki/Labour_Front) took a majority of the seats in the Assembly, and [David Saul Marshall](/wiki/David_Marshall_(Singaporean_politician)) became the first [Chief Minister of Singapore](/wiki/Chief_Minister_of_Singapore). Major problems with the Rendel Constitution were that the Chief Minister and ministers' powers were ill-defined, and that the Official Members retained control of the finance, administration, and internal security and law portfolios. This led to confrontation between Marshall, who saw himself as a prime minister governing the country, and the [Governor](/wiki/Governor_of_Singapore), Sir [John Fearns Nicoll](/wiki/John_Fearns_Nicoll), who felt that important decisions and policies should remain with himself and the Official Members. In 1956, members of the Legislative Assembly held constitutional talks with the [Colonial Office](/wiki/Colonial_Office) in London. The talks broke down as Marshall did not agree to the British Government's proposal for the [casting vote](/wiki/Casting_vote) on a proposed Defence Council to be held by the British High Commissioner to Singapore, who would only exercise it in an emergency. Marshall resigned as Chief Minister in June 1956, and was replaced by [Lim Yew Hock](/wiki/Lim_Yew_Hock). The following year, Lim led another delegation to the UK for further talks on self-government. This time, agreement was reached on the composition of an Internal Security Council. Other constitutional arrangements were swiftly settled in 1958, and on 1 August the [Parliament of the United Kingdom](/wiki/Parliament_of_the_United_Kingdom) passed the State of Singapore Act 1958 ([6 & 7 Eliz. 2](/wiki/6_%26_7_Eliz._2). c. 59 (UK)) granting the colony full internal self-government. Under Singapore's new constitution which came into force on 3 June 1959, the Governor was replaced by the [Yang di-Pertuan Negara](/wiki/Yang_di-Pertuan_Negara) (Head of State), who had power to appoint as prime minister the person most likely to command the authority of the Legislative Assembly, and other ministers of the Cabinet on the prime minister's advice. The Constitution also created the post of the British High Commissioner, who was entitled to receive the agenda of each Cabinet meeting and to see all Cabinet papers. In the [1959 general elections](/wiki/1959_Singaporean_general_election), the [People's Action Party](/wiki/People%27s_Action_Party) (PAP) swept to power with 43 out of the 51 seats in the Assembly, and [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) became the first prime minister of Singapore. Nine other ministers were appointed to the Cabinet. The British High Commissioner's role became that of an [ambassador](/wiki/Ambassador) following Singapore's independence from Britain and [merger with Malaysia](/wiki/Singapore_in_Malaysia) in 1963. Apart from that the executive branch of the Singapore Government remained largely unchanged, although now it governed a state within a larger [federation](/wiki/Federation). However, with effect from 9 August 1965, Singapore left the [Federation of Malaysia](/wiki/Malaysia) and became a fully [independent republic](/wiki/History_of_the_Republic_of_Singapore#Independence_from_Malaysia). On separation from Malaysia, the Singapore Government retained its executive authority, and the executive authority of the [Parliament of Malaysia](/wiki/Parliament_of_Malaysia) ceased to extend to Singapore and vested in the Singapore Government. The [Yang di-Pertuan Agong](/wiki/Yang_di-Pertuan_Agong), the Supreme Head of State of Malaysia, also ceased to be the Supreme Head of Singapore and relinquished his sovereignty, jurisdiction, power and authority, executive or otherwise in respect of Singapore, which revested in the Yang di-Pertuan Negara of Singapore. The Republic of Singapore Independence Act 1965 then vested the executive authority of Singapore in the newly created post of president, and made it exercisable by him or by the Cabinet or by any minister authorized by the Cabinet. ## Structure of government Singapore inherited a [Westminster system](/wiki/Westminster_system) of government from the [British](/wiki/British_Empire). In such systems, there is an overlap between the [executive](/wiki/Executive_(government)) and [legislative branches](/wiki/Legislature) of government. The [head of state](/wiki/Head_of_state), who is the [president of Singapore](/wiki/President_of_Singapore), is a member of both the executive [Government of Singapore](/wiki/Government_of_Singapore) and the [Parliament of Singapore](/wiki/Parliament_of_Singapore) but plays a minimal role in them. Executive power lies in the hands of the [Cabinet](/wiki/Cabinet_(government)), which is made up of the [prime minister of Singapore](/wiki/Prime_Minister_of_Singapore) (the [head of government](/wiki/Head_of_government)) and other ministers. At the same time, the prime minister and ministers are also [Members of Parliament](/wiki/Members_of_the_Singapore_Parliament) (MPs). Following constitutional reforms in 1991, the office of president was transformed from an appointed to an elected post. Thus, both the president and MPs are elected to their posts by the [citizens of Singapore](/wiki/Singaporean_nationality_law) in separate [elections](/wiki/Elections_in_Singapore). ### Appointment of Cabinet The president appoints as prime minister an MP who is likely to command the confidence of the majority of the MPs. In practice, the prime minister is usually the leader of the political party holding the majority of the seats in Parliament. The president also appoints other ministers to the Cabinet from among the MPs, acting in accordance with the prime minister's advice. Any MP, including a [Non-Constituency Member of Parliament](/wiki/Non-Constituency_Member_of_Parliament) (NCMP) or a [Nominated Member of Parliament](/wiki/Nominated_Member_of_Parliament) (NMP), may be appointed a minister. Thus it is possible for a person who was not elected by voters to be appointed by Parliament as an NMP, then by the president as a minister. In 1990, then deputy prime minister [Goh Chok Tong](/wiki/Goh_Chok_Tong) said in Parliament: \"I would rather that a government has the flexibility to appoint the right person to be the minister for finance, than to compel that government to select from whoever is available in the House.\" However, he added that the Government had no intention to appoint a Cabinet minister from among the NMPs at that time. In May 2009, MP [Hri Kumar](/wiki/Hri_Kumar) proposed during a Parliamentary debate that this stand be reconsidered as the prime minister would be able to draw on the experience of many capable Singaporeans. He expressed the view that this would not offend democratic principles. Singapore's Parliamentary system placed more weight on the party in power rather than individual MPs, and \"Parliamentarians must still win the support from the ground and, ultimately, the PM and the ruling party and his Cabinet team will still be answerable to the electorate at elections.\" Critics have commented that adopting the practice would disenchant Singaporeans, deepen the already [parochial](/wiki/Parochialism) political culture, and lead to a lack of accountability and legitimacy. Before entering on the duties of their office, the prime minister and other ministers must take and subscribe (sign) the Oath of Allegiance and an oath for the due execution of their offices before the president. The Oath of Allegiance reads as follows: > I, [*name*], having been appointed to the office of [*name of office*], do solemnly swear [*or* affirm] that I will bear true faith and allegiance to the Republic of Singapore and that I will preserve, protect and defend the [Constitution of the Republic of Singapore](/wiki/Constitution_of_Singapore). The oath for the due execution of the office of prime minister or a minister is as follows: > I, [*name*], being chosen and appointed as Prime Minister [*or* Minister] of Singapore, do solemnly swear [*or* affirm] that I will at all times faithfully discharge my duties as Prime Minister [*or* Minister] according to law, and to the best of my knowledge and ability, without fear or favour, affection or ill-will. Cabinet members are prohibited from holding any [office of profit](/wiki/Office_of_profit) or actively engaging in any commercial enterprise. In addition, they are required to comply with a *Code of Conduct for Ministers*. For example, to counter potential allegations of corruption and unexplained wealth and to avoid potential conflicts between private interests and public responsibilities, the Code requires every minister, upon appointment to office, to disclose in confidence to the president through the prime minister all sources of income other than his salary as a minister and as an MP. This must include all assets, such as financial assets, real property, interests in any company or professional practice, and any other substantial personal assets as well as financial liabilities, including mortgages and borrowings. A Minister must also \"scrupulously avoid any actual or apparent conflict of interest between his office and his private financial interests\". Thus, a minister is not permitted to accept any favour of any kind from persons in negotiation with, or seeking to obtain any licence or enter into any contractual relations with, the Government, or to use official information that comes to him as a minister for his own private profit or the profit of any family member or associate. ### Vacation of office The president must declare the office of prime minister vacant if the prime minister resigns from office, or if the president, acting in his discretion, is satisfied that the prime minister has ceased to command the confidence of a majority of the MPs. In the latter situation, the president is required first to inform the prime minister of his evaluation in this regard, and if the prime minister requests him to, the president may [dissolve Parliament](/wiki/Dissolution_of_parliament) instead of making a declaration of vacancy. A [general election](/wiki/General_election) must be held within three months after the dissolution of Parliament. This gives the former prime minister the opportunity to consolidate support by receiving a fresh mandate at the polls. At present, it is not clear what evidence the president may rely on to be satisfied that the prime minister has ceased to command the confidence of a majority of MPs, as the [Singapore courts](/wiki/Judicial_system_of_Singapore) have not yet had to decide the issue. In the [Sarawak](/wiki/Sarawak) case of *Stephen Kalong Ningkan v. Tun Abang Haji Openg*, decided on provisions similar to those in the Singapore Constitution, the court found that the phrase *ceased to command the confidence of a majority of the Members of Parliament* was a [term of art](/wiki/Technical_terminology) which had to be signified by a formal [vote of no confidence](/wiki/Motion_of_no_confidence) taken by the legislature. In contrast, a [Sabah](/wiki/Sabah) court held in *Datuk Amir Kahar v. Tun Mohd Said bin Keruak, Yang di-Pertua Negeri Sabah* that loss of confidence could be assessed on the basis of evidence other than a legislative vote. This might include, for instance, media reports or letters addressed to the president. Other Cabinet ministers must vacate their office if they resign, or if their appointments are revoked by the president acting in accordance with the advice of the prime minister. People who vacate their office as minister may, if qualified, be subsequently appointed again as a minister. The prime minister and other ministers who make up the Cabinet do not vacate their offices upon a dissolution of Parliament, but continue in their posts until the first sitting of the next Parliament following a general election. ## Responsibilities and remuneration The executive authority of Singapore is vested in the president and is exercisable by him or by the Cabinet of Singapore or any minister authorized by the Cabinet. However, the president normally plays a nominal and largely ceremonial role in the executive branch of government. Although the president acts in his personal discretion in the exercise of certain functions as a check on the Cabinet and Parliament of Singapore, he is otherwise required to act in accordance with the advice of the Cabinet or of a minister acting under the general authority of the Cabinet. It is the Cabinet that has the general direction and control of the Government. As Singapore follows the Westminster system of government, the [legislative](/wiki/Legislation) agenda of Parliament is determined by the Cabinet. At the start of each new [Parliamentary session](/wiki/Legislative_session), the president gives an address prepared by the Cabinet that outlines what the Cabinet intends to achieve in the session. Under the Constitution, the Cabinet is [collectively responsible](/wiki/Cabinet_collective_responsibility) to Parliament. In theory, Parliament acts as a check on the power of the Cabinet as ministers are required to justify their actions and policies upon being questioned by MPs. However, in Singapore this is a weak check because the ruling People's Action Party holds a large Parliamentary majority, and party members who are MPs are required by [party discipline](/wiki/Party_discipline) to vote according to the [party Whip](/wiki/Whip_(politics))'s instructions. The Cabinet may not be summoned except by the authority of the prime minister. As far as is practicable, the prime minister is required to attend and preside at Cabinet meetings, but in his absence he may appoint another minister to preside. Whenever the prime minister is ill, absent from Singapore, or has been granted leave of absence from his duties, the functions conferred on him by the Constitution are exercisable by any other minister authorized by the president. In general, the president must act in accordance with the prime minister's advice in appointing a minister for this purpose. However, the president may act in his own discretion if in his opinion it is impracticable to obtain the advice of the prime minister due to his illness or absence. ### Responsibilities of ministers The prime minister may, by giving written directions, charge any minister with responsibility for any department or subject. In practice, this is done by issuing notifications that are published in the *Government Gazette*. For instance, the Constitution of the Republic of Singapore (Responsibility of senior minister and Co-ordinating Minister for National Security, Prime Minister's Office) Notification 2009 states: > It is hereby notified for general information that, pursuant to Article 30(1) of the Constitution of the Republic of Singapore, the Prime Minister has directed that Mr S. Jayakumar shall, with effect from 1 April 2009, be charged with the responsibility for the following matters: > > (a) national security issues involving or affecting more than one Ministry;(b) Chairmanship of the Security Policy Review Committee;(c) foreign policy issues involving or affecting more than one Ministry; and(d) foreign policy issues which involve legal negotiation or international adjudication, > > and that he shall be designated as Senior Minister and Co-ordinating Minister for National Security. Ministers may be designated by the prime minister to be in charge of particular [ministries](/wiki/Organisation_of_the_Government_of_Singapore), or as ministers in the [Prime Minister's Office](/wiki/Prime_Minister%27s_Office_(Singapore)). Such ministers were formerly known as [ministers without portfolio](/wiki/Minister_without_portfolio). The prime minister may retain any department or subject in his charge. ### Remuneration #### Before 2010 When Singapore gained its independence from Malaysia in 1965, the prime minister's monthly salary was based on that of the chief minister when Singapore was still a British colony, and was fixed at [S$](/wiki/Singapore_dollar)3,500 (equivalent to $14,867 in 2022). The monthly salary was not adjusted until 1973, when ministerial pay was revised and the prime minister's salary was increased to S$9,500 (equivalent to $40,353 in 2022) a month. The justification given by then prime minister [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) was to help select new leaders amidst a better economic position. In 1994, then prime minister [Goh Chok Tong](/wiki/Goh_Chok_Tong) received a monthly salary of nearly S$96,000 (equivalent to $407,773 in 2022, about S$1.15 million a year), while other ministers earned about S$48,900 (equivalent to $207,710 in 2022, about S$586,800 a year). This made them among the highest paid government ministers in the world. In October that year, the Government issued a [white paper](/wiki/White_paper#Government_white_papers) entitled *Competitive Salaries for Competent & Honest Government* which proposed that the salaries of ministers and [civil servants](/wiki/Singapore_Civil_Service) be pegged at two-thirds the average principal earned income of the top four earners in six professions: accounting, banking, engineering, law, local manufacturing firms and multinational corporations. These professions were chosen because their top members had general management skills which ministers also had to have. According to the white paper, the one-third \"discount\" would be \"a visible demonstration of the sacrifice involved in becoming a minister\". Although \"[s]alaries should never be the motivation for persons to become ministers\", the financial sacrifice had to be minimized if outstanding and committed Singaporeans were to be encouraged to take on the \"risks and public responsibilities of a political career\". The benchmark would also be used to determine the pay of the president, prime minister, deputy prime minister, Attorney-General, Chairman of the [Public Service Commission](/wiki/Public_Service_Commission_(Singapore)) and judges. Following Parliamentary approval of the white paper in November 1994, the Government established an independent panel to examine the benchmark for the prime minister's salary. The panel's report, released in January 1995, recommended that the benchmark be about $1.6 million a year, but said it would be reasonable for the prime minister to be paid $2.4 million in view of his heavy responsibilities. The Government said that in three years it planned to raise the pay of the prime minister to $1.46 million and that of ministers to 60% of the benchmark, and in the \"longer term\" to $1.6 million and two-thirds of the benchmark respectively. In February 1996, it was reported that a survey of 19 countries by the [World Economic Forum](/wiki/World_Economic_Forum) magazine *World Link* had found that political leaders and senior civil servants of Singapore had the highest salaries.[*citation needed*] The pay of the Singapore prime minister (S$1.1 million, or US$812,858) was almost five times the average pay of the chief political executives of the nations surveyed (US$168,291). Senior civil servants were paid US$292,714, almost three times their counterparts' average pay. In August 2000, in view of the Singapore economy's growth of almost 10% led by a rapid increase in exports, the salary of the prime minister was increased by 14% and those of other ministers by 12%. In response to public disquiet, Goh Chok Tong said that, spread across the population, the rises amounted to about $11 per person, equivalent to \"about five plates of [char kway teow](/wiki/Char_kway_teow) [fried noodles with [cockles](/wiki/Cockle_(bivalve))] per Singaporean\". Subsequently, in late 2001, when Singapore experienced its [worst recession in a generation](/wiki/Early_2000s_recession), ministerial pay was reduced by more than 17%. Nonetheless, it was reported that the prime minister still earned a gross annual salary of about $1.03 million before the variable component was taken into account. In April 2007, the prime minister's annual salary increased to S$3.1 million ([US$](/wiki/United_States_dollar)2.05 million), about five times that of the then [president of the United States](/wiki/President_of_the_United_States) [George W. Bush](/wiki/George_W._Bush) who earned US$400,000. The annual entry-level salary for ministers increased from $1.2 million to $1.6 million, and was projected to rise to 88% of the private sector benchmark by the end of 2008. Almost half of ministers' pay packages was made up of an individual performance bonus decided by the prime minister, and a variable bonus component based on the country's prevailing [gross domestic product](/wiki/Gross_domestic_product) and capped at eight months of each minister's annual salary. The pay increases were justified by the Government on the grounds that the salaries had to keep pace with those in the private sector to attract the best talent and to avoid corruption. [Teo Chee Hean](/wiki/Teo_Chee_Hean), the then [Minister for Defence](/wiki/Ministry_of_Defence_(Singapore)) and minister in charge of the civil service, was reported as saying: \"We don't want pay to be the reason for people to join [the government]. But we also don't want pay to be the reason for them not to join us, or to leave after joining us.\" The increases sparked much debate both in and out of Parliament, with many people seeing ministerial pay as already being too high. During a Parliamentary debate on the issue, then [Nominated Member of Parliament](/wiki/Nominated_Member_of_Parliament) [Thio Li-ann](/wiki/Thio_Li-ann) said: \"It would be a sad indictment of my generation if no one came forward to serve without excessive monetary inducement, as to be bereft of deep convictions is to be impoverished indeed.\" On 11 April 2007, then prime minister [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) told Parliament: \"To make it quite clear why I am doing this, and also to give me the moral standing to defend this policy with Singaporeans, I will hold my own salary at the present level for five years. The government will pay me my full salary, because that is the way the system will have to work, but for five years, whatever the increase in the salary above its present level, I will donate to suitable good causes.\" The following day, it was clarified that the Prime Minister had decided to do so a while ago, and that he had not been influenced by pressure arising from the announcement of the ministerial pay rise. In 2008, the annual salary for entry-level ministers was $1,924,300. In view of the [worsening economic crisis in 2008–2009](/wiki/Late_2000s_recession_in_Asia#Singapore), as of January 2009 the prime minister's salary was cut to $3.04 million, while the pay of ministerial-grade officers was reduced by 18% to $1.57 million. In November 2009, the Public Service Division announced that pay increments would be deferred for a second time in 2010 because of the uncertain economic recovery. A minister's 2009 salary of $1,494,700 per year was therefore 22% lower than the salary received in 2008. #### 2011 review As at 31 December 2010, the remuneration of ministers depended on which ministerial grade – from the lowest to the highest, MR4, MR3, MR2 or MR1 – they were at. Each minister's pay package was made up of fixed components (a monthly salary for 12 months, a non-pensionable annual allowance of one month's salary, a special allowance of one month's salary, and a public service leadership allowance of two months' salary) and variable components (an annual variable component, a performance bonus, and a [gross domestic product](/wiki/Gross_domestic_product) (GDP) bonus). The annual variable component of up to one and a half-month's salary was paid based on Singapore's economic performance. In years where economic performance was exceptional, a special variable payment was also made. Each minister's performance bonus was determined by the prime minister and could be up to 14 months' salary, though most good performers received the equivalent of nine months' salary. The GDP bonus depended on the nation's GDP growth rate. No bonus was paid if the rate was below 2%, and a maximum bonus of eight months' salary was paid if the rate was 10% or greater. In addition, ministers received the same medical benefits as civil servants. In 2010, the benchmark annual remuneration for an MR4-grade minister was $2,598,004, while the actual salary paid was $1,583,900. An MR1-grade minister's salary was $2,368,500. The annual pay of the prime minister was set at a fixed ratio to the MR4 salary, and was $3,072,200 in 2010. This included a fixed service bonus in lieu of a performance bonus since there was no one to assess the prime minister's individual performance. The fixed service bonus was the same as the performance bonus paid to a good performer at the MR4 grade. On 21 May 2011, following the [2011 general election](/wiki/2011_Singaporean_general_election), the prime minister announced that a committee would be appointed to review politicians' remuneration, and that revised salaries would take effect from that date. The committee to Review Ministerial Salaries, then chaired by [Gerard Ee](/wiki/Gerard_Ee) rendered its report on 30 December 2011, and released it to the public on 4 January 2012. As regards ministerial pay, the Committee recommended benchmarking an MR4-grade minister's salary to the [median income](/wiki/Median_income) of the top 1,000 wage earners who are [Singapore citizens](/wiki/Singaporean_nationality_law), with a 40% discount \"to signify the sacrifice that comes with the ethos of political service\". It also recommended removing the special allowance and public service leadership allowance; capping performance bonuses at six months' salary (with good performers generally receiving three months' salary); and replacing the GDP bonus with a national bonus based on four equally weighted indicators: the real [median income](/wiki/Median_income) growth rate (that is, the growth rate taking [inflation](/wiki/Inflation) into account), the real growth rate of the incomes of the lowest 20th [percentile](/wiki/Percentile) earners, the [unemployment rate](/wiki/Unemployment#Measurement), and the [real GDP](/wiki/Real_gross_domestic_product) growth rate. As regards the latter, no bonus will be paid if the minimum targets for the indicators are not met. A bonus of three months' salary will be paid if the targets are met, and a maximum bonus of six months' salary if the targets are greatly exceeded. This would result in a reduction of an M4-grade minister's annual salary by 31% of the 2010 figure to $1.1 million. Where the prime minister's remuneration was concerned, the Committee recommended that it be pegged to twice of a MR4-grade minister's salary and doing away with the fixed service bonus. Instead, the prime minister will receive a larger national bonus. His annual bonus where the targets for the indicators have been met will be six months' salary, and 12 months' salary where they have been greatly exceeded. This will lead to a reduction in the prime minister's annual salary of 28% to $2.2 million (about US$1.7 million). Lee Hsien Loong said that he accepted the committee's recommendations. He remains the best-paid head of government in the world, his proposed annual pay package exceeding that of the then [Chief Executive of Hong Kong](/wiki/Chief_Executive_of_Hong_Kong) [Sir Donald Tsang](/wiki/Sir_Donald_Tsang), the political leader with the second-highest salary in the world (around US$550,000), by about three times; and that of then [president of the United States](/wiki/President_of_the_United_States) [Barack Obama](/wiki/Barack_Obama) (US$400,000) by over four times. The committee's report was discussed in Parliament from 16 to 18 January 2012. Setting out the position of the [Workers' Party](/wiki/Workers%27_Party_of_Singapore), [Chen Show Mao](/wiki/Chen_Show_Mao) said that the basic monthly salary of an MP should be $11,000, the pay of an MX9-grade director in the Management Executive Scheme of the Civil Service. A minister should be paid five times this sum ($55,000), and the prime minister nine times ($99,000). then NCMP [Gerald Giam](/wiki/Gerald_Giam) said that ministers should obtain an average annual bonus of three months of their base salaries, and in any case no more than five months' bonus. Two-thirds of the bonus should be made up of the national bonus, and the remaining third based on the individual's performance, which should be determined according to [key performance indicators](/wiki/Performance_indicator) fixed for each ministry at the start of a new government's term. Moreover, only a portion of bonuses should be paid at the end of each year. Payment of the remainder should be deferred until the end of the government's term. If the minister's performance is poor, some of the withheld bonus should be [clawed back](/wiki/Clawback). The WP's proposal was criticized by a number of PAP MPs. Then senior Minister of State for Health [Amy Khor](/wiki/Amy_Khor) expressed the view that \"[p]olitical service is much more than public service. Civil servants are not subject to the votes of citizens nor do they need to carry the ground in policymaking. ... Pegging ministerial salaries to civil service salaries is not an adequate mechanism to account for the burdens and responsibilities that come with the job.\" Rounding up the debate, then deputy prime minister Teo Chee Hean said that under the WP's proposal for calculating ministerial salaries, the quantum achieved was similar to the sum proposed by the committee, and that in his view the WP had approved the three principles of the new system: the requirement for the pay to be competitive, recognition of the ethos of political service, and the desirability of a \"clean wage\" system (that is, one in which ministers do not receive additional benefits such as housing and medical allowances). PAP MPs then voted to endorse the committee's proposals. On 26 March 2012, the Public Service Division of the Prime Minister's Office announced that the fixed component of the salary of a political appointment holder would be 13 months of their monthly salary. For 2011, the annual variable component of the salary would be 1.25 months plus $250, while the national bonus would be 2.625 months though appointment holders would receive a [pro rata](/wiki/Pro_rata) amount of 1.618 months' pay as the new salaries took effect from 21 May 2011 when the Cabinet was appointed following the general election. The targets for the four indicators making up the national bonus were 2–3% for real median income growth of citizens and real median income growth for the lowest 20th percentile of citizens, 3–5% for real GDP growth, and not more than 4.5% for the unemployment rate of citizens. Each appointment holder's performance bonus would be determined by the prime minister. #### Pensions At present, persons who have reached the age of 50 years and retired as MPs and who have served in this capacity for not less than nine years may be granted a [pension](/wiki/Pension) for the rest of their lives. The annual amount payable is 1⁄30 of the person's highest annual salary for every completed year of service and 1⁄360 for every uncompleted year, up to a ceiling of two-thirds of the Member's annual salary. In addition, a retired MP who is at least 50 years old and has for not less than eight years held the office of prime minister, deputy prime minister, [senior minister](/wiki/Senior_Minister_of_Singapore) or minister may receive an additional pension each year of 1⁄27 of their highest annual salary for each completed year of service and 1⁄324 for each uncompleted year, subject again to a ceiling of two-thirds of the office-holder's annual salary. Members who have reached the age of 55 years and have served not less than eight years as ministers may be granted a pension even if they have not yet ceased to hold office. No person has an absolute right to compensation for past services or to any pension or gratuity, and the president may reduce or withhold pensions and gratuities upon an MP's conviction for corruption. The committee to Review Ministerial Salaries recommended that pensions for political appointment holders be abolished in favour of [Central Provident Fund](/wiki/Central_Provident_Fund) payments. Appointment holders appointed on and after 21 May 2011 will not receive any pension, while those appointed before that date will only be eligible for pensions accrued up to that date. Such pensions will be paid after they step down or retire from office. If the removal of pensions is taken into account, the prime minister's annual salary will be reduced from the 2010 figure by 36%, and that of MR4-grade ministers by 37%. ## Current cabinet The cabinet was sworn in on 23 May 2025. The Second Lawrence Wong Cabinet is composed of the following members. Cabinet of Singapore PortfolioMinisterPortraitSince[Prime Minister](/wiki/Prime_Minister_of_Singapore)[Lawrence **Wong**](/wiki/Lawrence_Wong)15 May 2024[Minister for Finance](/wiki/Minister_for_Finance_(Singapore))15 May 2021[Senior Minister](/wiki/Senior_Minister_of_Singapore)[**Lee** Hsien Loong](/wiki/Lee_Hsien_Loong)15 May 2024[Deputy Prime Minister](/wiki/Deputy_Prime_Minister_of_Singapore)[**Gan** Kim Yong](/wiki/Gan_Kim_Yong)15 May 2024[Minister for Trade and Industry](/wiki/Minister_for_Trade_and_Industry_(Singapore))15 May 2021[Coordinating Minister for National Security](/wiki/Coordinating_Minister_for_National_Security_(Singapore))[K. **Shanmugam**](/wiki/K._Shanmugam)23 May 2025[Minister for Home Affairs](/wiki/Minister_for_Home_Affairs_(Singapore))1 October 2015Coordinating Minister for Public Services[**Chan** Chun Sing](/wiki/Chan_Chun_Sing)23 May 2025[Minister for Defence](/wiki/Minister_for_Defence_(Singapore))[Coordinating Minister for Social Policies](/wiki/Coordinating_Minister_for_Social_Policies_(Singapore))[**Ong** Ye Kung](/wiki/Ong_Ye_Kung)23 May 2025[Minister for Health](/wiki/Minister_for_Health_(Singapore))15 May 2021[Minister for Foreign Affairs](/wiki/Minister_for_Foreign_Affairs_(Singapore))[Vivian **Balakrishnan**](/wiki/Vivian_Balakrishnan)1 October 2015[Minister for Sustainability and the Environment](/wiki/Minister_for_the_Environment_and_Water_Resources_(Singapore))[Grace **Fu** Hai Yen](/wiki/Grace_Fu)27 July 2020Minister-in-charge of Trade Relations18 January 2024[Minister for Digital Development and Information](/wiki/Ministry_of_Digital_Development_and_Information)[Josephine **Teo**](/wiki/Josephine_Teo)15 May 2021[Minister-in-Charge of the Smart Nation Initiative](/wiki/Smart_Nation)[Minister-in-Charge of Cybersecurity](/wiki/Cyber_Security_Agency_(Singapore))[Minister for Social and Family Development](/wiki/Ministry_of_Social_and_Family_Development)[**Masagos** Zulkifli](/wiki/Masagos_Zulkifli)27 July 2020[Minister for Education](/wiki/Minister_for_Education_(Singapore))[Desmond **Lee** Ti-Seng](/wiki/Desmond_Lee_(Singaporean_politician))23 May 2025Minister-in-charge of Social Service Integration27 July 2020[Minister in the Prime Minister's Office](/wiki/Prime_Minister%27s_Office_(Singapore))[**Indranee** Thurai Rajah](/wiki/Indranee_Rajah)1 May 2018[Second Minister for Finance](/wiki/Minister_for_Finance_(Singapore))[Second Minister for National Development](/wiki/Minister_for_National_Development_(Singapore))27 July 2020[Minister for Law](/wiki/Minister_for_Law_(Singapore))[Edwin Charles **Tong** Chun Fai](/wiki/Edwin_Tong)23 May 2025[Second Minister for Home Affairs](/wiki/Minister_for_Home_Affairs_(Singapore))[Minister for Manpower](/wiki/Minister_for_Manpower_(Singapore))[**Tan** See Leng](/wiki/Tan_See_Leng)15 May 2021Minister-in-charge of Energy and Science & Technology23 May 2025[Minister for National Development](/wiki/Minister_for_National_Development_(Singapore))[**Chee** Hong Tat](/wiki/Chee_Hong_Tat)23 May 2025[Acting Minister for Culture, Community and Youth](/wiki/Ministry_of_Culture,_Community_and_Youth)[David **Neo** Chin Wee](/wiki/David_Neo)23 May 2025[Acting Minister for Transport](/wiki/Minister_for_Transport_(Singapore))[Jeffrey **Siow** Chen Siang](/wiki/Jeffrey_Siow)23 May 2025[Acting Minister-in-Charge of Muslim Affairs](/wiki/Minister-in-Charge_of_Muslim_Affairs) [Senior Minister of State for Home Affairs](/wiki/Minister_for_Home_Affairs_(Singapore))[Muhammad Faishal **Ibrahim**](/wiki/Muhammad_Faishal_Ibrahim)23 May 2025 ## Timeline of members The following is a list of the members of the Cabinet of Singapore since the [1959 Singaporean general election](/wiki/1959_Singaporean_general_election). Members ranked first have held either the office of [prime minister](/wiki/Prime_Minister_of_Singapore), [deputy prime minister](/wiki/Deputy_Prime_Minister_of_Singapore), [senior minister](/wiki/Senior_Minister_of_Singapore) or principal cabinet portfolios ([finance](/wiki/Ministry_of_Finance_(Singapore)#Ministers), [defence](/wiki/Ministry_of_Defence_(Singapore)#Ministers), [foreign affairs](/wiki/Ministry_of_Foreign_Affairs_(Singapore)#Ministers) and [home affairs](/wiki/Ministry_of_Home_Affairs_(Singapore)#Ministers)). This list excludes [ministers of state](/wiki/Ministers_of_state) and [parliamentary secretaries](/wiki/Parliamentary_secretary). - **1st Cabinet** (formed June 1959): Lee Kuan Yew **(PM)**, [Toh Chin Chye](/wiki/Toh_Chin_Chye) **(DPM)**, [Goh Keng Swee](/wiki/Goh_Keng_Swee), [Ong Pang Boon](/wiki/Ong_Pang_Boon) - **2nd Cabinet** (formed October 1963): Lee Kuan Yew, Toh Chin Chye, Goh Keng Swee, [Lim Kim San](/wiki/Lim_Kim_San) **(S)**, [S. Rajaratnam](/wiki/S._Rajaratnam) **(S)** - **3rd Cabinet** (formed April 1968): Lee Kuan Yew, Goh Keng Swee, S. Rajaratnam, Ong Pang Boon, [Hon Sui Sen](/wiki/Hon_Sui_Sen) **(S)**, [Wong Lin Ken](/wiki/Wong_Lin_Ken) **(S)** - **4th Cabinet** (formed September 1972): Lee Kuan Yew, Goh Keng Swee **(DPM)**, S. Rajaratnam, Hon Sui Sen, [Edmund W. Barker](/wiki/Edmund_W._Barker), [Chua Sian Chin](/wiki/Chua_Sian_Chin) **(S)** - **5th Cabinet** (formed December 1976): Lee Kuan Yew, Goh Keng Swee, S. Rajaratnam **(DPM)**, Hon Sui Sen, Chua Sian Chin, [Howe Yoon Chong](/wiki/Howe_Yoon_Chong) **(S)**, [S. Dhanabalan](/wiki/S._Dhanabalan) **(S)** - **6th Cabinet** (formed January 1981): Lee Kuan Yew, Goh Keng Swee, S. Rajaratnam, Hon Sui Sen **(†)**, Chua Sian Chin, Howe Yoon Chong, S. Dhanabalan, Goh Chok Tong **(S)**, [Tony Tan](/wiki/Tony_Tan) **(S)** - **7th Cabinet** (formed January 1985): Lee Kuan Yew, Goh Chok Tong **(DPM)**, Ong Teng Cheong **(DPM)**, S. Rajaratnam **(SM)**, S. Dhanabalan, Tony Tan, [S. Jayakumar](/wiki/S._Jayakumar_(Singaporean_politician)), [Richard Hu](/wiki/Richard_Hu) **(S)** - **8th Cabinet** (formed September 1988): Lee Kuan Yew, Goh Chok Tong, Ong Teng Cheong, S. Jayakumar, Richard Hu, [Wong Kan Seng](/wiki/Wong_Kan_Seng) - **9th Cabinet** (formed November 1990): Goh Chok Tong **(PM)**, Lee Kuan Yew **(SM)**, Ong Teng Cheong, Lee Hsien Loong **(DPM)**, S. Jayakumar, Richard Hu, Wong Kan Seng, [Yeo Ning Hong](/wiki/Yeo_Ning_Hong) **(S)** - **10th Cabinet** (formed September 1991): Goh Chok Tong, Lee Kuan Yew, Ong Teng Cheong, Lee Hsien Loong, Tony Tan **(DPM)**, S. Jayakumar, Richard Hu, Wong Kan Seng, Yeo Ning Hong, [Lee Boon Yang](/wiki/Lee_Boon_Yang) **(S)** - **11th Cabinet** (formed January 1997): Goh Chok Tong, Lee Kuan Yew, Lee Hsien Loong, Tony Tan, S. Jayakumar, Richard Hu, Wong Kan Seng - **12th Cabinet** (formed November 2001): Goh Chok Tong, Lee Kuan Yew, Lee Hsien Loong, Tony Tan, S. Jayakumar, Wong Kan Seng, [Teo Chee Hean](/wiki/Teo_Chee_Hean) **(S)** - **13th Cabinet** (formed August 2004): Lee Hsien Loong **(PM)**, Goh Chok Tong **(SM)**, Lee Kuan Yew **(MM)**, Tony Tan, S. Jayakumar **(DPM)**, Wong Kan Seng, Teo Chee Hean, [George Yeo](/wiki/George_Yeo) - **14th Cabinet** (formed May 2006): Lee Hsien Loong, Goh Chok Tong, Lee Kuan Yew, Teo Chee Hean **(DPM)**, Wong Kan Seng **(DPM)**, S. Jayakumar **(SM)**, George Yeo **(L)**, [Tharman Shanmugaratnam](/wiki/Tharman_Shanmugaratnam) **(S)**, [K. Shanmugam](/wiki/K._Shanmugam) **(S)** - **15th Cabinet** (formed May 2011): Lee Hsien Loong, Teo Chee Hean, Tharman Shanmugaratnam **(DPM)**, K. Shanmugam, [Ng Eng Hen](/wiki/Ng_Eng_Hen) - **16th Cabinet** (formed September 2015): Lee Hsien Loong, [Heng Swee Keat](/wiki/Heng_Swee_Keat) **(DPM)**, Teo Chee Hean **(SM)**, Tharman Shanmugaratnam **(SM)**, K. Shanmugam, Ng Eng Hen, [Vivian Balakrishnan](/wiki/Vivian_Balakrishnan) - **17th Cabinet** (formed July 2020): Lee Hsien Loong, Heng Swee Keat, [Lawrence Wong](/wiki/Lawrence_Wong) **(DPM)**, Teo Chee Hean, Tharman Shanmugaratnam **(R)**, K. Shanmugam, Ng Eng Hen, Vivian Balakrishnan - **18th Cabinet** (formed May 2024): Lawrence Wong **(PM)**, Lee Hsien Loong **(SM)**, Heng Swee Keat, [Gan Kim Yong](/wiki/Gan_Kim_Yong) **(DPM)**, Teo Chee Hean, K. Shanmugam, Ng Eng Hen, Vivian Balakrishnan - **19th Cabinet** (formed May 2025): Lawrence Wong, Lee Hsien Loong, Gan Kim Yong, K. Shanmugam, Vivian Balakrishnan, [Chan Chun Sing](/wiki/Chan_Chun_Sing) Notes: - **(PM)**: Appointed prime minister - **(DPM)**: Appointed deputy prime minister - **(SM)**: Appointed senior minister - **(MM)**: Appointed minister mentor - **(S)**: Appointed via cabinet reshuffle - **(L)**: Lost re-election - **(R)**: Resigned from office - **(†)**: Died in office - [Cabinet (government)](/wiki/Cabinet_(government)) - [Government of Singapore](/wiki/Government_of_Singapore) - [Parliament of Singapore](/wiki/Parliament_of_Singapore) ## Notes ### Citations ### Sources ### Books - Chan, Helena H[ui-]M[eng] (1995), \"The Executive\", *The Legal System of Singapore*, Singapore: [Butterworths Asia](/wiki/LexisNexis_Butterworths), pp. 22–29, [ISBN](/wiki/ISBN_(identifier)) 978-0-409-99789-7. - [Jennings, Ivor](/wiki/Ivor_Jennings) (1980), *Cabinet Government* (3rd ed.), Cambridge: [Cambridge University Press](/wiki/Cambridge_University_Press), [ISBN](/wiki/ISBN_(identifier)) 978-0-521-09570-9. - Quah, John S.T. (2003), \"Paying for the 'Best and Brightest': Reward for High Public Office in Singapore\" (PDF), in [Hood, Christopher](/wiki/Christopher_Hood); Peters, B. Guy; Lee, Grace O.M. (eds.), *Reward for High Public Office: Asian and Pacific Rim States [Routledge research in comparative politics; 3]*, London: [Routledge](/wiki/Routledge), pp. 145–162, [ISBN](/wiki/ISBN_(identifier)) 978-0-415-30349-1, archived from the original (PDF) on 13 July 2011. - Tan, Kevin Y L; Thio, Li-ann (1997), \"The Executive\", *Tan, Yeo & Lee's Constitutional Law in Malaysia and Singapore* (2nd ed.), Singapore: Butterworths Asia, pp. 181–243, [ISBN](/wiki/ISBN_(identifier)) 978-0-409-99908-2. - Thio, Li-ann (1995), \"Government and the State\", *ASEAN Legal Systems* (PDF), Singapore: Butterworths Asia for the [ASEAN](/wiki/Association_of_Southeast_Asian_Nations) Law Association, [ISBN](/wiki/ISBN_(identifier)) 978-0-409-99802-3. ### News reports - Ong, Andrea (6 January 2012), \"What price a minister? 42 years of controversy\", *The Straits Times*, pp. A26 – A27. - Official website of the Cabinet of Singapore - Appointments to the Cabinet of Singapore - Official website of the Government of Singapore\n",
  "language": "en",
  "processed_at": "2026-01-12T09:59:50.075634",
  "title": "Cabinet of Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Cabinet_of_Singapore"
}