{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:59:52.905137"
  },
  "content": "Singapore-based healthcare technology company **A major contributor to this article appears to have a close connection with its subject.** It may require cleanup to comply with Wikipedia's content policies, particularly neutral point of view. Please discuss further on the talk page. *(March 2025)* *(Learn how and when to remove this message)* **Cadi Scientific** is a [Singapore](/wiki/Singapore)-based healthcare [technology company](/wiki/Technology_company) that develops and markets wireless sensing and tracking devices base on active [Radio-frequency identification](/wiki/Radio-frequency_identification) (RFID) technology for [healthcare](/wiki/Healthcare) institutions. Cadi Scientific is known in the Singapore Healthcare market for its Cadi SmartSense System that is designed for tracking patients' real-time locations for automating workflow as well as monitoring patients' temperatures automatically to reduce nurses' workload. ## Wireless temperature monitoring technology Using Active RFID technology, the company developed its flagship ThermoSensor, a coin-sized battery-powered temperature sensor, to wirelessly measure body temperatures in a hospital setting. The ThermoSensor revolutionizes the way body temperatures are measured. Several clinical trials had been conducted in hospitals (including [Singapore General Hospital](/wiki/Singapore_General_Hospital), [Tan Tock Seng Hospital](/wiki/Tan_Tock_Seng_Hospital), [KK Women's and Children's Hospital](/wiki/KK_Women%27s_and_Children%27s_Hospital), [Tuen Mun Hospital](/wiki/Tuen_Mun_Hospital) and [Union Hospital](/wiki/Union_Hospital_(Hong_Kong))) successfully. The complete system named Cadi SmartSense Wireless Temperature Monitoring System had obtained the medical CE certification and U.S. [Food and Drug Administration](/wiki/Food_and_Drug_Administration) (FDA) clearance. ## Location tracking technology As the ThermoSensor was built based on RFID technology, the sensor was later customized into a 2-in-1 tag for [Tan Tock Seng Hospital](/wiki/Tan_Tock_Seng_Hospital) to be used also for patient location tracking. [Tan Tock Seng Hospital](/wiki/Tan_Tock_Seng_Hospital) is the first hospital that has operationally deployed the system on all 1200 inpatients in Dec 2006 for patient location tracking. The hospital then extended the system for both wireless temperature monitoring and location tracking on all inpatients since December 2008 after the detailed successful clinical trial. A variation of the active RFID tags were also deployed in the largest hospital in Singapore, [Singapore General Hospital](/wiki/Singapore_General_Hospital), for enterprise-wide patient location tracking only. The hospital deployed the location tracking system operationally for all 1600 inpatients integrated with [Allscripts](/wiki/Allscripts) Patient Flow solution in May 2009 to optimize bed management process from admission to discharge. The real-time location system was deployed in [Sengkang General Hospital](/wiki/Sengkang_General_Hospital) for central asset management. ## Tag-to-tag communication technology Using state-of-the-art active RFID tag-to-tag communication technology, another variation of the active RFID tags allows infant-mother and infant-cot matching. Prince Court Medical Centre, [Thomson Medical Centre](/wiki/Thomson_Medical_Centre), [Bangkok Hospital](/wiki/Bangkok_Hospital), [Singapore General Hospital](/wiki/Singapore_General_Hospital), [KK Women's and Children's Hospital](/wiki/KK_Women%27s_and_Children%27s_Hospital), [Gleneagles Hospital](/wiki/Gleneagles_Hospital), and Gleneagles Hospital Hong Kong were the first few hospitals that deployed the Cadi SmartSense RFID Infant Safety system to ensure that the right mother is matched to the right baby and/or right baby is put into the right cot. The system is also deployed for tracking everyone in the [Singapore](/wiki/Singapore) [National Centre for Infectious Diseases](/wiki/National_Centre_for_Infectious_Diseases) for contact tracing and hand hygiene monitoring. ## Board of directors Chairman of Cadi Scientific is Professor [Bernard Tan](/wiki/Bernard_Tan_(composer)) Tiong Gie. The board of directors consists of Professor [Bernard Tan](/wiki/Bernard_Tan_(composer)) Tiong Gie, Dr Goh Zenton, Mr Neo Sian Sheng, Mr Ng Hon Cheong, Dr Lim Soh Min, Dr Henry Cheng, Mr Bobby Lim and Mr William Crothers. - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T09:59:52.904682",
  "title": "Cadi Scientific",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Cadi_Scientific"
}