{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:59:59.912533"
  },
  "content": "Place in Singapore **Caldecott Hill** is a private housing estate, located along [Thomson Road](/wiki/Thomson_Road,_Singapore) in the [Central Region](/wiki/Central_Region,_Singapore) of Singapore. The estate is served by [Caldecott MRT station](/wiki/Caldecott_MRT_station), on both the [Circle](/wiki/Circle_Line_(Singapore)) and [Thomson-East Coast](/wiki/Thomson%E2%80%93East_Coast_Line) MRT lines. ## Background ### Etymology Caldecott Hill is named after respected British colonial administrator and former [Governor of Hong Kong](/wiki/Governor_of_Hong_Kong) [Sir Andrew Caldecott](/wiki/Andrew_Caldecott), who had served in various posts around [British Malaya](/wiki/British_Malaya) (Officer Administering the Government of the Straits Settlements and High Commissioner for the Malay States in 1934) for nearly three decades. ### History The site had historically been used for radio and television broadcasting; the [British Malaya](/wiki/British_Malaya) Broadcasting Corporation established its studio at Caldecott Hill in 1937. Its successor [Radio Malaya](/wiki/Radio_Televisyen_Malaysia) broadcast from Caldecott Hill until after [Malaya](/wiki/Malaysia)'s [declaration of independence](/wiki/Malayan_Declaration_of_Independence) in 1957, when it relocated its main studio to [Kuala Lumpur](/wiki/Kuala_Lumpur), and the new regional station Radio Singapura began broadcasting from its former studio. After Singapore's declaration of independence, Radio Television Singapore moved its television stations to a new [$](/wiki/Singapore_dollar)3.6 million studio at Caldecott Hill in 1966. RTS's successors, including current state-owned broadcaster [Mediacorp](/wiki/Mediacorp), continued to operate from Caldecott Hill until 2015, when Mediacorp relocated to a new corporate campus at [One-north](/wiki/One-north). The old campus at Andrew Road was left abandoned until October 2020, when Mediacorp officially put the land up for sale, and appointed real estate consultants to market the area to hold 67 [bungalow](/wiki/Bungalow) plots. In December 2020, the land was sold for $280.9 million to [Kuok Khoon Hong](/wiki/Kuok_Khoon_Hong) and his company Perennial Real Estate Holdings. - Memories of Caldecott Hill - Caldecott Hill 1°20′12″N 103°50′06″E﻿ / ﻿1.33667°N 103.835°E﻿ / 1.33667; 103.835 This [Singapore](/wiki/Singapore) location article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T09:59:59.912082",
  "title": "Caldecott Hill",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Caldecott_Hill"
}