{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:00:03.947284"
  },
  "content": "Building in the CHIJMES complex, Singapore **Caldwell House** is a historical building designed and built by [George Drumgoole Coleman](/wiki/George_Drumgoole_Coleman) from 1840 to 1841 in Singapore. It was the oldest building of the [CHIJMES](/wiki/CHIJMES) complex since 1854. It currently serves as a venue known as the Alcove at Caldwell House for wedding functions. ## History The house was one of the architecture designs of the Irish civil architect [George Drumgoole Coleman](/wiki/George_Drumgoole_Coleman) in Singapore, it was built from 1840 to 1841 for H. C. Caldwell, a senior clerk to the Magistrates in Singapore. In August 1852, Father [Jean-Marie Beurel](/wiki/Jean-Marie_Beurel) purchased the house for the [Sisters of the Holy Infant Jesus](/wiki/Sisters_of_the_Holy_Infant_Jesus) on his own expense of 4,000 [francs](/wiki/Franc). This formed the beginning of the Convent of the Holy Infant Jesus in Singapore. Beurel had initially gone to France in 1851 to recruit four sisters as teachers, but due to various causes there was only one left, so it was not possible to start a school. On 5 February 1854, the Sisters of the Holy Infant Jesus Reverend Mother [Mathilde Raclot](/wiki/Mathilde_Raclot) and her three companions, Mother Appollinaire, Mother Gaetan Gervais and Sister Gregory Connolly, made the house their residence soon after they reaching Singapore from Penang. Two weeks after their arrival, the sisters would commenced lessons for two classes of students despite the initial austere living conditions. One for fee-paying students and another for orphans and the poor. The house was also used as the nuns’ workroom where the nuns would did their sewing, reading and writing in the semi-circular upstairs room. The school would later be referred to colloquially as the “Town Convent”, soon expanded and became known for providing education of a good standard. ## Expansion of Convent of the Holy Infant Jesus In 1855, the convent acquired the house adjacent to the Caldwell House as a Convent Orphanage known as **Home for Abandoned Babies** for children who were unwanted, came from poor or broken homes, or abandoned due to superstitious beliefs. The First Chapel of the convent was built and consecrated in 1855. Over the years, the convent had steadily acquired adjacent plots of land that would become part of the growing school and complex. The Convent also bought land that belonged to [Raffles Institution](/wiki/Raffles_Institution) in 1860. Father [Jean-Marie Beurel](/wiki/Jean-Marie_Beurel) had since acquired all the nine lots of land that would constitute the entire convent complex and presented them to Reverend Mother Mathilde. In 1892, a boarding house was built on the Stamford Road side of the complex with contributions from the government and wealthy benefactors. The Sisters soon started fund-raising by various means for the new chapel, as the old one had become hazardous that the Sisters had to celebrate [mass](/wiki/Mass_(liturgy)) at the Caldwell House. In 1898, a new [Gothic Revival](/wiki/Gothic_Revival_architecture) [chapel](/wiki/Convent_of_the_Holy_Infant_Jesus_Chapel) was completed in 1903 and consecrated on 11 June 1904. In October 1933, the convent acquired the four bungalows of the former Hotel van Wijk on the adjacent to the convent site, would become [Victoria Girls’ School](/wiki/Victoria_Girls%E2%80%99_School) and later renamed as [Saint Nicholas Girls' School](/wiki/CHIJ_Saint_Nicholas_Girls%27_School), which served as the girls' school through the [Japanese Occupation of Singapore](/wiki/Japanese_Occupation_of_Singapore) until in 1949, when one of the bungalows' room collapsed. The bungalows were subsequently deemed unsafe and demolished in 1950. The new 3 storey building blocks designed by [Swan & Maclaren](/wiki/Swan_%26_Maclaren) was later built on the former site and completed by 1951. In 1983, the [Singapore Government](/wiki/Singapore_Government) acquired the land from the convent and the schools were allocated a new site in Toa Payoh. On 3 November, the [mass](/wiki/Mass_(liturgy)) was held in the chapel for last time before it was deconsecrated for non-religious use. By December, both primary and secondary schools had vacated the site and moved to their new premises in Toa Payoh, where they began operations in the following year. Part of the former schools was demolished in 1984, one of its existing blocks was incorporated in part of the [SMRT Headquarters Building](/wiki/SMRT_Headquarters_Building) which was later built on its former site. ## Restoration The [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) put up the site for sale in March 1990 and gazetted the Caldwell House and the Convent of the Holy Infant Jesus Chapel as national monuments on 26 October 1990 to preserve the ambience of the remaining buildings and designated the entire complex as a conservation area, with high restoration standards and strict usage guidelines.[*citation needed*] Caldwell House, the chapel and the remaining school building blocks underwent extensive restoration works in 1991, the complex was reopened in 1996 as [CHIJMES](/wiki/CHIJMES). The Grand Gallery on level 2 of Caldwell House was renamed as Alcove at Caldwell House and served as a venue for wedding functions. Alcove is managed by Watabe Wedding Singapore. On 27 January 2016, an Australian restaurant Whitegrass was opened on the ground floor of the building. - CHIJMES website\n",
  "language": "en",
  "processed_at": "2026-01-12T10:00:03.946737",
  "title": "Caldwell House, Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Caldwell_House,_Singapore"
}