{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:00:04.412153"
  },
  "content": "Hotel in Bras Basah, Singapore **Caledonian Hotel** was a British-styled hotel located along [Bras Basah Road](/wiki/Bras_Basah_Road) in [Bras Basah, Singapore](/wiki/Bras_Basah). It is believed that the hotel was the only \"British hotel in Singapore\" at the time of its opening in the early 20th century. ## History The Caledonian hotel was opened on 77 [Bras Basah Road](/wiki/Bras_Basah_Road) in 1904, which was formerly occupied by the Central Hotel. The hotel had six [billiard tables](/wiki/Billiard_table), which were imported from [London](/wiki/London). The hotel was thought of as the \"only British hotel in Singapore\" at the time of its opening, and was under the management of Thomas Martin Connolly and the proprietorship of Thomas Sargeant. On 25 September 1907, Sargeant was fined of permitting disorderly behaviour in the hotel and not keeping his lodger book up to date. In June 1907, a [boa constrictor](/wiki/Boa_constrictor), which was shipped off to [Germany](/wiki/Germany), was put on display near at the bar of the hotel. A special performance was held in the hotel later that month. In 1908, the hotel came under new management, and was renovated and installed with electrical lighting, fans and gas, and a new service was introduced, in which staff would receive guests at [Johnston's Pier](/wiki/Johnston%27s_Pier) or the wharves at [Tanjong Pagar](/wiki/Tanjong_Pagar). The hotel ceased operations somewhere in the 1910s, and the space which the hotel occupied was later occupied by several other hotels, including the St. George Hotel, the Oriental Hotel, the Metropole Hotel and the Rex Hotel. After the Rex Hotel, the site was taken over by the Mountbatten Club in 1948, and is currently occupied by the Carlton Hotel. 1°17′45″N 103°51′00″E﻿ / ﻿1.2957°N 103.8500°E﻿ / 1.2957; 103.8500 This article about a Singapore building or structure is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T10:00:04.411718",
  "title": "Caledonian Hotel, Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Caledonian_Hotel,_Singapore"
}