{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:00:09.335494"
  },
  "content": "Shopping mall in Sembawang, Singapore **Canberra Plaza** is a New Generation Neighbourhood Centre (NGNC) built by the [Housing & Development Board](/wiki/Housing_Development_Board) (HDB), the government agency in charge of [public housing development](/wiki/Public_housing_in_Singapore) in [Singapore](/wiki/Singapore). It is one of the new Neighbourhood Centres (NCs) constructed by HDB in 10 years after the completion of [Pioneer Mall](/wiki/Pioneer_Mall) and [Punggol Plaza](/wiki/Punggol_Plaza) in 2004. [CNN](/wiki/Cable_News_Network_(CNN)) reported that Canberra Plaza will provide a \"complete live-work-play-learn environment for residents and signifies Singapore's public housing for the future\". The 3-storey shopping centre is located in the eastern end of [Sembawang](/wiki/Sembawang), [Singapore](/wiki/Singapore) as part of a [mixed-use](/wiki/Mixed-use_development) [transit-oriented development](/wiki/Transit-oriented_development). It was designed by a team led by SAA Architects. Construction started in mid-2015 and the shopping centre opened on 18 December 2020. The mall is directly linked to [Canberra MRT station](/wiki/Canberra_MRT_station) by a footbridge. ## History In 2004, with the completion of Pioneer Mall and Punggol Plaza, the Housing & Development Board (HDB) stopped building neighbourhood centres (NCs). This was an effort to get private sector developers to take over the construction of NCs in HDB towns. Some of the private NCs that were constructed include [Seletar Mall](/wiki/Seletar_Mall) (completed in 2014 by a [Singapore Press Holdings Limited](/wiki/Singapore_Press_Holdings) (SPH) and United Engineers Limited joint venture). However, this caused much inconvenience for residents that moved into the newer towns early on as private developers normally constructed NCs only when a substantial catchment for a particular NC was present so as to generate enough revenue. In an attempt to alleviate these problems, HDB resumed the construction of NCs in 2014 after a 10-year break. These new NCs (one of which is Canberra Plaza) are known as New Generation Neighbourhood Centres (NGNCs) and will each serve a neighbourhood with around 5000 to 6000 households. These NCs are called as such as they are improved versions of the past NCs. The NGNCs incorporated ideas obtained from public consultation while the older NCs do not. Each NGNC will also have a sheltered community plaza to host community events in order to foster social interaction within the community. Water features, terraces as well as “[environmentally friendly](/wiki/Environmentally_friendly)” systems such as [rainwater harvesting](/wiki/Rainwater_harvesting) will also introduced in the NGNCs. [CNN](/wiki/CNN) further reported that Canberra Plaza will provide a \"complete live-work-play-learn environment for residents and signifies Singapore's public housing for the future\". In 2014, HDB held a competition to select the architectural team for Canberra Plaza. The [design brief](/wiki/Design_brief) given was: \"design a mixed development with a [gross floor area](/wiki/Gross_floor_area) of 117,000 square metres (1,260,000 sq ft).\" The Plaza was to be designed with a nautical theme inspired by flowing rivers, as the site of the Plaza is situated near [canals](/wiki/Canals) such as [Sungei Simpang Kiri](/wiki/Sungei_Simpang_Kiri). In addition, since the Plaza is situated at the gateway to Sembawang Neighbourhood 1, it should also serve as a distinctive landmark for the neighbourhood. In October, a team led by SAA Architects was announced as the winner of the competition. One year later, in October 2015, HDB held a public exhibition on Canberra Plaza (with an architectural model of the development) at the [HDB Hub](/wiki/HDB_Hub) (HDB Headquarters) in [Toa Payoh](/wiki/Toa_Payoh). Thereafter, construction of the Plaza commenced and was expected to end in 2019. The mall was officially opened on 18 December 2020. ## Locality Canberra Plaza is located in the northern part of Sembawang and is part of a mixed-use transit-oriented development. Around the Plaza are new and upcoming HDB [public housing](/wiki/Public_housing_in_Singapore) developments (which forms Sembawang Neighbourhood 1), private [condominiums](/wiki/Condominium) as well as [landed properties](/wiki/Landed_property) (Sembawang Springs Estate). Also in the vicinity is [Yishun](/wiki/Yishun) Industrial Park A which mainly comprises [workshops](/wiki/Workshop) of [manufacturing](/wiki/Manufacturing) businesses as well as [automobile repair shops](/wiki/Automobile_repair_shop). In addition, the Singapore [subsidiaries](/wiki/Subsidiary) of [multinational corporations](/wiki/Multinational_corporation) such as [Murata Manufacturing](/wiki/Murata_Manufacturing) and ASM Assembly Systems are located within the industrial park. The [Singapore Civil Defence Force](/wiki/Singapore_Civil_Defence_Force) [3rd Division Headquarters](/wiki/Singapore_Civil_Defence_Force#Operational_divisions) (co-located within Yishun Fire Station) and [foreign migrant workers](/wiki/Migrant_worker#Singapore) [dormitories](/wiki/Dormitory#Company_dormitories) (Simpang Lodges 1 & 2) are located nearby. ## Layout Canberra Plaza is designed with three commercial stories that have a combined gross floor area of 11,000 square metres (120,000 sq ft) The main anchor tenants include a [supermarket](/wiki/Supermarket) and [food courts](/wiki/Food_court). Other commercial units include [restaurants](/wiki/Restaurant), enrichment centres as well as [clinics](/wiki/Clinic). A sheltered plaza for community activities and a water playground is incorporated into the design of Canberra Plaza as well. In order to improve connectivity, a portion of the [ground level](/wiki/Storey#East_Asian_schemes) will be kept open for 24-hours and a sheltered elevated pedestrian [footbridge](/wiki/Footbridge) will also link housing precincts (such as Eastlink II @ Canberra) across Canberra Way to Canberra Plaza. A similar footbridge will connect Canberra Plaza to [Canberra MRT station](/wiki/Canberra_MRT_station) which is located across Canberra Link. ## Awards YearAwardAwarding AgencyRef.**2017**BCA Green Mark Platinum Award (Category: Buildings)[Building & Construction Authority of Singapore](/wiki/Building_and_Construction_Authority) (BCA) - Canberra Plaza - Where2Shop (HDB Page for HDB Neighbourhood Centres) - Media related to Canberra Plaza at Wikimedia Commons - More pictures of Archietectural Model\n",
  "language": "en",
  "processed_at": "2026-01-12T10:00:09.334962",
  "title": "Canberra Plaza, Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Canberra_Plaza,_Singapore"
}