{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:00:13.040355"
  },
  "content": "Online investment platform**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **is an orphan, as no other articles link to it**. Please introduce links to this page from related articles. *(December 2025)*This article **may have been created or edited in return for undisclosed payments**, a violation of Wikipedia's terms of use. It may require cleanup to comply with Wikipedia's content policies, particularly neutral point of view. *(September 2019)* *(Learn how and when to remove this message)* **CapBridge** is an online [investment platform](/wiki/Investment_platform), headquartered in [Singapore](/wiki/Singapore). It was founded in 2015 and backed by [Singapore Exchange](/wiki/Singapore_Exchange). CapBridge was approved by the [Monetary Authority of Singapore](/wiki/Monetary_Authority_of_Singapore) (MAS), [Government of Singapore](/wiki/Government_of_Singapore) to operate both a primary capital raising platform utilizing a Capital Markets Securities License, and a private securities exchange - 1exchange with a Recognized Market Operator license. ## History The company was founded in 2015 by Johnson Chen. It raised funding of S$4 million (US$2.9 million) from VC investor [Tim Draper](/wiki/Tim_Draper) in October 2017. In May 2018, the company secured $5 million in Series A funding in an over-subscribed round. In November 2018, the company received license from the [Monetary Authority of Singapore](/wiki/Monetary_Authority_of_Singapore) to operate a securities exchange, 1exchange, as a recognised market operator. [Singapore Exchange](/wiki/Singapore_Exchange) (SGX) has its investment in CapBridge through its subsidiary Asian Gateway Investments. In February 2019, the company launched a product called *Preferred Access*. It allows investors to access multiple private equities or venture capital investments for a minimum amount of SGD $5,000. CapBridge also has a Capital Market Services license from the [Monetary Authority of Singapore](/wiki/Monetary_Authority_of_Singapore). - Companies portal - Singapore portal - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T10:00:13.039881",
  "title": "CapBridge",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/CapBridge"
}