{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:00:14.706863"
  },
  "content": "Hotel and resort located on Sentosa Island, Singapore **Capella Singapore** is a luxury [resort hotel](/wiki/Resort_hotel) situated in 30 acres (12 ha) of grounds and gardens located on [Sentosa Island](/wiki/Sentosa_Island), Singapore. It has 112 manors, suites and guestrooms designed by [Norman Foster](/wiki/Norman_Foster). It was developed by Pontiac Land and officially opened in March 2009. Capella Singapore's long-stay accommodation arm, The Club at Capella Singapore comprises 81 serviced apartments, penthouses and manors. ## Architecture and design The hotel, which opened in 2009, was designed by architectural firm [Foster and Partners](/wiki/Foster_and_Partners) in collaboration with [DP Architects Pte Ltd](/wiki/DP_Architects). Its interiors were designed by Indonesian interior designer, [Jaya Ibrahim](/wiki/Jaya_Ibrahim). The landscape architecture was designed by Coopers Hill. The building integrates two [Tanah Merah](/wiki/Tanah_Merah,_Singapore) military buildings dating from the 1880s with a new hotel, villas, event spaces and a spa. The Tiong Seng Group was the building and civil contractor of the Capella Singapore with Millenia Hotel Pte Ltd. as their client. ## 2018 North Korea–United States summit The [2018 United States–North Korea Summit](/wiki/2018_North_Korea%E2%80%93United_States_Singapore_Summit) was held at the resort beginning at 9:04 a.m. [Singapore Standard Time](/wiki/Singapore_Standard_Time) on 12 June 2018. Singapore announced the several locations related to the Trump-Kim summit would be designated as \"Special event areas\" and secured by both leaders' own personal security teams, elite Singaporean police, and the [Gurkha Contingent](/wiki/Gurkha_Contingent) of Singapore.\n",
  "language": "en",
  "processed_at": "2026-01-12T10:00:14.706275",
  "title": "Capella Resort, Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Capella_Resort,_Singapore"
}