{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:00:18.116068"
  },
  "content": "Singaporean real estate organisation**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **contains promotional content**. Please help improve it by removing promotional language and inappropriate external links, and by adding encyclopedic text written from a neutral point of view. *(October 2023)* *(Learn how and when to remove this message)*This article **relies excessively on references to primary sources**. Please improve this article by adding secondary or tertiary sources. *Find sources:* \"CapitaLand\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(October 2023)* *(Learn how and when to remove this message)* **A major contributor to this article appears to have a close connection with its subject.** It may require cleanup to comply with Wikipedia's content policies, particularly neutral point of view. Please discuss further on the talk page. *(July 2024)* *(Learn how and when to remove this message)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"CapitaLand\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(April 2025)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* **CapitaLand Group Pte. Ltd.** is a Singaporean headquartered company focusing on investment, development and management of real estate. The company has a presence in over 270 cities across more than 45 countries. ## History In 2000, Pidemco Land and DBS Land merged to form CapitaLand Group Pte. Ltd. On 19 November 2002, CapitaLand Ascendas REIT (CLAR) was listed on SGX-ST. Formerly known as Ascendas Real Estate Investment Trust, CLAR is Singapore's first and largest listed business space and industrial REIT. In 2017, CapitaLand came into controversy when the company attempted to evict the Franses Art Gallery from the [Cavendish Hotel](/wiki/Cavendish_Hotel) in [London](/wiki/London). CapitaLand acquired the property in August 2012. The case would go to the [Supreme Court of the United Kingdom](/wiki/Supreme_Court_of_the_United_Kingdom), which ruled against CapitaLand and upheld Franses Art Gallery's request for a new 15-year lease. On 14 January 2019, the Group announced that it would acquire Ascendas-Singbridge, a real estate group, from [Temasek Holdings](/wiki/Temasek_Holdings) in an [S$](/wiki/S$)11B deal, which was completed on 30 June 2019. On 3 July 2019, it announced that Ascott Residence Trust (Ascott Reit) and Ascendas Hospitality Trust would be merged, forming Asia's largest hospitality trust with S$7.6b in combined assets. On 22 January 2020, CapitaLand Mall Trust (CMT) and CapitaLand Commercial Trust (CCT) announced the merger of both REITs to form CapitaLand Integrated Commercial Trust (CICT), which would become the largest Singapore REIT and one of the largest REITs in the Asia Pacific with an asset base of S$22.4 billion. On 22 March 2021, CapitaLand Group announced the proposed restructuring of its business. On 20 September 2021, CLI debuted on the [Singapore Stock Exchange](/wiki/Singapore_Exchange) under the trading name CapitaLandInvest and stock code, 9CI. On 27 September 2021, CapitaLand Ascendas REIT brought its London data centre footprint to five in 2023 by buying the 31MW Chess Building data centre from Digital Realty for £125.1m ($159m). In March 2024, CapitaLand India Trust acquired an industrial property from developer Nalanda Shelter Private in the Indian state of [Pune](/wiki/Pune) for 7.73bn Indian rupees (€86m). ### Notable Projects #### Lodging The Ascott Limited, a wholly owned subsidiary of CapitaLand, opened The Ascott Singapore in 1984. Ascott's portfolio spans over 220 cities across more than 40 countries in Asia Pacific, Central Asia, Europe, the Middle East, Africa, and the USA. **Homes** The latest project is the redevelopment of JCube shopping mall into a mixed development with a residential component called J'Den. In Vietnam, CapitaLand’s residential developments include HeritagHe West Lake in Hanoi, Feliz en Vista and ZENITY in Ho Chi Minh City.\n",
  "language": "en",
  "processed_at": "2026-01-12T10:00:18.115602",
  "title": "CapitaLand",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/CapitaLand"
}