{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:00:20.987787"
  },
  "content": "[Executions](/wiki/Capital_punishment) in [Singapore](/wiki/Singapore) are carried out by [long drop hanging](/wiki/Hanging#Long_drop), and usually take place at dawn. Thirty-three offences—including [murder](/wiki/Murder), [drug trafficking](/wiki/Illegal_drug_trade), [terrorism](/wiki/Terrorism), use of [firearms](/wiki/Firearm) and [kidnapping](/wiki/Kidnapping)—warrant the death penalty under [Singaporean law](/wiki/Law_of_Singapore). In 2012, Singapore amended its laws to exempt some offences from the mandatory death sentence. In a 2005 survey by *[The Straits Times](/wiki/The_Straits_Times)*, 95% of Singaporeans were of the view that their country should retain the death penalty. The support steadily fell throughout the years due to the increasing liberal opinions of society. Despite the decline, a large majority of the public remains supportive of the use of the death penalty, with more than 80% of Singaporeans believing that their country should retain the death penalty in 2021. The most recent executions conducted in Singapore took place on 27 November 2025, when a Singaporean, Mohammad Rizwan and Malaysian, Saminathan Selvaraju were hanged on the same day for trafficking 301.6g of heroin. ## Legislation ### Procedures Section 316 of the [Criminal Procedure Code](/wiki/Criminal_law_of_Singapore#Criminal_Procedure_Code) states that the death penalty in Singapore is to be conducted by hanging. Judicial hangings always take place shortly before [dawn](/wiki/Dawn) on a Friday and are conducted by the [long drop method](/wiki/Hanging#Long_drop). The Singapore government has affirmed its choice of execution by hanging in favour of [other methods](/wiki/Capital_punishment). It is a normal practice for everyone present in the courtroom to stand and remain silent before the death sentence is passed. The judge will then proceed to announce the death sentence on the accused, who has been found guilty and convicted of the capital offence. The condemned will be given notice at least four days before execution. In the case of foreigners sentenced to death, their families and diplomatic missions or embassies will be given one to two weeks' notice. ### Exemptions #### Underaged and pregnant offenders Persons under the age of 18 at the time of their offence and pregnant women cannot be sentenced to death. Previously, offenders under 18 at the time of their offences would be indefinitely detained at [the president's pleasure](/wiki/The_President%27s_Pleasure_(Singapore)) (TPP), with the normal period of detention having been between 10 and 20 years. These inmates would be released after receiving clemency from the [President of Singapore](/wiki/President_of_Singapore), once they were assessed to be suitable for release. In 2010, the law was amended to allow judges to mete out [life imprisonment](/wiki/Life_imprisonment_in_Singapore) to offenders convicted of capital offences, but aged below 18 at the time of their crimes. They would be required to serve a minimum of 20 years before they can be reviewed for possible release. As for women who were pregnant at the time of their sentencing, they would automatically be sentenced to life imprisonment upon their conviction of any capital offences, though there have been no such cases as of yet. The first underaged offender to be sentenced to life imprisonment after the abolition of TPP was Myanmar national [Zin Mar Nwe](/wiki/Zin_Mar_Nwe), a domestic worker who killed the mother-in-law of her employer in June 2018 at the age of 17. She received a life sentence in July 2023 after the High Court found her guilty of murder, with the trial judge Andre Maniam accepting that Zin was a minor and below 18 years old when killing the 70-year-old victim and he thus opted to not impose a death sentence in her case. #### Offenders of unsound mind Persons proven to be of [unsound mind](/wiki/Insanity_defense) when they commit capital crimes, once found guilty, are not to be given the death penalty. These offenders can be sentenced to another form of indefinite detention under [TPP](/wiki/The_President%27s_Pleasure_(Singapore)), being detained at medical facilities, prisons or at some other safe places in custody, and subject to psychiatric review of their mental conditions until suitable for release. ### Pre-1970 jury trials Before they were abolished in 1970, [jury trials](/wiki/Jury_trial) were conducted to hear capital cases in Singapore since the British colonial era. Based on the verdict of a jury, if a person was found guilty, the judge would convict and impose a penalty to the defendant in accordance to the charge he or she was found guilty of. One notable case in which a person was sentenced to death in a jury trial was the trial of [Sunny Ang Soo Suan](/wiki/Sunny_Ang_Soo_Suan), who allegedly murdered his girlfriend [Jenny Cheok Cheng Kid](/wiki/Jenny_Cheok_Cheng_Kid) during a scuba diving trip in 1963. Despite the circumstantial evidence and the absence of the victim's body, the seven-men jury unanimously found Ang guilty of murder and sentenced him to death. Ang was eventually hanged on 6 February 1967 after he lost all his appeals to both the [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore) and the [Privy Council](/wiki/Judicial_Committee_of_the_Privy_Council), and the failure of his clemency plea to [President](/wiki/President_of_Singapore) [Yusof Ishak](/wiki/Yusof_Ishak). The first person to be tried before two judges in the High Court and sentenced to death for a capital case was armed robber [Teo Cheng Leong](/wiki/Teo_Cheng_Leong), who was found guilty and sentenced in February 1970 for unlawfully discharging a firearm twice when he fired two missed shots at a police officer. Another notable case was the kidnapping and murder of [Ong Beang Leck](/wiki/Ong_Beang_Leck), the son of a rich tycoon. Five men were involved in the abduction and they had murdered Ong after luring him into a rented car on 24 May 1968. Three of the kidnappers were found guilty of murder and sentenced to death in June 1970. In the first case of a woman being sentenced to death in Singapore, dance hostess [Mimi Wong Weng Siu](/wiki/Mimi_Wong_Weng_Siu) was convicted of murdering [Ayako Watanabe](/wiki/Ayako_Watanabe) out of jealousy in 1970 and received the death sentence in the same trial as her ex-husband [Sim Woh Kum](/wiki/Sim_Woh_Kum), who assisted her in killing the [Japanese](/wiki/Japanese_people) victim, who was the wife of Wong's Japanese boyfriend. The couple were executed on 27 July 1973. ### Appeals Since the amendment of the Criminal Procedure Code in 1992, all capital cases have been heard by a single judge in the [High Court](/wiki/High_Court_of_Singapore) instead of two judges. After conviction and sentencing, the offender has the option of making an appeal to the [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore). If the appeal fails, the final recourse rests with the [President of Singapore](/wiki/President_of_Singapore), who has the power to grant clemency on the advice of the [Cabinet](/wiki/Cabinet_of_Singapore). In exceptional cases since 2012, the Court of Appeal would be asked to review its previous decisions in concluded criminal appeals where it was necessary to correct a miscarriage of justice, most of which involved drug cases attracting the death penalty. The exact number of successful appeals is unknown. In November 1995, one Poh Kay Keong had his conviction overturned after the court found that his statement to a [Central Narcotics Bureau](/wiki/Central_Narcotics_Bureau) officer had been made under duress. Another was the [case of Nadasan Chandra Secharan](/wiki/Death_of_Ramapiram_Kannickaisparry), who was initially convicted of murder and sentenced to death by the High Court in June 1996, but later acquitted of murder by the Court of Appeal in January 1997 after they found the evidence against him was insufficient to show that he had murdered his lover Ramapiram Kannickaisparry. Another case was that of Ismil bin Kadar, who was initially sentenced to death for a 2005 robbery-murder case in [Boon Lay](/wiki/Boon_Lay), but eventually acquitted of the crime as the Court of Appeal found that based on the evidence, Ismil was not involved in the case and that it was solely his younger brother [Muhammad bin Kadar](/wiki/Muhammad_bin_Kadar) who was responsible for the robbery and murder; Muhammad was subsequently executed in April 2015. Successful clemency applications are thought to be even rarer. Since 1965, the presidential clemency has been granted seven times to death row inmates, whose sentences were all commuted to [life imprisonment](/wiki/Life_imprisonment_in_Singapore) (not counting the clemency pleas of the underaged offenders serving TPP). The most recent case was in August 2025, when convicted drug trafficker Tristan Tan Yi Rui was granted clemency by President [Tharman Shanmugaratnam](/wiki/Tharman_Shanmugaratnam), who commuted Tan's death sentence to life imprisonment. Prior to Tan's pardon, the last presidential clemency to be granted was in April 1998, when President [Ong Teng Cheong](/wiki/Ong_Teng_Cheong) pardoned a 19-year-old death row inmate and convicted murderer [Mathavakannan Kalimuthu](/wiki/Mathavakannan_Kalimuthu), commuting his death sentence to life imprisonment. Previously, other than the [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore), offenders were allowed to file criminal or civil appeals to the [Privy Council](/wiki/Judicial_Committee_of_the_Privy_Council) in London, where the judges could hear their appeals once they exhausted all avenues of appeal in Singapore. This avenue of appeal was fully abolished for all criminal and civil matters in April 1994. One case in which an appeal to the Privy Council was successful was the case of murderer [Mohamed Yasin bin Hussin](/wiki/Mohamed_Yasin_bin_Hussin). Nineteen-year-old Yasin robbed, raped and murdered a 58-year-old woman at [Pulau Ubin](/wiki/Pulau_Ubin) in April 1972. He was sentenced to death for murder in 1974 and lost his appeal before the Privy Council accepted his appeal and sentenced him to two years' imprisonment for causing death while committing a rash/negligent act. ### Changes to the law [Wikisource](/wiki/Wikisource) has original text related to this article:***Penal Code (Amendment) Act 2012******Misuse of Drugs (Amendment) Act 2012*** In July 2012, the government made a review of the mandatory death penalty applied to certain drug trafficking or murder offences. In the midst of this review, a [moratorium](/wiki/Moratorium_(law)) was imposed on all the 35 pending executions in Singapore at that time (7 for murder and 28 for drug trafficking). During that period of the review of the mandatory death penalty, one convicted murderer, [Pathip Selvan s/o Sugumaran](/wiki/Pathip_Selvan_s/o_Sugumaran), who made headlines for the violent murder of his girlfriend in 2008, won his appeal in October 2012 and was re-sentenced to 20 years' imprisonment for [culpable homicide](/wiki/Culpable_homicide). Wang Zhijian, a Chinese national who committed the 2008 [Yishun triple murders](/wiki/Yishun_triple_murders), was sentenced to death for a conviction of murder under Section 300(a) of the Penal Code in November 2012, and another unnamed death row convict died of natural causes while in prison. In November 2012, capital punishment laws in Singapore were revised such that the mandatory death penalty for those convicted of drug trafficking or murder was lifted under certain specific conditions. Judges were empowered with the discretion to sentence such offenders to life imprisonment with the possibility of [parole](/wiki/Parole) after 20 years. These changes were approved by [Parliament](/wiki/Parliament_of_Singapore) and set to take effect in January of the following year. In January 2013, the law was again amended to make the death penalty no longer mandatory for certain capital offences. Judges in Singapore were given a discretion to impose a sentence of [life imprisonment](/wiki/Life_imprisonment_in_Singapore) with mandatory [caning](/wiki/Caning_in_Singapore) for offenders who commit murder but had no intention to kill, which come under Sections 300(b), 300(c) and 300(d) of the [Penal Code](/wiki/Penal_Code_(Singapore)). The death penalty remains mandatory only for murders committed with the intent to kill, which come under section 300(a) of the Penal Code. Provided that drug traffickers only act as couriers, suffer from impaired mental responsibility (e.g. [depression](/wiki/Major_depressive_disorder)), or substantively assist the authorities in tackling drug trafficking activities, among other conditions, judges also had the discretion to impose life sentences instead of death. Drug traffickers who were not condemned to death but to life-long incarceration with caning would receive at least 15 strokes of the cane, unless suffering from mental incapacity. Despite this discretion, a sentence of life imprisonment is the mandatory minimum penalty for capital murder or drug trafficking offences. The first person to be sentenced to life imprisonment, instead of receiving the death penalty, under the amended death penalty laws was drug trafficker Abdul Haleem bin Abdul Karim on 10 April 2013, having been a courier in traffic drugs and had assisted the authorities in disrupting the drug trafficking activities. In addition to his life sentence, Abdul Haleem, who pleaded guilty to two charges of drug trafficking, was also given the maximum sentence of 24 strokes of the cane. Abdul Haleem's accomplice, Muhammad Ridzuan bin Md Ali, on the other hand, was sentenced to death for drug trafficking and later hanged on 19 May 2017. After the changes to the law, the first executions to take place were those of drug traffickers Tang Hai Liang and Foong Chee Peng on 18 July 2014, after their sentences were finalized and their refusal to further appeal against their sentences. #### Re-sentencing of death row inmates The amendments of the law also offered a chance for all current death row inmates to have their cases to be reviewed for re-sentencing. Some death row inmates declined to be re-sentenced, including Tang Hai Liang and Foong Chee Peng. The below cases are known cases where death row inmates applied for re-sentencing. ##### Murder - 17 April 2015: [Muhammad bin Kadar](/wiki/Muhammad_bin_Kadar) was hanged after spending five years and nine months on death row for the robbery and murder of an elderly housewife in 2005. He was sentenced to death by the [High Court](/wiki/High_Court_of_Singapore) in 2008 and had his appeal dismissed by the [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore) in 2011. He applied for re-sentencing when changes to the law took effect in 2013, but the Court of Appeal denied his application in 2014. He was eventually hanged on 17 April 2015 following the dismissal of his clemency plea. - 16 July 2013: Fabian Adiu Edwin, a Malaysian who partnered with his childhood friend Ellary Puling to commit a series of six robberies in 2008, resulting in the death of one of the victims. While Ellary was sentenced to 19 years' imprisonment and 24 strokes of caning for robbery with hurt, Fabian was meanwhile convicted of murder and sentenced to death in 2011. The [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore) dismissed his appeal against his sentence in 2012. After amendments to the law took effect in 2013, he applied for re-sentencing and was re-sentenced to [life imprisonment](/wiki/Life_imprisonment) and 24 [strokes of the cane](/wiki/Caning_in_Singapore). - 28 August 2013: Bijukumar Remadevi Nair Gopinathan, an Indian national who robbed and murdered a Filipino prostitute in 2010, was initially sentenced to death in 2012. He appealed to the [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore) in 2012 but was still found guilty of murder. After changes to the law took effect in 2013, he applied for re-sentencing and was re-sentenced in 2013 to [life imprisonment](/wiki/Life_imprisonment) and 18 [strokes of the cane](/wiki/Caning_in_Singapore). - 12 November 2013: Kamrul Hasan Abdul Quddus, a Bangladeshi who murdered his Indonesian girlfriend in 2007. He was initially found guilty of murder and sentenced to death in 2010, and had his appeal to the [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore) dismissed in 2012. After changes to the law took effect in 2013, he applied for re-sentencing and was re-sentenced to [life imprisonment](/wiki/Life_imprisonment) and 10 [strokes of the cane](/wiki/Caning_in_Singapore). He tried filing an appeal for a lighter sentence but was turned down by the Court of Appeal in 2014. - 13 November 2013: [Wang Wenfeng](/wiki/Wang_Wenfeng_(murderer)), a Chinese national who robbed and murdered a taxi driver in 2009, was initially convicted of murder and sentenced to death in 2011. He had also lost his appeal to the [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore) in 2012. When changes to the law took effect in 2013, he applied for re-sentencing and was re-sentenced to [life imprisonment](/wiki/Life_imprisonment) and 24 [strokes of the cane](/wiki/Caning_in_Singapore). The prosecution filed an appeal but withdrew it in 2015 in light of the outcome of the prosecution's appeal against [Kho Jabing](/wiki/Kho_Jabing)'s life sentence. - 20 May 2016: [Kho Jabing](/wiki/Kho_Jabing), a Malaysian hanged for the 2008 robbery and murder of a construction worker. After changes to the law took effect in 2013, he applied for re-sentencing and was initially re-sentenced to [life imprisonment](/wiki/Life_imprisonment) and 24 [strokes of the cane](/wiki/Caning_in_Singapore) on 14 August 2013. However, after the prosecution appealed, he was sentenced to death again in a landmark ruling by a majority decision of 3–2 in the [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore) and eventually hanged in the afternoon of the same day his final appeal was dismissed. ##### Drug trafficking - 17 November 2013: [Yong Vui Kong](/wiki/Yong_Vui_Kong), a Malaysian found guilty of drug trafficking in 2007 and sentenced to death in 2008. He lost multiple appeals against his sentence to the [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore) and [President of Singapore](/wiki/President_of_Singapore). However, when changes to the law took effect in 2013, he applied for re-sentencing and was re-sentenced to [life imprisonment](/wiki/Life_imprisonment) and 15 [strokes of the cane](/wiki/Caning_in_Singapore). Yong was the first drug convict on death row to be spared the gallows since the 2013 law reforms. - 6 January 2014: Subashkaran Pragasam, a Singaporean found guilty of trafficking heroin in 2008 and sentenced to death in 2012. When changes to the law took effect in 2013, he applied for re-sentencing and was re-sentenced in 2014 to [life imprisonment](/wiki/Life_imprisonment) and 15 [strokes of the cane](/wiki/Caning_in_Singapore). - 3 March 2014: Dinesh Pillai Reja Retnam, a Malaysian found guilty of trafficking heroin in 2009 and sentenced to death in 2011. When changes to the law took effect in 2013, he applied for re-sentencing and was re-sentenced in 2014 to [life imprisonment](/wiki/Life_imprisonment) on the grounds of diminished responsibility due to him suffering from depression when he committed the crime. - 27 May 2014: Yip Mun Hei, a Singaporean convicted of trafficking heroin in 2008 and sentenced to death in 2009. When changes to the law took effect in 2013, he applied for re-sentencing and was re-sentenced in 2014 to [life imprisonment](/wiki/Life_imprisonment) and 15 [strokes of the cane](/wiki/Caning_in_Singapore). He had an accomplice Leong Soy Yip (also sentenced to death) whose fate remains unknown. - 28 October 2014: Wilkinson A/L Primus, a Malaysian convicted of trafficking heroin in 2008 and sentenced to death in 2009. When changes to the law took effect in 2013, he applied for re-sentencing and was re-sentenced to [life imprisonment](/wiki/Life_imprisonment) in 2014 on the grounds that he was intellectually challenged and suffering from depression at the time of the crime. - 20 April 2015: [Cheong Chun Yin](/wiki/Cheong_Chun_Yin), a Malaysian convicted of trafficking heroin in 2008 and sentenced to death in 2010. He lost his appeal to the [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore) in 2010. After changes to the law took effect in 2013, he applied for re-sentencing and was re-sentenced in 2015 to [life imprisonment](/wiki/Life_imprisonment) and 15 [strokes of the cane](/wiki/Caning_in_Singapore). His boss and accomplice, Pang Siew Fum, was also re-sentenced to life imprisonment on the same day, due to Pang suffering from depression at the time of the crime. - 1 July 2015: Kester Ng Wei Ren, a 47-year-old Singaporean caught trafficking in 23.38g of heroin on 12 August 2008. He tried to argue that he only meant to import only 9.92g of heroin while the rest of his drug supply was only meant for his own consumption. Ng was given the mandatory death penalty in 2010 and he also lost his appeal in the same year. After changes to the law took effect in 2013, Ng applied for re-sentencing and but he lost his chance to be re-sentenced on 1 July 2015, since he was not certified as a courier. He was presumably executed sometime after the loss of his re-sentencing application. - 22 April 2016: Phua Han Chuan Jeffery, a Singaporean and chronic [ketamine](/wiki/Ketamine) abuser who was arrested on 20 January 2010 for trafficking more than 100g of heroin into Singapore at Woodlands Checkpoint. He was found guilty and sentenced to death in September 2011. Phua, who lost his three previous appeals against the sentence between July 2012 to September 2015, was granted a re-trial three years after the government implemented new changes to the death penalty laws (in 2013). He was diagnosed to be suffering from persistent depressive disorder, and the condition, coupled with his chronic ketamine addiction, was argued by Phua's lawyers as sufficient to impair his mental responsibility at the time of the crime. The High Court accepted the defence's arguments and thus re-sentenced Phua, then 30 years old, to life-long incarceration on 22 April 2016, with his sentence backdated to the date of his remand. - 27 April 2022: [Nagaenthran K Dharmalingam](/wiki/Nagaenthran_K_Dharmalingam), a Malaysian convicted of trafficking heroin in 2009 and sentenced to death in 2010. After changes to the law took effect in 2013, he applied for re-sentencing but had his application rejected. His appeals to the [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore) were dismissed in 2019. In May 2019 he planned to appeal to the [President of Singapore](/wiki/President_of_Singapore) for clemency, but he lost his plea and his execution date was scheduled on 10 November 2021. However, Nagaenthran contracted [COVID-19](/wiki/COVID-19) while in prison and he also made an appeal, hence his execution was postponed and the appeal itself was also postponed twice. The appeal was heard on 1 March 2022, and it was finally dismissed on 29 March 2022. Nearly a month after the loss of his appeal, 33-year-old Nagaenthran was hanged at dawn on 27 April 2022. #### Sentencing guidelines for murder (2015–present) On 14 January 2015, a landmark ruling was made by the [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore) in the prosecution's appeal against the re-sentencing case of one former death row inmate, [Kho Jabing](/wiki/Kho_Jabing), who was re-sentenced to [life imprisonment](/wiki/Life_imprisonment_in_Singapore) and 24 [strokes of the cane](/wiki/Caning_in_Singapore) for the murder of Chinese national Cao Ruyin during a robbery under Section 300(c) of the Penal Code of Singapore. The landmark judgement in which the court, by a majority decision of 3–2, overturned Kho's life sentence and sentenced him to death a second time, had set the main guiding principles for all judges in Singapore to decide if the death penalty is appropriate for those murder cases committed with no intention to kill while exercising their discretion to impose either a life term or death for offenders responsible for such. The main guiding principles set were as such: 1. Whether an offender displayed viciousness during the time of the commission of the offence of murder; 2. Whether an offender demonstrated a blatant disregard for human life at the time of the killing; and 3. Whether the offender's actions sparked an outrage of the feelings of the community. In Kho's case, the majority three of the five judges were satisfied that Kho, who had used a tree branch to bash Cao's head repeatedly (resulting in a completely shattered skull that caused Cao to die in a coma six days after the attack), had demonstrated both a blatant disregard for human life and viciousness while committing the crime, and Kho's actions were such that they had outraged the feelings of the community. Due to this, Kho was once again given the death penalty and he was eventually hanged on 20 May 2016, at 3:30 pm after his appeal for a stay of execution was dismissed that same morning, a rare occurrence of an execution not carried out at dawn on Friday. Consequently, the guiding principles from Kho's case also impacted several subsequent murder cases and influenced the sentencing or appeal outcomes of these murder cases, which include the [2010 Kallang slashing](/wiki/2010_Kallang_slashing), the 2016 [Gardens by the Bay murder](/wiki/Gardens_by_the_Bay_murder), the 2016 [Circuit Road murder](/wiki/Circuit_Road_murder), the 2016 [Azlin Arujunah](/wiki/Azlin_Arujunah) case and the 2013 [murder of Dexmon Chua Yizhi](/wiki/Murder_of_Dexmon_Chua_Yizhi), etc. ## Capital crimes In addition to the Penal Code, there are four [Acts of Parliament](/wiki/Act_of_Parliament#Singapore) that prescribe death as punishment for offences. According to the Think Centre, a Singaporean [civil rights](/wiki/Civil_rights) group, 70% of hangings are for drug-related offences. All eight hangings in 2017 were for drug-related offences that year, and 11 of 13 hangings in 2018 were also for drug-related offences. ### Penal Code Under the Penal Code, the commission of the following offences may result in the death penalty: - Waging or attempting to wage war or abetting the waging of war against the [Government](/wiki/Government_of_Singapore) (§121) - [Piracy](/wiki/Piracy) that endangers life (§130B) (mandatory) - [Genocide](/wiki/Genocide) resulting in death (§130E) (mandatory) - Abetting of [mutiny](/wiki/Mutiny) (§132) - [Perjury](/wiki/Perjury) that results in the execution of an innocent person (§194) - [Murder](/wiki/Murder) (§302) (**mandatory** for **S300(a)** of the Penal Code; **discretionary** for **S300(b)**, **S300(c)** and **S300(d)** of the Penal Code) - Abetting the [suicide](/wiki/Suicide) of a person under the age of 18 or an \"insane\" person (§305) - [Attempted murder](/wiki/Attempted_murder) by a prisoner serving a [life sentence](/wiki/Life_sentence) (§307 (2)) (mandatory) - [Kidnapping](/wiki/Kidnapping) in order to commit murder (§364) - [Robbery](/wiki/Robbery) committed by five or more people that results in the death of a person (§396) Since the Penal Code (Amendment) Act 2007, Singapore no longer allows for the death penalty for [rape](/wiki/Rape) and mutiny. ### Arms Offences Act The [Arms Offences Act](/wiki/Arms_Offences_Act) regulates criminal offences dealing with firearms and weapons. Any person who uses or attempts to use arms (Section 4) can face execution, as well as any person who uses or attempts to use arms to commit scheduled offences (Section 4A). These scheduled offences are being a member of an unlawful assembly; rioting; certain offences against the person; abduction or kidnapping; extortion; burglary; robbery; preventing or resisting arrest; vandalism; mischief. Any person who is an accomplice (Section 5) to a person convicted of arms use during a scheduled offence can likewise be hanged. Trafficking in arms (Section 6) is a capital offence in Singapore. Under the Arms Offences Act, trafficking is defined as being in unlawful possession of more than two firearms. One notable case involving a conviction under this act was the [murder of Lim Hock Soon](/wiki/Murder_of_Lim_Hock_Soon), where [Ang Soon Tong](/wiki/Ang_Soon_Tong) triad leader [Tan Chor Jin](/wiki/Tan_Chor_Jin) used a [Beretta](/wiki/Beretta) pistol to fatally shoot Lim, a nightclub owner, to death after robbing him and his family of their valuables. Tan was initially charged under the Penal Code for murder but the charge was later amended into one of illegal discharge of firearms under the Arms Offences Act. Tan was eventually convicted and [executed](/wiki/Executed) by [hanging](/wiki/Hanging) under this Act on 9 January 2009. ### Misuse of Drugs Act Since 1975, after the proposal by then Minister for Home Affairs [Chua Sian Chin](/wiki/Chua_Sian_Chin), the death penalty was mandated as the sole punishment for drug trafficking, should the amount of whichever drugs exceed the capital threshold. As a result of this legal reform, 28-year-old [Penang](/wiki/Penang)-born Malaysian Teh Sin Tong became the first convicted drug trafficker to be hanged at [Changi Prison](/wiki/Changi_Prison) on 28 April 1978, after the High Court found him guilty on 13 October 1976 (a year after the new laws took effect) for trafficking 254.7g of [diamorphine](/wiki/Diamorphine) across the [Woodlands Checkpoint](/wiki/Woodlands_Checkpoint) just six months prior to his sentencing. Under Schedule 2 of the [Misuse of Drugs Act](/wiki/Misuse_of_Drugs_Act_(Singapore)), any person importing or exporting more than the following quantities of drugs receives a mandatory death sentence: - 1,200 grams of [opium](/wiki/Opium) and containing more than 30 grams of morphine (§5 and §7, (2)(b)); - 30 grams of [morphine](/wiki/Morphine) (§5 and §7, (3)(b)); - 15 grams of [diamorphine](/wiki/Diamorphine) (heroin) (diamo (§5 and §7, (4)(b)); - 30 grams of [cocaine](/wiki/Cocaine) (§5 and §7, (5)(b)); - 500 grams of [cannabis](/wiki/Cannabis_(drug)) (§5 and §7, (6)(b)); - 1,000 grams of cannabis mixture (§5 and §7, (7)(b)); - 200 grams of [cannabis resin](/wiki/Cannabis_resin) (§5 and §7, (8)(b)); - 250 grams of [methamphetamine](/wiki/Methamphetamine) (§5 and §7, (9)(b)). Death sentences are also mandatory for any person caught manufacturing: - Morphine, or any salt of morphine, ester of morphine or salt of ester of morphine (§6, (2)); - Diamorphine (heroin) or any salt of diamorphine (§6, (3)); - Cocaine or any salt of cocaine (§6, (4)); - Methamphetamine (§6, (5)). Under the Act: > any person who is proved to have had in his possession or custody or under his control — > > 1. anything containing a controlled drug; > 2. the keys of anything containing a controlled drug; > 3. the keys of any place or premises or any part thereof in which a controlled drug is found; or > 4. a document of title relating to a controlled drug or any other document intended for the delivery of a controlled drug, > > shall, until the contrary is proved, be presumed to have had that drug in his possession. Furthermore, any person who has a controlled drug in his possession shall be presumed to have known the nature of that drug.[*citation needed*] The majority of executions in Singapore are for drug offences. Since 2010, 23 prisoners have been executed for drug offences, while only five have been executed for other offences, such as murder. Death penalty supporters, such as blogger Benjamin Chang, claim that Singapore has one of the lowest prevalence of drug abuse worldwide. Chang claims, for instance, that over two decades, the number of drug abusers arrested each year has declined by two-thirds, from over 6,000 in the early 1990s to about 2,000 in 2011. The validity of these figures is disputed by other Singaporeans, such as drugs counsellor Tony Tan. The [United Nations Office on Drugs and Crime](/wiki/United_Nations_Office_on_Drugs_and_Crime) notes that Singapore remains a transit destination for drug traffickers in Asia, drug seizures continue to increase, and heroin drug use within Singapore is continuing to rise. Ironically, Singapore's reputation for having some of the toughest anti drug laws in the world has in the past made it an attractive transit point for drug traffickers, as foreign airport officials knew the vast majority of people would not risk the death penalty for carrying drugs via the city state. In 1989, [Central Narcotics Bureau](/wiki/Central_Narcotics_Bureau) director Poh Geok Ek stated that drug syndicates pick Singapore as a transit point as they believe foreign law enforcement agencies would be less stringent in checking their [couriers](/wiki/Mule_(smuggling)) on arrival if their flight departed from Singapore, rather than from other neighbouring [drug producing countries](/wiki/Golden_Triangle_(Southeast_Asia)) that are high on their priority list. In 1993, a Central Narcotics Bureau officer stated that the drug traffickers they targeted could be graded into two broad categories: Singaporeans and Malaysians supplying the local market, and foreigners only transiting through Singapore while on the way to [North America](/wiki/North_America) and [Europe](/wiki/Europe). The same source estimated that 70 percent of the traffickers arrested in Singapore belong to the first category, and smuggle in relatively small amounts of low quality Number 3 [heroin](/wiki/Heroin) (with less than 5 percent purity) from [Malaysia](/wiki/Malaysia), often via the [Johor–Singapore Causeway](/wiki/Johor%E2%80%93Singapore_Causeway). The other 30 percent in the second category are usually Thais, Hongkongers, Nigerians or Europeans, who smuggle large quantities of high quality Number 4 heroin (with more than 80 percent purity) from Thailand via Singapore and onwards to North America or Europe, and have no intention of distributing the narcotics in Singapore itself. They do this in the belief that [customs officers](/wiki/Customs_officers) will be less strict when they arrive at their destination as they had transited via Singapore, he added. ### Internal Security Act The preamble of the [Internal Security Act](/wiki/Internal_Security_Act_(Singapore)) states that it is an Act to \"provide for the internal security of Singapore, preventive detention, the prevention of subversion, the suppression of organised violence against persons and property in specified areas of Singapore, and for matters incidental thereto\". The [President](/wiki/President_of_Singapore) has the power to designate certain security areas. Any person caught in the possession or with someone in possession of firearms, ammunition or explosives in a security area can be punished by death. ### Kidnapping Act The terms of the [Kidnapping Act](/wiki/Kidnapping_Act_(Singapore)) designate abduction, wrongful restraint or wrongful confinement for ransom as capital offences. The punishment is this case is death by hanging or [imprisonment for life](/wiki/Life_imprisonment_in_Singapore) and, if the offender is not sentenced to death, he is also liable to [caning](/wiki/Caning_in_Singapore). ## Death row conditions A 1978 newspaper article described the [death row](/wiki/Death_row) section of the original Changi Prison as consisting of 24 cells arranged in a horse shoe shaped block around an open air grassy exercise yard. The exercise area itself was enclosed in steel bars and had a wire mesh roof to prevent escape by helicopter. [Amnesty International](/wiki/Amnesty_International) reports that death row inmates are housed in cells of roughly three square metres (32 square feet). Walls make up three sides, while the fourth is made up of vertical bars. They are equipped with a toilet, a sleeping mat, and a bucket for washing. Exercise is permitted twice a day for half an hour at a time. Four days before the execution, the condemned is allowed to watch television or listen to the radio. Special meals of their choice are also cooked, if within the prison budget. In 1994, inmates had a budget of [S$](/wiki/Singapore_dollar)22 for their last meal. One documented last meal of an inmate was the last meal order of [Tangaraju Suppiah](/wiki/Tangaraju_Suppiah), who asked for chicken rice, ice cream soda, nasi biryani and Milo-flavoured sweets before his hanging, while another was [John Martin Scripps](/wiki/John_Martin_Scripps), who ordered a pizza and a cup of hot chocolate before his execution. Visiting rights are increased from one 20-minute visit per week to a maximum of four hours each day, though no physical contact is allowed with any visitors. In addition, two days before an execution, an inmate is allowed to have a photo shoot and be given their own clothes to pose during a photoshoot; the photo will be given to their families as remembrance. ## Public debate ### Public response Public debate in the Singaporean news media on the death penalty is almost non-existent, although the topic is occasionally discussed in the midst of highly publicised criminal cases.[*citation needed*] Efforts to garner public opinion on the issue are rare, although it has been suggested that the population is influenced by a [legalist](/wiki/Legalism_(Chinese_philosophy)) philosophy which holds that harsh punishment deters crime and helps maintain social peace and harmony. In October 2007, Senior Minister of State for Law and Home Affairs [Ho Peng Kee](/wiki/Ho_Peng_Kee) said in [Parliament](/wiki/Parliament_of_Singapore) that \"Certain of us may hold the view that the death penalty should be abolished. But in a survey done two years ago, reported in the *[Straits Times](/wiki/Straits_Times)*, 95% of Singaporeans feel that the death penalty should stay. This is something which has helped us to be safe and secure all these years and it is only reserved for a very few select offences.\" [Joshua Benjamin Jeyaretnam](/wiki/Joshua_Benjamin_Jeyaretnam), an opposition [Member of Parliament](/wiki/Member_of_Parliament), was reportedly only given a few minutes to speak in Parliament on the issue before his comments were rebutted by Ho Peng Kee. There were a few instances where in certain high-profile cases, the public would argue for the death penalty to be imposed on those who allegedly committed murder. In the case of [Annie Ee Yu Lian](/wiki/Annie_Ee_Yu_Lian) who was abused and murdered by her two friends, some Singaporeans were angered at the cruelty displayed by the offenders and felt that the sentences (which were between 14 and 16 years) for grievous hurt were too light, which prompted them to petition for harsher punishments; some even demanded for the death penalty to be imposed on the couple. In another case regarding the death of four-year-old [Mohamad Daniel Mohamad Nasser](/wiki/Death_of_Mohamad_Daniel_Mohamad_Nasser) due to child abuse perpetuated by his mother and her boyfriend, some Singaporeans felt that their sentences of ten to eleven years were too light and petitioned to the courts to sentence the couple to death. Younger generations of Singaporeans tend to have a more liberal approach towards drug use. The government, in response, has introduced education programmes on the dangers of drugs. There were cases of ex-drug convicts who also advocated against the use of drugs; some even agree that the death penalty was effective. A former trafficker once stated that in the past, he would always make sure the measurement of his delivered drugs were below the minimum amount to avoid capital punishment. A female prisoner and drug convict also spoke up about the death penalty while being interviewed in prison, where she was serving 26 years' jail since 2014. She agreed to the relevance and effect of the death penalty in stopping people from selling and taking drugs, as she knew how drug trafficking caused damage to families and inflict sufferings especially to the children of drug addicts. [Simon Khung](/wiki/Simon_Khung), a social media influencer who eventually stopped taking drugs after the 2020 murder of his daughter [Megan Khung](/wiki/Death_of_Megan_Khung) (who was allegedly killed by her mother), told a newspaper in 2024 that he supported the death penalty for drug trafficking, as he felt that the drug situation in Singapore would grow worse in the absence of capital punishment and more people would become drug abusers and ruin their lives like he and the former abusers had in their pasts; Khung's stance was supported by other ex-abusers, and one of them, Bruce Mathieu (who overcame his drug addiction seven years prior), said that the death penalty had deterred him from resorting to drug smuggling. In the aftermath of several executions, there were discussions among the Singaporean public about the need for compassion for some death row inmates, owing to arguments that many death row inmates had come from low-income families or had drug addictions before ending up on death row. However, the public sentiments remained leaning towards capital punishment for drugs, owing to arguments concerning rampant rates of drug trafficking in the [Golden Triangle](/wiki/Golden_Triangle_(Southeast_Asia)) in [Southeast Asia](/wiki/Southeast_Asia), the effectiveness of the death penalty in maintaining Singapore's low crime rate, and the impact drugs have had on the addicts and their families. When 31-year-old Singaporean Shen Hanjie was sentenced to death for trafficking 34.94g of pure heroin in October 2022, a huge majority of the netizens showed support for the death sentence in Shen's case, with some expressing sympathy for his family, especially his parents. Most of the supporters also stated that the death sentence should be deployed for drug crimes due to its strong deterrent effect. Shen's death sentence was subsequently upheld after he lost his appeal on 1 March 2024. When [CNN](/wiki/CNN) covered the topic of Singapore's death penalty and Changi Prison in October 2024, it was noted that the death penalty continued to thrive with huge public support, and there were about 40 inmates on death row as of the time when CNN covered the issue exclusively. An inmate, a former schoolteacher who introduced himself as Matthew, stated he believed in the deterrent effect of the death penalty for drug trafficking; Matthew was then serving a seven-year jail term for non-capital drug charges. However, his sentiments were not shared by the family members of death row inmates who spoke to CNN. Haslinda Ismail, whose son Muhammed Izwan bin Borhan was sentenced to death for diamorphine trafficking, stated that she was devastated over the outcome and felt resentful towards the government for not giving her son a second chance; Izwan remained on death row awaiting to be hanged as of the time of writing. Similarly, [Nazeri Lajim](/wiki/Nazeri_Lajim)'s sister, Nazira Lajim, who was an anti-death penalty activist, stated that she was sad and angry that her brother was executed despite her push for a life sentence, and likely due to her brother's hanging in 2022, Nazira encouraged her adult children to permanently leave Singapore and emigrate to Australia. ### Protests and opposition Before the hanging of [Shanmugam Murugesu](/wiki/Shanmugam_Murugesu), a three-hour vigil was held on 6 May 2005. The organisers of the event at the [Furama Hotel](/wiki/Furama_Hotel) said it was the first such public gathering organised solely by members of the public against the death penalty in Singapore. Murugesu had been arrested after being caught in possession of six packets containing just over 1 kg of [cannabis](/wiki/Cannabis_(drug)) after returning from Malaysia. He admitted knowledge of one of the packets, which contained 300 grams, but not the other five. The event was reportedly unreported by mainstream media outlets, and was later shut down by the police. After the hanging of Australian citizen [Van Tuong Nguyen](/wiki/Van_Tuong_Nguyen) on 2 December 2005, Susan Chia, province leader of the [Good Shepherd Sisters](/wiki/Good_Shepherd_Sisters) in Singapore, declared that \"the death penalty is cruel, inhumane and it violates the right to life.\" Chia and several other nuns comforted Nguyen's mother two weeks before his execution for heroin trafficking. Singapore's death penalty laws have drawn comments in the media. For example, science fiction author [William Gibson](/wiki/William_Gibson), while a journalist, wrote a travel piece on Singapore that he sarcastically titled \"[Disneyland with the Death Penalty](/wiki/Disneyland_with_the_Death_Penalty)\". In 2010, British author [Alan Shadrake](/wiki/Alan_Shadrake) published his book, *Once a Jolly Hangman: Singapore Justice in the Dock*, which was critical of the [Singapore judicial system](/wiki/Judicial_system_of_Singapore). The main criticism of the book asserted that wealthy, often well-connected foreigners, could expect leniency from law enforcement, while the poor and disenfranchised were in effect \"summarily executed\". Shadrake's book highlighted the contrasting fortunes of German citizen Julia Suzanne Bohl, who ran a major drug ring catering to well off professionals and was herself caught with a capital amount (over 500 grams) of cannabis when police raided her apartment, to Singaporean drug addict [Yen May Woen](/wiki/Yen_May_Woen) who was caught in possession of 30 grams of low quality heroin. While Bohl had her charges reduced after German diplomatic pressure was allegedly applied amidst much media coverage of her plight and returned to Germany after 3 years imprisonment, the case of Woen received very little coverage in the local newspapers and she was executed after the trial judge handed down the mandatory death sentence. Shadrake was arrested whilst promoting the book in Singapore and later sentenced to six weeks in prison for [contempt of court](/wiki/Contempt_of_court). He is also charged with [criminal defamation](/wiki/Defamation#Online_defamation). The case attracted worldwide attention, putting the Singapore legal system in the spotlight. Shadrake apologised to the court if he had offended the sensitivities of the judiciary and did not mean to undermine the judges or the judiciary, but stood by his book, apart from a mistake contained within. The judge, [Quentin Loh](/wiki/Quentin_Loh), dismissed his apology as \"nothing more than a tactical ploy in court to obtain a reduced sentence\". Shadrake's conviction for [scandalising the court](/wiki/Offence_of_scandalizing_the_court_in_Singapore) was upheld by the [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore). On 5 October 2018, Singapore carried out three executions of drug traffickers - Zainudin bin Mohamed, Abdul Wahid Bin Ismail, and Mohsen Bin Na’im, it led to the Asian Forum for Human Rights and Development (FORUM-ASIA) and 28 civil society organizations in Asia showing condemnation over the triple hangings, and these groups the death sentence was a grave violation of the right to life, which was \"the most fundamental and essential human right for other rights to be realized\". They also argued that the executions of Zainudin, Abdul Wahid and Mohsen did not serve any purpose for the island-state and its citizens in terms of fulfilling the ends of justice. In March 2022, when Singapore dismissed the final appeal of Malaysian death row prisoner [Nagaenthran K. Dharmalingam](/wiki/Nagaenthran_K._Dharmalingam) and later authorized the execution of Singaporean drug convict [Abdul Kahar Othman](/wiki/Abdul_Kahar_Othman), which was its first execution during the [COVID-19 pandemic](/wiki/COVID-19_pandemic), there were 400 Singaporeans, including rights activists [Jolovan Wham](/wiki/Jolovan_Wham), [Kirsten Han](/wiki/Kirsten_Han) and Kokila Annamalai, who took part in a protest against the government's use of the death penalty at [Hong Lim Park](/wiki/Hong_Lim_Park). With regards to Abdul Kahar's execution, the [European Union](/wiki/European_Union) (EU) condemned it and stated that capital punishment is a cruel and inhumane punishment, which not only failed to deter crime but also defied both humanity's dignity and integrity. Two days prior to Nagaenthran's execution (which took place on 27 April 2022), a candlelight vigil was held on his behalf. In October 2023, former [Mongolian](/wiki/Mongolia) president [Elbegdorj Tsakhia](/wiki/Elbegdorj_Tsakhia) wrote to [CNN](/wiki/CNN), expressing his opposition to the death penalty and he cited Singapore as an example. Stating that [Mongolia had abolished capital punishment](/wiki/Capital_punishment_in_Mongolia) and the crime rate in Mongolia never increased in the aftermath, Elbegdorj stated that he was concerned with the past 16 executions of low to mid-level drug traffickers in Singapore since March 2022, especially the July 2023 hanging of [Saridewi Djamani](/wiki/Saridewi_Djamani) (Singapore's first female to be put to death since 2004), and while he avers his respect for Singapore in terms of its prosperity and stability, Elbegdorj hoped that Singapore could re-evaluate the effectiveness of using the death penalty to curb drug crimes in favour of eventual abolition, due to the death penalty not able to fully uproot the cause of drug trafficking. He also stated that with the newly elected president [Tharman Shanmugaratnam](/wiki/Tharman_Shanmugaratnam) taking office, he hoped that the president could affirm the presidential powers of granting clemency to those on death row to soften the government's retentionist stance on capital punishment. In 2024, anti-death penalty activist [Kokila Annamalai](/wiki/Kokila_Annamalai) was the first activist within Singapore to publicly refuse to comply with the [Protection from Online Falsehoods and Manipulation Act](/wiki/Protection_from_Online_Falsehoods_and_Manipulation_Act_2019) (POFMA) after the [Singaporean government](/wiki/Government_of_Singapore) accused her of posting false information about its actions on social media concerning its use of the death penalty. ### Law Society review In December 2005, the [Law Society](/wiki/Law_Society_of_Singapore) revealed that it has set up a committee, named *Review Committee on Capital Punishment*, to examine capital punishment in the country. The President of the Society, [Senior Counsel](/wiki/Senior_Counsel) [Philip Jeyaretnam](/wiki/Philip_Jeyaretnam), said that the main focus of the review was on issues regarding administering the death penalty such as whether it should be mandatory. A report of the review would be submitted to the [Ministry of Law](/wiki/Ministry_of_Law_(Singapore)). On 6 November 2006, they were invited to give its views on proposed amendments to the Penal Code to the Ministry of Home Affairs. In their report, issued on 30 March 2007, they argued against the mandatory death penalty: > The death penalty should be discretionary for the offences where the death sentence is mandatory – murder, drug trafficking, firearms offences and sedition – a position similar to that for the offence of kidnapping. There are strong arguments for changing the mandatory nature of capital punishment in Singapore. Judges should be given the discretion to impose the death penalty only where deemed appropriate. ### Singapore government's response The Singapore government states that the death penalty is only used in the most serious of crimes, sending, they say, a strong message to potential offenders. They point out that in 1994 and 1999 the [United Nations General Assembly](/wiki/United_Nations_General_Assembly) failed to adopt [United Nations resolutions](/wiki/United_Nations_resolution) calling for a moratorium on the death penalty worldwide, as a majority of countries opposed such a move. Singapore's Permanent Representative to the [United Nations](/wiki/United_Nations) wrote a letter to the [Special Rapporteur](/wiki/United_Nations_Special_Rapporteur) on [extrajudicial](/wiki/Extrajudicial_punishment), summary or arbitrary executions in 2001 which stated: \"... the death penalty is primarily a criminal justice issue, and therefore is a question for the sovereign jurisdiction of each country [...] the right to life is not the only right, and [...] it is the duty of societies and governments to decide how to balance competing rights against each other.\" In January 2004, the [Ministry of Home Affairs](/wiki/Ministry_of_Home_Affairs_(Singapore)) issued a response to [Amnesty International](/wiki/Amnesty_International)'s report, \"Singapore: The death penalty - A hidden toll of executions\". It defended Singapore's policy to retain the death penalty, predicating its arguments on, among others, the following grounds: - There is no international consensus on whether the death penalty should be abolished. - Each country has the sovereign right to decide on its own judicial system, taking into account its own circumstances. - The death penalty has been effective in keeping Singapore one of the safest places in the world to work and live in. - The application of the death penalty is only reserved for \"very serious crimes\". The Ministry of Home Affairs also refuted Amnesty International's claims of the majority of the executed being foreigners, and that it was \"mostly the poor, least educated, and vulnerable people who are executed\". The Ministry stated: \"Singaporeans, and not foreigners, were the majority of those executed... Of those executed from 1993 to 2003, 95% were above 21 years of age, and 80% had received formal education. About 80% of those who had been sentenced to capital punishment had employment before their convictions.\" Following the hanging of [Van Tuong Nguyen](/wiki/Van_Tuong_Nguyen) in 2005, [Prime Minister](/wiki/Prime_Minister_of_Singapore) [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) reiterated the government's position, stating that \"The evil inflicted on thousands of people with drug trafficking demands that we must tackle the source by punishing the traffickers rather than trying to pick up the pieces afterwards... It's a law which is approved of by Singapore's inhabitants and which allows us to reduce the drug problem.\" In October 2020, Law Minister [K. Shanmugam](/wiki/K._Shanmugam) emphasised that the death penalty is a powerful deterrent to capital crimes in Singapore. He cited the statistics of the rate of firearms-related offences and kidnapping cases had dropped dramatically after the introduction of the death penalty as evidence of its deterrence. Shanmugam also cited that after the government mandates the death penalty since 1991, the average net amount of opium trafficked dropped by 66% and many drug traffickers are illegally transporting less and less amounts of drugs to avoid the punishment. The government conducted surveys on Singaporeans and non-Singaporeans, and the majority of both groups responded that the death penalty is more effective than [life imprisonment](/wiki/Life_imprisonment) in discouraging people from committing capital offences. During a June 2022 [BBC](/wiki/BBC) interview, Shanmugam, who was asked by the host and journalist Stephen Sackur regarding the death penalty for drugs, stated that the death penalty in Singapore was the right punishment adopted by the government to protect Singaporeans and save lives. He also cited a 2021 report by the World Health Organisation that showed there were 500,000 deaths linked to drug abuse in just one year. Shanmugam added that in the 1990s, Singapore was arresting about 6,000 people a year for drugs, but this has now dropped to about 3,000 people a year. He stated that it goes to show how the draconian laws deployed by Singapore on narcotics offences has safeguarded the lives of many locals and maintains a safe society in Singapore. The death penalty response by Shanmugam during the BBC interview was well-received and supported by many members of the public on social media, who also voiced their support for capital punishment for drugs in Singapore. In light of the execution of [Abdul Rahim Shapiee](/wiki/Abdul_Rahim_Shapiee) (and his accomplice), [Pritam Singh](/wiki/Pritam_Singh_(Singaporean_politician)), opposition leader of [Parliament](/wiki/Parliament_of_Singapore) and chairman of [Workers' Party](/wiki/Workers%27_Party_(Singapore)), wrote to Singapore newspaper [*Today*](/wiki/Today_(Singapore_newspaper)) to express his support for the death penalty for drug crimes in Singapore and the execution of drug traffickers. Singh nonetheless argued that there should be changes made to rectify the shortcomings in determining the extent of one's cooperation with the authorities during investigations before sentencing, citing cases of traffickers receiving death sentences before courts decided they were couriers and could sentence them for life, as well as cases like Abdul Rahim's, who was sentenced to death despite being a courier and having provided substantive assistance. Singh also expressed concern about the need to curb the frequent abuse of court processes by drug traffickers and their lawyers. The [Ministry of Home Affairs](/wiki/Ministry_of_Home_Affairs_(Singapore)) (MHA) revealed that from 2013 to early 2022, certificates of substantive assistance were issued to 82 out of 104 drug traffickers regardless of nationality, while there were 14 out of the remaining 22 sentenced to death and the other eight traffickers sentenced to life imprisonment due to mental illnesses. Another data revealed that 78% of the traffickers were not subjected to capital punishment despite having brought drugs exceeding the capital threshold, as a result of plea bargains to reduce their capital charges or certifications for substantive assistance. ## International impact of Singapore's death penalty laws ### Impact on negotiations of extraditing suspects to Singapore In 2002, Singapore tried to negotiate with [Australia](/wiki/Australia) for the extradition of a British murder suspect and fugitive [Michael McCrea](/wiki/Michael_McCrea), who was wanted for the double murder of a couple whose corpses were discovered abandoned in a car at [Orchard Towers](/wiki/Orchard_Towers). However, McCrea, who was arrested in Australia, was not extradited as Australia, which abolished the death penalty for all offences by then, was not legally allowed to extradite suspects back to countries where they would face the death sentence. It was only after Singapore gave the Australian government the assurance that McCrea would not be hanged even if he was convicted of murder, which allowed McCrea to be sent back to Singapore for trial. McCrea was eventually convicted of culpable homicide and destroying evidence of a murder case, and sentenced to a total of 24 years in jail. This left an impact and precedent on Singapore's avenues to successfully negotiating for extradition of suspects from countries where the death penalty or caning was not practised, including the extradition of suspected bank robber [David James Roach](/wiki/David_James_Roach), whom the Singapore government promised would not face caning for robbery. Roach was eventually sent back to Singapore, where he later served five years in prison, and he was pardoned from caning by [President](/wiki/President_of_Singapore) [Halimah Yacob](/wiki/Halimah_Yacob). ### Impact on official debate and discussion in the United States In 2012, a number of American elected officials and office-seekers suggested that Singapore's success in combating drug abuse should be examined as a model for the United States. [Michael Bloomberg](/wiki/Michael_Bloomberg), a former [Mayor](/wiki/Mayor_of_New_York_City) of [New York City](/wiki/New_York_City), said that the United States could learn a thing or two from nations like Singapore when it came to drug trafficking, noting that \"executing a handful of people saves thousands and thousands of lives.\" The last execution in [New York](/wiki/New_York_(state)) took place in 1963. Several courts have ruled that the death penalty violates the [New York Constitution](/wiki/New_York_Constitution) (see *[People v. LaValle](/wiki/People_v._LaValle)*). In 2007, the state of New York abolished the death penalty. The death penalty has been abolished in 23 states, as well as in [Washington D.C.](/wiki/Washington_D.C.), with the most recent being [Virginia](/wiki/Virginia) in 2021. However, certain states, such as [Texas](/wiki/Texas) and [Georgia](/wiki/Georgia_(U.S._state)), still regularly execute prisoners for [aggravated murder](/wiki/Aggravated_murder). Former presidential candidate [Newt Gingrich](/wiki/Newt_Gingrich) repeated his longstanding advocacy for Singaporean methods in the United States' [war on drugs](/wiki/War_on_drugs) during campaign interviews and speeches. ## Statistics The following table of executions was compiled by [Amnesty International](/wiki/Amnesty_International) from several sources, including statistics supplied by the [Ministry of Home Affairs](/wiki/Ministry_of_Home_Affairs_(Singapore)) in January 2001 and government figures reported to [Agence France-Presse](/wiki/Agence_France-Presse) in September 2003. Numbers in curly brackets are the number of foreign citizens executed, according to information disclosed by the Ministry of Home Affairs. YearMurderDrug-relatedFirearmsTotal1991150619921371211993520719942154(/wiki/Murder_of_Mirza_Abdul_Halim)7619952052(/wiki/Ng_Theng_Shuang)73199610 {7}40 {10}0501997{3}11 {2}(/wiki/Lim_Chwee_Soon)1519984 {1}24 {5}02819998 {2}35 {7}04320004 {2}17 {5}0212001422(/wiki/1995_Rowell_Road_shooting)272002523028200351401920044318{2}20052608{1}20064228{2}2007(/wiki/Kallang_River_body_parts_murder)203{2}20084206{3}200913(/wiki/Tan_Chor_Jin)5{2}20100000201122042012000020130000201402022015(/wiki/Murder_of_Tham_Weng_Kuen)304201622042017080820182110132019220420200000202100002022011011202305052024(/wiki/Ahmed_Salim_(murderer))8092025215017 Detailed statistics were not released by the [Singapore government](/wiki/Government_of_Singapore) between 2000 and 2006. Singapore's [Prime Minister](/wiki/Prime_Minister_of_Singapore) [Goh Chok Tong](/wiki/Goh_Chok_Tong) told the [BBC](/wiki/BBC) in September 2003 that he believed there were \"in the region of about 70 to 80\" hangings in 2003. Two days later he retracted his statement, saying the number was in fact ten. In total, at the end of 2003, 19 people were hanged. While no information is issued on the race and ethnicity of death row inmates, it was noted in 2021, during an appeal from a number of Malay death row inmates who alleged racism on the part of the government, that there were a large number of Malays among those on death row, with only handfuls of other minority races. Between 2010 and 2021, Malays made up 66 of the 120 prosecuted for capital drug offences, with 76% of cases concluding with the death sentence. 50 out of 77 people sentenced to death between 2010 and 2021 were Malays, with a remaining 15 Indians, 10 Chinese and two from other races. Since 2010, of all the 77 sentenced to death, there were 14 Malaysians being condemned to death row, with eleven of them ethnic Indians, two Malays and one Chinese. Former chief executioner, Darshan Singh, who died from COVID-19 complications on 31 October 2021, stated that he had executed more than 850 people during his service, which began in 1959. When conducting the executions, he would use the phrase: \"I am going to send you to a better place than this. God bless you.\" At one point, Singh executed 18 people on one day; these 18 people were among the 58 rioters who [killed four prison officers](/wiki/Pulau_Senang_prison_riots) while they were serving their jail terms in a [Pulau Senang](/wiki/Pulau_Senang) island prison in 1963. Singh also said that he has hanged seven people within 90 minutes; these seven men were the culprits of the 1971 [Gold Bars triple murders](/wiki/Gold_Bars_triple_murders), in which a businessman and illegal gold trader was killed together with his driver and colleague over a total of 120 gold bars. Executions peaked between 1994 and 1998; Singapore had the second highest per-capita execution rate in the world during this period, estimated by the [United Nations](/wiki/United_Nations) to be 13.83 executions annually per one million people, just behind [Turkmenistan](/wiki/Turkmenistan) with 14.92. Since then, executions have become far less common, with some years having no executions at all. For example, no one was executed in 2012 and 2013, and two persons were executed in 2014. Nevertheless, in the late 2010s, the number of executions has started to increase again: in 2018, 13 people were executed, the most since at least 2003. and four people (including two unreported executions) were hanged in 2019. No one has been executed from the start of 2020 to August 2020, due to the [COVID-19 pandemic in Singapore](/wiki/COVID-19_pandemic_in_Singapore). The first person to be sentenced to death during the COVID-19 pandemic in Singapore was Punithan Genasan, a 37-year-old Malaysian who was also the first to be sentenced to death on 15 May 2020 via a remote court hearing on [Zoom](/wiki/Zoom_Video_Communications). Punithan, who was convicted of drug trafficking, was later acquitted on 31 October 2022 upon appeal. The first fully virtual court hearing of a capital case was made via [Zoom](/wiki/Zoom_Video_Communications) on 23 April 2020, when the [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore) [acquitted](/wiki/Acquittal) 27-year-old Singaporean drug suspect [Mohammad Azli Mohammad Salleh](/wiki/Mohammad_Azli_Mohammad_Salleh) and dismissed both his drug charge and his death sentence. There were originally two executions scheduled for drug traffickers Syed Suhail bin Syed Zin and Mohd Fadzir bin Mustaffa on 18 September 2020 and 24 September 2020 respectively, but they were subsequently postponed due to stays of execution granted pending last-minute appeals against the death sentences. As a result, there was no one executed in 2020. Similarly between January and October 2021, no new execution dates were set for the inmates on [Singapore](/wiki/Singapore)'s [death row](/wiki/Death_row), due to the ongoing COVID-19 pandemic and resurgence of community cases. The execution of [Nagaenthran K. Dharmalingam](/wiki/Nagaenthran_K._Dharmalingam) was supposed to be carried out on 10 November 2021, but it was postponed due to Nagaenthran contracting [COVID-19](/wiki/COVID-19). The suspension of Nagaenthran's execution in 2021 also led to no executions being carried out in 2021 itself. There were originally two executions of [Roslan Bakar](/wiki/Roslan_Bakar) and [Pausi Jefridin](/wiki/Pausi_Jefridin) to be carried out on 16 February 2022 and a third execution of [Rosman Abdullah](/wiki/Rosman_Abdullah) on 23 February 2022 before they were postponed due to the men's appeals. Due to the increasing notices of executions being revealed publicly, there were lingering concerns from civil groups and international figures that Singapore might resume executions to accommodate the growing death row inmate population at Changi Prison. The first death row prisoner to be hanged in Singapore during the COVID-19 pandemic was 68-year-old Singaporean drug offender [Abdul Kahar Othman](/wiki/Abdul_Kahar_Othman) on 30 March 2022, who had not appealed against his sentence and later executed as scheduled, therefore resuming executions in Singapore. By the time Abdul Kahar was executed, there were 62 prisoners on death row, awaiting execution (reduced to 61 with Nagaenthran's execution). [Nagaenthran K. Dharmalingam](/wiki/Nagaenthran_K._Dharmalingam) was the second to be hanged on 27 April 2022 after Abdul Kahar. [Datchinamurthy Kataiah](/wiki/Datchinamurthy_Kataiah) was originally the third in line to be executed on 29 April 2022 after Nagaenthran before his execution was postponed due to an appeal. On 7 July 2022, [Kalwant Singh Jogindar Singh](/wiki/Kalwant_Singh_Jogindar_Singh) and [Norasharee Gous](/wiki/Norasharee_Gous) became the third and fourth convicts to be hanged in Singapore in 2022. In the same month, [Nazeri Lajim](/wiki/Nazeri_Lajim) was executed 15 days after Kalwant and Norasharee. Three more hangings - one on 26 July and two (Malaysian Rahmat Karimon and his accomplice Zainal Hamad) on 2 August - were conducted after Nazeri's execution. On 5 August 2022, 45-year-old Singaporean [Abdul Rahim Shapiee](/wiki/Abdul_Rahim_Shapiee) and his 49-year-old accomplice [Ong Seow Ping](/wiki/Ong_Seow_Ping) were the ninth and tenth to be executed. A 55-year-old Singaporean, whose name is unknown, was the eleventh to be executed for a drug charge on 7 October 2022. In total, eleven executions took place in the year 2022. In 2023, the first execution was carried out on 26 April 2023, when a 46-year-old Singaporean [Tangaraju Suppiah](/wiki/Tangaraju_Suppiah), who was convicted in 2018 of marijuana trafficking, was hanged at dawn. On 16 May 2023, three weeks after Tangaraju was put to death, 36-year-old Muhammad Faizal Mohd Shariff, a Singaporean who was found guilty in 2019 of trafficking 1.5 kg of marijuana was reported to have lost his final appeal to commute his sentence. A day after losing his appeal, Muhammad Faizal was hanged at dawn on 17 May 2023, with the authorities confirming his execution despite not naming Muhammad Faizal out of consideration for his family's need for privacy. Two executions of a 56-year-old man and 45-year-old woman (both convicted of drug offences) were scheduled to take place on 26 July and 28 July 2023 respectively; the female offender [Saridewi Djamani](/wiki/Saridewi_Djamani) was believed to be the first woman to be executed in 19 years, as the last known execution of a woman took place on 19 March 2004, when 37-year-old [Yen May Woen](/wiki/Yen_May_Woen) was put to death for diamorphine trafficking. The 56-year-old male drug offender Mohd Aziz Hussain, as well as Saridewi, were both hanged as scheduled, becoming the third and fourth persons respectively to be executed in Singapore in the year of 2023. On 3 August 2023, Singapore carried out the hanging of [Mohamed Shalleh Abdul Latiff](/wiki/Mohamed_Shalleh_Abdul_Latiff), a 39-year-old Singaporean and former delivery driver found guilty of trafficking 54.04g of diamorphine in 2016. [Ahmed Salim](/wiki/Ahmed_Salim_(murderer)), who was found guilty of the murder of his former fiancée, was the first criminal hanged in Singapore in 2024. Prior to Ahmed's execution on 28 February 2024, the last judicial hanging for murder was carried out in 2019. As of November 2024, another eight traffickers, including [Rosman Abdullah](/wiki/Rosman_Abdullah), [Roslan Bakar and Pausi Jefridin](/wiki/Roslan_Bakar_and_Pausi_Jefridin), were hanged in Singapore after Ahmed. ### Foreign nationals The people on death row include foreign nationals, many of whom were convicted of drug-related offences. These inmates come from a diverse range of countries, including Australia, Bangladesh, China, Ghana, India, Indonesia, Malaysia, the Netherlands, Nigeria, Pakistan, the Philippines, Portugal, Sri Lanka, Thailand, the United Kingdom, and Vietnam. Figures released by the Singapore government show that between 1993 and 2003, 36% of those executed were foreigners, including some residents in Singapore (half of Singapore residents are foreigners). ## Cases of people sentenced to death ### Murder cases - 1965: Tan Kheng Ann (alias Robert Black) and 17 others who led the [Pulau Senang prison riot](/wiki/Pulau_Senang_prison_riot). They were found guilty of the murders of a prison officer and his three assistants, and hanged on 29 October 1965. - 1967: [Sunny Ang](/wiki/Sunny_Ang), a Grand Prix driver and part-time student who killed his girlfriend Jenny Cheok for her insurance during a scuba diving trip near [Sisters' Islands](/wiki/Sisters%27_Islands) in 1963. He was the first person in Singapore to be convicted of murder solely based on [circumstantial evidence](/wiki/Circumstantial_evidence) and [without a body](/wiki/Murder_conviction_without_a_body). He received a mandatory death sentence and was executed on 6 February 1967. - 1968: [Usman bin Haji Muhammad Ali](/wiki/Usman_bin_Haji_Muhammad_Ali) and [Harun Thohir](/wiki/Harun_Thohir), two [Indonesian marines](/wiki/Indonesian_Marine_Corps) who carried out the 1965 [MacDonald House bombing](/wiki/MacDonald_House_bombing) which killed three people (when Singapore was still a part of Malaysia). They were convicted of murder and hanged on 17 October 1968. - 1970: Lim Heng Soon and Low Ngah Ngah, the two Singaporeans found guilty of stabbing and killing police detective [D. Munusamy](/wiki/D._Munusamy) in February 1968. Both men were sentenced to hang on 30 November 1968, and after losing their appeals to the Singaporean Court of Appeal and Privy Council in London between November 1969 and March 1970, the duo were eventually hanged. - 1972: Liew Kim Siong and Kee Ah Tee, the two Singaporean youths hanged in 1972 for the 1969 [Upper Bukit Timah factory murders](/wiki/Upper_Bukit_Timah_factory_murders), where two Hongkongers were stabbed to death during the duo's robbery bid - 1973: Lee Chor Pet, Lim Kim Kwee and Ho Kee Fatt, the three kidnappers who were found guilty of kidnapping and murdering 19-year-old [Ong Beang Leck](/wiki/Ong_Beang_Leck), a millionaire's son. They were hanged on 27 January 1973. - 1973: [Osman bin Ali](/wiki/Osman_bin_Ali), an Indonesian-born Singaporean and gardener who was found guilty of murdering a cook and an amah at a bungalow in Leedon Park. He was sentenced to death in September 1971, and hanged on 27 July 1973 after losing his appeal. - 1973: [Mimi Wong Weng Siu](/wiki/Mimi_Wong_Weng_Siu) and her husband [Sim Woh Kum](/wiki/Sim_Woh_Kum), the first couple to be sentenced to death in Singapore. Both Wong and Sim were convicted of the 1970 [murder of Ayako Watanabe](/wiki/Murder_of_Ayako_Watanabe), the wife of Wong's Japanese lover, and hanged on 27 July 1973. Wong was also the first woman to be executed for murder in Singapore since its independence. - 1973: [Chow Kim Hoong](/wiki/Chow_Kim_Hoong), a Malaysian-born [stateless person](/wiki/Statelessness) found guilty of the 1969 killing of his brother's fiancée and sentenced to death in July 1970. Chow managed to appeal for a re-trial but the death sentence was reinstated in November 1971. Chow was hanged on 3 August 1973. - 1975: Andrew Chou Hock Guan, David Chou Hock Heng, Peter Lim Swee Guan, Alex Yau Hean Thye, Stephen Francis, Richard James, and Konesekaram Nagalingam, who were hanged on 28 February 1975 for the [Gold Bars triple murders](/wiki/Gold_Bars_triple_murders). - 1975: [Ismail bin U. K. Abdul Rahman](/wiki/Ismail_bin_U._K._Abdul_Rahman), a Singaporean labourer found guilty of murdering a one-armed man and sentenced to death. Ismail was hanged on 28 February 1975. - 1975: [Chelliah Silvanathan](/wiki/Chelliah_Silvanathan), a Hai Lok San gang member who was hanged on 11 April 1975 for the murder of a fellow gang member. - 1975: [Lim Kim Huat](/wiki/Lim_Kim_Huat) and [Neoh Bean Chye](/wiki/Neoh_Bean_Chye), the two Malaysian gunmen found guilty of shooting and killing wine shop proprietor Chew Liew Tea and hanged on 27 June 1975. - 1976: Pehn Kwan Jin, a Singaporean seaman who was found guilty of murdering [Tan Eng Kim](/wiki/Bras_Basah_coffeeshop_murder) and hanged on 16 April 1976. - 1976: K. Vijayan Krishnan, a Malaysian labourer who was hanged on 30 April 1976 for the 1973 [murder of Ahora Murthi Krishnasamy](/wiki/Murder_of_Ahora_Murthi_Krishnasamy) at [Kampong Kapor](/wiki/Kampong_Kapor_Constituency). - 1977: [Nadarajah Govindasamy](/wiki/Nadarajah_Govindasamy), a transport company owner charged with the violent murder of his daughter's fiancé Mohamed Azad Mohamed Hussein. Nadarajah was found guilty and given the death penalty in August 1975, and he was later put to death on 28 January 1977. - 1979: [Visuvanathan Thillai Kannu](/wiki/Visuvanathan_Thillai_Kannu), a Malaysian labourer who was found guilty of murdering a road sweeper in 1976. Visuvanathan was hanged on 25 May 1979. - 1979: Tay Eng Whatt, an unemployed Singaporean who was hanged on 29 June 1979 for the 1974 [murder of Wong Thng Kiat](/wiki/Murder_of_Wong_Thng_Kiat). - 1980: Quek Kee Siong, a labourer who was found guilty of the rape and murder of ten-year-old [Cheng Geok Ha](/wiki/Cheng_Geok_Ha) and sentenced to death in March 1979. He lost his appeal in November 1980, and later hanged. - 1982: [Kalidass Sinnathamby Narayanasamy](/wiki/Kalidass_Sinnathamby_Narayanasamy), a lance corporal of the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces) who molested and killed his seven-year-old niece. He was sentenced to hang for murder on 27 March 1980 and lost his appeal in May 1982, and sometime afterwards, he was executed. - 1982: [Haw Tua Tau](/wiki/Haw_Tua_Tau), a hawker who was found guilty of murdering Phoon Ah Leong and Hu Yuen Keng back in 1976. After losing his appeals, Haw was hanged sometime in 1982. - 1983: [Vadivelu Kathikesan](/wiki/Vadivelu_Kathikesan_murders), a Singaporean charged with the murders of two men between June and October 1979. Vadivelu was sentenced to hang in March 1982 for the October 1979 murder of cigarette stall owner Mohamed Dawood Abdul Jaffar, and he was hanged on an unknown date after the loss of his appeal in January 1983. His other charge of killing Abdul Rahiman Adnan in June 1979 was withdrawn after his conviction for the Mohamed Dawood murder. - 1984: Ong Hwee Kuan, Ong Chin Hock and Yeo Ching Boon were hanged on 24 February 1984 for the robbery, kidnapping and murder of a policeman, [Lee Kim Lai](/wiki/Lee_Kim_Lai), on 25 April 1978. The trio were also responsible for the murder of a taxi driver Chew Theng Hin on the same night Lee was killed. - 1986: Sim Min Teck, one of the three perpetrators of the 1980 [Jurong fishing port murders](/wiki/Jurong_fishing_port_murders), which he committed when he was 18. He was sentenced to death for murder in March 1985 and lost his appeal in July 1986, before he was hanged. - 1986: [Ramu Annadavascan](/wiki/Ramu_Annadavascan), a lorry driver who used a gardening rake to assault a 45-year-old boilerman before burning him alive, was hanged on 19 September 1986. - 1986: Wong Foot Ling, who was hanged on 19 September 1986 for murdering his lover [Khor Gek Hong](/wiki/Murder_of_Khor_Gek_Hong) - 1988: [Lau Ah Kiang](/wiki/Lau_Ah_Kiang), a jobless Singaporean who killed his adoptive niece Ong Ai Siok. He was sentenced to death in February 1986 and lost his appeal in January 1988 before he was hanged. - 1988: Adrian Lim, Tan Mui Choo, and Hoe Kah Hong, the three perpetrators of the 1981 [Toa Payoh ritual murders](/wiki/Toa_Payoh_ritual_murders), were hanged on 25 November 1988. - 1988: Sek Kim Wah, a Singaporean military conscript and serial killer who committed the 1983 [Andrew Road triple murders](/wiki/Andrew_Road_triple_murders) and another double murder near Seletar Road, was hanged on 9 December 1988. As of 2024, Sek Kim Wah remains as Singapore's first and only serial killer to date, with 5 victims. - 1990: Teo Boon Ann, a temple medium, was hanged on 20 April 1990 for the 1983 [murder of Chong Kin Meng](/wiki/Murder_of_Chong_Kin_Meng) during a failed robbery attempt. - 1990: [Michael Tan Teow](/wiki/Michael_Tan_Teow) and [Lim Beng Hai](/wiki/Lim_Beng_Hai), the two unemployed Singaporeans and drug abusers who killed a housewife and two children to steal their money to buy drugs. Both were eventually charged with murder, convicted and sentenced to hang. Before his execution however, Tan committed suicide in May 1990, therefore, only Lim was put to death on 5 October 1990. - 1991: Tan Cheow Bock, who was sentenced to death in 1990 for the 1980 [murder of Chia Chun Fong](/wiki/Murder_of_Chia_Chun_Fong). Tan, who was arrested in 1987, was eventually hanged after the loss of his appeal in September 1991. - 1992: [Hensley Anthony Neville](/wiki/Hensley_Anthony_Neville), a Eurasian Singaporean found guilty of the 1984 rape and murder of 19-year-old Lim Hwee Huang. He fled to Malaysia after killing Lim, but was caught in March 1987 and hanged on 28 August 1992 after a six-day trial hearing. He was also the suspect of an unsolved double killing at Malaysia. - 1992: Vasavan Sathiadew and his two Thai accomplices - Phan Khenapin and Wan Pathong - were hanged on 23 October 1992 for the [1984 murder of Frankie Tan](/wiki/Murder_of_Frankie_Tan). - 1992: Tan Joo Cheng, who was found guilty of the 1987 [murder of Lee Juay Heng](/wiki/Murder_of_Lee_Juay_Heng), and sentenced to hang in 1990. Tan was executed since the loss of his appeal in 1992. - 1993: Mohamed Bachu Miah and Mohamed Mahmuduzzaman Khan, the two Bangladeshi workers who were found guilty of murdering a compatriot [Mohamed Shafiqul Islam](/wiki/Murder_of_Mohamed_Shafiqul_Islam) in 1988. Both Mohamed Bachu and Mahmuduzzaman were hanged on 23 July 1993. - 1993: 18-year-old [Maksa Tohaiee](/wiki/Maksa_Tohaiee), a Singaporean cleaner, was charged with murdering 38-year-old [Italian](/wiki/Italians) housewife Clementina Curci on 10 October 1990 and executed three years later on 26 November 1993. - 1993: [Yap Biew Hian](/wiki/Yap_Biew_Hian), a Malaysian shipyard worker found guilty of killing his female tenant Wong Mee Hiong. Yap was sentenced to death on 10 March 1993 and lost his appeal in October 1993, and since then, he was hanged. - 1993: Tan Bee Hock, a Singaporean who was found guilty of the [murder of Ng Keng Hua](/wiki/Murder_of_Ng_Keng_Hua) and sentenced to hang on 22 March 1993. - 1993: [Ng Soo Hin](/wiki/Ng_Soo_Hin), a Singaporean carpenter who, at age 19, murdered both his 19-year-old girlfriend Foo Chin Chin and Foo's 18-year-old best friend Ng Lee Kheng. Ng was sentenced to death on 26 May 1993 and lost his appeal on 3 December 1993, and since then, he was hanged. - 1993: Loh Yoon Seong, a Malaysian fitter who was found guilty of murdering an Indonesian fish merchant [Nurdin Nguan Song](/wiki/Murder_of_Nurdin_Nguan_Song) in 1985, and after the end of his accomplice's manslaughter trial in June 1993, Loh was hanged in an unknown date. - 1993: Ithinin Kamari, who was found guilty and sentenced to hang in 1992 for the 1989 [Tanglin Halt double murders](/wiki/Tanglin_Halt_double_murders). Ithinin's appeal was dismissed in 1993, and he was hanged thereafter. - 1994: Mazlan Maidun, a Singaporean who was hanged on 21 January 1994 for the 1988 [murder of Yeu Lam Ching](/wiki/Murder_of_Yeu_Lam_Ching) in [Bukit Timah](/wiki/Bukit_Timah). - 1994: Yeo Watt Song, a Singaporean who was convicted of the [murder of Ho Hon Sing](/wiki/Murder_of_Ho_Hon_Sing), who was Yeo's childhood friend. He was hanged in March 1994. - 1994: Krishnan Varadan, a Malaysian found guilty of murdering [Packiria Pillai Krishnasamy](/wiki/Murder_of_Packiria_Pillai_Krishnasamy) during a robbery bid in 1984. After spending almost seven years on death row as the longest-serving death row prisoner in Singapore, Krishnan was hanged on 15 April 1994. - 1994: [Goh Hong Choon](/wiki/Goh_Hong_Choon), a Singaporean odd-job worker who killed ten-year-old schoolgirl Kuah Bee Hong during a robbery. He was found guilty and hanged on 29 July 1994. - 1994: [Liow Han Heng](/wiki/Liow_Han_Heng) and [Ibrahim bin Masod](/wiki/Ibrahim_bin_Masod), who were condemned to death in 1992 for kidnapping and killing a goldsmith. Only Ibrahim was put to death on 29 July 1994 while Liow died from a heart attack in August 1993 before he could be executed. - 1994: [Lee Teck Sang](/wiki/Lee_Teck_Sang), Singaporean national, hanged on 29 July 1994 for the stabbing murder of Singapore Polytechnic lecturer Tan Chin Liong during a robbery in October 1992. - 1994: [Mohamed Jaafar Abidin](/wiki/Mohamed_Jaafar_Abidin) and [Yacob Rusmatullah](/wiki/Yacob_Rusmatullah), who were both found guilty of murdering a 78-year-old housewife and hanged on 26 August 1994. - 1994: [Murgan Ramasamy](/wiki/Murgan_Ramasamy), an unemployed Singaporean charged with killing a 48-year-old taxi driver during a robbery. He was hanged on 16 September 1994. - 1994: Mohamed Sulaiman Samsudin, the perpetrator of the [1989 Yishun coffeeshop murder](/wiki/1989_Yishun_coffeeshop_murder) case who was sentenced to death in February 1994 for his crime. Sulaiman's date of execution remains unspecified. - 1995: [Lim Lye Hock](/wiki/Lim_Lye_Hock), a Singaporean carpenter who raped and murdered his childhood friend Tan Hui Ngin. He was sentenced to death on 1 December 1993, and lost his appeal two years later in 1995, and was hanged afterwards. - 1995: [Flor Contemplacion](/wiki/Flor_Contemplacion), a Filipina domestic worker hanged on 17 March 1995 for murdering another Filipino domestic worker and a three-year-old boy. - 1995: Chin Seow Noi, Chin's younger brother Chin Yaw Kim and Yaw Kim's friend Ng Kim Heng, the three Malaysians who were hanged on 31 March 1995 for the [murder of Lim Lee Tin](/wiki/Murder_of_Lim_Lee_Tin) in January 1989. - 1995: Kumar Nadison, Jabar Kadermastan and Chandran Gangatharan, the three Malaysians who were found guilty of murdering an ice factory worker [Samynathan Pawathai](/wiki/Samynathan_Pawathai) during a revenge attack in 1985. The trio were hanged ten years later on 28 April 1995. - 1995: Oh Laye Koh, a Singaporean and former school bus driver who was hanged on 19 May 1995 for the 1989 [murder of Liang Shan Shan](/wiki/Murder_of_Liang_Shan_Shan), a 17-year-old Malaysian schoolgirl. He was also the suspected killer of 18-year-old lounge waitress Norhayah binti Mohamed Ali back in 1982. - 1995: [Jahabar Bagurudeen](/wiki/Jahabar_Bagurudeen), an Indian businessman who murdered his friend for allegedly being refused by the victim to share a prostitute. He was hanged on 2 June 1995. - 1995: [Mohamad Ashiek Salleh](/wiki/Mohamad_Ashiek_Salleh) and [Junalis Lumat](/wiki/Junalis_Lumat), the two taxi robbers who killed taxi driver Teo Kim Hock during a robbery and hanged on 16 June 1995. Junalis was also responsible for killing another taxi driver Seing Koo Wan. - 1995: [Phua Soy Boon](/wiki/Phua_Soy_Boon), a Singaporean who was 37 years old and jobless, was found guilty of killing a moneylender Sim Ah Lek and hanged on 16 June 1995. - 1995: [Sagar Suppiah Retnam](/wiki/Sagar_Suppiah_Retnam), a Singaporean national, hanged on 7 July 1995 for the murder of Sivapragasam Subramaniam during a gang fight between the Ang Soon Tong triad and the Gi Leng Hor secret society at [Marsiling](/wiki/Marsiling) in 1990. - 1995: [Anbuarsu Joseph](/wiki/Anbuarsu_Joseph), a Singaporean national and Gi Leng Kiat secret society member, hanged on 7 July 1995 for the murder of Thampusamy Murugian Gunasekaran in [Little India](/wiki/Little_India,_Singapore) after mistaking him for a rival gang member in 1993. - 1995: [Jamaludin Ibrahim](/wiki/Jamaludin_Ibrahim), a Singaporean repairman who killed his two neighbours after robbing them. He was hanged on 28 July 1995. - 1995: [Maniam Rathinswamy](/wiki/Maniam_Rathinswamy) and [S. S. Asokan](/wiki/S._S._Asokan), the two Singaporeans and security guards who used an axe and knife to murder 32-year-old Tan Heng Hong in 1992 before burning his corpse inside the car. Maniam and Asokan were found guilty of murder and hanged on 8 September 1995. - 1995: [Indra Wijaya bin Ibrahim](/wiki/Indra_Wijaya_bin_Ibrahim), a 22-year-old Singaporean drug addict who robbed and murdered an 80-year-old woman inside a lift at [Bedok North](/wiki/Bedok) in 1994. He was convicted and hanged seven months later on 29 September 1995. - 1996: [Panya Marmontree](/wiki/Panya_Marmontree), [Prawit Yaowabutr](/wiki/Prawit_Yaowabutr), [Manit Wangjaisuk](/wiki/Manit_Wangjaisuk), [Panya Amphawa](/wiki/Panya_Amphawa), and [Prasong Bunsom](/wiki/Prasong_Bunsom), all citizens of Thailand, hanged on 15 March 1996 for the murders of three men during an island-wide spree of construction site robberies between November 1992 and September 1993. - 1996: [John Martin Scripps](/wiki/John_Martin_Scripps), a British [serial killer](/wiki/Spree_killer) hanged on 19 April 1996 for murdering three tourists. - 1996: [Zainal Abidin Abdul Malik](/wiki/Zainal_Abidin_Abdul_Malik), a 29-year-old Singaporean who used an axe to murder 47-year-old police officer [Boo Tiang Huat](/wiki/Boo_Tiang_Huat). He was convicted for murder and hanged on 30 August 1996. - 1996: [Teo Kim Hong](/wiki/Teo_Kim_Hong), a Singaporean national, hanged on 30 August 1996 for stabbing fellow prostitute and Malaysian Ching Bee Ing to death at the [Teck Lim Road](/wiki/Teck_Lim_Road) brothel they both worked for in 1995. - 1996: [Thongbai Naklangdon](/wiki/Thongbai_Naklangdon), a Thai welder who was found guilty of murdering his friend Suk Malasri in June 1995 and sentenced to death. Thongbai was hanged on 30 August 1996. - 1997: [Pracha Thanomnin](/wiki/Pracha_Thanomnin), a Thai illegal worker, was hanged on 10 January 1997 for the 1995 [murder of Lee Kok Yin](/wiki/Murder_of_Lee_Kok_Yin), a 47-year-old taxi driver. - 1997: Khampun Sriyotha and Samlee Prathumtree, the two Thai workers found guilty of murdering their fellow countryman [Somwang Yapapha](/wiki/Murder_of_Somwang_Yapapha) during a sledgehammer attack, and hanged on 4 July 1997. - 1998: [Asogan Ramesh Ramachandren and Selvar Kumar Silvaras](/wiki/Mathavakannan_Kalimuthu#May_1998_executions_of_Asogan_and_Selvar) were hanged on 29 May 1998 for the 1996 murder of a gangster. - 1998: [Jimmy Chua Hwa Soon](/wiki/Jimmy_Chua_Hwa_Soon), a former army sergeant who killed his sister-in-law and slashed his nephew. He was sentenced to death for murder in April 1997 and lost his appeal in February 1998. - 1998: [Sim Eng Teck](/wiki/Sim_Eng_Teck), a jobless Singaporean who killed an Indonesian businessman. Sim received the death sentence in May 1998 and lost his appeal in August 1998, before he was hanged. - 1998: [Lim Chin Chong](/wiki/Lim_Chin_Chong), a Malaysian male prostitute who, at age 18, murdered his 65-year-old Singaporean employer and brothel owner Philip Low Cheng Quee in June 1997. Lim was found guilty of murder and executed on 23 October 1998. - 1999: [Gerardine Andrew](/wiki/1997_landlady_murder), a prostitute who was hanged on 26 February 1999 together with two men - Nazar Mohamed Kassim and Mansoor Abdullah - for stabbing her landlady, 53-year-old Sivapackiam Veerappan Rengasamy in March 1997. Prior to her execution, Gerardine's sentence was initially eight years' imprisonment for manslaughter before the [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore) found her guilty of murder in September 1998 and modified her jail term to death. - 1999: [Jonaris Badlishah](/wiki/Rolex_watch_murder), a Malaysian and nephew of the [Sultan of Kedah](/wiki/Sultan_of_Kedah) who was sentenced to death for the 1998 murder of Sally Poh Bee Eng and theft of her [Rolex](/wiki/Rolex) watch. He lost his appeal in February 1999, and afterwards, he was hanged. - 1999: Too Yin Sheong, one of the three perpetrators responsible for the 1993 [murder of Lee Kok Cheong](/wiki/Murder_of_Lee_Kok_Cheong), a university professor. Too was hanged on 30 April 1999. Another accomplice Lee Chez Kee was caught and hanged sometime in 2008, while a third named Ng Chek Siong was jailed eight years and received ten strokes of the cane for a reduced robbery charge. - 1999: Both Shaiful Edham bin Adam and Norishyam s/o Mohamed Ali were hanged on 2 July 1999 for the 1998 murder of a Bulgarian student named [Iordanka Apostolova](/wiki/Murder_of_Iordanka_Apostolova). - 1999: [S. Nagarajan Kuppusamy](/wiki/S._Nagarajan_Kuppusamy), a Singaporean lorry driver found guilty of murdering a prison warden and put to death on 23 July 1999. - 2000: [Lau Lee Peng](/wiki/Lau_Lee_Peng), a fishmonger who was hanged on 1 September 2000 for the robbery and murder of his 50-year-old friend and fruit stall helper Lily Tan Eng Yan. - 2000: [Chan Chim Yee](/wiki/Chan_Chim_Yee), a Singaporean cleaner found guilty of murdering his former girlfriend in August 1998. He was hanged on 15 September 2000. - 2000 or 2001: [Chan Choon Wai](/wiki/Chan_Choon_Wai), a Malaysian who was found guilty of murdering his girlfriend [Koh Mew Chin](/wiki/Koh_Mew_Chin). He was sentenced to hang in January 2000 and lost his appeal in May 2000. He was hanged either in late 2000 or early 2001. - 2001: Julaiha Begum, her lover Loganatha Venkatesan and Venkatesan's friend Chandran Rajagopal, were hanged on 16 February 2001 for the murder of Julaiha's husband [T. Maniam](/wiki/Murder_of_T._Maniam). - 2001: Seah Kok Meng, a Singaporean found guilty of the 1999 [murder of S. Salim Ahmad](/wiki/Murder_of_S._Salim_Ahmad), and sentenced to death in November 2000. Seah was hanged on 30 November 2001. - 2002: Khwan-On Natthaphon, a Thai carpenter found guilty of the [murder of Ong Huay Dee](/wiki/Murder_of_Ong_Huay_Dee), a 65-year-old taxi driver whom Khwan-On killed in June 2000. Khwan-On was hanged on 27 September 2002. - 2002: Three men - Rosli bin Ahmat, Wan Kamil bin Mohamed Shafian, and Ibrahim bin Mohamed - were executed on 25 October 2002 for the August 2000 [murders of Koh Ngiap Yong and Jahabar Sathick](/wiki/Murders_of_Koh_Ngiap_Yong_and_Jahabar_Sathick) at Chestnut Avenue and Jalan Kukoh respectively. - 2002: [Anthony Ler Wee Teang](/wiki/Anthony_Ler_Wee_Teang) was hanged on 13 December 2002 for hiring a teenager to murder his wife. - 2003: Kanesan Ratnam, a prisoner who killed his cellmate [Shankar Suppiahmaniam](/wiki/Murder_of_Shankar_Suppiahmaniam) by strangulation at Queenstown Remand Prison. Kanesan, who was in remand for a charge of rape, was sentenced to death and later hanged on 10 January 2003. - 2003: Dornchinnamat Yingyos, Thongthot Yordsa-Art and Seethong Phichet, three of the six Thai workers responsible for the [murder of Saenphan Thawan](/wiki/Murder_of_Saenphan_Thawan) back in June 2001. All three men were found guilty of murder and later put to death on 21 February 2003. - 2003: Arun Prakash Vaithilingam, an Indian ship electrician who was found guilty of murdering his roommate [Lourdusamy Lenin Selvanayagan](/wiki/Murder_of_Lourdusamy_Lenin_Selvanayagan), and hanged on 3 October 2003 - 2004: [Jin Yugang](/wiki/Jin_Yugang), a Chinese national and cleaner who was found guilty of murdering his roommate Wang Hong in 2002. Jin was hanged on 19 March 2004. - 2004: [Soosainathan Dass Saminathan](/wiki/Soosainathan_Dass_Saminathan), a jobless Singaporean found guilty of murdering a six-month-old Indonesian baby girl after he raped her. He was hanged on 21 May 2004. - 2004: [Tan Chee Wee](/wiki/Tan_Chee_Wee), a Malaysian hanged on 11 June 2004 for the rape and murder of a Thai housewife in Chai Chee. - 2005: Zailani bin Ahmad, a Singaporean technician found guilty of the 2003 [murder of Chi Tue Tiong](/wiki/Murder_of_Chi_Tue_Tiong) and sentenced to death in March 2004. He also lost his appeal in November 2004, and he had since been hanged. - 2005: [Harith Gary Lee](/wiki/Harith_Gary_Lee), alias Lee Cheng Thiam, a Singaporean hanged on 22 April 2005 for murdering his girlfriend Diana Teo Siew Peng by pushing her off the tenth storey of her residential block - 2006: [Tony Koh Zhan Quan](/wiki/Tony_Koh_Zhan_Quan) and [Lim Poh Lye](/wiki/Lim_Poh_Lye), two of the three robbers who were apprehended for the murder of Bock Tuan Thong, a scrap car dealer. Koh and Lim were initially jailed and caned for robbery with hurt but their sentences were increased to death for murder after the prosecution appealed. Both Koh and Lim were hanged on 28 April 2006. - 2006: Took Leng How, a Malaysian hanged on 3 November 2006 for the [2004 murder of an eight-year-old girl](/wiki/Murder_of_Huang_Na). - 2007: [Leong Siew Chor](/wiki/Kallang_River_body_parts_murder), a factory supervisor who killed his lover Liu Hong Mei. He was hanged on 30 November 2007. - 2008: Lee Chez Kee, one of the three perpetrators responsible for the 1993 [murder of Lee Kok Cheong](/wiki/Murder_of_Lee_Kok_Cheong), a university professor. Lee was caught in 2006 and sentenced to hang in 2008. One of his accomplices Too Yin Sheong was caught and hanged in April 1999, while a third named Ng Chek Siong was jailed eight years and received ten strokes of the cane for a reduced robbery charge. - 2008: Mohammed Ali bin Johari was hanged on 19 December 2008 for the [2006 rape and murder of his stepdaughter](/wiki/Murder_of_Nonoi). - 2008: Abdul Malik bin Usman, Kamal bin Kupli and Hamir Hasim, the three Malaysians found guilty of [murdering a Myanmar worker Thein Naing](/wiki/Upper_Boon_Keng_Road_murder) during a robbery. They were sentenced to death in February 2007 and lost their appeals in February 2008, and were executed later that same year. - 2011: Tharema Vejayan Govindasamy, the perpetrator of the 2007 [Stirling Road murder](/wiki/Stirling_Road_murder) case, which involved him killing his former wife. Tharema was sentenced to hang in May 2009, and lost his appeal in September 2010, and he was eventually hanged sometime in 2011. - 2011: [Nakamuthu Balakrishnan](/wiki/Nakamuthu_Balakrishnan), a Singaporean sentenced to death for murdering a lorry driver during a S$1.3 million mobile phone heist. His date of death was 8 July 2011. - 2014: [Wang Zhijian](/wiki/Wang_Zhijian), a Chinese national sentenced to death in 2012 for the 2008 [Yishun triple murders](/wiki/Yishun_triple_murders). The [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore) dismissed his appeal in 2014 and he was hanged on 20 May 2016 along with Kho Jabing. - 2015: [Muhammad Kadar](/wiki/Muhammad_Kadar), an odd-job labourer charged with knifing a 69-year-old housewife 110 times and therefore killed her during a robbery in 2005. He was hanged ten years later on 17 April 2015. - 2016: [Kho Jabing](/wiki/Kho_Jabing), a Malaysian hanged on 20 May 2016 for the 2008 robbery and murder of a construction worker. Wang Zhijian the perpetrator of the 2008 Yishun Triple Murders was also executed together with him. - 2018: [Rasheed Muhammad](/wiki/Rasheed_Muhammad) and [Ramzan Rizwan](/wiki/Ramzan_Rizwan), the two Pakistani tissue sellers who killed their 59-year-old roommate Muhammad Noor by smothering. Both were found guilty and sentenced to death in February 2017 and lost their appeals on 28 September 2017. They were hanged sometime in 2018. - 2018: [Chia Kee Chen](/wiki/Chia_Kee_Chen), a Singaporean businessman who murdered his wife's 37-year-old lover Dexmon Chua Yizhi. His life sentence was raised to a death sentence by the [Court of Appeal of Singapore](/wiki/Court_of_Appeal_of_Singapore) after the prosecution appealed on 27 June 2018. He was hanged sometime in 2019. - 2019: [Micheal Anak Garing](/wiki/Micheal_Anak_Garing), a Malaysian hanged on 22 March 2019 for the murder of a construction worker during [a series of armed robberies in 2010](/wiki/2010_Kallang_slashing). - 2024: [Ahmed Salim](/wiki/Ahmed_Salim_(murderer)), a Bangladeshi painter found guilty of murdering his Indonesian girlfriend Nurhidayati Wartono Surata back in 2018. Ahmed was hanged on 28 February 2024. - 2025: Iskandar bin Rahmat, a former police officer hanged on 5 February 2025 for the 2013 [Kovan double murders](/wiki/Kovan_double_murders). - 2025: Eric Teo Ghim Heng, a former property agent hanged on 16 April 2025 for the murder of his wife and their daughter in 2017, which became known as the [Woodlands double murders](/wiki/Woodlands_double_murders). ### Drug trafficking cases - 1978: Teh Sin Tong, a Malaysian, was hanged on 28 April 1978 for smuggling 254.7g of diamorphine into Singapore. - 1978: Teo Hock Seng, a Malaysian national, hanged on 29 July 1978 for the smuggling of 46 grams of pure heroin. - 1979: Wong Kee Chin, a Singaporean national, hanged on 5 October 1979 for the smuggling of 138 grams of pure heroin. - 1979: Lee Kin Kheong, a Singaporean national, hanged on 20 October 1979 for trafficking 40g of heroin. - 1979: Lim Hong Yap, a Singaporean national, hanged on 2 November 1979 for trafficking 1.03 kg of heroin. - 1981: [Ong Ah Chuan](/wiki/Ong_Ah_Chuan), a Singaporean national, hanged on 20 February 1981 for the trafficking of 209 grams of pure heroin. - 1981: Koh Chai Cheng, a Malaysian national, hanged on 27 March 1981 for the trafficking of 1.2 kg of pure heroin. - 1981: Azml Anis Ahmad, an Indian national, hanged on 27 March 1981 for the smuggling of 75 grams of pure heroin. - 1981: [Low Hong Eng](/wiki/Low_Hong_Eng) and her accomplice [Tan Ah Tee](/wiki/Tan_Ah_Tee), both Singaporean nationals, hanged on 9 October 1981 for the joint enterprise of trafficking 459g of heroin. Low was the first woman to be hanged for drug offences in Singapore. - 1983: Anwar Ali Khan, a Singaporean national, hanged on 4 March 1983 for the trafficking of 43 grams of pure heroin. - 1983: Lim Chuan Keam, a Malaysian national, hanged on 21 October 1983 for the trafficking of 154 grams of pure heroin. - 1984: Murugaya Rajendran, a Singaporean national, hanged on 14 September 1984 for the smuggling of 332 grams of heroin. - 1984: Chia Beng Chye, a Singaporean national, hanged on 20 January 1984 for trafficking 112g of heroin. - 1985: Leo Hai Hock, a Singaporean national, hanged on 2 August 1985 for the smuggling of 182 grams of pure heroin. - 1986: Tan Ah Leng, a Singaporean national, hanged on 31 January 1986 for the smuggling of 27 grams of pure heroin. - 1989: Tan Sek Cheong, a Malaysian national, hanged on 12 May 1989 for smuggling 103 grams of heroin. - 1989: Law How Chai, a Malaysian national, hanged on 12 May 1989 for smuggling 104 grams of heroin. - 1989: Ng Beng Kee and his accomplice Tan Hock Bin, both Singaporean nationals, hanged on 26 May 1989 for smuggling 20 kg of heroin. - 1989: [Lau Chi Sing](/wiki/Lau_Chi_Sing), Hong Kong national, hanged on 17 November 1989 for smuggling 242 grams of heroin. Lau was the first [drug mule](/wiki/Mule_(smuggling)) to be sentenced to death for trafficking narcotics via [Changi Airport](/wiki/Changi_Airport) - 1990: Ho Cheng Kwee, a Singaporean national, hanged on 19 January 1990 for trafficking 144 grams of heroin. - 1990: Sim Mai Tik, a Malaysian national, hanged on 18 May 1990 for smuggling 67 grams of heroin. - 1990: Koay Poh Seng, a Malaysian national, hanged on 18 May 1990 for smuggling 150 grams of heroin. - 1991: Goh Ah Lim, a Singaporean national, hanged on 6 September 1991 for trafficking 1.5 kg of heroin. - 1991: Tan Leong Chay, a Singaporean national, along with his accomplices Lim Kheng Boon and Mohamed Yusoh Esa, both Malaysian nationals, hanged on 15 November 1991 for the joint enterprise of trafficking 1.777 kg of heroin. - 1991: Kadir Awang, a Singaporean national, hanged on 29 November 1991 for trafficking 50g of heroin. - 1992: Tan Toon Hock, a Malaysian national, hanged on 28 February 1992 for trafficking 423g of heroin. - 1992: [Lim Joo Yin](/wiki/Lim_Joo_Yin) and his accomplice [Ronald Tan Chong Ngee](/wiki/Ronald_Tan_Chong_Ngee) were both hanged on 3 April 1992 for smuggling heroin. - 1992: Tan Boon Tat, a Singaporean national, hanged on 25 September 1992 for trafficking 1.12 kg of heroin. - 1992: Lim Ah Poh, a Malaysian national, hanged on 25 September 1992 for trafficking 220g of heroin. - 1992: Ng Chong Teck, a Singaporean national, hanged on 30 October 1992 for trafficking 50g of heroin. - 1993: Raymond Ko Mun Cheung and his accomplice An Man Keny Chiu Sum Hing, both Hong Kong nationals, hanged on 30 July 1993 for smuggling over 2 kg of heroin between them. - 1994: Wong Wai Hung, Hong Kong national, hanged on 21 January 1994 for smuggling 4.6 kg of heroin. - 1994: Tan Nguan Siah, Singaporean national, hanged on 21 January 1994 for possession of 46 grams of pure heroin. - 1994: Ng Kwok Chun and his accomplice Hsui Wing Cheung, both Hong Kong nationals, hanged on 28 January 1994 for smuggling 2.3 kg and 2.5 kg of heroin respectively. - 1994: Lee Ngin Kiat, Singaporean national, hanged on 28 January 1994 for possession of 147 grams of heroin. - 1994: Gan Kok Cheng, a Malaysian national, hanged on 4 February 1994 for trafficking 106 grams of heroin. - 1994: [Cheuk Mei Mei](/wiki/Cheuk_Mei_Mei) and her accomplice [Tse Po Chung](/wiki/Tse_Po_Chung), Hongkongers, were hanged on 4 March 1994 for smuggling 2 kg of heroin each. - 1994: Fung Yuk Shing, Hong Kong National, was hanged on 4 March 1994 for smuggling 3 kg of heroin. - 1994: Manit Changthong, a Thai national, was hanged on 4 March 1994 for smuggling 4 kg of heroin. - 1994: Koh Aik Siew, a Singaporean national, hanged on 15 April 1994 for trafficking 680g of heroin. - 1994: Hanafiah Bin Bedullah, Malaysian national, and the first person to be sentenced to death for a cannabis related offence after an amendment to the Misuse of Drugs Act, hanged on 13 May 1994 for trafficking 2.5 kg of cannabis into Singapore. - 1994: Lai Kam Loy, along with his accomplices Tee Seh Ping, Yeo Choon Chau and Yeo Choon Poh, all Malaysian nationals, hanged on 13 May 1994 for the joint enterprise of trafficking 200 grams of heroin. - 1994: Hyicenth Ihejirika, a Nigerian national, hanged on 29 July 1994 for smuggling 2.7 kg of heroin. - 1994: Samsuri Mohamed Yus, a Singaporean national, hanged on 29 July 1994 for trafficking 2.9 kg of cannabis. - 1994: Gabriel Okonkwo, along with his accomplice Paul Okechukwu Ngwudo, both Nigerian nationals, hanged on 5 August 1994 for the joint enterprise of trafficking 538 grams of heroin. An undercover American [D.E.A.](/wiki/Drug_Enforcement_Administration) agent, who created a [sting operation](/wiki/Sting_operation) against the pair, was the main witness for the prosecution at their trial. - 1994: Emmanuel Anyanwu, a Nigerian national, hanged on 26 August 1994 for trafficking 2.2 kg of heroin. - 1994: [Johannes van Damme](/wiki/Johannes_van_Damme), a Dutch engineer and the first European to be executed in modern-day Singapore, hanged on 23 September 1994 for smuggling 4.32 kg of pure heroin. - 1994: Lu Lai Heng, a Singaporean national, hanged on 9 September 1994 for trafficking 525g of heroin. - 1994: Goh Lai Wak, a Singaporean national, hanged on 30 September 1994 for the trafficking of 2 kg of heroin. - 1994: Abdullah Abdul Rahman, along with his accomplice Abdul Rashid Mohamed, both Singaporean nationals, hanged on 2 October 1994 for the joint enterprise of trafficking 76 grams of heroin. - 1994: Mufutaw Salam, Ghanaian national, hanged on 7 October 1994 for smuggling 2.3 kg of heroin. - 1994: Lee Lum Sheun, a Singaporean national, hanged on 25 November 1994 for trafficking 66g of heroin. - 1994: Kong Weng Chong, a Singaporean national, along with his Malaysian accomplices Tan Seang Hock and Yeap Kai Pang, hanged on 9 December 1994 for the joint enterprise of trafficking 8.25 kg of heroin. - 1994: [Elke Tsang Kai-mong](/wiki/Elke_Tsang_Kai-mong), Hong Kong National, was hanged on 16 December 1994 for smuggling 4 kg of heroin. - 1994: Vinit Sopon and his accomplice Pairoj Bunsom, both Thai nationals, hanged on 16 December 1994 for the joint enterprise of trafficking 1.4 kg of heroin. - 1994: Leong Wing Kong, a Singaporean national, hanged on 23 December 1994 for trafficking 50g of heroin. - 1994: Lim Choon Chye, a Singaporean national, hanged on 23 December 1994 for trafficking 1.7 kg of heroin. - 1995: [Angel Mou Pui Peng](/wiki/Execution_of_Angel_Mou_Pui_Peng), a Macau national hanged on 6 January 1995 for smuggling 4 kg of heroin. - 1995: Ramond Selva Clement, a Malaysian national, hanged on 13 January 1995 for trafficking 105 grams of heroin. - 1995: [Daniel Chan Chi-pun](/wiki/Daniel_Chan_Chi-pun), Hong Kong national, hanged on 10 March 1995 for smuggling of 464 grams of heroin. - 1995: Krishna Maikham and his accomplice Don Promphinit, both citizens of Thailand, hanged on 17 March 1995 for the joint enterprise of trafficking 1.2 kg of cannabis. - 1995: Mohammed Nasrul Esyam Shamsudin, a Malaysian national, hanged on 17 March 1995 for trafficking 5 kg of cannabis. - 1995: Sylvester Kwaku Forkuo, a Ghanaian national, hanged on 24 March 1995 for smuggling 576g of heroin. - 1995: Ibrahim Yaacob, a Malaysian national, hanged on 24 March 1995 for smuggling 1.39 kg of cannabis. - 1995: Goh Hock Huat, a Singaporean national, hanged on 24 March 1995 for trafficking 743g of heroin. - 1995: Teoh Kah Lin, a Malaysian national, hanged on 31 March 1995 for trafficking 1.5 kg of heroin. - 1995: [Tong Ching Man](/wiki/Tong_Ching_Man) and her boyfriend [Lam Cheuk Wang](/wiki/Lam_Cheuk_Wang), both Hong Kong nationals, hanged on 21 April 1995 for smuggling 1.6 kg and 1.4 kg of heroin respectively. - 1995: [Poon Yuen Chung](/wiki/Poon_Yuen_Chung), Hong Kong national, hanged on 21 April 1995 for smuggling 3 kg of heroin. - 1995: Chris Chineynye Ubaka, Nigerian national, hanged on 21 April 1995 for smuggling 7 kg of heroin. - 1995: Yeo Hee Seng, Singaporean national, hanged on 21 April 1995 for possession of 24 grams of heroin. - 1995: Hartej Sidhu, an Indian national, and his accomplice Sarjit Singh, a Singaporean national, hanged on 19 May 1995 for the joint enterprise of trafficking over 600 grams of heroin and 9.3 kg of [opium](/wiki/Opium). - 1995: Sabinus Nkem Okpebie, a Nigerian national, hanged on 26 May 1995 for smuggling 7.5 kg of heroin. - 1995: Sukor Abdul Rahman Sidik, a Singaporean national, hanged on 26 May 1995 for possession of over 68 grams of heroin. - 1995: Wong Kok Men and his accomplice Lim Yat Kong, both Malaysian nationals, hanged on 26 May 1995 for the joint enterprise of possession of over 47 grams of heroin. - 1995: Yee Kim Yeou, a Malaysian national, his Singaporean accomplices Melvin Seet and Ng Teo Chye, along with Malaysian accomplice Tan Siew Chay, all hanged on 9 June 1995 for the joint enterprise of smuggling 1.7 kg of heroin. - 1995: Chan Hock Wai, a Singaporean national, hanged on 16 June 1995 for trafficking 150g of heroin. - 1995: Goh Soon Huat, a Singaporean national, hanged on 7 July 1995 for trafficking 69g of heroin. - 1995: Govindarajulu Mural, an Indian national, and his accomplice Amrutham Chenchaiah, a Singaporean national, hanged on 28 July 1995 for the joint enterprise of trafficking 326g of heroin. - 1995: Tan Yew Lee, a Singaporean national, hanged on 25 August 1995 for trafficking 1.447 kg of heroin. - 1995: Navarat Maykha, a Thai national hanged on 29 September 1995 for trafficking 3.182 kg of heroin. - 1995: Lee Yuan Kwang, along with his accomplices Quek Ah Ling, Choo Tong Sai and Yakoob Mohamed, all Singaporean nationals, hanged on 10 November 1995 for the joint enterprise of trafficking 1.5 kg of heroin. - 1996: [Rozman Jusoh](/wiki/Rozman_Jusoh) and Razali Mat Zin, both Malaysian odd-job labourers, hanged on 12 April 1996 for trafficking a total of nearly 2 kg of [marijuana](/wiki/Marijuana). - 1996: Neo Kay Liang, a Singaporean hawker assistant, was hanged on 12 April 1996 for smuggling 20.19g of heroin. - 1996: Richard Low Gee Boon, a Singaporean national, hanged on 19 April 1996 for trafficking 34g of heroin. - 1996: Lee Meng Hong, a Singaporean national, hanged on 19 April 1996 for trafficking 75g of heroin. - 1996: Abdul Karim Mohammad, Singaporean national, hanged on 26 April 1996 for possession of 108 grams of heroin. - 1996: Wong Yoke Wah, a Malaysian national, hanged on 26 April 1996 for smuggling 1.8 kg of heroin. - 1996: Loo Koon Seng, a Singaporean national, hanged on 24 May 1996 for trafficking 55g of heroin. - 1996: Toh Chwe Chuan along with his accomplice Tan Jin Chiang, both Singaporean nationals, hanged on 24 May 1996 for the joint enterprise of trafficking 905g of heroin. - 1996: Roslan Mohammed Sany, a Singaporean national, hanged on 26 July 1996 for trafficking 19g of heroin. - 1996: Too Chai Kim, a Malaysian national, hanged on 26 July 1996 for smuggling 800g of heroin. - 1996: Lau Mui Hai, a Singaporean national, hanged on 26 July 1996 for trafficking 50g of heroin. - 1996: Rosli Shamsuri, a Singaporean national, hanged on 26 July 1996 for trafficking 330g of heroin. - 1996: Jeerasak Densakul, a Thai national, hanged on 1 September 1996 for trafficking 2 kg of cannabis. - 1996: Chua Hock Cheong, a Singaporean national, hanged on 20 September 1996 for trafficking 78g of heroin. - 1996: Muhamad Hazani, a Malaysian national, hanged on 20 September 1996 for trafficking 1.9 kg of cannabis. - 1996: Zulkifli Awang Kachik and his accomplice Pauzi Ab Kadir, both Malaysian nationals, hanged on 20 September 1996 for the joint enterprise of trafficking 1.8 kg of cannabis. - 1996: Tan Seng Kim, his accomplices Goh Joon Tong and Koland Ko Choon Kwang, all Singaporean nationals, hanged on 27 September 1996 for the joint entiprise of smuggling 871 grams of heroin. - 1997: Cheng Tim Fook, a Singaporean national, hanged on 25 April 1997 for trafficking 679g of heroin. - 1997: Teh Thiam Huat, a Singaporean national, hanged on 25 April 1997 for trafficking 33g of heroin. - 1997: Chua Kiat Ann, a Singaporean national, hanged on 25 April 1997 for trafficking 491g of heroin. - 1997: Chan Ah Kow, a Singaporean national, hanged on 3 October 1997 for trafficking 50g of heroin. - 1998: Tan Chuan Ten, a Singaporean national, hanged on 24 April 1998 for trafficking 67g of heroin. - 1998: Lau Boon Huat, a Singaporean national, hanged on 24 April 1998 for trafficking 454g of heroin. - 1998: Lim Seng Yong, a Singaporean national, hanged on 24 April 1998 for trafficking 111g of heroin. - 1998: Tan Chuan Chyang, a Singaporean national, hanged on 29 May 1998 for trafficking 83g of heroin. - 1999: Bryan Yeo Sin Rung, hanged on 15 January 1999 for trafficking over 2 kg of heroin. - 1999: Sim Cheng Hui, along with his accomplices Teo Lam Choon and Teo Seng Peng, hanged on 5 March 1999 for the joint enterprise of trafficking 500g of heroin. - 1999: Su Chee Kiong, hanged on 11 June 1999 for trafficking 81g of heroin. - 1999: Cheong Chuan Peng, hanged on 25 June 1999 for trafficking 43g of heroin. - 1999: [Chua Gin Boon](/wiki/Chua_Gin_Boon), hanged on 25 June 1999 for trafficking 60g of heroin. - 1999: Imran Adam, hanged on 29 October 1999 for trafficking 82g of heroin. - 1999: Lim Tiong Lee, a Singaporean national, hanged on 29 October 1999 for trafficking 301g of heroin. - 1999: Satli bin Masot, hanged on 29 October 1999 for trafficking 148g of heroin. - 1999: Lai Chaw Won, a Malaysian national, hanged on 17 December 1999 for trafficking 125g of heroin. - 1999: Goh Choon Meng, a Malaysian national, hanged on 17 December 1999 for trafficking 168g of heroin. - 2000: Sow Siow Yin, along with her accomplice Tan Chwee Heng, hanged on 28 July 2000 for the joint enterprise of trafficking 140g of heroin. - 2001: Jimmy Goh Chye Soon, a Singaporean national, hanged on 26 October 2001 for trafficking 82g of heroin. - 2003: Mohamed Isnin Saleh, along with his accomplices Azman Ismail and Ruzaini Ajis, all Singaporean nationals, hanged on 20 June 2003 for the joint enterprise of trafficking 34.8 kg of heroin. - 2003: [Vignes Mourthi](/wiki/Vignes_Mourthi) and [Moorthy Angappan](/wiki/Moorthy_Angappan), the two Malaysians hanged on 26 September 2003 for smuggling 27.65g of diamorphine. - 2004: [Yen May Woen](/wiki/Yen_May_Woen), a Singaporean hairdresser hanged on 19 March 2004 for trafficking 30 grams of pure heroin - 2004: Raman Selvam Renganathan, hanged on 16 July 2004 for trafficking 2.7 kg of cannabis. - 2005: [Shanmugam Murugesu](/wiki/Shanmugam_Murugesu), a Singaporean former athlete and military man hanged on 13 May 2005 for smuggling 1 kg of cannabis. - 2005: [Nguyen Tuong-van](/wiki/Van_Tuong_Nguyen), an Australian hanged on 2 December 2005 for smuggling 396.2 grams of diamorphine (pure heroin). - 2006: Mohd Halmi bin Hamid and his accomplice Mohamad Bin Ahmad, both Malaysian nationals, hanged on 23 June 2006 for the joint enterprise of possessing 75.56g of heroin for the purpose of trafficking. - 2007: [Iwuchukwu Amara Tochi](/wiki/Iwuchukwu_Amara_Tochi) and [Okeke Nelson Malachy](/wiki/Okeke_Nelson_Malachy), two Nigerians hanged on 26 January 2007 for smuggling diamorphine. - 2017: Muhamad Ridzuan Mohd Ali, executed for smuggling diamorphine in 2011. His appeals to court were rejected. - 2022: [Abdul Kahar Othman](/wiki/Abdul_Kahar_Othman), a Singaporean who was executed on 30 March 2022 for trafficking 66.77g of diamorphine in 2010. Abdul Kahar was a first convict to be hanged during COVID Pandemic. - 2022: [Nagaenthran K. Dharmalingam](/wiki/Nagaenthran_K._Dharmalingam), a Malaysian executed on 27 April 2022 at 6:00 am for trafficking of heroin in 2009 - 2022: [Kalwant Singh Jogindar Singh](/wiki/Kalwant_Singh_Jogindar_Singh) and [Norasharee Gous](/wiki/Norasharee_Gous), a Malaysian and Singaporean respectively, who were both executed on 7 July 2022 for diamorphine trafficking in 2013 - 2022: [Nazeri Lajim](/wiki/Nazeri_Lajim), a Singaporean executed on 22 July 2022 for importing 33.89g of diamorphine in 2012 - 2022: [Abdul Rahim Shapiee](/wiki/Abdul_Rahim_Shapiee) and [Ong Seow Ping](/wiki/Ong_Seow_Ping), who were both Singaporeans, were hanged on 5 August 2022 for trafficking diamorphine in 2015 - 2023: [Tangaraju Suppiah](/wiki/Tangaraju_Suppiah), a Singaporean hanged on 26 April 2023 for trafficking 1 kg of marijuana. - 2023: Muhammad Faizal Bin Mohd Shariff, a Singaporean hanged on 17 May 2023 for trafficking 1.56 kg of marijuana in 2016. - 2023: [Mohd Aziz bin Hussain](/wiki/Mohd_Aziz_bin_Hussain), a Singaporean hanged on 26 July 2023 for trafficking 49.98g of diamorphine in 2017. - 2023: [Saridewi Djamani](/wiki/Saridewi_Djamani), a Singaporean woman hanged on 28 July 2023 for trafficking 30.72g of diamorphine in 2016. - 2023: [Mohamed Shalleh Abdul Latiff](/wiki/Mohamed_Shalleh_Abdul_Latiff), a Singaporean and former delivery driver hanged on 3 August 2023 for trafficking 54.04g of diamorphine in 2019. - 2024: Moad Fadzir bin Mustaffa, a Singaporean drug trafficker hanged on 2 August 2024 for trafficking 36.93g of diamorphine in 2016. Moad Fadzir's execution was confirmed by the authorities in a media statement, although he was not named out of consideration for his family's need for privacy. - 2024: A. Steven Paul Raj, a Singaporean drug trafficker hanged on 7 August 2024 for trafficking 35.85g of diamorphine in 2017. Steven's execution was confirmed by the authorities in a media statement by CNB, but he was not named. - 2024: Mohammad Azwan bin Bohari, a Singaporean drug trafficker hanged on 4 October 2024 for trafficking 26.5g of diamorphine in 2015. Azwan's execution was confirmed by the authorities in a media statement by CNB. - 2024: Sulaiman Jumari, a 64-year-old Singaporean drug trafficker hanged on 16 October 2024 for trafficking 52.75g of diamorphine in 2016. - 2024: [39-year-old Malaysian Pausi Jefridin and 53-year-old Singaporean Roslan Bakar](/wiki/Roslan_Bakar_and_Pausi_Jefridin), who were both hanged on 15 November 2024 for trafficking 96.07g of diamorphine in 2008. - 2024: [Rosman Abdullah](/wiki/Rosman_Abdullah), a 55-year-old Singaporean hanged on 22 November 2024 for trafficking 57.43g of diamorphine in 2009. - 2024: Masoud Rahimi bin Mehrzad, a 35-year-old Singaporean of Iranian descent hanged on 29 November 2024 for trafficking 31.14g of diamorphine in 2010. - 2025: Syed Suhail Syed Zin, a Singaporean hanged at the age of 48 on 23 January 2025 for drug trafficking not less than 38.84 grammes of diamorphine in 2015. - 2025: Mohammad Reduan Mustaffar, a 41-year-old Singaporean, was hanged on 9 April 2025 for trafficking not less than 661.2g of methamphetamine in 2016. - 2025: [Roshdi Abdullah Altway](/wiki/Roshdi_Abdullah_Altway), a Singaporean, was hanged on 10 April 2025 for trafficking 78.77g of diamorphine. Roshdi was previously sentenced to hang in 1994 for the [murder of a CNB inspector](/wiki/Roshdi_Abdullah_Altway#Murder_of_Inspector_Rajab_Mohamed_(1993)) before he appealed and successfully reduced his death sentence to ten years' prison for manslaughter. - 2025: Muhammad Salleh bin Hamid, a 37-year-old Singaporean, was hanged on 23 May 2025 for trafficking 325.81 grammes of methamphetamine in 2019. - 2025: Chandroo Subramaniam, a 56-year-old Malaysian, who was convicted of abetment of trafficking in a controlled drug, had his capital sentence carried out on 25 July 2025. - 2025: Kishor Kumar A/L Raguan, a 44-year-old Malaysian, who was convicted of trafficking by delivering to his co-offender a controlled drug, had his capital sentence carried out on 30 July 2025. - 2025: [Datchinamurthy Kataiah](/wiki/Datchinamurthy_Kataiah), a Malaysian drug trafficker hanged for smuggling 44.96g of diamorphine on 25 September 2025. - 2025: [Pannir Selvam Pranthaman](/wiki/Pannir_Selvam_Pranthaman), a Malaysian drug trafficker hanged on 8 October 2025 for smuggling 51.84g of diamorphine. - 2025: Hamzah Bin Ibrahim and Tika Pesik, Singaporeans, were hanged on 15 October 2025 for trafficking drugs. - 2025: Tan Kay Yong hanged on 26 November 2025 for trafficking 18.71g of diamorphine. - 2025: Mohammad Rizwan and Saminathan Selvaraju, were hanged on 27 November 2025 for trafficking 301.6g of heroin ### Firearm offences - 1971: [Teo Cheng Leong](/wiki/Teo_Cheng_Leong), a Singaporean robber hanged on an unknown date in May 1971 for shooting at a police officer twice with intent to cause harm. - 1975: [Liew Ah Chiew](/wiki/Liew_Ah_Chiew), a 19-year-old National Serviceman convicted of murdering his platoon commander Hor Koon Seng and hanged on 29 November 1975. - 1976: [Sha Bakar Dawood](/wiki/Sha_Bakar_Dawood), a Singaporean national, hanged on 3 September 1976 for the use of a firearm with intent to cause injury, after shooting three people at a brothel and then opening fire on police at [Thiam Siew Avenue](/wiki/Geylang). - 1977: [Talib bin Haji Hamzah](/wiki/Talib_bin_Haji_Hamzah), a Singaporean national, hanged on 28 January 1977 for the use of a firearm with intent to cause injury, after being an accomplice to two jewellers shop robberies in 1974 during which firearms were discharged. - 1979: Lee Keng Guan, Wong Loke Fatt and Ho Joo Huat, all Singaporean nationals, hanged on 11 May 1979 for the joint enterprise of the use of a firearm with intent to cause injury, after robbing businessman Low Meng How and then firing 2 bullets from a [revolver](/wiki/Revolver) at Low's nephew on [Amber Road](/wiki/Marine_Parade) in October 1974. - 1980: [Chang Bock Eng](/wiki/Chang_Bock_Eng) and [Tay Cher Kiang](/wiki/Tay_Cher_Kiang), who were both given the death penalty in August 1977 for using a revolver during an armed robbery at a paint shop. Both Chang and Tay were hanged on 9 May 1980. - 1984: [Lim Kok Yew](/wiki/Lim_Kok_Yew), a Malaysian national, hanged on 8 June 1984 for the joint enterprise of the use of a firearm with intent to cause injury, after he and his accomplice [Yong Kwee Kong](/wiki/Yong_Kwee_Kong) took hostages while exchanging fire with police during the [Tiong Bahru bus hijacking](/wiki/Tiong_Bahru_bus_hijacking). - 1991: [Chia Chee Yeen](/wiki/Chia_Chee_Yeen), a National Serviceman and army lance corporal charged with shooting his army superior to death at an army camp in July 1987. Chia was sentenced to death for murder in May 1990, and he lost his appeal in September 1991. He had been since executed. - 1994: [Ong Yeow Tian](/wiki/Ong_Yeow_Tian), a Singaporean hairstylist who was hanged on 25 November 1994 for murdering a police officer and shooting two other cops in 1989. - 1995: [Ng Theng Shuang](/wiki/Ng_Theng_Shuang), a Malaysian national, hanged on 14 July 1995 for discharging a firearm with intent to cause injury, after shooting 3 people during the attempted robbery of Tin Sing Goldsmiths in [South Bridge Road](/wiki/South_Bridge_Road) in 1992. - 1997: [Lim Chwee Soon](/wiki/Lim_Chwee_Soon), hanged on 25 July 1997 for discharging a firearm seven times during the robbery of the Kee Hing Hung [Rolex](/wiki/Rolex) boutique at the [People's Park Complex](/wiki/People%27s_Park_Complex) in 1995. - 2001: [Tay Chin Wah](/wiki/Tay_Chin_Wah), a Singaporean taxi driver, was arrested for an unsolved 1995 case of shooting two men. He was sentenced to death on 21 February 2001, and hanged on 26 October 2001. - 2005: [Khor Kok Soon](/wiki/Khor_Kok_Soon), one of Singapore's top ten fugitives, was charged in 2004 for firing a gun at 43-year-old police sergeant Lim Kiah Chin (who escaped unharmed) in 1984. He was sentenced to death in February 2005, and eventually hanged. Khor was also alleged to have killed 25-year-old truck driver Ong King Hock. - 2005: Lim Thian Lai, a Singaporean gunman who was caught in 2004 for murdering an illegal moneylender [Tan Tiong Huat](/wiki/Murder_of_Tan_Tiong_Huat) back in 1997. Lim was found guilty of discharging a firearm and killing Tan by shooting, and sentenced to death in May 2005. He lost his appeal in September 2005 and had since been hanged. - 2009: [Tan Chor Jin](/wiki/Tan_Chor_Jin), alias Tony Kia, nicknamed the \"One-eyed Dragon\" in Singapore media, was executed on 9 January 2009 for illegally discharging a firearm and killing 41-year-old nightclub owner Lim Hock Soon by shooting. ### War crimes - 1946: Shimpei Fukuye, who killed four prisoners of war during the [Selarang Barracks incident](/wiki/Selarang_Barracks_incident), was executed on 27 April 1946. - 1947: Oishi Masayuki, commander of the 2nd Field [Kempeitai](/wiki/Kempeitai), and Kawamura Saburo [ja], commander of the Syonan Defence Garrison. Both men were sentenced to death in 1947 for initiating the [Sook Ching](/wiki/Sook_Ching) massacre, and executed the same year. - Lieutenant-Colonel Sumida Haruzo, Warrant Officer Monai Tadamori, Sergeant Major Makizono Masuo, Sergeant Major Terada Takao, Sergeant Nozawa Toichiro, Sergeant Major Tsujio Shigeo, Sergeant Major Morita Shozo and army interpreter Toh Swee Koon, the eight defendants who were sentenced to death after their conviction for war crimes at the 1946 [Double Tenth incident](/wiki/Double_Tenth_incident) trial. ### Military crimes - 1915: 47 [Sepoys](/wiki/Sepoy) were executed for being part of the [1915 Singapore Mutiny](/wiki/1915_Singapore_Mutiny). ## List of death row inmates granted clemency by the President - 1978: Mohamad Kunjo s/o Ramalan, a Singaporean convicted of murdering a lorry driver in 1975 and sentenced to death in 1976. After losing his appeals against his sentence over the next two years, he filed for clemency, which was granted by President [Benjamin Sheares](/wiki/Benjamin_Sheares) in 1978. His death sentence was commuted to [life imprisonment](/wiki/Life_imprisonment_in_Singapore). - 1980: Bobby Chung Hua Watt, a Singaporean convicted of murdering his brother-in-law's brother in 1975. He was found guilty of murder and sentenced to death. After losing his appeal against his death sentence, he was initially scheduled to be executed on 18 January 1980. However, on 15 January 1980, President [Benjamin Sheares](/wiki/Benjamin_Sheares) granted him clemency and his death sentence was commuted to [life imprisonment](/wiki/Life_imprisonment_in_Singapore). He was released from prison in 1993 for good behaviour after serving at least two-thirds of his life sentence. - 1983: Siti Aminah binte Jaffar, a Singaporean convicted of drug trafficking in 1977 and sentenced to death in 1978 along with her lover, Anwar Ali Khan. The two of them appealed to President [Devan Nair](/wiki/Devan_Nair) for clemency in 1983. Anwar's plea was rejected and he was executed, but Siti's was accepted and she had her death sentence changed to [life imprisonment](/wiki/Life_imprisonment_in_Singapore). She was released from prison in 1991. - 1993: [Sim Ah Cheoh](/wiki/Sim_Ah_Cheoh), a Singaporean convicted of drug trafficking in 1985 and sentenced to death in 1988 along with her two accomplices. President [Wee Kim Wee](/wiki/Wee_Kim_Wee) accepted her plea for clemency in 1992 and her death sentence was commuted to [life imprisonment](/wiki/Life_imprisonment_in_Singapore); her two accomplices, however, were executed in 1992. While serving her life sentence, she was diagnosed with [cervical cancer](/wiki/Cervical_cancer) in 1993 and had at most a year to live. She appealed to President [Ong Teng Cheong](/wiki/Ong_Teng_Cheong) for clemency so that she could be released in order to spend the final moments of her life with her family. The President accepted the petition, and she was released on 16 February 1995 and eventually died on 30 March that year. - 1992: [Koh Swee Beng](/wiki/Koh_Swee_Beng_case), a Singaporean who killed a man who assaulted his foster father in 1988. He was convicted of murder and sentenced to death in 1990. He lost his appeal against his death sentence in 1991 but was eventually granted clemency by President [Wee Kim Wee](/wiki/Wee_Kim_Wee) on 13 May 1992 (two days before he was scheduled to be executed) and had his sentence commuted to [life imprisonment](/wiki/Life_imprisonment_in_Singapore). He was released from prison in September 2005 for good behaviour after serving at least two-thirds of his life sentence. - 1998: [Mathavakannan Kalimuthu](/wiki/Mathavakannan_Kalimuthu), a Singaporean convicted of murder and sentenced to death in 1996 along with his two friends. After losing their appeals in 1997, the three of them petitioned to President [Ong Teng Cheong](/wiki/Ong_Teng_Cheong) for clemency in 1998. The President accepted only Mathavakannan's plea so his sentence was commuted to [life imprisonment](/wiki/Life_imprisonment_in_Singapore); the other two had their pleas rejected and were subsequently executed. Mathavakannan was eventually released in 2012 after spending about 16 years in prison. - 2025: Tristan Tan Yi Rui, who was originally sentenced to death for trafficking not less than 337.6 grams of methamphetamine, later had his sentence commuted to life imprisonment after President [Tharman Shanmugaratnam](/wiki/Tharman_Shanmugaratnam) granted his clemency plea. This marked the first successful clemency plea in 27 years. ## In popular culture In 2016, Singaporean director [Boo Junfeng](/wiki/Boo_Junfeng) directed and released a film titled *[Apprentice](/wiki/Apprentice_(film))*, starring Firdaus Rahman and Wan Hanafi Su. The film, which narrates the fictional story of newly appointed prison officer and executioner Aiman Yusof, touched on the subject of the death penalty in Singapore and an executioner's perspective of the practice, as well as the experiences and ostracisation of the families when their loved ones were tried and executed. The director also revealed that he had gathered information through interviews of the retired executioners, imams and priests who counselled the death row inmates, and also the families of the executed prisoners while producing the film. The film, which was released in several international film festivals, was met with positive public responses and it attracted both nominations and awards for the director and production team. In Singapore, there were local crime shows like *[In Cold Blood](/wiki/In_Cold_Blood_(Singaporean_TV_series))*, *[Crimewatch](/wiki/Crimewatch_(Singaporean_TV_series))*, and *[True Files](/wiki/True_Files)* which re-enact the real-life crimes in Singapore. Among these cases, there were murder and drug trafficking cases which attract the death penalty in the city-state. Often, the re-enactments of these capital cases would also show the final verdicts of the convicts, where it revealed the dates of their sentencing and/or executions. Notably, executed criminals like English serial killer [John Martin Scripps](/wiki/John_Martin_Scripps), child killer [Adrian Lim](/wiki/Adrian_Lim), notorious wife-killer [Anthony Ler](/wiki/Anthony_Ler) and cop-killer [Zainal Abidin Abdul Malik](/wiki/Zainal_Abidin_Abdul_Malik) featured in these re-enactment shows since the 1980s till the present. - Singapore portal - Law portal - [Crime in Singapore](/wiki/Crime_in_Singapore) - [Law of Singapore](/wiki/Law_of_Singapore) - [Life imprisonment in Singapore](/wiki/Life_imprisonment_in_Singapore) - [List of major crimes in Singapore](/wiki/List_of_major_crimes_in_Singapore) - Aglionby, John (8 May 2005). \"Singapore finally finds a voice in death row protest\". *The Observer*. London. Retrieved 28 April 2010. - \"Singapore death penalty shrouded in silence\". Reuters. 12 April 2002. Archived from the original on 2 September 2007. Retrieved 30 November 2005. - \"Singapore clings to death penalty\". Agence France-Presse. 21 November 2005. Library resources about **Capital punishment in Singapore** - Resources in your library - Resources in other libraries - Singapore — The death penalty: A hidden toll of executions from [Amnesty International](/wiki/Amnesty_International) - The Singapore Government's Response To Amnesty International's Report from 30 January 2004 - Asia Death Penalty monitors the death penalty in Asia, including in Singapore - Singapore: Death Penalty Worldwide Academic research database on the laws, practice, and statistics of capital punishment for every death penalty country in the world.\n",
  "language": "en",
  "processed_at": "2026-01-12T10:00:20.987410",
  "title": "Capital punishment in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Capital_punishment_in_Singapore"
}