{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:00:22.772943"
  },
  "content": "Mansion in Singapore, Singapore **Capitol Building**, formerly **Shaws Building** and **Namazie Mansions**, is a historic building at the junction of [North Bridge Road](/wiki/North_Bridge_Road) and [Stamford Road](/wiki/Stamford_Road) in the [Downtown Core](/wiki/Downtown_Core) of [Singapore](/wiki/Singapore). The building had since redeveloped along with adjoined [Stamford House](/wiki/Stamford_House,_Singapore) and both were reopened as a hotel The Capitol Kempinski Hotel Singapore in October 2018. ## History **Namazie Mansions** was built by the [architecture](/wiki/Architecture) firm [Keys & Dowdeswell](/wiki/Keys_%26_Dowdeswell) next to the existing structure of the [Capitol Theatre](/wiki/Capitol_Theatre,_Singapore), which was built earlier in 1929, and was completed in 1930. It was named after the owner, [Mirza Mohamed Ali Namazie](/wiki/Mirza_Mohamed_Ali_Namazie). The style of the building is eclectic [neoclassical](/wiki/Neoclassical_architecture), characterised by somewhat ponderous detailing. Its theatre was one of the very few air-conditioned theatres when it was built by the Namazies, a prominent Persian family to host live shows. By the mid-1930s, there were 10 cinemas, of which the Capitol was the largest and the newest. It opened in 1930 and was followed by the Alhambra, Marlborough, Pavilion, Roxy, Wembley, Tivoli, Empire, Jubilee and Gaiety. As the Mansions fronted the theatre, the large movie billboards announcing the latest films were placed on its frontage, resulted the two buildings so closely associated that one was often mistaken for the other. The Namazie Mansions was sometimes erroneously referred to as the “Capitol Theatre building”. During the [Japanese occupation](/wiki/Japanese_occupation_of_Singapore), the Mansions' adjoined theatre operated under the name **Kyo-Ei Gekijo**, the theatre's English-language movies were later forbidden by the Japanese after a few months and replaced them with their own films and orchestras. The theatre operated until 1944, when a bomb planted by the anti-Japanese resistance damaged it and the Mansions itself. After 1946, the Namazie Mansions was purchased by [Shaw Organisation](/wiki/Shaw_Organisation) and renovated in 1948 partly to restore its damaged parts, and renamed as **Shaws Building**. Its adjoined Capitol Theatre became the organisation's flagship theatre with 1,686 seats. The patrons had \"the choice of gallery, stalls and circle seats which were priced at S$1, S$2 and S$3 respectively from the early post-World War II years until the 1970s. The Building was also a location where [Magnolia](/wiki/Magnolia_(Fraser_and_Neave_brand)) opened its first Singapore snack bar at the building in 1946, which was a favourite haunt for school students, young couples and tourists. It had since closed on 12 July 1988 at 9 pm. In 1978, Shaw Organisation put up Shaws Building and Capitol Theatre for sale, however no deal had been reached. Shaw Organisation later revealed plans to acquire the land of the nearby [Capitol Shopping Centre](/wiki/Capitol_Shopping_Centre,_Singapore) and to demolish Capitol Theatre and Shaws Building and redevelop the site into a shopping complex and a multiscreen cinema with commercial and residential apartments. However, under the Control of Rent Act 1953 in Singapore law, the Shaw Organisation had to provide compensation to its current tenants which proved a challenge to them. In August 1983, the Shaws Building and Capitol Theatre were gazetted for preservation by the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) (URA) and later acquired them in 1984 with [Shaw Organisation](/wiki/Shaw_Organisation) served as the lessee so that both of the buildings would be preserved as part of a future development. The Shaws Building underwent renovations in 1989 and was relaunched on 30 April 1992 as the Capitol Building. On 29 December 1998, the Capitol Theatre screened its last film *[Soldier](/wiki/Soldier_(1998_American_film))*, and was officially closed on the following day. In 2000, the [Singapore Tourism Board](/wiki/Singapore_Tourism_Board) took over the two buildings to explore alternative uses for it, but plans to turn it into a home for an arts group was languished and the cost of refurbishment was exorbitant. On April 3, 2008, it was reported by The Straits Times that the Capitol Building will be redeveloped along with its stretch of adjoining buildings - [Capitol Theatre](/wiki/Capitol_Theatre,_Singapore), [Capitol Centre](/wiki/Capitol_Centre,_Singapore) and [Stamford House](/wiki/Stamford_House,_Singapore) in 2009. The 4 adjoining buildings currently rest on an area of about 1.45 hectares with a total of 250 tenants, including offices and retail outlets. Tenancy with retailers along the Capitol stretch will end by May 2009, and to have their businesses relocated elsewhere. A spokesman for the Singapore Land Authority said the Authority will finalise the eviction notice once the timing and details for the development of the site are finalised. While development plans are being made, three of the buildings except for Capitol Centre have been gazetted for conservation, meaning that the buildings' facades and other architectural features must be maintained to ensure the buildings' historical integrity. It is believed by property analysts that the development area will attract major property developers to bid and develop the site. ## Redevelopment Grant Associates worked closely with the project's lead architect, Richard Meir and Partners Architects, the project consist of Singapore's largest cinema cum theatre complex, 6 stars luxury hotel & retail shops, with a total size of 21,000 m. In November 2011, Shimizu Corporation was awarded the redevelopment project to develop into a large scale mixed use complex called \"Capitol Development\". This project consist of Singapore's largest cinema cum theatre complex, 6 stars luxury hotel & retail shops, with a total size of 21,000 m2. There was a shopping component named [Capitol Piazza](/wiki/Capitol_Piazza) and also a residential component, named Eden Residences Capitol. In April 2013, 12 residential units were sold at average price of S$3000 psf. The redevelopment of the complex had since completed, its topping out ceremony held on 3 April 2014, its adjoined Capitol Theatre officially reopened on 19 May 2015 after the 17 years hiatus with the world premiere of *Singapura: The Musical*. In 2015, Capitol Building and Stamford House were refurbished and scheduled to reopen as a six-star hotel known as The Patina, Capitol Singapore by the end of 2015, however was delayed due to dispute among its owners. By 2016, the project stalled when disagreement arose within the consortium, and the hotel spread across Capitol Building and Stamford House failed to open although a Temporary Occupation Permit was given in October 2017. The deadlock was broken by a settlement made in the High Court in January 2018 and, in March, Perennial bought out Chesham Properties for about $528 million. In May 2018, Perennial Real Estate Holdings appointed [Kempinski Hotels S.A.](/wiki/Kempinski_Hotels_S.A.) as its operator, and renamed the hotel The Capitol Kempinski Hotel Singapore. It has 157 guest rooms and suites, and an international restaurant situated within the restored Capitol Building and Stamford House. The Capitol Building and Stamford House were officially opened as The Capitol Kempinski Hotel Singapore on 1 October 2018. - Shaw Online - Capitol Singapore - The Patina, Capitol Singapore - The Capitol Kempinski Hotel Singapore\n",
  "language": "en",
  "processed_at": "2026-01-12T10:00:22.772414",
  "title": "Capitol Building, Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Capitol_Building,_Singapore"
}