{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:00:24.163932"
  },
  "content": "Theatre in Singapore **Capitol Theatre** is a historic [cinema](/wiki/Movie_theatre) and theatre located in [Singapore](/wiki/Singapore). It was adjoined to four-storey building known as the [Capitol Building](/wiki/Capitol_Building,_Singapore). The Capitol Theatre was considered one of Singapore's finest theatres in the 1930s during that time. ## History In 1929, [Mirza Mohamed Ali Namazie](/wiki/Mirza_Mohamed_Ali_Namazie), a [Persian](/wiki/Persian_people) businessman of the Namazie family, commissioned the theatre to be built in Singapore, with S. A. H. Shirazee, an Indian-Muslim merchant and community leader, and the South African brothers Joe and Julius Fisher from [First National Pictures](/wiki/First_National_Pictures), joined in to form Capitol Theatres Ltd as its operator. Namazie would serve as the theatre company's chairman with Shirazee as director, Joe Fisher as managing director and his brother Julius Fisher as the publicity manager. ### Architecture and equipment Joe Fisher travelled overseas to acquire the materials for the theatre's furnishings, decorations and design. The Capitol Theatre was designed [neoclassical architecture](/wiki/Neoclassical_architecture) by British architects [Keys and Dowdeswell](/wiki/Keys_and_Dowdeswell), with its general plan, seating arrangements and lighting inspired from the [Roxy Theatre](/wiki/Roxy_Theatre_(New_York_City)) in [New York](/wiki/New_York_City), [United States](/wiki/United_States). Builders Messrs Brossard and Mopin began construction of the foundation around July 1929. Messrs Sherwin-Williams Paint Co. in collaboration with local partner Messrs Lohmann and Co., designed the theatre's walls' and ceilings' detailing. Although installed with ventilation system, the theatre's roof was able to slide open which leave a 40-foot aperture for more ventilation. The first layout of the theatre could accommodate at least 1,600 people, with 1,100 seated on the ground floor. Another 500 seats were available at the circle that could be accessed via lifts or staircases. The seats were a few inches wider than normal British cinema seats, and the upholstery was supplied by a New York company. The theatre had a large projection room located below the balcony and ran the length of the building instead of being traditionally sited in the rear. It housed the latest Simplex projector installed with fireproof protection shutters. The theatre's acoustics and soundproofing were said to be exceptional at that time. Special expensive sound installations costing at least 40,000 [Straits dollars](/wiki/Straits_dollar) were imported from [Western Electric Company](/wiki/Western_Electric_Company). The theatre's stage was also designed for stage productions, with changing rooms and organ chambers built into the theatre. It was also the first to equip multihued lighting system using concealed lamps with a dimmer function, which was never used in other existing theatres in Singapore at that time. Besides having the floodlit main entrance at the junction of Stamford Road and North Bridge Road, there are also two side entrances from Stamford Road and North Bridge Road, with a parking lot to accommodate at least 200 cars. There were several food outlets at the theatre. The main café on the first floor had a dance floor where cabaret was held at the selected nights, and adjoining the café was a restaurant known as the **Capitol Restaurant**. A café lounge was located at the circle. A special cooling room for making French pastries was built in the kitchen on the ground floor. Its adjoined building known as [Namazie Mansions](/wiki/Namazie_Mansions), which was named after the Chairman Namazie, was completed in the early 1930. ### Official Opening On 22 May 1930, Capitol Theatre officially opened on the evening with much fanfare with musical comedy film *[Rio Rita](/wiki/Rio_Rita_(1929_film))*, the theatre was hailed as having the most modern auditorium with the largest capacity in the Far East. Several specially prepared short films were screened to demonstrate the quality from its installed sound system. These were an overture, Capitol March, a cartoon *[Finding His Voice](/wiki/Finding_His_Voice)* demonstrating the workings of the sound system; and the recorded inaugural announcement by the Capitol's managing director, Joe Fisher. However, during the first screening at 6.15 pm, there was a mechanical fault from the faulty sound projection, which was then corrected by the 9.15 pm show. ### Operations under the Namazies Joe Fisher, who became a pioneer in the Malayan cinema industry along with his brother Julius, was responsible for purchasing films' rights for the theatre, which was able to gain exclusive first-screening rights for [Paramount Pictures](/wiki/Paramount_Pictures) and [Universal Studios](/wiki/Universal_Pictures) productions, along with exclusive distribution rights for [Radio Pictures](/wiki/Radio_Pictures). The theatre would also screened the [British Pathé](/wiki/British_Path%C3%A9) Sound News, as well as a new film for every week. Capitol Theatre soon faced with issues, including the sudden death of Namazie on 26 July 1931, strict censorship laws and the competitions with other theatres which hurt its operations financially. In 1933, Joe and Julius Fisher started *[The Mickey Mouse Club](/wiki/The_Mickey_Mouse_Club)* to attract business. They later brought in the *Marcus Show*, a revue with a chorus line of 60 dancing girls, thus making the theatre and its various eateries a popular hangouts for the local youths. Early movie stars such as [Charlie Chaplin](/wiki/Charlie_Chaplin), [Ava Gardner](/wiki/Ava_Gardner), [Mary Pickford](/wiki/Mary_Pickford) and [Douglas Fairbanks](/wiki/Douglas_Fairbanks) visited the theatre to promote their movies when they were in Singapore. In September 1939, the theatre was refurbished, seats were replaced with new upholstered ones, installed an air-conditioning system and had its vestibule redesigned and was completed by 31 January 1940. On the following day the theatre screened *[The Wizard of Oz](/wiki/The_Wizard_of_Oz_(1939_film))* to mark the occasion, and gained ahead of its competitors. On 19 December 1941, the colonial government requisitioned Capitol Theatre, which was closed after one show and also the closure of the Capitol Restaurant to serve as a food depot while the Mansions continued as the residential flats. ### Operations under the Japanese Following the [Japanese Occupation of Singapore](/wiki/Japanese_Occupation_of_Singapore) from 1942, the theatre was taken over by the Japanese to serve as a food deport and operated under the name ***Kyo-Ei Gekijo***, its English-language movies would later be forbidden after a few months and the theatre would only screen Japanese feature and propaganda films as well as orchestras. The theatre operated until 1944, when a bomb planted by the anti-Japanese resistance fighters exploded, damaging its facade and the Mansions as well. ### Operations under Shaw Organisation After the war in 1945, Capitol Theatre and Namazie Mansions had since put under mortgage by the [Hongkong and Shanghai Banking Corporation](/wiki/Hongkong_and_Shanghai_Banking_Corporation). Later in 1946, Shaw bought over the buildings for $3 million and made the Capitol Theatre as its flagship cinema and renamed its adjoined Mansions as Shaws Building. In the late 1948, renovation of the buildings started which included repairing the damaged structure and new ballroom and restaurant known as **Capitol Ballroom & Restaurant** with a function room named **Capitol Blue Room** on the first floor. Its supposed reopening of the theatre on 30 March 1951 was delayed for 24 hours, due to the late arrival of the equipment needed for the Scandinavian Ice Revue to install the ice rink in the theatre. The theatre was officially reopened on 31 March 1951 at 9.15 pm to host the first ice show in Singapore. On 23 December 1952, the **Capitol Chinese Restaurant** was opened in the Capitol Blue Room in the evening, which specialised in Shanghai and Sichuan food prepared by cooks from China. From the 1951 to the 1960s, the theatre was also the venue for hosting *[Miss Singapore](/wiki/Miss_Singapore)* and *[Miss Malaya](/wiki/Miss_Malaya)* beauty pageants. The Variety show *Musical Express* and Singaporean musical group *[The Quests](/wiki/The_Quests)* were held at the Capitol from the 1960s onwards. In 1978, Shaw Organisation put up Capitol Theatre and Shaws Building for sale, however no deal had been reached. Shaw Organisation later revealed plans to acquire the land of nearby [Capitol Shopping Centre](/wiki/Capitol_Shopping_Centre,_Singapore) and to demolish Capitol Theatre and Shaws Building and redevelop the site into a shopping complex and a multiscreen cinema with commercial and residential apartments. However, under the Control of Rent Act 1953 of Singapore penal code, the Shaw Organisation had to provide compensation to its current tenants which proved a challenge to them. In February 1984, the [Singapore Government](/wiki/Singapore_Government) gazetted the two buildings for redevelopment and later acquired the buildings from Shaw in 1987, for which the Shaw Organisation became the lessee for the use of the theatre and the building. In 1989, the theatre closed for a two-week renovation with the cost of S$700,000 with rewiring, reequipped with the new sound system and projectors and painting of the cinema hall and reopened 26 October 1989 with *[Lethal Weapon 2](/wiki/Lethal_Weapon_2)*. The Shaws Building also underwent renovations and was relaunched on 30 April 1992 as the Capitol Building for commercial purposes. On 29 December 1998, the Capitol Theatre screened its last film *[Soldier](/wiki/Soldier_(1998_American_film))*, and was officially closed on the following day. ### Operations under The Capitol Kempinski Hotel Singapore On 1 December 2025, it was announced that The Capitol Kempinski Hotel Singapore would assume management of the Capitol Theatre, allowing the hotel to curate and oversee a range of public and private events within the restored venue. ## Redevelopment In 2000, the [Singapore Tourism Board](/wiki/Singapore_Tourism_Board) took over the two buildings to explore alternative uses for it, but plans to turn it into a home for an arts group was languished and the cost of refurbishment was exorbitant and was commercially unfeasible. On 3 April 2008, plans of redeveloping the Capitol Theatre, Capitol Building, Capitol Centre and [Stamford House](/wiki/Stamford_House,_Singapore) as a single integrated site was first publicised in a news report carried by *[The Straits Times](/wiki/The_Straits_Times)*. By redeveloping the 4 developments as one, it would allow for the Theatre to run as a \"loss leader\" among the other 3 commercial developments. The 4 adjoining developments had a total area of about 1.45 ha (14,500 m2) with a total of 250 tenants, including offices and retail outlets. With most of the tenants moving out by May 2009, [Singapore Land Authority](/wiki/Singapore_Land_Authority) would inform the tenants of the need to move when details of the development of the site had been finalised. Other than the Capitol Centre, the other three buildings were gazetted for conservation on 16 July 2007, meaning that these buildings' facades must be maintained. In November 2011, Shimizu Corporation was awarded the redevelopment project to develop into a large scale mixed use complex called \"Capitol Development\". With Grant Associates working closely with the project's lead architect, Richard Meir and Partners Architects, the project consists of Singapore's largest cinema cum theatre complex, 6 stars luxury hotel & retail shops, with an approximate [Gross Floor Area](/wiki/Gross_Floor_Area) (GFA) of 21,000 m2 (2.1 ha), and on the site of the former Capital Centre, a shopping mall, [Capitol Piazza](/wiki/Capitol_Piazza) and residential tower, Eden Residences Capitol, with an approximate GFA of 29,000 m2 (2.9 ha). As it was common to jaywalk on the roads between the [St Andrew's Cathedral](/wiki/St_Andrew%27s_Cathedral,_Singapore) and the Capitol Centre prior to the redevelopment, the new development was connected to the nearby [City Hall MRT station](/wiki/City_Hall_MRT_station) via an underpass stretching towards the Capitol Piazza. Having been left vacant for more than 10 years, the Theatre was infested with rats, its plaster was falling, ornaments were missing, and water had seeped into its floors. During the restoration process, original design details were uncovered such as \"the gilding on the plaster mouldings, and the fine features of the two ‘Pegasus’ reliefs\" that were painted over multiple times. Additionally, the original Persian Zodiac ceiling mural was not salvageable, so was recreated instead. The original [fly tower](/wiki/Fly_tower) was taken down, and a whole new basement was excavated as well, while having to maintain the structural integrity of the building and the surrounding building. New technology was incorporated into the Theatre to modernise it. An automated, rotational seating system was installed, allowing the Theatre to turn into a multi-functional venue to accommodate a large variety of events. The system would allow for up to 800 seats with 452 seats transformable. Additionally, half of the season would be used by [Golden Village](/wiki/Golden_Village) (GV) to screen movie blockbuster premieres, and it had also installed servers and projectors in the venue, allowing the venue to host red carpet events as well. The other half of the season would be dedicated to local performing arts groups. ### Reopening The redevelopment of the [Capitol Singapore](/wiki/Capitol_Singapore) complex had since completed and its topping out ceremony was held on 3 April 2014. The Capitol Theatre was reopened on 19 May 2015 after the 17 years hiatus with the world premiere of *Singapura: The Musical*. ## Gallery\n",
  "language": "en",
  "processed_at": "2026-01-12T10:00:24.163402",
  "title": "Capitol Theatre, Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Capitol_Theatre,_Singapore"
}