{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:00:27.279034"
  },
  "content": "Singaporean actressThis biography of a living person **needs additional citations for verification**. Please help by adding reliable sources. Contentious material about living persons that is unsourced or poorly sourced **must be removed immediately** from the article and its talk page, especially if potentially libelous. *Find sources:* \"Caroline Cheong\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(January 2022)* *(Learn how and when to remove this message)* **Caroline Cheong** is a [Singaporean](/wiki/Singapore) actress, known for making her movie debut as Victoria in the 2007 film [The Tattooist](/wiki/The_Tattooist). ## Education Cheong studied at [St. Margaret's Secondary School](/wiki/St._Margaret%27s_Secondary_School) and [LaSalle-SIA College of the Arts](/wiki/LASALLE_College_of_the_Arts) with a diploma in [drama](/wiki/Drama).[*citation needed*] ## Biography Although Caroline has embarked on many TV productions for local television, she has also acted in many independent films[*citation needed*]. She quoted \"Waking up\" by Black Paper Productions as her proudest project to date. She has been on the cover of Eat! and FHM Singapore magazine twice[*citation needed*]. She was also in the top 100 sexiest women according to FHM magazine twice[*citation needed*]. Caroline is versatile in both film and on stage[*clarification needed*]. She started off with acting onstage in black box productions and was later discovered and signed on with Fly Entertainment where she started her TV and film career. In 2003, Cheong with Evelyn Ng and Diana Natalie, all from [Fly Entertainment](/wiki/Fly_Entertainment), formed a band, Cosmic Angels, to promote US makeup brand Tony & Tina. In 2007, Cheong with Gerald Chew, acted in *[The Tattooist](/wiki/The_Tattooist)*, a New Zealand-Singapore production. Caroline has also hosted events for Seventeen and Lime magazine[*citation needed*]. ## Personal life Cheong is born to a Chinese father and Portuguese mother[*citation needed*]. Born and bred in Singapore, she is now based in Hong Kong. ## Filmography ### Film YearTitleRoleNotesRef.2004*Waking Up*Black Paper Productions2005*Inspector X*2006*When We Were Bengs*Jane Ho2007*[The Tattooist](/wiki/The_Tattooist)*Victoria ### Television YearTitleRoleNotesRef.2002–2005*[Phua Chu Kang Pte Ltd](/wiki/Phua_Chu_Kang_Pte_Ltd)*Lynette Khoo2003*Light Years*Kimberly Lim Kim - Caroline Cheong at [IMDb](/wiki/IMDb_(identifier)) - Caroline Cheong, Fly Entertainment This article about a Singaporean actor is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T10:00:27.278613",
  "title": "Caroline Cheong",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Caroline_Cheong"
}