{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:00:28.374845"
  },
  "content": "Mobile and online marketplaceThis article needs to be **updated**. Please help update this article to reflect recent events or newly available information. *(May 2025)* **Carousell** is a Singaporean [e-commerce](/wiki/E-commerce) company that allows users to purchase and sell [used goods](/wiki/Used_goods) via the [online marketplace](/wiki/Online_marketplace) of the same name. Headquartered in Singapore, it also operates in Malaysia, Indonesia, the Philippines, Taiwan, Hong Kong, Macau, Australia, New Zealand and Canada. Carousell is available on both iOS and Android devices. ## History Carousell was founded in Singapore on 14 May 2012, by co-founders Quek Siu Rui, Lucas Ngoo, and Marcus Tan. The first item sold on Carousell was an [Amazon Kindle](/wiki/Amazon_Kindle) e-reader for S$75. Carousell was subsequently registered as Carousell Pte. Ltd. on 2 January 2013. Carousell received its first investment from [Quest Ventures](/wiki/Quest_Ventures). In November 2013, [Rakuten](/wiki/Rakuten), with follow-on investments by [Golden Gate Ventures](/wiki/Golden_Gate_Ventures), 500 Global (previously 500 Startups), and a few other investors invested $1 million in Carousell. Subsequently, in November 2014, Carousell announced that it received US$6 million in investment from Sequoia India. In August 2016, Carousell raised $35 million in their Series B funding round by Rakuten Ventures, Sequoia India, Golden Gate Ventures, and [500 Global](/wiki/500_Startups). In October 2016, Carousell acquired Singaporean mobile-first used car marketplace and dealership tool Caarly. A consortium led by South Korean Internet giant Naver has struck an investment deal with classifieds platform Carousell worth US$80 million. Following the deal, the Singapore-headquartered start-up will be valued at over US$900 million. As of 2016, over 23 million items had been sold on Carousell and users had created over 57 million listings of new and used items for sale. Carousell has expanded regionally to several countries, including Australia, Hong Kong, Taiwan, Malaysia, Indonesia. However, Carousell's expansion into Taiwan faces competition against headstart companies like [Yahoo!](/wiki/Yahoo!) and Ruten, which are already settled in the e-commerce market. In April 2019, Carousell acquired [OLX](/wiki/OLX) Philippines after receiving an investment from [Naspers](/wiki/Naspers). The company raised $85 million Series C funding in May 2018. The round was co-led by existing investor Rakuten Ventures and EDBI. Other participants included [500 Global](/wiki/500_Startups), Golden Gate Ventures and [Sequoia](/wiki/Sequoia_Capital) India as well as new investor [DBS](/wiki/DBS_Bank). On 21 November 2019, Carousell merged with Telenor's 701Search to creates a regional leader in online classifieds across 8 markets in Southeast Asia, Hong Kong and Taiwan. Mudah, Chotot and OneKyat which were owned by 701Search will retain their individual brands and platforms, continuing operations in Malaysia, Vietnam and Myanmar respectively following the merger. In June 2021, Bloomberg reported that Carousell is planning a [SPAC](/wiki/Special-purpose_acquisition_company) merger. In September 2021, Carousell announced that it had raised US$100 million in a round of funding led by South Korean private equity firm [STIC Investments](/wiki/STIC_Investments), bringing its valuation to US$1.1 billion. On 23 September 2025, Carousell opened its first luxury boutique in [The Centrepoint](/wiki/The_Centrepoint) in [Singapore](/wiki/Singapore), selling pre-owned luxury items. ## Partnerships and collaborations In January 2013, [Singapore Press Holdings](/wiki/Singapore_Press_Holdings)' ST Classifieds announced its collaboration with Carousell. According to a Yahoo Finance article in August 2013, Carousell announced its partnership with Singapore Press Holdings (SPH) Magazines, a subsidiary of SPH, to create a mobile app called SheShops Marketplace, selling fashion and beauty items. On 21 June 2018, Carousell announced its partnership with DBS Holdings, [Stripe](/wiki/Stripe_(company)) and [VISA](/wiki/Visa_Inc.), to launch CarouPay, a mobile payment service. In 2019, Carousell revamped CarouPay to launch Carousell Protection. Carousell Protection is its secure in-app payment feature that allows buyer and seller to make payment and complete the deal on Carousell, through credit/debit card or DBS PayLah!. Some features include that the payment be held by Carousell until both buyer and seller are satisfied with the transaction, and that buyers and sellers are given a platform to raise and resolve issues with their order in the app. In 2019, Carousell has merged with 701Search, the classifieds firm owned by Norwegian telco [Telenor Group](/wiki/Telenor_Group), lifting the value of the Singapore start-up to over US$850 million (S$1.16 billion) from US$560 million. ## Operation Items are prohibited for sale on Carousell if they are illegal or violate the marketplace's community guidelines. Carousell Media Group appointed a new head of ad operations in 2021. ## Controversies Users of Carousell also complained about scams by fake sellers. The [Singapore Police Force](/wiki/Singapore_Police_Force) has reported that over 70% of e-commerce scams in 2018 took place on Carousell. In October 2020, it was reported to the [Health Sciences Authority](/wiki/Health_Sciences_Authority) that a long-banned weight-loss product was sold on Carousell and other e-commerce platforms. In January 2022, Carousell leaked more than 2.6 million users personal data, with over 320,000 Hong Kong users’ data being compromised. - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T10:00:28.374392",
  "title": "Carousell (company)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Carousell_(company)"
}