{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:00:30.075563"
  },
  "content": "Online car marketplace **Carro** is an [online marketplace](/wiki/Online_marketplace) for buying and selling new and used cars headquartered in [Singapore](/wiki/Singapore) and operates in Malaysia, Indonesia, Thailand, Japan, Taiwan and Hong Kong. ## History Carro was co-founded in 2015 by Aaron Tan and his [Carnegie Mellon University](/wiki/Carnegie_Mellon_University) classmates Aditya Lesmana and Kelvin Chng. In 2016, Carro received $5.3 million in a series A [funding round](/wiki/Funding_round) led by Venturra Capital and other investors including [Golden Gate Ventures](/wiki/Golden_Gate_Ventures), Alpha JWC and GMO Ventures. In May 2018, Carro raised $60 million in a series B round led by Softbank Ventures Korea, Insignia Ventures Partners, Singtel Innov8 and [B Capital](/wiki/B_Capital). In August 2019, Carro raised $30 million in a round of series B funding and used the funds to acquire the Indonesian e-commerce site [Jualo.com](/wiki/Jualo.com). In September, Carro announced the inception of its operations in Malaysia through a $30 million investment into the car-bidding online platform Carro Malaysia (formerly myTukar). In June 2021, Carro received $360 million in a C funding round which raised its valuation to $1 billion led by SoftBank. In November, Singapore state investor [Temasek Holdings](/wiki/Temasek_Holdings) and Malaysian fund manager and [Permodalan Nasional Berhad](/wiki/Permodalan_Nasional_Berhad) (PNB) led a Series C round for Carro which raised more than $100 million, other investors included Sime Darby, Shinhan Financial Group and Mirae Asset. In June 2022, Carro acquired a 50% stake in the rental unit of the Indonesian automotive group, PT Mitra Pinasthika Mustika (MPM Rent) for nearly $54 million. In March 2023, Carro added EMPG, the parent company of Kaidee, to its cap table. In June, Carro entered into a partnership with [Jardine Cycle & Carriage](/wiki/Jardine_Cycle_%26_Carriage) valued at more than $60 million. In March 2024, Carro started its operations in Hong Kong by the acquisition of the used car market Beyond Cars. - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T10:00:30.074981",
  "title": "Carro (online car marketplace)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Carro_(online_car_marketplace)"
}