{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:00:35.409622"
  },
  "content": "House in Singapore The **Cashin House**, known as **The Pier**, is a former residence of the Cashin family extending out to sea in [Lim Chu Kang](/wiki/Lim_Chu_Kang), [Singapore](/wiki/Singapore). The house on the pier was restored and became a new visitor gateway to the western part of [Sungei Buloh Wetland Reserve](/wiki/Sungei_Buloh_Wetland_Reserve) known as Lim Chu Kang Nature Park. ## History The [Lim Chu Kang](/wiki/Lim_Chu_Kang) area in Singapore, was once made up of mangroves rain forests and rubber plantations belonged to Namazie and Cashin Estates. A pier was built in 1906 by Henry Cashin, an [Irish](/wiki/Ireland) merchant, for his rubber estate. Henry Cashin's grandson, Joseph Cashin, would build a house on the pier some time from 1920 to 1921, hence the name **The Pier**. The Pier was also one of the sites where the [Imperial Japanese Army](/wiki/Imperial_Japanese_Army) first landed on the north-western coastline on 8 February 1942 during the [Battle of Singapore](/wiki/Battle_of_Singapore) of the [World War II](/wiki/World_War_II). Once [Kranji](/wiki/Kranji) and [Lim Chu Kang](/wiki/Lim_Chu_Kang) fell during the [Japanese Occupation of Singapore](/wiki/Japanese_Occupation_of_Singapore), the Japanese went on to erect a war shrine at the site. The house was used by Imperial Japanese Army officers as a [comfort](/wiki/Comfort_women) stop until 1945. In the 1960s, before the rubber plantation owner and lawyer Howard Edmund Cashin (1920–2009) and his wife Gillian moved into the house, he had the war shrine removed and constructed the road to the house. According to Howard Cashin in the interview, the Japanese war shrine was something that he had difficulty removing after the war as it was not easy to find workmen willing to demolish the shrine during that time, as the stone from the [pedestal](/wiki/Pedestal) of the shrine had stood on was used to construct the road to the house that he wanted to add on. The house was extended and redesigned, its interior was redesigned with a modern touch, with ceiling fans, aircon and other facilities powered by electricity. Barbeque pit and stone tables were the later additions on the landed compound near The Pier. Cashin and his family would lived at The Pier occasionally as their weekend resort until his death on 5 September 2009. ## Redevelopment The house has since vacated and its compound was acquired and fenced up by the [Singapore Land Authority](/wiki/Singapore_Land_Authority). According to URA Draft Master Plan 2013 and URA Master Plan 2014 regarding the Singapore's North Region, the house will be restored and become a visitor gateway to the western part of [Sungei Buloh Wetland Reserve](/wiki/Sungei_Buloh_Wetland_Reserve). The 18-ha western extension of Sungei Buloh Wetland Reserve was named as the upcoming Lim Chu Kang Nature Park in 2020. Restoration work on the house and the Lim Chu Kang Nature Park were expected to start in the fourth quarter of 2020, and both are slated for completion in early 2022 which was subjected to the [coronavirus pandemic](/wiki/COVID-19_pandemic). As of August 2023, the redevelopment works had completed. This involved demolishing the previous structure, dredging the mudflats to create a new foundation, and rebuilding a strengthened exo-skeleton as seen in engineering photos taken by the contractor. Most aspects and even some original materials of the original building have been repurposed, but it is in essence, a new, strengthened structure built to mimic the original structure. - [Matilda House](/wiki/Matilda_House), the Cashin family former main residence.\n",
  "language": "en",
  "processed_at": "2026-01-12T10:00:35.409083",
  "title": "Cashin House",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Cashin_House"
}