{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:00:36.375313"
  },
  "content": "Statutory board of the Government of Singapore The **Casino Regulatory Authority of Singapore** (**CRA**) was a [statutory board](/wiki/Statutory_boards_of_the_Singapore_Government) under the [Ministry of Home Affairs](/wiki/Ministry_of_Home_Affairs_(Singapore)) of the [Government of Singapore](/wiki/Government_of_Singapore). It was formed on 2 April 2008 to regulate the management and operation of the casinos in Singapore. The CRA is responsible for ensuring that the management and operation of the casinos in Singapore remains free from criminal influence or exploitation. It also ensures that gaming in a casino is conducted honestly, and that casinos do not cause harm to minors, vulnerable persons and society at large. On 1 August 2022, it was reconstituted to form the Gambling Regulatory Authority of Singapore. ## Enforcement Actions In 2017, the CRA imposed financial penalties of SGD$60,000 on the two casino operators for lapses in their security screening. [Marina Bay Sands](/wiki/Marina_Bay_Sands) was fined SGD$5,000 for failure to prevent one permanent resident from entering or remaining on its casino premises without a valid entry levy. [Resorts World Sentosa](/wiki/Resorts_World_Sentosa) was fined SGD$55,000 for failures to prevent three minors and one excluded person gaining access to the casino floor. Under the Casino Control Act, an entry levy is chargeable to Singapore citizens or permanent residents wishing to enter the casino area of each resort. All patrons must also be aged 21 or over in order to gamble legally in its casinos. - [Gambling in Singapore](/wiki/Gambling_in_Singapore) - [Marina Bay Sands](/wiki/Marina_Bay_Sands) - [Resorts World Sentosa](/wiki/Resorts_World_Sentosa) - Casino Regulatory Authority, Singapore Archived 19 January 2016 at the [Wayback Machine](/wiki/Wayback_Machine) - Casino Control Act, Singapore This Singaporean organisation article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T10:00:36.374771",
  "title": "Casino Regulatory Authority of Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Casino_Regulatory_Authority_of_Singapore"
}