{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:00:38.454920"
  },
  "content": "Building in SingaporeThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Cathay Building\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(October 2023)* *(Learn how and when to remove this message)* The **Cathay Building** ([simplified Chinese](/wiki/Simplified_Chinese_characters): 国泰大厦; [traditional Chinese](/wiki/Traditional_Chinese_characters): 國泰大廈; [Malay](/wiki/Malay_language): *Bangunan Cathay*) was opened in 1939 by Dato [Loke Wan Tho](/wiki/Loke_Wan_Tho) as the headquarters for the British Malaya Broadcasting Corporation. Located at 2 Handy Road in the [Museum Planning Area](/wiki/Museum_Planning_Area) of [Singapore](/wiki/Singapore), the building was most known for its air-conditioned theatre known as the Cathay Cinema, then a technological marvel and the first to be built in Singapore. Cathay Building was the first skyscraper in [Singapore](/wiki/Singapore) and tallest building in [Southeast Asia](/wiki/Southeast_Asia) at that time. It was demolished in 2003. ## History ### 1930s: Opening and initial years The supposed 16 storey (11 storey upon completion) Cathay Building was designed by [British](/wiki/British_people) [architect](/wiki/Architect) Frank W Brewer. The Cathay Building consisted of the [Cathay Cinema](/wiki/Cathay_Cinema), a restaurant and the dance hall on the ground floor, as well as a roof garden above the cinema and a residential storey block with a [penthouse](/wiki/Penthouse_apartment). The first part of the Cathay Building was opened on 3 October 1939 with the 1,300-seat Cathay Cinema, the dance hall and the Cathay Restaurant. On 1 July 1940, the 11 storey residential block was opened for occupancy, with the owners [Mrs Loke Yew](/wiki/Loke_Cheng_Kim) and [Loke Wan Tho](/wiki/Loke_Wan_Tho) occupied the eleventh floor. The building was the first and tallest skyscraper in Singapore and in Southeast Asia, at a height of 83.5 metres from the [Dhoby Ghaut](/wiki/Dhoby_Ghaut) entrance to the top of the building's water tower. Its theatre was the island's first air-conditioned cinema and public building, and where one could sit in an arm chair to watch a [film](/wiki/Film); a rare amenity during that time. The building was also used as a [landmark](/wiki/Landmark) for final landing approach at [Singapore](/wiki/Singapore)'s first purpose-built civilian airport, [Kallang Airport](/wiki/Kallang_Airport). ### 1940s: World War II and Indian National Army At the beginning of [World War II](/wiki/World_War_II) in 1942, the building was rented out to the [Straits Settlements](/wiki/Straits_Settlements) government and the Malaya Broadcasting Corporation. Five floors were occupied by broadcast studios and administration, the two floors by the Ministry of Economic Warfare, and the [Royal Air Force](/wiki/Royal_Air_Force) occupied two rooms on another floor. When Singapore [fell to the Japanese](/wiki/Battle_of_Singapore), it was used to house the Japanese Broadcasting Department, the Military Propaganda Department, the Military Information Bureau and the broadcast department of the [Indian National Army](/wiki/Indian_National_Army)'s [Provisional government of Free India](/wiki/Provisional_government_of_Free_India) during the [occupation period](/wiki/Japanese_Occupation_of_Singapore). On 21 October 1943, [Subhas Chandra Bose](/wiki/Subhas_Chandra_Bose) announced the formation of the Provisional Government of Azad Hind (Free India) at Cathay Building with himself as the Head of State, Prime Minister and Minister of War. The Japanese utilised the building to broadcast propaganda in the [Japanese language](/wiki/Japanese_language). It was also the residence of film director [Yasujirō Ozu](/wiki/Yasujir%C5%8D_Ozu) from 1944 till the end of the war. > In the name of God, in the name of bygone generations who have welded the Indian people into one nation, and in the name of the dead heroes who have bequeathed to us a tradition of heroism and self-sacrifice we call upon the Indian people to rally round our banner and strike for India’s freedom. We call upon them to launch the final struggle against the British and their allies in India and to prosecute that struggle with valour and perseverance and full faith in final victory until the enemy is expelled from Indian soil and the Indian people are once again a Free Nation. — Subhas Chandra Bose proclaiming the [Free India](/wiki/Azad_Hind) at Cathay Cinema Building in Singapore on 21 October 1943, When the war ended in 1945, it served as the headquarters for [Admiral Lord Mountbatten](/wiki/Louis_Mountbatten,_1st_Earl_Mountbatten_of_Burma) while serving as the Supreme Allied Commander [South East Asia Theatre](/wiki/South-East_Asian_Theatre_of_World_War_II) of the [South East Asia Command](/wiki/South_East_Asia_Command) (SEAC). When the SEAC was disbanded a year later, the building was converted back to a cinema and a hotel. The cinema was the first to show [American](/wiki/United_States) and [British](/wiki/United_Kingdom) films in Singapore. A new air-conditioning plant was installed in the building in 1948. The colonial government vacated the building to be returned to the Cathay Organisation. The Cathay Restaurant was officially reopened on 1 May 1948 under the management of Cathay Restaurant Ltd. ### 1950-70s: Hotel and nightclub On 9 January 1954, the building reopened as Cathay Hotel with 60 rooms and subsequently expanded to 170 rooms. It had a restaurant, nightclub, swimming pool and shopping arcade. Cathay Hotel was closed on 30 December 1970, with the 10 floors had been converted into office premises and the top floor occupied by the Cathay Organisation by July 1974. The building was refaced in 1978 with a new look by STS Leong. The original design was shadowed by the new facade. ### 1980-90s: Cineplex A S$6.4-million-extension was built next to the Cathay Building and was opened on 16 November 1990. The new extension housed The Picturehouse, a cinema showing [art films](/wiki/Art_film). Cathay Building was the location for the first [Orange Julius](/wiki/Orange_Julius) outlet in Singapore, which opened in 1982. In 1990, Cathay Organisation opened Singapore's first arthouse cinema, The Picturehouse adjacent to Cathay Building. The main Cathay cinema hall was also lost when it was subdivided into two smaller halls. ### 1999-present: Redevelopment In 1999, Cathay announced the S$100 million plans to redevelop the whole complex. Cathay Building and the Picturehouse would show its last movie in 2000 before closing for redevelopment. The building was nearly completely demolished, with only a small portion of the main facade, which had been covered up for decades, was revealed and preserved. This was the first demolished building to be gazetted as a [national monument](/wiki/National_Monuments_of_Singapore) on 10 February 2003 while it retains a significant heritage value. It is called \"A Site of Cathay Building that is demolished, is being gazetted as a national monument. Just only a few parts can be kept for heritage value\". The replacement building, designed by Paul Tange of Tange Associates Japan and RDC Architects Pte Ltd Singapore, was named [The Cathay](/wiki/The_Cathay); it opened on 24 March 2006. The Cathay houses retail, food and beverage outlets and an 8-screen Cathay Cineplex, which includes The Picturehouse. The building has suffered from low footfall since its opening. It had made multiple minor alterations, such as the removal of the atrium water feature, and the reconfiguring of the shop layouts. In June 2022, Cathay Cineplexes, which operated the cinema multiplex in The Cathay, announced that it would cease operations there, ending 83 years of operation on the site. A pop-up operator, \"Projector X: Picturehouse\" will operate in the cineplex space instead. In February 2023, the Cathay Organization announced that The Cathay would close for redevelopment in 2023, reopening in 2024, with all mall tenants having to move out by 18 August 2023. ## Cathay Residences The Cathay Residences, a condominium development occupying the tower above the shopping mall, opened at the end of 2006. - [Cathay Organisation](/wiki/Cathay_Organisation) - \"Singapore Infopedia: Cathay Building\". *[National Library Board](/wiki/National_Library_Board)*. Archived from the original on 20 February 2022. Retrieved 5 August 2007. - Official website of Cathay RecordsPreceded bynone **[Tallest building in Singapore](/wiki/List_of_tallest_buildings_in_Singapore)** 70 m (230 ft) 1939–1954Succeeded by[Asia Insurance Building](/wiki/Asia_Insurance_Building)\n",
  "language": "en",
  "processed_at": "2026-01-12T10:00:38.454494",
  "title": "Cathay Building",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Cathay_Building"
}