{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:00:42.265395"
  },
  "content": "Church in Singapore, SingaporeThis article includes a list of references, related reading, or external links, **but its sources remain unclear because it lacks inline citations**. Please help improve this article by introducing more precise citations. *(July 2009)* *(Learn how and when to remove this message)*Church in Singapore , Singapore The **Cathedral of the Good Shepherd** ([Chinese](/wiki/Chinese_language): 善牧主教座堂) is the oldest [Catholic](/wiki/Catholic_Church) church in [Singapore](/wiki/Singapore), built in 1847. It is located in the [Museum Planning Area](/wiki/Museum_Planning_Area) within the [Civic District](/wiki/Civic_District). Bounded by the parallel [Queen](/wiki/Queen_Street,_Singapore) and [Victoria Streets](/wiki/Victoria_Street,_Singapore), and [Bras Basah Road](/wiki/Bras_Basah_Road), the cathedral sits within shaded grounds. Much of its architecture is reminiscent of two famous London churches namely [St Paul's, Covent Garden](/wiki/St_Paul%27s,_Covent_Garden) and [St Martin-in-the-Fields](/wiki/St_Martin-in-the-Fields). The Cathedral of the Good Shepherd is the cathedral church of the [Archdiocese of Singapore](/wiki/Archdiocese_of_Singapore) and the seat of its [archbishop](/wiki/Archbishop). It is the final resting place of Bishop Edouard Gasnier, the first bishop of the revived Diocese of Malacca and aptly houses the [relics](/wiki/Relics) of [Saint Laurent-Marie-Joseph Imbert](/wiki/Saint_Laurent-Marie-Joseph_Imbert), to whom the owes its name. ## History ### Chapel In the beginning, the Catholic community in Singapore attended [Mass](/wiki/Mass_(liturgy)) at the house of [Denis Lesley McSwiney](/wiki/Denis_Lesley_McSwiney). In 1832, construction began on the first permanent Catholic house of worship in Singapore. Financed through public subscriptions, the chapel, completed by 1833, was a small wood and [attap](/wiki/Nypa_fruticans) structure measuring 60 feet long by 30 feet wide that had cost about 700 [Spanish dollars](/wiki/Spanish_dollars) to build. The chapel, with neither tower nor spire, was on the site of the [former Saint Joseph's Institution](/wiki/Former_Saint_Joseph%27s_Institution) buildings, now occupied by the [Singapore Art Museum](/wiki/Singapore_Art_Museum), and allotted by the Resident Councillor, [George Bonham](/wiki/George_Bonham) to Father Jean-Baptiste Boucho, a French missionary who had come from [Penang](/wiki/Penang). It was located in European Town, an area marked out in [Sir Stamford Raffles](/wiki/Sir_Stamford_Raffles)' 1822 town plan as a residential area for Europeans, Eurasians and wealthy Asians. ### Church of the Good Shepherd This section **needs expansion**. You can help by expanding it. *(December 2022)* In 1840, a subscription drive was started whereby [Queen Marie-Amélie Thérèse of France](/wiki/Maria_Amalia_of_the_Two_Sicilies) and the [Archbishop of Manila](/wiki/Archdiocese_of_Manila) contributed 4,000 [francs](/wiki/Francs) and about 3,000 Spanish dollars respectively. The Government Surveyor, [John Turnbull Thomson](/wiki/John_Turnbull_Thomson), had prepared the first design for the church, but it was considered too expensive to build and difficult to maintain. The design that was accepted was that by [Denis Lesley McSwiney](/wiki/Denis_Lesley_McSwiney), a design that was said to owe much to [George Drumgoole Coleman](/wiki/George_Drumgoole_Coleman)'s original [Saint Andrew's Church](/wiki/St_Andrew%27s_Cathedral,_Singapore). On 18 June 1843, the cornerstone for the church was [blessed](/wiki/Blessing_(Catholic_Church)) by Bishop [Jean-Paul-Hilaire-Michel Courvezy](/wiki/Jean-Paul_Courvezy), Vicar Apostolic of [Malacca](/wiki/Malacca)-Singapore, and was laid by John Connolly, a merchant. In 1847, a [steeple](/wiki/Steeple) was added. It was designed by [Charles Andrew Dyce](/wiki/Charles_Andrew_Dyce) who modelled it on John Turnbull Thomson's design for the steeple added to the Saint Andrew's Church. On 6 June 1847, the completed church was blessed and opened by Father [Jean-Marie Beurel](/wiki/Jean-Marie_Beurel). The total payments amounted to 18,355.22 Spanish dollars. ### Cathedral of the Good Shepherd In 1888, the church was elevated to the status of cathedral when the Diocese of Malacca was revived. Bishop Edouard Gasnier, the first bishop of the revived Diocese of Malacca died in 1896 and is interred in the cathedral. His successor, Bishop [René-Michel-Marie Fée](/wiki/Ren%C3%A9_Michel_Marie_F%C3%A9e), was the first bishop [consecrated](/wiki/Consecration) in the cathedral in 1896. Although the church was elevated to the status of cathedral in 1888, the consecration ceremony was performed only on 14 February 1897 when the cathedral had finally repaid its debts incurred from the extension of the nave in 1888. Improvements were gradually made to the cathedral. The dwarf wall, gate pillars, and ornamental cast iron gates and railings around the grounds were completed in 1908. The Gallery Organ was in place by 1912, while electric lighting came in 1913 and electric fans in 1914. During the invasion of Singapore during [World War II](/wiki/World_War_II), the cathedral was used as an emergency hospital. The Cathedral of the Good Shepherd was gazetted a [national monument](/wiki/National_Monuments_of_Singapore) on 28 June 1973. The cathedral went for a major structural restoration from 2013 to 2016 to address structural defects that resulted from new developments nearby. A new annexe building and basement to support the various functions of the cathedral were built. The restoration cost amounted to $42 million Singapore dollars. ### Rationale for name [Saint Laurent-Marie-Joseph Imbert](/wiki/Saint_Laurent-Marie-Joseph_Imbert), who died a [martyr](/wiki/Martyr) in [Korea](/wiki/Korea), was probably the first priest to visit Singapore. The [dedication](/wiki/Dedication_(ritual)) of the church to the Good Shepherd stems from the note written by Saint Laurent-Marie-Joseph Imbert to his fellow missionaries, Saints Pierre-Philibert Maubant and Jacques-Honoré Chastan, asking them to surrender to the Korean authorities to save their flocks from extermination during a period of Christian persecution in Korea. He had written, *In desperate circumstances, the good shepherd lays down his life for his sheep*. They did and the three of them were beheaded on 21 September 1839. News of this and their [martyrdom](/wiki/Martyrdom) reached Singapore at the time when an appropriate name was being considered for the church. The choice was made at the suggestion of Bishop Jean-Baptiste Boucho. ### Significant dates - 1833 – First permanent Catholic house of worship in Singapore blessed and opened. - 1843 – Foundation stone laid by John Connolly on the Feast of [Corpus Christi](/wiki/Corpus_Christi_(feast)). - 1847 – Church of the Good Shepherd blessed and opened by Father Jean-Marie Beurel. - 1859 – Original [Parochial](/wiki/Parish) House (now Archbishop's House) completed. - 1888 – Elevated to the status of cathedral when the Diocese of Malacca was revived. - 1888 – Extension of the nave at the west end completed. - 1897 – Consecration of the cathedral by Bishop René-Michel-Marie Fée. - 1909 – Dwarf wall, gate pillars, and ornamental cast iron gates and railings around the grounds completed. - 1911 – Second Parochial House (now Cathedral Rectory) designed by Father Charles-Benedict Nain completed. - 1912 – Gallery Organ dedicated by Bishop Marie-Luc-Alphonse-Emile Barillon. - 1913–1914 – Electric lights and fans introduced. - 1942 – Used as an emergency hospital during the invasion of Singapore. - 1973 – Gazetted a national monument. - 1983 – Sanctuary remodelled. - 1992 – Widening of Victoria Street causing the boundary of the grounds to be moved back. - 1994 – Choir Organ built by Robert Navaratnam. - 1997–1999 – Major restoration. - 2013–2016 – Second major restoration. - 2017 – Rededicated on 14 February 120 years after the original consecration in 1897. ### Time capsule In early 2016, beneath the cathedral's foundation stone, a shoebox-sized time capsule from 18 June 1843, was discovered and was found to include a prayer booklet and newspapers, and international coins. The capsule is thought to have been buried by French Catholic missionary priests and other founding communities of Singapore. ## Architecture The Cathedral of the Good Shepherd is built in a restrained [Renaissance](/wiki/Renaissance_architecture) style. Its [porticos](/wiki/Portico) are in the [Palladian](/wiki/Palladian) manner, which was established here by George Drumgoole Coleman. Its plan is in the form of a [Latin cross](/wiki/Latin_cross) and like all traditional churches, it is orientated east. ### Steeple The steeple, surmounted by a cross, consists of two sections. The first section is a square with each corner of the square marked by three [engaged columns](/wiki/Engaged_column) in the [Ionic order](/wiki/Ionic_order). On each façade is an arched window. The four façades are topped with [pediments](/wiki/Pediment) ornamented with a circle. The cathedral's three bells are located inside this section and are decorated with religious motifs. Cast by the Crouzet-Hildebrand Foundry in Paris, the bells were originally hung for swing chiming, but electric tolling hammers have since replaced the long ropes for stationary chiming. During the 2016 restoration, following the stabilization and reinforcing of the tower's structure, the bells were re-hung for swing chiming with an electric motor. On the second section of the steeple is an octagon with each corner of the octagon marked by an engaged column in the [Tuscan order](/wiki/Tuscan_order). On each façade is a narrow rectangular window. The eight façades are topped with pediments. ### Entrances There are six entrances into the cathedral with the one fronting Victoria Street closed to public access. The entrances are porticoed and have heavily moulded pediments. All pediments are ornamented with a moulded circle at the centre and, except for the ones at the ends of the [transept](/wiki/Transept) and the one fronting Victoria Street, all are surmounted with a cross. The main entrance at the west end of the cathedral serves as the [porte-cochère](/wiki/Porte-coch%C3%A8re). The two side entrances at the [nave](/wiki/Nave) are in the form of diminutive porticos and are smaller and less imposing than the entrances at the ends of the transept. At the main entrance are three doors. Apart from the main entrance, all other entrances, except for the one fronting Victoria Street, have only one door. The entrance fronting Victoria Street had three doors initially until the walling up of the centre door. All doors are double-leaf, of timber construct and, except for the two fronting Victoria Street, all are panelled. While the doors of the two side entrances at the nave are double the height of the doors found at the ends of the transept, these four doors have each a stained-glass window over them. Over the centre door is a statue of the Good Shepherd in a niche, with an inscription over it that reads *I am the Good Shepherd*. Over each of the two doors flanking the centre door is an arched window. ### Nave The nave is a [simple hall without aisles](/wiki/Aisleless_church). There are two transepts, also without aisles, and these are screened off by two doric columns on each side. Upon entering the cathedral through the centre door at the [narthex](/wiki/Narthex), one will see the statues of [Saint Anthony of Padua](/wiki/Saint_Anthony_of_Padua) and [Saint Francis Xavier](/wiki/Saint_Francis_Xavier), the four cast iron [Composite](/wiki/Composite_order) columns supporting the gallery, and the two cast iron spiral staircases leading to the gallery. To the left sits a statue of the [Pietà](/wiki/Piet%C3%A0) and a statue of [Saint Joseph](/wiki/Saint_Joseph) stands at the other end. The eight large windows at the nave together with the other six at the transept and two at the [sacristy](/wiki/Sacristy) are arched. There were originally eight large windows at the transept until the walling up of the two fronting Victoria Street. The original timber louvred casements of the windows were replaced by glass shutters with green glass in 1937. The stained glass windows in the lunettes of the nave and transept windows were presented to the cathedral by Bishop Charles Arsène Bourdon. The timber ceiling is in a concave form and is made up of three rows of six rectangular panels. All eighteen panels are rather simply ornamented, with a simple rectangular border and a ceiling rose at their centres. The ceiling roses in the centre row are larger and more elaborate than those in the side rows. From the centre of each circle hangs a lamp. The ceiling edge ends in deeply moulded plaster cornice that runs along the length of the cathedral. As the height of the east end has been raised at different times, the dimensions of the entablature no longer relate to the columns properly, as their bases have been raised. The cathedral was once lit with Victorian crystal chandeliers, but these have since been replaced with simpler lamps. There are two [confessionals](/wiki/Confession_(religion)) to the left and right side of the nave and they are topped with pediments ornamented with a circle and cross at the centre. The set of fourteen oil paintings on the walls of the nave depict the [Way of the Cross](/wiki/Stations_of_the_Cross). At the [crossing](/wiki/Crossing_(architecture)) is the final resting place of Bishop Edouard Gasnier, the first bishop of the revived Diocese of Malacca. ### Gallery The gallery, which is closed to public access, houses the Gallery Organ and an audio-visual control room. ### Sanctuary On the wall of the sanctuary is a [crucifix](/wiki/Crucifix), It is framed by a pediment and four [pilasters](/wiki/Pilaster) – two pilasters on a [pedestal](/wiki/Pedestal) on either side of it. This reredos is not original, and was installed sometime in the 1960s, and is typical of the period, using standard glass mosaic tiles to create a 'starburst' background to the crucifix, as a replacement for the original high altar arrangement that was removed following the [Second Vatican Council](/wiki/Second_Vatican_Council). At one point, the cathedra was moved to this spot where the high altar once stood, with the altar being moved forward as a free-standing 'communion table' style altar to allow *versus populum* celebration of the Mass. Following the most recent restoration, the traditional placement of the cathedra, to one side of the altar, has been reinstated. However, the decision was made to retain the 1960s reredos instead of reinstating the original high altar. However, the tabernacle was returned to its rightful place at the centre of the church, and a new retable was built for it. On either side of the main altar are doors that lead to the sacristy. A new altar table was also installed, of white marble and a more sympathetic design than the previous one, with a roundel containing a depiction of the Agnus Dei at its centre. There were once niches over the doors (which were also round-headed to match the windows) on either side and in the centre that held statues, but they were filled in and plastered over at the time the reredos was replaced. Today the doors are of a more conventional rectangular shape, and where the niches once were is now blank wall that serves as projector screen. The four crosses engraved on marble slabs in the sanctuary together with the other eight in the nave make up the twelve [consecration crosses](/wiki/Consecration_crosses) put in place on the interior walls around the cathedral for its consecration in 1897. They may never be removed and are proof, in the absence of documents, that a church has been consecrated. ### North transept In the north transept stands a statue of [Our Mother of Good Counsel](/wiki/Our_Lady_of_Good_Counsel) in a niche topped by a pediment and flanked by two pilasters – each pilaster on a pedestal on either side of it. The north transept is where the [baptistery](/wiki/Baptistery) is located. The statue of Our Mother of Good Counsel and the stained-glass window over the door hints to its previous designation as the Chapel of the [Blessed Virgin Mary](/wiki/Blessed_Virgin_Mary). On the walls are memorial plaques to early personalities of the church, notably, John Connolly and Bishop Michel-Esther Le Turdu. The relics of Saint Laurent-Marie-Joseph Imbert can be found enshrined in the wall at the right side of the door. ### South transept In the south transept stood the [tabernacle](/wiki/Church_tabernacle) in a niche topped by a pediment and flanked by two pilasters – each pilaster on a pedestal on either side of it. This was the [Blessed Sacrament](/wiki/Blessed_Sacrament) Chapel. It takes the place of what was originally the Chapel of Saint Joseph. On the wall to the left of the tabernacle is a memorial plaque to Father Jean-Marie Beurel. The 2016 restoration saw the return of the Chapel of Saint Joseph to the cathedral main building. A statue of Saint Joseph, a match of the Our Mother of Good Counsel statue at the Lady Chapel was returned to the mentioned chapel. A new tabernacle was installed at the centre of the sanctuary. ### Grounds Outside on the grounds of the cathedral near the main entrance was a bronze life-size statue of [Pope John Paul II](/wiki/Pope_John_Paul_II), the Glorious Cross of 7.38 meters and a statue of the Virgin Mary. A statue of the Good Shepherd stands opposite the entrance at the south transept. After the 2016 restoration, the statue of the [Virgin Mary](/wiki/Mary,_mother_of_Jesus) and [John Paul II](/wiki/Pope_John_Paul_II) statues were reinstalled in their original place. A new, contemporary crucifix is installed at the north transept entrance. A statue of the [Homeless Jesus](/wiki/Homeless_Jesus) by [Timothy Schmaltz](/wiki/Timothy_Schmalz) is installed at the west end of the compound. The Good Shepherd statue has been moved to the crypt at the new basement. ### Other buildings Apart from the cathedral itself, there are five other buildings within the grounds of the cathedral: - The Archbishop's House is a simple, unadorned nineteenth-century two-storey [bungalow](/wiki/Bungalow) with a projecting portico. Its [verandahs](/wiki/Verandah) were previously unenclosed. - The Resident's Quarters is a U-shaped single-storey building with handsome Tuscan columns rising from the ground. - The Cathedral [Rectory](/wiki/Rectory) is an ornate early twentieth century two-storey rusticated bungalow with decorative plasterwork. There is a covered linkway to a rectangular single-storey building at its rear. - The [Jean-Marie Beurel](/wiki/Jean-Marie_Beurel) Centre is a newly built 4-storeys building to support the ministries works of the cathedral. The building is connected to the new basement with a covered linkway. - A newly constructed basement that houses a function hall, crypt and a perpetual Adoration Chapel. ## Music ### Choirs The cathedral is home to several choirs which sing the weekend Masses, feasts, solemnities, and days of obligation. - The Cathedral Children's Choir (2019) sings the Saturday 6:00 pm Masses throughout the year. Directed by organist Angela Lim, the choir accepts children between the ages of 6 and 16 who sing a range of repertoire from plainchant to traditional and contemporary hymnody. Throughout the Covid-19 pandemic, the children's choir produced weekly music recordings for the Archdiocesan Masses for Families with Children which was broadcast on the Archdiocesan YouTube channel every Sunday morning. They also participate in carol services, concerts, and feasts and solemnities throughout the year. - The Cathedral Family Mass Choir (2016) sings the Sunday 8:30am Mass. Comprising students and young adults who have a passion for music, the choir includes familiar hymns, both classical and contemporary, in its repertoire so the congregation may participate in the singing and the members have fun in learning new music. - The Cathedral Choir of the Risen Christ was founded in 1970 and sings at the Sunday 10:30 am Mass. Directed by Peter Low, the mixed-voice choir has around 70 members comprising both students and working professionals. The choir served at the [Church of the Risen Christ](/wiki/Church_of_the_Risen_Christ) for 32 years before moving to the cathedral on 14 April 2002. It has performed at the Vatican before Pope John Paul II, in Bethlehem at the invitation of Israel's Tourism Ministry, and, since 2002, also hosts a yearly concert attended by delegates and diplomats from the world over. - The Cathedral Choir of Saint Gregory the Great (2016) is a mixed-voice all-volunteer choir that sings the Sunday 6:00 pm Masses, including feasts and solemnities, throughout the year. Directed by cathedral organist Alphonsus Chern, the choir sings the Mass employing a variety of plainchant, polyphony, traditional and contemporary hymnody. During the Covid-19 pandemic, the choir sang the weekly Archbishop's Sunday Livestream Masses celebrated by [Cardinal William Goh](/wiki/William_Goh) and other priests. It also supports the cathedral community through prayer and outreach activities such as hymn festivals, carol services, and pipe organ tours. During the Catholic200SG celebrations, the choir opened and closed the festivities with the concerts Christmas Ignite 2020 and Christmas Ignite 2021, and also presented the hymn festival Hymns & Praise 200. ### Organs The Cathedral of the Good Shepherd is home to a 30-stop Bevington & Sons organ – the oldest working pipe organ in Singapore and the only pipe organ in the Catholic Church in Singapore. While the cathedral formerly housed two pipe organs – the Gallery Organ (Bevington) in the West gallery and the Choir Organ (Navaratnam) in an elevated platform in the north transept, the Choir Organ was dismantled and its pipe work absorbed into the Chapel Organ at the Orchard Road Presbyterian Church during the 2016 restoration of the cathedral. Dedicated on 20 October 1912 by Bishop Emile Barillon, the Gallery Organ is a two-manual and pedal [Bevington & Sons](/wiki/Bevington_%26_Sons) instrument which cost 5894.61 [sterling pounds](/wiki/Pound_sterling) to build, ship and install. The organ currently incorporates pipework from various now-defunct organs, notably the Bombarde 16' in the pedal division from the former St. Clair Organ that once resided in the Victoria Concert Hall, and a Cornopean 8' in the Swell, of uncertain American heritage. The Gallery Organ was once easily recognised by its unusual asymmetric façade – only the central organ case is original, the left and right wings added by Robert Navaratnam, a local organ builder. The action, once electropneumatic, was converted to direct-electric by Navaratnam. In the latest rebuilding of the organ, a new tracker action was built to replace the electric action. It is currently the oldest playable organ in Singapore and is regularly used for Masses, concerts, recordings, and organ tours. In 2005, Lin Yangchen published an article titled *Singapore's Answer to Notre Dame de Paris* in *The Organ* describing both cathedral organs in detail (The Organ 334:8–10). He describes the unique situation presented by having separate organs in the same building, which makes possible a dialogue between the Gallery and Choir Organs. In fact, this did happen during solemn occasions and when two organists were present. The choir and congregation were then accompanied separately, although this is no longer possible now that there is only one organ in the cathedral. In 2018, Andre Theng published a booklet dedicated to the history of the organ. Titled *Saving The King*, this book details the history and journey of the Bevington organ from its original installation to its current iteration. This book is available for sale outside the West Doors of the cathedral after the weekend Masses. Sketches of information on the older organ are available mostly through personal accounts. An elderly parishioner recounted helping out on Sundays as a young boy by operating the manual [air pump](/wiki/Air_pump) of the organ. By the 1960s, the Gallery Organ became so dilapidated that it remained silent for nearly two decades. Hugo Loos, a Belgian engineer then based in Singapore, volunteered his services as both organist and repairman. Driven by his passion and love for pipe organs, he was able to render minor repairs, but much work was still required. Towards the end of 1983, the then [rector](/wiki/Rector_(ecclesiastical)) of the cathedral, Father Robert Balhetchet, was introduced to Robert Navaratnam, an organ builder who had been trained in Germany. Navaratnam spent the next few decades caring for and expanding the instrument by adding ranks of pipes where they became available. He continues to look after the organ, tuning it on a regular basis. On 16 December 1984, a concert was organised in conjunction with the rededication of the Gallery Organ. Dr Margaret Chen, curator of the Klais Organ at the [Victoria Concert Hall](/wiki/Victoria_Concert_Hall) and a well-known Singaporean organist, was one of the performers. Full-length organ recitals at the cathedral are rare, the last two having been played on the Gallery Organ by Markus Grohmann, a visiting German organist in August 2005, and Arthur Lamirande of New York in 2007. During the 2013–16 restoration and renovation of the cathedral, the Bevington was rebuilt by Diego Cera of the Philippines. The organ was dismantled and shipped to the Philippines while the cathedral was closed. A new console and a new tracker action was built, while the original organ case was refurbished and extended symmetrically on both sides to incorporate an enlarged Pedal division. The previously asymmetrical façade is no longer a feature, as all the pipe work was re-organised into the new case. The organ is playable from a remote console located in the south transept. This remote console also controls an electronic pipe organ whose speakers were installed in the south transept in early-2020. The cherubs and [Saint Caecilia](/wiki/Saint_Cecilia) statue in the organ gallery were not reinstalled after the restoration. **The Cathedral Organ Scholar Programme** The Organ Scholar Programme was founded by the cathedral organist Alphonsus Chern in 2016 with the support of the late Edwin Lee, BBM, obl. CSsR. The scholarship supports the training of several organists, who also serve in various roles in the cathedral choirs as part of their formation as liturgical musicians. The scholars record music for the cathedral's YouTube channel and regularly host guided tours of the Bevington organ for children, visiting church groups, visiting dignitaries, and the public. The scholars play the organ at both the weekday and weekend Masses, and at devotions. Most recently, the scholars hosted pipe organ demonstrations in conjunction with the Singapore Night Festival 2022. ## Ecclesiastical status The Catholic Church in Singapore was initially under the jurisdiction of the Diocese of Malacca erected in 1558. She was transferred to the [Vicariate Apostolic of Ava and Pegu](/wiki/Apostolic_Vicariate_of_Burma) in 1838 and then the [Vicariate Apostolic of Siam](/wiki/Archdiocese_of_Bangkok#History) in 1840. In 1841, the Catholic Church in Singapore was placed under the jurisdiction of the Vicariate Apostolic of Western Siam that was erected from the Vicariate Apostolic of Siam. Initially called the Vicariate Apostolic of Western Siam, the name was changed to the Vicariate Apostolic of the Malay Peninsula and finally the Vicariate Apostolic of Malacca-Singapore. - Vicariate Apostolic of Malacca-Singapore - (1841–1844) Bishop Jean-Paul-Hilaire-Michel Courvezy *(Vicar Apostolic of Siam from 1834 to 1841)* - (1845–1871) Bishop Jean-Baptiste Boucho - (1871–1877) Bishop Michel-Esther Le Turdu - (1878–1888) Bishop Edouard Gasnier - Diocese of Malacca - (1888–1896) Bishop Edouard Gasnier - (1896–1904) Bishop René-Michel-Marie Fée - (1904–1933) Bishop [Marie-Luc-Alphonse-Emile Barillon](/wiki/%C3%89mile_Barillon) - (1934–1945) Bishop Adrien Pierre Devals - (1947–1953) Bishop [Michel Olçomendy](/wiki/Michel_Ol%C3%A7omendy) - Archdiocese of Malacca - (1953–1955) Archbishop Michel Olçomendy - [Archdiocese of Malacca-Singapore](/wiki/Archdiocese_of_Malacca-Singapore) (Metropolitan See) - (1955–1972) Archbishop Michel Olçomendy - Archdiocese of Singapore - (1972–1976) Archbishop Michel Olçomendy - (1977–2000) Archbishop [Gregory Yong](/wiki/Gregory_Yong) - (2001–2013) Archbishop [Nicholas Chia](/wiki/Nicholas_Chia) - (2013–present) Cardinal [William Goh](/wiki/William_Goh) ## Organisation The Cathedral of the Good Shepherd is currently under the administration of four priests of the Archdiocese of Singapore : - Rev Fr Jude David (Rector) - Rt Rev Msgr Francis Lau (Vice Rector) - Rev Fr Samuel Lim (Vice Rector) - Rev Fr Xavier Nathanial (Vice-Rector) The Cathedral of the Good Shepherd currently also has these following organisations : - [Altar servers](/wiki/Altar_server) (Cathedral of the Good Shepherd Altar Servers Ministry) - The Cathedral Choirs - The Cathedral Organ Scholars - [Extraordinary Ministers of Holy Communion](/wiki/Extraordinary_Ministers_of_Holy_Communion) - Cathedral Wardens Ministry - Lectors - Cantors - RCIA - Working Adult Group Ministry ## Gallery - [Saint Laurent-Marie-Joseph Imbert](/wiki/Saint_Laurent-Marie-Joseph_Imbert) - [Denis Lesley McSwiney](/wiki/Denis_Lesley_McSwiney) - [Charles Andrew Dyce](/wiki/Charles_Andrew_Dyce) - [Archbishop Emeritus Gregory Yong Sooi Ngean](/wiki/Gregory_Yong) - [Archbishop Nicholas Chia Yeck Joo](/wiki/Nicholas_Chia) - [Archdiocese of Singapore](/wiki/Archdiocese_of_Singapore) - [Catholic Church in Singapore](/wiki/Catholic_Church_in_Singapore) - [Catholic education in Singapore](/wiki/Catholic_education_in_Singapore) - Norman Edwards, Peter Keys (1988), *Singapore – A Guide to Buildings, Streets, Places*, Times Books International, [ISBN](/wiki/ISBN_(identifier)) 9971-65-231-5 - Gretchen Liu (1996), *In Granite and Chunam – The National Monuments of Singapore*, Landmark Books, [ISBN](/wiki/ISBN_(identifier)) 981-3065-03-6 - Lee Geok Boi (2002), *Faiths of Our Forefathers – The Religious Monuments of Singapore*, Landmark Books, [ISBN](/wiki/ISBN_(identifier)) 981-3065-62-1 - Eugene Wijeysingha (2006), *Going Forth... – The Catholic Church in Singapore 1819–2004*, Titular Roman Catholic Archbishop of Singapore, [ISBN](/wiki/ISBN_(identifier)) 981-05-5703-5 - Official Website of the Cathedral of the Good Shepherd - Singapore Catholic Church Directory\n",
  "language": "en",
  "processed_at": "2026-01-12T10:00:42.264643",
  "title": "Cathedral of the Good Shepherd",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Cathedral_of_the_Good_Shepherd"
}