{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:59:31.725440"
  },
  "content": "Asian Healthcare investment firm **CBC Group** (CBC; [Chinese](/wiki/Chinese_language): 康桥资本; [pinyin](/wiki/Pinyin): *Kāngqiáo Zīběn*) is an Asian investment firm headquartered in [Singapore](/wiki/Singapore). It is focused on private investments in the [healthcare](/wiki/Healthcare) and [biotechnology](/wiki/Biotechnology) industries. It is considered the largest healthcare-focused investment firm in Asia. ## Background The firm was founded in 2014 as C-Bridge Capital in [Shanghai](/wiki/Shanghai) with a focus on [private equity](/wiki/Private_equity) investments in China's healthcare sector. The firm was partially backed by [Temasek Holdings](/wiki/Temasek_Holdings). C-Bridge Capital would later be rebranded to CBC Group and moved its headquarters to Singapore. CBC primarily invests in late stage companies that already have commercially proven projects which have passed [clinical trials](/wiki/Clinical_trial). However it has also funded healthcare [Startup Companies](/wiki/Startup_Companies) with its initial strategy of just making minority investments to later taking a [business incubator](/wiki/Business_incubator) approach. Historically the firm has invested primarily in China, Singapore, Taiwan and Hong kong but has also invested in US-based companies that planned to expand in Asia. CBC would often pursue a strategy of backing companies that already have approved products in developed markets and bring them to China. In February 2020, CBC launched its first [Private credit](/wiki/Private_credit) fund, R-Bridge Healthcare Fund which raised $300 million. On 9 June 2021, Summit Healthcare Acquisition a [special-purpose acquisition company](/wiki/Special-purpose_acquisition_company) backed by CBC was listed on the [Nasdaq](/wiki/Nasdaq) raising $200 million. In November 2021, CBC launched its [Infrastructure fund](/wiki/Infrastructure_fund) that would invest in infrastructure projects related to life science companies in China. [APG](/wiki/APG_(pension_fund)) provided $400 million in seed capital with the hard cap being $1.5 billion. Notable deals of CBC include partnering with [Mubadala Investment Company](/wiki/Mubadala_Investment_Company) to acquire [UCB](/wiki/UCB_(company))'s mature business in China for $680 million. CBC is headquartered in Singapore with additional offices Shanghai, Beijing, Hong Kong, New York and Seoul. In 2024, CBC Group Acquired [UCB](/wiki/UCB_(company))’s Mature Neurology & Allergy Business in China. - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T09:59:31.724995",
  "title": "CBC Group",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/CBC_Group"
}