{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:00:47.911423"
  },
  "content": "British Army general [Lieutenant General](/wiki/Lieutenant-general_(United_Kingdom)) **Sir Cedric Norman George Delves**, [KBE](/wiki/Knight_Commander_of_the_Order_of_the_British_Empire), [DSO](/wiki/Distinguished_Service_Order) (born 1 March 1947) is a retired [British Army](/wiki/British_Army) officer and a former commander of the [22nd Special Air Service Regiment](/wiki/Special_Air_Service). ## Military career Delves was [commissioned](/wiki/Officer_(armed_forces)) from the [Royal Military Academy Sandhurst](/wiki/Royal_Military_Academy_Sandhurst) into the [Devonshire and Dorset Regiment](/wiki/Devonshire_and_Dorset_Regiment) of the Prince of Wales's Division on 2 August 1968, and promoted [lieutenant](/wiki/Lieutenant) on 2 February 1970. Having been promoted to [captain](/wiki/Captain_(British_Army_and_Royal_Marines)) on 2 August 1974, he passed selection for the [Special Air Service](/wiki/Special_Air_Service) (SAS) and undertook tours in [Northern Ireland](/wiki/Northern_Ireland) for which he was [Mentioned in Despatches](/wiki/Mentioned_in_Despatches) in December 1979 for services between 1 May and 31 July 1979 and again in December 1981 for services between 1 May and 31 July 1981. Still serving with the [Devonshire and Dorset Regiment](/wiki/Devonshire_and_Dorset_Regiment), he was promoted [major](/wiki/Major_(rank)) on 30 September 1980. ### Falklands War Delves distinguished himself on 21 April 1982 when, as [Officer Commanding](/wiki/Officer_Commanding) D Squadron [22nd Special Air Service Regiment](/wiki/Special_Air_Service), he captured [Grytviken](/wiki/Grytviken) on [South Georgia](/wiki/South_Georgia_Island) without loss of life. He followed this up on 15 May when his squadron destroyed eleven [Argentine](/wiki/Argentina) aircraft at [Pebble Island](/wiki/Pebble_Island) (the [Raid on Pebble Island](/wiki/Raid_on_Pebble_Island)), on 21 May when he led a deceptive raid on [Darwin](/wiki/Darwin,_Falkland_Islands), and again on 31 May at [Mount Kent](/wiki/Mount_Kent) in the [Falkland Islands](/wiki/Falkland_Islands) where he took his squadron 40 miles behind enemy lines and secured a firm hold on the area allowing conventional forces to be brought in. For his leadership during these operations, Delves was awarded the [Distinguished Service Order](/wiki/Distinguished_Service_Order). His citation, published in the *[London Gazette](/wiki/London_Gazette)*, reads: > Major Delves commanded D Squadron Special Air Service Regiment during a brilliantly successful series of operations carried out in South Georgia and the Falkland Islands. Both operations proved to be critically important to the conduct of the two campaigns. In South Georgia, his soldiers had to operate in extremes of climate which bordered on the limits of survivability. In spite of the difficulties, Major Delves was able to insert the necessary surveillance patrols into his area of responsibility overlooking Stromness Bay. This was achieved in spite of one of his patrols becoming involved in two helicopter crashes, and another losing half its strength when it was scattered into the night by 100 mph katabatic winds. On 21st April after the engagement of the enemy submarine SANTA FE, Major Delves led his men into the Cumberland Bay East and captured Grytviken employing two of his SAS troops. By his quick decisive action and personal display of courage, he was able to accomplish the fall of Grytviken without a single loss of life. The next day he ordered his remaining troop to go ashore in Stromness Bay and accept the surrender of the remaining enemy forces in South Georgia. On the early morning of 15th May, Major Delves led his men in delivering a devastating blow to the enemy air capability on Pebble Island in the Falkland Islands. In a daring and well executed series of moves—described as a classic of its time—in which he was able to determine the layout of the enemy positions, he infiltrated the enemy defences and by skilful use of his own men and Naval gunfire, he and his men destroyed eleven aircraft on the ground and over a ton of explosive. On 21st May only hours after his Squadron had received a most cruel blow when it lost a significant proportion of its number in a helicopter crash, Major Delves led his men out once again in order to carry out a deceptive raid onto the enemy position at Darwin. So successful was he in his aim of drawing off the enemy reserves from the real landing position, that the enemy were heard to inform their higher HQ that they were under attack from at least a battalion of men. Following the successful establishment of the beachhead in San Carlos Water, Major Delves took his Squadron 40 miles behind the enemy lines and established a position overlooking the main enemy stronghold in Port Stanley where at least 7,000 troops were known to be based. By a series of swift operations, skilful concealment and lightning attacks against patrols sent out to find him, he was able to secure a sufficiently firm hold on the area after ten days for the conventional forces to be brought in. This imaginative operation behind the enemy lines provided our forces with psychological and military domination over the enemy from which it never recovered. In all the operations described, Major Delves led his men, coolly directing operations when under intensive fire from the enemy. He was an inspiration to his men, and made a unique contribution to the overall success of operations in South Georgia and the Falkland Islands. ### Later career Serving with the [Devonshire and Dorset Regiment](/wiki/Devonshire_and_Dorset_Regiment), Delves was promoted to [lieutenant colonel](/wiki/Lieutenant_colonel) on 30 June 1986. He succeeded Lieutenant Colonel [Andrew Massey](/wiki/Andrew_Massey_(British_Army_officer)) as commander of the 22nd Special Air Service Regiment, during [Operation Flavius](/wiki/Operation_Flavius), which resulted in the death of three [Provisional Irish Republican Army](/wiki/Provisional_Irish_Republican_Army) volunteers in Gibraltar. Appointed an [Officer of the Order of the British Empire](/wiki/Officer_of_the_Order_of_the_British_Empire) on 15 June 1990, Delves was promoted to [colonel](/wiki/Colonel_(United_Kingdom)) fifteen days later, and was promoted to [brigadier](/wiki/Brigadier_(United_Kingdom)) on 31 December 1990. In 1993, Delves was appointed [Director Special Forces](/wiki/Director_Special_Forces) and, by December 1995, he was leading [Special Operations](/wiki/Special_Operations) in [Bosnia](/wiki/Bosnia) as Commander of the Combined Joint Special Operations Task Force (CJSOTF), a component of the [Implementation Force](/wiki/Implementation_Force) (IFOR). Delves was appointed [General Officer Commanding](/wiki/General_Officer_Commanding) [3rd (UK) Division](/wiki/3rd_Mechanised_Division_(United_Kingdom)) and promoted [major general](/wiki/Major_general) on 5 July 1996, in which role he was deployed to [Bosnia](/wiki/Bosnia) in January 1998 as Commander of [Multi-National Division (South-West)](/wiki/Multi-National_Division_(South-West)_(Bosnia)). He was appointed a [Commander of the Order of the British Empire](/wiki/Commander_of_the_Order_of_the_British_Empire) on 31 December 1996, and awarded a [Queen's Commendation for Valuable Service](/wiki/Queen%27s_Commendation_for_Valuable_Service) on 7 May 1999 for his service in former Yugoslavia between 22 June and 30 September 1998. By 1999 Delves was Chief of Joint Forces Operational Readiness and Training. He became Deputy [Commander-in-Chief](/wiki/Commander-in-Chief) at [Land Command](/wiki/HQ_Land_Forces) (subsequently retitled 'Commander Field Army') in the rank of [lieutenant general](/wiki/Lieutenant-general_(United_Kingdom)) in December 2000. On 1 April 2001, Delves was appointed Colonel Commandant of the [Small Arms School Corps](/wiki/Small_Arms_School_Corps). Delves was appointed the British representative to [United States Central Command](/wiki/United_States_Central_Command) in [Tampa, Florida](/wiki/Tampa,_Florida) for the [War in Afghanistan](/wiki/War_in_Afghanistan_(2001%E2%80%93present)) on 17 January 2002. While at Central Command, American General [Tommy Franks](/wiki/Tommy_Franks) oversaw the military effort against [al-Qaeda](/wiki/Al-Qaeda) in [Afghanistan](/wiki/Afghanistan). Delves had succeeded Air Marshal [Jock Stirrup](/wiki/Jock_Stirrup) as focus changed from air operations to a campaign conducted largely by special forces on the ground. This appointment was just prior to the [Invasion of Iraq](/wiki/2003_invasion_of_Iraq), and Delves went on to be Deputy Commander at [NATO](/wiki/NATO) HQ [Allied Forces North](/wiki/Joint_Force_Command_Brunssum) at [Brunssum](/wiki/Brunssum) in September 2003. On 31 December 2002 he was appointed Colonel of the [Devonshire and Dorset Regiment](/wiki/Devonshire_and_Dorset_Regiment). He was knighted as a [Knight Commander of the Order of the British Empire](/wiki/Knight_Commander_of_the_Order_of_the_British_Empire) in June 2003 and, on 1 October, was succeeded as Colonel Commandant of the [Small Arms School Corps](/wiki/Small_Arms_School_Corps) by Lieutenant General [Sir Redmond Watt](/wiki/Redmond_Watt), Delves having been appointed Deputy Commander-in-Chief Regional Headquarters Allied Forces North Europe on 30 September 2003. In December 2003, Delves lost a leg when he was crushed against a wall by a drunk driver in [Maastricht](/wiki/Maastricht) in the [Netherlands](/wiki/Netherlands). He retired due to disability on 17 March 2005 and relinquished the appointment of Colonel of the [Devonshire and Dorset Regiment](/wiki/Devonshire_and_Dorset_Regiment) on 1 February 2007 on formation of [The Rifles](/wiki/The_Rifles). ## Post-retirement In retirement, Delves became a Director of *Olive Group*, a security business. In April 2006 he was appointed to oversee intelligence operations with the [Serious Organised Crime Agency](/wiki/Serious_Organised_Crime_Agency) (SOCA) during the time of the merger of investigative services of the Customs and Police. He became [Lieutenant of the Tower of London](/wiki/Lieutenant_of_the_Tower_of_London) in March 2007, and was succeeded by [Lieutenant-General](/wiki/Lieutenant-general_(United_Kingdom)) [Peter Pearson](/wiki/Peter_Pearson_(British_Army_officer)) on 4 May 2010. Delves joined the Board of Trustees of [BLESMA](/wiki/BLESMA) in 2009 and was elected National Chairman in 2010. Delves is also an accomplished photographer and regularly wins competitions. ## Family Delves is married to Suzy. Military officesPreceded by[Jeremy Phipps](/wiki/Jeremy_Phipps) **[Director Special Forces](/wiki/Director_Special_Forces)** 1993–1996Succeeded by[John Sutherell](/wiki/John_Sutherell)Preceded by[Mike Jackson](/wiki/Mike_Jackson_(British_Army_officer)) **[GOC 3rd (UK) Division](/wiki/3rd_(United_Kingdom)_Division)** 1996–1999Succeeded by[Richard Dannatt](/wiki/Richard_Dannatt,_Baron_Dannatt)Preceded by[Andrew Pringle](/wiki/Andrew_Pringle_(British_Army_officer)) **Commander [Multi-National Division (South-West), Bosnia](/wiki/Multi-National_Division_(South-West)_(Bosnia))** January–August 1998Succeeded by[Redmond Watt](/wiki/Redmond_Watt)Preceded by[Sir Jack Deverell](/wiki/Jack_Deverell) **[Commander Field Army](/wiki/Deputy_Commander_Land_Forces_(United_Kingdom))** 2001–2003Succeeded by[Sir Redmond Watt](/wiki/Redmond_Watt)\n",
  "language": "en",
  "processed_at": "2026-01-12T10:00:47.910876",
  "title": "Cedric Delves",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Cedric_Delves"
}