{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:00:49.096653"
  },
  "content": "This article **reads like a press release or a news article and may be largely based on routine coverage**. Please help improve it by adding independent secondary sources. *(July 2017)* *(Learn how and when to remove this message)*This article **relies largely or entirely on a single source**. Relevant discussion may be found on the talk page. Please help improve this article by introducing citations to additional sources. *Find sources:* \"CellResearch Corporation\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(June 2017)* **CellResearch Corporation** is a biotechnology company with a primary focus on skin cell and cord lining [stem cell](/wiki/Stem_cell) research. CellResearch has one of the world's largest private skin-, scar-, and keloid-cell libraries which have been used for research by cell culture laboratories worldwide, including those at [Harvard University](/wiki/Harvard_University), [Procter & Gamble](/wiki/Procter_%26_Gamble) and [Johnson & Johnson](/wiki/Johnson_%26_Johnson). It owns 39 [patents](/wiki/Patent) worldwide with intellectual property for the isolation of stem cells from the [umbilical cord lining](/wiki/Cord_lining) membrane of all mammals, which also includes the banking and cultivation of these cells, as well as the therapeutic applications of these cells. The firm was founded in 2002 by Phan Toan Thang, Ivor Lim and Gavin Tan and originally sold skin cell samples for research. In 2014, it was reported that the company was worth $640 million. ## Operations In 2004, Phan found two unique kinds of stem cells from the outer lining membrane of the umbilical cord. The umbilical cord lining can yield 6 billion epithelial and 6 billion [mesenchymal stem cells](/wiki/Mesenchymal_stem_cell) from a primary explant in one generation. In comparison, the bone marrow produces a few million mesenchymal stem cells per bone marrow aspiration. Initial studies focused on wound healing. In 2015, the firm began developing current [Good Manufacturing Practice](/wiki/Good_manufacturing_practice) (cGMP) grade cord lining mesenchymal stem cells, which could be used for human transplantation. The stem cell product, called CorLiCyte, was approved for a [USFDA](/wiki/Food_and_Drug_Administration) trial to heal diabetic wounds, to be completed around 2018-2019. The firm also developed the skincare product CALECIM, made from red deer umbilical cord lining extract, which comprises secreted cell proteins integrated into a cream and serum cosmetic product. CordLabs licenses its proprietary [cord lining](/wiki/Cord_lining) stem cell storage technology to cord blood banks, allowing them to also bank cord tissue from which the cord lining stem cells are derived. - Two scientific beauty breakthroughs from Geneu and Calecim - *Financial Times* - S'pore firm eyes global wound care market - *Straits Times* - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T10:00:49.096240",
  "title": "CellResearch Corporation",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/CellResearch_Corporation"
}