{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:00:50.456764"
  },
  "content": "Asian cold sweet dessert **Cendol** /ˈtʃɛndɒl/ is an iced sweet dessert that contains [pandan](/wiki/Pandanus_amaryllifolius)-flavoured green [rice flour](/wiki/Rice_flour) jelly, [coconut milk](/wiki/Coconut_milk), and [palm sugar](/wiki/Palm_sugar) syrup. It is popular in the Southeast Asian nations of [Indonesia](/wiki/Indonesia), [Malaysia](/wiki/Malaysia), [Brunei](/wiki/Brunei), [Cambodia](/wiki/Cambodia), [East Timor](/wiki/East_Timor), [Laos](/wiki/Laos), [Vietnam](/wiki/Vietnam), [Thailand](/wiki/Thailand), [Singapore](/wiki/Singapore), [Philippines](/wiki/Philippines), and [Myanmar](/wiki/Myanmar). Next to the green jelly, additional toppings might be added, including diced [jackfruit](/wiki/Jackfruit), sweetened red [azuki beans](/wiki/Azuki_beans), or [durian](/wiki/Durian). ## Etymology Earliest written records of the word *cendol* or *tjendol* (Dutch spelling) can be traced to dictionaries and books of the 19th century in the [Dutch East Indies](/wiki/Dutch_East_Indies) (now Indonesia). One of the oldest known records of the word *tjendol* is listed in the 1866 *Oost-Indisch kookboek* or East Indies recipe book. This book includes a cendol recipe with the title *Tjendol of Dawet* which indicates that cendol and dawet were already used synonymously at that time. In the dictionary *Supplement op het Maleisch-Nederduitsch Woordenboek* (1869) by Jan Pijnappel (Gz.), tjendol is described as a kind of drink or watery paste made from [sago](/wiki/Sago), coconut milk, sugar and salt. In Malaya, the word \"chendul\" was mentioned as early as 1894 in a Malay-English dictionary compiled by British administrators [Hugh Clifford](/wiki/Hugh_Clifford_(colonial_administrator)) and [Frank Swettenham](/wiki/Frank_Swettenham) in [Taiping, Perak](/wiki/Taiping,_Perak). It was described as the name of a liquid preparation made of cooked sago passed through a sieve, mixed with coconut milk, salt, and sugar. In 1932, \"chendol\" was mentioned as one of the foodstuffs available in [Kuala Lumpur](/wiki/Kuala_Lumpur) as recorded in the Malay Concordance Project that collects Malay writings. There is a popular belief that the name \"cendol\" is related to, or originated from, the word *jendol*, in reference to the swollen green worm-like rice flour jelly; in [Javanese](/wiki/Javanese_language), [Sundanese](/wiki/Sundanese_language), [Indonesian](/wiki/Indonesian_language), and [Malay](/wiki/Malay_language), *jendol* means \"bump\", \"bulge\", or \"swollen\". In most parts of Indonesia, cendol refers to the green rice flour jelly; while the concoction of that green rice flour jellies with coconut milk, shaved ice, areca palm sugar and sometimes diced [jackfruit](/wiki/Jackfruit) is called *es cendol* (in West Java) or *dawet* (in Central and East Java). The Indonesian dictionary [*Kamus Besar*](/wiki/Kamus_Besar_Bahasa_Indonesia) describes \"cendol\" as a snack made from [rice flour](/wiki/Rice_flour) and other ingredients that are formed by filters, then mixed with palm sugar and coconut milk (for beverage). The Malay dictionary *[Kamus Dewan](/wiki/Kamus_Dewan)* similarly defines it as a porridge-like drink with long strands made of rice flour in coconut milk and sugar syrup. In Vietnam, this worm-like rice flour concoction is called *[bánh lọt](/wiki/B%C3%A1nh_l%E1%BB%8Dt)* or \"secreted jellies\". *[Bánh lọt](/wiki/B%C3%A1nh_l%E1%BB%8Dt)* is a common ingredient in a Vietnamese dessert drink called *[chè](/wiki/Ch%C3%A8)*. In Thailand it is called *lot chong* ([Thai](/wiki/Thai_language): ลอดช่อง, pronounced [lɔ̂ːt t͡ɕʰɔ̂ŋ]) which can be translated as \"gone through a hole\", indicating the way it is made by pressing the warm [dough](/wiki/Dough) through a sieve into a container of cold water. In Burma, it is known as *mont let saung* or မုန့်လက်ဆောင်း. In Cambodia, it is known as *lot* (លត /lɔːt/), *bang-aem lot* (បង្អែមលត /bɑŋʔaɛm lɔːt/), *nom lot* (នំលត /nɷm lɔːt/), and *banh lot* (បាញ់លត /baɲ lɔːt/). In Laos, it is called *lod song* (ລອດຊ່ອງ). The word *lọt* in [Vietnamese language](/wiki/Vietnamese_language) has cognate with [Proto-Katuic](/wiki/Proto-Katuic_language) reconstruction of **lɔɔt* meaning \"to pass, go by\", whence the [Pacoh language](/wiki/Pacoh_language) with *luat*. ## History The origin of cendol can be traced back to [Java](/wiki/Java), Indonesia, where it is known as *dawet*. Its roots extend from the rural areas of Java, dating back to ancient times and continuing to the present day. The [Javanese](/wiki/Javanese_language) name of \"dawet\" was recorded in early 19th century Javanese manuscript of [Serat Centhini](/wiki/Serat_Centhini), composed between 1814 and 1823 in [Surakarta](/wiki/Surakarta), Central Java. An Indonesian academic suggests that a *dawet* sweet drink may have been recorded in the Kresnayana manuscript, dated from [Kediri Kingdom](/wiki/Kediri_Kingdom) circa 12th century Java. In Java, *dawet* refer to the whole concoction of cendol green jellies, usually made from *[aren](/wiki/Arenga_pinnata)* sago or rice flour, coconut milk and liquid *gula jawa* (palm sugar syrup). An Indonesian historian argues that sago or rice flour might have been used as sweet beverage ingredient in the rice agriculture society of ancient Java. Indeed, cendol jellies and its variations are rural agricultural product, still traditionally produced in Javanese villages. In Banjarnegara, Central Java, *dawet* is traditionally served without ice. Today, however additional ice cubes or shaved ice is commonly added into this dessert drink. Cendol, however, has developed differently in different countries. In Java (Indonesia), cendol only refers to the green \"pandan jelly served in coconut milk\", where sometimes [pandanus](/wiki/Pandanus) leaves or pieces of [jackfruit](/wiki/Jackfruit) may be added. Meanwhile, in [West Sumatra](/wiki/West_Sumatra) (Indonesia), cendol (*cindua*) has two colors, green and red. Red cendol is made from sago palm flour and rice flour, then it is given food coloring from gambier sap. This is different to the cendol in Malaysia and Singapore where various ingredients such as sweetened red beans and sweet corn may be mixed in like an [es campur](/wiki/Es_campur). Cendol is typically served with ice, and this may have developed when ice became readily available. It may have originated in Malayan port cities such as [Malacca](/wiki/Malacca) and [Penang](/wiki/Penang) where British refrigerated ships' technology would provide the required ice. In [Javanese tradition](/wiki/Javanese_culture), dawet or cendol is a part of traditional Javanese wedding ceremony. The *dodol dawet* ([Javanese](/wiki/Javanese_language) for \"selling dawet\") is performed during Midodareni ceremony, a day before the wedding. After the *siraman* bridal shower, the parents would sell dawet to the attending guests and relatives. The guest paid the dawet using terracotta coins that would be given to the bride as a symbol of family earnings. The symbolic meaning was as the parents' hope that the tomorrow wedding would be attended by a lot of guests, \"as plenty as the cendol jellies that being sold.\" In [Dutch East Indies](/wiki/Dutch_East_Indies) Java, dawet street hawkers using *pikulan* (baskets carried with balancing rod) are commonly found in Javanese cities, as can be seen in the old photograph dated from circa 1935. In Indonesia five traditions of cendol making has been recognised as the [intangible cultural heritage](/wiki/National_Intangible_Cultural_Heritage_of_Indonesia) by the [Indonesian Ministry of Education and Culture](/wiki/Ministry_of_Education_and_Culture_(Indonesia)). Three dawet (Javanese version of cendol) traditions has been recognised in 2010 and 2018, all registered under [Yogyakarta](/wiki/Special_Region_of_Yogyakarta) province. They are dawet, dawet camcau, and dawet sambel. Es cendol was recognized in 2016 registered under [West Java](/wiki/West_Java) province, while cendol was recognized in 2020 registered under [Riau Islands](/wiki/Riau_Islands) province. Cendol has been declared a Malaysian heritage food by the Malaysian Department of National Heritage. The origin of cendol is from Indonesia, but each country has its own distinctive characteristics and unique ingredient composition. ## Ingredients The ingredients of cendol relies heavily on *aren* (palm sugar) and coconut plants. The dessert's original or basic ingredients are [coconut milk](/wiki/Coconut_milk), jelly noodles made from [rice flour](/wiki/Rice_flour) with green [food colouring](/wiki/Food_colouring) (usually derived from the [pandan leaf](/wiki/Pandanus)), [shaved ice](/wiki/Shaved_ice), and [palm sugar](/wiki/Palm_sugar). The cendol in Java is usually served in a tall glass, assembled with liquid *[gula jawa](/wiki/Gula_jawa)* or palm sugar syrup in the bottom, followed by green jellies, poured with coconut milk, and topped with shaved ice. In West Sumatra is served in a bowl instead of a glass. *Cindua langkok* (cendol with various fillings) is usually mixed with [lupis](/wiki/Lupis_(food)), [durian](/wiki/Durian), *ampiang* (traditional glutinous rice krispies), and doused with palm sugar. The Singaporean and Malaysian versions usually have sweetened red beans added, and are served in a bowl. The palm sugar, often added as a dark syrup, is referred to as *[gula melaka](/wiki/Gula_melaka)*. In [West Java](/wiki/West_Java), cendol is a dark-green pulpy dish of rice (or sago) flour worms with coconut milk and syrup of areca sugar. In [Javanese](/wiki/Javanese_language), cendol refers to the green jelly-like part of the beverage, while the combination of cendol, palm sugar and coconut milk is called *dawet*. Today, the green cendol jelly noodles are mainly made from [rice flour](/wiki/Rice_flour), since rice is more readily available. However, in Java, a traditional cendol worm-like jelly noodles was made from *sagu aren*, or sago starch extracted from the trunk of sugar palm (*[Arenga pinnata](/wiki/Arenga_pinnata)*). In Indonesia, additional ingredients might include [tapai](/wiki/Tapai) (fermented sweet cassava), black [grass jelly](/wiki/Grass_jelly), and sweetened [condensed milk](/wiki/Condensed_milk). In Java (Indonesia) and Thailand, cendol usually served in a tall glass, meanwhile in West Sumatra (Indonesia), Malaysia, and Singapore however, they usually served in a bowl.[*citation needed*] To make cendol chewy and not hard, the mixture must contain sago flour and rice flour in the right composition. In Myanmar, *mont let saung* has 2 primary forms, *htannyet mont let saung* (ထန်းလျက်မုန့်လက်ဆောင်း), which is served in a caramel-coloured [jaggery](/wiki/Jaggery) syrup, and *onno mont let saung* (အုန်းနို့မုန့်လက်ဆောင်း), which is served with [coconut milk](/wiki/Coconut_milk). The snack is an iconic snack during [Thingyan](/wiki/Thingyan) (Burmese New Year), where it is commonly served by *[satuditha](/wiki/Satuditha)* donors to revellers. Cendol also features in a Burmese dessert called *[shwe yin aye](/wiki/Shwe_yin_aye)*. Thai *lot chong* is closer to the Javanese original, only consisting of green worm-like jellies, coconut milk, liquid palm sugar, and shaved ice.[*citation needed*] ## Variants ### Indonesia In Indonesia, the most famous variant is Javanese *es dawet ayu* from [Banjarnegara](/wiki/Banjarnegara), Central Java.: 16 Another variant is a black cendol called *es dawet ireng* from Purworejo, Central Java. *Ireng* is [Javanese](/wiki/Javanese_language) word for \"black\". Instead of green pandan leaf, this black cendol acquired its colour from *merang* or the ash of burned rice stalk mixed with water. Other than the basic ingredients of green jelly noodles, palm sugar syrup, and coconut milk, iced cendol might be served with additional toppings. Popular additional toppings in Indonesia include diced [jackfruit](/wiki/Jackfruit), [tapai](/wiki/Tapai) (fermented sweet cassava), durian flesh, and chocolate condensed milk. In Bayat Village, [Klaten](/wiki/Klaten) and Jabung Village, [Ponorogo](/wiki/Ponorogo), cendol is made of [aren](/wiki/Arenga_pinnata) flour and has pale and transparent color. In [Karanganyar Regency](/wiki/Karanganyar_Regency), purple cendol or *dawet ungu* is made from sweet potato. *Dawet beras* in [Tegal](/wiki/Tegal) is made of rice flour and its color is white. The drink is served by hitting a lime into a bowl, then adding the cendol with additional liquid sugar. A specialty cendol drink from [Solo](/wiki/Surakarta) is *dawet telasih*. In one bowl, it contains cendol, black sticky rice, rice pudding, sticky rice *[tapai](/wiki/Tapai)*, basil seeds, coconut milk, liquified granulated sugar, and ice cubes. Another recent variant in Indonesia is cendol latte, which is a mix between cendol and coffee [latte](/wiki/Latte). ### Malaysia In Malaysia, additional toppings such as [red beans](/wiki/Azuki_beans), [glutinous rice](/wiki/Glutinous_rice), [grass jelly](/wiki/Grass_jelly), [creamed corn](/wiki/Creamed_corn), durian, glutinous rice tapai and even ice cream might also be included. Cendol was brought to Malaysia by Javanese traders in the 19th century and has since become a staple dessert in Malaysian cuisine. It is often served during festive occasions such as Eid al-Fitr, a Muslim holiday that marks the end of Ramadan, the month of fasting. Cendol is also a popular street food in Malaysia, especially in Penang. ### Singapore The influence of Singapore and the West has given rise to different variations of cendol, such as cendol with vanilla ice cream or topped with durian. ## Selling Cendol has become a quintessential part of cuisine in Southeast Asia and is often sold by vendors at roadsides, [hawker centres](/wiki/Hawker_centre), and [food courts](/wiki/Food_courts). *Cendol* vendors are almost ubiquitous in Indonesian cities, especially [Jakarta](/wiki/Jakarta), [Bandung](/wiki/Bandung), and [Yogyakarta](/wiki/Yogyakarta). Originally *cendol* or *dawet* in Java was served without ice, but after the introduction of [refrigeration](/wiki/Refrigeration) technology, the cold *cendol* with shaved ice (*es serut*) was available and widely popular. In Indonesia and Malaysia, *cendol* is commonly sold on the roadside by vendors. It is a dessert fare in Singapore, found in dessert stalls, food centres, coffee shops, and food courts. ## In popular culture In [colloquial Indonesian](/wiki/Indonesian_slang), the term \"cendol\" has become an online rating system originated from Indonesian internet forum [KASKUS](/wiki/Kaskus), which its user accounts rating system represented as green \"cendol\" for positive and red \"bata\" ([brick](/wiki/Brick)) for negative. If an online items tweaks interest, a user punch in one or more green commas resembling a cendol. *Cendol dawet* chant created by Abah Lala has become popular in Indonesia. It is inserted in the song of Javanese singer [Didi Kempot](/wiki/Didi_Kempot). In December 2018, *cendol* became embroiled in a controversy after [CNN](/wiki/CNN) listed the Singapore version as one of the world's top 50 desserts, triggering a furious response from Malaysians. - Drink portal - Indonesia portal - Malaysia portal - Singapore portal - Thailand portal - [Ais kacang](/wiki/Ais_kacang) - [Es campur](/wiki/Es_campur) - [Es doger](/wiki/Es_doger) - [Es teler](/wiki/Es_teler) - [Halo-halo](/wiki/Halo-halo) - [Kakigōri](/wiki/Kakig%C5%8Dri) - [List of desserts](/wiki/List_of_desserts) - Origins of Cendol: Singaporean, Malaysian, or Javanese? | On The Red Dot: Food Fight - Part 4/4 - Cendol mention in Malaysia writing 1932 – malay concordance project.\n",
  "language": "en",
  "processed_at": "2026-01-12T10:00:50.456270",
  "title": "Cendol",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Cendol"
}