{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:00:52.437650"
  },
  "content": "Singaporean television channelTelevision channel **Central** was a [Singaporean](/wiki/Singapore) [free-to-air](/wiki/Free-to-air) [terrestrial television channel](/wiki/Television_channel) in [Singapore](/wiki/Singapore), owned by state media conglomerate [MediaCorp](/wiki/Mediacorp). The channel was established on 1 September 1995 by [Singapore Television Twelve](/wiki/Mediacorp_TV12) as **Premiere 12**, an [UHF](/wiki/UHF_television_broadcasting) spin-off of [Channel 12](/wiki/Suria_(TV_channel)) focused on arts, cultural, sports, and English-language entertainment programmes. Premiere 12 inherited the previous format of Channel 12, which concurrently relaunched with a multilingual format focused on [Malay](/wiki/Malay_language) and [Tamil](/wiki/Tamil_language) programmes. On 30 January 2000, the channel relaunched as Central; the channel's schedule was divided into three different [strands](/wiki/Block_programming), with children's programmes under the Kids Central strand, Tamil-language programmes under the Vasantham Central strand, and arts and cultural programming under the Arts Central strand. On 19 October 2008, MediaCorp discontinued Central and spun its programming off into the new channels [Okto](/wiki/Okto) and [Vasantham](/wiki/Vasantham_(TV_channel)). ## History ### Premiere 12 On 26 August 1994, ahead of the bill that suggested the planned privatisation of the Singapore Broadcasting Corporation, the Minister for Information and the Arts (Brigadier General) George Yeo announced the plan for the creation of a fourth free-to-air television channel in Singapore, offering a predominantly cultural lineup. Under this plan, arts and cultural programming would be spun off from Channel 12 into a new channel, broadcasting on the [UHF](/wiki/UHF_television_broadcasting) band due to the lack of [VHF](/wiki/Very_high_frequency) slots available. Tamil programmes would be moved from [Channel 8](/wiki/Channel_8_(Singaporean_TV_channel)) to [Channel 12](/wiki/Suria_(TV_channel)), so that 8 would shift exclusively to Chinese-language programming, and 12 would focus on Malay and Tamil language programmes. On 27 July 1995, [Television Twelve (later renamed Singapore Television Twelve)](/wiki/Mediacorp_TV12)—who became responsible for Channel 12 after privatization—received the greenlight from the [Singapore Broadcasting Authority](/wiki/Infocomm_Media_Development_Authority) to broadcast a UHF channel. Test transmissions began on 1 August 1995, with trial programming running nightly from 7 to 9 pm and the test pattern filling the rest. The new channel would launch on 1 September 1995 as Premiere 12, with the existing Channel 12 concurrently rebranded as Prime 12. At launch, Premiere 12 planned to broadcast 72 hours of programmes weekly, 15 1/2 hours of which would be devoted to sports coverage such as [S. League](/wiki/Singapore_Premier_League) and [Serie A](/wiki/Serie_A) football, basketball, and golf among others. Unlike Prime 12, much of Premiere 12's programmes were in English. The channel also planned to air a weekly slot for \"baby boomers\" featuring comedy series from the 1970s and classic films, and acquired the American [late-night talk show](/wiki/Late-night_talk_show) *[Late Show with David Letterman](/wiki/Late_Show_with_David_Letterman)*. Sandra Buenaventura, CEO of Singapore Television Twelve, said that the channels were \"like a tin of assorted biscuits\", reflecting the individual nature of the specialist programming of the new services. The channel, alongside Prime 12, would fall under PSB credentials; Singapore Television Twelve hoped to become the first profitable public service television company in the world, a distinction that broadcasters like PBS and the BBC don't have. Data from Nielsen Survey Research Singapore showed that Premiere 12's viewership share went from 10% in September 1995 to 22% in February 1996, attributed to the channel's better selection of programmes than those of Channel 5. In September 1998, *Japan Hour* moved from Prime 12 to Premiere 12, as the viewing audience matched Premiere 12's profile: 69% of the average viewer base consisted of professionals, managers and executives. Dramas were also moving to the channel. This enabled a boost in Japanese programming on weekends. By then, the newsmagazine produced by [NNN](/wiki/Nippon_News_Network) ([NTV](/wiki/Nippon_Television)) moved to the slot before the drama; up until then it aired before the Japan Hour documentaries. ### Central In September 1999, Singapore Television Twelve announced that Premiere 12 would be relaunched as Central as part of a company-wide restructuring of MediaCorp's television output, with the launch set for 30 January 2000. [Woon Tai Ho](/wiki/Woon_Tai_Ho) took over Lim Hup Seng in the post of president of STV12 the previous month. His views were that the formula of the two extant channels were separate, and lacked consistent stripping between days. Under the new format, Central would provide a more coherent schedule in order to attract more viewers to fixed slots. Children's programming was to be increased from 19 hours a week to 38 (double the figure) in order to distance the idea that children's programming was associated with Saturday mornings and cartoons, as well as increased local productions due to competition from Cartoon Network and Nickelodeon. Tamil programming would increase from 24 hours on Prime 12 to 27 hours on Vasantham Central. Arts Central, running from 9:30pm, would begin with a nightly studio programme (tentative title *Art Studio*). Premiere 12's current affairs and celebrity talk-show output moved to Channel 5 and Channel NewsAsia. Central's programming schedule was divided into three strands; - **Kids Central**, focusing on [children's programmes](/wiki/Children%27s_television_series) targeting viewers 12 and younger; many of these programmes moved from Channel 5, which elected to focus more on teen-oriented programmes. The block was positioned as a competitor to pan-Asian cable channels such as [Cartoon Network](/wiki/Cartoon_Network_(Asian_TV_channel)), featuring programmes acquired from international markets (such as *[Dragon Tales](/wiki/Dragon_Tales)* and *[Tweenies](/wiki/Tweenies)*), alongside original domestic productions such as *Hip-O & Friends*, *The Big Q*, and *Kids United*. As per licence conditions, at least twelve hours of programmes per-week were expected to have educational components. - **Vasantham Central**, which would focus on Tamil-language programmes, including news, cultural, and entertainment programmes. - **Arts Central**, which would focus on arts programmes (including the newsmagazine *Art Nation*), theatrical productions, documentaries, and classical music. On launch week, Kids Central reportedly had 70,000 to 173,000 viewers, Vasantham Central exceeded 30% share and the showing of the [Cirque du Soleil](/wiki/Cirque_du_Soleil) performance *[Quidam](/wiki/Quidam)* on Arts Central attracted 140,000 viewers. On 28 February 2000, Singapore Television Twelve increased Central's on-air hours from 91½ to 110½ hours per week. In June 2001, Arts Central dedicated its weekly movie slot to anime films. In 2002, TV12 launched the Take the First Step campaign, aiming at people getting interested in the arts. In 2006, Arts Central organised the Front Awards, aimed at young local arts practitioners. It is named after its weekly arts magazine series of the same name, Front. In March 2008, MediaCorp announced that Central would be split into two standalone channels; the changes took effect on 19 October 2008, with [Vasantham](/wiki/Vasantham_(TV_channel)) being spun off as a dedicated channel for Tamil programmes, and [Okto](/wiki/Okto) inheriting the children's and arts programming. ## Timeshared channels ### Kids Central Kids Central was Singapore's most-watched children's channel. Its programmes aim to bring fun television entertainment to viewers aged 4 to 12 years as well as appeal to people's inner children. The channel was set up to be a strong terrestrial alternative to cable channels and programming blocks aimed at the demographic. Educational and local programming was also included. The first local commissions for the channel were inherited from Premiere 12, *Hip-O and Friends* and *Kids in Charge*. Other content formats included CGI series, Japanese anime and acquisitions from other key foreign markets, namely the United States, Canada, Australia, the United Kingdom and France. Consistently, its local programming was often praised by the SBA/MDA Programme Advisory Quality, believing it to be of good quality. These also talked about topics relevant to children: *Kids United* was about teamwork (at home and at school), *The Big Q* was about science and *Art Factory* was about artistic ideas, while also encouraging the viewers to do the concepts presented in the programme. ### Vasantham Central Vasantham Central was focused to the [Tamil community of Singapore](/wiki/Indian_Singaporeans) broadcasting dramas, variety, news, information and entertainment shows in [Tamil](/wiki/Tamil_language). The station offered two-and-a-half hours of programming on weekdays and an longer amount on weekends, with approximately a quarter of local content. The new format started off with a three-hour increase (27 hours a week against 24 hours of Tamil programming on Prime 12), enabling the creation of new current affairs programmes. ### Arts Central Arts Central consisted on [culture](/wiki/Culture) programming with [culture](/wiki/Culture), [arts](/wiki/Art), [documentaries](/wiki/Documentary_film) and [classical music](/wiki/Classical_music). Arts Central offered 20 hours of programming per week. In 2001, both *Hanging by the Thread* and *AlterAsian* received a Finalist status at the New York Festival, and in 2007, the I-Collector series placed as runners-up in the Asian TV Awards. On 1 November 2004, its programming offer widened, becoming a lifestyle-oriented channel, reducing the amount of arts-based programming. The schedule now opened with a lifestyle belt from 9 to 9:30pm, followed by comedy series (*The Office*, *Banzai!*, *Celebrity Deathmatch* etc.) until 10pm. More traditional arts programming, such as ballet, was now confined to Sundays. It also added *Animania*, a dedicated slot for anime, airing between Wednesday and Friday. Its broadcasts of anime titles, as well as Japanese movies, would later make it to Okto's evening slots in 2008. Facing criticism for its programming becoming \"too mainstream\", Arts Central unveiled a new look and line-up in April 2007, with the key relaunch title being the BBC documentary series *[Planet Earth](/wiki/Planet_Earth_(2006_TV_series))*.\n",
  "language": "en",
  "processed_at": "2026-01-12T10:00:52.437196",
  "title": "Central (TV channel)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Central_(TV_channel)"
}