{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:00:56.167569"
  },
  "content": "Largest nature reserve in Singapore The **Central Catchment Nature Reserve**[a] (**CCNR**) is the largest [nature reserve](/wiki/Nature_reserve) in [Singapore](/wiki/Singapore), occupying 2880 hectares. Forming a large green lung in the geographical centre of the city, it houses several recreational sites, including the [Singapore Zoo](/wiki/Singapore_Zoo), the [Night Safari](/wiki/Night_Safari,_Singapore) and the [River Safari](/wiki/River_Safari), as well as several newer facilities built to encourage public appreciation of the reserve, such as the HSBC TreeTop Walk. The reserve sits within the boundaries of the [Central Water Catchment](/wiki/Central_Water_Catchment). It is one of the four gazetted nature reserves in Singapore. The other three are the [Labrador Nature Reserve](/wiki/Labrador_Nature_Reserve) which was gazetted since 1 January 2002, [Sungei Buloh Wetland Reserve](/wiki/Sungei_Buloh_Wetland_Reserve) and [Bukit Timah Nature Reserve](/wiki/Bukit_Timah_Nature_Reserve). All four nature reserves along with the parks are protected under the Parks & Trees Act 2005. The nature reserve acts as a catchment area for the surrounding reservoirs. The country's main reservoirs–[MacRitchie](/wiki/MacRitchie_Reservoir), [Upper Seletar](/wiki/Upper_Seletar_Reservoir), [Upper Peirce](/wiki/Upper_Peirce_Reservoir) and [Lower Peirce](/wiki/Lower_Peirce_Reservoir)–are located within the reserve. Most forests in the CCNR were cleared for logging and cultivation unlike Bukit Timah Nature Reserve, which remain relatively undisturbed. The CCNR now consists of a mixture of young and mature secondary forests with virgin [primary forest](/wiki/Primary_forest) surrounding the reservoirs. ## Attractions Bordering MacRitchie reservoir are remnants of rubber plantations from the 19th century. Walkways and boardwalks in the reserve, which range from 3 to 11 kilometres long, allow visitors to enjoy a closer feel to nature. The reserve is also visited by hikers and trekkers due to its terrain and scenery. A hike can lead to the nearby [Bukit Timah Nature Reserve](/wiki/Bukit_Timah_Nature_Reserve). The park has been designated with the code 9V-0008 by the international [Parks On The Air](/wiki/Parks_On_The_Air) award program, and so is regularly 'activated' by [Amateur Radio](/wiki/Amateur_Radio) operators using portable equipment. ### Biodiversity The nature reserve boasts a rich biodiversity with over 500 animal species including [crab-eating macaque](/wiki/Crab-eating_macaque), [colugo](/wiki/Colugo), [common treeshrew](/wiki/Common_treeshrew), [Sunda slow loris](/wiki/Sunda_slow_loris) and [Sunda pangolin](/wiki/Sunda_pangolin). Central Catchment Nature Reserve is the only place in Singapore where [Raffles' banded langur](/wiki/Raffles%27_banded_langur) monkey remains, with a population that has been severely diminished. Wild birds such as [crimson sunbird](/wiki/Crimson_sunbird), [greater racket-tailed drongo](/wiki/Greater_racket-tailed_drongo) and [kingfishers](/wiki/Kingfishers) are found in the reserve, too. Some species of critically endangered bats have also been spotted. The reserve has many species of [butterflies](/wiki/Butterflies). It is home to some 1,600 species of flora. The reserve, along with the adjacent [Bukit Timah Nature Reserve](/wiki/Bukit_Timah_Nature_Reserve), has been identified by [BirdLife International](/wiki/BirdLife_International) as the Central Forest [Important Bird Area](/wiki/Important_Bird_Area) (IBA) because it supports populations of [vulnerable](/wiki/Vulnerable_species) [straw-headed bulbuls](/wiki/Straw-headed_bulbul) and [brown-chested jungle flycatchers](/wiki/Brown-chested_jungle_flycatcher). ### HSBC TreeTop Walk The nature reserve contains a 250-metre suspension bridge. The HSBC TreeTop Walk opened to public on 5 November 2004. It connects the two highest points in MacRitchie – Bukit Pierce and Bukit Kalang. At the highest point, the bridge hangs 25 metres from the forest floor. The difficulty level of the trail ranges from moderate to difficult. The suspension bridge serves an important role in forest canopy research, giving researchers access to areas well off the ground. To preserve the tranquility of the environment and for safety reasons, the number of people allowed on the walkway is capped at 30. Visitors will only be able to travel along the narrow walkway in one direction, by entering from the Bukit Pierce entrance and exiting through the Petaling Trail. Rangers are deployed along the 10.3-kilometre trail to ensure safety. ## Conservation The CCNR provides free guided tours to schools and the general public. This is part of National Parks Board's efforts to educate people about the conservation of nature areas in Singapore. ### Banded leaf monkey conservation The [banded leaf monkey](/wiki/Banded_surili) is one of four primate species native to Singapore. The CCNR is the only location in Singapore where the nationally critically endangered banded leaf monkeys can be found. Due to rapid urbanisation and habitat loss, the population at [Bukit Timah Nature Reserve](/wiki/Bukit_Timah_Nature_Reserve) had died out in 1987. The Central Catchment population had declined to as few as 10–15 monkeys before recovering to about 40 by 2012. Today, they are restricted to a small area within the Central Water Catchment with a population of about 70 by 2022. - [Bukit Timah Nature Reserve](/wiki/Bukit_Timah_Nature_Reserve) - [List of parks in Singapore](/wiki/List_of_parks_in_Singapore) - [Syonan Jinja](/wiki/Syonan_Jinja) ## Notes - National Parks Board's website - Central Catchment Nature Reserve\n",
  "language": "en",
  "processed_at": "2026-01-12T10:00:56.167164",
  "title": "Central Catchment Nature Reserve",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Central_Catchment_Nature_Reserve"
}