{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:01:00.326590"
  },
  "content": "Statutory board administering national savings and pension plan The **Central Provident Fund Board** (**CPFB**), commonly known as the **CPF Board** or simply the **Central Provident Fund** (**CPF**), is a compulsory comprehensive savings and pension plan for working [Singaporeans](/wiki/Singaporeans) and [permanent residents](/wiki/Permanent_residency_in_Singapore) primarily to fund their [retirement](/wiki/Retirement), [healthcare](/wiki/Healthcare), and [housing](/wiki/Housing) needs in [Singapore](/wiki/Singapore). The CPF is an employment-based savings scheme with the help of employers and employees contributing a mandated amount to the fund for their benefits. It is administered by the Central Provident Fund Board, a [statutory board](/wiki/Statutory_boards_of_the_Singapore_Government) operating under the [Ministry of Manpower](/wiki/Ministry_of_Manpower_(Singapore)) which is responsible for investing contributions. The 2025 Mercer CFA Institute Global Pension Index ranked Singapore 5th worldwide and accorded it an 'A' grade for the first time, positioning it as the top retirement system in Asia. CPF monies are used by the CPF Board to invest in the exclusive purchase of Government-issued Special Singapore Government Securities (SSGS), with the proceeds from these transactions going into the [past reserves](/wiki/Reserves_of_the_Government_of_Singapore). As at 31 December 2024, the CPF managed SGD$609.5 billion for 4.2 million account holders. ## History British colonial authorities in Singapore implemented a proposal by [David Marshall](/wiki/David_Marshall_(Singaporean_politician)) via the [Progressive Party](/wiki/Progressive_Party_(Singapore)) committee, to create the Central Provident Fund in 1955 as a compulsory savings scheme to assist workers in retirement provision without needing to introduce a more extensive and costly old age pension, as was the norm in Britain at the time. Money contributed to the Central Provident Fund earned a [nominal](/wiki/Nominal_GDP) rate of return. Lee Kuan Yew promoted the Central Provident Fund (CPF) as a core pillar of Singapore's social security system after independence, further expanding it to bolster economic progress. The Central Provident Fund was expanded in 1968 to provide for housing expenses under the Public Housing Scheme. In 1984 the Central Provident Fund was again expanded to cover medical care expenses. In 1986 an investment option was added to give members the opportunity to manage their own risk and returns. In 1987, the Minimum Retirement Sum Scheme annuity was introduced. In 1990, MediShield health insurance funded by Central Provident Fund savings, was launched to provide universal healthcare to all Singaporeans. Later programs includes interest rate top up of 1% for the first $60,000 of retirement savings, the Workfare Income Supplement which supplements retirement savings for low-income older workers, and the Pioneer Generation Package which provides additional support for the medical expenses of older workers. When the CPF was started in 1955, both employees and employers contributed 5% of an employee's pay to the scheme. The rate of contribution was progressively increased to 25% for both employers and employees in 1985. The employer contribution was cut to 10% during a recession in 1986. The employer contribution rate was reverted to match the employee rate until the [1997–1998 Asian Financial Crisis](/wiki/1997_Asian_financial_crisis), and thereafter lowered to 10% for workers 55 years or younger. Since then, the employer contribution rate has been gradually increased. Employers currently contribute 3 fewer percentage points of salaries over S$750 for employees up to 55 years old. ## Overview ### Accounts and interest rates Employees and employers are required to make monthly contributions to the following CPF accounts: - Ordinary Account (OA) – for housing, pay for CPF insurance, [investment](/wiki/Investment) and [education](/wiki/Education). - Special Account (SA) – for old age and investment in retirement-related financial products. - [Medisave](/wiki/Medisave) Account (MA) – for hospitalisation and approved [medical insurance](/wiki/Medical_insurance). The OA and SA is combined to form the Retirement Account (RA) when one turns 55. The RA is used to meet basic needs during old age. The SA is closed for members aged 55 and above. The CPF savings earn a minimum interest of 2.5% for OA and 4% for other accounts. In addition, the first $60,000 in the combined CPF balances, with up to $20,000 from the Ordinary Account, will earn an extra 1% interest. CPF members age 55 and above will also earn an extra 1% on the first $30,000 of their savings. ### CPF contribution rates As of Jan 2025, for those 55 and below, the total CPF contribution is 37% (17% employer, 20% employee). For those above 55 to 60, it is 32.5% (15.5% employer, 17% employee). For those above 60 to 65, it is 23.5% (12% employer, 11.5% employee). For those above 65 to 70, it remains 16.5% (9% employer, 7.5% employee). For those above 70, it remains 12.5% (7.5% employer, 5% employee). ### CPF ordinary wage (OW) ceiling CPF OW ceiling is being progressively raised from S$6,000 to S$8,000 by 2026. - Before September 1, 2023: S$6,000 - September 1, 2023: S$6,300 - January 1, 2024: S$6,800 - January 1, 2025: S$7,400 - January 1, 2026: S$8,000 ## Retirement schemes ### CPF Minimum Sum The CPF Minimum Sum (MS) Scheme requires all members to set aside a minimum sum of CPF savings in the RA for retirement needs upon reaching 55 years old. CPF savings from the OA and SA would be transferred to the RA for this purpose. In 2016, the Minimum Sum was renamed as the Retirement Sum. The Retirement Sum consists of three levels - Basic Retirement Sum (BRS), Full Retirement Sum (FRS) and Enhanced Retirement Sum (ERS). FRS is set at two times BRS while ERS is set at four times BRS. ERS is optional. Members would receive a monthly stipend from their RA at the start of their Payout Eligibility Age until it is depleted. Members who reached the age of 55 and whose savings are in excess of FRS would be allowed to withdraw them in cash. For members with insufficient savings to meet FRS minimum limit or chooses to meet only BRS minimum limit in their RA, the property under their ownership (with the exception of 2-room flexi or [lease buyback scheme flat](/wiki/Public_housing_in_Singapore)) could be pledged to make-up half of FRS. Upon the sale or transfer of the property, members are required to refund to CPF, any savings used in the original transaction or retirement funds withdrawn, inclusive of accrued interests. The retirement sum has been continuously increased over the years to account for inflation and longer life expectancies. CPF members who turn 55 in 2024 will need to set aside FRS of $205,800 in their RA. Over the years, the Payout Eligibility Age has been progressively delayed from 60 to 65. For the cohort who reached age 55 in 2022, about 50% of active members met the FRS in cash while about 30% were unable to meet the FRS in cash or in cash/property. ### CPF Life Members with at least $40,000 in their Retirement Account at 55 or at least $60,000 at 65 years old will be asked to select a CPF [LIFE annuity](/wiki/Life_annuity) plan, which will give them an income for life, starting from their Payout Eligibility Age. The three CPF Life plans are the Escalating Plan, Standard Plan and Basic Plan. Those who are not on CPF LIFE can choose to join it or continue to keep the monies in their Retirement Account. It improves upon the Minimum Sum Scheme where payouts only last about 20 years. No minimum amount of RA savings will be needed to join CPF LIFE, however the monthly payout depends on the RA savings. Thus, members with lower RA balances will receive correspondingly lower monthly payouts. Members who have a life annuity from an insurance company that provides equivalent benefits to that of CPF LIFE may be exempted from joining the scheme. ## Medical schemes ### Medisave [Medisave](/wiki/Medisave) may be used to cover self or dependents' hospitalisation expenses. It may also be used for certain outpatient treatments like chemotherapy and radiotherapy treatments. The Basic Healthcare Sum (BHS) is the maximum amount a citizen member can have in their MediSave account and is the estimated savings they need in their MediSave Account for their basic subsidised healthcare needs in old age. Part of citizen members' working contributions will be allocated to their MA until their balance reaches the Basic Healthcare Sum (BHS). Amounts above the BHS will be transferred to citizen members' other CPF accounts, depending on their age. The BHS for members who turn 65 in 2026 is $79,000 and remains fixed for the rest of their lives. BHS for members who are below 65 in 2026 is $79,000 and will be adjusted yearly. Members do not need to make any top-up if they do not have the BHS. Policies on Medisave usage and BHS is determined by the Ministry of Health. ### Medishield Life MediShield Life is a basic health insurance scheme to help citizens and their dependents to meet the costs of large hospital bills and selected outpatient treatments. Medisave savings may be used to cover the premiums for MediShield Life. Similar to Medisave, policies on Medishield Life coverage, usage and premiums are set by the Ministry of Health while the day-to-day operational aspects are run by CPF Board. ## Protection schemes ### Eldershield ElderShield is a severe disability insurance scheme that provides monthly cash payout of $300 or $400 up to a maximum period of 5 or 6 years. CPF members with a Medisave account will be automatically enrolled into the scheme once they reach 40 years old unless they opt-out. In order to make a claim under this scheme, a person must lose the ability to perform at least three out of the six daily activities: Washing, Dressing, Feeding, Toileting, Mobility, Transferring. As of 2018, depending on the payout, entry age and gender, the annual premium for Eldershield ranges from $152 to $3132. This premium is non-guaranteed and may be adjusted in the future. According to Minister for Health [Gan Kim Yong](/wiki/Gan_Kim_Yong), about $2.6 billion have been collected in premiums for ElderShield, out of which around $100 million have been paid out in claims and $130 million in premium rebates from its inception in 2002 to end 2015. According to Gan Kim Yong, ElderShield collects premiums while the policyholder is aged 40 to 65, and provides lifetime coverage from age 40, even after the policyholder reaches 65 and stops paying premiums. The total amount of premiums collected exceed the amount of claims paid to-date because the premiums collected are meant to provide coverage against future claims throughout policyholders' lifetime. ### Careshield Life On 25 May 2018, the Ministry of Health announced that it will be introducing a mandatory insurance scheme that will enhance the existing Eldershield by 2020 for those aged between 30 and 40. Similar to Eldershield, to claim under Careshield Life, one has to lose the ability to perform at least three out of six daily living activities. Careshield Life premium has a longer payment period of 38 years (variable depending on re-employment age cap) compared to 26 years for Eldershield and there is no way to opt out unlike Eldershield. The annual premium is also higher, starting at $200 for men joining at the age of 30 and $250 for women, with premium rising at 2% per annum initially. The monthly payout starts at $600 per month and last through a lifetime. ### Dependents' Protection Scheme The Dependents' Protection Scheme (DPS) provides insured members and/or their families with some money to get through the first few years should the insured members meet an untimely death, suffer from terminal Illness or total permanent disability. DPS covers insured members up to 65 years old. Members up to 60 years old will be covered for a maximum sum assured of $70,000. For members above age 60 and up to age 65, DPS covers them up to a maximum sum assured of $55,000. The annual premium increases with age, from $18 for 34 years old and below, to $298 for those 60 to 64 years old. ## Housing schemes The Ordinary Account savings can be used to purchase a home under the CPF housing schemes. A [Housing and Development Board](/wiki/Housing_and_Development_Board) ([HDB](/wiki/Housing_and_Development_Board)) flat may be purchased under the Public Housing Scheme, or a private property under the Residential Properties Scheme. CPF savings may be used for full or partial payment of the property, and to service the monthly housing payments. With effect from 20 Aug 2024, the Loan-to-Value (LTV) limit for HDB loans was lowered from 80% to 75%. This brings the LTV limit for HDB loans in line with loans granted by financial institutions, which remains at 75% for first home loans. If a flat is purchased under the [Public Housing](/wiki/Public_Housing) Scheme, mortgage insurance under the Home Protection Scheme will be necessary. ## Investment scheme CPF members may invest their Ordinary Account balance under the CPF Investment Scheme – Ordinary Account (CPFIS-OA) and their Special Account balance under the CPF Investment Scheme – Special Account (CPFIS-SA), subject to caps. Assets that may be invested includes [Insurance](/wiki/Insurance), [unit trusts](/wiki/Unit_trust), Exchange Traded Funds (ETFs), [Fixed Deposits](/wiki/Fixed_Deposits), [Bonds](/wiki/Bond_(finance)) and [Treasury Bills](/wiki/Government_bond), [Shares](/wiki/Shares), Property Fund and [Gold](/wiki/Gold). From 1 July 2010, only monies in excess of $20,000 in the Ordinary Account and $40,000 in the Special Account can be invested. Profits made from investments are not withdrawable but members do not have to make any top-up to their CPF if they incur losses on investments. ## CPF withdrawal From 2003 to 2013, CPF members who left Singapore withdrew SGD$426 million, or 0.3 per cent of the average total members' balances each year. From 2013 to 2017, an annual average of 13,500 CPF members, or 0.4% of total CPF members, withdrew their CPF monies when they left Singapore. ### Conditions for withdrawal CPF savings can be withdrawn on the following grounds: - Anyone who has renounced their Singaporean citizenship or permanent residency. The CPF accounts will be closed - Conditional partial withdrawal for those with reduced life expectancy due to a medical condition; who are certified permanently unfit for work; or permanently lack the mental capacity to make decisions. - CPF members who are 55 years and older, and have met the conditions for withdrawal ## CPF nomination CPF nominations allow members to specify how their CPF savings will be distributed after their death. By default, CPF members' nominees receive the deceased's savings in cash. ## Controversies ### Comparison with City Harvest Church Fund On 15 May 2014, [Roy Ngerng](/wiki/Roy_Ngerng) made a post entitled \"Where Your CPF Money Is Going: Learning From [The City Harvest Trial](/wiki/City_Harvest_Church_criminal_breach_of_trust_case)\" on his blog *the Heart Truths*. Within the post, Ngerng created a chart which mapped the relationships between the [Prime Minister of Singapore](/wiki/Prime_Minister_of_Singapore), [Lee Hsien Loong](/wiki/Lee_Hsien_Loong), the Central Provident Fund (CPF), the [Monetary Authority of Singapore](/wiki/Monetary_Authority_of_Singapore) (MAS), [Temasek Holdings](/wiki/Temasek_Holdings) and the [Government of Singapore Investment Corporation](/wiki/GIC_Private_Limited) (GIC). Ngerng claimed there was an \"uncanny resemblance\" between this chart and another chart by news agency [*Channel NewsAsia*](/wiki/CNA_(TV_network)) regarding the relationship among [City Harvest Church](/wiki/City_Harvest_Church) leaders, who were being charged with misappropriating funds. The CPF has been described as \"a forced savings scheme\" for Singaporeans with \"monthly contributions into the fund\" to be saved for retirement, or for expenses on \"property, healthcare, and their children's education\", while the GIC has been described to have \"indirectly invested\" funds from the CPF. Singapore's Ministry of Finance on its part has put forth its explanation as to why CPF funds are invested in Special Singapore Government Securities, to enable CPF Board to be able to pay its members all their monies when due, and the interest that it commits to pay on CPF accounts. The government securities are invested as part of a combined pool of funds managed by GIC, rather than managed in a separate dedicated fund, as a standalone fund would have to be managed conservatively to avoid the risk of failing to meet obligations to CPF members. On 18 May, PM Lee responded through his lawyer [Davinder Singh](/wiki/Davinder_Singh_(lawyer)), who stated that the blog post alleged that Lee \"is guilty of criminal misappropriation of the monies paid by Singaporeans to the CPF\" and that the allegations were \"false and baseless\". Ngerng said that the article was a call for greater transparency on the CPF, the GIC and Temasek Holdings. and called for PM Lee to rebut the points made in his blog post. Singapore's Ministry of Finance has publicly stated that CPF monies are safe as all CPF monies are invested in securities that are issued and guaranteed by the Singapore Government, which is one of the few remaining triple-A credit-rated governments in the world. On 23 May, Ngerng apologized \"unreservedly\", admitting that his allegation was \"false and completely without foundation\". On 29 May, Prime Minister Lee filed a defamation lawsuit against Ngerng. In a 4 August [affidavit](/wiki/Affidavit), Ngerng argued that his blog post had been misunderstood, and that he was merely asking for more transparency and accountability for CPF monies. On 7 November, the [High Court of Singapore](/wiki/High_Court_of_Singapore) found Ngerng liable of defamation with damages to be assessed, which was the first such ruling in Singapore over a purely online article. Judge [Lee Seiu Kin](/wiki/Lee_Seiu_Kin) ruled that there was \"no triable defence\" and \"no doubt that it is defamatory to suggest that the plaintiff is guilty of criminal misappropriation\". An injunction against Ngerng was granted, barring him from publishing future similar accusations regarding PM Lee and the CPF. Ngerng expressed disappointment at the verdict, but maintained that he would \"still continue to speak up on the CPF and other issues that concern Singaporeans\". On 17 December 2015, the court led by Lee handed down a judgement ordering Ngerng to pay S$100,000 in general damages and S$50,000 in aggravated damages. Ngerng, through his lawyer, [Eugene Thuraisingam](/wiki/Eugene_Thuraisingam) proposed to pay the S$150,000 in instalments which was granted by the Prime Minister on the condition that Ngerng paid the S$30,000 in hearing costs immediately i.e. by 16 March 2016. Ngerng is expected to repay $100 a month from 1 April 2016 onwards over five years until 1 April 2021 when instalments are increased to S$1,000 until the full sum has been paid by the year 2033. Lee also rejected Ngerng's request to reimburse part of the damages i.e. S$36,000. ## Senior leadership List of chairman NameYears servedRef.[Ernest Leslie Peake](/wiki/Ernest_Leslie_Peake)1954–1957[Robert Charles Kendall](/wiki/Robert_Charles_Kendall)1954, 1957–1958[Khoo Teck Puat](/wiki/Khoo_Teck_Puat)1958–1959[James Puthucheary](/wiki/James_Puthucheary)1959–1961[Lim Joo Hock](/wiki/Lim_Joo_Hock)1961–1963[K. M. Byrne](/wiki/K._M._Byrne)1963–1966[Pang Tee Pow](/wiki/Pang_Tee_Pow)1966–1970Lim Joo Hock1970–1971[Kwa Soon Chuan](/wiki/Kwa_Soon_Chuan)1971–1973[William Cheng](/wiki/William_Cheng_(civil_servant))1973–1979[Han Cheng Fong](/wiki/Han_Cheng_Fong)1979–1980[Tan Chok Kian](/wiki/Tan_Chok_Kian)1980–1986[Lim Siong Guan](/wiki/Lim_Siong_Guan)1986–1994[Andrew Chew](/wiki/Andrew_Chew)1994–1998[Ngiam Tong Dow](/wiki/Ngiam_Tong_Dow)1998–2001[Koh Yong Guan](/wiki/Koh_Yong_Guan)2001[Moses Lee Kim Poo](/wiki/Moses_Lee_Kim_Poo)2002–2005Koh Yong Guan2005–2013[Chiang Chie Foo](/wiki/Chiang_Chie_Foo)2013–2021[Yong Ying-I](/wiki/Yong_Ying-I)2021–present - [Central Provident Fund (South Africa)](/wiki/Central_Provident_Fund_(South_Africa)) - [Social security](/wiki/Social_security) - [Employees Provident Fund](/wiki/Employees_Provident_Fund_(Malaysia)), Malaysia's Provident Fund - [Economy of Singapore](/wiki/Economy_of_Singapore) - [Provident fund (disambiguation)](/wiki/Provident_fund_(disambiguation)) ### Similar systems elsewhere - [National Insurance](/wiki/National_Insurance) (UK) - [Social Security in France](/wiki/Social_Security_in_France) - [South African Social Security Agency](/wiki/South_African_Social_Security_Agency) - [Social Security (United States)](/wiki/Social_Security_(United_States)) - [Social security in Sweden](/wiki/Social_security_in_Sweden) - [Social security in Australia](/wiki/Social_security_in_Australia) - [Canada Pension Plan](/wiki/Canada_Pension_Plan) - [Mandatory Provident Fund](/wiki/Mandatory_Provident_Fund) (Hong Kong) - Central Provident Fund - Singapore's Central Provident Fund Scheme An Overview and A Comparison with the U.S. Social Security System Archived 11 March 2005 at the [Wayback Machine](/wiki/Wayback_Machine)\n",
  "language": "en",
  "processed_at": "2026-01-12T10:01:00.326044",
  "title": "Central Provident Fund",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Central_Provident_Fund"
}