{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:00:58.124401"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Central Police Division\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(July 2020)* *(Learn how and when to remove this message)* 1°16′42.29″N 103°50′21.57″E﻿ / ﻿1.2784139°N 103.8393250°E﻿ / 1.2784139; 103.8393250The **Central Police Division** (or **'A' Division**), is one of the seven land divisions of the [Singapore Police Force](/wiki/Singapore_Police_Force). It was established in 1867 and is the longest-serving Police Division in Singapore. Amongst the seven land divisions covering all of Singapore's primary land mass, Central Division has the smallest operational area, covering just over 27 square kilometres and has a residential population of around 280,000. ## History The **Central Police Division** was originally situated at the [Hill Street Police Station](/wiki/Old_Hill_Street_Police_Station) before moving to the [Eu Tong Sen Street Police Station](/wiki/Singapore_Police_Force#Defunct_Units/Facilities) in 1982, it relocated again in 1994 to the [Beach Road Police Station](/wiki/Beach_Road_Police_Station) before finally settling down at the new [Police Cantonment Complex](/wiki/Police_Cantonment_Complex) in 2000. When the Geylang Police Division was closed in December 2000, 'A' Division took over 10% of its areas of control, while the 40% came under the [Ang Mo Kio Police Division](/wiki/Ang_Mo_Kio_Police_Division) and the remainder of 50% went to [Bedok Police Division](/wiki/Bedok_Police_Division). The People's Armed Police Force was first established in 1983, at the [Hill Street Police Station](/wiki/Old_Hill_Street_Police_Station) before moving to the [Eu Tong Sen Street Police Station](/wiki/Singapore_Police_Force#Defunct_Units/Facilities), it relocated again in 1994 to the [Beach Road Police Station](/wiki/Singapore_Police_Force#Defunct_Units/Facilities) before finally settling down at the new [Police Cantonment Complex](/wiki/Police_Cantonment_Complex) in 2000. ## Establishments - Central Division HQ - Bukit Merah East Neighbourhood Police Centre - [Kreta Ayer Neighbourhood Police Post](/wiki/Kreta_Ayer_Neighbourhood_Police_Post) - Radin Mas Neighbourhood Police Post - Tanjong Pagar Neighbourhood Police Post - Rochor Neighbourhood Police Centre - Kallang Neighbourhood Police Post - Kampong Glam Neighbourhood Police Post - Kolam Ayer Neighbourhood Police Post - Marina Bay Neighbourhood Police Centre ## Leadership and awards Deputy Assistant Commissioner of Police (DAC) Daniel Tan Sin Heng was the Commander of Central Police Division between 25 June 2012 and 1 January 2016. Then Deputy Assistant Commissioner of Police (DAC) Arthur Law Kok Leong took over the role of Commander of Central Police Division on 2 January 2016. He held the position until 12 August 2018, before moving on to become Commander of [Special Operations Command](/wiki/Special_Operations_Command_(Singapore)). The position of Commander was handed over to Deputy Assistant Commissioner of Police (DAC) Gregory Tan Siew Hin on 13 August 2018, a position which he has held since. Under the leadership of then [Assistant Commissioner of Police](/wiki/Assistant_Commissioner_of_Police) (AC) Arthur Law, Central Police Division received its first Best Land Division Award in 2018. - Central Police Division This Singapore-related article is a stub. You can help Wikipedia by expanding it. - v - t - e This law enforcement agency article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T10:00:58.123962",
  "title": "Central Police Division",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Central_Police_Division"
}