{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:01:06.565058"
  },
  "content": "This article includes a list of references, related reading, or external links, **but its sources remain unclear because it lacks inline citations**. Please help improve this article by introducing more precise citations. *(April 2011)* *(Learn how and when to remove this message)* **Centrepoint Kids** were groups of youths who used to hang out at [shopping centers](/wiki/Shopping_center) in Singapore during the mid-1980s. This term came about after the demolition of the old [Cold Storage](/wiki/Cold_Storage_(supermarket)) supermarket building and construction of [The Centrepoint](/wiki/The_Centrepoint) in 1982-1983, after which a growing number of teenagers went there to \"hang out.\" ## Origins/sociology Seen as public nuisance, they were labelled the \"Centrepoint Kids.\" By 1986, some were sociologically studied with a focus on their personal and family backgrounds. Other similar [moral panics](/wiki/Moral_panic) that appeared in the Singapore media include the McDonald Kids (early 1980s), the [Far East Plaza](/wiki/Far_East_Plaza) Kids (1980-3; re-lapse in mid-1990s), the [Daimaru](/wiki/Liang_Court) Kids (1983-6), and the [Marina Square](/wiki/Marina_Square) Kids (early 1990s). Most kids started off in Far East Plaza in the early 1980s before migrating to [Centrepoint](/wiki/The_Centrepoint) when the building was completed. During its peak period, membership reached above 2000 members (checked through sub-grouping). In a survey done in December 1985 by a group of volunteers headed by Vincent Lam, a police officer with the [Singapore Police Force](/wiki/Singapore_Police_Force), the youngest Centrepoint Kid interviewed was 10 years old and the oldest was 23 years old. They were easily identified by their outlandish outfits and [avant-garde](/wiki/Avant-garde) hair styles. While some of the youths had been found committing crimes such as [smoking](/wiki/Smoking), [glue-sniffing](/wiki/Glue-sniffing), [fighting](/wiki/Combat), and [shoplifting](/wiki/Shoplifting), most were only there to make friends. However, shopkeepers complained that the youths were blocking passageways at shopping centres and frightening away potential customers. ## Rehabilitation efforts Lam set up an organisation (later named \"Youth Challenge\") to cater to the needs of the so-called \"Centrepoint Kids\" and resigned from the police force to concentrate on his efforts to nurture them into socially responsible citizens. Lam managed his social efforts with a team of volunteers, and his successful efforts were highlighted in [AsiaWeek](/wiki/AsiaWeek), a regional Asian magazine published in Hong Kong. To educate students about social responsibility, Lam visited more than 100 schools to talk about the danger of falling into \"[street gangs](/wiki/Street_gangs).\" Some school principals had even issued orders forbidding students from forming or joining such groups. Lam's passion for helping the \"Centrepoint Kids\" was noticed by the Commissioner of Police in Singapore and the Police Commission nominated him for the \"Outstanding Young Persons of the Year Award.\" - The Straits Times, 8 December 1985, Page 16, \"Quizzing 1000 Centrepoint Kids and their like\" - The Straits Times, 23 February 1986, Page 8, \"Centrepoint Kids fade out, to shopkeepers' relief\" by Audrey Perera - YouTube: Heard of the \"Centrepoint Kids\"? (Teen Hangouts Pt 1) - Google News (Ocala Star-Banner): \"Mall kids invade Southeast Asia\" by Kenneth L. Whiting - AsiaViews (June, 2007): \"She's taking up the Challenge\" by Jasmine Yin\n",
  "language": "en",
  "processed_at": "2026-01-12T10:01:06.564633",
  "title": "Centrepoint Kids",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Centrepoint_Kids"
}