{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:59:34.001206"
  },
  "content": "* *CEPAS**, the **Specification for Contactless e-Purse Application**, is a [Singaporean](/wiki/Singapore) specification for an [electronic money](/wiki/Electronic_money) [smart card](/wiki/Smart_card). The specification was prepared by the Cards and Personnel Identification Technical Committee (CPITC), under the purview of the IT Standard Committee of Singapore (ITSCS). It has been gazetted as Singapore Standard SS 518 by [Enterprise Singapore](/wiki/Enterprise_Singapore). CEPAS has been deployed island-wide, replacing the previous original [EZ-Link](/wiki/EZ-Link) card effective 1 October 2009. ## Function The CEPAS provides the command sets and data bytes that can be used for contactless e-purse applications and focuses on the [debit](/wiki/Debit) and [credit](/wiki/Debits_and_credits) areas. The most recent version of the standard is CEPAS 3.0, which adds support for account-based ticketing with a token held on the CEPAS card. The standard allows for the interoperability of multi-purpose stored value (MPSV) card payment schemes from different card issuers and system operators. ## Background CEPAS is spearheaded by the Infocomm Media Development Authority of Singapore (IMDA), and is one of the key next generation e-payment initiatives under Singapore's iN2015 infocomm masterplan led by IMDA. The vision of CEPAS is for Singaporeans to have a single MPSV card for use all around Singapore for micro-payments. This includes transit (bus, [MRT](/wiki/Mass_Rapid_Transit_(Singapore)), [LRT](/wiki/Light_Rail_Transit_(Singapore))), [taxi](/wiki/Taxicabs_of_Singapore), motoring ([ERP](/wiki/Electronic_Road_Pricing), parking), retail, and other services. CEPAS is a result of close collaboration by IMDA with different industry players and the [Land Transport Authority](/wiki/Land_Transport_Authority) (LTA). The other key collaborators are the Cards & Personal Identification Technical Committee (CPITC) under the Singapore IT Standards Committee (ITSC), [Network for Electronic Transfers](/wiki/Network_for_Electronic_Transfers) (NETS) and [EZ-Link Pte Ltd](/wiki/EZ-Link) (EZ-Link). SPRING Singapore published CEPAS as SS 518 and was officially launched during the CEPAS Launch & Next Generation e-Payment seminar on 27 June 2006, held at [Suntec Singapore International Convention and Exhibition Centre](/wiki/Suntec_City#Suntec_Singapore_International_Convention_and_Exhibition_Centre). ## Current and future payment landscape The current micro-payment landscape in Singapore is fragmented, with different standards, and is dominated by two main players: NETS and EZ-Link. EZ-Link controls the transit space, NETS controls the motoring (ERP, parking) space, Visa, MasterCard, and AMEX control the retail space. NETS also dominates the retail space, with EZ-Link having a limited presence. Currently, cards and readers from both providers cannot interoperate, resulting in consumers holding different cards for payment of various services and goods. CEPAS aims to open and level the micro-payment playing field. For example, NETS and credit/debit card holders will be able to use their cards to pay for transit, while EZ-Link card holders will be able to use their cards for retail and motoring payments. [*citation needed*] ## Transaction processing methods ### Card-based offline debit The CEPAS card-based EZ-Link and NETS FlashPay cards released on 29 December 2008 operate as offline cards, intended for [farecards](/wiki/Public_transport#Electronic_fare_card) in [transit systems](/wiki/Transit_system) and [micropayments](/wiki/Micropayments) in retail. As transactions are processed offline without having to maintain an active network connection to the bank for processing, lower transaction fees are incurred compared to debit and credit cards. Payment modeDescriptionYear introduced[Chip and PIN](/wiki/Chip_and_PIN)[Contactless payment](/wiki/Contactless_payment)Top-up using self-help machinesPublic transport paymentsRetail paymentsCarpark payments • EZ-Link cards • Concession cards • EZ-Link Motoring cards • EZ-Charms • EZ-Link Wearables • EZ-Link NFC SIM cards (card-based offline debit) Card-based stored-value wallet, based on CEPAS standard. ✓ It can be used for retail and public transport payments, without remote management functionality. ✓ Commuters can see their fare cost and card balance at the gantry. ✓ The card-based offline debit EZ-Link cards and EZ-Link Motoring cards are compatible with dual mode in-vehicle units for ERP and carpark payments. 2002: FeliCa card 2009: CEPAS card 2021: EZ-Link Motoring Card (CEPAS) **EZ-Link Motoring cards** (with a non-account-based card profile & similar functionality) are still sold at 7-Eleven/Cheers convenience stores, selected Caltex petrol stations, Vicom centres, STA Inspection centres. NoYesTop-up kiosks Assisted service kiosks SimplyGo kiosks (at MRT stations & bus interchanges) YesLimited retail locations Yes • NETS FlashPay • NETS Contactless CashCard (2nd generation) •NETS Motoring Card) (card-based offline debit) Card-based stored-value wallet, based on CEPAS standard for retail, public transport, and motoring payments. ✓ It can be used for retail and public transport payments, without remote management functionality. ✓ Commuters can see their fare cost and card balance at the gantry. ✓ It is compatible with dual mode in-vehicle units for ERP and carpark payments. 2009: NETS FlashPay 2018: NETS Contactless CashCard 2021: NETS Motoring Card **NETS FlashPay cards** are no longer sold at TransitLink Ticket Offices since 15 March 2022, to encourage adoption of the SimplyGo account-based system. **NETS Motoring cards** (with FlashPay payment functionality) are still sold at petrol stations and convenience stores. NoYesTop-up kiosks/general ticketing machines Assisted service kiosks SimplyGo kiosks (at MRT stations & bus interchanges) NETS top-up machines Yes Yes Yes ### Account-based online debit In 2016, the Land Transport Authority began the account-based ticketing trial to expand the range of e-payment options and eliminate the need for top-ups in transit. With that, the CEPAS version was changed to 3.0 and SeP to 2.0. It allowed credit cards (Visa, Mastercard) and mobile wallets (Apple Pay, Fitbit Pay, Garmin Pay, Google Pay, Samsung Pay) to be used in the transit system, in addition to the existing CEPAS EZ-Link and NETS FlashPay cards. In September 2020, LTA began a trial to expand the account-based ticketing system to CEPAS cards, which were conventionally based on a card-based ticketing system. The reason given for pushing the account-based ticketing system was that it removed the need for physical trips to top-up machines. As the card information is stored on a central server under account-based ticketing, access to travel history and card top-ups can be done remotely through mobile apps, without needing the card to be physically present. The account-based EZ-Link Card was launched in January 2021, and the account-based NETS Prepaid Card was launched in November 2022. These account-based cards replaced the former EZ-Link and NETS FlashPay cards that supported card-based ticketing. Transactions using account-based cards are processed in the backend. Hence commuters are unable to see their fare deduction and card value balance at MRT fare gates and bus readers. On 10 January 2024, LTA announced that EZ-Link adult cards, which have not yet been upgraded to SimplyGo and NETS FlashPay cards, will no longer be accepted for public transport fare payment from 1 June 2024 due to the phasing out of the legacy card-based ticketing system. This decision was reversed because the commuters were concerned with card balance and fare displays. The ERP acceptance was not taken into consideration because of the [car-lite](/wiki/Car-free_movement) society. Payment modeDescriptionYear introduced[Chip and PIN](/wiki/Chip_and_PIN)[Contactless payment](/wiki/Contactless_payment)Top-up using self-help machinesPublic transport paymentsRetail paymentsCarpark payments • SimplyGo EZ-Link cards • SimplyGo Concession cards (account-based online debit) Online account-based ticketing wallet, based on CEPAS standard. As the card information is stored on a central server, the card balance can be topped up without presence of physical card. ✓ It is compatible with the SimplyGo system for remote management of public transport cards. ✗ Fare cost and card balance will not be displayed at the gantry. Commuters have to create an account and sign in to the SimplyGo website or app, to view their travel history and its related fares. ✗ These account-based online debit cards are not compatible with ERP and carpark payments. 2021NoYesTop-up kiosks/general ticketing machines Assisted service kiosks SimplyGo kiosks (at MRT stations & bus interchanges) Fare cost and card balance will not be displayed at the gantry.Limited acceptance No • NETS Prepaid Card (account-based online debit) Online account-based ticketing wallet, for retail and public transport payments. It functions similarly to the NETS EFTPOS Debit card. As the card information is stored on a central server, the card balance can be topped up without presence of physical card. ✓ It is compatible with the SimplyGo system for remote management of public transport cards. ✗ Fare cost and card balance will not be displayed at the gantry. Commuters have to create an account and sign in to the SimplyGo website or app, to view their travel history and its related fares. ✗ It is not compatible with ERP and carpark payments. 2022Yes (for transactions ≥ $100)YesTop-up available on mobile app onlyFare cost and card balance will not be displayed at the gantry. Yes No ## Criticisms There has been some criticism by the public that the auto-top-up service by GIRO for the new CEPAS card will require an administration fee for activation as well as for each top-up. In contrast, auto-top-up for the original EZ-Link card was free. Additionally, the public has complained that the application process for this service is now more complicated compared to the relatively easier process for the original version. LTA's announcement on 10 January 2024 about the discontinuation of the card-based ticketing EZ-Link & NETS FlashPay Cards and mandatory transition to the account-based ticketing SimplyGo EZ-Link & NETS Prepaid Cards drew a negative reception from the public. The concerns raised included the inability to view fares and card balances at the gantry. The public felt that the SimplyGo user experience for stored-value cards is unnecessarily complicated and over-reliant on mobile apps, which creates inconveniences for the elderly, children, and less tech-savvy demographics of the population. The authorities reversed the decision on 22 January 2024, and existing EZ-Link & NETS FlashPay cards can continue to be used after 1 June 2024. ## Gallery - Payment cards/logos - [EZ-Link](/wiki/EZ-Link) - [NETS FlashPay](/wiki/Network_for_Electronic_Transfers#FlashPay) - Specification for Contactless ePurse Application (CEPAS)\n",
  "language": "en",
  "processed_at": "2026-01-12T09:59:34.000803",
  "title": "CEPAS",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/CEPAS"
}