{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:01:08.204551"
  },
  "content": "Document entitling a person to own a motorised vehicle in Singapore In [Singapore](/wiki/Singapore), the **Certificate of Entitlement** (**COE**) are classes of categories as part of a quota license for owning a vehicle. The licence is obtained from a successful winning bid in an [open bid uniform price auction](/wiki/Uniform_price_auction) which grants the legal right of the holder to register, own and use a vehicle in Singapore for an initial period of 10 years. When demand is high, the cost of a COE can exceed the value of the car itself. The COE system was implemented in 1990 to regulate the number of vehicles on the road and control traffic congestion, especially in a land-constrained country such as Singapore. ## History On 1 May 1990, the previous transportation unit of [Singapore's Public Works Department](/wiki/Public_Works_Department_of_Singapore) (PWD) instituted a quota limit to vehicles called the COE, as rising affluence in the country catapulted land transport network usage and previous measure to curb vehicle ownership by simply increasing road taxes was ineffective in controlling vehicle population growth. The premise was that the country had limited land resources, ie. limited supply of roads and car parks / parking lots, (with scarce land being managed to have a greater emphasis on providing an adequate supply of homes), along with demand for vehicle ownership spiralling out of control, would result in traffic conditions exceeding the criterion of a healthy road network that is sustainable by developments in land transport infrastructure resulting in gridlock. Along with a [congestion tax](/wiki/Congestion_tax) called the [Electronic Road Pricing](/wiki/Electronic_Road_Pricing) (ERP), the COE system is one of many key pillars in Singapore's traffic management strategies that aims to provide a sustainable urban quality of life. In place of the COE and the ERP, the government has encouraged its citizens and tourists alike to take advantage of the extensive public transportation network to get around the country instead, such as the [Mass Rapid Transit](/wiki/Mass_Rapid_Transit_(Singapore)) (MRT), [Light Rail Transit](/wiki/Light_Rail_Transit_(Singapore)) (LRT) or [public buses](/wiki/Public_buses_of_Singapore), and to embrace a \"car-lite society\". ## System Before buying a new vehicle, potential vehicle owners in Singapore are required by the [Land Transport Authority](/wiki/Land_Transport_Authority) (LTA) to first place a monetary bid for a Certificate of Entitlement (COE). The number of available COEs is governed by a quota system called the Vehicle Quota System (VQS) and is announced by LTA in April of each year with a review in October for possible adjustments for the period of one year starting from May. Approximately one-twelfth of the yearly quota is auctioned off each month in a sealed-bid, uniform price auction system and successful bidders pay the lowest winning bid. ### Vehicle Quota System (VQS) The number of COEs available to the public is regulated by the Vehicle Quota System (VQS) that is calculated every 6 months based on the following conditions: 1. Actual number of vehicles taken off the roads (i.e. number of vehicles de-registered) 2. Allowable growth in vehicle population 3. Adjustments arising from temporary COEs that have expired or were cancelled. #### Formula Since the change in the total motor vehicle population is given by the number of registrations minus the number of de-registrations and any unallocated quota in a given year may be carried over to the following year, the quota formula is as follows: ( Total COE Quota ) q y = g . ( Motor vehicle population ) y − 1 + ( Projected de-registrations ) y + ( Unallocated quota ) q y − 1 {\\displaystyle {\\begin{aligned}({\\text{Total COE Quota}})_{qy}=&g.({\\text{Motor vehicle population}})_{y-1}\\\\&+({\\text{Projected de-registrations}})_{y}\\\\&+({\\text{Unallocated quota}})_{qy-1}\\end{aligned}}} In the formula above, the subscript y {\\displaystyle y} denotes calendar year and the subscript q y {\\displaystyle qy} denotes quota year (May to April). Initially, projected de-registrations for (calendar) year y {\\displaystyle y} were simply taken to be equal to actual de-registrations in y − 1 {\\displaystyle y-1} but from quota year 1999–2000 onwards, a projected number of de-registrations has been used. Each year, the quota is set to allow for a targeted g {\\displaystyle g} percent growth in the total motor vehicle population, plus additional quota licenses to cover the number of motor vehicles that will be deregistered during the (calendar) year, plus any unallocated quota licenses from the previous quota year. ### Validity This section **does not cite any sources**. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed. *(July 2024)* *(Learn how and when to remove this message)* The holder of a COE is allowed to own a vehicle for an initial period of 10 years, after which they must scrap or export their vehicle or renew the COE at the prevailing rate if they wish to continue using their vehicle for an intended remaining lifespan. At the end of the 10-year COE period, vehicle owners may choose to deregister their vehicle or to revalidate their COEs for another 5-year or 10-year period by paying the Prevailing Quota Premium, which is the three-month moving average of the Quota Premium for the respective vehicle category. You do not need to bid for a new COE to renew the existing COE of your vehicle. 5-year COEs cannot be further renewed. ### Auction process COE biddings starts on the first and third Monday of the month and typically lasts for three days to the following Wednesday. Bidding duration will be pushed further in some circumstances, including public holidays. Bidding results can be obtained through the local media on the same day or on a website. All COE bids made in the two car categories (Cat A and B COEs) and the motorcycle category (Cat D COEs) must be made in the name of the buyer. Once COE is obtained, the vehicle has to be registered in the name of the bidder, i.e. Cat A, B and D COEs are non-transferable. To provide flexibility, successful COE bids in the Cat C (Goods vehicles and Buses) and Cat E (Open Category) in the name of the individuals are transferable. However these can only be transferred once within the first 3 months, while successful bids by companies are not transferable at all. An additional restriction on car ownership is the requirement that motor vehicles more than ten years old, known as \"time expired\" vehicles, must either renew the COE for another 5 or 10 years or de-register the vehicle for scrapping or exporting from Singapore, usually to neighbouring countries in [ASEAN](/wiki/ASEAN). COEs renewed for 10 years are renewable indefinitely, but for vehicles which have a renewed COE of only 5 years, the owner of the vehicle has to scrap the vehicle at the end of the period with no option to renew the COE, totaling a car ownership of 15 years. Some of these vehicles, especially luxury ones, have been exported further to other [right hand drive](/wiki/Right_hand_drive) countries such as [Australia](/wiki/Australia) and [New Zealand](/wiki/New_Zealand), which has traditionally imported such vehicles from Japan. The result of the peculiarities of the Singapore car market has resulted in Singapore being the second largest exporter of used cars in the world after Japan. Cars are exported to many countries, including beyond Asia such as [Kenya](/wiki/Kenya) and [South Africa](/wiki/South_Africa) in Africa as well as [Jamaica](/wiki/Jamaica) and [Trinidad and Tobago](/wiki/Trinidad_and_Tobago) in the Caribbean. As these cars are often only about ten years old, they are often in high demand as they remain in relatively good condition. Owners of such vehicles are given financial incentives to do this, which include a **Preferential Additional Registration Fee (PARF).** This program was implemented to reduce [traffic congestion](/wiki/Traffic_congestion) and it complements other measures to curb road usage such as the [Electronic Road Pricing](/wiki/Electronic_Road_Pricing) (ERP) program. ### COE Category Refinement in 2013 In September 2013, The COE system has been refined to include a new criterion for Category A cars. Under the change, the engine power of Cat A cars should not exceed 97 kilowatts (kW). This is equivalent to about 130 brake horsepower. This is in addition to the previous criterion of engine capacity of Cat A cars not exceeding 1600 cubic centimetres. However, cars with engine power output exceeding 97 kW (130 hp) will be classified under Category B in COE bidding exercises starting February 2014 despite having engine capacity below 1600 cubic centimetres. The review of the COE categories' criteria was because LTA wanted to differentiate and regulate the buying of mass market and premium cars under Cat A in a bid to control COE prices that hovered closer and closer to S$100,000. ### Categories of COE Initially, COEs were divided into eight categories but after many revisions, the system has been simplified to five categories. Categories A, B & D are non-transferable. Taxis used to be classed under category A but issuance of COEs became unrestricted from August 2012 onwards. #### Prior to May 1999 CategoryVehicle ClassCat 1Cars 1000cc & belowCat 2Cars 1001-1600cc & TaxisCat 3Cars 1601-2000ccCat 4Cars above 2000ccCat 5Goods Vehicles & BusesCat 6MotorcyclesCat 7\"Open\" (for any kind of vehicle) #### Current Categories CategoryVehicle ClassBefore May 2022From May 2022Cat ACars 1600cc & below, and the engine power output should not exceed 97 kW (130 bhp)Non-fully electric cars 1,600cc & below, and maximum power output up to 97 kW (130 bhp); and fully electric cars with maximum power output up to 110 kW (147 bhp)Cat BCars above 1600cc, or the engine power output exceeds 97 kW (130 bhp)Non-fully electric cars above 1,600cc, or maximum power output exceeds 97 kW (130 bhp); and fully electric cars with maximum power output above 110 kW (147 bhp)Cat CGoods Vehicles & Buses (including public transport buses)Cat DMotorcyclesCat E\"Open\" (for any kind of vehicle, in 2017 motorcycles are no longer included in Cat E COE) ## Historical records ### Car growth rate Period[%](/wiki/Percentage)RemarkMay 1990 to May 20093.03.0% + deregistrations as per last annumJun 2009 to Jun 20101.5Reduced to 1.5% + deregistrations as per last annum, partly due to low price COEJul 2010 to Jul 20121.5% as per last annum + recent half-yearly deregistrations, rate are extended to JulyAug 2012 to Jan 20131.0Taxi are moved to Cat EFeb 2013 to Jan 20140.5Reduced to 0.5% and expected to last till Jan 2015Feb 2014 to Jan 2015Change to recent quarterly deregistrationsFeb 2015 to Jan 20180.25Reduced to 0.25%Since Feb 20180.0COE growth rate frozen for personal cars and motorbikes only. ### COE range Previous CategoryHighestLowest1Current CategoryHighestLowestRemarksMay 1990 – Apr 1999SGDPeriodSGDPeriodFrom May 1999 – presentSGDPeriodSGDPeriodCat 1 (1000 cc & below)41,008Jul 1997210Feb 1991Cat A3128,105Oct 20252Nov 2008aa. Major historical plunge partly due to the [Great Recession](/wiki/Great_Recession) and over-projections of vehicle de-registrations in 2008/09 b. Major historical plunge partly due to [1997 Asian financial crisis](/wiki/1997_Asian_financial_crisis)Cat 2 (1001 – 1600 cc) & taxi62,208Jul 1997909Mar 1991Cat 3 (1601 – 2000 cc)83,500Dec 199450Jan 1998bCat B150,001Oct 2023200Jan 2009aCat 4 (2001 cc & above)110,500Dec 1994800Apr 1991Cat 5 (Goods Vehicle & Bus)39,000Dec 19941Apr 1991Cat C91,101Mar 20231Dec 2006– Mar 2007cc. Partly due to strict emission standards from Oct 2006Cat 6 (Motorcycle)3,506Aug 19971Jan 1994, Feb 1994dCat D13,189Nov 20221Nov 2002– Mar 2003dd. Mainly due to higher quota and lower than minimum biddersCat 7 (Open)95,986Dec 1994998Mar 1991Cat E158,004Oct 20233,200Jan 2009–Cat 8 (Weekend Car)245,300Sep 19941,110Oct 1991OPCCOE rebate up to $17,0001. Excluded initial quote for first 3 months (May~Jul'90). Previous lowest record due to higher quota for year 1991 2. It was stopped on Sep 1994, the scheme was replaced by the Off-Peak Car rebate 3. Taxi are moved to Cat E from Aug 2012 ## Reception In 1994, academics Winston Koh and David Lee of the National University of Singapore proposed to reform the bidding process. Instead of bidding in dollars, applicants for COEs would bid in percentage of the price of the vehicle. In 2003, economist Tan Ling Hui of the International Monetary Fund reiterated the idea. In 2023, with COE prices surging, the idea of percentage bidding resurfaced in the general media. Proponents of percentage bidding argued that it was more equitable than bidding in dollars. Library resources about **Certificate of Entitlement** - Resources in your library - Resources in other libraries - Land Transport Authority\n",
  "language": "en",
  "processed_at": "2026-01-12T10:01:08.204113",
  "title": "Certificate of Entitlement",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Certificate_of_Entitlement"
}