{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:01:10.521581"
  },
  "content": "Commercial Auxiliary Police in Singapore 1°19′16.88″N 103°53′30.67″E﻿ / ﻿1.3213556°N 103.8918528°E﻿ / 1.3213556; 103.8918528 **Certis** is one of the five commercial [auxiliary police](/wiki/Auxiliary_police) forces authorized to provide armed security officers to government organizations as well as private companies or individuals in Singapore. Certis originated from the Guard and Escort unit of the [Singapore Police Force](/wiki/Singapore_Police_Force) (SPF), which was separated from the SPF as the **Commercial and Industrial Security Corporation** (**CISCO**) in 1972 as a statutory board with a monopoly over most areas of the local private armed security industry. From 1 June 2005, the statutory board was dissolved and Cisco Security Pte Ltd was formed upon its corporatisation as a fully owned subsidiary of [Temasek Holdings](/wiki/Temasek_Holdings), and inaugurated on 5 July 2005. The abbreviation of the former statutory board, \"CISCO\", was retained due to its reputation in the local market. The company was renamed as Certis CISCO Security Pte Ltd on 13 September 2007 and as Certis in 2018. As the oldest Auxiliary Police Force with a monopoly over most of the private armed security sector in Singapore for 33 years, Certis maintains a visible presence in many key establishments, including the private residences of VVIPs. They were deployed in major events such as the [Singapore 2006](/wiki/Singapore_2006) IMF Meetings, the New Year Countdown at [Marina Bay](/wiki/Marina_Bay,_Singapore) in 2007 and 2008, the [Chingay Parade](/wiki/Chingay_Parade) and the [Thaipusam](/wiki/Thaipusam) processions. They also continue to dominate some services such as the transportation of valuables, most visibly in the form of delivering cash to [automated teller machines](/wiki/Automated_teller_machine). ## History ### Origins CISCO came into being in 1972 in the wake of a police employment scheme review by a committee led by Professor Lee Soo Ann a year earlier. It recommended that the Singapore Police Force's Guard and Escort Unit, itself formed in 1958, be hived off as a statutory board of the [Government of Singapore](/wiki/Government_of_Singapore), in a bid to relieve manpower constraints on the SPF by empowering the new statutory board with the ability to conduct its own recruitment schemes tailored specifically for armed security services. The company was established under the Commercial and Industrial Security Corporation Act. At its dissolution, the Guard and Escort Unit had a strength of 1,600 police officers, who received the same training as their counterparts in police divisions, and are mostly deployed as guards in commercial banks. The new statutory board absorbed most of these regular officers, although the committee recommended the early retirement of 460 older officers, with an enhanced pension scheme offered to them as compensation. A recruitment drive was also initiated on 1 April to recruit other police officers and boost its strength to 2,000. CISCO, as a separate statutory board, became Singapore's only commercial entity offering armed security services. Its policemen continue to receive training via a 7-week residential training course at the CISCO Police Training School, which is adjacent to the [Police Academy](/wiki/Old_Police_Academy) at [Thomson Road](/wiki/Thomson_Road,_Singapore), with training assistance from the Academy. Over time, the course was streamlined to fit their specific operation needs, and instruction was gradually taken over by fellow CISCO officers. CISCO police officers were dressed largely similar to their counterparts in the [Singapore Police Force](/wiki/Singapore_Police_Force), and CISCO vehicles were also largely similar, except with the addition of a CISCO logo. CISCO officers were paid a salary of about S$650 in the 1970s. ### Diversification In the next decades, the company diversified its operations beyond the provisioning of armed guards, providing a range of security-related services, including enforcement, management, and consultancy services for not just physical, but also data and IT-related needs. In 1991, the board's new chief executive, Chan Boon Kiong initiated wide-ranging changes to turn the company round into a commercial entity with an annual turnover of S$200 million, with diversification into various aspects of security. As the company began to diversify, its traditional armed police operations were organised under the name of CISCO Auxiliary Police under the Product Division, together with the CISCO Recall Total Information Management Pte Ltd and other specialised departments. It also began to expand abroad, having first established a joint venture with Zhong-Bao Security Industry Company in China in July 1995 with a 60% stake. In 1982, CISCO announced that the position of unarmed warden was dropped and constable was the lowest rank. CISCO officially opened its new Headquarters building at Jalan Affifi off Upper Paya Lebar Road on 20 June 1986, which then boasted some of the most modern facilities including the first computerised indoor shooting range in Singapore. On 2 March 1994, work commenced to extend the CISCO Headquarters building to incorporate facilities to process and store high-value items and a computer disaster recovery centre. The [SCORE](/wiki/Singapore_Corporation_of_Rehabilitative_Enterprises) Counselling Centre was opened in the building on 5 December 1996. CISCO entered into a joint venture with Brambles Industries Ltd from Australia in May 1996 with a 51% stake to form CISCO Recall Total Information Management Pte Ltd (now [Iron Mountain](/wiki/Iron_Mountain_(company)) Recall) as part of its foray into the information management industry. On 8 June 1999, the first purpose-built CISCO Recall Centre was officially opened, which included a 43-metre high document storage facility, the tallest single-storey building in Singapore. A second CISCO Recall Centre was opened in Chin Bee Avenue on 10 September 2003, by which time the company's CISCO Recall service has 33 government agencies amongst its clients. By 1998, the company has over 2,000 clients which has installed security systems linked to CISCO's alarm monitoring system, an increase of 25% since 1996. This included some 500 private homes which paid between S$2,000 to S$1million for such systems. CISCO entered into a joint-venture with the [National Library Board](/wiki/National_Library_Board) on 21 June 1999 to establish a [digital signature](/wiki/Digital_signature) certification authority service. CISCO manned the [Area Licensing Scheme](/wiki/Singapore_Area_Licensing_Scheme) gantries in 1975 until the introduction of [Electronic Road Pricing](/wiki/Electronic_Road_Pricing) in September 1998, where 105 officers were redeployed. CISCO officers began to assist the Traffic Police as traffic wardens to curb illegal parking on 1 November 1999. Over 12,100 parking violation notices were subsequently issued in the next two months, prompting their implementation in more areas to allow the Traffic Police to concentrate on enforcing traffic rules on the move. During the height of the [SARS](/wiki/SARS) crisis, CISCO officers were deployed to serve Home Quarantine Orders at the residents homes and install CCTVs at their homes. These were enforced by about 60 officers, who were given the power to electronically tag those who violate the order. After the [September 11, 2001 attacks](/wiki/September_11,_2001_attacks), CISCO reported an increase in business as a result of heightened security demands. From November 2004, CISCO officers were deployed to assist in enforcing sensitive locations such as [Jurong Island](/wiki/Jurong_Island). CISCO ventured into professional investigation services in 2005. ### Corporatisation Over the years, the license to provide armed security services has been extended to other companies, including the [Auxiliary Police](/wiki/Auxiliary_Police) Forces operated by [PSA Corporation](/wiki/PSA_Corporation), [Changi International Airport Services](/wiki/Changi_International_Airport_Services), [Singapore Airport Terminal Services](/wiki/Singapore_Airport_Terminal_Services), and [Singapore Technologies Kinetics](/wiki/Singapore_Technologies_Kinetics), although these officers have their policing powers restricted to their areas of operation. In the wake of rising security concerns, the government decided to introduce greater competition in the armed security service industry. As a result of measures to create a more [level playing field](/wiki/Level_playing_field), the CISCO Act was dissolved in 2005, and CISCO ceased being a statutory board, corporatised as a fully government owned company, and came instead under the same legislative and regulatory guidelines as the other Auxiliary Police Forces. The new company will no longer utilise the Singapore Police Force's crest, and changes will be made to the uniforms of its police officers, in line with its counterparts in the armed security industry. To minimise disruptions during the corporatisation process, the Ministry of Home Affairs transferred all of its former statutory board's assets, liabilities, staff and contracts to the new company, and did not give it a [moratorium](/wiki/Moratorium_(law)) since the statutory board has already engaged in commercial services. The new company took over all businesses the statutory board had engaged in, and is now liberated to enter or exit from contracts based on its own commercial interests. On 1 June 2005, the corporatisation process was completed and the new CISCO Security Private Limited formed. ### Post-Corporatisation On 29 January 2019, Certis announced the establishment of a K-9 unit to protect facilities under contract. Certis has implemented a work-study scheme for any of its employees looking to study part-time while working. In December 2022, Certis partnered Lendlease to redevelop its headquarters at Jalan Afifi. ## Company ### Training Prospective Certis recruits were trained at the Police Academy with four weeks of residential training. Previously, most were trained at its Kallang facility, but recruits had to go to the academy to practice shooting drills. Requirements for Certis constables were to attend residential training for three months while wardens were required to attend residential training for a month. In 2017, Certis CISCO opened a new shooting range facility at Jalan Afifi where its officers can practice shooting techniques. ## Uniforms Given its former affiliation with the Singapore Police Force, CISCO officers wore the same dark blue uniform as that of the police force when it was formed in 1972. As the sole private armed security agency, and with several sensitive roles passed on to CISCO, the uniforms were kept similar such that the general public would not be able to tell CISCO officers from regular police officers unless under close scrutiny. The primary distinguishing feature was of a black plastic name tag with a white border, as opposed to the plain all-black name tags worn by the police regulars. As a result of several uniform reviews both by CISCO and the police in subsequent decades, however, it became easier to distinguish CISCO officers. The blue [beret](/wiki/Beret) and long-sleeved shirts, phased out in favour of the peaked cap and short-sleeved shirts for most normal police officers, was still retained in the CISCO uniform. Similarly, CISCO retained the old metallic cap badges and collar lapels although they were replaced with embroidered versions in the SPF. When CISCO was corporatised as CISCO Security on 1 June 2005, officers continued to don the old uniforms pending a review of their uniforms. Under governmental direction, the uniform was modified to inject distinguishing features between them and that of those worn by officers of the SPF to foster a more level playing field with other Auxiliary Police Forces in Singapore. From 15 June 2005, all 3,200 uniformed CISCO personal switched to the new uniforms. The new uniforms saw the adoption of a new corporate colour, steel blue, and the material was changed from pure [polyester](/wiki/Polyester) to poly [viscose](/wiki/Viscose). New buttons and badges on the cap and collars incorporating CISCO's logo were used in place of similar logos to the regular police force. The leather belt was changed from black to brown, as is a band around the peak cap. There is also a horizontal cutting across the chest from one pocket to the other. While the new uniform was implemented across the company, some officers tasked to perform specific roles were exempt from the change, in particular those involving provision of security for sensitive locations or personnel, such as the Istana, the Supreme Court building and the private residences of VVIPs. Close resemblance of the old CISCO uniform with that of the regular police has allowed the latter to outsource sensitive roles, yet providing a visual impression of continued police presence. This practice was thus continued at sensitive locations despite the introduction of the new uniforms. ## Notable Projects One of Certis’ major projects include being the key security services provider for [Jewel Changi Airport](/wiki/Jewel_Changi_Airport). Responsible for the facility’s security, facility management and customer services, Certis supplies its frontline workers which includes security personnel, concierge and service staffs and facilities maintenance staffs. A multi-element, technological approach called “Security+” is Certis’ key service delivered in its project with the facility. Some of these elements have been deployed by Certis independently in its prior projects. This is however, the first time that all six elements of the approach are integrated together in a single service delivery. Apart from the Jewel facility, Certis’ other project is with [JTC Corporation](/wiki/JTC_Corporation). With its “Security+” approach, Certis deploys an advanced security operations for JTC’s South-West Precinct. The integrated approach is expected to boost productivity and efficiency for JTC in its operations through the use of technology and a trained, multi-skilled workforce. “Security+” enables JTC to efficiently manage security and surveillance over its multiple properties, as well as reduce the response time to incidents. Deployment of security officers are better optimised as they can be efficiently deployed through activation by the Operations Centre.\n",
  "language": "en",
  "processed_at": "2026-01-12T10:01:10.521230",
  "title": "Certis Group",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Certis_Group"
}