{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:01:20.417352"
  },
  "content": "Building in Changi, Singapore **Changi Cottage** is a historic bungalow on Netheravon Road in [Changi, Singapore](/wiki/Changi). For several months after [Singapore's split from Malaysia](/wiki/Proclamation_of_Singapore), then-[Prime Minister of Singapore](/wiki/Prime_Minister_of_Singapore) [Lee Kuan Yew](/wiki/Lee_Kuan_Yew), lived and worked at the bungalow. ## History The seaside bungalow was built at a cost of $24,943.83 in 1950. Following Singapore's split from Malaysia, then-Prime Minister of Singapore Lee Kuan Yew spent several months living and working at the bungalow. Until the 1980s, the bungalow continued to serve as the holiday home for senior members of the government. In January 1971, Sir [Alec Douglas-Home](/wiki/Alec_Douglas-Home), then the [Foreign Secretary](/wiki/Foreign_Secretary_(United_Kingdom)) of the United Kingdom, was hosted at the bungalow. The building currently stands on the grounds of the Civil Service Club's CSC@Changi Resort. It was renovated and restored. On 22 November 2023, a Node showcasing resources about Lee Kuan Yew that had been installed at the bungalow was unveiled. The Node, which is available only to those staying at the bungalow, was introduced to commemorate Lee's 100th birthday, which fell on 16 September of that year. By then, the bungalow had become one of the most popular chalets in Singapore, having attained a weekend occupancy of 88 per cent in 2023. The [Jelutong](/wiki/Dyera_costulata), which was one of Lee's favourite trees, was planted at the cottage by [Minister-in-charge of Public Service](/wiki/Prime_Minister%27s_Office_(Singapore)) [Chan Chun Sing](/wiki/Chan_Chun_Sing), [National Library Board](/wiki/National_Library_Board) chief executive officer Ng Cher Pong, Civil Service Club executive Charlie Ng and several others. The madagascar almond, tembusu, raintree and sea apple, which were also some of Lee's favourite trees, were also planted within the grounds of the bungalow. The [National Heritage Board](/wiki/National_Heritage_Board_(Singapore)) placed the cottage on the Changi Heritage Trail in April 2024.\n",
  "language": "en",
  "processed_at": "2026-01-12T10:01:20.416922",
  "title": "Changi Cottage",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Changi_Cottage"
}