{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:01:16.305677"
  },
  "content": "Planning Area in East Region, Singapore **Changi** (locally /ˈtʃɑːŋi/ *CHAHNG-ee*) is a [planning area](/wiki/Planning_Areas_of_Singapore) located in the geographical region of [Tanah Merah](/wiki/Tanah_Merah,_Singapore) in the [East Region of Singapore](/wiki/East_Region,_Singapore). Sharing borders with [Pasir Ris](/wiki/Pasir_Ris) and [Tampines](/wiki/Tampines) to the west, [Changi Bay](/wiki/Changi_Bay) to the southeast, the [South China Sea](/wiki/South_China_Sea) to the east and the [Serangoon Harbour](/wiki/Serangoon_Harbour) to the north. It is further divided into the subzones [Changi Airport](/wiki/Changi_Airport), [Changi Point](/wiki/Changi_Point) and [Changi West](/wiki/Changi_Air_Base). Changi, excluding the two water catchments and islands of Singapore, is the largest planning area by land size. Today, Changi is an aviation hub. It is the location of both the [Changi Airport](/wiki/Changi_Airport) and [Changi Air Base](/wiki/Changi_Air_Base). Also located within Changi is Singapore's largest prison, [Changi Prison](/wiki/Changi_Prison). It was used as a [Japanese prisoner-of-war camp](/wiki/List_of_Japanese-run_internment_camps_during_World_War_II) during the [occupation of Singapore](/wiki/Japanese_Occupation_of_Singapore) in [World War II](/wiki/World_War_II). The prison is Singapore's oldest operating internment facility. ## Etymology The early [Malay](/wiki/Malay_language) place name of Changi was Tanjong Rusa (English: Deer cape), as written in the 1604 [Godinho de Eredia](/wiki/Godinho_de_Eredia) map of Singapore. The name Changi was known in the early 19th century. In the 1828 map by Franklin and [Jackson](/wiki/Philip_Jackson_(surveyor)), the extreme southeastern tip of the island is referred to as Tanjong Changi. Vessels using the [Johor Straits](/wiki/Straits_of_Johor) would have to pass by Changi. There are many versions of the etymological roots of the name Changi. The first director of the [Singapore Botanic Gardens](/wiki/Singapore_Botanic_Gardens) [Henry Ridley](/wiki/Henry_Ridley) suggested that it gets its name from a tall tree, *Pokok Chengal* or *Cengal* ([Malay](/wiki/Malay_language) for *[Neobalanocarpus heimii](/wiki/Neobalanocarpus_heimii)*, also known as *Balanscorpus heimii* or *Balano scorpas*), which was common in the area in the early nineteenth century. It is also written and pronounced as \"Chengai\". Its heavy timber is commonly used for buildings and furniture and noted for its strength and deep rich colour. Other sources suggests that it comes from a climbing shrub found in the area, the *changi ular* (*[Hopea sangal](/wiki/Hopea_sangal)*), or *chengal asir* (*Thottea piperiformis*). During the early surveys in the 1820s to 1830s of Singapore island, Changi was also named **Franklin Point** after Captain Franklin who was involved in these early surveys. ## History Early Changi was mostly a [malaria](/wiki/Malaria) [mosquito](/wiki/Mosquito) infested swampland and jungle that had several [kampongs](/wiki/Kampong) spread across the vast area. Several of these kampongs included from north to south, Kampong Changi, Kampong Telok Paku, Kampong Ayer Gemuroh, Kampong Somapah, Kampong Mata Ikan and Kampong Padang Terbakar, although the exact founding dates of many of these kampongs are unknown. The place was first redeveloped by the British as a [summer house](/wiki/Summer_house) and a getaway location from the city centre of Singapore in the 1890s, and was prized for its tranquillity and remoteness. The existence of the resorts there today still bear testament to the original redevelopments there. Starting from the 1920s due to increasing tension across Asia and Europe in anticipation for war, the British starting building up its military presence at the area and this included the construction of military barracks and the infamous [Changi Hospital](/wiki/Changi_Hospital), with Chinese and Indian labourers brought in from the city. Defences along Changi's southern coast were also beefed up with the construction of machine-gun pillboxes in anticipation of the [Imperial Japanese Army](/wiki/Imperial_Japanese_Army) arrival by sea. Construction was briefly halted during the [Great Depression](/wiki/Great_Depression) but was subsequently resumed as these structures were considered vital for the defence of Singapore. During World War II (WWII), the area saw mass mobilisation of Allied troops in anticipation of a Japanese invasion from the north-eastern coasts of Singapore as the Japanese had moved to capture the neighbouring [Pulau Ubin](/wiki/Pulau_Ubin) from Malaysia. However it was a bluff that drew vital resources from the west of Singapore that was the eventual landing site used by the Japanese. The area also saw action of three giant artillery guns called the [Johore Battery](/wiki/Johore_Battery), though their usefulness in defending Singapore has been questionable. In 1942, after the surrender of the British in Singapore, Allied Prisoners-of-Wars (POW) were made to march from the city to [Changi Prison](/wiki/Changi_Prison) and the surrounding barracks where they were interned. The POW Camps were overcrowded and life as described by those who were interned there was unbearable, multiple incidents including the [Selarang Barracks incident](/wiki/Selarang_Barracks_incident) took place. Civilians were also not spared, the [Sook Ching](/wiki/Sook_Ching) massacre which targeted mainly the Chinese population, took place at multiple locations in Changi, most notably at [Changi Beach Park](/wiki/Changi_Beach_Park). Thousands were believed to have been executed in these areas. It was during this time too that the Japanese were also involved in the planning and construction of [Changi Air Base](/wiki/Changi_Air_Base). After the war in 1945, the British continued to maintain Changi for military purposes, while rebuilding up the area to include accommodations, schools and resorts. They continued to do so even after the independence of Singapore in 1965, as with other areas like [Seletar](/wiki/Seletar) and [Tengah](/wiki/Tengah,_Singapore). The coast along the eastern side of Changi also saw government bungalows and resorts opened for civil servants use. In 1971, because of the [East of Suez](/wiki/East_of_Suez) policy that was announced by the British earlier in 1968, there was a sudden and large withdrawal of British troops from Changi. The vacated area saw many people whose livelihood and businesses depended on providing for the British forces becoming jobless and unsustainable. However, there were still contingents of [ANZUK](/wiki/ANZUK) troops that were left in its place and the government of New Zealand even bolstered its presence in Singapore in the wake of the British withdrawal to maintain its interest in the region. The area then later became home to several of [Singapore Armed Forces](/wiki/Singapore_Armed_Forces) units too. Changi was then revitalised with [Changi Village](/wiki/Changi_Village) and Somapah spruced up and Changi Airport being constructed in the area after land reclamation took place. However, this caused further disruptions to the livelihood of the residents as they had to make way for the airport and later the many other redevelopments in the area including high tech industrial estates. Finally in 1989, the last of New Zealand troops withdrew and all its remaining assets were handed over to the Singapore government. Redevelopment works continued into the 21st century with the progressive opening of the airport's terminal 3, 4 in 2008 and 2017, and the new Changi Prison Complex in 2004. Despite the strong progress of these developments, there were several ventures that were eventually stalled, like the Changi Motorsports Hub, which was expected to open as Singapore's first permanent motor racing circuit, but was halted in 2013. Development of Changi is in the pipeline with a mega-sized Terminal 5 and the Changi East Industrial Zone expected to be ready before 2030. ## Geography The terrain in Changi is generally flat because most of Changi today sits on reclaimed land, there are however three notable hills in the Changi Village area, Battery (Biggin) Hill, Fairy Point Hill and Temple Hill. The ground conditions on reclaimed land however were soft [marine clay](/wiki/Marine_clay) which could not support the runway and taxiways of the airport, and thus works had to carried out accordingly to drain the water and strengthen them. There are also two reservoirs located in Changi, the [Changi Creek Reservoir](/wiki/Changi_Creek_Reservoir) and [South End Reservoir](/wiki/South_End_Reservoir) which are located to the north and south of Changi Airport respectively. The Changi [planning area](/wiki/Planning_Areas_of_Singapore) as defined by the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) encompasses the subzone of Changi Airport, Changi Point and Changi West, although in comparison to the parliamentary electoral boundaries or the Changi Estate that is commonly known in public they all differ from one another slightly. ## Amenities There are numerous amenities spread around Changi. They include shopping malls like [Changi City Point](/wiki/Changi_City_Point) and even Changi Airport, which is considered to be a shoppers' paradise with duty-free shopping available inside the airport's transit area. Besides those, the Changi Village hawker centre is renowned for its food options, with shophouses also found around the area for the convenience of its residents. Food and amenity centres are also found all around the industrial estates, including the airfreight centre. Places of worship in the area include Changi Bethany Church, Maranatha Bible Presbyterian Church, Sree Ramar Hindu Temple and Yan Kit Village Chinese Temple. ### Education Currently the [Singapore University of Technology and Design](/wiki/Singapore_University_of_Technology_and_Design) (SUTD), Singapore's fourth autonomous university, is located at its permanent campus in Changi. Otherwise there are presently no public government schools in Changi but there were several that used to operate in its history. Additionally there are also several private and international schools operating in the area like BNP Paribus Campus, One World International School and [Singapore Aviation Academy](/wiki/Singapore_Aviation_Academy). These were the schools that used to operate from Changi and most were cleared away for the construction of Changi Airport. All but one of them are now defunct, namely: - Red Swastika Primary School, from 1951 to 1981, the site was near the present-day junction of Changi Business Park Vista and Changi South Avenue 1, it now stands at Bedok North - Ayer Gemuroh Malay Primary School, from c.1949 to 1975, the site is now occupied by the south portion of Changi Airport - Chong Sing Chinese School, from 1910 to 1974, it was reconstructed in 1941 and the site is now occupied by Singapore Aviation Academy - Jeevanantham Tamil School/ Changi Tamil School, from 1946 to 1974, it was reconstructed twice in 1952 and 1966 with the site situated opposite the Japanese School - Min Chong Chinese School, from 1945 to 1981, it was formed from a merge between Bo Wen, Pei Nan School and was reconstructed in 1948 and 1959, the site was near the present-day junction of Changi Business Park Vista and Changi Business Park Crescent - Padang Terbakar Malay School, from 1883 to 1975, the site was approximately before the ECP slip road on Xilin Avenue - Telok Paku Primary School, from 1951 to 1975, the site is now occupied by the Airline House - Ting Ying Chinese School, from 1933 to c.1973, the site is now occupied by runway 02L/20R of Changi Airport Additionally the British and later the Australian and New Zealand (ANZ) government opened schools for children of servicemen deployed in Singapore: - British Army's Children School (Selarang), from c.1950 to 1971, later converted to ANZ Primary School Selarang, which lasted from 1971 to 1973, the site was near Selarang Camp - Changi Junior and Infant School, until 1971, the site is now occupied by the north portion of Changi Air Base West - RAF Changi Grammar School, from 1963 to 1971, later converted to ANZ High School Changi, which lasted from 1971 to 1973, the site at 1800 Upper Changi Road North is now state property - [The Japanese School Singapore](/wiki/The_Japanese_School_Singapore) (シンガポール日本人学校, **Shingapōru Nihonjin Gakkō**) Changi Campus is located in [Loyang](/wiki/Loyang,_Singapore) on the outskirts of the Changi Estate. ### Leisure There are a number of leisure facilities in Changi, including resorts, nature and sports facilities. Such facilities generally cater to a weekend getaway for Singaporeans. ## Economy ### Airlines Changi Airport is a [hub](/wiki/Airline_hub) for [FedEx Express](/wiki/FedEx_Express), [Qantas](/wiki/Qantas), [Scoot](/wiki/Scoot), [Singapore Airlines](/wiki/Singapore_Airlines), [Singapore Airlines Cargo](/wiki/Singapore_Airlines_Cargo), [Tiger Airways](/wiki/Tigerair) and [Valuair](/wiki/Valuair). These airlines' head offices are located as follows: Singapore Airlines in Airline House, Singapore Airlines Cargo in the SATS Airfreight Cargo Terminal 5, Scoot and Valuair in Terminal 1 of the airport. ### Airport industries The Changi Airfreight Centre (formerly known as Airport Cargo Complex) and the [Airport Logistics Park](/wiki/Airport_Logistics_Park) (ALPS) Terminal are two main facilities that handle the airport-related goods and services daily. This may include inflown and outflown cargo, as well as aeroplane maintenance related services. The [Immigration and Checkpoints Authority](/wiki/Immigration_and_Checkpoints_Authority) (ICA) also maintains its presence there to enforce customs, inspect and even quarantine goods entering Singapore. There are other smaller industries located nearer to the passenger terminals in Changi like the DNATA and SATS Inflight Catering Centre which also cater to the airports' needs, which may include aeroplane food catering, providing manpower and goods for operation as well as the maintenance of the airport itself. By 2030 the construction of Changi East Industrial Zone is also expected to be completed on par with the opening of Terminal 5 to be able to handle the increase in cargo volume. ### Other industries [Changi Business Park](/wiki/Changi_Business_Park) and Changi North Industrial Park are industrial estates located within Changi that have aeroplane related businesses housed in them, like [Collins Aerospace](/wiki/Collins_Aerospace), but the industrial parks also contain many other businesses that are unrelated to the operations of Changi Airport. The businesses there may range from logistical, to electronics and even banking. There is also the [Singapore Expo](/wiki/Singapore_Expo) which provides companies with a place to hold conventions and exhibitions. ## Security Changi, except for its airport, falls under the jurisdiction of the [Bedok Police Division](/wiki/Bedok_Police_Division), and the Loyang Fire Post that is supplemented by the 2nd [Singapore Civil Defence Force](/wiki/Singapore_Civil_Defence_Force) DIV HQ. Immigration and custom controls at all ferry terminals are controlled by ICA. ### Airport The [Airport Police Division](/wiki/Airport_Police_Division) is responsible for the overall security of Changi Airport. It is supported by auxiliary police like [AETOS](/wiki/Aetos_Security_Management), [Certis CISCO](/wiki/Certis_Group) and [SATS](/wiki/SATS_Security_Services) Security, that are usually deployed as front line officers for baggage and personnel screening as well as controlling entry points into transit areas, including the airfreight centre. The airport police is further supported by the [Police K9](/wiki/Police_K-9_Unit_(Singapore)) Changi Base and the 9 SIR infantry soldiers to maintain protection of the airport. ICA works independently from the airport police and maintains control over immigration and customs in all terminals and air cargo entry points. It works with the [Singapore Customs](/wiki/Singapore_Customs) in customs and excise related issues. The airport has its own firefighting and rescue services, the Airport Emergency Service (AES) that operates two fire stations and one fire substation that are located around the airport's runway. It also has two casualty clearance stations and one sea rescue base located at Changi Airport Fuel Hydrant Installation (CAFHI) Jetty. AES operates 18 firefighting vehicles, two hovercraft and two fire boats. ### Military Changi houses several military installations of all three branches of Singapore's defence forces. Installations for the army in the area include Hendon Camp and the [SAF Changi Ferry Terminal](/wiki/SAF_Changi_Ferry_Terminal), while for the air force include, [Changi Air Base](/wiki/Changi_Air_Base) East and West, and finally for the navy include [Changi Naval Base](/wiki/Changi_Naval_Base). With plans to move [Paya Lebar Air Base](/wiki/Paya_Lebar_Air_Base) to Changi come 2030 and as well as the construction of Changi Airport Terminal 5, Changi Air Base is undergoing significant redevelopment works which include the lengthening of the runway. The SAF Ferry Terminal is also the starting point for the famous 24 km route march for new army recruits before they head in the direction of [The Float @ Marina Bay](/wiki/The_Float_@_Marina_Bay) for their passing out parade, besides being the typical connecting point for military personnel travelling between [Pulau Tekong](/wiki/Pulau_Tekong) and Singapore. ### Prison [Singapore Prison Service](/wiki/Singapore_Prison_Service) (SPS) is headquartered in Changi and most of its departments are located in the vicinity of its headquarters, like the Prison Logistics Branch. SPS operates two prisons in Changi, [Changi Prison](/wiki/Changi_Prison) Complex and Tanah Merah Prison School. Changi Prison is the main premises for the incarcerated in Singapore. It is currently operating from a new building site with various clusters that hold offenders of various classification. Additionally, the Tanah Merah Prison School, which took over Kaki Bukit Prison School in 2011, is the only prison school in Singapore, where inmates can sit for either the GCE ['O'](/wiki/Singapore-Cambridge_GCE_Ordinary_Level), ['N'](/wiki/Singapore-Cambridge_GCE_Normal_Level) or ['A'](/wiki/Singapore-Cambridge_GCE_Advanced_Level) Levels Examinations. Besides prisons, Changi also has rehabilitation centres like the Lloyd Leas Community Supervision Centre, which recently saw the nearby Selarang Park Community Supervision Centre being relocated into it so that and the site can be redeveloped to a halfway house. Past prisons and rehabilitation centres in the area include Abingdon Prison/Drug Rehabilitation Centre and Changi Women's Prison. The Changi Women's Prison was merged into the new Changi Prison Complex in October 2017. ## Transportation ### Air Changi is the home of [Singapore Changi International Airport](/wiki/Singapore_Changi_Airport), which is considered to be the leading aviation hub in the region and serves many regional and international destinations. Most of Singapore's international arrival and departure are made via this airport. It is one of two civilian airports in Singapore, the other being [Seletar Airport](/wiki/Seletar_Airport). ### Land #### Bus There are three bus terminals in Changi: [Changi Airport Passenger Terminal Building Bus Terminal](/wiki/List_of_bus_stations_in_Singapore#Changi_Airport_Passenger_Terminal_Building_Bus_Terminal), Changi Business Park Bus Terminal and [Changi Village Bus Terminal](/wiki/Changi_Village#Changi_Village_bus_terminal). ##### Changi Airport Passenger Terminal Building Bus Terminal The main Changi Airport bus terminal is located in the basement of Terminal 2. However all bus services serving this bus terminal, namely 24, 27, 34, 36, 53, 110 and 858 serves the airport’s terminals 1, 2 and 3. Only bus services 24, 34, 36 and 110 operate from Terminal 4 of the airport. Private buses and coaches also operate from the airport via dedicated coach boarding bays, including services such as Transtar Cross Border Service (TS1) to [Johor Bahru](/wiki/Johor_Bahru), Malaysia. ##### Changi Business Park Bus Terminal Changi Business Park Bus Terminal is located north of SUTD. Only two bus services, 47 and 118, serves this bus terminal. However, there are more bus services that ply within the Changi Business Park that do not call at this terminal, which include public bus service 20 and other private bus services. ##### Changi Village Bus Terminal Changi Village Bus Terminal is located adjacent to Changi Village hawker centre. Bus services 2, 29, 59 and 109 operate from this bus terminal. There was previously another bus terminal, the Somapah Bus Terminal located near the present-day Expo. It was opened in 1981 but demolished in 1989 to make way for redevelopments in the Expo area. Its bus services used to serve the east including the newly built Changi Airport which didn't have a bus terminal then. There are many more bus services that ply within the entire Changi Estate. Several notable locations with bus services running to them include the Changi Airfreight Centre, which has services 9, 19 and 89 operating within it. Access to the airfreight centre is restricted and all buses entering the centre are individually checked by auxiliary police officers to ensure that all passengers have valid passes. Commuters wishing to enter the airfreight centre and do not have the required passes are to alight at the Police Pass Office bus stop to obtain their passes. The ALPS Terminal, which is next to the airfreight centre, as well as the Tanah Merah Ferry Terminal are only accessible via bus service 35. However access to both of the locations are not restricted. #### Train Changi is served by 3 MRT stations, [Changi Airport](/wiki/Changi_Airport_MRT_station) on the [East West MRT line](/wiki/East_West_MRT_line), [Upper Changi](/wiki/Upper_Changi_MRT_station) on the [Downtown MRT line](/wiki/Downtown_Line) and [Expo](/wiki/Expo_MRT_station) which is an interchange station for both lines. All of the stations are located in the south or central of Changi, hence there are no MRT stations in the vicinity of Changi Village or the airfreight centre, located in the north. [Xilin MRT station](/wiki/Xilin_MRT_station) is under construction as part of the Downtown line extension and would bring greater connectivity to Changi Business Park when it opens in 2026. There are however plans for the northern part of Changi as well as the upcoming Changi Airport Terminal 5 to be linked via the [Cross Island MRT line](/wiki/Cross_Island_Line) and [Thomson–East Coast MRT line](/wiki/Thomson%E2%80%93East_Coast_Line). Changi Airport is served internally by the [Changi Airport Skytrain](/wiki/Changi_Airport_Skytrain) system that operates between Terminals 1, 2 and 3, both in the transit as well as public areas. Terminal 3 additionally has a Skytrain in the transit area that operates between the ends of the terminal for travellers convenience. The Skytrain is free of charge and is operationally between 5 am and 2.30 am, and at all other times travellers can take shuttle buses or travel on foot between terminals. Terminal 4 does not have a SkyTrain connection and the shuttle bus from Terminal 2 is available as a possible connection. There exists the Changi Railway for a period of time in the 1930s to the 1940s which was used by the British prior to and during World War II, its primary function was to transport ammunition from the piers near Fairy Point Hill to the Johore batteries located around Changi. However they have since been dismantled. #### Road The [East Coast Parkway](/wiki/East_Coast_Parkway) (ECP), [Pan Island Expressway](/wiki/Pan_Island_Expressway) (PIE) and [Tampines Expressway](/wiki/Tampines_Expressway) (TPE) all start from the end of Airport just south of the perimeter of the airport. Airport Boulevard is the only road available for travellers wishing to enter or exit Changi Airport via road and it branches out to all four terminals inside the airport. There are dedicated roads for arrival, departure, coaches, public buses and taxis within each terminal. Taxi surcharge to and from the airport is $3 per ride or $5 per ride on Friday to Sunday, between 5 pm and 12 am. There are three major roads that head to Changi Village: Loyang Avenue and Upper Changi Road North, which is located to the west of Changi Airport, and Tanah Merah Coast Road which is located to the east of the airport. There is no expressway that heads for a similar direction. ### Sea There are multiple points of entry to Singapore via sea. The Changi Ferry Terminal, Changi Point Ferry Terminal, and [Tanah Merah Ferry Terminal](/wiki/Tanah_Merah_Ferry_Terminal) are for civilian use while the CAFHI Jetty, Changi Naval Base, and SAF Changi Ferry Terminal are for private or military use and access is restricted. Destinations reachable from the Changi and Changi Point Ferry Terminals include Tanjung Belungkor on the eastern side of Johor, Malaysia, in addition, bumboat ferries operate to Pulau Ubin only from Changi Point. Batam and Bintan, Indonesia, are reachable via Tanah Merah Ferry Terminal. All civilian ferry terminals are operated locally except for Changi Ferry Terminal which is managed by the Johor Port Authority. #### SAF Changi Ferry Terminal SAF Changi Ferry Terminal, also known as [Singapore Armed Forces](/wiki/Singapore_Armed_Forces) Ferry Terminal (SAFFT), is a [jetty](/wiki/Jetty) that provides ferry services between Singapore's main island and [Pulau Tekong](/wiki/Pulau_Tekong), the site of SAF's [Basic Military Training Centre](/wiki/Basic_Military_Training_Centre). ## Incidents - On 17 March 2012, a Malaysian Indian cleaner was killed when he was hit by a taxi hijacked by a Chinese national at Changi Airport Budget Terminal. Following his death, his widow and children received donations and insurance claims amounting to almost a million dollars. However, two years later it was reported his widow had spent all the money. - On 29 November 2015, 97 passengers aboard a ferry heading from Batam to Singapore were evacuated onto life rafts after their ferry collided with an object in the water at about 7.40pm. However, their life rafts also began taking in water, and they were eventually brought back to the Indonesian shores by villagers' boats. The passengers finally arrived at Tanah Merah Ferry Terminal, their intended location, at 12.20am the next day. - On 21 December 2017, 49 passengers on a ferry from Desaru, Malaysia were stranded at Changi Ferry Terminal for more than two hours after a contractor's barge blocked the jetty. The police had to be called in to help the passengers to disembarking safely. - Singapore portal - [Infrastructure of Singapore Changi Airport](/wiki/Infrastructure_of_Singapore_Changi_Airport) ## Sources\n",
  "language": "en",
  "processed_at": "2026-01-12T10:01:16.305259",
  "title": "Changi",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Changi"
}