{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:01:28.282185"
  },
  "content": "Town Centre in East Region, Singapore **Changi Village** is a modern [village](/wiki/Village) situated at the northern tip of [Changi](/wiki/Changi) which is at the eastern end of [Singapore](/wiki/Singapore). It is the usual connecting point for travellers heading to [Pulau Ubin](/wiki/Pulau_Ubin) or Malaysia by ferry. Fishermen in the [kelongs](/wiki/Kelong) located in the Serangoon Harbour offshore also use this jetty as a drop off point to come onto mainland. Changi Village also has many resorts and leisure facilities to cater for a weekend getaway for many Singaporeans. The area is classified by Urban Redevelopment Authorities as under the [planning area](/wiki/Planning_Areas_of_Singapore) of Changi and in the subzone of Changi Point. It is also classified under District 17 for property indexing. ## History Changi Village has its early beginnings as a kampong village. The place was first redeveloped by the British as a [summer house](/wiki/Summer_house) and a getaway location from the city centre of Singapore, in the 1890s, and was prized for its tranquillity and remoteness. The existence of the resorts there today still bear testament to the original redevelopments there. Starting from the 1920s, the British started building up Changi as tension across Asia and Europe started to build in anticipation for war. The infamous old [Changi Hospital](/wiki/Changi_Hospital) was also built there as a result. During World War II, the place saw mass mobilisation of Allied troops in anticipation of the possible landing and invasion by the [Imperial Japanese](/wiki/Imperial_Japanese_Army) troops who landed on the nearby Pulau Ubin. However the manoeuvre by the Japanese was a bluff that drew vital Allied troops from the West of Singapore that eventually was the landing site of the Japanese troops. The area as part of the greater Changi defence also saw action of 3 giant artillery guns, also known as the Johore battery, used in the defence of Singapore. Their use and effectiveness in the defence of Singapore has often been controversial. The [Sook Ching](/wiki/Sook_Ching) massacre took place throughout the war at the neighbouring [Changi Beach Park](/wiki/Changi_Beach_Park). After the war, the British rebuilt the area to become both a resort and an accommodation for [ANZUK](/wiki/ANZUK) soldiers and their families as they continued to maintain military facilities in the nearby Changi Camp. In the 1970s, after the independence of Singapore, the land around Changi was redeveloped for the construction of the Changi Airport. The HDB started building low-rise flats at Changi Village after the land clearance. Changi Village was then spruced up and amenities like the bus terminal were built. In 1997 the operations of the old Changi Hospital was moved to the new [Changi General Hospital](/wiki/Changi_General_Hospital) at Simei. The [Government of Singapore](/wiki/Government_of_Singapore) has pledged in 2005 that they would try to revive the \"[ghost town](/wiki/Ghost_town)\". As of 2014 the place is on track to being a hub for recreational activities as resorts and clubs in the area are undergoing refurbishment and tender for leisure and food and beverage operators are being rolled out. Despite the recent redevelopments, Changi Village continues to be relatively laid back compared to the rest of Singapore. ## Amenities ### Education There are currently no public government schools located in Changi Village and there were not known to be any throughout its history. However, the [BNP Paribas](/wiki/BNP_Paribas) Campus, the first training institute in the [Asia-Pacific region](/wiki/Asia-Pacific) that seeks to train employees in the region, is located in Changi Village. [Singapore Aviation Academy](/wiki/Singapore_Aviation_Academy) has operated here since 1992. ### Changi Village Hawker Centre There is a [hawker centre](/wiki/Hawker_centre) located here and it is right next to the bus and ferry terminals. The hawker center is famous for its [nasi lemak](/wiki/Nasi_lemak) stall, where long queues are often seen. Stalls selling delicious wanton (fried fritters) which are recommended by many television programs and companies are also available here. Many residents living in the nearby estates of [Pasir Ris](/wiki/Pasir_Ris), [Tampines](/wiki/Tampines) and [Simei](/wiki/Simei) drive to Changi Village for drinks in the evening. Many of the coffeeshops are open till past midnight every day. In June 2012, the centre was closed for renovations. It has since reopened and business appears to be going very well, as of August 2014. There is a great variety of food to choose from at the hawker stalls. ### Hotels and Resorts There are many chalets, hotels and resorts in the area namely: - Aloha Changi Resorts (which include Fairy Point Bungalows and Chalets) - [The Bus Collective](/wiki/The_Bus_Collective) - Changi Beach Club - Changi Cove - Changi Golf Club - Changi Sailing Club - Changi Village Hotel - Civil Service Club @ Changi - Hendon Hotel (Not opened yet) - Raintr33 Hotel - SAF Holiday Chalet (which include SAF Seaview Resort and Treehouse Villas @ Changi) There are also a couple of places to stay overnight on the neighbouring Pulau Ubin island namely: - Celestial Ubin Beach Resort - Various camping sites on the island ### Leisure The Changi Golf Course has two separated ranges at the area. At the east end of Changi Village there is a [People's Association](/wiki/People%27s_Association) Water Venture that offers kayaking courses and rentals. While near the west end there is the [Changi Sailing Club](/wiki/Changi_Sailing_Club) that offers sailing courses. [Changi Beach Park](/wiki/Changi_Beach_Park) is place where many families gather over the weekend for a picnic with a view of the nearby islands. There is also a boardwalk that runs along the coastline of Changi Village for visitors to enjoy the scenery. ### Others The Changi Park Connector which runs through the estate connects Changi Beach Park with [Pasir Ris Park](/wiki/Pasir_Ris_Park). At the other end of Changi Beach Park there is the Coastal Park Connector which runs all the way to the [East Coast Park](/wiki/East_Coast_Park). Places of worship in the area include the Maranatha Bible Presbyterian Church and Sree Ramar Hindu Temple. The area falls under the jurisdiction of the [Bedok Police Division](/wiki/Bedok_Police_Division) and the 2nd [Singapore Civil Defence Force](/wiki/Singapore_Civil_Defence_Force) DIV HQ. ## Transportation There are no MRT stations in the near vicinity of the area. ### Changi Village Bus Terminal Changi Village Bus Terminal was opened in 1975 to take over operations from the former smaller road side *Changi Point Bus Terminal*. It was built over the site of the former Changi Cinema. The bus terminal comprises a small boarding and alighting berth area for bus services that is directly adjacent to the hawker centre. The bus terminal continues to be operated by [SBS Transit](/wiki/SBS_Transit) despite its close location to the areas where [Go-Ahead Group](/wiki/Go-Ahead_Singapore) bus services operate. [Bus services 2, 29, 59 and 109](/wiki/List_of_bus_routes_in_Singapore) operate from the terminal and head towards [Kampong Bahru Bus Terminal](/wiki/Kampong_Bahru_Bus_Terminal), [Tampines Bus Interchange](/wiki/Tampines_Bus_Interchange), [Bishan Bus Interchange](/wiki/Bishan_Bus_Interchange), and [Serangoon Bus Interchange](/wiki/Serangoon_Bus_Interchange) respectively. Service 2 additionally goes to every MRT station on the [East West line](/wiki/East_West_MRT_line) between [Tanah Merah](/wiki/Tanah_Merah_MRT_station) and [Bugis](/wiki/Bugis_MRT_station). There are more bus services that ply Loyang Avenue which lies directly south of the area, these services are [9, 19 and 89](/wiki/List_of_bus_routes_in_Singapore) which originate from the Changi Airfreight Centre. ### Changi Point Ferry Terminal A [ferry terminal](/wiki/Ferry_terminal), named *Changi Point Ferry Terminal*, is located here. There are small passenger ferries which lead to the north-eastern islands (e.g. [Pulau Ubin](/wiki/Pulau_Ubin)) and also to some destinations in [Johor](/wiki/Johor), [Malaysia](/wiki/Malaysia). The popular bumboat ferry ride to Pulau Ubin costs S$3 each way and takes around 15 minutes. Usually there is a short wait until each bumboat ferry has 12 passengers. Passengers arriving via ferry to this terminal have to undergo security screening of personnel and baggage from whichever location they are arriving from (including [Pulau Ubin](/wiki/Pulau_Ubin)) for security reasons. 1°23′N 103°59′E﻿ / ﻿1.383°N 103.983°E﻿ / 1.383; 103.983\n",
  "language": "en",
  "processed_at": "2026-01-12T10:01:28.281729",
  "title": "Changi Village",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Changi_Village"
}