{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:01:19.000855"
  },
  "content": "Planning Area in East Region, Singapore **Changi Bay** is a [planning area](/wiki/Planning_Areas_of_Singapore) located in the geographical region of [Tanah Merah](/wiki/Tanah_Merah,_Singapore) in the [East Region](/wiki/East_Region,_Singapore) of Singapore. The planning area is bordered by [Changi](/wiki/Changi) to the west and the [South China Sea](/wiki/South_China_Sea) to the east, north and south. This planning area also includes the South China Sea island of [Pedra Branca](/wiki/Pedra_Branca,_Singapore). The area encompasses 1.7 km2 and, with the exception of Pedra Branca and the South Ledge rock formation, consists entirely of [reclaimed land](/wiki/Land_reclamation). Despite its remote location, it contains installations like the [Changi Naval Base](/wiki/Changi_Naval_Base), Navy Museum and SAF Yacht Club (Changi). There are no residents permanently living in the area, nor is there any plan for permanent residential settlement in that area. There is only one public transport option in the area, which is bus service 35. The Coastal Park Connector which connects [East Coast Park](/wiki/East_Coast_Park) to [Changi Beach Park](/wiki/Changi_Beach_Park) cuts through and runs along almost the entire perimeter of the area. Access to the two offshore islands is restricted. Since 2022, further land reclamation work to add an additional 9 km2 of land off the eastern coast of Changi Bay has been happening; it is targeted to be completed in 10 years. ## Incidents Tanah Merah Coast Road and the now-defunct Changi Coast Road are road stretches notorious for numerous vehicle accidents; motorists have been known to speed up along the two roads due to their length and straightness. In 2018, the traffic police announced plans to install new-generation average speed cameras along a stretch of Tanah Merah Coast Road that took down the time and distance travelled by a vehicle to calculate its average speed. - [Planning Areas of Singapore](/wiki/Planning_Areas_of_Singapore) This [Singapore](/wiki/Singapore) location article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T10:01:19.000413",
  "title": "Changi Bay",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Changi_Bay"
}