{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:01:30.565646"
  },
  "content": "Singaporean forensic pathologist (1934–2000) **Chao Tzee Cheng** ([Chinese](/wiki/Simplified_Chinese_characters): 赵自成; [pinyin](/wiki/Pinyin): *Zhào Zìchéng*; 22 September 1934 in [Hong Kong](/wiki/Hong_Kong) – 21 February 2000 in [New York City](/wiki/New_York_City)) was a renowned [forensic pathologist](/wiki/Forensic_pathology) in [Singapore](/wiki/Singapore). Chao was respected for solving several [notorious crimes in Singapore](/wiki/List_of_major_crimes_in_Singapore), and raised Singapore's level of professionalism in the area of [forensics](/wiki/Forensics). ## Biography ### Early life and education Chao Tzee Cheng was the son of a professor in [cultural studies](/wiki/Cultural_studies) and a [school principal](/wiki/School_principal). Of [Cantonese](/wiki/Cantonese_people) origin, he later migrated to Singapore with his parents and received his [education](/wiki/Education) at [Catholic High School](/wiki/Catholic_High_School_(Singapore)) and Victoria Continuation School. Although offered a [scholarship](/wiki/Scholarship) to read [engineering](/wiki/Engineering) in the [United States](/wiki/United_States), he decided to take up [medicine](/wiki/Medicine) at [University of Hong Kong](/wiki/University_of_Hong_Kong). After graduating with an [MBBS](/wiki/MBBS) in Hong Kong in 1961, Chao returned to Singapore to serve as a [medical officer](/wiki/Physician). Chao also took a [Diploma](/wiki/Diploma) in [Clinical Pathology](/wiki/Clinical_Pathology) in 1967, followed by a Diploma of [Pathology](/wiki/Pathology) in 1968 and a Diploma of [Medical Jurisprudence](/wiki/Medical_Jurisprudence) in 1968. However, a [car accident](/wiki/Car_accident) in [West Malaysia](/wiki/West_Malaysia) left him with a weakened right arm and dashed his hopes of a career in [surgery](/wiki/Surgery). Unfazed, Professor Chao turned to a career in pathology. By 1968, Chao qualified as a [pathologist](/wiki/Pathologist), obtaining his specialised skills from the [Royal London Hospital](/wiki/Royal_London_Hospital), Medical College, currently under the [Queen Mary, University of London](/wiki/Queen_Mary,_University_of_London). Chao married Joyce Wong Yoke Choy in 1963. They had one son Dr Alexandre Chao (born 1966), who succumbed to [SARS](/wiki/SARS) in 2003, and two granddaughters. ### Career Upon his return to Singapore, Chao was appointed the forensic pathologist at the Department of Pathology in the [Ministry of Health](/wiki/Ministry_of_Health_(Singapore)). Almost immediately, Chao was involved in his first case as a pathologist. He was invited to be an [expert witness](/wiki/Expert_witness) in the [murder](/wiki/Murder) case of Koh Liang Chuen in 1969. The notoriety of this case raised Chao's standing as a forensic expert in the region. His forensic expertise and duties extended beyond Singapore to countries like [Malaysia](/wiki/Malaysia), Hong Kong and even certain states of [West Africa](/wiki/West_Africa). In his [career](/wiki/Career), Chao performed over 25,000 [autopsies](/wiki/Autopsies) and was the authoritative expert witness in many unsolved murder cases worldwide. His forensic capability was demonstrated in the investigation of mass [disasters](/wiki/Disaster) such as the [Spyros blast](/wiki/Spyros_blast), the [Singapore Cable Car tragedy](/wiki/Singapore_Cable_Car_tragedy), the [Hotel New World disaster](/wiki/Hotel_New_World_disaster) and the [SilkAir Flight 185](/wiki/SilkAir_Flight_185) [tragedy](/wiki/Tragedy_(event)). He also helped solve notorious crimes in the annals of Singapore [criminal law](/wiki/Criminal_law), such as the [Adrian Lim](/wiki/Adrian_Lim) cult murders, the [John Martin Scripps](/wiki/John_Martin_Scripps) body parts murders, the [Bulgarian girl murder](/wiki/Murder_of_Iordanka_Apostolova) and the [Flor Contemplacion](/wiki/Flor_Contemplacion) case. He was nicknamed the \"[Justice](/wiki/Justice) of Murder\" by his associates for his uncanny ability to solve murder cases. Additionally, Chao was the final speaker and medical adviser of State Coroner Lim Keng Seong during a 1988 coroner's inquiry into the [death of Chong Yun Jing](/wiki/Death_of_Chong_Yun_Jing), who died of [meningitis](/wiki/Meningitis) that arose as a complication of the brain surgery she underwent three months before her death. Despite the [political](/wiki/Political) [sensitivities](/wiki/Sensitivity_(human)) of several of his cases, Professor Chao remained [objective](/wiki/Objectivity_(philosophy)) and presented the [facts](/wiki/Fact) as he knew them. He was also known to stand for justice, no matter which side of the fence it stood on. For example, in 1975, he testified as an expert witness for the [defence](/wiki/Defense_(legal)) at the [Kuala Lumpur](/wiki/Kuala_Lumpur) [High Court](/wiki/High_Court_of_Malaya) [trial](/wiki/Trial) of Hugh Ashley Johnston for the murder of his wife. In the end, a six-to-one [jury](/wiki/Jury) [verdict](/wiki/Verdict) held that Johnston had no intention to kill his wife. Chao served in various capacities, including the Master of the Singapore Academy of Medicine (1992–1995), and President of the Singapore Society of Pathology (1987–1990). He also founded the Medico-Legal Society, and served as its President from 1985 until his death in 2000. In 1999, Chao co-[authored](/wiki/Author) a book with Audrey Perera entitled *Murder Is My Business*, which documented some of his better-known cases. ### Death Chao died in his sleep on a visit to his sister in New York on 21 February 2000. At the time of his death, Chao was holding posts in the Institute of Science and Forensic Medicine, Ministry of Health, [National University of Singapore](/wiki/National_University_of_Singapore) and [Singapore General Hospital](/wiki/Singapore_General_Hospital) in Singapore. In memory of him, the National University of Singapore has set up the Chao Tzee Cheng Professorship in Pathology and Forensic Science. ## Honours For his services to Singapore, Chao was awarded the [Public Administration Silver Medal](/wiki/Public_Administration_Medal) in 1975, Gold Medal in 1979 and the Meritorious Medal in 1995. ## List of cases solved by Professor Chao ### The case of Mimi Wong On 6 January 1970, 31-year-old dance hostess [Mimi Wong Weng Siu](/wiki/Mimi_Wong_Weng_Siu) (黄婉秀) and her 37-year-old ex-husband and sweeper [Sim Woh Kum](/wiki/Sim_Woh_Kum) (冼松锦) murdered 33-year-old Ayako Watanabe, who was the wife of Wong's Japanese lover Hiroshi Watanabe. The murder was witnessed by the Watanabes's 9-year-old eldest daughter Chieko (Chieko would later become the prosecution's main witness against the couple), who came together with her mother and two siblings to Singapore to visit her father. Hiroshi, an engineer, who had an affair with Wong for 3 years and gotten disapproval from his wife regarding the issue, wanted to end the affair with Wong, who was not willing to. Filled with jealousy, Wong then asked for help from Sim, with whom she bore two sons, to help her in the murder. While he was conducting an autopsy on her, Professor Chao found two knife wounds on Ayako Watanabe's neck, and one to her abdomen, along with a few others. Chao also made a certified finding that the woman died around 5 to 6 minutes after the fatal wounds were inflicted on her. At the trial, both Wong and Sim (who initially admitted to his participation in the killing) pointed fingers at one another, with Wong even putting up a defence of diminished responsibility, with her psychiatrist Dr. Wong Yip Chong claiming that she caught the Japanese encephalitis virus from Hiroshi Watanabe and thus suffered from a viral brain infection at the time of the killing. However, she was found to be not suffering from any diminished responsibility by the prosecution's psychiatric expert. After a trial lasting 26 days, on 7 December 1970, both Mimi Wong and Sim Woh Kum were found guilty of murder and condemned to hang for murdering Ayako Watanabe. Their subsequent appeals against the sentence and pleas for presidential clemency were later rejected. On the morning of 27 July 1973, the couple were executed in Changi Prison. Mimi Wong was the first woman to be sentenced to death for murder in Singapore. ### 1972 Pulau Ubin Murder On the night of 22 April 1972 at [Pulau Ubin](/wiki/Pulau_Ubin), 25-year-old Harun bin Ripin (also named Harun bin Ariffin in some newspaper reports) and 19-year-old [Mohamed Yasin bin Hussin](/wiki/Mohamed_Yasin_bin_Hussin) barged into the home of 58-year-old Poon Sai Imm and robbed her. During the robbery, when Harun went around the house to look for valuables to steal, Yasin was restraining the victim and Poon died during the struggle. The two men proceeded to dispose the body into the sea before returning to the mainland, but the body was unexpectedly fished out from the sea by a fisherman the following morning. Nine months later, when he was arrested for another crime, Harun surprised his interrogators by confessing to them about his involvement in the robbery. This confession led to Yasin's arrest, and the two men were charged with the murder of Poon Sai Imm. Professor Chao found that there were nine fractures found on Poon's ribs, which were caused by Yasin while he was restraining and sitting on top of her, which led to her heart stop beating. There were also injuries found by Chao on the vaginal area and thighs of the victim, proving that Yasin had pried open her legs and proceeded to rape her during the restraining of the victim. At the end of their trial on 15 March 1974, Harun was found guilty of robbery by night and sentenced to 12 years' jail and 12 strokes of the cane, while Yasin was found guilty of murder and sentenced to death. Although Yasin's appeal against his sentence was rejected by the [Court of Appeal](/wiki/Court_of_Appeal) in November 1974, his appeal to the [Privy Council](/wiki/Judicial_Committee_of_the_Privy_Council) in London was accepted and he was sentenced to 2 years' jail for committing a rash or negligent act not amounting to culpable homicide. However, Yasin was brought back to court again and promptly charged with rape. At the trial on 11 May 1977, Yasin denied raping the elderly woman despite the forensic evidence presented by the prosecution and Harun's testimony against him. At the end of the trial on 12 May 1977, Yasin was found guilty of attempted rape and he was sentenced to 8 years' imprisonment. ### Murder of policeman Lee Kim Lai On 25 April 1978, 18-year-old police national serviceman Lee Kim Lai was abducted by three men from his sentry post at [Mount Vernon](/wiki/Mount_Vernon,_Singapore) and forced into a taxi. The trio, armed with knives, killed him for his service revolver and also killed the taxi driver Chew Theng Hin. Professor Chao Tzee Cheng found a total of 15 stab wounds on Lee, and he certified that the policeman died from two fatal stab wounds to the neck. The driver Chew Theng Hin's death was due to him being fatally stabbed as well. Just on the same night when the policeman was murdered, a police officer named Siew Man Seng had seen two of these abductors behaving suspiciously around the area where the trio abandoned the taxi; deciding not to return home, he went out of his car and gave chase to the two men, managing to arrest 20-year-old Ong Hwee Kuan (the other man was 20-year-old Yeo Ching Boon) and bring him back for questioning. At the same time of Ong's arrest, Lee's body was found inside the abandoned taxi, and there were 15 stab wounds on his body. Later on, the next day, the corpse of 60-year-old Chew was also found in a drain, further linking Ong to the double murder. Yeo was later arrested in his flat and the revolver was recovered, together with some bullets. The third accomplice of the crime, 20-year-old Ong Chin Hock, surrendered himself soon after. The three men were eventually convicted of murder on 23 May 1979, and sentenced to death. They were hanged on 24 February 1984. ### The death of Kalingam Mariappan On 20 September 1981, 22-year-old lorry driver Ramu Annadavascan and his 16-year-old friend and news vendor Rathakrishnan Ramasamy assaulted 45-year-old boilerman Kalingam s/o Mariappan with a rake. The assault ensued from an argument between both Ramu and Kalingam, and this led to Ramu stopping his lorry at [East Coast Park](/wiki/East_Coast_Park) to assault Kalingam together with Rathakrishnan. The two men each took turns to inflict a blow on Kalingam with the rake; the second blow, which was inflicted by Rathakrishnan, was revealed to be fatal according to autopsy reports presented by Professor Chao at the trial. As a result of his injuries, Kalingam lost consciousness and fell onto the grass. Afterwards, the two then proceeded to pour petrol onto him, and set fire on him, causing Kalingam to be burned to death. Both were later found guilty of murder in July 1984; Ramu was condemned to death and he headed to the gallows on 19 September 1986, while Rathakrishnan, who was under the age of 18 when he committed the murder, was spared the gallows and detained indefinitely at [the President's Pleasure](/wiki/The_President%27s_Pleasure_(Singapore)). After serving nearly 20 years in prison, Rathakrishnan was released in September 2001. ### Andrew Road triple murders On 23 July 1983, [Sek Kim Wah](/wiki/Sek_Kim_Wah), a 19-year-old [conscript](/wiki/National_service_in_Singapore), broke into the home of businessman Robert Tay Bak Hong at Andrew Road on 23 July with the aid of his accomplice, 19-year-old Malaysian [Nyu Kok Meng](/wiki/Nyu_Kok_Meng). They were armed with a rifle Sek had stolen from Nee Soon camp. All five victims: Tay, his wife, their Filipino maid, Tay's daughter and her tutor were confined to a bedroom. They proceeded to rob Tay's family of their jewellery and cash out money from their bank accounts. While Nyu was guarding the victims, Sek decided to murder all five victims by escorting them one-by-one out of the bedroom in a bid to erase witnesses. Sek proceeded to struck Tay and his wife with a chair and strangled them. Sek also strangled their maid. Nyu discovered Sek's murder intentions only when he caught him in the act in another room. Fearing that Tay's daughter and her tutor would be next, Nyu carried the rifle with him and locked the bedroom door upon dashing in. When Sek's repeated requests to open the door was denied by Nyu, Sek immediately fled. Nyu then released Tay's daughter and her tutor. Nyu fled to Malaysia before he surrendered and was extradited to Singapore. Sek was arrested at his sister's home on 29 July, where he attempted suicide when police were closing in on him. Professor Chao, who conducted the autopsy on all three victims, testified that Robert Tay was strangled but the cause of death were the skull fractures resulting from Sek using the chair to bash his death. He said the two female victims died from strangulation; especially for Tay's wife, Chao said that she was already dead when Sek used the chair to bludgeon her head. Nyu was later acquitted of murder, but charged with armed robbery and sentenced to life imprisonment and 6 strokes of the cane. Prior to the Andrew Rd triple murders, Sek had also murdered two other people in [Marine Parade](/wiki/Marine_Parade) by strangling them before disposing their bodies near [Seletar Reservoir](/wiki/Seletar_Reservoir) on 30 June. Sek was found guilty of murder and eventually, he was hanged on 9 December 1988 for the murder of all five victims. ### 1983 Ang Mo Kio triple murder Known as the Ang Mo Kio triple murder, in a flat where he rented a room, 30-year-old Michael Tan Teow, together with his 26-year-old friend Lim Beng Hai, robbed and murdered Tan's 28-year-old landlady Soh Lee Lee and her two children – 3-year-old Jeremy Yeong and 2-year-old Joyce Yeong. The two men, who were drug addicts, tried to pin the blame on one another for the killings, but nevertheless, both men were convicted of murder and sentenced to death on 10 April 1985. Their subsequent appeals against the death sentence were dismissed. Tan later committed suicide by consuming an overdose of sleeping pills in May 1990, while Lim was eventually hanged on 5 October 1990. Professor Chao stated in the trial of the two men that the mother was stabbed on the neck while she was kneeling down and did not run into the knife, while the daughter was stabbed nine times on the back. The son was pinned down by one of the men and killed by a fatal stab wound to the neck, and from the blood splatters, he was not standing when he was killed. This testimony and autopsy result contradicted the account of the two men who gave entirely different accounts of how the victims were killed and became the factor that led to the guilty verdict of death by the High Court. ### *Public Prosecutor v Teo Boon Ann* On 31 October 1983, 23-year-old temple medium [Teo Boon Ann](/wiki/Teo_Boon_Ann) had brutally murdered 66-year-old Chong Kin Meng in her home while planning to commit robbery. Police investigations led to Teo's arrest some time after the murder (with the help of the fingerprints from a wedding card found at the scene of the crime), and he was then charged with murder. At the trial, Teo denied the murder allegation, stating he was only intending to rob Mdm Chong, and when his plot was discovered, Chong, who turned aggressive and tried to attack him upon the discovery of his attempted robbery; Teo also claimed, at that point, he had to act in self-defence and unintentionally caused Chong's death while engaging in a sudden fight with the elderly woman. However, the abundance of incriminating evidence, especially the autopsy results of Professor Chao Tzee Cheng and the diary entry of Teo's girlfriend, detailing him fruitlessly trying to convince his girlfriend to help him in the robbery and to murder the elderly woman if their plot was discovered, had led to Teo's defence of a sudden fight failing to raise a reasonable doubt over the prosecution's case. As such, Teo was found guilty of murder and sentenced to death on 4 February 1987. Teo lost his appeal against his sentence on 16 August 1988 and he was eventually hanged on 20 April 1990. In his testimony, Professor Chao stated that from the injuries he found on the elderly victim Chong Kin Meng, the harm caused by Teo was excessive for self-defence since the age of the victim and her physique would not have made Teo felt threatened on his life and having to cause grievous hurt on the victim if she really attacked him. The lack of defensive wounds on Lim also further disputed the defence of sudden fight. Furthermore, the older woman was hit several times with great force on her head and there were injuries on her fingers resulting from her trying to ward off the blows, and there were signs of strangulation on the victim, which suggested the cruel manner of Teo's attack on Chong. ### Murder of schoolgirl Liang Shan Shan On 2 October 1989, a 17-year-old student from [Mayflower Secondary School](/wiki/Mayflower_Secondary_School), [Liang Shan Shan](/wiki/Liang_Shan_Shan) (also named Leong San San in initial newspaper reports), was reported missing by her parents. She was last seen at her school, boarding her school bus at 1 pm. 12 days later, her highly decomposed body was discovered by NS servicemen undergoing their training exercises at [Yishun Industrial Park](/wiki/Yishun). Professor Chao Tzee Cheng, who conducted the autopsy on the girl's corpse, could not ascertain the cause of death: he could not tell whether it was a suicide, murder or accident due to the state of decomposition, some body parts were missing and the injuries he found on the skull and ribs were not sufficient to cause death. Nevertheless, the police investigations narrowed down to one suspect: Liang's 35-year-old school bus driver Oh Laye Koh. Oh was then charged with her murder, purely based on circumstantial evidence. He was initially acquitted of her murder at the end of his trial in 1992; however, the prosecution appealed against his acquittal, pointing out how Oh, despite his insistence that he did not kill Liang or know her whereabouts, was able to lead police to the place where Liang's bag and books were, which was some distance away from where her body was found; Oh claimed he went to fix his brakes at 1 pm when the girl was last seen alive, but it was found that he went there at 9 am; and lastly, the school bus driver even contacted and tried to convince the witnesses to testify on his behalf that they did not see his school bus that day. The appeal was accepted, and the re-trial started on 27 April 1994. Oh Laye Koh chose to remain silent when he was told to make his defence. At the end of Oh's re-trial on 3 May 1994, [Judicial Commissioner](/wiki/Judicial_Commissioner) Amarjeet Singh concluded from Oh's decision to remain silent and also his failure to provide evidence \"arose from a consciousness of guilt in the face of the circumstantial evidence\". In JC Singh's words, he said to Oh in his verdict, \"I am constrained to draw an irresistible inference that you were the last person with the deceased and you had intentionally caused her death and that the deceased's death was not suicidal or accidental. Although the prosecution was unable to identify the unlawful act, it is not necessary, in my opinion, always to do so.\" As such, JC Singh found Oh guilty and sentenced him to death for the murder of Liang Shan Shan. Oh Laye Koh's appeal against his conviction was dismissed on 29 June 1994, and he was hanged on 19 May 1995. ### The death of Lim Kar Teck On 3 December 1989, 52-year-old brothel owner Lim Kar Teck (also spelt Lim Kar Tek in some sources) was found dead in a room of the brothel in Lorong 6, Geylang. His naked body was found bound and gagged. Lim suffocated when a towel was tied tightly round his mouth, which pushed his tongue back, blocking the air passage. Professor Chao testified in court that this was the cause of Lim's death, and additionally stated that from his experience, it was unlikely that the gagging would be due to intentional homicide but more likely to shut the victim up. Two people were responsible for Lim's death: 23-year-old Karnan Arumugam and 18-year-old Kalaichelvan Ramakrishnan. Karnan was later arrested and charged with murder, while Kalaichelvan has fled Singapore after committing the crime. Karnan alleged that Lim had tried to molest him and his friend and this led to the killing. On 16 October 1992, Karnan's murder charge was amended to one of wrongful confinement and another of causing grievous hurt. He was sentenced to 3 years' jail and 6 strokes of the cane. After spending 19 years on the run in Malaysia, in November 2008, Kalaichelvan Ramakrishnan, who was 37 years old and full of remorse over the incident throughout these years, surrendered himself to the police. Initially charged with murder, Kalaichelvan was later granted a discharge not amounting to an acquittal for causing Lim's death. Even though he no longer faced the murder charge, Kalaichelvan was charged with failing to serve his compulsory 2-year [National Service](/wiki/National_Service_in_Singapore) (NS), which made him liable to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 3 years or both. ### Murder of Tan Heng Hong Between 4 December 1993 and 19 January 1995, 26-year-old security guard [Maniam Rathinswamy](/wiki/Maniam_Rathinswamy) and his accomplice [S. S. Asokan](/wiki/S._S._Asokan), were both sentenced to death for the murder of illegal moneylender Tan Heng Hong. Some time in November 1992, both Maniam and Asokan murdered Tan and drove Tan's car to [Mandai](/wiki/Mandai), burning it together with Tan's corpse. Despite the charred remains, Tan's identity was ascertained, as well as the cause of death: Professor Chao Tzee Cheng identified that the cause of Tan's death was a cut artery on his neck (possibly by an axe or any other weapon) and that he did not die in the fire. He said that there were little amount of soot particles found in the lungs, which meant that he was already dead by the time the two men set fire on him Maniam, who was eventually arrested and charged in January 1993, claimed at the trial that on the night of Tan's murder, while the three of them were arguing violently over a failed deal to purchase gold, Asokan became so agitated that he picked up an axe which Maniam bought the day before to kill Tan, and it was Asokan's idea to burn the corpse, proclaiming his innocence and he himself was forced to help dispose the corpse out of fear. However, Asokan, who was arrested in Malaysia and got extradited back to Singapore to face trial, stated that Maniam told him to grab the axe and kill Tan when he refused to pay the commission, saying that he did not mean to hit or kill him, and that he was only following Maniam's orders. However, the judge rejected their defences and stated that if they had no intention to kill, the weapons would not have been brought in the first place, and decided that they both shared a common intention to murder Tan, therefore both of the men were convicted as charged and sentenced to death. The two men were eventually hanged on 8 September 1995. ### The Bulgarian murder A [Bulgarian](/wiki/Bulgaria) student, 26-year-old [Iordanka Apostolova](/wiki/Murder_of_Iordanka_Apostolova), was involved in an argument with 22-year-old Shaiful Edham Adam at a housing unit in Depot Road. Using a parang, Shaiful chopped Ms Apostolova's throat with a parang together with the help of his friend, 26-year-old Norishyam Mohamed Ali who held down the victim. Shaiful's wife, Hezlinda A Rahman together with the two of them help to dispose her body at a canal near Tanah Merah Ferry Road. Her body was discovered on 13 January, which led to the arrest of Shaiful and Hezlinda. Norishyam surrendered to the police shortly after. Professor Chao Tzee Cheng, in his autopsy, found that there were four wounds on the victim's neck, and a few more at her abdomen and thigh and a few more. He stated that the wounds would have cause slow bleeding, which could lead to a slow, painful death. However, Chao added that he found some water in Apostolova's lungs, meaning that she was still alive when she was dumped into the water, and having breathed in water, it escalated into a speedier death in Apostolova's case. Both Shaiful and Norishyam were in the end found guilty of murder and sentenced to death on 14 August 1998. They lost their appeals in January 1999 and both men were hanged on 2 July 1999. Hezlinda, with whom Shaiful had a child, was sentenced to 6 years' imprisonment for helping to dispose Ms Apostolova's body, as well as failing to report the murder to the police. ### The Rolex watch murder On 20 April 1998, a Malaysian freelance assistant cameraman and prop assistant named Jonaris Badlishah killed 42-year-old make-up artist [Sally Poh Bee Eng](/wiki/Rolex_watch_murder) over a Rolex wrist watch; he used a hammer to hit her over 10 times. Jonaris, who was a nephew of the [Sultan of Kedah](/wiki/Sultan_of_Kedah) and was thus also known as \"[Tengku](/wiki/Tengku) Jonaris Badlishah\" in news reports, was charged with murder. Professor Chao discovered a broken skull on Poh's head and there were fractures on her - the longest was measured 13 cm long. He said the extent of the injuries were such that even if the doctors were at the scene, they were unable to revive her. The wrists of Poh were found to be slit. In the trial, while putting up his defence, Jonaris claimed that he was suffering from depression at the time of the killing and before the killing, claiming that he was depressed over financial troubles and what he should give to his girlfriend as a birthday present and was obsessed with the Rolex watch. He claimed to have heard voices and hallucinated during the killing. However, the evidence of his co-workers, in which they said Jonaris acted normally and cheerful in work on the day of the murder and prior to the murder, and the fact that he could clearly describe how he kill Poh and his actions of slitting the woman's wrists, showed clearly that Jonaris was in full control of himself and not mentally ill and thus had the intention to kill Sally Poh. Hence, on 8 December 1998, 24-year-old Jonaris was found guilty of murder and sentenced to death. He was hanged on an unspecified date. This case was Chao's last known major case before his death in February 2000. - \"Singapore Infopedia: Professor Chao Tzee Cheng\". *[National Library Board](/wiki/National_Library_Board)*. Archived from the original on 2007-07-04. Retrieved 2007-07-16. - \"Dead Men Do Tell Tales: The Forensic Medical Investigations of the Unforgettable Professor Chao Tzee Cheng\". *[Law Society of Singapore](/wiki/Law_Society_of_Singapore)*. Archived from the original on 2016-03-03. Retrieved 2007-07-16.\n",
  "language": "en",
  "processed_at": "2026-01-12T10:01:30.565139",
  "title": "Chao Tzee Cheng",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Chao_Tzee_Cheng"
}