{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:01:32.558205"
  },
  "content": "South Asian unleavened wheat flatbread **Chapati** (alternatively spelled **chapathi**; pronounced as [IAST](/wiki/IAST): *capātī, capāṭī, cāpāṭi*), also known as *[roti](/wiki/Roti)*, *ruti*, *rotti*, *rooti*, *rotee*, *rotli*, *rotta*, *safati*, *shabaati*, *phulka*, *chapo* (in East Africa), *sada roti* (in the [Caribbean](/wiki/Caribbean)), *poli* (in [Marathi](/wiki/Marathi_language)), and *roshi* (in the [Maldives](/wiki/Maldives)), is an [unleavened](/wiki/Unleavened_bread) [flatbread](/wiki/Flatbread) originating from the [Indian subcontinent](/wiki/Indian_subcontinent) and is a staple in [India](/wiki/India), [Nepal](/wiki/Nepal), [Bangladesh](/wiki/Bangladesh), [Pakistan](/wiki/Pakistan), [Kyrgyzstan](/wiki/Kyrgyzstan), the [Arabian Peninsula](/wiki/Arabian_Peninsula), [East Africa](/wiki/East_Africa), and the [Caribbean](/wiki/Caribbean). Chapatis are made of [whole-wheat flour](/wiki/Whole-wheat_flour) known as [atta](/wiki/Atta_flour), mixed into dough with water, [oil](/wiki/Cooking_oil) (optional), and salt (optional) in a mixing utensil called a *[parat](/wiki/Parat)*, and are cooked on a *[tava](/wiki/Tava)* (flat skillet). It is a common staple in the Indian subcontinent as well as amongst expatriates from the Indian subcontinent throughout the world. Chapatis were also introduced to other parts of the world by immigrants from the Indian subcontinent, particularly by Indian merchants to Central Asia, Southeast Asia, East Africa, and the [Caribbean](/wiki/Caribbean#Countries_and_territories_list). ## Etymology The word *chapati* is derived from the [Sanskrit](/wiki/Sanskrit) word चर्पटी (*charpaṭī*). From a derivative of Sanskrit *चर्प (charpa, “flat”). ## History Chapati is a form of *[roti](/wiki/Roti)* or *rotta* (bread). The words are often used interchangeably. The word *chapat* ([Marathi](/wiki/Marathi_language): चापट) means \"slap\" or \"flat\", describing the traditional method of forming round pieces of thin dough by slapping the dough between the wetted palms of the hands. With each slap, the piece of dough is rotated. The word *chapati* is noted in the 16th-century document *[Ain-i-Akbari](/wiki/Ain-i-Akbari)* by [Abu'l-Fazl ibn Mubarak](/wiki/Abu%27l-Fazl_ibn_Mubarak), [vizier](/wiki/Vizier) of [Mughal Emperor](/wiki/Mughal_Emperor) [Akbar](/wiki/Akbar). Chapatis are one of the most common forms of wheat bread, a [staple food](/wiki/Staple_food) in the Indian subcontinent. The carbonized wheat grains discovered at the excavations at [Mohenjo-daro](/wiki/Mohenjo-daro) are of a similar variety to an endemic species of wheat still found in India. The [Indus Valley](/wiki/Indus_Valley_civilisation) is known to be one of the ancestral lands of cultivated wheat. Chapatis, along with rotis, were introduced to other parts of the world by immigrants from the Indian subcontinent, particularly by Indian merchants who settled in Southeast Asia and the Caribbean islands. In 1857, the chapati likely may have played a role in the Indian mutiny [Chapati Movement](/wiki/Chapati_Movement). ## Cooking Chapatis are made using a soft dough comprising wheat flour and water. It is more finely ground than most Western-style whole wheat flours. Chapati dough is typically prepared with flour, water, and optionally salt, kneaded with a fist, and left to rest for at least 10 or 15 minutes to an hour for the gluten in the dough to relax. After proofing, the dough becomes softer and more pliable. Small portions of the dough are pinched off and formed into round balls that are pressed between the two palms to form discs which are then dipped into flour and rolled out on a circular rolling board (a *[chakla](/wiki/Chakla)*), using a [rolling pin](/wiki/Rolling_pin) known as a *velan* or *belan*, into a flat disc. There are also automatic roti makers which automate the whole process. The rolled-out dough is then thrown on the preheated dry *[tava](/wiki/Tava)* and cooked on both sides. In some regions of the Indian subcontinent, chapatis are only partially cooked on the skillet, and then cooked directly over a flame, which makes them puff up. The hot steam cooks the chapati rapidly from the inside. In some parts of northern India and eastern Pakistan, this is called a *phulka*. In southern parts of India, it is called a *pulka*. It is also possible to puff up the roti directly on the tava. Once cooked, chapatis are often topped with butter or [ghee](/wiki/Ghee). In western regions of Maharashtra, some oil is added inside the rolled-out dough and then put on the tava; this is distinct from paratha. Chapati diameter and thickness vary from region to region. Chapatis made in domestic kitchens are usually not larger than 15 centimetres (6 in) to 18 centimetres (7 in) in diameter since the *tava* on which they are made comes in sizes that fit comfortably on a domestic stovetop. *Tavas* were traditionally made of unglazed earthenware, but are now typically made from metal. The shape of the rolling pin also varies from region to region. Some households simply use a kitchen worktop as a sort of pastry board, but round flat-topped \"boards\" made of wood, stone, or stainless steel are available specifically for rolling out chapatis. ## Regional varieties In most parts of the Indian subcontinent, there is a distinction made between chapati and other related flatbreads eaten in the region. [Roti](/wiki/Roti), [paratha](/wiki/Paratha), [kulcha](/wiki/Kulcha), [puri](/wiki/Puri_(food)), [bhatura](/wiki/Bhatura) and [naan](/wiki/Naan) are different types of traditional flatbreads in India which differ based on their cooking technique, texture and use of different types of flours. For example, parathas are either made layered by spreading them with ghee, folding and rolling out again into a disc which turns out flaky once cooked, or are filled with spinach, [dal](/wiki/Dal), cooked radish or potato. Parathas are mostly made using all-purpose flour instead of whole wheat flour. There are many regional varieties of chapati in India: - [Paneer](/wiki/Paneer) chapati: Grated paneer is added to the usual chapati dough, which is also called 'paneer paratha'. - [Radish](/wiki/Radish)/[mullangi](/wiki/Mullangi) chapati: Grated radish and [turmeric](/wiki/Turmeric) powder is added to the dough, and the chapati is usually thick. It is often eaten by lorry drivers who eat in roadside [dhabas](/wiki/Dhaba) during long trips. It is also called 'mooli paratha'. - Vegetable-stuffed chapati: Mashed carrot, potato, [peas](/wiki/Pea), and [fenugreek](/wiki/Fenugreek) are slightly sautéed into a masala gravy. These chapatis are usually served rolled, and many households prepare them using their own combinations of available vegetables. In the Maldives, chapatis are traditionally eaten for breakfast along with a dish known as *[mas huni](/wiki/Mas_huni)*. Flatbreads are staples of Indian food. Chapatis go well with [curries](/wiki/Curries), dry sabzis or sabjis (vegetables cooked in gravy), [chutneys](/wiki/Chutneys) or dal. ## Gallery - [List of Indian breads](/wiki/List_of_Indian_breads) - [List of Pakistani breads](/wiki/List_of_Pakistani_breads) - [Indian bread](/wiki/Indian_bread) - [Blintz](/wiki/Blintz) - [Ciabatta](/wiki/Ciabatta) (unrelated Italian bread with similar name) - [Chakla](/wiki/Chakla) - [Chimta](/wiki/Chimta) - [Crêpe](/wiki/Cr%C3%AApe) - [Crispbread](/wiki/Crispbread) - [Khubz](/wiki/Khubz) - [Lavash](/wiki/Lavash) - [Markook](/wiki/Markook_shrek) - [Matzo](/wiki/Matzah) - [Pancake](/wiki/Pancake) - [Pita](/wiki/Pita) - [Rumali roti](/wiki/Manda_roti) - [Saj bread](/wiki/Saj_bread) - [Tortilla](/wiki/Tortilla) - [Tunnbröd](/wiki/Tunnbr%C3%B6d) Portals: - India - Pakistan - Bangladesh - Food\n",
  "language": "en",
  "processed_at": "2026-01-12T10:01:32.557550",
  "title": "Chapati",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Chapati"
}