{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:01:38.507188"
  },
  "content": "Singaporean fashion companyThis article **contains promotional content**. Please help improve it by removing promotional language and inappropriate external links, and by adding encyclopedic text written from a neutral point of view. *(February 2024)* *(Learn how and when to remove this message)* **Charles & Keith Pte. Ltd.**, styled as **CHARLES & KEITH** and also known as **C&K**, is a [Singaporean](/wiki/Singapore) [fashion house](/wiki/Fashion_house) label founded in 1996, specializing in [footwear](/wiki/Footwear), handbags and [fashion accessories](/wiki/Fashion_accessories). Based in Singapore, the brand has a global footprint, operating more than 600 stores worldwide across 37 countries. ## History ### Founding The company started out in 1990, when Charles Wong and his younger brother Keith Wong worked at their parent's shoe store in the [Ang Mo Kio](/wiki/Ang_Mo_Kio) district of Singapore. They had wanted to learn the ropes of managing a shoe business before subsequently opening their first store in 1996 at Amara Shopping Centre (now known as the 100 AM). Charles & Keith adopted a new [business model](/wiki/Business_model) for their label because they observed that the traditional model of selling shoes purchased from wholesale suppliers was unsustainable. To emerge from intense competition, the company started designing their own shoes in 1997 based on customers' feedback. This allowed the company to gain greater brand recognition from their target clientele. As the business grew, the company cut out the middleman and began working directly with production factories as a unique brand. ### Expansion In 1998, Charles & Keith began to expand their operations overseas beyond Singapore when they ventured into Indonesia and Australia. In 2001, Charles & Keith opened their first store in the Philippines and by 2015, they had more than 30 stores around the country. In 2004, the company ventured out of Asia and debuted in the Middle East with a store in [Dubai](/wiki/Dubai), and another in Saudi Arabia in 2005. In 2011, the brand had over 230 stores across the world mostly based in the Middle East and Asia. Charles & Keith launched Pedro in 2005, which is a line of men's footwear. Their product range was increased in 2007 to include accessories such as belts and sunglasses and higher end products. In 2011, [LVMH](/wiki/LVMH) (Louis Vuitton Moet Hennessy) invested in a 20 percent stake in the company. The Wong brothers have since brought their shares back from LVMH. As of 2015, Charles & Keith has over 300 stores worldwide. In January 2022, Charles & Keith opened its third concept boutique at Kaohsiung's [E Sky Mall](/wiki/E_Sky_Mall). Spanning approximately 302 sqm, the Kaohsiung location is the brand's largest store in [Taiwan](/wiki/Taiwan). ### Online store In 2004, Charles & Keith became one of the first few companies in the world to set up an e-commerce website in an effort to expand its business, allowing the company to offer its products where it did not have a [brick and mortar](/wiki/Brick_and_mortar) store. In 2021, Charles & Keith announced that such digitalisation processes were accelerated amid the [COVID-19 pandemic](/wiki/COVID-19_pandemic). It added that the company now provides distance training for its 7,000 staff members worldwide, as well as hosting online sales presentations to wholesale buyers wherever they are in the world in contrast to hosting physical wholesale events up to four times a year at its headquarters in Tai Seng. **Awards** The company has secured numerous awards, including the Singapore Retailers Association’s Excellent Service Award in 2002 and the Enterprise Award at the 2008 Singapore Business Awards. - [Cortina Watch](/wiki/Cortina_Watch) - Official Website - Group Website\n",
  "language": "en",
  "processed_at": "2026-01-12T10:01:38.506749",
  "title": "Charles & Keith",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Charles_%26_Keith"
}