{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:01:54.521835"
  },
  "content": "Former semiconductor manufacturer **Chartered Semiconductor Manufacturing, Inc.** (**CSM**), was a Singaporean semiconductor company. ## History Chartered Semiconductor Manufacturing was founded in 1987, as a venture that included [Singapore Technologies Engineering Ltd.](/wiki/ST_Engineering) The company signed a deal in 1994 with [Toshiba](/wiki/Toshiba) for the use of their 0.5 micron process technology. In 1996, Chartered began a partnership with the [National University of Singapore](/wiki/National_University_of_Singapore) and [Nanyang Technological University](/wiki/Nanyang_Technological_University) to develop improvements for the fabrication processes of advanced semiconductors. In 1999, a new 3 year agreement was signed between the three of them for research, development and manufacturing of deepsubmicron semiconductors (DSM). In 2000 ST Engineering (Singapore Technologies Semiconductors), a subsidiary of Temasek Holdings acquired Chartered. In 2002, Chartered joined the ARM Foundry Program and in November of that year, it signed a joint development and manufacturing agreement with [IBM](/wiki/IBM). The agreement was extended in 2004, and again in 2005 to include the 45-nanometer (nm) bulk [CMOS](/wiki/CMOS). CSM was the world's third largest dedicated independent [semiconductor foundry](/wiki/Semiconductor_fabrication_plant), with its headquarters and main operations located in the Woodlands Industrial Park, [Kranji](/wiki/Kranji) [Singapore](/wiki/Singapore). The company was listed on the [Singapore Exchange](/wiki/Singapore_Exchange) under the trading symbol of CHARTERED, as well as on [NASDAQ](/wiki/NASDAQ) (CHRT). In September 2009, it was announced that Chartered Semiconductor was to be acquired by the main stockholder of [GlobalFoundries](/wiki/GlobalFoundries), a joint venture between [AMD](/wiki/AMD) and [Advanced Technology Investment Company](/wiki/Advanced_Technology_Investment_Company) (ATIC), of [Abu Dhabi](/wiki/Abu_Dhabi), United Arab Emirates. The transaction was completed at the end of 2009 and cost of $1.8 billion USD. By acquiring Chartered, ATIC expanded its investments and expertise in technology in the semiconductor industry. ## Fabrication facilities Chartered provides comprehensive [wafer fabrication](/wiki/Wafer_fabrication) services and technologies to semiconductor suppliers and systems companies. Chartered's customer base is primarily high-growth, technologically advanced companies operating in the communication, computer and consumer sectors. It does not provide design services and works from customers' designs to produce communications chips. Besides its own fabs, Chartered operates joint venture facilities with other firms, it offers chip assembly and test services through sister firm STATS ChipPAC. Chartered owns 6 fabrication facilities, all of which are located in Singapore, including the newest, Chartered's first 300-mm facility which started commercial shipment in June 2005. The other major semiconductor foundries include [TSMC](/wiki/TSMC) and [UMC](/wiki/United_Microelectronics_Corporation), Taiwanese-based companies, which are primarily Chartered's main competitors. In 2006, [AMD](/wiki/AMD) announced that it will manufacture [CPUs](/wiki/Central_processing_unit) with Chartered on a 65 nanometer process. It also has alliances with [IBM](/wiki/IBM), [Infineon](/wiki/Infineon), [Samsung](/wiki/Samsung) and [Agere Systems](/wiki/Agere_Systems). - Press release of the acquisition 1°26′16.7″N 103°46′1.03″E﻿ / ﻿1.437972°N 103.7669528°E﻿ / 1.437972; 103.7669528 This article about a technological corporation or company is a stub. You can help Wikipedia by expanding it. - v - t - e This [Singaporean corporation or company](/wiki/List_of_companies_of_Singapore) article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T10:01:54.521412",
  "title": "Chartered Semiconductor Manufacturing",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Chartered_Semiconductor_Manufacturing"
}