{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:01:51.712578"
  },
  "content": "British physician **Charlotte Elizabeth Ferguson-Davie** [OBE](/wiki/Officer_of_the_Order_of_the_British_Empire) (7 July 1865 – 24 March 1943) was a [British](/wiki/British_Empire) physician and the founder of the St. Andrew's Medical Mission and the St. Andrew Mission Hospital, the first women's and children's clinic in [Singapore](/wiki/Singapore). ## Biography Ferguson-Davie was born on 7 July 1865 in [Cheetham, Manchester](/wiki/Cheetham,_Manchester), where her father Irish geologist [Edward Hull](/wiki/Edward_Hull_(geologist)) was working in the Geological Surveyer's Office. Raised in Ireland, she studied at [Alexandra College](/wiki/Alexandra_College) in Dublin and earned a B.A. degree in German from the [Royal University of Ireland](/wiki/Royal_University_of_Ireland). Ferguson-Davie went on to become a medical doctor. After completing the requirements for her [bachelor's degrees in medicine and surgery](/wiki/Bachelor_of_Medicine,_Bachelor_of_Surgery) at the [London School of Medicine for Women](/wiki/London_School_of_Medicine_for_Women) in 1895, she went to India as a medical missionary in 1897. Returning to England after a few years, Ferguson-Davie completed the requirements for her M.D. degree at the London School of Medicine for Women in 1901. In 1902 back working in India, she married the [Anglican](/wiki/Anglicanism) missionary Right Reverend [Charles James Ferguson-Davie](/wiki/Charles_Ferguson-Davie). Ferguson-Davie and her husband came to [Singapore](/wiki/Singapore) in 1909. In 1913, she helped create the St. Andrew Medical Mission in order to help care for the \"poor and disadvantaged.\" She opened a second clinic in 1914. In 1921, she published a book, *In Rubber Lands: An Account of the Work of the Church in Malaya*. In 1923, she created the first women's and children's clinic in Singapore, named the St. Andrew's Mission Hospital (SAMH). She was able to obtain the land and get [architects](/wiki/Architect) to work for her for almost \"nothing.\" The next year, in 1924, Ferguson-Davie expanded the services that SAMH provided, including a [venereal disease](/wiki/Sexually_transmitted_infection) clinic. Ferguson-Davie set up training classes, teaching [nursing](/wiki/Nursing) and [midwifery](/wiki/Midwifery). Ferguson-Davie became an officer of the [Order of the British Empire](/wiki/Order_of_the_British_Empire) in (/wiki/1927_Birthday_Honours) and in the same year, retired. She and her husband then moved to [South Africa](/wiki/South_Africa), where he worked at [Fort Hare College](/wiki/University_of_Fort_Hare). Ferguson-Davie died in 1943. ## Legacy Ferguson-Davie was recognized for her medical work during the [St. Andrew's Cathedral's](/wiki/St_Andrew%27s_Cathedral,_Singapore) Thanksgiving service in 2013. In 2014, she was inducted into the [Singapore Women's Hall of Fame](/wiki/Singapore_Women%27s_Hall_of_Fame).\n",
  "language": "en",
  "processed_at": "2026-01-12T10:01:51.712180",
  "title": "Charlotte Ferguson-Davie",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Charlotte_Ferguson-Davie"
}