{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:01:56.854733"
  },
  "content": "Abandoned bungalow in Singapore **Chee Guan Chiang House**, also known as the **Wellington House**, is an abandoned bungalow on Grange Road in [River Valley, Singapore](/wiki/River_Valley,_Singapore). Built in 1938 for Chee Guan Chiang, the son of [Chee Swee Cheng](/wiki/Chee_Swee_Cheng), it served as a guest house for several years before it was left vacant. ## Description According to the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority), the bungalow, which was designed in the [Art Deco](/wiki/Art_Deco) style, is \"an excellent example of the 1930s Modern style in reinforced concrete - straightforward in character and pleasantly proportioned.\" It was built with a \"stylish, streamlined aesthetic.\" The authority further states that the building is \"noted for its generous and dramatically curved plan and walls\", which are \"juxtaposed\" by both its roof, which is flat and made of concrete, as well as an additional service block at the back of the bungalow, which is \"orthogonal\" in shape. Aspects of the design may have been inspired by the [De La Warr Pavilion](/wiki/De_La_Warr_Pavilion) in [East Sussex](/wiki/East_Sussex), [England](/wiki/England). A garden, complete with a pavilion and planter boxes, was placed on the roof, making the bungalow an early example of a building in Singapore with such a feature. The estate is around 100,000 sq ft large. The building features many windows, which curve along the building and are made of green-tinted and embossed glass to prevent the interior from being too bright and warm. The interior features a lot of [terrazzo](/wiki/Terrazzo), which was a common feature of the interior of the buildings in Singapore at the time of the bungalow's construction, as well as a grand staircase. The ground floor features verandahs, which curve along the bungalow and are accompanied by decorative balustrades made of iron. The Urban Redevelopment Authority notes that these balustrades, which can also be found at the staircase, are \"unusual\", as they are \"more reminiscent of the 1920s [Art Noveau](/wiki/Art_Nouveau) [*[sic](/wiki/Sic)*] style.\" According to the Singapore chapter of [Docomomo International](/wiki/Docomomo_International), the windows along the building's curve \"form an undulating periphery so that each room could enjoy the fresh air and generous views of the garden.\" The balustrades at the verandah feature the letters \"WH\", as does the grand staircase. The letters stand for the bungalow's name, Wellington House. Another building on the estate, which is smaller in size, features a similar design to the bungalow but with timber flooring and walls made of concrete instead. ## History The bungalow was completed in 1938 for Chee Guan Chiang, the son of banker [Chee Swee Cheng](/wiki/Chee_Swee_Cheng), the first chairman of the [Oversea-Chinese Banking Corporation](/wiki/OCBC_Bank), on land that was previously owned by merchant [Low Kim Pong](/wiki/Low_Kim_Pong). While the main building was under construction, Chee stayed in the smaller building. It was designed by Ho Kwong Yew, who was \"one of the leading architects of the Modern Movement in Singapore during the 1930s.\" According to Docomomo, which listed the structure on its Modernist 100 list of \"significant modernist buildings in Singapore\", the bungalow was one of Ho's \"definitive works.\" The listing further notes that it was \"designed in anticipation of frequent parties with its grand staircase, splendid halls, and manicured lawns.\" Allegedly, Chee named the Wellington House for \"wealth and good luck.\" However, he was unable to move into the residence as he had suffered a stroke. He and his family fled Singapore soon after in 1941 due to [World War II](/wiki/World_War_II). The bungalow later served as a boarding house. In 1964, it was renamed the New Leonie Guest House. It became dilapidated not long after. In 1973, three of the buildings on the property, including the main bungalow, were acquired by Lee Tat Development, while the last was acquired by the Grange Heights condominium, whose contractors began using the bungalow's road to access the building it had acquired. This led to a legal dispute, in which Lee Tat Development claimed that the contractors did not have the right to use the road, which lasted several decades. Although it was initially ruled in the contractors' favour in 2005, an overturning of the ruling in 2008 led to Lee Tat Development winning the case, after which they unsuccessfully appealed for compensation from the contractors. The case set a record with six decisions from the [Court of Appeal of Singapore](/wiki/Court_of_Appeal_of_Singapore). Sometime after 2015, iron gates and warning signs were installed around the property to prevent trespassing. In 2007, it was reported that the property was worth around $425 million. It was gazetted for conservation by the Urban Redevelopment Authority on 23 May 2008. According to architects Ho Weng Hin, Dinesh Naidu and Tan Kar Lin, the bungalow is a \"popular haunt for photography buffs.\" *[Time Out](/wiki/Time_Out_(magazine))* writes that the interior is \"overrun by trees and graffiti.\" 1°17′56″N 103°50′08″E﻿ / ﻿1.29900°N 103.83545°E﻿ / 1.29900; 103.83545\n",
  "language": "en",
  "processed_at": "2026-01-12T10:01:56.854393",
  "title": "Chee Guan Chiang House",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Chee_Guan_Chiang_House"
}