{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:01:58.569699"
  },
  "content": "Malaysian chef and television personality **Redzuawan bin Ismail** (born 6 January 1958), better known by his [stage name](/wiki/Stage_name) **Chef Wan**, is a Malaysian [celebrity chef](/wiki/Celebrity_chef), television host, actor, [restaurateur](/wiki/Restaurateur) and entrepreneur. ## Personal life Chef Wan is a second generation [Federal Land Development Authority](/wiki/Federal_Land_Development_Authority) (Felda) settler who was born and raised in a poor family at Sungai Koyan Felda, [Lipis](/wiki/Lipis), [Pahang](/wiki/Pahang). In an interview in February 2010, Chef Wan said that he is of mixed ancestry; his father has Malay ancestry from Indonesia while his mother has Chinese and Japanese ancestry. Chef Wan has two children. One is Serina Redzuawan, an actress who has appeared in several Malaysian drama series; Chef Wan's son, Muhammad Nazri Redzuawan who is commonly known as Chef Riz, is following in his father's footsteps by becoming a chef as well. ## Career Chef Wan's early career was as an accountant. He says after seeing the popularity of many types of Asian food in Western countries he decided to promote Malaysia and other [South East Asian](/wiki/South_East_Asian) countries using their food. Chef Wan has an [associate degree](/wiki/Associate_degree) in Professional Chef Training and Hotel Management from the [California Culinary Academy](/wiki/California_Culinary_Academy) and a Ritz Escoffier Diploma from the [Hôtel Ritz Paris](/wiki/H%C3%B4tel_Ritz_Paris). In 2009, he won the *Best Celebrity Television Chef* of the Gourmand World Cookbook Awards. Chef Wan is a [Tourism Malaysia](/wiki/Tourism_Malaysia) culinary ambassador. He is currently a brand ambassador for [AirAsia](/wiki/AirAsia). In 2005, [Anthony Bourdain](/wiki/Anthony_Bourdain) introduced Chef Wan to American audiences during his trip to Malaysia in season one, episode five of *No Reservations*. In 2009, Chef Wan appeared in Episode 3 of [Rick Stein](/wiki/Rick_Stein)'s television series *Far Eastern Odyssey* ([BBC](/wiki/BBC)). On 26 July 2018, Chef Wan's Kitchen at [Esplanade Mall](/wiki/Esplanade,_Singapore) ceased operations after only a year. Chef Wan said, \"It's not because the cooks are not good, and neither are the staff to blame. The culinary team just did not follow my recipes... and as a result, many diners were not satisfied... It's better to close it than to invite further criticism from guests who enjoy what I cook.\" Chef Wan was the recipient of THE 2019 Felda Icon Award at Felda Settlers Day in 2019. In March 2021, viral [YouTube](/wiki/YouTube) comedian [Nigel Ng](/wiki/Nigel_Ng), better known as [Uncle Roger](/wiki/Uncle_Roger), visited Chef Wan's restaurant for a video shoot. Chef Wan mentioned how he was offered to be on *Gelak Gempak Selebrity*, a new stand-up comedy show, but declined the offer, stating that he preferred to be \"spontaneously funny\" and \"didn't have much confidence in the field of stand-up comedy\". ## Controversies In 2014, Chef Wan posted a photo on his Instagram account of an object which he linked as debris from the missing [Malaysia Airlines Flight 370](/wiki/Malaysia_Airlines_Flight_370) and subsequently dismissed the debris as \"an old toilet door from [Cik Kiah](/wiki/List_of_terms_related_to_an_average_person#Malaysia)'s house\". He was criticized for making an inappropriate joke with regards to the missing plane. He took down the post and defended the joke as a means to gauge public reaction and was further criticized for it. In 2015, while criticising a [CNN](/wiki/CNN) ranking of the world's best food destinations for its low placement of Malaysia, Chef Wan stated that \"[the] Philippines is known to have the worst food in Asia, ask any chefs and they will tell you I am right\". In 2017, Chef Wan, being the son of a [Felda](/wiki/Federal_Land_Development_Authority) settler, vented his frustrations and disappointments over the Felda scandals by calling the agency \"Felda then, *Failed dah* now\" and condemned the culprits. On a cooking programme and campaign visit to the Felda community during the January [2019 Cameron Highlands by-election](/wiki/2019_Cameron_Highlands_by-election), he said he wanted to slap former prime minister [Najib Razak](/wiki/Najib_Razak) and ex-Felda chairman [Mohd Isa Abdul Samad](/wiki/Mohd_Isa_Abdul_Samad) for mismanaging the agency. He apologized later for his coarse language. After he was awarded the 2019 Felda Icon, Chef Wan was criticized for claiming that some of the Felda settlers were lazy and tended to \"breed like cats\" for having polygamous marriages and large families, and becoming complacent in their rich and comfortable lives. He stressed the importance of hard work and a need to avoid laziness among the settlers based on his own observations living in the Felda settlements. Najib Razak embroiled himself in a war of words with Chef Wan over his remarks this time. Chef Wan has told the disgraced ex-PM to 'shut his mouth' and 'don't bark like a mad dog'. ## Filmography ### Film YearTitleRoleNotes1996*Lurah Dendam*RizalFirst appearance1997*Baginda*Teacher Ismail2000*Soal Hati*Naza2005*Senario XX*Dad Siti2011*Karipap-Karipap Cinta*Himself2015*Gangsterrock Kasi Sengat*HimselfSpecial appearance ### Television YearTitleRoleNotes1999–2001[*Kampung Boy*](/wiki/Kampung_Boy_(TV_series))HimselfVoice-acting, 1 episode ## Honours ### Honours of Malaysia - [Federal Territory (Malaysia)](/wiki/Federal_Territories_of_Malaysia) - Commander of the [Order of the Territorial Crown](/wiki/List_of_post-nominal_letters_(Malaysia)#Orders,_decorations,_and_medals_(Federal_Territory_of_Malaysia)) (PMW) – **Datuk** (2010) - [Pahang](/wiki/Pahang) - Knight Companion of the [Order of Sultan Ahmad Shah of Pahang](/wiki/Order_of_Sultan_Ahmad_Shah_of_Pahang) (DSAP) – **Dato'** (2016) - Chef Wan on [Facebook](/wiki/Facebook_(identifier)) - Chef Wan on [Instagram](/wiki/Instagram_(identifier)) - Chef Wan at [IMDb](/wiki/IMDb_(identifier)) Portals: - Malaysia - Biography - Food - Television\n",
  "language": "en",
  "processed_at": "2026-01-12T10:01:58.569260",
  "title": "Chef Wan",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Chef_Wan"
}