{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:02:02.592045"
  },
  "content": "Tudor-style building in Singapore The **Chek Jawa Visitor Centre**, also known as **House No. 1**, is a visitor centre and former holiday home on [Pulau Ubin, Singapore](/wiki/Pulau_Ubin). It is believed to be the last remaining authentic Tudor-style building in the country. ## Description The two-storey cottage was constructed in the [Tudor style](/wiki/Tudor_architecture). Its [gables](/wiki/Gable) are [framed with timber](/wiki/Timber_framing) and treated with [creosote](/wiki/Creosote) and its walls are [Stucco](/wiki/Stucco)-finished. It features a bricked-up fireplace, as well as [masonry infill walls](/wiki/Infill_wall) and [steeply pitched roofs](/wiki/Roof_pitch). According to the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority), the \"skillful builders in this case have gone out of their way to use bent and irregular-shaped timber members as one would find in English country situations\", and that \"the masonry work is a well-considered mix of cut granite, brick and stone.\" The terracotta floor has a \"rare\" honeycomb shape. The house also features black metal-framed windows that were doubled-framed with netting to prevent insects from entering. The building's [quoins](/wiki/Quoin) were constructed using granite from Pulau Ubin. The building faces the sea. It occupies a gross floor area of 4,036 sqft. There is also a second building that served as the [servants' quarters](/wiki/Servants%27_quarters), a [water tower](/wiki/Water_tower) and a jetty, on the property. The external structures were designed to give off the impression that they were added over time. ## History The house was built in the 1930s as a holiday retreat for British Chief Surveyor Langdon Williams. After the British left Singapore, a local family began using the building as a weekend home. Businessman Lee Thor Seng was the building's last owner before the government acquired it in the 1990s. Following the government's acquisition, the house was left vacant. Over the next decade, the house began to deteriorate and its timber frames infested with termites. The stone and brickwork had also been painted over or plastered over time. The building was gazetted for conservation by the Urban Redevelopment Authority on 1 December 2003. Restoration on the building began in 2005. The stone and brickwork were restored with their original material and finishes and the termite-infested frames were replaced, as were the \"damaged\" [roof trusses](/wiki/Timber_roof_truss). The ceiling on the second floor was raised to allow for a better view of the chimney shaft. A new jetty was built to replace the original, which was \"beyond repair\". However, the water tower was left untouched. In 2007, the building was awarded the URA Architectural Heritage Award for its restoration. In the same year, it became the [Chek Jawa](/wiki/Chek_Jawa) visitor centre. It has been placed on the Pulau Ubin Heritage Trail by the [National Heritage Board](/wiki/National_Heritage_Board_(Singapore)). 1°24′30″N 103°59′21″E﻿ / ﻿1.40824°N 103.98929°E﻿ / 1.40824; 103.98929\n",
  "language": "en",
  "processed_at": "2026-01-12T10:02:02.591584",
  "title": "Chek Jawa Visitor Centre",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Chek_Jawa_Visitor_Centre"
}