{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:02:24.327333"
  },
  "content": "Chewing gum ban in Singapore The sale of [chewing gum](/wiki/Chewing_gum) in [Singapore](/wiki/Singapore) has been illegal since 1992. Some motivations for the ban included stopping the placement of used chewing gum in inappropriate and costly places, such as the sensors of subway doors, inside lock cylinders, and on elevator buttons. Since 2004, an exception has existed for therapeutic, dental, and nicotine chewing gum, which can be bought from a doctor or registered pharmacist. It is not illegal to chew gum in Singapore, but it is against the law to import it and sell it, apart from the aforementioned exceptions. According to a [BBC News](/wiki/BBC_News) article, it is legal for a traveler to bring in a small amount of chewing gum for personal use, and there is a fine for spitting the gum out in an inappropriate place. ## Origins ### Lee Kuan Yew In his memoirs, [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) said that in 1983, when he was [Prime Minister of Singapore](/wiki/Prime_Minister_of_Singapore), a proposal for the ban was brought to him by [Teh Cheang Wan](/wiki/Teh_Cheang_Wan), then [Minister for National Development](/wiki/Minister_for_National_Development_(Singapore)). Chewing gum was causing maintenance problems in high-rise [public-housing](/wiki/Housing_and_Development_Board) apartments, with vandals disposing of spent gum in mailboxes, inside keyholes, and on lift buttons. Chewing gum left on the ground, stairways, and pavements in public areas increased the cost of cleaning and damaged cleaning equipment. Gum stuck on the seats of public buses was also considered a problem. However, Lee thought that a ban would be \"too drastic\". ### Mass rapid transport and implementation In 1987, the $5 billion local railway system, the [Mass Rapid Transit](/wiki/Mass_Rapid_Transit_(Singapore)) (MRT), started running. It was then the largest public project ever implemented in Singapore. It was reported that vandals had begun sticking chewing gum on the door sensors of MRT trains, preventing doors from functioning properly and causing disruption to train services. Such incidents were rare but costly, and the culprits were difficult to apprehend. In January 1992, [Goh Chok Tong](/wiki/Goh_Chok_Tong), who had just taken over as prime minister, decided on a ban. The restriction on the distribution of chewing gum was enacted in Singapore Statute Chapter 57, the *Control of Manufacture Act*, which also governs the restriction of certain [alcohol](/wiki/Alcohol_(drug)) and [tobacco](/wiki/Tobacco) products. ## Results After the ban was announced, the importation of chewing gum was immediately halted. After a transition period allowing shops to clear existing stock, the sale of chewing gum was completely banned, the penalties being fines of up to [S$](/wiki/Singapore_dollar)2,000 for those convicted of selling chewing gum as well as fines and/or jail terms for importers. Extant stocks of gum were confiscated. When first introduced, the ban caused much controversy and some open defiance. Some people took the trouble of travelling to neighbouring [Johor Bahru](/wiki/Johor_Bahru), [Malaysia](/wiki/Malaysia), to purchase chewing gum. Offenders were publicly \"named and shamed\" by the government, to serve as a deterrent to other would-be smugglers. No [black market](/wiki/Black_market) for chewing gum in Singapore ever emerged, though some Singaporeans occasionally still manage to purchase gum from Johor Bahru for their own consumption. Subsequent to the ban, town councils reported a substantial decrease in chewing-gum litter in public spaces, and chewing gum no longer jammed lift doors or disrupted MRT systems. The ban has since been partially lifted, as some types of gum are allowable, such as gum chewed for dental health. However, the government refuses to completely lift the ban due to the risk of gum littering again. ## International attention In the mid-1990s, Singapore's laws began to receive international press coverage. US media paid great attention to the case of [Michael P. Fay](/wiki/Michael_P._Fay), an American teenager sentenced in 1994 to [caning](/wiki/Caning_in_Singapore) in Singapore for [vandalism](/wiki/Vandalism) (using spray paint, not chewing gum). They also drew attention to some of Singapore's other laws, including the \"mandatory flushing of public toilets\" rule. Confused reporting about these issues led to the myth that the use or importation of chewing gum is itself punishable with caning. In fact, the only penalties provided under Chapter 57 are fines and imprisonment. When a BBC reporter suggested that such laws would stifle the people's creativity, Lee Kuan Yew said: \"If you can't think because you can't chew, try a banana.\" ## Revision In 1999, United States President [Bill Clinton](/wiki/Bill_Clinton) and Singapore Prime Minister [Goh Chok Tong](/wiki/Goh_Chok_Tong) agreed to initiate talks between the two countries for a bilateral free trade agreement (USS-FTA). The talks later continued under the new administration of President [George W. Bush](/wiki/George_W._Bush). The [Chicago](/wiki/Chicago,_Illinois)-based [Wm. Wrigley Jr. Company](/wiki/Wm._Wrigley_Jr._Company) enlisted the help of a Washington, D.C. [lobbyist](/wiki/Lobbyist) and of Illinois Congressman [Phil Crane](/wiki/Phil_Crane), then-[chairman](/wiki/Chairman) of the [United States House Ways and Means Subcommittee on Trade](/wiki/United_States_House_Ways_and_Means_Subcommittee_on_Trade), to get chewing gum on the agenda of the [United States-Singapore Free Trade Agreement](/wiki/United_States-Singapore_Free_Trade_Agreement). This caused a dilemma for the Singapore Government. It recognised the health benefits of certain gums, such as a brand of sugar-free gum that contains [calcium lactate](/wiki/Calcium_lactate) to strengthen [tooth enamel](/wiki/Tooth_enamel). Sale of this newly categorised medicinal gum was allowed, provided it was sold by a dentist or pharmacist, who must keep a record of the names of buyers. 1. Ho Khai Leong (2003) *Shared Responsibilities, Unshared Power: The Politics of Policy-Making in Singapore*, [ISBN](/wiki/ISBN_(identifier)) 981-210-218-3.\n",
  "language": "en",
  "processed_at": "2026-01-12T10:02:24.326802",
  "title": "Chewing gum sales ban in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Chewing_gum_sales_ban_in_Singapore"
}