{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:02:22.597394"
  },
  "content": "Singaporean politician **Chew Swee Kee** ([Chinese](/wiki/Chinese_language): 周瑞麒; [pinyin](/wiki/Pinyin): *Zhōu Ruìqí*; 15 May 1918 – 15 December 1985) was a Singaporean politician. A member of political party [Labour Front](/wiki/Labour_Front), Chew served as the first [Minister of Education](/wiki/Ministry_of_Education_(Singapore)) from 1955 to 1959. ## Early life Chew was born 15 May 1918, in [Gopeng](/wiki/Gopeng), [Perak](/wiki/Perak), Malaya. He attended Chung Wah Chinese School and Anglo-Chinese School. ## Career Chew was a member of the [Labour Front](/wiki/Labour_Front), a Singapore-based political party. He was given the role of Minister of Education following the victory of the Labour Front in the 1955 Legislative Elections. He was also acting Chief Minister and chairman of the All-Party Committee of the Singapore Legislative Assembly. He became the Labour Front's president in around 1957. In 1958, the Labour Front joined with the Liberal Socialist Party to form the [Singapore People's Alliance](/wiki/Singapore_People%27s_Alliance). Early in 1959, Organizing Secretary of the Labour Front, Gerald de Cruz, was told that Chew Swee Kee had bought a tin mine in Ipoh, Malaya, for $350,000. de Cruz alerted Communications and Works Minister and Secretary General of the Labour Front, [Francis Thomas](/wiki/Francis_Thomas_(politician)). de Cruz described Thomas as \"the only honest man as far as I knew in the Labour Front\". Thomas consulted Arthur Lim, Assistant Secretary General, and then reported Chew's sudden wealth to Chief Minister [Lim Yew Hock](/wiki/Lim_Yew_Hock). Lim dismissed the issue, saying that he personally had received only $15,000. Disgruntled, Thomas passed the information to [Lee Kuan Yew](/wiki/Lee_Kuan_Yew), Secretary General of the opposition [People's Action Party](/wiki/People%27s_Action_Party) (PAP). On 15 February 1959, at a pre-election rally, PAP Chairman, [Toh Chin Chye](/wiki/Toh_Chin_Chye), said that \"the Americans\" had given $500,000 to the Singapore's People's Alliance. Two days later, on 17 February, Lee tabled a motion in the Legislative Assembly naming Chew as receiving foreign money and calling for a Commission of Inquiry. Chew resigned on 4 March. Chief Minister Lim appointed Justice Murray Buttrose as Commissioner to investigate. Buttrose held hearings from 6 April to 18 May, and concluded that Chew had received $519,000 in October 1957 and $182,000 in April 1958 from the main office of First National City Bank of New York. Chew spent $280,000 on investments in Malayan mines and $51,000 to buy a house in Ipoh. Buttrose cleared Chew of violating income tax laws. At the inquiry, Lee said that he had received the information about Chew's receipt of foreign funds from [K. M. Byrne](/wiki/K._M._Byrne), formerly Permanent Secretary to the Ministry of Commerce and Industry. In turn, Byrne testified that he had received the information from an official of the Income Tax Department. The incident is credited with causing the downfall of the Singapore People's Alliance, and paving the way for the PAP to dominate Singapore politics. Subsequent research revealed that the funds were from Taiwan (Chew had met Republic of China Foreign Minister George Yeh in September 1957 to solicit funds). ## Personal life Chew became a Singapore citizen in November 1957. He was married and had four daughters and one son. He headed the Ipoh ACS Alumni Association from 1962 to 1964. ## Death Chew died of [myocardial infarction](/wiki/Myocardial_infarction) on 15 December 1985. ## Bibliography - Lee, Edwin (2008). *Singapore: The Unexpected Nation*. Institute of Southeast Asian Studies. [ISBN](/wiki/ISBN_(identifier)) 9789812307965.\n",
  "language": "en",
  "processed_at": "2026-01-12T10:02:22.596990",
  "title": "Chew Swee Kee",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Chew_Swee_Kee"
}