{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:02:27.597809"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Chicken Rice War\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(March 2013)* *(Learn how and when to remove this message)*2000 Singaporean film ***Chicken Rice War*** is a [Singaporean](/wiki/Singapore) [romantic comedy](/wiki/Romantic_comedy) film released in 2000 by Raintree Pictures. It is an adaptation of [Romeo and Juliet](/wiki/Romeo_and_Juliet) in a Singaporean setting, where fierce competition between rival [chicken rice](/wiki/Hainanese_chicken_rice) hawkers resulted in bitter enmity. The old feud between chicken rice hawker families' stand in the way of their young offspring who fell for one another. ## Synopsis *Chicken Rice War* is loosely based on [William Shakespeare](/wiki/William_Shakespeare)'s *[Romeo and Juliet](/wiki/Romeo_and_Juliet)*. In this movie the Montagues and Capulets are represented by the families Wong and Chan. Both families run Chicken Rice stalls side by side in the same market, something that the authorities say is impossible, since it is not allowed. The underlying conflict is about the secret family recipes that has been kept secret for generations, but apart from that nobody really knows what the fight is about. Audrey Chan is a beautiful, vain and spoilt girl who is the most popular girl in school. Fenson Wong is an insecure young man with a stutter who, of course, is madly in love with Audrey. Their only common interest is Shakespeare and the version of Romeo and Juliet that they are setting up at school. When Fenson gets the chance to replace Audrey's beautiful but dim boyfriend as Romeo he starts seriously dreaming about capturing Audrey's heart. ## Cast [Pierre Png](/wiki/Pierre_Png) as Fenson Wong May Yee Lum as Audrey Chan Catherine Sng as Wong Ku Gary Yuen as Vincent Chan Kevin Murphy as Leon Deli Kelvin Ng as Sydney Wong Su Ching Teh as Penelope Chan Wui Seng Cheong as Wong Terr Irene Ong as Wendy Chan Weng Kee Lee as Chan Tick Gary Loh as Muscle Mike Jo Jo Struys as Cheryl Randall Tan as Nick Carter Zalina Abdul Hamid as Fat Lady Mohan Sachden as Muthiah Alias Kadir as Ahmad Edmund L. Smith as Mr. Pillay Paul Tan as TV presenter [Tanya Chua](/wiki/Tanya_Chua) as Herself Jonathan Lim as Hugo A Go Goh Uttsada Panichkul as Himself Kevin Poh as Capulet [Jamie Yeo](/wiki/Jamie_Yeo) as Herself ## Awards - Discovery Award at the [2001 Toronto International Film Festival](/wiki/2001_Toronto_International_Film_Festival) - Special Jury Award Miami Film Festival 2002 - Nominee Best Film Buenos Aires International Festival of Independent Cinema 2002 - *Chicken Rice War* at [IMDb](/wiki/IMDb_(identifier)) This article related to a Singaporean film is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T10:02:27.597366",
  "title": "Chicken Rice War",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Chicken_Rice_War"
}