{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:59:35.012132"
  },
  "content": "Convent and shopping district in Singapore **CHIJMES** (pronounced \"*chimes*\") is a historic building complex in Singapore, which began life as a [Catholic](/wiki/Roman_Catholic_Church) [convent](/wiki/Convent) known as the *[Convent of the Holy Infant Jesus](/wiki/Convent_of_the_Holy_Infant_Jesus)* (CHIJ). The complex is located at [Victoria Street](/wiki/Victoria_Street,_Singapore) in the [Downtown Core](/wiki/Downtown_Core), within the [Central Area](/wiki/Central_Area,_Singapore), Singapore's central business district. The complex was used as a [Catholic](/wiki/Catholic) [convent](/wiki/Convent) from 1852, with an acquired **[Caldwell House](/wiki/Caldwell_House,_Singapore)** which was constructed in 1840–1841, an acquired Convent Orphanage house in 1855, the **[Convent of the Holy Infant Jesus Chapel](/wiki/Convent_of_the_Holy_Infant_Jesus_Chapel)** in 1904 and an acquired hotel complex for the girls' school in 1933. The [Caldwell House](/wiki/Caldwell_House,_Singapore), currently a [wedding](/wiki/Wedding) venue, and the [Gothic-style](/wiki/Gothic_architecture) chapel, renamed as [CHIJMES Hall](/wiki/CHIJMES_Hall), currently a [function hall](/wiki/Function_hall) and also a wedding venue, have both been gazetted as [national monuments](/wiki/National_Monuments_of_Singapore). The complex was restored in 1996 for commercial purposes as a [dining](/wiki/Dining), [shopping](/wiki/Shopping) and entertainment centre with ethnic restaurants, shops and a function hall, providing a backdrop for musicals, [recitals](/wiki/Concert#Recital), [theatrical](/wiki/Theatre) performances and weddings. ## History After Father [Jean-Marie Beurel](/wiki/Jean-Marie_Beurel) consecrated the [Cathedral of the Good Shepherd](/wiki/Cathedral_of_the_Good_Shepherd) on 6 June 1847, he had an ambition to open a school for boys to be managed by the [Brothers of the Christian Schools](/wiki/Brothers_of_the_Christian_Schools). In 1848, Father Beurel asked the [Straits Settlements government](/wiki/Straits_Settlements) for land to build a school, but was refused. He left Singapore on 28 October 1850 for France. While he was in France, Father Beurel approached the [Reverend Mother](/wiki/Reverend_Mother) [Saint](/wiki/Saint) François de Sales de Faudoas, the 14th [Superior General](/wiki/Superior_General) of the [Infant Jesus Sisters](/wiki/Infant_Jesus_Sisters), to enlist some sisters in starting a school for girls. He returned to Singapore in 1852 with some Brothers from the Brothers of the Christian Schools and with them he later founded [Saint Joseph's Institution](/wiki/Saint_Joseph%27s_Institution) at the [former chapel](/wiki/Former_Saint_Joseph%27s_Institution) in May 1852. In July 1852, he asked the Straits Settlements Government once again for land next to the church for a charitable institution for girls, he was told that there was already sufficient land given to the church. Later in August 1852, Father [Jean-Marie Beurel](/wiki/Jean-Marie_Beurel) purchased the house at the corner of Victoria Street from H.C. Caldwell for the [Sisters of the Holy Infant Jesus](/wiki/Congregation_of_the_Holy_Infant_Jesus) for 4,000 [francs](/wiki/Franc), the house was since known as the [Caldwell House](/wiki/Caldwell_House,_Singapore). In October 1852, the four Sisters of the Holy Infant Jesus, Reverend Mother [Mathilde Raclot](/wiki/Mathilde_Raclot), Mother Appollinaire, Mother Gaetan Gervais and Sister Gregory Connolly arrived in [Penang](/wiki/Penang) after having travelled overland from their native country in [caravans](/wiki/Caravan_(travellers)). Mother Mathilde Raclot, leader of this group, was to become a key personality in the early history of the [Convent of the Holy Infant Jesus](/wiki/Convent_of_the_Holy_Infant_Jesus) on Victoria Street. On 2 February 1854, the Sisters sailed to Singapore from Penang on a mission to build a school for girls. On 5 February 1854, they reached the island's shores and took up residence at the Caldwell House. The nuns began taking in pupils only ten days after moving in, establishing the first CHIJ school in Singapore. Reverend Mother Mathilde staffed her school with sisters from the parent Society, the Institute of the Charitable Schools of the Holy Infant Jesus of Saint Maur. She dedicated 20 years of her life turning the convent into a school, a house at the corner of the Stamford Road and North Bridge Road was acquired in 1855 to serve as an [orphanage](/wiki/Orphanage) and [refuge](/wiki/Women%27s_shelter) known as **Home for Abandoned Babies** for local girls and women and sometimes boys. Two classes were conducted, one for fee-paying students and another for orphans and the poor. Slowly, the nuns managed to restore the house into a simple but austere residence. Father Beurel had since acquired all the nine lots of land between Victoria Street and [North Bridge Road](/wiki/North_Bridge_Road), originally belonging to the [Raffles Institution](/wiki/Raffles_Institution), that would constitute the entire convent complex. He presented them all to Reverend Mother Mathilde. The first chapel of the Convent, which was built in 1855, was in such a bad condition that it was necessary to build a new one. At the end of the 19th century, the Sisters started [fund-raising](/wiki/Fund-raising) by various means for the new chapel. The old one was becoming so dangerous that the Sisters decided to celebrate [mass](/wiki/Mass_(liturgy)) in Caldwell House. Father [Charles Benedict Nain](/wiki/Charles_Benedict_Nain), a priest at [Church of Saint Peter and Saint Paul](/wiki/St_Peter_and_St_Paul%27s_Church,_Singapore), was engaged as an architect for the construction of the [chapel](/wiki/Convent_of_the_Holy_Infant_Jesus_Chapel) at the Convent of the Holy Infant Jesus and, on behalf of the Roman Catholic community, was in charge at the same time of the construction of the extension of the Saint Joseph Institution. The construction of the chapel started in 1901 with the architectural firm [Swan & Maclaren](/wiki/Swan_%26_Maclaren) oversaw its constructions and it was completed by 1903. Father Nain was highly involved in the worksite. He was the author of all the fine architectural details found in the chapel. The new chapel was consecrated on 11 June 1904. Much of the knowledge about the daily activities of the convent comes from seven volumes of [diaries](/wiki/Diary) that were meticulously kept by convent [scribes](/wiki/Scribe). These diaries cover over a hundred years of convent history, from 1851 to 1971; they are handwritten in French and entitled *Annales de Singapour*. From their observations, it is known that life within the convent walls was anything but sedate. Apart from daily chores, the nuns also had to organise and attend [mass](/wiki/Mass_(liturgy)), [grade](/wiki/Grading_in_education) [papers](/wiki/Test_(assessment)), maintain the buildings and the grounds as well as [raise money](/wiki/Fundraising) to support their activities. **Saint Nicholas Girls' School** was established on 16 January 1933 and held classes in the four old [bungalows](/wiki/Bungalow) which once formed the Hotel van Wijk of the 1890s. During the [Battle of Singapore](/wiki/Battle_of_Singapore) on 15 February 1942 at 3:30 pm, four bombs were dropped by the Japanese warplanes onto the complex; one bomb exploded near the main gate and damaged; the second bomb exploded near the orphanage, which destroyed it; the third bomb exploded in the field next to the chapel, scattered its stained glass windows including two of the large panels around the chapel's high altar; a fourth bomb exploded at the school field of the Saint Nicholas Girls' School. During the [Japanese Occupation of Singapore](/wiki/Japanese_Occupation_of_Singapore), about forty of the Sisters, together with the orphans and teachers were deported to a camp in [Bahau](/wiki/Bahau), [Negeri Sembilan](/wiki/Negeri_Sembilan), [Malaya](/wiki/British_Malaya) (present day [Malaysia](/wiki/Malaysia)), where many of them would die from the harsh conditions there. Two months later after the Occupation began, the school reopened under Japanese authority as the **Victoria Street Girls' School**. The remaining Sisters at the Town Convent had to wear armbands to show they were not British people, and had to learn Japanese in order to teach Japanese curriculum to their students. Students there were made to learn Japanese songs and watch Japanese films as part of the curriculum. Following the surrender of the Japanese in 1945, the school resumed under its former name. Later in 1949, one of the bungalows' room had suddenly collapsed. The bungalows were subsequently deemed unsafe and demolished in 1950. The new three storey building blocks designed by Swan & Maclaren was later built on the former site and completed by 1951. In 1964, the school was separated into primary and secondary sections. In 1983, the [Singapore Government](/wiki/Singapore_Government) acquired the land from the Convent and the schools were allocated a new site in Toa Payoh. The last [religious service](/wiki/Church_service) was held in the chapel on 3 November 1983, after which the chapel was [deconsecrated](/wiki/Deconsecration) and the town convent was closed. By December 1983, both primary and secondary schools had vacated the site and moved to their new premises in Toa Payoh, where they began operations in the following year. Part of the former schools was demolished in 1984 with one of its remaining block was incorporated in part of the [SMRT Headquarters Building](/wiki/SMRT_Headquarters_Building) which was later built on its former site. The [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) put up the site for sale in March 1990 and later had the [Convent of the Holy Infant Jesus Chapel](/wiki/Convent_of_the_Holy_Infant_Jesus_Chapel) and [Caldwell House](/wiki/Caldwell_House,_Singapore) gazetted as [national monuments](/wiki/National_Monuments_of_Singapore) on 26 October 1990. The complex underwent extensive restoration works in 1991, careful [restoration](/wiki/Building_restoration) work had preserved much of the original structure of the convent: the Caldwell House, the chapel, and the remaining school blocks which were spared from demolition. In 1996, after almost five and a half years of [conservation](/wiki/Architectural_conservation) and construction work, what was once the Convent of the Holy Infant Jesus and the seat of education for generations of Singapore girls, has been converted into a plaza of theme retail and food and beverage outlets interspersed with ample outdoor spaces and [courtyards](/wiki/Courtyard), [cloistered](/wiki/Cloister) walls and long, covered walkways. This haven in the city hub of Singapore, now known as CHIJMES, is a [S$](/wiki/S$)100 million project unmatched for its location and unique ambiance. The CHIJMES won a Merit Award in the UNESCO Asia Pacific Heritage Awards for Cultural Heritage Conservation in 2002. ## Architecture The Convent of the Holy Infant Jesus is distinctive for being an architecturally self-contained city block in Singapore. It contains groups of buildings of different styles and periods to maintain diversity in [aesthetics](/wiki/Aesthetics). They are formed around [courtyards](/wiki/Courtyard) and other expansive spaces, [landscaped](/wiki/Landscape_architecture) and enclosed with walls which scale with its urban surroundings. The various buildings are related by design with the intent to form exterior spaces that would be pleasing for its users and were used for church school activities until November 1983 when the school vacated the premises. The spaces contained within the whole block have been adapted for [public use](/wiki/Public_space), and form one of the major buildings in the Central Area. ### Caldwell House Caldwell House was purchased for the convent by Father [Jean-Marie Beurel](/wiki/Jean-Marie_Beurel), a French missionary, who also established [Saint Joseph's Institution](/wiki/Saint_Joseph%27s_Institution), the former site of which is now the [Singapore Art Museum](/wiki/Singapore_Art_Museum), and the [Cathedral of the Good Shepherd](/wiki/Cathedral_of_the_Good_Shepherd), where he was the parish priest. Caldwell House was built from 1840 to 1841 for H.C. Caldwell, a [magistrate](/wiki/Magistrate)'s [clerk](/wiki/Clerk_(position)), is the oldest building in this [enclave](/wiki/Enclave), which also includes the Gothic chapel and Saint Nicholas Girls' School buildings. The [bay](/wiki/Bay_(architecture)) on the upper floor became the sisters' lounge. It was in the Caldwell House that the nuns did their sewing, reading, and writing for so many years in the semicircular upstairs room whilst the first story served as a parlour and visitors' room. Caldwell House was designed by [George Drumgoole Coleman](/wiki/George_Drumgoole_Coleman), and is an example of his [Neoclassical](/wiki/Neoclassical_architecture) style. ### CHIJMES Hall The early [Gothic Revival](/wiki/Gothic_Revival_architecture) style [Convent of the Holy Infant Jesus Chapel](/wiki/Convent_of_the_Holy_Infant_Jesus_Chapel) has finely detailed works, such as the [plasterwork](/wiki/Plasterwork), the wall [frescoes](/wiki/Fresco) and [stained glass](/wiki/Stained_glass) panels. The grand Anglo-French chapel was established with the support of the Catholic community in Singapore and beyond. Designed by Father [Charles Benedict Nain](/wiki/Charles_Benedict_Nain), the chapel is one of the most elaborate [places of worship](/wiki/Places_of_worship) ever built in Singapore. The chapel's stained-glass windows were designed by Jules Dobbelaere and were imported from [Bruges](/wiki/Bruges), [Belgium](/wiki/Belgium). A five-story [spire](/wiki/Spire) flanked by flying [buttresses](/wiki/Buttress) marks the entrance to the chapel. The 648 [capitals](/wiki/Capital_(architecture)) on the [columns](/wiki/Column) of the chapel and its corridors each bear a unique impression of tropical [flora](/wiki/Flora) and birds. ## Physical alterations within CHIJMES Apart from having part of its compound taken by MRTC headquarters, the remaining site went through several modifications in order to increase its commercial viability. In 2013, CHIJMES was given a $45 million uplift. Some of these physical changes include the 1) lowering of cloister walls along Victoria Street, 2) 4 new entrances, 3) Access to the chapel and Caldwell house 4) removal of cobblestone floor and lifting of the roof, 5) covering of sunken courtyards. **Lowering of cloister walls along Victoria Street** - The upper section of the cloister walls is replaced by metal grilles to allow Chijmes to be visible from the street. **New entrances** - Apart from the main entrance on Victoria Street, three entrances will be added to the complex - along Bras Basah Road, North Bridge Road and the last one at the junction of both roads. These entrances act as \"Historical Portals\" with narratives on the walls telling the Chijmes heritage. **Access to the chapel and Caldwell House** - The front of the chapel is now replaced by glass doors and walls and is open to visitors to tour its interior. **Change of cobblestone floor and elevating the roof** - The old cobblestone flooring in Chijmes’ driveway, forecourt, and Caldwell House have been replaced with large black granite pavers to make it more pedestrian-friendly. - The roofs of the old walkways are elevated and replaced with glazed panels, to allow for increased light penetration. **Sunken courtyards sheltered** - Previously, there was a big, open space below ground behind the chapel, which housed an open-air area and outdoor seating. Now, the area is being covered with a glass ceiling that will protect the patrons from the elements. ## Gallery ## In popular culture The [wedding](/wiki/Wedding) scene in [*Crazy Rich Asians*](/wiki/Crazy_Rich_Asians_(film)) took place at [CHIJMES Hall](/wiki/CHIJMES_Hall). ### Bibliography Listen to this article (1 minute)was created from a revision of this article dated 15 February 2006 (2006-02-15), and does not reflect subsequent edits.(Audio help · More spoken articles) - Official website - Uniquely Singapore article - Journey to Singapore's Yesteryears – CHIJMES\n",
  "language": "en",
  "processed_at": "2026-01-12T09:59:35.011768",
  "title": "CHIJMES",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/CHIJMES"
}