{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:59:38.738799"
  },
  "content": "Church in SingaporeChurch in Singapore, Singapore **CHIJMES Hall** was the former **Convent of the Holy Infant Jesus Chapel** located at the [CHIJMES](/wiki/CHIJMES) complex in [Singapore](/wiki/Singapore). The former [chapel](/wiki/Chapel) was designed by Father Charles Benedict Nain, it currently serves as a [function hall](/wiki/Function_hall) venue for weddings and corporate events. ## History The First [Chapel](/wiki/Chapel) of the [Convent of the Holy Infant Jesus](/wiki/Convent_of_the_Holy_Infant_Jesus) was built and consecrated in Singapore on 1855 for the Town Convent. As the old dilapidating chapel had become hazardous, the [Sisters of the Holy Infant Jesus](/wiki/Sisters_of_the_Holy_Infant_Jesus) had to celebrate [mass](/wiki/Mass_(liturgy)) at the [Caldwell House](/wiki/Caldwell_House,_Singapore). They soon started [fund-raising](/wiki/Fund-raising) by various means for the new chapel to replace the former. ### Architecture In 1898, Father [Charles Benedict Nain](/wiki/Charles_Benedict_Nain), an architect and priest of [Church of Saints Peter and Paul](/wiki/Church_of_Saints_Peter_and_Paul,_Singapore), designed a new [Gothic Revival](/wiki/Gothic_Revival_architecture) chapel for the Convent. The architectural firm [Swan and Maclaren](/wiki/Swan_and_Maclaren) would oversaw the construction of the chapel. The chapel's stained-glass windows imported from [Bruges](/wiki/Bruges), [Belgium](/wiki/Belgium) in 1904 were designed by Jules Dobbelaere. A five-storey [spire](/wiki/Spire) flanked by flying [buttresses](/wiki/Buttress) marked the entrance to the chapel. The 648 [capitals](/wiki/Capital_(architecture)) on the [columns](/wiki/Column) of the chapel and its corridors each bear a unique impression of tropical [flora](/wiki/Flora) and birds. ### Consecration The new **Convent of the Holy Infant Jesus Chapel** was completed in 1903 and consecrated on 11 June 1904. The Entrance Gate pillars were later added to the front of the Chapel on the same year. ### Deconsecration In 1983, the [Singapore Government](/wiki/Singapore_Government) had acquired the land from the Convent. The last [mass](/wiki/Mass_(liturgy)) was held at the chapel on 3 November 1983 before it was deconsecrated for non-religious use. ## Restoration The [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) put up the site for sale in March 1990 and gazetted the Convent of the Holy Infant Jesus Chapel and [Caldwell House](/wiki/Caldwell_House,_Singapore) as national monuments on 26 October 1990, in order to preserve the ambience of the remaining buildings and designated the entire complex as a conservation area, with high restoration standards and strict usage guidelines. The remaining buildings, the Convent of the Holy Infant Jesus Chapel, Caldwell House, and the remaining former school blocks underwent extensive restoration works in 1991 and reopened as a complex known as [CHIJMES](/wiki/CHIJMES) in 1996. The work was undertaken by Ong & Ong Architects with the help of Didier Repellin, Chief Architect for France’s Monuments Historiques who oversaw the meticulous restoration of the stained glass windows. New buildings were designed to complement the national monument, and the existing buildings were sensitively and tastefully restored. A new basement level was introduced, to increase the retail space and add underground car parking. New elements included tasteful fountains and new period-appropriate cast iron standard lamps. The centrepiece of the new additions is the sunken 'fountain court' which surrounds the liturgical east end of the chapel and featured a fountain with metal sculptures of foliage emitting water. This work won an Architectural Heritage Award in 1997 from the Urban Redvelopment Authority of Singapore The former convent has since undergone several more renovations, in 2014 which involved the introduction of additional structures in a contrasting modernist style and temoporary-looking awnings, and the removal of many of the decorative features of the previous restoration such as the fountains, and filling in many of the former courtyard spaces with additional awnings and seating for restaurants. The former chapel has since been renamed to **CHIJMES Hall**. Its [function hall](/wiki/Function_hall) is managed by the Watabe Singapore, and currently serves as a venue for wedding and corporate functions. ## Gallery ## In popular culture The [wedding](/wiki/Wedding) scene in [*Crazy Rich Asians*](/wiki/Crazy_Rich_Asians_(film)) took place in this former chapel. - CHIJMES website\n",
  "language": "en",
  "processed_at": "2026-01-12T09:59:38.738269",
  "title": "CHIJMES Hall",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/CHIJMES_Hall"
}