{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:02:34.354896"
  },
  "content": "Museum in Singapore The **Children's Museum Singapore**, formerly **Singapore Philatelic Museum**,[a] was a museum about children's history and formerly the postal history of Singapore and its [stamps](/wiki/Postage_stamp). ## Background The museum, located at 23-B Coleman Street in [Singapore](/wiki/Singapore), was formerly part of the [Anglo-Chinese School](/wiki/Anglo-Chinese_School), completed in 1906. In the 1970s, the building became the Methodist Book Room until it was restored to become the present museum. The museum is currently closed for renovations. Singapore Philatelic Museum opened on 19 August 1995 to promote interest in and the appreciation of [Singapore's history](/wiki/History_of_Singapore) and heritage in [philately](/wiki/Philately). Besides the permanent galleries, the theme galleries offered a host of changing exhibitions throughout the year. These included displays from the private collections of renowned philatelists, travelling exhibitions from overseas and themed exhibitions to commemorate new stamp issues. The museum had a stamp shop, and was popular with stamp collectors. There were files where visitors could inspect all of the Republic of Singapore stamps issued. Also on exhibit was a German forgery of a British postage stamp printed during [World War II](/wiki/World_War_II) which has a printing error which intentionally mocks [King George VI](/wiki/George_VI). Near the Singapore Philatelic Museum is the recently restored Masonic Club. On 6 March 2020, it was announced that it will become a dedicated children’s museum when it reopens in 2021. On 7 December 2021, it was announced that due to delays caused by the [COVID-19 pandemic](/wiki/COVID-19_pandemic_in_Singapore), the reopening was pushed back to December 2022. The **Children's Museum Singapore** officially opened on 8 December 2022 by Deputy Prime Minister [Heng Swee Keat](/wiki/Heng_Swee_Keat). Baldwin's Auctions of [Stanley Gibbons](/wiki/Stanley_Gibbons) was selected to sell the key items from the Museum's collection in 2024. The collection was sold in two parts; the first part in April and the second in August 2024. - [List of museums in Singapore](/wiki/List_of_museums_in_Singapore) - [Philately](/wiki/Philately) - [Stamp collecting](/wiki/Stamp_collecting) - [List of philatelic museums](/wiki/List_of_philatelic_museums) ## Notes ## Literature - Lenzi, Iola (2004). *Museums of Southeast Asia*. Singapore: Archipelago Press. p. 200 pages. [ISBN](/wiki/ISBN_(identifier)) 981-4068-96-9. - Singapore Philatelic Museum Website - Virtual Tours of the Singapore Philatelic Museum This article about a Singapore building or structure is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T10:02:34.354394",
  "title": "Children's Museum Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Children%27s_Museum_Singapore"
}