{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:03:02.716246"
  },
  "content": "People of Chinese nationality residing in SingaporeEthnic group **Chinese nationals in Singapore** ([Chinese](/wiki/Chinese_language): 居住在新加坡的中国国民) refers to Chinese people who are of [Chinese nationality](/wiki/Chinese_nationality_law) residing in Singapore. According to the [United Nations Department of Economic and Social Affairs](/wiki/United_Nations_Department_of_Economic_and_Social_Affairs), the community had a population of 514,110 in 2020, with 65,867 originating from [Hong Kong](/wiki/Hong_Kong) and 21,809 from [Macau](/wiki/Macau), the 2 [special administrative regions of China](/wiki/Special_administrative_regions_of_China).[a] The community of Chinese nationals are the 2nd largest foreign community in Singapore, constituting 18% of the country's foreign-born population. Chinese migration to Singapore has been happening since the 19th century, after the founding of Singapore as a free port by Stamford Raffles in 1819. The demand for a skilled workforce and labour in Singapore was the driving force for attracting Chinese migrants to Singapore during that period of time. Today, newer Chinese migrants includes migrant workers working in various industries of the Singapore economy, with a mix of [blue-collar workers](/wiki/Blue-collar_worker) and [white-collar workers](/wiki/White-collar_worker), as well as students. ## History During the 19th century, many [Chinese](/wiki/China) nationals migrated to [Southeast Asia](/wiki/Southeast_Asia). Many were unskilled and migrated from China to [Southeast Asia](/wiki/Southeast_Asia) for jobs during the colonial period of the region. In 1821, the first Chinese [junk](/wiki/Junk_(ship)) arrived in Singapore, then a [newly founded British port](/wiki/Founding_years_of_modern_Singapore). During this period of time, the port of Singapore became one of the largest hubs in Asia, beating out [Batavia](/wiki/Batavia,_Dutch_East_Indies) (present day Jakarta, Indonesia) as an international trading port. By 1871, due to the influx of migrants from [Malaya](/wiki/Malay_Peninsula), China, India and other parts of Asia, Singapore's population had reached nearly 100,000, with over half of them being Chinese. By the 1930s, there were 4 million ethnic Chinese living in Southeast Asia, forming a significant minority population within different territories in the region. Today, descendants of early Chinese migrants make up the bulk of the population of [Chinese Singaporeans](/wiki/Chinese_Singaporeans). Newer Chinese migration today began from the 1980s, with many of them working in blue-collar jobs during Singapore's rapid industrialisation which began in the 1970s. After the [1989 Tiananmen Square protests and massacre](/wiki/1989_Tiananmen_Square_protests_and_massacre), the Singaporean government offered 25,000 permanent residency status to Hong Kong residents for them to settle in Singapore. One of the reasons was also to maintain the racial percentage of the 3 major ethnic groups in Singapore, with Singaporeans migrating aboard and to offset the declining birth rate. Education in Singapore is also another reason for migration, with the Singaporean government providing scholarships to attract international students outside of [ASEAN](/wiki/ASEAN) countries. This includes pre-tertiary and undergraduate institutions, and although the scholarships are bond-free, recipients would have to work in a Singaporean company for a period of time before they can leave the country. Another reason for migration is investments, where Chinese generally open a family office to get a golden visa for residency and work in Singapore. Without disclosing the country of origin, according to the Monetary Authority of Singapore, the number of family offices in Singapore almost doubled to 700 between 2020 and 2021. ### Demographics Population of Chinese nationals in Singapore from 1990 to 2019 yearpopulation1990177,2451995233,0922000311,5012005366,0572010441,0082015532,7342020514,110 In 1990, according to the [United Nations Department of Economic and Social Affairs](/wiki/United_Nations_Department_of_Economic_and_Social_Affairs), among the 177,245 Chinese nationals residing in Singapore, there were a total of 150,447 from [Mainland China](/wiki/Mainland_China), 15,043 from [Hong Kong](/wiki/Hong_Kong) and 11,755 from [Macau](/wiki/Macau) residing in Singapore. In 2000, the number of Chinese nationals increased to 311,501 individuals. Individuals from mainland China and Hong Kong increased by 66.3% and 70.7% respectively while the number of Chinese nationals from Macau decreased by 16.1% for that year. Since then, the population of Chinese nationals residing in Singapore has increased steadily and it reached a total population of 532,734 in 2015, before falling to 514,110 in 2020. One of the reasons for the decline might be due to the Singapore government tightening immigration rules in that same year for hiring foreigners. In 2020, policies on hiring foreigners were further amended by the Ministry on Manpower to encourage companies to practice fair employment practices. ## Integration into Singaporean society Integration of newer Chinese migrants has been harder due to different cultural behaviours and norms between Singaporeans. With the increase of Chinese nationals in Singapore, they are stereotyped as uncouth and having objectionable behaviours like [littering](/wiki/Littering), eating on public transit, and talking loudly on the phone. The general high influx of immigrants has also resulted in an increase of xenophobic behaviour against other foreign communities in Singapore. Another reason would be the perception that the Singaporean government gives special treatment to foreigners or permanent residents as compared to Singaporeans, even though some of them do not pledge allegiance to the country. Some newer Chinese migrants tend to regard Singapore as a Chinese society, as a large majority of the Singaporean population is of ethnic Chinese descent, with a \"sense of familiarity\". This results in some of the newer migrants choosing not to communicate in or learn the country's lingua franca, English resulting in misunderstandings and thus, being unable to integrate well into Singaporean society. A 2016 [James Cook University](/wiki/James_Cook_University_Singapore) study of Singaporean locals and (mostly mainland) Chinese students had almost 69% of the former saying they had the experience of working with international Chinese students in projects. Most Singaporean respondents said they had pleasant interactions with Chinese students while 46% reported they had many Chinese international students as their friends. Most Chinese students also said they had positive interactions with Singaporeans, though only 31% said they had many local friends. A 2016 [NUS](/wiki/National_University_of_Singapore) study of 10 PRC wives and 20 PRC students in Singapore found that 80% of the former and 100% of the latter said improving their English was important. For mainland wives, 80% agreed that one should speak more English since it is the official language, 100% said being polite to strangers was important, and 90% said being polite to those they know was important. For mainland students, the figures were 85%, 90%, & 65% respectively. A 2018 [Nanyang Technological University](/wiki/Nanyang_Technological_University) paper suggested that Chinese national respondents in Singapore had adopted the idea of English being the language that would get them access to higher status. ### Controversies Wang Peng Fei derogatory video incident In July, 2011, Wang Peng Fei, then a student of East Asia Institute of Management, uploaded a parody video making derogatory comments about Singaporeans and Singapore culture. Amongst other topics mentioned in the video were comments about Singapore's low fertility rate and racist comments against [Indian Singaporeans](/wiki/Indian_Singaporeans). He apologised after the online backlash. Wang was then expelled and a police report was also made against him for his comments, which is a chargeable offence under [Singaporean law](/wiki/Sedition_Act_(Singapore)) if convicted. Curry incident In August, 2011, a new migrant Chinese family was reported to have complained about the smell of their Indian Singaporean neighbour cooking curry. Despite their neighbour closing windows and doors of their home when they were cooking the dish, the Chinese family wanted their neighbours to not cook the dish entirely, which was part of Singaporean cuisine. After the dispute was reported in the newspaper, it received public backlash from Singaporeans and negative comments, mainly towards the Chinese migrant family. A Facebook movement in response to the Chinese family's comments was also started. The dispute was mediated by the Community Mediation Centre, under the Ministry of Law and a compromise was reached between the two families. Sun Xu 'dogs' comment In February 2012, Sun Xu, an undergraduate with the [National University of Singapore](/wiki/National_University_of_Singapore) under a scholarship provided by the [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)) made derogatory comments against Singaporeans on his [microblog](/wiki/Microblogging). After receiving heavy online backlash, Sun issued two separate apologies and was fined S$3,000 by NUS along with having his scholarship revoked. He also had to pay back the scholarship benefits that he received, as well as serve community service with the university for three months. ## Notable people - [Cao Ruyin](/wiki/Cao_Ruyin), a Chinese murder victim who worked as a construction worker in Singapore. His killer [Kho Jabing](/wiki/Kho_Jabing) was executed in 2016. - [Li Jiawei](/wiki/Li_Jiawei), a former table tennis player who established her own academy in Singapore and was part of a team that had earned the country's first Olympic medal since 1965. - [Jing Junhong](/wiki/Jing_Junhong), a former table tennis player and eventual coach for the Singaporean national team. - [Frances Liu](/wiki/Frances_Liu), a former badminton player and currently a senior coach for the Badminton Academy at [Singapore Sports School](/wiki/Singapore_Sports_School). - [Jiang Yanmei](/wiki/Jiang_Yanmei), a former badminton player and current coach with the [Singapore Badminton Association](/wiki/Singapore_Badminton_Association). - [Chris Xu](/wiki/Chris_Xu_(entrepreneur)), founder of fashion e-commerce giant [Shein](/wiki/Shein). - [Lucy Peng](/wiki/Lucy_Peng), co-founder of [Alibaba Group](/wiki/Alibaba_Group) and [Ant Group](/wiki/Ant_Group) and chairman of [Lazada Group](/wiki/Lazada_Group). - [Qi Yuwu](/wiki/Qi_Yuwu), a Guangzhou-born actor currently based in Singapore. - [Xu Bin](/wiki/Xu_Bin), a Chinese actor based in Singapore. - [Jeffrey Xu](/wiki/Jeffrey_Xu), a Chinese actor based in Singapore. - [Ian Fang](/wiki/Ian_Fang), a Chinese convicted sex offender and retired actor based in Singapore. - [China-Singapore relations](/wiki/China%E2%80%93Singapore_relations) ## Notes ## Bibliography - Chong Guan Kwa, Bak Lim Kua (2019), *A General History Of The Chinese In Singapore*, World Scientific, [ISBN](/wiki/ISBN_(identifier)) 9789813277656 - Aris Ananta, Evi Nurvidya Arifin (2004), *International Migration in Southeast Asia*, Institute of Southeast Asian Studies, [ISBN](/wiki/ISBN_(identifier)) 9789812302793 Portals: - Language - China - Singapore\n",
  "language": "en",
  "processed_at": "2026-01-12T10:03:02.715847",
  "title": "Chinese nationals in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Chinese_nationals_in_Singapore"
}