{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:02:44.456274"
  },
  "content": "The **Chinese Development Assistance Council** (**CDAC**; [traditional Chinese](/wiki/Traditional_Chinese_characters): 華社自助理事會; [simplified Chinese](/wiki/Simplified_Chinese_characters): 华社自助理事会; [pinyin](/wiki/Pinyin): *Huáshè Zìzhù Lǐshì Huì*) is a [non-profit](/wiki/Nonprofit_organization) self-help group that provides assistance to the Chinese community in Singapore. Jointly set up by the [Singapore Chinese Chamber of Commerce and Industry](/wiki/Singapore_Chinese_Chamber_of_Commerce_and_Industry) (SCCCI) and the [Singapore Federation of Chinese Clan Associations](/wiki/Singapore_Federation_of_Chinese_Clan_Associations) (SFCCA), its aims are to help the less privileged in the community maximise their potential and strive for social mobility through self-help and mutual support. CDAC is one of the four \"self-help groups\" (SHGs) in Singapore that serves their own respective ethnic community — which also includes **[Singapore Indian Development Association](/wiki/Singapore_Indian_Development_Association) (SINDA)**, Eurasian Association and Yayasan Mendaki. CDAC's programmes primarily covers support through education, family support and wellness for senior citizens. ## History ### 1990s #### Founding years Founded on May 22nd 1992, CDAC's mission was to \"To nurture and develop the potential of the Chinese Community in contributing to the continued success of multi-racial Singapore\". Mr [Wong Kan Seng](/wiki/Wong_Kan_Seng) and Mr [Wee Cho Yaw](/wiki/Wee_Cho_Yaw) were appointed as the first Chairmen for Board of Directors and Board of Trustees respectively. Back then, the council operated out of a temporary office in [SCCCI](/wiki/Singapore_Chinese_Chamber_of_Commerce_and_Industry). The original CDAC Logo, designed by Mr Lee Tee Song, then-art editor of Lianhe Zaobao, was launched in September. The design was inspired by traditional [Spring Festival couplets](/wiki/Fai_chun). Top portion of the lines symbolises the efforts and endeavours made by the beneficiaries for educational advancement, self-reliance and self-improvement. The lower portion of the lines symbolises the assistance and support provided by the community, which appears as a strong and unyielding motivating force. Within months of setting up, CDAC started providing short-term financial hardship assistance to individuals and families. This was subsequently re-constituted as the CDAC-[SFCCA](/wiki/Singapore_Federation_of_Chinese_Clan_Associations) Hardship Assistance Fund. - Singapedia - Chinese Development Assistance Council homepage (archive link) This Singapore-related article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T10:02:44.455833",
  "title": "Chinese Development Assistance Council",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Chinese_Development_Assistance_Council"
}