{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:03:08.702957"
  },
  "content": "Various types of sausage from China **Chinese sausages** are many different types of [sausages](/wiki/Sausage) with ties to [China](/wiki/History_of_China), the [Sinosphere](/wiki/Sinosphere) or the [Chinese diaspora](/wiki/Chinese_diaspora). ## Varieties There is a choice of fatty or lean sausages. There are different kinds ranging from those made using fresh pork to those made using pig livers, duck livers and even [turkey](/wiki/Turkey_(bird)) livers. Usually a sausage made with liver will be darker in color than one made without liver. Recently, there have even been countries producing chicken Chinese sausages. Traditionally they are classified into two main types. It is sometimes rolled and steamed in [dim sum](/wiki/Dim_sum). - *Lap cheong* (Cantonese, or [simplified Chinese](/wiki/Simplified_Chinese_characters): 腊肠; [traditional Chinese](/wiki/Traditional_Chinese_characters): 臘腸; [pinyin](/wiki/Pinyin): *làcháng*; [Jyutping](/wiki/Jyutping): *laap6 coeng2*; [Cantonese Yale](/wiki/Yale_romanization_of_Cantonese): *laahp chéung*; lit. 'preserved sausage') is a dried, hard [sausage](/wiki/Sausage) usually made from [pork](/wiki/Pork) and pork fat. It is normally smoked, sweetened, and seasoned with [rose water](/wiki/Rose_water), [rice wine](/wiki/Rice_wine) and [soy sauce](/wiki/Soy_sauce). - *Yun chang* (simplified Chinese: 膶肠; traditional Chinese: 膶腸; pinyin: *rùn cháng*; Jyutping: *jeon2 coeng2*; Cantonese Yale: *yéun chéung*; lit. 'liver sausage') is made using [duck](/wiki/Duck) liver. - *Xiang chang* (simplified Chinese: 香肠; traditional Chinese: 香腸; pinyin: *xiāng cháng*; Jyutping: *hoeng1 coeng2*; Cantonese Yale: *hēung chéung*; lit. 'aromatic sausage') is a fresh and plump sausage consisting of coarsely chopped pieces of pork and [un-rendered](/wiki/Rendering_(food_processing)) pork fat. The sausage is rather sweet in taste. - *Nuomi chang* (simplified Chinese: 糯米肠; traditional Chinese: 糯米腸; pinyin: *nuòmǐ cháng*; Jyutping: *no6 mai5 coeng2*; Cantonese Yale: *noh máih chéung*; lit. 'glutinous rice sausage') is a white-colored sausage consisting of [glutinous rice](/wiki/Glutinous_rice) and flavoring stuffed into a casing and then steamed or boiled until cooked. The *nuomi chang* of some Chinese cultures have blood as a binding agent similar to Korean [*sundae*](/wiki/Sundae_(Korean_food)).[*citation needed*] - *Xue chang* (simplified Chinese: 血肠; traditional Chinese: 血腸; pinyin: *xuě cháng*; Jyutping: *hyut3 coeng2*; Cantonese Yale: *hyut chéung*; lit. 'blood sausage') are Chinese sausages that have [blood as the primary ingredient](/wiki/Blood_sausage). - *Bairouxue chang* (simplified Chinese: 白肉血肠; traditional Chinese: 白肉血腸; pinyin: *báiròuxuě cháng*; Jyutping: *baak6 juk6 hyut3 coeng2*; Cantonese Yale: *baahk yuhk hyut chéung*; lit. 'white meat blood sausage') is a type of sausage popular in [northeast China](/wiki/Northeast_China) that includes chopped meat in the blood mixture. - *Guan chang* (Chinese: 贯肠; lit. 'through sausage') is a long, red sausage made of fresh meat. ## Regional ### Lap cheong Lap cheong, or Chinese sausage, is a type of [cured meat](/wiki/Curing_(food_preservation)) product commonly found in southern regions of China such as [Jiangsu](/wiki/Jiangsu), [Zhejiang](/wiki/Zhejiang), [Sichuan](/wiki/Sichuan), and [Guangdong](/wiki/Guangdong). The southern flavor of Chinese sausage is commonly known by its [Cantonese](/wiki/Cantonese) name ***lap cheong*** (or ***lap chong***, simplified Chinese: 腊肠; traditional Chinese: 臘腸; pinyin: *làcháng*; Jyutping: *laap6 coeng2*; Cantonese Yale: *laahp chéung*). Chinese sausage is used as an ingredient in a number of dishes in the [southern Chinese](/wiki/Northern_and_southern_China) provinces of [Guangdong](/wiki/Guangdong), [Fujian](/wiki/Fujian), [Jiangxi](/wiki/Jiangxi), [Sichuan](/wiki/Sichuan), and [Hunan](/wiki/Hunan), and also [Hong Kong](/wiki/Hong_Kong) and [Taiwan](/wiki/Taiwan). ### Sichuan sausage Sichuan sausage contains and is flavored by red chili powder, Sichuan pepper powder, and Pixian bean sauce. Two common examples of such dishes include [fried rice](/wiki/Fried_rice) and *[lo mai gai](/wiki/Lo_mai_gai)*. The traditional unpackaged forms are usually found in [street markets](/wiki/Street_market) or [wet markets](/wiki/Wet_market). ### Harbin-style sausage In [northeast China](/wiki/Northeast_China), especially [Heilongjiang](/wiki/Heilongjiang)'s largest city [Harbin](/wiki/Harbin), **Harbin-style sausage** (simplified Chinese: 红肠; traditional Chinese: 紅腸; pinyin: *hóngcháng*), a popular regional specialty, is a coarsely ground, smoked savory red sausage similar to Polish \"country\" [kielbasa](/wiki/Kielbasa) and Lithuanian [skilandis](/wiki/Skilandis). It was first manufactured in March 1909 by [Lithuanian](/wiki/Lithuanians) staff in a Russian-capitalized factory named [Churin Sausage Factory](/wiki/Qiulin_Group), located in Harbin's Daoli District. An alternative name is **lidaosi** (Chinese: 里道斯), from Russian колбаса литовская (*kolbasa litovskaya*, \"Lithuanian sausage\"). Harbin-style sausage subsequently became popular in China, especially in northern regions. A sweeter dried version similar to southern Chinese sausages is also produced. ## Production Traditional Chinese sausage is made by stuffing seasoned [pork](/wiki/Pork) into natural casings made from animal intestines, then air-drying it naturally. However, in modern factory production, artificial casings are often used, and hot-air drying is employed to enhance production efficiency. Lap cheong can be eaten on its own and is also widely used as an ingredient in various Cantonese dishes. Chinese sausage is believed to have originated during the Wei, Jin, and Northern and Southern Dynasties, or even earlier. Its earliest documented method appears in the *Qimin Yaoshu*, an agricultural text from the [Northern Wei](/wiki/Northern_Wei) period. The main ingredients for Chinese sausage are pork and [sausage casings](/wiki/Sausage_casing). First, the pork is finely chopped and mixed according to the desired ratio of fat to lean meat. [Salt](/wiki/Salt), [sugar](/wiki/Sugar), [rice wine](/wiki/Rice_wine), [soy sauce](/wiki/Soy_sauce), and other [seasonings](/wiki/Seasoning) are added. The seasoned meat is then stuffed into casings, compressed, and segmented using string into desired lengths. One end is tied off, while the other end is fitted with a string for hanging. The sausages are then [dehydrated](/wiki/Dehydration) using either natural air drying or hot-air drying, allowing for long-term preservation. ## Uses Compared to other types of preserved meats, Chinese sausage retains its pork fat better due to the casing that encases the meat mixture. In Guangdong and Hong Kong, Chinese sausage is a key ingredient in making *lap mei fan* (claypot rice with preserved meats). Whole sausages are placed on top of uncooked [rice](/wiki/Rice) and steamed together. Once cooked, the rich, flavorful oils from the Chinese sausage infuse the rice, giving it a distinctive aroma and taste. Chinese sausage buns (*lap cheong bao*) are steamed buns made with whole sausages inside. Sliced Chinese sausage can also be stir-fried with vegetables or mixed into other dishes. It is a common ingredient in a variety of Cantonese foods, including [stir-fried glutinous rice](/wiki/Stir-fried_glutinous_rice), *[lo mai gai](/wiki/Lo_mai_gai)* (sticky rice in lotus leaf), and [turnip cake](/wiki/Turnip_cake). ## Health concerns Because Chinese sausage is a processed food made from pork, it is often difficult for consumers to determine whether the source of the ingredients and the production methods meet hygiene standards. In the past, some producers were exposed for using pigs of unknown cause of death as raw material. Others added inedible [dyes](/wiki/Dye) or excessive [preservatives](/wiki/Preservative) to make the sausages appear more visually appealing to consumers. On September 14, 2006, Hong Kong’s [Food and Environmental Hygiene Department](/wiki/Food_and_Environmental_Hygiene_Department) released [chemical](/wiki/Chemistry) and [microbiological](/wiki/Microorganism) test results for seasonal festive foods. One sample of \"Fengcheng Sliced Pork Sausage\" produced in Macau was found to contain [rhodamine B](/wiki/Rhodamine_B), a banned dye also known colloquially as “flower red powder.” This substance can cause chest discomfort, [vomiting](/wiki/Vomiting), and damage to the [central nervous system](/wiki/Central_nervous_system). In January 2013, a business in [Zhejiang Province](/wiki/Zhejiang) was exposed for using pigs of unknown cause of death to produce Chinese sausage. A total of 7,500 kilograms of the resulting “toxic sausage” was distributed to various nearby provinces and cities. The responsible party was sentenced on August 23 of that year. ## In other countries ### Vietnam In [Vietnamese](/wiki/Vietnamese_language), Chinese sausage is called **lạp xưởng** or **lạp xường**. It has been incorporated into a variety of dishes from simple omelets to more complex main courses. Due to the salty taste of the sausages, they are used in moderation with other ingredients to balance the flavor. The sausages are made from pork (**lạp xưởng heo**) or chicken (**lạp xưởng gà**), the latter of which yields a leaner taste. *[Tung lò mò](/wiki/Tung_lamaow)* ([Cham](/wiki/Cham_language): ꨓꨭꩂ ꨤꨟꨯꨱꨥ *tung lamaow*) is a similar sausage made from beef by the [Chams](/wiki/Chams) (who are [Muslim](/wiki/Muslim)) in southern Vietnam. The province of [Sóc Trăng](/wiki/S%C3%B3c_Tr%C4%83ng_province) is the largest producer of these sausages, with other production areas including [Cái Lậy District](/wiki/Cai_L%E1%BA%ADy_district). In local cuisine, dried pork sausage is commonly used as a filling in dumplings, pillow cakes (*bánh gối*), wontons, spring rolls (*bánh tráng cuốn*), mooncakes, and sticky rice dumplings (*bánh chưng* or *bánh tét*). ### Myanmar In [Burmese](/wiki/Burmese_language), the sausage is called either **kyet u gyaung** (chicken sausage; ကြက်အူချောင်း) or **wet u gyaung** (pork sausage; ဝက်အူချောင်း). The sausages made in Myanmar are more meaty and compact compared to those in Singapore or China. They are usually used in fried rice and along with fried vegetables, mostly [cabbage](/wiki/Cabbage). ### Philippines In the [Philippines](/wiki/Philippines), Chinese sausage is an ingredient in some Chinese-Filipino dishes like *[siopao](/wiki/Siopao) [bola-bola](/wiki/Bola-bola)*. It is sometimes confused with and used in place of the native sausage *[chorizo de Macao](/wiki/Chorizo_de_Macao)* (which is also sometimes known as \"Chinese chorizo\"). The latter is not derived from the Chinese sausage, but derives its name from the use of [star anise](/wiki/Star_anise), which is associated with Chinese cuisine in the Philippines. ### Taiwan [Taiwan](/wiki/Taiwan) also produces a similar form of sausage; however, they are rarely dried in the manner of Cantonese sausages. The fat and meat may be emulsified, and a larger amount of sugar may be used, yielding a sweeter taste. These sausages are usually produced by local [butchers](/wiki/Butcher) and sold at markets or made at home. This variant of Chinese sausage is known as **xiangchang** (香腸) in Mandarin Chinese, literally meaning fragrant sausage. ### Singapore [Singapore](/wiki/Singapore) produces innovative Chinese sausages that could be considered healthier than the traditional variety. Examples include low-fat, low-sodium, and high-fibre Chinese sausages. ### Thailand In [Thai](/wiki/Thai_language), Chinese sausage is called **kun chiang** ([Thai](/wiki/Thai_language): กุนเชียง) after its name in the [Teochew Min](/wiki/Teochew_Min) (贯肠, *kwan chiang*), the dominant Chinese language within the [Thai Chinese](/wiki/Thai_Chinese) community. It is used in several Chinese dishes by the sizeable Thai Chinese community, and also in some [Thai dishes](/wiki/Thai_cuisine) such as **yam kun chiang**, a [Thai salad](/wiki/Thai_salad) made with this sausage. There is also Chinese sausage made with [snakehead fish](/wiki/Snakehead_(fish)) (**pla chon**; [Thai](/wiki/Thai_language): ปลาช่อน). ### Suriname In [Suriname](/wiki/Suriname), Chinese sausage is referred to by a [Hakka Chinese](/wiki/Hakka_Chinese) word (花肠, *fa1 cong3*, 'motled sausage') rendered as *fatjong*, *fachong*, *fa-chong*, *fashong*, or *fasjong* in colloquial spelling. It is part of the dish *[moksi meti tyawmin](/wiki/Surinamese_cuisine)* (mixed meat [chow mein](/wiki/Chow_mein)). ### Other regions Chinese sausages are generally available in [Asian supermarkets](/wiki/Asian_supermarket) outside Asia, mostly in a vacuum-packaged form, although some Chinese groceries sell the unpackaged varieties as well. These tend to be made domestically due to prohibitions on import of meat products from overseas. For example, many of the Chinese sausages sold in [Canada](/wiki/Canada) are produced by a number of manufacturers based in [Vancouver](/wiki/Vancouver) and [Toronto](/wiki/Toronto). *Lap cheong* is also a very popular sausage in Hawaii due to large numbers of Chinese in Hawaii who have incorporated it into local cuisine.[*citation needed*] ## Images - Food portal - [Curing (food preservation)](/wiki/Curing_(food_preservation)) - [Ham sausage](/wiki/Ham_sausage) – a mass-produced sausage in China - [List of dried foods](/wiki/List_of_dried_foods) - [List of sausages](/wiki/List_of_sausages) - [List of sausage dishes](/wiki/List_of_sausage_dishes) - [List of smoked foods](/wiki/List_of_smoked_foods)\n",
  "language": "en",
  "processed_at": "2026-01-12T10:03:08.702517",
  "title": "Chinese sausage",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Chinese_sausage"
}