{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:02:40.731334"
  },
  "content": "Singaporean politicianThis biography of a living person **needs additional citations for verification**. Please help by adding reliable sources. Contentious material about living persons that is unsourced or poorly sourced **must be removed immediately** from the article and its talk page, especially if potentially libelous. *Find sources:* \"Chin Tet Yung\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(August 2010)* *(Learn how and when to remove this message)* **Chin Tet Yung** ([Chinese](/wiki/Simplified_Chinese_characters): 陈德镛; [pinyin](/wiki/Pinyin): *Chén Déyōng*; born 2 August 1951) is a Singaporean former [Member of Parliament](/wiki/List_of_Singapore_MPs) for [Sembawang Group Representation Constituency](/wiki/Sembawang_Group_Representation_Constituency) (GRC), and also served previously as the chairman of the Government Parliamentary Committee for Home Affairs and Law from 2002 to 2005. He had been a Member of Parliament from 23 December 1996 to 20 April 2006. He announced his retirement from politics on 10 April 2006. ## Early life and education Chin was born on 2 August 1951 in [Sabah](/wiki/Sabah), Malaysia. His father was a businessman and his mother, a school teacher. Chin studied at [London School of Economics](/wiki/London_School_of_Economics) (LSE) and graduated with a law degree in 1973. He also studied postgraduate in law from [University of Oxford](/wiki/University_of_Oxford) and also has a postgraduate diploma in economics from LSE. ## Academic career Chin started teaching law as a lecturer at the [law faculty](/wiki/National_University_of_Singapore_Faculty_of_Law) of the [National University of Singapore](/wiki/National_University_of_Singapore) (NUS) in 1975. He served as the [dean](/wiki/Dean_(education)) of the law faculty between 1992 and 2001. He still teaches law at NUS as an emeritus professor. ## Political career Chin joined the [PAP](/wiki/People%27s_Action_Party) and stood for elections in (/wiki/1997_Singapore_general_election) and (/wiki/2001_Singapore_general_election), both in Sembawang GRC and won on both occasions. ## Personal life Chin came to Singapore in 1975 and became a Singapore citizen in 1987. Chin married a legal officer working with the Singapore government. They have a son and a daughter. This article about a politician from Singapore is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T10:02:40.730865",
  "title": "Chin Tet Yung",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Chin_Tet_Yung"
}