{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:02:50.842630"
  },
  "content": "In [Singapore](/wiki/Singapore), the [Chinese New Year](/wiki/Chinese_New_Year) is celebrated primarily by [Chinese Singaporeans](/wiki/Chinese_Singaporeans), or members of the Chinese diaspora located there, who make up over 75% of Singapore's population. The holiday is the start of a new year based on the traditional [lunisolar](/wiki/Lunisolar_calendar) [Chinese calendar](/wiki/Chinese_calendar). The majority of Chinese Singaporeans can trace their ancestry back to southern China, specifically [Guangdong](/wiki/Guangdong) and [Fujian](/wiki/Fujian). Outside of [greater China](/wiki/Greater_China), Singapore is the only country with an ethnic Chinese majority. The Chinese New Year is one of the gazetted [public holidays in Singapore](/wiki/Public_holidays_in_Singapore). ## Decorations In Chinatown area, the main attraction of lighted wire frame sculptures is established in the intersection of [New Bridge road](/wiki/New_Bridge_Road) and Upper Cross street. The theme and the models are created every year according to the zodiac symbol of the year. The area of different wire frame models and lighting decoration spans between the New Bridge road and [South Bridge road](/wiki/South_Bridge_Road), the surrounding of the [Buddha Tooth Relic Temple](/wiki/Buddha_Tooth_Relic_Temple) being another hot spot for the models. ## Customs ### Red colour In [Chinese culture](/wiki/Chinese_culture), red is the colour that represents success and celebration. The auspicious colour is believed to ward off any evil spirits and negative energy. This idea originated from the story of folk legend and mythical beast, *[Nian](/wiki/Nian)*, who is afraid of anything red. Thus, new year clothes and decorations put up are typically red in colour. Other than red, bright colours are usually worn during the Chinese New Year festivities. Clothes that are black or white are avoided as those colours are associated with death and mourning. ### Pre-Chinese New Year #### Little new year [Little New Year](/wiki/Little_New_Year), or Festival of the Kitchen God**,** is celebrated on the 24th day of the 12th month in the Chinese lunar calendar, marking the start of the new year celebration. It is believed that household deities report to the [Jade Emperor](/wiki/Jade_Emperor), ruler of heaven and earth, during Little New Year. Sweet food offerings like sweet cakes and rice dishes are provided for the [Kitchen God](/wiki/Kitchen_God), who is known to answer to the Jade Emperor. Usually, [firecrackers](/wiki/Firecracker) would also be lit to send off the deities before beginning spring cleaning. However, since the introduction of the Dangerous Fireworks Act, the use of firecrackers has been banned in Singapore. #### Spring cleaning Before the new year, homes are traditionally swept clean using bamboo leaves, a ritual believed to chase evil spirits, along with any bad luck or energy from the previous year, out of homes. It is customary not to clean by sweeping, mopping, scrubbing, or washing on the first day of Chinese New Year as it sweeps away good luck. Similarly, it is believed that hair should not be cut during the new year as any good luck would be snipped away. During this time, houses are also decorated with flower pots and red decorations such as scrolls and posters with auspicious phrases are put up at the main doorway. Those who celebrate also wear new clothes to usher in the new year, representing a fresh start. ### Chinese New Year's eve #### Ancestor worship Ancestor worship occurs on the eve of Chinese New Year before the family reunion dinner. Families worship their ancestors by offering joss sticks, prayers, and food offerings to invite their late family members to join the new year celebrations. #### Reunion dinner The tradition of the [reunion dinner](/wiki/Reunion_dinner) is held on the eve of Chinese New Year. Family members travel home to share a meal with their loved ones. Some traditional Chinese families may also invite their late ancestors to join in on the reunion dinner by providing offerings at the family altar. Sons are to return to their homes, while married daughters are to join their husbands' families for the reunion dinner on [New Year's Eve](/wiki/New_Year%27s_Eve). Food served at reunion dinners are usually in abundance as it is believed to bring great wealth in the new year. Traditional delicacies served during the reunion dinner include red dates, dried sea moss, ginkgo nuts, dried flaked bean, dried wood ear mushrooms, [rice vermicelli](/wiki/Rice_vermicelli), and dried pickled vegetables. #### Chinese New Year's eve vigil On the night before the new year, children are urged to stay awake past midnight. This not only serves as bidding the previous year farewell and welcoming the new year, but it is also believed to bring longevity to parents. The longer the children stay awake, the longer the lives of their parents. At the end of the night, children receive a red packet from their parents before going to bed. This red packet is often referred to as *ya sui qian* (压岁钱), and are traditionally placed under the children's pillows to ward off evil spirits. ### Chinese New Year #### Visiting Visiting occurs during the first 15 days of Chinese New Year. Colloquially known as *bai nian* (拜年), translating to \"pay a visit\", it refers to the act of visiting and greeting relatives and friends. Visits to homes usually go hand in hand with exchanging a pair of [Mandarin oranges](/wiki/Mandarin_orange), which represent wealth and good fortune, with the head of the household. It is considered ill-mannered to show up to a home visit empty handed. Before visits commence, children greet and pay their respects to their parents and elder relatives. At this time, red packets are usually given to children. On the first day, close and senior family members, such as parents or grandparents, are visited. Traditionally, the second day is for married women to visit their maiden homes. #### Red packets During the new year, [red packets](/wiki/Red_envelope) are typically given by married adults to those who are unmarried, younger siblings and cousins, and other relatives in the younger generation. In many cases, parents are also gifted these red packets. The money packed into the red packet should be an even number except ending with 4, with 8 being the most auspicious number. Odd numbers are usually associated with giving condolence money at funerals except ending with 9. Before receiving a red packet, it is customary for the recipient to say auspicious greetings such as 'Happy new year and a prosperous new year' to the giver*.* The red packets should also only be opened at home or in private, for it is considered rude to open them in the presence of the giver. For [Cantonese](/wiki/Cantonese_people) and [Hokkien](/wiki/Hoklo_people) people, red packets are given in pairs to close relatives following the tradition that good things come in pairs. The total amount of money gifted should also be an even number. #### Lo hei Lo hei refers to the communal tossing of [yusheng](/wiki/Yusheng), a mixture of thinly sliced raw fish and vegetables, condiments, and seasonings. The yusheng dish originated from China, while the modern lo hei tradition was brought to Singapore by Cantonese and Teochew migrants. This practice was traditionally observed on the seventh day of the first lunar month, but is now typically enjoyed throughout the Chinese New Year period. The lo hei practice involves a group of people gathered around the dining table, adding each ingredient in a specific order while auspicious sayings are recited. Each ingredient symbolizes something special or auspicious. Using chopsticks, the diners toss the ingredients while delivering auspicious sayings and their wishes for the upcoming new year until all ingredients are mixed. It is believed that the higher the toss, the greater one's fortune and prospects for the year. #### Lion dance The [lion dance](/wiki/Lion_dance) performance can be dated back over 1,500 years. Usually performed during auspicious occasions such as the opening of a new business, the lion dance is also performed during Chinese New Year. Its significance in the new year is associated with scaring away the legend of *[Nian](/wiki/Nian)*. The dance features 2 lion dancers, one in charge of controlling the lion's head while the other acts as its hind legs. The performance typically consists of the skillful coordination between the 2 lion dancers to mimic the lion's movements and acrobatic stances, and musicians to accompany the lion dancers. In Singapore, the troupe performs the lion dance to snap off a sprig of lettuce and a red packet. More challenging tasks such as peeling open a [pomelo](/wiki/Pomelo) and pinning down a crab are other examples that lion dancers perform. In recent times, many lion dance troupes use the Singapore drum instead of the traditional version as it has a softer resonance. Lion dancing troupes are traditionally made up of young boys but girls have been learning the art more recently too. #### Chingay parade Since 1972, an annual street parade was held as part of the Chinese New Year festivities. Chingay comes from the Mandarin word 妝藝 (Zhuang Yi), which means the art of costume and masquerade in the Hokkien dialect. It is a unique celebration of Singaporean tradition of all the ethnic groups in the countries (Chinese, Malays, Indians, Eurasians, and many others). Furthermore, this event is also celebrated in Malaysia, but only focuses more on the Chinese community. The artistic elements in the parade could include 'flying of the dragon', which is a display of dancing dragons set to the music of drums. Some notable moments for the parade were it's 40th anniversary, where 8000 performers performed, as well as the 45th anniversary where the first tiger float being remade. The community spirit connects performers (mostly stilt walkers, jugglers, and clowns) globally to celebrate an important cultural event.\n",
  "language": "en",
  "processed_at": "2026-01-12T10:02:50.842167",
  "title": "Chinese New Year customs in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Chinese_New_Year_customs_in_Singapore"
}