{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:02:52.469518"
  },
  "content": "This article includes a list of references, related reading, or external links, **but its sources remain unclear because it lacks inline citations**. Please help improve this article by introducing more precise citations. *(June 2021)* *(Learn how and when to remove this message)* The **Chinese Protectorate** was an administrative body responsible for the well-being of [ethnic Chinese](/wiki/Chinese_race) residents of the [Straits Settlements](/wiki/Straits_Settlements) during that territory's [British](/wiki/United_Kingdom) [colonial](/wiki/Colonialism) period. Protectorates were established in each area of the Settlements, namely [Singapore](/wiki/Singapore), [Penang](/wiki/Penang) and [Malacca](/wiki/Malacca). Each was headed by a [Protector](/wiki/Protector_(title)). The institution was established in 1877 to handle all matters related to the Straits Settlements' Chinese residents. In particular, it sought to mitigate the human rights violations of the [coolie](/wiki/Coolie) trade, which had expanded to notorious levels by the 1850s in the region. ## The coolie trade Perhaps the most significant goal of the British colonial administration in the founding of the entity was to regulate and humanize the [coolie](/wiki/Coolie) trade and lessen the misery of the coolies, who were subject to merciless exploitation. First, coolie agents were required to register with Protectorate. Policing by the Chinese Protectorate freed up the labour market and firms (mainly British-run) seeking to hire Chinese workers, who no longer had to go through coolie brokers and secret societies. As a result of this improvement in conditions, the number of Chinese arrivals increased dramatically from the 1880s onwards. ## Goals of the Protectorate Likewise, agents of the Chinese Protectorate often visited domestic servants. Those found to be subjected to especially inhumane conditions were sent to Singapore's Home for Girls. The Protectorate sought to have all Chinese social societies (including the [kongsi](/wiki/Kongsi)) - many of which were [secret societies](/wiki/Secret_societies) or bodies of [organized crime](/wiki/Organized_crime) - register with the government. The institution also encouraged the Chinese to seek the government’s help instead of going to the secret societies, thus weakening the latter's influence among the Chinese. The protectorate also aimed to protect women and young girls, who were tricked into prostitution in brothels that were manned by secret societies, and remove all girls there under the age of 16 for immoral practices. - [Old Ministry of Labour Building](/wiki/Old_Ministry_of_Labour_Building), site of the Chinese Protectorate in Singapore from 1930 until the outbreak of [World War II](/wiki/World_War_II) - Law And Order - Singapore History Forum - E-Journal : Historical Formation and the Growth of a Diversified Community Overseas Chinese in Singapore, 1819-1900 - - \"The Protection of Chinese and Chinese Interpretation\". *The Straits Times*. 15 December 1877. p. 1. - The Chinese Protectorate | Infopedia\n",
  "language": "en",
  "processed_at": "2026-01-12T10:02:52.468994",
  "title": "Chinese Protectorate",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Chinese_Protectorate"
}