{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:02:55.222633"
  },
  "content": "Ethnic groupEthnic groupPart of a series on[Singaporeans](/wiki/Demographics_of_Singapore) - [Arabs](/wiki/Arab_Singaporeans) - [Armenians](/wiki/Armenians_in_Singapore) - [Australians](/wiki/Australians_in_Singapore) - [Burmese](/wiki/Burmese_people_in_Singapore) - Chinese - [Peranakans](/wiki/Peranakans) - [PRC](/wiki/Chinese_nationals_in_Singapore) - [Chitty](/wiki/Chitty) - [Eurasians](/wiki/Eurasian_Singaporeans) - [Filipinos](/wiki/Filipinos_in_Singapore) - [Indians](/wiki/Indian_Singaporeans) - [Japanese](/wiki/Japanese_people_in_Singapore) - [Jawi Peranakan](/wiki/Jawi_Peranakan) - [Jews](/wiki/History_of_the_Jews_in_Singapore) - [Koreans](/wiki/Koreans_in_Singapore) - [Malays](/wiki/Malay_Singaporeans) - [Nepalis](/wiki/Nepalis_in_Singapore) - [Pakistanis](/wiki/Pakistanis_in_Singapore) - [Sri Lankans](/wiki/Sri_Lankans_in_Singapore) - [Tamils](/wiki/Singapore_Tamils) - [Thais](/wiki/Thais_in_Singapore) - [Vietnamese](/wiki/Vietnamese_in_Singapore) - v - t - e **Singaporean Chinese** or **Chinese Singaporeans** ([simplified Chinese](/wiki/Simplified_Chinese_characters): 新加坡华人/华裔新加坡人; [traditional Chinese](/wiki/Traditional_Chinese_characters): 新加坡華人/華裔新加坡人; [pinyin](/wiki/Pinyin): *Xīnjiāpō Huárén / Huáyì Xīnjiāpōrén*) are [Singaporeans](/wiki/Singaporeans) of [Han](/wiki/Han_Chinese) ancestry. As of the 2020 census, they constitute 75.9% of the resident population, making them the largest [ethnic group](/wiki/Ethnic_group) in [Singapore](/wiki/Singapore). In Singapore, \"Chinese\" is an umbrella term defined in both [geographical](/wiki/Geographical) and [ethnic](/wiki/Ethnicity)-[cultural](/wiki/Culture) contexts as pertaining to [Greater China](/wiki/Greater_China) and bears no necessary relation to the contemporary [People's Republic of China](/wiki/People%27s_Republic_of_China), whose citizens are classified [separately](/wiki/Chinese_nationals_in_Singapore) when in Singapore. As a result, some Singaporeans of Han ancestry would simply just consider themselves \"Singaporean\", viewing themselves as distinct from the \"China Chinese\" in terms of culture, identity and social reality. Evidence of [Chinese people](/wiki/Chinese_people) trading with and settling among local populations in Singapore dates as early as the 10th century. Prior to the establishment of Singapore as a [British trading port](/wiki/British_colony), the island was home to a small community of around 120 [Malays](/wiki/Malays_(ethnic_group)) and 20 to 30 Chinese, mostly traders. The colonial period saw a substantial influx of male Chinese migrants, who often returned to their families in China after earning sufficient income. Over time, more ethnic Chinese arrived in Singapore such as the [samsui women](/wiki/Samsui_women) and other economic migrants. This led to a more balanced [gender ratio](/wiki/Sex_ratio) and a diversified [age distribution](/wiki/Demographic_profile), which formed the bulk of the Singaporean Chinese population known today. The Chinese community in Singapore is internally diverse, with the majority descending from [Hokkien](/wiki/Hokkien_people) ancestry, while significant minorities include [Cantonese](/wiki/Cantonese_people), [Hakka](/wiki/Hakka_people), [Teochew](/wiki/Teochew_people) and [Hainanese](/wiki/Hainanese) groups. Over the centuries, the community has maintained distinct linguistic, cultural and social practices to [mainland Chinese](/wiki/Culture_of_the_People%27s_Republic_of_China) culture alongside influences from the [Malay](/wiki/Malay_Singaporeans) and [Indian](/wiki/Indian_Singaporeans) communities, while also contributing significantly to Singapore's broader [cultural landscape](/wiki/Culture_of_Singapore) and social development. ## Definition of Chinese Singaporeans The [Singapore Department of Statistics](/wiki/Organisation_of_the_Government_of_Singapore#Departments/Divisions_10) broadly defines \"Chinese\" as a \"[race](/wiki/Race_(classification_of_human_beings))\" or \"[ethnic group](/wiki/Ethnic_group)\", in conjunction with \"Malay, Indian and Others\" under the [CMIO model](/wiki/Race_in_Singapore). They consist of \"persons of Chinese origin\" such as the Hokkiens, Teochews, Hainanese, Cantonese, Hakka, [Henghuas](/wiki/Putian_people), [Hokchias/Foochows](/wiki/Fuzhou_people), [Shanghainese](/wiki/Shanghainese_people) and Northern Chinese, etc.\" In Singapore, the Chinese population can be defined by nationality and residency status. Most ethnic Chinese are Singaporeans or [permanent residents](/wiki/Permanent_residency_in_Singapore), commonly referred to as \"Chinese Singaporeans\" or the local \"Chinese community in Singapore.\" They range from second to fifth generation descendants of migrants from [Greater China](/wiki/Greater_China), many of whom retain minimal or negligible connections to the region and consider its contemporary nations as foreign. Foreign citizens of the [People's Republic of China](/wiki/People%27s_Republic_of_China) are officially referred to as \"Chinese nationals\" or informally as \"China Chinese\" or \"PRC\", the abbreviation of the country. Chinese foreigners may be further distinguished in terms of residency status. ## History ### Before 1819 As early as the 10th century, there was evidence of [Chinese people](/wiki/Chinese_people) trading and settling in Singapore and there were also various Chinese records documenting trading activities and Chinese residents on the island from the 10th to the 14th century. Prior to the establishment of Singapore as a [British trading port](/wiki/British_colony), there was a small population of 120 Malays who were the followers of Temenggong Abdul Rahman, and about 20–30 Chinese living on the island. After Singapore became a British colony, there was an influx of Chinese migrant workers, but these early Chinese migrants to Singapore were predominantly males, as they would usually return to their families in China after they have earned enough. There was only a significant number of Chinese residents permanently settling in Singapore during the early to mid twentieth century, forming the bulk of the Singaporean Chinese population today. The early records of Singapore in [Imperial Chinese](/wiki/Imperial_Chinese#Imperial_China) sources named Singapore as \"[Long Ya Men](/wiki/Long_Ya_Men)\" (龍牙門), \"[Dan Ma Xi](/wiki/Temasek)\" (單馬錫 or 淡馬錫). Later other terms such as \"Xi La\" (息辣), \"Shi le\" (石叻), or \"Xi Li\" (息力, for \"selat\" meaning strait) may also refer to Singapore or the surrounding areas. Archaeological excavations of artefacts such as Chinese coins or ceramics in Singapore, which dated back to the period of the reign of [Emperor Zhenzong of Song](/wiki/Emperor_Zhenzong_of_Song) (998–1022) and [Emperor Renzong of Song](/wiki/Emperor_Renzong_of_Song) (1023–1063), indicated that Chinese merchants or traders had already visited Singapore by the [Song dynasty](/wiki/Song_dynasty). The Chinese record *Annals of various foreign states* (*[Zhu fan zhi](/wiki/Zhu_fan_zhi)*) written by [Zhao Rushi](/wiki/Zhao_Rugua) in 1225 clearly described Chinese merchant ships arriving in Singapore from [Quanzhou](/wiki/Quanzhou) and various Chinese trading activities. In this annal, the chapter [San Fo Qi](/wiki/Sanfoqi) (三佛齊 the Chinese name for [Srivijaya](/wiki/Srivijaya)) recorded merchant ships passing through \"Ling Ya Men\" (凌牙門, although it is not clear however if it is the same as [Long Ya Men](/wiki/Long_Ya_Men)) before reaching [Srivijaya](/wiki/Srivijaya) for trading. The Chinese traveller [Wang Dayuan](/wiki/Wang_Dayuan), visiting the island around 1330, described a small Malay settlement called [Dan Ma Xi](/wiki/Temasek) (淡馬錫, from Malay Temasek) in which Chinese residents live together with the Malays. Following the decline of [Srivijayan](/wiki/Srivijayan) power, Temasek was alternately claimed by the Majapahit and the Siamese, but the invasion of 1377 and 1391 caused Singapore to be destroyed. Following that, there were little Chinese records of the visiting of Chinese to Singapore. Singapore is marked as Dan Ma Xi in the [Mao Kun map](/wiki/Mao_Kun_map) that dates back to the naval voyage of Chinese explorer [Zheng He](/wiki/Zheng_He) in 1403. The earliest groups of Chinese who settled in what is today Singapore were the [Peranakan Chinese](/wiki/Peranakan_Chinese) from Malacca and [Riau](/wiki/Riau) who were descendants of those who immigrated to the region and married local wives between the 15th to 18th centuries. The 19th century Chinese record *Investigation of Southern Pacific* (南洋蠡測, Nanyang Li Ce) described the presence of Chinese tombs in Singapore (known as \"Xin Ji Li Po\" (新忌利波 in Chinese). On the Chinese tomb, there were words and inscriptions recording the period of [Later Liang](/wiki/Later_Liang_(Five_Dynasties)) and [Emperor Gong of Song](/wiki/Emperor_Gong_of_Song). This may suggest that from 907 to 1274, some Chinese had settled, lived, died and were buried in Singapore. ### 1819–1937 The writings of Stamford Raffles and William Farquhar indicate that the British found Temenggong Abdul Rahman with 400 to 500 residents in Singapore in January 1819. Another member of the 1819 expedition party, Captain John Crawford, recalled in his diary an encounter with \"upwards of 100\" of Chinese. British colonial documentations revealed that Temenggong Abdul Rahman had provided these Chinese who were Teochews the cost and expenses of opening gambier plantations at Mount Stamford (now Pearl's Hill) prior to British arrival. He had also \"in some instances\" advanced money to the Teochew cultivators on the understanding he would be repaid in the form of gambier or other produce. Farquhar had the impressions that the Temenggong's interests in these plantations were represented by a brother-in-law of his named Baba Ketchil and the first Captain China of Singapore, a Teochew merchant named Tan Heng Kim (陈亨钦), was \"one of the principal persons concerned\". Based on Teochew oral traditions in Singapore published by Phua Chye Long (潘醒农) in *Teo-chews in Malaya* (马来亚潮侨通鉴) in 1950, the first Teochews in Singapore were led by Tan Heng Kim, who was from Siam, and a second merchant named Heng Hong Sung (王丰顺) from Ampou town in Chaozhou, China. Together, they founded the [Yueh Hai Ching Temple](/wiki/Wak_Hai_Cheng_Bio) on the south bank of the Singapore River. From the founding of modern Singapore by [Stamford Raffles](/wiki/Stamford_Raffles) until the Japanese occupation in 1942, Singapore was ruled as a colony by the British. When the British first arrived in Singapore, most of the inhabitants on the island of Singapore were fisherman, seamen or pirates, living in small houses. There were about 150 people; a majority of 120 Malay and 30 minority Chinese. When Singapore became a [Straits Settlement](/wiki/Straits_Settlement), there were very few Chinese, however, after Singapore became a trading post the first batch of Chinese came from Malaysia, predominantly from [Malacca](/wiki/Malacca) and [Penang](/wiki/Penang). Amongst these Chinese from [Malacca](/wiki/Malacca) and [Penang](/wiki/Penang), many were Peranakans or descendants of Chinese in Malaysia for several generations. Most were traders who could speak Chinese and Malay, though many were also English-educated and could communicate with the British. In the *Manners and customs of the Chinese of the Straits Settlements, Singapore*, it was described that the Straits-born Chinese regarded themselves as British subjects instead of Chinese subjects; their lifestyle was more westernised. By the time of the first census of Singapore in 1824, the Chinese migrants were noted as being either [Peranakans](/wiki/Peranakan), or from [Macau](/wiki/Macau), [Guangdong](/wiki/Guangdong) and [Fujian](/wiki/Fujian). The Chinese quickly formed the majority of the population in Singapore, by the census of 1826 there were already more Chinese (6,088) than Malays (4,790) excluding Bugis (1,242) and Javanese (267). The Chinese became the dominant group by the 1830s (the largest ethnic group at 45.9% in the 1836 census), and by 1849, 52.8% of the total population of 52,891 were Chinese. The Chinese population reached over 70% of the total by 1901 and has stayed there since. The early Chinese migrants to Singapore were predominantly males. In 1826, the official census figures show that out of a total population of 13,750, there were 5,747 Chinese males but only 341 Chinese females. Most of the Chinese females in this early period of Singapore were [nyonyas](/wiki/Nyonya) from [Malacca](/wiki/Malacca) as women from China were discouraged from emigrating. It was noted in 1837 that there were no Chinese women in Singapore who had emigrated directly from China; even as late as 1876, a British official in Singapore wrote that he did not know of any respectable Chinese woman who had emigrated with her husband. The imbalance of the sexes in Chinese community continued for a long time with the continual flow into Singapore of male migrant workers who were either single or had left their wives and children behind in China; for example, the 1901 census figures show that there were 130,367 Chinese males compared to 33,674 Chinese females. For a long period, most of the Chinese population in early Singapore were immigrants as many did not intend to settle permanently to raise their family there; even by the late 1890s, only around 10% of the Chinese population in Singapore were born there. The early migrant Chinese workers worked to send money back to their family in China, and many would then return to China after they had earned enough money. However, an increasing number would also choose to settle permanently in Singapore, especially in the 1920s when more chose to remain in Singapore rather than leave. Change in social attitude in the modern era also meant that Chinese women were freer to emigrate from China, and the sex ratio began to normalise in the 20th century. This gradual normalisation of sex ratio led to an increase in the number of native births. Immigration would continue to be the main reason for the Chinese population increase in Singapore until the 1931–1947 period when the natural increase in population would surpass the net immigration figures. Many of the early migrants were Chinese traders who were attracted by the free trade policy after Singapore became the capital of the [British](/wiki/British_Empire) [Straits Settlements](/wiki/Straits_Settlements) in 1832. Many also came to work in the plantations, with 11,000 migrants recorded in one year. Singapore became one of the entry and dispersal points for large number of Chinese and Indian migrants who came to work in the plantations and mines of the Straits Settlements, many of whom then settled in Singapore after their contract ended. Because of booming commerce which required a large labour force, the Chinese [coolie](/wiki/Coolie) trade also appeared in Singapore. Indentured Chinese Cantonese labourers and [British Raj](/wiki/British_Raj) labourers were contracted by coolie traders and brought to Singapore to work. In 1860 under the 2nd Opium War, Chinese coolie trade became legalised and reached a high peak. The large influx of coolies into Singapore only stopped after [William Pickering](/wiki/William_A._Pickering) became the Protector of Chinese. In 1914, the coolie trade was abolished and banned in Singapore. The large influx of Chinese to Singapore led to the establishment of a large number of Chinese associations, schools, and temples in Singapore and, within a century, the Chinese immigrant population exceeded that of the Malays. During this period, Christian [missionaries](/wiki/Missionaries) from Europe began evangelising to the Asians, especially the Chinese. Peranakans, or those descendants of Chinese in Southeast Asia for many generations who were generally English-educated were typically known in Singapore as \"Laokuh\" (老客 – Old Guest) or \"Straits Chinese\". Most of them paid loyalty to the [British Empire](/wiki/British_Empire) and did not regard themselves as \"[Huaqiao](/wiki/Overseas_Chinese)\". From the 19th until the mid-20th century, migrants from China were known as \"Sinkuh\" (新客 – New Guest). A majority of them were coolies, workers on steamboats, etc. Some of them came to Singapore for work, in search of better living conditions or to escape poverty in China. Many of them also escaped to Singapore due to chaos and wars in China during the first half of the 20th century. They came mostly from the [Fujian](/wiki/Fujian), Guangdong and [Hainan](/wiki/Hainan) provinces and, unlike Peranakans, paid loyalty to China and regarded themselves as \"Huaqiao\". ### 1937–1945 (World War II) The [Second Sino-Japanese War](/wiki/Second_Sino-Japanese_War), started in 1937, revived a perceived sense of patriotism in the local Chinese to their native homeland in China which led them to impose an embargo against Japanese goods and products in Singapore. During the war, many of the immigrants returned to China to fight the Japanese, while established entrepreneurs sent economic aid or military equipment to China. After the Japanese [took Singapore](/wiki/Battle_of_Singapore) in 1942, the [Kempeitai](/wiki/Kempeitai) tracked down many Chinese who aided the Chinese war effort against Japan. However, the Kempeitai's [Sook Ching Operation](/wiki/Sook_Ching_Operation) was simply a massacre designed to drive fear into the local populace, so the Kempeitai simply picked out people based on accounts of masked informers, which in many cases were false accounts based on personal vendettas. There was also active anti-Japanese resistance during the war, such as [Force 136](/wiki/Force_136), headed by [Lim Bo Seng](/wiki/Lim_Bo_Seng). ### After 1945 [Race riots](/wiki/Race_riots) were common during the early post-war period, predominantly in the period between self-governance and independence in 1965. One [major riot](/wiki/1964_race_riots_in_Singapore) took place during birthday celebrations in honour of [Muhammad](/wiki/Muhammad), on 21 July 1964. There were records of high casualties (23 killed and 454 injured), as well as claims that the riot was politically motivated to oust the then Prime Minister ([Lee Kuan Yew](/wiki/Lee_Kuan_Yew)) and his cabinet as well as to prevent the promotion of a [Malaysian Malaysia](/wiki/Malaysian_Malaysia) concept in [Peninsular Malaysia](/wiki/Peninsular_Malaysia). Following Singapore's independence in 1965, the government pursued policies to foster a racially harmonious society. With the establishment of a Singaporean national identity and nationhood, the Chinese community began to shift from a mindset of temporary residence to permanent settlement, laying deeper roots on the island. Over time, this transformation encouraged Chinese Singaporeans to increasingly identify themselves, in terms of citizenship, as \"Singaporeans\". In the late 20th century, Singapore saw a large increase of Chinese immigrants, who were selected by the Singaporean government from Chinese universities in order to increase manpower. Chinese migrants from China during the late 20th century and early 21st century were generally known as \"Xinyimin 新移民\" (new immigrants). They came from various parts of China. ## Chinese associations or institutions in Singapore ### Historical background This section **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources in this section. Unsourced material may be challenged and removed. *(August 2011)* *(Learn how and when to remove this message)* When the Chinese migrants first arrived in Singapore in the 19th and early 20th century, they settled in enclaves such as [Chinatown](/wiki/Chinatown,_Singapore). They tended to group themselves according to dialect, with those from nearby Chinese regions grouping together. This led the Chinese to form 5 dialect groups (known as *Bangqun,* 幫群), namely the *Hokkien Bang*, *Teochew Bang*, *Cantonese Bang*, *Hakka Bang* and *Hainanese Bang*. During the British colonial period, the colonial government adopted the approach of using \"the Chinese to govern the Chinese\". They appointed Chinese leaders to govern the Chinese community. Effectively, the Chinese community existed in a semi-autonomous state. Chinese civil societies helped new Chinese immigrants settle into Singapore, finding employment and lodging for them. Many Chinese civil societies were involved in Chinese family religious activities such as funerals or ancestral worship and also had religious functions. This gradually evolved into the development of [Chinese Temples](/wiki/Chinese_Temple) and [Chinese clan associations](/wiki/Chinese_clan_associations) in Singapore. As time passed by, the Chinese had grown to have more achievements in the business and education in Singapore. Some affluent Chinese businessmen began to establish commercial organizations such as the Ee Ho Hean Club (怡和軒) in 1895, and the [Singapore Chinese Chamber of Commerce and Industry](/wiki/Singapore_Chinese_Chamber_of_Commerce_and_Industry), to help broaden social circles amongst the Chinese. Established in 1906, the [Singapore Chinese Chamber of Commerce and Industry](/wiki/Singapore_Chinese_Chamber_of_Commerce_and_Industry) was responsible for fighting for the rights of the Chinese in Singapore during the British colonial period. During the [World War II](/wiki/World_War_II), the [Singapore Chinese Chamber of Commerce and Industry](/wiki/Singapore_Chinese_Chamber_of_Commerce_and_Industry) had managed to help raise funds and resources to help relieve the sufferings in war-torn China. After Singapore gained independence and autonomy in the 1960s, the Singapore government undertook measures to help foster racial harmony in Singapore. It encouraged races of different languages and religious backgrounds to intermingle and to live side-by-side. Following the growth of Singaporean national identity, the Chinese immigrants began to change their mindset from that of temporary migrants to permanent settlers, thus establishing roots in Singapore. With the strengthening of Singaporean national identity, the [Chinese clan associations](/wiki/Chinese_clan_associations) gradually declined in importance. Their role of organizing and governing the Chinese community was taken over by the Singapore government. ### Today Today, all Singaporean clan associations operate under the flagship of [Singapore Federation of Chinese Clan Associations](/wiki/Singapore_Federation_of_Chinese_Clan_Associations) (SFCCA). Clan associations connect Singaporean Chinese to their ancestral homes in China. The [Singapore Chinese Chamber of Commerce and Industry](/wiki/Singapore_Chinese_Chamber_of_Commerce_and_Industry) (SCCCI) continues to look after the interests of the Chinese business community as well as sourcing for business opportunities in China. The [Chinese Development Assistance Council](/wiki/Chinese_Development_Assistance_Council) was founded out of these two organizations (SFCCA and SCCCI) to help nurture and develop the potential of the Chinese community, thus contributing to the continued success of multiracial Singapore. There are also various Chinese cultural organizations such as Singapore Chinese Calligraphy Society, [Singapore Chinese Orchestra](/wiki/Singapore_Chinese_Orchestra), [Siong Leng Musical Association](/wiki/Siong_Leng_Musical_Association), [Nanyang Confucian Association](/wiki/Nanyang_Confucian_Association), Singapore Chinese Opera Institute etc. as well as major Chinese religious associations such as Singapore Buddhist Federation, Taoist Federation (Singapore) and [Singapore Buddhist Lodge](/wiki/Singapore_Buddhist_Lodge) to look after the religious affairs of Singaporean Chinese. All these Chinese organizations continue to play an important role in the economic, cultural and religious life of Singaporean Chinese. ## Singaporean Chinese subgroups Most Singaporeans of Chinese descent are descended from emigrants from [Fujian](/wiki/Fujian), [Guangdong](/wiki/Guangdong), or [Hainan](/wiki/Hainan). The Min Nan or [Southern Min](/wiki/Southern_Min) people ([Hokkiens](/wiki/Hoklo_people) and [Teochews](/wiki/Teochew_people)) and [Cantonese people](/wiki/Cantonese_people) together form more than three-quarters of the Singaporean Chinese population. The [Hakka](/wiki/Hakka_people), [Henghuas](/wiki/Putian_people), [Foochows](/wiki/Fuzhou_people), and other subgroups account for most of the remainder. Singaporeans of Chinese descent are generally the descendants of non-indentured and indentured immigrants from southern China during the 19th and first half of the 20th century. The 1990s and early 21st century saw Singapore experience a third wave of immigration from different parts of China. Population Profile of Singaporean Chinese Subgroups GroupProvince/region[Ancestral home](/wiki/Ancestral_home_(China))**1990****2000****2010**2020[Hokkien](/wiki/Hoklo_people) (Minnan/Hoklo/[Changchow](/wiki/Zhangzhou)/[Amoy](/wiki/Xiamen)/[Chinchew](/wiki/Quanzhou))[Fujian](/wiki/Fujian), [Taiwan](/wiki/Taiwan)[Anxi](/wiki/Anxi_County), [Tong'an](/wiki/Tong%27an_District), [Nan'an](/wiki/Nan%27an,_Fujian), [Jinjiang](/wiki/Jinjiang,_Fujian), [Shishi](/wiki/Shishi,_Fujian), [Hui'an](/wiki/Hui%27an_County), [Yongchun](/wiki/Yongchun_County), [Kinmen](/wiki/Kinmen), [Longhai](/wiki/Longhai_City), [Pinghe](/wiki/Pinghe_County), [Zhao'an](/wiki/Zhao%27an_County)896,0801,028,4901,118,8171,180,599[Teochew](/wiki/Teochew_people)[Guangdong](/wiki/Guangdong)[Chaoshan](/wiki/Chaoshan), [Chao'an](/wiki/Chao%27an_County), [Chaoyang](/wiki/Chaoyang_District,_Shantou), [Jieyang](/wiki/Jieyang), [Raoping](/wiki/Raoping_County), [Chenghai](/wiki/Chenghai_District), [Puning](/wiki/Puning), [Huilai](/wiki/Huilai_County)466,020526,200562,139583,963[Cantonese](/wiki/Cantonese_people)Guangdong, Hong Kong, Macau[Guangzhou](/wiki/Guangzhou), [Zhaoqing](/wiki/Zhaoqing), [Foshan](/wiki/Foshan), [Zhuhai](/wiki/Zhuhai), [Jiangmen](/wiki/Jiangmen), [Yangjiang](/wiki/Yangjiang), [Dongguan](/wiki/Dongguan), [Yunfu](/wiki/Yunfu), [Zhanjiang](/wiki/Zhanjiang), [Shenzhen](/wiki/Shenzhen), [Maoming](/wiki/Maoming), [Zhongshan](/wiki/Zhongshan)327,870385,630408,517429,329[Hakka](/wiki/Hakka_people)Guangdong, Fujian, TaiwanChengxiang County (present-day [Meixian District](/wiki/Meixian_District)), [Dapu](/wiki/Dabu_County), [Hepo](/wiki/Jiexi_County), [Huizhou](/wiki/Huizhou), Danshui (present-day [Huiyang District](/wiki/Huiyang_District)), [Yongding](/wiki/Yongding_County), [Heyuan](/wiki/Heyuan), Western Longyan, [Lufeng](/wiki/Lufeng,_Guangdong)155,980198,440232,914259,153[Hainanese](/wiki/Hainanese_people)[Hainan](/wiki/Hainan)[Wenchang](/wiki/Wenchang), [Haikou](/wiki/Haikou), [Qionghai](/wiki/Qionghai), [Ding'an](/wiki/Ding%27an_County), [Wanning](/wiki/Wanning)148,740167,590177,541183,312[Hokchew](/wiki/Fuzhou_people) (Foochow)Fujian[Fuzhou](/wiki/Fuzhou), [Changle](/wiki/Changle_District), [Gutian](/wiki/Gutian_County)36,49046,89054,23359,609[Henghua](/wiki/Putian_people) (Putian)Fujian[Putian](/wiki/Putian), [Xianyou](/wiki/Xianyou_County)19,99023,54025,54926,702[Shanghainese](/wiki/Shanghainese_people)Shanghai17,31021,55022,05322,503[Hockchia](/wiki/Fuqing) (Fuqing)Fujian[Fuqing](/wiki/Fuqing)13,23015,47016,55617,070Other*Various**Various*50,15091,590175,661244,529 ### Hokkien The [Hokkien](/wiki/Hokkien)-speaking subgroup constitutes nearly two-fifths of the Singaporean Chinese population. They are [Hoklo people](/wiki/Hoklo_people) from Minnan, including mixed-race [Peranakan](/wiki/Peranakans) Chinese and immigrants who originated in the southern parts of the [Fujian province](/wiki/Fujian), including [Xiamen](/wiki/Xiamen), [Quanzhou](/wiki/Quanzhou) and [Zhangzhou](/wiki/Zhangzhou). They speak [Singaporean Hokkien](/wiki/Singaporean_Hokkien), the standard of which is based on the [Amoy dialect](/wiki/Amoy_dialect) of [Xiamen](/wiki/Xiamen), which is partially comprehensible with [Teochew](/wiki/Teochew_dialect) although less so with [Hainanese](/wiki/Qiongwen). Hokkien Chinese was a *[lingua franca](/wiki/Lingua_franca)* among coastal Chinese and was also used by other ethnic groups such as the [Malays](/wiki/Malay_people) and the [Indians](/wiki/Demographics_of_India) to communicate with Chinese before Mandarin came to dominance during the 1980s and 1990s. Just as in [Taiwan](/wiki/Taiwan), [Hokkien people](/wiki/Hokkien_people), speakers of [Hokkien](/wiki/Hokkien), refers not to people originating from all parts of Fujian. \"Hokkien\" refers only to the Minnan (Southern Min) region of southern coastal Fujian. Singaporean Hokkien does not include northern Fujianese such as those arriving from [Fuzhou](/wiki/Fuzhou), [Putian](/wiki/Putian) and so on. Early Hokkien migrants settled around Amoy Street and Telok Ayer Street, forming enclaves around the [Thian Hock Kheng Temple](/wiki/Thian_Hock_Kheng_Temple). They subsequently set up clan headquarters (*[Hokkien Huey Kuan](/wiki/Singapore_Hokkien_Huay_Kuan)*) there and later expanded to Hokkien Street and the vicinity of China Street. Hokkiens were the most active in early trading that centred along the [Singapore River](/wiki/Singapore_River). As early settlers came from the southern coast of China, they were to pray for calm waves and a safe journey and worshipped the \"Mother of Heavenly Sage\" or [Tian Shang Sheng Mu](/wiki/Matsu_(goddess)) (天上聖母), the Goddess who can calm the sea and ensure the safety of those travelling across the seas. [Thian Hock Keng Temple](/wiki/Thian_Hock_Keng_Temple) was thus built in 1840 along Telok Ayer Street and dedicated to [Tian Shang Sheng Mu](/wiki/Mazu) (天上聖母), it was a bustling meeting point and an important congregation point for the Hokkien community. Other popular deities are the [Kew Ong Yah](/wiki/Nine_Emperor_Gods), [Guan Teh Gong](/wiki/Guan_Yu), [Kuan Yim Hood Chor](/wiki/Guanyin), [Ong Yah Gong](/wiki/Wang_Ye_worship), [Qing Shui Zhu Shi](/wiki/Qingshui_(monk)), [Bao Sheng Da Di](/wiki/Baosheng_Dadi), [Kai Zhang Sheng Wang](/wiki/Tan_Goan-kong), [Fu De Zheng Shen](/wiki/Fu_De_Zheng_Shen) and especially the [Jade Emperor](/wiki/Jade_Emperor), 9th Day of the 1st Lunar Month is the birthday of Jade Emperor and is considered by many Chinese to be the most important day of the lunar year. A traditional Taoist practice by [spiritual mediumship](/wiki/Tangki) (乩童, [p](/wiki/Pinyin) *jītóng*, Hokkien *tâng-ki*; 童乩) is also popular. The *tangki* goes into a trance and purportedly channels a chosen Deity for the petitioner. The Deity will provides wide range of divine assistance from bestowing blessings to oracles consultation to exorcism to giving spiritual protection and talismans.[*citation needed*] ### Teochew The [Teochew](/wiki/Teochew_dialect)-speaking subgroup in Singapore constitutes about a fifth of the Singaporean Chinese population, making them the second-largest Southern Min dialect-speaking group in Singapore. The Teochew speakers form a separate division of Hoklo (Min Nan/Hokkien) people. They originated from [Chaoshan](/wiki/Chaoshan) region in eastern [Guangdong](/wiki/Guangdong), in cities like [Chaozhou](/wiki/Chaozhou), [Jieyang](/wiki/Jieyang) and [Shantou](/wiki/Shantou). Many trace their origins from different Northern cities but were settled there to maintain as county authorities within the south of China. Despite similarities, the Teochew and Hokkien speakers consider themselves distinct and did not get along during their early settlement in Singapore, especially during the British colonial era. The Teochew were dominant for a period of time during the 19th century. Mass immigration from Fujian changed this, although the majority of the Chinese along the banks of the [Straits of Johor](/wiki/Straits_of_Johor) were Teochew until the [HDB](/wiki/Housing_and_Development_Board) initiated redevelopment in the 1980s. *[The Straits Times](/wiki/The_Straits_Times)* reports that [Hougang](/wiki/Hougang) still has a relatively high concentration of Teochew residents. Most Teochew settled along the [Singapore River](/wiki/Singapore_River) in [Chinatown](/wiki/Chinatown,_Singapore) during the 19th and early 20th century. Teochew who settled in Chinatown worked in many commercial sectors as well as the fisheries. Commercial sectors once dominated by Teochews include Circular Road and South Bridge Road. Other Teochew businessmen set up [gambier](/wiki/Uncaria) and [pepper](/wiki/Black_pepper) plantations in the dense forests of north Singapore and [Johor Bahru](/wiki/Johor_Bahru). The Chinese first started their plantations with the approval of the [Sultan of Johor](/wiki/Sultan_of_Johor) and then developed the *kangchu* (江厝, [p](/wiki/Pinyin) *jiāngcuò*, lit. \"river house\") system. *Chu* was the clan name of the first headman of the plantations in the area. These *kangchus* gave rise to modern place names such as [Choa Chu Kang](/wiki/Choa_Chu_Kang), [Lim Chu Kang](/wiki/Lim_Chu_Kang) and [Yio Chu Kang](/wiki/Yio_Chu_Kang), all of which were plantation areas before urban redevelopment. Early Chinese immigrants clustered themselves to form clan and language associations. These clan associations (*kongsi*) served as unions for the mostly illiterate Chinese labourers and represented them when dealing with their colonial administrators or employers. One of the most prominent associations for the Teochew was the *[Ngee Ann Kongsi](/wiki/Ngee_Ann_Kongsi)*, formed in 1845 and is still in operation. The association also take care of [Yueh Hai Ching Temple](/wiki/Yueh_Hai_Ching_Temple), which is the oldest Teochew temple in Singapore. ### Cantonese The [Cantonese](/wiki/Cantonese)-speaking subgroup makes up about 15% of the Singaporean Chinese population. They originated from [Hong Kong](/wiki/Hong_Kong) and the southern region of [Guangdong](/wiki/Guangdong) province in China, including [Guangzhou](/wiki/Guangzhou), [Foshan](/wiki/Foshan), [Zhaoqing](/wiki/Zhaoqing), [Jiangmen](/wiki/Jiangmen), [Maoming](/wiki/Maoming), [Zhongshan](/wiki/Zhongshan), [Yunfu](/wiki/Yunfu), [Shenzhen](/wiki/Shenzhen), [Yangjiang](/wiki/Yangjiang), [Zhuhai](/wiki/Zhuhai), [Dongguan](/wiki/Dongguan) and [Zhanjiang](/wiki/Zhanjiang). The Cantonese speak several dialects belonging to the [Yue family](/wiki/Yue_Chinese). *Yue Hai* is considered the [prestige dialect](/wiki/Prestige_dialect) from its occurrence in [Guangzhou](/wiki/Guangzhou). Other variants include *Luoguang*, *[Toishanese](/wiki/Toishanese)* and *Gouyeung*. The Cantonese worked mainly as professionals and tradesmen during the early and mid 20th centuries, and their businesses dominated the shophouses along Temple Street, Pagoda Street and Mosque Street. Cantonese women from the [Samsui](/wiki/Sanshui_District) district worked as labourers at construction sites and contributed greatly toward Singapore's development. These [Samsui women](/wiki/Samsui_women) left their families behind in China and came to Singapore to work at construction sites for a living during the early 20th century. Cantonese women from the [Siyi](/wiki/Siyi) district of [Jiangmen](/wiki/Jiangmen) wore black headgear similar to the Samsui women and mainly worked at [Keppel Harbour](/wiki/Keppel_Harbour) and the shipyards at the old harbour along the [Singapore River](/wiki/Singapore_River). Many Cantonese women also worked as majie in rich people's households. More Cantonese immigrated from Hong Kong in the late 1980s and early 1990s. Today, Cantonese is still preserved amongst ethnic Chinese of Cantonese ancestry, although most younger generations tend to speak more [Standard Chinese](/wiki/Standard_Chinese) due to language reforms, but is still widely used as the main *[lingua franca](/wiki/Lingua_franca)* for connecting both the older and the younger generations when communicating to one another as well since the older generations are mostly monolinguals (those who speak little to no Mandarin at all) or bilinguals (speaking English alongside the language itself) and trilinguals (amongst those who had mastered additional basic language skills in the other official languages of Malay and/or Tamil). As of 2010, Singaporeans recognise [Chinatown](/wiki/Chinatown,_Singapore) for having a large number of Cantonese people. ### Hakka The [Hakka](/wiki/Hakka_Chinese)-speaking subgroup constitutes 11.4% of the Singaporean Chinese population. About 70% of them originated from [Dabu County](/wiki/Dabu_County). Singapore has more than 200,000 Hakkas and they are the fourth-largest dialect group after the Hokkiens, Teochews and Cantonese. The Hakkas were known for running pawnshops, traditional Chinese medicine shops and optical shops. Many Hakka women who came to Singapore during the early 20th century worked in construction sites and wore headgear similar to the Samsui women. However, instead of red, the Hakka women wore black headgear. [Ying Fo Fui Kun](/wiki/Ying_Fo_Fui_Kun), a Hakka clan association, is the oldest clan association in Singapore. Its clan house is located at Telok Ayer Street in the Outram Planning Area, within the Central Area, Singapore's central business district. In 2015 a Hakka *[tulou](/wiki/Tulou)* replica was built. The replica in Singapore was built by the Fong Yun Thai Association, an umbrella body for three Hakka clans – Char Yong (Dabu) Association, Eng Teng Association and Foong Shoon Fui Kuan. This is the only tulou replica outside of proper China till date. Singapore's founding father [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) and his son, Prime Minister [Lee Hsien Loong](/wiki/Lee_Hsien_Loong), were fourth- and fifth-generation Singaporean Chinese of Hakka descent, respectively. Apart from Lee Kuan Yew, many first-generation leaders of Singapore were of Hakka descent, including [Chor Yeok Eng](/wiki/Chor_Yeok_Eng), [Hon Sui Sen](/wiki/Hon_Sui_Sen), [Howe Yoon Chong](/wiki/Howe_Yoon_Chong) and [Yong Nyuk Lin](/wiki/Yong_Nyuk_Lin). ### Others This subgroup constitutes about 5% of the Singaporean Chinese population. The largest group of Singaporean Chinese not from Fujian or Guangdong are the [Hainanese](/wiki/Hainanese_people) from the province of [Hainan](/wiki/Hainan). They speak [Hainanese](/wiki/Hainanese_language), a variety of Min Chinese which has similarities with [Southern Min](/wiki/Southern_Min). The [Hainanese](/wiki/Hainanese_people) in Singapore originated mainly from the north-east part of the island, from cities such as [Wenchang](/wiki/Wenchang) and [Haikou](/wiki/Haikou). As relative late-comers to Singapore in the late 19th century, most of them worked as shop assistants, chefs, and waiters in the hospitality sector. [Hainanese chicken rice](/wiki/Hainanese_chicken_rice) became a famous dish. They were also known for their Western cooking, as many of the early Hainanese migrants worked as cooks on European ships. The [Hockchew](/wiki/Hockchew) and [Hockchia](/wiki/Hockchia) originated from northeastern [Fujian](/wiki/Fujian), particularly [Fuzhou](/wiki/Fuzhou) city, [Changle District](/wiki/Changle_District), [Gutian County](/wiki/Gutian_County) and [Fuqing](/wiki/Fuqing). They speak varieties of [Eastern Min](/wiki/Eastern_Min). The Puxian or [Hinghwa](/wiki/Hinghwa) people originated from Central Fujian – [Putian](/wiki/Putian) and [Xianyou](/wiki/Xianyou) – and speak [Puxian Min](/wiki/Puxian_Min), a transitional variety of Min which has features in common with both Southern Min and Eastern Min. Taiwan-born Singaporean Chinese and their descendants are predominantly of the Hokkien and Hakka subgroups. They number around 30,000 (2012) and constitute less than 2% of the Singaporean population. In Singapore, due to their small population, the [Taiwanese](/wiki/Taiwanese_people) are often grouped into larger populations, such as the Hokkien and Hakka, according to their dialect or ancestral origin. Newer Taiwanese immigrants have formed a distinctive group on their own. They may speak [Taiwanese Mandarin](/wiki/Taiwanese_Mandarin), [Hokkien](/wiki/Taiwanese_Hokkien) or [Hakka](/wiki/Hakka_Chinese) and originate from many different cities, including [Taipei](/wiki/Taipei), [New Taipei](/wiki/New_Taipei), [Hsinchu](/wiki/Hsinchu), [Taichung](/wiki/Taichung), [Tainan](/wiki/Tainan_City) and [Kaohsiung](/wiki/Kaohsiung). According to the book, *Japanese's view of Singapore* (日本人眼裏的新加坡) edited by Lin Shaobin, the vice-chairman of Singapore Japanese cultural society, the \"Bank of Taiwan\" started its operation in Singapore from 1912 to 1925. The book also indicated that according to Japanese statistics of 1932, there were around 105 Taiwanese living in Malaya (including Singapore). According to verbal accounts by Singaporeans, many of the \"Japanese\" soldiers involved in the [occupation of Singapore](/wiki/Japanese_occupation_of_Singapore) during World War II were in fact [Taiwanese serving in the Imperial Japanese Army](/wiki/Taiwanese_Imperial_Japan_Serviceman). Similar accounts relate that many teachers of Mandarin Chinese in the 1950s and 1960s came from Taiwan. After 1965, military ties led to the immigration of some Taiwanese military personnel as high-ranking officers in [Singapore Armed Forces](/wiki/Singapore_Armed_Forces). More immigration began during the 1970s and 1980s from investors, businessmen, and students. Most of these were highly educated and employed in professions such as engineering, business, investment, research and education. Marriages between Singaporean Chinese and Taiwanese (i.e. Taiwan-born Chinese) often resulted in the Taiwanese partner moving to Singapore and obtaining citizenship. ### Peranakan The [Peranakan](/wiki/Peranakan) or *Baba-Nyonya* are early mixed Chinese-Malay immigrants from [Malacca](/wiki/Malacca) and [Penang](/wiki/Penang) who later migrated to Singapore. A few notable Peranakans have classified themselves as a separate ethnic group and have a distinct identity from either separate group while the vast majority have self-classified as Singaporean Chinese after re-assimilation. The men are known as *Baba* while the women are known as *Bibiks* or *Nyonyas*. Peranakans in Singapore were once concentrated around the Malay settlement at Geylang and the Chinese enclave at [Katong](/wiki/Katong) because they often served as intermediaries for businesses and social groups in colonial Singapore owing to multilingual fluency in English, Malay, and Hokkien (post-independence and after the 1980s, standard [Mandarin](/wiki/Mandarin_Chinese) as well mastered as a third supplementary language). Many Peranakans and Hokkien Chinese moved out of the congested town of Singapore – today's Central Business District – and built seaside mansions and villas along the East Coast in Tanjong Katong for their families. After Singapore's independence, Peranankans moved throughout the island. Many Peranakans converted to [Roman Catholicism](/wiki/Roman_Catholicism) during the 17th and 18th century Dutch, Portuguese, British and Spanish colonisation of Southeast Asia, which saw missionaries set up posts in [Batavia](/wiki/Batavia,_Dutch_East_Indies) (today's [Jakarta](/wiki/Jakarta)) and along the [Malay Peninsula](/wiki/Malay_Peninsula). ### New Chinese immigrants Before 1990, [Mandarin](/wiki/Mandarin_Chinese) speakers from Beijing and northern China and [Wu](/wiki/Wu_Chinese) speakers from Shanghai and the central Pacific coast of China constituted less than 2% of the Singaporean Chinese population. Most of the current population of native [Mandarin](/wiki/Mandarin_Chinese) speakers immigrated to Singapore much later than the other groups, after the Singaporean government relaxed immigration laws in 1989. Many of them were working in blue-collar jobs during Singapore's rapid industrialisation which began in the 1970s. Because of this, the members of this third wave are called the \"New Immigrants\" (新移民, [p](/wiki/Pinyin) *Xīnyímín*). They usually speak [Standard Mandarin](/wiki/Standard_Mandarin), the *lingua franca* among mainland Chinese groups today, and many speak other [varieties](/wiki/Varieties_of_Chinese) as well. Since the 1990s, the number of mainland Chinese who come to Singapore to study or work has steadily increased every year. Many stay for only a short time and then return to China, but many settle down permanently and become permanent residents or citizens of Singapore. Today, newer Chinese migrants includes migrant workers working in various industries of the Singapore economy, with a mix of [blue-collar workers](/wiki/Blue-collar_worker) and [white-collar workers](/wiki/White-collar_worker), as well as students. ## Language This section **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources in this section. Unsourced material may be challenged and removed. *(August 2011)* *(Learn how and when to remove this message)* Traditionally, Singaporean Chinese used their respective mother tongues as their main avenue of communication. Although that led to communication difficulties amongst speakers of more distant [topolects](/wiki/Varieties_of_Chinese), it has nevertheless forged strong ethnic bonds amongst the Chinese community in Singapore. But today, the speech of Chinese in Singapore exhibits a great amount of linguistic diversity which includes [English](/wiki/Singapore_English), [Singlish](/wiki/Singlish), [Mandarin](/wiki/Singaporean_Mandarin), Singdarin (Colloquial Singaporean Mandarin), [Hokkien](/wiki/Singaporean_Hokkien), [Teochew](/wiki/Teochew_dialect), [Cantonese](/wiki/Cantonese), [Hakka](/wiki/Hakka), [Hainanese](/wiki/Hainanese), as well as other languages, with the traditional mother tongues of Singaporean Chinese on the losing end. Most Singaporean Chinese are generally bilingual, speaking both English and Mandarin. ### Before the 1980s Before the 1980s, Singaporean Chinese were either English-educated or Chinese-educated ([Standard Chinese](/wiki/Standard_Chinese)). The English-educated Chinese were educated with English as the medium of instruction and learnt little or no Mandarin in school (in such cases, Mandarin became an optional language). As a result, they became affianced to the English-speaking Singaporeans and inevitably distanced from the Mandarin-speaking Singaporeans but were still be able to speak their respective mother tongues. On the other hand, the Chinese-educated were educated with Mandarin as the medium of instruction but learnt little or no English. They usually spoke Mandarin and their respective mother tongues with little or no English. There was a portion of Singaporean Chinese who were bilingual, i.e. simultaneously educated with both English and Mandarin as the medium of instruction, or who attended Chinese-based primary schools and subsequently transferred to English-based schools for their secondary education. ### After the 1980s After the 1980s, all schools (including former Chinese-based schools) in Singapore are required to use English as the primary medium of instruction with Mandarin as the designated second language. Thus, Singaporean Chinese educated in after the 1980s are theoretically bilingual. English is the first language and therefore spoken by all Singaporeans. This was partly due to the policy of Singapore's government to make English the medium of instruction in all schools in the 1980s (including former Chinese-based schools), as well as making English the working language for administration and business in Singapore (in short making English the [lingua franca](/wiki/Lingua_franca) among all Singaporean). The presence of the English language in Singapore has its roots originating from Singapore's colonial past when Singapore was a British colony. As a result of the government's policy, English or Singlish has become widespread among the residents of Singapore, including but not limited to the Singaporean Chinese, and this especially the case among the younger generations. As of 2010, it was estimated that 32.6% of Singapore Chinese speak English at home. But at work or in the city and business district, English is the official [lingua franca](/wiki/Lingua_franca), but ironically [Hokkien](/wiki/Singaporean_Hokkien) remains extant amongst Singaporeans, not limited to the Chinese, and operates as an unofficial common language, reminiscent of Singapore before the 1980s. [Mandarin](/wiki/Singaporean_Mandarin) is another widely spoken language among Singaporean Chinese. As of 2010, it was estimated that 47.7% of Singaporean Chinese speak Mandarin at home. Evidently, Singapore government's [Speak Mandarin Campaign](/wiki/Speak_Mandarin_Campaign) was launched in the 1980s to make Mandarin the [lingua franca](/wiki/Lingua_franca) among the Han Chinese in Singapore. It was intended to be the language to unify Singaporean Chinese from different topolect groups by replacing the then [lingua franca](/wiki/Lingua_franca) [Hokkien](/wiki/Hokkien). This was also because Mandarin was deemed more economically valuable, and speaking Mandarin would help Singaporean Chinese retain their heritage, as Mandarin supposedly contains a cultural repository of values and traditions that are identifiable to all Chinese, regardless of topolect group. In the 1990s, this campaign began to target the English-speaking Singaporean Chinese. As a result of this campaign, Mandarin became widespread in places such as residential areas, neighbourhood markets and even business districts, with the various mother tongues of Singaporean Chinese falling out of favour among younger Singaporean Chinese. Mandarin is also often spoken in most \"traditional Chinese-based\" schools, even though English is now their medium of instruction. Colloquially, as with all other languages spoken in Singapore, Singaporean Chinese prefer a localised flavour of mixing words from English, [Hokkien](/wiki/Hokkien), [Malay](/wiki/Malaysian_language), and some other varieties, into their Mandarin speech. Most young Singaporean Chinese are capable of conversational Mandarin but are weaker in their ability to write Chinese, or with higher level conversations on complex, specialised topics. ### Variations according to age group The linguistic diversity among Singaporean Chinese varies across age groups. Most younger Singaporean Chinese are proficient in both English and Mandarin, whereas older generations, though also able to converse in Mandarin, often prefer other [Sinitic languages](/wiki/Sinitic_languages) such as [Hokkien](/wiki/Hokkien), [Cantonese](/wiki/Cantonese), [Teochew](/wiki/Teochew_dialect), [Hakka](/wiki/Hakka), or [Hainanese](/wiki/Hainanese). As these south-eastern Sinitic languages are no longer formally taught in schools, the number of fluent speakers has steadily declined. Additionally, many parents communicate with their children primarily in English, viewing it as the principal means of achieving upward social mobility. Consequently, a substantial portion of younger Singaporean Chinese exhibit limited proficiency in Mandarin. This trend is similarly observed among the more westernised Singaporean Chinese Christian community, who generally favour English over other languages. ### Debate over preferred language The question of which language is preferred in Singapore seem to have caused a debate among Singaporeans recently. The question of declining standards in the command of the Chinese language amongst Singaporean Chinese seems to cause several revisions in the government's education policies towards the Chinese language. The government of Singapore's continued policy towards bilingualism for all Singaporean Chinese, which is to continue to pursue English as the first language while making Mandarin the [lingua franca](/wiki/Lingua_franca) (or at least the 2nd language or home language) amongst all Chinese has drawn mixed responses. The more English-speaking Singaporean Chinese generally prefer English as the [lingua franca](/wiki/Lingua_franca) or their home language, while the Mandarin-speakers worry that English will replace Mandarin as the [lingua franca](/wiki/Lingua_franca), which would eliminate the thin thread of [Chinese identity](/wiki/Chinese_identity). With the rising economy of China in the 21st century, which has led to more Singaporean companies requiring fluency in Mandarin, Mandarin has been viewed with greater importance among Singaporean Chinese than before. Both English and Mandarin will continue to dominate the language scene among Singaporean Chinese. ### Preservation of other Chinese varieties There exists a strong need in preserving the many non-Mandarin topolects in Singapore. The decline of [Chinese indigenous religion](/wiki/Chinese_folk_religion) and [Taoism](/wiki/Taoism) indicates the serious deterioration of Chinese cultural heritage and values among the younger generation of Singaporean Chinese. Unless the government and Singaporean Chinese have the awareness and take their own initiative in preserving non-Mandarin varieties, they will inevitably disappear from Singapore in the future. There is thus a strong desire to restore the [Chinese identity](/wiki/Chinese_identity) or risk it falling into extinction one day. This exigency is translated into recently renewed efforts by [Chinese clan associations](/wiki/Chinese_clan_associations) in Singapore to impart and revive their respective Sinitic mother tongues, which are met with warm reception, including by some of the younger generations. Therefore, there lies a greater challenge for the Chinese community in Singapore – the preservation of the Chinese identity – than just the satisfaction of linguistic domination and material gains. Language Most Frequently Spoken at Home Among Chinese Resident Population Aged 5 and Over. Home language1990 ('000)2000 ('000)1990 (%)2000 (%)2010 (%)2020 (%)Total1,884.02,236.1100.0100.0100.0100.0English363.4533.919.323.932.647.6Mandarin566.21,008.530.145.147.740.2Other Chinese Topolects948.1685.850.330.719.211.8Others6.47.90.30.40.40.4 ## Socioeconomics ### Education Alongside other ethnic groups, Singaporeans of Chinese descent from all social backgrounds and occupations have achieved significant upward advances in their educational levels, income, and life expectancy and experienced other social indicators. Singapore's rapid industrialisation between the 1960s and the 1990s has lifted numerous people out of poverty and has created a broad middle class for many Singaporeans. During the period of rapid economic growth in the process, many Chinese began to experience upward social mobility for the first time in their lives. In 2000, Singaporean Chinese represented the second-highest proportion of university graduates after the Indian Singaporeans and their new citizenship holders. In 2008, 86.2% of Singaporean Chinese students achieved a minimum of 5 passes at O-level, the exams taken by 15- and 16-year-olds, compared to 59.3% for Singaporean Malays and 73% for Singaporean Indians. According to the 2010 Census, 22.6% of Singaporean Chinese have achieved a bachelor's degree, a figure below the national average of 22.8% and remained the second highest after the Indian Singaporeans because Singaporean Indians had a larger increase in the proportion of university graduates compared with Singaporean Chinese and Singaporean Malays. The increase in the proportion of Indian university graduates was mostly due to the inflow of Indian permanent residents with university qualifications. Some 60 per cent of Indian permanent residents were university graduates in 2005, up from 51 per cent in 2000. ### Employment As of 2005, 47.3% of Singaporean Chinese work in select white-collar occupations compared with the national average of 44.8%. The labour force participation rate was 63.6% contrasting towards the national average of 63.0%. This figure was up from 46.2% in 2000 and was highest participation rate during that year in the white collar workforce among the three major ethnic groups in Singapore. ### Economics While elsewhere in Southeast Asia where the Overseas Chinese constitute a market-dominant minority, Singaporean Chinese in direct contrast represent a market-dominant majority. Amounting to nearly three-quarters of the Singaporean population, Singaporeans of Chinese ancestry are estimated to control 81 percent of Singapore's publicly listed companies by market capitalisation, 96 percent of the nation's entire economy, in addition to contributing to 80 percent of Singapore's entire [GNP](/wiki/Gross_National_Product).[*dubious – discuss*] Characterized as a diminutive yet prosperous outsider nation surrounded and standing out amidst its geographically larger, politically unstable, technologically underdeveloped, and economically impoverished Southeast Asian counterparts that have remained hostile to the city-state's continued existence since its founding. Throughout the far reaches of Maritime Southeast Asia, Singapore itself is known and regarded as a \"small Chinese Island in a Muslim Sea,\" as Singaporean Chinese are reputed for their enterprising disposition, entrepreneurial prowess, financial savvy, and investment acumen that has led them to being regarded as the \"[Jew](/wiki/Jew) of the Orient\" as a result of the community's extensive economic influence that pervasively permeates throughout the country and the wider regional Southeast Asian economic outspread at large. Chinese-owned Singaporean businesses form a part of the larger [bamboo network](/wiki/Bamboo_network), an umbrella network of [Overseas Chinese](/wiki/Overseas_Chinese) businesses operating in the markets of Southeast Asia that share common family, ethnic, and cultural ties. Given contemporary China's growing [economic strength](/wiki/Economy_of_the_People%27s_Republic_of_China), a number of Singaporean Chinese businessmen and investors have turned to their ancestral roots through [clan associations](/wiki/Kongsi) to rekindle with their Han Chinese ancestry as well as to exhibit a sense of ethnic pride by expressing their homage, tribute, and honour to their forgone ancestors by partaking in China's economic development through the pursuit overseas business and investment opportunities offered in the country. Many have begun to regain consciousness of their ancestral roots by reining in on the plethora of business and investment opportunities presented as a result of the country's spectacular economic growth over the last four decades, by reinvigorating and revitalizing the economic development of their ancestral hometowns through the pursuit of various business and investment opportunities such as real estate development and property investing. Measured in 1990 dollars, the average household monthly income rose from S$3,080 in 1990 to S$4,170 in 2000 at an average annual rate of 2.8%. According to the 2005 Singaporean census, both the average and median monthly income for Singaporeans of Chinese origin were (S$3,610 and $2,500 respectively), exceeded the national average. The household and median income for Singaporean Chinese commonly exceed the national average where it remained the highest out of the three major ethnic groups in 2000. Singaporean Chinese held the second-highest median and average household income among all three major ethnic groups in Singapore after [Singaporean Indians](/wiki/Singaporean_Indian) in 2010. **Monthly household income from work by ethnic group of head (2000 and 2010)** Ethnic groupAverage household income ([SGD](/wiki/SGD)$) Median household income ([SGD](/wiki/SGD)$) 2000201020002010**Total****4,988****7,214****3,638****5,000**Chinese5,2587,3263,8005,100Malays3,1514,5752,7093,844Indians4,6237,6643,4385,370Others7,44611,5184,8707,432 ## Singaporean education system Singapore's Chinese education began with the establishment of old-style private Chinese schools (known as \"Sishu 私塾\") by early Chinese immigrants during the 19th century. These schools predominantly used various southern Chinese varieties (such as [Hokkien](/wiki/Hokkien)) as its medium to teach [Chinese classics](/wiki/Chinese_classics). In the 1920s, as influenced by China's [New Cultural Movement](/wiki/New_Cultural_Movement), many [Chinese schools](/wiki/Chinese_schools) in Singapore began to change its medium of instruction to [Mandarin](/wiki/Mandarin_Chinese). During the British colonial times, the colonial government generally allowed the Chinese community in Singapore to organise and develop its own system of Chinese education. By the 1930s and 1940s, with donations and funding from the public, more Chinese organisations began to set up more Chinese schools. In 1953, the chairman of [Singapore Hokkien Huay Kuan](/wiki/Singapore_Hokkien_Huay_Kuan), Mr.[Tan Lark Sye](/wiki/Tan_Lark_Sye) organised and helped to establish the first overseas Chinese-medium university ([Nanyang University](/wiki/Nanyang_University)) in Singapore, leading to the establishment of a well-structured Chinese-medium education system (from primary school to university) in Singapore. However, after the 1960s, the left-wing, communist ideology of the People's Republic of China conflicted with the capitalist policy of Singapore. To attract western investment, the Singaporean government decided to make English its main [lingua franca](/wiki/Lingua_franca) and working language. To prevent Singaporean Chinese from being influenced by left-wing political thoughts, Singapore greatly promoted English and attempted to end Chinese education. Singaporean Chinese were encouraged to attend English-medium schools for economic reasons; this was also a strategy to head off communist influence. Due to lesser proficiency in English, Chinese-educated Singaporeans often encountered discrimination and difficulty in finding jobs in Singapore. Thus, the majority of Chinese Singaporeans sent their children to English-medium schools for better job prospects, causing the number of students registered at Chinese-medium schools to drop annually. All these factors (including biased government policies) led to the Chinese-medium education system being abolished in Singapore.\n",
  "language": "en",
  "processed_at": "2026-01-12T10:02:55.222141",
  "title": "Chinese Singaporeans",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Chinese_Singaporeans"
}