{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:02:49.188470"
  },
  "content": "Traditional Chinese holiday **Chinese New Year**, also known as the **Spring Festival** (see also § Names), marks the beginning of a [new year](/wiki/New_Year) on the traditional [lunisolar](/wiki/Lunisolar_calendar) [Chinese calendar](/wiki/Chinese_calendar). It is one of the most important holidays in [Chinese culture](/wiki/Chinese_culture) and was placed on the [UNESCO](/wiki/UNESCO) [Intangible Cultural Heritage](/wiki/Intangible_Cultural_Heritage) of [Humanity list](/wiki/UNESCO_Intangible_Cultural_Heritage_Lists#Representative_List_of_the_Intangible_Cultural_Heritage_of_Humanity) in 2024. Marking the end of winter and the beginning of spring, this festival takes place from [Chinese New Year's Eve](/wiki/Chinese_New_Year%27s_Eve) (the evening preceding the first day of the year) to the [Lantern Festival](/wiki/Lantern_Festival), held on the 15th day of the year. The first day of the Chinese New Year falls on the [new moon](/wiki/New_moon) that appears between 21 January and 20 February.[a] The Chinese New Year is associated with several myths and customs. The festival was traditionally a time to honour [deities](/wiki/Deity) and ancestors. Throughout China, different regions celebrate the New Year with distinct local customs and traditions. Chinese New Year's Eve is an occasion for Chinese families to gather for the annual [reunion dinner](/wiki/Reunion_dinner). Traditionally, every family would thoroughly clean their house, symbolically sweeping away any ill fortune to make way for incoming good luck. Windows and doors may be decorated with red [paper-cuts](/wiki/Chinese_paper_cutting) and [couplets](/wiki/Couplet_(Chinese_poetry)) representing themes such as [good fortune, happiness](/wiki/Fu_character), wealth, and longevity. Other activities include lighting [firecrackers](/wiki/Firecracker) and giving money in [red envelopes](/wiki/Red_envelope). Chinese New Year is also celebrated worldwide in regions and countries with significant [overseas Chinese](/wiki/Overseas_Chinese) or [Sinophone](/wiki/Sinophone) populations, especially in Southeast Asia, including Australia, Singapore, Brunei, Cambodia, Indonesia, Malaysia, Myanmar, the Philippines, and Thailand. It is also prominent beyond Asia, especially in Australia, Canada, France, Mauritius, New Zealand, Peru, South Africa, the United Kingdom, as well as in many other European countries, and the United States. Chinese New Year has influenced celebrations, commonly referred to collectively as [Lunar New Year](/wiki/Lunar_New_Year), in other cultures, such as the [Losar](/wiki/Losar) of Tibet, the [Tết](/wiki/T%E1%BA%BFt) of Vietnam, the [Seollal](/wiki/Korean_New_Year) of Korea, the [Shōgatsu](/wiki/Japanese_New_Year) of Japan, and the [Ryukyu New Year](/wiki/Ryukyu_New_Year) ([Okinawan](/wiki/Okinawan_language): *Sjoogwaci*). ## Names In Chinese, the festival is commonly known as the \"Spring Festival\" (traditional Chinese: 春節; simplified Chinese: 春节; pinyin: *Chūnjié*), as the [spring season](/wiki/Spring_(season)) in the [lunisolar calendar](/wiki/Lunisolar_calendar) traditionally starts with *[lichun](/wiki/Lichun)*, the first of the twenty-four [solar terms](/wiki/Solar_term) that the festival celebrates around the time of the Chinese New Year. The name was first proposed in 1914 by [Yuan Shikai](/wiki/Yuan_Shikai), who was the interim [president of the Republic of China](/wiki/President_of_the_Republic_of_China). The official usage of the name \"Spring Festival\" was retained by the government of the [People's Republic of China](/wiki/China), but the government of the Republic of China [based in Taiwan](/wiki/Free_area_of_the_Republic_of_China) has since adopted the name \"Traditional Chinese New Year\". The festival is also called \"Lunar New Year\" in English, despite the traditional Chinese calendar being lunisolar and not [lunar](/wiki/Lunar_calendar). However, \"Chinese New Year\" is still a commonly used translation for people of non-Chinese backgrounds. Along with the [Han Chinese](/wiki/Han_Chinese) inside and outside of [Greater China](/wiki/Greater_China), as many as 29 of the 55 ethnic minority groups in China also celebrate Chinese New Year. Korea, Vietnam, Singapore, Malaysia, Indonesia, and the Philippines celebrate it as an official festival. ## Dates in the Chinese lunisolar calendar The [Chinese calendar](/wiki/Chinese_calendar) defines the lunisolar month containing the [winter solstice](/wiki/Winter_solstice) as the eleventh month, meaning that Chinese New Year usually falls on the second [new moon](/wiki/New_moon) after the winter solstice (rarely the third, if an intercalary month occurs[b]). In more than 96 percent of years, the Chinese New Year is the closest [new moon](/wiki/New_moon) to the beginning of spring (*[lichun](/wiki/Lichun)*) according to the calendar. In the [Gregorian calendar](/wiki/Gregorian_calendar), Chinese New Year occurs on the new moon that falls between 21 January and 20 February. GregorianDateAnimalDay of the week202410 Feb[Dragon](/wiki/Dragon_(zodiac))Saturday202529 Jan[Snake](/wiki/Snake_(zodiac))Wednesday202617 Feb[Horse](/wiki/Horse_(zodiac))Tuesday20276 Feb[Goat](/wiki/Goat_(zodiac))Saturday202826 Jan[Monkey](/wiki/Monkey_(zodiac))Wednesday202913 Feb[Rooster](/wiki/Rooster_(zodiac))Tuesday20303 Feb[Dog](/wiki/Dog_(zodiac))Sunday203123 Jan[Pig](/wiki/Pig_(zodiac))Thursday203211 Feb[Rat](/wiki/Rat_(zodiac))Wednesday203331 Jan[Ox](/wiki/Ox_(zodiac))Monday203419 Feb[Tiger](/wiki/Tiger_(zodiac))Sunday20358 Feb[Rabbit](/wiki/Rabbit_(zodiac))Thursday ### Chinese Calendar Computation This section **may incorporate text from a large language model**. It may include [hallucinated](/wiki/Hallucination_(artificial_intelligence)) information, copyright violations, claims not verified in cited sources, original research, or fictitious references. Any such material should be removed and content with an unencyclopedic tone should be rewritten. *(September 2025)* *(Learn how and when to remove this message)* The compilation and implementation of the Chinese calendar adhere to the following rules: 1. Standard Time Reference: Beijing Time is used as the standard time for calculations. 2. First Day of Lunisolar Month: Each lunisolar month begins on the [new moon](/wiki/New_moon) (Shuo Ri, 朔日). 3. Eleventh Lunisolar Month: The lunisolar month that contains the Winter Solstice [(Dongzhi](/wiki/Dongzhi_(solar_term)), 冬至) is designated as the 11th lunisolar month. 4. Intercalary Month Rule: If there are 13 lunisolar months in a year, the first month without a major solar term (Zhongqi, 中氣) is designated as the leap month. 5. Start of the New Year: The second lunisolar month after the 11th month (excluding leap months) is designated as the first month of the new year. The Chinese calendar is based on precise astronomical calculations of the sun and the moon's positions, following the standards set by the International [Celestial Reference System](/wiki/Celestial_reference_system) (ICRS) and the International Earth Rotation and Reference Systems Service (IERS). The naming of the years follows the [Sexagenary Cycle](/wiki/Sexagenary_cycle) (Ganzhi, 干支纪年), where years cycle through 60 combinations of the 10 [Heavenly Stems](/wiki/Heavenly_Stems) (Tiangan, 天干) and 12 [Earthly Branches](/wiki/Earthly_Branches) (Dizhi, 地支). For example, the Chinese year from 2 February 1984, to 19 February 1985, was designated as a Jiazi (甲子) year. ## Mythology According to legend, Chinese New Year started with combatting a mythical beast called the [Nian](/wiki/Nian) (a beast that lives under the sea or in the mountains that looks like a lion with horns) during the annual Spring Festival. The Nian would eat villagers, especially children, in the middle of the night. One year, all the villagers decided to hide from the beast. An older man appeared before the villagers went into hiding and said that he would stay the night and would get revenge on the Nian. The old man put up red papers and set off firecrackers. The day after, the villagers came back to their town and saw that nothing had been destroyed. They assumed that the old man was a deity who had come to save them. The villagers then understood that the Nian was afraid of the colour red and loud noises. As the New Year approached, the tradition grew: villagers wore red clothing, hung red lanterns and spring scrolls on windows and doors, and used firecrackers and drums to frighten away the Nian. From then on, the Nian never came to the village again. The Nian was eventually captured by [Hongjun Laozu](/wiki/Hongjun_Laozu), an ancient Taoist monk. ## History Part of a series on[Chinese folk religion](/wiki/Chinese_folk_religion)Concepts - [Tian](/wiki/Tian)—[Shangdi](/wiki/Shangdi) - [Qi](/wiki/Qi) - [Shen](/wiki/Shen_(Chinese_religion)) - [Ling](/wiki/Ling_(Chinese_religion)) - [Xian ling](/wiki/Xian_ling_(religion)) - [Yinyang](/wiki/Yin_and_yang) - [Hundun](/wiki/Hundun) - [Mingyun](/wiki/Ming_yun) - [Yuanfen](/wiki/Yuanfen) - [Baoying](/wiki/Bao_ying) - [Wu](/wiki/Wu_(Chinese_religion)) Theory - [Chinese theology](/wiki/Chinese_theology) - [Chinese gods and immortals](/wiki/Chinese_gods_and_immortals) - [Chinese mythology](/wiki/Chinese_mythology) - [Chinese astrology](/wiki/Chinese_astrology) - [Chinese zodiac](/wiki/Chinese_zodiac) - [Chinese creation myth](/wiki/Chinese_creation_myth) - [Chinese spiritual world concepts](/wiki/Chinese_spiritual_world_concepts) **Model humanity:** - [Xian](/wiki/Xian_(Taoism)) - [Zhenren](/wiki/Zhenren) - [Wen and wu](/wiki/Wen_and_wu) Practices - [Fenxiang](/wiki/Fenxiang) - [Jingxiang](/wiki/Jingxiang) - [Feng shui](/wiki/Feng_shui) - [Miaohui](/wiki/Miaohui) - [Wu shamanism](/wiki/Wu_(shaman)) - [Jitong mediumship](/wiki/Tongji_(spirit_medium)) - [Precious scrolls](/wiki/Baojuan) Institutions and temples - [Associations of good-doing](/wiki/Associations_of_good-doing) - [Lineage associations or churches](/wiki/Chinese_lineage_associations) - [Chinese temple](/wiki/Chinese_temple) - [Ancestral shrine](/wiki/Ancestral_shrine) - [Chinese Folk Temples' Association](/wiki/Chinese_Folk_Temples%27_Management_Association) Festivals - [Qingming](/wiki/Qingming_Festival) - [Zhongyuan](/wiki/Ghost_Festival) - [Zhongqiu](/wiki/Mid-Autumn_Festival) - [Jiuhuangye](/wiki/Nine_Emperor_Gods_Festival) - [Qixi](/wiki/Qixi_Festival) - [Duanwu](/wiki/Duanwu_Festival) - Nian Internal traditions**Major cultural forms** - [Chinese ancestral religion](/wiki/Chinese_ancestral_religion) - [Chinese communal deity religion](/wiki/Chinese_communal_deity_religion) - [Chinese food therapy](/wiki/Chinese_food_therapy) - [Chinese geomancy](/wiki/Feng_shui) - [Chinese mother goddess worship](/wiki/Chinese_mother_goddess_worship) - [Northeast China folk religion](/wiki/Northeast_China_folk_religion) - [Traditional Chinese medicine](/wiki/Traditional_Chinese_medicine) - [Qigong](/wiki/Qigong) **Main philosophical traditions:** - [Confucianism](/wiki/Confucianism) ([state rites](/wiki/Confucian_ritual_religion)) - [Taoism](/wiki/Taoism) - [Three teachings](/wiki/Three_teachings) - [Other schools](/wiki/Chinese_philosophy) ([Mohism](/wiki/Mohism)) **Ritual traditions:** - [Folk ritual masters' orders](/wiki/Chinese_ritual_mastery_traditions) - [Jitong mediumship](/wiki/Tongji_(spirit_medium)) - [Nuo folk religion](/wiki/Nuo_folk_religion) - [Chinese shamanism](/wiki/Chinese_shamanism) **Devotional traditions:** - [Mazuism](/wiki/Mazuism) - [Ong Yah](/wiki/Ong_Yah) worship **[Salvation churches and sects](/wiki/Chinese_salvationist_religions):** - [De teaching](/wiki/De_teaching) - [Jiugongdao](/wiki/Jiugongdao) - [Luo teaching](/wiki/Luo_teaching) - [Maitreya teachings](/wiki/Maitreya_teachings) - [Tiandi teachings](/wiki/Tiandi_teachings) - [Tianxian miaodao](/wiki/Tianxian_miaodao) - [Xia teaching](/wiki/Sanyi_teaching) - [Xiantiandao](/wiki/Xiantiandao) - [Yiguandao](/wiki/Yiguandao) - [Zaili teaching](/wiki/Zaili_teaching) **[Confucian churches](/wiki/Confucian_church) and sects:** - [Holy Confucian Church](/wiki/Holy_Confucian_Church) - [Indonesian Confucian Church](/wiki/Supreme_Council_for_the_Confucian_Religion_in_Indonesia) - [Universal Church of the Way and its Virtue](/wiki/Universal_Church_of_the_Way_and_its_Virtue) - [Phoenix churches](/wiki/Way_of_the_Gods_according_to_the_Confucian_Tradition) - [Xuanyuanism](/wiki/Xuanyuan_teaching) - [Taigu school](/wiki/Taigu_school) Related religions and movements - [Benzhuism](/wiki/Benzhuism) - [Bimoism](/wiki/Bimoism) - [Bon](/wiki/Bon) - [Dongbaism](/wiki/Dongbaism) - [Han Buddhism](/wiki/Chinese_Buddhism) - [Miao folk religion](/wiki/Miao_folk_religion) - [Vietnamese folk religion](/wiki/Vietnamese_folk_religion) - [Qiang folk religion](/wiki/Qiang_folk_religion) - [Yao folk religion](/wiki/Yao_folk_religion) - [Zhuang folk religion](/wiki/Zhuang_folk_religion) - [House church (China)](/wiki/House_church_(China)) - Religion portal - v - t - e Before the new year celebration was established, ancient Chinese gathered and celebrated the end of the harvest in autumn. However, this was not the [Mid-Autumn Festival](/wiki/Mid-Autumn_Festival), during which the Chinese gathered with family to worship the Moon. In the *[Classic of Poetry](/wiki/Classic_of_Poetry)*, a poem written during the [Western Zhou](/wiki/Western_Zhou) period (1046 BC – 771 BC) by an anonymous farmer, described the traditions of celebrating the 10th month of the ancient [solar calendar](/wiki/Chinese_calendar#Solar_calendars), which was in autumn. The poem describes people cleaning millet stacks, offering [mijiu](/wiki/Mijiu) (rice wine) to guests, slaughtering lambs, visiting their master's home, toasting him, and expressing wishes for longevity together. The 10th month celebration is believed to be one of the prototypes of Chinese New Year. The records of the first Chinese New Year celebration can be traced to the [Warring States period](/wiki/Warring_States_period) (475 – 221 BC). In the *[Lüshi Chunqiu](/wiki/L%C3%BCshi_Chunqiu)*, in the [Qin](/wiki/Qin_(state)) state, an exorcism ritual to expel illness, called \"Big [Nuo](/wiki/Nuo_folk_religion)\", was recorded as being carried out on the last day of the year. Later, [Qin unified China](/wiki/Qin%27s_wars_of_unification), and the [Qin dynasty](/wiki/Qin_dynasty) was founded; and the ritual spread. It evolved into the practice of cleaning one's house thoroughly in the days preceding the Chinese New Year. The first mention of celebrating the start of a new year was recorded during the [Han dynasty](/wiki/Han_dynasty) (202 BC – 220 AD). In the book *Simin Yueling* (四民月令), written by the Eastern Han [agronomist](/wiki/Agriculturist) Cui Shi (崔寔), such a celebration was described: \"The starting day of the first month is called Zheng Ri. I bring my wife and children to worship ancestors and commemorate my father.\" Later, he wrote: \"Children, wife, grandchildren, and great-grandchildren all serve pepper wine to their parents, make their toast, and wish their parents good health. It's a thriving view.\" The practice of worshipping ancestors on New Year's Eve is maintained by Chinese people to this day. Han Chinese also started the custom of visiting acquaintances' homes and wishing each other a happy new year. In *[Book of the Later Han](/wiki/Book_of_the_Later_Han)*, volume 27, a county officer was recorded as going to his prefect's house with a government secretary, toasting the prefect, and praising the prefect's merit. During the [Jin dynasty](/wiki/Jin_dynasty_(266%E2%80%93420)) (266–420), people started the New Year's Eve tradition of all-night revelry called *shousui* (守歲). It was described in an article by [Zhou Chu](/wiki/Zhou_Chu), a general of the Western Jin, *Fengtu Ji* (風土記, \"Notes on Local Conditions\"): \"At the ending of a year, people gift and wish each other, calling it *Kuisui* (饋歲, 'time for gifts'); people invited others with drinks and food, calling it *Biesui* (別歲, 'sending off the year'); on New Year's Eve, people stayed up all night until sunrise, calling it *Shousui* (守歲, 'guard the year').\" The article used the phrase *chuxi* (除夕) to indicate New Year's Eve—a phrase still used today. A book of the [Northern and Southern dynasties](/wiki/Northern_and_Southern_dynasties), *[Jingchu Suishiji](/wiki/Jingchu_Suishiji)*, describes the practice of firing bamboo in the early morning of New Year's Day, a New Year's tradition of the ancient Chinese. Poet and chancellor of the [Tang dynasty](/wiki/Tang_dynasty), Lai Gu, also described this tradition in his poem *Early Spring* (早春): \"新曆才將半紙開，小亭猶聚爆竿灰\", meaning \"Another new year just started as a half-opening paper, and the family gathered around the dust of exploded bamboo poles.\" The practice was used by ancient Chinese people to scare away evil spirits, since bamboo would noisily crack and explode from being fired. During the [Tang dynasty](/wiki/Tang_dynasty), people established the custom of sending *bai nian tie* (拜年帖, \"New Year's greetings\"), New Year's greeting cards. It is said that the custom was started by [Emperor Taizong of Tang](/wiki/Emperor_Taizong_of_Tang). The emperor wrote \"普天同慶\" (\"whole nation celebrates together\") on gold leaves and sent them to his ministers. Word of the emperor's gesture spread, and later it became the custom of people in general, who used [Xuan paper](/wiki/Xuan_paper) instead of gold leaves. Another theory is that *bai nian tie* was derived from the Han dynasty's name tag, *men zhuang* (門狀, \"door opening\"). As [imperial examinations](/wiki/Keju) became essential and reached their heyday under the Tang dynasty, candidates curried favour to become pupils of respected teachers and to get recommendation letters. After obtaining good examination marks, a pupil went to the teacher's home with a *men zhuang* to convey their gratitude. Eventually, *men zhuang* became a symbol of good luck, and people started sending them to friends on New Year's Day, calling them by a new name, *bai nian tie*. The *[Chunlian](/wiki/Antithetical_couplet)* (*Spring Couplets*) was written by [Meng Chang](/wiki/Meng_Chang), an emperor of the [Later Shu](/wiki/Later_Shu) (935–965 AD), during the [Five Dynasties and Ten Kingdoms period](/wiki/Five_Dynasties_and_Ten_Kingdoms_period)：\"新年納餘慶，嘉節號長春\" (\"Enjoying past legacies in the new year, the holiday foreseeing the long-lasting spring\"). As described by Song dynasty official Zhang Tangying in his book *Shu Tao Wu*, Volume 2, on the day of New Year's Eve the emperor ordered the scholar Xin Yinxun to write the couplets on peach wood and hang them on the emperor's bedroom door. It is believed that placing the [couplets](/wiki/Antithetical_couplet) on the door to the home in the days preceding the new year was widespread during the [Song dynasty](/wiki/Song_dynasty). The famous [Northern Song](/wiki/Northern_Song) politician, littérateur, philosopher, and poet [Wang Anshi](/wiki/Wang_Anshi) recorded the custom in his poem \"元日\" (\"New Year's Day\"). > 爆竹聲中一歲除， > 春風送暖入屠蘇。 > 千門萬戶曈曈日， > 總把新桃換舊符。 —[王安石](/wiki/%E7%8E%8B%E5%AE%89%E7%9F%B3), 元日Translation: > Amid the sound of firecrackers, a year has come to an end, > The spring wind has wafted warm breath to the [Tusu](/wiki/Toso) wine. > While the rising sun shines over each and every household, > People get rid of the old couplets and put up the new ones. —[Wang Anshi](/wiki/Wang_Anshi), New Year's Day The poem *Yuan Ri* (元日) also includes the word *bao zhu* (爆竹, \"exploding bamboo\"), which is believed to be a reference to firecrackers,[*citation needed*] instead of the previous tradition of firing bamboo, both of which are called the same in the Chinese language. After [gunpowder was invented in the Tang dynasty](/wiki/History_of_gunpowder) and widely used under the [Song dynasty](/wiki/Song_dynasty), people modified the tradition of firing bamboo by filling the bamboo pole with gunpowder, which made for louder explosions. Later, under the Song, people discarded the bamboo and started to use paper to wrap the gunpowder in cylinders, in imitation of the bamboo. The firecracker was still called *bao zhu* (爆竹), thus equating the new and old traditions. It is also recorded that people linked the firecrackers with hemp rope and created the *bian pao* (鞭炮, \"gunpowder whip\") in the Song dynasty. Both *bao zhu* (爆竹) and *bian pao* (鞭炮) are still used today to celebrate the Chinese New Year and other festive occasions. It was also during the [Song dynasty](/wiki/Song_dynasty) that people started to give money to children in celebration of a new year. The money was called *sui nian qian* (随年钱, \"money based on age\"). In the chapter, \"Ending of a Year\" (歲除) in *Wulin jiushi* (武林舊事), concubines of the emperor prepared a hundred and twenty coins for princes and princesses to wish them longevity. New Year's celebrations continued under the [Yuan dynasty](/wiki/Yuan_dynasty), when people also gave *[nian gao](/wiki/Nian_gao)* (年糕, \"year cakes\") to relatives. The tradition of eating Chinese dumplings, *[jiaozi](/wiki/Jiaozi)* (餃子), was established under the [Ming dynasty](/wiki/Ming_dynasty), at the latest. It is described in the book *Youzhongzhi* (酌中志): \"People get up at 5 in the morning of new year's day, burn incense and light firecrackers, throw door latch or wooden bars in the air three times, drink pepper and thuja wine, eat dumplings. Sometimes put one or two silver currency inside dumplings, and whoever gets the money will attain a year of fortune.\" Modern Chinese people also put other food that is auspicious into dumplings: such as dates, which prophesy a flourishing new year; candy, which predicts sweet days; and *[nian gao](/wiki/Nian_gao)* (年糕, \"year cakes\"), which foretell a rich life. In the [Qing dynasty](/wiki/Qing_dynasty), the name *ya sui qian* (壓歲錢, \"New Year's Money\") was money given to children during New Year's. The book *Qing Jia Lu* (清嘉錄) recorded: \"elders give children coins threaded together by a red string, and the money is called *Ya Sui Qian*.\" The term is still used by Chinese people today. The money was presented in two forms: coins strung on red string or colourful purses filled with coins. In 1928, the ruling [Kuomintang](/wiki/Kuomintang) party decreed that Chinese New Year would fall on 1 January of the Gregorian calendar, but this was abandoned due to overwhelming opposition. In 1967, during the [Cultural Revolution](/wiki/Cultural_Revolution), official Chinese New Year celebrations were banned in China. The State Council of the People's Republic of China announced that the public should \"change customs\" and have a \"revolutionized and fighting Spring Festival\". Since people needed to work on Chinese New Year's Eve, they would not need holidays during the Spring Festival. After the Cultural Revolution ended, public celebrations were reinstated. ### Recognition by the United Nations In 2024, Chinese New Year was added to the [Intangible Cultural Heritage](/wiki/Intangible_Cultural_Heritage) of [Humanity list](/wiki/UNESCO_Intangible_Cultural_Heritage_Lists#Representative_List_of_the_Intangible_Cultural_Heritage_of_Humanity) by the [United Nations Educational, Scientific and Cultural Organisation](/wiki/UNESCO). ## Public holiday Chinese New Year is observed as a public holiday in some countries and territories, outside of China, with a sizable Chinese population. Since Chinese New Year falls on different days of the week each year, the governments of some of these countries choose to adjust working days to create a longer public holiday. In certain countries, a statutory holiday is added on the following workday if the New Year (as a public holiday) falls on a weekend. For example, in 2013, New Year's Eve (9 February) fell on a Saturday and New Year's Day (10 February) on a Sunday. The holiday may be referred to by different names depending on the country: common English terms include \"Chinese New Year\", \"Lunar New Year\", \"New Year Festival\", and \"Spring Festival\". For New Year celebrations that follow Chinese-inspired calendars but are outside of China and the Chinese diaspora (such as Korea's [*Seollal*](/wiki/Korean_New_Year) and Vietnam's *[Tết](/wiki/T%E1%BA%BFt)*), see the article on [Lunar New Year](/wiki/Lunar_New_Year). For other countries and regions where the Chinese New Year is celebrated but not as an official holiday, see the table below. Country/regionOfficial nameDescriptionNo. of days[Malaysia](/wiki/Malaysia)Tahun Baru CinaThe first 2 days of Chinese New Year.2[Singapore](/wiki/Singapore)Chinese New YearThe first 2 days of Chinese New Year.2[Brunei](/wiki/Brunei)Tahun Baru CinaHalf-day on [Chinese New Year's Eve](/wiki/Chinese_New_Year%27s_Eve) and the first day of Chinese New Year.1[Hong Kong](/wiki/Hong_Kong)Lunar New YearThe first 3 days of Chinese New Year.3[Macau](/wiki/Macau)Novo Ano LunarThe first 3 days of Chinese New Year3[Indonesia](/wiki/Indonesia)Tahun Baru Imlek (Sin Cia)The first day of Chinese New Year.1[China](/wiki/China)Spring Festival (Chūn Jié)[The eve](/wiki/Chinese_New_Year%27s_Eve) and first 3 days of Chinese New Year. Extra holiday days are de facto added adjusting the weekend days before and after the three days holiday, resulting in a full week of public holiday known as [Golden Week](/wiki/Golden_Week_(China)). During the [Chunyun holiday travel season](/wiki/Chunyun).4 (official holiday days) 7 (de facto holiday days)[Myanmar](/wiki/Myanmar)Chinese New YearThe first day of Chinese New Year.1[Philippines](/wiki/Philippines)Chinese New YearHalf-day on [Chinese New Year's Eve](/wiki/Chinese_New_Year%27s_Eve) and the first day of Chinese New Year.1[South Korea](/wiki/South_Korea)[Korean New Year](/wiki/Korean_New_Year) (Seollal)The first 3 days of Chinese New Year.3[Taiwan](/wiki/Taiwan)[Lunar New Year](/wiki/Lunar_New_Year_in_Taiwan)Chinese New Year's Eve and the first 3 days of Chinese New Year; will be made up on subsequent working days if any of the 4 days fall on Saturday or Sunday. The day before Chinese New Year's Eve is also designated as holiday, but as a bridge holiday, and will be made up on an earlier or later Saturday. Additional bridge holidays may apply, resulting in 9-day or 10-day weekends.4 (legally) 9–10 (including Saturdays and Sundays)[Thailand](/wiki/Thailand)Wan Trut Chin (Chinese New Year's Day)Observed by [Thai Chinese](/wiki/Thai_Chinese) and parts of the private sector. Usually celebrated for three days, starting on the day before the [Chinese New Year's Eve](/wiki/Chinese_New_Year%27s_Eve). Chinese New Year is observed as a public holiday in [Narathiwat](/wiki/Narathiwat_Province), [Pattani](/wiki/Pattani_Province), [Yala](/wiki/Yala_Province), [Satun](/wiki/Satun_Province) and [Songkhla Provinces](/wiki/Songkhla_Province).1[Vietnam](/wiki/Vietnam)[Tết Nguyên Đán](/wiki/T%E1%BA%BFt) (Vietnamese New Year)The first 3 days of Chinese New Year.3[Japan](/wiki/Japan)[Shōgatsu](/wiki/Japanese_New_Year) (Japanese New Year)Since 1873, the official Japanese New Year has been celebrated according to the Gregorian calendar, on 1 January of each year, New Year's Day (元日, Ganjitsu).4[New York](/wiki/New_York_(state)), United StatesLunar New YearThe first day of Lunar New Year.1[California](/wiki/California), United States[Suriname](/wiki/Suriname)Maan NieuwjaarThe first day of Chinese New Year.1 ## Festivities > Red couplets and red lanterns are displayed on the door frames and light up the atmosphere. The air is filled with strong Chinese emotions. In stores in Beijing, Shanghai, Wuhan, and other cities, products of traditional Chinese style have started to lead fashion trend[s]. Buy yourself a Chinese-style coat, get your kids tiger-head hats and shoes, and decorate your home with some beautiful red Chinese knots, then you will have an authentic Chinese-style Spring Festival. — *[Xinwen Lianbo](/wiki/Xinwen_Lianbo)*, January 2001, quoted by Li Ren, *Imagining China in the Era of Global Consumerism and Local Consciousness* ### Preceding days On the eighth day of the lunisolar month before the Chinese New Year, the [Laba Festival](/wiki/Laba_Festival), a traditional porridge, [Laba porridge](/wiki/Laba_porridge) (simplified Chinese: 腊八粥; traditional Chinese: 臘八粥; pinyin: *làbā zhōu*), is served in remembrance of an ancient festival, called *La*, that occurred shortly after the winter solstice. Pickles such as Laba garlic, which turns green from vinegar, are made on this day. For those who practice Buddhism, the Laba holiday is also considered [Bodhi Day](/wiki/Bodhi_Day). *Layue* (simplified Chinese: 腊月; traditional Chinese: 臘月; pinyin: *Làyuè*) is a term often associated with Chinese New Year as it refers to the sacrifices held in honour of the gods in the twelfth lunisolar month; hence, the cured meats of Chinese New Year are known as *larou* (simplified Chinese: 腊肉; traditional Chinese: 臘肉; pinyin: *làròu*). The porridge was prepared by the women of the household at first light, with the first bowl offered to the family's ancestors and the household deities. Every member of the family was then served a bowl, with leftovers distributed to relatives and friends. It is still served as a special breakfast on this day in some Chinese homes. The concept of the \"La month\" is similar to [Advent](/wiki/Advent) in Christianity. Many families eat vegetarian meals on Chinese New Year's Eve, and the garlic and preserved meat are eaten on Chinese New Year Day. On the days immediately before the new year celebration, Chinese families give their homes a thorough cleaning. There is a Cantonese saying \"Wash away the dirt on *nin ya baat*\" (Chinese: 年廿八，洗邋遢; pinyin: *nián niàn bā, xǐ lātà*; Jyutping: *nin4 jaa6 baat3, sai2 laap6 taap3 (laat6 taat3)*, the 28th day of month 12), but the practice is not restricted to *nin ya baat*. It is believed that the cleaning sweeps away the bad luck of the preceding year and prepares homes for good luck. Brooms and dust pans are put away on the first day so that the newly arrived good luck cannot be swept away. Some people give their homes, doors, and window-frames a new coat of red paint; decorators and paper-hangers experience a year-end rush of business before the Chinese New Year. Homes are often decorated with paper cutouts of Chinese auspicious phrases and [couplets](/wiki/Couplet_(Chinese_poetry)). Purchasing new clothing and shoes also symbolizes a new start. Any haircuts need to be completed before the New Year, as cutting hair on New Year is considered bad luck due to the homonymic nature of the word \"hair\" (fa) and the word for \"prosperity\". Businesses are expected to pay off all the debts outstanding for the year before New Year's Eve, including debts of gratitude. Thus, it is a common practice to send gifts and rice to close business associates and extended family members. In many households where Buddhism or Taoism is observed, home altars and statues are cleaned thoroughly, and decorations used to adorn altars over the past year are taken down and burned a week before the new year starts on [Little New Year](/wiki/Little_New_Year), to be replaced with new decorations. Taoists (and Buddhists to a lesser extent) will also \"send gods back to heaven\" (Chinese: 送神; pinyin: *sòngshén*): an example would be burning a paper effigy of the [Kitchen God](/wiki/Kitchen_God), the recorder of family functions. This is done so that the Kitchen God can report to the [Jade Emperor](/wiki/Jade_Emperor) of the family household's transgressions and good deeds. Families often offer sweet foods (such as candy) to \"bribe\" the deities into reporting good things about the family. Before the Reunion Dinner, a prayer of thanksgiving is held to mark the safe passage of the previous year. [Confucianists](/wiki/Confucianism_in_China) take the opportunity to remember their ancestors, and those who had lived before them are revered. Some people do not offer a Buddhist prayer due to the influence of Christianity, with a Christian prayer offered instead. ### Chinese New Year's Eve\n",
  "language": "en",
  "processed_at": "2026-01-12T10:02:49.188087",
  "title": "Chinese New Year",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Chinese_New_Year"
}