{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:02:59.080713"
  },
  "content": "Sino-Tibetan language **Chinese** ([spoken](/wiki/Spoken_language): [simplified Chinese](/wiki/Simplified_Chinese_characters): 汉语; [traditional Chinese](/wiki/Traditional_Chinese_characters): 漢語; [pinyin](/wiki/Pinyin): *Hànyǔ*,[a] [written](/wiki/Written_language): 中文; *Zhōngwén*[b]) is an [umbrella term](/wiki/Umbrella_term) for all [Sinitic languages](/wiki/Sinitic_languages), widely recognized as a collection of [language varieties](/wiki/Variety_(linguistics)),[f] spoken natively by the ethnic [Han Chinese](/wiki/Han_Chinese) majority and many [minority ethnic groups](/wiki/List_of_ethnic_groups_in_China) in [Greater China](/wiki/Greater_China), as well as by various communities of the [Chinese diaspora](/wiki/Chinese_diaspora). Approximately 1.39 billion people, or 17% of the global population, speak one of the [varieties of Chinese](/wiki/Varieties_of_Chinese) as their [first language](/wiki/First_language). The different Chinese language varieties together form the largest branch of the [Sino-Tibetan languages](/wiki/Sino-Tibetan_languages). While the [Chinese government](/wiki/Chinese_government) defines all spoken Chinese varieties as merely diverse [dialects](/wiki/Dialect) of a single language, the often lack of [mutual intelligibility](/wiki/Mutual_intelligibility), especially among those outside of the dominant [northern varieties](/wiki/Mandarin_Chinese), have led [linguists](/wiki/Linguist) to consider them as separate languages within a [language family](/wiki/Language_family).[g] Investigation of the [historical relationships](/wiki/Historical_linguistics) among the varieties of Chinese is ongoing. Currently, most classifications posit 7 to 13 main regional groups based on phonetic developments from [Middle Chinese](/wiki/Middle_Chinese), of which the most spoken by far is [Mandarin](/wiki/Mandarin_Chinese) with 66%, or around 800 million speakers, followed by [Min](/wiki/Min_Chinese) (75 million, e.g., [Hokkien](/wiki/Hokkien) and [Teochew](/wiki/Teochew_Min)), [Wu](/wiki/Wu_Chinese) (74 million, e.g., [Shanghainese](/wiki/Shanghainese)) and [Yue](/wiki/Yue_Chinese) (68 million, e.g., [Cantonese](/wiki/Cantonese)). These groups are unintelligible to each other, and many of their subgroups are unintelligible with other subgroups within the same branch (e.g. [Northern Min](/wiki/Northern_Min) vs. [Southern Min](/wiki/Southern_Min)). There are, however, transitional areas where varieties from different branches share enough features for some limited intelligibility, including [New Xiang](/wiki/New_Xiang) with [Southwestern Mandarin](/wiki/Southwestern_Mandarin), [Xuanzhou Wu Chinese](/wiki/Xuanzhou_Wu_Chinese) with [Lower Yangtze Mandarin](/wiki/Lower_Yangtze_Mandarin), [Jin](/wiki/Jin_Chinese) with [Central Plains Mandarin](/wiki/Central_Plains_Mandarin) and certain divergent dialects of [Hakka](/wiki/Hakka_Chinese) with [Gan](/wiki/Gan_Chinese). All varieties of Chinese are [tonal](/wiki/Tone_(linguistics)) at least to some degree, and are largely [analytic](/wiki/Analytic_language). The Chinese language is [transcribed](/wiki/Transcription_(linguistics)) via a [writing system](/wiki/Writing_system) consisting of [logographic](/wiki/Logograph) [characters](/wiki/Chinese_character), historically in the [grammatical](/wiki/Grammatical) form of [Literary Chinese](/wiki/Literary_Chinese). The earliest attested [written Chinese](/wiki/Written_Chinese) consists of the [oracle bone inscriptions](/wiki/Oracle_bone_inscriptions) created during the [Shang dynasty](/wiki/Shang_dynasty) c. 1250 BCE. The phonetic categories of [Old Chinese](/wiki/Old_Chinese) can be reconstructed from the rhymes of ancient [Chinese poetry](/wiki/Chinese_poetry). During the [Northern and Southern dynasties](/wiki/Northern_and_Southern_dynasties), Middle Chinese went through several [sound changes](/wiki/Sound_change) and split into several varieties following prolonged geographic and political separation. The *[Qieyun](/wiki/Qieyun)*, a [rhyme dictionary](/wiki/Rhyme_dictionary), recorded a compromise between the pronunciations of different regions. The royal courts of the Ming and early [Qing dynasties](/wiki/Qing_dynasties) operated using a [koiné language](/wiki/Koin%C3%A9_language) known as *[Guanhua](/wiki/Mandarin_(late_imperial_lingua_franca))*, based on the [Nanjing dialect](/wiki/Nanjing_dialect) of Mandarin. [Standard Chinese](/wiki/Standard_Chinese), a [standard language](/wiki/Standard_language) based on the [Beijing dialect](/wiki/Beijing_dialect) and first officially adopted in the 1930s, is the current [official language](/wiki/Official_language) of both the [People's Republic of China](/wiki/People%27s_Republic_of_China) and the dissident [Republic of China](/wiki/Republic_of_China) (Taiwan), one of the [four official languages](/wiki/Languages_of_Singapore) of [Singapore](/wiki/Singapore), and one of the [six official languages](/wiki/Official_languages_of_the_United_Nations) of the [United Nations](/wiki/United_Nations). It is written primarily using modern [written vernacular Chinese](/wiki/Written_vernacular_Chinese), the [literacy](/wiki/Literacy) of which is shared by [educated](/wiki/Education_in_China) readers who may otherwise speak mutually unintelligible varieties. Since the 1950s, the use of [simplified Chinese characters](/wiki/Simplified_Chinese_characters) has been promoted by the [government of the People's Republic of China](/wiki/Government_of_the_People%27s_Republic_of_China), with the [government of Singapore](/wiki/Government_of_Singapore) officially adopting them in 1976. [Traditional Chinese characters](/wiki/Traditional_Chinese_characters) are still used in Taiwan, [Hong Kong](/wiki/Hong_Kong), [Macau](/wiki/Macau), areas of [Malaysia](/wiki/Malaysia) with significant ethnic Chinese populations (e.g. [Penang](/wiki/Penang), [Kuala Lumpur](/wiki/Kuala_Lumpur), [Ipoh](/wiki/Ipoh), [Kuching](/wiki/Kuching)) and among other overseas Chinese communities. Some ethnic minorities in [Central Asia](/wiki/Central_Asia) (e.g. the [Dungan people](/wiki/Dungan_people)) and the [Russian Far East](/wiki/Russian_Far_East) (e.g. the [Taz people](/wiki/Taz_people)) also speak varieties of Chinese but write in [cyrillized](/wiki/Cyrillization_of_Chinese) scripts. ## Classification Linguists classify all varieties of Chinese as part of the [Sino-Tibetan language family](/wiki/Sino-Tibetan_language_family), together with [Burmese](/wiki/Burmese_language), [Tibetan](/wiki/Tibetic_languages) and many other languages spoken in the [Himalayas](/wiki/Himalayas) and the [Southeast Asian Massif](/wiki/Southeast_Asian_Massif). Although the relationship was first proposed in the early 19th century and is now broadly accepted, reconstruction of Sino-Tibetan is much less developed than that of families such as [Indo-European](/wiki/Indo-European) or [Austroasiatic](/wiki/Austroasiatic). Difficulties have included the great diversity of the languages, the lack of [inflection](/wiki/Inflection) in many of them, and the effects of language contact. In addition, many of the smaller languages are spoken in mountainous areas that are difficult to reach and are often also sensitive border zones. Without a secure reconstruction of Proto-Sino-Tibetan, the higher-level structure of the family remains unclear. A top-level branching into Chinese and [Tibeto-Burman languages](/wiki/Tibeto-Burman_languages) is often assumed, but has not been convincingly demonstrated. ## History The first written records appeared over 3,000 years ago during the [Shang dynasty](/wiki/Shang_dynasty). As the language evolved over this period, the various local varieties became mutually unintelligible. In reaction, central governments have repeatedly sought to promulgate a unified standard. ### Old and Middle Chinese The earliest examples of Old Chinese are divinatory inscriptions on [oracle bones](/wiki/Oracle_bone) dated to c. 1250 BCE, during the [Late Shang](/wiki/Late_Shang). The next attested stage came from [inscriptions on bronze artifacts](/wiki/Chinese_bronze_inscriptions) dating to the [Western Zhou](/wiki/Western_Zhou) period (1046–771 BCE), the *[Classic of Poetry](/wiki/Classic_of_Poetry)* and portions of the *[Book of Documents](/wiki/Book_of_Documents)* and *[I Ching](/wiki/I_Ching)*. Scholars have attempted to reconstruct the [phonology of Old Chinese](/wiki/Phonology_of_Old_Chinese) by comparing later varieties of Chinese with the rhyming practice of the *Classic of Poetry* and the phonetic elements found in the majority of Chinese characters. Although many of the finer details remain unclear, most scholars agree that Old Chinese differs from Middle Chinese in lacking retroflex and palatal obstruents but having initial [consonant clusters](/wiki/Consonant_cluster) of some sort, and in having voiceless nasals and liquids. Most recent reconstructions also describe an atonal language with consonant clusters at the end of the syllable, developing into [tone](/wiki/Tone_(linguistics)) distinctions in Middle Chinese. Several [derivational affixes](/wiki/Derivational_affix) have also been identified, but the language lacks [inflection](/wiki/Inflection), and indicated grammatical relationships using word order and [grammatical particles](/wiki/Grammatical_particle). Middle Chinese was the language used during [Northern and Southern dynasties](/wiki/Northern_and_Southern_dynasties) and the [Sui](/wiki/Sui_dynasty), [Tang](/wiki/Tang_dynasty), and [Song](/wiki/Song_dynasty) dynasties (6th–10th centuries). It can be divided into an early period, reflected by the *[Qieyun](/wiki/Qieyun)* rhyme dictionary (601), and a late period in the 10th century, reflected by [rhyme tables](/wiki/Rhyme_table) such as the *[Yunjing](/wiki/Yunjing)* constructed by ancient Chinese philologists as a guide to the *Qieyun* system. These works define phonological categories but with little hint of what sounds they represent. Linguists have identified these sounds by comparing the categories with pronunciations in modern [varieties of Chinese](/wiki/Varieties_of_Chinese), [borrowed Chinese words](/wiki/Sino-Xenic_vocabularies) in Vietnamese, Korean, and Japanese, and transcription evidence. The resulting system is very complex, with a large number of consonants and vowels, but they are probably not all distinguished in any single dialect. Most linguists now believe it represents a [diasystem](/wiki/Diasystem) encompassing 6th-century northern and southern standards for reading the classics. ### Classical and vernacular written forms The complex relationship between spoken and written Chinese is an example of [diglossia](/wiki/Diglossia): as spoken, Chinese varieties have evolved at different rates, while the written language used throughout China changed comparatively little, crystallizing into a prestige form known as [Classical or Literary Chinese](/wiki/Classical_Chinese). Literature written distinctly in the Classical form began to emerge during the [Spring and Autumn period](/wiki/Spring_and_Autumn_period). Its use in writing remained nearly universal until the late 19th century, culminating with the widespread adoption of [written vernacular Chinese](/wiki/Written_vernacular_Chinese) with the [May Fourth Movement](/wiki/May_Fourth_Movement) beginning in 1919. ### Rise of northern dialects After the fall of the [Northern Song](/wiki/Northern_Song) dynasty and subsequent reign of the Jurchen [Jin](/wiki/Jin_dynasty_(1115%E2%80%931234)) and [Mongol](/wiki/Mongol) [Yuan](/wiki/Yuan_dynasty) dynasties in northern China, a common speech (now called [Old Mandarin](/wiki/Old_Mandarin)) developed based on the dialects of the [North China Plain](/wiki/North_China_Plain) around the capital. The 1324 *[Zhongyuan Yinyun](/wiki/Zhongyuan_Yinyun)* was a dictionary that codified the rhyming conventions of new *[sanqu](/wiki/Sanqu)* verse form in this language. Together with the slightly later *[Menggu Ziyun](/wiki/Menggu_Ziyun)*, this dictionary describes a language with many of the features characteristic of modern Mandarin dialects. Until the early 20th century, most Chinese people only spoke their local language. Thus, as a practical measure, officials of the [Ming](/wiki/Ming) and [Qing](/wiki/Qing) dynasties carried out the administration of the empire using a [common language based on Mandarin varieties](/wiki/Mandarin_(late_imperial_lingua_franca)), known as 官话; 官話; *Guānhuà*; 'language of officials'. For most of this period, this language was a [koiné](/wiki/Koin%C3%A9) based on dialects spoken in the [Nanjing](/wiki/Nanjing) area, though not identical to any single dialect. By the middle of the 19th century, the Beijing dialect had become dominant and was essential for any business with the imperial court. In the 1930s, a [standard national language](/wiki/Standard_Chinese) (国语; 國語; *Guóyǔ*), was adopted. After much dispute between proponents of northern and southern languages and an abortive attempt at an artificial pronunciation, the [National Language Unification Commission](/wiki/National_Languages_Committee) finally settled on the Beijing dialect in 1932. The People's Republic founded in 1949 retained this standard but renamed it 普通话; 普通話; *pǔtōnghuà*; 'common speech'. The national language is now used in education, the media, and formal situations in both mainland China and Taiwan. In [Hong Kong](/wiki/Hong_Kong) and [Macau](/wiki/Macau), Cantonese is the dominant spoken language due to cultural influence from Guangdong immigrants and colonial-era policies, and is used in education, media, formal speech, and everyday life—though Mandarin is increasingly taught in schools due to the mainland's growing influence. ### Influence Historically, the Chinese languages spread to neighbors through a variety of means. Northern Vietnam was incorporated into the [Han dynasty](/wiki/Han_dynasty) in 111 BCE, marking the beginning of a [period of Chinese control](/wiki/Chinese_domination_of_Vietnam) that ran almost continuously for a millennium. The [Four Commanderies of Han](/wiki/Four_Commanderies_of_Han) were established in northern Korea in the 1st century BCE but disintegrated in the following centuries. [Chinese Buddhism](/wiki/Chinese_Buddhism) spread over East Asia between the 2nd and 5th centuries CE, and with it the study of scriptures and literature in Literary Chinese. Later, strong central governments modeled on Chinese institutions were established in Korea, Japan, and Vietnam, with Literary Chinese serving as the language of administration and scholarship, a position it would retain until the late 19th century in Korea and (to a lesser extent) Japan, and the early 20th century in Vietnam. Scholars from different lands could communicate, albeit only in writing, using Literary Chinese. Although they used Chinese solely for written communication, each country had its own tradition of reading texts aloud using what are known as [Sino-Xenic pronunciations](/wiki/Sino-Xenic_pronunciations). Chinese words with these pronunciations were also extensively imported into the [Korean](/wiki/Korean_language), [Japanese](/wiki/Japanese_language), and [Vietnamese](/wiki/Vietnamese_language) languages. Today, [Sino-Korean](/wiki/Sino-Korean_vocabulary), [Sino-Japanese](/wiki/Sino-Japanese_vocabulary), and [Sino-Vietnamese vocabularies](/wiki/Sino-Vietnamese_vocabulary) comprise over half of their respective lexicons. This massive influx led to changes in the phonological structure of the languages, contributing to the development of [moraic](/wiki/Moraic) structure in Japanese and the disruption of [vowel harmony](/wiki/Vowel_harmony) in Korean. Borrowed Chinese morphemes have been used extensively in all these languages to coin compound words for new concepts, in a similar way to the use of [Latin](/wiki/Latin) and [Ancient Greek](/wiki/Ancient_Greek) roots in European languages. Many new compounds, or new meanings for old phrases, were created in the late 19th and early 20th centuries to name Western concepts and artifacts. These coinages, written in shared Chinese characters, have then been borrowed freely between languages. They have even been accepted into Chinese, a language usually resistant to loanwords, because their foreign origin was hidden by their written form. Often different compounds for the same concept were in circulation for some time before a winner emerged, and sometimes the final choice differed between countries. The proportion of vocabulary of Chinese origin thus tends to be greater in technical, abstract, or formal language. For example, in Japan, [Sino-Japanese words](/wiki/Sino-Japanese_words) account for about 35% of the words in entertainment magazines, over half the words in newspapers, and 60% of the words in science magazines. Vietnam, Korea, and Japan each developed writing systems for their own languages, initially based on [Chinese characters](/wiki/Chinese_characters), but later replaced with the *[hangul](/wiki/Hangul)* alphabet for Korean and supplemented with *[kana](/wiki/Kana)* syllabaries for Japanese, while Vietnamese continued to be written with the complex *[chữ Nôm](/wiki/Ch%E1%BB%AF_N%C3%B4m)* script. However, these were limited to popular literature until the late 19th century. Today Japanese is written with a composite script using both Chinese characters called [kanji](/wiki/Kanji), and kana. Korean is written exclusively with hangul in North Korea, although knowledge of the supplementary Chinese characters called [hanja](/wiki/Hanja) is still required, and hanja are increasingly rarely used in South Korea. As a result of its historical colonization by France, Vietnamese now uses the Latin-based [Vietnamese alphabet](/wiki/Vietnamese_alphabet). [English words of Chinese origin](/wiki/List_of_English_words_of_Chinese_origin) include *tea* from [Hokkien](/wiki/Hokkien) 茶 (*tê*), *[dim sum](/wiki/Dim_sum)* from Cantonese 點心 (*dim2 sam1*), and *[kumquat](/wiki/Kumquat)* from Cantonese 金橘 (*gam1 gwat1*). ## Varieties The sinologist [Jerry Norman](/wiki/Jerry_Norman_(sinologist)) has estimated that there are hundreds of mutually unintelligible varieties of Chinese. These varieties form a [dialect continuum](/wiki/Dialect_continuum), in which differences in speech generally become more pronounced as distances increase, though the rate of change varies immensely. Generally, mountainous South China exhibits more linguistic diversity than the [North China Plain](/wiki/North_China_Plain). Until the late 20th century, Chinese emigrants to Southeast Asia and North America came from southeast coastal areas, where Min, Hakka, and Yue dialects were spoken. Specifically, most Chinese immigrants to North America until the mid-20th century spoke [Taishanese](/wiki/Taishanese), a variety of Yue from a small coastal area around [Taishan, Guangdong](/wiki/Taishan,_Guangdong). In parts of South China, the dialect of a major city may be only marginally intelligible to its neighbors. For example, [Wuzhou](/wiki/Wuzhou) and Taishan are located approximately 260 km (160 mi) and 190 km (120 mi) away from [Guangzhou](/wiki/Guangzhou) respectively, but the Yue variety spoken in Wuzhou is more similar to the Guangzhou dialect than is Taishanese. Wuzhou is located directly upstream from Guangzhou on the [Pearl River](/wiki/Pearl_River), whereas Taishan is to Guangzhou's southwest, with the two cities separated by several river valleys. In parts of [Fujian](/wiki/Fujian), the speech of some neighbouring counties or villages is mutually unintelligible. ### Grouping Local varieties of Chinese are conventionally classified into seven dialect groups, largely based on the different evolution of [Middle Chinese](/wiki/Middle_Chinese) voiced initials: - [Mandarin](/wiki/Mandarin_Chinese), including [Standard Chinese](/wiki/Standard_Chinese), the [Beijing dialect](/wiki/Beijing_dialect), [Sichuanese](/wiki/Sichuanese_Mandarin), and also the [Dungan language](/wiki/Dungan_language) spoken in [Central Asia](/wiki/Central_Asia) - [Wu](/wiki/Wu_Chinese), including [Shanghainese](/wiki/Shanghainese), [Suzhounese](/wiki/Suzhounese), and [Wenzhounese](/wiki/Wenzhounese) - [Gan](/wiki/Gan_Chinese) - [Xiang](/wiki/Xiang_Chinese) - [Min](/wiki/Min_Chinese), including [Fuzhounese](/wiki/Fuzhounese), [Hainanese](/wiki/Hainanese), [Hokkien](/wiki/Hokkien) and [Teochew](/wiki/Teochew_dialect) - [Hakka](/wiki/Hakka_Chinese) - [Yue](/wiki/Yue_Chinese), including Cantonese and [Taishanese](/wiki/Taishanese) The classification of [Li Rong](/wiki/Li_Rong_(linguist)), which is used in the *[Language Atlas of China](/wiki/Language_Atlas_of_China)* (1987), distinguishes three further groups: - [Jin](/wiki/Jin_Chinese), previously included in Mandarin. - [Huizhou](/wiki/Huizhou_Chinese), previously included in Wu. - [Pinghua](/wiki/Pinghua), previously included in Yue. Some varieties remain unclassified, including the [Danzhou dialect](/wiki/Danzhou_dialect) on [Hainan](/wiki/Hainan), [Waxianghua](/wiki/Waxianghua) spoken in western [Hunan](/wiki/Hunan), and [Shaozhou Tuhua](/wiki/Shaozhou_Tuhua) spoken in northern [Guangdong](/wiki/Guangdong). ### Standard Chinese Standard Chinese is the [standard language](/wiki/Standard_language) of China (where it is called 普通话; *pǔtōnghuà*) and Taiwan, and one of the four official languages of Singapore (where it is called either 华语; 華語; *Huáyǔ* or 汉语; 漢語; *Hànyǔ*). Standard Chinese is based on the Beijing dialect of Mandarin. The governments of both China and Taiwan intend for speakers of all Chinese speech varieties to use it as a common language of communication. Therefore, it is used in government agencies, in the media, and as a language of instruction in schools. [Diglossia](/wiki/Diglossia) is common among Chinese speakers. For example, a Shanghai resident may speak both Standard Chinese and [Shanghainese](/wiki/Shanghainese); if they grew up elsewhere, they are also likely fluent in the dialect of their home region. In addition to Standard Chinese, a majority of [Taiwanese people](/wiki/Taiwanese_people) also speak [Taiwanese Hokkien](/wiki/Taiwanese_Hokkien) (also called 台語; 'Taiwanese'), [Hakka](/wiki/Hakka_language), or an [Austronesian language](/wiki/Austronesian_language). A speaker in Taiwan may mix pronunciations and vocabulary from Standard Chinese and other [languages of Taiwan](/wiki/Languages_of_Taiwan) in everyday speech. In part due to traditional cultural ties with [Guangdong](/wiki/Guangdong), Cantonese is used as an everyday language in [Hong Kong](/wiki/Hong_Kong) and [Macau](/wiki/Macau). ### Nomenclature The designation of various Chinese branches remains controversial. Some linguists and most ordinary Chinese people consider all the spoken varieties as one single language, as speakers share a common national identity and a common written form. Others instead argue that it is inappropriate to refer to major branches of Chinese such as Mandarin, Wu, and so on as \"dialects\" because the mutual unintelligibility between them is too great. However, calling major Chinese branches \"languages\" would also be wrong under the same criterion, since a branch such as Wu, itself contains many mutually unintelligible varieties, and could not be properly called a single language. There are also viewpoints pointing out that linguists often ignore mutual intelligibility when varieties share intelligibility with a central variety (i.e. prestige variety, such as Standard Mandarin), as the issue requires some careful handling when mutual intelligibility is inconsistent with language identity. The Chinese government's official Chinese designation for the major branches of Chinese is 方言; *fāngyán*; 'regional speech', whereas the more closely related varieties within these are called 地点方言; 地點方言; *dìdiǎn fāngyán*; 'local speech'. Because of the difficulties involved in determining the difference between language and dialect, other terms have been proposed. These include *topolect*, *[lect](/wiki/Lect)*, *[vernacular](/wiki/Vernacular)*, *[regional](/wiki/Regional_language)*, and *[variety](/wiki/Language_variety)*. ## Phonology Syllables in the Chinese languages have some unique characteristics. They are tightly related to the [morphology](/wiki/Morphology_(linguistics)) and also to the characters of the writing system, and [phonologically](/wiki/Phonologically) they are structured according to fixed rules. The structure of each syllable consists of a [nucleus](/wiki/Syllable_nucleus) that has a [vowel](/wiki/Vowel) (which can be a [monophthong](/wiki/Monophthong), [diphthong](/wiki/Diphthong), or even a [triphthong](/wiki/Triphthong) in certain varieties), preceded by an [onset](/wiki/Syllable_onset) (a single [consonant](/wiki/Consonant), or consonant + [glide](/wiki/Semivowel); a zero onset is also possible), and followed (optionally) by a [coda](/wiki/Syllable_coda) consonant; a syllable also carries a [tone](/wiki/Tone_(linguistics)). There are some instances where a vowel is not used as a nucleus. An example of this is in Cantonese, where the nasal sonorant consonants /m/ and /ŋ/ can stand alone as their own syllable. In Mandarin much more than in other spoken varieties, most syllables tend to be open syllables, meaning they have no coda (assuming that a final glide is not analyzed as a coda), but syllables that do have codas are restricted to nasals /m/, /n/, /ŋ/, the retroflex approximant /ɻ/, and voiceless stops /p/, /t/, /k/, or /ʔ/. Some varieties allow most of these codas, whereas others, such as Standard Chinese, are limited to only /n/, /ŋ/, and /ɻ/. The number of sounds in the different spoken dialects varies, but in general, there has been a tendency to a reduction in sounds from Middle Chinese. The Mandarin dialects in particular have experienced a dramatic decrease in sounds and so have far more polysyllabic words than most other spoken varieties. The total number of syllables in some varieties is therefore only about a thousand, including tonal variation, which is only about an eighth as many as English.[h] ### Tones All varieties of spoken Chinese use tones to distinguish words. A few dialects of north China may have as few as three tones, while some dialects in south China have up to 6 or 12 tones, depending on how one counts. One exception from this is Shanghainese which has reduced the set of tones to a two-toned [pitch accent](/wiki/Pitch_accent) system much like modern Japanese. A very common example used to illustrate the use of tones in Chinese is the application of the four tones of Standard Chinese, along with the neutral tone, to the syllable *ma*. The tones are exemplified by the following five Chinese words: Examples of Standard Chinese tones ToneCharacterGlossPinyin[Chao tone](/wiki/Chao_tone)Pitch contour1妈; 媽'mother'*mā*˥high, level2麻'hemp'*má*˧˥high, rising3马; 馬'horse'*mǎ*˨˩˦low falling, then rising4骂; 罵'scold'*mà*˥˩high falling[Neutral](/wiki/Neutral_tone)吗; 嗎INTR.PTC*ma**varies**varies* In contrast, Standard Cantonese has six tones. Historically, finals that end in a [stop consonant](/wiki/Stop_consonant) were considered to be \"[checked tones](/wiki/Checked_tone)\" and thus counted separately for a total of nine tones. However, they are considered to be duplicates in modern linguistics and are no longer counted as such: Examples of Standard Cantonese tones ToneCharacterGloss[Jyutping](/wiki/Jyutping)[Yale](/wiki/Yale_romanization_of_Cantonese)[Chao tone](/wiki/Chao_tone)Pitch contour1诗; 詩'poem'*si1**sī*˥ - high, level - high, falling 2史'history'*si2**sí*˧˥high, rising3弒'assassinate'*si3**si*˧mid, level4时; 時'time'*si4**sìh*˨˩low, falling5市'market'*si5**síh*˨˧low, rising6是'yes'*si6**sih*˨low, level ## Grammar Chinese is often described as a 'monosyllabic' language. However, this is only partially correct. It is largely accurate when describing Old and Middle Chinese; in Classical Chinese, around 90% of words consist of a single character that corresponds one-to-one with a *[morpheme](/wiki/Morpheme)*, the smallest unit of meaning in a language. In modern varieties, it usually remains the case that morphemes are monosyllabic—in contrast, English has many multi-syllable morphemes, both [bound and free](/wiki/Bound_and_free_morphemes), such as 'seven', 'elephant', 'para-' and '-able'. Some of the more conservative modern varieties, usually found in the south, have largely monosyllabic *[words](/wiki/Words)*, especially with basic vocabulary. However, most nouns, adjectives, and verbs in modern Mandarin are disyllabic. A significant cause of this is [phonetic erosion](/wiki/Phonetic_erosion): sound changes over time have steadily reduced the number of possible syllables in the language's inventory. In modern Mandarin, there are only around 1,200 possible syllables, including the tonal distinctions, compared with about 5,000 in Vietnamese (still a largely monosyllabic language), and over 8,000 in English.[h] Most modern varieties tend to form new words through polysyllabic [compounds](/wiki/Compound_word). In some cases, monosyllabic words have become disyllabic formed from different characters without the use of compounding, as in 窟窿; *kūlong* from 孔; *kǒng*; this is especially common in Jin varieties. This phonological collapse has led to a corresponding increase in the number of [homophones](/wiki/Homophone). As an example, the small *Langenscheidt Pocket Chinese Dictionary* lists six words that are commonly pronounced as *shí* in Standard Chinese: CharacterGlossMC[i]Cantonese十'ten'*dzyip**sap6*实; 實'actual'*zyit**sat6*识; 識'recognize'*dzyek**sik1*石'stone'*dzyi**sek6*时; 時'time'*dzyi**si4*食'food'*zyik**sik6* In modern spoken Mandarin, however, tremendous ambiguity would result if all of these words could be used as-is. The 20th century [Yuen Ren Chao](/wiki/Yuen_Ren_Chao) poem *[Lion-Eating Poet in the Stone Den](/wiki/Lion-Eating_Poet_in_the_Stone_Den)* exploits this, consisting of 92 characters all pronounced *shi*. As such, most of these words have been replaced in speech, if not in writing, with less ambiguous disyllabic compounds. Only the first one, 十, normally appears in monosyllabic form in spoken Mandarin; the rest are normally used in the polysyllabic forms of WordPinyinGloss实际; 實際*shíjì*'actual-connection'认识; 認識*rènshi*'recognize-know'石头; 石頭*shítou*'stone-head'时间; 時間*shíjiān*'time-interval'食物*shíwù*'foodstuff' respectively. In each, the homophone was disambiguated by the addition of another morpheme, typically either a near-synonym or some sort of generic word (e.g., 'head', 'thing'), the purpose of which is to indicate which of the possible meanings of the other, homophonic syllable is specifically meant. However, when one of the above words forms part of a compound, the disambiguating syllable is generally dropped and the resulting word is still disyllabic. For example, 石; *shí* alone, and not 石头; 石頭; *shítou*, appears in compounds as meaning 'stone' such as 石膏; *shígāo*; 'plaster', 石灰; *shíhuī*; 'lime', 石窟; *shíkū*; 'grotto', 石英; *shíyīng*; 'quartz', and 石油; *shíyóu*; 'petroleum'. Although many single-syllable morphemes (字; *zì*) can stand alone as individual words, they more often than not form multi-syllable compounds known as 词; 詞; *cí*, which more closely resembles the traditional Western notion of a word. A Chinese *cí* can consist of more than one character–morpheme, usually two, but there can be three or more. Examples of Chinese words of more than two syllables include 汉堡包; 漢堡包; *hànbǎobāo*; 'hamburger', 守门员; 守門員; *shǒuményuán*; 'goalkeeper', and 电子邮件; 電子郵件; *diànzǐyóujiàn*; 'e-mail'. All varieties of modern Chinese are [analytic languages](/wiki/Analytic_language): they depend on [syntax](/wiki/Syntax) (word order and sentence structure), rather than [inflectional morphology](/wiki/Inflectional_morphology) (changes in the form of a word), to indicate a word's function within a sentence. In other words, Chinese has very few [grammatical inflections](/wiki/Grammatical_inflection)—it possesses no [tenses](/wiki/Tenses), no [voices](/wiki/Grammatical_voice), no [grammatical number](/wiki/Grammatical_number),[j] and only a few [articles](/wiki/Article_(grammar)).[k] They make heavy use of [grammatical particles](/wiki/Grammatical_particle) to indicate [aspect](/wiki/Grammatical_aspect) and [mood](/wiki/Grammatical_mood). In Mandarin, this involves the use of particles such as 了; *le*; 'PFV', 还; 還; *hái*; 'still', and 已经; 已經; *yǐjīng*; 'already'. Chinese has a [subject–verb–object word order](/wiki/Subject%E2%80%93verb%E2%80%93object_word_order), and, like many other languages of East Asia, makes frequent use of the [topic–comment](/wiki/Topic%E2%80%93comment) construction to form sentences. Chinese also has an extensive system of [classifiers](/wiki/Classifier_(linguistics)) and [measure words](/wiki/Measure_word), another trait shared with neighboring languages such as Japanese and Korean. Other notable grammatical features common to all the spoken varieties of Chinese include the use of [serial verb construction](/wiki/Serial_verb_construction), [pronoun dropping](/wiki/Pro-drop_language), and the related [subject dropping](/wiki/Null_subject_language). Although the grammars of the spoken varieties share many traits, they do possess differences. ## Vocabulary The entire Chinese character corpus since antiquity comprises well over 50,000 characters, of which only roughly 10,000 are in use and only about 3,000 are frequently used in Chinese media and newspapers. However, Chinese characters should not be confused with Chinese words. Because most Chinese words are made up of two or more characters, there are many more Chinese words than characters. A more accurate equivalent for a Chinese character is the morpheme, as characters represent the smallest grammatical units with individual meanings in the Chinese language. Estimates of the total number of Chinese words and lexicalized phrases vary greatly. The *[Hanyu Da Zidian](/wiki/Hanyu_Da_Zidian)*, a compendium of Chinese characters, includes 54,678 head entries for characters, including oracle bone versions. The *[Zhonghua Zihai](/wiki/Zhonghua_Zihai)* (1994) contains 85,568 head entries for character definitions and is the largest reference work based purely on character and its literary variants. The [CC-CEDICT](/wiki/CC-CEDICT) project (2010) contains 97,404 contemporary entries including idioms, technology terms, and names of political figures, businesses, and products. The 2009 version of the Webster's Digital Chinese Dictionary (WDCD), based on CC-CEDICT, contains over 84,000 entries. The most comprehensive pure linguistic Chinese-language dictionary, the 12-volume *[Hanyu Da Cidian](/wiki/Hanyu_Da_Cidian)*, records more than 23,000 head Chinese characters and gives over 370,000 definitions. The 1999 revised *[Cihai](/wiki/Cihai)*, a multi-volume encyclopedic dictionary reference work, gives 122,836 vocabulary entry definitions under 19,485 Chinese characters, including proper names, phrases, and common zoological, geographical, sociological, scientific, and technical terms. The 2016 edition of *[Xiandai Hanyu Cidian](/wiki/Xiandai_Hanyu_Cidian)*, an authoritative one-volume dictionary on modern standard Chinese language as used in mainland China, has 13,000 head characters and defines 70,000 words. ### Loanwords Like many other languages, Chinese has absorbed a sizable number of [loanwords](/wiki/Loanword) from other cultures. Most Chinese words are formed out of native Chinese morphemes, including words describing imported objects and ideas. However, direct phonetic borrowing of foreign words has gone on since ancient times. Some early Indo-European loanwords in Chinese have been proposed, notably 'honey' (蜜; *mì*), 'lion' (狮; 獅; *shī*), and perhaps 'horse' (马; 馬; *mǎ*), 'pig' (猪; 豬; *zhū*), 'dog' (犬; *quǎn*), and 'goose' (鹅; 鵝; *é*). Ancient words borrowed from along the [Silk Road](/wiki/Silk_Road) during the Old Chinese period include 'grape' (葡萄; *pútáo*), 'pomegranate' (石榴; *shíliú*), and 'lion' (狮子; 獅子; *shīzi*). Some words were borrowed from Buddhist scriptures, including 'Buddha' (佛; *Fó*) and 'bodhisattva' (菩萨; 菩薩; *Púsà*). Other words came from nomadic peoples to the north, such as '[hutong](/wiki/Hutong)' (胡同). Words borrowed from the peoples along the Silk Road, such as 'grape' (葡萄), generally have Persian etymologies. Buddhist terminology is generally derived from [Sanskrit](/wiki/Sanskrit) or [Pali](/wiki/Pali), the liturgical languages of northern India. Words borrowed from the nomadic tribes of the [Gobi](/wiki/Gobi), Mongolian or northeast regions generally have [Altaic](/wiki/Altaic) etymologies, such as 琵琶 (*pípá*), the Chinese lute, or 'cheese or yogurt' (酪; *lào*), but from exactly which source is not always clear. ### Modern borrowings Modern neologisms are primarily translated into Chinese in one of three ways: free translation ([calques](/wiki/Calque)), phonetic translation (by sound), or [a combination of the two](/wiki/Phono-semantic_matching). Today, it is much more common to use existing Chinese morphemes to coin new words to represent imported concepts, such as technical expressions and [international scientific vocabulary](/wiki/International_scientific_vocabulary), wherein the Latin and Greek components are usually converted one-for-one into the corresponding Chinese characters. For example the word 'telephone' was initially loaned phonetically as 德律风; 德律風 (*délǜfēng*; Shanghainese *télífon* [təlɪfoŋ])—this word was widely used in Shanghai during the 1920s, but the later 电话; 電話 (*diànhuà*; 'electric speech'), built out of native Chinese morphemes became prevalent. Occasionally, compromises between the transliteration and translation approaches become accepted. Sometimes translations are designed so that they sound like the original while incorporating Chinese morphemes ([phono-semantic matching](/wiki/Phono-semantic_matching)). This is often done for commercial purposes, for example 奔腾; 奔騰 (*bēnténg*; 'dashing-leaping') for '[Pentium](/wiki/Pentium)' and 赛百味; 賽百味 (*Sàibǎiwèi*; 'better-than hundred tastes') for '[Subway](/wiki/Subway_(restaurant))'. Foreign words, mainly [proper nouns](/wiki/Proper_noun), continue to enter the Chinese language by transcription according to their pronunciations. This is done by employing Chinese characters with similar pronunciations. For example, 'Israel' becomes 以色列 (*Yǐsèliè*), and 'Paris' becomes 巴黎 (*Bālí*). A rather small number of direct transliterations have survived as common words. The bulk of these words were originally coined in Shanghai during the early 20th century and later loaned from there into Mandarin, hence their Mandarin pronunciations occasionally being quite divergent from the English. Western foreign words representing Western concepts have influenced Chinese since the 20th century through transcription. The influence of English is particularly pronounced: from the early 20th century, many English words were borrowed into Shanghainese. Later, American [soft power](/wiki/Soft_power) gave rise to borrowings related to its own culture. With the rising popularity of the Internet, there is a current vogue in China for coining English transliterations, for example, 粉丝; 粉絲 (*fěnsī*; 'fans'), 黑客 (*hēikè*; 'hacker'), and 博客 (*bókè*; 'blog'). In Taiwan ([Taiwanese Hokkien](/wiki/Taiwanese_Hokkien) or [Taiwanese Mandarin](/wiki/Taiwanese_Mandarin)) and Hong Kong ([Cantonese](/wiki/Cantonese)), some of these transliterations are different. Another result of English influence on Chinese is the appearance of so-called 字母词; 字母詞 (*zìmǔcí*; 'lettered words') spelled with letters from the English alphabet. These have appeared in colloquial usage, as well as in magazines and newspapers, and on websites and television. Since the 20th century, another source of words has been kanji: Japan re-molded European concepts and inventions into 和製漢語, *[wasei-kango](/wiki/Wasei-kango)*, 'Japanese-made Chinese', and many of these words have been re-loaned into modern Chinese. Other terms were coined by the Japanese by giving new senses to existing Chinese terms or by referring to expressions used in classical Chinese literature. For example, 经济; 經濟; *jīngjì*; 経済, *keizai* in Japanese, which in the original Chinese meant 'the workings of the state', narrowed to 'economy' in Japanese; this narrowed definition was then re-imported into Chinese. As a result, these terms are virtually indistinguishable from native Chinese words: indeed, there is some dispute over some of these terms as to whether the Japanese or Chinese coined them first. As a result of this loaning, Chinese, Korean, Japanese, and Vietnamese share a corpus of linguistic terms describing modern terminology, paralleling the similar corpus of terms built from Greco-Latin and shared among European languages. ## Writing system The Chinese [orthography](/wiki/Orthography) centers on [Chinese characters](/wiki/Chinese_characters), which are written within imaginary square blocks, traditionally arranged in vertical columns, read from top to bottom down a column, and right to left across columns, despite alternative arrangement with rows of characters from left to right within a row and from top to bottom across rows (like English and other Western writing systems) having become more popular since the 20th century. Chinese characters denote [morphemes](/wiki/Morpheme) independent of phonetic variation in different languages. Thus the character 一 ('one') is pronounced as *yī* in Standard Chinese, *yat1* in Cantonese and *it* in Hokkien, a form of Min. Most modern written Chinese is in the form of [written vernacular Chinese](/wiki/Written_vernacular_Chinese), based on spoken Standard Chinese, regardless of dialectical background. Written vernacular Chinese largely replaced Literary Chinese in the early 20th century as the country's standard written language. However, vocabularies from different Chinese-speaking areas have diverged, and the divergence can be observed in written Chinese.[*better source needed*] Due to the divergence of variants, some unique morphemes are not found in Standard Chinese. Characters rarely used in Standard Chinese have also been created or inherited from archaic literary standards to represent these unique morphemes. For example, characters like 冇 and 係 are actively used in Cantonese and Hakka, while being archaic or unused in standard written Chinese. The most prominent example of a non-Standard Chinese orthography is [Written Cantonese](/wiki/Written_Cantonese), which is used in tabloids and on the internet among Cantonese speakers in Hong Kong and elsewhere.[*better source needed*] Chinese had no uniform system of phonetic transcription until the mid-20th century, although enunciation patterns were recorded in early [rhyme dictionaries](/wiki/Rhyme_dictionaries) and dictionaries. Early Indian translators, working in [Sanskrit](/wiki/Sanskrit) and [Pali](/wiki/Pali), were the first to attempt to describe the sounds and enunciation patterns of Chinese in a foreign language. After the 15th century, the efforts of Jesuits and Western court missionaries resulted in some Latin character transcription/writing systems, based on various variants of Chinese languages. Some of these Latin character-based systems are still being used to write various Chinese variants in the modern era. In [Hunan](/wiki/Hunan), women in certain areas write their local Chinese language variant in [Nüshu](/wiki/N%C3%BCshu), a [syllabary](/wiki/Syllabary) derived from Chinese characters. The [Dungan language](/wiki/Dungan_language), considered by many a dialect of Mandarin, is nowadays written in [Cyrillic](/wiki/Cyrillic) and was previously written in the [Arabic script](/wiki/Arabic_script). The [Dungan people](/wiki/Dungan_people) are primarily Muslim and live mainly in Kazakhstan, Kyrgyzstan, and Russia; many [Hui people](/wiki/Hui_people), living mainly in China, also speak the language. ### Chinese characters Each Chinese character represents a monosyllabic Chinese word or morpheme. In 100 CE, the famed Han dynasty scholar [Xu Shen](/wiki/Xu_Shen) classified characters into six categories: [pictographs](/wiki/Pictograph), simple [ideographs](/wiki/Ideograph), compound ideographs, phonetic loans, phonetic compounds, and derivative characters. Only 4% were categorized as pictographs, including many of the simplest characters, such as 人 (*rén*; 'human'), 日 (*rì*; 'Sun'), 山 (*shān*; 'mountain'), and 水 (*shuǐ*; 'water'). Between 80% and 90% were classified as phonetic compounds such as 沖 (*chōng*; 'pour'), combining a phonetic component 中 (*zhōng*) with a semantic component of the [radical](/wiki/Radical_(Chinese_character)) 氵, a reduced form of 水; 'water'. Almost all characters created since have been made using this format. The 18th-century *[Kangxi Dictionary](/wiki/Kangxi_Dictionary)* classified characters under a now-common set of 214 radicals. Modern characters are styled after the [regular script](/wiki/Regular_script). Various other written styles are also used in [Chinese calligraphy](/wiki/Chinese_calligraphy), including [seal script](/wiki/Seal_script), [cursive script](/wiki/Cursive_script_(East_Asia)) and [clerical script](/wiki/Clerical_script). Calligraphy artists can write in Traditional and Simplified characters, but they tend to use Traditional characters for traditional art. There are currently two systems for Chinese characters. [Traditional characters](/wiki/Traditional_characters), used in Hong Kong, Taiwan, Macau, and many overseas Chinese-speaking communities, largely take their form from received character forms dating back to the late Han dynasty and standardized during the Ming. [Simplified characters](/wiki/Simplified_characters), introduced by the People's Republic of China (PRC) in 1954 to promote mass literacy, simplifies most complex traditional [glyphs](/wiki/Glyph) to fewer strokes, especially by adopting common cursive [shorthand](/wiki/Shorthand) variants and merging characters with similar pronunciations to the one with the least strokes, among other methods. Singapore, which has a large Chinese community, was the second nation to officially adopt simplified characters—first by [creating its own simplified characters](/wiki/Singapore_Chinese_characters), then by adopting entirely the PRC simplified characters. It has also become the de facto standard for younger ethnic Chinese in Malaysia. The Internet provides practice reading each of these systems, and most Chinese readers are capable of, if not necessarily comfortable with, reading the alternative system through experience and guesswork. A well-educated Chinese reader today recognizes approximately 4,000 to 6,000 characters; approximately 3,000 characters are required to read a [mainland newspaper](/wiki/Newspapers_of_the_People%27s_Republic_of_China). The PRC defines literacy amongst workers as a knowledge of 2,000 characters, though this would be only functional literacy. School children typically learn around 2,000 characters whereas scholars may memorize up to 10,000. A large unabridged dictionary like the *Kangxi* dictionary, contains over 40,000 characters, including obscure, variant, rare, and archaic characters; fewer than a quarter of these characters are now commonly used. ### Romanization [Romanization](/wiki/Romanization) is the process of transcribing a language into the [Latin script](/wiki/Latin_script). There are many systems of romanization for the Chinese varieties, due to the lack of a native phonetic transcription until modern times. Chinese is first known to have been written in Latin characters by Western [Christian missionaries](/wiki/Christianity_in_China) in the 16th century. Today the most common romanization for Standard Chinese is [Hanyu Pinyin](/wiki/Hanyu_Pinyin), introduced in 1956 by the PRC, and later adopted by Singapore and Taiwan. Pinyin is almost universally employed now for teaching standard spoken Chinese in schools and universities across the Americas, Australia, and Europe. Chinese parents also use Pinyin to teach their children the sounds and tones of new words. In school books that teach Chinese, the pinyin romanization is often shown below a picture of the thing the word represents, with the Chinese character alongside. The second-most common romanization system, the [Wade–Giles](/wiki/Wade%E2%80%93Giles), was invented by Thomas Wade in 1859 and modified by Herbert Giles in 1892. As this system approximates the phonology of Mandarin Chinese into English consonants and vowels–it is largely an [anglicization](/wiki/Anglicization), it may be particularly helpful for beginner Chinese speakers of an English-speaking background. Wade–Giles was found in academic use in the United States, particularly before the 1980s, and was widely used in Taiwan until 2009. When used within European texts, the tone transcriptions in both pinyin and Wade–Giles are often left out for simplicity; Wade–Giles's extensive use of apostrophes is also usually omitted. Thus, most Western readers will be much more familiar with *Beijing* than they will be with *Běijīng* (pinyin), and with *Taipei* than *T'ai2-pei3* (Wade–Giles). This simplification presents syllables as homophones which are not, and therefore exaggerates the number of homophones almost by a factor of four. For comparison: Comparison of Mandarin romanizations CharactersWade–GilesPinyinMeaning中国; 中國*Chung1-kuo2**Zhōngguó*[China](/wiki/China)台湾; 臺灣*T'ai2-wan1**Táiwān*[Taiwan](/wiki/Taiwan)北京*Pei3-ching1**Běijīng*[Beijing](/wiki/Beijing)台北; 臺北*T'ai2-pei3**Táiběi*[Taipei](/wiki/Taipei)孙中山; 孫中山*Sun1 Chung1-shan1**Sūn Zhōngshān*[Sun Yat-sen](/wiki/Sun_Yat-sen)毛泽东; 毛澤東*Mao2 Tse2-tung1**Máo Zédōng*[Mao Zedong](/wiki/Mao_Zedong)蒋介石; 蔣介石*Chiang3 Chieh4-shih2**Jiǎng Jièshí*[Chiang Kai-shek](/wiki/Chiang_Kai-shek)孔子*K'ung3 Tsu3**Kǒngzǐ*[Confucius](/wiki/Confucius) Other systems include [Gwoyeu Romatzyh](/wiki/Gwoyeu_Romatzyh), the French [EFEO](/wiki/EFEO_Chinese_transcription), the [Yale system](/wiki/Yale_romanization_of_Mandarin) (invented for use by US troops during World War II), as well as distinct systems for the phonetic requirements of Cantonese, Min Nan, Hakka, and other varieties. ### Other phonetic transcriptions Chinese varieties have been phonetically transcribed into many other writing systems over the centuries. The ['Phags-pa script](/wiki/%27Phags-pa_script), for example, has been very helpful in reconstructing the pronunciations of premodern forms of Chinese. [Bopomofo](/wiki/Bopomofo) (or *zhuyin*) is a [semi-syllabary](/wiki/Semi-syllabary) that is still widely used in Taiwan to aid standard pronunciation. There are also at least two systems of [cyrillization](/wiki/Cyrillization) for Chinese. The most widespread is the [Palladius system](/wiki/Palladius_system). ## As a foreign language With the growing importance and influence of China's economy globally, Standard Chinese instruction has been gaining popularity in schools throughout East Asia, Southeast Asia, and the Western world. Besides Mandarin, Cantonese is the only other Chinese language that is widely taught as a foreign language, largely due to the economic and cultural influence of Hong Kong and its widespread usage among significant Overseas Chinese communities. In 1991, there were 2,000 foreign learners taking China's official Chinese Proficiency Test, called [Hanyu Shuiping Kaoshi](/wiki/Hanyu_Shuiping_Kaoshi) (HSK), comparable to the English [Cambridge Certificate](/wiki/University_of_Cambridge_ESOL_examination), but by 2005 the number of candidates had risen sharply to 117,660 and in 2010 to 750,000. - Language portal - China portal - Taiwan portal - Singapore portal - Hong Kong portal - *[Chengyu](/wiki/Chengyu)* - [Chinese Calligraphy](/wiki/Chinese_calligraphy) - [Chinese computational linguistics](/wiki/Chinese_computational_linguistics) - [Chinese exclamative particles](/wiki/Chinese_exclamative_particles) - [Chinese honorifics](/wiki/Chinese_honorifics) - [Chinese language law](/wiki/Chinese_language_law) - [Chinese numerals](/wiki/Chinese_numerals) - [Chinese punctuation](/wiki/Chinese_punctuation) - [Chinese word-segmented writing](/wiki/Chinese_word-segmented_writing) - [Classical Chinese grammar](/wiki/Classical_Chinese_grammar) - [Han unification](/wiki/Han_unification) - [Languages of China](/wiki/Languages_of_China) - [North American Conference on Chinese Linguistics](/wiki/North_American_Conference_on_Chinese_Linguistics) - [Protection of the varieties of Chinese](/wiki/Protection_of_the_varieties_of_Chinese) ## Notes ### Citations ### Sources - Arablouei, Ramtin; et al. (26 May 2022), \"The Characters That Built China\", *[Throughline](/wiki/Throughline)* (Podcast), [NPR](/wiki/NPR), retrieved 27 August 2023 On the history of the standardization of Mandarin as the Chinese primary national dialect. - Hannas, Wm C. (1997), *Asia's Orthographic Dilemma*, Honolulu: [University of Hawaiʻi Press](/wiki/University_of_Hawai%CA%BBi_Press), [ISBN](/wiki/ISBN_(identifier)) 978-0-8248-1842-5 - Huang, Cheng-Teh James; Li, Yen-Hui Audrey; Li, Yafei (2009), *The Syntax of Chinese*, Cambridge Syntax Guides, [Cambridge University Press](/wiki/Cambridge_University_Press), [doi](/wiki/Doi_(identifier)):10.1017/CBO9781139166935, [ISBN](/wiki/ISBN_(identifier)) 978-0-521-59958-0, [S2CID](/wiki/S2CID_(identifier)) 209828119 - [Qiu, Xigui](/wiki/Qiu_Xigui) (2000), *Chinese Writing*, Early China special monograph series, translated by Mattos, Gilbert L.; [Norman, Jerry](/wiki/Jerry_Norman_(sinologist)), Berkeley: Society for the Study of Early China, [Cambridge University Press](/wiki/Cambridge_University_Press), [ISBN](/wiki/ISBN_(identifier)) 978-1-55729-071-7 - R. L. G. (6 June 2013), \"Why So Little Chinese in English?\", *Johnson* (blog): Language Borrowing (topic), *[The Economist](/wiki/The_Economist)*, archived from the original on 20 June 2013, retrieved 27 August 2023 - [Tsu, Jing](/wiki/Jing_Tsu) (2022), [*Kingdom of Characters: The Language Revolution That Made China Modern*](/wiki/Kingdom_of_Characters), New York: Riverhead, [ISBN](/wiki/ISBN_(identifier)) 978-0-7352-1472-9, [OCLC](/wiki/OCLC_(identifier)) 1246726702 - Classical Chinese texts – Chinese Text Project - Marjorie Chan's ChinaLinks at the Ohio State University with hundreds of links to Chinese related web pages. Archived 20 July 2011 at the [Wayback Machine](/wiki/Wayback_Machine).\n",
  "language": "en",
  "processed_at": "2026-01-12T10:02:59.080243",
  "title": "Chinese language",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Chinese_language"
}