{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:02:57.396216"
  },
  "content": "* *Chinese Street Opera,** also commonly known as ***Chinese* *wayang***, an Indonesian and Malay term meaning 'theatre' or 'show', refers to the traditional theatrical performance which features actors and actresses with elaborate makeup and vibrant costumes as part of religious traditions or private events hosted by wealthy families. In [Singapore](/wiki/Singapore), the term wayang was specifically associated with Chinese Street Opera performances, and it is usually performed in temples during the Lunar New Year, deity birthdays and ascension days, temple anniversaries, and the [Hungry Ghost Festival](/wiki/Ghost_Festival). There are 2 different types of Chinese Street Opera troupes that exist in Singapore today, namely amateur and professional opera troupes. Amateur opera troupes typically perform in indoor theatres, mainly for the purpose of cultural tourism, while professional opera troupes, perform traditional street opera in temples, dedicated for religious ceremonies. In the early 2000s, a professional opera troupe was generally made up of around 30 people: a manager, stagehands, musicians and performers. Singapore's Chinese opera landscape mainly consists of 5 major dialect opera forms: Hokkien, Teochew, Cantonese, Hainanese and Beijing opera. ## History ### Early colonial records Early European descriptions of Chinese Street Opera performances in colonial Singapore during the 1800s were exceedingly limited. The earliest known colonial account of Chinese Street Opera performance in Singapore was published in 1845 by [Charles Wilkes](/wiki/Charles_Wilkes), a commander of the [United States Exploring Expedition](/wiki/United_States_Exploring_Expedition) when he witnessed a Chinese Street Opera performance during the Lunar New Year celebrations in February 1842. According to Wilkes, Chinese Opera performances were held in open sheds that were elaborately adorned with silk hangings, inscribed banners and illuminated with coloured lamps. He also noted that the stage was elevated six feet above the street, minimally furnished with two chairs and a table, which featured performers with vibrant costumes, and female characters portrayed by younger men or boys. (2, p. 21) Another colonial account was written by Jonas Daniel Vaughan in 1853, a prominent colonial official who spent the majority of his life in the [Straits Settlements](/wiki/Straits_Settlements) where served as a public official and lawyer, where he described a Chinese Opera performance in Penang. Vaughan's observations on Chinese Opera performances highlighted crucial differences between ritualistic opera performances and what he referred to as 'domestic plays' - which are secular performances that he described as more easily understood and enjoyable. Vaughan also described that these performances were so spectacular that it attracted both Chinese and European audiences, who would organise parties to attend theatrical performances. ### 1850s ban and riot In 1850, the colonial government imposed strict restrictions on public street performances in an attempt to maintain public order. This prompted 83 Chinese businessmen and prominent personalities to sign a petition to the Governor-General of India, Marquis of Dalhousi. They specifically sought permission to continue traditional rites and customs related to marriages and funerals, including open-air ancestral offerings, temple rituals, and Chinese opera performances to celebrate deities' birthdays. However, the petition was swiftly dismissed, and in November 1856, the colonial government implemented the Police and Conservancy Acts in the Straits Settlement without a clear explanation. This fueled rumours among the Chinese community that opera and other street processions would be banned, leading to a strike organised by Chinese shops, markets and transport workers on 2 January 1857. A riot erupted just 2 months later when the police attempted to halt an opera performance in Penang, resulting in the deaths of several coolies. Despite these protests, the colonial authorities remained firm in their position, and obtaining a public license from the police became mandatory for staging Chinese opera performances, a requirement that continues to persist to this day. ### The rise of Chinese street opera The late 19th and early 20th centuries witnessed the rapid growth of Singapore's Chinese immigrant population, from 54,572 in 1871 to 164,041 in 1901, and 418,640 by 1931. The influx of Chinese immigrants mainly from the southern coastal provinces of China arriving in Singapore led to the increasing popularity of Chinese Street Opera performances, which served both as an affordable and familiar form of entertainment. By the late 19th century, Singapore had 8 theatres dedicated to Chinese Opera performances, including the [Lai Chun Yuen Opera House](/wiki/Lai_Chun_Yuen_Opera_House) located at 36 Smith Street in Chinatown, Pu Chang Chun on Eu Tong Sen Street, Ee Hng, located alongside Jing Chun Yuan, Yang Chun Yuan, Dan Gui Yuan, and Sheng Chun Yuan opera houses at 41 Merchant Road, and **Diet Hng** located at 61 New Market Road. ### The golden years of Chinese street opera: 1930s–1950s The 1930s to 1950s were widely known as the \"Golden Era\" of Chinese Opera by local opera observers. The rise of early phases of modernisation, capitalism, as well as consumer culture provided opportunities for Chinese opera to prosper, where it transitioned from a primarily low-cost form of entertainment to a flourishing business. Driven by the colony's rapid economic expansion, especially in the Teochew and Hokkien-dominated entrepot trade, Chinese opera performances attracted affluent Chinese merchants Singapore, who were willing to spend their profits on entertainment. The growing popularity of Chinese opera performances resulted in an expansion of professional opera troupes in Singapore, including some that were hired from China and Hong Kong. Visitors from foreign countries were also accompanied by government officials and invited to attend Chinese opera performances in Singapore. The popularity of Chinese street opera performances is evident from the revenue generated for permits for 'street wayangs and processions', which surged from $9,799 in 1915 to $56,889.75 in 1934. ### The decline of Chinese street opera: 1960s–1970s Increased disposable income and leisure time among Singaporeans resulted in the rise of other forms of entertainment, such as shopping, videos, and air travel, causing a decline in the demand for Chinese Street Opera. Significant changes in social and political structures, followed by English language education, and exposure to modern media have led to a disconnect towards traditional cultures and practices. ### Speak Mandarin campaign On 7 September 1979, former [Prime Minister of Singapore](/wiki/Prime_Minister_of_Singapore), [Lee Kuan Yew](/wiki/Lee_Kuan_Yew), introduced the [Speak Mandarin campaign](/wiki/Speak_Mandarin_Campaign) to encourage Chinese communities in Singapore to converse in Mandarin instead of their native dialects. The Speak Mandarin Campaign featured a series of slogans such as: \"Speak more Mandarin and less dialects\" in 1979, \"Learn Mandarin, Speak Mandarin\" in 1981, \"Speak Mandarin while at work\" and \"Don't hesitate, Speak Mandarin.\" in 1982 to promote Mandarin usage among Chinese workers in their workplaces, and \"Please speak Mandarin, your children's future is in your hands\" in 1984. A survey conducted by the Research and Information Department of Times Publishing Bhd in 1981 revealed that 9 in 10 respondents considered that the campaign was successful, with 64% of 746 Chinese respondents aged 12 and above indicating that they used Mandarin more frequently. The Speak Mandarin campaign's success marked a steady decline in the use of dialects during the late 1980s to 1990s, further weakening Chinese opera's cultural relevance within the ethnic Chinese community in Singapore. ### Attempts to revive Chinese street opera in Singapore: 1980s–1990s In an effort to revitalise and promote traditional arts and culture, the Singapore government implemented various assistance schemes to performing arts groups and organised various festivals throughout the 1970s to 1980s. Led by [Ong Teng Cheong](/wiki/Ong_Teng_Cheong), then-Minister for Culture, these initiatives featured festivals and performances such as the Singapore Festival of Arts organised in 1977, the Drama Festival and Chinese opera performances held at [Hong Lim Park](/wiki/Hong_Lim_Park) in 1978, and the Singapore Festival of Dance, which took place in 1982. Further initiatives were also launched in the 1980s, which included the Young People's Theatre Festival, Chinese Instrumental Music Festival, Jazz Festival and Choir Festival. In February 1998, the Singapore Chinese Opera Society organised a Chinese Street opera performance event titled \"Street Wayang Revisited\" held at Bras Besah Park as part of the annual Chinese Cultural Festival. The event featured a three-night performance of the renowned Chaozhou opera \"Liu Ming Zhu\" by Sing Yong Hoe Heng Teochew Wayang, presented in a 'street wayang-style'. An exhibition held at the Singapore History Museum took place from 13 February to 15 March 1998, showcasing Chaozhou opera artifacts including Chinese opera old costumes, props, scripts, many of which belonged to Sing Yong Hoe Heng. The $15,000 initiative was partly funded by the [Singapore Press Holdings](/wiki/Singapore_Press_Holdings), [National Arts Council](/wiki/National_Arts_Council,_Singapore), as well as other national institutions, which was promoted extensively and received significant public interest and engagement. ## In popular culture Chinese wayang has also been adapted into various formats, including stage plays and television dramas. [Goh Boon Teck](/wiki/Goh_Boon_Teck)'s 1994 play *[Titoudao](/wiki/Titoudao)* featured the life story of his mother, Oon Ah Chiam, who was a renowned Chinese wayang street performer back in the 1950s and 1960s. In 2020, [Mediacorp](/wiki/Mediacorp) adapted Goh's play *Titoudao* and produced an English drama series *Titoudao: Inspired By The True Story Of A Wayang Star*, featuring Mediacorp veteran actress [Fann Wong](/wiki/Fann_Wong) and Malaysian actress [Koe Yeet](/wiki/Koe_Yeet).\n",
  "language": "en",
  "processed_at": "2026-01-12T10:02:57.395667",
  "title": "Chinese Street Opera in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Chinese_Street_Opera_in_Singapore"
}