{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:02:38.490513"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Chin Bee\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(January 2021)* *(Learn how and when to remove this message)*Subzone of Jurong West Planning Area in Singapore **Chin Bee** is an area in Jurong Industrial Estate in Singapore, bounded by Boon Lay Way, Jalan Boon Lay, Ayer Rajah Expressway (Jalan Ahmad Ibrahim) and Corporation Road. Chin Bee consists of many food manufacturing factories. Some of the early roads in the area were named after members of the Chew (Chew Boon Lay) family. Boon Lay Road, which originally ran from the old Jurong Road through Chew's estates to the southern coast, was named after Chew himself while Chin Chong and Chin Bee roads were named after his grandsons. ## Transport It is in between [Boon Lay](/wiki/Boon_Lay_MRT_station) and [Lakeside](/wiki/Lakeside_MRT_station) stations. Bus services **79** and **246** ply through into the area with 79 plying along the Northern part of the area while 246 plies the Southern part (Jalan Tukang) while bus services **249** and **178** goes through the border of it along Jalan Boon Lay and Corporation Road respectively. All of the above-mentioned services links the area to [Boon Lay MRT station](/wiki/Boon_Lay_MRT_station) which is the nearest MRT station while 246 plies [Lakeside MRT station](/wiki/Lakeside_MRT_station) via Taman Jurong estate as well. ## Neighbouring areas This [Singapore](/wiki/Singapore) location article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T10:02:38.490139",
  "title": "Chin Bee",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Chin_Bee"
}