{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:03:18.881626"
  },
  "content": "Bus interchange in Singapore **Choa Chu Kang Bus Interchange** is a [bus interchange](/wiki/Bus_station) which mainly serves the residential neighbourhood of [Choa Chu Kang](/wiki/Choa_Chu_Kang) in the [West Region](/wiki/West_Region,_Singapore) of [Singapore](/wiki/Singapore). It is located at Choa Chu Kang Loop and connected to [Choa Chu Kang MRT/LRT station](/wiki/Choa_Chu_Kang_MRT/LRT_station) and the [Lot One Shoppers' Mall](/wiki/Lot_One_Shoppers%27_Mall). Opened in 1990, the old bus interchange was one of the oldest surviving bus interchanges in [Singapore](/wiki/Singapore) to remain intact from re-modification while still in service for 28 years until 15 December 2018. The new site opened on 16 December 2018. ## History Choa Chu Kang used to have a roadside bus terminal along Choa Chu Kang Way. It was later replaced by a bus interchange built beside the [MRT station](/wiki/Choa_Chu_Kang_MRT/LRT_station). It was opened on 8 April 1990 and remained operational until 15 December 2018 with little modifications. The old bus interchange was demolished to make way for the Jurong Region Line's Choa Chu Kang station. Trans-Island Bus Services also had the operating base for Choa Chu Kang since 1990, where bus service SS7 was introduced from Choa Chu Kang to Woodlands, and on 10 March 1996, bus services 925 and 927 were extended to Choa Chu Kang. In 1995, all bus services (175, 185, 188, 190, 300, 302 and 307) with the exception of service 67 were drawn under Choa Chu Kang Bus Package, whereas they were handed over between 25 July 1999 and 26 December 1999, however service 67 was transferred from Tampines Bus Package and 172 was transferred from Jurong West Bus Package on 26 December 1999. In 2018, the new interchange was built, near to Lot One. It opened on 16 December 2018, and before that, service 308 was merged into service 991 to provide connectivity from Choa Chu Kang to Bukit Batok as well as enhanced connectivity as well as service 974 being launched for commuters travelling to Joo Koon, reducing congestion on services 172 and 180, as well as the East West Line and North South Line. ## Bus Contracting Model Under the [Bus Contracting Model](/wiki/Bus_contracting_model_of_Singapore), all bus services operating from Choa Chu Kang Bus Interchange were divided into 2 Bus Packages, operated by the anchor operator, [SMRT Buses Ltd](/wiki/SMRT_Buses). ## List of Bus Services OperatorPackageRoutes**SMRT Buses**Choa Chu Kang–Bukit Panjang67, 172, 188, 188e, 190, 300, 301, 302, 307, 927, 976, 983, 985, 991Woodlands925 - Media related to Choa Chu Kang Bus Interchange at Wikimedia Commons - Interchange/Terminal (SMRT Buses) This Singapore bus-related article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T10:03:18.881183",
  "title": "Choa Chu Kang Bus Interchange",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Choa_Chu_Kang_Bus_Interchange"
}