{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:03:16.693658"
  },
  "content": "Planning area and residential town in SingaporeThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Choa Chu Kang\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(September 2024)* *(Learn how and when to remove this message)*Planning Area and HDB Town in West Region, Singapore **Choa Chu Kang** (locally /ˌtʃwɑː ˌtʃuː ˈkɑːŋ/[b]), alternatively spelled **Chua Chu Kang** and often abbreviated as **CCK**, is a [planning area](/wiki/Planning_Areas_of_Singapore) and [residential town](/wiki/New_towns_of_Singapore) located at the northwestern point of the [West Region](/wiki/West_Region,_Singapore) of [Singapore](/wiki/Singapore). The town shares borders with [Sungei Kadut](/wiki/Sungei_Kadut) to the north, [Tengah](/wiki/Tengah,_Singapore) to the southwest, [Bukit Batok](/wiki/Bukit_Batok) to the southeast, [Bukit Panjang](/wiki/Bukit_Panjang) to the east and the [Western Water Catchment](/wiki/Western_Water_Catchment) to the west. Choa Chu Kang New Town is separated into two portions by the [Kranji Expressway](/wiki/Kranji_Expressway). Originally a [kampung](/wiki/Kampung), the area has been rapidly developed under the ambition of the [Housing and Development Board](/wiki/Housing_and_Development_Board), to transform it into a modern township. The town comprises six subzones, five of which are the most densely populated: Choa Chu Kang Central, Choa Chu Kang North, [Yew Tee](/wiki/Yew_Tee), Teck Whye, and Keat Hong. ## Etymology Choa Chu Kang's name is derived from its historical core at the former site of Chua Chu Kang Village located near the junction of [Choa Chu Kang Road](/wiki/Choa_Chu_Kang_Road) and [Jalan Sungei Poyan](/wiki/Poyan_Reservoir), currently occupied by the grounds of the National Shooting Centre which comes under the purview of Singapore Shooting Association. The name began to be applied to the general area around the village when Choa Chu Kang Road, a main arterial road linking the village to [Upper Bukit Timah Road](/wiki/Upper_Bukit_Timah_Road) towards the east was built. The name \"Choa Chu Kang\" is derived from the [Teochew](/wiki/Teochew_Min) word \"chu kang\" (厝港, [Peng'im](/wiki/Peng%27im): cu3 gang2), meaning \"back port\". In the nineteenth century, Chinese immigrants planted [gambier](/wiki/Uncaria_gambir) and [pepper](/wiki/Black_pepper) along the river banks of Choa Chu Kang, although many migrated to [Johor](/wiki/Johor) to the north at the encouragement of the [Temenggong](/wiki/Temenggong) of Johor. The plantation owners were known as [Kangchu](/wiki/Kangchu) (港主, [Peng'im](/wiki/Peng%27im): gang2 zu2)- the word \"kang\" refers to the riverbank and \"chu\" means \"owner\" or \"master\", referring to the headman in charge of the plantations in the area. \"Choa\" is the clan name of the first headman. ## History ### Early history Choa Chu Kang was a diverse area with old kampong housing and rubber plantations. Residents had to depend on boats or bullock carts for transportation. Among the few villages which sprang up were Kampong Belimbing and Chua Chu Kang Village. Most of the inhabitants belonged to the Teochew dialect group. The early Teochew settlers were mainly farmers growing [gambier](/wiki/Uncaria_gambir) and pepper. The Hokkiens, who moved in later, established pineapple, rubber and coconut plantations as well as vegetable farms and poultry farms. In the early days, tigers used to roam in the area. The last tiger of Singapore was shot here in the 1930s. Kampong Belimbing, Chua Chu Kang Village and Kampong Berih were demolished in phases from 1993 to 1998. It was replaced by the National Shooting Centre and military plot (Cemetery North) and (Jalan Bahar). The Cemetery North has been gazetted as an army restricted and live-firing area since 19 September 2003. The Jalan Bahar is gazetted as an army restricted and live-firing area from 16 March 2001. The name Choa Chu Kang is used for Choa Chu Kang Road and its nearby facilities. However, the original name Chua Chu Kang is retained in the cemetery area. ### New town era (1980s) The new town era evolved in 1985 when Teck Whye was developed (the first HDB blocks since 1977), and it was extended to four neighbourhoods by 1992 with the truncation of [Choa Chu Kang Road](/wiki/Choa_Chu_Kang_Road). [Yew Tee](/wiki/Yew_Tee) was developed in 1997 as the three northern neighbourhoods of Choa Chu Kang, north of the [Kranji Expressway](/wiki/Kranji_Expressway). Choa Chu Kang's eighth neighbourhood, Keat Hong, bound to the south by Brickland Road, was developed in 2015. ## Demographics ### Population history Resident Population 2000-2025YearPop.±%2000136,810—2001145,670+6.5%2002152,110+4.4%2003155,180+2.0%2004157,800+1.7%2005161,190+2.1%2006163,630+1.5%2007166,170+1.6%2008168,510+1.4%2009171,790+1.9%2010173,290+0.9%2011173,760+0.3%2012174,190+0.2%2013174,870+0.4%2014175,330+0.3%2015174,330−0.6%2016179,140+2.8%2017186,580+4.2%2018187,510+0.5%2019190,890+1.8%2020192,070+0.6%2021189,050−1.6%2022189,990+0.5%2023191,480+0.8%2024190,180−0.7%Source: ### Age profile The data below is from the population report published by the Singapore Department of Statistics as of June 2025. Age group (years)MalesFemalesTotal population% of total population0–43,6103,4607,0703.775–94,4304,3408,7704.6810–144,7204,5009,2204.9215–195,2304,91010,1405.4120–246,0605,92011,9806.3925–297,8807,44015,3208.1730–347,7507,58015,3308.1735–396,3406,76013,1006.9840–445,8306,57012,4006.6145–495,7106,31012,0206.4150–546,3207,16013,4807.1955–597,3107,95015,2608.1460–647,7507,46015,2108.1165–696,1905,62011,8106.3070–743,9303,8607,7904.1575–792,2502,4204,6702.4980–848901,2002,0901.1185–894607801,2400.6690+1705307000.37Age group (years)MalesFemalesTotal population% of total population0–1412,76012,30026,00013.3615–6466,18068,060134,24071.5865+13,89014,41028,30015.09 The population distribution of Choa Chu Kang in 2025 demonstrates an ageing population structure, with more elderly residents above age 65 than children between 0 and 14 years old. There is a higher population concentration among younger and middle-aged groups, with males peaking at the 25-29 age range (4.20%) and females peaking at the 55-59 age range (4.24%). ### Household As of 2025, there were 160,730 people living in [HDB](/wiki/Housing_and_Development_Board) flats, representing 85.7% of the population. This is higher than the national proportion of HDB dwellers (75.8%), reflecting a greater prevalence of public housing as compared to the national average. Among the population, 76,490 residents, or 40.8% of the population, live in 4-Room HDB Flats, making it the most common type of dwelling. 23,900 residents (12.7%) also reside in condominiums and other apartments, while 2,340 (1.25%) live in landed properties. According to the 2020 Census of Population, the average household size in Choa Chu Kang is 3.53. Among the 58,024 households in Choa Chu Kang, the most common household size is four persons, representing 25.7% of total households. Choa Chu Kang has a [home ownership](/wiki/Owner-occupancy) rate of 92.9% as of 2020. This is significantly higher than the national home ownership rate of 87.9%, making Choa Chu Kang the third-highest in home ownership rate among all planning areas in Singapore. ### Ethnicity Ethnic groups in Choa Chu Kang (2000−2020) Year[Chinese](/wiki/Chinese_Singaporeans)[Malays](/wiki/Malay_Singaporeans)[Indians](/wiki/Indian_Singaporeans)Others[Pop.](/wiki/Population)PercentagePop.PercentagePop.PercentagePop.Percentage**2000**101,25974.02%25,52718.66%9,1616.7%8610.63%**2010**123,70271.38%29,18016.84%15,7499.09%4,6602.69%**2015**123,45070.81%29,63017%16,4709.45%4,7902.75%**2020**133,52069.52%35,50018.48%18,0209.38%5,0202.61% As of 2020, Choa Chu Kang has a higher level of ethnic diversity as compared to the national average. This is due to the considerably lower proportion of Chinese residents (69.52%) and a higher proportion of Malay residents (18.48%) compared to the national average of 74.35% and 13.49% respectively. ### Religion Consistent with the rest of Singapore, the largest religion in Choa Chu Kang is [Buddhism](/wiki/Buddhism_in_Singapore), with 51,662 practising residents (30.77% of the population). The second most common group consists of residents practising [Islam](/wiki/Islam_in_Singapore), with 34,825 residents (20.74%), followed by those with [no religion](/wiki/Irreligion_in_Singapore) (29,826 residents, 17.77%).[Christianity](/wiki/Christianity_in_Singapore) is practised by 23,687 residents (14.11%), including 8,605 Catholics (5.13%). Other religious affiliations include [Taoism](/wiki/Taoism_in_Singapore) and [other Chinese religions](/wiki/Chinese_folk_religion) (17,214 residents, 10.30%), [Hinduism](/wiki/Hinduism_in_Singapore) (9,963 residents, 5.93%), and [Sikhism](/wiki/Sikhism_in_Singapore) (319 residents, 0.19%). Compared to the national average of 15.59%, there is a substantially higher proportion of residents practising Islam in Choa Chu Kang. ### Education As of 2020, 96.9% of the population aged above 15 is literate, similar to the national average of 97.1%. 64.3% of residents are literate in two languages, with the most common language pair being English and Chinese (49.1% of residents). Additionally, 2.1% of Choa Chu Kang residents are literate in three or more languages. 41,019 residents (27.6% of the population) in Choa Chu Kang have attained a university qualification, lower than the national average of 32.1%, ranking the fifth lowest among all planning areas in Singapore. In contrast, 14,196 residents, or 9.5% of the population, have no educational qualifications, lower than the national average of 10.6%. ### Language Languages most frequently spoken at home, Choa Chu Kang (2020 census)Languagespercent[English](/wiki/Singapore_English)45.5%[Mandarin Chinese](/wiki/Mandarin_Chinese)31.8%[Malay](/wiki/Malay_Language)11.8%[Chinese dialects](/wiki/Chinese_dialects)6.5%[Tamil](/wiki/Tamil_Language)3.1%[Other Indian languages](/wiki/Languages_of_India)0.63%Others0.65% In Choa Chu Kang, the proportion of residents using [English](/wiki/English_language) as the most frequently spoken language, 45.41%, is slightly lower than the national average of 48.25%. Of the 6,712 Indian language speakers, the majority speak [Tamil](/wiki/Tamil_Language) (5,580 residents, 3.08%), representing 83.13% of all Indian language speakers. ### Employment and income According to the 2020 Census of Population, 111,120 residents aged 15 years and over in Choa Chu Kang are employed, out of the 117,517 in the [labour force](/wiki/Workforce). This equates to an employment rate of 94.6%, slightly higher than the [national employment rate](/wiki/Employment_in_Singapore) of 94.2%. The remaining 50,368 residents aged above 15 in Choa Chu Kang (30.0%) are outside the labour force. Among the employed residents in Choa Chu Kang aged 15 years and over, most earn a gross monthly income of between S$3,000 and S$3,999, with 13.1% being in that category. This is followed closely by those earning between S$2,000 and S$2,999, constituting 12.9% of employed residents. Additionally, 7.0% earn less than S$1,000 per month, while 4.3% earn S$15,000 and above per month. According to the 2020 Census of Population, most resident households in Choa Chu Kang earn a monthly household income of S$20,000 and over, constituting 11.3% of all households. The second most common category is households with no employed person, encompassing 7.7% of all households. ## Politics When Choa Chu Kang Town was developed by expanding Teck Whye Estate near the other end of Choa Chu Kang Road at its junction with Upper Bukit Timah Road and Woodlands Road to the north, the place name began to be applied to a much larger area, especially when political divisions like the Choa Chu Kang ward applied to the entire northwest sector of the country during some editions of the [Parliamentary elections](/wiki/Elections_in_Singapore). Likewise, the residents' committees in Choa Chu Kang were expanded in 1988 and 1991, and part of the Choa Chu Kang sector gave way to the Yew Tee division, followed by the Keat Hong division in 2001. The growing demand of Keat Hong Neighbourhood 8 also requested for the redrawing of boundaries whereby Limbang ward took over the parts of Yew Tee and Choa Chu Kang, aligning more closely with Neighbourhoods 5 and 6. Today, the Yew Tee and Limbang wards fall within the [Marsiling-Yew Tee Group Representation Constituency](/wiki/Marsiling-Yew_Tee_Group_Representation_Constituency) and the rest of the town such as Keat Hong and Choa Chu Kang fall within the [Chua Chu Kang Group Representation Constituency](/wiki/Chua_Chu_Kang_Group_Representation_Constituency). In 2020, with the further growth of Keat Hong Neighbourhood 8 and Tengah New Town, the Brickland ward was introduced, taking over parts of Keat Hong, Bukit Gombak, Choa Chu Kang and Nanyang. ## Education Choa Chu Kang has eight primary schools, six secondary schools, two post-secondary institutions and a single special needs school as of 2022. ### Primary schools - Chua Chu Kang Primary School - Concord Primary School - De La Salle School - Kranji Primary School - South View Primary School - Teck Whye Primary School - Unity Primary School - Yew Tee Primary School ### Secondary schools - [Bukit Panjang Government High School](/wiki/Bukit_Panjang_Government_High_School) - [Chua Chu Kang Secondary School](/wiki/Chua_Chu_Kang_Secondary_School) - Kranji Secondary School - Regent Secondary School - Unity Secondary School ### Tertiary institutions - [ITE College West](/wiki/ITE_College_West) - [Jurong Pioneer Junior College](/wiki/Jurong_Pioneer_Junior_College) ### Other schools - APSN Delta Senior School - ACS Academy ## Transportation facilities City planners plan for [public transport](/wiki/Public_transport) to eventually become the preferred [mode of transport](/wiki/Mode_of_transport) in the future. The government of Singapore ideally desires [environmental](/wiki/Environmentalism) towns, using public transport to reduce [pollution](/wiki/Pollution) caused by heavy road traffic. Choa Chu Kang is part of the Urban Redevelopment Authority's focus for realising this [urban planning](/wiki/Urban_planning) model. As Choa Chu Kang is relatively distant from the city centre at the [Central Area](/wiki/Central_Area,_Singapore), an efficient, high-volume and high-speed public transport system is also preferred over [road networks](/wiki/Road_transport_in_Singapore). [Choa Chu Kang MRT/LRT station](/wiki/Choa_Chu_Kang_MRT/LRT_station) and [Choa Chu Kang Bus Interchange](/wiki/Choa_Chu_Kang_Bus_Interchange) are conveniently connected in the town centre to allow seamless travel for the residents of Choa Chu Kang New Town across the different available modes of public transport. ### Public transport #### Rail Choa Chu Kang New Town is linked to the Central Area and to the other lines on the MRT/LRT system (to the east–west line at [Jurong East station](/wiki/Jurong_East_MRT_station), to the Thomson-East Coast line at [Woodlands station](/wiki/Woodlands_MRT_station), to the Circle line at [Bishan station](/wiki/Bishan_MRT_station), to the Downtown line at [Newton station](/wiki/Newton_MRT_station) and the North East line at [Dhoby Ghaut station](/wiki/Dhoby_Ghaut_MRT_station)) through the [North–South Line](/wiki/North%E2%80%93South_Line_(Singapore)) (NSL) at [Choa Chu Kang station](/wiki/Choa_Chu_Kang_MRT/LRT_station) (NS4) located at Choa Chu Kang Town Centre. It usually takes an hour for passengers to travel from Choa Chu Kang to the [Central Area](/wiki/Central_Area,_Singapore) which changes at Jurong East. The intra-town [Bukit Panjang LRT](/wiki/Bukit_Panjang_LRT_line) is a 7.8 km light rail line that serves to link residents to the town centre and the nearby town of [Bukit Panjang](/wiki/Bukit_Panjang), hence the line's name. It is a fully driverless system. [Yew Tee station](/wiki/Yew_Tee_MRT_station) (NS5), the other station along NSL in Choa Chu Kang New Town, serves the housing developments in Yew Tee, the industrial estate of [Sungei Kadut](/wiki/Sungei_Kadut), and the northern part of [Choa Chu Kang New Town](/wiki/Choa_Chu_Kang_New_Town). The station started operations on 10 February 1996. Like Choa Chu Kang, it usually takes an hour for passengers to travel from Yew Tee to the [Central Area](/wiki/Central_Area,_Singapore) when using the station which changes at Jurong East. #### Bus services Bus services are available at the [Choa Chu Kang Bus Interchange](/wiki/Choa_Chu_Kang_Bus_Interchange) which is connected to the [Choa Chu Kang MRT/LRT station](/wiki/Choa_Chu_Kang_MRT/LRT_station) and the town's central shopping mall [Lot One Shoppers' Mall](/wiki/Lot_One_Shoppers%27_Mall). It was opened in 1990 with 12 bus services under SBS Transit and at their own Choa Chu Kang Bus Package, all handed over to [SMRT Buses](/wiki/SMRT_Buses) in 1999. On 16 December 2018, the interchange was relocated to a new facility at the junction of Choa Chu Kang Way and Choa Chu Kang Loop, with the old interchange being demolished due to the construction of the [Jurong Region Line](/wiki/Jurong_Region_Line). All services were amended to the new interchange on that day. The bus interchange currently has 15 services; 14 are public bus services (mostly operated by [SMRT Buses](/wiki/SMRT_Buses), the other a special free shuttle to Qian Hu Fish Farm. Typically passenger traffic is often very high in morning and evening [peak hours](/wiki/Peak_hours). Bus services were introduced over the years in Choa Chu Kang: - 25 April 2015: Service 983 was introduced from Choa Chu Kang to Keat Hong Close, and extended on 27 December 2015 to Bukit Panjang. - 27 December 2015: Service 979 was introduced from Bukit Panjang to Yew Tee. - 15 May 2016: Service 308 was introduced from Choa Chu Kang to Keat Hong Link (Loop). - 8 April 2018: Service 974 was introduced from Bukit Panjang Temporary Bus Park to Joo Koon. - 30 September 2018: Service 991 was even extended from Bukit Batok West, via Bukit Gombak MRT, Bukit Batok West Avenue 5, Brickland Road, Choa Chu Kang Avenues 3 and 1, and Keat Hong Link to Choa Chu Kang, replacing route 308. - 10 November 2019: Service 976 was introduced from Choa Chu Kang to Bukit Panjang. In addition, 300 and 302 were the last bus routes to be converted to use double deckers after the [articulated buses](/wiki/Articulated_buses) starts retiring in 2017. #### Road network The [Kranji Expressway](/wiki/Kranji_Expressway) (KJE) links Choa Chu Kang Town up with Singapore's expressway network. With the KJE, drivers can change onto the [Bukit Timah Expressway](/wiki/Bukit_Timah_Expressway) (BKE) which in turn, is connected to the [Pan-Island Expressway](/wiki/Pan-Island_Expressway) (PIE) which travels to the [Central Area](/wiki/Central_Area,_Singapore) and the eastern parts of Singapore. As the town is surrounded by the towns of [Bukit Panjang](/wiki/Bukit_Panjang), [Bukit Batok](/wiki/Bukit_Batok), [Bukit Gombak](/wiki/Bukit_Gombak) and southern [Woodlands](/wiki/Woodlands,_Singapore), many roads (old and new) have been constructed to link Choa Chu Kang into other towns which eventually allows residents to other parts of the country by either bus, train, car or any other reliable means of transportation. The following roads connect the central town of Choa Chu Kang to the nearby towns of [Bukit Batok](/wiki/Bukit_Batok) and [Bukit Panjang](/wiki/Bukit_Panjang): - Bukit Batok Road (links Choa Chu Kang with Bukit Batok and [Jurong East](/wiki/Jurong_East)) - [Choa Chu Kang Road](/wiki/Choa_Chu_Kang_Road) - [Upper Bukit Timah Road](/wiki/Bukit_Timah_Road) (northern section connects with Choa Chu Kang Road) - Teck Whye Lane - Bukit Panjang Road - Brickland Road - Woodlands Road The following roads connect the central town of Choa Chu Kang to its northern counterpart neighbourhood, Yew Tee: - Choa Chu Kang Way - Choa Chu Kang Drive (parallel to the track between [Choa Chu Kang](/wiki/Choa_Chu_Kang_MRT/LRT_station) and [Yew Tee](/wiki/Yew_Tee_MRT_station) [MRT](/wiki/Singapore_MRT) stations) ## Amenities ### Commercial There are several main shopping centres in Choa Chu Kang. [Lot One](/wiki/Lot_One) is a shopping mall located next to [Choa Chu Kang MRT station](/wiki/Choa_Chu_Kang_MRT_station) and is owned by [CapitaLand](/wiki/CapitaLand), serving as a major hub in Choa Chu Kang. Its anchor tenants are [NTUC FairPrice](/wiki/NTUC_FairPrice), [Shaw Theatres](/wiki/Shaw_Organisation), [Cotton On](/wiki/Cotton_On_Group), [Popular Bookstore](/wiki/Popular_Holdings) and the Choa Chu Kang Community Library. Yew Tee Point is located in Yew Tee, managed by Wellspring Holdings Pte Ltd. The mall has undergone enhancement works to create a four-storey retail extension block measuring over 16,500 sq ft (1,530 m2). The works, which commenced in July 2007, was completed by end-2008. [NTUC FairPrice](/wiki/NTUC_FairPrice) and [Koufu](/wiki/Koufu_(company)) serve as its anchor tenants. As for [Junction 10](/wiki/Junction_10), it is a shopping mall by [Far East Organisation](/wiki/Far_East_Organisation), located along the boundaries of Choa Chu Kang and [Bukit Panjang](/wiki/Bukit_Panjang). Formerly known as Ten Mile Junction, the mall was upgraded and renamed to Junction 10 in 2011, reopening as a mixed-use development with a condominium, The Tennery, located on its upper floors. The mall houses Mindchamps Preschool, [Fitness First](/wiki/Fitness_First) and [Sheng Siong](/wiki/Sheng_Siong_Supermarket) as its anchor tenants. The other shopping malls are smaller-scale neighbourhood malls. They are Choa Chu Kang Centre, Keat Hong Shopping Centre, Limbang Shopping Centre, Sunshine Place, Teck Whye Shopping Centre and Yew Tee Square. ### Healthcare The estate contains a polyclinic, Choa Chu Kang Polyclinic. Built in 1997, the polyclinic underwent major renovation works in 2010 to incorporate more environmentally and elderly-friendly features. It is operated by the National University Polyclinics. There is also a Family Medicine Clinic, (FMC), Keat Hong FMC, a collaboration between the National University Health System (NUHS) and Trilink Healthcare Pte Ltd. It opened in 2017 and it located within Keat Hong Community Club. ### Parks, recreational and sport venues - [Choa Chu Kang Park](/wiki/Choa_Chu_Kang_Park) – a major park of the town located in the northern part of Choa Chu Kang - [Choa Chu Kang Stadium](/wiki/Choa_Chu_Kang_Stadium) – the town's major stadium which was a practice venue for the [2010 Youth Olympic Games](/wiki/2010_Youth_Olympic_Games) - Choa Chu Kang Swimming Complex – located adjacent to Choa Chu Kang stadium - Choa Chu Kang Mega Playground ## Incident On 31 October 2024, an [eastern black-and-white colobus](/wiki/Eastern_black-and-white_colobus) monkey named Mykel was spotted by a resident in Villa Verde Park in Choa Chu Kang, months after escaping from the [Singapore Zoo](/wiki/Singapore_Zoo). Wildlife Personnel were activated to catch Mykel on 1 November 2024 and it was sent for heath inspections at Singapore Zoo Health Checkup facility before returning to the enclosure. ## Explanatory notes - [List of Kangchu system placename etymologies](/wiki/List_of_Kangchu_system_placename_etymologies)\n",
  "language": "en",
  "processed_at": "2026-01-12T10:03:16.693225",
  "title": "Choa Chu Kang",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Choa_Chu_Kang"
}