{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:03:24.542731"
  },
  "content": "2016 temple murder case in Singapore On 14 February 2016, 47-year-old unemployed Singaporean **Loh Suan Lit** (卢传烈 Lú Chuánliè) hammered 53-year-old temple helper **Tan Poh Huat** (陈宝发 Chén Bǎofā) to death at Choa Chu Kang Combined Temple, located at Singapore's [Choa Chu Kang](/wiki/Choa_Chu_Kang). Loh left for [Malaysia](/wiki/Malaysia) five days after the killing, but he was arrested another five days later at the [Woodlands Checkpoint](/wiki/Woodlands_Checkpoint) on his way back to Singapore. It was revealed that Loh had intruded the temple in order to commit burglary, but after he failed to steal anything and was about to leave, he was caught red-handed by Tan, causing Loh to panic and use the hammer to assault Tan, who died from a crushed voice box. Originally charged with murdering Tan, Loh pleaded guilty to a reduced charge of manslaughter and another unrelated charge of burglary in January 2018, and he was sentenced to imprisonment for 14 years and given [six strokes of the cane](/wiki/Caning_in_Singapore). ## Murder of Tan Poh Huat On the morning of 14 February 2016, at around 7 AM, 68-year-old temple helper Tan Kui Seng arrived at Chin Long Kong Chinese Temple, one of the five constituents of the Choa Chu Kang Combined Temple (along Teck Whye Lane of [Choa Chu Kang](/wiki/Choa_Chu_Kang)), in order to begin his work for the day. Just as he entered the temple, he made a gruesome discovery--his colleague's half-naked body lying in a pool of blood at the temple, with his head covered in injuries and caked in blood. Paramedics arrived at the temple after a report was lodged, and they pronounced the man dead at the scene at 7: 09 AM. The deceased was identified as 53-year-old Tan Poh Huat. He was a divorcee with three adult children, consisting of two sons (aged 32 and 29) and one daughter (aged 27), and he had worked as a temple helper and slept at the temple for the past five years. He also worked as a temple medium at the same temple, which was reportedly founded by Tan's father. The case was initially classified as a case of unnatural death, before it was re-classified as murder. There was nothing stolen from the temple or the victim, who reportedly had about S$2,800 worth of cash in his possession. An autopsy was conducted by forensic pathologist Dr George Paul, and he found over 93 external injuries all over Tan's body, including fractures to his skull, jaw and nose, and a burst eyeball. According to Dr Paul, it was the crushing of Tan's voice box that resulted in the temple helper's death. According to his family and friends, Tan, the youngest of six siblings, was an affable person who never quarrelled with anyone and a loving father to his children, especially his older son, who was a special needs person. Tan originally was an odd-job worker before he retired two years prior to his death, due to his increasingly poor health--he suffered from diabetes, heart disease and kidney failure, and had to attend dialysis sessions at [Ang Mo Kio](/wiki/Ang_Mo_Kio) three times a week. Tan would also hang out with his friends at a coffee shop near the temple during his free time. 63-year-old Tan Siew Huay, Tan's older sister, stated that her brother was a good person who never caused any problems, and stated she would miss his good nature. She also said that her brother had sold his flat in [Choa Chu Kang](/wiki/Choa_Chu_Kang) five years before the murder and her brother not only had a habit of smoking and playing mahjong to gamble, but also worked as a bookmaker, presumably to earn some extra cash. Tan's two younger children and his two oldest brothers went to the mortuary to recover his body for funeral preparations. ## Investigations Assistant Superintendent of Police (ASP) Zhang Yiwen was placed in charge of the police investigations, and her team of officers interviewed Tan Poh Huat's colleagues. One of Tan's colleagues told police that while cleaning the temple, he saw a man behaving suspiciously the night before Tan was murdered, and he witnessed the man going to the back; he seemed to be inspecting the donation boxes. The colleague found it peculiar that the man would come as late as 10:30 PM, since there should be no devotees coming to the temple at that time (when the temple was about to close). He described the man to be male, Chinese, aged between his 30s and 40s, and balding. The man was also seen wearing a red T-shirt and black pants, and had a haversack with him. The police also scoured the [CCTV](/wiki/CCTV) cameras of the temple and places nearby the temple. They found that at around 2 AM, a tattooed man dressed in black and wearing a mask and cap had climbed over the rear temple gates and entered the temple. After some time, the same intruder had left the temple from the same rear gate. The intruder was also seen walking through the nearby HDB blocks. The red T-shirt was issued through a 2015 donation drive and the police also obtained a name-list of donors, recipients and participants who matched the profile of their possible suspect. Through their efforts, the police were eventually able to establish the identity of the suspect, 47-year-old Loh Suan Lit, a Singaporean citizen who had been unemployed since 2015. Further investigations showed that Loh had gone to Malaysia, so the [Singapore Police Force](/wiki/Singapore_Police_Force) sought the help of the [Royal Malaysia Police](/wiki/Royal_Malaysia_Police) to trace his whereabouts, and they also placed Loh on the wanted list for the murder of Tan Poh Huat. On 24 February 2016, the Singapore Police Force were notified by the Malaysian authorities that Loh had crossed the Malaysian border and was on the way to Singapore. The investigating officers were able to approach Loh at the [Woodlands Checkpoint](/wiki/Woodlands_Checkpoint), where he was arrested and brought into police custody. Two days later, on 26 February 2016, 47-year-old Loh Suan Lit was officially charged with murder at a district court for Tan's death. On the same day of Loh's indictment, 50-year-old part-time coffee shop worker Khor Tzoong Meng was also charged in court for murdering 38-year-old logistics worker Ang Kim Keat at [Hougang](/wiki/Hougang) two days before. Khor was eventually sentenced to eight years' imprisonment for manslaughter in July 2017. If Loh was found guilty of murder under Singaporean law, he would be facing the [death penalty](/wiki/Capital_punishment_in_Singapore). After his indictment, Loh was brought back to the temple on 2 March 2016, where he would re-enact how he broke into the temple to commit burglary, which was likely what led to the murder of Tan Poh Huat that night. He also led the police to a hardware store where he purchased the tools he was said to have used to commit the burglary that ultimately led to Tan's murder, which became known as the \"Choa Chu Kang Combined Temple murder\" in Singaporean media. On 4 March 2016, Loh was remanded to the medical centre in [Changi Prison](/wiki/Changi_Prison) for psychiatric evaluation. ## Loh Suan Lit's confession After his arrest, Loh Suan Lit confessed to the murder and gave his account of what happened, although his account was affected by poor memory recall, and some details were pieced together with CCTV evidence and police investigation findings. According to Loh, who formerly worked as a cleaner at [National University Hospital](/wiki/National_University_Hospital) until October 2015, he was a friend of Tan Poh Huat, and they played mahjong together. He stated he never meant to murder Tan. Loh admitted that on 13 February 2016, when he came to Choa Chu Kang Combined Temple to pray, he saw the donation boxes and decided that he would steal both some cash from the boxes and the gold chains around the Chinese deity statues, since he did not have a job for four months and needed money. After he left the temple, Loh went to a hardware store in Marsiling to buy a hammer, saw, screwdriver and chisel. However, as he came back to the temple a second time on the night and inspected the donation boxes, Loh found that the boxes were made of metal and a lot of sound might be made should he attempt to force open the boxes. Loh went to another hardware store in Teck Whye to buy a rubber stopper, which he could fit in the hammer to lessen the noise. The hammer and rubber stopper were certified to be the murder weapons used by Loh, since the bruises on Tan's head, shaped in concentric circles, matched the ones found on the rubber stopper. Later that night, with his tools hidden in his bag, Loh headed to the temple to attempt to commit burglary, but he went to a nearby coffee shop after seeing that there were still people at the temple. While waiting for the last batch of people to leave, Loh watched a football match and also consumed some drugs to \"get high\". At around 2:30 AM the next morning, Loh returned to the temple, wearing a cap, gloves and mask to disguise himself. Unbeknownst to Loh, Tan was sleeping inside the temple. Loh broke into the temple and tried several times to force open the donation boxes. After several attempts, Loh failed to open the donation boxes and, having realised he was making too much noise, Loh decided to stop and leave the temple. Just when he was leaving, Loh was caught red-handed by Tan, who was awakened by the sounds made by Loh and happened to be inspecting the temple when he sighted Loh. According to Loh, Tan shouted \"Oi!\" at him before he rushed towards Loh, who panicked and raised his hammer to hit Tan. After Tan collapsed, Loh repeatedly hit Tan's head with the hammer until he fell unconscious. Loh quickly escaped from the temple, leaving Tan's body behind. Loh also disposed of the tools he used for his burglary attempt. Five days after committing the murder, Loh left the country for [Malaysia](/wiki/Malaysia), where he looked for an uncle in [Muar](/wiki/Muar_(town)), [Johor](/wiki/Johor), as he wanted to borrow money to pay for his mother's cancer treatment. After failing to do so, Loh returned to Singapore after another five days, leading to his arrest. ## Trial of Loh Suan Lit On 15 January 2018, 49-year-old Loh Suan Lit stood trial at the [High Court](/wiki/High_Court_of_Singapore) for killing Tan Poh Huat in February 2016. By then, Loh's murder charge had been reduced to a lesser offence of culpable homicide not amounting to murder, also known as manslaughter in Singaporean legal terms. The reduction of the murder charge allowed Loh to escape the [death penalty](/wiki/Capital_punishment_in_Singapore) for murdering Tan, but he faced a possible sentence of either [life imprisonment](/wiki/Life_imprisonment_in_Singapore) or up to 20 years' jail, in addition to [caning](/wiki/Caning_in_Singapore), for manslaughter. Loh pleaded guilty to one count of manslaughter and one count of burglary; the burglary charge was related to a separate case where Loh burgled a stall at a [hawker centre](/wiki/Hawker_centre) and stole cash and jewelry worth over S$800. Loh was represented by Sunil Sudheesan, while the prosecution was led by Tan Wen Hsien, and the trial was presided over by Justice Chua Lee Ming of the High Court. The prosecution sought a jail term of 12 years with six strokes of the cane for the manslaughter charge and two years for the burglary charge. They argued that there was no valid reason for Loh to resort to violence by assaulting a defenceless and unarmed man. Loh's \"pre-emptive\" strike was both deliberate and calculated, and a harsh sentence was warranted. Loh's lawyer Sudheesan requested that Loh serve eight years for the manslaughter offence and another two years for the burglary charge. He stated that Loh was remorseful for his actions and readily accepted to serve a long sentence for the crime, and that the attack itself was not premeditated; Loh only did it out of panic and never had the intention to kill Tan. On the same date that Loh submitted his guilty plea, Justice Chua returned with his verdict, sentencing 49-year-old Loh Suan Lit to 12 years in prison and six strokes of the cane for one count of manslaughter, and two years for one count of burglary. Justice Chua ordered the double jail terms to run consecutively and commence from the date of Loh's remand on 26 February 2016, effectively ordering Loh to serve a total of 14 years' imprisonment and six strokes of the cane. Delivering his verdict, Justice Chua stated that he accepted the defence's contention that the attack was unpremeditated and that Loh himself had acted out of panic when attacking Tan. Justice Chua stated that regardless, he could not ignore the \"brutal and vicious\" nature of the attack and the 93 injuries that Loh inflicted on Tan. Given that 49-year-old Loh had not reached his 50th birthday at the time of sentencing, he was still liable to undergo caning (caning was not legally permitted for criminals aged 50 and above at the time of their sentencing). Loh did not [appeal](/wiki/Appeal) his sentence, and he is currently serving his sentence at [Changi Prison](/wiki/Changi_Prison) since February 2016. Loh's sentence of 14 years still carries the possibility of [parole](/wiki/Parole) with good behavior, provided that he serves at least two-thirds of his jail term (equivalent to nine years and four months). ## Aftermath In March 2019, Singaporean crime show *[Crimewatch](/wiki/Crimewatch_(Singaporean_TV_series))* re-enacted the Choa Chu Kang Combined Temple murder, and it depicted the investigations that led to the arrest and conviction of Loh Suan Lit. In this re-enactment, the victim Tan Poh Huat's name was changed to Soh Boon Teck to protect his identity, while the perpetrator was addressed by his real name Loh Suan Lit. The forensic pathologist Dr George Paul, who conducted the autopsy, portrayed himself in this re-enactment. In June 2022, local writer Foo Siang Luen wrote the second volume of his real-life crime book, *Justice Is Done*, which was published by the [Singapore Police Force](/wiki/Singapore_Police_Force) (including a digital download-for-free e-book version), 17 years after Foo wrote the first volume. The book recorded some of the gruesome murder cases encountered and solved by police through the years between 2005 and 2016, and the 2016 case of the Choa Chu Kang Combined Temple murder was covered as one of these cases. - [Caning in Singapore](/wiki/Caning_in_Singapore) - [List of major crimes in Singapore](/wiki/List_of_major_crimes_in_Singapore)\n",
  "language": "en",
  "processed_at": "2026-01-12T10:03:24.542368",
  "title": "Choa Chu Kang Combined Temple murder",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Choa_Chu_Kang_Combined_Temple_murder"
}