{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:03:28.915206"
  },
  "content": "Housing estate in Singapore **Chong Pang** ([Chinese](/wiki/Chinese_language): 忠邦城; [pinyin](/wiki/Pinyin): *Lín Zhōng Bāng*) is a housing estate located in the subzone of Yishun West along the [Sembawang](/wiki/Sembawang)–Yishun boundary in the town of [Yishun](/wiki/Yishun), [Singapore](/wiki/Singapore). It was named after the former Chong Pang village. It has precincts of Neighbourhood 1, part of Neighbourhood 7 and private residential areas along Sembawang Road. ## History ### Chong Pang Village Chong Pang was the name of a former village which was located in the north of Singapore, near the site of the present day [Sembawang MRT station](/wiki/Sembawang_MRT_station). Prior to 1956, Chong Pang Village was originally known as Westhill Village (or Westhill estate). Part of Nee Soon Estate, the village was situated at the twelfth milestone at [Seletar](/wiki/Seletar), opposite the Sembawang Aerodrome. During the late 1930s and early 1940s, the village had the highest concentration of Indians in Singapore, many of whom were employees of the British Naval Base just outside the village. The land was owned by Lim Chong Pang ([Chinese](/wiki/Simplified_Chinese_characters): 林忠邦; [pinyin](/wiki/Pinyin): *Lín Zhōng Bāng*), son of [Lim Nee Soon](/wiki/Lim_Nee_Soon), who drew up small plots of land and leased them at a cheap rate of 50 cents per month. It was settled by rubber tappers (who otherwise had to cycle a long way) and vegetable farm workers. Although the rents were cheap, the number of families did not exceed 100 during the 1930s and 1940s. About 60 percent of the population were Indians. The rest were Chinese planters, rubber tappers and hawkers, along with a handful of Malay fishermen. In 1956, it was renamed Chong Pang village in honour of Lim Chong Pang for his public service to Singapore. During the late 1960s, there were more than 100 families residing village. Many of these consisted of Indian bachelor employees from the nearby [Singapore Naval Base](/wiki/Singapore_Naval_Base) in [Sembawang](/wiki/Sembawang), who returned with their brides from [India](/wiki/India). The 1971 British withdrawal from Singapore and the subsequent retrenchment led to many residents being left jobless. The Indians were particularly affected and most of them returned to India leading to a dwindling Indian community. Since then, the village had a predominantly Chinese population with small communities of Indians and Malays. ### Present day The present day housing estate, Chong Pang City, is located in [Yishun](/wiki/Yishun). In June 2019, Chong Pang City Merchant & Hawker's Association launched the first E-Marketplace for an HDB Neighbourhood Centre for its businesses on Chong Pang City to begin their digital transformation. The E-Marketplace is known as TheLocalMart. There is also Chong Pang Combined Temple which consists of five Chinese temples and is located at Yishun Ring Road; the temple was completed in 1995. Currently, there is a renovation going on in Chong Pang Community Club. It is expected to span up to 9000 Square metre or 0.9ha and has a swimming complex, 58 food stalls and 123 market stalls after renovation. This [Singapore](/wiki/Singapore) location article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T10:03:28.914766",
  "title": "Chong Pang",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Chong_Pang"
}