{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:03:37.178246"
  },
  "content": "External territory of AustraliaPlace in Australia 10°29′24″S 105°37′39″E﻿ / ﻿10.49000°S 105.62750°E﻿ / -10.49000; 105.62750 **Christmas Island**, officially the **Territory of Christmas Island**, is an [Australian external territory](/wiki/States_and_territories_of_Australia#External_territories) in the [Indian Ocean](/wiki/Indian_Ocean) comprising the island of the same name. It is about 350 kilometres (190 nautical miles) south of [Java](/wiki/Java) and [Sumatra](/wiki/Sumatra) and about 1,550 km (840 nmi) north-west of the closest point on the [Australian mainland](/wiki/Mainland_Australia). It has an area of 135 square kilometres (52 sq mi). Christmas Island's geographic isolation and history of minimal human disturbance has led to a high level of [endemism](/wiki/Endemism) among its flora and fauna, which is of interest to scientists and naturalists. The territory derives its name from its discovery on [Christmas Day](/wiki/Christmas) 1643 by Captain [William Mynors](/wiki/William_Mynors). The first European to sight Christmas Island was Richard Rowe of the *Thomas* in 1615. Mynors gave it its name. It was first settled in the late 19th century, after abundant [phosphate](/wiki/Phosphate) deposits were found (originally deposited as [guano](/wiki/Guano)) which led Britain to annex the island in 1888 and begin commercial mining in 1899. The Japanese invaded the island in 1942 to secure its phosphate deposits. After the end of Japanese occupation, the island's administration was restored to Singapore, but it was transferred to Australia in 1958, where it has remained since. Christmas Island had a population of 1,692 as of 2021[update], with most living in settlements on its northern edge. The main settlement is [Flying Fish Cove](/wiki/Flying_Fish_Cove), known simply as The Settlement. Other settlements include [Poon Saan](/wiki/Poon_Saan), [Drumsite](/wiki/Drumsite), and [Silver City](/wiki/Silver_City,_Christmas_Island). Historically, [Asian Australians](/wiki/Asian_Australians) of [Chinese](/wiki/Chinese_Australians), [Malay](/wiki/Malays_(ethnic_group)), and [Indian](/wiki/Indian_Australians) descent were the majority of the population. Today, around two-thirds of the island's population is estimated to have [Straits Chinese](/wiki/Peranakans#Straits_Chinese) origin (though just 22.2% of the population declared Chinese ancestry in 2021), with significant numbers of Malays and [European Australians](/wiki/European_Australians) and smaller numbers of Straits Indians and Eurasians. Several languages are in use, including English, [Malay](/wiki/Malay_language), and various Chinese dialects. Religious beliefs vary geographically. The Anglo-Celtic influence in the capital is closely tied to Catholicism, whereas Buddhism is common in Poon Saan, and Sunni Islam is generally observed in the shoreline [water village](/wiki/Malay_Kampong_Group) where the Malays live. The majority (63%) of the island is made up of [Christmas Island National Park](/wiki/Christmas_Island_National_Park), which features several areas of primary [monsoonal](/wiki/Monsoon) forest. ## History ### First visits by Europeans, 1643 The first European to sight the island was Richard Rowe of the *Thomas* in 1615. Captain [William Mynors](/wiki/William_Mynors) of the [East India Company](/wiki/East_India_Company) vessel *Royal Mary* named the island when he sailed past it on Christmas Day in 1643. The island was included on English and Dutch navigation charts early in the 17th century, but it was not until 1666 that a map published by Dutch cartographer [Pieter Goos](/wiki/Pieter_Goos) included the island. Goos labelled the island \"Mony\" or \"Moni\", the meaning of which is unclear. English navigator [William Dampier](/wiki/William_Dampier), aboard the privateer [Charles Swan](/wiki/Charles_Swan_(pirate))'s ship *Cygnet*, made the earliest recorded visit to the sea around the island in March 1688. In writing his account, he found the island uninhabited. Dampier was trying to reach [the Cocos Islands](/wiki/Cocos_(Keeling)_Islands) from [New Holland](/wiki/New_Holland_(Australia)). His ship was blown off course in an easterly direction, arriving at Christmas Island 28 days later. Dampier landed on the west coast, at \"the [Dales](/wiki/The_Dales_(Christmas_Island))\". Two of his crewmen became the first Europeans to set foot on Christmas Island. Captain Daniel Beeckman of the *Eagle* passed the island on 5 April 1714, chronicled in his 1718 book, *A Voyage to and from the Island of Borneo, in the East-Indies*. ### Exploration and annexation The first attempt at exploring the island was made in 1857 by Captain Sidney Grenfell of the frigate [HMS *Amethyst*](/wiki/HMS_Amethyst_(1844)). An expedition crew were sent ashore with instructions to reach the summit of the plateau, but they failed to find a route up the inland cliff and were forced to turn back. During the [1872–1876 *Challenger* expedition](/wiki/Challenger_expedition) to Indonesia, naturalist [John Murray](/wiki/John_Murray_(oceanographer)) carried out extensive surveys. In 1886, Captain [John Maclear](/wiki/John_Maclear) of [HMS *Flying Fish*](/wiki/HMS_Flying_Fish_(1873)), having discovered an anchorage in a bay that he named \"Flying Fish Cove\", landed a party and made a small collection of the flora and fauna. In the next year, [Pelham Aldrich](/wiki/Pelham_Aldrich), on board [HMS *Egeria*](/wiki/HMS_Egeria_(1873)), visited the island for 10 days, accompanied by [J. J. Lister](/wiki/Joseph_Jackson_Lister_(naturalist)), who gathered a larger biological and mineralogical collection. Among the rocks then obtained and submitted to Murray for examination were many of nearly pure [phosphate of lime](/wiki/Calcium_pyrophosphate). This discovery led to annexation of the island by the British Crown on 6 June 1888. ### Settlement and exploitation Soon afterwards, a small settlement was established in Flying Fish Cove by [G. Clunies-Ross](/wiki/Clunies-Ross_Family#George_Clunies-Ross), the owner of the [Cocos (Keeling) Islands](/wiki/Cocos_(Keeling)_Islands) some 900 kilometres (560 mi) to the southwest, to collect timber and supplies for the growing industry on Cocos. In 1897 the island was visited by [Charles W. Andrews](/wiki/Charles_William_Andrews), who did extensive research on the natural history of the island, on behalf of the [British Museum](/wiki/British_Museum). Phosphate mining began in 1899 using indentured workers from Singapore, [British Malaya](/wiki/British_Malaya), and China. John Davis Murray, a mechanical engineer and recent graduate of [Purdue University](/wiki/Purdue_University), was sent to supervise the operation on behalf of the Phosphate Mining and Shipping Company. Murray was known as the \"King of Christmas Island\" until 1910, when he married and settled in London. The island was administered jointly by the British Phosphate commissioners and district officers from the United Kingdom [Colonial Office](/wiki/Colonial_Office) through the [Straits Settlements](/wiki/Straits_Settlements), and later the [Crown Colony of Singapore](/wiki/Colony_of_Singapore). Hunt (2011) provides a detailed history of Chinese indentured labour on the island during those years. In 1922, scientists unsuccessfully attempted to view [a solar eclipse in late September](/wiki/Solar_eclipse_of_September_21,_1922) from the island to test [Albert Einstein](/wiki/Albert_Einstein)'s [theory of relativity](/wiki/Theory_of_relativity). ### Japanese invasion From the outbreak of the [South-East Asian theatre of World War II](/wiki/South-East_Asian_theatre_of_World_War_II) in December 1941, Christmas Island was a target for Japanese occupation because of its rich phosphate deposits. A naval gun was installed under a British officer, four [non-commissioned officers](/wiki/Non-commissioned_officer) (NCOs) and 27 Indian soldiers. The first attack was carried out on 20 January 1942 by the [Japanese submarine *I-59*](/wiki/Japanese_submarine_I-159), which torpedoed the Norwegian freighter *Eidsvold*. The vessel drifted and eventually sank off West White Beach. Most of the European and Asian staff and their families were evacuated to [Perth](/wiki/Perth). In late February and early March 1942, there were two aerial bombing raids. Shelling from a Japanese naval group on 7 March led the [district officer](/wiki/District_officer) to hoist the [white flag](/wiki/White_flag). But after the Japanese naval group sailed away, the British officer raised the [Union Flag](/wiki/Union_Jack) once more. During the night of 10–11 March, mutinous Indian troops, abetted by [Sikh](/wiki/Sikhs) policemen, killed an officer and the four British NCOs in their quarters as they were sleeping. \"Afterwards all Europeans on the island, including the district officer, who governed it, were lined up by the Indians and told they were going to be shot. But after a long discussion between the district officer and the leaders of the mutineers the executions were postponed and the Europeans were confined under armed guard in the district officer's house\". At dawn on 31 March 1942, a dozen Japanese bomber aircraft launched an attack, destroying the radio station. The same day, a Japanese fleet of nine vessels arrived, and the island was surrounded. About 850 men of the Japanese 21st and 24th [Special Base Forces](/wiki/Imperial_Japanese_Navy_land_forces) and 102nd Construction Unit came ashore at Flying Fish Cove and occupied the island. They rounded up the workforce, most of whom had fled to the jungle. Sabotaged equipment was repaired, and preparations were made to resume the mining and export of phosphate. Only 20 men from the 21st Special Base Force were left as a garrison. Isolated acts of sabotage and the torpedoing of the cargo ship *Nissei Maru* at the wharf on 17 November 1942 meant that only small amounts of phosphate were exported to Japan during the occupation. In November 1943, over 60% of the island's population were evacuated to [Surabaya](/wiki/Surabaya) prison camps, leaving a population of just under 500 Chinese and Malays and 15 Japanese to survive as best they could. In October 1945, [HMS *Rother*](/wiki/List_of_River-class_frigates) re-occupied Christmas Island. After the war, seven mutineers were traced and prosecuted by the Military Court in Singapore. In 1947, five of them were [sentenced to death](/wiki/Capital_punishment). However, following representations made by the newly independent government of India, their sentences were reduced to [penal servitude](/wiki/Penal_labour) for [life](/wiki/Life_imprisonment). ### Transfer to Australia The United Kingdom transferred sovereignty of Christmas Island to Australia at the latter's request, with a $20 million payment from the Australian government to [Singapore](/wiki/Colony_of_Singapore) as compensation for the loss of earnings from the phosphate revenue. The United Kingdom's Christmas Island Act was given royal assent on 14 May 1958 by Queen Elizabeth II, enabling Britain to transfer authority over Christmas Island from Singapore to Australia by an order-in-council. Australia's Christmas Island Act was passed in September 1958, and the island was officially placed under the authority of the Commonwealth of Australia on 1 October 1958. This transfer did not see any process involving the local population, who could remain Singaporean citizens or obtain Australian citizenship. Links between Singapore and Christmas Island have occasionally reemerged in Singaporean politics and in [Australia–Singapore relations](/wiki/Australia%E2%80%93Singapore_relations). Under Commonwealth Cabinet Decision 1573 of 9 September 1958, D.E. Nickels was appointed the first official representative of the new territory. In a media statement on 5 August 1960, the [minister for territories](/wiki/Minister_for_Regional_Development,_Local_Government_and_Territories), [Paul Hasluck](/wiki/Paul_Hasluck), said, among other things, that, \"His extensive knowledge of the Malay language and the customs of the Asian people ... has proved invaluable in the inauguration of Australian administration ... During his two years on the island he had faced unavoidable difficulties ... and constantly sought to advance the island's interests.\" [John William Stokes](/wiki/John_William_Stokes) succeeded Nickels and served from 1 October 1960 to 12 June 1966. On his departure, he was lauded by all sectors of the island community. In 1968, the official secretary was retitled an administrator and, since 1997, Christmas Island and the [Cocos (Keeling) Islands](/wiki/Cocos_(Keeling)_Islands) together are called the [Australian Indian Ocean Territories](/wiki/Australian_Indian_Ocean_Territories) and share a single administrator resident on Christmas Island. The village of [Silver City](/wiki/Silver_City,_Christmas_Island) was built in the 1970s, with aluminium-clad houses that were supposed to be [cyclone](/wiki/Cyclone)-proof. The [2004 Indian Ocean earthquake and tsunami](/wiki/2004_Indian_Ocean_earthquake_and_tsunami), centred off the western shore of [Sumatra](/wiki/Sumatra) in Indonesia, resulted in no reported casualties, but some swimmers were swept some 150 metres (490 ft) out to sea for a time before being swept back in. ### Refugee and immigration detention From the late 1980s and early 1990s, boats carrying [asylum seekers](/wiki/Asylum_seeker), mainly departing from Indonesia, began landing on the island. In 2001, Christmas Island was the site of the [*Tampa* controversy](/wiki/Tampa_affair), in which the Australian government stopped a Norwegian ship, [MV *Tampa*](/wiki/MV_Tampa), from disembarking 438 rescued asylum-seekers. The ensuing standoff and the associated political reactions in Australia were a major issue in the [2001 Australian federal election](/wiki/2001_Australian_federal_election). The [Howard government](/wiki/Howard_government) operated the \"[Pacific Solution](/wiki/Pacific_Solution)\" from 2001 to 2007, excising Christmas Island from [Australia's migration zone](/wiki/Australian_migration_zone) so that asylum seekers on the island could not apply for [refugee status](/wiki/Refugee). Asylum seekers were relocated from Christmas Island to [Manus Island](/wiki/Manus_Island) and [Nauru](/wiki/Nauru). In 2006, an [immigration detention centre](/wiki/North_West_Point_Immigration_Detention_Centre), containing approximately 800 beds, was constructed on the island for the [Department of Immigration and Multicultural Affairs](/wiki/Department_of_Immigration_and_Multicultural_Affairs_(2006%E2%80%9307)). Originally estimated to cost A$276 million, the final cost was over $400 million. In 2007, the [Rudd government](/wiki/Rudd_government_(2007%E2%80%932010)) decommissioned [Manus Regional Processing Centre](/wiki/Manus_Regional_Processing_Centre) and [Nauru detention centre](/wiki/Nauru_Regional_Processing_Centre); processing would then occur on Christmas Island itself. In December 2010, 48 asylum-seekers died just off the coast of the island in what became known as the [Christmas Island boat disaster](/wiki/2010_Christmas_Island_boat_disaster) when their boat hit the rocks near Flying Fish Cove, and then smashed against nearby cliffs. In the case [*Plaintiff M61/2010E v Commonwealth of Australia*](/wiki/Plaintiff_M61/2010E_v_Commonwealth), the [High Court of Australia](/wiki/High_Court_of_Australia) ruled, in a 7–0 joint judgment, that asylum seekers detained on Christmas Island were entitled to the protections of the [Migration Act.](/wiki/Migration_Act_1958) Accordingly, the Commonwealth was obliged to afford asylum seekers a minimum of procedural fairness when assessing their claims. As of 20 June 2013[update], after the interception of four boats in six days, carrying 350 people, the Immigration Department stated that there were 2,960 \"irregular maritime arrivals\" being held in the island's five detention facilities, which exceeded not only the \"regular operating capacity\" of 1,094 people, but also the \"contingency capacity\" of 2,724. The Christmas Island Immigration Reception and Processing Centre closed in September 2018. The Morrison government announced it would re-open the centre in February the following year, after Australia's parliament passed legislation giving sick asylum seekers easier access to mainland hospitals. In the early days of the [COVID-19 pandemic](/wiki/COVID-19_pandemic), the government opened parts of the Immigration Reception and Processing Centre to be used as a quarantine facility to accommodate Australian citizens who had been in [Wuhan](/wiki/Wuhan), the point of origin of the pandemic. The evacuees arrived on 3 February. They left 14 days later to their homes on the mainland. ## Geography The island is about 19 kilometres (12 mi) in greatest length and 14.5 km (9.0 mi) in breadth. The total land area is 135 square kilometres (52 sq mi), with 138.9 km (86.3 mi) of coastline. Steep cliffs along much of the coast rise abruptly to a central plateau. Elevation ranges from sea level to 361 m (1,184 ft) at [Murray Hill](/wiki/Murray_Hill,_Christmas_Island). The island is mainly [tropical rainforest](/wiki/Tropical_rainforest), 63% of which is national parkland. The narrow fringing [reef](/wiki/Reef) surrounding the island poses a maritime hazard. Christmas Island lies 2,600 kilometres (1,600 mi) northwest of [Perth](/wiki/Perth), Western Australia, 350 km (220 mi) south of Indonesia, 975 km (606 mi) east-northeast of the Cocos (Keeling) Islands, and 2,748 km (1,708 mi) west of [Darwin](/wiki/Darwin,_Northern_Territory), Northern Territory. Its closest point to the Australian mainland is 1,550 km (960 mi) from the town of [Exmouth](/wiki/Exmouth,_Western_Australia), Western Australia. Only small parts of the shoreline are easily accessible. The island's perimeter is dominated by sharp cliff faces, making many of the island's beaches difficult to get to. Some of the easily accessible beaches include Flying Fish Cove (main beach), Lily Beach, Ethel Beach, and Isabel Beach, while the more difficult beaches to access include Greta Beach, Dolly Beach, Winifred Beach, Merrial Beach, and West White Beach, which all require a vehicle with four wheel drive and a difficult walk through dense rainforest. ### Geology The [volcanic island](/wiki/Volcanic_island) is the flat summit of an underwater mountain more than 4,500 metres (14,800 ft) high, which rises from about 4,200 m (13,780 ft) below the sea and only about 300 m (984 ft) above it. The mountain was originally a [volcano](/wiki/Volcano), and some [basalt](/wiki/Basalt) is exposed in places such as [The Dales](/wiki/The_Dales_(Christmas_Island)) and Dolly Beach, but most of the surface rock is [limestone](/wiki/Limestone) accumulated from [coral](/wiki/Coral) growth. The [karst](/wiki/Karst) terrain supports numerous [anchialine caves](/wiki/Anchialine_system). The summit of this mountain peak is formed by a succession of [Tertiary](/wiki/Tertiary_period) limestones ranging in age from the [Eocene](/wiki/Eocene) or [Oligocene](/wiki/Oligocene) up to recent reef deposits, with intercalations of volcanic rock in the older beds. ### Marine Park Reefs near the islands have healthy [coral](/wiki/Coral) and are home to several rare species of marine life. The region, along with the Cocos (Keeling) Islands reefs, have been described as \"Australia's [Galapagos Islands](/wiki/Gal%C3%A1pagos_Islands)\". In the 2021 budget the Australian Government committed A$39.1 million to create two new marine parks off Christmas Island and the Cocos (Keeling) Islands. The parks will cover up to 740,000 square kilometres (290,000 sq mi) of Australian waters. After months of consultation with local people, both parks were approved in March 2022, with a total coverage of 744,000 square kilometres (287,000 sq mi). The park will help to protect spawning of [bluefin tuna](/wiki/Bluefin_tuna) from illegal international fishers, but local people will be allowed to practise fishing sustainably inshore in order to source food. ### Climate Christmas Island lies near the southern edge of the equatorial region. It has a [tropical monsoon climate](/wiki/Tropical_monsoon_climate) ([Köppen](/wiki/K%C3%B6ppen_climate_classification) *Am*) and temperatures vary little throughout the year. The highest temperature is usually around 29 °C (84 °F) in March and April, while the lowest temperature is 23 °C (73 °F) and occurs in August. There is a dry season from July to October with only occasional showers. The wet season is between November and June and includes [monsoons](/wiki/Monsoon), with downpours of rain at random times of the day. [Tropical cyclones](/wiki/Tropical_cyclone) also occur in the wet season, bringing very strong winds, heavy rain, wave action, and [storm surge](/wiki/Storm_surge). Climate data for [Christmas Island Airport](/wiki/Christmas_Island_Airport) (1991–2020 normals, extremes 1972–present)MonthJanFebMarAprMayJunJulAugSepOctNovDecYearRecord high °C (°F)31.4 (88.5)31.5 (88.7)31.5 (88.7)31.4 (88.5)30.7 (87.3)29.8 (85.6)29.3 (84.7)29.5 (85.1)30.9 (87.6)31.4 (88.5)31.8 (89.2)31.5 (88.7)31.8 (89.2)Mean daily maximum °C (°F)28.1 (82.6)28.1 (82.6)28.3 (82.9)28.3 (82.9)27.9 (82.2)27.1 (80.8)26.2 (79.2)26.1 (79.0)26.2 (79.2)26.9 (80.4)27.4 (81.3)27.8 (82.0)27.4 (81.3)Daily mean °C (°F)25.5 (77.9)25.6 (78.1)25.8 (78.4)26.0 (78.8)26.0 (78.8)25.3 (77.5)24.5 (76.1)24.2 (75.6)24.3 (75.7)24.9 (76.8)25.3 (77.5)25.3 (77.5)25.2 (77.4)Mean daily minimum °C (°F)22.9 (73.2)23.0 (73.4)23.3 (73.9)23.7 (74.7)24.0 (75.2)23.5 (74.3)22.7 (72.9)22.3 (72.1)22.3 (72.1)22.8 (73.0)23.1 (73.6)22.8 (73.0)23.0 (73.4)Record low °C (°F)18.8 (65.8)18.4 (65.1)18.6 (65.5)18.3 (64.9)19.3 (66.7)18.3 (64.9)16.2 (61.2)17.7 (63.9)16.7 (62.1)18.2 (64.8)18.0 (64.4)17.1 (62.8)16.2 (61.2)Average rainfall mm (inches)280.6 (11.05)353.7 (13.93)321.5 (12.66)244.2 (9.61)180.1 (7.09)171.7 (6.76)97.2 (3.83)38.5 (1.52)45.4 (1.79)61.9 (2.44)150.0 (5.91)216.5 (8.52)2,147.8 (84.56)Average rainy days (≥ 1 mm)15.116.917.815.010.710.28.16.14.24.27.411.8127.5Average afternoon [relative humidity](/wiki/Relative_humidity) (%)79838283818181798079797880Source: Bureau of Meteorology ## Demographics As of the [2021 Australian census](/wiki/2021_Australian_census), the population of Christmas Island was 1,692. 22.2% of the population had Chinese ancestry (up from 18.3% in 2001), 17.0% had generic Australian ancestry (11.7% in 2001), 16.1% had Malay ancestry (9.3% in 2001), 12.5% had English ancestry (8.9% in 2001), and 3.8% of the population was of Indonesian origin. Most were born on Christmas Island. 40.8% of people were born in Australia. The next most common country of birth was Malaysia at 18.6%. 29.3% of the population spoke English as their family language, while 18.4% spoke Malay, 13.9% spoke Mandarin Chinese, 3.7% Cantonese, and 2.1% [Southern Min](/wiki/Southern_Min) (Minnan). Additionally, there are small local populations of [Malaysian Indians](/wiki/Malaysian_Indians) and Indonesians. The [2016 Australian census](/wiki/2016_Australian_census) recorded that the population of Christmas Island was 40.5% female and 59.5% male, while in 2011 the figures had been 29.3% female and 70.7% male. In contrast, the 2021 figures for the whole of Australia were 50.7% female, 49.3% male. Since 1998 there has been no provision for childbirth on the island; expectant mothers travel to mainland Australia approximately one month before their expected due date to give birth. ### Ethnicity Historically, the majority of Christmas Islanders were those of Chinese, Malay, and Indian origins, the initial permanent settlers. Today, the plurality of residents are [Chinese](/wiki/Malaysian_Chinese), with significant numbers of European Australians and [Malays](/wiki/Malaysian_Malays) as well as a smaller [Indian](/wiki/Malaysian_Indians) community, alongside more recent Filipino arrivals. Since the turn of the 21st century and right up to the present, Europeans have mainly confined themselves to The Settlement, where there is a small supermarket and several restaurants; the Malays live in their coastal [kampong](/wiki/Malay_Kampong_Group); and the Chinese reside in [Poon Saan](/wiki/Poon_Saan) ([Cantonese](/wiki/Cantonese) for \"in the middle of the hill\"). ### Language The main languages spoken at home on Christmas Island, according to respondents, are English (28%), Mandarin (17%), and Malay (17%), with smaller numbers of speakers of Cantonese (4%) and [Hokkien](/wiki/Hokkien) (2%). 27% did not specify a language. While English is the [lingua franca](/wiki/Lingua_franca) on the island, many people do not speak it. In the [2016 census](/wiki/2016_Australian_census), while only 14% of residents reported speaking English \"not well or at all\", only 59% of residents reported either speaking only English or speaking English \"well or very well\", with 27% not answering the question. ### Religion Religious practices differ by geography across the island and effectively correspond to the island's three primary settlements: the capital (known simply as The Settlement), the Cantonese village [Poon Saan](/wiki/Poon_Saan), and the Malay water village ([which is often referred to as the Kampong](/wiki/Malay_Kampong_Group)). Major religious affiliation in Christmas Island (2021): - 374 people or 22.1% are [Muslim](/wiki/Muslims), up from 19.3% in 2016 - 333 people or 19.7% are [Irreligion](/wiki/Irreligion), up from 15.3% in 2016 - 258 people or 15.2% are [Buddhists](/wiki/Buddhism), down from 18.2% in 2016 - 123 people or 7.3% are [Catholic](/wiki/Catholic_Church), down from 8.8% in 2016 - 35 people or 2.1% are [Anglican](/wiki/Anglicanism), down from 3.6% in 2016 #### The Settlement Due to the large numbers of English and Australians who make up the bulk of the island's capital, there is a strong Anglo-Celtic influence in The Settlement which has contributed to the strong presence of Catholicism. This has been further reinforced by recent Filipino arrivals. #### Poon Saan In the village of [Poon Saan](/wiki/Poon_Saan), which functions like the island's Chinatown, Buddhism is commonplace. Traditional Cantonese folk practices also are represented in this area. Chinese temples and shrines include seven Buddhist temples (like Guan Yin Monastery (观音寺) at Gaze Road), ten Taoist temples (like Soon Tian Kong (顺天宫) in South Point and Grants Well Guan Di Temple) and shrines dedicated to [Na Tuk Kong](/wiki/Na_Tuk_Kong) or [Datuk Keramat](/wiki/Datuk_Keramat) on the island. #### Kampong Malays who have settled on the island's edge in their shoreline [kampong](/wiki/Kampong) tend to follow Sunni Islam. The kampong has a mosque but it is in a state of decay and disrepair with rotting timbers and cracks. #### Other groups Other smaller and less geographically concentrated groups include [Anglicans](/wiki/Anglicanism) who make up 3.6%, [Uniting Church](/wiki/Uniting_Church_in_Australia) adherents who make up 1.2%, other [Protestants](/wiki/Protestantism) who make up 1.7%, and other Christian groups with 3.3%. Other religious communities collectively constitute 0.6% of the island's population. ## Holidays and festivals As an external territory of [Australia](/wiki/Australia), the two religious festivals which are official holidays are [Christmas](/wiki/Christmas) and [Easter](/wiki/Easter). Other non-official festivals include [Spring Festival](/wiki/Chinese_New_Year), [Lantern Festival](/wiki/Lantern_Festival), [Qingming Festival](/wiki/Qingming_Festival), [Zhong Yuan Festival](/wiki/Ghost_Festival), [Hari Raya Puasa](/wiki/Eid_al-Fitr), and [Hari Raya Haji](/wiki/Eid_al-Adha). ## Government Christmas Island is a non-self-governing [external territory](/wiki/States_and_territories_of_Australia#External_territory) of Australia as of February 2020[update], part of the [Australian Indian Ocean Territories](/wiki/Australian_Indian_Ocean_Territories) administered by the [Department of Infrastructure, Transport, Regional Development and Communications](/wiki/Department_of_Infrastructure,_Transport,_Regional_Development_and_Communications) (from 29 November 2007 until 14 September 2010, administration was carried out by the [Attorney-General's Department](/wiki/Attorney-General%27s_Department_(Australia)), and prior to this by the [Department of Transport and Regional Services](/wiki/Department_of_Infrastructure,_Regional_Development_and_Cities)). The legal system is under the authority of the [Governor-General of Australia](/wiki/Governor-General_of_Australia) and Australian law. An [administrator](/wiki/Administrator_(Australia)) appointed by the governor-general represents the [monarch](/wiki/Monarchy_of_Australia) and Australia and lives on the island. The territory falls under no formal state jurisdiction, but the [Western Australian](/wiki/Western_Australia) government provides many services as established by the Christmas Island Act. The Australian government provides services through the Christmas Island Administration and the Department of Infrastructure and Regional Development. Under the federal government's Christmas Island Act 1958, Western Australian laws are applied to Christmas Island; non-application or partial application of such laws is at the discretion of the federal government. The act also gives Western Australian courts judicial power over Christmas Island. Christmas Island remains constitutionally distinct from Western Australia, however; the power of the state to legislate for the territory is delegated by the federal government. The kind of services typically provided by a state government elsewhere in Australia are provided by departments of the Western Australian government, and by contractors, with the costs met by the federal government. A unicameral [Shire of Christmas Island](/wiki/Shire_of_Christmas_Island) with nine seats provides local government services and is elected by popular vote to serve four-year terms. Elections are held every two years, with four or five of the members standing for election. As of 2024[update] women held one of the nine seats in the Christmas Island Shire Council. Its second president was [Lillian Oh](/wiki/Lillian_Oh), from 1993 to 1995. The most recent local election took place on 18 October 2025 alongside elections in the Cocos (Keeling) Islands. In 2025 Shire Elections, the incumbent lost the vote, installing Tracey Krepp,Stephanie Lai and Gordon Thomson. Hafiz Mazli and Kee Heng Foo lost their positions as councillors. The overall majority of the Unity Party was lost, for the first time in many years resulting in Steven Pereira being elected as President, Swee \"Mel\" Tung as Deputy President at the October 20 special meeting. Christmas Island residents who are Australian citizens vote in Australian [federal elections](/wiki/Elections_in_Australia). Christmas Island residents are represented in the House of Representatives by the [Division of Lingiari](/wiki/Division_of_Lingiari) in the [Northern Territory](/wiki/Northern_Territory) and in the Senate by Northern Territory senators. At the [2019 federal election](/wiki/2019_Australian_federal_election), the [Labor Party](/wiki/Australian_Labor_Party) received majorities from Christmas Island electors in both the House of Representatives and the Senate. ### Defence and police While there is no permanent Australian military presence on Christmas Island, the [Royal Australian Navy](/wiki/Royal_Australian_Navy) and [Australian Border Force](/wiki/Australian_Border_Force) deploy *[Cape](/wiki/Cape-class_patrol_boat)* and [*Armidale*-class](/wiki/Armidale-class_patrol_boat) patrol boats to conduct surveillance and counter migrant smuggling patrols in adjacent waters. As of 2023,[update] the Navy's *Armidale*-class boats are in the process of being replaced by larger [*Arafura*-class offshore patrol vessels](/wiki/Arafura-class_offshore_patrol_vessel). Christmas Island is increasingly perceived as a strategic location for monitoring Chinese submarine activity in the Indian Ocean. The airfield on Christmas Island has a 2100m long runway, while that on [Cocos](/wiki/Cocos_(Keeling)_Islands) (West Island, 1,000 km, 620 mi to the west) is 2,400 m (7,900 ft) in length. Both airfields have scheduled jet services; however, the airfield on Cocos is being upgraded by the [Australian Defence Force](/wiki/Australian_Defence_Force) for the purpose of acting as a forward operating base for Australian surveillance and electronic warfare aircraft in the region. The [Australian Federal Police](/wiki/Australian_Federal_Police) provides community policing services to Christmas Island and also carries out duties related to immigration enforcement, the processing of visiting aircraft and ships, and in coordinating emergency operations. ### Residents' views > There are some people who have never wanted the detention centre here. There are some of those, like me, who think it's wrong to imprison people who have done no crime – the whole policy and legal structure that's evolved to detain asylum seekers is repugnant to some people like me. We're a minority. Other people don't like Muslims. Shire president Gordon Thomson speaking in a phone interview to *The Spinoff*. Residents find the system of administration frustrating, with the island run by bureaucrats in the federal government, but subject to the laws of Western Australia and enforced by federal police. There is a feeling of resignation that any progress on local issues is hampered by the confusing governance system. A number of islanders support self-governance, including ex-shire President Gordon Thompson, who also believes that a lack of news media to cover local affairs had contributed to political apathy among residents. ### Flag In early 1986, the Christmas Island Assembly held a design competition for an island flag; the winning design was adopted as the informal flag of the territory for over a decade, and in 2002 it was made the official [flag of Christmas Island](/wiki/Flag_of_Christmas_Island). At the centre of the flag is a yellow roundel showing an image of the island in green. ## Economy Phosphate mining had been the only significant economic activity, but in December 1987 the Australian government closed the mine. In 1991, the mine was reopened by Phosphate Resources Limited, a consortium that included many of the former mine workers as shareholders and is the largest contributor to the Christmas Island economy. With the support of the government, the $34 million [Christmas Island Casino and Resort](/wiki/Christmas_Island_Resort) opened in 1993 but was closed in 1998. The Australian government in 2001 agreed to support the creation of a commercial [spaceport](/wiki/Spaceport) on the island; however, this has not yet been constructed and appears that it will not proceed. The Howard government built a temporary immigration detention centre on the island in 2001 and planned to replace it with a larger, modern facility at North West Point until Howard's defeat in the [2007 elections](/wiki/2007_Australian_federal_election). Tourism is a growing industry on the island. The peak periods for tourism are the red crab migration in October–December and bird/nature week in August/September. In the University of Queensland study \"Strengthening sustainability of the Indian Ocean Territories (IOT) Marine Parks & local economy through collaborative world-class ecotourism\" with results released in May 2025, it was established there is significant community support for tourism on Christmas Island with 77% of the population wanting to see more tourists and 84% of residents believing that the development of tourism is crucial for the economic future of the island. ## Culture [Christmas Island cuisine](/wiki/Christmas_Island_cuisine) can best be described as an eclectic combination of traditional [Australian cuisine](/wiki/Australian_cuisine) and [Asian cuisine](/wiki/Asian_cuisine). The main local organisation that promotes and supports the status and interests of female Christmas Islanders is the [Christmas Island Women's Association](/wiki/Christmas_Island_Women%27s_Association) which was established in 1989 and is a member organisation of the [Associated Country Women of the World](/wiki/Associated_Country_Women_of_the_World). Christmas Island is well known for its biological diversity. There are many rare species of animals and plants on the island, making nature-walking a popular activity. Along with the diversity of species, many different types of caves exist, such as plateau caves, coastal caves, raised coastal caves and alcoves, sea caves, fissure caves, collapse caves, and basalt caves; most of these are near the sea and have been formed by the action of water. Altogether, there are approximately 30 caves on the island, with Lost Lake Cave, Daniel Roux Cave, and Full Frontal Cave being the most well-known. The many freshwater springs include Hosnies Spring Ramsar, which also has a [mangrove](/wiki/Mangrove) stand. The Dales is a [rainforest](/wiki/Rainforest) in the western part of the island and consists of seven deep valleys, all of which were formed by spring streams. Hugh's Dale waterfall is part of this area and is a popular attraction. The annual breeding migration of the [Christmas Island red crabs](/wiki/Christmas_Island_red_crab) is a popular event. Fishing is another common activity. There are many distinct species of fish in the oceans surrounding Christmas Island. Snorkelling and swimming in the ocean are two other activities that are extremely popular. Walking trails are also very popular, for there are many beautiful trails surrounded by extravagant [flora](/wiki/Flora) and [fauna](/wiki/Fauna). 63% of the island is covered by the [Christmas Island National Park](/wiki/Christmas_Island_National_Park). ### Sport Cricket and rugby league are the two main organised sports on the island. The Christmas Island Cricket Club was founded in 1959, and is now known as the Christmas Island Cricket and Sporting Club. [Aussie rules](/wiki/Australian_rules_football) was popular from 1995 to 2014 and games were played between the visiting Royal Australian Navy and the locals. There was also one international game representing Australia, which was played in Jakarta, Indonesia, in 2006 against the Jakarta Bintangs. Auskick was also presented for the kids and they participated in two years as represented in AFL games of half time entertainment between 2006 and 2010. In 2019 the club celebrated its 60-year anniversary. The club entered its first representative team into the WACA Country Week in 2020, where they were runners up in the F-division. [Rugby league](/wiki/Rugby_league) is growing in the island: the first game was played in 2016, and a local committee, with the support of [NRL Western Australia](/wiki/NRL_Western_Australia), is willing to organise matches with the nearby [Cocos Islands](/wiki/Cocos_(Keeling)_Islands) and to create a rugby league competition in the Indian Ocean region. Unlike [Norfolk Island](/wiki/Norfolk_Island), another external territory of Australia, Christmas Island does not participate in the [Commonwealth Games](/wiki/Commonwealth_Games) or the [Pacific Games](/wiki/Pacific_Games), though Pacific Games participation has been discussed. [Scuba diving](/wiki/Scuba_diving) and [snorkelling](/wiki/Snorkeling) are popular on the island, with many locals and visitors partaking in the activity. Historically, there was the Christmas Island Divers Association (now defunct) with a shed near the Old European Cemetery. Now there are two marine diving and snorkler operators, offering courses [SSI](/wiki/Scuba_Schools_International) and PADI, try dives, and boat trips. Most of the dive sites are on the northern coastline. During the swell season, the east coast is available via Ethel Beach Boat Ramp. Some notable dive sites include: Flying Fish Cove, the [*Eidsvold* wreck](/wiki/MV_Eidsvold_(1934)) (a phosphate ship torpedoed by the Japanese in 1942), Thundercliff Cave, West White Beach, Perpendicular Wall, Million Dollar Bommie, Chicken Farm, and Coconut Point. ## Flora and fauna Christmas Island was uninhabited until the late 19th century, allowing many species to evolve without human interference. Two-thirds of the island has been declared a [National Park](/wiki/National_park), which is managed by the Australian Department of Environment and Heritage through Parks Australia. Christmas Island contains unique species, both of flora and fauna, some of which are threatened or have become extinct. ### Flora The dense [rainforest](/wiki/Rainforest) has grown in the deep soils of the [plateau](/wiki/Plateau) and on the terraces. The forests are dominated by 25 tree species. Ferns, orchids, and vines grow on the branches in the humid atmosphere beneath the [canopy](/wiki/Canopy_(botany)). The 135 plant species include at least 18 [endemic species](/wiki/Endemism). The rainforest is in great condition despite the mining activities over the last 100 years. Areas that have been damaged by mining are now a part of an ongoing rehabilitation project. Christmas Island's endemic plants include the trees *[Arenga listeri](/wiki/Arenga_listeri)*, *[Pandanus elatus](/wiki/Pandanus_elatus)*, and *[Dendrocnide peltata](/wiki/Dendrocnide_peltata)* var. *murrayana*; the [shrubs](/wiki/Shrub) *[Abutilon listeri](/wiki/Abutilon_listeri)*, *[Colubrina pedunculata](/wiki/Colubrina_pedunculata)*, *[Grewia insularis](/wiki/Grewia_insularis)*, and *[Pandanus christmatensis](/wiki/Pandanus_christmatensis)*; the vines *[Hoya aldrichii](/wiki/Hoya_aldrichii)* and *[Zehneria alba](/wiki/Zehneria_alba)*; the [herbs](/wiki/Herbaceous_plant) *[Asystasia alba](/wiki/Asystasia_alba)*, *[Dicliptera maclearii](/wiki/Dicliptera_maclearii)*, and *[Peperomia rossii](/wiki/Peperomia_rossii)*; the grass *[Ischaemum nativitatis](/wiki/Ischaemum_nativitatis)*; the fern *[Asplenium listeri](/wiki/Asplenium_listeri)*; and the orchids *[Brachypeza archytas](/wiki/Brachypeza_archytas)*, *[Dendrobium nativitatis](/wiki/Dendrobium_nativitatis)*, *[Phreatia listeri](/wiki/Phreatia_listeri)*, and *[Zeuxine exilis](/wiki/Zeuxine_exilis)*. ### Fauna Two species of native rats, the [Maclear's](/wiki/Maclear%27s_rat) and [bulldog rats](/wiki/Bulldog_rat), have become extinct since the island was settled, while the [Javan rusa](/wiki/Javan_rusa) deer has been introduced. The endemic [Christmas Island shrew](/wiki/Christmas_Island_shrew) has not been seen since the mid-1980s and was recently declared extinct, while the [Christmas Island pipistrelle](/wiki/Christmas_Island_pipistrelle) (a small bat) is presumed to be extinct. The fruit bat (flying fox) species *[Pteropus natalis](/wiki/Christmas_Island_flying_fox)* is only found on Christmas Island; its epithet *natalis* is a reference to that name. The species is probably the last native mammal, and is an important pollinator and rainforest seed-disperser; the population is also in decline and under increasing pressure from land clearing and introduced pest species. The flying fox's low rate of reproduction (one pup each year) and high infant mortality rate makes it especially vulnerable, and its conservation status is [critically endangered](/wiki/Critically_endangered). Flying foxes are an 'umbrella' species helping forests regenerate and other species survive in stressed environments. The [land crabs](/wiki/Terrestrial_crab) and [seabirds](/wiki/Seabird) are the most noticeable fauna on the island. Christmas Island has been identified by [BirdLife International](/wiki/BirdLife_International) as both an [Endemic Bird Area](/wiki/Endemic_Bird_Area) and an [Important Bird Area](/wiki/Important_Bird_Area) because it supports five endemic species and five subspecies as well as over 1% of the world populations of five other seabirds. Twenty terrestrial and intertidal species of crab have been described here, of which thirteen are regarded as true land crabs, being dependent on the ocean only for larval development. Robber crabs, known elsewhere as [coconut crabs](/wiki/Coconut_crab), also exist in large numbers on the island. The annual [red crab](/wiki/Christmas_Island_red_crab) mass migration to the sea to spawn has been called one of the wonders of the natural world. This takes place each year around November – after the start of the [wet season](/wiki/Wet_season) and in synchronisation with the cycle of the [moon](/wiki/Moon). Once at the ocean, the mothers release the embryos where they can survive and grow until they are able to live on land. The island is a focal point for seabirds of various species. Eight species or [subspecies](/wiki/Subspecies) of seabirds nest on it. The most numerous is the [red-footed booby](/wiki/Red-footed_booby), which nests in colonies, using trees on many parts of the shore terrace. The widespread [brown booby](/wiki/Brown_booby) nests on the ground near the edge of the seacliff and inland cliffs. [Abbott's booby](/wiki/Abbott%27s_booby) (listed as [endangered](/wiki/Endangered_species)) nests on tall emergent trees of the western, northern and southern plateau rainforest, the only remaining nesting habitat for this bird in the world. Of the ten native land birds and shorebirds, seven are endemic species or subspecies. This includes the [Christmas island thrush](/wiki/Christmas_island_thrush) and the [Christmas imperial pigeon](/wiki/Christmas_imperial_pigeon). Some 86 migrant bird species have been recorded as visitors to the island. The [Christmas frigatebird](/wiki/Christmas_frigatebird) has nesting areas on the northeastern shore terraces. The more widespread [great frigatebirds](/wiki/Great_frigatebird) nest in semi-[deciduous](/wiki/Deciduous) trees on the shore terrace, with the greatest concentrations being in the North West and South Point areas. The [common noddy](/wiki/Brown_noddy) and two species of bosun or [tropicbirds](/wiki/Tropicbird) also nest on the island, including the golden bosun (*P. l. fulvus*), a subspecies of the [white-tailed tropicbird](/wiki/White-tailed_tropicbird) that is endemic to the island. Six species of butterfly are known to occur on Christmas Island. These are the Christmas swallowtail (*[Papilio memnon](/wiki/Papilio_memnon)*), striped albatross (*[Appias olferna](/wiki/Appias_olferna)*), Christmas emperor (*[Polyura andrewsi](/wiki/Polyura_andrewsi)*), king cerulean (*[Jamides bochus](/wiki/Jamides_bochus)*), lesser grass-blue (*[Zizina otis](/wiki/Zizina_otis)*), and Papuan grass-yellow (*[Eurema blanda](/wiki/Eurema_blanda)*). Insect species include the [yellow crazy ant](/wiki/Yellow_crazy_ant) (*Anoplolepis gracilipes*), introduced to the island and since subjected to attempts to destroy the [supercolonies](/wiki/Ant_supercolony) that emerged with aerial spraying of the insecticide [Fipronil](/wiki/Fipronil). ## Media Radio broadcasts to Christmas Island from Australia include [ABC Radio National](/wiki/Radio_National), [ABC Kimberley](/wiki/ABC_Kimberley), [Triple J](/wiki/Triple_J), and [Hit WA](/wiki/Hit_Western_Australia) (Formerly [Red FM](/wiki/Red_FM_(Australia))). All services are provided by satellite links from the mainland. [Broadband internet](/wiki/Broadband) became available to subscribers in urban areas in mid-2005 through the local internet service provider, [CIIA](/wiki/Internet_in_Christmas_Island) (formerly dotCX). Because of its proximity to South East Asia, Christmas Island falls within many of the satellite footprints throughout the region. This results in ideal conditions for receiving various Asian broadcasts, which locals sometimes prefer to those emanating from Western Australia. Additionally, ionospheric conditions are conducive to terrestrial radio transmissions, from [HF](/wiki/High_frequency) through [VHF](/wiki/Very_high_frequency) and sometimes into [UHF](/wiki/Ultra_high_frequency). The island is home to a small array of radio equipment that spans a good chunk of the usable spectrum. A variety of government-owned and operated antenna systems are employed on the island to take advantage of this. ### Local radio There is a local community radio station run by volunteers. Christmas Island Radio, known as 6RCI, serves as the backing track of the island's community, broadcasting across 102.1 FM and 105.3 FM. The radio began streaming online in 2025. There is a large record collection stored in the building of old Chinese and Malay records. The station also broadcasts emergency messages. ### Television Free-to-air digital television stations from [Australia](/wiki/Australia) are broadcast in the same time zone as [Perth](/wiki/Perth) and are broadcast from three separate locations: Broadcaster[Drumsite](/wiki/Drumsite)Phosphate HillRocky Point[ABC](/wiki/ABW_(TV_station))ABC 6ABC 34ABC 40[SBS](/wiki/Special_Broadcasting_Service)SBS 7SBS 35SBS 41[WAW](/wiki/GWN7)WAW 8WAW 36WAW 42[WOW](/wiki/WOW_(TV_station))WOW 10WOW 36WOW 43[WDW](/wiki/West_Digital_Television)WDW 11WDW 38WDW 44 Cable television from Australia, Malaysia, Singapore, and the United States commenced in January 2013. ### Telecommunications Telephone and internet services on Christmas Island are provided by multiple operators. [Telstra](/wiki/Telstra) remains a major provider and integrates the island into the Australian telecommunications network, using the same prefix as Western Australia, South Australia, and the Northern Territory (08). In February 2005, a 900 MHz band [GSM](/wiki/GSM) based 2G mobile telephone system replaced the old analogue network. In 2022, a 4,600 kilometre long, 60 terabits per second, high-capacity backhaul sole submarine cable connection between Australia and Christmas Island was implemented to replace the existing satellite based 2G mobile network with 4GX technology with enhanced mobile and data services on Christmas Island. CiFi, a local mobile phone and internet services provider, launched operations in 2020. It has established a carrier-grade 4G LTE mobile network and a fixed wireless broadband service, offering high-speed internet connectivity to both residents and visitors. In 2025, Google is planning sub sea cables to the Island, with an AI data centre, potentially for military use. ### Newspapers The [Shire of Christmas Island](/wiki/Shire_of_Christmas_Island) publishes a fortnightly newsletter, *The Islander*. There are no independent newspapers. ### Postage stamps A postal agency was opened on the island in 1901 and sold [stamps of the Strait Settlements](/wiki/Postage_stamps_and_postal_history_of_the_Straits_Settlements). After the Japanese occupation (1942–1945), postage stamps of the [British Military Administration](/wiki/British_Military_Administration_(Malaya)) in [Malaya](/wiki/British_Malaya) were in use, followed by stamps of Singapore. In 1958, the island received its own postage stamps after being put under Australian custody. It had a large philatelic and postal independence, managed first by the Phosphate Commission (1958–1969) and then by the island's administration (1969–1993). This ended on 2 March 1993 when [Australia Post](/wiki/Australia_Post) became the island's postal operator; Christmas Island stamps may be used in Australia and Australian stamps may be used on the island. ## Transport A container port exists at Flying Fish Cove with an alternative container-unloading point to the east of the island at Norris Point, intended for use during the December-to-March \"swell season\" of rough seas. The now-defunct [standard gauge](/wiki/Standard-gauge_railway) 18 km (11 mi) [Christmas Island Phosphate Co.'s Railway](/wiki/Christmas_Island_Phosphate_Co.%27s_Railway) from Flying Fish Cove to the phosphate mine was constructed in 1914. It was closed in December 1987, when the Australian government closed the mine, and since has been recovered as scrap, leaving only earthworks in places. [Virgin Australia](/wiki/Virgin_Australia) provided two weekly flights up to 31st October 2025, whereupon Qantaslink took over) to Christmas Island from Perth in Western Australia, with the service connecting to Cocos (Keeling) Islands in both directions. On the announcement of the change of contract, all forward flight bookings were cancelled by Virgin on Thursday 21st August 2025, with all passengers to get a refund and told to rebook. A fortnightly freight flight provides fresh supplies to the island. Rental cars are available from the [Christmas Island Airport](/wiki/Christmas_Island_Airport); however, no franchised companies are represented. Visitors are advised to prebook as there is limited quantity. Road conditions across the island can vary, though inclement weather can cause the roads to become slippery or damaged. Many of the tracks on the island are restricted to four-wheel-drive vehicles. [QantasLink](/wiki/QantasLink) now operates a service to Christmas Island from 3rd November 2025, and will schedule flights on Monday, Friday, and Saturday. Flights are available online. Offering 32k of luggage. Qantas provised services under a government contract. ## Education The island-operated [crèche](/wiki/Child_care) is in the Recreation Centre. [Christmas Island District High School](/wiki/Christmas_Island_District_High_School), catering to students in grades [P-12](/wiki/K-12#P–12), is run by the [Western Australian Education Department](/wiki/Department_of_Education_(Western_Australia)). There are no universities on Christmas Island. The island has one [public library](/wiki/Public_library). - Australia portal - Geography portal - Islands portal - Oceania portal - [.cx](/wiki/.cx), top-level domain country code for Christmas Island - [Index of Christmas Island–related articles](/wiki/Index_of_Christmas_Island%E2%80%93related_articles) - [Outline of Christmas Island](/wiki/Outline_of_Christmas_Island) ## Notes - \"Flora: Endemic plants\". Dept. of Sustainability, Environment, Water, Population and Communities. *Parks and Reserves: Christmas Island National Park*. Australia Government. 21 November 2012. Retrieved 25 December 2012. - This article incorporates public domain material from *The World Factbook*. [CIA](/wiki/CIA). - L., Klemen (1999–2000). \"Forgotten Campaign: The Dutch East Indies Campaign 1941–1942\". Archived from the original on 26 July 2011. - Christmas Island Archives – Featuring historical stories, articles and more. - Christmas Island Stories - Conserving and sharing the authentic stories of the people of Christmas Island. - Christmas Island Virtual Museum – Presenting historical artifacts, coins and ephemera. - Christmas Island Tourism Association - Tourism information about the island Portals: - Geography - Islands - Asia - Australia - Singapore **Christmas Island** at Wikipedia's sister projects: - **Media** from Commons - **News** from Wikinews - **Travel guides** from Wikivoyage\n",
  "language": "en",
  "processed_at": "2026-01-12T10:03:37.177911",
  "title": "Christmas Island",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Christmas_Island"
}