{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:03:42.995715"
  },
  "content": "Singaporean politician **Chua Sian Chin** [DUNU](/wiki/Darjah_Utama_Nila_Utama) ([Chinese](/wiki/Simplified_Chinese_characters): 蔡善进; [Pe̍h-ōe-jī](/wiki/Pe%CC%8Dh-%C5%8De-j%C4%AB): *Chhòa Siān-chìn*; [pinyin](/wiki/Pinyin): *Cài Shànjìn*; 26 November 1933 – 26 February 2014) was a Singaporean politician who held several ministerial portfolios of [Health](/wiki/Minister_for_Health_(Singapore)), [Education](/wiki/Minister_for_Education_(Singapore)) and [Home Affairs](/wiki/Minister_for_Home_Affairs_(Singapore)) in the early era of Singapore. He was 34 years of age when appointed as Health Minister in 1968 which made him the youngest minister in Singapore. ## Early life and education Chua was born in Malacca and attended the [Malacca High School](/wiki/Malacca_High_School). After obtaining his bachelor’s degree from the [University of Malaya](/wiki/University_of_Malaya) in 1954, Chua travelled to England to study law at the [University of London](/wiki/University_of_London) where he completed his law degree in 1958. He was then called to the bar by the [Inner Temple](/wiki/Inner_Temple) in 1959. During his studies, Chua was active in student affairs. At the University of Malaya, he was a member of the University Socialist Club’s central working committee. He then served as secretary of the Malayan Forum and editor of the forum’s newsletter, Suara Merdeka, while studying in London. ## Legal career After returning to Singapore in 1959, Chua joined the law firm of Lee and Lee where he became a partner in 1965. At the firm, Chua served as a legal adviser to numerous associations and trade unions such as the Singapore Hawkers’ Petty Traders Association, the Chinese Teachers’ Union, as well as the Chua and Ong clan associations. He also represented the Minister for Education [Yong Nyuk Lin](/wiki/Yong_Nyuk_Lin) at the Commission of Inquiry on the Secondary Four Students’ Boycott in 1962. Besides practising as an advocate and solicitor, Chua also served as a member in the Public Utilities Board, the permanent examination board of the Singapore Public Service Commission, the citizenship committee of inquiry and the governing board of the [National Trades Union Congress](/wiki/National_Trades_Union_Congress) (NTUC) Research Unit. He was also a referee of the Industrial Arbitration Court and served as chairman of the [University of Singapore](/wiki/University_of_Singapore) Council from 1967 to 1968. ## Political career Chua entered politics when he was elected unopposed as a PAP MP for the [MacPherson constituency](/wiki/MacPherson_SMC) in the [1968 general election](/wiki/1968_Singaporean_general_election). Earlier, he had contested unsuccessfully as a PAP candidate for the Bandar, Malacca, seat in the [1964 Malaysian general election](/wiki/1964_Malaysian_general_election). Following his successful entry into parliament, Chua was appointed as the minister for health in April 1968 at the age of 34, making him then the youngest cabinet minister in Singapore’s history He was the Member of Parliament for [MacPherson](/wiki/MacPherson_SMC) from 17 February 1968 to 14 August 1991. He retired from political service after 23 years in service. During his time as Member of Parliament, in 1975, Chua, then Minister for Home Affairs, proposed that the [death penalty](/wiki/Capital_punishment_in_Singapore) should be the mandatory sentence for drug trafficking of certain amounts to address the increasing rate of drug-related crimes, and these proposals were approved and passed in law. ## Personal life Chua had two sons and one daughter. His eldest son was Chua Eng Leong, who served as a branch chairman for the [Eunos](/wiki/Geylang_East) division for the [Workers' Party](/wiki/Workers%27_Party_(Singapore))-held [Aljunied GRC](/wiki/Aljunied_GRC) from 2012 to August 2024. He contested, but unsuccessfully won, the constituency twice in the (/wiki/2015_Singaporean_general_election) and the (/wiki/2020_Singaporean_general_election) general elections under the PAP ticket. On 26 February 2014, he died at the age of 80 after suffering from heart failure. ## Reference list Political officesPreceded by[E. W. Barker](/wiki/E._W._Barker) **[Minister for Home Affairs](/wiki/Minister_for_Home_Affairs_(Singapore))** 31 October 1972-1 January 1985Succeeded by[S. Jayakumar](/wiki/S._Jayakumar_(Singaporean_politician))Preceded by[Lee Chiaw Meng](/wiki/Lee_Chiaw_Meng) **[Minister for Education](/wiki/Minister_for_Education_(Singapore))** 20 October 1975-11 February 1979Succeeded by[Goh Keng Swee](/wiki/Goh_Keng_Swee)Preceded by[Yong Nyuk Lin](/wiki/Yong_Nyuk_Lin) **[Minister for Health](/wiki/Minister_for_Health_(Singapore))** 16 April 1968-1 June 1975Succeeded by[Toh Chin Chye](/wiki/Toh_Chin_Chye)\n",
  "language": "en",
  "processed_at": "2026-01-12T10:03:42.995303",
  "title": "Chua Sian Chin",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Chua_Sian_Chin"
}