{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:03:50.979782"
  },
  "content": "Building in Lorong Toa Payoh Singapore , Singapore **Chung Hwa Medical Institution** is a medical institution located in [Toa Payoh, Singapore](/wiki/Toa_Payoh). The institution is the headquarters of the Singapore Chinese Physicians Association (SCPA), and houses the Singapore College of Traditional Chinese Medicine, the Chinese Medical and Drugs Research Institute, Chinese Acupuncture Research Institution, and a [traditional Chinese medicine](/wiki/Traditional_Chinese_medicine) clinic. ## History Originally known as the Chung Hwa Free Hospital, the institution was established on 28 October 1978 as a branch of the Chung Hwa Free Clinic along [Telok Ayer Street](/wiki/Telok_Ayer_Street). Its construction was funded by public donations during a fundraising campaign held in 1972, with contributions coming from a variety of donors, including over 5,700 taxi drivers and 500 [trishaw](/wiki/Cycle_rickshaw) riders. The institution offered free medicine and herbs under a [free clinic](/wiki/Free_clinic) operating model, requiring only a nominal 50 cent registration fee. On the opening day, it saw over 400 patients seeking treatment. In 1979, an [acupuncture](/wiki/Acupuncture) exhibition took place there. In 1980, the institution began utilising fusion approaches, combining traditional treatments with modern technology, such as the use of [X-rays](/wiki/X-ray) for diagnosis. The institution has been included in the Toa Payoh Heritage Trail by the [National Heritage Board](/wiki/National_Heritage_Board_(Singapore)). This article about a Singapore building or structure is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T10:03:50.979366",
  "title": "Chung Hwa Medical Institution",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Chung_Hwa_Medical_Institution"
}