{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:03:56.847575"
  },
  "content": "Church in Singapore**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Church of Saints Peter and Paul, Singapore\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(November 2022)* *(Learn how and when to remove this message)*This article includes a list of general references, but **it lacks sufficient corresponding inline citations**. Please help to improve this article by introducing more precise citations. *(March 2022)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)*Church in Singapore , Singapore The **Church of Saints Peter and Paul** ([Chinese](/wiki/Simplified_Chinese_characters): 圣伯多禄圣保禄堂) is a [Roman Catholic](/wiki/Roman_Catholic) church in Singapore. It is located at [Queen Street](/wiki/Queen_Street,_Singapore) within the [Central Area](/wiki/Central_Area,_Singapore) known as the Bras Basah Bugis precinct of Singapore's [arts district](/wiki/Arts_district). ## History and architecture The history of the Church of Saints Peter and Paul is closely linked with the beginning and growth of the Chinese Catholic community in Singapore. The church, with its tower, was constructed between 1869 and 1870. It was erected by the Chinese Catholic [Mission](/wiki/Mission_(Christian)) serving a congregation of all the [Chinese dialect](/wiki/Chinese_dialect) groups and their [Indian](/wiki/Indian_subcontinent) brethren. It was also a centre for many European [missionaries](/wiki/Missionaries) who needed to learn the Chinese language before other postings. Initially, the Chinese Catholic community had contributed to the building of the first permanent Roman Catholic house of worship along [Bras Basah Road](/wiki/Bras_Basah_Road). With a fifth of the construction cost borne by them, the chapel was ready by 1833. However, by the end of the 1830s, the chapel had become too small. Instead of enlarging the chapel, work was begun on the [Cathedral of the Good Shepherd](/wiki/Cathedral_of_the_Good_Shepherd) nearby and [Saint Joseph's Institution](/wiki/Saint_Joseph%27s_Institution,_Singapore) took over the [chapel's premises](/wiki/Former_Saint_Joseph%27s_Institution). With the development of the apostolate among the Chinese and the Indians under Father Pierre Paris, it became increasingly difficult to accommodate the different linguistic groups in the cathedral. By the late 1860s, a new church was needed and the Church of Saints Peter and Paul was erected. It is said that the cost of the compound wall of the church was defrayed by [Napoleon III of France](/wiki/Napoleon_III_of_France). The church was smaller then, with only seven pairs of [columns](/wiki/Column). In 1883, Father Paris bestowed the three [bells](/wiki/Church_bell), which are still in use today, but the state of his health prevented him from being present when the bells were [blessed](/wiki/Blessing). He also initiated construction of the [spire](/wiki/Spire). Father Paris died on 23 May 1883, after having worked in the [Straits](/wiki/Straits_Settlements) for over 28 years and is buried in the church. Father Ludovic Jules Galmel, who had taken over from Father Paris during his illness, completed the spire and built the [presbytery](/wiki/Presbytery_(architecture)). As he spoke no [Tamil](/wiki/Tamil_language), another priest became his assistant to minister to the Indian congregation. When the [Church of Our Lady of Lourdes](/wiki/Our_Lady_of_Lourdes_Church,_Singapore) in Ophir Road was built in 1888, the Indian congregation moved there. The Church of Saints Peter and Paul then became an exclusively Chinese parish under Father Alphonse Vignol, concentrating on the different Chinese dialect groups. From 1891 to 1892, the church was enlarged when the [sacristy](/wiki/Sacristy) and [transept](/wiki/Transept) were added. Father Vignol also erected three [marble](/wiki/Marble) [altars](/wiki/Altar) whereby the High Altar in the new [sanctuary](/wiki/Sanctuary) was consecrated by Bishop Edouard Gasnier. From 1910 to 1911, the church was further extended with the enlargement of the [choir](/wiki/Choir) [loft](/wiki/Loft), construction of the entrance [porch](/wiki/Porch) and the extension of the façade with the help of contributions from wealthy Chinese parishioners such as Mr Low Gek Seng, a manager of the Bangkok and Singapore-based merchant firm Kiam Hoa Heng. These altars (including the high altar) no longer exist, as they were demolished in the renovations of 1970, which came in the period of confusion following the [Second Vatican Council](/wiki/Second_Vatican_Council), where many well-meaning church members and clergy oversaw the unnecessary 'modernisation' with beautiful buildings scarred. In 1910, the [Cantonese](/wiki/Cantonese)- and [Hakka](/wiki/Hakka_Chinese)-speaking groups left Saints Peter and Paul for the new [Church of the Sacred Heart](/wiki/Church_of_the_Sacred_Heart,_Singapore) in Tank Road built by Father Vincent Gazeau. In 1929, the [Hoklo people](/wiki/Hoklo_people) left for the new [Church of Saint Teresa](/wiki/Church_of_St_Teresa,_Singapore) in Kampong Bahru. The last two churches were financed by wealthy Chinese parishioners particularly Mr Jacobe [Low Kiok Chiang](/wiki/Low_Kiok_Chiang) (1843–1911) and Mr Chan Teck Hee, both founders of the firm Kiam Hoa Heng. Mr Wee Cheng Soon (d. 1944), a wealthy contractor and property developer and Mr Chan Teck Hee, also defrayed almost all of the costs of the Church of St Theresa. A major renovation of the church was planned for its centenary year and in October 1969, with the help of the Church Renovation Committee, the parishioners and other well-wishers, renovations were completed in time for the Centenary Celebrations in June and July 1970. It was during this major renovation that the original neo-gothic high altar was demolished, and replaced with a modern 'communion table' style altar, similar to what one would find in a Protestant church, without a reredos, and no visually obvious crucifix or candles, with the stained glass windows becoming the visual focal point instead. (these issues were addressed in the most recent restoration when the 1969 [wreckovation](/wiki/Wreckovation) was mostly undone.) There was once a [pipe organ](/wiki/Pipe_organ) installed by Parisian organ builder [Aristide Cavaillé-Coll](/wiki/Aristide_Cavaill%C3%A9-Coll) in this church. It was built in 1877 and was of modest dimensions, costing 5939.75 [francs](/wiki/Francs). This *orgue de choeur* was dismantled, and most of it was discarded in the 1960s. Parts of its facade was moved to the hall of the Catholic High School adjacent to the church, where it was used for decorative purposes. Today, the only remnants of this organ are a zinc pipe foot and several tuning collars, all of which reside in private collections. The old wooden [pews](/wiki/Pew) have also had their [fleur-de-lis](/wiki/Fleur-de-lis) decorations removed. In early 2008, the church installed a second-hand 50 stops Allen 2 Manual Digital Computer Organ in the Choir Loft. The parish of the Church of Saints Peter and Paul grew marginally in the 1970s but began to decline since the 1980s when schools within its vicinity were relocated. With the completion of new churches in the various housing estates and the demarcation of parish boundaries, many parishioners have since left for their new parishes located nearer to their homes. The Church of Saints Peter and Paul was [gazetted](/wiki/Gazette) a [national monument](/wiki/National_Monuments_of_Singapore) on 10 February 2003. From 4 September to 12 November 2006, the church was one of the exhibition venues for the [Singapore Biennale](/wiki/Singapore_Biennale), Singapore's inaugural international biennale of contemporary art. Currently, the church is under the care of the [Discalced Carmelite](/wiki/Discalced_Carmelite) [Friars](/wiki/Friar). All [Post-Conciliar Masses](/wiki/Mass_of_Paul_VI) are usually in English with a [Mandarin](/wiki/Standard_Mandarin) service on Sunday mornings and a [Cantonese](/wiki/Cantonese) service on Sunday afternoons. The officially sanctioned Extraordinary Form of the Roman Rite, also known as the [Tridentine Mass or Traditional Latin Mass](/wiki/Tridentine_Mass), was celebrated every Sunday evening at 6:00 p.m. at the Church of Saints Peter and Paul within the Archdiocese of Singapore. This celebration was later relocated to St Joseph’s Church on Victoria Street, situated nearby, where it is held every Sunday at 2:00pm. Most recently, the church underwent a major renovation and restoration, which was completed in 2016. Apart from addressing necessary repairs to the fabric, the renovation also reinstated several features of the original church, such as ornate encaustic tiles, similar to the ones removed in the late 1960s. Besides repairing the aging roof structure and other technical improvements such as lighting and air conditioning, many of the unsympathetic changes introduced in the 1970s renovation were reversed: the modern sheet metal vertical window louvres were replaced with traditional wooden louvred windows, the badly-planned gallery at the west end was removed, and a high altar, similar to the one that was demolished, has been purchased and re-installed at the east end. Additional joinery screens were added to the east wall, and an altar rail was reintroduced. Following this renovation, the church became the recipient of the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) of Singapore's Architectural heritage award in 2016. - [Saint Peter](/wiki/Saint_Peter) - [Saint Paul of Tarsus](/wiki/Saint_Paul_of_Tarsus) - [Christianity in Singapore](/wiki/Christianity_in_Singapore) - [Roman Catholicism in Singapore](/wiki/Roman_Catholicism_in_Singapore) - [Archdiocese of Singapore](/wiki/Archdiocese_of_Singapore) - [List of Roman Catholic churches in Singapore](/wiki/List_of_Roman_Catholic_churches_in_Singapore) **Bibliography:** - Norman Edwards, Peter Keys (1988), *Singapore – A Guide to Buildings, Streets, Places*, Times Books International, [ISBN](/wiki/ISBN_(identifier)) 9971-65-231-5 - Eugene Wijeysingha (2006), *Going Forth... – The Catholic Church in Singapore 1819–2004*, Titular Roman Catholic Archbishop of Singapore, [ISBN](/wiki/ISBN_(identifier)) 981-05-5703-5 - Wan Meng Hao (2005), *Know Our Monuments* , Preservation of Monuments Board - Official Website of the Church of Saints Peter and Paul - Parish information of the Church of Saints Peter and Paul - Singapore Catholic Church Directory - Infopedia\n",
  "language": "en",
  "processed_at": "2026-01-12T10:03:56.847216",
  "title": "Church of Saints Peter and Paul, Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Church_of_Saints_Peter_and_Paul,_Singapore"
}