{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:03:59.128615"
  },
  "content": "Historic site in Singapore The **Church of the Nativity of the Blessed Virgin Mary** ([Chinese](/wiki/Simplified_Chinese): 圣母圣诞堂) is a [Roman Catholic](/wiki/Catholic) [church](/wiki/Church_(building)) in [Singapore](/wiki/Singapore). It is located in [Hougang](/wiki/Hougang), the [North-East Region](/wiki/North-East_Region,_Singapore) of Singapore, and is within the Serangoon District. It is well known as the oldest [Catholic](/wiki/Catholicism) church for the [Teochew](/wiki/Teochew_people) community in [Serangoon](/wiki/Serangoon). ## History ### Beginnings in Hougang Before the arrival of pioneer priest Father Ambrose Maistre in 1852, there was already a significant [Catholic](/wiki/Catholicism) community in *Aukang* (Teochew moniker for [Hougang](/wiki/Hougang)) or *Kangkar*, the area surrounding [Serangoon River](/wiki/Sungei_Serangoon). He went on to set up a station to serve the Catholics in this rural district and the first baptism took place in 1853. An *[attap](/wiki/Attap_dwelling)* (thatched roof) chapel and small [presbytery](/wiki/Presbytery_(architecture)) was also erected after Father Maistre acquired approximately 37-acres of land from the [British East India company](/wiki/British_East_India_Company). It was later converted into a small [brick](/wiki/Brick) church named St Mary's Chapel. The remainder of the land acquired was allocated to [parishioners](/wiki/Parishioners) in the area for their [settlement](/wiki/Human_settlement). The [parish](/wiki/Parish) consisted mainly of [Teochew](/wiki/Teochew_people) [farmers](/wiki/Farmer) and fish dealers residing in [Serangoon](/wiki/Serangoon), [Hougang](/wiki/Hougang) and [Punggol](/wiki/Punggol). Earliest statistics recorded the presence of approximately 700 [Chinese](/wiki/Chinese_people) in the region. The first settlers were [Chinese Catholics](/wiki/Chinese_Catholics) who hailed from [Siam](/wiki/Siam) and [Malacca](/wiki/Malacca) whereas later [migrants](/wiki/Economic_migrant) were mainly from [Teochew](/wiki/Chaozhou) [Swatow](/wiki/Shantou) in [Southeastern China](/wiki/Southeastern_China). Most did not migrate as a family or clan, and therefore, shared no common ancestors. While some converted to [Catholicism](/wiki/Catholicism) after arriving in [Singapore](/wiki/Singapore), missionary activities of the Dominican and Franciscan friars in Southeastern China as early as the seventeenth century meant that many already embraced the faith before their migration. Moreover, the pioneering [priests](/wiki/Priest) were able to forge strong ties with the [Teochews](/wiki/Teochew_people) residing in Hougang. It is believed that the similarities the [Teochews](/wiki/Teochew_people) and [French priests](/wiki/Priest) shared – being “good conversationalists who enjoy social events” – led the Teochews to be open to evangelisation. As such, conversion of new settlers was successful as the need for an expansion of the church became apparent between 1894 and 1896. It was said that half the parishioners – mostly women and children – had to stand outside the brick chapel during Mass. ### Construction, 1898–1901 The present building of the [church](/wiki/Church_(building)) was commissioned to be built in 1898 to cater to the burgeoning [Catholic](/wiki/Catholicism) community in the district by Father Jean Casimir Saleilles, parish priest from 1881 to 1911. It was designed in a [neo-Gothic](/wiki/Neo-Gothic_architecture) style by French priest Father [Charles Bénédict Nain](/wiki/Charles_B%C3%A9n%C3%A9dict_Nain), and could accommodate around 650 parishioners. Located at the junction of 73/4 milestones [Upper Serangoon Road](/wiki/Upper_Serangoon_Road) and Punggol Road (known as Hougang Ave 8 today), construction was completed in 1901. Officially blessed on 8 December 1901 by Bishop [Rene Michel-Marie Fee](/wiki/Ren%C3%A9_Michel_Marie_F%C3%A9e), the feast day of the [Immaculate Conception of the Blessed Virgin Mary](/wiki/Immaculate_Conception_of_the_Blessed_Virgin_Mary), the church was renamed Church of the Nativity of the Blessed Virgin Mary. ### Expansion, 1933 However, by the 1930s, the church had to be expanded again to accommodate the growing [parish](/wiki/Parish); general attendance at [Mass](/wiki/Mass_(liturgy)) rose to 1350. The size of the original church was thus doubled with the addition of the [side transepts](/wiki/Transept), the sanctuary and [sacristy](/wiki/Sacristy) in 1933. Widespread activities of secret societies plaguing the area between the 1850s and 1920s meant that settlers had to seek a protector. The church soon became that protector since she had a huge congregation and “church members would stand up for one another when conflicts with outsiders arose”. Such protection would continue throughout the [Japanese Occupation](/wiki/Japanese_occupation_of_Singapore) when the church served as a sanctuary where parishioners could hide from the [Japanese](/wiki/Japanese_people). ### Education The church also played a prominent role in offering [education](/wiki/Education) and religious instruction to parishioners and settlers in Hougang. Tao Nan School was founded as a Chinese medium school in 1892, and is known as [Holy Innocents’ High School](/wiki/Holy_Innocents%27_High_School) today. Holy Innocents’ English School was then established as a parish school in 1916 to the left of the church premises. Later taken over by the [Gabrielite Brothers](/wiki/Gabrielite_Brothers) and renamed Monfort's School in 1936. After a split by [educational stages](/wiki/Educational_stage) in 1992, [Monfort Junior School](/wiki/Montfort_Junior_School) and [Monfort Secondary School](/wiki/Montfort_Secondary_School) still stand in Hougang today. Holy Innocents’ Chinese Girls’ School was founded in 1932. It is known as [Holy Innocents’ Primary School](/wiki/Holy_Innocents%27_Primary_School) today after it amalgamated with the primary section of Holy Innocents’ High School in 1985. Convent of the Holy Infant Jesus (CHIJ) Punggol was established in 1957 and was renamed [CHIJ Our Lady of the Nativity](/wiki/CHIJ_Our_Lady_of_the_Nativity) in 2001. The St Francis Xavier Minor Seminary was also built opposite the church in 1924 to provide instruction to potential candidates to the priesthood. It still stands at its original location, alongside the Catholic Spirituality Centre. ### Vernacular masses [Vatican II](/wiki/Second_Vatican_Council) introduced the use of [vernacular languages](/wiki/Vernacular_languages) in the liturgy. In Singapore, [English](/wiki/English_language) Masses first began in 1965 and [Mandarin](/wiki/Mandarin_Chinese) ones in 1970. [Teochew](/wiki/Teochew_dialect) Masses were first offered in the Nativity Church in 1971 on Pentecost Sunday. Till this date, the Nativity Church remains the only [Catholic church](/wiki/Catholic_Church_in_Singapore) in Singapore that offers Mass in [Teochew](/wiki/Teochew_dialect). ### Urbanisation & resettlement, 1970s–1980s Along with the founding of [Singapore](/wiki/Singapore) as an independent nation in 1965, as well as [urbanisation](/wiki/Urbanization) projects between the 1960s and 1970s, came changes to the community residing in Hougang. Land surrounding the church, such as St Joseph's Lane and Kok Nam Lane, were acquired by the government. Parishioners were resettled elsewhere in Singapore, such as [Whampoa](/wiki/Whampoa,_Singapore), [Ang Mo Kio](/wiki/Ang_Mo_Kio) and [Marine Parade](/wiki/Marine_Parade) while other Singaporeans moved into [Hougang](/wiki/Hougang) with the mass building of [Housing Development Board (HDB)](/wiki/Housing_and_Development_Board) flats in the area. As a result, the church and her surrounding area became more [multilingual](/wiki/Multilingualism) and [multiracial](/wiki/Multiracial) instead of being predominantly Teochew Catholic. Nonetheless, despite these changes, the church remained the centre of activities. In the 1980s especially, food and fun fairs, [Feast Day](/wiki/Feast_Day) processions, film shows and outings were regularly organized. Both parishioners and non-Catholics would enjoy them. New ministries, such as the Migrant Workers’ Gospel Station, were also established over the years to serve the church as well as to reach out to [migrants](/wiki/Economic_migrant) in the vicinity. St Anne's Church was also founded in 1963 in present-day [Sengkang](/wiki/Sengkang) to accommodate the growing number of [Catholics](/wiki/Catholicism) in the area. Recognised for her “social and historical significance…, importance to the community as well as architectural merits”, the Church was gazetted a [national monument](/wiki/List_of_national_monuments_of_Singapore) on 14 January 2005 under the Preservation of Monuments Act (Cap 239) (Image 25 in Appendix C). ### Timeline 1898Foundation laid for construction of present Church building1901Construction completed and Church was renamed Church of the Nativity of the Blessed Virgin Mary (Nativity Church)1916Holy Innocents’ English School (present-day Monfort Junior School & [Monfort Secondary School](/wiki/Montfort_Secondary_School)) founded1924St Francis Xavier Minor Seminary established1926St Joseph's Dying Aid Association officially inaugurated and registered as a society, the first from the church1932Holy Innocents’ Chinese Girls’ School (present-day [Holy Innocents’ Primary School](/wiki/Holy_Innocents%27_Primary_School)) founded1933Addition of side transepts, the sanctuary and sacristy, effectively doubling size of Church1957Convent of the Holy Infant Jesus (CHIJ) Punggol (present-day [CHIJ Our Lady of the Nativity](/wiki/CHIJ_Our_Lady_of_the_Nativity)) founded1963St Anne's Church founded in present-day [Sengkang](/wiki/Sengkang) to accommodate growing population in the area1970s – 1980sUrbanisation and construction of [HDB](/wiki/Housing_and_Development_Board) flats in Hougang2003Nativity Church Kindergarten established2012Korean parish permanently moved to Nativity Church; Nativity Church becomes the only Catholic church in Singapore that offers Korean Mass The Nativity Church also celebrated her 160th anniversary ## Architectural features Built in a [neo-Gothic](/wiki/Gothic_Revival_architecture) style, the church was initially shaped rectangular. After the addition of [transepts](/wiki/Transept) in the 1930s, the church now takes on the form of a [Latin cross](/wiki/Christian_cross_variants). At the front end of the church stands a [belfry](/wiki/Belfry_(architecture)) tower capped with a [spire](/wiki/Spire) and ornate brass [cross](/wiki/Cross_(Christianity)). Rose windows decorate the façade of both [transepts](/wiki/Transept) as well as the belfry. To the left of the main marble [altar](/wiki/Altar) at the centre of the church stands the Chapel of the [Sacred Heart of Jesus](/wiki/Sacred_Heart), while the Chapel of the [Immaculate Conception](/wiki/Immaculate_Conception) stands to the right. Statues of saints are enshrined in niches on the walls of the side aisles. Behind the altars are five stained-glass windows depicting, from left to right, [St Francis Xavier](/wiki/Francis_Xavier), the [Sacred Heart of Jesus](/wiki/Sacred_Heart), the [Immaculate Conception](/wiki/Immaculate_Conception), [St Joseph](/wiki/Saint_Joseph), and [St Therese de Lisieux](/wiki/Th%C3%A9r%C3%A8se_of_Lisieux) respectively. The nave also holds the tombs of five former priests of the Church. In the foreground of the [entrance](/wiki/Door) of the church stands an iconic [statue](/wiki/Statue) – “The Immaculate Conception of Mary”. This marble statue was presented to the church by [Sultan Ibrahim of Johor](/wiki/Ibrahim_of_Johor) as a token of his long-standing friendship with Reverend Father Francis Chan (later installed as Bishop of Penang), parish priest of the church between 1946 and 1955. ## Ongoing activities The church serves approximately 6000 parishioners today. Another 1200 parishioners attend Korean Mass ever since the [Korean Catholic community](/wiki/Korean_Catholics) has permanently shifted and been based here in 2012. Besides religious services, the church also began running the Nativity Church Kindergarten for Pre-Nursery, Nursery, K1 and K2 children in 2003. An elderly daycare facility, Senior Connection @ Nativity, was also recently established in 2016 to provide daycare services for elderly in the district, regardless of their faith. ### Matthew 25 Responding to the then impending economic crisis, Father Henry Siew, parish priest, initiated the establishment of Matthew 25, a soup kitchen, in April 2008. The name of the soup kitchen was derived from [verse 25 of Matthew](/wiki/Matthew_25), where Jesus says, “In truth, I tell you, in so far as you did this to one of the least of my brothers, you did it to me.” [Matthew 25](/wiki/Matthew_25) offers free breakfast and lunch to the less privileged, regardless of their race, age, or religion. Other than serving approximately 140 residents who walk into the church premises daily, volunteers also deliver about another 190 packed meals to Senior Activity Centres in the vicinity. Free haircuts are also offered every second Tuesday of the month at the Church by the [Matthew 25](/wiki/Matthew_25) ministry. ### Priests and religious - Rev. Fr Kenson Koh (Parish Priest) - Rev. Fr Timothy Soo ### Music From humble beginnings, the music community of the Church strengthened and grown through the years. Today, the Church holds a [Yamaha](/wiki/Yamaha_Corporation) [Electone](/wiki/Electone) STAGEA and a [KORG](/wiki/KORG) [Clavinova](/wiki/Clavinova). A distinctive feature in Singapore is the high ceilings of the church which creates an acoustic hall ambience. Most musicians of the church are self-learned musicians and have been serving in the Church for years. Many events were hosted through the years, like an Advent Presentation held on [Christmas Day](/wiki/Christmas_Day) in 2024. #### Choirs There are five English choirs and other few Chinese, Teochew and Korean choirs. The five English choirs: - Holy Spirit Choir (Sunday, 5.30pm) - Salve Regina Choir (Saturday, 6.00pm) - Seraphim Choir (Sunday, 9.15am) - St Hilary's Choir (Sunday, 11.00am) - St Thomas Aquinas Choir (Sunday, 7.00am) - Tommy Koh *et al.* (2006), *Singapore: The Encyclopedia*, Editions Didier Millet and National Heritage Board, [ISBN](/wiki/ISBN_(identifier)) 981-4155-63-2 - Wan Meng Hao (2005), *Know Our Monuments* , Preservation of Monuments Board - Church of the Nativity of the Blessed Virgin Mary (2012), *160 Years Magnifying the Lord,* Church of the Nativity of the Blessed Virgin Mary - Singapore Catholic Church Directory\n",
  "language": "en",
  "processed_at": "2026-01-12T10:03:59.128227",
  "title": "Church of the Nativity of the Blessed Virgin Mary, Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Church_of_the_Nativity_of_the_Blessed_Virgin_Mary,_Singapore"
}