{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:04:05.732070"
  },
  "content": "Cosmetic lens placed on the surface of the eye A **circle contact lens**, also known as a **big eye contact lens** and **circle lens**, is a cosmetic (non-corrective and decorative) [contact lens](/wiki/Contact_lens) that makes the eye's [iris](/wiki/Iris_(anatomy)) appear larger. It has become a trend throughout [East](/wiki/East_Asia), [South](/wiki/South_Asia) and [Southeast Asia](/wiki/Southeast_Asia) and is largely produced in [Japan](/wiki/Japan), [South Korea](/wiki/South_Korea) and [China](/wiki/China). ## Design Circle lenses make one's eyes appear larger and come in a variety of colors and effects. They have been around since 2004 and are very popular in countries such as South Korea, Japan, [Taiwan](/wiki/Taiwan) and China. The diameter of regular contact lenses that are sold in the [United States](/wiki/United_States) are on average 14–16 mm. Similar to the diameter of regular contact lenses, circle lenses have no more than 15 mm diameter since larger sizes would be harmful to the eyes at daily wear. When the diameter of the circle lens is described as 16 mm or 18 mm, it is only the provided visual effect of the circle lens. The difference between the two types of lenses is that circle lenses are tinted not only in areas that cover the iris of the eye, but also prominently in the extra-wide outer rim of the lens. The result is the appearance of a bigger, wider iris with a [limbal ring](/wiki/Limbal_ring), creating an illusion of large eyes. The optical zone in the middle is transparent and it is large enough to provide clear vision. When big eye contacts first launched, they were only available in yearly disposable format, but as the trend spread, these lenses are now available as dailies, biweeklies and monthlies. The lenses are popular among teenagers and young adults. Many people consider circle lenses to be a fashion accessory rather than a medical device. In Hong Kong, many young female models wear them as popular fashion icons. ## Popularity In [Asia](/wiki/Asia), circle contact lenses can be bought from many online stores and are imported from manufacturing countries such as South Korea to nations such as [Thailand](/wiki/Thailand), China, [Malaysia](/wiki/Malaysia), Japan, [Nepal](/wiki/Nepal), [Sri Lanka](/wiki/Sri_Lanka), [Singapore](/wiki/Singapore), [Vietnam](/wiki/Vietnam), and Taiwan. They can be purchased without a [prescription](/wiki/Eyeglass_prescription) (0.00 or [plano](/wiki/Corrective_lens#Plano)) or with prescription. Their legality in the West varies with the local laws, and in the [United States](/wiki/United_States) they are currently classified as a medical device and are not legal for sale without a valid prescription. ## Risks A [meta-analysis](/wiki/Meta-analysis) reported that cosmetically tinted lenses appear to be safe when properly prescribed by an eye care professional and when used correctly. Decorative [soft contact lens](/wiki/Soft_contact_lens) must be fitted appropriately, as tinted soft contact lenses may reduce vision by temporarily increasing the number of [high-order aberrations](/wiki/Aberrations_of_the_eye#High_order_aberrations) under [bright-light](/wiki/Photopic_vision) and [low-light](/wiki/Mesopic_vision) conditions, as the center of tinted lenses does not always coincide with the center of the cornea, and thus decorative soft contact lenses must be fitted appropriately. Indeed, concerns with these lenses in the United States arise from people buying lenses without consulting their [optometrists](/wiki/Optometrist), which could result in lenses that do not fit the individual's eyes properly. ## Legality ### United States In the United States decorative, non-corrective contact lenses are considered medical devices by the [Food and Drug Administration](/wiki/Food_and_Drug_Administration) (FDA) and sale and marketing of such devices require market clearance by the FDA and a valid prescription from a medical professional. Devices that have not been cleared by the FDA may be subject to seizure by US Customs. Korean contact lens companies Geo Medical Inc. and Migwang Contact Lens (operating under the brand name Clearlab in the US) have been approved by the FDA for sale in the United States. Circle lenses manufactured in Korea are under the approval and guidelines of the [Ministry of Food and Drug Safety](/wiki/Ministry_of_Food_and_Drug_Safety). [Acuvue](/wiki/Acuvue), the contact lens brand from [Johnson & Johnson Vision](/wiki/Johnson_%26_Johnson_Vision), has a line of prescription daily disposable color contact lenses marketed under the name \"1-Day Acuvue Define\" available in the United States as well as other countries. - [Body modification](/wiki/Body_modification)\n",
  "language": "en",
  "processed_at": "2026-01-12T10:04:05.731670",
  "title": "Circle contact lens",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Circle_contact_lens"
}