{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:04:07.357917"
  },
  "content": "This 02-09-2025 may **require cleanup** to meet Wikipedia's quality standards. The specific problem is: **article incoherent with messy formatting and contains unreferenced content.** Please help improve this 02-09-2025 if you can. *(September 2025)* *(Learn how and when to remove this message)*Telecommunications company in Singapore **Circles.Life** is a Singaporean digital [telecommunications](/wiki/Telecommunications) company. The company was founded in 2016, initially operating exclusively in Singapore, leasing its network from [M1](/wiki/M1_(Singaporean_company)). In July 2015, Liberty Wireless signed an agreement with M1 Limited that allowed it to tap into M1's mobile network, becoming the first MVNO in Singapore to offer a full-service mobile network experience. It has since expanded to [Taiwan](/wiki/Taiwan) and [Australia](/wiki/Australia), where it leases the [Chunghwa Telecom](/wiki/Chunghwa_Telecom) and [Optus](/wiki/Optus) networks, respectively. In February 2019, the company announced that it had closed an undisclosed round of funding with Sequoia South East Asia and had plans to expand in five new markets, including Taiwan and Australia over the next 18 months. The company has expanded its offerings by launching digital lifestyle features such as its AI-driven events and movie-based platform, 'Discover'. In June 2019, the company closed another round of funding for an undisclosed amount, led by Singapore's Government-linked EDBI and Founders Fund. This marks the first time the Silicon Valley–based Founders Fund has invested in a telco. The company launched into its first overseas market, Taiwan, in June 2019, followed by Australia in September 2019. ## History This section **is in list format but may read better as prose**. You can help by converting this section, if appropriate. Editing help is available. *(September 2025)* **2016** - June 2016: Circles.Life launches, making it Singapore's fourth telco. **2018** - March 2018: Circles.Life launches Unlimited Data on Demand, to provide customers with a daily Unlimited Data option. It also adds the option of Unlimited Outgoing Calls. **2019** - February 2019: Circles.Life announces that it has closed an undisclosed round of funding with Sequoia India. - June 2019: Circles.Life expands into its first overseas market, Taiwan. - June 2019: Circles.Life announces that it has closed an undisclosed round of funding with Singapore's Government-linked EDBI and Founders Fund. - August 2019: Circles.Life expands to its second overseas market, Australia. **2020** - February 2020: Circles.Life announces that it has closed an undisclosed round of funding with Warburg Pincus. - October 2020: Circles.Life launches in Indonesia as Live.On. **2021** - September 2021: Circles.Life launches in Japan as povo2.0 **2022** - July 2022: Circles.Life was reportedly in early talks to merge with SPAC Bridgetown in a $2.5B deal. This could be the third [SPAC](/wiki/Special-purpose_acquisition_company) merger with a Singaporean company, the second in 2022. - Nov 2023: Circles.life launched Jetpac - a global roaming subscription - to the Singapore market. **2023** - Dec 2023: Circles.Life Jetpac was expanded from just the Singapore market to the global audience, making it the first truly global brand launched by the Circles group. ## Markets Operating as a digital telco, it purchases bandwidth from other MNOs, replacing traditional brick-and-mortar stores with its own online consumer business. This enables Circles.Life to provide voice, messaging, and data services to customers: becoming the first digital telco in Singapore to offer full service mobile network services. To do away with physical retail stores, Circles.Life delivers its SIM cards and mobile phones to customers through third party services, such as [SingPost](/wiki/SingPost) in Singapore. ### Singapore In July 2015, Circles.Life's parent company, Liberty Wireless Pte Ltd, signed an agreement with [M1 Limited](/wiki/M1_Limited) to deliver voice, messaging, and data services as an MVNO using M1's mobile network, which has 4G+ outdoor coverage of 99.92% of Singapore. The company's offering launched to the public in June 2016. Customers may also choose to pick up its SIM cards at selected convenience stores and post offices as alternatives to courier services. ### Taiwan Circles.Life launched its digital services in Taiwan with a no-contract base plan. The infrastructure partner uses Chunghwa Telecom's (CHT) network. Circles.Life offers an add-on option for data-heavy users, under which for a monthly fee, users can add unlimited data to their base plans. Circles.Life has recently announced that their operations in Taiwan will be shut down on July 17, 2024. Existing users wishing to keep their mobile phone numbers should port their numbers to another operator before that date. Otherwise, any remaining numbers will be lost permanently and reclaimed back to the regulator. ### Australia Circles.Life launched its digital services in Australia through a strategic partnership with Optus. In January 2025, Circles.Life closed its Australian MVNO operations, transferring existing accounts across to another Optus reseller, [Amaysim](/wiki/Amaysim). ### Indonesia In 2020, Circles.Life launched its digital service \"Live.On\" in Indonesia. The infrastructure partner uses [XL Axiata](/wiki/XL_Axiata) 4.5G network. Four years later, specifically on February 23, 2024, Live.On transferred the digital service to XL Axiata in Indonesia. As a result, the company moved their customers into their existing [AXIS](/wiki/Axis_Telecom) brand.. ### Jetpac In Nov 2022, Circles.Life launched [Jetpac](/wiki/Jetpac) as a roaming subscription service to its Singapore base. By Nov 2023, Jetpac was expanded to serve a global base and the main product was changed to individual one time purchases with different validities - similar to competitors like [Airalo](/wiki/Airalo). By Nov 2024, Jetpac was spun off as a separate entity with funding from [KDDI](/wiki/KDDI). - Official website - Corporate website\n",
  "language": "en",
  "processed_at": "2026-01-12T10:04:07.357532",
  "title": "Circles.Life",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Circles.Life"
}