{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:04:13.514006"
  },
  "content": "Corruption case in SingaporeThis article **needs attention from an expert in Crime and Criminal Biography**. The specific problem is: **comments/descriptions about the accused in the \"Aftermath\" section were taken from the prosecutor's closing submissions — I have labelled them as such, not sure if this is a neutrality issue (since it's one-sided) and that section currently reads like a broken record.** WikiProject Crime and Criminal Biography may be able to help recruit an expert. *(May 2016)* The [City Harvest Church](/wiki/City_Harvest_Church) criminal breach of trust (CBT) case was one of the longest criminal trials in [Singapore's](/wiki/Singapore) history. Church founder [Kong Hee](/wiki/Kong_Hee) and five other church leaders were found guilty by a [District Court](/wiki/State_Courts_of_Singapore) on 21 October 2015 of CBT by agent after misappropriating some S$50 million of church funds. Approximately S$24 million was invested in sham bonds to bankroll the pop-music career of his wife, [Ho Yeow Sun](/wiki/Ho_Yeow_Sun), while a further S$26 million was used to later cover their tracks. A subsequent appeal against conviction and sentence to a three-judge sitting of the [High Court](/wiki/High_Court_of_Singapore) and by a 2-1 decision delivered on 7 April 2017, reduced their sentences by varying degrees due to a substitution of their initial charges of CBT by an agent (s409 of the [Penal Code](/wiki/Penal_Code_(Singapore))) with a less serious offence of simple CBT (s406 of the [Penal Code](/wiki/Penal_Code_(Singapore))). The [Public Prosecutor](/wiki/Attorney-General_of_Singapore) then applied for a criminal reference to the [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore) to answer questions of law of public interest that arose from the appeal in the High Court and had an effect on the outcome. A unanimous five-judge decision was delivered on 1 February 2018 and resulted in no change to the reduced sentences. ## Events ### Church member blows the whistle In January 2003, a businessman who had been attending the church for six years contacted and wrote in to [*The Straits Times*](/wiki/The_Straits_Times), alleging that church members were being encouraged to buy [Ho Yeow Sun](/wiki/Ho_Yeow_Sun)'s albums. He added that church funds were being used to promote her career. As the incident blew up in the press, other church members alleged that the church was quickly becoming a [personality cult](/wiki/Personality_cult) and that it was using its platform to drum up votes for Ho at the [MTV Asia Awards](/wiki/MTV_Asia_Awards), where Ho was one of five nominees vying for the 'Favourite Music Artist from Singapore' award. A tearful Ho told the press at the time, \"I really don’t need this. At first, I was quite affected and wanted to give up everything and just go home. Then I thought, ‘Hey, my conscience is clear, and I’ve not done anything wrong.’ So, I’ll still come back to sing during the show.\" Following pressure from the church, the whistleblower eventually issued five apologies in The Straits Times, [Lianhe Zaobao](/wiki/Lianhe_Zaobao), [Lianhe Wanbao](/wiki/Lianhe_Wanbao), [Shin Min Daily News](/wiki/Shin_Min_Daily_News) and [The New Paper](/wiki/The_New_Paper), retracting all his earlier statements in advertisements that cost him [S$](/wiki/Singapore_dollar)33,372.06 in total. ### Investigation On 31 May 2010, the Office of the Commissioner of Charities (COC) and the [Commercial Affairs Department](/wiki/Commercial_Affairs_Department) (CAD) of the [Singapore Police Force](/wiki/Singapore_Police_Force) announced in a joint press statement that 17 individuals linked to the City Harvest Church, including church founder Pastor Kong Hee and his deputy, Pastor Tan Ye Peng, were under investigation after complaints alleging the misuse of church funds. The police launched investigations into possible falsification of accounts and criminal breach of trust amounting to millions of dollars which dated back a number of years. The investigation followed requests by church members for the COC to review the church's constitution, which denied ordinary members the chance to attend general meetings, or be privy to its annual reports and financial statements. Some members felt that the church board had utilized the church's building fund and committed it to \"future liabilities\" without consulting members at its latest AGM. ## Trial In June 2012, Kong Hee and four other members of the church were arrested by the [Commercial Affairs Department](/wiki/Commercial_Affairs_Department) of the [Singapore Police Force](/wiki/Singapore_Police_Force). Charges were filed against the five individuals and who were released on $500,000 bail each. In July, charges were brought on one additional former finance director with the last of the pre-trial conferences set for 22 November. When the trial started on 15 May 2013, some Christians expressed concern that the slow pace of the trial may have a negative impact on public opinion. On the same day as the initial arrests, the COC released a press statement detailing the results of its inquiry stating there were misconduct and mismanagement in the administration of the charity. There were irregularities of at least $23 million in the charity's funds, which were used to finance Sun Ho's secular music career. There was also a concerted effort to conceal this movement of funds from stakeholders. Eight members including the five arrested such as Chew Eng Han and Sharon Tan, [Sun Ho](/wiki/Ho_Yeow_Sun) and the two others were suspended from their duties with the charity while the COC considered further course of action under the [Charities Act](/wiki/Charities_Act_1994). $24 million was taken from church building funds and put into sham investment bonds in Ho's artist management firm Xtron Productions and glass maker Firna. After church auditors raised questions about the bond investments, an additional $26.6 million was moved around to \"create the false appearance that the purported sham bond investments had been redeemed\" in what the accounting industry calls \"round-tripping\". The church stood by the five accused, stated that money for the investment bonds were returned to the church in full, with interest, and it did not lose any funds in the transactions, indicating that the accused \"always put God and CHC first.\"** Revelations were made about a multi-purpose account (MPA) involving Kong Hee and his wife Sun Ho set up in 2006 and closed in 2010, made up of \"love gifts\" worth $2,888,334 from church members as well as $359,530 from an Indonesian businessman Wahju Hanafi. The Commissioner of Charities warned the church and its employees against raising funds for legal expenses. The church was also warned against paying the legal fees of the 6 accused. The chief prosecution led by Mavis Chionh noted the absence of a crucial board meeting between August and September 2008 as being without any meeting minutes, and also charged that Wahju Hanafi was the other beneficiary of funds allegedly diverted from City Harvest Church to further Sun Ho's music career. ## Conviction On 21 October 2015, all six accused were found guilty of all criminal breach of trust charges pertaining to 409 read with section 109 of the Penal Code, Chapter 224. Falsification of Accounts under section 477A of the Penal Code, Chapter 224. The judge called the case \"unique and without precedent\" and agreed with the defence that there was \"a lack of any personal wrongful gain, any motive of self-interest or enrichment, and the absence of an intent to cause permanent loss\" to the church as the funds were ultimately returned. Nevertheless, the accused were still found guilty of serious offences. Alongside the conviction, other pastors and Christians began speaking out regarding the trial which was the second longest in Singapore history with the trial stretching over 140 days. List of accused and convicts NameConviction**Serina Wee**Former finance manager of CHC, was found guilty of six counts of criminal breach of trust and four counts of falsifying the church's accounts. The prosecutor labelled her as the most inextricably involved in the conspiracy due to her role as administrator of the Crossover project.**Sharon Tan**Former finance manager of CHC, was found guilty of three counts of criminal breach of trust and four counts of falsifying the church's accounts. The prosecutor noted her defense was deeply cynical and self-serving, attempting to minimise her involvement in the offences.**Chew Eng Han**CHC board member, was found guilty of six counts of criminal breach of trust and four counts of falsifying church accounts. The prosecutor noted that his defense was incoherent while lacking credibility.**Tan Ye Peng**Founding member and Deputy Senior Pastor of CHC, was found guilty of six counts of criminal breach of trust and four counts of falsifying the church's accounts.**John Lam**Former secretary of the church's management board, was found guilty of three counts of criminal breach of trust. The prosecutor noted that he was the [inside man](/wiki/Traitor) in church governance and oversaw bodies that prevented the sham investment bonds from being discovered.**Kong Hee**Senior Pastor and founder of the church, was found guilty of three counts of criminal breach of trust. The prosecutor noted that he had not maintained a consistent position on critical factual issues. The six accused, and the Prosecution, have all filed appeals on their conviction, with the prosecution calling the current sentences \"manifestly inadequate\". The appeals were heard over five days from 19 to 23 September 2016. In July 2016, Chew filed a new police report against eight members of the church, including Kong Hee and Sun Ho. Chew alleged that this was for \"fraudulent misrepresentation of vital facts about the church which induced me and other members to give our donations, and also for use of funds for purposes other than what was represented to the members of the church.\" In May 2017, the Commissioner of Charities permanently barred the six convicted from having overall administrative control of any charity. In addition, two other church employees, Kelvin Teo Meng How and Tan Su Pheng Jacqueline, who had been suspended from their respective positions since 2013, were issued warning letters. On 21 February 2018, Chew Eng Han attempted to flee Singapore illegally for Malaysia, absconding from Pulau Ubin by boat. Chew Eng Han and the boat driver, Tan Poh Teck, were arrested at sea on the same day. Chew was subsequently charged the next day with Tan charged with helping Chew to flee Singapore. On 12 December the same year, Chew was found guilty of trying to escape Singapore and defeat justice and hence sentenced to an additional 13 months jail on 29 January 2019. Several others were arrested and convicted for their roles in the attempted escape. Khoo Kea Leng, who was arrested on 26 February 2018 and charged two days later, was sentenced to six months jail on 12 April the same year for helping Chew to escape. Tan Kim Ho, who was arrested on 15 April 2018 and charged a day later, was sentenced on 13 July the same year to 6 months jail for arranging Chew's escape. On the same day, Tan Poh Teck was sentenced to 27 weeks jail for helping Chew escape. ### Appeal On 7 April 2017, the outcome of the appeal against the conviction and sentences of the six accused resulted in the length of their jail term approximately halved. On 1 February 2018, the prosecutors' appeal to reinstate the original jail terms was dismissed by the Court of Appeal as the High Court had set the jail terms based on wrong interpretation of the meaning of \"agent\" in section 409 of the Penal Code hence they were charged under the 'less serious' section 406 instead. List of accused and sentence NameOriginal sentenceAfter appeal**Serina Wee**5 years2 years and 6 months**Sharon Tan**21 months7 months**Chew Eng Han**6 years3 years and 4 months**Tan Ye Peng**5 years 6 months3 years and 2 months**John Lam**3 years1 year 6 months**Kong Hee**8 years3 years and 6 months With the exception of Chew, five of the group began their sentences on 21 April 2017. Chew, who had been on bail pending the appeal, was granted permission by the court to begin his sentence on 22 February 2018. On 21 February a day before Chew was due to start his sentence he was arrested for trying to flee Singapore unlawfully and was subsequently charged by the police. Meanwhile Sharon Tan completed her sentence and was released from jail. Chew started his jail term on 1 March 2018. The Malaysian boatman, Tan Poh Teck, charged with abetting his escape is sentenced to a jail term of 6 months. His brother, Chew Eng Soon, was arrested for abetting Chew Eng Han in leaving Singapore unlawfully, he was later released on bail on 23 February 2018. The S$50 million taken from the mega-church’s coffers is the largest amount of charity funds ever misappropriated in Singapore. ## Reaction Expressing his disappointment by the Court of Appeal's decision to overrule a 1976 High Court decision, which had held that company directors could be convicted for criminal breach of trust under section 409 of the Penal Code, [Minister for Law](/wiki/Minister_for_Law) [K Shanmugam](/wiki/K_Shanmugam) said, “The government believes the sentences are too low. But the sentences reflect the law as it stands after the High Court’s decision last year confirmed by the Court of Appeal. The courts decide these matters. All of us have to respect the decision regardless of whether we agree or disagree with it.” “It is now up to Parliament to amend the law, and that we should do soon. We will ensure that legislation provides for higher penalties for directors and other senior officers who commit criminal breach of trust,” he added. - [Sun Ho](/wiki/Sun_Ho) - [Phil Pringle](/wiki/Phil_Pringle) - [Jim Bakker](/wiki/Jim_Bakker) - [City Harvest Church](/wiki/City_Harvest_Church) - [Corruption in Singapore](/wiki/Corruption_in_Singapore)\n",
  "language": "en",
  "processed_at": "2026-01-12T10:04:13.513670",
  "title": "City Harvest Church criminal breach of trust case",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/City_Harvest_Church_criminal_breach_of_trust_case"
}