{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:04:11.551881"
  },
  "content": "Singaporean real estate organisation **City Developments Limited** (**CDL**), sometimes also known as **CityDev**, is a [Singaporean](/wiki/Singaporean) [multinational](/wiki/Multinational_corporation) real estate operating organisation. Founded in 1963, CDL first developed projects in [Johor Bahru](/wiki/Johor_Bahru), Malaysia, as well as in Singapore. However, due to the racial and political situation in Singapore and Malaysia, CDL was forced to sell its properties in Johor Bahru and consolidate itself into the Singapore market. CDL came under the control of Hong Leong Bank via shares acquisition in 1969. Since then, CDL has developed numerous types of properties from shopping malls to integrated developments. CDL is currently headquartered in [Republic Plaza, Singapore](/wiki/Republic_Plaza_(Singapore)). [Kwek Leng Beng](/wiki/Kwek_Leng_Beng) is its current chairman and [Sherman Kwek](/wiki/Sherman_Kwek), Kwek Leng Beng's son, is its current chief executive officer. CDL also owns many subsidiaries, including [Millennium & Copthorne Hotels](/wiki/Millennium_%26_Copthorne_Hotels). ## History ### Early years City Developments Limited was founded on 7 September 1963 as a property company, initially starting with eight employees in Amber Mansions on [Orchard Road](/wiki/Orchard_Road). The company subsequently listed on the Malayan Stock Exchange (present-day [Singapore Exchange](/wiki/Singapore_Exchange)) in November of the same year. When the company first started, it built its first project in [Johor Bahru](/wiki/Johor_Bahru), [Malaysia](/wiki/Malaysia); a 200-unit bungalow development called Fresh Breezes, which was completed in 1965. With Fresh Breezes, CDL introduced the concept of a \"[show house](/wiki/Show_house)\" as a sales technique, which was \"believed to be unique in Asia\". It allows prospective buyers to preview how a property looks like before buying the property. It built its second project in Johor Bahru called Marine Vista, a project that has expansive views of the [Straits of Johor](/wiki/Straits_of_Johor). CDL built its first Singapore project called City Towers in [Bukit Timah](/wiki/Bukit_Timah), which was completed in 1966. This was said to be Singapore's first high-rise project. It also built Singapore's first condominium concept project, Clementi Park, in the same year. ### Acquisition by Hong Leong CDL was unprofitable for its first seven years' of operations, with the [race riots](/wiki/1969_race_riots_of_Singapore) in 1969 and withdrawal of British troops from Singapore, which affected the property markets in Malaysia and Singapore. Thus, CDL was forced to sell its properties in Johor Bahru and consolidated itself into the Singapore market. [Hong Leong Group](/wiki/Hong_Leong_Group) began to invest in CDL in 1969, buying a substantial stake which allowed them to place three directors on CDL's board. In 1972, [Kwek Leng Beng](/wiki/Kwek_Leng_Beng), then an executive in Hong Leong Group, led an acquisition of a controlling stake in CDL, transforming CDL into the core publicly traded entity of Hong Leong Group. Kwek Leng Beng later became the managing director of CDL in 1974, and the executive chairman in 1995 after the death of his father, [Kwek Hong Png](/wiki/Kwek_Hong_Png). [Kwek Leng Joo](/wiki/Kwek_Leng_Joo), the younger brother of Kwek Leng Beng, became the managing director. Capitalising on the strong economic growth which transformed Singapore into an industrialised nation, CDL grew rapidly with a market capitalisation of [S$](/wiki/Singapore_dollar)6 billion in 1995. Its flagship building, [Republic Plaza](/wiki/Republic_Plaza_(Singapore)), was officially opened on 18 January 1998 by then [Prime Minister of Singapore](/wiki/Prime_Minister_of_Singapore) [Goh Chok Tong](/wiki/Goh_Chok_Tong). With Hong Leong Group's investments into CDL, CDL's industrial properties was offloaded into Hong Leong Holdings, a subsidiary of Hong Leong Group. It then diversified into hospitality industry through the establishment of CDL Hotels International (CDLHI) in 1989. CDLHI acquired hotel properties across Asia, Europe, and United States. Leveraging on the Millennium and Copthorne brands, CDL listed [Millennium & Copthorne Hotels](/wiki/Millennium_%26_Copthorne_Hotels) (M&C) on [London Stock Exchange](/wiki/London_Stock_Exchange) (LSE) in 1996. More hotel properties and brands were acquired and consolidated under M&C. M&C also would come to manage hotels owned by other firms across the world. As part of a restructuring exercise in 1999, CDLHI renamed to City e-Solutions Limited in 2000 with a focus on CDL's efforts to develop hospitality related internet businesses and other e-commerce business initiatives in various industries. ### 21st century During the [2008 financial crisis](/wiki/2008_financial_crisis), of which Singapore was affected, its financial performance was affected by its exposure to the [Sterling Pound](/wiki/Sterling_Pound), as the [Singapore dollar](/wiki/Singapore_dollar) had strengthened against it, via its [United Kingdom](/wiki/United_Kingdom)-centric M&C. However, it managed to remain one of the largest real estate development firms in Singapore post recession. In 2014, CDL appointed Grant Kelley into the newly created chief executive officer (CEO) role, capitalising on Kelley's prior international experience. The managing director role was abolished as well, and Kwek Leng Beng became a deputy chairman. Under Kelley's leadership, CDL diversified its operations away from the Singapore market, focusing on the Australian, Chinese, Japanese and British markets. At the same time in 2015, [Sherman Kwek](/wiki/Sherman_Kwek), the elder son of Kwek Leng Beng was appointed as a deputy CEO as part of the Kwek family's succession plan in CDL management. In 2018, Sherman Kwek became the chief operating officer. In June 2019, M&C's board agreed to recommend a takeover offer, valuing the business at £2.23 billion, from CDL for the shares it did not already own. The transaction became unconditional in September 2019. M&C was delisted from LSE on 11 October, and effectively making M&C a full subsidiary of CDL. In May 2019, CDL made further investments into China with a 24% share acquisition of Sincere Property Group with a RMB 2.75 billion loan and a further RMB 2.75 billion [tranche](/wiki/Tranche). In April 2020, CDL renegotiated with Sincere to increase its shareholding in Sincere to 51.01% of its shares for a further RMB 4.39 billion due to the impact of the [COVID-19 pandemic](/wiki/COVID-19_pandemic). This brought the total investments by CDL up to SGD 1.8 billion. However, new pending regulatory changes in China introduced in August 2020, to limit the amount of debt owed by real estate companies, lead to concerns on Sincere's liquidity position by CDL. At end of 2019, Sincere's liability made up of 68% of its assets, close to the 70% ceiling in the pending regulations. On 22 October 2020, its announced that Kwek Leng Peck, a cousin of Kwek Leng Beng and a longstanding director resigned in disagreement with CDL's board on the investments into Sincere, and its management of M&C. By 30 December 2020, disagreements over the Sincere investments led to the further resignations of another two independent directors. A working group was established within CDL to directly oversee and improve on Sincere's liquidity and profitability. On 26 February 2021, CDL wrote down 93% of its investments, SGD 1.78 billion, for its 2020 fiscal year. In March 2021, Sincere missed a repayment on the principal of a bond, which it alleged that due to key matters requiring CDL's approval, causing Sincere to miss the repayment deadline. CDL refuted the claim, stating that the key decisions are jointly agreed upon and it does not have majority control of the board. In 2024, the company is acquiring Yardhouse in central [London](/wiki/London) for $148.6 million for a 250-year lease and is CDL's first project in the private rented sector in this location. The site will include a 17-storey apartment block and a 7-storey block next to the site for [Women's Pioneer Housing](/wiki/Women%27s_Pioneer_Housing) (WPH), a [not-for-profit organization](/wiki/Not-for-profit_organization) providing single women with access to safe, secure and [affordable housing](/wiki/Affordable_housing) and services. ### 2025 boardroom dispute On 26 February 2025, Kwek Leng Beng accused his son, Sherman Kwek, of orchestrating a [boardroom coup](/wiki/Boardroom_coup). Kwek claimed that Sherman attempted to push through the appointment of two new independent directors without full board approval, despite a written resolution which formalised their appointments. Kwek also accused Sherman for restructuring the board committees and governance framework, in an attempt to bypass the company's nomination committee. In response, Kwek Leng Beng had sought to remove his son on 8 February, and proceeded to file court papers seeking to \"restore corporate integrity\". Kwek expressed intentions to replace the CEO \"at the appropriate time\". The boardroom dispute broke out after the company announced a 37% drop in its net profit from the previous year to S$201.3 million ($150.5 million). The dispute led to a temporary suspension of trading for CDL shares, though the company's business operations continued as usual. Some analysts, such as JP Morgan and OCBC Investment Research, have downgraded the company's stock due to uncertainties regarding the company's outlook and potential share price overhang. Despite being part of the same conglomerate with CDL, Hong Leong Asia said the dispute has no impact on Hong Leong Asia's business. Sherman Kwek expressed \"disappointment\" with his father's actions as \"extreme\" and argued that the legal move was not authorised by the majority of the board. He defended the new appointments, stating they were made \"to strengthen CDL’s board\" and emphasized that the changes were \"never about ousting our esteemed chairman\". Sherman accused his father's associate, Catherine Wu, as the source of a dispute and claimed she wielded \"huge influence\" in matters \"beyond her scope\". In response, Sherman proposed a resolution which affirmed that Wu has no authority to influence or advise CDL and M&C directors, management, or staff, and another resolution which terminate the advisory agreement with M&C, where Wu is a board adviser. The resolutions were passed with a board majority on 21 February. Wu resigned as independent adviser to the M&C board on 4 March. Kwek Leng Beng dismissed his son's insinuations against Wu as \"unproven\" and stated that with her resignation, his son's directors no longer had grounds to make corporate governance allegations against CDL or justify the board coup. On 12 March, Kwek announced his decision to withdraw the lawsuit against the board resolutions. He cited the board members' agreement to \"put aside their differences\" for the \"greater good\" of CDL and its stakeholders. Jennifer Duong Young and Su Yen Wong, who were appointed as directors, will remain on the CDL board. CDL shares increased by more than 3% following the news. ## Sustainability and social efforts CDL's Chief Sustainability Officer is [Esther An](/wiki/Esther_An), who joined the company in 1995. CDL formalised its sustainability efforts in 1995 with the adoption of its ethos *Conserving as we Construct*. In 2003, CDL established its corporate [environment, health and safety](/wiki/Environment,_health_and_safety) policy. It then acquired [ISO 14001 certification](/wiki/ISO_14000#ISO_14001_standard) (Environmental Management System) from the local governing authority, [Building and Construction Authority](/wiki/Building_and_Construction_Authority) (BCA) in the same year. It subsequently acquired certifications in [ISO 50001 – Energy Management System](/wiki/ISO_50001) in 2014, and [ISO 14064-1](/wiki/ISO_14064) – on quantification and reporting [greenhouse gas](/wiki/Greenhouse_gas) inventory in 2016, ahead of its competitors in the property development industry. In 1998, CDL became the first developer to install energy saving lifts, which allowed up to 50% savings of energy usage, in a residential property project, the Florida Executive Condominium. It also installed [twin-chute pneumatic refuse collection system](/wiki/Automated_vacuum_collection) in selected condominiums, where refuse and recyclables, disposed separately at residents' doorsteps, being transported to a central collection area. In 2009, CDL developed the 11 Tampines Concourse, Asia's first CarbonNeutral development, and [City Square Mall](/wiki/City_Square_Mall), Singapore's first \"eco-mall\" with a number of eco-friendly facilities. In 2012, CDL sought to retrofit [Republic Plaza](/wiki/Republic_Plaza_(Singapore)), and upgraded its BCA Green Mark category from Gold to Platinum in the process. Its retrofits included an upgraded chiller plant, energy efficient lights, and motion sensors to reduce energy wastage. In 2017, CDL issued a [green bond](/wiki/Green_bond) to repay a loan for the retrofitting efforts, the first such bond in Singapore. In 2008, CDL adopted [Global Reporting Initiative](/wiki/Global_Reporting_Initiative)'s reporting framework for its sustainability report, becoming the first in Singapore to do so, which eventually was given an A+ rating in 2012's edition. In the same year, CDL also had started disclosing its carbon emissions with the [Carbon Disclosure Project](/wiki/Carbon_Disclosure_Project) publicly, making it the first Singaporean company to do so. CDL would eventually score itself A grades in 2019, making it one of the 170 companies listed on DCP's annual \"A List\". In 2019, according to [Corporate Knights](/wiki/Corporate_Knights), CDL had the second highest score in terms of sustainability in Asia Pacific. In 2020, the company was ranked third. The reason for this was an increase in energy usage. In 2015, CDL became the first Singaporean company to embrace the United Nation's Sustainable Development Goals (SDGs). In 2021, CDL aligned their internal [environmental, social and corporate governance (ESG)](/wiki/Environmental,_social,_and_governance) with the United Nation's Sustainable Development Goals (SDGs). In 2022, a CDL Future Value 2030 Sustainability Blueprint was produced to further these goals. In addition, CDL was recognised for [gender equality](/wiki/Gender_equality) efforts along with [DBS Bank](/wiki/DBS_Bank) in the Bloomberg's inaugural Gender-Equality Index (GEI) published in 2018. City Developments was among the first five companies based in [Singapore](/wiki/Singapore) to adopt the recommendations of the Task Force on Nature-related Financial Disclosures (TNFD) and commit to including nature-related disclosures in their annual reports. There are 134 companies in the [Asia-Pacific](/wiki/Asia-Pacific) region—representing 42 per cent of the total of 320 companies that have accepted the recommendations at an early stage. CDL is set to start publishing from fiscal 2024, with the other four companies starting in 2025. ## Group structure In the financial year of 2019[update], CDL reported having 248 subsidiaries, 53 associated companies, 12 trusts and 6 limited partnerships. ### Notable subsidiaries #### CBM Established in 1971, CBM Pte Ltd provided in-house engineering, cleaning and security services for CDL's properties. In 2007, capitalising on the capabilities in relation to facilities management gained over the years, CBM began taking on contracts from external clients across different sectors, such as [Ministry of Defence](/wiki/Ministry_of_Defence_(Singapore)) and [Ministry of Home Affairs](/wiki/Ministry_of_Home_Affairs_(Singapore)). In 2011, CBM extended itself into developing carpark equipment for commercial and government owned carparks in Singapore, then carpark management services in Taiwan in 2014. #### Millennium & Copthorne Hotels CDL had diversified its property investments after being controlled by Hong Leong Group, beginning with the establishment of CDL Hotels International (CDLHI) in 1989. Through CDLHI, CDL purchased hotels first within the Asian region, then further acquisitions in [United States](/wiki/United_States) and [Europe](/wiki/Europe). With its acquired hotels being renamed to include the Millennium brand, CDLHI established the Millennium Hotels And Resorts global brand in 1995. On 8 October 1995, [Aer Lingus](/wiki/Aer_Lingus) sold Copthorne Hotels to CDL for [£](/wiki/Pound_sterling)219,000,000 (equivalent to about £531,763,797 in 2023). [Millennium & Copthorne Hotels](/wiki/Millennium_%26_Copthorne_Hotels) (M&C) was subsequently listed on [London Stock Exchange](/wiki/London_Stock_Exchange) (LSE) in 1996 and more hotel properties and brands were acquired and consolidated under M&C. Concurrently, CDLHI became City e-Solutions Limited to focus on hospitality related internet businesses. M&C also would come to manage hotels owned by other firms across the world. In 2019, CDL privatised and made M&C a wholly owned subsidiary. ### Notable partnerships In 2018, CDL and [CapitaLand](/wiki/CapitaLand) teamed up as a consortium for the [Sengkang Central](/wiki/Sengkang) tender, which they eventually won with a top bid of S$777.8 million. Details of the development were released the following year with completion by 2022, being a 3.7-hectare mixed-use development next to [Buangkok MRT station](/wiki/Buangkok_MRT_station) with a three-storey mall, a hawker centre and childcare centre, a community club which will be Singapore's largest and a 680-unit condominium. The condominium and mall have since been named the Sengkang Grand Residences and Sengkang Grand Mall. In 2019, CDL became involved in a consortium with CapitaLand and [Ascott Residence Trust](/wiki/The_Ascott#Ascott_Residence_Trust) to redevelop the [strata titles](/wiki/Strata_title) that [Liang Court](/wiki/Liang_Court) shopping mall and its adjacent buildings, a hotel and a serviced apartment, are built on into an integrated development of a shopping mall, hotel, serviced apartments, and private residential towers. CDL and CapitaLand came to own Liang Court after a S$400 million purchase in the same year. ## Notable projects CDL's portfolio spans integrated developments, shopping malls, hotels, offices and homes. Its integrated developments include King's Centre, Sunshine Plaza, Quayside Isle @ [Sentosa Cove](/wiki/Sentosa_Cove), [South Beach Tower](/wiki/South_Beach_Tower), and Sengkang Grand Mall. In residential development, the company is also noted for integrating heritage buildings. A prominent example is [House at 9 Buckley Road](/wiki/House_at_9_Buckley_Road), a 1932 bungalow that was the former family home of the group's founder [Kwek Hong Png](/wiki/Kwek_Hong_Png). The house was conserved and repurposed as the clubhouse for CDL's Buckley Classique condominium, creating a direct link between the family history of its Executive Chairman, [Kwek Leng Beng](/wiki/Kwek_Leng_Beng), and the company's modern portfolio. Current projects in progress include the redevelopment of Liang Court, which will be completed in stages from 2024, and Piccadilly Grand. Under its portfolio of shopping malls, it owns [Katong Shopping Centre](/wiki/Katong_Shopping_Centre),[a] [Palais Renaissance](/wiki/Palais_Renaissance),[b] [Tanglin Shopping Centre](/wiki/Tanglin_Shopping_Centre), [Delfi Orchard](/wiki/Delfi_Orchard),[c] and [City Square Mall](/wiki/City_Square_Mall). It also used to manage [Lot One](/wiki/Lot_One) and [Chinatown Point](/wiki/Chinatown_Point) before being sold to CapitaLand and Perennial (Singapore) Retail Management respectively. The majority of CDL's hotels are operated under the Millennium & Copthorne Hotels brand, which spans many countries around the world. Other hotels owned by CDL include The St. Regis Singapore, W Singapore Sentosa Cove, JW Marriott hotel in South Beach and Millennium Hilton Bangkok in Thailand. CDL's office portfolio includes City House (which was its former headquarters before moving to Republic Plaza), The Arcade,[d] [Fuji Xerox Towers](/wiki/Fuji_Xerox_Towers),[e] Fortune Centre,[f] and [Republic Plaza](/wiki/Republic_Plaza_(Singapore)). CDL's homes portfolio include [The Sail @ Marina Bay](/wiki/The_Sail_@_Marina_Bay), and [One Shenton Way](/wiki/One_Shenton_Way). ## Notes - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T10:04:11.551533",
  "title": "City Developments Limited",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/City_Developments_Limited"
}