{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:04:09.043317"
  },
  "content": "Defunct administrative council for the City of Singapore The **City Council of Singapore** was the municipal authority for the [City of Singapore](/wiki/City_of_Singapore_(historical_entity)), responsible for essential public services such as the provision of water, electricity, gas, roads and bridges and street lighting. The first fully elected council was formed after the [1957 City Council election](/wiki/1957_Singapore_City_Council_election), which was followed by a single by-election in (/wiki/1958_Singaporean_City_Council_by-election). Before 1957, voting rights were limited and the council included appointed members. The City Council was first established in 1951 when Singapore was conferred city status, replacing the [Municipal Council](/wiki/Municipal_Commission_of_Singapore). The council was dissolved in 1959 by the [People's Action Party](/wiki/People%27s_Action_Party) (PAP) when Singapore attained self-governance from the [British Empire](/wiki/British_Empire), and was later formally abolished following [Singapore's independence from Malaysia](/wiki/Independence_of_Singapore_Agreement_1965) in 1965. Following its dissolution, municipal responsibilities previously managed by the City Council were transferred to various [statutory boards](/wiki/Statutory_boards_of_the_Singapore_Government). This system remained in place until 1988, when the management of local municipal functions was reassigned from the [civil service](/wiki/Singapore_Civil_Service) to newly established [town councils](/wiki/Town_Council_(Singapore)). Unlike the City Council, these town councils do not hold separate local elections and are instead administered by the elected [Member of Parliament](/wiki/Parliament_of_Singapore) (MP) for their respective [constituencies](/wiki/Constituencies_of_Singapore). ## History As a British colony, Singapore was conferred city status by a [royal charter](/wiki/Royal_charter) from [King George VI](/wiki/George_VI) in 1951, when Singapore was then a [Crown colony](/wiki/Crown_colony) of the [United Kingdom](/wiki/United_Kingdom). The original Municipal Council was therefore renamed City Council, and the Municipal Building was renamed [City Hall](/wiki/City_Hall,_Singapore). In 1965, upon Singapore's expulsion from [Malaysia](/wiki/Malaysia), the Republic of Singapore Independence Act 1965 provided the following clause \"*[President](/wiki/President_of_Singapore) may by order make such modifications in any written law as appear to him to be necessary or expedient in consequence of the abolition of the City Council and of the Rural Board and of the assumption of the powers of the local authorities by the [Government](/wiki/Singapore_Government).*\" that empowered the president to abolish the City Council and the Rural Board, with the powers of the local authorities assumed by the government. The City Council of the City of Singapore and the Singapore Rural Board were abolished in 1965. [Ong Eng Guan](/wiki/Ong_Eng_Guan) was Singapore's first elected mayor in 1957 and continued to run the City Council from December 1957 till April 1959. In its final years, the City Council signed the *Tebrau and Scudai Rivers Water Agreement* in 1961 and the *Johor River Water Agreement* in 1962 with the [Johore State Government](/wiki/Johor#Politics) of the [Federation of Malaya](/wiki/Federation_of_Malaya), which remains in effect till this day. ## Elections Prior to the 1957 City Council elections, franchise was limited and the council was party appointed. From 1949 to 1953 there were 6 seats on council: - [1949 (2 April)](/wiki/April_1949_Singaporean_Municipal_Commission_election) - [1949 (7 November)](/wiki/December_1949_Singaporean_Municipal_Commission_election) - [1950 (2 December)](/wiki/1950_Singaporean_Municipal_Commission_election) - [1951 (1 December)](/wiki/1951_Singaporean_City_Council_election) - [1952 (6 December)](/wiki/1952_Singaporean_City_Council_election) - [1953 (5 December)](/wiki/1953_Singaporean_City_Council_election) After 1953 the yearly elections ended and the council term lasted 4 years. The elections in (/wiki/1957_Singapore_City_Council_election) and (/wiki/1958_Singapore_City_Council_by-election) eliminate all appointed seats on council. The number of seats increased to 32 for the last two elections before council was abolished in 1959. - [Elections in Singapore](/wiki/Elections_in_Singapore) - [History of Singapore](/wiki/History_of_Singapore) - [City Hall (Singapore)](/wiki/City_Hall,_Singapore) - [Singapore Municipal Commission](/wiki/Singapore_Municipal_Commission) - [Town Council](/wiki/Town_Council_(Singapore))\n",
  "language": "en",
  "processed_at": "2026-01-12T10:04:09.042861",
  "title": "City Council of Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/City_Council_of_Singapore"
}