{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:04:21.491388"
  },
  "content": "Monument in Singapore The **Memorial to the Civilian Victims of the Japanese Occupation**, usually called the **Civilian War Memorial** ([Chinese](/wiki/Simplified_Chinese_characters): 日本占领时期死难人民纪念碑; [Malay](/wiki/Malay_language): *Tugu Peringatan Bagi Mangsa Awam Pemerintahan Jepun*; [Tamil](/wiki/Tamil_language): ஜப்பானியர் ஆதிக்க காலத்தில் உயிர் துறந்த பொதுமக்களுக்கன நினைவுச் சின்னம்), is a war memorial and heritage landmark in Singapore next to [Esplanade MRT station](/wiki/Esplanade_MRT_station). It was built in memory of the civilians killed during the [Japanese occupation of Singapore](/wiki/Japanese_occupation_of_Singapore) during [World War II](/wiki/World_War_II). The Civilian War Memorial sits on serene parkland in the midst of busy city traffic near Singapore's [Padang](/wiki/Padang,_Singapore) and [City Hall](/wiki/City_Hall,_Singapore). Located within the [War Memorial Park](/wiki/War_Memorial_Park,_Singapore) at [Beach Road](/wiki/Beach_Road,_Singapore) within the [Central Area](/wiki/Central_Area,_Singapore), [Singapore](/wiki/Singapore)'s [central business district](/wiki/Central_business_district), it is usually easy to spot in most backdrops encompassing the CBD landscape. It was gazetted as the 65th national memorial on 15 August 2013. ## History During the [Empire of Japan](/wiki/Empire_of_Japan)'s occupation of Singapore during the [Pacific War](/wiki/Pacific_War) (1942–1945), thousands of ethnic Chinese were killed in the [Sook Ching massacre](/wiki/Sook_Ching_massacre). In an effort to remove anti-Japanese elements in Singapore, Chinese men between the ages of 18 and 50 were to report to the [Kempeitai](/wiki/Kempeitai), the [Imperial Japanese Army](/wiki/Imperial_Japanese_Army) [military police](/wiki/Military_police). The death toll was reported to be 6,000 by the Japanese, but official estimates range between 25,000 and 50,000. In February 1962, remains belonging to civilian victims of the Japanese occupation were unearthed in areas like [Siglap](/wiki/Siglap), [Changi](/wiki/Changi) and [Bukit Timah](/wiki/Bukit_Timah). The [Singapore Chinese Chamber of Commerce and Industry](/wiki/Singapore_Chinese_Chamber_of_Commerce_and_Industry) (SCCC) undertook the responsibility of gathering the remains and creating a memorial. ### The Civilian War Memorial project On 13 March 1963, [Prime Minister](/wiki/Prime_Minister_of_Singapore) [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) set aside a plot of land at Beach Road for the building of a memorial dedicated to the civilians killed in World War II. The SCCC set up a fund committee that was later enlarged to include all ethnic groups due to good response from the community. With the support of the [Government](/wiki/Government_of_Singapore) and contributions from the public, construction of the memorial was able to start. ### Architecture The design of the memorial was conceived by Leong Swee Lim of [Swan & Maclaren Architects](/wiki/Swan_%26_Maclaren_Architects) whom it won first prize in an open design competition in that month. The design was one of Leong's most famous and significant contributions towards Singapore's architecture. The four identical pillars, each 70 metres (230 ft) high, represent the shared experiences and unity of the four major [races of Singapore](/wiki/Race_in_Singapore);– Chinese, Eurasian, Indian and Malay. ### Ground-breaking ceremony On 15 June 1963, Lee Kuan Yew performed the ground-breaking ceremony of \"turning (or breaking) the sod\" to lay the foundation for the memorial witnessed by a gathering of representatives from the Inter-Religious Organisation and members of the consular corps. Construction of the memorial began on 23 April 1966. A ceremony was held on 1 November that year before the completion of the memorial, which saw 606 urns containing the remains of thousands of unknown civilians from the mass graves interred on either side of the memorial podium, added to the material significance of the structure whose history it represents. ## Unveiling of the Memorial The memorial was completed in January 1967 at a total construction cost of about [S$](/wiki/Singapore_dollar)500,000. On 15 February that year, the Civilian War Memorial was officially unveiled by then Prime Minister Lee Kuan Yew, who laid a wreath at the memorial. The memorial is one of Singapore's iconic heritage landmarks that truly embraces the virtues of a multiracial and multicultural city, the unity of which is inevitably one of the pillars for Singapore's modern day success, harmony and prosperity. The memorial has also been affectionately described by some as resembling four giant chopsticks. Every year on 15 February ([Total Defence Day](/wiki/Total_Defence_Day) in Singapore, commemorating the 1942 surrender of Singapore to the Japanese), a memorial service is held at the Civilian War Memorial to remember the victims of the war. ## National monument On 15 August 2013, the Civilian War Memorial was gazetted by the [National Heritage Board](/wiki/National_Heritage_Board_(Singapore)) as 65th National monument of Singapore. ## Gallery - [Battle of Singapore](/wiki/Battle_of_Singapore) - [History of Singapore](/wiki/History_of_Singapore) - [Former Indian National Army Monument](/wiki/Former_Indian_National_Army_Monument) - [Kranji War Memorial](/wiki/Kranji_War_Memorial) - [Lim Bo Seng Memorial](/wiki/Lim_Bo_Seng_Memorial) - [Monument to the People's Heroes (Shanghai)](/wiki/Monument_to_the_People%27s_Heroes_(Shanghai)), a monument with architectural similarities - [The Cenotaph, Singapore](/wiki/The_Cenotaph,_Singapore) ## Notes - Devi, G. Uma [*et al.*] (2002), *Singapore's 100 Historic Places*, Singapore: [National Heritage Board](/wiki/National_Heritage_Board_(Singapore)); Archipelago Press, [ISBN](/wiki/ISBN_(identifier)) 978-981-4068-23-9. - Lim, Lisa (9 April 2006), *1966 – The Civilian War Memorial*, [Ministry of Defence](/wiki/Ministry_of_Defence_(Singapore)), archived from the original on 6 October 2007.\n",
  "language": "en",
  "processed_at": "2026-01-12T10:04:21.491104",
  "title": "Civilian War Memorial",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Civilian_War_Memorial"
}