{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:04:25.269244"
  },
  "content": "Planning area and HDB Town in SingaporePlanning area and HDB town in West Region, Singapore **Clementi** ([IPA](/wiki/International_Phonetic_Alphabet): /kləˈmɛnti/ *klə-MEN-tee*, locally /ˈklɛmənti/ *KLEM-ən-tee*) is a [planning area](/wiki/Planning_Areas_of_Singapore) and [residential town](/wiki/New_towns_of_Singapore) located at the easternmost fringe of the [West Region](/wiki/West_Region,_Singapore) of [Singapore](/wiki/Singapore). The town borders [Bukit Batok](/wiki/Bukit_Batok) to the north, [Bukit Timah](/wiki/Bukit_Timah) to the northeast, [Queenstown](/wiki/Queenstown,_Singapore) to the east and [Jurong East](/wiki/Jurong_East) to the west. ## Etymology The planning area of Clementi derives its name from Clementi Road, the main traffic route that still runs into the district to this day. It was once known as Reformatory Road as there was a boys' home situated along the road. In 1947, the Singapore Rural Board discussed renaming the road. Their original intention was to name it after [Sir Hugh Clifford](/wiki/Hugh_Clifford_(colonial_administrator)), but it was eventually named as Clementi Road. It is generally suggested that the road was named after [Sir Cecil Clementi Smith](/wiki/Cecil_Clementi_Smith), who was the first [British High Commissioner](/wiki/List_of_High_Commissioners_of_the_United_Kingdom_to_Malaya) in the [Straits Settlements](/wiki/Straits_Settlements). However, it is also possible that the road was named after [Sir Cecil Clementi](/wiki/Cecil_Clementi), another former Governor of the Straits Settlements (1930–33) who initiated the construction of [Kallang Airport](/wiki/Kallang_Airport). ## History The present area occupying Clementi Avenue 1 used to be known as 'Sussex Estate', named after the historic [county](/wiki/Historic_counties_of_England) of [Sussex](/wiki/Sussex) in England. The road running inside Sussex Estate was called Goodwood Road. It was developed in the mid-1950s to house the families of British senior non-commissioned officers. When Clementi underwent a major transformation beginning in 1975, Sussex Estate was the only pre-development feature that was retained. It was demolished in 1997. Most of the area currently occupied by Clementi New Town today was once a military installation called 'Colombo Camp'. It is not known when the camp came into existence, however what is known is that the Singapore Guard Regiment, formed in 1948, stationed its troops there. When the regiment disbanded in November 1971, the camp was left to stand for another four more years before it was demolished in 1975. Clementi New Town was subsequently developed between 1975 and 1979 on the plot of land that was once occupied by the camp. Planned as a self-sufficient residential town with a range of facilities and services, the Housing and Development Board (HDB) began clearing the area in 1974 and affected villagers were resettled. An iconic landmark at Clementi is the steel truss railway bridge crossing Sungei Ulu Pandan. It was once part of the Jurong [KTMB](/wiki/Keretapi_Tanah_Melayu) Railway Line which was constructed to facilitate the transportation of manufactured products from [Jurong](/wiki/Jurong) to [Malaysia](/wiki/Malaysia), and raw materials from Malaysia to the industrial estate at Jurong. Construction of the railway began in 1963, and the first train ran in 1966. The Jurong section of the railway remained in use for the next four decades until its closure in the early 1990s. Today, the disused track continues to attract much interest from the public, especially people with a taste for history, nature and photography. ## Geography Clementi's arterial road, Clementi Road, runs for some 5 kilometres, from the vicinity around [Bukit Timah](/wiki/Bukit_Timah), at Jalan Anak Bukit, to the [West Coast Highway](/wiki/West_Coast_Highway,_Singapore), but the geographical entity of Clementi is generally regarded as the area dominated by HDB [flats](/wiki/Apartment) around [Commonwealth Avenue West](/wiki/Commonwealth,_Singapore) and the [Clementi MRT station](/wiki/Clementi_MRT_station). Besides Clementi Road, the two other arterial roads that serve the new town are the Ayer Rajah Expressway and the West Coast Highway. The primary residential district in Clementi is Clementi New Town and forms a large bulk of its residents and identity. The area also consists of many landed properties, especially in the West of the area. The boundaries of Clementi New Town are Sunset Way Estate to the North, Clementi Road to the East, West Coast Highway to the South, and Clementi Avenue 6 to the West. ### Neighbourhoods There are four constituencies in the town, and seven neighbourhoods (N1 to N7) within the Clementi vicinity. Most neighbourhoods are centered around or aligned with their respective neighbourhood hubs, where the majority of commercial activities take place, except for Clementi Town Centre. ### Subzones There are nine subzones in the planning area; Clementi Central, Clementi North, Clementi West, Clementi Woods, Faber, Pandan, Sunset Way, [Toh Tuck](/wiki/Toh_Tuck) and [West Coast](/wiki/West_Coast,_Singapore). ## Demographics ### Population history Resident Population 2000-2025YearPop.±%200090,980—200187,460−3.9%200287,770+0.4%200385,810−2.2%200485,680−0.2%200585,880+0.2%200686,770+1.0%200787,260+0.6%200888,150+1.0%200991,000+3.2%201091,870+1.0%201191,650−0.2%201291,240−0.4%201391,490+0.3%201491,260−0.3%201591,630+0.4%201691,630+0.0%201792,580+1.0%201893,000+0.5%201992,420−0.6%202091,990−0.5%202190,960−1.1%202293,500+2.8%202398,130+5.0%2024102,390+4.3%2025104,240+1.8%Source: ### Age profile The data below is from the population report published by the Singapore Department of Statistics as of June 2025. Age group (years)MalesFemalesTotal population% of total population0–42,1001,9404,0403.885–92,6502,5505,2004.9910–142,6102,6505,2605.0515–192,7102,6105,3205.1020–242,4102,4504,8604.6625–292,5802,6205,2004.9930–343,2803,6706,9506.6735–393,7204,2707,9907.6740–443,8604,4708,3307.9945–493,8704,3108,1807.8550–543,8204,0407,8607.5455–593,1903,4106,6006.3360–643,1203,2306,3506.0965–692,6603,3105,9705.7370–742,5603,4606,0205.7875–792,3302,8705,2004.9980–841,1101,4202,5202.4285–896309501,5801.5290+2505508000.77Age group (years)MalesFemalesTotal population% of total population0–147,3607,14014,50013.9115–6432,56035,08067,64064.8965+9,53012,56022,09021.19 The population distribution of Clementi in 2025 demonstrates an ageing population structure. There is a higher population concentration among middle-aged groups, with males peaking at the 45-49 age range (3.71%) and females peaking at the 40-44 age range (4.29%). Notably, Clementi has a relatively higher proportion of young and old dependents. The proportion of children aged 0 to 14 years old, 13.91%, is slightly higher than the national average of 13.60%. Similarly, the proportion of elderly above 65 years old, 21.19%, is higher than the national average of 18.77%. This indicates a mixture of young families and elderly residents in Clementi. ### Household As of 2025, there were 70,400 people living in [HDB](/wiki/Housing_and_Development_Board) flats, representing 67.5% of the population. This is lower than the national proportion of HDB dwellers (75.8%), reflecting a greater prevalence of private property as compared to the national average. Among the population, 28,610 residents, or 27.4% of the population, live in 4-Room Flats, making it the most common type of dwelling. A sizeable number of residents also reside in condominiums and other apartments (26,760 residents, 25.7%), while 5,580 (5.35%) live in landed properties. The average household size in Clementi as of 2020 is 3.01. Among the 33,609 households in Clementi, the most common household size is two persons, representing 23.8% of total households. Clementi has a [home ownership](/wiki/Owner-occupancy) rate of 89.4% as of 2020. This is slightly higher than the national home ownership rate of 87.9%, reflecting a greater prevalence of homeowners in Clementi. ### Ethnicity Ethnic groups in Clementi (2000−2020) Year[Chinese](/wiki/Chinese_Singaporeans)[Malays](/wiki/Malay_Singaporeans)[Indians](/wiki/Indian_Singaporeans)Others[Pop.](/wiki/Population)PercentagePop.PercentagePop.PercentagePop.Percentage**2000**69,56376.46%13,03914.33%7,1017.81%1,2751.4%**2010**69,29375.42%10,73211.68%8,1558.88%3,6944.02%**2015**70,70077.15%9,95010.86%7,6008.29%3,3903.7%**2020**73,63080.04%8,2708.99%6,9707.58%3,1203.39% As of 2020, Clementi has a lower level of ethnic diversity as compared to the national average. This is due to the considerably larger proportion of Chinese residents (80.04%) and a smaller proportion of Malay residents (8.99%) as compared to the national average of 74.35% and 13.49% respectively. ### Religion Consistent with the rest of Singapore, the largest religion in Clementi is [Buddhism](/wiki/Buddhism_in_Singapore), with 23,091 practising residents (29.1% of the population). The second most common group consists of residents with [no religion](/wiki/Irreligion_in_Singapore) (18,417 residents, 23.22%), followed closely by [Christianity](/wiki/Christianity_in_Singapore), with 18,303 (23.08%) practising residents, including 5,608 Catholics (7.07%). [Islam](/wiki/Islam_in_Singapore) is practised by 9,033 residents (11.39%). Other religious affiliations include [Taoism](/wiki/Taoism_in_Singapore) and [other Chinese religions](/wiki/Chinese_folk_religion) (6,399 residents, 8.07%), [Hinduism](/wiki/Hinduism_in_Singapore) (3,398 residents, 4.28%), and [Sikhism](/wiki/Sikhism_in_Singapore) (356 residents, 0.45%). Compared to the national average of 18.92%, there is a substantially higher proportion of practising Christians in Clementi. ### Education As of 2020, 96.9% of the population aged above 15 is literate, similar to the national average of 97.1%. 64.3% of residents are literate in two languages, with the most common language pair being English and Chinese (49.1% of residents). Additionally, 2.1% of Clementi residents are literate in three or more languages. 28,038 residents (38.6% of the population) in Clementi have attained a university qualification, higher than the national average of 32.1%. In contrast, 8,450 residents, or 11.6% of the population, have no educational qualifications, slightly higher than the national average of 10.6%. ### Language Languages most frequently spoken at home, Clementi (2020 census)Languagespercent[English](/wiki/Singapore_English)51.1%[Mandarin Chinese](/wiki/Mandarin_Chinese)26.8%[Malay](/wiki/Malay_Language)7.3%[Chinese dialects](/wiki/Chinese_dialects)10.7%[Tamil](/wiki/Tamil_Language)2.4%[Other Indian languages](/wiki/Languages_of_India)0.68%Others0.96% In Clementi, the proportion of residents using [English](/wiki/English_language) as the most frequently spoken language (51.13%) is higher than the national average of 48.25%. Of the 2,521 Indian language speakers, majority speak [Tamil](/wiki/Tamil_Language) (1,972 residents, 2.45%). ### Employment and income According to the 2020 Census of Population, 47,609 of residents aged 15 years and over in Clementi are employed, out of the 50,864 in the [labour force](/wiki/Workforce). This equates to an employment rate of 93.6%, lower than the [national employment rate](/wiki/Employment_in_Singapore) of 94.2%, ranking Clementi with the 5th lowest employment rate among all subzones in Singapore. The remaining 28,435 residents aged above 15 in Clementi (35.9%) are outside the labour force. Among the employed residents in Clementi aged 15 years and over, most earn a gross monthly income of S$15,000 and over, with 12.1% being in that category. This is followed closely by those earning between S$1,000 and S$1,999, constituting 11.7% of employed residents. Additionally, 6.2% earn less than S$1,000 per month. According to the 2020 Census of Population, most resident households in Clementi earn a monthly household income of S$20,000 and over, constituting 17.9% of all households. The second most common category is households with no employed person, encompassing 17.8% of all households. ## Politics Clementi was last an independent political constituency in the [1984 general election](/wiki/1984_Singaporean_general_election). Clementi now comes under the [West Coast-Jurong West GRC](/wiki/West_Coast-Jurong_West_GRC) (West Coast ward), [Jurong East-Bukit Batok GRC](/wiki/Jurong_East-Bukit_Batok_GRC) (Clementi ward) and [Holland-Bukit Timah GRC](/wiki/Holland-Bukit_Timah_GRC) (Ulu Pandan & Bukit Timah wards). West Coast GRC is led by [Minister for Transport](/wiki/Ministry_of_Transport_(Singapore)), [S Iswaran](/wiki/S_Iswaran), and [Minister for National Development](/wiki/Ministry_of_National_Development_(Singapore)), [Desmond Lee](/wiki/Desmond_Lee_(Singaporean_politician)).The constituency first faced a challenge from the [Workers' Party](/wiki/Workers%27_Party_of_Singapore) in the [1997 general election](/wiki/1997_Singapore_general_election). Since then, the constituency has received walkovers in both the (/wiki/2001_Singapore_general_election) and [2006 general elections](/wiki/2006_Singapore_general_election). In the [2011 general election](/wiki/2011_Singaporean_general_election), the [PAP](/wiki/People%27s_Action_Party) slate for five-member West Coast GRC, comprising [Lim Hng Kiang](/wiki/Lim_Hng_Kiang), [S. Iswaran](/wiki/S._Iswaran), [Arthur Fong](/wiki/Arthur_Fong), [Lawrence Wong Shyun Tsai](/wiki/Lawrence_Wong_Shyun_Tsai) and [Foo Mee Har](/wiki/Foo_Mee_Har), faced a contest against the [Reform Party](/wiki/Reform_Party_(Singapore)) led by [Kenneth Jeyaretnam](/wiki/Kenneth_Jeyaretnam). Clementi was drawn into Jurong GRC after the electoral boundaries changed as a result of the [2015 general elections](/wiki/2015_Singapore_general_election). The PAP-[Jurong GRC](/wiki/Jurong_GRC) team won 79.28% of the votes in that election. Tan Wu Meng currently represents the Clementi division after winning a seat in the 2015 General Elections. Currently, West Coast Town Council office is still situated at the Clementi Mall, but it is now meant for residents in Dover, Pandan Gardens, Teban Gardens and West Coast. ## Amenities The Commonwealth Cinema on the south side of Clementi MRT station was demolished in 2008 and rebuilt into a four-storey shopping mall, previously named 'CityVibe', but later renamed to 'Grantal Mall'. The former [Eng Wah](/wiki/WE_Cinemas)'s Empress Entertainment Centre Cineplex was also rebuilt and reopened as '[321 Clementi](/wiki/Eng_Wah_Global)' in March 2015. Further from the town centre, a shopping complex, [West Coast Plaza](/wiki/West_Coast_Plaza), serves the residents along West Coast Road. The [Singapore Police 'D' Divisional Headquarters](/wiki/Clementi_Police_Division) is located at Clementi Avenue 5, while the Clementi Neighbourhood Police Post is situated at Clementi Avenue 3. Clementi Fire Station is located off Commonwealth Avenue West. In April 2005, the HDB announced plans to build a new [mixed-use development](/wiki/Mixed-use_development) at Clementi Town Centre, on the existing bus interchange site. The new development complex was to house a 5-storey retail podium with two basements, two 40-storey residential blocks (Clementi Towers), the West Coast Town Council (Clementi Office), a [public library](/wiki/Clementi_Public_Library) and an air-conditioned bus interchange. On 21 May 2011, [The Clementi Mall](/wiki/Clementi_Mall) – the retail shopping mall part of the mixed-use development, officially opened. The mall is linked directly to [Clementi MRT station](/wiki/Clementi_MRT_station) on the third level, and the air-conditioned [Clementi Bus Interchange](/wiki/Clementi_Bus_Interchange) at the first level has direct access to the mall. It is the first development in Singapore to integrate [public housing](/wiki/Public_housing_in_Singapore), public transport and [commercial](/wiki/Commercial_district) facilities built together within a single complex. On 15 May 2012, the mixed development won the prestigious international FIABCI Prix d'Excellence award, scoring the Runner-up award under the Master Plan Category. Clementi United Temple, Singapore Buddhist Youth Mission, [Ang Chee Sia Ong Temple](/wiki/Ang_Chee_Sia_Ong_Temple) and [Tentera Di-Raja Mosque](/wiki/Masjid_Tentera_Diraja) are some places of worship located in Clementi. Dover Forest, located just across the Ulu Pandan Rd, is a half-century old secondary regrowth forest embedded in the urban matrix of Ulu Pandan, Singapore. Bounded by three roads and a concrete canal, its 33 hectares consist of western and eastern halves separated by a mowed grass lawn. The forest contains more than 158 animal species, inclusive of critically endangered ones, and 120 plant species. In the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) Master Plan 2014, the forest was zoned as residential which resulted in [Housing and Development Board](/wiki/Housing_and_Development_Board) (HDB) planning to convert forest into a new residential area in 2020. [Nature Society (Singapore)](/wiki/Nature_Society_(Singapore)), as well as other nature groups such as Singapore Youth Voices for Biodiversity and LepakInSG, raised concerns about the plans for the conversion. Two studies were then conducted by HDB and [National Parks Board](/wiki/National_Parks_Board) separately on the biodiversity and connection to nearby forests. The initial plans were then changed to retain the western half of the forest while 11 hectares of the eastern half will be developed into housing use. ## Recreation Clementi has a swimming complex and a sports hall for various [net](/wiki/Net_sports) or [ball](/wiki/Ball_sports) sports located near the MRT station. The Clementi Stadium, with a capacity of 4,000 spectators, is located near West Coast Road and can be seen from the [Ayer Rajah Expressway](/wiki/Ayer_Rajah_Expressway). [West Coast Park](/wiki/West_Coast_Park) and [Clementi Woods Park](/wiki/Clementi_Woods_Park) are situated further away from the central area but are still accessible by bus. The former West Coast Recreation Centre, which was located next to the Clementi Stadium, ceased operations in December 2019, and was demolished in 2020. ## Education Clementi is serviced by several educational facilities, some of which have a long history. Primary schools in the area include [Clementi Primary School](/wiki/Clementi_Primary_School), [Nan Hua Primary School](/wiki/Nan_Hua_Primary_School), [Pei Tong Primary School](/wiki/Pei_Tong_Primary_School) and [Qifa Primary School](/wiki/Qifa_Primary_School). Secondary schools include [Clementi Town Secondary School](/wiki/Clementi_Town_Secondary_School), [Nan Hua High School](/wiki/Nan_Hua_High_School), [New Town Secondary School](/wiki/New_Town_Secondary_School) and Kent Ridge Secondary School. The [NUS High School of Mathematics and Science](/wiki/NUS_High_School_of_Mathematics_and_Science), an independent school specialising in Mathematics and Science, is located at Clementi Avenue 1. The [School of Science and Technology, Singapore](/wiki/School_of_Science_and_Technology,_Singapore), which specialises in Science, Technology and Applied Learning, is located at the junction of Clementi Road and Commonwealth Avenue West near [Dover MRT station](/wiki/Dover_MRT_station) and Clementi MRT station as well. Tertiary educational institutions bordering or situated along Clementi Road include [Ngee Ann Polytechnic](/wiki/Ngee_Ann_Polytechnic), [SIM Headquarters](/wiki/Singapore_Institute_of_Management), [Singapore University of Social Sciences](/wiki/Singapore_University_of_Social_Sciences) and the [National University of Singapore (NUS)](/wiki/National_University_of_Singapore). There is a direct bus service from the Clementi bus interchange that loops around the NUS campus. [Singapore Polytechnic](/wiki/Singapore_Polytechnic) is located along Commonwealth Avenue West next to Dover MRT Station. The [Japanese School, Singapore](/wiki/Japanese_School,_Singapore) or Singapore [Nihonjin gakkō](/wiki/Nihonjin_gakk%C5%8D) operates one of its two primary schools at Clementi Road, directly opposite NUS. A private Japanese Kindergarten is just next to the Japanese Secondary School. [Waseda Shibuya Senior High School](/wiki/Waseda_Shibuya_Senior_High_School) Singapore campus is also located at West Coast Road. ## Transportation Clementi New Town is served by [Clementi MRT station](/wiki/Clementi_MRT_station) (EW23) on the [East West MRT line](/wiki/East_West_MRT_line) and bus services to [Clementi Bus Interchange](/wiki/Clementi_Bus_Interchange) and different parts of the town. The Clementi Bus Interchange is used mainly by [SBS Transit](/wiki/SBS_Transit) and [Tower Transit](/wiki/Tower_Transit_Singapore). Clementi Bus Interchange had moved temporarily on 29 October 2006. before the air-conditioned bus interchange opened on 26 November 2011. - Victor R Savage, Brenda S A Yeoh (2003), *Toponymics – A Study of Singapore Street Names*, Eastern Universities Press, [ISBN](/wiki/ISBN_(identifier)) 981-210-205-1\n",
  "language": "en",
  "processed_at": "2026-01-12T10:04:25.268947",
  "title": "Clementi, Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Clementi,_Singapore"
}