{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:04:29.413770"
  },
  "content": "Division of the Singapore Police Force 1°19′02.52″N 103°49′55.53″E﻿ / ﻿1.3173667°N 103.8320917°E﻿ / 1.3173667; 103.8320917 The **Clementi Police Division** (or **'D' Division**) is one of the seven land divisions of the [Singapore Police Force](/wiki/Singapore_Police_Force). Clementi Division covers about 70 square kilometres in the South-Western part of Singapore, which includes [Jurong Island](/wiki/Jurong_Island), [Sentosa Island](/wiki/Sentosa_Island) and the popular [Holland Village](/wiki/Holland_Village,_Singapore). Nearly half a million people live in the area under Clementi Division, mostly in [Tanjong Pagar GRC](/wiki/Tanjong_Pagar_GRC), [West Coast GRC](/wiki/West_Coast_GRC), [Hong Kah GRC](/wiki/Hong_Kah_GRC), [Holland-Bukit Panjang GRC](/wiki/Holland-Bukit_Panjang_GRC), [Jurong GRC](/wiki/Jurong_GRC), and [Ayer Rajah Constituency](/wiki/Ayer_Rajah_Constituency) and [Bukit Timah Constituency](/wiki/Bukit_Timah_Constituency). ## History 'D' Division was first officiated on 7 August 1963 with its headquarters at [Queenstown Police Station](/wiki/Singapore_Police_Force#Defunct_Units/Facilities), [Queenstown](/wiki/Queenstown,_Singapore), which was sited directly across the road from the [Police Reserve Unit 2](/wiki/Police_Tactical_Unit_(Singapore)) stationed at [Queensway Base](/wiki/Queensway_Base). This base also provided accommodations for off-duty single male officers then. Changing demographies and the rapid development of the suburbs resulted in the shifting of the divisional headquarters to its present location in [Clementi](/wiki/Clementi,_Singapore) in 1987 at 20, Clementi Avenue 5 until 31 October 2023 when it was relocated to 6 Lempeng Drive due to the construction of the Cross Island Line's Clementi MRT Station which caused the demolition of the building at the former address. 'D' Division was the first division in which the NPC system was implemented and went on trial. The first such NPC, Queenstown Neighbourhood Police Centre, opened its doors on 1 October 1997 before being officially opened by Mr Wong Kang Seng, Minister for Home Affairs, on 20 December 1997. Operating from a temporary site beside the [Queenstown MRT station](/wiki/Queenstown_MRT_station), it has since moved to a new site co-located with the new fire station of the [Singapore Civil Defence Force](/wiki/Singapore_Civil_Defence_Force). The other three NPCs has since moved into permanent buildings, although the Clementi Neighbourhood Police Centre was set up at the existing facilities of the Clementi Police Station now co-located with the division headquarters. ## Establishments - Clementi Division HQ - Bukit Merah West Neighbourhood Police Centre - Pasir Panjang Neighbourhood Police Post - Telok Blangah Neighbourhood Police Post - Clementi Neighbourhood Police Centre - Ayer Rajah Neighbourhood Police Post - Clementi Neighbourhood Police Post - West Coast Neighbourhood Police Post - Jurong East Neighbourhood Police Centre - Bukit Timah Neighbourhood Police Post - Queenstown Neighbourhood Police Centre - Alexandra Neighbourhood Police Post - Buona Vista Neighbourhood Police Post - Commonwealth Neighbourhood Police Post - Dover Neighbourhood Police Post - Clementi Police Division\n",
  "language": "en",
  "processed_at": "2026-01-12T10:04:29.413463",
  "title": "Clementi Police Division",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Clementi_Police_Division"
}