{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:04:33.432343"
  },
  "content": "Pier in Singapore **Clifford Pier** was a former [pier](/wiki/Pier) located beside [Collyer Quay](/wiki/Collyer_Quay) at [Marina Bay](/wiki/Marina_Bay,_Singapore) within the [Downtown Core](/wiki/Downtown_Core) of the [Central Area](/wiki/Central_Area,_Singapore), Singapore. The pier, which opened in 1933, ceased operations in 2006. In 2008 the site was converted into a restaurant, **One on the Bund**, with Chinese cuisine. This restaurant closed in 2014 and was replaced by another restaurant, **The Clifford Pier**, which offers a selection of local, Asian, and Western dishes under the operations of the Fullerton Bay Hotel. ## Etymology and history The Hokkiens called the pier *ang theng beh thow* ([Chinese](/wiki/Chinese_language): 红灯码头, meaning \"red lamp harbour\"), and the Malays called it *lampu merah* (meaning \"red lamp\"), both referring to the red [oil lamp](/wiki/Oil_lamp) [beacon](/wiki/Beacon) which shone over the pier at night as a warning to ships. Before the [Tanjong Pagar](/wiki/Tanjong_Pagar) [wharves](/wiki/Wharves) were built in the 1850s, [Johnston's Pier](/wiki/Johnston%27s_Pier) was the chief landing place. By the 1920s, the pier was [worn out](/wiki/Wear) and [Governor of the Straits Settlements](/wiki/Governor_of_the_Straits_Settlements) Sir [Cecil Clementi](/wiki/Cecil_Clementi) decided to build a new pier. In 1929, the plans to build Clifford pier was approved. The new pier was named Clifford Pier in memory of Sir [Hugh Clifford](/wiki/Hugh_Clifford_(colonial_administrator)), former [Governor of the Straits Settlements](/wiki/List_of_governors_of_the_Straits_Settlements). The decision to name the newly constructed pier after Sir Hugh Clifford sparked contention. The Straits Settlements Association of Singapore had several correspondences with the current governor Sir [Cecil Clementi](/wiki/Cecil_Clementi) appealing to retain the name of Johnston for the new pier. Persuasion failed due to the governor refusing to reverse his decision on grounds that Clifford's name was prominent in the region. Several members of the public also showed displeasure at the renaming, believing that the memory of Johnston's Pier would go along with its demolition. Despite the loss of the original name, locals continued to refer to the new pier in its Hokkien and Malay names. Clifford Pier was a [landing](/wiki/Landing) point for immigrants and other sea passengers. The pier was later used as a terminal for tourists and [day trippers](/wiki/Day_trippers) who boarded small boats and [ferries](/wiki/Ferries) heading for the [Southern Islands](/wiki/List_of_islands_of_Singapore). During the annual [pilgrimage](/wiki/Pilgrimage) season to [Kusu Island](/wiki/Kusu_Island), regular ferries departed from Clifford Pier to the island. With the construction of the [Marina Barrage](/wiki/Marina_Barrage), a dam across the Marina Channel which will convert the existing [Marina Bay](/wiki/Marina_Bay,_Singapore) into a [reservoir](/wiki/Reservoir_(water)), the existing Clifford Pier has ceased operations on 1 April 2006. The [Marina South Pier](/wiki/Marina_South_Pier) has been constructed at [Marina South](/wiki/Marina_South) and was opened in April 2006 to replace the existing Clifford Pier. The existing 26,000 square metre Clifford Pier site including its adjacent former Customs Harbour Branch building has been safeguarded for [conservation](/wiki/Architectural_conservation), and its surrounding land parcels are currently being developed into a retail, [leisure](/wiki/Leisure), entertainment and hotel centre. ## Architecture Clifford Pier was designed by the [Public Works Department](/wiki/Public_Works_Department_of_Singapore), where Frank Dorrington Ward was then the Chief Architect in the 1930s. The pier has a simple but unique architecture with a roof structure comprising concrete [arched](/wiki/Arch) [trusses](/wiki/Truss) in a riband form. Details, such as [brackets](/wiki/Bracket_(architecture)) and even the [fire hose](/wiki/Fire_hose) [cabinets](/wiki/Cabinet_(furniture)), were evidently designed with much consideration. ## Redevelopment After 18 months of renovation costing S$6 million, the premises was leased to Calvin Yeung, a famed Hong Kong restaurateur, his upscale Chinese restaurant **One On The Bund** was opened on the former pier on 11 December 2008. Yeung's restaurant was closed in early 2014 when its lease ended. In May 2014, a new restaurant was reopened on the former pier under the same namesake **The Clifford Pier**, as part of the Fullerton Bay Hotel, offering a wide selection of local, Asian, and Western dishes. - [The Fullerton Hotel Singapore](/wiki/The_Fullerton_Hotel_Singapore) - [The Fullerton Waterboat House](/wiki/The_Fullerton_Waterboat_House) - National Heritage Board (2002), *Singapore's 100 Historic Places*, Archipelago Press, [ISBN](/wiki/ISBN_(identifier)) 981-4068-23-3 - Victor R Savage, Brenda S A Yeoh (2003), *Toponymics – A Study of Singapore Street Names*, Eastern Universities Press, [ISBN](/wiki/ISBN_(identifier)) 981-210-205-1 - Norman Edwards, Peter Keys (1996), *Singapore – A Guide to Buildings, Streets, Places*, Times Books International, [ISBN](/wiki/ISBN_(identifier)) 9971-65-231-5 - Lianhe Zaobao, *Marina South New Clifford Pier to start operations in Apr 2006*, 3 January 2006\n",
  "language": "en",
  "processed_at": "2026-01-12T10:04:33.431979",
  "title": "Clifford Pier",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Clifford_Pier"
}