{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:04:35.238838"
  },
  "content": "[Singapore](/wiki/Singapore) adopts a proactive long-term effort in addressing [rising sea-levels](/wiki/Sea_level_rise), temperature increases due to [global warming](/wiki/Climate_change), and reducing [greenhouse gas emissions](/wiki/Greenhouse_gas_emissions). As of 2022, compared to other [ASEAN countries](/wiki/Member_states_of_ASEAN), Singapore has the second highest per capita CO2 emissions at 8.9 tonnes, and ranks sixth in total annual CO2 emissions at 53.25 million tonnes. ## Climate projections to 2100 On 5 January 2024, the Center for Climate Research Singapore released projections that Singapore's annual mean temperatures will rise by between 0.6 °C and 5°C by the end of the 21st century. ### More wet and dry extreme weather as the new normal Days with more weather extremes are expected to be more frequent. In the 2024 report, very hot days with daily maximum temperatures exceeding 35 °C are projected to increase from 4 days per year on average in the last 40 years to between 41 and 351 days per year on average. Warm nights where temperatures exceed 26.3 °C are projected to increase from an average of 76 nights per year in the last 40 years to most nights in a year by end century. Extreme daily rainfall (as defined by the 99th percentile of daily rainfall over the 1995-2014 period) is projected to increase across all seasons, with increases ranging from 6% to 92% in the inter-monsoon months of April and May. Dry spells are expected to be more frequent. with Singapore experiencing on average one dry spell every 10 to 60 months by 2100. ### Mean sea level rise The mean sea level rise is projected to rise by 0.23m to 1.15m by 2100, and by up to 2m by 2150 under a high global emissions scenario. High tides and storm surges are likely to cause level to spike by a further 4m to 5m. ## Mitigation ### Reducing emissions Singapore has been assessed as one of the three potential climate leaders in the Asian international context. As part of Singapore's climate pledge for the Paris agreement in 2015, Singapore announced a climate action plan to peak emissions at 65 million tonnes of CO2 equivalent emissions around 2030. As part of this plan, Singapore implemented Southeast Asian's first carbon tax on 1 January 2019, setting the carbon tax at S$5/tCO2e for the first five years from 2019 to 2023. With effect from 2024, the carbon tax was raised to S$25/tCO2e with a targeted raise to S$45/tCO2e in 2026 and 2027 and S$50-80/tCO2e by 2030. The carbon tax is levied on facilities that emit [Scope 1 direct emissions](/wiki/Carbon_footprint) of at least 25,000 tCO2e annually. Singapore is executing a solar grid energy programme to reach a target of 2 gigawatt-peak capacity by 2030, or 3% of Singapore's projected total electricity demand. With the country's limited geographic capacity to tap on alternative energy sources, Singapore has an ongoing project to import a capacity of 4GW of low-carbon electricity by 2035. Since June 2022, Singapore has already begun importing renewable hydropower from the [Lao People's Democratic republic](/wiki/Laos). Singapore also now uses more than 95% natural gas in [electricity generation in the country](/wiki/Energy_in_Singapore) compared to 19% in 2000. Altogether, Singapore's [Grid Emission Factor](/wiki/Emission_intensity) has fallen from 0.4237 kgCO2/kWh in 2016 to 0.4057 kgCO2/kWh in 2021. In the area of transportation, all new public bus purchases are cleaner energy buses, including energy or hybrid buses with a target to replace all existing diesel buses with cleaner energy buses by 2040. The island's cycling path network will be expanded to 1,300km islandwide by 2030 from the current 525km in 2024. The Land Transport Master Plan 2040 also lays out a transportation plan to expand the Mass Rapid Transit network to 360km by the 2030s and target having 75% of the country use public transport during peak hours. To incentivise clean energy vehicles, the country has also introduced a slew of vehicle taxes and incentives, regulations and standards, and a nation-wide EV charger deployment of 60,000 EV charging points by 2030. ### International cooperation Although Singapore contributes only 0.1% of global emissions, Singapore has participated in international climate change efforts, believing \"climate change is a global challenge that requires a global solution\". Singapore ratified the [United Nations Framework Convention](/wiki/United_Nations_Framework_Convention_on_Climate_Change) on climate change in 1997 which sets the framework for governments to cooperate to address climate change, based on the principle of “common but differentiated responsibilities and respective capabilities, in light of different national circumstances”. Singapore has acceded to the [Kyoto Protocol](/wiki/Kyoto_Protocol) in 2006 and ratified the [Doha Amendment](/wiki/Doha_Amendment) to the Kyoto Protocol in 2014. On 22 April 2016, Singapore adopted the [Paris Agreement](/wiki/Paris_Agreement), reaffirming a commitment to keeping global warming below 2 °C above pre-industrial levels, which has since been ratified on 21 September 2016. Singapore has also adopted the [Glasgow Climate Pact](/wiki/Glasgow_Climate_Pact) at [COP-26](/wiki/2021_United_Nations_Climate_Change_Conference) in 2021. ## Adaptation ### Addressing rising sea levels Singapore spent S$226 million to build and complete the [Marina Barrage](/wiki/Marina_Barrage) on 31 October 2008 to achieve greater self-sufficiency for the country's water needs and flood control in high-risk low-lying areas of downtown districts. On 7 September 2023, Singapore dedicated S$125 million to launch the Coastal Protection and Flood Management Research Programme to research and develop the nation's capabilities in coastal protection and flood management. The implementation and operation of coastal protection measures over the next 100 years is projected by the country to cost S$100 billion. On 28 November 2023, the country also announced plans to build a 'Long Island' the size of 1,000 football fields on the country's southeastern coast to protect the country's low lying shorelines even in the worst-case scenario of 5m sea level rises by 2100. This artificial island will create new waterfront living with up to 60,000 private and public properties built on the artificial island. ### Addressing a hotter country As a country with the [third densest population density](/wiki/List_of_countries_and_dependencies_by_population), Singapore is heavily subject to the [urban heat island effect](/wiki/Urban_heat_island) with temperature differences of up to 7 °C between urban and less built-up areas of Singapore. The country views trees as a central part of its infrastructure, with the aim to double annual tree planting rate between 2020 and 2030, planting 1 million more trees in the country. Singapore's Green Plan 2030 further aims to increase nature parks' land area by over 50% from the 2020 baseline with all households within 10-minutes walk from a park. In 2021 Singapore issued six postal stamps celebrating six Green Buildings. The architectural concept for the six buildings includes [facade greening](/wiki/Greening). They are [Khoo Teck Puat Hospital](/wiki/Khoo_Teck_Puat_Hospital), [Oasia Hotel Downtown](/wiki/Oasia_Hotel_Downtown), [Kampung Admiralty](/wiki/Kampung_Admiralty), [Jewel Changi Airport](/wiki/Jewel_Changi_Airport), SkyTerrace@Dawson, and the [Lee Kong Chian Natural History Museum](/wiki/Lee_Kong_Chian_Natural_History_Museum). To balance between the need to cool down urban city centres and energy costs, Singapore completed an underground centralised district cooling network in 2016 to cool down buildings in [Marina Bay](/wiki/Marina_Bay,_Singapore) at energy savings of more than 40%. Between 2018 and 2019, trials were also conducted using reflective paint to alleviate the urban heat island effect and prevent absorption of heat by buildings, demonstrating cooling up to 2 °C cooler during the hottest times of the day. This cool paint study is currently undergoing continued trials in new urban areas. Climate data for Singapore (1991–2020 normals, extremes 1929–1941 and 1948–present)MonthJanFebMarAprMayJunJulAugSepOctNovDecYearRecord high °C (°F)35.2 (95.4)35.2 (95.4)36.0 (96.8)35.8 (96.4)35.4 (95.7)35.0 (95.0)34.0 (93.2)34.2 (93.6)34.4 (93.9)34.6 (94.3)35.4 (95.7)35.6 (96.1)36.0 (96.8)Mean daily maximum °C (°F)30.6 (87.1)31.5 (88.7)32.2 (90.0)32.4 (90.3)32.3 (90.1)31.9 (89.4)31.4 (88.5)31.4 (88.5)31.6 (88.9)31.8 (89.2)31.2 (88.2)30.5 (86.9)31.6 (88.9)Daily mean °C (°F)26.8 (80.2)27.3 (81.1)27.8 (82.0)28.2 (82.8)28.6 (83.5)28.5 (83.3)28.2 (82.8)28.1 (82.6)28.0 (82.4)27.9 (82.2)27.2 (81.0)26.8 (80.2)27.8 (82.0)Mean daily minimum °C (°F)24.3 (75.7)24.6 (76.3)24.9 (76.8)25.3 (77.5)25.7 (78.3)25.7 (78.3)25.4 (77.7)25.3 (77.5)25.2 (77.4)25.0 (77.0)24.6 (76.3)24.3 (75.7)25.0 (77.0)Record low °C (°F)19.4 (66.9)19.7 (67.5)20.2 (68.4)20.7 (69.3)21.2 (70.2)20.8 (69.4)19.7 (67.5)20.2 (68.4)20.7 (69.3)20.6 (69.1)21.1 (70.0)20.6 (69.1)19.4 (66.9)Average rainfall mm (inches)221.6 (8.72)105.1 (4.14)151.7 (5.97)164.3 (6.47)164.3 (6.47)135.3 (5.33)146.6 (5.77)146.9 (5.78)124.9 (4.92)168.3 (6.63)252.3 (9.93)331.9 (13.07)2,113.2 (83.20)Average rainy days (≥ 0.2 mm)13912151513141413151919171Average [relative humidity](/wiki/Relative_humidity) (%)83.581.281.782.682.380.980.980.780.781.584.985.582.2Average [dew point](/wiki/Dew_point) °C (°F)23.2 (73.8)23.2 (73.8)23.7 (74.7)24.1 (75.4)24.5 (76.1)24.2 (75.6)23.9 (75.0)23.7 (74.7)23.7 (74.7)23.8 (74.8)23.8 (74.8)23.6 (74.5)23.8 (74.8)Mean monthly [sunshine hours](/wiki/Sunshine_duration)180.4198.6196.6182.4184.8175.4188.5184.6161.4155.0133.2133.12,074Source 1: National Environment AgencySource 2: [NOAA](/wiki/NOAA) (sun only, 1991–2020), Weather.Directory - [Effects of climate change on small island countries](/wiki/Effects_of_climate_change_on_small_island_countries) - [Climate Change](/wiki/Climate_change)\n",
  "language": "en",
  "processed_at": "2026-01-12T10:04:35.238464",
  "title": "Climate change in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Climate_change_in_Singapore"
}