{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:04:42.021444"
  },
  "content": "Singaporean digital media company**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Clutched\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(October 2017)* *(Learn how and when to remove this message)*This article **contains promotional content**. Please help improve it by removing promotional language and inappropriate external links, and by adding encyclopedic text written from a neutral point of view. *(October 2017)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* **Clutched** is a digital media company specializing in the automotive industry, founded and based in [Singapore](/wiki/Singapore). ## History The company was founded by Jackie Prabhu, a Singaporean car enthusiast. Clutched first started out as a [YouTube](/wiki/YouTube) channel, \"Clutched with Jackie\", focused on car reviews. Prabhu's channel provided information regarding car purchases. The channel has evolved into a company that provides customized content generation for clients. The company also wrote news coverage and held press conferences about product and car launches. In October 2015, Clutched rebranded and added new categories, such as product and event reviews, to their video offerings. They also added articles regarding automotive news, directory listings, and a participatory forum.[*citation needed*] ## Awards - *[Marketing Magazine](/wiki/Strategy_(magazine))* 2016 Loyalty & Engagement Awards: Top 5 in \"Best Engagement Strategy for a Male Audience\"\n",
  "language": "en",
  "processed_at": "2026-01-12T10:04:42.021018",
  "title": "Clutched",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Clutched"
}