{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:59:39.153817"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"CNA938\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(February 2018)* *(Learn how and when to remove this message)*Radio station **CNA938** is an English-language radio station in Singapore. Owned by the state-owned broadcaster [Mediacorp](/wiki/Mediacorp) and launched on 2 October 1998, it broadcasts a [news/talk radio](/wiki/Talk_radio) format. The station is marketed as a radio extension of Mediacorp's television channel [CNA](/wiki/CNA_(TV_network)), broadcasting news and lifestyle programmes from 7 a.m. to 11 p.m. [SGT](/wiki/Singapore_Time) daily. During the overnight hours, the station carries an audio simulcast of the CNA television channel. ## History Plans for the launch of NewsRadio 938 was announced alongside two new radio stations by then-Minister for Information and the Arts [George Yeo](/wiki/George_Yeo) in March 1998. The station would be a spin-off of One FM, which used to air news-heavy content. The launch date was set for 2 October 1998, with sampler programming beginning in mid-June. It would broadcast eighteen hours a day with news every 15 minutes, talk and some light instrumental music. Early on, NewsRadio 938 became one of George Yeo's pre-set radio stations, preferring it more than the [BBC World Service](/wiki/BBC_World_Service), showing that there was potential for radio news. In September, it launched *Midday Business*. NewsRadio 938 rebranded as **938LIVE** in 2005. 24-hour broadcasts started on 1 January 2008. A number of a new programmes and a stronger focus on news were introduced later in 2015. On 6 November 2017, the station was relaunched as **938NOW**, with a number of a new programmes and a stronger focus on news and lifestyle. In March 2019, in conjunction with the 20th anniversary of [Mediacorp](/wiki/Mediacorp)'s television news channel [Channel NewsAsia](/wiki/CNA_(TV_network)) (CNA), it was announced that 93.8 would be rebranded as an extension of CNA to promote the network as a multi-platform brand. The station rebranded as CNA938 on 3 June 2019. - [List of radio stations in Singapore](/wiki/List_of_radio_stations_in_Singapore) - Official website on MeListen - CNA official website 1°18′46″N 103°51′43″E﻿ / ﻿1.312751°N 103.862°E﻿ / 1.312751; 103.862 This article about media in Singapore is a stub. You can help Wikipedia by expanding it. This article about a radio station in Asia is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T09:59:39.153366",
  "title": "CNA938",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/CNA938"
}