{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:04:45.227712"
  },
  "content": "The **coat of arms of Singapore** is the [heraldic symbol](/wiki/Coat_of_arms) representing the [sovereign](/wiki/Sovereign_state) island [country](/wiki/Country) and [city-state](/wiki/City-state) of [Singapore](/wiki/Singapore) located in [maritime Southeast Asia](/wiki/Maritime_Southeast_Asia). It was adopted in 1959, the year Singapore attained [self-governance](/wiki/Self-governance_of_Singapore) from the [British Empire](/wiki/British_Empire), and remains in use after its independence in 1965. The committee that created it, headed by [Toh Chin Chye](/wiki/Toh_Chin_Chye), was also responsible for the [national flag](/wiki/Flag_of_Singapore) and the [national anthem](/wiki/Majulah_Singapura) of Singapore. At the centre of the emblem is a red shield bearing a white crescent, a [new moon](/wiki/New_moon)—representing a \"young nation on the ascendant\", and five white stars—representing democracy, peace, progress, justice and equality, supported by a [lion](/wiki/Asiatic_lion) and a [tiger](/wiki/Malayan_tiger)—representing Singapore's namesake and the country's historical ties to the Malay Peninsula; below them is a blue ribbon inscribed with *[Majulah Singapura](/wiki/Majulah_Singapura)* in gold, [Malay](/wiki/Malay_language) for \"Onward Singapore\". While the use of the coat of arms is restricted to the government, the symbol enjoys wide use on the [national currency](/wiki/Singapore_dollar) and state decorations, and appears on the cover of the [national passport](/wiki/Singaporean_passport). ## History When Singapore became self-governing in 1959, Prime Minister [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) was determined to create for the new state a coat of arms, among other symbols, to replace the [coat of arms of the Colony of Singapore](/wiki/Armorial_of_Singapore#Historical_arms) that had been in use until then. A committee was formed to design the state symbols, headed by the deputy prime minister [Toh Chin Chye](/wiki/Toh_Chin_Chye), who wanted both the arms and flag of Singapore to represent the country's united, multi-ethnic society. The coat of arms and the flag were created over a span of two months by Toh and his committee. A law establishing the state symbols of Singapore was presented to the National Assembly by the Minister of Culture, [S. Rajaratnam](/wiki/S._Rajaratnam), and approved in November 1959. On 3 December 1959, the state coat of arms, flag and anthem were presented to the people of Singapore for the first time. Toh said in a 1989 interview that when tasked with the creation of the state symbols, \"apart from the anthem we have to produce the flag and the crest\", and he felt that the new flag of Singapore should be flying next to the [Union Jack](/wiki/Union_Jack). Toh further stated: > In the case of the state crest, again we got the five stars and the new moon ... A lion next to the tiger. Tiger of course is a more local animal than the lion. The old City Council had a lion. It did merge with our own ideas of self governing of Singapore. ## Symbolism The central emblem of the coat of arms is a red shield with five white stars resting above a white crescent, similar to the crescent and stars used on the [Singapore flag](/wiki/Flag_of_Singapore) and such other national symbols as the [national ensign for civilian ships](/wiki/Red_Ensign_of_Singapore). Red symbolises \"universal brotherhood and equality of man\" and white \"pervading and everlasting purity and virtue\". The crescent represents a new moon, which reflects \"a young nation on the ascendant\", while the five-pointed stars \"stand for the nation's ideals of democracy, peace, progress, justice and equality\". The same emblem appears in the top corner of the flag of Singapore. The supporters of the shield are a lion and a tiger: the tiger, specifically the [Malayan tiger](/wiki/Malayan_tiger), abounded on [Singapore Island](/wiki/Singapore_Island) in the 19th century when it was still a dense jungle. It also symbolises the nation's [historical and close connections](/wiki/Malaysia%E2%80%93Singapore_relations) to the [Federation of Malaya](/wiki/Federation_of_Malaya) – which Singapore later became part of the Federation of Malaysia together with the [Crown Colony of Sarawak](/wiki/Crown_Colony_of_Sarawak) and the [Crown Colony of North Borneo](/wiki/Crown_Colony_of_North_Borneo) from 1963 to 1965 before Singapore's expulsion – while the lion represents the Singaporean nation itself, being its namesake. From an alternative perspective the lion may also symbolize the nation's [historical ties](/wiki/Straits_Settlements) to the United Kingdom, as part of the [Straits Settlements](/wiki/Straits_Settlements), a crown colony under the then British Empire. Below the supporters is a blue ribbon on which the national motto, *Majulah Singapura*, is written in gold. *Majulah Singapura* is also the title of the [national anthem](/wiki/Majulah_Singapura); it means \"Onward Singapore\" in [Malay](/wiki/Malay_language), the [national language](/wiki/Languages_of_Singapore) of Singapore. ## Uses In 1985, the [Monetary Authority of Singapore](/wiki/Monetary_Authority_of_Singapore) (MAS) began to issue their second series of coins. The coat of arms is displayed on the obverse side of these coins, surrounded by an inscription comprising the name of Singapore in the four official languages (English, Chinese, Malay and Tamil) and the year of minting. In 1987, the dollar coin entered circulation with this same pattern. The 1985 series of coins is noted for having a unique interpretation of the coat of arms, with the supporters being positioned lower than the shield, and the supporters reaching up to the arms. The MAS moved to officially change the design of the coat of arms on the coins in 1992 to the standard design, however the Authority themselves into the early 2000s continued to use the 1985 designs to represent the coins, despite the coat of arms having been changed. According to the MAS, the coat of arms has also appeared on all Singaporean banknotes since the \"Orchid\" series of 1967. State decorations of Singapore also depict the coat of arms on the medallions. For example, the medallions of the [Darjah Utama Temasek](/wiki/Darjah_Utama_Temasek) and the [Sijil Kemuliaan](/wiki/Sijil_Kemuliaan) use the full achievement of arms, while the [Darjah Utama Bakti Cemerlang](/wiki/Darjah_Utama_Bakti_Cemerlang) medal displays the shield. ## Guidelines According to the Singapore Arms and Flag and National Anthem Rules, the use of the coat of arms is restricted to the government. Without explicit permission from the [Ministry of Information, Communications and the Arts](/wiki/Ministry_of_Information,_Communications_and_the_Arts) (MICA), no person or group is permitted to physically print, manufacture, display or sell anything depicting the coat of arms, or to allow such actions to happen. It is also forbidden to use any symbol that can be easily mistaken for the coat of arms. Persons who wish to use the coat of arms in a literary work must also obtain prior permission from MICA. The only exception provided by the Rules is that the arms can be used by government officials and ministries on their building's exteriors and on printed documents. - Singapore portal - Heraldry portal - [Armorial of Singapore](/wiki/Armorial_of_Singapore) - [Flag of Singapore](/wiki/Flag_of_Singapore) - [List of Singaporean flags](/wiki/List_of_Singaporean_flags) - Singapore Heraldry History - Singapore Infomap (archived 8 February 2011)\n",
  "language": "en",
  "processed_at": "2026-01-12T10:04:45.226724",
  "title": "Coat of arms of Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Coat_of_arms_of_Singapore"
}