{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:04:49.653091"
  },
  "content": "External territory of AustraliaPlace in Australia The **Cocos (Keeling) Islands** ([Cocos Islands Malay](/wiki/Cocos_Islands_Malay_language): *Pulu Kokos [Keeling]*), officially the **Territory of Cocos (Keeling) Islands** (/ˈkoʊkəs/; Cocos Islands Malay: *Pulu Kokos [Keeling]*), are an [Australian external territory](/wiki/States_and_territories_of_Australia) in the [Indian Ocean](/wiki/Indian_Ocean), comprising a small archipelago approximately midway between [Australia](/wiki/Australia) and [Sri Lanka](/wiki/Sri_Lanka) and relatively close to the Indonesian island of [Sumatra](/wiki/Sumatra). The territory's [dual name](/wiki/Dual_naming) (official since the islands' incorporation into Australia in 1955) reflects that the islands have historically been known as either the **Cocos Islands** or the **Keeling Islands**. The territory consists of two [atolls](/wiki/Atoll) made up of 27 [coral islands](/wiki/Coral_island), of which only two – [West Island](/wiki/West_Island,_Cocos_(Keeling)_Islands) and [Home Island](/wiki/Home_Island) – are inhabited. The population of around 600 people consists mainly of [Cocos Malays](/wiki/Cocos_Malays), who mostly practise [Sunni Islam](/wiki/Sunni_Islam) and speak [a dialect of Malay](/wiki/Cocos_Malay) as their first language. The territory is administered by the Australian federal government's [Department of Infrastructure, Transport, Regional Development, Communications and the Arts](/wiki/Department_of_Infrastructure,_Transport,_Regional_Development,_Communications_and_the_Arts) as an Australian external territory and together with [Christmas Island](/wiki/Christmas_Island) (which is about 960 kilometres (600 mi) to the east) forms the [Australian Indian Ocean Territories](/wiki/Australian_Indian_Ocean_Territories) administrative grouping. However, the islanders do have a degree of self-government through [the local shire council](/wiki/Shire_of_Cocos). Many public services – including health, education, and policing – are provided by the state of [Western Australia](/wiki/Western_Australia), and Western Australian law applies except where the federal government has determined otherwise. The territory also uses Western Australian postcodes. The islands were discovered in 1609 by the British sea captain [William Keeling](/wiki/William_Keeling), but no settlement occurred until the early 19th century. One of the first settlers was John Clunies-Ross, a Scottish merchant; much of the island's current population is descended from the Malay workers he brought in to work his [copra](/wiki/Copra) plantation. The [Clunies-Ross family](/wiki/Clunies-Ross_family) ruled the islands as a private fiefdom for almost 150 years, with the head of the family usually recognised as [resident magistrate](/wiki/Resident_magistrate). The British annexed the islands in 1857, and for the next century they were administered from either [Ceylon](/wiki/British_Ceylon) or [Singapore](/wiki/Colony_of_Singapore). The territory was transferred to Australia in 1955, although until 1979 virtually all of the territory's [real estate](/wiki/Real_estate) still belonged to the [Clunies-Ross family](/wiki/Clunies-Ross_family). ## Name The islands have been called the *Cocos Islands* (from 1622), the *Keeling Islands* (from 1703), the *Cocos–Keeling Islands* (since [James Horsburgh](/wiki/James_Horsburgh) in 1805) and the *Keeling–Cocos Islands* (19th century). *Cocos* refers to the abundant [coconut](/wiki/Coconut) trees, while *Keeling* refers to [William Keeling](/wiki/William_Keeling), who discovered the islands in 1609. John Clunies-Ross, who sailed there in the *Borneo* in 1825, called the group the *Borneo Coral Isles*, restricting *Keeling* to [North Keeling](/wiki/North_Keeling), and calling South Keeling \"the Cocos properly so called\". The form *Cocos (Keeling) Islands*, attested from 1916, was made official by the **Cocos Islands Act 1955** ([3 & 4 Eliz. 2](/wiki/3_%26_4_Eliz._2). c. 5).[*failed verification*] ## Geography The Cocos (Keeling) Islands consist of two flat, low-lying coral atolls with an area of 14.2 square kilometres (5.5 sq mi), 26 kilometres (16 mi) of coastline, a highest elevation of 5 metres (16 ft) and thickly covered with coconut palms and other vegetation. The climate is pleasant, moderated by the southeast [trade winds](/wiki/Trade_winds) for about nine months of the year and with moderate rainfall. [Tropical cyclones](/wiki/Tropical_cyclone) may occur in the early months of the year. [North Keeling](/wiki/North_Keeling) Island is an atoll consisting of just one C-shaped island, a nearly closed atoll ring with a small opening into the lagoon, about 50 metres (160 ft) wide, on the east side. The island measures 1.1 square kilometres (270 acres) in land area and is uninhabited. The lagoon is about 0.5 square kilometres (120 acres). North Keeling Island and the surrounding sea to 1.5 km (0.93 mi) from shore form the [Pulu Keeling National Park](/wiki/Pulu_Keeling_National_Park), established on 12 December 1995. It is home to the only surviving population of the endemic, and endangered, [Cocos Buff-banded Rail](/wiki/Cocos_Buff-banded_Rail). [South Keeling Islands](/wiki/South_Keeling_Islands) is an atoll consisting of 24 individual islets forming an incomplete atoll ring, with a total land area of 13.1 square kilometres (5.1 sq mi). Only [Home Island](/wiki/Home_Island) and [West Island](/wiki/West_Island,_Cocos_(Keeling)_Islands) are populated. The Cocos Malays maintain weekend shacks, referred to as pondoks, on most of the larger islands. Islets forming the South Keeling Islands atoll (clockwise from north) Islet (Malay name)Translation of Malay nameEnglish nameArea (approx.)[km2](/wiki/Square_kilometre)[mi2](/wiki/Square_mile)1Pulau LuarOuter Island[Horsburgh Island](/wiki/Horsburgh_Island)1.040.402Pulau TikusMouse Island[Direction Island](/wiki/Direction_Island,_Cocos_(Keeling)_Islands)3Pulau PasirSand IslandWorkhouse Island0.010.004Pulau BerasRice IslandPrison Island0.020.015Pulau GangsaCopper IslandClosed sandbar, now part of Home Island0.010.006Pulau Selma[Home Island](/wiki/Home_Island)0.950.377Pulau Ampang KechilLittle Ampang IslandScaevola Islet0.010.008Pulau AmpangAmpang IslandCanui Island0.060.029Pulau Wa-idasAmpang Minor0.020.0110Pulau BlekokReef Heron IslandGoldwater Island0.030.0111Pulau KembangFlower IslandThorn Island0.040.0212Pulau CheplokCape Gooseberry IslandGooseberry Island0.010.0013Pulau PandanPandanus IslandMisery Island0.240.0914Pulau SiputShell IslandGoat Island0.100.0415Pulau JambatanBridge IslandMiddle Mission Isle0.010.0016Pulau LabuPumpkin IslandSouth Goat Island0.040.0217Pulau AtasUp Wind Island[South Island](/wiki/South_Island,_Cocos_(Keeling)_Islands)3.631.4018Pulau Kelapa SatuOne Coconut IslandNorth Goat Island0.020.0119Pulau BlanEast Cay0.030.0120Pulau Blan MadarBurial Island0.030.0121Pulau MariaMaria IslandWest Cay0.010.0022Pulau KambingGoat IslandKeelingham Horn Island0.010.0023Pulau PanjangLong Island[West Island](/wiki/West_Island,_Cocos_(Keeling)_Islands)6.232.4124Pulau Wak BangkaTurtle Island0.220.08 There are no rivers or lakes on either atoll. Fresh water resources are limited to [water lenses](/wiki/Lens_(hydrology)) on the larger islands, underground accumulations of rainwater lying above the seawater. These lenses are accessed through shallow bores or wells. ### Marine park Reefs near the islands have healthy [coral](/wiki/Coral) and are home to several rare species of marine life. The region, along with the Christmas Island reefs, have been described as \"Australia's [Galapagos Islands](/wiki/Galapagos_Islands)\". In the 2021 budget the Australian Government committed $A39.1M to create two new marine parks off Christmas Island and the Cocos (Keeling) Islands. The parks will cover up to 740,000 square kilometres (290,000 sq mi) of Australian waters. After months of consultation with local people, both parks were approved in March 2022, with a total coverage of 744,000 square kilometres (287,000 sq mi). The park will help to protect spawning of [bluefin tuna](/wiki/Bluefin_tuna) from illegal international fishers, but local people will be allowed to practise fishing sustainably inshore in order to source food. ### Flora and fauna ### Climate Cocos (Keeling) Islands experience a [tropical rainforest climate](/wiki/Tropical_rainforest_climate) (*Af*) according to the [Köppen climate classification](/wiki/K%C3%B6ppen_climate_classification); the archipelago lies approximately midway between the [equator](/wiki/Equator) and the [Tropic of Capricorn](/wiki/Tropic_of_Capricorn). The archipelago has two distinct seasons, the wet season and the dry season. The wettest month is April with precipitation totaling 262.6 millimetres (10.34 in), and the driest month is October with precipitation totaling 88.2 millimetres (3.47 in). Due to the strong maritime control, temperatures vary little although its location is some distance from the [Equator](/wiki/Equator). The hottest month is March with an average high temperature of 30.0 °C (86.0 °F), while the coolest month is September with an average low temperature of 24.2 °C (75.6 °F). Climate data for Cocos Islands Airport (averages 1991–2020; extremes 1952–present)MonthJanFebMarAprMayJunJulAugSepOctNovDecYearRecord high °C (°F)32.7 (90.9)32.8 (91.0)32.8 (91.0)32.8 (91.0)32.6 (90.7)32.0 (89.6)31.6 (88.9)31.0 (87.8)30.9 (87.6)31.0 (87.8)32.1 (89.8)33.2 (91.8)33.2 (91.8)Mean daily maximum °C (°F)30.1 (86.2)30.2 (86.4)30.2 (86.4)30.0 (86.0)29.5 (85.1)28.8 (83.8)28.3 (82.9)28.1 (82.6)28.3 (82.9)28.8 (83.8)29.2 (84.6)29.5 (85.1)29.2 (84.6)Mean daily minimum °C (°F)25.2 (77.4)25.4 (77.7)25.5 (77.9)25.7 (78.3)25.5 (77.9)25.0 (77.0)24.4 (75.9)24.3 (75.7)24.3 (75.7)24.6 (76.3)24.9 (76.8)24.9 (76.8)25.0 (77.0)Record low °C (°F)21.0 (69.8)20.1 (68.2)19.8 (67.6)19.6 (67.3)19.4 (66.9)20.1 (68.2)20.4 (68.7)18.3 (64.9)19.0 (66.2)20.6 (69.1)19.3 (66.7)20.4 (68.7)18.3 (64.9)Average rainfall mm (inches)151.7 (5.97)207.1 (8.15)234.4 (9.23)248.9 (9.80)187.7 (7.39)187.3 (7.37)180.9 (7.12)102.0 (4.02)86.2 (3.39)84.8 (3.34)86.9 (3.42)121.4 (4.78)1,879.3 (73.98)Average rainy days (≥ 0.2 mm)13.715.319.218.718.819.721.317.015.310.610.112.4192.1Source: [Bureau of Meteorology](/wiki/Bureau_of_Meteorology) ## History ### Discovery and early history The archipelago was discovered in 1609 by Captain [William Keeling](/wiki/William_Keeling) of the [East India Company](/wiki/East_India_Company), on a return voyage from the East Indies. [North Keeling](/wiki/North_Keeling) was sketched by Ekeberg, a Swedish captain, in 1749, showing the presence of [coconut palms](/wiki/Coconut). It also appears on a 1789 chart produced by British hydrographer [Alexander Dalrymple](/wiki/Alexander_Dalrymple). In 1825, Scottish merchant seaman Captain [John Clunies-Ross](/wiki/John_Clunies-Ross) stopped briefly at the islands on a trip to India, nailing up a [Union Jack](/wiki/Union_Jack) and planning to return and settle on the islands with his family in the future. Wealthy Englishman [Alexander Hare](/wiki/Alexander_Hare) had similar plans, and hired a captain – coincidentally, Clunies-Ross's brother – to bring him and a volunteer [harem](/wiki/Harem) of 40 [Malay](/wiki/Malays_(ethnic_group)) women to the islands, where he hoped to establish his private residence. Hare had previously served as resident of [Banjarmasin](/wiki/Banjarmasin), a town in [Borneo](/wiki/Borneo), and found that \"he could not confine himself to the tame life that civilisation affords\". Clunies-Ross returned two years later with his wife, children and mother-in-law, and found Hare already established on the island and living with the private harem. A feud grew between the two. Clunies-Ross's eight sailors \"began at once the invasion of the new kingdom to take possession of it, women and all\". After some time, Hare's women began deserting him, and instead finding themselves partners amongst Clunies-Ross's sailors. Disheartened, Hare left the island. He died in [Bencoolen](/wiki/Bencoolen_(city)) in 1834. Encouraged by members of the former harem, Clunies-Ross then recruited Malays to come to the island for work and wives. Clunies-Ross's workers were paid in a currency called the Cocos rupee, a currency John Clunies-Ross minted himself that could only be redeemed at the company store. On 1 April 1836, [HMS *Beagle*](/wiki/HMS_Beagle) under Captain [Robert FitzRoy](/wiki/Robert_FitzRoy) arrived to take soundings to establish the profile of the atoll as part of the [survey expedition of the *Beagle*](/wiki/Second_voyage_of_HMS_Beagle). To the naturalist [Charles Darwin](/wiki/Charles_Darwin), aboard the ship, the results supported a theory he had developed of how atolls formed, which he later published as *[The Structure and Distribution of Coral Reefs](/wiki/The_Structure_and_Distribution_of_Coral_Reefs)*. He studied the natural history of the islands and collected specimens. Darwin's assistant [Syms Covington](/wiki/Syms_Covington) noted that \"an Englishman [he was in fact Scottish] and HIS family, with about sixty or seventy [mulattos](/wiki/Mulatto) from the [Cape of Good Hope](/wiki/Cape_of_Good_Hope), live on one of the islands. Captain Ross, the governor, is now absent at the Cape.\" ### Annexation by the British Empire The islands were annexed by the British Empire in 1857. This annexation was carried out by Captain [Stephen Grenville Fremantle](/wiki/Stephen_Grenville_Fremantle) in command of [HMS *Juno*](/wiki/HMS_Juno_(1844)). Fremantle claimed the islands for the British Empire and appointed [Ross II](/wiki/King_of_the_Cocos_(Keeling)_Islands) as Superintendent. In 1878, by [Letters Patent](/wiki/Letters_Patent), the Governor of [Ceylon](/wiki/Ceylon) was made Governor of the islands, and, by further Letters Patent in 1886, responsibility for the islands was transferred to the Governor of the [Straits Settlement](/wiki/Straits_Settlement) to exercise his functions as \"Governor of Cocos Islands\". The islands were made part of the Straits Settlement under an Order in Council of 20 May 1903. Meanwhile, in 1886 [Queen Victoria](/wiki/Queen_Victoria) had, by indenture, granted the islands in perpetuity to John Clunies-Ross. The head of the family enjoyed semi-official status as [Resident Magistrate](/wiki/Resident_Magistrate) and Government representative. In 1901 a [telegraph](/wiki/Telegraph) cable station was established on Direction Island. Undersea cables went to [Rodrigues](/wiki/Rodrigues), [Mauritius](/wiki/Mauritius), [Batavia](/wiki/Jakarta), [Java](/wiki/Java) and [Fremantle](/wiki/Fremantle), [Western Australia](/wiki/Western_Australia). In 1910 a wireless station was established to communicate with passing ships. The cable station ceased operation in 1966. ### World War I On the morning of 9 November 1914, the islands became the site of the [Battle of Cocos](/wiki/Battle_of_Cocos), one of the first naval battles of [World War I](/wiki/World_War_I). A landing party from the German cruiser [SMS *Emden*](/wiki/SMS_Emden) captured and disabled the wireless and cable communications station on [Direction Island](/wiki/Direction_Island,_Cocos_(Keeling)_Islands), but not before the station was able to transmit a distress call. An Allied troop convoy was passing nearby, and the Australian cruiser [HMAS *Sydney*](/wiki/HMAS_Sydney_(1912)) was detached from the convoy escort to investigate. *Sydney* spotted the island and *Emden* at 09:15, with both ships preparing for combat. At 11:20, the heavily damaged *Emden* beached herself on [North Keeling Island](/wiki/North_Keeling_Island). The Australian warship broke to pursue *Emden*'s supporting [collier](/wiki/Collier_(ship)), which scuttled herself, then returned to North Keeling Island at 16:00. At this point, *Emden*'s [battle ensign](/wiki/Battle_ensign) was still flying: usually a sign that a ship intends to continue fighting. After no response to instructions to lower the ensign, two salvoes were shot into the beached cruiser, after which the Germans lowered the flag and raised a [white sheet](/wiki/Flag_of_surrender). *Sydney* had orders to ascertain the status of the transmission station, but returned the next day to provide medical assistance to the Germans. Casualties totaled 134 personnel aboard *Emden* killed, and 69 wounded, compared to four killed and 16 wounded aboard *Sydney*. The German survivors were taken aboard the Australian cruiser, which caught up to the troop convoy in [Colombo](/wiki/Colombo) on 15 November, then transported to [Malta](/wiki/Malta) and handed over the prisoners to the [British Army](/wiki/British_Army). An additional 50 German personnel from the shore party, unable to be recovered before *Sydney* arrived, commandeered a schooner and escaped from Direction Island, eventually arriving in [Constantinople](/wiki/Constantinople). *Emden* was the last active [Central Powers](/wiki/Central_Powers) warship in the Indian or Pacific Ocean, which meant troopships from Australia and New Zealand could sail without naval escort, and Allied ships could be deployed elsewhere. ### World War II During [World War II](/wiki/World_War_II), the cable station was once again a vital link. The Cocos were valuable for direction finding by the [Y service](/wiki/Y_service), the worldwide intelligence system used during the war. Allied planners noted that the islands might be seized as an airfield for [German](/wiki/Nazi_Germany) planes and as a base for commerce raiders operating in the Indian Ocean. Following [Japan](/wiki/Empire_of_Japan)'s entry into the war, Japanese forces occupied neighbouring islands. To avoid drawing their attention to the Cocos cable station and its islands' garrison, the [seaplane](/wiki/Seaplane) anchorage between Direction and [Horsburgh](/wiki/Horsburgh_Island) islands was not used. Radio transmitters were also kept silent, except in emergencies. After the [Fall of Singapore](/wiki/Fall_of_Singapore) in 1942, the islands were administered from Ceylon and West and Direction Islands were placed under [Allied](/wiki/Allies_of_World_War_II) military administration. The islands' garrison initially consisted of a platoon from the British Army's [King's African Rifles](/wiki/King%27s_African_Rifles), located on Horsburgh Island, with two 6-inch (152.4 mm) guns to cover the anchorage. The local inhabitants all lived on Home Island. Despite the importance of the islands as a communication centre, the Japanese made no attempt either to raid or to occupy them and contented themselves with sending over a reconnaissance aircraft about once a month. On the night of 8–9 May 1942, 15 members of the garrison, from the [Ceylon Defence Force](/wiki/Ceylon_Defence_Force), [mutinied](/wiki/Mutiny) under the leadership of [Gratien Fernando](/wiki/Gratien_Fernando). The mutineers were said to have been provoked by the attitude of their British officers and were also supposedly inspired by Japanese anti-British propaganda. They attempted to take control of the [gun battery](/wiki/Artillery) on the islands. The [Cocos Islands Mutiny](/wiki/Cocos_Islands_Mutiny) was crushed, but the mutineers murdered one non-mutinous soldier and wounded one officer. Seven of the mutineers were sentenced to death at a trial that was later alleged to have been improperly conducted, though the guilt of the accused was admitted. Four of the sentences were commuted, but three men were executed, including Fernando. These were to be the only [British Commonwealth](/wiki/Commonwealth_of_Nations) soldiers executed for mutiny during the Second World War. On 25 December 1942, the Japanese submarine *[I-166](/wiki/Japanese_submarine_I-166)* bombarded the islands but caused no damage. Later in the war, two airstrips were built, and three bomber squadrons were moved to the islands to conduct raids against Japanese targets in South East Asia and to provide support during the [planned](/wiki/Operation_Tiderace) reinvasion of [Malaya](/wiki/British_Malaya) and reconquest of Singapore. The first aircraft to arrive were [Supermarine Spitfire](/wiki/Supermarine_Spitfire) Mk VIIIs of [No. 136 Squadron RAF](/wiki/No._136_Squadron_RAF). They included some [Liberator](/wiki/B-24) bombers from [No. 321 (Netherlands) Squadron RAF](/wiki/No._321_Squadron_RAF) (members of exiled Dutch forces serving with the [Royal Air Force](/wiki/Royal_Air_Force)), which were also stationed on the islands. When in July 1945 [No. 99](/wiki/No._99_Squadron_RAF) and [No. 356](/wiki/No._356_Squadron_RAF) RAF squadrons arrived on West Island, they brought with them a daily newspaper called *Atoll* which contained news of what was happening in the outside world. Run by airmen in their off-duty hours, it achieved fame when dropped by Liberator bombers on POW camps over the heads of the Japanese guards. In 1946, the administration of the islands reverted to [Singapore](/wiki/Colony_of_Singapore) and it became part of the Colony of Singapore. ### Transfer to Australia On 23 November 1955, the islands were transferred from the United Kingdom to the [Commonwealth of Australia](/wiki/Commonwealth_of_Australia). Immediately before the transfer the islands were part of the United Kingdom's Colony of Singapore, in accordance with the Straits Settlements (Repeal) Act, 1946 of the United Kingdom and the British Settlements Acts, 1887 and 1945, as applied by the Act of 1946. The legal steps for effecting the transfer were as follows: - The Commonwealth Parliament and the Government requested and consented to the enactment of a United Kingdom Act for the purpose. - The Cocos Islands Act, 1955, authorised Her Majesty, by Order in Council, to direct that the islands should cease to form part of the [Colony of Singapore](/wiki/Colony_of_Singapore) and be placed under the authority of the Commonwealth. - By the Cocos (Keeling) Islands Act, 1955, the Parliament of the Commonwealth provided for the acceptance of the islands as a territory under the authority of the Commonwealth and for its government. - The Cocos Islands Order in Council, 1955, made under the United Kingdom Act of 1955, provided that upon the appointed day (23 November 1955) the islands should cease to form part of the Colony of Singapore and be placed under the authority of the Commonwealth of Australia. The reason for this comparatively complex machinery was due to the terms of the Straits Settlement (Repeal) Act, 1946. According to Sir [Kenneth Roberts-Wray](/wiki/Kenneth_Roberts-Wray) \"any other procedure would have been of doubtful validity\". The separation involved three steps: separation from the Colony of Singapore; transfer by United Kingdom and acceptance by Australia. H. J. Hull was appointed the first official representative (now administrator) of the new territory. He had been a lieutenant-commander in the Royal Australian Navy and was released for the purpose. Under Commonwealth Cabinet Decision 1573 of 9 September 1958, Hull's appointment was terminated and [John William Stokes](/wiki/John_William_Stokes) was appointed on secondment from the Northern Territory police. A media release at the end of October 1958 by the Minister for Territories, Hasluck, commended Hull's three years of service on Cocos. Stokes served in the position from 31 October 1958 to 30 September 1960. His son's boyhood memories and photos of the Islands have been published. C. I. Buffett [MBE](/wiki/Order_of_the_British_Empire) from [Norfolk Island](/wiki/Norfolk_Island) succeeded him and served from 28 July 1960 to 30 June 1966, and later acted as Administrator back on Cocos and on Norfolk Island. In 1974, Ken Mullen wrote a small book about his time with wife and son from 1964 to 1966 working at the Cable Station on Direction Island. In the 1970s, the Australian government's dissatisfaction with the Clunies-Ross feudal style of rule of the island increased. In 1978, Australia forced the family to sell the islands for the sum of [A$](/wiki/Australian_dollar)6,250,000, using the threat of compulsory acquisition. By agreement, the family retained ownership of Oceania House, their home on the island. In 1983, the Australian government reneged on this agreement and told [John Clunies-Ross](/wiki/Clunies-Ross_Family#John_Cecil_Clunies-Ross) that he should leave the Cocos. The following year the [High Court of Australia](/wiki/High_Court_of_Australia) ruled that resumption of Oceania House was unlawful, but the Australian government ordered that no government business was to be granted to Clunies-Ross's shipping company, an action that contributed to his bankruptcy. John Clunies-Ross later moved to [Perth, Western Australia](/wiki/Perth,_Western_Australia). However, some members of the Clunies-Ross family still live on the Cocos. Extensive preparations were undertaken by the government of Australia to prepare the Cocos Malays to vote in their referendum of self-determination. Discussions began in 1982, with an aim of holding the referendum, under United Nations supervision, in mid-1983. Under guidelines developed by the UN Decolonization Committee, residents were to be offered three choices: full independence, free association, or integration with Australia. The last option was preferred by both the islanders and the Australian government. A change in government in Canberra following the March 1983 Australian elections delayed the vote by one year. While the Home Island Council stated a preference for a traditional communal consensus \"vote\", the UN insisted on a secret ballot. [The referendum](/wiki/1984_Cocos_(Keeling)_Islands_status_referendum) was held on 6 April 1984, with all 261 eligible islanders participating, including the Clunies-Ross family: 229 voted for integration, 21 for Free Association, nine for independence, and two failed to indicate a preference. In the first decade of the 21st century, a series of disputes have occurred between the Muslim and the non-Muslim population of the islands. West Island has an airstrip that is more than 2 kilometres (1.2 mi) long and is designed to accommodate [Boeing 737](/wiki/Boeing_737) passenger flights and smaller military planes. In 2023, the Australian parliament approved plans to extend the airstrip by 150 metres so that it could take [Boeing P-8 Poseidon](/wiki/Boeing_P-8_Poseidon) aircraft capable of low-level [anti-submarine warfare](/wiki/Anti-submarine_warfare) operations and high-tech military surveillance. Construction was scheduled to start in 2024 and be completed by 2026. Prior to the upgrade, the United States had been using the airstrip for several decades as a stopover point between [Diego Garcia](/wiki/Diego_Garcia) and [Guam](/wiki/Guam), and as a partial alternative to the [Paya Lebar Air Base](/wiki/Paya_Lebar_Air_Base). ### Indigenous status Descendants of the Cocos Malays brought to the islands from the [Malay Peninsula](/wiki/Malay_Peninsula), the [Indonesian archipelago](/wiki/List_of_islands_of_Indonesia), [Southern Africa](/wiki/Southern_Africa) and [New Guinea](/wiki/New_Guinea) by Hare and by Clunies-Ross as [indentured workers](/wiki/Indentured_servitude), [slaves](/wiki/Slavery) or [convicts](/wiki/Convict) are as of 2019[update] seeking recognition from the [Australian government](/wiki/Government_of_Australia) to be acknowledged as [Indigenous Australians](/wiki/Indigenous_Australians). ## Government The capital of the Territory of Cocos (Keeling) Islands is West Island while the largest settlement is the village of Bantam, on Home Island. Governance of the islands is based on the *Cocos (Keeling) Islands Act 1955* and depends heavily on the laws of Australia. The islands are administered from [Canberra](/wiki/Canberra) by the Department of Infrastructure, Transport, Regional Development, Communications and the Arts through a non-resident [Administrator](/wiki/Administrator_(Australia)) appointed by the [Governor-General](/wiki/Governor-General_of_Australia). They were previously the responsibility of the [Department of Transport and Regional Services](/wiki/Department_of_Transport_and_Regional_Services) (before 2007), the [Attorney-General's Department](/wiki/Attorney-General%27s_Department_(Australia)) (2007–2013), [Department of Infrastructure and Regional Development](/wiki/Department_of_Infrastructure_and_Regional_Development) (2013–2017) and [Department of Infrastructure, Regional Development and Cities](/wiki/Department_of_Infrastructure,_Regional_Development_and_Cities) (2017–2020). As of November 2023, the Administrator is [Farzian Zainal](/wiki/Farzian_Zainal), she is also the Administrator of [Christmas Island](/wiki/Christmas_Island). These two territories comprise the [Australian Indian Ocean Territories](/wiki/Australian_Indian_Ocean_Territories). The Australian Government provides Commonwealth-level government services through the Christmas Island Administration and the Department of Infrastructure, Transport, Regional Development, Communications and the Arts. As per the Federal Government's *Territories Law Reform Act 1992*, which came into force on 1 July 1992, Western Australian laws are applied to the Cocos Islands, \"so far as they are capable of applying in the Territory\"; non-application or partial application of such laws is at the discretion of the federal government. The Act also gives Western Australian courts judicial power over the islands. The Cocos Islands remain constitutionally distinct from Western Australia, however; the power of the state to legislate for the territory is power delegated by the federal government. The kind of services typically provided by a state government elsewhere in Australia are provided by departments of the Western Australian Government, and by contractors, with the costs met by the federal government. There also exists a unicameral [Cocos (Keeling) Islands Shire Council](/wiki/Shire_of_Cocos) with seven seats. A full term lasts four years, though elections are held every two years; approximately half the members retire each two years. As of March 2024[update] the president of the shire is Aindil Minkom. The most recent local election took place on 21 October 2023 alongside elections on [Christmas Island](/wiki/Christmas_Island). ### Federal politics House of Representatives, 2022[Labor](/wiki/Australian_Labor_Party)69.00%[Country Liberal](/wiki/Country_Liberal_Party)10.00%[Liberal Democrats](/wiki/Liberal_Democratic_Party_(Australia))8.36%[Greens](/wiki/Australian_Greens)5.40%Senate, 2022[Labor](/wiki/Australian_Labor_Party)68.70%[Liberal Democrats](/wiki/Liberal_Democratic_Party_(Australia))10.87%[Country Liberal](/wiki/Country_Liberal_Party)9.13%[Greens](/wiki/Australian_Greens)0.87% Cocos (Keeling) Islands residents who are Australian citizens also vote in [federal elections](/wiki/Elections_in_Australia). Cocos (Keeling) Islanders are represented in the House of Representatives by the member for the [Division of Lingiari](/wiki/Division_of_Lingiari) (in the [Northern Territory](/wiki/Northern_Territory)) and in the Senate by Northern Territory senators. At the [2022 Australian federal election](/wiki/2022_Australian_federal_election) the [Labor Party](/wiki/Australian_Labor_Party) received absolute majorities from Cocos electors in both the House of Representatives and the Senate. ### Defence and law enforcement Defence is the responsibility of the [Australian Defence Force](/wiki/Australian_Defence_Force). Until 2023, there were no active military installations or defence personnel on the island; the administrator could request the assistance of the Australian Defence Force if required. In 2016, the Australian Department of Defence announced that the [Cocos (Keeling) Islands Airport](/wiki/Cocos_(Keeling)_Islands_Airport) (West Island) would be upgraded to support the [Royal Australian Air Force](/wiki/Royal_Australian_Air_Force)'s [P-8 Poseidon](/wiki/Boeing_P-8_Poseidon) maritime patrol aircraft. Work was scheduled to begin in early 2023 and be completed by 2026. The airfield will act as a forward operating base for Australian surveillance and electronic warfare aircraft in the region. The [Royal Australian Navy](/wiki/Royal_Australian_Navy) and [Australian Border Force](/wiki/Australian_Border_Force) also deploy [Cape](/wiki/Cape-class_patrol_boat) and [*Armidale*-class](/wiki/Armidale-class_patrol_boat) patrol boats to conduct surveillance and counter-migrant smuggling patrols in adjacent waters. As of 2023, the Navy's *Armidale*-class boats are in the process of being replaced by larger [*Arafura*-class offshore patrol vessels](/wiki/Arafura-class_offshore_patrol_vessel). Civilian law enforcement and community policing is provided by the [Australian Federal Police](/wiki/Australian_Federal_Police). The normal deployment to the island is one [sergeant](/wiki/Sergeant) and one [constable](/wiki/Constable). These are augmented by two locally engaged Special Members who have police powers. ### Courts Since 1992, court services have been provided by the [Western Australian Department of the Attorney-General](/wiki/Department_of_the_Attorney_General_(Western_Australia)) under a service delivery arrangement with the Australian Government. Western Australian Court Services provide Magistrates Court, District Court, Supreme Court, Family Court, Children's Court, Coroner's Court and Registry for births, deaths and marriages and change of name services. Magistrates and judges from Western Australia convene a [circuit court](/wiki/Circuit_court) as required. ### Health care Home Island and West Island have medical clinics providing basic health services, but serious medical conditions and injuries cannot be treated on the island and patients are sent to Perth for treatment, a distance of 3,000 km (1,900 mi). ## Demographics According to the 2021 Australian Census, the population of the Cocos Islands is 593 people. The gender distribution stands at an approximate 51% male and 49% female. The median age of the population is 40 years, slightly older than the median Australian population age of 38 years. As of 2021, there are no people living on the Cocos Islands who identify as Indigenous Australians (Aboriginal or Torres Strait Islander). The majority religion of the Cocos Islands is [Islam](/wiki/Islam_in_Cocos_Islands), with 65.6% of the total population identifying as Muslim, followed by Unspecified (15.3%), Non-religious (14.0%), Catholic (2.0%), Anglican (1.5%). The remaining 1.6% of Cocos Islanders identify as secular or hold various other beliefs (including atheism, agnosticism and unspecified spiritual beliefs). 73.5% of the population were born in Australia - either on the mainland, on the Cocos Islands, or in another Australian territory. The remaining 26.5% come from other countries, including Malaysia (4.0%), England (1.3%), New Zealand (1.2%), Singapore (0.5%) and Argentina (0.5%), among others. 61.2% of the population speak Malay at home, while 19.1% speak English, and 3.5% speak another language (including Spanish and various Austronesian and African languages). 63.0% of the population speaks either only English or speaks English \"well or very well\", while 19.0% speak English \"not well or at all\". [Kaum Ibu (Women's Group)](/wiki/Kaum_Ibu_(Women%27s_Group)) is a [women's rights](/wiki/Women%27s_rights) organisation that represents the view of women at a local and national level. ## Economy The population of the islands is approximately 600. There is a small and growing tourist industry focused on water-based or nature activities. In 2016, a beach on Direction Island was named the best beach in Australia by [Brad Farmer](/wiki/Brad_Farmer), an Aquatic and Coastal Ambassador for Tourism Australia and co-author of *101 Best Beaches 2017*. Small local gardens and fishing contribute to the food supply, but most food and most other necessities must be imported from Australia or elsewhere. The Cocos Islands Cooperative Society Ltd. employs construction workers, [stevedores](/wiki/Stevedore), and [lighterage](/wiki/Lightering) worker operations. Tourism employs others. The unemployment rate was 6.7% in 2011. On 2 April 2025, United States President [Donald Trump](/wiki/Donald_Trump) announced a 10% [tariff](/wiki/Tariffs_in_the_second_Trump_administration) on the Cocos Islands. ## Strategic importance The Cocos (Keeling) Islands hold significant strategic value due to their location near vital shipping lanes in the [Indian Ocean](/wiki/Indian_Ocean) and their proximity to the [Malacca](/wiki/Strait_of_Malacca), [Sunda](/wiki/Sunda_Strait), and [Lombok Straits](/wiki/Lombok_Strait). This positioning allows for effective monitoring and control of maritime traffic between the Indian and Pacific Oceans. ### Military developments and alliances In recent years, both Australia and the United States have recognized the islands' strategic importance. [Euronews](/wiki/Euronews) described the plan as Australian support for an increased American presence in Southeast Asia, but expressed concern that it was likely to upset Chinese officials. After plans to construct airbases were reported on by *[The Washington Post](/wiki/The_Washington_Post)*, Australian defence minister [Stephen Smith](/wiki/Stephen_Smith_(Australian_politician)) stated that the Australian government views the \"Cocos as being potentially a long-term strategic location, but that is down the track.\" In 2023, Indian aircraft from their Navy and Air Force paid a visit to the islands. Australia hopes to further advance relationships with India in order to grow their monitoring strength in the Indian Ocean. #### Airfield upgrades Australia has initiated a project to upgrade the airfield on [West Island](/wiki/West_Island,_Cocos_(Keeling)_Islands) to accommodate larger military aircraft, including the [P-8A Poseidon](/wiki/Boeing_P-8_Poseidon) maritime patrol aircraft. This enhancement aims to bolster maritime surveillance capabilities in the region. #### U.S. strategic interests The [U.S. military](/wiki/United_States_Armed_Forces) is considering the Cocos Islands for infrastructure development under the Pacific Deterrence Initiative, reflecting their significance in countering regional threats and ensuring free navigation. #### India-Australia cooperation In 2023, [Indian Navy](/wiki/Indian_Navy) and [Air Force](/wiki/Indian_Air_Force) aircraft visited the Cocos Islands, marking a step forward in defense collaboration between India and Australia. This visit underscored the islands' role in enhancing joint maritime security efforts in the Indian Ocean. ### Geographic significance The islands' location offers several strategic advantages. - Their proximity to critical maritime chokepoints makes them ideal for deploying surveillance assets to monitor naval activities and secure sea lines of communication. - The islands can serve as a base for refueling and resupplying naval vessels and aircraft, extending operational reach in the region. #### Subsea cable projects In late 2024, [Google](/wiki/Google), in collaboration with partners, announced plans to build a subsea cable connecting [Darwin, Australia](/wiki/Darwin,_Northern_Territory), to Christmas Island. This project aimed to enhance digital resilience and connectivity, aligning with broader strategic objectives in the region. ## Communications and transport ### Transport The islands feature approximately 15 kilometres (9.3 mi) of roads. The primary airport, [Cocos (Keeling) Islands Airport](/wiki/Cocos_(Keeling)_Islands_Airport), is located on [West Island](/wiki/West_Island) and has a single 2,441-meter paved runway. [Virgin Australia](/wiki/Virgin_Australia) operates scheduled flights from [Perth Airport](/wiki/Perth_Airport) twice a week, with some services also stopping at [Christmas Island](/wiki/Christmas_Island). Historically, from 1952 until 1967, the airport served as a refueling stop for flights between Australia and [South Africa](/wiki/South_Africa). Local transportation includes a tourist bus on [Home Island](/wiki/Home_Island) and a bus service on West Island operated by the Cocos Islands Cooperative Society, which also manages the inter-island ferry, *Cahaya Baru*, connecting West, Home, and Direction Islands. There is a [lagoon](/wiki/Lagoon) anchorage between Horsburgh and Direction islands for larger vessels, while yachts have a dedicated anchorage area in the southern lee of Direction Island. There are no major [seaports](/wiki/Seaport) on the islands. ### Communications Telecommunication services are integrated into Australia's system, utilizing the area code +61 8 9162 xxxx. Public telephones are available on both West and Home Islands. Mobile services are provided by Indian Ocean Territories Telecom (IOTT), offering 4G connectivity and various NBN plans, including Sky Muster Plus. SIM and recharge cards can be purchased locally. Internet services are delivered via satellite, with providers like MultiWave Networks offering NBN Sky Muster Plus premium services. The territory's country code top-level domain (ccTLD) is .cc, administered by [VeriSign](/wiki/Verisign) through its subsidiary eNIC. Postal services, managed by [Australia Post](/wiki/Australia_Post), use the postcode 6799. Post offices are situated on both West and Home Islands. Standard letters and express post items are dispatched by air twice weekly, while other mail is sent by sea, which can result in delivery times of up to two months. Efforts are ongoing to enhance the islands' infrastructure. For instance, the [Department of Infrastructure, Transport, Regional Development, Communications and the Arts](/wiki/Department_of_Infrastructure,_Transport,_Regional_Development,_Communications_and_the_Arts) is involved in projects like the Seawater Reverse Osmosis Plant to improve the community's water supply. The [National Broadband Network](/wiki/National_Broadband_Network) announced in early 2012 that it would extend service to Cocos in 2015 via high-speed satellite link. The [Oman Australia Cable](/wiki/Oman_Australia_Cable), completed in 2022, links Australia and Oman with a spur to the Cocos Islands. ## Media The Cocos (Keeling) Islands have access to a range of modern communication services. ### Newspapers The Cocos Islands Community Resource Centre publishes a fortnightly newsletter called *The Atoll*. It is available in paper and electronic formats. ### Radio This section **does not cite any sources**. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed. *(May 2025)* *(Learn how and when to remove this message)* The Cocos (Keeling) Islands receives radio stations from [Perth](/wiki/Perth) and [Broome](/wiki/Broome,_Western_Australia). This includes [ABC Kimberley](/wiki/ABC_Kimberley), [Triple J](/wiki/Triple_J) and [Hit WA](/wiki/Hit_Western_Australia) (Formerly [Red FM](/wiki/Red_FM_(Australia))). A local radio station, 6CKI – Voice of the Cocos (Keeling) Islands, is staffed by community volunteers and provides some local content. ### Television Australian The Cocos (Keeling) Islands receives a range of digital channels from [Western Australia](/wiki/Western_Australia) via satellite and is broadcast from the Airport Building on the West Island on the following VHF frequencies: [ABC6](/wiki/ABW_(TV_station)), [SBS7](/wiki/Special_Broadcasting_Service), [WAW8](/wiki/GWN7), [WOW10](/wiki/WOW_(TV_station)) and [WDW11](/wiki/West_Digital_Television) Malaysian From 2013 onwards, Cocos Island received four Malaysian channels via satellite: [TV3](/wiki/TV3_(Malaysia)), [ntv7](/wiki/Ntv7), [8TV](/wiki/8TV_(Malaysia)) and [TV9](/wiki/TV9_(Malaysia)).[*citation needed*] ## Education There is a school in the archipelago, [Cocos Islands District High School](/wiki/Cocos_Islands_District_High_School), with campuses located on West Island (Kindergarten to Year 10), and the other on Home Island (Kindergarten to Year 6). CIDHS is part of the [Western Australia Department of Education](/wiki/Western_Australia_Department_of_Education). School instruction is in English on both campuses, with Cocos Malay teacher aides assisting the younger children in Kindergarten, Pre-Preparatory and early Primary with the English curriculum on the Home Island Campus. The Home Language of Cocos Malay is valued whilst students engage in learning English. ## Culture Although it is an Australian territory, the culture of the islands has extensive influences from [Malaysia](/wiki/Malaysia) and [Indonesia](/wiki/Indonesia) due to its predominantly ethnic Malay population. ## Heritage listings The [West Island Mosque](/wiki/West_Island_Mosque) on Alexander Street is listed on the [Australian Commonwealth Heritage List](/wiki/Australian_Commonwealth_Heritage_List). ## Museum The [Pulu Cocos Museum](/wiki/Pulu_Cocos_Museum) on Home Island was established in 1987, in recognition of the fact that the distinct culture of Home Island needed formal preservation. The site includes the displays on local culture and traditions, as well as the early history of the islands and their ownership by the [Clunies-Ross family](/wiki/Clunies-Ross_family). The museum also includes displays on military and naval history, as well as local botanical and zoological items. ## Sport [Rugby league](/wiki/Rugby_league) is a popular sport on the islands. The Cocos Islands Golf Club, located on West Island and established in 1962, is the only golf course in the world that plays across an international [airport runway](/wiki/Airport_runway). Unlike [Norfolk Island](/wiki/Norfolk_Island), another external territory of Australia, the Cocos Islands do not participate in the [Commonwealth Games](/wiki/Commonwealth_Games) or the [Pacific Games](/wiki/Pacific_Games). ## Plastic pollution A 2019 study led by Jennifer Lavers from the [University of Tasmania](/wiki/University_of_Tasmania)'s Institute of Marine and Antarctic Studies published in the journal *[Scientific Reports](/wiki/Scientific_Reports)* estimated the volume of [plastic rubbish](/wiki/Plastic_pollution) on the Islands as around 414 million pieces, weighing 238 tonnes, 93% of which lies buried under the sand. It said that previous surveys which only assessed surface garbage probably \"drastically underestimated the scale of debris accumulation\". The plastic waste found in the study consisted mostly of single-use items such as bottles, [plastic cutlery](/wiki/Plastic_cutlery), bags and [drinking straws](/wiki/Drinking_straw). ## Image gallery - Gallery - Geography portal - Islands portal - Asia portal - Australia portal - [Banknotes of the Cocos (Keeling) Islands](/wiki/Banknotes_of_the_Cocos_(Keeling)_Islands) - [Index of Cocos (Keeling) Islands-related articles](/wiki/Index_of_Cocos_(Keeling)_Islands-related_articles) - [Pearl Islands](/wiki/Pearl_Islands) (*Isla de Cocos*, Panama; *Cocos Island*, Costa Rica). ## Notes ### Citations ### Sources - Shire of Cocos (Keeling) Islands homepage - Areas of individual islets - Atoll Research Bulletin vol. 403 - Cocos (Keeling) Islands Tourism website - \"Keeling Islands\". *[Encyclopædia Britannica](/wiki/Encyclop%C3%A6dia_Britannica_Eleventh_Edition)*. Vol. 15 (11th ed.). 1911. p. 712. - Noel Crusz, *The Cocos Islands mutiny* Archived 11 September 2001 at the [Wayback Machine](/wiki/Wayback_Machine), reviewed by Peter Stanley (Principal Historian, Australian War Memorial). - The man who lost a \"coral kingdom\" - Amateur Radio DX Pedition to Cocos (Keeling) Islands VK9EC 12°07′03″S 96°53′42″E﻿ / ﻿12.11750°S 96.89500°E﻿ / -12.11750; 96.89500\n",
  "language": "en",
  "processed_at": "2026-01-12T10:04:49.652744",
  "title": "Cocos (Keeling) Islands",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Cocos_(Keeling)_Islands"
}