{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:16:59.517876"
  },
  "content": "Jam made from a base of coconut milk, eggs and sugarThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Coconut jam\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(July 2017)* *(Learn how and when to remove this message)* **Coconut jam**, also known as **kaya jam** or simply **kaya**, is a sweet [spread](/wiki/Spread_(food)) made from a base of [coconut milk](/wiki/Coconut_milk), [eggs](/wiki/Egg_(food)), sugar and sometimes [pandan leaves](/wiki/Pandanus_amaryllifolius) as a flavouring. It is popular throughout [Southeast Asia](/wiki/Southeast_Asia). ## Origin The origins of kaya are subject to various interpretations. Some sources suggest it is a Eurasian jam unique to Singapore and Malaysia, adapted from a Portuguese egg jam. Others propose that Hainanese immigrants created [kaya toast](/wiki/Kaya_toast) by adapting what they had previously prepared while serving on British ships during the Straits Settlements period. In Thailand, a similar spread is known as sangkhaya, while in the Philippines, an eggless version called matamís sa báo is made from coconut cream and sugar. The spread's widespread popularity across these regions has led to various adaptations and flavors, making kaya a versatile and beloved component of Southeast Asian cuisine. ## Indonesia, Malaysia and Singapore The word for coconut jam in the [Malay language](/wiki/Malay_language), **kaya**, means rich, referencing the texture of the popular food. It is also called **srikaya**. In Malaysia, Indonesia and Singapore, kaya has a creamy texture. It is made from coconut milk (locally known as 'santan') and [duck](/wiki/Duck) or chicken [eggs](/wiki/Egg_(food)), flavored with [pandan leaves](/wiki/Pandanus_amaryllifolius) and sweetened with sugar. The resulting color varies depending on the color of the egg yolks, the amount of pandan, and the extent of the [caramelization](/wiki/Caramelization) of the sugar. As a popular local spread, kaya is typically spread on [toast](/wiki/Toast_(food)) to make [kaya toast](/wiki/Kaya_toast) and eaten in the morning, but is also enjoyed throughout the day. Kaya can be found in most [kopitiam](/wiki/Kopitiam) and night markets. Different varieties available include the [nyonya](/wiki/Peranakan_cuisine) kaya, which is of a lighter-green color, and Hainanese kaya, which is of a darker brown and uses caramelized sugar, and is often further sweetened with honey. In this region, kaya is also used as a topping for several desserts including *pulut taitai* or *pulut tekan*, a dessert of sweet [glutinous rice](/wiki/Glutinous_rice) colored blue with [butterfly pea flowers](/wiki/Clitoria_ternatea) (*bunga telang*), and *pulut seri muka*, a similar dessert but colored green due to adding pandan leaves. It is also used with [glutinous rice](/wiki/Glutinous_rice) to make *[kuih](/wiki/Kuih) seri kaya*. ## Philippines Philippine coconut jam is known as **matamís sa báo** (also matamís na báo or minatamís na báo, among other names). The names literally mean \"sweetened coconut\". It is different from other Southeast Asian versions in that it uses [coconut cream](/wiki/Coconut_cream) (*kakang gata*, the first and second press of grated coconut meat) and cane sugar extract or [molasses](/wiki/Molasses) (treacle). It also does not use eggs and thus is more like [syrup](/wiki/Syrup) rather than [custard](/wiki/Custard). It is often eaten on toast or [pandesal](/wiki/Pandesal) or used as a filling for [pan de coco](/wiki/Pan_de_coco). When it is mixed with ground glutinous rice paste, it becomes a popular dessert known as [kalamay](/wiki/Kalamay). A less viscous version made with [coconut milk](/wiki/Coconut_milk) (*gata*) is known as *[latik](/wiki/Latik)* (anglicized as \"coconut caramel\"), and is used in place of [syrup](/wiki/Syrup) in numerous native Filipino desserts. ## Thailand The kaya of Thailand is called **sangkhaya** ([Thai](/wiki/Thai_language): สังขยา, pronounced [sǎŋkʰàjǎː]) in Thai. There are two major types of kaya eaten in Thailand. One type is more liquid than the other, while the less thick kaya is similar to what is eaten in Malaysia and Indonesia. People either spread it on steamed or toasted bread or dip the bread into kaya. This kind of kaya is commonly sold by street vendors but has recently been brought into tea and coffee shops. Another type is a concoction that has a less sticky and more custard-like texture. It is sometimes called \"**coconut custard**\" in English and is used to make *[sangkhaya fakthong](/wiki/Sangkhaya_fakthong)* (สังขยาฟักทอง, [sǎŋkʰàjǎː fáktʰɔ̄ːŋ]; *sangkhaya maryu* in [Lao](/wiki/Lao_language)), sangkhaya [pumpkin](/wiki/Kabocha) or custard pumpkin, *[khao niao sangkhaya](/wiki/Khao_niao_sangkhaya)* (ข้าวเหนียวสังขยา, [kʰâːw nǐaw sǎŋkʰàjǎː]), [glutinous rice](/wiki/Glutinous_rice) topped with sangkhaya, and *sangkhaya maphrao* (สังขยามะพร้าว, [sǎŋkʰàjǎː māpʰráːw]), sangkhaya served in a coconut. ## Samoa Coconut jam is known in [Samoa](/wiki/Samoa) as **siamu popo**. The word *siamu* in [Samoan](/wiki/Samoan_language) is loaned from English \"jam\" and *popo* refers to a mature coconut that is used for eating, usually for the extraction of [coconut cream](/wiki/Coconut_cream). The preparation of *siamu popo* doesn’t require eggs, the sugar is caramelised and coconut cream and citrus leaves are added. It has a consistency resembling a mixture of syrup and caramel. *Siamu popo* is often used as a spread on toast and is used in desserts, most often used as a filling for a doughnut called german bun. - [Kalamay](/wiki/Kalamay) - [Kaya toast](/wiki/Kaya_toast) - [Latik](/wiki/Latik) - [Roti bakar](/wiki/Roti_bakar) - [Sankya lapov](/wiki/Sankya_lapov) - [Nata de coco](/wiki/Nata_de_coco) - [Watalappam](/wiki/Watalappam) - [List of spreads](/wiki/List_of_spreads) - Media related to Coconut jam at Wikimedia Commons - Famous Thai Dishes including photos of Thai *sangkhaya* desserts - Not your usual kaya with three recipes made with palm sugar, pumpkin and taro\n",
  "language": "en",
  "processed_at": "2026-01-12T11:16:59.517448",
  "title": "Coconut jam",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Kaya_(jam)"
}