{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:04:51.273252"
  },
  "content": "Singaporean multinational supermarket companyThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Cold Storage\" supermarket – news **·** newspapers **·** books **·** scholar **·** JSTOR *(May 2022)* *(Learn how and when to remove this message)* **Cold Storage** is a [Singaporean](/wiki/Singapore) multinational supermarket company currently owned by Macrovalue. Its parent company also operates [Market Place](/wiki/Market_Place_(supermarket)) stores, now branded as Cold Storage Fresh, as well as the [Giant](/wiki/Giant_(hypermarket)) hypermarket brand, and has various other supermarkets around [Asia](/wiki/Asia) including [Hero](/wiki/Hero_(supermarket)) and [Wellcome](/wiki/Wellcome). Founded in 1903 as the **Singapore Cold Storage Company**, Cold Storage was one of the first supermarkets in [Singapore](/wiki/Singapore) to offer its merchandise online in 1997. The number of regular customers has since grown from 6,000 in 1998, to more than 15,000 in 2012. In 1992, [DFI](/wiki/DFI_Retail_Group) purchased the company. [SGS](/wiki/SGS_S.A.) has awarded a [HACCP](/wiki/HACCP) certification to Cold Storage, for its quality and integrity in food safety. As of 2025, Cold Storage operates 45 stores in [Singapore](/wiki/Singapore), located across the country in city centre, affluent suburbs and [HDB](/wiki/Public_housing_in_Singapore) (public housing) estates. ## History ### Early years Established in 1903 in [Singapore](/wiki/Singapore), Cold Storage started as a small depot storing and selling mainly frozen meat. Cold Storage was then known as the **Singapore Cold Storage Company**, and was the main manufacturer of ice in [Singapore](/wiki/Singapore). Taking advantage of the booming ice manufacturing and refrigeration business, Cold Storage ventured into the [ice cream](/wiki/Ice_cream) business. In 1923, a small factory was set up at the [Borneo Wharf](/wiki/Borneo_Wharf_railway_station) of the [Harbourfront](/wiki/HarbourFront_(Singapore)) district to manufacture ice cream under the Paradise brand. In its early days, the company's primary concern was to have a quick and profitable turnover of its imported meats and range of products. Cold Storage later shifted from counter-service to self-service, introducing the supermarket to Singapore.[*citation needed*] ### Tropical dairy farm In 1937, Cold Storage founded the world's first tropical dairy farm at the [Bukit Timah](/wiki/Bukit_Timah) district of [Singapore](/wiki/Singapore), which aimed to produce fresh [pasteurised milk](/wiki/Pasteurised_milk). This farm, then known as the Singapore Dairy Farm, was situated inside what is now the [Bukit Timah Nature Reserve](/wiki/Bukit_Timah_Nature_Reserve). It kept as many as 800 cows. Pasteurised milk produced at the farm was packaged in pyramid-shaped cartons and sold under the brand [Magnolia](/wiki/Magnolia_(Fraser_and_Neave_brand)). By 1974, the farm was planned to be redeveloped into a residential area. Cold Storage is the [Singapore's](/wiki/Singapore) oldest established supermarket operator.[*citation needed*] It was the first supermarket in [Singapore](/wiki/Singapore) to receive the CaseTrust Mark introduced by the Consumer Association of Singapore (CASE) in 1998 which identifies companies that receive a high degree of consumer confidence.[*citation needed*] It was also the first supermarket in Singapore to receive [MUIS](/wiki/Majlis_Ugama_Islam_Singapura) certification for its supermarket operations at [Causeway Point](/wiki/Causeway_Point) in [Woodlands](/wiki/Woodlands,_Singapore), thus providing [Muslims](/wiki/Muslim) with the assurance of [Halal](/wiki/Halal) purchases. ### Recent years In 1973, Cold Storage's Pasaraya Malaysia, a joint venture of Cold Storage's subsidiary Supermarkets Malaysia and \"Malaysian interests\" was responsible for the construction of [Jaya Supermarket](/wiki/Jaya_Supermarket) in [Petaling Jaya](/wiki/Petaling_Jaya), set to be completed in April 1974. In 1985, Cold Storage Malaysia opened its first Majik Market store in Bangsar Baru, Kuala Lumpur, It operated under a franchise from Mumford Inc of Atlanta, USA, which complements its existing Jaya Supermarket chain but differ in concept and management. Due to competition from [7-Eleven](/wiki/7-Eleven), whose Malaysian franchise was then operated by the Antah Holdings group, Cold Storage Malaysia phased out Majik Market as part of its streamlining process. Cold Storage Malaysia, along with Peremba, Gaya Timur and [Jusco](/wiki/Aeon_(company)) were responsible for the initial version of Jaya Jusco \"superstores\" in 1985, with three stores in [Dayabumi](/wiki/Dayabumi_Complex), [Taman Tun Dr Ismail](/wiki/Taman_Tun_Dr_Ismail) and Subang Jaya. In 1987, Cold Storage Malaysia, which had been through a difficult financial phase in the previous three years, had a change in management with some senior executives leaving. In 1992, [DFI Retail Group](/wiki/DFI_Retail_Group) purchased the company, although no major changes were made to the Cold Storage brand.[*citation needed*] Cold Storage started the Fresh Food Distribution Centre in [Singapore](/wiki/Singapore) in 1999, a composite multi-temperature warehousing for fresh and [frozen food](/wiki/Frozen_food) distribution. In 2023, [DFI Retail Group](/wiki/DFI_Retail_Group) divested its Malaysian food retailing business (including Cold Storage brand in that country) to Macrovalue Sdn Bhd. In 2025, DFI Retail Group sold the Singaporean food retailing business (including Cold Storage brand) to Macrovalue Pte Ltd. ## Brands ### Private labels Cold Storage supermarkets sell products from DFI's Meadows and Yu Pin King private labels.[*citation needed*] ### Cold Storage Fresh and Mercató Cold Storage Fresh (formerly Market Place, Jasons and Jasons Deli) in [Singapore](/wiki/Singapore), Mercató was formerly known as Jasons Food Hall and had started business in 1975. Now, It operates five stores in [Singapore](/wiki/Singapore). ### Giant [Giant](/wiki/Giant_(hypermarket)), a subsidiary of Cold Storage, is one of the largest players of the retail industry in [Singapore](/wiki/Singapore) as well as in [Malaysia](/wiki/Malaysia), having over 85 branches spread throughout the country. It was founded by the Teng family in 1944. Prices at [Giant](/wiki/Giant_(hypermarket)) are significantly cheaper than at Cold Storage.[*citation needed*] ### Shop N Save [Dairy Farm](/wiki/Dairy_Farm_International_Holdings) Singapore acquired [Shop N Save](/wiki/Shop_%27n_Save) in 2003, 35 stores from QAF and Belgian retailer, [Delhaize](/wiki/Delhaize). It was a former [discount supermarket](/wiki/No_frills#No-frills_supermarkets) chain in Singapore, operating 50 stores located across the island in [HDB](/wiki/HDB_Hub) estates and suburban malls. It sells a range of cheap products and fresh food. In 2013, it was merged with [Giant](/wiki/Giant_(hypermarket)). ## Notes and references - Official Website Portals: - Singapore - Supermarkets - Companies\n",
  "language": "en",
  "processed_at": "2026-01-12T10:04:51.272900",
  "title": "Cold Storage (supermarket)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Cold_Storage_(supermarket)"
}