{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:04:53.681575"
  },
  "content": "1°17′23″N 103°50′53″E﻿ / ﻿1.28972°N 103.84806°E﻿ / 1.28972; 103.84806 Bridge in Downtown Core and the Singapore River Planning Area, Singapore **Coleman Bridge** is a [vehicular](/wiki/Vehicular) [bridge](/wiki/Bridge) in [Singapore](/wiki/Singapore). The bridge links [Hill Street](/wiki/Hill_Street,_Singapore) and [New Bridge Road](/wiki/New_Bridge_Road), spanning the [Singapore River](/wiki/Singapore_River) near [Clarke Quay](/wiki/Clarke_Quay). Part of the bridge demarcates the [boundary](/wiki/Border) between the [Downtown Core](/wiki/Downtown_Core) and the [Singapore River Planning Area](/wiki/Singapore_River), both of which are located within the [Central Area](/wiki/Central_Area,_Singapore). The Coleman Bridge was the second bridge built across the Singapore River and the first built in [masonry](/wiki/Masonry). ## History In 1840, a [brick](/wiki/Brick) bridge joining Old Bridge Road and Hill Street over the Singapore River was constructed and called Coleman Bridge. The bridge had nine [arches](/wiki/Arch), and was designed by and named after [George Drumgoole Coleman](/wiki/George_Drumgoole_Coleman) (1795–1844), an [Irish](/wiki/Irish_people) [architect](/wiki/Architect) and Singapore's first architect. It was referred to as the **New Bridge**, lending its name to the [road](/wiki/Road) on its southern end — New Bridge Road. In 1865, the brick bridge was replaced by one made of [timber](/wiki/Timber) but was not well constructed. It cost about [Straits $](/wiki/Straits_dollar)10,000 and was built by the government. In 1886, an [iron](/wiki/Iron) bridge was built to replace the [wooden](/wiki/Wood) one. This iron bridge was considered one of the most attractive spanning the Singapore River. It was present for about 100 years, where the bridge had shown signs of ageing, and the need to refurbish the bridge. The widening of Coleman Bridge was planned since 1977, but had not been announced until 1984, where the construction of the extra road necessitated the demolition of the old iron bridge. The eastbound carriageway was shifted to the western side, where the traffic switch is in March 1986. It was replaced by present concrete bridge in December 1987 for the westbound carriageway. The move facilitates better traffic flow for about 15 years before the [North East MRT line](/wiki/North_East_Line) opens. However, several features of the iron bridge such as the decorative [lamp posts](/wiki/Lamp_post) and iron [railings](/wiki/Guard_rail) were incorporated into the current [structure](/wiki/Structure), in recognition of its historical significance. Coleman Bridge is known as *yi ma lo khiu* or \"the bridge at the second road\" in [Cantonese](/wiki/Cantonese_language). - [List of bridges in Singapore](/wiki/List_of_bridges_in_Singapore) - [Whampoa's Ice House](/wiki/Whampoa%27s_Ice_House) - National Heritage Board (2006), *Discover Singapore - Heritage Trails*, [ISBN](/wiki/ISBN_(identifier)) 981-05-6433-3 - Victor R Savage, Brenda S A Yeoh (2004), *Toponymics - A Study of Singapore Street Names*, Eastern University Press, [ISBN](/wiki/ISBN_(identifier)) 981-210-364-3 This article about a Singapore building or structure is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T10:04:53.681167",
  "title": "Coleman Bridge, Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Coleman_Bridge,_Singapore"
}