{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:05:05.487789"
  },
  "content": "Singaporean multinational land transport company **ComfortDelGro Corporation Limited**, commonly known as **ComfortDelGro**, is a [multi-national](/wiki/Multinational_corporation) [transport](/wiki/Transport) group based in [Singapore](/wiki/Singapore). It is listed on the [Singapore Exchange](/wiki/Singapore_Exchange) and operates more than 54,000 vehicles across 13 countries. It was formed on 29 March 2003 through a merger of Singaporean land transport companies Comfort Group and DelGro Corporation. On 17 September 2019, the [Dow Jones Sustainability Asia Pacific Index](/wiki/Dow_Jones_Sustainability_Indices#DJSI_Asia_Pacific_Index) listed ComfortDelGro on its index in recognition of its sustainability efforts, thus becoming the first transport company in Singapore as well as in Asia to do so. ## History ### Comfort Group Limited In May 1970, the [National Trades Union Congress](/wiki/National_Trades_Union_Congress) (NTUC) announced plans to provide a cooperative taxi and minibus service. The cooperative was aimed to target the problem of pirate or \"ali baba\" taxis which were rampant in Singapore at that time, and NTUC planned to get former pirate taxi drivers to drive the minibuses as part of the cooperative. The NTUC Co-operative Commonwealth for Transport Limited (\"COMFORT\" or \"NTUC Comfort\") was hence formed by the NTUC as a social enterprise together with the affiliated [NTUC Income](/wiki/Income_Insurance) and [NTUC Welcome](/wiki/NTUC_Fairprice). Comfort started operations in 1971 started with a fleet of 1,000 taxis, with the first taxis entering service at the end of January that year. In June 1993, NTUC Comfort was corporatised and renamed Comfort Transportation Pte Ltd. Comfort was subsequently listed on 6 June 1994 and became the Comfort Group Limited. The listed company was owned by [Singapore Labour Foundation](/wiki/Singapore_Labour_Foundation) (41.7%), its owner-drivers as a single block (approximately 20%) and the public (35%). At the time of the merger announcement in 2002, Comfort's taxi business operated under the brand names of Comfort and Yellow Top with a combined fleet of approximately 11,340 taxis. It was Singapore's largest private bus operator then with 401 buses on unscheduled routes. It also had a fleet of 730 taxis in [China](/wiki/China) through joint ventures. ### DelGro Corporation Limited Singapore Bus Services Limited was established on 1 July 1973 to unify bus services in Singapore. The company was replaced by Singapore Bus Service (1978) Limited on 17 February 1978, which was then listed on the [Stock Exchange of Singapore](/wiki/Singapore_Exchange) (SES) on 26 June the same year. By the 1990s, the company has diversified to other land transport businesses such as taxis, as well as property and engineering businesses. In 1992, the bus operations were reorganised under a new subsidiary SBS Bus Services Pte Ltd. The original parent company Singapore Bus Service (1978) Limited was renamed DelGro Corporation Limited on 12 November 1997, from the words \"Delta\" and \"Growth\". On 10 December the same year, the bus subsidiary SBS Bus Services Pte Ltd was listed and renamed Singapore Bus Services Limited, before renaming again to [SBS Transit](/wiki/SBS_Transit) in 2001. Until 1995, SBS/DelGro's taxi operations arm was Singapore Bus Service Taxi Pte Ltd (SBS Taxi Pte Ltd). CityCab was formed in 1995 with the merger of three companies – Singapore Airport Bus Service Ltd (SABS), SBS Taxi and Singapore Commuter Pte Ltd (a subsidiary of [ST Automotive](/wiki/ST_Kinetics)). CityCab then became DelGro's new taxi operations arm and was jointly owned by DelGro and ST Automotive (later ST Kinetics). At the time of the merger announcement in 2002, DelGro operated public bus services, taxis and car rental in Singapore, Malaysia, United Kingdom and the People's Republic of China. The Citycab operation ran 5,116 taxis, while SBS Transit was the largest scheduled bus operator in Singapore with 2,872 buses. DelGro had also just been awarded the operation of the [North East MRT line](/wiki/North_East_Line) and the [Sengkang](/wiki/Sengkang_LRT_line) and [Punggol](/wiki/Punggol_LRT_line) light rail systems. ### Merger Comfort and DelGro's merger was first proposed on 21 November 2002. In its joint announcement, the merger aimed to \"consolidate the transportation businesses of the Companies in order to enhance profitability and shareholder value\". The merger was finalised on 29 March 2003. The merger had a market capitalisation of over $1 billion, combined sales of $1.56 billion, and pre-tax earnings of $196 million. It set to provide a spectrum of transport services ranging from bus and taxi services to leasing and vehicle maintenance and inspections. The new company's only rival then was [SMRT Corporation](/wiki/SMRT_Corporation), which had a market capitalisation of around $930 million, sales of $500 million and pre-tax profits of $88.5 million then. The latter's fleet of some 600 buses and 2,000 taxis was smaller, but it was operating Singapore's rail network entirely. ### Expansion into Autonomous Mobility On 10 December 2025, ComfortDelGro announced its partnership with [Pony.ai](/wiki/Pony.ai), and will begin testing their autonomous vehicle shuttles in residential district [Punggol](/wiki/Punggol), Singapore. This comes after they got approval from Singapore regulators to start autonomous vehicle testing on public roads. ## Singapore operations ### Bus and Rail ComfortDelGro owns 75% of [SBS Transit](/wiki/SBS_Transit), which is listed separately on the [Singapore Exchange](/wiki/Singapore_Exchange). SBS Transit is a leading bus and rail operator in Singapore. Every day, it carries more than three million passengers on its extensive bus and rail network. SBS Transit operates about 250 bus services with a fleet of more than 3,200 buses. The buses serve 17 interchanges and more than 3,500 bus stops island-wide. Additionally, SBS Transit operates the [North East Line](/wiki/North_East_Line), which is Singapore's first fully automated, underground heavy rail system that connects Punggol to HarbourFront, as well as the [Sengkang](/wiki/Sengkang_LRT_line) and [Punggol LRT lines](/wiki/Punggol_LRT_line). SBS Transit also operates the [Downtown line](/wiki/Downtown_Line). It is 42 km long with 34 stations, making it the longest underground line in Singapore. The first stage of the Downtown line commenced passenger service on 22 December 2013. The second and third stages were ready for passenger service on 27 December 2015 and 21 October 2017 respectively. ComfortDelGro Bus, as a private-bus charter subsidiary, is the largest private land-transport company in Singapore, which offers a wide range of bus charter services, including employee and school bus services. It also offers overland bus services to West Malaysia, and operates premium bus services, complementing those offered by SBS Transit. ### Taxi Comfort and CityCab, both taxi companies belonging to ComfortDelGro Corporation, are the largest players in Singapore's taxi industry with a combined fleet of 8,800 taxis. The ComfortDelGro taxi booking system wirelessly connects the taxis using the General Packet Radio Service (GPRS) technology via the in-vehicle Mobile Data Terminals (MDTs). Today, its Customer Contact Centre caters to over 32 million taxi bookings annually. Comfort and CityCab also operate ComfortDelGro LimoCabs and MaxiCabs in its fleet. On 20 April 2022, ComfortDelGro launched its mobile application under a fresh name to offer services through one platform. The app, now known as CDG Zig, integrates ComfortDelGro's taxi booking tool with its now-decommissioned lifestyle tool Zig. ### Automotive Engineering Besides servicing private cars through its SPARK Car Care business, ComfortDelGro Engineering provides accident repair for most of ComfortDelGro's taxi fleet, as well as vehicle fleets for ComfortDelGro Bus and ComfortDelGro Rent-A-Car. Its diesel sale department's 17 diesel kiosks provide diesel at subsidised rate to ComfortDelGro's 16,600-strong taxi fleet islandwide. Its vehicle construction unit custom-builds vehicles for passenger transportation as well as for special function for both local and regional customers. It also provides modifications, retrofitting and refurbishment to existing vehicles. ComfortDelGro Engineering (as well as the predecessors) started with SBS in 1977 at MacKenzie Road Depot, assembling Leyland Atlanteans, Mercedes-Benz O305s, Leyland Olympians, Volvo Olympians, Volvo B10TLs, Dennis Tridents, selected Scania K230UBs, Volvo B9TLs while being ordered by SBS Transit; and now [Wright StreetDeck](/wiki/Wright_StreetDeck) from [Big Bus Tours](/wiki/Big_Bus_Tours) Singapore. ### Inspection and Testing Services VICOM is offering testing and inspection services to a wide spectrum of industries such as automotive, petrochemical, aerospace, manufacturing, building, construction, marine and gas. ### Driving Centre ComfortDelGro Driving Centre is a partnership with Chofu Driving School of Japan. The Centre provides driving instruction for motorcars, motorcycles, bus and taxi vocational licences as well as corporate training. ### Car Rental ComfortDelGro Rent-A-Car operates as a car-rental and leasing-service provider in Singapore with a fleet of more than 1,100 vehicles. ### Insurance Broking Service ComfortDelGro Insurance Brokers is an associate company of the Group, and its principal activities relate to risk protection and transfer solutions through the disciplines of insurance broking, employee benefits consulting, risk management operations, claims and loss management and customised solutions. It proposes and implements solutions involving a blend of traditional insurance products, alternative risk financing instruments and methods to help the Group mitigate any risks faced in an increasingly complex environment. ### Outdoor Advertising Moove Media is the advertising arm of ComfortDelGro and has been in operations since 8 April 2005 through the merger of Comfort Ads and SBS Transit Advertising. It marked its launch with several large cows dotted across the island. As of 2020, Moove Media offers an integrated outdoor advertisement platforms, reaching commuters islandwide, through: #### Buses - [SBS Transit](/wiki/SBS_Transit) - buses & bus interchanges - [Go-Ahead Singapore](/wiki/Go-Ahead_Singapore) - [Tower Transit Singapore](/wiki/Tower_Transit_Singapore) - ComfortDelGro Bus #### Rail MRT & LRT lines operated by SBS Transit (with their respective stations inclusive): - [North East MRT line](/wiki/North_East_Line) - [Downtown MRT line](/wiki/Downtown_Line) - [Sengkang](/wiki/Sengkang_LRT_line) and [Punggol](/wiki/Punggol_LRT_line) LRT lines Since 2011, Moove Media offers similar outdoor advertising services in Sydney and Melbourne, Australia. ## Overseas operations ### Australia [ComfortDelGro Australia](/wiki/ComfortDelGro_Australia) is ComfortDelGro's Australian subsidiary, and operates buses in [New South Wales](/wiki/New_South_Wales), [Victoria](/wiki/Victoria_(Australia)), [Queensland](/wiki/Queensland), [Australian Capital Territory](/wiki/Australian_Capital_Territory) and [Northern Territory](/wiki/Northern_Territory). The subsidiary started out in 2005 as a joint venture between ComfortDelGro (51%) and Australian taxi company [Cabcharge](/wiki/A2B_Australia) (49%) known as ComfortDelGro Cabcharge (CDC), to purchase [Westbus](/wiki/Westbus) and [Hillsbus](/wiki/Hillsbus) in Sydney and [Hunter Valley Buses](/wiki/Hunter_Valley_Buses) from [National Express](/wiki/National_Express). In August 2006, ComfortDelGro Cabcharge expanded purchasing the [Western Sydney](/wiki/Western_Sydney) services of [Baxter's Bus Lines](/wiki/Baxter%27s_Bus_Lines) followed in August 2007 by [Morisett](/wiki/Morisset,_New_South_Wales) Bus Service, Sugar Valley Coachlines and [Toronto](/wiki/Toronto,_New_South_Wales) Bus Service. In November 2008, [Kefford Corporation](/wiki/Kefford_Corporation) in Victoria was purchased followed in September 2012 by [Queanbeyan](/wiki/Queanbeyan)-based [Deane's Buslines](/wiki/Qcity_Transit) and [Transborder Express](/wiki/Transborder_Express), the [Melbourne](/wiki/Melbourne) bus services of [Driver Group](/wiki/Driver_Group) in July 2013 and the [Blue Mountains](/wiki/Blue_Mountains_(New_South_Wales)) Bus Company in August 2014. In February 2017, ComfortDelGro purchased Cabcharge's shares in the business with it rebranded [ComfortDelGro Australia](/wiki/ComfortDelGro_Australia). In 2018, ComfortDelGro acquired [Tullamarine Bus Lines](/wiki/Tullamarine_Bus_Lines), National Patient Transport, [Coastal Liner](/wiki/Coastal_Liner), [Forest Coach Lines](/wiki/Forest_Coach_Lines) and [Buslink](/wiki/Buslink). In May 2019 ComfortDelGro acquired Blanch's Bus Company and Brunswick Valley Coaches in the [Northern Rivers](/wiki/Northern_Rivers) region. Additionally, Swan Taxis based in [Perth](/wiki/Perth) became wholly owned by ComfortDelGro in 2010. Swan Taxis later acquired Metro WA Taxi in October 2017. Being wholly owned by ComfortDelGro since acquisition, Swan Taxis was never part of CDC. ### China In China, the Group operates and manages an inter-city bus station, [Tianhe Coach Terminal](/wiki/Tianhe_Coach_Terminal_Station), in Guangzhou. Hengyang's CityCab Bus Services, in which the Group owns a 25% stake, operates 88 buses. ComfortDelGro also operates taxi services in nine cities – Beijing, Shanghai, [Shenyang](/wiki/Shenyang), [Chengdu](/wiki/Chengdu), [Hengyang](/wiki/Hengyang), [Suzhou](/wiki/Suzhou,_Jiangsu), [Nanning](/wiki/Nanning), [Nanjing](/wiki/Nanjing) and [Jilin City](/wiki/Jilin_City) with a total fleet of about 10,650 vehicles. #### Car Rental and Leasing ComfortDelGro launched a motor vehicle rental and leasing business through a joint venture company, ComfortDelGro Rent-A-Car (Chengdu), in Chengdu, the gateway to the fast developing Western region of China. The Group established Nanning ComfortDelGro Rent-A-Car to operate car rental and leasing services in the city on 1 January 2008 with an initial fleet size of 13 cars, and this number has now doubled. #### Driving Centre ComfortDelGro has a joint venture company – Chengdu ComfortDelGro Qing Yang Driving School in Chengdu. The centre offers driving training, professional driver training and driver testing services to the Chinese. In October 2006, the Group expanded its presence in China with its first move into [Chongqing](/wiki/Chongqing) through a 90% stake in new joint venture driving school, Chongqing ComfortDelGro Driver Training Co., Ltd. It expanded its footprint with the acquisition of a site in Liangjiang for its Chongqing Liangjiang ComfortDelGro Driving Training driving school in April 2011, which is expected to be ready by the end of the year. In September 2013, the Group further expanded its operations in Jilin City when its subsidiary, Jilin ComfortDelGro Taxi incorporated Jilin ComfortDelGro Driver Training Co., Ltd, a wholly owned driving school. #### Vehicle Inspection Services In 2004, ComfortDelGro acquired Chengdu Jitong Integrated Vehicle Inspection. Besides being a vehicle inspection centre, it also operates the sales of automotive parts and components in Chengdu. In the same year, it acquired Beijing Tian Long Da Tian Vehicle Inspection, which offers vehicle safety inspection and emission test services in Beijing. ### France In June 2020, ComfortDelGro entered into a collaboration agreement with [RATP Dev](/wiki/RATP_Dev) and [Alstom](/wiki/Alstom) to jointly bid for contracts along [Lines 16](/wiki/Paris_M%C3%A9tro_Line_16) and (/wiki/Paris_M%C3%A9tro_Line_17) of the [Grand Paris Express](/wiki/Grand_Paris_Express) in [Paris](/wiki/Paris). In July 2023, the RATP Dev, Alstom and ComfortDelGro consortium obtained the contract to operate the [Paris Métro Line 15](/wiki/Paris_M%C3%A9tro_Line_15) of the [Grand Paris Express](/wiki/Grand_Paris_Express). ### Ireland In Ireland, ComfortDelGro operates the [Irish Citylink ComfortDelGro](/wiki/CityLink_Ireland), an inter-city coach service with over 70 coaches in [Dublin](/wiki/Dublin), [Galway](/wiki/Galway), [Limerick](/wiki/Limerick) and [Cork](/wiki/Cork_(city)). ### Malaysia In Malaysia, ComfortDelGro offers car-leasing and rental services through CityLimo Leasing (M) Sdn Bhd. The Group currently operates about 230 vehicles in the Capital. In addition to leasing, the company also provides a round-the-clock mobile back-up service that offers assistance to customers in the event of an emergency. ### New Zealand In August 2021, [Auckland One Rail](/wiki/Auckland_One_Rail), in which ComfortDelGro has a 50% shareholding, was awarded a contract by [Auckland Transport](/wiki/Auckland_Transport) to operate train services in [Auckland](/wiki/Auckland) starting from January 2022, lasting eight years initially with room for further extensions. This is the first overseas rail contract attained by ComfortDelGro and first by a Singapore company. ### Sweden In January 2024, a [Go-Ahead Group](/wiki/Go-Ahead_Group) and ComfortDelGro joint venture, in which ComfortDelGro has a 45% stake, was awarded the contract for the operation and maintenance of the [Stockholm Metro](/wiki/Stockholm_Metro) from November 2025, replacing [MTR](/wiki/MTR_Nordic). ### United Kingdom In March 2000, DelGro Corporation purchased the [Metroline](/wiki/Metroline) bus company in London. As of December 2012 it operated 1,200 buses. In June 2013, a further 494 buses were added to Metroline with the purchase of five depots located in North and West London from [First London](/wiki/First_London). Under [Transport for London](/wiki/Transport_for_London) (TfL)'s gross-cost model, operators like Metroline tender for routes and operate them as contractors. The mayor of London decides on the level of fares as well as the concessions for certain passengers. All fare revenue goes to TfL. Fare revenue is then proportionately allocated to operators on a mileage basis and meeting the performance targets set in the contract. ComfortDelGro also owns the [Scottish Citylink](/wiki/Scottish_Citylink) express coach business in [Scotland](/wiki/Scotland). In September 2005 ComfortDelGro entered into a joint venture with [Stagecoach](/wiki/Stagecoach_Group) that combined Scottish Citylink with Stagecoach's [Megabus](/wiki/Megabus_(Europe)) operation in Scotland. In May 2006, the Group acquired Onward Travel, a private car-hire business in Edinburgh, Scotland. It operates an exclusive airport taxi rank concession from [Edinburgh Airport](/wiki/Edinburgh_Airport). In March 2007, the Group acquired another licensed-taxi and private-hire company in [Birmingham](/wiki/Birmingham). The company has since been renamed Computer Cab (Birmingham) Ltd. In June 2015, ComfortDelGro was shortlisted to bid for the [London Overground](/wiki/London_Overground) railway concession but lost out to [Arriva Rail London](/wiki/Arriva_Rail_London). In February 2018, [Adventure Travel](/wiki/Adventure_Travel_(bus_company)) in [South Wales](/wiki/South_Wales) was purchased with 100+ buses for £13.4 million. ComfortDelGro has since improved the business by appointing a new managing director, Adam Keen of [Damory Coaches](/wiki/Damory_Coaches), replacing the managing director that came with the business. Under ComfortDelGro, Adventure Travel has seen substantial expansion with a new rebrand and the termination of all overseas coach work due to the [COVID-19 pandemic](/wiki/COVID-19_pandemic). In December 2021, ComfortDelGro purchased [Megabus](/wiki/Megabus_(Europe)) and the remaining 35% of Scottish Citylink from Stagecoach. In January 2025, [Metroline Manchester](/wiki/Metroline_Manchester) commenced operating [Bee Network](/wiki/Bee_Network) services under contract to [Transport for Greater Manchester](/wiki/Transport_for_Greater_Manchester). #### CityFleet Networks ComfortDelGro also owns [CityFleet Networks](/wiki/CityFleet_Networks), which operates Westbus UK, as well as taxi services in a number of UK cities, including ComCab and Comfort Executive. Comcab, also known as Computer Cab, operates taxis in London, Edinburgh, [Aberdeen](/wiki/Aberdeen) and [Liverpool](/wiki/Liverpool), and operates a fleet of 6,300 radio taxis and private hire vehicles providing a service to local business and private customers. CityFleets Network was previously a joint venture between ComfortDelGro (51%) and Australia-based [Cabcharge Australia](/wiki/Cabcharge_Australia) (49%) until June 2016, when ComfortDelGro purchased the 49% stake from Cabcharge. ### Vietnam In [Ho Chi Minh City](/wiki/Ho_Chi_Minh_City), ComfortDelGro owns 70% of Vietnam Taxi Company (Vinataxi), a joint venture with Vietnamese company Tracodi. It is currently the third largest market share in the taxi sector in the city, and operates a fleet of over 380 taxis. Vinataxi was set up in 1992 as a joint venture between Tracodi and Hong Kong company Tecobest Investment, until Tecobest sold its share of Vinataxi to ComfortDelGro in 2003. Prior to March 2018, ComfortDelGro also had another joint venture with former state-owned enterprise Saigon General Service Corporation (Savico), known as ComfortDelGro Savico Taxi. It was established in 2005 and operated over 220 taxis, a call centre, as well as a workshop which repaired and maintained the taxi fleet. Competition with Uber and Grab, along with spending with the aim of increasing service quality and maintaining the taxi fleet, led to a decrease in profit to only VNĐ235 million (US$10,300) in 2017. Subsequently, ComfortDelGro Savico shut down in March 2018 and merged into Vinataxi later that year. - Singapore portal - Transport portal - [Transport in Singapore](/wiki/Transport_in_Singapore) - [Go-Ahead Singapore](/wiki/Go-Ahead_Singapore) - [SMRT Corporation](/wiki/SMRT_Corporation) - Media related to ComfortDelGro at Wikimedia Commons - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T10:05:05.487408",
  "title": "ComfortDelGro",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/ComfortDelGro"
}