{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:09:41.495037"
  },
  "content": "This article needs to be **updated**. The reason given is: Information on this page is obsolete. Committee for Private Education (CPE) has been integrated into Skillsfuture Singapore since 2016.. Please help update this article to reflect recent events or newly available information. *(June 2024)* **The Committee for Private Education** (**CPE**) is an agency under **SkillsFuture Singapore** (**SSG**) and was previously a [statutory board](/wiki/Statutory_boards_of_the_Singapore_Government) under the [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)) (MOE) of [Singapore](/wiki/Singapore). The [Singapore Workforce Development Agency](/wiki/Workforce_Singapore) and Council for Private Education was restructured to form SSG on 3 October 2016. Previously established under the Private Education Act, the CPE was sanctioned with the legislative power to regulate the private education sector in Singapore. Now, the CPE is appointed by the SSG Board to carry out its functions and powers relating to private education under the Private Education Act. The CPE is supported by a team of staff from SSG to regulate the sector, provide student services, [consumer education](/wiki/Consumer_education) and facilitate capability development efforts to uplift standards in the local private education industry. The regulatory initiative continues to comprise the mandatory Enhanced Registration Framework (ERF) which sets out the basic standards that a **Private Education Institution** (**PEI**) would need to adhere to in order to operate. While private schools are required to register with the CPE, this is not an endorsement or accreditation of the school. Employers, organisations and individuals are to discrete the various school qualifications for recognition and acceptance purposes. ## History In September 2009, the Private Education Act was passed in the [Parliament of Singapore](/wiki/Parliament_of_Singapore) with the aim of strengthening and levelling up the quality of the private education sector through an enhanced registration framework and enforcement. The Act also provided for the establishment of the Committee for Private Education (CPE) to oversee a new regulatory function. The CPE began its operations on 21 December 2009. ## EduTrust Certification Scheme The EduTrust Certification Scheme (**EduTrust**) is a quality assurance scheme that differentiate private schools according to their quality in education and improvements leading to a good education outcome. There are 7 criteria that the scheme covers, with 3 types of Certification Awards.\n",
  "language": "en",
  "processed_at": "2026-01-12T10:09:41.494536",
  "title": "Committee for Private Education",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/EduTrust"
}