{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:05:13.742592"
  },
  "content": "* *Commonwealth Avenue Wet Market**, also known as **Queenstown Market**, is a former [wet market](/wiki/Wet_market) on Commonwealth Avenue in [Queenstown, Singapore](/wiki/Queenstown,_Singapore). It is the only remaining market designed by the [Singapore Improvement Trust](/wiki/Singapore_Improvement_Trust). ## Description It was one of the first covered market and food centre, the roof of the former wet market is bold and parabolic-vaulted that allows rainwater to drain quickly. The façade of the former wet market, which resembles a traditional Chinese coffin, caused the market to earn the nickname of \"the Coffin Market\". A honeycomb screen wall, which can be found on the former wet market's ground floor, keeps the interior of the building ventilated. The first floor of the wet market contained stalls selling fresh produce and cooked food. The second floor of the market contained sundry and provisional shops. ## History Although it was constructed in 1956,the Commonwealth Avenue Wet Market was officially opened on 23 October 1960 in order to relocate roadside hawkers in the neighbourhood. The wet market was built at a cost of $240,000, and was opened by then assemblyman for Queenstown [Lee Siew Choh](/wiki/Lee_Siew_Choh). The wet market was visited by [Queen Elizabeth II](/wiki/Queen_Elizabeth_II) in 1972. The market was closed in 2005 due to poor business caused by the demolition of nearby [HDB](/wiki/Housing_Development_Board) blocks. The hawkers of the market were relocated to other nearby wet markets. The building was slated for conservation in 2013 by the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) under the 2013 master plan. The building was gazetted for conservation in 2014. The building has been included in the [My Queenstown Heritage Trail](/wiki/My_Queenstown_Heritage_Trail) by the [National Heritage Board](/wiki/National_Heritage_Board_(Singapore)). This article about a Singapore building or structure is a stub. You can help Wikipedia by expanding it. - v - t - e 1°17′52″N 103°48′16″E﻿ / ﻿1.2977°N 103.8044°E﻿ / 1.2977; 103.8044\n",
  "language": "en",
  "processed_at": "2026-01-12T10:05:13.742117",
  "title": "Commonwealth Avenue Wet Market",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Commonwealth_Avenue_Wet_Market"
}