{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:05:07.620182"
  },
  "content": "Staff department of the Singapore Police ForceLaw enforcement agency 1°16′42.29″N 103°50′21.57″E﻿ / ﻿1.2784139°N 103.8393250°E﻿ / 1.2784139; 103.8393250 The **Commercial Affairs Department** (**CAD**) is a staff department of the [Singapore Police Force](/wiki/Singapore_Police_Force) (SPF). The department was first established in 1984 as the **Commercial Crime Department** (**CCD**), it is the [white-collar crimes](/wiki/White-collar_crime) unit of the SPF. ## History The department was first established in 1984 as the **Commercial Crime Department** (**CCD**) with [Glenn Knight](/wiki/Glenn_Knight) as its first director. ## Modern day ### Background As the [white-collar crimes](/wiki/White-collar_crime) unit of the police force, CAD conducts a variety of inquiries ranging from corporate irregularities such as LionGold and Data Register in 2014, as well as [casino](/wiki/Casino)-related offences. It also has the right making arrests. ### Probes High-profile probes conducted by CAD include [City Harvest Church](/wiki/City_Harvest_Church) founder [Kong Hee](/wiki/Kong_Hee), former bank relationship manager Vyia Lee Yock Sim who had misappropriated more than US$400,000 from seven high net-worth clients by 2006, [China](/wiki/China) tourist guide Yang Yin with a widow's niece over a legal tussle assets believed to be worth $40 million. In September 2003, the CAD is also responsible for the capture of [Chia Teck Leng](/wiki/Chia_Teck_Leng), who was found to have misused his position as the finance manager of [Asia Pacific Breweries](/wiki/Asia_Pacific_Breweries) to swindle over $117 million from four foreign banks to pay off his debts and feed his gambling addiction. Chia is currently serving a 42-year jail term since 2004 for the crime, which was then the worst commercial crime Singapore has ever witnessed. In January 2000, the CAD acted upon a report to arrest [SIA](/wiki/Singapore_Airlines) cabin crew supervisor [Teo Cheng Kiat](/wiki/Teo_Cheng_Kiat) for embezzling an approximate sum of $35 million from his company. Teo was charged with 26 counts of criminal breach of trust and corruption, and he was sentenced to 24 years in jail after the courts convicted him of ten out of these charges. - Official site This Singaporean organisation article is a stub. You can help Wikipedia by expanding it. - v - t - e This article about government in Asia is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T10:05:07.619812",
  "title": "Commercial Affairs Department",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Commercial_Affairs_Department"
}