{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T09:59:43.274758"
  },
  "content": "Singapore-based hotel company **COMO Hotels and Resorts** is a [Singapore](/wiki/Singapore)-based company that operates hotels in Australia, Bhutan, France, Indonesia, Italy, the Maldives, Thailand, Turks and Caicos, the United Kingdom and the United States. The company was founded by [Christina Ong](/wiki/Christina_Ong) in 1991. ## History The company was founded in 1991 by Christina Ong and her husband [Ong Beng Seng](/wiki/Ong_Beng_Seng). The company commenced operations with the opening of [The Halkin](/wiki/The_Halkin) hotel in [London](/wiki/London), England in 1991. This was followed by the opening of [Parrot Cay](/wiki/Parrot_Cay) resort in Turks and Caicos in 1998, and the Cocoa Island resort in the Maldives in 2002. In 2004, the company acquired and assumed management over the Begawan Giri Estate in Ubud, Bali. Subsidiary company *COMO Shambhala* introduced a wellness app and website in June 2020. The group's Parrot Cay resort was named the location of numerous celebrity death hoaxes, including hoaxes on the supposed deaths of [Ted Nugent](/wiki/Ted_Nugent), [Ja Rule](/wiki/Ja_Rule), [Chad Kroeger](/wiki/Chad_Kroeger) and [Vince Vaughn](/wiki/Vince_Vaughn). In 2018, the company acquired Castello Del Nero, historic [Tuscan](/wiki/Tuscany) castle-turned-hotel, in a deal worth €39.6 million. The property reopened in 2019 as COMO Castello Del Nero following extensive restorations led by Milanese designer [Paola Navone](/wiki/Paola_Navone). ## Properties As of July 2021, COMO Hotels and Resorts operates 18 hotels in nine countries in Asia, Europe, North America, and Oceania. COMO Shambhala Estate in Ubud, Bali is the group's flagship. **Asia-Pacific** - COMO Uma [Paro](/wiki/Paro,_Bhutan), Bhutan - COMO Uma [Punakha](/wiki/Punakha), Bhutan - COMO Shambhala Estate, [Bali](/wiki/Bali), Indonesia - COMO Uma [Canggu](/wiki/Canggu), Bali, Indonesia - COMO Uma [Ubud](/wiki/Ubud), Bali, Indonesia - COMO Cocoa Island, Maldives - COMO Maalifushi, Maldives - COMO Metropolitan [Bangkok](/wiki/Bangkok), Thailand - COMO Point Yamu [Phuket](/wiki/Phuket_Province), Thailand - COMO Metropolitan Singapore **Australia/Oceania** - COMO The Treasury, [Perth](/wiki/Perth), Australia - COMO Laucala Island, Fiji **Europe** - COMO Castello del Nero, Italy - COMO Alpina Dolomites, Italy - COMO Le Montrachet, Burgundy, France - [COMO The Halkin](/wiki/The_Halkin) London, United Kingdom - COMO Metropolitan London, United Kingdom **North America** - [COMO Parrot Cay](/wiki/Parrot_Cay), Turks and Caicos\n",
  "language": "en",
  "processed_at": "2026-01-12T09:59:43.274330",
  "title": "COMO Hotels and Resorts",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/COMO_Hotels_and_Resorts"
}