{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:05:19.736448"
  },
  "content": "Multinational renewable energy company **Conergy** was a multinational [renewable energy](/wiki/Renewable_energy) company headquartered in [Singapore](/wiki/Singapore). It was founded in [Hamburg](/wiki/Hamburg), [Germany](/wiki/Germany), in 2000 by former CEO Hans-Martin Rüter, and specialized in the development, operation and maintenance of [photovoltaic power plants](/wiki/Photovoltaic_power_stations) and plant components. In July 2013, shortly after filing for preliminary [insolvency](/wiki/Insolvency), the Conergy brand and some of the company's international sales and service units were acquired by American private equity firm Kawa Capital Management. In August 2017, the company and its subsidiaries were acquired by American private equity funds Tennenbaum Capital Partners and Goldman Sachs BDC, before they were sold to [Green Investment Group](/wiki/Green_Investment_Group) a year later. ## Operations ### Europe In July 2011, Conergy built what [BBC News](/wiki/BBC_News) called \"one of Britain's largest solar farms\" in [Hawton](/wiki/Hawton), [Nottinghamshire](/wiki/Nottinghamshire), with a capacity of 5 MW. In June 2014, Conergy announced two projects with German utilities company [RWE](/wiki/RWE): its first solar power plant in the UK and a solar leasing partnership for businesses in Europe. ### Asia-Pacific In February 2014, Conergy opened its first office in [Japan](/wiki/Japan). In May 2014, the company completed the first large solar plant in the Philippines and in September 2014, Conergy Australia announced it would build a heart-shaped solar farm in [New Caledonia](/wiki/New_Caledonia). In Australia, the company has built solar rooftops for a factory owned by [Mars, Incorporated](/wiki/Mars,_Incorporated), as well as for a call centre run by the [Government of Queensland](/wiki/Government_of_Queensland). ### Americas In January 2014, Conergy announced plans to move into asset investment by establishing a tax equity fund with an initial target volume of US$100 million in order to expand its US and Canada project business. In October 2014, the distribution groups in the US and Canada were sold by Conergy. The sale highlighted the company's focus on project development, finance, EPC and O&M. Conergy won the tender for the 2MW SunMine project in Kimberley, British Columbia which will see an operational coal mine partially converted into a solar power plant. ## History In March 2005, Conergy [AG](/wiki/Aktiengesellschaft) was registered at the [Frankfurt Stock Exchange](/wiki/Frankfurt_Stock_Exchange), raising an estimated [€](/wiki/Euro)243 million in its [initial public offering](/wiki/Initial_public_offering) (IPO). Three months later, the company was added to the [TecDAX](/wiki/TecDAX) index, in which it remained until March 2011.[*citation needed*] In October 2007, Conergy entered into a ten-year contract with [MEMC Electronic Materials](/wiki/MEMC_Electronic_Materials) worth [US$](/wiki/United_States_dollar)7 billion for the supply of solar silicon [wafers](/wiki/Wafer_(electronics)). However, in April 2009, Conergy announced that it would file a lawsuit against the contract after a breakdown in renegotiation talks with MEMC, seeking the \"invalidity of the contract by [declaratory judgement](/wiki/Declaratory_judgement) in [New York City](/wiki/New_York_City)\". In January 2010, MEMC announced that the lawsuit was settled out-of-court, with new terms for the contract agreed and MEMC receiving an undisclosed payment. In November 2007, with the company's share price having fallen by an estimated 43 percent that year, Hans-Martin Rüter stepped down as CEO and was replaced by supervisory board chairman Dieter Ammer, who took over as interim CEO. The company also announced that it had raised €100 million in capital, in response to a \"shortfall in liquidity\". In September 2008, [LG Electronics](/wiki/LG_Electronics) announced a preliminary deal to form a joint venture with Conergy, its first in the field of solar energy. The deal was to be completed by the end of 2008 and see LG acquire a 75 percent stake in Conergy's [Frankfurt](/wiki/Frankfurt_(Oder)) solar panel plant. However, due to the [2008 financial crisis](/wiki/2008_financial_crisis)], LG ended talks with Conergy. On 5 July 2013, Conergy filed for preliminary insolvency at the District Court of Hamburg, one of a succession of German solar manufacturers that collapsed under pressure from depressed prices due to oversupply by Chinese manufacturers. Later that month, American private equity firm Kawa Capital Management announced it would buy the Conergy brand and some of the international sales and service units, without the manufacturing businesses. In December 2013, the company applied to delist from the Frankfurt Stock Exchange, with its final share price standing at just €0.04. In July 2014, the company secured a US$60 million credit guarantee arranged by [Deutsche Bank](/wiki/Deutsche_Bank) to finance an expansion of its international projects business; the company had already acquired insolvent [Wirsol](/wiki/Wirsol) and the rights to 166 [MW](/wiki/Megawatts) of UK projects from developer Lumicity earlier that year. In order to focus on its [downstream](/wiki/Downstream_(manufacturing)) business, Conergy sold its distribution arms in the U.S. and Canada to Soligent and HES PV in October 2014, respectively. In August 2017, it was announced that Kawa Solar Holdings sold Conergy Asia & ME Pte. Ltd. and its subsidiaries to American private equity funds Tennenbaum Capital Partners LLC and Goldman Sachs BDC, a business development company managed by [Goldman Sachs Asset Management](/wiki/Goldman_Sachs_Asset_Management). In August 2018, the [Green Investment Group](/wiki/Green_Investment_Group), a subsidiary of the [Macquarie Group](/wiki/Macquarie_Group), completed its acquisition of the solar development portfolio and assets of Conergy Asia. In August 2019, Conergy rebranded as blueleaf energy. The rebranding was done to reflect the company’s changing focus from a solar EPC contractor to the ownership and operations of solar energy systems. In March 2020, former CEO Alexander Lenz left Conergy for [Aquila Capital](/wiki/Aquila_Capital). - [First Solar](/wiki/First_Solar) - [SolarCity](/wiki/SolarCity) - [SunEdison](/wiki/SunEdison) - [Sunrun](/wiki/Sunrun) - [South San Joaquin Irrigation District](/wiki/South_San_Joaquin_Irrigation_District) (SSJID) - [Sunpower](/wiki/Sunpower) - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T10:05:19.736192",
  "title": "Conergy",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Conergy"
}