{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:05:22.845810"
  },
  "content": "2023 Singaporean film ***Confinement*** ([Chinese](/wiki/Chinese_language): 陪月) is a 2023 Singaporean [psychological thriller film](/wiki/Psychological_thriller_film) written and directed by [Kelvin Tong](/wiki/Kelvin_Tong). It stars [Rebecca Lim](/wiki/Rebecca_Lim) and [Cynthia Koh](/wiki/Cynthia_Koh). The plot follows a first-time mother (Lim) who starts experiencing strange occurrences in her house when she hires a [confinement](/wiki/Postpartum_confinement) nanny (Koh) to look after her and her newborn baby for a month. The film was released in theatres on 19 October 2023. ## Synopsis A pregnant painter moves into a temporary lodging and begins experiencing inexplicable incidents in the house when a confinement nanny is hired to take care of her and her newborn child. ## Cast - [Rebecca Lim](/wiki/Rebecca_Lim) as Wang Siling - Lynette Choo as young Siling - [Cynthia Koh](/wiki/Cynthia_Koh) as Ah Qing - Jordan Voon as Professor Pan - Chai Zi as Mr Yan - [Jae Liew](/wiki/Jae_Liew) as Mrs Yan - [Daren Tan](/wiki/Daren_Tan) as Ben - Keith Lee as Weijie - Wong Zi Rui as Minmin - Chin Hsin Yao as toddler Minmin - Chloyen Lim as Ah Mei - Chow Wei as Tingting - Albert Lau as Psychologist - Liew May Lee as Confinement nanny - Jimmy as Xiaohei the black dog ## Production The film's budget was reported to be S$1.2–1.5 million. Filming took place in a mansion in [Kuala Lumpur](/wiki/Kuala_Lumpur) for 24 days and concluded in early March 2023. *Confinement* is one of the four films Singapore production company Clover Films is working on with Chinese streaming platform [iQiyi](/wiki/IQiyi), with the support of the [Singapore Film Commission](/wiki/Singapore_Film_Commission) This article related to a Singaporean film is a stub. You can help Wikipedia by expanding it. - v - t - e This article about a 2020s horror film is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T10:05:22.845418",
  "title": "Confinement (2023 film)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Confinement_(2023_film)"
}