{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:05:26.091640"
  },
  "content": "Chinese-Singaporean family planning activist **Constance Goh** [MBE](/wiki/Member_of_the_Most_Excellent_Order_of_the_British_Empire) (1906–1996) was a [Chinese](/wiki/China)-[Singaporean](/wiki/Singapore) [family planning](/wiki/Family_planning) activist. In 1949, she founded the Singapore Family Planning Association, which dramatically reduced the national [birth rate](/wiki/Birth_rate). ## Biography Goh was born to a [Presbyterian](/wiki/Presbyterian) family in [Xiamen](/wiki/Xiamen), China in 1906. Her father worked in a different city and kept [concubines](/wiki/Concubines); this led Goh's mother to accept a job in [Singapore](/wiki/Singapore) in 1918. Goh moved to Singapore with her mother and returned to [Shanghai](/wiki/Shanghai) in 1924 to attend [Shanghai Baptist College](/wiki/Hujiang_University), although her limited knowledge of [classical Chinese](/wiki/Classical_Chinese) kept her from graduating. She took courses in [sociology](/wiki/Sociology), and as part of the course work she visited prisons, courts, farms and factories. She said that seeing girls as young as eight years old working in factories with poor conditions \"distressed me profoundly\". Goh returned to Singapore in 1930, where she studied at a teachers' training school and taught for a year before marrying her husband, Goh Kok Kee, a [public health](/wiki/Public_health) doctor, in 1932. After World War II, she opened a government-funded centre that provided meals to children whose parents could not afford to feed them. It was then that she began to think about [family planning](/wiki/Family_planning) measures to discourage couples from starting large families that they could not afford to support. She founded the Singapore Family Planning Association (SFPA) in 1949, and shortly afterwards Singapore's first family planning clinic was opened on her husband's medical practice. The organisation operated covertly at first, since Goh was concerned about reactions from the public and the government. They mainly offered [female contraception](/wiki/Female_contraception) in the form of [cervical caps](/wiki/Cervical_cap), since men were largely reluctant to use [condoms](/wiki/Condom) and many women sought contraceptive advice without their husbands' knowledge. The Singapore Family Planning Association received its first government grant in 1951, and in 1963 Prime Minister [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) attended an [International Planned Parenthood Federation](/wiki/International_Planned_Parenthood_Federation) conference hosted by the Singapore association and publicly declared his support for family planning. The SFPA became a government agency in 1966; by then, Singapore's [birth rate](/wiki/Birth_rate) had decreased from 45 per 1,000 when the SFPA was established to 30 per 1,000. Goh was made a [Member of the Order of the British Empire](/wiki/Member_of_the_Order_of_the_British_Empire) in 1951 for her family planning advocacy. After her death in 1996, she was posthumously inducted into the [Singapore Women's Hall of Fame](/wiki/Singapore_Women%27s_Hall_of_Fame) in 2014. ### Citations ### Bibliography\n",
  "language": "en",
  "processed_at": "2026-01-12T10:05:26.091230",
  "title": "Constance Goh",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Constance_Goh"
}