{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:05:39.543794"
  },
  "content": "Consumer health companyThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Cordlife\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(June 2022)* *(Learn how and when to remove this message)* Incorporated in May 2001, **Cordlife** Group Limited (\"Cordlife\", together with its subsidiaries, the \"Group\"), is a consumer health company and one of the leading providers of [cord blood](/wiki/Cord_blood) and [cord lining](/wiki/Cord_lining) banking services in Asia. Cordlife has been listed on the mainboard of SGX since March 2012. The Group owns the largest network of cord blood banks in Asia with full stem cell processing and storage facilities in six key markets namely Singapore, Hong Kong, India, Indonesia and the Philippines. Beyond cord blood and cord lining banking, Cordlife offers a comprehensive suite of diagnostics services, particularly for the mother and child segment, including urine-based newborn metabolic screening, non-invasive prenatal testing, paediatric vision screening and family genetic screening services. In January 2018, Cordlife acquired HealthBaby Biotech (Hong Kong) Co., Limited, the largest private cord blood bank in Hong Kong. Through its majority-owned subsidiary, Stemlife Berhad in Malaysia, Cordlife controls an indirect stake in Thailand's largest private cord blood bank, Thai Stemlife. Cordlife is also the first Singapore private cord blood bank to provide cord blood and cord lining banking services in Myanmar and Vietnam. The Group's stem cell processing and storage facilities in Singapore, Hong Kong, India, Indonesia, the Philippines and Malaysia are accredited by [AABB](/wiki/AABB) (formerly known as the American Association of Blood Banks). In 2019, the Group has successfully performed 14 cord blood and 1 cord tissue releases to support medical treatment carried out at 6 healthcare institutions in 6 countries. In November 2023, the [Ministry of Health](/wiki/Ministry_of_Health_(Singapore)) of Singapore revealed that Cordlife Group had exposed cryopreserved cord blood units at suboptimal temperatures, damaging the cord blood units belonging to at least 2,150 clients and rendering them unsuitable for stem cell transplant purposes. ## History ### 2025 - Cordlife's License has been suspended in Singapore due to the discovery of operational lapses. ### 2019 - Collaboration with Sandor on diagnostics in India. - Designation of new Group CEO. - Healthbaby is the First Private Cord Blood Bank in Hong Kong to Achieve FACT Accreditation. - Entered into an indicative, non-binding proposal with Global Cord Blood Corporation. - Geographical expansion in Bangladesh. - PT.Cordlife Persada is the first Cord Blood Bank in Indonesia to achieve AABB accreditation. ### 2018–2015 - HealthBaby Hong Kong launched Metascreen in May 2018. - Advanced [preventive healthcare](/wiki/Preventive_healthcare) in Singapore with the launch of new [genetic testing](/wiki/Genetic_testing) service Plumcare DNA Advisor in April 2018. - Acquired HealthBaby Hong Kong in January 2018. - Cordlife Philippines achieved accreditation from [AABB](/wiki/AABB) in July 2017. - Extended Asia footprint to Vietnam with appointment of marketing agent in February 2017. - Cordlife India achieved accreditation from [College of American Pathologists](/wiki/College_of_American_Pathologists) (\"CAP\") in November 2016. - Majority-owned Hong Kong Screening Centre achieved accreditation from CAP in November 2016. - Appointed a marketing agent in Myanmar to offer cord blood banking and cord lining services in October 2016. - First in Southeast Asia to be dual-accredited by world-class quality standards: AABB and Fact-Netcord in January 2016. - First Cord Blood Bank to be named as one of the Best \"Under A Billion\" Companies by [Forbes Asia](/wiki/Forbes) in 2015. - First in Singapore to win [Frost & Sullivan](/wiki/Frost_%26_Sullivan) Singapore Stem Cell Company of the Year Award in October 2015. ### 2014–2012 - Launched non-invasive newborn metabolic screening (Metascreen) in Hong Kong, Indonesia and the Philippines. - Extended its strategic alliance and co-operation with CordLabs Asia Pte. Ltd. and CCBC in relation to the provision of human postnatal cord lining storage services to certain territories in the People's Republic of China in March 2014 - Acquired a 19.92% stake in StemLife in October 2013, which was subsequently increased to approximately 31.81% in December 2013, in StemLife Berhad. - Signed a non-binding term sheet with NYSE-listed China Cord Blood Corporation to jointly explore and develop new services based on cellular technologies in November 2013 - The Group's Indian subsidiary, Cordlife Sciences (India) Pvt. Ltd., introduced a metabolic screening service known as [Metascreen](/wiki/Metascreen) in October 2013 - Signed a non-binding [Memorandum of Understanding](/wiki/Memorandum_of_understanding) with Golden Meditech Holdings Limited in respect of a proposed joint venture in the Shanghai Free Trade Pilot Zone in October 2013 - Launched provision of cord lining banking services in Singapore in May 2013 under its wholly owned subsidiary, Cordlife Technologies Pte Ltd. - India facility accredited by AABB in July 2013 - Completed the acquisition of the cord blood and cord lining banking businesses and assets in India, the Philippines, Hong Kong and Indonesia from Australia-listed Life Corporation Limited (formerly known as Cordlife Limited) in June 2013 - Cordlife moved to its fully owned, 23,000 square feet office and laboratory facility in A'Posh Bizhub, Yishun - Acquired 10% of CCBC and disposed 10% indirect equity stake in Guangzhou Tianhe Nuoya in December 2012 - Listed on Mainboard of SGX-ST on March 29, 2012 ### 2011–2008 - Released a cord blood unit for treatment of [neuroblastoma](/wiki/Neuroblastoma) in Hong Kong in January 2011 - Launched provision of cord lining banking services in Hong Kong in March 2011 - Cordlife demerged from Cordlife Limited on June 30, 2011; entered into Rights Of First Refusal (ROFR) agreement to acquire relevant businesses in Indonesia, the Philippines and India - Hong Kong facility accredited by AABB in October 2011 - Released a cord blood unit for treatment of neuroblastoma in Singapore in March 2010 - Cordlife Hong Kong and 10% indirect stake in Guangzhou Tianhe Nuoya were transferred to the Group in 2010 - On October 30, 2009, Cordlife Limited invested in a 10% indirect equity stake in Guangzhou Tianhe Nuoya, a company engaged in providing cord blood banking services in Guangdong province - Released a cord blood unit for cerebral palsy in Singapore in September 2009 - Launched Singapore facility in April 2008 at Science Park II ### 2001–2007 - Cygenics Limited was renamed Cordlife Limited (\"CBB\") in June 2007 - Cordlife Hong Kong achieved ISO:9001 in August 2007 - Entered Hong Kong and the PRC markets, Cordlife began operating through Cordlife Hong Kong in March 2005 - Singapore facility obtained its AABB accreditation in September 2005 - Holding company Cygenics Limited listed on [Australian Securities Exchange](/wiki/Australian_Securities_Exchange) in June 2004 - Merged with Cytomatrix LLC in April 2003 - Cordlife received licence to operate from Ministry of Health, Singapore in June 2002 - Company incorporated on 2 May 2001 ## Products and services ### Cord Blood Banking Cord blood banking refers to the collection at birth, processing, testing, cryopreservation and storage of stem cells from the umbilical cord blood. Cord blood, also called \"placental blood\", is blood that remains in the umbilical cord and placenta following the birth of a baby and after the umbilical cord is cut. During pregnancy, the umbilical cord functions as a lifeline between mother and child. After a baby's delivery, the cord blood present in the umbilical cord could offer hope for the child or members of the family. Cord blood is a rich source of haematopoietic stem cells (HSCs), which are primarily responsible for replenishing blood and regenerating the immune system. Cordlife's cord blood banking services are available in the following countries: Singapore, Hong Kong, India, Indonesia, Malaysia, the Philippines, Thailand, Bangladesh, Myanmar and Vietnam. ### Cord Lining Banking Cord lining banking refers to the collection, processing, testing, cryopreservation and storage of the lining from an umbilical cord. After the baby is delivered, the umbilical cord is cut and normally discarded with the placenta as medical waste until researchers became aware of its medical potential. Cord lining contains both Epithelial (EpSCs) and Mesenchymal stem cells (MSCs). EpSCs form the soft tissues that connect, support, or surround other structures and organs of the body including cornea, skin, and liver. MSCs are the building blocks of structural tissues of our body such as bone, cartilage, muscle, fibrous tissues and fat. Cordlife's cord lining banking services are available in the following countries: Singapore, Hong Kong, India, Indonesia, Malaysia, the Philippines, Bangladesh, Myanmar and Vietnam. ### Non-invasive Newborn Metabolic Screening Newborn metabolic screening screens for inborn errors of metabolism from urine samples that can impact the health of newborns. Metabolic disorders are usually not apparent at the time of birth. If left undiagnosed and untreated, the baby can suffer from neurological impairment and physical deformities. Cordlife has already launched this newborn metabolic screening test (Metascreen) in the following countries: Hong Kong (through HealthBaby and Cordlife Hong Kong), Philippines, Indonesia and Malaysia. ### Non-invasive Prenatal Testing Non-invasive prenatal testing (\"NIPT\") is a relatively new and highly accurate prenatal screening test that analyses foetal DNA in the mother's blood for potential foetal chromosomal abnormalities, including Down syndrome, Edwards syndrome and Patau syndrome. The test can be performed as early as 10th week of gestation through a simple and safe blood draw. NIPT has an accuracy rate of over 99%, much higher than conventional maternal marker-based prenatal tests. Through strategic partnerships with their third-party service providers, Cordlife is offering this services in Singapore, India, Indonesia and the Philippines. ### Newborn Genetic Screening A non-invasive screening for chromosomal abnormalities and gene variants connected to more than 120 genetic disorders in babies using cord blood. ### Paediatric Vision Screening Cordlife offers paediatric vision screening marketed under the brand Eyescreen, a marketing trademark of the Group's wholly owned subsidiary Cordlife Technologies Pte Ltd. Eyescreen is a safe and non-invasive paediatric vision screening service for children aged between six months and six years old. The test detects up to 11 eye conditions such as [strabismus](/wiki/Strabismus) (crossed eyes) and [amblyopia](/wiki/Amblyopia) (lazy eye) using a device with photoscreening technology. Available in Singapore. ## International operations ### Singapore Cordlife Singapore is the country's first private cord blood bank and the corporate headquarters of the Group. Situated at A’Posh Bizhub, Yishun, Cordlife Singapore's fully owned 23,000 square feet processing and storage facility has a storage capacity of up to 650,000 cord blood units. Since 2005, Cordlife Singapore has been accredited by AABB. To date, Cordlife Singapore has successfully released 14 cord blood units to its clients. In May 2013, Cordlife Technologies Pte Ltd (“CTPL”), a wholly owned subsidiary of the Group, launched cord lining banking service in Singapore. In December 2015, their facility was successfully accredited by FACT-Netcord, a gold standard for cord blood banking. This places them amongst only six cord blood banks in the world to achieve accreditation from both FACT-Netcord and AABB. ### Hong Kong Launched in 2005, Cordlife (Hong Kong) Limited (“Cordlife Hong Kong”) is a wholly owned subsidiary of the Group. Cordlife Hong Kong moved into a new facility at the Hong Kong Science Park in 2010. The AABB & ISO certified facility has a storage capacity for 50,000 cord blood and umbilical cord units. In January 2011, Cordlife Hong Kong became the only private cord blood bank in Hong Kong to have released a cord blood unit for autologous (with one's own stem cells) transplantation to aid the treatment of neuroblastoma. In March 2011, Cordlife Hong Kong introduced CellOptima, a patented cord lining stem cell technology to extract Mesenchymal stem cells (MSCs) and Epithelial Stem Cells (EpSCs) from umbilical cord.. In 2014, Cordlife Hong Kong launched Metascreen, a newborn metabolic screening service, in Hong Kong. In January 2018, Cordlife acquired HealthBaby Biotech (Hong Kong) Co., Limited, the largest private cord blood bank in Hong Kong. HealthBaby is accredited by AABB, CAP, FACT and certified by HOKLAS. ### Indonesia Cordlife Indonesia has been providing cord blood processing and cryopreservation service to families in Indonesia since 2003. In October 2007, Cordlife Indonesia opened the first and only DEPKES licensed private cord blood banking facility in Indonesia. Located in Jakarta, Cordlife Indonesia's ISO-certified processing and storage facility has a storage capacity of 30,000 cord blood units. Cordlife Indonesia also has branch offices in Medan, Surabaya and Bandung. PT.Cordlife Persada has become the first in Indonesia to join the ranks of world-class cord blood banks as an AABB accredited facility. With Cordlife Indonesia's new AABB accreditation status, Cordlife clients in Indonesia can now opt to have their transplant or infusion done in countries such as United States and Singapore, where only cord blood units (if imported) handled by AABB or its equivalent accredited facilities, will be permitted or preferred for use. ### India Cordlife Group owns a majority interest (99.9%) in Cordlife Sciences (India) Pvt. Ltd., (“Cordlife India”) through its wholly owned subsidiary CS Cell Technologies Pte. Ltd. Established in Kolkata, Cordlife India's cord blood facility has a storage capacity of up to 150,000 cord blood units. In July 2013, Cordlife India attained accreditation from AABB, an international, not-for-profit association representing individuals and institutions involved in the field of [transfusion medicine](/wiki/Transfusion_medicine) and cellular therapies. The facility is also certified by ISO 9001:2008. In 2011, Cordlife India successfully released a stem cell unit for the first ever mixed stem cell transplant in India. Cordlife India introduced an advanced non-invasive newborn metabolic screening test called Metascreen in India in October 2013. ### The Philippines Cordlife Group owns a 99.99% interest in Cordlife Medical Phils., Inc. (“Cordlife Philippines”), through its wholly owned subsidiary CS Cell Technologies Pte. Ltd. Registered with the Department of Health, Cordlife Philippines' ISO-certified and AABB-accredited facility cord blood processing and cryopreservation facility was officially launched in February 2010 with a storage capacity for 20,000 cord blood units. In August 2013, Cordlife Philippines officially launched its newest service, umbilical cord lining banking. ### Malaysia Established in 2001 and headquartered in Kuala Lumpur, Malaysia's largest cord blood banking operator StemLife, is the first stem cell banking and therapeutics company in Malaysia. Stemlife became a majority-owned subsidiary of Cordlife Group Limited in December 2015. StemLife operates its own 24-hour processing, testing, and cryopreservation facility in central Kuala Lumpur, Malaysia. They have successfully released 16 cord blood units for transplantation and infusion.\n",
  "language": "en",
  "processed_at": "2026-01-12T10:05:39.543436",
  "title": "Cordlife",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Cordlife"
}