{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:05:45.706987"
  },
  "content": "Singapore-based luxury watch retailer **Cortina Watch** is a Singapore-based luxury watch retailer founded in 1972. It is a subsidiary of Cortina Holdings Pte Ltd, a publicly traded company listed on the [Singapore Exchange](/wiki/Singapore_Exchange) ([SGX](/wiki/Singapore_Exchange): C41 ). The company specialises in the distribution and retail of high-end timepieces and offers a range of watch brands, including [Rolex](/wiki/Rolex), Patek Philippe, [Cartier](/wiki/Cartier_(jeweler)), Chopard, [Franck Muller](/wiki/Franck_Muller), H. Moser & Cie, Parmigiani, Tudor and more. ## History Cortina Watch was established in 1972 by Anthony Lim Keen Ban (林廷万). It started as a single-store family business, with its first outlet located in Colombo Court. The company's Chinese name, \"高登,\" was adopted from the name of the department store at Colombo Court, while the English version was derived from the popular car model of the time, the [Ford Cortina](/wiki/Ford_Cortina). In 1982, Cortina Watch expanded its presence beyond Singapore by opening its first boutique in Malaysia. Over the years, the company has expanded its operations and now operates in Singapore, Malaysia, Thailand, Indonesia, Hong Kong, Taiwan, and Australia, with both multi-brand and mono-brand boutiques. In 2002, Cortina Holdings, the parent company of Cortina Watch, went public by listing on the Singapore Exchange (SGX). In 2021, Cortina Holdings acquired privately held Sincere Fine Watches, further expanding its network to over 40 boutiques. Sincere Watch operates under the Sincere brand in Singapore and Malaysia, as well as under the Pendulum brand in Thailand. This acquisition allowed Cortina Group to diversify its offerings, with Cortina Watch focusing on international luxury brands and Sincere Watch primarily offering boutique watch options. The group also obtained exclusive distribution rights for Franck Muller in 13 countries across the Asia-Pacific region and manages the distribution of other watch brands under its subsidiary, Pacific Time Pte Ltd, including [H. Moser & Cie](/wiki/H._Moser_%26_Cie), [Moritz Grossmann](/wiki/Moritz_Grossmann), and Singer Reimagined. As of 2021, Jeremy Lim serves as CEO of Cortina Watch. In the year 2022, Cortina Watch celebrated its 50th anniversary with several events, including exhibitions in collaboration with watch brands like Patek Philippe, Blancpain, Cartier, Chopard, Corum, Franck Muller, H. Moser & Cie, and [Tag Heuer](/wiki/TAG_Heuer). These events showcased a total of 16 limited edition models created exclusively for the anniversary celebrations. - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T10:05:45.706581",
  "title": "Cortina Watch",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Cortina_Watch"
}