{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:05:47.488429"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Courts\" Asian retailer – news **·** newspapers **·** books **·** scholar **·** JSTOR *(December 2015)* *(Learn how and when to remove this message)*Singapore-based retailer **Courts**, is a [consumer electronics](/wiki/Consumer_electronics) and furniture retailer in [Singapore](/wiki/Singapore) with a network of 14 stores nationwide and offerings to more than 14,000 electrical and technological lifestyle products. Courts also operates an online store, offering online shopping, islandwide delivery and click and collect services. The chain also operates in [Malaysia](/wiki/Malaysia) with a network of 47 stores nationwide and a staff strength of 1,100. Courts has been operating in Malaysia for 37 years. ## History In 1850, Courts was founded by Albert Court in Canterbury, England. The Cohen family acquired Courts to expand the global footprint. Courts subsequently converted into Courts plc, a public company and assumed its present name. Over the years, COURTS has established a large and loyal customer base with more than 1.4 million members. In 2004, Courts Plc, then UK parent company of Courts Asia, went into administration. Courts operations in Singapore and Malaysia was subsequently acquired by Asia Retail Group, comprising [Baring Private Equity Asia](/wiki/Baring_Private_Equity_Asia) and Topaz Investment. Incorporated on 23 July 1986 as a private limited company under the name Courts Furnishers (Malaysia) Sdn. Bhd, Courts changed its name to Courts Sdn Bhd on 30 June 1997. Courts subsequently converted into a public company and assumed its present name, Courts Sdn Bhd on 1 July 1997. Courts was listed on the Main Board of the [Kuala Lumpur](/wiki/Kuala_Lumpur) Stock Exchange (now known as Bursa Malaysia Securities Berhad) on October 11, 2000, and delisted again from [bursa Malaysia](/wiki/Bursa_Malaysia) 3 September 2007 markets following the completion of ownership engagement with Malaysia Retail Group. Courts Asia is now located in [Malaysia](/wiki/Malaysia), [Singapore](/wiki/Singapore), and [Indonesia](/wiki/Indonesia). 2019, Japanese electronics retailer Nojima Corp acquired Courts Asia. Nojima is listed on the [Tokyo Stock Exchange](/wiki/Tokyo_Stock_Exchange). Like, Courts Asia, it is an electrical appliance retailer, boasting more than 8000 employees and a market capitalisation of S$1.4 billion. Courts has been undergoing various stages of a re-branding initiatives since 2006. Phase 1 of the reformatting of its urban stores adopting the ‘refreshed’ look and feel with an expanded product range in contemporary furnishing and in electronics. Courts entered Phase 2 of its re-branding with the launch of Courts Megastore in December 2007. Phase 2, also includes the refurbishment of the rest of the Courts outlets scheduled to be completed in March 2009. ## Present Presently, in Singapore, its store network includes 13 retail outlets islandwide and a Courts Megastore at the Tampines Retail Park. Courts Asia also has a retail presence in Malaysia and Indonesia and collectively operates a network of 70 stores in Southeast Asia. Outside of Asia, the Courts brand is present in over ninety-three locations in eleven Caribbean countries, including Antigua and Barbuda, Barbados, Belize, Dominica, Grenada, Guyana, Jamaica, St. Kitts and Nevis, St. Vincent and the Grenadines, St. Lucia, and Trinidad and Tobago. A store-branded Courts Caribbean is located in Jamaica, New York to serve Caribbean immigrants living in the United States wishing to send gifts to family members in their countries of birth. The American store positions itself as an ethnic and nostalgic brand. Courts branded stores outside of Asia are operated and managed by separate owners. ## Courts Megastore Pioneered at 50 Tampines North Drive 2, Singapore 528766 in Tampines, Singapore on 16 December 2006, Courts Megastore is a large warehouse-style (Big-Box concept) electrical store, and a sub-brand of Courts. Courts Megastores are usually larger in size than its retail counterparts, and usually has retail space spanning multiple floors. With the success of the Megastore concept, Courts has opened 2 more Megastores in Sri Damansara, Selangor, Malaysia, and [Kota Harapan Indah](/wiki/Kota_Harapan_Indah), Indonesia in 2013 and 2014 respectively. Courts Megastores typically includes a Market Hall, an open concept space showcasing daily use home appliances from TVs to cooking and household electronics, and F&B outlets. Home furnishing, bedding and interior products are usually located on the 2nd and 3rd stories. Courts Malaysia opened its first 'Big-Box' Megastore in Malaysia in the early second half of 2013. It is located at the ground and first floor of the 8trium building in Sri Damansara. This 108,000 sq ft store is the ultimate one-stop lifestyle destination built on a retail proposition to provide choice, value, experience, service and payment options of credit, cash or credit card to consumers. The concept of launching Courts Megastore targets the urban consumer's evolving tastes and needs as well as appealing to a broader market which may not be aware of Courts. Courts Megastore offers many first-in-Malaysia concepts such as Hot off the Docks, Countdown Corner, Dr. Digital, Sleep Clinic, made-to-order and many more. 2015 saw the re-launched of Courts online alongside the nationwide brand campaign “Senang Sehaja, Courts Ada” where local comedian Harith Iskander was appointed the first Courts brand ambassador in 20 years. Agency created the campaign was DVG Web Sdn Bhd. 2017, COURTS celebrated their 30 Years Anniversary in Malaysia. Singer Liyana Fizi was featured in their music video titled Konfetti. Harith Iskander was also featured on the store's promotions. 2020, New Courts Store opened in Kota Marudu on 27th February 2022 2022 First Flagship Nojima Store grand opening at Lalaport, Bukit Bintang, Kuala Lumpur, Malaysia Grand Opening of Courts Miri at Bintang Megamall , Miri , Sarawak , Malaysia Opening of Mitsui Outlet Park's Store (MOP) ## Awards and recognition - In 2013, COURTS won Best Securitisation Deal Awards at the Asset Triple A Regional Awards 2013 and the Asiamoney & EuroWeek Awards 2013 - In 2011, COURTS who was awarded the Case Trust Gold Certification as the only IT, Furniture and Electronics retailer - In 2010, COURTS was awarded the Premium GEM (Furniture & Furnishing / Electrical & Electronics) by Singapore Retailer Association for the retail industry mystery shopping programme - In 2007, Winner of Planet Retail's Innovation Award 2007 (Megastore) - In 2005, Awarded the International Headquarters Award by Singapore Minister for Trade and Industry - Courts Singapore - Courts Malaysia\n",
  "language": "en",
  "processed_at": "2026-01-12T10:05:47.488002",
  "title": "Courts (Asian retailer)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Courts_(Asian_retailer)"
}