{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:05:59.811772"
  },
  "content": "Apartment in Singapore, Singapore **Crescent Flats**, also known as **The Crescent**, was an apartment building on [Meyer Road](/wiki/Meyer_Road) in [Katong, Singapore](/wiki/Katong). Completed in 1912, it is believed to have been the first apartment building built in Singapore. Designed by [Regent Alfred John Bidwell](/wiki/Regent_Alfred_John_Bidwell) for [Manasseh Meyer](/wiki/Manasseh_Meyer), both the building and the neighbouring [Meyer Flats](/wiki/Meyer_Flats), built as a companion block, were demolished to make way for a condominium project. ## Description According to architectural historian Julian Davison, the building was a \"gracious study in tropical Edwardian elegance and charm.\" It stood \"in sharp contrast\" to the neighbouring Meyer Flats, which was \"devoid of extraneous embellishments, with the details of the facade pared down almost to the point of parsimony.\" The building featured open verandahs and \"generous\" fenestration, which allowed for natural ventilation via the sea breeze. Davison argued that both buildings represented a \"kind of Europeanisation of the building character that corresponded with a more Western-oriented outlook and lifestyle on the part of Singapore’s expatriate community.\" The crescent-shaped building was three storeys tall, featuring \"long bay-like windows and spiral staircases.\" A \"narrow and dim\" passageway within the building led to its \"beautiful\" covered courtyard, accompanied by an airwell. *[The New Paper](/wiki/The_New_Paper)* wrote in August 1989 that the floor tiles were not unlike those previously found in the [Raffles Hotel](/wiki/Raffles_Hotel). Potted plants were placed on the balconies. It faced the seafront and was fitted with electrical lighting and fans by the [Siemens Brothers](/wiki/Siemens_Brothers). Tennis courts for residents were erected by the shore. The design of the building was inspired by the [Royal Crescent](/wiki/Royal_Crescent), a row of terraced houses in [Bath, Somerset](/wiki/Bath,_Somerset) that form the shape of a crescent. It had 36 apartment units in total. ## History The building, designed by [Regent Alfred John Bidwell](/wiki/Regent_Alfred_John_Bidwell) of the prominent architectural firm [Swan & Maclaren](/wiki/Swan_%26_Maclaren_Architects) for businessman and community leader [Manasseh Meyer](/wiki/Manasseh_Meyer), was built from 1909 to 1912. It was serviced by a private power station at the end of Tanjong Katong Road which opened on 19 May 1912. The station, owned by Meyer, also supplied the nearby [Sea View Hotel](/wiki/Sea_View_Hotel) with electricity at its opening. Each unit featured \"one room divided into two\" with an additional room at the rear which could be used as a kitchen or servants' quarters. The building was advertised as \"modern, newly-built flats, with electric light and water laid on and let for special terms to those taking them for not less than twelve months.\" However, the water supply was \"not satisfactory\" Meyer then proposed a Municipal supply costing $3 per month per unit. In January 1918, Meyer applied to raise the rent of the ground floor units from $40 to $50 and the rent of the first and second-floor flats from $55 or $60. However, this decision was criticised by the building's tenants. The Rent Assessment Board for Singapore decided in Meyer's favour. In 1927, Meyer commissioned Bidwell for a companion block to the Crescent Flats. The neighbouring building, named Meyer Flats, was completed in the following year. After the end of the [Japanese Occupation of Singapore](/wiki/Japanese_Occupation_of_Singapore), the block was one of several civilian buildings that were occupied by the [Royal Air Force](/wiki/Royal_Air_Force). The Royal Air Force vacated the building, then owned by Kitty Meyer, in 1949, after which it was left unoccupied. It was then renovated and reopened in December 1951, after which the flats were redecorated and redesigned. Most of the units were to be let out to new tenants as many of the previous tenants either could not be traced or were already living elsewhere. In 1989, the [Hong Leong Group](/wiki/Hong_Leong_Group) bought over the land on which the Crescent Flats and Meyer Flats stood for $56 million. The group, which planned to develop high-rise apartments on the site, launched a competition for its development. It approached some architects, asking if they could redevelop the site while preserving the flats, while approaching other architects, asking them to \"work on the premise that the two blocks of flats will be demolished.\" By then, the controlled rent at the building was $300. In October 1991, it was announced that both buildings were to be vacated by the following year, after which they were to be demolished to make way for a condominium project. This decision was criticised by prominent local architect Lee Kip Lin, then-Singapore Institute of Architects president Tay Kheng Soon and then-Singapore Heritage Society president [William S. W. Lim](/wiki/William_S._W._Lim), who believed that they should have been gazetted for conservation instead. The company declined the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority)'s offers of development incentives in exchange for the gazetting of the buildings for conservation. Notable residents of the building included veterinary surgeon Percy Scott Falshaw.\n",
  "language": "en",
  "processed_at": "2026-01-12T10:05:59.811333",
  "title": "Crescent Flats",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Crescent_Flats"
}