{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:06:03.773150"
  },
  "content": "Criminal Activity in Singapore Crime rates in [Singapore](/wiki/Singapore) are some of the lowest in the world, with [petty crimes](/wiki/Misdemeanor) such as [pickpocketing](/wiki/Pickpocketing) and street [theft](/wiki/Theft) rarely occurring, and [violent crime](/wiki/Violent_crime) being extremely rare. Penalties for drug offences such as [trafficking](/wiki/Illegal_drug_trade) in Singapore are severe, and include the [death penalty](/wiki/Capital_punishment_in_Singapore). In 2022, Singapore ranked first as the safest country or area in the Global Law and Order Index. It was also ranked the third safest city in 2021 by the [Economist Intelligence Unit](/wiki/Economist_Intelligence_Unit), and 24th safest out of 136 countries in the [Global Organized Crime Index](/wiki/Global_Organized_Crime_Index) by the [Global Initiative Against Transnational Organized Crime](/wiki/Global_Initiative_Against_Transnational_Organized_Crime). ## Statistics The total number of physical crimes remains low in 2023. The total number of cases tracked down from 25,633 cases (2018) to an average of 19,750 cases (2020–2023). **Categories****2018****2019****2020****2021****2022****2023****Theft & Related Crimes**No of Cases12,19611,1287,4376,8437,8788,572Per 100,000 population216195131125140145**Housebreaking & Related Crimes**No of Cases328281210160163191Per 100,000 population654333**Violent/Serious Crimes**1No of Cases2101533054696063Per 100,000 population435911**Crimes against persons**2No of Cases5,0314,3494,6024,8784,8694,673Per 100,000 population897681898679**Commercial Crimes**3No of Cases9,41612,71017,12325,8713,26032,921Per 100,000 population16722330147458349**Miscellaneous Crimes**4No of Cases5,9456,4947,5967,9753,9633,546Per 100,000 population10511413414670460**Physical Crimes**5No of Cases25,63323,98019,49819,34320,19319,966Per 100,000 population455420343355358337**Scams/cybercrimes**No of Cases6,2349,54515,65123,93333,66950,376Per 100,000 population111167275439597851 **Sources:** Based on SPF Annual Reports, S'pore National Statistical Office. **Notes:** 1Mainly robberies and extortion cases; 2Refers to crimes where victims suffer bodily harm such as in murders, serious assault/hurt, rape, outrage of modesty and rioting; 3Comprises commercial and financial white collar crimes [2018-2021] includes scams [From 2022] scams relegated to separate category; 4Miscellaneous cases such as affray, mischief, weapon possession, causing hurt and vandalism [2018-2021] includes cybercrimes [From 2022] cybercrimes relegated to separate category; 5Does not include scams/cybercrimes. ### 2023 On a year-on-year basis, physical crime cases decreased (1.1%) from 20,193 cases (2022) to 19,966 cases (2023). The crimes of concern were shop theft, theft in dwelling, outrage of modesty and voyeurism. Shop thefts and voyeurism were among the cases that showed an uptrend. The rise in shop theft came after the widespread adoption of self-checkout counters in supermarkets. Most of the voyeurism and outrage of modesty cases were perpetrated by persons known to victims, in residential and public settings. Physical Crime Cases202120222023Outrage of Modesty1,4741,6101,528% Change—+9.2%-5.1%Voyeurism467424476% Change—-9.2%+12.3%Shop Theft2,6523,2443,939% Change—+22.3%+21.4%Theft in Dwelling1,3591,7291,695% Change—+27.2%-2.0%Rioting4660—% Change—+30%—Others13,34513,126—% Change———**Total**19,34320,19319,966% Change—+4.4%-1.1% For traffic related offences: Traffic Related Offences20212022Red Light Running Violations44,74543,687% Change——Speeding Violations139,276125,189% Change——Red Light Running resulting in Accidents136132% Change——Speeding resulting in Accidents9841,124% Change—+14.2% ## Scams Scams and cybercrime continue to be a key concern in the city state. From 2016 to 2023, the number of reported scam cases experienced an eight-fold increase from 5,300 to over 46,000 cases. As a crime of concern, the [Singapore Police Force](/wiki/Singapore_Police_Force) has separated scams from its annual crime number statistics. Scams/cybercrimes201820192020202120222023No of Cases6,2349,54515,65123,93331,72846,563% Change—+53.1%+64.0%+52.9%+32.6%+46.8%Losses ($Mil)151.4170.8265.7632.0660.7651.8% Change—+12.8%+55.6%+137.9%+4.5%-1.3% Since 2022, the majority of crime reports has been attributed to scams. On a year-on-year basis, there were 46,563 reported scam cases in 2023, up from 31,728 cases in 2022 (46.8% increase). Since 2019, more than S$2.3 billion has been lost to scams. Annual losses of more than $650 million were recorded in both 2022 and 2023. The top five reported scams by number of cases were related to jobs (9,914 cases), e-commerce (9,783 cases), fake friend call (6,859 cases), phishing (5,938 cases), and investment-related (4,030 cases). The phishing scams often involve malware installed on victims' Android devices to steal banking credentials. The top five reported scam cases in terms of monetary losses were related to investment ($204.5 million), job scams ($135.7 million), government impersonation ($92.5 million), internet love ($39.8 million), and malware enabled ($34.1 million). ### Countermeasures To combat the rising incidence of scams, the Singapore authorities had implemented various counter measures to combat scams and reinstating money back to victims. In 2019, the Anti-Scam Centre was formed under [Commercial Affairs Department](/wiki/Commercial_Affairs_Department) (CAD) in 2019 and was reorganised into the Anti-Scam Division in 2021. In March 2022, the Anti-Scam Command (ASCom) was formed to include the Anti-Scam Centre and three Anti-Scam Investigation Branches. ASCom also oversees the Scam Strike Teams managed by the seven Police Land Divisions. Other initiatives and measures include the following: 1. Amended the *Drug Trafficking and Other Serious Crimes (Confiscation of Benefits) Act* (CDSA), *Computer Misuse Act* (CMA) and introduced *Online Criminals Harm Act* (OCHA) in 2023 2. Launched and refreshed the anti-scam campaign 3. Collaborating with law enforcement agencies in Hong Kong, Macau and Malaysia to deal with transnational scams 4. Launched *ScamShield* app for iOS and Android phone users 5. Deploying bank staff to expedite the process of identifying and freezing fraudulent transactions and accounts 6. Maintaining a *SMS Sender ID Registry* under the [Infocomm Media Development Authority](/wiki/Infocomm_Media_Development_Authority) to flag potential scam messages 7. Prescribed a shared liability framework (with financial and telecommunication companies) to manage losses incurred by phishing scams ### Notable cases High-profile scam cases in Singapore include the following: SubjectPeriodPerpetuatorsLosses#VictimsDescription[Nickel](/wiki/Nickel) Investment Fraud Scheme2017-2021[Ng Yu Zhi](/wiki/Ng_Yu_Zhi), (conspirators: Keeran Marcus Phang Guan Wei, Alvin Oey Wei Zhong & Ding Kuon Chwo)$1.5 billion300Alleged ponzi scheme touted at 15% quarterly gains with fake nickel transactions through the incorporated companies \"Envy Global Trading\" and \"Envy Asset Management\". Ng faces 105 criminal charges and is currently awaiting trial.[Sunshine Empire](/wiki/Sunshine_Empire) Ponzi2006-2007[James Phang Wah](/wiki/James_Phang_Wah), (conspirators: Jackie Hoo Choon Cheat & Neo Kuon Huay)$190 million20,000MLM and ponzi scheme touted at multi-X% returns that marketed lifestyle packages through the incorporated company \"Sunshine Empire\".Maxim Trader Compensation Plan2013-2015Andrew Lim Ann Hoe, Chin Ming Kam & Goh Seow Mooi>$50 million2,000MLM and ponzi scheme touted at 6-8% returns with fund management services in leveraged foreign exchange through the incorporated (New Zealand) company \"Maxim Capital\".[OneCoin](/wiki/OneCoin) Promotion2015-2019Terence Lim Yoong Fook & Fok Fook SengUnknown2,349MLM and ponzi scheme that marketed educational packages bundled with [OneCoin](/wiki/OneCoin) mining tokens through the incorporated company \"OneConcept\".Training Grants2017Ng Cheng Kwee, Sim Soon Lee, Lee Lai Leng, David Lim Wee Hong & eight other operatives$39.9 million–Syndicate that submitted fraudulent claims for training grants to [SkillsFuture Singapore](/wiki/Ministry_of_Education_(Singapore)) through nine shell companies when no training has been conducted between April and August 2017. S$21.3 million of public funds was laundered away and remains unaccountable.Tradenation Luxury Goods2021-2022Pi Jiapeng & Pansuk Siriwipa$32 million180Alleged cheating through the falsified consignment sales of luxury watches and handbags. The couple were arrested while on the run and are currently awaiting trial. The companies \"Tradenation\" and \"Tradeluxury\" were incorporated to trade in luxury goods in April 2021 and the former was registered as a precious stones and precious metals dealer in April 2022.[OCBC](/wiki/OCBC_Bank) Bank Phishing2022Suspected overseas syndicates, (conspirators: Brayden Cheng Ming Yan, Kong Jia Quan, Jovan Soh Jun Yan, Roy Peh Yong Rong, Muhummad Khairuddin Eskandariah, Lim Kai Ze & Leong Jun Xia)$13.7 million469,790Spoofed SMS to collect online banking log-in credentials through phishing websites. Money was laundered to suspected overseas syndicates by conspirators. The bank made reparations on goodwill basis. The [MAS](/wiki/Monetary_Authority_of_Singapore) imposed additional capital requirements on the bank amounting to S$300 million.Car Deposit Scam2014Koh Chek Seng, (conspirators: Alvin Loo Mun Yu, Jason Koh Chi Kang)$6.2 million182Collected deposits for falsified sales in parallel imported cars through the incorporated company \"Volks Auto\". To keep up the charade, several luxury cars were put on display in the showroom.Investment Fraud Scam2011-2021Low Mood Chay$1.39 millionUnknownCheated several acquaintances through fake investment schemes that touted high dividends.Relationship Scam2016-2021Joselyn Kwek Sok Koon, (conspirator: Lai Sze Yin)$880,00010Cheated various people through ruses and deceits including the promise of romantic relationships.Stock Scheme2014-2020Rafiq Shamoon Omer$714,0003Cheated acquaintances with stock schemes (2014–2018) and credit card charges (2020). He is a Dutch-national S'pore resident with prior US wire fraud conviction (2004) and further alleged to have defrauded millions from US investment firms with pre-IPO share offers (2020).[Airbnb](/wiki/Airbnb) Rental Scam2022Gibson Zeng Xianfu$383,00068Collected deposits for fake rental listings with victims from at least 12 countries.Renovation Scam2020Huang Ruixiang$160,00040Misappropriated money for renovation projects after doing partial renovation work through the incorporated company \"SG Venture Furnishing\". Also duped victims through a fake investment scheme.Sg [Tinder Swindler](/wiki/Tinder_Swindler)2018-2021Jerald Low Jing Yong>$150,00010Fabricated an image of wealth and opulence to cultivate trust from friends and associates, thereby inducing them to give him money.[Carousell](/wiki/Carousell_(company)) Scam2021-2022Nicholas Ong Chang Hui$148,000128Collected deposits for fake pre-orders of Apple laptops, iPhones and PlayStation consoles as well as the fake sale of a Rolex watch.Carousell Scam2019Caine Poh Zhenglong$108,000396Collected proceeds from false sales of various items, most of which were tickets to attractions. Fraudulent Carousell accounts were created by duping jobseekers. #### Multi-level marketing schemes [Multi-level marketing](/wiki/Multi-level_marketing) (MLM) or [pyramid selling](/wiki/Pyramid_scheme) are illegal under the jurisdiction unless approved by the *Direct Selling Association of Singapore*, after having met specific exclusion criteria to protect consumers and participants. A MLM may evolve into a [ponzi scheme](/wiki/Ponzi_scheme) where the \"new income\", generated by attracting new or successive participants to provide funds, are marked as \"profits\" and used to provide \"returns\" for the older or preceding participants. ### Transnational crimes The key [transnational crimes](/wiki/Transnational_crime) affecting Singapore and the region are driven by scams and cybercrime, [illicit drug trafficking](/wiki/Illegal_drug_trade) and [terrorism](/wiki/Terrorism). Over the years, the police have carried out various operations against transnational crime syndicates. [Self-radicalised](/wiki/Radicalization) individuals involved in terrorism are dealt with under the [Internal Security Act](/wiki/Internal_Security_Act_(Singapore)). There have also been reports of Singaporeans abducted by criminal gangs to work in scam centres in Myanmar, Cambodia, Laos, Philippines and Thailand with the lure of overseas job postings. #### Operations The Singapore Police has taken action against transnational crime syndicates on its own or in combined operations with the [Royal Malaysia Police](/wiki/Royal_Malaysia_Police): 1. Thirteen transnational scam syndicates with the arrest of more than seventy persons (2022). 2. Home rental scams that incurred $1.3 million losses from 480 victims (2023). The number of home rental scams was known to have increased from 192 cases (2021) to 979 cases (2022). 3. A \"fake friend call\" syndicate that incurred over $1.3 million losses from over 490 victims (2022–2023). 4. [Money laundering](/wiki/Money_laundering) cells that incurred over $1.3 million losses from 60 victims (2023). ### Criminal & civil proceedings Singapore has indoctrinated strong [rule of law](/wiki/Rule_of_law) and their [civil and criminal justice systems](/wiki/Judicial_system_of_Singapore) have consistently performed well over the years. In the *World Justice Report 2021* by the [World Justice Project](/wiki/World_Justice_Project), it was ranked 17th out of 139 countries (scoring 8th place in civil justice, 7th place in criminal justice, 4th place in regulatory enforcement and 3rd place in absence of corruption). ## Commercial crimes As a leading financial hub that ranks third in the [Global Financial Centres Index](/wiki/Global_Financial_Centres_Index) 2022, Singapore is not immune to [financial](/wiki/Financial_crime) and [corporate crime](/wiki/Corporate_crime). Commercial crime includes [insider dealing](/wiki/Insider_dealing) and [market abuse](/wiki/Market_abuse), [bribery](/wiki/Bribery) and [corruption](/wiki/Corruption), [money laundering](/wiki/Money_laundering) and [terrorist financing](/wiki/Terrorist_financing). Since March 2015, financial crimes are investigated collaboratively by the [Commercial Affairs Department](/wiki/Commercial_Affairs_Department) (CAD) and the [Monetary Authority of Singapore](/wiki/Monetary_Authority_of_Singapore) (MAS) to detect, investigate and deal with any misconduct. In May 2023, new offences concerning rash and negligent money laundering were added to the CDSA. Notable commercial crime cases include the following: 1. The share prices of three companies - Asiansons Capital, Blumont Group and LionGold Corp were manipulated causing their share prices to collapse and two financial institutions were also cheated from August 2012 to October 2013. 2. There was an alleged conspiracy to bribe (US$55 million) officials of Brazilian company [Petrobras](/wiki/Petrobras) by six senior management staff of [Keppel O&M](/wiki/Keppel_Corporation) from 2001 to 2014 . Keppel O&M agreed to pay more than US$422 million to resolve the charges. The six staff were issued stern warnings for the bribery-related offences. 3. There were breaches of anti-money laundering and countering financing of terrorism requirements (AML/CFT) by Standard Chartered Bank (S'pore) and Standard Chartered Trust (S'pore) from December 2015 to January 2016. The companies were fined S$5.2 million and S$1.2 million respectively. 4. There were breaches of anti-money laundering regulations since the [1MDB](/wiki/1Malaysia_Development_Berhad_scandal) scandal broke. Eight banks in Singapore were subjected to fines of up to S$29.1 million. The BSI Bank and Falcon Private Bank (S'pore) were closed. 5. In findings reported by the [United Nations](/wiki/United_Nations) (UN), US$254 million worth of arms and raw materials to manufacture weapons were shipped to [Myanmar military](/wiki/Myanmar_military) through Singapore based entities from February 2021 to December 2022. The report said that the Singapore banks have been \"used extensively by arms dealers\" and that \"substantial reserves\" of Myanmar are suspected to be held in DBS, UOB and OCBC Banks. In response to the UN report, the Singapore Authorities said that it will not hesitate to take action against any individual or entity that contravenes its laws. According to the UN, about 3,000 civilians have been killed by the Myanmar military since the coup, including more than 200 children. ### Money laundering From 2020 to 2022, at least 240 people were convicted of money laundering offences (largely related to domestic scams) and a total of $1.2 billion worth of assets were seized. In August 2023, the police arrested ten foreign nationals on suspicion of committing offences such as forgery and money laundering. Over $2.8 billion worth of assets were seized and/or subjected to prohibition of disposal orders in raids across the country: 152 properties and 62 vehicles (>$1.24 billion), cash in bank accounts (>$1.45 billion), cash of various currencies (>$76 million), thousands of bottles of wine and spirits, cryptocurrencies (>$38 million), 68 gold bars, 294 luxury bags, 164 branded watches and 546 pieces of jewelry. ## Drug related offences The global shift in attitudes toward [drugs](/wiki/Drug) has also led to the [liberalisation of drug policies](/wiki/Drug_liberalization) in some countries, as evident in the decriminalisation and/or legalisation of [cannabis](/wiki/Cannabis) in [Thailand](/wiki/Thailand) and some states in the [United States](/wiki/United_States). Due to its proximity to major producing countries (e.g. [Golden Triangle](/wiki/Golden_Triangle_(Southeast_Asia))) in the [illegal drug trade](/wiki/Illegal_drug_trade) (worth about 1% of total global trade), Singapore is also vulnerable to the inflow of drugs. ### 2022 The number of drug abusers arrested increased 4% from 2,729 cases (2021) to 2,826 cases (2022). The [Central Narcotics Bureau](/wiki/Central_Narcotics_Bureau) highlighted trends of increased [cannabis](/wiki/Cannabis) seizures and a growing number of new cannabis users below the age of 30 years, with some as young as 14. Some of the users were involved in drug trafficking. [Methamphetamine](/wiki/Methamphetamine), [heroin](/wiki/Heroin), cannabis and [ecstasy](/wiki/MDMA) were among the three most commonly abused drugs in Singapore. The estimated market value of drugs seized is $16.66 million. In the *Misuse of Drug Act* (MDA), 13 new [psychoactive substances](/wiki/Psychoactive_drug) were added to the Class A controlled drugs schedule. There were a total of 11 [judiciary hangings](/wiki/Capital_punishment_in_Singapore) all for drug related offences. Arrests*20182019202020212022No of drug abusers3,4393,5263,0562,7292,826 source: *CNB annual reports, https://www.cnb.gov.sg ## Human trafficking Singapore is a transit and destination country for [human trafficking](/wiki/Human_trafficking). Individuals trafficked from other South and South-east Asian countries are often rendered vulnerable to sex or labour exploitation through various means. Regarding human smuggling, Singapore has seen a decrease in cases as authorities have become better at detecting concealed individuals at land and sea checkpoints. However, at the same time, criminal organisations have developed more sophisticated methods of human smuggling, including the procurement of genuine and fraudulent travel documents. Some of the 849,700 foreign [work permit](/wiki/Work_permit) holders who constitute almost one-quarter of Singapore's labour force are at risk of trafficking. Most victims migrate willingly for work in construction, domestic service, performing arts, manufacturing, the service industry, or commercial sex but may later face exploitation in these sectors. To migrate, many workers assume large debts to recruitment agents in their home countries and sometimes in Singapore, placing them at risk for debt bondage. Foreign workers from countries with a small presence in Singapore can experience language barriers that increase their isolation. Traffickers compel foreign workers into [sex trafficking](/wiki/Sex_trafficking_in_Singapore) or forced labour through threats of forced repatriation without pay, restrictions on movement, physical and sexual abuse, and withholding wages and travel documents, such as passports. Some recruitment agencies illegally engage in contract switching and charge workers fees more than the legal limit. Foreign workers have credible fears of losing their work visas and being deported, since employers have the ability to repatriate workers legally at any time during their contracts with minimal notice. Unscrupulous employers exploit the limited transferability of low-skilled work visas to control or manipulate workers. Reports indicate that some fishing vessel captains of long-haul boats that transit or dock at Singaporean ports use physical abuse to force men to perform labour. A small number of Singapore residents facilitate and engage in child sex tourism abroad. ## Abuse of vulnerable persons The protection of vulnerable persons from domestic violence comes under the charter of the [Ministry of Social and Family Development](/wiki/Ministry_of_Social_and_Family_Development) (MSF). ### Child abuse In 2021, there were over 2,000 cases of [child abuse](/wiki/Child_abuse) investigated by MSF's Child Protective Services in Singapore. MSF said that the increase in the number of cases from 2015 onwards was attributed to the introduction of more rigorous screening tools and training to spot such cases of abuse for professionals working with children, such as educators, social workers, counsellors, and health professionals. Investigated Cases2012201320142015201620172018201920202021Physical Abuse171148161263444373584660677788Sexual Abuse70605682107181248210261443Neglect136135164206322340331218375910**Total**3833433815518738941,1631,0881,3132,141 ### Elderly abuse The number of cases of [elderly abuse](/wiki/Elder_abuse) have also been increasing over the years. Known Cases201920202021High Risk857139**Total**232283338 ## Crimes related to foreign workers In 2014, the government explained during a parliamentary sitting that between 2009 and 2013, there were more than 18,000 persons arrested out of which 20% were foreigners. The arrest rates for foreigners were 272 per 10,000 persons while the arrest rate for residents were 385 per 10,000 persons. In a 2019 report *Public Attitudes Towards Migrant Workers in Japan, Malaysia, Singapore and Thailand* by the [International Labour Organisation](/wiki/International_Labour_Organization) (ILO) and the [United Nations Women](/wiki/UN_Women), a majority (52%) of survey respondents in Singapore felt that crime rates have increased due to immigration although there is little direct evidence to back up the claims. The findings suggested that programmes and policies be put in place to encourage interaction and community engagement of foreign workers and discourage exclusion, isolation and discrimination practices. According to the [Ministry of Manpower](/wiki/Ministry_of_Manpower_(Singapore)) (MOM), an average of 270 reports of abuse involving [migrant domestic workers](/wiki/Migrant_domestic_workers) (MDWs) were made to the police each year between 2017 and 2020. ## Traffic offences Serious [traffic offences](/wiki/Moving_violation) involving death, injury or damage to public property fall under the jurisdiction of criminal law in Singapore. In 1985, the legal alcohol limit has been revised from 0.11% to 0.08% [BAC](/wiki/Blood_Alcohol_Content). The number of accidents and arrests related to drink driving are given in the table below. In other developments, cyclists who break road rules such as non-conformance to group size, failing to stop at red lights, riding abreast of another cyclist on single lane roads and cycling on expressways are subject to higher compositions fines or imprisonment, effective from January 2022. Drink Driving20182019202020212022No of Fatal Accidents11713810No of Accidents178162146155175No of Arrests1,6851,4531,5171,9872,038 ## Failure to report a crime Under *§424 and §202 of the Criminal Procedure Code*, it is a legal duty binding upon any person who has knowledge or reason to believe or suspect that a crime has been committed, to submit a police report (or witness report where applicable). The failure to act in accordance with the aforementioned will render the person to be liable to the charge of perverting or obstructing justice. ## Crime deterrence The National Crime Prevention Council of Singapore maintains a web portal Scam Alert that offers scam prevention campaign posters and also encourages victims to come forward to share their stories. The Neighbourhood Watch Zone scheme was formed on 27 April 1997 and today includes the Citizens On Patrol (COP) initiative, which conducts regular foot patrol with [community policing](/wiki/Community_policing). Officers go around each neighbourhood to project police presence and to disseminate crime prevention pamphlet to the residents. The Ministries of Law and Home Affairs said that the [death penalty](/wiki/Capital_punishment_in_Singapore) is an effective deterrent when it comes to the most serious crimes, including the trafficking of significant quantities of drugs as well as crimes such as murder. **Number of judiciary hangings** Type20072008200920102011201220132014201520162017201820192020202120222023Drugs2230200232811200115Murder14102000120220000Firearms00100000000000000Total3650400244813400115 - [Corruption in Singapore](/wiki/Corruption_in_Singapore) - [Criminal law of Singapore](/wiki/Criminal_law_of_Singapore) - [List of major crimes in Singapore](/wiki/List_of_major_crimes_in_Singapore) - [Organised crime in Singapore](/wiki/Organised_crime_in_Singapore) - [Law of Singapore](/wiki/Law_of_Singapore) - Singapore Police Force Annual 2013 - OSAC2007 - The World Factbook\n",
  "language": "en",
  "processed_at": "2026-01-12T10:06:03.772766",
  "title": "Crime in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Crime_in_Singapore"
}