{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:06:05.570279"
  },
  "content": "1986 Singaporean TV series or program ***Crimewatch*** is a Singaporean television programme produced by the National Crime Prevention Council (NCPC) in collaboration with the [Singapore Police Force](/wiki/Singapore_Police_Force) (SPF). It is aired on [Mediacorp](/wiki/Mediacorp)'s [Channel 5](/wiki/Channel_5_(Singaporean_TV_channel)), [Channel 8](/wiki/Channel_8_(Singaporean_TV_channel)), [Suria](/wiki/Suria_(TV_channel)) and [Vasantham](/wiki/Vasantham_(TV_channel)). Presented by actual serving regular [police officers](/wiki/Police_officer), it showcases the work of the [Singapore Police Force](/wiki/Singapore_Police_Force) including the [re-enactments](/wiki/Docudrama) of major solved cases, appeals for unsolved cases, as well as general crime prevention advice in a Singaporean context. The series first premiered on the [English-language](/wiki/Singapore_English) [Channel 5](/wiki/Channel_5_(Singaporean_TV_channel)) on 30 November 1986. Subsequent dubbings of Singapore's other official languages began with [Mandarin](/wiki/Singaporean_Mandarin) (*绳之以法*) on 7 December on [Channel 8](/wiki/Channel_8_(Singaporean_TV_channel)) that year. The series later implemented Malay dubs for [Suria](/wiki/Suria_(TV_channel)) (*Jejak Jenayah*) starting on 1 April 2000, followed by Tamil's [Vasantham](/wiki/Vasantham_(TV_channel)) (*Kutra Kannkaanippu*) in 2001. ## History *Crimewatch* first premiered on 30 November 1986 with the first case located in [Ang Mo Kio](/wiki/Ang_Mo_Kio) that features an unsolved murder of a 19-year-old [national serviceman](/wiki/National_service_in_Singapore) and a public appeal from the victim's parents. Less than two weeks after the episode was broadcast, police were able to identify and arrest the suspects based on information provided by viewers responding to the appeal. The episode also contained a police appeal for information regarding the case of two missing boys [Toh Hong Huat and Keh Chin Ann](/wiki/McDonald%27s_boys_case) and another murder case. The series was met with positive reception and it aired on a quarter yearly basis. However, since 1993 with six episodes, it has since aired on a monthly basis before extending to ten episodes the following year. The series aired with only Mandarin [dubbing](/wiki/Dubbing_(filmmaking)) from the start of the series, but it has since been extended to Malay and Tamil in 2001. The 2012 season was preceded by a retrospective special titled *Crimewatch 25th Anniversary Special* airing 19 February 2012 revisiting the series' most memorable moments and interviews by the cast. The special was hosted by television actor [Tay Ping Hui](/wiki/Tay_Ping_Hui), who also performed in numerous crime television series such as *[C.L.I.F.](/wiki/C.L.I.F.)* The 2012 season was also the first season to not feature narration which was implemented since the series' start. Episodes in English and Mandarin after 1993 and episodes in Malay and Tamil after 2013 can be found on [meWATCH](/wiki/MeWATCH), the Singapore Police Force's [YouTube](/wiki/YouTube) channel (presented in two parts) and [Mediacorp](/wiki/Mediacorp)'s Youtube channel (episodes from the years 2010 to 2025 are available and a compilation of some older Crimewatch videos that shows in two compilations: one with '[drug trafficking](/wiki/Drug_trafficking)' and the other focusing on 'youth gang's) However, most episodes prior to 1993 can only be viewed exclusively on demand at National Archives of Singapore (NAS). Production for the 2020 season was postponed for two months from May to June due to the [COVID-19 pandemic](/wiki/COVID-19_pandemic); reruns of selected episodes took the place of the affected episodes. Due to this postponement, the 2020 season marked the first time the show aired episodes in the months of January and February.[*citation needed*] The 2021 season premiered on 25 April 2021, making it the first season to not premiere in March. Production for the 2021 season was also postponed for a month in July due to the [COVID-19 pandemic](/wiki/COVID-19_pandemic) and no new episodes were aired. The 2022 season premiered on 25 April 2022, the second season to not premiere in March. However, airings of the 2022 season were postponed in September due to the [2022 Singapore Grand Prix](/wiki/2022_Singapore_Grand_Prix). The 2023 season reverted back to its usual premiere date in March, after the 2022 season ends in February. ## Format Each season of *Crimewatch* consists of ten episodes (four episodes each for seasons 1987 till 1992, and six episodes for 1993) usually aired near the end of every month between March and December every year. The English version is aired on the third or fourth Sunday, and the Mandarin version is aired on the last Friday of the same month. The Malay and Tamil versions are aired on the first Monday and Thursday of the following month respectively. The older versions of Crimewatch starts each episode on a live studio with two hosts that consists of a female host and a male host that is a police officer of the [Singapore Police Force](/wiki/Singapore_Police_Force) (sometimes a male host and a female police officer). They then presented the case by introducing what the case is all about following a reenactment of the case. However, starting in 2003, it either starts with only one host who is a police officer who then introduces the case or went straight to the reenactment of the crime. Most episodes feature a [reenactment](/wiki/Historical_reenactment) of crimes that occurred in Singapore that plays for the entirety of the episode, followed by a short segment on other advisories (such as the annual [Great Singapore Sale](/wiki/Great_Singapore_Sale)). The segment ends with the presenter narrating the sentences given to the featured criminals (until Crimewatch 2022 Episode 1 for English & Chinese versions and Crimewatch 2025 for Malay & Tamil Versions) and offering advice to the public for their own protection and safety related to that particular segment. However starting from Crimewatch 2022 Episode 2 (English & Chinese versions) and Crimewatch 2025 (Malay & Tamil Versions), it no longer presents the sentences given to the featured criminals on digital platforms, but still shows them on TV on airdate. Early episodes until 2011 have a narrator narrating over the reenactment; however, starting in 2012, the episodes no longer have the narration and instead have the reenactment being acted out throughout. Recent episodes also feature information on scams, including mechanisms, statistics and advice from various government agencies and [non-governmental organisations](/wiki/Non-governmental_organization), such as those from the Singapore Police Force's [Criminal Investigation Department](/wiki/Criminal_Investigation_Department_(Singapore)) and the National Crime Prevention Council. ## Hosts As of 2025, the current presenters for the English version of the series include: - Deputy Superintendent of Police (DSP) James Goh (2018-) - DSP (2021-2024) SUPT Joshua Jesudason (2021-) - DSP Benjamin Tan (2023-) - DSP Alvin Quek (2024-) - ASP Alden Tan (2024-) - ASP Shermaine Ang (2025-) The presenters for the Mandarin version are presented by: - DSP (2016-2024) DAC Koh Chao Rong (2016-) - SUPT Ong Ruo Cheng (2019-) - DSP Tay Yuanqi (2020-) - ASP Jelene Ong (2022-) The Malay version is presented by: - ASP Roslinah Rahmat (2017–2020, 2024–present) - DSP Azlinda Aziz (2017–2019, 2024–present) - DSP Muhamad Omar Shariff (2021–present) - ASP Mohd Fadzil Mohd Hisum (2021–present) - ASP Siti Nur Nazihah (2024–present) And the Tamil version by ASP Kalaichelvan Daniel. Former studio hosts (SBC-Mediacorp) (Co-hosts with SPF representative) - Reginald Chua & Christine Lim (1986-1987) - Chen Yinglai (1986-1988) (Concurrent with Mo Yanlan, Mandarin version) - Mo Yanlan (1986-1990) (Mandarin version) - [Viswa Sadasivan](/wiki/Viswa_Sadasivan) & Lyn Wee (1988) - Boey Wai Sie (1989) - Millie Phuah (1989-1993) - Wu Yu Jia (1989-1991) (Mandarin version) - Li Hui Lan (1992-1994) (Mandarin version) - Nooraza Ismail (1993-1998) - Daphne Teo (1997-?) - [Diana Ser](/wiki/Diana_Ser) (Xu Xiuying) (1995) (Mandarin version) - Cheng Hui Hong (1996-1997) (Mandarin version) - Chow Yian Ping (1998-1999) (Mandarin version) - Medaline Tan (1999) - Chew Huoy Miin (Zhou Huimin) (1999-2000) (Solo on 1999, episode 8) (Mandarin version) - [Michelle Chong](/wiki/Michelle_Chong) (2000) - Sherry Lee (2000, episode 10 only) - Steven Chia (2001-2002) - Gan Woan Wen (2001-2002) (Mandarin version) Previous presenters from SPF include: - SUPT Jargit Singh (1986 pilot) - INSP M.F Pardesh (1986–87) - SUPT Ong Seng Chye (1986 pilot) (Mandarin version) - ASP Lee Nai Kong (1986–87) (Mandarin version) - SUPT Tan Ngoh Chew (1987 episode 3 only) - ASP Foo Kia Juah (1987 episode 4 only) (Mandarin version) - ASP Yap Sze Hon (1987-1992) (English and Mandarin version) - ASP David Tan Wei-Son (1988) - SASP Daniel Teo (1989-1992) - DSP Phillip Mah (1992–95, 2002, 2004) - ASP Loy Chye Meng (1992–93) (Mandarin version) - INSP Tan Chong Kuan (1994–96) (Mandarin version) - DSP Aubeck Kam (1995–98) - ASP Tan Chye Hee (1997–1999, 2000 (episode 9 only)) (Mandarin version) - ASP Adrian Quek (1998) - ASP Tristan Sim (1999) - ASP Lau Peet Meng (2000) - SUPT Koh Wei Keong (2000–06, 2008, 2020) (Mandarin version) - ASP Steven Liew (2000, episode 6 only) (Mandarin version) - INSP (2000-2002), ASP (2003-2006), DSP (2006) Audrey Ang (2000–06) - ASP Gail Wong (2007–09) - ASP Lily Lee (2007, episode 2 only) - ASP Lim Tung Li (2007–08) (Mandarin version) - DSP Justin Wong (2009–2010, 2013 (episode 5 only)) (Mandarin version) - ASP (2010-2012), DSP (2013-2015), SUPT (2016) Jessica Ang (2010–2016) (English and Mandarin version) - SUPT Rachel Soh (2010, 2011 (episode 1 only), 2012) (Mandarin version) - DAC Zed Teo Zi-Ming (2011–14) - DSP (2011-2015), SUPT (2016), DAC (2017–20) Julius Lim (2011–17, 2020 (episode 1 only)) - INSP Nur Baizurah Abu Baker (2012–16) (Malay version) - DSP Madeline Low (2013-2019) (Mandarin version) - ASP Sergius Wat (2014, episode 2 only) - DSP Jonathan Au-Yong (2015-19) - DSP Zeya Lwin Tun (2017–18) - DSP Jonathan Lim (2020–21) - DSP Azfer Ali Khan (2022-24) SPF - ASP [Richard Lim Beng Gee](/wiki/Richard_Lim_Beng_Gee) (1995-2002) - ASP Mark Liew, Officer Property Offender Squad of Ang Mo Kio Police Division - Inspector, DSP/DAC Roy Lim (involve for [Kallang River body parts murder](/wiki/Kallang_River_body_parts_murder) 2005, Crimewatch 2020 Episode Attempt Armed Robbery) - DSP Ang Bee Chin (involve for [Murder of Nonoi](/wiki/Murder_of_Nonoi) 2006) - Senior Inspector(now SUPT) Yip Soon Seng (Crimewatch 2009 Episode 1:Kidnapped scam) - ASP Ang Leong Peng (Crimewatch 2011: Episode [Murder of Radika Devi Thayagarajah](/wiki/Murder_of_Radika_Devi_Thayagarajah) 2008) - Insp Ng Poh Lai (Crimewatch 1993, 1994 1999, 2000, 2001, 2002) - Insp Deep Singh (Crimewatch 1994: Involve for [Murder of Lee Kok Cheong](/wiki/Murder_of_Lee_Kok_Cheong) 1993) - ASP Richard Pereira (Crimewatch 1992:Involve for [Toa Payoh ritual murders](/wiki/Toa_Payoh_ritual_murders)) - SIO Mahathir Mohammad, Investigation officer of Central Police Division (Crimewatch 2011 Episode The Theft $500,000 worth gold) - ASP Steven Wee (Crimewatch 2011 Episode Ho Kien 'Jayson' Leong murder) - SSI/DAC Pavia Roy Nicholas (Crimewatch 2003 Episode Teck Whyne Lane Murder 2001) - ASP Goh Boon Tat - SIO Kelvin Leong, Unlicensed Moneylending Strike Force, CID (Crimewatch 2012 Episode 5: Unlicensed Money) - Supt P.Avadiar, Investigation Officer for Inquiry [Pang Koi Fa vs Dr.Lim Djoe Phing](/wiki/Death_of_Chong_Yun_Jing) 1988 (Crimewatch 2010: Episode Dead Man Tells No Tale) [Health Sciences Authority](/wiki/Health_Sciences_Authority) - Dr [Chao Tzee Cheng](/wiki/Chao_Tzee_Cheng) (Crimewatch 1989-1993) - Dr George Paul (Crimewatch 2011,2017,2018) ## Actors Various actors/actresses, especially police officers, who are chronologically involved in reenactments of many cases: - Fadhlur Rahman (as various IOs/SIOs in 2015 Episode 1, 2016 Episode 1, 2021 Episode 3 & 2022 Episode 7) - [Alaric Tay](/wiki/Alaric_Tay) (as SIO Lim Min Siang, 2023 Episode 2) - Jeffry Catz (as An'nuar, 2013 Episode 8) - Awad Salim Ramli - Ernest Seow (as various IOs/SIOs between 2011 - 2016) - Alan Tan Yee Ming (as Loh Ngut Fong, 1993 Episode 4: Kidnapper - Fong | Ho Kien Leong 'Jayson', 2011 Episode 2 | Koh Ming Boon, 2012 Episode 10) - Shanice Koh - Kelvin Ho - [Denise Camillia Tan](/wiki/Denise_Camillia_Tan) (as IO Jennifer, 2022 Episode 7 & SIO Tian Tai Hua, 2024 Episode 5) - Andrew Lua (as various SIOs in 2022 Episode 4, 2023 Episode 6 & 2024 Episode 6) - Joey Tay Yu Rong (as IO Hannah, 2024 Episode 6) - [Jernelle Oh](/wiki/Jernelle_Oh) - Najib Aziz - Faizal Rahman (as SIO Mahathir, 2017 Episode 1 | SIO Yus, 2019 Episode 3 (Part 2) | IO Faizal, 2023 Episode 9 | IO Faris, 2025 Episode 1) - [Benjamin Heng](/wiki/Benjamin_Heng) (as SIO Sean Tan, 2022 Episode 3 & SIO Jason Tan, 2023 Episode 9) - [Alfred Sim](/wiki/Alfred_Sim) (as SIO Aaron, 2021 Episode 2) - Aaron Charles Mossadeg (as IO/SIOs in 2015 Episode 5, 2020 Episode 10 & 2023 Episode 5) - [Richie Koh](/wiki/Richie_Koh) (as Darryl Cheong, 2020 Episode 10 & Eric Lim Yong Sheng, 2022 Episode 4) - Regina Lim (as Various IOs/SIOs between 2016 - 2019 & 2022–present) - June Lim HZ - Darren Lim - [Chua En Lai](/wiki/Chua_En_Lai) - Faizal Aziz (as Royal Malaysian Officer in 2015 Episode 10 & 2017 Episode 5 | Muhammed Hairil Bin Rahamat (Boby Tricep), 2021 Episode 10 | Muhammad Firdaus Bin Abdullah (Nick), 2024 Episode 5) - Hanrey Low - Wayne Lee - Ho Cheng Yi - Kelvin Ho - Vincent Tee - Iswan Ismail (as various IOs/SIOs in 2016 Episode 1, 2020 Episode 6, 2021 Episode 6 & 2022 Episode 9) - Victoria Hay (as SIO Pong Ai Ming, 2014 Episode 5) - [Wang Yu Qing](/wiki/Wang_Yuqing) (as Lee Kah Yeow, 2020 Episode 8) - Stella Tan (as various IOs/SIOs between 2020 - 2024) - [Nicholas Lee](/wiki/Nicholas_Lee) (as Leslie Khoo, 2020 Episode 5) - Vanessa Vanderstraaten (as SIO Ann Goh, 2022 Episode 8 & SIO Ng Yu Ling, 2024 Episode 8) - Aden Tan (as Cheng Wei Lun, 2014 Episode 8 (Story 1) | Chua Yi An, 2020 Episode 4 | Ryan Wong, 2021 Episode 7 | Charlie Heng, 2023 Episode 1) - Alvin Yeo - Kelly Lim - Collin Chan - Ahmad Sani (as Various IOs between 2019 - 2024) - Regene Lim (as various IOs in 2020 Episode 6, 2021 Episode 4 & 2023 Episode 1) - Michael Kwah (as various IOs/SIOs in 2015, 2017 - 2019 & 2022 - present) - Keith Lee (as various SIOs in 2019 Episode 10 & 2022 Episode 5) - Chia De Zhong - Juliet Isabella - Daisy Yeo Lay See (2010 Episode 5 | 2012 Episode 2 | 2017 Episode 2 | 2019 Episode 4) - Derek Seong (as Koh Meng Meng, 2010 Episode 5 | Alexander Soh, 2013 Episode 4 | Ong, 2015 Episode 3 | Desmond Yeo Boon Chiang, 2017 Episode 2 | Duong Tuan Dat, 2019 Episode 5) - [Daren Tan](/wiki/Daren_Tan) (as SIO Gap Law, 2022 Episode 6 & SIO Lionel Wong, 2024 Episode 1) - Loh Ling Ying (as IO Jia Ler, 2024 Episode 1) - Brendon Kuah (as Mr Pang, 2013 Episode 10 | Liew Wei Bin, 2016 Episode 7 (Part 2) | Jack, 2019 Episode 6 | Wong Ket Kok, 2024 Episode 3) - KP Sadhnu (as Harvinder Singh, 2016 Episode 4 & Victim of Police Impersonators, 2017 Episode 1) - [Jae Liew](/wiki/Jae_Liew) (as IO Jazreel, 2023 Episode 4) - [Charlie Goh](/wiki/Charlie_Goh) (as Ah Chye, 2013 Episode 3) - Belle Chua (as Joanne Yap Siew Ting, 2013 Episode 4 | Rong Xuehua, 2020 Episode 7 | Li Xiaohua, 2022 Episode 1) - [Shabir Sulthan](/wiki/Shabir_Sulthan) (as various SIOs in 2013 Episode 2, 2015 Episode 1 & 2017 Episode 5) - Marc Valentine (as Roderic Chen, 2019 Episode 8) - Fadhli Abdullah (as SIO Raimi, 2018 Episode 9 | SIO Uzheiat, 2019 Episode 9) - [Das DD](/wiki/Das_DD) (as Sheikh Md Razan, 2020 Episode 1 | Veeramani, 2021 Episode 6 | Maruf Al Mamum, 2022 Episode 5) - Hayden Roy (as Raj Krishnan, 2014 Episode 9 | Rubenkumar, 2016 Episode 1: | Miah Shorif, 2022 Episode 5 | Karrtik S/O Stalniraj, 2023 Episode 4) - Ikhwan Risydah (as various IOs/SIOs in 2015 Episode 7, 2016 Episode 7, 2017 Episode 7 & 2019 Episode 2) - Fish Chaar - Derrick Ee - Maguire Z Jian - Larry Low - Ahmad Sani (as various IOs between 2019 - 2024) - Bright Ong (as Tay Soo Seng (Ah Seng), 2014 Episode 9) - [Adam Chen](/wiki/Adam_Chen) (as various SIOs in 2020 Episode 9, 2022 Episode 9, 2023 Episode 8 & 2024 Episode 7) - Fidhro Adhross (as various SIOs in 2015 Episode 6, 2020 Episode 2, 2021 Episode 1 & 2023 Episode 8) - Aric Hidir Amin (as various SIOs in 2013 Episode 8, 2015 Episode 3 & 2021 Episode 10) - Ky Tan Xing Hua (as various IOs/SIOs in 2018 Episode 10, 2019 Episode 8, 2022 Episode 6 & 2023 Episode 3) - Gary Lee (as various SIOs between 2011 - 2013 & 2015 - 2019) - Jaymeson Oliviero (as SIO Vincent Chee, 2019 Episode 7 & SIO William Loh, 2020 Episode 8) - Adlina Adil (as SIO Baizurah, 2023 Episodes 7 & 10) - Fatin Amira (as Siti Binti Ibrahim, 2021 Episode 3 & Suhaili Binte Suparjo, 2023 Episode 10) - Zhu Zeliang (as SIO Alan Tok, 2024 Episode 4, as Gang member 2014 episode 9) - JJ Neo (as IO Michelle, 2021 Episode 10 & IO Kelly, 2024 Episode 4) - Jo Tan (as Jocelyn Kwek, 2024 Episode 4) - Silver Ang (as SIO Jane Chen, 2024 Episode 3) - Fandy Ahmed (as IO Irman, 2024 Episode 3) - Laura Kee (as various IOs/SIOs in 2015 Episode 6, 2018 Episode 1, 2022 Episode 10 & 2024 Episode 2) - James Kumar (as SIO Mano Ranjan, 2022 Episode 10) - Lynn Ho (as various IOs/SIOs in 2016 Episode 9, 2019 Episode 2 & 2023 Episode 10) - Darryl Yong (as various SIOs in 2020 Episode 5, 2021 Episode 5 & 2024 Episode 10) - Adele Wong (as SIO Sharon Chia, 2023 Episode 7 & SIO Daziree Liang, 2025 Episode 1) ## In popular culture Crimewatch has been seen by most Singaporeans as one of the best shows on local television, mainly due to its entertainment value and often unintentional \"[meme](/wiki/Internet_meme)-worthy scenes\". Subsequently, many clips from the show had also gone viral outside of Singapore, leading to international interest in the show. In 2021, a clip from Episode 10 of Season 12, that first aired in 1998, went viral on [TikTok](/wiki/TikTok) as well as on other parts of the internet, becoming an [internet meme](/wiki/Internet_meme). It consisted of quick fast cuts of a middle-aged woman looking distressed in various camera angles after being robbed of her necklace. Subsequently, the clip had a serious voice-over saying: \"The woman was too stunned to speak.\" The voice-over itself also became used in a variety of different contexts as an internet meme. In 2022, a clip from Episode 3 of Season 27, that first aired in 2013, went viral on [Twitter](/wiki/Twitter). It consisted of two *[Ah Lians](/wiki/Ah_Beng)* having an argument at a playground after one of them became offended by a remark made by the other. One of the women, played by [Jernelle Oh](/wiki/Jernelle_Oh), had stated, \"Why not? You're nothing but a prostitute.\" and the other, played by Shanice Koh, replied \"How dare you call me a prostitute?!\" and added \"But you are!'' the other one (Koh) replies ''You better say sorry,\" but Oh retaliates, \"Why should I? Go to hell.\" They both subsequently agreed to \"settle tomorrow, 4pm at [Pioneer Mall](/wiki/Pioneer_Mall)\", leading to a fight between their gangs: the 'Black Spiders' and the 'Scorpions'. It also went viral on [TikTok](/wiki/TikTok) with both Singaporeans and international artists creating their own spin-offs. The two local artists from the original clip, Shanice Koh and Jernelle Oh, would also re-enact the scene and uploaded a TikTok duet in response to the clip resurfacing. - [List of Crimewatch (Singaporean TV series) episodes](/wiki/List_of_Crimewatch_(Singaporean_TV_series)_episodes) - Crimewatch\n",
  "language": "en",
  "processed_at": "2026-01-12T10:06:05.569929",
  "title": "Crimewatch (Singaporean TV series)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Crimewatch_(Singaporean_TV_series)"
}