{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:06:07.569527"
  },
  "content": "Criminal Investigation Department in SingaporeLaw enforcement agency The **Criminal Investigation Department** (**CID**) is one of the many departments under the [Singapore Police Force](/wiki/Singapore_Police_Force) for premier investigation and staff authority for criminal investigation matters within the Singapore Police Force. It is led by the **Director of CID** and assisted by 4 Deputy Directors. CID has a staff of over 500 officers: Senior Investigation Officers, Investigation Officers, Police Officers and Civilian Officers. ## Overview The CID conducts inquiries into a variety of criminal offences in [Singapore](/wiki/Singapore), and is empowered to make arrests. Recent high-profile investigations include the [Murder of Muhammad Noor](/wiki/Murder_of_Muhammad_Noor) in 2014. The present director is Deputy Commissioner of Police (Investigation & Intelligence) Zhang Weihan. ## Structure CID is led by a Director, currently DCP Zhang Weihan, and 4 Deputy Directors. There are a total of 10 divisions in CID, with each division led by an assistant director, namely: 1. Operations, Management & Planning Division - Operations Management Branch - Prosecution Branch - Investigation Policy Branch - Investigations Operations Coordination Centre 2. Research, Planning & Organisational Development Division - Investigation Review & Implementation Branch 3. Specialised Crime Division - Specialised Crime Branch - Specialised Crime Policy Branch - Casino Crime Investigation Branch - Intellectual Property Rights Branch - Secret Societies Branch - Unlicensed Moneylending Strikeforce - Organised Crime Branch - Financial Investigation Branch 4. Major Crime Division - Special Investigation Section - Serious Sexual Crime Branch - Operations and Policy Branch 5. Cybercrime Division - Cybercrime Investigation Branch - Cybercrime Policy and Operations Branch - Cyber Crime Strategy Office 6. Investigation Development & Systems Division - Criminal Records Office - Liaison & Training Branch - Operations Planning Branch 7. Investigation Support & Services Division - Specialised Interview Branch - Corporate Services Branch - Manpower Branch - Service Quality Branch 8. CID Intelligence Division - Field Intelligence Branch - Intelligence Analysis Branch - Criminal Law & Intelligence Processing Branch 9. Forensics Division - Forensics Branch 10. Digital Forensics Division - Digital Forensics Branch ## In popular culture In 2006, a [police procedural](/wiki/Police_procedural) series, [*C.I.D.*](/wiki/C.I.D._(Singaporean_TV_series)) was produced by [Mediacorp](/wiki/Mediacorp), starring [Tay Ping Hui](/wiki/Tay_Ping_Hui), [Qi Yuwu](/wiki/Qi_Yuwu), [Apple Hong](/wiki/Apple_Hong), [Jeanette Aw](/wiki/Jeanette_Aw), [Ong Ai Leng](/wiki/Ong_Ai_Leng), [Brandon Wong](/wiki/Brandon_Wong_(actor)) and [Zhang Yaodong](/wiki/Zhang_Yaodong). This was followed with a collaboration between the CID and Mediacorp in 2010, 2011 and 2012, *[Unriddle](/wiki/Unriddle)* *[C.L.I.F.](/wiki/C.L.I.F.)* and *[Unriddle 2](/wiki/Unriddle_2)*, another police procedural series, in which the *[C.L.I.F.](/wiki/C.L.I.F.)* series lead to four sequels, *[C.L.I.F. 2](/wiki/C.L.I.F._2),* *[C.L.I.F. 3](/wiki/C.L.I.F._3)*, *[C.L.I.F. 4](/wiki/C.L.I.F._4)* and *[C.L.I.F. 5](/wiki/C.L.I.F._5)*. - [Crime in Singapore](/wiki/Crime_in_Singapore)\n",
  "language": "en",
  "processed_at": "2026-01-12T10:06:07.569136",
  "title": "Criminal Investigation Department (Singapore)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Criminal_Investigation_Department_(Singapore)"
}