{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:06:10.581301"
  },
  "content": "Irish footballer **Cristiano Michael Fitzgerald** (born 10 November 2003) is a [footballer](/wiki/Association_football) who plays as a [winger](/wiki/Winger_(association_football)) at the [University of Maryland, College Park](/wiki/University_of_Maryland,_College_Park) in the United States. Born in Singapore, he represents the Republic of Ireland at youth international level. ## Early life Born in [Singapore](/wiki/Singapore) to an Irish father from [Limerick](/wiki/Limerick) and a French mother, Fitzgerald was named after then-[Manchester United](/wiki/Manchester_United_F.C.) player [Cristiano Ronaldo](/wiki/Cristiano_Ronaldo). His father had been watching the [2003–04 Premier League](/wiki/2003%E2%80%9304_Premier_League) season opener against [Bolton Wanderers](/wiki/Bolton_Wanderers_F.C.), in which Ronaldo made his debut, and decided upon the name for his son. He moved to [London](/wiki/London) shortly after his first birthday, before spending seven years in [San Diego](/wiki/San_Diego), [California](/wiki/California). ## Club career ### Early career in Portugal He returned to Singapore, joining a local football team who would routinely tour Europe, playing in Spain, Sweden and Portugal. His family moved again in 2017, this time to [Porto](/wiki/Porto), Portugal, and shortly after, he joined the academy of [Boavista](/wiki/Boavista_F.C.). He also spent some time back in the United States due to his father's work, playing for the [De Anza Force](/wiki/De_Anza_Force). He returned to Boavista in 2020, and a year later, he was clocked as one of the fastest players in world football. He went on trial with Scottish club [Dundee United](/wiki/Dundee_United_F.C.) in July 2022, but this amounted to nothing. In September 2022, he was promoted to Boavista's first team, and made his unofficial debut for the club in a [friendly](/wiki/Exhibition_game) match against French side [Bordeaux](/wiki/FC_Girondins_de_Bordeaux) on 16 December 2022. On 30 January 2024, Fitzgerald left Boavista, without ever making his official debut, and joined fellow [Primeira Liga](/wiki/Primeira_Liga) club [Estrela da Amadora](/wiki/C.F._Estrela_da_Amadora). ### Collegiate soccer After half a year with Estrela da Amadora, Fitzgerald moved to the United States, enrolling at the [University of Maryland](/wiki/University_of_Maryland,_College_Park). ## International career Fitzgerald is eligible to represent the Republic of Ireland and France through his parents, Singapore through birth, and Portugal, having lived there since 2017. He has expressed his desire to represent the Republic of Ireland. In 2021, he made his first appearance for the Republic of Ireland at under-19 level. ## Personal life Fitzgerald's father, Jimmy, was a youth hurling player for the [Limerick county hurling team](/wiki/Limerick_county_hurling_team) in Ireland, and his brothers, Dean and Julian, play for [Leça](/wiki/Le%C3%A7a_F.C.) and Boavista's youth teams, respectively. - Cristiano Fitzgerald at the [University of Maryland](/wiki/University_of_Maryland,_College_Park)\n",
  "language": "en",
  "processed_at": "2026-01-12T10:06:10.580914",
  "title": "Cristiano Fitzgerald",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Cristiano_Fitzgerald"
}