{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:06:11.865036"
  },
  "content": "Anthropologist specialising in influencers and internet culture **Crystal Abidin** is a digital anthropologist and ethnographer of vernacular [internet cultures](/wiki/Internet_culture). She is a Professor at the School of Media, Creative Arts and Social Inquiry at [Curtin University](/wiki/Curtin_University) in Perth, Western Australia, where she directs the Influencer Ethnography Research Lab. ## Career Abidin grew up in Singapore, and began studying its influencer industry in 2010. Abidin has been interviewed by media about social media phenomena several hundred times and has been on several media lists of influential young scholars. *[The Australian](/wiki/The_Australian)* included her in a 2021 list of 40 \"rising stars\" likely to make a mark on research in the next decade. She was named one of the \"30 Top Thinkers Under 30\" by *[Pacific Standard](/wiki/Pacific_Standard)* om 2016 and *[Forbes](/wiki/Forbes)* named her one of \"30 under 30 Asia\" in 2018. *Cosmopolitan* cited her as one of 16 insiders making predictions for 2022. Abidin is the editor-in-chief of the scholarly journal *Media International Australia*. Her articles and books have been cited over 10,000 times. ## Key concepts ### Calibrated amateurism Crystal Abidin defined *calibrated amateurism* in a scholarly article about social media influencers: \"Calibrated amateurism is a practice and aesthetic in which actors in an attention economy labor specifically over crafting contrived authenticity that portrays the raw aesthetic of an amateur, whether or not they really are amateurs by status or practice, by relying on the performance ecology of appropriate platforms, affordances, tools, cultural vernacular, and social capital.\" The term has been taken up and developed by a number of other scholars, to understand the online performance of politicians, fitness influencers and others. Jessica Maddox builds upon it for the idea of \"calibrated expertise\". ### Subversive frivolity Abidin argues that influencers often use a deliberate strategy she calls *subversive frivolity*. She first defined the concept in a 2016 article as \"the under-visibilized and under-estimated generative power of an object or practice arising from its (populist) discursive framing as marginal, inconsequential, and unproductive\". The term has been taken up by scholars of social media, and there are hundreds of papers using the term, for instance analysing Snapchat posts or the political impact of humourous posts. ## Books - *Internet Celebrity: Understanding Fame Online* (2018) - *Microcelebrity Around the Globe: Approaches to Cultures of Internet Fame* (co-editor Brown, 2018) - *Instagram: Visual Social Media Cultures* (co-authors Leaver & Highfield, 2020) - *Mediated Interfaces: The Body on Social Media* (co-editors Warfield & Cambre, 2020) - *tumblr: Curation, Creativity and Community* (co-authors Tiidenberg & Hendry, 2022) - *Influencer Marketing: Interdisciplinary and Socio-Cultural Perspectives* (co-editors Gurrieri & Drenten, 2025) ## Awards and recognition 2022 WA Young Tall Poppy Awards\n",
  "language": "en",
  "processed_at": "2026-01-12T10:06:11.864636",
  "title": "Crystal Abidin",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Crystal_Abidin"
}