{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:06:15.664538"
  },
  "content": "* *This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Culture of Singapore\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(March 2022)* *(Learn how and when to remove this message)*This article **may need to be rewritten** to comply with Wikipedia's quality standards. Relevant discussion may be found on the talk page. You can help. The talk page may contain suggestions. *(January 2025)* *(Learn how and when to remove this message)* The **culture of Singapore** has changed greatly over the millennia. Its contemporary modern culture consists of a combination of [Asian](/wiki/Culture_of_Asia) ([Malay](/wiki/Malays_(ethnic_group)#Culture) / [Tamil](/wiki/Tamil_culture) / [Chinese](/wiki/Chinese_culture))[*citation needed*] and European cultures. Singapore has been dubbed as a country where \"East meets West\", \"Gateway to Asia\" and a \"Garden city\". ## History Some of the earliest people in what is now Singapore were [Austronesians](/wiki/Austronesians) that arrived between 1500 and 1000 BCE. The island then fell under various local kingdoms, which traded with other Asian countries. Singapore came under British control in the early 19th century, and following substantial immigration and economic changes became independent in the mid-20th century. It has a populace of over 5.47 million people which is made up of Chinese, Malays, Indians, and Eurasians (plus other mixed groups) and Asians of different origins such as the [Peranakan](/wiki/Peranakan) people, descendants of Chinese immigrants with Malay or Indonesian heritage. ## National character ### Meritocracy The Ministry of Education claims that \"The system of [meritocracy](/wiki/Meritocracy) in Singapore ensures that the best and brightest, regardless of race, religion and socio-economic background, are encouraged to develop to their fullest potential. Everyone has access to education, which equips them with skills and knowledge to earn a better living.\" [Primary education](/wiki/Education_in_Singapore) is compulsory for all children of age 7 to 12. Parents have to apply for exemptions from the Ministry of Education in Singapore to excuse their children with valid reasons. ### Racial harmony Singapore is a secular immigrant country. The main religions in Singapore are [Buddhism](/wiki/Buddhism), [Christianity](/wiki/Christianity), [Islam](/wiki/Islam), [Taoism](/wiki/Taoism), and [Hinduism](/wiki/Hinduism). Respect for different religions and personal beliefs is heavily emphasised by the government. Nevertheless, critics assert that the ethnic Chinese majority, which forms nearly 75% of the population, enjoys [Chinese privilege](/wiki/Chinese_privilege) over other races. To demonstrate the importance of imparting racial harmony knowledge to the youths, schools in Singapore celebrate [Racial Harmony Day](/wiki/Racial_Harmony_Day) on 21 July annually. Students come to school dressed in different ethnic costumes, and some classes prepare performances regarding racial harmony. ### Democracy, peace, progress, justice and equality The concepts of democracy, peace, progress, justice and equality are enshrined as stars in the [Singapore national flag](/wiki/Flag_of_Singapore). [Freedom in the World](/wiki/Freedom_in_the_World) ranked Singapore 4 out of 7 for political freedom, and 4 out of 7 for civil liberties (where 1 is the most free), with an overall ranking of \"partly free\". [Reporters without Borders](/wiki/Reporters_without_Borders) ranked Singapore 153rd out of 180 countries in their [Press Freedom Index](/wiki/Press_Freedom_Index) for 2015. ## Ethnic areas Singapore has several distinct ethnic neighbourhoods, including [Katong](/wiki/Katong), [Kampong Glam](/wiki/Kampong_Glam), [Geylang Serai](/wiki/Geylang_East), [Chinatown](/wiki/Chinatown,_Singapore) and [Little India](/wiki/Little_India,_Singapore). Both Geylang Serai and Kampong Glam are the focal points of the [Malays in Singapore](/wiki/Malay_Singaporeans). A [Malay Heritage Centre](/wiki/Malay_Heritage_Centre) in Kampung Glam showcases the history and cultural exposure of the Malays, who are indigenous to the land. Both areas feature an annual month long *Hari Raya Bazaar*, during the fasting month of [Ramadan](/wiki/Ramadan). This is patronised by Malays and also other races. [Katong](/wiki/Katong) is home of the Peranakans, and the neighbourhood's identity is shaped by its unique architecture – colourful two-storey shophouses, colonial bungalows, intricate motifs and ceramic tiles. It was designated as a national heritage conservation area by the Singapore Government in 1993. Little India is known and patronised by all races within the population for its [thalis](/wiki/Thali) – [South Indian](/wiki/South_Indian) \"[buffets](/wiki/Buffet)\" that are vegetarian and served on the traditional banana [leaves](/wiki/Leaf). These neighbourhoods are accessible by public transport, especially by the [Mass Rapid Transit](/wiki/Mass_Rapid_Transit_(Singapore)) (MRT). Singapore's [Chinatown](/wiki/Chinatown,_Singapore) is an ethnic neighbourhood featuring distinctly [Chinese](/wiki/Chinese_culture) cultural elements and a historically concentrated [ethnic Chinese population](/wiki/Overseas_Chinese). Chinatown is located within the larger district of [Outram](/wiki/Outram,_Singapore). Ethnic enclaves from the British colonial era, akin to those seen in major cities in many Western countries, are largely non-existent. The remnant \"enclaves\" such as Little India, Chinatown and Kampong Glam are now mainly business hubs for their respective ethnic groups and preserved for historic and cultural reasons. The [Housing Development Board](/wiki/Housing_Development_Board) enforces the Ethnic Integration Policy (EIP) to \"preserve Singapore's multi-cultural identity and promote racial integration and harmony\" and sets proportions for each ethnic group in each housing estate. ## Art From its precolonial history to present, the history of Singaporean art may include artistic traditions of the [Malay Archipelago](/wiki/Malay_Archipelago), the diverse visual practices of itinerant artists and migrants from China, the [Indian subcontinent](/wiki/Indian_subcontinent), and Europe arriving in the colonial period, such as sculpture, [Portraiture](/wiki/Portrait), [landscapes](/wiki/Landscape_painting), and [natural history](/wiki/Natural_history) drawings, as well as [Chinese ink painting](/wiki/Ink_wash_painting), [Islamic calligraphy](/wiki/Islamic_calligraphy), [Nanyang Style](/wiki/Nanyang_Style) paintings, [social realist art](/wiki/Social_realism), [abstract art](/wiki/Abstract_art), photography, and [printmaking](/wiki/Printmaking). It also includes the [contemporary art](/wiki/Contemporary_art) practices of today, such as performance art, [conceptual art](/wiki/Conceptual_art), [installation art](/wiki/Installation_art), [video art](/wiki/Video_art), [sound art](/wiki/Sound_art), and [new media art](/wiki/New_media_art). Due to Singapore and Malaysia's long shared history as [British Malaya](/wiki/British_Malaya), there are many overlaps in the art histories of both countries. The emergence of [modern art](/wiki/Modern_art) in Singapore is often tied to the rise of art associations, art schools, and exhibitions in the 20th century, though this has since been expanded to include earlier forms of visual representation, such as from Singapore's early colonial period. Some of the most well-known works are of the migrant Chinese artists who painted in the [Nanyang Style](/wiki/Nanyang_Style) from the 1950s to 60s, such as [Georgette Chen](/wiki/Georgette_Chen). The Nanyang artists characteristically depicted Southeast Asian subject matter such as tropical fruit, [*kampung*](/wiki/Kampung_(village)) scenes, and *[batik](/wiki/Batik)* fabric while drawing upon a synthesis of Western [watercolor](/wiki/Watercolor_painting) and [oil painting](/wiki/Oil_painting) techniques with [Chinese ink](/wiki/Ink_wash_painting) traditions. The name of the movement draws from \"[Nanyang](/wiki/Nanyang_(region))\" ([Chinese](/wiki/Chinese_language): 南洋; [pinyin](/wiki/Pinyin): *nán yáng*; lit. 'Southern Ocean'), a [sinocentric](/wiki/Sinocentrism) Chinese term used to refer to Southeast Asia from the geographical perspective of China. [Contemporary art](/wiki/Contemporary_art) in Singapore tends to examine themes of \"hyper-modernity and the built environment; alienation and changing social mores; post-colonial identities and multiculturalism.\" Across these tendencies, \"the exploration of performance and the performative body\" is a common running thread. Singapore carries a notable history of performance art, with the state having enacted a no-funding rule for the art form for a decade from 1994 to 2003, following a controversial performance artwork at the [5th Passage](/wiki/5th_Passage) art space in Singapore. Prominent Singaporean contemporary artists include, for example, [Tang Da Wu](/wiki/Tang_Da_Wu), [Amanda Heng](/wiki/Amanda_Heng), [Lee Wen](/wiki/Lee_Wen), [Ho Tzu Nyen](/wiki/Ho_Tzu_Nyen), and [Shubigi Rao](/wiki/Shubigi_Rao). ## Cultural policy Singapore maintains tight restrictions on arts and cultural performances. Most artistic works have to be vetted by the government in advance, and topics that breach so-called out of bounds markers ([OB markers](/wiki/OB_marker)) are not permitted. While the OB markers are not publicly defined, they are generally assumed to include sensitive topics such as race, religion, and allegations of corruption or nepotism in government. Nudity and other forms of loosely defined \"obscenity\" are also banned. Singaporean film director [Royston Tan](/wiki/Royston_Tan) has produced movies which challenge these policies, including a movie called *Cut* in reference to censorship of the arts. The country's first pre-tertiary arts school, [School of the Arts](/wiki/School_of_the_Arts,_Singapore), is now completed and stands along the country's prominent Orchard Road. Commenced in 2008, the school aims to provide an environment for nurturing young artists aged between 13 and 18 years. There has been much [public rhetoric](/wiki/Public_rhetoric) about liberalisation and its association with the development of a creative economy in Singapore. The response from artists, academics, public intellectuals, and civil society activists has ranged from strongly optimistic to deeply pessimistic, as reflected in the chapters written for edited book *Renaissance Singapore: Economy, Culture, and Politics*. The difference between what is \"culture\" and what makes up \"the arts\" has been a matter of some debate in Singapore. For an attempt at defining what is artistic, see, for example, the Report of the Censorship Review Committee 1992. ## Cuisine In Singapore's [hawker centres](/wiki/Hawker_centre), for example, traditionally [Malay](/wiki/Malay_people) [hawker](/wiki/Hawker_(trade)) stalls also sell [Lingnan](/wiki/Lingnan)-[Chinese](/wiki/Chinese_food) and [Tamil](/wiki/Tamil_people) food. Chinese stalls may introduce Malay ingredients, cooking techniques or entire dishes into their range of catering. Singaporeans also enjoy a wide variety of seafood including crabs, clams, squid, and oysters. One favourite dish is the [chilli crab](/wiki/Chilli_crab), commonly sold at stalls selling seafood. ## Festivals The major public holidays reflect the mentioned racial diversity, including [Chinese New Year](/wiki/Chinese_New_Year), [Buddhist](/wiki/Buddhist) [Vesak](/wiki/Vesak) Day, [Muslim](/wiki/Muslim) [Eid ul-Fitr](/wiki/Eid_ul-Fitr) (known locally by its [Malay](/wiki/Malay_language) name [Hari Raya Puasa](/wiki/Hari_Raya_Puasa)), Hindu [Diwali](/wiki/Diwali) (known locally by its [Tamil](/wiki/Tamil_language) name [Deepavali](/wiki/Deepavali)) and Christmas, [Good Friday](/wiki/Good_Friday) (By Christians), and New Year's Day are also public holidays. On 9 August, Singapore celebrates the anniversary of its independence with a series of events, including the [National Day Parade](/wiki/Singapore_National_Day_Parade) which is the main ceremony. The first National Day Parade, which was held in 1966, was held at the [Padang](/wiki/Padang,_Singapore) in the city centre. In 2003, the [Esplanade – \"Theatres on the Bay\"](/wiki/Esplanade_%E2%80%93_Theatres_on_the_Bay), a centre for performing arts, was opened. The Esplanade is also known as \"The [Durian](/wiki/Durian)\", due to its resemblance to the fruit. The Arts House at Old Parliament Lane has also been supportive of local performing arts in recent years. [Nanyang Academy of Fine Arts](/wiki/Nanyang_Academy_of_Fine_Arts) (NAFA) and [LASALLE College of the Arts](/wiki/LASALLE_College_of_the_Arts) are the two main arts institutions offering full-time programmes for the performing arts in Singapore. ## Languages\n",
  "language": "en",
  "processed_at": "2026-01-12T10:06:15.664169",
  "title": "Culture of Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Culture_of_Singapore"
}