{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:06:18.151528"
  },
  "content": "Temple in Chinatown, Singapore **Cundhi Gong Temple** or **Zhun Ti Gong Temple** is a temple on [Keong Saik Road](/wiki/Keong_Saik_Road) in [Chinatown, Singapore](/wiki/Chinatown,_Singapore). Completed in 1928, it was initially a branch of a now-demolished temple on Upper Chin Chew Street. ## Description The Nanyang-style temple features a roof built with \"shallow curved-profile\" clay tiles, accompanied by ridges \"adorned with green-glazed Chinese circular tiles.\" The roof also features dragons made of porcelain on either side of a \"blazing pearl\" on the curved roof ridge. The parapet below the dragons features phoenixes and flowers, also made of porcelain. The temple's [five-foot way](/wiki/Five-foot_way) features floral tiles made by Gilliot & Cie on the walls and timber trusses accompanied by traditional paintings and \"elaborate\" wooden carvings. The temple's front entrance leads to its main prayer hall. A smaller prayer hall and an outdoor courtyard can be found behind the main prayer hall, while the temple's living quarters can be found left of the main prayer hall and on the temple's second floor. The interior of the temple features columns and walls covered in mosaic tiles. The columns have European-style and Chiese-style Lotus-shaped capitals. The \"unique\" circular windows at the front entrance feature concrete frames with a terrazzo finish and mild-steel window grilles that were painted in red. ## History The temple was completed in 1928 to [worship](/wiki/Worship) the Buddhist deity [Cundi](/wiki/Cundi_(Buddhism)). It was initially a branch of the now-demolished Guanyin Temple on Upper Chin Chew Street, which is no longer extant. Following the de-consecration of the Guanyin Temple, the Cundhi Gong Temple was made the main temple. It is affiliated with the [Kwan Im Thong Hood Cho Temple](/wiki/Kwan_Im_Thong_Hood_Cho_Temple) on [Waterloo Street](/wiki/Waterloo_Street). Cantonese majie would come to the temple to make their vows of celibacy in the 20th century. It was gazetted for conservation by the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) in 1989. It was placed in the [Bukit Pasoh Conservation Area](/wiki/Bukit_Pasoh_Road), which is within the Chinatown Historic District. 1°16′46″N 103°50′29″E﻿ / ﻿1.27954°N 103.84139°E﻿ / 1.27954; 103.84139\n",
  "language": "en",
  "processed_at": "2026-01-12T10:06:18.151106",
  "title": "Cundhi Gong Temple",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Cundhi_Gong_Temple"
}