{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:06:25.943384"
  },
  "content": "Building in Tanjong Pagar, Singapore **Custom Operations Command** is a building on Keppel Road in [Tanjong Pagar, Singapore](/wiki/Tanjong_Pagar). Completed in 1940, it initially served as the headquarters of the customs division of Tanjong Pagar and a living quarters for revenue officers. It later became the headquarters of the [Singapore Customs](/wiki/Singapore_Customs) enforcement operations. In 2019, the organisation moved out of the building, which had been earmarked for redevelopment in 2009. ## Description The three-storey [Streamline Moderne](/wiki/Streamline_Moderne) building features a hip roof made of terracotta, as well as parapet walls with rounded edges and linear mouldings. Its windows are large and framed with metal. The building was made of reinforced concrete and painted in \"pink and cream\". At its completion, it featured over 60 flats for revenue officers and their families and two flats for the division's assistant supervisors, as well as a recreation room with parquet flooring. The flats occupied the second and third storeys, while the first was occupied by the customs offices. ## History The building's construction, which cost $190,000, began in 1938 and was completed in 1940. It was initially scheduled for completion in late 1939. However, its construction experienced delays as a result of [World War II](/wiki/World_War_II) and the difficulty in transporting materials to the site. The customs division of Tanjong Pagar moved into the building on 1 December from its previous headquarters within the premises of the [Singapore Harbour Board](/wiki/Singapore_Harbour_Board). The building also had its own sports club, with membership being automatically provided to all those who worked for the customs. It had teams for soccer, hockey and badminton. During the [Japanese Occupation of Singapore](/wiki/Japanese_Occupation_of_Singapore), the building served as a naval training school. Many of its amenities were damaged in this period. Following the end of the occupation, the building's sports club was redecorated and refurnished. It was reopened on 17 January 1953. By then, the building had become the Port Division Building. In the 1960s, the building began serving as a base for the enforcement operations of the customs, with both the Land Division and the Land Squads moving into the building. In the 1980s, the building began serving as the Ports Branch of the Docks Division of the customs. In March 1982, it was announced that out of the building's 24 quarters, 13 would be demolished to make way for a training school. Other branches of the Singapore Customs began moving into the building in the 1990s. In 2003, it was officially renamed the Customs Operations Command. In 2009, the customs was informed that the building was earmarked for redevelopment. As such, a new building, also named the Customs Operations Command, was built on Bulim Drive in [Jurong West](/wiki/Jurong_West). The Keppel Road building closed on 15 November 2019. 1°16′22″N 103°50′28″E﻿ / ﻿1.27282°N 103.84113°E﻿ / 1.27282; 103.84113\n",
  "language": "en",
  "processed_at": "2026-01-12T10:06:25.942952",
  "title": "Custom Operations Command",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Custom_Operations_Command"
}