{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:06:29.947647"
  },
  "content": "Singaporean politician (born 1958)This article includes a list of general references, but **it lacks sufficient corresponding inline citations**. Please help to improve this article by introducing more precise citations. *(November 2019)* *(Learn how and when to remove this message)* **Cynthia Phua Siok Gek** ([Chinese](/wiki/Chinese_language): 潘惜玉; [pinyin](/wiki/Pinyin): *Pān Xīyù*, born 19 August 1958) is a Singaporean business executive and former politician. She was a [Member of Parliament](/wiki/Parliament_of_Singapore#Members_of_Parliament) (MP) representing [Aljunied Group Representation Constituency](/wiki/Aljunied_Group_Representation_Constituency) (GRC) for the governing [People's Action Party](/wiki/People%27s_Action_Party) (PAP) from 2001 to 2011. ## Career Phua was the general manager of [NTUC Fairprice](/wiki/NTUC_FairPrice) Co-operative's real estate business unit and the managing director of estate management company SLF Management Services. She had also served as Chief Executive Officer of Bishan–Toa Payoh Town Council and Chairperson of Aljunied Town Council. Phua made her political debut in the [2001 general election](/wiki/2001_Singaporean_general_election) in Aljunied GRC as part of a five-member PAP team, winning in a walkover. She was then assigned to the Paya Lebar ward. In the [2011 general election](/wiki/2011_Singaporean_general_election), she stood for reelection in Aljunied GRC, but lost to a [Workers' Party](/wiki/Workers%27_Party_of_Singapore) (WP) team consisting of [Low Thia Khiang](/wiki/Low_Thia_Khiang), [Pritam Singh](/wiki/Pritam_Singh), [Sylvia Lim](/wiki/Sylvia_Lim), [Faisal Manap](/wiki/Faisal_Manap) and [Chen Show Mao](/wiki/Chen_Show_Mao). It was the first time an opposition party had won a [GRC](/wiki/Group_representation_constituency) since the GRC system was introduced in 1988. The PAP received 45.28% of the vote compared to the WP's 54.72%. Phua retired from politics after her electoral loss. She joined real estate consultancy Knight Frank Singapore in 2013 as its executive director of retail services, and Viking Offshore And Marine in 2015 as a director. - Singapore Parliament CVs of MPs - PAP supporters try to clarify incident involving Cynthia Phua Archived 2011-05-09 at the [Wayback Machine](/wiki/Wayback_Machine) - TOC breaking news: Aljunied GRC Facebook site alleges defamation? Archived 2011-05-07 at the [Wayback Machine](/wiki/Wayback_Machine) - Cynthia Phua's treatment of constituents - Aljunied swing vote This article about a politician from Singapore is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T10:06:29.947125",
  "title": "Cynthia Phua",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Cynthia_Phua"
}