{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:06:40.496720"
  },
  "content": "Singaporean social worker **Daisy Vaithilingam** (1925 - 6 August 2014) was a Singaporean [social worker](/wiki/Social_work). Vaithilingam was involved with setting up foster care and children's programs for the [intellectually disabled](/wiki/Intellectual_disability) in [Singapore](/wiki/Singapore). She was one of the founders of the organization that later became known as [MINDS](/wiki/Movement_for_the_Intellectually_Disabled_of_Singapore). ## Biography Vaithilingam was born in [Penang](/wiki/Penang) in 1925 and was the youngest of four children in her family. Her mother was a nurse and her stepfather a doctor and, like them, she also wanted to help others from a young age. Vaithilingam attended [Methodist Girls' School](/wiki/Methodist_Girls%27_School,_Singapore). She then graduated with a bachelor of arts degree from the [National University of Singapore](/wiki/National_University_of_Singapore) (NUS) in 1950. She started work at the [Singapore General Hospital](/wiki/Singapore_General_Hospital) in 1952. In 1955, Vaithilingam became the chief of Medical Social Workers (or Senior Almoner), which put her in charge of all hospitals' social workers in the country. Shortly after her appointment, she created a [foster care](/wiki/Foster_care) program at [Woodbridge Hospital](/wiki/Institute_of_Mental_Health_(Singapore)). Because many [intellectually disabled](/wiki/Intellectual_disability) (ID) children were abandoned at hospitals, Vaithilingam created the [Singapore Association for Retarded Children](/wiki/Movement_for_the_Intellectually_Disabled_of_Singapore) (SARC, which later became MINDS) in 1962. She also created a project to help parents of children with ID financially. Vaithilingam also had to deal with cultural attitudes about hospitals and medical treatment since many people believed such treatment was only for the dying. Vaithilingam had a key role in creating the Singapore Association of Social Workers in 1971. In the 1980s, she was involved in setting up the Medical Social Work department of the [National University Hospital](/wiki/National_University_Hospital). She also lectured at NUS on social work for fifteen years. Vaithilingam was the chair on the first Committee of the Care of the Aged. Vaithilingam died after being diagnosed with gum [cancer](/wiki/Cancer) in 2014. She was inducted into the [Singapore Women's Hall of Fame](/wiki/Singapore_Women%27s_Hall_of_Fame) also in 2014. ### Citations ### Sources - Koh, Jaime (2012). *Singapore Childhood: Our Stories Then And Now*. World Scientific. [ISBN](/wiki/ISBN_(identifier)) 9789814405799.\n",
  "language": "en",
  "processed_at": "2026-01-12T10:06:40.496337",
  "title": "Daisy Vaithilingam",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Daisy_Vaithilingam"
}