{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:06:51.683425"
  },
  "content": "This article **relies excessively on references to primary sources**. Please improve this article by adding secondary or tertiary sources. *Find sources:* \"Dance in Singapore\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(March 2010)* *(Learn how and when to remove this message)*This article **is written like a personal reflection, personal essay, or argumentative essay** that states a Wikipedia editor's personal feelings or presents an original argument about a topic. Please help improve it by rewriting it in an encyclopedic style. *(March 2010)* *(Learn how and when to remove this message)* **Dance in Singapore** has been an integral part of its culture despite having a relatively short history of creative, artistic and professional dance. The range of dance reflects the cultural diversity of Singapore, from traditional dance forms to contemporary genres. This history of dance in Singapore can be traced back to the early 20th century when various dance forms were introduced from different parts of the world. Post-colonial Singapore marked a period of discovery of its local arts where there was a consistent struggle between the rejection and acceptance of western dance influences, and the re-emphasis of ethnic cultures from time to time. The early years of Singapore's dance scene was largely dominated by ethnic dances as immigrants brought along these traditional art forms over from their homelands, namely Malay, Chinese, Indian and Eurasian. As the arts and education scene in Singapore developed through the years, the dance scene also grew into a vibrant mix of both traditional and modern dance forms. While the Singapore identity through dance is a challenging one, pioneering figures of dance have spearheaded and contributed greatly to the evolution of Singapore's dance scene such as [Goh Lay Kuan](/wiki/Goh_Lay_Kuan), Som Said, Kuik Swee Boon and [Santha Bhaskar](/wiki/Santha_Bhaskar). ## Types of Dance in Singapore ### Traditional Being a multi-ethnic country, there is a multitude of traditional dance forms in Singapore. Although the predominant ethnicity is Chinese, there are also other ethnic communities present such as Indians, Malays and Eurasians. - Chinese traditional dance forms have many types such as [Chinese Dance](/wiki/Dance_in_China) and [Lion Dance](/wiki/Lion_Dance) which is popularly performed during the New Year festivities, among other dances performed in other cultural events. - Malay traditional dance forms include, [Zapin](/wiki/Zapin), which is popular among Malays, as well as Apin, [Joget](/wiki/Joget), Asli and Inang, amongst many others. - Indian traditional dance forms include [Bharatanatyam](/wiki/Bharatanatyam), one of the oldest classical Indian dance, and [Kathak](/wiki/Kathak) which is taught in many Indian dance schools in Singapore. - [Peranakan](/wiki/Peranakan) dance blends Malay and Chinese influences in both choreography and clothing. [Peranakan](/wiki/Peranakan) music has Malay and Western influences. - Eurasian communities in Singapore typically practice the Jinkli Nona, a dance commonly associated with the Branyo. Today, the Eurasian Association (EA) continues to promote and perform the Jinkli Nona at various events. ### Ballet The history of ballet in Singapore is a relatively short one. From the early years of rejection of western influences, developments in ballet began to grow with the establishment of ballet schools and academy in the late 1900s. These schools trained the pioneering batch of ballet dancers in Singapore, including [Goh Soo Khim](/wiki/Goh_Soo_Khim), who became the first Singaporean ballerina to enrol in the [Australian Ballet School](/wiki/Australian_Ballet_School) (ABS). As ballet flourished and grew, the government also began to embrace western performing arts in a big way as seen from the establishment of professional ballet companies, namely the Singapore Ballet Academy (SBA) in 1958, and the founding of [Singapore Dance Theatre](/wiki/Singapore_Ballet) in 1987. [Singapore Dance Theatre](/wiki/Singapore_Dance_Theatre) (SDT) was Singapore's first professional dance company. It was founded by Goh Soo Khim and Anthony Then, whom began recruiting potential dancers for the company. In its early beginnings, both Goh and Then had a shared vision for the dance scene in Singapore to nurture a group of dancers who were committed to a career in dance. SDT had its humble beginnings in a shared space with SBA before moving to their own studio in 1991. The company put up its first full-length classical ballet performance in 1992 with *The Nutcracker*. Currently, SDT's repertoire comprises both classical ballet and contemporary ballet works. It has also been renamed as Singapore Ballet in recent years, with hopes and confidence in the identity of their company, while remaining an ambassador for dance and ballet in Singapore. ### Contemporary Dance This section **may incorporate text from a large language model**. It may include [hallucinated](/wiki/Hallucination_(artificial_intelligence)) information, copyright violations, claims not verified in cited sources, original research, or fictitious references. Any such material should be removed and content with an unencyclopedic tone should be rewritten. The reason given is: **section added in 2025; note WP:AISIGNS in promotional tone, AI vocab distribution, etc** *(January 2026)* *(Learn how and when to remove this message)* Contemporary dance in Singapore has evolved significantly since the 1990s, blending Western techniques with Asian traditions and local cultural influences. The genre emphasises expressive movement and often explores themes relevant to modern society. The development of contemporary dance in Singapore has been supported by arts education institutions and government initiatives aimed at fostering a vibrant arts scene. Several contemporary dance companies have been instrumental in shaping the landscape: - **T.H.E Dance Company (The Human Expression Dance Company)**: Founded in 2008 by Kuik Swee Boon, T.H.E is known for its unique *HollowBody* methodology, focusing on instinctive and humanistic expression. T.H.E has performed at numerous prestigious festivals, including the Singapore Arts Festival, Esplanade’s da:ns festival, SIDance Festival in South Korea, Yokohama Dance Collection in Japan, Les Hivernales Festival in France, and Oriente Occidente Festival in Italy. The company organises the annual *cont·act Contemporary Dance Festival*, Singapore’s first annual contemporary dance festival, serving as a platform for local and international artists to showcase their work and engage with the community through performances, workshops, and masterclasses. - **Frontier Danceland**: Established in 1991 by Low Mei Yoke and Tan Chong Poh, Frontier Danceland was a full-time professional contemporary dance company that presented works by both local and international choreographers. In March 2023, the company announced it would transition from being a full-time company to a project-based one, marking the end of its full-time operations. - **RAW Moves**: Founded in 2011 by Ricky Sim, RAW Moves is a contemporary dance company that focuses its establishment, connection, and direction of work with the spirit of inquiry. The company emphasises experimental and cross-disciplinary works, aiming to redefine movement and engage with the community through innovative performances. ### Street **Hip-Hop** Street dance was born out of the ghettos in the late 1970s in Bronx, New York City. The late 1970s marked a period of social and cultural change and Hip-Hop was seen as an opportunity for creative expression as it served as a 'voice' for the unrepresented and invisible communities through music and dance. Street dance in Singapore gained popularity in the 2000s and have received more attention in recent years. One of the most famous street dance event in Singapore is Radikal Forze Jam which is typically held over three days and consists of dance workshops, masterclasses, and competitions to promote and educate the public about hip-hop and street dance. In 2022, [Sport Singapore](/wiki/Sport_Singapore) will also be launching a structured dance programme for youths in collaboration with Recognize Studios to provide more opportunities to youths given the rising demand for dance classes. ## History of Dance in Singapore ### 1950s-1970s The post World War II era marked a transitory period for Singaporeans as many social and cultural changes took place in the country at that time due to the distraught caused by the war. This period also saw political awakening amongst fellow Singaporeans, who witnessed the fall of the British, and led to the struggle for self-government and decolonisation. Living conditions of Singapore in its immediate post-war years were undesirable as many lived in unsanitary conditions, coupled with the severe shortage of food and healthcare facilities. Throughout the 1950s to 60s, tensions and conflict between different communities and ethnic groups were also increasing as life in Singapore continued to be filled with instability and uncertainty. Thus, the government's main focus during this era was on rebuilding the economy and the priority was to provide jobs for people to curb unemployment. At the same time, after the 1959 General Election won by the [People's Action Party](/wiki/People%27s_Action_Party) (PAP), the government also recognised the importance of nation-building to cultivate a sense of identity amongst Singaporeans. Then Minister for Culture [S. Rajaratnam](/wiki/S._Rajaratnam) was tasked to organise a series of outdoor concert that would promote mutual understanding and appreciation among the different ethnic groups. Cultural performances by different ethnic groups were staged and some examples include, Malay Drama, Indian Classical Dances and Chinese Lion Dance. Through ground initiatives and programmes started by the Singapore government, cultural life began to develop. New dance styles also emerged as the dance scene in Singapore continued to develop significantly. Some notable events in Singapore's dance scene include the establishment of the Singapore Ballet Academy (SBA) in 1958, marking the beginning of formal ballet training in Singapore, as well as the establishments of several dance troupes such as the Sri Warisan Performing Arts Group. #### Tea dances Tea dances were a popular social event in Singapore during the 1900s and was a catalyst for the rock 'n' roll culture. It was first brought over by the European community in the 1920s where these dances were held in the ballrooms of the grandest hotels. Tea dances were then introduced in the nightclubs of amusement parks in the 1930s such as [Great World](/wiki/Great_World_Amusement_Park) and [New World](/wiki/New_World_Amusement_Park). This form of socialising and dance attracted the attention of Chinese clubs and by 1939, the Chinese Association held tea dance once every two weeks for its members. By the 1960s, tea dances became very popular amongst youths and a multitude of genres was played at these clubs. #### National Theatre In 1959, the Singapore government announced plans to build a theatre for the cultural entertainment of mass audiences. This was announced by the then Minister for Culture, S. Rajaratnam. Funds for the theatre was accumulated through various fundraising activities and contribution from the public. To commemorate this, the theatre was built and also came to be known as the \"People's Theatre\". The National Theatre was formally launched in 1963, despite not being fully completed. The 1st Southeast Asia Cultural Festival was also held there. Many performances and events were held at the theatre throughout its years of operations, and was also visited by many popular overseas performing groups and famous artistes such as the Russian Bolshoi Ballet and The Bee Gees. The National Theatre officially closed in 1984 due to infrastructure instability, and was subsequently demolished to make way for the Central Expressway. ### 1980s-1990s From the 1980s to 1990s, Singapore saw a normalisation of art practices as it moved away from being a cultural desert to a more culturally vibrant society. During the 1960s to 70s, the economy was the main priority of the government and the arts was seen as a tool for nation-building. But Singapore's economy began to stabilise towards the 1980s, the government's view towards the arts shifted toward a more economic function. Under the leadership of Prime Minister [Goh Chok Tong](/wiki/Goh_Chok_Tong), the government planned a road map for the arts to work towards their goal of making Singapore a “global city for the arts” by 1999. This was also written in the 1989 Advisory Council on Culture and the Arts (ACCA) which proposed recommendations such as the establishment of a [National Arts Council](/wiki/National_Arts_Council,_Singapore) (NAC), development of arts education, new arts infrastructures and increased funding to support cultural groups. #### National Theatre Chinese Dance Company (NTCDC) In May 1980, the National Theatre Chinese Dance Company (NTCDC) was formed by the National Theatre Trust, upon the successful completion of the dance training programme conducted by prominent Hong Kong instructor, Mr. Cheng Shu Jing. The training programme had culminated in a concert, \"An Evening of Chinese Dances\" being performed on 24 Nov 1979. NTCDC evolved to become Theatre Arts Troupe in 1992, after National Theatre Trust amalgamated into the [National Arts Council](/wiki/National_Arts_Council,_Singapore) (NAC). #### National Arts Council (NAC) The NAC was established in September 1991 under the then Ministry of Information and the Arts (now known as Ministry of Culture, Community and Youth). The main functions of NAC include Arts Funding, Arts Education, Community Arts and several other functions. Under the combined leadership of [George Yeo](/wiki/George_Yeo), the Minister of Information and Arts, and [Tommy Koh](/wiki/Tommy_Koh), the first chairman of NAC, the arts scene underwent major changes as the importance of arts grew. Not only has NAC provided financial support to the dance scene in Singapore, it also consistently records the popularity and attention that dance (and other art forms) receive over the year via the Population Survey on the Arts to better understand the progression of the cultural and artistic scene, as well as how society reacts to different art forms. The population survey is mainly done through the use of representative sampling towards specific age groups who would be more interested in certain cultural activities. This helps the government track the artistic progress of the nation so as to better curate future policies catered towards cultural development. **Structured formal dance training** In the 1989 Report of the Advisory Council on Culture and the Arts (ACCA), there were recommendations to improve the quality of arts education in schools, as well as develop tertiary level arts education (e.g. Diplomas, Degrees). In the 1980s, [Nanyang Academy of Fine Arts](/wiki/Nanyang_Academy_of_Fine_Arts) (NAFA) started Singapore's first full-time Modern Dance programme. The programme was headed by Angela Liong and offered all-rounded dance theory and technique program including [Martha Graham](/wiki/Martha_Graham)'s [technique](/wiki/Graham_technique) and [dance improvisation](/wiki/Dance_improvisation). Her programme was delivered with strong contemporary arts references and education on top of the regular dance training. Students also had the chance to go on an exchange programme where they were given the opportunity to attend workshops and work with many American dance artists. Other institutions that offer tertiary programme in dance include [LaSalle](/wiki/LASALLE_College_of_the_Arts) as well as School of the Arts (SOTA). ### 2000s - Present **Art Policies and Nationwide Surveys** In the year 2000, a decade after the report of the ACCA of 1989, the Singapore government unveiled its first ever Renaissance City Plan (RCP) to re-evaluate the state of the arts and project its function in future developments. This kickstarted a string of renaissance city plans from 2000 through 2008, followed by several other arts masterplans. The RCP was essentially to help promote the arts with the goal of establishing Singapore as global arts center, and to create a vibrant cultural environment that could attract artistic and creative works and talents. Some recommendations of the report was to increase scholarships to talented individuals and provide good infrastructure and facilities. The following RCPs also sought to continue the development of creative industries in Singapore. In all three plans, it is clear that the shared goal is to groom Singapore to become a global city for the arts. While there is no goal specifically for the dance scene in Singapore, the development of arts education, investment and facilities all support the growth of the dance scene. From the population survey on the arts 2019, attendance for dance events has seen an overall increase. Among the various genres of dance, street dance has been on the rise. In present time, the number of dance companies established in Singapore has grown over the years. There are also several dance events and festivals organised annually in Singapore such as cont·act Contemporary Dance Festival, Esplanade's da:ns Festival and renowned dance competition, Super 24 that is opened to both tertiary institutions and worldwide dance crews. ## Dance Events/Festivals in Singapore Different dance festivals and events are organised in Singapore throughout the year. ### Singapore Festival of Dance Singapore organised its first Festival of Dance in 1982 as a platform for dance practitioners and choreographers to showcase their work, promote interests and to encourage the appreciation for dance amongst Singaporeans. Since its inception, the dance festival was subsequently absorbed under the Festival of Asian Performing Arts, which merged with the Singapore festival of arts in 1999 and is currently named, [Singapore International Festival of Arts](/wiki/Singapore_International_Festival_of_Arts) (SIFA). The Festival of Dance's has an objective of creating new local dance forms through the working together of ethnic dance choreographers but this Singaporean identity did not work out very well. #### cont·act Contemporary Dance Festival T.H.E Dance Company's cont·act Contemporary Dance Festival is an annual dance festival held in Singapore that showcases contemporary dance performances by local and international dance companies and choreographers. The festival is organised by T.H.E Dance Company, a contemporary dance company based in Singapore. The festival was first held in 2010, and focuses on contemporary dance with workshops that cover contemporary techniques as well as masterclasses by renowned instructors. #### Esplanade's da:ns festival Esplanade's da:ns festival started in 2005 to raise more awareness about dance and typically runs for about two weeks. The festival features a diverse range of programmes from both local and international performances, to outdoor performances and dance workshops, in hopes of establishing a foundation of knowledge for dance by introducing a range of dances. 2022 marked its 17th year since the festival started and will be its last edition of the current format. Ms Faith Tan, the head of dance and international development for Esplanade announced that a new format for the festival will be introduced in 2023, comprising five full weekends of dance programmes that will be held at different times of the year, with a different theme or genre chosen for each weekend. #### Lion City Dance Convention The Lion City Dance Convention is an annual event organised by Recognize! Studios that consists of dance workshops, battles and competitions opened to both local and international audiences. The 2022 edition was co-organised by Recognize! Studios, Active Groove and Legacy Dance Co. Workshops held throughout the weekend range from genres like breaking and choreography, to funk and [litefeet](/wiki/Litefeet). #### Super 24 Super 24 is a dance competition that is unique to Singapore. The format of the competition takes place on a square-shaped stage that is 8 metres by 8 metres where teams must have an exact number of 24 dancers, and are strictly given 90 seconds for their piece. The format of the competition also diverges away from usual stages whereby there is only a front view, but for Super 24, dance crews are judged from all 4 sides. Amidst the growing popularity for dance in Singapore, Super 24 serves as a new and unique platform for dance showcase competitions. ## Notable Dance Companies in Singapore Name of Dance CompanyFoundedSri Warisan Performing Arts1966Asparas Arts1977Singapore Ballet1987Singapore Dance Theatre1988Frontier Dance Company1991O School2006Maya Dance Theatre2007T.H.E. Dance Company2008Recognize! Studios2010\n",
  "language": "en",
  "processed_at": "2026-01-12T10:06:51.682968",
  "title": "Dance in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Dance_in_Singapore"
}