{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:06:56.132771"
  },
  "content": "This article **appears to be slanted towards recent events.** Please try to keep recent events in historical perspective and add more content related to non-recent events. *(October 2023)*Singaporean psychiatrist **Daniel Fung Shuen Sheng** (born 1966) is a Singaporean [psychiatrist](/wiki/Psychiatrist) and [researcher](/wiki/Research) who is the current [chief executive officer](/wiki/Chief_executive_officer) of the [Institute of Mental Health](/wiki/Institute_of_Mental_Health_(Singapore)) (IMH). Fung was also the president of the [International Association for Child and Adolescent Psychiatry and Allied Professions and of the College of Psychiatrists](/wiki/International_Association_for_Child_and_Adolescent_Psychiatry_and_Allied_Professions) in [Singapore](/wiki/Singapore). ## Career Fung joined IMH in 1993. From 2007 to 2011, he was the head of the department of [child and adolescent psychiatry](/wiki/Child_and_adolescent_psychiatry) at IMH. He was also [chairman](/wiki/Chairperson) of the hospital's medical board; under his leadership, IMH initiated the peer support specialist programme and invested more resources into early and community intervention. Fung was also director of REACH, IMH's community health programme, and president of the Singapore Association for Mental Health (SAMH). During his presidency, SAMH won a Charity Governance [Award](/wiki/Award) for good governance. Fung was appointed chief executive officer of the Institute of Mental Health in 2021, succeeding Chua Hong Choon. As CEO of the hospital, Fung has stated an intention for IMH to combat stress and [mental health](/wiki/Mental_health) illiteracy in the local community beyond providing medical care to patients. In 2022, the [Straits Times](/wiki/The_Straits_Times) misquoted Fung as having advised parents to watch [pornography](/wiki/Pornography) with their children, which drew criticism from some online commentators. The Straits Times later corrected their article and removed the original quote. Fung had previously advocated against parents exposing children to pornography. A biographical comic on his career as well as the history of child and adolescent psychiatry in Singapore is presented here ## Personal life Fung is married and has four daughters and one son. ## Selected bibliography ### Books - Survivors: Breaking The Silence On Child Sexual Abuse - The Stress Wars ### Selected Journal articles - Seang-Mei Saw, Say-Beng Tan, Daniel Fung, et al.; IQ and the Association with Myopia in Children. *Invest. Ophthalmol. Vis. Sci.*2004;45(9):2943-2948. doi: https://doi.org/10.1167/iovs.03-1296. - Manassis, K., Fung, D., et al. (2003), Characterizing selective mutism: Is it more than social anxiety?. Depress. Anxiety, 18: 153–161. https://doi.org/10.1002/da.10125 - Ooi, Y. P., Ang, R. P., Fung, D. S. S., et al. (2006). The Impact of Parent–Child Attachment on Aggression, Social Stress and Self-Esteem. School Psychology International, 27(5), 552–566. https://doi.org/10.1177/0143034306073402 - Woo BS, Ng TP, Fung DS, et al. Emotional and behavioural problems in Singaporean children based on parent, teacher and child reports. Singapore Med J. 2007 Dec;48(12):1100-6. PMID 18043836. - Bernardine S.C. Woo, W.C. Chang, Daniel S.S. Fung, et al., Development and validation of a depression scale for Asian adolescents, Journal of Adolescence, Volume 27, Issue 6, 2004, Pages 677–689, ISSN 0140-1971, https://doi.org/10.1016/j.adolescence.2003.12.004. - Xie, Y., Boon, J., Sim, W., & Fung, D. (2015). A Singapore model – REACH. In S. Kutcher, Y. Wei, & M. Weist (Eds.), *School Mental Health: Global Challenges and Opportunities* (pp. 202–217). Cambridge: Cambridge University Press. [doi](/wiki/Doi_(identifier)):10.1017/CBO9781107284241.018 - Chodavadia, P., Teo, I., Poremski, D. *et al.* Prevalence and economic burden of depression and anxiety symptoms among Singaporean adults: results from a 2022 web panel. *BMC Psychiatry* 23, 104 (2023). https://doi.org/10.1186/s12888-023-04581-7 - Daniel Fung on Google Scholar\n",
  "language": "en",
  "processed_at": "2026-01-12T10:06:56.132389",
  "title": "Daniel Fung",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Daniel_Fung"
}