{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:07:04.060838"
  },
  "content": "Human resource management platform **Darwinbox** is an AI-powered cloud [HCM suite](/wiki/Human_capital_management) platform, headquartered in [Singapore](/wiki/Singapore). The platform is a [Human capital management](/wiki/Human_capital_management) (HCM) suite designed to help enterprises and growing organizations automate day-to-day HR operations. ## History Darwinbox was launched in 2015 by Jayant Paleti, Rohit Chennamaneni, Chaitanya Peddi and Vineet Singh. In February 2021, The Filipino conglomerate [JG Summit Holdings](/wiki/JG_Summit_Holdings) partnered with Darwinbox and in October 2025, it expanded its partnership with Darwinbox. In 2022 Darwinbox became a unicorn, valued at over $1B. In January 2023, [Microsoft](/wiki/Microsoft) invested in Darwinbox. In 2024, Darwinbox elevates its CTO Vineet Singh as fourth Co-Founder. In March 2025, Darwinbox raised $140 million by [Partners Group](/wiki/Partners_Group) and [KKR & Co.](/wiki/KKR_%26_Co.) to accelerate global expansion. Darwinbox became the first HR technology platform to introduce a [Model Context Protocol](/wiki/Model_Context_Protocol) MCP server for [AI integration](/wiki/Artificial_intelligence_systems_integration) in May 2025. In August 2025, Darwinbox received $40 million funding from Canada's [Ontario Teachers' Pension Plan](/wiki/Ontario_Teachers%27_Pension_Plan). As of 2025, more than 4 million employees across approximately 130 countries use the Darwinbox platform. ## Recognitions In 2021, Darwinbox becomes the Youngest and Only Asian Player to Feature on [Gartner's Magic Quadrant](/wiki/Magic_Quadrant) for cloud [HCM suite](/wiki/Human_capital_management). In 2025, Darwinbox named Challenger in Gartner® Magic Quadrant for the second consecutive year, accelerating AI in HCM. - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T10:07:04.060373",
  "title": "Darwinbox",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Darwinbox"
}