{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:07:10.083721"
  },
  "content": "Malay folk beliefThis article includes a list of references, related reading, or external links, **but its sources remain unclear because it lacks inline citations**. Please help improve this article by introducing more precise citations. *(February 2022)* *(Learn how and when to remove this message)* ***Datuk Keramat*** is a fusion of [Malaysian folk religion](/wiki/Malaysian_folk_religion), [Sufism](/wiki/Sufism), and [Chinese folk religion in Southeast Asia](/wiki/Chinese_folk_religion_in_Southeast_Asia). It is practiced in [Malaysia](/wiki/Malaysia), [Singapore](/wiki/Singapore) and along the [Strait of Malacca](/wiki/Strait_of_Malacca). In Malay, *datuk* means a village chief, a grandfather, or person in a high position and *[keramat](/wiki/Karamat)* is an [Arabic](/wiki/Arabic) loanword associated with Sufism that means \"sacred, holy, blessed, mystical, supernatural, highly respected\". Worshippers usually offer flowers, fruits, rice and vegetable to the shrines. Benzoin is also burnt to emit a smoky fragrant smell as part of the ritual. ## Origins According to local legends, all *datuks* were once humans who had a standing in society either for their position or special attributes. They could have been an important leader, a renowned healer, a *[silat](/wiki/Silat)* warrior, a landlord, a pious man or even a respectable *[dukun](/wiki/Dukun)*, *[pawang](/wiki/Pawang)* or *[bomoh](/wiki/Bomoh)*. Upon their death, locals and their followers would sometimes offer prayers at their gravestones, in line with the concept of *keramat*. In several cases, a large [anthill](/wiki/Anthill) structure was present on the grave. With the arrival of Chinese immigrants who carried along with them the Confucian belief of [Ancestral Worship](/wiki/Ancestor_worship_in_China) and their respect for Nature, both practices converged and formed a new micro-culture as observed today. Datuks, referred to in Chinese as [Na Tuk Kong](/wiki/Na_Tuk_Kong), is considered a localised form in worship of the spirit of the land, along with [Tu Di Gong](/wiki/Tu_Di_Gong) (Earth Deities). ## Shrines A typical [Keramat](/wiki/Keramat_(shrine)) is a small yellow-coloured painted shrines that can be found along sidewalks or under trees in Malaysia. These shrines are usually worshipped by residents living nearby. The shrines are normally of a fusion Chinese-Malay design, with [Islamic](/wiki/Islamic) elements such as the crescent moon decorations. Inside the shrine, a small, decorated statue or a piece of stone (wrapped in yellow cloth) is venerated, representing the *datuk*. Offerings are brought and placed around the *datuk*, or sometimes on a small altar in front of it. ## Types One belief is that there are a total of nine types of *datuks*, and that each of them were once great warriors and expert in Malay local martial arts, the *silat* except for the last *datuk*. They were also known to possess great magical powers. Worshippers usually pray to *datuks* for protection, good health, and good luck, and sometimes seek divine help to overcome their problems. Below are the nine *datuks* from the eldest to the youngest: 1. *Datuk Panglima Ali* (Ali) 2. *Datuk Panglima Hitam* (Black) 3. *Datuk Panglima Harimau* (Tiger) 4. *Datuk Panglima Hijau* (Green) 5. *Datuk Panglima Kuning* (Yellow) 6. *Datuk Panglima Putih* (White) 7. *Datuk Panglima Bisu* (Mute) 8. *Datuk Panglima Merah* (Red) 9. *Datuk Panglima Bongsu* (Youngest) The structure of *datuk* worship is diversified according to localities. For example, in the old quarters of Georgetown, the presence of The Seven Brothers or *Tujuh Beradik* is common while in the royal town of Klang in Selangor, most of the spirits worshipped are believed to be members of the royal court (sultans, officers, warriors etc.), each with their own unique identity. ## Worship ritual Worshippers usually offer fresh flowers, *sireh* (betelnuts), *rokok daun* (local hand rolled cigarettes), sliced *pinang* (areca nuts) and local fruits. An important part of the praying ritual is also to burn some *kemenyan* (benzoin, made from a local gum tree, when burnt emit a smoky fragrant smell). If their prayers are answered, the worshippers usually return to the shrine and make offerings or hold a *[kenduri](/wiki/Kenduri)* (feast). Another common practise is for individuals to renovate the shrines to create a better looking shrine for the *datuk*. In most places where there is a heavy presence of *datuk* spirits, it is common to see shrines becoming larger over time, especially if individuals consider the *datuk* to be 'powerful'. The *kenduri* items usually consist of yellow saffron rice, lamb or chicken curries, vegetables, *pisang rastali* (bananas), young coconuts, rose syrup, *cherrots* (local cigars) and local fruits. Pork items are considered impure and are therefore forbidden in shrines; visitors are also asked to not show disrespect when inside or around a shrine. ## Literature - M. Kamal Hassan (Editor), Ghazali Bin Basri. \"Religions and Beliefs\" in *Encyclopedia of Malaysia*. Archipelago Press, Singapore. (2006). [ISBN](/wiki/ISBN_(identifier)) 978-981-3018-51-8 - Abdul Wahab Bin Hussein Abdullah. “A Sociological Study of Keramat Beliefs in Singapore”. B.A Honours Academic Exercise, Department of Sociology, National University of Singapore, 2000. - Cheu, Hock Tong. “The Datuk Gong Spirit Cult Movement in Penang: Being and Belonging in Multi-ethnic Malaysia”. Journal of Southeast Asian Studies, vol. 23, no. 1 (September), 381–404. - Cheu, Hock Tong. “Malay keramat, Chinese worshippers: The Sinicization of Malay Keramats in Malaysia”. Seminar paper, Department of Malay Studies, National University of Singapore, 1994. - Cheo, Kim Ban and Muriel Speeden, *Baba Folk Beliefs and Superstitions*. Singapore: Landmark Books, 1998. - Clammer, John ed. *Studies in Chinese folk religion in Singapore and Malaysia*. Singapore: Contributions to Southeast Asian ethnography, 1983. - Elliott, Alan J.A. *Chinese Spirit-Medium cult in Singapore*. Singapore: Donald Moore, 1964. - Lessa, William A. et al., *Reader in Comparative Religion: An Anthropological Approach*. New York, Harper and Row, 1965. - Mohd Taib Osman, *Malay folk beliefs: An integration of disparate elements*. Kuala Lumpur: Dewan Bahasa dan Pustaka, 1989. - Ng, Siew Hua, “The Sam Poh Neo Neo Keramat: A Study of a Baba Chinese Temple”. Contributions to Southeast Asian Ethnography, vol. 25, pt. 1, 1983, 175–177. - [Skeat, W.W.](/wiki/W.W._Skeat) *Malay Magic*. London: MacMillan, 1900. - Tan, Chee Beng. *The Baba of Melaka*. Selangor, Pelanduk Publications, 1988. - Tjandra, Lukas. *Folk religion among the Chinese in Singapore and Malaysia* (Ann Arbour, Michigan: University Microfilms International, 1990), 48. - *The Straits Times*, \"Johor Committee submits report on Houses of Worship,\" 29 Dec 1989. - *The Straits Times*, \"Stop Use of Muslim Signs, Chinese temples Told,\" 25 June 1987. - [Candi of Indonesia](/wiki/Candi_of_Indonesia) - [Chinese folk religion in Southeast Asia](/wiki/Chinese_folk_religion_in_Southeast_Asia) - [Fude Zhengshen](/wiki/Fude_Zhengshen) - [Kejawèn](/wiki/Kejaw%C3%A8n) - [Malaysian folk religion](/wiki/Malaysian_folk_religion) - [Maqam (shrine)](/wiki/Maqam_(shrine)) - [Mazar (mausoleum)](/wiki/Mazar_(mausoleum)) - [Na Tuk Kong](/wiki/Na_Tuk_Kong) - [Silat](/wiki/Silat) - [Tajul muluk](/wiki/Tajul_muluk) - [Tua Pek Kong](/wiki/Tua_Pek_Kong) - National University of Singapore | Socialization and localization: a case study of the Datuk Gong Cult in Malacca - National University of Singapore | Religion and Society in Malacca Portals: - Religion - Islam - Education - Psychology - Art - Architecture\n",
  "language": "en",
  "processed_at": "2026-01-12T10:07:10.083220",
  "title": "Datuk Keramat",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Datuk_Keramat"
}