{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:07:07.779619"
  },
  "content": "Malay titleThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Datuk\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(July 2020)* *(Learn how and when to remove this message)*This article **should specify the language of its non-English content** using {{lang}} or {{langx}}, {{transliteration}} for transliterated languages, and {{IPA}} for phonetic transcriptions, with an appropriate [ISO 639 code](/wiki/Lists_of_ISO_639_codes). Wikipedia's multilingual support templates may also be used. See why. *(October 2020)* **Datuk** (or its variant **Dato'** or **Datu**; literally: *[grandfather](/wiki/Grandfather)*) is a [Malay](/wiki/Malay_language) [honorific](/wiki/Honorific) title commonly used in [Brunei](/wiki/Brunei), [Indonesia](/wiki/Indonesia), and [Malaysia](/wiki/Malaysia), as well as a traditional title by [Minangkabau people](/wiki/Minangkabau_people) in [West Sumatra](/wiki/West_Sumatra), Indonesia. Use of the title various between locations, in some cases being bestowed by a ruler and in other cases being inherited by family line. The title of the wife of a male Datuk is **Datin**. Women with the title can take either the title Datin or Datuk. ## Origin The oldest historical records mentioning about the title *datuk* is the 7th century [Srivijayan](/wiki/Srivijaya) inscriptions such as [Telaga Batu](/wiki/Telaga_Batu_inscription) from [Palembang](/wiki/Palembang), Indonesia, to describe lesser kings or vassalized kings. It was called *dātu* in [Old Malay language](/wiki/Old_Malay_language) to describe regional leader or elder, a kind of [chieftain](/wiki/Chieftain) that rules of a collection of *[kampungs](/wiki/Kampung)* (villages) called [Kedatuan](/wiki/Kedatuan). The Srivijaya empire was described as a network or [mandala](/wiki/Mandala_(Southeast_Asian_history)) that consisted of settlements, villages, and ports each ruled by a datu that vowed their loyalty (*persumpahan*) to the central administration of Srivijayan [Maharaja](/wiki/Maharaja). Unlike the indianized title of [raja](/wiki/Raja) and [maharaja](/wiki/Maharaja), the term datuk was also found in the [Philippines](/wiki/Philippines) as [datu](/wiki/Datu), which suggests its common native [Austronesian](/wiki/Austronesian_language) origin. The term *kadatwan* or *kedaton* refer to the residence of datuk, equivalent with [keraton](/wiki/Keraton) and [istana](/wiki/Palace). In later [Mataram](/wiki/Mataram_Sultanate) Javanese culture, the term kedaton shifted to refer the inner private compound of the keraton, the residential complex of king and royal family. ## Usage ### Title of honours In [Brunei](/wiki/Brunei) and [Malaysia](/wiki/Malaysia), Datuk or Dato is related to each country's [orders](/wiki/Order_(decoration)) (*darjah kebesaran*). In general, it is a title or the prefix of a title given to a person upon being conferred with certain orders of honour. The power to bestow the order, thus the title, lies with the country's [sovereign](/wiki/Sovereign) ([Sultan](/wiki/Sultan_of_Brunei) in Brunei, and [Yang Di-Pertuan Agong](/wiki/Yang_Di-Pertuan_Agong) in Malaysia for federal orders) as well as the ceremonial leaders of the [states of Malaysia](/wiki/States_of_Malaysia) for state orders. The usage of the variant spelling \"Datuk\" and \"Dato\" is differentiated in the following manner: \"Datuk\" is conferred by the Yang di-Pertuan Agong and [Yang di-Pertua Negeri](/wiki/Yang_di-Pertua_Negeri), the non-hereditary Malaysian state leader which is nominated by the state legislature. Meanwhile, \"Dato\" is conferred by a [Sultan](/wiki/Sultan), the royal head of Brunei and some Malaysian states, as well as [Yamtuan Besar](/wiki/Yamtuan_Besar) which is the royal head of the Malaysian state of [Negeri Sembilan](/wiki/Negeri_Sembilan). A woman conferred with the order in her own right may be given with the title in which the word \"Datuk\" or \"Dato\" is replaced with \"Datin\". Nevertheless, a woman may still be given the masculine form of the title. The wife of a man conferred with Datuk or Dato is given the title \"Datin\". However, the husband of a woman who has been given such a title is not given any Datuk-related title. Permission will not be given for a UK citizen to use any title associated with a foreign or Commonwealth award in the UK. Meaning that anyone with the title Datuk or Dato can not be referred to as \"[Sir](/wiki/Sir)\" and can only be referred to by their given title. In 1808 a principal advisor of Sultan Tajuddin of Songkhla in present-day Thailand had an advisor/chancellor by name of Datuk Maharaja. This shows the early use of the title. ### Minangkabau tradition In [Indonesia](/wiki/Indonesia), datuk refers to honorific title of traditional community, especially among [Malay](/wiki/Malay_Indonesian) and [Minangkabau people](/wiki/Minangkabau_people). It is functioned as a title reserved for community leader that deals with traditions and community affairs. In Minangkabau tradition, Datuk (or *Datuak*) is a traditional, honorary title bestowed on a person by the agreement of a people or tribe in the [Minangkabau language](/wiki/Minangkabau_language), spoken by the [Minangkabau people](/wiki/Minangkabau_people). The title of *Datuk* was agreed upon by local, traditional leaders (*Kerapatan Adat Nagari*). The title engenders great respect, and is only used for Minangkabau men who have become stakeholders of traditional leaders or *penghulu* (noblemen) for a particular tribe. When the title is bestowed, it is celebrated with a traditional ceremony (*Malewa Gala*) and a banquet. Unlike other [Malay](/wiki/Malays_(ethnic_group)) traditions, the title of *datuk* in Minangkabau is inherited according to the [matrilineal system](/wiki/Matrilineality). When a *datuk* dies his title may pass to his brother or nephew, whoever is closest in the maternal line. If there is no maternal relative, it may be given to another tribal member with the agreement of the tribe. In the tradition of the [Toba Batak people](/wiki/Toba_Batak_people), a datu is magician-priest who teach divination and magic via his book the [pustaha](/wiki/Pustaha). - [Datu](/wiki/Datu) – Noble title in the pre-Spanish Philippines - [Greater India](/wiki/Greater_India) - [Indian honorifics](/wiki/Indian_honorifics), Indonesian and Malay titles originated from these - [Indosphere](/wiki/Indosphere) - [Malay styles and titles](/wiki/Malay_styles_and_titles#Datuk) - [Princely state](/wiki/Princely_state) - [Principality](/wiki/Principality)\n",
  "language": "en",
  "processed_at": "2026-01-12T10:07:07.779130",
  "title": "Datuk",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Datuk"
}