{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:07:17.097734"
  },
  "content": "Singaporean musician (born 1933)This biography of a living person **needs additional citations for verification**. Please help by adding reliable sources. Contentious material about living persons that is unsourced or poorly sourced **must be removed immediately** from the article and its talk page, especially if potentially libelous. *Find sources:* \"David Lim Kim San\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(July 2025)* *(Learn how and when to remove this message)* **David Lim Kim San** ([Chinese](/wiki/Chinese_language): 林金山, born 7 May 1933) is considered to be one of the architects of music education in Singapore.[*citation needed*] ## Early life and education Lim was born in a [Peranakan](/wiki/Peranakan) and [Methodist](/wiki/Methodist) family. He attended Telok Kurau Primary School and [Victoria School](/wiki/Victoria_School), where he was mentored by Benjamin Khoo and [Paul Abisheganaden](/wiki/Paul_Abisheganaden). ## Career At the [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)) (MOE), Khoo and David Lim started the Combined Schools Choir, which was later renamed the [Singapore Youth Choir](/wiki/Singapore_Youth_Choir) (SYC), in 1964. Lim took control of the SYC in 1968. They also initiated the school band movement and designed the band curriculum for MOE. In 1969, Lim was promoted to head the Music Department in MOE. The number of school bands grew from 4 to 150 within a short period. He pioneered the instrumental teaching programme in primary schools which encouraged the use of instruments in the teaching and learning of music. In 1975, Lim formed the Four Voices vocal quartet with [Yeoh Siew Lian](/wiki/Yeoh_Siew_Lian), Shirley Fleury, and Geoffrey Abisheganaden. Lim was responsible for the formation and training of many junior college choirs. Many are led by former members of the SYC. He retired from MOE in 1996. ## Honours David Lim was the first recipient of the [Cultural Medallion](/wiki/Cultural_Medallion) (Music) in 1979 for his contributions to music to Singapore. - Interview with Eleanor A. L. Tan for the [National Library Board](/wiki/National_Library_Board)\n",
  "language": "en",
  "processed_at": "2026-01-12T10:07:17.097374",
  "title": "David Lim Kim San",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/David_Lim_Kim_San"
}