{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:07:13.245140"
  },
  "content": "Building in Singapore The **David Elias Building** is a building located on the corner of Short Street and [Middle Road](/wiki/Middle_Road,_Singapore) in [Singapore](/wiki/Singapore). It was built by Jewish merchant David J. Elias to house his trading company. ## Description The building is three-storeys tall. At the point where the facade joins the roof, there is a strong projecting concrete slab, which serves as both [cornices](/wiki/Cornice) and eaves. Various [Stars of David](/wiki/Star_of_David) can be found on the external façade of the building as bas-relief decorations. The words “David Elias Buildings” and \"1928\", the year of its completion, are inscribed beneath the Stars of David at the top of each of the building's main frontages. The roof of the building is high-pitched and broad. The building also features arches between pillars, with a covered walkway. ## History The David Elias Building was built on the corner of Short Street and Middle Road by Jewish merchant David J. Elias in 1928 to house his trading company D. J. Elias & Company. Elias commissioned prominent architectural firm [Swan & Maclaren](/wiki/Swan_%26_Maclaren_Architects) to design the building. The initial anchor tenant was [Cold Storage & Co.](/wiki/Cold_Storage_(supermarket)) in one of the company's first ventures outside of [Orchard Road](/wiki/Orchard_Road). From 1941 to 1999, the building housed the Sun Sun Hotel and a bar, which were run by local Chinese. The building is currently being renovated and will serve as the Headquarter of international energy retailer Flo Energy. The building was earmarked for conservation by the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) in 1992, and was gazetted for conservation in 1994. 1°18′06″N 103°51′01″E﻿ / ﻿1.3018°N 103.8503°E﻿ / 1.3018; 103.8503 This article about a Singapore building or structure is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T10:07:13.244637",
  "title": "David Elias Building",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/David_Elias_Building"
}