{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:07:18.677417"
  },
  "content": "American singer **Dawn Xiana Moon** (born August 27, 1983, Singapore) is a Chinese American singer-songwriter and [bellydancer](/wiki/Bellydancer) based in Chicago, Illinois. She is the first musician to blend traditional Chinese music with Americana, pop, and jazz. Moon is also the founder and producer/director of [Raks Geek](/wiki/Raks_Geek), the first bellydance and fire company of its kind. She appeared on Season 14 of *[Britain's Got Talent](/wiki/Britain%27s_Got_Talent)*. She is listed as a musician in the *Encyclopedia of Asian American Folklore and Folklife* and Southern Connecticut State University's list of famous Chinese-Americans. ## Early life Born in Singapore, Moon began studying classical piano at the age 5, the same year her family moved to the United States. Though she was born in Asia, English is her first language. She grew up in Michigan, just outside of Detroit. Throughout high school, she earned recognition at regional competitions for piano, flute and voice. But it wasn't until her first year at the [University of Michigan](/wiki/University_of_Michigan) that she left classical music and started playing the guitar. Two months later, she began writing songs. She moved to Chicago and began collaborating on projects ranging from a commissioned piece for [Alvin Ailey Dance Theatre](/wiki/Alvin_Ailey_Dance_Theatre) to independent films. ## Music Moon's musical style draws influences ranging from traditional Chinese music to modern American [folk](/wiki/Folk_music), from [jazz](/wiki/Jazz) to pop, from minimalism to [Americana](/wiki/Americana_(music)); she strives to bridge the musical traditions of the East and West. Her work incorporates traditional Chinese instruments like the [guzheng](/wiki/Guzheng) and [erhu](/wiki/Erhu); she is also noted for singing in three languages: English, French, and Mandarin Chinese. Encyclopedia of Asian American Folklore and Folklife notes that for Moon and others like her, influences from Western classical music can be traced back to early Chinese court orchestras. She also often writes in odd time signatures like 7/8 and 5/4. The combination of Eastern and Western influences has garnered acclaim in Asia, which sees the music as bringing cultural traditions into the future. She sang the National Anthem for the Chicago Bulls in February 2022. ## Dance Moon's early dance training came from [lindy hop](/wiki/Lindy_hop) and [blues](/wiki/Blues); she fell into [tribal fusion](/wiki/Tribal_fusion) bellydance almost by accident. Moon formed the Raks Geek dance company after a late-night internet search for \"geek bellydance\"; she was disappointed by the artistic and technical proficiency of examples she found. As she was already a professional dancer, she decided to do the topic justice by creating a show by geeks, for geeks (Moon has given talks at [C2E2](/wiki/C2E2), the [University of Chicago](/wiki/University_of_Chicago), and [Chicago Comic Con](/wiki/Chicago_Comic_Con) on issues surrounding women in geek culture, and other members of the group are scientists and organize Chicago geek community gatherings). Once of Moon's missions with Raks Geek is bringing visibility to Asian-Americans in the performing arts – the dance company is majority Asian-American and majority LGBTQIA. They also have a strong social justice mission and partner with local non-profits. Raks Geek also has a non-cosplay project, Raks Inferno, which specializes in fusion bellydance, circus, flow arts, and fire performance. The group has monthly shows in Chicago. She appeared on Season 14 of *[Britain's Got Talent](/wiki/Britain%27s_Got_Talent)* as a bellydancing Chewbacca. ## Trivia Dawn has acting credits in three independent films: *Weapon* (2011), *Detroit Unleaded* (2012), and *Motivational Growth* (2013). Although Moon was born in Singapore, she is a naturalized US citizen. Moon is also a published writer – she's written for *TechCrunch*, *Uncanny Magazine*, *The Learned Fangirl*, and more. One of her essays appears in *Invisible 3*, an anthology about representation in science fiction and fantasy. - Dawn Xiana Moon Official Music Website - Dawn Xiana Moon's Twitter Page - Official Biography on DawnXianaMoon.com - Raks Geek Official Website\n",
  "language": "en",
  "processed_at": "2026-01-12T10:07:18.676916",
  "title": "Dawn Xiana Moon",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Dawn_Xiana_Moon"
}