{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:06:31.749706"
  },
  "content": "Singaporean multinational banking and financial services company **DBS Bank Limited** is a Singaporean [multinational](/wiki/Multinational_corporation) banking and [financial services](/wiki/Financial_services) corporation headquartered at the [Marina Bay Financial Centre](/wiki/Marina_Bay_Financial_Centre) in the [Marina Bay](/wiki/Marina_Bay,_Singapore) district of [Singapore](/wiki/Singapore). The bank was previously known as **The Development Bank of Singapore Limited**, which \"**DBS**\" was derived from, before the present abbreviated name was adopted on 21 July 2003 to reflect its role as a global bank. It is one of the \"Big Three\" local banks in Singapore, along with [Oversea-Chinese Banking Corporation](/wiki/OCBC_Bank) (OCBC) and [United Overseas Bank](/wiki/United_Overseas_Bank) (UOB). DBS is the [largest bank](/wiki/List_of_largest_banks_in_Southeast_Asia) in Southeast Asia by assets and among the largest banks in Asia, with assets totaling [S$](/wiki/Singapore_dollar)739 billion as of 31 December 2023.[update] It also holds market-dominant positions in [consumer banking](/wiki/Retail_banking), [treasury and markets](/wiki/Securities_market), [securities brokerage](/wiki/Broker-dealer), equity and debt fund-raising in other regions aside from Singapore, including in China, Hong Kong, Taiwan and Indonesia. According to *[Asian Private Banker](/wiki/Asian_Private_Banker)* magazine in 2023, DBS replaced [Credit Suisse](/wiki/Credit_Suisse) as the third-largest [private bank](/wiki/Private_banking) in Asia, excluding onshore China, with approximately [US$](/wiki/United_States_dollar)201 billion ([S$](/wiki/Singapore_dollar)271 billion) assets under management. ## Overview Listed on the [Singapore Exchange](/wiki/Singapore_Exchange), DBS was officially incorporated by the [Government of Singapore](/wiki/Government_of_Singapore) on 16 July 1968 to take over the industrial financing responsibilities of the [Economic Development Board](/wiki/Economic_Development_Board) (EDB). DBS's largest and controlling shareholder is [Temasek Holdings](/wiki/Temasek_Holdings), Singapore's second-largest [sovereign wealth fund](/wiki/Sovereign_wealth_fund) after [GIC](/wiki/GIC_Private_Limited). As of 31 March 2023,[update] Temasek owns 29% of DBS shares. The bank's reliable capital position has garnered a \"AA−\" and \"Aa1\" credit ratings by [Standard & Poor's](/wiki/Standard_%26_Poor%27s) and [Moody's](/wiki/Moody%27s), which are among the highest in the Asia-Pacific region, as well as earning the [Global Finance](/wiki/Global_Finance_(magazine))'s \"Safest Bank in Asia\" accolade for fifteen consecutive years, from 2009 to 2023. The bank was also awarded the Best Digital Bank in the World in 2016 by [Euromoney](/wiki/Euromoney). In July 2019, DBS became the first bank in the world to concurrently hold three of the most prestigious global best bank honours from Euromoney, Global Finance and *[The Banker](/wiki/The_Banker)*. DBS has been listed on the [Dow Jones Sustainability Asia Pacific Index](/wiki/Dow_Jones_Sustainability_Indices#DJSI_Asia_Pacific_Index) since 2 October 2018, making it the first bank in Southeast Asia to do so. DBS was one of the first companies in Singapore to be recognised for [gender equality](/wiki/Gender_equality) efforts along with [City Developments Limited](/wiki/City_Developments_Limited) in the first [Bloomberg L.P.](/wiki/Bloomberg_L.P.) Gender-Equality Index (GEI) that was published in 2018. ## History The Development Bank of Singapore Limited was established on 16 July 1968 by the Singapore government to take over the industrial financing responsibilities of the [Economic Development Board](/wiki/Economic_Development_Board) (EDB) and began operations on 1 September 1968. The bank's main function upon its establishment was to finance Singapore’s [industrialisation](/wiki/Industrialisation) and the government’s [urban development](/wiki/Urbanization) projects. Back in 1960, the government invited a [United Nations](/wiki/United_Nations) (UN) industrial survey mission to assess the economic situation in Singapore and to come up with an industrialization programme for the city. The proposal included setting up a development bank, together with an economic body to attract [foreign investments](/wiki/Foreign_direct_investment) to Singapore and also provide industrial financing and management of industrial estates. In April 1968, then [Minister for Finance](/wiki/Ministry_of_Finance_(Singapore)), [Goh Keng Swee](/wiki/Goh_Keng_Swee) revealed the government’s plans to form a development bank with equity participation from the public in order to have greater financing for Singapore’s industrialisation project. The establishment of the DBS marked the first time the [private sector](/wiki/Private_sector) was allowed to fully participate in the financing of [manufacturing](/wiki/Manufacturing) and other industrial projects in Singapore. With a startup capital of S$100 million, share ownership in its first year of operations comprised the following: S$48.6 million by the Singapore government; S$25.9 million by commercial banks; S$7.6 million by insurance companies and other financial institutions; and S$17.9 million by other companies and members of the public. DBS launched its [trademark logo](/wiki/Logo) in 1972. Set against a white backdrop, the mark consisted of a cluster of four inward-pointing red arrows shaped after the [caissons](/wiki/Caisson_(engineering)) of its former headquarters – DBS Building on [Shenton Way](/wiki/Shenton_Way). ### Acquisition of POSB Bank Formerly known as Post Office Savings Bank, it was established on 1 January 1877 at the [General Post Office Building](/wiki/The_Fullerton_Hotel_Singapore) in [Raffles Place](/wiki/Raffles_Place) by the [Straits Settlements](/wiki/Straits_Settlements) government. By 1976, POSB had one million depositors, while deposits crossed the [S$](/wiki/Singapore_dollar)1 billion mark. The bank was then renamed POSBank in 1990, before being acquired by DBS Bank on 16 November 1998 for S$1.6 billion (first announced on 24 July 1998), giving it a dominant market share with over four million customers. The merger was seen to enable POSB to compete better with full-fledged commercial banks, to better serve more sophisticated customers, and in line with the government's call for local banks to merge and create larger and stronger banks to compete internationally. POSB Bank still operates one of the highest numbers of bank branches in Singapore, especially in the heartlands, and operates the highest number of ATM outlets throughout the country. The integration of both banks allowed customers of either bank to share the facilities; DBS Bank depositors may use the Cash Deposit Machine installed islandwide in POSBank branches, likewise for POSB Bank depositors. ### The Islamic Bank of Asia (2007 – 2015) DBS Bank launched The Islamic Bank of Asia (IB Asia) on 7 May 2007, after receiving official approval from the [Monetary Authority of Singapore](/wiki/Monetary_Authority_of_Singapore) for a full bank licence. IB Asia's founding shareholders include majority stakeholder DBS and 34 Middle Eastern investors from prominent families and industrial groups from [Gulf Cooperation Council](/wiki/Gulf_Cooperation_Council) (GCC) countries. On 14 September 2015, DBS Bank announced that it will progressively cease IB Asia as it was not able to achieve [economies of scale](/wiki/Economies_of_scale) when operated as a single entity. The process was estimated to *take* about 2 to 3 years. DBS stated that it would be developing its own [Islamic compliant banking products](/wiki/Islamic_banking_and_finance) instead. ### DBS iB Secure Device and Internet banking (2006 – present) Starting in late 2006, the bank began releasing to its [Internet banking](/wiki/Internet_banking) customers a [Dual Factor Authentication](/wiki/Dual_Factor_Authentication) device to assist in thwarting [phishing](/wiki/Phishing) attacks. The DBS iB Secure Device is a hardware device with a key fob form factor that generates a [password](/wiki/Password) that is linked to the log-on name. The password changes every sixty seconds and once used is no longer valid. The institution Code for DBS is 7171. In 2012, DBS introduced a New Generation IB Secure Device as part of the financial industry-wide initiative for an even safer online banking experience. The device has stronger authentication capabilities and provides users with an extra layer of security against potential fraudulent activities and threats. DBS had a total of 2.4 million [Internet banking](/wiki/Internet_banking) users in Singapore as of 2013. ### Digital banking (2010 – present) On 15 April 2010, DBS Bank launched digibank to both DBS and POSB customers. It allows customers to view their banking and credit card accounts, transfer funds and pay bills via their mobile phones. Customers using digibank will be protected by DBS Bank's 'money-safe' guarantee. The bank promised reimbursements if were are any unauthorised transactions. As of 2013, there were 839,000 digibank users in Singapore. In 2014, DBS released its mobile wallet service named PayLah!, which garnered more than 100,000 users less than two months after its launch in Singapore. As of 2018, PayLah! had more than 1 million users. In 2014, CEO Piyush Gupta and his leadership team launched a digital transformation programme intended to \"Make Banking Joyful\". Under this programme, the bank would consider itself \"a technology company delivering banking services\" and benchmark its progress against leading technology companies and aim to be the \"D\" in the acronym GANDALF, alongside [Google](/wiki/Google), [Amazon](/wiki/Amazon_(company)), [Netflix](/wiki/Netflix), [Apple](/wiki/Apple_Inc.), [LinkedIn](/wiki/LinkedIn), and [Facebook](/wiki/Facebook). In 2016 and 2018, the [Euromoney magazine](/wiki/Euromoney) named DBS the world's best digital bank and the world's best small and medium-size enterprise bank. ### Digital banking disruptions (2023) On 29 March 2023, DBS experienced a service outage that prevented users from using its digital banking services, including its mobile app and PayLah! app, from about 8.30am until about 5.45pm. The [Monetary Authority of Singapore](/wiki/Monetary_Authority_of_Singapore) (MAS) stated that the disruption was \"unacceptable\" and that the bank had fallen short of MAS's expectations that the bank would maintain \"high system availability and ensure its IT systems are recovered expeditiously\". The regulator stated that it would \"take the commensurate supervisory actions against DBS after gathering the necessary facts\". At the bank's annual general meeting held on 31 March 2023, CEO Piyush Gupta apologised for the service outage that had occurred earlier in the month. Chairman Peter Seah announced that a special board committee had been set up to investigate the incident and that external experts would be brought in to assist the bank. On 5 May 2023, DBS's online banking and payment services, as well as its ATM services, were disrupted from about noon until about 3.10pm. The disruption affected the bank's PayLah! service as well as the 'paywave' feature on credit and debit cards. Following the incident, the MAS imposed additional capital requirements on DBS, requiring it to apply a multiplier of 1.8 times to its risk-weighted assets for operational risk, such that its total additional regulatory capital would need to amount to approximately S$1.6 billion. On 14 October 2023, DBS suffered a service disruption that affected its digital banking services, including its online banking and payment services as well as its ATM services. The disruption lasted from began from 3pm and lasted for at least several hours. At 10.10pm, DBS announced that all ATMs were back up and running, although some digital services, such as digital banking and its PayLah! service continued to be disrupted. On 1 November 2023, in response to the incidents, the MAS imposed restrictions on DBS: prohibiting it from acquiring any new business ventures and requiring it to pause all non-essential IT changes for 6 months. DBS was also prohibited from reducing the size of its branch and ATM networks in Singapore. CEO Piyush Gupta apologised for the disruption and stated that the bank will set aside a special budget of S$80 million to enhance system resiliency. According to CEO Piyush Gupta, four out of five of the bank's major disruptions in 2023 were related to software bugs, and further that \"in at least two or three of these incidents, the bug was so deep that we wouldn't be able to pick it up\". He also cited \"working from home\" as a possible cause for these software bugs and said that the bank intended to improve the depth of its engineering team. DBS has set aside a special budget of S$80 million to enhance system resiliency and hopes to have a more robust recovery process in place by the end of Q1 2024. ### Partnership with Crypto.com In December 2025, DBS entered into a partnership with [Crypto.com](/wiki/Crypto.com) which will allow Crypto.com users to deposit and withdraw Singapore Dollars and US Dollars via DBS. The cryptocurrency exchange platform will also be allowed to set up client money accounts for its customers. ### Recent History On December 22, 2025, DBS won the Bank of the Year Global award, in recognition of the institution’s decade-long transformation. The event took place at [The Peninsula London](/wiki/The_Peninsula_London). ## Senior leadership - *Chairman:* Peter Seah (since May 2010) - *Chief Executive:* [Tan Su Shan](/wiki/Tan_Su_Shan) (since March 2025) ### List of former chairmen 1. [Hon Sui Sen](/wiki/Hon_Sui_Sen) (1968–1970) 2. [Howe Yoon Chong](/wiki/Howe_Yoon_Chong) (1970–1979) 3. [J. Y. Pillay](/wiki/J._Y._Pillay) (1979–1985) 4. [Howe Yoon Chong](/wiki/Howe_Yoon_Chong) (1985–1990) 5. Ngiam Tong Dow (1990–1998) 6. [S. Dhanabalan](/wiki/S._Dhanabalan) (1999–2005) 7. [Koh Boon Hwee](/wiki/Koh_Boon_Hwee) (2006–2010) ### List of former CEOs 1. Patrick Yeoh Khwai Hoh (1993–1995) 2. John Olds (1998–2001) 3. Philippe Paillart (2001–2002) 4. Jackson Tai (2002–2007) 5. Richard Stanley (2008–2009) 6. [Piyush Gupta](/wiki/Piyush_Gupta) (2009–2025) ## Shareholders The ten largest shareholders as of 10 February 2023 are: Name of ShareholdersNo. of Shareholdings%*1.Citibank Nominees Singapore Pte Ltd506,573,08819.682.Maju Holdings Pte Ltd458,899,86917.833.DBSN Services Pte Ltd304,505,69711.834.[Temasek Holdings](/wiki/Temasek_Holdings) (Private) Ltd284,145,30111.045.RAFFLES NOMINEES (PTE) LIMITED229,954,9788.946.HSBC (Singapore) Nominees Pte Ltd224,771,5778.737.DBS NOMINEES PTE LTD174,360,7626.778.BPSS Nominees Singapore (Pte) Ltd26,200,1711.029.Lee Foundation11,512,8130.4510.DBS VICKERS SECURITIES (SINGAPORE) PTE LTD11,380,0660.44 ** Percentage is calculated based on the total number of issued ordinary shares, excluding treasury shares* [Temasek Holdings (Pte) Ltd](/wiki/Temasek_Holdings), a company wholly owned by the Ministry of Finance, is deemed to be interested in all the ordinary shares held by Maju. In addition, Temasek is deemed to be interested in 4,449,781 ordinary shares in which its other subsidiaries and associated companies have or are deemed to have an interest pursuant to Section 4 of the Securities and Futures Act, Chapter 289. ## International operations DBS Bank has branches and offices in [Australia](/wiki/Australia), [China](/wiki/China), [Hong Kong](/wiki/Hong_Kong), [India](/wiki/India), [Indonesia](/wiki/Indonesia), [Japan](/wiki/Japan), [South Korea](/wiki/South_Korea), [Malaysia](/wiki/Malaysia), [Myanmar](/wiki/Myanmar), the [Philippines](/wiki/Philippines), [Taiwan](/wiki/Taiwan), [Thailand](/wiki/Thailand), the [United Arab Emirates](/wiki/United_Arab_Emirates), the [United Kingdom](/wiki/United_Kingdom), the [United States](/wiki/United_States) and [Vietnam](/wiki/Vietnam). ### China Strategically located in the key trade and financial hubs of mainland [China](/wiki/China), DBS has a network of full service branches in Beijing, Guangzhou, Shanghai, Shenzhen, Suzhou, Tianjin, Dongguan, Nanning and Hangzhou; and representative offices in Fuzhou which provide a comprehensive range of commercial and corporate banking services. In December 2006, DBS Bank received approval from the [China Banking Regulatory Commission](/wiki/China_Banking_Regulatory_Commission) (CBRC) to prepare for local incorporation in Mainland China. DBS is the only Singapore bank among nine foreign banks to receive this approval. In 2010, it also became the first Singapore bank to issue [UnionPay](/wiki/UnionPay) debit cards in mainland China. ### Hong Kong DBS started its operations in Hong Kong in 1999 by acquiring [Kwong On Bank](/wiki/Kwong_On_Bank) from Leung's family & Japanese-based [Fuji Bank](/wiki/Fuji_Bank), and renamed it as [DBS Kwong On Bank Limited](/wiki/DBS_Kwong_On_Bank_Limited). It acquired [Dao Heng Bank](/wiki/Dao_Heng_Bank) (and its subsidiary [Overseas Trust Bank](/wiki/Overseas_Trust_Bank)) in 2001. The three banks were later merged under the trading name of [DBS Bank (Hong Kong) Limited](/wiki/DBS_Bank_(Hong_Kong)_Limited). ### India DBS has been present in India for 30 years, opening its first office in [Mumbai](/wiki/Mumbai) in 1994. DBS Bank India Limited is the first among the large foreign banks in India to start operating as a wholly owned, locally incorporated subsidiary of a leading global bank. The bank now has a network of 530+ branches across 19 states in India with presence in cities such as [Bengaluru](/wiki/Bengaluru), [Chennai](/wiki/Chennai), [Cuddalore](/wiki/Cuddalore), [Calicut](/wiki/Calicut), [Thiruvananthapuram](/wiki/Thiruvananthapuram), [Kochi](/wiki/Kochi), [Hyderabad](/wiki/Hyderabad), [Kolhapur](/wiki/Kolhapur), [Kolkata](/wiki/Kolkata), [Coimbatore](/wiki/Coimbatore), [Moradabad](/wiki/Moradabad), [Indore](/wiki/Indore), [Mumbai](/wiki/Mumbai) ([Andheri](/wiki/Andheri), [Nariman Point](/wiki/Nariman_Point)), [Nashik](/wiki/Nashik), [New Delhi](/wiki/New_Delhi), [Noida](/wiki/Noida), [Gurugram](/wiki/Gurugram), [Pune](/wiki/Pune), [Salem](/wiki/Salem,_Tamil_Nadu), [Surat](/wiki/Surat) and [Vadodara](/wiki/Vadodara). On 17 November 2020, [Reserve Bank of India](/wiki/Reserve_Bank_of_India) instructed [Lakshmi Vilas Bank](/wiki/Lakshmi_Vilas_Bank) (LVB) to be merged with DBS Bank India Limited after LVB having placed under moratorium for 30 days. ### Indonesia DBS has a 99%-owned subsidiary, **PT Bank DBS Indonesia**, with 39 branches and sub-branches in 11 cities. On 2 April 2012, DBS announced that it was planning to buy over a majority stake in [Bank Danamon](/wiki/Bank_Danamon) from Temasek Holdings. Initial reactions to the proposed purchase in Indonesia were cautious with most commentators saying that the deal was expected to be approved but that government regulators would doubtless wish to look at some of the details, including reciprocity from Singapore policy makers, quite closely before making a final decision. On 31 July 2013, DBS announced that it had allowed the Bank Danamon bid to lapse, but that they remained committed to Indonesia and will continue to invest and grow the franchise. ### Taiwan DBS first established a presence in Taiwan in 1983. In May 2008, DBS integrated Taiwan's Bowa Bank into its operations after acquiring the \"good bank assets\" in February. There are 40 distribution outlets across the country, half of which are based in [Taipei](/wiki/Taipei). In January 2022, DBS announced the acquisition of [Citigroup](/wiki/Citigroup)’s consumer banking business in Taiwan, paying a premium of [S$](/wiki/Singapore_dollar)930 million ([NT$](/wiki/New_Taiwan_dollar)22 billion) at the close of the deal. After completing the acquisition on 14 August 2023, DBS became the largest foreign bank by assets in Taiwan. ## Controversies ### 1Malaysia Development Berhad fund fiasco In October 2016, the [Monetary Authority of Singapore](/wiki/Monetary_Authority_of_Singapore) (MAS) imposed financial penalties amounting to [S$](/wiki/Singapore_dollar)1 million on DBS for 10 breaches of anti-[money laundering](/wiki/Money_laundering) requirements and control lapses in relation to [Malaysia](/wiki/Malaysia)’s scandal-tainted [1Malaysia Development Berhad](/wiki/1Malaysia_Development_Berhad) (1MDB) related fund flows. ### Wirecard scandal In June 2023, DBS was fined [S$](/wiki/Singapore_dollar)2.6 million by the Monetary Authority of Singapore (MAS) for breaching anti-money laundering and countering the financing of terrorism requirements, in a matter related to the [German](/wiki/Germany) payments provider [Wirecard](/wiki/Wirecard) scandal between July 2015 and February 2020, in relation to the accounts of 11 corporate customers. DBS had failed to maintain relevant and up-to-date [due diligence](/wiki/Due_diligence) information on the customers’ [beneficial ownerships](/wiki/Beneficial_ownership), and to update their risk ratings for [money laundering](/wiki/Money_laundering) and [terrorism financing](/wiki/Terrorism_financing). The bank also failed to adequately establish the source of wealth of higher-risk customers and their beneficial owners. In addition, it did not adequately inquire into the background and purpose of unusually large transactions that were not consistent with its knowledge of the customers, or had no apparent economic purpose. ### HKMA fine (2024) On 5 July 2024, DBS Bank (Hong Kong) Limited was fined [HK$](/wiki/Hong_Kong_dollar)10 million ([S$](/wiki/Singapore_dollar)1.73 million) by [Hong Kong Monetary Authority](/wiki/Hong_Kong_Monetary_Authority) (HKMA) for lapses in adhering to anti-money laundering and counter-terrorist financing regulations. DBS Bank (Hong Kong) failed to continuously monitor [business relationships](/wiki/Business_relationship_management) and conduct enhanced due diligence in high risk situations. The bank also failed to keep records on some of its customers. Portals: - Companies - Banks - Business and economics - Singapore\n",
  "language": "en",
  "processed_at": "2026-01-12T10:06:31.749288",
  "title": "DBS Bank",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/DBS_Bank"
}