{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:07:21.593032"
  },
  "content": "LGBT media website in SingaporeThis article **contains promotional content**. Please help improve it by removing promotional language and inappropriate external links, and by adding encyclopedic text written from a neutral point of view. *(September 2023)* *(Learn how and when to remove this message)* **Dear Straight People** is an LGBT media platform based in Singapore. Founded in 2015, Dear Straight People has gained prominence as one of Asia's leading LGBT publications. ## History This section **does not cite any sources**. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed. *(September 2025)* *(Learn how and when to remove this message)* Founded by [Sean Foo](/wiki/Sean_Foo) in July 2015, Dear Straight People initially gained attention for publishing [coming out](/wiki/Coming_out) stories, which included notable public figures such as Paralympic medalist [Theresa Goh](/wiki/Theresa_Goh), influencer [Edison Fan](/wiki/Edison_Fan), actor [Steven David Lim](/wiki/Steven_David_Lim), actress [Deborah Sim](/wiki/Deborah_Sim) and the host of [Drag Race Thailand](/wiki/Drag_Race_Thailand), [Pangina Heals](/wiki/Pangina_Heals). ## Collaborations Dear Straight People has collaborated with various LGBTQ+ organizations and groups over the years. Notable collaborations include partnerships with the LGBTQ+ counseling center Oogachaga and the [sex workers' rights](/wiki/Sex_workers%27_rights) group Project X, aimed at raising funds and awareness for their respective missions. Additionally, the platform has actively engaged in collaborations with companies to support Pride campaigns. In 2021, Dear Straight People partnered with Naumi Hotel Singapore to produce a pride campaign featuring a real-life married gay couple. The campaign was noted for being the 'first time a hotel in Singapore has done such a high-profile paid partnership with an LGBTQ+ couple'. ## Notable productions In 2017, Dear Straight People produced a music video for an LGBT cover of the [Kit Chan](/wiki/Kit_Chan) song [Home](/wiki/Home_(Kit_Chan_song)), performed by bisexual singer Lew Loh, which garnered attention and sparked discussions in Singapore. Later that year, Dear Straight People organized a photo shoot called #Reasons4Repeal in support of the repeal of [Section 377A](/wiki/Section_377A_of_the_Penal_Code_(Singapore)). The photo shoot featured over 70 individuals, including former [Mediacorp](/wiki/Mediacorp) actor [Julian Hee](/wiki/Julian_Hee). In 2019, the platform produced the documentary series \"Same Love,\" consisting of three episodes showcasing same-sex couples in Singapore. The series premiered on \"Dear Straight People's\" YouTube channel on February 11, 2019. The first episode, featuring an openly gay Malay couple with an accepting mother, gained widespread attention and sparked controversy in Malaysia. ### Getaway In 2022, Dear Straight People produced *[Getaway](/wiki/Getaway_(web_series))*, which made history as Singapore's first gay [Boys Love](/wiki/Boys_Love) web drama series. Comprising 5 episodes, Getaway featured an openly queer cast from Singapore and Thailand. Getaway was a hit, with its first episode garnering over 4 million views on YouTube to date. In addition, the series was nominated for Content of the Year at the 2023 edition of Singapore's national broadcaster Mediacorp's content creator awards, The Pinwheels. Following Getaway's popular reception, Taiwan-based LGBT streaming service [GagaOOLala](/wiki/GagaOOLala) purchased the rights to stream the series on their platform. On 28 September 2023, Getaway premiered on GagaOOLala. ### The Unfiltered Gay Podcast On 17 April 2024, Dear Straight People launched The Unfiltered Gay Podcast, a talk show hosted by [Sean Foo](/wiki/Sean_Foo), Isaac Tng, Kieran Cheang and Aiman Haikal. Over its first three seasons, the Unfiltered Gay Podcast featured several notable guests, including television host [Allan Wu](/wiki/Allan_Wu) and former professional footballer [Thomas Beattie (footballer)](/wiki/Thomas_Beattie_(footballer)). In 2025, the podcast won Most Social Good Video at Mediacorp's content creator awards, The Pinwheels, for the episode “The Raw Truth About Bareback Sex.” Produced in collaboration with Gayhealth.sg and Action for AIDS (AFA), the episode aimed to deliver safe-sex education in a format that was both honest and entertaining. ## Awards and nominations OrganisationYearCategoryNominated workResultRefThe Pinwheels2023Content of the Year*Getaway*NominatedThe Pinwheels2025Most Social Good Video\"The Raw Truth About Bareback Sex\" (*The Unfiltered Gay Podcast*)Won Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T10:07:21.592529",
  "title": "Dear Straight People",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Dear_Straight_People"
}