{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:07:22.971422"
  },
  "content": "Aspect of society and culture **Deaths in Singapore** offset the population increase from live births. In 2007, 17,140 people in [Singapore](/wiki/Singapore) [died](/wiki/Death) from various causes. The [death rate](/wiki/Death_rate) was 4.5 deaths per 1,000 of the population. There are strict regulations surrounding death and treatment of the body after death. ## Legal definition of death Under section 2A of the Interpretation Act, a person is considered as having died when there is either irreversible cessation of [circulation of blood](/wiki/Circulatory_system) and [respiration](/wiki/Respiratory_system), or total and irreversible cessation of all functions of the [brain](/wiki/Brain). Irreversible cessation of the blood circulation and respiration is determined according to ordinary standards of current medical practice, while [total and irreversible cessation of all brain functions](/wiki/Brain_death) is made in accordance with the following criteria: - **Conditions to be satisfied before determining irreversible cessation of all brain functions**. Before tests are carried out to determine if all the functions of a person's brain have irreversibly ceased, the following conditions must be satisfied: - the person's condition must undoubtedly be due to irremediable structural [brain damage](/wiki/Brain_damage) and the [diagnosis](/wiki/Diagnosis) of any disorder which can lead to the irreversible cessation of all functions of the person's brain must be fully established; - there must be no suspicion that the person's condition is due to [depressant drugs](/wiki/Depressant), [hypothermia](/wiki/Hypothermia) or [metabolic](/wiki/Metabolism) and [endocrine](/wiki/Endocrine_system) factors; and - the person's cessation of spontaneous respiration is not caused by [neuromuscular blocking agents](/wiki/Neuromuscular-blocking_drug) or other drugs. - **Criteria for determining irreversible cessation of all brain functions**. To determine the irreversible cessation of all functions of the brain of a person, tests must be carried out with the result that: - the [pupils](/wiki/Pupil) are fixed and non-reactive to strong light; - there is no [corneal reflex](/wiki/Corneal_reflex); - there is no spontaneous [motor response](/wiki/Motor_system) to painful [stimulus](/wiki/Stimulus_(physiology)), excluding [spinal reflexes](/wiki/Tendon_reflex); - there is no [oculocephalic reflex](/wiki/Vestibulo-ocular_reflex); - there is no [gag reflex](/wiki/Pharyngeal_reflex) or reflex response to [tracheobronchial](/wiki/Tracheobronchial_tree) stimulation; - there is no [vestibulo-ocular response](/wiki/Vestibulo-ocular_reflex) on instillation of 50 cc of ice-cold water into each ear; and - there is no spontaneous respiration even with [carbon dioxide](/wiki/Carbon_dioxide) tension at 50 mm or more of mercury. Where there is still a corneal reflex or spontaneous motor response to painful stimulus but all other criteria are satisfied, or where any of the criteria cannot be performed but the remaining criteria are satisfied, the irreversible cessation of all brain functions can be determined by a combination of the criteria that have been satisfied and the performance of a supplementary test. These tests are [cerebral](/wiki/Cerebrum) [angiography](/wiki/Angiography) to confirm that there is no intra[cranial](/wiki/Human_cranium) blood flow, and a [radionuclide scan](/wiki/Radionuclide_cisternogram) to confirm that there is no intracranial [perfusion](/wiki/Perfusion). In addition, the Interpretation Act sets out other safeguards for the determination of death: - **Cases where organ to be removed for transplant**. Where an [organ](/wiki/Organ_(anatomy)) is to be removed for a [transplant](/wiki/Organ_transplant) pursuant to the Human Organ Transplant Act or the [Medical (Therapy, Education and Research) Act](/wiki/Medical_(Therapy,_Education_and_Research)_Act), from the body of a deceased person, the death must be certified by two medical practitioners: - who have not been involved in the care or treatment of the person; - who do not belong to the team of medical practitioners which will remove the organ from the body; - who have not been involved in selecting the proposed recipient of the organ; and - who will not be involved in the care or treatment of the proposed recipient during his or her hospitalization for the transplant. Where the death was due to total and irreversible cessation of all brain functions, the two medical practitioners certifying the death must also possess certain prescribed postgraduate medical qualifications. - **Other cases**. In other cases, the determination of the total and irreversible cessation of all brain functions of a person must be certified by two medical practitioners who possess the prescribed postgraduate medical qualifications. At least one of them must not have been involved in the care or treatment of the deceased person. ### Presumption of death of missing persons When the question of whether a person is alive or dead arises, and it is shown that he was alive within 30 years, the [burden of proving](/wiki/Legal_burden_of_proof) that he or she is dead lies on the person who affirms it. However, if it is proved that he or she has not been heard of for seven years by those who would naturally have heard of the person if he or she had been alive, the burden of proving that the person is alive shifts to the person who affirms this. Any married person who alleges that reasonable grounds exist for supposing that the other party to the marriage is dead may apply to court to have it presumed that the other party is dead and to have the marriage dissolved. If the court is satisfied that such reasonable grounds exist, it may make an interim judgment of presumption of death and of divorce. In such proceedings, the fact that for seven years or more the other party to the marriage has been continually absent from the applicant, and the applicant has no reason to believe that the other party has been living within that time, is evidence that the missing person is dead until the contrary is proved. ## Causes of death As of 2017, the top 10 causes of death in Singapore were those set out in the table below: RankCause of death% of total deaths1[Cancer](/wiki/Cancer)29.12[Pneumonia](/wiki/Pneumonia)20.13[Ischaemic heart diseases](/wiki/Ischaemic_heart_diseases)18.54[Cerebrovascular disease](/wiki/Cerebrovascular_disease) (including [stroke](/wiki/Stroke))6.35External causes of morbidity and mortality4.06Hypertensive diseases (including hypertensive heart disease)3.47[Nephritis](/wiki/Nephritis), [nephrotic syndrome](/wiki/Nephrotic_syndrome) and [nephrosis](/wiki/Nephrosis)2.48[Urinary tract infection](/wiki/Urinary_tract_infection)1.99Other [heart diseases](/wiki/Heart_disease)1.910[Diabetes mellitus](/wiki/Diabetes_mellitus)1.510[Chronic obstructive lung disease](/wiki/Chronic_obstructive_pulmonary_disease)1.5 ### Capital punishment [Capital punishment](/wiki/Capital_punishment) is legal in Singapore. The number of judicial executions has fluctuated widely depending on crime rates; at its highest point, according to unofficial statistics compiled by [Amnesty International](/wiki/Amnesty_International), about 408 people were hanged between 1991 and 2003; at its lowest point in 2010, none were executed. Between 2004 and 2011, the number of executions varied between none and 10. [Hanging](/wiki/Hanging), which is used for all executions and are carried out in [Changi Prison](/wiki/Changi_Prison) on Fridays at dawn, are by the long drop method, which severs the spinal cord. ### Suicide [Suicide](/wiki/Suicide) is a significant non-medical cause of death in Singapore. Attempted suicide was an offence punishable with jail under section 309 of the [Penal Code](/wiki/Penal_Code_(Singapore)). However, on 6 May 2019, the law was amended to decriminalise suicide. Between 2000 and 2004, 1,700 people killed themselves, and in 2007 suicides amounted to about 2.2% of all deaths. For every suicide, there were seven non-fatal attempts. It was reported in 2006 that suicide was one of the top causes of death of Singapore youths. In 2001, five children younger than 15 years took their lives, and 37 people between the ages of 15 and 25 did so. ## Treatment of the body after death When a person dies, a doctor will certify the cause of death if it is known and due to [natural causes](/wiki/Death_by_natural_causes). He or she will then fill up a certificate of cause of death (CCOD) which will be given to the family of the deceased. If the doctor is unable to determine the cause of death, or the death is due to non-natural causes, the Criminal Procedure Code requires him to refer the case to the [police](/wiki/Singapore_Police_Force). The police will provide a [hearse](/wiki/Hearse) to send the body to the [Centre for Forensic Medicine](/wiki/Centre_for_Forensic_Medicine) (CFM) [Mortuary](/wiki/Mortuary) at Block 9 of the [Singapore General Hospital](/wiki/Singapore_General_Hospital), which will then inform the family when to visit the mortuary. At the CFM Mortuary, the family will view and identify the body of the deceased in the presence of a [coroner](/wiki/Coroner), who reviews the case and determines if an [autopsy](/wiki/Autopsy) is required. The family will be informed of the coroner's decision and the time to claim the body for the funeral by the investigation officer. If an autopsy is conducted and reveals that the death is unnatural, the police will conduct further investigations into the cause of death with the family's assistance. Once the investigations are complete, the family will be told to attend a coroner's inquiry at the [Subordinate Courts](/wiki/Subordinate_Courts_of_Singapore). Only after that will they be able to claim the body. If the coroner decides that no autopsy is needed or if the cause of death is deemed to be natural and no foul play is suspected, the investigation officer will inform the family members to head down to collect the body. However, do take note that as there is only one location for the claiming of bodies for all autopsy cases, there might be a waiting time at the hospital itself. After the family obtains the CCOD, they usually engage a [funeral director](/wiki/Funeral_director) (also known as an undertaker) who collects the body, [embalms](/wiki/Embalming) it if necessary, and delivers it to the [wake](/wiki/Wake_(ceremony)). In addition, they have to decide whether the body is to be [cremated](/wiki/Cremation) or [buried](/wiki/Burial), and register the death. The funeral director also helps to make arrangements for the wake and [funeral](/wiki/Funeral), according to the religious beliefs and wishes of the family. ### Registration of death When a person dies in a house, the death must be notified to the authorities within 24 hours by the occupier of the house in which to his or her knowledge the death took place, the relatives of the deceased present at his or her death or in attendance during the last illness of the deceased, or each person present at the death. If those persons fail to do so, another inmate of the house or the person causing the body of the deceased person to be buried. When a person dies in a place which is not a house, or a dead body is found elsewhere than in a house, every relative of the deceased person having knowledge of any particulars required to be registered concerning the death, and every person present at the death, and every person taking charge of the body, and, if the death occurs in a ship or vessel the master or other person having charge of the ship or vessel, and the person causing the body to be buried must, within 24 hours after the death or finding of the body, give to the authorities such information that the informant has concerning the death that is required to be registered. ### Burial The [Choa Chu Kang Cemetery Complex](/wiki/Choa_Chu_Kang_Cemetery) is the only cemetery in Singapore still accepting burials. Others, such as [Bidadari Cemetery](/wiki/Bidadari_Cemetery), have made way for redevelopment. Burials cost up to [S$](/wiki/Singapore_dollar)420 for children and $940 for adults. The complex is divided into cemeteries according to religion, and includes the [Parsi](/wiki/Parsi_people), [Jewish](/wiki/Jew) and [Christian](/wiki/Christianity) cemeteries. On 1 November 1998, the NEA implemented a policy to limit the burial period of all graves to 15 years, due to a shortage of space in the cemeteries. After being buried for 15 years, graves are exhumed and the remains removed. If the religion of the deceased permits cremation, the exhumed remains are cremated and stored in government columbaria niches; otherwise, the remains are re-buried in smaller individual plots. From 2017 onwards, as part of the expansion plans for [Tengah Air Base](/wiki/Tengah_Air_Base), the cemetery will be reduced in size from 318ha to 100ha with around 80,500 Chinese and Muslim graves being exhumed. ### Cremation #### History In the days of British rule, the number of Chinese burial grounds in Singapore increased very rapidly and the colonial government had little power to control burial spaces because it did not possess sanctions of sufficient strength. Clan associations met all the physical and social needs of the Chinese majority, and the result was the creation of segmented Chinese immigrant communities separated by kinship ties and operating independently of the state, each conducting their own death rites and running their own cemeteries. The local authorities began to view these cemeteries as hazardous sources of disease-causing vectors such as mosquitoes, as well as a form of land waste. There were urgent demands on space in land-scarce Singapore in the name of national development. In the words of [E. W. Barker](/wiki/E._W._Barker), then the minister for law, environment, science and technology, \"The needs of Singapore's young population must require the use of sterilised land, for the economic and social good of all citizens of Singapore.\" In the 1965 Master Plan, which was designed to guide land-use development in Singapore, cemeteries were identified as land \"considered available for development\", and cremation was mooted as a viable option to deal with the exhumed bodies from these burial grounds, and as a way to dispose of people who died. To encourage the population to adopt this relatively new way of treating the dead, the state employed the help of \"funerary middlemen\" who could erode the distrust of cremation because they were respected for their knowledge of death rites and disposal. In addition, the rallying cries of national development, the common good, and the country's future were used to encourage the populace to take up the idea of cremation and to abandon their insistence of traditional burial grounds. In 1972, the state made it clear that it would close all cemeteries near and around the city area to \"conserve land\". State power over cemeteries was considerably strengthened by an alteration in the law allowing the public commissioner to \"close cemeteries without assigning reasons for doing so\". As an alternative means of managing the disposal of the dead, the state offered burial space at a state-owned [public cemetery complex at Choa Chu Kang](/wiki/Choa_Chu_Kang_Cemetery), although it made it clear that it considered cremation as the only viable long-term option. As various academics have pointed out, the clearance of ethnic burial grounds served more than a practical purpose as it signified the transferring of power from clan- and ethnic-based associations, which had previously run these burial grounds, to state organizations. #### Crematoria and columbaria The [earliest government crematorium](/wiki/Mount_Vernon_Columbarium), situated at [Mount Vernon](/wiki/Mount_Vernon,_Singapore), began operations in 1962 with only one funeral service hall and about four cremations a week. By 1995, it had three service halls and was averaging 21 cremations a day, with operations beginning every day at 9:00 am with cremations scheduled at 45-minute intervals until about 6:00 or 7:00 pm. The site includes a columbarium built in several phases, comprising niches arranged in numbered blocks which either feature Chinese-style green roofs, or housed within a nine-storey [pagoda](/wiki/Pagoda)-style building. There also exists a two-storey \"church-style\" building. Towards the end of the 1970s, the Mount Vernon complex, which was initially intended for the storage of ashes from recent deaths, could no longer cope with the scale of exhumation projects fuelling the demand for columbarium niches. Another crematorium and columbarium complex was built at [Mandai](/wiki/Mandai), and this commenced operations in 1982, equipped with eight small and four medium-sized cremators and a total of 64,370 niches for the storage of cremated remains. Chinese voluntary associations such as Pek San Theng were allowed to build columbaria to house the remains of those exhumed from clan-owned cemeteries, and temples and churches were allowed to accommodate cremated remains. Mount Vernon Crematorium ceased operations on 30 June 2004. The Mount Vernon columbarium complex was closed on 30 September 2018 as part of plans to build the [Bidadari Estate](/wiki/Bidadari,_Singapore), a housing estate, on the site of the nearby former Bidadari Cemetery. #### Present After a body is cremated, the family of the deceased can store the ashes at home or in a [columbarium](/wiki/Columbarium), or scatter them in the sea or at a specially built garden. There are three crematoria in Singapore. The Mandai Crematorium, the only government facility, is now operated by the [National Environment Agency](/wiki/National_Environment_Agency). The other two crematoria are privately operated; one is in the [Kong Meng San Phor Kark See Monastery](/wiki/Kong_Meng_San_Phor_Kark_See_Temple) at Bright Hill Drive, [Bishan](/wiki/Bishan,_Singapore), and the other is in Tse Toh Aum Temple at Sin Ming Drive. Currently, sea burial can be done by scattering the ashes of the deceased in the sea at about 1.5 [nautical miles](/wiki/Nautical_mile) (2.8 [km](/wiki/Kilometre); 1.7 [mi](/wiki/Mile)) south of [Pulau Semakau](/wiki/Pulau_Semakau). A proposed sea burial facility to be built at [Tanah Merah](/wiki/Tanah_Merah,_Singapore) by the end of 2019 was eventually cancelled. While still not a common choice, sea burial is slowly gaining popularity with people who do not wish to burden their family with paying their respects during festivals. It is also generally cheaper than placing ashes in an urn at a columbarium. In-land ash scattering can also be done at the Garden of Peace, an ash scattering garden, located at Choa Chu Kang Cemetery Complex. Ashes are scattered at designated lanes, allowing the ashes to mix with the soil below. Watering equipment are provided to allow family members to mix the ashes with the soil. There are three government columbaria and 57 private ones. The government-operated columbaria are at Mandai, [Yishun](/wiki/Yishun) and [Choa Chu Kang](/wiki/Choa_Chu_Kang). Private columbaria are operated by the [Kong Meng San Phor Kark See Monastery](/wiki/Kong_Meng_San_Phor_Kark_See_Monastery), the Roman Catholic [Church of Saint Mary of the Angels](/wiki/Church_of_St_Mary_of_the_Angels) in [Bukit Batok](/wiki/Bukit_Batok), and the Singapore Soka Association, among others. As with crematoria, there is a significant price difference between niches in private and government columbaria. A standard niche in any government columbarium costs lesser than a private niche at a private columbarium. The government columbaria allocate niches sequentially while private columbaria allow families to choose niche locations subject to availability, and pre-book niches before death. There has been an increase in the number of Singaporeans pre-booking niches at private crematoria, even though some people consider talking about death and pre-booking a final resting place inauspicious. Reasons for pre-booking include wanting one's ashes to be close to those of loved ones, and hedging against higher prices for niches in future. The bodies of foreigners (regardless of where they die) can be cremated in Singapore, but their ashes have to be placed in private columbaria. It has been observed that the architecture of government columbaria reflects the outlook of the Singaporean nation. The early columbaria were simple, with few aesthetic ornaments, just like early Singaporean housing flats. The later columbaria have more modern designs, with well-designed landscaped environments, and looking similar to contemporary HDB (Housing and Development Board) flats. These columbaria include the Chua Chu Kang Columbarium and the Mandai Columbarium, which was renovated and expanded in 2004 to accommodate approximately another 60,000 niches. The designs are more elaborate, and are often reminiscent of other structures people often encounter in everyday life. Comparisons have been drawn between the architecture of these columbaria and that of schools and condominiums, and hypotheses have been made that such are deliberate efforts to eliminate the sense of fear and dread traditionally associated with landscapes of death. - [Death penalty in Singapore](/wiki/Death_penalty_in_Singapore) ## Notes - Parker, G.; Yap, H.L. (2001), \"Suicide in Singapore: A Changing Sex Ratio over the Last Decade\" (PDF), *Singapore Medical Journal*, **42** (1): 11–14, [PMID](/wiki/PMID_(identifier)) 11361231 – uses data on suicides from 1989 to 1998. - Pazos, Rodolfo; Benites, Yime (10 February 2014), \"Causes of death in Singapore in 2013\", *[Today](/wiki/Today_(Singapore_newspaper))*. - Shum, Eugene; Chern, Arthur (June 2006), \"Amendment of the Human Organ Transplant Act\" (PDF), *Annals of the Academy of Medicine, Singapore*, **35** (6): 428–432, [doi](/wiki/Doi_(identifier)):10.47102/annals-acadmedsg.V35N6p428, [PMID](/wiki/PMID_(identifier)) 16865196, [S2CID](/wiki/S2CID_(identifier)) 45480231, archived from the original (PDF) on 14 July 2014. - Association of Funeral Directors (Singapore), from the National Environment Agency website Archived 5 April 2015 at the [Wayback Machine](/wiki/Wayback_Machine)\n",
  "language": "en",
  "processed_at": "2026-01-12T10:07:22.970922",
  "title": "Death in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Death_in_Singapore"
}