{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:07:24.177693"
  },
  "content": "2015 fatal abuse case of an intellectually disabled waitress in Singapore **Annie Ee Yu Lian** (余玉莲 Yú Yùlián; c. 1988 – 13 April 2015) was a [Singaporean](/wiki/Singaporeans) waitress who was abused for eight months before she died on 13 April 2015 at the age of 26. Ee's abusers were her 31-year-old childhood friend, **Tan Hui Zhen** (陈惠珍 Chén Huìzhēn),[a] and Tan's 38-year-old husband, **Pua Hak Chuan** (潘学泉 Pān Xuéquán),[b] who were both her flatmates in the couple's four-room [Woodlands](/wiki/Woodlands,_Singapore) flat. The cause of death was certified to be [acute fat embolism](/wiki/Fat_embolism_syndrome) as a result of the beatings Ee received from Tan and Pua. It was also revealed that Annie Ee had an [intellectual disability](/wiki/Intellectual_disability), which was one of the factors (besides the cruelty and extent of injuries) behind the public outcry against the couple. Both Tan and Pua were initially charged with [murder](/wiki/Murder), which carries either [life imprisonment](/wiki/Life_imprisonment) or the [death penalty in Singapore](/wiki/Death_penalty_in_Singapore). However, after the investigations revealed that the couple had no motive or intention to cause Ee's death, the prosecution reduced the murder charges to those of voluntarily causing grievous hurt with a dangerous weapon. After receiving the couple's guilty plea, the [High Court](/wiki/High_Court_of_Singapore) sentenced Tan to 16 years and six months' imprisonment, and Pua to 14 years' imprisonment with 14 [strokes of the cane](/wiki/Caning_in_Singapore). After sentencing, the public felt that the sentences were too light due to the highly aggravated nature of the case, and the [government of Singapore](/wiki/Government_of_Singapore) eventually made amendments to the existing laws to ensure harsher punishments for offenders who commit crimes against disabled people, to prevent similar cases in the future. ## Background and case ### Background of the victim Born in [Singapore](/wiki/Singapore) in 1988, Annie Ee Yu Lian was the eldest of five children in her family--she had two younger brothers, Joel and Aaron, and two younger sisters, Shirley and Sharon. In 2001, when Ee was 13 years old, she first met 17-year-old Tan Hui Zhen at the clothing store owned by Ee's mother; Tan was an employee working at the store at the time she first met Ee. According to news reports, Tan, who has three other siblings, grew up with an unhappy childhood, as she was abused by her father, brother and ex-boyfriend. She was educated up to her third year in her secondary school, and she often displayed [self-harm](/wiki/Self-harm) symptoms as a result of the abuse she endured. Ee and Tan became friends after they first met, and they maintained regular contact with each other throughout until 2011. In late 2013, Ee re-kindled her friendship with Tan. Ee, who became estranged from her family, decided to go live with Tan in her [Woodlands](/wiki/Woodlands,_Singapore) flat. By then, Tan, who became a housewife, was already married to her husband, Pua Hak Chuan, a storeman who was five years older than his wife. It was revealed in media reports that Ee was not driven out but moved out on her own accord, because she wanted to seek her own freedom outside home, given that her family was overprotective of her due to her intellectual disability. Ee's family were also wary of Tan and warned Ee to prevent contacting her as they suspected her to be manipulative, but their advice fell on deaf ears. ### Abuse of Annie Ee Initially, while living in their flat, Ee had an amicable and friendly relationship with both Tan and Pua, whom she considered her sister and brother-in-law respectively, and she even helped Tan do some housework. Tan and Pua likewise showed concern for Ee's welfare during her stay at their flat, and they did not charge her for rent. However, the happiness was short-lived and things took a turn for the worse. In August 2014, both Tan and Pua discovered a bedbug infestation, which they suspected was caused by Ee since it happened after she moved into their flat. They blamed Ee for this and began to physically abuse her daily. Over time, the beatings increased by duration (up to two hours) and intensity, under the pretext of bad behaviour on Ee's part (e.g. lying or using the shower too long), and they even wanted her to verbalise her \"mistakes\" and declare she would \"change\". Both Tan and Pua used a 1 kg roll of [shrink wrap](/wiki/Shrink_wrap) to beat her on the buttocks, where the injuries would be less visible. This led to blisters forming on the buttocks, which required first aid to stop the bleeding. The couple took away Ee's $1,200 salary, and they only gave her an allowance of $50 every week, which was later cut down to $30. They also charged her for rent, starting from $150 a month, before they gradually increased the rent to $550. At a restaurant where Ee worked, her colleagues began to notice bruises on her body, arms, face and neck. They became concerned and inquired as to what happened, but Ee remained silent, except for one occasion where she told her supervisor it was her family who did it. The neighbours also began to notice something was wrong with Ee. One of them witnessed Ee's injuries but did not talk to her despite suspecting the couple was responsible, as he did not have enough evidence and the couple appeared to be gangsters. During the time she was abused by Tan and Pua, Annie Ee remained silent and did not seek help for her predicament, which was also partly due to her intellectual disability. ### Death of Annie Ee On the morning of 12 April 2015, Annie Ee used a pair of scissors to cut her wrist but Tan took the scissors away from her. By then, Ee was weak with multiple bruises, blisters and some fractures on her ribs and vertebrae. The beatings also caused Ee to have difficulty walking, standing and breathing, and she additionally became incontinent during the final days leading to her death. Within the past few weeks, both Tan and Pua noticed that Ee had gotten considerably weak and decide to not beat her to allow her to recuperate, and they kept measuring her blood pressure and heart rate to check if there was anything abnormal. They began to abuse her again two days later. The couple also did not seek medical help for Ee during the period of time leading up to Ee's death. Later that day, upon seeing Ee lying in her own urine, both Tan and Pua accused her of urinating on the floor in order to catch their attention. As the couple reprimanded Ee, who was utterly exhausted, while she was slumped onto a chair, they decided to punish her for her \"bad attitude\". Despite Ee's pleas to stop, Tan swung the shrink wrap roll against her back multiple times. Afterwards, Ee was ordered to go back inside her room but she lost balance and fell onto the floor. Pua then used the shrink wrap to hit her again as he told Ee to quit putting on an act, and smashed a dustbin onto Ee's body before he stopped. The assault proved fatal. The next morning, 13 April 2015, 26-year-old Annie Ee Yu Lian died in her sleep as a result of her injuries. ## Sentencing of the accused ### Arrest and murder charge On the morning of 13 April 2015, upon discovering that Annie Ee had died, Pua removed a layer of plastic from the shrink wrap and flushed it down the toilet to get rid of both his and his wife's fingerprints. Tan called her brother and said that Ee had committed suicide; eventually, she called the police. Both Tan and Pua initially told the police that Ee was very clumsy and would often cause injury to herself. Tan added that Ee often jumped up and landed on her buttocks for no apparent reason. However, when Ee's injuries were discovered during the forensic pathologist's examination, the couple eventually confessed to the police that they were responsible for assaulting her. Both 31-year-old Tan Hui Zhen and 35-year-old Pua Hak Chuan were arrested and, on 15 April 2015, they were charged in court with [murder](/wiki/Murder), an offence that warrants the [death penalty in Singapore](/wiki/Death_penalty_in_Singapore) (or at least [life imprisonment](/wiki/Life_imprisonment)) if found guilty. A third murder suspect and 21-year-old polytechnic student [Ng Yao Wei](/wiki/Murder_of_Ng_Yao_Cheng) was separately charged for the unrelated killing of his 26-year-old brother Yao Cheng on the same day as both Tan and Pua (Ng later served a seven-year jail term in 2016 for [culpable homicide](/wiki/Culpable_homicide) due to a mental illness). A week later, on 22 April 2015, both Pua and Tan were remanded at [Changi Prison](/wiki/Changi_Prison)'s Complex Medical Centre and Changi Women's Prison respectively for psychiatric assessments. An autopsy was conducted and it revealed that prior to her death, Annie Ee sustained a total of 12 fractured ribs, seven fractured vertebrae, a ruptured stomach, and her body was covered in blisters and bruises. The cause of Ee's death was an [acute fat embolism](/wiki/Fat_embolism_syndrome), which was a result of the multiple beatings Ee received from the couple before her death. The condition, which rarely causes death, occurred when the blunt force impact from the beatings landed on Ee's buttocks, which led to fatty tissue entering her bloodstream and traveling to her lungs, which led to a blockage of the blood vessels, hindering the circulation of oxygen in her lungs, leading to cardiac and [respiratory failure](/wiki/Respiratory_failure). ### Reduction of murder charges and trial Eventually, after the investigations revealed that the couple had no intention to cause the victim's death, the prosecution decided to reduce the charges of murder to voluntarily causing grievous hurt with a dangerous weapon, which does not warrant the [death penalty](/wiki/Death_penalty). On 27 November 2017, the couple stood trial in the [High Court](/wiki/High_Court_of_Singapore), with the case presided over by High Court judge Hoo Sheau Peng. At the trial, Tan pleaded guilty to two charges of causing grievous hurt with a weapon and two charges of causing grievous hurt, while Pua similarly pleaded guilty to two charges of causing grievous hurt with a weapon, as well as a third charge of causing hurt. They were both convicted after submitting their pleas of guilt to the judge. In their closing submissions, the prosecution sought a jail term of 14 years and 12 [strokes of the cane](/wiki/Caning_in_Singapore) for Pua, while they argued for a longer sentence of at least 15 years for Tan, on the basis that Tan had committed more severe offences and displayed a greater culpability than her husband. Describing the death of Annie Ee as \"an appalling case of abuse and cruelty\", Deputy Public Prosecutor (DPP) April Phang and her colleague Claire Poh stated that Ee came to the couple's home to find a sense of home and family, but both Tan and Pua did not accept her into their home out of altruistic reasons, and they exploited her for her trust and money. DPP Phang also reminded the court that Ee was subjected to psychological and physical torture for eight months, and her \"excruciating\" death occurred as a result of the couple's \"use of gratuitous violence and senseless brutality\". For the above reasons, the prosecution asked for Tan and Pua to be severely punished by law. During the mitigation plea, Tan Hui Zhen's lawyer [Josephus Tan](/wiki/Josephus_Tan) said that Ee's death was \"unexpected and unintended\", and a case of \"discipline gone wrong\". He also submitted to the court the psychiatric reports from Dr Kenneth Koh of the [Institute of Mental Health](/wiki/Institute_of_Mental_Health_(Singapore)) (IMH), in which Dr Koh certified that Tan had multiple psychiatric conditions, including [borderline personality disorder](/wiki/Borderline_personality_disorder) and [depression](/wiki/Major_depressive_disorder), which gave rise to her complex mental state and diminished responsibility, which was partly aggravated by the three miscarriages Tan had in the past. Cory Wong, who represented Pua Hak Chuan in the trial, argued in mitigation that Pua was not the principal offender and only went along with his wife's actions to appease her. The prosecution responded that Tan's psychiatric disorders should not be given much weight in deciding the sentence, and they urged the court that the sentence imposed on the defendants must reflect the condemnation of society for the \"monstrous cruelty and mindless violence\". ### Sentence On 1 December 2017, High Court judge Hoo Sheau Peng sentenced 33-year-old Tan Hui Zhen to 16 years and six months' imprisonment, and 38-year-old Pua Hak Chuan to 14 years' imprisonment with 14 [strokes of the cane](/wiki/Caning_in_Singapore). Justice Hoo stated in her verdict that both Tan and Pua had abused the trust of a vulnerable victim who treated them as her family, and their abuse of Annie Ee had gotten worse over time as they were emboldened by the victim's decision to suffer in silence. Justice Hoo, who admonished the couple for their lack of remorse and repentance, also described the case as \"appalling\" and said the abuse was inflicted upon Ee in an \"extremely cruel and inhumane manner\", which caused the 26-year-old waitress to die an undignified death. Due to the aggravating nature of the case, Justice Hoo believed that a substantial sentence was needed to reflect the gravity of Pua's and Tan's offences. Justice Hoo also determined that Tan was the principal offender and directed her husband to participate in it. Although the judge did acknowledge that the couple had come clean to what they had done to the victim, she gave little weight to Tan's mental disorders in considering the sentence, as she found Tan to be fully conscious of the magnitude of her actions and found that she had deliberately abused Ee and exploited her trust, and even involved her husband, which was why she sentenced Tan to a longer jail term of more than 16 years compared to Pua's 14-year sentence on account of her higher culpability. Unlike her husband, Tan was not caned since she was a female. The couple did not appeal against their sentences, and both Pua Hak Chuan and Tan Hui Zhen are currently incarcerated at [Changi Prison](/wiki/Changi_Prison) and Changi Women's Prison respectively since 2017, serving their respective sentences, which will likely be reduced by one-third should they maintain good behaviour in prison. By the time of their release from prison in either the mid-to-late 2020s or early 2030s, they will be aged in their forties to fifties. ## Aftermath ### Families and neighbours of the couple and victim After the sentencing trial of Pua Hak Chuan and Tan Hui Zhen, their families were approached by the reporters for interviews regarding the case. Tan's eldest brother, who declined to give his full name, told reporters about the troubled childhood and mental issues his sister has undergone, but he stated that his sister's mental state could not be the justification of her heinous sins against Annie Ee. Tan Hui Zhen's brother also stated that he believed that his sister should be punished for what she did and he apologised on his sister's behalf to Annie Ee's family, and sought understanding from the public over the issues the families faced. As for Pua's mother, she stated that her son \"got what he deserved\" and she also expressed her regret and apologized to the victim's family for what happened to Ee. [Josephus Tan](/wiki/Josephus_Tan), who defended Tan Hui Zhen in her trial, asked for the understanding of the public as the families of Tan and Pua were deeply affected by the pressure of the case. The victim's bereaved family, however, stated they would never forgive Tan and Pua for having abused and murdered Annie Ee. Ee's two brothers and one of Ee's two sisters felt that the punishment Tan and Pua faced was too lenient, and they made a public appeal for more severe penalties for the couple. Overall, at the time the couple were sentenced, Ee's family was still struggling with sadness over Ee's death and unable to move on with their lives, especially Ee's 67-year-old elderly mother; still, they continued to go to the temple regularly and on special occasions (in accordance to Chinese customs) to offer incense and food to Ee, hoping she could rest in peace in the afterlife. The Woodlands flat where Annie Ee died was eventually rented out to a family, who moved in a month before the sentencing of Tan and Pua. The new tenant did not mind living in the flat despite receiving word that this was the same flat where Ee was killed. The neighbours of Annie Ee, who were shocked at the gravity of her abuse when it came to light, have also moved on with their lives despite remembering the case and presence of police officers at the flat during their investigations. ### Public opinion When the case of Annie Ee's death came to light, there was a mass public outcry against Tan and Pua due to the extent of her injuries and the extreme cruelty and violence inflicted upon Ee, especially since Ee had an [intellectual disability](/wiki/Intellectual_disability). When the murder charges were reduced to those of causing grievous hurt, many Singaporeans were enraged at the decision as they believed that the couple should be charged and sentenced for murder, or at least for [culpable homicide](/wiki/Culpable_homicide) not amounting to murder (Singapore's legal term for manslaughter). From the public's perspective, they felt that the gradual torture and inhumane treatment which lasted for eight months and ended with Ee's death should be considered as an act of murder by common sense. Though the [Attorney-General Chambers](/wiki/Attorney-General_of_Singapore) (AGC) stepped forward to gave an explanation behind their decision to reduce the murder charges, the public remained unconvinced. An online petition for a harsher punishment was filed by the public, which quickly gathered more than 35,000 signatures by December 2017, as the netizens felt that the sentences sought by the prosecution against Tan and Pua were too light; some even argued for the couple to be [sentenced to death](/wiki/Sentenced_to_death) for their callous crimes against Ee, and the defence lawyers were condemned for defending the couple. It was also speculated by the public that the couple's charges were reduced due to their family connections or wealth, a fact which was refuted by Tan's brother, who stated that their family was not financially well and their lawyer was representing them in court on a [pro bono](/wiki/Pro_bono) basis. Dr Sudha Nair, executive director of Pave, a charity that specialises in tackling interpersonal violence, also reportedly told national newspaper *[The Straits Times](/wiki/The_Straits_Times)* that the tragedy behind Annie Ee's case should be a wake-up call to the community to be more alert and informative towards abuse cases and report them to the police immediately to avoid repeating the outcome of the Annie Ee case in the future. The cases of Tan Hui Zhen and Pua Hak Chuan also became cases of study for psychiatric experts to analyse the behaviour of those who are perpetrators of the abuse of vulnerable victims. ### Government's response and legal impact On 18 December 2017, in response to the public outrage against the prosecution's decision, the [Attorney-General Chambers](/wiki/Attorney_General_of_Singapore) (AGC) replied and explained why Tan and Pua were not charged and found guilty of murder. The AGC explained that the prosecutor's duty is to only proceed with a charge which is tangibly backed up by evidence. They stated that Ee's death by [acute fat embolism](/wiki/Fat_embolism_syndrome) was an unusual occurrence that would not have ordinarily resulted from the injuries inflicted by Pua and Tan, and both had no intention to cause death, which was why the murder charges could not be proceeded against the couple; an offence of murder under Singapore law dictates an act committed with an intention to either cause death or inflict a fatal injury resulting in death in the ordinary cause of nature. As a result, the prosecution could only finalize the charges of voluntarily causing grievous hurt with a dangerous weapon, which were the highest possible charges they could proceed with against Tan and Pua based on the evidence yielded by the autopsy and police investigations. The prosecution expressed their understanding of the public's emotions and feelings of injustice regarding the tragic nature of Ee's death, but they stated that all individuals are subject to fair treatment and prosecution under the law and asked the public to refrain from making speculations that may hinder ongoing proceedings in the courts. The prosecution also confirmed that no appeal would be filed since the period for appealing the court's decision has expired. The two defendants chose not to appeal as well. [Attorney-General](/wiki/Attorney-General_of_Singapore) [Lucien Wong](/wiki/Lucien_Wong) also made a public speech in January 2018, stating that the AGC will not be swayed by a vocal minority, but will keep a more open communication to deliver their philosophy to a wider audience. He also affirmed the prosecution's duty to ensure better and fairer prosecution of suspects under the law for the better welfare of society, and stated that they would focus on placing more weight on sentencing principles, rather than precedents, when seeking potential penalties for future suspects on trial. Law minister [K. Shanmugam](/wiki/K._Shanmugam) also urged the public not to put pressure on the judges when it comes to the sentencing of high-profile criminals as the sentencing should not be decided based on the public's emotions, and there should be respect and faith in the belief that judges would ensure the most appropriate legal retribution be given to those guilty under the law of Singapore. The [Law Society of Singapore](/wiki/Law_Society_of_Singapore) also asked the public to understand that defence lawyers are necessary to represent the voice for their clients in court in light of the public condemnation against Tan and Pua's lawyers. Overall, the tragic case of Annie Ee's death and the resulting righteous anger from the public has brought to light the need for a sound court system. In 2018, due to the lingering effects of the Annie Ee case, the [Parliament of Singapore](/wiki/Parliament_of_Singapore) discussed and agreed to amend laws to legalize harsher punishments for offenders who commit crimes against vulnerable groups like children, domestic workers and disabled people (whether mentally or physically). Under the amended laws, any convicted offenders can face up to twice the maximum punishment for whichever crimes are committed against these vulnerable groups. The government also considered more wide-ranging proposals to offer more protection for the vulnerable under the law, and they called on all communities to play a bigger role in preventing future cases of abuse by being more alert and quicker to inform the authorities to intervene, so as to not allow potential victims of abuse to end up like Annie Ee. The proposed amendments were passed and introduced in early 2019. - [Caning in Singapore](/wiki/Caning_in_Singapore) - [Capital punishment in Singapore](/wiki/Capital_punishment_in_Singapore) - [Murder of Piang Ngaih Don](/wiki/Murder_of_Piang_Ngaih_Don) - [Killing of Muawanatul Chasanah](/wiki/Killing_of_Muawanatul_Chasanah) - [Azlin Arujunah and Ridzuan Mega Abdul Rahman](/wiki/Azlin_Arujunah_and_Ridzuan_Mega_Abdul_Rahman) - [List of major crimes in Singapore](/wiki/List_of_major_crimes_in_Singapore) ### Notes ### Citations\n",
  "language": "en",
  "processed_at": "2026-01-12T10:07:24.177229",
  "title": "Death of Annie Ee",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Death_of_Annie_Ee"
}