{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:07:28.098354"
  },
  "content": "2000 unsolved rape and murder of a woman in Singapore On 6 February 2000, 27-year-old **Linda Chua** was jogging in [Bukit Batok Nature Park](/wiki/Bukit_Batok_Nature_Park) when she was attacked and raped. She was later found naked in a 10-metre-deep ravine in the park with her clothes next to her. She was taken to the [National University Hospital](/wiki/National_University_Hospital) but died several days later on 14 February. Her attackers were never caught and the case remains unsolved to this day. ## Background Linda Chua, the second of four children of a retired businessman and a housewife, was a financial reporting manager at [ExxonMobil](/wiki/ExxonMobil). She had a fiancé, whom she met while they were both freshmen at [Nanyang Technological University](/wiki/Nanyang_Technological_University) in 1991. They had been planning to get married in December that year. ## Investigations Police interviewed hundreds of people, but did not find any useful leads. In March, Singaporean TV crime show *[Crimewatch](/wiki/Crimewatch_(Singaporean_TV_series))* broadcast a public appeal for information about the case in the show's first episode that year. On 29 March, citizens' groups, the public and Chua's friends offered a reward of $80,000 for information about the culprits behind the attack. - [List of unsolved murders](/wiki/Lists_of_unsolved_murders) - [List of major crimes in Singapore](/wiki/List_of_major_crimes_in_Singapore) - [Death of Winnifred Teo](/wiki/Death_of_Winnifred_Teo) - [Dini Haryati rape and murder](/wiki/Dini_Haryati_rape_and_murder) This Singapore-related article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T10:07:28.097898",
  "title": "Death of Linda Chua",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Death_of_Linda_Chua"
}