{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:07:26.158441"
  },
  "content": "1985 death of a girl by medical negligence in Singapore On 10 September 1985, 22-year-old **Chong Yun Jing** (张云菁 Zhāng Yúnjīng), who underwent surgery a few months before due to a brain tumour, died as a result of [meningitis](/wiki/Meningitis), which seemingly was one of the complications of the surgery she received. During investigations however, it was suspected that Chong's medical results of a brain tumour was a misdiagnosis made by Dr **Lim Djoe Phing** (林如平 Lín Rúpíng), an Indonesian-born neurosurgeon who conducted the surgery on Chong, given that several medical experts consulted in this case stated that Chong did not actually suffer from a brain tumour all along, and she should not have received surgery in the first place. A coroner's inquiry was conducted in November 1987 to inspect the death of Chong, and after 27 days of deliberation, on 10 June 1988, the coroner's court found Dr Lim criminally responsible of causing Chong's [death by negligence](/wiki/Negligent_homicide), and as a result, in April 1989, Dr Lim was suspended from medical practice for one year, and he was ordered to compensate Chong's surviving kin in a civil lawsuit filed against him in September 1992. The coroner's inquiry of Chong's death was known to be the longest running coroner's inquiry in Singapore's history. ## Background and Chong's death On 24 March 1985, 22-year-old Chong Yun Jing (alias Jeannie Chong), an administrative officer and a part-time [Singapore Polytechnic](/wiki/Singapore_Polytechnic) student who was then enrolled in a diploma course for production engineering technicians, was found unconscious in the bathroom of her home, and she was told to come back for a checkup after consulting a doctor at a hospital. A month later, when Chong's mother Pang Koi Fa referred her daughter to a general practitioner, Dr Tham Pak Onn, and told Dr Tham about the fainting spell she suffered, Dr Tham recommended Chong to consult Dr Lim Djoe Phing, a neurosurgeon at [Mount Elizabeth Medical Centre](/wiki/Mount_Elizabeth_Hospital). Dr Lim conducted a skull X-ray test and several other scans for Chong, and eventually, he diagnosed that Chong suffered from brain cancer, and she needed to undergo surgery to remove a tumour in her [pituitary gland](/wiki/Pituitary_gland), or else she would become blind. After some deliberation and persuasion from her mother, Chong reluctantly agreed to do the surgery and hence, on 6 June 1985, Chong had her tumour removed by Dr Lim through an operation. However, after the surgery was completed, Chong was placed in intensive care, and she could not open her right eye, as well as having a nose pad covering the nasal dissection. A few days later, the nose pad was removed and at this point, Chong started to experience brain fluid leakage through her nose, and she also got blurred vision and a high fever. Chong began to show signs of meningitis, an infection of a membrane in her brain, and she also suffered from severe headaches, which made her turn to painkillers prescribed by the medical staff. Additionally, brain fluid continued to leak out of her nose since the end of the surgery. Despite the family's concerns about Chong's condition, Dr Lim reassured them that she was still fine and directed that she be discharged on 24 June 1985, about less than three weeks after the surgery. However, despite the care given by her private nurses and family members at home, Chong, who was still receiving intravenous drips, continued to be in pain and her condition grew even worse over the next few days. After Dr Lim berated Chong's family for repeatedly calling him regarding her condition, Chong's family were left with no other option but to seek the help of other doctors to treat Chong, who was once again hospitalized. Dr Ong Peck Leong, one of the doctors who took over Chong's case, had to operate on Chong to close the opening in her skull, which caused the brain fluid leakage and in turn, lead to an infection due to the bacteria entering the opening and therefore caused meningitis. Despite subsequent treatments and another two surgeries, Chong eventually died as a result of meningitis and pituitary tumour. An autopsy was not done on Chong after her death due to the bereaved family not consenting to it. At the time of her death, Chong left behind one brother Chong Yuen Ching and her parents Chong Khin Ngen and Pang Koi Fa, and other relatives including a maternal uncle, maternal aunt and three godbrothers. Her funeral was held for two days at Bedok South before being cremated at the Tse Tho Aum Temple on the Friday morning of 13 September 1985. ## Police investigations Although the death of Chong Yun Jing was ruled to be a death caused by medical reasons and therefore not referred for a coroner's inquiry, Chong's parents decided to, on the advice of their lawyer Nathan Isaac (who was best known for defending Hoe Kah Hong in the 1981 [Adrian Lim murders](/wiki/Adrian_Lim_murders) case), make a police report on 16 January 1986 and asked for an investigation of their daughter's death. The case was taken over by Investigation Officer (IO), Sergeant P. Avadiar of the [Tanglin Police Division](/wiki/Tanglin_Police_Division) and therefore investigated as a possible criminal case of death by a rash or negligent act under Section 304A of the [Singaporean Penal Code](/wiki/Penal_Code_(Singapore)), which was punishable by the maximum of two years' imprisonment if found guilty. During the lengthy investigation process, IO Avadiar, who obtained Dr Lim's medical documents regarding Chong's condition, interviewed and consulted many medical experts, including those who had handled Chong's case. One of the first medical experts was Dr James Khoo, who was the doctor that took over Chong's case after Dr Lim Djoe Phing's operation. Dr Khoo told IO Avadiar that Chong was seriously ill with meningitis and also suffered from brain fluid leakage that arose as a complication of the surgery, as well as severe headaches and vomiting. Dr Khoo opined that Dr Lim's surgery had possibly damaged the third nerve of her right eye and also her pituitary gland, which resulted in diabetes in Chong's case. Dr Ong Peck Leong, another neurosurgeon who handled Chong's case after her re-hospitalization, told IO Avadiar that he had to conduct another surgery to stem the brain fluid leakage and also stated that when he first met Chong, he discovered that she was in a very bad shape due to meningitis for the past two weeks or so, and there was an infection that happened as a result of the meningitis. Dr Ong also said that the tear in Chong's brain membrane was most likely caused by Dr Lim's operation on Chong back in June 1985, and her condition was worsened due to improper attention paid to the meningitis, and her discharge back then should not have happened. Dr John A. Tambyah (J. A. Tambyah), an endocrinologist who examined Chong's diabetes condition and medical reports forwarded to him by Dr Ong, later told police that he found Chong's blood hormone levels to be normal, even though Dr Lim had earlier certified that Chong's blood tests showed abnormal hormonal readings, and Dr Tambyah said that the surgery was not needed at all in the first place, and he also stated that the brain leakage would have been averted if immediate steps, such as the prescription of antibiotics, had been taken and the infection would, in turn, be avoided. Dr Low Chen Hoong, a radiologist who had conducted scans on Chong under Dr Lim's request, also told the police that although his scans confirmed the possibility of a brain tumour in Chong's case, he stated that a scan alone was not accurate to determine whether Chong had brain cancer or not, as there should be an additional hormone level test and at least four radiological tests to ascertain and confirm this possibility, but he did not do it as Dr Lim did not ask for further tests, which Dr Low felt should have been done. After weeks of investigation, the police had a breakthrough. Even though Chong's body was cremated after her death and no autopsy was conducted, it was discovered that she had a tissue sample taken from her pituitary gland by Dr Lim during the operation. The tissue sample was later found to be in the possession of Dr Seah Han Cheow, a veteran forensic pathologist who received it from Dr Lim after the surgery. During police questioning, Dr Seah confirmed that based on his examination of the tissue sample, he found it to be consistent with a pituitary tumour and bone fragment. A second medical opinion was later sought by police to verify the accuracy of Dr Seah's reports, and after examination from Dr Gilbert Chiang, a senior consultant pathologist, he found that the tissue was neither cancerous nor a tumour, but normal gland tissue, giving rise to the possibility that Chong did not have brain cancer in the first place. This led to the police sending the case for a coroner's inquiry, and Dr Lim Djoe Phing was suspected to have committed medical malpractice in his treatment of Chong. Background information revealed that prior to Chong's death, Dr Lim, who came from [Medan](/wiki/Medan), [Indonesia](/wiki/Indonesia), had formerly studied in [West Germany](/wiki/West_Germany) when he was 20, and he first came to Singapore in 1984. Dr Lim was also married with a son and daughter at the time when the coroner's inquest was conducted. Dr Lim was convicted of speeding and therefore fined S$180 in July 1986, and he was also involved in another coroner's case, where 62-year-old Jammaan Abdullah suffered a head injury and died. In that case, Dr Lim was reprimanded for issuing a death certificate when the \"unnatural death\" of Jaaman should have been referred for a coroner's inquiry and an autopsy should have been conducted. An open verdict was issued for the death of Jaaman, given that the exact cause of death was not ascertained. ## Coroner's inquiry (1987 – 1988) ### Hearing and testimony On 9 November 1987, two years after the death of Chong Yun Jing, a coroner's inquest into her death was conducted by the coroner's court, with State Coroner Lim Keng Seong presiding over the inquiry. Dr Lim Djoe Phing, who was in charge of Chong's operation, was summoned by the coroner's court as a potential defendant in this case. Dr Lim engaged Richard Tan during the proceedings while Chong's family was represented by Nathan Isaac. Inspector M. Neethianathan also attended the inquiry to render assistance during the hearing. During the coroner's inquiry hearing, it was debated on whether Chong had indeed suffered from a tumour at the time of the surgery based on the tissue sample extracted from Chong. Although Dr Seah Han Cheow maintained that the tissue sample he received was a tumour based on his repeated examinations, his findings were countered by Dr Gilbert Chiang, who stated that the tissue sample showed that it was normal cellular tissue of the pituitary gland, and a tumour would have had one uniform cell type without any discernable pattern, which was not proven by his examination of the tissue sample. Dr Chiang also told the court that he had sent two samples of the tissue to England for further medical opinions from the world-renowned pathologists based there, and they agreed with Dr Chiang that this was not a tumour. Several other medical experts - including Dr Ong Peck Leong, Dr James Khoo, Dr Low Chen Hoong and Dr John Tambyah - were also called to testify on the exact medical condition of Chong. When Dr Lim was called to enter his defence, he chose to remain silent, and instead, he called on Dr John Lester Firth, a British neurosurgeon, as his witness. Dr Firth supported Dr Lim's diagnosis that Chong indeed had pituitary tumour and there was no need for Dr Lim in his position to conduct further check-ups, and he even disagreed that the official cause of Chong's death was meningitis, and also stated that the fainting spell sustained by Chong back in March 1985 was not a simple fainting attack but rather caused by bleeding in the pituitary or an epileptic fit. When cross-examined by Isaac, Firth rejected the lawyer's suggestion that the cause of death was due to Dr Lim's negligence, and he also stated it was unnecessary for further tests to avoid confusion and delaying surgery. Isaac, in his rebuttal to Firth's testimony, stated that the only reason why Dr Lim did not bother to make further tests was because he wanted to operate on Chong \"at all costs\". As the final witness of the coroner's inquest, Professor [Chao Tzee Cheng](/wiki/Chao_Tzee_Cheng), a senior forensic pathologist, was summoned as the coroner's medical adviser. Professor Chao testified that the cause of Chong's death was indeed meningitis, which was a complication from Dr Lim's operation on Chong, and he told the coroner that it was effectively proven that a causal link existed between the operation and Chong's death. Professor Chao also pointed out that Chong was discharged by Dr Lim even though she was still experiencing symptoms and signs of [CSF leak](/wiki/Cerebrospinal_fluid_leak) and meningitis and was still on intravenous injections, and he affirmed with cautious approach, that it was essential to assess a case fully before a surgery was considered, which should also be applicable to the case of Chong Yun Jing. ### Coroner's verdict On 10 June 1988, after 27 days of deliberation, State Coroner Lim Keng Seong delivered his verdict. In his judgement, State Coroner Lim found that Chong had indeed died from meningitis and this was a direct result of the operation Dr Lim conducted on her as a result of his misdiagnosis and he was negligent in handling of Chong's case, especially when he did not conduct further medical examinations to verify Chong's exact condition and conducted a surgery that should not have been performed on Chong, and even discharging her in spite of her worsening symptoms of meningitis caused by the complications of her surgery. Having gave due consideration of the evidence before him, State Coroner Lim found the 43-year-old neurosurgeon Dr Lim Djoe Phing criminally responsible for the death of 22-year-old Chong Yun Jing. Dr Lim Djoe Phing was the first doctor in Singapore's medical history to be found guilty of causing a patient's [death by negligence](/wiki/Negligent_homicide). ## Subsequent legal developments (1988 – 1992) ### Suspension of Dr Lim Djoe Phing Soon after the coroner's verdict was issued, the case of Dr Lim Djoe Phing was brought forward to the [Attorney-General's Chambers](/wiki/Attorney-General_of_Singapore) (AGC) for a review, so as to determine whether to prosecute Dr Lim for causing Chong's [death by criminal negligence](/wiki/Negligent_homicide), but no outcome was ever reported since then. While the case was pending review by the AGC, the Singapore Medical Council stated that they would await the AGC's decision before making a move to inquire Dr Lim's misconduct. In October 1988, Dr Lim's employment pass was cancelled. Dr Lim appeared before the Singapore Medical Council in December of that same year for mishandling Chong's case, and he was represented by [Queen's Counsel](/wiki/Queen%27s_Counsel) Edwin Glascow, who was the first Queen's Counsel to appear in a medical council case. The inquiry was held for four weeks from December 1988 to April 1989, and on 21 April 1989, the Singapore Medical Council found Dr Lim guilty of two charges, mainly one count of gross negligence for operating on Chong without going through further check-ups and one count of misleading Chong into believing she required urgent surgery. Dr Lim was consequently suspended from medical practice for one year, and he was not allowed to practice medicine in Singapore in the future. According to Dr Lim, he was relieved that the case had concluded at this point, and he was reportedly working at a friend's office in [Johor](/wiki/Johor), [Malaysia](/wiki/Malaysia), where he was mainly in charge of management work. The 12-month suspension order imposed on Dr Lim was the maximum penalty awarded under the Medical Registration Act. In September 1988, Dr Lim was arrested and faced three charges for an unrelated case of drink driving, and he was also alleged to have refused a police officer's order to take a [breathalyzer](/wiki/Breathalyzer) test, and also refusing to give his blood for testing. In March 1990, Dr Lim was convicted and fined S$1,400 for the offence, as well as being banned from driving for one year. ### Legal motions from Chong's family Chong's parents had filed a criminal complaint in January 1988 against Dr Lim in midst of the coroner's inquiry, claiming that Dr Lim had cheated them with respect to the misdiagnosis and death of their only daughter. The police investigated the case and in December 1988, they decided to dismiss the complaint after finding insufficient evidence to prove the charges of cheating and other unspecified offences against Dr Lim. Chong's parents also filed a civil lawsuit against Dr Lim in January 1988, seeking damages totaling up to S$500,000. In September 1992, four years after the lawsuit was first lodged, the [High Court](/wiki/High_Court_of_Singapore) made its ruling for the Chong family's civil lawsuit, but the former doctor was not present in court at the time of the hearing. It was revealed in the hearing that Chong's mother Pang Koi Fa was deeply traumatized by her daughter's death, so much so that she began to receive psychiatric treatment for both pathological grief and [post-traumatic stress disorder](/wiki/Post-traumatic_stress_disorder), in addition to a [mood disorder](/wiki/Mood_disorder). According to Chong's brother, who was now the only surviving child of Chong's parents, his mother was originally a mild-mannered lady who underwent a personality change after his sister died, as she stopped cooking for her family, became overprotective of her son and even quarreled with her husband, and she additionally went to Dr Tham's clinic to abuse him, smashing some glass and banging some cupboards. [Judicial Commissioner](/wiki/Judicial_commissioner) Amarjeet Singh ruled in this case that given the circumstances of Chong's death back in 1985 and its severely adverse impact on her mother's psychiatric health for the past seven years, Dr Lim was to compensate for the damages that arose in Chong's death case and hence, he awarded Chong's mother a sum of S$30,000 for \"nervous shock\" and a separate amount of more than S$325,351 in total for Chong's family. ## Aftermath In light of Dr Lim's suspension from medical practice in 1989, the government was planning to revise the Medical Registration Act to provide harsher penalties in future cases of doctors who committed medical malpractice, according to Acting Health Minister [Yeo Cheow Tong](/wiki/Yeo_Cheow_Tong) in a publicized statement, in which he described Dr Lim's 12-month suspension as \"inadequate\". On 14 December 1995, ten years after Chong Yun Jing's death, Dr Lim died at the age of 50 in Singapore. His bereaved family declined to reveal the cause of death, but they denied that he committed suicide or died accidentally. Dr Lim, who had attained [Singaporean citizenship](/wiki/Singaporean_citizenship) at this point, was survived by his wife, two children (a son and daughter) and seven siblings (five sisters and two brothers). His siblings rushed over to Singapore to attend his funeral wake, which was conducted at the Teochew Funeral Parlour, and his remains were cremated at [Kong Meng San](/wiki/Kong_Meng_San_Phor_Kark_See_Monastery) columbarium. The coroner's inquiry of Chong's death and her family's civil lawsuit was one of the well-known legal cases handled by Nathan Isaac, the lawyer who represented Chong's family throughout the proceedings. Isaac (born on 24 January 1937), who was formerly a police officer before he became a lawyer in 1971, died on 10 January 2009, 14 days short of his 72nd birthday. Isaac was survived by his wife, four sons and two grandsons; one of Isaac's sons recalled that when his father took over the case of Chong's family, his father showed a great deal of empathy for Chong's mother over her emotional plight and many of his father's friends and fellow lawyers rooted for Isaac to seek justice for Chong's loved ones. 25 years after the death of Chong Yun Jing, her case was re-enacted by Singaporean crime show *[Crimewatch](/wiki/Crimewatch_(Singaporean_TV_series))*, which aired the re-enactment episode as the fourth episode of its annual season in June 2010. Sergeant P Avadiar, who at this point of time became Superintendent of Police and also headed the investigation branch at [Jurong Police Division](/wiki/Jurong_Police_Division), agreed to be interviewed in the episode, and Avadiar stated that the case of Chong's death was one of his most complicated cases he ever handled to date, especially where he had to deal with unfamiliar medical terms and he was grateful for the help of various medical experts he consulted throughout the investigation of Chong's death. The episode also covered the explanation of how the coroner's court functioned and its duty in handling death cases where the cause of death would be ascertained through the coroner's inquiry. - [List of major crimes in Singapore](/wiki/List_of_major_crimes_in_Singapore)\n",
  "language": "en",
  "processed_at": "2026-01-12T10:07:26.158047",
  "title": "Death of Chong Yun Jing",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Death_of_Chong_Yun_Jing"
}