{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:07:30.706775"
  },
  "content": "State declaration in Singapore The **Declaration of Religious Harmony** of [Singapore](/wiki/Singapore) is a statement that affirms the importance of, and the commitment of [Singaporeans](/wiki/Singaporeans) towards, religious harmony. It is a basis for Singaporeans to reflect on religious harmony, and what should be done to achieve it. The idea of having a Code on Religious Harmony was proposed by the then Prime Minister [Goh Chok Tong](/wiki/Goh_Chok_Tong) in September or October 2002. This followed strains in racial harmony in the country following the [September 11, 2001 attacks](/wiki/September_11,_2001_attacks) in the United States and the arrest and detention of members of the [Jemaah Islamiyah](/wiki/Jemaah_Islamiyah) terrorist network in Singapore in December 2001. The Declaration was issued on 9 June 2003 by a working committee chaired by [Minister of State](/wiki/Minister_of_State) [Chan Soo Sen](/wiki/Chan_Soo_Sen) and involving the national bodies of all mainstream religious groups in Singapore, after six months of intense debate over its wording. Subsequently, an Inter-Religious Harmony Circle (IRHC) comprising representatives of the religious groups involved in the working committee was formed to promote the Declaration. The IRHC has encouraged Singaporeans to recite the Declaration during the week when [Racial Harmony Day](/wiki/Racial_Harmony_Day) (21 July) is marked every year. ## Text of the declaration We, the people in Singapore, declare that religious harmony is vital for peace, progress and prosperity in our multi-racial and multi-religious Nation.We resolve to strengthen religious harmony through mutual tolerance, confidence, respect, and understanding.We shall alwaysRecognise the secular nature of our State,Promote cohesion within our society,Respect each other's freedom of religion,Grow our common space while respecting our diversity,Foster inter-religious communications,and thereby ensure that religion will not be abused to create conflict and disharmony in Singapore. - [Inter-racial and religious confidence circle](/wiki/Inter-racial_and_religious_confidence_circle) - [National Pledge (Singapore)](/wiki/National_Pledge_(Singapore)) ## Notes - The text of the Declaration on the website of the Inter-religious Organisation, Singapore.\n",
  "language": "en",
  "processed_at": "2026-01-12T10:07:30.706308",
  "title": "Declaration of Religious Harmony",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Declaration_of_Religious_Harmony"
}