{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:07:35.457103"
  },
  "content": "2022 Singaporean-Malaysian film ***Deleted*** ([Chinese](/wiki/Chinese_language): 越界), titled ***Deleted: Akan Kujejak!*** in Malaysia, is a 2022 Singaporean-Malaysian action drama film directed by Ken Ng Lai Huat. Executive produced by [Zheng Geping](/wiki/Zheng_Geping), the film follows Zhongyi, a former detective who sets about tracking down his kidnapped daughter and apprehend those responsible. The film stars Zheng, [Tien Hsin](/wiki/Tien_Hsin), [Rosyam Nor](/wiki/Rosyam_Nor), [Vincent Ng](/wiki/Vincent_Ng), [Fattah Amin](/wiki/Fattah_Amin), [Zhu Houren](/wiki/Zhu_Houren), Henley Hii, Malaysian mixed martial arts fighter Peter Davis, British boxer Brie Benfell, Malaysian-Brazilian fighter Marcio Sebsam and [Jack Neo](/wiki/Jack_Neo). It was released in Malaysia on 15 September 2022, and in Singapore on 3 November 2022. ## Cast - [Zheng Geping](/wiki/Zheng_Geping) as Chia Zhongyi - [Tien Hsin](/wiki/Tien_Hsin) as Teh Shanshan - [Rosyam Nor](/wiki/Rosyam_Nor) as Ali Yusof Bin Sulaiman - [Vincent Ng](/wiki/Vincent_Ng) as Vincent Yong - [Fattah Amin](/wiki/Fattah_Amin) as Mohd Aron Bin Ismail - [Zhu Houren](/wiki/Zhu_Houren) as Fan Dongtian (Four-Faced Buddha) - Henley Hii as Fan Mingkang (Saviour) - Charice Low as Hazel Chia Li May - Pablo Amirul as Bank - Peter Davis as Ghost - Brie Benfell as Fox - Marcio Sebsam as Tanker - Darwin as Bulldog - Mia Deen as Aisha Binti Ali Yusof - Fabian Loo as Fan Zhikang (Shawn) - [Rayson Tan](/wiki/Rayson_Tan) as Officer Su - [Jack Neo](/wiki/Jack_Neo) as Wu Haisen - Paul Murray as Dr. Trump - Haoyu as Officer Hong - Wai Hoong as Kelvin Zhang - Frederick Lee as Officer Huang - Eric Chen as CID James ## Production The film was produced with the support of Malaysia's [Ministry of Home Affairs](/wiki/Ministry_of_Home_Affairs_(Malaysia)) and the National Strategic Office Council for Anti-Trafficking in Persons & Anti Smuggling of Migrants (NSO MAPO). Filming began in 2019, and post-production was completed in 2020. Theatrical release was delayed for two years due to the [COVID-19 pandemic](/wiki/COVID-19_pandemic). ## Critical response *[8 Days](/wiki/8_Days_(magazine))* gave the film two out of five stars, criticizing its dialogue, casting and action sequences, adding that the film turns into an \"accidental shriek-fest when [Jack Neo](/wiki/Jack_Neo) turns up in a cameo\". ## Awards and nominations AwardsCategoryRecipientResultRef.Madrid International Film Festival 2022Outstanding Leading Actor[Zheng Geping](/wiki/Zheng_Geping)Won - Official website - *Deleted* at [IMDb](/wiki/IMDb_(identifier)) - *Deleted* on [Instagram](/wiki/Instagram_(identifier)) This article related to a Singaporean film is a stub. You can help Wikipedia by expanding it. - v - t - e This article related to Malaysian film is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T10:07:35.456780",
  "title": "Deleted (film)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Deleted_(film)"
}