{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:07:41.632644"
  },
  "content": "Singaporean political partyThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Democratic Progressive Party\" Singapore – news **·** newspapers **·** books **·** scholar **·** JSTOR *(July 2021)* *(Learn how and when to remove this message)* The **Democratic Progressive Party** (**DPP**) is a [political party](/wiki/List_of_political_parties_in_Singapore) in [Singapore](/wiki/Singapore). It was founded by former [Workers' Party](/wiki/Workers%27_Party_of_Singapore) (WP) Assistant Secretary-General Seow Khee Leng in 1973. ## History and political development On 16 March 1973, Seow Khee Leng and other members of the WP broke away from the party and founded a new political party **United Front** (UF). On 5 March 1982, the party was renamed to **Singapore United Front** (SUF), to avoid confusion with the name of another party, United People's Front. During the campaigning in the [1984 general election](/wiki/1984_Singaporean_general_election), SUF chief Seow was sued by [Prime Minister of Singapore](/wiki/Prime_Minister_of_Singapore) [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) and other members of [People's Action Party](/wiki/People%27s_Action_Party) for making [defamatory](/wiki/Defamation) remarks at two rally speeches that Lee and his cabinet were guilty of corruption. Seow was ordered to pay Lee and the PAP [S$](/wiki/Singapore_dollar)250,000 worth of damages and costs each. On 3 February 1989, Seow was declared bankrupt after being unable to keep up with the payments for the damages owned from two separate but similar libel suits brought by PM Lee and the PAP government. In January 1988, the party merged with the WP to contest the [1988 general election](/wiki/1988_Singaporean_general_election). ### 1992–2011: Revival as Democratic Progressive Party and inactivity SUF was temporarily defunct until 1992 until Seow and others resigned from the WP again. They revived the party, renaming it to its current name, the Democratic Progressive Party. Former WP member Tan Soo Phuan and his son [Tan Lead Shake](/wiki/Tan_Lead_Shake) stood as candidates for the party in the (/wiki/1997_Singaporean_general_election) and [2001 general elections](/wiki/2001_Singaporean_general_election). They did not achieve much electoral success, as both saw the candidates losing their electoral deposits for failing to garner the necessary threshold of 12.5% of the valid votes cast (Soo Phuan in the 1997 election in [Chua Chu Kang SMC](/wiki/Chua_Chu_Kang_SMC) and Lead Shake in the 2001 election in [Ayer Rajah SMC](/wiki/Ayer_Rajah_SMC)). In July 2002, both father and son were expelled from the DPP for breaching party orders by contesting the 2001 election without informing the party first (Soo Phuan did not inform his decision to contest [MacPherson SMC](/wiki/MacPherson_SMC), while Lead Shake contested Ayer Rajah instead of [Joo Chiat SMC](/wiki/Joo_Chiat_SMC)). The party became inactive after the expulsion of the Tans. ### 2012–present: Revival with new leadership After more than a decade of inactivity, Seow invited a group of former members of the [Singapore People's Party](/wiki/Singapore_People%27s_Party) including [Benjamin Pwee](/wiki/Benjamin_Pwee) and [Mohamad Hamim Aliyas](/wiki/Mohamad_Hamim_Aliyas) to take over the leadership of the DPP in December 2012. Pwee was appointed as the party's Acting Secretary-General in January 2013. At an Ordinary Party Congress meeting held on 31 March 2013, Hamim and Pwee were officially elected as the party's Chairman and Secretary-General respectively. Pursuant to a Memorandum of Agreement signed in August 2015, Pwee and Hamim resigned from DPP to return to SPP to help their team contest [Bishan–Toa Payoh Group Representation Constituency](/wiki/Bishan%E2%80%93Toa_Payoh_Group_Representation_Constituency) (GRC) in the [2015 general election](/wiki/2015_Singaporean_general_election). However, the SPP team obtained only 26.41% of the valid votes. The duo returned to the DPP soon after. In 2018, the DPP was present in a meeting with six other opposition parties, the [Singaporeans First](/wiki/Singaporeans_First), [Singapore Democratic Party](/wiki/Singapore_Democratic_Party), [People's Power Party](/wiki/People%27s_Power_Party_(Singapore)) (PPP), [National Solidarity Party](/wiki/National_Solidarity_Party_(Singapore)) and [Peoples Voice](/wiki/Peoples_Voice_(Singapore)) (PV), along with former PAP MP and Presidential Candidate [Tan Cheng Bock](/wiki/Tan_Cheng_Bock), on the possibility of forming a coalition led by Tan for the next election. On 19 February 2019, Pwee revealed that he had resigned from the DPP and joined the SDP ahead of the forthcoming general election four days later. Hamim took over as the new Secretary-General and leader, while Organising Secretary Ting Tze Jiang became Chairman. In March 2020, DPP alongside [Singaporeans First](/wiki/Singaporeans_First), [People's Power Party](/wiki/People%27s_Power_Party_(Singapore)) and [Reform Party](/wiki/Reform_Party_(Singapore)) (RP) applied to join the SDA. Although the DPP expressed their intention to contest in the [2020 Singaporean general election](/wiki/2020_Singaporean_general_election), on 27 June 2020, the party announced that they would not be participating and will instead back allied parties RP and PPP. In 2023, the DPP established the [People's Alliance for Reform](/wiki/People%27s_Alliance_for_Reform) together with the PV, RP and PPP. Two of their candidates, Kumar Appavoo and Hamim Aliyas contested the 2025 election under the PAR. ## Objectives and policies A statement dated 22 April 2013 on the DPP website states \"The way forward is to build a society that is equal and egalitarian to all citizens.\" A statement dated 16 August 2015 on the DPP website sets out the following policies or proposals: - Employment: Additional policy measures to ensure a “Singaporeans-first” domestic job market, especially in middle-to-upper management in the civil service and government-linked companies, as well as the private sector. - Foreign workers: Restrictions to foreign workers in Singapore by industrial sectors, allowing sectors like F&B where fewer Singaporeans are trained for or are interested to work, to employ more foreign workers. And for sectors like engineering, healthcare, banking, to have tighter restrictions, to allow Singaporean PMETs to take on these middle-income jobs more easily. - Re-skilling: better, more hands-on, more commonplace apprenticeship-based re-skilling programmes for middle-aged workers, rather than classroom-based, taught WDA/WSQ-type programmes that do not fit these middle-aged workers’ learning styles. - SMEs: practical support for SMEs, including setting up an SME assistance centre, a job-matching programme, a revolving loan fund, an incubation programme, and a mentor-coaching programme, to help owners and managers of SMEs to get back on their feet and become self-sustainable in their businesses. - Entrepreneurs: policy measures to complement the government’s existing range of solutions, to better help local entrepreneurs start a business and earn a living. This includes those in the design, arts, construction, manufacturing and other sectors. - [Central Provident Fund](/wiki/Central_Provident_Fund)/retirement: a wider range of options and retirement savings programmes that Singaporeans can choose from. Key leaders in the private sector insurance and investment industry to be called upon to come up with better investment and insurance schemes under the CPF structure, to fill in the current gaps in the CPF system. - [Malay](/wiki/Malaysia)-[Muslim](/wiki/Muslim) issues: identifying and challenging more Malay-Muslim PMETs to step forward as next-generation community leaders, and together find new solutions for the Malay-Muslim community. ## Organisation and structure ### Central Executive Committee As of 6 October 2025, the party's CEC consists of: Officer-holderNameChairmanAbdul Malik Bin RahmatSecretary-General[Mohamad Hamim bin Aliyas](/wiki/Mohamad_Hamim_bin_Aliyas)TreasurerSarina Abu HassanOrganising SecretaryAbdul Rahman Bin Ahmad ## Electoral performance DPP contested as UF from 1976 to 1980, and SUF in 1984, before assuming its current name. It contested the 2015 general election under SPP in Bishan-Toa Payoh GRC by contributing 2 of the 5 candidates. ### Parliament ElectionLeaderVotes%SeatsPositionResultContestedTotal+/–SeatsWonLost(/wiki/1976_Singaporean_general_election)Seow Khee Leng53,3736.7%140140 / 69 3rdNo seats(/wiki/1980_Singaporean_general_election)28,5864.5%8080 / 75No seats(/wiki/1984_Singaporean_general_election)87,23710.0%130130 / 79No seats(/wiki/1997_Singaporean_general_election)5,0430.7%2020 / 83 6thNo seats(/wiki/2001_Singaporean_general_election)5,3340.9%2020 / 84 5thNo seats(/wiki/2015_Singaporean_general_election)1[Benjamin Pwee](/wiki/Benjamin_Pwee)31,1081.4%5 (2)05 (2)0 / 89—N/aNo seats(/wiki/2025_Singaporean_general_election)[Hamim Aliyas](/wiki/Mohamad_Hamim_Aliyas)24,9561.0%13 (2)013 (2)0 / 97 #### Seats contested ElectionConstituencies contestedContested vote %+/–(/wiki/1976_Singaporean_general_election)Brickworks, Bukit Ho Swee, Bukit Merah, Delta, Geylang West, Kallang, Katong, Kolam Ayer, Leng Khee, Marine Parade, Mountbatten, Siglap, Thomson, Upper Serangoon25.3%—N/a(/wiki/1980_Singaporean_general_election)Aljunied, Boon Lay, Geylang Serai, Kampong Chai Chee, Kebun Bahru, Kolam Ayer, Punggol, Tanjong Pagar19.0% 6.3%(/wiki/1984_Singaporean_general_election)Bedok, Boon Lay, Changi, Eunos, Fengshan, Geylang Serai, Geylang West, Kaki Bukit, Kampong Chai Chee, Marine Parade, Nee Soon, Punggol, Tanah Merah34.2% 15.2%(/wiki/1997_Singaporean_general_election)[SMC](/wiki/Constituencies_of_Singapore): Chua Chu Kang2, Kampong Glam12.3%—N/a(/wiki/2001_Singaporean_general_election)SMC: Ayer Rajah2, MacPherson14.2% 2.0%(/wiki/2015_Singaporean_general_election)[5-member GRC](/wiki/Group_representation_constituency): Bishan-Toa Payoh26.4%—N/a ### By-elections ElectionLeaderConstituencies contestedVotes%SeatsResultContestedTotal+/–WonLost(/wiki/1979_Singaporean_by-elections)Seow Khee Leng[Anson](/wiki/Anson_Single_Member_Constituency) [Mountbatten](/wiki/Mountbatten_Single_Member_Constituency)3,9425.3%020 / 7Lost - Official Website of DPP - SgSL: General Election - Democratic Progressive Party (DPP) Democratic Progressive Party (DPP) party symbol, explained by SADeafSG\n",
  "language": "en",
  "processed_at": "2026-01-12T10:07:41.632279",
  "title": "Democratic Progressive Party (Singapore)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Democratic_Progressive_Party_(Singapore)"
}