{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:07:42.854020"
  },
  "content": "As of June 2025, the population of [Singapore](/wiki/Singapore) stood at 6.11 million. Of these 6.11 million, 4.20 million are residents, consisting of about 3.66 million [citizens](/wiki/Singaporeans) and 540,000 [permanent residents](/wiki/Permanent_residency_in_Singapore) (PRs). The remaining 1.91 million people living in Singapore are classed as non-residents, defined as \"foreign workforce across all pass types, dependants and international students\". Singapore is a multi-racial, multi-ethnic and multi-cultural society. Major religions include [Buddhism](/wiki/Buddhism_in_Singapore), [Christianity](/wiki/Christianity_in_Singapore), [Islam](/wiki/Islam_in_Singapore), [Taoism](/wiki/Taoism_in_Singapore) and [Hinduism](/wiki/Hinduism_in_Singapore). Its population is broadly classified under the CMIO system: [Chinese](/wiki/Chinese_Singaporean), [Malay](/wiki/Malay_Singaporean), [Indian](/wiki/Indian_Singaporean) and Other. While Malays are recognised as the indigenous community, 75.5 percent of citizens and permanent residents are ethnic Chinese, with Malays and Indians making up 15.1 and 7.6 percent respectively. These three groups make up 98.2 percent of the ethnic citizen population, while the remaining 1.8 percent, categorised as Other, are largely Eurasians. Non-residents, whose numbers have risen sharply since the 1990s and accounted for nearly 30 percent of the total population in 2020, are excluded from resident statistics and may originate from a wide range of nationalities beyond the CMIO framework. Officially, mixed-race Singaporeans are typically assigned their father's race, though their [identity card](/wiki/National_Registration_Identity_Card) may also reflect both parents' ethnicities. Singapore has four official languages: [English](/wiki/Singapore_English), [Malay](/wiki/Malay_language), [Mandarin](/wiki/Singaporean_Mandarin) and [Tamil](/wiki/Tamil_language). Malay holds the status of [national language](/wiki/National_language), but English is the main [working language](/wiki/Working_language). The [education system](/wiki/Education_in_Singapore) is [bilingual](/wiki/Bilingual), with English as the medium of instruction and a second language, usually Malay, Mandarin or Tamil, also required. [Singlish](/wiki/Singlish), a local [creole](/wiki/Creole_language), is commonly spoken in informal settings across all major ethnic groups. In 2020, the total population growth rate was -0.3 percent. The resident [total fertility rate](/wiki/Total_fertility_rate) (TFR) was 1.10, with Chinese at 0.94, Malays at 1.83 and Indians at 0.97. ## History ### Population growth **Population growth and immigration in selected periods** PeriodPopulation increaseNatural increaseNet immigration1881–189143,857−30,932A74,7981901–191175,729−59,978A135,7071921–1931230,38718,176212,2111947–1957507,800395,600112,2001970–1980339,400315,40024,0001990–2000980,755325,887654,8682000–20101,048,845224,718824,1272010–2020609,075203,643405,432 - **^A** Negative figures are due to low birth rate and high death rate Population growth in Singapore was fuelled by immigration for a long period of time, starting soon after [Stamford Raffles](/wiki/Stamford_Raffles) landed in Singapore in 1819, when the population of the island was estimated to be around 1,000. The first official census taken in January 1824 showed that the resident population of Singapore had grown to 10,683: 4,580 Malays, 3,317 Chinese, 1,925 [Bugis](/wiki/Bugis), 756 natives of India, 74 Europeans, 16 Armenians, and 15 Arabs. Chinese males greatly outnumbered the females; in the 1826 population figures there were 5,747 Chinese males but only 341 Chinese females, in contrast to 2,501 Malay males and 2,289 Malay females. The figures for around a thousand Indians in 1826 were also similarly skewed towards male – 209 male and 35 female [Bengalis](/wiki/Bengalis), 772 males and 5 females from the [Coromandel Coast](/wiki/Coromandel_Coast). By 1836, the population figure had risen to 29,980, and marked a change in demographics as the Malays were outnumbered for the first time; 45.9% of the population were Chinese versus 41.9% for Malays (including Javanese and Bugis). Women from China were discouraged from emigrating, and most of the Chinese females in this early period of Singapore were likely *[nyonyas](/wiki/Peranakan)* from [Malacca](/wiki/Malacca); it was noted in 1837 that there were no Chinese women in Singapore who had emigrated directly from China. The imbalance of the sexes continued for a long period, for example, the 1901 census figures show that there were 130,367 Chinese males compared to 33,674 Chinese females. Such imbalance also meant that fewer people were born in early Singapore, and in the first hundred years, most of the Chinese population in Singapore were immigrants. By the late 1890s, only around 10% of the Chinese population in Singapore were born there. Many of the early migrant workers from China and India did not intend to settle permanently to raise their families in Singapore; they worked to send back remittance to their families back home, and would return to China or India after they had earned enough money. Later an increasing number of Chinese chose to settle permanently in Singapore, especially in the 1920s when it became more favourable to stay in Singapore rather than returning to China. Change in social attitude in the modern era also meant that Chinese women were freer to emigrate from China, and the sex ratio began to normalise. This gradual normalisation of sex ratio led to an increase in the number of native births. Immigration continued to be the main reason for the Chinese population increase in Singapore until the 1931–1947 period when the natural increase in population surpassed the net immigration figure. After [World War II](/wiki/World_War_II), in the period from 1947 to 1957, Singapore saw a massive population increase mostly due to increased number of native births. The birth rate rose and the death rate fell; the average annual growth rate was 4.4%, of which 1% was due to immigration; Singapore experienced its highest birth rate in 1957 at 42.7 per thousand individuals. (This was also the same year the [United States](/wiki/United_States) saw its peak birth rate.) Immigration to Singapore also fell sharply after Singapore independence due to tighter control of immigration from Malaysia and other countries. The population increase became dominated by native births with 315,400 in the 1970–1980 period due to natural increase compared to 24,000 from net migration. However, a lower rate of natural growth in population and the need for low-skill labour resulted in a deliberate shift in policy by the Singapore government to allow more foreigners to live and work in the country, and net migration increased in the 1980–1990 period to nearly 200,000. By the decade of 1990–2000, the net migrant number of over 600,000 had surpassed the natural growth of the population, and accounted for nearly two-thirds of the population increase. The same high level of immigration is also seen in the next decade with 664,083 net migration recorded. Net migration rate9.12 migrants/1,000 population (2006 est.) Due to the continued low birth rate, amongst other reasons, the Singapore government has varied its [immigration policy](/wiki/Immigration_to_Singapore) over the years. As the demand for labour grew with industrialisation, foreign talent with professional qualifications as well as less-skilled foreign workers has made up a significant and increasing proportion of Singapore's total population since the 2000s and 2010s. Curbs on immigration, however, began to be implemented in the 2010s to ease increasing social issues arising from the high level of immigration. ### Population planning Per-period population growth, 1947—2000 PeriodGrowth rate1947—195784.7%1957—197090.8%1970—198013.3%1980—199018.5%1990— 200020.6% The post-war boom in births led to an interest in family planning, and by 1960, the government publicly funded and supported family planning programmes. After independence in 1965, the birth rate had fallen to 29.5 per thousand individuals, and the natural growth rate had fallen to 2.5%. Birth rates in the 1960s were still perceived as high by the government; on average, a baby was born every 11 minutes in 1965. [Kandang Kerbau Hospital](/wiki/Kandang_Kerbau_Hospital) (KKH)—which specialised in women's health and was the most popular hospital to have children—saw over 100 deliveries per day in 1962. In 1966, KKH delivered 39835 babies, earning it a place in the [Guinness Book of World Records](/wiki/Guinness_Book_of_World_Records) for \"largest number of births in a single maternity facility\" for ten years. Because there was generally a massive shortage of beds in that era, mothers with routine deliveries were discharged from hospitals within 24 hours. In September 1965 the [Minister for Health](/wiki/Ministry_of_Health_(Singapore)), [Yong Nyuk Lin](/wiki/Yong_Nyuk_Lin), submitted a white paper to Parliament, recommending a \"Five-year Mass Family Planning programme\" that would reduce the birth rate to 20.0 per thousand individuals by 1970. In 1966, the Family Planning and Population Board (FPPB) had been established based on the findings of the white paper, providing clinical services and public education on [family planning](/wiki/Family_planning). By 1970, the [*Stop at Two*](/wiki/Eugenics_in_Singapore#Stop_at_Two) campaign was firmly established, implementing incentives, disincentives and public exhortation to discourage families from having more than two children. After 1975, the fertility rate declined below replacement level, in a sign that Singapore was undergoing the [demographic transition](/wiki/Demographic_transition). In 1983, the *Graduate Mothers' Scheme* was implemented in an attempt to get educated women, especially women with a university degree, to marry and procreate, while the government encouraged women without an [O-level degree](/wiki/GCE_Ordinary_Level) to get [sterilised](/wiki/Sterilization_(medicine)). This was done out of the [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) government's belief that for the nation to best develop and avoid hardship, the educated classes should be encouraged to contribute to the nation's breeding pool, while the uneducated should not, sparking the *Great Marriage Debate*. In 1986, the government reversed its population policy—except its stance on low-income, lowly-educated women—and initiated the [Have Three or More (if you can afford it)](/wiki/Eugenics_in_Singapore) campaign, offering cash and public administration incentives to have children. In 2001, the Singapore government started its [Baby Bonus](/wiki/Baby_Bonus) scheme. Singapore has one of the lowest [fertility rates](/wiki/Fertility_rate) in the world. In 2012, Singapore total fertility rate (TFR) was 1.20 children born per woman, a [sub-replacement fertility](/wiki/Sub-replacement_fertility) rate. Ethnic Chinese had a fertility of 1.07 in 2004 (1.65 in 1990), while Malays had a TFR of 2.10 (2.69 in 1990). Both figures declined further in 2006. TFR for Indians was 1.30 in 2004 and 1.89 in 1990. The Singapore government has launched several highly publicised attempts to raise the fertility rate and increase awareness of the negative effects of an ageing population, the elderly (65 and above) had constituted 9.9% of its population in 2012; this proportion is still significantly lower than that of many other developed nations, such as the United States and Japan. In February 2015, [National University of Singapore](/wiki/National_University_of_Singapore) launched the \"New Age Institute\" in conjunction with [Washington University in St. Louis](/wiki/Washington_University_in_St._Louis) to conduct research on this issue. ### Area planning The population of Singapore are generally housed within [new towns](/wiki/New_towns_of_Singapore), which are large scale satellite housing developments designed to be self contained. It includes public housing units, private housing, a town centre and other amenities. Since the 1950s, Singapore had a city centre surrounded by slums and squatter colonies. By 1959 when Singapore attained self government, the problem of housing shortage had grown. Combined with a fast population growth, it led to congestion and squalor. The [new towns](/wiki/Planned_community) planning concept was introduced in July 1952 by the country's public housing authority, [Housing and Development Board (HDB)](/wiki/Housing_and_Development_Board), to counter the housing shortage problem and to relocate most of the population crammed within the city centre to other parts of the island. Today, there are 23 new towns and 3 estates within the country, with Bedok being the largest by area and population. ### Population White Paper In early 2013, the [Parliament of Singapore](/wiki/Parliament_of_Singapore) debated the policies set out in the Population White Paper (PWP) titled *A Sustainable Population for a Dynamic Singapore*. The White Paper noted that by 2030, around 900,000 [baby boomers](/wiki/Baby_boomers) would make up one quarter of the citizen population and that the workforce would begin to shrink \"from 2020 onwards\". It projected that by 2030, Singapore's total population could range between 6.5 and 6.9 million, with the resident population between 4.2 and 4.4 million and the citizen population between 3.6 and 3.8 million. To address these challenges, the PWP recommended increasing the number of foreign workers to strike a balance between skilled and less skilled labour, as well as to provide healthcare and domestic services. It also argued that foreign workers support businesses in times of economic growth. The motion was passed by a vote of 77 to 13 in the [People's Action Party](/wiki/People%27s_Action_Party) (PAP)–[dominated Parliament](/wiki/12th_Parliament_of_Singapore), following amendments that removed the phrase \"population policy\" and placed greater emphasis on infrastructure and transport development. Opposition to the motion came from non–PAP parliamentarians, including all seven MPs of the [Workers' Party](/wiki/Workers%27_Party_of_Singapore) (WP). In addition, three [Non-constituency Members of Parliament](/wiki/Non-constituency_Members_of_Parliament) (NCMPs) voted against it, two from the WP and one from the [Singapore People's Party](/wiki/Singapore_People%27s_Party) (SPP). Several [Nominated Members of Parliament](/wiki/Nominated_Members_of_Parliament) (NMPs) also expressed dissent, with three casting votes against the motion and one choosing to abstain. Outside Parliament, the PWP was heavily criticised and panned by opposition parties and government critics. WP's [Low Thia Khiang](/wiki/Low_Thia_Khiang) criticised current measures of increasing the fertility rate, claiming that this would lead to an increase of a higher cost of living and discourage young couples from having more kids. As for current immigration policies, he had noted that immigrants were a source of friction for Singaporeans and that an increased population would put more stress and strain on the urban infrastructure. On 16 February 2013, an estimated 4,000 Singaporeans gathered at the [Speakers' Corner](/wiki/Speakers%27_Corner,_Singapore) in [Hong Lim Park](/wiki/Hong_Lim_Park) to protest against the PWP. Participants voiced concerns that the projected population increase would strain public services and drive up the cost of living. The event was noted as the largest protest of an anti government nature to be held at the Speakers' Corner since its establishment in 2000. ## Population ### Population size and growth by residential status millionyear1234567195019601970198019902000201020202030population (million)Residents (million)Singapore residents (millions) View source data.‰years369121518196019651970197519801985Natural change (per 1000 Residents)Singapore population natural change View source data.TFRyears12345619501960197019801990200020102020Total fertility rate (residents)Singapore total fertility rate View source data. Source: Singapore Department of Statistics YearNumber ('000)Growth (year on year)Land area (km2)Population density (persons per km2)Total populationTotal residentsSingapore citizensPermanent residentsNon-residentsTotal populationTotal residentsSingapore citizensPermanent residentsNon-residents19501,022.1nananana4.4%nananananana19551,305.5nananana4.6%nananananana19601,646.4nananana3.7%nananana581.52,83119651,886.9nananana2.5%nananana581.53,24519702,074.52,013.61,874.8138.860.92.8%nananana586.43,53819752,262.6nananana1.5%nananana596.83,79119802,413.92,282.12,194.387.8131.81.5%1.3%nanana617.83,90719852,7362,482.6nana253.30.1%1.6%nanana620.54,40919903,047.12,735.92,623.7112.1311.32.3%1.7%1.7%2.3%9.0%6334,70619953,524.53,013.52,823.7189.85113.1%1.8%1.4%8.3%11.2%647.55,44320004,027.93,273.42,985.9287.5754.52.8%1.8%1.3%9.9%9.3%682.75,90020054,265.83,467.83,081386.8797.92.4%1.6%0.8%8.6%5.9%697.96,12120105,076.73,771.73,230.7541.01,305.01.8%1.0%0.9%1.5%4.1%712.47,12620155,535.03,902.73,375.0527.71,632.31.2%0.8%1.0%0%2.1%719.17,69720205,685.84,044.23,523.2521.01,641.6-0.3%0.4%0.6%-0.8%0.02%728.37,81020256,111.24,204.53,660.7543.81,906.71.2%0.6%0.7%-0.2%2.7%736.38,300 ### Gender composition of resident population Source: Singapore Department of Statistics YearNumber ('000)Total resident populationMalesFemalesSex ratio (males per 1,000 females)19601,646.4859.6786.81,09319651,886.9973.8913.11,06619702,013.61,030.8982.81,04919752,262.61,156.11,106.51,04519802,282.11,159.01,123.11,03219852,482.61,258.51,224.21,02819902,735.91,386.31,349.61,02719953,013.51,514.01,499.51,01020003,273.41,634.71,638.799820053,467.81,721.11,746.798520103,771.71,861.11,910.697420153,902.71,916.61,986.196520204,044.21,977.62,066.795720254,204.52,044.62,159.9947 ### Age distribution of resident population Source: Singapore Department of Statistics YearAge group (years)Median age (years)0–1415–2425–3435–4445–5455–6465 and over199023.0%16.9%21.5%16.9%9.0%6.7%6.0%29.8200021.9%12.9%17.0%19.4%14.3%7.2%7.2%34.0200520.1%13.0%15.6%17.9%16.2%9.1%8.1%35.8201017.4%13.5%15.1%16.7%16.6%11.7%9.0%37.4201515.4%13.0%14.4%15.8%15.8%13.7%11.8%39.6202014.5%11.4%14.5%14.8%15.0%14.6%15.2%41.5202513.6%10.2%13.9%15.0%14.5%13.9%18.8%43.2 ### Population by sex and age (2025) Source: Age groupMaleFemaleTotal%Total2,044,6302,159,8904,204,5201000–484,93080,630165,5603.935–9102,13097,690199,8204.7510–14105,520101,060206,5804.9115–19107,470103,930211,4005.0320–24111,090107,600218,6905.2025–29132,470131,270263,7406.2730–34155,340164,500319,8407.6135–39151,850168,270321,1207.6140–44146,690165,080311,7707.4245–49143,670158,350302,0207.1850–54149,690159,290308,9807.3555–59141,440148,340289,7806.8960–64147,050149,630284 6267.0465–69133,510138,910296,6807.0670–74103,110111,510214,6205.1075–7970,22082,610152,8303.6380–8431,64043,17074,8101.7885-8918,25029,30047,5501.1390+8,57018,79027,3600.65Age group (years)MalesFemalesTotal population% of total population0–14292,580279,380571,96013.6015–641,386,7601,456,2602,843,02067.6265+365,300424,280789,58018.78 ### Fertility and mortality Fertility and mortality YearTotal live-birthsResident live-birthsCrude birth rate (per 1,000 residents)Total fertility rate (per female)Gross reproduction rate (per female)Net reproduction rate (per female)Total deathsCrude death rate (per 1,000 residents)Infant mortality rate (per 1,000 resident live-births)Life expectancy at birth (years)Life expectancy at birth for males (years)Life expectancy at birth for females (Years)Natural growthNatural change195045.4N.A.N.A.N.A.1282.2195544.3N.A.N.A.N.A.8.149.5196037.55.762.782.546.234.9196529.54.662.272.085.426.3197045,934N.A.22.13.071.491.4210,7175.220.565.864.167.835,21716.9197517.72.0710.975.113.9198041,21740,10017.61.820.880.8612,5054.9872.169.874.728,71212.7198516.61.610.780.764.97.6199051,14249,78718.21.830.880.8713,8914.76.675.373.177.637,25113.5199515.61.670.80.84.83.8200046,99744,76513.71.60.770.7715,6934.52.578768031,3049.2200510.21.260.610.614.42.1200610.31.280.620.614.42.6200710.31.290.620.624.52.1200839,82610.21.280.620.6217,2224.42.122,6045.8200939,5709.91.220.590.5917,1014.32.222,4695.6201037,96735,1299.31.150.560.5517,6104.4281.779.28420,3574.9201139,65436,1789.51.20.580.5818,0274.528279.584.121,6275201242,66310.11.290.620.618,4814.51.882.179.884.324,1825.6201339,7209.31.190.570.5718,9384.6282.480.184.518,9824.7201442,2329.81.250.610.619,3934.71.882.880.584.922,8395.1201542,1851.2419,86222,323201839,03935,0408.81.140.560.5521,28252.183.481.285.517,7573.8201939,27935,3308.81.140.560.5621,44651.783.681.485.717,8333.8202038,59034,3238.51.10.530.5322,0455.21.883.981.586.116,5453.3 - Source: Department of Statistics of Singapore: Population Trends, 2020 Archived 20 June 2021 at the [Wayback Machine](/wiki/Wayback_Machine) ## Vital statistics ### Registered births and deaths Data from [Singapore Department of Statistics](/wiki/Organisation_of_the_Government_of_Singapore), [Ministry of Home Affairs](/wiki/Ministry_of_Home_Affairs_(Singapore)): Notable events in Singaporean demography: - 1942-1945 – [Second World War](/wiki/World_War_II) Average populationLive birthsDeathsNatural changeCrude birth rate (per 1000)Crude death rate (per 1000)Natural change (per 1000)Crude migration rate (per 1000)Total fertility rate (TFR)1900228,40011,9208,7403,18052.238.313.91901232,20012,3408,8603,48053.138.115.01.41902236,10012,7809,0203,76054.138.215.90.61903240,10013,2209,2104,01055.138.316.7-0.11904244,20013,6709,3704,30056.038.417.6-0.81905248,40014,1409,4604,68056.838.118.7-2.01906252,70014,6309,5405,09057.937.820.1-3.21907257,10015,1209,6605,46058.837.521.3-4.21908261,60015,7109,8305,88060.037.622.5-5.41909266,20016,3209,9906,33061.337.523.8-6.61910270,90016,93010,1806,75062.537.624.9-7.71911304,30018,23011,0207,21059.936.223.796.71912311,60019,04011,2407,80061.136.125.0-1.61913319,00019,85011,4908,36062.236.026.2-3.11914326,60020,66011,7108,95063.235.927.4-4.21915334,30021,48011,9309,55064.335.728.6-5.71916342,20022,40012,22010,18065.435.729.7-6.81917350,20023,31012,54010,77066.635.830.8-8.11918358,40024,32015,9608,36067.944.523.3-0.51919366,60024,95012,94012,01068.135.332.8-10.61920375,00025,51013,18012,33068.035.232.9-10.71921417,90026,90014,08012,82064.433.730.780.21922427,80027,54014,28013,26064.433.431.0-8.01923437,90028,22014,56013,66064.533.231.2-8.31924448,20028,94014,82014,12064.533.131.5-8.71925458,80029,66015,04014,62064.732.831.9-9.01926469,70030,44015,26015,18064.832.532.3-9.31927480,90031,23015,52015,71065.032.332.7-9.61928492,40032,02015,74016,28065.032.033.1-9.91929504,20032,84015,96016,88065.231.733.5-10.31930516,40033,68016,18017,50065.231.333.9-10.51931516,40025,83015,9209,91050.030.819.2-19.21932523,80026,24015,61010,63050.129.820.3-6.31933531,20027,16015,53011,63051.129.221.9-8.11934538,90028,02015,44012,58052.028.623.4-9.21935546,90028,93015,31013,62052.928.024.9-10.41936555,10029,82015,24014,58053.727.526.2-11.71937563,50030,61015,36015,25054.327.327.0-12.31938571,90031,50015,48016,02055.127.128.0-13.51939580,40032,46015,66016,80055.927.029.0-14.51940588,90033,30016,02017,28056.527.229.3-15.11941597,30034,11016,51017,60057.127.629.5-15.619421943194419451946638,00033,60016,20017,40052.725.427.31947938,00039,60021,40018,20042.222.819.4441.71948967,00041,90020,90021,00043.321.621.78.51949997,00044,80020,20024,60044.920.324.65.619501,028,00047,50019,90027,60046.219.426.83.419511,060,00050,90018,60032,30048.017.530.5-0.319521,093,00053,90018,40035,50049.316.832.5-2.419531,128,00056,60018,30038,30050.216.234.0-3.019541,165,00058,90018,40040,50050.615.834.8-3.119551,204,00060,20018,90041,30050.015.734.3-2.019561,243,00061,10019,00042,10049.115.333.8-2.619571,317,00066,80019,20047,60050.714.636.121.219581,388,00065,40019,60045,80047.114.133.019.119591,463,00064,80020,20044,60044.313.830.521.919601,646,40061,77510,21051,56537.56.231.390.15.7619611,702,40059,93010,02749,90335.25.929.33.65.4119621,750,20058,97710,17848,79933.75.827.9-0.65.2119631,795,00059,53010,13849,39233.25.627.5-2.65.1619641,841,60058,21710,43447,78331.65.725.9-0.64.9719651,886,90055,72510,26345,46229.55.424.1-0.14.6619661,934,40054,68010,44444,23628.35.422.91.74.4619671,977,60050,56010,52340,03725.65.320.21.63.9119682,012,00047,24110,98236,25923.55.518.0-0.93.5319692,042,50044,56210,22434,33821.85.016.8-1.93.2219702,074,50745,93410,71735,21722.15.217.0-1.53.0719712,122,90047,08811,32935,75922.35.416.86.03.0219722,152,40049,67811,52238,15623.15.417.7-4.03.0419732,193,00048,26911,92036,34922.05.416.61.92.7919742,229,80043,26811,67431,59419.45.214.22.32.3519752,262,60039,94811,44728,50117.75.112.61.92.0719762,293,30042,78311,64831,13518.75.113.6-0.22.1119772,325,30038,36411,95526,40916.55.111.42.41.8219782,353,60039,44112,06527,37616.85.111.60.41.7919792,383,50040,77912,46828,31117.15.211.90.71.7919802,413,94541,21712,50528,71217.64.911.90.71.8219812,532,83542,25012,86329,38717.64.911.648.61.7819822,646,46642,65412,89629,75817.54.911.214.21.7419832,681,06140,58513,32127,26416.35.010.29.21.6119842,732,22141,55613,16228,39416.54.810.42.51.6219852,735,95742,48413,34829,13616.64.910.6-11.41.6119862,733,37338,37912,82125,55814.84.69.45.91.4319872,774,78943,61613,17330,44316.64.711.01.91.6219882,846,10852,95713,69039,26719.84.913.82.21.9619892,930,90147,66914,06933,60017.54.911.52.31.7519903,047,13251,14213,89137,25118.24.712.24.21.8319913,135,08349,11413,87635,23817.14.611.27.01.7319923,230,69849,40214,33735,06516.84.710.94.71.7219933,313,47150,22514,46135,76416.84.610.82.11.7419943,419,04849,55414,94634,60816.24.710.12.11.7119953,524,50648,63515,56933,06615.64.89.42.31.6719963,670,70448,57715,59032,98715.24.79.03.11.6619973,796,03847,33315,30532,02814.54.58.43.01.6119983,927,21343,66415,65728,00713.14.67.13.11.4819993,958,72343,33615,51627,82012.84.57.01.41.4720004,027,88746,99715,69331,30413.74.57.84.21.6020014,138,01241,45115,36726,08411.84.36.320.31.4120024,175,95040,76015,82024,94011.44.46.0-2.31.3720034,114,82637,48516,03621,44910.54.55.22.51.2720044,166,66437,17415,86021,31410.34.45.12.51.2620054,265,76237,49216,21521,27710.24.45.04.81.2620064,401,36538,31716,39321,92410.34.45.07.21.2820074,588,59939,49017,14022,35010.34.54.98.21.2920084,839,39639,82617,22222,60410.24.44.78.21.2820094,987,57339,57017,10122,4699.94.34.52.71.2220105,076,73237,96717,61020,3579.34.44.04.21.1520115,183,68839,65418,02721,6279.54.54.25.21.2020125,312,43742,66318,48124,18210.14.54.64.91.2920135,399,16239,72018,93820,7829.34.63.82.91.1920145,469,72442,23219,39322,8399.84.74.22.61.2520155,535,00242,18519,86222,3239.74.84.09.01.2420165,607,28341,25120,01721,2349.44.83.8-2.91.2020175,612,25339,61520,90518,7108.95.03.31.41.1620185,638,67639,03921,28217,7578.85.03.18.41.1420195,703,56939,27921,44617,8338.85.03.1-6.21.1420205,685,80738,59022,05416,5368.55.22.9-43.81.1020215,453,56638,67224,29214,3808.65.82.631.01.1220225,637,02235,60526,8918,7147.96.31.548.21.0420235,917,64833,54126,8886,6537.46.21.119.00.9720246,036,86033,70326,4427,2617.46.01.218.60.97 ### Current vital statistics PeriodLive birthsDeathsNatural increase**January - September 2024**25,05219,9055,147**January - September 2025**22,49319,7482,745**Difference** -2,559 (-10.21%) -157 (-0.79%) -2,402**Source:** ## Ethnic groups ### Post-independence In the post-independence period after 1965, Singapore's population has been broadly classified into four main groups: [Chinese](/wiki/Chinese_Singaporean), [Malays](/wiki/Malay_Singaporeans), [Indians](/wiki/Indian_Singaporeans) and Others, a category that consists largely of [Eurasians](/wiki/Eurasian_Singaporeans). These groups collectively shape the country's contemporary cultural and social landscape, influencing its cuisine, languages, religions and traditions that are regarded as distinctive to Singapore. The CMIO framework was first proposed in 1956 during [British colonial rule](/wiki/Colony_of_Singapore) as a way to structure the [education system](/wiki/Education_in_Singapore) around [four designated national languages](/wiki/Languages_of_Singapore). Although immigration was a major driver of population growth in Singapore during the colonial period, by the mid-20th century growth became dominated by native births and accelerated following [World War II](/wiki/World_War_II). After [Singapore's separation from Malaysia](/wiki/Independence_of_Singapore_Agreement_1965) in 1965, the free movement of people between the two countries ended, and net immigration fell to a low of 24,000 in the decade from 1970 to 1980 due to tighter immigration controls by the Singaporean government. Meanwhile, fertility among the Chinese population declined sharply after the post-war boom, while fertility among the Malay population remained relatively high. As a result, the Malay share of the population increased to 14.5% in the late-1960s, reversing a long period of decline during the British colonial period. From the 1980s onwards, the government's immigration policy shifted, leading to a sharp increase in the number of immigrants, which once again became an important driver of population growth in Singapore. By the period from 1990 to 2000, immigration had overtaken natural population growth, accounting for nearly two-thirds of the decadal increase with 640,571 net migrants, including non-residents. While the racial composition of citizens has remained relatively constant over the decades, slight shifts are observed in the figures for residents (citizens plus permanent residents). A smaller proportion of immigrants were Malays, resulting in a decline in the percentage of Malays among the resident population. By contrast, the proportion of Indian residents rose to 9.2% in 2010, an increase from 7.4% among citizens alone, largely due to the inflow of migrant workers from [South Asia](/wiki/South_Asia) particularly in the construction sector. The population profile of Singapore changed significantly after the relaxation of immigration policy from the 1980s, with a sharp increase in the number of transient foreigners. Official figures show that the number of non-residents grew from 30,900 in 1970 to 1,641,600 in 2020, representing about a 53-fold increase over 50 years. Their share of the total population rose from 2.9% in 1970 to 28.9% in 2020. Despite this, no further breakdown of the non-resident population (such as by ethnic origin) is publicly provided by Singstat. It is widely assumed that this group comprises individuals from a broad range of countries who generally do not fit into the CMIO classification, which may explain the lack of detailed categorisation. By the mid-2020s, it was estimated that more than 40% of Singapore's total population were of foreign origin, being both permanent residents and non-residents, including foreign workers, students and their dependants, among others. Proportion of non-residents out of total population 197019801990200020102020Non-residents (Residents = Citizens + PRs)2.9%5.5%10.2%18.7%25.7%28.9%Ethnic composition of resident population (Citizens + PRs) ChineseMalaysIndiansOthers197077.0%14.8%7.0%1.2%198078.3%1990200076.8%13.9%7.9%1.4%201074.1%13.4%9.2%3.3%202074.3%13.5%9.0%3.2% - Population pyramids of ethnic group residents in 2020 Chinese Resident Population by Detailed Ethnic Group (2020) GroupPopulation[Hokkien](/wiki/Hoklo_people)1,180,599[Teochew](/wiki/Teochew_people)583,963[Cantonese](/wiki/Cantonese_people)429,329[Hakka](/wiki/Hakka_people)259,153[Hainanese](/wiki/Hainan_people)183,312[Foochow](/wiki/Fuzhou_people)59,609[Henghua](/wiki/Putian_people)26,702[Shanghainese](/wiki/Shanghainese_people)22,503[Hockchia](/wiki/Fuzhou_people)17,070Other Chinese244,529Total3,006,769Malay Resident Population by Detailed Ethnic Group (2020) GroupPopulation[Malay](/wiki/Malays_(ethnic_group))370,445[Javanese](/wiki/Javanese_people)/[Boyanese](/wiki/Bawean_people)154,869Other Malays20,184Total545,498Indian Resident Population by Detailed Ethnic Group (2020) GroupPopulation[Tamil](/wiki/Tamils)198,449[Malayali](/wiki/Malayali)26,693Hindi18,618[Sikh](/wiki/Sikhs)12,589Other Indians105,925Total362,274Resident Population of Other Ethnic Groups by Detailed Ethnic Group (2020) GroupPopulation[Filipino](/wiki/Filipinos)30,893White29,981Eurasian18,060[Burmese](/wiki/Burmese_people)11,899[Arab](/wiki/Arabs)9,028[Thai](/wiki/Thai_people)7,036Others22,772Total fertility rate by ethnic group YearChineseMalaysIndiansTotal19801.732.202.031.8219901.652.691.891.8320001.432.541.591.6020101.021.651.131.1520200.941.820.961.1 ### Pre-independence Singapore, following its founding as a British [free port](/wiki/Free_economic_zone) by [Stamford Raffles](/wiki/Stamford_Raffles) in the 19th century, did not have a sizeable native population as the population became dominated by three main groups of [immigrants](/wiki/Immigrant). When Raffles arrived in Singapore in January 1819, Singapore had approximately 120 Malays, 30 Chinese and some native tribes ([Orang Laut](/wiki/Orang_Laut)) under the rule of the [Temenggung](/wiki/Temenggung). Around 100 of the Malays had originally moved to Singapore from the mainland ([Johor](/wiki/Johor)) in 1811, led by the Temenggung. Other estimates place the then population of Singapore at 1,000, belonging to various local tribes. Early census figures show a long influx of migrant workers into the country, initially consisting mostly of Malays, but shortly thereafter followed by the Chinese. By 1821, the population was estimated to have increased to 4,724 Malays and 1,150 Chinese. In the first census of 1824, 6,505 out of the 10,683 total were Malays and Bugis, constituting over 60% of the population. Large number of Chinese migrants started to enter Singapore just months after it became a British settlement, and they were predominantly male. In 1826, official census figures give a total population of 13,750, with 6,088 Chinese, 4,790 Malays, 1,242 [Bugis](/wiki/Bugis), 1,021 Indians from [Bengal](/wiki/Bengal) (244) and the [Coromandel Coast](/wiki/Coromandel_Coast) (777), smaller number of [Javanese](/wiki/Javanese_people) (267), Europeans (87) and other peoples. The population total of Singapore increased to 16,000 in 1829, 26,000 five years later. By 1836, the Chinese at 13,749 had become the most populous ethnic group, overtaking the broad Malay grouping (12,538, including other groups such as the Bugis, Javanese, and Balinese from the Dutch East Indies). By 1849, the population had reached 59,043, 24,790 of them Chinese. Many of the migrants from China in the 19th century came to work on the pepper and [gambier](/wiki/Uncaria_gambir) plantations, with 11,000 Chinese immigrants recorded in one year. Singapore became one of the entry and dispersal points for large number of Chinese and Indian migrants who came to work in the plantations and mines of the Straits Settlements, many of whom then settled in Singapore after their contract ended. By 1860, the total population had reached around 90,000, of these 50,000 were Chinese, and 2,445 Europeans and Eurasians. The first thorough census in Singapore was undertaken in 1871, and the people were grouped into 33 racial, ethnic or national categories, with Chinese forming the largest group at 57.6%. Censuses were then conducted at 10-year intervals afterwards. The 1881 census grouped the people into 6 main categories, and further subdivided into 47 sub-categories. The 6 broad groups were given as Europeans, Eurasians, Malays, Chinese, Indians and Others in 1921. The Malays group included other natives of the Malay archipelago, the Europeans included Americans, the Indians would be people from the [Indian subcontinent](/wiki/Indian_subcontinent) including what are now [Pakistan](/wiki/Pakistan) and [Bangladesh](/wiki/Bangladesh). In 1901, the total population of Singapore was 228,555, with 15.8% Malays, 71.8% Chinese, 7.8% Indians, and 3.5% Europeans and Eurasians. The Chinese population figure of Singapore has stayed at over 70% of the total since, reaching 77.8% in 1947. After dropping from a peak of 60% in the early years of Singapore, the Malay population settled within the range of 11 and 16% in the first half of the 20th century, while Indians hovered between 7 and just over 9% in the same period. Population of colonial era Singapore Ethnic groupPopulationA1824182618361871190119311957Europeans74871411,9463,8248,08210,826[Eurasians](/wiki/Eurasians_in_Singapore)1172,1644,1206,90311,382Native ChristiansB188421[Armenians](/wiki/Armenians_in_Singapore)161934(81)[Arabs](/wiki/Arab_Singaporeans)152641[Malays](/wiki/Malay_Singaporeans)C4,5804,7909,63226,14836,08065,014197,059Bugis1,9251,2421,962DJavanese267903[Chinese](/wiki/Chinese_Singaporeans)3,3176,08813,74954,572164,041418,6401,090,596[Indians](/wiki/Indian_Singaporeans)7561,0212,93011,61017,82450,811124,084OthersE12506712,6678,27511,982Total10,68313,75029,98097,111228,555557,7451,445,929 - **^A** Population figures do not include transient populations of military personnel and convicts - **^B** Mostly of [Portuguese descent](/wiki/Kristang_people) - **^C** Include other peoples of the [Malay Archipelago](/wiki/Malay_Archipelago) if figures not given separately - **^D** Include Balinese - **^E** Include [Cafres](/wiki/Cafres), Siamese, [Parsis](/wiki/Parsi), Jews, and other groupings if figures not given separately. Annual growth rate for main ethnic groups in selected periods Ethnic group1824–18301849–18601881–18911901–19111931–1947Chinese12.0%5.4%3.5%3.0%3.5%Malays2.9%5.2%0.1%1.5%3.6%Indians6.7%6.8%2.9%5.0%1.9% ## Languages Languages of Singapore (2020)Languagespercent[English](/wiki/Singapore_English)48.3%[Mandarin Chinese](/wiki/Mandarin_Chinese)29.9%[Malay](/wiki/Malay_Language)9.2%[Chinese dialects](/wiki/Chinese_dialects)8.7%[Tamil](/wiki/Tamil_language)2.5%Others1.4% Singapore has four [official languages](/wiki/Official_language): [English](/wiki/English_language), [Malay](/wiki/Malay_language), [Mandarin](/wiki/Standard_Chinese) and [Tamil](/wiki/Tamil_language). [Malay](/wiki/Malay_language) is the national language of the country, although English is the official language used in the [educational system](/wiki/Education_in_Singapore) and by the government. The colloquial English-based creole used in everyday life is often referred to as [Singlish](/wiki/Singlish), spoken by all races of Singapore. The government of Singapore promotes the use of Mandarin. The use of other [Chinese](/wiki/Chinese_language) varieties, like [Hokkien](/wiki/Min_Nan), [Teochew](/wiki/Teochew_dialect), [Cantonese](/wiki/Yue_Chinese) and [Hakka](/wiki/Hakka_dialect), has been declining over the last two decades, although they are still being used especially by the older generations of the Chinese population. About 60% of [Indian Singaporeans](/wiki/Indian_Singaporeans) are Tamils although the percentage of those who speak [Tamil](/wiki/Tamil_language) at home has been declining, with around 37% of Singaporean Indians speaking Tamil at home according to the 2010 census. Other spoken [Indian languages](/wiki/Languages_of_India) are [Punjabi](/wiki/Punjabi_language), [Malayalam](/wiki/Malayalam), [Hindi](/wiki/Hindi) and [Bengali](/wiki/Bengali_language), but none of them alone is spoken by more than 10% of the Indian Singaporeans. As with Chinese Singaporeans, a large proportion of Indian Singaporeans speak English at home. Around 5,000 to 10,000 [Peranakans](/wiki/Peranakan), the early Chinese population of the region, still use the Hokkien-influenced [Malay](/wiki/Malay_language) dialect called [Baba Malay](/wiki/Baba_Malay). Languages of Singapore most frequently spoken at home YearEnglishMandarin ChineseMalayChinese dialectsTamilOthers198011.6%10.2%13.9%59.5%3.1%1.7%199020.3%26.0%13.4%36.7%2.9%0.7%200023.0%35.0%14.1%23.8%3.2%0.9%201032.3%35.6%12.2%14.3%3.3%2.3%202048.3%29.9%9.2%8.7%2.5%1.4% ## Religion The main religions of Singapore are [Chinese folk religion](/wiki/Chinese_folk_religion), [Buddhism](/wiki/Buddhism), [Taoism](/wiki/Taoism), [Confucianism](/wiki/Confucianism), [Christianity](/wiki/Christianity), [Judaism](/wiki/Judaism), [Islam](/wiki/Islam), [Hinduism](/wiki/Hinduism), and [Sikhism](/wiki/Sikhism), with a significant number who profess no religion. Singapore has freedom of religion, although the government restricts some religions such as [Jehovah's Witnesses](/wiki/Jehovah%27s_Witnesses), due to their opposition to conscription. The majority of Malays are [Muslim](/wiki/Islam), while the plurality of Chinese practise Buddhism and syncretic Chinese folk traditions. [Christianity](/wiki/Christianity) is growing in the country. [Taoism](/wiki/Taoism) was overtaken as the second-most prominent religion in the 2000 census among the Chinese as more have increasingly described themselves as Buddhists rather than Taoist. Indians are mostly [Hindus](/wiki/Hindu), though many are [Muslims](/wiki/Muslims), [Sikhs](/wiki/Sikhs), and [Christians](/wiki/Christians). People who practise no religion form the second largest group in Singapore. ## Marriage and divorce This section needs to be **updated**. Please help update this article to reflect recent events or newly available information. *(October 2025)*Marriages and divorces 2008200920102011201220132014201520162017**Number of marriages** (excluding previously married)24,59626,08124,36327,25827,93626,25428,407**Number of divorces** (not including divorces under Muslim law)5,1705,4165,4335,6965,3065,4715,1725,4505,5055,570**Median age of first marriage** (years)...Grooms29.829.830.030.130.130.130.2...Brides27.327.527.728.028.028.128.2**General marriage rate**...Males (per 1,000 unmarried resident males aged 15 to 49)43.543.439.343.543.840.544.4...Females (per 1,000 unmarried resident females aged 15 to 49)39.638.935.339.239.436.940.8**Median age at divorce** (years)...Grooms39.940.541.041.341.642.442.6...Brides36.336.937.437.738.038.238.4**General divorce rate**...Males (per 1,000 married resident males aged 20 years and over)7.57.57.57.67.17.37.0...Females (per 1,000 married resident females aged 20 years and over)7.37.17.27.26.76.96.5**Crude marriage rate** (per 1,000 resident population)6.7**Crude rate of marital dissolution** (per 1,000 resident population)2.0 ## Literacy and education Literacy rate population aged 15 years and above YearTotalMaleFemale196052.6%70.3%32.8%197068.9%83.0%54.3%198082.3%91.4%73.1%199089.1%95.1%83.0%200092.5%96.6%88.6%201095.9%98.0%93.8%202097.1%98.5%95.8%Highest qualification attained of resident non-student population aged 25 years and over YearBelow secondarySecondaryPost-secondary (non-tertiary)Diploma or professional qualificationUniversity200146.9%24.1%6.6%8.9%13.6%201133.4%19.6%8.9%13.6%24.5%202025.5%16.3%10.0%15.3%33.0% Among residents aged 25–39 years, the percentage of university graduates increased from 23.7% in 2001 to 45.9% in 2011 while that who had attained a diploma or professional qualification increased from 15.9% to 22.9% over the same period. ## Employment This section needs to be **updated**. Please help update this article to reflect recent events or newly available information. *(October 2025)* In 2005, the unemployment rate for persons aged 15 years and over was 2.5%, the lowest in the last four years, with a labour force of 2.3 million people. Employment (thousands) YearEmployment *change*Employment in December 201220022003200420052006200720082009201020112012Total−22.9−12.971.4113.3176.0234.9221.637.6115.9122.6129.13,357.6Total (excluding foreign domestic workers)−23.6−11.766.4105.5168.0223.5213.432.9110.6117.7125.83,148.0Locals19.414.949.963.590.990.464.741.856.237.958.72,089.3Foreigners−42.3−27.921.549.885.1144.5156.9−4.259.784.870.41,268.3Foreigners (excluding foreign domestic workers)−43.0−26.616.542.077.1133.1148.7−8.954.479.867.11,058.7Unemployment rate (%) for persons aged 15 years and over YearOverallResidentsSingapore citizens20023.6%4.8%5.1%20034.0%5.2%5.4%20043.4%4.4%4.8%20053.1%4.1%4.4%20062.7%3.6%3.7%20072.1%3.0%3.1%20082.2%3.2%3.4%20093.0%4.3%4.5%20102.2%3.1%3.4%20112.0%2.9%3.0%20122.0%2.8%3.0%20132.0%20142.0% ## Household income ### Average household monthly income The average household monthly income was [SGD](/wiki/Singapore_dollar) 4,943 in 2000, which was an increase of $3,080 in 1990 at an average annual rate of 4.9%. The average household income experienced a drop of 2.7% in 1999 due to economic slowdown. Measured in 1990 dollars, the average household monthly income rose from SGD$3,080 in 1990 to SGD$4,170 in 2000 at an average annual rate of 3.1%. Household income from work ([SGD](/wiki/Singapore_dollar)) Year199019951997199819992000201020112017Average income3,0764,1074,7454,8224,6914,9438,7269,61811,589Median income2,2963,1353,6173,6923,5003,6075,6006,3078,846Households income from work by ethnic group per head ([SGD](/wiki/Singapore_dollar)) Ethnic groupAverage household incomeMedian household income1990200020101990200020102020**Total****3,076****4,943****7,214****2,296****3,607****5,000****7,744**Chinese3,2135,2197,3262,4003,8485,1007,792Malays2,2463,1484,5751,8802,7083,8445,704Indians2,8594,5567,6642,1743,3875,3708,500Others3,8857,2502,7824,775 ### Household income distribution Resident households by monthly household income from work *including* employer CPF contributions (%) Year20002001200220032004200520062007200820092010201120122013201420152016201720182019No working person8.66.999.79.81098.68.69.610.59.39.29.410.49.710.811.812.113.2Retiree households2.62.333.63.73.54.14.13.844.14.54.74.95.75.36.16.97.17.9Below $1,0003.33.944.64.34.34.44.33.84.13.53.232.72.3221.91.91.8$1,000–$1,99912.211.111.511.111.410.910.59.88.37.876.56.26.25.95.75.55.45.35.1$2,000–$2,99913.212.712.511.912.211.411.2108.68.68.27.16.36.35.85.85.45.15.24.9$3,000–$3,99912.611.511.611.711.410.710.89.78.58.98.37.66.66.765.55.35.55.25.2$4,000–$4,99910.29.89.59.49.69.18.98.88.48.17.97.276.35.95.95.45.25.35.4$5,000–$5,9998.38.38.17.97.97.98.17.77.37.57.476.86.46.15.75.95.45.44.9$6,000–$6,9996.76.76.46.96.36.46.96.86.46.96.76.56.15.85.85.85.85.25.24.9$7,000–$7,9995.15.35.14.95.35.45.35.75.95.75.765.85.65.45.35.15.24.64.6$8,000–$8,99944.34.344.14.54.44.75.14.75.15.45.45.15.15.34.954.74.6$9,000–$9,9993.13.53.33.43.33.43.53.84.14.14.24.74.74.64.74.84.64.64.44.1$10,000–$10,9992.42.92.82.72.72.82.93.33.83.73.84.14.14.44.74.34.64.34.34.2$11,000–$11,9991.82.12.11.91.92.12.32.63.22.933.33.83.73.63.83.83.63.83.8$12,000–$12,9991.51.81.51.51.51.81.91.92.42.42.62.73.33.43.33.63.53.23.23.4$13,000–$13,9991.11.41.21.41.31.41.51.922.22.12.42.62.833333.23$14,000–$14,9990.91.11.11.111.11.21.41.71.81.82.12.22.62.62.72.62.72.62.8$15,000–$17,4991.621.81.91.82.122.63.23.23.54.24.64.74.95.25.55.65.85.4$17,500–$19,99911.41.21.11.21.31.41.72.22.12.22.83.13.33.53.844.14.24.1$20,000 and over2.43.22.832.93.43.84.76.45.76.689.29.91112.112.413.313.514.4Resident households by monthly household income from work *excluding* employer CPF contributions (%) Year20002001200220032004200520062007200820092010201120122013201420152016201720182019No working person8.66.999.79.81098.68.69.610.59.39.29.410.49.710.811.812.113.2Retiree households2.62.333.63.73.54.14.13.844.14.54.74.95.75.36.16.97.17.9Below $1,0003.94.44.65.24.84.84.94.744.33.73.43.22.92.42.22.12.122$1,000–$1,99913.813.313.61312.912.311.910.99.598.27.577.26.76.66.46.26.15.9$2,000–$2,99914.714.214.113.913.612.712.411.29.89.99.38.37.37.26.76.56665.5$3,000–$3,99913.112.612.412.212.211.511.310.69.79.99.38.37.77.476.76.46.266.2$4,000–$4,99910.3109.89.79.89.49.59.28.98.58.68.287.46.86.56.56.16.35.8$5,000–$5,9998.28.37.98.27.87.98.27.97.68.27.87.57.36.96.76.76.76.366$6,000–$6,9996.36.36.1666.36.46.76.46.76.66.76.46.36.16.165.85.55.4$7,000–$7,9994.64.74.84.64.854.95.35.95.25.665.95.85.75.95.65.755$8,000–$8,9993.53.93.63.63.83.93.94.24.64.64.85.25.355.255.355.24.6$9,000–$9,9992.632.92.62.72.833.43.93.73.94.24.24.64.74.54.54.54.44.5$10,000–$10,9992.12.22.32.22.12.42.633.43.43.43.74.24.344.34.33.94.24.2$11,000–$11,9991.51.71.31.51.61.81.91.92.52.42.62.73.23.33.33.53.53.43.63.5$12,000–$12,9991.21.41.31.31.41.51.6222.32.22.52.633.13.2333.13.2$13,000–$13,9990.91.111.111.21.21.51.61.81.82.12.32.52.52.72.82.72.72.6$14,000–$14,9990.70.80.70.70.70.90.91.11.41.41.51.81.92.12.32.22.32.42.42.4$15,000–$17,4991.31.61.51.41.51.71.62.12.72.62.83.63.844.14.44.64.95.14.8$17,500–$19,9990.81.110.90.911.31.51.81.61.82.22.62.62.93.23.33.43.23.5$20,000 and over22.52.22.32.52.93.44.25.54.95.76.87.78.39.210.19.910.711.111.7 ### Growth in household income by decile With the recovery from the 1998 economic slowdown, household income growth had resumed for the majority of households in 2000. However, for the lowest two deciles, the average household income in 2000 had declined compared with 1999. This was mainly due to the increase in the proportion of households with no [income earner](/wiki/Income_earner) from 75% in 1999 to 87% in 2000 for the lowest 10%. Households with no income earner include those with retired elderly persons as well as unemployed members. Average monthly household income from work *including* employer CPF contributions among resident employed households([SGD](/wiki/Singapore_dollar)) DecileAverage monthly household income ([SGD](/wiki/Singapore_dollar))Nominal annual change (%)20002001200220032004200520062007200820092010201120122013201420012002200320042005200620072008200920102011201220132014Total5,9476,4176,2296,2766,2856,5936,7927,4318,4148,1958,7269,61810,34810,46911,1437.9−2.90.80.14.93.09.413.2−2.66.510.27.61.26.41st – 10th1,3821,3311,2661,2231,2321,2571,2581,3211,3991,3611,4971,5811,6441,7111,775−3.7−4.9−3.40.72.00.15.05.9−2.710.05.64.04.13.711th – 20th2,2412,2752,1802,1642,1992,2572,3052,4182,7002,6962,9403,1353,3023,3723,6411.5−4.2−0.71.62.62.14.911.7−0.19.16.65.32.18.021st – 30th2,9863,0432,9442,9842,9883,1163,1823,3793,8313,7874,1584,4214,7824,9935,2261.9−3.31.40.14.32.16.213.4−1.19.86.38.24.44.731st – 40th3,6833,8673,7223,7463,7864,0204,0384,3354,9064,9785,4185,7946,1836,3766,8635.0−3.70.61.16.20.47.413.21.58.86.96.73.17.641st – 50th4,5054,6804,5724,6374,6484,8594,9715,3586,0555,9806,6037,0327,6087,9938,3033.9−2.31.40.24.52.37.813.0−1.210.46.58.25.13.951st – 60th5,3045,6775,5225,6385,5045,8656,0276,5617,4927,3197,8408,4369,1339,46910,1087.0−2.72.1−2.46.62.88.914.2−2.37.17.68.33.76.761st – 70th6,3546,7516,6646,7256,6337,1367,1807,9288,9578,7989,31010,10110,89411,29311,8616.2−1.30.9−1.47.60.610.413.0−1.85.88.57.93.75.071st – 80th7,6088,3228,1328,2298,0128,6418,8099,47910,82010,69411,10512,30613,18613,80714,4969.4−2.31.2−2.67.91.97.614.1−1.23.810.87.24.75.081st – 90th9,46110,75510,29410,27110,35010,70111,04812,38614,01313,42313,94315,50916,36616,98418,01713.7−4.3−0.20.83.43.212.113.1−4.23.911.25.53.86.191st – 100th15,94617,46716,99817,14617,49318,07619,10021,14623,96822,90924,44227,86730,37928,68831,1429.5−2.70.92.03.35.710.713.3−4.46.714.09.0−5.68.6Average monthly household income from work *excluding* employer CPF contributions among resident employed households([SGD](/wiki/Singapore_dollar)) DecileAverage monthly household income ([SGD](/wiki/Singapore_dollar))Nominal annual change (%)2000200120022003200420052006200720082009201020112012200120022003200420052006200720082009201020112012Total5,4565,7365,5725,6185,7616,0526,2806,8897,7527,5498,0588,8649,5155.1−2.90.82.55.13.89.712.5−2.66.710.07.31st – 10th1,2851,2091,1511,1121,1401,1621,1651,2231,3001,2641,3851,4601,518−5.9−4.8−3.42.51.90.35.06.3−2.89.65.44.011th – 20th2,0622,0401,9561,9422,0092,0642,1142,2182,4642,4622,6792,8342,985−1.1−4.1−0.73.52.72.44.911.1−0.18.85.85.321st – 30th2,7372,7172,6272,6682,7212,8332,9033,0783,4643,4363,7593,9884,290−0.7−3.31.62.04.12.56.012.5−0.89.46.17.631st – 40th3,3673,4343,3123,3303,4313,6453,6733,9504,4204,4954,8875,2005,5292.0−3.60.53.06.20.87.511.91.78.76.46.341st – 50th4,0974,1494,0434,1034,2004,3904,5144,8705,4555,3915,9596,3036,8001.3−2.61.52.44.52.87.912.0−1.210.55.87.951st – 60th4,8305,0154,8844,9814,9785,3015,4775,9626,7536,6017,0907,5878,1963.8−2.62.0−0.16.53.38.913.3−2.37.47.08.061st – 70th5,7735,9715,8915,9366,0056,4586,5357,2348,1077,9728,4509,1479,8063.4−1.30.81.27.51.210.712.1−1.76.08.27.271st – 80th6,9197,3657,1877,2737,2567,8468,0468,6949,8499,73310,14211,19311,9736.4−2.41.2−0.28.12.58.113.3−1.24.210.47.081st – 90th8,6319,5579,1449,1429,4439,79710,20311,49112,91612,35412,88714,30715,03810.7−4.30.03.33.74.112.612.4−4.44.311.05.191st – 100th14,86215,90515,52415,68816,42517,02118,17020,17422,79721,78423,34526,62229,0127.0−2.41.14.73.66.811.013.0−4.47.214.09.0 ### Household income ratio The disparity in household income had widened in 2000, reflecting the faster income growth for the higher-income households. Gini coefficient among resident employed households Year2000200120022003200420052006200720082009201020112012Household income from work *excluding* employer CPF contributions per household member0.4440.4560.4570.4600.4640.4700.4760.4890.4810.4780.4800.4820.488Household income from work *including* employer CPF contributions per household member0.4420.4540.4540.4570.4600.4650.4700.4820.4740.4710.4720.4730.478Household income from work *including* employer CPF contributions per household member *after* accounting for government transfers and taxes0.4340.4370.4330.4460.4460.4490.4440.4670.4490.4480.4520.4480.459Ratio of household income from work per household member at the 90th percentile to 10th percentile among resident employed households Year2000200120022003200420052006200720082009201020112012Household income from work *excluding* employer CPF contributions per household member7.748.688.498.518.819.269.39.529.619.259.439.129.18Household income from work *including* employer CPF contributions per household member7.758.588.828.818.879.069.239.389.649.439.359.199.14Household income from work *including* employer CPF contributions per household member *after* accounting for government transfers and taxes7.687.827.718.288.248.37.688.687.948.008.17.547.87 - Singapore portal - [Singaporeans](/wiki/Singaporeans) - [Malay Singaporeans](/wiki/Malay_Singaporeans) - [Chinese Singaporeans](/wiki/Chinese_Singaporeans) - [Indian Singaporeans](/wiki/Indian_Singaporeans) - [Arab Singaporeans](/wiki/Arab_Singaporeans) - [Eurasians in Singapore](/wiki/Eurasians_in_Singapore) - [Population planning in Singapore](/wiki/Population_planning_in_Singapore) Library resources about **Demographics of Singapore** - Resources in your library - Resources in other libraries - Census 2000 - Singapore Dept of Statistics\n",
  "language": "en",
  "processed_at": "2026-01-12T10:07:42.853593",
  "title": "Demographics of Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Demographics_of_Singapore"
}