{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:08:03.004613"
  },
  "content": "English amateur golfer (1911–1973) **Diana Jessie Merville Plumpton** (married name Sabine, 4 May 1911 – 8 May 1973) was an English amateur golfer. She reached the final of the 1933 [Women's Amateur Championship](/wiki/Women%27s_Amateur_Championship) and played in the [1934 Curtis Cup](/wiki/1934_Curtis_Cup). ## Golf career In 1929 Plumpton reached the quarter-finals of the [Girls Amateur Championship](/wiki/Girls_Amateur_Championship) at [Stoke Poges](/wiki/Stoke_Poges_Golf_Club), losing to Joan Mitchell at the 20th hole. In 1930 she reached the third round of the Women's Amateur Championship and the fourth round of the [English Women's Amateur Championship](/wiki/English_Women%27s_Amateur_Championship). Plumpton qualified for the match-play stage of the 1931 Women's Amateur Championship but lost to Kathleen Garnham in the first match-play round. In the English championship, she lost in the third round. In the 1932 Women's Amateur Championship, Plumpton finished tied for 4th place in the qualifying but lost to Clem Montgomery in the second round. She reached the third round of the English championship. Plumpton was a surprise finalist in the 1933 Women's Amateur Championship at [Gleneagles](/wiki/Gleneagles_Hotel). She had been short-listed for the England team in the [Women's Home Internationals](/wiki/Women%27s_Home_Internationals), and played before the championship, but was only a reserve for the team. In the qualifying, she finished 23 strokes behind the leader, one of the lower qualifiers. In the first round, she met [Wanda Morgan](/wiki/Wanda_Morgan), who had finished second in the qualifying, beating her 3&1. After convincing wins in the second and third rounds, she met Barbara Daniell in the quarter-finals, winning at the 19th hole, and then beat Diana Fishwick by one hole in the semi-finals. She met [Enid Wilson](/wiki/Enid_Wilson) in the 36-hole final, losing 5&4. She played for the British team in the [Vagliano Trophy](/wiki/Vagliano_Trophy) match, against France, at [St George's Hill Golf Club](/wiki/St_George%27s_Hill_Golf_Club) in late June. She won her foursomes match but lost in the singles. In late 1933 Plumpton was part of a British team that toured South Africa. In 1934, Plumpton played for England in the Women's Home Internationals at [Royal Porthcawl](/wiki/Royal_Porthcawl). Scotland beat England 5–4, with Plumpton losing to [Helen Holm](/wiki/Helen_Holm) at the 19th hole. However, Scotland then lost to Wales and England narrowly won the title. She reached the quarter-finals of the Women's Amateur Championship before losing 3&2 to [Pam Barton](/wiki/Pam_Barton). In July, Plumpton was selected for the British team to play in the [Curtis Cup](/wiki/1934_Curtis_Cup) at [Chevy Chase, Maryland](/wiki/Chevy_Chase,_Maryland). Britain halved the foursomes but was heavily beaten in the singles. Playing with Pat Walker, she won her foursomes match but lost in the singles on the second day. In the 1935 Women's Home Internationals at Royal County Down, Scotland regained the trophy, as they had done in 1927 and 1931, when it had previously been held in Ireland. Ireland beat England 5–4, their first win over England since 1907, to finish runners-up, with England finishing in third place for the first time. Plumpton won two of her matches but lost her match against Ireland. In the Women's Amateur Championship she qualified for the match-play but lost in the second round to Mervyn Barton. In the English championship she lost in the second round. In the 1936 Women's Amateur Championship she qualified but met [Pam Barton](/wiki/Pam_Barton) in the first round, losing by one hole. She was married later in 1936 and lived for a period in Kenya. ## Personal life Plumpton was born in May 1911 in [Singapore](/wiki/Singapore), the daughter of Mr and Mrs Merville Plumpton. In October 1936, she married Noel John Barrington Sabine, of the Kenya Administrative Service, in [Nairobi](/wiki/Nairobi). She died in [Essex](/wiki/Essex) in May 1973, one year after the death of her husband, who died in February 1972. ## Team appearances - [Curtis Cup](/wiki/Curtis_Cup) (representing Great Britain & Ireland): (/wiki/1934_Curtis_Cup) - [Vagliano Trophy](/wiki/Vagliano_Trophy) (representing Great Britain & Ireland): 1933 (winners) - [Women's Home Internationals](/wiki/Women%27s_Home_Internationals) (representing England): 1934 (winners), 1935\n",
  "language": "en",
  "processed_at": "2026-01-12T10:08:03.004153",
  "title": "Diana Plumpton",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Diana_Plumpton"
}