{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:08:06.268455"
  },
  "content": "Cultural dance performanceThis article **may incorporate text from a large language model**. It may include [hallucinated](/wiki/Hallucination_(artificial_intelligence)) information, copyright violations, claims not verified in cited sources, original research, or fictitious references. Any such material should be removed and content with an unencyclopedic tone should be rewritten. *(October 2025)* *(Learn how and when to remove this message)*Dikir Barat Singapura - Part of a series on **Dance-drama of Southeast Asia** Burma - [Peacock dance](/wiki/Peacock_dance) - [Yama Zatdaw](/wiki/Yama_Zatdaw) Cambodia - [Royal Ballet of Cambodia](/wiki/Royal_Ballet_of_Cambodia) - [Khmer Shadow Theatre](/wiki/Khmer_shadow_theatre) - [Lakhon Mohory](/wiki/Theatre_of_Cambodia) - [Lakhon Khol](/wiki/Lakhon_Khol) - [Lakhon Pol Srey](/wiki/Lkhon_pol_srey) - [Yike](/wiki/Yike) Indonesia - [Arja](/wiki/Arja_(theatre)) - [Bajidor Kahot](/wiki/Bajidor_Kahot) - [Baksa kembang](/wiki/Baksa_kembang) - [Bambangan Cakil](/wiki/Bambangan_Cakil) - [Bangsawan](/wiki/Bangsawan) - [Baris](/wiki/Baris_dance) - [Barong](/wiki/Barong_dance) - [Bedhaya](/wiki/Bedhaya) - [Cakalele](/wiki/Cakalele_dance) - [Cendrawasih](/wiki/Cendrawasih_dance) - [Condong](/wiki/Condong) - [Didong](/wiki/Didong) - [Gambuh](/wiki/Gambuh) - [Gambyong](/wiki/Gambyong) - [Gandrung](/wiki/Gandrung) - [Gendang Beleq](/wiki/Gendang_Beleq_(dance)) - [Gending Sriwijaya](/wiki/Gending_Sriwijaya) - [Hudoq](/wiki/Hudoq) - [Indang](/wiki/Indang_(dance)) - [Jaipong](/wiki/Jaipong) - [Janger](/wiki/Janger_dance) - [Joged](/wiki/Joged_dance) - [Joget](/wiki/Joget) - [Jurit ampil kridha warastra](/wiki/Jurit_ampil_kridha_warastra) - [Kabasaran](/wiki/Kabasaran) - [Kancet Papatai](/wiki/Kancet_Papatai) - [Kebagh](/wiki/Kebagh) - [Kebyar Duduk](/wiki/Kebyar_duduk) - [Kecak](/wiki/Kecak) - [Ketoprak](/wiki/Ketoprak) - [Komedie Stamboel](/wiki/Komedie_Stamboel) - [Kuda Lumping](/wiki/Kuda_Lumping) - [Legong](/wiki/Legong) - [Lengger](/wiki/Lengger) - [Lengger lanang](/wiki/Lengger_lanang) - [Lenong](/wiki/Lenong) - [Lilin](/wiki/Candle_dance) - [Ludruk](/wiki/Ludruk) - [Makyong](/wiki/Mak_yong) - [Melinting](/wiki/Melinting) - [Merak](/wiki/Merak_dance) - [Oleg](/wiki/Oleg_dance) - [Ondel-ondel](/wiki/Ondel-ondel) - [Pajoge](/wiki/Pajoge_dance) - [Panyembrama](/wiki/Panyembrama) - [Payung](/wiki/Payung_dance) - [Pendet](/wiki/Pendet_dance) - [Piring](/wiki/Piring_dance) - [Poco-poco](/wiki/Poco-poco) - [Ramayana Ballet](/wiki/Ramayana_Ballet) - [Randai](/wiki/Randai) - [Rejang](/wiki/Rejang_dance) - [Reog](/wiki/Reog) - [Rodat](/wiki/Rodat_(dance)) - [Ronggeng](/wiki/Ronggeng) - [Saman](/wiki/Saman_(dance)) - [Sandiwara](/wiki/Sandiwara) - [Sanghyang](/wiki/Sanghyang) - [Sigale Gale](/wiki/Sigale_Gale) - [Singo Ulung](/wiki/Singo_Ulung) - [Sisingaan](/wiki/Sisingaan) - [Srimpi](/wiki/Srimpi) - [Tandok](/wiki/Tandok_dance) - [Tanggai](/wiki/Tanggai) - [Tebe](/wiki/Tebe_dance) - [Toneel](/wiki/Toneel) - [Topeng](/wiki/Topeng_dance) - [Topeng Banjar](/wiki/Banjar_mask_dance) - [Topeng Betawi](/wiki/Betawi_mask_dance) - [Topeng Cirebon](/wiki/Cirebonese_mask_dance) - [Topeng Ireng](/wiki/Ireng_mask_dance) - [Tor-tor](/wiki/Tor-tor_dance) - [Wayang Wong](/wiki/Wayang_wong) - [Yapong](/wiki/Yapong_dance) - [Zapin](/wiki/Zapin) - [Zapin Api](/wiki/Zapin_Api) Laos - [Classical dance and theatre](/wiki/Dance_and_theatre_of_Laos#Classical_dance_and_theatre) Malaysia - [Adai-adai](/wiki/Adai-adai_(dance)) - [Asyik](/wiki/Asyik) - [Balai](/wiki/Balai_dance) - [Bangsawan](/wiki/Bangsawan) - [Boria](/wiki/Boria_(theatre)) - [Branyo](/wiki/Branyo) - [Ceracap Inai](/wiki/Ceracap_Inai_(dance)) - [Cinta Sayang](/wiki/Cinta_Sayang_(dance)) - [Dabus](/wiki/Dabus_(dance)) - [Daling-daling](/wiki/Pangalay) - [Dikir Barat](/wiki/Dikir_Barat) - [Dondang Sayang](/wiki/Dondang_Sayang) - [Inai](/wiki/Inai_(dance)) - [Indang](/wiki/Indang_(dance)) - [Jikey](/wiki/Jikey) - [Joget](/wiki/Joget) - [Joget Gamelan](/wiki/Malay_Gamelan) - [Kuda Kepang](/wiki/Kuda_Lumping) - [Labi-labi](/wiki/Labi-labi_(dance)) - [Mak Inang](/wiki/Mak_Inang) - [Mek Mulung](/wiki/Mek_Mulung) - [Mak yong](/wiki/Mak_yong) - [Menora](/wiki/Menora_(dance)) - [Ngajat](/wiki/Ngajat) - [Payung](/wiki/Payung_dance) - [Piring](/wiki/Piring_dance) - [Rambong](/wiki/Romvong) - [Randai](/wiki/Randai) - [Rodat](/wiki/Rodat_(dance)) - [Saba](/wiki/Saba_dance) - [Sewang](/wiki/Sewang_dance) - [Sumazau](/wiki/Sumazau) - [Ulek Mayang](/wiki/Ulek_Mayang) - [Zapin](/wiki/Zapin) Philippines - [Binasuan](/wiki/Binasuan) - [Cariñosa](/wiki/Cari%C3%B1osa) - [Itik-itik](/wiki/Itik-itik) - [Jota](/wiki/Jota_(music)#Philippine_jota) - [Kuntaw](/wiki/Kuntaw) - [Maglalatik](/wiki/Maglalatik) - [Pandanggo](/wiki/Pandanggo) - [Pangalay](/wiki/Pangalay) - [Sagayan](/wiki/Sagayan) - [Singkil](/wiki/Singkil) - [Subli](/wiki/Subli) - [Tinikling](/wiki/Tinikling) Singapore - Dikir Barat Singapura Thailand - [Lakhon Khon](/wiki/Khon) - Fon - Hun krabok - [Lakhon Nai](/wiki/Lakhon_nai) - [Lakhon Chatri](/wiki/Lakhon_chatri) - [Lakhon Nok](/wiki/Lakhon_nok) - [Likay](/wiki/Likay) - [Manora](/wiki/Menora_(dance)) - [Ma yong](/wiki/Mak_yong) - [Mor lam](/wiki/Mor_lam) - [Ram wong](/wiki/Romvong) - Ram Thai - Rabam - [Kingkara](/wiki/Peacock_dance) Vietnam - [Nhã nhạc](/wiki/Nh%C3%A3_nh%E1%BA%A1c) - v - t - e **Dikir Barat Singapura** also known as **Dikir Singapura** is a local adaptation of the *[dikir barat](/wiki/Dikir_barat)* [choral](/wiki/Choir) performance art in [Singapore](/wiki/Singapore) that has gained widespread recognition, particularly within its [Malay community](/wiki/Malay_Singaporeans). The art of *dikir barat* developed in the northeastern [Malay Peninsula](/wiki/Malay_Peninsula), specifically in [Patani](/wiki/Patani_(historical_region)), [Kelantan](/wiki/Kelantan) and [Terengganu](/wiki/Terengganu) under the influence of the [Patani Kingdom](/wiki/Patani_Kingdom); the adjective *barat* ('west') indicated its possible origins from [Siam](/wiki/Rattanakosin_Kingdom_(1782%E2%80%931932)) west of the kingdom. Singapore's location on the [Malacca](/wiki/Strait_of_Malacca) and [Singapore](/wiki/Singapore_Strait) straits further south historically lay in direct contact with the [Johor](/wiki/Johor_Sultanate) and [Riau-Lingga](/wiki/Riau-Lingga) sultanates shaping its Malay population's own distinct artistic and cultural traditions. Despite this historical divergence, dikir barat was introduced to Singapore’s Malay community and gradually adapted to its [new environment](/wiki/Social_environment). Over time, Dikir Barat Singapura has undergone stylistic and thematic transformations, differentiating it from its traditional forms in the [Malay Peninsula](/wiki/Malay_Peninsula). Performances often exhibit [faster tempos](/wiki/Tempo) and a wider [thematic](/wiki/Subject_(music)) range, reflecting its integration into Singapore’s [cultural landscape](/wiki/Culture_of_Singapore). Beyond its artistic significance, Dikir Barat in Singapore has become an important vehicle for [community engagement](/wiki/Community_engagement) and cultural continuity among the Malay population. Educational institutions play a key role in sustaining the art form by incorporating it into [co-curricular programs](/wiki/Co-curricular_activity_(Singapore)), where students develop teamwork, creativity and a deeper appreciation of their cultural heritage. In addition to its presence in schools, Dikir Barat is a prominent feature in community events and national celebrations, serving as a platform for the wider promotion of Malay cultural identity within Singapore’s [multicultural society](/wiki/Demographics_of_Singapore). ## History ### Early beginnings The first known dikir barat performance in Singapore occurred in 1975 at [Victoria School](/wiki/Victoria_School). A group of students, inspired by the *Pesta Dendang Rakyat* television show on [RTM](/wiki/Radio_Televisyen_Malaysia), decided to create their own rendition of the performance. While their initial attempts were unpolished, they successfully sparked an interest in dikir barat locally. The Victoria School group began to gain recognition and was invited to perform at various schools, community centers and weddings. Over time, their performances improved and helped shape the development of dikir barat in Singapore. ### Rise in popularity In the 1980s, dikir barat started to attract a broader audience. In 1984, the Malay Literary, Debating and Cultural Society of [Nanyang Junior College](/wiki/Nanyang_Junior_College) organized Singapore's inaugural dikir barat competition for schools, known as *Gema Dikir Barat*. This event was a pivotal moment, generating significant interest among secondary schools and junior colleges, which led them to establish their own dikir barat groups. As a result, many schools began offering dikir barat as an extracurricular activity, allowing students to not only learn this traditional art form but also cultivate essential values such as discipline, teamwork and tolerance. During the 1980s and 1990s, dikir barat continued to evolve, particularly as it began to attract a younger, more diverse audience. Singapore broke from the traditional practice where dikir barat was predominantly performed by men or boys, as girls began to form or join their own dikir barat groups. Youthful performers modernized the genre by incorporating new movements and blending elements from English, Malay and Hindi pop songs into their compositions. By the 1990s, dikir barat had become so popular that groups began recording albums. One of the most notable albums, Dikir Nusantara, released by two prominent groups, sold out within a month of its release. Competitions such as the national dikir barat competition, organized by Majlis Pusat and the People’s Association in 1993, played a crucial role in promoting the art form. Community centers also contributed by forming their own dikir barat groups and organizing performances and competitions. ### Cultural Significance and Major Events As an integral part of Malay culture and heritage, dikir barat has been featured in many cultural and national events in Singapore. One of the most notable was in August 1997, when the Singapore Dikir Barat Federation and the [Singapore Youth Council](/wiki/National_Youth_Council_Singapore) organised Singapore's first dikir barat marathon. The event, held at Youth Park in Somerset, featured over 400 Malay youths performing non-stop for seven hours. In 2007, dikir barat was showcased at the inaugural Malay Arts Festival at the [Malay Heritage Centre](/wiki/Malay_Heritage_Centre) in [Kampong Glam](/wiki/Kampong_Glam). In 2009, a dikir barat performance was part of the cultural showcase for world leaders attending the [Asia-Pacific Economic Cooperation](/wiki/Asia-Pacific_Economic_Cooperation) (APEC) Summit in Singapore. In recent years, dikir barat has also been incorporated into Singapore’s [Chingay parades](/wiki/Chingay_parade), held during Chinese New Year. In 2011, dikir barat was featured as part of the parade performances and in 2012, an outdoor dikir barat competition was held, involving 400 performers on a waterlogged 360-meter platform. Today, dikir barat remains a vibrant and evolving art form in Singapore. With strong support from educational institutions, community centers and organizations like the Singapore Dikir Barat Federation, it continues to play an important role in promoting Malay culture while appealing to a broad and diverse audience. The genre’s adaptability and incorporation of modern elements ensure its relevance for future generations. ## Performance Structure and Elements ### Structure Dikir Barat Singapura is traditionally performed by a choral ensemble, featuring a tok juara (lead vocalist), a tukang karut (jester), a chorus known as the awok-awok consisting of 12–16 individuals and a percussion ensemble. The percussionists typically play instruments such as drums, [gongs](/wiki/Gong), gong-chimes, maracas and sometimes a bamboo flute. The group is usually led by the tukang karut. A typical dikir barat performance begins with the tepuk sepuluh (introductory clapping), which sets the rhythm and tone for the show. This is followed by the lagu juara (opening song), which highlights the vocal abilities of the tok juara. The performance then transitions into the karut kelantan (segue), followed by the karut pattani (call and response). The next segment is the karut yankee, an upbeat and fast-tempo song, which serves as the most lively part of the performance. Finally, the performance ends with variations of the wau bulan (song of the moon kite). The song lyrics, typically written by the tukang karut, employ allegory and allusion for the lagu juara and more direct and incisive language for the tukang karut's parts. ### Communities Involved Dikir barat enjoys a significant following in Singapore, both among practitioners and audiences. The competitive dikir barat scene in Singapore is vibrant, with approximately 70 to 90 active troupes. Many of these groups are formed or supported by educational institutions and community centers. In Singapore, dikir barat performances are segregated by gender, leading to separate male and female groups. Participants in dikir barat are often youths and working adults who dedicate long hours to rehearsals despite having full-time jobs. The performances are well-received by multi-ethnic audiences, particularly at outreach events. ### Evolution and Modern Practices In Singapore, dikir barat has evolved from its traditional Kelantanese roots to develop its own unique style. While performances in Kelantan traditionally focused on traditional life and folk wisdom, dikir barat performances in Singapore have shifted towards urban themes such as work, politics and civic virtues like racial harmony. Additionally, whereas the Kelantanese tukang karut is the central figure in performances, Singaporean dikir barat emphasizes other aspects, such as the synchrony of the awok-awok's movements, the percussion ensemble and the visual presentation of the group. The practice of “freestyle” or [impromptu](/wiki/Impromptu) dikir barat, common in Kelantan, is rare in Singapore, where performers usually memorize the lyrics in advance. Performances are primarily conducted in Malay, incorporating traditional poetic forms like syair and pantun. However, performances for non-Malay-speaking audiences are occasionally delivered in English to broaden the appeal of the art form. ## Community engagement ### Singapore Dikir Barat Federation The Singapore Dikir Barat Federation, also known as GABUNGAN, is a non-profit organization established in January 1993 to support and promote the traditional Malay art form of dikir barat in Singapore. Headquartered at the Kampong Ubi Community Centre, the federation aims to foster the growth of dikir barat through various initiatives, including streamlining activities and providing resources and guidance to dikir barat groups across the country. One of the primary goals of the Singapore Dikir Barat Federation is to actively promote the art form through various community events, performances and competitions. GABUNGAN also emphasizes education and training by conducting workshops and seminars to train dikir barat instructors, ensuring the preservation and transmission of traditional skills and knowledge. Additionally, the federation provides support to dikir barat groups, helping them organize activities and enhance their performances. ### Mega Perdana A hallmark event hosted by the Singapore Dikir Barat Federation is Mega Perdana, which is considered one of the most prestigious dikir barat competitions in Singapore. This biennial event showcases the talents of various dikir barat troupes and serves as a platform for promoting the art form to a wider audience. Mega Perdana highlights the creativity and dedication of participants, further enriching the cultural landscape of Singapore. The federation plays a vital role in fostering community engagement through dikir barat. By organizing competitions in collaboration with community centers and tertiary institutions, GABUNGAN contributes to the vibrancy and sustainability of dikir barat in Singapore. These events not only showcase the artistic capabilities of performers but also encourage participation from diverse segments of the population.\n",
  "language": "en",
  "processed_at": "2026-01-12T10:08:06.267942",
  "title": "Dikir Barat Singapura",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Dikir_Barat_Singapura"
}