{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:08:11.229138"
  },
  "content": "Chinese cuisine **Dim sum** ([traditional Chinese](/wiki/Traditional_Chinese_characters): 點心; [simplified Chinese](/wiki/Simplified_Chinese_characters): 点心; [pinyin](/wiki/Pinyin): *diǎn xīn*; [Jyutping](/wiki/Jyutping): *dim2 sam1*) is a large range of small Chinese dishes that are traditionally enjoyed in restaurants for [brunch](/wiki/Brunch).[*page needed*] Most modern dim sum dishes are commonly associated with [Cantonese cuisine](/wiki/Cantonese_cuisine), although dim sum dishes also exist in other Chinese cuisines. In the tenth century, when the city of Canton ([Guangzhou](/wiki/Guangzhou)) began to experience an increase in commercial travel, many frequented [teahouses](/wiki/Teahouses) for small-portion meals with tea called \"*[yum cha](/wiki/Yum_cha)*\" ([brunch](/wiki/Brunch)).[*page needed*][*page needed*][*page needed*] \"*Yum cha*\" includes two related concepts. The first is \"[jat zung loeng gin](/wiki/One_bowl_with_two_pieces)\" ([Chinese](/wiki/Chinese_language): 一盅兩件), which translates literally as \"one cup, two pieces\". This refers to the custom of serving teahouse customers two delicately made food items, savory or sweet, to complement their tea. The second is *dim sum*, which translates literally to \"touch the heart\", the term used to designate the small food items that accompanied the tea. Teahouse owners gradually added various snacks called dim sum to their offerings. The practice of having tea with dim sum eventually evolved into the modern \"*yum cha*\". Cantonese dim sum culture developed rapidly during the latter half of the nineteenth century in Guangzhou. Cantonese dim sum was originally based on local foods. As dim sum continued to develop, chefs introduced influences and traditions from other regions of China. Cantonese dim sum has a very broad range of flavors, textures, cooking styles, and ingredients and can be classified into regular items, seasonal offerings, weekly specials, banquet dishes, holiday dishes, house signature dishes, and travel-friendly items, as well as breakfast or lunch foods and late-night snacks. Some estimates claim that there are at least two thousand types of dim sum in total across China, but only about forty to fifty types are commonly sold outside of China. There are over one thousand dim sum dishes originating from [Guangdong](/wiki/Guangdong) alone, a total that no other area in China comes even close to matching. In fact, the cookbooks of most Chinese food cultures tend to combine their own variations on dim sum dishes with other local snacks. But that is not the case with Cantonese dim sum, which has developed into a separate branch of cuisine. Dim sum restaurants typically have a wide variety of dishes, usually totaling several dozen. The tea is very important, just as important as the food. Many Cantonese restaurants serve dim sum as early as five in the morning, while more traditional restaurants typically serve dim sum until mid-afternoon. Some restaurants in Hong Kong and Guangdong province even offers dim sum all day till late night. Dim sum restaurants have a unique serving method where servers offer dishes to customers from steam-heated carts. It is now commonplace for restaurants to serve dim sum at dinner and sell various dim sum items [à la carte](/wiki/%C3%80_la_carte) for [takeout](/wiki/Takeout). In addition to traditional dim sum, some chefs also create and prepare new fusion-based dim sum dishes. There are also variations designed for visual appeal on social media, such as dumplings and buns made to resemble animals. ## Etymology The original meaning of the term \"*dim sum*\" remains unclear and contested. Some references state that the term originated in the [Eastern Jin dynasty](/wiki/Eastern_Jin_dynasty) (317 AD–420 AD). According to one legend, to show soldiers gratitude after battles, a general had civilians make buns and cakes to send to the front lines. \"Gratitude\" or 點點心意 ([pinyin](/wiki/Pinyin): *diǎn diǎn xīn yì*; [Jyutping](/wiki/Jyutping): *dim2 dim2 sam1 ji3*), later shortened to 點心, of which *dim sum* is the Cantonese pronunciation, came to represent dishes made similarly. Some versions date the legend to the [Southern Song dynasty](/wiki/Song_dynasty) (960–1279) after the term's earliest attestation in the *[Book of Tang](/wiki/Old_Book_of_Tang)* ([Chinese](/wiki/Traditional_Chinese_characters): 唐書; [pinyin](/wiki/Pinyin): *Táng shū*; [Jyutping](/wiki/Jyutping): *Tong4 Syu1*). Written in the [Five Dynasties and Ten Kingdoms period](/wiki/Five_Dynasties_and_Ten_Kingdoms_period) (907–979), the book uses 點心 as a verb instead: 「治妝未畢, 我未及餐, 爾且可點心」([pinyin](/wiki/Pinyin): *\"Zhì zhuāng wèi bì, wǒ wèi jí cān, ěr qiě kě diǎn xīn\"*; [Jyutping](/wiki/Jyutping): *\"Zi6 zong1 mei6 bat1, ngo5 mei6 kap6 caan1, ji5 ce2 ho2 dim2 sam1\"*), which translates to \"I have not finished preparing myself and am not ready for a proper meal; therefore, you can treat yourself to some small snacks.\"[*page needed*] In this context, \"dim sum\" means \"to barely fill your stomach\".[*page needed*] Dim sum dishes are usually associated with \"*[yum cha](/wiki/Yum_cha)*\" ([Chinese](/wiki/Traditional_Chinese_characters): 飲茶; [pinyin](/wiki/Pinyin): *yǐn chá*; [Cantonese Yale](/wiki/Yale_romanization_of_Cantonese): *yám chàh*), which is known as the [Cantonese](/wiki/Cantonese_cuisine) [brunch](/wiki/Brunch) tradition.****** Chinese food historian [Yan-kit So](/wiki/Yan-kit_So) has described dim sum as: > Literally translated as \"so close to the heart\", they are, in reality, a large range of hors d'oeuvres Cantonese people traditionally enjoy in restaurants (previously teahouses) for breakfast and lunch but never for dinner, washed down with tea. \"Let's go yum cha\" (to drink tea) is understood among the Cantonese to mean going to a restaurant for dim sum; such is the twin linkage between the food and the beverage. ## Cuisine There are at least two thousand types of dim sum in total across China, and over one thousand available in Guangdong alone. Dim sum are usually eaten as breakfast or [brunch](/wiki/Brunch). Cantonese dim sum has a very broad range of flavors, textures, cooking styles, and ingredients, and can be classified into regular items, seasonal offerings, weekly specials, banquet dishes, holiday dishes, house signature dishes, travel-friendly, as well as breakfast or lunch foods and late night snacks. The subtropical climate of the southeast quadrant of Guangdong partly influences dim sum's portion size. It can cause a decrease in appetite, so that people prefer eating scaled-down meals throughout the day rather than the customary three large meals. Teahouses in Guangzhou served \"three teas and two meals,\" which included lunch and dinner, and breakfast, afternoon, and evening teas with dim sum. Many dim sum dishes are made of seafood, chopped meats, or vegetables wrapped in dough or thin wrappings and steamed, deep-fried, or pan-fried. A traditional dim sum brunch includes various types of steamed buns, such as *[cha siu bao](/wiki/Cha_siu_bao)* (a steamed bun filled with barbecue pork), [rice](/wiki/Rice) or [wheat](/wiki/Wheat) [dumplings](/wiki/Dumplings), and [rice noodle rolls](/wiki/Rice_noodle_rolls) that contain a range of [ingredients](/wiki/Ingredients), including [beef](/wiki/Beef), chicken, pork, [prawns](/wiki/Prawns), and [vegetarian](/wiki/Vegetarianism) options. Many dim sum restaurants also offer plates of steamed green vegetables, stuffed eggplant, stuffed green peppers, roasted meats, [congee](/wiki/Congee) and other soups. Dessert dim sum is also available and can be ordered at any time since there is not a set sequence for the meal. It is customary to order \"family-style\", sharing the small dishes consisting of three or four pieces of dim sum among all members of the dining party. Small portion sizes allow people to try a wide variety of food. ### Dishes Dim sum restaurants typically have a wide variety of dishes, usually several dozen. #### Dumplings NameImageChineseDescription[Shrimp dumpling](/wiki/Har_gow)(蝦餃; haa1 gaau2)steamed dumpling with shrimp filling.[Teochew dumpling](/wiki/Fun_guo)(潮州粉粿; *cháozhōu fěnguǒ*; *ciu4zau1 fan2gwo2*; *Chìu jāu fán gwó*)steamed dumpling with [peanuts](/wiki/Peanut), [garlic](/wiki/Garlic), [Chinese chives](/wiki/Allium_tuberosum), pork, dried shrimp, and [Chinese mushrooms](/wiki/Shiitake).Chive dumpling(韭菜餃; *gau2coi3 gaau2*)steamed dumpling with Chinese chives.[Xiaolongbao](/wiki/Xiaolongbao)小笼包; 小籠包; *xiǎolóngbāo*; *siu2lung4baau1*; *síu lùhng bāau*dumplings containing a rich broth and filled with meat or seafood.[Tangbao](/wiki/Tangbao)灌汤包soup-filled steamed buns[Guotie](/wiki/Jiaozi#Guotie)鍋貼; *guōtiē*; *wōtip*pan-fried dumpling, usually with meat and cabbage filling.[Shark fin dumpling](/wiki/Shark_fin_dumpling)魚翅餃steamed dumplings with shrimp, crab sticks, shiitake, and straw mushrooms.[Shumai](/wiki/Shumai)烧卖; 燒賣; *shāomài*; *sīu máai*steamed dumplings with pork and prawns, usually topped off with crab [roe](/wiki/Roe) and mushroom.[Taro dumpling](/wiki/Taro_dumpling)芋角; *yù jiǎo*; *wuh gok*deep-fried dumpling made with mashed [taro](/wiki/Taro) and stuffed with diced mushrooms, shrimp, and pork.Haam seui gok鹹水角; *xiánshuǐ jiǎo*; *hàahm séui gok*deep-fried dumpling with a slightly [savory](/wiki/Umami) filling of pork and chopped vegetables in a sweet and sticky wrapping.Dumpling soup灌湯餃; *guàntāng jiǎo*; *guntōng gáau*soup with one or two big dumplings.[Wonton](/wiki/Wonton)雲吞dumpling filled with ground pork and shrimp #### Rolls NameImageChineseDescription[Spring roll](/wiki/Spring_roll)春卷; 春捲; *chūnjuǎn*; *ceon1 gyun2*; *chēun gyún*a deep-fried roll with various sliced vegetables (such as carrots, cabbage, mushrooms, and [wood ear fungus](/wiki/Cloud_ear_fungus)) and sometimes meat.[Tofu skin roll](/wiki/Tofu_skin_roll)腐皮捲; *fǔpíjuǎn*; *fuh pèih gyún*a roll made of [tofu skin](/wiki/Tofu_skin) filled with various meats and sliced vegetables.Fresh bamboo roll鮮竹卷; *sin1 zuk1 gyun2*a roll made of tofu skin filled with minced pork and [bamboo shoot](/wiki/Bamboo_shoot), typically served in an [oyster sauce](/wiki/Oyster_sauce) broth.Four-treasure chicken roll四寶雞扎; *sei3 bou2 gai1 zaat1*a roll made of tofu skin filled with chicken, [Jinhua ham](/wiki/Jinhua_ham), [fish maw](/wiki/Fish_maw) (花膠), and Chinese mushroom.[Cifantuan](/wiki/Cifantuan)粢饭团; *cífàntuán*steamed glutinous rice rolls[Rice noodle roll](/wiki/Rice_noodle_roll)腸粉; *chángfěn*; *chéungfán*steamed rice noodles with or without meat or vegetable filling. Popular fillings include: beef, dough fritter, shrimp, and [barbecued pork](/wiki/Char_siu). Often served with sweetened [soy sauce](/wiki/Soy_sauce).[Zhaliang](/wiki/Zhaliang)炸兩; *zaa3 loeng2*; *jaléung*steamed rice noodles rolled around *[youjagwai](/wiki/Youtiao)* (油炸鬼), typically doused in soy sauce, [hoisin sauce](/wiki/Hoisin_sauce), or [sesame paste](/wiki/Sesame_paste), and sprinkled with [sesame seeds](/wiki/Sesame_seeds).Duckfeet Roll鴨腳扎Duck feet wrapped in bean curd sheets. #### Buns NameImageChineseDescription[Barbecued pork bun](/wiki/Char_siu_baau) (叉燒包; *chāshāo bāo*; *chāsīu bāau*)bun with barbecued pork filling steamed to be white and fluffy. 叉燒餐包; *chāshāo cān bāo*; *chāsīu chāan bāau* is a variant that is glazed and baked for a golden appearance.Sweet cream bun(奶黃包; *nǎihuáng bāo*; *náaih wòhng bāau*)steamed bun with milk custard filling.[Lotus seed bun](/wiki/Lotus_seed_bun)(蓮蓉包; *lin4 jung4 baau1*)steamed bun with [lotus seed paste](/wiki/Lotus_seed_paste) filling.[Pineapple bun](/wiki/Pineapple_bun)(菠蘿包; *bōluó bāo*; *bo1lo4 baau1*; *bōlòh bāau*)a usually sweet bread roll that does not contain pineapple but has a topping textured like pineapple skin.[Longevity peach](/wiki/Longevity_peach)(壽桃)lotus seed bun sometimes with a filling made of red bean paste or lotus paste.Steamed Chinese Sausage Rolls(臘腸卷)steamed [chinese sausage](/wiki/Chinese_sausage) in a bun #### Cakes NameImageChineseDescription[Turnip cake](/wiki/Turnip_cake)蘿蔔糕; *luóbo gāo*; *lòh baahk gōu*pudding made from a mix of shredded [white radish](/wiki/White_radish), bits of dried shrimp, [Chinese sausage](/wiki/Chinese_sausage) and mushroom that is steamed, sliced, and pan-fried.[Taro cake](/wiki/Taro_cake)芋頭糕; *yùtou gāo*; *wuh táu gōu*pudding made of taro.[Water chestnut cake](/wiki/Water_chestnut_cake)馬蹄糕; *mǎtí gāo*; *máh tàih gōu*pudding made of crispy water chestnut; some restaurants also serve a variation made with bamboo juice.[Nian gao](/wiki/Nian_gao)年糕glutinous rice flour cake, sweetened, usually with brown sugar.Red Date Cake紅棗糕Dessert made with dried [jujubes](/wiki/Jujube) and tapioca flour.Thousand-layer cake千層糕; *qiāncéng gāo*; *cin1cang4 gou1*; *chīnchàhng gōu*a dessert made of many layers of salted egg dough.[Malay sponge cake](/wiki/Malay_sponge_cake)馬拉糕; *mǎlā gāo*; *máhlāai gōu*sponge cake consisting of lard or butter, flour, and eggs.[White sugar sponge cake](/wiki/White_sugar_sponge_cake)白糖糕; *báitáng gāo*; *baahk tòng gōu*steamed sponge cake made with white sugar. #### Meats NameImageChineseDescription[Steamed meatball](/wiki/Steamed_meatball)牛肉丸; *niúròu wán*; *ngàuh yuhk yún*steamed meatballs served on thin tofu skin. Generally served with Worcestershire sauce.[Pearl meatballs](/wiki/Pearl_meatballs)珍珠丸子; *zhēnzhū wánzi*; *zan1 zyu1 jyun2 zi2*steamed meatballs coated with glutinous rice. Traditionally from Hubei and Hunan.[Lion's Head](/wiki/Lion%27s_Head_(food))狮子头; 獅子頭; *Shīzitóu*pork meatballs or beef meatballs stewed with vegetables.[Phoenix claws](/wiki/Chicken_feet)鳳爪; *fèngzhuǎ*; *fuhng jáau*deep fried, boiled, and then steamed chicken feet with [douchi](/wiki/Douchi). \"White Cloud Phoenix Claws\" (白雲鳳爪; *báiyún fèngzhuǎ*; *baahk wàhn fuhng jáau*) is a plain steamed version.[Spare ribs](/wiki/Spare_ribs)排骨; *páigǔ*; *pàaih gwāt*steamed pork spare ribs with *[douchi](/wiki/Douchi)* and sometimes garlic and chili.[Beef tendon](/wiki/Tendon_as_food)牛筋Beef tendons are cooked for a long time until it is very tender. In Hong Kong, it is usually served together with beef brisket and/or radish.[Reticulum](/wiki/Reticulum_(anatomy)) beef [tripe](/wiki/Tripe)金錢肚; *gam1cin4 tou5*[Omasum](/wiki/Omasum) beef tripe牛百葉; *ngau4baak6jip6* (牛柏葉)[Shrimp toast](/wiki/Shrimp_toast)蝦多士Bread coated with a paste made from minced shrimp and cooked by baking or deep frying. #### Seafood NameImageChineseDescription[Deep fried squid](/wiki/Squid_as_food)椒鹽魷魚; *ziu1jim4 jau4jyu2*similar to fried [calamari](/wiki/Calamari), the battered squid is deep-fried.Curry squidsquid served in curry broth. #### Vegetables NameImageChineseDescriptionSteamed [gai lan](/wiki/Gai_lan)芥蘭Steamed vegetables served with oyster sauce, popular varieties include [lettuce](/wiki/Lettuce) (生菜; *shēngcài*; *saang1 coi3*), *[choy sum](/wiki/Choy_sum)* (菜心; *càixīn*; *coi3 sam1*), [gai lan](/wiki/Gai_lan) (芥兰; 芥蘭; *jièlán*; *gaai3 laan2*), or [water spinach](/wiki/Ipomoea_aquatica) (蕹菜; *wèngcài*; *ung3 coi3*).Fried [tofu](/wiki/Tofu)炸豆腐deep fried tofu with [salt and pepper](/wiki/Salt_and_pepper). #### Rice NameImageChineseDescription[Lotus leaf rice](/wiki/Lo_mai_gai)糯米雞; *nuòmǐ jī*; *noh máih gāi*[glutinous rice](/wiki/Glutinous_rice) wrapped in a [lotus](/wiki/Nelumbo) leaf that typically contains [egg yolk](/wiki/Egg_yolk), dried [scallop](/wiki/Scallop), mushroom, and meat (usually pork and chicken). A lighter variant is known as \"pearl chicken\" (珍珠雞; *zhēnzhū jī*; *jānjyū gāi*).[Chinese sticky rice](/wiki/Chinese_sticky_rice)糯米飯; *nuòmǐ fàn*; *noh máih faahn*stir-fried (or steamed) glutinous rice with [Chinese sausage](/wiki/Chinese_sausage), soy sauce-steeped mushrooms, sweet spring onions, and sometimes chicken marinated with a mixture of spices including [five-spice powder](/wiki/Five-spice_powder).[Congee](/wiki/Congee)粥; *zhōu*; *jūk*many kinds of rice porridge, such as the \"Preserved Egg and Pork Porridge\" (皮蛋瘦肉粥; *pídàn shòuròu zhōu*; *pèihdáan sauyuhk jūk*). #### Desserts NameImageChineseDescription[Egg tart](/wiki/Egg_tart)[Chinese](/wiki/Traditional_Chinese_characters): 蛋撻; [pinyin](/wiki/Pinyin): *dàntǎ*; [Jyutping](/wiki/Jyutping): *daan6 taat1*; [Cantonese Yale](/wiki/Yale_romanization_of_Cantonese): *daahn tāat*baked tart with egg custard filling.[Douhua](/wiki/Douhua)豆腐花; *dòufuhuā*; *dauh fuh fā*soft tofu served with a sweet [ginger](/wiki/Ginger) or [jasmine](/wiki/Jasmine) syrup.[Sesame ball](/wiki/Jian_dui)煎堆; *jiānduī*; *zin1 deoi1*; *jīn dēui*)deep fried chewy dough with various fillings (lotus seed, black bean, red bean pastes) coated in sesame seeds.[Coconut pudding](/wiki/Coconut_bar)椰汁糕; *yézhī gāo*; *yèh jāp gōu*light and spongy but creamy coconut milk pudding made with a thin, clear jelly layer made with coconut water on top.[Mango pudding](/wiki/Mango_pudding)芒果布甸; *mángguǒ bùdiàn*; *mōnggwó boudīn*a sweet, rich mango pudding often served with a topping of [evaporated milk](/wiki/Evaporated_milk) and large chunks of fresh mango.[Mango pomelo sago](/wiki/Mango_pomelo_sago)楊枝甘露A Hong Kong dessert made with diced mango, pomelo, sago, coconut milk, and milk.[Black sesame roll](/wiki/Black_sesame_roll)芝麻卷Refrigerated thin layer of black sesame paste[Chinese flaky pastry](/wiki/Chinese_flaky_pastry)叉烧酥Also called Char Siu So. They are triangular, flaky pastries filled with a savory and slightly sweet barbecued pork filling, topped with sesame seeds for added flavor.[Ox-tongue pastry](/wiki/Ox-tongue_pastry)牛脷酥; *ngau4lei6 sou1*a fried oval-shaped dough resembling an ox tongue that is similar to [youjagwai](/wiki/Youtiao), but sugar is added to the flour.[Tong sui](/wiki/Tong_sui)糖水; *tong4 seoi2*sweet dessert soups; popular varieties include [black sesame soup](/wiki/Black_sesame_soup) (芝麻糊), [red bean soup](/wiki/Red_bean_soup) (紅豆沙), mung bean soup (綠豆沙), *[sai mai lo](/wiki/Sai_mai_lo)* (西米露), *[guilinggao](/wiki/Guilinggao)* (龜苓膏), peanut paste soup (花生糊), and [walnut soup](/wiki/Walnut_soup) (核桃糊).[Sweet potato soup](/wiki/Sweet_potato_soup)番薯糖水sweet dessert soups containing sweet potato, rock sugar, and ginger.[Black sesame soup](/wiki/Black_sesame_soup)芝麻糊sweet dessert soups containing Black sesame seed flour; ### Tea Tea is considered to be very important, so much so that it is considered just as important as the food itself. Teas served during dim sum include: - [Chrysanthemum tea](/wiki/Chrysanthemum_tea): instead of tea leaves, it is a flower-based [tisane](/wiki/Tisane) (herbal tea) made from flowers of the species *Chrysanthemum morifolium* or *Chrysanthemum indicum*, which are the most popular in East Asia. To prepare the tea, chrysanthemum flowers (usually dried) are steeped in hot water (usually 90 to 95 °C (194 to 203 °F) after cooling from a boil) in a teapot, cup, or glass. A common mix with [pu-erh](/wiki/Pu%27er_tea) is called *guk pou* ([Chinese](/wiki/Traditional_Chinese_characters): 菊普; [pinyin](/wiki/Pinyin): *jú pǔ*; [Cantonese Yale](/wiki/Yale_romanization_of_Cantonese): *gūk póu*) from its component teas. - [Green tea](/wiki/Green_tea): freshly picked leaves that go through heating and drying processes but not oxidation, so keep their original green color and chemical compounds, like [polyphenols](/wiki/Polyphenols) and [chlorophyll](/wiki/Chlorophyll). Produced all over China, and the most popular category of tea, green teas include the representative [Dragon Well](/wiki/Longjing_tea) ([Chinese](/wiki/Traditional_Chinese_characters): 龍井; [pinyin](/wiki/Pinyin): *lóngjǐng*; [Cantonese Yale](/wiki/Yale_romanization_of_Cantonese): *lùhngjéng*) and [Biluochun](/wiki/Biluochun) from Zhejiang and Jiangsu provinces, respectively. - [Oolong tea](/wiki/Oolong_tea): partially [oxidizing](/wiki/Redox), the tea leaves impart them with characteristics of both green and black teas. Oolong teas are closer in taste to green than black tea, yet have less of a \"grassy\" taste. Major oolong-tea producing areas such as Fujian, Guangdong, and Taiwan line the southeastern coast of China. [Tieguanyin](/wiki/Tieguanyin) or Ti Kuan Yin ([Chinese](/wiki/Traditional_Chinese_characters): 鐵觀音; [pinyin](/wiki/Pinyin): *tiěguānyīn*; [Cantonese Yale](/wiki/Yale_romanization_of_Cantonese): *titgūnyām*): one of the most popular, originated in Fujian province, and is a premium variety with a delightful fragrance. - [Pounei](/wiki/Pu-erh_tea) (Cantonese) or pu-erh tea (Mandarin): usually a [compressed tea](/wiki/Compressed_tea), pu-erh has unique, earthy notes derived from years of fermentation. - [Scented teas](/wiki/Scented_tea): various mixes of flowers with green, black, or oolong teas exist. Flowers used include jasmine, gardenia, magnolia, grapefruit flower, [sweet-scented osmanthus](/wiki/Osmanthus_fragrans), and rose. Strict rules govern the proportion of flowers to tea. Jasmine tea, the most popular scented tea, is the one most often served at \"*yum cha*\" establishments. The tea service includes several customs. Typically, the server starts by asking diners which tea to serve. According to etiquette, the person closest to the teapot pours tea for the others. Sometimes, a younger person will serve an older person. Those receiving tea express thanks by tapping their index and middle fingers twice on the table. According to one legend, the finger-tapping tradition evolved from an incident when an emperor poured tea for his servant in a public teahouse during a trip where the emperor concealed his identity to mingle with the commoners. Having been instructed by the emperor not to expose his identity to the public, the servant showed gratitude by improvising the finger-tapping gesture instead of what should have been a kowtow, which would have betrayed the emperor's noble status. The practice gradually evolved to represent gratitude for having tea poured by others. Diners also flip open the lid (of hinged metal tea pots) or offset the tea pot cover (on ceramic tea pots) to signal an empty pot; servers will then refill the pot. ## History Dim sum is part of the Chinese tradition of [snacks](/wiki/Snack) originating from the [Song dynasty](/wiki/Song_dynasty) (960–1279), when royal chefs created various dishes such as minced pheasant, [lark](/wiki/Eurasian_skylark) tongue, and [desserts](/wiki/Chinese_desserts) made from steamed milk and bean paste. [Guangzhou](/wiki/Guangzhou) experienced an increase in commercial travel in the tenth century[*page needed*] At that time, travelers would frequent teahouses for small-portion meals with tea called \"*yum cha*\" or \"tea\" meals.[*page needed*] *Yum cha* includes two related concepts. The first, 一盅兩件, translates literally as \"one cup, two pieces\". This refers to the custom of serving teahouse customers two delicately made food items, savory or sweet, to complement their tea. The second, 點心, which means dim sum, translates literally to \"touch the heart\" (i.e., heart touching). This is the term used to designate the small food items that accompanied the drinking of tea. During the thirteenth century, when the [Mongols invaded China](/wiki/Mongol_conquest_of_China), the royal court fled to southern China, bringing a royal influence to the dim sum of [Guangzhou](/wiki/Guangzhou). Guangzhou was a wealthy, large port city that had international visitors, a temperate climate, and a coastline where fresh and tropical ingredients were grown, resulting in an ideal environment for food and entertainment. In Guangzhou, street vendors and teahouses sold dim sum. The practice of having tea with dim sum at tea houses eventually evolved into modern *yum cha*. While at the teahouses, travelers selected their preferred snacks from carts. Visitors to tea houses often socialized as they ate, and business people negotiated deals over dim sum. During the [Ming dynasty](/wiki/Ming_dynasty) (1368–1644), the Tea and Horses Bureau was established to monitor tea production and improve tea quality. The improvements in tea quality also led to teahouse improvements. Cantonese dim sum culture developed rapidly during the latter half of the nineteenth century in Guangzhou. Teahouse dining areas were typically located upstairs, and initial dim sum fare included steamed buns. Eventually, these evolved into specialized dim sum restaurants, and the variety and quality of dim sum dishes rapidly followed suit. Cantonese dim sum was originally based on local foods such as sweet roast pork called \"*char siu*\" and fresh [rice noodles](/wiki/Rice_noodles). As dim sum continued to develop, chefs introduced influences and traditions from other regions of [China](/wiki/China), which created a starting point for the wide variety of dim sum available today. Chefs created a large range of dim sum that even today comprises most of a teahouse's dim sum offerings. Part of this development included reducing portion sizes of larger dishes originally from northern China, such as stuffed steamed buns, so they could easily be incorporated into the dim sum menu. The rapid growth in dim sum restaurants was partly because people found the preparation of dim sum dishes to be time-consuming and preferred the convenience of dining out and eating a large variety of baked, steamed, pan-fried, deep-fried, and [braised](/wiki/Braised) foods. Dim sum continued to develop and also spread southward to [Hong Kong](/wiki/Hong_Kong). Although dim sum is normally considered Cantonese, it includes many additional influences. Over thousands of years, as people in China migrated in search of different places to live, they carried the recipes of their favorite foods and continued to prepare and serve these dishes. Many [Han Chinese](/wiki/Han_Chinese) migrated south, seeking warmer climates. Settlements took shape in the [Yangtze River Valley](/wiki/Yangtze_River_Valley), the central highlands, and the coastal southeast, including Guangdong. The influence of [Suzhou](/wiki/Suzhou,_Jiangsu) and [Hangzhou](/wiki/Hangzhou) is found in vegetarian soy skin rolls and [pearl meatballs](/wiki/Pearl_meatballs). The dessert squares flavored with [red dates](/wiki/Jujube) or wolfberries are influenced by [Beijing](/wiki/Beijing) desserts. Savory dishes, such as [pot stickers](/wiki/Jiaozi) and steamed dumplings, include Muslim influences because of people traveling from Central Asia across the [Silk Road](/wiki/Silk_Road) and into Guangdong. These are just a few examples of how a wide range of influences became incorporated into traditional Cantonese dim sum. By 1860, foreign influences had shaped Guangdong's dim sum with culinary innovations such as [ketchup](/wiki/Ketchup), [Worcestershire sauce](/wiki/Worcestershire_sauce), and curry, all of which came to be used in some savory dishes. [Custard](/wiki/Custard) pies evolved into the miniature classics found in every teahouse. Other dim sum dishes evolved from Indian [samosas](/wiki/Samosas), [mango](/wiki/Mango) puddings, and Mexican [conchas](/wiki/Concha_(bread)) (snow-topped buns). Cantonese-style dim sum has an extremely broad range of tastes, textures, cooking styles, and ingredients. As a result, there are more than a thousand different varieties of dim sum. During the 1920s, in Guangzhou, the foremost places to enjoy tea were its tea pavilions, which had refined and expansive surroundings. The customers were wealthy, and there were rather high standards for the privilege of enjoying tea pavilion service and dim sum. Upon entering a tea pavilion, customers would inspect tea leaves to ensure their quality and to verify the water temperature. Once satisfied, these guests were presented with a pencil and a booklet listing the available dim sum. A waiter would then tear their orders out of the booklet so that the kitchen could pan-fry, steam, bake, or deep-fry these dishes on demand. Customers dined upstairs in privacy and comfort. Servers carefully balanced the dishes on their arms or arranged them on trays as they climbed up and down the stairs. Eventually, dim sum carts were used to serve the steamers and plates. People with average incomes also enjoyed tea and dim sum. Early every morning, customers visited inexpensive restaurants that offered filled steamed buns and hot tea. During the mid-morning, students and government employees ordered two or three kinds of dim sum and ate as they read their newspapers. In the late morning, people working at small businesses visited restaurants for breakfast and to use the restaurant as a small office space. By the late 1930s, Guangzhou's teahouse culture included four high-profile dim sum chefs, with signs at the front doors of their restaurants. There was heavy competition among teahouses, and as a result, new varieties of dim sum were invented almost daily, including dishes influenced by the tea pastries of Shanghai, Beijing, and the [Western world](/wiki/Western_world). Many new fusion dishes were also created, including puddings, baked rolls, turnovers, custard tarts, and Malay steamed cakes. There were also significant increases in the variety of thin wrappers used in both sweet and savory items. > If we concentrate only on the changes and developments in the variety of wrappers, the main types of dim sum wrappers during the 1920s included such things as raised (for filled buns), wheat starch, *shao mai* (i.e., egg dough), crystal bun, crispy batter, sticky rice, and boiled dumpling wrappers. By the 1930s, the varieties of wrappers commonly used by chefs included puff pastry, Cantonese short pastry, and so on, for a total of 23 types that were prepared by pan-frying, deep-frying, steaming, baking, and roasting. As the [Chinese Civil War](/wiki/Chinese_Civil_War) progressed from 1927 to 1949, many dim sum chefs left China and settled in Hong Kong, resulting in further refinements and innovations of the dim sum there. Very large dim sum restaurants in major cities like Hong Kong, San Francisco, Boston, Toronto, and New York were also established. In the nineteenth century, Cantonese immigrants brought dim sum to the west and east coasts of the United States. Some of the earliest dim sum restaurants in the U.S. still operating today opened in the [1920s](/wiki/1920s) in [San Francisco](/wiki/San_Francisco) and [New York City](/wiki/New_York_City). The history of San Francisco's Chinese community is believed to have started about 30 years before the first dim sum restaurant opened in the city's [Chinatown](/wiki/Chinatown) neighborhood. The Chinese preferred to live in the present Chinatown area because of its restaurants and theatres. In the late 1930s, some early U.S. newspaper references to dim sum began to appear. While some Chinese restaurants in the U.S. had offered dim sum for decades, it was not until the late 1980s that there was a broader public awareness of dim sum. Although there was increased awareness of dim sum around this time, one chef from Hong Kong, who immigrated to San Francisco, noted that diners in the U.S. usually focused on the food itself and not the communal aspects of eating dim sum. Although dim sum is a Chinese meal, it is a communal dining and social experience that can span hours. It is customary for large groups to enjoy dishes together as a leisurely social activity. Diners go to restaurants early, around 10:00 AM, and rather than ordering a whole table of food, they order small amounts, have a cup of tea, read the newspaper, and wait for friends and family to join them. As a result, a visit to a dim sum restaurant can last from late morning well into the afternoon. For some people in Hong Kong, eating dim sum is a daily routine and a way of life. Since this dim sum tradition is not always present in some U.S. dim sum restaurants, however, approaches to generate interest and attract customers include customized seasoning and flavors of traditional dishes, as well as creating novel dishes with an emphasis on enhanced flavors and visual appeal. One food reviewer notes that there has been an increase in popularity in posting dim sum photos on social media feeds, and that dim sum has become so popular that every U.S. state now has at least one high-quality dim sum restaurant. There is a restaurant, bar, and highly rated dance club complex in Las Vegas, NV, that features high-end Cantonese food (including dim sum), craft cocktails, dinner parties, and prominent [disc jockeys](/wiki/Disc_jockey) in a chic setting. The dim sum restaurants in [Chicago's Chinatown](/wiki/Chicago%27s_Chinatown) serve mainly traditional dim sum dishes, but there has been recent growth in contemporary dim sum with new fusion dishes, as well as restaurants now located outside Chinatown. In Hong Kong, many chefs are also introducing variants based on traditional Cantonese cuisine, which generates interest and provides both Hongkongers and tourists with new, fresh dim sum dishes. ## Modern dim sum In addition to traditional dim sum, some chefs also create and prepare new fusion-based dim sum dishes. Modern versions of buns include pork belly steamed buns with cucumber, green onion, cilantro, and ginger hoisin sauce, cocoa mushroom buns, and chili lamb buns. Dumplings include snow pea shoot and shrimp dumplings, and chili crab with fried garlic, *siu mai* with pork, shrimp, scallop, and caviar, dumplings stuffed with shrimp and peanut, dumplings with South Australian scallop, [garoupa](/wiki/Garoupa) (grouper), caviar, gold leaf, and egg white, and bone marrow or beef short ribs in potstickers. Pastry puff dishes include Australian [Wagyu](/wiki/Wagyu) beef puff, [Assam curry](/wiki/Malaysian_cuisine) chicken puff, and pumpkin puffs. Toast dishes include Hong Kong–style French toast with condensed milk and peanut butter and prawn toast. Additional examples are spring rolls filled with goat and duck skin and duck hearts cooked over a wood-fired grill and served with sesame-horseradish sauce. One AAA four-diamond-award-winning Chinese restaurant in Miami Beach has a prix-fixe dim sum menu, prix-fixe \"yum cha\" menu and breakfast cocktails. Variations designed for visual appeal on social media, such as dumplings and buns made to resemble animals and fictional characters, also exist. Dim sum chefs have previously used cocoa powder as coloring to create steamed bread puffs to appear like forest mushrooms, espresso powder as both flavoring and coloring for deep-fried riblets, as well as pastry cream, and French puffs to create innovative dishes while paying tribute to the history of dim sum. Dim sum has transitioned to become a global culinary staple. According to Britannica, dim sum restaurants exist worldwide. Modernly, many new establishments serve dim sum via order cards or computer systems rather than the traditional steam cart. In immigrant communities across North America, dim sum is adapted to local palates and dining. There are even fusion dim sum dishes now. ### Fast food Dim sum can often be purchased from grocery stores in major cities. They can be cooked easily by steaming, frying, or microwaving. Major grocery stores in Hong Kong, Vietnam, the Philippines, Singapore, Taiwan, China, Indonesia, Malaysia, Brunei, Thailand, Australia, the United States and Canada stock a variety of frozen or fresh dim sum. These include dumplings, *[shumai](/wiki/Shumai)*, pork buns, and others. In Hong Kong and other cities in Asia, dim sum can be purchased from convenience stores, [coffee shops](/wiki/Caf%C3%A9) and other eateries. [Halal](/wiki/Halal)-certified dim sum that uses chicken instead of pork is very popular in Hong Kong, Malaysia, Indonesia and Brunei. ### Restaurants Some Cantonese restaurants serve dim sum as early as five in the morning, while more traditional restaurants typically serve dim sum from mid-morning until mid-afternoon. It is common for restaurants to serve dim sum during dinner as well as for [takeout](/wiki/Takeout). Dim sum is served using a unique serving method whereby servers offer dishes to customers from carts, including some carts that are steam-heated. Diners often prefer tables nearest the kitchen since servers and carts pass by these tables first. Many restaurants place [lazy susans](/wiki/Lazy_susan) on tables to help diners reach food and tea. The pricing of dishes at these types of restaurants may vary, but traditionally they are classified as \"small\", \"medium\", \"large\", \"extra-large\", or \"special\". Servers record orders with a rubber stamp or an ink pen on a bill card that remains on the table. Servers in some restaurants use distinctive stamps to track sales statistics for each server. When they have finished eating, the customer calls the server over, and their bill is calculated based on the number of stamps or quantities marked in each priced section. Another way of pricing the food that was consumed uses the number and color of the dishes left on the table. Some restaurants offer a new approach by using a [conveyor belt](/wiki/Conveyor_belt) format. Other Cantonese restaurants may take orders from a pre-printed sheet of paper and serve [à la carte](/wiki/%C3%80_la_carte), much like Spanish [tapas](/wiki/Tapas) restaurants, to provide fresh, cooked-to-order dim sum or because of real estate and resource constraints. - [Bamboo steamer](/wiki/Bamboo_steamer) - [Cantonese cuisine](/wiki/Cantonese_cuisine) - [Chinese cuisine](/wiki/Chinese_cuisine) - [Dim sim](/wiki/Dim_sim), Australian dumpling inspired by dim sum, with origins in local Cantonese restaurants. - [Hong Kong cuisine](/wiki/Hong_Kong_cuisine) - [List of brunch foods](/wiki/List_of_brunch_foods) - [List of dumplings](/wiki/List_of_dumplings) - China portal - Hong Kong portal - Food portal ## Sources - Hong Kong’s disappearing dim sum: why old-school trolleys and pig liver siu mai are being replaced Archived October 31, 2023, at the [Wayback Machine](/wiki/Wayback_Machine) - A Hong Kong dim sum essential: why bamboo steamers are such a vital part of one of the city’s most loved food traditions Archived November 29, 2023, at the [Wayback Machine](/wiki/Wayback_Machine) - 'Joys of life': Hong Kong food traditions endure in city of flux Archived February 7, 2025, at the [Wayback Machine](/wiki/Wayback_Machine) - How to enjoy dim sum in Hong Kong Archived October 4, 2022, at the [Wayback Machine](/wiki/Wayback_Machine) Listen to this article (8 minutes)was created from a revision of this article dated 19 April 2005 (2005-04-19), and does not reflect subsequent edits.(Audio help · More spoken articles)\n",
  "language": "en",
  "processed_at": "2026-01-12T10:08:11.228700",
  "title": "Dim sum",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Dim_sum"
}