{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:08:14.376892"
  },
  "content": "* *This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Direct School Admission\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(November 2022)* *(Learn how and when to remove this message)*This article includes a list of general references, but **it lacks sufficient corresponding inline citations**. Please help to improve this article by introducing more precise citations. *(November 2022)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* **Direct School Admission** (**DSA**) is a scheme in [Singapore](/wiki/Singapore) introduced in 2004 that allows students to be recognised for their strengths in specific talent areas, such as sports, performing arts, or leadership, alongside their academic performance. The scheme enabled students to secure early admission to schools of their choice. For students entering [secondary school](/wiki/Secondary_school) in 2005, the scheme was categorised as DSA-Secondary (DSA-Sec), primarily for those applying to the [Integrated Programme](/wiki/Integrated_Programme) (IP). In 2005, the Ministry of Education (MOE) extended the scheme to include students seeking direct admissions into junior college, categorising it as DSA-[Junior College](/wiki/Junior_college_(Singapore)) (DSA-JC). A sub-category of DSA-Sec, known as the School-Based Excellence initiative, or informally the 'Niche Scheme', was also introduced. This initiative allowed schools to recognise students with aptitude in non-academic areas. ## History ### Introduction of DSA (2004) The **DSA** scheme was first introduced on 24 September 2004 with DSA-Sec as an alternative pathway for Primary 6 (P6) students' early admission into secondary schools of the student's choice. Unlike traditional methods of admission, which are based solely on academic results, the DSA scheme recognises students for their strengths in both academic and non-academic areas. Through DSA, students can secure a school placement before taking their [Primary School Leaving Examination](/wiki/Primary_School_Leaving_Examination) (PSLE) or Ordinary-Level (O-Level) examination. However, the DSA-JC scheme was introduced later, in 2005, a year after DSA-Sec, allowing Secondary 4 (S4) and Secondary 5 (S5) students to apply for early admissions to junior colleges. This staggered rollout highlights that DSA-Sec was the initial phase of the programme, with DSA-JC following to extend early admissions opportunities to older students seeking placements in JCs before their O-Level examinations. ### Updates and Announcements Updates and changes to the scheme are typically published a year in advance, allowing schools and students adequate time to prepare for the new procedures. ### DSA-Sec and the Integrated Programme (IP) The DSA-Sec scheme was first launched in seven schools offering the [Integrated Programme](/wiki/Integrated_Programme) (IP), enabling P6 students to bypass the O-Level examinations and proceed directly to [junior college](/wiki/Junior_college_(Singapore)) (JC). At its inception, DSA-Sec primarily focused on academic performance and leadership achievements. ### Expansion with the Niche Scheme (2006) In 2006, the scheme underwent an expansion with the introduction of the School-Based Excellence initiative, or informally known as the 'Niche Scheme'. This expansion aimed to recognise students' non-academic talents, such as achievements in sports, music, and the arts, marking a move towards a more holistic admission process. The Niche Scheme allowed schools to admit students based on specialised abilities beyond academics, complementing the existing criteria for leadership and academic excellence. By 2015, the Niche Scheme was gradually phased out to develop the 'Learning for Life' and 'Applied Learning' programmes, which further broadened talent recognition in schools. ## Eligibility All P6, S4 and S5 students are eligible to apply for DSA to schools based on their talents in various areas but specific selection criterias are dependent based on the schools. ## Progression of DSA programmes ### DSA-Secondary #### 2004/ 2005: First Cohort of DSA Applicants for IP The pioneering secondary schools that acecpted the inaugural batch of DSA students in 2004 were institutions offering the [IP](/wiki/Integrated_Programme). The IP allowed students to bypass the O-Level examinations and proceed directly to [junior college](/wiki/Junior_college_(Singapore)). Students who registered for this DSA-Sec scheme would be applying to the school's IP. The schools include: - [Anglo Chinese School (Independent)](/wiki/Anglo-Chinese_School_(Independent)) [ACS(I)] - [Dunman High School](/wiki/Dunman_High_School) (DHS) - [Hwa Chong Institution](/wiki/Hwa_Chong_Institution) (The Chinese High School) (HCI) - [Nanyang Girls' High School](/wiki/Nanyang_Girls%27_High_School) (NYGH) - [The National University of Singapore High School of Mathematics and Science](/wiki/NUS_High_School_of_Math_and_Science) (NUSHS) - [Raffles Girls' School](/wiki/Raffles_Girls%27_School_(Secondary)) (RGS) - [Raffles Institution](/wiki/Raffles_Institution) (RI) These schools were selected due to their established track record in nurturing academic and non-academic talent, making them ideal candidates to lead this initiative. In preparation for their first intake in 2005, they would select P6 students who were scheduled to sit for the PSLE the year before. #### DSA Process and Timeline The DSA exercise was conducted in two phases. During these phases, participating schools reviewed applications and extended DSA offers to successful candidates. The phases were as follows: - Phase One: 18 October 2004 to 22 October 2004 - Phase Two: 8 November 2004 to 12 November 2004 A two-week pause between the two phases allowed schools to review student applications and extend new offers to those on their waiting list.**** #### Withdrawal Periods Students who had accepted a DSA offer but later changed their minds could withdraw their acceptance during the following periods: - Phase One withdrawal: 25 October 2004 to 29 October 2004 - Phase Two withdrawal: 13 November 2004 to 24 November 2004 This process gave students the flexibility to reconsider their choices before finalising their decision. Through DSA admissions, up to 50% of the 2005 Secondary 1 cohort was admitted through the scheme. #### Application Criteria of IP Schools for DSA-Sec in 2004 SchoolsCriteria1Anglo Chinese School (Independent) (ACSI) 1. Academic results from Primary 4 to 6. 2. Results from a General Ability Test, which measuring problem-solving, reasoning, and IQ for P6 students [excluding those in the [Gifted Education Program](/wiki/Gifted_Education_Programme_(Singapore)) (GEP)] 3. The student's personal portfolio, which includes special academic achievements, involvement in Co-Curricular Activities, leadership roles, community service, and any unique talents or project work. 4. A personal statement from the student. 5. An interview, if needed. 2Dunman High School (DHS) 1. Academic results from Primary 4 to 6. 2. A Bilingual Proficiency Test (BPT). 3. Results from a General Ability Test (excluding those in GEP). 4. Special talents in one of the following areas: - Music - Chinese Orchestra - String Ensemble - Sports - Badminton - Basketball - Volleyball - Table Tennis - Academic Areas - Language Arts - Mathematics - Science 3Hwa Chong Institution (The Chinese High School) 1. Exceptional talent in specific academic areas, sports, or performing arts. 2. Demonstrated leadership potential. 3. A positive attitude towards challenges and teamwork. 4. A strong foundation in English, Chinese, and Mathematics. 5. An interview, if needed. 6. Selection will be based on: - A portfolio of the student's achievements. - School records from Primary 4 to 6. - Performance during the selection interview. - Performance during the one-day Hwa Chong Selection Camp. 4Nanyang Girls' High School 1. Exceptional talent in specific academic areas, sports, or performing arts. 2. Demonstrated leadership potential. 3. A positive attitude towards challenges and teamwork. 4. A strong foundation in English, Chinese, and Mathematics. 5. An interview, if needed. 6. Selection will be based on: - A portfolio of the student's achievements. - School records from Primary 4 to 6. - Performance during the selection interview. - Performance during the one-day Hwa Chong Selection Camp. 5NUS High SchoolApplicants will be assessed based on **two or more** of the following criterias: 1. School results from the past three years, especially in areas like mathematics and science. 2. Teachers' recommendation. 3. Interview and/or admission test. 4. Performance at the Mathematics and Science Camp. 6Raffles Girls' School 1. Exemplified talent and passion in Sports or Games, Music or Visual Arts, Mathematics or Science, English or Mother Tongue Language, beyond typical abilities for their students their age. 2. A track record of achievement in Sports or Games, Music or Visual Arts; consistently high academic achievement in Mathematics and/or Science, English and/or Mother Tongue Language. 3. Students will undergo a School-Based General Admissions Test, a Creative Thinking Test, Trials and Selection sessions, or a half-day activity programme to showcase their abilities 4. Interview process 7Raffles Institution 1. Exemplified talent and passion in Sports or Games, Music or Visual Arts, Mathematics or Science, English or Mother Tongue Language, beyond typical abilities for their students their age. 2. A track record of achievement in Sports or Games, Music or Visual Arts; consistently high academic achievement in Mathematics and/or Science, English and/or Mother Tongue Language. 3. Students will undergo a School-Based General Admissions Test, a Creative Thinking Test, Trials and Selection sessions, or a half-day activity programme to showcase their abilities 4. Interview process #### 2005/ 2006: Expansion of DSA-Sec scheme - Introduction of Non-IP Schools and Process Streamlining In 2005, the DSA-Sec scheme was expanded to 43 additional secondary school for the 2006 Secondary 1 cohort, allowing a broader range of schools, including those not offering IP, to participate in the scheme. This expansion provided more students with the opportunity for early admission based on their diverse talents. Additionally, the DSA exercise was streamlined into three stages: the Selection Stage, the Exercise School Preference Stage, and the Results Release Stage. StageDates OccurredInformationSelection Stage27 June 2005 - 31 August 2005 1. Each school carries out its own selection process to review and shortlist student applications. If a student's application is still under consideration, they may be placed on the school's **waiting list**. Those who do not meet the criteria will be informed that they have not been offered a place under the DSA-Sec exercise. 2. Students who receive **Confirmed Offers** are guaranteed a place at the school, provided they meet the following conditions: (1) List the school as one of their choices during the School Preference Stage (2) Qualify for one of the school's academic streams. 3. Students on the **waiting list** will be considered for admission if: (1) List the school as one of their choices during the School Preference Stage (2) Qualify for one of the school's academic streams. Exercise School Preference Stage13 October 2005 - 19 October 2005 1. Students who receive an offer or are placed on the waiting list of a school through the DSA-Sec Exercise will be informed by their primary schools and issued a form to rank their preferred schools in order of priority. 2. If a student gets multiple Confirmed Offers or waiting list notifications, they will need to list their school preferences on the form. 3. If a student selects a school where they have a **Confirmed Offer** or are on a **Waiting List**, they will no longer participate in the **Secondary One Posting Exercise**, which is the central process for other students to choose their schools. 4. After the student submits their preferences and is accepted by a school, any lower-ranked **Confirmed Offers** will be released, allowing other students to be offered those places. Results Release StageLate November 2005 1. The results will be released in late November 2005. 2. All students, including those who participated in the DSA-Sec Exercise, will receive an **Option Form** during the centralized **Secondary One Posting Exercise**. Successful DSA-Sec applicants will be notified of the schools they have been accepted into and will not be permitted to participate in the Secondary One Posting Exercise to select other schools. 3. Unsuccessful DSA-Sec applicants will be informed that none of the schools they had selected were able to offer them a place. As a result, they will be allowed to choose their preferred schools during the **Secondary One Posting Exercise**. During this exercise, they may still opt for the same schools that did not offer them a place through the DSA-Sec Exercise, as only a limited percentage of places in these schools are allocated through the DSA-Sec process. The following is the list of secondary schools who participated in DSA-Sec 2005 for students' admission in the academic year 2006: - [Ahmad Ibrahim Secondary School](/wiki/Ahmad_Ibrahim_Secondary_School) - [Anderson Secondary School](/wiki/Anderson_Secondary_School) - [Anglican High School](/wiki/Anglican_High_School,_Singapore) - Anglo-Chinese (Independent) School - [Bukit Panjang Government High School](/wiki/Bukit_Panjang_Government_High_School) - [Catholic High School](/wiki/Catholic_High_School,_Singapore) - [Cedar Girls' Secondary School](/wiki/Cedar_Girls%27_Secondary_School) - CHIJ Katong Convent School - [CHIJ Secondary School (Toa Payoh)](/wiki/CHIJ_Secondary_(Toa_Payoh)) - [CHIJ St Nicholas Girls' School](/wiki/CHIJ_Saint_Nicholas_Girls%27_School) - [Chung Cheng High School (Main)](/wiki/Chung_Cheng_High_School_(Main)) - [Commonwealth Secondary School](/wiki/Commonwealth_Secondary_School) - [Crescent Girls' School](/wiki/Crescent_Girls%27_School) - [Deyi Secondary School](/wiki/Deyi_Secondary_School) - Dunman High School - [Dunman Secondary School](/wiki/Dunman_Secondary_School) - [Fairfield Methodist Secondary School](/wiki/Fairfield_Methodist_Secondary_School) - Hwa Chong Institution - [Maris Stella High School](/wiki/Maris_Stella_High_School) - [Methodist Girls' School (Secondary)](/wiki/Methodist_Girls%27_School,_Singapore) - [Nan Hua Secondary School](/wiki/Nan_Hua_High_School) - [Nanyang Girls' High School](/wiki/Nanyang_Girls%27_High_School) - [Ngee Ann Secondary School](/wiki/Ngee_Ann_Secondary_School) - Northland Secondary School - National University of Singapore High School - [Paya Lebar Methodist Girls' Secondary School](/wiki/Paya_Lebar_Methodist_Girls%27_School_(Secondary)) - [Presbyterian High School](/wiki/Presbyterian_High_School) - Raffles Girls' School (Secondary) - Raffles Institution - [River Valley High School](/wiki/River_Valley_High_School,_Singapore) - [Singapore Chinese Girls' School](/wiki/Singapore_Chinese_Girls%27_School) - [St Andrew's Secondary School](/wiki/Saint_Andrew%27s_School,_Singapore) - [St Anthony's Canossian Secondary School](/wiki/Saint_Anthony%27s_Canossian_Secondary_School) - [St Hilda's Secondary School](/wiki/St._Hilda%27s_Secondary_School) - [St Joseph's Institution](/wiki/St._Joseph%27s_Institution,_Singapore) - [St Margaret's Secondary School](/wiki/St._Margaret%27s_Secondary_School) - [Tanjong Katong Girls' School](/wiki/Tanjong_Katong_Girls%27_School) - [Tanjong Katong Secondary School](/wiki/Tanjong_Katong_Secondary_School) - [Temasek Secondary School](/wiki/Temasek_Secondary_School) - [Victoria School](/wiki/Victoria_School) - [Xinmin Secondary School](/wiki/Xinmin_Secondary_School) - [Zhonghua Secondary School](/wiki/Zhonghua_Secondary_School) ### DSA-Secondary: The introduction of Niche Programme Schools #### 2005-2007: The introduction of Niche Programmes In addition to using DSA-Sec for P6 students to gain early admission to secondary schools offering IP, MOE also introduced discretionary places under DSA-Sec for secondary schools with approved niche programmes, allowing students to apply based on their specialised talents beyond academics. These schools were permitted to admit up to 5% of their Secondary 1 intake through the DSA scheme. The following are schools that were initially identified in 2005 as schools with approved niche programmes for the academic year 2006: Niche Programme in secondary schools for Academic Year 2006 SchoolNiche ProgrammeAhmad Ibrahim Secondary SchoolShootingDeyi Secondary SchoolPerforming ArtsGan Eng Seng SchoolUniformed GroupsNan Hua Secondary SchoolPerforming ArtsNorthland Secondary SchoolHockeyPresbyterian High SchoolUniformed GroupsSt Andrew's Secondary SchoolRugbySt Hilda's Secondary SchoolVolleyballSt Margaret's Secondary SchoolPerforming & Visual Arts In addition to the schools previously recognised, nine additional schools have been designated as Niche Programme Schools for the academic year 2007, offering specialised programmes in the following areas: Niche Programme in secondary schools for Academic Year 2007 SchoolNiche ProgrammeCHIJ St Theresa's ConventHockeyFuhua Secondary SchoolRoboticsJurong West Secondary SchoolUniformed GroupsMontfort Secondary SchoolBadmintonOutram Secondary SchoolRock-ClimbingPresbyterian High SchoolVolleyballSt Patrick's SchoolMilitary BandYio Chu Kang Secondary SchoolPerforming ArtsYuhua Secondary SchoolConcert Band #### 2015: Phasing out Niche Programmes Schools By 2015, schools began gradually phasing out Niche Programmes in favor of the Learning for Life (LFL) and Applied Learning Programmes (ALP). Both programmes were first introduced in 2013 to equip students with the necessary skills to manage real-world challenges and adapt to a rapidly changing environment. The LFL programmes are designed to instill essential life skills and socio-emotional competencies in students, with a focus on areas such as sports and the performing arts. These programmes aim to nurture resilience, teamwork, and interpersonal skills, preparing students for real-world interactions. On the other hand, the ALP focuses on helping students apply classroom knowledge to real-world scenarios. Schools emphasize skills such as logical thinking, problem-solving, and innovation, enabling students to tackle complex challenges and think critically. ### DSA-Junior College #### 2005/ 2006: First Cohort of DSA Applications for JC Similarly to the DSA-Sec process, DSA-JC exercise takes place before the annual Provisional Pre-U One Admission Exercise (PAE). Students admitted through DSA-JC exercise are not permitted to participate in the PAE. - Phase One: 30 May 2005 to 20 July 2005 - Phase Two: 18 July 2005 to 29 July 2005 In Phase One, all institutions were open for application submissions. However in Phase Two, there was an exception for six junior colleges that did not take part in the second round of applications. These six were: - Anglo-Chinese School (Independent) - Hwa Chong Institution - National Junior College - Raffles Junior College - [Temasek Junior College](/wiki/Temasek_Junior_College) - [Victoria Junior College](/wiki/Victoria_Junior_College) A student may only accept one Confirmed Offer at any given time. If the student decides to change their mind after accepting a Confirmed Offer, they are permitted to withdraw by formally submitting a cancellation form to the MOE Customer Service Centre. ### Development of DSA Scheme In 2014, the admission criteria for the DSA scheme were revised to place greater emphasis on students' personal qualities, including their character, resilience, and leadership abilities, as key factors for selection. In 2017, the MOE raised the percentage of students schools could admit through the DSA scheme. The quota was increased from 5% for schools with Niche Programmes and 10% for Autonomous Schools to a uniform 20% across both school types. Independent schools, already permitted to admit up to 20% of their cohort through DSA, were unaffected by this change. ## Public's Opinion on DSA schemes The DSA scheme has elicited a range of responses from the public, with opinions often reflecting different perspectives on its fairness, effectives, and broader impact on the education system in Singapore. ### Support for Holistic Education The DSA scheme is frequently acknowledged for promoting holistic education by allowing students to gain entry to secondary schools and junior colleges based on their non-academic talents, such as in sports, arts, and leadership, alongside academic performance. This approach is viewed by many as reducing the pressure of high-stakes exams and helping schools identify a wider range of student abilities. However, some educators and parents have expressed reservations about the emphasis on niche areas. One teacher noted that while these programmes offer opportunities beyond academics, their overall impact can be difficult to measure, particularly when academic results remain a key concern for many families. A parent of a Primary Six student similarly acknowledged the benefits of niche programmes but emphasized that academic results ultimately play a decisive role in future educational pathways, especially for students planning to take O-Levels. To address these concerns, the Ministry of Education (MOE) has taken steps to enhance Applied Learning Programmes (ALP) in schools, partnering with external organizations such as the Singapore Science Centre. These initiatives are designed to provide practical learning experiences in areas like science, mathematics, and technology, with a focus on skills development rather than formal assessments. MOE encourages schools to integrate these programmes both inside and outside the standard curriculum to offer students a well-rounded education. ### Concerns About Fairness and Socioeconomic Disparities Some members of the public have raised concerns about the potential fairness of the DSA scheme, suggesting that it may inadvertently favour students from higher socio-economic backgrounds. Students who have greater access to resources such as private tuition, enrichment programmes, and specialised training may be perceived as having an advantage in securing DSA placements. This has led to concerns that the scheme could widen socioeconomic disparities, as families with more financial means can invest in the extracurricular development of their children. Critiques argue that while DSA aims to promote a holistic education system, these advantages may unintentionally benefits certain students more than others. ### Transparency and Selection Criteria Concerns have been raised about the perceived transparency in how students are selected through the DSA scheme. Since each school establishes its own criteria for admissions, there can be significant variations in how students' talents are assessed. Some parents have expressed confusion over the selection process, leading to calls for greater clarity and consistency. Critiques argue that clear communication regarding admissions criteria could help potential misunderstandings and enhance trust in the process. ### COVID-19's Disruption to DSA process The DSA process in Singapore was significantly impacted by the [COVID-19 pandemic](/wiki/COVID-19_pandemic), leading to changes in how selections were conducted to ensure the safety of both students and staff. Traditionally, the DSA process involved in-person trials, auditions, and interviews, but due to health and safety concerns, several adaptations were necessary. 1. **Shift to Online Interviews and Auditions:** Schools transitioned to conducting virtual interviews and auditions to assess students. These online sessions were organized at the students' primary schools using video conferencing platforms to ensure that all students had access to the same resources and technology. This approach was particularly beneficial for talent areas like **performing arts**, where students were able to showcase their abilities through live or pre-recorded performances in an online environment. 2. **No In-Person Trials**: With social distancing measures in place and the suspension of the National School Games, schools were unable to conduct traditional in-person trials for sports admissions.**** As a result, schools placed more weight on a student's track record and demonstrated commitment to the sport, as reflected in their school performance and training efforts, even if they hadn't participated in national competitions. 3. **Equity Considerations**: In response to concerns about equitable access, the Ministry of Education (MOE) made efforts to ensure that students from less advantaged backgrounds were encouraged to apply for DSA, despite the challenges posed by the pandemic. Primary schools were tasked with identifying and supporting students with potential but fewer resources, ensuring that the new e-interview formats did not disadvantage them. #### Long-Term Impact Although the pandemic disrupted the usual selection process, it highlighted the need for education reforms that lessen the focus on exams and grades. COVID-19 prompted schools to reconsider how they evaluate talent and character, encouraging a shift towards adaptability and assessing students beyond standard academic measures. These changes introduced during the pandemic could shape the future of the DSA process, even as things return to normal. Schools may continue to adopt more flexible and student-centered methods of evaluation in the long term. ## The Rigour of Students' Preparation for DSA tests Preparing for the DSA process can be a highly demanding and comprehensive experience for students. The preparation typically involves readiness for interviews, talent trials, and academic tests, each requiring focused effort depending on the talent area. ### Interviews For students applying under areas like leadership, academics, or arts, interviews are a key component of the DSA process. Many students prepare by participating in mock interviews, which help them practice how to present their experiences, skills, and reasons for choosing specific schools. These interviews test not only a student's achievements but also their communication skills, self-confidence, and ability to handle diverse questions. Preparation for this aspect may involve working on personal statements, preparing a portfolio, and receiving feedback from teachers or coachers. ### Academic Tests Students applying based on academic talents often prepare for general ability tests or school-specific assessments. This preparation might involve working through practice papers, enrolling in enrichment programs, or focusing on problem-solving skills in areas like mathematics or science. While these tests are designed to evaluate students' analytical and reasoning abilities, preparation can be particularly rigorous as students strive to demonstrate excellence in these areas. ## Bibliography - CNA. \"Commentary: Is DSA Becoming Almost as Important as the PSLE in the Transition from Primary to Secondary School?\". Retrieved 29 September 2024, from [CNA]. - CNA. \"MOE Will Investigate Any Allegations of Unfair Practices in Direct School Admission Exercise: Chan Chun Sing\". Retrieved 29 September 2024, from [CNA]. - Geniebook. \"Parents' Guide to DSA: Includes Checklist and Interview Questions\". Retrieved 30 September 2024, from [Geniebook]. - MOE. \"COVID-19 Adjustments to 2020 DSA-Sec\". www.moe.gov.sg. Retrieved 30 September 2024, from [MOE]. - MyPrivateTutor Singapore Blog. \"The Crucial Reason Behind the Push for Applied Learning in Singapore\". Retrieved 29 September 2024, from [MyPrivateTutor Blog]. - National Archives of Singapore. (19 May 2005). \"43 Secondary Schools to Participate in the Direct School Admission Exercise for Admission to Secondary One in 2006\" (PDF). Retrieved 29 September 2024, from [National Archives of Singapore]. - National Archives of Singapore. (9 May 2005). \"Direct Admission Exercise 2005 for JC1 and Equivalent Level\" (PDF). Retrieved 29 September 2024, from [National Archives of Singapore]. - National Archives of Singapore. (27 April 2007). \"Programme for School-Based Excellence for Primary Schools and Niche Programme for Secondary Schools 2007\" (PDF). Retrieved 29 September 2024, from [National Archives of Singapore]. - National Archives of Singapore. (24 September 2004). \"Direct School Admission for Integrated Programme\" (PDF). Retrieved 29 September 2024, from [National Archives of Singapore]. - National Library Board. \"Direct School Admission (DSA)\". www.nlb.gov.sg. Retrieved 29 September 2024. - National Library Board. \"Direct School Admission (DSA)\". www.nlb.gov.sg. Retrieved 29 September 2024. - NewspaperSG. (8 March 2014). \"Sec Schools Must Assess Students 'Holistically'\". Retrieved 29 September 2024. - PD STEM Education. \"How to Prepare for DSA Interviews: Top Ten Questions\". Retrieved 29 September 2024, from [PD STEM Education]. - Science Centre Singapore. \"Applied Learning Programme Singapore | STEM Inc at Science Centre\". Retrieved 30 September 2024, from [Science Centre Singapore]. - Tan, Charlene. (14 February 2017). \"Private Supplementary Tutoring and Parentocracy in Singapore\". Interchange. 48: 317. doi:10.1007/s10780-017-9303-4 – via CrossMark. - Tan, Charlene. (3 October 2017). \"Parental Responses to Education Reform in Singapore, Shanghai, and Hong Kong\". Asia Pacific Education Review. 20: 93. doi:10.1007/s12564-018-9571-4 – via CrossMark. - The Learning Lab. \"The DSA Checklist For Your Child | The Learning Lab\". Retrieved 29 September 2024, from [The Learning Lab]. - The Straits Times. (25 October 2005). \"The Primary Six Day of Reckoning\". p. 23. Retrieved 22 November 2022, via NewspaperSG. - TODAY. \"DSA Revisions Laudable, but Challenge Lies in Transparency\". Retrieved 29 September 2024, from [TODAY]. - TODAY. \"Niche Scheme in Primary Schools Being Gradually Phased Out\". Retrieved 29 September 2024, from [TODAY]. - Reference Article to DSA - Reference article to Discretionary Admissions\n",
  "language": "en",
  "processed_at": "2026-01-12T10:08:14.376497",
  "title": "Direct School Admission",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Direct_School_Admission"
}