{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:08:17.580910"
  },
  "content": "[Singapore](/wiki/Singapore) does not have a formal definition of [disability](/wiki/Disability). Singapore signed on to the [Convention on the Rights of Persons with Disabilities](/wiki/Convention_on_the_Rights_of_Persons_with_Disabilities) in 2013 and coordinates the Enabling Masterplan with both government and [non governmental organisations](/wiki/Non-governmental_organization). ## History A discourse of charity generally permeated in Singapore since the post World War 2 period. Support for disabled people was left to the community, who set up various voluntary organisations. The end of the war saw the British implement the welfare state based on the Beveridge Report, which had repercussions in Singapore. As part of this focus on welfare, a Social Welfare Department (SWD) was set up in 1946. SWD was meant to provide permanent assistance only for those with a permanent disability or because of old age. However, the SWD was not as comprehensive as the British system. The SWD also did not provide provisions for [special education](/wiki/Special_education) and in fact, seemed to have the idea that children with special needs would \"hinder the typical child's education.\" The 1960s and 1970s, with Singapore's emphasis on economic growth, saw a new priority on rehabilitating disabled people so as to enable them to join and return to the work force. It was only in 1981, when the first world congress of Disabled People's International was held in Singapore that began a new discourse based on the [social model of disability](/wiki/Social_model_of_disability). Disabled activists from around the world, including [Vic Finkelstein](/wiki/Vic_Finkelstein), [Ed Roberts](/wiki/Ed_Roberts_(activist)) and [Bengt Lindqvist](/wiki/Bengt_Lindqvist), elected a Singaporean, Ron Chandran Dudley as the first founder chairperson. This was to lead to a growth in disability activism from the 1980s onwards. In 1983, the [Ministry of Social Affairs](/wiki/Ministry_of_Social_and_Family_Development) held a workshop on people with disabilities and came up with a formal policy about how to advocate for people with disabilities. The workshop came up with the first nationally endorsed definition of disability that recognized their needs in society. The Advisory Council on the Disabled was formed in April 1988 and was first chaired by [Tony Tan](/wiki/Tony_Tan). The council emphasized the importance of integrating disabled people as equal citizens. Prime Minister [Goh Chok Tong](/wiki/Goh_Chok_Tong) included disabled people on the [Remaking Singapore](/wiki/Remaking_Singapore_Committee) campaign in 2002. Also in 2002, the government created a voluntary, affordable form of [health insurance](/wiki/Health_insurance) called ElderShield. The insurance helps pay for expenses in the care of severely disabled people. In 2013, Singapore signed onto the [Convention on the Rights of Persons with Disabilities](/wiki/Convention_on_the_Rights_of_Persons_with_Disabilities) (UNCRPD). ## Demographics For individuals over 50, around 13.3% are considered disabled; between ages 18 and 49, around 3.4% are disabled and 2.1% of children under 18 are disabled in Singapore. Of those who have a disability, around half are considered physical or sensory disabilities. One in 68 children in Singapore has been diagnosed with [autism](/wiki/Autism). The number of children diagnosed with autism has increased in Singapore over time. Around 5 to 6 percent of children born in Singapore have developmental problems of various types. Only 0.55% of the Singapore workforce has a disability of some kind. ## Causes Around half of people with physical disabilities acquired them through [congenital](/wiki/Congenital_disorder) or hereditary means. ## Cultural attitudes towards disability In Singapore, there has been an emphasis on rehabilitating those with disabilities. People who were unable to work have often been seen through a [utilitarian](/wiki/Utilitarianism) lens, since they were deemed as unable to contribute economically to the country. In addition, the prevention of disabilities was seen as important. In 1970, Singapore passed the Voluntary Sterilisation Act (VSA) which allowed any spouse, parent or legal guardian of a person with recurring or permanent mental or physical disabilities to consent to sterilization on their behalf. This gave caregivers of people with disabilities \"inordinate power to make decisions on their behalf.\" During the 1980s and 90s, many disabled people were kept at home or put into institutions. People who have disabilities that are less obvious face social judgement and stigma for their disability. They are often questioned whether they need assistance because they don't \"look\" disabled. A 2015 study conducted by the [National Council of Social Service](/wiki/National_Council_of_Social_Service) (NCSS) found that a third of people in Singapore would not employ individuals with disabilities. Many Singaporeans are unsure how to interact with people with disabilities because the [etiquette](/wiki/Etiquette) in such situations was unclear. ## Sport Since the founding of the Singapore Disability Sports Council (then named the \"Singapore Sports Council for the Handicapped\") in 1973, Singaporean disabled athletes started participation in regional and [Commonwealth](/wiki/Commonwealth_of_Nations) disability sport events. Singapore entered a team in [Paralympic Games](/wiki/Paralympic_Games) for the first time at the [1988 Summer Paralympics](/wiki/1988_Summer_Paralympics), and have participated in every [Summer Games](/wiki/Summer_Paralympic_Games) since. ## Policy Singapore, in comparison to other similar countries, does not spend a lot of money on social welfare services. The government emphasizes the ideas of self-reliance with the family being the first line of a person's support and volunteer and grassroots organizations helping next. Because family is the \"first line of support,\" people with disabilities who rely on caregivers are \"often at the mercy of the vagaries of family relationships.\" Modern views on working with people who have disabilities in Singapore have evolved over time. Nevertheless, the government does not have a \"clear definition of disability and persons with disability.\" The Enabling Masterplan 2012-2016 recommended promoting inclusiveness for people with disabilities through educational campaigns. Several campaigns took place in 2013, some promoted by the government and others by NGOs. In 2016, a campaign to raise Singaporean's awareness of people with disabilities was unveiled. The five-year campaign was created by NCSS and is called \"See the True Me.\" In 2017, the government of Singapore allocated $400 million on people with disabilities. A school-to-work transition program for students who have developmental and intellectual disabilities was created in 2017. Individuals with a developmental disability are able to use a Developmental Disability Registry Identity Card (DDR ID Card) which provides discounts and access to participating facilities. In addition, people with developmental disabilities are aided in police investigations by the Appropriate Adult Scheme (AAS) of 2015. ### Infrastructure All [train stations](/wiki/Train_station) in Singapore are equipped with accessible entrances and [elevators](/wiki/Elevator). Stations also have [braille](/wiki/Braille) information and tactile surface indicators. Train station names are announced for the visually impaired and red lights flash to warn of door closings for the deaf. The Enabling Masterplan 2012-2016 also provided Singapore with accessible signage for public transportation and in public areas and buildings. Accessible parking is available for individuals with physical disabilities. Housing structures provided by the [Housing Development Board](/wiki/Housing_and_Development_Board) (HDB) are free of barriers and since 2006, older housing estates have been upgraded with ramps, handrails and provide other types of assistance to people with disabilities. The public environment since has been improved through the Code on Accessibility in the Built Environment 2013, which provides greater accessibility in buildings and infrastructure constructed after 2013. Companies are provided support through the government to upgrade existing facilities in order to provide \"basic accessibility features.\" ### Education *Chin Pu* (or \"Progress\") centers were set up by the Singapore Association for Retarded Children (SARC), which is now known as the [Movement for the Intellectually Disabled of Singapore](/wiki/Movement_for_the_Intellectually_Disabled_of_Singapore) (MINDS). These centers or schools were first sponsored by the [Rotary Club](/wiki/Rotary_International) of Singapore in 1961. However, children with multiple disabilities and who had disabilities other than intellectual disabilities did not qualify for the *Chin Pu* centers. For many years, children with various disabilities were not accepted by schools in Singapore. One of the first schools for children with disabilities was opened on March 12, 1979, by [Leaena Tambyah](/wiki/Leaena_Tambyah). The school was called AWWA's Handicapped Children's Playgroup and operated out of St Ignatius Church. Since around 2011, the government of Singapore has created [early childhood intervention](/wiki/Early_childhood_intervention) services which include therapy and educational support. The Ministry of Education (MOE) created the Special Education Needs Fund in 2014 to help students with disabilities buy assistive technology devices for school. In 2017, the government called for further integration of disabled children into schools. Projects such as Children in Action and Buddy'IN allowed children from both with and without special needs to interact in meaningful ways for both groups. New recommendations for special education also include placing a greater emphasis on [life skills](/wiki/Life_skills) necessary for employment and living independently. The first inclusive [preschool](/wiki/Preschool), Kindle Garden, was started in 2016 by the Asian Women's Welfare Association (AWWA). Higher education institutions, such as [Singapore Management University](/wiki/Singapore_Management_University) (SMU), don't always provide accommodations for students with disabilities on hand. In the case of SMU, when students were seen needing accommodations, the university created a committee with Jack Yong Ho as the head to procure items for inclusion. ### Non Governmental Organisations Activist, Ron Chandran-Dudley, who was also [visually impaired](/wiki/Visual_impairment), played an important part in the 1980s by representing Singapore at the first [Disabled People's International](/wiki/Disabled_Peoples%27_International) (DPI) World Congress. Chandran-Dudley pointed out that many people who are disabled in Singapore were not in leadership positions in the organizations developed for them. He also advocated that it was important to focus on what disabled people could do, not what they couldn't do. In April 1986, the Singapore chapter of DPI, called the Disabled People's Association (DPA), was registered, becoming the first advocacy group for the rights of people with disabilities to be officially recognized. DPA continues to advocate for the rights of people with disabilities. DPA promotes cultural understanding for people with disabilities by visiting places such as schools and offices. An organization for children with intellectual disabilities, [Singapore Association for Retarded Children](/wiki/Movement_for_the_Intellectually_Disabled_of_Singapore) (SARC), which later changed its name to Movement for the Intellectually Disabled of Singapore, (MINDS) was started in 1962 by medical social worker, [Daisy Vaithilingam](/wiki/Daisy_Vaithilingam). ### Legislation Legislation that supported and protect the rights of people with disabilities in Singapore started in the 1980s. There is no law against denying service or access to people with disabilities in Singapore. The VSA, which allows individuals to be sterilized was amended in 2012 to give greater consent to people who may undergo the process. Singapore is a state party to the [United Nations](/wiki/United_Nations) [Convention on the Rights of Persons with Disabilities](/wiki/Convention_on_the_Rights_of_Persons_with_Disabilities), having signed on 30 November 2012 and ratified on 18 July 2013. - [List of disability organisations in Singapore](/wiki/List_of_disability_organisations_in_Singapore) - Category:Singaporean people with disabilities ### Citations ### Sources - DPA (2015). *Singapore and the UN CRPD* (PDF). Singapore: Disabled People's Association, Singapore. - Fam, Anita (2016). *3rd Enabling Masterplan 2017-2021: Caring Nation, Inclusive Society* (PDF). [ISBN](/wiki/ISBN_(identifier)) 9789811119606. Archived from the original (PDF) on 2021-04-20. Retrieved 2017-09-28. - Luk, Sabrina (2014). *Health Insurance Reforms in Asia*. New York: Routledge. [ISBN](/wiki/ISBN_(identifier)) 9781317748649. - Raghunathan, Ranjana; Balakrishnan, Balambigai; Smith, Catherine J.; Kadir, Mumtaz MD. (2015). *People With Physical Disabilities in Singapore: Understanding Disabling Factors in Caregiving, Education, Employment and Finances*. Singapore: Lien Centre for Social Innovation. [ISBN](/wiki/ISBN_(identifier)) 9789810959364. - Wong, Meng Ee; Ng, Ian; Lor, Jean; Wong, Reuben (2017). \"Navigating Through the 'Rules' of Civil Society: In Search of Disability Rights in Singapore\". In Song, Jiyoung (ed.). *A History of Human Rights Society in Singapore: 1965-2015*. New York: Routledge. [ISBN](/wiki/ISBN_(identifier)) 9781315527406. - Kuansong, Zhuang. \"Enabling the Singapore Story: Writing a History of Disability\", in *Monograph 42: Studies in Malaysian & Singapore History: Mubin Sheppard Memorial Essays,* pp. 47–81. Edited by Bruce Lockhart and Lim Tse Siang. KL: MBRAS, 2010. - 3rd Enabling Masterplan Archived 2021-04-20 at the [Wayback Machine](/wiki/Wayback_Machine)\n",
  "language": "en",
  "processed_at": "2026-01-12T10:08:17.580460",
  "title": "Disability in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Disability_in_Singapore"
}