{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:08:20.093275"
  },
  "content": "Defunct Hong Kong-based commercial broadcasting company (1990-2023) **Disney Networks Group Asia Pacific** was a [Hong Kong](/wiki/Hong_Kong)–based [commercial broadcasting](/wiki/Commercial_broadcasting) company operating multiple [specialty television channels](/wiki/Specialty_channel). The company was founded in 1991 by Hong Kong - Canadian businessman [Richard Li](/wiki/Richard_Li). Originally established by [Hutchison Whampoa](/wiki/Hutchison_Whampoa) and later acquired by the original [News Corporation](/wiki/News_Corporation), Star TV was once the most prominent satellite television broadcaster in Asia. On 20 March 2019, following Disney's [acquisition of 21st Century Fox](/wiki/Acquisition_of_21st_Century_Fox_by_Disney), Fox Networks Group Asia and Star India became a part of Disney, and Fox Networks Group Asia Pacific merged with the [Disney Branded Television](/wiki/Disney_Branded_Television) unit. DNG Asia Pacific's channels were available in [Southeast Asia](/wiki/Southeast_Asia), [East Asia](/wiki/East_Asia), [South Asia](/wiki/South_Asia), and the [Middle East](/wiki/Middle_East). ## History ### Launch The company was originally registered to the Companies Registry of Hong Kong as **Quford Limited** on 31 August 1990. The company was renamed **Hutchvision Channel Services Limited** on 31 January 1991 before becoming **Satellite Television Asian Region Limited** ([Chinese](/wiki/Traditional_Chinese_characters): 衛星電視有限公司; lit. 'Satellite Television Limited') on 4 July 1991, or **STAR**. It was established by Hutchison Whampoa and was headed by [Richard Li](/wiki/Richard_Li). Li is the son of [Li Ka-Shing](/wiki/Li_Ka-Shing) (founder of [Cheung Kong](/wiki/Cheung_Kong), a subsidiary of which is Hutchison Whampoa). Hutchvision's plan interfered in the development of Hong Kong's cable network, facing concerns that it would cause competition for both viewers and advertisers from other satellite and terrestrial networks. At the time, Wharf Holdings had a 28% stake, followed by Sun Hung Kai at 27%, [Run Run Shaw](/wiki/Run_Run_Shaw)'s Shaw Brothers at 10% and US West and Belgium's Coditel at 25% each.[*citation needed*] As of September 1990, it had twelve transponders available on AsiaSat 1, but ending the lease before 31 December was a possibility. In December 1990, it had set a new deadline to start its services -7 the end of 1991. The initial plan outlined two to three channels in its initial phase, catering mainly to Hong Kong, Taiwan and Thailand, and carrying music and sports. The Asiasat-1 beam enabled the channels to be picked up by a potential audience of 2.3 billion viewers. There were talks of the [Singapore Broadcasting Corporation](/wiki/Mediacorp) holding shares in the company, with its main goal being delivering its programming abroad. The company operated its television channels under a unified brand, **Star TV** ([Chinese](/wiki/Traditional_Chinese_characters): 衛星電視; [pinyin](/wiki/Pinyin): *Wèixīng Diànshì*; [Jyutping](/wiki/Jyutping): *wai6 sing1 din6 si6*; lit. 'Satellite Television'). The company's strategy was to target the top 5 percent of Asian elites who spoke English and had bought power to offer pan-Asian English programming. In its initial years, the channels were broadcast over AsiaSat 1, a communication satellite operated by [Asia Satellite Telecommunications](/wiki/AsiaSat) (a consortium of Hutchison Whampoa, [China International Trust and Investment Corporation](/wiki/CITIC_Group) and [Cable & Wireless Worldwide](/wiki/Cable_%26_Wireless_Worldwide)). Its digital electronic services were funded by [Sony](/wiki/Sony).[*citation needed*] Hutchvision itself owned one third of AsiaSat and Star TV used ten out of the twenty-four transponders in the AsiaSat 1 satellite. The channels were able to reach from the Far East to the Middle East, broadcasting across 38 countries around the region. Star TV's had five channels on their initial line-up: Star Sports, Star Music, Star News, Star Chinese and Star Entertainment; Star Entertainment was only available with a paid subscription. On 1 October 1992, Star TV added [Zee TV](/wiki/Zee_TV) (which targeted [Hindi](/wiki/Hindi)-speaking audiences) from [Zee Telefilms](/wiki/Zee_Entertainment_Enterprises) in India to its line-up. In 1993, [Goldman Sachs](/wiki/Goldman_Sachs) became the exclusive advisor to Hutchison Whampoa Limited and the Li family in their largest Asian media merger to date. In February 1993, Julian Mounter, former director-general of [Television New Zealand](/wiki/Television_New_Zealand), was appointed as president and Chief Executive of the company. In March 1993, Star TV was partnered with [Asia Business News](/wiki/Asia_Business_News). By that year, the service's advertisement bookings were extensive. While starting their pay-TV services, Julian Mounter — the chief executive and the president of HutchVision — stated that the company planned to launch the AsiaSat 2 satellite sometime in the subsequent two years. Mounter also signed agreements with four companies, mostly programme suppliers, stating that the company would have as many as six channels operating by April 1994. He also said that the programmes would include more [English](/wiki/English_language) and [Chinese](/wiki/Chinese_language) movie channels, a business channel, a children's channel, a documentary channel, and another entertainment channel. With the launch of the new AsiaSat satellite, Star TV would have the capability to broadcast as many as one-hundred channels. In June 1993, Star TV and [Wharf Cable](/wiki/Hong_Kong_Cable_Television) signed a deal in which Hong Kong's new cable television provider would carry Star TV's channels. However, the deal was terminated in February 1994 in a dispute between the two parties. ### Sale to News Corporation > \"Advances in technology and telecommunications have proved an unambiguous threat to totalitarian regimes everywhere. Fax machines enable dissidents to bypass state-controlled print media, direct dial telephony makes it difficult for state-controlled personal conversations and satellite broadcasting makes it possible for information-hungry residents of many closed societies to bypass state-controlled television channels.\" [Rupert Murdoch](/wiki/Rupert_Murdoch), delivering his speech at the start of Star TV's broadcasts in China in September 1993 Star TV's viewership across Asia increased over the years and it attracted advertisers, but the business was not turning a profit. The company was looking for an [Anglophone](/wiki/Anglophone) partner for financial investments, along with additional English language programming and technical assistance. They were hoping to launch a pay-television system that would carry encrypted channels. On 1 May 1993, [Pearson](/wiki/Pearson_plc) approached Star TV's owners, seeking a partnership, and was expected to invest up to GBP 100 million. Pearson (which owned minor stake in British broadcasters [BSkyB](/wiki/Sky_Group) and [Yorkshire-Tyne Tees Television](/wiki/Yorkshire-Tyne_Tees_Television) at the time, and had just acquired [Thames Television](/wiki/Thames_Television)) was looking to expand its media business outside the UK, especially because the British laws at the time did not allow Pearson to expand more on UK television business. Pearson was looking for 66% of the company, but the deal was reported to have required the Hong Kong side to remain active shareholders, causing the deal to fall through. The initial negotiations with [Rupert Murdoch](/wiki/Rupert_Murdoch) were reported to have floundered after the Australian businessman demanded a controlling stake in the Hong Kong company. On the same day, Murdoch's [News Corporation](/wiki/News_Corporation) purchased 63.6% of Star TV for $525 million US dollars, half in cash, half in News Corporation's ordinary shares, blocking offers from Pearson. The deal came after News Corporation failed to acquire 22% of [TVB](/wiki/TVB) because of regulatory issues. News Corporation acquired the remaining 36.4% for US$299 million in July 1995. The Li family and Hutchison Whampoa would retain its shares in Hutchvision Hong Kong Limited, which uplinked Star TV's channels. With the money he made from the 1993 sale, Richard Li went on to establish [Pacific Century Group](/wiki/Pacific_Century_Group). It was later theorized by author Shiau Hong-chi that Murdoch's purchase of Star TV was based on a theory of media globalization, assuming that people across every nation and language would watch the same TV programmes, with the original plan for Star TV being to broadcast popular American shows to Asian audiences. However, the plan was unsuccessful, with Star TV being forced to invest heavily into producing local shows for their Asian audience. On 1 August 1993, following News Corporation's takeover, Julian Mounter resigned as Chief Executive of the company. [Sam Chisholm](/wiki/Sam_Chisholm) (head of BSkyB at the time) became acting Chief Executive of News Corporation before he was formally appointed. On 26 July 1993, Star TV was purchased by [Rupert Murdoch](/wiki/Rupert_Murdoch) for US$525 million. This was Murdoch's most important acquisition since the debt-restructuring crisis in 1990. He also bought Hutchvision, Star TV's parent company. As of 1993, Star TV's channel line-up consisted of MTV Asia, [BBC World Service Television](/wiki/BBC_World_Service_Television), a sports channel, an English-language entertainment channel, and a Chinese-language entertainment channel. It also planned to launch a movie channel in Chinese and Hindi later the same year. The Star TV network reached an estimate of 45 million viewers and was the only large satellite network to reach all of Asia. On 1 September 1993, in a speech Murdoch made in London coinciding with the start of [Sky Multichannels](/wiki/Sky_Multichannels) and relayed to associates in Los Angeles, New York, Hong Kong and Sydney, Murdoch announced a plan to combine his synergies around the world to create a global network of television channels, as well as a potential partnership with [TVB](/wiki/TVB), who at the time had the largest Mandarin-language television library in the world. In January 1994, James Griffiths resigned as a managing director, with Gary Davey becoming his successor. With the controversial removal of [BBC World Service Television](/wiki/BBC_World_Service_Television) from the company's satellite television offerings for [Northeast Asia](/wiki/Northeast_Asia) in mid-April 1994 (see below), Star TV replaced the BBC channel with two channels; English-language film channel [Star Movies](/wiki/Fox_Movies_(Asia)) and Chinese-language film channel [Star Chinese Movies](/wiki/Star_Chinese_Movies). The decision was made while Star TV was considering the launch of a documentary and educational channel that two companies had a joint-venture in. In April 1994, Star TV formed a three-year partnership with [Asia Television](/wiki/Asia_Television), made as Star TV struggled to be part of the Chinese-language programme battle with [TVB](/wiki/TVB). The joint-venture marked the beginning of their long-term cooperation. This agreement superseded the previous programme supply deal made in 1991. As part of the deal, Star TV acquired one-thousand hours annually of prime-time dramas and special programming dubbed in [Mandarin Chinese](/wiki/Mandarin_Chinese). ATV would also provided dubbing and other facilities for the Star TV Network. The joint-venture co-produced fewer than 40 hours of quality dramas per year, broadcast simultaneously, with ATV showing the original programming in [Cantonese](/wiki/Cantonese) in the [British Hong Kong](/wiki/British_Hong_Kong) territory, and Star TV showing them in [Mandarin Chinese](/wiki/Mandarin_Chinese). In addition, Star TV operated the Chinese Channel in competition to TVB. Star TV would go on to purchase a library of more than 570 Chinese films from the [Golden Harvest Group](/wiki/Orange_Sky_Golden_Harvest) and announced a deal for the production of more than 50 films in the next three years by [Media Asia Film](/wiki/Media_Asia_Entertainment_Group). Star TV and [Viacom](/wiki/Viacom_(1952%E2%80%932006)) ([MTV](/wiki/MTV)) ended a partnership that supplied [music television](/wiki/Music_television) programming, so Star TV launched [Channel V](/wiki/Channel_V) to replace the American brand. The [Indian version](/wiki/Channel_V_India) launched on 23 May 1994, followed by 4 additional versions: Channel V International, [Channel V Thailand](/wiki/Channel_V_Thailand), Channel V Korea, Channel V Japan. Versions in [Mandarin Chinese](/wiki/Mandarin_Chinese), [Vietnamese](/wiki/Vietnamese_language) and [Cantonese](/wiki/Cantonese) would later be added. Star TV split its satellite signal to both northern and southern beams, resulting in a change for both operations. The northern beam included [Prime Sports](/wiki/Fox_Sports_(Asian_TV_network)), [Channel V](/wiki/Channel_V), [Star Plus](/wiki/StarPlus), [Star Movies](/wiki/Star_Movies) and [Star Chinese Channel](/wiki/Star_Chinese_Channel), while the southern beam had Prime Sports, Channel V, Star Plus, [BBC WSTV](/wiki/BBC_World_Service_Television), [Zee TV](/wiki/Zee_TV) and Zee Cinema. However, Star Sports' northern beam featured soccer and gymnastics, while the southern beam included cricket for Indian viewers. After the purchase of a 49.9% stake in Zee TV in early 1994, the northern beam launched [Zee News](/wiki/Zee_News) and Zee Cinema. Star TV channels were rebroadcast terrestrially in Brunei as of late 1994. The network proposed an expansion to Malaysia in late 1994, with a spokesman stating it would be \"a place to do business.\" This would mark the end of a feud between Malaysian and British media. The network reached Indonesia in 1995 through an agreement with satellite provider [Indovision](/wiki/Indovision). 15 channels were planned to launch in the second half of the year. The viewership share of Star TV in Taiwan in 1995 was at 42%, attributed to the launch of Star Movies, which had many viewers in the country. Plans to launch the channel were unveiled on December 7, 1994, with the launch date set to somewhere between June and August 1995. It would be broadcast using the then-new [AsiaSat 2](/wiki/AsiaSat_2) satellite. STAR and Viva would co-produce 130 new titles a year. The channel was originally launched as **Viva Cinema** on May 6, 1996, in partnership between [Viva Entertainment](/wiki/Viva_Communications) in the Philippines and Star TV (later simply rebranded as STAR in 2001) in [Hong Kong](/wiki/Hong_Kong). On July 10, 2003, STAR announced that the joint venture with Viva Entertainment would not be renewed after Viva Entertainment acquired the remaining stake of the channel from STAR Group Limited, meaning Viva Cinema would be closed down on July 31, 2003. On August 1, 2003, Viva Cinema was rebranded as **[Pinoy Box Office](/wiki/Pinoy_Box_Office)**. On 30 March 1995, the satellite radio station Star Radio launched in Cantonese and Mandarin for North Asia, with additional English service for South Asia and the Middle East. In the summer of 1995, Star TV considered launching least thirty channels on the service when AsiaSat 2 was launched. The new channels let the Star TV Network further customize its services for other regions and cultures. In January 1996, Star TV formed a third-party joint-venture, [Phoenix Satellite Television Corporation](/wiki/Phoenix_Television), offering three channels targeting Chinese viewers, [Phoenix Chinese Channel](/wiki/Phoenix_Television), [Star Sports](/wiki/Star_Sports_(East_Asian_TV_channel)), and Star Chinese Movies. On 30 March 1996, at 7 pm [Hong Kong Time](/wiki/Hong_Kong_Time), Star TV separated into Star Plus and Star Chinese Channel in certain areas. In 1997, Star TV launched the Star Select package of television channels aimed at viewers in the [Middle East](/wiki/Middle_East) via Orbit (now [OSN](/wiki/OSN).) In 1998, Star TV and [Metro-Goldwyn-Mayer](/wiki/Metro-Goldwyn-Mayer) were in discussion to launch a new MGM movie channel in India. Rathikant Basu also stated that the company was considering to launch four new regional channels spanning 4 languages:[Bengali](/wiki/Bengali_language), [Marathi](/wiki/Marathi_language), [Gujarati](/wiki/Gujarati_language) and [Punjabi](/wiki/Punjabi_language). In December 1998, Star TV Network's channels were supposed to be removed on [Indovision](/wiki/MNC_Vision) due to a disagreement between the company and Indovision, however, a court later upheld Star TV's decision to not broadcast its channels across Indonesia. During the same month, Star TV announced its partnership with [Phoenix Satellite TV](/wiki/Phoenix_Television), and in cooperation with the European-based [Chinese News and Entertainment](/wiki/Phoenix_Chinese_News_and_Entertainment_Channel), launched Phoenix Europe, a Mandarin-language channel that broadcast entertainment and news from Phoenix Television's libraries to European audiences in August of the same year. In May 1999, Star TV migrated its channels from AsiaSat 1 and 2 to AsiaSat 3S. By late-1999 to the early-2000s, Star TV used AsiaSat 3S and Palapa C2 to broadcast across Asia and the Middle East in 53 countries, with an audience of up to 300 million viewers. At the time, programming consisted of [Star Chinese Channel](/wiki/Star_Chinese_Channel), [Phoenix Chinese Channel](/wiki/Phoenix_Television), [Star Plus](/wiki/StarPlus), [Star World](/wiki/Star_World), [Channel V](/wiki/Channel_V), [ESPN](/wiki/Fox_Sports_(Asian_TV_network)), Star Sports, [Star Movies](/wiki/Star_Movies), [Star Chinese Movies](/wiki/Star_Chinese_Movies), [Phoenix Movies](/wiki/Phoenix_Movies_Channel), [Viva Cinema](/wiki/Pinoy_Box_Office), [Star News](/wiki/ABP_News), [Zee News](/wiki/Zee_News), Zee Cinema, [Zee TV](/wiki/Zee_TV), [Fox News](/wiki/Fox_News), [Sky News](/wiki/Sky_News) and the [National Geographic Channel](/wiki/National_Geographic_(Asian_TV_channel)). Indian operations alone were estimated to account for 55% of Star TV's revenues in Asia at the time. On 15 January 2000, Star TV added [Disney Channel](/wiki/Disney_Channel_(Southeast_Asia)) to its line-up, who handled distribution and ad sales for the channel. This marked their second partnership with [The Walt Disney Company](/wiki/The_Walt_Disney_Company), who also owned ESPN. On 1 July 2000, Zee TV ended partnership with Star TV. The Hong Kong-based company converted Star Plus to a Hindi entertainment channel, and introduced Star World as an English entertainment replacement for the region. In 2000, Star TV would heavily focus on their Chinese and Indian markets. In India, the conversion of Star Plus into a Hindi general entertainment channel was received well. The Indian version of Who Wants to be a Millionaire, [Kaun Banega Crorepati](/wiki/Kaun_Banega_Crorepati), and the Hindi Soap Opera [Kyunki Saas Bhi Kabhi Bahu Thi](/wiki/Kyunki_Saas_Bhi_Kabhi_Bahu_Thi), surpassed their rivals — [Zee TV](/wiki/Zee_TV) and [Sony Entertainment Television](/wiki/Sony_Entertainment_Television) — in ratings to become the most watched channel in Asia. On New Year's Day 2001, at midnight, the company was rebranded from Star TV to **Star**, reflecting the company's evolution from a television brand to a multi-service, multi-platform brand. In Chinese, the company referred itself as *Xīngkōng Chuánméi* ([Chinese](/wiki/Traditional_Chinese_characters): 星空傳媒; lit. 'Star Media') instead of *Wèixīng Diànshì.* It also introduced a new set of logos. As of 2024, the 2001 logos are phased out from use by any Star TV channels since 2008, excluding [Xing Kong](/wiki/Xing_Kong), [ANTV](/wiki/ANTV) and [tvOne](/wiki/TvOne_(Indonesian_TV_network))'s news programme *Kabar*. Static Design (a broadcasting design arm of Static 2358, now-defunct) designed the company and the seven channels' identities. Star TV aired the high-definition programme *Angel* in 2006 in cooperation with Singaporean [Mediacorp Studios](/wiki/Mediacorp_Studios). The show was scheduled to shoot 40 episodes, and was filmed in [Taiwan](/wiki/Taiwan). The show was aired on [Star Chinese Channel](/wiki/Star_Chinese_Channel) in Taiwan and on [Mediacorp](/wiki/Mediacorp) in Singapore, with Star TV handling distribution and sales in other countries. In addition, [Star Chinese Movies](/wiki/Star_Chinese_Movies) was announced to have invested in three high-definition films, to be produced by [Derek Yee Tung-sing](/wiki/Derek_Yee). Additionally, the [National Geographic Channel](/wiki/National_Geographic_(Asian_TV_channel)) produced around one thousand hours of high-definition programming commissioned for the Asian market (excluding Japan). ### 2009 restructure, refocus on East and Southeast Asia On 19 August 2009, News Corporation announced a restructure of Star. Star India and Star Greater China would be separated from Star's headquarters in Hong Kong, and the heads of the former two companies would report directly to [James Murdoch](/wiki/James_Murdoch), News Corporation's then-chairman and CEO for Europe and Asia. - [Star India](/wiki/Star_India) took over all of Star's operations in India, as well as sales and distribution of Fox-branded channels in the region. It also took over Star's distribution offices in the Middle East, the United Kingdom and the United States. - Star Greater China would oversee [Star Chinese Channel](/wiki/Star_Chinese_Channel), [Star Chinese Movies](/wiki/Star_Chinese_Movies), Star Chinese Movies 2, [Xing Kong](/wiki/Xing_Kong) and [Channel V](/wiki/Channel_V) Mainland China, as well as the Fortune Star film library. - The original Star TV company became Fox International Channels Asia Pacific, and would focus on East and Southeast Asia. It also took over the representation of FIC channels from NGC Network Asia, LLC (channels already being distributed by Star). The company would continue to distribute its channels in the Middle East, and would take responsibility of the distribution of Star India and Star Greater China's channels in Asia outside their respective home markets. Despite the 2009 reorganisations, the company did not immediately change its legal name from Satellite Television Asian Region Limited, waiting until 2 September 2014 to change its legal name to **Fox International Channels Asia Pacific Limited** ([Chinese](/wiki/Traditional_Chinese_characters): 福斯國際電視網有限公司; lit. 'Fox International Television Network Limited.') In August 2010, it was announced that the News Corporation would sell a controlling stake in its assets held in mainland China to [China Media Capital](/wiki/China_Media_Capital) (CMC). Xing Kong (both domestic and international versions), Channel V Mainland China, and the Fortune Star film library were included in the sale, and a joint venture named [Star China Media](/wiki/Star_China_Media) was created in the process. CMC acquired the remaining stake in Star China Media in January 2014. In June 2012, it was announced that the News Corporation would buy [ESPN International](/wiki/ESPN_International)'s share in the joint venture ESPN Star Sports. The versions of ESPN broadcast in Hong Kong, Taiwan and Southeast Asia were rebranded as Fox Sports on 28 January 2013, and Star Sports became Fox Sports 2 on 15 August 2014. The Fox Sports rebrand did not affect India and East Asia: In India, Star India took over ESPN Star Sports' Indian subsidiary, and kept ESPN branding until 6 November 2013, when [all of Star India's sports channels were relaunched under the Star Sports brand](/wiki/Star_Sports_(Indian_TV_network)). A [version of Star Sports broadcast to mainland China and South Korea](/wiki/Star_Sports_(China)) kept the brand, however, mainland China's version was renamed Star Sports 2 on 1 January 2014. In the wake of the [2011 News Corporation scandals](/wiki/2011_News_Corporation_scandals), the original News Corporation was split into [21st Century Fox](/wiki/21st_Century_Fox) and the new [News Corp](/wiki/News_Corp) on 28 June 2013, with the television businesses (which FIC Asia was a part of) going to 21st Century Fox. In October 2013, 12.15% of shares in [Phoenix Television](/wiki/Phoenix_Television) held by 21st Century Fox (through Star) was sold to [TPG Capital](/wiki/TPG_Capital) for HK$1.66 billion (about US$213.73 million). This and 2014 sale of Star China Media marked 21st Century Fox's exit from the Mandarin entertainment television market in mainland China. By 2014, [Fox International Channels Middle East](/wiki/Fox_Networks_Group) took over the distribution of Star World, Star Movies, [National Geographic](/wiki/National_Geographic)-branded channels, Fox-branded channels, [Channel V](/wiki/Channel_V) International, [Baby TV](/wiki/Baby_TV) and Sky News in the [Middle East and North Africa](/wiki/Middle_East_and_North_Africa) from Star Select (now renamed Fox Networks Group Middle East, the Middle East business together with FNG Asia Pacific, still a part of the wider FNG Asia operations). In January 2016, the company's parent unit, Fox International Channels, was announced to be split into three divisions, which would see the heads of newly renamed Fox Networks Group Europe, Fox Networks Group Latin America and Fox Networks Group Asia all reporting to CEO [Peter Rice](/wiki/Peter_Rice_(executive)) and COO [Randy Freer](/wiki/Randy_Freer) at Fox Networks Group in the United States, thus abolishing Fox International Channels as a separate unit from 21st Century Fox's television business in the U.S. Accordingly, the company was officially launched new name and logo to becomes **Fox Networks Group Asia Pacific Limited** ([Chinese](/wiki/Traditional_Chinese_characters): 福斯傳媒有限公司; lit. 'Fox Media Limited') on 29 February 2016. On 5 December 2017, [Star India](/wiki/Star_India)'s Chairman and CEO [Uday Shankar](/wiki/Uday_Shankar_(businessman)) was appointed as 21st Century Fox's president for Asia, and the President of Fox Networks Group Asia would report directly to Shankar (instead of the equivalent at FNG U.S.). ### Disney ownership and channel operations closure With the [acquisition of 21st Century Fox's entertainment assets](/wiki/Acquisition_of_21st_Century_Fox_by_Disney) by [The Walt Disney Company](/wiki/The_Walt_Disney_Company), FNG Asia Pacific (including FNG Taiwan and FNG's remaining businesses in mainland China), as well as Star India, became a part of Disney. FNG Asia Pacific were integrated into [Walt Disney Direct-to-Consumer & International](/wiki/Walt_Disney_Direct-to-Consumer_%26_International) (now [Disney International Operations](/wiki/List_of_assets_owned_by_The_Walt_Disney_Company#Disney_International_Content_and_Operations).) Fox Networks Group Asia was split into three, as to plug into the Disney International structure with offices in Shanghai, Mumbai, and Singapore. The reconfiguration and layoff began on 29 June 2020, with layoffs focused on FNG Asia's Hung Hom headquarters, which date back to their 1993 acquisition by PCCW. The Walt Disney Company announced the official closure of 18 of their linear pay TV channels on 1 October 2021, as Disney prioritized the rollout of [Disney+](/wiki/Disney%2B) across Asian territories (or [Disney+ Hotstar](/wiki/Disney%2B_Hotstar) for Indonesia, Malaysia and Thailand). Those channels included [Fox Sports](/wiki/Fox_Sports_(Asian_TV_network)), which broadcast [Formula 1](/wiki/Formula_1) and [MotoGP](/wiki/MotoGP) along with all four major [Grand Slams](/wiki/Grand_Slam_(tennis)) and most [UFC](/wiki/Ultimate_Fighting_Championship) fights; and [Fox Movies](/wiki/Fox_Movies_(Southeast_Asian_TV_channel)), which also included [Fox Action Movies](/wiki/Fox_Action_Movies) and [Fox Family Movies](/wiki/Fox_Family_Movies). This meant that the latest [Walt Disney](/wiki/Walt_Disney_Studios_Motion_Pictures), [Marvel](/wiki/Marvel_Studios), and [20th Century](/wiki/20th_Century_Studios) films were not available for a period. Most of [Fox Sports Asia](/wiki/Fox_Sports_(Asian_TV_network)) programming headed elsewhere after the closure, such as on [SPOTV](/wiki/SPOTV), which replaced the main Fox Sports channel on launch while also airing the remainder of the [2021 MotoGP World Championship](/wiki/2021_MotoGP_World_Championship). After a while, the latest Walt Disney, Marvel and 20th Century films were released through Disney+ (or Disney+ Hotstar). General entertainment contents which aired on [Fox](/wiki/Fox_(Asian_TV_channel)) and [Fox Life](/wiki/Fox_Life) are either moved to Disney+ or, following the shutdown, through Fox's rival pay TV networks. Following the shutdown, some of their employees (including Singapore-based marketing leads Daniel Tan and Shoba Martin) left the company. The decision to close the channels has been criticized due to poor Internet connectivity in some areas and the lack of a plan to rollout Disney+ to smaller regions. In Taiwan, Disney Channel officially ceased broadcasting on New Year's Day 2022, with Disney programming being relocated to [Disney+](/wiki/Disney%2B) permanently. Both Fox Movies and Fox rebranded themselves as [Star Movies Gold](/wiki/Star_Movies) (which, unlike Star Movies HD, has different movie lineups and uses branding from the first iteration) and [Star World](/wiki/Star_World) respectively. This marked the only country with Disney channels operating under the Star brand alongside the existing [Star Chinese Movies](/wiki/Star_Chinese_Movies) and [Star Chinese Channel](/wiki/Star_Chinese_Channel). The remaining linear pay TV channels, including [National Geographic](/wiki/National_Geographic_(Asian_TV_channel)), ceased their transmission on 1 October 2023 in Southeast Asia, Hong Kong and (for [National Geographic](/wiki/National_Geographic_(South_Korean_TV_channel))) South Korea, with Taiwan following suit on 1 January 2024. ## Controversy The [BBC](/wiki/BBC) and Star TV originally signed a deal under which the Hong Kong operator would carry the BBC channel for 10 years. However, in March 1994, the BBC and Star TV reached a deal after an out-of-court settlement that would gradually drop [BBC World Service Television](/wiki/BBC_World_Service_Television) from the satellite broadcaster's offerings. BBC WSTV would be dropped from the channel line-up for Northeast Asia by mid-April that year, but would be available in the rest of Asia until 31 March 1996. The deal came after demands from the government of the [People's Republic of China](/wiki/People%27s_Republic_of_China). It was alleged that the PRC government was unhappy with BBC coverage of China and Murdoch's September 1993 speech, which declared that \"(telecommunications) have proved an unambiguous threat to totalitarian regimes everywhere... satellite broadcasting makes it possible for information-hungry residents of many closed societies to bypass state-controlled television channels.\" The Beijing government threatened to block Star TV in the huge [mainland Chinese](/wiki/Mainland_China) market if the BBC was not withdrawn. The former prime minister, [Li Peng](/wiki/Li_Peng), requested and obtained the ban of satellite dishes throughout the country. There were also reported concerns surrounding editorial control of BBC WSTV after News Corporation's acquisition of Star TV. The subsequent removal of the BBC channel and many ensuing declarations from Murdoch led critics to believe the businessman was striving to appease the Chinese government in order to have the ban lifted. [Fairness and Accuracy in Reporting](/wiki/Fairness_and_Accuracy_in_Reporting) (FAIR) gave Rupert Murdoch a [mock award](/wiki/Booby_prize) titled the \"P.U.-Litzer Prize\" for \"Media Hypocrite of the Year\" in 1994. In 2001, the BBC and CITVC signed a deal that would make [BBC World](/wiki/BBC_World_News) available to \"upmarket hotels, as well as guest houses and foreign apartments\" in mainland China. - [Fox Networks Group](/wiki/Fox_Networks_Group) - [Star China Media](/wiki/Star_China_Media) - [Disney Star](/wiki/Disney_Star) - [Star (Disney+)](/wiki/Star_(Disney%2B)) - [Star+](/wiki/Star%2B) - [Fox Networks Group Middle East](/wiki/Fox_Networks_Group_Middle_East) - [PCCW](/wiki/PCCW) – part of [Richard Li](/wiki/Richard_Li)'s [Pacific Century Group](/wiki/Pacific_Century_Group); it operates [Now TV](/wiki/Now_TV_(Hong_Kong)), [Viu](/wiki/Viu_(streaming_media)), and [HK Television Entertainment](/wiki/HK_Television_Entertainment) - Disney Networks Group in Taiwan - Former official website of Star at the [Wayback Machine](/wiki/Wayback_Machine) (archive index): The startv.com domain is now owned by [Star India](/wiki/Star_India). - Fox Networks Group in Mainland China at the [Wayback Machine](/wiki/Wayback_Machine) (archive index) - Star TV Archived 19 June 2017 at the [Wayback Machine](/wiki/Wayback_Machine) at the [Museum of Broadcast Communications](/wiki/Museum_of_Broadcast_Communications)'s Encyclopedia of Television\n",
  "language": "en",
  "processed_at": "2026-01-12T10:08:20.092795",
  "title": "Disney Networks Group Asia Pacific",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Disney_Networks_Group_Asia_Pacific"
}