{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:08:24.271383"
  },
  "content": "2015 Chinese film ***Distance*** ([Chinese](/wiki/Chinese_language): 再见，在也不见) is a 2015 [anthology](/wiki/Anthology_film) [drama film](/wiki/Drama_film) directed by Xin Yukun, Tan Shijie, and Sivaroj Kongsakul and starring [Chen Bolin](/wiki/Chen_Bolin), [Jiang Wenli](/wiki/Jiang_Wenli), [Tony Yang](/wiki/Tony_Yang), [Paul Chun](/wiki/Paul_Chun) and Chayanit Chansangavej. A Chinese-Thai-Singaporean-Taiwanese [co-production](/wiki/International_co-production), the film was shown at the 52nd [Golden Horse Film Festival and Awards](/wiki/Golden_Horse_Film_Festival_and_Awards) on 5 November 2015 and was released in China by Beijing Juhe Yinglian Media on 13 May 2016 and in Taiwan on 20 May 2016. The film consists of three short segments, each of which was intended by executive producer [Anthony Chen](/wiki/Anthony_Chen) to focus on one of three types of relationship: family, friendship and love. ## Plot A conflicted manager on a business trip is intrigued by an elderly worker and investigates his life. A young father receives a letter that brings him to a foreign land, where old emotions come unburied. A visiting professor from overseas sets a student's heart fluttering, while having to deal with his own. Different characters, different relationships, the same humanity; stories about the distances between us and how we live with them. ## Cast - [Chen Bolin](/wiki/Chen_Bolin) - [Jiang Wenli](/wiki/Jiang_Wenli) - [Tony Yang](/wiki/Tony_Yang) - [Paul Chun](/wiki/Paul_Chun) - Chayanit Chansangavej - Feng Li - [Yeo Yann Yann](/wiki/Yeo_Yann_Yann) ## Reception The film has grossed CN¥11.6 million at the Chinese box office. - *Distance* at [IMDb](/wiki/IMDb_(identifier)) This article related to a Thai film is a stub. You can help Wikipedia by expanding it. - v - t - e This article related to a Singaporean film is a stub. You can help Wikipedia by expanding it. - v - t - e This article about a Taiwanese film is a stub. You can help Wikipedia by expanding it.\n",
  "language": "en",
  "processed_at": "2026-01-12T10:08:24.270900",
  "title": "Distance (2015 film)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Distance_(2015_film)"
}