{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:08:34.856154"
  },
  "content": "Malaysian businessman **Tan Sri Dol Ramli** (1922 - 2011, 88 years old) was a [Malaysian](/wiki/Malaysian_people) who is a former Director General of Broadcasting at [Radio Malaya](/wiki/Radio_in_Malaysia) and also the founder of [Radio Televisyen Malaysia](/wiki/Radio_Televisyen_Malaysia) (RTM). ## Background Dol Ramli was born on October 3, 1922, on Dunlop Street, Singapore. He married Che Kamila Marzuki and had five sons. He attended the [University of Malaya](/wiki/University_of_Malaya), where he studied history. At the end of his life in 2011 he had 11 grandchildren and two great -grandchildren. ## Career [Tan Sri](/wiki/Tan_Sri) Dol began his career as a newspaper journalist in [Malaysia](/wiki/Malaysia) at Radio Malaya 1948–1954, becoming Director in 1955 and serving in the position until 1975. He was the General Manager of the state-run [Bernama](/wiki/Bernama) news agency from 1975 to 1980. From there he became Director-General of Radio Malaya. Dol Ramli was the lyricist of the song Bahasa Jiwa Bangsa. ## Books This article **lacks [ISBNs](/wiki/ISBN) for books it lists**. Please help add this information or run the citation bot. *(June 2025)* - *The Uses of Mass Communication Media for Promoting Economic and Political Development* (1967) - *Peranan sebaran 'am dalam usaha mengujudkan dan memupuk keperibadian kebangsaan Malaysia tumpuan* (1971) - *Masaalah implementasi rumusan kongres kebudayaan mengenai muzik* (1974) - *Penggunaan Tradisi Lisan Khasnya Yang Bermusik Untuk TV Dan Radio Dalam Konteks Pembangunan Negara* (1975) - *Country Report on Malaysia* (1978) - *History of the Malay Regiment, 1933-1942* (1978) - *Regional Cooperation* (1979) - *Pengalaman dan peranan penyiaran dalam mengisi dan menghayati kemerdekaan Malaysia* (2000)\n",
  "language": "en",
  "processed_at": "2026-01-12T10:08:34.855661",
  "title": "Dol Ramli",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Dol_Ramli"
}