{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:08:42.615598"
  },
  "content": "Currently inactive companyThe examples and perspective in this article **may not represent a worldwide view of the subject**. You may improve this article, discuss the issue on the talk page, or create a new article, as appropriate. *(August 2009)* *(Learn how and when to remove this message)*You can help **expand this article with text translated from the corresponding article in Japanese**. *(October 2020)* Click [show] for important translation instructions. - Machine translation, like DeepL or Google Translate, is a useful starting point for translations, but translators must revise errors as necessary and confirm that the translation is accurate, rather than simply copy-pasting machine-translated text into the English Wikipedia. - Consider **adding a topic** to this template: there are already 1,467 articles in the main category, and specifying`|topic=` will aid in categorization. - Do not translate text that appears unreliable or low-quality. If possible, verify the text with references provided in the foreign-language article. - You **must** provide copyright attribution in the edit summary accompanying your translation by providing an interlanguage link to the source of your translation. A model attribution edit summary is `Content in this edit is translated from the existing Japanese Wikipedia article at [[:ja:休眠会社]]; see its history for attribution.` - You may also add the template `{{Translated|ja|休眠会社}}` to the talk page. - For more guidance, see Wikipedia:Translation. A **dormant company** is a [company](/wiki/Company) that carries out no [business](/wiki/Business) activities in the given period of time. ## United Kingdom In the United Kingdom, a dormant company is a company whose transactions have been limited to payment for shares taken by subscribers to the [memorandum of association](/wiki/Memorandum_of_association), fees paid to the Registrar of Companies for a change of company name, the re-registration of a company, filing a confirmation statement and payment made in respect of [civil penalties](/wiki/Civil_penalty) imposed by the [Registrar of Companies](/wiki/Registrar_of_Companies) for delivering accounts to the Registrar after the statutory time allowed for filing. Whilst filing annual accounts is still a requirement for dormant companies, instead of filing a full set of annual accounts, dormant companies can file a basic set of accounts known as a dormant company accounts (DCA). Dormant company accounts do not need to be [audited](/wiki/Audit), except for the year during which the company becomes dormant. Under the [Companies Act 2006](/wiki/Companies_Act_2006) there are exceptions for certain companies. For example, some financial and [insurance companies](/wiki/Insurance) are under obligation to file their full accounts, regardless of their status. ## Singapore In Singapore, a dormant company is defined by two authorities: [Accounting and Corporate Regulatory Authority](/wiki/Accounting_and_Corporate_Regulatory_Authority) (ACRA) and [Inland Revenue Authority of Singapore](/wiki/Inland_Revenue_Authority_of_Singapore) (IRAS). For ACRA the determining factor for dormancy is the lack of transactions. For IRAS, a company that does not generate income is considered dormant. The companies deemed dormant by the authorities can be exempted from filing annual financials and submitting tax return. For the latter, a waiver has to be issued by IRAS.\n",
  "language": "en",
  "processed_at": "2026-01-12T10:08:42.615077",
  "title": "Dormant company",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Dormant_company"
}