{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:08:44.275517"
  },
  "content": "Thin crepe originating from South India A **dosa** (in [Indian English](/wiki/Indian_English)) or **thosai** (in [Malaysian English](/wiki/Malaysian_English) and [Singapore English](/wiki/Singapore_English)) is a thin, savoury [crepe](/wiki/Crepe) in [South Indian cuisine](/wiki/South_Indian_cuisine) made from a [fermented](/wiki/Fermentation_(food)) [batter](/wiki/Batter_(cooking)) of ground [black gram](/wiki/Vigna_mungo) and [rice](/wiki/Rice). Dosas are served hot, often with [chutney](/wiki/Chutney) and [sambar](/wiki/Sambar_(dish)). ## History The dosa originated in [South India](/wiki/South_India), but its precise geographical origins are unknown. According to [food historian](/wiki/Food_historian) [K. T. Achaya](/wiki/K._T._Achaya), references in the [Sangam literature](/wiki/Sangam_literature) suggest that dosa was already in use in the [ancient Tamil country](/wiki/Tamilagam) around the first century CE. However, according to historian [P. Thankappan Nair](/wiki/P._Thankappan_Nair), dosa originated in the town of [Udupi](/wiki/Udupi) in [Karnataka](/wiki/Karnataka). Achaya states that the earliest written mention of dosa appears in the eighth-century literature of present-day [Tamil Nadu](/wiki/Tamil_Nadu), while the earliest mention of dosaë in [Kannada literature](/wiki/Kannada_literature) appears a century later. In popular tradition, the origin of the dosa is linked to Udupi, probably because of the dish's association with [Udupi restaurants](/wiki/Udupi_cuisine#Udupi_restaurants). The Karnataka dosa is traditionally softer and thicker; the thinner and crispier version of dosa, which became popular across India, was first made in present-day Tamil Nadu. A recipe for dosa can be found in *[Manasollasa](/wiki/Manasollasa)*, a 12th-century [Sanskrit](/wiki/Sanskrit) encyclopedia compiled by [Someshvara III](/wiki/Someshvara_III), who ruled from present-day Karnataka. The dosa arrived in Mumbai with the opening of Udupi restaurants in the 1930s. After [India's independence](/wiki/Independence_of_India) in 1947, South Indian cuisine became gradually popular in [North India](/wiki/North_India). In [New Delhi](/wiki/New_Delhi), the Madras Hotel in [Connaught Place](/wiki/Connaught_Place,_New_Delhi) became one of the first restaurants to serve South Indian cuisine. Dosas, like many other dishes of South Indian cuisine, were introduced in [Ceylon](/wiki/Ceylon) (Sri Lanka) by [South Indian emigrants](/wiki/Indians_in_Sri_Lanka) during [British rule](/wiki/British_rule_in_Ceylon). [Tirunelveli](/wiki/Tirunelveli) and [Tuticorin](/wiki/Tuticorin) merchants who settled there were instrumental in the spreading of South Indian cookery across the island by opening restaurants ([vegetarian *hotels*](/wiki/Vegetarian_restaurant)) to meet initially the needs of the emigrant population. Dosa has found its way into the culinary habits of the Sri Lankan people, where it has evolved into an island-specific version which is quite distinct from the Indian dosa. In both forms, it is called *those* (තෝසේ or [t̪oːse]) or *thosai* (தோசை or [t̪oːsaɪ̯]) in [Sinhala](/wiki/Sinhala_language) and in [Sri Lankan Tamil](/wiki/Sri_Lankan_Tamil_dialects). As in Sri Lanka, dosa was introduced far abroad since the early 18th century, by the migration of the [Indian Tamil diaspora](/wiki/Indian_Tamil_diaspora) to [Southeast Asia](/wiki/Southeast_Asia) and later in the [Western world](/wiki/Western_world), and through the worldwide popularisation of Indian and Sri Lankan cuisines since the second half of the 20th century.[*citation needed*] ## Names Dosa is the [anglicised](/wiki/Anglicisation) name of a variety of South Indian names for the dish, for example, *dosai* in [Tamil](/wiki/Tamil_language), *dōsaë* in [Tulu](/wiki/Tulu_language), *dōse* in [Kannada](/wiki/Kannada), dōsa in [Telugu](/wiki/Telugu_language) and *dosha* in [Malayalam](/wiki/Malayalam_language). The standard transliterations and pronunciations of the word in various South Indian languages are: LanguageTransliterationPronunciation ([IPA](/wiki/International_Phonetic_Alphabet))[Kannada](/wiki/Kannada_language): ದೋಸೆdōse[d̪oːse][Malayalam](/wiki/Malayalam_language): ദോശdōśa[d̪oːʃa][Tamil](/wiki/Tamil_language): தோசைdōsai[d̪oːsaɪ̯][Telugu](/wiki/Telugu_language): దోసdōsa[d̪oːsa] The Tamil term தோசை *dōsai* lends to *thosai* as used in [Malaysian English](/wiki/Malaysian_English) and [Singapore English](/wiki/Singapore_English) mentioned above. ## Nutrition Dosa is high in [carbohydrates](/wiki/Carbohydrate) and contains no added [sugars](/wiki/Sugar). As its key ingredients are rice and [black gram](/wiki/Vigna_mungo), it is a good source of [protein](/wiki/Protein). A typical homemade plain dosa without oil contains about 112 calories, of which 84% is [carbohydrate](/wiki/Carbohydrate) and 16% is protein. The fermentation process increases the [vitamin B](/wiki/Vitamin_B) and [vitamin C](/wiki/Vitamin_C) content. ## Preparation A mixture of rice and white gram that has been soaked in water for at least 4–5 hours is ground finely to form a batter. Some add a bit of soaked [fenugreek](/wiki/Fenugreek) seeds while grinding the batter. The proportion of rice to lentils is generally 3:1 or 4:1. After adding salt, the batter is allowed to ferment overnight, before being mixed with water to get the desired consistency. The batter is then ladled onto a hot *[tava](/wiki/Tava)* or griddle greased with oil or *[ghee](/wiki/Ghee)*. It is spread out with the base of a ladle or a bowl to form a pancake. It can be made either thick like a pancake, or thin and crispy. A dosa is served hot, either folded in half or rolled like a wrap. It is usually served with chutney and sambar. The mixture of white grams and rice can be replaced with highly refined wheat flour or [semolina](/wiki/Semolina). ## Serving Dosas can be stuffed with fillings of [vegetables](/wiki/Vegetables) and sauces to make a quick meal. They are typically served with a vegetarian [side dish](/wiki/Side_dish), which varies according to regional and personal preferences. Common side items are: - [Sambar](/wiki/Sambar_(dish)) - [Chutney](/wiki/Chutney) - [Idli podi](/wiki/Idli_podi) or *milagaipodi*: A lentil powder with spices and sometimes desiccated coconut, mixed with sesame oil or groundnut oil or [ghee](/wiki/Ghee) - [Indian pickles](/wiki/Indian_pickle) ## Variations [Masala dosa](/wiki/Masala_dosa) is a roasted dosa served with potato curry, chutney, and sambar, while saada (plain) dosa is prepared with a lighter texture; paper dosa is a thin and crisp version. Rava dosa is made crispier using semolina. Newer versions include Chinese dosa, cheese dosa, paneer dosa, and pizza dosa. Though dosa is typically made with rice and lentils, other versions exist. Types of dosa NameDescription[Uttapam](/wiki/Uttapam)This variety of dosa is much thicker and softer and served with vegetable toppings. It also uses less oil, hence is considered healthier than the typical dosa. It takes more time to prepare than a regular dosa. Both surfaces may be baked. They are eaten like a regular dosa with servings of sambhar and chutney. Its history is as old as the dosa, featuring in Sangam literature. It is closely related to both the dosa and the [appam](/wiki/Appam).[Masala dosa](/wiki/Masala_dosa)Roasted and crispy dosa, served with potato curry, chutney and sambarOats dosaHealthy, crisp and lacy instant dosa made with oatsWheat dosaDosa made with wheat flour batter; a typical wheat dosa may consume more oil and takes longer to prepare than a regular dosa. Instead of oil, ghee or butter may be used.Set dosaSmaller, spongy, soft and light, served in a set of 2-3 dosa per servingRed rice dosaA healthier variant of the regular dosa, it uses [red rice](/wiki/Red_rice) instead of [white rice](/wiki/White_rice), though the batter may also involve a mixture of the two rice varieties, too.Plain dosaDosa has light texture and can be crispy.Kal dosaiA thicker, softer, and spongier variant of a plain dosa, it also uses a stone tawa instead of the regular iron tawa for other dosas.Tandoori dosaA variety of dosa that uses a tandoor to prepare it instead of a tawaGhee roast(*Nei dosai* in Tamil) Plain dosa cooked with ghee instead of oil and usually with no fillingPaper roast/Plain roast dosaA large, plain dosa known for its thin layer and crispiness resulting from making a very thin layer of batter and the addition of extra oil compared to plain dosaEgg dosa(*Muttai dosai* in Tamil) A thicker base of dosa topped with beaten [egg](/wiki/Egg), or beaten egg is added to batter before cooking.Kari dosaiA Tamil Nadu specialty with a dosa of thicker base topped with cooked meat, usually chicken or mutton: Dosas topped with vegetables or vegetable curry are also sometimes referred to as *kari dosai*.Madurai kari dosaiA famous variant of kari dosai is the Madurai kari dosai. This has a vegetarian and a non-vegetarian variant. The latter consists of non-vegetarian toppings of a mix of omlette, minced meat, and without vegetables, while the former has a fully vegetarian topping of vegetable curry.Pori dosa/Puffed rice dosaUses some [puffed rice](/wiki/Puffed_rice) alongside raw rice and some lentils in the batterPaneer dosaSpiced, flavorful [paneer](/wiki/Paneer) filling inside the dosaPalak dosaLayered with *palak* ([spinach](/wiki/Spinach)) paste inside the folds of dosaPizza dosaA fusion of the traditional dosa and a regular pizza, it comes in many subvariants. It primarily uses toppings that resemble those of a regular pizza.Spring roll dosaA fusion of the traditional plain dosa and the [spring roll](/wiki/Spring_roll), it has vegetarian and non-vegetarian variants. It uses the same stuffing as in the spring roll and is usually cut and served rolled up as a spring roll. It is also notably spicy.Jini dosaA variety from [Mumbai](/wiki/Mumbai); a crispy, cheesy dosa stuffed with a spicy mix of vegetables such as cabbage, carrots, and capsicum in addition to a tangy sauce.Schezwan dosaA type of dosa with stuffing of a mix of cooked vegetables and Schezwan sauceMini soya dosaSoya milk and wheat flour[Pesarattu](/wiki/Pesarattu) (green dosa)Made with [green gram](/wiki/Green_gram). It is served with Allam Pachadi. (Ginger chutney)Adai dosaFrom Tamil Nadu, it is a dosa-like dish prepared from a combination of *toor dal*, rice, curry leaves, red chillies, and asafoetida. The batter is not fermented, and is usually eaten with jaggery or *[aviyal](/wiki/Aviyal)*.Light white dosaRice and coconutKadapa Neyyi karam dosaRice flour fermented overnight and mixed with sodium carbonate. The topping is a mixture of onion and chili paste (called *yerra karam*) and a chutney made with tomato and flour made in a gravy of curd. It is roasted in [Ghee](/wiki/Ghee). It is also occasionally topped with fried gram powder.Onion rava dosaSemolina, rice flour, onionRagi wheat dosaRagi, whole wheat flour[Rava dosa](/wiki/Rava_dosa)Made with [*rava*](/wiki/Semolina) or [*sooji*](/wiki/Semolina) (semolina), it is a healthier alternative to regular dosa. Rava dosa takes up more oil than a regular dosa and can stick to the tawa if enough oil is not used. It also takes more time to prepare than a regular dosa.[Benne dose](/wiki/Benne_dose)Made with [butter](/wiki/Butter) (*benne* in Kannada), it is predominantly famous as *[Davanagere benne dose](/wiki/Benne_dose)* associated with the [Davanagere](/wiki/Davanagere) district in Karnataka.[Neer dosa](/wiki/Neer_dosa)Made with a watery rice batterVodu dose or Kappa rotiVodu dose or kappa roti is made from unfermented rice, [fenugreek](/wiki/Fenugreek), grated [coconut](/wiki/Coconut), thinly flattened rice, and sometimes leftover cooked rice. It is cooked on an earthen pan with a rounded bottom. It is fluffy and appears like a bread. It is cooked without the use of oil.Amboli, ghavan, dhirdeIn coastal parts of Maharashtra, variations known as *amboli* and *ghavan* are thin rice *crêpes* prepared with fermented batter, while *dhirde* is prepared with unfermented batter.Buttermilk dosaSemolina, maida, buttermilkJaggery dosaRice flour, maida, grated coconut, [jaggery](/wiki/Jaggery).MinapattuVery similar to plain dosa, this version tends to be thicker and, compared to plain dosa, it has a greater ratio of urad dal to rice flour or, in some cases, idli rava.Maida dosaThe maida dosa batter is made from maida (refined flour) by adding water to get dense consistency; chopped onion, chilli, coriander leaves, and salt are added for taste. Maida dosa is quickly made in many households of Karnataka state, India. ## World record On 16 November 2014, 29 chefs, at Hotel Daspalla in Hyderabad, India, created a dosa that was 16.68 m (54.7 ft) long and weighed 13.69 kg (30.2 lb), earning the [Guinness World Record](/wiki/Guinness_World_Record) for the longest dosa. ## In popular culture - In a November 2019 video promoting her [campaign for presidency](/wiki/Kamala_Harris_2020_presidential_campaign), [United States](/wiki/United_States) [Vice President](/wiki/Vice_President_of_the_United_States) [Kamala Harris](/wiki/Kamala_Harris) cooked masala dosa with actress and comedian [Mindy Kaling](/wiki/Mindy_Kaling). - The 2023 [Tamil culture](/wiki/Tamil_culture)-inspired [cooking video game](/wiki/Cooking_video_game) *[Venba](/wiki/Venba_(video_game))* features dosa as an in-game recipe. ## Related foods - [Uttapam](/wiki/Uttapam): a thick relatively soft crepe mostly topped with diced onions, tomatoes, cilantro or cheese, sometimes described as an Indian pizza - [Pesarattu](/wiki/Pesarattu): made from [green gram](/wiki/Green_gram) in [Andhra Pradesh](/wiki/Andhra_Pradesh), served with a ginger and tamarind chutney - [Appam](/wiki/Appam): a pancake prepared from patted rice batter, served with sweet coconut milk or sugar - [Chakuli pitha](/wiki/Chakuli_pitha): the batter contains more black gram and less rice flour - [Apam balik](/wiki/Martabak_manis): made from a mixture of flour, eggs, sugar, baking soda, coconut milk and water - [Jianbing](/wiki/Jianbing): a Chinese dish - [Bánh xèo](/wiki/B%C3%A1nh_x%C3%A8o): a Vietnamese dish - [Lahoh](/wiki/Lahoh): a Somali dish - [Injera](/wiki/Injera): an Ethiopian dish made with fermented [teff](/wiki/Teff) batter - Food portal - [List of fermented foods](/wiki/List_of_fermented_foods) - [List of Indian breads](/wiki/List_of_Indian_breads) - [List of pancakes](/wiki/List_of_pancakes) - [Udupi cuisine](/wiki/Udupi_cuisine) - [Cuisine of Kerala](/wiki/Cuisine_of_Kerala) - [South Indian cuisine](/wiki/South_Indian_cuisine) - [Thali](/wiki/Thali)\n",
  "language": "en",
  "processed_at": "2026-01-12T10:08:44.275069",
  "title": "Dosa (food)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Dosa_(food)"
}