{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:08:46.144533"
  },
  "content": "Chinese dessert made with tender tofuThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Douhua\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(December 2009)* *(Learn how and when to remove this message)* **Douhua**[a] is a Chinese sweet or savoury snack made with silken [tofu](/wiki/Tofu). It is also referred to as **doufuhua** or **tau foo fah**,[b] **doufunao**[c] in northern China, **tofu pudding**, and **soybean pudding**. ## History The earliest records of douhua date from the [Han dynasty](/wiki/Han_dynasty); it was called 豆腐脑 *dòufunǎo*, or \"tofu brains\", because of its softness. In the next 2000 years, it gradually spread throughout China. [Ming dynasty](/wiki/Ming_dynasty) scholars credited Han Prince [Liu An](/wiki/Liu_An) with inventing tofu and douhua as foods soft enough for his ailing mother to eat. During the [Second Sino-Japanese War](/wiki/Second_Sino-Japanese_War), [Sichuan](/wiki/Sichuan) became the political, economical, and military center of [Free China](/wiki/Free_China_(Second_Sino-Japanese_War)). The boss of a famous Douhua restaurant, Liu Xilu, learnt the methods of making beancurd from others and innovated on them until he finally came up with his own \"secret recipe\", which greatly improved its taste.[*citation needed*] ## Names Douhua豆花[Taiwan](/wiki/Taiwan), [Sichuan](/wiki/Sichuan), [Yunnan](/wiki/Yunnan), [Guizhou](/wiki/Guizhou), [Hunan](/wiki/Hunan), [Jiangxi](/wiki/Jiangxi), [Fujian](/wiki/Fujian), [Singapore](/wiki/Singapore); in northern China, *douhua* refers exclusively to sweet variantsIn Fujian, brown sugar is added to sweet Douhua, while salted Douhua is flavored with dried radish, fried garlic, cilantro, dried shrimps, etc. In Taiwan, beans such as [mung bean](/wiki/Mung_bean), [red beans](/wiki/Red_bean), and peeled peanuts are usually added, as well as soy milk, fruit, or [taro balls](/wiki/Taro_ball).Doufuhua豆腐花Southern China, [Hong Kong](/wiki/Hong_Kong), [Macau](/wiki/Macau), [Malaysia](/wiki/Malaysia), [Singapore](/wiki/Singapore)In Hong Kong and Macau, [brown sugar](/wiki/Brown_sugar), sweet-scented [osmanthus](/wiki/Osmanthus) syrup, and ginger juice are usually added to Douhua. Chili oil or powder is normally added to it in southwest China.Doufunao豆腐脑North China, [Hubei](/wiki/Hubei), [Anhui](/wiki/Anhui), [Jiangsu](/wiki/Jiangsu), [Henan](/wiki/Henan), [Shanghai](/wiki/Shanghai), [Zhejiang](/wiki/Zhejiang)Northern *doufunao* (lit. \"tofu brains\") are often seasoned with \"salted [stew](/wiki/Stew)\", and Henan people usually eat it with local snacks. Tofu brains in Jiangsu, Zhejiang, and Shanghai are generally salty tofu brains like the northern ones. People in Hubei and Anhui also call it as tofu brain, but tofu brain in Hubei is generally added with white sugar, which is the sweet version.Laodoufu老豆腐TianjinIn [Tianjin cuisine](/wiki/Tianjin_cuisine), Northern-style savoury \"tofu brain\" is a common breakfast item known as *laodoufu* (old tofu).Doufusheng豆腐生[Taizhou, Zhejiang](/wiki/Taizhou,_Zhejiang)Sweet Douhua there is topped with syrup and some sweet-scented osmanthus; the salty one is topped with mustard tuber, seaweed, spring onion, etc.Nendoufu嫩豆腐[Hubei](/wiki/Hubei)In Hubei, people call spicy Douhua \"silk tofu.\" ## Regional variants Variants of *douhua* can be broadly divided into three groups: savoury (鹹), spicy (辣), and sweet (甜). Traditionally, sweet *douhua* was mainly distributed in [South China](/wiki/South_China) and Hong Kong, and was introduced to Taiwan and Southeast Asia; salty *douhua* was mainly distributed in northern China, and spicy *douhua* was mainly distributed in southwest China. ### Savoury In Northern China, Douhua is often eaten with [soy sauce](/wiki/Soy_sauce), resulting in a savoury flavor. Each region may differ in seasonings. Inland cities add chopped meat, [pickles](/wiki/Chinese_pickles) or *[zha cai](/wiki/Zha_cai)*, and mushrooms, while coastal cities add seaweed and small shrimp. Tofu brains can be found at breakfast stands along the streets in the morning, usually with eggs or [youtiao](/wiki/Youtiao) (fried dough sticks). ### Spicy In [Sichuan](/wiki/Sichuan) and neighboring [Shaanxi](/wiki/Shaanxi), *doufunao* is often flavored with chilli oil and [Sichuan peppers](/wiki/Sichuan_peppers) to make it spicy. It is served by [carrying pole](/wiki/Carrying_pole) or bicycle vendors with several condiments such as chili oil, soy sauce, scallions, and nuts. ### Sweet In [Hubei](/wiki/Hubei), [Hunan](/wiki/Hunan) and [Jiangxi](/wiki/Jiangxi), sugar is added directly to the tofu curd without adding any other condiments. This way of eating best retains the original flavor of tofu curd (bean curd). In southern China, Douhua is often eaten with sweet flavoring. Southern China often refers to Douhua as tofu pudding. It is served with sweet ginger or clear syrup. In summer, people eat cold Douhua to relieve themselves of the heat. In winter, people add hot sweet water and beans into Douhua to dispel cold. Hong Kong people add [sesame paste](/wiki/Tahini) into Douhua. Taiwanese and Cantonese *douhua* are a symbol of southern Chinese cuisine, and often served as a part of [yum cha](/wiki/Yum_cha). Known as *tofu fa*, it can also be found sold in small stores on the side of popular hiking trails and beaches in Hong Kong. In Southeast Asia, *douhua* is almost always sweet, although condiments vary widely. #### Filipino cuisine In the [Philippines](/wiki/Filipino_cuisine), it is more commonly known as *[taho](/wiki/Taho)*. It is a fresh silken tofu served in sweet brown syrup and sago pearls. It is usually peddled by [hawkers](/wiki/Hawker_(trade)) in the mornings, by door-to-door or in public plazas, or outside churches. In some regional variations, taho is often served with sugarcane syrup, ube syrup or strawberry syrup. #### Indonesian cuisine In Java, it is known as *kembang tahu*, ꦮꦺꦢꦁꦠꦲꦸ *wedang tahu* \"hot tofu soup\" or *tahwa* derived from [Hokkien](/wiki/Hokkien) *tau hwe*. They are usually sold by [hawkers](/wiki/Hawker_(trade)). It is served warm or cold with palm sugar syrup that has been flavored with pandan leaves and ginger.[*citation needed*] #### Malaysian and Singaporean cuisine In [Malaysia](/wiki/Malaysian_cuisine) and [Singapore](/wiki/Singaporean_cuisine), it is more commonly known by its names *tau hua* or *tau huay* in [Hokkien](/wiki/Hokkien); and *tau fu fa* in [Cantonese](/wiki/Cantonese), with the latter being more common in Malaysia. In [Penang](/wiki/Penang), the common term is *tau hua*, due to [Hokkien](/wiki/Hokkien) being its dominant local Chinese language. In [Kelantan](/wiki/Kelantan), the dish is known as *pati soya* (lit. 'soy essence').[*citation needed*] It is usually served either with a clear sweet syrup alone, with [ginkgo](/wiki/Ginkgo_biloba) seeds suspended in the syrup, or in a sugar syrup infused with [pandan](/wiki/Pandanus_amaryllifolius). Alternatively, it can also be served with *[gula melaka](/wiki/Gula_melaka)* syrup. #### Thai cuisine In [Thailand](/wiki/Thai_cuisine), it is known by its Chinese [Hokkien](/wiki/Hokkien) name *taohuai* (เต้าฮวย). It is usually served cold with milk and fruit salad, which is known as *taohuai nom sot* (เต้าฮวยนมสด, literally \"douhua in fresh milk\") or *taohuai fruit salad* (เต้าฮวยฟรุตสลัด), or served hot with ginger syrup, which is known as *taohuai nam khing* (เต้าฮวยน้ำขิง). #### Vietnamese cuisine In [Vietnam](/wiki/Vietnamese_cuisine), it is known as *tàu hủ nước đường*, *tàu hủ hoa* or *tào phớ*, *đậu hủ*, *tàu hủ*. It varies in three regions in Vietnam: - **Northern region** — served with jasmine infused sugary water. It is enjoyed as warm in winter and cold with ice in summer. - **Central region** — cooked with spicy ginger. Sugar is added. Douhua pieces are usually unshaped because of their softness. - **Southern region** — same with Central region. Often served warm with sugar water, ginger is added. Coconut milk or tapioca pearls are optional. Vietnamese sweet tofu is generally the same, sometimes it will changes based on summer or winter seasons. ## Nutritional value and health benefits This section **needs additional citations for verification**. Relevant discussion may be found on the talk page. Please help improve this article by adding citations to reliable sources in this section. Unsourced material may be challenged and removed. *(June 2021)* *(Learn how and when to remove this message)* Douhua is rich in nutrients, contains [iron](/wiki/Iron), [calcium](/wiki/Calcium), [phosphorus](/wiki/Phosphorus), [magnesium](/wiki/Magnesium) and other [trace elements](/wiki/Trace_element) necessary for the human body. It also contains [sugar](/wiki/Sugar), [vegetable oil](/wiki/Vegetable_oil), and high-quality [protein](/wiki/Protein). The digestion and absorption rate of tofu is more than 95%. In addition to its function of increasing nutrition and helping digestion, tofu is also beneficial to the growth and development of teeth and bones. It can increase iron element in people's blood in the [hematopoietic](/wiki/Haematopoiesis) function; tofu does not contain [cholesterol](/wiki/Cholesterol), which is very beneficial to people with [hypertension](/wiki/Hypertension), [high blood lipids](/wiki/Dyslipidemia), [hypercholesterolemia](/wiki/Hypercholesterolemia), [arteriosclerosis](/wiki/Arteriosclerosis), and [coronary artery disease](/wiki/Coronary_artery_disease). It is a valuable [food supplement](/wiki/Food_supplement) for children and the elders. Tofu is rich in [phytoestrogens](/wiki/Phytoestrogen) as well, which has an effect on preventing and inhibiting [osteoporosis](/wiki/Osteoporosis), [breast cancer](/wiki/Breast_cancer), [prostate cancer](/wiki/Prostate_cancer), and [blood cancer](/wiki/Tumors_of_the_hematopoietic_and_lymphoid_tissues). The [sterols](/wiki/Sterol) and [stigmasterol](/wiki/Stigmasterol) in tofu are both effective ingredients for suppressing cancer. ## Packaged The dessert is also sold in North American [Asian supermarkets](/wiki/Asian_supermarket) in plastic containers. ## Requirements Like all tofu, douhua must have a [coagulant](/wiki/Flocculation), often [gluconolactone](/wiki/Gluconolactone) for smoothness as compared with other coagulants. Tofu pudding made from agarwood, edible gum, and seaweed extracts is more like soy milk-flavored jelly pudding. Because it melts into liquid soy milk when heated, it can only be eaten at room temperature, but the success rate of making it is extremely high. It is high and easy, so it is widely used. ## In popular culture Tofu pudding was featured on the [Netflix TV series](/wiki/List_of_original_programs_distributed_by_Netflix), *[Street Food](/wiki/Street_Food_(TV_series))*, in the [Chiayi, Taiwan](/wiki/Chiayi,_Taiwan) episode. - [Dim sum](/wiki/Dim_sum) - [Tofu](/wiki/Tofu) - [Taho](/wiki/Taho) - [Soy yogurt](/wiki/Soy_yogurt) - [List of tofu dishes](/wiki/List_of_tofu_dishes) - Food portal ## Notes\n",
  "language": "en",
  "processed_at": "2026-01-12T10:08:46.144018",
  "title": "Douhua",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Douhua"
}