{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:06:33.589056"
  },
  "content": "Military research and development organization in Singapore **DSO National Laboratories** (**DSO**) is a national defence research and development organisation in [Singapore](/wiki/Singapore) developing technological solutions for defence and national security. Founded as the **Electronics Test Centre** (**ETC**), it was established in 1972 by then-Minister for Defence [Goh Keng Swee](/wiki/Goh_Keng_Swee), to conduct research on future warfare. It was later renamed to the **Defence Science Organisation** (**DSO**) in 1977. Upon its incorporation as a not-for-profit company in 1997, it was renamed as **DSO National Laboratories**. Today, much of the work done by DSO has gone into Singapore's military, as well as into agencies responsible for homeland security. It has currently more than 1,600 research scientists and engineers. ## History ### Early history and secrecy (1972 - 1988) In 1972, [Dr Goh Keng Swee](/wiki/Goh_Keng_Swee) picked three newly graduated engineers to study Electronic Warfare, forming the Electronics Test Centre (ETC) to develop defence technologies for Singapore. In 1977, the ETC was renamed and formally established as the Defence Science Organisation (DSO) with 50 engineers. The [Ministry of Defence](/wiki/Ministry_of_Defence_(Singapore)) later formed the Defence Technology Group (DTG) that united the technology and logistics groups in the Ministry of Defence with DSO, establishing DSO as the centre of Research and Development for the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces). ### Later history, assisting in SARS operations (1989 – 2010) In 1989, the existence of DSO was publicly acknowledged for the first time. In a move to embrace the best practices in industry, DSO corporatized and renamed itself as DSO National Laboratories in 1997. The organisation further expanded to Science Park and Marina Hill. In 2003, DSO provided support during the [2002-2004 SARS outbreak](/wiki/2002%E2%80%932004_SARS_outbreak), providing research and diagnostic support for clinical samples and aiding in the modeling of SARS epidemiology. ### Recent history (2011 – Present) DSO launched [TeLEOS-1](/wiki/TeLEOS-1) into space in 2015, Singapore's first commercial near [earth observation satellite](/wiki/Earth_observation_satellite). Having grown to 1,500 engineers in 2017, DSO moved into its new home at Science Park Drive and is now the largest defence research and development organisation in Singapore with research domains across land, air, sea, space, and cyberspace. - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T10:06:33.588602",
  "title": "DSO National Laboratories",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/DSO_National_Laboratories"
}