{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:08:58.655767"
  },
  "content": "Southeast Asian duck dish**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Duck rice\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(June 2013)* *(Learn how and when to remove this message)*The examples and perspective in this article **may not represent a worldwide view of the subject**. You may improve this article, discuss the issue on the talk page, or create a new article, as appropriate. *(October 2015)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* **Duck rice** ([simplified Chinese](/wiki/Simplified_Chinese_characters): 鸭饭; [traditional Chinese](/wiki/Traditional_Chinese_characters): 鴨飯; [pinyin](/wiki/Pinyin): *yā fàn*; [Jyutping](/wiki/Jyutping): *aap3 faan6*; [Pe̍h-ōe-jī](/wiki/Pe%CC%8Dh-%C5%8De-j%C4%AB): *ah-pn̄g*) is a [Southeast Asian](/wiki/Southeast_Asia) meat dish usually consumed by the [Chinese diaspora](/wiki/Chinese_diaspora) in [Maritime Southeast Asia](/wiki/Maritime_Southeast_Asia), made of either braised or roasted duck and plain white rice. The braised duck is usually cooked with yam and shrimp. It can be served simply with plain white rice and a thick dark sauce; side dishes such as braised hard-boiled eggs, preserved salted vegetables or hard beancurd may be added. Teochew boneless duck rice is a similar, but more refined dish; due to the slightly tougher texture of duck, the duck is artfully deboned and sliced thinly for the convenience of the diner, allowing the sauces to seep into the meat. [Hainanese chicken rice](/wiki/Hainanese_chicken_rice) and other similar dishes are frequently served in this style due to its popularity. This dish can commonly be found in Singapore food centers. In Thailand, this dish is called *khao na pet* (ข้าวหน้าเป็ด; lit: \"rice topped with duck\"), and is sold by street vendors or in restaurants inside shopping malls. A Bangkok neighborhood known for its duck rice is [Bangrak](/wiki/Bangrak) on [Charoen Krung](/wiki/Charoen_Krung) road. In addition, it has also been adapted to other dishes by mixing roasted red pork and [Chinese sausage](/wiki/Chinese_sausage) with a special gravy, a dish called *khao che po* (ข้าวเฉโป) or *khao sia po* (ข้าวเสียโป), meaning \"gamble away rice\". It is considered traditional [Teochew cuisine](/wiki/Teochew_cuisine). - Food portal - China portal - Indonesia portal - Thailand portal - [Siu mei](/wiki/Siu_mei) are Cantonese roast meats, often sold together with plain rice - [List of duck dishes](/wiki/Duck_as_food#Duck_dishes) - [List of rice dishes](/wiki/List_of_rice_dishes) This [Singaporean cuisine](/wiki/Singaporean_cuisine)-related article is a stub. You can help Wikipedia by expanding it. - v - t - e This article related to [Chinese cuisine](/wiki/Chinese_cuisine) is a stub. You can help Wikipedia by expanding it. - v - t - e This article about [Thai cuisine](/wiki/Thai_cuisine) is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T10:08:58.655297",
  "title": "Duck rice",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Duck_rice"
}