{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:09:00.594762"
  },
  "content": "Building in Tanglin, Singapore **Dutch Pavilion** is a building within the grounds of the [Shangri-La Singapore](/wiki/Shangri-La_Hotel_Singapore) hotel on Orange Grove Road in [Tanglin, Singapore](/wiki/Tanglin). Previously the premises of the Hollandse School, it currently serves as a wedding venue. ## Description The single storey building features a pitched roof with a bell tower above it at the front. The original red tiles of the building's roof were retained. The exterior also feature colonial-style balustrades and \"old-fashioned\" wall lamps. ## History The building's foundation stone was laid by the daughter of a member of the local school board on 4 March 1928. The building, which was designed by prominent architect Heinrich Rudolf Arbenz, was officially opened on 21 June. The opening ceremony was attended by [Richard Olaf Winstedt](/wiki/Richard_Olaf_Winstedt), then the Director of Education of the [Straits Settlements](/wiki/Straits_Settlements). It housed classrooms and an assembly hall. Prior to the building's completion, the school had been housed at the Dutch Club. During the [Japanese Occupation of Singapore](/wiki/Japanese_Occupation_of_Singapore), the school was not in operation as most of its staff and students had been interned. It reopened in December 1946. By 1978, the number of students at the school had grown to 150 and the building had become \"cramped\". In January 1983, the Shangri-La Hotel, which is situated next to the building, purchased the land on which the building stands for $5.5 million. Plans to move to a new campus in 1985 in [Bukit Timah](/wiki/Bukit_Timah) had been made by January 1984. In June 1988, it was announced that the building had been converted into a tennis pavilion for the hotel and that it had been preserved for its \"historical significance\". The building reopened as a wedding venue in 2014 following a $1.5 million \"complete\" restoration. 1°18′45″N 103°49′33″E﻿ / ﻿1.31245°N 103.82580°E﻿ / 1.31245; 103.82580\n",
  "language": "en",
  "processed_at": "2026-01-12T10:09:00.594150",
  "title": "Dutch Pavilion (Singapore)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Dutch_Pavilion_(Singapore)"
}