{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:09:04.345796"
  },
  "content": "British–Singaporean multinational technology company **Dyson Limited**, [d.b.a](/wiki/Trade_name) **Dyson**, is a Singaporean–British multinational technology company. Founded in 1991 by [James Dyson](/wiki/James_Dyson) in [Malmesbury](/wiki/Malmesbury), England, the company designs and manufactures [household appliances](/wiki/Home_appliance) such as [vacuum cleaners](/wiki/Vacuum_cleaner), [air purifiers](/wiki/Air_purifier), [hand dryers](/wiki/Hand_dryer), [bladeless fans](/wiki/Bladeless_fan), [heaters](/wiki/HVAC#Heating), [hair dryers](/wiki/Hair_dryer), and lights. As at 2022 Dyson has more than 14,000 employees worldwide. In 2019, Dyson moved its headquarters from the United Kingdom to Singapore to be closer to its manufacturing and supply-chain hubs and Asian customer base. ## History ### Early years In the 1970s, James Dyson bought a [Hoover](/wiki/The_Hoover_Company) Junior vacuum cleaner, which lost suction after a period of use. Frustrated, Dyson emptied the disposable paper bag to try to restore the suction but this had no effect. On opening the bag to investigate, he noticed a layer of dust inside, clogging the fine material mesh. Later, Dyson was working on his [ballbarrow](/wiki/Ballbarrow) at a company he had founded (but no longer entirely owned) where a large vacuum system was used to contain the [fusion bonded epoxy coating](/wiki/Fusion_bonded_epoxy_coating) that was sprayed on the wheelbarrow arms as a [powder coating](/wiki/Powder_coating). Dyson found the system inefficient, and was told by equipment manufacturers that [giant cyclone](/wiki/Cyclonic_separation) systems were better. [Centrifugal](/wiki/Centrifugal_force) separators are a typical method of collecting dirt, dust and debris in industrial settings, but such methods usually were not applied on a smaller scale because of the higher cost. He knew [sawmills](/wiki/Sawmill) used this type of equipment, and investigated by visiting a local sawmill at night and taking measurements. He then built a 30-foot model for the ballbarrow factory. While constructing this at home, Dyson realised the function of the cyclone was to extract dust without clogging. Wondering whether this could be applied at a smaller scale to a home vacuum, he constructed a cardboard model with sticky tape, connected it to his Hoover with its bag removed, and found it worked satisfactorily. The directors of the ballbarrow company thought if a better vacuum was possible, Hoover or [Electrolux](/wiki/Electrolux) would have invented it. Dyson was undeterred, and was kicked out of his company. [Jeremy Fry](/wiki/Jeremy_Fry) provided 49% of the investment for cyclonic vacuum development, and the rest came from a loan. In the shed behind his house, Dyson developed 5,127 prototype designs between 1979 and 1984. The first prototype vacuum cleaner, a red and blue machine, brought Dyson little success, as he struggled to find a licensee for his machine in the UK and America. Manufacturing companies such as Hoover did not want to license the design, probably because the vacuum bag market was worth US$500 million and thus Dyson was a threat to their profits. The only company that expressed interest in the new cyclonic vacuum technology was Dyson's former employer, [Rotork](/wiki/Rotork). Built by Italian appliance maker [Zanussi](/wiki/Zanussi) and sold by [Kleeneze](/wiki/Kleeneze) through a [mail order catalogue](/wiki/Mail_order), the Kleeneze Rotork Cyclon was the first publicly sold vacuum cleaner of Dyson's design. Only about 500 units were sold in 1983. In April 1984, Dyson claimed that he had sent the prototype machines, drawings, and confidential information to the American consumer-products maker [Amway](/wiki/Amway) as part of a proposed licensing deal. The deal fell through, but in January 1985 Amway produced the CMS-1000, a machine which was very similar to the Dyson design. Less than a month later, Dyson sued Amway for patent infringement. In 1985, a Japanese company, Apex Ltd., expressed interest in licensing Dyson's design, and in March 1986, a reworked version of the Cyclon, called G-Force, was put into production and sold in Japan for the equivalent of US$2,000. The G-Force had an attachment that could turn it into a table to save space in small Japanese apartments.[*verification needed*] In 1991, it won the [International Design Fair prize](/wiki/IF_Product_Design_Award) in Japan, and became a status symbol there. ### Founding of Dyson #### Dual cyclone Using the income from the Japanese licence, James Dyson set up **Dyson Appliances Limited** in 1991, although it was registered as **Barleta Limited**. The first dual-cyclone vacuum built under the Dyson name, the DA 001, was produced by American company Phillips Plastics in a facility in [Wrexham](/wiki/Wrexham), Wales, beginning in January 1993 and sold for about £200. Vacuum assembly took place in the unused half of the plastic factory. Due to quality control concerns and Phillips's desire to renegotiate the terms of their contract to build the vacuum cleaner, Dyson severed the agreement in May 1993. Within two months he set up a new supply chain and opened a new production facility in [Chippenham](/wiki/Chippenham), Wiltshire, England; the first vacuum built at the new facility was completed 1 July 1993. The DA 001 was soon replaced by an almost identical cleaner, the DC01. Dyson licensed the technology in North America from 1986 to 2001 to [Fantom Technologies](/wiki/Fantom_Technologies), after which Dyson entered the market directly. #### Transparent container Even though market research showed that people would not be happy with a transparent container for the dust, Dyson and his team decided to make a transparent container anyway and this turned out to be a popular and enduring feature which has been heavily copied. The DC01 became the biggest selling vacuum cleaner in the UK in just 18 months. By 2001 the DC01 made up 47% of the upright vacuum cleaner market. #### Cylinder machine The company introduced a cylinder machine, the DC02, and produced a number of special editions and revised models (DC02 Absolute, DC02 De Stijl, DC05, DC04, DC06, DC04 Zorbster). On 2 January 2001 the company name was shortened from Dyson Appliances Ltd. to Dyson Ltd. In April of that year the DC07, a new upright vacuum cleaner using \"Root Cyclone\" technology with seven cyclone funnels instead of the original dual-cyclone design, was launched. By 2009 Dyson began creating other technologies: the [Airblade](/wiki/Dyson_Airblade) hand dryer, the Air Multiplier \"bladeless\" fan and Dyson Hot, the \"bladeless\" fan heater. In October 2019 Dyson released the Pure Cryptomic, available in a fan version and a heater + fan version. The device is able to remove [formaldehyde](/wiki/Formaldehyde) from the air; this flammable and colourless gas can irritate the skin, eyes, nose, and throat. ### Production locations Dyson vacuum cleaners and washing machines were made in [Malmesbury](/wiki/Malmesbury), Wiltshire, until 2002, when the company transferred vacuum cleaner production to Malaysia. There was some controversy over the reason for this move, as well as over plans to expand Dyson's factory to increase production. Trade unionists in Wiltshire claimed that the move would negatively impact the local economy through the loss of jobs. The following year, washing machine production was also transferred to Malaysia. This move was driven by lower production costs in Malaysia (30% less than in the UK); it resulted in the loss of 65 jobs. In 2004, the Meiban-Dyson Laundry Manufacturing Plant was opened in [Johor](/wiki/Johor), Malaysia. The RM10 million (approx. US$2.63 million) plant is a joint venture between Dyson and the Singapore-based Meiban Group Ltd., which has manufacturing facilities in China, Malaysia and Singapore. Dyson stated that the cost savings from transferring production to Malaysia enabled investment in research and development at their Malmesbury head office. In 2007, Dyson formed a partnership with the Malaysian electronics manufacturer VS Industry Bhd (VSI) to take on a major role in Dyson's supply chain, from raw material sourcing and production to distribution. VSI also undertook an extensive production plan to supply finished product to Dyson's markets around the globe (America, UK, Japan, etc.). In 2016, it was said that Dyson has around 7,000 employees. Dyson has not publicly stated where those employees are located, though it is known that VS Industry Bhd (VSI) had around 4,250 employees[*when?*] at their Malaysian facility which manufactures Dyson products, and in 2007 it was reported that Dyson was responsible for 80% of VS Industry Bhd revenue. In 2009, SKP Resources Bhd moved from being Dyson's sub-contractor to contract manufacturer, by supplying an upright vacuum cleaner. In 2015 SKP continued to expand with a new facility in order to meet Dyson's growing demand. The world's first Dyson hairdryer is produced by SKP. In February 2022, [Channel 4 News](/wiki/Channel_4_News) reported allegations of \"forced labour\" conditions at a Malaysian manufacturer of Dyson products. Not long after, Dyson announced termination of contracts with the manufacturer, known as ATA IMS, adding that \"We hope this gives ATA the impetus to improve, and enables an orderly withdrawal in the interests of the workers that they employ.\" ### Worldwide expansion Dyson launched a US$360 million plant in [Tuas](/wiki/Tuas), Singapore, in 2013, which can produce four million electric motors a year. In 2016, Dyson injected $100 million to increase output to an estimated 11 million digital motors a year. , In January 2017, Dyson announced its US headquarters and operations would move to the [Fulton Market District](/wiki/Fulton_Market_District) in [Chicago](/wiki/Chicago) by the end of the year. The move added 100 employees to the company's Chicago headcount with over 40,000 square feet of newly leased office space. In February 2017, Dyson announced a significant expansion programme in the UK, opening a new high-tech campus on the former RAF [Hullavington Airfield](/wiki/Hullavington_Airfield) in [Hullavington](/wiki/Hullavington), Wiltshire, about 5 miles (8 km) south of its Malmesbury site. It has been suggested[*needs update*] that research there will focus on [battery technologies](/wiki/Battery_(electricity)), following the acquisition of US start-up Sakti3, and [robotics](/wiki/Robotics). ### Headquarters relocation to Singapore On 22 January 2019, Dyson announced plans to move its company headquarters to [Singapore](/wiki/Singapore), citing its intention to be closer with its fastest growing markets throughout the Asia-Pacific as well as stating its unhappiness when dealing with the [European Union](/wiki/European_Union) (EU), which it perceives as being overly bureaucratic. Its headquarters are at the [St James Power Station](/wiki/St_James_Power_Station), a former coal-fired power plant which it leased. The building underwent restoration works from 2019 to 2021. It officially began moving to its headquarters in end-2021; the now restored St James Power Station was subsequently officially completed on 4 March 2022. In 2022, Dyson announced that it would be investing a further S$1.5 billion in Singapore. In March 2022, Dyson announced plans to invest $1.5 billion (approximately $1.1 billion) in Singapore over the next four years. This investment is part of a broader $4.9 billion global strategy unveiled in 2020, which allocates funds among Dyson’s global headquarters in Singapore, its two campuses in [Wiltshire](/wiki/Wiltshire) and operations in the Philippines. ### Cease of Russian operations On 22 February 2022, two days prior to the [Russian invasion of Ukraine](/wiki/Russian_invasion_of_Ukraine), Dyson ceased supplying products to Russia. The company discontinued all online sales, social media presence, and advertising activities within the country. Additionally, the annual James Dyson Award has been suspended in Russia. Dyson has also shut down all directly managed retail spaces and tried to halt activities at third-party retailers. ## Products Dyson designs, manufactures and sells a variety of [household appliances](/wiki/Home_appliance) such as [vacuum cleaners](/wiki/Vacuum_cleaner), [air purifiers](/wiki/Air_purifier), [hand dryers](/wiki/Hand_dryer), [hidden-blade fans](/wiki/Bladeless_fan), [heaters](/wiki/HVAC#Heating), [hair dryers](/wiki/Hair_dryer), and lights. ## Research projects ### Robotic vacuum cleaners In 2014, Dyson invested in a joint robotics lab with [Imperial College London](/wiki/Imperial_College_London) to investigate vision systems and engineer a generation of [household robots](/wiki/Household_robot). In 2001 the company had been close to launching a [robot vacuum](/wiki/Robotic_vacuum_cleaner), the DC06, but James Dyson pulled it from the production line as it was too heavy and slow. In 2016 Dyson launched the 360 Eye, in 2021 the 360 Heurist, in 2023 the 360 Vis Nav and in 2025 the Spot+Scrub Ai. ### Collaboration with universities Dyson funded a professorship at the [University of Cambridge](/wiki/University_of_Cambridge) Department of Engineering in November 2011, adding to earlier funding of post-doctorate research. The Dyson Professor of Fluid Mechanics focuses on teaching and researching the science and engineering behind air movement. In addition, Dyson invested hundreds of thousands of pounds in a Dyson research branch at [Newcastle University](/wiki/Newcastle_University) in May 2012, to investigate the next generation of Dyson digital motors and motor drives. ### Solid-state batteries In March 2015, Dyson invested in its first outside business, paying $15m for an undisclosed stake in US battery start-up [Sakti3](/wiki/Sakti3), which is developing [solid-state batteries](/wiki/Solid-state_battery). Dyson acquired the remaining stake in Sakti3 for $90 million in October 2015. Dyson researchers had been working on battery technology since 2010. In 2017 Dyson abandoned its licensing of patents held by the [University of Michigan](/wiki/University_of_Michigan), casting doubt on Sakti3's technology. ### Electric vehicles In September 2017, James Dyson announced via email to employees that the company had 400 people working on a battery electric vehicle, secretly in the works for two years, which it hoped to release by 2021. Further information about the company's plans emerged in February 2018, with news of three electric vehicles under development as part of an estimated $3 billion project. In October 2019 Dyson said its engineers had developed a \"fantastic electric car\" but that it would not be taken further because it was not \"commercially viable\" and there was lack of potential buyers. The project employed over 500, most of them in the UK. A prototype of the EV, known as the N526, was unveiled in 2020 and was placed on display within Dyson headquarters. ### Medical ventilators In March 2020, in light of the [COVID-19](/wiki/Coronavirus_disease_2019) pandemic, Dyson announced that they would be supporting UK hospitals by manufacturing [ventilators](/wiki/Ventilator). On 25 March it was announced that the British government had ordered 10,000 ventilators from the company, subject to their design passing stringent medical tests. Engineers produced a device named CoVent, but on 24 April the company said the ventilator was \"no longer required\". ## Philanthropy ### James Dyson Award The James Dyson Award is an international student design award running in 18 countries. It is run by the James Dyson Foundation, James Dyson's charitable trust, and is presented jointly to students and their university. Over 727 schools in Great Britain and Northern Ireland have used Dyson's educational \"Ideas Boxes\", sent to teachers and pupils, in order to learn more about the design process. The James Dyson Foundation also provides bursaries and scholarships to aspiring engineers. ### Dyson Institute of Engineering and Technology In November 2016 James Dyson announced plans to open a higher education college to address the engineering skills gap in the UK. In September 2017 it welcomed its first cohort of undergraduates, partnering with the [University of Warwick](/wiki/University_of_Warwick) to offer BEng degrees in engineering, whilst also employing them as engineers three days a week. The second cohort of students, joining in September 2018, was 40% female, compared to a national average of 15.1% for engineering subjects. ## Lawsuits ### Amway In 1985, Dyson sued [Amway](/wiki/Amway) for copyright infringement of a Dyson dual cyclone prototype machine. Dyson claimed that he had sent the prototype machines, drawings, and confidential information to Amway as part of a contract in April 1984. In January 1985 Amway produced the CMS-1000, a machine which was very similar to the Dyson design. Less than a month later, Dyson sued Amway. Dyson and Amway settled the lawsuit in 1991, becoming joint licensees. ### Hoover In 2000, Dyson sued Hoover for patent infringement of Hoover's Triple Vortex, which was using cyclonic technology and patents similar to Dyson's Dual Cyclone, Dyson won against Hoover and accepted the settlement offer of £4m plus £2m in legal costs. ### Trademark application On 25 January 2007, the [Court of Justice of the European Union](/wiki/Court_of_Justice_of_the_European_Union) made a [decision](/wiki/Dyson_v_Registrar_of_Trade_Marks) concerning a [trademark](/wiki/Trademark) dispute over an application submitted by Dyson. The company had tried to register a trademark for \"a transparent bin or collection chamber\" of the new Dual Cyclone vacuum cleaner. However, the Court decided that Dyson's application was too abstract and that the bin or chamber could not be a sign of which a trademark may consist. ### Excel Dryer On 5 December 2012, a lawsuit by the hand-dryer manufacturer [Excel Dryer](/wiki/Excel_Dryer) was filed against Dyson, claiming that Dyson's advertising comparing the [Airblade](/wiki/Dyson_Airblade) to the Excel Dryer Xlerator was deceptive. Dyson's advertisements stated that the Xlerator produced twice as much carbon dioxide, was worse for the environment, and cost more to operate than the Airblade. Excel Dryer claimed that Dyson was falsifying its comparisons by submitting a 20-second dry time for the Xlerator to the Materials Systems Laboratory at the [Massachusetts Institute of Technology](/wiki/Massachusetts_Institute_of_Technology), rather than Excel Dryer's tested 12 second dry time, thus inflating energy consumption figures in the Airblade's favour.[*needs update*] ### LG In October 2015, [LG](/wiki/LG_Corporation) sued Dyson in Australia over an advertisement claiming the V6 vacuum to have \"twice the suction power of all cordless vacuums.\" LG stated their vacuum Cord Zero Cyking provides 200 watts of maximum suction power, twice that of the Dyson V6. LG dropped the lawsuits after Dyson said it would accept LG Electronics' request. The British company said it would remove two advertisement claims – \"The most powerful cordless vacuums\" and \"Twice the suction power of any cordless vacuums\" – from all electronics outlets in Australia by December 2015. In November 2017, Dyson took legal action against LG in South Korea for false advertisement of its Cord Zero A9 cordless vacuum cleaner. Dyson claimed the ads exaggerated the vacuum's performance with statements such as \"rotation speed of the motor ... 16 times faster than that of a jet engine\" and could be construed as misinforming users. The court dismissed the suit in April 2018, stating the LG's ad was based on test results generated through objective means at reliable institutions and that no evidence was found that proved LG had intentionally made false or exaggerated claims. ### Qualtex In 2006, Dyson sued the parts manufacturer Qualtex for copyright and unregistered design right infringement, for creating and selling deliberate imitations of Dyson's original vacuum cleaner parts. Dyson was seeking to prevent the sale of spare parts made by Qualtex to fit and match Dyson vacuum cleaners. The Qualtex parts in question were intended to resemble closely the Dyson spares, not least as they were visible in the normal use of the vacuum cleaners. The Chinese manufacturer that produced certain parts for Qualtex was found to have copied the visual design of some of Dyson's spare parts. Following the victory, £100,000 was donated to the Royal College of Art to help young designers protect their designs. ### Samsung In August 2013, Dyson sued [Samsung Electronics](/wiki/Samsung_Electronics) over claims Dyson's company's steering technology was infringed. The product that was targeted, Samsung's \"Motion Sync\", allegedly infringed the design of a steering mechanism for cylinder cleaners, patented by Dyson in 2009. It describes a way to allow a vacuum cleaner to spin quickly from one direction to another on the spot, and to follow the user's path rather than just being dragged behind, in order to prevent the vacuum getting snagged on corners. But three months after it filed the lawsuit, Dyson voluntarily dropped the litigation as Samsung presented prior art, which it maintained belonged to Samsung. Samsung filed a counter suit for £6 million for compensation for hurting Samsung's corporate image. ### SharkNinja In 2014, Dyson sued [SharkNinja](/wiki/SharkNinja) for patent infringement of the cyclone vacuum technology, but after four years US courts ruled the patents had not been infringed. Also in 2014, Dyson and SharkNinja sued each other over advertising claims regarding the performance of their products; in 2016, just before a trial was to begin, both sides withdrew their suits and paid their own legal costs. In 2023, Dyson sued SharkNinja over patent infringement related to a [hair styler](/wiki/Hair_iron). In the lawsuit, Dyson is seeking an [injunction](/wiki/Injunction) to block sales of \"all air stylers and their attachments within the Shark FlexStyle range\". ### Vax In 2010, Dyson launched legal action against the manufacturer [Vax](/wiki/Vax_(brand)), claiming the design of its Mach Zen vacuum cleaner is an infringement of the registered design of its first \"bagless\" Dyson cylinder vacuum DC02, which dates back to 1994. Dyson also claimed the Chinese-owned rival had \"flagrantly copied\" Dyson's iconic design. However, the court backed an earlier decision which rejected Dyson's claims, as the two designs did not produce \"the same overall impression\" on the informed user. The courts held that the two cleaners were \"different designs\", the Dyson cleaner being \"smooth, curving and elegant\", the Vax cleaner being \"rugged, angular and industrial\". ## Controversies This section needs to be **updated**. Please help update this article to reflect recent events or newly available information. *(June 2017)*The **neutrality of this section is disputed**. Relevant discussion may be found on the talk page. Please do not remove this message until conditions to do so are met. *(March 2022)* *(Learn how and when to remove this message)* ### Criticisms regarding foreign students In March 2011, James Dyson reportedly said in an interview for *[The Sunday Times](/wiki/The_Sunday_Times)* that British universities were allowing Chinese nationals to study engineering and spy on the departments where they were working, enabling them to take technology back to China after completing their studies. In the interview he was quoted as saying that \"Britain is very proud about the number of foreign students we educate at our universities, but actually all we are doing is educating our competitors. [...] I've seen frightening examples. Bugs are even left in computers so that the information continues to be transmitted after the researchers have returned home.\" [David Willetts](/wiki/David_Willetts), the government minister responsible for British universities, said he would thoroughly investigate the statement provided by James Dyson. He has also criticised the Chinese authorities for failing to act on patent infringements. ### Lobbying on copyright issues with China In December 2011, *[The Independent](/wiki/The_Independent)* reported that the [Bell Pottinger](/wiki/Bell_Pottinger) executive [Tim Collins](/wiki/Tim_Collins_(politician)) had been filmed by the [Bureau of Investigative Journalism](/wiki/Bureau_of_Investigative_Journalism) saying that [David Cameron](/wiki/David_Cameron) had raised a copyright issue with Chinese premier [Wen Jiabao](/wiki/Wen_Jiabao) on behalf of Dyson Limited \"because we asked him to\". ### Suit alleging industrial espionage on motor technology In 2012, Yong Pang, an engineer specialist in electric motors, was accused of stealing Dyson's digital motor technology which was a part of future product development projects. The motors, in development over 15 years, incorporated microchip \"digital impulse technology\" to spin at 104,000 rpm in order to draw high volumes of air through the appliance, and were not licensed to any other companies. Yong and his wife, Yali Li, allegedly set up a front company \"ACE Electrical Machine Design\" to receive payments of £11,650 from Bosch while Pang was working for Dyson. Dyson claimed that trade secrets were passed to Bosch's Chinese motor manufacturer.[*needs update*] ### Siemens and Bosch energy requirements allegations In 2015, Dyson charged that [Siemens](/wiki/Siemens) and [Bosch](/wiki/BSH_Bosch_und_Siemens_Hausger%C3%A4te_GmbH) vacuums were using a sensor that sent signals to its motor to increase its power while the machine sucked up dust remnants, making them appear more competent during [European Union (EU) efficiency tests](/wiki/European_Union_energy_label). Because tests are conducted in dust-free labs, Dyson said that this gave an unfair reading, because in a real home environment the machines used much more power. Dyson said both brands have \"capitalized on loopholes\" found within the EU regulations to be granted an AAAA energy consumption rating, when actual domestic use showed they performed similarly to an \"E\" or \"F\" rating. Dyson issued proceedings against Bosch in Netherlands and France, and against Siemens in Germany and Belgium. However, [BSH](/wiki/BSH_Bosch_and_Siemens_Home_Appliances)'s Hausgeräte, which makes household appliances under the Bosch and Siemens brands explained that many of its machines contain \"intelligent sensor technology\" to avoid loss of suction, which control the vacuum cleaner motor automatically. After weeks of court proceedings, Dyson lost the court battle against Bosch; the courts in the Netherlands decided that Dyson accusations were baseless. ### EU efficiency ratings for vacuum cleaners The [European Commission](/wiki/European_Commission) requires vacuum cleaners to carry energy efficiency ratings to inform consumers. The 2014 regulations required tests to be done with an empty dust bag, presumably to measure the efficiency of the fan and air passages. Dyson challenged the regulation on grounds that the efficiency of the machines made by their German competitors declines significantly as the bag surface becomes coated with fine dust, while the bagless Dyson machines maintain their efficiency until the collection box is full, and thus the overall efficiency of a bag vacuum cleaner is less. Dyson's legal challenge was rejected in 2015, but upheld by the Luxembourg-based General Court in 2018. It then sued for lost sales and extra R&D costs resulting from four years of unfair regulation. The suit was dismissed by the High Court of Justice in 2024; Dyson called the ruling \"perverse.\" - Official website - Inside the collapse of Dyson's electric car dream – Chris Stokel-Walker, 14 October 2019, *Wired* Portals: - United Kingdom - Singapore - Companies - Technology\n",
  "language": "en",
  "processed_at": "2026-01-12T10:09:04.345296",
  "title": "Dyson (company)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Dyson_(company)"
}