{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:09:02.338225"
  },
  "content": "* *This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"DyStar\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(March 2010)* *(Learn how and when to remove this message)*Some of this article's listed sources **may not be reliable**. Please help improve this article by looking for better, more reliable sources. Unreliable citations may be challenged and removed. *(March 2010)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* **DyStar** is a provider of products and services for the [textile](/wiki/Textile_manufacturing), [leather](/wiki/Leather_production_processes), paper, plastic and other chemical industries. The company combines the textile [dye](/wiki/Dye) businesses of the former dye producers [Bayer](/wiki/Bayer), [Hoechst](/wiki/Hoechst_AG), [BASF](/wiki/BASF), [ICI](/wiki/Imperial_Chemical_Industries)/[Zeneca](/wiki/Zeneca), Mitsubishi and [Mitsui](/wiki/Mitsui) with the auxiliary activities of Boehme and Rotta. DyStar has about 2,000 employees in more than 50 countries and runs 14 production facilities in 12 countries. Worldwide sales amounted to US$1.000 million in 2014.[*citation needed*] ## History DyStar was founded in 1995 as a [joint venture](/wiki/Joint_venture) from [Bayer AG](/wiki/Bayer_AG) and [Hoechst AG](/wiki/Hoechst_AG). In 2000 the textile dyes business from [BASF](/wiki/BASF) was integrated. In 2004 [Platinum Equity](/wiki/Platinum_Equity) acquired DyStar. In February 2010 DyStar Group was acquired by Kiri Dyes and Chemicals (KDCL), along with its subsidiaries with the support of its joint venture partner Longsheng Group, China. Currently, Senda International Capital Limited, a wholly owned subsidiary of Longsheng, is a majority shareholder of DyStar Group. With acquisitions such as Rotta, Boehme Group, Lenmar Chemicals, Color Solutions International and TexanLab DyStar has been able to diversify and grow consistently. DyStar completed the acquisition of specialty chemical businesses from Emerald Performance Materials in 2016 to expand into the food & beverages and personal care sectors. In February 2019, DyStar opened a new testing facility in [Dhaka, Bangladesh](/wiki/Dhaka). In April 2023, DyStar closed a 125 years old indigo dye plant in [Ludwigshafen, Germany](/wiki/Ludwigshafen,_Germany). ## Sites The company has sites or subsidiaries in all major textile markets and agencies in around 50 countries. DyStar has 14 production sites in 12 countries.[*citation needed*] The company has had rapid growth in China and hundreds of employees based there. ## Products Core products of the company are dyes, auxiliaries and services for the [textile](/wiki/Textile) and leather processing industries. Furthermore, the company provides toll manufacturing services[*clarification needed*] for various industries. ## Energy efficiency In 2014, the company has registered a 21.5 per cent decrease in its energy consumption as compared to its consumption levels in 2010. The achievement means that the company has been successful in meeting the target of reducing its energy consumption by one-fifth five years ahead of the targeted time. The company is aiming to achieve its target of reducing its production footprint by 30 per cent — against a 2011 base level — for every ton of production. This article related to a [manufacturing](/wiki/Manufacturing) company is a stub. You can help Wikipedia by expanding it. - v - t - e This [Singaporean corporation or company](/wiki/List_of_companies_of_Singapore) article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T10:09:02.337726",
  "title": "DyStar",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/DyStar"
}