{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:09:09.800293"
  },
  "content": "Singaporean politician and lawyer (1920–2001) **Edmund William Barker** [DUNU](/wiki/Darjah_Utama_Nila_Utama) [SPMJ](/wiki/Order_of_the_Crown_of_Johor) (1 December 1920 – 12 April 2001), often known as **E. W. Barker** or **Eddie Barker**, was a Singaporean statesman and lawyer best known for authoring the [Proclamation of Singapore](/wiki/Proclamation_of_Singapore). He is widely recognised as one of the founding fathers of Singapore, having played a crucial role in the country's constitutional development and legal framework during its early years of independence. Barker was an early member of the governing [People's Action Party](/wiki/People%27s_Action_Party) (PAP), which has ruled Singapore continuously since independence. Over his political career, he held several senior posts in the [Cabinet](/wiki/Cabinet_of_Singapore) from 1964 to 1988. Most notably, he served as [Minister of Law](/wiki/Ministry_of_Law_(Singapore)#Ministers) throughout this entire period, overseeing vital legal reforms that underpinned Singapore's rapid development. He also held the positions of [Minister for National Development](/wiki/Ministry_of_National_Development_(Singapore)#Ministers) from 1965 to 1975, [Minister of Home Affairs](/wiki/Ministry_of_Home_Affairs_(Singapore)#Ministers) briefly in 1972, [Minister for the Environment](/wiki/Ministry_of_Sustainability_and_the_Environment#Ministers) between 1975 and 1979 and Minister for Science and Technology from 1977 to 1981. In addition to his ministerial roles, Barker served as [Speaker of the Legislative Assembly of Singapore](/wiki/Speaker_of_the_Parliament_of_Singapore) between 1963 and 1964, helping to guide the legislative process during a formative period. He was also [Leader of the House](/wiki/Leader_of_the_House_(Singapore)) from 1968 to 1985, responsible for organising government business in Parliament. Throughout his entire political career, Barker represented the constituency of [Tanglin](/wiki/Tanglin_Single_Member_Constituency). ## Early life and education Barker was born in [Singapore](/wiki/Singapore_in_the_Straits_Settlements) on 1 December 1920, when it was part of the [Straits Settlements](/wiki/Straits_Settlements), into a [Eurasian](/wiki/Eurasians_in_Singapore) family. He was the son of Clarence Barker and Dorothy Evaline Paterson. Barker's ancestry was diverse, including Portuguese, [German](/wiki/Germans), Indonesian, [Japanese](/wiki/Japanese_people), [Scottish](/wiki/Scottish_people) and Irish descent. He was the third of five children. His great-great-grandfather, Thomas Owen Crane (1799–1869), was an [Irishman](/wiki/Irishman) and among the first Europeans to settle in Singapore. Barker’s great-great-great-grandfather was Sir (Dr) Jose D Almeida (1784–1850), a [Portuguese](/wiki/Portuguese_people) doctor and prominent businessman in early Singapore. Barker received his early education at [Serangoon English School](/wiki/Serangoon_Secondary_School) and [Raffles Institution](/wiki/Raffles_Institution) before enrolling at Raffles College (now the [National University of Singapore](/wiki/National_University_of_Singapore)) in 1940. During his school and university years, he was an accomplished athlete, representing Raffles College in cricket, soccer, rugby, athletics and hockey. Notably, Barker was selected for the national [Field hockey](/wiki/Field_hockey) team while still a schoolboy. He was also known to play the guitar. During [World War II](/wiki/World_War_II), Barker served in a medical health unit in [Thailand](/wiki/Thailand) tasked with caring for [Allied](/wiki/Allies_of_World_War_II) [POWs](/wiki/Prisoner_of_war) involved in the construction of the [Death Railway](/wiki/Death_Railway). Following the war, he was awarded the [Queen's Scholarship](/wiki/Queen%27s_Scholar_(British_Malaya_and_Singapore)) in 1946 to pursue legal studies at the [University of Cambridge](/wiki/University_of_Cambridge) in the [United Kingdom](/wiki/United_Kingdom). He read law at [St Catharine’s College](/wiki/St_Catharine%27s_College,_Cambridge), graduating with honours in 1951. Barker was subsequently [called to the bar](/wiki/Call_to_the_bar) at the [Inner Temple](/wiki/Inner_Temple) in [London](/wiki/London) before returning to Singapore to practise law from 1952 to 1964. ## Career Barker practised law in Singapore from 1956 to 1964, working at the law firms Braddell Brothers and [Lee & Lee](/wiki/Lee_%26_Lee). He was persuaded to enter politics in 1963 by [Lee Kuan Yew](/wiki/Lee_Kuan_Yew). That year, Barker was elected as a Member of the [Legislative Assembly](/wiki/Legislative_Assembly_of_Singapore), representing the [Tanglin](/wiki/Tanglin_Single_Member_Constituency) seat. He continued to represent Tanglin in the [Parliament of Singapore](/wiki/Parliament_of_Singapore) until 1988, being re-elected six times by [uncontested walkovers](/wiki/Uncontested_walkover). Throughout his political career, Barker held several important ministerial positions. Barker also served as [Speaker](/wiki/Speaker_(politics)) of the Legislative Assembly from 1963 to 1964. In 1964, he was appointed [Minister for Law](/wiki/Ministry_of_Law_(Singapore)), a post he held until 1988. As Minister for Law, Barker was responsible for drafting the [Proclamation of Singapore](/wiki/Proclamation_of_Singapore) in 1965, which formally announced Singapore's separation from [Malaysia](/wiki/Malaysia). During his 25 years in Parliament, he also served as [Minister for National Development](/wiki/Ministry_of_National_Development_(Singapore)#Ministers) from 1965 to 1975, [Minister for Home Affairs](/wiki/Ministry_of_Home_Affairs_(Singapore)#Ministers) briefly in 1972, [Minister for the Environment](/wiki/Ministry_of_Sustainability_and_the_Environment#Ministers) between 1975 and 1979, Minister for Science and Technology from 1977 to 1981, and [Minister for Labour](/wiki/Ministry_of_Manpower_(Singapore)#Ministers) in 1983. Barker retired from politics in 1988 after a quarter century of public service. Beyond his political career, he held several prominent roles in sports and business administration. He was the first President of the [Singapore National Olympic Council](/wiki/Singapore_National_Olympic_Council) (SNOC) from 1970 to 1990 and served as President of the [South-East Asia Peninsular Games](/wiki/Southeast_Asian_Games) Federation Council in 1973. Barker also chaired the Bukit Turf Club from 1989 to 1994 and was Chairman of the [Singapore Exchange](/wiki/Singapore_Exchange) (SGX) between 1989 and 1993. ## Death and legacy Barker died on 12 April 2001 at 12:40 pm at the [National University Hospital](/wiki/National_University_Hospital) (NUH), following two months of [intensive care](/wiki/Intensive_care) after undergoing emergency colon surgery in February 2001. He was survived by his wife, Gloria Hyacinth Quintal, and their four children. He was 80. The E. W. Barker Institute of Sports (EWBIS) at [Raffles Institution](/wiki/Raffles_Institution) (RI) is named in his honour. During his time at Raffles Institution, Barker was school captain and head prefect, as well as a champion athlete in 1938, reflecting his early leadership and sporting achievements. - Lam, Peng Er & Tan, Kevin Y.L. (1999). *Lee's Lieutenants*. South Wind Production. [ISBN](/wiki/ISBN_(identifier)) 1-86448-639-2. - \"Old guard Stalwart Eddie Barker dies\", *The Straits Times*, (2001, April 13), p1 - \"The reluctant politician\", *The Straits Times*, Home, (2001, April 13), p2 - \"Breadwinner\", (1970, May 8), *The Straits Times*, p6 - Edmund Barker Singapore.zip Portals: - Politics - Biography - Singapore\n",
  "language": "en",
  "processed_at": "2026-01-12T10:09:09.799704",
  "title": "E. W. Barker",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/E._W._Barker"
}