{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:09:16.120576"
  },
  "content": "Pre-19th century records of the Southeast Asian islandPart of the Early history of Singapore[Topynymy](/wiki/Names_of_Singapore)[Sabana](/wiki/Golden_Chersonese#Settlements)**[Temasek](/wiki/Temasek)** • [Long Ya Men](/wiki/Long_Ya_Men) • [Ban Zu](/wiki/Ban_Zu)*[Malay Annals](/wiki/Malay_Annals)***[Kingdom of Singapura](/wiki/Kingdom_of_Singapura)** • [Sang Nila Utama](/wiki/Sang_Nila_Utama) • [Parameswara](/wiki/Parameswara_of_Malacca)[Badang](/wiki/Badang)[Hang Nadim](/wiki/Hang_Nadim#In_legend_and_popular_culture)**[Sack of Singapore](/wiki/Sack_of_Singapore)**[Archaeology in Singapore](/wiki/Archaeology_in_Singapore)[Singapore Stone](/wiki/Singapore_Stone)[Fort Canning Hill](/wiki/Fort_Canning_Hill) Singapore portal - v - t - e The **early history of Singapore** refers to its pre-colonial era before (/wiki/1819_Singapore_Treaty), when the [British](/wiki/British_Empire) [East India Company](/wiki/East_India_Company) (EIC) led by [Stamford Raffles](/wiki/Stamford_Raffles) established a trading settlement on the island and set in motion the [history of modern Singapore](/wiki/History_of_Singapore). Prior to 1819, the island was known by several names. An early reference may be in the 2nd century work by [Ptolemy](/wiki/Ptolemy) which identified a coastal port at the southernmost tip of the [Malay Peninsula](/wiki/Malay_Peninsula), called *Sabana*. However, historians generally attribute a 3rd-century Chinese traveller's record describing an island at the same location called *Pu Luo Chung*, a transcription of [Singapura](/wiki/Kingdom_of_Singapura)'s early [Malay](/wiki/Malay_language) name [Pulau Ujong](/wiki/Pulau_Ujong), as the first recording of its existence. Singapore was known in the 13th to 14th century as *[Temasek](/wiki/Temasek)*, with its name being changed to [Singapura](/wiki/Kingdom_of_Singapura) perhaps towards the end of 14th century by [Sang Nila Utama](/wiki/Sang_Nila_Utama), the founder of [Kingdom of Singapura](/wiki/Kingdom_of_Singapura). The island was alternately claimed during this period by the [Siamese](/wiki/Thai_people) and the [Javanese](/wiki/Javanese_people). The last ruler of *Singapura*, [Parameswara](/wiki/Parameswara_of_Malacca) fled to [Malacca](/wiki/Malacca) after an attack by either the Javanese or the Siamese, and established the state of Malacca. It was controlled by the [Malacca Sultanate](/wiki/Malacca_Sultanate) in the 15th century and the [Johor Sultanate](/wiki/Johor_Sultanate) from the 16th century, up till its founding as a British colony in the 19th century. ## Early period From primary historical texts dated before the 14th century, scholars have identified some 24 names that possibly referred to the island of Singapore. The first possible mention of early Singapore dates to 2nd century [CE](/wiki/Common_era) cartographic references in the Greco-Roman astronomer [Ptolemy](/wiki/Ptolemy)'s *[Geographia](/wiki/Geography_(Ptolemy))*. A place called *Sabana* or *Sabara* was marked on the 11th Map of Asia at the southern tip of the [Golden Khersonese](/wiki/Golden_Khersonese) (meaning the [Malay Peninsula](/wiki/Malay_Peninsula)) where Singapore may lie. It was identified as a *nominon [emporion](/wiki/Emporium_(antiquity))* or designated foreign trading port, as part of a chain of similar trading centres that linked Southeast Asia with India and the [Mediterranean](/wiki/Mediterranean). Identification of *Sabana* or *Sabara* however varies, with various authors proposing it to be in [Selangor](/wiki/Selangor) or near [Klang](/wiki/Klang_(city)), or just south of [Malacca](/wiki/Malacca), or south [Johor](/wiki/Johor), as well as Singapore island itself. No archaeological evidence from this period has yet been found in Singapore. A 3rd century Chinese written record described a locality named *Pu Luo Zhong* (蒲羅中), possibly a transcription of the [Malay](/wiki/Malay_language) *Pulau Ujong*, \"island at the end\" (of the [Malay Peninsula](/wiki/Malay_Peninsula)), i.e. [Singapore Island](/wiki/Singapore_Island). It mentions briefly a [hearsay](/wiki/Hearsay) account of cannibals with 5 or 6-inch tails living there. The extent to which *Pu Luo Zhong* can be identified with Singapore is still debated today. Another possible reference to Singapore was found in the *[Nanhai Jigui Neifa Zhuan](/wiki/A_Record_of_Buddhist_Practices_Sent_Home_from_the_Southern_Sea)* (A Record of Buddhist Practices Sent Home from the Southern Sea), travel accounts of the Buddhist monk [Yijing](/wiki/Yijing_(monk)) from the [Tang](/wiki/Tang_dynasty) dynasty. Yijing mentioned several islands located in today's Southeast Asia. One of which, called Mo-he-xin or Mo-ho-hsin (摩诃新), was argued by Brian E. Colless to be the ancient Singapore. ### Singapore Stone A large boulder measuring 3 metres in height and width, inscribed with writings, used to exist at the mouth of the [Singapore River](/wiki/Singapore_River), but was later blown up when Fort Fullerton was expanded and the river mouth widened. Only a few fragments survive, and it became known as the [Singapore Stone](/wiki/Singapore_Stone). Various dates between 10th to 13th century have been proposed for the inscriptions that is as yet undeciphered, and the script is suggested to be related to that used in Sumatran in that period. ## Temasek Early Singapore was called *Temasek*, possibly a word deriving from \"*tasik*\" (Malay for lake or sea) and taken to mean Sea-town in Malay. The [Nagarakretagama](/wiki/Nagarakretagama), a [Javanese](/wiki/Java_(island)) eulogy written in 1365, listed a settlement on the island called *Tumasik* as a vassal of the Majapahit. The name is also mentioned in the *[Malay Annals](/wiki/Malay_Annals)* thought to have been written in 1535. *Temasek* may have diplomatic relationship with Vietnam, which recorded it as *Sach Ma Tich*, as early as the 13th century. It is also recorded by the Chinese traveller [Wang Dayuan](/wiki/Wang_Dayuan) who visited the island around 1330 and described a place called *Dan Ma Xi* (單馬錫, a [transcription](/wiki/Transcription_into_Chinese_characters) of the Malay *Temasek*). The name *Dan Ma Xi* or *Temasek* is written in Chinese as 淡馬錫 in the [Mao Kun map](/wiki/Mao_Kun_map). ### Long Ya Men and Ban Zu It was recorded in 1320 that the [Mongol](/wiki/Mongol_Empire) sent a mission to obtain elephants from *[Long Ya Men](/wiki/Long_Ya_Men)* (龍牙門, *Dragon's Teeth Gate*). The people of *Longyamen* then responded in 1325 with a tribute and trade mission to China. *Long Ya Men* is believed to be the entrance to the modern-day [Keppel Harbour](/wiki/Keppel_Harbour). In his work *[Daoyi Zhilüe](/wiki/Daoyi_Zhil%C3%BCe)*, Wang Dayuan described *Long Ya Men* as the two hills of *Temasek* that looked like \"Dragon's teeth\" between which a strait runs, and wrote about the place: > The fields are barren and there is little [padi](/wiki/Paddy_field) ... In ancient times, when digging in the ground, a chief came upon a jewelled head-dress. The beginning of the year is calculated from the [first] rising of the moon, when the chief put on this head-gear and wore his [ceremonial] dress to receive the congratulations [of the people]. Nowadays this custom is still continued. The natives and Chinese dwell side by side. Most [of the natives] gather their hair into a [chignon](/wiki/Chignon_(hairstyle)), and wear short cotton [bajus](/wiki/Baju_Melayu) girded about with black cotton [sarongs](/wiki/Sarong). — Wang Dayuan, translation by [Paul Wheatley](/wiki/Paul_Wheatley_(geographer)). Wang further mentioned that [lakawood](/wiki/Lakawood) and tin was produced there and the natives traded with Chinese from [Quanzhou](/wiki/Quanzhou), but Chinese [junks](/wiki/Junks) on their way back from the Western Oceans (西洋) may be met by pirates there who attacked with two to three hundred [perahus](/wiki/Perahu) (boats). Wang described another settlement on a hill behind *Long Ya Men* called *[Ban Zu](/wiki/Ban_Zu)* (班卒, a transcription of the Malay name *pancur* meaning a \"spring\"). It is thought to be located on [Fort Canning Hill](/wiki/Fort_Canning_Hill), and a spring used to exist on the west side of the hill. In contrast to those of *Long Ya Men* who were prone to piracy, the inhabitants of *Ban Zu* were described as honest, and they wore \"their hair short, with turban of gold-brocaded satin,\" and were dressed in red cloth. Wang also reported that the Siamese attacked *Temasek* (with no specific reference of *Long Ya Men* or *Ban Zu*) a few years before he visited, but the fortified city survived the attack which lasted a month. Ruins of the settlement on the hill were still visible in the early 19th century and were described by the Resident [John Crawfurd](/wiki/John_Crawfurd). In 1928, pieces of gold ornaments dating to the mid-14th century was discovered at Fort Canning Hill. [Recent excavations](/wiki/Archaeology_in_Singapore) in [Fort Canning](/wiki/Fort_Canning) provide evidence that Singapore was a port of some importance in the 14th century and used for transactions between Malays and Chinese. Various documents suggest that following the decline of Srivijaya power, *Temasek* was alternately claimed by the Majapahit and the Siamese [Ayutthaya Kingdom](/wiki/Ayutthaya_Kingdom). ## Kingdom of Singapura Sometime in its history, the name of *Temasek* was changed to *Singapura*. The *[Sejarah Melayu](/wiki/Sejarah_Melayu)* (*Malay Annals*) contains a tale of a prince of Palembang, Sri Tri Buana (also known as [Sang Nila Utama](/wiki/Sang_Nila_Utama)), who landed on *Temasek* after surviving a storm in the 13th century. According to the tale, the prince saw a strange creature, which he was told was a [lion](/wiki/Asiatic_lion). Believing this to be an auspicious sign, he founded a settlement called Singapura, which means \"Lion City\" in [Sanskrit](/wiki/Sanskrit).: 37, 88–92 : 30–31 It is unlikely there ever were lions in Singapore, though tigers continued to roam the island until the early 20th century. However, the lion motif is common in Hindu mythology, which was dominant in the region during that period (one of the words for \"throne\" in the [Malay language](/wiki/Malay_language) is \"singgasana\", meaning \"lion's seat\" in Sanskrit), and it has been speculated that the \"Singapura\" name, and the tale of the lion, were invented by court historians of the [Malacca Sultanate](/wiki/Malacca_Sultanate) to glorify Sang Nila Utama and his line of descent. A divergent account is provided by Portuguese apothecary [Tome Pires](/wiki/Tome_Pires) in his *[Suma Oriental](/wiki/Suma_Oriental)*, composed shortly after the [Portuguese conquest of Malacca](/wiki/Capture_of_Malacca_(1511)). The Javanese source cited by Pires instead suggests that *Temasek* was a Siamese vassal whose ruler, titled *Sang Aji*, was killed by [Parameswara](/wiki/Parameswara_of_Malacca) from Palembang in the late 14th century. This Parameswara had fled to *Temasek* from [Palembang](/wiki/Palembang) after being deposed by the [Majapahit Empire](/wiki/Majapahit_Empire), and violently usurped the Sang Aji eight days after being welcomed into *Temasek*, subsequently fleeing to [Muar](/wiki/Muar_(town)), then [Malacca](/wiki/Malacca) to escape retribution from the Siamese. Not withstanding the *Sejarah Melayu* legend, the \"Singapura\" name possibly dates to this period. Some argued that Singapura was named after the \"lion throne\" Parameswara established in Palembang as a challenge to the Majapahit empire, and for which he was expelled from Palembang. Parameswara held the island of Singapore for a number of years, until further attacks from either the [Majapahit](/wiki/Majapahit_Empire) or the [Ayutthaya kingdom](/wiki/Ayutthaya_kingdom) in [Siam](/wiki/Siam) forced him to move on to [Melaka](/wiki/Melaka) where he founded the [Sultanate of Malacca](/wiki/Sultanate_of_Malacca). While there are parallels between the mythical Sang Nila Utama and the historical Parameswara, they are regarded as distinct. ## Early modern history ### Malacca Sultanate Archaeological evidence suggests that the main settlement on Fort Canning was abandoned around this time, although a small trading settlement continued in Singapore for some time afterwards. Singapore became part of the Malacca Sultanate, and it was said to be the [fiefdom](/wiki/Fiefdom) of the legendary [laksamana](/wiki/Laksamana) (or admiral) [Hang Tuah](/wiki/Hang_Tuah). However, by the time the Portuguese arrived in the early 16th century, the Singapura that existed before Malacca was founded had already become \"great ruins\" according to the conqueror of Malacca [Afonso de Albuquerque](/wiki/Afonso_de_Albuquerque). ### Johor Sultanate After Albuquerque [captured Malacca in 1511](/wiki/Capture_of_Malacca_(1511)) for the [Portuguese colonial empire](/wiki/Portuguese_colonial_empire), its [laksamana](/wiki/Laksamana) fled to Singapore. In the 16th and early 17th century, it briefly regained some significance as a trading centre of the Malacca Sultanate's successor state in Johor whose Sultan kept a *[shahbandar](/wiki/Shahbandar)* (harbourmaster) at [Kallang](/wiki/Kallang). In 1603, the Johor Malays formed an alliance with the Dutch and captured a Portuguese ship, the *[Santa Catarina](/wiki/Santa_Catarina_(ship))* off the east coast of Singapore; the looted porcelain came to be known as *[Kraak ware](/wiki/Kraak_ware)*, and the arbitration over the legality of the Dutch attack included [Hugo Grotius](/wiki/Hugo_Grotius)' treatise, the *[Mare Liberum](/wiki/Mare_Liberum)*, widely considered to be the progenitor of modern [maritime law](/wiki/Maritime_law). The Portuguese destroyed the outpost in Singapore in 1613, but shortly afterwards in the early 1620s, it was suggested that forts be built in the [Singapore Straits](/wiki/Singapore_Strait) to counter the rising power of the Dutch. Visitors to the area in the 17th century mentioned that it was inhabited by the [Seletes](/wiki/Orang_Laut) who lived on water under the rule of Johor, but Singapore had largely sank into obscurity apart from a mention that [Singapore River](/wiki/Singapore_River) was the location of a naval battle between Johor and [Siak](/wiki/Sultanate_of_Siak_Sri_Indrapura) in 1767. ## Colonial period [British East India Company](/wiki/British_East_India_Company) employee [Sir Stamford Raffles](/wiki/Sir_Stamford_Raffles), former [Governor of the Dutch East Indies](/wiki/List_of_governors_of_the_Dutch_East_Indies) during its British occupation and subsequent [Lieutenant-Governor of Bencoolen](/wiki/Governors_of_Bencoolen), established a British trading post on the island along with [William Farquhar](/wiki/William_Farquhar). This was spurred by the perceived need to establish a competitive port following the retrocession of the [Dutch colonial empire](/wiki/Dutch_colonial_empire) in the East Indies to the [Kingdom of Holland](/wiki/Kingdom_of_Holland) after the [Napoleonic Wars](/wiki/Napoleonic_Wars) had ended, which would have left the British with their unprofitable settlements of [Penang](/wiki/Penang#Colonial_Penang) and [Bencoolen](/wiki/British_Bencoolen). In his time as Governor of the Dutch East Indies, Raffles had compiled *[The History of Java](/wiki/The_History_of_Java)* and had [John Leyden](/wiki/John_Leyden) translate the *Sejarah Melayu*, which he cites as an inspiration to claim Singapore in its introduction. This [1819 Singapore Treaty](/wiki/1819_Singapore_Treaty), signed by himself, [Temenggong Abdul Rahman](/wiki/Temenggong_Abdul_Rahman), and Prince [Hussein Long](/wiki/Hussein_Shah_of_Johor) whom he declared to be the rightful [Sultan of Johor](/wiki/Sultan_of_Johor), led to [its founding as a British colony](/wiki/Founding_years_of_modern_Singapore) under direct rule from the British East India Company following the confirmation of its status as British colony (along with the founding of [British Malaya](/wiki/British_Malaya) as a contiguous polity) by the [Anglo-Dutch Treaty of 1824](/wiki/Anglo-Dutch_Treaty_of_1824). This event has generally been understood to mark the founding of colonial [Singapore](/wiki/Singapore), and the beginning of its modern history.\n",
  "language": "en",
  "processed_at": "2026-01-12T10:09:16.120165",
  "title": "Early history of Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Early_history_of_Singapore"
}