{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:09:20.477408"
  },
  "content": "British joint-stock company (1600–1858) The **East India Company** (**EIC**)[a] was an [English](/wiki/Kingdom_of_England), and later [British](/wiki/British_Empire), [joint-stock company](/wiki/Joint-stock_company) that was founded in 1600 and dissolved in 1874. It was formed to [trade in the Indian Ocean region](/wiki/Indian_Ocean_trade), initially with the [East Indies](/wiki/East_Indies) (which included the [Indian subcontinent](/wiki/Indian_subcontinent) and Southeast Asia), and later with East Asia. The company gained [control of large parts of the Indian subcontinent](/wiki/Company_rule_in_India) and [Hong Kong](/wiki/British_Hong_Kong). At its peak, the company was the largest corporation in the world by various measures and had its own armed forces in the form of the company's three [presidency armies](/wiki/Presidency_armies), totalling about 260,000 soldiers, twice the size of the [British Army](/wiki/British_Army) at certain times. Originally [chartered](/wiki/Chartered_company) as the \"Governor and Company of Merchants of London Trading into the East-Indies,\" the company rose to account for half of the world's trade during the mid-1700s and early 1800s, particularly in basic commodities including cotton, silk, [indigo dye](/wiki/Indigo_dye), sugar, salt, [spices](/wiki/Spices), [saltpetre](/wiki/Potassium_nitrate), tea, [gemstones](/wiki/Gemstone), and later [opium](/wiki/Opium). The company also initiated the beginnings of the [British Raj](/wiki/British_Raj) in the Indian subcontinent. The company eventually came to rule large areas of the Indian subcontinent, exercising [military](/wiki/Presidency_armies) power and assuming administrative functions. Company-ruled areas in the region gradually expanded after the [Battle of Plassey](/wiki/Battle_of_Plassey) in 1757 and by 1858 most of modern India, Pakistan and Bangladesh was either ruled by the company or [princely states](/wiki/Princely_state) closely tied to the company by treaties. Following the [Sepoy Rebellion of 1857](/wiki/Sepoy_Rebellion_of_1857), the [Government of India Act 1858](/wiki/Government_of_India_Act_1858) led to the [British Crown](/wiki/The_Crown) assuming direct control of present-day [Bangladesh](/wiki/Bangladesh), [India](/wiki/India), [Pakistan](/wiki/Pakistan), and [Myanmar](/wiki/Myanmar) in the form of the new [British Indian Empire](/wiki/British_Indian_Empire). The company subsequently experienced recurring problems with its finances, despite frequent government intervention. The company was dissolved in 1874 under the terms of the [East India Stock Dividend Redemption Act](/wiki/East_India_Stock_Dividend_Redemption_Act_1873) enacted one year earlier, as the Government of India Act had by then rendered it vestigial, powerless, and obsolete. The official government machinery of the British Empire had assumed its governmental functions and absorbed its armies. ## History ### Origins [Colonial India](/wiki/Colonial_India)Map of colonial *India*, distributed by the [British Information Services](/wiki/British_Information_Services) (1942)[Austrian India](/wiki/Austrian_India)1778–1785[Swedish India](/wiki/Swedish_East_India_Company)1733–1733[Dutch India](/wiki/Dutch_India)1605–1825[Danish India](/wiki/Danish_India)1620–1869[French India](/wiki/French_India)1668–1954[Portuguese India](/wiki/Portuguese_India) (1505–1961)[Casa da Índia](/wiki/Casa_da_%C3%8Dndia)1434–1833[Portuguese East India Company](/wiki/Portuguese_East_India_Company)1628–1633[British India](/wiki/Presidencies_and_provinces_of_British_India) (1600–1947)EIC in India1600–1757[Company rule in India](/wiki/Company_rule_in_India)1757–1858[British rule in Portuguese India](/wiki/British_rule_in_Portuguese_India)1797–1813[British Raj in India](/wiki/British_Raj)1858–1947[British rule in Burma](/wiki/British_rule_in_Burma)1824–1948[Princely states](/wiki/Princely_state)1721–1949[Partition of India](/wiki/Partition_of_India)1947 - v - t - e In 1577, [Francis Drake](/wiki/Francis_Drake) set out on [an expedition](/wiki/Francis_Drake%27s_circumnavigation) from England to plunder Spanish settlements in South America in search of gold and silver. Sailing in the *[Golden Hind](/wiki/Golden_Hind)* he achieved this, and then sailed across the Pacific Ocean in 1579, known then only to the Spanish and Portuguese. Drake eventually sailed into the [East Indies](/wiki/East_Indies) and came across the [Moluccas](/wiki/Maluku_Islands), also known as the Spice Islands, and met [Sultan Babullah](/wiki/Babullah_of_Ternate). In exchange for linen, gold, and silver, the English obtained a large haul of exotic spices, including cloves and nutmeg. Drake returned to England in 1580 and became a hero; his circumnavigation raised an enormous amount of money for England's coffers, and investors received a return of some 5,000 percent. Thus started an important element in the eastern design during the late sixteenth century. Soon after the [Spanish Armada](/wiki/Spanish_Armada)'s defeat in 1588, the captured Spanish and Portuguese ships and cargoes enabled English voyagers to travel the globe in search of riches. London merchants presented a petition to [Elizabeth I](/wiki/Elizabeth_I) for permission to sail to the Indian Ocean. The aim was to deliver a decisive blow to the Spanish and Portuguese monopoly of far-eastern trade. Elizabeth granted her permission and in 1591, [James Lancaster](/wiki/James_Lancaster) in the [*Bonaventure*](/wiki/English_ship_Bonaventure_(1567)) with two other ships, financed by the [Levant Company](/wiki/Levant_Company), sailed from England around the [Cape of Good Hope](/wiki/Cape_of_Good_Hope) to the [Arabian Sea](/wiki/Arabian_Sea), becoming the first English expedition to reach India that way.: 5 Having sailed around [Cape Comorin](/wiki/Cape_Comorin) to the [Malay Peninsula](/wiki/Malay_Peninsula), they preyed on Spanish and Portuguese ships there before returning to England in 1594. The biggest prize that galvanised English trade was the seizure of a large Portuguese [carrack](/wiki/Carrack), the *[Madre de Deus](/wiki/Madre_de_Deus)*, by [Walter Raleigh](/wiki/Walter_Raleigh) and the [Earl of Cumberland](/wiki/George_Clifford,_3rd_Earl_of_Cumberland) at the [Battle of Flores](/wiki/Battle_of_Flores_(1592)) on 13 August 1592. When she was brought in to [Dartmouth](/wiki/Dartmouth,_Devon) she was the largest vessel ever seen in England and she carried chests of jewels, pearls, gold, silver coins, [ambergris](/wiki/Ambergris), cloth, tapestries, pepper, cloves, cinnamon, nutmeg, [benjamin](/wiki/Benzoin_(resin)) (a highly aromatic balsamic resin used for perfumes and medicines), red dye, [cochineal](/wiki/Cochineal) and ebony. Equally valuable was the ship's [rutter](/wiki/Rutter_(nautical)) (mariner's handbook) containing vital information on the [China](/wiki/Old_China_Trade), India, and Japan trade routes. In 1596, three more English ships sailed east but all were lost at sea. A year later however saw the arrival of [Ralph Fitch](/wiki/Ralph_Fitch), an adventurer merchant who, with his companions, had made a remarkable nine year overland journey to [Mesopotamia](/wiki/Mesopotamia), the [Persian Gulf](/wiki/Persian_Gulf), the Indian Ocean, India and Southeast Asia. Fitch was consulted on Indian affairs and gave even more valuable information to Lancaster. ### Formation In 1599, a group of prominent merchants and explorers met to discuss a potential East Indies venture under a [royal charter](/wiki/Royal_charter).: 1–2 Besides Fitch: 5 the group included [Stephen Soame](/wiki/Stephen_Soame), then [Lord Mayor of London](/wiki/Lord_Mayor_of_London); [Thomas Smythe](/wiki/Thomas_Smythe), a powerful London politician and administrator; [Richard Hakluyt](/wiki/Richard_Hakluyt), writer and proponent of [English colonisation of the Americas](/wiki/British_colonization_of_the_Americas); and several other sea-farers who had served with Drake and Raleigh.: 1–2 On 22 September, the group stated their intention \"to venture in the pretended voyage to the East Indies (the which it may please the Lord to prosper)\" and to themselves invest £30,133 (over £4,000,000 in today's money). Two days later, the \"Adventurers\" reconvened and resolved to apply to the Queen for support of the project. Although their first attempt had not been completely successful, they sought the Queen's unofficial approval to continue. They bought ships for the venture and increased their investment to £68,373.[*citation needed*] They convened again a year later, on 31 December 1600, and this time they succeeded; the Queen responded favourably to a petition by [George, Earl of Cumberland](/wiki/George_Clifford,_3rd_Earl_of_Cumberland) and 218 others, including [James Lancaster](/wiki/James_Lancaster), [Sir John Harte](/wiki/John_Harte_(mayor)), [Sir John Spencer](/wiki/John_Spencer_(Lord_Mayor_of_London)) (both of whom had been [Lord Mayor of London](/wiki/Lord_Mayor_of_London)), the adventurer [Edward Michelborne](/wiki/Edward_Michelborne), the nobleman [William Cavendish](/wiki/William_Cavendish,_1st_Earl_of_Devonshire) and other [aldermen](/wiki/Aldermen) and citizens. She granted her charter to their corporation named **Governor and Company of Merchants of London trading into the East Indies**. For a period of fifteen years, the charter awarded the company a monopoly on English trade with all countries east of the Cape of Good Hope and west of the [Straits of Magellan](/wiki/Straits_of_Magellan). Any traders there without a licence from the company were liable to forfeiture of their ships and cargo (half of which would go to the Crown and half to the company), as well as imprisonment at the \"royal pleasure\". The charter named [Thomas Smythe](/wiki/Thomas_Smythe) as the first governor: 3 of the company, and 24 [directors](/wiki/British_East_India_Company_directors) (including James Lancaster): 4 or \"committees\", who made up a Court of Directors. They, in turn, reported to a Court of Proprietors, who appointed them. Ten committees reported to the Court of Directors. By tradition, business was initially transacted at the Nags Head Inn, opposite [St Botolph's](/wiki/St_Botolph-without-Bishopsgate) church in [Bishopsgate](/wiki/Bishopsgate), before moving to East India House on [Leadenhall Street](/wiki/Leadenhall_Street). ### Early voyages to the East Indies [Sir James Lancaster](/wiki/Sir_James_Lancaster) commanded the first East India Company voyage in 1601 aboard [*Red Dragon*](/wiki/Red_Dragon_(ship)). The following year, whilst sailing in the [Malacca Straits](/wiki/Malacca_Strait), Lancaster took the rich 1,200 ton Portuguese carrack *Sao Thome* carrying pepper and spices. The booty enabled the voyagers to set up two \"[factories](/wiki/Factory_(trading_post))\" (trading posts) – one at [Bantam](/wiki/Bantam_(city)) on [Java](/wiki/Java) and another in the [Moluccas](/wiki/Molucca) (Spice Islands) before leaving. On return to England in 1603, they learned of Elizabeth's death, but Lancaster was knighted by the new king, [James I](/wiki/James_VI_and_I), on account of the voyage's success. By this time, the [war with Spain](/wiki/Anglo-Spanish_War_(1585%E2%80%931604)) had ended but the company had profitably breached the Spanish-Portuguese duopoly; new horizons opened for the English. In March 1604, Sir [Henry Middleton](/wiki/Henry_Middleton_(captain)) commanded the company's [second voyage](/wiki/Second_voyage_to_Asia). General [William Keeling](/wiki/William_Keeling), a captain during the second voyage, led the third voyage aboard *Red Dragon* from 1607 to 1610 along with *Hector* under Captain [William Hawkins](/wiki/Sir_William_Hawkins) and *Consent* under Captain [David Middleton](/wiki/David_Middleton_(mariner)). Early in 1608, [Alexander Sharpeigh](/wiki/Alexander_Sharpeigh) was made captain of the company's *Ascension*, and general or commander of the fourth voyage. Thereafter two ships, *Ascension* and *Union* (captained by Richard Rowles), sailed from Woolwich on 14 March 1608. This expedition was lost. East India Company Initial expeditions YearVesselsTotal Invested £Bullion sent £Goods sent £Ships & Provisions £Notes16033**60,450**11,1601,14248,14016063**58,500**17,6007,28028,62016072**38,000**15,0003,40014,600Vessels lost16081**13,700**6,0001,7006,00016093**82,000**28,50021,30032,00016104**71,581**19,20010,08142,50016114**76,355**17,67510,00048,70016121**7,200**1,2506505,30016138**272,544**18,81012,4461614813,94223,0001615626,66026,0651616752,08716,506 Initially, the company struggled in the [spice trade](/wiki/Spice_trade) because of competition from the [Dutch East India Company](/wiki/Dutch_East_India_Company). This rivalry led to military skirmishes, with each company establishing fortified trading posts, fleets, and alliances with local rulers. The Dutch, better financed and supported by their government, gained the upper hand by establishing a stronghold in the spice islands (now [Indonesia](/wiki/Indonesia)), enforcing a near-monopoly through aggressive policies that eventually drove the EIC to seek trade opportunities in India instead. The English company opened a [factory](/wiki/Factory_(trading_post)) (trading post) in [Bantam](/wiki/Banten_(town)) on Java on its first voyage, and imports of [pepper](/wiki/Black_pepper) from Java remained an important part of the company's trade for twenty years. English traders frequently fought their Dutch and Portuguese counterparts in the Indian Ocean. The company achieved a major victory over the Portuguese in the [Battle of Swally](/wiki/Battle_of_Swally) in 1612, at [Suvali](/wiki/Suvali) in [Surat](/wiki/Surat). The company decided to explore the feasibility of a foothold in mainland India, with official sanction from both Britain and the [Mughal Empire](/wiki/Mughal_Empire), and requested that the Crown launch a diplomatic mission. #### Foothold in India Company ships docked at [Surat](/wiki/Surat) in [Gujarat](/wiki/Gujarat_under_Mughal_Empire) in 1608. The company's first Indian factory was established in 1611 at [Masulipatnam](/wiki/Machilipatnam) on the [Andhra Coast](/wiki/Coastal_Andhra) of the [Bay of Bengal](/wiki/Bay_of_Bengal), and its second in 1615 at Surat. The high profits reported by the company after landing in India initially prompted James I to grant subsidiary licences to other trading companies in England. However, in 1609, he renewed the East India Company's charter for an indefinite period, with the proviso that its privileges would be annulled if trade was unprofitable for three consecutive years.[*citation needed*] In 1615, James I instructed Sir [Thomas Roe](/wiki/Thomas_Roe) to visit the Mughal Emperor Nur-ud-din Salim [Jahangir](/wiki/Jahangir) (r. 1605–1627) to arrange for a commercial treaty that would give the company exclusive rights to reside and establish factories in Surat and other areas. In return, the company offered to provide the Emperor with goods and rarities from the European market. This mission was highly successful, and Jahangir sent a letter to James through Sir Thomas Roe: > Upon which assurance of your royal love I have given my general command to all the kingdoms and ports of my dominions to receive all the merchants of the English nation as the subjects of my friend; that in what place soever they choose to live, they may have free liberty without any restraint; and at what port soever they shall arrive, that neither Portugal nor any other shall dare to molest their quiet; and in what city soever they shall have residence, I have commanded all my governors and captains to give them freedom answerable to their own desires; to sell, buy, and to transport into their country at their pleasure. > For confirmation of our love and friendship, I desire your Majesty to command your merchants to bring in their ships of all sorts of rarities and rich goods fit for my palace; and that you be pleased to send me your royal letters by every opportunity, that I may rejoice in your health and prosperous affairs; that our friendship may be interchanged and eternal. — Nuruddin Salim Jahangir, Letter to James I. #### Expansion in present day South Asia The company, which benefited from the imperial patronage, soon expanded its commercial trading operations. It eclipsed the Portuguese [Estado da Índia](/wiki/Estado_da_%C3%8Dndia), which had established bases in [Goa](/wiki/Goa), [Chittagong](/wiki/Chittagong), and [Bombay](/wiki/Bombay); Portugal later ceded Bombay to England as part of the [dowry](/wiki/Dowry) of [Catherine of Braganza](/wiki/Catherine_of_Braganza) on her marriage to King [Charles II](/wiki/Charles_II_of_England). The East India Company also launched a joint attack with the Dutch [United East India Company](/wiki/United_East_India_Company) (VOC) on Portuguese and Spanish ships off the coast of China that helped secure EIC ports in China, independently attacking the Portuguese in the [Persian Gulf Residencies](/wiki/Persian_Gulf_Residency) primarily for political reasons. The company established [trading posts](/wiki/Trading_post) in [Surat](/wiki/Surat) (1619) and [Madras](/wiki/Chennai) (1639). By 1647, the company had 23 factories and settlements in India, and 90 employees. Many of the major factories became some of the most populated and commercially influential cities in Bengal, including the walled forts of [Fort William](/wiki/Fort_William,_India) in Bengal, [Fort St George](/wiki/Fort_St_George) in Madras, and [Bombay Castle](/wiki/Bombay_Castle).[*citation needed*] The first century of the Company, despite its original profits coming primarily from piracy in the [Spice Islands](/wiki/Maluku_Islands) between competing European powers and their companies, saw the East India Company change focus after suffering a major setback in 1623 when their factory in [Amboyna](/wiki/Amboyna_massacre) in the Moluccas was attacked by the Dutch. This compelled the company to formally abandon their efforts in the Spice Islands, and turn their attention to Bengal where, by this time, they were making steady, if less exciting, profits. After gaining the indifferent patronage of the [Mughal Empire](/wiki/Mughal_Empire), whose cities were 'the megacities of their time' and whose wealth was unrivaled outside of Asia in the 17th century, the Company's first century in the Mughal-ruled areas was spent cultivating their relationship with the [Mughal Dynasty](/wiki/Mughal_dynasty), and conducting peaceful trade at great profit. At first it should be said the EIC was drawn into the Mughal system, acting as a kind of vassal to Mughal authority in present-day Bangladesh: it was from this position that the Company would ultimately outplay and outmanoeuvre all competing powers in the region, to eventually use that very system to hold power itself. What started as trading posts on undesirable land were developed into sprawling factory complexes with hundreds of workers sending exotic goods to England and managing protected points to export English finished goods to local merchants. The Company's initial rise in Bengal and successes generally came at the expense of competing European powers through the art of currying favours and well-placed bribes, as the Company was matched at every step with French expansion in the region (whose [equivalent company](/wiki/Louis_XIV%27s_East_India_Company) carried substantial royal support). Throughout the entire century the company only resorted to force against the Mughals once, with terrible consequences. The [Anglo-Mughal war (1686–1690)](/wiki/Anglo-Mughal_war_(1686%E2%80%931690)) was a complete defeat, ending when the EIC effectively swore fealty to the Mughals to get their factories back. The East India Company's fortunes changed for the better in 1707 when Bengal and other regions under Mughal rule fell into anarchy after the death of the Mughal Emperor [Aurangzeb](/wiki/Aurangzeb). A series of large-scale rebellions, and the collapse of the Mughal taxation system led to the effective independence of virtually all of the pre-1707 Mughal fiefs and holdings, with their capital Delhi routinely under the control of Maratha, Afghan, or usurper generals' armies. The EIC was able to take advantage of this chaos, slowly assuming direct control of the province of [Bengal](/wiki/Bengal), and fighting [numerous wars against the French](/wiki/Carnatic_wars) for control of the east coast of the subcontinent. The Company's position in the Mughal court as it fell apart made it possible to sponsor various powerful people on the subcontinent as they individually contended with others, steadily amassing more land and power in India to themselves.[*citation needed*] In the 18th Century, the primary source of the Company's profits in Bengal became taxation in conquered and controlled provinces, as the factories became fortresses and administrative hubs for networks of tax collectors that expanded into enormous cities. The Mughal Empire was the richest in the world in 1700, and the East India Company tried to strip it bare for a century thereafter. Dalrymple calls it \"the single largest transfer of wealth until the Nazis.\" What was in the 17th century the production capital of the world for textiles was forced to become a market for British-made textiles. Statues, jewels, and various other valuables were moved from the palaces of Bengal to the townhouses of the English countryside. Bengal in particular suffered the worst of Company tax farming, highlighted by the [Great Bengal famine of 1770](/wiki/Great_Bengal_famine_of_1770). The primary tool of expansion for the company was the Sepoy. The [Sepoys](/wiki/Sepoy) were locally raised with European training and equipment, who changed warfare in present-day South Asia. Mounted forces and their superior mobility had been king on the region's battlefields for a thousand years, with cannon so well integrated that the Mughals fought with cannon mounted on elephants; all were no match to line infantry with decent discipline supported with field cannon. Repeatedly, a few thousand company sepoys fought vastly larger Mughal forces numerically and came out victorious. Afghan, Mughal and Maratha factions started creating their own European-style forces, often with French equipment, as the chaos intensified and the stakes were raised. Ultimately, the company won out, generally through as much diplomacy and state-craft as through fraud and deception. The gradual rise of the East India Company within the Mughal network culminated in the [Second Anglo-Maratha War](/wiki/Second_Anglo-Maratha_War), in which the Company successfully ousted the Maratha, the Empire's official protectors, at the high water point in their rise to power, and installed a young Mughal Prince as Emperor, with the Company as the de jure protectors of the Empire from their position of direct control in Bengal. This relationship was repeatedly strained as the Company continued its expansion and exploitation, however it lasted in some form until 1858, when the last Mughal Emperor was exiled as the Company was disbanded and its assets were taken over by the British Crown. In 1634, the Mughal emperor [Shah Jahan](/wiki/Shah_Jahan) extended his hospitality to English traders to [Bengal](/wiki/Bengal), the richest region of the empire, and in 1717 customs duties were completely waived for the English in Bengal. By then, the Company's mainstay businesses were in cotton, silk, opium, [indigo dye](/wiki/Indigo_dye), [saltpetre](/wiki/Potassium_nitrate) and tea. Meanwhile, the Dutch, the Company's most aggressive competitors, had expanded their monopoly of the spice trade in the [Straits of Malacca](/wiki/Straits_of_Malacca) by ousting the Portuguese in 1640–1641. With reduced Portuguese and Spanish influence in the region, the EIC and VOC entered a period of intense competition, resulting in the [Anglo-Dutch wars](/wiki/Anglo-Dutch_wars) of the 17th and 18th centuries. The British were also interested in trans-Himalayan trade routes, as they would create access to untapped markets for British manufactured goods in Tibet and China. This economic interest was showcased by the [Anglo-Nepalese war (1814–1816).](/wiki/Anglo-Nepalese_war) #### Expansion throughout Asia Within the first two decades of the 17th century, the Dutch East India Company or *Vereenigde Oostindische Compagnie*, (VOC) was the wealthiest commercial operation in the world with 50,000 employees worldwide and a private fleet of 200 ships. It specialised in the spice trade and gave its shareholders 40% annual dividend.[*better source needed*] The British East India Company was fiercely competitive with the Dutch and French throughout the 17th and 18th centuries over spices from the [Spice Islands](/wiki/Spice_Islands). Some spices, at the time, could only be found on these islands, such as nutmeg and cloves; and they could bring profits as high as 400 per cent from one voyage. The tension was so high between the Dutch and the British East Indies Trading Companies that it escalated into at least four Anglo-Dutch wars: 1652–1654, 1665–1667, 1672–1674 and 1780–1784. Competition arose in 1635 when Charles I granted a trading licence to Sir [William Courteen](/wiki/William_Courten), which permitted the rival [Courteen association](/wiki/Courteen_association) to trade with the east at any location in which the EIC had no presence. In an act aimed at strengthening the power of the EIC, King Charles II granted the EIC (in a series of five acts around 1670) the rights to autonomous territorial acquisitions, to mint money, to command fortresses and troops and form alliances, to make war and peace, and to exercise both civil and criminal jurisdiction over the acquired areas. In 1689, a Mughal fleet commanded by [Sidi Yaqub](/wiki/Sidi_Yaqub) attacked Bombay. After a year of resistance the EIC surrendered in 1690, and the company sent envoys to [Aurangzeb](/wiki/Aurangzeb)'s camp to plead for a pardon. The company's envoys had to prostrate themselves before the emperor, pay a large indemnity, and promise better behaviour in the future. The emperor withdrew his troops, and the company subsequently re-established itself in Bombay and set up a new base in Calcutta. Indian exports of textiles to Europe (pieces per year) YearsEIC[VOC](/wiki/United_East_India_Company)France[EdI](/wiki/Estado_da_%C3%8Dndia)DenmarkTotalBengalMadrasBombaySuratEIC (total)VOC (total)1665–16697,04137,07895,558139,677126,572266,2491670–167446,510169,052294,959510,521257,918768,4391675–167966,764193,303309,480569,547127,459697,0061680–1684107,669408,032452,083967,784283,4561,251,2401685–1689169,595244,065200,766614,426316,167930,5931690–169459,39023,01189,486171,887156,891328,7781695–1699130,910107,909148,704387,523364,613752,1361700–1704197,012104,939296,027597,978310,611908,5891705–170970,59499,03834,382204,014294,886498,9001710–1714260,318150,042164,742575,102372,601947,7031715–1719251,58520,049582,108534,188435,923970,1111720–1724341,925269,653184,715796,293475,7521,272,0451725–1729558,850142,500119,962821,312399,4771,220,7891730–1734583,70786,60657,503727,816241,070968,8861735–1739580,458137,23366,981784,672315,5431,100,2151740–1744619,30998,252295,139812,700288,0501,100,7501745–1749479,593144,55360,042684,188262,261946,4491750–1754406,706169,89255,576632,174532,8651,165,0391755–1759307,776106,64655,770470,192321,251791,443 #### Slavery 1621–1834 The East India Company's archives suggest its involvement in the slave trade began in 1684, when a Captain Robert Knox was ordered to buy and transport 250 slaves from [Madagascar](/wiki/Madagascar) to [St. Helena](/wiki/St._Helena). The East India Company began using and transporting slaves in Asia and the Atlantic in the early 1620s, according to the [Encyclopædia Britannica](/wiki/Encyclop%C3%A6dia_Britannica), or in 1621, according to Richard Allen. Eventually, the company ended the trade in 1834 after numerous legal threats from the British state and the [Royal Navy](/wiki/Royal_Navy) in the form of the [West Africa Squadron](/wiki/West_Africa_Squadron), which discovered various ships had contained evidence of the illegal trade. #### Japan In 1613, during the rule of [Tokugawa Hidetada](/wiki/Tokugawa_Hidetada) of the [Tokugawa shogunate](/wiki/Tokugawa_shogunate), the British ship [*Clove*](/wiki/Clove_(ship)), under the command of Captain [John Saris](/wiki/John_Saris), was the first English ship to call on Japan. Saris was the chief factor of the EIC's trading post in Java, and with the assistance of [William Adams](/wiki/William_Adams_(sailor,_born_1564)), an English sailor who had arrived in Japan in 1600, he was able to gain permission from the ruler to establish a commercial house in [Hirado](/wiki/Hirado,_Nagasaki) on the Japanese island of [Kyushu](/wiki/Kyushu): > We give free license to the subjects of the King of Great Britaine, Sir Thomas Smythe, Governor and Company of the East Indian Merchants and Adventurers forever safely come into any of our ports of our Empire of Japan with their shippes and merchandise, without any hindrance to them or their goods, and to abide, buy, sell and barter according to their own manner with all nations, to tarry here as long as they think good, and to depart at their pleasure. Unable to obtain Japanese [raw silk](/wiki/Raw_silk) for export to China, and with their trading area reduced to Hirado and [Nagasaki](/wiki/Nagasaki) from 1616 onwards, the company closed its factory in 1623. #### Anglo-Mughal war The first of the [Anglo-Indian wars](/wiki/Anglo-Indian_wars) occurred in 1686 when the company conducted naval operations against [Shaista Khan](/wiki/Shaista_Khan), the governor of [Mughal Bengal](/wiki/Mughal_Bengal). This led to the siege of Bombay and the subsequent intervention of the Mughal Emperor, [Aurangzeb](/wiki/Aurangzeb). Subsequently, the English company was defeated and fined. **Mughal convoy piracy incident of 1695** In September 1695, Captain [Henry Every](/wiki/Henry_Every), an English pirate on board the [*Fancy*](/wiki/Fancy_(ship)), reached the Straits of [Bab-el-Mandeb](/wiki/Bab-el-Mandeb),[*citation needed*] where he teamed up with five other pirate captains to make an attack on the Indian fleet returning from the annual pilgrimage to [Mecca](/wiki/Mecca). The Mughal convoy included the treasure-laden *[Ganj-i-Sawai](/wiki/Ganj-i-Sawai)*, reported to be the greatest in the Mughal fleet and the largest ship operational in the Indian Ocean, and its escort, the *Fateh Muhammed*. They were spotted passing the straits en route to [Surat](/wiki/Surat). The pirates gave chase and caught up with the *Fateh Muhammed* some days later, and meeting little resistance, took some £40,000 of silver.: 136–137 Every continued in pursuit and managed to overhaul *Ganj-i-Sawai*, which resisted strongly before eventually [striking](/wiki/Striking_the_colours). *Ganj-i-Sawai* carried enormous wealth and, according to contemporary East India Company sources, was carrying a relative of the [Grand Mughal](/wiki/Aurangazeb), though there is no evidence to suggest that it was his daughter and her retinue. The loot from the *Ganj-i-Sawai* had a total value between £325,000 and £600,000, including 500,000 gold and silver pieces, and has become known as the richest ship ever taken by pirates. When the news arrived in England it caused an outcry. To appease Aurangzeb, the East India Company promised to pay all financial reparations, while [Parliament](/wiki/Parliament_of_the_United_Kingdom) declared the pirates *[hostis humani generis](/wiki/Hostis_humani_generis)* (\"the enemy of humanity\").[*citation needed*] In mid-1696 the government issued a £500 bounty on Every's head and offered a free pardon to any informer who disclosed his whereabouts. The first worldwide manhunt in recorded history was underway.: 144 The plunder of Aurangzeb's treasure ship had serious consequences for the English East India Company. The furious Mughal Emperor Aurangzeb ordered Sidi Yaqub and [Nawab Daud Khan](/wiki/Nawab_Daud_Khan) to attack and close four of the company's factories in India and imprison their officers, who were almost lynched by a mob of angry [Mughals](/wiki/Mughal_(tribe)), blaming them for their countryman's depredations, and threatened to put an end to all English trading in India. To appease Emperor Aurangzeb and particularly his [Grand Vizier](/wiki/Grand_Vizier) [Asad Khan](/wiki/Asad_Khan_(Mughal_noble)), Parliament exempted Every from all of the [Acts of Grace](/wiki/Acts_of_grace_(piracy)) (pardons) and amnesties it would subsequently issue to other pirates.[*disputed – discuss*] #### China The British began trading with China in 1699. This fact is recorded from the Chinese side in *[The Draft History of the Qing](/wiki/Qingshi_gao)* under the year Kangxi 37 (1698). The apparent discrepancy between the British and Chinese sources can be explained by the fact that [Chinese New Year](/wiki/Chinese_New_Year) of 1699 did not fall until 31 January, so that any treaties entered into in January would have been logged under Kangxi 37 rather than Kangxi 38. In 1715 the Company established a permanent \"factory\" in [Guangzhou](/wiki/Guangzhou) (Canton). The company started selling opium to Chinese merchants in the 1770s in exchange for goods like [porcelain](/wiki/Porcelain) and tea, causing a series of [opioid addiction](/wiki/Opioid_use_disorder) outbreaks across China in 1820. The ruling [Qing dynasty](/wiki/Qing_dynasty) outlawed the opium trade in 1796 and 1800, but British merchants continued illegally nonetheless. The Qing took measures to prevent the East India Company from selling opium, and destroyed tens of thousands of chests of opium already in the country. This series of events led to the [First Opium War](/wiki/First_Opium_War) in 1839, which involved a succession of British naval attacks along the Chinese coast over the course of several months. As part of the [Treaty of Nanjing](/wiki/Treaty_of_Nanking) in 1842, the Qing were forced to give British merchants special treatment and the right to sell opium. The Chinese also ceded territory to the British, including the island of [Hong Kong](/wiki/Hong_Kong_Island). ### Forming a complete monopoly #### Trade monopoly The prosperity that the officers of the company enjoyed allowed them to return to Britain and establish sprawling estates and businesses, and to obtain political power, such as seats in the House of Commons. Ship captains sold their appointments to successors for up to £500. As recruits aimed to return to Britain wealthy by securing Indian money, their loyalties to their homeland increased. The company developed a [lobby](/wiki/Lobbying) in the English parliament. Pressure from ambitious tradesmen and former company associates (pejoratively termed *Interlopers* by the company), who wanted to establish private trading firms in India, led to the passing of the deregulating act in 1694. This act allowed any English firm to trade with India, unless specifically prohibited by act of parliament, thereby annulling the charter that had been in force for almost 100 years. When the East India Company Act 1697 ([9 Will. 3](/wiki/9_Will._3). c. 44) was passed in 1697, a new \"parallel\" East India Company (officially titled the *English Company Trading to the East Indies*) was floated under a state-backed indemnity of £2 million. The powerful stockholders of the old company quickly subscribed a sum of £315,000 in the new concern, and dominated the new body. The two companies wrestled with each other for some time, both in England and in India, for a dominant share of the trade. It quickly became evident that, in practice, the original company faced scarcely any measurable competition. The companies merged in 1708, by a tripartite indenture involving both companies and the state, with the charter and agreement for the new *United Company of Merchants of England Trading to the East Indies* being awarded by [Sidney Godolphin, 1st Earl of Godolphin](/wiki/Sidney_Godolphin,_1st_Earl_of_Godolphin). Under this arrangement, the merged company lent a sum of £3,200,000 to the Treasury, in return for exclusive privileges for the next three years, after which the situation was to be reviewed. The amalgamated company became the *United Company of Merchants of England Trading to the East Indies*.\n",
  "language": "en",
  "processed_at": "2026-01-12T10:09:20.477011",
  "title": "East India Company",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/East_India_Company"
}