{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:09:24.432105"
  },
  "content": "Singapore government campaign The **Eat Frozen Pork** campaign in [Singapore](/wiki/Singapore) was initiated by the Singapore government in late 1984 as a means of encouraging Singaporeans to partake in frozen, as opposed to fresh, [pig meat](/wiki/Pork). Targeted at predominantly [Singaporean Chinese](/wiki/Chinese_Singaporean), the campaign tied in with the shutting down or relocation of all pig farms in the country. The government's initiative was not considerably successful, with mixed reaction from the people. In 2008 it was brought back and subsumed under the Frozen Meat Public Education Programme. ## Background Singapore once had a burgeoning [pork industry](/wiki/Agriculture_in_Singapore), which used to yield [S$](/wiki/Singapore_dollar)300,000,000 annually. By 1985, there were at least 520 pig farms situated within the island-state, to keep up with the citizens' demand for fresh pork. Most of the consumers were of Chinese ethnicity. However, Singapore's status as a land-scarce nation could not allow for the sheer number of pig farms and thus in mid-1984 the government began closing down or relocating these farms. Stricter sanitation guidelines were also imposed on the farm owners. By 1990, the number of pig farms in Singapore had already been reduced to 22, with neighbouring country [Indonesia](/wiki/Indonesia) supplying the majority of the country's fresh pork. To minimise reliance on overseas imports of fresh pork, the government decided to promote an alternative – frozen pork. ## Publicity The campaign was officially introduced in November 1984. To promote frozen pork as a healthier and cheaper alternative to fresh pork, island-wide talks on pork were organised and about one million copies of a cookbook dedicated to frozen pork dishes were distributed to the public. Notably, [Goh Keng Swee](/wiki/Goh_Keng_Swee) delivered an extensive speech on frozen pork during a parliamentary session in March 1984. Other *ad hoc* events to promote the campaign included an \"Eat Frozen Pork\" poster contest and a \"roving display\" of frozen pork. A \"frozen pork hotline\" was specially established to give consumers a platform for expressing their thoughts on the frozen meat. The line is now defunct. ## Reception The campaign received varied response. A survey conducted by *The Sunday Times* found that a majority of the citizens were not convinced that frozen pork was as delectable as fresh pork, and opined that the difference in price was negligible. A small percentage of those interviewed were indifferent. According to the Singapore Pork Merchants' Association, about seventy percent of the pork-consuming population preferred fresh to frozen pork at the time of the campaign. The Frozen Pork Hotline was deemed a failed project, with virtually nobody calling it. On the other hand, foreign pork merchants from countries including [Australia](/wiki/Australia), [New Zealand](/wiki/New_Zealand) and the [United States](/wiki/United_States) were very supportive of the campaign as it would help boost their pork sales. The campaign was considered insensitive for ignoring the [Muslim population](/wiki/Islam_in_Singapore), whose religion forbids the consumption of pork. Publications such as *Metropolis Now!*, *[Asiaweek](/wiki/Asiaweek)* and *Traveller*, have made facetious statements regarding the campaign. ## Revival The campaign to favour frozen pork over fresh pork was revivified in February 2008 and subsumed under the Frozen Meat Public Education Programme, or \"Eat Well For Less, Choose Frozen Meat\", an effort by the [Agri-Food and Veterinary Authority of Singapore](/wiki/Agri-Food_and_Veterinary_Authority_of_Singapore) (AVA) to raise awareness on frozen meats in general. Since the retooled campaign's introduction, frozen pork sales at various supermarkets have increased significantly and as of September 2013, national frozen pork consumption has risen by approximately 14,300 tonnes (14,100 long tons; 15,800 short tons). Portal: - Singapore\n",
  "language": "en",
  "processed_at": "2026-01-12T10:09:24.431435",
  "title": "Eat Frozen Pork",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Eat_Frozen_Pork"
}