{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:09:34.730496"
  },
  "content": "The **economy of Singapore** is a [highly developed](/wiki/Developed_country) [mixed](/wiki/Mixed_economy) [market economy](/wiki/Market_economy) with [dirigiste](/wiki/Dirigiste) characteristics. [Singapore](/wiki/Singapore)'s economy has been consistently ranked as the most open, competitive and pro-business in the world. It is also the [3rd least corrupt](/wiki/Corruption_in_Singapore) in the world. Singapore has low [tax-rates](/wiki/Tax_rate) and the [highest per-capita GDP](/wiki/List_of_countries_by_GDP_(PPP)_per_capita) in the world in terms of purchasing power parity (PPP). The [Asia-Pacific Economic Cooperation](/wiki/Asia-Pacific_Economic_Cooperation) (APEC) is headquartered in Singapore. Alongside the [business](/wiki/Business)-friendly reputation for global and local [privately held companies](/wiki/Privately_held_company) and [public companies](/wiki/Public_company), various national [state-owned enterprises](/wiki/State-owned_enterprise) play a substantial role in Singapore's economy. The [sovereign wealth fund](/wiki/Sovereign_wealth_fund) [Temasek Holdings](/wiki/Temasek_Holdings) holds majority stakes in several of the nation's largest bellwether companies, such as [Singapore Airlines](/wiki/Singapore_Airlines), [Singtel](/wiki/Singtel), [ST Engineering](/wiki/ST_Engineering) and [Mediacorp](/wiki/Mediacorp). With regard to [foreign direct investment](/wiki/Foreign_direct_investment) (FDI), the Singaporean economy is a major [FDI outflow-financier](/wiki/List_of_countries_by_FDI_abroad) in the world. In addition, throughout its history, Singapore has benefited from the [large inward flows of FDI](/wiki/List_of_countries_by_received_FDI) from global [investors](/wiki/Investor), [financial institutions](/wiki/Financial_institution) and [multinational corporations](/wiki/Multinational_corporation) (MNCs) due to its highly attractive investment climate along with a stable and conducive political environment throughout its modern years. ## Overview Singapore relies on an extended concept of intermediary trade to [entrepôt](/wiki/Entrep%C3%B4t) trade, by purchasing raw goods and refining them for re-export in order to sustain its high levels of [export-oriented industrialization](/wiki/Export-oriented_industrialization), such as in the [wafer-fabrication](/wiki/Wafer_fabrication) industry and in [oil refining](/wiki/Oil_refining). Singapore has a strategic port which makes it more competitive than many of its neighbours in carrying out such entrepôt activities. Singapore's [trade-to-GDP ratio](/wiki/Trade-to-GDP_ratio) is among the highest in the world, as of 2020 the ratio was 320%. The [Port of Singapore](/wiki/Port_of_Singapore) is the [second-busiest](/wiki/List_of_world%27s_busiest_ports_by_cargo_tonnage) in the world by cargo tonnage and is the busiest transshipment port in the world. Singapore is also a regional, continental and global hub for the management and operations of various [MNCs](/wiki/MNCs), because of its strategic location in close proximity with other [Asia-Pacific](/wiki/Asia-Pacific) markets, along with its advanced connectivity and [infrastructure](/wiki/Infrastructure) ([airline hub](/wiki/Airline_hub) and [maritime port](/wiki/Port) with a diverse array of destinations, Gigabit [fiber-optic communications](/wiki/Fiber-optic_communication), efficient [road transport](/wiki/Road_transport#Modern_roads) and [public transport](/wiki/Public_transport)) and its immigration policies in welcoming [global talent](/wiki/Human_capital). In addition, Singapore is a popular international [tourist destination](/wiki/Tourist_attraction#Tourist_destination) for various types of [tourism](/wiki/Tourism) ([Business tourism](/wiki/Business_tourism), [MICE (Meetings, Incentives, Conferences, Exhibitions) tourism](/wiki/MICE_(Meetings,_Incentives,_Conferences,_Exhibitions)_tourism), [Medical tourism](/wiki/Medical_tourism), [Urban tourism](/wiki/Urban_tourism)). Singapore's economy is often referred to as a \"miracle\" due to its rapid transformation from a developing country to a developed, high-income economy in a relatively short period of time. This transformation took place in the second half of the 20th century under the leadership of Prime Minister Lee Kuan Yew and his government. One of the key factors contributing to Singapore's economic miracle was its strategic location, which made it an ideal hub for international trade and commerce. The country's main exports include [electronics](/wiki/Electronics), [chemicals](/wiki/Chemical) and [services](/wiki/Service_(economics)). Singapore is the regional hub for [wealth management](/wiki/Wealth_management). Water is [scarce in Singapore](/wiki/Water_supply_and_sanitation_in_Singapore) and a sizeable percentage of water is [imported from Malaysia](/wiki/Water_conflicts_between_Malaysia_and_Singapore). [Small and medium-sized enterprises](/wiki/Small_and_medium-sized_enterprises) (SMEs) are the backbone of Singapore's economic landscape. In 2022 SMEs contributed 48% (S$284 bil) of Singapore's total enterprise nominal value-added and employed 71% of Singapore's total workforce of 3.63 million. Singapore has limited arable land, meaning that Singapore is heavily reliant on [agrotechnology](/wiki/Agrotechnology) parks (particularly vertical [hydroponic](/wiki/Hydroponics) farms) for [agricultural production](/wiki/Agriculture_in_Singapore). As a result, Singapore imports 90% of its food supply and has a wide variety of supplier countries in order to achieve its [food security](/wiki/Food_security); Singapore is ranked as among the most food secure in the world. Apart from its strategic location at the cross-roads of [trade](/wiki/Trade) between [the East](/wiki/Eastern_world) and [the West](/wiki/Western_world), Singapore has little to no [natural resources](/wiki/Natural_resource), hence [human resources](/wiki/Human_resources) is a pivotal issue for the health of the Singaporean economy; the services and manufacturing sectors of the economy are heavily reliant on a highly-[educated](/wiki/Education) and highly-[skilled](/wiki/Skill) '[Professional](/wiki/Professional), [Managerial](/wiki/Management), [Executive](/wiki/Business_executive) and [Technical](/wiki/Technician)' (PMET) [workforce](/wiki/Workforce) composed of residents and [expatriates](/wiki/Expatriate). The economy of Singapore ranked 2nd overall in the Scientific American Biotechnology ranking in 2014, with the featuring of [Biopolis](/wiki/Biopolis). To preserve its international standing and to further its economic [prosperity](/wiki/Prosperity) in the 21st century, Singapore has taken measures to promote [innovation](/wiki/Innovation), to encourage [entrepreneurship](/wiki/Entrepreneurship) and to [retrain](/wiki/Retraining) its [workforce](/wiki/Workforce). The [Ministry of Manpower](/wiki/Ministry_of_Manpower_(Singapore)) (MoM) has the prime responsibility for setting, adjusting, and enforcing [immigration](/wiki/Immigration) rules for [foreign workers](/wiki/Foreign_worker), in order to achieve the dual mandate of maximum employment of the local resident population and maximum economic growth for the nation. Approximately 29% of the total population within Singapore are non-resident foreigners, including 255,800 foreign [domestic workers](/wiki/Domestic_worker) (FDWs) who operate in Singapore. ## Economic statistics The following table shows the main economic indicators in 1980–2021 (with IMF staff estimates in 2022–2027). Inflation below 5% is in green. Table of economic data from 1980 to 2021 YearGDP (in Bil. US$PPP) GDP per capita (in US$ PPP) GDP (in Bil. US$nominal) GDP per capita (in US$ nominal) GDP growth (real) Inflation rate (in Percent) Unemployment (in Percent) Government debt (in % of GDP) 198022.99,479.412.15,005.010.1%8.5%5.8%n/a198127.810,958.814.45,672.110.8%8.2%5.9%n/a198231.611,927.315.96,000.07.1%3.9%6.3%n/a198335.613,281.018.06,717.88.6%1.0%5.6%n/a198440.114,689.919.67,160.38.8%2.6%6.1%n/a198541.115,039.418.66,788.4-0.6%0.5%4.6%n/a198642.515,563.018.86,870.81.3%-1.4%2.0%n/a198748.317,406.221.67,794.710.8%0.5%3.9%n/a198855.619,547.326.69,329.011.3%1.5%2.6%n/a198963.721,730.131.410,725.710.2%2.3%1.8%n/a199072.623,812.938.912,763.39.8%3.5%1.8%73.5%199180.025,528.045.514,502.06.7%3.4%1.8%76.4%199287.327,019.352.116,136.26.6%2.2%1.8%79.0%199399.630,059.360.618,290.111.5%2.3%1.7%71.2%1994113.033,054.673.721,552.411.1%3.1%1.7%70.7%1995123.735,087.087.824,914.97.2%1.7%1.8%69.8%1996135.336,869.696.326,232.97.5%1.4%1.7%71.3%1997149.139,283.1100.126,375.98.3%2.0%1.4%70.8%1998147.537,557.085.721,829.3-2.2%-0.3%2.5%84.6%1999158.139,943.786.321,796.65.7%0.0%2.8%85.3%2000176.343,775.896.123,852.89.0%1.3%2.7%82.3%2001178.443,104.289.821,699.7-1.1%1.0%2.7%94.5%2002188.345,080.292.522,159.83.9%-0.4%3.6%96.3%2003200.748,774.797.623,730.44.5%0.5%4.0%99.1%2004226.654,377.3115.027,608.19.9%1.7%3.4%95.7%2005250.958,815.0127.829,961.37.4%0.5%3.1%92.7%2006281.964,054.4148.633,768.49.0%1.0%2.7%86.5%2007315.768,793.8180.939,432.99.0%2.1%2.1%87.8%2008327.767,718.3193.640,008.61.9%6.6%2.2%97.9%2009330.266,212.2194.238,926.80.1%0.6%3.0%101.7%2010382.775,389.8239.847,236.714.5%2.8%2.2%98.7%2011415.080,052.4279.453,891.56.2%5.2%2.0%103.1%2012436.082,065.0295.155,547.54.4%4.6%2.0%106.7%2013448.183,001.8307.656,967.44.8%2.4%1.9%98.2%2014461.884,423.2314.957,564.83.9%1.0%2.0%97.7%2015481.486,974.7308.055,645.63.0%-0.5%1.9%102.2%2016501.589,436.6318.856,858.53.6%-0.5%2.1%106.6%2017534.995,310.3343.261,149.64.7%0.6%2.2%107.7%2018567.7100,686.1377.066,857.33.7%0.4%2.1%109.4%2019584.2102,431.4375.565,833.21.1%0.6%2.3%128.2%2020566.899,681.2345.360,727.6-4.1%-0.2%3.0%152.0%2021635.3116,486.3397.072,794.97.6%2.3%2.7%159.9%2022701.0131,425.7423.679,426.13.0%5.5%2.1%141.1%2023742.3140,280.1447.284,500.42.3%3.0%2.1%140.0%2024777.8147,117.9470.188,926.02.6%2.0%2.1%139.9%2025811.9152,667.0491.292,363.02.5%1.5%2.1%140.6%2026848.2158,689.4513.596,065.72.5%1.5%2.1%141.2%2027886.1164,987.2536.899,935.12.5%1.5%2.1%141.8% ## History ### British colonization In 1819, [Stamford Raffles](/wiki/Stamford_Raffles), at the time [Lieutenant-Governor of Bencoolen](/wiki/Lieutenant-Governor_of_Bencoolen), established a trading post in Singapore. Raffles had been searching for a new settlement that could be used as an outpost of the British Empire. He left Calcutta and set out to explore much of South-East Asia. At the time, the Dutch Empire and British Empire were close economic rivals. Colonization enabled these empires to gain control of the vast resources of militarily weaker and economically less prosperous [nations](/wiki/Nations). Raffles was looking for a new settlement that could replace Malacca as a key economic advantage over the Dutch Empire. The former had been handed over to the Dutch under the [Treaty of Vienna of 1815](/wiki/Treaty_of_Vienna_(1815)). Raffles found Singapore to be a perfect location, sitting just of the edge of the Straits of Malacca, nowadays one of the most important shipping lanes in the world. As well, the territory had key economic resources which would benefit the British. There was abundant timber and fresh water, and a natural deep water harbor which would be beneficial for the British fleet. He arrived on an island at the mouth of the Singapore River, where there was a small Malay settlement. At the time accompanied by William Farquhar, Raffles met with [Temenggong](/wiki/Temenggong) (essentially, Chief of Security, for the settlement) [Abdul Rahman](/wiki/Temenggong_Abdul_Rahman) to negotiate the right to establish a trading post on the island, under the British Empire. The island was ruled nominally from [Johar](/wiki/Johor_Sultanate) on the peninsula by [Tengku](/wiki/Tengku) (essentially, Prince) [Rahman, Sultan of Johor](/wiki/Abdul_Rahman_Muazzam_Shah_of_Johor), who was heavily influenced by the Dutch and the [Bugis](/wiki/Bugis). However, the Sultanate was weakened by factional division so that Temenggong Abdul Rahman and his officials were more loyal to Rahman's elder brother Tengku [Hussein](/wiki/Hussein_Shah_of_Johor) (or Tengku Long) who was living in exile in \"Riau\" (likely [the Riau Archipelago](/wiki/Riau_Archipelago)). With the Temenggong's help, Raffles managed to smuggle Hussein back to Singapore. He offered to recognize Hussein as the rightful Sultan of Johor and provide him with a yearly [stipend](/wiki/Stipend); in return, Hussein would grant the British the right to establish a trading post on Singapore.[*citation needed*] On 6 February 1819 Raffles succeeded in having the territory formally incorporated into the British Empire as the aforementioned trading post.[*citation needed*] Much of the settlement's rapid economic growth thereafter can be credited to its natural suitability as a seaport hub. ### Trade expansion On 17 November 1869, the [Suez Canal](/wiki/Suez_Canal) opens, connecting the [Mediterranean Sea](/wiki/Mediterranean_Sea) to the [Red Sea](/wiki/Red_Sea). This allowed for a decrease in travel time, which resulted in a rise in trade volume. The nation saw a $32 million rise just a year after its opening. Trade volume reached $105 million [Straits dollars](/wiki/Straits_dollar) in 1879, during which entrepot trade was the main source of income and trade alone accounted for more than one-third of GDP.[*citation needed*] ### Independence In the 1950s, the region saw social unrest which resulted in colonial powers deciding to relinquish some decision making. With spurs of race riots the colonial powers sought to empower and establish a formidable local government. With most of the unrest resulting from high unemployment, the local government was directed to solve this issue. The [Economic Development Board](/wiki/Economic_Development_Board) was formed to empower the Singapore government in establishing, developing, and financing industrial undertakings. In 1955, a Singapore local legislative Assembly with 25 out of 35 members elected was formed. Upon independence from Malaysia in 1965, Singapore faced a small domestic market, and high levels of unemployment and poverty. 70 percent of Singapore's households lived in badly overcrowded conditions, and a third of its people squatted in slums on the city fringes. Unemployment averaged 14 percent, GDP per capita was US$516, and half of the population was illiterate.[*citation needed*] ### Industrialisation boom and change After [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) was elected, he oversaw significant economic reforms to the country. Structural change and machinery propelled the economy during his tenure. Singapore was a small and densely populated nation, with very few natural resources and little space to grow outwards. Recognizing this, Lee identified that the key advantage that Singapore held was its human capital, and its ability to provide highly educated citizens capable of competing in global industry and trade. On 1 August 1961, the Singapore Government established the [Economic Development Board](/wiki/Economic_Development_Board) to spearhead an investment drive, and make Singapore an attractive destination for foreign investment. FDI inflows increased greatly over the following decades, and by 2001 foreign companies accounted for 75% of manufactured output and 85% of manufactured exports. Meanwhile, Singapore's savings and investment rates rose among the highest levels in the world, while household consumption and wage shares of GDP fell among the lowest. The beginning of Lee's tenure was marked with success and from 1965–1973, annual growth of real GDP was 12.7%. He directed spending to repair and improve infrastructure. This effort spurred economic productivity and put in place the foundations needed to build up basic industry. As of 2019, Singapore's infrastructure is ranked the best in terms of quality, with a score of 95.4 out of 100. The period from 1973-1979 marked a struggle for Singapore as they pivoted away from basic infrastructure spending and moved towards more sustainable economic progress. The 1973 oil crisis raised government awareness of issues such as economic concentration. It forced the government to hold new forum to discuss ways of adapting the countries economy to economic change. GDP growth during this time was slightly lower than the preceding years, at 8.5% annually. However, unemployment was virtually 0%, and most of the population had experienced great strides in productivity. The government highlighted a focus in technology and education to be the new wave of economic gain. In addition, they identified financial services as a key area in which Singapore could diversify and attract new growth. During this time, the government invested heavily in its budding financial services industry. It managed to minimize inflation and provide workers with the proper equipment and machinery to sustain growth. ### Recent history #### Growth in the service sector As a result of this investment drive, Singapore's capital stock increased 33 times by 1992, and achieved a tenfold increase in the capital-labour ratio. Living standards steadily rose, with more families moving from a lower-income status to middle-income security with increased household incomes. In 1987, Lee claimed that (based on the government's home ownership criterion) 80% of Singaporeans could now be considered to be members of the middle-class. Under Lee, Singapore had both low inflation and unemployment. However, much unlike the economic policies of Greece and the rest of Europe, Singapore followed a policy of individualising the social safety net. This led to a higher than average savings rate and a very sustainable economy in the long run. Without a burdensome welfare state or its likeliness, Singapore has developed a very self-reliant and skilled workforce well versed for a global economy. In the late 1980s, Singapore's export-driven economic model required adjustment for further development.: 79 The 1990s emergence of efficient manufacturing firms in southeast Asia challenged the nation with such a small labor force and land restrictions. Friedrich noted how it would be \"unlikely to expand beyond the current 25% share of the economy,\" when regarding manufacturing firms. Despite struggling in the manufacturing sector Singapore thrived in global finance, trading, and was an industrial hub for international trade. It positioned itself as a supplier of secondary factors, including expertise in management and industrial infrastructure, and emphasized a regionalization strategy through which it would invest in other Asian countries.: 79 Singaporean investment in China was a particularly important element of this strategy.: 79–80 To advance its regionalization strategy, Singapore began its Regional Industrial Parks Program to boost Singapore's domestic economy through profits from foreign industrial parks modeled on Singapore's [Jurong Industrial Estate](/wiki/Jurong_Industrial_Estate) and also to build diplomatic ties in the host countries.: 80 Singapore's economic strategy produced real growth averaging 8.0% from 1960 to 1999. Since the nation's independence in 1965, Singapore's GDP has amassed an average of a 9.5% increase. The economy picked up in 1999 under [Goh Chok Tong](/wiki/Goh_Chok_Tong), the Prime Minister of Singapore, after the regional financial crisis, with a growth rate of 5.4%, followed by 9.9% for 2000. However, the economic slowdown in the United States, Japan and the [European Union](/wiki/European_Union), as well as the worldwide electronics slump, had reduced the estimated economic growth in 2001 to a negative 2.0%. The economy expanded by 2.2% the following year, and by 1.1% in 2003 when Singapore was affected by the [SARS](/wiki/SARS) outbreak. Subsequently, a major turnaround occurred in 2004 allowed it to make a significant recovery of 8.3% growth in Singapore, although the actual growth fell short of the target growth for the year more than half with only 2.5%. In 2005, economic growth was 6.4%; and in 2006, 7.9%. It was apparent that Singapore would also struggle due to the [2008 financial crisis](/wiki/2008_financial_crisis) given its status as a financial services hub. Some market commentators doubted the economy's ability to cope with the effects of the crisis. In the end the economy grew in 2009 by 3.1% and in 2010, the nation saw a 15.2% growth rate. As of 8 June 2013, Singapore's unemployment rate is around 1.9% and the country's economy has a lowered growth rate, with a rate of 1.8% on a quarter-by-quarter basis—compared to 14.8% in 2010. 2015 and 2016 saw a downturn for the nation as GDP growth shrunk to just 2 percent. Despite growth diminishing, the nation has yet to post negative growth rates which are a positive sign. During the same period of diminishing economic growth, unemployment and inflation have also decreased. As of 2017 Singapore's GDP reached $323.907 billion. Singapore is expected to experience an economic slowdown in 2019, with GDP growth slowing to 1.9% from 3.1% in 2018, due to tariff hikes from the United States and China. During the initial months of the [COVID-19 pandemic](/wiki/COVID-19_pandemic), on 26 March 2020, Singapore's Ministry of Trade and Industry said it believed that the economy would contract by between 1% and 4% in 2020. This was after the economy shrank 2.2% in the first quarter of 2020 from the same quarter in 2019. On 26 May, MTI said that it was revising down its expectation for the Singapore economy in 2020 to shrink by 4% to 7%. Economists had to downgrade their numbers from previously, and some suggested that the economic recovery could take some time. In response to the economic pressure, Moody's temporarily downgraded the Singapore banking sector that year from \"stable\" outlook to a \"negative\" outlook. It was estimated by the economist Chua Hak Bin, the [Singapore circuit breaker measures](/wiki/2020%E2%80%9321_Singapore_circuit_breaker_measures) in response to the pandemic, beginning on 7 April could impact the economy to the tune of S$10 billion. With the lockdown imposed on construction workers, there were concerns that there could be delays in construction projects of up to six months. Senior Minister of State for Trade and Industry [Chee Hong Tat](/wiki/Chee_Hong_Tat) announced that some 3,800 companies had closed in April 2020, only slightly higher than the 3,700 reported on average for the same month in the past 5 years, though he warned that this would likely rise in the following months. Despite this only small increase in companies shutting down, the number of companies starting up had declined by about a third from the average April since 2015. ## State enterprise and investment The public sector is used both as an investor and as a catalyst for economic development and innovation. The government of Singapore has two sovereign wealth funds, [Temasek Holdings](/wiki/Temasek_Holdings) and [GIC Private Limited](/wiki/GIC_Private_Limited), which are used to manage the country's [reserves](/wiki/Reserves_of_the_Government_of_Singapore). Initially the state's role was oriented more toward managing industries for economic development, but in recent decades the objectives of Singapore's sovereign wealth funds have shifted to a commercial basis. Government-linked corporations play a substantial role in Singapore's domestic economy. As of November 2011, the top six Singapore-listed GLCs accounted for about 17 percent of total capitalization of the Singapore Exchange (SGX). These fully and partially state-owned enterprises operate on a commercial basis and are granted no competitive advantage over privately owned enterprises. State ownership is prominent in strategic sectors of the economy, including telecommunications, media, public transportation, defence, port, airport operations as well as banking, shipping, airline, infrastructure and real estate. As of 2014, Temasek holds S$69 billion of assets in Singapore, accounting for 7% of the total capitalization of Singapore-listed companies. In 2017, GSK shifted its Asian Headquarters to Singapore. YearTotal tradeImportsExports% Change2000$273$135$13821%2001−9.4%2002$4321.5%2003$516$237$2799.6%2004$629$293$33621.9%2005$716$333$38314%2006$810$379$43113.2%2014$983$464$51921.3% change from 2006 to 2014 All figures in billions of Singapore dollars. ## Sectors To maintain its competitive position despite rising wages, the government seeks to promote higher value-added activities in the manufacturing and services sectors. It also has opened, or is in the process of opening, the financial services, telecommunications, and power generation and retailing sectors up to foreign service providers and greater competition. The government has also attempted some measures including [wage restraint](/wiki/Incomes_policy) measures and release of unused buildings in an effort to control rising commercial rents with the view to lowering the cost of doing business in Singapore when central business district office rents tripled in 2006.[*citation needed*] ### Banking Singapore is considered a global financial hub by many leading financial analysts, economists and politicians, with Singapore banks offering world-class corporate bank account facilities. In the 2020 [Global Financial Centres Index](/wiki/Global_Financial_Centres_Index), Singapore was ranked as having the sixth most competitive financial sector in the world, and the fourth most competitive in Asia. These include multiple currencies, internet banking, telephone banking, current accounts, savings accounts, debit and credit cards, fixed term deposits and wealth management services. [DBS](/wiki/DBS_Bank), [OCBC](/wiki/OCBC_Bank) and [UOB](/wiki/United_Overseas_Bank) are the three major local banks of Singapore. In 2020, [MAS](/wiki/Monetary_Authority_of_Singapore) granted license to [digital banks](/wiki/Neobank) for the first time. GXS Bank and MariBank are the two largest digital banks in Singapore. Singapore has also attracted assets formerly held in [Swiss banks](/wiki/Swiss_banks) for several reasons, including new taxes imposed on Swiss accounts and a weakening of Swiss [bank secrecy](/wiki/Bank_secrecy). [Credit Suisse](/wiki/Credit_Suisse), the second largest Swiss bank, moved its head of international [private banking](/wiki/Private_banking) to Singapore in 2005. For this, the country has also been dubbed the \"Switzerland of Asia\". ### Biotechnology Singapore has been aggressively developing its [biotechnology](/wiki/Biotechnology) industry. Hundred of millions of dollars were invested into the sector to build up infrastructure, fund research and development and to recruit top international scientists to Singapore. Leading drug makers, such as [GlaxoSmithKline](/wiki/GlaxoSmithKline) (GSK), [Pfizer](/wiki/Pfizer) and [Merck & Co.](/wiki/Merck_%26_Co.), have set up plants in Singapore. In 2006 GSK invested another S$300 million to build another plant to produce [paediatric](/wiki/Paediatric) [vaccines](/wiki/Vaccines), its first such facility in Asia. Pharmaceuticals now account for more than 8% of the country's manufacturing production. In 2022, the biopharma industry of Singapore accounted for manufacturing output of USD 18 billion a year, a value that had tripled during two decades. ### Energy and infrastructure Singapore is the pricing centre and leading oil trading hub in Asia. The oil industry makes up 5% of Singapore's GDP, with Singapore being one of the top three export refining centres in the world. In 2007, it exported 68.1 million tonnes of oil. The oil industry has led to the promotion of the chemical industry as well as oil and gas equipment manufacturing. Singapore has 70 per cent of the world market for both jack-up rigs and for the conversion of Floating Production Storage Offloading units. It has 20 per cent of the world market for ship repair, and in 2008 the marine and offshore industry employed almost 70,000 workers. Singapore has limited potential for renewable energy mainly due to its small surface area; solar power holds the greatest potential. The government set a target of generating solar power to cover 350,000 households in 2030 that would equal to 4% of the country's electricity demand in 2020. As a financial hub, Singapore can play an important role in attracting investment in renewable energy in the entire [ASEAN](/wiki/ASEAN) region. ### Real estate The Singapore government also owns 90 per cent of the country's land, as well as housing in which 80 per cent of the population lives. In July 2022, a report by [Savills](/wiki/Savills) revealed that Singapore tied with New York City in recording the highest rental growth rate for luxury homes globally. ### Tourism Tourism plays an important role in the economy of Singapore. Singapore ranks among the most visited cities in the world. ## International trade and investment This section needs to be **updated**. Please help update this article to reflect recent events or newly available information. *(July 2013)* Singapore's total trade in 2022 amounted to $1,365.4 [billion](/wiki/1000000000_(number)) [SGD](/wiki/Singapore_dollar). In 2022, Singapore's imports were $655.4 billion [SGD](/wiki/Singapore_dollar) and exports were $710.0 billion [SGD](/wiki/Singapore_dollar). [China](/wiki/China) was Singapore's main import partner, as well as its largest export market in 2021. Singapore's major trading partners include [Malaysia](/wiki/Malaysia), the [United States](/wiki/United_States) and the [European Union](/wiki/European_Union). [China](/wiki/China) is Singapore's largest trading partner, with bilateral trade totalling roughly 175 billion Singapore dollars in 2022. Since 2009, the value of exports exceeds imports for Singapore's trade with China. In comparison, the value of imports exceeds exports for Singapore's trade with the US since 2006. Re-exports accounted for 43% of Singapore's total sales to other countries in 2000. Singapore's principal exports are electronic components, refined petroleum, gold, computers, and packaged medications. Singapore's main imports are electronic components, refined petroleum, crude petroleum, gold, and computers. Trade in Singapore has benefited from the extensive network of trade agreements Singapore has implementing. According to Healy Consultants, Singapore has free trade access to the entirety of the ASEAN network, with import duty reduced when dealing with Indonesia, Malaysia, the Philippines, Thailand, Brunei, Burma, Cambodia, Laos and Vietnam. The Singapore Economic Development Board (EDB) continues to attract investment funds on a large-scale for the country despite the city's relatively high-cost operating environment. The US leads in foreign investment, accounting for 40% of new commitments to the manufacturing sector in 2000. As of 1999, cumulative investment for manufacturing and services by American companies in Singapore reached approximately $20 billion (total assets). The bulk of US investment is in electronics manufacturing, oil refining and storage, and the chemical industry. More than 1,500 US firms operate in Singapore. Singapore's largely corruption-free government, skilled workforce, and advanced and efficient infrastructure have attracted investments from more than 3,000 [multinational corporations](/wiki/Multinational_corporation) (MNCs) from the United States, Japan, and Europe. Foreign firms are found in almost all sectors of the economy. MNCs account for more than two-thirds of manufacturing output and direct export sales, although certain services sectors remain dominated by government-linked corporations. The government also has encouraged firms to invest outside Singapore, with the country's total direct investments abroad (DIA) reaching S$1,636 billion by the end of 2024. Mainland China was the top investment destination, accounting for S$228 billion of total DIA, followed by [India](/wiki/India) (121 billion), United Kingdom (110 billion), [Netherlands](/wiki/Netherlands) (110 billion) and [Indonesia](/wiki/Indonesia) (100 billion). The rapidly growing economy of India, especially the high technology sector, is becoming an expanding source of foreign investment for Singapore. The United States strives to improve bilateral trade with Singapore and has signed the [US-Singapore Free Trade Agreement](/wiki/US-Singapore_Free_Trade_Agreement) in 2003. Singapore corporate tax is 17 per cent. Singapore is the European Union's 14th largest trading partner. Singapore-EU trade is worth more than €50 billion [euros](/wiki/Euro) a year. Singapore is also the EU's 5th largest [trade in services](/wiki/Trade_in_services) partner and the EU's 6th destination for [foreign direct investment](/wiki/Foreign_direct_investment). Over 10,000 EU companies have set up their hubs or offices in Singapore. In 2018, the EU and Singapore signed the [EUSFTA](/wiki/European_Union%E2%80%93Singapore_Free_Trade_Agreement), a [free trade agreement](/wiki/Free_trade_agreement) which aims to boost and promote [trade](/wiki/International_trade) between Singapore and the EU. The agreement includes provisions on: - Eliminating [tariffs](/wiki/Tariff) on [goods](/wiki/Goods) - Harmonizing [safety](/wiki/Safety), [testing](/wiki/Product_testing) and [labeling](/wiki/Label) standards (for [cars](/wiki/Car) and [vehicle parts](/wiki/List_of_auto_parts), [electronics](/wiki/Electronics) and [textiles](/wiki/Textile_industry)) - Preferential [market access](/wiki/Market_access) and [equal treatment](/wiki/Equal_treatment) for [services](/wiki/Service_(economics)) (for [telecommunications](/wiki/Telecommunications), [financial services](/wiki/Financial_services), [transport](/wiki/Transport), etc.) - Simplifying [customs](/wiki/Customs) procedures and improving [trade facilitation](/wiki/Trade_facilitation) - Improved protection of [intellectual property](/wiki/Intellectual_property) - Guaranteed access to [government procurement](/wiki/Government_procurement) contracts - Legally-binding commitments on [environmental protection](/wiki/Environmental_protection) and [workers' rights](/wiki/Workers%27_rights) In addition to the free trade agreement, the EU and Singapore signed an investment protection agreement which aims to encourage [investment](/wiki/Investment) between Singapore and the EU. It ensures that [governments](/wiki/Government) in the EU and Singapore [treat each other's investors equally](/wiki/National_treatment), and replaces old-style [bilateral investment treaties](/wiki/Bilateral_investment_treaty) between Singapore and individual EU countries. ### International trade agreements The following bilateral and plurilateral agreements are currently in effect. Signature and entry into force dates are as listed by the [World Trade Organization](/wiki/World_Trade_Organization). EconomyAgreementAbbreviationConcludedSignedEffectiveLegal text [Australia](/wiki/Australia)Comprehensive Strategic PartnershipCSP6 May 20162015 [New Zealand](/wiki/New_Zealand)[Agreement between New Zealand and Singapore on a Closer Economic Partnership](/wiki/Agreement_between_New_Zealand_and_Singapore_on_a_Closer_Economic_Partnership)ANZSCEP18 August 200014 November 20001 January 2001 [EFTA](/wiki/European_Free_Trade_Association)Agreement between the EFTA States and SingaporeEFTA-Singapore FTA11 April 200226 June 20021 January 2003 [Japan](/wiki/Japan)Japan–Singapore Economic Partnership AgreementJSEPAOctober 200113 January [United States](/wiki/United_States)[United States-Singapore Free Trade Agreement](/wiki/United_States-Singapore_Free_Trade_Agreement)USSFTA19 November 20026 May 20031 January 2004 [Jordan](/wiki/Jordan)Singapore Jordan Free Trade AgreementSJFTA29 April 200416 May 2004 [Brunei](/wiki/Brunei)[Trans-Pacific Strategic Economic Partnership Agreement](/wiki/Trans-Pacific_Strategic_Economic_Partnership_Agreement)Trans-Pacific SEPAugust 20051 January 2006 [Chile](/wiki/Chile)18 July 2005 [New Zealand](/wiki/New_Zealand)18 July 2005 [India](/wiki/India)[India – Singapore Comprehensive Economic Cooperation Agreement](/wiki/India%E2%80%93Singapore_Comprehensive_Economic_Cooperation_Agreement)India-Singapore CECANovember 200429 June 20051 August 2005 [South Korea](/wiki/South_Korea)Korea-Singapore Free Trade AgreementKSFTA28 November 20044 August 2005End 2005 [Peru](/wiki/Peru)Peru-Singapore Free Trade AgreementPesFTASeptember 200729 May 2008Early 2009 [Sri Lanka](/wiki/Sri_Lanka)Sri Lanka-Singapore Free Trade AgreementSri Lanka-Singapore FTA201623 January 2018Mid 2018 [European Union](/wiki/European_Union)[European Union-Singapore Free Trade Agreement](/wiki/European_Union%E2%80%93Singapore_Free_Trade_Agreement)EUSFTA201819 October 201821 November 2019 [United Kingdom](/wiki/United_Kingdom)[Singapore–United Kingdom Free Trade Agreement](/wiki/Singapore%E2%80%93United_Kingdom_Free_Trade_Agreement)SUKFTA10 December 202010 December 20201 January 2021 ## Singapore workforce In 2000, Singapore had a workforce of about 2.2 million. With limited access to natural resources, Singapore had been forced to invest in its people.[*citation needed*] The country has the largest proficiency of English language speakers in Asia, making it an attractive place for multinational corporations. Singapore has come a long way from where it once stood. In the 1970s according to Tilak Abeysinghe \"2.4 percent of the labor force were degree holders\". By 1990 the number rose to just 6.3%. In 2013 the percentage of the labor force who held degrees reached 31%. The nation's directive toward high skilled labor jobs, has promoted both growth and education to the region. The [National Trades Union Congress](/wiki/National_Trades_Union_Congress) (NTUC), the sole trade union federation, which has a symbiotic relationship with the ruling party, accounts for almost 99% of total organised labour. Government policy and pro-activity rather than labour legislation controls general labour and trade union matters.[*citation needed*] The Employment Act offers little protection to white-collar workers due to an income threshold. The Industrial Arbitration Court handles labour-management disputes that cannot be resolved informally through the Ministry of Manpower. The [Singapore Government](/wiki/Singapore_Government) has stressed the importance of co-operation between unions, management and government ([tripartism](/wiki/Tripartism)), as well as the early resolution of disputes. There has been only one strike in the past 15 years. Singapore has enjoyed virtually full employment for long periods of time. Amid an economic slump, the unemployment rate rose to 4.0% by the end of 2001, from 2.4% early in the year. Unemployment has since declined and as of 2012 the unemployment rate stands at 1.9%. While the Singapore government has taken a stance against [minimum wage](/wiki/Minimum_wage) and [unemployment benefit](/wiki/Unemployment_benefit) schemes, in 2007 the government introduced a Workfare Income Supplement (WIS) scheme to supplement wages of low-skilled workers. To support employers in hiring older Singaporean workers, Special Employment Credit (SEC) was introduced in 2011. It was first enhanced in 2012 to provide employers with support in hiring older Singaporean workers and Persons with Disabilities (PWDs). It helped the employers to cope with costs associated with the increase in Central Provident Fund (CPF) contribution rates for older workers. The 5-year SEC scheme was further extended an additional 3 years, up to 2019 to encourage employers to voluntarily re-employ older workers aged 65 and above. The Singapore Government and the NTUC have tried a range of programs to increase lagging productivity and boost the labour force participation rates of women and older workers. However, labour shortages persist in the service sector and in many low-skilled positions in the construction and electronics industries. Foreign workers help make up this shortfall. In 2000, there were about 600,000 foreign workers in Singapore, constituting 27% of the total work force. As a result, wages are relatively suppressed or do not rise for all workers. To have some controls, the government imposes a foreign worker levy payable by employers for low end workers like domestic help and construction workers. In 2012, the Ministry of Trade and Industry (MTI) reported that Singapore should continue to fine-tune the calibration of its inflow of foreigners as the country continues to face an ageing population and a shrinking workforce. Singapore Parliament accepted the recommendations by its Economic Strategies Committee (ESC) for the optimal ratio of the level of immigration and foreign manpower for both high and low skilled workers. The Government recognises that the current overall foreign workforce should complement the local resident workforce and not replace the Singaporean Core concept, and helps companies greatly as they raise productivity through business restructuring and workforce retraining; raise resident labour force participation rate. ## Poverty and economic inequality Singapore is one of the world's wealthiest countries *per capita*, but its [Gini coefficient](/wiki/Gini_coefficient) is high in comparison to developed countries. Statistics on income inequality are published by the Singapore Department of Statistics. Without taking taxes and social transfers into account, Singapore's [gini coefficient](/wiki/Gini_coefficient) puts the country in the medium range. Nevertheless, the country remains on the \"very high\" category on the inequality-adjusted human development index (IHDI), a ranking similar to the [Human Development Index](/wiki/Human_Development_Index) (HDI), but with [inequality](/wiki/Economic_inequality) also accounted for. In October 2018, [Oxfam](/wiki/Oxfam) ranked Singapore 149 out of 157 in its Commitment to Reducing Inequality Index 2018, placing it among the bottom ten of the countries in the index, which ranks countries based on efforts to reduce [economic inequality](/wiki/Economic_inequality). In its report, Oxfam accused Singapore of practices which encouraged \"harmful tax practices\", not having a universal [minimum wage](/wiki/Minimum_wage) (apart from [janitors](/wiki/Janitor) and security guards), and poor performance on [labour rights](/wiki/Labour_rights). The government responded to the report by claiming that it was more important to look at \"real outcomes\" such as Singapore's high home ownership, health, education, and employment, rather than public spending or tax rates, also saying that the report \"assumes that high taxation and high public expenditure reflects commitment to combating inequality\". The government provides social support through a variety of social assistance schemes. The [Ministry of Social and Family Development](/wiki/Ministry_of_Social_and_Family_Development) runs ComCare, a program which provides income support for low-income citizen households through various schemes for short-to-medium term assistance, long-term assistance, child support, and urgent financial needs. The [Community Development Councils](/wiki/Community_Development_Council) also run various local assistance schemes within their districts. The [Ministry of Manpower](/wiki/Ministry_of_Manpower_(Singapore)) runs a Silver Support Scheme which provides additional financial support for low-income elderly with no family support. Meanwhile, the [Ministry of Health](/wiki/Ministry_of_Health_(Singapore)) also runs MediFund to assist families that have difficulty paying for medical bills despite government subsidies and [other health financing schemes](/wiki/Healthcare_in_Singapore). In addition, the [National Council of Social Service](/wiki/National_Council_of_Social_Service) coordinates a range of 450 non-government [voluntary welfare organisations](/wiki/Voluntary_welfare_organisation) to provide social services, while raising funds through [The Community Chest of Singapore](/wiki/The_Community_Chest_of_Singapore). Today, low and middle-income groups now receive 2.5 times the public subsidies they did ten years ago. ## Public finance Government spending in Singapore has risen since the start of the [2008 financial crisis](/wiki/2008_financial_crisis), from around 15% of GDP in 2008 to 17% in 2012. The government's total expenditure as a percentage of GDP ranks among the lowest internationally and allows for a competitive tax regime. Singapore is required under its constitution to keep a balanced budget over each term of government. Singapore government debt is issued for investment purposes, not to fund expenditure. Personal income taxes in Singapore range from 0% to 22% for incomes above S$320,000. There are no capital gains or inheritance taxes in Singapore. Singapore's corporate tax rate is 17% with exemptions and incentives for smaller businesses. Singapore has a single-tier corporate income tax system, which means there is no double-taxation for shareholders. Singapore introduced Goods and Services Tax (GST) with an initial rate of 3% on 1 April 1994, increasing government's revenue by S$1.6 billion (US$1b, €800m) and establishing government finances. The GST rate increased to 4% in 2003, 5% in 2004, 7% in 2007, 8% in 2023, and 9% in 2024. The Singapore government owns two investment companies, [GIC Private Limited](/wiki/GIC_Private_Limited) and [Temasek Holdings](/wiki/Temasek_Holdings), which manage Singapore's [reserves](/wiki/Reserves_of_the_Government_of_Singapore). Both operate as commercial investment holding companies independently of the Singapore government, but former Prime Minister Lee Hsien Loong and his wife Ho Ching serve as chairman and CEO of these corporations respectively. While GIC invests abroad, Temasek holds 31% of its portfolio in Singapore, holding majority stakes in several of the nation's largest companies, such as [Singapore Airlines](/wiki/Singapore_Airlines), [Singtel](/wiki/Singtel), [ST Engineering](/wiki/ST_Engineering) and [Mediacorp](/wiki/Mediacorp). As of 2014, Temasek holds S$69 billion of assets in Singapore, accounting for 7% of the total capitalisation of Singapore-listed companies. In April 2013, the country was recognised as an increasingly popular tax haven for the wealthy due to the low tax rate on personal income, a full tax exemption on income that is generated outside of Singapore and 69 double taxation treaties that can minimise both withholding tax and capital gains tax. Australian millionaire retailer [Brett Blundy](/wiki/Brett_Blundy), with an estimated personal wealth worth AU$835 million, and multi-billionaire Facebook co-founder [Eduardo Saverin](/wiki/Eduardo_Saverin) are two examples of wealthy individuals who have settled in Singapore (Blundy in 2013 and Saverin in 2012). Additionally, Australian mining magnate [Gina Rinehart](/wiki/Gina_Rinehart) owns property in Singapore and American investor [Jim Rogers](/wiki/Jim_Rogers) moved to Singapore in 2007—Rogers has identified the 21st century as an era in which Asia will dominate and wishes for his two daughters to learn Mandarin as a key outcome of the relocation. Chinese Media TV celebrities [Jet Li](/wiki/Jet_Li) and [Gong Li](/wiki/Gong_Li) have also taken up naturalised Singapore citizenship. ## Monetary policy The [Monetary Authority of Singapore](/wiki/Monetary_Authority_of_Singapore) (MAS) is Singapore's [central bank](/wiki/Central_bank) and [financial regulatory](/wiki/Financial_regulation) authority. Its current chairman is Prime Minister [Lawrence Wong](/wiki/Lawrence_Wong) (July 2023–present). It administers the various statutes pertaining to money, banking, insurance, securities and the financial sector in general, as well as [currency issuance](/wiki/Singapore_dollar). The MAS has been given powers to act as a banker to and financial agent of the Government. It has also been entrusted to promote monetary stability, and credit and exchange policies conducive to the growth of the economy. Unlike many other central banks such as [Federal Reserve System](/wiki/Federal_Reserve_System), [European Central Bank](/wiki/European_Central_Bank) or [Bank of England](/wiki/Bank_of_England), MAS does not regulate the monetary system via interest rates to influence the liquidity in the system. Instead, it chooses to do it via the foreign exchange mechanism, which it has been doing since 1981. In doing so it manages the Singapore dollar versus a number of currencies that they do not reveal publicly – a Singapore dollar nominal effective exchange rate (S$ NEER). It carries this out by intervening in the SGD market as well as other operations in the money market. The MAS reviews its policy stance less frequently than most central banks, in a cycle that is around every 6 months. In some circumstances, such as during the [COVID-19 pandemic](/wiki/COVID-19_pandemic) MAS can change the date of its twice yearly meeting. In May 2022, six major banks agreed to pay $64.5 million to resolve antitrust allegations that they worked together to rig benchmark Singapore interest rates. The banks involved included Credit Suisse AG, Deutsche Bank AG, The Hongkong and Shanghai Banking Corporation Limited, ING Bank N.V., Citibank N.A. and JPMorgan Chase & Co. Policy decisions DateChanges22 February 2001gradual modest appreciation rate of appreciation of SGD NEER band.10 April 2001gradual modest appreciation rate of appreciation of SGD NEER band.12 July 2001zero percent rate of appreciation of SGD NEER band.10 October 2001zero percent rate of appreciation of SGD NEER band; width widened.2 January 2002zero percent rate of appreciation of SGD NEER band; width narrowed.14 October 2016zero percent rate of appreciation of SGD NEER band; no change to width and the level at which it is centred.13 April 2017zero percent rate of appreciation of SGD NEER band; no change to width and the level at which it is centred.13 October 2017zero percent rate of appreciation of SGD NEER band; no change to width and the level at which it is centred.13 April 2018slightly increase rate of appreciation of SGD NEER band; no change to width and the level at which it is centred.12 October 2018slightly increase rate of appreciation of SGD NEER band; no change to width and the level at which it is centred.12 April 2019unchanged rate of appreciation of SGD NEER band; no change to width and the level at which it is centred.14 October 2019slightly reduce rate of appreciation, with no change in width.30 March 2020zero percent per annum rate of appreciation, starting at the prevailing level with no change in width.14 October 2020There was no change in foreign exchange policy from the March decision. This was expected by all economists. ## Property policy To dampen property speculation, the government imposed Additional Buyer's Stamp Duty (ABSD) starting in December 2011. It was subsequently raised in January 2013 and then again in July 2018. Currently for Singapore citizens buying their first property, there is no ABSD. For their second property onwards, they pay up to 15% ABSD. For foreigners the ABSD rate is 60% no matter if it is the first property. And for entities it is 65%. At the same time they raised the ABSD in 2018, the MAS tightened rules on housing loans, by limiting the loan tenure and reducing the Loan-to-Value ratio. ## Mergers and acquisitions 16,156 mergers and acquisitions deals have been conducted in Singapore so far, which accumulated to a total value of US$850 bil. Since 1985 there has been a constant upward trend, disrupted only in 2002 and 2009. The most active year in terms of numbers (926) and value (US$78 bil.) has been 2017, so there is currently an all-time high. In general inbound and outbound deals in Singapore are nearly equally distributed. Here is a list of the top 10 deals with Singaporean participation inbound or outbound: Date AnnouncedAcquiror NameAcquiror Mid IndustryAcquiror NationTarget NameTarget Mid IndustryTarget NationValue of Transaction ($mil)2 January 2008Shining Prospect Pte LtdOther FinancialsSingaporeRio Tinto PLCMetals & MiningUnited Kingdom14,284.177 September 2015Petrol Complex Pte LtdOil & GasSingaporeEssar Oil LtdOil & GasIndia12,907.2514 July 2017Nesta Investment Holdings LtdOther FinancialsChinaGlobal Logistic Properties LtdNon ResidentialSingapore11,553.5812 October 2016QHG Shares Pte LtdOther FinancialsSingaporeRosneft Oil CoOil & GasRussian Fed10,776.5512 October 2007Government of Singapore InvestAlternative Financial InvestmentsSingaporeUBS AGBanksSwitzerland9,760.4226 March 2001Singapore TelecommunicationsWirelessSingaporeCable & Wireless Optus LtTelecommunications ServicesAustralia8,491.1212 January 2014Investor GroupOther FinancialsSingaporeIndCor Properties IncREITsUnited States8,100.0030 March 2007Investor GroupOther FinancialsSingaporeAlinta LtdOil & GasAustralia7,500.9813 September 2012TCC Assets LtdOther FinancialsBritish VirginFraser & Neave LtdFood and BeverageSingapore6,896.4815 January 2008Government of Singapore InvestAlternative Financial InvestmentsSingaporeCitigroup IncBanksUnited States6,880.00 ## Facts and figures **Percentage of economic growth:** 1.7% (2016) **Industrial production growth rate:** 1% (2016 est.) **Electricity – production by source:** *fossil fuel:* 95.3% *hydro:* 0% *nuclear:* 0% *other:* 3.9% (2014 est.) **Electricity – consumption:** 47.5 TWh (2016) **Electricity – exports:** 0 kWh (2007) **Electricity – imports:** 0 kWh (2007) **Agriculture – products:** rubber, [copra](/wiki/Copra), fruit, vegetables; poultry, eggs, fish, [orchids](/wiki/Orchid), ornamental fish **Currency:** 1 Singapore dollar (S$ or [SGD](/wiki/SGD)) = 100 cents **Exchange rates:** YearSingapore Dollars per US$119812.053019852.121319901.727519951.414820001.736120051.673820111.257320121.249820131.251320141.267120151.374820161.37920171.380720181,349120191.364220201.379220211.34420221.378920231.3431 ## International rankings - [Four Asian Tigers](/wiki/Four_Asian_Tigers) - [5 C's of Singapore](/wiki/5_C%27s_of_Singapore) - [Biopolis](/wiki/Biopolis) - [Dual economy](/wiki/Dual_economy) - [Bamboo network](/wiki/Bamboo_network) - [Immigrant workers in Singapore](/wiki/Immigrant_workers_in_Singapore) - [Singapore Workplace Safety and Health Conference](/wiki/Singapore_Workplace_Safety_and_Health_Conference) - [Singapore and the World Bank](/wiki/Singapore_and_the_World_Bank) ## Notes Library resources about **Economy of Singapore** - Resources in your library - Resources in other libraries - Economic Development Board - Enterprise Singapore - Statistics Singapore - Ministry of Trade and Industry - Monetary Authority of Singapore Portals: - Economy - Singapore\n",
  "language": "en",
  "processed_at": "2026-01-12T10:09:34.730106",
  "title": "Economy of Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Economy_of_Singapore"
}