{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:09:30.099177"
  },
  "content": "Statutory board of Singapore The **Economic Development Board** (**EDB**) is a [statutory board](/wiki/Statutory_boards_of_the_Singapore_Government) under the [Ministry of Trade and Industry](/wiki/Ministry_of_Trade_and_Industry_(Singapore)) of the [government of Singapore](/wiki/Government_of_Singapore) that plans and executes strategies aimed to sustain [Singapore](/wiki/Singapore) as a leading global hub for [business](/wiki/Business) and [investment](/wiki/Investment). ## History ### 1957–1961: Singapore Industrial Promotion Board In 1957, the Singapore Industrial Promotion Board (SIPB) was formed through the passage of the Singapore Industrial Promotion Bill, to empower the Singapore Government in establishing, developing, and financing industrial undertakings. It had a capital of $1 million, and had received requests from local companies for loans totalling up to $500,000 at its formation. However, SIPB was criticised by political opposition as being slow, not transparent, and ineffective in aiding local businesses. The board was hamstrung by the limited capital that it had with the Minister of Commerce and Industry, J. M. Jumabhoy, blaming on the activities of extreme left-wing politicians on the lack of corporations from financial institutions. In 1959, the Singapore Government unveiled a new proposed Economic Development Board (EDB) with a capital of $100 million. The proposed board would be funded partly by a part of the $300 million foreign investments that the government had made before. It would also be a statutory board, and in addition to the current responsibilities of SIPB to disburse loans to companies, it would have a direct part in setting up factories or make use of its capital for local joint venture projects with the private sector. The Economic Development Ordinance was first read in Parliament on 26 April 1961, with its second reading on 24 May 1961. The ordinance commenced on 1 August 1961, thus taking over the functions of SIPB. To facilitate the set up of EDB, international experts were requested from the [United Nations](/wiki/United_Nations) and appointed to run the board alongside local officers. ### 1961–present: Setting up of Jurong Industrial Estate and overseas missions By 24 November 1961, the agency was fully operational. In December 1961, the agency started offering free advice to nine electrical industries, releasing research materials to entrepreneurs and manufacturers. It also spearheaded development works at the 9,000 acre Jurong industrial estate. In 1962, EDB introduced a simplified process of buying industrial land. An applicant would have to submit a building plan in three months and build in two years before a lease of land no more than 99 years be issued. EDB received an additional grant of S$40 million to develop Jurong Industrial Estate from the Singapore government. 1962 was also the year which Singapore begun to actively woo overseas industrialists as such the Japanese, with some indicating interests in joint development projects and sending study missions to Singapore. A Japanese economic survey mission led by Shinichi Takasugi, President of Mitsubishi and Head of Japan's Economic Cooperation Committee and the [Federation of Economic Organizations](/wiki/Japan_Business_Federation) found that Jurong Industrial Estate was \"the best site for industrialisation for Singapore.\" A S$23 million shipyard joint venture between [Ishikawajima-Harima](/wiki/IHI_Corporation) and EDB was planned for as well. EDB was also functioning as an industrial bank, offering loans to companies at \"reasonable interest rates\". Investing since 1991, EDBI is the dedicated corporate investment arm of the EDB, and a global investor in select high growth technology sectors covering Information & Communication Technology (ICT), Emerging Technology (ET), Healthcare (HC) and other strategic industries. Since 1 April 2019, the EDB manages DesignSingapore Council, the national agency for design, which is located in the [National Design Centre](/wiki/National_Design_Centre). This is done to help companies expand beyond Singapore. It also manages Singapore Global Network, which was set up in 2019 to grow Singapore's networks and connections around the world. The EDB maintains 20 international offices in 14 countries which includes Brazil, China, France, Germany, India, Indonesia, Japan, Netherlands, South Korea, Sweden, Switzerland, Thailand, United Kingdom and the United States. - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T10:09:30.098787",
  "title": "Economic Development Board",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Economic_Development_Board"
}