{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:09:42.624549"
  },
  "content": "* *Education in Singapore** is managed by the [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)) (MOE). It controls the development and administration of state schools receiving [taxpayers'](/wiki/Welfare_(financial_aid)) funding, but also has an advisory and supervisory role in respect of private schools. For both private and state schools, there are variations in the extent of autonomy in their curriculum, scope of taxpayers' aid and funding, [tuition](/wiki/Tuition_payments) burden on the students, and admission policy. Education spending usually makes up about 20 per cent of the annual [national budget](/wiki/Government_budget), which subsidises state education and government-assisted private education for Singaporean citizens and funds the [Edusave](/wiki/Edusave) programme. Non-citizens bear significantly higher costs of educating their children in Singapore government and government-aided schools. In 2000, the Compulsory Education Act [codified](/wiki/Codification_(law)) [compulsory education](/wiki/Compulsory_education) for children of primary school age (excepting those with disabilities), and made it a [criminal offence](/wiki/Criminal_law) for parents to fail to enroll their children in school and ensure their regular attendance. Exemptions are allowed for [homeschooling](/wiki/Homeschooling) or full-time religious institutions, but parents must apply for exemption from the Ministry of Education and meet a minimum benchmark. The main language of instruction in Singapore is [English](/wiki/English_language), which was officially designated the first language within the local education system in 1987. English is the first language learned by half the children by the time they reach [preschool](/wiki/Preschool) age and becomes the primary medium of instruction by the time they reach primary school. Although [Malay](/wiki/Malay_language), [Mandarin](/wiki/Standard_Chinese) and [Tamil](/wiki/Tamil_language) are also official languages, English is the language of instruction for nearly all subjects except the official Mother Tongue languages and the literatures of those languages; these are generally not taught in English, although there is provision for the use of English at the initial stages. Certain schools, such as secondary schools under the [Special Assistance Plan](/wiki/Special_Assistance_Plan) (SAP), encourage a richer use of the mother tongue and may occasionally teach subjects in Mandarin Chinese. Singapore's education system has been consistently ranked as one of the highest in the world by the [OECD](/wiki/OECD). It is believed that this comes from the style of teaching that is implemented in Singapore. Teachers focus on making sure that each of their students thoroughly move through the syllabus before moving on. By doing this teachers in Singapore teach a much more narrow but deeper type of instruction. Furthermore, it has been described as \"world-leading\" and in 2010 was among those picked out for commendation by the [Conservative](/wiki/Conservative_Party_(UK)) former UK [Education Secretary](/wiki/Secretary_of_State_for_Education) [Michael Gove](/wiki/Michael_Gove). According to [PISA](/wiki/Programme_for_International_Student_Assessment), an influential worldwide study on educational systems, Singapore has the highest performance in international education and tops in global rankings. In 2020, Singaporean students made up half of the perfect scorers in the [International Baccalaureate](/wiki/International_Baccalaureate) (IB) examinations worldwide. ## History ### Pre-independence Sir Thomas Stamford Raffles founded the Singapore Institution (now known as [Raffles Institution](/wiki/Raffles_Institution)) in 1823, thereby starting education in Singapore under the British rule. Later, three main types of schools appeared in Singapore: Malay schools, Chinese and Tamil (together) schools, and English schools. Malay schools were provided free for all students by the British, while English schools, which used English as the main medium of instruction, were set up by [missionaries](/wiki/Missionaries) and charged school fees. Chinese and Tamil schools largely taught their respective mother tongues. Students from Chinese schools in particular were extremely attuned to developments in China, especially in the rise of [Chinese nationalism](/wiki/Chinese_nationalism). During [World War II](/wiki/World_War_II), many students in Singapore dropped out of school, causing a huge backlog of students after the war. In 1947, the Ten Years Programme for Education Policy in the Colony of Singapore was formulated. This called for a universal education system that would prepare for self-governance. During the 1950s and 1960s, when Singapore started to develop its own economy, Singapore adapted a \"survival-driven education\" system to provide a skilled workforce for Singapore's industrialisation programme as well as to lower unemployment. Apart from being an economic necessity, education also helped to integrate the new nation together. The bilingualism policy in schools was officially introduced in 1960, making English the official language for both national integration and utilitarian purposes. Universal education for children of all races and background started to take shape, and more children started to attend schools. However, the quality of schools set up during this time varied considerably. The first Junior College was opened in 1969. ### Post-independence Education has always represented an area of focus for Singapore since its independence in 1965. Its emphasis on education partly reflects Singapore's virtual lack of natural resources and Singapore's need to develop its human resource and manpower capability in its continuing quest to build a [knowledge-based economy](/wiki/Knowledge_economy). In the 1980s, Singapore's economy started to prosper, and the focus of Singapore's education system shifted from quantity to quality. More differentiation for pupils with different academic abilities were implemented, such as revamping [vocational education](/wiki/Vocational_education) under the new [Institute of Technology](/wiki/Institute_of_Technology) and splitting of the Normal [stream](/wiki/Tracking_(education)) in secondary schools into Normal (Academic) and Normal (Technical) streams. The [Gifted Education Programme](/wiki/Gifted_Education_Programme) was also set up to cater to more academically inclined students. In 1997, the Singapore education system started to change into an ability-driven one after then Prime Minister [Goh Chok Tong](/wiki/Goh_Chok_Tong) outlined his \"Thinking Schools, Learning Nations\" vision. Under this policy, more emphasis was given to national education, creative thinking, collaborative learning as well as [ICT](/wiki/Information_and_communications_technology) literacy. Schools became more diverse and were given greater autonomy in deciding their own curriculum and developing their own niche areas. Differences between the various academic streams became blurred. The Ministry of Education also officially acknowledged that \"excellence\" will not be measured solely in terms of academics; a mountain range of excellence – with many peaks\". In recent years, the goal of the education sector, particularly tertiary education, has moved beyond simply building local manpower capabilities, and is actively being developed by the Singapore government as a source of revenue. The government's plan, which was initiated in 2002, is to make Singapore a \"Global Schoolhouse\", attracting revenue-generating international students. In 2002, the education sector accounted for 3.6% of Singapore's economy. The government's aim was to grow this sector to 5% of Singapore's economy over the subsequent decade. ## School grades The school year is divided into four terms. The first begins at the beginning of January and ends in Week 2 of March; the second begins in Week 3 of March and ends in the end of May; the third begins in July and ends in the first week of September, and the final term begins on the 2nd or 3rd week of September and ends in mid-November. Level/GradeTypical age on birthday[Preschool](/wiki/Preschool)[Pre-school playgroup](/wiki/Pre-school_playgroup)4[Kindergarten](/wiki/Kindergarten)5 to 6Primary school (Children enter P1 upon the year they turn 7)[Primary 1](/wiki/First_grade)7[Primary 2](/wiki/Second_grade)8[Primary 3](/wiki/Third_grade)9[Primary 4](/wiki/Fourth_grade)10[Primary 5](/wiki/Fifth_grade)11[Primary 6](/wiki/Sixth_grade)12Secondary school (Children enter S1 upon the year they turn 13)[Secondary 1](/wiki/Seventh_grade)13[Secondary 2](/wiki/Eighth_grade)14[Secondary 3](/wiki/Ninth_grade)15[Secondary 4](/wiki/Tenth_grade)16[Secondary 5](/wiki/Eleventh_grade) (available for normal academic stream only)17[Post-secondary education](/wiki/Post-secondary_education)[Junior College](/wiki/Junior_college_(Singapore)), Polytechnic or [ITE](/wiki/Institute_of_Technical_Education), followed by University educationbeyond 16 or 17 ## Kindergartens [Kindergartens](/wiki/Kindergarten) in Singapore provide up to three years of [pre-school](/wiki/Pre-school) for children ages three to six. The three years are commonly called *Nursery*, *Kindergarten 1* (K1) and *Kindergarten 2* (K2), respectively. Kindergartens provide an environment for children to learn how to interact with others, and to prepare them for formal education at Primary school. Activities include learning language – written and oral – and numbers, development of personal and social skills, games, music, and outdoor play. Children learn two languages, English and their official Mother Tongue ([Mandarin](/wiki/Standard_Chinese), [Malay](/wiki/Malay_language), or [Tamil](/wiki/Tamil_language)). Many private or church-based kindergartens might not offer Malay and/or Tamil, so non-Chinese pupils might also learn some Standard Mandarin in these kindergartens. The kindergartens are run by the private sector, including community foundations, religious bodies, and civic or business groups. There are more than 200 kindergartens registered with [Early Childhood Development Agency](/wiki/Early_Childhood_Development_Agency). Kindergartens are also run by [child care](/wiki/Child_care) centres as well as international schools. The [People's Action Party](/wiki/People%27s_Action_Party), which has governed Singapore since 1957, runs over 370 kindergartens through its charitable arm, the PAP Community Foundation. ## Primary education Primary education, normally starting at age seven, is a four-year *foundation stage* (Primary 1 to 4) and a two-year *orientation stage* (Primary 5 to 6). Primary education is compulsory under the Compulsory Education Act since 2003. Exemptions are made for pupils who are [homeschooling](/wiki/Homeschooling), attending a full-time religious institution or those with special needs who are unable to attend mainstream schools. However, parents have to meet the requirements set out by the Ministry of Education before these exemptions are granted. Students have to take a test at Primary 4 to determine whether they could remain homeschooled. Primary education is free for all Singapore citizens in schools under the purview of the Ministry of Education, though there is a monthly miscellaneous fee of up to [SGD](/wiki/Singapore_dollar) 13 per student. From 2020 it was announced that there would be a cap of 25–30% for Permanent Resident children entering into 10 primary schools which had PR admissions close to 25 to 30 per cent. This was to keep the concentration of PR children low and allow more interaction between citizens and PRs. The *foundation stage* is the first stage of formal schooling. The four years, from primary 1 to 4, provide a foundation in English, mother tongue (which includes Standard Mandarin, Malay, Tamil or a Non-Tamil Indian Language (NTIL), such as [Hindi](/wiki/Hindi), [Punjabi](/wiki/Punjabi_language) and [Bengali](/wiki/Bengali_language)), Mathematics and Science. Other subjects include [Civics](/wiki/Civics) and [Moral Education](/wiki/Character_education), [arts and crafts](/wiki/Handicraft), music, [health education](/wiki/Health_education), [social studies](/wiki/Social_studies), and [physical education](/wiki/Physical_education), which are taught throughout Primary 1 to 6. Science is taught from Primary 3 (age 9) onwards. English is taught as a first language in primary school, with the Ministry of Education choosing to do so as English is the lingua franca of international business, science and technology. Therefore, a strong foundation in the English Language is considered an essential skill to develop. Bilingualism is considered a cornerstone of Singapore's education system, and all students are required to choose a second, Mother Tongue Language (Chinese Language, Malay Language or Tamil Language) on enrolment into Primary school, to ensure that students can in future, tap the opportunities that can be found in the global environment. Exemptions are available for students whose native language is not an available Mother Tongue language (such as [Nepali](/wiki/Nepali_language)). With more Primary 1 students coming from households where English is the dominant language spoken at home, the Ministry of Education has continued to refine the teaching of Mother Tongue Languages, with greater emphasis on listening and speaking skills. All pupils advance to the orientation stage after Primary 4, where they are streamed according to the pupil's ability. The streaming system has been adjusted: previously, pupils were divided at Primary 5 to the EM1, EM2 and EM3 (English and Mother Tongue at 1st, 2nd and 3rd language respectively) streams, but since 2008 they are streamed according to subject under a scheme known as \"Subject-based banding\". Students take subjects at different levels based on their scores in the respective subjects at the end of Primary 4. The Mother Tongue subjects are offered at the higher, standard or foundation levels; Science and Maths can be taken at the standard or foundation levels. After six years of Primary education, students will have to sit for the national [Primary School Leaving Examination](/wiki/Primary_School_Leaving_Examination) (PSLE). Students will then choose the secondary school of their choice based on their results at this examination; they will then be assigned to a secondary school based on merit and their choice. Students are also admitted into a secondary school under a separate \"Direct School Admission\" scheme, whereby secondary schools are able to choose a certain number of students based on their special talents before these students take the PSLE. Students admitted under this scheme cannot select their schools based on their PSLE results. ### Gifted Education Programme The Gifted Education Programme (GEP) was set up by the Ministry of Education in 1984 to cater to the intellectually [gifted](/wiki/Gifted) students. This programme aims to develop gifted children to their top potential and it places a special emphasis on higher-order thinking and creative thought. There are currently 9 primary schools offering the Gifted Education Programme: [Anglo-Chinese School](/wiki/Anglo-Chinese_School_(Primary)), [Catholic High School](/wiki/Catholic_High_School_(Primary)), [Henry Park Primary School](/wiki/Henry_Park_Primary_School), [Nan Hua Primary School](/wiki/Nan_Hua_Primary_School), [Nanyang Primary School](/wiki/Nanyang_Primary_School), [Rosyth School](/wiki/Rosyth_School), [Tao Nan School](/wiki/Tao_Nan_School), [St. Hilda's Primary School](/wiki/St._Hilda%27s_Primary_School) and [Raffles Girls' Primary School](/wiki/Raffles_Girls%27_Primary_School). The Secondary School Gifted Education Programme was discontinued at the end of 2008 as more students take the Integrated Programme (IP); this has been replaced by a \"School-Based Gifted Education\" programme. Pupils enter the programme through a series of tests at Primary 3, which will identify the top 1% of the student population. In the programme, pupils are offered special enrichment programmes to cater for their needs. However, GEP students are still required to take the national [Primary School Leaving Examination](/wiki/Primary_School_Leaving_Examination) like other mainstream students. ## Secondary education Based on results of the [PSLE](/wiki/PSLE), students are placed into three different secondary education tracks or streams: \"Express\", \"Normal (Academic)\", or \"Normal (Technical)\" till 2023. From 2024, students will be divided into G1, G2 and G3, according to the Subject-Based Banding scheme. Singaporean citizens are forbidden from attending international schools on the island without Ministry of Education permission. \"Express\" is a four-year course leading up to the [Singapore-Cambridge GCE O Level](/wiki/Singapore-Cambridge_GCE_Ordinary_Level) examination. The difference between these two courses is that in the \"Special\" stream, students take 'Higher Mother Tongue' (available for Standard Mandarin, Malay and Tamil only) instead of 'Mother Tongue'. A pass (D7 or higher) in the Higher Mother Tongue 'O' Level Examination constitutes the fulfilment of the Mother Tongue requirement in Singapore, whereas Normal Mother Tongue Students will have to go through one more year of study in their Mother Tongue after their 'O' Levels to take the 'A' Level H1 Mother Tongue Examinations and fulfil the MOE's requirement. A foreign language, either French, German, Japanese or Spanish can be taken in addition to the mother tongue or can replace it. This is especially popular with students who are struggling with their mother tongues, expatriates, or students returning from abroad. Non-Chinese students may also study Standard Mandarin and non-Malay students Malay as a third language. This programme is known as CSP (Chinese Special Programme) and MSP (Malay Special Programme). Mother Tongue teachers conduct these lessons in school after usual hours. Students of Higher Mother Tongue languages are allowed to have up to two points taken off their O-level scoring, even if the student's Higher Mother Tongue is used as their L1 in computation of L1R5, a scoring system discussed below where a lower value is considered better, if they meet set benchmarks. The [Ministry of Education Language Centre](/wiki/Ministry_of_Education_Language_Centre) (MOELC) provides free language education for most additional languages that other schools may not cover, and provides the bulk of such education, admitting several thousand students each year. \"Normal (Academic)\" is a four-year course leading up to the [Normal (Academic) level](/wiki/Singapore-Cambridge_GCE_Normal_Level) (N(A)-level) exam, with the possibility of a fifth year leading up to the GCE O-level exam. The Normal (Academic) course is geared towards preparing students for the O-level exam in the fifth year, subject to good performance in the N(A)-level exam in the fourth year, and students take academic subjects such as Principles of Accounting. In 2004, the Ministry of Education announced that selected students in the Normal (Academic) course would have an opportunity to sit for the O-level exam directly without first taking the N(A)-level exam. \"Normal (Technical)\" is a four-year course leading up to the [Normal (Technical) level](/wiki/Singapore-Cambridge_GCE_Normal_Level) (N(T)-level) exam. In Normal (Technical), students take subjects of a more technical nature, such as Design and Technology, and they generally proceed to the [Institute of Technical Education](/wiki/Institute_of_Technical_Education) (ITE) after the N(T)-level exam in the fourth year. With the exception of schools offering the Integrated Programme, which leads to either an [International Baccalaureate Diploma](/wiki/International_Baccalaureate_Diploma) or to an [A-level](/wiki/Singapore-Cambridge_GCE_Advanced_Level) exam, most students are streamed into a wide range of course combinations at the end of their second year, bringing the total number of subjects they have to sit at O-level to between six and ten, with English, Mother Tongue or Higher Mother Tongue Language, Mathematics, one Science and one Humanities Elective being compulsory. Several new subjects such as Computing and Theatre Studies and Drama are being introduced in tandem with the Ministry of Education's revised curriculum. ### Co-Curricular activities Unlike in primary or post-secondary levels, participating in a Co-Curricular Activity (CCA) is required in secondary school, meaning that all pupils participate in at least one CCA. CCAs offered at the secondary level are usually categorised as Uniformed Groups, Performing Arts, Clubs & Societies and Physical Sports. There are many CCAs offered at the secondary school level; however, different schools may choose to offer different CCAs. Students may choose to participate in more than 1 CCA. Participation in CCAs is graded together with other non-academic achievements throughout a student's secondary school education in a scoring system known as LEAPS 2.0. (LEAPS 1.0 was abolished and the cohort of 2016 taking the 'O' level examination would be last to use this system).[a] Points accumulated in the areas of leadership, achievement, participation and service (under LEAPS 2.0) will determine a student's CCA grade. Students may get up to a maximum of two bonus points for entry into a junior college depending on their CCA grades. LEAPS 2.0 is about leadership, achievement, participation and service. The method of calculating the 2 bonus points is very different, with LEAPS 2.0 making it harder to achieve the 2 bonus points. ### Special Assistance Plan (SAP) The **Special Assistance Plan** (**SAP**) ([Chinese](/wiki/Simplified_Chinese_characters): 特别辅助计划) is a special programme established in 1979 that caters to academically strong students who excel in both their mother tongue as well as English. It allows students to undertake [English language](/wiki/English_language) and [Chinese language](/wiki/Chinese_language) at first language standard with a widened exposure to the Chinese culture and values. The programme is offered in designated schools that are recognised for its preservation of strong Chinese cultural heritage and academic excellence. Currently, there are a total of 15 primary schools and 11 high schools being accorded SAP status. Before the educational reforms in the 2000s, students had to achieve a PSLE aggregate score in the top 10% of their cohort, with an A grade for both mother tongue and English, to be entitled to enter an SAP school under the Special academic stream. Currently, students are entitled up to 3 additional bonus points when applying for SAP secondary schools with their Higher Chinese Paper [Primary School Leaving Examination](/wiki/Primary_School_Leaving_Examination) (PSLE) results. Since its founding, there have only been SAP schools for students studying the [Chinese language](/wiki/Chinese_language). ### Integrated Programme The Integrated Programme, also known as the \"Through-Train Programme\" (直通车), is a scheme which allows secondary students in Singapore to bypass \"O\" levels (except for those taking Higher Mother Tongue) and take A levels, [International Baccalaureate Diploma](/wiki/International_Baccalaureate_Diploma) or an equivalent examination directly at the age of 18 after six years of secondary education. The programme allows for more time to be allocated to enrichment activities. By bypassing the GCE O level examinations, students are given more time and flexibility to immerse themselves in a more broadly-based education. In addition, students enjoy more freedom in the combination of subjects between Year 1 – 4 as compared to their non-IP counterparts. Generally, only the top performers from Express stream are eligible to be part of the IP programme. This will ensure that the main body of the students pursue their secondary education at their own pace by first completing a 4-year O level course before going on to a 2-year A level education. As a result, Integrated Programme schools allow their students to skip the O levels at Secondary 4 and go straight into junior colleges (JCs) in Year 5/JC1. The [Integrated Programme](/wiki/Integrated_Programme) with the revised Singapore-Cambridge GCE A levels or the [IB Diploma](/wiki/IB_Diploma) as a terminal qualification has become an increasingly popular alternative to the standard secondary education pathway. This is because it is perceived as having moved away from the usually heavy emphasis on the sciences, a phenomenon resulting from the post-independence need for quick and basic technical and industrial education; to subjects in the arts and humanities. Such programmes are more project-based and students are expected to be independent learners. The first batch of IP students sat for the revised GCE A Level or International Baccalaureate Diploma examinations in 2007. ### Specialised Independent Schools (SIS) Specialised Independent Schools offer specialised education with different focuses. There are currently four specialised schools in Singapore. - [NUS High School of Mathematics and Science](/wiki/NUS_High_School_of_Math_and_Science), focuses on Mathematics, Science, Technology and Engineering. - [School of Science and Technology, Singapore](/wiki/School_of_Science_and_Technology,_Singapore), focuses on applied learning in Science, Technology, Aesthetics, Engineering and Mathematics. - [School of the Arts, Singapore](/wiki/School_of_the_Arts,_Singapore), focuses on Visual, Literary and Performing Arts. - [Singapore Sports School](/wiki/Singapore_Sports_School), focuses on Sports and Athletics. ### Admission to post-secondary institutions Upon completion of the 4- or 5-year secondary school education, students (excluding IP students) will participate in the annual [O level](/wiki/Singapore-Cambridge_GCE_Ordinary_Level) exam, the results of which determine which post-secondary institutions they may apply for. The O Level subject grades range from A1 (best) to F9 (worst). Pre-university centres include junior colleges for a two-year course leading up to the [Singapore-Cambridge GCE A Level](/wiki/Singapore-Cambridge_GCE_Advanced_Level) or the [International Baccalaureate Diploma](/wiki/International_Baccalaureate_Diploma), or the Millennia Institute for a three-year course leading up to the A Level. Pre-university centres accept students on merit, with a greater emphasis on academics than applied education. Admission to a two-year pre-university course at junior colleges after graduating from secondary school is determined by the L1R5 (English + 5 relevant subjects) scoring system. The candidate adds the numerical grades for six different subjects: English (or another language taken at the 'first language' level), a Humanities subject, a Science/Mathematics subject, a Humanities/Science/Mathematics subject, and two other subjects of any kind. Students scoring 20 points and below may be admitted for either a Science or Arts course. For admission to a three-year pre-university course at the Millennia Institute, the L1R4 (English + 4 relevant subjects) scoring system is used, and students are required to score below 20 points to be admitted. Students may opt for any of the science, arts or commerce streams when pursuing the three-year pre-university course. Students who wish to pursue specialised education go on to polytechnics or arts institutions where they receive a diploma upon successful completion of their courses. Polytechnics accept students on merit, with a greater emphasis on applied education than academics. Admission to a three-year polytechnic course after graduating from secondary school is determined by the ELR2B2 (English language + 2 relevant subjects + 2 best subjects) scoring system. The candidate adds the numerical grades for five different subjects: English language, two relevant subjects related to the course of choice in polytechnic, and two other subjects of any kind. Students scoring 26 points and below may be admitted for a polytechnic course. In 2017, about 47% of the annual school cohort was given a place in polytechnic, about 28% of the annual school cohort was given a place in JC/MI. About 38% of the Joint Application Exercise cohort was admitted to JC/MI in 2020, this figure does not account for Integrated Programme students who are directly admitted to JC1. About 45% of the Joint Application Exercise cohort applying to polytechnic qualified for JC in 2020. About 44% of O level students entered JC in 2022. MI had around 700 students in 2023, spread over its 3 levels of MI1 to MI3. About 14,000 students were given a place in ITE in 2017. In 2023 about 80% of the A level and IB population enrolled in a place in a local university, up from about 75% in 2015. In 2016 about 70% of the JC population secured a place in a local university. From 2019 to 2021 about 40% to slightly over 50% of MI students qualified for local university. In 2023 about 33% of polytechnic students entered local university. The polytechnic GPA required to qualify for local university requires more consistent performance to obtain than qualifying A level grades. The Ministry of Education intends to raise the lifetime cohort participation rate in local universities to 60% by 2025 from the 50% rate in 2023. In 2022 about 47% of the O level batch (secondary 4 express and secondary 5 NA) students entered NUS/NTU. ## Special education Deaf students who must use sign language to communicate may enroll in any mainstream primary school, effective 2018. Previously they were required to enroll at two special schools. Secondary deaf students who do not need to use sign language to communicate may enroll at [Saint Anthony's Canossian Secondary School](/wiki/Saint_Anthony%27s_Canossian_Secondary_School) and [Outram Secondary School](/wiki/Outram_Secondary_School), while [Beatty Secondary School](/wiki/Beatty_Secondary_School) enrolls secondary students who must use sign language to communicate. A British woman established the Oral School for the Deaf in 1953, and in 1954 the Chinese Sign School for the Deaf was established by a married couple. The Canossian School for the Deaf was established by Italian women afterward. The Canossian school later changed its name to Canossian School for the Hearing Impaired. Historically the sole secondary school for deaf and partially deaf children was Mount Vernon Secondary School (MVSS). [Singapore School for the Deaf](/wiki/Singapore_School_for_the_Deaf) opened in 1963. In 1991 the deaf students were enrolled at Upper Serangoon Secondary School (USSS) as Mount Vernon closed. In 1996 [Boon Lay Secondary School](/wiki/Boon_Lay_Secondary_School) began taking deaf students. In 2016/2017 responsibility for the must use sign language students moved from [Balestier Hill Secondary School](/wiki/Balestier_Hill_Secondary_School) and Boon Lay to Beatty. The [Government of Singapore](/wiki/Government_of_Singapore) decided that it was best to concentrate deaf students who must sign to communicate at one school as only about 15 secondary students were in that category. SSD closed in 2017. ### Convention on the Rights of Persons with Disabilities Before 2014, Singapore was one of only two countries in [ASEAN](/wiki/ASEAN) that was not a signatory to the [Convention on the Rights of Persons with Disabilities](/wiki/Convention_on_the_Rights_of_Persons_with_Disabilities), which mandates that persons with disabilities should be guaranteed the right to inclusive education. Previously, \"any child who is unable to attend any national primary school due to any physical or intellectual disability\" was exempted from compulsory education, a policy changed in 2016 to make education compulsory for those with special needs from 2019. Another option is the [special education](/wiki/Special_education) schools built largely by the Ministry of Education and run by [social service agencies](/wiki/List_of_social_service_agencies_in_Singapore). These schools receive more than 80% of their funding from the Ministry of Education, but have long waiting lists, according to [Member of Parliament](/wiki/List_of_current_Singapore_MPs) [Sylvia Lim](/wiki/Sylvia_Lim). The Singapore government has asserted that only \"a very small number of children do not attend school each year\", giving a figure of 8 students as compared to a primary school intake of roughly 43,000, and that requiring all special needs children to attend school would \"impose unduly harsh requirements on their parents.\" This practice has been described as a \"form of discrimination\" by Sylvia Lim. The Convention was ratified in July 2013, and made effective on 18 August the same year. ## Junior colleges and centralised institutes The pre-university centres of Singapore such as Junior Colleges and Centralized institute are designed for students who wish to pursue a local university degree after two to three years of pre-university education. There are 19 [Junior Colleges](/wiki/Junior_college_(Singapore)) (JCs) and a Centralised Institute (CI), the [Millennia Institute](/wiki/Millennia_Institute) (MI, established 2004), with the [National Junior College](/wiki/National_Junior_College) (NJC, established 1969) being the oldest and [Eunoia Junior College](/wiki/Eunoia_Junior_College) (EJC, established 2017) the newest. ### Junior colleges Junior colleges (JCs) in Singapore were initially designed to offer an accelerated alternative to the traditional three-year programme, but the two-year programme has since become the norm for students pursuing university education. JCs accept students based on their GCE \"O\" Level results; an L1R5 score of 20 points or less must be attained for a student to gain admission. JCs provide a 2-year course leading up to the [Singapore-Cambridge GCE Advanced Level](/wiki/Singapore-Cambridge_GCE_Advanced_Level) (A level) examination or the [International Baccalaureate Diploma](/wiki/International_Baccalaureate_Diploma). ### Centralised Institutes The Centralised Institutes accept students based on their GCE O level results. Their L1R4 score must be 20 points or below in order to be admitted. A Centralised Institute provides a three-year course leading up to the GCE A level examination. There were originally four Centralized Institutes: [Outram Institute](/wiki/Outram_Institute), [Townsville Institute](/wiki/Townsville_Institute), [Jurong Institute](/wiki/Jurong_Institute) and [Seletar Institute](/wiki/Seletar_Institute). [Townsville Institute](/wiki/Townsville_Institute) and [Seletar Institute](/wiki/Seletar_Institute) stopped accepting new students after the 1995 school year and closed down after the last batch of students graduated in 1997. There currently remains only one Centralised Institute in Singapore, the [Millennia Institute](/wiki/Millennia_Institute), which was formed following the merger of Jurong and Outram Institutes. Additionally, only Centralised Institutes offer the Commerce Stream offering subjects such as Principles of Accounting and Management of Business. The standard of teaching and curriculum is identical to that of the Junior Colleges. ## Polytechnics The first polytechnic in Singapore, [Singapore Polytechnic](/wiki/Singapore_Polytechnic), was established in 1954. [Ngee Ann Polytechnic](/wiki/Ngee_Ann_Polytechnic), has roots that go back to 1963. Two other polytechnics, [Temasek Polytechnic](/wiki/Temasek_Polytechnic) and [Nanyang Polytechnic](/wiki/Nanyang_Polytechnic) were established in the 1990s. The most recent, [Republic Polytechnic](/wiki/Republic_Polytechnic) was established in 2003. Polytechnics in Singapore provide 3-year diploma courses. They accept students based on their GCE O Level, GCE N(A) Level, Institute of Technical Education (ITE) or GCE A level results. Polytechnics offer a wide range of courses in various fields, including engineering, business studies, [accountancy](/wiki/Accountancy), tourism and hospitality management, mass [communications](/wiki/Communication_studies), digital media and [biotechnology](/wiki/Biotechnology). There are also specialised courses such as marine engineering, nautical studies, [nursing](/wiki/Nursing), and [optometry](/wiki/Optometry). They provide a more industry-oriented education as an alternative to junior colleges for post-secondary studies. About 40% of each Secondary 4 cohort would enroll in Polytechnics. Notable alumni from Polytechnics in Singapore include former [NUS](/wiki/National_University_of_Singapore) President Dr [Shih Choon Fong](/wiki/Shih_Choon_Fong) and CEO of [Creative Technology](/wiki/Creative_Technology) [Sim Wong Hoo](/wiki/Sim_Wong_Hoo). Most graduates of polytechnics continue to pursue further tertiary education at overseas and local universities. Those with good grades are given exemptions for university modules completed in Polytechnic, notably universities in Singapore, Australia, New Zealand and the United Kingdom. ## Institute of Technical Education Initially, vocational education in Singapore carried a negative stigma and was looked down upon as a dead-end option for underachieving students. In the 1960s, it was considered less than socially desirable educational option as vocational education was perceived that these schools were for low achieving students. Societal prejudice against less academically inclined students and vocational education was regarded low quality and typically out of step with the changing needs of employers. The perception of technical and vocational education in Singapore are slowly changing as parents are starting to realise that there are alternative choices for decent employment outcomes as the greater Singaporean society values vocational and technical skills highly and sees them as crucial to the country's economic and financial development. Vocational education has been an important part of Singapore's unique economic planning since 1992, where it began to transform and change the perception of vocational education and decided to transform and preposition it so that it was not seen as a place of last resort for underachieving pupils. Vocational schools such as the Institute of Technical Education were intended to revolutionise vocational education and portray the institution as a world-class example of the importance of vocational skills being translated to a 21st-century knowledge-based economy. The Institute of Technical Education (ITE) is a vocational school that accepts students based on their GCE \"O\" level or GCE \"N\" level results and they provide two-year courses leading to a locally recognised \"National ITE Certificate\". There are [three ITE colleges](/wiki/Institute_of_Technical_Education#Colleges) in Singapore. Only a few ITE graduates will be able to continue their education at polytechnics and arts institutions which then, if possible goes on to a university. ITE colleges offer apprenticeships for the skilled trades and diplomas in vocational education for skilled technicians and workers in support roles in professions such as engineering, accountancy, business administration, nursing, medicine, architecture, and law. The ITE is highly recognised vocational institution in producing highly skilled graduates that are in demand by employers. Salaries for ITE graduates, who receive a National ITE Certificate (NITEC) or a diploma have also become quite high. ITE provides apprenticeships, professional certificates, licences and diplomas in business administration, accountancy, woodworking, metalworking, carpentry, drafting, shipbuilding and repairing, transportation and engineering science. As of 2014, 87% of ITE graduates are hired in their fields within six months of graduation, leading more students to see vocational education as a strong alternative besides the traditional route of going to university. ITE provides five main levels of certification: - Higher National ITE Certificate (Higher Nitec) - National ITE Certificate (Nitec) - Work Learn Technical Diploma (WLTD) (From 2017) - Specialist Nitec (Marine) - Technical Engineer Diploma (TED) (from 2007) ## Universities ### Autonomous Universities Singapore has six autonomous universities, namely the [National University of Singapore](/wiki/National_University_of_Singapore), [Nanyang Technological University](/wiki/Nanyang_Technological_University), [Singapore Management University](/wiki/Singapore_Management_University), [Singapore University of Technology & Design](/wiki/Singapore_University_of_Technology_and_Design), [Singapore Institute of Technology](/wiki/Singapore_Institute_of_Technology) and [Singapore University of Social Sciences](/wiki/Singapore_University_of_Social_Sciences). Five are public universities, while the Singapore Management University is a publicly-funded private university. The [National University of Singapore (NUS)](/wiki/National_University_of_Singapore) and [Nanyang Technological University (NTU)](/wiki/Nanyang_Technological_University) have over 30,000 students each and provide a wide range of undergraduate and postgraduate degree programmes including doctoral degrees. Both are established research universities with thousands of research staff and graduate students. As of 2022, both universities are ranked among the Top 20 in the world by QS World University Rankings and Top 40 globally by THE World University Rankings. A third university, [Singapore Management University (SMU)](/wiki/Singapore_Management_University), opened in 2000, is home to more than 7,000 students and comprises six Schools offering undergraduate, graduate, and PhD programmes in Business Management, Accountancy, Economics, Information Systems Management, Law and the Social Sciences. The University has an Office of Research, a number of institutes and centres of excellence, and provides public and customised programmes for working professionals through its Office of Executive and Professional Education. The government has planned the fourth autonomous university, [Singapore University of Technology and Design (SUTD)](/wiki/Singapore_University_of_Technology_and_Design), to meet the rising demand for university education. SUTD started its operations in April 2012. Its permanent campus at Changi was opened in early 2015. A fifth autonomous university [Singapore Institute of Technology (SIT)](/wiki/Singapore_Institute_of_Technology) was announced in 2009. The institution started in 2010 and is intended to provide an upgrading pathway for polytechnic and arts institution graduates. In 2017, [Singapore University of Social Sciences (SUSS)](/wiki/Singapore_University_of_Social_Sciences) was declared as the country's sixth autonomous university. The university was previously established in 2005 as SIM University by the SIM Group. Thereafter, it underwent restructuring and is currently under the ambit of the Ministry of Education. ### University of the Arts Singapore In March 2021, Minister for Education [Lawrence Wong](/wiki/Lawrence_Wong) announced that Singapore’s first arts university would be established in an alliance between the [Nanyang Academy of Fine Arts](/wiki/Nanyang_Academy_of_Fine_Arts) and [LASALLE College of the Arts](/wiki/LASALLE_College_of_the_Arts), in a system akin to the [University of the Arts, London](/wiki/University_of_the_Arts,_London). [University of the Arts Singapore](/wiki/University_of_the_Arts_Singapore) (UAS) was established in 2023 as a collegiate university with both colleges under the umbrella university and has been given degree-awarding powers independent of their previous foreign partners, where the long-distance degrees were issued through foreign universities. Singaporean citizens and permanent residents enrolled in the approved degree programmes at the university of the arts will pay subsidised fees like those at autonomous universities. The seventh local university in Singapore, UAS is a publicly-funded private university, similar to the [Singapore Management University](/wiki/Singapore_Management_University) and the now-defunct [SIM University](/wiki/SIM_University). It is the only arts university in Singapore with degree-conferring powers. Constituent colleges: - Nanyang Academy of Fine Arts - LASALLE College of the Arts ### Private Education Institutions Foreign universities that have set up campuses or centres of excellence in Singapore include [INSEAD](/wiki/INSEAD), [ESSEC](/wiki/ESSEC), [S P Jain School of Global Management](/wiki/S_P_Jain_School_of_Global_Management), [DigiPen Institute of Technology](/wiki/DigiPen_Institute_of_Technology) LSBF Singapore Campus, [Technische Universität München](/wiki/German_Institute_of_Science_and_Technology_-_TUM_Asia), [Sorbonne-Assas](/wiki/University_of_Paris_II_Panth%C3%A9on-Assas) International Law School, [Curtin Singapore](/wiki/Curtin_Singapore) and [James Cook University Singapore](/wiki/James_Cook_University_Singapore). Other foreign universities offer [external degree](/wiki/External_degree) programmes (EDPs) through private education institutions such as [Singapore Institute of Management](/wiki/Singapore_Institute_of_Management), [Management Development Institute of Singapore](/wiki/Management_Development_Institute_of_Singapore) and [PSB Academy](/wiki/PSB_Academy). Universities such as the [University of London](/wiki/University_of_London), RMIT University, [Southern Cross University](/wiki/Southern_Cross_University), [Queen Margaret University](/wiki/Queen_Margaret_University) & [Cardiff Metropolitan University](/wiki/Cardiff_Metropolitan_University) have established such external degree programmes in Singapore to provide local and foreign (in particular, Asian) students the opportunity to obtain a Western university education at a fraction of the cost it would take to study in Canada, the UK, the USA or Australia. ## International and private schools Because of its large expatriate community, Singapore is host to many [international schools](/wiki/List_of_international_schools_in_Singapore), currently numbering 80, across predominantly four main curricula groups: British, IB, American and Indian. Over half of these (44) are either UK curriculum based (specifically the curriculum of England and Wales), or a blend of UK (until 16 with the I/GCSE) and the International Baccalaureate (for post-16 study). The IB Diploma programme has gained global popularity in recent years, and Singapore has been susceptible to its charms. There are now 26 schools in Singapore offering the IB Diploma, and 10 schools offering what is seen by many as its alternative, the A Level. Singapore has not seen the international school growth as some of its city rivals, like Dubai, although 2020 sees the spark of competition with the arrival of Brighton College, The Perse School, One World International School (Mountbatten), Invictus International Centrium, and North London Collegiate School. COVID-19 issues aside, this will be welcome relief to parents (although not necessarily schools) where waiting lists for the top schools have, historically, been long - often measured in years. This has especially been the case in the country's \"top\" international schools, although given there are no independent inspections, being seen to be a top-tier school has been driven largely by reputation and word of mouth, that is what parents think are the \"best\" international schools, become the best schools as these are able to take on the best students - even if the majority of schools claim to be non-selective. International schools serve a largely expatriate audience, as much by necessity as choice given international and private schools in Singapore generally are not allowed to admit Singapore students without permission from the Ministry of Education. However, on 29 April 2004 the Ministry of Education permitted three new international schools to be set up without permission being needed to admit Singapore students. These schools must follow the compulsory policies set by the Ministry such as playing the [national anthem](/wiki/Majulah_Singapura) and taking the pledge every morning, as well as following the nation's policies on bilingualism. These schools – Anglo-Chinese School (International), [Hwa Chong International School](/wiki/Hwa_Chong_International_School) and [SJI International School](/wiki/SJI_International_School) – are private schools run by the boards of other locally renowned institutions. The school fees are 15 to 20 per cent lower than those of foreign international schools. Their intake includes students from countries such as [Malaysia](/wiki/Malaysia), [India](/wiki/India), [Indonesia](/wiki/Indonesia), [China](/wiki/China), [Taiwan](/wiki/Taiwan), [South Korea](/wiki/South_Korea), [Philippines](/wiki/Philippines), [Vietnam](/wiki/Vietnam), [Netherlands](/wiki/Netherlands), and the [United Kingdom](/wiki/United_Kingdom). Established under the Private Education Act, the [Committee for Private Education](/wiki/Committee_for_Private_Education) (CPE, also formerly the Council for Private Education) is a statutory board empowered with the legislative power to regulate the private education sector. In addition to its role as the sectoral regulator of private education institutions, the CPE facilitates capability development efforts to uplift standards in the local private education industry. On 20 May 2010, the CPE has registered the first batch of private education institutions (PEIs) under the Enhanced Registration Framework (ERF). Following the launch of the new private education regulatory regime on 21 December 2009, all PEIs within the regulatory scope of the Private Education Act are required to register with the CPE under the ERF. Under the Enhanced Registration Framework, private institutions must meet requirements relating to their managers, teachers, courses and examination boards. Out of 308 which applied, less than a third were given the stamp of approval and students are relieved that their school has made the mark. Only 63 ERF applications have been evaluated by the CPE, of which 36 PEIs like [MDIS](/wiki/Management_Development_Institute_of_Singapore), EASB, SDH Institute, SAA Global Education, Coleman College, STEi Institute etc. have been registered for a period of four years ERF, and 26 PEIs have been registered for one year. The registration period awarded to a PEI is dependent on its degree of compliance with the Private Education Regulations. In addition to the international day school, [Singapore's Japanese population](/wiki/Japanese_expatriates_in_Singapore) is served by a [weekend education programme](/wiki/Hoshuko), the Japanese Supplementary School Singapore (JSS; シンガポール日本語補習授業校 *Shingapōru Nihongo Hoshū Jugyō Kō*). ## Madrasahs In Singapore, madrasahs are full-time, religious institutions that offer a [pedagogical](/wiki/Pedagogy) mix of [Islamic religious education](/wiki/Islamic_studies) and [secular education](/wiki/Secular_education) in their [curricula](/wiki/Curriculum). There are currently six [madrasahs](/wiki/Madrasa) in Singapore offering primary to tertiary education, namely, [Aljunied Al-Islamiah](/wiki/Madrasah_Aljunied_Al-Islamiah), [Al-Irsyad Al-Islamiah](/wiki/Madrasah_Al-Irsyad_Al-Islamiah), [Al-Maarif Al-Islamiah](/wiki/Madrasah_Al-Maarif_Al-Islamiah), Alsagoff Al-Arabiah, [Al-Arabiah Al-Islamiah](/wiki/Madrasah_Al-Arabiah_Al-Islamiah), and Wak Tanjong Al-Islamiah. Four of them are [co-educational](/wiki/Mixed-sex_education), while the other two offer madrasah [education exclusively to girls](/wiki/Single-sex_education). Madrasah students take a range of Islamic religious subjects in addition to mainstream curriculum subjects and sit for the PSLE and GCE 'O' Levels like their peers. They can often be easily identified by their distinctive traditional Malay uniform, including the *[songkok](/wiki/Songkok)* for boys and *[tudung](/wiki/Tudung)* for girls, in stark contrast to national schools that prohibit such religious headgear. Madrasahs are deeply rooted in [Singapore's history](/wiki/History_of_Singapore), and prior to [Singapore's independence](/wiki/Independence_of_Singapore_Agreement_1965), had enjoyed a \"golden period\" in becoming the centre of Islamic education in the region by producing and attracting many of the prominent [Islamic religious scholars](/wiki/Ulama). But by the turn of the 21st century, madrasahs were subjected to numerous discussions on the national platform as to their purpose and relevance in contemporary society. There was also a new expectation from the Malay-Muslim community that madrasahs should provide not only religious education, but also academic skills like mathematics, science and English. Madrasahs were forced to adapt and implement sweeping reforms, especially in response to government policies such as the Compulsory Education Act. Today, madrasahs have improved significantly—but challenges pertaining to their funding, curricula and teaching methodologies remain largely unsolved till today. ## Private tuition Private tuition is a lucrative industry in Singapore, since many parents send their children for private tuition after school. A straw poll by *[The Straits Times](/wiki/The_Straits_Times)* newspaper in 2008 found that out of 100 students interviewed, only 3 students did not have any form of tuition. In 2010, the *[Shin Min Daily News](/wiki/Shin_Min_Daily_News)* estimated that there were around 540 tuition centres offering private tuition in Singapore. Due to their high demand, tuition centres are able to charge high fees for their services; they have an annual turnover of [SGD$](/wiki/Singapore_dollar)110.6 million in 2005. However, this industry is largely unregulated, though tuition centres are required to be registered with the Ministry of Education. There is no such requirement for individual private tutors. Despite its pervasiveness, private tuition remains a controversial subject in Singapore. Students generally attend tuition classes to improve their weak academic performance. Some parents send their children to such tuition because they are worried that their child would lag behind in class because their classmates have individual tuition themselves, or because they are worried that the teacher does not completely cover the syllabus required for national examinations. Teachers and schools allegedly encouraged weaker students to receive private tuition as well, though the Ministry of Education's official stance is that \"Teachers should not recommend tuition to students or parents as a form of learning support\". Some students who are doing well academically have had requested to have private tuition to further improve on their grades. On the other hand, some have criticised the over-reliance on private tuition, saying that students may not pay attention during lessons as they are able to fall back on their tuition classes later. Students may also be unable to find answers on their own, having relied on their tutors for answers during their school years. Some tuition centres reportedly do schoolwork on their students' behalf. Others have also criticised private tuition for taking up too much of students' free time. Due to the high cost of tuition, there are concerns that low-income families were unable to send their children for such classes. However, the government has partially subsidised private tuition at certain community bodies for children from low-income families. The official government stance on private tuition is that \"it understands parents want the best for their children and that it is their decision whether to engage tutors\". ## Education policies ### Meritocracy [Meritocracy](/wiki/Meritocracy) is a fundamental ideology in Singapore and a fundamental principle in the education system which aims to identify and groom bright young students for positions of leadership. The system places a great emphasis on academic performance in grading students and granting their admission to special programmes and universities, though this has raised concerns about breeding elitism. Academic grades are considered as objective measures of the students' ability and effort, irrespective of their social background. Having good academic credentials is seen as the most important factor for the students' career prospects in the job market, and their future economic status. Curricula are therefore closely tied to examinable topics, and the competitiveness of the system has led to a proliferation of \"*[ten-year series](/wiki/Ten_year_series)*\", which are compilation books of past examination papers that students use to prepare for examinations. ### Bilingualism (Mother Tongue) Bilingualism, or *mother tongue policy*, is a cornerstone of the Singapore education system. While English is the first language and the medium of instruction in schools, most students are required to take a \"Mother Tongue\" subject, which could be one of the three official languages: Standard Mandarin, Malay or Tamil. A non-Tamil Indian may choose to opt for Tamil or a non-official language such as [Bengali](/wiki/Bengali_language), [Gujarati](/wiki/Gujarati_language), [Hindi](/wiki/Hindi), [Punjabi](/wiki/Punjabi_language) or [Urdu](/wiki/Urdu). However, Chinese students from a non-Mandarin background, such as Cantonese speakers, must learn Mandarin, and students with Indonesian background must learn Malay. Non-Chinese, Malay or Indian students may choose to learn either one of these languages (Usually the Japanese, Koreans and Southeast Asians who are not from Malay or Indonesian origin will choose Chinese). Mother Tongue is a compulsory examinable subject at the Primary School Leaving Examination (PSLE) and the GCE \"N\", \"O\" and \"A\" level examinations. Students are required to achieve a certain level of proficiency in what the government considers their mother tongue as a pre-requisite for admission to local universities. Students returning from overseas may be exempted from this policy. The bilingual policy was first adopted in 1966. One of its primary objectives is to promote English as the common (and neutral) language among the [diverse ethnic groups in Singapore](/wiki/Demographics_of_Singapore). The designation of English as the *first language* is also intended to facilitate Singapore's integration into the world economy. In recognition of Singapore's linguistic and cultural pluralism, another stated objective of the bilingual policy is to educate students with their \"mother tongues\" so that they can learn about their culture, identify with their ethnic roots, and to preserve cultural traits and Asian values. Within the Chinese population, Mandarin is promoted as a common language and other Chinese dialects are discouraged, to better integrate the community. In 1979, the [Speak Mandarin Campaign](/wiki/Speak_Mandarin_Campaign) was launched to further advance this goal. ### Financial assistance Education policy in Singapore is designed to ensure that no child is disadvantaged because of their financial background. Therefore, school fees in public schools are heavily subsidised. There is no school fee for 6 years of compulsory education in primary school although students still need to pay standard miscellaneous fees of $6.50 per month. Moreover, schools may optionally charge second-tier miscellaneous fees of up to the maximum of $6.50 per month. The Ministry of Education established the Financial Assistance Scheme (FAS) to provide financial assistance for education to low income families with gross household income of SGD$2,500 or a per capita income of less than SGD$625.00. Students eligible for FAS receive a full waiver of miscellaneous fees, and partial subsidy on national examination fees. They may also enjoy full or partial fee subsidy if they are in Independent Schools. Each year, the Edusave Merit Bursary (EMB) is given out to about 40,000 students, who are from lower-middle and low-income families and have good academic performance in their schools. Individual schools also have an \"Opportunity Fund\" to provide for their own needy students. In addition to these, there are many other assistance schemes from either the government or welfare organisations to help students cope with finances during their studies. Heavy subsidies are given to full-time tertiary students in the form of tuition grants ranging from $10,000 to $100,000 per year, depending on their nationality and course of study. For Singapore citizens, the grant is given unconditionally and automatically. Foreign applicants, including permanent residents, are required to work in a Singapore firm for three years upon graduation. ### SkillsFuture There are four key objectives of the SkillsFuture initiative: 1. Helping individuals make well-informed choices in education, training and careers. 2. Developing an integrated, high-quality system of education and training that responds to constantly evolving industry needs. 3. Promoting employer recognition and career development based on skills and mastery. 4. Fostering a culture that supports and celebrates lifelong learning. The SkillsFuture Earn and Learn Programme allows vocational graduates to be placed in jobs that allow them to receive a salary while engaging in structured on-the-job training. As of 2016, there were a total of 40 Earn and Learn Programmes in Singapore. ## Statistics ### Key statistics Government budget for educationSGD 13.2bn (2022)Ratio of students to teaching staff (Primary)14.8 pupils (2022)Ratio of students to teaching staff (Secondary)12.4 pupils (2022)Enrollment ratio, aged 6–20 years87.4% (2004)Literacy rate (aged 15 years and above)97.6% (2021)Mean years of schooling (aged 25 years and above)11.7 years (2022) ### Education qualification of population Residents aged 25 years and over by highest qualification attainedHighest qualification attainedPopulation (2022)Percentage (2022)**Total**3,085,300100.0%Below Secondary646,30020.9%Secondary – GCE 'N' & 'O' levels492,20016.0%Post Secondary (Non-Tertiary)308,00010.0%Diploma & Professional Qualification521,90016.9%University – Degree, Masters & PHD1,116,90036.2% ### Schools and Enrolment Type of SchoolNumber of schools (2022)Kindergarten502 (2012)PrimaryGovernment139Government-aided41SecondaryGovernment101Government-aided28Independent2Specialised Independent1Specialised4Mixed Level[b]Government4Government-aided3Independent6Specialised Independent3Junior College Centralised InstituteGovernment7Government-Aided4Independent0Type of SchoolEnrollment (2022)Number of teachers (2022)Primary228,09315,491Secondary143,86511,430Mixed Level[c]35,6092,858Junior College Centralised Institute14,9881,332 ## International comparisons **International educational scores (1997)** (13-year-old's average score, [TIMSS](/wiki/TIMSS) Third International Math and Science Study, 1997)**Countries:** (sample)**Global** **rank****Maths****Science**ScoreRankScoreRank[Singapore](/wiki/Singapore)**1**64316071[Japan](/wiki/Japan)**2**60535713[South Korea](/wiki/South_Korea)**3**60725654[Czech Republic](/wiki/Czech_Republic)**4**56465742[England](/wiki/England)**18**5062555210[Thailand](/wiki/Thailand)**20**5222052521[Germany](/wiki/Germany)**22**5092353119[France](/wiki/France)**23**5381349828[United States](/wiki/United_States)**24**5002853417Source: 1997 [TIMSS](/wiki/TIMSS), in [The Economist](/wiki/The_Economist), March 29th 1997. Singapore students took first place in the 1995, 1999 and 2003 [TIMSS](/wiki/TIMSS) Trends in International Mathematics and Science Study. They used Singapore Math Primary Mathematics series. [The national textbooks](/wiki/Singapore_math) have been adapted into a series which has been successfully marketed in North America as a rival to [Saxon math](/wiki/Saxon_math) and an alternative to controversial [reform mathematics](/wiki/Reform_mathematics) curricula, which many parents complained moved too far away from the sort of traditional basic skills instruction exemplified by Singapore's national curriculum. ## Assessment Critics of the education system argue that the education in Singapore is too [specialised](/wiki/Academic_specialization), rigid, and [elitist](/wiki/Academic_elitism). Often, these criticisms state that there is little emphasis on [creative](/wiki/Creativity) thinking.[*citation needed*] Those defending the current education system point out that Singaporean students have regularly ranked near the top when competing in international science and mathematics competitions and [assessments](/wiki/Educational_assessment). Critics, however, argue this is more an indication of the institution's use of [rote learning](/wiki/Rote_learning) to prepare for competition or examination than of students' critical thinking skills. In response to such concerns the Ministry of Education has recently discussed a greater focus on creative and critical thinking, and on learning for lifelong skills rather than simply teaching students to excel in examinations. Although some efforts of these sorts have been made, many Singaporean children continue to face high pressure by parents and teachers to do well in studies.[*citation needed*] Supporters of the system assert that the provision of differentiated curricula according to streams since the late 1970s has allowed students with different abilities and learning styles to develop and sustain an interest in their studies. This ability-driven education has since been a key feature behind Singapore's success in education, and was responsible for bringing drop-out rates down sharply.[*citation needed*] In recent years, while streaming still exists, various refinements to the policy have been made. There is now greater flexibility for students to cross over different streams or take subjects in other streams, which alleviates somewhat the stigma attached to being in any single stream.[*citation needed*] Furthermore, the government is now starting to experiment with ability-banding in other ways – such as subject-based banding in Secondary Schools instead of banding by overall academic performance.[*citation needed*] - Singapore portal - Education portal - [Education by country](/wiki/Education_by_country) - [Education in Hong Kong](/wiki/Education_in_Hong_Kong) - [List of schools in Singapore](/wiki/List_of_schools_in_Singapore) - [List of medical schools in Singapore](/wiki/Singapore_Medical_Association#Medical) - [List of universities in Singapore](/wiki/List_of_universities_in_Singapore) ## Notes This article incorporates text from a [free content](/wiki/Free_content) work. Licensed under CC BY-SA. Text taken from *Lifelong Learning in Transformation: Promising Practices in Southeast Asia​*, 1–62, Yorozu, Rika, UNESCO. UNESCO. Library resources about **Education in Singapore** - Resources in your library - Resources in other libraries - Ministry of Education, Singapore\n",
  "language": "en",
  "processed_at": "2026-01-12T10:09:42.624041",
  "title": "Education in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Education_in_Singapore"
}