{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:09:46.387468"
  },
  "content": "English businessman **Edward Boustead** (1800–1888) was an English businessman and philanthropist, who founded [Boustead & Co](/wiki/Boustead_%26_Co) and played an active role in the development of Singapore as a business and trading centre. Boustead was born in Irthington, Cumberland, England. He was the great-grandfather of actor [David Niven](/wiki/David_Niven). ## Beginnings of Boustead & Co In 1828, Boustead arrived in Singapore on board the British ship *Hindustan*. In the same year, he established a trading company, Boustead & Co. Boustead & Co specialised in import and export, offering goods such as banca tin, spices, saps, rattan, medicinal herbs, silk and tea widely available in [South East Asia](/wiki/South_East_Asia) in exchange for Western products like cloth, oil and machinery. Boustead commissioned Irish civil architect, [George Drumgoole Coleman](/wiki/George_Drumgoole_Coleman) to design his company's headquarters alongside the [Singapore River](/wiki/Singapore_River). The warehouse was known as \"the house of seven and twenty pillars\", located around the corner from High Street. In 1834, Boustead partnered with German-born merchant, [Gustav Christian Schwabe](/wiki/Gustav_Christian_Schwabe) in the Singapore company. Schwabe and his cousin established Sykes Schwabe & Co in Liverpool. The Liverpool partner would export products like textiles, biscuits, brandies and steel to the East, while the Singapore partner would trade with Eastern produce such as coffee and spices. The freedom of port made Singapore an ideal market for trading among imported manufacturers. Import of Western commodities such as textiles and machinery had to be balanced with exports of Eastern produce such as copra, coconut, pepper and tapioca. Boustead & Co had a \"Balance of Trade\", where demand for goods from the East had to be balanced with demand for goods from the West. Singapore merchant, [Tan Kim Seng](/wiki/Tan_Kim_Seng), was a middleman in Boustead's trading activities. He was also a good friend of Boustead. Tan amassed small shipments of produce from local traders for Boustead, who would then ship the produce to the West. With a wide trading network, trade credit and finance became increasingly important to banks, merchants, manufacturers and traders. Edward Boustead actively contributed to the Singapore's trading activities and economy. Boustead & Co was the first agent for [Hongkong and Shanghai Bank](/wiki/The_Hongkong_and_Shanghai_Banking_Corporation) in Singapore, offering banking facilities to businesses. Brokers and sellers could draw a specific percentage of advances against the value of their goods stored in the Boustead warehouse. Such financing was called \"trust receipts\", where the merchant would hold the goods in trust for the banks. In 1850, Boustead also set up a London office, Edward Boustead & Co, to oversee the other offices in Hong Kong, Manila, Shanghai and Singapore. Between 1863 and 1877 Edward Boustead owned shares in vessels managed by Killick Martin & Company. Apart from the three main partners, [James Killick](/wiki/James_Killick), [James Henry Martin](/wiki/James_Henry_Martin) and David William Ritchie, the next principal shareholder was Edward Boustead, who held shares in 11 vessels. Two of Boustead's partners in Boustead & Company, William Wardrop Shaw and Jasper Young, also held shares in some of the vessels. Jasper Young owned 40 shares in *[Mabel Young](/wiki/Mabel_Young_(Barque))* presumably named after his wife or daughter. During the late 1880s, Boustead & Co took advantage of the introduction of the rubber tree to Malaysia and eventually became a leading rubber plantation manager and owner of 49 rubber plantations with a total planted area of 141,629 acres. In 1892 Boustead & Co handled the first shipment of bulk oil to Penang and shortly after this the Shell Transport and Trading Company was formed with Isaac Henderson acting as one of its original directors. Boustead represented and operated on Shell's behalf in Penang until 1920 when Shell opened its own branch. By 1899, Singapore had become the world's main exporter of tin. Boustead & Co played a leading role as promoter and investor in the tin smelting facility on Pulau Brani, constructed by the [Straits Trading Company](/wiki/Straits_Trading_Company). From that point forward, Straits Tin became one of the leading businesses of Boustead & Co. Over the decades, the excellent reputation of Boustead & Co allowed it to attract some of the world's most famous brands to give it agency rights in Singapore and around the region. Some of the famous brand names that became synonymous with Boustead were [Cadbury's](/wiki/Cadbury%27s), [Nestle](/wiki/Nestle), [Del Monte](/wiki/Del_Monte_Foods), [Gillette](/wiki/Gillette_(brand)), [Procter & Gamble](/wiki/Procter_%26_Gamble), [Johnnie Walker](/wiki/Johnnie_Walker), [Hennessy](/wiki/Hennessy), [Moet & Chandon](/wiki/Moet_%26_Chandon), [Nissan](/wiki/Nissan), [Suzuki](/wiki/Suzuki) and Thomas Cook. After his death in 1888, Boustead's associates took over the business. Boustead Plc (formerly known as Taiping Rubber Plantations Limited) was founded in 1910 and eventually listed as Boustead Plc on the London Stock Exchange. Having survived World War I, Boustead & Co played a significant role in the rise of Singapore as the world's largest port, with a booming business in cargo, freight handling, insurance and ship services. Boustead & Co represented over 20 major shipping lines and numerous insurance agencies including the renowned Lloyd's, which Boustead represented for more than one century. After World War II, Malaysia declared independence from the British in August 1957 and Singapore declared independence from Malaysia in 1965. This saw Boustead & Co split into three entities, Boustead plc in London, Boustead Holdings Berhad in Malaysia and Boustead Singapore Limited which listed on the [Singapore Stock Exchange](/wiki/Singapore_Exchange) on 17 October 1975. Boustead Limited formed out of Boustead plc and was renamed later Boustead & Co Limited, which is the holding company for financial services, including corporate finance, principal investing and asset management. ## Role in development of Singapore Boustead was a shareholder in the [Tanjong Pagar Dock Company](/wiki/Tanjong_Pagar_Dock_Company) (now known as the [Port of Singapore Authority](/wiki/Port_of_Singapore_Authority)). He was also a key investor in the [Straits Trading Company](/wiki/Straits_Trading_Company), the first tin foundry in Singapore. A pioneer in Singapore's newspaper industry, Boustead was a co-founder of the *[Singapore Free Press](/wiki/Singapore_Free_Press)* with architect [George Drumgoole Coleman](/wiki/George_Drumgoole_Coleman) and [William Napier](/wiki/William_Napier_(lawyer)). The newspaper was the forerunner of [The Straits Times](/wiki/The_Straits_Times). An enterprising businessman in the trading sector, Boustead was one of the founding members of the Singapore Chamber of Commerce in 1837. The institution promoted trade in Singapore through establishing shipping, protecting trade on behalf of merchants and encouraging trade activities among merchants. Boustead was active in community activities as well. He started the Horticultural Society, which supported the cultivation of pepper, cotton, sugar and other tropical produce. The Horticultural Society was responsible for pioneering the [Singapore Botanic Gardens](/wiki/Singapore_Botanic_Gardens). In 1829, Boustead started the first Singapore Club, which was called the Billiards Club. Edward Boustead's house, designed and built by George Drumgoole Coleman, was one of the exclusive villas on Singapore's [Esplanade](/wiki/Esplanade,_Singapore). It was later converted into a hotel, renamed the Grand Hotel de l'Europe. The site where Boustead's villa stood is now occupied by the old Supreme Court. ## Philanthropy and Social Impact Investments Many sailors were left homeless when they were sick or too old to work. Boustead was an altruistic man and he felt compassion for these sailors. He built the [Boustead Institute](/wiki/Boustead_Institute), situated at [Tanjong Pagar](/wiki/Tanjong_Pagar). The building came to be known as the Sailor's Home, providing accommodation for sailors of ships visiting the port as well. Boustead also donated charitably to hospitals, schools and churches. Some of these buildings included [Raffles Institution](/wiki/Raffles_Institution), [Saint Joseph's Institution](/wiki/Saint_Joseph%27s_Institution) and the [Cathedral of the Good Shepherd](/wiki/Cathedral_of_the_Good_Shepherd). In 2014 Boustead & Co co-founded Noble Tree Property Investment, a socially minded property company that develops, owns, lets and sells affordable housing and specialty supported housing developments across the United Kingdom. In 2015 Boustead & Co founded Boustead Asset Management Limited in Mauritius to serve as the investment advisor to Boustead Investment Fund, a social [impact investment](/wiki/Impact_investment) fund with a focus on investing in socially conscious investments. The asset manager and fund are regulated by the Financial Services Commission in Mauritius and were granted a Collective Investment Scheme Manager Licence and Category 1 Global Business Licence by the Financial Services Commission. ## Family Boustead had a daughter, Helen Boustead, who was born in 1857. Helen Boustead married William Niven and the couple gave birth to a son, William Edward Graham Niven. William Edward Graham Niven then married socialite Henrietta Julia Degacher. Their first child was James David Graham Niven, better known as [David Niven](/wiki/David_Niven). Niven's film career spanned over 90 films, and he was best known for his roles in Around the World in 80 Days (1956), The Pink Panther (1963) and Casino Royale (1967). There has been some dispute over Niven's paternity, with one biographer claiming that Niven himself believed his biological father to be Sir Thomas Comyn-Platt, whom his mother later remarried after her first husband was killed on active service in 1915. - Boustead and Co Website - Boustead Holdings Berhad Website - Boustead Singapore Limited Website\n",
  "language": "en",
  "processed_at": "2026-01-12T10:09:46.383520",
  "title": "Edward Boustead",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Edward_Boustead"
}