{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:09:53.100490"
  },
  "content": "Social and business club The **Ee Hoe Hean Club** ([simplified Chinese](/wiki/Simplified_Chinese_characters): 怡和轩俱乐部; [traditional Chinese](/wiki/Traditional_Chinese_characters): 怡和軒俱樂部; [pinyin](/wiki/Pinyin): *Yíhéxuān jùlèbù*), founded in 1895 and located at [Bukit Pasoh Road](/wiki/Bukit_Pasoh_Road) in [Chinatown](/wiki/Chinatown,_Singapore), was a millionaires' club in [Singapore](/wiki/Singapore). Besides functioning as a social and business club, members of the club were actively involved in the political development of [China](/wiki/China) in the early 20th century. The club supported the 1911 [Xinhai Revolution](/wiki/Xinhai_Revolution) which overthrew the [Qing Dynasty](/wiki/Qing_Dynasty), and later the establishment of the [Republic of China](/wiki/Republic_of_China_(1912%E2%80%931949)). During [World War II](/wiki/World_War_II), it was the headquarters of the anti-Japanese China Salvation Movement in [Southeast Asia](/wiki/Southeast_Asia) from 1937 to 1942. On 18 October 1995, the club was gazetted as a Heritage Site by the [National Heritage Board](/wiki/National_Heritage_Board_(Singapore)) of Singapore. ## History Co-founded in 1895 by [Lim Nee Soon](/wiki/Lim_Nee_Soon), [Gan Eng Seng](/wiki/Gan_Eng_Seng) and [Lim Boon Keng](/wiki/Lim_Boon_Keng), the three-storey high Ee Hoe Hean Club was originally located on [Duxton Hill](/wiki/Duxton_Hill) but moved to 38 [Club Street](/wiki/Club_Street) in 1911. It subsequently moved to Bukit Pasoh Road in 1925. The club was a social-cum-business club where like-minded Chinese businessmen could mingle and exchange ideas. Members such as Teo Eng Hock, Tan Chor Nam and Lim Nee Soon were actively involved in the [Xinhai Revolution](/wiki/Xinhai_Revolution) and later the establishment of the [Republic of China](/wiki/Republic_of_China_(1912%E2%80%931949)). Among the more famous visitors to its clubhouse included [Sun Yat-sen](/wiki/Sun_Yat-sen) and [Jawaharlal Nehru](/wiki/Jawaharlal_Nehru). In 1923, when Chinese businessman, community leader and philanthropist, [Tan Kah Kee](/wiki/Tan_Kah_Kee), known as the *Rubber King* of Singapore and [Malaya](/wiki/British_Malaya), assumed chairmanship of the club, its focus shifted from being a purely social and business club to one that was politically active. Tan brought to the club his political awareness of Chinese matters. In 1928, following a public outrage over a massacre at [Jinan](/wiki/Jinan) (known as the *[Jinan Incident](/wiki/Jinan_Incident)*) in [Shandong](/wiki/Shandong) in which more than 5,000 Chinese soldiers and civilians were slaughtered by the Japanese, the club set up the Shandong Relief Fund. Its purpose was to raise funds for China, to create awareness amongst the Chinese about the Japanese invasion of China, and to encourage the Chinese to boycott Japanese goods and services. The Chinese community contributed a total of S$1.34 million within a year of its inception. In response to the Japanese invasion of China in 1937, the China Salvation Movement was born, with its Southeast Asian headquarters located at the club until 1942, when the Japanese invaded Singapore. ### Post-war years After the [Japanese occupation of Singapore](/wiki/Japanese_occupation_of_Singapore), the club's anti-Japanese agenda became redundant and it reverted being a club for social and business interaction once again. Its members were later active in the struggle for citizenship, voters' registration campaign and other philanthropic activities. After Singapore's independence in 1965, it became a focal point where local Chinese businessmen socialised and forged ties, and it continued to play an active role in community services such as charity work and giving public talks. Among its 200-odd members today are luminaries of the Chinese business community such as the founder of the [Overseas Union Bank](/wiki/Overseas_Union_Bank), [Lien Ying Chow](/wiki/Lien_Ying_Chow), and [United Overseas Bank](/wiki/United_Overseas_Bank) chairman [Wee Cho Yaw](/wiki/Wee_Cho_Yaw). It is still an all men's club – the youngest members are mainly in their 50s and membership is by invitation only. ### Re-opening In 2006, in collaboration with the Tan Kah Kee Foundation, the club underwent a S$2.5 million (US$1.85 million) reconstruction works in order to preserve the century-old historic building. On 9 November 2008, the club was officially reopened by Finance Minister [Tharman Shanmugaratnam](/wiki/Tharman_Shanmugaratnam) with a new 2,000-square-foot (190 m2) memorial hall to honour Tan Kah Kee and other early Chinese community leaders. The new hall is named *Xian Xian Guan* (The Pioneers' Memorial Hall) and is located on the club's ground floor. It contains exhibits such as a wax figure of Tan Kah Kee, old photographs, and interactive multimedia facilities. The second floor is used for social functions, and the third floor continues to house the social club. The memorial hall is open by appointment to the public, in particular to schools and tourist groups from China and Taiwan. The club house and other places related to Tan are included as part of the heritage trails and guided tours around Singapore. - Singapore portal - [Force 136](/wiki/Force_136) - [Lim Bo Seng](/wiki/Lim_Bo_Seng) - [Battle of Singapore](/wiki/Battle_of_Singapore) ## Bibliography 01°16′46.45″N 103°50′25.07″E﻿ / ﻿1.2795694°N 103.8402972°E﻿ / 1.2795694; 103.8402972\n",
  "language": "en",
  "processed_at": "2026-01-12T10:09:53.099966",
  "title": "Ee Hoe Hean Club",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Ee_Hoe_Hean_Club"
}