{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:10:06.876262"
  },
  "content": "This article is part of a series on[Politics of Singapore](/wiki/Politics_of_Singapore)[Constitution](/wiki/Constitution_of_Singapore) - [Law](/wiki/Law_of_Singapore) - [Human rights](/wiki/Human_rights_in_Singapore) [Legislature](/wiki/Parliament_of_Singapore) - **[Parliament](/wiki/Parliament_of_Singapore)** - [Speaker](/wiki/Speaker_of_the_Parliament_of_Singapore) [Seah Kian Peng](/wiki/Seah_Kian_Peng) ([PAP](/wiki/People%27s_Action_Party)) - [Leader of the House](/wiki/Leader_of_the_House_(Singapore)) [Indranee Rajah](/wiki/Indranee_Rajah) ([PAP](/wiki/People%27s_Action_Party)) - [Leader of the Opposition](/wiki/Leader_of_the_Opposition_(Singapore)) [Pritam Singh](/wiki/Pritam_Singh_(Singaporean_politician)) ([WP](/wiki/Workers%27_Party_(Singapore))) - [14th Parliament](/wiki/14th_Parliament_of_Singapore) - [Constituencies](/wiki/Constituencies_of_Singapore) [Executive](/wiki/Government_of_Singapore#Composition) - **[President of Singapore](/wiki/President_of_Singapore)** ([list](/wiki/List_of_presidents_of_Singapore)) - [Tharman Shanmugaratnam](/wiki/Tharman_Shanmugaratnam) ([I](/wiki/Independent_politician)) - **[Prime Minister of Singapore](/wiki/Prime_Minister_of_Singapore)** - [Lawrence Wong](/wiki/Lawrence_Wong) ([PAP](/wiki/People%27s_Action_Party)) - [Cabinet](/wiki/Cabinet_of_Singapore) - [Ministries](/wiki/Organisation_of_the_Government_of_Singapore) - [The Reserves](/wiki/Reserves_of_the_Government_of_Singapore) [Judiciary](/wiki/Judicial_system_of_Singapore) - **[Supreme Court of Singapore](/wiki/Supreme_Court_of_Singapore)** - [Chief Justice](/wiki/Chief_Justice_of_Singapore) [Sundaresh Menon](/wiki/Sundaresh_Menon) - **[Court of Appeal](/wiki/Court_of_Appeal_of_Singapore)** - [Prakash](/wiki/Judith_Prakash) - [Tay](/wiki/Tay_Yong_Kwang) - [Chong](/wiki/Steven_Chong) - [Ang](/wiki/Belinda_Ang) - **[High Court](/wiki/High_Court_of_Singapore)** - [State Courts](/wiki/State_Courts_of_Singapore) Elections - [Presidential elections](/wiki/Presidential_elections_in_Singapore) - [General elections](/wiki/General_elections_in_Singapore) Singapore portal - [Other countries](/wiki/Outline_of_political_science#Politics_by_region) - v - t - e **Elections in Singapore** comprise two types: [parliamentary](/wiki/General_elections_in_Singapore) and [presidential](/wiki/Presidential_elections_in_Singapore) elections. Under the [Constitution of Singapore](/wiki/Constitution_of_Singapore), a general election must be held within three months of the dissolution of Parliament, which has a maximum term of five years from the date of its first sitting. Presidential elections are held every six years. All elections in Singapore operate under the [first-past-the-post voting](/wiki/First-past-the-post_voting) (FPTP) system. Singapore employs an [official sample count system](/wiki/Sampling_(statistics)) to provide early indications of election outcomes. At each polling station, a counting assistant randomly selects 100 ballots, which are then tallied to produce a mini-sample. These samples are aggregated and weighted according to the number of votes cast at each station to generate constituency-level projections. Based on simple random sampling, the estimates typically achieve a 95% confidence level with a margin of error of 4–5%. This system is designed to offer a statistically reliable and timely snapshot of the likely results shortly after the close of polls. In contrast, countries such as the United States, United Kingdom and Australia rely on the progressive counting and real-time reporting of actual vote returns from precincts or count centres. While this approach offers greater transparency at a granular level, it generally results in slower reporting compared to Singapore's sample-based method. Unlike many other countries where elections are administered by independent electoral commissions, elections in Singapore are conducted by the [Elections Department Singapore](/wiki/Elections_Department_Singapore) (ELD), which is a [department](/wiki/Government_department) under the [Prime Minister's Office](/wiki/Prime_Minister%27s_Office_(Singapore)) (PMO) of the [Government of Singapore](/wiki/Government_of_Singapore). On polling day during elections, voting takes place from 08:00 to 20:00 [SST](/wiki/Singapore_Standard_Time) (UTC+08:00). Sample count results are typically released by 22:30, with final results announced by the Returning Officer by approximately 03:00 the following morning. Victory parades by elected candidates in their respective constituencies customarily commence at 08:30 later that day. The last presidential election was held in (/wiki/2023_Singaporean_presidential_election), which was won by [Tharman Shanmugaratnam](/wiki/Tharman_Shanmugaratnam) with 70.41% of the vote. The last general election was held in (/wiki/2025_Singaporean_general_election), which elected 97 seats to the [unicameral](/wiki/Unicameral_legislature) [Parliament of Singapore](/wiki/Parliament_of_Singapore). Since the [1959 Singaporean general election](/wiki/1959_Singaporean_general_election), the [People's Action Party](/wiki/People%27s_Action_Party) (PAP) has maintained a dominant position, consistently securing a [supermajority](/wiki/Supermajority) of seats and forming the government in every successive general election. ## Parliamentary elections ### Political climate #### Dominance of the People's Action Party (1965–1981) From Singapore's independence in 1965 until 1981, the [People's Action Party](/wiki/People%27s_Action_Party) (PAP) has secured every seat in Parliament across successive general elections, resulting in a legislature devoid of elected opposition members for nearly two decades. During this period, numerous opposition politicians and trade unionists were detained without trial under the [Internal Security Act](/wiki/Internal_Security_Act_(Singapore)) (ISA). Notable figures such as [Lim Chin Siong](/wiki/Lim_Chin_Siong), [Said Zahari](/wiki/Said_Zahari), [Lim Hock Siew](/wiki/Lim_Hock_Siew) and [Chia Thye Poh](/wiki/Chia_Thye_Poh) were among those detained, accused of involvement in subversive [communist](/wiki/Communist) activities as part of the climate of the [Cold War](/wiki/Cold_War). Some individuals, including opposition candidates declared bankrupt or convicted of criminal offenses, were rendered ineligible to contest elections. Social commentators have argued that such measures contributed to a climate of fear and suppressed dissent in Singapore's political scene. #### Opposition representation and electoral reforms (1980s–1990s) The political landscape began to shift in the 1980s. In 1981, [J. B. Jeyaretnam](/wiki/J._B._Jeyaretnam) of the [Workers' Party](/wiki/Workers%27_Party_(Singapore)) (WP) won a [by-election in Anson](/wiki/1981_Anson_by-election), becoming the first elected opposition MP since independence. He was followed by [Chiam See Tong](/wiki/Chiam_See_Tong) of the [Singapore Democratic Party](/wiki/Singapore_Democratic_Party) (SDP) in 1984, further breaking the PAP's parliamentary monopoly although retaining its supermajority. To institutionalise broader representation, the PAP government introduced two key schemes: the [Non-Constituency Member of Parliament](/wiki/Non-Constituency_Member_of_Parliament) (NCMP) scheme in 1984, which granted parliamentary seats to the best-performing unelected opposition candidates, and the [Nominated Member of Parliament](/wiki/Nominated_Member_of_Parliament) (NMP) scheme in 1990, allowing appointed nonpartisan individuals to contribute to parliamentary debate. The NCMP scheme has evolved over time, with its seat allocation increasing from three in its early years to nine in the 2010s, and later to twelve from the [2020 general election](/wiki/2020_Singaporean_general_election) onwards. Electoral reforms continued with the introduction of the [Group Representation Constituency](/wiki/Group_Representation_Constituency) (GRC) system in 1988. Under this system, candidates contest in teams of three to six, and each team must include at least one member from a [recognised minority group](/wiki/Demographics_of_Singapore), in order to ensure ethnic representation in Parliament. The GRC model also places [town council](/wiki/Town_Council_(Singapore)) management under the purview of the elected MPs. However, critics argue that GRCs make it more difficult for opposition parties to contest, as they must field entire teams, often including minority candidates, and compete in larger constituencies. Some GRCs have seen repeated walkovers where PAP teams were elected unopposed. Observers and analysts have also described the system as a form of [gerrymandering](/wiki/Gerrymandering), limiting the opposition's electoral prospects. #### Contemporary political landscape The delineation of electoral boundaries is overseen by the ELD, which is part of the executive branch under the [Prime Minister's Office](/wiki/Prime_Minister%27s_Office_(Singapore)) (PMO), rather than an independent agency. The ELD does not publicly disclose detailed justifications for changes to electoral boundaries, citing general reasons such as population changes and the need to balance electorate sizes. This process has been criticised for a lack of transparency and perceived partisanship, particularly when constituencies with significant opposition support and narrow victories for the PAP, such as [Cheng San GRC](/wiki/Cheng_San_GRC) and [Eunos GRC](/wiki/Eunos_GRC), were redrawn or dissolved in subsequent elections. Similarly, single-member constituencies (SMCs), like [Bukit Batok SMC](/wiki/Bukit_Batok_SMC) and [Yuhua SMC](/wiki/Yuhua_SMC), which saw close contests, were previously absorbed into GRCs, only to be later restored. Despite ongoing criticisms of electoral engineering, international observers such as [Freedom House](/wiki/Freedom_House) have assessed Singapore's elections as free from [electoral fraud](/wiki/Electoral_fraud), including vote tampering or ballot rigging. However, these elections are conducted within a tightly controlled political environment that raises broader concerns about electoral fairness. Civil rights monitors have highlighted systemic issues such as the lack of an independent elections commission, the significant influence of the ruling PAP over state institutions and restrictions on opposition activities. In particular, media bias is frequently cited, with mainstream media outlets such as [Mediacorp](/wiki/Mediacorp) and [SPH Media Trust](/wiki/SPH_Media_Trust), which are owned or closely aligned with government-linked entities, providing disproportionately favorable coverage to the PAP. Opposition parties often face challenges in gaining equal airtime, and are subject to strict defamation and campaign finance laws, which critics argue are selectively enforced. These constraints, coupled with the PAP's longstanding dominance and its access to extensive state resources, create an uneven playing field. As a result, while elections are procedurally sound in terms of voting integrity, the broader political context limits genuine competition and hinders the development of a pluralistic democracy. ### Latest general election A general election was last called on 15 April 2025, and was held in 3 May that year. The PAP won 87 out of the 97 seats with 65.57% of the popular vote, while the WP won the remaining 10 seats. PartyVotes%+/–Seats+/–[People's Action Party](/wiki/People%27s_Action_Party)1,570,80365.57+4.3587+4[Workers' Party](/wiki/Workers%27_Party_(Singapore))359,16114.99+3.7712+2[Progress Singapore Party](/wiki/Progress_Singapore_Party)117,0054.88−5.300–2[Red Dot United](/wiki/Red_Dot_United)94,9553.96+2.7100[Singapore Democratic Party](/wiki/Singapore_Democratic_Party)89,0533.72−0.7300[People's Alliance for Reform](/wiki/People%27s_Alliance_for_Reform)60,2072.51New0New[Singapore Democratic Alliance](/wiki/Singapore_Democratic_Alliance)29,2131.22−0.2700[Singapore People's Party](/wiki/Singapore_People%27s_Party)28,2051.18−0.3400[Singapore United Party](/wiki/Singapore_United_Party)15,8740.66New0New[People's Power Party](/wiki/People%27s_Power_Party_(Singapore))15,5250.65−0.3500[National Solidarity Party](/wiki/National_Solidarity_Party_(Singapore))3,1270.13−3.6200Independents12,5370.52+0.4900Total2,395,665100.00–99+4Valid votes2,395,66598.24Invalid/blank votes42,9451.76Total votes2,438,610100.00Registered voters/turnout2,627,02692.83Source: ELD[a] ## Presidential elections Presidential elections have been held since 1993. Under the \"Presidential Elections Act\", to run for president, one must obtain a \"[Certificate of Eligibility](/wiki/Certificate_of_Eligibility)\" from the Presidential Elections Committee. These conditions are: - Be a [citizen of Singapore](/wiki/Singaporean_nationality_law). - Be at least 45 years of age. - Be a registered voter. - Be a resident in Singapore at the date of their nomination for election and a resident for periods amounting in the aggregate to not less than ten years prior to that date. - Not be subject to any of the following disqualifications: (a) being and having been found or declared to be of unsound mind;(b) being an undischarged bankrupt;(c) holding an office of profit;(d) having been nominated for election to Parliament or the office of President or having acted as election agent to a person so nominated, failing to lodge any return of election expenses required by law within the time and in the manner so required;(e) having been convicted of an offence by a court of law in Singapore or Malaysia and sentenced to imprisonment for a term of not less than one year or to a fine of not less than [S$](/wiki/Singapore_dollar)2,000 and having not received a free pardon, provided that where the conviction is by a court of law in Malaysia, the person shall not be disqualified unless the offence is also one which, had it been committed in Singapore, would have been punishable by a court of law in Singapore;(f) having voluntarily acquired the citizenship of, or exercised rights of citizenship in, a foreign country, or having made a declaration of allegiance to a foreign country;(g) being disqualified under any law relating to offences in connection with elections to Parliament or the office of President by reason of having been convicted of such an offence or having in proceedings relating to such an election been proved guilty of an act constituting such an offence. - Be a person of integrity, good character and reputation. - Not be a member of any [political party](/wiki/List_of_political_parties_in_Singapore) on the date of nomination for election. - Have served for a at least three years in office — - as [Minister](/wiki/Cabinet_of_Singapore#Responsibilities_of_Ministers), [Chief Justice](/wiki/Chief_Justice_of_Singapore), [Speaker](/wiki/Speaker_of_the_Parliament_of_Singapore), [Attorney-General](/wiki/Attorney-General_of_Singapore), Chairman of the [Public Service Commission](/wiki/Public_Service_Commission_(Singapore)), Auditor-General, Accountant-General or [Permanent Secretary](/wiki/Permanent_Secretary); - as [chief executive officer](/wiki/Chief_executive_officer) (CEO) of a key statutory board or government company: the [Central Provident Fund Board](/wiki/Central_Provident_Fund_Board), the [Housing and Development Board](/wiki/Housing_and_Development_Board), the [Jurong Town Corporation](/wiki/JTC_Corporation), the [Monetary Authority of Singapore](/wiki/Monetary_Authority_of_Singapore), [Temasek Holdings](/wiki/Temasek_Holdings), or [GIC Private Limited](/wiki/GIC_Private_Limited) (formerly known as the Government of Singapore Investment Corporation); - as the most senior executive of a company with an average of $500 million in [shareholders' equity](/wiki/Equity_(finance)#Legal_foundations) for the most recent three years in that office, and which is profitable after [taxes](/wiki/Corporate_tax); or - in any other similar or comparable position of seniority and responsibility in any other organisation or department of equivalent size or complexity in the [public](/wiki/Public_sector) or [private sector](/wiki/Private_sector) which has given him such experience and ability in administering and managing financial affairs as to enable him to carry out effectively the functions and duties of the office of President. Because of the stringent requirements needed to run for presidential elections, only three out of the seven elections had contests (1993, 2011 and 2023), while the rest were [walkovers](/wiki/Walkover_(sport)). An amendment to the Constitution in 2016 saw the 2017 election become reserved for a certain community ([Malay community](/wiki/Malay_Singaporeans) in the case), resulting in that year's election to cause a walkover as well. To date, 10 candidates had awarded the Certificate of Eligibility (with two being eligible twice), of which five candidates were president-elect (only one candidate, [S. R. Nathan](/wiki/S._R._Nathan), had served for two terms and had no prior affiliation with the incumbent ruling [People's Action Party](/wiki/People%27s_Action_Party)). ### Latest presidential election A presidential election was last called on 11 August 2023, and was held in 1 September that year. Sample counts were announced at about 22:42 and showed that Tharman Shanmugaratnam was leading with 70% of the votes, followed by Ng Kok Song with 16%, and Tan Kin Lian with 14%. At about 23:15, Ng [conceded](/wiki/Concession_(politics)) during a press conference and congratulated Tharman, stating that there was a clear result and there was no need to wait for the final results. At about 23:30, Tan congratulated Tharman, but refused to concede until the actual results were announced. The local results were announced at about 00:23 the next day. The final turnout (excluding the overseas electorate) was 2,530,912 (93.41%), lower than (/wiki/2011_Singaporean_presidential_election)'s and (/wiki/2020_Singaporean_general_election)'s turnouts of 94.80% and 95.81%, respectively. The Elections Department published the overseas vote count on 12 September. Only 3,799 votes were accepted for counting, of which only 78 votes were rejected. Tharman Shanmugaratnam, Ng Kok Song, and Tan Kin Lian garnered 2,834 (76.16%), 595 (15.99%), and 292 (7.85%) votes, respectively, which saw only a 0.01% change in Tharman's and Tan's respective voting percentages. ELD also said that 2,997 [postal votes](/wiki/Postal_voting) had been downloaded and 2,263 mails were received as of the cut-off date of 11 September, of which only 1,345 had been accepted. The final turnout was 2,534,711, increasing its percentage by 0.14%, from 93.41% to 93.55%. CandidateVotes%[Tharman Shanmugaratnam](/wiki/Tharman_Shanmugaratnam)1,749,26170.41[Ng Kok Song](/wiki/Ng_Kok_Song)390,63615.72[Tan Kin Lian](/wiki/Tan_Kin_Lian)344,58413.87Total2,484,481100.00Valid votes2,484,48198.02Invalid/blank votes50,2301.98Total votes2,534,711100.00Registered voters/turnout2,709,45593.55Source: Elections Department ## Referendums A [referendum](/wiki/Referendum) may also be held for important national issues, although it has been held only once in Singapore's political history for the 1962 [merger referendum](/wiki/1962_Singapore_national_referendum). During the 2000s, there were calls by religious groups to have a referendum over the building of [casinos](/wiki/Casino) in Singapore, but was rejected by prime minister [Lee Hsien Loong](/wiki/Lee_Hsien_Loong). Casinos were ultimately built at the [Marina Bay Sands](/wiki/Marina_Bay_Sands) and the [Resorts World Sentosa](/wiki/Resorts_World_Sentosa). ## Past elections ### Legislative Council elections - [1948 general election](/wiki/1948_Singaporean_general_election) - [1948 Rural West by-election](/wiki/1948_Rural_West_by-election) - [1951 general election](/wiki/1951_Singaporean_general_election) - [1952 Seletar by-election](/wiki/1952_Seletar_by-election) ### Legislative Assembly elections - [1955 general election](/wiki/1955_Singaporean_general_election) - [1957 by-elections](/wiki/1957_Singaporean_by-elections) - [1959 general election](/wiki/1959_Singaporean_general_election) - [1961 by-elections (April and July)](/wiki/1961_Singaporean_by-elections) #### As State of Malaysia - [1963 general election](/wiki/1963_Singaporean_general_election) - [1965 Hong Lim by-election](/wiki/1965_Hong_Lim_by-election) ### Parliamentary elections - [1966 by-elections (January, March & November)](/wiki/1966_Singaporean_by-elections) - [1967 by-elections](/wiki/1967_Singaporean_by-elections) - [1968 general election (First general election as an independent nation)](/wiki/1968_Singaporean_general_election) - [1970 by-elections](/wiki/1970_Singaporean_by-elections) - [1972 general election](/wiki/1972_Singaporean_general_election) - [1976 general election](/wiki/1976_Singaporean_general_election) - [1977 by-election (May & November)](/wiki/1977_Singaporean_by-elections) - [1979 by-elections](/wiki/1979_Singaporean_by-elections) - [1980 general election](/wiki/1980_Singaporean_general_election) - [1981 Anson by-election](/wiki/1981_Anson_by-election) - [1984 general election](/wiki/1984_Singaporean_general_election) - [1988 general election](/wiki/1988_Singaporean_general_election) - [1991 general election](/wiki/1991_Singaporean_general_election) - [1992 Marine Parade by-election](/wiki/1992_Marine_Parade_by-election) - [1997 general election](/wiki/1997_Singaporean_general_election) - [2001 general election](/wiki/2001_Singaporean_general_election) - [2006 general election](/wiki/2006_Singaporean_general_election) - [2011 general election](/wiki/2011_Singaporean_general_election) - [2012 Hougang by-election](/wiki/2012_Hougang_by-election) - [2013 Punggol East by-election](/wiki/2013_Punggol_East_by-election) - [2015 general election](/wiki/2015_Singaporean_general_election) - [2016 Bukit Batok by-election](/wiki/2016_Bukit_Batok_by-election) - [2020 general election](/wiki/2020_Singaporean_general_election) - [2025 general election](/wiki/2025_Singaporean_general_election) ## Other elections Municipal Commission elections - [April 1949 ordinary election](/wiki/April_1949_Singapore_Municipal_Commission_election) - [December 1949 ordinary election](/wiki/December_1949_Singapore_Municipal_Commission_election) City Council elections - [1957 ordinary election](/wiki/1957_Singapore_City_Council_election) - [1958 by-election](/wiki/1958_Singapore_City_Council_by-election) National referendums - [1962 national referendum](/wiki/1962_Singaporean_integration_referendum) Federal & State elections for Malaysia - [1964 general election](/wiki/1964_Malaysian_general_election) Presidential elections - [1993 presidential election](/wiki/1993_Singaporean_presidential_election) - [1999 presidential election](/wiki/1999_Singaporean_presidential_election) - [2005 presidential election](/wiki/2005_Singaporean_presidential_election) - [2011 presidential election](/wiki/2011_Singaporean_presidential_election) - [2017 presidential election](/wiki/2017_Singaporean_presidential_election) - [2023 presidential election](/wiki/2023_Singaporean_presidential_election) Party election - [1959 PAP prime ministerial election](/wiki/1959_PAP_prime_ministerial_election) - Singapore portal - Politics portal - [Electoral calendar](/wiki/Electoral_calendar) - [List of Singapore opposition party MPs elected](/wiki/List_of_Singapore_opposition_party_MPs_elected) ## Footnotes CitationsBibliographyLibrary resources about **Elections in Singapore** - Resources in your library - Resources in other libraries - Singapore Elections Department website - Singapore Elections - Adam Carr's Election Archive - National Library of Singapore's resource guide on general elections in Singapore - Constitution of the Republic of Singapore - Parliamentary Elections Act (Chapter 218), The Statutes of the Republic of Singapore\n",
  "language": "en",
  "processed_at": "2026-01-12T10:10:06.875754",
  "title": "Elections in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Elections_in_Singapore"
}