{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:10:07.291290"
  },
  "content": "Toll collection scheme in Singapore The **Electronic Road Pricing** (**ERP**) system is an [electronic toll collection](/wiki/Electronic_toll_collection) scheme adopted in [Singapore](/wiki/Singapore) to manage traffic by way of [road pricing](/wiki/Road_pricing), and as a usage-based taxation mechanism to complement the purchase-based [Certificate of Entitlement](/wiki/Certificate_of_Entitlement) system. There are a total of 93 ERP gantries located throughout the country, along expressways and roads leading towards the [Central Area](/wiki/Central_Area,_Singapore). As of July 2024, only 19 ERP gantries are in operation and are all in expressways where congestion continues to be severe. The ERP was implemented by the [Land Transport Authority](/wiki/Land_Transport_Authority) (LTA) on 1 April 1998 to replace the preceding [Singapore Area Licensing Scheme](/wiki/Singapore_Area_Licensing_Scheme) (ALS) that was first introduced on 11 August 1974 after successfully stress-testing the system with vehicles running at high speed. The system uses [open road tolling](/wiki/Open_road_tolling); vehicles do not stop or slow down to pay tolls. Singapore was the first city in the world to implement an electronic road toll collection system for purposes of [congestion pricing](/wiki/Congestion_pricing). Its use has inspired other cities around the world in adopting a similar system, particularly [London](/wiki/London)'s [congestion charge zone (CCZ)](/wiki/London_congestion_charge), [Stockholm](/wiki/Stockholm)'s [congestion tax](/wiki/Stockholm_congestion_tax), and [New York City](/wiki/New_York_City)'s [Central Business District Tolling Program](/wiki/Congestion_pricing_in_New_York_City). It has also been proposed in [San Francisco](/wiki/San_Francisco_congestion_pricing). ## The system ### Current system The scheme consists of ERP [gantries](/wiki/Gantry_(road_sign)) located at expressways where traffic was being built up during peak hours. The gantry system is actually a system of sensors on two gantries, one in front of the other. Cameras are also attached to the gantries to capture the rear license plate numbers of vehicles. No new gantries have been implemented since January 2016. A device known as an In-vehicle Unit (IU) is affixed on the lower right corner of the front windscreen within sight of the driver, in which a [stored-value card](/wiki/Stored-value_card), the [NETS CashCard](/wiki/CashCard), is inserted for payment of the road usage charges. The second generation IU accepts Contactless [NETS FlashPay](/wiki/NETS_(company)#FlashPay) and [EZ-Link](/wiki/EZ-Link). The cost of an IU is S$150. It is mandatory for all Singapore-registered vehicles to be fitted with an IU if they wish to use the priced roads. [Mitsubishi Heavy Industries Ltd](/wiki/Mitsubishi_Heavy_Industries) sold the IU technology to Singapore, and the project was spearheaded by a consortium comprising Philips Singapore Pte Ltd., Mitsubishi Heavy Industries Ltd., Miyoshi Electronic Corporation and CEI Systems and Engineering (now known as CSE Global Ltd.) in 1995 through an open tender. When a vehicle equipped with an IU passes under an ERP gantry, a road usage charge is deducted from the CashCard in the IU. Sensors installed on the gantries communicate with the IU via a dedicated short-range communication system, and the deducted amount is displayed to the driver on an LCD screen of the IU. ### ERP 2.0 system The ERP 2.0 system is a [Global Navigation Satellite System (GNSS) based system](/wiki/GNSS_road_pricing), as opposed to the current system with physical gantries located along expressways, as well as roads and arterial roads leading to the CBD. With the new system, the ERP scheme will move towards a distance based charging policy, instead of the current system, where a fixed toll is charged when vehicles pass through a physical ERP gantry. It is anticipated that there will no longer be any need for physical ERP gantries when the system is fully implemented and activated. After all the vehicles are installed with the new OBU, existing ERP gantries will be removed with new visual markers or signs to indicate ERP charging locations. Current IU systems will be replaced by onboard units (OBUs) with one-piece units for motorcycles and three-piece units for other vehicles, due to the fact that the current IU system is not operable with the SimplyGo card system that was being introduced in 2017. Co-developed by [NCS Group](/wiki/NCS_Group) and MHI Engine System, the Onboard Unit (OBU) will be rolled out in phases and the installation is slated to be completed by 2025. The OBU consists of three components for all vehicles, except for motorcycles, which will remain a one-piece unit. The three-piece units consists of an antenna, processing unit and a touchscreen display. The antenna and touchscreen display will be affixed on the lower right corner of the front windscreen within sight of the driver, while the processing unit is located on the right side of the passenger side footwell for the three-piece unit. The OBU is expected to have various features, including being able to display real-time traffic information, and facilitate couponless parking and automatic payment. Vehicle owners can choose to not install the touchscreen display, but will be unable to adjust the volume of the OBU. Other features such as a future payment system that will be introduced to the OBU, live traffic data and updates, can be accessed via smartphone applications developed with software development kits released by LTA. Road users are able to use Contactless e-Purse Application Specification (CEPAS) cards, which can inserted into the processing unit. LTA announced that the distance-based charging policy will not be implemented in the near future, with no concrete date on when the new policy will take place. The current ERP charges will remain the same, with the OBUs able to work the same as the IUs when passing through a physical ERP gantry. The physical gantries will be removed in a 3-phase plan after the installation of OBUs is completed in all vehicles. Installation of the OBU started in November 2023. After about one and a half year, more than half a million vehicles had been installed by June 2025. About 5,400 cars, almost two per cent of around 300,000 cars installed with OBU, had problems with their installed OBUs. The OBUs became unresponsive resulting in drivers unable to enter or exit car parks or pay road charges and subsequently the drivers have to return to the workshop to repair or replace the OBU. ### Toll charges The charge for passing through a gantry depends on the location and time. Foreign visitors driving foreign-registered private vehicles on priced roads, during the ERP operating hours, could choose to either rent an IU or pay a daily flat fee of [S$](/wiki/SGD)5 regardless how many ERP gantries entered, the payment is done and information is stored by [Autopass Card](/wiki/Autopass_Card) until the vehicle leaves Singapore. Foreign-registered commercial vehicles, however, are required to install an IU. If a vehicle owner does not have sufficient value in their CashCard (or EZ-Link) when passing through an ERP, the owner receives a fine by post within two weeks. The violator must pay the ERP charges plus a $10 administration fee within two weeks of the notice. Online payment is allowed; listing just the Vehicle Registration Number is required. Otherwise, a penalty of S$70 is issued by registered post to the vehicle owner, which rises to S$1,000, or one month in jail, if not settled within 30 days. ## History ### ERP 1.0 A lightweight version of the ERP technology has been implemented for use on [parking](/wiki/Parking), and is known as the Electronic Parking System (EPS). It has been adopted by several carpark operators and has replaced the use of autopay tickets or parking coupons. These parking systems have also typically switched to charging by the minute.[*citation needed*] In an effort to improve the pricing mechanism and to introduce real-time [variable pricing](/wiki/Variable_pricing), Singapore's [Land Transport Authority](/wiki/Land_Transport_Authority), together with [IBM](/wiki/IBM), ran a pilot from December 2006 to April 2007, with a [traffic estimation and prediction tool](/wiki/Traffic_estimation_and_prediction_system) (TrEPS), which uses historical traffic data and real-time feeds with flow conditions from several sources, to predict the levels of congestion up to an hour in advance. By accurate estimating prevailing and emerging traffic conditions, this technology is expected to allow [variable pricing](/wiki/Variable_pricing), together with improved overall traffic management, including the provision of information in advance to alert drivers about conditions ahead, and the prices being charged at that moment. This system integrates with the various LTA's [traffic management](/wiki/Transportation_Demand_Management) existing systems, such as the Green Link Determining System (GLIDE), TrafficScan, Expressway Monitoring Advisory System (EMAS), Junction Electronic Eyes (J-Eyes), and the Electronic Road Pricing system. The pilot results were successful, showing overall prediction results above 85 percent of accuracy. Furthermore, when more data was available, during peak hours, average accuracy raised near or above 90 percent from 10 minutes up to 60 minutes predictions in the future. During 2020, ERP was mostly suspended due to [circuit breaker measures](/wiki/2020%E2%80%9321_Singapore_circuit_breaker_measures) in response to the [COVID-19 pandemic in Singapore](/wiki/COVID-19_pandemic_in_Singapore). In 2021, the LTA stated that the existing ERP system, which was about 22 years old at that time, was \"reaching the end of its operational life\". During COVID-19, rate reviews were more frequent in February, April, May, August, September and November. After COVID-19, rate reviews were only reduced to February and [August](/wiki/Ghost_Festival). ### ERP 2.0 According to a paper presented in the World Roads Conference 2006, the LTA had been testing a system based on the [Global Positioning System](/wiki/Global_Positioning_System) that may eventually replace the current Electronic Road Pricing system. The proposed system was said to be able to overcome the inflexibility of having physical gantries, which \"are not so flexible when it comes to re-locating them\".[*citation needed*] In 2010, then-Transport Minister [Raymond Lim](/wiki/Raymond_Lim) announced that a new ERP system was being considered and a tender for the new system would be announced later. Subsequently, a tender was called and in 2016, [NCS](/wiki/NCS_Group) and MHI Engine System were jointly awarded the contract to install the new ERP 2.0 system for S$556 million, which was less than [ST Electronics](/wiki/ST_Electronics)'s bid of S$1.2 billion. It was reported that the rollout of the new ERP system would begin in 2020. Then-Chief Executive of LTA stated at the time that the NCS-MHI bid \"came within our budget\" and was superior to ST Electronics', and he was confident that NCS-MHI would be able to \"execute the project in a commercially-viable way\" notwithstanding the large difference between the bids. The ERP 2.0 system was said to replace the existing IU with a more sophisticated OBU the size of a smartphone with various features. The new OBU was intended to be able to provide real-time traffic information and alert drivers of toll roads and the associated charges well in advance. In September 2020, the initial design of the OBU for vehicles other than motorcycles, such as cars, was criticised as being clunky, inelegant and bulky. It was also reported that as a result of the [COVID-19 pandemic in Singapore](/wiki/COVID-19_pandemic_in_Singapore) in 2020, the fitting of the new OBUs would be delayed to the second half of 2021, with the new ERP system expected to become operational in mid 2023. In November 2021, the deployment was delayed again to the second half of 2023 due to a global shortage of microchips for the OBUs. Then-Deputy Prime Minister Heng Swee Keat also stated that the technology required for distance-based charging \"is still several years away\". Some commentators described the OBU design as \"old-fashioned\", stating that \"the tech is too old\" and observed that the new OBU would require more space and more wiring than the existing IU. In October 2023, LTA announced that the new system would begin to replace the existing ERP system from November 2023 onwards. All vehicles are expected to be fitted with the new on-board units by the end of 2025 but the system will not be turned on until further notice. In March 2024, it was reported that various motorists using the ERP 2.0 system had complained about the location of the card reader component of the OBU. In cars, the card reader was generally installed in the passenger footwell, which made it difficult for drivers to insert or remove their CEPAS card from the driver's seat. In response, the LTA stated that it would make changes to the system to allow drivers to temporarily deactivate their CEPAS card using the touchscreen without having to remove the card physically. The LTA also stated that it would allow drivers to decide where to install the card reader component, subject to space constraints in the relevant vehicle and technical feasibility. As of April 2024, more than 13,000 vehicles had been fitted with the new OBUs, of which about 75% were company vehicles, such as buses and motorcycles. In May 2024, the LTA refuted allegations that the new OBUs did not comply with international standards. According to the LTA, the OBU had been tested against the International Electrotechnical Commission's IEC-60068 and IEC-60529 and therefore \"meets the relevant global benchmarks for electronic devices\" and \"when properly installed, it is safe and reliable to use in our operating environment\". ## Impact A study on the long-term effects of congestion pricing in Singapore claimed that \"traffic congestion had not been eliminated—it had merely been shifted in time and location\" and that the average travel time has increased. In contrast, another report stated that road traffic decreased by nearly 25,000 vehicles during peak hours, with average road speeds increasing by about 20%. Within the restricted zone itself, traffic has gone down by about 13% during ERP operational hours, with vehicle numbers dropping from 270,000 to 235,000. It has been observed that car-pooling and public transport has increased, while the hours of peak vehicular traffic has also gradually eased and spread into off-peak hours, suggesting a more productive use of road space. In addition, it has been noted that average road speeds for expressways and major roads remained the same, despite rising traffic volumes over the years. In some cases, the implementation of an ERP gantry along a road may move the traffic to outer roads or shift would-be car users towards public transport. One instance of this is that the ERP gantries have been said to have caused traffic to increase substantially in the arterial roads. In response, congestion on the [East Coast Parkway](/wiki/East_Coast_Parkway) was relieved with the opening of [Marina Coastal Expressway](/wiki/Marina_Coastal_Expressway) on 29 December 2013. The rising traffic has prompted the LTA to encourage more Singaporeans to switch to public transport as part of the country's general \"car-lite society\" plan, by building more MRT train lines and introducing more bus services. The full completion of the [Downtown MRT line](/wiki/Downtown_Line) on 21 October 2017 complements the [Pan Island Expressway](/wiki/Pan_Island_Expressway). The [Thomson–East Coast MRT line](/wiki/Thomson%E2%80%93East_Coast_Line) also runs largely parallel to the [Seletar Expressway](/wiki/Seletar_Expressway) and East Coast Parkway. ## Adoption by other metropolitan areas In [Ontario](/wiki/Ontario), Canada, an electronic road pricing system is used on [Highway 407](/wiki/Ontario_Highway_407) to collect tolls electronically and billed to the owner of the car by taking a picture of its license plate. The ERP system attracted the attention of transport planners and managers in other metropolitan areas, particularly those in Europe and the United States. For example, the [London congestion charge](/wiki/London_congestion_charge) was introduced on 17 February 2003, after London officials visited Singapore to study the ERP system, and used it as a reference for the London system. London's charge area was expanded in 2007. The [Stockholm congestion tax](/wiki/Stockholm_congestion_tax) is also a [congestion pricing](/wiki/Congestion_pricing) system implemented as a tax which is levied on most vehicles entering and exiting central [Stockholm](/wiki/Stockholm), Sweden. The congestion tax was implemented on a permanent basis on 1 August 2007, after a seven-month trial period was held between 3 January 2006 and 31 July 2006. In 2007, [Dubai](/wiki/Dubai), in the United Arab Emirates, implemented a corridor congestion pricing scheme called [Salik](/wiki/Salik_(Road_Toll)) which works on similar principles. In January 2008, [Milan](/wiki/Milan) introduced a [traffic charge](/wiki/Congestion_pricing) scheme as a one-year trial, called [Ecopass](/wiki/Ecopass), and exempts high emission standard vehicles and some alternate fuel vehicles. This tax was substituted in 2012 by the [Area C](/wiki/Milan_Area_C) system, which places a charge on nearly all vehicles entering the city centre during weekdays. A similar system is expected to be operational on selected roads in [Jakarta](/wiki/Jakarta), the capital of Indonesia by early 2019. ## Payment modes PaymentAcceptanceAuthorised sourcesNotes1st Gen IU2nd Gen IUOBUAutopass CardYYYWoodlands and Tuas CheckpointsNon-Singapore registered vehicles onlyCBT [EZ-Link](/wiki/EZ-Link) and Concession CardNYYTicketing Offices[CEPAS](/wiki/CEPAS) platform. Will be phased out when all vehicles move to OBU and when all cards have to transit to SimplyGo platform as below (under SimplyGo EZ-Link and Concession Card).SimplyGo [EZ-Link](/wiki/EZ-Link) and Concession CardNNNTicketing OfficesEZ-Link x [Touch 'n Go](/wiki/Touch_%27n_Go) CardNYYTicketing Offices[CEPAS](/wiki/CEPAS) platform. Will be phased out when all vehicles move to OBU and when all cards have to transit to SimplyGo platform.EZ-Link MotoringNYYTicketing Offices[CEPAS](/wiki/CEPAS) platform. Will be phased out when all vehicles move to OBU and when all cards have to transit to SimplyGo platform.NETS MotoringNYYTicketing Offices, Convenience Stores (7–11, Cheers, Buzz), Airport & Ferry TerminalsNETS Contactless CashCardNYYTicketing Offices, Convenience Stores (7–11, Cheers, Buzz), Airport & Ferry TerminalsNETS PrepaidNNYTicketing Offices, Convenience Stores (7–11, Cheers, Buzz), Airport & Ferry TerminalsNETS FlashPayNYYTicketing Offices, Convenience Stores (7–11, Cheers, Buzz), Airport & Ferry Terminals[CEPAS](/wiki/CEPAS) platform. Will be phased out when all vehicles move to OBU and when all cards have to transit to SimplyGo platform as above (under NETS Prepaid).[Mastercard](/wiki/Mastercard)NNYBanks[Visa](/wiki/Visa_Inc.)NNYBanks[NETS](/wiki/NETS_(company)) TapNNYBanks[NETS](/wiki/NETS_(company)) CashCard (1st generation)YYNNot AvailableObsolete[American Express](/wiki/American_Express)NNYBanks - [Road pricing](/wiki/Road_pricing) - [Congestion pricing](/wiki/Congestion_pricing) - [Electronic toll collection](/wiki/Electronic_toll_collection) - [Hong Kong electronic road pricing](/wiki/Electronic_road_pricing_(Hong_Kong)) - [Intelligent transportation system](/wiki/Intelligent_transportation_system) - [Singapore Area Licensing Scheme](/wiki/Singapore_Area_Licensing_Scheme) - [London congestion charge](/wiki/London_congestion_charge) - [Milan Area C](/wiki/Milan_Area_C) - [New York congestion pricing](/wiki/New_York_congestion_pricing) - [San Francisco congestion pricing](/wiki/San_Francisco_congestion_pricing) - [Stockholm congestion tax](/wiki/Stockholm_congestion_tax) - [PAYD](/wiki/PAYD) Library resources about **Electronic Road Pricing** - Resources in your library - Resources in other libraries - Land Transport Authority (Singapore): ERP - Onemotoring Land Transport Authority (LTA) - ERP 2.0 - Integrated public transport in Singapore and Hong Kong, James Luk and Piotr Olszewski, Dec 2003 - Schematic drawing of ERP system using pair of 2 gantries and 5 step detection sequence Archived 10 May 2008 at the [Wayback Machine](/wiki/Wayback_Machine) Portals: - Economics - Environment - Singapore - Transport\n",
  "language": "en",
  "processed_at": "2026-01-12T10:10:07.290792",
  "title": "Electronic Road Pricing",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Electronic_Road_Pricing"
}