{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:10:11.064704"
  },
  "content": "Singaporean educator (1910–2006)This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Elizabeth Choy\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(October 2025)* *(Learn how and when to remove this message)* **Elizabeth Choy Su-Moi** [OBE](/wiki/Officer_of_the_Order_of_the_British_Empire) ([née](/wiki/N%C3%A9e) **Yong**; 29 November 1910 – 14 September 2006) was a Singaporean educator and councillor who is regarded as a war heroine in Singapore. Along with her husband, Choy Khun Heng, she supplied medicine, money and messages to [Far East prisoners of war](/wiki/Far_East_prisoners_of_war) and [civilian internees](/wiki/Civilian_internee) held in [Changi Prison](/wiki/Changi_Prison) during the [Japanese occupation of Singapore](/wiki/Japanese_occupation_of_Singapore) in [World War II](/wiki/World_War_II). ## Early life Choy was born in a [Hakka](/wiki/Hakka) family in [Kudat](/wiki/Kudat), [North Borneo](/wiki/North_Borneo) (now [Sabah](/wiki/Sabah)). Her great-grandparents first came to Kudat from Hong Kong to assist German missionaries in their work. The eldest of 11 children, Choy's father worked as a civil servant after completing his early education in China with some English education in North Borneo, where he married the daughter of a priest. He transferred to work in Jesselton (now [Kota Kinabalu](/wiki/Kota_Kinabalu)) and was later promoted to District Officer and he moved to [Kalimantan](/wiki/Kalimantan). Choy was raised by a [Kadazan](/wiki/Kadazan_people) nanny and acquired Kadazan as her first language. She became an [Anglican](/wiki/Anglicanism) at St Monica's Boarding School in [Sandakan](/wiki/Sandakan), where she adopted the name \"Elizabeth\", and went on to pursue higher education in Raffles College (now the [National University of Singapore](/wiki/National_University_of_Singapore)) in Singapore. As her family could not afford the tuition fees, she started to teach, first at [St Margaret's School](/wiki/St._Margaret%27s_Secondary_School) and then at [St Andrew's School](/wiki/Saint_Andrew%27s_School,_Singapore). In August 1941, she married Choy Khun Heng, employed by the Borneo Company. ## Life during Japanese Occupation During the [Japanese invasion of Malaya](/wiki/Malayan_Campaign), Choy served as a [second lieutenant](/wiki/Second_lieutenant) in the women's auxiliary arm of the [Singapore Volunteer Corps](/wiki/Singapore_Volunteer_Corps), where she acquired the nickname \"Gunner Choy\". She was also a volunteer nurse with the Medical Auxiliary Service. After the [fall of Singapore](/wiki/Battle_of_Singapore) in 1942, the Choys set up a canteen at the [Tan Tock Seng Hospital](/wiki/Tan_Tock_Seng_Hospital), after all the patients and doctors had been moved from the Miyako Hospital (former [Woodbridge Hospital](/wiki/Institute_of_Mental_Health_(Singapore))), where they soon started a regular ambulance run for British civilian internees. The couple helped prisoners interned in [Changi Prison](/wiki/Changi_Prison) by passing to them cash and parcels containing fresh clothing, medicine and letters during their deliveries. They incurred further risk by sending in radio parts for hidden receivers until the Japanese crackdown following [Operation Jaywick](/wiki/Operation_Jaywick). During the subsequent [Double Tenth Incident](/wiki/Double_Tenth_Incident), an informant told the [Kempeitai](/wiki/Kempeitai) (Japanese military police) that the Choys were involved in smuggling money into Changi Prison, resulting in the arrest of Choy's husband. After several days, Choy went to the [Kempeitai East District Branch](/wiki/Kempeitai_East_District_Branch) to ask about her husband. The Japanese denied knowledge of him, but lured her back to the branch three weeks later and confined her with other prisoners. She was imprisoned and subjected to torture. R. H. Scott, a former director of the British Ministry of Information (Far Eastern Branch) and principal witness at the War Crimes Court in Singapore, later testified that he saw Choy being stripped and severely beaten \"on at least one occasion\". Throughout her imprisonment, her strong [Christian](/wiki/Christianity) faith and the classic texts that she learnt in school about moral values kept her strong. At the Japanese surrender in Singapore in September 1945, Choy was invited by [Lady Mountbatten](/wiki/Edwina_Mountbatten,_Countess_Mountbatten_of_Burma) to witness the official ceremony, where she was escorted by the governor, [Sir Shenton Thomas](/wiki/Shenton_Thomas), and his wife, to whom she had sent medicine in Changi Prison. ## Post-war life in England After the war, the Choys were invited to England to recuperate. During their stay, [Lady Baden-Powell](/wiki/Olave_Baden-Powell) awarded her the [Girl Guides](/wiki/Girl_Guides)' highest honour for gallantry, the [Bronze Cross](/wiki/Bronze_Cross_(Scouting)), and the [Rajah of Sarawak Charles Brooke](/wiki/Charles_Vyner_Brooke) presented her with the [Order of the Star of Sarawak](/wiki/Order_of_the_Star_of_Sarawak). The Choys were bestowed with the [Officer of the Order of the British Empire](/wiki/Order_of_the_British_Empire) (OBE) in June 1946. They were honoured for their work in assisting British prisoners of war in Malaya during the Japanese occupation. In addition, Choy received the honour of having a half-hour private audience with [Queen Elizabeth](/wiki/Queen_Elizabeth_The_Queen_Mother) at [St James's Palace](/wiki/St_James%27s_Palace) on 25 July 1946. During her four-year stay in England, Choy studied domestic science at the Northern Polytechnic (now the [University of North London](/wiki/University_of_North_London)) and taught at a London council school. Intent on studying art but without the finances for this venture, Choy began a stint as an artist's model, posing for two sculptures, \"Serene Jade\" and \"Flawless Crystal\", by the sculptor [Dora Gordine](/wiki/Dora_Gordine). ## Later life in Singapore On returning to Singapore in 1949, Choy resumed teaching and became involved in the political developments preceding Singapore's independence. She stood in the [election in December 1950](/wiki/1950_Singapore_Municipal_Commission_election) for the West Ward. However, she lost to the [Progressive Party](/wiki/Progressive_Party_(Singapore)) candidate Soh Ghee Soon. From 1951 to 1955, Choy was nominated by the [Governor](/wiki/Governors_of_Singapore) to the [Legislative Council of Singapore](/wiki/Legislative_Council_of_Singapore), where she spoke frequently on behalf of the poor and needy, and campaigned for the development of social services and family planning. As a member of the Legislative Council, she represented Singapore at the [Coronation of Queen Elizabeth II](/wiki/Coronation_of_Queen_Elizabeth_II) in June 1953. She later stood for elections in [Queenstown](/wiki/Queenstown,_Singapore) but retired from politics thereafter. Choy's teaching career at [St Andrew's School](/wiki/Saint_Andrew%27s_School,_Singapore) continued until 1974, except for a four-year spell as the first principal, as well as a teacher, at the Singapore School for the Blind from 1956. After her retirement she improved her languages and travelled. She continued with social work and school visits into her 90s, impressing young Singaporeans with the need to maintain strong national defence. Choy was also noted for wearing traditional Chinese and Indian clothing, [qipaos](/wiki/Qipao) and [bangles](/wiki/Bangle), which earned her the nickname \"Dayak Woman of Singapore\". Choy died from [pancreatic cancer](/wiki/Pancreatic_cancer) in 2006 at the age of 95. ## List of honours - [Order of the British Empire](/wiki/Order_of_the_British_Empire) - [Order of the Star of Sarawak](/wiki/Order_of_the_Star_of_Sarawak) - [Pingat Bakti Setia](/wiki/Pingat_Bakti_Setia) (Singapore) ## Portrayal in media In October 1986, Choy's life story was adapted into a stage play *Not Afraid To Live, Not Afraid To Remember* by Kim Ramakrishnan. The play was directed by Lim Siauw Chong and was staged by Theatreworks at the Drama Centre in Singapore. On 11 September 1995, a column on Choy, titled \"She paid 40 cents for me to have this picture\", was published in the Singapore newspaper *[The Straits Times](/wiki/The_Straits_Times)*. It was written by columnist [Koh Buck Song](/wiki/Koh_Buck_Song), one of Choy's former students. On 29 October 1997, an exhibition titled *Elizabeth Choy : A Woman Ahead of Her Time* was officially opened at the [Singapore History Museum](/wiki/Singapore_History_Museum) in honour of Choy's contributions to Singapore. The exhibition was considered unique for a living woman in Singapore history, tracing her life as a nurse, her travels to the United Kingdom to meet royalty, her 22-year teaching career at St Andrew's School, and her vast contributions to the less fortunate. More than 100 artefacts of pictures and newspaper clippings of her past, including the sculpture *Serene Jade*, were on display at the exhibition. This was a nude sculpture of Choy, created in 1949 by [Dora Gordine](/wiki/Dora_Gordine). It was also the first in a series of four sculptures by Gordine, and only five other copies of the sculpture remain in existence. Choy's life and experiences during the Japanese occupation of Singapore had been depicted twice in television. The first time was in *[The Price of Peace](/wiki/The_Price_of_Peace)*, a Chinese-language drama series aired on TCS Eighth Frequency (now [MediaCorp Channel 8](/wiki/Channel_8_(Singaporean_TV_channel))) in 1997, in which she appeared as a semi-fictional character and was portrayed by actress [Xiang Yun](/wiki/Xiang_Yun). The second time was in *Life Stories – Story of Elizabeth Choy*, which was aired on the English-language [MediaCorp Channel 5](/wiki/Channel_5_(Singaporean_TV_channel)) in 2007. ## Bibliography - Choy, Elizabeth, (1974) *My Autobiography as Told to Shirley Gordon* Kuala Lumpur. - Zhou, Mei. (1995). *Elizabeth Choy: More than a war heroine: A biography* Singapore: Landmark Books. [ISBN](/wiki/ISBN_(identifier)) 981-3002-98-0 - Foong, Choon Hon (1997). *The Price of Peace* Singapore: Asiapac Books. [ISBN](/wiki/ISBN_(identifier)) 981-3068-53-1. - Infopedia, Biography Abstract (National Library Board) - Elizabeth Choy – Singapore's War Heroine, Politician and Teacher (1910–2006) Archived 11 February 2009 at the [Wayback Machine](/wiki/Wayback_Machine) (National Archives of Singapore) - Obituary in *The Daily Telegraph*, 10 October 2006 - 200 Days In Hell – An account of Choy's Imprisonment\n",
  "language": "en",
  "processed_at": "2026-01-12T10:10:11.064275",
  "title": "Elizabeth Choy",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Elizabeth_Choy"
}