{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:10:13.485472"
  },
  "content": "Market at Ellenborough Street **Ellenborough Market** ([Chinese](/wiki/Simplified_Chinese_characters): 爱伦坡巴刹), also known as **Teochew Market** ([Chinese](/wiki/Simplified_Chinese_characters): 潮州巴刹), **New Market**, **Sin Pa Sat** ([Chinese](/wiki/Simplified_Chinese_characters): 新巴刹) and **Pasar Bahru**, was a market on Ellenborough Street along the [Singapore River](/wiki/Singapore_River) in Singapore. The market was demolished following a fire in 1968. ## History Construction of a market named after [Edward Law, 1st Earl of Ellenborough](/wiki/Edward_Law,_1st_Earl_of_Ellenborough) began in May 1845 by engineer Charles Edward Faber. Faber was criticised for shoddily constructing the market, with cracks in several parts of the walls. An extension was built next to the building in 1899, and was made using a [cast iron](/wiki/Cast_iron) structure from an exhibition [Edinburgh](/wiki/Edinburgh). A proposal for an extension was made in 1947 to modernise the market. Construction of a one-way street around the market was approved in 1952 to speed up deliveries to the market. The market was known for selling seafood, especially fish. The market was also known as Teochew Market, as the area had a high population of [Teochews](/wiki/Teochew_people), and was known as Pasar Bahru in Malay and Sin Pa Sat in Hokkien, both of which translate to \"New Market\". On 30 January 1968, the market was destroyed due to a fire and was subsequently demolished to make way for urban developments. The site of the market is currently occupied by the Swissotel Merchant Court hotel and The Central mall. ## Legacy The Ellenborough Market Cafe in the Swissotel Merchant Court is named after the market. This article about a Singapore building or structure is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T10:10:13.485011",
  "title": "Ellenborough Market",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Ellenborough_Market"
}