{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:10:19.323211"
  },
  "content": "Building in Singapore The **Ellison Building** is a historical building at the corner of Selegie Road and [Bukit Timah Road](/wiki/Bukit_Timah_Road) in Singapore. It was erected in 1924 by [Isaac Ellison](/wiki/Isaac_Ellison), a prominent member of the [Jewish community of Singapore](/wiki/History_of_the_Jews_in_Singapore). In August 2016, the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) and the [Land Transport Authority](/wiki/Land_Transport_Authority) announced that part of the building would be demolished and reconstructed to make way for the construction of the [North-South Corridor](/wiki/North%E2%80%93South_Corridor,_Singapore). ## Description The two-storey building comprises a row of shophouses with \"varying building facades and heights\". It features an \"iconic\" curved façade and \"notable\" balconies and twin cupolas, is one of three buildings in the area to feature the [Star of David](/wiki/Star_of_David) on its exterior. The star can be found on a pediment which also features the year \"1924\" on the top of the building. According to the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority), it serves as \"historical evidence of Singapore's pre-WW2 Jewish urban community in the Mt Sophia/Selegie area.\" The authority also wrote that both the building and the next-door [Rex Cinema](/wiki/Rex_Cinemas_Mackenzie) \"give a distinctive character to the important trunk road which leads out of the City Centre and towards the Kandang Kerbau/Serangoon Road area.\" ## History The building was constructed by businessman and leader of the [Jewish community in Singapore](/wiki/History_of_the_Jews_in_Singapore) [Isaac Ellison](/wiki/Isaac_Ellison) in 1924 for \"commercial purposes\" and to \"embody the Jewish community's entrepreneurial spirit.\" According to Roots, which is published by the [National Heritage Board](/wiki/National_Heritage_Board_(Singapore)), the building was \"frequented by colonial governors who would sit on the roof of the building to catch races at Race Course Road held every Sunday.\" In the early 1960s, the Rex Cinema \"utilised the Ellison Building's roof to display their lighted movie signs\". In 1989, the building was put up for sale, with then-owner Steven Ellison claiming that as a result of the Control of Rent Act, which had prevented the family from increasing the building's rent, the Ellison family could no longer afford to maintain the building. It was acquired by property developer Dennis Aw. Both the Ellison Building and the Rex Cinema were gazetted for conservation by the Urban Redevelopment Authority on 5 December 2008. This was reportedly a result of the government's plans for the construction of the [North–South Corridor](/wiki/North%E2%80%93South_Corridor,_Singapore), which would affect both the Ellison Building and the Rex Cinema. In a November 2016 statement by [Minister for National Development](/wiki/Ministry_of_National_Development_(Singapore)) [Desmond Lee](/wiki/Desmond_Lee_(Singaporean_politician)), the buildings were conserved with the construction plans in mind and that the authorities intended to minimise the impact on the buildings. The plans were later revised such that the Rex Cinema would remain untouched. In August 2016, the [Land Transport Authority](/wiki/Land_Transport_Authority) announced that three of the building's units, 235, 237, and 239 Selegie Road, would be demolished to make way for the construction of the expressway in an \"exceptional course of action\". The units were to be reconstructed following the completion of the corridor. However, this decision was criticised by local heritage groups such as the Singapore Heritage Society, as well as the Singaporean chapter of the [International Council on Monuments and Sites](/wiki/International_Council_on_Monuments_and_Sites), who stated that they were \"deeply disturbed by the authorities' disregard for the heritage value of this building and the lack of transparency behind this decision\", and that the decision \"negates the critical role of heritage conservation in Singapore's national planning agenda and undermines decades of painstaking efforts by state agencies, building owners, heritage stakeholders, professionals and builders, and the progress in conservation achieved so far.\" The authorities later announced that they would be working with local heritage groups to \"retain as much of the Ellison Building as possible.\" In February 2018, it was announced that the plans for the construction had been revised such that only one of the building's units would be demolished and rebuilt. 1°18′17″N 103°51′01″E﻿ / ﻿1.3046°N 103.8503°E﻿ / 1.3046; 103.8503\n",
  "language": "en",
  "processed_at": "2026-01-12T10:10:19.322715",
  "title": "Ellison Building",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Ellison_Building"
}