{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:10:17.628268"
  },
  "content": "Street in Singapore**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **does not cite any sources**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Ellis Road\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(December 2012)* *(Learn how and when to remove this message)*The topic of this article **may not meet Wikipedia's notability guideline for geographic features**. Please help to demonstrate the notability of the topic by citing reliable secondary sources that are independent of the topic and provide significant coverage of it beyond a mere trivial mention. If notability cannot be shown, the article is likely to be merged, redirected, or deleted. *Find sources:* \"Ellis Road\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(July 2012)* *(Learn how and when to remove this message)*This article **is an orphan, as no other articles link to it**. Please introduce links to this page from related articles. *(December 2025)* *(Learn how and when to remove this message)* **Ellis Road** is a road close to the city centre of [Singapore](/wiki/Singapore). It is accessible only by Tanglin Road, and provides access to [The Regent Hotel](/wiki/The_Regent_Hotel). ## History Ellis Road used to be the access road to a cluster of [Malay](/wiki/Malay_language) kampong (hamlet or village) houses. It was referred to by the local Malays as Kampong Tanglin Ellis Road. The village had their own mosque that was demolished in the 1970s to make way for modern commercial buildings. This [Singapore](/wiki/Singapore) location article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T10:10:17.627788",
  "title": "Ellis Road",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Ellis_Road"
}