{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:10:22.436491"
  },
  "content": "Indonesian actress and producer (1923–1992) **Elly Joenara** ([Perfected Spelling](/wiki/EYD): **Elly Yunara**; 3 November 1923 – 30 May 1992) was an Indonesian film actress who later became a producer. She was the wife of producer [Djamaluddin Malik](/wiki/Djamaluddin_Malik). ## Biography Joenara was born in [Straits Settlements](/wiki/Straits_Settlements) (modern-day [Singapore](/wiki/Singapore)) on 3 November 1923. She completed an elementary education at a Hollandsch-Inlandsche School, a Dutch-run school for [*pribumi*](/wiki/Native_Indonesians) students, the [Dutch East Indies](/wiki/Dutch_East_Indies). Joenara made her film debut in *[Pah Wongso Pendekar Boediman](/wiki/Pah_Wongso_Pendekar_Boediman)*, a 1940 detective film produced and directed by Jo Eng Sek of [Star Film](/wiki/Star_Film_(Dutch_East_Indies_company)). In the film she played Siti, the romantic partner of a character portrayed by Mohamad Arief. She remained with the company for its further productions, including *[Tjioeng Wanara](/wiki/Tjioeng_Wanara)* (from a [Sundanese legend](/wiki/Ciung_Wanara)), *[Lintah Darat](/wiki/Lintah_Darat)*, and *[Ajah Berdosa](/wiki/Ajah_Berdosa)*. By 1942 she is recorded as acting in one film produced by [Tan's Film](/wiki/Tan%27s_Film) under Tan Khoen Yauw, *Aladin dengan Lampu Wasiat* (*Aladdin and the Magic Lamp*). The [Japanese occupied the Indies](/wiki/Japanese_occupation_of_the_Dutch_East_Indies) in March 1942, closing all but one film studio in the colony. Production of *Aladin dengan Lampu Wasiat* stopped; the film would only be released in 1950, after the occupation and [national revolution](/wiki/Indonesian_National_Revolution). During the occupation Yunara acted in theatre, going from troupe to troupe; she was part of the troupes Warnasari, Matahari, and Jawa Ehai. By 1949, when the Dutch recognised an independent Indonesia, Yunara had married stage manager turned film producer [Djamaluddin Malik](/wiki/Djamaluddin_Malik). In 1950 Djamaluddin established a film company, Persari. Yunara completed two films for the company as an actress: *Si Mientje* in 1952 and *Siapa Ajahku* in 1954. However, her main role was managerial. Much of her time was spent as a housewife. Djamaluddin died on 8 June 1970, leaving Yunara a widow. She soon established her own company, Remaja Ellyanda Film, and in 1972 began a career as a film producer with *[Malin Kundang](/wiki/Malin_Kundang_(film))*. Directed by [D. Djajakusuma](/wiki/D._Djajakusuma) and based on a [Malay folk tale](/wiki/Malin_Kundang), the film starred [Rano Karno](/wiki/Rano_Karno) and [Putu Wijaya](/wiki/Putu_Wijaya) as the titular Malin Kundang, a young man who forgets his roots after spending much of his childhood at sea. This was followed by *Jembatan Merah* (1973), *Petualang Cilik* (1977), and *Halimun* (1979); the company also produced two non-feature films. In 1974 she received an award from Governor of Jakarta [Ali Sadikin](/wiki/Ali_Sadikin) for her contributions to film. Yunara died in Jakarta on 30 May 1992. ## Works cited - K. H., Ramadhan; Budiarto, Nina Pane (2006). *Pengusaha, Politikus, Pelopor Industri Film Djamaludin Malik* [*Djamaludin Malik: Businessman, Politician, and Film Industry Pioneer*]. Jakarta: Kata. [ISBN](/wiki/ISBN_(identifier)) 978-979-1056-02-1. - Elly Yunara at [IMDb](/wiki/IMDb_(identifier))\n",
  "language": "en",
  "processed_at": "2026-01-12T10:10:22.436033",
  "title": "Elly Yunara",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Elly_Yunara"
}