{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:11:00.987263"
  },
  "content": "Neighbourhood and conservation area in Singapore**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **relies largely or entirely on a single source**. Relevant discussion may be found on the talk page. Please help improve this article by introducing citations to additional sources. *Find sources:* \"Emerald Hill, Singapore\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(January 2013)*This article includes a list of general references, but **it lacks sufficient corresponding inline citations**. Please help to improve this article by introducing more precise citations. *(January 2013)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* 1°18′6.5″N 103°50′20.6″E﻿ / ﻿1.301806°N 103.839056°E﻿ / 1.301806; 103.839056 **Emerald Hill** is a neighbourhood and a [conservation area](/wiki/Conservation_area) located in the planning areas of [Newton](/wiki/Newton,_Singapore) and [Orchard](/wiki/Orchard_Road) in [Singapore](/wiki/Singapore). Former home to many members of the city-state's wealthy [Peranakan](/wiki/Peranakan) community, it is located near [Orchard Road](/wiki/Orchard_Road). Many of its homes feature [Chinese Baroque](/wiki/Chinese_Baroque) architecture. Emerald Hill also the setting for some of the short stories by the late Singaporean author [Goh Sin Tub](/wiki/Goh_Sin_Tub). Many of the homes were designed by Mr R T Rajoo (Rethinam Thamby Rajoo Pillay) an architect/contractor of those days who died in 1929 at his home in Tank Road, Singapore. ## History Before the time of Stamford Raffles and William Farquhar, Emerald Hill was believed to be fully covered in primary rainforest. However, around the early 1800s, many Chinese immigrants occupied the land with Gambier or pepper plantation to make a living of their own, exhausting the land to its ends. Thus, when William Cuppage finally owned the land legally, it had already become a barren field. William Cuppage, a [postal](/wiki/Mail) [clerk](/wiki/Clerk_(position)) who rose to become the acting [Postmaster](/wiki/Postmaster) General in the 1840s, first [leased](/wiki/Lease) Emerald Hill in 1837 and in 1845 secured a permanent [grant](/wiki/Land_grant) for his [nutmeg](/wiki/Nutmeg) [plantation](/wiki/Plantation), which failed in the 1860s because of [disease](/wiki/Disease). Cuppage himself moved from his [residence](/wiki/House) in [Hill Street](/wiki/Hill_Street,_Singapore) to Emerald Hill in the early 1850s and lived in the area till his death in 1872. Here he built two houses (Erin Lodge and Fern Cottage) where he lived. After his death, Cuppage's plantation was left to his daughters and in 1890 it was sold to one of his [sons-in-law](/wiki/Son-in-law), the [lawyer](/wiki/Lawyer) Edwin Koek. Koek turned the area into an [orchard](/wiki/Orchard) and built another house on the [estate](/wiki/Estate_(land)), called Claregrove. Koek's orchard venture failed, however, and he went [bankrupt](/wiki/Bankrupt). The [property](/wiki/Property) was then sold to Thomas E. Rowell in 1891. By the turn of the twentieth century, the 13.2 [hectare](/wiki/Hectare) land and its three houses (Erin, Fern and Claregrove) were the property of Seah Boon Kang and Seah Boon Kiat. These three houses were subsequently [demolished](/wiki/Demolish): Fern Cottage in 1906 made way for terrace houses; in 1924 Claregrove gave way to the [Singapore Chinese Girls' School](/wiki/Singapore_Chinese_Girls%27_School); Erin Lodge was replaced with more terrace houses. In 1901, they subdivided the property into 38 plots, ten of which they kept while the remaining twenty-eight lots were sold to various people. One of the persons who bought three lots (Lots 6, 7, 8), was an influential Peranakan named [Lim Boon Keng](/wiki/Lim_Boon_Keng). The builders of houses at Emerald Hill Road were mostly Peranakans or Straits-born Chinese in general; at least fifty-nine out of 112 houses were built in total. The first house in the area was built in 1902. By 1918, 33% of houses have been built. ### WWII During the Japanese Occupation, all building of new houses stopped. After which, houses was continuously being erected until Emerald Hill Road was fully aligned by landed properties by the 1950s. ### Post-War For almost half a century, a community of Peranakans thrived in Emerald Hill Road. Lim Boon Keng and his family, was the most prominent family amongst all Straits Chinese who lived on that hill. Most of the Peranakan family started moving out since the 1950s. Most of which, was because the head of the family at that a time have already passed on, while other plots of lands were further developed to the present block of flats. ### Role in Emily of Emerald Hill In Stella Kon's [Emily of Emerald Hill](/wiki/Emily_of_Emerald_Hill), it describes the house as one of those built in 1902. It has two tennis courts, a big front lawn and was later pressed up around the new apartment blocks. Speculatively, it would be one of the bigger lots on Emerald Hill which was later surrounded by blocks of flats which Stella Kon confirms was plot No. 117. Lim Boon Keng, was one of the earlier residents of Emerald Hill, lived at No 2 Emerald Hill - known as Claregrove. It also describes the head of the Peranakan family, her father-in-law as a wealthy, English- educated man, who owns a rubber company and several properties which included a sea-side bungalow, horses and motor-cars. Every Sunday, he would open his house for dinners and invite his friends and neighbours over, creating a lively and harmonious Peranakan neighbourhood at Emerald Hill. He would specially use the front lawn as the dining area and invite bands to play during these sessions. This sets the typical Peranakan family who lives on Emerald Hill ravishingly during the time when the Peranakan families thrived there. The play itself also mentioned how far of the extant of the neighbourhood was used by Emily and her family. As far as cold storage, the market and even schools was also mentioned to be part of the setting, which reflected the reality of the area of Orchard Road. As a housewife, she would frequent Cold Storage and the Market often to buy groceries, just like any other housewife does. Her children studies at Anglo Chinese School when they were young, at the same time, she would help out at the Methodist Girls’ School to keep in close contact with the principal of the school. This is also common practices of parents in order to ensure their children enrols in reputable school. The Legislative Office is where Emily's husband would be working and the Salvation Army is where she visits to donate unwanted clothes. According to the play, the living, dining and front lawn are used to entertain guests while the back end of the houses are kept away from the eye of the public for servants. ## Streets ### Emerald Hill Road Emerald Hill Road was laid out in 1901 and the current terrace houses alongside the road were built between 1901 and 1925. ### Hullet Road Hullet Road was built in 1914 and named after R.W. Hullet, [principal](/wiki/School_principal) of [Raffles Institution](/wiki/Raffles_Institution) from 1871 and later Director of Public Instruction on his departure from Singapore in 1906 after having stayed here for 35 years. His name is also commemorated in Raffles Institution in the form of a Hullet Scholarship awarded since 1908. The road was named after Hullet at the request of Dr [Lim Boon Keng](/wiki/Lim_Boon_Keng), who was Hullet's [pupil](/wiki/Student). ### Saunders Road Saunders Road was named in 1927 after the [British colonial](/wiki/British_colony) officer, Charles James Saunders. Saunders held several official appointments. He was [District Judge](/wiki/Judiciary_of_England_and_Wales) (1908), [Registrar of Companies](/wiki/Registrar_of_Companies) and Official [Assignee](/wiki/Assignee) (1915) and Secretary for Chinese Affairs, [Straits Settlements](/wiki/Straits_Settlements) (1922). He was also a member of the [Legislative Council](/wiki/Legislative_Council). ### [Peranakan Place](/wiki/Peranakan_Place) Situated at the mouth of Emerald Hill Road, Peranakan Place was established in 1985 as part of the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority)'s (URA) designation of Emerald Hill as a conservation area. The restoration of the original row of 6 two-storey shop-houses previously built in 1902 preserved the ornate and colourful Straits Chinese style of design and architecture. The historic development, now containing several commercial businesses, sits at the junction between Emerald Hill Road and [Orchard Road](/wiki/Orchard_Road). It has since become an attraction for both locals and tourists. ## In literature and art Emerald Hill has often been featured in [Singaporean literature](/wiki/Literature_of_Singapore), particularly in the works of [Goh Sin Tub](/wiki/Goh_Sin_Tub). Such titles include: - *[Emily of Emerald Hill](/wiki/Emily_of_Emerald_Hill)* (1983), by [Stella Kon](/wiki/Stella_Kon) - *The Nan-Mei-Su Girls of Emerald Hill* (1989), by Goh Sin Tub - *The Ghost Lover of Emerald Hill*, by Goh Sin Tub - *On This Emerald Hill*, written by Jonathan Lim, directed by Christina Seargant - *[Rich People Problems](/wiki/Rich_People_Problems)* by [Kevin Kwan](/wiki/Kevin_Kwan) in which the character of Astrid has a home in Emerald Hill. - *[Emerald Hill - The Little Nyonya Story](/wiki/Emerald_Hill_-_The_Little_Nyonya_Story)*, the 2025 sequel to 2008 TV series *[The Little Nyonya](/wiki/The_Little_Nyonya)* ## Notable residents - [Seow Poh Leng](/wiki/Seow_Poh_Leng) - [Lim Koon Teck](/wiki/Lim_Koon_Teck) - Victor R Savage, Brenda S A Yeoh (2004), *Toponymics – A Study of Singapore Street Names*, Eastern University Press, [ISBN](/wiki/ISBN_(identifier)) 981-210-364-3 - Uniquely Singapore website\n",
  "language": "en",
  "processed_at": "2026-01-12T10:11:00.986788",
  "title": "Emerald Hill, Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Emerald_Hill,_Singapore"
}