{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:11:04.761802"
  },
  "content": "* *Employment in Singapore**, including the development and planning of Singapore workforce to achieve \"globally competitive workforce in a sustainable manner,\" is managed under the jurisdiction of [Ministry of Manpower](/wiki/Ministry_of_Manpower_(Singapore)). Other aspects of employment related functions as International Talent Promotion, Labour Relations, Management of Foreign Manpower, Labour Welfare and Services, are also covered by the ministry. ## Legislation Basic terms and conditions of employers-employees relations in Singapore are covered by law in the Employment Act. All employees, both Singaporeans and foreigners, who enter into a contract of service with employers are covered by the act. There are some exceptions for managers and executives, who are not covered by Part IV, which provides for rest days, hours of work, annual leave and other conditions of service. For managers and executives, these conditions vary according to what is agreed in their individual employment contract. [Workforce Singapore](/wiki/Workforce_Singapore), a statute board under the ministry, also launched the Adapt and Grow Initiative in 2016. The program helps match individuals to career opportunities, with 17,000 matchings in the first half of 2018. ## Employment Data Employment level in Singapore has been constantly increasing each year in the past decade, as reported in 2015. Latest employment level as of 3rd quarter of 2015 was reported at 3.640 million, with gains led by the Services sector. In the first three quarters of 2015, total employment level grew by 16,200. In December 2020, the unemployment rate is 3.2 per cent during the [COVID-19 pandemic in Singapore](/wiki/COVID-19_pandemic_in_Singapore). As of November 2022, unemployment rate is 1.9 per cent with Singapore resident unemployment rate at 2.8 and Singapore citizen unemployment rate at 2.9 percent. The long-term unemployment rate for Singapore residents was 0.8 per cent as of March in 2017, up from 0.7 per cent a year earlier. In the year of 2024, Singapore's resident unemployment rate increased from 2.7% to 2.8%, while the citizen unemployment rate maintained at 2.9%. ## Underemployment In a 2018 survey conducted jointly by the [Lee Kuan Yew School of Public Policy](/wiki/Lee_Kuan_Yew_School_of_Public_Policy) and [Ong Teng Cheong](/wiki/Ong_Teng_Cheong) Labour Leadership Institute, about 4.31% of the degree holders are drawing less than S$2,000 a month on a full-time job. ## Working condition According to a study conducted by recruitment consultancy [Morgan McKinley](/wiki/Morgan_McKinley), an average worker in Singapore clocked 2371 hours in 2016, the longest hours in the world. Amid the tight labour market and on-going initiatives that support work-life harmony, the proportion of establishments which provided at least one formal flexible work arrangement (FWA) improved steadily from 38% in 2011 to 47% in 2014. ## Foreign competition On 22 January 2018, Managing Director of [Monetary Authority of Singapore](/wiki/Monetary_Authority_of_Singapore), Ravi Menon gave a speech at an IPS conference advocating Singapore to employ more foreign PMETs. \"The trend of improving quality in our foreign workforce has already begun,\" he said. \"The proportion of work permit holders has declined by about 10 percentage points over last 10 years, while the proportion of S-Pass and employment pass holders has increased by around 10 percentage points.\" ## Mandatory savings scheme Singaporean and Singapore PR (SPR) employees are required to set aside part of the earnings and contribute to [Central Provident Fund](/wiki/Central_Provident_Fund). The employers are also required to contribute proportion of the earnings paid to their Singaporean and SPR employees to the fund. The contribution rates to CPF vary depending on income range and age bracket. - Employment Act (Chapter 91) Archived 3 January 2016 at the [Wayback Machine](/wiki/Wayback_Machine)\n",
  "language": "en",
  "processed_at": "2026-01-12T10:11:04.761298",
  "title": "Employment in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Employment_in_Singapore"
}