{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:11:06.748143"
  },
  "content": "1°17′14″N 103°51′06″E﻿ / ﻿1.28722°N 103.85167°E﻿ / 1.28722; 103.85167 Historic site in Empress Place The **Empress Place Building** is a building in [Singapore](/wiki/Singapore), located on the north bank of the [Singapore River](/wiki/Singapore_River) in the [Downtown Core](/wiki/Downtown_Core), within the [Central Area](/wiki/Central_Area,_Singapore). The building is currently the second wing of the [Asian Civilisations Museum](/wiki/Asian_Civilisations_Museum). The other wing of the museum is located at the [Old Tao Nan School](/wiki/Old_Tao_Nan_School) building along Armenian Street. ## History During the [colonial era](/wiki/British_Empire), the Empress Place Building was known simply as Government Offices. The first [civic](/wiki/Civic_engagement) buildings were planned here in [Sir Stamford Raffles](/wiki/Sir_Stamford_Raffles)' day. Originally intended to be a [courthouse](/wiki/Courthouse), the Empress Place Building instead became offices for the government departments located in the adjacent Maxwell's House (later the [old Parliament House](/wiki/Old_Parliament_House,_Singapore)). Maxwell's House, designed by [George Drumgoole Coleman](/wiki/George_Drumgoole_Coleman), was a two-storey house built for a merchant, John Argyle Maxwell, in 1827. However, it was never occupied by him and it became a courthouse and lands office. Subsequently, it was converted to Government Offices and additions were made in 1839 and 1847. Constructed in four phases from 1864 to 1920, Government Offices was built to provide much needed space for the growing colonial administration. The original section of the building was designed by colonial engineer J.F.A. McNair and built by convict labour between June 1864 and December 1867. This original section now forms the part of the building nearest to the old Parliament House. Yet another courthouse was built in 1865; this is now the core of the Government Offices. In 1873–1875, the old courthouse was extended towards the river and this is where the Supreme Court of the Colony held its sessions from 1875 until 1939 when the first [Supreme Court](/wiki/Old_Supreme_Court_Building,_Singapore) was built. Maxwell's original house became the Assembly House in 1954 after extensive renovations and reconstruction. The decision to build a new Town Hall was made in 1854; the building was completed in 1862. Government Offices that were housed included the Secretariat, Audit Office, Registration of Deeds Office, Land Office, [Public Works](/wiki/Public_Works) and Medical Department, Treasury and Stamp Office, and the bureaux of the Colonial Engineer, the Official Assignee, and the Inspector General of the Police Force. The Legislative chamber occupied a room on the upper floor. In front of the building was a public square which was given the name Empress Place by the Municipal Council in 1907 in honour of [Queen Victoria](/wiki/Victoria_of_the_United_Kingdom). It may well be the oldest pedestrian space in Singapore. Over time, Government Offices became associated with Empress Place and its name changed to what we know it today. As the demand for more government office space increased, three major extensions were added in 1880, 1904–1909 and 1920. Fortunately, every one of these extensions were faithful to McNair's [Neo-Palladian](/wiki/Neo-Palladian) design and the building maintained a harmonious overall look. In the surrounding area also known as Empress Place, the Memorial Hall and Tower were added in 1905 and extensive renovations were carried out from 1954 until 1979. Raffles' statue, now in front of the [Victoria Memorial Hall and Theatre](/wiki/Victoria_Theatre_and_Concert_Hall), as it is now called, was first erected on the [Padang](/wiki/Padang,_Singapore) in 1887 but later removed to its present site in 1919. A second statue, a copy of the first one, was erected at [Raffles Landing Place](/wiki/Raffles_Landing_Place) in 1972. The [Dalhousie Obelisk](/wiki/Dalhousie_Obelisk) was originally located at Dalhousie Pier but found its present place in 1886. [Cavenagh Bridge](/wiki/Cavenagh_Bridge) was built in 1869 and was converted to pedestrian traffic after the erection of [Anderson Bridge](/wiki/Anderson_Bridge_(Singapore)). These are the major elements which have contributed to the developing qualities of Empress Place. The Empress Place Building was used by government departments until the late 1980s. It is perhaps best known as the [Registry of Births and Deaths](/wiki/Civil_registry), the Citizenship Registry, and the Immigration Department. In the late 1980s, plans were made to convert Empress Place Building into a museum. Extensive restoration began, culminating in the opening of the Empress Place Museum on 7 April 1989 by the then Second [Deputy Prime Minister](/wiki/Deputy_Prime_Minister_of_Singapore) [Ong Teng Cheong](/wiki/Ong_Teng_Cheong). Although the museum was afflicted with structural and logistical problems from its inception, it nonetheless managed to organise five outstanding [exhibitions](/wiki/Collection_(museum)) on [Chinese history](/wiki/Chinese_history) in six years. The first of these exhibitions, which featured royal objects from the [Qing dynasty](/wiki/Qing_dynasty), put on display many precious [artefacts](/wiki/Artifact_(archaeology)) never seen before outside China. By 1995, the museum's problems got the better of it and on 30 April that year, it closed its doors. The Empress Place Building was [gazetted](/wiki/Gazette) as a [national monument](/wiki/National_Monuments_of_Singapore) on 14 February 1992. ubsequently, the Empress Place Building underwent renovations and opened as the second wing of the [Asian Civilisations Museum](/wiki/Asian_Civilisations_Museum) on 2 March 2003, exhibiting [Southeast](/wiki/Southeast_Asia), [South](/wiki/South_Asia) and [West Asian](/wiki/Southwest_Asia) collections. ## Architecture Located at the mouth of the [Singapore River](/wiki/Singapore_River), the Empress Place Building's imposing [Neo-Palladian](/wiki/Neo-Palladian) exterior with timber-[louvred](/wiki/Louvre_(window)) [windows](/wiki/Window) and [pitched](/wiki/Pitch_(resin)) [clay](/wiki/Clay) [tile](/wiki/Tile) roofs caught the attention of immigrants and visitors sailing into Singapore harbour. A 1905 Singapore guidebook says of Government Offices and its neighbouring buildings, \"Apart from the cities of [India](/wiki/India), there is, perhaps, no place in the East which boasts such a handsome group of [government] buildings as viewed from the sea.\" Inside, the rooms are stately, with high ceilings, handsome [Doric](/wiki/Doric_order) [columns](/wiki/Column) and exquisite [plaster](/wiki/Plaster) mouldings and [cornices](/wiki/Cornice). Elegantly proportioned, the building is laid out [symmetrically](/wiki/Symmetrical) along a central axis. - National Heritage Board (2002), *Singapore's 100 Historic Places*, Archipelago Press, [ISBN](/wiki/ISBN_(identifier)) 981-4068-23-3 - Norman Edwards, Peter Keys (1996), *Singapore – A Guide to Buildings, Streets, Places*, Times Books International, [ISBN](/wiki/ISBN_(identifier)) 9971-65-231-5 - Asian Civilisations Museum - Roots.sg website\n",
  "language": "en",
  "processed_at": "2026-01-12T10:11:06.747646",
  "title": "Empress Place Building",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Empress_Place_Building"
}