{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:11:12.887198"
  },
  "content": "Regulatory body in Singapore The **Energy Market Authority** (**EMA**) is a [statutory board](/wiki/Statutory_boards_of_the_Singapore_Government) under the [Ministry of Trade and Industry](/wiki/Ministry_of_Trade_and_Industry_(Singapore)) of the [Government of Singapore](/wiki/Government_of_Singapore). ## History EMA was set up on 1 April 2001 to take over the regulatory functions of the [Public Utilities Board](/wiki/Public_Utilities_Board_(Singapore)), and the operations of the power grid by [SP PowerGrid](/wiki/SP_Group). It aims to ensure a reliable and secure energy supply, promote effective competition in the energy market and develop a dynamic energy sector in Singapore. ## Roles EMA performs three key roles: - **Power Systems Operator**: EMA is responsible for the reliable supply of electricity to industries and consumers in Singapore. Its Power System Control Centre acts as the nerve centre to oversee the electricity and gas transmission systems and power generation plants. - **Industry Regulator**: EMA regulates the gas and electricity industries in Singapore as well as district cooling services in designated areas to ensure fair competition and protect consumers' interests. - **Industry Developer**: EMA fosters a dynamic energy sector by catalysing research and innovation, facilitating deployment of promising energy solutions, developing a future-ready workforce and engaging both regional and international stakeholders. ## Industry Regulation EMA regulates Singapore's electricity, gas and district cooling industries through legislation, policies and frameworks and codes of practice under the Energy Market Authority of Singapore Act 2001. EMA oversees the general administration of the Electricity, Gas and District Cooling Acts. As a regulator, EMA issues worker licences as well as licences to companies involved in the generation, retail and transmission of electricity, gas and district cooling services. ## Changes to Singapore's energy market The liberalisation of Singapore's energy market started in July 2001 companies with electricity demand of 2 megawatts (MW) and above were able to buy electricity from a retailer of their choice. Power generation and retail electricity markets were opened to commercial players to facilitate competition and promote efficiency alongside a wholesale electricity market with spot bidding to manage the risks of volatility in the energy market. Over the years, the threshold for commercial and industrial consumers who were allowed to switch to their preferred retailer was gradually lowered. The final phase of liberalisation took place in 2018 when households and small business consumers could also buy electricity from a retailer of their choice. Known as the Open Electricity Market initiative, it started with a soft launch in Jurong in April 2018 before it was extended to the rest of Singapore from November 2018 to May 2019. The [global energy crunch](/wiki/Global_energy_crisis_(2021%E2%80%93present)) of 2021 and 2022 saw a significant increase in gas prices due to high demand and tight supply. The risk of disruptions in global gas supply was further exacerbated by the [Russian invasion of Ukraine](/wiki/Russian_invasion_of_Ukraine). This global energy crisis highlighted the risks that global gas supply could cause to Singapore's electricity supply. Furthermore, investments in new generation capacity in Singapore are traditionally driven by individual power generation companies which may not necessarily ensure there is sufficient generation capacity to meet the power system's overall demand. In 2022, EMA announced that it will introduce market guardrails to strengthen its existing market structure, which include: 1. A centralised process to facilitate private investments in new power generation capacity 2. Enhanced regulatory requirements on electricity retailers to strengthen consumer protection 3. A Temporary Price Cap mechanism to guard against extreme price volatility in the wholesale electricity market EMA also intends to set up a centralised gas procurement framework to improve the security and adequacy of gas supply. ## Singapore's Energy Story To decarbonise the energy sector, the Singapore Energy Story where Singapore will harness the 4 Switches to transform its energy supply while ensuring continued energy reliability and cost-competitiveness was announced at SIEW 2019. These efforts are in support of Singapore's goal to achieve net-zero by 2050. ## Singapore International Energy Week The annual [Singapore International Energy Week](/wiki/Singapore_International_Energy_Week) (SIEW) was launched by EMA in 2008 as a leading platform for in-depth discussions on key energy issues affecting Asia. The event features a diverse range of forums, panel discussions, exhibitions, and networking opportunities that provides attendees with a comprehensive understanding of emerging trends, technological advancements, and policy frameworks shaping the energy landscape. Held at the sidelines of SIEW is Youth@SIEW, which includes dialogues with government and industry leaders, career journey sharing sessions by energy-sector professionals and a showcase of energy-related projects by students. ## Energy sector workforce To address evolving manpower challenges as the energy sector continues to decarbonise, EMA collaborates closely with industry stakeholders, academic institutions and training providers to ensure a skilled and steady pipeline of local workforce, capable of meeting the sector's future manpower needs. Initiatives to nurture a pipeline of manpower and cultivate interest in the energy sector include having industry-centric scholarships such as the Singapore-Industry Scholarship and Energy Industry Scholarship. EMA is also co-chair of the Technical Sub-Workgroup for Energy which was set up under the ambit of the Green Skills Committee which support skills development for green jobs. - [Energy in Singapore](/wiki/Energy_in_Singapore) - [Singapore International Energy Week](/wiki/Singapore_International_Energy_Week) - Energy 2050 Committee Report - Official website - Singapore International Energy Week website - Powering Lives website - Ministry of Trade and Industry website\n",
  "language": "en",
  "processed_at": "2026-01-12T10:11:12.885975",
  "title": "Energy Market Authority",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Energy_Market_Authority"
}