{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T14:36:40.413720"
  },
  "content": "This article **may need to be rewritten** to comply with Wikipedia's quality standards. Relevant discussion may be found on the talk page. You can help. The talk page may contain suggestions. *(February 2023)* **Energy in Singapore** is critically influenced by its strategic position in maritime [Southeast Asia](/wiki/Southeast_Asia), nestled between [Malaysia](/wiki/Malaysia) and the [Singapore](/wiki/Singapore) Strait, near essential maritime routes like the [Straits of Malacca](/wiki/Strait_of_Malacca) and the [South China Sea](/wiki/South_China_Sea). This location has established Singapore as a central hub for the global [petroleum](/wiki/Petroleum), [petrochemical](/wiki/Petrochemical), and chemical industries, with [Jurong Island](/wiki/Jurong_Island) serving as a key base for over 100 international companies in these sectors. The majority of Singapore's energy consumption is derived from petroleum and other liquids, accounting for 86% of its total energy use, while [natural gas](/wiki/Natural_gas) represents 13%, and coal and [renewable resources](/wiki/Renewable_resource) make up the remaining 1%. Energy in Singapore has evolved in response to its [environmental footprint](/wiki/Environmental_issues) and reliance on [fossil fuels](/wiki/Fossil_fuel). The government has implemented several strategies to transition towards a more sustainable energy model. In 2019, Singapore introduced the Carbon Pricing Act, aimed at reducing [carbon emissions](/wiki/Greenhouse_gas_emissions) by imposing a tax on greenhouse gas emissions. Concurrently, the [Energy Market Authority](/wiki/Energy_Market_Authority) launched the \"4 Switches\" strategy, which focuses on enhancing energy efficiency, increasing the adoption of renewable energy sources, and integrating advanced technologies such as carbon capture and storage. In addition to legislative measures, the [Singapore Green Plan](/wiki/Singapore_Green_Plan) has been developed to set forth clear objectives for environmental improvement and [sustainability](/wiki/Sustainability). This plan includes initiatives to expand green spaces, phase out new registrations of diesel vehicles by 2025, significantly expand the [electric vehicle](/wiki/Electric_vehicle) charging infrastructure, and increase the deployment of [solar energy](/wiki/Solar_energy) to 2 gigawatts by 2030. Singapore has set ambitious targets aimed at enhancing energy efficiency and reducing its environmental footprint. By 2030, the country plans to improve its energy efficiency by 36% compared to levels in 2005. Supporting measures have included implementing energy efficiency standards and introducing labelling for lamps in 2015. Additionally, Singapore is working to increase its [solar photovoltaic](/wiki/Photovoltaic_system) (PV) capacity and aims to reduce greenhouse gas emissions by 16% below what they would be in 2020, with emissions expected to peak by 2030. Singapore also plans for hydrogen to meet up to half of Singapore’s power needs by 2050. ## Overview Energy in Singapore Population (million)Prim. energy (TWh)Production (TWh)Import (TWh)Electricity (TWh)CO2-emission (Mt)20044.24298054834.638.120074.59311062839.145.020084.84215065039.644.320095.0215068539.744.820125.23881191943.664.82012R5.312917.082346.249.820135.403047.485547.746.6Change 2004–0917.7%-27.8%0%25.1%14.5%17.8% Mtoe = 11.63 TWh, Prim. energy includes energy losses 2012R = CO2 calculation criteria changed, numbers updated According to the [IEA](/wiki/International_Energy_Agency) Singapore had no energy production in 2008. Energy imports increased 18.6% in 2008 compared to 2004. The primary energy declined by about one third in 2007-8 but during the same period energy imports increased. Energy import was about three times the total primary energy supply in 2008. Compared to the UK in 2008, per capita electricity consumption was 135% and per capita carbon dioxide emissions were 110%. (UK: 61.35 m people 372.19 TWh electricity, 510.63Mt CO2 emissions). The use of energy (primary energy) in Singapore is only 1/3 of the imported energy. ## History On 5 February 1983, the power generators at Jurong Power Station tripped, leading to a cascading effect of tripping both [Senoko](/wiki/Senoko_Power_Station) and Pasir Panjang Power Stations. Singapore was without power for eight hours and 42 minutes before all power was restored. In 2019, Minister for Trade and Industry [Chan Chun Sing](/wiki/Chan_Chun_Sing) spoke about the Singapore Energy Story to guide the energy sector towards greater sustainability, while maintaining a reliable and affordable energy supply. As part of its energy transition towards cleaner energy, Singapore will use four supply sources, supported with efforts in [energy efficiency](/wiki/Efficient_energy_use) to reduce energy demand. ## Fossil fuels ### Oil In 2021, Singapore's oil supply totaled 1,027,948 terajoules, a 42% increase from 2000, comprising both crude and refined products, net of exports and storage. Oil constituted 69.7% of the total energy supply. All of Singapore's [crude oil](/wiki/Petroleum) was imported, with imports growing by 13% since 2000. Oil products imports surged to 208.8% of total consumption, a significant rise of 159% over the same period. Crude oil and oil products represented 30% and 63% of total energy imports, respectively. Oil products were mainly used in transport and non-energy sectors like [plastics](/wiki/Plastic) and chemicals production. Non-energy use comprised 55% of oil products' final consumption, with naphtha being the most consumed, accounting for 50%. These figures highlight Singapore’s heavy reliance on imported oil and the associated environmental challenges. ### Natural Gas In the early 2000s, Singapore started receiving natural gas from Malaysia and Indonesia via pipelines. To further diversify its gas sources, the city-state began importing LNG via the Singapore SLNG Terminal which began operations in May 2013. In 2008, BG Group (which merged with Shell in 2016) won an exclusive franchise to supply as much as 3 million tonnes per annum (mpta) of LNG. [Energy Market Authority](/wiki/Energy_Market_Authority) (EMA) subsequently launched a competitive Request for Proposal process in 2014 which saw Shell Eastern and Pavilion Gas being appointed LNG importers in 2016. Another two term importers - [ExxonMobil](/wiki/ExxonMobil) LNG Asia Pacific and Sembcorp Fuels - were subsequently appointed in 2021. In 2021, Singapore's natural gas imports showed a staggering increase, climbing by 754% since 2000, with the entire supply sourced from international markets. This total reliance on external sources poses significant [energy security](/wiki/Energy_security) concerns, heightened by global events such as [Russia’s invasion of Ukraine](/wiki/Russian_invasion_of_Ukraine). The natural gas sector is pivotal in both the energy and industrial sectors in Singapore. It fueled 93.9% of the total electricity generation in 2021—an 804% rise since 2000. Additionally, the industrial sector, which mainly uses natural gas for chemicals and plastics production, accounted for 89% of its final consumption. CO2 emissions from natural gas were 22.528 million tonnes in 2021, up by 684% from 2000, highlighting the need for stringent environmental management despite its status as a cleaner alternative to coal and oil. In 2022, Singapore launched a Request for Proposal to appoint up to two LNG importers to provide more options for gas buyers, in addition to the four term importers. As of October 2025, about 95 per cent of Singapore’s electricity is generated with natural gas. ## Renewable energy sources ### Palm Oil The biggest [palm oil](/wiki/Palm_oil)-based [diesel](/wiki/Diesel_fuel) plant in the world, 800,000 t/a production, started operations in Singapore at the end of 2010 by [Neste Oil](/wiki/Neste_Oil) from [Finland](/wiki/Finland). The plant requires almost a million tonnes of raw material annually from the [oil palm](/wiki/Oil_palm) *Elaeis guineensis*, equivalent to 2,600–3,400 km2 oil palm [plantation](/wiki/Plantation). [Greenpeace](/wiki/Greenpeace) demonstrated in November 2010 in [Espoo](/wiki/Espoo), Finland, by hanging an [orangutan](/wiki/Orangutan) puppet in front of Neste Oil, saying that Neste Oil endangers the [rainforest](/wiki/Rainforest) ecosystem. According to [UNEP](/wiki/UNEP) the majority of new palm oil plantations take place in the [rainforests](/wiki/Rainforests). According to [European Union](/wiki/European_Union) studies the increased demand for palm oil inevitably leads to new plantations being established in the forests and [peat](/wiki/Peat) land areas. Land use changes have large [green house gas](/wiki/Green_house_gas) emissions making [palm oil diesel](/wiki/Palm_oil_diesel) much more harmful than petroleum in respect to [global warming](/wiki/Global_warming). According to [Greenpeace](/wiki/Greenpeace) the Neste Oil plant in Singapore made Finnish Neste Oil among the world's leading palm oil consumers leading to increased rain forest destruction. [Reducing emissions from deforestation and forest degradation](/wiki/Reducing_emissions_from_deforestation_and_forest_degradation) (REDD) would be a way to [mitigate climate change](/wiki/Climate_change_mitigation). According to [UNEP](/wiki/UNEP) the international [REDD mechanism](/wiki/REDD) will be a key element of Post–Kyoto Protocol negotiations on [the post-2012 international climate change](/wiki/Greenhouse_gas_emissions) regime. ## Electricity Generation ### Natural Gas In 2019, around 95 per cent of Singapore's electricity is produced using piped or liquefied [natural gas](/wiki/Natural_gas) (LNG). Natural gas remains a key fuel for Singapore's power generation as it scales up efforts to harness solar and develop other low-carbon technologies. In 2025, electricity generation in Singapore via natural gas remained at 95 percent. ### Nuclear Power In 2012, Singapore conducted a pre-feasibility study on the deployment of nuclear energy in Singapore but was deemed unsuitable for Singapore. During the 2024 Budget speech by [Deputy Prime Minister](/wiki/Deputy_prime_minister) and [Finance Minister](/wiki/Ministry_of_Finance_(Singapore)) [Lawrence Wong](/wiki/Lawrence_Wong), did not rule out using nuclear energy as a source of electricity in Singapore. During the 2025 Budget speech by Prime Minister Lawrence Wong, he said Singapore had already signed agreements with the [United States](/wiki/United_States) on civil nuclear cooperation and also planned to work with other countries with capabilities and experience in civilian nuclear power, especially small modular reactors (SMRs). Various government agencies, such as EMA, had conducted visits to international organisations and partners on nuclear energy such as the [International Atomic Energy Agency](/wiki/International_Atomic_Energy_Agency), [United Kingdom Atomic Energy Authority](/wiki/United_Kingdom_Atomic_Energy_Authority) and the [Max Planck Society](/wiki/Max_Planck_Society). ### Renewables #### Solar [Solar](/wiki/Solar_power) is considered to be Singapore's most viable [renewable energy](/wiki/Renewable_energy) option, as the island nation is \"alternative-energy disadvantaged\" with low wind speeds, low tidal range, and no hydro resources. Total solar energy capacity 2014–2023 (MW): 3 **2014****2015****2016****2017****2018****2019****2020****2021****2022****2023**264697116162272332487633774 [Jurong Port](/wiki/Jurong_Port) built a 10MW solar installation on the roofs of its warehouses, commissioned in 2016. Singapore set a target of generating solar power to cover 350,000 households in 2030 that would correspond to 4% of the country's electricity demand in 2020. To promote renewable energy in the country it is advised that the government develops incentive and regulatory support mechanism; consolidate solar energy governance; mobilise equity investors and lenders; and specialise in the long-distance trade of renewable energy, especially in the form of hydrogen. In 2020, Singapore achieved its target of deploying 350 megawatt-peak (MWp) of solar. Under the [Singapore Green Plan](/wiki/Singapore_Green_Plan_2030), the country aims to achieve 2 gigawatt-peak of solar by 2030, equivalent to powering around 350,000 households a year. Singapore also aims to deploy 200 megawatts (MW) of [energy storage](/wiki/Energy_storage) systems beyond 2025 to mitigate solar intermittency and reduce peak demand. The first utility-scale energy storage system testbed was deployed at a substation in Woodlands in October 2020. EMA has also partnered with Keppel Offshore & Marine to pilot Singapore's first floating energy storage system. In July 2021, [Sembcorp](/wiki/Sembcorp) opened one of the world's largest [floating solar](/wiki/Floating_solar) plants, with 60 MW of panels on the [Tengeh Reservoir](/wiki/Tengeh_reservoir). Singapore is also planning a 141 MW project on [Kranji Reservoir](/wiki/Kranji_Reservoir). On the 22 October of 2024, Sun Cable was granted conditional approval by the [Energy Market Authority (EMA)](/wiki/Energy_Market_Authority) of Singapore to import 1.75 gigawatt (GW) of electricity from Australia to Singapore. The energy is expected to be generated through solar in Australia's Northern Territory and transmitted via a new 4,300 km subsea cable. [*AI-retrieved source*] ### Regional Power Grids Singapore plans to tap on regional power grids to access low-carbon electricity beyond its borders. It plans to import up to 6 gigawatts (GW) of low-carbon electricity by 2035, which could make up around 30 per cent of the country's energy needs in 2035. EMA had been carrying out trials to import electricity from regional power grids, such as a two-year trial to import 100 megawatts (MW) of electricity from Peninsular Malaysia, 100MW of electricity from Laos via the Lao DPR-Thailand-Malaysia-Singapore Power Integration Project (LTMS-PIP) under the [ASEAN Power Grid](/wiki/ASEAN_Power_Grid) Project, and 100MW equivalent of non-intermittent electricity from a solar farm in [Pulau Bulan](/wiki/Bulan_Island), Indonesia. The wider [ASEAN Power Grid](/wiki/ASEAN_Power_Grid) project is attempting to create a number of cross border connections from Singapore to other [ASEAN](/wiki/ASEAN) nations. In November 2021, EMA issued its first request for proposals to appoint electricity importers to import and sell about 1.2 GW of low-carbon electricity into Singapore, to begin by 2027. In July 2022, EMA issued its second request for proposals for low-carbon electricity imports, and streamlined the process to evaluate proposals from both proposal request exercises. ### Low-Carbon Alternatives Singapore is also studying different low-carbon technologies such as [hydrogen](/wiki/Hydrogen), [carbon capture, utilisation and storage](/wiki/Carbon_capture_and_storage) and [geothermal energy](/wiki/Geothermal_energy) for possible adoption in the longer term. In October 2020, the Singapore Government announced a $49 million low-carbon energy research funding initiative to support research, development and demonstration projects in low-carbon technologies, such as hydrogen and carbon capture, utilisation and storage. This was later expanded to $55 million in 2021, with the funds going to 12 research projects. In April 2022, EMA issued a Request for Information in its bid to assess the potential of geothermal energy across Singapore. EMA planned to follow up with a Request for Proposal to assess the viability and scalability of deploying geothermal systems in Singapore. ### Energy Efficiency In 2018, EMA launched the Genco Energy Efficiency Grant Call to encourage power generation companies to adopt energy efficiency technologies by co-funding up to 50 per cent of their projects. This was part of the Enhanced Industry Energy Efficiency Package that was announced by the Singapore Government that same year. In October 2020, $23 million in grants were awarded to three power generation companies for energy efficiency projects. The industrial sector can also tap on the Resource Energy Efficient Grant, supported by the [Economic Development Board](/wiki/Economic_Development_Board), and the Energy Efficiency Fund, supported by the [National Environment Agency](/wiki/National_Environment_Agency). Oil consumption 2011-2021 (**kb/d**): 20 **2011****2012****2013****2014****2015****2016****2017****2018****2019****2020****2021**12081202121712591329137214051432140313431330 By end 2024, all households in Singapore will have advanced electricity meters installed in their premises that will enable them to track and manage their electricity consumption. Singapore was the top 10th country in oil imports in 2008: 50 megatonnes. For comparison, oil imports in Spain were 77 megatonnes (the top 8th country, with a population of 45.59 million) and in Italy they were 73 megatonnes (the top 9th country, with a population of 59.89 million). ## Electricity The electricity sector in Singapore ranges from [generation](/wiki/Electricity_generation), [transmission](/wiki/Electric_power_transmission), [distribution](/wiki/Electric_power_distribution) and [retailing](/wiki/Electricity_market) of [electricity](/wiki/Electricity) in [Singapore](/wiki/Singapore). The electricity sector in Singapore is regulated by the [Energy Market Authority](/wiki/Energy_Market_Authority) (EMA). As of 2015, Singapore uses [natural gas](/wiki/Natural_gas) (95%) and waste (4%) for power stations' fuel. [Oil](/wiki/Oil) used to contribute 23% in 2005 but is reduced to 1%. The fossil fuel basis of Singapore's electricity system affects the way that electric cars are taxed. As of October 2025, about 95 per cent of Singapore’s electricity continued to be generated with natural gas. Electricity generation 2011-2021 (**TWh**): 50 **2011****2012****2013****2014****2015****2016****2017****2018****2019****2020****2021**46.046.948.049.350.351.652.252.954.153.155.8 In 2022, Singapore's electricity generation capacity was about 12,800MW but electricity usage is expected to increase and additional generation capacity will be needed. The demand is due to economic growth, growing electrification and increased digitalisation. To address its rising electricity demand, driven by sectors such as advanced [manufacturing](/wiki/Manufacturing) and transport, Singapore is focusing on enhancing its generation capacity. In July 2023, EMA launched a request for proposal to increase generation capacity to meet the projected growth in demand and maintain system reliability which the request was closed on 31 October. In 2024, EMA announced that [YTL PowerSeraya](/wiki/PowerSeraya) won the right to build, own and operate a hydrogen-ready combined cycle gas turbine turbine to be completed by end 2027. The turbine will have a capacity of 600 MW and built as an extension to the existing [Pulau Seraya Power Station](/wiki/Pulau_Seraya_Power_Station) on [Jurong Island](/wiki/Jurong_Island). The turbine can use up to 30 per cent hydrogen and 70 per cent fossil fuels for electricity generation while also have the ability to be retrofitted to be fully powered by hydrogen as needed. On 4 June 2024, the EMA initiated a request for proposals to build and operate two new hydrogen-ready [gas-fired power plants](/wiki/Gas-fired_power_plant), each with a minimum capacity of 600 megawatts. Scheduled to start operations in 2029 and 2030, respectively, these facilities are integral to Singapore's comprehensive strategy to meet an anticipated peak power demand of 11.8 gigawatts by 2030. This effort underscores the nation's commitment to maintaining a reliable and adequate electricity supply for its expanding economy and population. ### Companies - [ES Power Singapore](/wiki/ES_Power_Singapore) - [PacificLight Power Pte Ltd](/wiki/PacificLight) - Keppel Merlimau Cogen Pte Ltd - Keppel Seghers - National Environment Agency - PowerSeraya Ltd - [SembCorp Cogen Pte Ltd](/wiki/SembCorp_Cogen_Pte_Ltd) - [Senoko Energy Pte Ltd](/wiki/Senoko_Power_Station) - [Tuas Power Ltd](/wiki/Tuas_Power_Ltd) ## Companies ### Wilmar International [Wilmar International](/wiki/Wilmar_International) is listed in Singapore. Headed by Kuok Khoon Hong, it is the world's largest palm oil firm. Kuok was the third richest person in Singapore in 2009 with a net worth of $3.5 billion. According to [Finnwatch](/wiki/Finnwatch) in 2007 the Kuok family owned by Malaysian companies a [biofuel](/wiki/Biofuel) plant in Indonesia (225 000 t/a). ## Policy instruments to curb carbon dioxide emissions ### Carbon tax On 20 February 2017, Singapore proposed a [carbon tax](/wiki/Carbon_tax). The proposal was refined to tax large emitters at [S$](/wiki/Singapore_dollar)5 ([US$](/wiki/USD)3.73) per tonne of greenhouse gas emissions. The Carbon Pricing Act was passed on 20 March 2018 and came into force on 1 January 2019. Singapore's 2022 budget proposes raising the carbon tax to [S$](/wiki/Singapore_dollar)25 ([US$](/wiki/USD)18.66) in 2024, [S$](/wiki/Singapore_dollar)45 ([US$](/wiki/USD)33.58) in 2026, and [S$](/wiki/Singapore_dollar)50 ([US$](/wiki/USD)37.31)–[S$](/wiki/Singapore_dollar)80 ([US$](/wiki/USD)59.7) by 2030.\n",
  "language": "en",
  "processed_at": "2026-01-12T14:36:40.413186",
  "title": "Energy in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Energy_in_Singapore"
}