{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T14:36:41.964849"
  },
  "content": "* *Eng Aun Tong Building**, also known as **Tiger Balm Medical Hall**, is a historic building at the corner of [Neil Road](/wiki/Neil_Road) and [Craig Road](/wiki/Craig_Road_(Singapore)) in [Tanjong Pagar, Singapore](/wiki/Tanjong_Pagar). Completed in the 1920s, it served as the [Tiger Balm](/wiki/Tiger_Balm) factory for several decades. ## Description The building was designed in the [Neoclassical style](/wiki/Neoclassical_architecture), featuring cornices, arches, columns and a hexagonal pavilion on the roof, which may be a reference to the Tiger Balm bottle. It previously featured a model of a tiger on its front. The building is among the few pre-[World War II](/wiki/World_War_II) structures in Singapore to feature a flat roof. ## History The building was opened as the Tiger Balm factory in 1926 by brothers [Aw Boon Haw](/wiki/Aw_Boon_Haw) and [Aw Boon Par](/wiki/Aw_Boon_Par). Aw Boon Haw soon filed a lawsuit against a medical hall of the same name which had been established earlier at nearby 132-134 [Tanjong Pagar Road](/wiki/Tanjong_Pagar_Road), demanding that the older business change its name. He lost the charge, and both businesses \"went on to co-exist peacefully for years\". The building continued to serve as the Tiger Balm factory for around 50 years. On 10 August 1961, a fire in the building resulted in the destruction of $3,000 worth of Chinese medicinal products. The building was purchased by garment maker Singapore Crocodile in 1973. In 1995, the company leased it to the newly-established French Business Centre, which aimed to support French [Small and medium-sized enterprises](/wiki/Small_and_medium-sized_enterprises) who were looking to set up in Singapore, until 2000. In July 1997, Singapore Crocodile put the property up for sale with an asking price of $22 million. However, the company withdrew the sale as a result of the \"depressed property market\". In 2007, [PayPal](/wiki/PayPal) moved into the building. In this period, the building also housed [eBay](/wiki/EBay) and [Skype](/wiki/Skype). On 4 December 2019, American [fast casual](/wiki/Fast_casual) chain [Shake Shack](/wiki/Shake_Shack) announced that it would be opening its second Singaporean outlet in the building. The outlet opened on 7 February 2020, occupying the building's ground floor. 1°16′43″N 103°50′30″E﻿ / ﻿1.27856°N 103.84168°E﻿ / 1.27856; 103.84168\n",
  "language": "en",
  "processed_at": "2026-01-12T14:36:41.964183",
  "title": "Eng Aun Tong Building",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Eng_Aun_Tong_Building"
}