{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T14:36:43.537848"
  },
  "content": "Shopping mall in Ang Mo Kio, Singapore **Eng Wah Global**, formerly **Eng Wah Organisation** and **Eng Wah Theatres Organisation**, is a Singaporean company spanning hospitality, lifestyle, and real estate in Singapore and Malaysia. ## History In 1946, [Goh Eng Wah](/wiki/Goh_Eng_Wah) and his partner in a business to import and screen Shanghai films, rented a performance stage at [Happy World Amusement Park](/wiki/Happy_World_Amusement_Park) at [Geylang](/wiki/Geylang), which were later renovated and opened as Victory Theatre. In the late 1960s, Goh has formed Eng Wah Theatres Organisation Pte Ltd, expanded his cinema chain to Raffles Hotel (Jubilee Hall) (1966) and King's Theatre at Tiong Bahru (1968). In the 1970s and 1980s, the cinema expanded into new HDB towns in [Toa Payoh](/wiki/Toa_Payoh), [Ang Mo Kio](/wiki/Ang_Mo_Kio), [Clementi](/wiki/Clementi,_Singapore) and [Kallang](/wiki/Kallang). The major expansion made Eng Wah hold its position as the leading film exhibitor and distributor. In 1988, Eng Wah has clinched the operation rights for Marina Theatre, making its debut in the downtown Singapore. On 7 July 1994, the cinema became the first operator to be listed in the [SGX](/wiki/Singapore_Exchange) 1 as Eng Wah Organisation. At the same time, it also converts its single screen cinemas into entertainment centres at Clementi (1995), Ang Mo Kio (1996), Toa Payoh (1997) and formed a cineplex joint venture with Shaw to manage the 4 screen Lot 1 Cineplex at the Lot 1 Shoppers Mall in Choa Chu Kang (1996). In the late 1990s, the group again expanded its cinema chains to newer HDB towns in [Bukit Batok](/wiki/West_Mall) (1998), [Pasir Ris](/wiki/White_Sands_Shopping_Centre,_Singapore) (1997) and [Sembawang](/wiki/Sun_Plaza,_Singapore) (2000). It also open its first cineplex in downtown at Suntec City (1998). In the early 2000s, it became the first cinema exhibitor in Singapore to implement an on-line loyalty programme named Friends of Eng Wah as well as providing the SMS-a-movie service (2002). Eng Wah is the first exhibitor outside of the United States to deploy a full 2K Digital Cinema system and first exhibitor in the world to commercially screen a full 2K-enabled digital movie. In addition, the group have the most 2K Digital Cineplex in the world (2004). In 2005, the group signed a deal with [Crazy Horse](/wiki/Crazy_Horse_(cabaret)) but closed in 2007 due to poor patronage. In 2007, the cinema is one of the first showcase 4D Digital cinema technology with *[Spider-Man 3](/wiki/Spider-Man_3)* on 1 May 2007 at Suntec City. In 2008, the group went through a reverse handover with Transcu and sold the properties to Mr Goh Eng Wah's company for $99.5 million. In early 2010s, the group announced to spend $100 million to revamp the cinemas and opens Hotel Fort Canning. Eng Wah Cinemas has rebrand itself as WE Cinemas following a renovation at Suntec City outlet but for Suntec City outlet, this was taken over by Golden Village and merged the Marina Square cinema. In 2015, 321 Clementi opens after two years hiatus from the cinema operation since the closure of West Mall and Suntec City outlets. In 2024, WE Cinemas announced closure of the cinema, but not too long before Cathay Cineplexes does otherwise due to financial issues. Eng Wah and Sunset Hospitality Group (SHG) made a deal to transfer management of Hotel Fort Canning in Q3 2025 as Mett Singapore. ### Events Since 2007, the group is the principal partner for the National Day Parade. In 2010, the group is the first to pledge support to Singapore's bid for the Youth Olympic Games 2010. In 2012, WE Cinemas hosted the F!rst Film Fest 2012 at Suntec City on 9 April with [Institute of Technical Education](/wiki/Institute_of_Technical_Education) for the short film competition to mark its 1st birthday. ### Awards Eng Wah was placed among the top 100 Asian companies in CIO Asia's CIO 100 List. (2005) Eng Wah Suntec was featured as the cineplex for Best Service, Best Snack Bar, Best Sound – The Sunday Times (2006) Eng Wah was awarded as SPBA Heritage Brand Award Winner (2006) Eng Wah was elected as one of the \"100 Singapore Icons\"; a representation of logos, symbols, trademarks and icons that are significant to Singapore's social history and visual culture. (2010) ## Eng Wah Global Operations ### Shopping Mall Eng Wah Global owns 2 shopping malls, Jubilee Square and 321 Clementi, located at the two heartland town centres in Ang Mo Kio and Clementi respectively. In 1972, Eng Wah Organisation opened the Toa Payoh Cinema in Toa Payoh Town Centre. In November 1997, the cinema converted into a shopping mall, Toa Payoh Entertainment Centre, comprising retail outlets and a 5 hall cineplex. Due to declining ticket sales for the cinema and footfall to the Entertainment Centre, the Toa Payoh Entertainment Centre was closed down on 9 December 2010. The building was subsequently sold to Hersing Pte Ltd and renamed as ERA Centre. In 1979, Eng Wah Organization opened the Jubilee Cinema in Ang Mo Kio Town Centre. The complex is converted into an entertainment centre in 1996, Jubilee Entertainment Centre, expanding its retail space and a 4 hall cineplex. Due to fierce competition from the 8 hall Cathay AMK Hub and declining ticket sales, the cinema was closed down to make way for retail space. In 2012, the revamped mall is opened as Jubilee Square. In 1981, Eng Wah Organization opened the **Empress Cinema** in Clementi Town Centre. The complex is converted into an entertainment centre in 1995, Empress Cineplex, comprising a 3 hall cineplex and retail outlets. The entertainment centre was closed in 2006 for redevelopment opened in 2015 as 321 Clementi. ### Hotels Eng Wah Global owns three hotel properties, two in Singapore, [Hotel Fort Canning](/wiki/Hotel_Fort_Canning) and The Legends Fort Canning Park, and one in Malaysia. ### Cinemas **WE Cinemas** (Chinese 荣华戏院) was a Singaporean cinema operator managed by Eng Wah Global Pte Ltd. Previously known as **Eng Wah Cinemas**, it was rebranded to its current name in April 2011. It ceased operations in 2024 with the closure of its last outlet at 321 Clementi. **Former locations** **Cinema****Screens/Halls****Seats****Location****Opening Year****Closed Year****Ref**Empress (321 Clementi)10728[Clementi](/wiki/Clementi,_Singapore)19782024Victory & Happy2-[Gay World Amusement Park](/wiki/Gay_World_Amusement_Park)19461987Hollywood1-[Katong](/wiki/Katong)19581995Jubilee Hall1-[Raffles Hotel](/wiki/Raffles_Hotel)19661980sKing's1-[Tiong Bahru](/wiki/Tiong_Bahru)1960s1982Jubilee4734[Ang Mo Kio](/wiki/Ang_Mo_Kio)19752010Mandarin2-[Geylang Bahru](/wiki/Geylang_Bahru)19761999[Marina Square](/wiki/Marina_Square)2700[Downtown Core](/wiki/Downtown_Core)19881998[Sun Plaza](/wiki/Sun_Plaza,_Singapore)61243[Sembawang](/wiki/Sembawang)20002009[Suntec City](/wiki/Suntec_City)51072[Downtown Core](/wiki/Downtown_Core)19982013 Toa Payoh Theatre5934[Toa Payoh Entertainment Centre](/wiki/Toa_Payoh)19722010[West Mall](/wiki/West_Mall)61378[Bukit Batok](/wiki/Bukit_Batok)19982012[White Sands](/wiki/White_Sands_Shopping_Centre)4800[Pasir Ris](/wiki/Pasir_Ris)19971999 - [List of cinemas in Singapore](/wiki/List_of_cinemas_in_Singapore)\n",
  "language": "en",
  "processed_at": "2026-01-12T14:36:43.529071",
  "title": "Eng Wah Global",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Eng_Wah_Global"
}