{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T14:36:45.443964"
  },
  "content": "This article **possibly contains original research**. Please improve it by verifying the claims made and adding inline citations. Statements consisting only of original research should be removed. *(February 2016)* *(Learn how and when to remove this message)* The **Enlistment Act 1970** is a [statute](/wiki/Statute) of the [Parliament of Singapore](/wiki/Parliament_of_Singapore) that caters for the enlistment of persons in the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces). The law repeals the Singapore Army Act and People's Defence Force Act of 1965 and is designed specifically to subject enlisted personnel under military law during the period of enlistment and service. ## Overview The Enlistment Act is an act that empowers the Singapore Armed Forces in enlisting Singaporeans for military service. The law broadly covers the following aspects of military law that is subjected to a conscript during his term of service: - Persons required to register, failure which a person may be found guilty of consequential offences up to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 3 years or to both. - Fitness examinations as well as medical examinations which will forbid any person who is not medically fit to be found fit for service. - Duties to report for enlistment and to render full-time service, with a liability that may be transferred from one service to another for a period not exceeding 2 years and 6 months (usually only two years in recent years). - Operationally ready national service liability i.e. reservist liability, and the computation of the period of service. - Liability to render mobilization service. - Regular service and its terms and conditions. - Role of employers in reinstatement of servicemen in employment, granting leave of absence while employers are prohibited against dismissal of an employee arising from his liability. - Other miscellaneous provisions, etc. Citizens that miss or slight their conscription liabilities, as well as Permanent Residents of Singapore who renounce their PR status without serving national service will also face adverse consequences. ## Uses of the Act With the establishment of the [Singapore Army](/wiki/Singapore_Army) as a full-time army responsible for national defence following the Singapore Army Act of 1965, there was a pressing need of running the military with scarce Singaporean manpower. While the People's Defence Force Act of 1965 allowed volunteers in the military, the order of enlistment was eventually passed in the parliament of Singapore for non-disabled Singaporeans. Each year there is an estimated number of around 52,466 that reach military age and around 20,000 to 45,800 conscripts are absorbed into the [Total Defence (Singapore)](/wiki/Total_Defence_(Singapore)) strategized services. ### Case Studies of Negative Demonstrations More recently in the 21st century, examples of well-known offences include a $3,000 fine handed to celebrity pianist [Melvyn Tan](/wiki/Melvyn_Tan) for defaulting on his NS for more than three decades. Also, Brian Joseph Chow was jailed 1+1⁄2 months after he failed to enlist for more than six years. Brian is a Singaporean born and bred locally who had left the country at 15 to study in Australia before returning to serve his conscription liabilities after surrendering in May 2013. Brian has [attention deficit disorder](/wiki/Attention_deficit_disorder) and his sentence was halved by Justice [Chan Seng Onn](/wiki/Chan_Seng_Onn) due to his outstanding performance during his national service after his surrender. In another 2016 case, a 19-year-old teenager Brandon Smith born in Singapore but brought up in [New Zealand](/wiki/New_Zealand) faces two years' jail or a $10,000 fine as he seeks exemption from conscription in Singapore on the excuse of him living mostly in New Zealand with his dual citizenship. He is required to report for a pre-service medical. Similar incidents include the three Bugges brothers who were born in Singapore. In September 2013, Sky Vayden Lim was also a target of scorn as a \"disgrace to Singapore\" who had \"no integrity and honesty\" for cheating the system after he claimed via [Facebook](/wiki/Facebook) that he received a medical classification of \"PES E9 for army, the lowest possible in army\" such that he may run his own business during military service. Deferments are usually unlikely in such cases. - [Singapore Armed Forces](/wiki/Singapore_Armed_Forces) - [Singapore Police Force](/wiki/Singapore_Police_Force) - [Singapore Civil Defence](/wiki/Singapore_Civil_Defence) - [Ministry of Defence (Singapore)](/wiki/Ministry_of_Defence_(Singapore)) - Enlistment Act(CHAPTER 93) Archived 2016-03-04 at the [Wayback Machine](/wiki/Wayback_Machine)\n",
  "language": "en",
  "processed_at": "2026-01-12T14:36:45.443425",
  "title": "Enlistment Act 1970",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Enlistment_Act_1970"
}