{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:01:43.925565"
  },
  "content": "Development board in Singapore aimed at small and medium businesses**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **relies excessively on references to primary sources**. Please improve this article by adding secondary or tertiary sources. *Find sources:* \"Enterprise Singapore\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(August 2018)* *(Learn how and when to remove this message)*This article contains wording that **promotes the subject in a subjective manner without imparting real information**. Please remove or replace such wording and instead of making proclamations about a subject's importance, use facts and attribution to demonstrate that importance. *(August 2018)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* **Enterprise Singapore** (**EnterpriseSG**) is a [statutory board](/wiki/Statutory_boards_of_the_Singapore_Government) under the [Ministry of Trade and Industry](/wiki/Ministry_of_Trade_and_Industry_(Singapore)) of the [Government of Singapore](/wiki/Government_of_Singapore). Formed on 1 April 2018, the agency is responsible for supporting the growth and competitiveness of [Singapore's](/wiki/Singapore) [small and medium-sized enterprises](/wiki/Small_and_medium-sized_enterprises) (SMEs), as well as for developing national standards and advancing the country's accreditation efforts. ## History Enterprise Singapore was formed through the merging of **[International Enterprise Singapore](/wiki/International_Enterprise_Singapore)** (IE) and **[SPRING Singapore](/wiki/SPRING_Singapore),** integrating the functions of both organizations. [SPRING Singapore](/wiki/SPRING_Singapore) was responsible for supporting [start-ups](/wiki/Startup_company) and [SMEs](/wiki/Small_and_medium_enterprises) in areas such as financing, capability, management, development, technology, and innovation. It also served as the national body for standards and accreditation, assisting companies in meeting international standards. On 5 February 2018, the [Parliament of Singapore](/wiki/Parliament_of_Singapore) passed a bill to officiate the establishment of the new unified statutory board. ## Responsibilities ### Quality and Standards Enterprise Singapore develops and implements national standards for Singaporean enterprises. Through the industry-led Singapore Standards Council, it administers the Singapore Standardisation Programme (SSP), which promotes the standards aligned with both industry needs and also government policies. The Council comprises professionals from industry, trade, and consumer associations, academia, and government agencies. It develops standards for the [Singapore stock market](/wiki/Singapore_stock_exchange) and encourages their adoption among all stakeholders involved in doing business in Singapore. The agency also serves as the national accreditation body. Enterprise Singapore manages the Singapore Accreditation Council (SAC), which develops and manages accreditation schemes supporting Singapore’s strategic initiatives such as market access, security, safety, and health. Enterprise Singapore also manages the [Good Laboratory Practice](/wiki/Good_laboratory_practice) (GLP) Compliance Program, which ensures that facilities and laboratory studies meet internationally accepted standards. Studies conducted in Singapore under GLP-compliant conditions are recognized in more than 30 [OECD](/wiki/OECD) (Organization for Economic Co-operation and Development) and non-OECD countries. ### Support for businesses Enterprise Singapore has specific programs based on the size, scale, and stage of the business entity. - The Start-Up SG program partners with incubators, angel investors, and other government agencies. - For small and medium-sized enterprises, the agency offers grants, access to research institutes and technology, and international expansion support through tax incentives and funding schemes. - It also supports large corporations through initiatives such as the PACT programme that facilitates joint projects with smaller companies. ## Internationalization efforts ### Overseas markets Enterprise Singapore maintains overseas centers in various countries to support the [internationalization](/wiki/Internationalization) of Singaporean enterprises. In total, there are 36 overseas centers in 21 countries, including nine in the [People's Republic of China](/wiki/China). ### Plug and Play Network Launched in 2018, the agency established a [Plug and Play Network](/wiki/Universal_Plug_and_Play) in partnership with nine organizations spanning across six countries. The network provides services including targeted market research, a global database for matching overseas partner, facilitation of business connections between suppliers and distributors, and assistance with workspace solutions. ### Bilateral Business Forums Enterprise Singapore organizes bilateral business forums to facilitate dialogue between delegates and officials from Singapore and partner countries. These forums focus on discussing business partnership opportunities, domestic market conditions, business trends, and future directions. It has organized Business Forums with [India](/wiki/India), [Latin America](/wiki/Latin_America), [Bangladesh](/wiki/Bangladesh), [Germany](/wiki/Germany), among with other countries, including in Africa with the ASBF. - [Ministry of Trade and Industry](/wiki/Ministry_of_Trade_and_Industry_(Singapore)) - [Government of Singapore](/wiki/Government_of_Singapore) - [Economy of Singapore](/wiki/Economy_of_Singapore) - [International Enterprise](/wiki/International_Enterprise_Singapore) - [SPRING Singapore](/wiki/SPRING_Singapore) - Enterprise Singapore\n",
  "language": "en",
  "processed_at": "2026-01-12T11:01:43.919322",
  "title": "Enterprise Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Enterprise_Singapore"
}