{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:01:53.666835"
  },
  "content": "* *Environmental issues in Singapore** include [air pollution](/wiki/Air_pollution), [water pollution](/wiki/Water_pollution), and [deforestation](/wiki/Deforestation). The government established the [Singapore Green Plan](/wiki/Singapore_Green_Plan_2012) in 1992 to help with environmental issues. ## Deforestation Since the [founding of Singapore](/wiki/Founding_years_of_modern_Singapore) in 1819, more than 95% of its estimated 540 square km of vegetation has been cleared. At first for [short-term cash crops](/wiki/Cash_crop) and later because of [urbanization](/wiki/Urbanization) and [industrialization](/wiki/Industrialisation). 61 of its original 91 bird species has been lost leading to many native forest plants not being able to reproduce because of loss of seed dispersal and pollination. Since 1980, development and increased pressure for land usage has led to Singapore losing 90% of its forests, 67% of its birds, 40% of its mammals and 5% of its amphibians and reptiles. In 2011, vegetation covered 56% of Singapore's total land area, including 29% [spontaneous](/wiki/Spontaneous_generation) and 27% artificially managed forest. Singapore had a 2018 [Forest Landscape Integrity Index](/wiki/Forest_Landscape_Integrity_Index) mean score of 1.11/10, ranking it 165th globally out of 172 countries. Land reclamation main article: Land reclamation in Singapore As a result of the nation’s ambitious land reclamation, environmental impacts extend beyond its shores too. Singapore’s shores have expanded by 22% since [its independence](/wiki/Independence_of_Singapore_Agreement_1965) and Singapore has become one of the largest importers of [sand](/wiki/Sand) in the world, importing 517 million tonnes in the last 20 years alone. Most of this sand was sourced from [Indonesia](/wiki/Indonesia) and [Malaysia](/wiki/Malaysia) until both countries imposed a ban due to the environmental impact—Indonesia saw 24 islands disappear. [Sand dredging](/wiki/Sand_mining) in [Cambodia](/wiki/Cambodia) has also threatened its coastal environments, endangered species and the livelihoods of fishing villages. ## Air pollution In 1984, there were health concerns with the great number of [pig farms](/wiki/Pig_farming) in Singapore. They were deemed to have contributed to the pollution of the country, namely to the air. This problem was solved by reducing the number of such farms. 65.8 metric tons (64.8 long tons; 72.5 short tons) of [carbon dioxide](/wiki/Carbon_dioxide) were emitted in the country in 1996, ranking among the highest emission levels in the world. Air polluters in Singapore are mostly, but not only, vehicles for transport, despite the country's tough regulations. The country had been blanketed in [haze](/wiki/Haze) for a period of time, which was contributed by smoke from Indonesian fires. ## Water pollution Singapore is a country with limited water resources, and it is essential for its water quality to be carefully regulated. Water in Singapore is polluted by unwanted materials contributed by industrial facilities, coupled by oil from both incoming and outgoing trading vessels. Corrective measures are taken, and affected water is taken for treatment at specialised centres. Plants such as [NEWater](/wiki/NEWater) treat unwanted water into drinkable water. One major water body in Singapore which used to be polluted is the [Singapore River](/wiki/Singapore_River). ## Mitigation To combat the country's environmental problems, the Singaporean government first made the [Singapore Green Plan](/wiki/Singapore_Green_Plan_2012) in 1992 and a new edition of it in 2012 to continue it. The plan has since been superseded by the [Singapore Green Plan 2030](/wiki/Singapore_Green_Plan_2030) in 2021. The plan aims to keep tabs on the unstable populations of [fauna](/wiki/Fauna) and [flora](/wiki/Flora), to place new nature parks and to connect existing parks. It was announced on 3 June 2013 that the government will begin recording the amount of carbon emitted in the country and how much of it is absorbed by the country's flora. Though some scholars have called Singapore an \"environmental oasis,\" others have accused it of \"[greenwashing](/wiki/Greenwashing),\" citing the nation's attention to aesthetic greenery and high [carbon footprint](/wiki/Carbon_footprint). ## Education Education is increasingly seen as playing a key role in shaping environmental attitudes. Currently, Singapore has no policy documents to spell out what environmental topics should be taught in public schools, or how environmental education should be included within the curriculum. Some have argued that while [Singapore's educational system](/wiki/Education_in_Singapore) trains students to perform well on standardized tests, it fails to teach young people environmental values. This is supported by an analysis of the environmental values portrayed in Singapore's secondary school history textbooks, which found that these textbooks \"represent narrowly utilitarian, negativistic, and dominionistic perspectives of thinking about and relating to the nonhuman environment. In contrast, aesthetic, humanistic, moralistic, and ecologistic-scientific interactions with the nonhuman environment are either entirely absent or infrequently portrayed in textbook narratives.\" ## Criticisms Singapore's rapid development into an urban nation has neglected the natural environment, according to a report published by the [National University of Singapore](/wiki/National_University_of_Singapore), which ranked the country as the \"worst environmental offender among 179 countries\". The government called the ranking unfair, claiming that Singapore is unique due to its \"limited land size\" and consequent \"high intensity of land use\". - Barnard, Timothy P. (editor). *Nature Contained: Environmental Histories of Singapore*. NUS Press, 2014. [ISBN](/wiki/ISBN_(identifier)) 978-9971-69-790-7. - Schneider-Mayerson, Matthew (editor). *Eating Chilli Crab in the Anthropocene: Environmental Perspectives on Life in Singapore*. Ethos Books, 2020. [ISBN](/wiki/ISBN_(identifier)) 978-981-14-4136-3. - [Climate change in Singapore](/wiki/Climate_change_in_Singapore)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:01:53.659247",
  "title": "Environmental issues in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Environmental_issues_in_Singapore"
}