{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:02:00.299809"
  },
  "content": "Waterfront location in Singapore The **Esplanade** is a waterfront location just north of the mouth of the [Singapore River](/wiki/Singapore_River) in downtown [Singapore](/wiki/Singapore). It is primarily occupied by the [Esplanade Park](/wiki/Esplanade_Park), and was the venue for one of Singapore's largest congregation of [satay](/wiki/Satay) outlets until their relocation to [Clarke Quay](/wiki/Clarke_Quay) as a result of the construction of a major performance arts venue, the [Esplanade - Theatres on the Bay](/wiki/Esplanade_-_Theatres_on_the_Bay), which took its name from this location. Apart from the shows, Singaporeans usually visit the Esplanade for its scenic outdoor view. It overlooks the Singapore river and is in between the Singapore Flyer and Merlion park, making for a good stroll around the vicinity. River ferries stops have been added recently, enhancing its accessibility. ## Etymology and history In the 1850s, the Esplanade referred to what is now the [Padang](/wiki/Padang,_Singapore), previously known as The Plain, in front of [City Hall](/wiki/City_Hall,_Singapore). It is best captured in [John Turnbull Thomson](/wiki/John_Turnbull_Thomson)'s 1851 painting, \"The Esplanade from Scandal Point\". With [land reclamation](/wiki/Land_reclamation) in 1943, the term Esplanade then referred to the area of the present [Queen Elizabeth Walk](/wiki/Queen_Elizabeth_Walk). Both the Esplanade Park and Queen Elizabeth Walk were built on the reclaimed land. In the park are several memorials, including [The Cenotaph](/wiki/The_Cenotaph,_Singapore) (completed in 1922), the [Former Indian National Army Monument](/wiki/Former_Indian_National_Army_Monument), the [Tan Kim Seng Fountain](/wiki/Tan_Kim_Seng_Fountain) (moved here in 1925 from Fullerton Square), and the [Lim Bo Seng Memorial](/wiki/Lim_Bo_Seng_Memorial) (which was unveiled in 1954). Queen Elizabeth Walk covers an area of approximately 9.5 acres (38,000 m2). The walk was substantially completed in 1953 and was named in honour of [Her Majesty, Queen Elizabeth](/wiki/Elizabeth_II_of_the_United_Kingdom)'s [coronation](/wiki/Coronation) in the same year. It was declared open on [Coronation Day](/wiki/Coronation_Day), 30 May 1953 by T.P.F. McNiece. There was an open air [bandstand](/wiki/Bandstand) near the Lim Bo Seng Memorial. The [Tamils](/wiki/Tamil_people) call the Esplanade \"January *thidal*\" or \"January place\" because of the former sports activities held there on New Year's Day. The [Chinese](/wiki/Chinese_in_Singapore) called the place *tua kok cheng chau po* or \"the grass field in front of the great court\", referring to the Padang in front of the [Supreme Court](/wiki/Old_Supreme_Court_Building,_Singapore). [Esplanade MRT station](/wiki/Esplanade_MRT_station) opened on 17 April 2010. - Victor R Savage, Brenda S A Yeoh (2004), *Toponymics - A Study of Singapore Street Names*, Eastern University Press, [ISBN](/wiki/ISBN_(identifier)) 981-210-364-3 - Esplanade - Theatres on the Bay - Esplanade - Theatres on the Bay Reviews - Esplanade celebrates 10 years of artful existence -Pravasi Express - Esplanade the National Performing Arts Centre\n",
  "language": "en",
  "processed_at": "2026-01-12T11:02:00.298914",
  "title": "Esplanade, Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Esplanade,_Singapore"
}