{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:02:02.704657"
  },
  "content": "Singaporean traditional Chinese medicine company **Eu Yan Sang** ([Chinese](/wiki/Simplified_Chinese_characters): 余仁生; [pinyin](/wiki/Pinyin): *Yú Rén Shēng*) is a company that specialises in [traditional Chinese medicine](/wiki/Traditional_Chinese_medicine) (TCM). It currently runs 170 retail outlets in Singapore, [Malaysia](/wiki/Malaysia), Hong Kong and [Macau](/wiki/Macau), plus four factories in Hong Kong and Malaysia. The group also operates 28 TCM clinics in Singapore, Malaysia and Hong Kong. The [holding company](/wiki/Holding_company), Eu Yan Sang International Limited, was listed on the mainboard of the Singapore Exchange since 2000. It had been delisted in October 2016 and majority-owned by the Righteous Crane Holding Pte Ltd – a consortium set up by The Eu Family, Tower Capital Asia and Temasek Holdings. In 2024, a Japanese consortium of [Mitsui & Co](/wiki/Mitsui_%26_Co.) and [Rohto Pharmaceutical](/wiki/Rohto_Pharmaceutical) acquired 86% of the company for US$516 million; the deal valued Eu Yan Sang at S$808 million. ## History In the 1870s, founder Eu Kong Pai, better known as Eu Kong, left the village of [Foshan](/wiki/Foshan) in Guangdong, China and settled down in the small mining town of [Gopeng](/wiki/Gopeng), Perak. He noticed that the tin mine coolies were heavily dependent on opium as the easiest method for immediate relief for their medical needs. The majority of them were illiterate and oblivious to the dangers of opium to their health. Eu Kong brought in herbal remedies to nurse their health, thus the set up of 'Yan Sang' shop. Eu Kong opened his first Chinese medicine shop in 1879 in Gopeng. He died suddenly in 1890, aged 37. Eu Kong's [tin mining](/wiki/Tin_mining) and medical hall business were inherited by his only son, [Eu Tong Sen](/wiki/Eu_Tong_Sen), when he was only 13 years old. However, Eu Tong Sen only took over the running of the business in 1898, after he turned 21. He did not have an easy start as the family businesses were failing, but prospecting of tin and diversification into rubber, property investment, remittances and banking brought him a greater fortune. By the early 1910s, Eu Tong Sen expanded the family's TCM business to other parts of Malaya, Singapore, Hong Kong and Southern China. The expanded business adopted the brand name, \"Eu Yan Sang\", with the attachment of the family name. Eu Tong Sen died in 1941, in Hong Kong. In Singapore, a main street in Chinatown is named after him. The family assets left by Eu Tong Sen was inherited by his 13 sons, in equal shares. By 1973, most of the businesses were sold or liquidated. Only Eu Yan Sang remained, with the family controlling 75% of the business. In 1989, Richard Eu, a 4th generation family member, joined EYS Holdings in an attempt to keep alive the last family business. In 1990, Eu Yan Sang Holdings was taken over by Lum Chang as Eu Yan Sang shares were sold off by the 3rd generation family members. Within four years in 1993, Richard Eu, along with cousins from the 4th generation, Robert and Clifford Eu, successfully bought over Lum Chang's shares in Eu Yan Sang Holdings. Once again family-owned, the company was renamed Eu Yan Sang International (EYSI). EYSI was listed on the mainboard of the [Singapore Stock Exchange](/wiki/Singapore_Stock_Exchange) in 2000. In 2016, a consortium led by The Eu Family, Temasek Holdings and Tower Capital Asia became the majority owner to invigorate the business, and brought it delisted from SGX. As of 2022, Eu Yan Sang has 200 wholly owned \"Traditional Chinese Medicine\" retail outlets and clinics in Singapore, Malaysia, Hong Kong, and Macau. It is now owned by a Japanese consortium of Mitsui & Co and Rohto Pharmaceutical. ## Etymology The name of the company that Eu Kong started is made up of the words \"Yan\" and \"Sang\". The former means benevolent, kind or humane in Chinese while the latter represents birth, life or livelihood. \"Yan Sang\" literally means caring for mankind. ## Business Eu Yan Sang's primary business in the past was on retailing of herbs and brews. Today, its business has evolved into clinics and \"wellness products\". Eu Yan Sang makes use of Herb Fingerprinting Technology to identify each TCM herb's unique chemical compositions. The company also conducts continuous research collaborations with tertiary institutes from Singapore, Hong Kong and China to validate, develop and improve TCM products and treatments. ### Retail Eu Yan Sang has a distribution network of 170 retail outlets in China, Singapore, Malaysia, Hong Kong and Macau. Some Eu Yan Sang products are also distributed in drugstores, pharmacies, medical halls, supermarkets, petrol kiosks, airport shops, selected in-flight stores, online marketplaces.[*citation needed*] ### Manufacturing Eu Yan Sang has four GMP-certified in Hong Kong and Malaysia. Eu Yan Sang's manufacturing facilities in Malaysia is operated by a wholly owned subsidiary company, Weng Li Sdn Bhd. In 2006, Eu Yan Sang invested HK$110-million in a 130,000 sq ft (12,000 m2) manufacturing plant in Yuen Long, Hong Kong which includes Hong Kong's largest concentration and extraction facility. The factory also has its own laboratory facilities for research and development. ### Clinics As of 2023, the group operates 25 TCM clinics and 3 medical centers in Singapore, Malaysia and Hong Kong, with over 50 licensed TCM practitioners. These clinics offer services such as [acupuncture](/wiki/Acupuncture), *[tui na](/wiki/Tui_na)*, [gua sha](/wiki/Gua_sha), [cupping](/wiki/Cupping_therapy) and dispensary of TCM prescriptions.[*citation needed*] - Carlock, Randel (March 2006), *Eu Yan Sang – Healing a Family & Business* - Lau, Geok Theng; Ho, Jonathan Gerard (2004), *Traditional Remedies Made Contemporary: Re-designing Eu Yan Sang* (PDF), National University of Singapore, archived from the original (PDF) on 13 January 2007, retrieved 6 November 2007`{{citation}}`: CS1 maint: location missing publisher (link) - Lau, Lorett B.Y.; Wong, Y.H. (Hong Kong Polytechnic University) (2000), \"Eu Yan Sang (Hong Kong) Limited\", *[Asian Case Research Journal](/wiki/Asian_Case_Research_Journal)*, **4** (2), [ISSN](/wiki/ISSN_(identifier)) 0218-9275, archived from the original on 1 August 2009 - Chung, Stephanie (Hong Kong Baptist University) (2005), \"Changes and continuities. Evolution of a Chinese family business\", *Asia Europe Journal*, **3** (2): 259–268, [doi](/wiki/Doi_(identifier)):10.1007/s10308-005-0145-9, [ISSN](/wiki/ISSN_(identifier)) 1610-2932, [S2CID](/wiki/S2CID_(identifier)) 154915609\n",
  "language": "en",
  "processed_at": "2026-01-12T11:02:02.701301",
  "title": "Eu Yan Sang",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Eu_Yan_Sang"
}