{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:02:11.258221"
  },
  "content": "Community centre in Bedok, Singapore **Eunos Community Club**, formerly known as the **Eunos Community Centre**, is a community centre on Bedok Reservoir Road in [Bedok, Singapore](/wiki/Bedok). Completed in 1989, it features a \"distinctive\" [Minangkabau-style roof](/wiki/Rumah_Gadang). ## History The original Eunos Community Centre was opened as the Bedok Reservoir Community Centre by [Saidi Shariff](/wiki/Saidi_Shariff), then the Member of Parliament for the [Kaki Bukit Constituency](/wiki/Kaki_Bukit_Constituency), on 1 January 1984. It was housed in the first two floors of Block 631 Bedok Reservoir Road. The centre was renamed the Eunos Community Centre by [Zulkifli Mohammed](/wiki/Zulkifli_Mohammed), then a Member of Parliament representing the now-defunct [Eunos Constituency](/wiki/Eunos_Constituency) and the Political Secretary to the [Ministry of Community Development](/wiki/Ministry_of_Community_Development), in December of that year to reflect the then-newly-created constituency in which it stood. At the time, it was one of three community centres to have \"Eunos\" as a part of its name, along with the Kampong Eunos Community Centre and the Eunos Crescent Community Centre, all located in separate constituencies. On 9 October 1987, the centre's Malay Cultural Group was established after it began receiving the support of Persatuan Kebudayaan Melayu in February. The centre had previously attempted to form the group but was unsuccessful in generating interest. Work on the new premises for the centre, which was to stand in front of its original location, began in 1987. The groundbreaking ceremony for the community centre was held on 28 July 1987. The event was officiated by Mohammed. He laid the building's foundation stone on 10 April 1988. By then, the project's building fund committee had raised $127,000 out of a targeted $300,000 in donations. The three-storey building, which cost $2 million, had \"the latest amenities found in most modern centres\", as well as a \"distinctive\" [Minangkabau-style roof](/wiki/Rumah_Gadang). The roof, which rests on columns made of reinforced concrete around the building, is \"tall, angular and dark brown\" and is meant to represent the \"cultural heritage of the Malay community in the area before the advent of public housing.\" The centre occupied 1,403 sqm and had an office, a conference room, a multi-purpose hall, seven activity rooms and a court for both basketball and sepak takraw. Mohammed officiated the handing-over ceremony centre on 25 March 1989. At its opening, it was the first community centre with a Malay-style roof in Singapore. Fellow Members of Parliament representing the Eunos Group Representation Constituency [Tay Eng Soon](/wiki/Tay_Eng_Soon) and Chew Heng Ching were also in attendance of the opening ceremony. The official opening was in June. From 1994 to 1995, the centre underwent $2.6 million extension works. The new extension was three storeys tall and included a senior citizens' room, daycare rooms,, a lounge, a dance studio, a music room, a health and fitness room, multi-purpose rooms and a theatrette. The extension works began following a groundbreaking ceremony by [Sidek Saniff](/wiki/Sidek_Saniff), then the Minister of State for Education and Member of Parliament for the Eunos Constituency, on 19 March 1994. Beginning in 1989, the centre housed the Eunos Chinese Opera Group, also known as the ECHO Group, which was then a \"growing operatic force among community centres.\" The troupe debuted at the centre on 15 April, with Mohammed being the event's guest of honour. Admission was free and Chinese and English subtitles were provided for audiences. According to Roots, published by the [National Heritage Board](/wiki/National_Heritage_Board_(Singapore)), the troupe's members, who do not speak Cantonese, \"learn their lines with the help of romanised phonetics.\" The centre has also housed a Mandarin Toastmasters Club and \"regularly hosts several enriching activities such as educational talks, recreational workshops and cultural festival.\" 1°19′57″N 103°54′55″E﻿ / ﻿1.33250°N 103.91528°E﻿ / 1.33250; 103.91528\n",
  "language": "en",
  "processed_at": "2026-01-12T11:02:11.256441",
  "title": "Eunos Community Club",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Eunos_Community_Club"
}