{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:02:09.285034"
  },
  "content": "Bus interchange in Geylang East, SingaporeThis article **relies largely or entirely on a single source**. Relevant discussion may be found on the talk page. Please help improve this article by introducing citations to additional sources. *Find sources:* \"Eunos Bus Interchange\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(November 2016)* **Eunos Bus Interchange** is a [bus interchange](/wiki/Bus_station) located in [Geylang East](/wiki/Geylang_East), Singapore. It is located and built beside [Eunos MRT station](/wiki/Eunos_MRT_station) and is surrounded by Eunos Road 2, Eunos Crescent and [Sims Avenue](/wiki/Sims_Avenue). The interchange is designed with [traditional](/wiki/Traditional) [Malay](/wiki/Malay_people) roof structure and shape, but using modern materials such as [steel](/wiki/Steel) beams, similar to that of the Eunos MRT station. It gives a sense of identity to the area as the bus interchange lies close to [Geylang](/wiki/Geylang) and also to honour Eunos Abdullah who secured 700-hectares of land for the Malay settlements in the early 1900s. ## History The interchange was first announced in October 1984 as one of eight planned bus interchanges that would be connected to the [Mass Rapid Transit](/wiki/Mass_Rapid_Transit_(Singapore)) (MRT) network as part of the \"MRT-Bus Integration Scheme\". The interchange opened on 10 December 1989, along with [Pasir Ris Bus Interchange](/wiki/Pasir_Ris_Bus_Interchange). Sporting a [Minangkabau](/wiki/Minangkabau_culture)-style roof, the interchange had 30 parking bays, and six berths. ## Bus Contracting Model Under the [Bus Contracting Model](/wiki/Bus_contracting_model_of_Singapore), all bus services operating from Eunos Bus Interchange were divided into 4 Bus Packages, operated by two different bus operators. ### List of Bus Services OperatorPackageRoutes**SBS Transit**Bukit Merah93Seletar76Serangoon-Eunos22, 60, 60A, 63, 63M, 94, 150, 154**SMRT Buses**Choa Chu Kang-Bukit Panjang61 - Interchanges and Terminals (SBS Transit) - Interchange/Terminal (SMRT Buses) This Singapore bus-related article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:02:09.284538",
  "title": "Eunos Bus Interchange",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Eunos_Bus_Interchange"
}