{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:02:16.093245"
  },
  "content": "Ethnic groupEthnic groupPart of a series on[Singaporeans](/wiki/Demographics_of_Singapore) - [Arabs](/wiki/Arab_Singaporeans) - [Armenians](/wiki/Armenians_in_Singapore) - [Australians](/wiki/Australians_in_Singapore) - [Burmese](/wiki/Burmese_people_in_Singapore) - [Chinese](/wiki/Chinese_Singaporeans) - [Peranakans](/wiki/Peranakans) - [PRC](/wiki/Chinese_nationals_in_Singapore) - [Chitty](/wiki/Chitty) - Eurasians - [Filipinos](/wiki/Filipinos_in_Singapore) - [Indians](/wiki/Indian_Singaporeans) - [Japanese](/wiki/Japanese_people_in_Singapore) - [Jawi Peranakan](/wiki/Jawi_Peranakan) - [Jews](/wiki/History_of_the_Jews_in_Singapore) - [Koreans](/wiki/Koreans_in_Singapore) - [Malays](/wiki/Malay_Singaporeans) - [Nepalis](/wiki/Nepalis_in_Singapore) - [Pakistanis](/wiki/Pakistanis_in_Singapore) - [Sri Lankans](/wiki/Sri_Lankans_in_Singapore) - [Tamils](/wiki/Singapore_Tamils) - [Thais](/wiki/Thais_in_Singapore) - [Vietnamese](/wiki/Vietnamese_in_Singapore) - v - t - e **Eurasian Singaporeans** are [Singaporeans](/wiki/Singaporeans) of mixed [European](/wiki/Ethnic_groups_in_Europe)–[Asian](/wiki/Ethnic_groups_in_Asia) descent. The term largely includes – but is not limited to – the [creole](/wiki/Creole_peoples) [Portuguese](/wiki/Portuguese_people)-[Malay](/wiki/Malays_(ethnic_group)) (largely originating from [Malacca](/wiki/Malacca_City)) [Kristang people](/wiki/Kristang_people), who form a distinct sub-group within the Eurasian community with their own separate [language](/wiki/Kristang_language), culture and identity. The Asian ancestry of Eurasian Singaporeans largely traces to [Singapore in the Straits Settlements](/wiki/Singapore_in_the_Straits_Settlements), [British Malaya](/wiki/British_Malaya), [British India](/wiki/British_India), [Portuguese India](/wiki/Portuguese_India), the [Dutch East Indies](/wiki/Dutch_East_Indies) and sometimes to a lesser extent [French Indochina](/wiki/French_Indochina) and other colonies, while their European ancestry trace back primarily to [Western](/wiki/Western_Europe) and [Southwestern](/wiki/Iberian_Peninsula) [Europe](/wiki/Europe); particularly the [British Isles](/wiki/British_Isles), the [Netherlands](/wiki/Netherlands), and [Portugal](/wiki/Portugal), although Eurasian settlers to Singapore in the 19th century also came from other European colonies. When the European maritime powers colonised Asian countries from the 16th to 20th centuries, they brought into being a new group of commingled ethnicities known historically as Eurasians. Early Europeans were primarily male and often had children with local women, as they were usually not accompanied by their womenfolk on their journey to Asia. Initially, the offspring of such a union were brought up as an appendage of European culture, enjoying further advantages not generally accorded to the rest of the local Asian people. In time, as colonial attitudes hardened, Eurasians were largely cast aside by the European authorities and treated much like the rest of the local population, with many of them eventually supporting [home rule](/wiki/Home_rule) and [independence](/wiki/Independence) movements. ## European ancestry ### Romans and Italians The first documented Europeans to visit Southeast Asia were the [Romans](/wiki/Roman_people) and [Italians](/wiki/Italians). In 166 AD, a Roman mission travelled to [China](/wiki/China) via modern-day [Vietnam](/wiki/Vietnam), bringing presents of elephant tusk, rhinoceros horn, and tortoise shell from Southern Asia. Archaeological evidence supports the claim in the [Weilüe](/wiki/Weil%C3%BCe) and [Book of Liang](/wiki/Book_of_Liang) that Roman merchants were active in northern Vietnam. Between 1275 and 1292, [Marco Polo](/wiki/Marco_Polo) spent 17 years as an emissary of [Kublai Khan](/wiki/Kublai_Khan), visiting tributary kingdoms in modern-day [Indonesia](/wiki/Indonesia), [Myanmar](/wiki/Myanmar), [Sri Lanka](/wiki/Sri_Lanka) and Vietnam. In the 1320s, [Odoric of Pordenone](/wiki/Odoric_of_Pordenone) visited [Borneo](/wiki/Borneo), [Champa](/wiki/Champa), and [Java](/wiki/Java). In the 1420s, the [Venetian](/wiki/Republic_of_Venice) merchant and explorer [Niccolo de' Conti](/wiki/Niccolo_de%27_Conti) married an Indian woman, and travelled extensively in modern day Indonesia, Malaysia, and Vietnam. ### Of Portuguese descent Before the arrival of the Dutch, English and French in Asia, the first Europeans to land and seize territory in Asia were the [Portuguese](/wiki/Portuguese_people). Portuguese spice-traders first sailed to [Malacca](/wiki/Malacca) in 1509, having already established settlements in Goa and other parts of India. Portuguese explorers and conquerors were accompanied by the first [Jesuit](/wiki/Society_of_Jesus) priests to Southeast Asia via Goa in [Portuguese India](/wiki/Portuguese_India). [Afonso de Albuquerque](/wiki/Afonso_de_Albuquerque), the viceroy of India, [conquered Malacca](/wiki/Capture_of_Malacca_(1511)) (today just a few hours' drive from Singapore) in 1511, while Jesuit [Francis Xavier](/wiki/Francis_Xavier), (a [Basque](/wiki/Basques) Spaniard serving the Portuguese Crown) arrived in [Malacca](/wiki/Portuguese_Malacca) in 1545. The creole/indigenous descendants of mixed marriages between Portuguese colonisers and local Malay residents are today called the [Jenti Kristang](/wiki/Kristang_people), with their own distinctive language, the [Kristang language](/wiki/Kristang_language). Many are descended from individuals who lived in Malacca or other parts of Malaya. Others have ancestors who lived in [Java](/wiki/Java) or other parts of [Indonesia](/wiki/Indonesia) as a result of being expelled from Malacca after the Portuguese were forcibly ejected from Malacca by the Johore-Dutch alliance in 1641. A few [Macanese people](/wiki/Macanese_people_(Macanese-born_Portuguese_people)) of Cantonese-Portuguese ancestry from [Macau](/wiki/Macau) are also living in Singapore. #### Kristang [Kristang](/wiki/Kristang_people) Eurasians have their own separate [creole](/wiki/Creole_peoples) culture, identity and [language](/wiki/Kristang_language) from other Eurasians, and are especially distinct from those who are the offspring of more recent immigrants and expatriates of European and Asian origin (who are also commonly called \"Eurasians\" in Singapore). The same or similar distinction exists between those first- or second-generation Eurasians who typically would share the ethnic identity of one parent more closely, that parent typically not being of Kristang or Portuguese-origin; and the multi-generation (i.e. typically third-generation, fourth-generation and fifth-generation, etc) Eurasians who typically might have at least some distant Kristang-speaking or Iberian-origin ancestry, and many of whom would associate with some Kristang or Portuguese-origin cultural practices (e.g. Kristang songs and Portuguese-origin dances like *Jinkli Nona*) and dine on Kristang Eurasian dishes like [devil's curry](/wiki/Devil%27s_curry) or *curry debal* in Kristang. As a general rule, first or second-generation Eurasians typically do not have any Kristang-speaking ancestry, do not speak Kristang, generally do not adopt Kristang or Portuguese-origin cultural practices and cues and are less familiar with Kristang Eurasian cuisine, language and history. Simply put, first-generation Eurasians are people whose parents are not Eurasians. Multi-generation (typically third-generation, fourth-generation and fifth-generation, etc) Eurasians are people whose parents or forefathers are themselves Eurasians. Before the twenty-first century, the Kristang were generally disdained and demeaned by other Eurasian groups, being often seen as illiterate, coarse, primitive, backward, unrefined and hypersexual. ### Of Dutch descent In 1602, the [Dutch East India Company](/wiki/Dutch_East_India_Company), or VOC, was created to conduct trade in the area east of the [Cape of Good Hope](/wiki/Cape_of_Good_Hope) and west of the [Straits of Magellan](/wiki/Straits_of_Magellan). In establishing their numerous trade stations spanning across [Asia](/wiki/Asia), the Dutch created independent settler societies in each of their colonies, where [Batavia](/wiki/Batavia,_Dutch_East_Indies) (now [Jakarta](/wiki/Jakarta), [Indonesia](/wiki/Indonesia)) became the administrative centre and rendezvous point for the company's Asian shipping traffic. Between 1602 and 1795, the VOC fitted out some 4,700 ships which carried more than a million Europeans to Singapore. More than 70 percent of the one million passengers never actually returned to Europe, making Asia their new home. These early seafarers were not only made up of Dutch, but also included [English](/wiki/English_people), [Germans](/wiki/Germans), [French Huguenots](/wiki/Huguenot), [Italians](/wiki/Italians), [Scandinavians](/wiki/Scandinavia) and other [Europeans](/wiki/Demographics_of_Europe) who were employed by the VOC. In time, many were [assimilated](/wiki/Cultural_assimilation) into [Dutch colonies](/wiki/Dutch_Empire) situated throughout Asia (though primarily in modern Indonesia) where they were stationed and became part of the respective communities. [Intermarriages](/wiki/Interracial_marriage) between VOC employees and locals were encouraged, which led to the creation of communities of Dutch descendants. Today, there are only five surviving coherent and large communities who are descended from those early intermarriages. They are the [Cape Coloureds](/wiki/Cape_Coloured) ([South Africa](/wiki/South_Africa)), [Basters](/wiki/Baster) and [Oorlam](/wiki/Oorlam_people) ([Namibia](/wiki/Namibia)), [Burghers](/wiki/Burgher_people) ([Sri Lanka](/wiki/Sri_Lanka)), and [Indos](/wiki/Indo_people) ([Indonesia](/wiki/Indonesia)). Other Dutch groups have persisted as a [strain](/wiki/Strain_(biology)) among the [Anglo-Burmese](/wiki/Anglo-Burmese) and [Kristang](/wiki/Kristang_people). The Dutch transferred Malacca to the British in 1825 in exchange for territory in Sumatra. The British colonial administration encouraged migration away from Malacca and as a result many Eurasians and other people moved north to thriving Penang (where other Eurasians fleeing Phuket or moving from Kedah also settled) and later south to Singapore as it grew in the late 19th and early 20th centuries. Dutch descendants in Malaysia and Singapore are primarily made up of Eurasians originating from Malacca, as well as others who emigrated from the East Indies, India and Sri Lanka. Leo and Hilda Campbell were Dutch Burghers who arrived in Singapore from Sri Lanka (then Ceylon) in 1910. The couple planned to migrate to Australia like many Eurasians but due to Hilda suffering a stroke, they remained in Singapore. ### Of British and Irish descent The British were the most important Europeans in colonial Singapore, as they were the colonial rulers of the island. A number of British settlers arrived after its colonial status changed in 1867. Interracial marriage was very common in colonial days. Even men who had European wives sometimes had local paramours. European women who moved to Southeast Asia tended to die young. British men took Asian partners and their offspring would be Eurasian. Some who had [British nationality](/wiki/British_nationality) preferred to settle in Britain or other parts of the [Commonwealth](/wiki/Commonwealth_of_Nations), especially Australia. Many British and other European men of retirement age, instead of going back to cold Europe, would settle in Australia with Asian women, with fewer staying on in Singapore. Apart from being warmer than Europe, Australia was less judgemental than Europe or colonial Singapore to mixed marriages and mixed offspring. Independent Singapore's second [President](/wiki/President_of_Singapore), [Benjamin Sheares](/wiki/Benjamin_Sheares), was a Eurasian of English lineage. [E. W. Barker](/wiki/E._W._Barker), the former Law Minister, was of mixed- Portuguese, Irish, Japanese, Scottish, Malay and German descent. Author [Rex Shelley](/wiki/Rex_Shelley) was of mixed English, Portuguese, Malay and Buginese ancestry. National swimmer [Joseph Schooling](/wiki/Joseph_Schooling) is a third-generation Singaporean, and is of Eurasian ethnicity. His parents are Colin and May Schooling. May is a Chinese Malaysian and a Singapore permanent resident; while Colin, a businessman, was born in Singapore. Colin's grandfather was a British military officer who married a local Portuguese-Eurasian in Singapore. The last name Schooling is believed to be an anglicised surname that originated in Germany. ### Of other European descent Other Eurasians in Singapore have parents or are descended from individuals who originated from various parts of Western Europe and its former colonies such as in the Americas, Australia, New Zealand, South Africa or elsewhere. There are also some Filipino people of partial Spanish descent. Former Nominated Member of Parliament Eunice Olsen's father is of Swedish and Portuguese descent. His grandfather married a [Chinese](/wiki/Chinese_people) woman in [Shanghai](/wiki/Shanghai) and brought her to Singapore. Geraldene Lowe's mother’s family was called Luth and came from [Schleswig-Holstein](/wiki/Schleswig-Holstein), then part of [Denmark](/wiki/Denmark). During [Bismarck](/wiki/Otto_von_Bismarck)’s unification of [Germany](/wiki/Germany), they headed to Asia and Australia and married people from various nationalities. ## Asian ancestry ### Of Chinese descent Olympic gold medallist swimmer [Joseph Schooling](/wiki/Joseph_Schooling) is a Eurasian, as was his father Colin Schooling. His mother May is a [Chinese-Malaysian](/wiki/Malaysian_Chinese) while his father Colin was of British, Swedish, Kristang and Portuguese descent. ### Of Malay and Indonesian descent Author [Rex Shelley](/wiki/Rex_Shelley) was of mixed English, Portuguese, Malay and [Buginese](/wiki/Buginese_people) ancestry. ### Of Japanese and Korean descent Other Eurasians in Singapore have parents or are descended from individuals who originated from [Japan](/wiki/Japan), [Korea](/wiki/Korea) or other parts of [East Asia](/wiki/East_Asia). An example is TV personality and presenter Stephanie Carrington, who is half [White American](/wiki/White_American) and half Korean. ## Double-barrelled race classification in official documents Since January 2010, the Government in Singapore has allowed the double-barrelling of race classification by parents of different races when they register their children. A child may be registered, for instance, as Malay-Caucasian or Caucasian-Chinese. Before 2010, the government required children to register as a single race, which was required to be the father's. The added flexibility is in response to increasing demographic diversity driven by immigration and more multi-cultural marriages. ## Culture and traditions ### Languages and Kristang (Portuguese-based creole) English is generally spoken as a first language by almost all Eurasians in Singapore. A number of Eurasians speak Asian languages like Malay, Chinese (Mandarin or other Sinitic Languages) or Tamil as a second or third language. Like many Singaporeans, Eurasians will commonly speak [Singlish](/wiki/Singlish). Some of the elder generation of Kristang Eurasians, typically those who have a Portuguese surname or are of [Kristang](/wiki/Kristang_language)-speaking descent, speak the [Portuguese creole](/wiki/Portuguese_creole) known as *Cristão* or *Papia Kristang* (Speaking Kristang) – the [Kristang language](/wiki/Kristang_language) at home and within their small community. Kristang is a dying [patois](/wiki/Patois) and is only spoken by a small minority of Eurasians. ### Religion and education The Eurasian community in Singapore includes people that belong to different religions and to no religion, but most of them are [Christians](/wiki/Christianity_in_Singapore), mostly [Catholic](/wiki/Catholic), with religious celebrations like [Christmas](/wiki/Christmas) typically being an integral part of their lifestyle. Many Eurasians in Singapore have been educated in Catholic mission schools like St Joseph's Institution. Protestant Eurasians in Singapore include [Anglicans](/wiki/Anglicans) (Episcopals), [Presbyterians](/wiki/Presbyterians), [Methodists](/wiki/Methodists), [Lutherans](/wiki/Lutherans) and [Evangelicals](/wiki/Evangelicals). Eurasians looked upon an English education as a passport to a better life in colonial Singapore and so their children were among the first to enrol in the earliest English language schools when they were set up. They attained the highest literacy rate among the local groups here. This enabled them to secure comfortable employment, in both public and private sectors, following in the footsteps of their fathers and as a family tradition for the future generations. ### Eurasian cuisine Eurasian culinary traditions include Eurasian smore (a beef stew), [mulligatawny](/wiki/Mulligatawny) soup (*mulligatani* in Kristang), [shepherd's pie](/wiki/Shepherd%27s_pie), [vindaloo](/wiki/Vindaloo) (*vin d'arlo* in Kristang) and curry devil (aka \"kari debal\", \"curry debal\" or \"[devil's curry](/wiki/Devil%27s_curry)\"). Desserts include [putugal](/wiki/Putugal) and [sugee cake](/wiki/Sugee_cake) made with semolina, a dessert that is also associated with the Eurasians, but also with the Peranakan Chinese. [Pineapple tarts](/wiki/Pineapple_tarts) are also a much-loved dessert, often served at Christmas in Eurasian homes. While the pineapple tart origins are elusive, its fascinating history can be traced back to the Eurasian community, as it combines a unique blend of culinary influences - the pineapple, which was introduced to Asia in the 16th century by the Spanish and Portuguese, made into a jam that is blended with Southeast Asian spices like the star anise, cloves and cinnamon, and baked in a pastry form that applies baking techniques introduced by the Portuguese. ### Prominence in the media, entertainment and fashion industries Eurasians are prominent in the media, entertainment and fashion industry and are sought after because of their mixed look. In Singapore, Eurasian models are sometimes called 'Pan-Asians' for their mixed appearance. Apart from displaying certain Singaporean beauty standards, a common belief among those in the advertising industries of both Singapore and Malaysia is that a Eurasian model can appeal to different ethnic groups of Asian origin and thus there would be no need to create different advertisements to target different groups. For example, an advertisement featuring a Malaysian-Eurasian face could be used in places like Sri Lanka, Nepal, Thailand or Singapore because non-Eurasian Malaysians with their diverse origins could pass off as a Sri Lankan, Nepalese, Thai or Singaporean. Eurasians in Singapore have made their mark in the artistic, cultural, media and entertainment domains. Father and son Brian and Mark Richmond, Vernetta Lopez and Jean Danker are well-known radio personalities. Jeremy Monteiro is a renowned jazz musician and Cultural Medallion winner. Rex Shelly was an award-winning writer, known for novels featuring the Eurasian community in Singapore and Malaysia. ### 'Eurasiana - A Musical Tribute' In June 2009, 'Eurasiana - A Musical Tribute' marking the 90th anniversary of the Eurasian Association was performed at the Esplanade Concert Hall. It was a showcase of Eurasian music, dance and culture in Singapore. Also performing was the 50-piece Singapore Pop Orchestra led by Maestro Iskandar Ismail. ## Places associated with Eurasians Soon after the founding of [Singapore](/wiki/Singapore) by [Stamford Raffles](/wiki/Stamford_Raffles) in 1819, people from other trading centres in Asia including Eurasians came to Singapore. Wealthy Eurasians set up home along [Waterloo Street](/wiki/Waterloo_Street) and [Queen Street](/wiki/Queen_Street,_Singapore) in the area between Bras Basah Road and Middle Road, not far from today's [Singapore Management University](/wiki/Singapore_Management_University). The types of houses that they lived in included shophouses, two-storey houses, terrace houses and [bungalows](/wiki/Bungalows). These were typically owned by well-to-do merchants and traders. The houses on Queen Street also consisted of shophouses that were occupied by non-Eurasian [coolies](/wiki/Coolies). The living conditions in these shophouses were poor, but at least the coolies could live close to where they worked. These houses on Queen Street were owned by the more well-to-do Eurasians. Nearby were Catholic schools like [St Joseph's Institution](/wiki/St_Joseph%27s_Institution) and the [Convent of the Holy Infant Jesus](/wiki/Convent_of_the_Holy_Infant_Jesus) as well as other well-known schools that used to be located in the vicinity. A number of buildings and churches of the period in the vicinity still stand today. Today, few Eurasians can be found residing in the Waterloo Street and Queen Street area. Eurasian families moved out from the enclaves to other locations such as the government quarters in [Bukit Timah](/wiki/Bukit_Timah), the countryside areas in [Serangoon](/wiki/Serangoon) and Upper Serangoon, and the then coastal region of Tanjong Katong. There were even kampongs (Malay for “villages”) along Haig Road and Siglap Road that had a concentration of Eurasian families. Another Eurasian enclave known as Little England was located in the area bounded by [Farrer Park](/wiki/Farrer_Park), Norfolk Road and Rangoon Road. The roads in the area were all named after English counties and towns. Eurasians today can now be found spread thinly across the island in both private and public housing. In past times, many Eurasians lived in the [Katong](/wiki/Katong) area, as did prominent tour guide Geraldene Lowe in her youth. While [Katong](/wiki/Katong) is commonly considered Singapore's main Eurasian enclave because of some history, modern Eurasian literature and the present location of the Eurasian Association, it is more of a [Peranakan](/wiki/Peranakan) Chinese enclave. The leading association for Eurasians in Singapore is the Eurasian Association at 139 Ceylon Road in Katong. The Eurasian Association has played a major role in uniting the community and developing a stronger shared identity. It is also a self-help group which serves the Eurasian community in Singapore. It has expanded the definition of Eurasian to include any person of mixed European and Asian parentage. Previously, only persons whose fathers were of European origin or who had European surnames were considered Eurasian. As of the end of 2013, there were 2,128 members of the Eurasian Association of Singapore. The [Singapore Recreation Club](/wiki/Singapore_Recreation_Club) facing the [Padang, Singapore](/wiki/Padang,_Singapore) near City Hall, founded by several Eurasian men, is a social and sports club popular amongst the Eurasians community. E.W. Barker played sports like cricket and hockey for the Singapore Recreation Club (SRC) between 1934 and 1941, when the SRC was almost the strongest team in Singapore. ## Eurasians during the Japanese occupation During the [Japanese occupation of Singapore](/wiki/Japanese_occupation_of_Singapore), Europeans and Eurasian Singaporeans were generally spared the harsher treatments by the Japanese than other racial groups; however, many of them became an increasing nuisance for their activist efforts, in particular the Catholic societies, who fostered strong community bonds with the local Chinese. From December 1943 to April 1944, a combination of a collapsing currency, rising food prices and continued social activism culminated in the Japanese imposing a reactionary and punitive land acquisition programme, relocating about 400 Roman Catholic Chinese and 300 European/Eurasian families (of which most were landowners; many Chinese households also ran small businesses or shop-keeps from their homes). The homeowners' land and fixed properties were forcibly acquired, in exchange for an equal area of dry land two miles from the town of [Bahau](/wiki/Bahau) in [Negeri Sembilan](/wiki/Negeri_Sembilan) state in Malaya. This forced expropriation was propagandised in the ironic manner of sending the affected off to live happier, better lives as a purely Catholic community where they could run their own affairs despite the reality that it was meant as a punishment. The responsibility for administering the affairs of the settlement was mockingly bestowed [Roman Catholic](/wiki/Roman_Catholic) [bishop](/wiki/Bishop) Monseigneur Adrian Devals, a prominent activist for Chinese welfare under the occupation. On his own accord, Dr [Charles Joseph Pemberton Paglar](/wiki/Charles_Joseph_Pemberton_Paglar), President of the Eurasian Welfare Association, visited the settlement frequently to bring much needed medical and other supplies; as well as give the populace moral strength. Although many of the settlers were educated through missionary schools, and many of the landowners had practised limited subsistence farming on their properties in Singapore, the poor soil at the [Bahau](/wiki/Bahau) settlement was intentionally apportioned by the Japanese as it consisted of non-arable land where there was insufficient water for irrigation. While the Japanese kept to their policy of restraint against the Europeans and Catholics (mindful of their German and Italian allies), this measure was deliberately intended to result in hardship for the settlers. The entire process was extensively concealed under misleading propaganda, which sought to portray the departure of Catholic families from Singapore as a willing venture. As many who were relocated were generally of higher social and economic status, the propaganda's false depiction of the settlers abandoning Singapore for better lives elsewhere created resentment in the local populace and a misplaced sense of betrayal against those that had initially defended them against the Japanese. The perverse nature of Japanese propaganda was highly effective and would have lasting ramifications of distrust between the local races and their former colonial protectors. Many relocated settlers suffered from malnutrition, as their subsistence farming attempts could not provide self-sufficiency. In addition, they were plagued by malaria and other diseases. An estimated 500 settlers ultimately lost their lives, including Bishop Devals who helped many others to survive the ordeal. After the Japanese surrendered to the British in August 1945, the survivors were allowed to return to Singapore; however, they were not compensated for their land or property. ## Notable Eurasian Singaporeans - [Edmund W. Barker](/wiki/Edmund_W._Barker), former [People's Action Party](/wiki/People%27s_Action_Party) [cabinet minister](/wiki/Cabinet_of_Singapore), [Parliament of Singapore](/wiki/Parliament_of_Singapore) - [Amita Berthier](/wiki/Amita_Berthier), fencer - [A. J. Braga](/wiki/A._J._Braga) (1900–1968), politician and lawyer - [Leslie Charteris](/wiki/Leslie_Charteris), creator and author of novels and teleplays based on [Simon Templar](/wiki/Simon_Templar), aka The Saint - [Jean Danker](/wiki/Jean_Danker), radio presenter - [Andrea De Cruz](/wiki/Andrea_De_Cruz), actress - [Barry Desker](/wiki/Barry_Desker), Dean of the [S Rajaratnam School of International Studies](/wiki/S_Rajaratnam_School_of_International_Studies) and former Ambassador to [Indonesia](/wiki/Indonesia) - [Anna Belle Francis](/wiki/Anna_Belle_Francis), model and actress - [Jessica Gomes](/wiki/Jessica_Gomes), model of paternal Portuguese and maternal Chinese descent - [Ian Goodenough](/wiki/Ian_Goodenough), Singaporean-born Australian politician of English, Portuguese, and Chinese Malaysian descent - [Kenneth Jeyaretnam](/wiki/Kenneth_Jeyaretnam), Secretary-General of the [Reform Party (Singapore)](/wiki/Reform_Party_(Singapore)) - [Philip Jeyaretnam](/wiki/Philip_Jeyaretnam), lawyer and novelist - [Denise Keller](/wiki/Denise_Keller), model and MTV Asia host - [John Klass](/wiki/John_Klass), radio DJ, musician - [Lionel Lewis](/wiki/Lionel_Lewis), former football goalkeeper - [Vernetta Lopez](/wiki/Vernetta_Lopez), TV actress and radio DJ - [Maximilian Maeder](/wiki/Maximilian_Maeder), kitesurfer and Olympic bronze medallist - [Jeremy Monteiro](/wiki/Jeremy_Monteiro), jazz musician - [Tabitha Nauser](/wiki/Tabitha_Nauser), singer, TV presenter and radio DJ - [Hensley Anthony Neville](/wiki/Hensley_Anthony_Neville), convicted murderer - [Eunice Olsen](/wiki/Eunice_Olsen), former television game show host and former [Nominated Member of Parliament](/wiki/Nominated_Member_of_Parliament), Parliament of Singapore - [Eric Paine](/wiki/Eric_Paine), former national football goalkeeper - [Michael Palmer](/wiki/Michael_Palmer_(politician)), lawyer and former Speaker of the Parliament of Singapore - [Joan Pereira](/wiki/Joan_Pereira), MP for Tanjong Pagar GRC - [Leon Perera](/wiki/Leon_Perera), former [Workers' Party](/wiki/Workers%27_Party_(Singapore)) politician and former MP for Aljunied GRC - [Bernard Rodrigues](/wiki/Bernard_Rodrigues) (1933–2015), politician - founding member of the [People's Action Party](/wiki/People%27s_Action_Party) and leader of the NTUC (National Trades Union Congress) - [Joseph Schooling](/wiki/Joseph_Schooling), Olympic gold medal-winning swimmer, of English, German, Portuguese-Eurasian and Chinese descent - [Benjamin Sheares](/wiki/Benjamin_Sheares) (1907–1981), professor of obstetrics and gynaecology and former [President of Singapore](/wiki/President_of_Singapore) who held the position for 10 years from January 1971 - [Rex Shelley](/wiki/Rex_Shelley), author - [Christopher de Souza](/wiki/Christopher_de_Souza), lawyer and MP in the Holland Bukit Timah GRC, Parliament of Singapore - [Caroline Jane Smith](/wiki/Carol_Smith_(radio_presenter)), radio presenter - [Sarah Tan](/wiki/Sarah_Tan), model and [Channel V](/wiki/Channel_V) International [VJ](/wiki/VJ_(media_personality)) - [Lloyd Valberg](/wiki/Lloyd_Valberg), firefighter, athlete and Singapore's sole competitor (high jump) at the 1948 London Olympics, Singapore's first official Olympian - [Christopher van Huizen](/wiki/Christopher_van_Huizen), footballer - [Eurasian cuisine of Singapore and Malaysia](/wiki/Eurasian_cuisine_of_Singapore_and_Malaysia) - [Indo (Eurasian)](/wiki/Indo_(Eurasian)) - [Macanese people](/wiki/Macanese_people) - [Kristang language](/wiki/Kristang_language) - [Indian diaspora](/wiki/Indian_diaspora) ### General works - Kraal, Diane, ed. (2005). *Gateway to Eurasian Culture*. Illustrated by Wing Fee. Singapore: Asiapac. [ISBN](/wiki/ISBN_(identifier)) 981-229-356-6. - Braga-Blake, Myrna, ed. (1992). *Singapore Eurasians : Memories and Hopes*. Co-researched by Ann Ebert-Oehlers. Singapore: Times Editions for the Eurasian Association, Singapore. [ISBN](/wiki/ISBN_(identifier)) 981-204-367-5. - De Silva, Melissa (2017). *Others Is Not A Race*. Singapore: Math Paper Press. [ISBN](/wiki/ISBN_(identifier)) 978-191-531-022-4. - De Witt, Dennis (2007). *History of the Dutch in Malaysia*. Malaysia: Nutmeg Publishing. [ISBN](/wiki/ISBN_(identifier)) 978-983-43519-0-8. - Miller, David (2014). *DutyBound*. Singapore: DM Books. [ISBN](/wiki/ISBN_(identifier)) 978-981-09-2390-7. - Miller, David (2014). *Bahau, the Elephant & the Ham*. Singapore: DM Books. [ISBN](/wiki/ISBN_(identifier)) 978-981-09-0244-5. - Kraal, David (2005). *The Devil in Me : Tasty Tidbits on Love and Life : Confessions of a Singapore Eurasian*. Singapore: Angsana Books. [ISBN](/wiki/ISBN_(identifier)) 981-3056-78-9. - Rappa, Antonio L. (2013). *Saudade: The Culture and Security of Eurasians in Southeast Asia*. [Ethos Books](/wiki/Ethos_Books) and the Singapore Management University's Wee Kim Wee Centre. - Scully, Valerie; Catherine Zuzarte (2004). *Eurasian Heritage Dictionary : Kristang-English/English-Kristang*. Singapore: SNP International. [ISBN](/wiki/ISBN_(identifier)) 981-248-052-8. - Tessensohn, Denyse; Steve Hogan (ill.) (2001). *Elvis Lived in Katong : Personal Singapore Eurasiana*. Singapore: Dagmar Books. [ISBN](/wiki/ISBN_(identifier)) 981-04-4316-1. - Tessensohn, Denyse; Steve Hogan (ill.) (2003). *Elvis Still Lives in Katong*. Singapore: Dagmar Books. [ISBN](/wiki/ISBN_(identifier)) 981-04-9928-0. ### Academic - Hewett, Rosalind (2015) 'Children of Decolonisation: Postcolonial Indo (Eurasian) communities in Indonesia and the Netherlands', *Indonesia and the Malay World*, 43 (126): 191-206. - Lowe, John; Mac an Ghaill, Mairtin (2015), 'The postcolonial ambiguities of Eurasian pan-ethnicity in Singapore', *Asian and Pacific Migration Journal*, 24 (2): 232-45. - Pereira, Alexius (1997) ‘The Revitalization of Eurasian Identity in Singapore’, *Asian Journal of Social Science*, 25 (2): 7-24. - Pereira, Alexius (2006) ‘No Longer “Other”: The Emergence of the Eurasian Community in Singapore’. In: Lian KF (ed) *Race, Ethnicity and the State in Malaysia and Singapore.* Leiden: Brill, 5-32. - Rappa Antonio (2000) ‘Surviving the Politics of Late-modernity: the Eurasian Fringe Community of Singapore’, *Asian Journal of Social Science*, 28 (2): 153-80. - Rocha, Zarine (2011) ‘Multiplicity within Singularity: Racial Categorization and Recognizing “Mixed Race” in Singapore’, *Journal of Current Southeast Asian Affairs*, 30 (3): 95-131. - Rocha, Zarine (2014) ‘Stretching out the categories’: Chinese/European narratives of mixedness, belonging and home in Singapore, *Ethnicities*, 14 (2) 279-302. ### Family histories - Scully-Shepherdson, Martha (2006). *Looking Back : A Family's History Discovered and Remembered*. Singapore: Martha Scully-Shepherdson. [ISBN](/wiki/ISBN_(identifier)) 981-05-6271-3. - Shepherdson, Kevin Linus; Percival Joseph Shepherdson (co-researcher) (2003). *Journey to the Straits : The Shepherdson Story*. Singapore: The Shepherdson Family. [ISBN](/wiki/ISBN_(identifier)) 981-04-9926-4. ### Fiction - Danker, Stuart (2020). *Tinhead City, KL*. Kuala Lumpur: Epigram Books. [ISBN](/wiki/ISBN_(identifier)) 978-981-490-162-8. - Lazaroo, Simone (1994). *The World Waiting to Be Made*. South Fremantle: Fremantle Arts Centre Press. [ISBN](/wiki/ISBN_(identifier)) 1-86368-089-6. - Lazaroo, Simone (2000). *The Australian Fiancé*. Sydney: Pan Macmillan Australia. [ISBN](/wiki/ISBN_(identifier)) 0-330-36200-3. - Lazaroo, Simone (2006). *The Travel Writer*. Sydney: Pan Macmillan Australia. [ISBN](/wiki/ISBN_(identifier)) 978-0-330-42256-7. - Schirmer, Edmund (2012). *When There Were Tigers in Singapore*. Marshall Cavendish International (Asia) Pte Ltd. [ISBN](/wiki/ISBN_(identifier)) 978-9814398176. - Shelley, Rex (1993). *People of the Pear Tree*. Singapore: Times Books International. [ISBN](/wiki/ISBN_(identifier)) 981-204-449-3. - Shelley, Rex (1991). *The Shrimp People*. Singapore: Times Books International. [ISBN](/wiki/ISBN_(identifier)) 981-204-292-X. - Wong, Kevin Martens (2017). *Altered Straits*. Singapore: Epigram Books. [ISBN](/wiki/ISBN_(identifier)) 978-981-475-787-4.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:02:16.092766",
  "title": "Eurasian Singaporeans",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Eurasian_Singaporeans"
}