{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:02:18.141943"
  },
  "content": "* *This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"European Union–Singapore Free Trade Agreement\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(January 2018)* *(Learn how and when to remove this message)*This article needs to be **updated**. Please help update this article to reflect recent events or newly available information. *(November 2018)* *(Learn how and when to remove this message)*Bilateral relations The **EU-Singapore Free Trade Agreement**, acronym **EUSFTA**, is a signed and ratified [free trade](/wiki/Free-trade_area) and [bilateral investment treaty](/wiki/Bilateral_investment_treaty) between the [European Union](/wiki/European_Union) and Singapore. EUSFTA has been negotiated since March 2010 and its text has been publicly accessible since June 2015. The negotiations on goods and services were completed in 2012, on investment protection on October 17, 2014. The agreement is expected to be the first free trade agreement with a member of the [Association of Southeast Asian Nations](/wiki/Association_of_Southeast_Asian_Nations) and the third agreement with an Asian country after [South Korea](/wiki/South_Korea) and [Japan](/wiki/Japan) from an EU perspective. Singapore is the EU's 14th largest trading partner. On October 19, 2018, three agreements were signed between the parties, the EU-Singapore Trade Agreement, the EU-Singapore Investment Protection Agreement and the Framework Agreement on Partnership and Cooperation. The agreement was subsequently approved by the [European Parliament](/wiki/European_Parliament) on February 13, 2019. On November 8, 2019, it was announced the agreement will come into force from November 21, 2019. This comes after the [Council of the European Union](/wiki/Council_of_the_European_Union) approved the agreement. ## Content of the Agreement The EUSFTA covers the following key areas: - Elimination of import duties and taxes - Improved market access for trade in services - More government procurement opportunities - Strengthened cooperation in customs and trade facilitation matters - Removal of technical and non-tariff barriers to trade - Cooperation in the implementation of sanitary and phytosanitary measures - Enhanced protection of intellectual property rights - Robust disciplines on competition policy - Renewed commitment to sustainable development ## Ratification According to an opinion of the [Court of Justice of the European Union](/wiki/Court_of_Justice_of_the_European_Union) (ECJ) in [Luxembourg](/wiki/Luxembourg), the initial EUSFTA was a so-called mixed agreement. The opinion was requested by the European Commission, which wanted to confirm whether the EU institutions alone were entitled to conclude the agreement, without the individual member states being parties. The ECJ opinion prompted the [European Commission](/wiki/European_Commission) to split the agreement into a **free trade agreement** and an **investment protection agreement**. In order for the **free trade agreement** to come into force, both the EU (the Parliament and Council) and Singapore have to ratify the agreement. On February 13, 2019, the [European Parliament](/wiki/European_Parliament) approved both the free trade agreement and investment protection agreement and the FTA is expected to come into force as soon as possible. The separate **investment protection agreement** will also need to be approved individually by each EU member state. - Portal of the European Commission on the EU-Singapore Free Trade Agreement - Treaty text of the EU-Singapore Free Trade Agreement - [Free trade agreements of the European Union](/wiki/Free_trade_agreements_of_the_European_Union) - [Free trade agreements of the United Kingdom](/wiki/Free_trade_agreements_of_the_United_Kingdom) - [Singapore–European Union relations](/wiki/Singapore%E2%80%93European_Union_relations) - [Singapore–United Kingdom Free Trade Agreement](/wiki/Singapore%E2%80%93United_Kingdom_Free_Trade_Agreement) ## Sources\n",
  "language": "en",
  "processed_at": "2026-01-12T11:02:18.140452",
  "title": "European Union–Singapore Free Trade Agreement",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/European_Union%E2%80%93Singapore_Free_Trade_Agreement"
}