{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:02:27.008440"
  },
  "content": "2005 Military exercise **Exercise Deep Sabre** was a multi-national [maritime interdiction](/wiki/Maritime_interdiction) exercise conducted in August 2005 in [South China Sea](/wiki/South_China_Sea). Launched at the [Changi Naval Base](/wiki/Changi_Naval_Base) in [Singapore](/wiki/Singapore), the exercise was part of the [Proliferation Security Initiative](/wiki/Proliferation_Security_Initiative). It involved some 2,000 personnel from the military, coast guard, customs and other agencies of 13 countries, including Singapore, Australia, Canada, France, Germany, Italy, Japan, Russia, the United Kingdom and the US. Ten ships and six [maritime patrol aircraft](/wiki/Maritime_patrol_aircraft) were involved in the exercise that aimed to develop and practice effective procedures to prevent the proliferation of [weapons of mass destruction](/wiki/Weapons_of_mass_destruction). ## Sea Phase The sea phase of the exercise was conducted during 15-17 August 2005. It began with the deployment of maritime and air assets from participating countries to detect, localise and track the merchant ship (simulated by MV Avatar) transporting the illegal shipment of dual-use chemicals. Once located, a request was made for the ship to voluntarily divert to port for a search. When the ship’s master refused, [flag state](/wiki/Flag_state) consent was sought, and given, for the ship to be interdicted and diverted to Singapore for the port search. A team from the [Republic of Singapore Navy](/wiki/Republic_of_Singapore_Navy)’s [Naval Diving Unit](/wiki/Naval_Diving_Unit_(Singapore)) (NDU) was the first to board the vessel. After the ship was secured by the NDU team, follow-on forces from the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces) [Chemical, Biological, Radiological and Explosive Defence Group](/wiki/Chemical,_Biological,_Radiological_and_Explosive_Defence_Group), the [Japan Coast Guard](/wiki/Japan_Coast_Guard) and [Australian Customs Service](/wiki/Australian_Customs_Service) boarded the vessel and conducted a preliminary search and investigation. Following indications of a suspicious cargo on board, the ship was escorted to Singapore’s port for a detailed search by domestic enforcement agencies. ## Port Search Phase From Aug 15-19 2005 joint government and military teams searched cargo container in Singapore's Pasir Panjang Scanning Station for weapons of mass destruction. - Singapore hosts multi-national anti-WMD maritime exercise Archived 2005-12-01 at the [Wayback Machine](/wiki/Wayback_Machine) - [Channel NewsAsia](/wiki/Channel_NewsAsia) (15 August, 2005)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:02:27.007911",
  "title": "Exercise Deep Sabre",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Exercise_Deep_Sabre"
}