{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:02:46.935184"
  },
  "content": "* *Eye Hospital** was a private eye hospital in Singapore. Founded in 1934 by eye specialist Tan Soo Hock, it was the country's first private eye hospital. Initially located along Selegie Road, it was moved to [Balestier Road](/wiki/Balestier_Road) in 1939. The building was demolished to make way for The Salvation Army Balestier Corps. ## History Tan Soo Hock, the first eye specialist in Singapore, founded the Eye Hospital on Selegie Road in 1934. It was the country's first private eye hospital. He would accept patients who could not afford to pay for treatment, claiming to believe that \"no doctor should ever refuse a patient.\" Due to the \"work\" this caused being \"heavy\", he decided to build a newer, larger hospital on [Balestier Road](/wiki/Balestier_Road), with its construction and equipment funded through the patients who could afford to pay for their treatment. He was then seeing around 60 patients a day on average, most of whom received free treatment. The hospital's operating wards and rooms were to be \"as modern as possible.\" It was to have two operating theatres, a surgery, an outpatient's department, a dispensary, a testing room and 24 hospital beds. It was to be ready by May 1939. Tan continued to use the hospital's former building on Selegie Road as an outpatient clinic. In August 1981, the building was earmarked for acquisition by the government, after which it would be demolished to make way for the construction of the Central Expressway. The *New Nation* noted that the \"prominently situated\" hospital was among several \"landmarks\" in the area which were to make way for the expressway, alongside the Kamala Club Building, the [St. Thomas Secondary School](/wiki/St._Thomas_Secondary_School), the Singapore Malay Football Club Clubhouse and the St. Michael's Mansion apartments. By then, the hospital was seeing around 80 to 90 a day on average and had three clinics. Tan had also retired from practice a decade ago and had assumed the position of superintendent, and his three sons, all of whom had become eye specialists, had begun running the hospital with him. In September, he told *[The Straits Times](/wiki/The_Straits_Times)* that he hoped to move the hospital somewhere nearby. However, the *New Nation* reported in October that part of the hospital's premises would have to be demolished, and that it might not be required to move. The hospital building was later acquired by the Community Church, which offered to sell the building to The Salvation Army Balestier Corps when it in turn shut down. However, as the corps could not afford to purchase the building, the [Balestier Road Seventh-day Adventist Church](/wiki/Balestier_Road_Seventh-day_Adventist_Church) acquired the land for the corps. The building was then demolished to make way for the new premises of The Salvation Army Balestier Corps, which opened in 2011.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:02:46.934613",
  "title": "Eye Hospital",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Eye_Hospital"
}