{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:09:13.153604"
  },
  "content": "Contactless smart card used in Singapore The **EZ-Link** card is a rechargeable [contactless smart card](/wiki/Contactless_smart_card) and [electronic money](/wiki/Electronic_money) system that is primarily used as a payment method for [public transport](/wiki/Public_transport) such as bus and rail lines in [Singapore](/wiki/Singapore). A standard EZ-Link card is a [credit-card sized](/wiki/ISO/IEC_7810) [stored-value](/wiki/Stored-value_card) contact-less smart-card that comes in a variety of colours, as well as limited edition designs. It is sold by SimplyGo Pte Ltd, a merged entity of TransitLink and EZ-Link since 2024, a subsidiary of the [Land Transport Authority](/wiki/Land_Transport_Authority) (LTA), and can be used on travel modes across Singapore, including the [Mass Rapid Transit](/wiki/Mass_Rapid_Transit_(Singapore)) (MRT), the [Light Rail Transit](/wiki/Light_Rail_Transit_(Singapore)) (LRT), [public buses](/wiki/Public_buses_of_Singapore) which are operated by [SBS Transit](/wiki/SBS_Transit), [SMRT Buses](/wiki/SMRT_Buses), [Tower Transit Singapore](/wiki/Tower_Transit_Singapore) and [Go-Ahead Singapore](/wiki/Go-Ahead_Singapore), as well as the [Sentosa Express](/wiki/Sentosa_Express). Established in 2001, the first generation of the card was based on the Sony [FeliCa](/wiki/FeliCa) smart card technology and was promoted as the means for speedier boarding times on the city-state's bus and rail services. It had a monopoly on public transportation fare payments in Singapore until September 2009, when the [NETS FlashPay](/wiki/NETS_FlashPay) card, which had a monopoly over [Electronic Road Pricing](/wiki/Electronic_Road_Pricing) toll payments, entered the market for transportation payments (and vice versa). EZ-Link cards are distributed and managed by EZ-Link Pte. Ltd., also a subsidiary of Singapore's Land Transport Authority. In September 2009, [CEPAS](/wiki/CEPAS) EZ-Link cards replaced the original EZ-Link card, expanding the card's usage to taxis, Electronic Road Pricing (ERP) gantries (with the dual-mode in-vehicle unit), car parks (which have been upgraded to accept CEPAS-compliant cards), convenience stores, supermarkets and fast food restaurants. Compared to [NETS FlashPay](/wiki/NETS_FlashPay) however, EZ-Link has lesser acceptance at retail shops. EZ-Link can also be used as a payment card at vending machines throughout the country. Account-based CEPAS EZ-Link card was launched in January 2021. In March 2023, the [Land Transport Authority](/wiki/Land_Transport_Authority) announced plans to merge their subsidiaries TransitLink and EZ-Link into a single entity **SimplyGo**. ## History ### Development The [Land Transport Authority](/wiki/Land_Transport_Authority) introduced its pilot testing of the card to 100,000 volunteers on 26 February 2000. Initially for commuters who made at least five trips on MRT/LRT per week, the card was branded as the \"Super Rider\". As an incentive, volunteers were given 10% rebate off their regular fare during the one-month period. Two further tests were made, with the scheme extending to frequent bus users on selected routes on an invitation basis. ## Card usage The card is commonly used in [Singapore](/wiki/Singapore) as a smartcard for paying transportation fees in the [city-state](/wiki/City-state)'s [Mass Rapid Transit](/wiki/Mass_Rapid_Transit_(Singapore)) (MRT), [Light Rail Transit](/wiki/Light_Rail_Transit_(Singapore)) (LRT) and [public bus services](/wiki/Bus_transport_in_Singapore). The EZ-Link function is also used in concession cards for [students in nationally recognised educational institutes](/wiki/Education_in_Singapore), full-time national service personnel serving in the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces), [Singapore Civil Defence Force](/wiki/Singapore_Civil_Defence_Force) and [Singapore Police Force](/wiki/Singapore_Police_Force) or [senior citizens](/wiki/Senior_citizen) who are over 60 years old. The system is similar to the [Pasmo](/wiki/Pasmo) and [ICOCA](/wiki/ICOCA) cards, and the card's use have since been expanded to retail, private transport, government services, community services, educational institutes and vending machines. On 17 October 2007, local telco [StarHub](/wiki/StarHub) and EZ-Link Pte Ltd declared the start of a 6-month trial on phones with a Subscriber Identity Module (SIM) EZ-Link card. Since 2009, Singapore motorists can use EZ-Link cards in their new generation In-Vehicle Unit to pay for Electronic Road Pricing (ERP) and Electronic Parking System (EPS) payments. In August 2016, EZ-Link introduced a post-paid ERP payment service called EZ-Pay. In March 2016, EZ-Link concluded a trial with the Land Transport Authority and the [Infocomm Development Authority of Singapore](/wiki/Infocomm_Development_Authority_of_Singapore) on the use of compatible mobile phones with [Near-Field Communication](/wiki/Near-Field_Communication) (NFC) technology to make public transport payments. In February 2018, EZ-Link and NTUC Social Enterprises launched a partnership to promote cashless payments. This allowed EZ-Link card holders with a linked NTUC Plus card to earn LinkPoints with EZ-Link purchases, spare change could also be used to top-up EZ-Link cards when customers make cash payments at Cheers convenience stores, and EZ-Link acceptance was extended to NTUC FairPrice supermarkets and NTUC Unity pharmacies. However, EZ-Link payments at FairPrice and Unity stores were ceased on 3 May 2023 until further notice. On 12 June 2024, EZ-Link acceptance is reenabled at Fairprice, with a slow rollout over a small number of outlets initially. In April 2018, the card also gained acceptance on NETS terminals in [hawker centres](/wiki/Hawker_centre) across Singapore. In September 2018, the EZ-Link card became part of a unified cashless payment system rolled out at 500 hawker stalls across Singapore. In April 2019, EZ-Link announced it was working with Touch 'N Go to create a dual currency cross-border card for public transport. The card was launched on 17 August 2020. ## Variations In 2007, the [Land Transport Authority](/wiki/Land_Transport_Authority) (LTA) and the [Singapore Tourism Board](/wiki/Singapore_Tourism_Board) launched the Singapore Tourist Pass produced by EZ-Link to offer tourists unlimited rides on Singapore's public transport system. In 2015, EZ-Link introduced 'EZ-Charms', trinkets that have full EZ-Link functionalities, such as the Hello Kitty EZ-Charms, that received overwhelming response. In 2017, EZ-Link launched EZ-Link Wearables, wearable devices that have full EZ-Link functionalities such as fitness trackers. ### System for e-Payments (SeP) A trial to test the system was held from 29 August to 28 October 2008. The trial, which involved some 5,000 commuters, generated 1.7 million transactions and has confirmed that the system is ready for revenue service. Developed in-house by the [LTA](/wiki/Land_Transport_Authority), SeP is built on the Singapore Standard for Contactless ePurse Application ([CEPAS](/wiki/CEPAS)) which allows any smart card that complies with the standard to be used with the system and in a wide variety of payment applications. With SeP, commuters were able to use cards issued by any card issuer for transit purposes as long as the card complied with the [CEPAS](/wiki/CEPAS) standard and included the transit application. Commuters could eventually use [CEPAS](/wiki/CEPAS)-compliant cards for Electronic Road Pricing (ERP) payments in vehicles fitted with the new generation In-vehicle Unit (IU), Electronic Parking System (EPS) carparks and other electronic payment systems that supported the CEPAS standard. During the free one-for-one exchange exercise, most of them replaced their cards during the direct card replacement exercise in 2009. Others seemed to replace new cards after the old cards were out of value and become collectors' value. The new EZ-Link cards also have a higher storage capacity of S$500.00 instead of the previous S$100.00 limit but most passengers keep to the $100 limit in case of loss of card. ### EZ-Link App The EZ-Link App is a mobile application developed by EZ-Link that is available on the Google Play Store and App Store. The app is being phased out starting from 10 December 2025, and is being replaced by the SimplyGo App. It was first released as an Android-exclusive app in 2013 under the name 'My EZ-Link Mobile App', and is used for: - Topping up of EZ-Link cards and Concession Cards using NFC-enabled Android phones and with debit cards, credit cards and PayLah! as payment options. - Registering for Auto Top-up (previously known as EZ-Reload) a top-up service with Mastercard or Visa credit card. In August 2018, EZ-Link moved the application for EZ-Reload from web-based forms to the EZ-Link app, shortening the approval process to minutes. - Earning of points when paying with EZ-Link to redeem rewards. From February 2018 to January 2020, EZ-Link card users earned one LinkPoint by NTUC Link for every S$2 spent using EZ-Link at retail stalls. - Registering for EZ-Link Motoring service (previously known as EZ-Pay), a post-paid card-less service for ERP and EPS payments launched in 2016 that removes the hassle of topping up CashCard for motorists in Singapore. - On-the-go checking of transactions and balance of EZ-Link. - Blocking of EZ-Link when misplaced and recovering of remaining value. - QR code payments with EZ-Link Wallet. ### EZ-Link Wallet On 9 March 2020, EZ-Link launched the EZ-Link Wallet, an e-wallet for mobile phones. Compared to the EZ-Link card which is based on NFC, the EZ-Link Wallet is based on QR code, bypassing the need for payment terminals, relying on smartphones and a printed QR code. It is compliant with the SGQR code system. An email address and local mobile number are required to register for an EZ-Link account. Users have to top-up the e-wallet with a debit/credit card, and make payments by scanning the QR code at a retail shop and entering the payment amount. Payment can be authorised with either a 6-digit PIN or the phone's fingerprint scanner. Up to 6 debit/credit cards can be saved in the EZ-Link app. Users can earn EZ-Link Rewards points for each digital wallet transaction, which can be used to redeem vouchers. The EZ-Link Wallet can also be used overseas at an Alipay Connect-enabled merchant in Japan. The following payment networks are supported by the EZ-Link Wallet: - SGQR: Singapore-based QR code payment, available at selected merchants, hawker centres, coffeeshops. - [Alipay+](/wiki/Alipay): A cross-border digital payments solution, interoperable with e-wallets in several Asia countries such as: Alipay+ for Japan, Alipay for China, AlipayHK for Hong Kong, EZ-Link from Singapore, KakaoPay from South Korea, GCash from the Philippines, Touch ‘n Go eWallet from Malaysia, and TrueMoney from Thailand. - Virtual [MasterCard](/wiki/MasterCard): A one-time identity check via Singpass is required to activate the Mastercard account in the EZ-Link Wallet. Payment modes include: tap to pay via [Google Wallet](/wiki/Google_Wallet) on Android devices with NFC, and [online payment](/wiki/Online_payment) at Mastercard merchants globally. ### SimplyGo SimplyGo was launched in March 2019 for [MasterCard](/wiki/MasterCard) users as a separate account-based ticketing system allowing commuters to pay their public transport fares using bank cards. SimplyGo expanded to [Visa](/wiki/Visa_Inc.) on 6 June and [Nets](/wiki/NETS_(company)) on 16 November. When the system launched, Senior Parliamentary Secretary for Transport Baey Yam Keng said that SimplyGo was not intended to replace other payment methods such as EZ-Link. In September 2020, a pilot program to expand the use of SimplyGo with EZ-Link adult cards was launched. This was followed on 28 January 2021 by the rollout of account-based EZ-Link cards for adults. Commuters could also update their existing EZ-Link cards to the new system. Concession cards were included in SimplyGo on 19 October 2022, with the option to upgrade student concession cards only available in September 2024. In March 2023, the [Land Transport Authority](/wiki/Land_Transport_Authority) (LTA) announced that it would merge the TransitLink SimplyGo and EZ-Link mobile apps into a single \"SimplyGo\" app. On 15 June, the EZ-Link Pte Ltd's (EZ-Link) and Transit Link Pte Ltd's (TransitLink) transit and travel card-related services were consolidated under the \"SimplyGo\" branding. On 9 January 2024, LTA announced that EZ-Link cards that had not yet been upgraded to SimplyGo and Nets Flashpay cards would be deprecated on 1 June 2024. By then, a majority of commuters were already using SimplyGo, and the existing card-based system was near the end of its [operational lifespan](/wiki/Operating_life). For that matter; the government proceeded to extend card-based ticketing till \"begin of card balance and fare display in SimplyGo EZ-Link and NETS Prepaid cardholders\". From 14 September 2025, display of card balances and fares will begin for all SimplyGo EZ-Link and NETS Prepaid cardholders. A blue tick will replace \"Bank Card\" for credit/debit card holders. \"SimplyGo\" name will be removed from all card readers. #### Criticism and transitional issues Many commuters expressed dissatisfaction with the change, particularly the inability to ascertain the fares charged at the transaction points on buses and the MRT after their cards were upgraded to SimplyGo. When the issue was raised in 2023, the LTA explained that, as most of the SimplyGo features involve back-end processing, riders could not view their stored value card balance and deductions at MRT fare gates and bus readers. The fare transactions could only be viewed on the SimplyGo app. The LTA said that while it would be possible to implement the feature for SimplyGo users, it would take \"a few more seconds\" for the information from the backend to be displayed at the fare gates, and hence would slow down commuters who were entering or exiting. During the week after LTA's announcement, several commuters attempted to upgrade their EZ-Link cards to the SimplyGo platform. The high transaction volume caused the SimplyGo system to become less stable and responsive, resulting in longer processing times and failed upgrades that lead to commuters' cards being invalidated. On 19 January 2024, the SimplyGo upgrade feature on ticketing machines at MRT stations have been restricted to \"TUK with Supervision\". On 22 January, transport minister [Chee Hong Tat](/wiki/Chee_Hong_Tat) announced that the LTA reversed their decision and decided to extend the use of the card-based system until 2026. Those who had converted their cards to the new SimplyGo system during the January period could revert to the old system if they preferred to at no additional cost. Chee also acknowledged that the issues encountered during the transition could have been avoided \"with better preparation\". An additional S$40 million (US$28.99 million) would be invested to maintain both systems. ## Technical data The EZ-Link card operates on a [radio frequency](/wiki/Radio_frequency) (RF) interface of 13.56 MHz at 212 kbit/s, with the potential for communication speeds in excess of 847 kbit/s. It employs the [Manchester bit coding scheme](/wiki/Manchester_code) for noise tolerance against distance fluctuation between the card and the contactless reader, and implements the [Triple DES](/wiki/Triple_DES) algorithm for security. ## Pricing An adult EZ-Link card costs S$12, inclusive of a S$5 non-refundable card cost and a $7 card value. There was a problem with commuters attempting to evade paying the full fare with the prior magnetic fare card system. Under the EZ-Link system, when users tap their card on the entry card reader, the system deducts the maximum fare payable from their bus stop to the end of the bus route. If they tap their card on the exit reader when they disembark, the system will return an amount based on the remaining bus stages to the end of the bus route. If they fail to tap the card on the exit reader when they disembark, the entry card reader would have already deducted the maximum fare payable to the end of the bus route. ## Card top-up EZ-Link card holders can top up their cards at the following places: OptionCashCash (Concession)e-Paymente-Payment (Concession)Top Up Kiosks at all MRT stations$2$2 (Primary, Secondary & ITE) $5 (Polytechnic Diploma & PWD) $10 (NSmen & Workfare Transport & Passion Silver)$10$5 (Primary, Secondary, ITE & Polytechnic Diploma) $10 (Remaining groups)SimplyGo Ticket Offices$2$2 (Primary, Secondary & ITE) $5 (Polytechnic Diploma & PWD) $10 (NSmen & Workfare Transport & Passion Silver)$10$5 (Primary, Secondary, ITE & Polytechnic Diploma) $10 (Remaining groups)ATM machines—N/a—N/a$10$5 (Primary, Secondary, ITE & Polytechnic Diploma) $10 (Remaining groups)AXS machines—N/a—N/a$10$5 (Primary, Secondary, ITE & Polytechnic Diploma) $10 (Remaining groups)Convenience stores$0.10 (No minimum limit)—N/a—N/aSimplyGo app—N/a—N/a$10$10 ## Refund A Refund Service Charge of $1 will be charged per month for EZ-link cards that have expired for 2 years or more until the value is refunded or fully depleted. This applies to the remaining card balance, and not the initial deposit or cost of the card that is non-refundable. Refund may be requested at ticketing offices. In addition, commuters may replace expiring EZ-link cards before 31 December 2024 at a subsidised cost of $3. ## Comparison of payment modes On 10 January 2024, LTA announced that EZ-Link adult cards which have not yet been upgraded to SimplyGo will no longer be accepted for public transport fare payment from 1 June 2024, due to phasing out of the legacy card-based ticketing system. Commuters with EZ-Link Adult Cards may upgrade to the SimplyGo system at any ticketing machine and retain their current cards. The decision was reversed by the authorities on 22 January 2024 following significant backlash, and existing EZ-Link cards can continue to be used after 1 June 2024. ### Card payments – stored-valued cards Payment ModeDescriptionYear Introduced[Contactless payment](/wiki/Contactless_payment)Carpark & [Electronic Road Pricing](/wiki/Electronic_Road_Pricing) paymentTop Up Using Self-help MachinesTop Up Using Mobile AppTop Up Locations • EZ-Link cards • Concession cards • EZ-Link Motoring cards (Card-based Offline Debit) Card-based stored-value wallet, based on [CEPAS](/wiki/CEPAS) standard. ✓ It can be used for retail and public transport payments, without remote management functionality. ✓ Commuters can see their fare cost and card balance at the gantry. ✓ The card-based offline debit EZ-Link cards and EZ-Link Motoring cards are compatible with dual mode in-vehicle units for ERP and carpark payments. 2002: FeliCa card 2009: CEPAS card 2021: EZ-Link Motoring Card (CEPAS) The **card-based offline debit EZ-Link cards** were temporary suspended from March 2022 to June 2024, to encourage adoption of the SimplyGo account-based system. **EZ-Link Motoring cards** (with a non-account-based card profile & similar functionality) are still sold at 7-Eleven/Cheers convenience stores, selected Caltex petrol stations, Vicom centres, STA Inspection centres. EZ-Link Motoring cards cannot be converted to be used on the SimplyGo system. Public transport, and a small number of retail locations at CEPAS-compliant car parksYeswith EZ-Link appTop-ups can be made with cash, NETS EFTPOS cards, Visa/Mastercard/JCB cards. - Top Up Kiosk (TUK) [Minimum $2 - $10 for cash, minimum $5/$10 for e-payment] - SimplyGo Ticket Office [Minimum $2 - $10 for cash, minimum $5/$10 for e-payment] - Local bank ATMs (DBS/POSB, OCBC) [Minimum $5/$10] - 7-Eleven convenience stores [Minimum $0.10] - Cheers convenience stores [Minimum $0.10] - SimplyGo app [Only $50] • SimplyGo EZ-Link cards • SimplyGo Concession cards (Account-based Online Debit) Online account-based ticketing wallet, based on [CEPAS](/wiki/CEPAS) standard. As the card information is stored on a central server, the card balance can be topped up without presence of physical card. Concession cards are only available for: children under 7 years old, students, full-time National Servicemen, senior citizens aged 60 years and above, persons with disabilities, Workfare Income Supplement recipients. ✓ It is compatible with the SimplyGo system for remote management of public transport cards. ✗ Fare cost and card balance will not be displayed at the gantry **until 14 September 2025**. In the meantime, commuters can create an account and sign in to the SimplyGo website or app (or proceed to machine), to view their travel history and its related fares. ✗ These account-based online debit cards are not compatible with ERP and carpark payments. 2021 Public transport, and a small number of retail locations NoYeswith EZ-Link app ### App payments Payment ModeDescriptionRequirementsYear Introduced[Contactless payment](/wiki/Contactless_payment)[QR code payment](/wiki/QR_code_payment)Top Up Using Self-help MachinesTop Up Using Mobile AppTop Up Locations• EZ-Link WalletStored-value wallet based on QR codes.• An email address and local mobile number are required to register for an EZ-Link account. • A locally issued Visa/Mastercard card is required to make top-ups. 2020Tap and pay is available with in-app [virtual card](/wiki/Virtual_card) by [Mastercard](/wiki/Mastercard)YesNowith EZ-Link appIn-app top up with a locally issued Visa/Mastercard card. Up to 6 Visa/Mastercard card details can be stored in the app. - [List of smart cards](/wiki/List_of_smart_cards) - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T10:09:13.153229",
  "title": "EZ-Link",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/EZ-Link"
}