{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:02:50.811979"
  },
  "content": "* *Fair Consideration Framework** (FCF) is a guideline announced by [Singapore's](/wiki/Singapore) [Ministry of Manpower](/wiki/Ministry_of_Manpower_(Singapore)) that requires employers to consider Singaporeans fairly for all job opportunities before hiring Employment Pass (EP) holders. The FCF was announced on 23 September 2013 and was a result from the feedback received through MOM's \"[Our Singapore Conversation](/wiki/Our_Singapore_Conversation)\" sessions, employer groups and key stakeholders such as the [National Trades Union Congress](/wiki/National_Trades_Union_Congress) (NTUC). ## Background Starting from 1 August 2014, firms will have to show that they were unable to hire suitable Singapore candidates for any job vacancies before submitting new EP applications. ### Key features of the FCF #### Considering Singaporeans fairly and improving job matching - All firms are to consider Singaporeans fairly for jobs, based on merit. - Firms making new EP applications must advertise the job vacancy on a new jobs bank administered by the [Singapore Workforce Development Agency](/wiki/Workforce_Singapore) (WDA). Each advertisement must be open to Singaporeans, comply with the Tripartite Guidelines on Fair Employment Practices, and run for at least 14 calendar days. #### Additional scrutiny for firms which may have discriminatory HR practices MOM and other government agencies will also identify firms that can improve their hiring and career development practices. For example, firms with a disproportionately low concentration of Singaporeans at the Professional, Managerial and Executive (PME) level compared to others in their industry. Such firms will be asked to provide information to MOM such as (but not restricted to): - Organisation charts with nationality information - Recruitment processes - Staff grievance handling procedures - Plans to develop local internal staff to take on higher roles or reduce reliance on EP holders Actions will be taken for firms who are unresponsive towards improving their recruitment and training practices. They may also have their work pass privileges curtailed. Firms that are exempted from posting vacancies in the jobs banks are - - Small firms with 10 or fewer employees - Jobs which pay a fixed monthly salary of $15,000 and above However, if complaints are received of nationality-based or other discriminatory HR practices, these firms will be reviewed. ## Reception to FCF FCF is generally welcomed as a move to give Singaporeans fair consideration in jobs. However, there are calls for the FCF to be expanded to include more categories of Singaporeans. The [National Solidarity Party](/wiki/National_Solidarity_Party_(Singapore)) (NSP), for example, has called for MOM to extend the rules to work pass schemes beyond the EP.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:02:50.811560",
  "title": "Fair Consideration Framework",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Fair_Consideration_Framework"
}