{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:02:41.384051"
  },
  "content": "Singaporean comedian (born 1986) **Muhammad Fadzri Abdul Rashid** (born 19 September 1986), professionally known as **Fakkah Fuzz**, is a Singaporean [stand-up comedian](/wiki/Stand-up_comedy) and television personality. On January 26, 2018, his [Netflix](/wiki/Netflix) stand-up comedy special *Almost Banned* was released worldwide. ## Early life and career Fadzri was born on 19 September 1986 in Singapore and had his secondary education in Malaysia and did his [Sijil Pelajaran Malaysia](/wiki/Sijil_Pelajaran_Malaysia). He went back to Singapore and did his [National Service](/wiki/National_service_in_Singapore). He had previously worked as a waiter for [Paddock Club](/wiki/Paddock_Club) before working at [Far East Plaza](/wiki/Far_East_Plaza) as a cleaner. He later formed a band and would talk to the audience in between songs, eventually hosting events for local bands. He later worked at a [stand-up comedy](/wiki/Stand-up_comedy) venue after realising that he had a talent for stand-up. ## Stand-up career In 2016, Fadzri was criticized for a joke he made about Malaysia's [Prime Minister](/wiki/Prime_Minister_of_Malaysia), then-[Najib Razak](/wiki/Najib_Razak), comparing him to a thief. Fadzri apologized for the joke. He also joined hip-hop collective Grizzle Grind Crew, founded by [ShiGGa Shay](/wiki/Shigga_Shay), and was featured in one of his songs. On January 26, 2018, his [Netflix](/wiki/Netflix) stand-up comedy special *Almost Banned* was released worldwide, becoming the first Singaporean to have a Netflix stand-up special. In 2023, he released his second comedy special, *Too Real*, also on Netflix. In 2024, Fadzri went on a tour in [Melbourne](/wiki/Melbourne), Australia. He held a show on 3 August at the [Esplanade Theatre](/wiki/Esplanade_Theatre) and performed under Fadzri Rashid, stating that he would be retiring the stage name Fakkah Fuzz. - Official website This Singaporean biographical article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:02:41.383632",
  "title": "Fakkah Fuzz",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Fakkah_Fuzz"
}