{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:02:57.373491"
  },
  "content": "1942 battle of World War II [Singapore](/wiki/Singapore_in_the_Straits_Settlements) was captured from the [British](/wiki/British_Empire) by the [Empire of Japan](/wiki/Empire_of_Japan) in February 1942. The **Battle of Singapore**[d] took place in the [South–East Asian theatre](/wiki/South-East_Asian_theatre_of_World_War_II) of the [Pacific War](/wiki/Pacific_War), with fighting lasting from 8 to 15 February 1942. Singapore was the foremost British military base and economic port in [South–East Asia](/wiki/Southeast_Asia) and had been of great importance to British interwar defence [strategy](/wiki/Singapore_strategy). The capture of Singapore was therefore a major loss for Britain and resulted in its largest [surrender](/wiki/Surrender_(military)) in history. Before the battle, Japanese General [Tomoyuki Yamashita](/wiki/Tomoyuki_Yamashita) had advanced with approximately 30,000 men down the [Malayan Peninsula](/wiki/Malayan_Peninsula) in the [Malayan campaign](/wiki/Malayan_campaign). The British erroneously considered the jungle terrain impassable, leading to a swift Japanese advance as Allied defences were quickly outflanked. The British Lieutenant-General, [Arthur Percival](/wiki/Arthur_Percival), commanded 85,000 Allied troops at Singapore, although many units were under-strength and most units lacked experience. The British outnumbered the Japanese but much of the water for the island was drawn from reservoirs on the mainland. The British destroyed [the causeway](/wiki/Johor%E2%80%93Singapore_Causeway), forcing the Japanese into an improvised crossing of the [Johore Strait](/wiki/Straits_of_Johor). Singapore was considered so important that Prime Minister [Winston Churchill](/wiki/Winston_Churchill) ordered Percival to fight to the last man. The Japanese attacked the weakest part of the island defences and established a [beachhead](/wiki/Beachhead) on 8 February. Percival had expected a crossing in the north and failed to reinforce the defenders in time. In addition, Percival had spread his forces across a thin perimeter along the entire Singaporean coastline and failed to maintain a suitable reserve force. Communication and leadership failures beset the Allies and there were few defensive positions or reserves near the beachhead. The Japanese advance continued and the Allies began to run out of supplies. By 15 February, about a million civilians were crammed into a tight area remaining under Allied control, 1 percent of the island. Around 7,000 of Singapore's civilians had died in the fighting by this point, not including the hundreds killed in earlier bombing raids. Japanese aircraft continuously bombed the civilian water supply which was expected to fail within days. By this point, Allied supplies were nearly empty, with sections of the city descending into chaos. The Japanese were also near the end of their supplies and Yamashita wanted to avoid costly [house-to-house fighting](/wiki/Urban_warfare). For the second time since the battle began, Yamashita demanded [unconditional surrender](/wiki/Unconditional_surrender) and on the afternoon of 15 February, Percival capitulated. About 80,000 British, [Indian](/wiki/British_Raj), Australian and local troops became [prisoners of war](/wiki/Prisoner_of_war), joining the 50,000 taken in Malaya; many died of neglect, abuse or [forced labour](/wiki/Forced_labour). Three days after the British surrender, the Japanese began the [Sook Ching](/wiki/Sook_Ching) purge against Singapore's ethnic Chinese community, killing tens of thousands of male civilians. The Japanese also implemented public beheadings to terrorize the local population into submission. The Japanese held Singapore until the end of the war. About 40,000, mostly conscripted, Indian soldiers joined the [Indian National Army](/wiki/Indian_National_Army) and fought with the Japanese in the [Burma campaign](/wiki/Burma_campaign). Churchill called it the worst [disaster](/wiki/Military_disaster) in [British military history](/wiki/Military_history_of_the_United_Kingdom). The fall of Singapore, along the [fall of Hong Kong](/wiki/Battle_of_Hong_Kong) and the [sinking of *Prince of Wales* and *Repulse*](/wiki/Sinking_of_Prince_of_Wales_and_Repulse), both two months earlier, and other defeats in 1941–1942, both severely and permanently undermined British prestige in Asia, which contributed to the end of British colonial rule in the region after the war. ## Background ### Outbreak of war In the interwar years, Britain had established a naval base in Singapore after the [Anglo-Japanese alliance](/wiki/Anglo-Japanese_Alliance) had lapsed in 1923. As part of the [Singapore strategy](/wiki/Singapore_strategy), the base formed a key part of British interwar defence planning for the region. Financial constraints had hampered construction efforts during the intervening period and shifting strategic circumstances had largely undermined the key premises behind the strategy by the time war had broken out in the Pacific. During 1940 and 1941, the Allies imposed a trade [embargo](/wiki/Embargo) on Japan in response to its campaigns in [China](/wiki/Republic_of_China_(1912%E2%80%931949)) and its occupation of [French Indochina](/wiki/French_Indochina). The basic plan for taking Singapore was worked out in July 1940. Intelligence gained in late 1940–early 1941 did not alter that plan but confirmed it in the minds of Japanese decision makers. On 11 November 1940, the German raider *[Atlantis](/wiki/German_auxiliary_cruiser_Atlantis)* captured the British steamer [*Automedon*](/wiki/SS_Automedon) in the [Indian Ocean](/wiki/Indian_Ocean), carrying papers meant for Air Marshal Sir [Robert Brooke-Popham](/wiki/Robert_Brooke-Popham), the British commander in the Far East. The papers included information about the weakness of the Singapore base. In December 1940, the Germans handed over copies of the papers to the Japanese. The Japanese had broken the British Army's codes and in January 1941, the Second Department (the intelligence-gathering arm) of the Imperial Army interpreted and read a message from Singapore to London complaining in much detail about the weak state of \"Fortress Singapore\", a message so frank in its admission of weakness that the Japanese at first suspected it was a British plant, believing that no officer would be so open in admitting weaknesses to his superiors. Only after cross-checking the message with the *Automedon* papers did the Japanese accept it to be genuine. Japanese oil reserves were rapidly being depleted because of its military operations in China and by industrial consumption. In the latter half of 1941, the Japanese began preparations for war to seize vital resources if peaceful efforts to buy them failed. Planners determined a broad scheme of manoeuvres that incorporated simultaneous attacks on the territories of Britain, The Netherlands and the United States. This would see landings in Malaya and Hong Kong as part of a general move south to secure Singapore, connected to Malaya by the [Johor–Singapore Causeway](/wiki/Johor%E2%80%93Singapore_Causeway) and then an invasion of the oil-rich area of Borneo and Java in the [Dutch East Indies](/wiki/Dutch_East_Indies). Attacks would be made against the American naval fleet at Pearl Harbor as well as landings in the Philippines and attacks on Guam, Wake Island and the Gilbert Islands. Following these attacks, a period of consolidation was planned, after which the Japanese planners intended to build up the defences of the captured territory by establishing a strong perimeter from the India–Burma frontier through to Wake Island and traversing Malaya, the Dutch East Indies, New Guinea and New Britain, the Bismarck Archipelago, and the Marshall and Gilbert Islands. This perimeter would be used to block Allied attempts to regain the lost territory and defeat their will to fight. ### Invasion of Malaya The Japanese [25th Army](/wiki/Twenty-Fifth_Army_(Japan)) invaded Malaya from Indochina, moving into northern Malaya and [Thailand](/wiki/Thailand) by [amphibious assault](/wiki/Amphibious_warfare) on 8 December 1941. This was virtually simultaneous with the Japanese [attack on Pearl Harbor](/wiki/Attack_on_Pearl_Harbor) which precipitated the United States' entry into the war. Thailand resisted landings on its territory for about 5 to 8 hours; it then signed a ceasefire and a Treaty of Friendship with Japan, later declaring war on the UK and the US. The Japanese then proceeded overland across the Thai–Malayan border to attack Malaya. At this time, the Japanese began [bombing Singapore](/wiki/Bombing_of_Singapore_(1941)). The 25th Army was resisted in northern Malaya by [III Corps](/wiki/III_Corps_(India)) of the [British Indian Army](/wiki/British_Indian_Army). Although the 25th Army was outnumbered by Commonwealth forces in Malaya and Singapore, they did not take the initiative with their forces while Japanese commanders concentrated theirs. The Japanese were superior in [close air support](/wiki/Close_air_support), armour, co-ordination, tactics and experience. Conventional British military thinking was that the Japanese forces were inferior and characterised the Malayan jungles as \"impassable\"; the Japanese were repeatedly able to use this to their advantage to outflank hastily established defensive lines. Prior to the Battle of Singapore the most resistance was met at the [Battle of Muar](/wiki/Battle_of_Muar) which involved the [8th Australian Division](/wiki/8th_Division_(Australia)) and the 45th Indian Brigade. The British troops left in the city of Singapore were basically garrison troops. At the start of the campaign, the Commonwealth forces had only 164 first-line aircraft in Malaya and Singapore and the only fighter type was the sub-standard [Brewster 339E Buffalo](/wiki/Brewster_F2A_Buffalo). The Buffaloes were operated by one [Royal New Zealand Air Force](/wiki/Royal_New_Zealand_Air_Force) (RNZAF), two [Royal Australian Air Force](/wiki/Royal_Australian_Air_Force) (RAAF), and two [Royal Air Force](/wiki/Royal_Air_Force) (RAF) squadrons. The aircraft were, according to historian Peter Dennis, \"not considered good enough for use in Europe\" and major shortcomings included a slow rate of climb and the fuel system, which required the pilot to hand-pump fuel if flying above 6,000 ft (1,800 m). The [Imperial Japanese Army Air Force](/wiki/Imperial_Japanese_Army_Air_Force) aircraft were more numerous and pilots better trained than the second-hand assortment of untrained pilots and inferior Commonwealth equipment remaining in Malaya, Borneo and Singapore. Japanese fighters were superior to the Commonwealth fighters, which helped the Japanese to gain [air supremacy](/wiki/Air_supremacy). Although outnumbered and outclassed, the Buffalos were able to provide some resistance, with RAAF pilots alone managing to shoot down at least 20 Japanese aircraft before the few survivors were withdrawn. [Force Z](/wiki/Force_Z), consisting of the [battleship](/wiki/Battleship) [HMS *Prince of Wales*](/wiki/HMS_Prince_of_Wales_(53)), the [battlecruiser](/wiki/Battlecruiser) [HMS *Repulse*](/wiki/HMS_Repulse_(1916)) and four [destroyers](/wiki/Destroyer), sailed north out of Singapore on 8 December to oppose expected Japanese landings along the coast of Malaya. Japanese land-based aircraft found and sank the two capital [ships](/wiki/Sinking_of_Prince_of_Wales_and_Repulse) on 10 December, leaving the east coast of the Malayan Peninsula exposed and allowing the Japanese to continue their amphibious landings. Japanese forces quickly isolated, surrounded and forced the surrender of Indian units defending the coast. Despite their numerical inferiority, they advanced down the Malayan Peninsula, overwhelming the defences. The Japanese forces also used [bicycle infantry](/wiki/Bicycle_infantry) and [light tanks](/wiki/Light_tank), allowing swift movement through the jungle. The Commonwealth having thought the terrain made them impractical, had no tanks and only a few armoured vehicles, which put them at a severe disadvantage. Although more Commonwealth units—including some from the 8th Australian Division—joined the campaign, the Japanese prevented them from regrouping.[e] The Japanese overran cities and advanced toward Singapore, which was an anchor for the operations of the [American-British-Dutch-Australian Command](/wiki/American-British-Dutch-Australian_Command) (ABDACOM), the first Allied joint command of the Second World War. Singapore controlled the main shipping channel between the Indian and the Pacific Oceans. An ambush was sprung by the [2/30th Australian Battalion](/wiki/2/30th_Battalion_(Australia)) on the main road at the Gemenceh River near Gemas on 14 January, causing many Japanese casualties.[f] At Bakri, from 18 to 22 January, the Australian [2/19th](/wiki/2/19th_Battalion_(Australia)) and [2/29th battalions](/wiki/2/29th_Battalion_(Australia)) and the [45th Indian Brigade](/wiki/45th_Indian_Infantry_Brigade) (Lieutenant Colonel [Charles Anderson](/wiki/Charles_Groves_Wright_Anderson)) repeatedly fought through Japanese positions before running out of ammunition near Parit Sulong. The survivors were forced to leave behind about 110 Australian and 40 Indian wounded, who were later beaten, tortured and murdered by Japanese troops during the [Parit Sulong Massacre](/wiki/Parit_Sulong_Massacre). Of over 3,000 men from these units only around 500 men escaped. For his leadership in the fighting withdrawal, Anderson was awarded the [Victoria Cross](/wiki/Victoria_Cross). A determined counter-attack by the 5/11th Sikh Regiment (Lieutenant-Colonel John Parkin) in the area of Niyor, near Kluang, on 25 January and an ambush around the Nithsdale Estate by the [2/18th Australian Battalion](/wiki/2/18th_Battalion_(Australia)) on 26/27 January bought valuable time and permitted East Force, based on the [22nd Australian Brigade](/wiki/22nd_Brigade_(Australia)) (Brigadier [Harold Taylor](/wiki/Harold_Burfield_Taylor)), to withdraw from eastern [Johor](/wiki/Johor) (formerly Johore). On 31 January, the last Commonwealth forces crossed the causeway linking Johor and Singapore and engineers blew it up. ## Prelude During the weeks preceding the invasion, Commonwealth forces suffered a number of both subdued and openly disruptive disagreements amongst its senior commanders, as well as pressure from Australian Prime Minister [John Curtin](/wiki/John_Curtin). Lieutenant-General [Arthur Percival](/wiki/Arthur_Percival), commander of the garrison, had 85,000 soldiers—the equivalent, on paper at least, of just over four divisions.[g] Of this figure, 15,000 men were employed in supply, administrative, or other non-combatant roles. The remaining force was a mix of front-line and second-line troops. There were 49 infantry battalions—21 Indian, 13 British, six Australian, four [Indian States Forces](/wiki/Imperial_Service_Troops) assigned to airfield defence, three [Straits Settlements Volunteer Force](/wiki/Straits_Settlements_Volunteer_Force), and two Malayan. In addition, there were two British machine-gun battalions, one Australian, and a British reconnaissance battalion. The newly arrived [18th Infantry Division](/wiki/18th_Infantry_Division_(United_Kingdom)) (Major-General [Merton Beckwith-Smith](/wiki/Merton_Beckwith-Smith))—was at full strength but lacked experience and training. The rest of the force was of mixed quality, condition, training, equipment and morale. Lionel Wigmore, the [Australian official historian](/wiki/Australia_in_the_War_of_1939%E2%80%931945) of the Malayan campaign, wrote > Only one of the Indian battalions was up to numerical strength, three (in the 44th Brigade) had recently arrived in a semi-trained condition, nine had been hastily reorganised with a large intake of raw recruits, and four were being re-formed but were far from being fit for action. Six of the United Kingdom battalions (in the 54th and 55th Brigades of the British 18th Infantry Division) had only just landed in Malaya, and the other seven battalions were under-manned. Of the Australian battalions, three had drawn heavily upon undertrained recruits, new to the theatre. The Malay battalions had not been in action, and the Straits Settlements Volunteers were only sketchily trained. Further, losses on the mainland had resulted in a general shortage of equipment. Percival gave Major-General [Gordon Bennett](/wiki/Gordon_Bennett_(general))'s two brigades from the 8th Australian Division responsibility for the western side of Singapore, including the prime invasion points in the northwest of the island. This was mostly mangrove swamp and jungle, broken by rivers and creeks. In the heart of the \"Western Area\" was [RAF Tengah](/wiki/Tengah_Air_Base#RAF_Tengah), Singapore's largest airfield at the time. The Australian 22nd Brigade, under Brigadier Harold Taylor, was assigned a 10 mi (16 km) wide sector in the west, and the [27th Brigade](/wiki/27th_Brigade_(Australia)), under Brigadier [Duncan Maxwell](/wiki/Duncan_Maxwell), had responsibility for a 4,000 yd (3,700 m) zone just west of the Causeway. The infantry positions were reinforced by the recently arrived Australian [2/4th Machine-Gun Battalion](/wiki/2/4th_Machine_Gun_Battalion_(Australia)). Also under Bennett's command was the [44th Indian Infantry Brigade](/wiki/44th_Indian_Infantry_Brigade). The III Indian Corps (Lieutenant-General Sir [Lewis Heath](/wiki/Lewis_Heath)) including the [11th Indian Infantry Division](/wiki/11th_Infantry_Division_(India)) under Major-General [Berthold Key](/wiki/Berthold_Wells_Key) with reinforcements from the 8th Indian Brigade, and the 18th Infantry Division—was assigned the north-eastern sector, known as the \"Northern Area\". This included the naval base at [Sembawang](/wiki/Sembawang). The \"Southern Area\", including the main urban areas in the south-east, was commanded by Major-General [Frank Simmons](/wiki/Frank_Keith_Simmons). His forces consisted of elements of the [1st Malaya Infantry Brigade](/wiki/1st_Malaya_Infantry_Brigade) and the Straits Settlements Volunteer Force Brigade with the [Indian 12th Infantry Brigade](/wiki/12th_Indian_Infantry_Brigade) in reserve. From 3 February, the Commonwealth forces were shelled by Japanese artillery, and air attacks on Singapore intensified over the next five days. The artillery and air bombardment strengthened, severely disrupting communications between Commonwealth units and their commanders and affecting preparations for the defence of the island. From aerial reconnaissance, scouts, infiltrators and observation from high ground across the straits (such as at [Istana Bukit Serene](/wiki/Istana_Bukit_Serene) and the [Sultan of Johor](/wiki/Sultan_of_Johor)'s palace), Japanese commander General [Tomoyuki Yamashita](/wiki/Tomoyuki_Yamashita) and his staff gained excellent knowledge of the Commonwealth positions. Yamashita and his officers stationed themselves at Istana Bukit Serene and the Johor state secretariat building—the [Sultan Ibrahim Building](/wiki/Sultan_Ibrahim_Building)—to plan for the invasion of Singapore. Although his military advisors judged that Istana Bukit Serene was an easy target, Yamashita was confident that the British Army would not attack the palace because it belonged to the Sultan of Johor. Yamashita's prediction was correct; despite being observed by Australian artillery, permission to engage the palace was denied by Gordon Bennett. Most of Singapore's [BL 15-inch Mk I naval guns](/wiki/BL_15-inch_Mk_I_naval_gun) could be traversed north and were used to engage the Japanese. The guns—which included the [Johore Battery](/wiki/Johore_Battery), with three 15 in (380 mm) guns and one battery with two 15 in (380 mm) guns—were supplied mostly with [armour-piercing shells](/wiki/Armour-piercing_shell) (AP) for anti-shipping use and few [high explosive](/wiki/High_explosive#High_explosives) (HE) shells.[h] Percival incorrectly guessed that the Japanese would land forces on the north-east side of Singapore, ignoring advice that the north-west was a more likely direction of attack (where the Straits of Johor were the narrowest and a series of river mouths provided cover for the launching of water craft). This was encouraged by the deliberate movement of Japanese troops in this sector to deceive the British. Much of the equipment and resources of the garrison had been incorrectly allocated to the north east sector, where the most complete and freshest formation—the 18th Infantry Division—was deployed, while the depleted 8th Australian Division sector with two of its three brigades had no serious fixed defensive works or obstacles. To compound matters, Percival had ordered the Australians to defend forward so as to cover the waterway, yet this meant they were immediately fully committed to any fighting, limiting their flexibility, whilst also reducing their defensive depth. The two Australian brigades were subsequently allocated a very wide frontage of over 11 mi (18 km) and were separated by the Kranji River. Yamashita had just over 30,000 men from three divisions: the [Imperial Guards](/wiki/Imperial_Guard_(Japan)) Division (Lieutenant-General [Takuma Nishimura](/wiki/Takuma_Nishimura)), the [5th Division](/wiki/5th_Division_(Imperial_Japanese_Army)) (Lieutenant-General [Takuro Matsui](/wiki/Takuro_Matsui)) and the Japanese [18th Division](/wiki/18th_Division_(Imperial_Japanese_Army)) (Lieutenant-General [Renya Mutaguchi](/wiki/Renya_Mutaguchi)). Also in support was a light tank brigade. In comparison, following the withdrawal, Percival had about 85,000 men at his disposal, although 15,000 were administrative personnel, while large numbers were semi-trained British, Indian and Australian reinforcements that had only recently arrived. Of those forces that had seen action during the previous fighting, the majority were under-strength and under-equipped. In the days leading up to the Japanese attack, patrols from the Australian 22nd Brigade were sent across the Straits of Johor at night to gather intelligence. Three small patrols were sent on the evening of 6 February, one was spotted and withdrew after its leader was killed and their boat sunk and the other two managed to get ashore. Over the course of a day, they found large concentrations of troops, although they were unable to locate any landing craft. The Australians requested the shelling of these positions to disrupt the Japanese preparations but the patrol reports were later ignored by Malaya Command as being insignificant, based upon the belief that the real assault would come in the north-eastern sector, not the north-west. ## Battle ### Japanese landings Blowing up the causeway had delayed the Japanese attack for over a week. Prior to the main assault, the Australians were subjected to an intense artillery bombardment. Over a period of 15 hours, starting at 23:00 on 8 February 1942, Yamashita's heavy guns fired a bombardment of 88,000 shells (200 rounds per gun) along the straits, cutting telephone lines and isolating forward units. The British had the means to conduct counter-battery fire opposite the Australians that would have caused casualties and disruption among the Japanese assault troops. The bombardment of the Australians was not seen as a prelude to attack—Malaya Command believed that it would last several days and would later switch its focus to the north-east, despite its ferocity exceeding anything the Allies had experienced thus far in the campaign; no order was passed to the Commonwealth artillery units to bombard possible Japanese assembly areas. Shortly before 20:30 on 8 February, the first wave of Japanese troops from the 5th Division and 18th Division began crossing the Johor Strait. The main weight of the Japanese force, about 13,000 men, from 16 assault battalions, with five in reserve, attacked the 22nd Australian Brigade. The assault was received by the 2/18th Battalion and the [2/20th Battalion](/wiki/2/20th_Battalion_(Australia)). Each Japanese division had 150 barges and collapsible boats, sufficient for lifts of 4,000. During the first night 13,000 Japanese troops landed and were followed by another 10,000 after first light. The Australians numbered just 3,000 men and lacked any significant reserve. As the landing craft closed on the Australian positions, machine gunners from the 2/4th Machine Gun Battalion, interspersed amongst the rifle companies, opened fire. Spotlights had been placed on the beaches by a British unit to illuminate an invasion force on the water but many had been damaged by the bombardment and no order was made to turn the others on. The initial wave was concentrated against the positions occupied by the 2/18th and 2/20th Battalions, around the Buloh River, as well as one company from the 2/19th Battalion. Over the course of an hour, intense fighting took place on the right flank of the 2/19th Battalion, until its positions were overrun, the Japanese then advanced inland concealed by the darkness and the vegetation. The resistance put up by the company from the 2/19th pushed the follow-on waves of Japanese craft to land around the mouth of Murai River, which resulted in them creating a gap between the 2/19th and 2/18th battalions. From there the Japanese launched two concerted attacks against the 2/18th, which were met with massed fire before they overwhelmed the Australians by weight of numbers. Urgent requests for fire support were made and the [2/15th Field Regiment](/wiki/2/15th_Field_Regiment_(Australia)) responded to these requests with over 4,800 rounds. Fierce fighting raged throughout the evening but due to the terrain and the darkness, the Japanese were able to disperse into the undergrowth, surround and overwhelm pockets of Australian resistance or bypass them exploiting gaps in the thinly spread Commonwealth lines due to the many rivers and creeks in the area. By midnight, the two Japanese divisions fired [star shell](/wiki/Star_shell) to indicate to their commander that they had secured their initial objectives and by 01:00 they were well established. Over the course of two hours, the three Australian battalions that had been engaged sought to regroup, moving back east from the coast towards the centre of the island, which was completed mainly in good order. The 2/20th managed to concentrate three of its four companies around the Namazie Estate, although one was left behind; the 2/18th was only able to concentrate half its strength at Ama Keng, while the 2/19th also moved back three companies, leaving a fourth to defend Tengah airfield. Further fighting followed in the early morning of 9 February and the Australians were pushed back further, with the 2/18th being pushed out of Ama Keng and the 2/20th being forced to pull back to Bulim, west of Bukit Panjong. Bypassed elements tried to break out and fall back to the Tengah airfield to rejoin their units and suffered many casualties. Bennett attempted to reinforce the 22nd Brigade by moving the 2/29th Battalion from the 27th Brigade area to Tengah but before it could be used to recapture Ama Keng, the Japanese launched another attack around the airfield and the 2/29th was forced onto the defensive. The initial fighting cost the Australians many casualties, with the 2/20th alone losing 334 men killed and 214 wounded. ### Air operations The air campaign for Singapore began during the invasion of Malaya. Early on 8 December 1941, Singapore was bombed for the first time by long-range Japanese aircraft, such as the [Mitsubishi G3M](/wiki/Mitsubishi_G3M)2 \"Nell\" and the [Mitsubishi G4M](/wiki/Mitsubishi_G4M)1 \"Betty\", based in Japanese-occupied Indochina. The bombers struck the city centre as well as the Sembawang Naval Base and the northern airfields. For the rest of December there were false alerts and several infrequent and sporadic hit-and-run attacks on outlying military installations such as the Naval Base but no raids on Singapore City. The situation had become so desperate that one British soldier took to the middle of a road to fire his [Vickers machine gun](/wiki/Vickers_machine_gun) at any aircraft that passed. He could only say \"The bloody bastards will never think of looking for me in the open, and I want to see a bloody plane brought down\". The next recorded raid on the city occurred on the night of 29/30 December, and nightly raids ensued for over a week, accompanied by daylight raids from 12 January 1942. As the Japanese army advanced towards Singapore Island, the day and night raids increased in frequency and intensity, resulting in thousands of civilian casualties, up to the time of the British surrender. In December, 51 [Hawker Hurricane](/wiki/Hawker_Hurricane) Mk II fighters and 24 pilots were sent to Singapore, the nuclei of five squadrons. They arrived on 3 January 1942, by which stage the Buffalo squadrons had been overwhelmed. [No. 232 Squadron RAF](/wiki/No._232_Squadron_RAF) was formed and [No. 488 Squadron RNZAF](/wiki/No._488_Squadron_RNZAF), a Buffalo squadron, had converted to Hurricanes; 232 Squadron became operational on 20 January and destroyed three [Nakajima Ki-43](/wiki/Nakajima_Ki-43) \"Oscars\" that day, for the loss of three Hurricanes. Like the Buffalos the Hurricanes began to suffer severe losses in dogfights.[i] From 27 to 30 January, another 48 Hurricanes arrived on the aircraft carrier [HMS *Indomitable*](/wiki/HMS_Indomitable_(92)). Operated by the four squadrons of [No. 226 Group RAF](/wiki/No._226_Squadron_RAF), they flew from an airfield code-named P1, near [Palembang](/wiki/Palembang), [Sumatra](/wiki/Sumatra) in the Dutch East Indies, while a flight was maintained in Singapore. Many of the Hurricanes were destroyed on the ground by air raids. The lack of an effective air early warning system throughout the campaign meant that many Commonwealth aircraft were lost in this manner during Japanese attacks against airfields. By the time of the invasion, only ten Hurricanes of 232 Squadron, based at [RAF Kallang](/wiki/Kallang_Airport#World_War_II), remained to provide air cover for the Commonwealth forces on Singapore. The airfields at Tengah, [Seletar](/wiki/Seletar_Airport#RAF_Seletar) and [Sembawang](/wiki/Sembawang_Air_Base#RAF_Sembawang) were in range of Japanese artillery at [Johor Bahru](/wiki/Johor_Bahru). RAF Kallang was the only operational airstrip left; the surviving squadrons and aircraft had withdrawn by January to reinforce the Dutch East Indies. On the morning of 9 February, dogfights took place over Sarimbun Beach and other western areas. In the first encounter, the last ten Hurricanes were scrambled from Kallang Airfield to intercept a Japanese formation of about 84 aircraft, flying from Johor to provide air cover for their invasion force. The Hurricanes shot down six Japanese aircraft and damaged 14 others for the loss of a Hurricane. Air battles went on for the rest of the day and by nightfall it was clear that with the few aircraft Percival had left, Kallang could no longer be used as a base. With his assent, the remaining flyable Hurricanes were withdrawn to Sumatra. A squadron of Hurricane fighters took to the skies on 9 February but was then withdrawn to the Netherlands East Indies and after that no Commonwealth aircraft were seen again over Singapore; the Japanese had achieved air supremacy. That evening, three [Fairmile B motor launches](/wiki/Fairmile_B_motor_launch) attacked and sank several Japanese landing craft in the Johor Strait around its western channel on the evening of 9 February. On the evening of 10 February, General [Archibald Wavell](/wiki/Archibald_Wavell,_1st_Earl_Wavell), commander of ABDA, ordered the transfer of all remaining Commonwealth air force personnel to the Dutch East Indies. By this time, Kallang Airfield was, according to author Frank Owen, \"so pitted with bomb craters that it was no longer usable\". ### Second day Believing that further landings would occur in the northeast, Percival did not reinforce the 22nd Brigade until the morning of 9 February, sending two half-strength battalions from the 12th Indian Infantry Brigade. The Indians reached Bennett around noon. Shortly afterwards Percival allocated the composite 6th/15th Indian Infantry Brigade to reinforce the Australians from their position around the Singapore racecourse. Throughout the day, the 44th Indian Infantry Brigade, still holding its position on the coast, began to feel pressure on its exposed flank and after discussions between Percival and Bennett, it was decided that they would have to retire eastwards to maintain the southern part of the Commonwealth line. Bennett decided to form a secondary defensive line, known as the \"Kranji-Jurong Switch Line\" facing west between the two rivers, with its centre around Bulim, east of Tengah Airfield—which subsequently came under Japanese control—and just north of [Jurong](/wiki/Jurong). To the north, the 27th Australian Brigade had not been engaged during the Japanese assaults on the first day. Possessing only the [2/26th](/wiki/2/26th_Battalion_(Australia)) and 2/30th, following the transfer of the 2/29th Battalion to the 22nd Brigade, Maxwell sought to reorganise his force to deal with the threat posed to the western flank. Late on 9 February, the Imperial Guards began assaulting the positions held by the 27th Brigade, concentrating on those held by the 2/26th Battalion. During the initial assault, the Japanese suffered severe casualties from Australian mortars and machine-guns and from burning oil which had been [sluiced](/wiki/Sluice) into the water following the demolition of several oil tanks by the Australians. Some of the Guards reached the shore and maintained a tenuous [beachhead](/wiki/Beachhead); at the height of the assault, it is reported that the Guards commander, Nishimura, requested permission to cancel the attack due to the many casualties his troops had suffered from the fire but Yamashita ordered them to press on. Communication problems caused further cracks in the Commonwealth defence. Maxwell knew that the 22nd Brigade was under increasing pressure but was unable to contact Taylor and was wary of encirclement. As parties of Japanese troops began to infiltrate the brigade's positions from the west, exploiting the gap formed by the Kranji River, the 2/26th Battalion was forced to withdraw to a position east of the Bukit Timah Road; this move precipitated a sympathetic move by the 2/30th away from the causeway. The authority for this withdrawal would later be the subject of debate, with Bennett stating that he had not given Maxwell authorisation to do so. The result was that the Allies lost control of the beaches adjoining the west side of the causeway, the high ground overlooking the causeway and the left flank of the 11th Indian Division was exposed. The Japanese were given a firm foothold to \"build up their force unopposed\". ### Japanese breakthrough The opening at Kranji made it possible for Imperial Guards armoured units to land there unopposed, after which they were able to begin ferrying across their artillery and armour. After finding his left flank exposed by the withdrawal of the 27th Brigade, the commander of the 11th Indian Infantry Division, Key, dispatched the 8th Indian Infantry Brigade from reserve, to retake the high ground to the south of the Causeway. Throughout 10 February further fighting took place around along the Jurong Line, as orders were formulated to establish a secondary defensive line to the west of the Reformatory Road, with troops not then employed in the Jurong Line; misinterpretation of these orders resulted in Taylor, the commander of the 22nd Brigade, prematurely withdrawing his troops to the east, where they were joined by a 200-strong [ad hoc](/wiki/Ad_hoc) battalion of Australian reinforcements, known as X Battalion. The Jurong Line eventually collapsed after the 12th Indian Brigade was withdrawn by its commander, Brigadier Archie Paris, to the road junction near Bukit Panjang, after he lost contact with the 27th Brigade on his right; the commander of the 44th Indian Brigade, Ballantine, commanding the extreme left of the line, also misinterpreted the orders in the same manner that Taylor had and withdrew. On the evening of 10 February, British Prime Minister [Winston Churchill](/wiki/Winston_Churchill), cabled Wavell > I think you ought to realise the way we view the situation in Singapore. It was reported to Cabinet by the [CIGS](/wiki/Chief_of_the_General_Staff_(United_Kingdom)) [Chief of the Imperial General Staff, General [Alan Brooke](/wiki/Alan_Brooke,_1st_Viscount_Alanbrooke)] that Percival has over 100,000 [sic] men, of whom 33,000 are British and 17,000 Australian. It is doubtful whether the Japanese have as many in the whole [Malay Peninsula](/wiki/Malay_Peninsula) ... In these circumstances the defenders must greatly outnumber Japanese forces who have crossed the straits, and in a well-contested battle they should destroy them. There must at this stage be no thought of saving the troops or sparing the population. The battle must be fought to the bitter end at all costs. The 18th Division has a chance to make its name in history. Commanders and senior officers should die with their troops. The honour of the British Empire and of the British Army is at stake. I rely on you to show no mercy to weakness in any form. With the Russians fighting as they are and the Americans so [stubborn at Luzon](/wiki/Philippines_campaign_(1941%E2%80%931942)), the whole reputation of our country and our race is involved. It is expected that every unit will be brought into close contact with the enemy and fight it out. In the early afternoon of 10 February, on learning of the collapse of the Jurong Line, Wavell ordered Percival to launch a counter-attack to retake it. This order was passed on to Bennett, who allocated X Battalion. Percival made plans of his own for the counter-attack, detailing a three-phased operation that involved the majority of the 22nd Brigade, and he subsequently passed this on to Bennett, who began implementing the plan, but forgot to call X Battalion back. The battalion, consisting of poorly trained and equipped replacements, advanced to an assembly area near Bukit Timah. In the early hours of 11 February, the Japanese, who had concentrated significant forces around the Tengah airfield and on the Jurong Road, began further offensive operations: the 5th Division aimed its advance towards Bukit Panjang, while the 18th Division struck out towards Bukit Timah. They fell upon X Battalion, which had camped in its assembly area while waiting to launch its counter-attack, and two-thirds of the battalion was killed or wounded. After brushing aside elements of the 6th/15th Indian Brigade, the Japanese again began attacking the 22nd Australian Brigade around the Reformatory Road. Later on 11 February, with Japanese supplies running low, Yamashita attempted to bluff Percival, calling on him to \"give up this meaningless and desperate resistance\". The fighting strength of the 22nd Brigade—which had borne the brunt of the Japanese attacks—had been reduced to a few hundred men and the Japanese had captured the Bukit Timah area, including the main food and fuel depots of the garrison. Wavell told Percival that the garrison was to fight on to the end and that there should not be a general surrender in Singapore. With the vital water supply of the reservoirs in the centre of the island threatened, the 27th Australian Brigade was later ordered to recapture Bukit Panjang as a preliminary move in retaking Bukit Timah. The counter-attack was repulsed by the Imperial Guards and the 27th Australian Brigade was split in half on either side of the Bukit Timah Road with elements spread as far as the Pierce Reservoir. > My attack on Singapore was a bluff—a bluff that worked. I had 30,000 men and was outnumbered more than three to one. I knew that if I had to fight for long for Singapore, I would be beaten. That is why the surrender had to be at once. I was very frightened all the time that the British would discover our numerical weakness and lack of supplies and force me into disastrous street fighting. — Tomoyuki Yamashita The next day, as the situation worsened for the Commonwealth, they sought to consolidate their defences; during the night of 12/13 February, the order was given for a 28 mi (45 km) perimeter to be established around Singapore City at the eastern end of the island. This was achieved by moving the defending forces from the beaches along the northern shore and from around Changi, with the 18th Infantry Division being tasked to maintain control of the vital reservoirs and effecting a link up with Simmons' Southern Area forces. The withdrawing troops received harassing attacks all the way back. Elsewhere, the 22nd Brigade continued to hold a position west of the Holland Road until late in the evening when it was pulled back to Holland Village. On 13 February, Japanese engineers repaired the road over the causeway and more tanks were pushed across. With the Commonwealth still losing ground, senior officers advised Percival to surrender in the interest of minimising civilian casualties. Percival refused but tried to get authority from Wavell for greater discretion as to when resistance might cease. The Japanese captured the water reservoirs that supplied the town but did not cut off the supply. That day, military police executed Captain [Patrick Heenan](/wiki/Patrick_Stanley_Vaughan_Heenan) for espionage. An Air Liaison Officer with the British Indian Army, Heenan had been recruited by Japanese military intelligence and had used a radio to assist them in attacking Commonwealth airfields in northern Malaya. He had been arrested on 10 December and court-martialled in January. Heenan was shot at [Keppel Harbour](/wiki/Keppel_Harbour), on the southern side of Singapore and his body was thrown into the sea. The Australians occupied a perimeter of their own to the north-west around Tanglin Barracks, in which they maintained an all round defence as a precaution. To their right, the 18th Division, the 11th Indian Division and the 2nd Malaya Brigade held the perimeter from the edge of the Farrer Road east to Kallang, while to their left, the 44th Indian Brigade and the 1st Malaya Brigade held the perimeter from Buona Vista to Pasir Panjang. For the most part, there was limited fighting around the perimeter, except around Pasir Panjang Ridge, 1 mi (1.6 km) from Singapore Harbour, where the 1st Malaya Brigade—which consisted of a Malayan infantry battalion, two British infantry battalions and a force of Royal Engineers—fought a stubborn defensive action during the [Battle of Pasir Panjang](/wiki/Battle_of_Pasir_Panjang). The Japanese largely avoided attacking the Australian perimeter but in the northern area, the British 53rd Infantry Brigade was pushed back by a Japanese assault up the Thompson Road and had to fall back north of Braddell Road in the evening, joining the rest of the 18th Infantry Division in the line. They dug in and throughout the night fierce fighting raged on the northern front. The following day, the remaining Commonwealth units fought on. Civilian casualties mounted as a million people crowded into the 3 mi (4.8 km) area still held by the Commonwealth and bombing and artillery-fire increased. The civilian authorities began to fear that the water supply would give out; Percival was advised that large amounts of water were being lost due to damaged pipes and that the water supply was on the verge of collapse.[j] ### Alexandra Hospital massacre On 14 February 1942, the Japanese renewed their assault on the western part of the Southern Area's defences near the area that the 1st Malayan Brigade had fought desperately to hold the previous day. At about 13:00, the Japanese broke through and advanced towards the [Alexandra Barracks Hospital](/wiki/Alexandra_Hospital). A British lieutenant—acting as an envoy with a white flag—approached Japanese forces but was killed with a [bayonet](/wiki/Bayonet). After Japanese troops entered the hospital, they killed up to 50 soldiers, including some undergoing surgery. Doctors and nurses were also killed. The next day, about 200 male staff members and patients who had been assembled and bound the previous day, many of them walking wounded, were ordered to walk about 400 m (440 yd) to an industrial area. Those who fell on the way were bayoneted. The men were forced into a series of small, badly ventilated rooms where they were held overnight without water. Some died during the night as a result of their treatment. The remainder were bayoneted the following morning. Several survivors were identified after the war, some of whom had survived by pretending to be dead. One survivor, Private Arthur Haines from the [Wiltshire Regiment](/wiki/Wiltshire_Regiment), wrote a four-page account of the massacre that was sold by his daughter by private auction in 2008. ### Fall of Singapore Throughout the night of 14/15 February, the Japanese continued to press against the Commonwealth perimeter, and though the line largely held, the military supply situation was rapidly deteriorating. The water system was badly damaged and supply was uncertain, rations were running low, petrol for military vehicles was all but exhausted, and there was little ammunition left for the field artillery and anti-aircraft guns, which were unable to disrupt the Japanese air attacks causing many casualties in the city centre. Little work had been done to build air raid shelters, and [looting](/wiki/Looting) and [desertion](/wiki/Desertion) by Commonwealth troops further added to the chaos in the area.[k] At 09:30, Percival held a conference at [Fort Canning](/wiki/Fort_Canning) with his senior commanders. He proposed two options: an immediate counter-attack to regain the reservoirs and the military food depots around [Bukit Timah](/wiki/Bukit_Timah), or surrender. After a full and frank exchange of views, all present agreed that no counter-attack was possible, and Percival opted for surrender. Post-war analysis has shown that a counter-attack might have succeeded. The Japanese were at the limit of their supply line and their artillery units were also running out of ammunition. A delegation was selected to go to the Japanese headquarters. It consisted of a senior staff officer, the colonial secretary and an interpreter. The three set off in a motor car bearing a [Union Jack](/wiki/Union_Jack) and a white flag of truce toward the enemy lines to discuss a [cessation of hostilities](/wiki/Cessation_of_hostilities). They returned with orders that Percival himself proceed with staff officers to the [Ford Motor Factory](/wiki/Old_Ford_Motor_Factory), where Yamashita would lay down the terms of surrender. A further requirement was that the Japanese [Rising Sun Flag](/wiki/Rising_Sun_Flag) be hoisted over the [Cathay Building](/wiki/Cathay_Building), the tallest building in Singapore. Percival formally surrendered shortly after 17:15. Earlier that day, Percival had issued orders to destroy all secret and technical equipment, [ciphers](/wiki/Cipher), codes, secret documents and heavy guns. Under the terms of the surrender, hostilities were to cease at 20:30 that evening, all military forces in Singapore were to surrender unconditionally, all Commonwealth forces would remain in position and disarm themselves within an hour, and the British were allowed to maintain a force of 1,000 armed men to prevent looting until relieved by the Japanese. Yamashita also accepted full responsibility for the lives of the civilians in the city. Following the surrender, Bennett caused controversy when he decided to escape. After receiving news of the surrender, Bennett handed command of the 8th Australian Division to the divisional artillery commander, Brigadier [Cecil Callaghan](/wiki/Cecil_Callaghan) and—along with some of his staff officers—commandeered a small boat. Bennett's party eventually made its way back to Australia while between 15,000 and 20,000 Australian soldiers were reportedly captured. Bennett blamed Percival and the Indian troops for the defeat but Callaghan reluctantly stated that Australian units had been affected, towards the end of the battle, by many desertions.[l][m] The Kappe Report, compiled by Colonels J. H. Thyer and C. H. Kappe, concedes that at most only two-thirds of the Australian troops manned the final perimeter. Many British units were reported to have been similarly affected. In analysing the campaign, Clifford Kinvig, a senior lecturer at Royal Military Academy Sandhurst, blamed the commander of the 27th Infantry Brigade, Brigadier [Duncan Maxwell](/wiki/Duncan_Maxwell), for his defeatist attitude and not properly defending the sector between the Causeway and the Kranji River. Elphick also claims that Australians made up the majority of stragglers. According to another source, Taylor cracked under the pressure.[n] Thompson wrote that the 22nd Australian Brigade was \"so heavily outnumbered that defeat was inevitable\" and Costello states that Percival's insistence on concentrating the 22nd Australian Brigade at the water's edge had been a serious mistake. Yamashita, the Japanese commander, laid the blame on the British \"underestimating Japanese military capabilities\" and Percival's hesitancy in reinforcing the Australians on the western side of the island. A classified wartime report by Wavell released in 1992 blamed the Australians for the loss of Singapore. According to [John Coates](/wiki/John_Coates_(general)), the report \"lacked substance\", for though there had undoubtedly been a lack of discipline in the final stages of the campaign—particularly among the poorly trained British, Indian and Australian reinforcements that were hurriedly dispatched as the crisis worsened—the 8th Australian Division had fought well and had gained the respect of the Japanese. At Gemas, Bakri and Jemaluang, \"they achieved the few outstanding tactical successes\" of the campaign in Malaya and although the Australians made up 13 per cent of the British Empire's ground forces, they suffered 73 per cent of its battle deaths. Coates argues that the real reason for the fall of Singapore was the failure of the Singapore strategy, to which Australian policy-makers had contributed in their acquiescence and the lack of military resources allocated to the fighting in Malaya. ## Aftermath ### Analysis The Japanese had advanced 650 mi (1,050 km) from [Singora](/wiki/Sultanate_of_Singora), Thailand, to the southern coast of Singapore at an average rate of 9 mi (14 km) a day. While impressed with Japan's quick succession of victories, German dictator [Adolf Hitler](/wiki/Adolf_Hitler) reportedly forbade his foreign minister [Joachim von Ribbentrop](/wiki/Joachim_von_Ribbentrop) from issuing a congratulatory communique despite being allied with Japan, deeming it as a \"setback\" for the [white race](/wiki/Nazi_racial_theories). Churchill called the fall of Singapore to the Japanese \"the worst disaster and largest capitulation in British history\". Churchill's physician [Lord Moran](/wiki/Charles_Wilson,_1st_Baron_Moran) wrote: > The fall of Singapore on February 15 stupefied the Prime Minister. How came 100,000 men (half of them of our own race) to hold up their hands to inferior numbers of Japanese? Though his mind had been gradually prepared for its fall, the surrender of the fortress stunned him. He felt it was a disgrace. It left a scar on his mind. One evening, months later, when he was sitting in his bathroom enveloped in a towel, he stopped drying himself and gloomily surveyed the floor: 'I cannot get over Singapore', he said sadly. The loss of Singapore, along with other defeats in Southeast Asia in 1942, reduced British prestige in the region. According to author Alan Warren, the Fall of Singapore shattered \"the British Empire's illusion of permanence ... and strength\", ultimately making \"European empires in Asia unsustainable beyond the short term\" and presaging the end of colonialism in the region in the post war period. ### Casualties Nearly 85,000 British, Indian and Commonwealth troops were captured, in addition to losses during the earlier fighting in Malaya. About 5,000 men were killed or wounded, a majority of whom were Australian. Japanese casualties during the fighting in Singapore amounted from 1,713 to 1,714 killed and from 2,772 to 3,378 wounded. During the 70-day campaign in Malaya and Singapore, total Commonwealth casualties amounted to 8,708 killed or wounded and 130,000 captured (38,496 United Kingdom, 18,490 Australian of whom 1,789 were killed and 1,306 wounded, 67,340 Indian and 14,382 local volunteer troops), against 9,824 Japanese casualties. ### Subsequent events The [Japanese occupation of Singapore](/wiki/Japanese_occupation_of_Singapore) started after the British surrender. Japanese newspapers triumphantly declared the victory as deciding the general situation of the war. The city was renamed *Syonan-to* (昭南島 *Shōnan-tō*; literally: 'Southern Island gained in the age of [Shōwa](/wiki/Sh%C5%8Dwa_period)', or 'Light of the South'). Curtin compared the loss of Singapore to the [Battle of Dunkirk](/wiki/Battle_of_Dunkirk). The [Battle of Britain](/wiki/Battle_of_Britain) occurred after Dunkirk; \"the fall of Singapore opens the [Battle for Australia](/wiki/Battle_for_Australia)\", Curtin said, which threatened the Commonwealth, the United States, and the entire English-speaking world. The Japanese sought vengeance against the Chinese and anyone who held [anti-Japanese sentiments](/wiki/Anti-Japanese_sentiment). The Japanese authorities were suspicious of the Chinese because of the [Second Sino-Japanese War](/wiki/Second_Sino-Japanese_War), and murdered thousands of citizen \"undesirables\" (mostly ethnic Chinese) in the [Sook Ching massacre](/wiki/Sook_Ching_massacre). The other ethnic groups of Singapore—such as the Malays and Indians—were not spared. Residents suffered great hardships under Japanese rule over the following three-and-a-half years. Numerous British and Australian soldiers taken prisoner remained in Singapore's [Changi Prison](/wiki/Changi_Prison) and many died in captivity. Thousands of others were transported by sea to other parts of Asia, including Japan, to be used as forced labour on projects such as the Siam–Burma [Death Railway](/wiki/Burma_Railway) and [Sandakan airfield](/wiki/Sandakan_Death_Marches) in [North Borneo](/wiki/North_Borneo). Many of those aboard the ships [perished](/wiki/Hell_ship#Japanese_hell_ships). An Indian revolutionary, [Rash Behari Bose](/wiki/Rash_Behari_Bose), formed the pro-[independence](/wiki/Indian_independence_movement) [Indian National Army](/wiki/Indian_National_Army) (INA) with the help of the Japanese, who were highly successful in recruiting Indian prisoners of war. In February 1942, out of approximately 40,000 Indian personnel in Singapore, about 30,000 joined the INA, of which about 7,000 fought Commonwealth forces in the [Burma Campaign](/wiki/Burma_Campaign) and in the northeast Indian regions of [Kohima](/wiki/Kohima) and [Imphal](/wiki/Imphal); others became POW camp guards at Changi. An unknown number were taken to Japanese-occupied areas in the South Pacific as forced labour. Many of them suffered severe hardships and brutality similar to that experienced by other prisoners held by Japan during the war. About 6,000 survived until they could be liberated by Australian and US forces in 1943–1945, as the war in the Pacific turned in favour of the Allies. A day after the fall of Singapore on 15 February 1942, the 25th Army crossed the [Singapore Strait](/wiki/Singapore_Strait) and landed on [Batam Island](/wiki/Batam_Island) without resistance. The Dutch [KNIL](/wiki/Royal_Netherlands_East_Indies_Army) garrisons stationed on [Batam](/wiki/Batam) had already abandoned the island on 14 February 1942, after hearing reports of the impending total collapse of Singapore across the strait. Six days after the fall of Singapore, Japanese forces captured [Tanjungpinang](/wiki/Tanjungpinang), marking the complete [fall of the Riau Islands](/wiki/Fall_of_the_Riau_Islands) under Japanese control. Commando raids were carried out against Japanese shipping in Singapore Harbour in [Operation Jaywick](/wiki/Operation_Jaywick) (1943) and [Operation Rimau](/wiki/Operation_Rimau) (1944) to varying success. British forces had planned to reconquer Singapore in [Operation Mailfist](/wiki/Operation_Mailfist) in 1945, but the war ended before it could be carried out. The island was re-occupied in [Operation Tiderace](/wiki/Operation_Tiderace) by British, Indian and Australian forces following the [surrender of Japan](/wiki/Surrender_of_Japan) in September. Yamashita was tried by a US military commission for war crimes but not for crimes committed by his troops in Malaya or Singapore. He was convicted and hanged in the Philippines on 23 February 1946. ## Commemoration Since 1998, Singapore has observed [Total Defence Day](/wiki/Total_Defence_(Singapore)) on 15 February each year, marking the anniversary of the surrender of Singapore. The concept of Total Defence as a national defence strategy was first introduced in 1984, which serves as a significant reminder that only [Singaporeans](/wiki/Singaporeans) with a stake in the country can effectively defend [Singapore](/wiki/Singapore) from future threats. Yearly observances on that day include: - Since 1967, a memorial service is held at the [War Memorial Park](/wiki/War_Memorial_Park,_Singapore) to recognise civilians who had lost their lives during the Japanese occupation; - Since 1998, sirens on the [Public Warning System](/wiki/Public_Warning_System_(Singapore)) are sounded throughout the country (initially at 12.05 p.m.), with the [Singapore Civil Defence Force](/wiki/Singapore_Civil_Defence_Force) broadcasting an Important Message Signal through the sirens as well as local radio stations; and Singaporean schools conducting emergency preparedness drills, including food and electricity rationing exercises. - Since 2015, the timing for the sounding of the sirens has been shifted to 6.20 p.m., corresponding with the actual time of the surrender of Singapore in 1942. - [Fall of the Riau Islands](/wiki/Fall_of_the_Riau_Islands) — Continuation of the Battle of Singapore - [British Far East Command](/wiki/British_Far_East_Command) - [Japanese order of battle during the Malayan campaign](/wiki/Japanese_order_of_battle_during_the_Malayan_campaign) - [Far East prisoners of war](/wiki/Far_East_prisoners_of_war) ## Notes ## Footnotes Library resources about **Fall of Singapore** - Resources in your library - Resources in other libraries - Bicycle Blitzkrieg – The Japanese Conquest of Malaya and Singapore 1941–1942 - Royal Engineers Museum Royal Engineers and the Second World War – the Far East - The diary of one British POW, Frederick George Pye of the Royal Engineers Portals: - History - Singapore - Japan - British Empire\n",
  "language": "en",
  "processed_at": "2026-01-12T11:02:57.373069",
  "title": "Fall of Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Fall_of_Singapore"
}