{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:02:58.872307"
  },
  "content": "The **Falun Buddha Society** **(Singapore)** (Chinese: 新加坡法輪佛學會) is a [religious organization](/wiki/Religious_organization) in [Singapore](/wiki/Singapore). [Falun Gong](/wiki/Falun_Gong), which originated in [mainland China](/wiki/Mainland_China), was introduced to Singapore in 1994, leading to the establishment of the first Falun Buddha Society outside of China. Falun Gong practitioners in Singapore typically engage in activities aimed at informing the public about Falun Gong (also known as Falun Dafa) and its core principles. They are often seen conducting related activities in sports stadiums, [Singapore Botanic Gardens](/wiki/Singapore_Botanic_Gardens), and various public parks, with some local residents also participating. ## History In July 1996, the Falun Buddha Society (Singapore) was officially established as a legally registered association, becoming the first Falun Buddha Society outside of China. As of 2001, Falun Gong had approximately 1,000 members in Singapore. In 2004, the Singapore edition of *[The Epoch Times](/wiki/The_Epoch_Times)*, a Falun Gong-affiliated media outlet, was launched. As of 2020, Falun Gong in Singapore had approximately 500 to 1,000 members. As of March 2021, the Falun Buddha Society of Singapore maintained 26 main practice sites. ## Controversies Between 2000 and 2006, Falun Gong practitioners in Singapore were prosecuted six times under various charges. The [Singapore government](/wiki/Government_of_Singapore) has been accused by associates of Falun Gong of “discriminating” against practitioners by allegedly rejecting applications for [citizenship](/wiki/Singaporean_nationality_law), [permanent residency](/wiki/Permanent_residency_in_Singapore), and work permits, delaying student pass renewals, and pressuring practitioners to resign from their jobs. In July 1999, some local community centers and clubs in Singapore began suspending activities related to Falun Gong. On 31 December 2000, about 60 Falun Gong practitioners gathered at [MacRitchie Reservoir](/wiki/MacRitchie_Reservoir) for a candlelight vigil. The Singapore police detained 15 individuals, and on 2 January 2001, charged them with “unlawful assembly.” Seven were sentenced to imprisonment and eight were fined S$1,000. On 19 March 2001, the Singapore Buddhist Federation issued a statement requesting Falun Gong to stop using Buddhist terminology. In November 2001, the Chinese Embassy in Singapore held an exhibition titled “Anti-Falun Gong Cult Photo Exhibition” at the [Singapore Chinese Chamber of Commerce and Industry](/wiki/Singapore_Chinese_Chamber_of_Commerce_and_Industry). The event was opened by Chinese Ambassador Zhang Jiuheng, and prompted a protest by over a dozen Falun Gong practitioners. In July 2006, nine Falun Gong members were believed to be involved in unlawful activities for engaging in unauthorised actions outside the Chinese embassy (Falun Gong sources claimed it was due to their distribution of materials encouraging people to quit the [Chinese Communist Party](/wiki/Chinese_Communist_Party)). Another three members were charged for meditating and staging a hunger strike in protest. On 5 October 2009, five Falun Gong practitioners were arrested near Merlion Park by police, who accused them of offenses including “vandalism” and “inciting others.” Their display boards and materials were confiscated. The individuals were later charged in court. Between 5 and 7 May 2010, seven Falun Gong practitioners, including Huang Caihua and Cai Yongshui, were charged in court by the Central Police Division. Huang faced seven charges, while others were charged with vandalism and incitement-related offenses. In August 2015, a 21-year-old Chinese national, Gao Bin, vandalised an MRT viaduct pillar along Geylang East Avenue 1 in Singapore by writing pro-Falungong and anti-Chinese Communist Party messages in Chinese using a black marker. The graffiti included a message such as \"Falun Dafa is good. Chinese Communist Party is going to fall, faster leave the party, to save yourselves,\" along with a phone number, and caused $300 in damage to the rail operator SMRT. A week later, Gao committed a similar offence on a Land Transport Authority control box along Lorong 22 Geylang. He told police that his intent was to raise awareness among his fellow Chinese citizens. Four other similar vandalism cases from the same month were taken into consideration, involving property belonging to Singapore Power, SingTel, and SMRT. The total damage caused was assessed at $728.11. Gao, who was studying English at a private school in Singapore, stated he was unable to pay for the damages. He was sentenced to two months’ imprisonment and six strokes of the cane. Under Singapore law, each count of vandalism carries a maximum penalty of three years’ imprisonment, a fine of up to $2,000, and between three and eight strokes of the cane. On 5 July 2023, [Singapore police](/wiki/Singapore_Police_Force) found 59-year-old Falun Gong practitioner Peh Teck Ho conducting a public assembly without a permit along Science Park Road in [Jurong](/wiki/Jurong), during which he displayed a placard promoting Falun Gong. On 13 May 2025, Peh was charged with two offenses under the Public Order Act and three offenses under the Vandalism Act, and was fined S$1,000. The court stated that the offense stemmed from organizing a public assembly without the required permit. - [Falun Gong outside mainland China](/wiki/Falun_Gong_outside_mainland_China)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:02:58.871558",
  "title": "Falun Buddha Society (Singapore)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Falun_Buddha_Society_(Singapore)"
}