{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:03:00.851031"
  },
  "content": "Singaporean television drama seriesThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Family Matters\" Singaporean TV series – news **·** newspapers **·** books **·** scholar **·** JSTOR *(September 2021)* *(Learn how and when to remove this message)* **Family Matters** (Chinese: 法庭俏佳人) is a 2006 Singaporean Mandarin television drama series which was aired on [Mediacorp TV Channel 8](/wiki/Channel_8_(Singaporean_TV_channel)). Starring [Ivy Lee](/wiki/Ivy_Lee_(actress)) and [Thomas Ong](/wiki/Thomas_Ong), the series depicts the lives of two lawyers who specialise in divorce cases in the Family Court of Singapore, and also their romance which is fraught with troubles. ## Plot As a child, Zhao Shuyang (Ivy Lee) was adopted by Zheng Zhigang (Chen Shucheng) when her parents got separated and remarried. Raised by Zheng, Shuyang grew up to become a promising lawyer, specializing in divorce cases. Having been loved by her adoptive parents and stepbrother, Zheng Weilun (Terence Cao), Shuyang yearns to marry. Her stepbrother, Weilun, tries to woo her but to no avail, because Shuyang is romantically interested in Gao Ming. However, Shuyang is shocked when she finds out the truth about Gao Ming (Thomas Ong), her adoptive father's illegitimate son. To make matters worse, she finds herself falling for the ever-flamboyant Gao Ming. Towards the end, she contracts stomach [cancer](/wiki/Cancer) with little hope of survival. In the last episode, Shuyang chooses Gao Ming and Wei Lun is sent to prison. Shuyang manages to keep her condition in control by undergoing treatment for a year. Gao Ming And Shuyang then get married. ## Cast - [Ivy Lee](/wiki/Ivy_Lee_(actress)) as Zhao Shuyang - [Thomas Ong](/wiki/Thomas_Ong) as Gao Ming - [Terence Cao](/wiki/Terence_Cao) as Zheng Weilun - [Cynthia Koh](/wiki/Cynthia_Koh) as Guan Ji'er - [Chen Shucheng](/wiki/Chen_Shucheng) as Zheng Zhigang - Lin Yuyun as Li Chunling - [Lin Meijiao](/wiki/Lin_Meijiao) as Gao Wei - [Wang Yuqing](/wiki/Wang_Yuqing) as Xie Xhangfeng - [Nick Shen](/wiki/Nick_Shen) as Shi Baobao - Huang Dingrong as Rain - [Rebecca Lim](/wiki/Rebecca_Lim) as Luo Manshi - Tan Xin Yi as Young Shuyang - Li Jiaxun as Young Weilun ## Accolades AccoladeAwardNomineeResultRef[Star Awards 2006](/wiki/Star_Awards_2006) Show 2[Best Actress](/wiki/Star_Awards_for_Best_Actress)[Ivy Lee](/wiki/Ivy_Lee_(actress))Won[Best Supporting Actress](/wiki/Star_Awards_for_Best_Supporting_Actress)[Lin Meijiao](/wiki/Lin_Meijiao)Nominated - [List of programmes broadcast by Mediacorp Channel 8](/wiki/List_of_programmes_broadcast_by_Mediacorp_Channel_8) - *Family Matters* (English) on Mediacorp website - *Family Matters* (Chinese) on Mediacorp website This Singaporean television-related article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:03:00.850492",
  "title": "Family Matters (Singaporean TV series)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Family_Matters_(Singaporean_TV_series)"
}