{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:03:08.939901"
  },
  "content": "* *Far East Orchard Limited** ([abbreviation](/wiki/Abbreviation): **FEOR**), formerly known as **Orchard Parade Holdings Limited**, has been listed on the Mainboard of the Singapore Exchange since 1968. It is a member of [Far East Organization](/wiki/Far_East_Organization), [Singapore](/wiki/Singapore)'s largest private property developer. FEOR is a real estate company with a lodging platform that aims to achieve sustainable and recurring income through a diversified and balanced portfolio build on its twin pillar of growth - hospitality and purpose-built student accommodation (PBSA) in the United Kingdom. ## History The Group was incorporated in 1967 as Ming Court Limited and came under Far East Organization in 1987. In 1991, it was renamed Orchard Parade Holdings Limited. On 27 July 2012, as part of a corporate restructuring, the Group was renamed as Far East Orchard Limited. ## Operations The group's hospitality arm, Far East Hospitality, now owns more than 10 hospitality assets and manages over 95 properties with close to 16,500 rooms across Australia, Austria, Denmark, Germany, Hungary, Japan, Malaysia, New Zealand, and Singapore. Far East Hospitality has a stable of 10 unique and complementary hospitality brands are Oasia, Quincy, Rendezvous, Village, Far East Collection, A by Adina, Adina Hotels, Vibe Hotels, Travelodge Hotels and Collection by TFE Hotels. Far East Orchard's current UK PBSA comprises more than 3,500 in the cities of Brighton, Bristol, Leeds, Liverpool, Newcastle upon Tyne and Sheffield. The Group also holds a portfolio of purpose-built medical suites for lease and for sale in Singapore's premier medical hub in [Novena](/wiki/Novena,_Singapore). Portals: - Singapore - Companies\n",
  "language": "en",
  "processed_at": "2026-01-12T11:03:08.939287",
  "title": "Far East Orchard",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Far_East_Orchard"
}