{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:03:11.007139"
  },
  "content": "Real estate developer in Singapore **Far East Organization** is the largest private [real estate](/wiki/Real_estate) developer in [Singapore](/wiki/Singapore). Founded in 1960 by [Ng Teng Fong](/wiki/Ng_Teng_Fong), the company has businesses in property development, retail, hospitality, and food and beverage brands in Asia and Australia. Far East Organization operates in Singapore, Hong Kong, Mainland China,[*citation needed*] Malaysia,[*citation needed*] and Australia. It has three public-listed [subsidiaries](/wiki/Subsidiaries): [Far East Orchard](/wiki/Far_East_Orchard) Limited, [Yeo Hiap Seng Limited](/wiki/Yeo_Hiap_Seng_Limited), and Far East Hospitality Trust. ## History Far East Organization's first residential project was 72 [terrace houses](/wiki/Terrace_house#Southeast_Asia) in Jalan Pacheli in [Serangoon Gardens](/wiki/Serangoon_Gardens). The project was completed in 1962. After developing a series of residential developments in the 1960s, the company diversified into retail, starting with Far East Shopping Centre on [Orchard Road](/wiki/Orchard_Road) in 1974. This was followed by the completion of other shopping and office developments in the prime Orchard Road area, including [Lucky Plaza](/wiki/Lucky_Plaza) (1978), Orchard Plaza (1981), [Far East Plaza](/wiki/Far_East_Plaza) (1983), and Claymore Plaza (1984). In 1987, the company acquired a majority stake in the publicly listed Ming Court Hotel Limited (renamed Orchard Parade Holdings Limited in 1991). The acquisition included the Ming Court Hotel, which was renamed The Orchard Parade Hotel. Orchard Parade Holdings was restructured in 2012 to become Far East Orchard.[*citation needed*] In 1995, the company acquired a majority stake in [Yeo Hiap Seng](/wiki/Yeo_Hiap_Seng), a Singaporean beverage company. The company launched the luxury development brand Inessence in 2010 and lifestyle real estate development brand Far East SOHO in 2011. In 2012, Far East Organization listed the Far East Hospitality Trust on the [Singapore Exchange](/wiki/Singapore_Exchange). Far East Hospitality is the hospitality branch of Far East Orchard, a subsidiary of Far East Organization. In 2013, it entered the Australian market through acquisitions and partnerships with The Straits Trading Company and Toga Group. It also acquired several retail and commercial developments.[*citation needed*] In October 2019, the company opened The Fullerton Hotel Sydney which occupies Sydney's former [General Post Office](/wiki/General_Post_Office,_Sydney), built in 1874. Two new businesses, Store-Y—a self-storage facility— and Agape Laundry—a centralised commercial laundry service—were established in 2017. In 2020, Far East Hospitality expanded for the first time into overseas territories with the acquisition of Village Hotel Ariake Tokyo in Japan. ## Notable projects ### Residential Homes #### Inessence Far East Organization developed the Inessence concept to cater to the luxury market. Key projects are: 1. Alba: A luxury residence located near Orchard Road's prime shopping belt. The Y-shaped architecture is designed by Bernardo Fort-Brescia of Arquitectonica and its high-floor units offer city views. 2. Boulevard Vue: Located off Orchard Boulevard, this residential development with 26 units and two penthouses is designed by Takashi Sugimoto of Super Potato Japan 3. Skyline@Orchard Boulevard: This development in Orchard Road features 40 units, including a triplex penthouse. The design is the work of Pritzker Prize Laureate Fumihiko Maki of Maki & Associates. #### Far East SoHo Far East began created another [brand](/wiki/Brand) in 2011 labeled “Far East SOHO”, “SoHo” referring to the official small office and small home (SoHo) real estate category designation. Key projects are: 1. The Scotts Tower: Located at Scotts and Cairnhill Roads, it is the first project under the Far East SOHO brand. Designed by Ben van Berkel of UNStudio in Amsterdam, this 31-storey tower comprising apartments and penthouses was awarded the World Gold Winner in the FIABCI Prix d'Excellence Award 2020. The development was also among eight projects recognised for design excellence and safety. 2. The Siena: This condominium in Bukit Timah features high ceilings and unique layouts. The 54-unit development was recognized with the SG Mark award at the Singapore Good Design Mark (SG Mark) Awards 2017 ### Mixed-use Developments One Holland Village is a mixed-use development by Far East Organization, Sekisui House and Sino Group, located in the heart of Holland Village, Singapore. Holland Village was designated an Urban Redevelopment Authority Identity Node in 2013 - local identity areas known for their distinctive qualities. This project was a significant investment by the Far East-led consortium in enhancing urban living, marked by their acquisition of the site for S$1.2 billion. This project near the [Holland Village MRT Station](/wiki/Holland_Village_MRT_station) integrates residential, offices, retail and serviced apartment components, offering a holistic urban living experience. The retail portion is designed as an open-air concept with greenery and public amenities. The Reserve Residences in [Bukit Timah](/wiki/Bukit_Timah), next to the [Bukit Timah Nature Reserve](/wiki/Bukit_Timah_Nature_Reserve) is an integrated development with 732 residential units, retail mall and serviced apartments. The [mixed-use development](/wiki/Mixed-use_development) will be integrated with a transport hub. It is the first [mixed-use development](/wiki/Mixed-use_development) to be built on an integrated transport hub in [Bukit Timah](/wiki/Bukit_Timah). Far East Organization and [Sino Group](/wiki/Sino_Group) jointly acquired the Jalan Anak Bukit site for S$1.03 billion. **[Golden Mile Complex](/wiki/Golden_Mile_Complex)** was acquired by Far East Organization, Perennial Holdings and [Sino Land Group](/wiki/Sino_Group) in 2022. The partners aim to transform the property into a [mixed-use](/wiki/Mixed-use_development) residential, office and retail development. ### Shopping malls **[Orchard Central](/wiki/Orchard_Central)** is a [shopping mall](/wiki/Shopping_mall) by Far East Organization located along the main shopping belt at [Orchard Road](/wiki/Orchard_Road). It sits on the land previously occupied by an open air carpark and has a 160m frontage along Orchard Road. It was officially opened on 2 July 2009. In December 2016, Forbes recognized Orchard Central as one of the top five shopping malls in Singapore. Discovery Walk on Orchard — which comprises Orchard Central developed by Far East Organization, 313@somerset by LendLease and orchardgateway by OCBC Bank and Great Eastern was awarded the FIABCI Prix d'Excellence Award 2016 World Gold Winner (Retail category). ### Hotels Far East Orchard, a listed subsidiary of the Far East Organization, operates the [Oasia Hotel](/wiki/Oasia_Hotel) brand in Singapore through Far East Hospitality. The brand includes two hotels – the 193 meter [Oasia Hotel Downtown](/wiki/Oasia_Hotel_Downtown) and the Oasia Hotel Novena – and the Oasia Residence. - Far East Organization\n",
  "language": "en",
  "processed_at": "2026-01-12T11:03:11.006624",
  "title": "Far East Organization",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Far_East_Organization"
}