{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:03:18.951686"
  },
  "content": "Park in Singapore **Farrer Park Field** (known formerly as **Farrer Park**) is an open field managed by [Sport Singapore](/wiki/Sport_Singapore) in [Kallang](/wiki/Kallang), [Singapore](/wiki/Singapore). It was the location of Singapore's first race course, [Serangoon Road Race Course](/wiki/Farrer_Park#Serangoon_Road_Race_Course), as well as where its first-ever aircraft landing took place in 1919. It is a significant location for Singapore's aviation, sporting and political histories. ## Etymology Farrer Park Field was named after Roland John Farrer, president of the former [Singapore Municipal Commission](/wiki/Singapore_Municipal_Commission). It received the name in 1935. ## History Farrer Park Field used to occupy a much larger area than it does today, stretching as far north as Owen Road. At its greatest extent, the field extended across the present-day planning areas of [Kallang](/wiki/Kallang) and [Rochor](/wiki/Rochor). The modern field, however, is wholly located within Kallang. [Sport Singapore](/wiki/Sport_Singapore), which now manages Farrer Park Field, will return the land to the government by mid-2020 for future residential development. Members of the public have voiced concerns over the possible loss of heritage, considering Farrer Park Field is notable for its contribution to [Singapore](/wiki/Singapore)'s sporting, political and aviation spheres. ## Use ### Serangoon Road Race Course Serangoon Road Race Course was established in December 1842, making it the first race course in [Singapore](/wiki/Singapore). Operated by the [Singapore Sporting Club](/wiki/Singapore_Sporting_Club) and named after the nearby [Serangoon Road](/wiki/Serangoon_Road), horse races were held mostly during the weekends and targeted primarily at the European communities. On non-race days, the race course doubled as a golf course, grazing pasture and rifle range. On 6 February 1919, a grand fair was held at the Farrer Park Field as part of a series of celebrations for Singapore's centenary. The race course grounds were used as an airstrip. In 1924, Singapore Sporting Club was renamed \"[Singapore Turf Club](/wiki/Singapore_Turf_Club)\". The race course would remain at Farrer Park Field until 1933 when it was superseded by the [Bukit Timah Race Course](/wiki/Bukit_Timah_Race_Course). Farrer Park Field eventually opened for public use, with new developments including playing fields and a building called \"Sports House\". Today, Race Course Road and Race Course Lane bear witness to the area's horse racing past. [Farrer Park MRT station](/wiki/Farrer_Park_MRT_station) took its name from this field. ### Politics Farrer Park Field was the location of numerous political gatherings during [Singapore](/wiki/Singapore)'s turbulent pre-war and post-war years. In 1942, following the [Japanese takeover](/wiki/Japanese_occupation_of_Singapore) of Singapore, soldiers from the [British Indian Army](/wiki/British_Indian_Army) were rounded up at Farrer Park Field to urge them to switch allegiance to the Japanese. This event is now known as the [Farrer Park address](/wiki/Farrer_Park_address) which eventually led to the formation of the [Indian National Army in Singapore](/wiki/Indian_National_Army_in_Singapore) and [Subash Chandra Bose](/wiki/Subash_Chandra_Bose) proclaimed a Free India at [Cathay Building](/wiki/Cathay_Building) on 21 October 1943. In the post-war struggle for independence, many political rallies were held at Farrer Park Field. On 15 August 1955, the [People's Action Party](/wiki/People%27s_Action_Party) (PAP) campaigned for [self-governance](/wiki/Self-governance_of_Singapore) at Farrer Park Field. ### Military In February 1966, the 2nd Battalion of the [Singapore Infantry Regiment](/wiki/Singapore_Infantry_Regiment) (2 SIR) was based at Farrer Park Field for over six weeks following their return to [Singapore](/wiki/Singapore) from [Sabah](/wiki/Sabah) during the period of [*Konfrantasi*](/wiki/Indonesia%E2%80%93Malaysia_confrontation). The original barracks of 2 SIR was then occupied by the [5th Battalion Royal Malay Regiment](/wiki/Royal_Malay_Regiment#5th_Battalion_Royal_Malay_Regiment) (5 RMR). ### Sports The park was associated with [Football in Singapore](/wiki/Football_in_Singapore) and was nicknamed the \"cradle\" and \"spiritual home\" of football in Singapore. Many national footballers and Malaysia Cup-winning teams started their football career in the park. It was also the home stadium for the [Farrer Park United](/wiki/Farrer_Park_United) football club. - [Padang, Singapore](/wiki/Padang,_Singapore), historic place for the events of national importance in Singapore - [NS Square](/wiki/NS_Square), newer place for the events of national importance in Singapore - Infopedia 1°18′40″N 103°50′49″E﻿ / ﻿1.3110°N 103.8470°E﻿ / 1.3110; 103.8470\n",
  "language": "en",
  "processed_at": "2026-01-12T11:03:18.951273",
  "title": "Farrer Park Field",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Farrer_Park_Field"
}