{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:03:31.019417"
  },
  "content": "Ethnic group **Filipinos in Singapore** consists of citizens of the [Philippines](/wiki/Philippines) working or residing in [Singapore](/wiki/Singapore). According to a 2013 estimate by the [Commission on Filipinos Overseas](/wiki/Commission_on_Filipinos_Overseas), a total of 203,243 Filipinos work or reside in the country, a portion of which could consist of permanent residents or persons of Filipino descent who are not citizens of the Philippines within the community. ## History In 2004, a majority of Filipinos residing in Singapore were domestic workers, while a minority of them worked in [white-collared](/wiki/White-collar_worker) jobs. In 2007, an estimated 80,000 work as [domestic helpers](/wiki/Domestic_helper), with another 12,000 in the [information technology](/wiki/Information_technology) industry. This marks a slight rise from 1995, when roughly 75,000 domestic helpers from the Philippines were estimated to be working in Singapore. By 2009, the Filipino population in Singapore increased to 163,090, and between 2010 and 2012, about 45,450 more Filipinos were newly hired into Singapore. Due to the influx of Filipino domestic workers in the early 2000s, there was the stereotype of Filipinos being domestic workers among Singaporeans and this was portrayed in a Singaporean TV series, [The Noose](/wiki/The_Noose_(TV_series)), which featured a fictional character named [Leticia Bongnino](/wiki/The_Noose_(TV_series)#Leticia_Bongnino). The stereotype resulted in some Filipinos working in other sectors of the economy being mistaken by locals as domestic workers. However, in recent years they have seen professional diversification, with others working as nurses, bankers, F&B and retail store staff and entertainers. The number of Filipino victims of [human trafficking](/wiki/Human_trafficking) jumped by 70% in 2007 to 212 cases. By 2013, a total of 203,243 Filipinos resided in Singapore, with 49,000 that were not properly documented or had overstayed illegally. Roughly 460,000 Filipino tourists came to Singapore in 2008. ### Filipinos’ Residency Status in Singapore A majority of Filipinos in Singapore are on work permits, according to a 2013 estimate by the Commission on Filipinos Overseas. There are also white-collared workers who are applying for [permanent residency](/wiki/Permanent_resident) in the country, some eventually applying for Singapore citizenship as well. However, the number of Singapore citizens of Filipino origin is difficult to determine, since they are officially counted as members of the \"Others\" racial category by the [Immigration and Checkpoints Authority](/wiki/Immigration_and_Checkpoints_Authority). ## Incidents ### Celebration of Philippine Independence Day In May 2014, plans to hold celebrations for the Philippine Independence Day were cancelled due to online criticism of holding it in [Orchard Road](/wiki/Orchard_Road), Singapore's main shopping district. ### Edz Ello sedition In January 2015, Ello Ed Mundsel Bello (also known as Edz Ello), a Filipino nurse working for [Tan Tock Seng Hospital](/wiki/Tan_Tock_Seng_Hospital) was sacked. He was then charged for posting anti-Singaporean remarks on his social media accounts in April in the same year. His comments immediately went viral, leading to \"netizens\" lodging police reports against him. Right after his comments went viral, his employer [Tan Tock Seng Hospital](/wiki/Tan_Tock_Seng_Hospital), conducted internal investigations. He was also required to assist in police investigations. However, he only admitted to posting some of the offensive comments to both the hospital investigation team and the police force, he then claimed that his social media accounts were \"hacked\", with the \"hackers\" posting the offensive comments using his social media accounts. Police investigations showed that all the comments were made by Edz Ello, and his account wasn't hacked as what he had told the police previously. Netizens also proved that this was not the first time that he had made such a post before this incident. On April 7, 2015, Ello Ed Mundsel Bello was arrested and charged for three counts of subsequently lying to the police, and two counts of publishing seditious statements. This resulted in an [online petition](/wiki/Online_petition) on Facebook to deport the nurse. On September 21, 2015, Bello was sentenced to four months of jail. ## Notable people - [Bernadette Ong](/wiki/Bernadette_Ong), Miss Universe Singapore 2020. - [Flor Contemplacion](/wiki/Flor_Contemplacion), Filipino domestic worker who was executed for murder - [Martina Veloso](/wiki/Martina_Veloso), sports shooter - Philippines portal - Singapore portal - [Philippines–Singapore relations](/wiki/Philippines%E2%80%93Singapore_relations) - [Flor Contemplacion](/wiki/Flor_Contemplacion)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:03:31.018836",
  "title": "Filipinos in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Filipinos_in_Singapore"
}