{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:03:32.930920"
  },
  "content": "Singaporean company **FilmTack** is a [multinational](/wiki/Multinational_corporation) window films company headquartered in [Singapore](/wiki/Singapore) that develops and supports a wide range of products and services related to [glass tinting](/wiki/Window_film). FilmTack invests in related assets and businesses with a strong presence in the key global markets: [Oceania](/wiki/Oceania), [NE Asia](/wiki/Northeast_Asia) (ex. China), [ASEAN](/wiki/ASEAN) and [North America](/wiki/North_America). In addition to its home base in Singapore. FilmTack, through its subsidiaries, associates and joint ventures, is mainly engaged in product development of window films and paint protection films, [infrared](/wiki/Infrared)-filtering chemicals, [antimicrobial](/wiki/Antimicrobial_surface) window films, and provision of private-label branding services. The group subsidiary, FilmTack Pte Ltd is a recipient of the E50.startup Award in 2006 organized by [Accenture](/wiki/Accenture), [The Business Times](/wiki/Business_Times_(Singapore)) and [Economic Development Board of Singapore](/wiki/Economic_Development_Board). ## History FilmTack was spun off from parent Haeuei Enterprise in 2004. The initial product range was limited to metallized and non-metallized Dyed Films. The primary use of window tinting was once for privacy and protection against harmful [ultraviolet](/wiki/Ultraviolet) rays. Today, the industry has evolved to provide higher heat reduction films through the coating of metals and ceramics on the polyester films. In 2007, FilmTack acquired processing facilities for converting [thermal transfer ribbon](/wiki/Thermal_transfer)(TTR). In what is by far the largest business failure in the group history, the collapse of the TTR division in 2009, resulted in the transfer of all warehousing facilities to FilmTack's window films division. In 2010, the group celebrated its 30th anniversary, and Chairman Poon T K expressed concern about rising raw-material prices and uncertain global demand in the trade. Company began to embark on the largest facility upgrading program in history in bid to improve efficiency. By July 2, 2011, FilmTack completed the US$1.6 million expansion which doubled slitting and rewinding facilities and increased warehousing space to over 23,000sqft. In August 2016, MaxPro Manufacturing, LLC announces partnership with FilmTack, using FilmTack as a regional distribution center for MaxPro Window Films, aligning with Singapore's efforts to strength its business hub status in Asia-Pacific. The terms of the deal included the establishment of a regional logistics center in Singapore to expand MaxPro's footprints throughout the Asia-Pacific and a US$1.7 million investment. These funds will be used to acquire a new 8500sqft facility before 2017 to accommodate the expected growth. The continued global demand for metallized films saw the launch of automotive SPX series in 2019 which had little interference with various [5G bandwidths](/wiki/5G), while maintaining superior heat reduction. Complementing the [TPU](/wiki/Thermoplastic_polyurethane)-trading business, paint protection films were launched in 2020 after five years of development and testing in tropical climates with hydrophobic, self-heating and stain-resistance features. In 2021, FilmTack developed nano-islands coating on window film surface to offer protection against the [human coronavirus](/wiki/COVID-19_pandemic) and bacteria, incorporating earlier antimicrobial technology in face-shield visor films . In mid-2020s, FilmTack narrowed the price differential in PSF (unit) between 40-inch and 60-inch automotive films due to better economies of scale; the demand for 40-inch width had been growing significantly in recent years due to soaring shipping surcharges imposed on 60-inch tints . ## Thin Film Technologies The Company actively manages its portfolio divisions by providing both financial and operational expertise and helping these companies chart their strategic direction and growth initiatives in numerous areas. ### Advanced Coatings In the early 1990s, the most successful ceramics tint in the market was made using [Titanium Nitride](/wiki/Titanium_nitride)(TiN). During the same period, Japanese window films manufacturers figured that [Antimony](/wiki/Antimony) Tin Oxide(ATO) could be added to window films to achieve higher [visible light transmission](/wiki/Light)(VLT) at a lower cost, as compared to TiN, given the same heat reduction. However, the early ATO films production technology was relatively unstable and it was only until 1999, that production breakthrough was truly achieved for ATO films. During the early 2000s, most of the Japanese Antimony Tin Oxide films were procured by FilmTack's associated companies in Singapore. FilmTack also became one of the world's largest [sputtered films](/wiki/Sputter_deposition) distributor in mid-2000s. [Titanium](/wiki/Titanium), [Nichrome](/wiki/Nichrome) and [Silver](/wiki/Silver) sputtered films were the three popular metals added to polyester films to achieve solar protection properties for glazing. [Sputtered](/wiki/Sputtering) semi-products were shipped via air to minimize oxidation risk and [U.S.](/wiki/United_States)-made Nichrome-Silver-Nichrome(NSN) was the most popular formulation based on regional sales volume. In the late 2000s, FilmTack dominated global demand for [Indium Tin Oxide](/wiki/Indium_Tin_Oxide) (ITO) films from Japan. ITO provides higher VLT than ATO and TiN, given the same heat reduction. In countries with the strictest tinting regulations, the ITO films' 88% VLT provides the clearest high-heat reduction film for automotive tinting. In the architectural arena, ITO films emerge as the third technology after Sputtering films and multi-layered optical films to achieve ≤0.60 shading coefficient for VLT ≥70%. By the 2010s, FilmTack began to focus on launching dual-ply or 3-ply [Nichrome](/wiki/Nichrome)(an alloy of nickel and chromium) window films to achieve better [pareto efficiency](/wiki/Pareto_efficiency) between cost and heat reduction. The technology provides an economical solution without noticeable compromising of product heat reduction. In 2019, the global launch of 5G telecommunication services resulted in the obsolete of sputtered films which use silver and other highly-reflective coatings and FilmTack's new SPX became of the few high heat-reducing, metallized film with minimal impact on [5G signals](/wiki/5G). ### Stable-Dyed Films The mid-2010s witnessed the extensive upgrade of most FilmTack's automotive films with color stable capability and significantly lower haze-level due to the success in pigment particle-size reduction. By 2023, it was estimated that every two minutes, a full passenger sedan was tinted with Stable-Dyed series, making it the most popular automotive film from FilmTack. Ceramics are also used in an upgraded version (Stable-Pro Series) to provide additional heat reduction. ### High Heat-Reduction Antimicrobial Window Films The face of healthcare workers have been reported to be the body part commonly contaminated by body fluids. In 2020, FilmTack introduced [Face shield](/wiki/Face_shield) visor films with [Antimicrobial](/wiki/Antimicrobial) coatings with [Anti-Fogging](/wiki/Anti-fog) properties which provide better protection for healthcare workers against aerosols and mucous membranes in the course of their work. The antimicrobial coatings were eventually used on window films, offering protection against common bacteria such as Staphylococcus aureus, E. Coli, etc. The advanced coating also contains antiviral technology which reduces the survivability of SARS-CoV-2 virus on glass surfaces in 24 hours. During the [COVID-19](/wiki/COVID-19) outbreak, the company issued COVID-19 advisory for automotive tinting facilities with the help of medical professionals and donated over 3000 N95 masks to various medical institutions with the help of regional window film distributors and dealers. A second version, ZIR Series was launched in mid-2021 and achieved over 90-97% [Infrared](/wiki/Infrared) heat reduction. ## Corporate Leadership - Poon T K - Founder, Chairman - K H Poon - Company Director, IWFA Accredited Advanced Solar Control Specialist - J X Poon - Company Director, IWFA Accredited Automotive Specialist\n",
  "language": "en",
  "processed_at": "2026-01-12T11:03:32.930366",
  "title": "FilmTack",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/FilmTack"
}