{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:03:34.909390"
  },
  "content": "Head of finance of the Crown colony of Singapore from 1947 to 1959 The **Financial Secretary of Singapore** was a senior position in the colonial administration of [Singapore during British rule](/wiki/Crown_Colony_of_Singapore). The office was responsible for managing government finances, preparing the [budget](/wiki/Government_budget) and overseeing [economic policy](/wiki/Economic_policy). It existed from 1947 until 1959, when Singapore attained full internal self-government and the role was replaced by the [Minister for Finance](/wiki/Finance_Minister_of_Singapore). ## History The office of Financial Secretary was established in early 1947 in the aftermath of [World War II](/wiki/World_War_II), as part of broader efforts to rebuild Singapore's civil administration. The Financial Secretary served as a key official in the colonial government, advising the [Governor of Singapore](/wiki/Governor_of_Singapore) on fiscal and economic matters. The post was broadly equivalent in function to a [finance minister](/wiki/Finance_minister), and the holder often sat as an *[ex officio](/wiki/Ex_officio)* member of the Executive Council. It was first held by [James David Maxwell Smith](/wiki/James_David_Maxwell_Smith), who served from 1947 to 1951. Between 1951 and 1954, the office was vacant and held by acting officials until [Thomas Hart](/wiki/Thomas_Hart_(civil_servant)) took up the position in 1954. In 1959, Singapore achieved full internal self-government following the [general election](/wiki/1959_Singaporean_general_election) that year. The office of Financial Secretary was formally abolished in 1959 following constitutional changes that granted Singapore full internal self-government. This transition was legally enacted through the Minister for Finance (Incorporation) Act 1959, which repealed the previous provisions associated with the Financial Secretary and established the statutory foundation for the new [Minister of Finance](/wiki/Ministry_of_Finance_(Singapore)#Ministers). The Act vested the minister with authority over the financial assets and liabilities of the government, thereby consolidating fiscal control under an elected cabinet portfolio. [Goh Keng Swee](/wiki/Goh_Keng_Swee) became the first to hold the new ministerial portfolio, succeeding Hart who served as the last Financial Secretary. - [Minister for Finance (Singapore)](/wiki/Minister_for_Finance_(Singapore)) - [Chief Secretary of Singapore](/wiki/Chief_Secretary_of_Singapore) - [Chief Minister of Singapore](/wiki/Chief_Minister_of_Singapore) - [Governor of Singapore](/wiki/Governor_of_Singapore) This Singapore-related article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:03:34.908907",
  "title": "Financial Secretary of Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Financial_Secretary_of_Singapore"
}