{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:03:39.105545"
  },
  "content": "British journalist and TV presenter (born 1964) **Fiona Elizabeth Bruce** (born 25 April 1964) is a British journalist, newsreader and television presenter. She joined the [BBC](/wiki/BBC) as a researcher for their current affairs programme *[Panorama](/wiki/Panorama_(British_TV_programme))* in 1989, and became the first female newsreader on *[BBC News at Ten](/wiki/BBC_News_at_Ten)*, as well as presenting many other flagship programmes for the corporation, including *[BBC News at Six](/wiki/BBC_News_at_Six)*, *[Crimewatch](/wiki/Crimewatch)*, *[Real Story](/wiki/Real_Story)*, *[Antiques Roadshow](/wiki/Antiques_Roadshow)* and *[Fake or Fortune?](/wiki/Fake_or_Fortune%3F)* Since 10 January 2019, she has been the presenter of the [BBC One](/wiki/BBC_One) television programme *[Question Time](/wiki/Question_Time_(TV_programme))*. ## Early life and education Fiona Elizabeth Bruce was born on 25 April 1964 in what was then the [State of Singapore](/wiki/Singapore_in_Malaysia), Malaysia. She had an English mother and a Scottish father, who had a long career at [Unilever](/wiki/Unilever), becoming a regional managing director. Before that, the Bruce family had lived for several generations in the fishing village of [Hopeman](/wiki/Hopeman) in [Moray](/wiki/County_of_Moray) in the north-east of Scotland. Bruce has two elder brothers. She lived on the [Wirral](/wiki/Wirral_Peninsula), initially in [Port Sunlight](/wiki/Port_Sunlight), before moving to [Heswall](/wiki/Heswall), and was educated at [Gayton](/wiki/Gayton,_Merseyside) Primary School, before attending the [International School of Milan](/wiki/International_School_of_Milan). She later moved to [Brockley](/wiki/Brockley), south London, where from the age of 14 until 18, she attended [Haberdashers' Aske's Hatcham College](/wiki/Haberdashers%27_Aske%27s_Hatcham_College) in [New Cross](/wiki/New_Cross). During the latter period she modelled for the stories in the teenage girls' magazine *[Jackie](/wiki/Jackie_(magazine))*. Bruce's great-grandfather, Frederick Crouch, died in fighting on the [Western Front](/wiki/Western_Front_(World_War_I)) in World War I. Bruce read French and Italian at [Hertford College, Oxford](/wiki/Hertford_College,_Oxford). During that period, she was briefly a [punk](/wiki/Punk_subculture), singing in rock bands and, at one point, colouring her hair blue for one week. She graduated with an upper second-class honours degree. She attended the [University of London Institute in Paris](/wiki/University_of_London_Institute_in_Paris) as a scholar and is a fluent speaker of Italian and French. ## Career After leaving university, Bruce joined a management consulting firm for a year, but found the experience dull. After that, she worked at a number of advertising agencies, including [Boase Massimi Pollitt](/wiki/Boase_Massimi_Pollitt), where she met her future husband, a company director. She then went on to meet [Tim Gardam](/wiki/Tim_Gardam) – at that time the editor of the [BBC](/wiki/BBC)'s *[Panorama](/wiki/Panorama_(TV_series))* – at a wedding and, in 1989, he gave her a job as a researcher on the programme. ### News and current affairs After becoming an assistant producer on *Panorama*, she made the change to reporting in 1992 on *[Breakfast News](/wiki/BBC_Breakfast)*. She then moved to [BBC South East](/wiki/BBC_South_East), appearing as an occasional presenter and reporter on *[Newsroom South East](/wiki/Newsroom_South_East)* and a weekly current affairs programme, *First Sight*. From 1994 to 1995, she was a reporter on the BBC2 current affairs programme *Public Eye*. She then reported for *Panorama* and *[Newsnight](/wiki/Newsnight)*; she was also a presenter of Newsnight between 1995 and 1998. She then moved to presenting *[Breakfast News](/wiki/BBC_Breakfast)* and the *[BBC Six O'Clock News](/wiki/BBC_News_at_Six)* in 1996. In 1999, as part of a major relaunch of the BBC's news output, Bruce was named secondary presenter of the *BBC Six O'Clock News*. She presented the programme as a cover for the main presenter [Huw Edwards](/wiki/Huw_Edwards), as well as regularly on Fridays, until a presenter reshuffle in January 2003, to coincide with the retirement of [Michael Buerk](/wiki/Michael_Buerk) and the move of [Peter Sissons](/wiki/Peter_Sissons) to the [BBC News channel](/wiki/BBC_News_(British_TV_channel)). Both Bruce and Edwards moved to the *BBC Ten O'Clock News* and both presented the programme, until the suspension of Huw Edwards by the BBC in July 2023. Bruce continues to present the *[BBC Ten O'Clock News](/wiki/BBC_News_at_Ten)* (now known as the *BBC News at Ten*). Bruce was the first female presenter of the bulletin. In 2007, Bruce returned to presenting the *BBC News at Six*. After an eleven-year tenure, she stepped down from the Friday editions of the programme (which she was presenting at the time) in January 2019. From 2003 to 2007, Bruce presented and reported in the [BBC One](/wiki/BBC_One) current affairs series *[Real Story](/wiki/Real_Story)*. Following the murder of [Jill Dando](/wiki/Jill_Dando), Bruce took over the position of co-presenter on *[Crimewatch](/wiki/Crimewatch)* alongside [Nick Ross](/wiki/Nick_Ross), until both were replaced by [Kirsty Young](/wiki/Kirsty_Young) towards the end of 2007. In 2001, Bruce became one of the presenters of the BBC [general election](/wiki/2001_United_Kingdom_general_election) results programme. In 2006, following a court case involving [British Airways](/wiki/British_Airways) requesting that a Christian employee conceal her cross because it infringed the airline's dress code, the BBC disclosed it had some concerns over the fact that Bruce often wore a [cross necklace](/wiki/Cross_necklace), although she was not banned from doing so. On 10 January 2019, Bruce succeeded long-time host [David Dimbleby](/wiki/David_Dimbleby) on the BBC's debate programme *[Question Time](/wiki/Question_Time_(TV_programme))* as the first full-time female host. Her tenure as host was almost immediately embroiled in controversy, and in May 2020, Bruce stated \"QT is without doubt the hardest job I've ever done.\" In 2023, during an episode of *Question Time*, when journalist [Yasmin Alibhai-Brown](/wiki/Yasmin_Alibhai-Brown) claimed that [Stanley Johnson](/wiki/Stanley_Johnson_(writer)), the father of former British prime minister [Boris Johnson](/wiki/Boris_Johnson), had broken his wife's nose, Bruce interrupted to comment that Johnson's friends had said that the incident occurred, but was a \"one-off\". Following the episode, Labour MP [Kate Osborne](/wiki/Kate_Osborne), and chief executive of domestic violence charity [Women's Aid](/wiki/Women%27s_Aid), Farah Nazeer, among others, criticised the comment, saying that it downplayed domestic violence. The BBC defended Bruce, commenting that, as the host, she had a duty to present an avenue of reply by accused parties and it was not her personal comment. Bruce apologised for her comments after the incident and said that she was \"required to legally contextualise\" the statement, and that her comments were *not* reflective of her own opinions. Bruce subsequently resigned as an ambassador for the domestic violence charity [Refuge](/wiki/Refuge_(United_Kingdom_charity)), a role she had been in for over 25 years. Following an October edition of the show from [Wolverhampton](/wiki/Wolverhampton), also in 2023, Bruce apologised to an audience member for identifying him as \"the black guy\" on air. In May 2024 Bruce sparked further controversy during a BBC *Question Time* broadcast from [Aberdeen](/wiki/Aberdeen) when, after persistently interrupting [Stephen Flynn](/wiki/Stephen_Flynn) [MP](/wiki/Member_of_Parliament_(United_Kingdom)), the leader of the [SNP](/wiki/Scottish_National_Party) at [Westminster](/wiki/Parliament_of_the_United_Kingdom), and after remaining silent while Flynn was interrupted by other panel members, Bruce again interrupted Flynn and incorrectly said \"you've interrupted everybody here,\" sparking laughter from the audience. After Flynn was interrupted nearly 40 times in the programme, the BBC was accused of having a \"general antipathy\" towards the SNP. This seeming antipathy was apparently confirmed when on a subsequent programme Bruce again persistently interrupted an SNP representative on the *Question Time* panel, this time Deputy First Minister of Scotland [Kate Forbes](/wiki/Kate_Forbes), resulting in 145 complaints to the BBC. ### Other programmes In September 1998, Bruce became the presenter for [BBC Two](/wiki/BBC_Two)'s *Antiques Show*, which was in its fourth series. She presented it for a further two series, showing her interest in presenting antiques programmes nearly a decade before presenting *[Antiques Roadshow](/wiki/Antiques_Roadshow)*. On 22 June 2007, it was announced that Bruce was to replace the retiring [Michael Aspel](/wiki/Michael_Aspel) as presenter of *Antiques Roadshow* the following spring, which initially caused some controversy. However, average viewership increased during Bruce's first year as presenter. In 2007, Bruce wrote and presented a BBC documentary about [Cherie Blair](/wiki/Cherie_Blair) as [Tony Blair](/wiki/Tony_Blair) left office. Bruce also occasionally presented special editions of *[The Money Programme](/wiki/The_Money_Programme)*. In one, she profiled the entrepreneur [Alan Sugar](/wiki/Alan_Sugar). She said of the experience: \"It was a bit like being in front of a hair dryer at very close quarters. He's not backwards in coming forward in his opinions.\" During the documentary, Bruce – who has always publicly identified herself as a [feminist](/wiki/Feminist) – challenged Sugar's view that women should openly disclose their childcare commitments to a potential employer. Her point was that if men were not required to declare their ability to meet the demands of their job, it was not right that women should do so. *Victoria: A Royal Love Story* (2010) is a BBC documentary, written and presented by Bruce, charting the story of the love affair between [Queen Victoria](/wiki/Queen_Victoria) and [Prince Albert](/wiki/Prince_Albert_of_Saxe-Coburg_and_Gotha), and documenting the collection of paintings, sculptures, and jewellery they gave each other. Since 2011, she has co-hosted the BBC television series *[Fake or Fortune?](/wiki/Fake_or_Fortune%3F)* alongside [Philip Mould](/wiki/Philip_Mould), which involves the process of establishing the authenticity of works of art, including the use of modern techniques. In 2011, Bruce wrote and presented *[The Queen's Palaces](/wiki/The_Queen%27s_Palaces)*, a three-part BBC documentary telling the story of Queen [Elizabeth II](/wiki/Elizabeth_II)'s three official residences, [Buckingham Palace](/wiki/Buckingham_Palace), [Windsor Castle](/wiki/Windsor_Castle), and [Holyrood Palace](/wiki/Holyrood_Palace). In 2012, Bruce wrote and presented a BBC documentary about [Leonardo da Vinci](/wiki/Leonardo_da_Vinci). In 2015 and 2016, she presented the [BBC Four](/wiki/BBC_Four) quiz programme *[Hive Minds](/wiki/Hive_Minds)*. In 2017, it was reported that Bruce was paid between £350,000 and £400,000 as a BBC presenter. In early 2019, she stated that she did not keep track of her salary which, for 2018, was reportedly £170,000, an amount that did not include her earnings from *Antiques Roadshow*. ### Parody and humour Bruce was featured in an episode of *[Top Gear](/wiki/Top_Gear_(2002_TV_series))* ([series 10, episode 3](/wiki/Top_Gear_series_10)), sharing a lift with one of its presenters, [Jeremy Clarkson](/wiki/Jeremy_Clarkson), and then having to push him out (as he was stuck in a [Peel P50](/wiki/Peel_P50), which has no reverse gear). As she walked away, Clarkson commented, without her knowledge until the programme was aired, \"She has got quite a nice bottom... I said that out loud, didn't I?\" Bruce returned to *Top Gear* in the next series ([series 11, episode 4](/wiki/Top_Gear_series_11)), alongside fellow newsreader [Kate Silverton](/wiki/Kate_Silverton), for the \"Star in a Reasonably-Priced Car\" feature. As a comeback to the \"nice bottom\" comment, she slapped Clarkson's and declared that it \"needs a bit of work\". Since then, she has also occasionally stood in for a holidaying Clarkson in his *[Sunday Times](/wiki/Sunday_Times)* car review column, which she referred to as the ultimate revenge: \"perching my bottom – nice or otherwise – on his patch.\" In the BBC Two version of the satirical impressions show *[Dead Ringers](/wiki/Dead_Ringers_(series))*, Bruce was parodied by [Jan Ravens](/wiki/Jan_Ravens), who ruthlessly exaggerated her mannerisms through sexual innuendo. For example: \"Hello, my name is Fiona Bruce sitting on the luckiest chair in Britain\", and \"Hello, I'm Fiona Bruce; don't touch what you can't afford.\" She appeared in a tongue-in-cheek [BBC HD](/wiki/BBC_HD) advertisement in 2008, featuring a parody of the *Antiques Roadshow*, in which she drove a car through a wall, before running towards a falling vase, with the car exploding as she jumped to save the vase from crashing. Bruce has regularly appeared on the BBC's annual *[Children in Need](/wiki/Children_in_Need)* telethon, performing musical routines alongside fellow BBC newsreaders. Her rendition of \"[All That Jazz](/wiki/All_That_Jazz_(song))\" in the 2007 edition, while performing as Velma Kelly, led the directors of the revival of *[Chicago](/wiki/Chicago_(musical))* to invite her to the London performance of the 10th-anniversary gala, where she appeared on stage in a parade of Velmas. Referring to [Jeremy Clarkson](/wiki/Jeremy_Clarkson)'s adoration of her – he once described her as \"agonisingly gorgeous\" – she remarked, \"In my twenties I was virulently opposed to anyone commenting on my appearance, lest it come at the expense of my ability. But it's not an issue for me now. If Jeremy Clarkson pays me a compliment, then fine, how nice, 'Thanks Jeremy'.\" ## Political causes Bruce has often been outspoken regarding her commitment to [feminism](/wiki/Feminism), expressing concern at a 2006 poll that suggested almost three-quarters of women no longer saw feminism as necessary: \"The contradictions are still there [in society] which is why I think feminism is still very relevant for me and it's just such a shame that it's become a byword for mustachioed, man-hating women [from Lebanon](/wiki/Lesbian).\" Despite her firm views on the subject – including a \"disappointment\" in women who dislike working with other women – she claims to have softened her feminist views from her university days, where she once ran an anti-pornography campaign. ### Fathers 4 Justice controversy Bruce was criticised for showing \"blatant bias\" when interviewing [Matt O'Connor](/wiki/Matt_O%27Connor_(activist)), founder of [Fathers 4 Justice](/wiki/Fathers_4_Justice), for a BBC programme in 2004. Bruce, who had featured in advertising campaigns for the charity [Women's Aid](/wiki/Women%27s_Aid), was accused of having an axe to grind on the issue of [domestic violence](/wiki/Domestic_violence). Many, including O'Connor, felt she let her own personal view on domestic violence as an issue of gender take over the programme. There were also concerns that O'Connor had originally been invited to speak about [CAFCASS](/wiki/CAFCASS) and the Family Courts, yet the programme was changed to focus on domestic violence. Later, a BBC committee, investigating on behalf of the [BBC Governors](/wiki/BBC_Governors), concluded that there were \"some weaknesses\" in the programme when considered against the BBC's journalistic values of \"Truth and Accuracy, Serving the Public Interest, Impartiality and Diversity of Opinion, Independence and Accountability\", but that the programme \"still made a valuable contribution to the debate on parental rights\". Overall the committee \"did not think that these matters were sufficient to constitute a serious breach of editorial standards\" and found that \"the programme had provided appropriate and balanced information around the allegation that violent men had infiltrated F4J\". ### Charity work Bruce is an honorary vice-president of optical charity [Vision Aid Overseas](/wiki/Vision_Aid_Overseas) (VAO), alongside fellow newsreader Sir [Trevor McDonald](/wiki/Trevor_McDonald). In February 2005, Bruce did the voice-over for VAO's Lifeline Appeal. In 2007, Bruce launched VAO's Annual Review. Later that year she was one of nine prominent women to take part in the *[What's it going to take?](/wiki/What%27s_it_going_to_take%3F)* campaign for the charity [Women's Aid](/wiki/Women%27s_Aid). In 2009, the [NSPCC](/wiki/NSPCC) inducted her into its Hall of Fame in honour of her continued work on their behalf. In accepting the honour, she said, \"The work of the NSPCC and [ChildLine](/wiki/ChildLine) is desperately important and I do little compared to what needs to be done. But I'm very honoured to be included in the Hall of Fame.\" Bruce was ambassador for the domestic violence charity [Refuge](/wiki/Refuge_(United_Kingdom_charity)) but was forced to step back from the role in 2023 when, on *[Question Time](/wiki/Question_Time_(TV_programme))*, she appeared to downplay the historic incident of [Stanley Johnson](/wiki/Stanley_Johnson_(writer)) breaking his wife [Charlotte Fawcett](/wiki/Charlotte_Johnson_Wahl)'s nose. Her remarks saw well over 800 complaints to the [BBC](/wiki/BBC). ## Personal life Bruce met Nigel Sharrocks (born 1956) when he was director of the advertising agency where she worked. He is non-executive chairman of [Digital Cinema Media](/wiki/Digital_Cinema_Media). They married in July 1994 in [Islington](/wiki/Islington), [London](/wiki/London) and have two children, a son born in January 1998 and a daughter born in November 2001. Their main residence is in [Belsize Park](/wiki/Belsize_Park), London, and they have a second home in [Sydenham](/wiki/Sydenham,_Oxfordshire), [Oxfordshire](/wiki/Oxfordshire). In 2014, Bruce stated that she did not use social media because of the misogynistic abuse directed towards female celebrities. She was awarded the female [Rear of the Year](/wiki/Rear_of_the_Year) title in 2010, and accepted it in person. The following year, however, she declared that her acceptance of it had been \"hypocritical\" and that the award was \"demeaning\". - *[Antiques Roadshow Detectives](/wiki/Antiques_Roadshow_Detectives)* - Media related to Fiona Bruce at Wikimedia Commons - Fiona Bruce at [IMDb](/wiki/IMDb_(identifier)) - Vision Aid Overseas - Profile from BBC News - BBC Newswatch Profile - Her BBC Press Office biography - Profile from 'Real Story'\n",
  "language": "en",
  "processed_at": "2026-01-12T11:03:39.105075",
  "title": "Fiona Bruce",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Fiona_Bruce"
}