{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:03:55.304302"
  },
  "content": "Spherical food item made from fishPart of a series on[Chinese cuisine](/wiki/Chinese_cuisine)[Regional cuisines](/wiki/Chinese_regional_cuisine)Four Great Traditions - [Chuan (Sichuan)](/wiki/Sichuan_cuisine) - [Lu (Shandong)](/wiki/Shandong_cuisine) - [Yue (Guangdong)](/wiki/Cantonese_cuisine) - [Huaiyang (Jiangsu)](/wiki/Huaiyang_cuisine) Eight Great Traditions (+all above) - [Anhui](/wiki/Anhui_cuisine) - [Fujian](/wiki/Fujian_cuisine) - [Hunan](/wiki/Hunan_cuisine) - [Zhejiang](/wiki/Zhejiang_cuisine) Ten Great Traditions (+all above) - [Beijing](/wiki/Beijing_cuisine) - [Shanghai](/wiki/Shanghai_cuisine) Twelve Great Traditions (+all above) - [Henan](/wiki/Henan_cuisine) - [Shaanxi](/wiki/Shaanxi_cuisine) Fourteen Great Traditions (+all above) - [Hubei](/wiki/Hubei_cuisine) - [Liaoning](/wiki/Liaoning_cuisine) Sixteen Great Traditions (+all above) - [Tianjin](/wiki/Tianjin_cuisine) - [Yunnan](/wiki/Yunnan_cuisine) New Eight Great Traditions - [Gansu](/wiki/Gansu_cuisine) - [Hangzhou](/wiki/Zhejiang_cuisine#Style) - [Jilin](/wiki/Jilin_cuisine) - [Liaoning](/wiki/Liaoning_cuisine) - [Ningbo](/wiki/Zhejiang_cuisine#Style) - [Shaanxi](/wiki/Shaanxi_cuisine) - [Shanghai](/wiki/Shanghai_cuisine) - [Shanxi](/wiki/Shanxi_cuisine) Beijing and the vicinity - [Beijing](/wiki/Beijing_cuisine) - [Imperial](/wiki/Chinese_imperial_cuisine) - [Aristocrat](/wiki/Chinese_aristocrat_cuisine) - [Tianjin](/wiki/Tianjin_cuisine) Other regional styles - [Teochew](/wiki/Teochew_cuisine) - [Guangxi](/wiki/Guangxi_cuisine) - [Guizhou](/wiki/Guizhou_cuisine) - [Hainan](/wiki/Hainan_cuisine) - [Haipai](/wiki/Haipai_cuisine) - [Hakka](/wiki/Hakka_cuisine) - [Hong Kong](/wiki/Hong_Kong_cuisine) - [Jiangxi](/wiki/Jiangxi_cuisine) - [Macanese](/wiki/Macanese_cuisine) - [Manchu](/wiki/Manchu_cuisine) - [Northeastern](/wiki/Northeastern_Chinese_cuisine) - [Putian (Henghwa)](/wiki/Putian_cuisine) - [Qinghai](/wiki/Qinghai_cuisine) - [Taiwan](/wiki/Taiwanese_cuisine) - [Tibetan](/wiki/Tibetan_cuisine) - [Xinjiang](/wiki/Xinjiang_cuisine) Overseas cuisine - [Australia](/wiki/Australian_Chinese_cuisine) - [Britain](/wiki/British_Chinese_cuisine) - [Burma](/wiki/Burmese_Chinese_cuisine) - [Cambodia](/wiki/Cambodian_Chinese_cuisine) - [Canada](/wiki/Canadian_Chinese_cuisine) - [Caribbean](/wiki/Caribbean_Chinese_cuisine) - [Philippines](/wiki/Filipino_Chinese_cuisine) - [India](/wiki/Indian_Chinese_cuisine) - [Indonesia](/wiki/Chinese_Indonesian_cuisine) - [Japan](/wiki/Japanese_Chinese_cuisine) - [Latin America](/wiki/Chinese_Latin_American_cuisine) - [Perú](/wiki/Chifa) - [Puerto Rico](/wiki/Puerto_Rican_Chinese_cuisine) - [Korea](/wiki/Korean_Chinese_cuisine) - [Malaysia](/wiki/Malaysian_Chinese_cuisine) - [New Zealand](/wiki/New_Zealand_Chinese_cuisine) - [Pakistan](/wiki/Pakistani_Chinese_cuisine) - [Singapore](/wiki/Singaporean_cuisine#Chinese) - [United States](/wiki/American_Chinese_cuisine) Religious cuisines - [Buddhist](/wiki/Chinese_Buddhist_cuisine) - [Islamic](/wiki/Chinese_Islamic_cuisine) - [Taoist](/wiki/Taoist_diet) Ingredients and types of food - [Main dishes](/wiki/List_of_Chinese_dishes) - [Desserts](/wiki/Chinese_desserts) - [Noodles](/wiki/Chinese_noodles) [Preparation and cooking](/wiki/Chinese_cooking_techniques) - [Stir frying](/wiki/Stir_frying) - [Double steaming](/wiki/Double_steaming) - [Red cooking](/wiki/Red_cooking) See also - [Customs and etiquette](/wiki/Customs_and_etiquette_in_Chinese_dining) - [List of Chinese desserts](/wiki/List_of_Chinese_desserts) - [List of Chinese dishes](/wiki/List_of_Chinese_dishes) - [List of Chinese restaurants](/wiki/List_of_Chinese_restaurants) - [List of restaurants in China](/wiki/List_of_restaurants_in_China) - Asia portal - China portal - Taiwan portal - Hong Kong portal - Singapore portal - Malaysia portal - v - t - e **Fish balls** are balls made from [fish paste](/wiki/Fish_paste) which are then [boiled](/wiki/Boiled) or [deep-fried](/wiki/Deep-fried). Similar in composition to [fishcake](/wiki/Fishcake), fish balls are often made from fish mince or [surimi](/wiki/Surimi), salt, and a culinary [binder](/wiki/Binder_(material)) such as tapioca flour, cornstarch, or potato starch. Fish balls are popular in East and Southeast [Asia](/wiki/Asia), Europe (especially Northern Europe), and some coastal countries of [West Africa](/wiki/West_Africa). In Asia they are eaten as a snack or added to soups or hotpot dishes. They are usually attributed to Chinese cuisine and the fish ball industry is largely operated by people of Chinese descent.: 286 European versions tend to be less processed, sometimes using milk or potatoes for binding. Nordic countries like Norway, Denmark and Sweden each have their own variation. ## Production There are two variants of fish balls, differing in textures, production method, and primary regions of production. ### Asia While the ingredients and methods are similar between countries, differences can be noted in terms of elasticity, colour, and flavour. Fish balls in Hong Kong and the Philippines can be more firm, darker, and have more fishy taste and aroma than their Malay and Singaporean counterparts. Taiwanese fish balls have more bounce and more air incorporated to allow for soaking up soups or sauces. Typically fish are shredded, coarsely ground, or pounded, then undergo prolonged mixing with added salt and crushed ice until a smooth texture is attained. Other ingredients are added, such as sugar, [monosodium glutamate](/wiki/Monosodium_glutamate), [transglutaminase](/wiki/Transglutaminase), or starches, and then water is added to ensure the ball has a \"soft, springy texture.\" This technique, similar to the process of making surimi, uncoils and stretches previously wound and tangled protein strands in the fish, which produces food with a firm \"bouncy\" texture. In Taiwan, the term \"[Q](/wiki/Q._texture)\" is used to describe this ideal bouncy texture. In commercial production, the balls are shaped by an extruding machine, and set in water between 30 and 45 C. before boiling, cooling, then packaging.: 287, 291 The setting time is an important part of manufacture because in addition to giving the balls a translucent appearance, the shape will be maintained after packaging. They can be sold uncooked (after setting), boiled, or fried (after being boiled).: 291–293 The variety of fish used in surimi can affect commercial fish ball production, due to the difference in thermal stability between tropical fish and cold-water fish.: 290 Economically, fish ball production adds value to lower-priced fish. ### Europe [Scandinavian](/wiki/Scandinavia) fish balls are made of completely pureed fish, milk, and potato flour (or potato starch), and they are shaped without additional processing, which produces a softer texture. This type of fish ball usually comes in metal cans or transparent plastic containers containing stock or brine and also requires a setting period prior to canning. ### Shelf life Fish balls are perishable, and have a different [shelf life](/wiki/Shelf_life) based on the amount of processing and the inclusion of additives. Uncooked fish balls have a shelf life of 4 to 5 days when stored at 5 °C. A fried, marinated fish ball can last up to 135 days at ±4 °C. ### Mislabeling issues While fish balls can contain other seafood or meat products (such as squid, cuttlefish, or shrimp balls), studies conducted on processed seafood have revealed significant amounts of mislabeling. A 2017 study in Italy and Spain detected mollusks used in surimi products, which is a concern for shellfish allergies. A 2013–2016 study in the Philippines that identified the genetic code of a variety of fish balls concluded that large, well-established companies generally adhered to labelling standards, but unknown, small producers typically supplying street hawkers revealed seafood balls that contained pig or chicken meat. A 2019 study by the [National University of Singapore](/wiki/National_University_of_Singapore) showed a 7.8% mislabeling rate for single-type seafood products, and 38.5% mislabeling for products containing multiple meat sources. The study also identified seafood balls containing pig DNA, although none of the samples were labeled as a [halal](/wiki/Halal) or [kosher food](/wiki/Kosher_foods), which would pose a significant concern for the country's Muslim population. ## Regional variations ### Greater China #### Mainland China Fish balls have a long history in China, and the introduction of fish balls throughout Asia is often attributed to Chinese immigrants. Fish balls can also contain a wide array of seafood and other meats such as beef or pork.: 288 In [Hubei](/wiki/Hubei), fish balls are made from freshwater fish surimi. A [Fuzhou](/wiki/Fuzhou) variety (福州鱼丸) is made from fish with a minced pork filling.: 289 The variation from [Fuqing](/wiki/Fuqing) is much larger. Shark is also used; about 50% of shark caught in China is used for fish ball production with a small amount used for export. Tengxin Foods ([Fujian](/wiki/Fujian)) is one of China's largest fish ball factories, with a 30% market share.: 289 #### Hong Kong and Macau Fish balls (魚蛋) are one of Hong Kong's most popular and representative \"street foods\", eaten plain or cooked in a curry sauce. Readily available in traditional markets and supermarkets, fish balls are also a popular ingredient in [hot pot](/wiki/Hot_pot). [Flathead mullet](/wiki/Flathead_mullet) (九棍魚/烏仔魚) and [daggertooth pike conger](/wiki/Daggertooth_pike_conger) (門鱔) are common fish varieties used for fish balls. Originally they were likely made by mixing and frying the remaining materials of Chaozhou fish ball (潮州白魚丸) or stale fish, although more recently they are mainly imported by wholesalers and the texture is more consistent. There are three kinds of fish balls (魚蛋, literally \"fish eggs\"), sold in Hong Kong and Macau. They are yellow, white, and golden. Yellow fish balls are most commonly sold as street food. White fish balls are larger in size and made with white fish, such as Spanish mackerel, with an elastic (bouncy) and fluffy texture and a strong taste of fish. This kind is usually served to complement [noodles](/wiki/Noodle) at [Cháozhōu-style](/wiki/Teochew_cuisine) [noodle](/wiki/Noodle) restaurants, and at some *[cha chaan tengs](/wiki/Cha_chaan_teng)*, which also sell [beef balls](/wiki/Beef_ball) (牛丸) and [cuttlefish](/wiki/Cuttlefish) balls (墨魚丸). White fish balls from traditional fish ball restaurants are made from fresh fish and are normally hand-made (手打) by the owners using traditional techniques. Golden fish ball, also known as [Cheung Chau fishball](/wiki/Cheung_Chau_fishball), was a snack produced in [Cheung Chau](/wiki/Cheung_Chau). Distinguishing features included size, sauce and texture. They were served with a special curry sauce, and made from fresh fish which made the texture smoother. As of 15 August 2024 the snacks are no longer produced due to the retirement of the inventor. During the 1970s and 1980s, \"[fish ball girl](/wiki/Fish_ball_girl)\" became a euphemism for underage female sex workers. The [2016 Mong Kok civil unrest](/wiki/2016_Mong_Kok_civil_unrest), which escalated from the government's crackdown on unlicensed [street hawkers](/wiki/Hawkers_in_Hong_Kong) during the [Chinese New Year](/wiki/Chinese_New_Year) holidays, has been referred to by some media outlets and social media platforms as the \"Fishball Revolution\" (魚蛋革命). #### Taiwan Milkfish balls (虱目魚丸) are frequently found in Taiwan. The natural texture and aroma of the [milkfish](/wiki/Milkfish) give this variant a unique taste. This is one of the main ways milkfishes' lesser-prized yet highly abundant white meat is consumed. Other fishes used include shark, lizard fish, [pike eel](/wiki/Pike_eel), and [marlin](/wiki/Marlin).: 298 Fish balls with roe (魚包蛋) are served at hot pot restaurants. They have a sweet and salty taste with a popping element from the roe's texture. There is also a fried golden version. ### Southeast Asia #### Singapore In Singapore, fish balls are also known as 鱼圆 (yú yuán) or 鱼丸 (yú wán). Traditionally, fish balls were made from locally sourced fish such as [coral fish](/wiki/Coral_fish) and [dorab](/wiki/Dorab_wolf-herring). Production scale varies from individual hawker stalls to large corporate factories which supply the local and export markets. Due to higher labour costs and limited local fish supplies, surimi are mostly imported, and fish balls are produced at a lower cost by mixing surimi with fresh leached fish mince. Higher quality fish balls are made from [wolf herring](/wiki/Wolf_herring), [coral fish](/wiki/Coral_fish), [Spanish mackerel](/wiki/Spanish_mackerel), and [conger eel](/wiki/Conger_eel).: 286–287 As of 2002, Singapore consumes approximately 10 kg of fish balls per capita per year, possibly the country with the highest consumption of fish balls in the world.: 286–287 They can be served with soup and noodles like the [Chiuchow](/wiki/Chaozhou) style or with *[yong tau foo](/wiki/Yong_tau_foo)* (酿豆腐). They can also be served with noodles called *[mee pok](/wiki/Mee_pok)*. *[Bak chor mee](/wiki/Mee_pok#Bak_chor_mee)*, a popular Singaporean dish which comes in both dry and soup versions, was listed as the top world street food by World Street Food Congress. In some cases, it is also fried and served on a stick. Fish balls are the second most processed fish-based product in Singapore, roughly 10% of the total produced.: 287 #### Indonesia In [Indonesia](/wiki/Indonesia), fish balls are called *bakso ikan* (fish *[bakso](/wiki/Bakso)*) and often served with tofu, vegetables, and fish *[otak-otak](/wiki/Otak-otak)* in clear broth soup as *tahu kok*. It may be thinly sliced as additional ingredient in *[mie goreng](/wiki/Mie_goreng)*, [*kwetiau goreng*](/wiki/Char_kway_teow), *[nasi goreng](/wiki/Nasi_goreng)* and *[cap cai](/wiki/Cap_cai)*. A similar dish is called *[pempek](/wiki/Pempek),* in which surimi is shaped into logs and fried*.* There are some dishes of fish ball soup called *bakso kakap* (snapper fish ball soup) from [Semarang](/wiki/Semarang) and *bakso ikan marlin* (sailfish or blue marlin fish ball soup) from [Pesisir Barat](/wiki/Pesisir_Barat_Regency), [Lampung](/wiki/Lampung). #### Brunei In Brunei, fish balls are called *bebola ikan*. #### Malaysia In Malaysia, fish balls are known as 鱼丸 (yú wán in [Mandarin Chinese](/wiki/Mandarin_Chinese), jyu4 jyun2 in [Cantonese](/wiki/Cantonese), or hî-oân / hîr-oân / hû-oân in [Hokkien](/wiki/Hokkien)) or 鱼蛋 (yú dàn in Mandarin, jyu4 daan3 in Cantonese), and *bebola ikan* in [Malay](/wiki/Malay_language). Popular dishes include fish ball noodle soup. #### Philippines In the Philippines, there are fish balls (*pishbol*) and a similar dish called *bola-bola*, which is the same meat paste as fish cake, but wrapped in a [wonton](/wiki/Wonton) skin. [Yellowtail fusilier](/wiki/Caesio_teres), corn starch and baking powder are common ingredients.: 288 #### Thailand In Thailand, fish balls are fried or grilled as snacks. In main dishes, fish balls are in Chinese style noodle soups and [curry](/wiki/Thai_curry) dishes such as *Kaeng khiao wan luk chin pla,* a [green curry](/wiki/Green_curry).: 289 The most common varieties of fish used are [threadfin bream](/wiki/Threadfin_bream), [bigeye snapper](/wiki/Bigeye_snapper), [croaker](/wiki/Croaker_fish), [lizard fish](/wiki/Lizard_fish), [goatfish](/wiki/Goatfish),: 290 and *pla krai ([Chitala ornata](/wiki/Clown_featherback))*. #### Vietnam In Vietnam, fish balls are typically produced in seafood processing factories, then packaged and widely distributed in the market. Many vendors sell pre-fried fish balls as a snack for students right outside school gates. Fried fish balls are usually skewered and eaten with chili sauce. Additionally, fish balls are frequently used as an ingredient when eating hot pot, which many people commonly refer to as 'viên thả lẩu' (hot pot dipping/floating balls). ### Europe #### Northern Europe Known as *Fiskbullar* in [Sweden](/wiki/Sweden) and *fiskeboller* in [Norway](/wiki/Norway) and [Denmark](/wiki/Denmark), Nordic fish balls are white and without breading. - In [Norway](/wiki/Norway), fish balls (*fiskeboller*) are made using wheat and potato flour, milk, fish broth, salt and seasonings. When canned, they are packed in fish broth. Haddock is commonly used. They are commonly served with potatoes, carrots and/or cauliflower or broccoli in a [white sauce](/wiki/B%C3%A9chamel_sauce). The sauce is often made with the stock from the container, sometimes with mild [Madras curry](/wiki/Madras_curry) seasoning as a condiment, or mixed to create curry sauce. Adding [ketchup](/wiki/Ketchup) to the sauce is commonplace among children. Tiny fish balls called *suppeboller* (literally \"soup balls\") are also common in [fish soup](/wiki/Fish_soup). *Sideboller* is made from [coal-fish](/wiki/Coal-fish). - In Sweden, *fiskbullar* are normally served with mashed potatoes or rice, boiled green peas and dill, [caviar](/wiki/Caviar) or seafood sauces. - [Iceland](/wiki/Iceland) has two varieties; *Fiskbollur* [ˈfɪskˌpɔllʏr̥] is very similar to those of Norway and Sweden, whereas *Fiskibollur* [ˈfɪscɪˌpɔllʏr̥] are fried brown in a pan. Both varieties are served with boiled potatoes, carrots, lettuce, and either bechamel or Madras curry sauce. - In the [Faroe Islands](/wiki/Faroe_Islands), fish balls are called *knettir* and are made with groundfish and mutton fat. #### Germany German fish balls, known locally as *fischklößchen*, rely heavily on herbs and herb sauces. [Gefilte fish](/wiki/Gefilte_fish), typical of [Ashkenazi Jewish cuisine](/wiki/Ashkenazi_Jewish_cuisine), has origins in 14th century non-Jewish Germanic cookery. Originally a stuffed fish dish, it suited the dietary cultural needs for Jewish celebrations, being an acceptable form of meat as well as already deboned which adheres to the restriction on picking through bones on the [Sabbath](/wiki/Sabbath). Jewish communities have their own versions based on local ingredients, such as the addition of sugar in Poland, black pepper in Lithuania, and cooking it in a tomato sauce in Libya. #### England A classic English variant (as well as in the US) uses cooked mashed potato and egg as a binder, and is pan fried. Cod is a popular fish for this style. \"The Lone Fish-ball\" was published in 1855 by [George Martin Lane](/wiki/George_Martin_Lane) referencing this type of fish ball popular in New England. #### Italy Italian fish balls, known locally as *polpette di pesce*, are fried with [Parmesan](/wiki/Parmesan) cheese and breadcrumbs, and usually served with a tomato sauce. They can be found both as rounded balls and as patties. ### West Africa Fish balls are known as *boulettes de poisson* in [Francophone African](/wiki/Francophone_Africa) countries, and are commonly eaten in a tomato-based stew known as 'tchou' or 'chu' a [Senegalese](/wiki/Senegalese_cuisine) dish mainly known in [Mauritania](/wiki/Mauritania), [Mali](/wiki/Mali) and [The Gambia](/wiki/Gambian_cuisine). *Huntu* is a fish ball dish from [Sierra Leone](/wiki/Sierra_Leone) that incorporates [ginger](/wiki/Ginger). - Asia portal - Europe portal - Africa portal - Food portal - [Fishcake](/wiki/Fishcake) - [Jiaozi](/wiki/Jiaozi) - [Quenelle](/wiki/Quenelle) - [Oden](/wiki/Oden) - [Meatball](/wiki/Meatball) - Media related to Fish balls at Wikimedia Commons\n",
  "language": "en",
  "processed_at": "2026-01-12T11:03:55.303852",
  "title": "Fish ball",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Fish_ball"
}