{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:04:01.021816"
  },
  "content": "Singaporean and Indonesian soup dish **Fish soup bee hoon**, also known as **fish head bee hoon**, is a [Singaporean](/wiki/Singaporean_cuisine) soup-based seafood dish served hot usually with [bee hoon](/wiki/Bee_hoon). The dish is viewed as a healthy food by [Singaporeans](/wiki/Singaporeans). Catherine Ling of *[CNN](/wiki/CNN)* listed fish soup bee hoon as one of the \"40 Singapore foods we can't live without\". ## History Fish soup bee hoon has been available since at least the 1920s; one source credits Swee Kee Fish Head Noodle House with creating the \"definitive version\" of the dish in the 1970s. ## Ingredients [Snakeheads](/wiki/Snakehead_(fish)) are most commonly used for fish soup bee hoon. Other stalls may offer [pomfret](/wiki/Pomfret), [batang](/wiki/Mackerel), or [garoupa](/wiki/Garoupa). While fish heads or the whole fish may be used, some diners prefer having just fish slices. The fish soup is made out of either fish stock or actual bones, water, oil, yam, and milk,[a] with vegetables and select fruits. The noodle in the soup is often [bee hoon](/wiki/Bee_hoon), although a healthier alternative except for [irritable bowel syndrome](/wiki/Irritable_bowel_syndrome) sufferers would be spaghetti made from [brown rice](/wiki/Brown_rice). Another noodle variant would be fried noodles. Additional ingredients include eggs, anchovies, pepper, salt, and alcoholic products such as [brandy](/wiki/Brandy), Chinese wine, or [cognac](/wiki/Cognac), [chilli](/wiki/Chili_pepper) slices, fried [shallots](/wiki/Shallot), and fish roe. For the [vegetarian](/wiki/Vegetarian_cuisine) version of the dish, fish meat is substituted with tofu. ## Preparation The fish is boiled and added to a bowl of fish soup. The fish may also be fried. The soup is boiled for about twenty minutes, though a broth made from fish or pork bones boiled for several hours is sometimes used as a base. The dish is served hot. ## Culture Grace Chen of *[The Star](/wiki/The_Star_(Malaysia))* writes that fish soup bee hoon is \"to Singaporeans what the [char kway teow](/wiki/Char_kway_teow) is to [Penangites](/wiki/Penang)\". Catherine Ling of *[CNN](/wiki/CNN)* describes fish soup bee hoon as one of the \"40 Singapore foods we can't live without\". Jin Hua Fish Head Bee Hoon was named the best fish soup bee hoon store in Singapore by *[Time Out Singapore](/wiki/Time_Out_(magazine))* in 2012. - Food portal - [List of soups](/wiki/List_of_soups) ## Notes ## Bibliography - MobileReference (2007). *Travel Singapore: Illustrated Travel Guide, Phrasebook, and Maps*. MobileReference. [ISBN](/wiki/ISBN_(identifier)) 9781605010151.[*permanent dead link*]\n",
  "language": "en",
  "processed_at": "2026-01-12T11:04:01.021186",
  "title": "Fish soup bee hoon",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Fish_soup_bee_hoon"
}