{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:04:02.997933"
  },
  "content": "Singaporean cultural phrase The \"**Five Cs of Singapore**\"—namely, [cash](/wiki/Cash), [car](/wiki/Car), [credit card](/wiki/Credit_card), [condominium](/wiki/Condominium_(living_space)) and [country club](/wiki/Country_club)—is a phrase used in [Singapore](/wiki/Singapore) to refer to the [materialist](/wiki/Materialism) mindset and expectations viewed as prevalent in Singaporean society. It was first coined as a popular [observational joke](/wiki/Observational_comedy) during the 1990s about the aspirations of some Singaporeans who exhibit materialistic tendencies by constantly seeking to obtain material possessions in an effort to impress others. ## Overview ### Cash Cash refers to spending power rather than physical currency. Financial security and affluence is a status symbol worldwide and for much of contemporary human history was the measure of personal worth and success. ### Car The car ownership rate in Singapore is roughly 11%. In comparison, it is 50% in the [European Union](/wiki/European_Union) and 80% in the [United States](/wiki/United_States). As part of the government's continued efforts to make Singapore a \"[car-lite society](/wiki/Carfree_city)\" and reduce [car dependency](/wiki/Car_dependency), only around 33% of Singaporean and permanent resident households own cars in Singapore in 2023, down from 40% in 2013. Although cars are an abundance in most countries and are not seen as status symbol (except only for [luxury cars](/wiki/Luxury_cars)), high taxation on the import and ownership of motor vehicles (191% on new vehicles, an annual road tax based on engine size, and high pump prices) and a quota system requiring owners to acquire a costly [Certificate of Entitlement](/wiki/Certificate_of_Entitlement) (COE) has uniquely made car ownership a symbol of wealth in a land-constrained country such as Singapore. ### Credit card Credit cards are a visible symbol of success. Singapore's [financial regulator](/wiki/Financial_regulation), the [Monetary Authority of Singapore](/wiki/Monetary_Authority_of_Singapore), has stipulated a maximum personal credit limit of two months' income given personal income less than [S$](/wiki/Singapore_dollar)30,000, or four months' income for all others. Banks typically issue different types of cards depending on the available credit limit, associating greater *cachet* with cards that offer a higher limit. ### Condominium In Singapore, privately developed apartments (colloquially known as condominiums or condos) reflect a higher wealth status as compared to public housing also known as [HDBs](/wiki/Housing_Development_Board) which are public apartments built, sold and subsidised by the government. Up to 80% of Singaporeans live in public housing throughout the country, as land in Singapore is at a premium, meaning that freestanding and sometimes freehold houses are rare and signify even greater affluence, especially [old money](/wiki/Old_money). ### Country Club In Singapore, there is a small amount of country clubs which leads to limited expensive membership. Access to membership to country clubs is viewed as exclusivity and an indicator of power and wealth. ## New Five Cs In 2019, it was published that a \"new\" Five Cs has emerged since the 2010s among Singaporean white-collar workers, with lesser emphasis on materialism. While cash was retained, other C's can now include culture, credibility, career and convenience, among others. In a [web conference](/wiki/Web_conferencing) of local newspaper *[Today](/wiki/Today_(Singapore_newspaper))* in 2021, it has been argued that newer generations of Singaporeans are now less materialistic and do not value the original Five Cs as much, and that they have redefined what constitutes as success and priorities in life. A panellist added that they now opt to work for a job that they are passionate in, with the intention to \"make a difference\", rather than just working for a salary.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:04:02.997392",
  "title": "Five Cs of Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Five_Cs_of_Singapore"
}