{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:04:05.346263"
  },
  "content": "The **flag of Singapore**[a] was adopted in 1959, the year [Singapore](/wiki/Singapore) became self-governing within the [British Empire](/wiki/British_Empire). Designed by a government committee led by deputy prime minister [Toh Chin Chye](/wiki/Toh_Chin_Chye), it remained as the [national flag](/wiki/National_flag) upon [the country's independence](/wiki/Independence_of_Singapore_Agreement_1965) from [Malaysia](/wiki/Malaysia) on 9 August 1965. The design is a horizontal bicolour of red above white, [overlaid](/wiki/Charge_(heraldry)) in the [canton](/wiki/Flag_terminology) (upper hoist quarter) by a white [crescent](/wiki/Crescent) moon facing a [pentagon](/wiki/Pentagon) of five small white five-pointed stars. The elements of the flag denote a young nation on the ascendant, universal brotherhood and equality, and national ideals. Vessels at sea do not use the national flag as an [ensign](/wiki/Ensign_(flag)). [Merchant vessels](/wiki/Merchant_vessel) and [pleasure craft](/wiki/Pleasure_craft) fly a [civil ensign](/wiki/Civil_ensign) of red charged in white with a variant of the crescent and stars emblem in the centre. Non-military government vessels such as [coast guard](/wiki/Coast_guard) ships fly a [state ensign](/wiki/State_ensign) of blue with the national flag in the canton, charged with an eight-pointed red and white [compass rose](/wiki/Compass_rose) in the lower [fly](/wiki/Flag_terminology). [Naval](/wiki/Republic_of_Singapore_Navy) ships patrol a [naval ensign](/wiki/Naval_ensign) similar to the state ensign, but in white with a red compass rose emblem. The usage and exhibition of the national flag in Singapore are regulated by the rules set forth in the National Symbols Act. Under the Act, which took effect on 1 August 2023 and superseded the former Singapore Arms and Flag and National Anthem Act, private citizens may include the flag in designs for other objects, and the national flag or its image can be used on attire above the torso for non-commercial purposes year-round as long as it is not done in a disrespectful manner. Regulations are relaxed during National Day celebrations from 1 July to 30 September. ## History Singapore was under British rule in the 19th century, having been amalgamated into the [Straits Settlements](/wiki/Straits_Settlements) together with [Malacca](/wiki/Malacca) and [Penang](/wiki/Penang). The flag that was used to represent the Settlements was a British [Blue Ensign](/wiki/Blue_Ensign) defaced with a red diamond containing three gold crowns—one for each settlement—separated by a white inverted [pall](/wiki/Pall_(heraldry)), which resembles an inverted Y. The [Settlement of Singapore](/wiki/Singapore_in_the_Straits_Settlements) had no separate flag, although the city was granted a coat of arms which featured a lion in 1911. During the [occupation of Singapore](/wiki/Japanese_occupation_of_Singapore) by the Japanese during the [Second World War](/wiki/Second_World_War), the Japanese [national flag](/wiki/Flag_of_Japan) was used on land by the military and during public events. Soon after the Second World War, Singapore became an independent [Crown colony](/wiki/Crown_colony) and adopted its own flag. It was modified from the Straits Settlements flag to reduce the number of crowns from three to one. Upon [Queen Elizabeth II](/wiki/Elizabeth_II)'s accession to the throne, the crown within the pall was changed to the crown of St. Edward. Singapore became self-governing within the British Empire on 3 June 1959. Six months later, upon the installation of the new [Yang di-Pertuan Negara](/wiki/Yang_di-Pertuan_Negara_of_Singapore) [Yusof Ishak](/wiki/Yusof_Ishak) on 3 December 1959, the national flag was officially adopted, along with the [state coat of arms](/wiki/Coat_of_arms_of_Singapore) and the national anthem \"[Majulah Singapura](/wiki/Majulah_Singapura)\" (lit. 'Onward Singapore'). Then-[deputy prime minister](/wiki/Deputy_Prime_Minister_of_Singapore) [Toh Chin Chye](/wiki/Toh_Chin_Chye) discussed the creation of the national flag in a 1989 interview: > Although we were self governing it was necessary right from the beginning that we should rally enough different races together as a Singapore nation... Apart from the anthem we have to produce the flag and the crest, we insisted that it was a Singapore state flag and should be flown side by side with the [Union Jack](/wiki/Union_Jack). The design of the flag and crest was completed in two months by a committee headed by Toh. He initially wanted the flag's entire background to be red, but the [Cabinet](/wiki/Cabinet_of_Singapore) decided against this, as red was regarded as a rallying point for [communism](/wiki/Communism). Toh had opposed a [red-and-white design](/wiki/Sang_Saka_Malaya) as he considered it too similar to the flags of [Indonesia](/wiki/Flag_of_Indonesia) and [Poland](/wiki/Flag_of_Poland), but the proposals for all-red, all-blue or blue-and-white designs were rejected. The flag, according to Toh, originally had only three stars (representing democracy, justice, and equality), but two more stars and a crescent were added later to distance it from the [Malayan Communist Party](/wiki/Malayan_Communist_Party) emblem and to assure the Malay-Muslim community that Singapore was \"not a Chinese state\". According to an account given by [Lee Kuan Yew](/wiki/Lee_Kuan_Yew), the [Chinese majority](/wiki/Chinese_Singaporeans) wanted stars based on the [flag of the People's Republic of China](/wiki/Flag_of_the_People%27s_Republic_of_China) while the [Malay minority](/wiki/Malay_Singaporeans) wanted a crescent moon to represent [Islam](/wiki/Islam). Both of these symbols were combined to create the national flag of Singapore. On 30 November 1959, the Singapore State Arms and Flag and National Anthem Ordinance 1959 was passed to regulate the use and display of the State Arms and State Flag and the performance of the National Anthem. When presenting the motion to the [Legislative Assembly of Singapore](/wiki/Legislative_Assembly_of_Singapore) on 11 November 1959, culture minister [Sinnathamby Rajaratnam](/wiki/S._Rajaratnam) stated: \"National flags, crest and anthem express symbolically the hopes and ideals of a people... The possession of a national flag and crest is, for a people, symbolic of self-respect.\" In September 1962, the people of Singapore [voted for merger](/wiki/1962_Singaporean_integration_referendum) with Malaya, Sarawak, and North Borneo to form Malaysia. The process was completed on 16 September 1963, when the [Malaysian flag](/wiki/Flag_of_Malaysia) was hoisted on Singapore by prime minister Lee. The Singapore flag was reconfirmed as the national flag when Singapore became fully independent from Malaysia on 9 August 1965. ## Design The National Symbols Act defines the flag's composition and the symbolism of its elements: red symbolises \"universal fellowship and equality\", and white symbolises \"pervading and everlasting purity and virtue\". The [crescent](/wiki/Crescent) moon represents a \"young nation on the ascendant\". The five stars stand for the nation's ideals of \"democracy, peace, progress, justice and equality\". The [crescent](/wiki/Star_and_crescent) symbol is also seen by the [nation's Muslim](/wiki/Islam_in_Singapore) activists to represent [Islam](/wiki/Islam). The ratio of the flag is two units high by three units wide. For the manufacturing of flags, the Government of Singapore stated that the shade of red used on the flag is [Pantone](/wiki/Pantone) 032. According to guidelines published by the [Ministry of Information, Communications and the Arts](/wiki/Ministry_of_Information,_Communications_and_the_Arts) (MICA), the flag may be reproduced in any size and displayed at all times, but it must be in its specified proportions and colours. MICA recommends the sizes 915 by 1,370 mm (36 by 54 in), 1,220 by 1,830 mm (48 by 72 in), and 1,830 by 2,740 mm (72 by 110 in). The material that is recommended for the national flag is [bunting wool](/wiki/Bunting_(textile)). Colors schemeRedWhite[Pantone](/wiki/Pantone)032CWhite[HEX](/wiki/Web_colors)#EE2536#FFFFFF[RGB](/wiki/RGB_color_model)238-37-54255-255-255[CMYK](/wiki/CMYK)0-84-77-60-0-0-0 ## Regulations and guidelines The Singaporean government dictates that no person may treat the national flag with disrespect, such as allowing the flag to touch the ground. The flag must not be displayed below any other flag, emblem, or object; dipped in salute to any person or thing; or displayed or carried flat or horizontally, but always aloft and free. The use and display of the flag is governed by the National Symbols Act (until 2023 governed by Part III of the Singapore Arms and Flag and National Anthem Rules made under the *Singapore Arms and Flag and National Anthem Act*). It was an offence to knowingly contravene specified provisions of the Singapore Arms and Flag and National Anthem Rules; the penalty was a fine not exceeding [S$](/wiki/Singapore_dollar)1,000. Within Singapore, the national flag takes precedence over all other flags, subject to [international practice](/wiki/Flag_protocol). As such, when it is displayed or flown with other flags, it must be in a position of honour; that is, it should be positioned, where practical, either above all other flags or, if displayed side by side with other flags on the same level, to the left of the other flags (as seen by a person facing the flags). When the flag is raised or carried in a procession with other flags, it must be done so in front of the other flags in a single file, or on the right as seen by the [standard bearers](/wiki/Standard-bearer) if the flags are carried side by side (i.e., on the left as seen by the viewer). The standard bearer must carry the flag high on his or her right shoulder. When the flag is displayed on a platform or stage, it must be above all decorations and be behind and above any person speaking from the platform or stage. If it is displayed from a staff standing on the platform or stage, it must be on the right side of the person speaking from the platform or stage. Finally, when the flag is hung, it must be hung against a vertical wall or other vertical flat surface, with the crescent and stars on the top left position as seen by any spectator facing the flag and the wall or surface. When the flag is displayed outside a building, it shall be displayed on or in front of the building only from a flagpole. If the flag is flown at night, it should be properly illuminated. Permission must be sought for the flag to be displayed on any motor vehicle except on one in which the [president of Singapore](/wiki/President_of_Singapore) or any government minister is travelling on official business, and for display on any private vessel or aircraft. Permission must be sought for use or application of the flag or any image of it for any commercial purposes or as part of any furnishing, decoration, covering or receptacle, except in circumstances where it may be approved (by MICA) in which there is no disrespect for the flag. Furthermore, it is not permitted to use the flag as part of any trademark, or to produce or display any flag which bears any graphics or word superimposed on the design of the national flag. The government may ask for the flag to be lowered to [half-mast](/wiki/Half-mast) in the event of the death of an important person or for [national mourning](/wiki/National_mourning), and no person is permitted to use the flag at any private funeral ceremony. For example, during the state funeral of former president [S. R. Nathan](/wiki/S._R._Nathan) in 2016, all flags on government buildings were flown at half-mast. However, the national flag can be draped on a coffin during a military or state funeral. No person may display any flag that is damaged or dirty. Any worn out or damaged flag should be packed into a sealed black trash bag before being disposed of and not left visible in dustbins. ### Relaxations on its usage The flag was originally exclusively used on or in front of buildings owned by the government, ministries, statutory boards and educational institutions on a year-round basis. The flag could only be flown by individuals and non-governmental organisations during the month of August to mark the country's national day on 9 August. These restrictions on individuals and non-governmental organisations were relaxed in 2004 to allow the flag to be flown year-round under certain conditions. No rationale was provided for the changes, although [BBC News](/wiki/BBC_News) correspondents noted that the government had recently been trying to rally patriotic sentiment dampened by economic issues. Following requests by Singaporeans, guidelines for the use of the flag were further broadened in 2006. MICA permitted the display of the flag on vehicles and on themselves or belongings with minimal restrictions, from the middle of July to the end of August for a trial period. The period was extended in 2007 to three months from July to September. Rules were further relaxed in 2020 during the [COVID-19 pandemic](/wiki/COVID-19_pandemic_in_Singapore) to allow the flag to be flown from April to September, though this was not extended. In 2022, the National Symbols Bill was passed, which replaces the Singapore Arms and Flag and National Anthem Act, and defines new national symbols while allowing greater flexibility in the use of the national symbols. Under the new Bill, the president can make regulations on the use of national and presidential symbols while a prescribed person such as the Minister for Culture, Community and Youth can permit or prohibit the use of national symbols in appropriate situations. The Act took effect 1 August 2023. ## Use of the national flag ### National Day celebrations Singaporeans are encouraged to display the national flag outside their homes during [National Day](/wiki/National_Day_(Singapore)) celebrations, and residents' committees, particularly those of public housing estates, often arrange co-ordinated displays. However, some Singaporeans decline to do so as they associate it with the ruling [People's Action Party](/wiki/People%27s_Action_Party), rather than with the nation. During the period beginning 1 July and ending on 30 September of each year, any person may, without the need for the approval of the Minister under paragraph (4), \"incorporate the Flag or an image thereof as part of any costume or attire except that he shall do so in a manner that does not give rise to any disrespect to the Flag\". Since 1970, as part of the National Day celebrations, a large national flag is flown around by a helicopter across Singapore. From 1970 to 1979, the [Alouette III](/wiki/Alouette_III) was used, and in its first appearance the flag was around the size of a pool table. The Alouette III was followed by the [UH-1H Huey](/wiki/UH-1H_Huey) from 1980 to 1985, and the [Super Puma](/wiki/Super_Puma) from 1986 to 2000. Since 2000, the [CH-47 Chinook](/wiki/CH-47_Chinook) has flown the flag for National Day celebrations, with its size being around that of a basketball court. In 2019, it was reintroduced as the Fly Our Flag segment of the National Day celebrations, where two CH-47 Chinooks fly the national flag around the [western](/wiki/West_Region,_Singapore) and [eastern areas](/wiki/East_Region,_Singapore) of Singapore before converging back in [central](/wiki/Central_Region,_Singapore); they are accompanied by two [AH-64D Apaches](/wiki/AH-64D_Apache). On National Day in 2007 at the [Padang](/wiki/Padang,_Singapore), 8,667 volunteers holding up red and white umbrellas formed the largest-ever representation of Singapore's flag at an event organised by Young NTUC, a youth movement associated with the [National Trades Union Congress](/wiki/National_Trades_Union_Congress). ### At other times Outside the National Day celebrations period, the national flag of Singapore is flown from all buildings housing government and government-related departments, such as armed forces installations, court houses, offices, and educational institutions. A picture of the flag is commonly found in each classroom, and schools conduct ceremonies at the beginning and/or the end of the school day at which the national flag is raised, the [national anthem](/wiki/Majulah_Singapura) is sung and the [national pledge](/wiki/Singapore_National_Pledge) is taken. The national flag is sometimes flown by Singapore-registered vessels, although this is considered incorrect, as such vessels are required to hoist proper [national colours](/wiki/National_colours) either when entering or leaving port. The [ensign](/wiki/Ensign_(flag)) is red and charged with a circle enclosing a crescent surmounted by five stars in a circle, all in white. The government makes announcements regarding the lowering of the flag to half-mast in the event of a death of an important personage or mourning affecting the nation. The flag has been flown at half-mast during the funerals of former presidents and senior politicians, on 9 January 2005 as a mark of respect for those who perished in the [2004 Asian tsunami disaster](/wiki/2004_Indian_Ocean_earthquake_and_tsunami), and on 19 September 2022 on the day of [the funeral of Queen Elizabeth II](/wiki/Death_and_state_funeral_of_Elizabeth_II) of the United Kingdom. ### In popular culture Singaporean composer Lim Su Chong composed a song in 1969 entitled \"Five Stars Arising\" which took the elements of the national flag as its theme. The lyrics of the song speak of a new moon, five stars, and a new flag \"arising out of the stormy sea\". The moon is \"youthful and bright and bearing hope, and tranquil as can be\", each of the stars is \"a lamp to guide our way; a lamp for all to see\" and the flag is \"crimson as the blood of all mankind, yet white and pure and free\". The song is one of [Singapore's patriotic songs](/wiki/List_of_Singaporean_patriotic_songs) and often sung during National Day celebrations. There have been several notable cases on the misuse of the flag. In January 2003, Singaporean artist Justin Lee Chee Kong was prevented by the [Media Development Authority](/wiki/Media_Development_Authority) (MDA) from exhibiting a painting entitled *Double Happiness— A Fantasy in Red*, which consisted of the flag with red [Chinese characters](/wiki/Chinese_character) for [double happiness](/wiki/Double_Happiness_(calligraphy)) on it. The MDA cited the move on the grounds that \"the National Flag is a national symbol and no words or graphics should be superimposed on it\". Lee reported that the work was simply a display of one's love for their country and an expression of joy at Singapore's success, and in a press statement, he asked that the piece be \"treated as an artistic and complimentary interpretation of a national icon\". When interviewed by *[The New Paper](/wiki/The_New_Paper)*, he said \"I know as a citizen that we are not allowed to do it, but this is art and I am an artist.\" He also complained about double standards as a Chinese artist, [Gu Wenda](/wiki/Gu_Wenda), had recently exhibited a national flag made of hair at the [Esplanade – Theatres on the Bay](/wiki/Esplanade_%E2%80%93_Theatres_on_the_Bay). Lee felt the use of hair to create the nation's flag meant that the flag was in the wrong colours, and was distasteful. [The Rolling Stones](/wiki/The_Rolling_Stones) performed in Singapore as part of their 2002/2003 [Licks World Tour](/wiki/Licks_World_Tour). At the first performance, there were two [inflatable dolls](/wiki/Inflatable_doll) on stage. Both of the dolls had flags placed in their crotch area; one had the Rolling Stones logo and the other had a Singapore flag. The dolls and the flags were removed from the second concert by the organiser. In August 2007, a Singaporean pub, Loof, sent an email to at least 1,500 members on its mailing list featuring a close-up shot of the crotch of a female model wearing a red swimsuit or pair of underpants bearing the crescent and five stars. This was done as part of the pub's publicity campaign for its National Day events. According to Loof's marketing manager, \"[T]he ad was definitely not meant as an insult to the country or anyone. I hope that the ad will be taken in the spirit of humour and fun.\" A majority of people polled by *The New Paper* felt the advertisement was disrespectful and in bad taste. MICA eventually stated that the advertisement did not breach the law as it did not fully incorporate the flag's design, with the red and white background being left out. However, director of MICA's National Resilience Division K. U. Menon said: \"MICA does not encourage such ads which treat the national flag with disrespect. [...] Symbols should be treated with some measure of dignity and we hope Loof will withdraw the ad on its own initiative.\" During the [2010 Asian Games](/wiki/2010_Asian_Games) held in China, the Singaporean men's water polo team's swim trunks came under controversy for inappropriately displaying the crescent moon positioned in the centre of the brief, directly over the crotch area. Critics deemed the garment insulting and an embarrassment to the country. The team was unable to modify the design further as competition rules did not permit the changing of a uniform midway through the Games. The team was apologetic over the blunder and promised to tweak the design after the competition. The garment had been designed by the team without prior approval from the authorities. ## Variant flags In addition to the national flag and ensigns, there are other flags used for official purposes. FlagDescriptionThe standard used by the [president of Singapore](/wiki/President_of_Singapore) is a modification of the national flag. The crescent and the stars are bigger and centred on a field of red. According to [the Istana](/wiki/The_Istana), the red background and the crescent and stars have the same symbolism as in the national flag. The standard is flown from the top of the Istana main building whenever the president is within the Istana complex. During state ceremonies at the Istana or other formal presidential occasions, such as investitures and swearing-in events, the presidential standard is placed to the right of the Singapore flag, behind the presidential chair, often flanked by two aide-de-camps. Outside of the Istana setting, the presidential standard plays a key ceremonial role at military parades within Singapore. At the annual [National Day Parade](/wiki/Singapore_National_Day_parade) and [SAF Day Parade](/wiki/SAF_Day_Parade), as part of the presidential salute, the standard is unfurled using a \"quick release knot\" from the top of a flagpole upon the command of 'present arms' (playing of the national anthem) signifying the arrival of the president at the event. The State Marine Ensign was introduced in 1960 and is used on all non-military vessels owned by the government, such as the [Police Coast Guard](/wiki/Police_Coast_Guard). According to the legislation Misc. 6 of 1960: \"The State Marine Ensign shall be a blue ensign with the top left hand quarter of red charged with a crescent sided by five stars in a circle all in white and an eight pointed red and white star in the lower right hand quarter. The ratio of the width to the length of ensign shall be one to two. The colour blue is symbolic of the sea, the crescent and stars are from the State Flag and the eight pointed star represents the mariner's compass.\"The [Red Ensign of Singapore](/wiki/Red_Ensign_of_Singapore) was introduced in 1966 and is used for Singapore-registered civilian ships. According to the legislation Misc. 5 of 1966, its design is of a red flag with a centered vertical crescent and five stars, surrounded by a ring. The ratio of the width to the length of the ensign is one to two. According to the [Maritime and Port Authority of Singapore](/wiki/Maritime_and_Port_Authority_of_Singapore) (MPA), this ensign should be used on Singapore ships instead of the national flag. In a 1999 marine circular, the MPA reminded masters, owners and officers of ships that those who do not use the Red Ensign risk being fined under the Merchant Shipping Act (Cap. 179, 1996 Rev. Ed.).The Singapore Naval Force Ensign was introduced in 1967 and is used on all vessels owned by the [Republic of Singapore Navy](/wiki/Republic_of_Singapore_Navy) (RSN). According to the legislation Misc. 1 of 1967: \"The Singapore Naval Force Ensign shall be a white ensign with the top left hand quarter of red charged with a crescent sided by five stars in a circle all in white and an eight pointed red star with narrow white lines inserted within the star in the lower right hand quarter. The ratio of the width to the length of ensign shall be one by two. The crescent and stars are from the State Flag and the eight pointed star represents the [mariner's compass](/wiki/Compass).\" - [List of Singaporean flags](/wiki/List_of_Singaporean_flags) - [Armorial of Singapore](/wiki/Armorial_of_Singapore) ## Notes ### Articles - [Smith, Whitney](/wiki/Whitney_Smith) (1966). \"A History of the Symbols of Singapore\". *Flag Bulletin*. **5** (2). Winchester, Mass.: Flag Research Center: 60–67. [ISSN](/wiki/ISSN_(identifier)) 0015-3370.. - \"No conflict, clear-cut symbol of unity\". *[The Sunday Times](/wiki/The_Sunday_Times_(Singapore))*. 9 August 1981. p. 13. - Aslaksen, Helmer (11 March 2007). \"The mathematics and astronomy of the Singapore flag\". Department of Mathematics, [National University of Singapore](/wiki/National_University_of_Singapore). Archived from the original on 13 October 2007. Retrieved 3 November 2007. ### Books - [Singapore Legislative Assembly](/wiki/Legislative_Assembly_of_Singapore) (1959). *State Arms and Flag and National Anthem of Singapore (Legislative Assembly (New Series) Misc. 2 of 1959)*. Singapore: Printed at the Government Printing Office. - *State Arms & Flag of Singapore*. Singapore: Publicity Division, [Ministry of Culture](/wiki/Ministry_of_Information,_Communications_and_the_Arts_(Singapore)). 1977. - Crampton, William (1992). *The World of Flags : A Pictorial History* (Rev. ed.). London: Studio Editions. p. 88. - *The National Symbols Kit*. Singapore: Prepared by Programmes Section, [Ministry of Information and the Arts](/wiki/Ministry_of_Information,_Communications_and_the_Arts_(Singapore)). 1999. A kit on the key symbols of Singapore consisting of eight fact sheets, one booklet, one CD and one national flag. ### Other media - [Singapore Broadcasting Corporation](/wiki/Singapore_Broadcasting_Corporation) (1988). *Flag and Anthem, 3 December 1959 [videorecording]*. Singapore: [Television Corporation of Singapore](/wiki/Television_Corporation_of_Singapore). A documentary on the national flag and anthem of Singapore. Gives an account on how the present design of the flag was arrived at, and includes an interview with the national anthem's composer, [Zubir Said](/wiki/Zubir_Said). - Singapore at [Flags of the World](/wiki/Flags_of_the_World_(website)) - The flag of Singapore at the World Flag Database - Colours, Standards & Banners of Colonial Singapore - Military and Paramilitary Flags of Singapore\n",
  "language": "en",
  "processed_at": "2026-01-12T11:04:05.345790",
  "title": "Flag of Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Flag_of_Singapore"
}