{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:04:07.189581"
  },
  "content": "List of floods occurred in SingaporeThis article **provides insufficient context for those unfamiliar with the subject**. Please help improve the article by providing more context for the reader. *(December 2022)* *(Learn how and when to remove this message)* Occasionally, some parts of Singapore are inundated by floods, usually in the form of [flash floods](/wiki/Flash_flood) that came about due to intense rainfall over a short period of time. **Floods in Singapore** are much less severe than floods in other countries, often only lasting a few hours before dissipating on its own. ## 2006 ### Tuesday, 19 December 2006 Continuous heavy rain since Monday, 18 December drenched Singapore, resulting in the third highest rainfall of 366mm recorded on Tuesday. The heaviest rain Singapore recorded was 512.4mm on 2 December 1978, followed by 469mm in December 1969. Severe floods affected areas such as Thomson, Mandai and Olive Road, severely affecting the business in Goodwood Florist as it is a low-lying area. By 11pm, floodwaters have subsided in all flooded areas of Singapore except Olive Road. ## 2010 ### Wednesday, 16 June 2010 Heavy rains caused flooding in Singapore's central shopping district and snarled traffic throughout the island. Shopping Malls along [Orchard Road](/wiki/Orchard_Road) like [Lucky Plaza](/wiki/Lucky_Plaza) and [Liat Towers](/wiki/Liat_Towers) were affected by the flood. The flood had caused some shopping mall and car park basements to be submerged in the water. Rescuers had to pull out about 70 passengers from cars and buses, as flooding shut down Orchard Road, which is lined with high-end shopping malls and tourist attractions. No one was injured. According to the [Public Utilities Board](/wiki/Public_Utilities_Board) (PUB), about 4 inches (100 millimetres) of rain fell in two hours Wednesday morning, equivalent to around 60 percent of the average monthly rainfall for June. Water rose above the tyres of stalled cars on Orchard. On 18 June, the PUB, in a press conference, revealed its findings that the drainage system under Orchard Road, the Stamford Canal, was choked. The [culvert](/wiki/Culvert), which was to drain water into two parallel channels, had one of the channels choked with debris, and water flowed through only one channel. When a second rainstorm on the same morning came, the canal, unable to drain off excess water, overflowed and gushed water up to the surface and caused the flooding. To prevent future floods, PUB spent $25,000 to install five debris-trapping grates at Stamford Canal. These zig-zag grates are meant to catch debris without stopping the flow of water, thus preventing the canal from being choked again. The new grates are installed at Camp Road, [Napier Road](/wiki/Napier_Road,_Singapore) near Minden Road, Nassim Road, Grange Road and Tanglin Road. ### Friday, 25 June 2010 A torrential downpour early Friday morning triggered flash floods across the island. Areas like [Upper Thomson Road](/wiki/Upper_Thomson_Road), [Bugis](/wiki/Bugis) and Jalan [Boon Lay](/wiki/Boon_Lay) were the hardest hit. Heavy rain was also reported in [Changi](/wiki/Changi), [Eunos](/wiki/Eunos,_Singapore), [Jurong East](/wiki/Jurong_East), [Tampines](/wiki/Tampines) and [Sims Avenue](/wiki/Sims_Avenue). The flood also caused morning rush hour traffic to come to a virtual standstill on all major expressways in Singapore. Dissipating within a half-hour, however, this flood was short-lived, as compared to the earlier flooding of Orchard Road. It was reported that the heavy downpour on Friday Morning was equivalent to about 60 percent of the average monthly rainfall for June. ### Thursday, 1 July 2010 Heavy rain caused flooding at [Paya Lebar](/wiki/Paya_Lebar) and other parts of Singapore. The hardest hit areas were [MacPherson](/wiki/MacPherson,_Singapore) Road and Upper [Paya Lebar](/wiki/Paya_Lebar) (known as [Tai Seng](/wiki/Tai_Seng)). The flood caused traffic jams throughout the area of Paya Lebar. ### Saturday, 17 July 2010 A torrential downpour, partially caused by [Typhoon Conson](/wiki/Typhoon_Conson_(2010)), in the early hours of Saturday morning triggered [flash floods](/wiki/Flash_flood) in various parts of Singapore. Among the hardest hit areas were Braddell Road, [Joo Chiat](/wiki/Joo_Chiat) Terrace, [Changi](/wiki/Changi) Road, [Bukit Timah](/wiki/Bukit_Timah) and Delfi in [Orchard Road](/wiki/Orchard_Road). It was the second time in several months where heavy rain had caused inconveniences to motorists and resulted in severe flooding. In some areas of Bukit Timah (especially those with large drains), the waters were about 70 cm high. Most of the floods in low-lying areas managed to recede at around 1 pm. ### Wednesday, 8 September 2010 [Shenton Way](/wiki/Shenton_Way) was hit by a flash flood at 10.30 am which lasted around 15 minutes. [Little India](/wiki/Little_India,_Singapore) was flooded for three hours. A tree, due to the bad weather, was brought down, hitting a van driving along Lorong 23 Geylang. ### Tuesday, 16 November 2010 At about 3.30 pm, [Commonwealth](/wiki/Commonwealth,_Singapore) Ave and [Holland](/wiki/Holland_Village,_Singapore) Drive were hit by flash floods and vehicles had to slow down as the flood partially submerged the tyres of the vehicles. As a result, there was a traffic jam along the junction, but normal flow was restored about 5 minutes later. ## 2011 ### Sunday, 30 January 2011 Continuous heavy rainfall since Sunday drenched most of the island, causing flash floods in at least five areas, mostly in the east. Flash floods were reported on the [Tampines Expressway](/wiki/Tampines_Expressway) slip road at Tampines Avenue 12 and near the Punggol exit, Airport Boulevard, one stretch of Ang Mo Kio Avenue 5 and [Changi Village](/wiki/Changi_Village). Localised chokes in the drainage along Airport Boulevard, Ang Mo Kio Avenue 5 and in Changi Village were blamed for the floods. Lanes along Airport Boulevard and at the junction of Tampines avenues 9 and 12 had to be closed for one to two hours. A partially completed bridge at the [Punggol](/wiki/Punggol) Waterway collapsed under the weight of rainwater on Sunday morning. The eastern area around [Changi](/wiki/Changi) and [Pulau Ubin](/wiki/Pulau_Ubin) received the highest rainfall. As of 31 January 2011, 200.8mm of rain had pelted down on Pulau Ubin, and 178mm in Changi. The rain had subsided by Monday evening. ### Wednesday, 4 May 2011 Heavy rain caused flash floods in several areas including Ang Mo Kio Avenue 1 and Bishan Street 13. About 90mm of rain fell in less than an hour from 3 pm, said the [Public Utilities Board](/wiki/Public_Utilities_Board) (PUB). The floods subsided in about 20 minutes. ### Wednesday, 1 June 2011 Torrential rain caused flooding at the junction of Novena Square, a tree to fall elsewhere and claimed the life of one victim when a boy fell into a swollen [drain](/wiki/Storm_drain) along [Whampoa](/wiki/Whampoa,_Singapore). Despite the drain being guarded by a railing, the boy is believed to have stepped through a break in the [railing](/wiki/Handrail) at the flooded junction of Martaban Road and Minbu Road. He fell into the submerged drain, which is about 1.2m deep. The strong currents swept the boy away, causing him to drown. ### Sunday, 5 June 2011 A torrential downpour that lasted several hours early on Sunday morning triggered flash floods across several parts of the island. Sennett Estate, [Potong Pasir](/wiki/Potong_Pasir), [MacPherson](/wiki/MacPherson,_Singapore), [Toa Payoh](/wiki/Toa_Payoh), [Bukit Timah](/wiki/Bukit_Timah) and [Orchard](/wiki/Orchard_Road) were the areas hardest hit by the floods. Tanglin Mall, Forum Galleria and Traders Hotel were affected by the flood and partially flooded. St Regis Residences had its basement carparks flooded as well. Previous flood affected shopping malls in June 2010, Lucky Plaza and Liat Towers were not affected as flood barriers were activated at the start of the downpour although some shops were still partially affected. Tanglin Mall and St Regis did not receive flood alerts from the PUB which was due to a technical glitch in the flood alert software, which PUB will rectify. PUB also explained the flooding to the buildings are due to a heavy rainfall directly into the basements and the buildings' internal drainage pumps unable to cope with the huge amount of water. After the flood, [Vivian Balakrishnan](/wiki/Vivian_Balakrishnan), [Minister for the Environment and Water Resources](/wiki/Ministry_of_the_Environment_and_Water_Resources), asked for public feedback on possible danger spots during a flood. ### Thursday, 9 June 2011 Torrential rain over western part of Singapore caused flooding at [Jurong East](/wiki/Jurong_East) and [Choa Chu Kang](/wiki/Choa_Chu_Kang). Several flats were affected. ### Friday, 21 October 2011 Heavy rains in the afternoon caused flash floods, affecting several roads, Woodlands Road near the [Kranji Expressway](/wiki/Kranji_Expressway) (KJE) slip road; the Little India area (Norris Road, Kampong Kapor, Owen Road); Ang Mo Kio Ave 5; and the junction of Jalan Pemimpin and Bishan Street 21. The worst affected roads was in the Upper Serangoon area – after PIE exit, next to the Woodsville flyover. The flash floods subsided in 15 minutes except at Upper Serangoon. The flash flood at Upper Serangoon was due to a choke in an unapproved temporary drainage which was constructed. It was constructed by a contractor carrying out road work for the [Land Transport Authority](/wiki/Land_Transport_Authority) at the Woodsville flyover. The pipes were undersized and not properly connected. The pipes was also obstructed with debris, resulting in severe restriction of the flow of rainwater. The contractor will be prosecuted for illegally obstructing and altering the drainage system. ### Thursday, 27 October 2011 Heavy rains in the afternoon caused flash floods, affecting areas like Maxwell Road and [Shenton Way](/wiki/Shenton_Way). It was reported that water level at Shenton Way was about ankle-deep. ### Monday, 31 October 2011 Heavy rains in the afternoon caused flash floods, affecting several roads, slip road at Kallang-Paya Lebar Expressway (KPE) towards Woodlands, Swiss Club Road (near Sixth Ave, Dunearn Road (near College Green) and Stevens Close. The junction of Mandai Road and Woodlands Road was also flooded, causing the area impassable to traffic. All flash flood subsided by 4 pm. Underpass linking the Orchard MRT Station to Tangs was also flooded with 1–2 cm high water. ### Friday, 23 December 2011 Heavy rains in the afternoon caused flash floods, affecting Liat Towers and other areas around Orchard Road, Balestier, Cambridge Road, Monk's Hill, Cuscaden Road, Lincoln Road, United Square, Moulmein Road and the junction of Bukit Timah junction and Sixth Avenue. Within hours of the floods, national water agency, [Public Utilities Board](/wiki/Public_Utilities_Board) (PUB), released a media statement stating, > \"There was *no flooding* at Orchard Road. However, water *ponded* at the open area of Liat Towers, the underpass between Lucky Plaza and Ngee Ann City, and the basement of Lucky Plaza due to the sustained heavy downpour\". PUB subsequently wrote in to newspaper *[Today](/wiki/Today_(Singapore_newspaper))* to assert that they were not understating the situation and using [doublespeak](/wiki/Doublespeak), after a reader's letter pointed out that it was sad that the agency had to \"resort to word usage to dissipate the impact of these floods\" when the event was clearly a \"flooding\" and not \"ponding\". PUB further stated that *Today'*s article had misquoted their media release, where the term \"ponding\" was used to refer to the accumulation of rainwater at the basement areas of buildings. In response, Today's editor clarified that their headline \"No floods in Orchard Rd, just 'ponding': PUB\" was based on PUB's media release. In a later Parliament session, Minister of Environment and Water Resources [Vivian Balakrishnan](/wiki/Vivian_Balakrishnan) said that PUB should not have used the word \"ponding\" to describe water-logged areas. ## 2012 ### Saturday, 21 January 2012 Heavy rains in the afternoon caused flash floods in parts of Singapore. These areas include Hillview Road at Bukit Timah, Swiss Club Road, as well as Jalan Tari Lilin. The water level in some affected areas subsidised shortly after the flash flood. ### Monday, 27 February 2012 Torrential rain in the western part of Singapore caused flash floods at Ulu Pandan and Clementi. The localised flood was due to the intense rain. The flood subsided after 20 minutes. ### Monday, 2 April 2012 A violent pre-dawn thunderstorm known as Sumatra squall rattled Singapore in the early hours, causing flash floods in parts of Singapore. Toh Tuck Road had the heaviest rainfall, with 95.2mm falling by 10 am that day. Three flash floods were reported. At the Marina South underpass, a drain grating was blocked by debris. Tampines Street 81 was the scene of a localised flood due to intense rain, while water at Bishan Street 21 collected in a depression in the road. All three areas remained passable to traffic despite the flash floods. ### Tuesday, 10 April 2012 The eastern and central region of Singapore were hit by flash floods, after an intense downpour in the afternoon. Affected areas included parts of Upper Paya Lebar, Lorong Ah Soo and the junction of Mt Vernon Road/Bartley Road and several areas in Tampines. ### Saturday, 5 May 2012 Flash floods were reported in Bukit Timah early Saturday morning after heavy rain fell over western and northern Singapore from 1.30 am to 3.10 am. The highest rainfall of 68.6mm was recorded at Ngee Ann Polytechnic from 1.40 am to 2.10 am. Affected areas include Bukit Timah Road (between Wilby Road and Blackmore Drive), Dunearn Road (between Jalan Anak Bukit and Sixth Avenue) and Kranji Expressway slip road (towards Woodlands Road). Flood waters reached a depth of up to 25 cm along Bukit Timah Road and Dunearn Road and subsided within 40 minutes. ### Thursday, 27 September 2012 A sudden and heavy thunderstorm in the night caused flash floods in several parts of Singapore for about an hour. Kim Tian Road, Tanjong Pagar Road and Marina South underpass were affected, although waters receded in less than an hour. ### Wednesday, 31 October 2012 and Thursday, 1 November 2012 On Wednesday, flash floods were reported along [Ayer Rajah Expressway](/wiki/Ayer_Rajah_Expressway) after the Alexandra exit at around noon, according to Facebook updates from the national water agency PUB. Other affected areas included Thomson, Dunearn, Cambridge and Tiong Bahru roads. The water subsided within 15 to 20 minutes, and some motorists reported stalled cars at Novena and a traffic jam from there to Marymount. On Thursday, heavy downpour causes flash floods in various parts of Singapore such as Serangoon, Bukit Timah, Toa Payoh and Orchard Road. Rain water subsided quickly. One driver lost control of his car while travelling in heavy rain and crashed into a canal after colliding with another car. Strong currents drifted the car down the canal for more than 50m. ## 2013 ### Friday, 8 February 2013 Heavy rains in the afternoon caused flash floods in Cuscaden area and Ang Mo Kio, which caused the floodwater to fall from the top to the bottom of the staircase in Cuscaden. ### Sunday, 28 April 2013 28 April 2013 flash floods in the east of Singapore saw vehicles getting stuck in the floodwaters. On that afternoon, a tree that got uprooted amid strong wind and rain on Saturday afternoon fell on a car, killing 25-year-old driving instructor Jason Cheong. His 34-year-old student Marliana Sumarno, who was in the driver's seat at the time, miraculously escaped with just minor cuts and abrasions. This happened even though the Honda City car they were in was crushed by the huge tree, which stretched across more than two lanes of the road. ### Thursday, 5 September 2013 Heavy rainfall of 102.8mm between 8.10 am and 9.40 am caused flash floods at [National University of Singapore](/wiki/National_University_of_Singapore), large sections of Ayer Rajah Expressway near Clementi, Commonwealth Avenue, [South Bridge Road](/wiki/South_Bridge_Road), Tomlinson Road and Alexandra area. This led to a complete closure of a section of AYE towards the city. The Commonwealth area was most seriously affected by the flash floods. Shortly after, PUB announced plans to upgrade the Sungei Pandan Kechil and Commonwealth Avenue, the former covering the affected area of AYE. ### Sunday, 20 October 2013 Heavy rain over the eastern and central parts led to flash floods at Paya Lebar Road (under PIE-Paya Lebar flyover), Service Road off Upper Paya Lebar Road (near Lim Teck Boo Road), Arumugam Road and Ubi Ave 2, Eunos Crescent, junction of MacPherson Road and Harvey Road, PIE (towards Changi Airport) slip road at Stevens Rd Exit and Thomson Road near Novena Rise. The flash floods subsided within 30 minutes, except for the flood at Arumugam Road which subsided within one hour. ### Monday, 28 October 2013 Flash floods hit Chai Chee after a heavy downpour in the afternoon, leaving some vehicles stranded. The flood at the junction of New Upper Changi Road and Chai Chee Road made the roads, at one point, impassable to traffic. The waters subsided in half an hour. By 5pm, the road was once more passable for traffic. ### Wednesday, 30 October 2013 Vehicles were left stranded at the junction between Chai Chee Road and New Upper Changi Road after the area was flooded again. Heavy rain also caused flash floods at the same junction on Monday, 28 October. ### Sunday, 3 November 2013 and Monday, 4 November 2013 On Sunday, heavy rain caused flash floods in Chai Chee again in the afternoon, leaving some vehicles stranded. Heavy rain also caused flash floods in the same junction on Wednesday, 30 October and Monday, 28 October. On Monday, flash floods were reported at a number of locations following heavy rain in the afternoon. Affected areas were Dunearn Road (between Yarwood Avenue and Binjai Park), junction of Sunset Drive and Sunset Square, slip road from Clementi Road to Ulu Pandan Road, junction of Clementi Avenue 4 and Commonwealth Avenue West, and Lorong Kismis. The slip road from Clementi Road to Ulu Pandan Road was not passable to traffic for 15 minutes. The heaviest rainfall was recorded at Ngee Ann Polytechnic rain gauge station, at 86.6mm from 3 pm to 4.40 pm. It peaked between 3.30 pm and 4 pm, with a rainfall of 51.8mm. ## 2018 ### Monday, 8 January 2018 On Monday morning, flash floods were reported along Tampines Road, Jalan Nipah, Sims Avenue/Tanjong Katong Road junction, Arumugam Road, the junction of Bedok Road and Upper Changi Road East and Tampines Ave 12 junction. ### Wednesday, 24 January 2018 Heavy rain on Wednesday evening caused flash floods in parts of western and central Singapore. Outram Road was covered in muddy water and barriers from a construction site were spotted floating in the middle lane of the road and obstructing vehicle. Flooding also took place at Jalan Boon Lay and International Road. ### Saturday, 10 November 2018 Flash floods were reported along Choa Chu Kang Way to Choa Chu Kang Avenue 1, Bukit Batok West Avenue 5 (near Esso petrol station and Bukit Batok Driving Centre). PUB claimed that about 100mm of rain was recorded between 4.40pm and 6pm at Bukit Panjang, 40 per cent of the average monthly rainfall in November. ## 2019 ### Monday, 3 June 2019 Heavy rains on Monday afternoon led to flash floods over Commonwealth Lane and Craig Road at approximately 1.24pm, with both lanes affected. Four minutes later, floodwaters subsided along Commonwealth Lane. At 2.06pm, it is also reported that flooding in Craig Road have also receded. ### Monday, 2 December 2019 Heavy rain in the afternoon has led to flash floods over Jurong East and Choa Chu Kang, making traffic impassable at a point of time. ## 2020 ### Thursday, 30 April 2020 Thundery showers over Paya Lebar, Punggol and Hougang caused flash floods in the areas which lasted less than 30 minutes. The flash floods was caused by roadside drains inability to cope with the \"intense rainfall\". The rainfall recorded, 128.4mm, was one of the highest recorded over past 30 years. Sandbags were provided by PUB officers to affected residents. ### Tuesday, 23 June 2020 Heavy rain was reported affecting the vicinity of Changi Fire station, Jurong Town Hall Road, Opera Estate, the intersection of Bedok North Avenue 4 and Upper Changi Road, and New Upper Changi Road. ### Monday, 2 November 2020 Heavy rain fell over Singapore on Monday afternoon, resulting in flash floods in several parts of the island, some lasting as long as 30 minutes. [Shelf clouds](/wiki/Arcus_cloud) were observed during the heavy rain. Some areas which experienced floods were Upper Paya Lebar Road, Lorong Gambir and Mount Vernon Road. The heaviest rain of 131.4mm was recorded in Tai Seng between 2.40pm and 6.10pm according to [PUB](/wiki/Public_Utilities_Board_(Singapore)). ## 2021 ### Friday, 1 January 2021 and Saturday, 2 January 2021 Continuous heavy rain over the first two days of 2021 has led to flash floods in Singapore and Johor Bahru. In Singapore, flash floods occurred in [Bishan](/wiki/Bishan,_Singapore) and [Lorong Halus](/wiki/Lorong_Halus). As of 7pm on 2 January 2021, 210.6mm of rain has fallen over the Changi climate station between 12am and 7pm on Saturday. 318.6mm of rain has fallen over the first two days of January, more than the average of 238.3mm for the month of January. The amount of rain that fell over the two days was also within the top 1 per cent of maximum daily rainfall records in 39 years. ### Tuesday, 23 March 2021 Some roads in western Singapore were impassable after heavy rain led to flash floods. According to PUB, floods were reported in Boon Lay Way and Corporation Road, as well as Enterprise Road in Jurong West. ### Saturday, 17 April 2021 Heavy rain in the afternoon led to flooding along pavements in the west and central, as well as in [Bukit Timah](/wiki/Bukit_Timah). The highest rainfall of 161.4mm recorded over western Singapore accounts for 91 per cent of the average monthly rainfall for April. ### Friday, 20 August 2021 Widespread heavy rain in the early morning on Friday led to flooding at Pasir Ris Drive 12, making traffic impassable for a moment. ### Tuesday, 24 August 2021 Continuous heavy rain on Tuesday morning resulted in severe flooding along the [Bukit Timah](/wiki/Bukit_Timah) area. Tuesday was also the wettest day of 2021, with 247.2mm of rain being recorded at [Mandai](/wiki/Mandai), setting a record for the highest daily total rainfall for August, and far surpassing the previous high of 181.8mm at Changi on 22 August 1983. The intense rainfall was mainly concentrated over the northern and western parts of Singapore, leading to [flash floods](/wiki/Flash_flood) and disruptions in affected areas. According to the [Meteorological Service Singapore](/wiki/Meteorological_Service_Singapore), this unprecedented wet weather was driven by large-scale wind convergence and weather phenomena such as the [Indian Ocean Dipole](/wiki/Indian_Ocean_Dipole). ### Monday, 30 August 2021 Heavy rain in the morning resulted in flash flooding in Hougang Avenue 8 and the Punggol way slip road to the [Tampines Expressway](/wiki/Tampines_Expressway), while several areas in Singapore are at the risk of flash floods. Later in the day, the [national water agency](/wiki/Public_Utilities_Board_(Singapore)) updated that floodwaters have subsided. ## 2022 ### Sunday, 27 February 2022 Prolonged heavy rain over many areas of Singapore on Sunday afternoon has resulted in the occurrence of flash floods in areas such as the junction of Ubi Avenue 3, Eunos Link and the `[Pan Island Expressway](/wiki/Pan_Island_Expressway) (PIE) slip road entrance and exit at Bedok North Avenue 3. The heaviest rainfall of 141.8mm was recorded at Kim Chuan Road rainfall station between 11.35am and 2.55pm. ## 2025 ### Sunday, 20 April 2025 On 20 April 2025, heavy rain in many areas of Singapore on Sunday afternoon resulted in the occurrence of flash floods in 4 areas: Kings Road, [Bukit Timah Road](/wiki/Bukit_Timah_Road), Coronation Walk and the junction of Stevens Road and Balmoral Road between 5 pm and 6 pm. The heaviest rainfall of 113.2mm was recorded in [central Singapore](/wiki/Central_Area,_Singapore) from 4.15 pm to 6.25 pm. ### Thursday, 4 December 2025 On 4 December 2025, heavy rain in many areas of Singapore on Thursday afternoon resulted in the occurrence of flash flood in 8 areas: Pandan Road, Boon Lay Avenue (between Jalan Boon Lay and Boon Lay Drive), Junction of Boon Lay Way and Corporation Road and Pesawat Drive between 2.40pm and 3.45pm. - [1978 Singapore flood](/wiki/1978_Singapore_flood) - [2006–07 Southeast Asian floods](/wiki/2006%E2%80%9307_Southeast_Asian_floods) *This article incorporates text available under the CC BY 2.5 license.*\n",
  "language": "en",
  "processed_at": "2026-01-12T11:04:07.189112",
  "title": "Floods in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Floods_in_Singapore"
}