{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:04:15.061673"
  },
  "content": "The **Food Bank Singapore Ltd.** was founded in 2012, and is a registered [charity](/wiki/Charitable_organization) and Institution of a Public Character (IPC) in [Singapore](/wiki/Singapore). It operates as a [foodbank](/wiki/Foodbank) that collects excess food from food suppliers and re-distributes them to organisations such as old folks' homes, [family service centres](/wiki/Family_centre) and [soup kitchens](/wiki/Soup_kitchen). Food Bank Singapore is a member of the Global Foodbanking Network. As of 2019, it also distributes food through Food Pantry 2.0, vending machines at various locations which are accessible 24/7 to those with a special food credit card. ## History In Singapore, the [National Environment Agency](/wiki/National_Environment_Agency) publishes annual statistics of food waste. In 2014, 788,600 tonnes of food is wasted annually in Singapore, and the recycling rate is only 13% (whereas the overall recycling rate is 60%). ## Services The Food Bank Singapore provides various types of food donations to beneficiaries by collecting excess non-perishables from food industry donors, food drives, and bank boxes located island-wide. They collect perishable food like fruits and vegetables from Pasir Panjang Wholesale Centre, cakes and pastries from F&B establishments, and cooked food from hotels through their Food Rescue Project. - Singapore portal - Food portal - [Feeding America](/wiki/Feeding_America) - [Food waste](/wiki/Food_waste) - [List of food banks](/wiki/List_of_food_banks) - [List of voluntary welfare organisations in Singapore](/wiki/List_of_voluntary_welfare_organisations_in_Singapore) - [List of food labeling regulations](/wiki/List_of_food_labeling_regulations) - Official website This [Singaporean corporation or company](/wiki/List_of_companies_of_Singapore) article is a stub. You can help Wikipedia by expanding it.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:04:15.061198",
  "title": "Food Bank Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Food_Bank_Singapore"
}