{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:04:23.141030"
  },
  "content": "* *Foreign territories in Singapore** are the plots of land owned by other countries in the Republic of [Singapore](/wiki/Singapore). While such plots of land may be owned by foreign countries, they still fall under Singapore's sovereignty and are subjected to Singapore's laws and jurisdiction. The foreign territories in Singapore do not include [diplomatic missions](/wiki/Diplomatic_mission), like embassies and high commissions operated by other countries in the republic, because contrary to popular belief, diplomatic missions do not exercise full sovereign rights of the respective countries but only enjoy certain immunity of local laws. Several other Singapore rules and laws still apply in these areas, and Singapore reserves full rights to suspend or expel diplomatic missions in the country without compensation. ## Land owned by the Johor Royal Family There are currently two plots of land privately owned by the [Sultan of Johor](/wiki/Sultan_of_Johor) under Singapore law, due to historical circumstances that pre-date Singapore's independence. ### Masjid Temenggong Daeng Ibrahim [Masjid Temenggong Daeng Ibrahim](/wiki/Masjid_Temenggong_Daeng_Ibrahim) sits on an approximately 1.2 ha (2.9 acre) piece of land in [Telok Blangah](/wiki/Telok_Blangah) where there was formerly a palace, [Istana Lama](/wiki/Istana_Lama), for [Temenggong Abdul Rahman](/wiki/Temenggong_Abdul_Rahman), the [Temenggong of Johor](/wiki/Temenggong_of_Johor). The property was first awarded to the Temenggong in 1823 by the British when the Temenggong and his followers were relocated from [Kampong Glam](/wiki/Kampong_Glam). The Temenggong died at the palace in 1825. The audience hall was built nearby at an unknown year. It was later converted to a mosque, although the adjacent plot of land remains a Muslim cemetery that continues to hold the royal tomb of Temenggong Abdul Rahman and [Temenggong Daeng Ibrahim](/wiki/Temenggong_Daeng_Ibrahim). The land was then passed down to [Temenggong Abu Bakar](/wiki/Temenggong_Abu_Bakar), who later moved his residence to [Tyersall](/wiki/Tyersall_Park); the palace was demolished soon afterwards. The land parcel continues to be held by the Sultan of Johor, and there are no plans by the Singapore authorities to acquire the land, despite its close proximity to the [Central Business District](/wiki/Downtown_Core) and also the former KTM [Tanjong Pagar railway station](/wiki/Tanjong_Pagar_railway_station). It is one of two mosques in Singapore not governed under [Majlis Ugama Islam Singapura](/wiki/Majlis_Ugama_Islam_Singapura), the central governing body of Islamic affairs in Singapore. ### Istana Tyersall and Istana Woodneuk A 24.4 ha (60 acres) piece of land beside the [Singapore Botanic Gardens](/wiki/Singapore_Botanic_Gardens) was formerly the site of both Istanas for the Sultan of Johor and his wives. It was acquired by Sultan Abu Bakar in 1857 from prominent newspaper editor and lawyer [William Napier](/wiki/William_Napier_(lawyer)) and has been passed down for generations since then. It still remains a property of the Sultan of Johor. [Istana Tyersall](/wiki/Istana_Tyersall) has since been demolished, while [Istana Woodneuk](/wiki/Istana_Woodneuk) still stands in a dilapidated condition, due to lack of maintenance. The Istana and the surrounding compounds have been cordoned off in view of safety, and access is restricted. The Singapore Government announced in June 2025 that it would be undertaking a land swap with the landowner of the Tyersall land, who has plans to develop his post-swap land subsequently. ## Joint operation ventures There are multiple pieces of land in Singapore that are currently under the joint management of both Singapore and another country. Many of these have arisen due to land swap deals between Singapore and Malaysia in the past, most notably during the [Keretapi Tanah Melayu](/wiki/Keretapi_Tanah_Melayu) (KTM) railway land swap deal in 2010. However, there are several that are joint ventures between Singapore and Malaysia as a result of bilateral cooperation between the two countries in developing enhanced border crossing facilities. ### Linggiu Reservoir Several land plots adjacent to the [Johor River](/wiki/Johor_River) and Linggiu Reservoir are under joint operation control between Singapore and Malaysia. This arrangement first existed because of agreements made in 1927 for the provision of free water to Singapore to meet the needs of water shortage in the then Straits Settlement. Then in 1961 and 1962 two agreements on the supply of water to Singapore which was still under British control were made to ensure [water security](/wiki/Water_security), as Malaysia had by then gained independence from the United Kingdom. In 1965, the agreements were guaranteed by the Malaysian government in the [Separation Agreement](/wiki/Independence_of_Singapore_Agreement_1965) that saw Singapore gain independence. Another agreement was made in 1990, that saw Singapore lease land in the area to build and operate a dam across the Johor River to build the Linggiu Reservoir so as to increase the water supply to both Johor and Singapore. Singapore in this agreement agreed to foot the cost of building and maintenance of the dam and its accompanying infrastructure as well as pay for the cost of acquiring land (RM 320 million) to build the dam. Currently Singapore still has two agreements left standing and is able to draw up to 250 million gallon of water from the river daily which amounts to 40 percent of its total national water consumption needs. The water is drawn at RM 0.03 per thousand gallon and some of the water which is treated in Singapore is channelled back to Johor at a price of RM 0.50 per thousand gallon, which is actually below the cost price of RM 2.40 per thousand gallon to treat water. Both agreements are expected to end at 2061. This arrangement wasn't without problems or controversy. There were several times before the turn of the 21st century that Malaysia had threatened to [cut water supply](/wiki/Water_conflicts_between_Malaysia_and_Singapore) to Singapore from the river. In the early 2000s, the problem exacerbated with Malaysia frequently requesting to raise water prices and it was finally decided in 2011 to not renew the existing water agreement with Malaysia when the contract expired. Singapore had also by then been able to raise its own supply water to an adequate amount via other sources and thus there was no pressing need to renew that contract. In recent decades, the Linggiu Reservoir had also run severely low on water supply, although water supply to Singapore had not been affected. ### Sino-Singapore Joint Ventures The Sino-Singapore Jilin Food Zone (SSJFZ) is an industrial food zone in the northern Chinese [city of Jilin](/wiki/Jilin_City) that is aimed at allowing Singapore to have a [sustainable food](/wiki/Sustainable_food_systems) producing source that meets [Agri-Food and Veterinary Authority of Singapore](/wiki/Agri-Food_and_Veterinary_Authority_of_Singapore) (AVA) food safety standards. It is also aiming to become a food producer role model for other Chinese cities in terms of efficiency and method of production as well as health and food safety standards, with a specific mention also to become a Foot and Mouth Disease Free Zone. The SSJFZ is a joint venture between Singbridge and Jilin city government, where Singbridge is part of the Ascendas-Singbridge group, which is majority-owned by [Temasek Holdings](/wiki/Temasek_Holdings). The SSJFZ was launched in 2012 and is expected to span 1,450 square kilometres. The [Sino-Singapore Tianjin Eco-city](/wiki/Sino-Singapore_Tianjin_Eco-city) is a joint developed city by the governments of Singapore and [China](/wiki/China) which aims to be a role model city in eco-friendly and sustainable living for other Chinese cities. An agreement was signed in 2007 between Singapore Prime Minister [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) and then Chinese Premier [Wen Jiabao](/wiki/Wen_Jiabao) to jointly develop the city. The city sits on 30 square kilometres of non-arable and water-scarce land, and several aspects of the city model after Singapore's way of living including the usage of mixed ethnicity high rise housing neighbourhoods. In 2011, Singapore furthered its commitment to the project by forming a ministerial committee to enhance the coordination and support among Singapore government agencies involved in the project. The [Suzhou Industrial Park](/wiki/Suzhou_Industrial_Park) is another joint developed project by the governments of Singapore and China too. It is an industrial park that aims to allow interaction between China and Singapore businesses, so as to allow Chinese businesses to learn business and administrative practices. An agreement was signed in 1994 between Senior Minister [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) and then Chinese vice-premier [Li Lanqing](/wiki/Li_Lanqing) on the joint development of a special economic zone in Suzhou to better attract foreign investors. The industrial park currently sits on 80 square kilometres of land. Singapore only has a 35 percent stake in the project due to the project being unviable in its early years, which caused Singapore to scale back in its involvement of the project. ### India-Singapore Joint Ventures [Amaravati](/wiki/Amaravati) is the capital city of the Indian state of [Andhra Pradesh](/wiki/Andhra_Pradesh). It was formed after its former capital [Hyderabad](/wiki/Hyderabad) became the capital of the newly formed state of [Telangana](/wiki/Telangana). The Singapore government was involved in government level cooperation with the [Andhra Pradesh Capital Region Development Authority](/wiki/Andhra_Pradesh_Capital_Region_Development_Authority) (APCRDA) to develop the 7,235 square kilometres capital from scratch. Ascendas-Singbridge and [Sembcorp](/wiki/Sembcorp_Marine) Development had been appointed to master develop the core commercial area of Amaravati in partnership with APCRDA. Singapore companies are also expected to take on the roles of construction of utilities and to train the city officials. The Andhra Pradesh government will foot the entire city building bill that is expected to run up to $16.5 billion. There are several joint ventures in [India](/wiki/India) by Singapore's Ascendas-Singbridge group, like the [International Tech Park, Bangalore](/wiki/International_Tech_Park,_Bangalore) and [International Tech Park, Chennai](/wiki/International_Tech_Park,_Chennai). However unlike the joint ventures in China or Amaravati most of these joint ventures do not involve not government to government level cooperation but rather they are company level cooperation between the two countries. Thus land acquired by these companies are generally regarded as private land acquisition that the Singapore government have limited influence on. ### Military training area Singapore has partial jurisdiction over several military training area overseas, the terms of the [Status of forces agreement](/wiki/Status_of_forces_agreement) and [Visiting Forces Agreement](/wiki/Visiting_Forces_Agreement) differ between the countries, but the general outline of which allows Singapore troops freedom of movement within the designated training area, as well as jurisdiction to carry out criminal proceedings in the event that the offences are not punishable by the local laws of the area. These military training areas are in countries that include: - Afghanistan (under [NATO](/wiki/NATO) led [International Security Assistance Force](/wiki/International_Security_Assistance_Force)) - Australia - Brunei - France - Germany - India - New Zealand - South Africa - Taiwan - Thailand - United States of America ### KTM Railway land swap The iconic [DUO](/wiki/DUO) and [Marina One](/wiki/Marina_One) buildings were built by M+S Pte Ltd, in which Malaysia's [Khazanah Nasional](/wiki/Khazanah_Nasional) has a 60 per cent stake, and Singapore's [Temasek Holdings](/wiki/Temasek_Holdings), a 40 per cent one. Malaysia was not required as ruled by the [Permanent Court of Arbitration](/wiki/Permanent_Court_of_Arbitration) at The Hague to pay land developmental charges amounting to $1.4 billion for land parcels, even though Singapore initially insisted. Malaysia was not required to pay because these lands were at the newer sites, but the older site became a Rail Corridor and a main cycling route instead of overhead railway tracks and multiple fencing. ### Changi Ferry Terminal The Changi Ferry Terminal is the only ferry terminal in Singapore under the management of the Johor Port Authority (JPA) instead of the [Maritime and Port Authority of Singapore](/wiki/Maritime_and_Port_Authority_of_Singapore). It was opened in 1993 and was leased to JPA for operations, as agreed prior to its opening. The ferry terminal was intended to boost border crossing capabilities between the two countries, although it currently only serves one destination in Tanjung Belungkor, Johor, which is near [Desaru](/wiki/Desaru). There currently have been no requests made by the Johor authorities to raise the frequency of service or increase the number of ports served by the ferry terminal. ### Cross-border MRT The [Johor Bahru–Singapore Rapid Transit System](/wiki/Johor_Bahru%E2%80%93Singapore_Rapid_Transit_System) between Singapore and Malaysia is a joint venture between the two countries and each country maintains the segment of the railway that runs in their country. The MRT is expected to run between Bukit Chagar in Malaysia and Woodlands North in Singapore, where passengers can transfer to the [Thomson–East Coast MRT line](/wiki/Thomson%E2%80%93East_Coast_Line) to head to the city. Currently the MRT is slated to be operated by both [SMRT Trains](/wiki/SMRT_Trains) (Singapore) and [Prasarana Malaysia](/wiki/Prasarana_Malaysia), with these companies setting the fares as well. It was agreed due to costs factor that the maintenance of the MRT would be primarily done in Singapore and the trains themselves would be similar to the ones used by the Thomson–East Coast Line. Immigration and customs would also be co-located in the country of departure to enhance the flow of passengers. The joint tender for construction for the project has yet to be awarded by both countries.[*needs update*] ### High-speed railway The [Kuala Lumpur–Singapore high-speed rail](/wiki/Kuala_Lumpur%E2%80%93Singapore_high-speed_rail) (HSR) between Singapore and Malaysia is another joint venture between the two countries and each country maintains the segment of the railway that runs in their country. The HSR is expected to run from [Kuala Lumpur](/wiki/Kuala_Lumpur) in Malaysia to [Jurong East](/wiki/Jurong_East) in Singapore, with a few stations in between. There are expected to be three train services, of which two, the cross border shuttle service and the Kuala Lumpur-Singapore service, are expected to run into Singapore. The operators for the HSR would be SG HSR (Singapore) and MyHSR (Malaysia). Immigration and customs would also be co-located in the country of departure to enhance the flow of passengers. The joint tender for construction of the project has yet to be awarded by both countries, and the splitting of the cost of operation and profit shared between them have also yet to be decided. ## Historical foreign territories ### Bidadari [Bidadari](/wiki/Bidadari,_Singapore) was once used by the Sultan Abu Bakar of Johor as its [Istana Bidadari](/wiki/Istana_Bidadari). However, it was reacquired by the British to be used as a cemetery in late 1903. Since Singapore's independence it has been under Singapore's jurisdiction. There have been no claims made by Malaysia over this area. ### Malaysia KTM Land The [Malaysia KTM](/wiki/Keretapi_Tanah_Melayu) railway once cut through 20 to 30 km of Singaporean land from Woodlands to Tanjong Pagar. This approximately 434.26 acres (175.74 ha) piece of land on which the railway sits on was awarded by the British under the Singapore Railway Transfer Ordinance 1918 to the then [Federated Malay States Railways](/wiki/Federated_Malay_States_Railways) in 1918. 352.52 acres (142.66 ha) of the land were held by the Federal Land Commissioner of Malaysia on a 999 year lease, with a covenant that restricts its use solely for the railway; while the rest of the 81.74 acres (33.08 ha) of land was leased in perpetuity to Malaysia's Federal Land Commissioner.[note 1] Contrary to popular belief, KTM lands inside Singapore are not Malaysia's sovereign territories, as Malaysia's deputy foreign minister [Richard Riot Jaem](/wiki/Richard_Riot_Jaem) once clarified that \"the land is not ours\". He said that should the land be no longer used for railway purposes, the land will be reverted to the government of the [Straits Settlement](/wiki/Straits_Settlements), now the government of Singapore, under the 1918 Ordinance without compensation (if the land was acquired without cost in 1918). In 1990, Singapore Prime Minister [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) and Finance Minister of Malaysia Tun [Daim Zanuddin](/wiki/Daim_Zanuddin) agreed in the [Malaysia–Singapore Points of Agreement of 1990](/wiki/Malaysia%E2%80%93Singapore_Points_of_Agreement_of_1990) to do away with the covenant and to settle the matter, because Singapore has more developments in the vicinity. However the implementation of the point of agreement reached had been slow and plagued with inconsistencies for 20 years before 2010. In 2010, Singapore Prime Minister [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) and his Malaysian counterpart [Najib Razak](/wiki/Najib_Razak) finally agreed upon and finalised the interpretation of the 1990 agreement, paving the way for the eventual land swap deal that saw KTM railway operations shortened to Woodlands Train Checkpoint, with some sections being distributed to [Downtown MRT line](/wiki/Downtown_Line), as well as service 61, 170 and the [Ayer Rajah Expressway](/wiki/Ayer_Rajah_Expressway). Today the KTM railway up to the Singapore-Malaysia border belongs to Singapore as accorded in the 2010 deal between both countries. The station and facilities in Woodlands Train Checkpoint also belongs to Singapore, although KTM continues to be able to station its Malaysian staff at the railway premises. Immigration and customs control are also co-located at the [Woodlands Train Checkpoint](/wiki/Woodlands_Train_Checkpoint), thus ending years of peculiar immigration clearance by train passengers. ### UK military training area There are several plots of land that the British continued to have partial jurisdiction over after the merger of Singapore with Malaysia in 1963 and then subsequently the independence of Singapore in 1965. These plots of land were primarily used for military training and to house the servicemen and their families. These were [Sembawang Naval Base](/wiki/Singapore_Naval_Base), RAF bases located in [Changi](/wiki/Changi_Air_Base), [Seletar](/wiki/Seletar_Airport) and [Tengah](/wiki/Tengah_Air_Base), and command buildings in [Pasir Panjang](/wiki/Pasir_Panjang) and [Tanglin](/wiki/Tanglin). After the British withdrew in 1971, due to the [East of Suez](/wiki/East_of_Suez) policy, most of these land plots were returned to Singapore, although several were handed over to the ANZUK troops left in its wake, due to the [Five Power Defence Arrangements](/wiki/Five_Power_Defence_Arrangements) of 1971. The exact nature of British jurisdiction was not exactly known due to the conflict in the [status of forces agreement](/wiki/Status_of_forces_agreement) section within the 1957 [Anglo-Malayan Defence Agreement](/wiki/Anglo-Malayan_Defence_Agreement), which indicated that the United Kingdom had complete control over the area and its usage, as long as it was to be deemed necessary militarily, and Malaysian Prime Minister subsequent comments on the matter: > \"... subject to the proviso that the Government of Malaysia will afford to the Government of the United Kingdom the right to continue to maintain the bases and other facilities at present occupied by their service authorities within the State of Singapore and will permit the United Kingdom to make such use of these bases and facilities as the United Kingdom may consider necessary for the purpose of assisting in the defence of Malaysia, and for Commonwealth defence and for the preservation of peace in Southeast Asia.\" > **1957 Anglo-Malayan Defence Agreement** > \"... although Singapore could not be regarded as a SEATO (South East Asia Treaty Organisation) base, it could be used for SEATO purposes if Britain considered this necessary for the maintenance of security in South-East Asa. In every case, however, the future Malaysian Government would be consulted about the use of the base.\" > **Prime Minister Tunku Abdul Rahman** ### ANZUK military training area There are several plots of land that the [ANZUK](/wiki/ANZUK) nations have partial jurisdiction over in the wake of the 1971 British troops withdrawal from Singapore and the Five Power Defence Arrangements. These plots of land were similarly used for military training and to house the servicemen and their families. They were handed over in phases to the government of Singapore when the troops started to completely withdraw from the region, with the Australians starting to pull out first, then the British and finally the [New Zealand Force South East Asia](/wiki/New_Zealand_Force_South_East_Asia) withdrew in 1989. This resulted in bases in Changi, Seletar, Tengah, [Nee Soon](/wiki/Yishun) Garrison, [Dieppe Barracks](/wiki/Dieppe_Barracks) and finally Sembawang Naval Base being handed over chronologically to Singapore. Several of the aforementioned military bases continue to be used by the five nations in the Five Power Defence Arrangements, although jurisdiction over the area now solely belongs to Singapore. ### Malaysia military training area There are several plots of land that Malaysia continued to have partial jurisdiction over after the independence of Singapore. These plots of land were similarly used for military training and to house the servicemen. The 4th Federal Brigade of the [Malaysian Army](/wiki/Malaysian_Army) were first stationed at [Fort Canning](/wiki/Fort_Canning) in August 1963, before moving to Khatib Camp in 1964 or March 1966, and finally withdrawn from Singapore in November 1967, with all Malaysian Army units left the island nation by the end of that year. Meanwhile, the Royal Malaysian Navy occupied Khatib Camp in 1970 and it served as the navy's training centre until 1980, before the camp was formally handed over to Singapore in February 1982. Some of the Malaysian Navy's facilities from Khatib Camp was moved back to Malaysia, while the rest were relocated to the [Woodlands Naval Base](/wiki/Woodlands_Naval_Base), which is the last Malaysian naval base in Singapore and also the Malaysian Navy's headquarters until the late 1980s. All remaining navy units were completely pulled out from Woodlands by October 1997, and the naval base was officially closed down on 31 December 1997. ## Note - [Foreign territories of Singapore](/wiki/Foreign_territories_of_Singapore) - [List of diplomatic missions in Singapore](/wiki/List_of_diplomatic_missions_in_Singapore) - [Foreign relations of Singapore](/wiki/Foreign_relations_of_Singapore) - [Indonesia–Singapore border](/wiki/Indonesia%E2%80%93Singapore_border) - [Malaysia–Singapore border](/wiki/Malaysia%E2%80%93Singapore_border)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:04:23.140381",
  "title": "Foreign territories in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Foreign_territories_in_Singapore"
}