{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:04:25.127909"
  },
  "content": "* *Foreign territories of Singapore** are the plots of land owned by the [Republic of Singapore](/wiki/Singapore) that are geographically distant from the boundaries of the country or are located in other countries. The foreign territories of Singapore do not include [diplomatic missions](/wiki/Diplomatic_mission), like embassies and high commissions operated by Singapore in other countries, because contrary to popular belief, diplomatic missions do not exercise full sovereign rights of Singapore but only enjoy certain immunity of local laws. ## Foreign territories ### Pulau Pisang Lighthouse The land in which [Pulau Pisang Lighthouse](/wiki/Pulau_Pisang_Lighthouse) sits on is owned by Singapore, more explicitly by the [Maritime and Port Authority of Singapore](/wiki/Maritime_and_Port_Authority_of_Singapore) for Singapore. This piece of land is in the possession of Singapore due to an 1885 agreement and 1900 indenture that allows the Straits Settlement Government to lease a plot of land (0.809 ha) and the roadway leading to it from the Johor Government for the sole purpose of building a lighthouse on [Pulau Pisang](/wiki/Banana_Island_(Johor)) in perpetuity. The land would be returned to Malaysia if the lighthouse were to no longer be operated, as the ultimate sovereignty of the land belongs to them. The surrounding territory is under Malaysia's jurisdiction. Despite the lighthouse and the roadway being under the jurisdiction of Singapore, access to the location is controlled by the Johor Government that stipulates that workers entering or exiting the territory register with the Immigration Department in [Kukup](/wiki/Kukup), [Johor](/wiki/Johor). Despite the arrangement, the plot of land on which the lighthouse sits on is rarely considered to be an [exclave](/wiki/Enclave_and_exclave) of Singapore. There have been calls for the Johor Government to assume control of the lighthouse, especially after the ruling by the [International Court of Justice](/wiki/International_Court_of_Justice) at The Hague which awarded Pedra Branca to Singapore in 2008. The interpretation of the 1900 indenture is highly similar to the agreement made by the British to the [Federated Malay States Railways](/wiki/Federated_Malay_States_Railways) in 1918 for a 999-year land lease to operate the current [Malaysia KTM](/wiki/Keretapi_Tanah_Melayu) in Singapore, with specifically a covenant that restricts its use solely for the railway, otherwise following the end of its use the Singapore government would assume control of this land. But despite the agreement, six plots of prime land in Singapore were eventually given to Malaysia for joint operation venture in exchange for the land in which the railway sits on. ## Joint Operation Ventures ### Linggiu Reservoir Several land plots adjacent to the [Johor River](/wiki/Johor_River) and Linggiu Reservoir are under joint operation control between Singapore and Malaysia. This arrangement first existed because of agreements made in 1927 for the provision of free water to Singapore to meet the needs of water shortage in the then Straits Settlement. Then in 1961 and 1962 two agreements on the supply of water to Singapore which was still under British control were made to ensure [water security](/wiki/Water_security), as Malaysia had by then gained independence from the United Kingdom. In 1965, the agreements were guaranteed by the Malaysian government in the [Separation Agreement](/wiki/Independence_of_Singapore_Agreement_1965) that saw Singapore gain independence. Another agreement was made in 1990, that saw Singapore lease land in the area to build and operate a dam across the Johor River to build the Linggiu Reservoir so as to increase the water supply to both Johor and Singapore. Singapore in this agreement agreed to foot the cost of building and maintenance of the dam and its accompanying infrastructure as well as pay for the cost of acquiring land (RM 320 million) to build the dam. Currently Singapore still has two agreements left standing and is able to draw up to 250 million gallon of water from the river daily which amounts to 40 percent of its total national water consumption needs. The water is drawn at RM 0.03 per thousand gallon and some of the water which is treated in Singapore is channelled back to Johor at a price of RM 0.50 per thousand gallon, which is actually below the cost price of RM 2.40 per thousand gallon to treat water. Both agreements are expected to end at 2061. This arrangement wasn't without problems or controversy. There were several times before the turn of the 21st century that Malaysia had threatened to [cut water supply](/wiki/Water_conflicts_between_Malaysia_and_Singapore) to Singapore from the river. In the early 2000s, the problem exacerbated with Malaysia frequently requesting to raise water prices and it was finally decided in 2011 to not renew the existing water agreement with Malaysia when the contract expired. Singapore had also by then been able to raise its own supply water to an adequate amount via other sources and thus there was no pressing need to renew that contract. In recent decades, the Linggiu Reservoir had also run severely low on water supply, although water supply to Singapore had not been affected. ### Sino-Singapore Joint Ventures The Sino-Singapore Jilin Food Zone (SSJFZ) is an industrial food zone in the northern Chinese [city of Jilin](/wiki/Jilin_City) that is aimed at allowing Singapore to have a [sustainable food](/wiki/Sustainable_food_systems) producing source that meets [Agri-Food and Veterinary Authority of Singapore](/wiki/Agri-Food_and_Veterinary_Authority_of_Singapore) (AVA) food safety standards. It is also aiming to become a food producer role model for other Chinese cities in terms of efficiency and method of production as well as health and food safety standards, with a specific mention also to become a Foot and Mouth Disease Free Zone. The SSJFZ is a joint venture between Singbridge and Jilin city government, where Singbridge is part of the Ascendas-Singbridge group, which is majority-owned by [Temasek Holdings](/wiki/Temasek_Holdings). The SSJFZ was launched in 2012 and is expected to span 1,450 square kilometres. The [Sino-Singapore Tianjin Eco-city](/wiki/Sino-Singapore_Tianjin_Eco-city) is a joint developed city by the governments of Singapore and [China](/wiki/China) which aims to be a role model city in eco-friendly and sustainable living for other Chinese cities. An agreement was signed in 2007 between Singapore Prime Minister [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) and then Chinese Premier [Wen Jiabao](/wiki/Wen_Jiabao) to jointly develop the city. The city sits on 30 square kilometres of non-arable and water-scarce land, and several aspects of the city model after Singapore's way of living including the usage of mixed ethnicity high rise housing neighbourhoods. In 2011, Singapore furthered its commitment to the project by forming a ministerial committee to enhance the coordination and support among Singapore government agencies involved in the project. The [Suzhou Industrial Park](/wiki/Suzhou_Industrial_Park) is another joint developed project by the governments of Singapore and China too. It is an industrial park that aims to allow interaction between China and Singapore businesses, so as to allow Chinese businesses to learn business and administrative practices. An agreement was signed in 1994 between Senior Minister [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) and then Chinese vice-premier [Li Lanqing](/wiki/Li_Lanqing) on the joint development of a special economic zone in Suzhou to better attract foreign investors. The industrial park currently sits on 80 square kilometres of land. Singapore only has a 35 percent stake in the project due to the project being unviable in its early years, which caused Singapore to scale back in its involvement of the project. ### India-Singapore Joint Ventures [Amaravati](/wiki/Amaravati) is the capital city of the Indian state of [Andhra Pradesh](/wiki/Andhra_Pradesh). It was formed after its former capital [Hyderabad](/wiki/Hyderabad) became the capital of the newly formed state of [Telangana](/wiki/Telangana). The Singapore government was involved in government level cooperation with the [Andhra Pradesh Capital Region Development Authority](/wiki/Andhra_Pradesh_Capital_Region_Development_Authority) (APCRDA) to develop the 7,235 square kilometres capital from scratch. Ascendas-Singbridge and [Sembcorp](/wiki/Sembcorp_Marine) Development had been appointed to master develop the core commercial area of Amaravati in partnership with APCRDA. Singapore companies are also expected to take on the roles of construction of utilities and to train the city officials. The Andhra Pradesh government will foot the entire city building bill that is expected to run up to $16.5 billion. There are several joint ventures in [India](/wiki/India) by Singapore's Ascendas-Singbridge group, like the [International Tech Park, Bangalore](/wiki/International_Tech_Park,_Bangalore) and [International Tech Park, Chennai](/wiki/International_Tech_Park,_Chennai). However unlike the joint ventures in China or Amaravati most of these joint ventures do not involve not government to government level cooperation but rather they are company level cooperation between the two countries. Thus land acquired by these companies are generally regarded as private land acquisition that the Singapore government have limited influence on. ### Military training area Singapore has partial jurisdiction over several military training area overseas, the terms of the [Status of forces agreement](/wiki/Status_of_forces_agreement) and [Visiting Forces Agreement](/wiki/Visiting_Forces_Agreement) differ between the countries, but the general outline of which allows Singapore troops freedom of movement within the designated training area, as well as jurisdiction to carry out criminal proceedings in the event that the offences are not punishable by the local laws of the area. These military training areas are in countries that include: - Afghanistan (under [NATO](/wiki/NATO) led [International Security Assistance Force](/wiki/International_Security_Assistance_Force)) - Australia - Brunei - France - Germany - India - New Zealand - South Africa - Taiwan - Thailand - United States of America ## Flight information region [Flight information region](/wiki/Flight_information_region) (FIR) is the area of [airspace](/wiki/Airspace) that a particular country's civil air traffic control centre controls as assigned by the [International Civil Aviation Organization](/wiki/International_Civil_Aviation_Organization). Its main purpose is to give [flight information service](/wiki/Flight_information_service) to civil aeroplanes flying through the area so as to ensure flight safety. Singapore's FIR cover approximately over the [Riau Archipelago](/wiki/Riau_Archipelago) and parts of the [South China Sea](/wiki/South_China_Sea). The FIR controlled by Singapore's air control centre is not equivalent to the territorial airspace that the country has sovereignty over, thus there are certain parts of the FIR that lie in Brunei, Indonesia and Malaysia territorial airspace. Indonesia has requested for control of the FIR over its territorial airspace but Singapore rejected the request on the basis that the current arrangement was made with aviation safety as its key consideration, and additionally any changes would severely impact Singapore's position as an aviation hub. ## Historical foreign territories ### Christmas Island On 1 October 1958, the sovereignty of [Christmas Island](/wiki/Christmas_Island) was transferred from the [Crown Colony of Singapore](/wiki/Crown_Colony_of_Singapore) to the Commonwealth of [Australia](/wiki/Australia). During negotiations with Australia for the island, Singapore had expressed interests over the island due to its phosphate reserves and a possible loss of potential income. A March 1957 offer of compensation amounting to £2.33 million (RM 20 million) was below what Singapore had been receiving, which was RM 1.5 million annually, and with another 32 years remaining on the lease, the potential earnings could amount to at least RM 48 million. Then Chief Minister of Singapore, [Lim Yew Hock](/wiki/Lim_Yew_Hock) also raised concerns with regards to the citizenship and employment of the islanders. However the British still eventually transferred the island over to Australia after addressing certain of the issues. In 1974, after Singapore had gained independence, there were rumours that Australia was intending to transfer sovereignty of the islands to Singapore, however Australia denied there was such a plan on grounds of the security of the [Indian Ocean](/wiki/Indian_Ocean). ### Cocos (Keeling) Islands On 23 November 1955, the administrative responsibility of the [Cocos (Keeling) Islands](/wiki/Cocos_(Keeling)_Islands) was transferred from the Crown Colony of Singapore to the Commonwealth of Australia. Even though Singapore did not express interest in maintaining nor had the capabilities to defend the islands, Australia still had several obstacles to obtaining the islands. These included Australia's need to obtain permission from the [Clunies-Ross family](/wiki/Clunies-Ross_family) who were the original land owners of the island because the British were unable to grant them the request as they had only administrative power over the islands, and as well as the opposition from the locals of the islands who intended to leave the islands before the transfer. In the lead up to the transfer there were also minor opposition by several legislative members in Singapore who felt that they weren't properly consulted on the matter. ### Labuan On 15 July 1946, the administrative responsibilities of the [Crown Colony of Labuan](/wiki/Crown_Colony_of_Labuan) was transferred from the Crown Colony of Singapore to the [Crown Colony of North Borneo](/wiki/Crown_Colony_of_North_Borneo). From 1907 up till that point in time, Labuan was administrated from Singapore under the [Straits Settlements](/wiki/Straits_Settlements) before it joined the Crown Colony of Singapore, when the Straits Settlements was dissolved with [Penang](/wiki/Penang) and [Malacca](/wiki/Malacca) joining the [Malayan Union](/wiki/Malayan_Union). It was eventually seceded as the British had drawn up plans to reconstitute its colony, so as to improve social and political imbalances across Malaya and North Borneo. - [Foreign territories in Singapore](/wiki/Foreign_territories_in_Singapore) - [List of diplomatic missions of Singapore](/wiki/List_of_diplomatic_missions_of_Singapore) - [Foreign relations of Singapore](/wiki/Foreign_relations_of_Singapore) - [Indonesia–Singapore border](/wiki/Indonesia%E2%80%93Singapore_border) - [Malaysia–Singapore border](/wiki/Malaysia%E2%80%93Singapore_border)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:04:25.127401",
  "title": "Foreign territories of Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Foreign_territories_of_Singapore"
}