{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:04:29.033931"
  },
  "content": "Building in Queenstown, Singapore **Forfar House** was a 14-storey [Housing and Development Board](/wiki/Housing_and_Development_Board) (HDB) block in [Queenstown, Singapore](/wiki/Queenstown,_Singapore). At the time of the building's opening, it was the sixth tallest building in Singapore and the tallest public residential building in Singapore. ## Description Forfar House was 14-storeys tall and rose 130 ft above ground level. The building was built in a unique \"zig-zag\" shape, which provided wind pressure resistance. The building was constructed with a reinforced concrete frame where the building's foundation of strip footings ran across the building and was held by longitudinal beams. Each of the building's units had a modern sanitary system and built-in rubbish chutes. The building had 106 apartments, four stores and two lifts. Water supplied to the building was pumped to tanks on the roof and were supplied to each of the building's flats through gravitational force. ## History Forfar House was officially opened on 24 October 1956 by then-Minister for Local Government, Lands and Housing [Abdul Hamid Jumat](/wiki/Abdul_Hamid_Jumat). At the time of the building's opening, it was the sixth tallest building in Singapore and the tallest public residential building in Singapore. The selection of the building for the [Selective En bloc Redevelopment Scheme](/wiki/Selective_En_bloc_Redevelopment_Scheme) was announced on 30 April 1996. Residents of the building were offered new flats in Blocks 181 to 184 on Stirling Road. The building was demolished and later replaced by the Forfar Heights cluster. 1°17′38″N 103°48′20″E﻿ / ﻿1.2940°N 103.8056°E﻿ / 1.2940; 103.8056\n",
  "language": "en",
  "processed_at": "2026-01-12T11:04:29.033436",
  "title": "Forfar House",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Forfar_House"
}