{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:04:41.121816"
  },
  "content": "Listing of cemeteriesThis article includes a list of general references, but **it lacks sufficient corresponding inline citations**. Please help to improve this article by introducing more precise citations. *(March 2021)* *(Learn how and when to remove this message)* A number of **former cemeteries in Singapore** were cleared of [graves](/wiki/Grave_(burial)) with the land redeveloped during the second half of the twentieth century. The [cemeteries](/wiki/Cemetery) had closed when they were either full or were relocated. The records and histories of some of these cemeteries are now left. Due to the problem of land scarcity in Singapore, use of land for spacious or defunct cemeteries is regarded as a waste of resources. As the need for land for urban development and public housing increased in Singapore, former cemeteries and burial sites were gradually cleared to make way for redevelopment. By 1985, 21 cemeteries had been cleared, and an approximate 120,000 graves had been [exhumed](/wiki/Exhume) by the [Housing Development Board](/wiki/Housing_Development_Board). ## Bukit Larangan ### Forbidden Hill Cemetery Forbidden Hill Cemetery was an early Christian cemetery established in 1822 on [Bukit Larangan](/wiki/Bukit_Larangan) ([Malay](/wiki/Malay_language) for Forbidden Hill), near to the residence built by [Sir Thomas Stamford Raffles](/wiki/Stamford_Raffles). The cemetery was discontinued at the end of 1865, and all traces of it had been wiped out by the different rebuilding developments and programmes. One of these major projects was the construction of the fort that came to be known as [Fort Canning](/wiki/Fort_Canning). ### Fort Canning Cemetery Following the closure of Forbidden Hill Cemetery, Fort Canning Cemetery was established in 1823. Located on the slope of Bukit Larangan, the cemetery's earliest graves were situated on the side of the cemetery that faced the sea. The original portion of the cemetery, as found in the register of Lands Held on Grants issued by Sir Stamford Raffles and J. Crawfurd, was listed as \"Lot 576. Burial Ground\" and as being 2 acres (0.81 ha) in area. When this small cemetery became full, application for a new burial ground was made in May 1827 by Reverend Robert Burn, the resident chaplain. This request was rejected. On 6 October 1834, the cemetery was [consecrated](/wiki/Consecrated) by [Bishop Daniel Wilson](/wiki/Daniel_Wilson_(bishop)), the fifth [Bishop of Calcutta](/wiki/Anglican_Diocese_of_Calcutta). Although the area facing the sea was usually reserved for [Protestant](/wiki/Protestant) burials and the ground on the inland side reserved for [Catholic](/wiki/Catholic) burials, the restricted size of the cemetery made it such that no formal segregation was carried out until 1845. In 1845, the cemetery was extended to contain the grounds to the east of the central path, and in 1846, a brick wall was constructed to enclose the entire cemetery. Two arches, designed by Captain Charles Edward Faber, superintending engineer of the settlement, were also built–one was on the southern, seaward side, and one was on the landside. By the end of 1863, the cemetery had become full, and in 1865, Fort Canning Cemetery was closed. Although attempts were made in 1886 by Sir Frederick Dickson, the [colonial secretary](/wiki/Chief_Secretary_(British_Empire)), to repair and preserve the remaining memorials, the condition of the cemetery continued to gradually deteriorate. Although more than 600 burials took place at Fort Canning Cemetery – with a third of this number consisting of Chinese Christians, only 400 legible stones remained when the cemetery was surveyed in 1912. By 1954, the greater part of the cemetery's gravestones and memorials had been removed, although some of the inscription plaques had been saved and placed within the north and south walls. Over the next 23 years, the cemetery was gradually cleared. By late 1977, only three original monuments still stood in their original locations. ### St Joseph's Church Cemetery [St Joseph's Church](/wiki/Saint_Joseph%27s_Church,_Bukit_Timah) is a Roman Catholic church built at [Bukit Timah](/wiki/Bukit_Timah) for the Chinese congregation, and was named St Joseph at the request of the Reverend [John M Beurel](/wiki/Jean-Marie_Beurel). It was opened on Sunday, 6 June 1846, and the first burial at the cemetery is recorded as being on 7 November 1846. Following that, over 400 burials are recorded to have taken place in that cemetery. However, in May 1984, it was recorded that the cemetery was badly overgrown with weeds and vegetation, and that a majority of the tablets were already broken. ### Bukit Timah Cemetery The Bukit Timah Cemetery was a Christian cemetery in use from 1865 to 1907, and derived its name for the road along which it was situated. Land for the cemetery had been purchased from the [Honourable East India Company](/wiki/East_India_Company) on 22 January 1864. The cemetery was consecrated by [Bishop McDougall](/wiki/Francis_Thomas_McDougall) of [Sarawak](/wiki/Sarawak), and the first burial took place on 15 April 1865. Opened for burials on 1 April 1865, the cemetery was divided into two, with one an area designated for Roman Catholics and another for designated for Christians of other denominations. If one entered the main gate of the cemetery, the catholic section was to the left, and had its own [mortuary](/wiki/Mortuary) chapel, while the Protestant portion with its mortuary chapel was to the right. These two divisions were separated by a broad central path. The area of the cemetery was later extended, with a new section opened for burials on the western side of the cemetery. A small road divided the older and newer sections, and was later named New Cemetery Road. In 1907, burials ceased, and the cemetery was henceforth maintained by the [Public Works Department](/wiki/Public_Works_Department_of_Singapore). By 1956, however, the walls of the cemetery had been demolished, the grounds were overgrown by vegetation, and the eastern end of the area experienced frequent flooding. In addition, many of the memorials had collapsed. In 1971, the cemetery was finally closed to all visitors, and all the gravestones and memorials contained within were cleared. The Singapore Cemeteries Board managed to exhume some remains, but a majority of the memorials had been destroyed. One military memorial, however, was saved, and was then transferred to the Ulu Pandan Military Cemetery. 12 gravestones, including those of Sir [Elliot Bovill](/wiki/Elliot_Bovill), [Chief Justice of the Straits Settlements](/wiki/Chief_Justice_of_Singapore) from 1892 to 1893, and [Hans Hermann Eschke](/wiki/Hans_Hermann_Eschke), the first German Consul-General in Singapore, were moved to [Fort Canning](/wiki/Fort_Canning) Green. The other 10 graves moved were those of Wladimir Astafiew, Nelson William Cashin, William Cuppage, Arthur D. Forbes, [George Thompson Hare](/wiki/George_Thompson_Hare), Chik Hassan, LDMA Hooglant, Jean Rudolph Lambert, Lee Khia Soon, and William Ronaldson. ## Bukit Brown Cemetery Bukit Brown Cemetery, also known to the local community as Kopi Sua or Coffee Hill, was a public Chinese cemetery that had been established in the early 20th century. It was believed to be the biggest Chinese graveyard outside China, hosting about 100,000 graves. It is located between Lornie Road and Mount Pleasant Road, and off Sime Road and Kheam Hock Road, and is still in existence today, despite being abandoned. The cemetery was named after its first owner, George Henry Brown. Brown had been a ship owner who had arrived in Singapore from Calcutta in the 1840s, and had bought the area and named it Mount Pleasant. The land was then later bought by Ong Kew Ho and the [Hokkien Huay Kuan](/wiki/Singapore_Hokkien_Huay_Kuan), who gave it to the Ngee Ann Kongsi. The 213-acre (0.86 km2) site at Bukit Brown had been acquired and passed into municipal hands by the municipal authorities in 1919 after pressure had been put on it to provide a municipal cemetery for the Chinese communities in Singapore. The cemetery was opened on 1 January 1922 and was managed as a public burial ground by a committee led by committee leaders Tan Kheam Hock and See Tiong Wah–who was at that time [comprador](/wiki/Comprador) of the Hong Kong Bank. By 1929, Bukit Brown Cemetery accounted for about 40 per cent of all officially registered Chinese burials within municipal limits. The cemetery was eventually closed. In the 1970s, the cemetery faced the threat of being cleared for redevelopment, but it was eventually granted reprieve. Now, the cemetery is home to many bird species and wild life, and has as such become popular again–this time, with nature lovers. It is the only built area that is near the [Bukit Brown MRT station](/wiki/Bukit_Brown_MRT_station) (part of the [Circle MRT line](/wiki/Circle_Line_(Singapore))). Since there are no other developments in the vicinity, the station will remain non-operational till a later date. It was originally announced by Minister of State for National Development [Tan Chuan-Jin](/wiki/Tan_Chuan-Jin) in February 2012 that 5000, out of more than 100000 graves, would make way for a new 4-lane road that would cut through the cemetery. This number was reduced to 3746, from the original 5000, on 19 March 2012. It was also revealed that the rest of the cemetery would make way for a new public housing town in about 40 years time. The [National Archives of Singapore](/wiki/National_Archives_of_Singapore) digitised and released online the burial registers of the cemetery between April 1922 and December 1972, as well as a location map of the cemetery in part to help descendants check if their ancestor's graves were affected by the development. On 30 September 2015, it was reported that the cast iron gates of the cemetery were removed from their posts and would be reinstalled (after refurbishment) at the mouth of a new access road near its original location. By 2030, they would change Bukit Brown into housing, repair works are now in progress. ## Cantonese Cemetery [Kwong Wai Siew Peck San Theng](/wiki/Kwong_Wai_Siew_Peck_San_Theng) was previously a cemetery in Singapore that was established in 1870 by [Cantonese](/wiki/Cantonese) and Hakka immigrants largely from the three prefectures of [Guangzhou](/wiki/Guangzhou), [Huizhou](/wiki/Huizhou) and [Zhaoqing](/wiki/Zhaoqing) in [Guangdong Province](/wiki/Guangdong_Province), [China](/wiki/China). The first words of the three prefectures, Guang-Hui-Zhao were the origins of the name 廣惠肇, or transliterated as Kwong-Wai-Siew. Within a century, Peck San Theng (PST) became one of the biggest Chinese cemeteries in Singapore, holding more than 100,000 graves over 324 acres (1.31 km2) of land. In 1979, the Singapore government decided to acquire all its land to create the present-day [Bishan Town](/wiki/Bishan,_Singapore). Many graves were exhumed and remains cremated during the 1980s. After a long legal back-and-forth, the government compensated 8 acres (32,000 m2) of land to Peck San Theng which accommodating an office block, a heritage museum, two [temples](/wiki/Chinese_temple) and a [columbarium](/wiki/Columbarium). The columbarium houses some 100,000 niches which are available to the public irrespective of race, language and religion since 1980. It is managed by sixteen [clan associations](/wiki/Chinese_kin) to provide as a place for [ancestral worship](/wiki/Chinese_ancestral_worship) in Singapore, particularly during [Qing Ming Festival](/wiki/Qing_Ming_Festival) and [Chong Yang Festival](/wiki/Chong_Yang_Festival). ## Hakka Cemetery For many Singaporeans living in the west, a trip on the east–west line towards town is often filled with dread, given the distance and jostling for space on board. Yet in a pocket of space in-between Buona Vista and Commonwealth stations, there lies a little oasis of solace if one takes a look out to view the nearly 3000 neatly aligned graves amongst the many high-rise apartments of Holland Close. Built in 1969, this is the Ying Fo Fui Kun (应和会馆) Cemetery, better known as the Hakka Cemetery. The beginnings of the Hakka Cemetery trace back to 1822, when the first influx of migrants from the Guandong province set up the Ying Fo Fui Kun clan at Telok Ayer street. A minority group in comparison to the Hokkiens and Teochews, the carefully chosen words of \"应和\" or Ying Fo/Ho reflected their desire for a peaceful environment and mutual support amongst fellow migrants. In 1887, the Ying Fo Fui Kun clan bought over 100 hectares of land between the current Buona Vista and Commonwealth areas and named it Shuang Long Shan (双龙山) or Double Dragon Hill. The area was to be used as both a village and burial ground and was also chosen because the Chinese often saw the building of cemeteries on top of hills as being highly auspicious. Despite being met with constant resistance from the Colonial Government in the 1930s, it was not up till Singapore's independence in 1965 did negotiations between the clan and state began to fully reclaim the area of Shuang Long Shan for urban redevelopment. In 1969, all but 1.89 hectares of the land was returned to the state, and a 99-year lease was placed on the area where the current graves and ancestral halls of Shuang Long Shan Memorial Hall (双龙山念堂) and Wu Fu Tang Ancestral Hall (五富堂义祠) now stand. The Ying Fo Kuan Memorial is a Hakka cemetery located behind Blk 32 of Holland Close, a stone's throw away from today's Holland Village. It was built in 1887, when the [Ying Fo Fui Kuan](/wiki/Ying_Fo_Fui_Kun) (应和会馆), the first Chinese Hakka clan association in Singapore, bought over a piece of land from the British government to meet the burial demands of the increasing number of association members. The area was then renamed the Twin Dragon Hills, and a Wu Shu Ancestral Hall was built next to it. The Ying Fo Kuan cemetery was acquired by the local government in 1965, and the remains from the coffins placed in urns and buried under neat rows of memorial stones. ## Tiong Bahru Cemetery In October 1956 and January 1959, there was interest in usage of the disused Tiong Bahru Cemetery as emergency housing. In 1961, 16 acres of the disused Tiong Bahru Cemetery was acquired by the Government in the aftermath of the [Bukit Ho Swee fire](/wiki/Bukit_Ho_Swee_fire) to build the proposed emergency housing the victims of the fire. ## Kampong Bukit Coffee Chinese Cemetery Kampong Bukit Coffee Chinese Cemetery is located on [Pulau Ubin](/wiki/Pulau_Ubin). The cemetery was used to bury residents from the island and there were 35 Cantonese and Teochew residents buried there in the 1970s. Residents were not allowed to be buried there and subsequently the cemetery became abandoned. ## Kampong Sungei Tiga Cemetery On the same island of [Pulau Ubin](/wiki/Pulau_Ubin) lies another cemetery which is more than 150 years old. It is also no longer in use. - [British Association for Cemeteries in South Asia](/wiki/British_Association_for_Cemeteries_in_South_Asia) - [Muslim cemeteries in Singapore](/wiki/Muslim_cemeteries_in_Singapore) ### Cited works - Harfield, A. G. (1988). *Early cemeteries in Singapore*. British Association for Cemeteries in South Asia. London: [British Association for Cemeteries in South Asia](/wiki/British_Association_for_Cemeteries_in_South_Asia). [ISBN](/wiki/ISBN_(identifier)) 0-907799-19-1. [OCLC](/wiki/OCLC_(identifier)) 26803950. - Dunlop, Peter K. G. Street Names of Singapore. Singapore: Who's Who Publishing, 2000. - [Kong, Lily](/wiki/Lily_Kong) and Brenda S. A. Yeoh. The Politics of Landscape in Singapore: Constructions of \"Nation.\" Syracuse, NY: Syracuse University Press, 2003. - Report of the Committee Regarding Burial and Burial Grounds. Singapore: F. S. Horslin, 1952. - Yeoh, Brenda S.A. Contesting Space in Singapore: Power Relations and the Urban Built Environment. Singapore: Singapore University Press, 2003. - Bukit Brown Municipal Cemetery | Infopedia\n",
  "language": "en",
  "processed_at": "2026-01-12T11:04:41.121321",
  "title": "Former cemeteries in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Former_cemeteries_in_Singapore"
}