{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:04:37.079993"
  },
  "content": "Historical building in SingaporeThis article **is an orphan, as no other articles link to it**. Please introduce links to this page from related articles. *(December 2025)* The **Former Queen's Theatre** is located at the [Geylang Road](/wiki/Geylang_Road), opposite Lorong 41 road. The theatre had been one of the main entertainment places in Geylang from 1930 to 1982. The building was named **Wembley Cinema** from 1930 to 1933, **Ritz Cinema** from 1933 to 1939, and **Queen's Theatre** from 1939 until it was closed in 1982. The front facade of the building is now conserved and becomes part of the GrandLink Square. ## History In 1930, the **Wembley Cinema** was open as a suburban theatre in Geylang. The announcement of open show was published on Malaya Tribune, a local press. The cinema was equipped with Western Electric apparatus to offer patrons as good voice reproduction and synchronization. There would be two changes of program weekly, and two shows nightly at 6.15 pm and 9.15 pm. A matinee would be shown on Sunday at 3 pm when children were admitted at half price. **1930-1933**: Many popular films were shown there, like the American musical [operetta film](/wiki/Operetta_film) “[The Vagabond King](/wiki/The_Vagabond_King_(1930_film))” and the British [crime film](/wiki/Crime_film) “[Deadlock](/wiki/Deadlock_(1931_film))”. The films shown in Wembley Cinema were ranging from Europe and America, to Malaysia and local. The cinema was so popular in 1930 and 1931 that it had developed into a main place of entertainment in Geylang, shown from 219 articles and advertisements on newspapers like Malaya Tribune and [The Straits Times](/wiki/The_Straits_Times). **1933**: In 1933, Ritz Cinema, which was also located at Geylang, moved into Wembley hall. The consolidation of the two suburban cinemas in Geylang brought more people to the building, whose name was officially changed to Ritz Cinema. **1933-1938**: Films like “Saramang”, an American pro-code action film, and [Charlie Chaplin](/wiki/Charlie_Chaplin)’s epic comedy film “[Modern Times](/wiki/Modern_Times_(film))” were well received. An Egyptian talkie entitled “Long Live Love” was re-screened due to the fact that Abdul Wahab, whose singing and acting have delighted local Muslim cinema-fans was featured in the principal role. The price was sometimes halved to attract more people. **1939**: Malaya Tribunes announced that the Ritz Cinema was closed due to reconstruction, and the name was changed to Queen's Theatre. New car park was added for the Queen's Theatre after the renovation. **1939-1941**: Queen's Theatre continued providing good quality films, like the Malay Film “[Harta Berdarah](/wiki/Harta_Berdarah)”, to residents in Geylang **1941-1945**: During [World War II](/wiki/World_War_II), the movies were banned. The Queen's Theatre was converted to stage Bangsawan shows with a generous dose of singing. [Bangsawan](/wiki/Bangsawan) is a type of traditional Malay opera performed by a troupe. Stories were given by the Japanese or passed by the Japanese military police before actual stage. If the Japanese were pleased with the performance, the troupes would receive more rice rations. Anti-British stories were warmly received. **1946-1948**: After World War II, the Queen's Theatre was back to movie industry with films like “Isle of Forgotten Shas”. **1949**: The [Shaw Organization](/wiki/Shaw_Organization) showed interest in acquiring the theatre and indeed turned it into its property. **1951-1952**: The Queen's Theatre was under repair work since 1951, but after two men met their deaths in falls, all work has been suspended. After the death of Chung Seng Kar who slipped and rolled off the sloping roof on to the concrete below on 1951.12.25, the rumors of a spiteful ghost haunting the building roof spread widely. The fact that the theatre was built on the site of an old Malay cemetery and the skeletons were unearthed when the foundations were laid was lending weight to the rumors. Moreover, the police investigators gave evidence that two or three years ago an Arab employee at the theatre had died as a result of a fall through the ceiling. Although it was proved that the accident was because of rain, the rumor affected the repair work of the Queen's Theatre. In earlier 1980s, the movie business kept going down due to the stiff competition from TV and videotapes. The cinema attendance had been dropping steadily from a peak of 46,054,000 in 1979 to a low of 35,781,000 last year. Many closed cinemas like Hoover, was turned into a theatre for “live” entertainment and musical variety shows. In 1982, the theatre was closed. After the theatre closed, a church planned to convert the theatre as their venue. In 2000, a condominium, GrandLink Square, was built on the site of the Queen's Theatre. The front facade of the theatre was kept and become part of the facades of the GrandLink Square. The facade now is under the conservation area of [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority). ## Architecture By looking at the façade, it has characters of [colonial-style architecture](/wiki/Architecture_of_Singapore) which was popular when Singapore was under the control of Britain. The European architectural style, such as [Palladian](/wiki/Palladian_architecture), [Renaissance](/wiki/Renaissance_architecture) or [Neoclassical](/wiki/Neoclassical_architecture) style, was usually applied to civic and commercial building by the colonial government. The equilateral triangle at the top of the facade with decorations on the edges and the dome at the entrance structure clearly indicates the colonial fashion in Singapore architecture in 1930s. Moreover, the columns with decoration and lamp at the top by two sides defines the front yard of the theatre.[*citation needed*] However, when looking at plan of this building, it is a typical Kampong (compound) house which the entrance, or front of the building, is marked by an extruding structure. The building is raised from ground level, in the consideration of possible flood or heavy rain in tropical climate. Deducing from the dimension of the theatre, the building contains one cinema hall with sufficient space for comfortable seats. Linear arrangement of the space gives people comfortable experience in the cinema. The localization of the colonial style in Singapore followed the fashion, and responded to local climate and culture. No doubt that the theatre had been attractive not only because of the programs and facilities, architecture also helps it to gain much popularity.[*citation needed*]\n",
  "language": "en",
  "processed_at": "2026-01-12T11:04:37.079492",
  "title": "Former Queen's Theatre, Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Former_Queen%27s_Theatre,_Singapore"
}