{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:04:35.092675"
  },
  "content": "Historic site in Kheam Hock Road The **Former Command House** is a historic building, located at Kheam Hock Road in Singapore. It was the residence of the [General Officer Commanding](/wiki/General_Officer_Commanding) (GOC) of Malaya during British colonial period. ## History ### Prior to World War II The Former Command House is built c. 1937 – c. 1938 and was known as **Flagstaff House**. Its predecessor, the former Flagstaff House, built in 1925 was located at Mount Rosie. It was to have been one of three residences to have been built for the senior commanders of the three service arms: the army, led by the [General Officer Commanding](/wiki/General_Officer_Commanding) (GOC), Malaya (Army); the Air Force, led by the [Air-Officer Commanding](/wiki/Air_officer_commanding) (AOC), Far East in Tanglin (there is no evidence of this having been built) and the Navy ([Admiralty House](/wiki/Former_Admiralty_House) at Old Nelson Road). It was announced in March 1937 a new Flagstaff House would be built to house the GOC of Malaya, costing 100,000 Straits dollars at a site near Bukit Timah Road. The site is 11.5 acres (0.047 km2; 4.7 ha) and situated at west side of Kheam Hock Road. The first occupant was Lieutenant-General Sir [William Dobbie](/wiki/William_Dobbie) who shifted to the new premise in October 1938. Subsequent occupants were Lieutenant-General Sir [Lionel Bond](/wiki/Lionel_Bond) in 1939 and Lieutenant-General [Arthur Percival](/wiki/Arthur_Percival) in 1941. Briefly after Percival's appointment, Air Vice-Marshall [Conway Pulford](/wiki/Conway_Pulford) of the [Royal Air Force's Officer Commanding](/wiki/Air_officer_commanding) moved into Flagstaff House. ### World War II During the war, the surrounding area of the Flagstaff House was known as Sime Road Camp, which is the Combined Operations Headquarters for the British Army and Air Force. During the [fall of Singapore](/wiki/Fall_of_Singapore), Sime Road Camp was forsaken and shifted to the underground bunker at [Fort Canning](/wiki/Fort_Canning). During the [Japanese occupation of Singapore](/wiki/Japanese_occupation_of_Singapore), Flagstaff House was the Japanese soldiers’ quarters and Sime Road Camp was an internment camp for [POWs](/wiki/POW). In 1946, the Flagstaff House was Admiral [Lord Louis Mountbatten](/wiki/Lord_Mountbatten)'s residence during the [British Military Administration](/wiki/British_Military_Administration_(Malaya)). ### Post Independence After the British military completed their withdrawal, Flagstaff House became the residence of Singapore's Speaker of Parliament, Dr [Yeoh Ghim Seng](/wiki/Yeoh_Ghim_Seng). His successor, [Tan Soo Khoon](/wiki/Tan_Soo_Khoon) did not stay at the Flagstaff House. The Flagstaff House was rented to a building management company and later renamed as the **Command House**. Between 1996 and 1998, when [the Istana](/wiki/The_Istana) underwent a major renovation, the Command House was the temporary residence of then president of Singapore [Ong Teng Cheong](/wiki/Ong_Teng_Cheong). Ong, who was an architect, played an important role in restoring the Command House and add a reception hall. On 11 November 2009, the building was gazetted as a [national monument of Singapore](/wiki/National_monuments_of_Singapore) and its name was changed to **Former Command House** upon gazette. It is currently occupied by a Business University. ## Architecture The two-storey colonial residence was designed in a unique [Arts and Crafts](/wiki/Arts_and_Crafts_movement) [architectural style](/wiki/Architectural_style) popular in the 19th century. Flagstaff House was probably designed by architect Frank Brewer, who had designed the former [Cathay Building](/wiki/Cathay_Building).\n",
  "language": "en",
  "processed_at": "2026-01-12T11:04:35.092191",
  "title": "Former Command House",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Former_Command_House"
}