{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:04:31.091604"
  },
  "content": "Historic site in Old Nelson Road, Singapore The **Former Admiralty House** ([Malay](/wiki/Malay_language): *Gedung Lama Laksamana*; [Chinese](/wiki/Simplified_Chinese_characters): 旧海军部屋; [pinyin](/wiki/Pinyin): *Jiù Hǎijūnbù Wū*) is a historic building, located at Old Nelson Road within the [Sembawang Planning Area](/wiki/Sembawang) in the [North Region](/wiki/North_Region,_Singapore) of [Singapore](/wiki/Singapore). The building was used as the administration building of Furen International School (FIS) until November 2019 and is currently being refurbished for use as part of the Sembawang Sports and Community Hub. ## History The house was completed in 1940 and was named **Canberra House**. It is a residence for the Rear Admiral, Malaya - the commander of His Majesty's Naval Establishments (naval base) in [Sembawang](/wiki/Sembawang). It was to have been one of three residences to have been built for the senior commanders of the three service arms: the army, led by the [General Officer Commanding](/wiki/General_Officer_Commanding) (GOC), Malaya ([Flagstaff House](/wiki/Former_Command_House) at Kheam Hock Road); the Air Force, led by the [Air-Officer Commanding](/wiki/Air_officer_commanding) (AOC), Far East in Tanglin (there is no evidence of this having been built) and the Navy. It was referred to as 'Navy House' in a news article in the [Singapore Free Press and Mercantile Advertiser](/wiki/Singapore_Free_Press_and_Mercantile_Advertiser) in October 1941 on the residence's first residents, Rear Admiral [Ernest John Spooner](/wiki/Ernest_John_Spooner) and Mrs Megan Spooner (née Foster) - a renowned soprano back in Britain. After the war, the building became the official residence of the Flag Officer, Malayan Area and was renamed **Nelson House**. In 1958, it became the residence of the British [Royal Navy](/wiki/Royal_Navy) [Commander-in-Chief](/wiki/Commander-in-Chief), [Far East Station](/wiki/British_Far_East_Command) when the Flag Officers role was subsumed under the command. It was subsequently renamed **Admiralty House** (not to be confused with the earlier C-in-C's residence at Grange Road also named Admiralty House). The building was renamed again to **ANZUK House** in 1971 as the residence of the Commander of the [ANZUK](/wiki/ANZUK) Force following the British military withdrawal. After the British forces left Singapore in 1975, [Sembawang Shipyard](/wiki/SembCorp_Marine) inherited the building and used it as a [recreation club](/wiki/Country_club). In 1991, the building was [renovated](/wiki/Renovation) to become **Yishun Country Club**. The **Karimun Admiralty Country Club** then took over the building with a change in [tenant](/wiki/Leasehold_estate) in 2001. On 2 December 2002, the building was [gazetted](/wiki/Gazetted) as a [national monument of Singapore](/wiki/National_Monuments_of_Singapore) and its name was changed to **Former Admiralty House** upon gazette. In 2007, Karimun Admiralty Country Club vacated the premises and the [Singapore Land Authority](/wiki/Singapore_Land_Authority) (SLA) put up the Old Admiralty House for public [tender](/wiki/Request_for_tender) for development of the area which was won by YESS Group Pte Ltd. In 2010, SLA terminated the contract with YESS Group after it failed to pay rent and took back the land. On 22 March 2011, Furen International School (FIS), a boarding school, took over the running of the property. The school converted the building into its administration building, a nerve centre to run the surrounding academic and hostel buildings. In order to do justice to this beautiful building, FIS worked closely with the Preservation Monument Board in restoring the building to its former glory; all of it privately funded by the school without subsidy from the government. The site was returned to the State at the end of 2019 and work is being carried out on it to incorporate it into the Sembawang Sports and Community Hub. ## Architecture The two-storey colonial residence was designed in a unique [Arts and Crafts](/wiki/Arts_and_Crafts_movement) [architectural style](/wiki/Architectural_style) popular in the 19th century. Former Admiralty House had been attributed to English [architect](/wiki/Architect) Sir [Edwin Lutyens](/wiki/Edwin_Lutyens). There is however, no evidence of this, other than Lutyens having been closely connected with the late 19th Century Arts and Crafts designs in Britain. By the 1900s, he had already moved away from the style and was advanced in age and poor health at the time of the design and construction of the structure. The house, resembling a traditional English [cottage](/wiki/Cottage), sits on a lush, open [garden](/wiki/Garden) and has an interesting internal layout and of \"[asymmetrical](/wiki/Asymmetry)\" design. It is two storeys high with a one-storey wing on the north-west side. The building is on a 4 hectares (0.040 km2; 9.9 acres) site, which in its time as Furen International School, included six hostel blocks, six academic blocks, dance studio, swimming pool, tennis courts, basketball courts, laundry block and an air-raid shelter.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:04:31.091033",
  "title": "Former Admiralty House",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Former_Admiralty_House"
}