{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:04:45.164213"
  },
  "content": "Old coastal artillery site in Singapore **Fort Siloso** is a decommissioned coastal [artillery battery](/wiki/Artillery_battery) in [Sentosa](/wiki/Sentosa), [Singapore](/wiki/Singapore). It consists of 12 such batteries which made up \"Fortress [Singapore](/wiki/Singapore)\" at the start of [World War II](/wiki/World_War_II), and saw action during the [Battle of Singapore](/wiki/Battle_of_Singapore). The fort is now a military museum open to the public. The Surrender Chambers in Fort Siloso reopened in June 2017 with a refreshed exhibition and free admission. ## History ### Construction The word \"Siloso\" of the fort's name is derived from a Malayan word meaning \"rock\". There was a huge rock at the mouth of [Singapore's harbour](/wiki/Keppel_Harbour) which imposed a hazard to passing shipping. With trade ever flourishing in Singapore since the opening of the [Suez Canal](/wiki/Suez_Canal) in 1869, it became necessary to protect Singapore's port. Based on the report by Major Edward Lake of the British Royal Engineers, a fort was decided to be built on Pulau Blakang Mati (Sentosa) in 1874 to protect Keppel Harbour. As part of the planned fortifications, Mount Siloso's top was blown off to flatten it for the installation of coastal-artillery gun platforms. By the 1880s, several gun batteries were located on Mount Siloso and Mount Serapong (facing north towards mainland Singapore on Sentosa's northern coast) on Pulau Blakang Mati, becoming a stronghold of British naval defences in Singapore. Fort Siloso was built in 1878. ### Armament By the 1880s, Fort Siloso possessed [7-inch guns](/wiki/RML_7_inch_gun) and two [64-pounder guns](/wiki/RML_64_pounder_64_cwt_gun). In the 1890s, five [10-inch guns](/wiki/Vickers_10-inch_/45_naval_gun) were also installed. These guns were operated automatically and powered from an underground electric-powerhouse. In the 1930s, twin [6-pounder](/wiki/Ordnance_QF_6-pounder) guns, Quick-Firing anti-torpedo-boat guns, five large [searchlights](/wiki/Searchlight), an Operational Tower (for overall command and control), two machine-gun nests and two twin-[Lewis anti-aircraft machine guns](/wiki/Lewis_gun) were added due to reports of an impending war (rising from an ever military-ambitious Imperial Japan). The fort was manned by both the British [Royal Artillery](/wiki/Royal_Artillery) and the locally formed [Singapore Artillery Corps](/wiki/Singapore_Artillery). ### World War II The forts were designed and built to defend Singapore against an invasion by sea from the south. However, during the [Battle of Singapore](/wiki/Battle_of_Singapore) in February 1942, the guns were instead turned 180 degrees inland to fire at rapidly-advancing Japanese forces approaching Singapore from the north (via [British Malaya](/wiki/British_Malaya)). The fort's guns were fired at encroaching Japanese positions and troops who were pushing towards the city-area northwest from [Tengah Airfield](/wiki/Tengah_Airfield). The British and local troops who were retreating from the overrun Pasir Laba Battery (in Singapore's northwest) and heading back to friendly British lines via the sea were mistaken for Japanese troops and fired upon, with at least major casualties sustained. The building at the entrance of Fort Siloso is now known as the Surrender Chambers and has a vivid portrayal of the scenes of the British and Japanese surrenders in WWII with actual footage of the war being played interactively. This is on the upper storey, with the ground floor having been turned into a souvenir shop. During the [Japanese occupation of Singapore](/wiki/Japanese_occupation_of_Singapore) from 1942 to 1945, the fort was used as a small [prisoner-of-war](/wiki/Prisoner-of-war) camp. ### Post-World War II After the [Japanese surrender](/wiki/Surrender_of_Japan) in 1945, the [Royal Navy](/wiki/Royal_Navy) occupied the fort in 1946 and its guns were manned by the 1st Malay Coast Battery and [Royal Artillery](/wiki/Royal_Artillery). [Gurkha detachments](/wiki/Gorkha_regiments_(India)) from British India took over manning the guns when the British gunners were withdrawn and the 1st Malay Coast Battery was disbanded sometime later in 1946. During the [Konfrontasi period](/wiki/Indonesia%E2%80%93Malaysia_confrontation) between Sukarno's Indonesia and the Malaysian Federation from 1963 to 1965, Fort Siloso was manned by the [10th Gurkha Rifles](/wiki/10th_Princess_Mary%27s_Own_Gurkha_Rifles) to prevent Indonesian military-trained saboteurs from landing on Sentosa and [Keppel Harbour](/wiki/Keppel_Harbour) slightly inland. Fort Siloso became a Catholic retreat for locally based British forces until Sentosa was handed over to the [Singapore government](/wiki/Government_of_Singapore) following the British military withdrawal starting in 1967. The [Singapore Armed Forces](/wiki/Singapore_Armed_Forces) (SAF) then took control over the fort. Fort Siloso was then converted into a military museum in 1974, displaying its history and various naval guns. Other coastal guns (both British and Japanese) from different parts of Singapore, such as a pair of Japanese naval cannons discovered and brought over from [Mandai](/wiki/Mandai), were put here for display. It had previously held the display of the British surrender of Singapore in February 1942 until its relocation to the [Former Ford Factory](/wiki/Former_Ford_Factory) (the actual site of the British surrender) in [Bukit Timah](/wiki/Bukit_Timah) in February 2006. Plans for the gazetting of Fort Siloso into a national monument began in June 2016 as it is also a wartime museum, and also a military museum dedicated to [Republic of Singapore Navy](/wiki/Republic_of_Singapore_Navy). Fort Siloso was gazetted on 15 February 2022. - Singapore portal - [List of tourist attractions in Singapore](/wiki/List_of_tourist_attractions_in_Singapore) - [Singapore strategy](/wiki/Singapore_strategy) - Page on Fort Siloso\n",
  "language": "en",
  "processed_at": "2026-01-12T11:04:45.163515",
  "title": "Fort Siloso",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Fort_Siloso"
}