{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:04:43.062578"
  },
  "content": "* *Fort Serapong** is a former coastal [artillery battery](/wiki/Artillery_battery) on Mount Serapong hill on [Sentosa Island](/wiki/Sentosa_Island) in Singapore, then known as Pulau Blakang Mati. It was one of four major batteries on the island, along with [Fort Siloso](/wiki/Fort_Siloso), Fort Connaught and the Mount Imbiah Battery. ## History Approval for a battery on Mount Serapong hill was granted by the British in the early 1880s, with the battery being fully operational by 1887. The fort was built around the same time as nearby [Fort Siloso](/wiki/Fort_Siloso) and Fort Connaught, as well as [Fort Tanjong Katong](/wiki/Fort_Tanjong_Katong). In the early 1940s, the battery was manned by the Hong Kong and Singapore Royal Artillery. During [World War II](/wiki/World_War_II), the battery was bombed by the Japanese, although the battery's [war diaries](/wiki/War_diary) did not record any firing at Japanese targets, unlike Fort Siloso and Fort Connaught. In the last two days prior to the [surrendering of Singapore to the Japanese](/wiki/Fall_of_Singapore), the battery and its guns were destroyed by British engineers. Following the end of the [Japanese occupation of Singapore](/wiki/Japanese_occupation_of_Singapore), the battery was operated by the Keppel Fire Command, who also operated Fort Siloso. The guns of the battery became non-operational in 1956, following the end of the use of fixed coastal artillery batteries by the British military. The fort has since reopened for guided tours, although the area is out of bounds for those who are not part of the tours. The guided tours are hosted by boutique-travel agency Beyond Expeditions. The fort has also been included in the Sentosa heritage trail by the [National Heritage Board](/wiki/National_Heritage_Board_(Singapore)). For the safety of hikers, do avoid going here alone. 1°15′02″N 103°50′01″E﻿ / ﻿1.2505°N 103.8336°E﻿ / 1.2505; 103.8336 This article about a Singapore building or structure is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:04:43.062058",
  "title": "Fort Serapong",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Fort_Serapong"
}