{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:04:53.082522"
  },
  "content": "Former garden promenade attraction in Singapore **Sentosa Fountain Gardens** (or simply known as the **Fountain Gardens**) was a garden promenade attraction on the western part of [Sentosa Island](/wiki/Sentosa), [Singapore](/wiki/Singapore), which opened in 1989. It was located in the [Imbiah Lookout](/wiki/Imbiah_Lookout) zone of the island. The gardens and other features were demolished in 2007 for construction of the new [Resorts World Sentosa](/wiki/Resorts_World_Sentosa), a large integrated style resort with new entertainment venues. ## Features Start The promenade began at the plaza of a fountain with a sculpted dragon statue. Its spouting snout faced the former [Sentosa Ferry Terminal](/wiki/Sentosa_Ferry_Terminal), welcoming new arrivals. The fountain was similar to another former dragon fountain that stood where the [Tiger Sky Tower](/wiki/Tiger_Sky_Tower) (*former Carlsberg Sky Tower* ) now rises. Route The promenade's route passed by many smaller water features and European-style gardens. The gardens were inspired by the [French formal gardens](/wiki/French_formal_garden) from the era of [Louis XIV](/wiki/Louis_XIV_of_France). The elegant European-style gardens had over 25,000 plants, including palms, shrubs, bamboos, and vining creepers. At the top of the Fountain Gardens terrace, there is a replica of the [Villa Gamberaia](/wiki/Villa_Gamberaia) landscape, a renowned 17th-century [Italian Renaissance garden](/wiki/Italian_Renaissance_garden) near [Florence, Italy](/wiki/Florence,_Italy). It had a mini-stage for small performances. The gigantic 37 metres (121 ft) [Merlion Statue](/wiki/Merlion), representing the [mascot](/wiki/Mascot) and [national personification](/wiki/National_personification) of Singapore, was prominently seen above the promenade. Finish The promenade terminus was at the entry gates of the former [Sentosa Musical Fountain](/wiki/Sentosa_Musical_Fountain) feature, a very large [musical fountain](/wiki/Musical_fountain) grouping of coordinated individual jets and pools. Performances of water, mist, sound, light, lasers, flames, and animatronic 'host creatures' in computer choreographed programs had scheduled showtimes.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:04:53.082039",
  "title": "Fountain Gardens",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Fountain_Gardens"
}