{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:04:49.115438"
  },
  "content": "Memorial under construction dedicated to the founders of Singapore The **Founders' Memorial** is a [memorial](/wiki/Memorial) under development within the Bay East Garden of the [Gardens by the Bay](/wiki/Gardens_by_the_Bay) to commemorate the founders of [Singapore](/wiki/Singapore) as well as to cover the country's contemporary history from after [World War II](/wiki/World_War_II) to its first few decades of independence. On 9 March 2020, a collaboration between [Kengo Kuma](/wiki/Kengo_Kuma) (Japan) and K2LD Architects (Singapore) won the international architectural competition to design the memorial. Initially expected to open in 2025, the memorial is now scheduled to open in 2028. ## History Singapore's first [Prime Minister](/wiki/Prime_Minister_of_Singapore), [Lee Kuan Yew](/wiki/Lee_Kuan_Yew), died on 23 March 2015. He had consistently stated that he did not want a monument solely to himself, and his will specified to demolish his house at [38 Oxley Road](/wiki/38_Oxley_Road). In a parliamentary statement on 13 April 2015, Prime Minister [Lee Hsien Loong](/wiki/Lee_Hsien_Loong), his son, said: > Mr Lee was always conscious that he did not act alone, but as a member of a team. His core team included [Goh Keng Swee](/wiki/Goh_Keng_Swee), [S. Rajaratnam](/wiki/S._Rajaratnam), [Othman Wok](/wiki/Othman_Wok), [Hon Sui Sen](/wiki/Hon_Sui_Sen), [Lim Kim San](/wiki/Lim_Kim_San), amongst others. It was a multi-racial team who complemented one another's strengths, trusted one another implicitly, and through their joint efforts created a prosperous, fair and just society in Singapore. Mr Lee himself said he was only *[primus inter pares](/wiki/Primus_inter_pares)* – first among equals. So it is appropriate that we consider how to honour not just Mr Lee, but also our other founding fathers. > > One idea that has been suggested is to have a memorial for all of the founding fathers, perhaps coupled with an exhibition gallery to honour their legacy and educate future generations. Indeed, Mr Lee himself had thought that there was value in such a memorial. > > I agree that this concept merits further consideration. A founder's memorial need not be a grand structure, but it must stand for our ideals, our values, our hopes and aspirations. It must belong to all Singaporeans and mean something significant to us all. It should be a place where we and future generations can remember a key period in our history, reflect on the ideals of our founding fathers, and pledge to continue their work of nation building. [Lee Tzu Yang](/wiki/Lee_Tzu_Yang) was appointed to chair the Founders' Memorial Committee, established for the creation of said memorial, and seek public views through dialogue sessions while conceptualising its details. Gardens by the Bay was selected as the memorial's location in 2018 after a choice between it and [Fort Canning Park](/wiki/Fort_Canning_Park). ## Design competition A design competition was launched in January 2018, attracting 193 local and international architects. The first stage of judging was an anonymous process, lasting 12 weeks until 5 April. The names of the five entrants moving to the next stage was only revealed to the seven-member jury panel after being shortlisted. The five entries selected for the second stage were: [Kengo Kuma & Associates](/wiki/Kengo_Kuma), and K2LD Architects (collaboration); 8DGE Design, and Ong Ching Ying (collaboration); Cox Architecture, and Architects 61 (collaboration); DP Architects; Johnson Pilton Walker. On 9 March 2020, the collaboration between Kengo Kuma (Japan) and K2LD Architects (Singapore) was announced as winner of the architectural competition to design the memorial. Initially planned to open in 2025, it has been rescheduled for 2028 due to the COVID-19 pandemic. ## Transportation Once completed, the Memorial will be served by train at the namesake [Founders' Memorial MRT station](/wiki/Founders%27_Memorial_MRT_station) on the [Thomson–East Coast Line](/wiki/Thomson%E2%80%93East_Coast_Line). - History portal - Singapore portal - [Early Founders Memorial Stone](/wiki/Early_Founders_Memorial_Stone) - [History of Singapore](/wiki/History_of_Singapore) - [Timeline of Singaporean history](/wiki/Timeline_of_Singaporean_history) - Architecture Design Competition\n",
  "language": "en",
  "processed_at": "2026-01-12T11:04:49.114843",
  "title": "Founders' Memorial",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Founders%27_Memorial"
}