{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:04:51.205988"
  },
  "content": "1819 British colonial establishmentPart of a series on the[History of Singapore](/wiki/History_of_Singapore)[Early history](/wiki/Early_history_of_Singapore) (pre-1819)[Srivijaya](/wiki/Srivijaya)650–1377[Temasek](/wiki/Temasek), [Long Ya Men](/wiki/Long_Ya_Men), [Ban Zu](/wiki/Ban_Zu)c.14th century[Kingdom of Singapura](/wiki/Kingdom_of_Singapura)1299–1398[Majapahit](/wiki/Majapahit)1398–1400[Malacca Sultanate](/wiki/Malacca_Sultanate)1400–1528[Johor Sultanate](/wiki/Johor_Sultanate)1528–1819British colonial era (1819–1942)Founding1819–1826[Straits Settlements](/wiki/Singapore_in_the_Straits_Settlements)1826–1867[Crown colony](/wiki/Singapore_in_the_Straits_Settlements#Crown_colony_(1867–1942))1867–1942[Japanese Occupation](/wiki/Japanese_occupation_of_Singapore) (1942–1945)[Fall of Singapore](/wiki/Fall_of_Singapore)1942[Sook Ching](/wiki/Sook_Ching)1942[Double Tenth incident](/wiki/Double_Tenth_incident)1943[Post-war period](/wiki/Colony_of_Singapore) (1945–1962)[First Legislative Council](/wiki/History_of_Singapore#First_Legislative_Council_(1948–1951))1948–1951[Maria Hertogh riots](/wiki/Maria_Hertogh_riots)1950[Second Legislative Council](/wiki/History_of_Singapore#Second_Legislative_Council_(1951–1955))1951–1955[Anti-National Service Riots](/wiki/1954_National_Service_riots)1954[Internal self-government](/wiki/Self-governance_of_Singapore) (1955–1963)[Hock Lee bus riots](/wiki/Hock_Lee_bus_riots)1955[Singapore Glass Factory strikes](/wiki/Singapore_Glass_Factory_strikes)1960[Pulau Senang prison riots](/wiki/Pulau_Senang_prison_riots)1963[Merger with Malaysia](/wiki/History_of_the_State_of_Singapore_(Malaysia)) (1963–1965)[Singaporean referendum](/wiki/1962_Singaporean_integration_referendum)1962[Operation Coldstore](/wiki/Operation_Coldstore)1963[Race riots in Singapore](/wiki/1964_race_riots_in_Singapore)1964[MacDonald House bombing](/wiki/MacDonald_House_bombing)1965[Republic of Singapore](/wiki/History_of_the_Republic_of_Singapore) (1965–present)[ASEAN Declaration](/wiki/ASEAN_Declaration) ([ASEAN](/wiki/Association_of_Southeast_Asian_Nations))1967[1969 race riots of Singapore](/wiki/1969_race_riots_of_Singapore)1969[Laju incident](/wiki/Laju_incident)1974[Operation Spectrum](/wiki/Operation_Spectrum)1987[Asian financial crisis](/wiki/1997_Asian_financial_crisis#Singapore)1997[Embassies attack plot](/wiki/Singapore_embassies_attack_plot)2001[H1N1 pandemic](/wiki/2009_swine_flu_pandemic_in_Asia#Singapore)2009–2010[Bus drivers' strike](/wiki/2012_Singapore_bus_drivers%27_strike)2012[Little India riot](/wiki/2013_Little_India_riot)2013[2018 North Korea–United States Singapore Summit](/wiki/2018_North_Korea%E2%80%93United_States_Singapore_Summit)2018[COVID-19 pandemic](/wiki/COVID-19_pandemic_in_Singapore)2020–2022By topic - [Timeline](/wiki/Timeline_of_Singaporean_history) - [Riots](/wiki/List_of_riots_in_Singapore) - [Military](/wiki/Military_history_of_Singapore) Singapore portal - v - t - e The establishment of a British trading post in [Singapore](/wiki/Singapore) in 1819 by [Sir Stamford Raffles](/wiki/Stamford_Raffles) led to its founding as a [British colony](/wiki/British_Empire) in 1824. This event has generally been understood to mark the founding of [colonial Singapore](/wiki/Singapore_in_the_Straits_Settlements), a break from its status as a port in ancient times during the [Srivijaya](/wiki/Srivijaya) and [Majapahit](/wiki/Majapahit) eras, and later, as part of the [Sultanate of Malacca](/wiki/Sultanate_of_Malacca) and the [Johor Sultanate](/wiki/Johor_Sultanate). ## Pre-colonial Singapore A significant port and settlement, known as [Temasek](/wiki/Temasek), later renamed [Singapura](/wiki/Kingdom_of_Singapura), existed on the island of Singapore in the 14th century. [Vietnamese](/wiki/Vietnam) records indicate possible diplomatic relationship between Temasek and Vietnam in the 13th century, and Chinese documents describe settlements there in the 14th century. It was likely a [vassal state](/wiki/Vassal_state) of both the [Majapahit](/wiki/Majapahit) Empire and the [Siamese](/wiki/Ayutthaya_Kingdom) at different times in the 14th century. Around the end of the 14th century, its ruler [Parameswara](/wiki/Parameswara_(king)) was attacked by either the [Majapahit](/wiki/Majapahit) or the [Siamese](/wiki/Thailand), forcing him to move on to [Melaka](/wiki/Melaka) where he founded the [Sultanate of Malacca](/wiki/Sultanate_of_Malacca). Archaeological evidence suggests that the main settlement on present-day [Fort Canning](/wiki/Fort_Canning) was abandoned around this time, although a small-scale trading settlement continued in Singapore for some time afterwards. Between the 16th and 19th centuries, the Malay archipelago was gradually taken over by the [European](/wiki/Europe) [colonial powers](/wiki/Colonialism), beginning with the [Portuguese](/wiki/Portugal) conquest of the [Malacca Sultanate](/wiki/Malacca_Sultanate) in 1511. In 1613, the Portuguese burnt down a trading settlement at the mouth of the [Singapore River](/wiki/Singapore_River), after which Singapore lapsed into insignificance in the history of the region for two hundred years. The early dominance of the Portuguese was challenged during the 17th century by the Dutch, who came to control most of the region's ports. The Dutch established a monopoly over trade within the archipelago, particularly in spices, then the region's most important product. Other colonial powers, including the British, were limited to a relatively minor presence in that period.[*citation needed*] Singapore's name comes from 'Singa Pura' which means Lion City in [Sanskrit](/wiki/Sanskrit). According to the Sejarah Melayu (Malay Annals), a [Sumatran](/wiki/Sumatra) prince called [Sang Nila Utama](/wiki/Sang_Nila_Utama) landed on Temasek (Singapore's old name) and saw a [Lion](/wiki/Lion) which is called 'Singa' in Malay. Thus he gave the [island](/wiki/Island) a new name, 'Singapura'. ## Raffles' landing and arrival In 1818, Sir Thomas Stamford Raffles was appointed Lieutenant Governor of [the British colony at Bencoolen](/wiki/Bencoolen_Presidency). Raffles believed that the British should find a way to challenge the dominance of the Dutch in the area. The trade route between China and [British India](/wiki/British_India) passed through the [Malacca Strait](/wiki/Malacca_Strait), and with the growing trade with [China](/wiki/China), that route would become increasingly important. However, the Dutch had tight control over the trade in the region and intended to enforce the exclusive rights of its company ships to trade, and that trade should be conducted at its entrepot [Batavia](/wiki/Batavia,_Dutch_East_Indies). British trading ships were heavily taxed at Dutch ports, stifling British trade in the region. Raffles reasoned that the way to challenge the Dutch was to establish a new port in the region. Existing [British](/wiki/United_Kingdom) ports were not in a strategic enough position to become major trading centres. [Penang](/wiki/Penang) was too far north of the southern narrow part of [Straits of Malacca](/wiki/Straits_of_Malacca) controlled by the Dutch, whereas [Bencoolen](/wiki/British_Bencoolen) faced the [Indian Ocean](/wiki/Indian_Ocean) near the [Sunda Strait](/wiki/Sunda_Strait), a much less important area as it is too far away from the main trading route. In 1818, Raffles managed to convince [Lord Hastings](/wiki/Francis_Rawdon-Hastings,_1st_Marquess_of_Hastings), the then [governor-general](/wiki/Governor-general) of India and his superior in the [British East India Company](/wiki/British_East_India_Company), to fund an expedition to establish a new British base in the region, but with the proviso that it should not antagonise the Dutch. Raffles settled on the island of Singapore because of its position at the southern tip of the Malay peninsula, near the Straits of Malacca, and its excellent natural harbor, fresh water supplies, and timber for repairing ships. Most importantly, it was unoccupied by the Dutch. Raffles' expedition arrived in Singapore on 29 January 1819 (although they landed on [Saint John's Island](/wiki/Saint_John%27s_Island) the previous day). He found a [Malay](/wiki/Malays_(ethnic_group)) settlement at the mouth of the [Singapore River](/wiki/Singapore_River), headed by [Temenggong Abdul Rahman](/wiki/Temenggong_Abdul_Rahman) for the Sultan of [Johor](/wiki/Johor). The Temenggong had originally moved to Singapore from [Johor](/wiki/Johor) in 1811 with a group of Malays, and when Raffles arrived, there were an estimated 150 people governed by the Temenggong, most of them Malays, with around 30 Chinese. Although the island was nominally ruled by Johor, the political situation was precarious for the Sultan of Johor at the time. The incumbent [Sultan of Johor](/wiki/Sultan_of_Johor), [Tengku Abdul Rahman](/wiki/Abdul_Rahman_Muazzam_Shah_of_Johor), was controlled by the Dutch and the [Bugis](/wiki/Bugis), and would never agree to a British base in Singapore. However, Abdul Rahman was Sultan only because his older brother, [Tengku Hussein, also known as Tengku Long](/wiki/Hussein_Shah_of_Johor), had been away in Pahang getting married when their father died. Hussein was then living in exile in the [Riau Islands](/wiki/Riau_Islands). ### Singapore Treaty: founding of modern Singapore With the Temenggong's help, Raffles smuggled Tengku Hussein to Singapore. He offered to recognize Hussein as the rightful Sultan of Johor, and provide him with a yearly payment; in return, Hussein would grant the British East India Company the right to establish a trading post on Singapore. In the agreement, Sultan Hussein would receive a yearly sum of 5,000 Spanish dollars, with the Temenggong receiving a yearly sum of 3,000 Spanish dollars. This agreement was ratified with the [Treaty of Singapore](/wiki/1819_Singapore_Treaty) signed on 6 February 1819. This is recognised as the official founding of modern Singapore and also the beginning as a British settlement. ## Early growth (1819–1826) Raffles returned to [British Bencoolen](/wiki/British_Bencoolen) (Sumatra) the day after the signing of the treaty, leaving Major [William Farquhar](/wiki/William_Farquhar) as the [Resident](/wiki/Resident_(title)) and Commandant of the new settlement, supported initially by some artillery and a single regiment of Indian soldiers. Establishing a trading port from scratch was in itself a daunting prospect, but Farquhar's administration was, in addition, practically unfunded, as Raffles did not wish his superiors to view Singapore as a liability. In addition, it was forbidden from earning revenue by imposing port duties, Raffles having decided from the outset that Singapore would be a [free port](/wiki/Free_port). In spite of these difficulties, the new colony rapidly proved to be a spectacular success. As news of the free port spread across the archipelago, Bugis, [Peranakan Chinese](/wiki/Peranakan), and [Arab](/wiki/Arab) traders flocked to the island, seeking to circumvent the Dutch trading restrictions. During the first year of operation, $400,000 ([Spanish dollars](/wiki/Spanish_dollar)) worth of trade passed through Singapore. It has been estimated that when Raffles arrived in 1819, the total population of the whole of Singapore was around a thousand, mostly of various local tribes. By 1821, the island's population had increased to around five thousand, and the trade volume was $8 million. By 1825, the population had passed the ten thousand mark, with a trade volume of $22 million. (By comparison, the trade volume for the long-established port of Penang was $8.5 million during the same year.) Raffles returned to Singapore in 1822. Although Farquhar had successfully led the settlement through its difficult early years, Raffles was critical of many of the decisions he had made. For instance, in order to generate much-needed revenue for the government, Farquhar had resorted to selling licenses for [gambling](/wiki/Gambling) and the sale of opium, which Raffles saw as social evils. Raffles was also appalled by the slave trade tolerated by Farquhar. Raffles arranged for the dismissal of Farquhar, who was replaced by [John Crawfurd](/wiki/John_Crawfurd). Raffles took over the administration himself, and set about drafting a set of new policies for the settlement. Raffles banned slavery, closed all gambling dens, prohibited the carrying of weapons, and imposed heavy taxation to discourage what he considered vices such as drunkenness and opium smoking. Raffles, dismayed at the disarray of the colony, also arranged to organise Singapore into functional and ethnic subdivisions under the drafted [Raffles Plan of Singapore](/wiki/Raffles_Plan_of_Singapore). ### Treaty of Friendship and Alliance Further agreements of the Malay chiefs would gradually erode their influence and control over Singapore. In December 1822, the Malay chiefs' claim to Singapore's revenue was changed to a monthly payment. On 7 June 1823, Raffles arranged for another agreement with the Sultan and Temenggong to buy out their judicial power and rights to the lands except for the areas reserved for the Sultan and Temenggong. They would give up their rights to numerous functions on the island, including the collection of port taxes, in return for lifelong monthly payments of $1,500 and $800 respectively. This agreement brought the island squarely under British law, with the proviso that it would take into account Malay customs, traditions and religious practices, \"where they shall not be contrary to reason, justice or humanity.\" A further treaty, the Treaty of Friendship and Alliance, was arranged by the second Resident John Crawfurd with the Malay chiefs and signed on 2 August 1824 to replace the Singapore Treaty. Singapore, including its nearby islands, was officially fully ceded to the East India Company, and in return, the chiefs would have their debts cancelled and receive an allowance for life, with each given an additional lump sum of 20,000 Spanish dollars. After installing John Crawfurd, an efficient and frugal administrator, as the new governor, Raffles departed for Britain in October 1823. He would never return to Singapore. Most of his personal possessions were lost after his ship, the *Fame*, caught fire and sank, and he died only a few years later, in 1826, at the age of 44. ## Straits Settlements The status of Singapore as a British possession was cemented by the [Anglo-Dutch Treaty of 1824](/wiki/Anglo-Dutch_Treaty_of_1824), which divided the Malay archipelago between the two colonial powers. The area north of the [Straits of Malacca](/wiki/Straits_of_Malacca), including [Penang](/wiki/Penang), [Malacca](/wiki/Malacca), and Singapore, was designated as the British sphere of influence, while the area south of the Straits was assigned to the Dutch. This division had far-reaching consequences for the region: modern-day [Malaysia](/wiki/Malaysia) and Singapore correspond to the British area established in the treaty, and modern-day [Indonesia](/wiki/Indonesia) to the Dutch. In 1826, Singapore was grouped together with Penang and Malacca into a single administrative unit, the [Straits Settlements](/wiki/Straits_Settlements), under the [British East India Company](/wiki/British_East_India_Company). ### Bibliography - [Miksic, John N.](/wiki/John_N._Miksic) (15 November 2013). *Singapore and the Silk Road of the Sea, 1300–1800*. NUS Press. [ISBN](/wiki/ISBN_(identifier)) 978-9971-69-574-3. - [Turnbull, C.M.](/wiki/C._M._Turnbull) (30 October 2009). *A History of Modern Singapore, 1819–2005*. NUS Press. [ISBN](/wiki/ISBN_(identifier)) 978-9971-69-430-2.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:04:51.205487",
  "title": "Founding years of modern Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Founding_years_of_modern_Singapore"
}