{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:04:57.181156"
  },
  "content": "Four Chinese-style mansions in Singapore The **Four Mansions** ([Chinese](/wiki/Chinese_language): 四大厝; [pinyin](/wiki/Pinyin): *Sì dà cuò*), also known as the **Four Grand Residences**, were four elaborate Chinese-style mansions built by four [Teochew](/wiki/Teochew_people) businessmen – [Tan Seng Poh](/wiki/Tan_Seng_Poh), [Seah Eu Chin](/wiki/Seah_Eu_Chin), [Wee Ah Hood](/wiki/Wee_Ah_Hood), and [Tan Yeok Nee](/wiki/Tan_Hiok_Nee) – in late 19th-century in [Singapore](/wiki/Singapore). Of the four houses only one, the [House of Tan Yeok Nee](/wiki/House_of_Tan_Yeok_Nee), has survived and since been declared as a [national monument](/wiki/National_monuments_of_Singapore). The earliest of the four was built by Tan Seng Poh in 1869. Subsequent houses by Seah, Wee, and Tan Yeok Nee were built in 1872, 1878, and 1885, respectively. Tan Seng Poh's house was used by both him and the Chinese consul to Singapore, being demolished in 1904 and replaced by shophouses. Seah's house was used by him and his family before it was demolished sometime after [World War II](/wiki/World_War_II), currently being the land which the [Parliament House](/wiki/Parliament_House,_Singapore) sits on. Wee would live in his house until his death in 1875, wherein his son rented it out for parties. It would be occupied by the [General Chinese Trade Affairs Association](/wiki/Singapore_Chinese_Chamber_of_Commerce_and_Industry) in 1906, where they planned to redevelop the land into a five-storey building. After the war, it would finally be redeveloped in 1963. Tan Yeok Nee's house would be his main residence before he sold it to the [Federated Malay States Railways](/wiki/Federated_Malay_States_Railways) for their nearby extension of their railway; he would move back to [Chaozhou](/wiki/Chaozhou), China. Ownership of his house would be passed around before eventually being given to the [Salvation Army](/wiki/The_Salvation_Army), who occupied the house from 1938 to 1991. Following its selling to Wing Tai in 1996, they would begin restoration efforts of the house in 1999. The current owner of the house is Indonesian businessman [Bachtiar Karim](/wiki/Bachtiar_Karim). ## House of Tan Seng Poh ### Background [Tan Seng Poh](/wiki/Tan_Seng_Poh) was born sometime in 1830 in [Ipoh](/wiki/Ipoh), Perak, Malaysia, when it was still apart of the [Federated Malay States](/wiki/Federated_Malay_States). His father was the first Kaptian China of Perak. When he turned nine, his sister brought him with her to [Singapore under British rule](/wiki/Singapore_in_the_Straits_Settlements), where he would receive his education. Tan's family became in-laws with the Gambier King when Tan's sister married [Seah Eu Chin](/wiki/Seah_Eu_Chin). Tan had a short stint managing the Seah family business, earning himself a reputation for being a major figure as a pepper and gambier merchant. Tan was also known for being the chief revenue farmer for the Singapore and Johore opium and spirit farms. Notably, Tan served on the [Municipal Commission](/wiki/Municipal_Commission_of_Singapore) as the first Chinese member for three terms and had close relations with the Sultan of Johore. He died on 18 December 1879. ### House Tan's house was built in 1869 at [Hill Street](/wiki/Hill_Street,_Singapore); his house was the first of the Four Mansions. Tan’s house occupied land measuring 21,512 square feet (1,998.53 square meters). The exact address of the Houe of Tan Poh Seng was 58 Hill Street. It was located between Hill Street and Armenian Street and it shared the same main entrance facing with Albion Hotel which was located at 59 Hill Street and the mansion’s back was alongside the Zetland House (18 Armenian Street). Armenian Street was aptly and colloquially known as *Seng Po toa chu au,* meaning behind Seng Poh’s grand mansion then. His house was also the office of Zuo Binglong, the first Chinese consul to Singapore after he was appointed by the [Qing government](/wiki/Government_of_the_Qing_dynasty) in 1881. Tan lived in his house till his death in 1879. Though the house was transferred to Tan’s wife Yeo Goh Neo and his two sons Tan Keng Swee and Tan Keng Wah, the house did not remain with the family due to mortgage debt. Its final ownership would land on Loke Yew who would eventually built a row of 17 shophouses and a street on the location of the House of Tan Poh Seng. Based on the timeline of events and the completion of the shophouse in early 1904, it was safe to say that the Houe of Tan Poh Seng was most likely demolished between late 1902 and 1903.No photographs of his house exist. ## House of Seah Eu Chin ### Background [Seah Eu Chin](/wiki/Seah_Eu_Chin) was born in 1805 and lived in a village in [Theng-hai](/wiki/Chenghai,_Shantou), [Swatow](/wiki/Swatow), China, before moving to Singapore in 1823. He travelled to Singapore aboard a [junk](/wiki/Junk_(ship)) while working as its clerk; he would continue working as a clerk for five years. He and his sons, Seah Cheo Seah and Seah Liang Seah would go on to have a very successful trading business and own multiple plots of land, on which Seah grew gambier and pepper. Such was his success that he became known as the Gambier King. He retired in 1864 and died on 23 September 1883. ### House The House of Seah Eu Chin occupied a land area of 18,677 square feet (1,735.15 square meters) and was located at 13 Boat Quay, alongside the Singapore River. It was then known as *Chin Heng toa cchu* or Chin Heng Grand Mansion, with *Chin Heng* being the name of Seah’s business. The House of Seah Eu Chin was a courtyard mansion-style that was made up of both [Straits Settlements](/wiki/Straits_Settlements) and [Chaozhou](/wiki/Chaozhou) architectural styles. Houses in these styles typically included a [Teochew](/wiki/Teochew_people) gate which led to the foreyard of the house, which had a storied shophouse look instead of Chaozhou [typology](/wiki/Building_typology). Upon his death in 1883, the property stayed with the Seah family before Seah's grandsons, Seah Eng Kiat and Seah Eng Kun sold it on 30 December 1918 to Guthrie and Company Limited for $392,217. Between 1938 and 1941, in the midst of proposing new building plans to the Municipal authorities to build new godowns on the premise, the House of Sah Eu Chin was demolished during this time. The land was eventually acquired by the State on 30 September 1971, and today sits the Parliament House. ## House of Wee Ah Hood ### Background [Wee Ah Hood](/wiki/Wee_Ah_Hood) was born in 1828. His father was Wee Ah Heng, who plied the Selangor-Singapore route as a trader. His father died when Wee Ah Hood was six months old. Wee worked his way up from as a humble assistant in a cloth-dealer’s shop along Telok Ayer Street to being a prominent pepper and gambier trader. Wee Ah Hood was also the father of Wee Kim Yam who was a highly successful businessman actively involved in Chinese public affairs in Singapore. Wee Ah Hood would eventually pass away in his home on 12 March 1975. ### House Wee Ah Hood's house stood diagonally opposite Tan Seng Poh’s mansion. Wee's house was built and located at 49 Hill Street in 1878 (presently 47 Hill Street), coming to be known as *Dafudi* ([Chinese](/wiki/Chinese_language): 大夫第; [pinyin](/wiki/Pinyin): *Dàfū Dì*; lit. 'Imperial Official's Residence'). Following his death in 1875, the ownership of the house was transferred to his wife Khoo Chwee Neo and his sons. Between the late 1889 to April 1892, Wee Ah Hood’s sons had rented out the house to Knight & Co., a furniture-maker as a factory and a showroom. [his house would be rented out for parties by his son Wee Kim Yam. Despite selling the house in 30 December 1899 to Syed Mohamed bin Ahmed al-Sagoff for $22,000, Wee Kim Yam would in turn rent it back from Sagoff for $131 a month. In doing so, Wee Kim Yam would rent it out to St.Mary’s College to be used by St. Mary's Home, a boarding home and kindergarten for girls from January 1900 to April 1905. Eventually, the sale of the house would be finalized and ownership transferred to the Singapore Chinese Chamber of Commerce (SCCC) on 11 April 1912, and SCCC is still residing at this site in this present day. In 1939, Singaporean businessman [Tan Lark Sye](/wiki/Tan_Lark_Sye) and the Chamber's President [Lee Kong Chian](/wiki/Lee_Kong_Chian) noted plans to build a five-storey building over the house; these plans would later be halted due to World War II. Following the end of the war, a few attempts at reconstruction would happen before eventually, in 1963, replacing Wee's house with a new building. Wee's house was said to have a similar architectural style to Seah's, being a mix between Straits Settlements and Chaozhou architecture. His house also included a Teochew gate in front of his foreyard and a storied shophouse appearance. Based on a set of 1934 alteration plans, the symmetrical layout of the house refers “to the four doubled-pitched gable ends that recall the Chinese character for gold”. The spatial interior arrangements of the house had Confucian underpinnings of family hierarchy, harmony, continuity and order. By 1958, the building was in such dire conditions, the SCCC committee members raised their concerns and calls for building a new building [XXV]. Despite the historical value of the house, the final decision to demolish and build a taller building was enacted and such works started in June 1961. ## House of Tan Yeok Nee ### Background [Tan Yeok Nee](/wiki/Tan_Hiok_Nee) was born in 1827 in a village in [Haiyang](/wiki/Haiyang), China. Following the death of his father, he would work as [coolie](/wiki/Coolie) in [Nanyang](/wiki/Nanyang_(region)), eventually paying off his [bond](/wiki/Bond_(finance)) and moving to Singapore. Tan would initially [peddle](/wiki/Peddler) cloth before, by 1866, selling gambier and pepper and owning multiple [grants](/wiki/Grant_(money)) in Johor, which helped make his money. He died on 21 May 1902. ### House Tan built two houses, one in Chaozhou, China, and one in Tank Road, Singapore, around the same time in 1870. His houses were known as *Zhizhengdi* ([Chinese](/wiki/Chinese_language): 资政第; [pinyin](/wiki/Pinyin): *Zīzhèng Dì*; lit. 'Second Level Official Residence'). His Chaozhou house was completed in 1883 while his Tank Road house in 1882. He initially lived in his Tank Road house before it was disrupted by the construction of the [Federated Malay States Railways](/wiki/Federated_Malay_States_Railways)' (FMSR) [Tank Road railway station](/wiki/Tank_Road_railway_station), which was right by his house. He eventually sold his house to the FMSR and moved back to Chaozhou, where he lived in his Chaozhou house until his death in 1902. His house was initially used by the Tank Road railway station's stationmaster in 1905 before the government gave the ownership of the house to St. Mary's Home the following year, at a cost of [S$](/wiki/Singapore_dollar)20,000. In 1907, St. Mary's Home expanded the house by adding a two-storey wing. Following the dissolution of the Home in 1932, it was used by the [Salvation Army](/wiki/The_Salvation_Army) in 1938 and renamed to Temple House. After World War II and the [Japanese occupation](/wiki/Japanese_occupation_of_Singapore), the Salvation Army would repair damage to the house and it was reopened in 1951 by [Governor](/wiki/Governor_of_Singapore) [Franklin Gimson](/wiki/Franklin_Gimson), as the Salvation Army's Malayan Headquarters. The Salvation Army would sell the house in 1991 to Teo Lay Swee for S$20 million, who sold the house in 1996 to Wing Tai for S$380 million. Wing Tai would begin restoration efforts of the house in 1999 and leased it out to the [University of Chicago Graduate School of Business](/wiki/University_of_Chicago_Graduate_School_of_Business) the following year. The University would occupy the house from 2000 to 2015, during which the ownership of the house was passed around, being sold to Pua Seck Guan in 2013 for just under S$90 million. In 2022, the house was sold to Indonesian businessman [Bachtiar Karim](/wiki/Bachtiar_Karim). Tan's house is the only surviving house of the Four Mansions; it was gazetted a [national monument](/wiki/National_monuments_of_Singapore) by the government in 1974. His house is the only one to have been built in the Chaozhou architectural style, and he brought in builders from Chaozhou to replicate a house that would resemble those in Chaozhou. It took around three to four years and a hundred workers to build his house, costing S$300,000. It was built with *ermatuoche* ([Chinese](/wiki/Chinese_language): 二马拖车; [pinyin](/wiki/Pinyin): *Èr mǎ tuō chē*; lit. 'Two Houses with Carriage') typology, which included a [courtyard house](/wiki/Courtyard_house) supported by elongated structures around it. ### Citations ### Bibliography - [Song, Ong Siang](/wiki/Song_Ong_Siang) (2020) [First published 1923]. *One Hundred Years' History of the Chinese in Singapore* (Annotated ed.). [World Scientific](/wiki/World_Scientific). [doi](/wiki/Doi_(identifier)):10.1142/11755. [ISBN](/wiki/ISBN_(identifier)) 9789811217630. - Tan, Gia Lim (2018). *An Introduction to the Culture and History of the Teochews in Singapore*. [World Scientific](/wiki/World_Scientific). [doi](/wiki/Doi_(identifier)):10.1142/10967. [ISBN](/wiki/ISBN_(identifier)) 9789813239357.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:04:57.180589",
  "title": "Four Mansions",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Four_Mansions"
}