{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:04:55.513235"
  },
  "content": "Economies of South Korea, Taiwan, Singapore and Hong Kong The **Four Asian Tigers** (a.k.a. the **Four Asian Dragons** or **Four Little Dragons** in Chinese and Korean) are the developed Asian economies of [Hong Kong](/wiki/Economy_of_Hong_Kong), [Singapore](/wiki/Economy_of_Singapore), [South Korea](/wiki/Economy_of_South_Korea), and [Taiwan](/wiki/Economy_of_Taiwan). Between the early [1950s](/wiki/1950s) and [1990s](/wiki/1990s), they underwent rapid industrialization and maintained exceptionally high growth rates of more than 7 percent a year. By the early 21st century, these economies had developed into [high-income economies](/wiki/World_Bank_high-income_economy), specializing in areas of competitive advantage. Hong Kong and Singapore have become leading international [financial centres](/wiki/Financial_centre), whereas South Korea and Taiwan are leaders in manufacturing [electronic](/wiki/Electronics) components and devices; Taiwan now produces the most advanced [semiconductor chips](/wiki/Semiconductor) in the world; South Korea has also developed into a major global arms manufacturer. Large institutions have pushed to have them serve as role models for many [developing countries](/wiki/Developing_country), especially the [Tiger Cub Economies](/wiki/Tiger_Cub_Economies) of Southeast Asia. In 1993, a [World Bank](/wiki/World_Bank) report *The East Asian Miracle* credited [neoliberal](/wiki/Neoliberalism) policies with the economic boom, including the maintenance of [export-oriented policies](/wiki/Export-oriented_industrialization), low taxes and minimal [welfare states](/wiki/Welfare_state). Other institutional and empirical analyses have argued that extensive [state intervention](/wiki/Economic_interventionism) and industrial policy had a much greater influence than the World Bank suggested. ## Overview Prior to the [1997 Asian financial crisis](/wiki/1997_Asian_financial_crisis), the growth of the Four Asian Tiger economies (commonly referred to as \"the Asian Miracle\") has been attributed to export oriented policies and strong development policies. Unique to these economies were the sustained rapid growth and high levels of equal income distribution. A World Bank report suggests two development policies among others as sources for the Asian miracle: factor accumulation and macroeconomic management. A paper in [The American Journal of Economics and Sociology](/wiki/The_American_Journal_of_Economics_and_Sociology) attributes the Four Tigers' success to multiple factors: 1. A transition from [import substitution industrialization](/wiki/Import_substitution_industrialization) (ISI) to [export-oriented industrialization](/wiki/Export-oriented_industrialization) (EOI); 2. Heavy [state intervention](/wiki/State_intervention) within a [market-oriented economy](/wiki/Market_economy), including state investment in agriculture and industry, [land reform](/wiki/Land_reform), and education, and policies to encourage a high rate of private investment; 3. US support through [free-trade](/wiki/Free_trade) policies, [public policy consultation](/wiki/Consultant), and [military backing](/wiki/United_States_military_aid). Other sources have noted that all of the Four Asian Tigers practiced authoritarianism during the peak of their economic growth, although they have since moved to [hybrid](/wiki/Hybrid_regime) or [liberal democratic](/wiki/Liberal_democracy) regimes. The Hong Kong economy was the first out of the four to undergo industrialization with the development of a textile industry in the 1950s. By the 1960s, manufacturing in the British colony had expanded and diversified to include clothing, electronics, and plastics for [export orientation](/wiki/Export-oriented_industrialization). Following Singapore's independence from Malaysia, the [Economic Development Board](/wiki/Economic_Development_Board) formulated and implemented national economic strategies to promote the country's manufacturing sector. [Industrial estates](/wiki/Industrial_estate) were set up and foreign investment was attracted to the country with tax incentives. Meanwhile, Taiwan and South Korea began to industrialize in the mid-1960s with heavy government involvement including initiatives and policies. Both countries pursued export-oriented industrialization as in Hong Kong and Singapore. The four countries were inspired by Japan's evident success, and they collectively pursued the same goal by investing in the same categories: infrastructure and education. They also benefited from foreign trade advantages that set them apart from other countries, most significantly economic support from the United States, including Free [Development aid](/wiki/Development_aid); part of this is manifested in the proliferation of American electronic products in common households of the Four Tigers. By the end of the 1960s, levels in physical and [human capital](/wiki/Human_capital) in the four economies far exceeded other countries at similar levels of development. This subsequently led to a rapid growth in per capita income levels. While high investments were essential to their economic growth, the role of human capital was also important. Education in particular is cited as playing a major role in the Asian economic miracle. The levels of education enrollment in the Four Asian Tigers were higher than predicted given their level of income. By 1965, all four nations had achieved universal primary education. South Korea in particular had achieved a secondary education enrollment rate of 88% by 1987. There was also a notable decrease in the gap between male and female enrollments during the Asian miracle. Overall these advances in education allowed for high levels of literacy and cognitive skills. The creation of stable [macroeconomic](/wiki/Macroeconomic) environments was the foundation upon which the Asian miracle was built. Each of the Four Asian Tiger states managed, to various degrees of success, three variables in: [budget deficits](/wiki/Budget_deficits), [external debt](/wiki/External_debt) and [exchange rates](/wiki/Exchange_rates). Each Tiger nation's budget deficits were kept within the limits of their financial limits, as to not destabilize the macro-economy. South Korea in particular had deficits lower than the [OECD](/wiki/OECD) average in the 1980s. External debt was non-existent for Hong Kong, Singapore and Taiwan, as they did not borrow from abroad. Although South Korea was the exception to this – its debt to GNP ratio was quite high during the period 1980–1985, it was sustained by the country's high level of exports. Exchange rates in the Four Asian Tiger nations had been changed from long-term fixed rate regimes to fixed-but-adjustable rate regimes with the occasional steep devaluation of managed floating rate regimes. This active exchange rate management allowed the Four Tiger economies to avoid exchange rate appreciation and maintain a stable real exchange rate. Export policies have been the de facto reason for the rise of these Four Asian Tiger economies. The approach taken has been different among the four nations. Hong Kong, and Singapore introduced trade regimes that were neoliberal in nature and encouraged free trade, while South Korea and Taiwan adopted mixed regimes that accommodated their own export industries. In Hong Kong and Singapore, due to small domestic markets, domestic prices were linked to international prices. South Korea and Taiwan introduced export incentives for the traded-goods sector. The governments of Singapore, South Korea and Taiwan also worked to promote specific exporting industries, which were termed as an export push strategy. All these policies helped these four nations to achieve a growth averaging 7.5% each year for three decades and as such they achieved [developed country](/wiki/Developed_country) status. Dani Rodrik, economist at the John F. Kennedy School of Government at Harvard University, has in a number of studies argued that state intervention was important in the East Asian growth miracle. He has argued \"it is impossible to understand the East Asian growth miracle without appreciating the important role that government policy played in stimulating private investment\". ### 1997 Asian financial crisis The Tiger economies experienced a setback in the [1997 Asian financial crisis](/wiki/1997_Asian_financial_crisis). Hong Kong came under intense speculative attacks against its stock market and currency necessitating unprecedented market interventions by the state [Hong Kong Monetary Authority](/wiki/Hong_Kong_Monetary_Authority). South Korea was hit the hardest as its foreign debt burdens swelled resulting in its currency falling between 35 and 50%. By the beginning of 1997, the stock market in Hong Kong, Singapore, and South Korea also saw losses of at least 60% in dollar terms. Singapore and Taiwan were relatively unscathed. The Four Asian Tigers recovered from the 1997 crisis faster than other countries due to various economic advantages including their high savings rate (except South Korea) and their openness to trade. ### 2008 financial crisis The export-oriented tiger economies, which benefited from American consumption, were hit hard by the [2008 financial crisis](/wiki/2008_financial_crisis). By the fourth quarter of 2008, the GDP of all four nations fell by an average annualized rate of around 15%. Exports also fell by a 50% annualized rate. Weak domestic demand also affected the recovery of these economies. In 2008, retail sales fell 3% in Hong Kong, 6% in Singapore and 11% in Taiwan. As the world recovered from the [2008 financial crisis](/wiki/2008_financial_crisis), the Four Asian Tiger economies have also rebounded strongly. This is due in no small part to each country's government fiscal stimulus measures. These fiscal packages accounted for more than 4% of each country's GDP in 2009. Another reason for the strong bounce back is the modest corporate and household debt in these four nations. A 2011 article published in *Applied Economics Letters* by financial economist Mete Feridun of University of Greenwich Business School and his international colleagues investigates the causal relationship between financial development and economic growth for Thailand, Indonesia, Malaysia, the Philippines, China, India and Singapore for the period between 1979 and 2009, using [Johansen cointegration tests](/wiki/Johansen_cointegration_test) and vector [error correction models](/wiki/Error_correction_model). The results suggest that in the case of Indonesia, Singapore, the Philippines, China and India financial development leads to economic growth, whereas in the case of Thailand there exists a bidirectional causality between these variables. The results further suggest that in the case of Malaysia, financial development does not seem to cause economic growth. ## Gross domestic product (GDP) In 2018, the combined economy of the Four Asian Tigers constituted 3.46% of the world's economy with a total Gross domestic product (GDP) of 2,932 billion US dollars. The GDP in Hong Kong, Singapore, South Korea and Taiwan was worth 363.03 billion, 361.1 billion, 1,619.42 billion and 589.39 billion US dollars respectively in 2018, which represented 0.428%, 0.426%, 1.911% and 0.696% of the world economy. Together, their combined economy surpassed the United Kingdom's GDP of 3.34% of the world's economy some time in the mid-2010s. In 2021, each of the Four Asian Tigers' GDP Per capita (nominal) exceeds $30,000 according to [IMF](/wiki/IMF)'s estimate. GDP per capita (2011 international $)Year020,00040,00060,00080,000100,0001820191819381960198020002020Hong Kong GDP per capitaSingapore GDP per capitaSouth Korea GDP per capitaTaiwan GDP per capitaGDP per capita trends of the Four Asian TigersSource: Maddison Project DatabaseMaddison GDP per capita of the Four Asian Tigers View chart definition. - Skylines of the Four Tigers ## Education and technology The four governments focused on investing heavily in their infrastructure as well as education to benefit their country through skilled workers and higher level jobs such as engineers and doctors. The policy was generally successful and helped develop the countries into more [advanced](/wiki/Developed_country#IMF_advanced_economies) and [high-income](/wiki/High_income_economy) industrialized [developed countries](/wiki/Developed_countries). For example, all four countries have become global education centers with Singapore, Taiwan, South Korea and Hong Kong high school students scoring well on math and science exams such as the [PISA exam](/wiki/Programme_for_International_Student_Assessment)[*citation needed*] and with Taiwanese students winning several medals in International Olympiads. In relation to higher-level education, there are many prestigious colleges as in most developed countries. In the 2023 [QS University Rankings](/wiki/QS_World_University_Rankings), the top 100 universities in the world include 5 universities from Hong Kong, 6 universities from South Korea, 2 from Singapore and 1 from Taiwan. Despite the small populations and the relatively short history of universities in the four countries, they together account for a quarter of the top 100 universities located outside of the United States or the United Kingdom. Notable schools include the [National Taiwan University](/wiki/National_Taiwan_University), [Chinese University of Hong Kong](/wiki/Chinese_University_of_Hong_Kong), [The Hong Kong University of Science and Technology](/wiki/The_Hong_Kong_University_of_Science_and_Technology), [Seoul National University](/wiki/Seoul_National_University), [National University of Singapore](/wiki/National_University_of_Singapore), [Nanyang Technological University](/wiki/Nanyang_Technological_University) and [University of Hong Kong](/wiki/University_of_Hong_Kong). The cities of Hong Kong, Singapore and Seoul are prominent hubs in higher education. ## Cultural basis The role of [Confucianism](/wiki/Confucianism) has been used to explain the success of the Four Asian Tigers. This conclusion is similar to the [Protestant work ethic](/wiki/Protestant_work_ethic) theory in the West promoted by German sociologist [Max Weber](/wiki/Max_Weber) in his book *[The Protestant Ethic and the Spirit of Capitalism](/wiki/The_Protestant_Ethic_and_the_Spirit_of_Capitalism)*. The [culture of Confucianism](/wiki/East_Asian_cultural_sphere) is said to have been compatible with industrialization because it valued stability, hard work, discipline, and loyalty and respect towards authority figures. There is a significant influence of Confucianism on the corporate and political institutions of the Asian Tigers. Prime Minister of Singapore [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) advocated [Asian values](/wiki/Asian_values) as an alternative to the influence of Western culture in Asia. This theory was not without its critics. There was a lack of mainland Chinese economic success during the same time frame as the Four Tigers, and yet China was the birthplace of Confucianism. During the [May Fourth Movement](/wiki/May_Fourth_Movement) of 1919, Confucianism was blamed for China's inability to compete with Western powers. In 1996, the economist Joseph Stiglitz pointed out that, ironically, \"not that long ago, the Confucian heritage, with its emphasis on traditional values, was cited as an explanation for why these countries had not grown.\" ## Territory and region data Parts of this article (those related to Territory and region data) need to be **updated**. Please help update this article to reflect recent events or newly available information. *(June 2024)* ### Credit ratings Country or [territory](/wiki/Territory_(country_subdivision))[Fitch](/wiki/Fitch_Ratings)[Moody's](/wiki/Moody%27s_Investors_Service)[S&P](/wiki/Standard_%26_Poor%27s)Hong KongAAAa2AA+SingaporeAAAAaaAAASouth KoreaAA−Aa2AATaiwanAAAa3AA+ ### Demographics Country or [territory](/wiki/Territory_(country_subdivision))[Area](/wiki/List_of_countries_and_outlying_territories_by_total_area) (km2)[Population](/wiki/List_of_countries_by_population) (2020)[Population density](/wiki/List_of_countries_by_population_density) (per km2)[Life expectancy at birth](/wiki/List_of_countries_by_life_expectancy) (2020)[Median age](/wiki/List_of_countries_by_median_age) (2020)[Birth rate](/wiki/List_of_sovereign_states_and_dependent_territories_by_birth_rate) (2015)[Death rate](/wiki/List_of_sovereign_states_and_dependent_territories_by_mortality_rate) (2023)[Fertility rate](/wiki/List_of_sovereign_states_and_dependencies_by_total_fertility_rate) (2020)[Net migration rate](/wiki/List_of_countries_by_net_migration_rate) (2015–2020)[Population growth rate](/wiki/List_of_countries_by_population_growth_rate) (2023)Hong Kong1,1067,496,9817,14085.29450.8%0.80%0.870.40%0.15Singapore7285,850,3428,35884.07420.9%0.42%1.100.47%0.90South Korea100,21051,269,18552783.50440.8%0.73%0.840.02%0.23Taiwan36,19723,816,77567381.04420.8%0.80%0.990.13%0.03 ### Economy Country or [territory](/wiki/Territory_(country_subdivision))GDP (millions of USD, 2024)GDP per capita (USD, 2024)[Trade](/wiki/International_trade) (billions of USD, 2023)(billions of USD, 2023)[Industrial growth rate (%)](/wiki/List_of_countries_by_industrial_production_growth_rate) (2023)Currency[Nominal](/wiki/List_of_countries_by_GDP_(nominal))[PPP](/wiki/List_of_countries_by_GDP_(PPP))[Nominal](/wiki/List_of_countries_by_GDP_(nominal)_per_capita)[PPP](/wiki/List_of_countries_by_GDP_(PPP)_per_capita)[Exports](/wiki/List_of_countries_by_exports)[Imports](/wiki/List_of_countries_by_imports)Hong Kong422,057569,83053,16575,1281,416673.3669.15.1[Hong Kong dollar](/wiki/Hong_Kong_dollar)Singapore561,725879,98089,370148,186917778.0475.5-2.9[Singapore dollar](/wiki/Singapore_dollar)South Korea1,947,1333,260,00036,13262,9601,663769.5738.4-1.1[South Korean won](/wiki/South_Korean_won)Taiwan814,4381,840,00033,23479,0311,005536.1437.33.9[New Taiwan dollar](/wiki/New_Taiwan_dollar) ### Quality of life Country or [territory](/wiki/Territory_(country_subdivision))[Human Development Index](/wiki/List_of_countries_by_Human_Development_Index) (2021 data)[Income inequality](/wiki/List_of_countries_by_income_equality) by [Gini coefficient](/wiki/Gini_coefficient)[Median household income](/wiki/Developed_country#Gallup_median_household_and_per-capita_income) (2013), USD PPP[Median per-capita income](/wiki/Developed_country#Gallup_median_household_and_per-capita_income) (2013), USD PPP[Global Well Being Index](/wiki/Gallup_(company)) (2010), % thrivingHong Kong0.952 (4th)53.9 (2016)35,4439,70519%Singapore0.939 (12th)46.4 (2014)32,3607,34519%South Korea0.925 (19th)34.1 (2015)40,86111,35028%Taiwan0.926 (–)[a]33.6 (2014)32,7626,88222% ### Technology Country or [territory](/wiki/Territory_(country_subdivision))[Average Internet connection speed](/wiki/List_of_countries_by_Internet_connection_speeds) (2020)[Smartphone usage](/wiki/List_of_countries_by_smartphone_penetration) (2016)[Use of renewable electricity](/wiki/List_of_countries_by_electricity_production_from_renewable_sources)Hong Kong21.8 Mbit/s87%0.3%Singapore47.5 Mbit/s100%3.3%South Korea59.6 Mbit/s89%2.1%Taiwan28.9 Mbit/s78%4.4% ### Politics Country or [territory](/wiki/Territory_(country_subdivision))[Democracy Index](/wiki/Democracy_Index) (2022)[Press Freedom Index](/wiki/Press_Freedom_Index) (2023)[Corruption Perceptions Index](/wiki/Corruption_Perceptions_Index) (2022)[Global Competitiveness Index](/wiki/Global_Competitiveness_Report) (2019)[Ease of doing business index](/wiki/Ease_of_doing_business_index) (2020)[Property rights index](/wiki/Americans_for_Tax_Reform) (2015)[Bribe Payers Index](/wiki/Bribe_Payers_Index) (2011)Current political statusHong Kong5.2844.867683.1Very Easy (3rd)7.67.6Executive-led Special Administrative Region of the People's Republic of ChinaSingapore6.2247.888584.8Very Easy (2nd)8.18.3Parliamentary RepublicSouth Korea8.0370.836379.6Very Easy (5th)5.97.9Presidential RepublicTaiwan8.9975.546880.2Very Easy (15th)6.97.5Semi-Presidential Republic ### Organizations and groups Country or [territory](/wiki/Territory_(country_subdivision))UN[WTO](/wiki/World_Trade_Organization)[OECD](/wiki/Organisation_for_Economic_Co-operation_and_Development)[DAC](/wiki/Development_Assistance_Committee)[APEC](/wiki/Asia-Pacific_Economic_Cooperation)[ADB](/wiki/Asian_Development_Bank)[AIIB](/wiki/Asian_Infrastructure_Investment_Bank)[SEACEN](/wiki/South_East_Asian_Central_Banks_Research_and_Training_Centre)[G20](/wiki/G-20_major_economies)[EAS](/wiki/East_Asia_Summit)[ASEAN](/wiki/Association_of_Southeast_Asian_Nations)Hong KongNYNNYYYYNNNSingaporeYYNNYYYYNYYSouth KoreaYYYYYYYYYYY ([APT](/wiki/ASEAN_Plus_Three))TaiwanN[b]YNNYYNYNNN - Hong Kong portal - Singapore portal - South Korea portal - Taiwan portal - Economics portal - [Developed country](/wiki/Developed_country) - [Developmental state](/wiki/Developmental_state) - [The Pacific Pumas](/wiki/The_Pacific_Pumas) - [Economic miracle](/wiki/Economic_miracle) (full list of miracles and \"tigers\") - [Asian Century](/wiki/Asian_Century) - [Baltic Tiger](/wiki/Baltic_Tiger) - [Celtic Tiger](/wiki/Celtic_Tiger) - [Tatra Tiger](/wiki/Tatra_Tiger) - [Newly industrialized country](/wiki/Newly_industrialized_country) - [Gulf Tiger](/wiki/Gulf_Tiger) - [Tiger economy](/wiki/Tiger_economy) - [Korean Wave](/wiki/Korean_Wave) - [Miracle on the Han River](/wiki/Miracle_on_the_Han_River) (South Korea) - [Japanese economic miracle](/wiki/Japanese_economic_miracle) - [Taiwan Miracle](/wiki/Taiwan_Miracle) - [Taiwanese Wave](/wiki/Taiwanese_Wave) - [Reform and opening up](/wiki/Reform_and_opening_up) - [Tiger Cub Economies](/wiki/Tiger_Cub_Economies) - [List of country groupings](/wiki/List_of_country_groupings) - [List of multilateral free-trade agreements](/wiki/List_of_multilateral_free-trade_agreements) ## Notes - Vogel, Ezra F. (1991). *The Four Little Dragons: The Spread of Industrialization in East Asia*. Cambridge, MA: Harvard University Press. [ISBN](/wiki/ISBN_(identifier)) 9780674315266. - Hye-Kyung Lee & Lorraine Lim, *Cultural Policies in East Asia: Dynamics between the State, Arts and Creative Industries* (Palgrave Macmillan, 2014). - H. Horaguchi & K. Shimokawa, *Japanese Foreign Direct Investment and the East Asian Industrial System: Case Studies from the Automobile and Electronics Industries (*Springer Japan, 2002). - Kim, Eun Mee (1998). *The Four Asian Tigers: Economic Development and the Global Political Economy*. Emerald Publishing. [ISBN](/wiki/ISBN_(identifier)) 9780124074408. - BBC report on the Asian Tigers in the aftermath of the 1997 Financial Crisis (includes map of the Asian Tigers) - ASEAN tigers - The Elephant at the Gate in *China Economic Review*\n",
  "language": "en",
  "processed_at": "2026-01-12T11:04:55.512779",
  "title": "Four Asian Tigers",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Four_Asian_Tigers"
}