{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:05:09.180785"
  },
  "content": "Thai-Singaporean food & beverage, publishing, and printing conglomerate **Fraser and Neave, Limited** (**F&N**) is a Thai-Singaporean [food and beverage](/wiki/Food_and_beverage), [publishing](/wiki/Publishing) and [printing](/wiki/Printing) industries conglomerate. It is owned by [Charoen Sirivadhanabhakdi](/wiki/Charoen_Sirivadhanabhakdi). Listed in Singapore, the group's subsidiaries include F&N Foods, F&N Creameries, Warbug Group, Yoke Food Industries and Times Publishing. As of 2023, F&N had total assets of over S$5 billion and employed over 7,200 people in 11 countries. In January 2014, through a distribution in specie and re-listing of **Frasers Centrepoint Limited** by way of introduction on the Singapore stock exchange, the group de-merged its properties business. ## History ### Founding and early history The company (Singapore and Straits Aerated Water Company) was formed in 1883 by John Fraser and David Chalmers Neave, who diversified from their printing business (Singapore and Straits Printing Office) to pioneer the aerated water business in Southeast Asia in 1883. In 1898, a new public company was formed and the two businesses were sold to the new company, named Fraser & Neave (F&N), for $290,000 in cash and shares. ### Diversification, restructuring, and expansion In 1931, Fraser & Neave formed a joint venture with Holland's [Heineken](/wiki/Heineken_International) to venture into the brewing business. The brewery, Malayan Breweries Limited produced [Tiger Beer](/wiki/Tiger_Beer), and later acquired [Archipelago Brewery](/wiki/Archipelago_Brewery), which produced Anchor Beer. In 1936, F&N acquired the Singapore, Malaya and Brunei franchise rights for [Coca-Cola](/wiki/Coca-Cola) drinks. Alongside its own range of F&N branded drinks, the company went on to acquire the rights to other [PepsiCo](/wiki/PepsiCo), Coca-Cola, and [Cadbury Schweppes](/wiki/Cadbury_Schweppes_Americas_Beverages) brands – such as – [7-Up](/wiki/7-Up), [Fanta](/wiki/Fanta), and [Sunkist](/wiki/Sunkist_(soft_drink)). In 1990, Malayan Breweries changed its name to [Asia Pacific Breweries](/wiki/Asia_Pacific_Breweries). ### Modern history In 1999, F&N purchased a 20% stake in Times Publishing before taking majority control of the company in 2000, with the entire acquisition costing around S$570 million. This put F&N into the printing, publishing, retail bookstore, sales and distribution, education, internet and conference organisation businesses. In 2001, F&N took both Times and Centrepoint Properties private. In 2006, the Singapore government investment company [Temasek Holdings](/wiki/Temasek_Holdings) took a 14.9%, S$900 million stake in F&N, becoming F&N's second-largest investor. In 2008, F&N reorganised its management structure and appointed chief executives for three of its core businesses: food & beverage; property; and printing and publishing. On 27 June 2007, F&N Singapore launched a new logo for its food and beverage business in order to reach the Asia-Pacific market. In 2010, Temasek's entire stake was sold to Japan's [Kirin Holdings](/wiki/Kirin_Company) for S$1.33 billion. On 1 September 2011, the three-quarter-century partnership between F&N and Coca-Cola in Malaysia, Singapore and Brunei ended. F&N no longer had the franchise rights to manufacture and market Coca-Cola beverages. In July 2012, [ThaiBev](/wiki/ThaiBev) acquired a 22% stake in F&N from [Oversea-Chinese Banking Corporation](/wiki/Oversea-Chinese_Banking_Corporation), raising its stake to 24.1%. In August 2012, F&N accepted an offer from Heineken to acquire its stake in [Asia Pacific Breweries](/wiki/Asia_Pacific_Breweries) for US$4.1 billion. In September 2012, ThaiBev and its partner TCC Assets, both controlled by [Thai Chinese](/wiki/Thai_Chinese) billionaire [Charoen Sirivadhanabhakdi](/wiki/Charoen_Sirivadhanabhakdi), made a move to thwart efforts by Heineken to acquire control of Asia Pacific Breweries, with a S$8.8 billion (US$7.1 billion) cash offer for F&N. Other companies, such as, Coca-Cola and Kirin Holdings, also showed interest for the soft-drink and food businesses of F&N, in order to expand their operations in Asia. On 28 September 2012, F&N shareholders approved the sale of Asia Pacific Breweries to Heineken during the extraordinary general meeting held. In 2013, Kirin Holdings sold its 15% stake in F&N to TCC (ThaiBev). ### Frasers Centrepoint Limited and Frasers Property (2013–present) Charoen Sirivadhanabhakdi expanded his ThaiBev drinks and property empire to include about two-thirds of this Singaporean [conglomerate](/wiki/Conglomerate_(company)). This was possible after [Japan](/wiki/Japan)'s [Kirin Brewery Company](/wiki/Kirin_Brewery_Company) sold its 15% stake for US$1.6 billion to Sirivadhanabhakdi. In January 2014, through a distribution in specie and re-listing of **Frasers Centrepoint Limited** by way of introduction on the Singapore stock exchange, the group de-merged its properties business. In February 2018, **Frasers Centrepoint Limited** was renamed [Frasers Property](/wiki/Frasers_Property) globally. ## Products - [100Plus](/wiki/100Plus) - Borneo - [Carnation](/wiki/Carnation_(brand)) (in Malaysia, Singapore, Brunei and Thailand, under license from [Nestlé](/wiki/Nestl%C3%A9)) - CocoLife - Daisy (a sweetened condensed creamer brand for Philippine distribution) - EST Cola - Farmhouse - Fruit Tree - Ice Mountain - Seasons - [Magnolia](/wiki/Magnolia_(Fraser_and_Neave_brand)) - NutriSoy - NutriWell - [Oishi](/wiki/Oishi_Group) - Ranger - [Sarsi](/wiki/Sarsaparilla_(soft_drink)#Singapore) ### Notes ### Bibliography - [Tommy Koh](/wiki/Tommy_Koh), ed. (2006). *Singapore: The Encyclopedia*. Singapore: [Editions Didier Millet](/wiki/Editions_Didier_Millet). p. 205. [ISBN](/wiki/ISBN_(identifier)) 978-981-4155-63-2.`{{cite book}}`: CS1 maint: publisher location (link) - Official site\n",
  "language": "en",
  "processed_at": "2026-01-12T11:05:09.180004",
  "title": "Fraser and Neave",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Fraser_and_Neave"
}