{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:05:11.247838"
  },
  "content": "Multi-national real estate and property management company **Frasers Property** is a Thai-Singaporean multinational real estate and property management group which develops, owns, and manages properties globally. It is owned by [Thai Chinese](/wiki/Thai_Chinese) billionaire business magnate [Charoen Sirivadhanabhakdi](/wiki/Charoen_Sirivadhanabhakdi). The group owns and manages properties in the commercial, residential, hospitality, retail and industrial and logistics sectors. Headquartered in Singapore, it trades on the [Singapore Exchange](/wiki/Singapore_Exchange) Securities Trading Limited (SGX-ST). It also sponsors [real estate investment trusts](/wiki/Real_estate_investment_trusts) (REITs), including one stapled trust, two of which are also listed on the SGX-ST. ## History ### 1963–1996: Foundation, establishment of The Centrepoint, IPO, and acquisition by Fraser and Neave The company that would later be known as Frasers Property was incorporated in 1963 as **[Cold Storage Limited](/wiki/Cold_Storage_(supermarket))**, a market and retail chain. The first property it developed was a shopping centre known as [The Centrepoint](/wiki/The_Centrepoint) located on Singapore's [Orchard Road](/wiki/Orchard_Road). Construction on that development started in 1980 and was completed in 1983. In the early 1980s, the firm began divesting its non-property assets. In 1987, [Fraser and Neave](/wiki/Fraser_and_Neave) and [Goodman Fielder Wattie](/wiki/Goodman_Fielder) took control of Cold Storage Holdings, the holding group for Cold Storage's food manufacturing, retail, and property arms. In 1988, the property arm of Cold Storage became Centrepoint Properties Limited (CPL) and also started trading on the Singapore Exchange (SGX). In 1990, CPL became a member of Fraser and Neave after restructuring. At the time of the acquisition, CPL's sole function was as the owner and operator of The Centrepoint mall, and its executive director was G.H. Darwin. In the following years, the company added to its portfolio, opening another shopping complex, Northpoint, in Singapore and acquiring a [Sydney](/wiki/Sydney), Australia-based shopping mall, Bridgepoint. In 1994, CPL opened and began managing its first residential project with The Anchorage, a condominium complex at the location of a former Anchor Brewery in Singapore. In 1996, it broke ground on its first commercial project in [Vietnam](/wiki/Vietnam) called, Me Linh Point, in [Ho Chi Minh City](/wiki/Ho_Chi_Minh_City). The 21-storey retail and commercial tower was completed in 1999. In 1996, G.H. Darwin retired as executive director and was replaced by Jeffrey Heng, who assumed the role of CEO. Under Heng, Centrepoint expanded into hospitality with the hotel brands, Fraser Place and Fraser Suites. In 1998, Fraser Suites Singapore and Fraser Place Robertson Walk were the first of F&N's serviced residence properties. The company subsequently opened locations in the UK, [South Korea](/wiki/South_Korea), and the [Philippines](/wiki/Philippines). The company also ventured into the [United Kingdom](/wiki/United_Kingdom) for the first time in 2000 with the Annandale House residential development. Its first development in China came with the JingAn Four Seasons in [Shanghai](/wiki/Shanghai) in 2001. ### 1996–2013: Further expansion, delisting from SGX, and establishment of REITs In 2002, Centrepoint Properties became a wholly owned subsidiary of Fraser and Neave, which privatized it by delisting it from the SGX. Lim Ee Seng was named CEO of Centrepoint Properties in 2004. Two years later, the company was rebranded as Frasers Centrepoint Limited (FCL). It also developed its first [Real estate investment trust](/wiki/Real_estate_investment_trust) (REIT) with Frasers Centrepoint Trust (FCT). The FCT launched with a listing on the main board of the Singapore Exchange Securities Trading Limited (SGX-ST). In 2008, Fraser and Neave acquired a 17.7% stake in the Allco Commercial REIT. It was later rebranded as the Frasers Commercial Trust (FCOT) and placed under the structure of FCL. Between 2005 and 2014, FCL's assets increased from just over $5 billion to $16.89 billion ([SGD](/wiki/Singapore_dollar)). In 2013, FCL's parent company, Fraser and Neave, was acquired by [Thai Chinese](/wiki/Thai_Chinese) billionaire [Charoen Sirivadhanabhakdi](/wiki/Charoen_Sirivadhanabhakdi)'s [TCC Group](/wiki/TCC_Group_(Thailand)) for $11 billion. In August of that year, it was announced that Fraser and Neave would spin off FCL as its own separate listing on the Singapore Exchange through an in specie distribution of stock, effectively making the property group an independent entity under the broader TCC Group umbrella. ### 2014–2017: Acquisition by TCC Group, relisting on SGX, and expansion into Australia and Europe It officially commenced trading on the main board of the SGX-ST on January 9, 2014, after a nearly 12-year absence. In June 2014, FCL launched the Frasers Hospitality Trust (FHT), a stapled trust with a focus on its hospitality business. It is listed on the SGX-ST. Another REIT, the Frasers Logistics and Industrial Trust (FLT), was launched on the SGX-ST in June 2016. In July 2014, Frasers Centrepoint acquired Australand, an Australia-based property group, for $2.6 billion ([AUD](/wiki/Australian_dollar)). Australand was rebranded to [Frasers Property Australia](/wiki/Frasers_Property_Australia) in August 2015. In 2016, the company acquired a stake in the [Stock Exchange of Thailand](/wiki/Stock_Exchange_of_Thailand)-listed development company, Golden Land. In October 2016, [Panote Sirivadhanabhakdi](/wiki/Panote_Sirivadhanabhakdi) took over as the group's CEO, replacing the retiring Lim Ee Seng who had held the role for 12 years. Sirivadhanabhakdi had previously been the CEO of the [Thailand](/wiki/Thailand)-based Univentures Public Company and a non-executive and non-independent director of Frasers Centrepoint. In April 2017, it was announced that Frasers Centrepoint (in collaboration with the [TCC Group](/wiki/TCC_Group_(Thai_company))) was planning the largest mixed-use development in Thailand known as [One Bangkok](/wiki/One_Bangkok). Due to be completed in 2025, the 16.7 hectare integrated district will feature residences, hotels, office space, and shopping malls. Later that month, the group acquired an 86.56% stake in Geneba Properties NV, a real estate investment company based in [Amsterdam](/wiki/Amsterdam). It continued adding to its European portfolio with acquisitions of two warehouse facilities in Germany in October 2017, four business parks in the U.K. in November 2017, and the German commercial, logistics, and manufacturing developer Alpha Industrial in February 2018. ### 2018–present: Rebrand as Frasers Property and further acquisitions In February 2018, the company officially changed its name from Frasers Centrepoint Limited to Frasers Property Limited. Many of its business units outside of Singapore had been using the \"Frasers Property\" name for several years. Later in February, the Frasers Property Group acquired an additional 26.1% stake in Thai-listed developer, TICON Industrial Connection Public Company, in which it already owned a 40.95% share. The sale triggered a tender offer for the remaining ordinary shares of TICON. TICON was later renamed Frasers Property Thailand in 2019 with Golden Land Development Company as a subsidiary In May 2018, the group partnered with Singaporean sovereign wealth fund, [GIC](/wiki/GIC_Private_Limited), and [coworking](/wiki/Coworking) company, [JustCo](/wiki/JustCo), to invest $177 million in creating a Southeast Asian coworking platform. That month, it also acquired a 75% stake in Vietnam-based Phu An Khang Real Estate for $18 million. In February 2019, the company entered into a conditional sale and purchase agreement for a 17.8% stake in PGIM Real Estate Asia Retail Fund Limited (PGIM Real Estate) for $356.4 million. In July 2019, the company announced that it would be merging its Australian and European industrial and logistics operations along with the assets and property management functions of the Frasers Logistics and Industrial Trust. The company announced it would create a new [strategic business unit](/wiki/Strategic_business_unit), Frasers Property Industrial, beginning in 2020. In February 2020, the company's retail arm agreed to acquire AsiaMalls Management, adding six properties to its portfolio. In 2021, the company launched a $950m share sale to fuel the acquisition of industrial and business parks, as well as set up new property investment vehicles. ## Subsidiaries Frasers Property is composed of several business units based in Singapore, Australia, Thailand, the United Kingdom, Vietnam and China. It also operates business units for its hospitality businesses and industrial and logistics holdings. These business units also oversee the management of the group's various REITs. ### Frasers Property Singapore Formerly Frasers Centrepoint Singapore, the Frasers Property Singapore business unit covers developments, assets, and property management in Singapore. As of 2019, the unit's portfolio includes 22 shopping malls in Singapore with [The Centrepoint](/wiki/The_Centrepoint), [Northpoint City](/wiki/Northpoint_City), [Bedok Point](/wiki/Bedok_Point), [Causeway Point](/wiki/Causeway_Point), [Eastpoint Mall](/wiki/Eastpoint_Mall,_Singapore), [Hougang Mall](/wiki/Hougang_Mall), [Century Square](/wiki/Century_Square), and others. It also operates various commercial properties such as Frasers Tower in the [Downtown Core](/wiki/Downtown_Core) and over 17,000 residential properties throughout Singapore under the brand name, Frasers Centrepoint Homes. Frasers Property Singapore manages the Frasers Centrepoint Trust (FCT, established in 2006) and the Frasers Commercial Trust (FCOT, established in 2008 after the acquisition and rebranding of the Allco Commercial Trust). Both trusts are independently listed on the SGX-ST. ### Frasers Property Australia Australand, an Australian property group, was acquired by Frasers Property in July 2014. with Frasers taking control the following month. Australand has been in business since the 1920s. The unit was rebranded as Frasers Property Australia in August 2015. Its projects have included [One Central Park](/wiki/One_Central_Park) in Sydney, Australia's first [carbon neutral](/wiki/Carbon_neutral) commercial building in the [Rhodes](/wiki/Rhodes,_New_South_Wales) Corporate Office Park, and numerous residential and land developments. Frasers Property Australia also manages the Frasers Logistics & Industrial Trust (FLT). which was launched on the SGX-ST in June 2016. In July 2019, it was announced that the FLT would be included in a new business unit that would merge Australia and Europe's industrial and logistics operations. That new unit would have a total of $5.4 billion in assets under management and is scheduled to begin operation by the 2020 fiscal year. Reini Otter, an executive with Frasers Property Australia, was named the CEO of that new unit. In 2024, Frasers Property Australia and ESR Australia formed a joint venture and bought a 64.4 hectare site in Cranbourne, a south-eastern suburb of Melbourne, from Salta Properties. It will be used to build a A$900 million industrial estate. The Shell Cove residential development being built by Frasers Property Australia (planned for 3,500 homes) has had issues with waterproofing and design elements in some homes. The issue was raised in 2018, the company apologized and engaged 12 crews to fix the deficiencies in 2023. ### Frasers Property UK Frasers Property also operates Frasers Property UK for its United Kingdom properties, which include four business parks acquired in September 2017. It had a valued portfolio of $1.5 billion as of 2018. ### Frasers Property Industrial Frasers Industrial business unit develops and manages industrial properties in Australia, the Netherlands, Germany and Austria. It had approximately S$5.4 billion of assets under management and 133 properties across the Group's industrial and logistics markets as of December 2019. ### Frasers Property International Frasers International business unit encompasses their businesses in Europe and the rest of Asia outside of Singapore. In Europe, the company operates Dutch property group Geneba Properties and German commercial, logistics, and manufacturing developer Alpha Industrial as Fraser Property Europe. In Asia, Frasers Property has sub-units in China, Vietnam, and Thailand. Frasers Property Thailand was previously known as TICON Industrial Connection Public Company until it was acquired in 2018 and rebranded in 2019. ### Frasers Hospitality Frasers moved into hospitality in the 1990s with the creation of the Fraser Place and Fraser Suites hotel and [serviced residence](/wiki/Serviced_residence) brands. By 2002, it had properties in [London](/wiki/London), England, and [Seoul](/wiki/Seoul), South Korea. Other brands include Fraser Residence, Modena by Fraser (based in China), and Capri by Fraser (a serviced residence built for long-term stays). In June 2015, Fraser Hospitality acquired the UK-based [Malmaison](/wiki/Malmaison_(hotel_chain)) and [Hotel du Vin](/wiki/Hotel_du_Vin) boutique hotel chains and have continued to operate those brands under their original names. As of February 2019, the unit operates more than 150 hotels and serviced residences in over 70 cities in Asia, Europe, Australia, and the Middle East. It also has $4.8 billion in assets under management. Frasers Hospitality also manages the Frasers Hospitality Trust (FHT) which was established in June 2014 and began trading on the SGX-ST. It was the first worldwide hotel and serviced residence trust to be listed on the main board of the SGX-ST. - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:05:11.247258",
  "title": "Frasers Property",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Frasers_Property"
}