{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:05:19.147798"
  },
  "content": "Secondary school in Singapore **Fuchun Secondary School** (FCSS) is a co-educational government secondary school in [Woodlands, Singapore](/wiki/Woodlands,_Singapore). ## History The school was first opened on 2 January 1986, housed in a new S$7.3 million campus along Woodlands Avenue 1. It was officially opened by Senior Parliamentary Secretary for National Development Lee Yiok Seng on 5 August 1987. As announced by the [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)) on 7 April 2021, the school will be merged with Woodlands Ring Secondary School in 2024 and move to the premises of [Woodlands Ring Secondary School](/wiki/Woodlands_Ring_Secondary_School). ## Co-curricular activities The school offers a total of 24 extra-curricular activities, which are labelled as co-curricular activities (CCAs) by the Singapore [Ministry of Education](/wiki/Ministry_of_Education,_Singapore). The CCAs offered in the school are as follows: ### Physical Sports - Basketball - Football - Netball - Sepak Takraw ### Uniformed Groups - Boy's Brigade - Girl's Brigade - Girl Guides - [NCC (Land)](/wiki/National_Cadet_Corps_(Singapore)) - [NPCC](/wiki/National_Police_Cadet_Corps) ### Visual and Performing Arts - Concert Band - Choir - Chinese Dance - Indian Dance - Malay Dance - Modern and Cultural Dance - Guitar Ensemble - Guzheng Ensemble - Festive Drums and Lion Dance Troupe ### Clubs And Societies - Green Club - Infocomm Club - Interact Club - Library - Mechatronics Club - Singapore Youth Flying Club ## Notable alumni - [Somaline Ang](/wiki/Somaline_Ang): [Mediacorp](/wiki/Mediacorp) actress - Official website This Singapore school-related article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:05:19.147260",
  "title": "Fuchun Secondary School",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Fuchun_Secondary_School"
}