{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:05:21.145761"
  },
  "content": "Museum and former temple in SingaporeThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Fuk Tak Chi Temple\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(June 2020)* *(Learn how and when to remove this message)* The **Fuk Tak Chi Temple** or **Fook Tet Soo Khek Temple** ([Chinese](/wiki/Chinese_language): 海唇福德祠) was one of the oldest former [temple](/wiki/Temple) in Singapore built in 1820 by [Cantonese](/wiki/Yue_Chinese) and [Hakka](/wiki/Hakka_people) immigrants from Kwong Wai Siew (广惠肇三府). It is currently a museum housing more than 200 artefacts. ## History The temple was built in 1820 by Cantonese and Hakka immigrants to Singapore. In 1825, it was rebuilt using bricks. Two other Hakka clans, Fong Yun Thai and Ying Fo Fui Kun joined in 1854 after contributing to the temple's rebuilding project.[*citation needed*] Dedicated to [Tua Pek Kong](/wiki/Tua_Pek_Kong), it is a [Chinese folk religion](/wiki/Chinese_folk_religion) temple which caters to the religious needs of both Chinese folk religionists and [Taoists](/wiki/Taoist). The small shrine later also catered to the welfare of the large Chinese community by functioning as an association. In 1995, the temple was awarded to [Far East Organisation](/wiki/Far_East_Organization), alongside Chui Eng Free School and other shophouses, by the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) for conservation and reuse purposes. In August 1998, the building was restored and converted into a [museum](/wiki/Museum) with artefacts on the lives of early Chinese migrants in Singapore. In 2000, it became part of the new Far East Square development. In October 2014, the temple closed for renovation for 10 months and reopened in August 2015. Amoy Hotel's entrance is located through the temple as well. - [Religion in Singapore](/wiki/Religion_in_Singapore) - Infopedia 1°16′59″N 103°50′55″E﻿ / ﻿1.28292°N 103.84875°E﻿ / 1.28292; 103.84875 This article about a Singapore building or structure is a stub. You can help Wikipedia by expanding it. - v - t - e This article about a religious building or structure is a stub. You can help Wikipedia by expanding it. - v - t - e This [Taoism](/wiki/Taoism)-related article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:05:21.145267",
  "title": "Fuk Tak Chi Temple",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Fuk_Tak_Chi_Temple"
}