{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:05:23.153143"
  },
  "content": "Singaporean healthcare provider **Fullerton Health** is an integrated enterprise healthcare service provider founded in 2010 in Singapore. The company specializes in designing customized medical services for corporate and insurer clients. Starting in 2011 Fullerton has expanded its presence to [Malaysia](/wiki/Malaysia), [Indonesia](/wiki/Indonesia), and [Hong Kong](/wiki/Hong_Kong) As of 2022 it had operations in nine countries in Asia-Pacific. ## History Fullerton Health began with an initial investment in corporate healthcare providers Gethin-Jones and Drs Trythall Hoy Davies. Over the years, it has grown both organically and through [mergers and acquisitions](/wiki/Mergers_and_acquisitions). It now[*when?*] now operates with a staff of close to 400 medical professionals and over 1,000 support staff and a network of over 8,000 associate hospitals and clinics. By 2014, Fullerton Health experienced more than double revenue growth to S$163.8 million followed by a 46.9% growth in 2015 to S$240.6 million. Fullerton Health made 3 major acquisitions in 2015 which helped grow its presence in both existing and new markets. In May, their subsidiary, Global Assistance & Healthcare (GAH) acquired PT JLT GESA, more commonly known as Medilum, that provides managed healthcare and third-party administration services. Later in August, they bought an 80 percent stake in Hong Kong medical provider, HMMP Limited (HMMP), for SGD$33 million. Above all, the purchase of Radlink-Asia in Singapore for SGD$111.2 million marked its entry into the advanced medical diagnostic imaging market and allowed it to cut costs through the digitisation of processes. As of June 30, 2016, Fullerton Health owned 198 clinics and facilities across Singapore, Hong Kong, Indonesia, and Malaysia, had close to 2,000 employees and had annual revenue of more than S$300 million. Fullerton Health received an average of 4 million patient visits per annum and claimed to have provided medical services to approximately 10 million people, working with approximately 25,000 companies across Asia-Pacific. Its corporate clientele include [Marina Bay Sands](/wiki/Marina_Bay_Sands), [Standard Chartered Bank](/wiki/Standard_Chartered), [Singapore Airlines](/wiki/Singapore_Airlines) and other [multinational corporation](/wiki/Multinational_corporation) employees, as well as SME employees. The company sought new financing in 2021 which was nearly derailed by internal disagreements. The company's founders brought winding up proceedings which were evntually withdrawn. In 2025 the company attracted investment from Mitsubishi Corp. as part of the Japanese company's regional healthcare expansion. In August 2025, David Sin, one of the co-founders of Fullerton Healthcare Corp (FHC) was fined $160,000 fine for approving falsified claims of over $213,000. Sin approved the claims on multiple occasions in 2019, despite knowing that another co-founder Daniel Chan Pai Sheng, 51, had submitted them with the intent to defraud FHC, according to court documents.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:05:23.152650",
  "title": "Fullerton Health Group",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Fullerton_Health_Group"
}