{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:05:25.168930"
  },
  "content": "This article **contains promotional content**. Please help improve it by removing promotional language and inappropriate external links, and by adding encyclopedic text written from a neutral point of view. *(July 2021)* *(Learn how and when to remove this message)* **Funding Societies** is a Southeast Asian digital financing platform for [small and medium-sized enterprises](/wiki/Small_and_medium-sized_enterprises) (SMEs), headquartered in [Singapore](/wiki/Singapore). It was the first such platform in Singapore to engage an escrow agency to independently and safely manage investors’ funds. In Indonesia it is known as Modalku (which means My Capital in the [Indonesian language](/wiki/Indonesian_language)). Since its launch, it has disbursed more than US$2.6 billion in business financing to MSMEs through more than 5.1 million loan transactions. ## History Kelvin Teo and Reynold Wijaya founded Funding Societies in 2015 while studying for their [Master of Business Administration](/wiki/Master_of_Business_Administration) (MBA) at [Harvard Business School](/wiki/Harvard_Business_School). Funding Societies operates an online platform that enables Small and Medium Business to seek funding for their growth from a pool of investors, through digital lending. The standard loan period ranges from 3 months to 1 year and borrowers can loan up to SGD$2,000,000. In the first month of launching, they received a total of SGD$3 million loan applications of which about SGD$250,000 was disbursed. In January 2016, Funding Societies launched Modalku, which means \"My Capital\" in Bahasa Indonesia to reach out to SMEs in the Indonesian Market. The company claims that SGD$7.8 million in loans had been originated through its Singapore platform up to 30 June 2016. In November 2016, Funding Societies won 3rd place in MAS’ Fintech Awards, under the subcategory Singapore SME. It was also awarded an in-principle licence. In November 2016, Funding Societies Malaysia became one of 6 licensed SME lending platforms in Malaysia recognised and regulated by the Securities Commission. In January 2017, Funding Societies was one of the first SME digital lending platforms in Singapore to be awarded Capital Markets Services Licence by the Monetary Authority of Singapore. In February, it revolutionised Business Loans by introducing FS Bolt, a mobile app for loan applications, which is now available on App Store & Google Store. In June, together with companies such as Stripe, Ant Financial Services, Funding Circle, and Dianrong, Funding Societies was recognised for its financial innovations by CB Insights in front of an audience of 1,000 senior executives from around the world and esteemed news outlets including The New York Times, The Wall Street Journal, The Financial Times, Reuters, and Bloomberg. It was listed on The FinTech 250, the only SME digital lending company from Southeast Asia. In September, Funding Societies introduced Miyubot, a chatbot driven by Artificial Intelligence and Natural Language Processing. Miyubot works round the clock to answer queries that a business owner or an investor may ask about the products and services offered by Fintech but is no longer in use. In the same year, Modalku (Funding Societies) became the first Southeast Asian company to win the Global SME Excellence Award from United Nations' ITU Telecom. Frank Stevenaar joined as the FinTech’s first Chief Financial Officer, while Nihit Nirmal took on the role as Chief Product Officer, and Ishan Agrawal was promoted to Chief Technology Officer. This came at a juncture where the fast-growing start-up geared up for larger funding rounds and a sustained growth trajectory. Later that year, Funding Societies and Razer Fintech jointly announced their partnership to offer short-term business financing to merchants under Razer Merchant Services (RMS). More than 20,000 micro, small and medium enterprises (MSMEs) in Malaysia first and subsequently across the region will be connected to Funding Societies' financing solutions via Razer Merchant Services (RMS). Funding Societies also revealed that it can now extend its financing solutions to more SMEs in Singapore under Enterprise Singapore's (ESG) Enterprise Financing Scheme (EFS). The FinTech's direct lending entity, FS Capital Pte Ltd (part of Funding Societies), received the approval to become a Participating Financial Institution (PFI) in late October 2020 after years of laying the groundwork with ESG to onboard FinTechs into the Scheme. Funding Societies ended the year with Samsung Venture Investment Corporation’s investment towards its technological arm, FS Technologies. Funding Societies broke into its 4th market, Thailand, in February 2021. The platform will operate under the debt-crowdfunding license given by Thailand's Securities and Exchange Commission. This expansion comes after more than one year of working with Thai regulators and planning for market entry. Thailand will be Funding Societies' fourth market in its six years of operations, making it the only SME digital financing platform in Southeast Asia to be licensed in four countries. In the same month, Funding Societies achieved $2 billion in disbursals of business financing to small and medium enterprises across the region. Then in March, Funding Societies won in two categories at the ASEAN Startup Awards 2020: Startup of the Year and Founder of the Year. The ASEAN Startup Awards is part of the Global Startup Awards, providing a spotlight to organisations and people around the region who dream big and shape our future. In October, Funding Societies raised US$18m in Debt from Japanese and Singaporean Impact Investors, putting it on track to raise US$120m. In the same month, it was recognised by the Global SME Finance Awards with an Honourable Mention as Responsible Digital Innovator of the Year. As of 2022, it has given out more than US$5.2 billion in financing through 5.1 billion loans across the region. ### Series A Funding Funding Societies raised S$10 million in series A funding in August 2016 led by Sequoia India and Alpha JWC Ventures. ### Series B funding In April 2018, just slightly over three years old, Funding Societies raised US$25 million in their Series B round of funding, led by [Softbank](/wiki/SoftBank_Group) Ventures Korea, an early-stage venture capital arm of Softbank Group famous for its US$100 billion Vision Fund. Their existing investors Sequoia India, Alpha JWC Ventures (Indonesia) and [Golden Gate Ventures](/wiki/Golden_Gate_Ventures) together with new Venture Capitalists Qualgro and LINE Ventures also participated in this round. ## Partnerships Funding Societies has secured the following partnerships: - [DBS Bank](/wiki/DBS_Bank) in April 2016. - [Comparison of crowdfunding services](/wiki/Comparison_of_crowdfunding_services#Money_for_business_ventures) - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:05:25.168405",
  "title": "Funding Societies",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Funding_Societies"
}