{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:05:27.179951"
  },
  "content": "Research and development complex in Singapore **Fusionopolis** ([Chinese](/wiki/Simplified_Chinese_characters): 启汇城) is a [research and development](/wiki/Research_and_development) complex located at the [one-north](/wiki/One-north) business park in [Singapore](/wiki/Singapore). It houses various research organizations, high-tech companies, government agencies, retail outlets, and serviced apartments in one location. Situated in [Buona Vista](/wiki/Buona_Vista), it is close to the [ESSEC](/wiki/ESSEC_Business_School) and [INSEAD](/wiki/INSEAD) Asia Campuses, the [National University of Singapore](/wiki/National_University_of_Singapore), the [Singapore Polytechnic](/wiki/Singapore_Polytechnic), the [Institute of Technical Education](/wiki/Institute_of_Technical_Education), the [National University Hospital](/wiki/National_University_Hospital), the [Singapore Science Park](/wiki/Singapore_Science_Park), the [Biopolis](/wiki/Biopolis), and the [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)). It is served by the [one-north MRT station](/wiki/One-north_MRT_station) connected to the basement of the building. ## Development ### Phase 1 The Fusionopolis Phase 1 development consists of three towers (Connexis South, Connexis North and Symbiosis), with a gross floor area totalling 120,000 m2. Fusionopolis Phase 1 was designed by the late renowned Japanese architect Dr [Kisho Kurokawa](/wiki/Kisho_Kurokawa). The following are the tenants of Fusionopolis Phase 1. - Edgilis , a technology and innovation consulting company - Linden Research Singapore The Singapore office of Linden Lab, the makers of the 3D virtual online world called Second Life. - Platform Computing Singapore Pte. Ltd. and its Open Source Grid Development Center, who moved in on 7 May 2008. - Thales Technology Centre Singapore moved in on 20 May 2008. - Agency for Science, Technology and Research ([A*STAR](/wiki/A*STAR)) and three of seven [Science and Engineering Research Council](/wiki/Science_and_Engineering_Research_Council) (SERC) research institutes: - Institute for Infocomm Research (I²R) - Institute of High Performance Computing (IHPC) - Network Storage Division of the [Data Storage Institute](/wiki/Data_Storage_Institute) (DSI) - [Info-communications Media Development Authority](/wiki/Info-communications_Media_Development_Authority) (IMDA) - [Asian Food Channel](/wiki/Asian_Food_Channel), a 24-hour regional pay TV channel broadcasting food and lifestyle content Fusionopolis Phase 1 is the first integrated work-live-play-learn development in one-north. In addition to work spaces, JTC has incorporated serviced apartments, F&B retail outlets, a fitness club, a technology showcase, an experimental theatre called Genexis Studio into the development. The official opening of Fusionopolis Phase I took place on 17 October 2008, with the prime minister of Singapore, [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) as guest of honor, under tight security measures. ### Phase 2A and 2B A massive test-bed for new technologies, Phase 2A is designed to house dry and wet laboratories, clean rooms and vibration sensitive test-bedding facilities. Phase 2A, consisting of three buildings (Innovis, Kinesis and Synthesis), features Singapore's largest R&D clean room facility and provides 103,635 square metres of Business Park and R&D space when it is completed in 2014. The Science and Engineering Research Council (SERC) of the Agency for Science, Technology and Research (A*STAR) will be the anchor tenant at Phase 2A. Four research institutes, namely the Institute of Microelectronics (IME), the Institute of Materials Research and Engineering (IMRE), the Data Storage Institute (DSI) and the Singapore Institute of Manufacturing Technology (SIMTech), will also co-locate at Phase 2A. Phase 2B, is designed by renowned 'green' architect, Dr [Ken Yeang](/wiki/Ken_Yeang), as a sustainable, multi-tenanted development and has been named Solaris. It was completed in 2010 and provides 50,000 square metres of business park and laboratory space to house both public agencies and private companies, to form synergistic collaborations with those from Phases 1 and 2A. ### Phase 3 Nexus@one-north, the third phase, was completed in September 2013. It is made up of two towers of six-storey office and business-park space, linked by a central plaza and skybridge. Nexus@one-north aims to cater to businesses in the media industry as well as research and development activities in the physical sciences and engineering sectors. ### Phase 4 Phase 4, Sandcrawler, officially opened on 16 January 2014. It houses the regional headquarters of [The Walt Disney Company](/wiki/The_Walt_Disney_Company), formerly housing [Lucasfilm](/wiki/Lucasfilm)'s Singapore studio. The 22,500-square-metre seven-storey building also contains a 100-seat theatre. ### Phase 5 Galaxis, the fifth phase of Fusionopolis, was completed in late 2014. It consists of a 17-storey building with a separate five-storey office block, and is developed as a business space that integrates living and retail activities. - F11 Facility Guide to Fusionopolis - JTC Corporation - Agency for Science, Technology and Research (A*STAR) - one-north - A*STAR Fusionopolis webpage - Data Storage Institute (DSI) Archived 23 July 2008 at the [Wayback Machine](/wiki/Wayback_Machine) - Institute for Infocomm Research (I²R) - Institute of High Performance Computing (IHPC) - Linden Lab\n",
  "language": "en",
  "processed_at": "2026-01-12T11:05:27.179530",
  "title": "Fusionopolis",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Fusionopolis"
}