{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:05:30.150784"
  },
  "content": "This article shows the notable **future developments in Singapore**. Most of them are currently under construction with most to be completed within the next five years. ## Commercial ### 8 Shenton Way (Redevelopment of AXA Tower) Announced by the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) on 5 August 2022, the upcoming mixed-use development to replace the existing AXA Tower in [Tanjong Pagar](/wiki/Tanjong_Pagar) has been granted a maximum approved height of 305 metres. Surpassing the 284 metres-tall [Guoco Tower](/wiki/Guoco_Tower), the 63-storey skyscraper is set to be Singapore's tallest building when completed in 2028. The development will comprise commercial spaces, offices, a hotel, and residential units with sky terraces. ### CanningHill Piers and CanningHill Square (Redevelopment of Liang Court) A new mixed-use, integrated development named CanningHill Piers will be built on the current Liang Court complex with a 696-unit condominium spread across two residential towers, a 2-storey retail mall named CanningHill Square, a 460- to 475-room Moxy hotel by [Marriott](/wiki/Marriott_International) replacing [Novotel](/wiki/Novotel), and a 192-unit Somerset serviced residence. Developed by [CapitaLand](/wiki/CapitaLand), [Ascott REIT](/wiki/The_Ascott_Limited) and [City Developments Limited](/wiki/City_Developments_Limited), the redeveloped complex will open in phases from 2024. The development will be directly linked underground to the [Fort Canning MRT station](/wiki/Fort_Canning_MRT_station). ### Chong Pang City Chong Pang City; originally known as Chill @ Chong Pang, is an upcoming 0.9-hectare community integrated development in [Yishun](/wiki/Yishun), to be constructed on a site currently occupied by Chong Pang Community Club and Block 102 Yishun Avenue 5. Announced on 8 September 2020, the development will house a new community club, a market and hawker centre, and retail shops. It will also feature three swimming pools, a gymnasium, and fitness studios. The adjacent Chong Pang Market and Food Centre will be relocated to the new development when completed. The site will then be redeveloped into a community plaza by 2028. Construction for Chill @ Chong Pang is expected to begin in 2022 and completed in 2027. The site has since broken ground on 26 March 2023 with its design unveiled. The name had also been changed to Chong Pang City. ### Greater Southern Waterfront Plans for a southern waterfront city were briefly announced in 2013 as part of a plan to consolidate port activities in Tuas. These plans were elaborated as a Greater Southern Waterfront in 2019, a 2,000ha area with 30 km of coastline from Marina Bay to Pasir Panjang. They include the redevelopment of Keppel Club with 9,000 [HDB](/wiki/Housing_and_Development_Board) and private homes. and more office spaces near homes bringing about new ways of living. Links to other nature areas will also be created to places like West Coast Park and East Coast Park, Rail Corridor and Sentosa. In addition, new attractions like the redevelopment of Pasir Panjang power plants, a proposed \"Downtown South\" resort by [NTUC](/wiki/National_Trades_Union_Congress) on [Pulau Brani](/wiki/Pulau_Brani) to thank workers, revitalisation of [Sentosa](/wiki/Sentosa)'s beaches, nature and heritage areas are to be expected. On 6 June 2022, the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) (URA) announced that a 10-kilometre seafront promenade linking [Marina Barrage](/wiki/Marina_Barrage) to the [Southern Ridges](/wiki/Southern_Ridges) will be built as part of a longer coastal corridor from Marina Barrage to [West Coast](/wiki/West_Coast,_Singapore). ### Heart of Yew Tee Announced on 22 September 2019, the upcoming Heart of Yew Tee will house 68 two-room Flexi flats for seniors, a community club, a polyclinic, a kidney dialysis centre, and a hawker centre. The integrated development, consisting of a 10-storey residential block and a 6-storey commercial block, modeled after the award-winning [Kampung Admiralty](/wiki/Kampung_Admiralty), will replace the existing hardcourt at Yew Tee Close next to [Yew Tee MRT station](/wiki/Yew_Tee_MRT_station). It is estimated to be completed by the second half of 2026. It will be the second such 'vertical' kampung, after Kampung Admiralty opened in 2018. ### Hotel Indigo Changi Airport Announced by [Changi Airport Group](/wiki/Changi_Airport_Group) (CAG) on 26 April 2024, a new 255-room [Hotel Indigo](/wiki/Hotel_Indigo) will be opened in 2028 at the newly refurbished Changi Airport Terminal 2. Situated above the existing coach stand, the hotel will be Singapore's first \"zero-energy\" hotel and be accessible from the departure hall via a linkbridge. The hotel will feature facilities such as a rooftop day club, infinity pool, and a bar. A floating forest spanning seven storeys is also one of the highlights of the upcoming landside hotel. ### Integration of Bugis Village and Bugis Street Announced on 16 January 2020, [CapitaLand](/wiki/CapitaLand) has won a three-year tender for the integrated management of Bugis Village and adjacent Bugis Street. Under the management, CapitaLand plans to revamp the area. Plans are being explored for the integrated development to house a day-to-night market, a retail incubator, and areas for co-living and co-working. A section will also be converted into a hub offering brands a space to innovate new ways of creating curated brand experiences or pilot new concepts. A series of loose and colourful container boxes with open display areas is also being planned. To be named Bugis Box, it will be a modern interpretation of street markets with trendy bites, quirky gifts, and trending fashion accessories. It will be similar to South Korea's Common Ground. There are also plans for a dining area for visitors to try out Singaporean and Southeast Asian hawker food. Diners will also be able to try making some dishes or purchase Singaporean food packs. ### Jurong Lake District (JLD) A new draft masterplan for the 120-hectare Jurong Lake District was unveiled on 25 August 2017, with new developments in the Lakeside district. It will include a commercial centre around the High Speed Rail station in Jurong East, as well as a third island crested through a new canal. It would be completed in two decades time, and would be served by the upcoming [Jurong Lake District MRT station](/wiki/Jurong_Lake_District_MRT_station) on the [Cross Island Line](/wiki/Cross_Island_Line). A portion of land that was part of the former [Tang Dynasty City](/wiki/Tang_Dynasty_City) is currently being prepared for future residential developments. The approximately 4.8-hectare land is able to accommodate 1,800 to 2,600 residential units. ### Ke Ju Hakka Village Originally scheduled to be completed by end-2024, Ke Ju is an upcoming seven-storey building to be developed by The Char Yong (Dabu) Association in [Geylang](/wiki/Geylang). The building, with a light screen facade displaying [Hakka](/wiki/Hakka_culture) embroidery patterns, will take the form of a traditional Hakka communal residence, blending modern and traditional Hakka architectural and design elements. It will also feature terrace gardens inspired by the Hakka mountainscapes in China with a creeping fig pavilion as a centrepiece. The building's first two floors will include gallery areas, courtyard spaces for small performances, a library, a cooking studio, and a multi-purpose hall. ### Lentor Modern Developed by [GuocoLand](/wiki/GuocoLand), Lentor Modern will be the first and only integrated mixed-use development in the [Lentor](/wiki/Lentor) estate. The development comprise 605 residential units across three 25-storey towers above a retail mall and childcare centre. To be completed by 2026, Lentor Modern will be integrated with [Lentor MRT station](/wiki/Lentor_MRT_station). ### Newport Tower and Newport Residences (Redevelopment of Fuji Xerox Towers) Vacated as of July 2021, the existing [Fuji Xerox Towers](/wiki/Fuji_Xerox_Towers) will be demolished and redeveloped by [City Developments Limited](/wiki/City_Developments_Limited) into a 45-storey mixed-use integrated development named Newport Plaza, Newport Tower, and Newport Residences. The development will house commercial space, offices, approximately 256 residences, and serviced apartments. ### Pasir Panjang Power District Housing two decommissioned power plants, oil and gas tanks, and ancillary buildings, the 15-hectare (37-acre) Pasir Panjang Power District, located next to the [Labrador Nature Reserve](/wiki/Labrador_Nature_Reserve), will be redeveloped as part of the Greater Southern Waterfront transformation plans. Some of the proposed ideas include a pair of towers built from old shipping containers, residences, hotels, events venue, gallery space, public park with courtyards, rooftop farms, and a theme park. The district will be released for redevelopment through a tender in 2021. ### Piccadilly Grand and Piccadilly Galleria Developed by [City Developments Limited](/wiki/City_Developments_Limited) and MCL Land, a new [mixed-use](/wiki/Mixed-use) development in [Farrer Park](/wiki/Farrer_Park) comprising Piccadilly Grand and Piccadilly Galleria is currently under construction. The development consists of three 23-storey residential blocks, housing 407 units, above a 1,500-square-metre (16,000 sq ft) retail podium and a childcare centre. To be completed by 2026, the development will be directly linked to [Farrer Park MRT station](/wiki/Farrer_Park_MRT_station). ### Sky Eden (Redevelopment of Bedok Point) On 1 July 2021, plans to redevelop [Bedok Point](/wiki/Bedok_Point) were announced. Named Sky Eden, the new mixed-use development consists approximately 158 residential units with twelve retail units at the ground floor. This comes after low footfall at the mall after nearby [Bedok Mall](/wiki/Bedok_Mall) opened beside the [Bedok Bus Interchange](/wiki/Bedok_Bus_Interchange) and [MRT station](/wiki/Bedok_MRT_station). ### The Waves Expected to be ready by end–2025, The Waves is a 9,000 square-metre integrated waterfront hub on the [Southern Waterfront](/wiki/Greater_Southern_Waterfront). Aside from having berths for the public to view the testing and showcase of ships with green technology, the development will also house marine technology companies and feature a visitor sky terrace with food and beverage options. ### Transformation of Orchard Road Announced on 30 January 2019, the 2.4 km [Orchard Road](/wiki/Orchard_Road) will be revamped and rejuvenated with unique experiences and offerings across four sub-precincts namely [Tanglin](/wiki/Tanglin), Orchard, Somerset, and [Dhoby Ghaut](/wiki/Dhoby_Ghaut). New retail concepts, attractions, events, and entertainment will be established to strengthen its position as a lifestyle destination. More trees and shrubs, with different colours for each sub-precincts will also be planted along both sides of the road. Tanglin will primarily be an arts and artisanal mixed-use neighbourhood. For example, the conserved Tudor Court is planned to house more arts, cultural, and lifestyle offerings, while the covered canal is proposed to be turned into a courtyard for public art and outdoor dining. The neighbourhood will be mainly served by the [Orchard Boulevard MRT station](/wiki/Orchard_Boulevard_MRT_station). In Orchard, more mixed-use developments will be constructed on empty plots of land along Orchard Boulevard above [Orchard MRT station](/wiki/Orchard_MRT_station). To enhance pedestrian connectivity, side streets will be redeveloped while elevated link bridges are planned to be built at the junctions of Orchard Road and Patterson Road. Somerset will continue to be an energetic youth hub with new lifestyle options and the upcoming transformation of the 4,482-square-metre (48,240 sq ft) Grange Road carpark into a dedicated public events space for pop-up events and entertainment such as flea markets and food trucks. Amenities such as shower and changing room facilities will also be added at Skate Park and Youth Park, along with flexible spaces that can be reconfigured according to various events. The existing wall for graffiti in Youth Park will also be extended to become a larger canvas for street artists. Named Somerset Slopes, an area between Somerset Skate Park and [111 Somerset](/wiki/111_Somerset) will be redeveloped into a new stage for buskers and activities such as movie nights. Different modular multi-storey working spaces for workshops, art studios, and incubator spaces will also be added as part of the new Incubation Nexus located adjacent Somerset Skate Park. Located at the Grange Road carpark, the 3,000-seater music hall managed by [Live Nation](/wiki/Live_Nation_Entertainment) is expected to open in 2026. Aside from a cafe and bar, there will also be a smaller 350-seater hall to cater to smaller acts. Dhoby Ghaut will primarily be a lush greenery zone with attractions that are targeted at families. Parts of the road are planned to be converted to pedestrian use to connect existing green spaces at [Istana Park](/wiki/Istana_Park) and [Dhoby Ghaut Green](/wiki/Dhoby_Ghaut_Green), while the current open space at [Plaza Singapura](/wiki/Plaza_Singapura) will be transformed into a large garden with playgrounds and sheltered spaces for events. The 1.3-hectare (3.2-acre) Istana Park is proposed to be expanded and redesigned, featuring an orchid-themed garden and a rustic nature play garden with water play areas. This proposal would result in a realignment of Orchard Road from [The Istana](/wiki/The_Istana) to SMA House. The Istana Park would also be better integrated with the Istana's entrance and commercial developments in its surrounding with roads that include use by pedestrians. ### Union Square (Redevelopment of Central Mall and Central Square) After the acquisition of Central Square at Havelock Road in 2022, City Developments Limited will be redeveloping Central Mall, Central Square, and an adjacent cluster of conservation shophouses into a large-scale mixed-use lifestyle hub comprising a hospitality component, serviced apartments, and commercial spaces such as offices and retail units. Union Square will consist 366 apartments in a 40-storey residential tower, office and retail spaces in a 20-storey tower, and a 71-room three-storey hotel. ### W Singapore - Marina View Set to be Singapore's second [W Hotels](/wiki/W_Hotels), the 350-room W Singapore - Marina View will be housed within a 51-storey mixed-use development in [Marina Bay](/wiki/Marina_Bay,_Singapore). The hotel is expected to be opened in 2028. ### Redevelopment of Shaw Tower As one of the older buildings in the Beach Road / Ophir-Rochor Corridor, the 42-year-old Shaw Tower will be redeveloped into a 35-storey Grade A office and retail tower as part of the rejuvenation of the area. The new Shaw Tower will have 37,161.216 square metre of office space and 2,787.0912 square metre of retail space. When completed, the development will be linked-up with adjacent Guoco Midtown and surrounding developments. The redevelopment is planned to have its construction synchronised with Guoco Midtown's to minimise disruption in the area and ensure that both buildings will be ready at the same time. The new Shaw Tower is scheduled to be completed by 2025. ### Redevelopment of Comcentre On 23 February 2022, [Singtel](/wiki/Singtel) announced an over S$2 billion plan to redevelop [Comcentre](/wiki/Comcentre) from 2024 into a pair of 20-storey buildings with a floor area of approximately 110,000 square metres. The buildings will be equipped with the latest digital technologies and sustainable features, as well as being well integrated into the surroundings with an underground connection to [Somerset MRT station](/wiki/Somerset_MRT_station). Aside from a retail podium housing retail spaces and Singtel's new flagship store, the development will also feature an elevated rooftop park and an integrated wellness hub. The new Comcentre will be developed in a joint venture with another developer that will be selected in May, although two were shortlisted earlier. Singtel will divest its stake to the joint venture company with a majority stake, although it will take up 30 per cent of the space as the anchor tenant. The new Comcentre will also be equipped with hybrid working spaces for other tenants. It will be completed by 2028, with Singtel working in other offices in the meantime. ### Redevelopment of The Forum, voco Orchard, and HPL House Announced by Hotel Properties Limited (HPL) Group on 28 August 2023, the existing [Forum The Shopping Mall](/wiki/Forum_The_Shopping_Mall), [voco Orchard Singapore](/wiki/Voco_Orchard_Singapore) hotel, and HPL House will be redeveloped into a new mega development with a mix of hotel, retail, office, and residential spaces. Located along the [Orchard Road](/wiki/Orchard_Road) shopping belt, the new mixed-use development will include two towers of 64-storey and 43-storey above a 6-storey retail podium. A performance theatre, rooftop garden, and a separate 29-storey tower will also be built on the site. ### Redevelopment of JCube and Jurong Regional Library It was announced that [JCube](/wiki/JCube) will close down on 6 August 2023 to make way for a 40-storey residential development with commercial space on its lower levels while the existing [Jurong Regional Library](/wiki/Jurong_Regional_Library) will be relocated to the Jurong East Integrated Transport Hub site near [Jurong East MRT station](/wiki/Jurong_East_MRT_station) in 2028. The new mixed-use development, linked directly to the Jurong East MRT station and surrounding buildings via J-Walk, is expected to be completed in 2027. ### Rejuvenation of Gillman Barracks Announced on 24 May 2022 by the [Singapore Land Authority](/wiki/Singapore_Land_Authority), the existing [Gillman Barracks](/wiki/Gillman_Barracks) will undergo an approximately S$2 million revamp. To be carried out in two phases, the rejuvenation will transform Gillman Barracks into a creative lifestyle enclave and introduce new offerings such as a farmers' market and more food and beverage and lifestyle concepts. Existing infrastructure will also be upgraded such as covered walkways within the precinct and to the nearby [Labrador Park MRT station](/wiki/Labrador_Park_MRT_station) and a new playground. First phase of tenders for the commercial spaces have been released in May 2022. The rejuvenation project is expected to be completed in 2023. ### Rejuvenation of Boon Lay Place Announced on 4 August 2024, the commercial heart at [Boon Lay Place](/wiki/Boon_Lay_Place) will be redeveloped over the next few years. As part of the rejuvenation plans, the Boon Lay branch of the West Coast Town Council will be relocated to the former [United Overseas Bank (UOB)](/wiki/United_Overseas_Bank) building in 2025. More sheltered linkways and park connectors will also be built to enhance pedestrian experience. The [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) is also currently studying long-term plans for the existing interim bus park, the former Savoy Theatre, and the ActiveSG Hockey Village. ### Proposed Waterfront Hotel at River Valley Released for sale on 5 December 2019, the 1.02-hectare (2.5-acre) hotel site located directly above [Fort Canning MRT station](/wiki/Fort_Canning_MRT_station) can potentially yield a maximum of 530 hotel rooms. The site is envisioned to be developed into a distinctive waterfront landmark and offer seamless connections between the two attractions of [Fort Canning Park](/wiki/Fort_Canning_Hill) and [Singapore River](/wiki/Singapore_River). ### Proposed Integrated Development at Kembangan Announced by the [Housing and Development Board](/wiki/Housing_and_Development_Board) (HDB) on 2 February 2024, an existing site adjacent to [Kembangan MRT station](/wiki/Kembangan_MRT_station) is currently being proposed to be redeveloped into a HDB integrated development. The development will comprise approximately 340 [Build-to-Order](/wiki/Build_to_order_(HDB)) (BTO) split among two 18-storey buildings, and a five-storey commercial building housing an outpatient healthcare facility, a new Kampong Kembangan Community Club, supermarket, and retail shops. As part of the redevelopment plan, the existing Kampong Kembangan Community Club will be temporarily relocated for a new neighbourhood park adjacent to the integrated development. ### Proposed Retail and Office Development at Punggol Central Published by the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) (URA) on 21 October 2022, approximately 1-hectare of land adjacent to [Punggol MRT station](/wiki/Punggol_MRT/LRT_station) will be developed into a mixed-use office and retail development to provide more office spaces and retail options for the town's residents. ## Industrial ### Jurong Innovation District (JID) First announced in the 2016 Singapore Budget, the 600-hectare Jurong Innovation District (JID) aims to provide a conducive environment for startups, and encourage innovation. To be developed by [JTC](/wiki/JTC_Corporation), it will be located near [NTU](/wiki/Nanyang_Technological_University), [Tengah](/wiki/Tengah,_Singapore) and [CleanTech Park](/wiki/CleanTech_Park), and the first phase will be completed by 2022. An elevated pathway stretching 11 kilometres, named Sky Corridor, will connect the JID's five precincts. An underground tunnel network for heavy vehicles, named District Logistics Network, is expected to be ready by 2024. Tenants in the JID include, [Hyundai Motor Group](/wiki/Hyundai_Motor_Group), [Shimano Inc](/wiki/Shimano), [Konica Minolta](/wiki/Konica_Minolta), [Bosch Rexroth](/wiki/Bosch_Rexroth), and [Siemens](/wiki/Siemens). #### SATS Food Hub Broken-ground on 7 April 2022, SATS Food Hub is an upcoming S$150 million innovative food hub to be operated by [SATS](/wiki/SATS_(company)) in the JID. Expected to be completed by 2024, the 5-storey building will bring together several existing catering operations at Pandan Loop under a single roof. Food manufacturing facilities, production kitchens, innovation lab, and a centre for warehousing and logistics are part of the facilities to be housed in the building. As an innovation hub, the building will feature an open innovation platform for the testing of new products and services. Automation, robotics, and [Internet of Things](/wiki/Internet_of_things) (IoT) capabilities will also be used in its processes. #### Upgrading of Jurong Eco-Garden Part of the JID, the existing Jurong Eco-Garden will be refurbished with a new playground and fitness corner, and upgraded footpaths. A new pedestrian bridge will also be built over the [Pan Island Expressway](/wiki/Pan_Island_Expressway) (PIE) to better connect nearby residents to the garden and the larger JID. ### Punggol Digital District (PDD) First announced in the 2015 National Day Rally and 2017 Singapore Budget, the 50-hectare (120-acre) Punggol Digital District (PDD) will be Singapore's first enterprise district, with [JTC](/wiki/JTC_Corporation) being the master developer. Located in [Punggol North](/wiki/Punggol), it will house a business park comprising digital and cybersecurity industries, as well as the [Singapore Institute of Technology](/wiki/Singapore_Institute_of_Technology) (SIT) new permanent campus in [Punggol](/wiki/Punggol). It will create approximately 28,000 new jobs and offer Punggol residents additional dining, leisure, and retail spots. The first phase of the district, spanning 21 hectares, will be opening in phases from September 2024. The developments will be integrated side by side, encouraging collaboration between industries and academia. Having the SIT campus integrated with the JTC business park will support an ecosystem for digital and technology organisations in the district, such as doing trials on new concepts before scaling them up on a national level. SIT faculty and students will be able to collaborate with industry professionals on relevant projects and test-bedding opportunities. For example, new ideas conceived by students in SIT could be tested in the PDD, enabling a faster market access. On the other hand, organisations in the PDD can tap into SIT's applied learning and research capabilities and talent pool. Campus Boulevard will be an 800-metre street for pedestrians lined with retail shops and F&B outlets. In addition, a 1.3 km heritage trail, converted from the existing Punggol Road will extend from [Punggol Waterway Park](/wiki/Punggol_Waterway_Park) to [Punggol Point Park](/wiki/Punggol_Point_Park). A market village by the waterfront will also offer new retail and dining options located at the eastern end of Campus Boulevard. Other than the existing [Punggol LRT](/wiki/Punggol_LRT_line) West Loop, the district will also be served by the [Punggol Coast MRT station](/wiki/Punggol_Coast_MRT_station) that opened on 10 December 2024, and a future bus interchange. After 19 years of closure due to low demand, the existing [Teck Lee LRT station](/wiki/Teck_Lee_LRT_station) was opened on 15 August 2024 to serve the [SIT campus](/wiki/SIT_Punggol_Campus) and PDD. The plan was officially unveiled on 21 January 2018, with the JTC buildings and SIT campus opening gradually in the second half of 2024. Construction started on 17 January 2020, with a new Open Digital Platform unveiled to monitor utilities usage and testbed new technologies. On 28 July 2021, the first four companies setting up in the district were unveiled, being Boston Dynamics, Delta Electronics Int'l (Singapore), Group-IB and Wanxiang. The completion date has since been pushed back to 2024. On 18 April 2023, [United Overseas Bank](/wiki/United_Overseas_Bank) (UOB) announced that it will take up one of the eight tower blocks in the district by end-2026, housing over 3,000 technology and digital staff. Aside from UOB, Target Media Culcreative (TMCC) and Delteq were also announced as new tenants of the district. A 200-room hotel facing Coney Island will be built as part of one of the business park towers at the eastern end of the district. It is expected to be operational by 2024. ### Sungei Kadut Eco-District (SKED) Announced on 6 February 2020, the existing [Sungei Kadut](/wiki/Sungei_Kadut) Industrial Estate will be developed and transformed in phases, forming the overall 500-hectare Sungei Kadut Eco-District (SKED). Other than traditional manufacturing industries, the district will also house new sectors such as [agri-tech](/wiki/Agricultural_technology) and environmental technology. The district will be split into four primary precincts namely Sungei Kadut North, Sungei Kadut Central, Sungei Kadut South, and the Agri-Food Innovation Park. The district will have nature and heritage trials as well as a park network with lush greenery connecting to waterfront parks and existing park connectors. Co-working and co-living spaces, together with leisure amenities will also be built to attract the general public to visit SKED during after-work hours and the weekends. Iconic old buildings will be refurbished and repurposed into art and lifestyle hubs housing retail and recreational facilities. Farm-to-fork cafes, farmers' markets, live performances, and pop-up markets will also be present to transform the district into a lifestyle destination for the wider community. The district will be served by new roads and the future [Sungei Kadut MRT station](/wiki/Sungei_Kadut_MRT_station). A mobility corridor specially for public buses, cyclists, and pedestrians will also be built. As part of the first phase, the 18-hectare (44-acre) Agri-Food Innovation Park will house high-tech farming and R&D activities, such as indoor farming and [aquaculture](/wiki/Aquaculture) [hatcheries](/wiki/Hatchery). In total, more than 40 hectares (99 acres) of new facilities and infrastructure is scheduled to be completed by 2025 as part of SKED's first phase. ### Dover Knowledge District As part of the Draft Master Plan 2019 by the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) (URA), the future Dover Knowledge District will be a mixed-use site meant to be an extension to the existing [one-north](/wiki/One-north) district. ### Lim Chu Kang Agri-Food Cluster Announced on 2 October 2020 by the [Singapore Food Agency](/wiki/Singapore_Food_Agency) (SFA), [Lim Chu Kang](/wiki/Lim_Chu_Kang) will be redeveloped into a 390-hectare (960-acre) high-tech agri-food cluster. Shared facilities will be developed to lower production costs and the use of resources. Aside from the core agri-food production, relevant activities such as farmers' markets and education tours are also currently under consideration. Development of the site will be carried out in phases starting from 2024. When completed, the cluster will have the capabilities to produce more than three times its current food production. ### Changi City A designated area in [Changi East](/wiki/Changi_East) adjacent to [Singapore Changi Airport](/wiki/Singapore_Changi_Airport), Changi City is planned to be a lifestyle business cluster made up of the existing [Singapore University of Technology and Design](/wiki/Singapore_University_of_Technology_and_Design) (SUTD) and [Changi Business Park](/wiki/Changi_Business_Park), as well as the future Changi East Urban District. It will be a major waterfront district with recreational and tourism facilities/amenities while offering seamless \"fly-ferry\" connections between Changi Airport Terminal 5 and Tanah Merah Ferry Terminal due to their close proximity to one another. The future Changi East Urban District, situated between the upcoming Changi Airport Terminal 5 and the existing Tanah Merah Ferry Terminal, will house offices, smart work centres, conference rooms and halls, hotels, and serviced apartments in landscaped public spaces. ### JTC aeroSpace Four Expected to be completed by 2027, JTC aeroSpace Four will expand the industrial space in [Seletar Aerospace Park](/wiki/Seletar_Aerospace_Park) by 11,000 square meters along with 25% more standard-sized factory units. This is after the completion of the third phase in 2022 which consists of nine new buildings built in the industrial park. ### Tuas Nexus Currently under construction at a site next to the Tuas Water Reclamation Plant in Tuas View Basin, Tuas Nexus is an integrated waste management facility. It will be the first in Singapore to treat both used water and food waste in the same plant to produce [biogas](/wiki/Biogas) for electricity generation. The facility will be entirely energy self-sufficient with the use of renewable energy sources such as solar panels and the conversion of heat produced by the incinerators to electricity. Excess electricity generated will be exported back to the national grid, sufficient to power up to 300,000 homes. Tuas Nexus will also help to expand the lifespan of [Semakau Landfill](/wiki/Semakau_Landfill) as it allows incineration bottom ash to be extracted from waste. The first phase of the facility is targeted to be completed by 2024. ### AstraZeneca Singapore Announced on 20 May 2024, British biopharmaceutical giant [AstraZeneca](/wiki/AstraZeneca) will be constructing a next-generation manufacturing facility costing S$2 billion. The facility will be designed to manufacture [antibody drug conjugates](/wiki/Antibody%E2%80%93drug_conjugate) (ADC) for targeted cancer treatment. The smart and sustainable facility, with its location unannounced, is expected to be ready by 2029. ### Expansion of Apple Ang Mo Kio Campus Announced by [Apple](/wiki/Apple_Inc.) on 17 April 2024, the existing campus in [Ang Mo Kio](/wiki/Ang_Mo_Kio) will undergo a more than S$340 million expansion from late-2024. Two acquired buildings located across the main regional operations centre will be revamped to cater to its expanding workforce and newly added roles in the country. Once completed, the campus will solely be running on renewable energy. ### Refurbishment of wafer fabrication parks Announced on 1 November 2019, [JTC](/wiki/JTC_Corporation) will be refurbishing its four existing [wafer fabrication](/wiki/Wafer_fabrication) parks in [Pasir Ris](/wiki/Pasir_Ris), [Tampines](/wiki/Tampines), [Woodlands](/wiki/Woodlands,_Singapore), and North Coast. The improvements include sheltered walkways, cycling paths, additional trees by the roadside, and more lifestyle amenities. Enhancement works for all four parks are expected to be completed by 2025. ### Northern Tuas Basin Reclamation Scheduled to begin in phases from 2025 and be fully completed by 2029, reclamation works near the Northern Tuas Basin carried out by [JTC Corporation](/wiki/JTC_Corporation) will provide additional 172 hectares of industrial land and improve network connections to the upcoming [Tuas South](/wiki/Tuas_South) and [Tuas Port](/wiki/Tuas_Port). ### Redevelopment of Defu Industrial Estate (Defu Industrial Park) Identified by the Government for redevelopment in 2012, Defu Industrial Estate will be transformed over the next 15 to 20 years along the vision of \"A Green and Sustainable Industrial Park of Tomorrow\". The redeveloped industrial park will be renamed [Defu Industrial Park](/wiki/Defu_Industrial_Park). Existing factories will be progressively replaced with newer and more modern industrial complexes, with the entire industry park featuring landscaped greenery and environmentally sustainable features. Defu Industrial Park will be split into three key zones. The Northern and Central Zone will house strategic industries such as logistics, precision engineering, info-communications and media, electronics, clean energy and biomedical, while the Southern Zone will be set aside for new modern industrial complexes to house the existing industrial enterprises. The redevelopment will be carried out in three phases with Phase 1 nearing completion. 219 factories out of the existing 1,046 factories, will be relocated to two new complexes that are nearing completion. Bedok Food City will house the factories that are in the food industry, while Defu Industrial City will house factories in the general industries. The total amount of factory floor space of the new industry park will be increased to 2.1 million square-metre. ### Rejuvenation of Singapore Science Park 1 Located in the [Kent Ridge](/wiki/Kent_Ridge) region, [CapitaLand](/wiki/CapitaLand) and Ascendas Reit are currently redeveloping existing buildings within the [Singapore Science Park](/wiki/Singapore_Science_Park) 1 as part of a multi-phase rejuvenation of the precinct. Eight buildings in the park have been redeveloped as of November 2021. ## Residential ### Tengah New Town The Tengah New Town is a 700ha development that will integrate nature in it. It will feature five development zones, each with its own unique identity. It was announced on 8 September 2016, with the first units to be released in 2018. The town could potentially yield up to 42,000 new homes, with more than 70 per cent of the units allocated for public housing, which would take up to two decades to complete. Tengah would feature a car-free town centre; the first in Singapore, and will be served by the future [Jurong Region Line](/wiki/Jurong_Region_Line). Plantation, the first district out of five, was unveiled on 4 September 2018. The district pays homage to the farmers who resided there back in the 1950s. The first flats were launched on 13 November 2018. ### Kampong Bugis Announced during the 2017 Budget, Kampong Bugis is a new waterfront development zone in Singapore, which will be given to a master developer, giving flexibility in planning the town layouts as opposed to carving each land plot by itself. The area will comprise approximately 4,000 private residential units, primarily served by [Lavender MRT station](/wiki/Lavender_MRT_station), [Kallang MRT station](/wiki/Kallang_MRT_station), and [Bendemeer MRT station](/wiki/Bendemeer_MRT_station). [Kallang Riverside Park](/wiki/Kallang_Riverside_Park) will also be redeveloped into a waterfront park as part of the plan. ### Tanjong Rhu Unveiled by the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) (URA) on 25 August 2023, existing residential land plots in [Tanjong Rhu](/wiki/Tanjong_Rhu) have been re-parcelled and re-ratioed into three plots totaling 12 hectares. The land plots are able to cater over 5,000 new residential units. There are also plans to widen nearby roads to meet the increase traffic contributed by the new homes in the area. A new park by the [Geylang River](/wiki/Geylang_River) will be built in between two of the plots. As it has been more than a decade since the last launch of new homes in the area, the three land plots will be able to support housing demand in Tanjong Rhu. The first two plots were launched in 2024 with the first [Build-to-Order](/wiki/Build_to_order_(HDB)) (BTO) housing project named Tanjong Rhu Riverfront I and II. ### Bayshore First announced on 16 October 2017, the new 60-hectare Bayshore district, located adjacent to [East Coast Park](/wiki/East_Coast_Park), will comprise more than 10,000 [Housing and Development Board](/wiki/Housing_and_Development_Board) (HDB) and private residential units. A 1 km public transit street will run through the district, lined with green spaces, shops, and amenities. The district will also feature an integrated transport hub at [Bedok South MRT station](/wiki/Bedok_South_MRT_station). A new linear park will also be built along the heritage seawalls with a new sea pavilion. The district will be launched for development after 2024, when [Bayshore MRT station](/wiki/Bayshore_MRT_station) and Bedok South MRT station are operational. ### Holland Plain Announced on 16 October 2017, Holland Plain is an upcoming 34-hectare precinct which will comprise approximately 2,500 private residential units. The precinct is located near [King Albert Park MRT station](/wiki/King_Albert_Park_MRT_station) and the [Rail Corridor](/wiki/Rail_Corridor_(Singapore)). More than 30 per cent of the area will feature lush greenery including a wetland park and community plain. Sky-rise greenery and green routes are also being planned for the district. The precinct will begin to be developed from 2021. ### Marina South First announced as part of the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) (URA) Master Plan 2014, the future 21.5-hectare Marina South precinct will house over 9,000 private residential units built next to [Gardens by the Bay](/wiki/Gardens_by_the_Bay). The precinct is envisioned to be a car-lite and pedestrian-friendly neighbourhood. Retail shops and community facilities/amenities will be located at street level, followed by residences above, for increased convenience. Major arterial roads in the area will also be realigned to create \"wind corridors\" where winds during the monsoon seasons will be funneled into the area. Future buildings in the precinct will also feature varying heights to channel air downwards to the surface. Each building will also be located further apart for better ventilation. All of these would facilitate better wind flow, resulting in a lower ambient temperature and comfort for those in the precinct. On 12 January 2022, it was announced that the upcoming [Marina South MRT station](/wiki/Marina_South_MRT_station) on the [Thomson-East Coast MRT line](/wiki/Thomson%E2%80%93East_Coast_Line) will remain closed until surrounding housing developments are completed. ### Lentor Hills First announced as part of the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) (URA) Master Plan 2014, the existing 30-hectare forest bordering Teacher's Estate will be cleared for the development of private homes. Located near [Lentor MRT station](/wiki/Lentor_MRT_station), the new neighbourhood is planned around the existing [hillock](/wiki/Hillock). Two green plots of the existing forests will be kept, along with new parks such as a Linear Park and the main Hillock Park. A mixed-use development with retail amenities, Lentor Modern, will be built above Lentor MRT station to serve residents in the area. ### Springleaf Announced by the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) (URA) on 6 June 2022, portions of Springleaf will be developed as a mixed-use site with residential and commercial developments surrounding [Springleaf MRT station](/wiki/Springleaf_MRT_station). Planned residences to be built on the site will be private developments. Aside from having small footprints to minimise loss of habitat, upcoming buildings will also feature greener facades to avoid colliding with birds. Spanning more than 30-hectares, the site will retain some natural and heritage elements such as the former [Seletar Institute](/wiki/Seletar_Institute) and Nee Soon Post Office. Approximately half of the site will be a new park named Nee Soon Nature Park to act as a buffer and extension of the nearby [Central Catachment Nature Reserve](/wiki/Central_Catchment_Nature_Reserve) and an ecological link with the Khatib Bongsu Nature Park that is set to open in the near future. The existing Sungei Selatar will also be retained and integrated into the new park containing a rare freshwater swamp forest habitat. ### Mount Pleasant Announced on 23 November 2021, approximately 5,000 [Housing and Development Board](/wiki/Housing_and_Development_Board) (HDB) flats will be built on the [Old Police Academy](/wiki/Old_Police_Academy,_Singapore) site in Mount Pleasant. Part of the [Singapore Polo Club](/wiki/Singapore_Polo_Club) will also be acquired as part of the development. The design of the 33-hectare (82-acre) estate will be inspired by the nature and heritage in the 1920s-developed area. Heritage elements from the old academy, surrounding greenery, and pre-war colonial bungalows will be integrated into the design of the new estate. Four existing Old Police Academy buildings and a part of the parade square will be retained and refreshed into community spaces. Surrounded by residential blocks with sky and roof gardens, a low-rise neighbourhood centre, designed to be open and green, will house amenities such as retail units. The first [Build-to-Order](/wiki/Build_to_order_(HDB)) (BTO) housing project is set to be launched in 2025. This will be the first of six BTO projects in the estate. On 12 January 2022, it was announced that the upcoming [Mount Pleasant MRT station](/wiki/Mount_Pleasant_MRT_station) on the [Thomson-East Coast MRT line](/wiki/Thomson%E2%80%93East_Coast_Line) will remain closed until surrounding housing developments are completed. ### Keppel Club As part of the Greater Southern Waterfront plan, the 44-hectare (110-acre) Keppel Club site will be redeveloped into a prime waterfront residential district. The existing private golf club will be replaced by approximately 9,000 [Housing and Development Board](/wiki/Housing_and_Development_Board) (HDB) and private residential units when its lease expires in 2021. Public housing units in the prime area will be using a new pricing model to lessen the effect where owners sell their units at much higher prices than initially purchased at subsidised rates from the Housing and Development Board (HDB). ### Dover Forest Announced by the [Housing and Development Board](/wiki/Housing_and_Development_Board) (HDB) on 30 July 2021, the revised development plan for the 33-hectare (82-acre) Dover Forest, located in [Queenstown](/wiki/Queenstown,_Singapore), will see the approximately 11-hectare eastern half of the forest be developed for public housing while the western half of the forest will be temporarily preserved due to its rich biodiversity. The eastern half of the forest will feature five hectares of greenery, including a park with a natural stream. Also, housing blocks will be designed to take into consideration the existing Ulu Pandan canal, which will be upgraded. For example, blocks nearer to the canal will be lower than the rest of the development to achieve a tiered effect and maximise views of the canal. A commercial development housing amenities will be built near [Dover MRT station](/wiki/Dover_MRT_station) to provide a link between the station and the developed area. Plans for the western half of the forest will be reviewed in 2030 when further development is required. However, a portion of it will be safeguarded as a nature park. In addition, as Singapore's first car-lite HDB precinct, the new estate will see roads placed only along its perimeter, away from pedestrian walkways and cycling paths. The estate was launched in 2022 with its first [Build-to-Order](/wiki/Build_to_order_(HDB)) (BTO) housing project named Ulu Pandan Banks. ### Dakota Crescent To be redeveloped into a mixed-use precinct, the existing [Dakota Crescent](/wiki/Dakota_Crescent) area will be largely revitalised with new public housing developments planned around six preserved [Singapore Improvement Trust](/wiki/Singapore_Improvement_Trust) (SIT) blocks and the iconic dove playground that were built in the 1950s. Although not formally gazetted for conservation, the central cluster of SIT-built blocks will be retained and repurposed for civic and community uses due to their historical significance as one of Singapore's first public housing projects built before the formation of the current [Housing and Development Board](/wiki/Housing_and_Development_Board) (HDB). All residents previously residing in the 17 low-rise SIT blocks have vacated in 2017. In February 2022, the first [Build-to-Order](/wiki/Build_to_order_(HDB)) (BTO) housing project, Dakota Crest, located in the former site of the low-rise flats was launched. ### Tanglin Halt One of Singapore's oldest housing estates, the [Tanglin Halt](/wiki/Tanglin_Halt) estate in [Queenstown](/wiki/Queenstown,_Singapore) will be redeveloped over the next ten to fifteen years with 5,500 new [Housing and Development Board](/wiki/Housing_and_Development_Board) (HDB) flats. Located on the site of the former neighbourhood centre, a 40-storey integrated development will house retail shops, a new hawker centre, and a market. The existing Queenstown Polyclinic will also be relocated to the integrated development. Aside from a new park within the estate, landscaping and recreational facilities will be built along the estate's [Rail Corridor](/wiki/Rail_Corridor_(Singapore)) stretch. The redevelopment plan was launched in 2023 with its first [Build-to-Order](/wiki/Build_to_order_(HDB)) (BTO) housing project named Tanglin Halt Cascadia. ### Farrer Park Announced on 25 April 2022, a 10-hectare (25-acre) site in [Farrer Park](/wiki/Farrer_Park) is set to be developed into a public housing estate with approximately 1,600 [Housing and Development Board](/wiki/Housing_and_Development_Board) (HDB) flats integrated with sports and recreational facilities to preserve and highlight the sporting heritage of the area. Approximately 20 per cent of the site will be reserved as open spaces, including a 1.2-hectare (3.0-acre) central green space with a field and a park. To be integrated within one of the housing developments, the existing Farrer Park Boxing Gym will be retained and repurposed into a multi-purpose community sporting space for residents residing in the estate. However, due to technical and cost considerations and difficulties, the existing Farrer Park Swimming Complex will not be retained but replaced with a new sporting centre housing sports facilities such as swimming pools. The new estate will also feature sports facilities integrated within a multi-storey car park, a jogging track connecting the various facilities in the estate, and commercial and social amenities such as retail shops and a childcare centre. The estate was launched in 2023 with its first [Build-to-Order](/wiki/Build_to_order_(HDB)) (BTO) housing project named Farrer Park Fields. ### Pang Sua Woodland Located in [Choa Chu Kang](/wiki/Choa_Chu_Kang), the existing 15-hectare Pang Sua Woodland is part of an approximately 22-hectare site to be developed with high-density residential developments integrated with the nearby [Rail Corridor](/wiki/Rail_Corridor_(Singapore)) and Pang Sua Canal. A key recommendation of establishing a green corridor within the site to preserve the ecological links to surrounding nature areas was published for public feedback on 5 April 2022 by the [Housing and Development Board](/wiki/Housing_and_Development_Board) (HDB) as part of an environmental study for the development of the area. Following the environmental study and public feedback, HDB published the redevelopment's revised plans on 6 July 2022. Aside from healthy and mature tree clusters within the sitre, at least two hectares of the existing woodland along the existing Pang Sua Canal will also be preserved. The original alignment of the Rail Corridor will also be retained as much as possible as part of the redevelopment. The estate was launched in 2023 with its first [Build-to-Order](/wiki/Build_to_order_(HDB)) (BTO) housing projects: Rail Green I, and Rail Green II @ CCK. ### Chencharu Announced in August 2022, ORTO leisure park and Ground-Up Initiative will have to vacate their current premises at Lorong Chencharu by June 2023 to make way for new housing developments. Located near [Khatib MRT station](/wiki/Khatib_MRT_station), the nearly 70-hectare (170-acre) Chencharu area was identified by the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) (URA) as part of [Yishun's](/wiki/Yishun) long-term land use plans. The future residential precinct is planned to house approximately 10,000 residential units by 2040, with majority of it being public flats. The official masterplan for the new neighbourhood was unveiled by the [Housing and Development Board](/wiki/Housing_and_Development_Board) (HDB) on 12 June 2024. Aside from residential flats, an integrated development housing a new bus interchange, hawker centre, and shops will be built. An educational institution and nursing home will also be part of the new Chencharu estate. To improve connectivity, a bus-only corridor will run from the north to the south of the new estate. The existing Ground-Up Initiative and Live Turtle and Tortoise Museum will be relocated to a site beside HomeTeamNS Khatib. An approximately century-old colonial-era bungalow located within the area is set to be preserved and integrated as part of the new residential area where it will sit atop a hill in the new neighbourhood park. A footpath will connect the new park to the existing neighbourhood park beside [Khatib MRT station](/wiki/Khatib_MRT_station). The estate was launched in 2024 with its first [Build-to-Order](/wiki/Build_to_order_(HDB)) (BTO) housing project named Chencharu Hills. ### Fernvale North Currently undergoing preparation works by the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) (URA), an 18.9-hectare site in [Fernvale](/wiki/Fernvale,_Singapore) North, [Sengkang](/wiki/Sengkang), will house approximately 10,000 new public and private residential units when fully completed. A park, place of worship, and a medical care facility will also be part of the new precinct. ### Miltonia Close Currently under development, the upcoming Miltonia Close estate in [Yishun](/wiki/Yishun) will comprise public and private housing developments. A 6.4-hectare nature park with a natural stream will also be part of the estate. The estate was launched in 2022 with its first [Build-to-Order](/wiki/Build_to_order_(HDB)) (BTO) housing projects: Aranda Breeze @ Yishun, Miltonia Breeze @ Yishun, and Vanda Breeze @ Yishun. ### Tampines North First announced on 29 August 2013, Tampines North is a new 240-hectare residential estate in the existing [Tampines](/wiki/Tampines) town. It consists of four housing zones namely Park West District, Green Walk District, Park East District, and Boulevard District. When fully developed, the estate will house 21,000 housing units of which 17,000 units will be [Housing and Development Board](/wiki/Housing_and_Development_Board) (HDB) units. Apart from small-scale neighbourhood park spaces, there will also be two major parks in the estate. Boulevard Park will run through the entire estate, connecting residents from [Sun Plaza Park](/wiki/Sun_Plaza_Park) to Sungei Api Api, while Quary Park will feature a sand quarry pond, inspired by the town's history. A landmark bridge will be built to link Quarry Park to Sun Plaza Park and Boulevard Park, seamlessly integrating the new estate into the existing town. The estate will also house a mixed-use development integrated with a new bus interchange. Aside from the new bus interchange, the estate will also be served by the future [Tampines North MRT station](/wiki/Tampines_North_MRT_station). The estate was launched in 2014 with its first [Build-to-Order](/wiki/Build_to_order_(HDB)) (BTO) housing project named Tampines GreenRidges. ### Population White Paper: Land Use Plan 2030 In 2013, the Singaporean government announced a new development plan \"Singapore 2030\" for Singapore, designed to accommodate the growing population. It is assumed that the population will reach between 6.5 and 6.9 million by 2030. Singapore will increase its land area to 766 km2 (296 sq mi) square kilometres through [land reclamation](/wiki/Land_reclamation_in_Singapore) from the sea. Most of the reclamation will be done at [Tekong](/wiki/Tekong_Island) and [Tuas](/wiki/Tuas) islands, with additional reclamation points beyond 2030 including Marina East, Changi East, and Pasir Ris. Singapore 2030 is part of the Land Use Plan to develop the mostly parts such as Tampines North (expansion), Tengah and Bidadari. There are ongoing projects such as 100,000 HDB flats to be built until 2030, followed by [Bukit Brown](/wiki/Bukit_Brown), and somehow post-2030 plans will consist of Paya Lebar Airbase and Southern Waterfront City. High-density towns with a full range of amenities such as childcare centers, hospitals, and recreational areas will be built. About 60% of Singapore's land will be set aside for housing, industry, and community facilities, up from 52%. In addition, 700,000 new housing units will be built, the size of the rail network will be doubled, and some golf courses and military training grounds will make way for redevelopment. According to the plans, 85% of Singaporeans will live close to a park. ### Long Island First envisioned in the 1991 Concept Plan as a reclaimed island for housing and leisure off the current east coast of Singapore, from [Marina East](/wiki/Marina_East) to [Changi](/wiki/Changi), the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) (URA) announced on 6 June 2022 that the Long Island could be developed for housing integrated with coastal parks and spaces for recreation. A reservoir and floodplains to protect the nation's coastline from rising sea levels are also in the development's long-term plans. Currently, there are no concrete plans for the development of Long Island. ### Former New Town Primary and Secondary School Campus Located beside [Commonwealth MRT station](/wiki/Commonwealth_MRT_station), the 7.6-hectare site housing the former [New Town Primary School](/wiki/New_Town_Primary_School) and [New Town Secondary School](/wiki/New_Town_Secondary_School) will be redeveloped into a residential area. ### Former Raffles Junior College Campus Located in Mount Sinai, near [Buona Vista MRT station](/wiki/Buona_Vista_MRT_station), the former [Raffles Junior College](/wiki/Raffles_Junior_College) (RJC) campus is set to be demolished for new developments such as housing, amenities, a school, and retail facilities. The site will be directly connected to the [Rail Corridor](/wiki/Rail_Corridor_(Singapore)) through new pedestrian links. Demolition works is scheduled to begin in 2024 and end in 2025. ### Proposed Residential Development at Singapore Science Park Announced by [CapitaLand](/wiki/CapitaLand) Development, a site next to the upcoming Geneo development in [Singapore Science Park](/wiki/Singapore_Science_Park) will be developed into a 300-unit condominium, making it the first residential development in the precinct. The residential development is set to be completed in the next three to four years. ## Transport ### Changi Airport Terminal 5 [Terminal 5](/wiki/Infrastructure_of_Singapore_Changi_Airport#Terminal_5) is set to be ready by the mid-2030s. It is expected to handle 150 million passenger movements per year, up from the current 82 million. The airport terminal structure is projected to be larger than all the previous terminals combined. It will be built on reclaimed land to the east of the present terminals. After construction delays of 2 years due to the [COVID-19 pandemic](/wiki/COVID-19_pandemic), work resumed in 2022 with the new terminal having broken ground on 14 May 2025. An underground link housing an automated people-mover system and a baggage handling system will be built to connect Terminal 5 with the existing Terminal 2 building 2.5 km away. Aside from future stations on the [Thomson-East Coast Line](/wiki/Thomson%E2%80%93East_Coast_Line) and [Cross Island Line](/wiki/Cross_Island_Line), Terminal 5 will also be direct connected to the existing [Tanah Merah Ferry Terminal](/wiki/Tanah_Merah_Ferry_Terminal), boosting its transport connections. ### Tuas Mega Port The S$20 billion Tuas Mega Port started its first phase of construction in 2016, with the second phase in 2019. To be opened in four stages from 2021, the port will consolidate all existing port operations at Tanjong Pagar, Pasir Panjang, Keppel, and Pulau Brani, and centralise it in the Tuas Terminal from 2027. When fully operational, the port can potentially handle a capacity of about 65 million [TEUs](/wiki/Twenty-foot_equivalent_unit) a year, double of the current capacity. New technologies will be employed to increase productivity. Approximately twice the size of [Ang Mo Kio](/wiki/Ang_Mo_Kio) town, when fully operational in 2040, the Tuas Mega Port will be the world's largest fully automated terminal, with features such as automated wharf and yard functions, and fully-electric automated guided vehicles to carry out its key operations. The project broke ground on 3 October 2019. To optimise land use, an area for leisure purposes is currently under study. The plan is to construct a 150-hectare (370-acre) area that will be elevated 42 metres above ground to house recreational amenities such as cafes, retail stores, and a jogging track. Large retail outlets such as [Tesco](/wiki/Tesco) and [Decathlon](/wiki/Decathlon_(retailer)) are being considered to bring in weekend crowds. The area will be partly opened for public use and its accessibility will be greatly improved if plans for the Tuas South MRT Extension on the [East West line](/wiki/East_West_MRT_line) come into fruition. ### Interim HarbourFront Ferry and Cruise Terminal To be developed by [Mapletree](/wiki/Mapletree_Investments), a two-storey interim facility to house the operations of the HarbourFront Ferry and Cruise Terminal will be built to relocate existing operations away from [HarbourFront Centre](/wiki/HarbourFront_Centre) as it is being redeveloped. No new piers will be built as existing jetties and pontoons in the area will be relocated while a covered linkbridge will connect the interim terminal to the existing pier serving the current terminal. A sheltered connection to the nearby HarbourFront Tower One will also be built as part of the construction. ### Thomson-East Coast Line (TEL)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:05:30.150327",
  "title": "Future developments in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Future_developments_in_Singapore"
}