{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:05:39.319610"
  },
  "content": "Malaysian convicted robber (born c. 1983) **Galing Anak Kujat**[a] (born c. 1983) is a convicted robber and a native [Malaysian](/wiki/Malaysians) of [Iban](/wiki/Iban_people) descent who came from [Sarawak](/wiki/Sarawak), [Malaysia](/wiki/Malaysia). He was best known to be the accomplice of [Kho Jabing](/wiki/Kho_Jabing), a convicted murderer who also came from Malaysia and was known for his years-long battle against the [death penalty in Singapore](/wiki/Death_penalty_in_Singapore). Galing and Kho were both involved in the 2008 robbery and murder of mainland [Chinese](/wiki/Chinese_people) national and [construction worker](/wiki/Construction_worker) Cao Ruyin in Singapore. Initially facing a murder charge and possible execution, Galing was eventually imprisoned and jailed for robbery with hurt. Kho Jabing, on the other hand, lost his appeal against his sentence in 2011, and his clemency petition also failed. Kho's sentence however, was commuted to a life sentence with 24 strokes of caning after Singapore's death penalty laws undergone a reform in 2013. After the prosecution successfully appealed for a new death sentence for Kho, he was eventually executed in 2016. The prosecution's appeal had also led to some main guidelines being set for the imposition of the death penalty for murder with no intention to kill, making Kho Jabing's case a landmark case in Singapore's legal history. Despite receiving less attention compared to his accomplice, Galing still played a role in Kho's case, and was one of the factors that led to the respective outcomes of the appeals (from both the defence and prosecution) related to Kho's case, which indirectly had an effect on Kho's fate, and on a large scale, the implementation of the guiding principles of the discretionary death penalty applied for murder cases in Singapore since the law's reforms in 2013. ## Early life Galing Anak Kujat was born sometime in 1983, and he was born and raised in [Sarawak](/wiki/Sarawak), [Malaysia](/wiki/Malaysia). Nothing is known about Galing's early life and childhood before he came to Singapore to work. It is possible that like thousands of foreigners before him, Galing came to Singapore to earn a better income to provide a better life for himself and his family, and possibly to settle in Singapore. ## Murder of Cao Ruyin On the afternoon of 17 February 2008, Galing Anak Kujat, who was then employed to load ships in a shipyard in Singapore, together with his friend [Kho Jabing](/wiki/Kho_Jabing), an employee of a [rag and bone](/wiki/Rag_and_bone) company, and their three friends and compatriots from Sarawak planned to rob two [Bangladeshi](/wiki/Bangladeshis) [construction workers](/wiki/Construction_worker) from the workplace of one of their three friends in [Tiong Bahru](/wiki/Tiong_Bahru). However, before the robbery plan could be executed, the two workers had left with their boss. The five remained in Tiong Bahru for drinks. After that, at about 7 pm, the five men went to [Geylang](/wiki/Geylang) for more drinks. During the trip, they had an argument over whether they should commit robbery in Geylang in view of their aborted robbery attempt earlier that day. Later on, Kho and Galing left the group. They walked together for a while before noticing two mainland Chinese men walking along a pathway in an open space near Geylang Drive. The men thus decided to rob the pair. The two mainland Chinese men - mainland Chinese nationals and construction workers Cao Ruyin ([Traditional Chinese](/wiki/Traditional_Chinese_characters): 曹如銀; [Simplified Chinese](/wiki/Simplified_Chinese_characters): 曹如银; [Pinyin](/wiki/Pinyin): *cáo rúyín*) and Wu Jun ([Traditional Chinese](/wiki/Traditional_Chinese_characters): 吳軍; [Simplified Chinese](/wiki/Simplified_Chinese_characters): 吴军; [Pinyin](/wiki/Pinyin): *wú jūn*) - were walking together in that same area after dinner when they were unknowingly targeted by the two Sarawakians. Kho picked up a fallen tree branch, and used it to hit one of the men, Cao, from behind. As Kho began to assault Cao, Galing joined in by using his belt to hit Cao after failing to catch up with Wu, who escaped to contact the police. The assault eventually stopped and the pair also took away Cao's [mobile phone](/wiki/Mobile_phone). From the attack, Cao suffered from 14 skull fractures, which also caused injuries to the [brain](/wiki/Brain). Cao was subsequently rushed to [Tan Tock Seng Hospital](/wiki/Tan_Tock_Seng_Hospital) where doctors operated on him twice to treat his head injuries, but despite the efforts of the doctors, Cao did not recover from these injuries and slipped into a [coma](/wiki/Coma). Six days later, on 23 February 2008, 40-year-old Cao Ruyin died. After Cao's death, [forensic](/wiki/Forensic_science) [pathologist](/wiki/Pathology) Teo Eng Swee conducted an autopsy on the deceased construction worker, and Teo later certified that it was the severe head injuries that killed him. ## Trial and sentencing ### Capture of Kho Jabing and Galing Anak Kujat After robbing Cao Ruyin and Wu Jun, Kho Jabing and Galing Kujat regrouped with their three friends and they together sold Cao's mobile phone for [S$](/wiki/S$)300. The five men used some of the proceeds to pay for their drinks and food while dividing the rest between themselves. Nine days later, police investigations led to the arrests of both Kho and Galing on 26 February 2008 (3 days after Cao's death). They were all indicted and remanded for [murder](/wiki/Murder), which carries the [mandatory death penalty](/wiki/Mandatory_death_penalty) under Singapore law at that time. Subsequently, their three friends are also arrested for the attempted robbery of the Bangladeshi workers. The trio were all sent to jail with caning some time before both Kho and Galing stood trial for murder. There is nothing known about how Galing's family reacted to his arrest or involvement in the brutal robbery-murder of Cao Ruyin. ### High Court murder trial The trial of Kho Jabing and Galing Anak Kujat began in July 2009. Galing was represented by lawyers Chandra Mohan s/o K Nair and Chia Soo Michael, while Kho was represented by lawyers Johan Ismail and Zaminder Singh Gill, while the prosecution consisted of Deputy Public Prosecutors (DPPs) Leong Wing Tuck and Gordon Oh of the [Attorney-General's Chambers](/wiki/Attorney-General_of_Singapore) (AGC). The case was heard before [Justice](/wiki/Judicial_officers_of_the_Republic_of_Singapore) [Kan Ting Chiu](/wiki/Kan_Ting_Chiu) in the [High Court](/wiki/High_Court_of_Singapore). Dr Teo Eng Swee, the pathologist who performed an autopsy on the victim Cao Ruyin and released a medical report, told the court that he believed that the skull fractures on Cao was caused by at least 5 blows or more, and one of these were possibly caused by either a blow or a fall on the back of the head. He added that the first few fractures were caused with severe force, and the subsequent ones resulted from less severe impacts on the head. When presented with Galing's belt buckle by the prosecution as a possible weapon used to cause the injuries, Dr Teo could not make any conclusions, but he confirmed from Galing's account that the tree branch which Kho used to hit Cao was capable enough to cause the fractures on Cao's skull. When cross-examined by Kho's lawyer over the possibility of a fall might cause the fractures, Dr Teo noted that he could not rule out that the fracture as being due to a fall, but the injuries were generally due to blunt force. When re-examined by the prosecution, Dr Teo confirmed that a fall could not cause all the injuries sustained by Cao. Cao's companion Wu Jun also testified how he was attacked by Galing and how he managed to escape and call the police, but he could not tell the court how his friend was attacked, whether himself or Cao was attacked first, or who attacked the deceased. Both men elected to go to the stand to put up their defence and have their statements admitted as evidence. Kho told the court that he only struck the deceased with the tree branch twice, but he claimed he did not know the force exerted or where he aimed at; the prosecution later indicated that he said so in his police statements that he hit the victim on the head twice. Other than that, Kho insisted that he only intend to rob but not to kill Cao Ruyin, stating that he felt deep remorse for causing the death of the victim. Kho also added that during the attack, he was intoxicated as a result of consuming too much alcohol earlier on before he robbed and assaulted Cao. Similar to his accomplice, Galing also claimed no intention to commit murder. His account, however, differed from his police statements; he initially told police he saw Kho hitting the victim several times and so hard that the skull cracked, but at the trial, he insisted that Kho hit the victim only once. The police officers interrogating Galing were later called to the stand and cross-examined by Galing's lawyers over the alleged inaccuracy of the statements. The officers maintained that they did not record the statements incorrectly. ### Verdict The trial ended on 30 July 2010, around two years and five months after Cao's death. Justice Kan Ting Chiu found both Kho Jabing and Galing Kujat guilty of murder and sentenced both of them to death by [long drop hanging](/wiki/Hanging#Long_drop) (the standard method of execution in Singapore). In his judgement, Justice Kan determined that both Kho and Galing shared a common intention to commit robbery. He also determined that Kho's actions of causing the injuries on the deceased victim was in the furtherance of the common intention of the pair to rob the victim and his friend, and that the injuries he intentionally caused were in the ordinary cause of nature to cause death, which constitutes an offence of murder committed under section 300(c) of the [Penal Code](/wiki/Penal_Code_(Singapore)). He also reject Kho's claim of alcohol intoxication as he cited that Kho was able to clearly recount the events that took place, showing full control of his faculties at the time. Justice Kan stated that Galing's participation in the robbery was an indication of him knowing that his accomplice's actions were likely to cause death and thus he also has to bear that same responsibility as Kho and thus he also convict Galing of murder in lieu of both their common intention, and sentence him to death together with Kho. ## Appeal and incarceration After their conviction and sentencing, both Kho and Galing jointly filed an [appeal](/wiki/Appeal) against their conviction and sentence. For the appeal process, one of Kho's original lawyers Johan Ismail was replaced by James Bahadur Masih, and Zaminder Singh Gill remained as Kho's defence lawyer. For Galing, his original defence counsel was completely replaced by lawyers N Kanagavijayan and Gloria James to help him in his appeal. DPP Gordon Oh remained in the prosecuting team while his partner Leong Wing Tuck was replaced by DPP Lee Lit Cheng from the AGC. Both men's appeals were heard before [Chief Justice](/wiki/Chief_Justice_of_Singapore) (CJ) [Chan Sek Keong](/wiki/Chan_Sek_Keong) and two [Judges of Appeal](/wiki/Judicial_officers_of_the_Republic_of_Singapore) (JA) [V. K. Rajah](/wiki/V._K._Rajah) and [Andrew Phang](/wiki/Andrew_Phang) in the [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore). On 24 May 2011, the Court of Appeal released their judgement, and Justice Rajah delivered the verdict. Coming to the appeal of Galing Kujat, the Court of Appeal disagreed with Justice Kan's decision to convict Galing of murder. They agreed that Galing did share a common intention with Kho to commit robbery and cause hurt, but not to intentionally cause any lethal injuries on the victim. They also added that there was no evidence to show the type of injury inflicted by Galing on Cao, no evidence on any discussion or planning, and also no evidence of Galing making any moves to make Kho to assault Cao more easily to cause him to sustain fatal skull fractures and death. Therefore, the Court of Appeal found Galing not guilty of murder and set aside his death sentence. Instead, they convicted him of a lower charge of robbery with hurt under section 394 of the Penal Code, and ordered that his case was to be remitted to the original trial judge for re-sentencing. The conviction for robbery with hurt means that Galing was no longer liable to the death penalty, but to a fixed term of imprisonment ranging between 5 and 20 years, and caning with not less than 12 strokes of the cane. For his part in the robbery of the Chinese nationals, Justice Kan re-sentenced Galing to 18 years and six months' imprisonment and 19 strokes of the cane on an unspecified date before Justice Kan's retirement on 27 August 2011. The outcome of Galing's re-sentencing went unreported, but this information was revealed in subsequent court documents and news articles covering Kho Jabing's murder case from 2013 onwards. However, for Kho's appeal, the three judges dismissed his appeal and upheld both his conviction and sentence. Chan stated that they were of the opinion that Kan was correct to convict Kho of murder as they agreed that Kho did intentionally cause the fatal injuries on Cao, which were sufficient to cause death even if he had no intent to kill the victim. They also agreed that from the review of evidence presented at the original trial, Kho had demonstrated a considerable amount of violence by inflicting several severe blows on the victim. This outcome left only Kho Jabing to hang for Cao Ruyin's murder while Galing managed to escape with his life. Kho had also petitioned to the [President of Singapore](/wiki/President_of_Singapore) for clemency, but it was rejected. If Galing maintains good behaviour while serving his sentence in prison, he would be released on one-third remission after serving at least two-thirds of his sentence (12 years and 4 months). Assuming that he was eligible for early release, Galing's possible release date would be between mid-2020 to late-2023, depending on when he started to serve his sentence. It is not known if Galing appealed against his new sentence. ## Fate of murder accomplice Kho Jabing After the loss of his appeal, and after Galing escaped the death penalty, Kho Jabing remained on [death row](/wiki/Death_row) since May 2011. However, he was given a lifeline when in July 2011, the [Singapore government](/wiki/Government_of_Singapore) decided to make a review of the mandatory death penalty in Singapore, which effectively imposed a moratorium on all the 35 pending executions in Singapore at that time, including Kho Jabing's. This review was completed in July 2012 and the amendments to the law were set to take effect on a later date. In January 2013, the law was amended to make the death penalty no longer mandatory for certain capital offences. Through the removal of the mandatory death penalty, the judges in Singapore were given an option to impose a discretionary sentence of [life imprisonment](/wiki/Life_imprisonment) with or without [caning](/wiki/Caning_in_Singapore) for offenders who commit murder but had no intention to kill (the death penalty remains mandatory only for murder offences committed with intention to kill, which came under section 300(a) of the Penal Code). This discretion is similarly applied to those convicted of drug trafficking, provided that they only act as couriers, suffering from impaired mental responsibility (e.g. [depression](/wiki/Major_depressive_disorder)) or any other conditions. For this, all death row inmates were given a chance to have their cases to be reviewed for re-sentencing and all the eligible cases will be remitted back to the original trial judge for re-sentencing. Because of this, through his newly appointed lawyers, Kho Jabing was granted re-sentencing, and on 14 August 2013, following a re-trial by the High Court, Kho Jabing's death sentence was reduced to life imprisonment and 24 strokes of the cane by High Court judge [Tay Yong Kwang](/wiki/Tay_Yong_Kwang), who took over the task of re-sentencing since the original trial judge Kan Ting Chiu was retired from the Bench at that point of time. The life sentence was also backdated to the date of Kho's arrest on 26 February 2008. With the outcome of his re-sentencing, Kho Jabing became the second convicted murderer on death row to be spared the gallows after 23-year-old death row inmate Fabian Adiu Edwin, who was similarly re-sentenced to life imprisonment and 24 strokes of the cane in July 2013 for robbing and murdering a security guard in August 2008 when he was merely 18 years old. However, the prosecution appealed against the life sentence, which marked the first time an appeal was made against the re-sentencing of a murderer to [life imprisonment in Singapore](/wiki/Life_imprisonment_in_Singapore). On 14 January 2015, the five-judge Court of Appeal, by a 3-2 majority decision, allowed the prosecution's appeal and sentenced Kho Jabing to death again the second time, because the majority of the five judges (three of them) felt that Kho had demonstrated viciousness and a blatant disregard for human life from his conduct at the time of the killing and the severity of Cao's injuries, which made the death penalty appropriate in Kho's case. After that, Kho subsequently made multiple appeals against the death penalty, including a clemency plea to [President of Singapore](/wiki/President_of_Singapore) [Tony Tan](/wiki/Tony_Tan). All these appeals were later dismissed. Kho Jabing was executed by hanging on the afternoon of 20 May 2016, shortly after the rejection of his final appeal on that morning itself. Kho Jabing was 32 years old when he died. ## Effect Even after his incarceration, Galing Kujat still made an influence, largely in the fate of Kho Jabing, as well as an indirect effect on the implementation of the guiding principles of the discretionary death penalty applied for murder cases in Singapore since the law's reforms in 2013; this also led to Galing indirectly having an effect on the sentencing and appeal outcomes of some murder cases affected by the guiding principles o the death penalty, though less significantly than Kho Jabing and the 2015 appeal verdict. To an extent, without the guidelines of the death penalty, Galing's case also had an effect on at least one other case involving other crimes unrelated to Kho Jabing's case. ### Kho Jabing's re-sentencing phase (2013) In May 2013, the case of Kho Jabing, together with that of another convicted murderer on death row, became the first two cases to gain approval and ordered to be sent back to the High Court for re-sentencing after the confirmation that both cases were convictions for murder under Section 300(c) of the Penal Code (this section considers an act of intentionally inflicting fatal injuries on a victim as murder but not with the intention to kill). Kho thus undergo a re-trial with regards to the final sentence for his murder conviction. The prosecution argued that Kho should be sentenced to death, stating that Kho had displayed violence during the time of killing. His conduct and that of Galing's, together with their violent acts, would bring disquiet to society and made them have a fear that the ill-fortune that befallen on Cao Ruyin and his friend Wu Jun will similarly befall on them. The prosecutors also referred to Galing's police statements to support their case, in which Galing described the skull had cracked open during Kho's assault of Cao, to highlight how Kho's conduct and the gravity of the injuries of Cao were deserving of the death penalty. The defence argued that Kho was genuinely remorseful of his actions, highlighting his sincere wish to seek forgiveness from Cao's bereaved family and the personal tragedies Kho and his family faced throughout the court proceedings and before his re-trial, especially the death of Kho's father four months after his son's arrest, for which Kho never had a last time seeing him before he passed on in their mitigation plea for life imprisonment instead of death. The defence also said that Kho had no criminal history in both Malaysia and Singapore prior to Cao's murder, the lack of weapons beforehand, and his only intention was to rob the deceased but not to take his life and not the mastermind of the robbery. Making use of Galing again, Kho's lawyers highlighted that Galing was convicted of a lower and non-capital charge of robbery with hurt instead of murder, for which both their respective roles and culpability meant that sentencing Kho to life in prison instead of death would be more appropriate in terms of parity in sentencing. After careful consideration, and after referring to the judgements from both the High Court and the Court of Appeal (since he was not the original trial judge), Justice Tay Yong Kwang decided to re-sentence Kho to life imprisonment and overturned the death penalty originally imposed upon Kho since 2010. He said that there was an unclear and disputed sequence of events, and the young age of Kho were factors that made him decided to not impose the death sentence. He also said that the death sentence was inappropriate due to the \"opportunistic and improvisational\" use and choice of weapon on Kho's part, which he pointed out was equally so when Galing used his belt buckle to assault the fallen victim during both Kho and Galing's attack on the night itself. Justice Tay also sentenced Kho to receive 24 strokes of the cane on behalf of the violence he exhibited when he robbed and fatally assaulted 40-year-old Cao Ruyin in 2008. The life sentence was backdated to the date of Kho's arrest. ### The prosecution's appeal against Kho Jabing's life sentence (2015) This was not the end of Kho Jabing's ordeal. The prosecution filed an appeal in November 2013, and it was heard four months later in March 2014. The prosecution argued that the death penalty was more appropriate than life imprisonment in Kho's case, because during his attack on Cao Ruyin, Kho had done so in an extremely vicious manner and did not relent even after Cao Ruyin was knocked down by the first blow and continued to assault him repeatedly. They said that Kho may have chanced upon the murder weapon (the tree branch), but the fact was he used it when he rained strikes with great force on Cao's head. On 14 January 2015, the five-judge Court of Appeal returned with a 3-2 majority decision in favour of allowing the prosecution's appeal, and Kho was once again sentenced to death. Three of the five judges, Judges of Appeal [Chao Hick Tin](/wiki/Chao_Hick_Tin) and [Andrew Phang](/wiki/Andrew_Phang) and High Court judge [Chan Seng Onn](/wiki/Chan_Seng_Onn) felt that the death penalty should be given to Kho, while both High Court judges [Lee Seiu Kin](/wiki/Lee_Seiu_Kin) and [Woo Bih Li](/wiki/Woo_Bih_Li) disagreed. In the majority judgement, Justice Chao, who read out the judgement, stated that Kho Jabing had not cared whether Cao will survive the attack when he relentlessly bludgeon Cao's head with the tree branch despite the undisputable fact that he and Galing Kujat only intend to rob both Cao and his friend Wu Jun. They made a reference to the medical report of forensic pathologist Dr Teo Eng Swee, which stated that the skull fractures resulted from severe force, which made it clear that more likely, Kho's tree branch was the more possible weapon that caused the fractures compared to Galing's belt buckle. They referred to Galing's police statement, which described how Kho assaulted Cao, the number of times Kho hit Cao and the resulting extent of the injuries sustained by Cao, which Galing witnessed and tried to downplay (possibly) in his testimony during the original trial. The judges judged that it was inconclusive to ascertain which were the exact injuries which were caused by Galing, but on the whole, they found that most of the fractures were caused by Kho. After considering Galing's statements, as well as the medical evidence and the evidence of Kho's conduct during the time of the killing, the three judges raised Kho's life sentence to death. On the other hand, the two remaining judges, Lee and Woo, dissented with separate judgements and upheld the life sentence while dismissing the prosecution's appeal. Lee and Woo, having considered Galing's police statements and oral testimonies among the many evidence, found that Kho, at most, struck the deceased twice as it was insufficient to prove beyond a reasonable doubt that Kho had done the hitting more than twice based on the statements of Galing and both Kho and Wu; they found Galing's statements were not to be believed, since he had the possibility to downplay his role in the murder and push more blame on Kho. Additionally, Woo said that there is some risk relying on Galing's evidence due to the discrepancies in his evidence to the police and on court and that he might be inclined to concoct some of it to deflect blame from himself for Cao's unfortunate death. ### The guiding principles of the discretionary death penalty for murder (2015) Through the decision and considerations of sentencing Kho Jabing to death a second time, Galing Kujat had indirectly had an effect on the death penalty laws in Singapore, albeit less significantly than his accomplice. The landmark ruling, in which Galing's police statements and oral testimonies were among those factors considered before reaching the outcome, had also set the main guiding principles for all judges in Singapore to decide whether to impose a life sentence or a death sentence in the future murder cases, where offenders killed their victims with no intention to kill, by considering if there are viciousness and/or a blatant disregard for human life in terms of the conduct of the criminal himself/herself at the time of the killing. The guiding principles were referred to in some subsequent murder cases like the [Gardens by the Bay murder](/wiki/Gardens_by_the_Bay_murder) case, the [Circuit Road flat murder](/wiki/Circuit_Road_flat_murder), the [2010 Kallang Slashings](/wiki/2010_Kallang_Slashings), the [murder of Dexmon Chua Yizhi](/wiki/Murder_of_Dexmon_Chua_Yizhi) and a few others, as well as some appeals related to murder cases from both the defence and the prosecution. ### The sentencing of Miya Manik (2020) Galing Kujat's case was referred to and mentioned in another case which involves the murder of one Bangladeshi named Munshi Abdur Rahim, an illegal syndicate leader, though ultimately, one of the offenders and the only one of them that claimed trial would be convicted of voluntarily causing grievous hurt with a dangerous weapon instead of murder. On 24 September 2016, 32-year-old Munshi Abdur Rahim was fatally slashed to death at a field nearby Tuas View Dormitory by three Bangladeshi men, who came from a rival syndicate that illegally sold contraband cigarettes. THis resulted from a clash between both syndicates. Two of the unidentified attackers went on the run till today while the third, 31-year-old Miya Manik, was arrested and charged with murder under Section 300(c) of the Penal Code, for which Manik would have been either jailed for life and caned, or put to death if convicted. Manik alone claimed trial for murder in January 2020 and the trial lasted for 11 days until 18 June 2020. On 18 June 2020, High Court judge Valerie Thean acquitted Manik of murder, and instead convict Manik of using a chopper to voluntarily cause grievous hurt to Rahim. Justice Thean rejected the prosecution's arguments that Manik was guilty of murder either by causing the fatal injury or sharing a common intention with the two unknown accomplices (who were only identified as \"Aziz\" and \"Mitho\") to cause the fatal injury. The medical evidence showed that Rahim died from a deep gash that cut a main artery in his left leg, while the other slash wounds were superficial or not lethal in nature, or not directed at any vulnerable parts of Rahim's body. \"The bus camera footage was not of a high quality, some of the scenes were dark, and in some frames, the view of Rahim's legs was obstructed by the assailants' bodies, and it did not show important details of how the assailants struck Rahim,\" the judge said as she convicted Manik, who denied inflicting the fatal injury and the knowledge that his other two accomplices would inflict the fatal injury. She also noted that the plan was not to kill originally. The lower conviction meant that Manik would face a sentence of either life imprisonment or up to 15 years' imprisonment and liable to caning. After his conviction, the date of Manik's sentencing was fixed on 20 July 2020 and both the prosecution and defence are allowed to make their submissions on sentencing to the judge. With regards to the sentence, the prosecution sought a sentence of 15 years' imprisonment and at least 14 strokes of the cane based on the violence of the attack and the vulnerability of the victim during the attack. They said that the case involved \"profit-driven syndicated violence\", and there should be a stiff deterrent sentence meted out to discourage such calculated syndicated violence. The defence argued for 10 years' imprisonment and 10 strokes of the cane on account of Manik's remorse over the attack and cooperation with the police. After considering the sentencing submissions, on 20 July 2020, Justice Thean sentenced Manik to 15 years' imprisonment and 15 strokes of the cane, and backdated Manik's sentence to the date of his remand on 30 September 2016. During sentencing, Justice Thean said that she did not believe Manik was entirely remorseful of his actions, pointing out that Manik had made many inconsistent claims in his evidence in court and to the police, such as denying that he was armed with a chopper. She described the manner of the attack as \"vicious and terrifying\", and the motive of the attack was to get more profits for the syndicate Manik and his fellows members pledged allegiance to. With regards to the appropriate sentence needed, Justice Thean made reference to Galing Kujat's case and a few others before reaching her decision. Comparing both Galing's (robbery with hurt) and Manik's case (causing grievous hurt with dangerous weapons), despite the two different convictions and differences of the sentences warranted for the two respective crimes, Justice Thean said that both cases involved a group attack, and Manik's case was more serious and aggravating since it was committed with planning and premeditation, and were armed beforehand, and involved a syndicate participation, whereas Galing and Kho Jabing did not done any of the above when they robbed Cao Ruyin and Wu Jun. Besides, Justice Thean said that Manik did not plead guilty and was armed in contrast to another person - Muhammad Faizal bin Md Jamal - who was sentenced to 8 years and 6 months' imprisonment and 8 strokes of the cane for a reduced charge of causing hurt to a murder victim in a separate murder case. As such, Justice Thean held that the appropriate sentence for Manik was 15 years' imprisonment and 15 strokes of the cane. - [Kho Jabing](/wiki/Kho_Jabing) - [Ronald Ebens](/wiki/Ronald_Ebens) - [Capital punishment in Singapore](/wiki/Capital_punishment_in_Singapore) ## Notes\n",
  "language": "en",
  "processed_at": "2026-01-12T11:05:39.319126",
  "title": "Galing Kujat",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Galing_Kujat"
}