{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:05:43.197731"
  },
  "content": "The **Gan Eng Seng School's Founding Site** ([Chinese](/wiki/Simplified_Chinese_characters): 颜永成学校创校地点), marked by twin commemorative [plaques](/wiki/Commemorative_plaque) at present, is located at the junction of [Telok Ayer Street](/wiki/Telok_Ayer_Street) and Cecil Street in the southern part of Singapore, near the [Telok Ayer Chinese Methodist Church](/wiki/Telok_Ayer_Chinese_Methodist_Church). On 30 August 1997, the site was designated as a national historical site along with five other schools by the [National Heritage Board](/wiki/National_Heritage_Board_(Singapore)) (NHB), being one of the oldest educational establishments in Singapore. The others are [Raffles Institution](/wiki/Raffles_Institution), [Raffles Girls' School](/wiki/Raffles_Girls%27_School), St Margaret's Secondary School, [Singapore Chinese Girls' School](/wiki/Singapore_Chinese_Girls%27_School) and [Anglo-Chinese School](/wiki/Anglo-Chinese_School). ## History The first building site of [Gan Eng Seng School](/wiki/Gan_Eng_Seng_School) ([Abbreviation](/wiki/Abbreviation): GESS) was located at No. 106 [Telok Ayer Street](/wiki/Telok_Ayer_Street) between 1893 and 1941. A land grant was given by the British [colonial government](/wiki/Straits_Settlements) earlier to the philanthropist and founder, Mr [Gan Eng Seng](/wiki/Gan_Eng_Seng) who paid [S$](/wiki/Straits_dollar)5000 for the construction of the school building. Gan was credited for being the first local [Chinese in Singapore](/wiki/Chinese_in_Singapore) to establish the free school in 1885 which emphasised bilingual education through his generous gift of property and funds until his demise. Most other schools of the time were established by missionary or communal organisations. The school was a two-storey wooden building and housed the school hall in the second storey. It started out as a primary school for boys and could accommodate up to 300 students. Governor H.E. Sir [Clementi Smith](/wiki/Cecil_Clementi_Smith) officiated the school's Opening Ceremony on 4 April 1893. Mr [Tan Keong Saik](/wiki/Keong_Saik_Road), a board trustee of the school briefly gave a history of the institution to the distinguished gathering. In 1908, a second school building was added to ease the overcrowding it faced with each passing year. The school was able to accommodate an almost twofold increase in students population of 641 afterwards. The school was finally abandoned in 1941 when the old section of the building was considered unsafe for use and it was housed temporarily in Sepoy Line Malay School in Park Road and Pearl's Hill School later. ### Marking ceremony On 30 August 1997, a marking ceremony was held at the junction of [Telok Ayer Street](/wiki/Telok_Ayer_Street) and Cecil Street with twin structures jointly erected by the GESS Old Students' Association, the Singapore Gan Clan Association and the [National Heritage Board](/wiki/National_Heritage_Board_(Singapore)) near the historic site. Named *In Dialogue*, it consists of two granite miniature towers with plaques depicting the school's story and information on the founding site to symbolise the ongoing dialogue between the past and present generations of its students. About 600 past and present students returned to the site of the building which had been demolished and witnessed the marking ceremony. Distinguished alumnus like Dr. [S. Vasoo](/wiki/S._Vasoo), Member of Parliament for [Tanjong Pagar GRC](/wiki/Tanjong_Pagar_Group_Representation_Constituency), Mr. [Chua Kim Yeow](/wiki/Chua_Kim_Yeow), former [Accountant General](/wiki/Accountant_General) and [Presidential Candidate](/wiki/Presidential_elections_in_Singapore), and retired [Emeritus Professor](/wiki/Emeritus_Professor) Kiang Ai Kim of the [National University of Singapore](/wiki/National_University_of_Singapore), were invited to grace the event. The school story plaque reads: > In 1885, Gan Eng Seng founded a free school for poor boys in Singapore. Initially named the Anglo-Chinese Free School, it was among the earliest schools to offer a bilingual education. The school moved to its first new building about 50 metres (160 ft) behind the [Telok Ayer Chinese Methodist Church](/wiki/Telok_Ayer_Chinese_Methodist_Church) in 1893. It became known as Gan Eng Seng School in 1923. > After [World War II](/wiki/World_War_II), its principal, Percival Frank Aroozoo, was determined to re-open it. The school found a new home in 1951 at Anson Road. It was re-sited to Raeburn Park in 1986, where it stands proud and strong to this day, much beloved by generations of students who passed through its portals. ONWARD! – National Heritage Board At present, the school is located at 1 Henderson Road with a student population of 1,300. - Singapore portal - [Gan Eng Seng](/wiki/Gan_Eng_Seng) - [Gan Eng Seng School](/wiki/Gan_Eng_Seng_School) - [Ministry of Education (Singapore)](/wiki/Ministry_of_Education_(Singapore)) ### Notes ### Bibliography - Picture gallery of past GESS school sites. - Pioneer Education Institutions 01°16′41.16″N 103°50′49.66″E﻿ / ﻿1.2781000°N 103.8471278°E﻿ / 1.2781000; 103.8471278\n",
  "language": "en",
  "processed_at": "2026-01-12T11:05:43.197251",
  "title": "Gan Eng Seng School Founding Site",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Gan_Eng_Seng_School_Founding_Site"
}