{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:05:41.216978"
  },
  "content": "Chinese philanthropist (1844–1899) **Gan Eng Seng** ([simplified Chinese](/wiki/Simplified_Chinese_characters): 颜永成; [traditional Chinese](/wiki/Traditional_Chinese_characters): 顏永成; [pinyin](/wiki/Pinyin): *Yán Yǒngchéng*; [Pe̍h-ōe-jī](/wiki/Pe%CC%8Dh-%C5%8De-j%C4%AB): *Gân Íng-sîng*; c. 1844–1899) was a Chinese businessman and philanthropist who was one of the early pioneers of Singapore. He is known for his generosity to many charitable causes in [Malaya](/wiki/British_Malaya) and Singapore during the British colonial era. Some of his most recognised contributions were the setting up of [Gan Eng Seng School](/wiki/Gan_Eng_Seng_School), the Thong Chai Medical Institution, [Tan Tock Seng Hospital](/wiki/Tan_Tock_Seng_Hospital), and the [Ee Hoe Hean Club](/wiki/Ee_Hoe_Hean_Club). ## Biography Gan was of [Hokkien](/wiki/Hoklo_people) Chinese descent, born and educated in [Melaka](/wiki/Malacca), and the eldest son of five in his family. His forefathers immigrated from [Fujian](/wiki/Fujian), [China](/wiki/China), to [Malaya](/wiki/Malaysia). Owing to poor circumstances, he had an elementary school education in which he learnt to read and write in simple English and keep accounts. After his father's death, Gan, then 16 years old, was involved in the [nutmeg](/wiki/Nutmeg) business on a very small scale. Gan was later taken as an apprentice by [Guthrie and Company](/wiki/Guthrie_(Malaysia)). He was diligent and capable, and his ability won him the recognition and keen interest of Thomas Scott, one of the partners in the company. Scott was one of the early British pioneers responsible for developing [Tanjung Pagar](/wiki/Tanjong_Pagar) and the port of Singapore. Gan was subsequently promoted to the post of Assistant Storekeeper and then Chief Storekeeper of the company. In 1874, he became the company's Chief Compradore, a position which he held for the next 25 years. Scott later helped to finance some of Gan's early business ventures, one of which was to supply labour and transport to the Tanjong Pagar Dock Company which helped Gan make most of his personal fortunes. In 1895, Gan was one of the co-founders of the [Ee Hoe Hean Club](/wiki/Ee_Hoe_Hean_Club), a social-cum-business club where like-minded Chinese businessmen could mingle and exchange ideas. Its members included notable Chinese pioneers such as [Lim Boon Keng](/wiki/Lim_Boon_Keng), [Tan Kah Kee](/wiki/Tan_Kah_Kee), [Lim Nee Soon](/wiki/Lim_Nee_Soon) etc. It was originally located on [Duxton Hill](/wiki/Duxton_Hill) but moved to [Bukit Pasoh Road](/wiki/Bukit_Pasoh_Road) in 1925. The club plays an active role in community services and charity work to this day. ## Philanthropy ### Education #### Gan Eng Seng School Although Gan had little education, he realised its value as he prospered and became wealthy. His dream to build a school for the poor which taught both English and Chinese (Hokkien, as Mandarin was not commonly used in Southeast Asia then) was fulfilled in 1885, when he built the *Anglo-Chinese Free School* for boys in some shophouses in [Telok Ayer Street](/wiki/Telok_Ayer_Street) (not related to the [Anglo-Chinese School](/wiki/Anglo-Chinese_School) founded a year later by Bishop W.F. Oldham). In 1923, it was renamed to [Gan Eng Seng School](/wiki/Gan_Eng_Seng_School) (GESS) in his honour. Gan Eng Seng School is unique among the schools in Singapore being the only one initiated, established and maintained by a local citizen with a gift of freehold property, buildings and adequate funds until his demise. Most other schools of the time were established by missionary or communal organisations. Before it became a government school in 1938, it had on its [board of trustees](/wiki/Board_of_trustees) fellow Chinese pioneers such as Tan Keong Saik, Ho Yang Peng, Wee Theam Tew, Lee Cheng Yan, S.J. Chan, Wee Swee Teow, [Song Ong Siang](/wiki/Song_Ong_Siang), and [Lim Boon Keng](/wiki/Lim_Boon_Keng). Under their management, Gan Eng Seng School was able to serve the local community as a self-funded school for nearly forty years without interference. #### Other countries Gan also founded a school for the poor in the village of Sam-toh in Fujian, China, where his forefathers were born, and helped to finance and maintain the Tranquerah Chinese Free School in Melaka. He also enabled young men of promise to realise their potential by paying for their university education. ### Public health #### Thong Chai Medical Institution The [Thong Chai Medical Institution](/wiki/Old_Thong_Chai_Medical_Institution) was another major charity which Gan strongly backed and financed. It was established in 1867 and is the oldest charitable institution in Singapore. It began treating the poor of all races and religions in a rented shophouse at 31 Upper Pickering Street. In 1975, it was relocated to 50 Chin Swee Road and till today, the institution continues to provide free medical consultation and herbal medicines to all. #### Tan Tock Seng Hospital Gan was always among the first to respond to pleas for donations, giving thousands of dollars to local hospitals. He also helped to pay for coffins to bury the poor. The 1892 annual report of [Tan Tock Seng Hospital](/wiki/Tan_Tock_Seng_Hospital) mentioned that Gan donated a freehold property at Rochor to the hospital. The hospital is still serving the public and came into the international spotlight when it was designated as the sole treatment centre for the [SARS](/wiki/SARS) epidemic which struck Singapore in 2003. ## Personal life Gan married his first wife, Ho Chwee Neo, at the age of 18, and in 1859 adopted his first son, Gan Tiang Tock, who was an important partner in the building of his fortune. He had a total of five wives, seven sons and two daughters. However, only two of his children were born by his wives; his other children were adopted, a customary practice which was then considered auspicious. ## Death On 9 September 1899, Gan died at the age of 55 in his house at No. 87 [Amoy Street](/wiki/Amoy_Street,_Singapore). His total assets were worth an estimated S$550,000. He was buried at *Leng Kee Sua* somewhere on the hill by the side where Leng Kee Road runs today. Due to redevelopment of the area, his body was disinterred and reburied in a family grave at [Bukit Brown Cemetery](/wiki/Bukit_Brown_Cemetery). After the death of his father, Gan Tiang Tok continued the family business for three years, though by the turn of century it was no longer so lucrative. Gan Tiang Tok was dogged by ill health from 1903 until his death in 1927 at the age of 68. ## Legacy In April 2008, Gan's life and generosity to many charitable causes are currently being showcased in a permanent gallery of the [Peranakan Museum](/wiki/Peranakan_Museum) (former [Tao Nan School building](/wiki/Old_Tao_Nan_School)) at [Armenian Street](/wiki/Armenian_Street,_Singapore). The gallery titled *Public Life: Making a difference* (Level 3) honours *[Peranakans](/wiki/Peranakan)* (Straits Chinese), who were prominent public figures and philanthropists such as Gan, Singapore pioneer [Tan Kim Seng](/wiki/Tan_Kim_Seng) and former Cabinet Minister [Lim Kim San](/wiki/Lim_Kim_San). The Peranakan Museum presents a Southeast Asian-wide view of Peranakan culture and houses a comprehensive collection of Peranakan artefacts. The museum is the latest addition to the [National Heritage Board](/wiki/National_Heritage_Board_(Singapore))'s family of museums and is managed by the [Asian Civilisations Museum](/wiki/Asian_Civilisations_Museum) (ACM). The ACM staff consulted academics and collaborated with members of the Peranakan community to bring the museum to life. - Singapore portal - [Tan Tock Seng](/wiki/Tan_Tock_Seng) - [Lee Choon Seng](/wiki/Lee_Choon_Seng) ## Notes ## Bibliography - \"Gan Eng Seng | Infopedia\". *eresources.nlb.gov.sg*. Retrieved 23 September 2022.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:05:41.216427",
  "title": "Gan Eng Seng",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Gan_Eng_Seng"
}