{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:05:45.213974"
  },
  "content": "Asian food manufacturing company **Gardenia Foods (S) Pte Ltd.** (also known as **Gardenia Bakeries** or **Gardenia**) is a Singaporean baked-goods company with presence in [Singapore](/wiki/Singapore), [Brunei](/wiki/Brunei), [Indonesia](/wiki/Indonesia), [Malaysia](/wiki/Malaysia) and the [Philippines](/wiki/Philippines). It is listed on the [Singapore Exchange](/wiki/Singapore_Exchange) (SGX) via its parent company, QAF Limited, which also owns Bonjour Bakery, and are headquartered at the [Chinatown Complex](/wiki/Chinatown,_Singapore) in [South Bridge Road](/wiki/South_Bridge_Road). ## History Gardenia was established by Horatio Sye Slocumm, an American who was an employee of [International Executive Service Corps](/wiki/International_Executive_Service_Corps) and worked with bakeries based in the United States. Gardenia started out as a store bakery in Singapore, but due to demand opened a commercial bakery at Pandan Loop in March 1983. This was followed by a second bakery in June 1993. In 2019, Gardenia stated that its products would be in compliance with the [Government of Singapore](/wiki/Government_of_Singapore) ban via the [Ministry of Health](/wiki/Ministry_of_Health_(Singapore)) in accordance with the [Health Promotion Board](/wiki/Health_Promotion_Board) (HPB) on [hydrogenated oils](/wiki/Hydrogenated_oils) (PHOs), a major source of artificial [trans fat](/wiki/Trans_fat). It also added that all of their products at the time were already PHO-free since the early 2000s prior to the ban, which came into effect in June 2021. ## Operations in other countries Gardenia's operations outside of Singapore is managed by separate subsidiary companies: Gardenia Bakeries (KL) Sdn Bhd (GBKL) in [Peninsular Malaysia](/wiki/Peninsular_Malaysia), which, from 2017, has stakes that are 50% owned by Malaysian rice company Padiberas Nasional Berhad Gardenia Bakeries Philippines, Inc. in the Philippines, and Gardenia Food Industries Sdn Bhd in Brunei. Production in the particular Malaysian states of [Sabah](/wiki/Sabah) and [Sarawak](/wiki/Sarawak) plus the Indonesian [Kalimantan](/wiki/Kalimantan) region is licensed to Kim Teck Cheong Consolidated since 2020; which uses different recipes to products sold in the Peninsula under GBKL. In 2013, they also expanded to the [Indonesian](/wiki/Indonesia) market outside Kalimantan under PT Gardenia Makmur Selaras in [Bogor](/wiki/Bogor). According to the 2015 annual report of QAF Limited, Andree Halim is the largest shareholder in the Singapore listed bakery firm, which owns the biggest market share in packaged bread in [Singapore](/wiki/Singapore), [Indonesia](/wiki/Indonesia), [Malaysia](/wiki/Malaysia) and the [Philippines](/wiki/Philippines). Andree is the son of the late [Indonesian](/wiki/Indonesia) business tycoon [Sudono Salim Liem Sioe Liong](/wiki/Sudono_Salim), the founder of [Salim Group](/wiki/Salim_Group). Lin Kejian, meanwhile, is the son of Andree Halim, essentially the substantial owners of QAF are related to Salim Group. [Indomarco Prismatama](/wiki/Indomaret), a 40% owned unit of [PT Indoritel Makmur Internasional Tbk](/wiki/Indomaret), is the main distributor of PT Gardenia Makmur Selaras in [Indonesia](/wiki/Indonesia), which distributes the bread through [Indomaret](/wiki/Indomaret) under the brand name “Prime Bread”. Gardenia Food Industries has been operating in [Brunei](/wiki/Brunei) since 1972, and is currently the country's top manufacturer and wholesale dealer of bread, buns, cakes and pastries. Gardenia entered the Philippine market in 1997. Its main bread-manufacturing facility in the country is located in [Laguna](/wiki/Laguna_(province)). It operates at least three other facilities: in [Mabalacat](/wiki/Mabalacat) ([Pampanga](/wiki/Pampanga)), [Cagayan de Oro](/wiki/Cagayan_de_Oro) and [Cebu](/wiki/Cebu). Vitabread Food Products Inc. is responsible for the manufacturing of Gardenia products for the [Luzon](/wiki/Luzon) market. Until late 2017, Gardenia expanded its operations to the Asian market in [Singapore](/wiki/Singapore), [Brunei](/wiki/Brunei), [Indonesia](/wiki/Indonesia), [Malaysia](/wiki/Malaysia), the [Philippines](/wiki/Philippines), [Australia](/wiki/Australia) and [China](/wiki/China). - Media related to Gardenia Bakeries Philippines, Inc. at Wikimedia Commons - Official website - Parent website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:05:45.213493",
  "title": "Gardenia Foods",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Gardenia_Foods"
}