{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:05:49.189446"
  },
  "content": "Singaporean model and beauty queen (born 1986)This biography of a living person **needs additional citations for verification**. Please help by adding reliable sources. Contentious material about living persons that is unsourced or poorly sourced **must be removed immediately** from the article and its talk page, especially if potentially libelous. *Find sources:* \"Gayatri Shunmugam\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(November 2008)* *(Learn how and when to remove this message)* **Gayatri Shunmugam** (born June 2, 1986) is a [Singaporean](/wiki/Singapore) model and beauty queen. ## Biography Gayatri was born in Singapore and moved to [Chennai](/wiki/Chennai) when she was just six months old. At the age of six she moved back to Singapore to complete her education. She studied in [St. Margaret's Secondary School](/wiki/St._Margaret%27s_Secondary_School) and then [Saint Andrew's Junior College](/wiki/Saint_Andrew%27s_Junior_College). After completing her degree, Shunmugam worked with [Singapore Airlines](/wiki/Singapore_Airlines) as a flight attendant for two years and taught briefly at Saint Andrew's Secondary School. She started modeling at the age of 18 and has appeared in advertisements for Intel and Beneath the Stars Jewellery. In May 2008, she came in as 2nd runner-up in [Miss Singapore Universe](/wiki/Miss_Singapore_Universe) 2008. She emerged as one of the major title winners as Miss Singapore 2008. She was the first Tamilian of Indian origin to have won a title at Singapore's most prestigious pageant. This biography article about an Asian contestant in a beauty pageant is a stub. You can help Wikipedia by expanding it. - v - t - e This Singaporean biographical article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:05:49.189015",
  "title": "Gayatri Shunmugam",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Gayatri_Shunmugam"
}