{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:05:53.222669"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Gek Poh Ville\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(August 2016)* *(Learn how and when to remove this message)*Place in Singapore **Gek Poh Ville**[note 1] is a residential precinct in [Jurong](/wiki/Jurong), named after 'Gek Poh Road', a street that existed before [Pioneer](/wiki/Pioneer,_Singapore) was developed. The Singapore Boys Home, Saint Joseph's Home and Thonghup Gardens (Plant Nursery) are also located in the precinct. ## History Jurong West Neighbourhoods 7 and 8 of Gek Poh Ville was formerly the site of a village called Kampung Gek Poh. Bulim Cemetery was formerly in the precinct but was exhumed and developed into Jurong West Neighbourhood 2. ## Infrastructure ### Roads The main roads in the precinct are Jurong West Avenue 3/4/5 and Jalan Bahar, which connects the precinct to the rest of the island through the [PIE](/wiki/Pan_Island_Expressway)(exits 36), with minor roads (Jurong West Street23/24/25/72/73/74/75) winding through the various zones in the precinct. ### Recreation The Jalan Bahar Park is the major park, apart from the many playing courts and exercise corners across the precinct. A jogging-cum-cycling dual track runs through zone 7 of the precinct. The nearest sports and recreational centre is the [Jurong West Sports and Recreation Centre](/wiki/Jurong_West_Sports_and_Recreation_Centre), which is accessible from the various zones through bus services 185 and 243. ## Politics Gek Poh Ville was formerly part of the [Hong Kah North Single Member Constituency](/wiki/Hong_Kah_North_Single_Member_Constituency) (SMC) but the SMC is now part of [West Coast Group Representation Constituency](/wiki/West_Coast_Group_Representation_Constituency) (GRC). The electoral division is currently represented by [Hamid Razak](/wiki/Hamid_Razak) of the [People's Action Party](/wiki/People%27s_Action_Party). ## Education There are 2 primary schools (Corporation Primary School and [Westwood Primary School](/wiki/Westwood_Primary_School)). [Pioneer Primary School](/wiki/Pioneer_Primary_School) is no longer located in the Gek Poh Ville precinct as it was merged with [Juying Primary School](/wiki/Juying_Primary_School) since 2022 and the former campus was subsequently demolished to make way for the [Jurong Region Line](/wiki/Jurong_Region_Line). There were also 2 secondary schools before but [Pioneer Secondary School](/wiki/Pioneer_Secondary_School) was merged into [Boon Lay Secondary School](/wiki/Boon_Lay_Secondary_School). Therefore In Gek Poh Ville, there is only 1 secondary school ([Westwood Secondary School](/wiki/Westwood_Secondary_School)) and many childcare centres in the precinct. ## Town centre The precinct's town centre is located at zone 2 of the precinct, comprising HDB-managed flats and the Gek Poh Shopping Centre, providing the basic necessities for the people of Gek Poh Ville. Bus connection to the town centre is available through bus services 181,185 and 243. However, Gek Poh Shopping Centre will be closed for revamp and all shops will be closed on 31 August 2025. The new revamped Gek Poh Shopping Centre will be open by 3Q2028. Additionally, the ground floor of Block 276 which is a [multi-storey car park](/wiki/Multi-storey_car_park) houses a coffee shop, some provision shops, ATM, stationery shops, clinics as well as a Singapore Pools outlets that caters to the residents and students needs. ### Places of worship North of the town centre is the Victory Family Centre, which provides religious services. ### Community centre The precinct's community centre is located here, at the junction of Jurong West Street 75 and 74. ## Future developments At the North-East side of the precinct it will be developed into an industrial park called Bulim Industrial Estate in which there will be factories, warehouses as well as a [bus depot](/wiki/Bulim_Bus_Depot) for [Tower Transit Singapore](/wiki/Tower_Transit_Singapore). ## Notes - West Coast Town Council - Neighbourhood Complex : Block 762 Jurong West Street 75 on HDB Infoweb Archived 2013-01-30 at the [Wayback Machine](/wiki/Wayback_Machine) - Gek Poh Ville Website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:05:53.222218",
  "title": "Gek Poh Ville",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Gek_Poh_Ville"
}