{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:05:31.160145"
  },
  "content": "Entertainment promotion awards The **Global Entertainment Marketing Academy Awards** (**GEMA Awards**; formerly known as the **PromaxBDA Awards** and the **Promax Awards**) are for entertainment marketing, promotion, and design by a company or individual that is broadcast, published, or released in their respective markets. The Global Entertainment Marketing Academy Awards (branded as \"GEMA Awards\") sponsors awards competitions at the global level which include Music, Sports, Video Games, Film, TV and Streaming, as well regional awards for TV and Streaming across [North America](/wiki/North_America), [Latin America](/wiki/Latin_America), [Europe](/wiki/Europe), the [United Kingdom](/wiki/United_Kingdom), [Africa](/wiki/Africa), [Asia](/wiki/Asia), [India](/wiki/India), and [Australia](/wiki/Australia) and [New Zealand](/wiki/New_Zealand). There is also a competition at the local level in the [United States](/wiki/United_States) and [Canada](/wiki/Canada). The awards categories include [network TV](/wiki/Television_network), [TV stations](/wiki/Television_channel), cable networks, cable systems, network radio, [radio stations](/wiki/Radio_stations), syndication distributors, and [interactive media](/wiki/Interactive_media). At one point, they also included the [Brandon Tartikoff](/wiki/Brandon_Tartikoff) Award, although it has not been awarded in several years. In 2024, Promax rebranded as The Global Entertainment Marketing Academy of Arts & Sciences (G.E.M.A.) and announced an expansion beyond TV and Streaming into the Film, Music, Sports, and Gaming industries. Winners in the past have included [FX Networks](/wiki/FX_Networks), [Showtime](/wiki/Showtime_(TV_network)), [Red Bee Media](/wiki/Red_Bee_Media), [HBO](/wiki/HBO), [A&E Networks](/wiki/A%26E_Networks), 4Creative, S4C Ysgolion, 5Creative, Les Télécréateurs Paris, [Rogers Media](/wiki/Rogers_Media), and [Bell Media Agency](/wiki/Bell_Media). ## Promax and Broadcast Design Association Promax was established in 1956 as a non-profit association for promotion and marketing professionals working in broadcast media. In 1997, the Broadcast Design Association (BDA) who had partnered with Promax for years on their annual conference, officially joined with Promax. The PromaxBDA awards replaced earlier awards presented separately by Promax and the Broadcast Designers Association (BDA). Thousands of PromaxBDA awards have been presented to [companies](/wiki/Company_(law)) and [individuals](/wiki/Individual) whose work is judged by a panel of [promotion](/wiki/Promotion_(marketing)) and [marketing](/wiki/Marketing) professionals using three measures: overall creativity, production quality, and results in achieving marketing objectives. ## The Global Entertainment Marketing Academy of Arts & Sciences (GEMA) Founded in the United States in 1956 as the Broadcast Promotion Association (BPA), in 1985, the organization changed its name to Broadcast Promotion & Marketing Executives (BPME). In 1993, the organization again changed its name to PROMAX (a loose acronym for Promotion and Marketing Executives). A merger with the Broadcast Design Association (BDA) in 1997 created PromaxBDA. In 2019, the organization dropped BDA and reverted to Promax. In 2024, Promax rebranded to The Global Entertainment Marketing Academy of Arts & Sciences (GEMA). The association holds conferences, [award](/wiki/Award) competitions and online publications for their members, and present [networking](/wiki/Social_network) opportunities. Stacy La Cotera is the current President & CEO. The Board of Directors is composed of senior entertainment marketing executives and is currently chaired by Linnea Hemenez, SVP of International Marketing Starz and Alan Beard, CEO of Synonymous Technologies. Previous Promax chairs include, Steph Sebbag, CEO of Los Angeles–based creative agency BPG, Joe Earley, head of marketing for [Disney+](/wiki/Disney%2B), (formerly COO, [Fox Television Group](/wiki/21st_Century_Fox), Lisa Gregorian, President & CMO, [Warner Bros. Television Group](/wiki/Warner_Bros._Television), Adam Stotsky, Pres. and GM, [E!](/wiki/E!), and Mike Benson, Head of Marketing, [Amazon Prime Video](/wiki/Amazon_Prime_Video).\n",
  "language": "en",
  "processed_at": "2026-01-12T11:05:31.159674",
  "title": "GEMA Awards",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/GEMA_Awards"
}