{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:05:57.279801"
  },
  "content": "Academic qualification in the British Commonwealth The **General Certificate of Education** (**GCE**) is a subject-specific family of academic qualifications used in [awarding bodies](/wiki/Examination_board) in [England](/wiki/England), [Wales](/wiki/Wales), [Northern Ireland](/wiki/Northern_Ireland), [Crown dependencies](/wiki/Education_in_the_Crown_dependencies) and a few [Commonwealth countries](/wiki/Commonwealth_countries). For some time, the [Scottish education system](/wiki/Education_in_Scotland) has been different from those in the other countries of the United Kingdom. The GCE is currently composed of three main levels; they are, in increasing order of difficulty: - the [General Certificate of Secondary Education](/wiki/GCSE) (GCSE) - the [Advanced Subsidiary Level](/wiki/Advanced_Subsidiary_Level) (\"A1 Level\" or \"AS Level\"), higher than the O Level, serving as a level in its own right, and functioning as a precursor to the full Advanced Level; and - [Advanced Level](/wiki/Advanced_Level) (\"A Level\"). Variations of the GCE system in commonwealth countries tend to replace the GCSE with international alternatives, such as the [IGCSE](/wiki/International_General_Certificate_of_Secondary_Education) and even in some cases, the [Cambridge O-Level](/wiki/Cambridge_O-Level) series, a derivative of the now-abolished [GCE Ordinary Level](/wiki/GCE_Ordinary_Level_(United_Kingdom)) qualifications offered in the United Kingdom. The General Certificate of Education Advanced Level (GCE \"A Levels\") is an entry qualification for universities in the United Kingdom and many other locations worldwide. ## United Kingdom ### England and Wales This section **does not cite any sources**. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed. *(November 2020)* *(Learn how and when to remove this message)* The General Certificate of Education set out to provide a national standard for matriculation to university undergraduate courses. It had two levels, Ordinary and Advanced, which rapidly became known throughout the education system as \"O levels\" and \"A Levels.\" Ordinary levels were usually taken at the age of 16, and Advanced levels at the age of 18 after a further two-year course. Both the O level and A level courses were examined by subject, and matriculation (the minimum standard for university entrance) was set at five passes in different subjects, of which two had to be at A level. For matriculation purposes the highest grade pass of a subject taken at [CSE](/wiki/Certificate_of_Secondary_Education) level was considered a pass at O level. In the English education system both the O level and CSE examinations were replaced in 1988 with the [General Certificate of Secondary Education](/wiki/General_Certificate_of_Secondary_Education) (GCSE), which set out to provide a multi-level examination system catering for all abilities of secondary school pupils. #### Examination Boards (England) This section **does not cite any sources**. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed. *(November 2020)* *(Learn how and when to remove this message)* Though the GCE was considered a national standard, there was no national syllabus, and it was run by a number of different Examination Boards, each of which set their own syllabi and papers. These included the Northern Universities Joint Matriculation Board (\"Northern\"), the University of London (\"The London Board\") and the Oxford and Cambridge Board. Examination sessions were held bi-annually in May and November and successful candidates received a certificate listing the subjects they had passed in the session, together with the marks achieved in each. In the earliest years of the system subject marks were given as percentages at both Ordinary and Advanced Level. In later years ordinary level pass marks were graded 1–6, with 1 being the highest. The grading system was further simplified in 1975 when the six pass marks were reduced to three, graded A, B, C. In normalised terms at O level the lower bound for A was then 70% and the lower bound for C 45%. For matriculation purposes C was the lowest pass grade. D, E and F grades were also shown for the first time—indicating that a paper had been sat but the student had not achieved a pass mark. In the late 1970s, A level certificates showed grades from A to F. At A level E was considered a pass for matriculation, and corresponded to 30%. All these examinations were closed book, and Art was the only subject for which any assignment outside the examination hall contributed to the final mark. #### Today Though the O level was replaced in the English education system in the 1980s, some examination boards continue to offer Ordinary level examinations to English Language schools overseas. This enables these students to obtain matriculation instantly recognisable to British universities. Significant numbers of private schools in England have also reverted to preparing pupils for GCE examinations. Letter grades are used, with A, B, C, D, and E representing a pass and U (unclassified) representing a fail. After leading British universities had expressed concerns that the A grade alone would no longer be enough to distinguish the most exceptional candidates, the A* grade was introduced (GCSE, the replacement of GCE and CSE)[*clarification needed*] for students who achieve 80% and above in the overall A-Level qualification and achieve 90% and over in all A2 (this applies to GCSE and not GCE but may apply to CSE) modules.[*citation needed*] A new 9-1 grading system in GCSEs was phased in from 2017 (the replacement of A*-U, with U being retained). Grade 9 is situated above the former A*, which is a Grade 8. #### Former qualifications An additional GCE qualification, the Alternative Ordinary Level (AO Level), was formerly available in most subject areas. Sometimes incorrectly known as the Advanced Ordinary Level, the AO Level syllabus and examination both assumed a higher degree of maturity on the part of candidates, and employed teaching methods more commonly associated with A Level study. The AO Level was discontinued, with final admissions in 1987 and final qualifications awarded in 1988.[*dubious – discuss*] In the past, a [Scholarship / Special / \"S-Level\"](/wiki/Scholarship_level) / [Advanced Extension Award (AEA)](/wiki/Advanced_Extension_Award) existed.[*citation needed*] An Advanced Supplementary Level qualification was also formerly available[*citation needed*] (designated \"AS Level\" but not to be confused with the modern-day AS Level, which is lower than the A Level). ### Scotland This section **does not cite any sources**. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed. *(November 2020)* *(Learn how and when to remove this message)* GCE Ordinary and Advanced levels did not exist within the Scottish Education system, but have an equivalent, administered by the Scottish Qualification Authority (the SQA). GCSEs are the equivalent to a Scottish National level 5 (Nat5), A Levels are the equivalent to an SQA Highers. Both more advanced and less advanced examinations are offered by the SQA, National level 3, National level 4 (equivalent to a Btec) National level 5 (equivalent to GCSE), Higher (equivalent to A Levels) and Advanced higher. ### Northern Ireland This section **does not cite any sources**. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed. *(November 2020)* *(Learn how and when to remove this message)* The secondary education system in Northern Ireland continues to use the GCE Ordinary and Advanced level system. It also retains selection to grammar school by the AQE examination, a public examination which selects children as suitable for an academic (essentially a liberal arts) secondary syllabus from the age of eleven to eighteen. ## Worldwide use ### Brunei Up to now, most schools in Brunei are under GCE, the levels are of O-level, A-level, and AS-level[*clarification needed*] Examinations are conducted by the Examinations Department of Brunei Darussalam. ### Cameroon In [Cameroon](/wiki/Cameroon), the [GCE Ordinary Level](/wiki/GCE_Ordinary_Level) examination is a 3-year course program starting from Form 3 to Form 5 (Years 9 to 11). It is usually written in Form 5 (Year 11) in [secondary schools](/wiki/Secondary_schools), meanwhile the [GCE Advanced Level](/wiki/GCE_Advanced_Level) examinations are written in Upper 6 (Year 13) in [high school](/wiki/High_school). Most secondary schools in Cameroon which do the English form of education and write both the GCE A-Level and O-Level examinations were [boarding schools](/wiki/Boarding_schools), but since then many day schools were opened which offered a complete GCE course, and anyone wishing to have an English education is no longer obliged to attend a boarding school. The GCE saw changes in syllabus content at the ordinary and advanced levels in some science subjects in order to adapt to the world's advancing school program. During Easter break around March, students in these boarding schools stay for GCE courses for a week and a few days in school for extra classes in order to cover up their syllabus. At the end of the school year, all other students leave, while GCE candidates stay on to revise and prepare for the exams in late May. Once the candidates finish writing in early June, they all return to their various homes, waiting to hear their results. The same thing applies for GCE candidates in day schools. The results for the GCE O-Level and A-level exams in Cameroon are announced around 23 July. ### Hong Kong The two educational qualifications, [Hong Kong Certificate of Education Examination](/wiki/Hong_Kong_Certificate_of_Education_Examination) (HKCEE) and [Hong Kong Advanced Level Examination](/wiki/Hong_Kong_Advanced_Level_Examination) (HKALE), were the two school-leaving exams until they were replaced by the Hong Kong Diploma of Secondary Education (HKDSE). The HKDSE eventually replaced the two exams by only having one public exam in high school year 3 (year 12). [English Schools Foundation](/wiki/English_Schools_Foundation) (though some schools are also adopting the [IB Diploma](/wiki/IB_Diploma) program). ### Pakistan Some of Pakistan's top schools offers the GCE certification which are mostly private schools. The number of entries for GCE qualifications for O Levels and A Levels has been increasing in Pakistan. The entries for O Levels qualifications in Pakistan grew by 5% in 2015-16 from the previous year, and increased by 8% for A Levels. [O Levels](/wiki/O_Levels) and [A Levels](/wiki/A_Levels) are considered to be equivalent to the local board of intermediate and secondary education (BISE) education system in Pakistan. ### Singapore Students take the [O-Levels](/wiki/Singapore-Cambridge_GCE_Ordinary_Level) after completing Secondary 4 at age 16 for the Special and Express streams, or Secondary 5 at age 17 for the Normal Academic Stream. After that, they have the option to go on to a junior college for two years in preparation for the [A-Levels](/wiki/Singapore-Cambridge_GCE_Advanced_Level) or study a vocational trade and earn a diploma at a [polytechnic](/wiki/Institute_of_technology) or technical school. Increasingly, students who perform well in school are given the option to bypass the O-levels and take the A-Levels, in a scheme dubbed the [integrated programme](/wiki/Education_in_Singapore#Integrated_Programme) (also known as the *through-train* programme). ### Sri Lanka In [Sri Lanka](/wiki/Sri_Lanka) [GCE Ordinary Level](/wiki/GCE_Ordinary_Level_in_Sri_Lanka) and [GCE Advanced Level](/wiki/GCE_Advanced_Level_in_Sri_Lanka) examinations are conducted by the [Department of Examinations](/wiki/Department_of_Examinations) of the Government of Sri Lanka. The GCE(O/L) is normally conducted in the month of December and GCE (A/L)s are conducted in the month of August. They are conducted on an island-wide examination centres on same time. Examination entrance is restricted by a minimal number of formal school going years and laboratory field work. The majority of candidates enter the exams via their respective schools, while candidates who have finished school education can also apply as a private candidate. The O/L examination is regarded as the qualification examination for starting on GCE(A/L). Specialization streaming is depended on the grades obtained for subjects in the O/L. The country's reputed schools admit students to their A/L, depending on the O/L grades. The Sri Lankan University Grants commission determines the cut-off points for the selection of students to the Sri Lankan universities according to the grade points obtained in the A/L examinations based on the standard [normal distribution](/wiki/Normal_distribution). Private Schools/International Schools in Sri Lanka offer British Ordinary Level and Advanced Level Qualifications that are recognized both locally and internationally. These institutions provide students with the option to pursue either [Cambridge International (CIE)](/wiki/Cambridge_Assessment_International_Education) qualifications or [Pearson Edexcel](/wiki/Edexcel) qualifications for O/L and A/L examinations. ## Former use ### Malaysia GCE examinations in Malaysia were used to be conducted by the [University of Cambridge Local Examinations Syndicate](/wiki/University_of_Cambridge_Local_Examinations_Syndicate), when two agencies of the Malaysian Ministry of Education took over the role with UCLES retaining an advisory role on standards.[*citation needed*] In most schools today in Malaysia ## Comparison to U.S. high school diploma The US equivalent of the GCE for admissions would be, roughly, the [high school diploma](/wiki/High_school_diploma). However, in England and Wales, the high school diploma is considered to be at the level of the [General Certificate of Secondary Education](/wiki/General_Certificate_of_Secondary_Education) (GCSE), which is awarded at Year 11. For [college](/wiki/Sixth_form) and [university](/wiki/University) admissions, the high school diploma may be accepted in lieu of the GCSE if an average grade of C is obtained in subjects with a GCSE counterpart. As the more academically rigorous [A Levels](/wiki/GCE_Advanced_Level) awarded at Year 13 are expected for university admission, Students who wish to study in the United Kingdom may additionally participate in the [Advanced Placement](/wiki/Advanced_Placement) (AP) or [International Baccalaureate](/wiki/International_Baccalaureate) (IB) programs, which are considered to be at the level of the A Level qualifications and earn points on the [UCAS Tariff](/wiki/UCAS_Tariff), or may opt to take A Level examinations in British [international schools](/wiki/International_school) or as private candidates. Standardized tests, such as the [College Board](/wiki/College_Board)'s [SAT](/wiki/SAT) and [SAT Subject Tests](/wiki/SAT_Subject_Test) or the [ACT](/wiki/ACT_(test)), may also be considered. The [Universities and Colleges Admissions Service](/wiki/Universities_and_Colleges_Admissions_Service) (UCAS) recommends that in addition to a high school diploma, grades of 3 or above in at least two, or ideally three, Advanced Placement exams may be considered as meeting general entry requirements for admission. The [IB Diploma](/wiki/IB_Diploma) may also be accepted. For College Board tests, a minimum score of 600 or higher in all sections of the SAT or a minimum score of 26 or higher in all sections of the ACT along with a minimum score of 600 in relevant SAT Subject Tests may be considered as meeting general entry requirements for admission.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:05:57.279286",
  "title": "General Certificate of Education",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/General_Certificate_of_Education"
}