{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:05:55.192069"
  },
  "content": "23°41′32″N 120°37′19″E﻿ / ﻿23.692114°N 120.622072°E﻿ / 23.692114; 120.622072 **General Baokeng** ([Chinese](/wiki/Chinese_language): 保坑大將軍), formerly known as '**General Shen Zi Keng** ([Chinese](/wiki/Chinese_language): 檨仔坑大將軍)', was a decorative piece in a [Banqiao District](/wiki/Banqiao_District), [New Taipei City](/wiki/New_Taipei_City) restaurant. Later, Mr Liu, a removal company owner, didn't want to discard it as waste and moved it to his hometown's vacant lot in Shezai Keng, Hu Shan Li, [Douliu City](/wiki/Douliu), Yunlin County. Subsequently, according to the local deity's indications, the statue was said to be possessed by the spirit of a [Singaporean](/wiki/Singaporeans) [soldier](/wiki/Singapore_Armed_Forces) who had died in a military training accident as part of [Project Starlight](/wiki/Singapore%E2%80%93Taiwan_relations#Military_relations) between Taiwan and Singapore. The local residents worshipped the statue as a god of the local faith and as a [Wan Ying Gong](/wiki/Gory%C5%8D), a type of deity worshipped by the [Hushan Dam](/wiki/Hushan_Dam) construction workers. ## History At the beginning of the construction of the Hushan Reservoir, the parents of Mr Liu, the person in charge, often felt unwell. They went to the local faith centre, Yudang Mountain Emperor Temple, to respectfully request a [divine revelation](/wiki/Oracle) from [Xuantian Shangdi](/wiki/Xuanwu_(god)). They learned that the statue was possessed by a Singaporean pilot who had fallen to his death in a nearby valley during a military exercise as part of Project Starlight. The believers were instructed to worship this statue on the first and fifteenth days of the lunar month. The commanding officer of the Starlight Troops also believed that the statue resembled the fallen pilot. Subsequently, Mr Liu's parents' health improved without medical intervention. The story astounded the residents, and they named the statue \"General Shen Zi Keng\" in honour and began to worship him. In 2013, while the construction of the Hushan Reservoir was still underway, the villagers planned to relocate this statue of the soldier. However, the Yudang Mountain Emperor Temple indicated that the head of the Central Region Water Resources Bureau of the Ministry of Economic Affairs should initiate the \"Security Land Head Five Fortunes Prosperity\" ritual. Therefore, it was decided to leave the statue in its original place and invite officials from the Central Region Water Resources Bureau to jointly hold a [consecration](/wiki/Consecration) ceremony. In February 2014, local residents, the office of the Hu Shan Village head, the Community Development Association, the Management Committee of the Yudang Mountain Emperor Temple, and the Central Region Water Resources Bureau jointly held a consecration ceremony for this statue. The commanding officer of Project Starlight performed a divination ritual to consult Xuantian Shangdi, officially naming it \"General Bao Keng\", hoping it would guard the head of the reservoir, ensuring safety, health, and prosperity for the residents. In April of the same year, local figures erected an inscription, explaining this story to visiting members of the public. To maintain good relations with local community residents, the Water Resources Department of the Ministry of Economic Affairs also relocated and placed statues of local deities, including [Tudigong](/wiki/Tudigong), [Wan Shan Gong](/wiki/Gory%C5%8D), and Shitougong. Zhong Chao-gong, who was then the director of the Central Region Water Resources Bureau of the Water Resources Department, stated that after the statue was consecrated, the later stages of the Hu Shan Reservoir project went smoothly, and construction workers often visited to pay their respects and give thanks.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:05:55.191598",
  "title": "General Baokeng",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/General_Baokeng"
}