{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:06:01.464195"
  },
  "content": "Geography of a Southeast Asian country [Singapore](/wiki/Singapore) is a [city-state](/wiki/City-state) and [island country](/wiki/Island_country) in [maritime Southeast Asia](/wiki/Maritime_Southeast_Asia), located at the end of the [Malayan Peninsula](/wiki/Malayan_Peninsula) between [Malaysia](/wiki/Malaysia) and [Indonesia](/wiki/Indonesia) as well as the [Straits of Malacca](/wiki/Straits_of_Malacca) and the [South China Sea](/wiki/South_China_Sea). It is heavily compact and urbanised. As of 2025, Singapore has a total land area of approximately 736.3 square kilometres (284.3 sq mi). Singapore is separated from Indonesia by the [Singapore Strait](/wiki/Singapore_Strait) and from Malaysia by the [Straits of Johor](/wiki/Straits_of_Johor). Geographically, Singapore comprises its [mainland](/wiki/Singapore_Island) and other islands. The mainland of Singapore measures 50 kilometres (31 mi) from east to west and 27 kilometres (17 mi) from north to south with 193 kilometres (120 mi) of coastline. These figures are based on 2.515 metres (8 ft 3.0 in) High Water Mark [cadastral](/wiki/Cadastre) survey boundaries. It has an [exclusive economic zone](/wiki/Exclusive_economic_zone) of 1,067 km2 (412 mi2). ## Topography Singapore's main territory looks like a diamond-shaped island, although its territory includes surrounding smaller islands. The farthest outlying island is [Pedra Branca](/wiki/Pedra_Branca,_Singapore). Of Singapore's dozens of smaller islands, [Jurong Island](/wiki/Jurong_Island), [Pulau Tekong](/wiki/Pulau_Tekong), [Pulau Ubin](/wiki/Pulau_Ubin) and [Sentosa](/wiki/Sentosa) are the larger ones. Most of Singapore is no more than 15 meters above sea level. The highest point of Singapore is [Bukit Timah Hill](/wiki/Bukit_Timah_Hill), with a height from the ground of 164 m (538 ft) and made up of [igneous rock](/wiki/Igneous_rock), [granite](/wiki/Granite). Hills and valleys of [sedimentary rock](/wiki/Sedimentary_rock) dominate the northwest, while the eastern region consists of [sandy](/wiki/Sand) and flatter land. Singapore has no natural lakes, but reservoirs and [water catchment areas](/wiki/Water_catchment_area) have been constructed to store fresh water for [Singapore's water supply](/wiki/Water_resources_of_Singapore). ### Land reclamation Singapore has engaged in extensive [land reclamation](/wiki/Land_reclamation_in_Singapore) since the [British colonisation in 1819](/wiki/Founding_years_of_modern_Singapore), using earth sourced from its own hills, the seabed and neighbouring countries. As a result, the country's land area has expanded from approximately 582 square kilometres (225 sq mi) in the 1960s to around 740 square kilometres (290 sq mi) in the 2020s. Reclamation continues today with the use of newer methods such as [polders](/wiki/Polder) and [barrages](/wiki/Barrage_(dam)) to counter rising sea levels. ## Climate Singapore is one-and-a-half degrees north of the equator, lying entirely between the [1st](/wiki/1st_parallel_north) and [2nd parallels](/wiki/2nd_parallel_north). Singapore's climate is classified as [tropical rainforest climate](/wiki/Tropical_rainforest_climate) ([Köppen climate classification](/wiki/K%C3%B6ppen_climate_classification) *Af*), with no true distinct seasons. Owing to its geographical location and maritime exposure, its climate is characterised by uniform temperature and pressure, high humidity and abundant rainfall. Therefore, it is almost always warm and wet. The average annual rainfall is around 2,340 mm (92.1 in). The highest 24-hour rainfall figures ever recorded in history were 512.4 mm (20.2 in) (2 December 1978) at [Paya Lebar](/wiki/Paya_Lebar), 467 mm (18.4 in) (1969) and 366 mm (14.4 in) (19 December 2006). The wettest month on record is January 1893 at 818.6mm at the climate station since rainfall records began in 1869, although the wettest ever month of all weather stations across Singapore was in December 2006 at [Buangkok](/wiki/Buangkok) at 996.3mm. The temperature hovers around a [diurnal](/wiki/Diurnal_temperature_variation) range of a minimum of 25 °C (77.0 °F) and a maximum of 33 °C (91.4 °F). May is the hottest month of the year in Singapore, followed by June. This is due to light winds and strong sunshine during those months. The highest recorded temperature is 37.0 °C (98.6 °F), which was recorded twice on 17 April 1983 and 13 May 2023. The lowest recorded temperature was 19.4 °C (66.9 °F) on 14 February 1989 at [Paya Lebar](/wiki/Paya_Lebar), although there is an unofficial record low of 18.4 °C (65.1 °F) on an unspecified date. At the climate station in [Changi](/wiki/Changi) however, extremes have ranged from 36.0 °C (96.8 °F) on 30 March 1998 to 19.4 °C (66.9 °F) on January 30 and 31 1934. Temperature often goes above 33.2 °C (91.8 °F) and can reach 35 °C (95 °F) at times. [Relative humidity](/wiki/Relative_humidity) has a diurnal range in the high 90s in the early morning to around 60% in the mid-afternoon, but does go below 50% at times. During prolonged heavy rain, relative humidity often reaches 100%. Generally, there is much more rainfall on the western side of the island than on the eastern portion of Singapore, owing to a [rain shadow](/wiki/Rain_shadow) effect. Thus, the eastern side of Singapore is much drier and slightly hotter than western Singapore. This can cause slight weather disparities from one side of the island to the other. This is significant to note because even a small hill such as [Bukit Timah Hill](/wiki/Bukit_Timah_Hill) can cause this phenomenon. Despite Singapore's small size, there may be sunshine on one side while there is rain on the other. Further contrasts that prevent true all-year uniformity are the [monsoon](/wiki/Monsoon) seasons which happen twice each year. The first one is the Northeast Monsoon which occurs from mid-November to early March. The second is the Southwest Monsoon season which occurs from June to September. Periods between monsoon seasons receive less rain and wind. During the Northeast Monsoon, northeast winds [prevail](/wiki/Prevailing_wind), sometimes reach 20 km/h (12 mph). There are cloudy conditions in December and January with frequent afternoon showers. Spells of widespread moderate to heavy rain occur lasting from 1 to 3 days at a stretch. It is relatively dry in February till early March although rainfall still exceeds 120mm. It is also generally windy with wind speeds sometimes reaching 30 to 50 km/h (19 to 31 mph) in the months of January and February. During the Southwest Monsoon season, southeast winds prevail. Isolated to scattered showers occur in the late morning and early afternoon. Early morning \"[Sumatras](/wiki/Sumatras)\" – [squall lines](/wiki/Squall_line) that originate over nearby Sumatra – are common. Climate data for Singapore (1991–2020 normals, extremes 1929–1941 and 1948–present)MonthJanFebMarAprMayJunJulAugSepOctNovDecYearRecord high °C (°F)35.2 (95.4)35.2 (95.4)36.0 (96.8)35.8 (96.4)35.4 (95.7)35.0 (95.0)34.0 (93.2)34.2 (93.6)34.4 (93.9)34.6 (94.3)35.4 (95.7)35.6 (96.1)36.0 (96.8)Mean daily maximum °C (°F)30.6 (87.1)31.5 (88.7)32.2 (90.0)32.4 (90.3)32.3 (90.1)31.9 (89.4)31.4 (88.5)31.4 (88.5)31.6 (88.9)31.8 (89.2)31.2 (88.2)30.5 (86.9)31.6 (88.9)Daily mean °C (°F)26.8 (80.2)27.3 (81.1)27.8 (82.0)28.2 (82.8)28.6 (83.5)28.5 (83.3)28.2 (82.8)28.1 (82.6)28.0 (82.4)27.9 (82.2)27.2 (81.0)26.8 (80.2)27.8 (82.0)Mean daily minimum °C (°F)24.3 (75.7)24.6 (76.3)24.9 (76.8)25.3 (77.5)25.7 (78.3)25.7 (78.3)25.4 (77.7)25.3 (77.5)25.2 (77.4)25.0 (77.0)24.6 (76.3)24.3 (75.7)25.0 (77.0)Record low °C (°F)19.4 (66.9)19.7 (67.5)20.2 (68.4)20.7 (69.3)21.2 (70.2)20.8 (69.4)19.7 (67.5)20.2 (68.4)20.7 (69.3)20.6 (69.1)21.1 (70.0)20.6 (69.1)19.4 (66.9)Average rainfall mm (inches)221.6 (8.72)105.1 (4.14)151.7 (5.97)164.3 (6.47)164.3 (6.47)135.3 (5.33)146.6 (5.77)146.9 (5.78)124.9 (4.92)168.3 (6.63)252.3 (9.93)331.9 (13.07)2,113.2 (83.20)Average rainy days (≥ 0.2 mm)13912151513141413151919171Average [relative humidity](/wiki/Relative_humidity) (%)83.581.281.782.682.380.980.980.780.781.584.985.582.2Average [dew point](/wiki/Dew_point) °C (°F)23.2 (73.8)23.2 (73.8)23.7 (74.7)24.1 (75.4)24.5 (76.1)24.2 (75.6)23.9 (75.0)23.7 (74.7)23.7 (74.7)23.8 (74.8)23.8 (74.8)23.6 (74.5)23.8 (74.8)Mean monthly [sunshine hours](/wiki/Sunshine_duration)180.4198.6196.6182.4184.8175.4188.5184.6161.4155.0133.2133.12,074Source 1: National Environment AgencySource 2: [NOAA](/wiki/NOAA) (sun only, 1991–2020), Weather.DirectoryThis graph was using the legacy Graph extension, which is no longer supported. It needs to be converted to the new Chart extension. See or edit raw graph data. ### Climate change initiatives Singapore recognises that [climate change](/wiki/Climate_change) in the decades ahead will have major implications for the island-nation. It has taken a three-prong approach to the issue - researching how the nation will be affected in specific details, implementing mitigation measures and adapting to the coming changes. For the research, a Centre for Climate Research Singapore (CCRS) has been established. The government estimates that $100 billion will need to be spent over a 100-year time frame to address the issue. In the 2020 budget, it has set aside an initial $5 billion towards a Coastline and Flood Protection Fund. For the population, it will provide incentives for owners to convert to electric vehicles (EVs), like rebates on the Additional Registration fees and expanding the EV charging network. By 2040, it expects to phase out petrol and diesel (internal combustion engine) vehicles. The country's transport policy continues to focus on a \"car-lite\" future with most commuters using public transportation (MRT trains, buses, taxis) instead. Singapore is the first country in Southeast Asia to levy a [carbon tax](/wiki/Carbon_tax), at $5 per ton, applicable for its largest carbon-emitting corporations that produce more than 25,000 tons of carbon dioxide per year. To reduce the country's dependence on fossil fuels, it is building one of the world's largest floating solar farms at Tengeh Reservoir in Tuas, with a capacity of 60MW. ## Time zone Although Singapore does not observe daylight saving time (DST), it follows the [UTC+8](/wiki/UTC%2B8) time zone, one hour ahead of the typical zone for its geographical location. DaylightFebruaryJulyNovember07:14 – 19:1907:04 – 19:1606:47 - 18:50 ## Geology [Igneous rocks](/wiki/Igneous_rocks) are found in [Bukit Timah](/wiki/Bukit_Timah) and [Woodlands](/wiki/Woodlands,_Singapore) and [Pulau Ubin](/wiki/Pulau_Ubin) island. Granite makes up the bulk of the igneous rock. [Gabbro](/wiki/Gabbro) is also found in the area and is found in an area called [Little Guilin](/wiki/Little_Guilin) named for its resemblance to Guilin in Southern China. This area is in Bukit Gombak. [Sedimentary rocks](/wiki/Sedimentary_rock) are found on the western part of Singapore and is mainly made of [sandstone](/wiki/Sandstone) and [mudstones](/wiki/Mudstone). It also includes the [southwestern](/wiki/Ordinal_directions) area. [Metamorphic rocks](/wiki/Metamorphic_rock) are found in the [northeastern](/wiki/Ordinal_direction) part of Singapore and also on [Pulau Tekong](/wiki/Pulau_Tekong) off the east coast of Singapore. The rocks are mainly made up of [quartzite](/wiki/Quartzite) and also make up the Sajahat Formation. ### Seismic activity Singapore is relatively safe from seismic activity in the region, as the nearest major [active faults](/wiki/Active_fault) (Sumatran fault and Sunda megathrust fault) are hundreds of kilometres away in Indonesia. However, the population and buildings are prone to being only very slightly affected by any activity as tremors, which is not uncommon, but generally does not do any harm and is limited to small amounts of swaying or vibration of objects. In late 2004, several parts of Asia and Africa were struck by the [2004 Indian Ocean earthquake](/wiki/2004_Indian_Ocean_earthquake) and the resulting tsunami. Singapore was fortunate as it was protected by the [Sumatra](/wiki/Sumatra) landmass, which bore the brunt of the tsunami; the effect on Singapore was limited to tremors felt in some of the common high-rise buildings there. ## Political and human When Singapore was first colonised by the British, the [City of Singapore](/wiki/City_of_Singapore_(historical_entity)) was situated on the southern coast, around the mouth of the [Singapore River](/wiki/Singapore_River). This area remains the [Central Area](/wiki/Central_Area,_Singapore) of Singapore. The rest of the island was [farmland](/wiki/Farmland_(farming)) and primary [rainforest](/wiki/Rainforest). Since the 1960s, the government has constructed [new towns](/wiki/New_towns_of_Singapore) in other areas, so that today the island is nearly entirely built-up and [urbanised](/wiki/Urbanised), with only a few exceptions.[*citation needed*] The country has several subdivisions, mostly used for administrative or statistical purposes. Politically, Singapore is divided into five administrative districts, these are then further subdivided into [town councils](/wiki/Town_council#Singapore) which usually consists of one or more [political constituencies](/wiki/Constituencies_of_Singapore). Planning and census boundaries, called [planning areas](/wiki/Planning_Areas_of_Singapore), have been used by the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) to define certain districts and neighbourhoods. There are two connections to the state of [Johor](/wiki/Johor), Malaysia. In the north there is a [causeway](/wiki/Johor%E2%80%93Singapore_Causeway) for both rail and road traffic, which connects to the city of [Johor Bahru](/wiki/Johor_Bahru). In the west there is a road bridge ([Tuas Second Link](/wiki/Malaysia%E2%80%93Singapore_Second_Link)), which connects to Johor, for road traffic only.[*citation needed*] There are more than 300 parks and 4 nature reserves in Singapore. There are also many trees planted, and almost fifty per cent of the country is covered by greenery. Because of this, Singapore is also commonly known as the 'Garden City'. Singapore remains highly vulnerable to the [impact of climate change](/wiki/Effects_of_climate_change); in particular, the rising sea levels may pose a major threat to the very survival of the country in the long-term perspective. - [Urban planning in Singapore](/wiki/Urban_planning_in_Singapore) - [Regions of Singapore](/wiki/Regions_of_Singapore) - [Urban planning areas in Singapore](/wiki/Urban_planning_areas_in_Singapore) - [Urban renewal in Singapore](/wiki/Urban_renewal_in_Singapore) - [Future developments in Singapore](/wiki/Future_developments_in_Singapore) - [Land reclamation in Singapore](/wiki/Land_reclamation_in_Singapore) - [Constituencies of Singapore](/wiki/Constituencies_of_Singapore) Library resources about **Geography of Singapore** - Resources in your library - Resources in other libraries - Meteorological Services Singapore - Singapore Weather Forecast - Climatology of Singapore – National Environment Agency - CNN.com – Weather – Singapore - Maps: - http://www.worldexecutive.com/cityguides/singapore/maps.html - http://www.urbanrail.net/as/sing/singapore.htm - http://go.hrw.com/atlas/norm_htm/singapor.htm\n",
  "language": "en",
  "processed_at": "2026-01-12T11:06:01.463667",
  "title": "Geography of Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Geography_of_Singapore"
}