{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:06:03.245046"
  },
  "content": "Irish-Singaporean architect (1795 – 1844) **George Drumgoole Coleman** (1795 – 27 March 1844), also known as **George Drumgold Coleman**, was an Irish [civil](/wiki/Civil_engineering) architect who played an instrumental role in the design and construction of much of the civil infrastructure in early Singapore, after it was founded by Sir [Stamford Raffles](/wiki/Stamford_Raffles) in 1819. Only a few of his buildings have survived in Singapore, most notably [Armenian Church of Saint Gregory the Illuminator](/wiki/Armenian_Church,_Singapore), Maxwell's House (later expanded into the [Old Parliament House](/wiki/Old_Parliament_House,_Singapore)), and [Caldwell House](/wiki/Caldwell_House,_Singapore). ## Early life George Drumgoole Coleman was born in [Drogheda](/wiki/Drogheda), [County Louth](/wiki/County_Louth), Ireland, he was the son of James Coleman, a merchant, part of whose business was dealing in building materials. Coleman was trained as a civil architect. ## Career In 1815, at the age of 19 years, he left Ireland for [Calcutta](/wiki/Calcutta), India, where he set up as an architect designing private houses for the merchants of [Fort William](/wiki/Fort_William,_India). In 1819, he was invited, through his patron John Palmer, to build two churches in [Batavia](/wiki/Batavia,_Dutch_East_Indies) in the [Dutch East Indies](/wiki/Dutch_East_Indies). The churches were never built, but Coleman spent two years working in Java. Coleman then obtained an introduction to Sir [Stamford Raffles](/wiki/Stamford_Raffles) from Palmer in Calcutta, and travelled to Singapore, arriving in June 1822. Coleman was responsible, as advisor to Raffles, for the draft layout of Singapore in 1822. He planned the centre of the town, created roads, and constructed many fine buildings. Coleman oversaw the works at the Christian Cemetery which was built on the slope of the hill in late 1822. Raffles was away in Sumatra at the time, but Coleman also set about designing for him the [Residency House](/wiki/Residency_House) of timber with a thatched roof. On his return, Raffles approved the house, construction of which was begun in November of the same year on [Singapore Hill](/wiki/Singapore_Hill) and completed in January 1823. At [John Crawfurd](/wiki/John_Crawfurd)'s own expense, Coleman would later extend and redesign the house as the residence of the [Residents](/wiki/Resident_of_Singapore) and [Governors of Singapore](/wiki/Governors_of_Singapore). Raffles also commissioned Coleman to design a garrison church. However, the church was not built. In June 1823, Coleman left for Java where he spent his next two and a half years, and returned to Singapore in 1825 due to conflicts between the Dutch and native Javanese. On 26 January 1826 he designed a large [Palladian](/wiki/Palladian_architecture) house for David Skene Napier, the first magistrate in Singapore, and a palatial building for the merchant John Argyle Maxwell, which before completion was leased to the government for use as a court house and government offices. Much altered and enlarged, it eventually formed part of the [Parliament House of the Republic of Singapore](/wiki/Old_Parliament_House,_Singapore). It was again in the Palladian manner, adapted to the tropical climate by incorporating a veranda and overhanging eaves to provide shade. In June 1827, Coleman was employed as a Revenue Surveyor, surveyed land titles which was issued mostly to cover shop-house lots in the town. In 1828, Coleman designed and built his own [house](/wiki/Coleman_House,_Singapore) which was completed in May 1829. In 1829, Coleman worked as a Topographical Surveyor which he surveyed in minute detail the islands that would form the new harbour of the port which included all the shoals, slopes and heights of the hills along the coast for the possible fortification of the harbour. On 19 October 1833, Coleman was appointed the [Superintendent](/wiki/Superintendent_(construction)) of [Public Works and Convicts](/wiki/Public_Works_and_Convicts). He was also the [surveyor](/wiki/Surveyor_(surveying)) and overseer of convict labour. Coleman headed the constructions of the North Bridge Road and South Bridge Road from 1833 to 1835. On 1 October 1835. Coleman helped cofound the establishment of the [Singapore Free Press & Mercantile Advertiser](/wiki/Singapore_Free_Press_%26_Mercantile_Advertiser) newspaper with [William Napier](/wiki/William_Napier_(lawyer)), [Edward Boustead](/wiki/Edward_Boustead), and Walter Scott Lorrain. Although Coleman designed numerous private houses in Singapore, only two certain to be designed by Coleman have survived in Singapore, the Parliament House (originally Maxwell's house, but has undergone considerable changes since), and [Caldwell House](/wiki/Caldwell_House,_Singapore), currently part of [CHIJMES](/wiki/CHIJMES) on [Victoria Street](/wiki/Victoria_Street,_Singapore). Another residence building, the [Istana Kampong Glam](/wiki/Istana_Kampong_Glam), is believed to be by Coleman although there is no definite evidence. An outstanding example of his work that survives to this day is the [Armenian Church of Saint Gregory the Illuminator](/wiki/Armenian_Church_of_Saint_Gregory_the_Illuminator) on Hill Street, built in 1835. He also built the first Anglican church in Singapore, [St Andrew's](/wiki/St_Andrew%27s_Cathedral,_Singapore), which was begun in 1835, but this structure was demolished in the 1850s having become unsafe due to lightning strikes. He was also hired to finish and extend the [Raffles Institution](/wiki/Raffles_Institution), originally designed by Lieutenant Phillip. The building however was demolished in 1972. Another prominent building of early Singapore designed by Coleman was the Telok Ayer market on the waterfront built in 1835. It was demolished due to land reclamation work in 1879 and the market was then moved to the present [Lau Pa Sat](/wiki/Lau_Pa_Sat), which retains the octagonal shape of the original market by Coleman. Before he left Singapore, Coleman completed the design of the [godown](/wiki/Godown) of [Baba](/wiki/Baba_Nyonya) Yeo Kim Swee which would be built in 1842 and completed by 1843 at the Hallpike Street. ## Personal life On 25 July 1841, Coleman left for England after 15 years of continuous work and 25 years in the East. On a return trip to in Ireland, Coleman married Maria Frances Vernon, of [Clontarf Castle](/wiki/Clontarf_Castle), [Dublin](/wiki/Dublin) on 17 September 1842. Coleman however found himself unable to settle down in Europe, and returned to Singapore via Calcutta with his bride on 25 November 1843 at short notice. Coleman later had a son, George Vernon Coleman, who was born 27 December 1843 by his new bride. ## Death Coleman died in his house on 25 March 1844 due to a fever at the age of 49. He was buried in an Old Christian Cemetery at the foot of [Government Hill](/wiki/Government_Hill,_Singapore), currently known as the [Fort Canning Hill](/wiki/Fort_Canning_Hill). After his death, Coleman's widow married attorney [William Napier](/wiki/William_Napier_(lawyer)) within months of her first husband's death. Napier adopted Coleman's infant son George, who would die on board of [HMS Maeander](/wiki/HMS_Maeander_(1840)) at sea in 1848 at age 4. His daughter Meda Elizabeth Coleman died in Singapore in October 1907. George Coleman grave along with others were since exhumed from 1954 to 1965 and their preserved gravestones were built into the walls of the former cemetery. The memorial for his gravesite still stands at Fort Canning Park. In December 1965, Coleman's residence, the [Coleman House](/wiki/Coleman_House,_Singapore) at 3 Coleman Street, was demolished to make way for the Peninsula Hotel. ## Legacy George Drumgoole Coleman's name lives on in the following entities in Singapore: - [Coleman Bridge](/wiki/Coleman_Bridge,_Singapore) - Coleman Place - Coleman Street - [Coleman House](/wiki/Coleman_House,_Singapore), Coleman's residence, demolished in 1965 ## Sources - T.H.H. Hancock (1986), *Coleman's Singapore*, The Malaysian Branch of the Royal Asiatic Society in association with Pelanduk Publications. - Lee Geok Boi (2002), *The Religious Monuments of Singapore*, Landmark Books, [ISBN](/wiki/ISBN_(identifier)) 981-3065-62-1. - Victor R Savage, Brenda S A Yeoh (2003), *Toponymics – A Study of Singapore Street Names*, Eastern Universities Press, [ISBN](/wiki/ISBN_(identifier)) 981-210-205-1. - Nadia Wright (2003), *Respected Citizens: The History of Armenians in Singapore and Malaysia*, Amassia Publishing. [ISBN](/wiki/ISBN_(identifier)) 0-9751082-0-4.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:06:03.244472",
  "title": "George Drumgoole Coleman",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/George_Drumgoole_Coleman"
}