{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:06:13.337337"
  },
  "content": "Romantic comedy web television series ***Getaway*** is a Singaporean gay web series known for being the country's first [Boys Love](/wiki/Boys_Love) web series. The series was launched on [YouTube](/wiki/YouTube) on 23 May 2022. Created and produced by [Dear Straight People](/wiki/Dear_Straight_People), *Getaway* features a gay director alongside an openly queer cast from Singapore and Thailand. ## Synopsis After his coming out goes horribly wrong, Singaporean Sam jets off to Bangkok to search for his exiled gay uncle, where he stumbles upon Top, a charismatic party boy looking for love in all the wrong places. ## Cast - [Sean Foo](/wiki/Sean_Foo) as Sam - Paween Naliang as Top - [Steven David Lim](/wiki/Steven_David_Lim) as Sam's dad - Nuttapon Cholvibool as Dr. Big - Hirzi Zulkiflie as Hilmi - Patsarun Songput as Jom - Phillips Loh as Dave - [Otto Fong](/wiki/Otto_Fong) as Alex - Zymone as Herself ## Production ### Development *Getaway* was created by [Sean Foo](/wiki/Sean_Foo), who also wrote, produced and starred in the series. ### Filming The entire production process took six months, but filming only lasted two days. Funded by a group of corporate sponsors with The Siam Hotel serving as the main sponsor, the other sponsors included 2eros, Ette Tea, FabulousMe, [Four Seasons Hotels and Resorts](/wiki/Four_Seasons_Hotels_and_Resorts) Bangkok, Gayhealth.sg, Prolific Songs, Supawear, and The Writers’ Room. ## Reception ### Viewership \"Getaway\" achieved widespread popularity, with its first episode amassing over 4 million views on YouTube to date. ### Accolades The series was nominated for Content of the Year at the 2023 edition of Singapore's national broadcaster [Mediacorp](/wiki/Mediacorp) content creator awards, The Pinwheels. ### Impact Following Getaway's popular reception, Taiwan-based LGBT streaming service [GagaOOLala](/wiki/GagaOOLala) purchased the rights to stream the series on their platform. On 28 September 2023, Getaway premiered on GagaOOLala.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:06:13.336810",
  "title": "Getaway (web series)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Getaway_(web_series)"
}