{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:06:09.297728"
  },
  "content": "Car-sharing company in Singapore **GetGo** is a [car sharing](/wiki/Carsharing) service based in [Singapore](/wiki/Singapore). Launched in 2021, it is currently the largest carsharing company in Singapore in terms of fleet and location size.[*better source needed*] As of February 2024, it has over 3,000 vehicles across 1,700 locations in Singapore. GetGo has been criticised for its alleged [predatory practices](/wiki/Unfair_business_practices) of high excess fees and overcharging users in the event of an accident or maintenance issues with the vehicle, including minor ones, as well as when the user was not responsible. This has led to growing calls to regulate the car sharing industry in general and increase [consumer protections](/wiki/Consumer_protection). ## History GetGo was incorporated on 18 August 2020 and officially launched in February 2021. GetGo began with an initial fleet of 400 vehicles from Lion City Rentals, a car-rental company formerly owned by [Uber](/wiki/Uber). It attracted 14,000 users in its pre-launch registration, and over 20,000 users within its first two months of operation. On 23 February 2023, it announced a fundraising round of S$20 million (US$14.9 million) from Treis, a family-backed investment group, to expand its fleet of electric vehicles. As of November 2023, GetGo has a user base of over 300,000 in Singapore and was accepted into [Enterprise Singapore's](/wiki/Enterprise_Singapore) \"Scale-Up\" programme to explore overseas expansion. In February 2024, GetGo partnered with [SBS Transit](/wiki/SBS_Transit) to place vehicles near MRT and bus interchanges to improve last-mile connectivity. GetGo operates in a competitive car-sharing landscape alongside other platforms such as Tribecar and [BlueSG](/wiki/BlueSG). ## Services GetGo offers a \"point A to A\" car-sharing platform that prioritizes a greater ease of use. It is available to licensed Singapore residents over the age of 19 with at least a year of driving experience, or to licensed residents over the age of 25 without driving experience. The service is integrated with Singapore's SingPass MyInfo system for registration and verification.[*better source needed*] The GetGo platform is currently mobile exclusive. Bookings, unlocking/locking of vehicles, and support are done through GetGo's Android and iOS apps. Vehicle locations are not centralized, but rather primarily located throughout Singapore's residential communities, such as in public housing carparks. With a point A to A model, vehicles must be returned to where they were originally picked up in.[*better source needed*] Unlike traditional car rental or carsharing pricing models, GetGo does not charge any security deposits or membership fees. Their pricing is based on booking duration, vehicle selection, and timing of booking. Costs for refueling/recharging are covered in each booking.[*better source needed*] ## Fleet GetGo offers a combination of petrol, diesel, and electric vehicles within its fleet. It is currently the largest carsharing fleet in Singapore, with approximately 3,000 vehicles across 1,600 locations. The company has a goal of 10,000 electrical vehicles within its fleet by 2030.[*better source needed*] ## Controversies GetGo has been criticised for alleged predatory practices of high excess fees and overcharging users in the event of an accident or maintenance issues with the vehicle, including minor ones, as well as when the user was not responsible. In February 2023, a [fender bender](/wiki/Fender_bender) between a GetGo KG Mobility (then Ssangyong) vehicle and a Mercedes vehicle resulted in a GetGo user being charged [S$](/wiki/Singapore_dollar)4,636, even despite the Mercedes driver agreeing to settle the matter privately with the user for a cost of $288, and that a workshop had previously quoted him only S$150 for the repair. In March 2023, a GetGo user said they were charged S$7,320 after getting into a minor accident in January that year, in a car that they stated was malfunctioning to begin with, including its vehicle's brakes and [anti-lock braking system](/wiki/Anti-lock_braking_system) (ABS). A driver of more than 30 years, they also stated that there were already damages to the vehicle while parked even before they have begun using it. In response, GetGo disputed the user and claimed that the vehicle was not faulty. The driver also stated that GetGo's notices of overdue payments include \"taking all necessary actions to collect any unpaid balance, including engaging services of [debt collectors](/wiki/Debt_collectors).\" In August 2023, a GetGo user revealed that they were charged S$5,589 after a minor accident with a motorcycle in June that previous year, which included third-party damage costing S$3,000. However, after the GetGo user contacted the motorcyclist for their repair bill, they responded that their repairs had only costed S$130 and that GetGo had not even contacted them after months. In October 2023, a GetGo user was charged S$914.42 for a single flat tyre. In January 2024, a GetGo user revealed that they were charged S$1,158 for minor scratches on a [BYD e6](/wiki/BYD_e6). Along with GetGo, there has been growing calls to regulate the car sharing industry in general and increase [consumer protections](/wiki/Consumer_protection).\n",
  "language": "en",
  "processed_at": "2026-01-12T11:06:09.297286",
  "title": "GetGo (carsharing company)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/GetGo_(carsharing_company)"
}