{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:06:25.248344"
  },
  "content": "River in Singapore **Geylang River** ([Malay](/wiki/Malay_language): *Sungai Geylang*; [Simplified Chinese](/wiki/Simplified_Chinese): 芽茏河) is a canalised [river](/wiki/River) flowing from [Geylang](/wiki/Geylang) to [Kallang](/wiki/Kallang), in the [Central Region](/wiki/Central_Region,_Singapore) of [Singapore](/wiki/Singapore). With the formation of the [Marina Reservoir](/wiki/Marina_Reservoir) after the completion of the [Marina Barrage](/wiki/Marina_Barrage) in 2008, the river now forms part of the reservoir. Geylang River begins at [Ubi](/wiki/Ubi,_Singapore) as **Geylang Canal**, continues southwards under Eunos Road 5 and [Sims Avenue](/wiki/Sims_Avenue), and turns westwards after [Geylang Road](/wiki/Geylang_Road) and Lorong 40 Geylang, but flows southwards again near Guillemard Road, before turning westwards again after the junction of [Old Airport Road](/wiki/Old_Airport_Road,_Singapore) and Dunman Road, through Mountbatten Road and Stadium Way. The river finally empties into the [Kallang Basin](/wiki/Kallang_Basin) near [Tanjong Rhu](/wiki/Tanjong_Rhu) in the southern part of Kallang near the [Tanjong Rhu Suspension Bridge](/wiki/Tanjong_Rhu_Bridge). The Geylang Park Connector of the [Park Connector Network](/wiki/Park_Connector_Network) (PCN) runs almost parallel to the Geylang River, providing a stretch of recreational space along the river between Guillemard Road and Tanjong Rhu. The Paya Lebar Quarter straddles both sides of the Geylang River. Geylang River has gone through a two years long revamp initiated by the Public Utilities Board (PUB) programme, which revitalised the waterway while preserving the rich heritage of the areas around Geylang River, and was opened by Guest-of-Honour Associate Professor Fatimah Lateef, Member of Parliament for Marine Parade Group Representation Constituency. As part of the revamp, Geylang River was also deepened and widened to increase its capacity and enhance flood protection. As part of an Active, Beautiful and Clean (ABC) Waters project by Paya Lebar Quarter, a natural [rain garden](/wiki/Rain_garden) which treats [surface runoff](/wiki/Surface_runoff) using plants and soil was also set up to improve the quality of the river's water. 1°18′N 103°52′E﻿ / ﻿1.300°N 103.867°E﻿ / 1.300; 103.867 ## Otters Geylang River is known to be frequented by smooth-coated otters, as it has become a thriving habitat due to efforts like the PUB's Active, Beautiful, Clean (ABC) Waters Programme. These otters are often seen swimming and playing, and even have \"otter crossing\" signs along the riverbanks as a reminder of their presence. This [Singapore](/wiki/Singapore) location article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:06:25.247882",
  "title": "Geylang River",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Geylang_River"
}