{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:06:15.397980"
  },
  "content": "Planning Area and HDB town in Central Region, SingaporeThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Geylang\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(March 2019)* *(Learn how and when to remove this message)*Planning Area and HDB town in Central Region, Singapore **Geylang** ([IPA](/wiki/International_Phonetic_Alphabet): /ˈɡeɪlɑːŋ, -ʌŋ/) is a [planning area](/wiki/Planning_Areas_of_Singapore) and [township](/wiki/New_towns_of_Singapore) located on the eastern fringe of the [Central Region](/wiki/Central_Region,_Singapore) of [Singapore](/wiki/Singapore), bordering [Hougang](/wiki/Hougang) and [Toa Payoh](/wiki/Toa_Payoh) in the north, [Marine Parade](/wiki/Marine_Parade) in the south, [Bedok](/wiki/Bedok) in the east, and [Kallang](/wiki/Kallang) in the west. Geylang is previously known as a [red-light district](/wiki/Red-light_district), particularly the areas along [Geylang Road](/wiki/Geylang_Road). Today only 3-4 units remain for brothels and street walkers are hard to come by. Geylang is also where one of Singapore's oldest [Malay](/wiki/Malay_(ethnic_group)) settlements, Geylang Serai, is located. During [Ramadan](/wiki/Ramadan), the neighbourhood is famous for its popular and iconic Ramadan lights and bazaars. ## Etymology The word *Geylang* is found early in Singapore's history and also in early topographical maps showing marsh and coconut plantations beside and adjacent to the mouth of the [Kallang River](/wiki/Kallang_River), home to the [Orang Laut](/wiki/Orang_Laut) (sea gypsies) called *orang biduanda kallang* who inhabited the area at the time of Raffles' arrival in 1819, and after whom the river is named. *Geylang* may be a corruption of *Kallang.* The place name appeared in an 1830 survey map of Singapore as *Kilang,* but by 1838 was spelled as *Kelang,* which when pronounced in correct Malay is nearly indistinguishable to the ear from *Geylang.* However, *kilang* also means press, mill, or factory in Malay and could be a reference to the presses and mills in the coconut plantations that used to be in the area. Another possible etymological link in the stock vocabulary of the Malay is *geylanggan* meaning to \"twist\" or \"crush\" a reference to the process of extracting the coconut meat and milk used by the locals to thicken curries in Malay-Chinese ([Peranakan](/wiki/Peranakan)) cuisine. Another possible explanation is that Geylang is a corruption of the Malay word 'gelang' which is a type of edible creeper ([Portulaca oleracea](/wiki/Portulaca_oleracea)). This is a plausible explanation for the name because Malays typically name places based on the abundance of certain plant species (e.g. [Melaka](/wiki/Melaka) after the eponyming [tree](/wiki/Phyllanthus_emblica)) or geological formations (e.g. Bukit Gombak based on the comb-like hill summit).[*citation needed*] ## Geography ### Location Grouped under the [Central Region](/wiki/Central_Region,_Singapore), **Geylang Planning Area** is bordered by [Hougang](/wiki/Hougang) and [Toa Payoh](/wiki/Toa_Payoh) in the north, [Kallang](/wiki/Kallang) in the west, [Marine Parade](/wiki/Marine_Parade) in the south, and [Bedok](/wiki/Bedok) in the east. Beginning in the north and moving in a clockwise direction, the boundaries of Geylang are made up of [MacPherson Road](/wiki/MacPherson_Road), Airport Road, Eunos Link, Jalan Eunos, Still Road, Koon Seng Road, Dunman Road, the [Geylang River](/wiki/Geylang_River), Mountbatten Road, Sims Way, and the [Pan Island Expressway](/wiki/Pan_Island_Expressway) (PIE). **Geylang New Town** as defined by the [Housing and Development Board](/wiki/Housing_and_Development_Board) (HDB) sits within the Geylang Planning Area. ### Subdivisions Geylang Planning Area is made up of five \"subzones\", as officially defined by the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) (URA). SubzoneLocationNotable placesAccessibility[Aljunied](/wiki/Aljunied)Southwest Geylang[Aljunied MRT station](/wiki/Aljunied_MRT_station), [Mountbatten MRT station](/wiki/Mountbatten_MRT_station), [Dakota MRT station](/wiki/Dakota_MRT_station), Sims Place Bus Terminal, Mountbatten Community Club, Mountbatten Neighbourhood Police Post, [James Cook University Singapore](/wiki/James_Cook_University_Singapore), [Kong Hwa School](/wiki/Kong_Hwa_School), Geylang Methodist School (Primary), [Geylang Methodist School (Secondary)](/wiki/Geylang_Methodist_Secondary_School), [Broadrick Secondary School](/wiki/Broadrick_Secondary_School), [Housing and Development Board](/wiki/Housing_and_Development_Board) (HDB) Geylang Branch, HDB Sims Drive Branch, Geylang Polyclinic, Geylang East Swimming Complex, [Singapore Association for the Deaf](/wiki/Singapore_Association_for_the_Deaf), Mun San Fook Tuck Chee, the former [Kallang Airport](/wiki/Kallang_Airport), the future Kallang Fire Station, the future Geylang Neighbourhood Police CentreAljunied MRT station, Mountbatten MRT station, Dakota MRT station and busesKallang WayIndustrial estates along Kallang Way, Kallang Pudding Road and Tannery RoadThe [Siemens](/wiki/Siemens) Centre, [Infineon](/wiki/Infineon_Technologies) buildingPotong Pasir MRT Station and buses[MacPherson](/wiki/MacPherson,_Singapore)Northern Geylang[MacPherson MRT station](/wiki/MacPherson_MRT_station), [Mattar MRT station](/wiki/Mattar_MRT_station), Canossa Catholic Primary School, Aljunied Park, MacPherson Community Club, MacPherson Neighbourhood Police PostMacPherson MRT station, Mattar MRT station and buses[Geylang East](/wiki/Geylang_East)Southeast Geylang[Paya Lebar MRT station](/wiki/Paya_Lebar_MRT_station), [Eunos MRT station](/wiki/Eunos_MRT_station), Paya Lebar Square, [SingPost](/wiki/Singapore_Post) Centre, KINEX, Haig Girls' School, Geylang Serai Community Club, Kembangan-Chai Chee Community Club, Kampong Ubi Community Centre, [Eunos Bus Interchange](/wiki/Eunos_Bus_Interchange), Eunos Neighbourhood Police Post, Kampong Ubi Neighbourhood Police Post, Eunos Fire Post, [Sri Sivan Temple](/wiki/Sri_Sivan_Temple), [Foo Hai Ch'an Monastery](/wiki/Foo_Hai_Ch%27an_Monastery), Geylang United Temple, Paya Lebar Quarter, Wisma Geylang SeraiPaya Lebar MRT station, Eunos MRT station and buses[Kampong Ubi](/wiki/Kampong_Ubi)Northeast Geylang[Ubi MRT station](/wiki/Ubi_MRT_station), Traffic Police Headquarters, [Singapore Civil Defence Force](/wiki/Singapore_Civil_Defence_Force) (SCDF) Headquarters, Paya Lebar Fire Station, Geylang Neighbourhood Police Centre, Maha Bodhi School, [Manjusri Secondary School](/wiki/Manjusri_Secondary_School), Teochew Funeral Parlour, Sze Cheng Keng TempleUbi MRT station and buses ## History This section **does not cite any sources**. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed. *(January 2019)* *(Learn how and when to remove this message)* The development of Geylang can best be observed along the main trunk road, [Geylang Road](/wiki/Geylang_Road), that leads westwards towards the city. Micro-businesses founded by Malay, Indian and Chinese entrepreneurs seized start-up opportunities as mechanics in bicycle or motor repair workshops, suppliers of wood for making boats, houses, furniture and as merchants in iron, of floor and roofing tiles, in rubber and later plastics for all kinds of marine, industrial, factory and home use, including the mosaic of temples, mosques and churches in Geylang that have its roots serving local worshippers in search of spirituality and the divine. One of the distinctive hallmarks of Geylang architecture is the preservation of its shophouses used by the clan (kinship) associations, set up as a (first) point of contact for newcomers in the migrant wave between 1840 and 1940 for integrating the newcomers into the ways and customs of locals. At present, the Geylang neighbourhood accurately reflects demographic changes in Singapore (2011) where out of every four Singaporeans, one is a foreigner. As a strategic and military outpost for the British, it was important that the sea lanes off the [Straits of Malacca](/wiki/Straits_of_Malacca) were kept free of pirates, and open for shipping. As the British expanded in influence and power, Singapore served East and West interests as a natural deep-harbour destination that played host to the French, Portuguese, Dutch and other European navies and their men. Other seaports in Asia, from Shanghai to Calcutta, also played a role in the traffic of women and girls for prostitution.[*citation needed*] ## Geylang Serai Geylang Serai was used to be the terminus of the vintage tramway while the farmers staying there already shifted to cultivate other cash crops, including rubber and coconuts. Meanwhile, with the intensified urbanisation, the rural community in Geylang Serai, where the price of land was low, was turned into a suburb. During the Japanese Occupation, Geylang Serai was severely damaged, and the shortages of food that arose afterwards led to the replacement of the plantations of coconut and rubber by those of tapioca, which gave Geylang Serai the name, Kampong Ubi (tapioca in Malay). With the end of Japanese occupation, Geylang Serai saw a rise in population and more areas were occupied. The inflow of more Malays and outflow of Chinese changed the demographic of Geylang Serai, which turned into predominantly a Malay community ever since. In 1963, the Housing and Development Board (HDB) initiated The Geylang Serai Housing Redevelopment Scheme which was carried out in three phases, investing a sum of 3.8 million SGD for the renewal of the region. Under the scheme, Many HDB flats and new facilities were constructed, including Taj cinema, Concourse, light industrial properties, shopping malls and Geylang Serai market. The old kampungs in the region vanished and Geylang Serai turned into a modern residential district. In tandem with the urbanization of the region, the importance of preservation of Malay cultural heritage was recognized by the government. The namesake of Geylang Serai was retained and it is not just confined to Geylang Serai alone, both Tampines West, Fengshan, Compassvale, Kembangan, Keat Hong, Marsiling, Woodlands, Jalan Kayu, Cheng San, Marina South, Pasir Ris East, Tampines Changkat and Toa Payoh East are also Malay districts with the racial harmony policy. Under the Masterplan of 2008 by the Urban Redevelopment Authority (URA), the development of the Paya Lebar Central which includes Paya Lebar Square, Paya Lebar Quarter and SingPost Centre, within which Geylang Serai is situated, into a centre characterised with a distinct cultural identity was confirmed. Until now, Geylang Serai market is still one of the busiest and largest wet markets in Singapore, offering many Indian-Muslim and Malay dishes as well as a large variety of spices and ingredient for making of traditional Malay cuisine, such as cinnamon and nutmeg. ## Infrastructure Geylang's combination of [shophouse](/wiki/Shophouse) scenery and hectic day and night life, including [foreign workers](/wiki/Foreign_worker) quarters and [karaoke](/wiki/Karaoke) lounges, provides an alternative view of elements the rest of modern Singapore generally does not offer. Shophouses along [Geylang Road](/wiki/Geylang_Road) form part of the Geylang Conservation Area and are protected from redevelopment, and many restaurants have sprung up along this major road. Geylang is also known for its [durian](/wiki/Durian) shops; as well as many shops offering traditional Malay [folk medicine](/wiki/Ethnobotany) which despite playing as important a role as [traditional Chinese medicine](/wiki/Traditional_Chinese_medicine) does not receive as much attention and endorsement from the Singapore government as the latter. ### Shopping malls The Geylang planning area consists of 9 shopping malls, with a concentration of shopping malls located near [Paya Lebar MRT station](/wiki/Paya_Lebar_MRT_station): - Pavilion Square - Paya Lebar Square - Paya Lebar Quarter (PLQ) - SingPost Centre - Grandlink Square - KINEX - City Plaza - Tanjong Katong Complex - Joo Chiat Complex ### Places of worship #### Masjid Haji Mohd Salleh **Masjid Haji Mohd Salleh** ([Jawi](/wiki/Jawi_script): مسجد الحاج محمد صالح) is a mosque located along 245 Geylang Road. It was founded in 1896 by an Indian Muslim trader, Haji Mohammed Salleh, on land owned by another Indian merchant, Vena Meena Bok. The mosque has been rebuilt twice; once in 1959 and later in 1998 when it was deemed too small. The current structure is the 1998 reconstruction which added four storeys to the mosque and was opened in 1999. The mosque has been criticized for being situated adjacent to the red light district. However, the mosque administration deliberately ignores the social stigma of its surroundings and instead continues active operations with its daily prayers, Friday prayers and Islamic classes including kindergartens. #### Masjid Khadijah **Masjid Khadijah** ([Jawi](/wiki/Jawi_script): مسجد خديجة; *Khadijah Mosque*) is a Sufi mosque that contains the headquarters of the Religious Rehabilitation Group (RRG), a society dedicated to combating religious extremism. It is named for Khadijah binte Mohammed, a Muslim merchant who donated $50,000 as waqf to build the mosque. Excavations during the renovations revealed that there were graves along the left side of the wall as well, which have been exhumed. ## Transport ### Roads The Geylang area is composed of north and south sections that are divided by Geylang Road which stretches for about three kilometres. Throughout the length of Geylang Road, there are lanes (*lorong* in [Malay](/wiki/Malay_language)) that extend perpendicularly from the main road. The lanes in the north are given odd numbered names (i.e. Lorong 1, Lorong 3, Lorong 5 and so on), and the lanes in the south are given even numbered names (i.e. Lorong 2, Lorong 4, Lorong 6 and so on). The following [expressways](/wiki/Expressways_of_Singapore) pass through Geylang: - [Pan Island Expressway](/wiki/Pan_Island_Expressway) (PIE) connects Geylang with [Changi Airport](/wiki/Singapore_Changi_Airport), [Tampines](/wiki/Tampines), Bedok, Kallang, [Toa Payoh](/wiki/Toa_Payoh), [Clementi](/wiki/Clementi,_Singapore), [Jurong East](/wiki/Jurong_East), [Jurong West](/wiki/Jurong_West) and [Tuas](/wiki/Tuas); - [Kallang-Paya Lebar Expressway](/wiki/Kallang-Paya_Lebar_Expressway) (KPE) connects Geylang with Kallang, Hougang, [Sengkang](/wiki/Sengkang) and [Punggol](/wiki/Punggol). Major roads within Geylang Planning Area include Aljunied Road, Kallang Way, Paya Lebar Road, Geylang East Central, Ubi Avenue 2 and Circuit Road. ### Trains There are currently eight [Mass Rapid Transit](/wiki/Mass_Rapid_Transit_(Singapore)) (MRT) stations in the Geylang Planning Area across three lines: The [East West line](/wiki/East_West_MRT_line), the [Circle line](/wiki/Circle_Line_(Singapore)) and the [Downtown line](/wiki/Downtown_Line). The eight stations are: - **EW7** [Eunos](/wiki/Eunos_MRT_station) - **EW8** **CC9** [Paya Lebar](/wiki/Paya_Lebar_MRT_station) - **EW9** [Aljunied](/wiki/Aljunied_MRT_station) - **CC7** [Mountbatten](/wiki/Mountbatten_MRT_station) - **CC8** [Dakota](/wiki/Dakota_MRT_station) - **CC10** **DT26** [MacPherson](/wiki/MacPherson_MRT_station) - **DT25** [Mattar](/wiki/Mattar_MRT_station) - **DT27** [Ubi](/wiki/Ubi_MRT_station) ## Cultural depiction - *Living in Geylang*, a 20-episode television drama aired on [MediaCorp Channel 8](/wiki/MediaCorp_TV_Channel_8) in 1998 - *[Pleasure Factory](/wiki/Pleasure_Factory)*, a 2007 Singaporean-Thai docudrama film set in Geylang - *[Geylang](/wiki/Geylang_(film))*, a 2022 crime thriller film starring [Mark Lee](/wiki/Mark_Lee_(Singaporean_actor)) and [Sheila Sim](/wiki/Sheila_Sim_(Singaporean_actress)) - Peter K G Dunlop (2000), *Street Names of Singapore*, Who's Who Publishing, Singapore, [ISBN](/wiki/ISBN_(identifier)) 981-4062-11-1 - Victor R Savage, Brenda S A Yeoh (2003), *Toponymics – A Study of Singapore Street Names*, Eastern Universities Press, [ISBN](/wiki/ISBN_(identifier)) 981-210-205-1\n",
  "language": "en",
  "processed_at": "2026-01-12T11:06:15.397487",
  "title": "Geylang",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Geylang"
}