{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:06:19.291778"
  },
  "content": "Subzone of Kallang Planning Area in Central Region, Singapore **Geylang Bahru** is a subzone within the planning area of [Kallang](/wiki/Kallang), [Singapore](/wiki/Singapore), as defined by the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) (URA). It is bounded by the [Pan Island Expressway](/wiki/Pan_Island_Expressway) (PIE) in the east; the Pelton Canal in the south; the [Kallang River](/wiki/Kallang_River) in the west; and [Serangoon Road](/wiki/Serangoon_Road) in the north. Previously, \"Kolam Ayer\" encompassed an area that included present-day Geylang Bahru subzone and the adjacent Kallang Way subzone, the latter of which is officially organised under [Geylang Planning Area](/wiki/Geylang). Several places within Geylang Bahru still retain this name: Kolam Ayer Community Club and Kolam Ayer Neighbourhood Police Post, as well as the road Jalan Kolam Ayer. Made up of both residential and industrial developments, other notable places in Geylang Bahru include the Kallang Basin Swimming Complex, Kallang Distripark, the main office of Jalan Besar Town Council, the office of the [Singapore Examinations and Assessment Board](/wiki/Singapore_Examinations_and_Assessment_Board) (SEAB) and [Ministry of Manpower](/wiki/Ministry_of_Manpower_(Singapore)) (MOM) Services Centre. [Geylang Bahru MRT station](/wiki/Geylang_Bahru_MRT_station) along the [Downtown Line](/wiki/Downtown_Line) serves this subzone. Geylang Bahru is also the name of a two-way road in the area. This road connects Bendemeer Road in the north with Upper Boon Keng Road in the south, with major junction located at [Kallang Bahru](/wiki/Kallang_Bahru). This road is unique as it is one of the few roads in Singapore to have a [name](/wiki/Road_names_in_Singapore) without any generic element. The name of the subzone was derived from this road. ## Etymology The name. Kolam Ayer, was derived from the [Malay](/wiki/Malay_language) phrase \"*kolam air*\", which translates to \"pond water\". The subzone's current name, Geylang Bahru, came from a road in the area; \"[Geylang](/wiki/Geylang)\" is a place in Singapore, now considered a separate planning area from Kallang, while \"Bahru\" is the old Malay spelling for \"*baru*\", meaning \"new\". Geylang Bahru first appeared as a proposed road in a street directory in 1969. The road marked as Geylang Bahru in the 1969 map (and numerous revised editions released in the following years) roughly corresponds to the modern-day Upper Boon Keng Road. By 1975, Geylang Bahru, the current road was completed.[*citation needed*] ## History Kolam Ayer roughly covers the modern-day subzones of Geylang Bahru and Kallang Way, part of the [Kallang](/wiki/Kallang) and [Geylang](/wiki/Geylang) planning areas respectively. Before the development of Kallang, Kolam Ayer (as it was known at the time) had numerous [Malay](/wiki/Malay_Singaporeans) [kampongs](/wiki/Kampong_(village)). The precinct was mainly served by a main road called Jalan Kolam Ayer before the 1960s. This road was eventually merged to form part of the present-day [Pan Island Expressway](/wiki/Pan_Island_Expressway) (PIE). During the dredging of the [Kallang River](/wiki/Kallang_River) in the late 1960s and early 1970s, the Singapore government filled and leveled up the surrounding riverside with red mud that was carried by trucks from a nearby hill called *Ang Chiang San* (modern-day [Toa Payoh](/wiki/Toa_Payoh)). These areas formed what are today [Bendemeer](/wiki/Bendemeer,_Kallang), [Kallang Bahru](/wiki/Kallang_Bahru) and the old Geylang Bahru estate. Since then, the precinct was connected with the Kolam Ayer [Community Club](/wiki/Community_Club) and the [People's Action Party](/wiki/People%27s_Action_Party) Kolam Ayer Branch. After the 1980s, the [Jalan Besar](/wiki/Jalan_Besar_Group_Representation_Constituency) Town Council relocated its office in [Kallang Bahru](/wiki/Kallang_Bahru). It was later renamed [Moulmein-Kallang](/wiki/Moulmein-Kallang_Group_Representation_Constituency) between 2011-2015 after the redrawing of [GRC](/wiki/Group_Representation_Constituency) boundaries. The old name was then restored following the [2015 general elections](/wiki/2015_Singaporean_general_election). In April 2008, the Kolam Ayer ABC [Waterfront](/wiki/Waterfront_(area)) was officially opened to the public as the first project under the [Active, Beautiful, Clean Waters programme](/wiki/Public_Utilities_Board#Active,_Beautiful,_Clean_(ABC)_Waters_programme) handled by [Public Utilities Board](/wiki/Public_Utilities_Board). Today, residents of Geylang Bahru are managed by the [People's Association](/wiki/People%27s_Association_(Singapore)) under the Kolam Ayer Geylang Bahru Residents Committee.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:06:19.291328",
  "title": "Geylang Bahru",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Geylang_Bahru"
}