{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:06:31.273206"
  },
  "content": "Former secret society in Singapore and MalayaCriminal organization The **Ghee Hin Kongsi** ([simplified Chinese](/wiki/Simplified_Chinese_characters): 义兴公司; [traditional Chinese](/wiki/Traditional_Chinese_characters): 義興公司; [Pe̍h-ōe-jī](/wiki/Pe%CC%8Dh-%C5%8De-j%C4%AB): *Gī Hin Kong-si*; [pinyin](/wiki/Pinyin): *Yì Xīng Gōngsī*; [Jyutping](/wiki/Jyutping): *ji6 hing1 gung1 si1*) was a [secret society](/wiki/Secret_society) in [Singapore](/wiki/Singapore) and [Malaya](/wiki/British_Malaya), formed in 1820. Ghee Hin literally means \"the rise of righteousness\" in [Chinese](/wiki/Chinese_language) and was part of the [Hongmen](/wiki/Hongmen) overseas network. The Ghee Hin often fought against the [Hakka](/wiki/Hakka_people)-dominated [Hai San secret society](/wiki/Hai_San_Secret_Society). Ghee Hin was initially dominated by [Cantonese people](/wiki/Cantonese_people), although [Hokkien people](/wiki/Hoklo_people) formed the majority by 1860. [Teochew](/wiki/Teochew_people), [Hainanese](/wiki/Hainanese_people), and [Hakka](/wiki/Hakka_people) people formed smaller minorities. One of the major leaders of Ghee Hin was Chin Ah Yam, a Hakka peasant from rural [Dabu County](/wiki/Dabu_County), Guangdong. The secret society, of Hongmen origin, was set up to provide mutual aid and support for Chinese migrants, with the common aim of overthrowing the [Qing dynasty](/wiki/Qing_dynasty) and restoring the [Ming](/wiki/Ming_dynasty). Their main lodge in Singapore was located on [Lavender Street](/wiki/Lavender_Street), and contained the [ancestral tablets](/wiki/Ancestral_tablets) of important ex-members, before being donated to the [Tan Tock Seng Hospital](/wiki/Tan_Tock_Seng_Hospital) when it was torn down in 1892, following the \"Suppression of Secret Societies Ordinance\". The Ghee Hin were notorious for committing mass killings of such targets as the [Catholic](/wiki/Catholic) [Hakka](/wiki/Hakka) ethnic group in 1850 (with approximately 500 casualties), and post office workers in 1876, due to their opposition to a new, more expensive monopoly on postage and remittances. The [colonial government](/wiki/Straits_Settlements) began to move towards surveillance, control, and finally suppression of Ghee Hin from the 1890s onwards. The Teochew people who belonged to the Ghee Hin secret society were massacred by the hundreds, if not thousands. - Lim, Irene. (1999) *Secret societies in Singapore*, National Heritage Board, Singapore History Museum, Singapore [ISBN](/wiki/ISBN_(identifier)) 981-3018-79-8 - Ghee Hin — Encyclopædia Britannica This Singapore-related article is a stub. You can help Wikipedia by expanding it. - v - t - e This Malaysian organisation article is a stub. You can help Wikipedia by expanding it. - v - t - e This [law enforcement](/wiki/Outline_of_law_enforcement)–related article is a stub. You can help Wikipedia by expanding it. - v - t - e This Asian history–related article is a stub. You can help Wikipedia by expanding it.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:06:31.272669",
  "title": "Ghee Hin Kongsi",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Ghee_Hin_Kongsi"
}