{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:06:33.336564"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Ghim Moh\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(January 2016)* *(Learn how and when to remove this message)*Subzone of Queenstown Planning Area in Singapore **Ghim Moh** ([IPA](/wiki/International_Phonetic_Alphabet): /ˌɡɪm ˈmoʊ, ˌkɪm-/[a]) is a neighbourhood located in [Queenstown](/wiki/Queenstown,_Singapore), Singapore. ## Etymology According to a mural in [Buona Vista MRT station](/wiki/Buona_Vista_MRT_station), the name is derived from the [Southern Min](/wiki/Southern_Min) word 金毛 meaning \"golden hair\" ([Hokkien](/wiki/Hokkien): kim-mô͘, [Teochew](/wiki/Teochew_language): gim1 mo5), likely in reference to the British soldiers stationed in the area.[*citation needed*] ## Amentities There were a few [schools](/wiki/List_of_schools_in_Singapore) located within the estate, namely - Ghim Moh Primary School, which merged with New Town Primary in 2009. - Ghim Moh Secondary School, which merged with Jin Tai Secondary School in 2007. - Raffles Junior College (1984 to 2004). The campus later housed [Dunman High School](/wiki/Dunman_High_School) from 2007 to 2008, before housing Raffles Girls Primary School up until December 2015 as it underwent upgrading at its original premises. From 2017 to 2019, it housed [Eunoia Junior College](/wiki/Eunoia_Junior_College). The site now houses the Ministry of Education (MOE)'s Mount Sinai Headquarters. The Ulu Pandan Community Centre is also located within the estate. Ghim Moh estate also houses a wet market and a food centre, called Ghim Moh Road Market and Food Centre. There are also several coffee shops, salons, dental clinics and medical clinics located within the estate. It is near to Ministry of Education Headquarters, Fusionopolis, Rochester Park and Biopolis, where many of the life-science businesses are located. ## Transport Its nearest [MRT](/wiki/Mass_Rapid_Transit_(Singapore)) station is [Buona Vista station](/wiki/Buona_Vista_MRT_station). There are also several bus routes that serve Ghim Moh and terminate at the Ghim Moh Bus Terminal. These include routes 92, 92M, 100, 111, making it convenient to travel around the country, particularly to Orchard, HarbourFront, and the Central Business District. ## Politics Ghim Moh belongs to the Ulu Pandan division of [Holland–Bukit Timah Group Representation Constituency](/wiki/Holland%E2%80%93Bukit_Timah_Group_Representation_Constituency), whose [Member of Parliament](/wiki/List_of_Singapore_MPs) is [Deputy Speaker of Parliament](/wiki/Speaker_of_the_Parliament_of_Singapore#List_of_deputy_speakers) [Christopher de Souza](/wiki/Christopher_de_Souza). Between 2001 and 2006, the Member of Parliament was [Minister for Community Development, Youth and Sports](/wiki/Minister_for_Community_Development,_Youth_and_Sports) [Vivian Balakrishnan](/wiki/Vivian_Balakrishnan), who became the Member of Parliament for the Cashew division in 2006. Ulu Pandan existed in its own constituency before 1997 and its Member of Parliament was Minister (Prime Minister's Office) [Lim Boon Heng](/wiki/Lim_Boon_Heng) from 1991 to 2001. ## Gallery ## Explanatory notes - Food outlets in Ghim Moh This [Singapore](/wiki/Singapore) location article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:06:33.336123",
  "title": "Ghim Moh",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Ghim_Moh"
}