{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:06:37.439641"
  },
  "content": "Malay folk ghostsThis article is a part of the series on[Indonesian mythology](/wiki/Mythology_of_Indonesia) and [folklore](/wiki/Folklore_of_Indonesia)Cultural mythologies - [Adat](/wiki/Adat) - [Balinese mythology](/wiki/Balinese_mythology) - [Batak mythology](/wiki/Batak_mythology) - [Malay folklore](/wiki/Malay_folklore) - Ghosts in Malay culture - [Molucca Folklore](/wiki/Folklore_of_the_Moluccas) Traditional folk religions - [Iban](/wiki/Dayak_people#Iban_religion) - [Kaharingan](/wiki/Kaharingan) - [Kejawèn](/wiki/Kejaw%C3%A8n) - [Marapu](/wiki/Marapu) - [Parmalim](/wiki/Parmalim) - [Pemena](/wiki/Pemena) - [Sunda Wiwitan](/wiki/Sunda_Wiwitan) - Sapta Darma Deities - [Acintya](/wiki/Acintya) - [Agni](/wiki/Agni) - [Antaboga](/wiki/Antaboga) - [Barong](/wiki/Barong_(mythology)) - [Batara Guru](/wiki/Batara_Guru) - [Batara Kala](/wiki/Batara_Kala) - [Batara Sambu](/wiki/Batara_Sambu) - [Brahma](/wiki/Brahma) - [Chen Fu Zhen Ren](/wiki/Chen_Fu_Zhen_Ren) - [Dewi Danu](/wiki/Dewi_Danu) - [Dewi Lanjar](/wiki/Dewi_Lanjar) - [Dewi Ratih](/wiki/Dewi_Ratih) - [Dewi Sri](/wiki/Dewi_Sri) - [Ganesa](/wiki/Ganesha) - [Garuda](/wiki/Garuda) - [Hainuwele](/wiki/Hainuwele) - [Hanoman](/wiki/Hanuman) - [Hudoq](/wiki/Hudoq) - [Hyang](/wiki/Hyang) - [Nyai Roro Kidul](/wiki/Nyai_Roro_Kidul) - [Raksasa](/wiki/Rakshasa) - [Ratu Adil](/wiki/Ratu_Adil) - [Sanghyang Adi Buddha](/wiki/Sanghyang_Adi_Buddha) - [Saraswati](/wiki/Saraswati) - [Satrio Piningit](/wiki/Satrio_Piningit) - [Setesuyara](/wiki/Setesuyara) - [Siwa](/wiki/Shiva) - [Sunan Ambu](/wiki/Sunan_Ambu) - [Warak ngendog](/wiki/Warak_ngendog) - [Wisnu](/wiki/Vishnu) Mythological and folkloric creaturesBeings - [Acintya](/wiki/Acintya) - [Agni](/wiki/Agni) - [Aji Saka](/wiki/Aji_Saka) - [Bidadari](/wiki/Apsara) - [Batara Guru](/wiki/Batara_Guru) - [Batara Kala](/wiki/Batara_Kala) - [Batara Sambu](/wiki/Batara_Sambu) - [Brahma](/wiki/Brahma) - [Calon Arang](/wiki/Calon_Arang) - [Chen Fu Zhen Ren](/wiki/Chen_Fu_Zhen_Ren) - [Damarwulan](/wiki/Damarwulan) - [Dewi Danu](/wiki/Dewi_Danu) - [Dewi Lanjar](/wiki/Dewi_Lanjar) - [Dewi Ratih](/wiki/Dewi_Ratih) - [Dewi Sri](/wiki/Dewi_Sri) - [Ebu Gogo](/wiki/Ebu_gogo) - [Hainuwele](/wiki/Hainuwele) - [Hantu Air](/wiki/Hantu_Air) - [Hantu Bongkok](/wiki/Hantu_Bongkok) - [Hyang](/wiki/Hyang) - [Hudoq](/wiki/Hudoq) - [Ifrit](/wiki/Ifrit) - [Jailangkung](/wiki/Jailangkung) - [Jenglot](/wiki/Jenglot) - [Jin](/wiki/Jinn) - [Keong Emas](/wiki/Keong_Emas) - [Kuntilanak](/wiki/Kuntilanak) - [Kuyang](/wiki/Krasue) - [Langsuir](/wiki/Langsuyar) - [Leak](/wiki/Leyak) - [Malin Kundang](/wiki/Malin_Kundang) - [Na Tuk Kong](/wiki/Na_Tuk_Kong) - [Nyai Roro Kidul](/wiki/Nyai_Roro_Kidul) - [Orang bunian](/wiki/Orang_bunian) - [Orang Pendek](/wiki/Orang_Pendek) - [O Tokata](/wiki/O_Tokata) - [Pelesit](/wiki/Pelesit) - [Penanggalan](/wiki/Penanggalan) - [Petruk](/wiki/Petruk) - [Pocong](/wiki/Pocong) - [Putri Tangguk](/wiki/Putri_Tangguk) - [Raden Panji](/wiki/Panji_tales) - [Raksasa](/wiki/Rakshasa) - [Ratu Adil](/wiki/Ratu_Adil) - [Sanghyang Adi Buddha](/wiki/Sanghyang_Adi_Buddha) - [Sangkuriang](/wiki/Sangkuriang) - [Saraswati](/wiki/Saraswati) - [Satrio Piningit](/wiki/Satrio_Piningit) - [Semar](/wiki/Semar) - [Setesuyara](/wiki/Setesuyara) - [Silewe Nazarata](/wiki/Silewe_Nazarata) - [Si Pitung](/wiki/Si_Pitung) - [Siwa](/wiki/Shiva) - [Suanggi](/wiki/Suanggi) - [Sunan Ambu](/wiki/Sunan_Ambu) - [Sundel Bolong](/wiki/Sundel_bolong) - [Tuyul](/wiki/Toyol) - [Twalen](/wiki/Twalen) - [Wewe Gombel](/wiki/Wewe_Gombel) - [Wisnu](/wiki/Vishnu) Animals - [Antaboga](/wiki/Antaboga) - [Babi ngepet](/wiki/Babi_ngepet) - [Barong](/wiki/Barong_(mythology)) - [Burak](/wiki/Buraq) - [Ganesa](/wiki/Ganesha) - [Garuda](/wiki/Garuda) - [Hanoman](/wiki/Hanuman) - [Naga](/wiki/N%C4%81ga) - [Taksaka](/wiki/Takshaka) - [Rangda](/wiki/Rangda) - [Warak ngendog](/wiki/Warak_ngendog) Wayang characters - [Wayang purwa](/wiki/Wayang#Wayang_purwa) - [Wayang panji](/wiki/Wayang#Wayang_panji) - [Wayang menak](/wiki/Wayang#Wayang_menak) Rituals and traditions - [Bomoh](/wiki/Bomoh) - [Dukun](/wiki/Dukun) - [Jailangkung](/wiki/Jailangkung) - [Pawang](/wiki/Pawang) - [Ziarah](/wiki/Ziyarat) Mythical and sacred locations - [Borobudur](/wiki/Borobudur) - [Kraton](/wiki/Kraton_(Indonesia)) - [Mt. Tidar](/wiki/Mount_Tidar) - [Prambanan](/wiki/Prambanan) - [Ratu Boko](/wiki/Ratu_Boko) - [Tua Pek Kong](/wiki/Tua_Pek_Kong) - [Turgo](/wiki/Turgo) Sacred objectsMythical texts - [Arjunawiwaha](/wiki/Arjunawiwaha) - [Hikayat Amir Hamzah](/wiki/Hikayat_Amir_Hamzah) - [Hikayat Banjar](/wiki/Hikayat_Banjar) - [Hikayat Bayan Budiman](/wiki/Hikayat_Bayan_Budiman) - [Hikayat Iskandar Zulkarnain](/wiki/Hikayat_Iskandar_Zulkarnain) - [Hikayat Raja-raja Pasai](/wiki/Hikayat_Raja-raja_Pasai) - [Kakawin Ramayana](/wiki/Kakawin_Ramayana) - [Kakawin Sutasoma](/wiki/Kakawin_Sutasoma) - [La Galigo](/wiki/La_Galigo) - [Mahabharata](/wiki/Mahabharata) - [Bharatayuddha](/wiki/Bharatayuddha) - [Kakawin Bhāratayuddha](/wiki/Kakawin_Bh%C4%81ratayuddha) - [Kakawin Hariwangsa](/wiki/Kakawin_Hariwangsa) - [Nagarakṛtāgama](/wiki/Nagarakretagama) - [Pararaton](/wiki/Pararaton) - [Pustaha](/wiki/Pustaha) - [Śiwarātrikalpa](/wiki/%C5%9Aiwar%C4%81trikalpa) - [Smaradahana](/wiki/Smaradahana) - [Tuhfat al-Nafis](/wiki/Tuhfat_al-Nafis) - [Wawacan Sulanjana](/wiki/Wawacan_Sulanjana) Sacred weapons - [Kris](/wiki/Kris) - [Kujang](/wiki/Kujang_(weapon)) - [Rencong](/wiki/Rencong) Funerals - [Tau tau](/wiki/Tau_tau) See also - [Hantu](/wiki/Hantu_(supernatural_creature)) - [Indonesian folk religions](/wiki/Aliran_Kepercayaan) - [Javanese sacred places](/wiki/Javanese_sacred_places) - [List of Indonesian deities](/wiki/List_of_Indonesian_deities) - [List of sacred places in Java](/wiki/List_of_sacred_places_in_Java) Indonesia portal Mythology portal - v - t - e There are many **Malay ghost myths** ([Malay](/wiki/Malay_language): *cerita hantu Melayu*; [Jawi](/wiki/Jawi_script): چريتا هنتو ملايو), remnants of old animist beliefs that have been shaped by Hindu-Buddhist cosmology and later Muslim influences, in the modern states of [Brunei](/wiki/Brunei), [Indonesia](/wiki/Indonesia), [Malaysia](/wiki/Malaysia), and [Singapore](/wiki/Singapore) and among the Malay diaspora in neighbouring Southeast Asian countries. The general word for ghost is [hantu](/wiki/Hantu_Demon), of which there exist a wide variety. Some ghost concepts such as the female vampires [pontianak](/wiki/Pontianak_(folklore)) and [penanggal](/wiki/Penanggal) are shared throughout the region. While traditional belief does not consider all ghosts as necessarily evil, Malaysian popular culture tends to categorise them all as types of evil [djinn](/wiki/Djinn). ## History Traditional ghost beliefs are rooted in prehistoric animist beliefs. However, the region has long had extensive contact with other cultures, and these have affected the form of some of the legends. Trade links with southern [India](/wiki/India) and [China](/wiki/China) were established several centuries BCE, in large part shaping the local culture and folklore. The Indian faiths of [Hinduism](/wiki/Hinduism) and [Buddhism](/wiki/Buddhism) were particularly influential in [Southeast Asia](/wiki/Southeast_Asia). [Islam](/wiki/Islam) was also introduced from India, and had become the dominant religion in [Java](/wiki/Java) and [Sumatra](/wiki/Sumatra) by the end of the 16th century. The Muslim beliefs overlaid and mixed with existing cultural and religious influences, rather than eradicating them altogether. One example is the festival of Mandi Safar, originally a Tamil Hindu practice where people bathe in the sea or river and perform ceremonies that purify and protect against sickness and misfortune, and which also serves to introduce marriageable young people. After the introduction of Islam it was given new meaning as a festival to celebrate the recovery of [Muhammad](/wiki/Muhammad) from an illness. The ritual has long been declared officially banned by Singaporean and Malayan clerics on the grounds that it contravenes the teaching of Islam, but continues to be practised in some scale Malaysia and Indonesia. ## Traditional beliefs According to traditional Malay lore, the human soul (*semangat* or essence) is about the size of a thumb and appears as a miniature form of the body (*sarung* or casing) in which it resides. Able to fly and quickly \"flash\" from one location to another, the soul is often compared to and addressed as if it were a bird. It temporarily leaves the person's body during sleep, trance and sickness, before departing permanently at death. When the soul leaves the body it assumes the form of a sort of homunculus, and in this form can feed on the souls of others. At death, the soul usually passes into another person, animal or plant. The spirit or ghost, usually called [hantu](/wiki/Hantu_Demon), continues to linger and may be harmful to its survivors. An old Malay belief is that a person's ghost haunts their grave for seven days before departing. Ghosts may also return and take possession of a living person, causing madness or illness. Ghosts are generally believed to be active only at night time, especially during a [full moon](/wiki/Full_moon). One way to evade such a ghost is for all the victims to formally change their name, so that when the ghost returns it will not recognise them. Another method is to tempt the ghost with a meal. When the ghost turns into an animal such as a chicken so that it can eat, it may be killed and destroyed. Ghosts traditionally were blamed for some illnesses. To cure them, the shaman ([dukun](/wiki/Dukun) or [bomoh](/wiki/Bomoh)) in a village would burn incense, recite incantations, and in some cases sacrifice an animal and wash its blood into a river to appease the ghost. Healing dances may also be performed, such as the [mak yong](/wiki/Mak_yong), *saba*, *main puteri*, or the [Ulek Mayang](/wiki/Ulek_Mayang). ## Birth-spirits Childbirth-spirits are ghosts which are in some way related to birth or pregnancy. A significant number of them are the malignant spirits of stillborn children, while others prey on infants. All are a reflection of a formerly high infant mortality rate. ### Bajang A kind of familiar spirit acquired by a male who says the proper incantations over the newly buried body of a stillborn child. It takes the form of a [civet](/wiki/Civet) or *musang* and may cause convulsions, unconsciousness or delirium. In exchange, its master feeds it eggs and milk. As with other spirits of this type, a bajang may turn on its master if it is neglected. Although a bajang can be made to attack any whom its master chooses, it is considered particularly dangerous to infants and young children. In former times, some children would be given \"bajang bracelets\" (*gelang bajang*) made of black [silk](/wiki/Silk) to protect them against it, and sharp metal objects such as scissors would be placed near babies for the same purpose. Even the striations of pregnancy are somewhat jokingly said to be the scars left by a bajang's attack. ### Lang suir Also spelled *langsuir* or *lang suyar*, it is said to be the ghost of a woman who died while giving birth to a stillborn child which turns into a [pontianak](/wiki/Pontianak_(folklore)), or during pregnancy before the forty days of uncleanness have expired. The mother's grief changes her into a type of flying banshee. To prevent a pregnant woman's corpse from becoming a lang suir, glass beads are placed into the mouth, an egg is placed in each armpit, and needles are placed in the hands. The lang suir can appear as a beautiful woman with long nails (a traditional mark of beauty), ankle-length hair and dressed in green. They also have the ability to take the form of an owl with long talons. Being fond of eating fish, they usually haunt coastal areas and attack pregnant women out of jealousy. It is possible to tame a lang suir by cutting off her long nails and stuffing the hair into the hole at the back of her neck. ### Pontianak Also known as *matianak* or *kuntilanak*, it is the ghost of a stillborn female. To prevent this, as with its mother the lang suir, a needle is placed in each of the corpse's hands and a hen's egg under each armpit. Depicted as an ugly woman with sharp nails and a white dress, the pontianak can also take the form of a beautiful young woman or a night-bird. When she is close, she gives off a strong smell of frangipani. It is usually encountered by the roadside or under a tree, and attack men and drink their blood. The Indonesian kuntilanak, however, typically uses its bird form to attack virgin women. The bird, which makes a \"ke-ke-ke\" sound as it flies, may be sent through black magic to make a woman sick, the characteristic symptom being vaginal bleeding. A pontianak can be made into a good wife, by placing a nail into the hole at the nape of its neck (called [Sundel Bolong](/wiki/Sundel_Bolong)). Modern popular culture often confuses the pontianak with its mother the *lang suir*. However, traditional myth is clear that the pontianak is the ghost of a dead baby and not a pregnant woman. A similar ghost called [tiyanak](/wiki/Tiyanak) exists in Philippine lore. ### Penanggal The penanggal is another type of female vampire attracted to the blood of newborn infants, which appears as the head of a woman from which her entrails trail, used to grasp her victim. There are several stories of her origins. One is that she was a woman who was sitting meditating in a large wooden vat used for making vinegar when she was so startled that her head jumped up from her body, pulling her entrails with it. Another has her as a normal woman during the day, whose head and entrails leave her body at night. If a baby is expected, branches from a type of thistle are placed around the doors or windows to protect the house, since her entrails will be caught by the thorns. The penanggalan is known in [Thai](/wiki/Thai_language) as *[krasue](/wiki/Krasue)* and a similar Philippine ghost called the *[manananggal](/wiki/Manananggal)* which preys on pregnant women with an elongated proboscis-like tongue. ### Toyol Often translated into English as \"goblin\", the toyol is actually a small child spirit invoked from a dead human fetus. Traditionally described as looking more or less like a naked or near-naked baby, modern depictions often give them green or brownish skin, large fangs, and sharp ears. The toyol may be used by its master to capture other people, or to do mischief. Because they are childlike in their thinking, valuables can be protected by scattering buttons on the floor, or leaving sweets or toys next to them, all of which will distract the toyol. It is said that the owner of a toyol may become rich, but at the expense of the health, fortune and even the lives of members of their family. ## Ghost as agents of shamans Shamans (known in Malay as [dukun](/wiki/Dukun) or [bomoh](/wiki/Bomoh)) are said to be able to make use of spirits and demons for either benign or evil purposes. Although Western writings often compare this to the [familiar spirits](/wiki/Familiar_spirit) of English witchcraft, it actually corresponds more closely with the Japanese [inugami](/wiki/Inugami) and other types of [shikigami](/wiki/Shikigami), in that the spirits are hereditary and passed down through families. [Polong](/wiki/Polong) A kind of bottled-imp, created by keeping the blood of a murder victim in a bottle and saying certain incantations over it for seven or fourteen days. The owner, who is treated as the polong's parent, must feed the spirit daily with blood from their neck. A person who has been afflicted by the polong will cry out and wildly strike at people nearby, all the while blind and deaf to their surroundings, and unconscious of what they are doing. In such cases, a [bomoh](/wiki/Bomoh) would be called in to question the polong and find out who is its parent and where they are located. If the polong lies or conceals the identity of its owner, the victim will die after one or two days. [Pelesit](/wiki/Pelesit) The pelesit is created from the tongue of a newly buried dead body whose mother was also the eldest of her siblings. Its appearance is that of a [cricket](/wiki/Cricket_(insect)) and it is kept in a bottle which is buried if the owner wishes to rid herself of it. In advance of a polong's arrival, the pelesit will enter the body of whomever its mistress has told it to attack. A person who has been thus afflicted might rave about [cats](/wiki/Cat). The pelesit is in many ways comparable to the bajang, but whereas the bajang's owner is always male, the pelesit may only be kept by a female. It may be fed on blood from the tip of the fourth finger or, alternatively, with saffron rice. Like the polong, the pelesit can be forced to reveal the name of their owner through magical questioning. [Hantu Raya](/wiki/Hantu_Raya) The hantu raya (meaning \"great ghost\") is considered one of the most powerful of Malay ghosts. Possessing great strength, it usually takes on the appearance of its owner and carries out manual labour on their behalf. However, it is said to have a limited range, being unable to go far from its home. ## Other ghosts - *[Hantu Air](/wiki/Hantu_Air)* (water spirits) live in large bodies of water, such as a river or lake. Some are said to be the ghosts of people who drowned, but they are generally independent spirits. If they show themselves, it is usually in the form of a floating log. They can be dangerous, and may drown or eat people. Until the 1960s, Malays in [Terengganu](/wiki/Terengganu) would regularly pay respects to the sea spirits in the *puja laut* ceremony. - *Hantu galah* (pole ghost) is a very tall and thin ghost found among trees and bamboo. To make it disappear, a person simply picks up a stick or twig and breaks it. It is normally male. - *Hantu tetek* (nipple ghost) appears as an old woman with pendulous breasts. - *Hantu laut* (sea spirits) are animistic water spirits who assist fishermen and sailors. Until the 1960s, Malays in [Terengganu](/wiki/Terengganu) used to regularly pay respects to the sea spirits through the *puja pantai* or *puja laut* ceremony. - *Jembalang tanah* are earth demons, which may act dangerously if not appeased with the proper rituals. - *[Jenglot](/wiki/Jenglot)* are doll-like vampiric creatures said to be found in the jungles. They are usually female. What are claimed to be dead jenglot are sometimes sold or exhibited, but they appear to be man-made. - *[Orang minyak](/wiki/Orang_Minyak)* (oily man) is a cursed man who rapes women at night. Because he is covered in oil, he is difficult to catch. - *[Pocong](/wiki/Pocong)* or *hantu bungkus* (wrapped ghost) is a ghost wrapped in a white burial shroud. When a dead person is buried, the shroud is supposed to be untied. If it remains tied at the top, the spirit is restless and the body becomes a pocong. Because they are tied at the feet, they move around by hopping in a manner similar to the Chinese [jiangshi](/wiki/Jiangshi). In some depictions, they are able to fly. ## In popular culture In both Malaysia and Indonesia, ghosts and the supernatural have long been the popular subject of stories in television, documentaries, film, and magazines like *Mastika* and *Tok Ngah*. The 1958 black-and-white horror movie *Sumpah Orang Minyak* is one of many films based on the [orang minyak](/wiki/Orang_Minyak) concept. It tells of a hunchback who through supernatural means becomes good-looking, but turns invisible after violating his oath. The devil offers to help achieve his worldly desires, on condition that he rapes 21 girls within 7 days. Other Malay ghost films such as *Pontianak* and *Revenge of Pontianak* received tremendous response at their time of release. With the rise of the [Islamisation movement](/wiki/Islamic_revival), the Malaysian government suppressed production of local films involving ghosts out of concern that they would encourage superstition. However, access to foreign horror movies made such a ban futile, and these restrictions were eventually lifted with the release of the 2004 film *[Pontianak Harum Sundal Malam](/wiki/Pontianak_Harum_Sundal_Malam)*. The film was well-received, spawning a sequel and a follow-up TV series. Numerous other horror films followed suit, but in keeping with current religious trends, films usually portray all supernatural beings as evil, far removed from traditional beliefs. This is particularly so in documentaries and television series involving ghost hunters.[*citation needed*] In Hellboy: The Troll Witch and Others comics, Hellboy travels to [Malaysia](/wiki/Malaysia) in 1958 where a village devoid of [Bomoh](/wiki/Bomoh) [shaman](/wiki/Shaman) has fallen victim to a demonic penanggalan. A young guide leads him to the demon's cave, where Hellboy is met with a betrayal. 2007's *[Jangan Pandang Belakang](/wiki/Jangan_Pandang_Belakang)* (\"Don't Look Back\"), which used to be Malaysia's highest-grossing film, centres around a malicious spirit which the protagonist had unknowingly brought to his fiancé's home after picking up a small jar found washed up at the beach. The 2010 Indonesian soft-porn horror movie *Hantu Puncak Datang Bulan* (The Menstruating Ghost of Puncak) caused considerable controversy at the time of its release. Detailing the experiences of a group of young adults in a haunted house. The movie contains semi-nude scenes and has been condemned by conservative Muslim leaders. - Mythology portal - Indonesia portal - Malaysia portal - Singapore portal - [Folklore of Malaysia](/wiki/Folklore_of_Malaysia) - [Malay folklore](/wiki/Malay_folklore) - [Malaysian folk religion](/wiki/Malaysian_folk_religion) - [Philippine mythology](/wiki/Philippine_mythology)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:06:37.439104",
  "title": "Ghosts in Malay culture",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Ghosts_in_Malay_culture"
}