{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:06:41.337458"
  },
  "content": "Academic program The **Gifted Education Programme** (**GEP**) is an academic programme in [Singapore](/wiki/Singapore), initially designed to identify the top 0.25% (later expanded to 0.5%, then 1%) of students from each academic year with outstanding intelligence. The tests are based on verbal, mathematical and spatial abilities (as determined by two rounds of tests). Selected students will then be transferred to schools offering the GEP. GEP classes are designed to fit the students' learning ability, and may cover subjects in greater breadth and depth. The curriculum is designed by the Gifted Education Branch and eschews the use of textbooks for notes that have been prepared by GEP teachers. The programme has now been expanded to 1% of the students from each academic year.[*citation needed*] ## History The Gifted Education Programme was first implemented in Singapore in 1984 amid some public concern. It was initiated by the Ministry of Education (MOE) in line with its policy under the New Education System to allow each student to learn at his/her own pace. The MOE has a commitment to ensure that the potential of each pupil is recognised, nurtured and developed. It was recognised that intellectually gifted pupils should be given apter classes to reach their full potential. From its inauguration in two primary schools and two secondary schools, the programme has now expanded to nine primary schools (as of October 2004) and was at its peak before the introduction of the [Integrated Programme](/wiki/Integrated_Programme) (IP). In 2024, Prime Minister [Lawrence Wong](/wiki/Lawrence_Wong) announced that the GEP will be discontinued in its present form and will be replaced by a school-based programme in which all primary schools will set aside resources to identify their high-ability students and stretch them academically. These changes will take effect starting with the Primary One cohort of 2024. Further details will be announced by Education Minister [Chan Chun Sing](/wiki/Chan_Chun_Sing) at a later date. ## Primary Schools offering GEP As of 2020, nine primary schools offer GEP. - [Anglo-Chinese School (Primary)](/wiki/Anglo-Chinese_School_(Primary)) - [Catholic High School (Primary)](/wiki/Catholic_High_School_(Singapore)) - [Henry Park Primary School](/wiki/Henry_Park_Primary_School) - [Nan Hua Primary School](/wiki/Nan_Hua_Primary_School) - [Nanyang Primary School](/wiki/Nanyang_Primary_School) - [Raffles Girls' Primary School](/wiki/Raffles_Girls%27_Primary_School) - [Rosyth School](/wiki/Rosyth_School) - [Saint Hilda's Primary School](/wiki/Saint_Hilda%27s_Primary_School) - [Tao Nan School](/wiki/Tao_Nan_School) ### Impact of the Integrated Programme In 2004, five secondary schools started implementing Integrated Programmes with their affiliated [Junior Colleges](/wiki/Junior_College), and are officially no longer offering the GEP. However, they still have programmes within their respective Integrated Programmes to cater to gifted students. While the secondary schools that have implemented the Integrated Programme remain generally unaffected by the change, [Victoria School](/wiki/Victoria_School), which continued to offer the GEP, saw a drastic decrease in enrolment. ### Secondary Schools that are offering GEP, or SBGE The Gifted Education Programme came to a close in secondary schools in 2008 and was replaced by the School-Based Gifted Education (SBGE) programme. All of the secondary schools that offer the SBGE are IP schools. There are generally two classes per cohort/year/level for SBGE students, but sometimes there may only be one class per cohort, depending on the cohort size. - [Anglo-Chinese School (Independent)](/wiki/Anglo-Chinese_School_(Independent)) - [Dunman High School](/wiki/Dunman_High_School) - [Hwa Chong Institution](/wiki/Hwa_Chong_Institution) - [Nanyang Girls' High School](/wiki/Nanyang_Girls%27_High_School) - [NUS High School of Mathematics and Science](/wiki/NUS_High_School_of_Mathematics_and_Science) - [Raffles Girls School (Secondary)](/wiki/Raffles_Girls_School_(Secondary)) - [Raffles Institution](/wiki/Raffles_Institution) Beginning in 2006, the MOE started to phase out the secondary school GEP due to the impact of the IP. However, GEP pupils who do not wish to take up the Integrated Programme after 2008 can enroll in schools with school-based special programmes at Secondary One. Examples of such schools are [Anglo-Chinese School (Independent)](/wiki/Anglo-Chinese_School_(Independent)), [Catholic High School](/wiki/Catholic_High_School_(Singapore)), [Methodist Girls' School](/wiki/Methodist_Girls%27_School,_Singapore) and [St. Joseph's Institution](/wiki/St._Joseph%27s_Institution). ## Selection Process At Primary Three (P3), all students, except those who opt-out, will take the first round of admission tests, the Screening Test. About 10% of students identified based on the Screening Test results will be invited to participate in the second round, the Selection Test. Based on the Selection Test results, the top 1% of the cohort will be identified and invited to join the Gifted Education Programme, usually by November of that year. English and [Mathematics](/wiki/Mathematics) papers are included as part of the Screening Test, while another two papers, General Ability I and General Ability II, are included in the Selection Test. Before 2003, there was a third round of testing to allow entry for pupils who missed the chance in P3, after the PSLE. This last round of testing was offered to students who achieved 3 or more A*s for the PSLE. Students who enrolled at this stage were referred to as Supplementary Intake students. However, this practice was discontinued in 2003. The IP schools and the new [NUS High School](/wiki/NUS_High_School_of_Math_and_Science), specialising in Mathematics and Science, opened up opportunities for more pupils who were not already part of the primary school GEP, thus, there were ample opportunities to join these schools and therefore no need for a supplementary exercise to select students for the GEP at secondary schools. ## Progress in the Programme The pupils will have to study in this programme from Primary 4 to 6, and after that, the pupils can choose to continue studying in the programme only, in the Integrated Programme, or in the mainstream (not the GEP). Students also have a variety of top secondary schools to choose from depending on their PSLE results. Once the school is chosen, they will automatically enter the Express stream unless they choose otherwise. ## Distinction *Research Project Studies (RPS)* starting in Primary 4, is a program to teach skills needed in research. *Individualized Study Options (ISO)* is a compulsory programme for pupils in Primary 5, wherein pupils do research on a specific topic. The students are asked to choose their own projects in Primary Five under Teacher Mentors. The student-teacher ratio is normally from 4:1 to 5:1. The Study Options given were: - Individualized Research Studies (IRS) → research and present your findings - InnoVation Programme (IvP, formerly IP) → students invent or improve things to solve everyday problems - Future Problem Solving (FPS) → Students solve future problems we may face in society Pupils in the GEP have to take Social Studies as a graded subject. Based on the mainstream textbook syllabus, students will have to study in-depth content. Lessons in the GEP are conducted with no textbooks or workbooks, with the exception of Chinese and Higher Chinese; lessons are more discussion, worksheet, and project oriented. Pupils in GEP learn poetry and literature (*[A Single Shard](/wiki/A_Single_Shard)* in Primary 4, *[The Giver](/wiki/The_Giver)* in Primary 5, and *[Friedrich](/wiki/Friedrich_(book))* in Primary 6) as part of the *Concept Unit* under the English Language subject. *[A Wrinkle in Time](/wiki/A_Wrinkle_in_Time)* was used as the literature book for Primary 5 students until 2014 when it was replaced with *[The Giver](/wiki/The_Giver)*. The main purpose is to show students how a dystopian society functions. For English, students have to do different process writings based on the genres they have studied, including mysteries and fairy tales. In Primary 6, a graded Mathematics Alternative Assessment (Math AA) is given. The pupils will have to choose from six or seven projects that GEP branch officers in the Ministry of Education (MOE) create. These projects are individual and include research, a product to be made and reflections. They will also be required to do a biography unit, of which one is an oral assignment, with the latter a written assignment. ## Integration with mainstream In an article in [The Straits Times](/wiki/The_Straits_Times) on 3 November 2007, the MOE announced its new scheme to \"encourage\" greater integration between GEP and mainstream students, to combat [elitism](/wiki/Elitism) and encourage socialisation. GEP students in the nine primary GEP centres would spend up to 50% of their lesson time with the top 2% to 5% of the cohort, or the top mainstream students. Non-core subjects such as art, music, and physical education are conducted with the mainstream cohort. The announcement of the integration provoked much buzz in the [blogosphere](/wiki/Blogosphere). - Ministry of Education Gifted Education Programme Website - Gifted kids to take 'integrated' path Archived 30 September 2007 at the [Wayback Machine](/wiki/Wayback_Machine)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:06:41.336950",
  "title": "Gifted Education Programme (Singapore)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Gifted_Education_Programme_(Singapore)"
}