{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:06:43.381850"
  },
  "content": "Cultural hub in SingaporeThis article's **tone or style may not reflect the encyclopedic tone used on Wikipedia**. See Wikipedia's guide to writing better articles for suggestions. *(September 2015)* *(Learn how and when to remove this message)* **Gillman Barracks** is a contemporary arts cluster in [Singapore](/wiki/Singapore) that is home to international art galleries, restaurants and the [NTU Centre for Contemporary Art Singapore](/wiki/NTU_Centre_for_Contemporary_Art_Singapore), which are all housed in conserved colonial barracks. Gillman Barracks lies near to Alexandra Road, and the 6.4-hectare (16-acre) site covers Lock Road and Malan Road amid greenery. Gillman Barracks is jointly developed by the [Singapore Economic Development Board](/wiki/Singapore_Economic_Development_Board), [JTC Corporation](/wiki/JTC_Corporation) and the [National Arts Council](/wiki/National_Arts_Council_(Singapore)). ## History ### 1936-1990 : As military accommodation Before Gillman Barracks was built in 1936, it was a land of mostly swamp and jungle. Named after the late [General Sir Webb Gillman](/wiki/Webb_Gillman), an esteemed officer sent by the British army, Gillman Barracks was chosen to be the military barracks of the British because of its prime location near the sea. Gillman Barracks housed the 1st Battalion, [Middlesex Regiment](/wiki/Middlesex_Regiment) a line infantry regiment of the British Army, and the 2nd Battalion, [Loyal Regiment](/wiki/Loyal_Regiment_(North_Lancashire)) of the British Army. The plan was to accommodate the expansion of the British infantry in Singapore. The camp included married quarters for officers, barracks buildings, sports facilities, messes, regimental institutes and even a swimming pool. Gillman Barracks was one of the last British outposts to fall to the Japanese during the [Second World War](/wiki/Second_World_War), where the Regiment fought the Japanese three days before Singapore fell in February 1942. After the Japanese surrender on 14 August 1945, command of the base transferred to the returning British forces. In August 1971, the British handed over Gillman Barracks to the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces) (SAF) for a token sum of $1, as part of their withdrawal from Singapore. For the next 13 years, it was the headquarters for the School of Combat Engineering and the 3rd Transport Battalion. In the early 1970s, some of the buildings were also used by the [Singapore American School](/wiki/Singapore_American_School) for classroom space. In 1984, a similar handover was done between the School of Combat Engineering and the SAF Transport Base, with $1 being the handover fee. Gillman Barracks was vacated in 1990 and used subsequently for commercial purposes. ### 1991-2010 : Entertainment hub as Gillman Village After the SAF vacated the camp in the 1990s, the buildings were used for commercial purposes and the site was renamed Gillman Village in 1996. The main colonial building was repainted and renovated to include commercial spaces such as cafés, restaurants, bars and furniture shops. The idea was to draw people to this slightly hidden enclave with the promise of colonial charm and delicious food and beverage options. However, Gillman Village was not very successful due to its isolated location and it had little human traffic. In 2002, the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) (URA) declared Identity Plans for 15 areas in Singapore, with Gillman Village being one of that 15. Grouped under the Southern Ridges and Hillside Villages category, the plan was to \"enhance (the) activities\" within this area through the introduction of \"new buildings\" and the act of \"bringing in more activities\". The Identity Plans were met with strong public support, as shown by surveys done at the URA centre from 23 July to 23 October 2002. 72% of respondents agreed with the proposed enhancements. ### 2011-present : Art centre as Gillman Barracks In 2010, the Singapore government announced plans to redevelop Gillman Village, reverting to its original name, Gillman Barracks. Gillman Barracks was launched in September 2012 as a contemporary art centre with 13 art galleries, including well-established galleries such as Tomio Koyama Gallery and Sundaram Tagore Gallery. The area is now a site for arts-related activities, where various agencies like the [Economic Development Board](/wiki/Economic_Development_Board) (Development and Promotion), [JTC Corporation](/wiki/JTC_Corporation) (Refurbishment and Construction) and [National Arts Council](/wiki/National_Arts_Council_(Singapore)) (Promotion of Singapore Arts Scene) work together to develop the area. In April 2015, five galleries — almost a third of the 17 galleries there — did not renew their leases, citing low human traffic, poor sales and a slow start to the arts enclave. This came after \"three years of persistently low footfall\". In February 2016, Galerie Michael Janssen also left, citing how it \"felt the project has not taken off as envisioned\". The Singapore design label Supermama, the Creamier ice cream shop and the Australian gallery Sullivan+Strumpf moved in instead. In 2019, due to [Singapore Art Museum](/wiki/Singapore_Art_Museum) undergoing renovations, the [Singapore Biennale](/wiki/Singapore_Biennale) was held at several venues including the [National Gallery Singapore](/wiki/National_Gallery_Singapore) and [LASALLE College of the Arts](/wiki/LASALLE_College_of_the_Arts), with Gillman Barracks hosting several spaces distributed among three different blocks as well. In 2020, partially due to the [COVID-19 pandemic](/wiki/COVID-19_pandemic), two more galleries have left the art district, throwing further doubts on the future of Gillman Barracks amidst the difficulty times. On top of that, as a result of the cessation of funding from the [Economic Development Board](/wiki/Economic_Development_Board) and the inability for NTU to make up for the shortfall in funding following a financial restructuring, NTU CCA will have to close its exhibition hall and residency studios. In 2024, Gillman Barracks was considered for redevelopment into a residential area. ## Buildings ### Block 9 Known as the primary colonial building, it once housed some of the British Army's most well-known warrant officers, such as General Sir Webb Gillman himself. This building served as the officers’ married quarters, with recreational activities such as badminton carried out in the open spaces in front of the building. Today, the main colonial building has been named Block 9 in Gillman Barracks, the main and biggest block in the contemporary arts cluster. The similar colonial architecture has been preserved, and has survived various transformations in the Gillman area. Similar big windows, wide corridors and high arches are still present, allowing for good ventilation within the building. Block 9 was designed and built as a Warrant Officers and Sergeants Mess from the time it was constructed in 1935. It did not serve as officers quarters and most certainly did not accommodate General Webb Gillman - who died in office in 1933. Gillman only spent 3 months in Singapore during 1927. The building reverted to its original use after the Japanese surrender in 1945, it remained as a mess for the Royal Engineers until the British withdrawal in 1971 ### The Army Kinema Corporation (AKC) After the Second World War, the British War Office in London established the Army Kinema Corporation (AKC) and set up the Regal Cinema at Gillman Barracks to entertain the British troops stationed there. Movies were screened twice nightly except Tuesday nights, including films such as *[Ben Hur](/wiki/Ben-Hur_(1959_film))* (1959) and *[Jailhouse Rock](/wiki/Jailhouse_Rock_(film))* (1957). During the time of Gillman Village, the same building was preserved, but served a different purpose. It was known as the Verve Bar & Bistro. The AKC logo remained on the side of the building and was repainted. After the redevelopment of Gillman Village into Gillman Barracks, the building houses commercial art galleries and exhibitions, while still preserving its famous AKC logo on the exterior. It is also known as Block 7 today, the only block with a pointed roof within Gillman Barracks. ### Bourne School From 1945 onwards, the British Forces Schools operated within the Army and Naval Bases in Singapore. Alexandra Grammar School was built on top of the hill at Gillman Barracks and renamed Bourne Secondary School in 1964. Students took the side steps up to Bourne School at the top of hill. The school has relocated to Preston Road, and is now known as the [ISS International School](/wiki/ISS_International_School) – not too far from where Gillman Barracks is. Today, the similar side steps which used to lead up to the school are covered by grown trees and vegetation, with art fixtures near Block 37. ## Vision In its conception, the Gillman Barracks aims to foster cultural exchange and creation, generating discourse and research and showcasing innovative art. The galleries, education and outreach efforts are to establish Singapore as an important centre for contemporary art in Asia. The art cluster is an effort to create vibrant arts scene in Singapore made up of public museums, commercial galleries, non-profit spaces, and major art events such as the [Singapore Biennale](/wiki/Singapore_Biennale) and [Art Stage Singapore](/wiki/Art_Stage_Singapore). The vision promotes Gillman Barracks as a contemporary arts space – to display and sell art – while preserving part of the area's colonial history. Today, various colonial barracks, including Block 9, are used as art galleries, shops and restaurants. ## Galleries The galleries have diverse exhibitions by internationally acclaimed artists from [Southeast Asia](/wiki/Southeast_Asia) and around the world. Artists include both the established and emerging such as Alfredo and Isabel Aquilizan, Heman Chong, [Ai Weiwei](/wiki/Ai_Weiwei), [Yayoi Kusama](/wiki/Yayoi_Kusama), [Yoshitomo Nara](/wiki/Yoshitomo_Nara) and [Sebastião Salgado](/wiki/Sebasti%C3%A3o_Salgado). Tours are also provided by Friends of the Museums, giving the public an insight to the art located within the Barracks, as well as the Barracks' rich history and heritage. A changing number of international and local galleries have inhabited the spaces since it was established as an arts precinct. Six of the original 13 galleries remain as of 2020. The current galleries are - FOST Gallery - Mizuma Gallery - Ota Fine Arts - Partners & Mucciaccia - Richard Koh Fine Art - [ShanghART Gallery](/wiki/ShanghART_Gallery) - Sundaram Tagore Gallery - The Columns Gallery - Ames Yavuz - Yeo Workshop ## Education and outreach Gillman Barracks houses several art institutions and charities, including: - **[Nanyang Technological University](/wiki/Nanyang_Technological_University) Centre for Contemporary Arts** (NTU CCA) - devoted to advancing knowledge in contemporary art through its international artist residencies, research and exhibition programmes that will bolster the region's visual arts landscape. As of 2021, it has closed down its exhibition hall and residency studios and only retains its office and research centre. - **Art Outreach** - a non-profit art education organisation that promotes art appreciation in Singapore started in 2003. The programme exposes participants to the world of art and promotes visual literacy. - [List of museums in Singapore](/wiki/List_of_museums_in_Singapore) - Official website 1°16′41″N 103°48′16″E﻿ / ﻿1.27806°N 103.80444°E﻿ / 1.27806; 103.80444\n",
  "language": "en",
  "processed_at": "2026-01-12T11:06:43.381373",
  "title": "Gillman Barracks",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Gillman_Barracks"
}