{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:05:35.157632"
  },
  "content": "2025 technology exhibition in Singapore **GITEX ASIA** is part of the global [GITEX](/wiki/GITEX) series of technology events, specifically tailored to the Asian market. The event brings together businesses, governments, and innovators to present and explore new technologies influencing the future of the digital world. GITEX ASIA is organized by KAOUN International in collaboration with the [Dubai World Trade Centre](/wiki/Dubai_World_Trade_Centre) (DWTC) ## History The first edition of GITEX ASIA x AI Everything Singapore took place from 23 to 25 April 2025, at the [Marina Bay Sands](/wiki/Marina_Bay_Sands) Expo & Convention Centre in [Singapore](/wiki/Singapore). In 2025 edition, over 75% of participating tech companies introduced digital and AI innovations never before seen in Southeast Asia, while tens of thousands of tech executives from 110 countries forged new connections that could redefine industries. The conference featured 432 speakers from 39 countries addressing key topics in the fields of artificial intelligence (AI), machine learning, 5G, smart cities, blockchain, cybersecurity, the [Internet of Things](/wiki/Internet_of_things) (IoT), digital health & biotech, cloud, data centres and green technology. ### Program Top tech leaders, including CEOs, government officials, and investors gave talks at GITEX ASIA x AI Everything Asia 2025 edition. [Big tech](/wiki/Big_Tech) companies include Ericson, Kaspersky, Fortinet, Lenovo SentinelOne Nebius, Manage Engine, Gorilla, Neurowatt, NVDIA, China Mobile International, Alibaba Cloud, Oracle along with 400+ global startups showcased their latest innovations. Also, the startup in country pavilions from 50+ countries including The Netherlands, Serbia, Vietnam, Pakistan, Hong Kong SAR, France sought investors and mentorship. The event also hosted more than 100 workshops focusing on key areas such as data science and cybersecurity, along with various meetups designed to facilitate business collaboration and industry networking.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:05:35.157113",
  "title": "GITEX Asia",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/GITEX_Asia"
}