{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:06:49.342754"
  },
  "content": "Tire companyThis article **may rely excessively on sources too closely associated with the subject**, potentially preventing the article from being verifiable and neutral. Please help improve it by replacing them with more appropriate citations to reliable, independent sources. *(October 2025)* *(Learn how and when to remove this message)* **Giti Tire** is a Singapore-headquartered Indonesian [tire](/wiki/Tire) company, with eight manufacturing facilities, more than 32,000 global employees, and distribution to a market of more than 130 countries. As of 2022,[update] Giti was ranked as the number ten tire manufacturing company in the world based on revenue. ## History Giti Tire's roots go back to 1951 when it was founded under the name Fotaixing, beginning with bicycle tire and inner-tube manufacturing in [Indonesia](/wiki/Indonesia), and later producing bias tires for passenger and commercial vehicles. The founders were the Lim family, a [Chinese Indonesian](/wiki/Chinese_Indonesians) family originating from [Putian](/wiki/Putian) in China, who gained wealth from [pepper](/wiki/Black_pepper) trade. In 1961, the company changed its name to Gajah Tunggal [id]. The company entered China in 1993 and established a joint venture with Anhui Tire Factory, an independent third party for the production of bias tires. In 1998, Giti established proprietary sales and distribution centers in various locations, completing manufacturing facilities in Fujian two years later to serve new passenger car tire (PCR) production. Since then, the company has expanded further internationally, opening offices and distribution centers around the world. In 2010 the company adopted a new [Lippincott](/wiki/Lippincott_(brand_consultancy))-designed logo featuring an elephant. In June 2014, the company announced plans to build a US$560 million production plant in [Richburg, South Carolina](/wiki/Richburg,_South_Carolina), (in the [Charlotte metropolitan area](/wiki/Charlotte_metropolitan_area)) USA, its first factory outside of Asia, which opened in October 2017. In February 2016, Giti was named Automotive Supplier of the Year and Hardlines Supplier of the Year by Bentonville, AR retailer [Walmart](/wiki/Walmart). In 2018 the company reported US$3.2 billion in revenue, including affiliate PT Gajah Tunggal Tbk. ### Giti Group Giti Tire's parent company, Giti Group, also owns a paper business and develops and operates retail stores in Indonesia. ## Facts and Figures - **Markets Present:** more than 130 countries - **Regional Offices:** [United States](/wiki/United_States), [Canada](/wiki/Canada), [UK](/wiki/UK), [Germany](/wiki/Germany), [France](/wiki/France), [Indonesia](/wiki/Indonesia), [China](/wiki/China), [UAE](/wiki/UAE), [Malaysia](/wiki/Malaysia), and [Singapore](/wiki/Singapore) - **Research and Development:** Locations in the US, Germany, UK, Indonesia, and China. Proving grounds in five different locations (Ding Yuan Proving Ground in China, Mira Proving Ground in the UK, Mella Track Proving Ground in Finland, ARTC in Taiwan, and in Karawang, Indonesia. - **Manufacturing Facilities:** Five plants, located in China, Indonesia, and in South Carolina, USA. All plants have obtained ISO/TS16949:2002 accreditation (a standard of quality control and ISO14001 for Environmental Management System). ### Brand Portfolio Giti Tire manufactures a variety of brands of passenger car, truck/bus, and off-road tires for global markets, which include Giti, GT Radial, Primewell, Runway, and Dextero. ## Motorsports Giti sponsors motorsports drivers and events under the Giti and GT Radial brands. Included among these are being the tire sponsor for many Motorsports events in Asia and Europe, including the [F3 Asian Championship](/wiki/F3_Asian_Championship) In 2017, Giti Tire debuted at the [24 Hours Nürburgring](/wiki/24_Hours_N%C3%BCrburgring) Race in Germany, qualifying 1st in the SP8 class, and placing 2nd in its class after a final race mechanical issue on the transmission. In 2019, the company achieved its best performance yet, with a first and second-place finish in the SP8 class at the 24 Hours Nürburgring. In addition, its 'Giti's Angels' team of all-female drivers, technicians, and coach achieved a first class finish in their group at the final VLN race in 2019. In the UK, Giti is the official tire of the VW Beetle Fun Cup, using GitiCompete GTR1 tires. Also in the UK, Giti have been the official sponsor and exclusive tyre supplier of the [British Truck Racing Championship](/wiki/Truck_racing) since 2022, which they extended into 2023. GT Radial is a tire supplier to drifting competitors such as [Chris Forsberg](/wiki/Chris_Forsberg) ([Formula D](/wiki/Formula_D); since 2021), Benjamin Bourdet (European Champion), and the German drift team. In the United States, Giti has sponsored Japan's [Nobuhiro Tajima](/wiki/Nobuhiro_Tajima) in the Pikes Peak International Hill Climb Championship, the 2013 winner in the Electric Auto division. In 2023, Giti is the official supplier of the [Formula Regional Middle East Championship](/wiki/Formula_Regional_Middle_East_Championship).\n",
  "language": "en",
  "processed_at": "2026-01-12T11:06:49.342234",
  "title": "Giti Tire",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Giti_Tire"
}