{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:06:51.311898"
  },
  "content": "* *Glenn Marine Group** is a [Singapore](/wiki/Singapore)-based supplier of maritime services including naval logistics and the operation of shore-base support including cruise terminals and port-operations. ## History The company was formed as Glenn Marine Enterprise in 1946 in [Penang, Malaya](/wiki/Penang), providing [chandler](/wiki/Ship_chandler) services to ships using the Swettenham Pier. ## Glenn Defense Marine Asia In September 2013, a subsidiary of the company, ship support contractor Glenn Defense Marine Asia (GDMA), became the central public focus of an ongoing investigation into a corruption scandal within the [US Navy](/wiki/United_States_Navy). In 2010, Navy officials became suspicious that some of the bills submitted by the GDMA company from [Thailand](/wiki/Thailand) were padded. According to prosecutors investigating the case, the company overcharged the Navy for goods and services by an amount that exceeded 20 million dollars. The company's chief executive, president and chairman, Leonard Glenn Francis, also known as '[Fat Leonard](/wiki/Fat_Leonard_scandal),' allegedly recruited a network of moles within the Navy's [United States Seventh Fleet](/wiki/United_States_Seventh_Fleet) and the [Naval Criminal Investigative Service](/wiki/Naval_Criminal_Investigative_Service) (NCIS), who would provide him with classified operational schedules of Navy ships, and alert him when naval auditors tried to investigate suspicious business transactions with Glenn Marine. In exchange, prosecutors charge that Francis would supply the navy officials with prostitutes, travel expenses and other perks. ## Subsidiaries - Glenn Defense Marine Asia (GDMA) - Glenn Marine Logistics Base (GMLB) - Glenn Ports & Cruise Terminals (GPCT)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:06:51.311352",
  "title": "Glenn Marine Group",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Glenn_Marine_Group"
}