{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:06:53.329925"
  },
  "content": "Job recruitment platformThis article **may have been created or edited in return for undisclosed payments**, a violation of Wikipedia's terms of use. It may require cleanup to comply with Wikipedia's content policies, particularly neutral point of view. *(March 2023)* **Glints** is an online job recruitment platform headquartered in Singapore. The company was founded in August 2013 by Oswald Yeo, Looi Qin En and Seah Ying Cong. Through the website, users can apply for internships, full-time, part-time or project based positions with partnered companies. ## History The company was founded by Oswald Yeo, Looi Qin En and Seah Ying Cong, who met back in high school, [Hwa Chong Institution](/wiki/Hwa_Chong_Institution). Glints began by the founders helping their friends in their search for internships by building up their career readiness through practical & real-world experiences. In August 2013, Glints started off with 38 members tracked in Google Sheets and as of April 2015 it had grown to over 7000 active members. The trio have put their computer science degrees and scholarships on hold at Stanford, University of California Berkeley, and Wharton Business School respectively, in order to pursue the business. In 2017, Looi left the company, citing \"creative friction\", and went on to complete his degree and later join the Boston Consulting Group. ## Funding Glints is an alumnus of accelerator Joyful Frog Digital Incubator (JFDI.Asia). In 2014 Glints had received US$59,940 in pre-seed money from private business angels and JFDI. On October 20, 2014, Glints managed to secure $475,000 in an oversubscribed seed round from venture capitalists, led by East Ventures, with participation from [500 Startups](/wiki/500_Startups), Infocomm Investments, Darius Cheung, John Tan, SPH Media Fund, 8 Capital and Pix Vine Capital. These funds will be used to grow its engineering team to develop the platform. According to co-founder Oswald Yeo, they have turned away about US$250,000 as they \"didn't want to raise so much money right now\". In February 2018, Singapore-listed recruitment firm HRnetGroup Limited made a strategic investment in Glints. In July 2019, Glints managed to secure $6.8 million in a Series B round led by Monk's Hill Ventures. In April 2021, Glints announced a $22.5 million Series C round led by Tokyo-listed human resources management firm PERSOL Holdings. It was the largest investment round into a career platform in Southeast Asia at that time. In August 2022, Glints secured $50 million in a Series D oversubscribed round co-led by DCM Ventures, Lavender Hill Capital, and returning investor PERSOL Holdings.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:06:53.329461",
  "title": "Glints (platform)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Glints_(platform)"
}