{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:06:55.530935"
  },
  "content": "International esports organization The **Global Esports Federation** (**GEF**) is a non-governmental organization that convenes the world's [esports](/wiki/Esports) (or competitive [video gaming](/wiki/Video_game)) community. It was established on December 16, 2019, and is headquartered in Singapore, where it is a registered society under the Singapore Registry of Societies. The GEF consists of 180 Member Federations and four continental Esports Development Federations (Africa, Europe, Oceania and Pan Am). As of January 2025, there are 10 Commissions and two Councils that guide the work of the federation. The founding President of the GEF was [Chris Chan](/wiki/Chris_Chan) of Singapore. As of September 2025, Paul J. Foster, KStJH, who also serves as CEO, was formally elected President, having previously assumed the role of President ad interim following Chan's resignation in July 2025. The organization's flagship event is the annual Global Esports Games (GEG), held since 2021. The GEG is a multi-title esports competition featuring athletes from Member Federations that takes place in December every year. The GEF also organizes the Global Esports Tour (GET) and supports its Member Federations in hosting local esports competitions and regional qualifying events. ## History The GEF was launched on December 16, 2019 with [Chris Chan](/wiki/Chris_Chan) appointed as its founding President. The Board currently consists of a President, six Vice-Presidents, and 15 Board Members. The GEF appointed its first Chief Executive Officer & Secretary General, Sir Paul J. Foster, in March 2021. Chan was re-elected as President of GEF in 2023 for a second four-year term. On 23 July 2025, following Chan's resignation, Foster was elected President ad interim by the GEF Executive Committee, and formally elected President at its Board Meeting in September 2025. The GEF organizes two main events: the Global Esports Games (GEG) and the Global Esports Tour (GET). The inaugural Global Esports Games were staged in [Singapore](/wiki/Singapore) in December 2021, followed by the second edition in [Istanbul](/wiki/Istanbul), Turkey in 2022 and [Riyadh](/wiki/Riyadh), Saudi Arabia in 2023. The first season of the Global Esports Tour was staged in 2021, beginning in [Los Angeles](/wiki/Los_Angeles) in September. Both the GEG and GET are held on an annual basis. ## GEF Board DesignationNameCountry/TerritoryPresidentPaul J. Foster, KStJH AustraliaVice PresidentsChester King United KingdomT A Ganda Sithole ZimbabweAdrian Lismore IrelandMelita N. Moore, M.D. United StatesBoard MembersRamil Aliyev Azerbaijan[Stefy Bau](/wiki/Stefy_Bau) ItalySamy Bessi BelgiumHala Ghandour LebanonLeo Fontes BrazilLorenzo Giorgetti ItalyHideki Hayakawa JapanJay Lee South KoreaJerry Ling SingaporeSteve Loader AustraliaRonny Lusigi KenyaYaqui Núñez del Risco Mejía Dominican RepublicAlper Afsin Özdemir [Türkiye](/wiki/Turkey)[Dana Reizniece](/wiki/Dana_Reizniece-Ozola) LatviaAurelia Ruetsch FranceKoen Schobbers NetherlandsPeter Zeytoonjian United StatesChief Executive OfficerPaul J. Foster, KStJH AustraliaHonorary Board Member[Faisal bin Bandar bin Sultan Al Saud](/wiki/Faisal_bin_Bandar_bin_Sultan_Al_Saud) Saudi ArabiaSenior AdvisorsHong Li Glauser Switzerland[Nandan Jha](/wiki/Nandan_Jha) IndiaNicholas Aaron Khoo SingaporeAli Kiremitçioğlu [Türkiye](/wiki/Turkey)Duane Mutu New ZealandHideki Okamura Japan ## GEF Commissions & Councils Commission / CouncilChairAthletes, Players, Community[Stefy Bau](/wiki/Stefy_Bau)Brand, Marketing, CommunicationsLorenzo GiorgettiEducation, Culture, YouthJerry LingFinance, Legal, AdministrationAdrian LismoreGovernance, Ethics & MembershipT A Ganda SitholeHealth & WellnessMelita N. Moore, M.D.International Relations & DevelopmentAurelia RuetschDigital Transformation[Eric Pulier](/wiki/Eric_Pulier)GEG Coordination CommissionMelita N. Moore, M.D.Strategy & ImpactVictoria Cabezas AlvarezYouth CouncilAnim WardInternational Federations Advisory CouncilDr. [Choue Chung-won](/wiki/Choue_Chung-won) ## Member Federations As of August 2025, there are 180 Member Federations in the GEF: Africa - [Algeria](/wiki/Algeria) - [Benin](/wiki/Benin) - [Botswana](/wiki/Botswana) - [Burkina Faso](/wiki/Burkina_Faso) - [Cameroon](/wiki/Cameroon) - [Chad](/wiki/Chad) - [Democratic Republic of Congo](/wiki/Democratic_Republic_of_the_Congo) - [Republic of Congo](/wiki/Republic_of_the_Congo) - [Djibouti](/wiki/Djibouti) - [Egypt](/wiki/Egypt) - [Eswatini](/wiki/Eswatini) - [Gambia](/wiki/The_Gambia) - [Ghana](/wiki/Ghana) - [Guinea](/wiki/Guinea) - [Ivory Coast](/wiki/Ivory_Coast) - [Kenya](/wiki/Kenya) - [Lesotho](/wiki/Lesotho) - [Libya](/wiki/Libya) - [Malawi](/wiki/Malawi) - [Mali](/wiki/Mali) - [Mauritania](/wiki/Mauritania) - [Mauritius](/wiki/Mauritius) - [Morocco](/wiki/Morocco) - [Namibia](/wiki/Namibia) - [Nigeria](/wiki/Nigeria) - [Senegal](/wiki/Senegal) - [Sierra Leone](/wiki/Sierra_Leone) - [Somalia](/wiki/Somalia) - [South Africa](/wiki/South_Africa) - [South Sudan](/wiki/South_Sudan) - [Tanzania](/wiki/Tanzania) - [Togo](/wiki/Togo) - [Tunisia](/wiki/Tunisia) - [Zambia](/wiki/Zambia) - [Zimbabwe](/wiki/Zimbabwe) Oceania - [Australia](/wiki/Australia) - [Guam](/wiki/Guam) - [New Zealand](/wiki/New_Zealand) - [Papua New Guinea](/wiki/Papua_New_Guinea) - [Tonga](/wiki/Tonga) ### Development Federations In September 2021, the GEF announced the creation of two Esports Development Federations: the Africa Esports Development Federation and the Pan Am Esports Development Federation. In 2023, the Oceania and Europe Esports Development Federations were formed to continue the support of sustainable development of esports communities throughout the world. ## Events ### Global Esports Games The Global Esports Games (GEG) is a multi-title esports competition featuring athletes from Member Federations that takes place in December every year. In May 2021, the GEF announced the host cities for the first three editions of the GEG. The inaugural GEG took place in Singapore in 2021, followed by Istanbul in 2022 and Riyadh in 2023. The 2023 edition was the largest held to date, with 950 athletes competing from more than 100 countries. Global Esports Games 2025 will take place in Mumbai in February 2026 and the 2026 edition will be held in Los Angeles in December 2026. A variety of esports titles have been contested at the Global Esports Games, including: [Valve](/wiki/Valve_Corporation)’s [Dota 2](/wiki/Dota_2), [Konami](/wiki/Konami)’s [eFootball PES 2021 Season Update](/wiki/EFootball_PES_2021_Season_Update), [eFootball 2023](/wiki/EFootball_2023) and [eFootball 2024](/wiki/EFootball_2024), [Capcom](/wiki/Capcom)’s [Street Fighter V](/wiki/Street_Fighter_V) and [Street Fighter 6](/wiki/Street_Fighter_6), as well as [Krafton](/wiki/Krafton)'s [PUBG Mobile](/wiki/PUBG_Mobile). Competition categories include Open and Women, with the Open category allowing both men and women to compete together. #### Editions Source: LocationDatesEvent nameTitlesCategoryChampionPlayers [Singapore](/wiki/Singapore)December 17–19, 2021Global Esports Games 2021[Dota 2](/wiki/Dota_2)Open[Brazil](/wiki/Brazil)Joao Gabriel Giannini dos Santos (4nalog), Leonardo Fernandes de Gusmao (RdO), Gustavo Batista Teixeira Ribeiro (fcr), Leonardo Manulli Moraes Freitas (Manulli), Thiago de Oliveria Cordeiro (Thiolicor), Matheus Santos Jungles Diniz (KJ)Women's[Singapore](/wiki/Singapore)Hui Chun TAY (Melody), Jiayi Amanda LIM (bings), Jia Ling Paula Natalaya TEO (xiaoma), Zhong En Joanne LIM (Minkiey), Sheng Ying HO (KazeL)[eFootball PES 2021 Season Update](/wiki/EFootball_PES_2021_Season_Update)Open[Brazil](/wiki/Brazil)Jana Victor Ferreira Lopes (CSC_Jvictor)[Street Fighter V](/wiki/Street_Fighter_V)Open[Chinese Taipei](/wiki/Chinese_Taipei)Yu-Lin HSIANG ([GamerBee](/wiki/GamerBee)) [Istanbul](/wiki/Istanbul)December 15–17, 2022Global Esports Games 2022 [Dota 2](/wiki/Dota_2)Open[Peru](/wiki/Peru)Bernardo David Rocca Alarcon (BernaBerna), Isaac Antonio Zavaleta Lopez (Drakell), Sebastian Axel Cerralta Velarde (Roboz), Joel Eduardo Mori Ozambela (KIM), Julian Esnaider Carbajal Ylave (FLAPJACK), Diego Fernando Perochena Salvatierra (xephondp)Women's[Thailand](/wiki/Thailand)Suchada Somboonthana (nana), Apinya Pinyokong (Ningendd), Rakpirach Rakchid (CatChaser), Sasiwan Pimpak (sleepless), Supanuch Hirunthanakijjakul (honeylisa), Nuttanitcha Puvasiriroj (Ntygogo)[eFootball 2023](/wiki/EFootball_2023)Open[Iran](/wiki/Iran)Hassan Pajani (Hasan_Player1)[Street Fighter V](/wiki/Street_Fighter_V)Open[Chinese Taipei](/wiki/Chinese_Taipei)Yu-Lin HSIANG ([GamerBee](/wiki/GamerBee))[PUBG Mobile](/wiki/PUBG_Mobile)Open[Vietnam](/wiki/Vietnam)Duong Thanh DINH (DXRabizz), Anh Hao MAC (DXFrankyyy007), Hoang Hung VU (DXLamborghini), Trung Duc CHU (DXTDuccc), Van Dong PHAN (DXVicòi) [Riyadh](/wiki/Riyadh)December 12–16, 2023Global Esports Games 2023[Dota 2](/wiki/Dota_2)Open[Kazakhstan](/wiki/Kazakhstan)Askar Zhumagulov (Toshi), Salamat Sadyr (v3ndetta), Yegor Millor (egxrdemnxn), Ilyas Akhkubekov (liru01), Alexandr Pak (v1olent’)Women's[Malaysia](/wiki/Malaysia)Vanessa Hii (Butterfly), Tiffany Teoh (Hishiko), Bette Chia (istarx), Adeline Anak Foki (velnaoh), Melissa Lim (Lynnie), Stephanie Lim (auroraa)[eFootball 2024](/wiki/EFootball_2024)Open[Jordan](/wiki/Jordan)Sief Adeen Jaser Fahed Dababneh (S.HACKER55)[Street Fighter 6](/wiki/Street_Fighter_6)Open[Dominican Republic](/wiki/Dominican_Republic)Bryan Diesel Tineo Marchena (BryanD)[PUBG Mobile](/wiki/PUBG_Mobile)Open[Ukraine](/wiki/Ukraine)Dmytro Kuzmenko (Bamb1ni), Daniel Havlicek (KVIQQ), Dmytro Bui (TripleOldBoy), Andrii Tulika (madTUL1KA), Denys Havlicek (xqsmeHAVLIK222) [Mumbai](/wiki/Mumbai)February 16–19, 2026Global Esports Games 2025[Dota 2](/wiki/Dota_2) [Clash Royale](/wiki/Clash_Royale) [Los Angeles](/wiki/Los_Angeles)December 2–10, 2026Global Esports Games 2026TBC ### Global Esports Tour The Global Esports Tour (GET) is a series of tournaments for professional esports athletes and teams. In September 2021, the GEF announced the first series of the GET, with each stage showcasing a different esports title. The first edition of the GET had a total prize pool of US$500,000. - [Los Angeles](/wiki/Los_Angeles), [United States of America](/wiki/United_States): September 27–28 - [Hearthstone](/wiki/Hearthstone) - [Riyadh](/wiki/Riyadh), [Saudi Arabia](/wiki/Saudi_Arabia): October 21–23 - [PUBG Mobile](/wiki/PUBG_Mobile) - [Dubai](/wiki/Dubai), [United Arab Emirates](/wiki/United_Arab_Emirates): November 26–27 - Counter-strike: Global Offensive In 2022, the second season of the GET was held over two stages in the cities of Dubai and Riyadh. Dubai staged a CS:GO tournament from June 10–11. Riyadh held a [Street Fighter V - Champion Edition](/wiki/Street_Fighter_V_Champion_Edition) tournament from July 25–27 during the annual Gamers8 festival. In 2023, the third season of the GET was staged in Riyadh from August 26–27 during Gamers8 festival. Participating pro athletes competed for a US$50,000 prize pool in eFootball 2023. In 2024, Season 4 of the Global Esports Tour headed to [Rio de Janeiro, Brazil](/wiki/Rio_de_Janeiro) with a [Counter-Strike 2](/wiki/Counter-Strike_2) tournament from April 18–21. In 2025, Season 5 of the Global Esports Tour announced cities including Mumbai, India, and Lima, Peru, for the first time. ### Marquee Events Beginning in 2021, the Global Esports Federation began hosting esports championships at regional and continental Games. The first marquee event, named the [Commonwealth Esports Championships](/wiki/Commonwealth_Esports_Championships), was held at the [Birmingham 2022 Commonwealth Games](/wiki/2022_Commonwealth_Games). The South American Esports Championships was held in collaboration with the [South American Sports Organization](/wiki/ODESUR) (ODESUR) at the [Asuncion 2022 South American Games](/wiki/2022_South_American_Games). The 2023 European Games Esports Championships was held alongside the [Kraków-Małopolska 2023 European Games](/wiki/2023_European_Games) with support from the [European Olympic Committees](/wiki/European_Olympic_Committees) (EOC). The 2023 Pan American Esports Championships was held in Santiago, Chile in parallel with the [Santiago 2023 Pan American Games](/wiki/2023_Pan_American_Games) in collaboration with [Panam Sports](/wiki/Panam_Sports). ## Partners [Tencent](/wiki/Tencent) is a Founding Global Partner of the GEF. The federation also has a list of other strategic partners including an agreement signed with [Amazon MGM Studios](/wiki/Amazon_MGM_Studios) in January 2024, as well as with the [International Telecommunication Union](/wiki/International_Telecommunication_Union), [Peace and Sport](/wiki/Peace_and_Sport) and [UNESCO](/wiki/UNESCO), among others. The federation announced a partnership with the [Los Angeles Times Media Group](/wiki/Los_Angeles_Times). The GEF also has several key partners within the Olympic Movement, including the [Commonwealth Games Federation](/wiki/Commonwealth_Games_Federation) (CGF), [Pan American Sports Organization](/wiki/Panam_Sports) (Panam Sports), [Olympic Council of Asia](/wiki/Olympic_Council_of_Asia) (OCA), [European Olympic Committees](/wiki/European_Olympic_Committees) (EOC), [South American Sports Organization](/wiki/ODESUR) (ODESUR), and [Centro Caribe Sports](/wiki/Centro_Caribe_Sports). - [International Esports Federation](/wiki/International_Esports_Federation) - Global Esports Federation - Singapore 2021 Global Esports Games - Istanbul 2022 Global Esports Games - Riyadh 2023 Global Esports Games\n",
  "language": "en",
  "processed_at": "2026-01-12T11:06:55.530470",
  "title": "Global Esports Federation",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Global_Esports_Federation"
}