{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:07:05.714685"
  },
  "content": "Former Deputy Prime Minister of Singapore **Goh Keng Swee**[b] [DUT](/wiki/Darjah_Utama_Temasek) (born **Robert Goh Keng Swee**; 6 October 1918 – 14 May 2010) was a Singaporean statesman and economist who served as the second [Deputy Prime Minister of Singapore](/wiki/Deputy_Prime_Minister_of_Singapore) between 1973 and 1985. Goh is widely recognised as one of the [founding fathers](/wiki/List_of_national_founders) of modern Singapore. Goh was a member of the [People's Action Party](/wiki/People%27s_Action_Party) (PAP), which has governed the country continuously since independence. He was also a prominent member of the first generation of political leaders following Singapore's independence in 1965. He served as [Minister for Finance](/wiki/Minister_for_Finance_(Singapore)#Ministers) from 1959 to 1965 and again from 1967 to 1970. He was [Minister for Interior and Defence](/wiki/Ministry_of_Interior_and_Defence#Ministers) between 1965 and 1967, [Minister for Defence](/wiki/Ministry_of_Defence_(Singapore)#Ministers) from 1970 to 1979 and [Minister for Education](/wiki/Ministry_of_Education_(Singapore)#Ministers) from 1979 to 1985. Throughout his entire political career, he represented the constituency of [Kreta Ayer](/wiki/Kreta_Ayer_Single_Member_Constituency). As Minister for Interior and Defence, Goh's main objective was to strengthen the country's military and domestic security capabilities after the British had withdrawn its troops from Singapore, which made the newly independent nation vulnerable. A key policy was the creation of [National Service](/wiki/National_service_in_Singapore) (NS), a mandatory conscription system for able-bodied young males. Prime Minister [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) had mentioned that he had wanted a [conscription](/wiki/Conscription#Drafting_of_women) consisting both men and women, similar to [Israel](/wiki/Conscription_in_Israel). However, Goh rejected it, citing that the labour cost at least in its initial years would be too great for the newly independent nation. During Goh's tenure as Minister for Finance, he declined to allow the [central bank](/wiki/Central_bank) to issue currency, favouring instead a [currency board](/wiki/Board_of_Commissioners_of_Currency,_Singapore) system as this would signal to citizens, academics and the financial world that governments cannot \"spend their way to prosperity\"; the [Monetary Authority of Singapore](/wiki/Monetary_Authority_of_Singapore) (MAS) was later established in 1971. In 1981, Goh also expressed the view that the central bank need not hold large amounts of cash in reserve to defend the currency, proposing that the [Government of Singapore Investment Corporation](/wiki/GIC_(Singaporean_sovereign_wealth_fund)) (GIC) be established to invest excess reserves. At the time, it was unprecedented for a non-[commodity](/wiki/Commodity)-based economy to have such a [sovereign wealth fund](/wiki/Sovereign_wealth_fund). Goh died in 2010 at the age of 91, and he was accorded a [state funeral](/wiki/State_funeral). ## Early life and career Goh was born in [Malacca](/wiki/Malacca) on 6 October 1918, then a part of the [Straits Settlements](/wiki/Straits_Settlements), into a middle class [Peranakan](/wiki/Peranakan) family and the fifth of six children. His father Goh Leng Inn was a manager of a rubber plantation, while his mother Tan Swee Eng, came from the family that produced the Malaysian politicians [Tan Cheng Lock](/wiki/Tan_Cheng_Lock) and his son, [Tan Siew Sin](/wiki/Tan_Siew_Sin), who would later become Goh's lifelong political opponent. Goh was given the [Christian name](/wiki/Given_name#Christian_name) Robert, which he disliked and refused to respond to. When he was two years old, his family moved from Malacca to Singapore where his maternal grandparents owned several properties. The Gohs later relocated to the [Pasir Panjang](/wiki/Pasir_Panjang) rubber estate when his father found work there and became manager in 1933. Like many Peranakan families, the Gohs spoke both English and [Malay](/wiki/Malay_language) at home; church services were held at home on Sundays in Malay. Goh's father Leng Inn and his brothers-in-law Chew Cheng Yong and Goh Hood Keng taught at the [Anglo-Chinese School](/wiki/Anglo-Chinese_School) and were involved in the [Middle Road Baba Church](/wiki/Kampong_Kapor_Methodist_Church), where Hood Keng was pastor. Goh attended the church as well. Goh attended the [Anglo-Chinese School](/wiki/Anglo-Chinese_School) between 1927 and 1936, where he ranked second in his class in the [Senior Cambridge](/wiki/Senior_Cambridge) examinations. He graduated from Raffles College (now the [National University of Singapore](/wiki/National_University_of_Singapore)) in 1939 with a Class II Diploma in Arts, with special distinction in [economics](/wiki/Economics). After graduation, Goh joined the colonial Civil Service as a tax collector with the War Tax Department, though his superiors noted he was not very good at the job and he was nearly dismissed. Shortly after the start of the [Second World War](/wiki/Second_World_War), he joined the [Singapore Volunteer Corps](/wiki/Singapore_Volunteer_Corps), a local militia, but returned to his previous work after the [fall of Singapore](/wiki/Battle_of_Singapore). In 1942, Goh married Alice Woon, a secretary and colleague, and they had one son, Goh Kian Chee, two years later. After the [Japanese occupation](/wiki/Japanese_occupation_of_Singapore) ended, Goh moved his family back to Singapore in 1946 and joined the Department of Social Welfare, becoming a supervisor of its Research Section six months later. Goh earned a scholarship to study at the [London School of Economics](/wiki/London_School_of_Economics). While in London, he met fellow students seeking independence for [British Malaya](/wiki/British_Malaya), including [Abdul Razak](/wiki/Abdul_Razak_Hussein), Maurice Baker, [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) and [Toh Chin Chye](/wiki/Toh_Chin_Chye). He was founding chairman of the [Malayan Forum](/wiki/Malayan_Forum), a student discussion group formed in 1948. Goh graduated in 1951 with a [first class honours](/wiki/British_undergraduate_degree_classification#Degree_classification) in economics and won the [William Farr Prize](/wiki/William_Farr) for the highest marks in [statistics](/wiki/Statistics). Returning to the Department of Social Welfare, he was appointed Assistant Secretary of Research. In 1952, together with fellow civil servant [Kenneth Michael Byrne](/wiki/Kenneth_Michael_Byrne), he formed the Council of Joint Action to oppose salary and promotion policies favouring Europeans over Asians. Byrne later became [Minister for Labour](/wiki/Ministry_of_Manpower_(Singapore)#Ministers) and [Minister for Law](/wiki/Ministry_of_Law_(Singapore)#Ministers). Goh returned to the London School of Economics in 1954 for doctoral studies, supported by a [University of London](/wiki/University_of_London) scholarship. He completed his [PhD](/wiki/PhD) in economics in 1956, and returned to the Department of Social Welfare, serving as assistant director and then Director. In 1958, he became Director of the Social and Economic Research Division in the [Chief Minister's Office](/wiki/Chief_Minister_of_Singapore) before resigning from the civil service in August to work full-time for the [People's Action Party](/wiki/People%27s_Action_Party) (PAP). ## Political career ### Pre-independence Goh was a key member of the PAP's [Central Executive Committee](/wiki/Central_Executive_Committee_(PAP)) (CEC), and serving as vice-chairman. Goh contested in [Kreta Ayer](/wiki/Kreta_Ayer_Single_Member_Constituency) during the [1959 general election](/wiki/1959_Singaporean_general_election) and won. He was subsequently elected into the [Legislative Assembly](/wiki/Legislative_Assembly_of_Singapore) on 30 May 1959, and appointed [Minister for Finance](/wiki/Ministry_of_Finance_(Singapore)) under Prime Minister [Lee Kuan Yew](/wiki/Lee_Kuan_Yew)'s [first Cabinet](/wiki/First_Lee_Kuan_Yew_Cabinet). As Minister for Finance, Goh assumed the stewardship of [Singapore's economy](/wiki/Economy_of_Singapore). As a budget deficit of S$14 million was forecast that year, he introduced stringent fiscal discipline which including cutting civil service salaries. As a result of these measures, he was able to announce at the end of the year when delivering the budget that the government had achieved a surplus of $1 million. Goh initiated the setting up of the [Economic Development Board](/wiki/Economic_Development_Board) (EDB) which was established in August 1961 to attract foreign [multinational corporations](/wiki/Multinational_corporation) to invest in Singapore. The next year, he started the development of the [Jurong](/wiki/Jurong) industrial estate on the western end of the island which was then a swamp, offering incentives to local and foreign businesses to locate there. According to former Permanent Secretary [Sim Kee Boon](/wiki/Sim_Kee_Boon), Goh admitted that the Jurong project was \"an act of faith and he himself jokingly said that this could prove to be Goh's folly\". Nonetheless, Goh also felt strongly that \"the only way to avoid making mistakes is not to do anything. And that... will be the ultimate mistake.\" In the 1960s, there were great pressures from communist agitators working through Chinese-medium schools and trade unions. Divisions existed within the PAP as well, with a pro-communist faction working to wrest control of the party from the moderate wing, of which Goh and Lee Kuan Yew were key members. A key source of division was the issue of merger with Malaya to form a new state of Malaysia. Goh and his fellow moderates believed this was a necessary condition for Singapore's economic development because Malaya was a key economic hinterland; merger would also provide an alternate vision against communism for Singapore's Chinese majority. In July 1961, 16 members of the pro-communist faction broke away from the PAP to form the [Barisan Sosialis](/wiki/Barisan_Sosialis), and [captured control of the main trade unions](/wiki/National_Trades_Union_Congress#History). ### Federation of Malaysia In 1961, the Singapore Government secured approval from Malaysian Prime Minister [Tunku Abdul Rahman](/wiki/Tunku_Abdul_Rahman) for a merger, motivated in part by the Tunku's desire to stabilise the security situation in Singapore and to counter the perceived communist threat by the [Malayan Communist Party](/wiki/Malayan_Communist_Party). In 1963, Singapore joined [Malaya](/wiki/Federation_of_Malaya), along with [Sabah](/wiki/Sabah) and [Sarawak](/wiki/Sarawak), to form the Federation of Malaysia. However, the merger soon proved problematic for Singapore's leaders. Fundamental disagreements emerged over political and economic principles, particularly the issue of [Malay dominance](/wiki/Ketuanan_Melayu). Communal tensions escalated into violence in 1964, incited by both Malay and Chinese activists in Singapore. According to Lee, Goh played a key role in safeguarding Singapore's interests, especially in economic disputes with the [Malaysian Minister of Finance](/wiki/Minister_of_Finance_(Malaysia)) and his own cousin [Tan Siew Sin](/wiki/Tan_Siew_Sin), whom he believed acted in hostility toward Singapore. After two difficult years within the Federation, Lee asked Goh to negotiate with Malaysian Deputy Prime Minister [Tun Abdul Razak](/wiki/Tun_Abdul_Razak) and Minister for External Affairs [Ismail Abdul Rahman](/wiki/Ismail_Abdul_Rahman) in July 1965. The aim was to explore the possibility of a looser arrangement for Singapore within Malaysia. However, following the discussions, all parties concluded that a clean break would be in the best interests of both sides. [Tunku Abdul Rahman](/wiki/Tunku_Abdul_Rahman) ultimately agreed to this course of action, paving the way for Singapore's separation from Malaysia. Goh maintained a secret dossier that he codenamed \"[Albatross](/wiki/Albatross_file)\", which contains files and notes from the months leading up to Singapore's independence. According to one of the file's documents, authored by Goh himself, Goh chose not to follow Lee's orders to negotiate for a \"looser arrangement\" but only ever broached separation with Tunku. Writing in his memoirs, Lee claimed that he only realised that Goh \"never pressed Razak for a looser rearrangement as I had asked him to\" in 1994. ### Post-independence #### Minister for Interior and Defence (1965–1967) Upon the independence of Singapore in 1965, Goh relinquished his portfolio of Minister for Finance and became [Minister for Interior and Defence](/wiki/Ministry_of_Interior_and_Defence#Ministers) in 1967, assuming responsibilities for strengthening Singapore's military and domestic security capabilities. A key policy was the creation of [National Service](/wiki/National_Service_in_Singapore), a mandatory conscription system for able-bodied young males. #### Minister for Finance (1967–1970) Goh served as Minister for Finance again between 1967 and 1970, during which he declined to allow the [central bank](/wiki/Central_bank) to issue currency, favouring instead a [currency board](/wiki/Currency_board) system in the form of the [Board of Commissioners of Currency, Singapore](/wiki/Board_of_Commissioners_of_Currency,_Singapore), as this would signal to citizens, academics and the financial world that governments cannot \"spend their way to prosperity\". #### Minister for Defence (1970–1979) On 11 August 1970, he was reappointed [Minister for Defence](/wiki/Ministry_of_Defence_(Singapore)). #### Deputy Prime Minister (1973–1984) On 1 March 1973, Goh was appointed [Deputy Prime Minister](/wiki/Deputy_Prime_Minister_of_Singapore) concurrently with his other [Cabinet](/wiki/Cabinet_of_Singapore) portfolio. On 12 February 1979, Goh moved on from the Ministry of Defence to the [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)), where his Goh Report greatly influenced the development of Singapore's education system. He was described as both a key political and strategic leader responsible for the transformation of the system over 30 years from \"fair\" to \"great\", according to a November 2010 McKinsey report. He set up the Curriculum Development Institute, and introduced key policies such as religious education—subsequently discontinued and, in 1980, the channelling of students into different programmes of study according to their learning abilities, known as \"streaming\". Goh served two terms as Minister for Education, his first term ended in 1980, and his second following the [1980 general election](/wiki/1980_Singaporean_general_election) from 1981 until his retirement in 1985. From 1 June 1980, he was redesignated First Deputy Prime Minister upon [S. Rajaratnam](/wiki/S._Rajaratnam) being made Second Deputy Prime Minister, and served as Chairman of the [Monetary Authority of Singapore](/wiki/Monetary_Authority_of_Singapore) until he stepped down from [Parliament](/wiki/Parliament_of_Singapore) on 3 December 1984, at the age of 66. In a tribute to mark the occasion, Prime Minister Lee Kuan Yew wrote: \"A whole generation of Singaporeans take their present standard of living for granted because you had laid the foundations of the economy of modern Singapore.\" ### Other contributions #### Government of Singapore Investment Corporation (GIC) In 1981, Goh expressed the view that the central bank need not hold large amounts of cash in reserve to defend the currency, proposing that the [Government of Singapore Investment Corporation](/wiki/Government_of_Singapore_Investment_Corporation) (GIC) be established to invest excess reserves. At the time, it was unprecedented for a non-[commodity](/wiki/Commodity)-based economy to have such a [sovereign wealth fund](/wiki/Sovereign_wealth_fund). The foreign merchant bank, Rothschild, advised on the GIC. #### Defence Science Organisation (DSO) In 1971, Goh put together the Electronic Warfare Study Group, a team of newly graduated engineers who had excelled in their university studies that was headed by [Tay Eng Soon](/wiki/Tay_Eng_Soon), then a university lecturer. The group worked on Project Magpie, a secret project to develop Singapore's defence technology capabilities. In 1977, the group was renamed the Defence Science Organisation (DSO). Originally part of the Ministry of Defence, the organisation became a non-profit corporation called [DSO National Laboratories](/wiki/DSO_National_Laboratories) in 1997. #### Cultural, sports and recreation Goh was also responsible for projects that sought to improve Singaporeans' cultural and leisure life, such as the [Jurong Bird Park](/wiki/Jurong_Bird_Park), [Singapore Zoo](/wiki/Singapore_Zoo) and the [Singapore Symphony Orchestra](/wiki/Singapore_Symphony_Orchestra). He backed the construction of the Kreta Ayer People's Theatre in his [constituency](/wiki/Kreta_Ayer_Single_Member_Constituency) as a venue for [Chinese opera](/wiki/Chinese_opera) performances. In 1968, Goh encouraged the establishment of the Institute of Southeast Asian Studies. Goh was also instrumental in introducing [rugby](/wiki/Rugby_union) in the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces) and later in schools. In recognition of his role in promoting the sport, the Schools \"C\" Division Cup is named after him. Impressed by an [oceanarium](/wiki/Oceanarium) in the [Bahamas](/wiki/Bahamas), he contacted the [Sentosa Development Corporation](/wiki/Sentosa_Development_Corporation) and persuaded them to build an oceanarium in Singapore. [Underwater World](/wiki/Underwater_World,_Singapore) opened in 1991. ## Personal life In 1986, Goh divorced his first wife Alice. In 1991, he married his former Ministry of Education colleague Phua Swee Liang. Goh suffered his first stroke in 1999, and a subsequent one in 2000 which affected the vision in his right eye. According to Goh's daughter-in-law Tan Siok Sun, the medical condition caused him to become withdrawn and introverted. In July 2007, Tan published a biography titled *Goh Keng Swee: A Portrait*. Goh's second wife issued a statement claiming that Goh had not been consulted on the book and had indicated to her that he did not want any book to be written about him. \"Therefore, the publication of this book is contrary to his wishes, and is a show of disregard and utmost disrespect to him.\" In an interview with *[The Straits Times](/wiki/The_Straits_Times)*, Tan said she did not start the dispute between Mrs. Goh and herself, nor did she wish to prolong it. After retirement from politics, Goh continued to be active in public life, serving as Deputy Chairman of [GIC](/wiki/GIC_(Singaporean_sovereign_wealth_fund)) between 1981 and 1994, Economic Adviser to the [State Council of the People's Republic of China](/wiki/State_Council_of_the_People%27s_Republic_of_China) on Coastal Development and Adviser on Tourism in 1985, Deputy Chairman of the [Monetary Authority of Singapore](/wiki/Monetary_Authority_of_Singapore) between 1985 and 1992, Chairman of the Singapore Totalisator Board between 1988 and 1990, Director of Gateway Technologies Services Pte. Ltd. from 1991 onward, Adviser to the [United Overseas Bank Group](/wiki/United_Overseas_Bank) from 1993 onward, Chairman of [N. M. Rothschild & Sons (Singapore) Ltd.](/wiki/N_M_Rothschild_%26_Sons) from 1994 onward, and vice-chairman of [Hong Leong Asia Ltd.](/wiki/Hong_Leong_Group) from 1995 onward. Goh was also chairman of the Board of Governors of the Institute of East Asian Philosophies between 1983 and 1992, which was founded to study [Confucianism](/wiki/Confucianism). The institute later turned its focus on China's political and economic development, renaming itself the Institute of East Asian Political Economy, and Goh continued as Executive Chairman and chairman of the Board of Governors until 1995. In April 1997, the institute was reconstituted as the East Asian Institute, an autonomous research organisation under the auspices of the [National University of Singapore](/wiki/National_University_of_Singapore). ## Death On 14 May 2010, Goh died in the early morning at his home in Dunbar Walk off [East Coast Road](/wiki/East_Coast_Road,_Singapore) in [Siglap](/wiki/Siglap), at the age of 91. His death was as a result of his old age and pneumonia. His body [lay in state](/wiki/Lying_in_state) at [Parliament House](/wiki/Parliament_House,_Singapore) from 20 to 22 May, and there was a [state funeral](/wiki/State_funeral) on 23 May 2010 at the [Singapore Conference Hall](/wiki/Singapore_Conference_Hall) followed by a private ceremony for family members at the [Mandai Crematorium](/wiki/Mandai_Crematorium_and_Columbarium). The latter was conducted by the pastor-in-charge of Barker Road Methodist Church, with a message delivered by the Bishop of the [Methodist Church in Singapore](/wiki/Methodist_Church_in_Singapore), [Robert M. Solomon](/wiki/Robert_M._Solomon). As a mark of respect, State flags at all Government buildings were flown at [half-mast](/wiki/Half-mast) from 20 to 23 May. ## Honours and legacy In 1966, Goh was made an Honorary Fellow of the [London school of Economics](/wiki/London_school_of_Economics). In 1972, he was the recipient of the [Ramon Magsaysay Award](/wiki/Ramon_Magsaysay_Award) for Government Services, which is often regarded as \"Asia's Nobel Prize\". It is awarded to people who have demonstrated integrity in government, courageous service to the people, and pragmatic idealism within a democratic society. That same year, the [Philippine Government](/wiki/Government_of_the_Philippines) conferred upon him the [Order of Sikatuna](/wiki/Order_of_Sikatuna), which is given to diplomats, officials and nationals of foreign states who have rendered conspicuous services in fostering, developing and strengthening relations between their country and the Philippines. Following his retirement from politics, Goh was awarded the [Order of Temasek](/wiki/Darjah_Utama_Temasek) (First Class, now known as High Distinction) in 1985, Singapore's highest civilian honour and second overall after the [Star of Temasek](/wiki/Bintang_Temasek). He was also presented with the LSE's Distinguished Alumnus Award on 21 January 1989, and made the first Distinguished Fellow of the Economic Development Board Society in 1991. Goh is known as one of Singapore's founding fathers. During the [National Day Rally](/wiki/National_Day_Rally) on 29 August 2010, Prime Minister [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) announced that the [Singapore Command and Staff College](/wiki/Singapore_Command_and_Staff_College), where senior officers of the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces) receive training; and a complex to be constructed at the Ministry of Education's North Buona Vista Road headquarters for specialist teacher training academies in English language, physical education, sports and the arts would be respectively named the [Goh Keng Swee Command and Staff College](/wiki/Goh_Keng_Swee_Command_and_Staff_College) and the Goh Keng Swee Centre for Education. ## Publications - *The Economic Front: From a Malayan Point of View*. Singapore: Government Printers. 1940. [OCLC](/wiki/OCLC_(identifier)) 226068826.. - *Urban Incomes & Housing: A Report on the Social Survey of Singapore, 1953–54*. Singapore: [Department of Social Welfare]. 1956. [OCLC](/wiki/OCLC_(identifier)) 504452751.. - *Techniques of National Income Estimation in Under-developed Territories, with Special Reference to Asia and Africa [Unpublished PhD thesis, University of London, London School of Economics, 1956]*. London: University of London Library, Photographic Section. 1978. [OCLC](/wiki/OCLC_(identifier)) 63630985.. - *This is How Your Money is Spent [Budget statement by Goh Keng Swee, Minister for Finance; Towards Socialism, vol. 3]*. Singapore: [Ministry of Finance](/wiki/Ministry_of_Finance_(Singapore)). 1960. [OCLC](/wiki/OCLC_(identifier)) 63838096.. - *Some Problems of Industrialisation [Towards Socialism; vol. 7]*. Singapore: Government Printing Office. 1963. [OCLC](/wiki/OCLC_(identifier)) 17270555.. - *Communism in Non-Communist Asian Countries*. Singapore: Printed by the Government Printing Office for the [Ministry of Culture](/wiki/Ministry_of_Information,_Communications_and_the_Arts). c. 1967. [OCLC](/wiki/OCLC_(identifier)) 433094.. - *The Economics of Modernization and other Essays*. [Singapore]: Asia Pacific Press. 1972. [OCLC](/wiki/OCLC_(identifier)) 534320.. Later editions: - *The Economics of Modernization*. Singapore: Federal Publications. 1995. [ISBN](/wiki/ISBN_(identifier)) 978-981-01-2317-8.. - *The Economics of Modernization*. Singapore: [Marshall Cavendish Academic](/wiki/Marshall_Cavendish). 2004. [ISBN](/wiki/ISBN_(identifier)) 978-981-210-330-7.. - *Some Problems of Manpower Development in Singapore [Occasional publication (Singapore Training and Development Association); no. 1]*. Singapore: Ad Hoc Publications Sub-committee, Singapore Training & Development Association. 1974. [OCLC](/wiki/OCLC_(identifier)) 226024028.. - *Some Unsolved Problems of Economic Growth [Kesatuan lecture; 1]*. Singapore: Kesatuan Akademis Universiti Singapura. 1976. [ISBN](/wiki/ISBN_(identifier)) 9971-68-076-9. [OCLC](/wiki/OCLC_(identifier)) 3072805.. - *The Practice of Economic Growth*. Singapore: Federal Publications. 1977. [OCLC](/wiki/OCLC_(identifier)) 4465760.. Later edition: - *The Practice of Economic Growth*. Singapore: Federal Publications. 1995. [ISBN](/wiki/ISBN_(identifier)) 978-981-01-2322-2.. - Goh, Keng Swee; Education Study Team (1979). *Report on the Ministry of Education 1978*. Singapore: Printed by Singapore National Printers. [OCLC](/wiki/OCLC_(identifier)) 416421063.. - Goh, Keng Swee (1995). Low, Linda (ed.). *Wealth of East Asian Nations: Speeches and Writings*. Singapore: Federal Publications. [ISBN](/wiki/ISBN_(identifier)) 978-981-01-2297-3.. ### Notes ### Citations ### Sources - \"From civil servant to PAP stalwart\". *[The Straits Times](/wiki/The_Straits_Times) (Saturday)*. 15 May 2010. p. D2. - Nur Dianah Suhaimi (16 May 2010). *His work was his passion: The late Goh Keng Swee showed brilliance even when he was a child*. Singapore. p. 10.`{{cite book}}`: CS1 maint: location missing publisher (link) - \"Parliament pays respects\". *The Straits Times*. 18 May 2010. - Tien, Jenny Mui Mun (8 October 2002). \"Dr Goh Keng Swee\". Singapore Infopedia, [National Library, Singapore](/wiki/National_Library,_Singapore). Archived from the original on 23 June 2008. Retrieved 15 May 2010. ### Books - Austin, Ian Patrick (2004). *Goh Keng Swee and Southeast Asian Governance*. Singapore: [Marshall Cavendish Academic](/wiki/Marshall_Cavendish). [ISBN](/wiki/ISBN_(identifier)) 978-981-210-351-2. - Desker, Barry; Kwa, Chong Guan, eds. (2011). *Goh Keng Swee – A Public Career Remembered*. Singapore: [World Scientific](/wiki/World_Scientific). [ISBN](/wiki/ISBN_(identifier)) 978-981-4291-38-5. - Doshi, Tilak; Coclanis, Peter (1999). \"The Economic Architect: Goh Keng Swee\". In Lam, Peng Er; Tan, Kevin (eds.). *Lee's Lieutenants: Singapore's Old Guard*. St. Leonards, N.S.W.: [Allen & Unwin](/wiki/Allen_%26_Unwin). pp. 24–44. [ISBN](/wiki/ISBN_(identifier)) 978-1-86448-639-1. - Kuah, Adrian (2007). *UnChartered territory: Dr Goh Keng Swee and the ST Engineering Story*. Singapore: Published for [ST Engineering](/wiki/ST_Engineering) by SNP International. [ISBN](/wiki/ISBN_(identifier)) 978-981-248-169-6. - Kwok, Kian-Woon (1999). \"The Social Architect: Goh Keng Swee\". In Lam, Peng Er; Tan, Kevin (eds.). *Lee's Lieutenants: Singapore's Old Guard*. St. Leonards, N.S.W.: Allen & Unwin. pp. 45–69. [ISBN](/wiki/ISBN_(identifier)) 978-1-86448-639-1. - Nair, E. Shailaja (2008). *The Master Sculptor: Goh Keng Swee [Great Singapore Stories. Founding Fathers.]* Singapore: SNP Editions. [ISBN](/wiki/ISBN_(identifier)) 978-981-248-160-3. - Ngiam, Tong Dow (2006). *A Mandarin and the Making of Public Policy: Reflections by Ngiam Tong Dow*. Singapore: [NUS Press](/wiki/National_University_of_Singapore). [ISBN](/wiki/ISBN_(identifier)) 978-9971-69-350-3. - Ooi, Kee Beng (2010). *In Lieu of Ideology: The Intellectual Biography of Goh Keng Swee*. Singapore: Institute of Southeast Asian Studies. [ISBN](/wiki/ISBN_(identifier)) 978-981-4311-30-4. - Tan, Siok Sun (2007). *Goh Keng Swee: A Portrait*. Singapore: [Editions Didier Millet](/wiki/Editions_Didier_Millet). [ISBN](/wiki/ISBN_(identifier)) 978-981-4155-82-3.. - Yeo, Siew Siang (1990). *Tan Cheng Lock, the Straits Legislator and Chinese Leader*. Petaling Jaya, Selangor: Pelanduk Publications. [ISBN](/wiki/ISBN_(identifier)) 978-967-978-236-3. ### Eulogies at the state funeral - [Lee, Hsien Loong](/wiki/Lee_Hsien_Loong) (24 May 2010). \"Without him, much of S'pore wouldn't exist: Eulogy by Prime Minister Lee Hsien Loong\". *[The Straits Times](/wiki/The_Straits_Times)*. pp. A4 & A6.; Lee, Hsien Loong (24 May 2010). \"A giant in our midst [eulogy by the Prime Minister]\". *[Today](/wiki/Today_(Singapore_newspaper))*. pp. 12–14. Archived from the original on 25 May 2010. See also \"'He turned the tide for Singapore': PM Lee recounts Dr Goh's contributions and compassion\". *Today*. 24 May 2010. p. 4. Archived from the original on 26 May 2010. - [Lee, Kuan Yew](/wiki/Lee_Kuan_Yew) (24 May 2010). \"He made the greatest difference: Eulogy by Minister Mentor Lee Kuan Yew\". *The Straits Times*. p. A6.. See also \"As my troubleshooter, I gave him toughest jobs in Govt: MM\". *Today*. 24 May 2010. p. 3. Archived from the original on 26 May 2010. - [S. Dhanabalan](/wiki/Suppiah_Dhanabalan) (24 May 2010). \"Singapore's greatest entrepreneur: Eulogy by S. Dhanabalan, chairman of Temasek Holdings\". *The Straits Times*. p. A8.. See also \"Dhanabalan: How Dr Goh changed my life\". *Today*. 24 May 2010. p. 4. Archived from the original on 26 May 2010. - Goh, Ken-Yi (24 May 2010). \"A caring, selfless grandfather: Eulogy by grandson Goh Ken-Yi\". *The Straits Times*. p. A10.. See also Zul Othman (24 May 2010). \"To me, he was simply a great grandfather\". *Today*. p. 2. Archived from the original on 26 May 2010. - Hui, Marian (24 May 2010). \"He motivated me to pursue my dreams: Excerpt of eulogy by Grand-niece Marian Hui\". *The Straits Times*. p. A8. ### Letters of condolence - Lee, Hsien Loong (15–16 May 2010). \"A far-sighted visionary and pragmatic manager [letter from the Prime Minister to Mrs. Goh Keng Swee]\". *[Weekend Today](/wiki/Today_(Singapore_newspaper))*. p. 10. Archived from the original on 16 May 2010. - [S.R. Nathan](/wiki/Sellapan_Ramanathan) (15–16 May 2010). \"Nothing too insignificant for his attention [letter from the president to Mrs. Goh Keng Swee]\". *Weekend Today*. p. 10. Archived from the original on 16 May 2010. - [Goh, Chok Tong](/wiki/Goh_Chok_Tong) (15–16 May 2010). \"Practical and full of ideas [letter from the Senior Minister to Mrs. Goh Keng Swee]\". *Weekend Today*. p. 11. Archived from the original on 22 June 2011. - [Tan, Tony Keng Yam](/wiki/Tony_Tan_Keng_Yam) (15–16 May 2010). \"Farsightedness and fortitude [letter from the Deputy Chairman and Executive Director of the Government Investment Corporation of Singapore to Mrs. Goh Keng Swee]\". *Weekend Today*. p. 11. Archived from the original on 16 May 2010. ### News reports - Chang, Rachel; Cai, Haoxiang; Kor, Kian Beng (15 May 2010). \"Ex-MPs recall a fearsome technocrat: A strict taskmaster who didn't suffer fools, but he was never brusque\". *[The Straits Times](/wiki/The_Straits_Times)*. p. A8. - \"Leaders salute 'this marvellous man'\". *The Straits Times*. 15 May 2010. p. A4. - S. Ramesh (15–16 May 2010). \"A national hero who touched people's lives\". *Weekend Today*. p. 2. Archived from the original on 18 May 2010. - \"Goh Keng Swee: Passing of a colossus [editorial]\". *The Straits Times*. 22 May 2010. p. A32. - Balji, P.N. (22–23 May 2010). \"Dr Goh, the Dream No 2\". *Weekend Today*. p. 11. Archived from the original on 30 May 2010. - Devan, Janadas (23 May 2010). \"Simply sincere: Dr Goh's simple yet eloquent writing style showed desire to reach out to ordinary people\". *The Sunday Times*. Singapore. p. 35. Library resources about **Goh Keng Swee** - Resources in your library - Resources in other libraries **By Goh Keng Swee** - Resources in your library - Resources in other libraries - Channel NewsAsia – Obituary: Goh Keng Swee 1918–2010 at the [Wayback Machine](/wiki/Wayback_Machine) (archived 1 April 2013), archived from the original on 1 April 2013 - National Library Singapore – NLS Resource guide on Dr. Goh Keng Swee Political officesPreceded byNew post **[Minister for Finance](/wiki/Minister_for_Finance_(Singapore))** 1959–65Succeeded by[Lim Kim San](/wiki/Lim_Kim_San)Preceded byNew post **[Minister for Defence](/wiki/Minister_for_Defence_(Singapore))** 1965–67Succeeded by[Lim Kim San](/wiki/Lim_Kim_San)Preceded by[Lim Kim San](/wiki/Lim_Kim_San) **[Minister for Finance](/wiki/Minister_for_Finance_(Singapore))** 1967–70Succeeded by[Hon Sui Sen](/wiki/Hon_Sui_Sen)Preceded by[Lim Kim San](/wiki/Lim_Kim_San) **[Minister for Finance](/wiki/Minister_for_Defence_(Singapore))** 1970–79Succeeded by[Howe Yoon Chong](/wiki/Howe_Yoon_Chong)Preceded by[Chua Sian Chin](/wiki/Chua_Sian_Chin) **[Minister for Education](/wiki/Minister_for_Education_(Singapore))** 1979–80Succeeded by[Tony Tan Keng Yam](/wiki/Tony_Tan_Keng_Yam)Preceded by[Tony Tan Keng Yam](/wiki/Tony_Tan_Keng_Yam) **[Minister for Education](/wiki/Minister_for_Education_(Singapore))** 1981–85Succeeded by[Tony Tan Keng Yam](/wiki/Tony_Tan_Keng_Yam)Preceded by[Toh Chin Chye](/wiki/Toh_Chin_Chye) **[Deputy Prime Minister of Singapore](/wiki/Deputy_Prime_Minister_of_Singapore)** 1973–85Succeeded by[Goh Chok Tong](/wiki/Goh_Chok_Tong)[Parliament of Singapore](/wiki/Parliament_of_Singapore)**New constituency** **[Member of Parliament](/wiki/List_of_Singapore_MPs) for [Kreta Ayer](/wiki/Kreta_Ayer)** 1959–84Succeeded by[Richard Hu Tsu Tau](/wiki/Richard_Hu_Tsu_Tau)Military offices**New title** **1st [Director, General Staff of Defence Force](/wiki/Chief_of_Defence_Force_(Singapore))** 1965-1967Succeeded by[T. J. D. Campbell](/wiki/T._J._D._Campbell)Portals: - Politics - Biography - Economics - Singapore\n",
  "language": "en",
  "processed_at": "2026-01-12T11:07:05.714130",
  "title": "Goh Keng Swee",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Goh_Keng_Swee"
}