{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:07:07.389873"
  },
  "content": "Singaporean dancer and choreographer (born 1939) **Goh Lay Kuan** ([Chinese](/wiki/Simplified_Chinese_characters): 吴丽娟; born 1939) is an [Indonesian-born](/wiki/Overseas_Indonesian) [Singaporean](/wiki/Singaporeans) dancer, choreographer, educator, and pioneer of [dance in Singapore](/wiki/Dance_in_Singapore). Together with her husband, [Kuo Pao Kun](/wiki/Kuo_Pao_Kun), she co-founded the Singapore Performing Arts School (now The Theatre Practice), a seminal institution in Singaporean modern theater and dance. During the mid-1970s, both Goh and her husband were branded as enemies of the state and detained in mass arrests of alleged communist sympathizers. The 1980s and 90s, however, saw Goh rise in prominence. In 1988 she created *Nu Wa – Mender of the Heavens*, Singapore's first modern dance production, and in 1995 she was awarded the [Cultural Medallion](/wiki/Cultural_Medallion), Singapore's highest award for artistic excellence. ## Early life Goh Lay Kuan was born in [Sumatra](/wiki/Sumatra), Indonesia, in 1939. Her parents were both teachers and had both learned music. Goh was one of six children, with four brothers and a sister. When she was still an infant, the family moved to [Sungai Petani](/wiki/Sungai_Petani), [British Malaya](/wiki/British_Malaya) (now [Malaysia](/wiki/Malaysia)), where Goh's father worked as the principal of a school. Two years later the family moved to [Malacca](/wiki/Malacca) to escape the [Japanese invasion of Malaya](/wiki/Japanese_invasion_of_Malaya). In 1945, when she was five years old, her father – then a resistance fighter – was killed by Japanese forces. Goh's mother remarried, again to a teacher, and took a teaching position in Singapore, bringing the family with her. ## Career At the age of 15, Goh began learning [ballet dance](/wiki/Ballet_dance) from Goh Soo Nee, the sister of ballet dancers [Goh Choo San](/wiki/Goh_Choo_San) and [Goh Soo Khim](/wiki/Goh_Soo_Khim). In a 2014 interview, Goh recalled that she was the last remaining student from an initial class of fifteen, and that she \"went hungry\" in order to afford the classes. After graduating high school, Goh worked as a teacher and tutor before moving to Australia to continue her ballet education at [Melbourne](/wiki/Melbourne)'s Victoria Ballet Guild. She graduated from the program with honors, and went on to be member of several groups including the [Ballet Victoria](/wiki/Dance_in_Australia#Defunct_companies), where she was the [principal dancer](/wiki/Principal_dancer). In 1964, Goh moved back to Singapore. Her motivations to return included racial discrimination, a sense that her people did not have a cultural identity to call their own, and the 1963 openings of the [Singapore National Theatre](/wiki/Singapore_National_Theatre) and an arts-focused television station. Upon her return, she worked as a [choreographer](/wiki/Choreography) on that television station. The station was ill prepared in the beginning, and Singaporean performing arts in general was poorly organized at the time. In 1965, playwright [Kuo Pao Kun](/wiki/Kuo_Pao_Kun), whom Goh had met and began dating in Australia, also moved back to Singapore. Goh and Kuo were married that year, and on the day of their wedding the couple founded the Singapore Performing Arts School (renamed the Practice Theatre School in 1973, the Practice Performing Arts School in 1984, and The Theatre Practice in 1997); Goh was the principal dance instructor, while Kuo taught drama. Goh's vision for the school was to be able to train enough professional dancers to form a company. Goh began to choreograph dances for the students, and her first work of ballet choreography was completed the same year that the school was founded. Practice Performing Arts School, which was founded right before Singapore became independent, received no financial support from the government. Goh and Kuo also refused to allow their families to fund the institution. At the time, people looking to learn drama relied on cultural groups, so there was not a tradition of paid instruction in drama. With all of these avenues of funding closed, the school was self funded and was in debt for its first seventeen years. As a result, Goh and Kuo, in addition to teaching and creating works to perform, also handled costumes and stage design themselves. Shortly after founding the school, the couple had their first daughter, Kuo Jian Hong, who was born in 1967. A second daughter, Kuo Jing Hong, was born in 1971. Goh and Kuo's willingness to poke fun at the government and to raise social and class issues in their performances led to frequent conflicts with the Singaporean government, which made it difficult for Goh to obtain permits for the school and banned some of Goh and Kuo's performances. The school had a \"Go Into Life\" campaign, which urged artists to spend time working alongside farmers and laborers in order to experience their lives. In 1969, Goh created a ballet titled *The Fishing Village* which focused on the lives of ordinary people in a fishing village. Another performance, created by Kuo and titled \"gai si de cang ying\" (\"damn the fly\"), was about reactions to a fly at a fruit stall and was inspired by the reactions of a TV station to a fly appearing in a speech by Prime Minister [Lee Kuan Yew](/wiki/Lee_Kuan_Yew). Aggravating matters, the Communist [People's Republic of China](/wiki/People%27s_Republic_of_China) had begun using ballet as a vehicle for promoting communist ideology. By the 1970s, the governing party of Singapore began to view socially conscious theater as a threat to the state. In 1975 the government, under the authority of the [Internal Security Act](/wiki/Internal_Security_Act_(Singapore)), began a campaign of mass arrests of suspected communists and communist-sympathizers, and in 1976 both Goh and Kuo were arrested and held without trial. Goh was branded \"The Red Ballerina\" and was forced to give a televised confession; shortly after the confession Goh was released, however Kuo spent over four years in prison. While Goh ran the school during Kuo's incarceration, his release in 1980 brought new life to the institution; both Goh and Kuo began creating new works, and the school began putting on more performances. During this time she extended her repertoire, studying traditional Indian, Indonesian, and Chinese dance as well as modern dance, the latter at the [Martha Graham School of Contemporary Dance](/wiki/Martha_Graham_Center_of_Contemporary_Dance) in [New York City](/wiki/New_York_City). In 1988 Goh was commissioned to produce a work for the [Singapore Festival of Arts](/wiki/Singapore_Festival_of_Arts). That work, which was influenced by Chinese mythology, became *Nu Wa – Mender of the Heavens*, Singapore's first full-length modern dance production. *[The Straits Times](/wiki/The_Straits_Times)* called *Nu Wa* the nation's \"most significant modern dance ever produced\". In 1988 Goh also launched a program at the school aimed at young children between the ages of 3 and 6. She retired from leading the school four years later, in 1992, in order to focus on producing new works. These works included *Sheng Ji* (\"*Rites of Life*\") and *Yu Gui* (\"*Homing*\"), which were first performed in 1994 by the [Guangdong Modern Dance Company](/wiki/Guangdong_Modern_Dance_Company). After Kuo Pao Kun's death in 2002, their daughter Kuo Jian Hong returned to assume a leadership role at the school. Goh's most recent work is *Returning*, a 50-minute work which incorporates elements of Chinese, Malay, and Indian dance. The piece is a collaboration involving five choreographers and six musical composers. ## Honors In 1995 Goh was awarded the [Cultural Medallion](/wiki/Cultural_Medallion), Singapore's highest award for artistic excellence. In 2014, she was inducted into the Singapore Council of Women's Organisations' [Singapore Women's Hall of Fame](/wiki/Singapore_Women%27s_Hall_of_Fame). In 2010, [Ong Keng Sen](/wiki/Ong_Keng_Sen), who studied under Goh, created a documentary performance about Goh entitled *The Red Ballerina*. Ong worked with [Lim Kay Tong](/wiki/Lim_Kay_Tong) and Karen Tan on the production. Ong would go on to create another work about Goh, *Goh Lay Kuan & Kuo Pao Kun*, in 2012. ## Selected works - *The Fishing Village* (1969) - *Nu Wa – Mender of the Heavens* (1988) - *Rites of Life* (1994) - *Homing* (1994) - *Returning* (2015) - Interview with Goh Lay Kuan\n",
  "language": "en",
  "processed_at": "2026-01-12T11:07:07.389380",
  "title": "Goh Lay Kuan",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Goh_Lay_Kuan"
}