{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:07:09.428744"
  },
  "content": "Singaporean palm oil company **Golden-Agri Resources** (GAR) is a Singaporean [palm oil](/wiki/Palm_oil) company, listed on the [Singapore Stock Exchange](/wiki/Singapore_Stock_Exchange) since 1999. In May 2015, its market capitalization was $4.1 billion. Franky Widjaja, of the [Sinar Mas](/wiki/Sinar_Mas) family is its CEO. Alnoor is a subsidiary of GAR. [Lew Syn Pau](/wiki/Lew_Syn_Pau) used to serve as a member of the Singaporean Parliament for 13 years and is a member of the board of directors of the firm. ## Criticism of environmental record According to [Greenpeace](/wiki/Greenpeace), GAR has six concessions on peatlands in [Riau](/wiki/Riau), with an estimated total area of 20,000 hectares. GAR was reported to have 1,880 hectares of peat in [Central Kalimantan](/wiki/Central_Kalimantan) and 1,330 hectares in [West Kalimantan](/wiki/West_Kalimantan), while claiming a zero-deforestation footprint. Greenpeace also discovered 322 hotspots on five to GAR's concessions in Central Kalimantan. GAR denied these accusations and said to have a zero-burning policy since 1997. Interviews with senior officers revealed evidence to the contrary. In about 2010, companies such as [Burger King](/wiki/Burger_King), [Unilever](/wiki/Unilever) and [Nestlé](/wiki/Nestl%C3%A9) cancelled their supplier contracts with Singapore-listed GAR subsidiaries due to unsustainable farming practices. Golden owns a subsidiary in [Liberia](/wiki/Liberia) called Golden Veroleum, which in 2018 was removed from the [Roundtable on Sustainable Palm Oil](/wiki/Roundtable_on_Sustainable_Palm_Oil) for alleged land acquisition violations. - Official Website This [Singaporean corporation or company](/wiki/List_of_companies_of_Singapore) article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:07:09.428291",
  "title": "Golden Agri-Resources",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Golden_Agri-Resources"
}