{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:07:11.344257"
  },
  "content": "Mansion in Mount Faber, Singapore The **Golden Bell Mansion** is a historic mansion on [Mount Faber](/wiki/Mount_Faber) in Singapore. Initially owned by prominent philanthropist [Tan Boo Liat](/wiki/Tan_Boo_Liat), it is currently occupied by the [Danish Seamen's Church](/wiki/Danish_Seamen%27s_Church_and_Church_Abroad). ## Description The mansion's façade was designed in the [Edwardian style](/wiki/Edwardian_architecture). The building has several features of [neoclassical architecture](/wiki/Neoclassical_architecture), including columns of the [doric order](/wiki/Doric_order), ornate arches and Greek-styled [friezes](/wiki/Frieze). The external walls were built with red brick accompanied with white plaster trimmings. The mansion features high ceilings and tall louvred windows. The mansion is located on Pender Road on [Mount Faber](/wiki/Mount_Faber). When the building was first completed, it had an entrance hall on the first floor, with a billiard room on the left and a smoking room on the right. A circular tower rises above the billiard room. The tower's roof was designed to resemble a Siamese [Stupa](/wiki/Stupa). It also featured a rear hall, which was connected to the dining room and the guest room. The kitchen was linked to the servants' quarters via a verandah at the back. A straight staircase at the rear hall led to the second floor, which featured four bedroom and a ladies' private room connected to the two bedrooms at the front, as well as a balcony above the mansion's portico. Both of the bedrooms at the back were connected to a bathroom. The straight staircase was later replaced by a circular one in the billiards room. The grounds of the estate were over 171,000 sqft large and contained several landscaped gardens, two tennis courts and two garages. ## History Designed by local architect Wee Teck Moh, the building was completed in 1910 by philanthropist [Tan Boo Liat](/wiki/Tan_Boo_Liat). The building was one of several properties owned by Tan, who primarily lived in the Siam House, which stood at the corner of [Coleman Street](/wiki/Coleman_Street) and [North Bridge Road](/wiki/North_Bridge_Road). The Golden Bell Mansion was used primarily for entertainment. When [Sun Yat Sen](/wiki/Sun_Yat_Sen) arrived in October 1911, he was not taken to the [Wan Qing Yuan](/wiki/Sun_Yat_Sen_Nanyang_Memorial_Hall), which was where he usually resided while in Singapore, as it was rumoured that there was a plot to assassinate him. He was instead escorted to the Golden Bell Mansion, where he was provided with special police protection by the local British government. On 11 October, while he was at the mansion, he informed his supporters in Singapore of his plans to return to China to establish the [Republic of China](/wiki/Republic_of_China_(1912%E2%80%931949)). The mansion also hosted [Chakrabongse](/wiki/Chakrabongse), Prince of [Bishnulok](/wiki/Phitsanulok_province), while he visited Singapore. He died of [pneumonia](/wiki/Pneumonia) at the building in June 1920. In 1916, Tan sold the mansion to sugar merchant Ong Chin Hin. It was sold to the Methodist Episcopal Building and Location Board for $60,000 in 1920. The board's plans for a college to be established at the property never materialised as the plans did not receive the support of the local government. On 26 April 1924, the board leased the mansion to doctors Malcolm Dannatt and Vincent Boland, who established a short-lived private hospital at the building. The [Singapore Harbour Board](/wiki/Singapore_Harbour_Board) bought the building from the board for $140,795 in 1938. The grounds of the estate was reduced to 28,000 sqft in 1971. The property was leased to the [Danish Seamen's Church](/wiki/Danish_Seamen%27s_Church_and_Church_Abroad) by the [Singapore Land Authority](/wiki/Singapore_Land_Authority) in 1985. Allegedly, the building was found by two Danish women living in Singapore, who brought it to the attention of the church which was in need of a premises at the time. Fundraisers were held by the church for the mansion's renovation and restoration. The church's 25th anniversary ceremony, which was held on 26 April 2010, was attended by [Frederik X](/wiki/Frederik_X), then the [Crown Prince of Denmark](/wiki/Crown_Prince_of_Denmark). The mansion's 100th anniversary ceremony was held in July of the following year. Guest-of-honour [Sam Tan](/wiki/Sam_Tan_(politician)), then the mayor of the [Central Singapore Community Development Council](/wiki/Central_Singapore_Community_Development_Council), unveiled a plaque at the ceremony. 1°16′24″N 103°48′54″E﻿ / ﻿1.27329°N 103.81493°E﻿ / 1.27329; 103.81493\n",
  "language": "en",
  "processed_at": "2026-01-12T11:07:11.343722",
  "title": "Golden Bell Mansion",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Golden_Bell_Mansion"
}