{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:07:21.521568"
  },
  "content": "Hotel in Singapore 1°18′29.7″N 103°50′02″E﻿ / ﻿1.308250°N 103.83389°E﻿ / 1.308250; 103.83389 The **Goodwood Park Hotel** ([Chinese](/wiki/Simplified_Chinese): 良木园酒店) is a heritage hotel in Singapore, situated in a 6-hectare landscaped garden on [Scotts Road](/wiki/Scotts_Road). It was first built as the club house for the Teutonic Club serving the expatriate German community in Singapore, and later converted into a hotel. The hotel was the first in Singapore to have a [swimming-pool](/wiki/Swimming-pool) on the premises, and an air-conditioned wine cellar. The Tower Block of the hotel has been gazetted as a [national monument of Singapore](/wiki/National_Monuments_of_Singapore). ## Architecture The Goodwood Park Hotel building was built in 1900 to the design of [R. A. J. Bidwell](/wiki/R._A._J._Bidwell), of [Swan and Maclaren](/wiki/Swan_and_Maclaren). Its architecture has an eclectic [Victorian](/wiki/Victorian_architecture) flavour, with its [turrets](/wiki/Turret_(architecture)) and decorated façade. The Tower Block has elements of the [Queen Anne Revival](/wiki/New_World_Queen_Anne_Revival_architecture) style, and the tower itself may have been influenced by those found on castles in Germany's [Rhineland](/wiki/Rhineland) region. The building was constructed for the sum of St$20,000. ## History - Singapore portal - Architecture portal The Teutonia Club was an exclusive enclave first established on 28 June 1856 for the expatriate German community in Singapore. The club was housed in a couple of different locations until it purchased a piece of land on [Scotts Road](/wiki/Scotts_Road) in 1861 to build a club house. Additional plot of land adjacent to the site was later purchased to enlarge the compound and construct a new building for the club. Construction of the new clubhouse began in 1899. On 21 September 1900, the new clubhouse opened as the Deutsches Haus (German House) with a [ball](/wiki/Ball_(dance)) attended by about 500 guests, including James Alexander Swettenham, then Acting Governor of the Straits Settlements. However, when [World War I](/wiki/World_War_I) broke out, the [British government](/wiki/British_government) in Singapore classified all [Germans](/wiki/Germany) as enemy forces. Most of the Germans in Singapore either fled or were shipped to Australia, and the Teutonia Club seized by the [Custodian of Enemy Property](/wiki/Custodian_of_Enemy_Property). In 1918, the building was auctioned off by the Custodian of Enemy Property to three Jewish brothers – Morris, [Ezekiel](/wiki/Ezekiel_Saleh_Manasseh) and Ellis Manasseh, who also bought five other houses behind it. The entire estate was renamed Goodwood Hall, after the famous [Goodwood Racecourse](/wiki/Goodwood_Racecourse) in England. A bar was added, as well as a restaurant and café, and it was registered in 1922 as a restaurant-café-entertainment establishment, It served as a venues for social gatherings and entertainment, hosting for example a performance by the ballerina [Anna Pavlova](/wiki/Anna_Pavlova). It also host sports amenities. In April 1929, the building was turned into a hotel named the Goodwood Park Hotel, with rooms added to the Tower Wing and the houses at the rear used as suites. During [World War II](/wiki/World_War_II), the Goodwood Park Hotel was used as a residence for high-ranking officers of the [Japanese Imperial Army](/wiki/Imperial_Japanese_Army). After the war, the Singapore War Crimes Court conducted [war crimes](/wiki/War_crime) trials in a tent on the grounds of Goodwood Park. Ezekiel Manasseh died during the war as a prisoner of the Japanese, and the hotel was returned to Ezekiel's [stepson](/wiki/Stepson), Vivian Bath, after the war in 1947. Bath spent about $2.5 million in revamping the hotel, adding for example the first swimming pool in a hotel in Singapore. The renovations were completed in 1963, and Bath sold the hotel to the [Malayan Banking Group](/wiki/Maybank) the same year. The new owner had intended to demolish the old building and build a new hotel, shopping mall, and high rise apartments, but the plan was shelved after it was met with criticisms. The Tower Wing was again extensively renovated in 1978, and its original roof replaced. The hotel was also extended to include more guest rooms, with 17 suites were added on the first floor, including the [Brunei](/wiki/Brunei) Suite. On 23 September 1989, the Tower Block of the Goodwood Park Hotel was [gazetted](/wiki/Gazette) as a [national monument](/wiki/National_Monuments_of_Singapore). In late 2005, the hotel lobby was renovated to give it a modern look. In June 2013, Goodwood Park Hotel launched a renovated Mayfair Wing and rooms, refurbished at an estimated cost of SGD$2million. The Mayfair Wing has 77 rooms and suites over three floors, and a Balinese-inspired Mayfair Pool. The interior was designed by Ernesto Bedmar of Bedmar & Shi who was also responsible for the hotel's past renovation and upgrading projects since the nineties. ## Facilities Goodwood Park Hotel has 233 rooms and suites which are divided into four wings – Lobby, Mayfair, Tower and Parklane. The hotel has two outdoor swimming pools (Main and Mayfair). ## Food and beverage outlets Goodwood Park Hotel offers guests five restaurants, including the [one-Michelin-starred](/wiki/Michelin_Guide) Alma by Juan Amador restaurant. - Preservation of Monuments Board, *Know Our Monuments* - Norman Edwards, Peter Keys (1996), *Singapore – A Guide to Buildings, Streets, Places*, Times Books International, [ISBN](/wiki/ISBN_(identifier)) 9971-65-231-5 - Goodwood Park Hotel Singapore - Worldhotels - Geographic data related to Goodwood Park Hotel at [OpenStreetMap](/wiki/OpenStreetMap)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:07:21.520949",
  "title": "Goodwood Park Hotel",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Goodwood_Park_Hotel"
}