{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:07:19.437214"
  },
  "content": "Value added tax in Singapore **Goods and Services Tax** (**GST**) in [Singapore](/wiki/Singapore) is 9% levied on local sales, import of goods, as well as most supplies of goods and services. Exemptions are given for the sales and leases of residential properties, importation and local supply of investment precious metals and most financial services. Export of goods and international services are zero-rated. GST is also absorbed by the government for public healthcare services, such as at public hospitals and polyclinics. ## Background Prior to 1986, Singapore's corporate income tax rate and top marginal personal income tax rate both stood at 40%. Such high rates were deemed to be uncompetitive. On the recommendation of the 1986 Economic Committee, the [Singapore Government](/wiki/Government_of_Singapore) decided that it needed to shift from direct to indirect taxes, to maintain its international competitiveness in attracting investments, and to sustain its economic growth to create well-paying jobs for Singaporeans. ## Implementation GST was implemented at a single rate of 3% on 1 April 1994, with an assurance that it would not be raised for at least five years. To cushion the impact of GST on Singaporean households, an offset package was also introduced. Simultaneously, corporate tax rate was cut by 3% to 27%, and the top marginal personal income tax rate was cut by 3% to 30%. The initial GST rate of 3% was among the lowest in the world, as the focus was not to generate substantial revenue, but to allow people to get adjusted to the tax. In 2002, the Economic Review Committee reviewed Singapore's tax policy, and recommended that further [tax reform](/wiki/Tax_reform) was necessary to bring in new investments. The committee noted that other countries were aggressively cutting their direct tax rates to attract internationally mobile capital and labour, and recommended that the government rely more on GST for its tax revenues, while again cushioning the impact on Singaporean households through an offset package. The government accepted the committee's recommendations. The GST rate was increased from 3% to 4% on 1 January 2003, and to 5% on 1 January 2004. Each increase was accompanied by an offset package that was designed to make the average Singaporean household overall better off, even after accounting for the additional costs imposed by the increase in GST rates. Direct tax rates were also reduced correspondingly. ### GST increase to 7% On 15 February 2007 (Budget Day), then Second Minister for Finance [Tharman Shanmugaratnam](/wiki/Tharman_Shanmugaratnam) announced that the GST rate would be increased to 7% with effect from 1 July 2007. The rate increase was accompanied by an offset package to help Singaporeans with the increase in GST. The package would cost the government $4 billion over five years. The government argued that the offset package would help the majority of Singaporeans offset their increased GST costs for several years. The offset package consisted of direct transfer benefits, in the form of cash payouts (GST credits, growth dividends, senior citizens' bonuses), CPF top-ups (post-secondary education account top-ups for students, Medisave top-ups for older Singaporeans), and rebates (on utilities and public housing service & conservancy charges). Those who earned less or lived in smaller homes received more benefits. The government also argued that the Workfare Income Supplement, a wage subsidy, would provide significant support for lower-income workers on a continuing basis even after the GST offsets have been distributed. The government also cut direct tax rates, continuing its practice of lowering direct tax rates since 1986. As of 2010, the top marginal rates for corporate tax stood at 17% and personal income tax at 20%, with effective rates being much lower. As a gesture of goodwill, and to assist lower-income groups, several supermarket chains absorbed the 2% increase in GST, ranging for a period of one month to six months. They included Cold Storage, Giant Hypermarket, [NTUC FairPrice](/wiki/NTUC_FairPrice) and Sheng Siong. Besides FairPrice, NTUC also absorbed the 2% increase on NTUC Foodfare, NTUC Childcare, NTUC LearningHub, NTUC Club and NTUC Healthcare, for six months. ### GST on digital services On 19 February 2018 (Budget Day), Minister for Finance [Heng Swee Keat](/wiki/Heng_Swee_Keat) announced that GST will be imposed on imported digital services, which took effect on 1 January 2020. The change ensures that local and overseas services are fairly treated in the tax system. ### Committee Against GST Profiteering (CAP) The Committee Against GST Profiteering (CAP) was set up in 1994 to investigate complaints and feedback on profiteering or unjustified price increases using GST increases as an excuse. ### Increase to 9% In 2018, GST was planned to be increased from 7% to 9% sometime between 2021 and 2025. The primary justification for the rise was to accrue funds for future infrastructure projects and renovation of the existing infrastructure. Increased [social spending](/wiki/Social_spending) to help cope with an increasingly [ageing population](/wiki/Ageing_population) has also been given as a secondary reason. In view of uncertainty due to the [COVID-19 pandemic](/wiki/COVID-19_pandemic_in_Singapore), the GST increase was deferred to after year 2022, with a S$6 billion Assurance Package proposed in 2020 to cushion the impact when the hike kicks in. In 2022, the GST increase was announced to take place in two stages, to 8% on 1 January 2023 and 9% on 1 January 2024. The government also added S$640 million to the S$6 billion Assurance Package to help cushion the impact. The Government increased the Assurance Package by $1.4 billion due to inflation, bringing the total to $8.040 billion. ### GST on imported low-value goods On 16 February 2021 (Budget Day), Minister for Finance [Heng Swee Keat](/wiki/Heng_Swee_Keat) announced that GST will be imposed on imported low-value goods brought in via air and sea transport, which took effect on 1 January 2023, ensuring that local and overseas providers are treated fairly. ## Reception ### Tax progressivity As of 2018, 174 of the [193 countries](/wiki/Member_states_of_the_United_Nations) with full UN membership employ a GST/VAT, including all OECD members except the United States.[a] As with all other countries that has GST/VAT in place, [critics](/wiki/Value-added_tax#Criticisms) consider the idea to be a [regressive tax](/wiki/Regressive_tax), meaning the poor pay more, as a percentage of their income, than the rich. However, defenders contend that GST can be considered a [proportional tax](/wiki/Proportional_tax) if tax payments are expressed as a percentage not of income, but of lifetime consumption; savings and investments are tax-deferred, and when converted to consumption are subjected to GST. Others point out that the more important question to ask is not whether GST is regressive, but whether GST is more regressive than the alternative indirect taxes, namely, sales, excise and [turnover tax](/wiki/Turnover_tax) (not income tax because that is a direct tax). In addition, they argue that what affects poverty and fairness is not the impact of any particular tax, but the impact of the tax structure as a whole, and how tax revenues are redistributed. When GST is combined with [progressive taxes](/wiki/Progressive_tax), and the revenues distributed to the poor, the total fiscal structure can be progressive. To maintain the progressive nature of total taxes and transfers on individuals, Singapore reduced income tax on lower-income earners, as well as instituted direct transfer payments to lower-income groups, resulting in an overall lower tax burden for most Singaporean households. These offsets included lower income taxes, lower property taxes, rebates on rental and service & conservancy charges for public housing, and additional subsidies for health, education and community services. As a result of the income tax cuts, additional tax reliefs and rebates in 1994, about 70% of individuals that used to pay income taxes no longer needed to do so. The Singapore government has argued that the GST on its own is a [flat tax](/wiki/Flat_tax), but that it is part of an overall fiscal system that is highly progressive: higher-income earners pay the highest fraction of their income in taxes, and also spend more. When all taxes were taken into account (income tax, property tax, GST and other indirect taxes), the top 10% of households accounted for 38% of the taxes paid, while the top 20% contributed 53% of all taxes. In contrast, lower-income earners receive substantially more transfers than the taxes they pay. Low- and middle-income households effectively pay 'negative' tax. From 2006 to 2010, the second bottom decile of Singaporean households (ranked by income from work) received transfers (net of all taxes paid) amounting to 23% of their income, the 5th decile received transfers that netted off taxes paid, while the effective tax rate for the top decile was 11%. In particular, when the GST rate was raised from 5% to 7% in July 2007, a household in the bottom 20% had to pay additional GST of $370 per year, but received an offset package of $910 per year, in addition to permanent benefits of $1,000 per year. ### Calls to exempt basic essentials from GST Some critics contend that basic essentials such as food and healthcare should be made exempt from GST, to help lower-income households. The government argued that having such exemptions would actually help the higher-income more than poorer Singaporeans, because well-off households usually spend much more on essentials (whether food or healthcare or other basic necessities) than a lower-income household. In addition, lower-income households would not benefit much from such an exemption, as spending on essentials constitutes a small proportion of lower-income household expenditures. For example, for the bottom 20% of households, essential food items comprised only 6% of their total household expenditures; after including all other food items, the total was only 15% of their expenditures. If essentials were to be exempted from GST, there would be a need to make up for the revenue shortfall through a higher GST rate on other goods and services, which lower-income households would also have to bear. The government argued that the experience of other countries demonstrated that granting exemptions would distort production and consumption decisions and cause a contentious and highly complex process of determining the goods and services that merit exemption. This would increase compliance and administration costs for businesses, and these costs would be passed on to consumers. In addition, the experience of other countries have shown that exempting or reducing GST on certain items did not mean that tax savings would be passed on to consumers. For example, this idea is in place in [Australia](/wiki/Goods_and_services_tax_(Australia)), which has a GST rate of 10%. Therefore, the GST should be kept broad-based to keep the GST low and the GST system simple, while help is directly provided to the lower-income through transfers and subsidies. In addition, the government has been absorbing GST in full for all subsidised patients in public hospitals and polyclinics since the GST was introduced in 1994. GST has also been absorbed for all subsidised patients receiving long-term care services. ### Calls to reduce the GST rate In response to the rising cost of living, politicians from opposition parties have called for the GST rate to be reduced. The Singapore government has argued that reducing the rate of GST would benefit the wealthy more than the poor, as the bulk of GST is collected from foreigners and higher-income earners. In 2010, 84.2% of all GST paid was collected from foreigners and the top 40% of Singaporean households, while the bottom 20% of households contributed only 4% of all GST paid. The government argued that as the GST was a core part of a fiscal system that provides transfers to the lower income, reducing the GST rate would be costly and inequitable, and leave the government with less resources to help the lower income. ## Notes - Goods & Services Tax at Inland Revenue Authority of Singapore - GST Offset Package Archived 24 December 2017 at the [Wayback Machine](/wiki/Wayback_Machine) - Singapore Customs – Tourist Refund Scheme on Goods and Services Tax\n",
  "language": "en",
  "processed_at": "2026-01-12T11:07:19.436665",
  "title": "Goods and Services Tax (Singapore)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Goods_and_Services_Tax_(Singapore)"
}