{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:07:25.405150"
  },
  "content": "Children's author **Gordon Snell** is a British author of [children's literature](/wiki/Children%27s_literature) and scriptwriter. He was married to Irish author [Maeve Binchy](/wiki/Maeve_Binchy) from 1977 until her death in 2012. He lives in the home that he shared with his late wife in [Dalkey](/wiki/Dalkey), outside of [Dublin](/wiki/Dublin), [Ireland](/wiki/Ireland). ## Early life Snell was born in [Singapore](/wiki/Singapore) in 1932. He was an only child, and lived with his mother and father in Singapore during the British colonization period. He went with his mother to Australia looking for a boarding school for him. They remained in Australia when Singapore was invaded by the Japanese in February 1942. He attended the [Geelong College](/wiki/Geelong_College) in Victoria, leaving in 1946. He was separated from his father for three years, who was taken prisoner during the [Japanese occupation of Singapore](/wiki/Japanese_occupation_of_Singapore) of World War II. After the war, the family moved to the UK. He finished [Secondary school](/wiki/Secondary_school) in Wiltshire. At [Dauntsey's School](/wiki/Dauntsey%27s_School) he collaborated in school plays with [Adrian Mitchell](/wiki/Adrian_Mitchell). He attended Oxford, where he was a friend and classmate of [Bernard Donoughue](/wiki/Bernard_Donoughue). ## Maeve Binchy Snell met [Maeve Binchy](/wiki/Maeve_Binchy) at the BBC where he was a freelance producer. He took his future wife on a hovercraft trip to [Boulogne](/wiki/Boulogne). But, they spent all their time there talking to each other, and never saw Boulogne. He and Maeve married in 1977. Working freelance, they did not have to live near publishers in London, and ultimately moved to her hometown, [Dalkey](/wiki/Dalkey) (just outside [Dublin](/wiki/Dublin)). For Gordon's 65th birthday, Maeve gave him a surprise gift of a rose variety named after him. In 2011, the couple appeared together on the Irish television [soap opera](/wiki/Soap_opera), *[Fair City](/wiki/Fair_City)*. He was by her hospital bedside when she died the following year. At Maeve's death, her estate was valued at ten million euros, of which two thirds went to Gordon. ## Writing His books include *Amy's Wonderful Nest*, *Tina and the Tooth Fairy* and *The Supermarket Ghost*. His other books include *The Phantom Horseman*, *Dangerous Treasure*, *The Mystery of Monk Island*, *The Curse of Werewolf Castle* and *The Tex and Sheelagh Omnibus*. He has commissioned and edited the collection *Thicker Than Water* on growing up, contributed to by Irish and Irish-American writers.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:07:25.404548",
  "title": "Gordon Snell",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Gordon_Snell"
}