{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:07:27.689396"
  },
  "content": "This article is part of a series on[Politics of Singapore](/wiki/Politics_of_Singapore)[Constitution](/wiki/Constitution_of_Singapore) - [Law](/wiki/Law_of_Singapore) - [Human rights](/wiki/Human_rights_in_Singapore) [Legislature](/wiki/Parliament_of_Singapore) - **[Parliament](/wiki/Parliament_of_Singapore)** - [Speaker](/wiki/Speaker_of_the_Parliament_of_Singapore) [Seah Kian Peng](/wiki/Seah_Kian_Peng) ([PAP](/wiki/People%27s_Action_Party)) - [Leader of the House](/wiki/Leader_of_the_House_(Singapore)) [Indranee Rajah](/wiki/Indranee_Rajah) ([PAP](/wiki/People%27s_Action_Party)) - [Leader of the Opposition](/wiki/Leader_of_the_Opposition_(Singapore)) [Pritam Singh](/wiki/Pritam_Singh_(Singaporean_politician)) ([WP](/wiki/Workers%27_Party_(Singapore))) - [14th Parliament](/wiki/14th_Parliament_of_Singapore) - [Constituencies](/wiki/Constituencies_of_Singapore) Executive - **[President of Singapore](/wiki/President_of_Singapore)** ([list](/wiki/List_of_presidents_of_Singapore)) - [Tharman Shanmugaratnam](/wiki/Tharman_Shanmugaratnam) ([I](/wiki/Independent_politician)) - **[Prime Minister of Singapore](/wiki/Prime_Minister_of_Singapore)** - [Lawrence Wong](/wiki/Lawrence_Wong) ([PAP](/wiki/People%27s_Action_Party)) - [Cabinet](/wiki/Cabinet_of_Singapore) - [Ministries](/wiki/Organisation_of_the_Government_of_Singapore) - [The Reserves](/wiki/Reserves_of_the_Government_of_Singapore) [Judiciary](/wiki/Judicial_system_of_Singapore) - **[Supreme Court of Singapore](/wiki/Supreme_Court_of_Singapore)** - [Chief Justice](/wiki/Chief_Justice_of_Singapore) [Sundaresh Menon](/wiki/Sundaresh_Menon) - **[Court of Appeal](/wiki/Court_of_Appeal_of_Singapore)** - [Prakash](/wiki/Judith_Prakash) - [Tay](/wiki/Tay_Yong_Kwang) - [Chong](/wiki/Steven_Chong) - [Ang](/wiki/Belinda_Ang) - **[High Court](/wiki/High_Court_of_Singapore)** - [State Courts](/wiki/State_Courts_of_Singapore) [Elections](/wiki/Elections_in_Singapore) - [Presidential elections](/wiki/Presidential_elections_in_Singapore) - [General elections](/wiki/General_elections_in_Singapore) Singapore portal - [Other countries](/wiki/Outline_of_political_science#Politics_by_region) - v - t - e The **government of Singapore** is defined by the [Constitution of the Republic of Singapore](/wiki/Constitution_of_Singapore) to consist of the [President](/wiki/President_of_Singapore) and the Executive. Executive authority of Singapore is vested in the President but exercised on the advice of the Cabinet led by the Prime Minister. The President, acting as the Head of State, may only act in their discretion in appointing the Prime Minister, acting as the Head of Government; as well as withholding consent for the dissolution of Parliament; along with performing key checks on the Government in addition to the ceremonial duties of the Head of State inherited from the [Westminster system](/wiki/Westminster_system). The Cabinet, consisting of the Prime Minister and ministers appointed by the President on the Prime Minister's advice, is responsible for heading the Executive through ministries and other [statutory boards](/wiki/Statutory_boards_of_the_Singapore_Government). At the end of the term or at any time during the term, once the President has consented to a request made by the Prime Minister to dissolve Parliament, [Parliamentary General Elections](/wiki/General_elections_in_Singapore) are held to elect members of Parliament for a new term. The President, in their discretion, then appoints a Prime Minister who is a member of Parliament representing any [political party](/wiki/Political_party) or coalition of political parties who in their judgement is likely to command the confidence of the majority of the members of Parliament. The Prime Minister then forms the Government and, along with the Cabinet, sets the general direction and control of the Government for the next term. A [statutory board](/wiki/Statutory_boards_of_the_Singapore_Government) is an autonomous agency of the Government that is established by an [Act of Parliament](/wiki/Sources_of_Singapore_law#Statutes) and overseen by a government ministry. Unlike ministries and government departments that are subdivisions of ministries, statutory boards are not staffed by civil servants and have greater independence and flexibility in their operations. There are five [Community Development Councils](/wiki/Community_Development_Council) (CDCs) appointed by the board of management of the [People's Association](/wiki/People%27s_Association) (PA) for districts in [Singapore](/wiki/Singapore). Where there are not less than 150,000 residents in a district, the PA's board of management may designate the chairman of a CDC to be the mayor for the district that the CDC is appointed for. As it is the practice for Members of Parliament (MPs) to be appointed as Chairmen of CDCs, these MPs have also been designated as mayors. There are currently five districts in the country. From the founding of contemporary Singapore in 1819, Singapore was headed by two [residents](/wiki/Governors_of_Singapore#Resident_of_Singapore_(1819-1826)) in succession. Following Singapore's amalgamation into the [Straits Settlements](/wiki/Straits_Settlements) in 1826, it was governed by a [governor](/wiki/List_of_British_Governors_of_the_Straits_Settlements) together with a [legislative council](/wiki/Legislative_Council_of_the_Straits_Settlements). An executive council of the Straits Settlements was introduced in 1877 to advise the governor but wielded no executive power. In 1955, a Council of Ministers was created, appointed by the governor on the recommendation of the leader of the house. Constitutional talks between Legislative Assembly representatives and the [Colonial Office](/wiki/Colonial_Office) were held from 1956 to 1958, and Singapore achieved full internal self-government in 1959. The governor was replaced by the [Yang di-Pertuan Negara](/wiki/Yang_di-Pertuan_Negara), who had power to appoint to the post of prime minister the person most likely to command the authority of the assembly, and other ministers of the Cabinet on the prime minister's advice. In the [1959 general elections](/wiki/1959_Singaporean_general_election), the [People's Action Party](/wiki/People%27s_Action_Party) (PAP) swept to power with 43 out of the 51 seats in the assembly, and [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) became the first prime minister of Singapore. The executive branch of the Singapore Government remained unchanged following Singapore's [merger with Malaysia](/wiki/Singapore_in_Malaysia) in 1963, and subsequent [independence](/wiki/History_of_the_Republic_of_Singapore#Independence_from_Malaysia) in 1965. The PAP has been returned to power in every general election and has thus formed the Cabinet since 1959. ## Terminology The term *Government of Singapore* can have a number of different meanings. At its widest, it can refer collectively to the three traditional branches of government – the [Executive branch](/wiki/Executive_(government)), [Legislative branch](/wiki/Legislature) (the [President](/wiki/President_of_Singapore) and [Parliament of Singapore](/wiki/Parliament_of_Singapore)) and [Judicial branch](/wiki/Judiciary) (the [Supreme Court](/wiki/Supreme_Court_of_Singapore) and [Subordinate Courts of Singapore](/wiki/Subordinate_Courts_of_Singapore)). The term is also used colloquially to mean the Executive and Legislature together, as these are the branches of government responsible for day-to-day governance of the nation and lawmaking. At its narrowest, the term is used to refer to the [Members of Parliament](/wiki/Members_of_the_Singapore_Parliament) (MPs) belonging to a particular [political party](/wiki/Political_party) (or [coalition of parties](/wiki/Coalition_government)) holding a majority of seats in Parliament sufficient to enable the party (or coalition) to form the [Cabinet of Singapore](/wiki/Cabinet_of_Singapore) – this is the sense intended when it is said that a political party \"forms the Government\". The [Constitution of the Republic of Singapore](/wiki/Constitution_of_Singapore) uses the word *Government* to mean the Executive branch, made up of the [President](/wiki/President_of_Singapore) and the Cabinet. This article describes the Government of Singapore in this technical sense, as well as selected aspects of the Executive branch of the Government. ## History On 30 January 1819, [Sir Stamford Raffles](/wiki/Stamford_Raffles), an Englishman who was the Governor of Bencoolen (now [Bengkulu](/wiki/Bengkulu), Indonesia), entered into a preliminary agreement with the [Temenggung](/wiki/Temenggung) of [Johor](/wiki/Johor), Abdul Rahman Sri Maharajah, for the [British East India Company](/wiki/East_India_Company) to establish a \"[factory](/wiki/Factory_(trading_post))\" or trading post on the island of [Singapore](/wiki/Singapore). This was confirmed by another agreement signed by Raffles, the Temenggung and [Sultan](/wiki/Sultan) [Hussein Shah](/wiki/Hussein_Shah_of_Johor) on 6 February. In June 1823 Singapore ceased to be a dependency of Bencoolen and was placed under the control of the [Presidency City](/wiki/Presidencies_and_provinces_of_British_India) of Calcutta ([Kolkata](/wiki/Kolkata)) in the [Bengal Presidency](/wiki/Bengal_Presidency). On 24 June 1824, Singapore and [Malacca](/wiki/Malacca) were formally transferred to the East India Company, with the result that they came under the control of [Fort William](/wiki/Fort_William_(India)). Full [cession](/wiki/Cession) of Singapore to the company by the Sultan and Temenggung was effected by a treaty of 19 November 1824, which was ratified by Calcutta on 4 March 1825. Between 1819 and 1826, Singapore was headed by two [Residents of Singapore](/wiki/Governors_of_Singapore#Resident_of_Singapore_(1819-1826)) in succession, Maj.-Gen. [William Farquhar](/wiki/William_Farquhar) and Dr. [John Crawfurd](/wiki/John_Crawfurd). In 1826, Malacca, [Penang](/wiki/Penang) and Singapore were amalgamated into the [Straits Settlements](/wiki/Straits_Settlements), which were made a [Crown colony](/wiki/Crown_colony) with effect from 1 April 1867. The colony was governed by a [governor](/wiki/List_of_British_Governors_of_the_Straits_Settlements) together with a [legislative council](/wiki/Legislative_Council_of_the_Straits_Settlements). An executive council was introduced in 1877 by [letters patent](/wiki/Letters_patent) issued by [the Crown](/wiki/The_Crown), Composed of \"such persons and constituted in such manner as may be directed\" by royal instructions, it existed to advise the governor and wielded no executive power. The governor was required to consult the executive council on all affairs of importance unless they were too urgent to be laid before it, or if reference to it would prejudice the public service. In such urgent cases, the governor had to inform the council of the measures he had taken. During the [Second World War](/wiki/Second_World_War), the [Japanese Empire](/wiki/Japanese_Empire) invaded Singapore; the Japanese were victorious and set up their own government for a few years. Following the Second World War, the Straits Settlements were disbanded and Singapore became a Crown colony in its own right. The reconstituted Executive Council consisted of six officials and four nominated \"unofficials\". In February 1954, the Rendel Constitutional Commission under the chairmanship of Sir [George William Rendel](/wiki/George_William_Rendel), which had been appointed to comprehensively review the constitution of the Colony of Singapore, rendered its report. Among other things, it recommended that a Council of Ministers be created, composed of three *ex officio* Official Members and six Elected Members of the [Legislative Assembly of Singapore](/wiki/Legislative_Assembly_of_Singapore) appointed by the Governor on the recommendation of the Leader of the House, who would be the leader of the largest political party or [coalition of parties](/wiki/Coalition_government) having majority support in the legislature. The recommendation was implemented in 1955. In the general election held that year, the [Labour Front](/wiki/Labour_Front) took a majority of the seats in the Assembly, and [David Saul Marshall](/wiki/David_Marshall_(Singaporean_politician)) became the first [Chief Minister of Singapore](/wiki/Chief_Minister_of_Singapore). Major problems with the Rendel Constitution were that the Chief Minister and ministers' powers were ill-defined, and that the Official Members retained control of the finance, administration, and internal security and law portfolios. This led to confrontation between Marshall, who saw himself as a Prime Minister governing the country, and the [Governor](/wiki/Governor_of_Singapore), Sir [John Fearns Nicoll](/wiki/John_Fearns_Nicoll), who felt that important decisions and policies should remain with himself and the Official Members. In 1956, members of the Legislative Assembly held constitutional talks with the [Colonial Office](/wiki/Colonial_Office) in London. The talks broke down as Marshall did not agree to the British Government's proposal for the [casting vote](/wiki/Casting_vote) on a proposed Defence Council to be held by the British High Commissioner to Singapore, who would only exercise it in an emergency. Marshall resigned as Chief Minister in June 1956, and was replaced by [Lim Yew Hock](/wiki/Lim_Yew_Hock). The following year, Lim led another delegation to the UK for further talks on self-government. This time, agreement was reached on the composition of an Internal Security Council. Other constitutional arrangements were swiftly settled in 1958, and on 1 August the [Parliament of the United Kingdom](/wiki/Parliament_of_the_United_Kingdom) passed the State of Singapore Act 1958, granting the colony full internal self-government. Under Singapore's new constitution which came into force on 3 June 1959, the Governor was replaced by the [Yang di-Pertuan Negara](/wiki/Yang_di-Pertuan_Negara) (Head of State), who had power to appoint as Prime Minister the person most likely to command the authority of the Legislative Assembly, and other Ministers of the Cabinet on the Prime Minister's advice. The Constitution also created the post of the British High Commissioner, who was entitled to receive the agenda of each Cabinet meeting and to see all Cabinet papers. In the [1959 general elections](/wiki/1959_Singaporean_general_election), the [People's Action Party](/wiki/People%27s_Action_Party) (PAP) swept to power with 43 out of the 51 seats in the Assembly, and [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) became the first Prime Minister of Singapore. Nine other ministers were appointed to the Cabinet. The executive branch of the Singapore Government remained largely unchanged, although now it governed a state within a larger [federation](/wiki/Federation). However, with effect from 9 August 1965, Singapore left the [Federation of Malaysia](/wiki/Malaysia) and became a fully [independent republic](/wiki/History_of_the_Republic_of_Singapore#Independence_from_Malaysia). On separation from Malaysia, the Singapore Government retained the executive authority it held, and took on additional executive authority over Singapore that the [Parliament of Malaysia](/wiki/Parliament_of_Malaysia) relinquished. The [Yang di-Pertuan Agong](/wiki/Yang_di-Pertuan_Agong), the Supreme Head of State of Malaysia, also ceased to be the Supreme Head of Singapore and relinquished his sovereignty, jurisdiction, power and authority, executive or otherwise in respect of Singapore, which was revested in the Yang di-Pertuan Negara of Singapore. The Republic of Singapore Independence Act 1965 then vested the executive authority of Singapore in the newly created post of President, and made it exercisable by him or by the Cabinet or by any Minister authorised by the Cabinet. The PAP has been repeatedly returned to power by voters and has thus formed the Cabinet since Singapore's [1959 general election](/wiki/1959_Singaporean_general_election). The Government is generally perceived to be competent in managing the [country's economy](/wiki/Economy_of_Singapore), and largely free from [political corruption](/wiki/Political_corruption). [Transparency International](/wiki/Transparency_International)'s 2010 [Corruption Perceptions Index](/wiki/Corruption_Perceptions_Index), which compares countries according to the degree to which corruption is perceived to exist among public officials and politicians, ranked Singapore in joint first place with Denmark and New Zealand out of 178 countries. In addition, Singapore was second only to New Zealand in the [Asia-Pacific](/wiki/Asia-Pacific) region. On the other hand, the Government has been criticised for using unfair election tactics, such as discouraging voting for opposition parties in the [2006 general election](/wiki/2006_Singaporean_general_election) by stating that wards that elect opposition candidates will receive state-subsidized improvements to public housing only after all PAP-held wards have been attended to. It has also been accused of violating [freedom of speech](/wiki/Freedom_of_speech) through Ministers bringing [defamation](/wiki/Defamation) suits against opposition politicians, and by restricting the circulation of foreign newspapers deemed to have engaged in [domestic politics](/wiki/Domestic_policy). ## Composition The Constitution defines the Government of Singapore as the President and the Cabinet of Singapore. The executive authority of Singapore is vested in the President and is exercisable by them or by the Cabinet of Singapore or any Minister authorised by the Cabinet. However, the President normally plays a nominal and largely ceremonial role in the executive branch of government. Although the President acts in their own personal discretion in the exercise of certain functions as a check on the Cabinet and Parliament of Singapore, they are otherwise required to act in accordance with the advice of the Cabinet or of a Minister acting under the general authority of the Cabinet. It is the Cabinet that has the general direction and control of the Government. As Singapore follows the Westminster system of government, the [legislative](/wiki/Legislation) agenda of Parliament is determined by the Cabinet. At the start of each new [Parliamentary session](/wiki/Legislative_session), the President gives an address prepared by the Cabinet that outlines what the Cabinet intends to achieve in the session. Each parliament lasts for a maximum of five years from the date of its first sitting, and once a parliament has been [dissolved](/wiki/Parliament_of_Singapore#Sessions) a [general election](/wiki/Parliamentary_elections_in_Singapore) must be held within three months. Following a general election, the President appoints as Prime Minister an MP who, in their judgment, is likely to command the confidence of the majority of the MPs. In practice, the Prime Minister is usually the leader of the political party holding the majority of the seats in Parliament. The President also appoints other Ministers from among the MPs, acting in accordance with the Prime Minister's advice. ### Ministries and responsibilities of Ministers The Prime Minister may, by giving written directions, charge any Minister with responsibility for any department or subject. In practice, this is done by issuing notifications that are published in the *Government Gazette*. For instance, the Constitution of the Republic of Singapore (Responsibility of Senior Minister and Co-ordinating Minister for National Security, Prime Minister's Office) Notification 2009 states: > It is hereby notified for general information that, pursuant to Article 30(1) of the Constitution of the Republic of Singapore, the Prime Minister has directed that Mr S. Jayakumar shall, with effect from 1st April 2009, be charged with the responsibility for the following matters: > > (a) national security issues involving or affecting more than one Ministry;(b) Chairmanship of the Security Policy Review Committee;(c) foreign policy issues involving or affecting more than one Ministry; and(d) foreign policy issues which involve legal negotiation or international adjudication, > > and that he shall be designated as Senior Minister and Co-ordinating Minister for National Security. Ministers may be designated by the Prime Minister to be in charge of particular [ministries](/wiki/Organisation_of_the_Government_of_Singapore), or as Ministers in the [Prime Minister's Office](/wiki/Prime_Minister%27s_Office_(Singapore)). Such Ministers were formerly known as [Ministers without portfolio](/wiki/Minister_without_portfolio). The Prime Minister may retain any department or subject in their charge. Some Ministers are appointed as Second Ministers for portfolios other than their own to assist the primary Minister in their duties. For instance, on 1 April 2009 during the [11th Parliament](/wiki/11th_Parliament_of_Singapore), [Lim Hwee Hua](/wiki/Lim_Hwee_Hua), who was a Minister in the Prime Minister's Office, also held the posts of Second Minister for Finance and Second Minister for Transport. As of 8 July 2024, the ministries of the Government are the following: - [Prime Minister's Office](/wiki/Prime_Minister%27s_Office_(Singapore)) (PMO) - [Ministry of Digital Development and Information](/wiki/Ministry_of_Digital_Development_and_Information) (MDDI) - [Ministry of Culture, Community and Youth](/wiki/Ministry_of_Culture,_Community_and_Youth) (MCCY) - [Ministry of Defence](/wiki/Ministry_of_Defence_(Singapore)) (MINDEF) - [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)) (MOE) - [Ministry of Finance](/wiki/Ministry_of_Finance_(Singapore)) (MOF) - [Ministry of Foreign Affairs](/wiki/Ministry_of_Foreign_Affairs_(Singapore)) (MFA) - [Ministry of Health](/wiki/Ministry_of_Health_(Singapore)) (MOH) - [Ministry of Home Affairs](/wiki/Ministry_of_Home_Affairs_(Singapore)) (MHA) - [Ministry of Law](/wiki/Ministry_of_Law_(Singapore)) (MinLaw) - [Ministry of Manpower](/wiki/Ministry_of_Manpower_(Singapore)) (MOM) - [Ministry of National Development](/wiki/Ministry_of_National_Development_(Singapore)) (MND) - [Ministry of Social and Family Development](/wiki/Ministry_of_Social_and_Family_Development) (MSF) - [Ministry of Sustainability and the Environment](/wiki/Ministry_of_Sustainability_and_the_Environment) (MSE) - [Ministry of Trade and Industry](/wiki/Ministry_of_Trade_and_Industry_(Singapore)) (MTI) - [Ministry of Transport](/wiki/Ministry_of_Transport_(Singapore)) (MOT) A ministry is usually composed of a headquarters and a number of departments, boards or other subordinate entities, and statutory boards. For instance, in May 2007 the Ministry of Law had three departments (the Chief Information Officer's Office, Insolvency and Public Trustee's Office and Legal Aid Bureau), three boards and tribunals (the Appeals Board for Land Acquisitions, Copyright Tribunal and Land Surveyors Board), and two statutory boards (the [Intellectual Property Office of Singapore](/wiki/Intellectual_Property_Office_of_Singapore) and [Singapore Land Authority](/wiki/Singapore_Land_Authority)). The cabinet was sworn in on 23 May 2025. The Second Lawrence Wong Cabinet is composed of the following members. Cabinet of Singapore PortfolioMinisterPortraitSince[Prime Minister](/wiki/Prime_Minister_of_Singapore)[Lawrence **Wong**](/wiki/Lawrence_Wong)15 May 2024[Minister for Finance](/wiki/Minister_for_Finance_(Singapore))15 May 2021[Senior Minister](/wiki/Senior_Minister_of_Singapore)[**Lee** Hsien Loong](/wiki/Lee_Hsien_Loong)15 May 2024[Deputy Prime Minister](/wiki/Deputy_Prime_Minister_of_Singapore)[**Gan** Kim Yong](/wiki/Gan_Kim_Yong)15 May 2024[Minister for Trade and Industry](/wiki/Minister_for_Trade_and_Industry_(Singapore))15 May 2021[Coordinating Minister for National Security](/wiki/Coordinating_Minister_for_National_Security_(Singapore))[K. **Shanmugam**](/wiki/K._Shanmugam)23 May 2025[Minister for Home Affairs](/wiki/Minister_for_Home_Affairs_(Singapore))1 October 2015Coordinating Minister for Public Services[**Chan** Chun Sing](/wiki/Chan_Chun_Sing)23 May 2025[Minister for Defence](/wiki/Minister_for_Defence_(Singapore))[Coordinating Minister for Social Policies](/wiki/Coordinating_Minister_for_Social_Policies_(Singapore))[**Ong** Ye Kung](/wiki/Ong_Ye_Kung)23 May 2025[Minister for Health](/wiki/Minister_for_Health_(Singapore))15 May 2021[Minister for Foreign Affairs](/wiki/Minister_for_Foreign_Affairs_(Singapore))[Vivian **Balakrishnan**](/wiki/Vivian_Balakrishnan)1 October 2015[Minister for Sustainability and the Environment](/wiki/Minister_for_the_Environment_and_Water_Resources_(Singapore))[Grace **Fu** Hai Yen](/wiki/Grace_Fu)27 July 2020Minister-in-charge of Trade Relations18 January 2024[Minister for Digital Development and Information](/wiki/Ministry_of_Digital_Development_and_Information)[Josephine **Teo**](/wiki/Josephine_Teo)15 May 2021[Minister-in-Charge of the Smart Nation Initiative](/wiki/Smart_Nation)[Minister-in-Charge of Cybersecurity](/wiki/Cyber_Security_Agency_(Singapore))[Minister for Social and Family Development](/wiki/Ministry_of_Social_and_Family_Development)[**Masagos** Zulkifli](/wiki/Masagos_Zulkifli)27 July 2020[Minister for Education](/wiki/Minister_for_Education_(Singapore))[Desmond **Lee** Ti-Seng](/wiki/Desmond_Lee_(Singaporean_politician))23 May 2025Minister-in-charge of Social Service Integration27 July 2020[Minister in the Prime Minister's Office](/wiki/Prime_Minister%27s_Office_(Singapore))[**Indranee** Thurai Rajah](/wiki/Indranee_Rajah)1 May 2018[Second Minister for Finance](/wiki/Minister_for_Finance_(Singapore))[Second Minister for National Development](/wiki/Minister_for_National_Development_(Singapore))27 July 2020[Minister for Law](/wiki/Minister_for_Law_(Singapore))[Edwin Charles **Tong** Chun Fai](/wiki/Edwin_Tong)23 May 2025[Second Minister for Home Affairs](/wiki/Minister_for_Home_Affairs_(Singapore))[Minister for Manpower](/wiki/Minister_for_Manpower_(Singapore))[**Tan** See Leng](/wiki/Tan_See_Leng)15 May 2021Minister-in-charge of Energy and Science & Technology23 May 2025[Minister for National Development](/wiki/Minister_for_National_Development_(Singapore))[**Chee** Hong Tat](/wiki/Chee_Hong_Tat)23 May 2025[Acting Minister for Culture, Community and Youth](/wiki/Ministry_of_Culture,_Community_and_Youth)[David **Neo** Chin Wee](/wiki/David_Neo)23 May 2025[Acting Minister for Transport](/wiki/Minister_for_Transport_(Singapore))[Jeffrey **Siow** Chen Siang](/wiki/Jeffrey_Siow)23 May 2025[Acting Minister-in-Charge of Muslim Affairs](/wiki/Minister-in-Charge_of_Muslim_Affairs) [Senior Minister of State for Home Affairs](/wiki/Minister_for_Home_Affairs_(Singapore))[Muhammad Faishal **Ibrahim**](/wiki/Muhammad_Faishal_Ibrahim)23 May 2025 ## Other aspects of the Government ### Ministers of State and Parliamentary Secretaries As in the United Kingdom and in a number of [Commonwealth](/wiki/Commonwealth_of_Nations) countries, [Members of Parliament](/wiki/Members_of_the_Singapore_Parliament) (MPs) may be appointed as [Ministers of State](/wiki/Minister_of_State) to aid Ministers in the performance of their functions. In addition, the Constitution provides that the President, acting in accordance with the advice of the Prime Minister, may appoint [Parliamentary Secretaries](/wiki/Parliamentary_Secretary) from among the MPs to assist Ministers in the discharge of their duties and functions. Such office holders are not regarded as members of the Cabinet. Where in any written law a Minister is empowered to exercise any power or perform any duty, he may, in the absence of any provision of law to the contrary, with the approval of the President and by notification in the *Government Gazette*, depute any person by name or the person for the time being discharging the duties of an office designated by him to exercise that power or perform that duty on behalf of the Minister subject to such conditions, exceptions and qualifications as the President may determine. For instance, under the Delegation of Powers (Ministry of Law) (Consolidation) Notification, the Senior Minister of State for Law is deputed to exercise certain powers of the Minister for Law under the Copyright Act, Criminal Procedure Code, Land Acquisition Act, Land Surveyors Act, and Pawnbrokers Act; while the Parliamentary Secretary for Home Affairs is deputed the powers of the Minister for Home Affairs under regulation 157 of the Prisons Regulations pursuant to the Delegation of Powers (Ministry of Home Affairs) (Consolidation) Notification. ### Statutory boards A statutory board is an autonomous agency of the Government that is established by an [Act of Parliament](/wiki/Sources_of_Singapore_law#Statutes) and overseen by a government ministry. The Act sets out the purposes, powers and rights of the agency. Unlike ministries and government departments that are subdivisions of ministries, statutory boards may not be staffed by civil servants and have greater independence and flexibility in their operations. They are managed by boards of directors whose members usually include businessmen, professionals, senior civil servants and officials of trade unions. The [Agency for Science, Technology and Research](/wiki/Agency_for_Science,_Technology_and_Research) (A*STAR), the [Central Provident Fund Board](/wiki/Central_Provident_Fund) (CPF), the [Housing and Development Board](/wiki/Housing_and_Development_Board) (HDB), the Intellectual Property Office of Singapore (IPOS), the [Land Transport Authority](/wiki/Land_Transport_Authority) (LTA), the [Maritime and Port Authority of Singapore](/wiki/Maritime_and_Port_Authority_of_Singapore) (MPA), the [National Heritage Board](/wiki/National_Heritage_Board_(Singapore)) (NHB), and the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) (URA) are all statutory boards. The National Heritage Board is an example of a typical statutory board. It was established on 1 August 1993 with the enactment of the National Heritage Board Act. Section 3 of the Act states: \"There shall be established a body to be known as the National Heritage Board which shall be a [body corporate](/wiki/Body_corporate) with [perpetual succession](/wiki/Perpetual_succession) and shall, by that name, be capable of—(a) suing and being sued; (b) acquiring, owning, holding, developing and disposing of property, both [movable](/wiki/Personal_property) and [immovable](/wiki/Immovable_property); and (c) doing and suffering all such acts or things as bodies corporate may lawfully do or suffer.\" The functions of the Board are: - to explore and present the heritage and nationhood of the people of Singapore in the context of their ancestral cultures, their links with [South-East Asia](/wiki/Southeast_Asia), Asia and the world through the collection, preservation, interpretation and display of objects and records; - to promote public awareness, appreciation and understanding of the arts, culture and heritage, both by means of the board's collections and by such other means as it considers appropriate; - to promote the establishment and development of organisations concerned with the national heritage of Singapore; - to provide a permanent repository of records of national or historical significance and to facilitate access thereto; - to conduct records management programmes for the Government; - to record, preserve and disseminate the history of Singapore through [oral history](/wiki/Oral_history) methodology or other means; and - to advise the Government in respect of matters relating to the national heritage of Singapore. The board is empowered to \"do all things necessary or convenient to be done for or in connection with the performance of its functions\". Without prejudice to the generality of that provision, the Board also has power to, for example, develop and manage museums, archives, oral history centres and other facilities related to its functions; to advise and facilitate the preservation of historic sites; and to establish liaison with other museums, archives, oral history centres, universities and other institutions to secure maximum collaboration of all activities relevant to its functions. The board consists of a chairman, a deputy chairman, and not less than 10 nor more than 25 other members as the [Minister for Digital Development and Information](/wiki/Ministry_of_Digital_Development_and_Information) may from time to time determine. The members of the board are appointed by the minister, and hold office for such term as the minister may determine unless they resign during their term of office or their appointment is revoked by the minister. The minister is not required to provide any reason for revoking the appointment of a board member. The minister may, in consultation with the Board or otherwise, give the board directions as he thinks fit that are not inconsistent with the provisions of the act concerning the exercise and performance by the board of its functions, and the board is required to give effect to such directions. With the approval of the minister, the board is required to appoint a [chief executive officer](/wiki/Chief_executive_officer) who is responsible to the Board for the proper administration and management of the Board's affairs in accordance with the policy laid down by the Board. The board is entitled to appoint employees and officers on such terms as to remuneration or otherwise as it may determine, and to engage other persons and pay for their services as it considers necessary for carrying out its functions and duties. ### Community Development Councils and district mayors The [People's Association](/wiki/People%27s_Association) (PA) is a statutory board, the objects of which include the organisation and the promotion of group participation in social, cultural, educational and athletic activities for the people of Singapore in order that they may realise that they belong to a [multiracial community](/wiki/Multiracialism), the interests of which transcend [sectional loyalties](/wiki/Sectionalism); and the establishment of institutions for the purpose of leadership training in order to instill in leaders a sense of national identity and a spirit of dedicated service to a multiracial community. There are five [Community Development Councils](/wiki/Community_Development_Council) (CDCs) appointed by the board of management of the PA for districts in Singapore, namely, the [Central Singapore CDC](/wiki/Central_Singapore_Community_Development_Council), [North East CDC](/wiki/North_East_Community_Development_Council), [North West CDC](/wiki/North_West_Community_Development_Council), [South East CDC](/wiki/South_East_Community_Development_Council) and [South West CDC](/wiki/South_West_Community_Development_Council). The functions of a CDC include fostering community bonding and strengthening social cohesion amongst the people of Singapore; and advising the PA on matters affecting the well-being of residents in districts, the provision and use of public facilities and services within districts, and the use of public funds allocated to districts for community activities. Each CDC consists of a chairman and between 12 and 80 other members. Where the number of residents in a district is not less than 150,000, the PA's board of management is empowered to designate the Chairman of a CDC to be the Mayor for the district that the CDC is appointed for. As it is the practice for MPs to be appointed as Chairmen of CDCs, these MPs have also been designated as Mayors. The incumbent Mayors are: DistrictMayorCentral Singapore[Denise **Phua**](/wiki/Denise_Phua)North East[Desmond **Choo**](/wiki/Desmond_Choo)North West[Alex **Yam**](/wiki/Alex_Yam)South East[**Dinesh** Vasu Dash](/wiki/Dinesh_Vasu_Dash)South West[**Low** Yen Ling](/wiki/Low_Yen_Ling)The names in bold are the [surnames](/wiki/Surname) of Chinese persons, and the [personal names](/wiki/Personal_name) of Indian and Malay persons. Even if Mayors are required to vacate their seats in Parliament because [Parliament has been dissolved](/wiki/Dissolution_of_parliament) or otherwise, they continue to hold office until their terms of office expire or they are directed to vacate their office by the PA's board of management. As of January 2012,[update] the Mayors are paid an annual salary of S$660,000 (US$486,500). - Singapore portal - [Cabinet of Singapore](/wiki/Cabinet_of_Singapore) - [Organisation of the Government of Singapore](/wiki/Organisation_of_the_Government_of_Singapore) - [Politics of Singapore](/wiki/Politics_of_Singapore) - [President of Singapore](/wiki/President_of_Singapore) - [Statutory boards of the Singapore Government](/wiki/Statutory_boards_of_the_Singapore_Government) ## Bibliography - [Constitution of the Republic of Singapore](/wiki/Constitution_of_Singapore) (1985 Rev. Ed., 1999 Reprint). - National Heritage Board Act (Cap. 196A, 1994 Rev. Ed.). - People's Association (Community Development Councils) Rules (Cap. 227, R 2, 1998 Rev. Ed.). - \"The PM's new cabinet\" (PDF), *The Straits Times*, p. A8, 27 March 2009, archived from the original (PDF) on 8 April 2009. - Tan, Kevin Y L (2005), \"A Short Legal and Constitutional History of Singapore\", in Kevin Y.L. Tan (ed.), *Essays in Singapore Legal History*, Singapore: Singapore Academy of Law & Marshall Cavendish Academic, pp. 27–72, [ISBN](/wiki/ISBN_(identifier)) 978-981-210-349-9. - [Thio, Li-ann](/wiki/Thio_Li-ann) (1999), \"The Constitutional Framework of Powers\", in Tan, Kevin Y L (ed.), *The Singapore Legal System* (2nd ed.), Singapore: Singapore University Press, pp. 67–122, [ISBN](/wiki/ISBN_(identifier)) 978-9971-69-213-1. Library resources about **Government of Singapore** - Resources in your library - Resources in other libraries - Chan, Helena H[ui-]M[eng] (1995), \"The Executive\", *The Legal System of Singapore*, Singapore: [Butterworths Asia](/wiki/LexisNexis_Butterworths), pp. 22–29, [ISBN](/wiki/ISBN_(identifier)) 978-0-409-99789-7. - [Chan, Heng Chee](/wiki/Chan_Heng_Chee) (1976), *The Dynamics of One Party Dominance: The PAP at the Grass-roots*, Singapore: [Singapore University Press](/wiki/National_University_of_Singapore), [OCLC](/wiki/OCLC_(identifier)) 3236351. - [Jennings, Ivor](/wiki/Ivor_Jennings) (1980), *Cabinet Government* (3rd ed.), Cambridge: [Cambridge University Press](/wiki/Cambridge_University_Press), [ISBN](/wiki/ISBN_(identifier)) 978-0-521-09570-9. - Mauzy, Diane K.; Milne, R[obert] S[tephen] (2002), *Singapore Politics under the People's Action Party*, London; New York, N.Y.: [Routledge](/wiki/Routledge), pp. 128–142, [ISBN](/wiki/ISBN_(identifier)) 978-0-415-24653-8. - Quah, John S.T.; Chan, Heng Chee; Seah, Chee Meow, eds. (1987), *Government and Politics of Singapore* (rev. ed.), Singapore: [Oxford University Press](/wiki/Oxford_University_Press), [ISBN](/wiki/ISBN_(identifier)) 978-0-19-588855-3. - Tan, Kevin Y[ew] L[ee]; Thio, Li-ann (1997), \"The Executive\", *Tan, Yeo & Lee's Constitutional Law in Malaysia and Singapore* (2nd ed.), Singapore: Butterworths Asia, pp. 181–243, [ISBN](/wiki/ISBN_(identifier)) 978-0-409-99908-2. - Thio, Li-ann (1995), \"Government and the State\", *ASEAN Legal Systems*, Singapore: Butterworths Asia for the [ASEAN](/wiki/Association_of_Southeast_Asian_Nations) Law Association, [ISBN](/wiki/ISBN_(identifier)) 978-0-409-99802-3. - Vasil, Raj [K.] (2000), *Governing Singapore: Democracy and National Development*, Singapore: [Allen & Unwin](/wiki/Allen_%26_Unwin), [ISBN](/wiki/ISBN_(identifier)) 978-1-86508-211-0. - Worthington, Ross (2003), *Governance in Singapore*, London; New York, N.Y.: RoutledgeCurzon, [ISBN](/wiki/ISBN_(identifier)) 978-0-7007-1474-2. - Official website - Singapore Government Directory Interactive - Government of Singapore – official [YouTube](/wiki/YouTube) channel\n",
  "language": "en",
  "processed_at": "2026-01-12T11:07:27.688874",
  "title": "Government of Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Government_of_Singapore"
}