{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:07:29.700676"
  },
  "content": "Singaporean technology company **Grab Holdings Inc.** is a [Singaporean](/wiki/Singapore) [multinational](/wiki/Multinational_corporation) technology company headquartered in [one-north](/wiki/One-north), Singapore. It is the developer of a [super-app](/wiki/Super-app) for [ride-hailing](/wiki/Ride-hailing), [food delivery](/wiki/Food_delivery), and digital payment services on [mobile devices](/wiki/Mobile_devices). It operates in Singapore, Malaysia, Cambodia, Indonesia, Myanmar, the Philippines, Thailand, and Vietnam. The company was founded as MyTeksi by [Anthony Tan](/wiki/Anthony_Tan_(businessman)) and [Tan Hooi Ling](/wiki/Tan_Hooi_Ling) in 2012 to make taxi rides safer in Malaysia. By 2016, it was rebranded as Grab with an expansion of partnerships in Southeast Asia that coincided with the development of products for [couriers](/wiki/Courier). Grab is Southeast Asia's first [decacorn](/wiki/Decacorn) and the biggest technology [startup](/wiki/Startup_company) in the region. It became publicly traded on the [NASDAQ](/wiki/NASDAQ) in 2021, following the largest SPAC merger at the time. In 2023, *[Fast Company](/wiki/Fast_Company)* listed Grab amongst the most innovative companies in the Asia-Pacific region. ## History ### Founding and expansion The idea of creating a taxi-booking mobile app for Southeast Asia came from Anthony Tan ([Chinese](/wiki/Simplified_Chinese_characters): 陈炳耀; [Pe̍h-ōe-jī](/wiki/Pe%CC%8Dh-%C5%8De-j%C4%AB): *Tân Péng-iāu*; [pinyin](/wiki/Pinyin): *Chén Bǐngyào*) while he was at [Harvard Business School](/wiki/Harvard_Business_School). He launched the MyTeksi app in Malaysia in 2012 together with Tan Hooi Ling, another Harvard graduate. MyTeksi was started with an initial grant of US$25,000 from Harvard Business School and Tan's personal capital. GrabTaxi expanded to the Philippines in August 2013, and to Singapore and Thailand in October of the same year. In 2014, GrabTaxi further continued its growth and expansion to new countries: first launching in [Ho Chi Minh City](/wiki/Sai_Gon), [Vietnam](/wiki/Taxis_of_Vietnam), in February, and [Jakarta](/wiki/Jakarta) in Indonesia in June. In November 2014, GrabTaxi launched its first GrabBike service in [Ho Chi Minh City](/wiki/Ho_Chi_Minh_City) as a trial service. By 2015, GrabBike's motorcycle service rides had spread throughout Vietnam and Indonesia. In February 2015, the company launched GrabCar+ in the Philippines. In November 2015, Grab launched its GrabExpress courier service. ### Rebranding and additional services In January 2016, GrabTaxi was rebranded as \"Grab\" with a new, redesigned logo. In October 2016, Grab added an in-app instant messaging feature called \"GrabChat\" to allow simple communication between riders and drivers and translate messages if the set languages of the driver and passenger are different. In December 2016, it launched GrabShare taxi and car-sharing services. In February 2017, Grab launched the GrabCoach service for booking large passenger vehicles. In March 2017, Grab introduced GrabFamily for young children below 7 years old, to fulfill regulations where children under 1.35 metres must be placed on a child booster seat or child restraint. In April 2017, Grab confirmed the acquisition of Indonesian online payment startup Kudo which was integrated with Grab's payment system. In November 2017, Grab launched GrabPay payment service as a digital payment service among third-party merchants. In March 2018, Grab merged with [Uber](/wiki/Uber)'s Southeast Asian operations. As part of the acquisition, Grab took over Uber's assets and operations, including [Uber Eats](/wiki/Uber_Eats) operations in Malaysia, Singapore and Thailand, which led to Grab's expansion of food delivery services. Grab also launched their eScooter rental service known as GrabWheels in March 2018. Uber initially received a 27.5% stake in Grab as part of the deal; as of 2025, Uber holds a 13.71% stake, remaining the largest individual shareholder. In May 2018, Grab launched GrabFood food delivery service. In October 2018, Grab launched GrabExpress courier service. In 2018, Grab also launched Grab Financial, a financial arm of the company. In November 2018, Grab invested in Indonesian conglomerate Lippo Group's [Ovo](/wiki/OVO_(payment)) platform. In February 2019, the company launched GrabPet in Singapore which uses Grab drivers who have received training in pet handling and welcome animals in their vehicles. In April 2019, Grab launched its first [cloud kitchen](/wiki/Virtual_restaurant), GrabKitchen, in Indonesia under its food delivery service. 50 GrabKitchens were set up in six Southeast Asian countries within a year. Grab also launched their [super app](/wiki/Super-app) in April 2019 to consolidate its online services into one platform. The company partnered with [Microsoft](/wiki/Microsoft) to help people in Southeast Asia to access digital literacy programs and certificates in September 2019. In December 2019, Grab and [Mastercard](/wiki/Mastercard) launched the first numberless payment card in Asia, which was discontinued on 1 June 2024. In February 2020, Grab launched GrabCare for healthcare workers in Singapore, starting with 24-hour services to [Tan Tock Seng Hospital](/wiki/Tan_Tock_Seng_Hospital) and [National Centre for Infectious Diseases](/wiki/National_Centre_for_Infectious_Diseases). Grab also expanded its GrabMart and GrabAssistant services to more cities and countries to meet increased demand for online food and grocery deliveries. [Marriott International](/wiki/Marriott_International) partnered with Grab to cover about 600 restaurants and bars in Singapore, Indonesia, Malaysia, the Philippines, Vietnam and Thailand which would be added to the GrabFood delivery platform. In April 2020, top management salaries were cut by 20 percent and employees were encouraged to take up voluntary no-pay leave in an effort to manage costs during the [COVID-19 pandemic](/wiki/COVID-19_pandemic). In June 2020, Grab retrenched 360 employees, which was just under 5 percent of the total headcount across its Southeast Asia offices at the time. In November 2020, Grab announced the launch of its Tech Center in [Jakarta](/wiki/Jakarta), [Indonesia](/wiki/Indonesia) for micro, small and medium enterprises (MSMEs). In December 2020, Grab was granted a digital bank licence from [Singapore](/wiki/Singapore) together with [Singtel](/wiki/Singtel). ### Public listing and partnerships The [A.S. Watson Group](/wiki/A.S._Watson_Group) began partnering with Grab at the beginning of 2021 to expand in Southeast Asia. In March 2021, Grab partnered with the [Don Quijote](/wiki/Don_Quijote_(store)) discount store chain to deliver everyday goods such as food and cosmetics to customers in Southeast Asia. GrabPay formed a partnership with [Stripe](/wiki/Stripe,_Inc.) in May 2021 to include GrabPay Wallet as a payment option. In July 2021, Grab expanded its [buy now, pay later](/wiki/Buy_now,_pay_later) deferred payment options through a partnership with [Adyen](/wiki/Adyen). In November 2021, Grab partnered with [McDonald's](/wiki/McDonald%27s) in Singapore to integrate GrabExpress, GrabPay and GrabRewards with the restaurant's online and in-store ordering. The company acquired Malaysia's [Jaya Grocer](/wiki/Jaya_Grocer) by the end of 2021. Grab debuted on [Nasdaq](/wiki/Nasdaq) in December 2021 following a [SPAC](/wiki/Special-purpose_acquisition_company) with Altimeter Growth Corp. In March 2022, the company announced that GrabFood, GrabPay, GrabGifts and its delivery system would be introduced at [Starbucks](/wiki/Starbucks) in Thailand, Singapore, Malaysia, Indonesia, Vietnam, and the Philippines. In June 2022, the company introduced GrabMaps mapping and location technology for use in \"hyperlocal\" routes in Southeast Asian cities. Grab also announced a partnership with [Coca-Cola](/wiki/Coca-Cola) to increase each company's distribution network in the region. In August 2022, the company launched its digital bank business, GXS Bank. GXS owns one of the two Digital Full Bank license issued by [MAS](/wiki/Monetary_Authority_of_Singapore), and is backed by a consortium consisting of Grab Holdings based on regulatory requirements. In June 2023, Grab announced an 11 percent reduction of its workforce at the time. GrabCab received a 10-year street-hail operator licence from Singapore's [Land Transport Authority](/wiki/Land_Transport_Authority) in 2025. It became the sixth taxi operator in the country. Operations began in July that year. In April 2025, Grab released AI Merchant Assistant and AI Driver Companion, two [artificial intelligence](/wiki/Artificial_intelligence)-based tools developed in collaboration with [OpenAI](/wiki/OpenAI) and [Anthropic](/wiki/Anthropic). The former offers business insights to merchants while the latter provides [predictive analytics](/wiki/Predictive_analytics) related to high-demand areas and voice reporting to drivers, allowing them to report on road conditions. Grab had previously announced partnerships with autonomous vehicle developers including [Motional](/wiki/Motional) and [WeRide](/wiki/WeRide). Later that year, the company announced that it was working on a drone commercial delivery service in the Philippines. In July 2025, Grab piloted the first digital [cycle rickshaw](/wiki/Cycle_rickshaw) service in Vietnam known as Grab Cyclo. November 2025 marked an exciting month for Grab as the [Land Transport Authority](/wiki/Land_Transport_Authority) in Singapore granted approval for Grab and its partner [WeRide](/wiki/WeRide), to conduct Autonomous Vehicle (AV) testing with their entire Ai.R fleet of 11 AVs in the Punggol district. This service aims to connect residents to amenities such as the Punggol MRT Station, Punggol Coast Bus Interchange, malls and clinics. In January 2026, it was announced that Grab had acquired Infermove, a China-based developer of artificial intelligence–enabled robotics solutions, to support its first- and last-mile delivery operations. The company stated that Infermove’s technology would be further developed from Singapore, with a focus on exploring the use of autonomous robots to enhance delivery services; financial terms of the acquisition were not disclosed. Grab also announced the launch of a three-month drone delivery pilot in [Tanjong Rhu](/wiki/Tanjong_Rhu), Singapore, in order to improve efficiency of their food delivery service. The pilot was undergoing internal testing as of 7 January 2026. ## Funding Kee Lock Chua, a Managing Partner at Vertex Ventures Southeast Asia and India, was an early investor in Grab. He invested US$11.2m in Grab, and exited the investment in 2019. Grab's investors include venture and hedge funds, automobile companies and other ride-hailing firms. Investors include Japan's Softbank Group and MUFG, Booking Holdings, Toyota and Microsoft. The company has completed Series A through Series H funding, totaling billions of dollars. In January 2021, Grab Financial Group, the company's financial services unit, raised more than $300 million from [South Korea's Hanwha Asset Management](/wiki/Hanwha_Group). ## Driver issues Cases of Grab drivers harassing their customers and the [#MeToo movement](/wiki/MeToo_movement) in the United States and other countries have also recently emboldened women in [Indonesia](/wiki/Indonesia) to speak out against harassment by Grab drivers, such as when a driver asks for personal information or sends them unsolicited messages after a trip. On 23 September 2016, a female passenger in Singapore was sexually assaulted by an elderly GrabCar driver after she fell asleep during the ride. The driver was jailed for 16 months the following year. On 25 March 2017, a female passenger in Singapore was assaulted by a Grab driver. The driver was subsequently suspended by his taxi company from call bookings, although he was still allowed to pick up passengers on the streets. In May, a GrabCar driver in [Chiang Mai](/wiki/Chiang_Mai), Thailand was arrested for sexual assault. In response, Grab issued a statement and said it \"would not tolerate physical violence or verbal abuse\". Disputes have occurred between Grab drivers and local taxi operators as taxi drivers complained about a decline in their passenger numbers and income since Grab (and its competitor Uber) began to gain foothold on their areas. Until December 2016, around 65 assault cases towards GrabBike drivers by local taxibike drivers have been reported in Ho Chi Minh City, Vietnam. Much violence has erupted between Grab drivers and motorbike taxis in two major cities of [Hanoi](/wiki/Hanoi) and Ho Chi Minh City in Vietnam with another 47 assaults cases recorded in 2017. Grab drivers and passengers in Kuala Lumpur have also been the subject of harassment from local taxi drivers. On 4 March 2017, a drunk foreign man reportedly attacked a GrabCar driver in Singapore. The man was then arrested and jailed two weeks for his offence. On 26 October, a Grab driver was killed in [Pasay](/wiki/Pasay), Philippines by a suspect disguised as a legitimate passenger, who subsequently fled with the victim's vehicle and personal belongings. The suspect finally surrendered to police two weeks later and confessed that he accidentally killed the latter after the victim refused to give his money. In order to reduce the number of incidents between passengers and drivers, Grab has implemented a number of safety features. Grab installed an emergency button in the app in 2018. Later the same year, Grab rolled out a telematics program to encourage safe driving behaviour for its drivers. In 2019, Grab began asking passengers to take a selfie before riding for identify verification. ## Regulation In the Philippines, GrabCar was fully legalised after being accredited as a Transportation Network Company (TNC) by the [Land Transportation Franchising and Regulatory Board](/wiki/Land_Transportation_Franchising_and_Regulatory_Board_(Philippines)) (LTFRB) in 2015. In 2016, Grab motorbike taxi services of Grab and Uber were suspended on claims the services are breaking local rules and clashing with registered transport companies. Further crackdown on the services was continued in early 2017 when a Thai transport official asked the government to ban them although little efforts being done as both services have gain popularity among Thais and foreign visitors in the country. In 2019, it was reported that the Thai government is taking steps to legalise Grab taxi services. In 2021, the Thai government approved a draft ministerial regulation, allowing Grab to operate taxi services legally in the area. The regulation allows for vehicles containing up to seven seats which were registered as personal cars to also be used as taxis. In Singapore, laws that legalised the service were passed in February 2017. A few months later, the Land Transport Authority (LTA) in Singapore introduced a new regulation requiring private hire cars to have Private Hire Car Driver's Vocational Licence (PDVL) which took effect in July 2017. On 4 April 2017, the [Malaysian government](/wiki/Government_of_Malaysia) tabled amendments to existing transport laws that would regulate transport application services and protect drivers from harassment. Through the amendment, Grab and Uber vehicles were classified as public service vehicles as part of the move to legalise both services in its efforts to transform the country's public transport services. The amendments were passed by the [Parliament of Malaysia](/wiki/Parliament_of_Malaysia) on 28 July 2017, which directly legalised both services to operate in the country. In 2017, the Vietnamese [Ministry of Transport](/wiki/Ministry_of_Transport_(Vietnam)) set to review the legal status of both Grab and Uber to ensure a fair business environment for firms. A draft of a new circular was submitted in early 2018 that includes regulations for passenger transport (by car) through software such as Grab. In early 2020, a decree was passed to legalise Grab and other ride-hailing platforms in Vietnam. In Cambodia and Singapore, Grab supported local governments in traffic management and infrastructure development through its data and technology. In Malaysia, Grab has also received the support of the Malaysian Public Land Transport Commission (SPAD) when the government department introduced the use of technology using the GrabTaxi application to enhance the efficiency of taxi drivers in Malaysia. The company is working with the government department to improve the image of taxi drivers in the country by making it safer and more convenient to hail a taxi. - [Gojek](/wiki/Gojek) - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:07:29.700190",
  "title": "Grab Holdings",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Grab_Holdings"
}