{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:07:33.492580"
  },
  "content": "Postgraduate qualification A **graduate diploma** (**GradD**, **GDip**, **GrDip**, **GradDip**) is generally a qualification taken after completion of a [first degree](/wiki/Undergraduate_degree), although the level of study varies in different countries from being at the same level as the final year of a [bachelor's degree](/wiki/Bachelor%27s_degree) to being at a level between a [master's degree](/wiki/Master%27s_degree) and a [doctorate](/wiki/Doctorate). In some countries the graduate diploma and [postgraduate diploma](/wiki/Postgraduate_diploma) are synonymous, while in others (particularly where the graduate diploma is at undergraduate degree level) the postgraduate diploma is a higher qualification. ## Australia The graduate diploma is normally taken following a bachelor's degree, and some master's degree programs have graduate diploma as a nested (interim) award. The qualification is at level **8** of the [Australian Qualifications Framework](/wiki/Australian_Qualifications_Framework), the same as an [honours degree](/wiki/Honours_degree). This qualification is at the same level as the **post graduate diploma** qualifications awarded in New Zealand institutions and Australian graduate diplomas should not be confused with New Zealand graduate diplomas as they belong to two different qualification levels. ## Canada Graduate diplomas offered in Canada (French: *[Diplôme d'études supérieures spécialisées](/wiki/Dipl%C3%B4me_d%27%C3%A9tudes_sup%C3%A9rieures_sp%C3%A9cialis%C3%A9es_(Quebec))*) are typically taken following a bachelor's degree and a successful award allows progression to a master's degree. Depending on the institution, a graduate diploma in Canada may be at graduate level or bachelor's level. Similar courses at other Canadian institutions may be termed [postgraduate diplomas](/wiki/Postgraduate_diploma) at graduate level and [post-baccalaureate diploma](/wiki/Postbaccalaureate_program) at bachelor's level. ## Denmark In Denmark there are two forms of master's degree. The master's degree or candidatus is a FQ-EHEA second-cycle qualification worth 120 ECTS credits. These degrees are research-based and offered through universities (e.g. University of Copenhagen and Copenhagen Business School). The second form is the Graduate Diploma within the adult further education system, which is worth 60 ECTS credits and is taught part-time. The graduate diploma is normally taken following a bachelor's degree. Diplomas (in Danish: HD) are studied in business-related fields such as Business Administration and Innovation Management. Programs are normally split into Part 1 ([graduate certificate](/wiki/Graduate_certificate)) and Part 2 (graduate diploma), each being 60 ECTS Credits (one year of full-time-equivalent study). ## India In India the graduate diploma, comes one level before a [master's degree](/wiki/Master%27s_degree)–level qualification which are usually 3/4-year specialized programs. Certain institutes provide master's level programs with an increased number of lower credit courses for two years. At times, for transnational equivalency, these degrees are referred to as graduate diplomas. Advanced diplomas provided are equivalent to a [post-baccalaureate diploma](/wiki/Postbaccalaureate_program); these are equivalent to a one to three-year course. ## Ireland In Ireland, the graduate diploma or post-graduate diploma is a level 9 award on the National Framework of Qualifications (NFQ) which is the same level as a masters degree. The [higher diploma](/wiki/Higher_diploma) is an award at level 8, the same level as an [honours](/wiki/Honours_degree) bachelor's degree. These programmes generally consist of one year of full-time study and are usually taken after, and/or in a different subject from, an earlier bachelor's degree. A wide variety of courses are offered; it is also possible to progress to a [master's degree](/wiki/Master%27s_degree). The diploma is generally in two forms: - A reorientation type qualification to [reskill](/wiki/Reskilling) a graduate with new specialised skills, for instance the *HDipStats - Higher Diploma in Statistics* is aimed at offering additional skills in [statistics](/wiki/Statistics). See also [Higher Diploma](/wiki/Higher_Diploma). - A professional type qualification which is necessary to enter a profession, for instance the HDipEd - Higher Diploma in Education allows a person to register and practice [teaching](/wiki/Teaching). See also [Postgraduate Diploma](/wiki/Postgraduate_Diploma). The graduate diploma (GradDip) is offered by [University College Dublin](/wiki/University_College_Dublin), the [Technological University Dublin](/wiki/Technological_University_Dublin), [Dublin City University](/wiki/Dublin_City_University), [HETAC](/wiki/Higher_Education_and_Training_Awards_Council), the [University of Limerick](/wiki/University_of_Limerick), and the [Atlantic Technological University](/wiki/Atlantic_Technological_University). The [higher diploma](/wiki/Higher_diploma#Ireland) (HDip) is offered by [HETAC](/wiki/Higher_Education_and_Training_Awards_Council), [NUI](/wiki/National_University_of_Ireland) institutions, and [Trinity College, Dublin](/wiki/Trinity_College,_Dublin). ## Malaysia The graduate diploma forms part of the [lifelong education](/wiki/Lifelong_learning) pathway on the [Malaysian Qualifications Framework](/wiki/Malaysian_Qualifications_Framework). They are qualifications at the level of a bachelor's degree but with half of the credit value. ## New Zealand In New Zealand, a graduate diploma is an advanced undergraduate qualification normally completed after a bachelor's degree or done at the same time as the bachelors study, and can be used as a bridging qualification to prove a student's ability to undertake postgraduate studies for a completely different field. A graduate diploma (e.g., Graduate Diploma in Education etc.) is different from a [postgraduate diploma](/wiki/Postgraduate_diploma), which is a course of study at [postgraduate](/wiki/Postgraduate) level (e.g., Postgraduate Diploma in Clinical Psychology etc.). In universities and learning institutes, a graduate diploma is commonly studied by students who have already graduated in a different field and allows them to pursue a new profession. It mainly involves undertaking courses in an accelerated undergraduate level (e.g., normally a mixture of second and third year courses from the bachelor's degree) in order for the student to attain the requirements equivalent to a student who studied towards an undergraduate degree. ## Singapore A Graduate Diploma offered by Singapore's [autonomous universities](/wiki/Autonomous_university#Singapore) is a postgraduate qualification that generally requires a [Bachelor's degree](/wiki/Bachelor%27s_degree) for entry. It is designed to provide specialised knowledge and skills in a specific field of study, often to enhance professional expertise or prepare for further academic pursuits. Typically, these programs last for about one year of full-time study or up to 18 months part-time. For example, [NUS](/wiki/National_University_of_Singapore) offers Graduate Diplomas in areas like Public Health, Systems Analysis, Maritime Law & Arbitration, Medicine fields, and Arts & Social Sciences fields. [NTU](/wiki/Nanyang_Technological_University) offers Graduate Diploma in fields like Sports Medicine. [SUSS](/wiki/Singapore_University_of_Social_Sciences) offers a range of Graduate Diplomas, including in fields like Management, Analytics and Visualisation, among others, with 30 academic credit units from these diplomas often being stackable towards a relevant SUSS [Master's degree](/wiki/Master%27s_degree). A WSQ Graduate Diploma is a high-level qualification under the Singapore's [Workforce Skills Qualifications](/wiki/Workforce_Skills_Qualifications) (WSQ) system, a national framework for training, developing, assessing, and certifying workforce skills and competencies. These diplomas are typically offered through bite-sized training modules, allowing individuals to learn at their own pace. Upon completing each module, participants receive a Statement of Attainment (SOA). Accumulating the relevant SOAs leads to the achievement of a WSQ Graduate Diploma. As WSQ Graduate Diplomas are not postgraduate qualifications offered by Singapore's [autonomous universities](/wiki/Autonomous_university), they do not include academic units that can be stackable towards a [Master's degree](/wiki/Master%27s_degree). Graduate Diplomas are also offered at various academic levels by Singapore's [private education institutes](/wiki/Committee_for_Private_Education) (PEI), and these diplomas are generally awarded by the PEI or overseas universities. Graduate Diplomas awarded by overseas universities follow their countries' education system. ## United Kingdom In the UK, a graduate diploma is a short course, with a value of 80–120 [UK credits](/wiki/Credit_Accumulation_and_Transfer_Scheme) (equivalent to 40–60 [ECTS credits](/wiki/ECTS_credits)), that is normally studied by students who have already graduated in another field. Graduate diplomas are distinguished from [graduate certificates](/wiki/Graduate_certificate#UK) by having a longer period of study, equivalent to two thirds of an academic year or more. Until the 1990s, the British conservatoires of music offered three year undergraduate courses to some of their students, leading the award of the Graduate Diploma, e.g. [GRSM](/wiki/GRSM), [GTCL](/wiki/GTCL), equivalent to a university first degree in music. When a number of conservatoires became affiliated to or constituent colleges of universities, the graduate diplomas were gradually replaced by the award of the BMus degree to all successful students. A graduate diploma should not be confused with a [postgraduate diploma](/wiki/Postgraduate_diploma), which is a [master's degree](/wiki/Master%27s_degree)-level qualification in the UK. Historically, this has not always been the case, with postgraduate diploma and graduate diploma used interchangeably, but the [Quality Assurance Agency](/wiki/Quality_Assurance_Agency) now makes a clear distinction between these titles. Some institutions have renamed courses as a result, e.g. [The College of Law](/wiki/University_of_Law) renamed the official title for its [law conversion course](/wiki/Law_conversion_course) from *Postgraduate Diploma in Law* to *Graduate Diploma in Law* as, although the law conversion course is studied postgraduately, the contents of the course are only [undergraduate](/wiki/Undergraduate) in nature. In 2018, the [Royal College of Art](/wiki/Royal_College_of_Art) launched a new Graduate Diploma in Art and Design programme aimed at preparing graduate students for its master's degree programmes in Art and Design. ## United States In the US, graduate diplomas are \"Intermediate Graduate Qualifications\" involving study beyond master's level but not reaching [doctoral](/wiki/Doctorate) level. They are generally found in professional, rather than academic, fields. Other qualifications at this level include advanced graduate certificates, specialist certificates and [specialist degrees](/wiki/Specialist_degree). - [Graduate certificate](/wiki/Graduate_certificate) - [Certificate of Advanced Study](/wiki/Certificate_of_Advanced_Study)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:07:33.492120",
  "title": "Graduate diploma",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Graduate_diploma"
}