{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:07:35.433636"
  },
  "content": "Online food ordering company in SingaporeThis article **may have been created or edited in return for undisclosed payments**, a violation of Wikipedia's terms of use. It may require cleanup to comply with Wikipedia's content policies, particularly neutral point of view. *(March 2020)* **Grain** is an [online food ordering](/wiki/Online_food_ordering) company that offers online [catering](/wiki/Catering) and food delivery services to the [Singapore](/wiki/Singapore) market through its website and mobile application. ## History Grain was jointly founded in 2013 by four co-founders — Yong Yi Sung, Ernest Sim, Gao Rifeng, and Isaac Tan — and initially launched as a personalized meal [subscription service](/wiki/Subscription_service). In May 2014, it was relaunched as an on-demand service that allows customers to order for same-day delivery in [Marina Bay](/wiki/Marina_Bay,_Singapore). The new on-demand service was designed to better meet customer needs by allowing them to order any number of items in a certain time frame. The order would then be delivered to the customer. As of 2016, delivery is available to any location in Singapore. ## Funding and growth In January 2016, Grain secured an estimated SG$2.45 million (US$1.70million) in a series A funding round led by Openspace Ventures (formerly NSI Ventures). Other initial investors included [500 Startups](/wiki/500_Startups), Digital Media Partners, and Thai Express founder Ivan Lee. In December 2016, the company raised an undisclosed amount in pre-series B funding in another round also led by Openspace Ventures. This round included existing investors DMP and Ivan Lee while also gaining the support of Wee Teng Wen of the Lo & Behold Group. At the same time, Grain also raised an undisclosed amount in venture debt from [DBS Bank](/wiki/DBS_Bank) In this same year, the four co-founders of Grain were featured in the 2016 edition of [Forbes 30 under 30](/wiki/Forbes_30_under_30) In 2017, while planning for its next funding round, Grain stated explained that it had tripled its investment in technology, growing 330 per cent in sales as a result. These decisions improved gross profits by more than 10 per cent. In February 2018, Grain secured another undisclosed sum from investors that included Majuven, a venture capital fund founded by [Lee Hsien Yang](/wiki/Lee_Hsien_Yang). In the Series B funding round led by Thailand's Singha Ventures, Grain raised US$10 million to improve existing infrastructure and expand to other Asian cities, beginning with Bangkok. According to a study conducted by The Straits Times and [Statista](/wiki/Statista), the 2019 funding round and business growth have made Grain fifth among Singapore's fastest-growing companies. In 2020, Grain was on the list of LinkedIn Top Startups 2020 reveals 10 young companies that are emerging, or have remained resilient, amid the time of Covid-19. ## Hygiene lapse On 15 May 2017, Grain experienced a lapse in hygiene that caused 20 customers to become affected with [gastroenteritis](/wiki/Gastroenteritis). After an internal investigation, the lapse was found to be caused by a reduction in simmer time for their Thai Green Curry dish, a change which resulted in the dish “spoiling quicker than usual”. The NEA responded by adjusting Grain's food hygiene from “A” to “C”. Yong Yi Sung, Grain's CEO, released a statement of apology, explaining that when the issue was discovered, the dish was removed to avoid further harm. To rectify the issue, Grain worked closely with the NEA, the Ministry of Health, and the [Agri-Food and Veterinary Authority of Singapore](/wiki/Agri-Food_and_Veterinary_Authority_of_Singapore), and as of August 2019, it has regained the \"A\" grade for food hygiene. - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:07:35.433161",
  "title": "Grain (company)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Grain_(company)"
}