{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:07:37.415366"
  },
  "content": "Asian venture capital firm **Granite Asia** is an Asian [venture capital](/wiki/Venture_capital) firm that is headquartered in [Singapore](/wiki/Singapore). It was formed in 2024 after [GGV Capital](/wiki/GGV_Capital) split up its Asia and U.S. operations. ## Background In July 2023, the [United States House Select Committee on Strategic Competition between the United States and the Chinese Communist Party](/wiki/United_States_House_Select_Committee_on_Strategic_Competition_between_the_United_States_and_the_Chinese_Communist_Party) initiated an investigation into [GGV Capital](/wiki/GGV_Capital) and other venture-capital firms' investments in China. In September 2023, GGV Capital announced it would split its business into two with one focused on Asia and the other focused on the U.S. The Asian business would be headquartered in Singapore and would focus on China, Southeast Asia and South Asia. GGV's yuan-denominated funds would continue to be managed independently under its Chinese brand Jiyuan Capital. This option allowed investors who still felt confident about China to continue investing while those who didn't had the option of choosing the U.S. focused business. In March 2024, GGV Capital officially split into two firms, Granite Asia which would focus on Asian investments and Notable Capital which would focus on U.S. investments. The decision to abandon the GGV brand was that because both teams were operating separately going forward and felt it was best to develop new brands. The legacy GGV Capital funds focused on Asia would continue operating under the two firms. Granite Asia stated it would establish a [private credit](/wiki/Private_credit) business in the year as well as expand into other asset classes and markets in Asia. It would also explore a hybrid method of funding that was a mixture of equity and debt. In November 2024, Granite Asia received a mandate from the [Indonesia Investment Authority](/wiki/Indonesia_Investment_Authority) to invest $1.2 billion in domestic technology companies. In January 2025, it was reported Granite Asia would be seeking $500 million for its hybrid strategy with the fund's name being Libra Hybrid Capital. - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:07:37.414751",
  "title": "Granite Asia",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Granite_Asia"
}