{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:07:39.765475"
  },
  "content": "Asian jelly-like dessert **Grass jelly**, also known as **leaf jelly** or **herbal jelly**, is a [jelly-like](/wiki/Gelatin) dessert originating in [China](/wiki/China). It is commonly consumed in [East Asia](/wiki/East_Asia) and [Southeast Asia](/wiki/Southeast_Asia). It is created by using [Chinese mesona](/wiki/Platostoma_palustre) (a member of the [mint family](/wiki/Mint_family)) and has a mild, slightly bitter taste. Grass jelly was invented by the [Hakka people](/wiki/Hakka_people) who historically used the food to alleviate heat stroke after long days working in the field. The dish was introduced to Southeast Asia by the [Chinese diaspora](/wiki/Overseas_Chinese). It is served chilled, with other toppings, such as fruit, or in [bubble tea](/wiki/Bubble_tea) or other drinks. Outside Asia, it is sold in [Asian supermarkets](/wiki/Asian_supermarkets). ## Nutritional value Grass jelly has 8.2 calories per serving of 20g, containing 1.3g of carbohydrates, 0.8g of protein, 2.2mg of sodium, and 4.8mg of potassium. ## Preparation Grass jelly is made by boiling the aged and slightly oxidized stalks and leaves of *[Platostoma palustre](/wiki/Platostoma_palustre)* (*Mesona chinensis*) with [potassium carbonate](/wiki/Potassium_carbonate) and a little starch for several hours. The liquid cools to a jelly-like consistency, and this jelly can be cut into cubes or other shapes. The jelly is then mixed with syrup to produce a drink or dessert thought to have cooling ([*yin*](/wiki/Yin_and_yang)) properties, suitable for hot weather. The jelly itself is fragrant with a smoky undertone and is a translucent dark brown or black. Food coloring may sometimes be added to make it darker. Preparation of other variants, known as green grass jelly, requires no cooking or heating process and uses only a mixture of leaf extracts and water. Jelly produced in this way has been described as having a leafy, neutral flavor. ## Regional ### Mainland China, Hong Kong and Macau In China, grass jelly is considered a signature dish of the Hakka people. The name 仙草粿 (xiāncǎo guǒ) may be used for its specificity, and it translates closely to \"grass jelly\" in English. Although the dish is known by multiple regional names. It is sometimes called *liangfen* (*leung fan*) in Chinese, particularly in [Cantonese](/wiki/Cantonese) speaking regions, but it should not be confused with the Chinese starch jelly *[liangfen](/wiki/Liangfen)*, which is an entirely different dish. In Mainland China, Hong Kong and Macau, grass jelly was traditionally served with sugar syrup. Now it is often served mixed with other ingredients, such as [mango](/wiki/Mango), [sago](/wiki/Sago), [watermelon](/wiki/Watermelon), [cantaloupe](/wiki/Cantaloupe), and other fresh or canned fruit, and condensed or evaporated milk. ### Taiwan In [Taiwan](/wiki/Taiwan), grass jelly is known as 仙草 (sian-chháu), and is used in various desserts and drinks. It can sometimes be added to [boba](/wiki/Bubble_tea) drinks and [shaved ice](/wiki/Shaved_ice) (刨冰). It is also commonly used in a traditional Taiwanese dessert where the jelly is melted to be consumed as a thick pudding-like dessert (燒仙草), with numerous toppings like [tangyuan](/wiki/Tangyuan_(food)), [taro balls](/wiki/Taro_ball), [azuki beans](/wiki/Azuki_beans), and [tapioca](/wiki/Tapioca). The plant is also made into mesona tea (仙草茶). ### Indonesia Grass jelly is known as *cincau* in Indonesian, which is derived from the [Amoy](/wiki/Xiamen) [Hokkien](/wiki/Hokkien) word 清草 (*chhin chháu*). It is also known as *camcao*, *juju*, *janggelan*, or *kepleng* in [Javanese](/wiki/Javanese_language), *camcauh* in [Sundanese](/wiki/Sundanese_language), and *daluman* in [Bali](/wiki/Bali). Black jelly (*cincau hitam*) is manufactured as an instant powder, like other instant jellies or agar. This form is easier to use. It is made from the leaves of *[Platostoma palustre](/wiki/Platostoma_palustre)* (*Mesona palustris*). There are other plants that were used in Indonesia to make grass jelly. They are *[Melastoma polyanthum](/wiki/Melastoma_polyanthum)*, known as *cincau perdu*,[*failed verification*] and *[Cyclea barbata](/wiki/Cyclea_barbata)*, known as *cincau hijau* or green grass jelly, and *[Cocculus orbiculatus](/wiki/Cocculus_orbiculatus)* or known as *cincau Cina* or Chinese green grass jelly. Some plants from genus *[Stephania](/wiki/Stephania)* such as *[Stephania hernandifolia](/wiki/Stephania_japonica)* (also known as *Stephania japonica*) and *[Stephania capitata](/wiki/Stephania_capitata)* are also used as substitutes to create green grass jelly called *cincau minyak* or oily grass jelly. Usually, the process of making Indonesian green grass jelly does not require a cooking or heating process. Mixing leaf extract and water with the addition of a period of waiting time for coagulation at mild room temperature is enough. Indonesian green grass jelly has a distinct flavor compared to black grass jelly. It is absent of smoky flavor, almost no bitter taste, and has a mild leafy flavor. Due to its plain neutral flavor, it is usually consumed with sugar water, syrup, coconut milk, and ice. ### Malaysia, Singapore and Brunei Plain grass jelly is mixed in various kinds of desserts, such as *[ais kacang](/wiki/Ais_kacang)* and *[cendol](/wiki/Cendol)*. It is also mixed with cold [soy milk](/wiki/Soy_milk) and served as a refreshing drink/dessert, a drink known as [Michael Jackson](/wiki/Michael_Jackson) in South-East Asia (a reference to Michael Jackson's changing skin color and/or the song \"[Black or White](/wiki/Black_or_White)\"). Various combinations of grass jelly with rose flavoured syrup added to milk ([bandung](/wiki/Bandung_(drink))) are called \"bandung cincau\" or \"bancau\" for short. There is also shaved ice with grass jelly toppings. It can be green or brown. ### Philippines Grass jelly ([Philippine](/wiki/Standard_Philippine_language): *gulaman*) bricks are used in the various [Philippine](/wiki/Philippine_cuisine) refreshments or desserts such as *sago’t gulaman*, *buko-pandan*, agar [flan](/wiki/Cr%C3%A8me_caramel) or *[halo-halo](/wiki/Halo-halo)*. It may be used in fruit salads or eaten with milk or tea. ### Thailand In [Thailand](/wiki/Thailand), grass jelly is known as *chaokuai* ([Thai](/wiki/Thai_language): เฉาก๊วย, pronounced [t͡ɕʰǎw.kúa̯j]) derived from Teochew ([Chinese](/wiki/Chinese_language): 草粿, [Pe̍h-ōe-jī](/wiki/Pe%CC%8Dh-%C5%8De-j%C4%AB): *tsháu-kué*). It is commonly served relatively plain together with ice and [natural brown sugar](/wiki/Natural_brown_sugar). Additionally, it can also be served with fruits such as [jackfruit](/wiki/Jackfruit), the fruit of the [toddy palm](/wiki/Borassus_flabellifer) or mixed with other Thai desserts. ### Vietnam In [Vietnamese](/wiki/Vietnamese_language), grass jelly is called *sương sáo* or *thạch sương sáo* and the name is also derived from Teochew ([Chinese](/wiki/Chinese_language): 仙草, [Peng'im](/wiki/Peng%27im): siêng1 cao2). Grass jelly is chopped in small cubes and served as an additional ingredient in sweet desserts made from various kinds of beans (*[chè](/wiki/Ch%C3%A8)*). There are two common kinds of grass jelly in [Vietnam](/wiki/Vietnam) which are *[Platostoma palustre](/wiki/Platostoma_palustre)* (*Mesona chinensis*, called *sương sáo* in Vietnamese) and *[Tiliacora triandra](/wiki/Tiliacora_triandra)* (called *sương sâm*; *sương sa* or *rau câu* is the name for jelly made from various kinds of [algae](/wiki/Algae)). It is common now to eat green grass jelly (thạch lá găng) with douhua (tào phớ) and grass jelly (sương sáo or thạch đen) in the summer. ### Mauritius In [Mauritius](/wiki/Mauritius), the grass jelly is cut into cubes and is added into water and sugar or in syrup water to make a cold drink called \"mousse noir\" which is literally translated as \"black jelly\" in English. Mousse noir is of Chinese origin and is a reflection of the [Sino-Mauritian](/wiki/Mauritians_of_Chinese_origin) influence on the [Mauritian cuisine](/wiki/Cuisine_of_Mauritius). The mousse noir is well-known and well-appreciated by [Mauritians](/wiki/Mauritians). It can be made at home, or it can be purchased in local supermarkets where it is widely accessible. Mousse noir is also manufactured by local Mauritian companies, and can be found in the original flavour or can come in different flavours such as [coffee](/wiki/Coffee), [aloe vera](/wiki/Aloe_vera), and [melon](/wiki/Melon). - [Aiyu jelly](/wiki/Aiyu_jelly) - [Mesona](/wiki/Mesona) - [Guilinggao](/wiki/Guilinggao) - [Liangfen](/wiki/Liangfen) - [Jidou liangfen](/wiki/Jidou_liangfen) - [List of Chinese desserts](/wiki/List_of_Chinese_desserts) - [List of desserts](/wiki/List_of_desserts) - Adams, Allison (28 April 2015). \"Fact About Grass Jelly\". *LIVESTRONG.COM*. [Leaf Group](/wiki/Leaf_Group). Archived from the original on 31 August 2017. Portals: - Food - Drink - China - Indonesia - Malaysia - Singapore - Taiwan\n",
  "language": "en",
  "processed_at": "2026-01-12T11:07:39.764922",
  "title": "Grass jelly",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Grass_jelly"
}