{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:07:43.478740"
  },
  "content": "Planning area in Singapore The **Greater Southern Waterfront** is a future waterfront development project sited within the planning area of [Bukit Merah](/wiki/Bukit_Merah), Singapore. At present, the area is occupied by the Tanjong Pagar and Brani terminals of the [Port of Singapore](/wiki/Port_of_Singapore), which will be moved to the [Tuas mega port](/wiki/Port_of_Singapore) by 2027. In 2013, Prime Minister [Lee Hsien Loong](/wiki/Lee_Hsien_Loong), announced that container port activities will be relocated from Tanjong Pagar, Keppel, Pulau Brani and Pasir Panjang to a consolidated port in Tuas. The relocation will release about 1,000 hectares of land and will be used for the development of the Greater Southern Waterfront. ## Timeline 1. Since 2021, the former Keppel Golf Course site has been in the midst of being redeveloped into a residential neighbourhood with 9,000 HDB and private housing units, featuring waterfront promenades, greenery, and open spaces. Two old power stations in Pasir Panjang will also be repurposed as recreational and nightlife hubs. 2. After the relocation of Tanjong Pagar, Keppel and Brani terminals to Tuas by 2027, Pulau Brani will be developed in line with Sentosa. New attractions similar to Universal Studios Sentosa are planned here. Plans are underway to rejuvenate Sentosa's beaches and enhance its nature and heritage trails. 3. Once Pasir Panjang Port relocates in 2040, mixed-use developments will be built at this location. 1°16′05″N 103°50′13″E﻿ / ﻿1.268°N 103.837°E﻿ / 1.268; 103.837 This [Singapore](/wiki/Singapore) location article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:07:43.478266",
  "title": "Greater Southern Waterfront",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Greater_Southern_Waterfront"
}