{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:07:41.440715"
  },
  "content": "Singaporean insurance company **Great Eastern Life Assurance Co. Ltd**, often known as **Great Eastern Life** or simply **Great Eastern**, is a [Singaporean](/wiki/Singapore) [multinational](/wiki/Multinational_corporation) insurance company and subsidiary of [Oversea-Chinese Banking Corporation](/wiki/OCBC_Bank) (OCBC) operating in the [Southeast Asia](/wiki/Southeast_Asia) region. Founded in 1908 by Alfred Hewton Fair, it is the largest and oldest [life insurance](/wiki/Life_insurance) company in Singapore and [Malaysia](/wiki/Malaysia). In 2006, the company had assets in excess of [S$](/wiki/Singapore_dollar)8 billion, 2.6 million policies in force served by 24 branch offices and a service network of more than 17,000 agents nationwide. In August 2007, it had S$45 billion in assets and 3 million policyholders. In 2020, the company's website stated that it has over S$90 billion in assets and over 8 million policyholders, including 5 million from government schemes. It has three distribution channels—a tied agency force, [bancassurance](/wiki/Bancassurance), and financial advisory firm, Great Eastern Financial Advisers. It is the only life insurance company to be listed on the [Singapore Exchange](/wiki/Singapore_Exchange) (SGX), and the largest insurance company in Southeast Asia in terms of assets and [market capitalisation](/wiki/Market_capitalisation). In October 2024, OCBC upped its stake in insurance arm Great Eastern Holdings to 93.72% after making a privatisation bid for the insurer. ## History ### 1908–1920: Early years Incorporated on 26 August 1908 in Singapore, Great Eastern has claimed to be the oldest and most established life insurance company in Singapore. ### 1920–2004: International expansion In 1920, Great Eastern Life Assurance (Malaysia) Berhad started as a subsidiary branch office of Great Eastern Life Assurance Co Ltd. in Singapore. In November 1999, Great Eastern Life underwent restructuring to become a wholly owned life insurance arm of a financial holding company – Great Eastern Holdings Ltd. This was followed by a merger between Great Eastern Holdings and Overseas Assurance Corporation in December 2000. In June 2004, Great Eastern Holdings became a substantially owned subsidiary of OCBC Bank, Singapore's longest established local bank. OCBC Bank has assets of S$164 billion and a network of 390 branches and representative offices in 15 countries and territories including Singapore, Malaysia, Indonesia, Thailand, Vietnam, China, Hong Kong SAR, Taiwan, Brunei, Myanmar, Japan, Korea, Australia, United Kingdom and the United States. This network includes more than 280 branches and offices in Indonesia operated by OCBC Bank's subsidiary, [Bank OCBC NISP](/wiki/Bank_OCBC_NISP). OCBC Bank and its banking subsidiaries offer specialist financial services, from consumer, corporate, investment, private and transaction banking to treasury and stockbroking services. In addition to Singapore where Great Eastern is headquartered, and Malaysia with 29 branches, Great Eastern also has a branch office in [Brunei](/wiki/Brunei) since 1975, a subsidiary company in [Indonesia](/wiki/Indonesia) since 1996, and a representative office in [Myanmar](/wiki/Myanmar). ### Modern era In May 2006, Great Eastern and Chongqing Land Properties Group set up their 50:50 joint venture life insurance company, Great Eastern Life Assurance (China) Co Ltd. This new company is headquartered in [Chongqing](/wiki/Chongqing) with branches in [Shaanxi](/wiki/Shaanxi) and [Sichuan](/wiki/Sichuan), which will act as a bridgehead for its expansion plans into the rest of China. In August 2012, Great Eastern Holdings Limited sold 25% stake of its equity interest in Great Eastern Life Assurance (China) Co Ltd to Chongqing City Construction Investment (Group) Co Ltd for a total sum of ¥303 million [RMB](/wiki/Renminbi). Upon completion of the deal, Great Eastern Life Assurance (China) Co Ltd was renamed Zhong Xin Ancheng Life Insurance Co. Ltd. Great Eastern was named Life Insurance Company of the Year at the Asia Insurance Industry Awards in 2011 and 2013, by Asia Insurance Review. In 2025, Great Eastern proposed to delist from [SGX](/wiki/Singapore_Exchange) after its largest stakeholder OCBC sent a S$900 million offer to buy all the rest of the stakes. Portals: - Singapore - Companies\n",
  "language": "en",
  "processed_at": "2026-01-12T11:07:41.440239",
  "title": "Great Eastern Life",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Great_Eastern_Life"
}