{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:07:47.690172"
  },
  "content": "This article is part of a series on[Politics of Singapore](/wiki/Politics_of_Singapore)[Constitution](/wiki/Constitution_of_Singapore) - [Law](/wiki/Law_of_Singapore) - [Human rights](/wiki/Human_rights_in_Singapore) [Legislature](/wiki/Parliament_of_Singapore) - **[Parliament](/wiki/Parliament_of_Singapore)** - [Speaker](/wiki/Speaker_of_the_Parliament_of_Singapore) [Seah Kian Peng](/wiki/Seah_Kian_Peng) ([PAP](/wiki/People%27s_Action_Party)) - [Leader of the House](/wiki/Leader_of_the_House_(Singapore)) [Indranee Rajah](/wiki/Indranee_Rajah) ([PAP](/wiki/People%27s_Action_Party)) - [Leader of the Opposition](/wiki/Leader_of_the_Opposition_(Singapore)) [Pritam Singh](/wiki/Pritam_Singh_(Singaporean_politician)) ([WP](/wiki/Workers%27_Party_(Singapore))) - [14th Parliament](/wiki/14th_Parliament_of_Singapore) - [Constituencies](/wiki/Constituencies_of_Singapore) [Executive](/wiki/Government_of_Singapore#Composition) - **[President of Singapore](/wiki/President_of_Singapore)** ([list](/wiki/List_of_presidents_of_Singapore)) - [Tharman Shanmugaratnam](/wiki/Tharman_Shanmugaratnam) ([I](/wiki/Independent_politician)) - **[Prime Minister of Singapore](/wiki/Prime_Minister_of_Singapore)** - [Lawrence Wong](/wiki/Lawrence_Wong) ([PAP](/wiki/People%27s_Action_Party)) - [Cabinet](/wiki/Cabinet_of_Singapore) - [Ministries](/wiki/Organisation_of_the_Government_of_Singapore) - [The Reserves](/wiki/Reserves_of_the_Government_of_Singapore) [Judiciary](/wiki/Judicial_system_of_Singapore) - **[Supreme Court of Singapore](/wiki/Supreme_Court_of_Singapore)** - [Chief Justice](/wiki/Chief_Justice_of_Singapore) [Sundaresh Menon](/wiki/Sundaresh_Menon) - **[Court of Appeal](/wiki/Court_of_Appeal_of_Singapore)** - [Prakash](/wiki/Judith_Prakash) - [Tay](/wiki/Tay_Yong_Kwang) - [Chong](/wiki/Steven_Chong) - [Ang](/wiki/Belinda_Ang) - **[High Court](/wiki/High_Court_of_Singapore)** - [State Courts](/wiki/State_Courts_of_Singapore) [Elections](/wiki/Elections_in_Singapore) - [Presidential elections](/wiki/Presidential_elections_in_Singapore) - [General elections](/wiki/General_elections_in_Singapore) Singapore portal - [Other countries](/wiki/Outline_of_political_science#Politics_by_region) - v - t - e A **group representation constituency**[note 1] (**GRC**) is a type of electoral division or [constituency](/wiki/Constituencies_of_Singapore) in [Singapore](/wiki/Singapore) in which teams of candidates, instead of individual candidates, compete to be elected into [Parliament](/wiki/Parliament_of_Singapore) as the [Members of Parliament](/wiki/Members_of_the_Singapore_Parliament) (MPs) for the constituency. Synonymous to the [party block voting](/wiki/Party_block_voting) (PBV) or the general ticket used in other countries, the [Government](/wiki/Government_of_Singapore) stated that the GRC scheme was primarily implemented to enshrine minority representation in Parliament: at least one of the MPs in a GRC must be a member of the [Malay](/wiki/Malays_in_Singapore), [Indian](/wiki/Indians_in_Singapore) or another minority community of Singapore. In addition, it was economical for town councils, which manage [public housing estates](/wiki/Public_housing_in_Singapore), to handle larger constituencies. The GRC scheme came into effect on 1 June 1988, and was first introduced at the [general election that same year](/wiki/1988_Singaporean_general_election). Prior to that date, all constituencies were [Single Member Constituencies](/wiki/Single-member_district) (SMCs). The Parliamentary Elections Act (Cap. 218, 2008 Rev. Ed.) (\"PEA\") states that there must be at least eight SMCs, and the number of MPs to be returned by all GRCs cannot be less than a quarter of the total number of MPs. Within those parameters the total number of SMCs and GRCs in Singapore and their boundaries are not fixed but are decided by the [Cabinet](/wiki/Cabinet_of_Singapore), taking into consideration the recommendations of the Electoral Boundaries Review Committee. Per the [Constitution](/wiki/Constitution_of_Singapore) and the PEA, there must be between three and six MPs in a GRC. The number of MPs in each GRC is declared by the [President](/wiki/President_of_Singapore) at the Cabinet's direction before a [general election](/wiki/Parliamentary_elections_in_Singapore). As of the latest [2025 general election](/wiki/2025_Singaporean_general_election), there were 14 SMCs, 8 four-member GRCs and 10 five-member GRCs, totalling 97 MPs. Reception towards to the GRC system is mixed, with some critics disagreeing with the government's justifications for introducing the scheme, noting that the proportion of minority MPs per GRC has rather decreased with the advent of five-member and six-member GRCs, although the latter was not present since the 2020 general election. In addition, the ruling [People's Action Party](/wiki/People%27s_Action_Party) (PAP) has been described as using GRCs as a means of bringing in politically inexperienced candidates into Parliament by \"[riding on the coattails](/wiki/Coattail_effect)\" of GRCs helmed by senior politicians, particularly [Cabinet members](/wiki/Cabinet_of_Singapore) who are deployed to each incumbent PAP-held GRC, as \"anchor ministers\". Moreover, the GRC scheme is also noted to particularly disadvantage opposition parties, by raising the threshold to find sufficient candidates with the political expertise and capability to contest GRCs. Furthermore, it is said that the GRC scheme means that electors may have unequal voting power, weakens the relationship between electors and MPs, and entrenches racialism in [Singapore politics](/wiki/Politics_of_Singapore) due to its emphasis on minority representation. ## History There are two types of [electoral division](/wiki/List_of_Singaporean_electoral_divisions) or [constituency](/wiki/Constituencies_of_Singapore) in [Singapore](/wiki/Singapore): the [single member constituency](/wiki/Single-member_district) (SMC) and the group representation constituency (GRC). In a GRC, a number of candidates comes together to stand for [elections](/wiki/Parliamentary_elections_in_Singapore) to [Parliament](/wiki/Parliament_of_Singapore) as a group. Each voter of a GRC casts a ballot for a team of candidates, and not for individual candidates. The GRC scheme was brought into existence on 1 June 1988 by the Constitution of the Republic of Singapore (Amendment) Act 1988 and the Parliamentary Elections (Amendment) Act 1988. The original stated purpose of GRCs was to guarantee a minimum representation of minorities in Parliament and ensure that there would always be a [multiracial](/wiki/Multiracialism) Parliament instead of one made up of a single race. Speaking in Parliament during the debate on whether GRCs should be introduced, [First Deputy Prime Minister](/wiki/Prime_Minister_of_Singapore#List_of_deputy_prime_ministers) and [Minister for Defence](/wiki/Ministry_of_Defence_(Singapore)) [Goh Chok Tong](/wiki/Goh_Chok_Tong) said he had first discussed the necessity of ensuring the multiracial nature of Parliament with [Prime Minister](/wiki/Prime_Minister_of_Singapore) [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) in July 1982. Then, Lee had expressed concern about the voting patterns of younger Singaporeans, who appeared to be apathetic to the need of having a racially balanced slate of candidates. He was also worried about more Singaporeans voting along racial lines, which would lead to a lack of minority representation in Parliament. Lee had also proposed to twin constituencies and have [Members of Parliament](/wiki/Members_of_the_Singapore_Parliament) (MPs) contest as a pair, one of whom had to be from a minority community. However, [Malay](/wiki/Malays_in_Singapore) MPs were upset that this implied they were not electable on their own merits. Feeling that the twinning of constituencies would lead to Malay MPs losing confidence and self-respect, the [Government](/wiki/Government_of_Singapore) dropped the proposal. Therefore, the Government felt that the best way to ensure minority representation in Parliament was to introduce the GRC scheme. In addition, it took the view that such a scheme would complement the introduction of town councils to manage [public housing estates](/wiki/Public_housing_in_Singapore), as it would be economical for a town council to manage a group of three constituencies. Subsequently, in 1991, the Government said that GRCs also minimized the need to redraw the boundaries of constituencies which had grown too big for the MPs serving them, and, in 1996, GRCs were said to provide [Community Development Councils](/wiki/Community_Development_Council) with the critical mass of residents that they needed to be effective. Three proposals for [minority](/wiki/Minority_group) representation in Parliament had been considered by a 1966 Constitutional Commission chaired by the [Chief Justice](/wiki/Chief_Justice_of_Singapore) [Wee Chong Jin](/wiki/Wee_Chong_Jin). The first was to have a committee of representatives of minorities that would elect three persons from amongst its members to represent minorities in Parliament. However, this was rejected as the Commission felt that it would be an inappropriate and retrogressive move in that unelected members should not be allowed to dilute the elected chamber. The second proposal, which was to have [proportional representation](/wiki/Proportional_representation), was also rejected on the grounds that it would intensify party politics along racial lines and eventually \"perpetuate and accentuate racial differences\". This would then make it increasingly difficult, if not impossible, to achieve a single homogeneous community out of the many races that form the population of the Republic. The third proposal was to have an [upper house](/wiki/Upper_house) in Parliament composed of members elected or nominated to represent the racial, linguistic and religious minorities in Singapore. However, this was rejected as being backward-looking since politicians should attain a seat in Parliament through taking part in elections. In 1988, 39 SMCs were grouped into 13 three-member GRCs, making up 39 out of a total of 81 elected seats in Parliament. The Constitution and the Parliamentary Elections Act were changed in 1991 and again in 1996 to increase the maximum number of MPs in each GRC from three to four, and then to six. In the [2001 general election](/wiki/2001_Singaporean_general_election), three- and four-member GRCs were replaced by five- and six-member GRCs. There were nine five-member GRCs and five six-member GRCs, making up 75 out of the 84 elected seats in Parliament. This arrangement remained unchanged at the 2006 elections. On 27 May 2009, the Government announced that it would refine the size and number of GRCs. This could be achieved without amending either the Constitution or the Parliamentary Elections Act. Instead, when the next EBRC was appointed, its terms of reference would instruct the Committee to plan for fewer six-member GRCs than at present, and to reduce the average size of each GRC. The average size of GRCs at that time was 5.4 MPs because there were only five-member and six-member GRCs. The new average, however, would not exceed five MPs. In addition, to ensure that the number of SMCs kept pace with the increase in voters and hence the number of MPs, the EBRC's terms of reference would state that there should be at least 12 SMCs. The rationale given for these changes was that the GRC scheme would work better and the link between voters and their MPs would be strengthened. In the 2011 general election, SMCs returned to Parliament 12 MPs and 15 GRCs a total of 75 MPs. In 2023, [Progress Singapore Party](/wiki/Progress_Singapore_Party)'s (PSP) [non-constituency Member of Parliament](/wiki/Non-constituency_Member_of_Parliament) (NCMP), [Hazel Poa](/wiki/Hazel_Poa), raised a private member's motion to abolish GRC, citing outcomes where candidates ride on the coattails of more established teammates, reduced voters' choice over election results. During the parliament debate, Poa mentioned vacancies in the GRC when MPs resign from their seat midterm, citing [Halimah Yacob](/wiki/Halimah_Yacob)'s resignation in 2017 to contest in the [2017 Singaporean presidential election](/wiki/2017_Singaporean_presidential_election) and [Tharman Shanmugaratnam](/wiki/Tharman_Shanmugaratnam)'s upcoming resignation to contest in the [2023 Singaporean presidential election](/wiki/2023_Singaporean_presidential_election). [Chan Chun Sing](/wiki/Chan_Chun_Sing), Minister-in-charge of the Public Service, in response to Poa, said WP and PSP also relied on the \"star power\" of [Low Thia Khiang](/wiki/Low_Thia_Khiang) and [Tan Cheng Bock](/wiki/Tan_Cheng_Bock) to win [Aljunied GRC](/wiki/Aljunied_Group_Representation_Constituency) in 2011 and PSP having NCMPs now in parliament. [Leader of the Opposition](/wiki/Leader_of_the_Opposition_(Singapore)) and [Workers' Party](/wiki/Workers%27_Party_(Singapore))'s (WP) chief [Pritam Singh](/wiki/Pritam_Singh_(Singaporean_politician)) also highlighted the usage of GRC for gerrymandering, citing the merging of SMCs, in close contest between PAP and WP, into GRC in the next election. WP also called for the abolition of GRCs. [Senior Minister](/wiki/Senior_Minister_of_Singapore) [Teo Chee Hean](/wiki/Teo_Chee_Hean) responded that accusations of gerrymandering existed long ago and asked Singh to suggest to EBRC to break up opposition held GRCs into SMCs. Parliament rejected the motion. ## Operation ### Number and boundaries of electoral divisions Apart from the requirement that there must be at least eight SMCs, the total number of SMCs and GRCs in Singapore and their boundaries are not fixed. The number of electoral divisions and their names and boundaries are specified by the [Prime Minister](/wiki/Prime_Minister_of_Singapore) from time to time by notification in the *Government Gazette*. Since 1954, a year ahead of the [1955 general election](/wiki/1955_Singaporean_general_election), an Electoral Boundaries Review Committee (EBRC) has been appointed to advise the executive on the number and geographical division of electoral divisions. Even though neither the Constitution nor any law requires this to be done, the Prime Minister has continued to do so from [Singapore's independence](/wiki/History_of_the_Republic_of_Singapore#Independence_from_Malaysia) in 1965. This is generally done just before a general election to review the boundaries of electoral divisions and recommend changes. In recent decades, the Committee has been chaired by the Cabinet Secretary and has had four other members who are senior public servants. In the EBRC appointed before the [general election of 2006](/wiki/2006_Singaporean_general_election), these were the head of the [Elections Department](/wiki/Elections_Department), the Chief Executive Officer of the [Singapore Land Authority](/wiki/Singapore_Land_Authority), the Deputy CEO of the [Housing and Development Board](/wiki/Housing_and_Development_Board) and the Acting Chief Statistician. Since the Committee is only convened shortly before general elections, the preparatory work for [boundary delimitation](/wiki/Electoral_boundary_delimitation) is done by its secretariat the Elections Department, which is a division of the [Prime Minister's Office](/wiki/Prime_Minister%27s_Office_(Singapore)). The EBRC's terms of reference are issued by the Prime Minister, and are not embodied in legislation. In giving recommendations for boundary changes over the years, the Committee has considered various factors, including using hill ridges, rivers and roads as boundaries rather than arbitrarily drawn lines; and the need for electoral divisions to have approximately equal numbers of voters so that electors' votes carry the same weight regardless of where they cast their ballots. In 1963, the EBRC adopted a rule allowing the numbers of voters in divisions to differ by no more than 20%. The permitted deviation was increased to 30% in 1980. It is up to the Cabinet to decide whether or not to accept the Committee's recommendations. ### Requirements of GRCs All the candidates in a GRC must either be members of the same [political party](/wiki/List_of_political_parties_in_Singapore) or [independent candidates](/wiki/Independent_(politician)) standing as a group, and at least one of the candidates must be a person belonging to the Malay, [Indian](/wiki/Indians_in_Singapore) or some other minority community. A person is regarded as belonging to the Malay community if, regardless of whether or not he or she is of the Malay race, considers himself or herself to be a member of the community and is generally accepted as such by the community. Similarly, a person will belong to the Indian community or some other minority community if he or she considers himself or herself a member and the community accepts him or her as such. The minority status of candidates is determined by two committees appointed by the President, the Malay Community Committee and the Indian and Other Minority Communities Committee. Decisions of these committees are final and conclusive, and may not be appealed against or called into question in any court. The President, at the Cabinet's direction, declares the electoral divisions that are to be GRCs; the number of candidates (three to six) to stand for Parliament in each GRC; and whether the minority candidates in each GRC are to be from the Malay, Indian, or other minority communities. The number of GRCs in which at least one MP must be from the Malay community must be three-fifths of the total number of GRCs, and the number of MPs to be returned by all GRCs cannot be less than a quarter of the total number of MPs to be returned at a general election. For the [2011 general election](/wiki/2011_Singaporean_general_election), there were 14 SMCs and 17 GRCs. ### Electoral system An electoral division which is a GRC returns the number of MPs designated for the constituency by the President to serve in Parliament. A group of individuals standing together in a GRC is voted for as a team, and not as individual candidates. In other words, a successful voter's single vote in an SMC sends to Parliament one MP, and a GRC sends a group of MPs from the same single list depending on how many have been designated for that GRC. All elected MPs are selected on a [simple plurality voting](/wiki/Plurality_voting) (\"winner takes all\") basis. A [by-election](/wiki/By-elections_in_Singapore) need not be held to fill a vacancy in any GRC triggered by the death or resignation of an MP, even if there are no other minority candidates in that GRC, or any other reason. A by-election is required only if all the MPs in a GRC vacate their Parliamentary seats. Assuming that such a situation does arise, the Prime Minister would be obliged to call a by-election within a reasonable time, unless he intends to call a general election in the near future. ## Assessment ### Advantages As Article 39A of the Constitution states, the GRC scheme entrenches the presence of minority MPs in Parliament, ensuring that interests of minority communities are represented in Parliament. Article 39A(1)(a) of the Constitution allows for a maximum number of six MPs for each GRC so as to provide flexibility in ensuring that a GRC with a rapidly expanding population is properly managed. As the population of a constituency grows, it becomes increasingly difficult for an MP to singlehandedly represent the views of all constituents. A team of MPs arguably has greater access to more constituents, and the fact that there are different MPs in the team suggests they can more effectively provide representation in Parliament of a wide range of constituents' views. ### Criticisms of the scheme #### Diversion from original purpose The official justification for the GRC scheme is to entrench minority representation in Parliament. However, opposition parties have questioned the usefulness of GRCs in fulfilling this purpose, especially since Singapore has not faced the issue of minorities being under-represented in Parliament. In fact, statistics show that all PAP minority candidates have won regularly and that the only two MPs to lose their seats in 1984 were ethnically Chinese. One of them was beaten by a minority candidate. In addition, [Joshua Benjamin Jeyaratnam](/wiki/Joshua_Benjamin_Jeyaratnam) of the [WP](/wiki/Workers%27_Party_(Singapore)) won a [by-election in 1981](/wiki/1981_Singaporean_by-election) at [Anson](/wiki/Anson_Single_Member_Constituency), a largely Chinese constituency, and the first elected [Chief Minister of Singapore](/wiki/Chief_Minister_of_Singapore) was [David Marshall](/wiki/David_Marshall_(Singaporean_politician)) who was Jewish. Technically, as the size of GRCs has increased, the minority has had less representation overall as the proportion of minority MPs per GRC has been reduced. Since minority MPs are a numerical minority in Parliament, their political clout has also been reduced. In February 2017, [Minister in the Prime Minister's Office](/wiki/Minister_in_the_Prime_Minister%27s_Office) [Chan Chun Sing](/wiki/Chan_Chun_Sing) said that if a minority candidate leaves their group representation constituency (GRC), a by-election will not be called. Chan claimed that the goals of having enough minority members in Parliament, and to ensure no political campaign on issues of race and religion, would still be met even if the minority member of the GRC left. Furthermore, the GRC scheme is now used as a recruiting tool for the PAP. In 2006, Goh Chok Tong stated, \"Without some assurance of a good chance of winning at least their first election, many able and successful young Singaporeans may not risk their careers to join politics\". Every PAP GRC team is helmed by a major figure such as a minister, and allowed candidates to ride on the coat-tails of the established PAP members. Since 1991, the PAP has generally not fielded first-time candidates in SMC wards. On the other hand, one of the \"in-built weaknesses\" of GRCs may be that \"through no fault of their own or that of their team\", \"high-value\" MPs can be voted out; this was said to have occurred when former [Minister for Foreign Affairs](/wiki/Ministry_of_Foreign_Affairs_(Singapore)) [George Yeo](/wiki/George_Yeo) lost his parliamentary seat to a Workers' Party of Singapore team in [Aljunied GRC](/wiki/Aljunied_Group_Representation_Constituency) at the [2011 general election](/wiki/2011_Singaporean_general_election). It is also said that GRCs serve more as administrative tools than to ensure minority representation. The size of GRCs was increased to take advantage of [economies of scale](/wiki/Economies_of_scale) when managing the wards. However, whether GRCs are required for this purpose is arguable, as [Goh Chok Tong](/wiki/Goh_Chok_Tong) stated in 1988 that MPs in SMCs could still group together after elections to enjoy economies of scale. #### Opposition parties disadvantaged The GRC scheme has also been criticized for raising the bar for the opposition in elections. First, opposition parties may find it harder to find competent candidates, including minority candidates, to form teams to contest GRCs. Goh Chok Tong has acknowledged that the GRC scheme benefits the PAP as they can put together stronger teams. With the GRC system the threshold for votes for the opposition is also increased, and opposition parties have to take a gamble and commit huge proportions of their resources to contest GRCs. Each candidate in a GRC is required to deposit a sum equal to 8% of the total allowances payable to an MP in the calendar year preceding the election, rounded to the nearest [S$](/wiki/Singapore_dollar)500. At the 2011 general election, the deposit was $16,000. Unsuccessful candidates have their deposits forfeited if they do not receive at least one-eighth of the total number of votes polled in the GRC. Critics have noted that the number of walkovers has generally increased since the introduction of GRCs. To date, only one opposition party, the Workers' Party, has won GRCs: Aljunied, in the 2011 general election, and Sengkang, in the 2020 general election. #### Creation of unequal voting power GRCs have been criticized as giving unequal voting and lobbying (correspondence) powers between electors. Every ballot in a GRC ward returns five or six candidates into Parliament, compared with one vote in a SMC ward, which only returns one. In counterbalance it dilutes electors' voting power and may result in concerns raised taken less seriously as to lobbying/correspondence. Specifically, in an SMC ward are around 14,000 voters, compared to 140,000 voters in a five- or six-member GRC. Thus, the per-candidate power of the ballot in a GRC is lower than in an SMC, as each voter in a GRC finds it harder to vote out an MP that he or she does not like; but the overall power effect is the same. #### Electoral division re-drawings [Malapportionment](/wiki/Malapportionment) is a viable charge against some divisions as a 30% deviation from equality of electorate is tolerated. It follows, a five-member GRC could in theory have from 91,000 voters to 86% more: 169,000 voters. In 2024, [Hazel Poa](/wiki/Hazel_Poa) of the [Progress Singapore Party](/wiki/Progress_Singapore_Party) called for GRCs to be abolished and for SMCs to represent 27,000 to 33,000 voters (10% from 30,000), arguing the current 20,000 to 38,000 voters per MP is too large a variation with some MPs having nearly twice the workload as others. [Chan Chun Sing](/wiki/Chan_Chun_Sing) of the governing [People's Action Party](/wiki/People%27s_Action_Party) defended the current deviation on the basis that applying a 10% deviation on small electorates (with MPs in UK and Australia representing two to three times more voters) will mean more frequent and major changes to electoral boundaries as people move, and that more intimate representation with small electorates can balance a large percentage variation. Chan Chung Sing also added that even in established democracies, \"no electoral system in the world can definitively claim that every vote is exactly the same or near equal\". #### Weakening of voter–MP relationship Critics have noted that the credibility and accountability of some candidates may be reduced because in a GRC the members of the team who are popular \"protect\" less popular members from being voted out. It has been said that the relationship between the electorate and their representatives is also weakened, because the relationship is between the individual and the GRC team rather than between the individual and a particular MP. Improving the link between voters and MPs, and to make the latter more accountable was the reason for the changes proposed in 2009 to introduce more SMCs and to reduce the size of GRCs. #### Enshrining of racialism Even though the GRC scheme is intended to ensure minority representation in Parliament, it can be said that the scheme emphasizes racial consciousness and hence widens the gap between races. It may undermine the esteem of minority candidates as they would not be sure if they are elected on their own merit, or due to the scheme and the merits of the rest of the team of MPs. This would result in minority candidates resenting that they are dependent on the majority to enter Parliament, and the majority candidates believing that minority candidates have insufficient ability. It has also been claimed that the GRC scheme demeans the majority of Singaporeans as it assumes that they are not able to see the value or merit of minority candidates, and only vote for candidates with whom they share a common race, culture and language. #### Law of large numbers Derek da Cunha has proposed that the [law of large numbers](/wiki/Law_of_large_numbers) favours the GRC system. According to the theory, the large number of voters from GRC wards generally, though not necessarily always, reflects the popular vote. This was evident at the 2006 elections, at which the PAP garnered an average of 67.04% of the votes in a contested GRC, while the average was 61.67% for a SMC ward. The national average for the 2006 elections was 66.6%. Similar trends can be seen from previous elections. The gap grew from 3% in 1991, and remained stable at around 5% in the (/wiki/1997_Singaporean_general_election), 2001 and 2006 elections. This may be attributable to the enlargement of the size of GRCs in 1997 which gave greater effect to the law of large numbers. - Singapore portal - Politics portal - Law portal - [Constituencies of Singapore](/wiki/Constituencies_of_Singapore) - [Directorial system](/wiki/Directorial_system) - [Gerrymandering](/wiki/Gerrymandering) - [General ticket](/wiki/General_ticket) (of which the system used for GRCs is a modified version) - [Non-constituency Member of Parliament](/wiki/Non-constituency_Member_of_Parliament) - [Presidential Council for Minority Rights](/wiki/Presidential_Council_for_Minority_Rights) ## Notes ### Legislation - [Constitution of the Republic of Singapore](/wiki/Constitution_of_Singapore) (1999 Reprint). - Parliamentary Elections Act (Cap. 218, 2007 Rev. Ed.) (\"PEA\"). ### Other works - Singh, Bilveer (2006), *Politics and Governance in Singapore: An Introduction*, Singapore: [McGraw-Hill](/wiki/McGraw-Hill), [ISBN](/wiki/ISBN_(identifier)) 978-0-07-126184-5. - [Goh, Chok Tong](/wiki/Goh_Chok_Tong) ([Deputy Prime Minister](/wiki/Prime_Minister_of_Singapore#List_of_deputy_prime_ministers) and [Minister for Defence](/wiki/Ministry_of_Defence_(Singapore))), speech during the Second Reading of the Parliamentary Elections (Amendment) Bill, *Singapore Parliamentary Debates, Official Report* (11 January 1988), vol. 50, cols. 178–192. - Li, Xueying (18 September 2010), \"Making sense of electoral boundaries\", *[The Straits Times](/wiki/The_Straits_Times)*, pp. A38 – A39. - [*Report of the Constitutional Commission, 1966 [Chairman: Wee Chong Jin]*](/wiki/Wee_Chong_Jin), Singapore: Government Printer, 1966, [OCLC](/wiki/OCLC_(identifier)) 51640681. ### Articles and websites - Lua, Ee Laine; Sim, Disa Jek Sok; Koh, Christopher Theng Jer (1996), \"Principles and Practices of Voting: The Singapore Electoral System\", *Singapore Law Review*, **17**: 244–321 at 299–303. - Tan, Eugene K[heng] B[oon] (November 2005), \"Multiracialism Engineered: The Limits of Electoral and Spatial Integration in Singapore\", *[Ethnopolitics](/wiki/Ethnopolitics)*, **4** (4): 413–428, [doi](/wiki/Doi_(identifier)):10.1080/17449050500348659, [S2CID](/wiki/S2CID_(identifier)) 144805907, also published in Bieber, Florian; [Wolff, Stefan](/wiki/Stefan_Wolff), eds. (2007), *The Ethnopolitics of Elections*, London; New York, N.Y.: [Routledge](/wiki/Routledge), pp. 53–68, [ISBN](/wiki/ISBN_(identifier)) 978-0-415-40047-3. - Tan, Eugene; Chan, Gary (13 April 2009), \"The Legislature\", *The Singapore Legal System*, SingaporeLaw.sg, [Singapore Academy of Law](/wiki/Singapore_Academy_of_Law), archived from the original on 19 January 2008, retrieved 1 December 2010. - Tan, Kevin Yew Lee (1992), \"Constitutional Implications of the 1991 Singapore General Election\", *Singapore Law Review*, **13**: 26–59. - Tan, Kevin Y[ew] L[ee] (1997), \"Is Singapore's Electoral System in Need of Reform?\", *Commentary*, **14**: 109–117. - Tey, Tsun Hang (December 2008), \"Singapore's Electoral System: Government by the People?\", *Legal Studies*, **28** (4): 610–628, [doi](/wiki/Doi_(identifier)):10.1111/j.1748-121X.2008.00106.x, [S2CID](/wiki/S2CID_(identifier)) 143965283. - [Thio, Li-ann](/wiki/Thio_Li-ann) (2002), \"The Right to Political Participation in Singapore: Tailor-making a Westminster-modelled Constitution to Fit the Imperatives of 'Asian' Democracy\", *Singapore Journal of International and Comparative Law*, **6**: 181–243. ### Books - Chan, Helena H[ui-]M[eng] (1995), \"Parliament and Law Making\", *The Legal System of Singapore*, Singapore: [Butterworths Asia](/wiki/LexisNexis_Butterworths), pp. 41–68, [ISBN](/wiki/ISBN_(identifier)) 978-0-409-99789-7. - Chua, Beng Huat (1995), *Communitarian Ideology and Democracy in Singapore*, London: Routledge, [ISBN](/wiki/ISBN_(identifier)) 978-0-415-16465-8. - Hussin Mutalib (2003), *Parties and Politics: A Study of Opposition Parties and the PAP in Singapore*, Singapore: Eastern Universities Press, [ISBN](/wiki/ISBN_(identifier)) 978-981-210-211-9, (pbk.). - *Report of the Select Committee on the Parliamentary Elections (Amendment) Bill (Bill No. 23/87) and the Constitution of the Republic of Singapore (Amendment No. 2) Bill (Bill No. 24/87) [Parl. 3 of 1988]*, Singapore: Printed for the [Government of Singapore](/wiki/Government_of_Singapore) by Singapore National Printers, 1988, [OCLC](/wiki/OCLC_(identifier)) 30875454. - [Rodan, Garry](/wiki/Garry_Rodan), ed. (1993), *Singapore Changes Guard: Social, Political and Economic Directions in the 1990s*, New York, N.Y.: [St. Martin's Press](/wiki/St._Martin%27s_Press), [ISBN](/wiki/ISBN_(identifier)) 978-0-312-09687-8. - Tan, Kevin Y[ew] L[ee] (2011), \"Making Law: Parliament\", *An Introduction to Singapore's Constitution* (rev. ed.), Singapore: Talisman Publishing, pp. 33–60 at 53–55, [ISBN](/wiki/ISBN_(identifier)) 978-981-08-6456-9. - Tan, Kevin Y[ew] L[ee]; [Thio, Li-ann](/wiki/Thio_Li-ann) (2010), \"The Legislature\", *Constitutional Law in Malaysia and Singapore* (3rd ed.), Singapore: [LexisNexis](/wiki/LexisNexis), pp. 299–360 at 310, [ISBN](/wiki/ISBN_(identifier)) 978-981-236-795-2. - Thio, Li-ann (2012), \"The Legislature and the Electoral System\", *A Treatise on Singapore Constitutional Law*, Singapore: [Academy Publishing](/wiki/Singapore_Academy_of_Law), pp. 285–359 at 332–355, [ISBN](/wiki/ISBN_(identifier)) 978-981-07-1515-1. - Official website of the Elections Department - Official website of the Parliament of Singapore - Singapore Elections Type of electoral division in Singapore\n",
  "language": "en",
  "processed_at": "2026-01-12T11:07:47.689580",
  "title": "Group representation constituency",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Group_representation_constituency"
}