{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:07:49.448814"
  },
  "content": "Street food stall in Singapore**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **is an orphan, as no other articles link to it**. Please introduce links to this page from related articles. *(December 2025)*The topic of this article **may not meet Wikipedia's notability guidelines for companies and organizations**. Please help to demonstrate the notability of the topic by citing reliable secondary sources that are independent of the topic and provide significant coverage of it beyond a mere trivial mention. If notability cannot be shown, the article is likely to be merged, redirected, or deleted. *Find sources:* \"Guan Kee Fried Kway Teow\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(July 2022)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* **Guan Kee Fried Kway Teow** is a [street food](/wiki/Street_food) stall in the Ghim Moh Road Market & Food Centre in [Ghim Moh](/wiki/Ghim_Moh), Singapore. The food stall was awarded the [Michelin Bib Gourmand](/wiki/Bib_Gourmand) in 2019. ## History The stall was founded in May 1969. The original stall was located on the same area which the Thye Hong Centre currently occupies. However, the stall was forced to move to Ghim Moh Road Market & Food Centre in 1978 due to newly introduced government regulations to improve the environment in Singapore. The stall is run by an elderly couple. ## Reception The stall was awarded the Michelin Bib Gourmand Award in 2019. It has maintained its position in the Michelin Bib Gourmand. Lhu Wen Kai of *TheSmartLocal* gave the stall an honourable mention in his list of the fifteen best Char Kway Teow stalls in Singapore, as ongoing renovations prevented him from visiting the stall. Jocelyn Tan of *[Lifestyle Asia](/wiki/Lifestyle_Asia)* included the stall in her guide to the eight best stalls in the food centre. This [Singaporean cuisine](/wiki/Singaporean_cuisine)-related article is a stub. You can help Wikipedia by expanding it. - v - t - e This Asia-based restaurant or restaurant chain article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:07:49.448290",
  "title": "Guan Kee Fried Kway Teow",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Guan_Kee_Fried_Kway_Teow"
}