{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:07:55.874838"
  },
  "content": "Southeast Asian dish **Gulai** (Malay pronunciation: [ˈɡulai̯]) is a type of [spiced](/wiki/Spice) [stew](/wiki/Stew) commonly found in the culinary traditions of [Malaysia](/wiki/Malaysia), [Indonesia](/wiki/Indonesia) and other parts of [Maritime Southeast Asia](/wiki/Maritime_Southeast_Asia), including [Brunei](/wiki/Brunei), [Singapore](/wiki/Singapore) and [southern Thailand](/wiki/Southern_Thailand). Closely associated with both [Malay](/wiki/Malay_cuisine) and [Minangkabau cuisines](/wiki/Padang_cuisine), it is characterised by a rich, aromatic sauce made from [coconut milk](/wiki/Coconut_milk) and a blend of ground spices, typically including [turmeric](/wiki/Turmeric), [coriander](/wiki/Coriander), [chilli](/wiki/Chili_pepper) and other local aromatics. *Gulai* is usually prepared with [meat](/wiki/Meat), [fish](/wiki/Fish_as_food), [offal](/wiki/Offal) or [vegetables](/wiki/Vegetable) and is typically served with rice. In [English](/wiki/English_language), it is sometimes described as Malay curry or Indonesian curry. The origins of *gulai* can be traced to [Indian culinary influences](/wiki/Indian_cuisine) introduced through [maritime trade routes](/wiki/Sea_lane) across the [Indian Ocean](/wiki/Indian_Ocean). Over time, these foreign elements were adapted to local tastes with the incorporation of regional ingredients such as [lemongrass](/wiki/Lemongrass), [galangal](/wiki/Galangal), [ginger](/wiki/Ginger) and [candlenut](/wiki/Candlenut). This fusion gave rise to a distinctive style of [curry](/wiki/Curry)-like stew in Maritime Southeast Asia. Similar culinary developments occurred in [neighbouring regions](/wiki/Mainland_Southeast_Asia), resulting in dishes such as *[kaeng](/wiki/Thai_curry)* in [Thailand](/wiki/Thailand) and *[kroeung](/wiki/Kroeung)*-based stews in [Cambodia](/wiki/Cambodia). *Gulai*, in particular, became an integral part of the food culture in both coastal and inland areas of the [Malay Peninsula](/wiki/Malay_Peninsula), [Sumatra](/wiki/Sumatra) and [Borneo](/wiki/Borneo). In [Java](/wiki/Java), a local variant is commonly referred to as *gule*. Regional interpretations of *gulai* vary in flavour, texture and ingredients, influenced by local preferences and culinary traditions. In Malaysia, variations range from the fiery *[masak lemak cili api](/wiki/Masak_lemak_lada_api)* of [Negeri Sembilan](/wiki/Negeri_Sembilan) to the [durian](/wiki/Durian)-based *gulai [tempoyak](/wiki/Tempoyak)* found in [Perak](/wiki/Perak) and [Pahang](/wiki/Pahang). In Indonesia, [West Sumatran](/wiki/West_Sumatra) versions tend to be thick and intensely spiced, while [Javanese styles](/wiki/Javanese_cuisine) are lighter and more soupy. A related version known as *guleh* is also present in [Javanese-Surinamese](/wiki/Javanese_Surinamese) cuisine. ## Origin ### Indian influence and the spice trade The origins of *gulai* are closely associated with the historical spread of [Indian culinary influence](/wiki/Indian_cuisine) across [Maritime Southeast Asia](/wiki/Maritime_Southeast_Asia), particularly during the height of the [spice trade](/wiki/Spice_trade). [South Indian](/wiki/South_India) traders introduced [curry](/wiki/Curry)-making techniques, [spice blends](/wiki/Spice_mix) and cooking methods to key [port cities](/wiki/Entrep%C3%B4t) in the region. Archaeological evidence suggests that curry-like preparations had already reached parts of [Southeast Asia](/wiki/Southeast_Asia) by this time, as indicated by the discovery of ancient [stone tools](/wiki/Stone_tool) at [Óc Eo](/wiki/%C3%93c_Eo), an important port city of the [Funan kingdom](/wiki/Funan) in [southern Vietnam](/wiki/Southern_Vietnam). The tools, including a large [sandstone](/wiki/Sandstone) [grinding slab](/wiki/Grinding_slab), bore microscopic traces of eight different spices such as turmeric, ginger, clove, cinnamon and nutmeg. These culinary elements were gradually incorporated into local food traditions across both [mainland](/wiki/Mainland_Southeast_Asia) and [island Southeast Asia](/wiki/Maritime_Southeast_Asia). In the [Indianised state](/wiki/Greater_India) of Funan, Indian influence played a key role in shaping early [Cambodian culture](/wiki/Culture_of_Cambodia) through the introduction of religion, writing systems and artistic forms. According to archaeologist Dr. Ea Darith, these cultural elements were adopted selectively rather than imposed. Indian spices and cooking methods contributed to the development of *[kroeung](/wiki/Kroeung)*, a characteristic [Khmer](/wiki/Khmer_people) spice paste composed of galangal, turmeric, lemongrass and other local aromatics. When combined with *[prahok](/wiki/Prahok)* (fermented [fish paste](/wiki/Fish_paste)), *kroeung* forms the flavour base for many [Cambodian dishes](/wiki/Cambodian_cuisine), such as *[somlar m’chu kroeung sach ko](/wiki/Samlor_machu)* (a *kroeung*-based sour beef soup). In neighbouring [Siam](/wiki/History_of_Thailand) (modern-day [Thailand](/wiki/Thailand)), Indian traders and [Buddhist missionaries](/wiki/Buddhism) introduced key aromatics such as tamarind, cumin and lemongrass. These ingredients formed the basis of *[nam prik](/wiki/Nam_phrik)*, a type of thick spice paste that included components like lemongrass, fish sauce and peppercorns. *Nam prik* became a foundational element in numerous [Thai dishes](/wiki/Thai_cuisine), including early forms of Thai curry known as *[gaeng](/wiki/Thai_curry)*. Later contributions from foreign traders, such as the introduction of shrimp paste and chilli peppers, further developed the complexity and spiciness that characterise Thai curries today. A similar process of adaptation occurred across [Indonesia](/wiki/Indonesia) and the [Malay Archipelago](/wiki/Malay_Archipelago), where Indian spice traditions were localised through the use of regional ingredients such as coconut milk, lemongrass, galangal, turmeric, candlenut and chilli. This culinary synthesis gave rise to *gulai*, a rich, spiced stew that developed into numerous regional variations throughout the region. ### Malay traditions and early records One notable centre of this culinary adaptation was the [Malay Peninsula](/wiki/Malay_Peninsula) and eastern [Sumatra](/wiki/Sumatra). Located on both sides of the [Straits of Malacca](/wiki/Strait_of_Malacca), a key maritime corridor in the [spice trade](/wiki/Spice_trade) and [cross-cultural exchange](/wiki/Cultural_diffusion), these regions were historically linked through [commerce](/wiki/Commerce), [migration](/wiki/Human_migration) and shared linguistic and cultural ties. This longstanding interconnectedness fostered their emergence as important hubs for the transmission, adaptation and localisation of curry-based culinary traditions. The establishment of the [Sultanate of Malacca](/wiki/Malacca_Sultanate) in the early 15th century marked a significant turning point in the region's [culinary landscape](/wiki/Malay_cuisine). As Malacca grew into a key [entrepôt](/wiki/Entrep%C3%B4t) in the [Indian Ocean](/wiki/Indian_Ocean) trade network, it attracted merchants from across Asia, including [South Asia](/wiki/South_Asia), the [Middle East](/wiki/Middle_East) and [China](/wiki/China). This convergence of cultures facilitated the further dissemination of spices, cooking techniques and food traditions. Indian culinary practices, in particular, were gradually adapted to suit local palates and ingredients, resulting in a distinctly Malay style of *gulai*. This regional variant was typically characterised by the use of coconut milk, chilli and indigenous herbs such as lemongrass, galangal and turmeric. Over time, *gulai* became a foundational component of the [Malay gastronomic repertoire](/wiki/Malay_cuisine), commonly served during communal feasts, religious celebrations and courtly banquets. By the 16th century, the dish was already well-established in the Malay culinary tradition, particularly within the courts of Malacca. Early references to gulai are found in classical Malay literature, including *[Hikayat Amir Hamzah](/wiki/Hikayat_Amir_Hamzah)*, which mentions the dish in the context of elite dining. Further references appear in [Malay epics](/wiki/Malaysian_literature) such as the *[Hikayat Hang Tuah](/wiki/Hikayat_Hang_Tuah)* and the *[Hikayat Merong Mahawangsa](/wiki/Hikayat_Merong_Mahawangsa)* indicate its prominence in regional courtly and cultural settings. Additional testimony comes from [Stamford Raffles](/wiki/Stamford_Raffles), who in his 1817 account of early 19th-century [Java](/wiki/Java) described a type of [soupy dish](/wiki/Soup) known as *Gulai Melayu*. According to Raffles, the dish was named after its place of origin, *Melayu* ([Malay](/wiki/Malays_(ethnic_group))), reflecting its association with the Malay region and culinary identity. ### West Sumatran interpretations of *gulai* A similar expression developed among [Minangkabau](/wiki/Minangkabau_people) culinary traditions of [West Sumatra](/wiki/West_Sumatra), where the introduction of gulai is closely tied to the maritime trade networks that connected [South](/wiki/South_Asia) and [Southeast Asia](/wiki/Southeast_Asia). As part of the [maritime Silk Road](/wiki/Maritime_Silk_Road), South Indian traders, particularly those from the [Tamil region](/wiki/Tamil_Nadu), frequented ports along the west [Sumatran](/wiki/Sumatra) coast, facilitating the exchange of not only goods and beliefs but also [culinary practices](/wiki/Fusion_cuisine). Among these were spice combinations and preparation methods associated with Indian curries, including the use of turmeric, coriander and cumin. The Minangkabau, known for their richly spiced and aromatic cooking, gradually adapted these foreign elements to suit local tastes and ingredients. Over time, they developed a regional version of curry-based stew that became known as *gulai*, marked by the use of coconut milk, chilli and regional herbs such as lemongrass and galangal. *Gulai* eventually became a defining feature of [Minangkabau cuisine](/wiki/Padang_cuisine), appearing in a wide variety of dishes made with meat, fish, offal and vegetables, and often prepared for ceremonial, communal and festive occasions. ### European accounts and colonial-era diffusion By the 16th century, dishes resembling *gulai* were already being prepared in various parts of Sumatra, Java, and the Malay Peninsula. [European travellers](/wiki/Europe) of the period, including [Antonio Pigafetta](/wiki/Antonio_Pigafetta), documented the prevalence of richly spiced foods in maritime Southeast Asia, reflecting the long-standing integration of curry-like preparations into local diets. In 1811, the British orientalist [William Marsden](/wiki/William_Marsden_(orientalist)) recorded a dish called *gulei* in the book of *The History of Sumatra* in the [Malay language](/wiki/Malay_language), describing it as being prepared in a manner similar to what Europeans had come to know as “[curry](/wiki/Curry)”. In 1882, [Pieter Johannes Veth](/wiki/Pieter_Johannes_Veth) mention dish *goelai-goelai* in his book *Midden Sumatra Expeditie, Reizen en Onderzoekingen der Sumatra-Expeditie, 1877-1879*. During the colonial era, curry-based dishes such as gulai became increasingly integrated into the daily culinary practices of local communities. The 19th-century [Dutch East Indies](/wiki/Dutch_East_Indies) cookbook *Koki Bitja* listed *kari* ([curry](/wiki/Curry)) as one of the most commonly prepared recipes, reflecting the enduring popularity of spice-laden stews across the region. This period also witnessed the formalisation and codification of regional variations of gulai, further entrenching its role as a staple of local cuisines. ## Culinary characteristics *Gulai* is typically prepared with a [blend of spices](/wiki/Paste_(food)) and [coconut milk](/wiki/Coconut_milk), resulting in a thick, aromatic sauce. While yellow is the most common colour due to turmeric, other versions may appear red, green, black, or white depending on the spice combination. Although coconut milk is characteristic of many styles, some regional preparations omit it, relying instead on the richness of the spice mixture. The dish's flavour profile is built from a mixture of [ground spices](/wiki/Spice_mix) and herbs, commonly including coriander, black pepper, galangal, ginger, chilli peppers, shallots, garlic, fennel, lemongrass, cinnamon and caraway. These ingredients are ground into a paste and cooked with meat, fish, offal or vegetables, then slowly simmered to develop and integrate the flavours. ### Regional variations and culinary significance *Gulai* is widely consumed throughout [Indonesia](/wiki/Indonesia) and the [Malay Archipelago](/wiki/Malay_Archipelago), particularly in Sumatra, the Malay Peninsula, Java and Borneo. While its foundational preparation involves coconut milk and a blend of spices, regional variations exhibit distinct differences in ingredients, flavour profiles and presentation. In [Java](/wiki/Java), *gulai* typically has a lighter yellow colour, whereas in [Sumatra](/wiki/Sumatra) it often appears deeper and more reddish due to the greater use of chilli and spices. The consistency of the dish also varies: in [Minangkabau](/wiki/Padang_cuisine), [Acehnese](/wiki/Acehnese_cuisine) and [Malay cuisines](/wiki/Malay_cuisine), the sauce is generally thick and rich, while in Java it is typically thinner and soup-like, often served with mutton, beef or offal. Across the region, gulai is commonly eaten with steamed rice. #### Malay Peninsula and Singapore > *\"Biar rumah condong, asalkan makan gulai lemak dan gulai asam pedas\"* > (Let the house lean and sway, so long as there's rich gulai lemak and tangy gulai asam pedas on the table.) > > — [Malay proveb](/wiki/Malay_folklore) Among [Malay communities](/wiki/Malays_(ethnic_group)), *gulai* holds significant cultural importance and is regularly featured in both everyday meals and ceremonial occasions. Its role in the culinary tradition is reflected in a [Malay proverb](/wiki/Malay_folklore), *\"Biar rumah condong, asalkan makan gulai lemak dan gulai [asam pedas](/wiki/Asam_pedas)\"*, reflects the high regard for such dishes, using food as a metaphor for contentment and the idea that simple pleasures can outweigh material hardship. In various regional preparations, *[kerisik](/wiki/Kerisik)* (toasted grated coconut paste) is commonly added to enhance the flavour and thicken the sauce. Notable local variants in Peninsular Malaysia highlight the diversity of gulai across different states. In [Perak](/wiki/Perak) and [Pahang](/wiki/Pahang), *gulai [tempoyak](/wiki/Tempoyak)*, made with [fermented durian](/wiki/Durian), is commonly served, especially during festive occasions such as [Hari Raya](/wiki/Eid_al-Fitr) and weddings. [Negeri Sembilan](/wiki/Negeri_Sembilan), known for its [fiery cuisine](/wiki/Pungency), is associated with *masak lemak cili api*, a type of *gulai* prepared with coconut milk, turmeric and [bird's eye chilli](/wiki/Bird%27s_eye_chili). Other distinctive Negeri Sembilan dishes include *gulai belalang padi* ([grasshopper](/wiki/Grasshopper) *gulai*) and *gulai pisang muda* (young [banana](/wiki/Banana) *gulai*). In [Kedah](/wiki/Kedah), *gulai rias pisang* ([banana stem](/wiki/Banana_pith) *gulai*) is a regional speciality, while in [Kelantan](/wiki/Kelantan), *gulai darat*, typically made with beef or goat, is commonly eaten with sambal belacan. In some areas, *[asam pedas](/wiki/Asam_pedas)*, a sour and spicy fish dish, is also referred to as *gulai tumis*, illustrating the fluid terminology in local culinary practice. Additionally, *gulai* is sometimes served with [roti canai](/wiki/Roti_canai), offering an alternative to the more commonly served curry accompaniment. A related adaptation of *gulai* exists in [southern Thailand](/wiki/Southern_Thailand), particularly in the [Malay-majority](/wiki/Thai_Malays) provinces of [Pattani](/wiki/Pattani_province), [Yala](/wiki/Yala_province) and [Narathiwat](/wiki/Narathiwat_province). Among local Malay-speaking communities, the term *gula lakhing* is used to refer to *kaeng massaman* ([massaman curry](/wiki/Massaman_curry)). The term is derived from the [Malay phrase](/wiki/Malay_language) *gulai daging* (\"beef *gulai*\") and reflects the historical and linguistic connections between Malay and Thai culinary traditions. This dish is commonly served in *[khao gaeng](/wiki/Khao_kaeng)* (rice and curry) establishments and remains a regular part of everyday meals in the region. In some [Orang Asli](/wiki/Orang_Asli) communities of the Malay Peninsula, such as the [Mah Meri](/wiki/Mah_Meri_people) and [Semelai](/wiki/Semelai_people), *gulai* forms part of indigenous culinary traditions, prepared with wild-sourced ingredients from the surrounding environment. One example is *gulai tupai dengan ubi*, a preparation of [squirrel](/wiki/Squirrel) stewed with [cassava](/wiki/Cassava). Beyond the Malay Peninsula, related culinary traditions exist in [Singapore](/wiki/Singapore). Among the [Orang Laut](/wiki/Orang_Laut) community, *gulai nenas* refers to a sour fish soup prepared with [pineapple](/wiki/Pineapple), tamarind and *[belacan](/wiki/Shrimp_paste)* (fermented shrimp paste), often using local fish such as [parrotfish](/wiki/Parrotfish), [tuskfish](/wiki/Choerodon) (ikan tokak) or snapper (ikan mentimun). The dish reflects the community's maritime heritage and adaptation of *gulai* to local coastal ingredients. A similarly localised interpretation appears in [Peranakan cuisine](/wiki/Peranakan_cuisine), where *gulai kiam hu kut* ([salted fish bone](/wiki/Salted_fish) gulai) is a notable example found in both Singapore and Malaysia. It features fried salted fish bones simmered in a thick, coconut-based gulai enriched with a spice paste. Known for its pronounced [umami](/wiki/Umami) flavour and a subtle sourness from [tamarind](/wiki/Tamarind) or *asam keping*, the dish illustrates the synthesis of Malay and [Chinese culinary elements](/wiki/Chinese_cuisine) characteristic of Peranakan foodways. #### Sumatra and Riau Archipelago Across the [Indonesian archipelago](/wiki/Indonesian_archipelago), particularly in [Sumatra](/wiki/Sumatra), *gulai* has evolved into various regional forms shaped by local ingredients, culinary traditions, and cooking methods. In [West Sumatra](/wiki/West_Sumatra), *gulai* is a central element of Minangkabau cuisine. The thick, yellowish sauce is commonly used to flavour meat, fish and vegetables, and is noted for its rich, spicy and aromatic qualities. It integrates a complex blend of spices into a harmonious flavour profile, often making the identification of individual ingredients difficult. Within Minangkabau communities, *ruku-ruku* ([holy basil](/wiki/Holy_basil), *Ocimum tenuiflorum*) is considered an essential herb in the preparation of *gulai*. The importance of *gulai* in [Minangkabau food culture](/wiki/Padang_cuisine) is reflected in the status it holds within domestic cooking. In [Padang](/wiki/Padang), the ability to prepare *gulai* is often regarded as a measure of culinary proficiency. Dishes such as *[rendang](/wiki/Rendang)* (beef braised in coconut milk and spices), *[asam padeh](/wiki/Asam_pedas)* (a sour and spicy stew) and *[kalio](/wiki/Kalio)* (a lighter and more fluid form of *rendang*) are sometimes considered stylistic extensions of Padang-style gulai. These preparations are widely featured in [Padang restaurants](/wiki/Nasi_padang), which serve Minangkabau cuisine across Indonesia and in neighbouring countries such as Malaysia and Singapore. Their presence has contributed to the dissemination of Minangkabau-style *gulai* beyond its regional origin. *Gulai* in other Sumatran regions also displays considerable diversity. In [Aceh](/wiki/Aceh), *gulai kambing* is known for its bold, aromatic spice blend, reflecting [South Asian](/wiki/South_Asian_cuisine) and [Middle Eastern influences](/wiki/Middle_Eastern_cuisine). In [North Sumatra](/wiki/North_Sumatra), [cassava leaves](/wiki/Cassava) are commonly stewed in a coconut-based gravy, offering a widely enjoyed plant-based variant. In [Riau](/wiki/Riau), *gulai belacan* features prawns cooked in coconut milk with [fermented shrimp paste](/wiki/Shrimp_paste), tamarind and black pepper, producing a savoury and tangy flavour. From [Jambi](/wiki/Jambi), *gulai tepek ikan* combines [sago flour](/wiki/Sago) and minced fish, typically [snakehead](/wiki/Snakehead_(fish)) or [mackerel](/wiki/Mackerel), shaped into [flattened pieces](/wiki/Fishcake) and stewed in spiced broth. More distinctive examples include *gulai pisang* from [Bengkulu](/wiki/Bengkulu), which uses [ripe bananas](/wiki/Banana) as the main ingredient, and *lempah darat* from [Bangka Belitung](/wiki/Bangka_Belitung_Islands), a vegetable-based *gulai* incorporating [bamboo shoots](/wiki/Bamboo_shoot), taro, young pineapple and other local produce. In [South Sumatra](/wiki/South_Sumatra), *gulai jeghuk* or *pindang tempoyak* blends freshwater fish with fermented durian ([tempoyak](/wiki/Tempoyak)), yielding a pungent, tangy dish. From [Lampung](/wiki/Lampung), *gulai taboh iwa tapa* features [smoked fish](/wiki/Smoked_fish) simmered in coconut milk with galangal, turmeric and other aromatics, often accompanied by melinjo leaves or long beans. In the nearby [Riau Islands](/wiki/Riau_Islands), *Gulai Kuah Tige* from [Natuna](/wiki/Natuna_Regency) combines [sago pearls](/wiki/Sago), boiled cassava and grated coconut, which are served together with fi*sh gu*lai poured over the top. #### Java In contrast to these regional variations, *gultik* (short for *gulai tikungan*, meaning \"[street corner](/wiki/Streetcorner) *gulai*\") is an urban adaptation of *gulai* that originated in [Blok M, South Jakarta](/wiki/Blok_M,_Jakarta). Created by migrants from [Sukoharjo](/wiki/Sukoharjo_Regency), [Central Java](/wiki/Central_Java), *gultik* features thinly sliced beef cooked in a rich *gulai* sauce, typically served with rice and skewered side dishes such as offal *[satay](/wiki/Satay)* or *[krupuk](/wiki/Krupuk)*. In [Semarang](/wiki/Semarang), *gule bustaman* has a unique taste goat *gule* because it does not use coconut milk, and the spices of the soup is combined of *[serundeng](/wiki/Serundeng)*, cardamom, cumin, galangal, cinnamon, and [curry tree](/wiki/Curry_tree) leaves. In [East Java](/wiki/East_Java), *gule kambing* is served with *[sate kambing](/wiki/Sate_kambing)* (goat [satay](/wiki/Satay)). #### Suriname Outside the [archipelagic region](/wiki/Maritime_Southeast_Asia) of [Southeast Asia](/wiki/Southeast_Asia), *gulai* has also continued within the [Javanese diaspora](/wiki/Javanese_diaspora), including those in [Suriname](/wiki/Suriname), where it is known as *guleh* among the local community. Brought by Javanese contract labourers in the late 19th and early 20th centuries, the dish preserves elements of its original preparation. In Suriname, *guleh* is commonly made with *babat* ([beef tripe](/wiki/Tripe)) and *lebmaag* ([abomasum](/wiki/Abomasum)), simmered in a spiced coconut milk broth. It is typically served with *[lontong](/wiki/Lontong)* (compressed [rice cakes](/wiki/Rice_cake)) and is considered a festive dish, particularly during *Bodo*, the [Javanese-Surinamese](/wiki/Javanese_Surinamese) observance of [Eid al-Fitr](/wiki/Eid_al-Fitr). ## Local variations - Food portal - Indonesia portal - Malaysia portal - *[Asam pedas](/wiki/Asam_pedas)* - [Cuisine of Brunei](/wiki/Cuisine_of_Brunei) - [Cuisine of Indonesia](/wiki/Cuisine_of_Indonesia) - [Cuisine of Singapore](/wiki/Cuisine_of_Singapore) - [Goulash](/wiki/Goulash) - *[Jjigae](/wiki/Jjigae)* - [Padang cuisine](/wiki/Padang_cuisine) - [Thai curry](/wiki/Thai_curry) - Gulai - Red snapper's head gulai recipe Archived 30 May 2014 at the [Wayback Machine](/wiki/Wayback_Machine) (in Indonesian) - Goat meat gulai recipe Archived 21 March 2014 at the [Wayback Machine](/wiki/Wayback_Machine) (in Indonesian)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:07:55.874284",
  "title": "Gulai",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Gulai"
}