{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:07:59.470199"
  },
  "content": "Singaporean army officer [Colonel](/wiki/Colonel) [(RET)](/wiki/Singapore_Armed_Forces_ranks#Suffixes_to_rank_titles) **Gurcharan Singh Sekhon** ([Punjabi](/wiki/Punjabi_language): ਗੁਰਚਰਨ ਸਿੰਘ ਸੇਖੋਂ, born 1937) is a retired Singaporean army officer. Nicknamed \"Father of the Engineers\", he is a pioneer of the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces), credited with setting up the [Singapore Combat Engineers](/wiki/Singapore_Combat_Engineers). He served as the 6th Commandant of the [Singapore Command and Staff College](/wiki/Goh_Keng_Swee_Command_and_Staff_College) from 1979–1981, and thereafter as the Assistant Chief of General Staff (Operations) of the [Singapore Army](/wiki/Singapore_Army), an appointment today held by an officer of [one-star rank](/wiki/One-star_rank). In July 1967, he became a graduate of Singapore's first batch of officer cadets. Of that batch, he was the first to command a specialist branch, to hold this command alongside command of a battalion, to command the Singapore Command and Staff College, and to command the First Division of the Singapore Armed Forces. ## Early life and education Gurcharan Singh Sekhon was born in a [Jat](/wiki/Jat) Sikh family in 1937 to Mall Singh, a disciplinarian who owned a farm in Aljunied Road with cows and buffaloes, and who later became a successful moneylender. His early life was disrupted by the [Japanese invasion](/wiki/Japanese_invasion_of_Singapore) and subsequently [occupation of Singapore](/wiki/Japanese_occupation_of_Singapore), and he described these experiences as formative. He attended a Japanese school, with strict and uncaring teachers who caned their students. At home, he lived with a reality of Japanese raids. Following the [Surrender of Japan](/wiki/Surrender_of_Japan) in 1945, he joined [Saint Andrew's School](/wiki/Saint_Andrew%27s_School,_Singapore), which he enjoyed and where he held multiple leadership positions, a rare occurrence for non-Christians in the school at that time. Gurcharan Singh secured a place at the [University of Malaya](/wiki/University_of_Malaya) in [Kuala Lumpur](/wiki/Kuala_Lumpur) in 1959, and went on to secure a degree in engineering. Following his graduation, he worked for a dredging company in Malaysia. ## Military career Some time after he began working, his father Mall Singh, and then Assistant Commissioner of Police in Singapore Gurdial Singh, called to ask him to enter the [uniformed services](/wiki/Uniformed_services). Singh was reluctant, but did not want to disappoint his father, so he returned to Singapore in March 1966 and underwent recruitment tests. He joined the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces) three months later, at the age of 29. As one of the oldest recruits and one of the few with a university degree, he became an obvious choice as a group leader. He eventually became a [platoon commander](/wiki/Platoon_leader). When the [Singapore Armed Forces Training Institute](/wiki/SAFTI_Military_Institute) (today known as the SAFTI Military Institute) was established in 1967, a plan was included for a wing to train [combat engineers.](/wiki/Combat_engineer) Alongside Chng Teow Hua (who would later become Commissioner of the [Singapore Civil Defence Force](/wiki/Singapore_Civil_Defence_Force)), he was selected to attend a basic engineer officer's course in [Fort Belvoir, Virginia](/wiki/Fort_Belvoir). He left for the course having just completed his training as an officer cadet, leaving him unable to attend his own [commissioning ceremony](/wiki/Commissioned_officer). When they returned from the course, the two junior officers and their commanding officer, [Major](/wiki/Major_(rank)) George Mitchell, conducted the first Engineer Commanders’ Course in Singapore, spanning April to August 1968. These officers then formed the nucleus of the Singapore Combet Engineers. Singh was fondly referred to as the \"Father of Engineers\". Singh remained with the combat engineers until 1984. Singh was also the first man from the first batch of SAFTI Military Institute to command the Command Staff College as well as the first man to command the First Division from his batch. At that point, Singh was one of three Sikh colonels in a group of seven colonels in the Singapore Armed Forces. He was later selected to attend the [United States Army Command and General Staff College](/wiki/United_States_Army_Command_and_General_Staff_College) at [Fort Leavenworth, Kansas](/wiki/Fort_Leavenworth), from which he graduated in 1975. ## Retirement Following his retirement, Singh applied his engineering knowledge to the design and construction of golf courses. He also became a member of the [Singapore Sports Council](/wiki/Singapore_Sports_Council), the Singapore Rugby Association, the Singapore Cricket Association and was President of the Singapore Khalsa Association. Singh was in charge in building the Singapore Central Sikh Temple as well assisted in building the Silat Road Sikh Temple\n",
  "language": "en",
  "processed_at": "2026-01-12T11:07:59.469760",
  "title": "Gurcharan Singh Sekhon",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Gurcharan_Singh_Sekhon"
}