{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:08:05.534169"
  },
  "content": "* *Habyt Cantonment**, also known as **150 Cantonment Road** and formerly as **Hmlet Cantonment**, is a [co-living space](/wiki/Co-living) on [Cantonment Road](/wiki/Cantonment_Road,_Singapore) in [Tanjong Pagar, Singapore](/wiki/Tanjong_Pagar). The buildings were completed in 1954 as **Keppel School** and **Cantonment School**, which later merged to form the **Keppel Primary School**, which then closed down in 1996. From 1998 to 2004, it served as the headquarters of the [Corrupt Practices Investigation Bureau](/wiki/Corrupt_Practices_Investigation_Bureau). It reopened as a co-living space in 2019. ## Description The buildings, which are presently designated \"Block A\" and \"Block B\" and standing on a site around 76,000 sqft large, have a gross floor area of around 47,000 sqft with 150 rooms in total. According to Sheila Chiang of *[Yahoo! News](/wiki/Yahoo!_News)*, it features a \"unique juxtaposition between old-school origins and modern design.\" The interior was designed in the \"Contemporary Scandinavian\" theme. It features vertical gardens with potted cacti and trees. The outdoor area, which was once \"[kampung](/wiki/Kampung)-styled\" with facilities for football, durian and popiah parties, and barbeques, features a plunge pool, a designated smoking area, seating and foliage. Block A features an original staircase with handrails made of terrazzo and feature walls, as well as the Wellness Studio for in-house yoga sessions. Block B features an \"honesty bar\", a kitchen and a lounge area. It also features brick walls left exposed \"on purpose to lend itself to the old-school feel\". The buildings' original windows and grilles have also been retained. ## History The schools, which were both built by the [Public Works Department](/wiki/Public_Works_Department_(Singapore)) for $250,000 each, were handed over to the Education Department on 1 September 1954 following their completion. They were built in a \"new design\", with offices, a tiffin shed and bathrooms, and shared a playing field. Both were designed to accommodate 2,400 children. The building closer to Cantonment Road was named Cantonment School while the other was named Keppel School. Students who had enrolled before the schools' completion temporarily attended lessons at the [Gan Eng Seng School](/wiki/Gan_Eng_Seng_School) on [Anson Road](/wiki/Anson,_Singapore). Both schools were officially declared open by Chia Kim Neo, who was the wife of then-Legislative Councillor [Lim Yew Hock](/wiki/Lim_Yew_Hock), along with Pearl Bank School and Park Road School. In 1979, 0.37 ha of the schools' combined total 0.89 ha land area, which included the Keppel School's dental clinic, the basketball court and part of the playing field at the Cantonment School, was taken over by the government for the widening of Cantonment Road. As a result, students requiring dental care had to travel to the [Institute of Health](/wiki/Singapore_General_Hospital). A three-metre tall brick wall was also built to lessen the noise from the construction works. It was announced in March of that year that the government was looking into moving the schools elsewhere as the site had become \"unsuitable for schools\". In 1984, both schools merged to form the Keppel Primary School. In November 1989, the school began a \"make-your-own-rule regime\" in which the students suggested rules which were reviewed and selected by the prefects. It was the first primary school in Singapore to feature such a system. In 1996, the school merged with the Zhangde Primary School, after which the [Land Office](/wiki/Singapore_Land_Authority) took over the buildings. On 9 March 1998, the Corrupt Practices Investigation Bureau moved into the site from its former premises at the Hill Street Centre. According to Roots, published by the [National Heritage Board](/wiki/National_Heritage_Board_(Singapore)), employees would play football on the grounds of the site after work. In April 2004, it moved to Lengkok Bahru. In April 2019, it was announced that the buildings had been acquired by Singapore-based co-living company Hmlet, which partnered with LHN Facilities Management, with the latter being responsible for the buildings' renovations. It opened in July as the largest co-living space in Singapore at the time. In July 2023, it was renamed Habyt Cantonment as a result of Hmlet's 2022 merger with Berlin-based co-living space company Habyt. 1°16′28″N 103°50′27″E﻿ / ﻿1.27435°N 103.84074°E﻿ / 1.27435; 103.84074\n",
  "language": "en",
  "processed_at": "2026-01-12T11:08:05.533598",
  "title": "Habyt Cantonment",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Habyt_Cantonment"
}