{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:08:07.524220"
  },
  "content": "Singaporean organisation **HackerspaceSG** is a 826-square-foot (76.7 m2) technology community center and [hackerspace](/wiki/Hackerspace) in [Singapore](/wiki/Singapore). While predominantly an open working space for software projects, HackerspaceSG is also a landmark of the Singapore [DIY](/wiki/Do_it_yourself) [movement](/wiki/Maker_subculture), and also hosts a range of events from technology classes to biology, computer hardware, and manufacturing. The space is open to all types of [hackers](/wiki/Hacker_culture). ## History HackerspaceSG was initially founded by four people in late 2009. The four people came up with the idea after reading about [similar centres](/wiki/Hackerspace) that have opened up around the world, specifically in the United States, China and Japan. Wong Meng Weng envisioned HackerspaceSG as a spot where hackers and other [geeks](/wiki/Geek) can congregate, exchange ideas and come up with cool applications, and where the clubhouse is a \"combination of living room, science lab, and shared office space for the geek community\". Though the plan was initially to just have a place for geeks to gather and network, this soon evolved into a co-working space catering mainly to tech startups. The institution has often been recognised as Singapore's first co-working space. During the Singapore start-up 2.0 boom, it was also touted in the mainstream media as a meeting space for the [start-up](/wiki/Startup_company) and [entrepreneurship](/wiki/Entrepreneurship) communities, even hosting [Facebook](/wiki/Facebook)'s co-founder [Eduardo Saverin](/wiki/Eduardo_Saverin) when he was in Singapore. ### Physical space The first iteration of HackerspaceSG was located at 70A Bussorah Street in Singapore. The 2-year lease was extended once, but in October 2013, the landlord expressed a desire to develop the Bussorah Street unit into two distinct units. This meant that members would have had to endure dust and noise, and it was unlikely that the units would be leased back to HackerspaceSG at existing rates when the lease was renewed. In October and November 2013, a search for a new location commenced, with the membership finally settling on 344B King George's Avenue. A lease was signed on November 11, 2013, and move-in occurred on the next day. In November 2021, due to increasing [rents](/wiki/Lease) and the [COVID-19 pandemic](/wiki/COVID-19_pandemic), HackerspaceSG moved to a different unit within King George's Building, to 336D King George's Avenue. In December 2024, HackerspaceSG moved for the third time to its current address in Textile Centre. ## Organisation HackerspaceSG is a not-for-profit [membership organisation](/wiki/Membership_organisation), with many [chores](/wiki/Housekeeping) and activities performed by [self-directed](/wiki/Workers%27_self-management) member volunteers. Organisational decisions are proposed and discussed at monthly [plenums](/wiki/Plenum_(meeting)), and decided mostly by [consensus](/wiki/Consensus_decision-making). A [board](/wiki/Board_of_directors) handles [administration](/wiki/Business_administration) and [government-mandated filings](/wiki/Corporate_governance). The organisation has open membership: anybody can become a member. It is primarily financed through membership dues, but is open to accepting 3rd party [sponsorships](/wiki/Sponsor_(commercial)) to fund expansions and renovations. ## Culture HackerspaceSG is entirely communal space, from the tools in the electronics lab, to the desks, to the food in the refrigerator. Anything left in the space is considered fair game for anybody to play with. Very few restrictions are placed upon people, as long as they do not detract from the experience of members or consume resources they do not replace. Any member may host an event in the space. ### Partnerships Some partnerships formed in HackerspaceSG have been the subject of controversy and media coverage, like the organisation of a [nyotaimori](/wiki/Nyotaimori) event as a part of a series of themed dinners. ## Notable businesses with HackerspaceSG history - [Viki](/wiki/Viki_(website)) - JFDI.Asia - Islamicevents.sg - Hackerspace.SG - \"The official HackerspaceSG Google Group\" - \"What do Seattle, Silicon Valley, Berlin and Cambridge (both Cambridges) Have In Common?\". e27. October 14, 2009 - \"Co-Workers of the World, Unite at Hackerspace.SG\". Tech in Asia. October 16, 2009 - \"Developing a 'hacker' culture of ideas, innovation\". ZDNet. November 9, 2010. - \"High-tech tinkerers on the rise\" The Straits Times. May 5, 2011.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:08:07.523750",
  "title": "HackerspaceSG",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/HackerspaceSG"
}