{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:08:13.480408"
  },
  "content": "19th-century organization based in PenangCriminal organization The **Hai San Society** ([Chinese](/wiki/Chinese_language): 海山公司; [pinyin](/wiki/Pinyin): *Hǎi Shān Gōng Sī*; [Jyutping](/wiki/Jyutping): *Hoi2 Saan1*; [Pe̍h-ōe-jī](/wiki/Pe%CC%8Dh-%C5%8De-j%C4%AB): *Hái-san*; [Pha̍k-fa-sṳ](/wiki/Pha%CC%8Dk-fa-s%E1%B9%B3): *Hói-sân*), which had its origins in Southern China, was a [Penang](/wiki/Penang)-based Chinese secret society established around 1820 and in 1825 led by Low, Ah Chong and Hoh Akow (also spelt Ho Ah Kow or Hok Ah Keow), its titular head. At that time the society's headquarters was located at Beach Street (Ujong Passir). ## History The existence of secret societies in Penang can be traced back to the founding of Penang in 1799. [Thomas John Newbold](/wiki/Thomas_John_Newbold) (1807–1850), an officer in the 23 Regiment, Madras Light Infantry, in Malacca (1832–1835) noted: > *The secret fraternities in which they (the Chinese settlers) enroll themselves for mutual protection and support, prove powerful engines for political combinations, as the Dutch have repeatedly experienced during their long administration in Java and in the Malay States. In China itself, these societies are deemed so dangerous to the Government as to be interdicted under penalty of death.* > > *At Pinang in 1799, they set the administration in defiance and strong measures were necessary to reduce them to obedience. Even in the present-day, the ends of justice are frequently defeated both at Pinang, Malacca, and Singapore: by bribery, false swearing, and sometimes by open violence, owing to combinations of these fraternities, formed for the purpose of screening guilty members from detection and punishment.* > > *In European Settlements, they are under the general control of an officer, or headman styled \"Capitan\", who receives a salary from the Government and is responsible in some measure, for the orderly conduct of his countrymen, whose representative and official organ he is. Their interior affairs, disputes, and private interests are arranged by the heads of their respective \"Kongsis\" or fraternities.* Bolton et al. suggest that the Hai San society started out mostly Cantonese and pro-[Ghee Hin](/wiki/Ghee_Hin) but by around 1854 had absorbed the Wah Sang society and become almost exclusively Hakka and anti-Ghee Hin. ## Larut Wars The Hai San society figure prominently in the [Larut Wars](/wiki/Larut_War) of 1862–1873 and by that time was headed by [Chung Keng Quee](/wiki/Chung_Keng_Quee) or Chung Ah Kwee. At [Larut](/wiki/Taiping,_Perak), miners who were members of the Hai San society fought with miners who were members of the Ghee Hin society over the tin-rich fields of Kelian Pauh and Kelian Baru. The two warring factions also clashed in [Selangor](/wiki/Selangor). The Hai San society was allied with the Penang-based Tokong or Tua Peh Kong society, members of whom financed the mining of tin in the Larut area. The incessant warfare between the Hai San and Ghee Hin brought tin mine production to a standstill. The fighting between the two societies was brought to an end with the signing of a treaty between the two parties in 1874, known as The [Pangkor Treaty of 1874](/wiki/Pangkor_Treaty_of_1874). Many of the new settlers were sacrificed in the wars waged among the Ghee Hin and Hai San groups. Many of these long lost tribes still hold grudges against one another. - [Ghee Hin Kongsi](/wiki/Ghee_Hin_Kongsi) - [Secret society](/wiki/Secret_society) ## Notes - Encyclopædia Britannica - Hai San - \"Chinese Secret Societies\" by Frederick Boyle, published in Harper's New Monthly Magazine Volume 83, Issue 489. - Hakka secret society in Malaya - Hai San - Political and Statistical Account of the British Settlements in the Straits of Malacca, Viz: Pinang, Malacca, and Singapore By Thomas John Newbold, Published by J. Murray, 1839\n",
  "language": "en",
  "processed_at": "2026-01-12T11:08:13.479932",
  "title": "Hai San Secret Society",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Hai_San_Secret_Society"
}