{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:08:15.986039"
  },
  "content": "Southeast Asian rice and chicken dish **Hainanese chicken rice** is a dish of poached chicken and seasoned rice, served with chilli sauce and usually with cucumber garnishes. It was created by immigrants from [Hainan](/wiki/Hainan) in [southern China](/wiki/Southern_China) and adapted from the [Hainanese dishes](/wiki/Hainan_cuisine) of [Wenchang chicken](/wiki/Wenchang_chicken) and Wenchang chicken rice. It is widely considered one of the [national dishes](/wiki/National_dish) of [Singapore](/wiki/Singapore), and is most commonly associated with [Singaporean cuisine](/wiki/Singaporean_cuisine), being widely available in most food courts and [hawker centres](/wiki/Hawker_centre) around the country. Variants of the dish can also be seen throughout [Southeast Asia](/wiki/Southeast_Asia) where [Hainanese people](/wiki/Hainan_people) settled, particularly in [Indonesia](/wiki/Indonesian_cuisine), [Malaysia](/wiki/Malaysian_cuisine), [Thailand](/wiki/Thai_cuisine), and [Vietnam](/wiki/Vietnam), where it remains a culinary staple. ## History Hainanese chicken rice is a dish adapted from early Chinese immigrants originally from [Hainan province](/wiki/Hainan) in southern China. It is based on a well-known Hainanese dish called [Wenchang chicken](/wiki/Wenchang_chicken), which is one of four important Hainan dishes dating to the [Qing dynasty](/wiki/Qing_dynasty). The original dish was adapted by the [Hainanese](/wiki/Hainan_people) [overseas Chinese](/wiki/Overseas_Chinese) population in the [Nanyang](/wiki/Nanyang_(region)) area (present-day Southeast Asia). The Hainanese in China traditionally used a specific breed, the Wenchang chicken, to make the dish. They would usually cook rice with the leftover chicken stock to create a dish known as \"Wenchang chicken rice\" (文昌鸡饭). Wenchang chicken rice remained a dish for special occasions in Hainanese homes in Singapore until the 1940s. There is a shared culture of seasoned rice dishes across [Hainan](/wiki/Hainan) and the [Leizhou peninsula](/wiki/Leizhou_Peninsula). Wenchang chicken rice is closely related to another chicken rice dish known as Anpu chicken rice (安铺鸡饭) from [Zhanjiang](/wiki/Zhanjiang) in western [Guangdong province](/wiki/Guangdong), and Anpu chicken rice is speculated to be the predecessor to Wenchang chicken rice. The city of Zhanjiang is also known for its [wild betel](/wiki/Piper_sarmentosum) rice (蛤蒌饭) and duck rice (鸭仔饭). Almost every country in Asia with a history of immigration from China has a version of Hainanese chicken rice. The [San Francisco Chronicle](/wiki/San_Francisco_Chronicle) says, \"the dish maps 150 years' immigration from China's Hainan Island...to Singapore and Malaysia, where the dish is often known as Hainan chicken rice; to Vietnam, where it is called \"Hai Nam chicken\"; and to Thailand, where it has been renamed *khao man gai* (\"chicken fat rice\").\" When it comes to the history of [Wenchang chicken](/wiki/Wenchang_chicken), according to the records of Lin Zhemin from the Livestock and Veterinary Research Institute of [Hainan Province](/wiki/Hainan_Province), it has long been a delicacy used by local officials and people to entertain guests. According to the Hainan Chamber of Commerce, it is said that during the [Ming Dynasty](/wiki/Ming_Dynasty), a Wenchang native served in the imperial court and brought Wenchang chicken back from his hometown to entertain members of the [royal family](/wiki/Royal_family) during the [Lunar New Year](/wiki/Lunar_New_Year). As they tasted it, the royals praised, \"This chicken hails from the land of culture, where talents gather and the culture flourishes. The chicken is also delicious and fragrant, truly deserving the name Wenchang chicken!\" Additionally, during the reign of the [Guangxu Emperor](/wiki/Guangxu_Emperor) of the [Qing Dynasty](/wiki/Qing_Dynasty), there were several large [banyan](/wiki/Banyan) trees in Wenchang, which bore seeds all year round. The chickens pecked at these seeds and became plump and delicious, contributing to the reputation of Wenchang chicken's deliciousness. The earliest mention can be found in the Qing Dynasty book \"Lingnan Miscellaneous Poems\", which states, \"There is a kind of hen in Wenchang County that tastes as good as a rooster.\" Based on historical records and inference, Wenchang chicken was introduced to Hainan Island, specifically Wenchang County, around the early 1600s during the Ming Dynasty, along with mainland immigrants, and was cultivated in this unique natural environment. By the Ming and Qing dynasties, there was already a tradition of raising Wenchang chickens in rural areas of Wenchang. It was mainly used as a delicacy for festivals, entertaining guests, and giving gifts. After the revolution in China in 1949, it was still difficult to buy or eat Wenchang chicken in the market or restaurants. According to a 2006 study in \"Meat Research\", Wenchang chicken is a high-quality chicken breed in Hainan with a history of over 400 years and is one of the four famous dishes of Hainan. In the 1980s, due to the impact of foreign chicken breeds, Wenchang chicken was once on the brink of extinction. ### Controversy over origin In a debate that stretches back decades to 1965, when the two countries split, Malaysia and Singapore have both laid claim to inventing the dish. In 2009, Malaysian Tourism Minister [Ng Yen Yen](/wiki/Ng_Yen_Yen) said that Hainanese chicken rice was \"uniquely Malaysian\" and had been \"hijacked\" by other countries. Ng later clarified that she was misquoted on her intention to patent the foods, and that a study on the origins of the foods would be conducted \"and an apology conveyed if it was wrongly claimed.\" In 2018, then Malaysian Finance Minister [Lim Guan Eng](/wiki/Lim_Guan_Eng) joked that Singapore claimed \"chicken rice is theirs (and) if we're not careful, '[char koay teow](/wiki/Char_kway_teow)' will become theirs\" one day. The debate has been described as an example of [gastronationalism](/wiki/Gastronationalism). ## Reception Catherine Ling of *[CNN](/wiki/CNN)* called Hainanese chicken rice one of the \"40 Singapore foods we can't live without\". It was listed as one of the \"World's 50 best foods\" by CNN in 2018. David Farley of the [BBC](/wiki/BBC) called it \"the dish worth the 15-hour flight\" and said it was \"deceptively simple – which is good, because on paper it sounds awfully boring.\" *[Saveur](/wiki/Saveur)* called it \"one of the most beloved culinary exports of Southeast Asia.\" ## Variations ### Malaysia In Malaysia, *nasi ayam* (lit. \"chicken rice\" in [Bahasa Melayu](/wiki/Bahasa_Melayu)) is \"a culinary staple\" and a popular street food, particularly in [Ipoh](/wiki/Ipoh), a center of Hainanese immigration. The general term *nasi ayam* can refer to multiple variations including roasted and fried chicken, can be served with a variety of sauces including barbecue, and can be accompanied by a variety of side dishes including steamed rice rather than seasoned 'oily' rice, soup, or chicken [offal](/wiki/Offal). In [Malacca](/wiki/Malacca) and [Muar](/wiki/Muar_(town)), the rice is served in balls rather than in bowls; this dish is commonly known as *Chicken rice balls*. [Steamed rice](/wiki/Steamed_rice) is shaped into golf ball-sized orbs and served alongside the chopped chicken. ### Singapore In Singapore, the dish was born out of frugality, created by servant-class immigrants trying to utilise limited sources to its maximum. An old hen which had passed its eggs laying years would be slaughtered to be cooked into broth and rice to extract the chicken flavour. The first chicken rice restaurants opened in Singapore during [Japanese occupation](/wiki/Japanese_occupation_of_Singapore) in World War II, when the British were forced out and their Hainanese servants lost their source of income. One of the first was Yet Con, which opened in the early 1940s. There were also sources stating that Wang Yiyuan, a street hawker first started selling \"chicken rice balls wrapped in banana leaves\" in Singapore during the 1920s. The dish was popularised in Singapore in the 1950s by Moh Lee Twee, whose Swee Kee Chicken Rice Restaurant operated from 1947 to 1997. Hong Kong food critic [Chua Lam](/wiki/Chua_Lam) credits Moh with the creation of the dish. Hainanese chicken rice is considered one of Singapore's [national dishes](/wiki/National_dish). It is eaten \"everywhere, every day\" in Singapore and is a \"ubiquitous sight in hawker centres across the country\". The chicken is typically served with seasoned rice, with chilli sauce and usually with cucumber garnishes. While most commonly associated with Singaporean cuisine, the dish is also seen throughout Southeast Asia and in parts of the United States, where the dish is named \"Singapore chicken rice\" in some places. The dish is widely popular in Singapore and can be found in hawker centres, restaurants and hotels. The [chicken](/wiki/Chicken_(food)) is prepared in accordance with traditional Hainanese methods, which involve [poaching](/wiki/Poaching_(cooking)) the entire chicken at sub-boiling temperatures to both cook the chicken and produce the stock. The chicken is dipped in ice after cooking to produce a jelly-like skin finishing and hung to dry. The stock is skimmed of fat and some of the fat and liquid, along with [ginger](/wiki/Ginger), garlic, and [pandan leaves](/wiki/Pandan_leaves), are used in the cooking of the rice, producing an oily, flavourful rice sometimes known as \"oily rice\". In Singapore \"the most important part of chicken rice is not the chicken, but the rice.\" The dish is served with a dipping sauce of freshly minced red chilli and garlic, usually accompanied with [dark soy sauce](/wiki/Dark_soy_sauce) and freshly ground ginger. Fresh cucumber boiled in the chicken broth and light soy sauce with a dash of sesame oil is served with the chicken, which is usually served at room temperature. Some stalls may also serve [nonya achar](/wiki/Peranakan_cuisine#List_of_Nonya_dishes) as an additional side. ### Thailand Hainanese chicken rice is a common [dish in Thailand](/wiki/Thai_cuisine) where it is called *khao man kai* ([Thai](/wiki/Thai_language): ข้าวมันไก่, pronounced [kʰâːw mān kàj]), literally meaning \"chicken oily rice\". The chickens used in Thailand for this dish are usually free range chickens of local breeds, resulting in a leaner and tastier texture; however, meat from chickens of [large scale poultry farms](/wiki/Poultry_farming#Intensive_chicken_farming) is increasingly being used. *Khao man kai* is served with a garnish of cucumbers and occasionally chicken [blood tofu](/wiki/Blood_tofu) and fresh [coriander](/wiki/Coriander), along with a bowl of *nam sup*, a clear chicken broth which often contains sliced [daikon](/wiki/Daikon). The accompanying sauce is most often made with [tauchu](/wiki/Tauchu) (also known as [yellow soybean paste](/wiki/Yellow_soybean_paste)), thick soy sauce, chilli, ginger, garlic and vinegar. One famous Bangkok neighbourhood for *Khao man kai* is [Pratunam](/wiki/Pratunam) in [Ratchathewi](/wiki/Ratchathewi) district, located near to [Platinum Fashion Mall](/wiki/Platinum_Fashion_Mall), [CentralWorld](/wiki/CentralWorld) and [Ratchaprasong Intersection](/wiki/Ratchaprasong_Intersection). A restaurant in [Pratunam](/wiki/Pratunam) received [Bib Gourmand](/wiki/Bib_Gourmand) awards from the 2018 Michelin Guide. *Khao man kai* is also well known in other areas, including [Pracha Chuen](/wiki/Pracha_Chuen), [Yaowarat](/wiki/Yaowarat) and [Phasi Charoen](/wiki/Phasi_Charoen) near [Bang Wa BTS station](/wiki/Bang_Wa_BTS_station) and [Phyathai 3 Hospital](/wiki/Phyathai_3_Hospital) including various places are [Thanon Tok](/wiki/Thanon_Tok) near [Rama III Bridge](/wiki/Rama_III_Bridge), [Thong Lor](/wiki/Thong_Lor) on [Sukhumvit Road](/wiki/Sukhumvit_Road), [Wat Suthiwararam School](/wiki/Wat_Suthiwararam_School), [Yan Nawa](/wiki/Yan_Nawa), [Bang Kapi](/wiki/Bang_Kapi), [Wat Saket](/wiki/Wat_Saket), and [Saphan Kwai](/wiki/Saphan_Kwai) neighbourhoods. ### Vietnam The dish is known as *Cơm Gà Hải Nam* in Vietnamese, and is common in South Vietnam. ### Cambodia In [Cambodia](/wiki/Cambodian_cuisine), the dish is known as *bay moan* (បាយមាន់) in [Khmer](/wiki/Khmer_language), which translates to \"chicken rice\". An assortment of pickled vegetables is served alongside as a [street food](/wiki/Street_food). Its origins can be traced back to the 17th century, where it is believed to have been introduced by [Hokkien](/wiki/Hokkien) and [Hainanese](/wiki/Hainanese) immigrants. ## In popular culture - *Khao man kai* is a 1998 [Ruangsak \"James\" Loychusak](/wiki/Ruangsak_Loychusak) [single](/wiki/Single_(music)). Loychusak's grandmother sold *Khao man kai* in his native [Nakhon Si Thammarat](/wiki/Nakhon_Si_Thammarat_province). - *[Rice Rhapsody](/wiki/Rice_Rhapsody)* (alternative title *Hainan Chicken Rice*) is a 2004 Singaporean comedy set in a successful chicken rice restaurant in [Singapore's Chinatown](/wiki/Chinatown,_Singapore).[*citation needed*] - *[Chicken Rice War](/wiki/Chicken_Rice_War)* is a 2000 Singaporean romantic comedy adaptation of Romeo and Juliet featuring two rival chicken rice hawker families whose children fall in love. - Hainanese chicken rice was featured on the [Netflix TV series](/wiki/List_of_original_programs_distributed_by_Netflix) *[Street Food](/wiki/Street_Food_(TV_series))* in season 1. - Hainanese chicken rice was featured on the 2025 TV [Anime](/wiki/Anime) Series *[Mobile Suit Gundam GQuuuuuuX](/wiki/Mobile_Suit_Gundam_GQuuuuuuX)*.[*citation needed*] However, Hainanese chicken rice also been trending on Japanese [Twitter (X)](/wiki/Twitter) in Hashtag #Khaomankai (カオマンガイ). - Indonesia portal - Malaysia portal - Singapore portal - Thailand portal - [Wenchang chicken](/wiki/Wenchang_chicken) - [Laksa](/wiki/Laksa) - [Peranakan cuisine](/wiki/Peranakan_cuisine) - [Chinese Indonesian cuisine](/wiki/Chinese_Indonesian_cuisine)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:08:15.985546",
  "title": "Hainanese chicken rice",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Hainanese_chicken_rice"
}