{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:08:21.860174"
  },
  "content": "Sinitic language originating in southern ChinaThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Hakka Chinese\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(January 2024)* *(Learn how and when to remove this message)* **Hakka** ([Chinese](/wiki/Chinese_language): 客家话; [pinyin](/wiki/Pinyin): *Kèjiāhuà*; *[Pha̍k-fa-sṳ](/wiki/Pha%CC%8Dk-fa-s%E1%B9%B3): *Hak-kâ-va / Hak-kâ-fa**, [Chinese](/wiki/Chinese_language): 客家语; [pinyin](/wiki/Pinyin): *Kèjiāyǔ*; *[Pha̍k-fa-sṳ](/wiki/Pha%CC%8Dk-fa-s%E1%B9%B3): *Hak-kâ-ngî**) forms a language group of [varieties of Chinese](/wiki/Varieties_of_Chinese), spoken natively by the [Hakka people](/wiki/Hakka_people) in parts of Southern [China](/wiki/China), [Taiwan](/wiki/Taiwan), some [diaspora](/wiki/Diaspora) areas of [Southeast Asia](/wiki/Southeast_Asia) and in [overseas Chinese](/wiki/Overseas_Chinese) communities around the world. Due to its primary usage in isolated regions where communication is limited to the local area, Hakka has developed numerous [varieties](/wiki/Variety_(linguistics)) or [dialects](/wiki/Dialect), spoken in different provinces, such as [Guangdong](/wiki/Guangdong), [Guangxi](/wiki/Guangxi), [Hainan](/wiki/Hainan), [Fujian](/wiki/Fujian), [Sichuan](/wiki/Sichuan), [Hunan](/wiki/Hunan), [Jiangxi](/wiki/Jiangxi), [Guizhou](/wiki/Guizhou), as well as in [Taiwan](/wiki/Taiwan), [Singapore](/wiki/Singapore), [Malaysia](/wiki/Malaysia), [Thailand](/wiki/Thailand) and [Indonesia](/wiki/Indonesia). Hakka is not [mutually intelligible](/wiki/Mutual_intelligibility) with [Yue](/wiki/Yue_Chinese), [Wu](/wiki/Wu_Chinese), [Min](/wiki/Min_Chinese), [Mandarin](/wiki/Mandarin_Chinese) or other branches of Chinese, and itself contains a few mutually unintelligible varieties. It is most closely related to [Gan](/wiki/Gan_Chinese) and is sometimes classified as a variety of Gan, with a few northern Hakka varieties[*which?*] even being partially mutually intelligible with southern Gan. There is also a possibility that the similarities are just a result of shared [areal features](/wiki/Areal_feature). Taiwan designates [Hakka](/wiki/Taiwanese_Hakka) as one of its [national languages](/wiki/National_language), thus regarding the language as a subject for its study and preservation. Pronunciation differences exist between the [Taiwanese Hakka](/wiki/Taiwanese_Hakka) dialects and mainland China's Hakka dialects; even in Taiwan, two major local varieties of Hakka exist. The [Meixian dialect](/wiki/Meixian_dialect) (Moiyen) of northeast [Guangdong](/wiki/Guangdong) in mainland China has been taken as the \"standard\" dialect by the government of mainland China. The Guangdong Provincial Education Department created an official [romanization of Moiyen](/wiki/Guangdong_Romanization) in 1960, one of four languages receiving this status in Guangdong. The [She](/wiki/She_people) ethnic group and Hakka people have a history of contact; the [She Chinese](/wiki/She_Chinese) language is either closely related to or heavily influenced by Hakka, if not both. ## Etymology The name of the [Hakka people](/wiki/Hakka_people) who are the predominant original native speakers of the variety literally means \"guest families\" or \"guest people\": *Hak* (Mandarin: *kè*) means \"guest\", and *ka* (Mandarin: *jiā*) means \"family\". Among themselves, Hakka people variously called their language *Hak-ka-fa* (*-va*), *Kak-ka-fa* (*-va*), *Hak-fa* (*-va*), *Kak-fa* (*-va*), *Tu-gong-dung-fa* (*-va*), literally \"Native Guangdong language\", and *Ngai-fa* (*-va*), \"My/our language\". In [Tonggu County](/wiki/Tonggu_County), [Jiangxi](/wiki/Jiangxi) province, people call their language *Huai-yuan-fa*. ## History ### Early history It is commonly believed that [Hakka people](/wiki/Hakka_people) have their origins in several episodes of migration from northern [China](/wiki/China) into southern [China](/wiki/China) during periods of war and civil unrest dating back as far as the end of [Western Jin](/wiki/Western_Jin). The forebears of the Hakka came from present-day [Central Plains](/wiki/Central_Plains_(China)) provinces of [Henan](/wiki/Henan) and [Shaanxi](/wiki/Shaanxi), and brought with them features of Chinese varieties spoken in those areas during that time. (Since then, the speech in those regions has evolved into dialects of modern [Mandarin](/wiki/Mandarin_Chinese)). The presence of many archaic features occur in modern Hakka, including final consonants -p -t -k, as are found in other modern southern Chinese varieties, but which have been lost in Mandarin. [Laurent Sagart](/wiki/Laurent_Sagart) (2002) considers Hakka and southern [Gan Chinese](/wiki/Gan_Chinese) to be sister dialects that descended from a single common ancestral language (Proto-Southern Gan) spoken in central Jiangxi during the [Song Dynasty](/wiki/Song_Dynasty). In Hakka and southern Gan, Sagart (2002) identifies a non-Chinese [substratum](/wiki/Substrata_(linguistics)) that is possibly [Hmong-Mien](/wiki/Hmong-Mien_languages), an archaic layer, and a more recent Late [Middle Chinese](/wiki/Middle_Chinese) layer. Lexical connections between Hakka, Kra-Dai, and Hmong-Mien have also been suggested by Deng (1999). Due to the migration of its speakers, Hakka may have been influenced by other language areas through which the Hakka-speaking forebears migrated. For instance, common vocabulary is found in Hakka, [Min](/wiki/Min_Chinese), and the [She](/wiki/She_language) (Hmong–Mien) languages.[*citation needed*] Today, most [She people](/wiki/She_people) in Fujian and Zhejiang speak [She](/wiki/She_Chinese), which is closely related to Hakka. ### Linguistic development A regular pattern of sound change can generally be detected in Hakka, as in most Chinese varieties, of the derivation of [phonemes](/wiki/Phoneme) from earlier forms of Chinese. Some examples: - Characters such as 武 (war, martial arts) or 屋 (room, house), pronounced roughly *mwio* and *uk* (*mjuX* and *ʔuwk* in [Baxter's transcription](/wiki/Baxter%27s_transcription_for_Middle_Chinese)) in Early [Middle Chinese](/wiki/Middle_Chinese), have an initial *v* phoneme in Hakka, being *vu* and *vuk* in Hakka respectively. Like in Mandarin, labiodentalisation in Hakka also changed *mj-* to a w-like sound before grave vowels, while Cantonese retained the original distinction (compare Mandarin 武 *wǔ*, 屋 *wū*, Cantonese 武 *mou*5, 屋 *uk*1). - Middle Chinese initial phonemes /ɲ/ (*ny* in Baxter's transcription) of the characters 人 (person, people) and 日 (sun, day), among others, merged with *ng-* /ŋ/ initials in Hakka (人 *ngin*, 日 *ngit*). For comparison, in Mandarin, /ɲ/ became *r-* /ɻ/ (人 *rén*, 日 *rì*), while in Cantonese, it merged with initial *y-* /j/ (人 *yan*4, 日 *yat*6). - The initial consonant phoneme exhibited by the character 話 (word, speech; Mandarin *huà*) is pronounced *f* or *v* in Hakka (*v* does not properly exist as a distinct unit in many Chinese varieties). - Word-initial *h* [h] as in 學 *hɔk* usually corresponds with a voiceless alveo-palatal fricative (*x* [ɕ]) in Mandarin. ## Phonology ## Dialects Hakka has as many regional dialects as there are counties with Hakka speakers as the majority. Some[*which?*] of these Hakka dialects are not mutually intelligible with each other. [Meixian](/wiki/Mei_County,_Guangdong) is surrounded by the counties of [Pingyuan](/wiki/Pingyuan_County,_Guangdong), [Dabu](/wiki/Dabu_County), [Jiaoling](/wiki/Jiaoling), [Xingning](/wiki/Xingning,_Guangdong), [Wuhua](/wiki/Wuhua_County), and [Fengshun](/wiki/Fengshun). Each county has its own special phonological points of interest. For instance, Xingning lacks the codas [-m] and [-p]. These have merged into [-n] and [-t], respectively. Further away from Meixian, the [Hong Kong](/wiki/Hong_Kong) dialect lacks the [-u-] medial, so whereas the Meixian dialect pronounces the character 光 as [kwɔŋ˦], the Hong Kong Hakka dialect pronounces it as [kɔŋ˧], which is similar to the Hakka spoken in neighbouring [Shenzhen](/wiki/Shenzhen). Tones also vary across the dialects of Hakka. The majority of Hakka dialects have six tones. However, there are dialects which have lost all of their [checked tones](/wiki/Checked_tone) (*rusheng*), and the characters originally of this tone class are distributed across the non-*ru* tones. An example of such a dialect is [Changting](/wiki/Changting_County), which is situated in Western Fujian province. Moreover, there is evidence of the retention of an earlier Hakka tone system in the dialects of [Haifeng](/wiki/Haifeng) and [Lufeng](/wiki/Lufeng,_Guangdong), situated in coastal southeastern [Guangdong](/wiki/Guangdong) province. They contain a yin-yang splitting in the *qu* tone, giving rise to seven tones in all (with yin-yang registers in *ping* and *ru* tones and a *shang* tone). In [Taiwan](/wiki/Taiwan), there are two main dialects: Sixian and Hailu (alternatively known as Haifeng; Hailu refers to [Haifeng County](/wiki/Haifeng_County) and [Lufeng County](/wiki/Lufeng,_Guangdong)). Most Hakka speakers in Taiwan can trace their ancestry to these two regions. Sixian speakers come from Jiaying Prefecture, mainly from the four counties of Chengxiang (now [Meixian District](/wiki/Meixian_District)), Zhengping (now [Jiaoling](/wiki/Jiaoling)), [Xingning](/wiki/Xingning,_Guangdong) and [Pingyuan](/wiki/Pingyuan_County,_Guangdong). Most dialects of [Taiwanese Hakka](/wiki/Taiwanese_Hakka), except Sixian and Dabu, preserved [postalveolar consonants](/wiki/Postalveolar_consonant) ([tʃ], [tʃʰ], [ʃ] and [ʒ]), which are uncommon in other southern Chinese varieties. - [Huizhou dialect](/wiki/Huizhou_dialect) (not to be confused with [Huizhou Chinese](/wiki/Huizhou_Chinese)) - [Meixian dialect](/wiki/Meixian_dialect) (otherwise known as Meizhou) - [Wuhua dialect](/wiki/Wuhua_dialect) - Xingning dialect - Pingyuan dialect - Jiaoling dialect - Dabu dialect - Fengshun dialect - [Hailu dialect](/wiki/Hailu_dialect) - [Sixian dialect](/wiki/Sixian_dialect) - [Raoping dialect](/wiki/Raoping_dialect) - Zhaoan dialect - [Changting dialect](/wiki/Changting_dialect) *Ethnologue* reports the dialects of Hakka as being *Yue-Tai* (Meixian, Wuhua, Raoping, Taiwan Kejia: Meizhou above), *Yuezhong* (Central Guangdong), *Huizhou, Yuebei* (Northern Guangdong), *Tingzhou* (Min-Ke), *Ning-Long* (Longnan), *Yugui,* and *Tonggu.* ## Vocabulary Like other southern Chinese varieties, Hakka retains many single syllable words from earlier stages of Chinese; thus, a large number of syllables are distinguished by tone and final consonant. This reduces the need for compound words. However, like other Chinese varieties, it does have words of more than one syllable. Monosyllabic words CharacterPronunciationGloss淨[tsʰiaŋ˥˧]'clean'先[siɛn˦]'formerly'惜[siak˩]'care about'頑[man˩]'naughty'膦[lin˧˩]'penis'屋[ʋuk˩]'house'啜[tsɔi˥˧]'mouth'我[ŋai˩]'I', 'me'[b]渠 or 佢[ki˩]'he', 'she', 'it'[c]Polysyllabic words CharacterPronunciationGloss日頭[ŋit˩ tʰɛu˩]'sun'月光[ŋiat˥ kuɔŋ˦]'moon'屋下[ʋuk˩ kʰa˦]'home'電話[tʰiɛn˥ fa˥˧]'telephone'學堂[hɔk˥ tʰɔŋ˩]'school'筷子[kʰuai˥ tsɹ̩˧˩]'chopsticks' Hakka, as well as numerous other Chinese varieties such as Min and Cantonese, prefers the verb [kɔŋ˧˩] 講 when referring to 'saying', rather than the Mandarin *shuō* 說 (Hakka [sɔt˩] / [ʃɔt˩]). Hakka uses 食([sɘt˥] / [ʃit˥]) for the verb 'to eat' and 'to drink', unlike Mandarin which prefers *chī* 吃 (Hakka [kʰɛt˩] / [kʰiɛt˩]) as 'to eat' and *hē* 喝 (Hakka [hɔt˩]) as 'to drink' where the meanings in Hakka are different, 'to stutter' and 'be thirsty' respectively. Examples CharacterPronunciationGloss阿妹，若母去投墟轉來毋曾？[a˦ mɔi˥, ŋia˦ mɛ˦ hi˥ tʰɛu˩ hi˦ tsɔn˧˩ lɔi˩ m˩ tsʰiɛn˩]Has your mother returned from going to the market yet, child?厥老弟捉倒隻蛘葉來搞。[kia˧˥ lau˧˩ tʰai˦ tsuk˩ tau˧˩ tsak˩ iɔŋ˩ iap˥ lɔi˩ kau˧˩]His/her younger brother caught a butterfly to play with.好冷阿，水桶个水都凝冰阿。[hau˧˩ laŋ˧˥ ɔ˧, sui˧˩ tʰuŋ˧˩ kɛ˥ sui˧˩ du˦ kʰɛn˩ pɛn˦ ɔ˧]It's very cold, the water in the bucket has frozen over. ## Writing systems ### Chinese script Hakka Chinese is typically written using [Chinese characters](/wiki/Chinese_character) (漢字, *Hon-sṳ*). ### Latin script Various dialects of Hakka such as [Taiwanese Hakka](/wiki/Taiwanese_Hakka), is sometimes written in the [Latin script](/wiki/Latin_script) or [Pha̍k-fa-sṳ](/wiki/Pha%CC%8Dk-fa-s%E1%B9%B3). Dialects of Hakka have been written in a number of Latin orthographies, largely for religious purposes, since at least the mid-19th century. The popular *[The Little Prince](/wiki/The_Little_Prince)* has also been translated into Hakka (2000), specifically the [Miaoli](/wiki/Miaoli_County) dialect of Taiwan (itself a variant of the [Sixian dialect](/wiki/Sixian_dialect)). This also was dual-script, albeit using the [Tongyong Pinyin](/wiki/Tongyong_Pinyin) scheme.[*citation needed*] ## Media In 1950, China Central People's Broadcasting Station recruited the first Hakka broadcaster, Zhang Guohua, based on a radius of two kilometers from the Meixian government. On 10 April 1950, the **Voice of Hakka** (客家之聲) started broadcasting. It broadcast nine hours of Hakka Chinese programs every day through shortwave radio and online radio, targeting countries and regions where Hakka people gather, such as Japan, Indonesia, Mauritius, Reunion Island, Australia, Hong Kong and Taiwan. In 1988, Meizhou Television Station (梅州電視臺) was founded. In 1994, Hakka Public Channel, also known as Meizhou TV-2 had started broadcasting. Hakka Chinese began to appear in television programs. In 2021, it was renamed Hakka Life Channel (客家生活頻道). In 1991, Meizhou People’s Broadcasting Station (梅州人民廣播電臺), also known as Meizhou Wired Broadcasting Station (梅州有線廣播電臺) officially started broadcasting. Meizhou Radio News: FM94.8 or urban FM101.9. Meizhou Radio Traffic Channel: FM105.8 MHz. Meizhou Radio Private Car Channel: FM94.0 or urban FM103.9. Until now, Hakka Chinese is still used for news program, radio drama program, emotional program, entertainment program and cultural program. In 1999, 3CW Chinese Radio Australia (3CW澳大利亞中文廣播電臺) was launched. It used Mandarin, Cantonese and Hakka. In 2001, Meizhou Television Station merged with Meizhou People’s Broadcasting Station and was renamed Meizhou Radio and Television Station (MRT, 梅州廣播電視臺). In 2004, the station had officially completed its establishment. In 2003, [Taiwan Broadcasting System](/wiki/Taiwan_Broadcasting_System) established a Hakka satellite cable channel [Hakka TV](/wiki/Hakka_TV). In Taiwan, there are seven Hakka Chinese radio channels. In 2005, Meixian Radio and Television Station (梅縣廣播電視臺) was reorganized after the separation of the National Cultural System Reform Bureau. It is a public institution under the jurisdiction of the Meixian County Party Committee and County Government. The channel can be watched in Meizhou and surrounding area with an audience of over 4 million people. In 2012, Voice of Hong Kong (香港之聲) started broadcasting. Hakka Chinese is used on Sihai Kejia Channel. In 2019, Shenzhou Easy Radio (神州之聲) added a Hakka Chinese radio break which broadcasts to the southeast coast of Mainland China, Taiwan, Southeast Asia, the South Pacific and Japan. On Radio The Greater Bay (大灣區之聲), Sihai Kejia Channel has also joined. In 2023, the *[Xuexi Qiangguo](/wiki/Xuexi_Qiangguo)* platform under the supervision of the [Publicity Department of the Chinese Communist Party](/wiki/Publicity_Department_of_the_Chinese_Communist_Party) had added automatic broadcasting in Hakka Chinese.[*citation needed*] - [Varieties of Chinese](/wiki/Varieties_of_Chinese) - [Hakka culture](/wiki/Hakka_culture) - [Hakka Transliteration Scheme](/wiki/Hakka_Transliteration_Scheme) - [Pha̍k-fa-sṳ](/wiki/Pha%CC%8Dk-fa-s%E1%B9%B3) - [Hagfa Pinyim](/wiki/Hagfa_Pinyim) - [Protection of the Varieties of Chinese](/wiki/Protection_of_the_Varieties_of_Chinese) - [Taiwanese Hakka](/wiki/Taiwanese_Hakka) ## Notes - Taiwan Language Tool (including Hakka) Portals: - Language - China\n",
  "language": "en",
  "processed_at": "2026-01-12T11:08:21.859667",
  "title": "Hakka Chinese",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Hakka_Chinese"
}