{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:08:31.585482"
  },
  "content": "Malay warriorThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Hang Jebat\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(February 2024)* *(Learn how and when to remove this message)* **Hang Jebat** ([Jawi](/wiki/Jawi_script): هڠ جبت‎; born c. 1400) was the closest companion of the legendary Malaccan hero [Hang Tuah](/wiki/Hang_Tuah). Regarded in Malaysia as one of the greatest [silat](/wiki/Silat) exponents in history, he is well known for his vengeful rebellion against the [Malacca Sultan](/wiki/Sultanate_of_Malacca) and final duel with Hang Tuah, who he swore to avenge after he was wrongfully punished by the Sultan. Juxtaposed with Tuah's undying loyalty to the sultanate, Jebat is most remembered for his fierce defiance against unjust authority. ## Biography After [Hang Tuah](/wiki/Hang_Tuah) was sentenced to death, Hang Jebat was conferred the coveted [Taming Sari](/wiki/Taming_Sari) kris, a weapon formerly used by [Hang Tuah](/wiki/Hang_Tuah). Believing that [Hang Tuah](/wiki/Hang_Tuah) was unjustly murdered by the sultan he served, Hang Jebat turned against the ruler to avenge his friend's death. No one knew that the *bendahara* (chief minister) went against the royal decree and hid [Hang Tuah](/wiki/Hang_Tuah) in a remote area. With the kris in his possession, Hang Jebat was undefeatable and there was not one person in the palace who was capable of killing him. Hang Jebat's revenge allegedly became a palace killing spree or furious rebellion against the sultan (sources differ as to what actually occurred). It remains consistent, however, that Hang Jebat wreaked havoc onto the royal court, and the sultan was unable to stop him, as none of the warriors dared to challenge the more ferocious and skilled Hang Jebat. After learning from the bendahara that [Hang Tuah](/wiki/Hang_Tuah) was still alive, the sultan had him recall the warrior and gave him full amnesty. The sultan then ordered [Hang Tuah](/wiki/Hang_Tuah) to kill Hang Jebat. Being unquestionably loyal to the ruler, Hang Tuah obeyed the sultan's bidding and went on to challenge Hang Jebat. After fighting in a battle that lasted for seven days, [Hang Tuah](/wiki/Hang_Tuah) eventually managed to reclaim the Taming Sari by tricking Hang Jebat. Although stabbed by Tuah, Hang Jebat bandaged his wounds and ran [amok](/wiki/Running_amok) in the city square for three days, killing thousands of people before retreating to Tuah's house and dying in his friend's arms. Hang Jebat's famous quote during the fight was \"*Raja adil raja disembah, raja zalim raja disanggah*\" meaning \"A fair king is a king saluted, a tyrant king is a king disputed.\" This went against Tuah's philosophy of loyalty without question. After the fight, the sultan ordered his men to tear down, burn and throw the ashes of the house into the sea. Two months later, when a lady of the [bendahara](/wiki/Bendahara)'s retinue, [Dang Wangi](/wiki/Dang_Wangi) gave birth to Jebat's son, the sultan ordered Hang Tuah to throw the baby into the sea as well. Instead, the [laksamana](/wiki/Laksamana) entrusted the child, [Hang Nadim](/wiki/Hang_Nadim), to the bendahara. The child was then taken to [Singapura](/wiki/Singapura) where he was raised. ## Namesakes [KD *Jebat* (FFG29)](/wiki/KD_Jebat_(FFG29)), a [*Lekiu*-class frigate](/wiki/Lekiu-class_frigate) in the [Royal Malaysian Navy](/wiki/Royal_Malaysian_Navy), is named after him. The decommissioned [frigate](/wiki/Frigate) [KD *Rahmat*](/wiki/KD_Rahmat) was to be called KD *Hang Jebat*, but engine problems during building trials caused the navy to change her name to *Rahmat*.[*citation needed*] One of the oldest engines that pulls the trains along the Singapore-Malaysia rail route is also named after him. In [Singapore](/wiki/Singapore), there exists a minor road off Portsdown Avenue named \"Jalan Hang Jebat\" and a namesake mosque, [Masjid Hang Jebat](/wiki/Masjid_Hang_Jebat) at the road's end. In [Batam](/wiki/Batam), [Indonesia](/wiki/Indonesia), There is a road named Jalan Hang jebat - [Hang Jebat Stadium](/wiki/Hang_Jebat_Stadium)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:08:31.584999",
  "title": "Hang Jebat",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Hang_Jebat"
}