{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:08:33.687575"
  },
  "content": "15th-century figure from Malacca **Hang Tuah** ([Jawi](/wiki/Jawi_script): هڠ تواه, from [Malay](/wiki/Malay_language) [tuha] or [toh] (توه)) was a Malay warrior and [admiral](/wiki/Admiral)[note 1] who lived in [Malacca](/wiki/Malacca) during the reign of [Sultan Mansur Shah](/wiki/Mansur_Shah_of_Malacca) in the 15th century.[note 2] He was supposedly known as a diplomat and a [silat](/wiki/Silat) master. Hang Tuah is the most illustrious warrior figure in [Malay literature](/wiki/Classical_Malay_literature). However, he is somewhat a contested figure and [there is dispute](/wiki/Historicity) in regards about the factual basis on Hang Tuah's true life story. ## Historicity The veracity of Hang Tuah has been the subject of debate of historians for a century. In 2012, historian [Khoo Kay Kim](/wiki/Khoo_Kay_Kim) noted that there was no historical evidence for Hang Tuah's existence. Since 2016, some historians have suggested that Hang Tuah is referred to in the *[Rekidai Hoan](/wiki/Rekidai_Hoan)*, an official record from the [Ryukyu Islands](/wiki/Ryukyu_Islands). The document spans the period from 1424 to 1867 and records the arrival of a certain admiral from Malacca. The document mentions the word \"Lezoumana\" or \"Lo-hsi-ma-na\" ([Laksamana](/wiki/Laksamana)), Hang Tuah's title, according to the [Malay Annals](/wiki/Malay_Annals). [Afonso de Albuquerque's](/wiki/Afonso_de_Albuquerque) commentaries, titled *The Commentaries of the Great Afonso Dalboquerque, Second Viceroy of India*, mention a Lassamane ([Laksamana](/wiki/Laksamana)) who was eighty years old at the time of the [capture of Malacca](/wiki/Capture_of_Malacca_(1511)) in 1511 by the Portuguese, described as “a good soldier, of good repute and great knowledge,” as follows: > *...This Lassamane was a man of eighty years of age, a good soldier, of good repute and great knowledge...some of the Moors of Malaca, hoping to gain favours from Afonso Dalboquerque and obtain the government of the land had written something to this Lassamane, whereby they had prevented his coming, for they feared that as he was a man of uncommon capabilities, Afonso Dalboquerque would seize the opportunity to make use of him for the governing of Malaca...* Nevertheless, since Hang Tuah is not explicitly named in these documents, the identification remains unproven. ## Ethnicity Regardless of the historicity of Hang Tuah, his ethnicity is the source of some dispute. Legend has it that Hang Tuah had Malay ancestry from Bintan. ## Biography Hang Tuah's life and career as a *[laksamana](/wiki/Laksamana)* (admiral) includes tales of his accomplishments and unfaltering loyalty to his sultan, some of which are chronicled in the *[Sejarah Melayu](/wiki/Sejarah_Melayu)* (the semi-historical Malay Annals) and *[Hikayat Hang Tuah](/wiki/Hikayat_Hang_Tuah)* (a romantic collection of tales involving Hang Tuah), both being written in the 17th century in its earliest versions. According to legend, Hang Tuah learns [silat](/wiki/Silat) together with his four comrades, Hang Kasturi, [Hang Jebat](/wiki/Hang_Jebat), Hang Lekir and Hang Lekiu. Their teacher is Adi Putra, a renowned master who lived a hermetic life at the top of a mountain. The comrades encounter and deal with a man [running amok](/wiki/Running_amok). Following this incident, Hang Tuah is presented to Sultan [Muzaffar Shah](/wiki/Muzaffar_Shah_of_Malacca) by his [bendahara](/wiki/Bendahara), [Tun Perak](/wiki/Tun_Perak). Hang Tuah is given the title of *laksamana* when he accompanies his lord Sultan [Mansur Shah](/wiki/Mansur_Shah_of_Malacca) to [Majapahit](/wiki/Majapahit) where the sultan is to marry a Majapahit princess. Hang Tuah is shown to be the most courageous and closest servant to the sultan as he rescues a royal horse from a cresspool. However, later, his *laksamana* title is taken away from him as he is accused of slander and is forced to go into hiding. When Hang Kasturi starts a revolt, Hang Tuah is called back to the Malacca court and he manages to kill Kasturi, this results in him retaking the title of Laksamana and he again becomes the sultan's closest servant. Numerous tales describe his successes in dealing with tasks given by the sultan: in one tale, Hang Tuah protects Malacca from an attack by Semerluki, a [Makasarese](/wiki/Makassar) privateer and prince. Another tale sees Hang Tuah sent to Haru to engage in war, which saw the Malaccan fleet winning. In another, he goes to [Siak](/wiki/Siak_Regency) to ask for its allegiance to Malacca and succeeds. He is also responsible in managing [Puteri Gunung Ledang](/wiki/Puteri_Gunung_Ledang) to marry his lord. Hang Tuah is sent to [Siam](/wiki/Ayutthaya_Kingdom), [China](/wiki/Ming_China), [Brunei](/wiki/Sultanate_of_Brunei_(1368%E2%80%931888)), and [Keling](/wiki/Kalinga_(region)), along with envoys and Malaccan courtiers. He is also sent to [Pasai](/wiki/Pasai) to vassalise it under Malacca, but he is shown to lack courage and only with the help of the bendahara's son, the mission is successful. He continuous to become the sultan's constant aide, accompanying the king on official visits to foreign countries. On one such visit to [Majapahit](/wiki/Majapahit), Hang Tuah fights a duel with the famed [pendekar](/wiki/Pendekar) Taming Sari. After this brutal fight Hang Tuah emerges as winner, and then Singhavikramavardhana, the ruler of Majapahit, bestows upon him Taming Sari's [kris](/wiki/Kris) or dagger. The [Keris Taming Sari](/wiki/Taming_Sari) was named after its original owner, and is purported to be magical, empowering its owner with physical invulnerability.[*citation needed*] Another story concerning Hang Tuah's loyalty to the ruler is found in the *Hikayat Hang Tuah*, and involves his visit to Inderaputra or [Pahang](/wiki/Pahang) during one such voyage. The sultan sends Hang Tuah to Pahang with the task of persuading the princess Tun Teja, who was already engaged, to become the sultan's companion. Tun Teja falls under the impression that Hang Tuah had come to persuade her to marry him, not the sultan, and agrees to elope with him to Malacca. It was only during the voyage home that Hang Tuah reveals his deception to Tun Teja. The *Hikayat Hang Tuah* and *Sejarah Melayu* each carry different accounts of this incident. The Hikayat records that it is Hang Tuah who persuades Tun Teja to elope with him, thus deceiving her.[*citation needed*] ### Hang Jebat Perhaps the most famous story in which Hang Tuah is involved is the fight with his closest childhood companion, [Hang Jebat](/wiki/Hang_Jebat). Hang Tuah's deep loyalty to and popularity with the sultan leads to rumours being circulated that Hang Tuah is having an illicit affair with one of the sultan's *dayang* (court stewardesses). The sultan then sentences Hang Tuah to death without trial for the alleged offence. The death sentence is not carried out, however, because Hang Tuah's executioner, the *bendahara* (chief minister), goes against the sultan's orders and hides Hang Tuah in a remote region of Malacca.[*citation needed*] The story continues with Hang Jebat believing that Hang Tuah is dead, murdered unjustly by the king he served. Hang Jebat then decides to avenge his friend's death. Hang Jebat's revenge becomes either a palace killing spree or furious rebellion against the sultan (sources differ as to what actually occurred). It remains consistent however that Hang Jebat wreaks havoc onto the royal court, and the sultan is unable to stop him, as none of the warriors dares to challenge the more ferocious and skilled Hang Jebat. The bendahara then informs the sultan that the only man who is able to stop Hang Jebat is still alive: Hang Tuah. The bendahara recalls Hang Tuah from his hiding place; the warrior is given full amnesty by the sultan and is instructed to kill Hang Jebat. After seven gruelling days of fighting, Hang Tuah is able to kill Hang Jebat.[*citation needed*] The two main sources for Hang Tuah differ yet again on the details of the final aspect of his life. According to the *Hikayat Hang Tuah*, it is Hang Jebat who avenges his friend's death, only to be killed by the same friend, but according to *Sejarah Melayu*, it is Hang Kasturi. The *Sejarah Melayu* are unique in that they constitute the only available account of the history of the Malay Sultanate in the 15th and early 16th century, but the Hang Jebat story, as the more romantic tale, remains more popular.[*citation needed*] ### Later life Sources show that Malacca kept the peace as Hang Tuah protected the common man and was considerate to the oppressed. The *Hikayat Hang Tuah* describes that not only [Malacca falls](/wiki/Capture_of_Malacca_(1511)) apart but also that Hang Tuah makes a long journey to [Mecca](/wiki/Mecca) and 'Rum' and he continuous to live in peace and becomes a wandering darwish. He eventually falls with fever and headaches, showing that his end was near. According to other sources, Hang Tuah lives to an old age, and his body is buried in [Tanjung Kling](/wiki/Tanjung_Kling) in Malacca, where his tomb can still be seen today; however some say his body is actually buried in Bintan. Other sources state that, following the arrival of the [Portuguese](/wiki/Portuguese_conquest_of_Malacca), Hang Tuah moves to [Singapura](/wiki/Singapura). ## Legacy Hang Tuah remains popular in Malaysia, embodying the values of allegiance and loyalty. The legend of the tragic friendship between Hang Tuah and [Hang Jebat](/wiki/Hang_Jebat) represents the conflict between loyalty and justice.[*citation needed*] Hang Tuah is associated with the saying, \"Takkan Melayu hilang di dunia, selagi berpegang teguh kepada Agama Islam,\" meaning, \"Never shall Malays vanish from the earth, as long as they adhere to the religion of Islam\". The saying is a rallying cry for [Malay nationalism](/wiki/Malay_nationalism). It was popularised by well known local author Abdul Ahmad Samad in his 1950 literary work, *Dosaku*. However, there is no historical record attributing the saying to Hang Tuah, nor is the quote found in the *Hikayat Hang Tuah*. ## Popular culture ### Film Hang Tuah is a prominent figure in Malaysia's popular culture and his story has been adapted into several movies. Famous portrayals include: - [P. Ramlee](/wiki/P._Ramlee) in *Hang Tuah* (1956) - M. Amin in *Hang Jebat* (1961) - Pak Yem in *Puteri Gunung Ledang* (1961) - [Jamal Abdillah](/wiki/Jamal_Abdillah) in *Tuah* (1990) - [Jalaluddin Hassan](/wiki/Jalaluddin_Hassan) in *XX Ray 2* (1995), a science-fiction film made by [Aziz M. Osman](/wiki/Aziz_M._Osman) about modern scientists who were sent back to the 15th century, when Hang Tuah was alive. The film imagines the hero getting his attributed quote *Takkan Melayu Hilang Di Dunia* from one of the scientists from the future - Khairudin Samsudin in Singapore's first kids drama *Robbie And The Book Of Tales* (2000), Season 1 Episode 2 - [M. Nasir](/wiki/M._Nasir) in [*Puteri Gunung Ledang*](/wiki/Puteri_Gunung_Ledang_(film)) (2004). Nasir also portrays Hang Tuah in a [Kit Kat](/wiki/Kit_Kat) commercial where the warrior (unrelated to the character in the Ledang movie) enters a modern [convenience store](/wiki/Convenience_store). - [Saiful Apek](/wiki/Saiful_Apek) in *Magika* (2010) ### Comics In 1951, Indonesian author Nasjah Djamin wrote *Hang Tuah (Untuk Anak-Anak)* (\"Hang Tuah for Children\") published by Balai Antara, making it the first locally published [comic book](/wiki/Comic_book) in the country. ## Places and things named after Hang Tuah ### Malaysia - Five roads in Malaysia are named after Hang Tuah: [Jalan Hang Tuah](/wiki/Jalan_Hang_Tuah) in [Kuala Lumpur](/wiki/Kuala_Lumpur), and similarly named streets in [Johor](/wiki/Johor), [Malacca](/wiki/Malacca), [Muar](/wiki/Muar_District), and [Ipoh](/wiki/Ipoh). - The [Royal Malaysian Navy](/wiki/Royal_Malaysian_Navy) has two [frigates](/wiki/Frigate) named after Hang Tuah, [KD *Hang Tuah* (F433)](/wiki/HMS_Loch_Insh) and [KD *Hang Tuah* (F76)](/wiki/KD_Hang_Tuah). - A strip along [Jalan Hang Tuah](/wiki/Jalan_Hang_Tuah) has been renamed Hang Tuah Mall and popularised as a tourist attraction. - An LRT station and Monorail station in Kuala Lumpur is named [Hang Tuah](/wiki/Hang_Tuah_station). It is an interchange station. - [Medan Hang Tuah](/wiki/Medan_Hang_Tuah), a major food court and hawker centre is located at [Sunway Putra Mall](/wiki/Sunway_Putra_Mall), [Kuala Lumpur](/wiki/Kuala_Lumpur). - [Hang Tuah Stadium](/wiki/Hang_Tuah_Stadium), a stadium in [Malacca City](/wiki/Malacca_City). - [Hang Tuah's Well](/wiki/Hang_Tuah%27s_Well), a water well in Hang Tuah Village in Kampung Duyong, Duyong, Malacca. - [Hang Tuah Jaya](/wiki/Hang_Tuah_Jaya), a municipality and parliamentary constituency in Malacca. - Admiral Hang Tuah Jamek Mosque, a mosque in Malacca. - Hang Tuah Centre, an attraction in Malacca. - [Hang Tuah Village](/wiki/Hang_Tuah_Village), a village in Kampung Duyong, Duyong, Malacca. - Hang Tuah Bridge, a bridge in Malacca City across [Malacca River](/wiki/Malacca_River). - Hang Tuah Hall, a building in [Malacca City](/wiki/Malacca_City) beside the Hang Tuah Bridge. ### Indonesia - Certain roads in several major cities are named after the warrior as Jalan Hang Tuah: in [Pekanbaru](/wiki/Pekanbaru), [Jakarta](/wiki/Jakarta), [Batam](/wiki/Batam), [Tanjung Pinang](/wiki/Tanjung_Pinang), [Medan](/wiki/Medan), [Surabaya](/wiki/Surabaya), [Palembang](/wiki/Palembang), [Padang](/wiki/Padang), [Palu](/wiki/Palu), [Denpasar](/wiki/Denpasar), and [Bandung](/wiki/Bandung) - Hang Tuah University, a major university established by the [Indonesian Navy](/wiki/Indonesian_Navy) in [Surabaya](/wiki/Surabaya) - The [Indonesian Navy](/wiki/Indonesian_Navy) has two ships named after Hang Tuah, [*Bathurst*-class](/wiki/Bathurst-class_corvette) [corvette](/wiki/Corvette) [RI *Hang Tuah*](/wiki/HMAS_Ipswich_(J186)) and [Riga-class](/wiki/Riga-class_frigate) [frigate](/wiki/Frigate) KRI *Hang Tuah* (358). - Hang Tuah Park, a Park in [Riau Main Stadium](/wiki/Riau_Main_Stadium) in [Pekanbaru](/wiki/Pekanbaru) - Hang Tuah Stadium, a green space in [Masjid Agung An-Nur](/wiki/An-Nur_Great_Mosque_Pekanbaru) in [Pekanbaru](/wiki/Pekanbaru) - [Hang Jebat](/wiki/Hang_Jebat), close companion of Hang Tuah - [Hikayat Hang Tuah](/wiki/Hikayat_Hang_Tuah), an early 18th-century Malay epic - [Tanjong Kling](/wiki/Tanjung_Kling), the mausoleum of Hang Tuah is located within the Mukim - [Legend of Puteri Gunung Ledang](/wiki/Legend_of_Puteri_Gunung_Ledang), a legendary princess whom Hang Tuah interacted with - [Malay folklore](/wiki/Malay_folklore) ## Note - [Richard O. Winstedt](/wiki/Richard_O._Winstedt), *A History of Malaya*.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:08:33.687065",
  "title": "Hang Tuah",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Hang_Tuah"
}