{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:08:35.620709"
  },
  "content": "English artistic gymnast **Hannah Kate Whelan** (born 1 July 1992) is a retired [British](/wiki/United_Kingdom) [artistic gymnast](/wiki/Artistic_gymnastics) who competed at the [2008 Summer Olympics](/wiki/2008_Summer_Olympics) and the [2012 Summer Olympics](/wiki/2012_Summer_Olympics). Whelan won three European Championships medals and four British senior national titles, and was the bronze medallist in the all-around at the [2014 Commonwealth Games](/wiki/2014_Commonwealth_Games). ## Early life and training Whelan, the daughter of Mike and Karen Whelan, was born on 1 July 1992 in [Singapore](/wiki/Singapore), where she lived until she was two years old. Her family then moved to [Stockport, England](/wiki/Stockport). It was there that Whelan began gymnastics. She said: \"At the age of six, after constantly cartwheeling around the house and Tesco, I persuaded my mum to take me to a gymnastic class. There, I was immediately spotted as a talent and began training at South Manchester Gymnastics Club with coach Helen Hall.\" A year later, when Whelan was seven, her family moved to the [United States](/wiki/United_States), where she trained at Flips Gymnastics Academy in [Texas](/wiki/Texas). In 2001, at the age of nine, she moved back to Stockport with her family and resumed training with Hall, this time at Vernon Park Gymnastics Club. In 2005, Whelan switched gyms and began training under Sarah Attwell at the City of Liverpool Gymnastics Club, alongside [Beth Tweddle](/wiki/Beth_Tweddle). \"Beth always helped me in the gym,\" she said. \"Just the little comments help to pick you up if things are going wrong. She has the experience and she has had bad days in the gym, but it's good to know that she's gotten where she has by living through the same things that you are.\" After 2008, Whelan began training under [Amanda Reddin](/wiki/Amanda_Reddin). Whelan attended [Bramhall High School](/wiki/Bramhall_High_School) but missed much of her final year due to training. Despite this, she passed eight [GCSE](/wiki/General_Certificate_of_Secondary_Education) exams, receiving seven B's and one C. She studied sports development at [Liverpool John Moores University](/wiki/Liverpool_John_Moores_University). ## Senior career ### 2008 Whelan made her senior international debut at a [World Cup](/wiki/Artistic_Gymnastics_World_Cup) event in [Doha, Qatar](/wiki/Doha), in March 2008. She placed eighth on [balance beam](/wiki/Balance_beam), scoring 13.000, and eighth on [floor exercise](/wiki/Floor_(gymnastics)), scoring 13.050. In June, she placed third in the all-around competition at the British Championships in [Guildford](/wiki/Guildford) with a total score of 56.100. In August, Whelan competed at the [2008 Summer Olympics](/wiki/2008_Summer_Olympics) in [Beijing](/wiki/Beijing). She contributed scores of 14.325 on balance beam and 14.125 on floor toward the British team's ninth-place finish. ### 2009 At the [2009 European Championships](/wiki/2009_European_Artistic_Gymnastics_Championships) in [Milan](/wiki/Milan) in March, Whelan placed seventeenth in the all-around final with a score of 54.325. In May, she scored 56.400 at the British Teams competition in Guildford, helping her club, City of Liverpool, win first place. In July, Whelan competed at the British Championships in Guildford. She placed fifth in the all-around with a score of 52.150, second on balance beam (14.300), and fourth on floor (13.350). Two months later, she had surgery on her wrist. ### 2010 In June, Whelan competed at the World Cup in [Porto, Portugal](/wiki/Porto). She placed third on floor with a score of 13.400. The following month, she became the national champion with a score of 57.800 at the British Championships in Guildford. \"I didn't have any aims or expectations coming into the competition, so to then go out and win is just incredible,\" she said afterward. \"I've had injury problems, so to then return and become British champion is fantastic.\" In event finals, she placed third on [uneven bars](/wiki/Uneven_bars) (13.800), second on balance beam (14.100), and third on floor (13.750). In October, she competed at the [2010 World Championships](/wiki/2010_World_Artistic_Gymnastics_Championships) in [Rotterdam](/wiki/Rotterdam), where she contributed scores of 13.900 on uneven bars, 14.133 on balance beam, and 14.066 on floor toward the British team's seventh-place finish. She placed sixteenth in the all-around final with a score of 55.499. ### 2011 Whelan placed eighth at the [American Cup](/wiki/American_Cup_(gymnastics)) in [Jacksonville, Florida](/wiki/Jacksonville,_Florida), in March, with a score of 52.532. In April, she competed at the [2011 European Championships](/wiki/2011_European_Artistic_Gymnastics_Championships) in [Berlin](/wiki/Berlin). She placed thirteenth in the all-around final, scoring 54.175, and eighth in the balance beam final, scoring 11.950 after falling twice. Later that month, she placed fifth in the all-around at the World Cup in [Glasgow](/wiki/Glasgow) with a score of 52.132. And at the British Teams competition in Guildford in May, Whelan helped her club, City of Liverpool, win first place with an all-around score of 56.850. In July, Whelan won her second consecutive national title at the British Championships in [Liverpool](/wiki/Liverpool), posting an all-around total of 56.350. In event finals, she placed second on uneven bars (13.900), second on balance beam (14.500), and fourth on floor (14.150). In the team final at the [2011 World Championships](/wiki/2011_World_Artistic_Gymnastics_Championships) in [Tokyo](/wiki/Tokyo), Whelan scored 55.665 and Britain finished fifth, qualifying a full team to the [2012 Summer Olympics](/wiki/2012_Summer_Olympics). In the all-around final, Whelan placed ninth with a score of 56.124. ### 2012 In March, Whelan competed at a World Cup event in Doha, placing sixth on balance beam with a score of 13.425. At the [2012 European Championships](/wiki/2012_European_Women%27s_Artistic_Gymnastics_Championships) in [Brussels](/wiki/Brussels) in May, she contributed an all-around score of 55.498 toward the British team's fourth-place finish. In event finals, she placed third on balance beam, scoring 14.333, and third on floor, scoring 14.533. In June, Whelan competed at the British Championships in Liverpool. She placed third in the all-around with a score of 55.800. In event finals, she placed fourth on uneven bars (14.250), second on balance beam (13.850), and third on floor (13.900). The following month, she was selected to compete for the United Kingdom at the Olympics in [London](/wiki/London), alongside [Imogen Cairns](/wiki/Imogen_Cairns), [Jennifer Pinches](/wiki/Jennifer_Pinches), [Rebecca Tunney](/wiki/Rebecca_Tunney), and [Beth Tweddle](/wiki/Beth_Tweddle). At the Olympics, Whelan qualified to the all-around final in seventeenth place with a score of 55.699. In the [team final](/wiki/Gymnastics_at_the_2012_Summer_Olympics_%E2%80%93_Women%27s_artistic_team_all-around), she contributed scores of 14.000 on uneven bars, 13.866 on balance beam, and 14.200 on floor toward the British team's sixth-place finish. In the [all-around final](/wiki/Gymnastics_at_the_2012_Summer_Olympics_%E2%80%93_Women%27s_artistic_individual_all-around), she landed her [vault](/wiki/Vault_(gymnastics)) on her knees, meaning she received a score of zero and finished in last place. ### 2014 In July, Whelan competed at the [2014 Commonwealth Games](/wiki/2014_Commonwealth_Games) in Glasgow. She contributed an all-around score of 53.366 toward England's team gold and qualified fifth into the all-around final, where she won bronze, scoring 54.699. Her teammates [Claudia Fragapane](/wiki/Claudia_Fragapane) and [Ruby Harrold](/wiki/Ruby_Harrold) won gold and silver, respectively, for an all-English podium. - Hannah Whelan at the [International Gymnastics Federation](/wiki/International_Gymnastics_Federation) - Hannah Whelan at [British Gymnastics](/wiki/British_Gymnastics) - Hannah Whelan at [Team GB](/wiki/Team_GB) - Hannah Whelan at [Olympics.com](/wiki/International_Olympic_Committee) - Hannah Whelan at [Olympedia](/wiki/Olympedia) - Hannah Whelan at the [Commonwealth Games Federation](/wiki/Commonwealth_Games_Federation) (archived) - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:08:35.620334",
  "title": "Hannah Whelan",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Hannah_Whelan"
}