{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:08:37.565078"
  },
  "content": "Dutch naval officer **Etienne Henri \"Hans\" Larive**, [MWO](/wiki/Military_William_Order), [DSC](/wiki/Distinguished_Service_Cross_(United_Kingdom)) [and bar](/wiki/Medal_bar), (23 September 1915 – 28 December 1984) was a Dutch naval officer during [World War II](/wiki/World_War_II). He escaped from the [prisoner of war](/wiki/Prisoner_of_war) camp [Oflag IV-C](/wiki/Oflag_IV-C) at [Colditz Castle](/wiki/Colditz_Castle) in 1941, and spent the rest of the war in England serving aboard [Motor Torpedo Boats](/wiki/Motor_Torpedo_Boat). He later wrote his memoir *Vannacht varen de Hollanders* (1950), which was republished translated into English as *The Man Who Came in From Colditz* (1975) – a pun on the best-selling novel *[The Spy Who Came in from the Cold](/wiki/The_Spy_Who_Came_in_from_the_Cold)*. ## Early life Larive was born on 23 September 1915 in Singapore. He entered the [Royal Netherlands Naval College](/wiki/Royal_Netherlands_Naval_College) (KIM) in 1934, graduating in 1937, and gaining his commission as *[Luitenant ter Zee (3de klasse)](/wiki/Ensign_(rank))* on 13 August that year. He was promoted to *[Luitenant ter Zee (2de klasse)](/wiki/Sub-lieutenant)* on 13 August 1939. ## World War II In May 1940, just a few days before the [Germans attacked Holland](/wiki/Battle_of_the_Netherlands), he returned from his tour of duty in the [Dutch East Indies](/wiki/Dutch_East_Indies) as [Navigation Officer](/wiki/Navigator) aboard the [Admiralen class destroyer](/wiki/Admiralen_class_destroyer) HNLMS *Van Galen*. On 10 May 1940 the Germans invaded, and the *Van Galen* was sent to shell German paratroopers who had [landed around Rotterdam](/wiki/Battle_of_Rotterdam) and [Waalhaven](/wiki/Waalhaven) airport. The ship had to steam into the narrow [Nieuwe Waterweg](/wiki/Nieuwe_Waterweg), where she was attacked and soon sunk by [Stuka](/wiki/Junkers_Ju_87) dive-bombers. ### The 'Singen' route After the Dutch capitulation, all officers were required to give their word of honour [nl] not to take part in any hostile activities against the Germans. About 60 officers including Larive, and one rating, refused, and were sent to German POW camps. The first was Oflag VI-A in [Soest, Germany](/wiki/Soest,_Germany), where Larive made his first escape attempt in October 1940. This attempt brought him near to [Singen](/wiki/Singen), close to the Swiss border, where he was arrested. Convinced that Germany would soon win the war, the interrogating [Gestapo](/wiki/Gestapo) officer arrogantly showed Larive how he would have crossed the Swiss border without problems. Larive later passed this valuable information on, and many Dutch and British prisoners used the \"Singen route\" to enter Switzerland. After this escape attempt all Dutch POW's were moved to Oflag VIII-C near [Juliusburg](/wiki/Dobroszyce), but after another successful escape by two officers they were all moved again in July 1941 to the maximum security camp (*Sonderlager*) [Oflag IV-C](/wiki/Oflag_IV-C) at Colditz. ### Escaping Colditz At Colditz all Dutch escapes were coordinated by the Dutch escape officer Captain [Machiel van den Heuvel](/wiki/Machiel_van_den_Heuvel), known as \"Vandy\" by the British. Van den Heuvel quickly recognised the possibilities of the exercise park and soon had his first escape plan ready. On 15 August 1941 Larive and Lieutenant [Francis Steinmetz](/wiki/Francis_Steinmetz) hid under a [manhole cover](/wiki/Manhole_cover) under the cover of a [rugby scrum](/wiki/Scrum_(rugby)). Lieutenant Gerrit Dames then created a diversion by cutting a hole in the barbed wire fence, before allowing himself to be caught, shouting to imaginary escapers to run, so that the Germans would think that the missing officers had already escaped. Larive and Steinmetz hid for several hours. The cover was fixed with a heavy bolt, which Van den Heuvel had replaced with a fake made of glass. Once it was dark the two men forced the manhole cover open from below, and replaced the now broken glass bolt with the original one. They then made their way out of the castle. (This escape method was repeated on 20 September 1941 by two other Dutch officers, Conrad Giebel and Oscar Ludwig Drijber.). At [Leisnig](/wiki/Leisnig) Larive and Steinmetz took a train to [Nuremberg](/wiki/Nuremberg) where they waited for their next train in a nearby park. To avoid attracting unwanted attention, they pretended to be a courting couple, with Steinmetz pulling a blanket down over his shorts so it looked like a skirt. They crossed the Swiss border on 18 August 1941. Under Swiss [neutrality law](/wiki/Neutrality_(international_relations)) they were not allowed to leave the country, so the Dutch Legation provided false papers describing them as sugar planters on their way to Cuba. They travelled on a sealed train in which neutrals were able to pass through France into Spain. At [Barcelona](/wiki/Barcelona) they boarded the neutral ship, *Isla de Tenerife*, sailing for Havana. The ship was intercepted by a Royal Navy cutter in the [Strait of Gibraltar](/wiki/Strait_of_Gibraltar) and the two men were taken off and arrived in [Gibraltar](/wiki/Gibraltar) on 4 November. They then sailed to England aboard the submarine [HNLMS *O 21*](/wiki/O_21_class_submarine) and arrived in London on 17 December 1941. ### MTB commander In March 1942 Larive was assigned to command of the Dutch [Motor Torpedo Boat](/wiki/Motor_Torpedo_Boat) *MTB 203*, part of the Anglo-Dutch 9th MTB Flotilla. Later the 9th Flotilla became wholly Dutch, and Larive commanded it from October 1942 until October 1943. He then became the Senior Officer of all Dutch MTBs (commanding the 2nd and 9th MTB Flotillas) until 16 September 1944, with the rank of Temporary Acting *[Luitenant ter Zee 1ste klasse](/wiki/Lieutenant-Commander)*. The Dutch MTB service was disbanded on 5 September 1944, and its personnel were reassigned to \"Port Parties\", operating in liberated areas of the Netherlands. Larive then became head of the Dutch Naval Press Agency MARVO (*Marine Voorlichting Dienst*), a post he held until leaving the navy on 1 July 1946. ## Post-war Larive was employed by the [Royal Dutch Shell](/wiki/Royal_Dutch_Shell) company from 1 September 1946. Between December 1951 and May 1954 he was a Deputy Director of *N.V. Curaçaose Scheepvaart Maatschappij* (Curaçao Shipping Company), a Shell subsidiary. In 1950, he published his wartime memoirs entitled *Vannacht varen de Hollanders* (\"The Dutch Sail Tonight\"), later published in English as *The Man Who Came in From Colditz*. He died at [The Hague](/wiki/The_Hague) on 28 December 1984. ## Awards - [Knight 4th Class of the Military Order of William](/wiki/Military_William_Order) (*[Ridder](/wiki/Ridder_(title)) der 4e klasse der Militaire Willems-Orde*), awarded on 23 July 1947. The citation read: For outstanding acts of courage, leadership and devotion distinguished by;Firstly, on the night of 14/15 June 1942 off the French coast, as commander of MTB 203, accompanied by two British motor torpedo boats of the flotilla under a British commander, competently, audaciously and successfully attacked an enemy convoy near [Calais](/wiki/Calais), and returned to base with only minor damage to his boat.Secondly, on the night of 5 July 1943 as commander of a Flotilla of motor torpedo boats, consisting of MTBs 235 and 240, and a British MTB, in the [Strait of Dover](/wiki/Strait_of_Dover), in co-operation with the heavy 35-inch batteries at Dover, attacked two heavily armed enemy destroyers, which were in transit through the channel.Thirdly, on the night of 26/27 September 1943, as Senior Officer of the flotilla, consisting of MTB 202, 204 and 231, he attacked and sank an escorted enemy merchantman, while under fire from the heavily defended French coast. - [Knight of the Order of Orange-Nassau](/wiki/Order_of_Orange-Nassau) (*Ridder der [Orde van Oranje-Nassau](/wiki/Order_of_Orange-Nassau)*) - [Bronze Cross](/wiki/Bronze_Cross_(Netherlands)) (*Bronzen Kruis*), awarded 2 September 1942 and 13 July 1944, for successfully escaping from Germany and his actions in May 1940. - [War Commemorative Cross](/wiki/War_Commemorative_Cross) (*Oorlogsherinneringskruis*) with 3 bars. - [Distinguished Service Cross](/wiki/Distinguished_Service_Cross_(United_Kingdom)) and bar (UK), for his attacks on enemy convoys in June 1942 and September 1943. - Mentioned in Dispatches (UK) NotesBiography - de Hartog, Leo (1983). *Officieren achter prikkeldraad 1940–1945* [*Officers behind barbed wire 1940–1945*] (in Dutch). Uitgeverij Hollandia. [ISBN](/wiki/ISBN_(identifier)) 90-6045-207-0.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:08:37.564354",
  "title": "Hans Larive",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Hans_Larive"
}