{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:08:41.545587"
  },
  "content": "Singaporean waterfront district **HarbourFront** is a waterfront district situated in southern [Singapore](/wiki/Singapore). Whilst HarbourFront's boundaries are ambiguous, its location is roughly represented on the [URA](/wiki/Urban_Redevelopment_Authority)'s Master Plan as a subzone called [Maritime Square](/wiki/Maritime_Square_(subzone)), located within the [Bukit Merah Planning Area](/wiki/Bukit_Merah_Planning_Area). Main thoroughfares in HarbourFront include Keppel Way and Telok Blangah Road. Notable buildings in the vicinity include [HarbourFront Centre](/wiki/HarbourFront_Centre), [Singapore Cruise Centre](/wiki/Singapore_Cruise_Centre), [St James Power Station](/wiki/St_James_Power_Station), [VivoCity](/wiki/VivoCity) and the Jardine Steps Tower which hosts the HarbourFront stop of the [Singapore Cable Car](/wiki/Singapore_Cable_Car). Maritime Square is currently being redeveloped into a new business and lifestyle hub. ## Etymology The area was originally known as Seah Im but was also referred to as Jardine Steps. After the [Port of Singapore](/wiki/Port_of_Singapore) expanded, it was developed into Maritime Square and later renamed as HarbourFront. The present-day appellation, HarbourFront, was coined in the 2000s to give the area a more upmarket feel. ## History HarbourFront was once close to the southernmost point of the main island of Singapore, until [land reclamation](/wiki/Land_reclamation) in [Tanjong Pagar](/wiki/Tanjong_Pagar) and [Tuas](/wiki/Tuas). Its location in the sheltered waters of [Keppel Harbour](/wiki/Keppel_Harbour) helped the area to thrive as a commercial area adjacent to [Keppel Shipyards](/wiki/Keppel_Corporation), particularly with the building of the former World Trade Centre in 1978. Singapore's first major Exhibitions and Conventions venue, the World Trade Centre Exhibition Complex, was subsequently built beside the World Trade Centre, and also served as a transport node with ferries to Sentosa and other regional destinations such as [Batam](/wiki/Batam). The [Singapore Cruise Centre](/wiki/Singapore_Cruise_Centre) opened in 1991 in HarbourFront as the country's first international cruise terminal. Massive redevelopment in the area after the closure of the shipyard subsequently led to the name HarbourFront being coined in the early 2000s to refer to the immediate vicinity of the World Trade Centre, which was in the midst of a major refurbishment project. Relaunched as [HarbourFront Centre](/wiki/HarbourFront_Centre,_Singapore), the former World Trade Centre also has its neighbouring Exhibition Complex demolished to make way for [VivoCity](/wiki/VivoCity), the upgrading of the Cable Car Towers (old Jardine Steps Station on top the old PSA Tower) and the construction of two new office blocks adjacent to it. Transportation into the area was vastly improved with the opening of the [HarbourFront MRT station](/wiki/HarbourFront_MRT_station) and extension of the [HarbourFront Bus Interchange](/wiki/HarbourFront_Bus_Interchange). Also, the new [monorail](/wiki/Monorail) link to Sentosa, the [Sentosa Express](/wiki/Sentosa_Express) has been completed and opened on 15 January 2007. The HarbourFront station of the [Circle line](/wiki/Circle_Line_(Singapore)) had opened on 8 October 2011. A new six-storey office building is also in the works as a new addition to the HarbourFront Office Park. The new site is referred to as the HarbourFront Merrill Lynch, which is a six-storey building and will be entirely occupied by American bank [Merrill Lynch](/wiki/Merrill_Lynch) with a total area of 200,000 sq ft (19,000 m2). Another office development is being planned on the site of the current SPI Building. Furthermore, a [residential](/wiki/Residential) development is possible in the future. The Singapore Cruise Centre would be expanded to accommodate over 6 million passengers by 2010. - The HarbourFront Precinct Masterplan - The HarbourFront Precinct Masterplan\n",
  "language": "en",
  "processed_at": "2026-01-12T11:08:41.545130",
  "title": "HarbourFront (Singapore)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/HarbourFront_(Singapore)"
}