{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:09:03.696557"
  },
  "content": "Singapore is one of the wealthiest countries in the world, with a gross domestic product (GDP) per capita of more than $57,000. Life expectancy at birth is 82.3 and infant mortality is 2.7 per 1000 live births. The population is ageing and by 2030, 20% will be over 65. However it is estimated that about 85% of those over 65 are healthy and reasonably active. Singapore has a [universal](/wiki/Universal_health_care) [health care system](/wiki/Healthcare_in_Singapore). There are a variety of health screening and healthy lifestyle programmes for both adults and children. Only 14% of the population smokes. The [Temasek Cares](/wiki/Temasek_Cares) programme supports a wide range of interventions for disadvantaged people. Singapore in recent years has the lowest infant mortality rate in the world and among the highest life expectancies from birth, according to the [World Health Organization](/wiki/World_Health_Organization). A new measure of expected [human capital](/wiki/Human_capital) calculated for 195 countries from 1990 to 2016 and defined for each birth cohort as the expected years lived from age 20 to 64 years and adjusted for educational attainment, learning or education quality, and functional health status was published by the [Lancet](/wiki/The_Lancet) in September 2018. Singapore had the thirteenth-highest level of expected human capital with 24 health, education, and learning-adjusted expected years lived between age 20 and 64 years. ## Health Indicators Some common indicators used to indicate health include [total fertility rate](/wiki/Total_fertility_rate), [infant mortality](/wiki/Infant_mortality) rate, [life expectancy](/wiki/Life_expectancy), [crude birth](/wiki/Birth_rate) and [death rate](/wiki/Mortality_rate). As of 2017, Singapore has a Total Fertility Rate of 1.16 children born per woman, an Infant Mortality rate of 2.2 deaths per 1000 live births, Crude Birth Rate of 8.9 births per 1000 people and a Death Rate of 3 deaths per 1000 inhabitants. The average lifetime expectancy at birth slightly increased from 83 to 83.1 between the period 2016 and 2017. In comparison, the average lifetime expectancy for China grew from 76.3 in 2016 to 76.4 in 2017. Other parameters are outlined below: Parameters Organized by Year 1960197019801990201220132014201520162017[Life expectancy](/wiki/Life_expectancy) at Birth61.366.072.275.382.082.382.5582.883.083.1[Total fertility rate](/wiki/Total_fertility_rate) (per female)5.763.071.821.831.291.191.251.241.21.16[Infant mortality](/wiki/Infant_mortality) Rate (per 1,000 live births)35.622.012.06.22.22.12.12.12.22.2Under 5 Mortality Rate/[Child mortality](/wiki/Child_mortality) (per 1,000 live births)47.827.414.87.72.82.72.72.72.82.8 In general, all indices showed improvement except for the [Total fertility rate](/wiki/Total_fertility_rate), which dropped to 1.16 in 2017, making it the lowest figure since 1.15 in 2010 and the second lowest ever recorded in the city-state. This general slow-down can be explained by the ‘demographic-gift’, term defined by the [United Nations Population Fund](/wiki/United_Nations_Population_Fund) (UNFPA) according to which increases in income, education and health and the changing role of women in the workforce were strongly connected to levels of low fertility rate. ### Age Structure The median age of the resident population rose from 40.0 years to 40.5 years between June 2016 and June 2017. Residents aged 65 years and over made up 13% of the resident population in Singapore in 2017, compared to 12.4% in 2016. ### Dependency Ratio The [Age dependency ratio](/wiki/Dependency_ratio) in Singapore was reported at 37.98% in 2016, according to the World Bank collection of development indicators, and is expected to reach 36.3% by 2030 and 60.6% by 2050. The retired population will therefore make up a growing share of the population in the upcoming years. Factors contributing to this growth include rising [life expectancy](/wiki/Life_expectancy) and falling [birth rates](/wiki/Birth_rate). ## Medical issues in Singapore ### Malnourishment Malnourishment is \"a condition caused by inadequate, excessive or imbalance intake of nutrients\". Common indicators used to measure malnourishment are body mass index and vitamin deficiencies. #### Children From 1977 to 2000, children malnutrition for those aged five and younger had moments of improvement and backtrack. The prevalence of children being underweight, having stunted growth or being weak has improved. More specifically, in 2000 it was 8.9% less common for a child to be underweight compared to rates in the 1970s. Conversely, between the years of 1970 and 1977, the prevalence of a children being overweight increased. Similarly, in 2016 22.4% of school-aged children and adolescents aged 5 to 19 years were overweight. #### Women From 1980 to 2016, the World Health Organization (WHO) measured females malnutrition based on body mass index (BMI). BMI is used to identify if an individual is normal weight, overweight or underweight. From 1980 to 2016, the percentage of females who were underweight stayed at 8%, indicative of the static relationship and trend. From 1980 to 2010, the percentage of females who were overweight increased from 25% to 33.6%. WHO indicates that being overweight is a \"major determinant of many non-insulin-dependent diabetes mellitus, coronary heart diseases and stroke,\" along with many other health consequences. The percentage of females who are overweight has, however, decreased from 33.6% to 27.4% from 2010 to 2016. Conversely, the percentage of females who are obese has increased steadily from 2.5% to 6.1% from 1990 to 2016. Obesity, as indicated by the WHO, can be mitigated through lifestyle changes. ### Common health issues #### Dengue Fever Climatic characteristics such as high temperatures and high humidity facilitate the transmission of [dengue virus](/wiki/Dengue_virus) by *[Aedes aegypti](/wiki/Aedes_aegypti)* mosquitoes. Owing to its tropical climate, Singapore is a highly-endemic area for dengue, and experiences 20–330 cases per 100,000 people each year, depending on the severity of outbreaks, with higher rates of transmission in the September to February rainy season. The economic burden of this disease is significant, costing Singapore between 850 million and 1.15 billion USD between 2000 and 2010. Dengue fever is a mosquito-borne disease, transmitted primarily by the species *Aedes aegypti.* Transmission of the dengue virus occurs through the bite of the infected insect. Dengue fever varies in clinical presentation. Many cases of dengue virus infection are asymptomatic, but headaches, high fevers, pain behind the eyes, muscle, joint and bone pain, and a skin rash with red spots within 4 to 7 days of being infected may occur. In these cases, the World Health Organization (WHO) differentiates between undifferentiated febrile illness caused by dengue, dengue fever (DF), or dengue haemorrhagic fever (DHF) including dengue shock syndrome (DSS). DHF, characterised by increased vascular permeability and blood plasma leakage, may result in death, especially in the case of DSS, where [shock](/wiki/Shock_(circulatory)) results from decreased intravascular pressure caused by this leakage of plasma. While intensive mosquito vector control historically limited dengue incidence in Singapore, since the 1980s, the nation has experienced dengue outbreaks occurring cyclically, with increasing severity, every 5–6 years. The most recent sustained major outbreak of dengue occurred in 2013 and 2014, reaching peaks of 842 cases in June 2013 and 891 cases in July 2014, the greatest weekly dengue incidence recorded in Singaporean history. Singapore's [National Environment Agency](/wiki/National_Environment_Agency) (NEA) has incorporated the use of sophisticated machine learning techniques in dengue forecasting. The Environmental Health Institute (EHI) of the NEA uses a model incorporating [Least Absolute Shrinkage and Selection Operator](/wiki/Least_Absolute_Shrinkage_and_Selection_Operator) (LASSO) methods in predictive outbreak forecasting, integrating population, meteorological, and vector surveillance data-based variables with epidemiological case report data collected through the Singaporean Ministry of Health and updated weekly to produce nationwide forecasts up to 3 months in advance. The team's model successfully predicted outbreak patterns during the major dengue outbreak of 2013, forecasting a peak count of 863 dengue cases in the 26th week of 2013 (compared to the actual peak of 842 dengue cases, during the 25th week of 2013.) This prediction enabled better planning of resource and medical care allocation, including an early launch of a government-led public health education campaign two months earlier than scheduled to more effectively preempt the outbreak. #### Myopia Singapore is believed to have the highest prevalence of myopia in children worldwide. More specifically, about \"65% of children aged 12 in Singapore are myopic\". Myopia is a vision problem, affecting an individual's ability to see distant objects. The major causes are still unclear. However, near work activities such as staring at a screen or reading a book are said to worsen the condition. ### Environmental impacts on health issues #### Haze Annually from May to October, Singapore experiences a smoke haze which can cause or worsen pre-existing health issues. The haze is largely caused by, \"winds bringing in tiny particles of ash,\" from the burning of forestry in Indonesia, the neighbouring country. A person's likelihood of developing viral and bacterial infections is increased by breathing in an excess of these particles. Additionally, individuals may experience irritation of the eyes, nose and throat if exposed to an excess amount of the haze. However, in most cases these aforementioned health issues will resolve on their own. The haze can also perpetuates existing heart and lung conditions, such as asthma. #### Air pollution Compared to most cities in Asia, Singapore's levels of [air pollution](/wiki/Air_pollution) are rather lower. Singapore has experienced rapid urbanisation and industrialisation over the years. Thus, \"the main sources of air pollution in Singapore are emissions from the industries and motor vehicles\". The National Environment Agency has indicated that the most concerning air pollutants are particulate matter, carbon monoxide, ozone nitrogen dioxide and sulphur dioxide. Continuous exposure to these air pollutants can \"cause respiratory symptoms and aggravate existing heart or lung disease\". - [Healthcare in Singapore](/wiki/Healthcare_in_Singapore) - [Smoking in Singapore](/wiki/Smoking_in_Singapore) - [Health Promotion Board](/wiki/Health_Promotion_Board) - [Mental health in Singapore](/wiki/Mental_health_in_Singapore) - - Dengue and severe dengue - Archived 27 March 2019 at the [Wayback Machine](/wiki/Wayback_Machine) - Air Quality\n",
  "language": "en",
  "processed_at": "2026-01-12T11:09:03.696041",
  "title": "Health in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Health_in_Singapore"
}