{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:09:07.630529"
  },
  "content": "Shopping mall in Hougang Street , Singapore **Heartland Mall** ([Chinese](/wiki/Simplified_Chinese): 心邻坊) is a shopping mall in [Singapore](/wiki/Singapore). A relatively small [shopping mall](/wiki/Shopping_mall) in comparison with other malls, it serves the neighbourhood of [Kovan](/wiki/Kovan,_Hougang). It consists of four floors without a basement, and the fourth level occupied only by tuition centres. The mall is situated in an area known as Kovan City ([Chinese](/wiki/Simplified_Chinese): 高文城) which used to be Hougang Town Centre, but the town centre was shifted to Hougang Central when neighbourhoods sprung up further north. ## History The mall was initially the largest Oriental Emporium outlet in Singapore. In 2001, the assets of The Emporium Group was taken over by Heartland Retail Group and the outlet was renamed the **Heartland Mall**. In 2012, Guthrie GTS fully took over Heartland Retail Group which it already owned 50% of the group, leading to Heartland Mall being transferred to Guthrie GTS. In 2015, Alpha Investment Partners, part of [Keppel Capital](/wiki/Keppel_Capital_Holdings) and sponsored by Keppel Group, bought the lower three levels of Heartland Mall from Guthrie GTS. In 2016, Alpha sold them to Master Contract Services, a Singapore-based group in the property and construction businesses. ## Shops Notable shops in Heartland Mall include [Popular](/wiki/Popular_Holdings), [Old Chang Kee](/wiki/Old_Chang_Kee), Japan Home, PrimaDeli, Toast Box, Saizeriya, Ya Kun Kaya Toast, Burger King, Mos Burger, Suki-ya, [Watsons](/wiki/Watsons) and [Sakae Sushi](/wiki/Sakae_Sushi). The majority of the first floor is occupied by [Cold Storage](/wiki/Cold_Storage_(supermarket)), a local [supermarket](/wiki/Supermarket) chain. This Singapore-related article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:09:07.630033",
  "title": "Heartland Mall",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Heartland_Mall"
}