{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:09:11.672806"
  },
  "content": "Brewing company in Singapore **Heineken Asia Pacific**, formerly **Asia Pacific Breweries** (**APB**) is a [Singaporean](/wiki/Singapore) brewery company. Founded in 1931 as a joint venture between [Heineken International](/wiki/Heineken_International) and [Fraser and Neave](/wiki/Fraser_and_Neave), it was renamed Asia Pacific Breweries (APB) in 1989 and given its present name after merging with Heineken Asia Pacific in 2013. Headquartered in [Singapore](/wiki/Singapore), it currently controls 45 breweries in 19 countries in the Asia Pacific region, selling over 50 beer brands and variants. It is wholly owned by parent company Heineken International. ## History In 1931, Singapore's Fraser & Neave (F&N) formed a joint venture with Holland's [Heineken](/wiki/Heineken_International) to venture into the brewing business in Singapore. The brewery, initially called \"Malayan Breweries Limited\", produced [Tiger Beer](/wiki/Tiger_Beer), and later acquired [Archipelago Brewery](/wiki/Archipelago_Brewery), which produced Anchor Beer. In 1990, Malayan Breweries changed its name to Asia Pacific Breweries. In 2004, APB acquired 90% of [DB Breweries](/wiki/DB_Breweries). In 2010, APB acquired *PT Multi Bintang Indonesia* from Heineken International BV. In August 2012, Fraser & Neave accepted an offer from Heineken to acquire its stake in APB for US$4.1 billion. Shareholders approved the deal during the extraordinary general meeting held on September 28, 2012. In 2013, APB merged with the original incarnation of Heineken Asia Pacific and was renamed Heineken Asia Pacific to reflect its role as Heineken's regional hub.[*citation needed*] ## Key brands The company's main brands include [Tiger Beer](/wiki/Tiger_Beer), Anchor, Baron's Strong Brew, [Bintang Beer](/wiki/Bintang_Beer), DB Bitters, Tui, ABC Extra Stout and Archipelago Brewery Company range of beers. It also brews [Heineken](/wiki/Heineken) under a license from its [parent company](/wiki/Heineken_International). ### Tiger Beer [Tiger Beer](/wiki/Tiger_Beer) is a [core product](/wiki/Core_product) by Heineken Asia Pacific, amongst the beers originally brewed in Singapore. It is a 5% abv pale lager that was first made in 1932. Today, Tiger Beer is produced at [Tuas](/wiki/Tuas). ### Heineken [Heineken](/wiki/Heineken) Lager Beer is another [core product](/wiki/Core_product) of Heineken Asia Pacific. It is a 5% [abv](/wiki/Alcohol_by_volume) [pale lager](/wiki/Pale_lager) that was first made in 1868 and brews under a license from its parent company. ### Bintang Beer [Bintang Beer](/wiki/Bintang_Beer), is a 4.7% [abv](/wiki/Alcohol_by_volume) [Pilsner](/wiki/Pilsner) brewed by APB's subsidiary *PT Multi Bintang Indonesia* in Indonesia. ### Tui Beer **Tui**, is a 4% [abv](/wiki/Alcohol_by_volume) pale [lager](/wiki/Lager) brewed by APB's subsidiary [DB Breweries](/wiki/DB_Breweries) in New Zealand. ### Anchor Beer (Hainan, China) This section **does not cite any sources**. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed. *(June 2022)* *(Learn how and when to remove this message)* Asia Pacific Breweries opened the first mass production brewery on Hainan Island in the capital city of Haikou in 1997. The new brewery produced Tiger Beer and the now discontinued budget ‘Aoke’ but mainly focused on Anchor Beer. For almost a decade Anchor Beer was the dominant beer on Hainan Island. From 2007 realizing the potential revenues from the booming tourist industry in Hainan, the Tsingtao Beer Company made successful efforts to reduce Anchor's monopoly and as of 2014 outside of the capital Haikou, most small shops stock primarily Tsingtao. As of 2014 there are several unique Anchor Beer types available only in Hainan. These include: Anchor Red Crown 4.4% (similar in taste and branding to Anchor Smooth), Anchor Lite 4.0%, Anchor ‘Classic’ 4.0%, Anchor Ice 4.0% and Anchor 97 4.0%. In addition to the Anchor Beer family the brewery in Haikou also produces Heineken and two versions of ‘Hainan Beer’. One a 3.2% budget version and the other a 4.0% ‘premium’ version with a bright blue logo tailored for tourists and the growing number of international resorts. In late 2015 the company launched 'Anchor Radler' in Hainan Island. A light 1.8% beer mixed with lemon. Sold in 300ml bottles the target market appears to be trendy clubs and afternoon drinkers. The logo is exactly the same as the Radler logo used on Bintang Radler, which also comes in 300ml bottles only. ### The Asian Pacific Brewery Challenge (Hainan) This section **does not cite any sources**. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed. *(June 2022)* *(Learn how and when to remove this message)* While APB actively supports responsible drinking through their ‘drink-savvy’ campaign, a popular pastime of expatriates living in Hainan is to take part in the ‘APB Challenge’. Founded by longtime Hainan expatriate James Farquhar, the first APB challenge took place following a 'Hash House Harrier' event in Sanya on June 22, 2009. APB Hainan produces 5 types of Anchor Beer, 2 types of Tiger Beer (regular Tiger and Tiger Crystal), 2 types of Hainan Beer and Heineken, totaling 10 different beers. Only two are available in cans (Anchor Red Crown and Anchor Lite), only some in 330 ml bottles but all in 600 or 550 ml \"big\" bottles. The APB challenge is to find and drink all 10 types of the big-bottle versions in one day. From 2012 the challenge has become increasingly difficult as some product lines (Anchor 97 and Anchor ‘Classic’) are only available in rural villages outside of the main population centers of Haikou and Sanya. ## Distribution - Alongside [Singapore](/wiki/Singapore), Heineken Asia Pacific has breweries in [India](/wiki/India), [Malaysia](/wiki/Malaysia), [Thailand](/wiki/Thailand), [Vietnam](/wiki/Vietnam), [Cambodia](/wiki/Cambodia), [China](/wiki/China), [New Zealand](/wiki/New_Zealand), [Papua New Guinea](/wiki/Papua_New_Guinea), [Solomon Islands](/wiki/Solomon_Islands), [New Caledonia](/wiki/New_Caledonia), [Sri Lanka](/wiki/Sri_Lanka), [Laos](/wiki/Laos) and [Mongolia](/wiki/Mongolia). The company has a strong [market share](/wiki/Market_share) in several countries within the [Asia Pacific Region](/wiki/Asia-Pacific), primarily in Singapore, Malaysia, Vietnam, Cambodia, Papua New Guinea and New Zealand. In China, official announcement has been made to build a new brewery in a city named Jia Shan, in Zhejiang province, less than an hour drive from the Shanghai city. Estimated operation date will be end of 2015. This is to cope with the high double digit sales volume growth every year for Heineken beer in China. - In Malaysia, Tiger Beer is marketed by [Heineken Malaysia Berhad](/wiki/Heineken_Malaysia_Berhad), exported from Singapore. - In the United Kingdom, Tiger Beer can be found in more than 8,000 premium bars/clubs and distribution outlets in its major cities. It is now brewed in Edinburgh. - Tiger Beer gained considerable popularity in [Detroit](/wiki/Detroit) in October 2006 due to the [Detroit Tigers](/wiki/Detroit_Tigers) [Baseball](/wiki/Baseball) Team's entrance into the [2006 World Series](/wiki/2006_World_Series). - Beer and breweries in Asia - [Get Your Sexy Back](/wiki/Get_Your_Sexy_Back) – A moderate drinking campaign in Singapore - Asia Pacific Breweries Singapore, Home of Tiger Beer - Tiger Beer Archived 2018-07-21 at the [Wayback Machine](/wiki/Wayback_Machine) Portals: - Singapore - Beer\n",
  "language": "en",
  "processed_at": "2026-01-12T11:09:11.672342",
  "title": "Heineken Asia Pacific",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Heineken_Asia_Pacific"
}