{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:09:31.647104"
  },
  "content": "* *[Heritage Trees](/wiki/Heritage_tree) in [Singapore](/wiki/Singapore)** are mature trees specially selected under the Heritage Trees Scheme adopted on 17 August 2001, by the **[National Parks Board (NParks)](/wiki/National_Parks_Board)**. The Heritage Trees Scheme was proposed by the Garden City Action Committee alongside the [Heritage Roads scheme](/wiki/Heritage_roads_in_Singapore), weaving heritage trees into the street landscape. It is part of a nationwide drive in tree conservation efforts not just within [nature reserves](/wiki/Nature_reserve), [parks](/wiki/Park), and [tree conservation areas](/wiki/Tree_conservation_areas_in_Singapore), but also anywhere else in the urban and rural environment of Singapore. The mission statement of the Heritage Trees Scheme emphasises the importance of such trees in shaping residents' \"sense of permanence and identity\" to the landscape, given that these trees have often existed for centuries. The Heritage Road Scheme aims to conserve the scenic and significant tree-lined roads of Singapore. In 2006, the following five roads were gazetted as Heritage Roads: Arcadia Road, Mount Pleasant Road, Lim Chu Kang Road, Mandai Road, South Buona Vista Road. In support of the Scheme, a Heritage Trees Fund was established by the [Hongkong and Shanghai Banking Corporation Limited (HSBC)](/wiki/HSBC) to launch a conservation program that promotes protection and appreciation of Singapore's natural heritage. The program includes initiatives such as the installation of interpretive signage and a nomination scheme for the community. As of 22 October 2025, there are currently 253 Heritage Trees in the Heritage Tree Register. The [Singapore Botanic Gardens](/wiki/Singapore_Botanic_Gardens) has 59 heritage trees. Individuals and organisations who have made significant contributions to the greening of Singapore can receive a Heritage Tree Dedication for life, and will have a Dedication Plaque at the tree. In a media factsheet, NParks states that these donors have donated SGD $500,000 and above to the Garden City Fund. Past recipients have included Lady Yuen-Peng McNeice, The Shaw Foundation, [ST Microelectronics](/wiki/STMicroelectronics), [ExxonMobil](/wiki/ExxonMobil) and [Kikkoman](/wiki/Kikkoman). ## Selection of Heritage Trees Nomination of potential heritage trees is open to the community, and members of the public are encouraged to submit candidates based on these qualifying criteria: a trunk girth (circumference) of more than five metres and/or botanical, social, historical, cultural and/or aesthetical value. Nominated trees will be inspected before being considered by the Heritage Tree Panel, which consists of members with a wide range of expertise. The panel is chaired by Dr Tan Puay Yok, executive director of NParks and group director of the [Singapore Botanic Gardens](/wiki/Singapore_Botanic_Gardens). After endorsement, these trees will be updated in the register, and signage will be given to identify their status as a Heritage Tree. [Tanglin](/wiki/Tanglin)/[Bukit Timah](/wiki/Bukit_Timah) and [Changi](/wiki/Changi) have been gazetted as [Tree Conservation Areas](/wiki/Tree_conservation_areas_in_Singapore), where trees with trunk girth over one metre are protected by law. These regions contain a particularly high density of mature trees. ## List of Heritage Trees - Examples of Heritage Trees in Singapore - Adenanthera malayana subsp. - Baobab - [Changi Tree](/wiki/Changi_Tree) - Damar Hitam Gajah - Earpod Tree - Heritage Tree Appreciation Walk - Heritage Trees Scheme - National Parks Board - Find Heritage Trees from the full registry\n",
  "language": "en",
  "processed_at": "2026-01-12T11:09:31.646682",
  "title": "Heritage trees in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Heritage_trees_in_Singapore"
}