{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:09:35.643431"
  },
  "content": "Malay literary text ***Hikayat Abdullah*** (**حکایت عبدالله**) is a major literary work by [Abdullah bin Abdul Kadir](/wiki/Abdullah_bin_Abdul_Kadir), a [Malacca](/wiki/Malacca)-born [Munshi](/wiki/Munshi) of [Singapore](/wiki/Singapore_in_the_Straits_Settlements), composed in the *[hikayat](/wiki/Hikayat)* genre. It was completed in 1843 and first published in 1849, making it one of the first Malay literary texts to be published commercially. Abdullah's authorship was prominently displayed in this text and the contents were conveyed in simple, contemporary Malay. Unlike typical classical Malay literary works that contain mythical and legendary stories, Abdullah's work dealt with social realism. The book was published in Latin script in 1915 by [William Shellabear](/wiki/William_Shellabear). The work has been described as Abdullah's autobiography, and contains his personal but perceptive view of [Singapore](/wiki/Singapore) and [Malaccan](/wiki/Malacca) society at the beginning of the 19th century. ## Events It provides a glimpse of his early childhood in Malacca, including an operation performed upon him by an English surgeon, his visit to an encampment of the [Tiandihui](/wiki/Tiandihui), a [Chinese](/wiki/Chinese_people) secret society in the interior of Singapore, and events such as the founding of [Singapore Institution](/wiki/Singapore_Institution), the demolition of the old [A Famosa](/wiki/A_Famosa) fort in Malacca, and the visit of [Lord Minto](/wiki/Gilbert_Elliot-Murray-Kynynmound,_4th_Earl_of_Minto), a [Governor-General of India](/wiki/Governor-General_of_India), to Malacca. The work also contains his personal observations of the personalities of his time, the officials of the British [East India Company](/wiki/East_India_Company), like [Sir Stamford Raffles](/wiki/Sir_Stamford_Raffles), [Colonel Farquhar](/wiki/William_Farquhar) and [John Crawfurd](/wiki/John_Crawfurd), [Sultan Hussein Shah](/wiki/Sultan_Hussein_Shah) of [Johor Sultanate](/wiki/Johor_Sultanate), [European](/wiki/Europe) and [American](/wiki/United_States) [missionaries](/wiki/Missionaries) and traders, and the Chinese merchants of the early Singapore. It has a notable personal witness account of a contemporary [slave trade](/wiki/Slavery_in_Asia) done in [Singapore](/wiki/Singapore), particularly the treatment of a boat of enslaved [Manggarai](/wiki/Manggarai_people) family forcibly separated by their [Bugis](/wiki/Bugis) owners, and [Balinese](/wiki/Balinese_people) and Bugis women sold to Chinese, Indian and Malay buyers. ## Translations An early English edition of the work was translated by J.T. Thomson (H.S. King, London, 1874), though this is considered to be incomplete and inaccurate. A more authoritative English edition was translated by A.H. Hill and published in the [Journal of the Malayan Branch Royal Asiatic Society](/wiki/Journal_of_the_Malaysian_Branch_of_the_Royal_Asiatic_Society) (Volume XXVIII Part 3, June 1955). The society stocks reprints of this translation for sale. ## Legacy The work is an inspiration for the narrator of *[Earthly Powers](/wiki/Earthly_Powers)*, a novel by [Anthony Burgess](/wiki/Anthony_Burgess). Indeed, in chapter 35, the character Kenneth Toomey decides to write a novel based on Hikayat Abdullah: > That afternoon I read the brief autobiography, lying on the bed under the gentle fan. I tingled cautiously. A novel about Raffles, an East India Company clerk who got Java out of the hands of the French during the Napoleonic wars, ruled it like an angel, then grabbed Sumatra, then negotiated the purchase of a lump of swampy land called Singapore. And what did he get out of it? Nothing except fever, shipwreck and an early death. The story to be told by this hypochondriac Moslem Abdullah. I could see my novel done, printed, bound, about a hundred thousand words, displayed in bookshops, rapturously praised or jealously attacked. *King of the Lion City*, by Kenneth M. Toomey. No, *Man of the Eastern Seas*. I held my novel in the fingers of my imagination, flicking, reading: ‘The fever bit badly tonight. The candles flapped in the first warning gust of the monsoon. His hand shook as he sanded the last page of his report to the EIC in London. A house lizard scuttled up the wall cheeping.’ My God, what a genius I had then, was about to have then. And, of course, besides, I clearly saw, the writing of a novel about that old Malaya necessitated staying here and staying put. Odd trips to museums somewhere, Penang, Malacca, but the writing done here, in this bare room, *tuan mahu minum*, a queer case of propro this morning at the *rumah sakit*, home. You could write short stories anywhere, a novel required a base. No, *Flames in the Eastern Sky*. No, He Built an Island. ‘I, who am called Abdullah and am by trade a munshi or teacher of language, sit here pen in hand remembering. The ink dries on my penpoint but tears remoisten it. I am remembering my old master, an *orang puteh* or white man from a far cold island, one who was father and mother to me but has abandoned me to a loneliness which only memory can sweeten.’ By God, I would do it. Novel in the morning, short stories in the afternoon. I must go halves with the rent and the provisions. *Lion City*, that was it. I saw the jacket illustration: a handsome weary man in Regency costume brooding over a plan with a Chinese overseer, a background of coolies hacking at the mangroves. By God, the book was ready except for the writing of it. I deserved a light sleep till Philip’s return and teatime. - J.T. Thomson's translation at the [Internet Archive](/wiki/Internet_Archive)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:09:35.642945",
  "title": "Hikayat Abdullah",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Hikayat_Abdullah"
}