{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:09:39.788121"
  },
  "content": "Subzone of Bukit Batok Planning Area in Singapore **Hillview** is a [subzone](/wiki/Subzones_of_Singapore) located in [Bukit Batok](/wiki/Bukit_Batok) in [Singapore](/wiki/Singapore). The neighbourhood overlooks [Bukit Timah Hill](/wiki/Bukit_Timah_Hill), hence its name. ## Ecology Hillview is set amongst greenery encircled by the woodlands of [Bukit Gombak](/wiki/Gombak,_Bukit_Batok) to the west, [Bukit Batok Nature Park](/wiki/Bukit_Batok_Nature_Park) to the south and [Bukit Timah Nature Reserve](/wiki/Bukit_Timah_Nature_Reserve) to the east. Near it are several other nature parks, such as [Hindhede Nature Park](/wiki/Hindhede_Nature_Park), [Dairy Farm Nature Park](/wiki/Dairy_Farm_Nature_Park), Chestnut Nature Park, and [Rifle Range Nature Park](/wiki/Rifle_Range_Nature_Park). ## History ### Industrial Past From the early 1940s to the late 80s, Hillview was an industrial precinct, home to factories such as the [Old Ford Motor Factory](/wiki/Old_Ford_Motor_Factory) (built in 1941), Castrol Oil Company, Union Carbide, Cycle & Carriage Daimler-Benz car assembly plant (built in 1965) and Hume Pipe Company factory (lease in Hume Avenue granted in 1927). Today, only the Old Ford Motor factory remains, as the other factories have made way for private residential developments. The [KTM Malayan Railway](/wiki/Keretapi_Tanah_Melayu) used to operate passenger and freight services that ran through Hillview, from Malaysia in the north to [Tanjong Pagar railway station](/wiki/Tanjong_Pagar_railway_station) in the south. Two railway truss bridges spanning across the undulating terrain near Hillview are of heritage significance. Under a [bilateral agreement signed between Singapore and Malaysia](/wiki/Malaysia%E2%80%93Singapore_Points_of_Agreement_of_1990#Land_swap) in 2010, the railway land was returned to Singapore. Since then, the railway land has largely been kept untouched and has only recently been actively redeveloped as a [green corridor](/wiki/Greenway_(landscape)), with access points being gradually added throughout the 24-km stretch of land. It includes a new bridge over Hillview Road completed in 2023. ### Second World War Located just beside [Bukit Timah Hill](/wiki/Bukit_Timah_Hill), the area witnessed one of the fiercest military encounters in Singapore during [World War II](/wiki/World_War_II) as Bukit Timah held strategic and tactical importance to both the Japanese and the British. The [Ford Motor Factory](/wiki/Former_Ford_Factory) most notably served as the venue for the formal surrender of the Malayan Peninsula by the British Commanding Officer, Lt-Gen. [Arthur Ernest Percival](/wiki/Arthur_Percival), to the Japanese Commander of the 25th Army, Gen. [Yamashita Tomoyuki](/wiki/Tomoyuki_Yamashita) on 15 February 1942. ## Infrastructure ### Public housing era **Princess Elizabeth Estate**, a housing estate located along Hillview Avenue's Elizabeth Drive, was built around 1951 to commemorate the wedding of [Princess Elizabeth](/wiki/Elizabeth_II) (later Queen Elizabeth II) to [Prince Philip](/wiki/Prince_Philip,_Duke_of_Edinburgh) (the Duke of Edinburgh) in 1947. There was also public housing built by the [Housing Development Board](/wiki/Housing_Development_Board) (HDB) around 1979 at the north end of Hillview, including a community centre, wet market, hawker centre and some neighbourhood shops. In 1999, the government announced that the HDB estate would be relocated to [Bukit Gombak](/wiki/Bukit_Gombak) via the largest [Selective En-bloc Redevelopment Scheme](/wiki/Selective_En_bloc_Redevelopment_Scheme) (SERS). The residents started the relocation in 2003 to 2005. By 2006, the last HDB blocks were demolished, marking the end of the Princess Elizabeth Estate. ### Gentrification Since the relocation of public housing from Hillview during the late 2000s, the subzone has been [gentrified](/wiki/Gentrified) and is now composed of condominiums and landed properties. It is served by restaurants, delicatessens, watering holes, cafes, convenience stores and suburban shopping mall, HillV2. The Hillview Community Club, located close to the [Hillview MRT station](/wiki/Hillview_MRT_station), opened in 2019. A strip mall called [the Rail Mall](/wiki/The_Rail_Mall) is also located in the vicinity. By [Mass Rapid Transit](/wiki/Mass_Rapid_Transit_(Singapore)) (MRT), Hillview is serviced by [Hillview](/wiki/Hillview_MRT_station) and [Hume](/wiki/Hume_MRT_station) stations on the [Downtown Line](/wiki/Downtown_Line) (DTL). Hume was initially a [shell station](/wiki/Ghost_station) before it was opened in 2025 for improved connectivity to the [Rail Corridor](/wiki/Rail_Corridor_(Singapore)) and the [Former Bukit Timah Fire Station](/wiki/Former_Bukit_Timah_Fire_Station). Construction of Hillview Connect, a road extension of Dairy Farm Road into Hillview Rise to enable an alternative direct route into Hillview, was also completed in 2025. There is also an upcoming commercial development at Hillview Road where the previous [Standard Chartered](/wiki/Standard_Chartered) building was, known as Hillview Junction.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:09:39.787621",
  "title": "Hillview, Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Hillview,_Singapore"
}