{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:09:37.714680"
  },
  "content": "Chinese multinational private equity firm **Hillhouse Investment Management Ltd.** is a Hong Kong‑headquartered global investment firm founded in 2005 by Chinese investor [Lei Zhang](/wiki/Zhang_Lei_(investor)). The firm built its early track record in mainland China after receiving seed capital from the [Yale University endowment](/wiki/Yale_University_endowment), with early stakes in companies such as [Tencent](/wiki/Tencent). Hillhouse has offices in Singapore, [Hong Kong](/wiki/Hong_Kong), [Beijing](/wiki/Beijing) and [Shanghai](/wiki/Shanghai) with additional international offices in [New York City](/wiki/New_York_City) and [London](/wiki/London). Hillhouse's [assets under management](/wiki/Assets_under_management) (\"AUM\") were US$73.3 billion as of July 2021. In October 2021, Hillhouse raised US$18 billion for its fifth flagship [private equity](/wiki/Private_equity) fund, breaking the previous record set by [KKR](/wiki/Kohlberg_Kravis_Roberts)'s US$15 billion pan-Asia [private equity](/wiki/Private_equity) fund raised that same year. Hillhouse is a long-term fundamental research-driven equity investor, investing in all equity stages in sectors including consumer, healthcare, technology, and financials services. ## History [Lei Zhang](/wiki/Zhang_Lei_(investor)) founded Hillhouse Investment in June 2005 with an initial US$20 million of seed capital from the [Yale University](/wiki/Yale_University) [endowment](/wiki/Financial_endowment) through [David Swensen](/wiki/David_F._Swensen), Yale's Chief Investment Officer at the time. By 2017, the firm had participated in more private equity acquisitions in the [Asia-Pacific](/wiki/Asia-Pacific) region than any other [private equity](/wiki/Private_equity) firm, totaling $26 billion worth of transactions. In 2020, Hillhouse spun off its [venture capital](/wiki/Venture_capital) unit into an independent fund. The new fund is called GL Ventures. As of 2020, Hillhouse was an investor in companies such as Airwallex. Hillhouse was nearing raising US$18 billion to back three new funds in May 2021, higher than the projected $13 billion in April 2021, according to reports, with $10 billion to be allocated to buyouts, and the rest \"split between growth equity and venture.\" The company at the time was managing $100 billion. In August 2021, Hillhouse completed fundraising for its fifth flagship [private equity](/wiki/Private_equity) investment fund at US$18 billion, the largest amount of capital raised by any [private equity](/wiki/Private_equity) firm in Asia and breaking the previous record set by [KKR](/wiki/Kohlberg_Kravis_Roberts)'s US$15 billion pan-Asia [private equity](/wiki/Private_equity) fund, also raised in 2021. In 2022, Hillhouse started its first real estate-focused fund, the Hillhouse Real Asset Opportunities Fund (RAOF), with a total investment of more than $2 billion. In 2024, *The Wall Street Journal* reported that Hillhouse’s China staff had been reduced and that it \"removed many explicit mentions of China from its website.\" ## Notable investments [Tencent Holdings Ltd](/wiki/Tencent_Holdings_Ltd): Some original $20 million provided from Yale was invested in Tencent Holdings in 2005. It was Hillhouse's earliest investment and one of their most profitable. [JD.com](/wiki/JD.com): Hillhouse was an early investor in JD.com. At the time of the listing of JD.com on [NASDAQ](/wiki/NASDAQ) in May 2014, the company was valued at $26 billion. Hillhouse's original $255 million investment was, at the time of the [IPO](/wiki/IPO), valued at $3.9 billion. Blue Moon: Hillhouse invested in Blue Moon, a liquid detergent maker, in 2010 as its only outside institutional investor. [Belle International](/wiki/Belle_International): In July 2017, Hillhouse purchased footwear company Belle International for $6.8 billion. [Global Logistic Properties](/wiki/GLP_(company)): Hillhouse, together with [Hopu Investment Management](/wiki/Hopu_Investment_Management), purchased Singapore-based warehouse operator Global Logistic Properties in 2017 for $12 billion. At the time, it was the largest buyout of an Asian company. Little Freddie: In 2018, Hillhouse began investing in the food sector, including organic baby food and snack manufacturer Little Freddie, a Californian craft beer maker and a pet food brand. [Miniso](/wiki/Miniso): In October 2018, Hillhouse signed a strategic investment agreement with Japanese-style retailer Miniso worth RMB 1 billion ($145.6 million). [Philips Domestic Appliances](/wiki/Philips): In August 2021, Hillhouse closed the deal of acquisition on the global domestic appliances business from Dutch conglomerate Philips. LifeStyles Healthcare: In December 2020, Hillhouse invested in Lifestyles Healthcare, an Australian global manufacturer of sexual wellness products. The company entered the Chinese market in 2006 after acquiring Jissbon. Gimborn: In 2016 Hillhouse acquired Gimborn, a German producer of cat litter and pet supplements, for an undisclosed sum. Zoom: Hillhouse was an investor in [Zoom Video Communications](/wiki/Zoom_Video_Communications) in an early funding round in February 2015. Peet's Coffee: In 2017, Peet’s announced the formation of Peet’s Coffee China, an independently run joint venture formed by Peet’s Coffee and Hillhouse. BeiGene: Hillhouse co-led a round of financing for biotechnology company [BeiGene](/wiki/BeiGene) in May 2015. ## Joint ventures Hillhouse established an exclusive joint venture focused on China with the US healthcare provider, [Mayo Clinic](/wiki/Mayo_Clinic). Hillhouse works with the Mayo organization to expand its healthcare outreach in China. In November 2017, Peet's Coffee China, a partnership between Hillhouse and San Francisco-based [Peet's Coffee](/wiki/Peet%27s_Coffee), opened the first Peet's Coffee roastery in [Shanghai](/wiki/Shanghai). ## Notable investors According to the *[Wall Street Journal](/wiki/Wall_Street_Journal)*, [Stanford University](/wiki/Stanford_University) pledged to invest about US$200 million with Hillhouse in August 2015. With Stanford's investment, the firm manages \"money for at least six of the 10 wealthiest universities in the U.S.\" The other university investors in Hillhouse include [Princeton University](/wiki/Princeton_University), [Massachusetts Institute of Technology](/wiki/Massachusetts_Institute_of_Technology), [University of Pennsylvania](/wiki/University_of_Pennsylvania), [University of Texas](/wiki/University_of_Texas_at_Austin), and [Yale University](/wiki/Yale_University). [CPPIB](/wiki/CPP_Investment_Board) committed US$200 million to Fund II in 2014, US$300 million to Fund III in 2016, and US$300 million to Fund IV in 2018. - Hillhouse official website - \"Lei Zhang's Lecture\" at [Columbia Business School](/wiki/Columbia_Business_School); notes by Zong Z. Peng via *market folly.com*, 29 July 2015.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:09:37.714014",
  "title": "Hillhouse Investment",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Hillhouse_Investment"
}