{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:09:57.711660"
  },
  "content": "This article includes a list of references, related reading, or external links, **but its sources remain unclear because it lacks inline citations**. Please help improve this article by introducing more precise citations. *(January 2022)* *(Learn how and when to remove this message)*Part of a series on the[History of Singapore](/wiki/History_of_Singapore)[Early history](/wiki/Early_history_of_Singapore) (pre-1819)[Srivijaya](/wiki/Srivijaya)650–1377[Temasek](/wiki/Temasek), [Long Ya Men](/wiki/Long_Ya_Men), [Ban Zu](/wiki/Ban_Zu)c.14th century[Kingdom of Singapura](/wiki/Kingdom_of_Singapura)1299–1398[Majapahit](/wiki/Majapahit)1398–1400[Malacca Sultanate](/wiki/Malacca_Sultanate)1400–1528[Johor Sultanate](/wiki/Johor_Sultanate)1528–1819British colonial era (1819–1942)[Founding](/wiki/Founding_years_of_modern_Singapore)1819–1826[Straits Settlements](/wiki/Singapore_in_the_Straits_Settlements)1826–1867[Crown colony](/wiki/Singapore_in_the_Straits_Settlements#Crown_colony_(1867–1942))1867–1942[Japanese Occupation](/wiki/Japanese_occupation_of_Singapore) (1942–1945)[Fall of Singapore](/wiki/Fall_of_Singapore)1942[Sook Ching](/wiki/Sook_Ching)1942[Double Tenth incident](/wiki/Double_Tenth_incident)1943[Post-war period](/wiki/Colony_of_Singapore) (1945–1962)[First Legislative Council](/wiki/History_of_Singapore#First_Legislative_Council_(1948–1951))1948–1951[Maria Hertogh riots](/wiki/Maria_Hertogh_riots)1950[Second Legislative Council](/wiki/History_of_Singapore#Second_Legislative_Council_(1951–1955))1951–1955[Anti-National Service Riots](/wiki/1954_National_Service_riots)1954[Internal self-government](/wiki/Self-governance_of_Singapore) (1955–1963)[Hock Lee bus riots](/wiki/Hock_Lee_bus_riots)1955[Singapore Glass Factory strikes](/wiki/Singapore_Glass_Factory_strikes)1960[Pulau Senang prison riots](/wiki/Pulau_Senang_prison_riots)1963[Merger with Malaysia](/wiki/History_of_the_State_of_Singapore_(Malaysia)) (1963–1965)[Singaporean referendum](/wiki/1962_Singaporean_integration_referendum)1962[Operation Coldstore](/wiki/Operation_Coldstore)1963[Race riots in Singapore](/wiki/1964_race_riots_in_Singapore)1964[MacDonald House bombing](/wiki/MacDonald_House_bombing)1965[Republic of Singapore](/wiki/History_of_the_Republic_of_Singapore) (1965–present)[ASEAN Declaration](/wiki/ASEAN_Declaration) ([ASEAN](/wiki/Association_of_Southeast_Asian_Nations))1967[1969 race riots of Singapore](/wiki/1969_race_riots_of_Singapore)1969[Laju incident](/wiki/Laju_incident)1974[Operation Spectrum](/wiki/Operation_Spectrum)1987[Asian financial crisis](/wiki/1997_Asian_financial_crisis#Singapore)1997[Embassies attack plot](/wiki/Singapore_embassies_attack_plot)2001[H1N1 pandemic](/wiki/2009_swine_flu_pandemic_in_Asia#Singapore)2009–2010[Bus drivers' strike](/wiki/2012_Singapore_bus_drivers%27_strike)2012[Little India riot](/wiki/2013_Little_India_riot)2013[2018 North Korea–United States Singapore Summit](/wiki/2018_North_Korea%E2%80%93United_States_Singapore_Summit)2018[COVID-19 pandemic](/wiki/COVID-19_pandemic_in_Singapore)2020–2022By topic - [Timeline](/wiki/Timeline_of_Singaporean_history) - [Riots](/wiki/List_of_riots_in_Singapore) - [Military](/wiki/Military_history_of_Singapore) Singapore portal - v - t - e The **History of the [Singapore Police Force](/wiki/Singapore_Police_Force)** is a long one, and in many ways, has paralleled the astronomical economic growth of the country the force is tasked to protect. From a staff of eleven men based in a simple [attap](/wiki/Attap) hut, the force has grown to over 36,000 men and women, basing their operations from thirty-two [Neighbourhood Police Centres](/wiki/Neighbourhood_Police_Centre) (NPCs), sixty Neighbourhood Police Posts (NPPs), and various other land and marine establishments spread across the country. ## Early years The Singapore Police Force has a heritage almost as old as that of modern Singapore, having been formed in 1820 with a skeleton force of 11 men under the command of [Francis James Bernard](/wiki/Francis_James_Bernard), son-in-law of [William Farquhar](/wiki/William_Farquhar). With no background nor knowledge on policing, Bernard had to work from scratch, as well as occasionally turning to Farquhar for help. In addition, he held multiple roles as [magistrate](/wiki/Magistrate), chief jailer, harbour master, marine storekeeper, as well as personal assistants to Farquhar. Despite these constraints, Bernard managed to establish the force by recruiting a *[jemadar](/wiki/Jemadar)* (Asian [sergeant](/wiki/Sergeant)), eight *[peons](/wiki/Peon)* ([patrolmen](/wiki/Patrolmen)), a [jailer](/wiki/Prison_officer), and a [Malay](/wiki/Malaysia) writer, kept in operation by a monthly budget of $300. It is likely that some of these men were recruited from amongst the Indian [sepoys](/wiki/Sepoy) brought to the settlement by its founder, Sir [Stamford Raffles](/wiki/Stamford_Raffles). Manpower constraints meant that the men had to perform a wide range of roles, and required the help of headmen amongst the various ethnic communities to maintain orderliness on the streets, all the more possible as the communities lived in segregated areas around the city. This partnership with the community was in line with Raffles's vision of a thriving colony largely self-regulated by local social structures, with the British masters administrating it via indirect rule. The large influx of migrants from China, however, began to test this system when the hands-off approach by the British allowed [Secret societies in Singapore](/wiki/Secret_societies_in_Singapore) to thrive. Although originally formed with legal intentions of community bonding and the provision of assistance to fellow migrants, these societies gradually became influential, competitive, and increasingly engaged in illegal activities including monetary extortion from the masses, the operation of [gambling](/wiki/Gambling) dens, and the [smuggling](/wiki/Smuggling) of illegal goods on top of more legal commercial operations to meet their financial needs. Competition gradually heated up between large rival factions, such as that between the larger [Ghee Hin Kongsi](/wiki/Ghee_Hin_Kongsi), the Ghee Hock Kongsi and the Han San Kongsi. Murders, mass riots, kidnappings, arson and other serious crimes became commonplace in the four decades after the colony's founding. Faced with violent acts of crime which may involve thousands, such as the Funeral riots in 1846 involving 9000 members from the Ghee Hin and Ghee Hock secret societies, the police force was woefully incapable of bringing the situation under control, and often had to call in the army for assistance. The escalating number of serious crimes prompted the need for stronger legislation to deter would-be criminals. Singapore's first [executions](/wiki/Execution_(legal)) were thus held in the wake of the first criminal session in June 1828, when a Chinese and Indian were found guilty and convicted for [murder](/wiki/Murder). Headed by Europeans and predominantly staffed by Malay and Indian officers, the force had little Chinese representation as the military and policing professionals were traditionally shunned by the Chinese community, which therefore impaired policing efforts amongst the large Chinese populace. In 1843, the force consisted of a sitting magistrate doubling as a [superintendent](/wiki/Superintendent_(police)), three European [constables](/wiki/Constables) and an assistant native constable, fourteen officers and 110 policemen. With a total strength of no more than 150 men, the force was compelled to avoid direct intervention in these mass acts of violence, or risk almost total annihilation. A repeat of this scenario occurred in 1851, when lingering displeasure against [Roman Catholic](/wiki/Roman_Catholic) ethnic Chinese erupted into major rioting leaving over 500 Chinese dead. The army was called in again, although it involved having to induct Indian convicts into military service almost overnight. In 1854, twelve consecutive days of violence sparked by a dispute between the Hokkiens and Teochews disrupted trade. This particular incident led to the formation of the military's [Singapore Volunteer Corps](/wiki/Singapore_Volunteer_Corps) on 8 July 1854, the earliest predecessor of the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces)' [People's Defence Force](/wiki/Military) today. Criminal violence was not merely in the domain of the ethnic Chinese, however. Rivalries between Malay princes and communities also often result in acts of violence, which prompted the passing of Singapore's first arms law in March 1823 restricting the right to bear arms to twenty-four of the Malay Sultan's followers. Nearly two centuries later, these anti-arms laws continue to be strictly enforced, resulting in a society relatively free from firearms-related criminal offences. - \"In the Service of the Nation\", John Drysdale, Federal Publications, 1985 [ISBN](/wiki/ISBN_(identifier)) 9971-4-0703-5 - \"Phoenix: the story of the Home Team \", Felix Soh, Times Editions, 2003 [ISBN](/wiki/ISBN_(identifier)) 981-232-637-5 - \"Policing Singapore in the 19th & 20th centuries\", Peer M. Akbur, Singapore Police Force, 2002 [ISBN](/wiki/ISBN_(identifier)) 981-04-7024-X\n",
  "language": "en",
  "processed_at": "2026-01-12T11:09:57.711161",
  "title": "History of the Singapore Police Force",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/History_of_the_Singapore_Police_Force"
}