{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:09:48.113961"
  },
  "content": "Part of a series on theHistory of Singapore[Early history](/wiki/Early_history_of_Singapore) (pre-1819)[Srivijaya](/wiki/Srivijaya)650–1377[Temasek](/wiki/Temasek), [Long Ya Men](/wiki/Long_Ya_Men), [Ban Zu](/wiki/Ban_Zu)c.14th century[Kingdom of Singapura](/wiki/Kingdom_of_Singapura)1299–1398[Majapahit](/wiki/Majapahit)1398–1400[Malacca Sultanate](/wiki/Malacca_Sultanate)1400–1528[Johor Sultanate](/wiki/Johor_Sultanate)1528–1819British colonial era (1819–1942)[Founding](/wiki/Founding_years_of_modern_Singapore)1819–1826[Straits Settlements](/wiki/Singapore_in_the_Straits_Settlements)1826–1867[Crown colony](/wiki/Singapore_in_the_Straits_Settlements#Crown_colony_(1867–1942))1867–1942[Japanese Occupation](/wiki/Japanese_occupation_of_Singapore) (1942–1945)[Fall of Singapore](/wiki/Fall_of_Singapore)1942[Sook Ching](/wiki/Sook_Ching)1942[Double Tenth incident](/wiki/Double_Tenth_incident)1943[Post-war period](/wiki/Colony_of_Singapore) (1945–1962)First Legislative Council1948–1951[Maria Hertogh riots](/wiki/Maria_Hertogh_riots)1950Second Legislative Council1951–1955[Anti-National Service Riots](/wiki/1954_National_Service_riots)1954[Internal self-government](/wiki/Self-governance_of_Singapore) (1955–1963)[Hock Lee bus riots](/wiki/Hock_Lee_bus_riots)1955[Singapore Glass Factory strikes](/wiki/Singapore_Glass_Factory_strikes)1960[Pulau Senang prison riots](/wiki/Pulau_Senang_prison_riots)1963[Merger with Malaysia](/wiki/History_of_the_State_of_Singapore_(Malaysia)) (1963–1965)[Singaporean referendum](/wiki/1962_Singaporean_integration_referendum)1962[Operation Coldstore](/wiki/Operation_Coldstore)1963[Race riots in Singapore](/wiki/1964_race_riots_in_Singapore)1964[MacDonald House bombing](/wiki/MacDonald_House_bombing)1965[Republic of Singapore](/wiki/History_of_the_Republic_of_Singapore) (1965–present)[ASEAN Declaration](/wiki/ASEAN_Declaration) ([ASEAN](/wiki/Association_of_Southeast_Asian_Nations))1967[1969 race riots of Singapore](/wiki/1969_race_riots_of_Singapore)1969[Laju incident](/wiki/Laju_incident)1974[Operation Spectrum](/wiki/Operation_Spectrum)1987[Asian financial crisis](/wiki/1997_Asian_financial_crisis#Singapore)1997[Embassies attack plot](/wiki/Singapore_embassies_attack_plot)2001[H1N1 pandemic](/wiki/2009_swine_flu_pandemic_in_Asia#Singapore)2009–2010[Bus drivers' strike](/wiki/2012_Singapore_bus_drivers%27_strike)2012[Little India riot](/wiki/2013_Little_India_riot)2013[2018 North Korea–United States Singapore Summit](/wiki/2018_North_Korea%E2%80%93United_States_Singapore_Summit)2018[COVID-19 pandemic](/wiki/COVID-19_pandemic_in_Singapore)2020–2022By topic - [Timeline](/wiki/Timeline_of_Singaporean_history) - [Riots](/wiki/List_of_riots_in_Singapore) - [Military](/wiki/Military_history_of_Singapore) Singapore portal - v - t - e The history of the modern state of [Singapore](/wiki/Singapore) dates back to its founding in the early 19th century; however, evidence suggests that a significant trading settlement existed on the [island](/wiki/Singapore_Island) in the 14th century. The last ruler of the [Kingdom of Singapura](/wiki/Kingdom_of_Singapura), [Parameswara](/wiki/Parameswara_(sultan)), was expelled by the [Majapahit](/wiki/Majapahit) or the [Siamese](/wiki/Ayutthaya_Kingdom) before he founded [Malacca](/wiki/Malacca_Sultanate). Singapore then came under the [Malacca Sultanate](/wiki/Malacca_Sultanate) and subsequently the [Johor Sultanate](/wiki/Johor_Sultanate). In 1819, British statesman [Stamford Raffles](/wiki/Stamford_Raffles) negotiated a treaty whereby Johor would allow the British to locate a trading port on the island, ultimately leading to the establishment of the [Crown colony of Singapore](/wiki/Founding_years_of_modern_Singapore) in 1867. Important reasons for the rise of Singapore were its nodal position at the tip of the Malay Peninsula flanked by the Pacific and Indian Oceans, the presence of a natural sheltered harbour, as well as its status as a free port. During [World War II](/wiki/World_War_II), Singapore was invaded and occupied by the [Japanese Empire](/wiki/Empire_of_Japan) from 1942 to 1945. When the Japanese surrendered, Singapore reverted to British control, with increasing levels of [self-government](/wiki/Self-governance) being granted, resulting in [Singapore's merger](/wiki/Singapore_in_Malaysia) with the [Federation of Malaya](/wiki/Federation_of_Malaya) to form [Malaysia](/wiki/Malaysia) in 1963. However, social unrest, racial tensions, and political differences between Singapore's governing [People's Action Party](/wiki/People%27s_Action_Party) (PAP) and Malaysia's [Alliance Party](/wiki/Alliance_Party_(Malaysia)) resulted in [Singapore's expulsion from Malaysia](/wiki/Singapore_in_Malaysia#Expulsion). Singapore became an independent republic on 9 August 1965. By the 1990s, the country had established a highly [developed](/wiki/Economic_development) [free market economy](/wiki/Free_market_economy) and strong [international trading](/wiki/International_trade) links. It now has the highest [per capita gross domestic product](/wiki/List_of_countries_by_GDP_(nominal)_per_capita) in Asia, which is 7th in the world, and it is ranked 9th on the UN [Human Development Index](/wiki/List_of_countries_by_Human_Development_Index). ## Ancient Singapore The Greco-Roman astronomer [Ptolemy](/wiki/Ptolemy) (90–168) identified a place called *Sabana* at the tip of [Golden Chersonese](/wiki/Golden_Chersonese) (believed to be the [Malay Peninsula](/wiki/Malay_Peninsula)) in the second and third century. The earliest written record of Singapore may be in a Chinese book *《吳時外國傳》* from the third century, describing the island of *Pu Luo Chung* (蒲 羅 中). This has been proposed to be related to the [Malay](/wiki/Malay_language) name *\"[Pulau Ujong](/wiki/Pulau_Ujong)\"*, or \"island at the end\" (of the [Malay Peninsula](/wiki/Malay_Peninsula)). In 1025 CE, [Rajendra Chola I](/wiki/Rajendra_Chola_I) of the [Chola Empire](/wiki/Chola_Empire) led forces across the [Indian Ocean](/wiki/Indian_Ocean) and invaded the [Srivijayan empire](/wiki/Srivijaya_empire), attacking several places in [Malaysia](/wiki/Malaysia) and [Indonesia](/wiki/Indonesia). The Chola forces were said to have controlled [Temasek](/wiki/Temasek) (now [Singapore](/wiki/Singapore)) for a couple of decades. The name Temasek however did not appear in Chola records, but a tale involving a Raja Chulan (assumed to be Rajendra Chola) and Temasek was mentioned in the semi-historical *[Malay Annals](/wiki/Malay_Annals)*. The [Nagarakretagama](/wiki/Nagarakretagama), a [Javanese](/wiki/Java_(island)) eulogy written in 1365, referred to a settlement on the island called *[Tumasik](/wiki/Temasek)* (possibly meaning \"*Sea Town*\" or \"*Sea Port*\"). The name [Temasek](/wiki/Temasek) is also given in [Sejarah Melayu](/wiki/Sejarah_Melayu) (*Malay Annals*), which contains a tale of the founding of Temasek by a prince of Palembang, Sri Tri Buana (also known as [Sang Nila Utama](/wiki/Sang_Nila_Utama)) in the 13th century.: 37 Sri Tri Buana landed on Temasek on a hunting trip, and saw a strange beast said to be a lion. The prince took this as an auspicious sign and founded a settlement called Singapura, which means \"Lion City\" in Sanskrit. The actual origin of the [name Singapura](/wiki/Names_of_Singapore) however is unclear according to scholars. In 1320, the [Mongol Empire](/wiki/Mongol_Empire) sent a trade mission to a place called *[Long Ya Men](/wiki/Long_Ya_Men)* (or *Dragon's Teeth Gate*), which is believed to be [Keppel Harbour](/wiki/Keppel_Harbour) at the southern part of the island. The Chinese traveller [Wang Dayuan](/wiki/Wang_Dayuan), visiting the island around 1330, described *[Long Ya Men](/wiki/Long_Ya_Men)* as one of the two distinct settlements in *[Dan Ma Xi](/wiki/Temasek)* (from Malay *[Temasek](/wiki/Temasek)*), the other being *[Ban Zu](/wiki/Ban_Zu)* (from Malay *pancur*). *Ban Zu* is thought to be present day [Fort Canning Hill](/wiki/Fort_Canning_Hill), and [recent excavations](/wiki/Archaeology_in_Singapore) in Fort Canning found evidence indicating that Singapore was an important settlement in the 14th century. Wang mentioned that the natives of *Long Ya Men* (thought to be the *[Orang Laut](/wiki/Orang_Laut)*) and Chinese residents lived together in *Long Ya Men*. Singapore is one of the oldest locations where a Chinese community is known to exist outside China, and the oldest confirmed by archaeological and historical research. By the 14th century, the empire of [Srivijaya](/wiki/Srivijaya) had already declined, and Singapore was caught in the struggle between Siam (now [Thailand](/wiki/Thailand)) and the Java-based Majapahit Empire for control over the Malay Peninsula. According to the [Malay Annals](/wiki/Malay_Annals), Singapore was defeated in one Majapahit attack. The last king, [Sultan Iskandar Shah](/wiki/Parameswara_(king)) ruled the island for several years, before being forced to [Melaka](/wiki/Melaka) where he founded the [Sultanate of Malacca](/wiki/Sultanate_of_Malacca). Portuguese sources, however, indicated that Temasek was a Siamese vassal whose ruler was killed by [Parameswara](/wiki/Parameswara_(sultan)) (thought to be the same person as Sultan Iskandar Shah) from Palembang, and Parameswara was then driven to Malacca, either by the Siamese or the Majapahit, where he founded the [Malacca Sultanate](/wiki/Malacca_Sultanate). Modern archaeological evidence suggests that the settlement on [Fort Canning](/wiki/Fort_Canning) was abandoned around this time, although a small trading settlement continued in Singapore for some time afterward. The Malacca Sultanate extended its authority over the island and Singapore became a part of the Malacca Sultanate. However, by the time the Portuguese arrived in the early 16th century, Singapura had already become \"great ruins\" according to [Alfonso de Albuquerque](/wiki/Alfonso_de_Albuquerque). In 1511, the Portuguese seized Malacca; the sultan of Malacca escaped south and established the [Johor Sultanate](/wiki/Johor_Sultanate), and Singapore then became part of the sultanate. A settlement once existed on the Singapore River which formed an outpost of the Johor Sultanate whose capital lay along the [Johor River](/wiki/Johor_River). The settlement was occupied up until the early 17th century, an account by [Eredia](/wiki/Manuel_Godinho_de_Er%C3%A9dia) mentions government officials still being stationed there around 1600. In 1613, the Portuguese destroyed the settlement in Singapore, and the island sank into obscurity for the next two centuries, likely only occupied by [Sea Peoples](/wiki/Orang_Laut). ## 1819: British colony of Singapore Between the 16th and 19th centuries, the [Malay Archipelago](/wiki/Malay_Archipelago) was gradually taken over by the European colonial powers, beginning with the arrival of the [Portuguese](/wiki/Portuguese_Empire) at [Malacca](/wiki/Malacca) in 1509. The early dominance of the Portuguese was challenged during the 17th century by the [Dutch](/wiki/Dutch_colonial_empire), who came to control most of the ports in the region. The Dutch established a monopoly over trade within the archipelago, particularly in spices, then the region's most important product. Other colonial powers, including the [British](/wiki/British_Empire), were limited to a relatively minor presence. In 1818, Sir [Stamford Raffles](/wiki/Stamford_Raffles) was appointed as the Lieutenant Governor of the British colony at [Bencoolen](/wiki/British_Bencoolen). He was determined that Great Britain should replace the Netherlands as the dominant power in the archipelago, since the trade route between [China](/wiki/Qing_Dynasty) and [British India](/wiki/British_Raj), which had become vitally important, passed through the archipelago. The Dutch had been stifling British trade in the region by prohibiting the British from operating in Dutch-controlled ports or by subjecting them to a high tariff. Raffles hoped to challenge the Dutch by establishing a new port along the [Straits of Malacca](/wiki/Straits_of_Malacca), the main ship passageway for the India-China trade. He needed a third port since the British only had the ports of [Penang](/wiki/Penang) and Bencoolen which were not suitable, as Penang was too far off to protect British traders from pirates and Bencoolen was not along the main trading road. The port had to be strategically located along the main trade route between India and China and in the middle of the Malay Archipelago. He convinced [Lord Hastings](/wiki/Francis_Rawdon-Hastings,_1st_Marquess_of_Hastings), the [Governor-General of India](/wiki/Governor-General_of_India) and his superior at the [British East India Company](/wiki/British_East_India_Company), to fund an expedition to seek a new British base in the region. Raffles arrived in Singapore on 28 January 1819, and soon recognised the island as a natural choice for the new port. It lay at the southern tip of the Malay peninsula, near the [Straits of Malacca](/wiki/Straits_of_Malacca), and possessed a natural deep harbour, freshwater supplies, and timber for repairing ships. It was also located along the main trade route between India and China. Raffles found a small [Malay](/wiki/Malays_(ethnic_group)) [settlement](/wiki/Human_settlement) at the mouth of the [Singapore River](/wiki/Singapore_River), with an estimated population of about 150 that consisted of around 120 Malays and 30 Chinese. headed by the [Temenggong](/wiki/Temenggung) and Tengku Abdul Rahman. Around 100 of these Malays had originally moved to Singapore from [Johor](/wiki/Johor) in 1811 led by the [Temenggong](/wiki/Temenggung). The entire island may have a population of 1,000 including the various tribes and Orang Laut (sea gypsies). The island was nominally ruled by the [Sultan of Johor](/wiki/Sultan_of_Johor), who was controlled by the Dutch and the [Bugis](/wiki/Bugis). However, the [Sultanate](/wiki/Sultanate) was weakened by factional division and Tengku Abdul Rahman and his officials were loyal to Tengku Rahman's elder brother [Tengku Long](/wiki/Hussein_Shah_of_Johor) who was living in [exile](/wiki/Exile) in [Riau](/wiki/Riau_Islands). With the Temenggong's help, Raffles managed to smuggle Tengku Long back into Singapore. He offered to recognise Tengku Long as the rightful Sultan of Johor, given the title of Sultan Hussein and provide him with a yearly payment of $5,000 and $3,000 to the Temenggong; in return, Sultan Hussein would grant the British the right to establish a trading post on Singapore. The [Treaty of Singapore](/wiki/1819_Singapore_Treaty) was signed on 6 February 1819 and modern Singapore was born. When Raffles arrived, it was estimated that there were around 1,000 people living in the whole of the island of Singapore, mostly local groups that would become assimilated into [Malays](/wiki/Malays_in_Singapore) and a few dozen Chinese. The population increased rapidly soon after Raffles' arrival; the first census of 1824 shows that 6,505 out of the 10,683 total were Malays and Bugis. Large number of Chinese migrants also started to enter Singapore just months after it became a British settlement, by the census of 1826, there were already more Chinese than Malays excluding Bugis and Javanese. Due to continual migration from [Malaya](/wiki/Malay_Peninsula), China, India and other parts of Asia, Singapore's population had reached nearly 100,000 by 1871, with over half of them Chinese. Many early Chinese and Indian immigrants came to Singapore to work in various plantations and tin mines and they were predominantly male, and large number of them would return to their home countries after they had earned enough money. However, an increasingly significant number chose to stay permanently by the early to mid twentieth century, and their descendants would form the bulk of Singapore's population. ## 1819–1942: Colonial Singapore ### 1819–1826: Early growth Raffles returned to [Bencoolen](/wiki/Bencoolen_(city)) soon after the signing of the treaty and left Major [William Farquhar](/wiki/William_Farquhar) in charge of the new settlement, with some artillery and a small regiment of Indian soldiers. Establishing a trading port from scratch was a daunting endeavor. Farquhar's administration was fairly funded and was prohibited from collecting port duties to raise revenue as Raffles had decided that Singapore would be a [free port](/wiki/Free_port). Farquhar invited settlers to Singapore and stationed a British official on [St. John's Island](/wiki/Saint_John%27s_Island) to invite passing ships to stop in Singapore. As news of the free port spread across the archipelago, [Bugis](/wiki/Bugis), [Peranakan Chinese](/wiki/Peranakan), and [Arab](/wiki/Arab) traders flocked to the island, seeking to circumvent the Dutch trade restrictions. During the starting year of operation in 1819, $400,000 ([Spanish dollars](/wiki/Spanish_dollar)) worth of trade passed through Singapore. By 1821, the island's population had gone up to around 5,000, and the trade volume was $8 million. The population reached the 10,000 mark in 1824, and with a trade volume of $22 million, Singapore surpassed the long-established port of [Penang](/wiki/Penang). Raffles returned to Singapore in October 1822 and became critical of many of Farquhar's decisions, despite Farquhar's success in leading the settlement through its difficult early years. For instance, in order to generate much-needed revenue, Farquhar had resorted to selling licenses for gambling and the sale of opium, which Raffles saw as social evils. Shocked at the disarray of the colony as well as the tolerance of slave trade by Farquhar, Raffles set about drafting a set of new policies for the settlement, such as banning of slavery, closing of gambling dens, the prohibition of carrying of weapons, and heavy taxation to discourage what he considered to be social vices such as drunkenness and opium-smoking. He also organised Singapore into functional and ethnic subdivisions under the *[Raffles Plan of Singapore](/wiki/Raffles_Plan_of_Singapore)*. Today, remnants of this organization can still be found in the [ethnic neighbourhoods](/wiki/Culture_of_Singapore).[*citation needed*] William Farquhar was also stripped of his post to be replaced by [John Crawfurd](/wiki/John_Crawfurd), an efficient and frugal administrator, as the new governor. Farquhar later died in [Perth](/wiki/Perth,_Scotland), [Scotland](/wiki/Scotland). On 7 June 1823, [John Crawfurd](/wiki/John_Crawfurd) signed a second treaty with the Sultan and Temenggong, which extends British possession to most of the island. The Sultan and Temenggong traded most of their administrative rights of the island, including the collection of port taxes for lifelong monthly payments of $1500 and $800 respectively. This agreement brought the island under the [British Law](/wiki/United_Kingdom_law), with the provision that it would take into account Malay customs, traditions and religion. In October 1823, Raffles departed for Britain and would never return to Singapore as he died in 1826, at the age of 44. In 1824, Singapore was ceded in perpetuity to the East India Company by the Sultan. ### 1826–1867: The Straits Settlements The status of a British outpost in Singapore seemed initially in doubt as the Dutch government soon protested to Britain for violating the Netherlands' sphere of influence. But as Singapore rapidly emerged as an important trading post, Britain consolidated its claim on the island. The [Anglo-Dutch Treaty of 1824](/wiki/Anglo-Dutch_Treaty_of_1824) cemented the status of Singapore as a British possession, carving up the Malay archipelago between the two colonial powers with the area north of the Straits of Malacca, including Singapore, falling under Britain's sphere of influence. In 1826, Singapore was grouped by the British East India Company together with Penang and Malacca to form the [Straits Settlements](/wiki/Straits_Settlements), administered by the [British East India Company](/wiki/British_East_India_Company). In 1830, the Straits Settlements became a *residency*, or subdivision, of the [Bengal Presidency](/wiki/Bengal_Presidency) in [British India](/wiki/British_India). During the subsequent decades, Singapore grew to become an important port in the region. Its success was due to several reasons including the opening of the Chinese market, the advent of ocean-going [steamships](/wiki/Steamboat), the dramatic reduction in the time and cost of shipping goods to Europe after the opening of the [Suez Canal](/wiki/Suez_Canal) in 1869, and the production of rubber and tin in Malaya. The Malay Peninsula had not featured significantly in Singapore's trade until the 1840s, when the Chinese developed tin-mining in the West coast Malay States and gambier-pepper cultivation in Johor. Its status as a free port provided a crucial advantage over other colonial port cities in Batavia (now [Jakarta](/wiki/Jakarta)) and [Manila](/wiki/Manila) where tariffs were levied, and it drew many Chinese, Malay, Indian, and Arab traders operating in South-East Asia to Singapore. Steamships had to frequently bunker and therefore take the route along the South Asian coast line which also preferred Singapore over Batavia. The later opening of the [Suez Canal](/wiki/Suez_Canal) in 1869 would further boost trade in Singapore. By 1880, over 1.5 million tons of goods were passing through Singapore each year, with around 80% of the cargo transported by steamships. The main commercial activity was [entrepôt](/wiki/Entrep%C3%B4t) trade which flourished under no taxation and little restriction. Many merchant houses were set up in Singapore mainly by European trading firms, but also by Jewish, Chinese, Arab, Armenian, American and Indian merchants. There were also many Chinese middlemen who handled most of the trade between the European and Asian merchants. By 1827, the Chinese had become the largest ethnic group in Singapore and by 1845 formed more than half of its population. They consisted of [Peranakans](/wiki/Peranakan), who were descendants of early Chinese settlers, and Chinese [coolies](/wiki/Coolie) who flocked to Singapore to escape economic hardship in southern China. Their numbers were swelled by those fleeing the turmoil caused by the [First Opium War](/wiki/First_Opium_War) (1839–1842) and [Second Opium War](/wiki/Second_Opium_War) (1856–1860). Many arrived in Singapore as impoverished [indentured laborers](/wiki/Indentured_servant). The Malays were the second largest ethnic group until the 1860s and they worked as fishermen, craftsmen, or as wage earners while continued to live mostly in [kampungs](/wiki/Kampung). By 1860, the Indians had become the second-largest ethnic group. They consisted of unskilled labourers, traders, and convicts who were sent to carry out public works projects such as clearing jungles and laying out roads. There were also Indian [Sepoy](/wiki/Sepoy) troops garrisoned at Singapore by the British. Despite Singapore's growing importance, the administration governing the island was understaffed, ineffectual, and unconcerned with the welfare of the populace. Administrators were usually posted from India and were unfamiliar with local culture and languages. While the population had quadrupled from 1830 to 1867, the size of the civil service in Singapore had remained unchanged. Most people had no access to public health services and diseases such as [cholera](/wiki/Cholera) and [smallpox](/wiki/Smallpox) caused severe health problems, especially in overcrowded working-class areas. As a result of the administration's ineffectiveness and the predominantly male, transient, and uneducated nature of the population, the society was lawless and chaotic. In 1850 there were only twelve police officers in the city of nearly 60,000 people. Prostitution, gambling, and drug abuse (particularly of opium) were widespread. Chinese criminal [secret societies](/wiki/Secret_societies_in_Singapore) (analogous to modern-day [triads](/wiki/Triad_society)) were extremely powerful, and some had tens of thousands of members. Turf wars between rival societies occasionally led to hundreds of deaths and attempts to suppress them had limited success. The situation created a deep concern in the European population of the island. In 1854 the *[Singapore Free Press](/wiki/Singapore_Free_Press)* complained that Singapore was a \"small island\" full of the \"very dregs of the population of southeastern Asia\". ### 1867–1942: Straits Settlements Crown Colony As Singapore continued to grow, the deficiencies in the Straits Settlements administration became serious and Singapore's merchant community began agitating against British Indian rule. The British government agreed to establish the Straits Settlements as a separate [Crown Colony](/wiki/Crown_Colony) on 1 April 1867. This new colony was ruled by a governor under the supervision of the [Colonial Office](/wiki/Colonial_Office) in London. An [executive council](/wiki/Executive_Council_(Commonwealth_countries)) and a [legislative council](/wiki/Legislative_Council_of_the_Straits_Settlements) assisted the governor. Although members of the councils were not elected, more representatives for the local population were gradually included over the years. The colonial government embarked on several measures to address the serious social problems facing Singapore. A [Chinese Protectorate](/wiki/Chinese_Protectorate) under [Pickering](/wiki/William_A._Pickering) was established in 1877 to address the needs of the Chinese community, especially in controlling the worst abuses of the coolie trade and protecting Chinese women from forced prostitution. In 1889 Governor Sir [Cecil Clementi Smith](/wiki/Cecil_Clementi_Smith) banned secret societies, driving them underground. Nevertheless, many social problems persisted up through the post-war era, including an acute housing shortage and poor health and living standards. In 1906, the [Tongmenghui](/wiki/Tongmenghui), a revolutionary Chinese organisation dedicated to the overthrow of the [Qing Dynasty](/wiki/Qing_Dynasty) and led by [Sun Yat-sen](/wiki/Sun_Yat-sen), founded its [Nanyang](/wiki/Nanyang_(geographical_region)) branch in Singapore, which served as the organisation's headquarters in Southeast Asia. The members of the branch included Wong Hong-Kui (黃康衢), Tan Chor Lam and [Teo Eng Hock](/wiki/Teo_Eng_Hock). Chan Cho-Nam (陳楚楠, 1884–1971, originally a rubber manufacturer)[*citation needed*], Cheung Wing-Fook (張永福, originally a rubber shoe manufacturer)[*citation needed*] and Chan Po-Yin (陳步賢, 1883–1965) started *[Chong Shing Yit Pao](/wiki/Chong_Shing_Yit_Pao)*, a Chinese-language newspaper, in response to the growing influence of *The Union Times*, which was controlled by reformists. The inaugural edition of the newspaper was published on 20 August 1907. The paper folded in 1910 due to financial difficulties. Working with other Cantonese people, Chan, Cheung and Chan opened the revolution-related Kai Ming Bookstore (開明書報社, 開明 meaning open-mindedness and wisdom) in Singapore. For the revolution, Chan Po-Yin raised over 30,000 yuan for the purchase and shipment (from Singapore to China) of military equipment and for the support of the expenses of people travelling from Singapore to China for revolutionary work. The immigrant Chinese population in Singapore donated generously to Tongmenghui, which organised the 1911 [Xinhai Revolution](/wiki/Xinhai_Revolution) that led to the establishment of the [Republic of China](/wiki/Republic_of_China_(1912%E2%80%931949)). [World War I](/wiki/World_War_I) (1914–1918) did not deeply affect Singapore: the conflict did not spread to Southeast Asia. The only significant local military event during the war was a [1915 mutiny](/wiki/1915_Singapore_Mutiny) by the British Muslim Indian [sepoys](/wiki/Sepoy) garrisoned in Singapore. After hearing rumors of plans to send them to fight the [Ottoman Empire](/wiki/Ottoman_Empire), the soldiers revolted, killing their officers and several British civilians before troops arriving from Johor and Burma suppressed the unrest. After the war, British trade and influence gradually diminished and the importance of the United States and Japan grew, both located on the Pacific. The British government devoted significant resources into building a [naval base](/wiki/Singapore_Naval_Base) in Singapore, as a deterrent to the increasingly ambitious [Japanese Empire](/wiki/Empire_of_Japan). Completed in 1939 at a staggering cost of $500 million, the naval base boasted what was then the largest [dry dock](/wiki/Dry_dock) in the world, the third-largest [floating dock](/wiki/Floating_dock_(jetty)), and enough fuel tanks to support the entire British navy for six months. It was defended by heavy 15-inch naval guns and by [Royal Air Force](/wiki/Royal_Air_Force) squadrons stationed at [Tengah Air Base](/wiki/Tengah_Air_Base). [Winston Churchill](/wiki/Winston_Churchill) touted it as the \"[Gibraltar](/wiki/Gibraltar) of the East.\" Unfortunately, it was a base without a fleet. The [British Home Fleet](/wiki/British_Home_Fleet) was stationed in Europe and the plan was for it to sail quickly to Singapore when needed. However, after World War II broke out in 1939, the Fleet was fully occupied with [defending Britain](/wiki/Battle_of_Britain). Lieutenant General Sir [William George Shedden Dobbie](/wiki/William_George_Shedden_Dobbie) was appointed governor of Singapore and [General Officer Commanding](/wiki/General_Officer_Commanding) [Malaya Command](/wiki/Malaya_Command) on 8 November 1935, holding the post based in [The Istana](/wiki/Istana_(Singapore)) until shortly before the outbreak of [World War II](/wiki/World_War_II) in 1939. He was responsible for forming [The Dobbie Hypothesis on the fall of Singapore](/wiki/William_George_Shedden_Dobbie) which, had it been heeded, may have prevented the fall of Singapore during the [Second World War](/wiki/Second_World_War). People in Singapore who held German identify papers, including Jews fleeing the Nazis such as [Karl Duldig](/wiki/Karl_Duldig), [Slawa Duldig](/wiki/Slawa_Duldig), and [Eva Duldig](/wiki/Eva_Duldig), were arrested and deported from Singapore. The British colonial government classified them as \"citizens of an enemy country\". ## 1942–1945: The Battle for Singapore and Japanese occupation In December 1941, Japan [attacked Pearl Harbor](/wiki/Attack_on_Pearl_Harbor) and the east coast of Malaya, causing the [Pacific War](/wiki/Pacific_War) to begin in earnest. Both attacks occurred at the same time, but due to the international dateline, the Honolulu attack is dated 7 December while the Kota Bharu attack is dated 8 December. One of Japan's objectives was to capture Southeast Asia and secure the rich supply of natural resources to feed its military and industry needs. Singapore, the main Allied base in the region, was an obvious military target because of its flourishing trade and wealth.[*citation needed*] The British military commanders in Singapore had believed that the Japanese attack would come by sea from the south since the dense Malayan jungle in the north would serve as a natural barrier against invasion. Although they had drawn up a plan for dealing with an attack on northern Malaya, preparations were never completed. The military was confident that \"Fortress Singapore\" would withstand any Japanese attack and this confidence was further reinforced by the arrival of Force Z, a squadron of British warships dispatched to the defense of Singapore, including the battleship [HMS *Prince of Wales*](/wiki/HMS_Prince_of_Wales_(53)), and cruiser [HMS *Repulse*](/wiki/HMS_Repulse_(1916)). The squadron was to have been accompanied by a third capital ship, the aircraft carrier [HMS *Indomitable*](/wiki/HMS_Indomitable_(92)), but it ran aground en route, leaving the squadron without air cover.[*citation needed*] On 8 December 1941, Japanese forces landed at [Kota Bharu](/wiki/Kota_Bharu) in northern Malaya. Just two days after the start of [the invasion of Malaya](/wiki/Battle_of_Malaya), [*Prince of Wales* and *Repulse* were sunk](/wiki/Sinking_of_Prince_of_Wales_and_Repulse) 50 miles off the coast of [Kuantan](/wiki/Kuantan) in [Pahang](/wiki/Pahang), by a force of Japanese bombers and [torpedo bomber](/wiki/Torpedo_bomber) aircraft, in the worst British naval defeat of World War II. Allied air support did not arrive in time to protect the two capital ships. After this incident, Singapore and Malaya suffered daily air raids, including those targeting civilian structures such as hospitals or shop houses with casualties ranging from the tens to the hundreds each time. The Japanese army advanced swiftly southward through the Malay Peninsula, crushing or bypassing Allied resistance. The Allied forces did not have tanks, which they considered unsuitable in the [tropical rainforest](/wiki/Tropical_rainforest), and their infantry proved powerless against the Japanese [light tanks](/wiki/List_of_Japanese_tanks_and_armoured_vehicles_of_the_WWII_period#Light_tanks). As their resistance failed against the Japanese advance, the Allied forces were forced to retreat southwards towards Singapore. By 31 January 1942, a mere 55 days after the start of the invasion, the Japanese had conquered the entire Malay Peninsula and were poised to attack Singapore. The [causeway](/wiki/Causeway) linking Johor and Singapore was blown up by the Allied forces in an effort to stop the Japanese army. However, the Japanese managed to cross the [Straits of Johor](/wiki/Straits_of_Johor) in inflatable boats days after. Several fights by the Allied forces and volunteers of Singapore's population against the advancing Japanese, such as the [Battle of Pasir Panjang](/wiki/Battle_of_Pasir_Panjang), took place during this period. However, with most of the defenses shattered and supplies exhausted, Lieutenant-General [Arthur Percival](/wiki/Arthur_Percival) surrendered the Allied forces in Singapore to General [Tomoyuki Yamashita](/wiki/Tomoyuki_Yamashita) of the [Imperial Japanese Army](/wiki/Imperial_Japanese_Army) on [Chinese New Year](/wiki/Chinese_New_Year), 15 February 1942. About 130,000 Indian, Australian, and British troops became prisoners of war, many of whom would later be transported to [Burma](/wiki/Burma_Railway), Japan, Korea, or Manchuria for use as slave labour via prisoner transports known as \"[hell ships](/wiki/Hell_ship).\" The fall of Singapore was the largest surrender of British-led forces in history. Japanese newspapers triumphantly declared the victory as deciding the general situation of the war. Singapore, renamed **Syonan-to** (昭南島 *Shōnan-tō*, \"Bright Southern Island\" in Japanese), was occupied by the Japanese from 1942 to 1945. The Japanese army imposed harsh measures against the local population, with troops, especially the *[Kempeitai](/wiki/Kempeitai)* or Japanese [military police](/wiki/Military_police), who were particularly ruthless in dealing with the Chinese population. The most notable atrocity was the [Sook Ching massacre](/wiki/Sook_Ching_massacre) of [Chinese](/wiki/Chinese_in_Singapore) and Peranakan civilians, undertaken in retaliation against the support of the [war effort in China](/wiki/Second_Sino-Japanese_War). The Japanese screened citizens (including children) to check if they were \"[anti-Japanese](/wiki/Anti-Japanese)\". If so, the \"guilty\" citizens would be sent away in a truck to be executed. These mass executions claimed between 25,000 and 50,000 lives in Malaya and Singapore. The Japanese also launched massive purges against the Indian community, they secretly killed about 150,000 [Tamil Indians](/wiki/Indian_Singaporeans) and tens of thousands of Malayalam from Malaya, Burma, and Singapore in various places located near the [Siam Railway](/wiki/Siam_Railway). The rest of the population suffered severe hardship throughout the three and a half years of Japanese occupation. The Malay and Indians were forced to build the [\"Death Railway\"](/wiki/Burma_Railway), a railway between Thailand and [Burma](/wiki/Burma) (Myanmar). Most of them died while building the railway. First generation Eurasians in Singapore were interned at the [Sime Road Camp](/wiki/Sime_Road_Camp) while second generation Eurasians were allowed free in Singapore. Due to their abilities to speak in local dialects and English, the Japanese were interested in getting Eurasians to become informers, spies and be part of their intelligence services. [Mamoru Shinozaki](/wiki/Mamoru_Shinozaki), a Japanese official in Singapore, offered some Eurasians to relocate to [Bahau](/wiki/Bahau), [Negeri Sembilan](/wiki/Negeri_Sembilan), Malaysia. Towards the end of the war, most Eurasians were arrested and interned at the Sime Road Camp. ## 1945–1955: Post-war period After the [Japanese surrender](/wiki/Japanese_surrender) to the Allies on 15 August 1945, Singapore fell into a brief state of violence and disorder; [looting](/wiki/Looting) and revenge-killing were widespread. British troops led by Lord [Louis Mountbatten](/wiki/Louis_Mountbatten), [Supreme Allied Commander](/wiki/Supreme_Allied_Commander) for [Southeast Asia Command](/wiki/Southeast_Asia_Command), returned to Singapore to receive the formal surrender of the Japanese forces in the region from General [Itagaki Seishiro](/wiki/Itagaki_Seishiro) on behalf of General [Hisaichi Terauchi](/wiki/Hisaichi_Terauchi) on 12 September 1945, and a British Military Administration was formed to govern the island until March 1946. Much of the infrastructure had been destroyed during the war, including electricity and water supply systems, telephone services, as well as the harbor facilities at the [Port of Singapore](/wiki/Port_of_Singapore). There was also a shortage of food, leading to malnutrition, disease, and rampant crime and violence. High food prices, unemployment and workers' discontent culminated in a series of strikes in 1947 causing massive stoppages in public transport and other services. By late 1947, the economy began to recover, facilitated by a growing demand for tin and rubber around the world, but it would take several more years before the economy returned to pre-war levels. The failure of Britain to defend Singapore had destroyed its credibility as an infallible ruler in the eyes of Singaporeans. The decades after the war saw a political awakening amongst the local populace and the rise of [anti-colonial](/wiki/Anti-colonialism) and nationalist sentiments, epitomised by the slogan *[Merdeka](/wiki/Merdeka)*, or \"independence\" in the Malay language. The British, on their part, were prepared to gradually increase [self-governance](/wiki/Self-governance) for Singapore and Malaya. On 1 April 1946, the [Straits Settlements](/wiki/Straits_Settlements) was dissolved and Singapore became a separate Crown Colony with a civil administration headed by a Governor. In July 1947, separate Executive and Legislative Councils were established and the election of six members of the Legislative Council was scheduled for the following year. ### 1948–1951: First Legislative Council The [first Singaporean elections](/wiki/1948_Singapore_general_election), held in March 1948, were limited as only six of the twenty-five seats on the [Legislative Council](/wiki/Legislative_Council_of_Singapore) were to be elected. Only British subjects had the right to vote, and only 23,000 or about 10% of those eligible registered to vote. Other members of the council were chosen either by the Governor or by the chambers of commerce. Three of the elected seats were won by a newly formed [Singapore Progressive Party](/wiki/Singapore_Progressive_Party) (SPP), a conservative party whose leaders were businessmen and professionals and were disinclined to press for immediate self-rule. The other three seats were won by independents. Three months after the elections, an armed insurgency by communist groups in Malaya – the [Malayan Emergency](/wiki/Malayan_Emergency) – broke out. The British imposed tough measures to control [left-wing](/wiki/Left-wing_politics) groups in both Singapore and Malaya and introduced the controversial [Internal Security Act](/wiki/Internal_Security_Act_(Singapore)), which allowed indefinite detention without trial for persons suspected of being \"threats to security\". Since the left-wing groups were the strongest critics of the colonial system, progress on self-government was stalled for several years. ### 1951–1955: Second Legislative Council A second Legislative Council election was held in 1951 with the number of elected seats increased to nine. This election was again dominated by the SPP which won six seats. While this contributed to the formation of a distinct local [government of Singapore](/wiki/Government_of_Singapore), the colonial administration was still dominant. In 1953, with the communists in Malaya suppressed and the worst of the Emergency over, a British Commission, headed by [Sir George Rendel](/wiki/George_William_Rendel), proposed a limited form of self-government for Singapore. A new [Legislative Assembly](/wiki/Legislative_Assembly_of_Singapore) with twenty-five out of thirty-two seats chosen by popular election would replace the Legislative Council, from which a [Chief Minister](/wiki/Chief_Minister) as [head of government](/wiki/Head_of_government) and Council of Ministers as a cabinet would be picked under a [parliamentary system](/wiki/Parliamentary_system). The British would retain control over areas such as internal security and foreign affairs, as well as veto power over legislation.[*citation needed*] The election for the Legislative Assembly held on 2 April 1955 was a closely fought affair, with several new political parties joining the fray. Unlike previous elections, voters were automatically registered, expanding the electorate to around 300,000. The SPP was soundly defeated in the election, winning only four seats. The newly formed, left-leaning [Labour Front](/wiki/Labour_Front) was the biggest winner with ten seats and it formed a coalition government with the [UMNO](/wiki/United_Malays_National_Organisation)-[MCA](/wiki/Malaysian_Chinese_Association) Alliance, which won three seats. Another new party, the [People's Action Party](/wiki/People%27s_Action_Party) (PAP), won three seats.[*citation needed*] ### 1953–1954: The Fajar trial The Fajar trial was the first sedition trial in post-war Malaysia and Singapore. The Fajar was the publication of the [University Socialist Club](/wiki/University_Socialist_Club) which mainly at that time circulated in the university campus. In May 1954, the members of the Fajar editorial board were arrested for publishing an allegedly seditious article named \"Aggression in Asia\". However, after three days of the trial, Fajar members were immediately released. The English Queen's Counsel [D. N. Pritt](/wiki/Denis_Pritt) acted as the lead counsel in the case, and Lee Kuan Yew who was at that time a young lawyer assisted him as the junior counsel. The club's final victory stands out as one of the notable landmarks in the progress of decolonisation of this part of the world. ## 1955–1963: Self-government ### 1955–1959: Partial internal self-government [David Marshall](/wiki/David_Marshall_(Singaporean_politician)), leader of the Labour Front, became the first Chief Minister of Singapore. He presided over a shaky government, receiving little cooperation from both the colonial government and the other local parties. Social unrest was on the rise, and in May 1955, the [Hock Lee bus riots](/wiki/Hock_Lee_bus_riots) broke out, killing four people and seriously discrediting [Marshall's government](/wiki/Chief_ministership_of_David_Marshall). In 1956, the [Chinese middle school riots](/wiki/Chinese_middle_school_riots) broke out among students in [The Chinese High School](/wiki/The_Chinese_High_School_(Singapore)) and other schools, further increasing the tension between the local government and the Chinese students and unionists who were regarded of having communist sympathies. In April 1956, Marshall led a delegation to London to negotiate for complete self-rule in the [Merdeka Talks](/wiki/Merdeka), but the talks failed when the British were reluctant to give up control over Singapore's internal security. The British were concerned about communist influence and labour strikes which were undermining Singapore's economic stability, and felt that the local government was ineffective in handling earlier riots. Marshall resigned following the failure of the talk. The new Chief Minister, [Lim Yew Hock](/wiki/Lim_Yew_Hock), launched a crackdown on communist and leftist groups, imprisoning many trade union leaders and several pro-communist members of the PAP under the [Internal Security Act](/wiki/Internal_Security_Act_(Singapore)). The British government approved of Lim's tough stance against communist agitators, and when a new round of talks was held beginning in March 1957, they agreed to grant complete internal self-government. The State of Singapore would be created, with its own citizenship. The Legislative Assembly would be expanded to fifty-one members, entirely chosen by popular election, and the Prime Minister and cabinet would control all aspects of government except defense and foreign affairs. The governorship was replaced by a *[Yang di-Pertuan Negara](/wiki/Yang_di-Pertuan_Negara)* or [head of state](/wiki/Head_of_state). In August 1958, the State of Singapore Act was passed in the United Kingdom Parliament providing for the establishment of the State of Singapore. ### 1959–1963: Full internal self-government [Elections for the new Legislative Assembly](/wiki/1959_Singapore_general_election) were held in May 1959. The [People's Action Party](/wiki/People%27s_Action_Party) (PAP) won the polls in a landslide victory, winning forty-three of the fifty-one seats. They accomplished this by courting the Chinese-speaking majority, particularly those in the labour unions and radical student organizations. Its leader [Lee Kuan Yew](/wiki/Lee_Kuan_Yew), a young Cambridge-educated lawyer, became the first Prime Minister of Singapore. The PAP's victory was at first viewed with dismay by foreign and local business leaders because some party members were pro-communists. Many businesses promptly shifted their headquarters from Singapore to Kuala Lumpur. Despite these ill omens, the PAP government embarked on a vigorous program to address Singapore's various economic and social problems. Economic development was overseen by the new Minister of Finance [Goh Keng Swee](/wiki/Goh_Keng_Swee), whose strategy was to encourage foreign and local investment with measures ranging from tax incentives to the establishment of a large [industrial estate](/wiki/Industrial_estate) in [Jurong](/wiki/Jurong). The education system was revamped to train a skilled workforce and the English language was promoted over the Chinese language as the language of instruction. To eliminate labour unrest, existing labour unions were consolidated, sometimes forcibly, into a single umbrella organisation, called the [National Trades Union Congress](/wiki/National_Trades_Union_Congress) (NTUC) with strong oversight from the government. On the social front, an aggressive and well-funded [public housing program](/wiki/Housing_and_Development_Board) was launched to solve the long-standing housing problem. More than 25,000 high-rises, low-cost apartments were constructed during the first two years of the program. ### Campaign for merger This section **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources in this section. Unsourced material may be challenged and removed. *(September 2022)* *(Learn how and when to remove this message)* Despite their successes in governing Singapore, the PAP leaders, including Lee and Goh, believed that Singapore's future lay with Malaya. They felt that the historic and economic ties between Singapore and Malaya were too strong for them to continue as separate nations. Furthermore, Singapore lacked natural resources and faced both a declining entrepôt trade and a growing population that required jobs. It was thought that the merger would benefit the economy by creating a common market, eliminating trade tariffs, and thus supporting new industries which would solve the ongoing unemployment woes. Although the PAP leadership campaigned vigorously for a merger, the sizable pro-communist wing of the PAP was strongly opposed to the merger, fearing a loss of influence as the ruling party of Malaya, [United Malays National Organisation](/wiki/United_Malays_National_Organisation), was staunchly anti-communist and would support the non-communist faction of PAP against them. The UMNO leaders were also skeptical of the idea of a merger due to their distrust of the PAP government and concerns that the large Chinese population in Singapore would alter the racial balance on which their political power base depended. The issue came to a head in 1961 when PAP minister [Ong Eng Guan](/wiki/Ong_Eng_Guan) defected from the party and beat a PAP candidate in a subsequent by-election, a move that threatened to bring down Lee's government. Faced with the prospect of a takeover by the pro-communists, UMNO changed their minds about the merger. On 27 May, Malaya's Prime Minister, [Tunku Abdul Rahman](/wiki/Tunku_Abdul_Rahman), mooted the idea of a Federation of [Malaysia](/wiki/Malaysia), comprising existing [Federation of Malaya](/wiki/Federation_of_Malaya), Singapore, [Brunei](/wiki/Brunei) and the British Borneo territories of [North Borneo](/wiki/North_Borneo_(British_Crown_colony)) and [Sarawak](/wiki/Sarawak_(British_Crown_colony)). The UMNO leaders believed that the additional Malay population in the Borneo territories would offset Singapore's Chinese population. The British government, for its part, believed that the merger would prevent Singapore from becoming a haven for communism. Lee called for a referendum on the merger, to be held in September 1962, and initiated a vigorous campaign in advocation of their proposal of merger, possibly aided by the fact that the government had a large influence over the media. The referendum did not have an option of objecting to the idea of merger because no one had raised the issue in the Legislative Assembly before then. However, the method of merger had been debated, by the PAP, Singapore People's Alliance and the Barisian Sosialis, each with their own proposals. The referendum was called therefore, was to resolve this issue. The referendum called had three options. Option A would have Singapore join Malaysia with full autonomy. Option B would render Singapore full integrated into Malaysia without any autonomy, holding the same status as any other state in Malaysia. Option C, was to enter Malaysia \"on terms no less favourable than the Borneo territories\", noting the motive of why Malaysia proposed the Borneo territories to join as well. After the referendum was held, Option A received 70% of the votes in the referendum, with 26% of the ballots left blank as advocated by the Barisan Sosialis to protest against Option A. The other two options received less than two percent each. On 9 July 1963, the leaders of Singapore, Malaya, Sabah and Sarawak signed the [Malaysia Agreement](/wiki/Malaysia_Agreement) to establish Malaysia which was planned to come into being on 31 August. Nonetheless, on 31 August (the original Malaysia Day), Lee Kuan Yew stood in front of a crowd at the Padang in Singapore and unilaterally declared Singapore's independence. On 31 August, Singapore declared its independence from the United Kingdom, with Yusof bin Ishak as the head of state (Yang di-Pertuan Negara) and Lee Kuan Yew as prime minister. However it was postponed by Tunku Abdul Rahman to 16 September 1963, to accommodate a United Nations mission to North Borneo and Sarawak to ensure that they really wanted a merger, which was prompted by Indonesian objections to the formation of Malaysia. On 16 September 1963, coincidentally Lee's fortieth birthday, he once again stood in front of a crowd at the Padang and this time proclaimed Singapore as part of Malaysia. Pledging his loyalty to the Central Government, the Tunku and his colleagues, Lee asked for 'an honourable relationship between the states and the Central Government, a relationship between brothers, and not a relationship between masters and servants ## 1963–1965: Singapore in Malaysia\n",
  "language": "en",
  "processed_at": "2026-01-12T11:09:48.113500",
  "title": "History of Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/History_of_Singapore"
}