{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:09:49.752374"
  },
  "content": "* *This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article includes a list of references, related reading, or external links, **but its sources remain unclear because it lacks inline citations**. Please help improve this article by introducing more precise citations. *(June 2014)* *(Learn how and when to remove this message)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"History of Singapore General Hospital\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(January 2021)* *(Learn how and when to remove this message)*This article **possibly contains original research**. Please improve it by verifying the claims made and adding inline citations. Statements consisting only of original research should be removed. *(January 2021)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* **[Singapore General Hospital](/wiki/Singapore_General_Hospital) (SGH)** is Singapore's first general hospital and also its oldest and largest hospital. It is located along Outram Road, in the heart of a medical hub known as the Outram Campus (comprising several medical institutions including the [Health Promotion Board](/wiki/Health_Promotion_Board) and [Health Sciences Authority](/wiki/Health_Sciences_Authority)). The hospital's history spans nearly two centuries and can be traced back to the British colonial era of 19th century Singapore. ## 19th century: The origins of the general hospital The origins of Singapore General Hospital can be traced back to a wooded shed erected in the cantonment for British troops located near the [Singapore River](/wiki/Singapore_River) in 1821, shortly after Sir [Stamford Raffles](/wiki/Stamford_Raffles)' landing in Singapore. The urgent need for medical care among European soldiers, the seafaring population and natives prompted the building of the first General Hospital at the same site. The hospital was relocated in the following year- a second General Hospital was built in the vicinity of the European soldiers' barracks in the cantonment. It was functional until February 1827 when it collapsed due to the decay of the temporary constructional materials with which it was originally built. The hospital was subsequently rebuilt and the third General Hospital- renamed as the 'Singapore Infirmary'- was opened in 1828. By the 1830s, however, the hospital was riddled with problems such as a failing infrastructure and a shortage of staff- the medical establishment had consisted of just one assistant surgeon and physician, and a few medical subordinates. Convict labour was enlisted to resolve the lack of nursing staff. The need for better hospital facilities propelled the proposal for the building of a fourth General Hospital. Following initial opposition from authorities, construction of the fourth General Hospital finally commenced in 1843 at Pearl's Hill. The hospital was opened to patients in 1845. After a decade of service, the need for relocation surfaced yet again in 1856, following proposals to reorganise the land defence and fortifications of Singapore. Pearl's Hill had been demarcated as a military zone to be fortified. Construction of a fifth General Hospital was subsequently designated at the Kandang Kerbau district and commenced in the same year. The hospital opened in 1860 and had expanded in scope to treat female patients, unlike its predecessors. Following the introduction of gynaecological treatment in 1865, wards were set up on the basis of gender and economic standing, instead of specific lines of treatment for diseases. In 1873, a cholera outbreak, intensified by the hospital's unfavourable location on low-lying land, forced an immediate relocation of hospital premises. It was temporarily housed at Sepoy Lines. After the outbreak was contained, it was proposed that the hospital should permanently remain at Sepoy Lines on the grounds of its central location and elevated land. Subsequently, the sixth General Hospital was constructed at Sepoy Lines along Outram Road and was opened in 1882. ## Early 20th century: Official Establishment of Singapore General Hospital At the turn of the 20th century, overcrowding prompted the construction of a bigger General Hospital at the same site. This seventh General Hospital was officially named Singapore General Hospital and was opened on 29 March 1926 by Sir [Laurence Guillemard](/wiki/Laurence_Guillemard), the British [Governor of the Straits Settlements](/wiki/Governor_of_the_Straits_Settlements) at the time. It was heralded as a landmark in Singapore's medical history for igniting the systematic development of hospital services: the hospital was furnished with 800 beds and comprised three separate blocks accommodating male and female wards. More significantly, the hospital was distinguished from its predecessors by its emphasis on provision of medical care for locals (it had served mainly seafarers, the Europeans and the military in preceding decades). However, the hospital was still plagued by several constraints. Patients were still segregated on the basis of gender and economic status. Consequently, patient treatment was greatly impeded; doctors had to travel long distances to various wards scattered throughout the hospital to treat patients. Specialization of medical services was also not feasible due to the small medical establishment and high doctor-to-patient ratios. ## 1942– 1945: Impact of the Japanese occupation The hospital's premises were seized by Japanese forces on 18 February 1942. The General Hospital subsequently functioned as the Japanese military's primary surgical centre in Southeast Asia until the end of the war- the upper block was used by the Japanese army; the lower by the navy. During the [Japanese Occupation](/wiki/Japanese_occupation_of_Singapore), the hospital faced severe water shortages after its water supply was cut. Consequently, hundreds of patients and staff- both locals and expatriates- perished and were buried in a mass grave on hospital grounds. Following the Japanese surrender and liberation of Singapore in 1945, the three main blocks of the hospital- previously known as the Upper, Middle and Lower blocks- were renamed Bowyer, Stanley and Norris blocks in memory of three doctors who were intimately involved in hospital administration and perished during the Occupation. The Occupation had severely crippled both manpower and medical supplies infrastructure- the hospital faced a dire shortage of trained doctors, nurses and paramedical personnel. The hospital also faced the daunting task of treating a severely malnourished population and curbing the spread of [Malaria](/wiki/Malaria) and other diseases that had become rampant during the Occupation. ## 1946-1950s: Institution of the unit system and outpatient services The years following the Japanese Occupation saw a surge in the demand for medical treatment as a result of Singapore's rapid growth and the post-war baby boom. The hospital therefore shifted its focus to expanding its facilities and services, and rebuilding its manpower infrastructure. In 1947, the Unit System- widely practised in Europe- was formally instituted in the hospital. All medical and surgical wards were divided into units, each of which was helmed by its own specialist chief. The patients of each specialist and his staff were then grouped into adjacent wards according to ailments. Under this system, patients were no longer segregated according to gender or economic status; hence treatment efficiency was improved. By the 1950s, the prolific rise in patient load had overstretched both the manpower and facilities in the hospital. The hospital subsequently addressed this constraint by introducing a system of early patient discharge coupled with an outpatient clinic service. The establishment of outpatient clinics- each specialising in a specific discipline- facilitated the treatment of a large number of patients without having to admit them directly to the hospital. Consequently, the manpower burden was alleviated slightly as fewer doctors were required to man 24-hour watches on patients. ## 1960s: Decentralization of outpatient services and establishment of the emergency unit In the 1960s, outpatient services were decentralised to further lessen manpower and infrastructural strains on the hospital. Outpatient dispensaries were built in outlying areas of Singapore, closer to patients' homes. This helped to significantly reduce the outpatient load at the hospital, allowing it to focus instead on providing emergency care. Subsequently, casualty services were reorganised into the Emergency Unit in 1964. The unit focused on providing treatment to trauma victims, especially casualties of traffic and industrial accidents. ## 1970s: Medical specialisation By the 1970s, rapid industrialisation and social progress in Singapore had fuelled the demand for specialised medical services. In 1970, a committee appointed by the government to look into medical specialisation proposed that SGH should channel its resources into five specialist areas: neurosurgery, [cardiothoracic surgery](/wiki/Cardiothoracic_surgery), [paediatric surgery](/wiki/Paediatric_surgery), [nephrology](/wiki/Nephrology) and plastic and reconstructive surgery. In subsequent years, several departments and units were established to develop specialisation in the aforementioned areas. Following a shift towards genetic and metabolic diseases, paediatric surgery was introduced as a subspecialty in the Department of Surgery in 1972. In the same year, the Department of Plastic and Reconstructive surgery was officially opened. The department specialised in the treatment of congenital abnormalities, facial and hand injuries and burns. 1972 also saw a major reorganisation of the earlier established Emergency Unit to handle the treatment of both [trauma](/wiki/Physical_trauma) and non-trauma cases. Two years later, the Unit was transformed into the Accident and Emergency Department which subsequently provided 24-hour support for all emergency cases. The Department of Renal Medicine was also established in 1974. Its establishment made dialysis and renal transplant services accessible to the public. In 1975, a Surgical Intensive Care Unit was set up in response to the establishment of several new surgical departments. The Unit, in conjunction with the earlier established Department of Anaesthesia, provided intensive care for patients that underwent surgery. ## 1980s: Expansion of tertiary medical services The prolific growth of specialised medical treatment in the 1970s fuelled the need for an expansion of existing medical infrastructure. Consequently, the construction of a new SGH complex was commenced in the late 1970s. Built at a cost of S$180 million, the new eight-block complex housing over 1,500 hospital beds and 300 specialists was integrated into the site of its 1926 predecessor and was officially opened by the then Prime Minister [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) on 12 September 1981. The new hospital complex was designed to serve as a tertiary referral centre for specialised medical services at the national level. In addition, it also facilitated the introduction of several tertiary medical services. Ambulatory services for outpatient care were established to reduce reliance on infrastructure such as hospital beds, thereby cutting costs for both SGH and its patients. The new complex was also equipped with sophisticated laboratory facilities to accommodate clinical research. In 1981, the Department of Cardiology and Cardiovascular Surgery which had been transferred to [Tan Tock Seng Hospital](/wiki/Tan_Tock_Seng_Hospital) was re-established in the new SGH complex. In the same year, paediatric surgery was designated as a separate department. The department introduced its first paediatric bone marrow transplant in 1983. Bolstered by advances in reconstructive microsurgery, the Department of Hand Surgery was instituted in 1985 to provide specialised treatment for hand injuries. Two additional departments- Obstetrics and Gynaecology and Neonatology- were introduced in 1986. The former galvanised an [in-vitro fertilisation](/wiki/In-vitro_fertilisation) programme while the latter provided intensive care for the newborn. ## 1990s: Restructuring and the introduction of new clinical services and research infrastructure Amid the rapid growth of medical facilities at SGH in the 1970s and 1980s, it was necessary for the hospital to ensure that its services remained affordable to the public; and at the same time maintain the long-term sustainability of its subsidies. Consequently, the hospital underwent restructuring in 1989. SGH was removed from the civil service and was corporatised as a wholly state-owned company under the Health Corporation of Singapore, a government holding company. Through restructuring, the hospital gained operational and managerial autonomy. Subsequently, the existing departments in the hospital were reorganised into three divisions- the Division of Surgery, Division of Medicine and Division of Ambulatory and Clinical Support services. To further improve patient care, hospital admission and administrative procedures were simplified; SGH was also given a physical face-life to improve its aesthetic outlook. In the same year, two new research and treatment facilities- the Centre for Assisted Reproduction and the SGH Oncology Centre- were inaugurated. In 1991, the Department of Clinical Research was opened to cultivate emerging Life Sciences research. Additionally, the Department of Oncology was established, and three new digital cardiac laboratories were built to support cardiological research. Between 1992 and 1995, four new medical centres were incorporated into SGH, namely: the Urology, Endoscopy and Diabetes centres, and the Singapore Heart Centre. In 1993, a new Department of Neurology was established. Subsequently, SGH became the first Asian hospital to successfully use virtual reality surgery to remove brain tumours. 1994 was also a milestone for SGH: it pioneered the establishment of a local Postgraduate Medical Institute (PGMI) that year. The PGMI serves as a central co-ordinating body providing clinical training and research education opportunities. Through the PGMI, SGH has also forged ties with premier medical institutions around the world, including Stanford University Hospital in the US and the [Royal Melbourne Hospital](/wiki/Royal_Melbourne_Hospital) in Australia. In February 1997, the Alice Lee Institute of Advanced Nursing was established to provide training opportunities in nursing education and management for SGH nurses. By the end of the decade, two additional centres - the Centre for Obstetrics and Gynaecology and the Haematology Centre- were established to provide specialised clinical services and treatment for patients. ## 2000– Present: Current developments In early 2000, a major reorganisation of the public healthcare sector initiated by the government placed SGH under the management of [Singapore Health Services](/wiki/SingHealth) (SingHealth). Through these managerial changes, SGH gained access to better infrastructural and professional support. The dawn of the new millennium also saw the advancement of medical procedures in SGH. In 2000, SGH carried out its first lung transplant together with personnel from the [National Heart Centre Singapore](/wiki/National_Heart_Centre_Singapore) and [National Cancer Centre Singapore](/wiki/National_Cancer_Centre_Singapore). The first minimally invasive surgical procedure for backache relief was also successfully performed in the same year. 2001 was a significant milestone for SGH: the hospital successfully separated a pair of cranially [conjoined twins](/wiki/Conjoined_twins) from Nepal in a historic 97-hour-long surgery. In 2002, SGH pioneered a modified jaw advancement technique for the treatment of obstructive [sleep apnoea](/wiki/Sleep_apnoea) in Asians. In the same year, the Postgraduate Allied Health Institute- the second such postgraduate institution in SGH- was established to provide postgraduate study and advanced clinical skills training opportunities for healthcare professionals. Two new departments- the Department of Behavioural Medicine and Department of Rheumatology & Immunology- were established the following year. SGH also commenced a liver dialysis programme in 2003 for patients with acute liver failure. Singapore was afflicted by the [severe acute respiratory syndrome](/wiki/Severe_acute_respiratory_syndrome) (SARS) in March 2003. SGH, together with Tan Tock Seng Hospital, was instrumental in curbing the epidemic. Apart from establishing a SARS Taskforce to contain hospital-wide infection, the hospital also mobilised its Department of Internal Medicine as well as several laboratories in its Virology Section and Pathology Department to actively diagnose the SARS virus. 2005 saw the opening of the SGH museum in the Bowyer block by President S R Nathan. The museum serves as a repository of hospital photos and documents preserved from the late 19th and 20th centuries. It also traces the evolution of medical equipment in SGH through its exhibits of various medical equipment and instruments from different segments of the hospital's history. In 2007, construction of the Duke-NUS Graduate Medical School commenced in Outram. The campus is slated to open in 2009. Once functional, the school will integrate/ incorporate SGH's medical facilities into its postgraduate programmes to train physician-scientists to support Singapore's thrusts into the biomedical industry. By 2007, the hospital was also involved in several research initiatives including stem cell therapy, regenerative medicine, and neurological medicine. ## Proposed future development It is envisioned that SGH will form the nucleus of a proposed Medical Park development in the Outram region. The park is aimed at promoting Singapore as a regional medical hub. SGH will provide the core tertiary medical services and will synergise with other institutions slated for development in the Medical Park in the areas of clinical research and training. The master plan for SGH includes a proposed new Pathology Building. A new Postgraduate Medical Institute is also slated to be built to reflect SGH's greater overall emphasis on teaching. The current referral centres in SGH are also slated for future development to meet the needs of changing disease trends of the future.[*citation needed*] ## Notes - Ho, Lai Y (Ed) (2006). \"Envisioning a Destiny: Celebrating A New Era of Medical Excellence\", Singapore: Singapore General Hospital. - Kwa, Soon B., B. Y. Lau, V. T. Joseph, L. P. Low, P. C. Teoh, J. A. Tambyah, Bernard Soo and Frederick Ong (Eds) (1976). \"Singapore General Hospital 1926– 1976\", Singapore: pro-ads Ltd. - Lee, Yong K (1978). \"Medical History of Early Singapore\", Tokyo: Southeast Asian Medical Information Center. - Lim, Lawrence, N. Balachandran, C. L. Tan, S. K. Tan, C. H. Lim, L. G. Tan, S. K. Koh, Angela Ng and Kate Hia (Eds) (1996). \"The First General Hospital\", Singapore: Singapore General Hospital. - Singapore General Hospital Archived 15 December 2018 at the [Wayback Machine](/wiki/Wayback_Machine)- Official Website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:09:49.751918",
  "title": "History of Singapore General Hospital",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/History_of_Singapore_General_Hospital"
}