{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:09:55.784104"
  },
  "content": "* *This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"History of the Republic of Singapore\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(August 2020)* *(Learn how and when to remove this message)*This article **is written like a personal reflection, personal essay, or argumentative essay** that states a Wikipedia editor's personal feelings or presents an original argument about a topic. Please help improve it by rewriting it in an encyclopedic style. *(September 2018)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)*Part of a series on the[History of Singapore](/wiki/History_of_Singapore)[Early history](/wiki/Early_history_of_Singapore) (pre-1819)[Srivijaya](/wiki/Srivijaya)650–1377[Temasek](/wiki/Temasek), [Long Ya Men](/wiki/Long_Ya_Men), [Ban Zu](/wiki/Ban_Zu)c.14th century[Kingdom of Singapura](/wiki/Kingdom_of_Singapura)1299–1398[Majapahit](/wiki/Majapahit)1398–1400[Malacca Sultanate](/wiki/Malacca_Sultanate)1400–1528[Johor Sultanate](/wiki/Johor_Sultanate)1528–1819British colonial era (1819–1942)[Founding](/wiki/Founding_years_of_modern_Singapore)1819–1826[Straits Settlements](/wiki/Singapore_in_the_Straits_Settlements)1826–1867[Crown colony](/wiki/Singapore_in_the_Straits_Settlements#Crown_colony_(1867–1942))1867–1942[Japanese Occupation](/wiki/Japanese_occupation_of_Singapore) (1942–1945)[Fall of Singapore](/wiki/Fall_of_Singapore)1942[Sook Ching](/wiki/Sook_Ching)1942[Double Tenth incident](/wiki/Double_Tenth_incident)1943[Post-war period](/wiki/Colony_of_Singapore) (1945–1962)[First Legislative Council](/wiki/History_of_Singapore#First_Legislative_Council_(1948–1951))1948–1951[Maria Hertogh riots](/wiki/Maria_Hertogh_riots)1950[Second Legislative Council](/wiki/History_of_Singapore#Second_Legislative_Council_(1951–1955))1951–1955[Anti-National Service Riots](/wiki/1954_National_Service_riots)1954[Internal self-government](/wiki/Self-governance_of_Singapore) (1955–1963)[Hock Lee bus riots](/wiki/Hock_Lee_bus_riots)1955[Singapore Glass Factory strikes](/wiki/Singapore_Glass_Factory_strikes)1960[Pulau Senang prison riots](/wiki/Pulau_Senang_prison_riots)1963[Merger with Malaysia](/wiki/History_of_the_State_of_Singapore_(Malaysia)) (1963–1965)[Singaporean referendum](/wiki/1962_Singaporean_integration_referendum)1962[Operation Coldstore](/wiki/Operation_Coldstore)1963[Race riots in Singapore](/wiki/1964_race_riots_in_Singapore)1964[MacDonald House bombing](/wiki/MacDonald_House_bombing)1965Republic of Singapore (1965–present)[ASEAN Declaration](/wiki/ASEAN_Declaration) ([ASEAN](/wiki/Association_of_Southeast_Asian_Nations))1967[1969 race riots of Singapore](/wiki/1969_race_riots_of_Singapore)1969[Laju incident](/wiki/Laju_incident)1974[Operation Spectrum](/wiki/Operation_Spectrum)1987[Asian financial crisis](/wiki/1997_Asian_financial_crisis#Singapore)1997[Embassies attack plot](/wiki/Singapore_embassies_attack_plot)2001[H1N1 pandemic](/wiki/2009_swine_flu_pandemic_in_Asia#Singapore)2009–2010[Bus drivers' strike](/wiki/2012_Singapore_bus_drivers%27_strike)2012[Little India riot](/wiki/2013_Little_India_riot)2013[2018 North Korea–United States Singapore Summit](/wiki/2018_North_Korea%E2%80%93United_States_Singapore_Summit)2018[COVID-19 pandemic](/wiki/COVID-19_pandemic_in_Singapore)2020–2022By topic - [Timeline](/wiki/Timeline_of_Singaporean_history) - [Riots](/wiki/List_of_riots_in_Singapore) - [Military](/wiki/Military_history_of_Singapore) Singapore portal - v - t - e The **history of the Republic of Singapore** began when [Singapore](/wiki/Singapore) was expelled from [Malaysia](/wiki/Malaysia) and became an [independent](/wiki/Sovereign) [republic](/wiki/Republic) on 9 August 1965. After the separation, the fledgling nation had to become self-sufficient, but was faced with problems including mass [unemployment](/wiki/Unemployment), housing shortages, and a lack of land and natural resources, such as [petroleum](/wiki/Petroleum). During [Lee Kuan Yew](/wiki/Lee_Kuan_Yew)'s term as prime minister from 1959 to 1990, his government curbed unemployment, raised the [standard of living](/wiki/Standard_of_living) and implemented a large-scale public housing programme. The country's [economic](/wiki/Economic) infrastructure was developed, racial tension was eliminated and an independent national defence system was established. Singapore evolved from a [third world nation](/wiki/Least_developed_country) to [first world nation](/wiki/Developed_country) towards the end of the 20th century. In 1990, [Goh Chok Tong](/wiki/Goh_Chok_Tong) succeeded Lee as prime minister. During his tenure, the country tackled the economic impacts of the [1997 Asian financial crisis](/wiki/1997_Asian_financial_crisis) and the 2003 [SARS](/wiki/Severe_acute_respiratory_syndrome) outbreak, as well as [terrorist threats](/wiki/War_on_Terrorism) posed by the [Jemaah Islamiah](/wiki/Jemaah_Islamiyah) (JI) [post-9/11](/wiki/September_11_attacks) and the [Bali bombings](/wiki/2002_Bali_bombings). In 2004, [Lee Hsien Loong](/wiki/Lee_Hsien_Loong), the eldest son of Lee Kuan Yew, became the third prime minister. In 2024, Lee was succeeded by [Lawrence Wong](/wiki/Lawrence_Wong) as prime minister. ## Independence from Malaysia Singapore became part of Malaysia on 16 September 1963 following a merger with [Malaya](/wiki/Federation_of_Malaya), [North Borneo](/wiki/Crown_Colony_of_North_Borneo), and [Sarawak](/wiki/Crown_Colony_of_Sarawak). The merger was thought to benefit the economy by creating a common, free market, and to improve Singapore's internal security. However, it was an uneasy union. Disputes between the state government of Singapore and the federal government occurred on different issues, especially the federal policies of [affirmative action](/wiki/Affirmative_action), which granted special privileges to the Malays guaranteed under [Article 153 of the Constitution of Malaysia](/wiki/Article_153_of_the_Constitution_of_Malaysia). Singapore Prime Minister [Lee Kuan Yew](/wiki/Lee_Kuan_Yew), and other political leaders began advocating for equal treatment of all races in Malaysia, with a rallying cry of *\"[Malaysian Malaysia](/wiki/Malaysian_Malaysia)!\"* Racial tensions between the Chinese and Malays increased dramatically, resulting in numerous racial riots. The most notorious riots were the [1964 race riots](/wiki/1964_race_riots) that first took place on the [Mawlid](/wiki/Mawlid) on 21 July with 23 people killed and hundreds injured. The price of food increased greatly when the transport system was disrupted during the unrest, causing further hardship for the people. The state and federal governments also had conflicts on the economic front. [UMNO](/wiki/UMNO) leaders feared that the economic dominance of Singapore would inevitably shift political power away from [Kuala Lumpur](/wiki/Kuala_Lumpur). Despite an earlier agreement to establish a common market, Singapore continued to face restrictions when trading with the rest of Malaysia. In retaliation, Singapore refused to provide Sabah and Sarawak the full extent of the loans previously agreed to for economic development of the two eastern states. The situation escalated to such intensity that talks soon broke down and abusive speeches and writings became rife on both sides. UMNO extremists called for the [arrest](/wiki/Arrest) of [Lee Kuan Yew](/wiki/Lee_Kuan_Yew). Seeing no alternative to avoid further bloodshed, Malaysian Prime Minister [Tunku Abdul Rahman](/wiki/Tunku_Abdul_Rahman) decided to expel Singapore from the federation. The Parliament of Malaysia voted 126-0, with all Singaporean MPs boycotting the vote, in favour of the expulsion on 9 August 1965. On that day, a tearful Lee Kuan Yew announced on a televised press conference that Singapore was a sovereign, independent nation. In a widely remembered quote, he uttered that: *\"For me, it would be a moment of anguish. I mean for me, it is a moment of anguish because all my life... you see the whole of my adult life.. I have believed in merger and the unity of these two territories. You know it's a people connected by geography, economics, and ties of kinship...\"* The new state became the Republic of Singapore. ## 1965 to late 1970s After gaining independence abruptly, Singapore sensed the need for immediate international recognition of its sovereignty. In this period, there were regional conflicts as well as international tensions. The [Konfrontasi](/wiki/Konfrontasi) was ongoing and some UMNO factions strongly opposed the separation; Singapore faced the danger of being attacked by Indonesian military or forcibly reabsorbed into Malaysia on disadvantageous terms. With the help of the Malaysian, [Republic of China](/wiki/Republic_of_China), and Indian governments, Singapore became a member of the [United Nations](/wiki/United_Nations) on 21 September 1965, and the [Commonwealth](/wiki/Commonwealth_of_Nations) in October that year. A new foreign ministry was established and was headed by [Sinnathamby Rajaratnam](/wiki/Sinnathamby_Rajaratnam) who helped to assert Singapore's independence and established diplomatic relations with other countries. The participation in international organisations also helped to boost trade through cooperation. Singapore later co-founded the [ASEAN](/wiki/ASEAN) on 8 August 1967, joined the [Non-Aligned Movement](/wiki/Non-Aligned_Movement) in 1970, and later the [World Trade Organization](/wiki/World_Trade_Organization). In 1971, the Five Power Defence Arrangements (FPDA) between Singapore, Australia, Malaysia, New Zealand and Britain was established. As a tiny island, Singapore was seen as a nonviable nation state; much of the international [media](/wiki/Mass_media) was sceptical of prospects for Singapore's survival. Besides the issue of sovereignty, the pressing problems were unemployment, housing, education, lack of [natural resources](/wiki/Natural_resource) and lack of [land](/wiki/Landform). Singapore also faced the threat of terrorism. By the 1970s, the Malayan Communist Party had split into smaller groups. While no longer a formidable, unified force, the communists still posed a danger to the internal security of Singapore. Police raids against these groups uncovered large quantities of weapons such as pistols and grenades. During this decade, the communists carried out acts of violence that included the killing of a 7-year-old girl in Changi in 1970. There was also an explosion of a bomb in Katong in 1974, as well as the attempted assassination of Singapore's Commissioner of Police in 1976. Independent Singapore experienced its first encounter with international terrorism on 31 January 1974 when foreign terrorists hijacked the ferry boat Laju and held crew members hostage. The terrorists had earlier attacked the oil refinery on Pulau Bukom in an attempt to disrupt the oil supply from Singapore to South Vietnam. After days of negotiation, the hijackers finally agreed to release the hostages in exchange for safe passage from Singapore to Kuwait. To ensure safe passage of hijackers of the Laju from Singapore to Kuwait, a group of Singapore government officials, led by [S.R. Nathan](/wiki/S._R._Nathan), accompanied by the hijackers on their flight. Nathan was then Director of the Security and Intelligence Division at the Ministry of Defense, and would later go on to serve as the President of Singapore. The Singapore team comprised Nathan, eight government officials and four Singapore Armed Forces commandos. On 9 February 1974, the 13 Singaporean officials returned to Singapore from Kuwait. The [unemployment rate](/wiki/Unemployment_rate) ranged between 10 and 12% and it threatened to create civil unrest. The loss of access to the Malaysian [hinterland](/wiki/Hinterland) market and the lack of [natural resources](/wiki/Natural_resource) meant that Singapore had no solid traditional sources of [income](/wiki/Measures_of_national_income_and_output). A large portion of the population lacked formal education, even taking into account Chinese schools, which the British did not recognise. [Entrepot](/wiki/Entrepot) trade, the main use of Singapore's port and the original reason for Singapore's success in the 19th century, was no longer sufficient to support the large population. ### Economic focus Singapore invested heavily to promote economic growth. The [Economic Development Board](/wiki/Economic_Development_Board) was set up in 1961 by [Goh Keng Swee](/wiki/Goh_Keng_Swee), and with the assistance of Dutch economic advisor [Albert Winsemius](/wiki/Albert_Winsemius), national economic strategies were formulated to promote Singapore's manufacturing sector. [Industrial estates](/wiki/Industrial_estate) were set up, especially in the reclaimed swampland of [Jurong](/wiki/Jurong), and government ministers toured the world in order to try to attract foreign [investment](/wiki/Investment). The government offered new investors [tax holidays](/wiki/Tax_holiday) of 5–10 years. Singapore's port gave her an advantage over her neighbouring countries, being a favourable spot for efficient exports of refined goods and imports of raw materials. This meant that industries in Singapore found international markets easily, and cheaper prices for raw goods. Singapore's growing [industrialisation](/wiki/Industrialization) meant that entrepot trade had been extended into processing of imported raw materials into exported finished products—leading to higher value-added goods which brought more income to the island. This ended up being a suitable alternative to a common market to the Malaysian hinterland, although later a form of it ended up being formed with the creation of [ASEAN](/wiki/ASEAN). The [service industry](/wiki/Service_industry) also grew at this time, sparked by demand for services by ships calling at the port and increasing commerce. This progress helped to alleviate the unemployment problem. With Winsemius's help, Singapore attracted big oil companies like [Shell](/wiki/Royal_Dutch_Shell) and [Esso](/wiki/Esso) to establish [oil refineries](/wiki/Oil_refineries) in Singapore which became the third largest oil-refining centre in the world by the mid-1970s. The new direction that Singapore took demanded a skilled labour force to engage in her revised role of refining raw goods, as opposed to the traditional natural resource extraction industries of her neighbours. Its leaders decided early on that the population would need to be fluent in the English language, as they would be communicating and cooperating with [expatriate](/wiki/Expatriate) employers or business partners abroad, and English was adopted as the medium of education for all schools. The education system was designed to be rigorous and intensive, with emphasis on immediately [practical](/wiki/Pragmatism), rather than [intellectual](/wiki/Intellectual), applications, such as on technical sciences as opposed to [political discussion](/wiki/Political_science) or [philosophy](/wiki/Philosophy). A large portion, around one-fifth of Singapore's budget, was devoted to education to facilitate a large and competent workforce upon graduation. The government of Singapore currently maintains it at this level. ### New housing There was a lack of good housing and a proliferation of [squatter](/wiki/Squatter) settlements. Combined with the high unemployment rate, this led to social problems from crime, a low standard of living, and unrest. The other deleterious effect of squatter settlements was that many of these were built of highly [flammable materials](/wiki/Flammability), were poorly constructed and thus posed a high fire risk. A prominent example in this case is the [Bukit Ho Swee Squatter Fire](/wiki/Bukit_Ho_Swee_Fire) that broke out in 1961. In addition, there was poor [sanitation](/wiki/Sanitation), which led to the spread of [infectious diseases](/wiki/Infectious_disease). The [Housing Development Board](/wiki/Housing_Development_Board) set up before independence continued to be largely successful under [Lim Kim San](/wiki/Lim_Kim_San). Huge building projects sprang up to provide cheap, affordable public housing to resettle the squatters, hence removing a serious social problem. 25,000 apartments were built in the first two years. It was remarkable that, within a decade, the majority of the population had been housed in HDB apartments. Possible explanations for the otherwise seemingly impossible success was the determination of the government, the large budget allocations, and efforts to eliminate [red tape](/wiki/Red_tape) and corruption. In 1968, the [Central Provident Fund](/wiki/Central_Provident_Fund) (CPF) Housing Scheme was introduced to allow residents to use their CPF savings to purchase HDB flats, which gradually increased home ownership in Singapore. Another problem facing Singapore was the lack of national identity and unity among most of the population. Many people were born in foreign lands and still identified themselves in terms of countries of origin, rather than being Singaporeans. This posed the potential for problems with the loyalty and reliability of citizens, and for the possibility of further racial riots. In order to resolve racial tension, a policy to create national identity through education in schools and flag raising and lowering ceremonies was implemented. This was re-emphasized through the curriculum of \"[National Education](/wiki/National_Education)\", a compulsory program of which the main goal was to inculcate students with a sense of \"national fraternity\". The [Singapore National Pledge](/wiki/Singapore_National_Pledge), written by [Sinnathamby Rajaratnam](/wiki/Sinnathamby_Rajaratnam), was introduced in 1966 emphasizing unity among the people \"regardless of race, language or religion.\" The [system of justice and law in Singapore](/wiki/Laws_of_Singapore) was reformed, and the government implemented several measures to overcome labour unrest and disputes. Strict labour legislation was passed that provided better protection to workers, but still allowed for greater productivity by permitting longer working hours and reducing holidays. The labour movement was further consolidated under the [National Trades Union Congress](/wiki/National_Trades_Union_Congress) with close oversight by the government. By the end of the 1960s, the number of labour strikes was significantly reduced. Singapore took the step of [nationalising](/wiki/Nationalization) companies that would not survive on their own, or could otherwise be detrimental for Singapore if, as [public services](/wiki/Public_services), they were not closely in line with government policy. [Singapore Power](/wiki/Singapore_Power), [Public Utilities Board](/wiki/Public_Utilities_Board), [SingTel](/wiki/SingTel) and [Singapore Airlines](/wiki/Singapore_Airlines) (SIA) are prominent examples. Such companies that were nationalised were often infrastructure or utility concerns, companies meant to lay out services such as electricity or transport for the benefit of other companies. The extension of power infrastructure, for example, led to an increased attraction of foreign investors. Recently[*when?*], the government has taken steps to privatise these previous monopolies—SingTel and Singapore Airlines are now publicly listed, limited liability companies, even though the government still holds large shares in them. ### Independent defence force Another major issue brought up around this time was national [defence](/wiki/Defense_(military)). Following independence, the British were still responsible for defending Singapore, but had announced they would be withdrawing by 1971, due to pressures at home and military commitments elsewhere in the world. This caused considerable alarm locally, particularly among those who remembered the [Japanese occupation](/wiki/Japanese_occupation_of_Singapore) during [World War II](/wiki/World_War_II). Therefore, Singapore introduced National Service in 1967, which rapidly expanded the defence force, known as the Singapore Armed Forces (SAF). Thousands of men were conscripted for at least two years of full National Service. Upon completing National Service, they would be liable for reservist duties, which meant they would continue to receive occasional military training and take up arms in times of emergency. In 1965, [Goh Keng Swee](/wiki/Goh_Keng_Swee) became Minister for the Interior and Defence, and initiated the formation of a national defence force, called the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces), which was to be established by the time of the British withdrawal. The British agreed to postpone the withdrawal for half a year, but no longer. In a speech to Parliament on 23 December 1965, Goh said: \"Our army is to be engaged in the defence of the country and our people against the external aggression. This task we are unable to do today by ourselves. It is no use pretending that without the British military presence in Singapore today, the island cannot be easily over-run by any neighbouring country within a radius of 1000 miles, if any of them cared to do so...\" Singapore consulted international experts from [West Germany](/wiki/West_Germany) and [Israel](/wiki/Israel) to train their armed forces and equip them. As a small country surrounded by larger neighbours, Singapore allocated a large portion of its budget, around 19%, to defence and this still continues today, having the fourth-largest [per capita](/wiki/Per_capita) military expenditure in the world, after [Israel](/wiki/Israel), the [United States](/wiki/United_States) and [Kuwait](/wiki/Kuwait). Singapore was especially interested in Israel's model of [national service](/wiki/National_service), a factor in its decisive victory in the [Six-Day War](/wiki/Six-Day_War) over its Arab neighbours in 1967. This led to the implementation of [Singapore's own national service programme](/wiki/National_service_in_Singapore) starting in 1967. All eighteen-year-old males would be required to participate in national service and train full-time for two and a half years, and then required to repeatedly come back each year to maintain their skills in order to carry out an effective [mobilisation](/wiki/Mobilization) at any time. This policy meant that Singapore could quickly mobilise enough defence forces to deter any [invasion](/wiki/Invasion), especially against Indonesia during the [Confrontation](/wiki/Indonesia-Malaysia_confrontation), when the British withdrew in September 1971. Females were left out of national service—the explanation being that, during a time of war, they would be required to support the economy while the men were fighting. This policy is sometimes questioned as being [sexist](/wiki/Sexism) and has been discussed in the [mass media](/wiki/Mass_media) a number of times along with the length of training involved. The creation of the national service policy is thought to aid the strengthening of national and racial ties, since there is a sense of unity when training as a youth with peers of other races. ## 1980s to 1990s Further economic success continued through the 1980s onwards, with the unemployment rate falling to 3% and real GDP growth averaging at about 8% during this time until 1999. In the 1980s, Singapore faced the challenge of needing to upgrade its industries to higher-technology industries, in order to compete with its neighbours which were exporting the same things at a lower price. Originally, Singapore manufactured goods such as textiles. A skilled workforce with an aptitude for learning helped ease the transition, for example, to new jobs in the [wafer fabrication](/wiki/Wafer_fabrication) industry, which was quickly being established in Singapore. [Singapore Changi Airport](/wiki/Singapore_Changi_Airport) was opened in 1981. The development of air transport meant further extension of entrepot trade as well as its intended purpose of attracting investors through a convenient way to enter and leave the country. In conjunction with Singapore Airlines, for example, the hospitality industry grew immensely, which led to growth in the [tourism](/wiki/Tourism) industry. The [Housing Development Board](/wiki/Housing_Development_Board) continued to promote public housing. New towns, such as in Ang Mo Kio, were designed and built. They have larger and higher-standard apartments and are served with better amenities. Today, 80–90% of the population lives in HDB apartments. With the justification of fostering national unity, \"racial harmony\" and loyalty, the government explicitly planned to group the different races together within the same estate, in order to integrate the races. This HDB policy became a major contribution towards the [Singaporean culture](/wiki/Culture_of_Singapore). Singapore also had to upgrade its military, for instance upgrading the standard infantry weapon of its army. Formerly it had been the [L1A1 Self-Loading Rifle](/wiki/L1A1_Self-Loading_Rifle), it was upgraded to the lighter, [United States](/wiki/United_States)-made [M16](/wiki/M16_(rifle)). A *[Total Defence](/wiki/Total_Defence_(Singapore))* policy was created in 1984 with the intent of the population being prepared to defend Singapore on five metaphorical fronts: economically, on a civil level (including hospitals), a social level, a psychological level as well as on a military level. With continuous strong economic growth, Singapore became one of the world's most prosperous countries, with strong international trading links. Its [port](/wiki/Port_of_Singapore) is one of the world's busiest and with a per capita GDP above that of the leading nations of Western Europe. The education budget remains at one fifth or more, and many of its practices, such as racial harmony, continue today. A side effect of this was increasingly common [traffic congestion](/wiki/Traffic_congestion), and the first [Mass Rapid Transit](/wiki/Mass_Rapid_Transit_(Singapore)) (MRT) line was established in 1987. It would later grow to become an epitome of a well-integrated [public transport](/wiki/Public_transport) system. This network also improved the convenience of travelling from one side of the island to the other – a benefit which did not exist in the 1960s. ### Political system The political situation in Singapore is extremely stable. The PAP had a 15-year monopoly in parliament during 1966 to 1981, winning all seats in elections before [J. B. Jeyaretnam](/wiki/J._B._Jeyaretnam) of the [Workers' Party of Singapore](/wiki/Workers%27_Party_of_Singapore) won the Anson constituency in a 1981 by-election. The PAP rule is termed [authoritarian](/wiki/Authoritarianism) by activists who see some of the regulations of political and media activities as an infringement on political rights, perceiving them as [authoritarian](/wiki/Authoritarianism). This has been the greatest complaint about the PAP by the opposition parties so far, the [Workers' Party of Singapore](/wiki/Workers%27_Party_of_Singapore) and the [Singapore Democratic Party](/wiki/Singapore_Democratic_Party) being two of the prominent opposition parties who accuse the PAP of authoritarianism. The government of Singapore underwent several significant changes. [Non-Constituency Member of Parliament](/wiki/Non-Constituency_Member_of_Parliament) was introduced in 1984 to allow up to three losing opposition parties candidates be appointed as MPs. [Group Representation Constituencies](/wiki/Group_Representation_Constituencies) (GRCs) was introduced in a 1988 amendment to the [Parliamentary Elections Act](/wiki/Parliamentary_Elections_Act) to create multi-seat electoral divisions, intended to ensure minority representation in parliament. [Nominated Member of Parliament](/wiki/Nominated_Member_of_Parliament) was introduced in 1990 to allow non-elected non-partisan MPs. The [Constitution](/wiki/Constitution_of_Singapore) was amended in 1991 to provide for an [Elected President](/wiki/President_of_Singapore) who has veto power in the use of national reserves and appointments to public office. The opposition parties have complained that the GRC system has made it difficult for them to gain a foothold in [parliamentary elections in Singapore](/wiki/Parliamentary_elections_in_Singapore), and the [plurality voting system](/wiki/Plurality_voting_system) in the [constituencies of Singapore](/wiki/Constituencies_of_Singapore), especially large group representation constituencies, tends to exclude minority parties. The system has been defended by the PAP because the system encourages representation of the minority *races* by requiring a minority candidate in group representation constituencies. This however increases the difficulty of the opposition parties being able to gain a seat. Until the [general election in 2006](/wiki/2006_Singapore_general_election), the PAP had always managed to return to power on nomination day, even before the elections commenced since the amendment to the Parliamentary Elections Act. The opposition accuses that the group representation constituency is an intentional hindrance, as between 1991 and 2001 did not manage to put forward enough qualified candidates to even contest the PAP's mandate. The arrest of [Chee Soon Juan](/wiki/Chee_Soon_Juan), and the lawsuits of slander against [J. B. Jeyaretnam](/wiki/Joshua_Benjamin_Jeyaretnam), both opposition MPs, have been cited by the opposition parties as examples of such authoritarianism. They also have been charged on the grounds of [slander](/wiki/Libel_and_slander) for political criticism. The lack of [separation of powers](/wiki/Separation_of_powers_in_Singapore) between the court system and the government led to further accusations by the opposition parties of [miscarriage of justice](/wiki/Miscarriage_of_justice). Further arrests of those who were politically active against the PAP, such as [Francis Seow](/wiki/Francis_Seow), and even students who have recently entered [tertiary education](/wiki/Tertiary_education) are part of these accusations of authoritarianism. In 1990, [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) passed the reins to successor [Goh Chok Tong](/wiki/Goh_Chok_Tong), who presented a more open and consultative style of leadership as the country continued to modernise. In 1997, Singapore experienced the effect of the [Asian financial crisis](/wiki/Asian_financial_crisis) and tough measures, such as cuts in the CPF contribution were implemented. ## 2000 to present Singapore went through some of its most serious postwar crises, including the [SARS](/wiki/SARS) outbreak in 2003, the [COVID-19 pandemic](/wiki/COVID-19_pandemic) and the threat of [terrorism](/wiki/Terrorism). In December 2001, a [plot to bomb embassies](/wiki/Singapore_embassies_attack_plot) and other infrastructure in Singapore was uncovered and 15 members of the [Jemaah Islamiyah](/wiki/Jemaah_Islamiyah) were arrested under the [Internal Security Act](/wiki/Internal_Security_Act_(Singapore)). [Major counter-terrorism measures](/wiki/Counter-terrorism_in_Singapore) were put in place to detect and prevent potential terrorism acts and to minimize damages should they occur. Meanwhile, the economy was affected marginally during the crisis, and in 2003, the average monthly household income was [SGD](/wiki/Singapore_Dollar)$4,870. In 2004, [Lee Hsien Loong](/wiki/Lee_Hsien_Loong), the eldest son of Lee Kuan Yew, became the third prime minister of Singapore. A number of national policy changes have been proposed and carried out since then. One of these changes was the reduction of National Service training requirements from two and a half years to two during 2005. The government also introduced a \"Cutting Red Tape\" program, which allows citizens to share their views on law, punishment, social and world issues. The [general election of 2006](/wiki/2006_Singapore_general_election) has been considered by analysts to be a landmark election in the history of Singapore, because of the heavy use of the [internet](/wiki/Internet) and [blogging](/wiki/Blog) that covered the election, which escaped government regulation. Just before the election, on 1 May 2006, the government issued a cash bonus, called the \"progress package\" to all adult citizens, worth [SGD](/wiki/Singapore_Dollar) $2.6 billion. The PAP returned to power in the election winning 82 out of 84 seats, and 66% of the votes. During the election campaign period, there were large turnouts at many opposition rallies, with Malaysian newspaper *[The Star](/wiki/The_Star_(Malaysia))* estimating that over ten thousand people attended one rally held on 30 April 2006. Singapore's bilateral post-independence relationship with Malaysia is complex and rocky at times. Despite their differences, Malaysia remains an important, albeit partial, economic hinterland and a regional ally, especially due to both their memberships in ASEAN. This importance becomes especially apparent when considering that much of Singapore's water supply comes from Malaysia. Both countries have been known to chide or even issue threats to the other due to differences in paths taken after independence, but fortunately this has never become serious enough to develop into [embargo](/wiki/Embargo) or hostility. There are increasing reforms in the education system. [Primary education](/wiki/Primary_education) was made [compulsory](/wiki/Compulsory_education) in 2003. This style of educational policy was still extremely competitive, and favoured those that did well initially at the expense of ignoring struggling students, in the process of [streaming](/wiki/Streaming_(education)). This remains a controversial issue even today. It was theme for the successful local film *[I Not Stupid](/wiki/I_Not_Stupid)* which also addresses the culture of competition induced by the post-independence education policy. Although the education policy has evolved over the years to address such concerns, the streaming issue is still prominent. The [2013 Population White Paper](/wiki/Demographics_of_Singapore#Population_white_paper) was officially released by the government proposing a future national population of 6.9 million due to growing concerns of rising life expectancy, declining birth rates and ageing population foreseen in Singapore in 2030. This came after the formal launch of two [integrated resorts](/wiki/Integrated_resort), which also became the most profitable in the world in the same year.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:09:55.783614",
  "title": "History of the Republic of Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/History_of_the_Republic_of_Singapore"
}