{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:09:59.752935"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Hitachi small-type monorail\" Sentosa Express – news **·** newspapers **·** books **·** scholar **·** JSTOR *(November 2021)* *(Learn how and when to remove this message)* The **Hitachi small-type monorail** is a [straddle-type monorail](/wiki/Monorail) built by [Hitachi Rail](/wiki/Hitachi#Hitachi_Rail) for the use on the [Sentosa Express](/wiki/Sentosa_Express). These trains are part of [Hitachi Monorail](/wiki/Hitachi_Monorail) line of [ALWEG](/wiki/ALWEG)-based monorail. The trains were part of a project to replace Sentosa's previous aging monorail system. The trains are fully [air-conditioned](/wiki/Air-conditioning). ## Design Each train set has its own exterior colour scheme – green, orange, blue, purple, pink, yellow and red. All trains are for passenger service, except for the maintenance train. The interior of the trains consist of colours green and orange. These cars have [foldable seats](/wiki/Folding_seat) that can make room for more standing space during periods of high usage. Passenger Information Display Systems in the form of [LED Displays](/wiki/Light-emitting_diode) are installed above each door in all passenger service trains to supply route information. Each car has two wheelchair bays. ## Operations and safety systems Trains and platform screen doors were previously manually operated by train attendants; the trains utilised digital [automatic train protection](/wiki/Automatic_train_protection) (ATP) to ensure trains keep a safe distance between each other and automatic train supervision (ATS) to provide the route setting for the train to travel. With the upgrading to the wireless [communications-based train control](/wiki/Communications-based_train_control) (CBTC) system in 2017, trains and platform screen doors are now operated automatically. Trains cruise at 15 to 50 km/h (9.3 to 31.1 mph) but is designed to speed up to 80 km/h (50 mph). ## Refurbishment and upgrades The Vacuum Fluorescent Display (VFD) has been changed to a newer updated [LED Displays](/wiki/Light-emitting_diode) with route information. A signalling system upgrade was also upgraded to Communications-Based Train Control (CBTC). With the change in Signalling System, it allowed more trains to run on the network. - [Hitachi Monorail](/wiki/Hitachi_Monorail) - [Sentosa](/wiki/Sentosa) island - [Rail transport in Singapore](/wiki/Rail_transport_in_Singapore) - [Sentosa Monorail](/wiki/Sentosa_Monorail) – a dismantled monorail system that used to ferry visitors around Sentosa from 1982 to 2005 - Hitachi wins contract to develop \"SENTOSA EXPRESS\" for Sentosa Development Corporation — (press release) - Monorail Society: Sentosa Express Construction Gallery - Fact sheet for Sentosa Express\n",
  "language": "en",
  "processed_at": "2026-01-12T11:09:59.752473",
  "title": "Hitachi small-type monorail (Sentosa Express)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Hitachi_small-type_monorail_(Sentosa_Express)"
}