{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:10:01.922642"
  },
  "content": "Singaporean businesswomanThis article **contains promotional content**. Please help improve it by removing promotional language and inappropriate external links, and by adding encyclopedic text written from a neutral point of view. *(June 2020)* *(Learn how and when to remove this message)* **Ho Ching** ([Chinese](/wiki/Chinese_language): 何晶; [pinyin](/wiki/Pinyin): *Hé Jīng*; [Wade–Giles](/wiki/Wade%E2%80%93Giles): *Ho2 Ching1*; [Cantonese Yale](/wiki/Yale_romanization_of_Cantonese): *Hòh Jīng*; born 27 March 1954) is a Singaporean businesswoman. Ho had been serving as the chairperson of Temasek Trust since 2022. She is the second wife of the third [Prime Minister of Singapore](/wiki/Prime_Minister_of_Singapore), [Lee Hsien Loong](/wiki/Lee_Hsien_Loong). Ho joined [Temasek Holdings](/wiki/Temasek_Holdings) as a director in January 2002. She became its executive director in May 2002 and was appointed as the [chief executive officer](/wiki/Chief_executive_officer) by [Goh Chok Tong](/wiki/Goh_Chok_Tong) in January 2004. ## Early life and education Ho was born on 27 March 1954 in Singapore. She attended [Crescent Girls' School](/wiki/Crescent_Girls%27_School) and [National Junior College](/wiki/National_Junior_College)—where she became one of the top students for the [A Level](/wiki/Singapore-Cambridge_GCE_Advanced_Level) examinations in her cohort and was named Student of the Year, before graduating from the University of Singapore (now the [National University of Singapore](/wiki/National_University_of_Singapore)) in 1976 with a [Bachelor of Engineering](/wiki/Bachelor_of_Engineering) with first class honours degree in [electrical engineering](/wiki/Electrical_engineering). She subsequently went on to complete a [Master of Science](/wiki/Master_of_Science) degree in electrical engineering at [Stanford University](/wiki/Stanford_University) in 1982. ## Career Ho started her career as an engineer with the [Ministry of Defence](/wiki/Ministry_of_Defence_(Singapore)) of Singapore in 1976. In 1983, she became the Director of Defence Materials Organisation, the procurement agency of the ministry and concurrently held the position of deputy director of Defence Science Organisation. Ho joined Singapore Technologies in 1987 as deputy director of engineering and took on various senior responsibilities before becoming its president and chief executive officer in 1997. She joined Temasek Holdings as a director in January 2002 and became its executive director in May 2002 before assuming the role of chief executive officer of the company on 1 January 2004. Ho has served as chairperson of the Singapore Institute of Standards and Industrial Research, and as deputy chairperson of the Productivity and Standards Board, and the [Economic Development Board](/wiki/Economic_Development_Board). Ho stepped down as CEO and executive director on 1 October 2021, being succeeded by [Dilhan Pillay Sandrasegara](/wiki/Dilhan_Pillay_Sandrasegara), who will continue to concurrently hold his current appointment as chief executive of Temasek International. The same day, she was appointed as a director of Temasek Trust. On 1 April 2022, she succeeded [S. Dhanabalan](/wiki/S._Dhanabalan) as chairperson of Temasek Trust. ## Honours ### National For her public service, she was conferred the - [Public Administration Medal](/wiki/Pingat_Pentadbiran_Awam) (silver, 1985) - [Public Service Star](/wiki/Public_Service_Star) (1996) award by the [Singapore Government](/wiki/Singapore_Government). ### Foreign - [Sultan of Brunei Golden Jubilee Medal](/wiki/50th_Anniversary_Celebrations_of_Sultan_Hassanal_Bolkiah%27s_Accession_to_the_Throne_of_Brunei), awarded 6 October 2017. - First Class of The Most Exalted [Order of Sultan Ibrahim Johor](/wiki/Order_of_Sultan_Ibrahim_of_Johor) – Dato' Sri Mulia Sultan Ibrahim Johor (SMIJ), which carries the title **Datin Paduka** (6 May 2022) - First Class of The Most Distinguished [Order of Paduka Seri Laila Jasa](/wiki/Order_of_Paduka_Seri_Laila_Jasa) – Darjah Paduka Seri Laila Jasa (PSLJ), which carries the title **Datin Paduka Seri Laila Jasa** (16 July 2022). ### Academic - In 1995, Ho was conferred the [National University of Singapore](/wiki/National_University_of_Singapore)'s Distinguished Engineering Alumnus Award. - She is also an [honorary fellow](/wiki/Honorary_fellow) of the Institution of Engineers, Singapore. ### Others Ho has appeared in many rankings of the most powerful and influential people in the world. In 2007, Ho was picked as one of the \"100 most influential men and women\" who shaped the world by *[Time](/wiki/Time_(magazine))* magazine. In 2007, *Forbes* magazine ranked her 3rd in its annual list of the world's most powerful women, behind German Chancellor [Angela Merkel](/wiki/Angela_Merkel) and China's Vice-Premier [Wu Yi](/wiki/Wu_Yi_(politician)). Ho had climbed 33 spots from 36th place in the previous year's list. In 2011, Ho was included in the '50 Most Influential' ranking by *[Bloomberg Markets](/wiki/Bloomberg_Markets)* magazine. In 2013, Ho was ranked ninth on the Public Investor 100 ranking compiled by the Sovereign Wealth Fund Institute. In 2014, she was listed as the 59th most powerful woman in the world by *Forbes*. In June, Ho was also awarded the 2014 Asian Business Leaders Award. The annual Asia House award recognises individuals who embody the 'Servant Leader' – economic success and professional excellence accompanied by moral leadership and service to society. Asia House is a centre of expertise on Asia and the leading pan-Asian organisation in the UK. She became the 30th most powerful woman in 2016. In 2019, she ranked No. 23 in the Power Women 2019 of *Forbes* list, while in 2020 she ranked 30th again. ## Philanthropy In her personal capacity, Ho supports various community service and charitable organisations. She has particular interest in special needs education, healthcare and the welfare and development of children. She is the patron of [Assisi Hospice](/wiki/Assisi_Hospice), and the founding chairman of Trailblazer Foundation Ltd, an IPC charity which provides funding for education, health, sports and community welfare. In March 2014, Ho was inducted into the [Singapore Council of Women's Organisations](/wiki/Singapore_Council_of_Women%27s_Organisations)' [Singapore Women's Hall of Fame](/wiki/Singapore_Women%27s_Hall_of_Fame), which honours outstanding women of Singapore. In August 2016, Ho received a positive reception when on a state visit to the White House to mark 50 years of bilateral relations between the US and Singapore, she carried a pouch designed by an autistic student from [Pathlight School](/wiki/Pathlight_School) (under its Artist Development Program). Ho is an advisor to the [Autism Resource Centre (ARC)](/wiki/Autism_Resource_Centre_(Singapore)), a non-profit charity in charge of Pathlight School, and had acquired the pouch at an ARC fundraising event. Ho is also a patron of the Autism Association of Singapore. ## Personal life Ho is the eldest of four children of a businessman, Ho Eng Hong (born 1929) and his wife, Chan Chiew Ping (1931–2005). She has two brothers and a sister. Her sister, Ho Peng, is the chairperson of the [Singapore Examinations and Assessment Board](/wiki/Singapore_Examinations_and_Assessment_Board), while her brother, Ho Sing, is an executive director of [Starhill Global REIT](/wiki/YTL_Corporation#Starhill_Global_REIT). She met her husband, [Lee Hsien Loong](/wiki/Lee_Hsien_Loong), the eldest son of former Singapore Prime Minister [Lee Kuan Yew](/wiki/Lee_Kuan_Yew), while starting out in her career at the [Ministry of Defence](/wiki/Ministry_of_Defence_(Singapore)) together with former prime minister [Goh Chok Tong](/wiki/Goh_Chok_Tong). They married on 17 December 1985 and have two sons, Hongyi and Haoyi. Ho is stepmother to Lee's two children from his first marriage—daughter Xiuqi and son Yipeng. Family tree of Lee Kuan YewLee Bok Boon 1846–1920Seow Huan Neo 1850–c. 1931Lee Hoon Leong 1871–1942Ko Liem Nio 1883–1959[Lee Chin Koon](/wiki/Lee_Chin_Koon) 1903–1997[Chua Jim Neo](/wiki/Chua_Jim_Neo) 1907–1980[Lee Kuan Yew](/wiki/Lee_Kuan_Yew) 1923–2015[Kwa Geok Choo](/wiki/Kwa_Geok_Choo) 1920–2010Dennis Lee Kim Yew 1925–2003Gloria Lee (Woo) Sau Yin 1926–2023Freddy Lee Thiam Yew 1927–2012Eleanor Ngo Puay ChinMonica Lee Kim Mon b. 1929George Chan Chor CheungDr Lee Suan Yew b. 1933Pamela ChongWong Ming Yang 1951–1982[Lee Hsien Loong](/wiki/Lee_Hsien_Loong) b. 1952Ho Ching b. 1953[Lee Wei Ling](/wiki/Lee_Wei_Ling) 1955–2024[Lee Hsien Yang](/wiki/Lee_Hsien_Yang) b. 1957Lim Suet Fern b. 1958Li Xiuqi b. 1981Li Yipeng b. 1982[Li Hongyi](/wiki/Li_Hongyi_(administrator)) b. 1987Li Haoyi b. 1989[Li Shengwu](/wiki/Li_Shengwu_(economist)) b. 1985Li Huanwu b. 1986Li Shaowu b. 1995 ### Social media activity Ho is an active social media user and regularly shares her views and interacts with others on [Facebook](/wiki/Facebook). According to news reports, Ho posted on Facebook an average of 4,800 per month from 2019 - 2020 and has published about 1,830 posts on average from 2015 - 2020. In 2020, she had more than 101,000 Facebook followers. At times, Ho has made more than 200 posts per day. She has occasionally re-shared several posts made by members of the [Cabinet](/wiki/Cabinet_of_Singapore) in quick succession. Some of Ho's public posts have drawn significant media attention and have been the subject of public controversy in Singapore and abroad. On 11 April 2020, Ho shared an article on Facebook about [Taiwan](/wiki/Taiwan)’s donation of masks to Singapore with the following caption: \"Errr\". Her comment was made shortly after media reports suggested that a ban on the export of masks imposed by Taipei during the [COVID-19 pandemic](/wiki/COVID-19_pandemic) had prevented [ST Engineering](/wiki/ST_Engineering) from exporting masks produced in Taiwan to Singapore. Some commentators suggested that Ho was ungrateful for the donation of masks to Singapore by Taiwan. Ho subsequently amended her caption to state that she was \"forever grateful... to all our friends and friends of friends in Taiwan\". In August 2023, amidst public debate over then-presidential candidate [Tan Kin Lian](/wiki/Tan_Kin_Lian)'s posts about 'pretty girls', Ho shared her views on Facebook, suggesting that the [Presidential Elections Committee](/wiki/Presidential_Elections_Committee) should not be expected to be the \"arbiter of moral standards\" and that \"[m]aybe TKL had asked for permission to take the pictures or to post\". - The Singapore Story: Memoirs of Lee Kuan Yew - Lee Kuan Yew | Articles Speeches and Interviews – Lee Kuan Yew 李光耀\n",
  "language": "en",
  "processed_at": "2026-01-12T11:10:01.922177",
  "title": "Ho Ching",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Ho_Ching"
}