{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:10:05.810579"
  },
  "content": "1955 civil unrest in Singapore**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Hock Lee bus riots\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(May 2011)* *(Learn how and when to remove this message)*This article includes a list of general references, but **it lacks sufficient corresponding inline citations**. Please help to improve this article by introducing more precise citations. *(December 2013)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)*Part of a series on the[History of Singapore](/wiki/History_of_Singapore)[Early history](/wiki/Early_history_of_Singapore) (pre-1819)[Srivijaya](/wiki/Srivijaya)650–1377[Temasek](/wiki/Temasek), [Long Ya Men](/wiki/Long_Ya_Men), [Ban Zu](/wiki/Ban_Zu)c.14th century[Kingdom of Singapura](/wiki/Kingdom_of_Singapura)1299–1398[Majapahit](/wiki/Majapahit)1398–1400[Malacca Sultanate](/wiki/Malacca_Sultanate)1400–1528[Johor Sultanate](/wiki/Johor_Sultanate)1528–1819British colonial era (1819–1942)[Founding](/wiki/Founding_years_of_modern_Singapore)1819–1826[Straits Settlements](/wiki/Singapore_in_the_Straits_Settlements)1826–1867[Crown colony](/wiki/Singapore_in_the_Straits_Settlements#Crown_colony_(1867–1942))1867–1942[Japanese Occupation](/wiki/Japanese_occupation_of_Singapore) (1942–1945)[Fall of Singapore](/wiki/Fall_of_Singapore)1942[Sook Ching](/wiki/Sook_Ching)1942[Double Tenth incident](/wiki/Double_Tenth_incident)1943[Post-war period](/wiki/Colony_of_Singapore) (1945–1962)[First Legislative Council](/wiki/History_of_Singapore#First_Legislative_Council_(1948–1951))1948–1951[Maria Hertogh riots](/wiki/Maria_Hertogh_riots)1950[Second Legislative Council](/wiki/History_of_Singapore#Second_Legislative_Council_(1951–1955))1951–1955[Anti-National Service Riots](/wiki/1954_National_Service_riots)1954[Internal self-government](/wiki/Self-governance_of_Singapore) (1955–1963)Hock Lee bus riots1955[Singapore Glass Factory strikes](/wiki/Singapore_Glass_Factory_strikes)1960[Pulau Senang prison riots](/wiki/Pulau_Senang_prison_riots)1963[Merger with Malaysia](/wiki/History_of_the_State_of_Singapore_(Malaysia)) (1963–1965)[Singaporean referendum](/wiki/1962_Singaporean_integration_referendum)1962[Operation Coldstore](/wiki/Operation_Coldstore)1963[Race riots in Singapore](/wiki/1964_race_riots_in_Singapore)1964[MacDonald House bombing](/wiki/MacDonald_House_bombing)1965[Republic of Singapore](/wiki/History_of_the_Republic_of_Singapore) (1965–present)[ASEAN Declaration](/wiki/ASEAN_Declaration) ([ASEAN](/wiki/Association_of_Southeast_Asian_Nations))1967[1969 race riots of Singapore](/wiki/1969_race_riots_of_Singapore)1969[Laju incident](/wiki/Laju_incident)1974[Operation Spectrum](/wiki/Operation_Spectrum)1987[Asian financial crisis](/wiki/1997_Asian_financial_crisis#Singapore)1997[Embassies attack plot](/wiki/Singapore_embassies_attack_plot)2001[H1N1 pandemic](/wiki/2009_swine_flu_pandemic_in_Asia#Singapore)2009–2010[Bus drivers' strike](/wiki/2012_Singapore_bus_drivers%27_strike)2012[Little India riot](/wiki/2013_Little_India_riot)2013[2018 North Korea–United States Singapore Summit](/wiki/2018_North_Korea%E2%80%93United_States_Singapore_Summit)2018[COVID-19 pandemic](/wiki/COVID-19_pandemic_in_Singapore)2020–2022By topic - [Timeline](/wiki/Timeline_of_Singaporean_history) - [Riots](/wiki/List_of_riots_in_Singapore) - [Military](/wiki/Military_history_of_Singapore) Singapore portal - v - t - e The **Hock Lee bus riots** took place on 12 May 1955 in Singapore. The riots started as a result of confrontation between the police, bus workers of the Hock Lee Amalgamated Bus Company and students who supported the bus workers. In February of that year, the Hock Lee Amalgamated Bus Company fired 229 bus workers due to their association with the Singapore Bus Workers' Union. As a result, the bus workers went on a strike. Despite mediation efforts, the strikes escalated into riots on 12 May, resulting in the deaths of four people and thirty-one people injured. ## Background ### Postwar conditions and the rise of trade unions The global trend of decolonisation, led the way for the liberalisation of Singaporean politics. The 1948 constitution that reformed the political and judicial systems in Singapore paved the way for Singapore's first elections in 1948. This partial liberalisation was impeded as the British saw their strategic interests in Southeast Asia being challenged by peasant uprisings especially in Malaya. ### Role of the British To maintain their control, the British tried to construct a narrative of communist insurgencies and militarism which could be potentially threatening to the security of the region. On the premise of containing communist activities, emergency regulations were implemented in 1948. These emergency regulations increased restriction on civil society meetings in Singapore. A turning point came as the [Rendel Constitution](/wiki/Constitution_of_Singapore) was accepted by the British government and resulted in elections that brought [David Marshall](/wiki/David_Marshall_(Singaporean_politician)) and the [Labour Front](/wiki/Labour_Front) party into power. This new constitution led to the provisional easing of restrictions under Emergency regulations, which in its turn sparked off much interest in politics among the people living in Singapore. This renewed liberalisation led to the establishment of many trade unions during this period which would have alarmed many employers that were worried about their business interests. Oppressive colonial educational and labour policies discriminated against Chinese students and workers. Perceived unjust colonial policies led to various episodes of labour unrests in 1954 and 1955. In 1954 there was The May 13 National Service Ordinance. And in 1955, there were three notable strikes namely the Hock Lee Bus workers' strike, the [Singapore Traction Company](/wiki/Singapore_Traction_Company) strike and the Singapore Harbour Board strike. ### Role of Americans in Singapore's labour movement American officials were alarmed by both the rise of social unrest in Singapore and the [Labour Front](/wiki/Labour_Front)'s inability to control labour radicalism. It was estimated that 31,000 workers were involved in 129 official and sympathy strikes between March and June 1955. Some work has been done to study the significance of certain figures that arose from United States government sources. The seeds of a communist discourse was being sown by American diplomats, pressuring the British government to take subversive actions against student and labour movements in post 1954 Singapore. Thus leading to the construction of events like the Hock Lee incident as a violent event instigated by communists. Kumar Ramakrishna's latest work on the communist threat in Singapore necessitates the polarisation of the scholarship on Singapore history and suggests that historians should take sides. Conventional historical narratives have represented the workers and students actions as violent and conceived out of communism. The emerging work on the Hock Lee incident have foregrounded the experiences of the people through the provision of accounts that focus on the social and economic anxieties that were felt by both the students and the workers due to life in colonial society. ## Student movement Bilveer Singh stated that the Hock Lee riots revealed \"the ability of the communists to mobilise other elements of the [Communist United Front], such as the students\". Singh's reconstruction of the Hock Lee riots rely on the works of Bloodworth, Drysdale, and Lee. His analysis agrees with the colonial perspective and concludes that the students' involvement in the Hock Lee incident was part of a larger plan of communist subversion. Bloodworth starts his narrative by accusing the 'communist' students of being at the centre of the violence that occurred in the Hock Lee event. He attributes the cause of the unrest to union leader, [Fong Swee Suan](/wiki/Fong_Swee_Suan) and takes on a perspective which favours the actions of the bus company. The above conventional accounts commonly attribute the student involvement to be one of communist action and again do not give the students any form of political consciousness. The students who were involved in the riots were part of the Singapore Chinese Middle School Student Union (SCMSSU). The relationship between the workers and the students is one that is often overlooked in many accounts of history and thus leading to the common conclusion that students' involvement was part of a violent extremist movement. The British adopted a substitution strategy to replace Chinese schools with English institution. A ten-year education plan unveiled by the colonial administration in 1949 sought to significantly decrease student enrolment in Chinese vernacular schools. Chinese students were faced with the implementation of high school exams that served little purpose in ensuring the students' path into university. The National Service Ordinance act also disrupted the education of Chinese students as the colonial government was unwilling to allow them to defer if they had to sit for examinations. This eventually led to the [May 13 incident](/wiki/1954_National_Service_riots) in 1954. In January 1955, the students' application to register the SCMSSU was rejected and subsequently met with many obstacles which the students felt were unreasonable demands by the colonial government to prevent the set up of the student union. Newspaper reports of the government not providing help or compensation to victims of World War Two in Singapore also served as a reminder to students that they were being asked to fight for a government that does not have their interests at heart. Students were seen to be the allies of the workers serving as a political force that could influence the decisions of the ruling elite. Loh et al. highlighted that many of the workers were ex-students and that the Chinese school students knew that the workers who were intertwined in labour negotiations was a reflection of their future. The anxieties of the students coupled with the students' sympathy to the workers resulted in their support for the Hock Lee bus workers. ## Workers [C. M. Turnbull](/wiki/C._M._Turnbull) saw the cause of the riots to be a battle between moderate and left-wing politics within the [People's Action Party](/wiki/People%27s_Action_Party) (PAP) and attributed the workers' involvement to be one of \"joint direct militant campaign of obstruction and violence.\" The book *Men in White* also frames the Hock Lee event as a \"demonstration of the ruthlessness of the communists and their capacity to unleash violence in Singapore.\" In both these accounts, the bus workers were not given any political consciousness as the event is seen as a spontaneous one that was initiated by the communists that eventually went out of control. Workers in the 1950s were subject to the many effects of colonial society. The [Rendel Constitution](/wiki/Rendel_Constitution) paved the way for the liberalisation of Singapore politics coupled with the workers increasing anxiety about wages and working conditions as seen from an increase from 11 trade unions in 1946, to 236 unions in 1955. The post-war colonial administration was seen to be corrupt and inefficient and blamed for the poor working and economic conditions that the workers were subjected to. Strikes became more frequent as progression in the trade union movement was being challenged by the employers' refusal to recognise the unions and in its turn form splinter unions that would threaten the existing unionised workers. The Paya Lebar Bus Company labour protest was one of 275 strikes that took place in 1955. These activisms set the backdrop for the Hock Lee Bus workers' strike. There is evidence that the Hock Lee Bus workers' strike was not fully under the direction of the [Malayan Communist Party](/wiki/Malayan_Communist_Party) (MCP) and that the workers were so passionate about their fight against colonial oppression and exploitation that even the MCP were not able to effectively restraint the workers. Therefore, the Hock Lee Bus Incident was not a moment of spontaneous communist action but was the effect of the intersections between opposing workers' and employers' sentiments towards the progressive establishment of trade unions which was one of the positive aspects of the Rendel Constitution. These activisms also arose as Singapore was going through a tough economic climate with goods prices increasing by almost 19 per cent; but wages only increased by 0.8 per cent between the period of 1950 and 1955. Workers like Lee Tee Tong, who were subject to poor working conditions and the harsh realities of the colonial political economy led them to be increasingly unhappy with the government. This led to unrest among the workers as many were struggling to make ends meet. These strikes proved to be effective as the wages of workers increased by about 10 per cent on an hourly basis over the course of 1955-1956. ## Strike and riot The Hock Lee Amalgamated Bus Company was one of the eleven Chinese bus companies in Singapore that was in operation. In February 1955, the workers started their own union and joined with the Singapore Bus Workers' Union (SBWU), hence the company instantly fired the organisers of the union in an attempt to dissolve the union. On February 24, the company went a step further to set up a rival yellow union and hired 200 new workers in the process. Feeling threatened, on 22 April 1955, the bus workers' union put up a notice to strike. The company proceeded to fire 229 workers who were related to the SBWU on 24 April 1955. This angered the workers further which prompted them to set up human blockades at the bus depot, stopping the buses from leaving. Chief Minister David Marshall tried to plead their case with the company's management, but his efforts were futile. On 12 May 1955, multilateral talks to mediate the workers' disputes were hampered as police clashed with strikers. The clash involved an estimated 2,000 people which broke out in the streets of Alexandra Road and Tiong Bahru. The police tried to break up the 2,000 students and strikers using tear gas. Four people died as a result, including Andrew Teo, a Constable with the Volunteer Special Constabulary, who was severely beaten by a mob, Yuen Yau Phang, another Chinese police officer who was allegedly burned to death in his car, Gene D. Symonds, an American press correspondent also beaten by the mob and Chong Lon Chong, a sixteen-year-old student of Chin Kang School whose death caught the most attention. In an initial Straits Times report, the student was shot one mile away from a hospital, but was paraded around for two and half-hours by the students to further arouse the crowd's emotion without sending him for medical treatment. The press, including the vernacular press and the English medium Straits Times, however later reported that it was revealed that the coroner stated in the lawyer's brief to Chong's mother that it was inconclusive as to whether the boy was dead or still alive after he was shot. Furthermore, it was also established after the trial that the four men who were arrested were not students. The riot resulted in the deaths of four people and thirty-one people injured. ## Significance While the Hock Lee incident has conventionally been portrayed be one of communist subversion, other sources suggest that the students and workers' involvements in the Hock Lee incident were also due to anxieties felt by these two groups as a result of the conditions of colonial society. The Hock Lee bus workers' strikes can also be seen as one of the catalysts for the modernisation of the bus transportation industry in Singapore. The Hock Lee workers' strikes as well as other similar transportation workers' strikes resulted in the nationalisation of the Singapore transportation industry, specifically the Chinese owned bus companies. Shortly after the Hock Lee workers' strikes, the Singapore Traction Company strikes occurred which motivated the Hawkins Report of 1956. The Hawkins Report called for the reformation of the transportation industry in Singapore through a consolidation of the Chinese bus companies. The Hawkins report advocated for a single entity to control transportation. The report was an evident reaction to the operational challenges, poor administration and labour discontent that was evident in many of the bus companies. In 1970, RP Wilson was appointed to look into the reorganisation of public transportation in Singapore which resulted in the establishment of the government-led Singapore Transport Advisory Board in 1970, which sought to not only nationalise the bus companies but also to create a more efficient transportation system. To many of the workers, these strikes helped them to gain a 'Singaporean' consciousness outside of colonialism. The strikes and the workers' sentiments however were quickly put out. Part of Singapore's modernisation project was to expand its tourism sector and an efficient transportation system was important for this growth. This did not leave room for any form of activism that would disrupt Singapore's necessary path towards modernity and economic development. ## Media representations Media interest in the event sparked off some public debate. The [Singapore Broadcasting Corporation](/wiki/Singapore_Broadcasting_Corporation)'s television series *Diary of A Nation*, produced in 1988, covers the Hock Lee event in episode ten. The Hock Lee incident was also depicted in [Channel News Asia](/wiki/Channel_News_Asia)'s documentary feature on violence and communism in Singapore in the 1950s, *Days of Rage*. A reaction to the film was published in the form of a three-part critique named, \"Hock Lee bus riots – fact or fiction by CNA?\" by [The Online Citizen](/wiki/The_Online_Citizen). The riots were also dramatised in the drama *The Journey: Tumultuous Times*. Library resources about **Hock Lee bus riots** - Resources in your library - Resources in other libraries - Hock Lee bus strike and riot\n",
  "language": "en",
  "processed_at": "2026-01-12T11:10:05.810065",
  "title": "Hock Lee bus riots",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Hock_Lee_bus_riots"
}