{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:10:07.880274"
  },
  "content": "Linguistic substrate [Singaporean Hokkien](/wiki/Singaporean_Hokkien) is the largest non-[Mandarin Chinese](/wiki/Mandarin_Chinese) variety spoken in Singapore. As such, it exerts the greatest influence on Colloquial Singaporean Mandarin, resulting in a Hokkien-style [Singaporean Mandarin](/wiki/Singaporean_Mandarin) widely spoken in the country. ## Influences on phonology Some Hokkien Singaporeans are unable to accurately pronounce the sounds of [Standard Mandarin](/wiki/Standard_Chinese) due to influences from their [Hokkien](/wiki/Singaporean_Hokkien) [mother tongue](/wiki/Mother_tongue). These include [consonants](/wiki/Consonant) such as *f, z, zh, s, r*. They also pronounce some [vowels](/wiki/Vowel) and rhymes such as *i, e, en, eng* differently. In terms of tone, they often bring the [checked tone](/wiki/Checked_tone) ([Chinese](/wiki/Chinese_language): 入聲) of Hokkien into Mandarin.[*citation needed*] ## Hokkien-derived vocabulary The use of Hokkien vocabulary in Singaporean Mandarin can be categorized as such: 1. Use of Hokkien words in lieu of standard Mandarin words ([loanwords](/wiki/Loanword)) 2. Use of Hokkien monosyllabic words in lieu of standard disyllabic Mandarin words ([calques](/wiki/Calque)) 3. Replacing of Mandarin morphemes with Hokkien morphemes 4. Use of Hokkien [word order](/wiki/Word_order) (in vocabulary) in lieu of standard Mandarin word order 5. Modifying the meaning of Mandarin word using Hokkien words (loaned meaning) ### Hokkien borrowings Some Hokkien words with the same meaning are used to replace standard Mandarin words. Singaporean Mandarin (Hokkien loan words)Standard MandarinDefinition面盆 miàn pén臉盆 liǎn pénWashbasin龍溝 lóng gōu水溝 shuǐ gōuDitch燒水 shāo shuǐ熱水 rè shuǐHot water風胎 fēng tāi車胎 chē tāiTire煮飯 zhǔ fàn燒飯 shāo fàn or 做飯 zuò fànCooking一路來 yī lù lái向來 xiàng lái or 一直 yī zhíAll along ### Monosyllabic borrowings Some Hokkien mono-syllabic words are used instead of two-syllable words in Mandarin. ## Omission of Mandarin words' suffixes The [suffix](/wiki/Suffix) of certain Mandarin words might be omitted in colloquial Singaporean Mandarin due to the use of Hokkien mono-syllabic words. For instance, the suffix \"子 *zi*\" is commonly omitted in colloquial Singaporean Mandarin. Colloquial Singaporean Mandarin (Hokkien mono-syllabic word)Standard MandarinDefinitionExample of Usage (Singaporean Mandarin)鴨 yā鴨子 yā ziDuck我買了一只**鴨** (*I bought a duck*)位 wèi位子 wèi ziSeat沒有**位**了 (*No more seats*)裙 qún裙子 qún ziSkirt你的**裙**太長了 (*Your skirt is too long.*)領 lǐng領子 lǐng ziCollar你的**領**很髒 (*Your collar is very dirty.*)石 shí石頭 shí touStone這塊**石**很大 (*This stone is very big.*) ### Replacing Mandarin morpheme with Hokkien morpheme A [morpheme](/wiki/Morpheme) in Mandarin is removed from a two-syllable word, leaving a one-syllable word, which is used in Hokkien. Colloquial Singaporean Mandarin (Hokkien morpheme)Standard MandarinDefinitionExample of Usage (Singaporean Mandarin)色 sè顔色 yán sèColour這塊布什麽**色**？ (*What colour is this cloth?*)力 lì力氣 lì qi or 力量 lì liangStrength我沒有**力**了 (*I have no more strength*)工 gōng工作 gōng zuòWork去找**工**做 (*go and find a work*)明 míng明白 míng baiUnderstand你一說我就**明**了 (*Once you say it, I've understood it*)銷 xiāo推銷 tuī xiāoSell他替我**銷**了很多本書 (*He helps me to sell many books*) ### Same meaning, different word order Some multi-syllable words in Standard Mandarin might be used with a different word order (reversed or changed) in Hokkien, and the latter's word order is adopted into Singaporean Mandarin. Colloquial Singaporean Mandarin (Hokkien word order)Standard MandarinDefinition麵綫 miàn xiàn綫麵 xiàn miànRice noodle人客 rén kè客人 kè rénGuest飯盒 fàn hé盒飯 hé fànSmall box of meal ### Modifying the meaning of Mandarin using Hokkien words Certain words in Standard Mandarin have a different meaning in Hokkien, and this difference is adopted by Singaporean Mandarin. Some examples of these are listed below. Colloquial Singaporean Mandarin (Hokkien loan word)Standard MandarinDefinitionUsageNotes肥 féi胖 pàngFat你最近**肥**好多了 (You've been fatter recently)The Mandarin word \"肥\" is not originally used for a person. Instead, Standard Mandarin uses the word \"胖\" esp. when referring to a fat person.爽 shuǎng痛快 tòng kuaiHappy/Joyful玩得很**爽** (*play joyfully*)The Mandarin word \"爽\" originally means \"cool\". Here it has been modified to mean \"happy\".會 huì能 néngAble to車**會**過嗎? (*Is the car able to cross?*)The word \"會\" in Standard Mandarin does not mean an action that can probably be realized. \"能\", which indicates a possibility, is usually used instead.本事 běn shì有本事 yǒu běn shìCapable他很**本事** (*He is capable*)The word \"本事\" in Standard Mandarin is a 'noun'. ## Influences on grammar Singaporean Hokkien has influenced Singaporean Mandarin Grammar in 5 main areas. ### Word order The word order refers to the order or sequence of how words are arranged in combination. Because of influence from Singaporean Hokkien, the word order in certain phrases are replaced by that of Singaporean Hokkien, or are simultaneously used with that of Singaporean Mandarin. #### \"Verb/object + complement\" structure In Standard Mandarin, certain [object](/wiki/Object_(grammar)) in [predicate](/wiki/Predicate_(grammar)) structure are put after a [complement](/wiki/Complement_(linguistics)). However, the \"[verb](/wiki/Verb)/[object](/wiki/Object_(grammar)) + [complement](/wiki/Complement_(linguistics))\" structure is used in Singaporean Mandarin. Examples are shown in the table below: Colloquial Singaporean MandarinStandard MandarinTranslationGrammar Notes你上**課完**再去吧！ nǐ shàng kè wán zài qù ba你上**完課**再去吧！ nǐ shàng wán kè zài qù baYou go only after you've finished lessons!The [object](/wiki/Object_(grammar)) \"課\" is put before the [complement](/wiki/Complement_(linguistics)) \"完\", instead of after.考**試完**你再來！ kǎo shì wán nǐ zài lái考**完試**你再來！ kǎo wán shì nǐ zài láiCome only after you've finished the exam!The [object](/wiki/Object_(grammar)) \"試\" is put before the [complement](/wiki/Complement_(linguistics)) \"完\", instead of after.你吃**飯了**再寫好嗎？ nǐ chī fàn le zài xiě hǎo ma你吃**了飯**再寫好嗎？ nǐ chī liǎo fàn zài xiě hǎo maCan you write after you've finished your meal?The [object](/wiki/Object_(grammar)) \"飯\" is put before the [complement](/wiki/Complement_(linguistics)) \"了\", instead of after. #### Changes in overlapping word order Overlapping word order in Singaporean Mandarin sometimes differ from that of Standard Mandarin. Examples are shown in the table below: Singaporean Mandarin (overlapping words)Standard Mandarin (overlapping words)Translation**想**東**想**西 xiǎng dōng xiǎng xī東**想**西**想** dōng xiǎng xī xiǎngAnyhow think**搞**七**搞**八 gǎo qī gǎo bā七**搞**八**搞** qī gǎo bā gǎoAnyhow mess around ### Overlapping of words Certain mono-syllabic [adjectives](/wiki/Adjectives) and [verbs](/wiki/Verbs) or two-syllable [adjectives](/wiki/Adjectives) and [verbs](/wiki/Verbs) in Singaporean Hokkien have entered into Singaporean Mandarin. These are used together with their counterparts in Standard Mandarin. Examples are shown in the table below: Singaporean MandarinStandard MandarinTranslation花**紅紅**很好看。 huā hóng hóng hěn hǎo kàn花**紅紅的**很好看。 huā hóng hóng de hěn hǎo kànThe flower is reddish and looks great.你**試看看**。 nǐ shì kàn kan你**試試看**。 nǐ shì shì kànJust try it.**吃看看**啦。 chī kàn kàn la**吃吃看**啦。 chī chī kàn laJust try eating it.把功課做完。 bǎ gōng kè zuò wán把功課**都**做完。 bǎ gōng kè dōu zuò wánFinish all of the homework.這些你**吃吃掉**好嗎？ zhè xie nǐ chī chī diào hǎo ma這些你**都吃掉**好嗎？ zhè xie nǐ dōu chī diào hǎo maCan you finish eating all these?大家都坐**好好**。 dà jiā dōu zuò hǎo hǎo大家都坐**得好好的**。 dà jiā dōu zuò hǎo hǎo deEveryone is sitting properly.他**跑快快**來拿東西。 tā pǎo kuài kuài lái ná dōng xi他**很快地跑**來拿東西。 tā hěn kuài de pǎo lái ná dōng xiHe runs here quickly to take the thing.他**硬硬**要去。 tā yìng yìng yào qù他**硬(是)**要去。 tā yìng (shì) yào qùHe insists on going.不要**亂亂**寫。 bù yào luàn luàn xiě不要**亂**寫。 bù yào luàn xiěDon't anyhow write.你**久久**才來一次。 nǐ jiǔ jiǔ cái lái yī cì你**很久**才來一次。。 nǐ hěn jiǔ cái lái yī cìHe came only once after a long time.吃飽飯出去**散步散步**。 chī bǎo fàn chū qù sàn bù sàn bù吃飽飯出去**散散步**。 chī bǎo fàn chū qù sàn sàn bùGo for a stroll after you've finished your meal.大家**見面見面**一下也好。 dà jiā jiàn miàn jiàn miàn yī xià yě hǎo大家**見見面**也好。 dà jiā jiàn jiàn miàn yě hǎo or 大家**見一下面**也好。dà jiā jiàn yī xià miàn yě hǎoIt's good everyone of us meet for a while ### Omission Certain components of a sentence that are used in Standard Mandarin are omitted in colloquial Singaporean Mandarin, due to Hokkien influence on the latter. #### Omission of directional verbs Certain directional verbs are omitted or dropped in Singaporean Mandarin. Examples are shown in the table below: Singaporean Mandarin (Hokkien-style omission)Standard MandarinTranslationNotes車子太大，不能**進**。 chē zǐ tài dà, bù néng jìn車子太大，不能**進去**。 chē zǐ tài dà, bù néng jìn qùThe car is too big, it cannot get in.The directional verb \"去\" has been omitted.考試成績還沒**出**。 kǎo shì chéng jī hái méi chū考試成績還沒**出來**。 kǎo shì chéng jī hái méi chū laiThe exam results haven't come out.The directional verb \"來\" has been omitted. #### Omission of the word \"得\" The word \"得\" used in the sentence structure between a [verb](/wiki/Verb) and a [complement](/wiki/Complement_(linguistics)) has been omitted in colloquial Singaporean Mandarin Examples are shown in the table below: Singaporean Mandarin (omission of the word \"得\")Standard MandarinTranslation你**吃很慢**。 nǐ chī hěn màn你**吃得很慢**。 nǐ chī de hěn mànYou eat very slowly.這種事我**見太多了**。 zhè zhǒng shì wǒ jiàn tài duō le這種事我**見得太多了**。 zhè zhǒng shì wǒ jiàn dé tài duō leI've seen this thing too many times. #### Omission of certain numbers Certain numbers, which are expressed in Standard Mandarin, are omitted in colloquial Singaporean Mandarin. Examples are shown in the table below: Singaporean Mandarin (omission of certain numbers)Standard MandarinTranslationNotes塊半。 kuài bàn**一**塊五毛。 yī kuài wǔ máoOne dollar and fifty cents (money)The number \"一\" (one) has been omitted尺二。 chǐ èr**一**尺二。 yī chǐ èr1.2 feet (length)The number \"一\" (one) has been omitted百三。 bǎi sān一百三十。 yī bǎi sān shíOne hundred and thirtyThe number \"一\" (one) has been omitted兩萬五元。 liǎng wàn wǔ yuán兩萬五千元。 liǎng wàn wǔ qiān yuánTwenty five thousand dollarsThe number \"千\" (thousand) has been omitted ### Word groupings and arrangements Certain word groupings and arrangements in colloquial Singaporean Mandarin sentences are greatly influenced by Hokkien. #### Use of the words \"有\" and \"無\" In Mandarin, the words \"有\" and \"無\" generally do not act as [complementary](/wiki/Complement_(linguistics)) [verbs](/wiki/Verbs). But due to influence from Hokkien, colloquial Singaporean Mandarin uses them as [complementary](/wiki/Complement_(linguistics)) [verbs](/wiki/Verbs). Examples are shown in the table below: Singaporean Mandarin (Hokkien influenced)Standard MandarinTranslation你聽**有**嗎？我聽**有**。 nǐ tīng yǒu ma? wǒ tīng yǒu.你聽(得)懂嗎？我聽(得)懂。 nǐ tīng dé dǒng ma? wǒ tīng dé dǒngDo you understand me?他看**有**，我看**沒有**。 tā kàn yǒu wǒ kàn méi yǒu他看得見，我看不見。 tā kàn dé jiàn, wǒ kàn bú jiànHe could see, I cannot see.這本書我找**有**了。 zhè běn shū wǒ zhǎo yǒu le這本書我找到了。 zhè běn shū wǒ zhǎo dào leI found this book #### Use of the word \"到\" in lieu of \"得\" In a \"[verb](/wiki/Verb)+[complement](/wiki/Complement_(linguistics))\" sentence structure, standard Mandarin uses the word 得 to link the verb and complement. Singapore Mandarin, due to influence from Hokkien, uses the word 到 instead. Examples are shown in the table below: Singaporean Mandarin (Hokkien influenced)Standard MandarinTranslation我氣**到**半死。 wǒ qì dào bàn sǐ我氣**得**半死。 wǒ qì dé bàn sǐI am so angry half-dead.害**到**我白忙一場。 hài dào wǒ bái máng yī cháng害**得**我白忙一場。 hài dé wǒ bái máng yī chángIt wastes all my effort.我被他弄**到**很不好意思。 wǒ bèi tā nòng dào hěn bù hǎo yì si我被他弄**得**很不好意思。 wǒ bèi tā nòng dé hěn bù hǎo yì siHe makes me feel embarrassed. #### Use of the word \"去\" Certain Singapore Mandarin sentence structures use the word 去 as the [resultative complement](/wiki/Resultative), where another character (such as 掉) might be used in Standard Mandarin. Examples are shown in the table below: Singaporean Mandarin (Hokkien influenced)Standard MandarinTranslation杯子破**去**了。 bēi zi pò qù le杯子破掉了。 bēi zi pò diào leThe cup has broken.錢用**去**了。 qián yòng qù le錢用掉了。 qián yòng diào le or 錢用完了。 qián yòng wán leThe money is used up.椅子已經壞**去**。 yǐ zi yǐ jīng huài qù椅子已經壞掉。 yǐ zi yǐ jīng huài diàoThe chair has been broken #### Use of Hokkien classifiers A [classifier](/wiki/Classifier_(linguistics)) ([measure words](/wiki/Chinese_classifier)) which is used with a certain noun in Hokkien might also be used similarly in Singapore Mandarin with the same noun, whereas another classifier might be used for that same word in Standard Mandarin. Examples are shown in the table below: Singaporean Mandarin (Hokkien measure word)Standard MandarinTranslationNotes一**粒**球。 yī lì qiú一**個**球。 yī gè qiúA ballThe word \"粒\" (lì) is a Hokkien measure word一**只**飛機。 yī zhī fēi jī一**架**飛機。 yī jià fēi jīAn aeroplaneThe word \"只\" (zhī) is a Hokkien measure word一**支**刀。 yī zhī dāo一**把**刀。 yī bǎ dāoA knifeThe word \"支\" (zhī) is a Hokkien measure word ### Sentences Certain sentence structures used in Singapore Mandarin are influenced by Hokkien, and differ from their Standard Mandarin counterparts. Some cases are listed in the following sub-sections. #### Use of the word \"有\" The word \"有\" (yǒu) is usually added in front of a [verb](/wiki/Verb) or [verb](/wiki/Verb) [predicate](/wiki/Predicate_(grammar)) to indicate an existing action or completed status. Singaporean Mandarin (Hokkien influenced)Standard MandarinTranslation我**有**看見他。 wǒ yǒu kàn jiàn tā我看見他了。 wǒ kàn jiàn tā leI saw him**有**在家嗎？ yǒu zài jiā ma在家嗎？ zài jiā maAt home?我明明**有**給你。 wǒ míng míng yǒu gěi nǐ我明明給了你。 wǒ míng míng gěi le nǐI obviously gave you #### Use of the word \"會\" The use of word \"會\" (huì) [literally \"can\"] is used in colloquial Singaporean Hokkien, and such a use has entered Singapore Mandarin. The sense of 會 as \"can\" in Standard Mandarin is generally limited to knowledge or skilled ability, such as ability to speak a language, but in Singaporean Mandarin it is broader and closer to the meaning of \"can\" in English, which indicates possibility or ability generally. Singaporean Mandarin (Hokkien influenced)Standard MandarinTranslation車子**會**過嗎？ chē zǐ huì guò ma車子**能**過嗎？ chē zǐ néng guò maCan the car cross?到宏茂橋**會**遠嗎？ dào hóng mào qiáo huì yuǎn ma到宏茂橋(**很**)遠嗎？ dào hóng mào qiáo hěn yuǎn maIs it far to travel to [Ang Mo Kio](/wiki/Ang_Mo_Kio)?東西很多，吃**會**飽。 dōng xi hěn duō, chī huì bǎo東西很多，**能**吃飽(吃**得**飽)。 dōng xi hěn duō, néng chī bǎo (chī dé bǎo)There are many things, you can fill your stomach #### Pronunciation of the word \"了\" The word \"了\" is often pronounced as \"liǎo\" instead of \"le\". Singaporean Mandarin (Hokkien influenced)Standard MandarinTranslation機器壞**了** jī qì huài liǎo機器壞(掉)**了** jī qì huài diào leMachine broke down人走**了** rén zǒu liǎo人走(掉)**了** rén zǒu diào leThe person is gone #### Use of the Hokkien sentence-final particles \"嘛\", \"啦\" or \"咧\" Colloquial Singaporean Mandarin often involves the addition of Hokkien sentence-final particles such as \"嘛\" (ma), \"啦\" (la) or \"咧\" (lēh). Singaporean Mandarin (Hokkien influenced)Standard MandarinDefinition下午到我家玩**嘛**。 xià wǔ dào wǒ jiā wán ma下午到我家玩。 xià wǔ dào wǒ jiā wánCome to my place for fun this afternoon你快點去**啦**。 nǐ kuài diǎn qù la你快點去。 nǐ kuài diǎn qùQuickly go.不是這樣**咧**。 bú shì zhè yàng lēh不是這樣。 bú shì zhè yàngIt's not like this. - [Singaporean Mandarin](/wiki/Singaporean_Mandarin) - [Standard Singaporean Mandarin](/wiki/Standard_Singaporean_Mandarin) - [Languages of Singapore](/wiki/Languages_of_Singapore) - [Chinese in Singapore](/wiki/Chinese_in_Singapore) - [Speak Mandarin Campaign](/wiki/Speak_Mandarin_Campaign) - [Singapore Chinese characters](/wiki/Singapore_Chinese_characters) - [Standard Mandarin](/wiki/Standard_Mandarin) - [Taiwanese Mandarin](/wiki/Taiwanese_Mandarin) - [Malaysian Mandarin](/wiki/Malaysian_Mandarin) - [Singaporean Hokkien](/wiki/Singaporean_Hokkien) - 新加坡闽南话与华语 (Singaporean Hokkien and Mandarin) - 周清海编著， 《新加坡华语词汇与语法》，新加坡玲子传媒私人有限公司出版， 2002年9月, [ISBN](/wiki/ISBN_(identifier)) 981-4127-23-X， [ISBN](/wiki/ISBN_(identifier)) 978-981-4127-23-3 (Zhou, Qinghai (2002), *Vocabulary and Grammar of Singaporean Mandarin*, Lingzi Media) - 周清海(著)，《变动中的语言》，新加坡玲子传媒私人有限公司出版, 2009年, [ISBN](/wiki/ISBN_(identifier)) 981-4243-92-2、[ISBN](/wiki/ISBN_(identifier)) 978-981-4243-92-6 (Zhou, Qinghai (2009), *The changing languages*, Lingzi Media) - 周長揖、周清海(著)，《新加坡閩南話詞典》 ，中國社會科學出版社， 2002年，[ISBN](/wiki/ISBN_(identifier)) 978-7-5004-3530-3 (Zhou Changyi, Zhou Qinghai (2002), \"Singaporean Hokkien Dictionary\", China Social Science Pub.) - Zhou, Changji; Zhou, Qinghai (2000). *新加坡闽南话概说* [*An Overview on Singaporean Hokkien*]. 南洋理工大学中华语言文化中心丛书 (in Chinese) (1st ed.). Xiamen: [Xiamen University](/wiki/Xiamen_University). [ISBN](/wiki/ISBN_(identifier)) 978-7-5615-1692-8. - 周長揖(著)，《新加坡閩南話俗語歌謠選》 ，廈門大學出版社， 2003年，[ISBN](/wiki/ISBN_(identifier)) 7-5615-2158-8(Zhou Changyi (2003), \"Collection of Singaporean Hokkien Folk Adage and Ballad\", Xiamen University Pub.)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:10:07.879684",
  "title": "Hokkien influence on Singaporean Mandarin",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Hokkien_influence_on_Singaporean_Mandarin"
}