{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:10:11.796696"
  },
  "content": "Neighbourhood in Singapore**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **contains promotional content**. Please help improve it by removing promotional language and inappropriate external links, and by adding encyclopedic text written from a neutral point of view. *(July 2016)* *(Learn how and when to remove this message)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Holland Village, Singapore\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(January 2018)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)*Neighbourhoods in Singapore **Holland Village**, often abbreviated as **Holland V**, is a neighbourhood located along the boundary between the [planning areas](/wiki/Planning_Areas_of_Singapore) of [Bukit Timah](/wiki/Bukit_Timah) and [Queenstown](/wiki/Queenstown,_Singapore) in the [Central Region](/wiki/Central_Region,_Singapore) of [Singapore](/wiki/Singapore). The area is served by its own [MRT station](/wiki/Holland_Village_MRT_station), which opened in 2011. ## Etymology Holland Village was named after [Holland Road](/wiki/Holland_Road,_Singapore), which in turn is said to have been named after Hugh Holland in 1907; Holland, an architect and amateur actor, was an early resident of the area. However, there is \"hardly any official record of him or his association with the name Holland Road.\" The roads 'Holland Avenue', 'Holland Close' and 'Holland Drive' were officially named after the principal road in 1972. Holland Road is known as *hue hng au* in [Hokkien](/wiki/Min_Nan), meaning \"behind the flower garden\". The \"flower garden\" refers to the [Botanic Gardens](/wiki/Singapore_Botanic_Gardens). ## History Holland Village started as a kampung for local residents. Later, terraced houses and walk-up apartments were built at Chip Bee Gardens as married quarters for the British military. In the 1990s, as the area around Holland Village, namely Orchard and Tanglin, became prime residential zones and Western expatriates staying in the area, Holland Village attracted retail brands to set up shops and turning the area to a shopping and dining destination. In 2011, the [Holland Village MRT station](/wiki/Holland_Village_MRT_station), on the [Circle MRT line](/wiki/Circle_Line_(Singapore)), opened but did not bring additional traffic to the area. In 2019, a new shopping mall, One Holland Village, started development which closed down two carparks in the area, leading to parking woes to Holland Village. In June 2025, local daily newspaper, *[The Straits Times](/wiki/The_Straits_Times)*, reported that many shops closed in 2024 and foot traffic had dropped over the years despite the opening of the MRT station in 2011. It was later reported in the same month, restaurant Crystal Jade La Mian Xiao Long Bao and Wala Wala Cafe Bar planned to shutdown within the year after operating for 20 and 32 years respectively. ## Neighbourhoods within the Holland Village area Several areas are considered to be in the Holland Village area. ### Holland Village Holland Village is a crescent-shaped area of shophouses and small malls set around Lorong Liput and Lorong Mambong, surrounded by Holland Road and Holland Avenue. ### Chip Bee Gardens On the other side of Holland Avenue is a neighbourhood of terraced houses and walk-up apartments that was formerly developed as British military housing in the 1950s, but are now managed by the [Singapore Land Authority](/wiki/Singapore_Land_Authority). The terraced houses and walk-up apartments are rented out on a two year lease and to individuals. The estate on Jalan Merah Saga are rented out to businesses. Chip Bee Gardens has a reputation for being an enclave of Western [expatriates](/wiki/Expatriate), although many Singaporeans and other Asians reside there too. ### Holland Close Holland Close is a large [HDB](/wiki/Housing_and_Development_Board) estate located at the southern part of Chip Bee Gardens. Shuang Long Shan, also known as the Holland Close Cemetery, is a cemetery for the Hakka community since the 1960s. ## Food and beverage outlets Many food chains in Singapore, such as [Crystal Jade](/wiki/Crystal_Jade), [The Coffee Bean & Tea Leaf](/wiki/The_Coffee_Bean_%26_Tea_Leaf), Sushi Tei, [Subway](/wiki/Subway_(restaurant)), and [Häagen-Dazs](/wiki/H%C3%A4agen-Dazs), are in Holland Village. A 24-hour [kopitiam](/wiki/Kopitiam), a market and a [food court](/wiki/Food_court) are also present with food stalls selling local and western dishes. Other eating places include [Starbucks](/wiki/Starbucks) and several dessert, [Western cuisine](/wiki/Western_cuisine) and [Japanese cuisine](/wiki/Japanese_cuisine) outlets. The gentrification of the Holland V area is characterised by the more up-market dining options such as the ethnic restaurants as well as franchises such as [Tapas](/wiki/Tapas) Bar. Other prominent bars include Tango's, Baden, Harry's Bar and Wala Wala. Holland Village has a reputation as an expatriate neighbourhood but nevertheless attracts a majority of locals to its pubs and restaurants. The Village has been a cradle for a number of lifestyle trends in Singapore. In the 1980s, Palm's Wine Bar along Lorong Mambong started the trend for wine bars. During that period, other cafes like Better Batters (famous for its butterscotch and other pancakes) and Milano Pizza (which became a successful chain in the 80s) also sprang up in Holland V. In the 90s, the restaurant Original Sin started a wave of upscale vegetarian dining when its Australian-Italian owner introduced Singapore to her first Mediterranean vegetarian dining experience in Chip Bee Gardens. Original Sin's menu was created by co-owner and culinary director, Marisa Bertocchi. From Adelaide in Australia, Marisa worked in many of that city's restaurants and hotels before heading to Singapore where she quickly earned praise for her vegetarian creations at Michelangelo's. Coffee Club, Singapore's first gourmet coffee shop, opened its first outlet in Holland Village in 1991. This was before the arrival of [Starbucks](/wiki/Starbucks), [Coffee Bean](/wiki/The_Coffee_Bean_%26_Tea_Leaf) and TCC years later, while Wala Wala asserted its presence among the rest with a customer base as wide as its range of imported beers and its nightly band performances. Today, the rows of shops along Lorong Mambong and Jalan Merah Saga house some of Singapore's most famous and characteristic pubs and restaurants, many of which are fully booked during weekends. ## Shops and services Holland Village has a variety of commercial amenities. There are four shopping centres in Holland Village: One Holland Village (opened in December 2023), Holland Piazza (opened 2018), Raffles Holland V, [Holland Road Shopping Centre](/wiki/Holland_Road_Shopping_Centre) and Holland V Shopping Mall. Retail establishments are located along four streets and two shopping buildings. These streets are Jalan Merah Saga and Holland Avenue on the same side, and Lorong Liput and Lorong Mambong on the opposite side. The shopping buildings are Holland Road Shopping Centre and Raffles Holland V Mall which is along Holland Avenue, and Holland Piazza along Lorong Liput which that mall opened in January 2019 as the newest shopping mall there as well as One Holland Village Mall in December 2023. These buildings along Holland Avenue are often casually referred to by sales assistants as Holland Village Shopping Centre, which in name is a non-existent landmark. ## Transport Within [Singapore's transport system](/wiki/Transport_in_Singapore), Holland Village is linked to [Orchard Road](/wiki/Orchard_Road) via [Holland Road](/wiki/Holland_Road,_Singapore). [Holland Village MRT station](/wiki/Holland_Village_MRT_station), opened in 2011, is located on the [Circle MRT line](/wiki/Circle_Line_(Singapore)). ## Politics Holland Village is within the [Buona Vista](/wiki/Buona_Vista) division of [Tanjong Pagar Group Representation Constituency](/wiki/Tanjong_Pagar_Group_Representation_Constituency) (GRC), with [Chan Chun Sing](/wiki/Chan_Chun_Sing) being in charge of the division as part of a PAP team since 2011. The constituency was previously a [SMC](/wiki/Buona_Vista_Single_Member_Constituency) until it was absorbed into Tanjong Pagar GRC in 1997, and then carved out to [Holland-Bukit Panjang GRC](/wiki/Holland-Bukit_Panjang_Group_Representation_Constituency) from 2001 to 2006 and [Holland-Bukit Timah GRC](/wiki/Holland-Bukit_Timah_Group_Representation_Constituency) from 2006 to 2011 before returning to Tanjong Pagar in the 2011 elections. ## In media In 2003, the neighbourhood of Holland Village was featured and filmed in an acclaimed [Mediacorp Channel 8](/wiki/Channel_8_(Singaporean_TV_channel)) television series titled *[Holland V](/wiki/Holland_V_(TV_series))*. - [List of restaurant districts and streets](/wiki/List_of_restaurant_districts_and_streets)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:10:11.796285",
  "title": "Holland Village, Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Holland_Village,_Singapore"
}