{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:10:13.708164"
  },
  "content": "* *Holttum Hall** is a historic building in the [Singapore Botanic Gardens](/wiki/Singapore_Botanic_Gardens). Previously the office and laboratory of [Richard Eric Holttum](/wiki/Richard_Eric_Holttum), the director of the gardens, it currently houses the **Singapore Botanic Gardens Heritage Museum**, which is also known as the **SBG Heritage Museum**. ## Description The two-storey building is symmetrical and compact. Its design is inspired by English [Vernacular architecture](/wiki/Vernacular_architecture) with some elements of [Classical architecture](/wiki/Classical_architecture). It features a hipped gable roof and a timber frame porch with a pitched tile roof. ## History The building was constructed in 1920. It served as the office and laboratory of Richard Eric Holttum, who served as the Assistant Director of the gardens from 1922 to 1925, and then as its Director from 1925 to 1949. It was gazetted for conservation by the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) on 23 May 2008, along with eight other buildings within the gardens, including [Burkill Hall](/wiki/Burkill_Hall), Ridley Hall and the E J H Corner House. In April 2013, it was announced that the Singapore Botanic Gardens Heritage Museum would be opened in the building. The museum was to \"showcase the gardens' 154-year-long history. The museum opened on 30 November, featuring interactive exhibitions, plant specimens and artefacts. These included artefacts of businessman [Hoo Ah Kay](/wiki/Hoo_Ah_Kay), who provided the land for the botanic gardens, which were donated by his great-granddaughter. It \"chronicles the evolution of the gardens\". The museum was also accompanied by an eco-gallery, which was the first \"zero-energy green gallery\" in Singapore and was to showcase new greening or botanical exhibitions every six to nine months. The gallery's façade was made of [Hempcrete](/wiki/Hempcrete), reportedly the first building in Singapore to make use of the material. According to *[Time Out](/wiki/Time_Out_(magazine))* \"incorporates solar panel roofs and energy-efficient interior fittings, promoting sustainability.\" The museum was closed for refurbishment in late March 2023 and reopened on 24 June, coinciding with the garden's annual heritage celebration, with new installations and exhibits on newer sections of the garden. 1°18′31″N 103°49′03″E﻿ / ﻿1.30871°N 103.81761°E﻿ / 1.30871; 103.81761\n",
  "language": "en",
  "processed_at": "2026-01-12T11:10:13.707681",
  "title": "Holttum Hall",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Holttum_Hall"
}