{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:10:19.776722"
  },
  "content": "Training institute in SingaporeThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Home Team Academy\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(March 2021)* *(Learn how and when to remove this message)* 1°22′22.40″N 103°43′20.80″E﻿ / ﻿1.3728889°N 103.7224444°E﻿ / 1.3728889; 103.7224444 The **Home Team Academy** (**HTA**) is the training institute for various organisations of the [Ministry of Home Affairs](/wiki/Ministry_of_Home_Affairs_(Singapore)) in [Singapore](/wiki/Singapore), including the [Singapore Police Force](/wiki/Singapore_Police_Force), the [Singapore Civil Defence Force](/wiki/Singapore_Civil_Defence_Force), the [Central Narcotics Bureau](/wiki/Central_Narcotics_Bureau), the [Singapore Prison Service](/wiki/Singapore_Prison_Service), the [Immigration and Checkpoints Authority](/wiki/Immigration_and_Checkpoints_Authority), and the [Internal Security Department](/wiki/Internal_Security_Department_(Singapore)), amongst other agencies. Located at 501 [Old Choa Chu Kang Road](/wiki/Choa_Chu_Kang_Road#Old_Choa_Chu_Kang_Road), it cost about S$266 million to build. It was operational since January 2006, had an operational launch in April 2006, and was officially opened on 2 September 2006 with an open house and concert. ## History Plans for a new training ground to replace the [Old Police Academy](/wiki/Old_Police_Academy) at [Thomson Road](/wiki/Thomson_Road,_Singapore) of the Singapore Police Force laid the foundation for the development of the HTA. When plans were mooted to incorporate other organisations involved in law enforcement, such as the [auxiliary police](/wiki/Auxiliary_police) forces, the facility was tentatively named as the Law Enforcement Academy of Singapore (or LEAS for short). Subsequent changes, which also include the training schools of other \"Home Team\" organisations, led to a renaming of the complex to the Home Team Academy. On 31 December 2005, a \"moving parade\" was conducted by the police force to signify its transition from the old academy to the new HTA. Police National Service Full-Time trainees of 121st intake and 42nd OCT batch was the last batch to pass out in the academy. After a simple parade at the old parade grounds, officers did a relay run of 42 kilometres to the [Choa Chu Kang](/wiki/Choa_Chu_Kang) complex, where another parade was held. The police's Training Command thus began operations in the new academy from the beginning of 2006. The old premises was renamed the [Old Police Academy](/wiki/Old_Police_Academy) by mid-2006. The Academy took in its second batch of Police [National Service](/wiki/National_Service) Full-time trainees of the 123rd intake, which graduated with a passing out parade on 6 July 2006. The Prison Staff Training School and the Immigration & Checkpoints Authority Training and Development Branch fully shifted all operations to HTA by February 2006. HTA had its operational launch in April 2006, and was declared officially opened on 2 September that year by [Deputy Prime Minister](/wiki/Deputy_Prime_Minister) and [Minister for Home Affairs](/wiki/Minister_for_Home_Affairs), Mr [Wong Kan Seng](/wiki/Wong_Kan_Seng). ## Organisation Other Home Team agencies maintain an 'off-campus' presence for their training schools, e.g. SCDF's Civil Defence Academy. Although the individual training schools maintain their training focus on their respective duties, the Home Team Academy seeks to harness aspects of training and knowledge from each agency and to share this across all the departments within the Home Team. It aims to develop new knowledge and skills, especially in the area of homefront security which may cut across all agencies. It also develops training programs with an inter-agency or multi-agency focus. The Home Team Cadet Corps Headquarters (HTCC HQ) is co-located within the Academy, overseeing the managerial and administrative functions of the [National Police Cadet Corps](/wiki/National_Police_Cadet_Corps) and the [National Civil Defence Cadet Corps](/wiki/National_Civil_Defence_Cadet_Corps). ## Architecture and design Aside from containing lodging facilities for trainees, classrooms, a library and sports facilities, the Academy also contains a Training Village housing simulated facilities for trainees to undergo scenario-based training as part of efforts to inject realism into training. The purpose-built Training Village includes a \"commercial and entertainment zone\", and a \"residential zone\". The former has settings such as a bank, a KTV outlet, a food court, a jewelry shop and an MRT carriage and platform. The latter is a four-storey high HDB block with various apartment types for police training. Other facilities include a mock prison wing for prisons officer to be taught prison routine, inmate control and management, as well as simulated border checkpoint for skills training in immigration clearance. In addition, there are purpose-built outdoor training facilities to train specific skills. For example, the Police Standard Obstacle Course is designed to build up physical fitness and agility, while based on frontline police officers' operational environment. The Experiential Learning Course is a high-rope obstacle course, where participants engage in various hands-on activities and gain insights into leadership, group problem solving, teamwork and communication skills. - Official site - Home Team agencies to be trained, housed under one roof Archived 13 March 2007 at the [Wayback Machine](/wiki/Wayback_Machine) - Knowledge is the Key - The Role of the Home Team Academy - \"Effective on Its Own, Excelling as A Team\" - The Home Team Academy opens its Doors\n",
  "language": "en",
  "processed_at": "2026-01-12T11:10:19.776257",
  "title": "Home Team Academy",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Home_Team_Academy"
}