{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:10:21.722653"
  },
  "content": "2003 Singaporean TV series or program ***Home in Toa Payoh*** is a Singaporean Chinese drama which had its original run telecast in December 2003. The drama is produced by Singapore's [MediaCorp TV Channel 8](/wiki/Channel_8_(Singaporean_TV_channel)). It was re-aired in 2007 on every weekday, 5.30pm on Channel 8. ## Synopsis The first four minutes of the first episode introduces [Toa Payoh](/wiki/Toa_Payoh), one of Singapore's oldest estates, and chronicles its development from a small \"[kampung](/wiki/Kampung)\" along swampy marshland to a modernised thriving neighbourhood. The series depicts life in a typical [HDB](/wiki/Housing_and_Development_Board) estate. Baomei, Pengkun and Guocheng are childhood friends who grew up together in Toa Payoh. Baomei is an overly thrifty bachelor who is a foreman at a factory. Pengkun is a top technician at Baomei's factory but is always skiving to return home early to be with his wife and children. Guocheng is a highly successful insurance salesman with a loving but constantly nagging wife Huiming. The three of them and their families have to put up with the gossipy and quarrelsome Auntie Fen who often argues with Guocheng's father-in-law. ## Cast ### Main cast - [Li Nanxing](/wiki/Li_Nanxing) as Li Baomei \"Ah Bee\" (李保美) - [Cavin Soh](/wiki/Cavin_Soh) as Zhou Pengkun (周朋琨) - [Huang Yiliang](/wiki/Huang_Yiliang) as Yuan Guocheng (袁国程) - [Huang Biren](/wiki/Huang_Biren) as Zheng Huiming (郑惠明) \"Kaypoh Queen\" - [Fiona Xie](/wiki/Fiona_Xie) as Yuan Shuhuai (袁淑怀) - [Mimi Chu](/wiki/Mimi_Chu) as Wu Lifen \"Elephant\" (吴立纷) ### Supporting cast - [Li Wenhai](/wiki/Li_Wenhai_(actor)) as Zheng Daba (郑大跋) - [Yang Libing](/wiki/Yang_Libing) as Wu Jinxiu (吴锦绣), Lifen's niece - [Zen Chong](/wiki/Zen_Chong) as Dino - Liang Tian as \"Ninth Uncle\" (九叔) - [Rayson Tan](/wiki/Rayson_Tan) - [Yan Bingliang](/wiki/Yan_Bingliang) as factory boss - [Margaret Lee](/wiki/Margaret_Lee_(Singaporean_actress)) as Qunying - *Home in Toa Payoh* (English) - *Home in Toa Payoh* (Chinese) - *Home in Toa Payoh* (mewatch) This Singaporean television-related article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:10:21.722076",
  "title": "Home in Toa Payoh",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Home_in_Toa_Payoh"
}