{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:10:17.825781"
  },
  "content": "This article **is written like a personal reflection, personal essay, or argumentative essay** that states a Wikipedia editor's personal feelings or presents an original argument about a topic. Please help improve it by rewriting it in an encyclopedic style. *(March 2025)* *(Learn how and when to remove this message)* The **Home Improvement Programme** (HIP) was introduced by the [Housing Development Board](/wiki/Housing_and_Development_Board) (HDB) in August 2007, during Singapore's [National Day Rally](/wiki/National_Day_Rally). It replaced the earlier [Main Upgrading Programme](/wiki/Main_Upgrading_Programme) (MUP), which operated from 1990 to 2007. The HIP focuses on addressing common maintenance issues that arise in ageing HDB flats, such as spalling concrete, ceiling leaks, and outdated infrastructure. It offers essential and optional upgrades tailored to flats, where essential improvements are fully subsidised by the government, while optional improvements require co-payment from residents. Flats are eligible for HIP twice: once at 30 years old, and again between 60 and 70 years old. Initially, HIP targeted flats built before 1997, but the scope has since expanded to cover more flats. The programme's objective is to ensure the long-term sustainability of Singapore's public housing stock. HIP adopts a polling process, where at least 75% of Singaporean households in a block must vote in favour of the upgrading works before it can proceed. In 2012, HIP was expanded to include the Enhancement for Active Seniors (EASE) programme, offering elderly-friendly improvements, such as [grab bars](/wiki/Grab_bar), [ramps](/wiki/Inclined_plane), and [slip-resistant](/wiki/Fall_prevention) flooring. By 2024, over 410,000 flats had been upgraded, with the government investing approximately S$4 billion. The programme's effectiveness has been bolstered by grassroots organisations and community engagement efforts. ## History In August 2007, [Prime Minister](/wiki/Prime_Minister_of_Singapore) [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) in his [National Day Rally](/wiki/Singapore_National_Day_rally) speech introduced the HIP which would replace the [Main Upgrading Programme](/wiki/Main_Upgrading_Programme) which started from 1990. Initially targeted at 320,000 flats built before 1986, HIP shifted focus to in-unit upgrades rather than large-scale precinct improvements, aiming to improve specific flat issues like concrete repairs, pipe replacements, and electrical upgrades. The programme's core elements included essential improvements with fully subsidised repairs deemed necessary for public health and safety, such as replacing waste pipes and repairing spalling concrete and optional improvements such as modernisation of toilets, replacement of entrance doors, and installation of retractable clothes drying racks to be decided by residents. In March 2012, the EASE Programme was launched, offering modifications specifically aimed at improving accessibility and comfort for elderly residents. EASE can be opted into during HIP or applied separately by households whose flats have not yet undergone HIP. In 2018, the government expanded HIP to include 230,000 flats built between 1987 and 1997, broadening the programme’s reach and bringing the total number of eligible flats to over 550,000. The 75% polling requirement for residents to approve HIP works remained in place. In 2020, HIP underwent a refresh to include more durable materials and modern features for optional improvements. During the 2023 [National Day Rally](/wiki/Singapore_National_Day_rally), EASE *2.0* introduced more advanced senior-friendly improvements. These include wider toilet entrances for wheelchair users and foldable shower seats. The initiative was part of broader efforts to enhance the quality of life for seniors, alongside other infrastructure upgrades like the installation of more rest points, shelters, and improved safety measures along frequently used walkways and streets. In 2024, the Singapore government announced that 53,000 flats built before 1997 had been selected for HIP in the latest round of upgrades. This batch covered flats in estates such as [Jurong West](/wiki/Jurong_West), [Hougang](/wiki/Hougang), [Woodlands](/wiki/Woodlands,_Singapore), and [Pasir Ris](/wiki/Pasir_Ris), with the government allocating S$742 million for the exercise. By this time, HIP had upgraded over 370,000 flats, with a total investment of more than S$4 billion since the programme’s inception. ## Future plans HIP II is planned to provide a second round of upgrades to flats that are 60 to 70 years old, ensuring they remain safe and livable throughout their 99-year lease. HIP II will focus on addressing any structural [wear and tear](/wiki/Wear_and_tear) that may have developed since the first round of upgrades, as well as incorporating newer technologies and features in line with evolving housing needs. ## Process of HIP HIP follows a structured, resident-driven process that ensures upgrades are efficiently carried out while minimising disruption to daily life. The process emphasises transparency, thorough pre-construction assessments, and active resident participation. Precincts are selected based on the age of the flats (typically those that are at least 30 years old) and their maintenance needs. Flats that have not yet undergone major upgrading works or have recurring maintenance issues, such as spalling concrete or outdated infrastructure, are prioritised. Once a precinct is selected, [HDB](/wiki/Housing_and_Development_Board) publicly announces it and notifies residents through official letters detailing the proposed improvements and the next steps. HDB will then conduct informational surveys and holds mini [exhibitions](/wiki/Exhibition) before polling. These exhibitions showcase the optional improvements available to residents, such as modernised toilets, new entrance doors, and retractable clothes drying racks. The exhibitions allow residents to view [mock-ups](/wiki/Mockup) of the proposed improvements, interact with HDB officers, and ask questions, helping them make informed decisions ahead of the polling process. Once the mini exhibition is completed, HDB issues an official Polling Notice to all eligible households within the precinct on voting for the HIP works. The polling process takes place over three to four days, and residents can cast their votes either in person at polling centres or online. For HIP to proceed, at least 75% of the households in the block must vote in favour. Households will be notified of the polling results within two weeks after the polling ended. If the HIP failed to proceed, the block would still be eligible for HIP in the future. If voted in favour of the HIP, residents are given six weeks to select optional improvements and EASE modifications. They can make their selections either in person at Information Centres set up near the precinct or online. Optional improvements include modernised toilets, fire-rated doors, and retractable clothes drying racks. EASE modifications, such as grab bars and ramps, are offered to elderly residents. Before construction begins, HDB conducts a condition survey to assess the current state of each flat and identify any repairs that need to be made. Additionally, for residents opting out of toilet upgrades, a water test is required to ensure there are no [leaks](/wiki/Leak) that could affect the flat below. If the toilet fails the water test, the toilet upgrading becomes mandatory. Approximately four months after the polling process, the upgrading works commence. Upgrading works are expected to be completed in 10 working days. Once the works are completed, HDB conducts a final inspection to ensure all improvements meet quality standards. Residents are encouraged to inspect their flats and report any defects during the one-year Defect Liability Period, during which contractors will fix any issues free of charge. After the completion of all upgrading works, HDB sends an invoice detailing each household’s cost for optional improvements. Payment is required only after the works have been completed. Residents can pay via [CPF](/wiki/Central_Provident_Fund), cash, or through a flexible instalment plan. HDB offers [financial assistance](/wiki/Subsidy) for low-income households and senior citizens, ensuring affordability ## Scope of Works Sources: HIP provides residents with a mix of essential improvements, which focus on critical safety and maintenance issues, and optional improvements that allow for customisation according to individual needs. Additionally, the EASE programme offers modifications to make homes more elderly-friendly, improving accessibility and comfort for older residents. ### Essential Improvements Once a block has been selected for HIP and the required polling threshold is met, essential improvements become **mandatory**. These are fully funded by the government and address key issues related to the safety, health, and structural integrity of ageing flats. The primary goal of these improvements is to tackle common maintenance problems in older buildings, ensuring that flats remain livable and structurally sound as they age. Key essential improvements include: - **Spalling Concrete Repair**: Singapore’s humid climate often causes spalling concrete due to the corrosion of steel reinforcement within the ceiling slabs. HIP addresses this by removing the damaged concrete, treating the steel bars with anti-corrosion measures, and using the Corrosion-Resistant Repair (CRR) Method to reduce the likelihood of future occurrences. - **Structural Crack Repair**: Over time, cracks can appear in the structure of older buildings, weakening their integrity. HIP addresses these structural issues, ensuring that the flats remain stable and safe for residents. - **Replacement of Waste Pipes**: Older flats often have waste pipes made of cast iron or other materials that deteriorate over time, leading to leaks and blockages. These are replaced with modern [UPVC](/wiki/UPVC) pipes to improve sanitation and prevent plumbing issues. - **Replacement of Pipe Sockets and Installation of New Clothes Drying Racks**: Aging or damaged pipe sockets are replaced to ensure better drainage. Additionally, new clothes drying racks are installed, with HDB determining the appropriate type for each flat based on factors like the building's design and layout. Different racks may be installed across flats within the same precinct, depending on these considerations. - **Upgrading of Electrical Supply**: Many older HDB flats have limited electrical capacity, insufficient to meet the demands of modern appliances and devices. HIP upgrades the electrical systems in these flats, allowing for higher load capacity and ensuring safe usage of contemporary home electronics. These essential upgrades are crucial for keeping older HDB flats in line with modern safety standards and providing a safe and comfortable living environment for all residents. ### Optional Improvements In addition to the essential improvements, residents can opt for a variety of optional enhancements, which are heavily subsidised by the government. While residents are required to co-pay for these improvements, the government bears a significant portion of the cost. Optional improvements allow for increased comfort, safety, and aesthetic appeal, and they include: - **Toilet Upgrades**: Residents can modernise their toilets with upgraded sanitary fittings, larger tiles for both the floor and walls, and better waterproofing systems. This option helps prevent leaks, which can damage flats below. If residents choose not to upgrade their toilets, the existing fixtures must pass a water leak test to ensure there are no leaks. - **Replacement of Entrance Doors**: Residents may replace their old entrance doors with new fire-rated doors, designed to withstand high temperatures and comply with current fire safety standards. For flats that do not require fire-rated doors, non-fire-rated alternatives are available. The installation of a Home Fire Alarm Device (HFAD) may also be included as part of this improvement. - **New Grille Gates**: Modern steel gates equipped with thumb-turn knobs for easy unlocking from the inside are available as an optional improvement. These provide enhanced security and greater convenience for residents. - **Replacement of Refuse Hopper Covers:** Older [refuse hopper covers](/wiki/Waste) that contribute to odour and pest issues can be replaced with newer, more hygienic models. This optional upgrade is aimed at improving the overall cleanliness and living conditions in the block. - **Retractable Clothes Drying Racks**: Traditional bamboo pole holders can be replaced with modern retractable racks featuring stainless steel poles. These racks can be extended and retracted easily, offering a safer and more convenient way for residents to dry clothes, especially for elderly residents who may find the old system difficult to use. Residents who opt for these optional improvements benefit from government subsidies, with their co-payment depending on their flat type. The following table outlines the [cost-sharing](/wiki/Cost_sharing) ratios and estimated costs for the optional improvement package: Flat TypeCo-Payment RatioEstimated Amount Payable* (with fire-rated main door & HFAD)Estimated Amount Payable* (with non-fire-rated main door)1/2/3-Room Flats5%S$599.50S$594.054-Room Flats7.5%S$899.25S$891.055-Room Flats10$S$1199.00S$1188.10Executive Flats12.5%S$1498.75S$1485.10 *These estimates are based on HIP projects that began polling after 30 March 2020 and include 9% GST. The final amount will be determined after the completion of the upgrading works. ## Financial Assistance For households that may struggle with payment, HDB offers several assistance schemes. Residents earning a monthly household income of less than S$2,000 can extend their payment period for up to 25 years. Elderly residents aged 55 and above can defer their payments until the flat is sold or transferred, subject to specific CPF guidelines. In cases of financial hardship, HDB may allow for a deferment of payment, with interest, subject to an annual review. Residents in need of financial assistance can also visit here for more details and information. ## Impact on Residents: Noise, Dust and Inconvenience Sources: Although HIP significantly enhances the living conditions in older flats, the construction phase can create temporary disruptions for residents. These disturbances, while unavoidable, are managed through a series of measures aimed at minimising the impact. - **Noise Control:** To reduce the noise caused by hacking, drilling, and other construction activities, contractors use specialised equipment such as dust extractors and noise-reducing tools. Smaller breakers are deployed where feasible to lower the intensity of the noise. - **Dust Management:** Dust screens are installed around the construction site, and contractors clean the workspace regularly to control dust accumulation. Residents are provided with dust proof materials, such as protective covers, to safeguard their furniture and belongings. - **Furniture Protection**: To prevent damage during the renovation, contractors lay vinyl or rubber sheets on the floor to protect tiles. Residents are also advised to secure their valuables and electronics, ensuring they are not affected by the construction work. ### Temporary Facilities provided during Construction Source: HDB also provides several temporary amenities to alleviate the inconvenience residents may experience during the construction phase. - **Portable Toilets and Showers**: Flats undergoing toilet renovations receive portable toilet units with hot water installed within the flat, ensuring residents still have access to essential facilities throughout the upgrade. - **Void Deck Toilets**: Additional temporary toilets are installed at the void deck for use during working hours, offering residents an alternative while their bathrooms are being renovated. - **Air-Conditioned Rest Areas**: To provide a quiet and comfortable environment away from the noise and dust of construction, air-conditioned rest areas equipped with Wi-Fi and study spaces are set up at the void deck. ## Common Challenges and Solutions during HIP Even with careful planning, challenges may arise during the HIP construction process. To address these issues, HDB and contractors collaborate closely with residents to provide solutions: - **Scheduling Conflicts**: Some residents may have conflicting schedules due to work, travel, or personal commitments. In such cases, HDB offers flexibility in adjusting construction schedules to accommodate residents’ availability where possible. - **Accessibility Issues for Elderly Residents**: Elderly residents may find it challenging to navigate around the construction area. To address this, HDB provides temporary ramps and mobility aids to ensure that seniors can move around safely and comfortably during the renovation period. - **Coordination with Multiple Contractors**: With various contractors handling different parts of the HIP process, communication and coordination are crucial. To streamline the process, HDB appoints a Public Relations Officer (PRO) who serves as a point of contact between residents and contractors, ensuring smooth communication and a quick resolution to any issues that may arise. ## Technological Advancements in HIP Over the years, HIP has embraced various technological innovations that not only enhance the efficiency and quality of the construction process but also minimise disruption to residents. These advancements reflect a commitment to addressing the needs of ageing flats in a sustainable, cost-effective manner. ### Introduction of the Corrosion-Resistant Repair (CRR) Method Source: One of the most notable technological developments in HIP is the **Corrosion-Resistant Repair (CRR) Method**, which was introduced in 2021 to tackle the persistent issue of spalling concrete, particularly in toilet ceilings. Spalling concrete is caused by the corrosion of steel reinforcement bars within the ceiling, exacerbated by Singapore's humid climate. The CRR method consists of: - **Anti-Corrosion Coating**: The steel bars in the ceiling are treated with a specialised anti-corrosion coating, protecting them from moisture and corrosive elements, which significantly reduces the likelihood of future corrosion. - **Protective Ceiling Layer**: A protective layer is applied over the ceiling after the steel reinforcement has been treated, enhancing its durability and preventing further spalling. - **Bonding Agents**: Advanced bonding agents are used to secure the new layers to the existing ceiling structure, ensuring the repair is long-lasting. This innovative method was trialled in 2021 in over 300 flats and has since become a standard technique in HIP for managing spalling concrete, one of the most common maintenance issues in ageing HDB flats. ### Upgraded Fire Safety Features Source: As part of HIP, fire safety features have been modernised in line with current safety regulations. One key improvement is the inclusion of fire-rated doors as an optional upgrade. These doors are designed to withstand high temperatures and offer critical protection during a fire. Another advancement is the installation of the Home Fire Alarm Device (HFAD), which is aligned with the [Singapore Civil Defence Force (SCDF)](/wiki/Singapore_Civil_Defence_Force) fire safety standards. Key features of the fire-rated doors include: - **Heat Resistance**: These doors are engineered to delay the spread of fire, providing residents with additional time to evacuate safely during an emergency. - **Durability**: Fire-rated doors are made from materials that are more resistant to wear and tear, offering enhanced longevity in addition to fire safety. **Enhanced Locking Mechanism**: Modern locking mechanisms provide both improved security and fire protection for residents. ### Modernised Clothes Drying Systems Source: In response to the outdated bamboo pole system commonly used in older flats, HIP has introduced retractable clothes drying racks. These new systems are safer and more convenient, especially for elderly residents. The key features include: - **Retractable Design**: The drying racks are fitted with stainless steel poles that can be easily extended or retracted, allowing residents to hang laundry without needing to reach outside windows, as was required with the older bamboo pole holders. - **Improved Safety**: The retractable design greatly reduces the risk of accidents that could occur with traditional systems, which often required residents to lean out of windows to hang their laundry. **Durability**: Made from rust-resistant materials, the modern clothes drying racks are designed to withstand Singapore’s humid climate and require minimal maintenance. ### Use of Augmented Reality (AR) for Resident Visualisation Source: To make the decision-making process easier for residents, HDB introduced Augmented Reality (AR) technology through the Mobile@HDB app. This tool allows residents to visualise and virtually place various HIP improvement options, such as grab bars, ramps, and doors, within their flats. Benefits of AR in HIP include: - **Interactive Visualisation**: Residents can see how optional improvements would look in their homes before making a decision, helping them select the upgrades that best suit their needs. - **Ease of Use**: The AR tool can be accessed from home, allowing residents to make informed decisions without the need to visit exhibitions or information centers. **Improved Accessibility**: The AR tool provides elderly and less mobile residents with an easy way to explore HIP options without physically leaving their flats. ### Energy Efficiency and Sustainability As part of Singapore's broader effort toward sustainability, HIP incorporates various energy-efficient solutions aimed at reducing the environmental footprint of public housing. These solutions not only lower energy consumption but also contribute to more sustainable living. - **Upgraded Electrical Systems**: Modern electrical systems are installed in older flats, allowing residents to use energy-efficient appliances without overloading the system. - **Water-Efficient Fittings**: Upgraded toilets offered through HIP include water-saving features such as dual-flush systems, which help reduce water consumption. - **Sustainable Materials**: Wherever possible, HIP uses sustainable materials for doors, tiles, and fixtures, ensuring that the upgrading process aligns with Singapore’s long-term environmental goals. ### Adoption of Smart Home Features Looking ahead, HDB is exploring the integration of [smart home](/wiki/Smart_home) technologies in upcoming HIP projects. These features could include: - **Smart Lighting and Energy Management**: Future HIP projects may offer smart lighting systems that adjust based on occupancy or daylight, optimising energy consumption. - **Smart Security Systems**: Enhanced security features, such as app-controlled locks and surveillance systems, may be integrated into upgraded flats, providing residents with greater security and peace of mind. - **Remote Monitoring for Seniors**: In conjunction with the EASE programme, HDB is exploring the possibility of smart sensors that monitor the well-being of elderly residents, sending alerts to caregivers in the event of falls or emergencies. ## Criticism The programme has sparked some political debate regarding priority, which has traditionally been given to wards held by the ruling [People's Action Party](/wiki/People%27s_Action_Party). When asked why opposition wards are penalised by the statutory board at a [National University of Singapore](/wiki/National_University_of_Singapore) student forum in 2011, then Prime Minister [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) responded, \"The answer is that there has to be a distinction. Because the PAP wards supported the Government and the policies which delivered these good things.”\n",
  "language": "en",
  "processed_at": "2026-01-12T11:10:17.825306",
  "title": "Home Improvement Programme",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Home_Improvement_Programme"
}