{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:10:23.797985"
  },
  "content": "Library in Kent Ridge, Singapore **Hon Sui Sen Memorial Library** is a library on Hon Sui Sen Drive within the [Kent Ridge](/wiki/Kent_Ridge) campus of the [National University of Singapore](/wiki/National_University_of_Singapore). It was built in honour of [Hon Sui Sen](/wiki/Hon_Sui_Sen) who served as the [Minister for Finance](/wiki/Ministry_of_Finance_(Singapore)) from 1970 to 1984. ## History On 7 January 1984, [Goh Chok Tong](/wiki/Goh_Chok_Tong), then-[Minister for Defence](/wiki/Ministry_of_Defence_(Singapore)) and Second [Minister for Health](/wiki/Ministry_of_Health_(Singapore)), announced that a library would be built at the School of Management of the National University of Singapore in memory of Hon Sui Sen, who served as the Minister for Finance, as well as a [Member of Parliament](/wiki/Parliament_of_Singapore) representing the [Havelock Constituency](/wiki/Havelock_Constituency), and who had died in the previous year. Goh also announced that the Havelock Constituency and the Civil Service had established a fund for the construction of the building. The fund's committee included [Ngiam Tong Dow](/wiki/Ngiam_Tong_Dow), who served as its chairman, as well as Parliamentary Secretary Lee Yiok Seng, Ng Choon Ser, [J. Y. Pillay](/wiki/J._Y._Pillay) and Hsu Tse Kwang. Construction of the library, which was designed by the [Public Works Department](/wiki/Public_Works_Department_of_Singapore), was estimated to cost around $10 million. It was also estimated that the library, which would hold 50,000 to 60,000 volumes, the contents of which were to reflect Hon's interests, would cost $1 million to operate annually. The *[Lianhe Zaobao](/wiki/Lianhe_Zaobao)* reported that the library was to \"become a specialised centre providing information on banking, finance, insurance and public administration for the region\", and that, through computers and electronic communication devices, it would be \"linked with similar data centres all over the world for instantaneous first-hand materials.\" In March, the Havelock Constituency allocated $1 million of its Welfare and Scholarship Fund to the library's building fund. By May, the fund had collected over $3 million. The top donor then was National Iron and Steel Mills, which had donated $1 million. On 5 October, Annie Hon, the wife of Hon Sui Sen, laid the building's foundation stone. Work on the site had begun and piling was expected to begin in December. The building would also house a 300-seat auditorium and a room showcasing Hon's memorabilia. Hon's [Darjah Utama Temasek](/wiki/Darjah_Utama_Temasek), [Meritorious Service Medal](/wiki/Pingat_Jasa_Gemilang), [Distinguished Service Medal](/wiki/Darjah_Utama_Bakti_Cemerlang) and personal seal, all of which were donated by his family, were among the items that were to be displayed in this room. In August 1985, it was announced that Metrobilt Construction Pte. Ltd. had been awarded a $7 million contract to build the three-storey building. Construction on the building, which was then estimated to cost more than $8 million, was scheduled for completion in October 1986. By then, the fund had raised around $7 million. The building was completed in January 1987 for $8.5 million. The handing over ceremony, during which Huang Hsing Hua, then the Deputy Vice-Chancellor of the university, would receive the keys to the library from Tan Swan Beng, then the Director General of the Public Works Department, was scheduled for 10 January. However, the event was postponed to 12 January. The library started operations on 15 June. It was officially opened on 15 January 1988 with a collection including 30,000 books and bound journals by Goh Chok Tong. A bust of Hon was placed in the memorabilia room. The library underwent a facelift in 2021, after which the third and second floors were converted into seminar rooms. The Hon Sui Sen Memorial Room and its memorabilia collection were moved to the library's first floor. In February 2024, Indonesian coffee chain [Tomoro Coffee](/wiki/Tomoro_Coffee) opened its first Singaporean outlet at the library.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:10:23.797492",
  "title": "Hon Sui Sen Memorial Library",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Hon_Sui_Sen_Memorial_Library"
}