{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:10:25.836677"
  },
  "content": "Asian online grocery and delivery business **Honestbee** (stylised as **honestbee**) was a [Singaporean](/wiki/Singapore) [online grocery](/wiki/Online_grocer) and [delivery](/wiki/Delivery_(commerce)) service provider. The company provided [personal shoppers](/wiki/Personal_shopper) that pick products for its clients. Consumers utilized the company's [mobile app](/wiki/Mobile_app) or website to interface with the company, and the store pickers and retail stores also utilized the mobile app. In Singapore, honestbee also provided laundry collection services. ## History Honestbee was launched in Singapore on 23 July 2015 and after that time also launched in Hong Kong, Taiwan, Thailand, Indonesia, Malaysia, Bangkok, Philippines and Japan. The company was founded by [Joel Sng](/wiki/Joel_Sng), Isaac Tay, and Jonathan Low and had backing from venture capital companies in Asia and the United States. In 2018, honestbee launched an online and offline grocery store in Singapore called habitat, which aimed for \"more human engagement\" for shoppers; habitat was described as their \"crowning jewel\". Co-founder Isaac Tay left the company in September 2018. Observers had speculated from early 2019 that honestbee was in a dire financial situation and was in talks with other companies such as [Grab](/wiki/Grab_(company)) and [Gojek](/wiki/Gojek) over a potential acquisition. The company stopped its food delivery service and suspended its laundry service in May 2019; the company also began suspending or closing its overseas operations in April that year, with operations suspended in Thailand and the Philippines in April and Hong Kong, Japan and Indonesia in May. CEO Joel Sng departed the company in May 2019; he was replaced by Bon-woong \"Brian\" Koo as interim CEO, who had said that he would be working with the executive team to conduct an in-depth review of the business and to \"align their strategic interests across their various geographies and verticals\". Koo would be replaced as CEO by Ong Lay Ann in July 2019, with Koo becoming chairman; Koo would later resign in September 2019 but remained a key investor in the company. Co-founder and CTO Jonathan Low left the company in July 2019, being the last of the company's founders to depart. The company was granted a four-month extension of their [debt moratorium](/wiki/Debt_moratorium) in September 2019. A US-based company, FLK Holdings, led by key investor Koo, invested in honestbee in January 2020 in an attempt to incorporate a private entity where honestbee's assets would be transferred. Due to reduced footfall caused by the [COVID-19 pandemic](/wiki/COVID-19_pandemic), honestbee announced a temporary closure of habitat; this closure would ultimately become permanent although honestbee never officially acknowledged this, although it was reported that they had considered doing so due to high overhead costs and were clearing out the premises by late-February 2020. By March 2020, the company had retrenched 80% of its workforce and was delaying employees' salaries and [CPF](/wiki/Central_Provident_Fund) contributions. An email issued the same month stated that FLK Holdings and Formation Group, another company owned by Koo, were considering withdrawing their investment due to the intensifying COVID-19 pandemic \"and the resulting uncertainties\", with honestbee requesting an adjournment of their hearing in an attempt to restructure their debts but this was dismissed by the high court. In April 2020, honestbee creditor Benjamin Lim applied to wind up the company. The company was subsequently issued a liquidation order in July 2020; the site formerly occupied by habitat is currently used by [RedMart](/wiki/Lazada_Group) as a fulfillment center for their deliveries. Formation Group, honestbee's sole secured creditor, managed to recover about S$700,000 worth of assets from the company in 2023, while BDO LLC, the liquidator appointed to the case, could only recover about S$720 \"from excess payments related to electrical supplies\". BDO would seek approval from the High Court to discharge itself from any further responsibilities and dissolve honestbee the same month, owing to the company's inability to settle any outstanding debts. ## Services ### Grocery Partnering both supermarkets and specialty stores, customers were able to shop a range of grocery options. Brands such as [FairPrice](/wiki/Fairprice), Jones the Grocer, [Tesco](/wiki/Tesco), and Emporium Shokuhin were available on their platform. The grocery business was available in the 8 countries in which honestbee operated. ### Food honestbee launched their food delivery service in February 2017. First launched in [Singapore](/wiki/Singapore), the service was then rolled out in Taiwan, Malaysia, Japan, Hong Kong, Philippines, and Thailand. They were an exclusive partner for [MOS Burger](/wiki/MOS_Burger) from May 2018 to 2019, when their food delivery service ceased. ### Laundry Launched in September 2016, the honeybee laundry service was only available in Singapore. Customers were able to get their laundry picked up, cleaned, and delivered back in 2 days time. Their pickup and delivery time for laundry service was from 1pm to 10pm (GMT+8), every day. This service was suspended in May 2019 as part of a company restructuring. ### Tickets Launched in late 2017, the Ticketing service was only available in Singapore. Customers were able to purchase tickets to [WE Cinemas](/wiki/WE_Cinemas), direct from the app. It also served as an aggregator of movie timings across multiple cinema chains in Singapore. This service was \"temporarily suspended\" in 2018. ## Presence honestbee was operational in eight regions in Asia: - Singapore (ended July 2020) - Malaysia (ended July 2019) - Thailand (ended April 2019) - Indonesia (ended May 2019) - Japan (ended April 2019) - Philippines (ended April 2019) - Hong Kong (ended May 2019) - Taiwan (ended July 2019) ## Controversy ### April fool's prank In late March 2016, honestbee announced a partnership with \"Explorer Joe Exotic Meats\" (later revealed to be fictitious), which would allow customers to purchase meat from endangered animals including pandas and whales. While the company eventually claimed its intention all along had been to \"bring awareness\" and stimulate conversation about the plight of endangered species, the company faced backlash from the public both before and after the revelation that the campaign was a hoax, with a number of customers saying they would boycott the service. ### Worker pay In 2015, honestbee stated it was paying Singapore workers \"up to SGD $14 (about $10) an hour;\" by May 2016, however, workers countered that the company had lowered the \"basic rate\" twice, from $7.50 to $6 and then $5, and that there were also issues with payroll being late or miscalculated. ### Breach of fiduciary duties Honestbee CEO and co-founder [Joel Sng](/wiki/Joel_Sng) was able to net millions of dollars in funding for the company. But rather than building the startup, he bought a house in Japan, rented apartments in various cities, and spent millions renovating physical offices—first revealed in 2019 by Tech in Asia. In March 2020, Honestbee filed a lawsuit against Sng for an \"alleged breach of fiduciary duties\", including purchasing a private property using company funds and incorporating a shell company called PayNow that Honestbee subsequently bought over. Sng was declared bankrupt in May 2022. Portals: - Companies - Food - Singapore - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:10:25.836143",
  "title": "Honestbee",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Honestbee"
}