{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:10:27.784169"
  },
  "content": "Singaporean singer (born 1981) **Hong Junyang** (born **Ang Junyang**; 17 August 1981) is a Singaporean singer, songwriter, record producer and businessman. ## Education Hong studied at [Saint Andrew's Junior College](/wiki/Saint_Andrew%27s_Junior_College) and [National University of Singapore](/wiki/National_University_of_Singapore). ## Career ### Singing career Hong was a contestant on *[Project SuperStar 2005](/wiki/Project_SuperStar_2005)*, organized by [MediaCorp](/wiki/MediaCorp), and was runner-up of the male category in the finals. After the competition, he signed a recording contract with [Universal Music](/wiki/Universal_Music). He has also hosted television programmes such as *SuperFunkies* and *[Campus SuperStar](/wiki/Campus_SuperStar)*. His debut album *Du Jiao Shou* (独角兽) was released on 26 May 2006. At one point, Hong relocated to [Taipei](/wiki/Taipei), Taiwan to pursue his career as a freelance music producer and songwriter. As of September 2023, Hong is managed by Cross Ratio Entertainment and AGNT. ### Business ventures In 2018, Hong started The Original Boat Noodle, a Thai street food restaurant with two other partners. As of April 2021, it was expanded to four restaurants. In 2020, Hong opened a branch of Taiwanese bubble tea outlet Machi Machi in Singapore. It was reportedly closed in 2025. In 2021, Hong started an Indian banana leaf rice restaurant Bananabro, an Indian franchise from Malaysia, in Changi. It was shut down in 2022. He also owns the café-cloud kitchen Caf (short for \"Clickafood\") and is an investor of bubble tea outlet Machi Machi. In July 2023, Hong opened a Korean food stall named Oppa Kitchen at the coffeeshop co-owned by [Chew Chor Meng](/wiki/Chew_Chor_Meng), [Dennis Chew](/wiki/Dennis_Chew) and Maureen Ow (Miss Tam Chiak). It was closed in 2024. In 2025, Hong announced that he was declared bankrupt after his Thai restaurant chain *The Original Boat Noodle* failed. ## Personal life Hong and Candyce Toh met on *Project SuperStar* in 2005 and married in 2009. Their first daughter, Azalea, was born in April 2016. On 12 August 2022, they had another daughter, named Alessia. Hong and his family reside in the northeastern part of Singapore. He is a [Christian](/wiki/Christian). ## Discography ### Studio albums - *Du Jiao Shou* (2006) ### Singles - \"Buddha Smiles\" (2007) - \"Authenticity\" (2019) - \"Hear Me Sing 2021\" (2019) - \"Eternal Night\" (2021) - \"Light Of My Life\" (2021) - \"My Words to You\" (2022) - \"Moving Forward\" (2023) - Official website This article about a Singaporean musician is a stub. You can help Wikipedia by expanding it. - v - t - e This article about a Singaporean singer is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:10:27.783705",
  "title": "Hong Junyang",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Hong_Junyang"
}