{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:10:35.888644"
  },
  "content": "1°17′35.5″N 103°50′27.1″E﻿ / ﻿1.293194°N 103.840861°E﻿ / 1.293194; 103.840861 Historic site in Mohamed Sultan Road **Hong San See** ([traditional Chinese](/wiki/Traditional_Chinese_characters): 鳳山寺; [simplified Chinese](/wiki/Simplified_Chinese_characters): 凤山寺; [pinyin](/wiki/Pinyin): *Fèngshān sì*; [Pe̍h-ōe-jī](/wiki/Pe%CC%8Dh-%C5%8De-j%C4%AB): *Hōng-suann-sī*) is a Chinese temple in Singapore, and is located at Mohamed Sultan Road in the [River Valley Planning Area](/wiki/River_Valley,_Singapore), within the [Central Area](/wiki/Central_Area,_Singapore). Hong San See Temple was constructed between 1908 and 1913, erected by migrants from [Nan An County](/wiki/Nan%27an,_Fujian) in [Fujian province](/wiki/Fujian_province) with materials [imported](/wiki/Imported) from China. Built on a small hill, the temple once overlooked the sea. The temple's vicinity now mainly houses bars, restaurants and expensive apartments. Singapore Lam Ann Association manages the temple. ## History The original temple to [Guang Ze Zun Wang](/wiki/Guang_Ze_Zun_Wang) ([Chinese](/wiki/Simplified_Chinese_characters): 廣澤尊王) was built in 1836 on [Mount Wallich](/wiki/Mount_Wallich) in [Tanjong Pagar](/wiki/Tanjong_Pagar) by Neo Jin Quee ([Chinese](/wiki/Chinese_language): 梁壬癸; [pinyin](/wiki/Pinyin): *Liáng Rénguǐ*), an early Chinese pioneer from Nan An County. In 1907, the land was acquired by the government for reclaiming Telok Ayer Bay and the temple [trustees](/wiki/Trustee) were given [compensation](/wiki/Damages) of $50,000. The temple trustees used the money to buy land on a 999-year [lease](/wiki/Lease) on Mohamed Sultan Road from Sam Tomlimson who was the Municipal Engineer. The name of the temple means \"Temple on [Phoenix](/wiki/Phoenix_(mythology)) Hill\". Sited on the side of Institution Hill, the temple was situated on high ground with a view of the sea. According to the principles of [Chinese geomancy](/wiki/Feng_shui), this is a prime spot for a temple. The construction of the temple began in 1908 with materials imported from China. The chief director of the temple's Board was Lim Loh, the father of [World War II](/wiki/World_War_II) hero [Lim Bo Seng](/wiki/Lim_Bo_Seng). The temple was completed in 1913 at the cost of $56,000. It was [renovated](/wiki/Renovation) once in 1934 and again in 1962. In 1970 renovations to the temple were not done according to [restoration](/wiki/Building_restoration) guidelines and several features were removed. These are to be restored to make the temple faithful to its original early twentieth century architecture. One major change, now likely to have been removed, was the addition of ornate [carvings](/wiki/Wood_carving) [painted](/wiki/Paint) in gold all along the [trusses](/wiki/Truss) of the temple. As with some of the other Chinese temples in Singapore, its premises were used as a school for children from nearby villages. Called Nan Ming School, it was closed after ten years when it ran into financial difficulties. Today, Hong San See has lost its view of the sea, blocked by high-rises which now surround it. However, it remains on high ground, and to reach the temple, devotees have to climb a long flight of [stairs](/wiki/Stairway). Hong San See Temple was gazetted as a [national monument](/wiki/National_Monuments_of_Singapore) on 10 November 1978. Extensive renovations were carried out from 2006 to 2010. In 2010, the temple was given the Award of Excellence for the UNESCO Asia-Pacific Heritage Award for Culture Heritage Conservation. ## Architecture Hong San See is located on a hill with the [entrance](/wiki/Gate) facing south or the *[yang](/wiki/Yin_and_yang)* position at the back of the complex against higher ground and the cold north that generates *[yin](/wiki/Yin_and_yang)*, which also has a good *[feng shui](/wiki/Feng_shui)*. There are [granite](/wiki/Granite) [plaques](/wiki/Commemorative_plaque) in the entrance hall, dated between 1868 and 1913 which list the [donors](/wiki/Donation) who contributed to the building of the temple. There are other modern plaques on the walls commemorating donors in recent years. The granite [column](/wiki/Column) on either side of the main entrance are [engraved](/wiki/Engraving) [verses](/wiki/Poetry) extolling the site's once excellent view of the sea and its wealthy neighbourhood. This view has since been blocked by high-rise development in the 1990s. There are four carved granite columns in the temple, with two at the entrance are six-sided columns with entwined [dragons](/wiki/Dragon) and figurines of the [Eight Immortals](/wiki/Eight_Immortals). Just past the entrance on either side of the [courtyard](/wiki/Courtyard) are two columns with carvings of peony flowers, magpies and phoenixes. The main door is made of double-leafed timber and painted with [phoenixes](/wiki/Phoenix_(mythology)). The two side doors flanking the main door are painted with [door gods](/wiki/Door_god). The main door is usually kept barred except on important occasions. The roof [ridges](/wiki/Ridge) and [eaves](/wiki/Eave) of the temple have *chien nien* ornamentation and [plaster](/wiki/Plaster) [relief](/wiki/Relief)-work. *Chen nien* ornamentation is the tradition [southern Chinese](/wiki/Southern_China) art of creating figures, flowers, leaves and other images with small pieces of colourful [porcelain](/wiki/Porcelain). Another key feature of traditional [Chinese building](/wiki/Chinese_architecture) is exposed structural elements. Traditionally constructed without [nails](/wiki/Nail_(engineering)), the weight of the roof is supported on the columns on which rest of the [beams](/wiki/Beam_(structure)). Walls in Chinese temples do not bear the weight of the roof. The exposed structure shows off the ingenious [carpentry](/wiki/Carpentry). The roof of the main hall is a two-tiered *xie shan* roof with curved [swallow](/wiki/Swallow) tail ridge ends. In the centre of the roof ridge are two prancing dragons on either side of a blazing [pearl](/wiki/Pearl). At the ends of the lower-tier roof are [Minnan](/wiki/Minnan_region) [spirals](/wiki/Spiral). The main hall of the temple with the [altar](/wiki/Altar) to patron [deity](/wiki/Deity) *Guangze Zunwang* is raised on a nine-metre [podium](/wiki/Podium) and opens out to the internal open-air courtyard in front of it. The courtyard is flanked by covered [corridors](/wiki/Hall) which lead to the side halls. The secondary altars are dedicated to *[Cheng Huang](/wiki/City_God_(China))* (城隍) and *[Xuan Tian Shang Di](/wiki/Xuanwu_(god))* (玄天上帝; Heavenly Emperor). These altars are positioned at the back of the main hall to the left and right of the main altar. The main hall has six solid timber columns that are [convex](/wiki/Convex_and_Concave) in mid-shaft. They rest on carved granite bases. On the black columns are verses written by a Singaporean [calligraphist](/wiki/Calligraphist), the late Pan Shou. The side halls have square columns set in granite bases. They are plain and without ornamentation. Nan Ming School used two halls from 1915 as classrooms. The children came from nearby villages such as [Bukit Ho Swee](/wiki/Bukit_Ho_Swee) and would not otherwise have been able to afford an education. The school closed in 1925 due to financial problems. ## News articles - \"Historic icon keeps alive ties within Hokkien community\". [The Straits Times](/wiki/The_Straits_Times) (online). 22 September 2016. Retrieved 10 July 2022. - \"Rare records from Hong San See temple donated to National Library Board\". [The Straits Times](/wiki/The_Straits_Times) (online). 2 March 2018. Retrieved 10 July 2022. - Chia, Jack Meng-Tat (2009), \"Sacred Ties across the Seas: The Cult of Guangze Zunwang and its Religious Network in the Chinese Diaspora, 19th Century-2009\", M.A. thesis, National University of Singapore. - Lee, Geok Boi (2002), *The Religious Monuments of Singapore*. Landmark Books. - Preservation of Monuments Board Website - Samuel, D. S. (1991). *Singapore's heritage: Through places of interest*. Singapore: Elixir consultancy service, p. 211. - Singapore Infopedia - Hong San See Temple - Singapore Government eCitizen website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:10:35.888138",
  "title": "Hong San See",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Hong_San_See"
}