{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:10:29.799097"
  },
  "content": "Place in Singapore **Hong Kah** is a subzone in [Jurong West](/wiki/Jurong_West), Singapore. It is bounded by the [PIE](/wiki/Pan_Island_Expressway), Corporation Road, Jurong Canal, Boon Lay Way. It is named after the former 'Hong Kah Village'. The precinct's HDB flats are under the management of Jurong-Clementi-Bukit Batok Town Council in the eastern part and West Coast-Jurong West Town Council in the western part, the residents are represented in parliament by [Shawn Huang Wei Zhong](/wiki/Shawn_Huang_Wei_Zhong) in the western part and [Xie Yao Quan](/wiki/Xie_Yao_Quan) in the eastern part. ## History Hong Kah is named after the former Hong Kah Village which used to exist north of the present site. \"Hong Kah\" is a romanization of the Hokkien 奉教 ([POJ](/wiki/Pe%CC%8Dh-%C5%8De-j%C4%AB): hōng-kà), which is the term for [Christians](/wiki/Christians) or [Christianity](/wiki/Christianity) in the [local Singaporean dialect](/wiki/Singaporean_Hokkien) of the [Hokkien](/wiki/Hokkien) language. ## Housing ### Public StreetBlocksJurong West Street 42401–422, 449–455, 543–559Jurong West Avenue 1423–448, 484–491, 502–503, 537–542Jurong West Street 41456–483, 492–499Jurong West Street 51501, 504, 510–511Jurong West Street 52505–508, 513–536 ### Private - Lake Grande - Lakeville - Parc Vista - The Lakeshore ## Transportation ### Roads The main roads in **Hong Kah** are Jurong West Avenue 2, Corporation Road, Boon Lay Way and Jurong West Avenue 1, which connects the precinct to the rest of the island through the [PIE](/wiki/Pan_Island_Expressway) exits 31 and 34, to Bukit Batok Road and Jurong West Avenue 2 with minor roads (Jurong West Street 41/42/51/52) winding through the various estates in the precinct. By 2027, the [LTA](/wiki/Land_Transport_Authority) plans to extend Jurong Canal Drive to Boon Lay Way and from PIE to Tengah Boulevard to accommodate the growing population of Tengah New Town. ### Public transport #### Mass Rapid Transit (MRT) Yuhua is currently served by one [East West Line](/wiki/East-West_MRT_line) MRT station, namely: - **EW26** [Lakeside](/wiki/Lakeside_MRT_station) In 2028, an additional MRT station will serve the western part of the precinct, as part of the upcoming [Jurong Region Line](/wiki/Jurong_Region_Line), namely: - **JS5** [Corporation](/wiki/Corporation_MRT_station) #### Feeder bus services **Hong Kah** is linked to [Jurong East MRT station](/wiki/Jurong_East_MRT_station) through feeder services **333** and **334**. #### Trunk bus Services There are several trunk services that plies through Hong Kah area. Service 49 is extensively available towards [Lakeside MRT station](/wiki/Lakeside_MRT_station). #### Special bus Services Bus connection to the city is available through City Direct service **657** and express service **502**. ## Schools There are two primary schools ([Rulang](/wiki/Rulang_Primary_School) and [Shuqun](/wiki/Shuqun_Primary_School)), six secondary schools (Fuhua, [Yuhua](/wiki/Yuhua_Secondary_School), [Hua Yi](/wiki/Hua_Yi_Secondary_School) and [Jurongville](/wiki/Jurongville_Secondary_School)), one international school (Canadian International School) and many pre-school centres in **Hong Kah**. In 2028, [Jurong Pioneer Junior College](/wiki/Jurong_Pioneer_Junior_College) will move to Hong Kah at 800 Corporation Road. ## Recreation There are 3 neighbourhood parks in **Hong Kah**, each located at Jurong West Street 41, Jurong West Street 42 and Jurong East Street 32. The nearest sports complex is Jurong East Sports and Recreation Centre, accessible from the rest of the precinct through all the bus services that pass through this precinct. ## Community Centres There are two community centres in the precinct, with **Jurong Spring Community Club** located in **Hong Kah South** (Jurong Spring) and **Jurong Green Community Club** located in **Hong Kah East** (Jurong Central). ## Town Centres **Hong Kah Point** is the town centre of Hong Kah, located at the junction of Jurong West Avenue 1 and Jurong West Street 52, accessible by all the bus services that ply through the precinct. The town centre features a hawker centre built in 1985, Jurong West Street 52 Market and Food Centre, neighbourhood shops and the West Coast Town Council (Boon Lay) office. ## Places of Worship There are three Chinese temples in **Hong Kah**: - Che Wein Khor Temple (紫盈阁), belonged to [Church of Virtue](/wiki/Church_of_Virtue), Jurong West Ave 1 - Jurong West United Temple (裕廊西联合宫), Jurong West Street 41 - Jurong Combined Temple (裕廊总宫), Jurong West Street 42 The nearest churches and mosque are located in [Taman Jurong](/wiki/Taman_Jurong) and [Yuhua](/wiki/Yuhua,_Singapore). ## Healthcare The healthcare facilities in Hong Kah consist only of private medical clinics. The nearest polyclinic, Jurong Polyclinic, is located in Yuhua. ## Security The **Jurong West Neighbourhood Police Centre** is located in **Hong Kah** at the junction of Jurong West Avenue 1 and Corporation Road. - Monkey tree phenomenon - Jurong-Clementi Town Council - Jurong GRC\n",
  "language": "en",
  "processed_at": "2026-01-12T11:10:29.798610",
  "title": "Hong Kah",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Hong_Kah"
}