{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:10:39.806283"
  },
  "content": "Fuel cell manufacturersThis article **contains promotional content**. Please help improve it by removing promotional language and inappropriate external links, and by adding encyclopedic text written from a neutral point of view. *(July 2023)* *(Learn how and when to remove this message)* **Horizon Fuel Cell Technologies** is a manufacturer of [hydrogen](/wiki/Hydrogen) [fuel cells](/wiki/Fuel_cell) based in [Singapore](/wiki/Singapore). Founded in 2003, the company manufactures micro-size to multi-kilowatt scale (PEM) [proton exchange membrane fuel cells](/wiki/Proton_exchange_membrane_fuel_cell). Additionally, it uses hydrogen storage and production methods, including [hydrolysis](/wiki/Hydrolysis), [electrolysis](/wiki/Electrolysis) and [steam reforming](/wiki/Steam_reforming). ## History In 2004, Horizon began its PEM fuel cell stacks with a focus on a self-humidified air-breathing architecture and began a series of design and development iterations that reduce fuel cell costs. In 2005, with the completion of a low-cost single cell, Horizon Fuel Cell Technologies created a commercial micro-size fuel cell product, designed as a basic [science experiment kit](/wiki/Science_education). Horizon then miniaturized a hydrogen fuel cell car together with a solar hydrogen station, and released the H-racer, which was named Transportation Best Invention of the year 2006 by [Time](/wiki/Time_(magazine)) and \"One of 11 Coolest New Products On the Planet\" by [Business 2.0](/wiki/Business_2.0). In April 2007, fuel cells of hydrogen were used to power the first unmanned [zero-emission fuel cell powered jet-wing aircraft](/wiki/Zero-emissions_vehicle), and set a new [FAI](/wiki/F%C3%A9d%C3%A9ration_A%C3%A9ronautique_Internationale) flight distance record in a 5 kg LAV developed by Cal state-LA, backed by NASA and US [Air Force Research Laboratory](/wiki/Air_Force_Research_Laboratory). In August, Horizon Fuel Cell Technologies received the 2007 Innovative Energy Technology Developer of the Year Award in the Asia Pacific region. In 2008, a portable fuel cell named HYDROPLANE represented the start of Horizon's chemical hydrolysis cartridge [research and development](/wiki/Research_and_development). at the [Consumer Electronics Show.](/wiki/International_CES) Horizon also began work on a [reversible metal hydride](/wiki/Regenerative_fuel_cell) that led to the commercialization of Hydrostik cartridges. In 2009, Horizon created a palm-size [micro portable fuel cell](/wiki/Fuel_cell_applications) USB power supply named Mintaka at the [Consumer Electronics Show](/wiki/International_CES). It later won the 2012 Gadget of the Year status for Gamekeeper. Horizon opened a separate subsidiary in Singapore named Horizon Energy Systems (HES), and in 2010 unveiled a first 450Wh/kg battery alternative prototype named Aerospace. HES plans to exceed 1,00 WH/kg with its hydrogen technologies in the future. In 2010, [BOC](/wiki/The_BOC_Group) (now part of Lind Group) introduced a Horizon-made 150 W portable fuel cell power supply named Rhymer for sale in the United Kingdom. It is used in construction and railway maintenance – and in [off-the-grid](/wiki/Off-the-grid) lighting projects. With 3D Classwork Horizon promoted environmental awareness for sustainable energy amongst students around the world in a joint program called Destination Zero Carbon. In 2013 the Hydro max [VRLA](/wiki/VRLA_battery) [battery charger](/wiki/Battery_charger) for recreational vehicles and yachts were released, and Aquiline, a salable 200W-50 kW back-up power system for telecom, data centers, and security solutions.[*buzzword*] In January, the Fuel cell-powered H-[Rover](/wiki/Rover_(space_exploration)) was unveiled at the [Nuremberg International Toy Fair](/wiki/Nuremberg_International_Toy_Fair). Horizon released i-HUGO, its latest hydrogen car miniature merging an iOS remote control APP, Horizon's hybrid micro-fuel cell power systems, and a USB enabled hydrogen station. The Hydroplane was released, representing a breakthrough 9%Wt hydrogen storage method. ## Products Horizon's technology platform has three parts: PEM fuel cells (micro-fuel cells and stacks) and their materials, hydrogen supply (electrolysis, reforming, and hydrolysis), and hydrogen storage and pressure related devices. [Fuel cell stacks](/wiki/Fuel_cell_applications) are offered in three ranges: - standard [off-the-shelf](/wiki/Commercial_off-the-shelf) PEM fuel cell systems available from 10W to 5 kW, or customized fuel cell system configurations up to 150 kW; - premium H-1000XP 1 kW stacks with peak efficiency of 59% proven during testing at Shell [Eco-Marathon](/wiki/Eco-Marathon) in Asia; - ultra-light and compact Aerospace from 200W to 1,000W. [Educational products and kits](/wiki/Science_education). A toy car was used to show a thin-film micro-fuel cell. A fuel cell car kit was used in a competitive racing format. This led to the start of Destination Zero Carbon, a global STEM education program. The [South African Agency for Science and Technology](/wiki/Department_of_Science_and_Technology_(South_Africa)) and the National Research Foundation have a video about the importance of making Science fun to boost research. Horizon's H-CELL product is featured in the video. In May 2013, French Minister of Industry, [Frédéric Cuvillier](/wiki/Fr%C3%A9d%C3%A9ric_Cuvillier) hands out the Saint Jo 24 hour race's trophy cup specially made for this challenge, which was to keep a hydrogen-powered car using rainwater, with hydrolysis done by solar panels, working under competitive conditions for 24 hours non-stop. The winning car was powered by Horizon Fuel Cell. It was the first time that a hydrogen-powered car finished the 24 hour race, a one-tenth replica of [24 Hours of Le Mans](/wiki/24_Hours_of_Le_Mans) for [radio-controlled car](/wiki/Radio-controlled_car). Portable [fuel cells](/wiki/Fuel_cell) are designed for, clean electric power generation in various [off-grid](/wiki/Off-grid) emergency situations. They are deployed in: - Mintaka for cellphones, smartphones, GPS handhelds, Go-Pro type cameras or MP 3 players - Hydroplane (50 kW - 100 kW), energy cartridges with unlimited storage life. - Hydro max, a [deep cycle battery](/wiki/Deep_cycle_battery) capacity extender for recreational use (RV, yachting) [Stationary](/wiki/Stationary_fuel_cell) [backup power](/wiki/Backup_power) units are developed internally or with integrator and partners seeking to develop cost-effective solutions.[*buzzword*] The [transport](/wiki/Transport) division works closely with integration partners that cater both to the [car industry](/wiki/Car_industry) (supplying fuel cells to the [Riversimple Urban Car](/wiki/Riversimple_Urban_Car) or Micro cab) and offers an Electric Bike Kit, a [plug and play](/wiki/Plug_and_play) hydrogen fuel cell system to hybrid with existing [electric bikes](/wiki/Electric_bike). The [aerospace](/wiki/Aerospace) division focuses on lightweight alternatives to batteries, where fuel cell systems combined with hydrogen generators increase electric flight duration. Early applications include monitoring wildlife poaching activity over large territories, pipeline monitoring, border patrol and geological surveys. Paternoster, a 5 kW aircraft developed with [Oklahoma State University](/wiki/Oklahoma_State_University) and [Calstate](/wiki/Calstate) flew 120 km (78 miles) - consuming 16 of the 64 grams of Hydrogen, giving the aircraft a potential flight range of 500 km (310 miles). - Horizon Fuel Cell Technologies\n",
  "language": "en",
  "processed_at": "2026-01-12T11:10:39.805769",
  "title": "Horizon Fuel Cell Technologies",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Horizon_Fuel_Cell_Technologies"
}