{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:10:47.807999"
  },
  "content": "Bus interchange in Singapore **Hougang Central Bus Interchange** is a [bus interchange](/wiki/Bus_station) serving the town of [Hougang](/wiki/Hougang). It is located directly above [Hougang MRT station](/wiki/Hougang_MRT_station). ## History Plans to build a bus interchange in Hougang North were first announced in Parliament in January 1992. Intended to connect Hougang with adjacent new towns and the [Central Area](/wiki/Central_Area,_Singapore), the bus interchange was built in response to requests made by the Member of Parliament for the area to improve bus services. The new Hougang Central Bus Interchange was opened by Minister of State (Trade and Industry and Communications) Goh Chee Wee on 17 December 1994. It had cost [S$](/wiki/S$)5.7 million. From 1998 to 2001, Hougang Central Bus Interchange was closed to facilitate the construction of [Hougang MRT station](/wiki/Hougang_MRT_station), and six bus services were diverted to a temporary bus interchange along Upper Serangoon Road. In February 2004, it began to manage former bus operations at [Hougang South Bus Interchange](/wiki/Hougang_South_Bus_Interchange). In 2015, the interchange was expanded by 0.3 hectares (0.74 acres), to provide additional bus parking space for more bus services. ## Redevelopment In 2012, the [Ministry of Transport](/wiki/Ministry_of_Transport_(Singapore)) unveiled plans with an expected deadline of 2022 to rebuild Hougang Central Bus Interchange, which would make it part of an Integrated Transport Hub (ITH) with [Hougang MRT station](/wiki/Hougang_MRT_station). In 2024, it was announced that a new mixed-use development with a bus interchange would be built on the site bounded by Hougang Avenue 10 and Hougang Central, as part of the plans to develop the upcoming Hougang ITH. In December 2025, the bid for the mixed-use development was awarded to [CapitaLand](/wiki/CapitaLand) for S$1.5 billion. Construction of the development is expected to be completed in 2032. ## Bus Contracting Model Under the [Bus Contracting Model](/wiki/Bus_contracting_model_of_Singapore), all bus services operating from Hougang Central Bus Interchange were divided into 2 Bus Packages, operated by the anchor operator, [SBS Transit Ltd](/wiki/SBS_Transit).[*citation needed*] ## List of Bus Services OperatorPackageRoutes**SBS Transit**Clementi74, 147Sengkang-Hougang27, 51, 89, 89e, 102, 107/107M, 112, 113, 116, 153, 161, 165, 324, 325, 329 - Interchanges and Terminals (SBS Transit) This Singapore bus-related article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:10:47.807529",
  "title": "Hougang Central Bus Interchange",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Hougang_Central_Bus_Interchange"
}