{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:10:43.891893"
  },
  "content": "Planning area and new town in North-East Region, SingaporePlanning Area and HDB Town in North-East Region, Singapore **Hougang** (locally /ˌ(h)aʊˈkɑːŋ, -ʌŋ/ *(h)ow-KUNG*[a]) is a [planning area](/wiki/Planning_Areas_of_Singapore) and [mature residential town](/wiki/New_towns_of_Singapore) located in the [North-East Region](/wiki/North-East_Region,_Singapore) of Singapore. It is the largest housing estate in Singapore based on land area, and is home to 247,528 residents as of 2018. Hougang planning area is bordered by [Sengkang](/wiki/Sengkang) to the north, [Geylang](/wiki/Geylang) to the south, [Bedok](/wiki/Bedok) to the southeast, [Toa Payoh](/wiki/Toa_Payoh) to the southwest, [Serangoon](/wiki/Serangoon) to the west and [Paya Lebar](/wiki/Paya_Lebar) to the east. ## Geography **Subzones** Hougang is separated into 10 subzones, Hougang East, [Defu Industrial Park](/wiki/Defu_Industrial_Park), Tai Seng, [Lorong Halus](/wiki/Lorong_Halus), Kangkar, Hougang West, Trafalgar, Lorong Ah Soo, [Kovan](/wiki/Kovan,_Singapore) and Hougang Central. ## Etymology and history ***Hougang*** is located upstream or at the back of [Sungei Serangoon](/wiki/Sungei_Serangoon). The area just beyond the seventh milestone along Punggol Road was formerly considered part of Punggol but is now within Hougang Town and that section of Punggol Road is now Hougang Avenue 8, with Punggol Road starting further north. Pig farming was carried out in Punggol, including the area of Punggol that is now part of Hougang Town. The last of these pig farmers were relocated by the late-1990s to flats built in Hougang. There was also a fishing port at the end of Upper Serangoon Road beyond the seventh milestone. The development of Hougang commenced in 1977 with the construction of Tampines Way. Further construction work was subsequently completed in Neighbourhoods 1 – 3 by 1983, and later Neighbourhoods 4 – 7 by 1992. Neighbourhood 8 is the town centre of Hougang and construction was completed in 1994. Neighbourhood 9 is the most recent with a completion date in 2000. In 2015, a project named Hougang Capeview, a Build-To-Order project at Upper Serangoon Road, became the first public housing project to receive the CONQUAS Star, an accolade administered by the Building and Construction Authority. Hougang Capeview, which comprises 781 residential units in six blocks at Upper Serangoon Road, received a Construction Quality Assessment System (CONQUAS) score of more than 95, above the national average of 88.2. The CONQUAS score is BCA's measure of construction quality across Singapore. ## Shopping Hougang has 8 shopping malls which are - [Hougang Mall](/wiki/Hougang_Mall), a seven-storey shopping mall with an NTUC FairPrice outlet, Singtel outlet, Starhub outlet, and Popular bookstore. The mall serves the residents of Hougang Central. It was opened in 1997. - Hougang Green Shopping Mall, a four-storey shopping mall with a 24/7 Giant outlet. The mall serves Hougang West. Built and opened in 1998. - Hougang Rivercourt - It is a shopping mall integrated as the HDB neighbourhood centre that was opened in May 2022 that are tenants with Sheng Siong, Burger King, and more. - The Midtown, a mixed development with a condominium and a cluster of shops in Hougang Central. - Hougang 1, a suburban mall with an NTUC FairPrice Xtra outlet in Hougang West. It was opened in 1999. - [Heartland Mall](/wiki/Heartland_Mall), a suburban mall in [Kovan](/wiki/Kovan,_Singapore). It has a Cold Storage outlet and Popular bookstore. It was opened in 1984 as the Oriental Emporium Mall whereas in 2001 is rebranded with this current name of the mall. - Kang Kar Mall, a two-storey shopping centre which has a Kang Kar Food Court and a two-storey NTUC FairPrice outlet. - Upper Serangoon Shopping Centre, a suburban mall that has a cluster of shops, it serves residents of Kovan. - Buangkok Square Shopping Mall, a mixed development shopping mall in [Buangkok](/wiki/Buangkok) with condominiums and a three-storey shopping mall with [McDonald's](/wiki/McDonald%27s), and a [Prime Supermarket](/wiki/Prime_Supermarket). It was opened in February 2019. ## Transport ### Bus interchange #### Hougang Central Bus Interchange Hougang Central Bus Interchange is a bus interchange serving the town of Hougang. It is located directly above [Hougang MRT station](/wiki/Hougang_MRT_station). By 2030, Hougang Central Bus Interchange will be modernised to accommodate the [Cross Island Line](/wiki/Cross_Island_Line) section, in addition to becoming an Integrated Transport Hub. ### Bus depots #### Hougang Bus Depot Hougang Bus Depot is an [SBS Transit](/wiki/SBS_Transit) West District [bus depot](/wiki/Bus_garage) located in Hougang, [Singapore](/wiki/Singapore). As of November 2014, the total fleet is 600 buses. Hougang Bus Depot started operations in 1983 when the north-east which is Hougang and Serangoon was developed and previously, all operations had been on Ang Mo Kio Bus Depot and Bedok Bus Depot respectively. ### Mass Rapid Transit stations There are four main stations serving Hougang, as part of the [Circle Line](/wiki/Circle_Line_(Singapore)) and [North East Line](/wiki/North_East_Line). Hougang will be served by the [Cross Island Line](/wiki/Cross_Island_Line) slated to be completed by 2030. - **NE13** [Kovan](/wiki/Kovan_MRT_station) - **NE14** **CR08** [Hougang](/wiki/Hougang_MRT_station)[b] - **CC11** [Tai Seng](/wiki/Tai_Seng_MRT_station) - **CR07** [Defu](/wiki/Defu_MRT_station) ### Mass Rapid Transit depots #### Kim Chuan Depot Kim Chuan Depot is a [train depot](/wiki/Train_depot) for the [Mass Rapid Transit](/wiki/Mass_Rapid_Transit_(Singapore)) system in [Singapore](/wiki/Singapore). The depot is constructed fully underground and provides maintenance, stabling and operational facilities for the [Circle Line](/wiki/Circle_Line_(Singapore)). It is located in Hougang, along Upper Paya Lebar Road, and is accessible via Kim Chuan Road. It used to be the first depot in Singapore to serve two independently operated MRT lines, until the adjacent [Tai Seng Facility Building](/wiki/Tai_Seng_Facility_Building) became operational with the revenue operation of the [Downtown Line](/wiki/Downtown_Line) Stage 3 on 21 October 2017. #### Tai Seng Facility Building Tai Seng Facility Building, abbreviated as TSFB, (or Tai Seng) is an underground [train depot](/wiki/Train_depot) for the [Mass Rapid Transit](/wiki/Mass_Rapid_Transit_(Singapore)) system in [Singapore](/wiki/Singapore). The depot is constructed towards the east of [Kim Chuan Depot](/wiki/Kim_Chuan_Depot) and will provide maintenance, stabling and operational facilities for the [Downtown Line](/wiki/Downtown_Line). It is located in Hougang along Bartley Road East. It is accessible via a surface building located along Bartley Road East. The depot is approximately 52 metres wide, 295 metres long and 20 metres deep. It is connected to Kim Chuan Depot and has underground access for trains to run between both facilities, allowing Downtown Line trains to be stabled in the Tai Seng Facility Building, and able to access its remote tracks. It is used in tandem with Kim Chuan Depot for the operations of the [Downtown Line](/wiki/Downtown_Line). ### Road networks Two of the oldest main roads: Upper Serangoon Road and Punggol Road run through Hougang since the town's beginning. The town is also linked to other towns by Yio Chu Kang Road in the West, Tampines Road in the East, Upper Paya Lebar Road to the south-East, Buangkok Drive & Buangkok Green in the North. Other roads in Hougang New Town links the town to bigger roads, most importantly Avenue 2, 3 which links the town from East and West. ## Amenities Most of Hougang's commercial activity is centred on a few [shopping malls](/wiki/Shopping_mall) such as Hougang Mall, Kang Kar Mall, Heartland Mall, Upper Serangoon Shopping Centre, Hougang Rivercourt Shopping Centre (that opened in May 2022), and Hougang 1 (Formerly known as Hougang Point, and opened in End 1999). Similar to most other residential towns in Singapore, Hougang was designed to be a partially [self-sufficient](/wiki/Self-sufficiency) with enough amenities to minimize the number of residents commuting to the Central Area. Facilities include Hougang Sports Hall, an indoor sports complex operated by Sport Singapore which runs ClubFITT membership and sports programmes, Hougang [stadium](/wiki/Stadium) home to [S.League](/wiki/S.League) club [Hougang United](/wiki/Hougang_United_FC), an aquatics centre, a number of parks such as Punggol Park, along with many [wet markets](/wiki/Wet_market) and [hawker centres](/wiki/Hawker_centre). One of the more prominent landmarks in Hougang is the Buangkok Green Medical Park, which houses several medical facilities including the [Institute of Mental Health](/wiki/Institute_of_Mental_Health_(Singapore)) (IMH) and Singapore Leprosy Relief Association (SILRA). The Hougang Central Bus Interchange serves Hougang Town with a range of bus services going to other parts of the island. It is located in Hougang Central, near Hougang Mall and it has an underground link to [Hougang MRT station](/wiki/Hougang_MRT_station). This bus interchange was officially opened on 17 December 1994 by former cabinet minister Goh Chee Wee, who was then Senior Minister of State for Communications, Trade and Industry to serve all buses around the Hougang Area. Its sister bus interchange, [Hougang South Bus Interchange](/wiki/Hougang_South_Bus_Interchange) (that is near to [Kovan MRT station](/wiki/Kovan_MRT_station)) ceased operations in 2004 and was converted to Kovan Hub. Two even older bus terminals operated in Hougang before the construction of the Hougang Central and Hougang South Bus Interchanges. One was at the end of Upper Serangoon Road in Kangkar Village, which was replaced by Hougang Central, while the other was at the sixth and a half milestone of Upper Serangoon Road, which was replaced by Hougang South. ## Highlights A distinctive feature of Hougang lies in the large semi-circular balconies which occur in many [Housing and Development Board](/wiki/Housing_and_Development_Board) [public housing](/wiki/Public_housing) flats in the area. This feature is not as prevalent in public housing outside Hougang. The latest addition of new Condominium will be Florence Residences in 2019. ## Politics The political representation of Hougang was split into five different constituencies as of the [2025 elections](/wiki/2025_Singaporean_general_election), three of which were [Group Representation Constituencies](/wiki/Group_Representation_Constituencies) (GRC) ([Aljunied](/wiki/Aljunied_Group_Representation_Constituency), [Ang Mo Kio](/wiki/Ang_Mo_Kio_Group_Representation_Constituency), and [Marine Parade-Braddell Heights](/wiki/Marine_Parade-Braddell_Heights_Group_Representation_Constituency)), and two of which were Single Member Constituencies (SMC) ([Hougang](/wiki/Hougang_Single_Member_Constituency) and [Jalan Kayu](/wiki/Jalan_Kayu_Single_Member_Constituency)). Currently, Aljunied and Hougang wards are managed by the opposition [Workers' Party](/wiki/Workers%27_Party_(Singapore)) (WP), while Ang Mo Kio, Jalan Kayu and Marine Parade-Braddell Heights are managed by the ruling [People's Action Party](/wiki/People%27s_Action_Party) (PAP). Previously, Hougang was administered by four now-defunct wards ([Paya Lebar](/wiki/Paya_Lebar_Single_Member_Constituency), [Punggol](/wiki/Punggol_Single_Member_Constituency), [Serangoon Gardens](/wiki/Serangoon_Gardens_Single_Member_Constituency) and [Upper Serangoon](/wiki/Upper_Serangoon_Single_Member_Constituency)), before it redistricted into GRCs, notably [Cheng San GRC](/wiki/Cheng_San_Group_Representation_Constituency) (also defunct since (/wiki/2001_Singaporean_general_election)); [Jalan Kayu Constituency](/wiki/Jalan_Kayu_Constituency) also went defunct in 1988, but returned to being an [individual SMC](/wiki/Jalan_Kayu_SMC) in the 2025 election. ### Hougang SMC The area covering parts of Hougang Avenues 2, 3, 5, 7 and a small portion of Hougang Central falls under the namesake Hougang SMC. The first Member of Parliament (MP) of the ward was PAP's [Tang Guan Seng](/wiki/Tang_Guan_Seng), until it had been captured by former WP secretary-general [Low Thia Khiang](/wiki/Low_Thia_Khiang) in (/wiki/1991_Singaporean_general_election). Low left the ward to contest Aljunied GRC ahead of the [2011 elections](/wiki/2011_Singaporean_general_election), and was replaced by [Yaw Shin Leong](/wiki/Yaw_Shin_Leong), another WP candidate who previously contested [Ang Mo Kio GRC](/wiki/Ang_Mo_Kio_Group_Representation_Constituency) in the [2006 elections](/wiki/2006_Singaporean_general_election). Yaw remained as an MP until his expulsion from the party's CEC and resigned his seat in February 2012 over an extramarital affair. [Png Eng Huat](/wiki/Png_Eng_Huat), a candidate whose part of the WP team contested [East Coast GRC](/wiki/East_Coast_Group_Representation_Constituency) in the 2011 elections, had since represented this ward after winning his [by-election](/wiki/2012_Hougang_by-election) in May 2012 until he stepped down in 2020. [Dennis Tan](/wiki/Dennis_Tan), who previously contested [Fengshan SMC](/wiki/Fengshan_SMC) in the 2015 elections ([now in East Coast GRC](/wiki/East_Coast_Group_Representation_Constituency)) and become a [Non-constituency Member of Parliament](/wiki/Non-constituency_Member_of_Parliament) (NCMP), has replaced outgoing Png since being elected in 2020. ### Aljunied GRC The area covering the western portions of Hougang, previously being Serangoon Gardens division, were split into two divisions with Jalan Kayu in the Ang Mo Kio GRC and Serangoon in the Aljunied GRC. The area was previously belong to the short-lived [Thomson GRC](/wiki/Thomson_Group_Representation_Constituency) in 1991. The areas covering Aljunied GRC are Hougang Avenues 1, 6, 8, 10, and Street 21, as well as [Punggol Park](/wiki/Punggol_Park) and the subareas of [Defu Industrial Park](/wiki/Defu_Industrial_Park) and [Kovan](/wiki/Kovan,_Singapore). The GRC was not contested in 2001 with the WP being disqualified due to incomplete applications, but in the 2006 elections, the WP were able to pose a strong challenge for this ward, with the members consist of WP's chairwoman [Sylvia Lim](/wiki/Sylvia_Lim) and former members [Goh Meng Seng](/wiki/Goh_Meng_Seng) and [James Gomez](/wiki/James_Gomez_(politician)). The GRC was managed by the PAP which members include [Cynthia Phua](/wiki/Cynthia_Phua) and [George Yeo](/wiki/George_Yeo), until it became the first opposition held GRC since the creation of the GRC in Singapore after the [2011 general election](/wiki/2011_Singaporean_general_election) being taken over by [Low Thia Khiang](/wiki/Low_Thia_Khiang)'s WP team, and WP held on to it since. Currently, [Gerald Giam](/wiki/Gerald_Giam), [Sylvia Lim](/wiki/Sylvia_Lim) and [Kenneth Tiong](/wiki/Kenneth_Tiong) were the MPs representing the ward. ### Ang Mo Kio GRC and Jalan Kayu SMC The north-western portions of Hougang (Avenues 4, 8 and 9, and Street 91), which includes [Hougang Stadium](/wiki/Hougang_Stadium) and Regentville Condo, falls under the Ang Mo Kio-Hougang division of the Ang Mo Kio GRC. Its MP is [Darryl David](/wiki/Darryl_David), who replaces former MP [Yeo Guat Kwang](/wiki/Yeo_Guat_Kwang) after the 2015 elections. Prior to the 2011 elections, the ward was a part of Aljunied GRC (under the name of Aljunied-Hougang), where Yeo was the MP. The northern portions of Hougang (north of Avenues 6, 8 and Street 51) also falls under the Ang Mo Kio-Hougang division, part of Ang Mo Kio GRC. It previously belonged to [Pasir Ris-Punggol GRC](/wiki/Pasir_Ris-Punggol_Group_Representation_Constituency) (under the name of Punggol South) until it was carved out in 2015. The portion was merged with the Ang Mo Kio-Hougang division in 2020. In 2025, Ang Mo Kio-Hougang was also divided into two more divisions of Buangkok-Fernvale South (those of Buangkok Green and Seletar areas) and Seletar-Serangoon (Hougang Avenue 9 and the namesake Hougang [Primary](/wiki/Hougang_Primary_School) and [Secondary](/wiki/Hougang_Secondary_School) Schools), with [Victor Lye](/wiki/Victor_Lye) and [Jasmin Lau](/wiki/Jasmin_Lau) overseeing these wards respectively. The western portions of Hougang, previously being Serangoon Gardens division, were split into two divisions with Jalan Kayu in the Ang Mo Kio GRC and Serangoon in the Aljunied GRC. As of 2025, Jalan Kayu was hived out from Ang Mio Kio GRC, thus returning that ward into a SMC. ### Marine Parade-Braddell Heights GRC The southernmost portion of Hougang (Tai Seng), was under the Geylang Serai division of Marine Parade-Braddell Heights GRC, where [Diana Pang](/wiki/Diana_Pang_(Singaporean_politician)) represented the ward. Marine Parade-Braddell Heights was also contested by WP during the 2015 and 2020 elections (then as [Marine Parade GRC](/wiki/Marine_Parade_GRC)), but not in 2025 as the ward became [uncontested](/wiki/Walkover). ## Education Hougang has a total of nine primary schools, eight secondary schools and a single international school as of 2024. ### Primary schools - CHIJ Our Lady of the Nativity - Holy Innocents' Primary School - Hougang Primary School - Montfort Junior School - Paya Lebar Methodist Girls' School (Primary) - Punggol Primary School - Xinghua Primary School - Xinmin Primary School - Yio Chu Kang Primary School ### Secondary schools - Bowen Secondary School - [Holy Innocents' High School](/wiki/Holy_Innocents%27_High_School) - [Hougang Secondary School](/wiki/Hougang_Secondary_School) - [Montfort Secondary School](/wiki/Montfort_Secondary_School) - [Paya Lebar Methodist Girls' School (Secondary)](/wiki/Paya_Lebar_Methodist_Girls%27_School_(Secondary)) - [Serangoon Secondary School](/wiki/Serangoon_Secondary_School) - [Xinmin Secondary School](/wiki/Xinmin_Secondary_School) - [Yuying Secondary School](/wiki/Yuying_Secondary_School) ### Other schools - DIMENSIONS International College (Kovan Campus) - [Hougang Tou Mu Kung Temple](/wiki/Tou_Mu_Kung_Temple) - [List of Kangchu system placename etymologies](/wiki/List_of_Kangchu_system_placename_etymologies) ## Notes ## Sources - Victor R Savage, Brenda S A Yeoh (2003), *Toponymics – A Study of Singapore Street Names*, Eastern Universities Press, - The Florence Residences\n",
  "language": "en",
  "processed_at": "2026-01-12T11:10:43.891437",
  "title": "Hougang",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Hougang"
}