{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:10:45.826102"
  },
  "content": "Bus depot in North-East Region, SingaporeThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Hougang Bus Depot\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(June 2025)* *(Learn how and when to remove this message)* **Hougang Bus Depot** is an [SBS Transit](/wiki/SBS_Transit) West District [bus depot](/wiki/Bus_garage) located in [Hougang](/wiki/Hougang), [Singapore](/wiki/Singapore). It is the oldest bus depot in Singapore with an estimated fleet of around 700 buses operating out of the depot. ## History Hougang Bus Depot started operations in 1984 when the north-east which is Hougang and Serangoon was developed and previously, all operations had been on Ang Mo Kio Bus Depot and [Bedok North Bus Depot](/wiki/Bedok_North_Bus_Depot) respectively. The depot is also home to ComfortDelGro Engineering (CDGE)'s assembly facility since 1994, relocating it from MacKenzie Road and Woodlands. All locally-assembled buses are produced here, which is SBS Transit's Volvo Olympians, Volvo B10TLs, Dennis Tridents, Volvo B9TL (CDGE) and Volvo B9TL (Wright Eclipse Gemini 2) until 2018, and Big Bus Tours Wright StreetDeck Electroliner. In April 2024, the training center located at the depot was moved to the [Ulu Pandan Bus Depot](/wiki/Ulu_Pandan_Bus_Depot) to combine driver and technician training in the same facility. With the closure of Ang Mo Kio Bus Depot on 3 January 2025, around two-thirds of its of buses were shifted to Hougang Bus Depot the next day while buses under the Sengkang-Hougang Package were shifted to the newly opened Sengkang West Bus Depot. Operation at Braddell Bus Park was also moved to Hougang Bus Depot in end-2025, ahead of the expiration of the land lease in August 2026. Hougang Bus Depot will remain operational until [Kim Chuan Bus Depot](/wiki/Kim_Chuan_Bus_Depot) opens in 2027, at which point its operations will be restricted to the Bishan-Toa Payoh Bus Package. - Interchanges and Terminals (SBS Transit) This bus-related article is a stub. You can help Wikipedia by expanding it. - v - t - e This Singapore bus-related article is a stub. You can help Wikipedia by expanding it.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:10:45.825644",
  "title": "Hougang Bus Depot",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Hougang_Bus_Depot"
}