{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:10:55.875033"
  },
  "content": "Singaporean mansion building**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article needs to be **updated**. Please help update this article to reflect recent events or newly available information. *(September 2019)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"House of Tan Yeok Nee\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(September 2019)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* 1°17′55″N 103°50′35.5″E﻿ / ﻿1.29861°N 103.843194°E﻿ / 1.29861; 103.843194 The **House of Tan Yeok Nee** ([Chinese](/wiki/Simplified_Chinese): 陈旭年宅第 or 陈旭年大厦) is a mansion building located at 101 Penang Road (formerly 85 Tank Road or 207 Clemenceau Road), at the junction of Penang Road and Clemenceau Avenue in the [Museum Planning Area](/wiki/Museum_Planning_Area) in Singapore. The house was built around the years 1882-1885. After an extensive restoration completed in 2000, it was held by the [University of Chicago Booth School of Business](/wiki/University_of_Chicago_Booth_School_of_Business). Since 2019, the building serves as the Singapore campus for Amity Global Institute. ## History The mansion belonged to [Chaozhou](/wiki/Chaozhou)-born businessman [Tan Yeok Nee](/wiki/Tan_Hiok_Nee) who built it in 1885. It is the only survivor of the *[Four Mansions](/wiki/Four_Mansions)* (四大厝) built in the late 19th century which still stands today. Tan was born in 1827. To escape poverty in his village, he came to [Nanyang](/wiki/Nanyang_(region)) where he traded textiles. In the course of doing so, he became acquainted with the Temenggong's family who resided at Telok Blangah. The Temenggong’s son Abu Bakar would later become the Sultan of Johor. Later, he planted [pepper](/wiki/Black_pepper) and [spices](/wiki/Spices) in Johor and became a port owner, becoming the largest holder of *surat Sungai by the 1860s – which gave Tan access rights to “open plantations on a certain river”,* collect taxes and exercise other functions of government. In addition, Tan established a joint venture with another [Teochew](/wiki/Teochew_people) [tycoon](/wiki/Tycoon), Tan Seng Bo, and Chang, a [Hoklo](/wiki/Hoklo_(ethnic_group)) (Hokkien) leader, in the then legal [opium](/wiki/Opium) and [liquor](/wiki/Liquor) trades. Three years later, [Tan Yeok Nee](/wiki/Tan_Hiok_Nee) immigrated to Singapore, where he built this \"House of Administration\". He soon amassed a great fortune through his involvement with his trades and the ownership of lucrative property. Tan's house is one of two surviving examples of traditional [Chinese](/wiki/Chinese_architecture) mansions in Singapore; the other is the River House in [Clarke Quay](/wiki/Clarke_Quay). Tan lived in this mansion for most of his life; he died on 21 May 1902 in China at age 75. He outlived his sons and the house was left to his eight grandsons. At the turn of the 20th century, when the Singapore-[Johor](/wiki/Johor) Railway was being built, the house was acquired for use by the Singapore & Kranji Railway manager, Mr. W. Tearle who occupied the mansion till 1905. In 1907, the government transferred Tan's house to the [Anglican Church](/wiki/Anglican_Church), which established St Mary's Home and School for Eurasian Girls for 20,000 [Straits dollars](/wiki/Straits_dollar). After the Home was closed in 1932, it was renamed as the **Temple House** and was used as a boarding house. On 28 May 1938, the [Salvation Army](/wiki/Salvation_Army) moved its Singapore headquarters to the House. The house remained the Salvation Army's centre of operations for over 50 years, except during the [Japanese occupation of Singapore](/wiki/Japanese_occupation_of_Singapore). Between 1942 and 1945, the occupying Japanese forces used the House as part of its army's headquarters. After the war, it was found shattered and torn to pieces by repeated bombing and looting. The Salvation Army spent a considerable amount on repairs and rebuilding over the next few years. In July 1951, it was officially reopened by [Governor Sir Franklin Gimson](/wiki/Franklin_Gimson). The House of Tan Yeok Nee and [Tan Si Chong Su](/wiki/Tan_Si_Chong_Su) Temple, along with three other historical sites, were gazetted as [national monument](/wiki/National_Monuments_of_Singapore) on 29 November 1974 because their typically Chinese architecture is a fast vanishing sight in Singapore. In 1991, the Salvation Army's headquarters was relocated to its present location at [Bishan](/wiki/Bishan,_Singapore) and the house was sold for [S$](/wiki/Singapore_dollar)20 million to Teo Lay Swee who wanted to extend his adjacent hotel, Cockpit Hotel. The expansion plan was dropped when the Teo family sold the hotel and its surrounding land, including the House to a consortium led by the Wing Tai Group in 1996 for S$380 million. Wing Tai which invested S$1.2 million for its [restoration](/wiki/Building_restoration). ### Restoration works In 1906, a building plan was submitted to the Municipal authorities proposing to alter a single story building to a two-storey dormitory at the front half of one of the side wings; the building was originally a single-story one. A Western roof truss system was employed in the new dormitory; interestingly, the gable walls were decorated with traditional Teochew motifs to ensure it still had the same theme, stylistically similar to the rest of the house. When the Salvation Army took over the house in 1938, further enhancements were made with the addition of a garage in front of the house’s main entrance. This was later removed. After World War II, extensive reinstatement repairs were carried out from 1948 to 1951. These repairs did not significantly alter the architectural character of the house. The last major restoration took place in 2000. The house was repainted in yellow, which was its color when it became St. Mary’s Home. [University of Chicago Booth School of Business](/wiki/University_of_Chicago_Booth_School_of_Business) in 2000 for its Asian campus, before moving to Hong Kong in 2013, with the last Singapore cohort graduated in 2015. The ownership of the House was changed several times since. In 2007, Wing Tai sold the House, with the adjacent redeveloped Visioncrest office block to Union Investment Real Estate AG for S$260 million. ERC Holdings then acquired the House for S$60 million in May 2012, before selling it to Perennial Real Estate Holdings for just under S$90 million in September 2013. Perennial, together with Beijing Hospital of Traditional Chinese Medicine set up Ming Yi Guan in the House from 2017 to 2018. The House was placed on the selling block for S$93 million in 2018. In 2019,[*citation needed*] Amity Global Institute moved its school to the House. In 2022, the house was sold to the family of the Indonesian tycoon [Bachtiar Karim](/wiki/Bachtiar_Karim), with the school remaining on the premises. ## Architecture The House of Tan Yeok Nee occupies up to 2,000 square metres of elevated land along Clemenceau Avenue. Similar to the mansions of Seah Eu Chin and Wee Ah Hood, Tan Yeok Nee’s house had a *sidianjin* configuration which was auspicious given “the four double-pitched gable ends that recall the Chinese character for gold” whilst the spatial arrangement in the interior of the house reflect cultural ideals of “familial hierarchy, harmony, continuity, and order” with Confucian underpinnings. The mansion has been carefully restored with great sensitivity to ensure that the original architecture and character of the house is kept intact. The walls, [tiles](/wiki/Tile), roof, [pillars](/wiki/Column), carvings and [pottery](/wiki/Pottery) were restored to their original state of a century ago through painstaking research. However, contemporary facilities and equipment have also been incorporated to adapt the building for modern-day usage. With the wide array of beautifully restored traditional Chinese decorative elements and the convenience of present-day state-of-the-art technology around the house, this combination of 'old' and 'new' provides a unique environment rich in history and culture. The front and back portions of the house face east and west. Pillars on the front door are made of marble with colourful carvings of stories reflecting the lives of Tan Yeok Nee's [ancestors](/wiki/Ancestor) in Chaozhou. The back of the house has a distinctive style exhibited by beams with special Teochew tiles, a main pillar decorated with [gold-plated](/wiki/Gilding) carvings, and a marble floor. Exquisite, colourful tiles reflect Chinese people characters and animals. The House of Tan Yeok Nee is typical of Teochew-style residential buildings. The structure exhibits the harmony of [Yin and Yang](/wiki/Yin_and_Yang), shown at the top of the ceiling in gold, wood, water, fire, and [earth](/wiki/Earth) – the [five elements](/wiki/Wuxing_(Chinese_philosophy)). Armed with traditional philosophical ideas, the designer coordinated the entire building's design to reflect the balance and harmony represented by the five elements. This unique design not only enriches the artistic value of the walls, but also represents the unity of [prosperity](/wiki/Prosperity), [intelligence](/wiki/Intelligence_(trait)), [longevity](/wiki/Longevity), health and happiness. ## Awards - 2010 FIABCI Prix d'Excellence Award - 2011 URA Archicture Heritage Award - National Heritage Board (2002), *Singapore's 100 Historic Places*, Archipelago Press, [ISBN](/wiki/ISBN_(identifier)) 981-4068-23-3 - Amity Global Institute – Official Site - National Heritage Board, Singapore – House of Tan Yeok Nee - Biography of Tan Yeok Nee\n",
  "language": "en",
  "processed_at": "2026-01-12T11:10:55.874534",
  "title": "House of Tan Yeok Nee",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/House_of_Tan_Yeok_Nee"
}