{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:10:58.034083"
  },
  "content": "Singaporean public housing statutory board The **Housing & Development Board** (**HDB**; often referred to as the **Housing Board**; [Chinese](/wiki/Simplified_Chinese_characters): 建屋发展局; [Malay](/wiki/Malay_language): *Lembaga Pembangunan dan Perumahan*; [Tamil](/wiki/Tamil_language): வீடமைப்பு வளர்ச்சிக் கழகம்), is a [statutory board](/wiki/Statutory_boards_of_the_Singapore_Government) under the [Ministry of National Development](/wiki/Ministry_of_National_Development_(Singapore)) responsible for the [public housing](/wiki/Public_housing) in [Singapore](/wiki/Singapore). Established in 1960 as a result of efforts in the late 1950s to set up an authority to take over the [Singapore Improvement Trust](/wiki/Singapore_Improvement_Trust)'s (SIT) public housing responsibilities, the HDB focused on the construction of emergency housing and the resettlement of *[kampong](/wiki/Kampong)* residents into public housing in the first few years of its existence. This focus shifted from the late 1960s, with the HDB building flats with improved fittings and offering them for sale. From the 1970s, it initiated efforts to improve community cohesion in its estates and solicit resident feedback. In the 1990s and 2000s, the HDB introduced upgrading and redevelopment schemes for mature estates, as well as new types of housing intended to cater to different income groups in partnership with private developers. The HDB was reorganised in 2003 to better suit Singapore's housing market in the 2000s. Efforts to engage residents with upgrading schemes increased in the 2000s and 2010s, and the HDB also began solar panel installation works from the early 2010s. The HDB consists of a 12-member board and three departments, the Building, Estate and Corporate departments. Besides the provision of public housing, the HDB handles land reclamation works in Singapore and maintains the infrastructure of Singapore's national resource stockpiles. The HDB is also a major purchaser of state land from the [Government](/wiki/Government_of_Singapore) with the purchase price payable by HDB going into the [past reserves](/wiki/Reserves_of_the_Government_of_Singapore). ## History ### Background and formation By the 1940s and 1950s, Singapore experienced rapid population growth, with the population increasing to 1.7 million from 940,700 between 1947 and 1957. The living conditions of people in Singapore worsened, with many people living in informal settlements or cramped [shophouses](/wiki/Shophouse). Moreover, the [Singapore Improvement Trust](/wiki/Singapore_Improvement_Trust) (SIT), which was then responsible for public housing in Singapore, faced many problems in providing public housing, with the rents for flats being too low to be financially sustainable but unaffordable for many of the poorer people in Singapore. Delays in approval for new housing developments greatly slowed housing construction by 1958. In the mid-1950s, in light of the findings of the Committee on Local Government, the government initiated efforts to set up a new housing authority in place of the SIT. These efforts culminated in the Housing and Development Bill, which was read to the [Legislative Assembly](/wiki/Legislative_Assembly_of_Singapore) in 1958 and passed the next year. With the bill's passing, the HDB was formed in February 1960, taking over the SIT's public housing responsibilities. ### The 1960s to 1980s On the Housing & Development Board (HDB)'s formation, it announced plans to build over 50,000 flats, mostly in the city, under a five-year scheme, and found ways to build flats as cheaply as possible so that the poor could afford to stay in them. The HDB also continued the SIT's efforts in building emergency flats in [Tiong Bahru](/wiki/Tiong_Bahru), which were mostly used to rehouse people displaced by the [Bukit Ho Swee fire](/wiki/Bukit_Ho_Swee_fire) in May 1961. After the fire, the HDB focused its efforts on [Bukit Ho Swee](/wiki/Bukit_Ho_Swee)'s redevelopment, rapidly designing and constructing a public housing estate on the fire's site, with people displaced by [urban renewal](/wiki/Urban_renewal) projects and *[kampong](/wiki/Kampong)* fires rehoused in the estate's flats. Their occupants disliked the one-room emergency flats, so by the mid-1960s, the HDB had moved on to building larger flats, especially around the Central Area. Nevertheless, the Bukit Ho Swee estate marked the beginning of the HDB's resettlement efforts, and *kampong* dwellers were swiftly rehoused in public housing. By 1965, 54,430 flats had been built, with an increasing proportion of the population living in HDB dwellings. The rehousing of *kampong* dwellers allowed the HDB to pursue its redevelopment plans for the Central Area, and the Urban Renewal Department was formed within the HDB in 1966 to manage the redevelopment works. This department also handled the construction of new amenities in the Central Area and collaborated with private enterprises in constructing new buildings on cleared sites. However, by the 1970s, the urban renewal projects proved too large for the department to handle alone, so the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority), a statutory board, replaced the department in 1974. With the construction of the Bukit Ho Swee estate, the HDB also sought to change how estate residents behaved, and to give the state greater control over their lives. Moreover, with the new housing estates not segregated by race, the HDB facilitated the formation of multiracial communities in place of racially divided ones. Nevertheless, by the 1980s, racial divisions within HDB estates became increasingly pronounced, so to mitigate possible ethnic tensions, the Ethnic Integration Policy, which capped the racial proportions of residents in HDB estates, was introduced in 1989. The HDB began offering flats for purchase in 1964, but as many flat dwellers at the time could not afford to do so, it was initially not very successful. Applicants could use their [Central Provident Fund](/wiki/Central_Provident_Fund) (CPF) contributions to pay for their flats beginning in 1968. The take-up rate for flat purchases increased such that by the 1980s, most flat applicants were opting to purchase them. From the late 1960s onwards, the HDB designed flats and estates with improved amenities and fittings to improve the quality of life. To further these efforts, in the 1970s and 1980s, the HDB introduced residents committees in its housing estates to promote community cohesion, loosened regulations on flat modifications, and engaged in upgrading works. These works included the expansion of old one-room flats and the construction of new amenities in older estates. In addition, the HDB started soliciting feedback from residents through the Sample Household Surveys (SHS) from 1975. In 1982, control over the [Housing and Urban Development Company](/wiki/Housing_and_Urban_Development_Company_flats) (HUDC) was transferred to the HDB. With the prices of HUDC flats approaching those of private housing, and the middle class being able to purchase HDB flats, the HDB stopped building HUDC flats in 1985. ### 1990s to present In a bid to encourage younger people to continue living in older public housing estates, the HDB announced a large-scale upgrading scheme for those estates in 1989. Known as the [Main Upgrading Programme](/wiki/Main_Upgrading_Programme), it attempted to improve these estates by adding new facilities to these estates, improved fittings in flats and varying the looks of the housing blocks in different precincts. In addition, the HDB initiated a redevelopment programme, the [Selective En bloc Redevelopment Scheme](/wiki/Selective_En_bloc_Redevelopment_Scheme) (SERS) in 1995, in which selected housing blocks were razed and their residents compensated. SERS carried out renewal schemes in town centres in several older estates in the late 1990s. There have been a total of 81 SERS sites as of 2018. Along with the upgrading schemes, the HDB introduced several new housing schemes in the 1990s. These included the Design and Build and Design Plus schemes, with flats designed in collaboration with private architects and built to a higher standard than other flats, and executive condominiums, with amenities similar to private housing. Further schemes were introduced in the 2000s, such as Build-to-Order, in which construction of flats began only after applicants had applied for them, and the [Design, Build and Sell Scheme](/wiki/Design,_Build_and_Sell_Scheme), in which the flats were developed and sold by private developers. Nevertheless, the HDB was unable to adapt to the changes in Singapore's housing market fast enough in the early 2000s. To determine and redefine its position in the housing market, the HDB was reorganised, transferring the provision of flat loans to private banks, and corporatising its Building and Development Division to form a new subsidiary, HDB Corp. The HDB increased efforts to engage residents in its provision of public housing in the 2000s. These efforts included public consultation schemes and the [Neighbourhood Renewal Programme](/wiki/Neighbourhood_Renewal_Programme), in which facilities within multiple adjacent precincts were improved or upgraded, and residents were able to provide feedback on the planned improvements. Efforts to foster more extensive resident participation were made in 2013 with the Building Our Neighbourhood Dreams! project, in which residents could propose neighbourhood improvements instead of just providing feedback, but the initial projects were not well received. The HDB began installation of [solar panels](/wiki/Solar_panels) on public housing blocks and in its properties in the 2010s. In 2014, together with the [Economic Development Board](/wiki/Economic_Development_Board), it initiated the SolarNova programme to handle solar panel installation on government properties and buildings. ## Responsibilities Under the Housing and Development Act, the HDB is tasked to plan and carry out the construction or upgrading of any building, clear slums, manage and maintain the estates and buildings that it owns, and to provide loans to people to buy land or public housing. The HDB also carries out [land reclamation](/wiki/Land_reclamation) works and handles the infrastructure for Singapore's national resource stockpiles. ## Organisation The HDB consists of a chairman and 11 other members, along with three departments, the Building, Estate and Corporate departments, under the purview of a chief executive officer, who is a member of the board. Each department is further subdivided into different groups. The Research and Planning, Development and Procurement, Building Quality and Building and Infrastructure groups and the Building and Research Institute are under the Building department; the Estate Administration and Property, Housing Management, Community Relations and Properties and Land groups under the Estate department; and the Corporate Development, Corporate Communications, Finance, Information Services and Legal groups under the Corporate department. The HDB also controls 75% of EM Services, a company handling the upkeep of the HDB's housing estates and properties, and the properties of other public organisations. HDB employees are organised under a house union, the HDB Staff Union (HDBSU). ## Senior leadership ### List of chairmen NameYears servedRef.[Lim Kim San](/wiki/Lim_Kim_San)1960–1963[Tan Kia Gan](/wiki/Tan_Kia_Gan)1963–1966[Howe Yoon Chong](/wiki/Howe_Yoon_Chong)1966–1969[Pang Tee Pow](/wiki/Pang_Tee_Pow)1969–1970[Lee Hee Seng](/wiki/Lee_Hee_Seng)1971–1975[Michael Fam](/wiki/Michael_Fam)1975–1983[Hsuan Owyang](/wiki/Hsuan_Owyang)1983–1998[Ngiam Tong Dow](/wiki/Ngiam_Tong_Dow)1998–2003[Aline Wong](/wiki/Aline_Wong)2003–2007[James Koh Cher Siang](/wiki/James_Koh_Cher_Siang)2007–2016[Bobby Chin Yoke Choong](/wiki/Bobby_Chin_Yoke_Choong)2016–2023[Benny Lim Siang Hoe](/wiki/Benny_Lim_Siang_Hoe)2023–present - [Public housing in Singapore](/wiki/Public_housing_in_Singapore) - [New towns of Singapore](/wiki/New_towns_of_Singapore) - [Cash-Over-Valuation](/wiki/Cash-Over-Valuation) - [HLM](/wiki/HLM) (France) Library resources about **Housing and Development Board** - Resources in your library - Resources in other libraries **By Housing and Development Board** - Resources in your library - Resources in other libraries - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:10:58.033601",
  "title": "Housing and Development Board",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Housing_and_Development_Board"
}