{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:11:05.810267"
  },
  "content": "Singaporean singerMusical artistThis biography of a living person **needs additional citations for verification**. Please help by adding reliable sources. Contentious material about living persons that is unsourced or poorly sourced **must be removed immediately** from the article and its talk page, especially if potentially libelous. *Find sources:* \"Huang Qing Yuan\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(December 2016)* *(Learn how and when to remove this message)* **Huang Qing Yuan** (黃清元, born 23 July 1945) Originally named *Huang Qiming* (黄啟明), he is a famous [Singaporean](/wiki/Singapore) singer who started singing in the 1960s. He was also known as the 'Elvis of Singapore'. Huang started singing at age 7 when he joined a children's singing competition which he won and received two cans of soda as the prize. In 1958, Huang joined [Rediffusion Singapore](/wiki/Rediffusion_Singapore)'s amateur singing competition and emerged runner-up, winning $150. In 1965, Huang won the Mandarin category of Singapore's Talent Time. In 1966, he debuted his first vinyl record, *Emerald Isle In The Mood* (绿岛小夜曲). His next album, *Man Li* (蔓莉), featured the title track of the same name, which topped the charts and brought him widespread recognition. In 1968, Huang signed with Hoover Records Pte Ltd (福华唱片有限公司) after his previous contract had ended. He then recorded over 100 EPs and LPs which are still available in Singapore, Malaysia, Indonesia, and more. At the 2015 Getai Awards, he received a contribution award in honour of his 40 years of [getai](/wiki/Getai) performance. ## Personal life Huang had two heart operations in the 1980s. This article about a Singaporean singer is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:11:05.809808",
  "title": "Huang Qing Yuan",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Huang_Qing_Yuan"
}