{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:11:03.846063"
  },
  "content": "This biography of a living person **needs additional citations for verification**. Please help by adding reliable sources. Contentious material about living persons that is unsourced or poorly sourced **must be removed immediately** from the article and its talk page, especially if potentially libelous. *Find sources:* \"Huang Chen-ya\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(June 2025)* *(Learn how and when to remove this message)* **Huang Chen-ya** [MBE](/wiki/Order_of_the_British_Empire) ([Chinese](/wiki/Chinese_language): 黃震遐; born 4 November 1939[*citation needed*]) is a Hong Kong neurologist and former politician. He was a member of the [Democratic Party](/wiki/Hong_Kong_Democratic_Party) and was the member of the [Legislative Council of Hong Kong](/wiki/Legislative_Council_of_Hong_Kong) (1991–97) for [Hong Kong Island West](/wiki/Hong_Kong_Island_(constituency)). ## Biography He was a third-generation of Chinese Singaporean. His father, Huang Ying Jung, was educated law in China and the United States and obtained a doctoral degree and later opened up a law firm in [Shanghai](/wiki/Shanghai) and taught at the [National Central University](/wiki/National_Central_University) and the [Soochow University](/wiki/Soochow_University_(1900%E2%80%931952)). Born in Shanghai in 1939, Huang moved with his father to his father's birthplace in 1949, where his father took a teaching post at the [Nanyang University](/wiki/Nanyang_Technological_University) and later became university's acting vice-chancellor. Huang was educated in Singapore and Australia and attended the Medical School of the [University of Hong Kong](/wiki/University_of_Hong_Kong) in 1963. He was en editor of the student journal, *Undergrad*, and resigned from the post with other editors to protest against the university's decision to cut the Chinese version of the journal in 1965. Huang's move sparked the discussion on the discrimination against the usage of Chinese language, in which he advocated the Chinese Movement and the use of Chinese as a medium in the [Hong Kong University Students' Union](/wiki/Hong_Kong_University_Students%27_Union). He also led the students to do voluntary works in the society. In 1970, Huang moved to Australia to further his studies in neurology for 10 years. He promoted the welfare of Australian Chinese and fought against racial discrimination. In 1981, he returned to Hong Kong and took up a teaching post at the University of Hong Kong. He founded the [Hong Kong Affairs Society](/wiki/Hong_Kong_Affairs_Society) in 1984 and became its first president. Along with the [Meeting Point](/wiki/Meeting_Point) and [Hong Kong Association for Democracy and People's Livelihood](/wiki/Hong_Kong_Association_for_Democracy_and_People%27s_Livelihood), the society took the leading role in calling for increased democracy before and after 1997 as well as the implementation of the [Sino-British Joint Declaration](/wiki/Sino-British_Joint_Declaration). The society later joined the [United Democrats of Hong Kong](/wiki/United_Democrats_of_Hong_Kong), the first major pro-democracy party in Hong Kong, in 1990. He was elected as [Southern District Board](/wiki/Southern_District_Council) member in [1991 District Board elections](/wiki/1991_Hong_Kong_local_elections) in which he held the post until 2003. He was elected to the [Legislative Council of Hong Kong](/wiki/Legislative_Council_of_Hong_Kong) in the [first ever direct elections](/wiki/1991_Hong_Kong_legislative_election) in 1991 through [Hong Kong Island West](/wiki/Hong_Kong_Island_(constituency)#1991_Constituencies) with Democratic Party vice-chairman [Yeung Sum](/wiki/Yeung_Sum), receiving 31,052 votes. He was re-elected in 1995 with 31,156 votes, 66 percent of the vote share. He held the position until the end of the colonial rule when all pro-democracy Legislative Council members boycotted the Beijing-installed [Provisional Legislative Council](/wiki/Provisional_Legislative_Council) in 1997. He was involved in the development of a new programme of [Chinese input method](/wiki/Chinese_input_method) for seven years after his retirement from the politics. He is also a [Fellow of the Royal Australasian College of Physicians](/wiki/Fellow_of_the_Royal_Australasian_College_of_Physicians) and honorary clinical lecturer of the Department of Medicine at the [University of Hong Kong](/wiki/University_of_Hong_Kong). ## Previous public services - President, Federation of Medical Societies - Member, Preparatory Committee for Hong Kong Academy of Medicine - Member, Law Enforcement and Criminal Injuries Compensation Board - Member, [Southern District Board](/wiki/Southern_District_Council) - President, Senate, [United Democrats of Hong Kong](/wiki/United_Democrats_of_Hong_Kong)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:11:03.845406",
  "title": "Huang Chen-ya",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Huang_Chen-ya"
}