{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:11:11.942110"
  },
  "content": "English theatre director, drama teacher and creative consultant **Hugh Percival Cruttwell** (31 October 1918 – 24 August 2002) was a British drama teacher and consultant. He was Principal of the [Royal Academy of Dramatic Art (RADA)](/wiki/RADA) in London, England for 18 years, from 1966 to 1984. After declaring himself to be a [conscientious objector](/wiki/Conscientious_objector) and consequently serving as an agricultural labourer during [World War II](/wiki/World_War_II), he began his professional life as a teacher in private schools but in 1947 moved into theatrical production, spending several years as a stage and production manager at the [Theatre Royal, Windsor](/wiki/Theatre_Royal,_Windsor), [Berkshire](/wiki/Berkshire), England before becoming a [freelance](/wiki/Freelancer) drama director. He combined his academic and theatrical experience when he joined the teaching staff at the [London Academy of Music and Dramatic Art](/wiki/London_Academy_of_Music_and_Dramatic_Art) (LAMDA) in 1959. After seven years there he was appointed Principal of RADA where he presided over one of its most illustrious periods, training many leading actors. He was regarded as having restored the academy's position as Britain's premier drama school. In retirement he served for ten years as artistic and production consultant to the actor and director Sir [Kenneth Branagh](/wiki/Kenneth_Branagh). ## Early life Hugh Cruttwell was born in [Singapore](/wiki/Singapore) on 31 October 1918, the son of Clement Chadwick Cruttwell, a British insurance officer who spent much of his working life abroad, and Grace Fanny Cruttwell née Robin. He spent his early childhood in [Shanghai](/wiki/Shanghai), [China](/wiki/China) but at the age of 10 his mother took him with his younger sister, Marjorie, to live in Britain. Cruttwell attended [King's School, Bruton](/wiki/King%27s_School,_Bruton), a public school in [Somerset](/wiki/Somerset), England as a boarder where he developed a love of the theatre and film and became adept at \"sneaking out to watch the latest release at the local cinema\". In the school holidays he went to his grandfather's vicarage in the village of [Woodchurch](/wiki/Woodchurch,_Merseyside), [Birkenhead](/wiki/Birkenhead), England, where his mother had settled. In 1937 Cruttwell went up to [Hertford College, Oxford](/wiki/Hertford_College,_Oxford) (where an uncle, [C. R. M. F. Cruttwell](/wiki/C._R._M._F._Cruttwell), was Principal) to read modern history, graduating in the summer of 1940 in the first year of World War 2. As a conscientious objector to armed service, Cruttwell worked as an agricultural labourer for the duration of the war and then taught at a number of private [preparatory schools](/wiki/Preparatory_school_(United_Kingdom)) before teaching history at [Marlborough College](/wiki/Marlborough_College), a [public school](/wiki/Public_school_(United_Kingdom)) in [Wiltshire](/wiki/Wiltshire), England. While teaching he was “nursing an interest in theatre,\" Cruttwell told the *[New York Times](/wiki/New_York_Times)* in 1982, \"but never doing anything about it in any capacity.\" Not enjoying teaching history, in 1947 he decided on a change of direction and sought work in the theatre. ## Stage manager and theatre director At the age of 28 Cruttwell found work as an [assistant stage manager](/wiki/Stage_management) at the Theatre Royal, Windsor, Berkshire, England which then ran its own [repertory company](/wiki/Repertory_theatre). In time he progressed to stage manager and then production manager. He \"worked [his] way up\" to an associate directorship at the Theatre Royal and directed plays at Windsor and other theatres in and around London, including the [West End](/wiki/West_End_theatre), for the next ten years, though as he later confessed to the *New York Times*, he had \"a not very distinguished career as a director of several West End productions, all doomed to failure.\" ## Drama teacher Cruttwell found his métier, combining his love of theatre and his experiences of teaching and directing, when in 1959 he took up a directing and tutoring post at the London Academy of Music and Dramatic Art (LAMDA) where among the students during his time there were [Brian Cox](/wiki/Brian_Cox_(actor)), [Stacy Keach](/wiki/Stacy_Keach), [Martin Shaw](/wiki/Martin_Shaw) and [Janet Suzman](/wiki/Janet_Suzman). He remained at LAMDA for six years, until the end of 1965. ## Principal of RADA In October 1965, at the age of 46, Cruttwell was appointed principal of RADA (Royal Academy of Dramatic Art) in London. In a change from the responsibilities of previous holders of the post, Cruttwell was to be in charge only of teaching and productions, the control of administration and finance being newly devolved to separate management. Cruttwell's popular predecessor, John Fernald, had had a widely publicised disagreement with the RADA Council over matters of spending priorities and executive responsibilities. The students backed him with strikes and sit-ins but, under pressure, his resignation in May 1965 was inevitable. As a result Cruttwell inherited control of an institution whose senior management was in some disarray and whose student body harboured deep unhappiness and some resentment about Fernald's departure. Starting work at the academy in January 1966, Cruttwell declared that \"there have been so many strictures and so much bad blood, and this is the point in RADA's history when it must stop\". Cruttwell decided his first tasks, as well as soothing the academy's unsettled atmosphere, were to establish his own teaching and production proposals, and to widen the scope of student admission. Well over a thousand aspiring young actors applied for the two-year RADA acting course every year during the 1960s, every one of whom was auditioned at least once. Of that huge number of hopefuls RADA had the capacity for an intake of at most only 20 or so every other term, resulting in 80 students under instruction at any one time and only 35 to 40 students completing their training each year. As the number of applicants was whittled down during the auditioning process Cruttwell would start to identify those to whom he would like to offer places. On how he made his choices, Cruttwell told *The New York Times* in 1982 that he was \"not interested in competence\": \"I want a blank sheet on which they can write something. I can't be more precise than to say I'm looking for a capacity to transfix an audience ... If an applicant makes me sit up and take notice, that's what I want.\" In choosing students for the academy, Cruttwell \"believed in taking risks, admired eccentricity ... and had an eye for performers as well as actors,\" said his obituarist in *[The Times](/wiki/The_Times)*. \"He had an ability to discern promise in untutored aspirants whom conventional teachers might have regarded as clumsily crude.\" And as he had had experience in different fields before coming into theatre he was eager to encourage those who, like himself, had trained in other (sometimes wildly different) disciplines before taking up acting, resulting in a socially heterogeneous student intake with a wide age range. Despite his academic background he also maintained a disregard for the academic qualifications (or lack of them) of aspiring students. As a result, in the 1960s the RADA student body came to differ considerably from the perception in earlier years that it was a middle class [finishing school](/wiki/Finishing_school). In a change to the views of his predecessors, Cruttwell held to the belief that the only way to learn to act was to act. His approach was radical: he dispensed with all the existing classes except the technical ones such as voice, movement, dance, singing, improvisation, stage fighting, make-up, stage technique and so on, and the rest of the time students would rehearse and perform plays with professional directors, and for their final two terms they would rehearse and perform exclusively in RADA's public auditoria, the Vanbrugh Theatre and the Little Theatre (later named the GBS), with occasional studio productions elsewhere in the academy's buildings. Cruttwell also made immediate moves to bring the reality of modern theatre into his curriculum. His predecessor, John Fernald, had considered that \"modern\" meant [Anton Chekhov](/wiki/Anton_Chekhov). Cruttwell brought in a number of young directors to work alongside the more experienced staff, feeling it was imperative his students were introduced to truly contemporary writing and directing as well as being immersed in the classical standards of [William Shakespeare](/wiki/William_Shakespeare), [Restoration comedy](/wiki/Restoration_comedy) and, indeed, Chekhov. Outside the commercial West End of London presentation styles of production were changing; the old commercial repertory theatre tradition was fast disappearing to be replaced by subsidised theatre both in London and the provinces and new small [fringe theatre](/wiki/Fringe_theatre) venues were appearing, often in buildings not originally designed for drama. [Radio](/wiki/Radio_broadcasting) and film had long provided work for actors, but in the 1960s [television](/wiki/Television) was presenting an increasing number of acting opportunities. Cruttwell recognised that new ways required up to date acting styles and was pragmatic in preparing his actors for all the new types of acting opportunities as well as the traditional tasks that would present themselves when they left RADA. Nevertheless, RADA had to abandon television training in the early 1970s because of the cost. \"It seemed a minimal gesture anyway,\" Cruttwell told [Michael Billington](/wiki/Michael_Billington_(critic)) in 1973. \"Ideally more time would be devoted to television and films but this is only a marginal extension of the basic work.\" Cruttwell believed in exposing students to the wide variety of acting techniques rather than to any specific [Stanislavskian](/wiki/Konstantin_Stanislavski), [Strasbergian](/wiki/Lee_Strasberg) or [Adlerian](/wiki/Stella_Adler) discipline and he placed students with tutors and directors holding differing technical viewpoints, allowing the actors to find the technique and style that suited them. He maintained that with eight to twelve teachers working at the academy at any one time: \"if you wanted to instil a particular approach to acting, it would be impractical ... There may also be directors working here with whom I'm out of sympathy but whose approach I think students should learn about. It's a catholic affair.\" One of Cruttwell's students, Sir [Mark Rylance](/wiki/Mark_Rylance), later recalled: \"it was up to us to choose the technique that worked best for us. He was adamant that we were able to survive and muster ourselves believably on stage, whatever the technique we used to get there.\" Cruttwell picked the plays to be rehearsed and performed by his students and chose who should play which parts. His casting choices were \"unpredictable and daring\" according to one student. A director employed by Cruttwell, Glyn Idris Jones, had much the same view: \"At RADA you had no say in casting. Cruttwell presented you with the cast list and, though you might think some of his choices bizarre to say the least, he knew his students and had his reasons. It was up to you to get performances out of them.\" Cruttwell very rarely directed plays at RADA, but he kept a close eye on all the productions. Towards the end of rehearsal every cast faced what was universally known as \"the Cruttwell Run\", a performance of the entire production, usually in the rehearsal room, in front of Cruttwell. A former RADA student, Michael Simkins, recalled: \"They were nerve-wracking experiences - his comments at the end of these runs, delivered in his customary mixture of rumination interspersed with moments of searing conviction, provided the yardsticks by which we measured our progress.\" Aside from 'the Cruttwell Run\" he would give copious acting notes to the actors following the first public performance of a play and would also attend the final performance, expecting to find his guidance followed. Actor [Alan Rickman](/wiki/Alan_Rickman) remembered that Cruttwell's criticism of a student's performance would be \"completely unsentimental, and absolutely truthful. Even when he was telling you how terrible you were, he would be encouraging.\" Cruttwell developed a reputation for nurturing talent \"with a combination of rigour and personal attentiveness\" He told *The Guardian*: \"It's very important for actors to hear the truth about their work. I think/hope people realise that I never want to hurt anybody. I'm so interested in people, curious and fascinated. I think my students realise that I really care and want to help\". Cruttwell would meet classes regularly to talk about problems and aims and every student knew that he was always available for individual counselling. Cruttwell's responsibilities were not completely devoted to the actors. When he joined the academy a diploma course to train stage managers under the directorship of [Dorothy Tenham](/wiki/Dorothy_Tenham) had been successfully running for four years, and soon after his arrival he oversaw the establishment of a course for student directors. Further courses started in later years, mostly in technical theatre disciplines, including property making, scenic painting and design, stage carpentry and stage electrics. Cruttwell also started refresher courses for acting professionals for two or three weeks every summer, and began an American summer school to bring US acting students to the academy during the long summer vacations. In an extra-curricular activity in the autumn of 1974, Cruttwell took over from another director to rescue an ailing production of [André Roussin](/wiki/Andr%C3%A9_Roussin)'s *The Little Hut* which appeared at the [Duke of York's Theatre](/wiki/Duke_of_York%27s_Theatre) in the West End for a limited run of two months. Cruttwell's wife, [Geraldine McEwan](/wiki/Geraldine_McEwan), starred in it and won considerably better reviews than the somewhat dated play. At RADA Cruttwell won the admiration and affection of his students and often remained friends with them long after they had gone out into the professional world. He followed his students' careers \"with a loyalty that did not preclude the occasional sharp 'note' when it was needed\". Several students recalled that during their time at the academy and occasionally later in the professional world Cruttwell would come to them and use his favourite criticism: \"I don't believe a word you say\". Many successful acting names were trained by Cruttwell at RADA, among them [Stephanie Beacham](/wiki/Stephanie_Beacham), [Sean Bean](/wiki/Sean_Bean), [Richard Beckinsale](/wiki/Richard_Beckinsale), [David Bradley](/wiki/David_Bradley_(English_actor)), [Kenneth Branagh](/wiki/Kenneth_Branagh), [Ben Cross](/wiki/Ben_Cross), [Ralph Fiennes](/wiki/Ralph_Fiennes), [Iain Glen](/wiki/Iain_Glen), [Henry Goodman](/wiki/Henry_Goodman), [Michael Kitchen](/wiki/Michael_Kitchen), [Jane Horrocks](/wiki/Jane_Horrocks), [Anton Lesser](/wiki/Anton_Lesser), [Robert Lindsay](/wiki/Robert_Lindsay_(actor)), [Jonathan Pryce](/wiki/Jonathan_Pryce), [Paul Rhys](/wiki/Paul_Rhys), [Alan Rickman](/wiki/Alan_Rickman), [Mark Rylance](/wiki/Mark_Rylance), [Fiona Shaw](/wiki/Fiona_Shaw), [Timothy Spall](/wiki/Timothy_Spall), [Imelda Staunton](/wiki/Imelda_Staunton), [Juliet Stevenson](/wiki/Juliet_Stevenson), [James Wilby](/wiki/James_Wilby) and [Tom Wilkinson](/wiki/Tom_Wilkinson). Over 900 students, both acting and production, graduated from RADA during Cruttwell's 18 years as Principal. Cruttwell retired from RADA in 1984 at the age of 66. The same year he was offered the honour of [Commander of the Most Excellent Order of the British Empire](/wiki/Order_of_the_British_Empire) (CBE) for his services to theatre but he turned it down. ## Consultant to Sir Kenneth Branagh In 1986 Cruttwell was approached by his former student Kenneth Branagh to act as artistic consultant for a production of William Shakespeare's *[Romeo and Juliet](/wiki/Romeo_and_Juliet)* at the [Lyric Studio](/wiki/Lyric_Theatre_(Hammersmith)) in [Hammersmith](/wiki/Hammersmith), London which Branagh was to direct and in which he was to play Romeo. \"He would be there to monitor my performance,\" wrote Branagh in his 1989 autobiography, \"and to offer regular comments about the production.\" It was the start of a long professional partnership between Cruttwell and Branagh as the older man became production consultant and technical advisor to Branagh's and [David Parfitt](/wiki/David_Parfitt)'s [Renaissance Theatre Company](/wiki/Renaissance_Theatre_Company). Cruttwell was at Branagh's side while the actor wrote and directed his play, *Public Enemy*, and then while *Romeo and Juliet* was rehearsed and performed. Cruttwell remained as an unpaid [éminence grise](/wiki/%C3%89minence_grise) working in the shadow of Branagh and the rest of the company (including Sir [Derek Jacobi](/wiki/Derek_Jacobi), Dame [Judi Dench](/wiki/Judi_Dench) and Geraldine McEwen) for another six years as they presented multiple stage productions of mainly Shakespearean plays, and also pieces by [Ingmar Bergman](/wiki/Ingmar_Bergman) and Anton Chekhov and one-man shows by another former Cruttwell student, [John Sessions](/wiki/John_Sessions), in provincial venues, London's West End, [Dublin](/wiki/Dublin), [Helsingør](/wiki/Helsing%C3%B8r) (Elsinore) in [Denmark](/wiki/Denmark), [Los Angeles](/wiki/Los_Angeles) and in a world tour. The company also made a film adaptation of Shakespeare's *[Henry V](/wiki/Henry_V_(play))* directed by and starring Branagh in 1988. In Cruttwell's absence and without his permission being sought Branagh appointed him a consultant to the film when at the last moment before filming started he had to convince doubting [completion guarantors](/wiki/Completion_guarantee) that he had adequate experienced artistic support in both directing and starring in the film. Cruttwell, later described by Branagh as \"an enormous help\", was credited in the film as \"Technical Consultant\". The Renaissance Theatre Company was disbanded in 1992 after Branagh moved into film making. He took Cruttwell with him as his consultant and the two continued to work together for another five years. Cruttwell worked on six further films directed by Branagh, being credited as production consultant on *[Dead Again](/wiki/Dead_Again)* (1991), *[Peter's Friends](/wiki/Peter%27s_Friends)* (1992), and [*Much Ado About Nothing*](/wiki/Much_Ado_About_Nothing_(1993_film)) (1993) and he was performance consultant on [*Mary Shelley's Frankenstein*](/wiki/Mary_Shelley%27s_Frankenstein_(film)) (1994). [*Swan Song*](/wiki/Swan_Song_(1992_film)) (1992) was a short film which Cruttwell adapted for the screen from Anton Chekhov's one act play. *The New York Times* described it as \"a faithful adaptation\". It was nominated for an [Academy Award](/wiki/Academy_Awards) for Best Live Action Short Film. Finally there was [*Hamlet*](/wiki/Hamlet_(1996_film)) (1996) on which Cruttwell was again performance consultant. Branagh has recorded that when they were filming Hamlet's \"to be or not to be\" soliloquy he demanded to know why Cruttwell wanted him to do yet another of very many takes. \"Because I simply don't believe a word you say,\" was Cruttwell's response. ## Personal life Cruttwell married actress Geraldine McEwan, when he was 34 and she was 21, in [Old Windsor](/wiki/Old_Windsor), Berkshire, England on 17 May 1953. They had first met seven years before at the Theatre Royal in Windsor when as a talented 14-year-old she was playing an attendant fairy in Shakespeare's *[A Midsummer Night's Dream](/wiki/A_Midsummer_Night%27s_Dream)*. She returned to the Theatre Royal two years later as an assistant stage manager to Cruttwell's production manager and two years after that she was debuting in the West End of London. McEwan recalled of her first meeting with Cruttwell that she found him \"arresting\". They lived in an apartment off [Knightsbridge](/wiki/Knightsbridge) in central London and then in a large house overlooking [Barnes Common](/wiki/Barnes_Common) in southwest London and had two children, a son, [Greg](/wiki/Greg_Cruttwell) — who became an actor, writer and director — and a daughter, Claudia. Kenneth Branagh described Cruttwell as \"a modest, shy man\" having \"a sharpish face with the aspect of a wise old eagle, and a strong, wiry body. He was instantly commanding and completely honest.\" His obituarist in *The Times* described him as \"a man of eclectic tastes which he held with a quiet passion.\" Actor Michael Simkins remembered him as \"a figure of towering influence\". ### Filmography - *[Henry V](/wiki/Henry_V_(1989_film))* (1989) .... Technical Advisor - *[Dead Again](/wiki/Dead_Again)* (1991) .... Production Consultant - *[Peter's Friends](/wiki/Peter%27s_Friends)* (1992) .... Production Consultant - *[Swan Song](/wiki/Swan_Song_(1992_film))* (1992) .... Screenwriter - *[Much Ado About Nothing](/wiki/Much_Ado_About_Nothing_(1993_film))* (1993) .... Production Consultant - *[Mary Shelley's Frankenstein](/wiki/Mary_Shelley%27s_Frankenstein_(film))* (1994) .... Performance Consultant - *[Hamlet](/wiki/Hamlet_(1996_film))* (1996) .... Performance Consultant - *[As Dreams Are Made On](/wiki/As_Dreams_Are_Made_On)* (2004) .... Special Thanks - Profile - Hugh Cruttwell at [IMDb](/wiki/IMDb_(identifier))\n",
  "language": "en",
  "processed_at": "2026-01-12T11:11:11.941639",
  "title": "Hugh Cruttwell",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Hugh_Cruttwell"
}