{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:11:19.881731"
  },
  "content": "This article **contains promotional content**. Please help improve it by removing promotional language and inappropriate external links, and by adding encyclopedic text written from a neutral point of view. *(September 2018)* *(Learn how and when to remove this message)* **Hwa Chong** is an educational brand name in [Singapore](/wiki/Singapore) encompassing [Hwa Chong Institution](/wiki/Hwa_Chong_Institution), its affiliated institutions, as well as the former [Hwa Chong Junior College](/wiki/Hwa_Chong_Junior_College). ## Affiliated Schools The affiliated schools under the brand name \"Hwa Chong\" are referred to as the Hwa Chong Family of Schools. ### Hwa Chong Institution **Hwa Chong Institution (HCI)** is a premier educational institution in [Singapore](/wiki/Singapore). Established in January 2005 with the merger of [The Chinese High School](/wiki/The_Chinese_High_School_(Singapore)) and [Hwa Chong Junior College](/wiki/Hwa_Chong_Junior_College), the institution offers a six-year integrated program in partnership with [Nanyang Girls' High School](/wiki/Nanyang_Girls%27_High_School) leading to the [Singapore-Cambridge GCE Advanced Level](/wiki/Singapore-Cambridge_GCE_Advanced_Level) examination. ### Former Hwa Chong Junior College The former **Hwa Chong Junior College (HCJC)** is a premier [junior college](/wiki/Junior_college_(Singapore)) in [Singapore](/wiki/Singapore). Established in 1974, the college is one of the top performing junior colleges in Singapore in the 1990s. The college merged to form the current College Section of [Hwa Chong Institution](/wiki/Hwa_Chong_Institution) in January 2005 after the introduction of the Integrated Programme. ### Hwa Chong International School **Hwa Chong International School (HCIS)** is an [international school](/wiki/International_school) in [Singapore](/wiki/Singapore), and the international wing of [Hwa Chong Institution](/wiki/Hwa_Chong_Institution), its parent institution. Founded in 2005, it offers an independent international school program leading to the [International Baccalaureate](/wiki/IB_Diploma_Programme) qualification. ### Hwa Chong Institution Boarding School **Hwa Chong Institution Boarding School** is a boarding school built by the Hwa Chong family of schools, offering boarding options for students under the Hwa Chong affiliated schools, as well as students from other local institutions. ## Origin The name \"Hwa Chong\" was first used in 1972 when it was adopted as the name of Singapore's second junior college, and the first government-aided junior college. The name was intended as a direct translation of the abbreviation of the Chinese High School's native name, \"華中\" (Hua Zhong), which corresponds to \"南洋華僑中學\" (Nanyang Hua Qiao Zhong Xue). This was to reflect the affiliation of the Hwa Chong Junior College to the Chinese High School, despite being run by separate but related management committees. This is also reflected in the initial native name of the college, \"華僑中學附屬初級學院\", which translates to \"Junior College affiliated to the Chinese High School\". The name was shortened to \"華中初級學院\" in correspondence to its formal name. In 2004, the decision to merge Hwa Chong Junior College and the Chinese High School led to a conflict about the name of the merged institution due to pressure from alumni, staff, and stakeholders to preserve the name and heritage of both independent schools. After a series of balloting, the merged institution adopted the name \"Hwa Chong\" from the junior college as the formal name, while retaining the native name of the Chinese High School. ## Identity ### Emblem The emblem shared across the Hwa Chong Family of Schools is in a form of the traditional Chinese character \"華\" (huá), reflecting the school's mission of promoting the Chinese language and culture. The crest, red in colour, also bears many similarities to a burning torch of passion.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:11:19.881264",
  "title": "Hwa Chong",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Hwa_Chong"
}