{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:11:23.900985"
  },
  "content": "Singaporean sustainable products and research company **Hyflux Limited** was a Singaporean sustainable products and research company listed on the [Singapore Stock Exchange](/wiki/Singapore_Stock_Exchange) (SGX). The company was founded in 1989 by [Olivia Lum](/wiki/Olivia_Lum), Group CEO, President and Managing Director. In 2006, the company received the Water Company of the Year award, at the Global Water Awards, by the Global Water Intelligence, UK.[*citation needed*] The company was placed under judicial management (JM) on 19 November 2020 by the Singapore Courts due to excessive debts. Control of the company's operation has been transferred to the appointed judicial managers Hamish Alexander Christie and Patrick Bance of Borrelli Walsh. The company has been approved to wind up on 21 July 2021. ## History The company started initially as **Hydrochem (S) Pte Ltd** in 1989 with a start-up capital of S$20,000 and three staff, selling water treatment systems. By January 2001, Hyflux had become the first water treatment company to be listed on [SESDAQ](/wiki/SESDAQ), and was upgraded to the [Singapore Exchange](/wiki/Singapore_Exchange)'s Mainboard in April 2003. In 2008, the group had net profits of S$59 million. In 2016, the group had net profits of S$3.8 million. On 21 May 2018, the company suspended its shares and applied for court supervision to reorganise liabilities and businesses the next day. On 19 October, conglomerate [Salim Group](/wiki/Salim_Group) and energy giant [Medco Group](/wiki/MedcoEnergi) agreed to offer Hyflux a S$400 million equity injection, in exchange for a 60 per cent stake in the company once it has settled all its debts. On 30 March 2019, a protest was held by Hyflux retail investors at [Hong Lim Park](/wiki/Hong_Lim_Park) to vote against the company's restructuring deals, forcing the government to investigate against Hyflux and that [Public Utilities Board](/wiki/Public_Utilities_Board_(Singapore)) (PUB) will not take over the Tuaspring Desalination Plant at zero dollar. On 1 April, [Environment and Water Resources Minister](/wiki/Ministry_of_Sustainability_and_the_Environment) [Masagos Zulkifli](/wiki/Masagos_Zulkifli) said in Parliament that while the government understood the anxieties of retail investors, it \"cannot use taxpayers' money to help investors recoup their investment losses\". On 4 June 2021, judicial managers filed an application with Singapore's court to wind up the company after failed negotiations with an investor. On 21 July 2021, Singapore's high court has approved Hyflux to wind up and be liquidated with its judicial managers being its liquidators. ## Tuaspring Integrated Water and Power Plant In 2010, PUB announced a tender for Singapore's second and largest desalination plant, Tuaspring Desalination Plant, to be built at Tuas. Hyflux put in “an impossibly low bid” of supplying water at a first-year price of S$0.45 per cubic metre, below the price of S$0.67 per cubic metre from its next competitor Keppel Seghers and also much lower than the first-year price of water for SingSpring Desalination Plant at S$0.78 per cubic metre. To fund the plant, Hyflux issued preference shares, the first non-bank corporate perpetual issue by a Singapore company, which was over-subscribed by about six times. Hyflux won the contract in April 2011 and formed a wholly owned subsidiary Tuaspring Pte Ltd (TPL) to manage the integrated water and power plant. The desalination plant finished construction and began operations two years later in 2013 while the power plant started operation in August 2015 and selling electricity commercially in February 2016. In March 2019, PUB issued a default notice to TPL and will either take over the integrated plant or just the desalination plant if it exercised its right to terminate the water purchase agreement. It had said TPL had failed to provide required plant capacity multiple times since 2017 but had given time to TPL to resolve its operational and financial defaults. PUB clarified it will purchase the desalination plant at zero dollar as the valuation price of the plant is negative and that per the water purchase agreement, and that it will not claim compensation per the water purchase agreement as TPL is unlikely to compensate PUB. In May 2019, following financial losses from the integrated plant, PUB took over the Tuaspring Desalination Plant from Hyflux at zero dollar while [Maybank](/wiki/Maybank), its biggest secured creditor, has appointed receivers and managers from insolvency firm Ferrier Hodgson to take over the power plant. ## Legal issues On 17 November 2022, ex-CEO Olivia Lum, ex-CFO Cho Wee Peng and four other former board members were charged with violations of Singapore's Securities and Futures Act. On 12 March 2023, former independent director Lee Joo Hai, who had left Singapore, was arrested in Malaysia in a joint operation with the [Royal Malaysia Police](/wiki/Royal_Malaysia_Police). He was subsequently charged with one count of violating the Securities and Futures Act. Lee faces a potential jail term of up to seven years, a fine of up to S$250,000, or both. On 5 May, Singapore's State Court added three additional charges against Lum, citing violations of the Companies Act related to an allegation that she failed to exercise diligence in the discharge of her duties as a director. Lum faces a potential jail term of up to two years, a maximum fine of S$150,000, or both. On 7 August, former independent director, Rajsekar Kuppuswami Mitta, pleaded guilty to a charge of neglect in relation to an announcement by the company to the SGX on 7 March 2011 and was fined $90,000.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:11:23.900513",
  "title": "Hyflux",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Hyflux"
}