{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:11:27.858110"
  },
  "content": "The topic of this article **may not meet Wikipedia's notability guidelines for companies and organizations**. Please help to demonstrate the notability of the topic by citing reliable secondary sources that are independent of the topic and provide significant coverage of it beyond a mere trivial mention. If notability cannot be shown, the article is likely to be merged, redirected, or deleted. *Find sources:* \"IDA International\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(September 2015)* *(Learn how and when to remove this message)* **IDA International** was a wholly owned privatised subsidiary of the [Infocomm Development Authority of Singapore](/wiki/Infocomm_Development_Authority_of_Singapore). IDA International's operations ceased by 31 March 2016 due to a strategic realignment by IDA. ## History Singapore has been consistently highly placed in global and regional rankings for infocomm developments and usage of infocomm. In 2009 and 2010, Singapore topped the Waseda University World e-Government Ranking. Singapore topped [The World Bank](/wiki/The_World_Bank)'s [Ease of Doing Business Index](/wiki/Ease_of_Doing_Business_Index) for the fifth year in a row, making among countries that took the most steps to make it easier for local companies to operate. In response to increasing requests from foreign governments to implement public service infocomm solutions, ## Highlights - The company signed several [Memorandum of understanding](/wiki/Memorandum_of_understanding) (MOU) such as the MOU on Information and Communications Technology between the World Bank, IDA International and [International Enterprise Singapore](/wiki/International_Enterprise_Singapore), MOU with the Republic of Tatarstan - Timor-Leste's Civil Service Commissioned welcomed a joint [UNDP](/wiki/UNDP)-Government of Singapore delegation of public administration and information systems experts from IDA International to undertake a high-level assessment of the Civil Service Commission's current IT position. - Projects were launched and completed with several countries, such as with: - The Bahamas - Oman's eGovernment Architecture Framework (OeGAF), which subsequently received recognition from The Open Group Enterprise Architecture Awards. - Through the [Temasek Foundation](/wiki/Temasek_Foundation), IDA International have worked with the [Kingdom of Bhutan](/wiki/Kingdom_of_Bhutan) to transfer knowledge on eGovernment and to develop Bhutan's ICT expertise since 2012 - IDA International and [Zhuhai](/wiki/Zhuhai) signed a strategic framework agreement in November 2012 for consultancy services for Zhuhai's Smart City Plan, 2015 - Oman's Ministry of Manpower signed an agreement with IDA International on improving Oman's Visa application for manpower in April 2014 - Brunei's Authority for Info-communications Technology Industry of Brunei Darussalam signed a contract with IDA International for the development of a National ICT Manpower Masterplan in 2014 - Official website This Singapore-related article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:11:27.857789",
  "title": "IDA International",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/IDA_International"
}