{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:11:41.924574"
  },
  "content": "* *Illegal immigration to Singapore** is the process of migrating into the [Republic of Singapore](/wiki/Republic_of_Singapore) in violation of its immigration laws. Singapore is an attractive destination especially in the region as it is a country with a strong currency that offers high living standards, including in education, wages and safety as well as an overall far higher [quality of life](/wiki/Quality_of_life) compared to its neighbours. ## Overview Most illegal immigrants in Singapore often come from its neighbouring country [Malaysia](/wiki/Malaysia) as well as the [People's Republic of China](/wiki/People%27s_Republic_of_China) (PRC). As Singapore is an island country, illegal border crossings are not as prevalent. Instead, many of these illegal immigrants start out with legal visas in Singapore before subsequently overstaying in the country. To deter illegal immigration, the [Immigration and Checkpoints Authority](/wiki/Immigration_and_Checkpoints_Authority) (ICA) has warned that the punishment for illegal immigration in the country will result in a mandatory caning sentence of not less than 3 strokes and a prison sentence. It is also illegal for Singaporeans to harbour illegal immigrants. In 2021, Singaporean Xu Yixuan was sentenced to seven months' imprisonment for harbouring immigration offenders from the PRC. ### Case studies #### Illegal border crossings In 2019, a [Bangladeshi](/wiki/Bangladesh) and a Malaysian were arrested after a high-speed chase for attempting to enter Singapore's [northern coast](/wiki/North_Region,_Singapore), near [Punggol](/wiki/Punggol). In 2020, three people were arrested for attempting to enter Singaporean waters by boat before they were intercepted by the [Police Coast Guard](/wiki/Police_Coast_Guard) (PCG). The nationalities of the three was a 44-year-old Indonesian man, a 41-year-old Indonesian woman and a 39-year-old Malaysian man. #### Overstaying In 2019, a Malaysian man who had overstayed in Singapore since 1995 was sentenced to six months' imprisonment in addition to a S$2,000 fine. 64-year-old Choo Juan Suan had entered Singapore without a valid pass around July 1995. ICA officers arrested him at a flat in [Tiong Bahru](/wiki/Tiong_Bahru) that previous year after he failed to provide evidence that he was in Singapore legally other than producing a Malaysian passport. In 2021, a Malaysian man who became an overstayer in Singapore after his work permit was canceled subsequently decided to go on a crime spree, including theft and fraud. Consequently, 26-year-old Song Yin was arrested and subsequently sentenced to two months and seven weeks' jail in addition to three strokes of the cane. That same year, a Malaysian man was arrested after 20 years on the run for smuggling illegal immigrants into Singapore. 46-year-old Siva Kumar Ramachandram was arrested by the [Corrupt Practices Investigation Bureau](/wiki/Corrupt_Practices_Investigation_Bureau) (CPIB) as his original crime involved bribing a CISCO officer at the border checkpoint between Singapore and Malaysia. The officer was convicted that year for corruption and sentenced to 1 year imprisonment and fined S$2,800. Siva was given an additional six months' imprisonment on top of his original sentence of five years and 12 strokes of the cane which he had jumped while on bail. In 2022, a Malaysian man who overstayed in Singapore for about 7 years was sentenced to 14 months' imprisonment and three strokes of the cane for cheating and immigration offenses. 40-year-old Er Chern Siew had come to Singapore to find a job, but without a valid work permit, he couldn't work legally. He subsequently decided to work ad-hoc jobs illegally such as a salesman and attempted to avoid detection by continuously moving his place of residence throughout Singapore. He then engaged in rental scams, cheating 14 individuals totaling S$10,450 and was arrested after a victim filed a police report against him. ## Statistics The strict punishments for being caught as an illegal in Singapore has deterred some illegal immigrants; illegal immigration steadily declined from 2001 to 2011. Nevertheless, illegal immigration remains an issue in Singapore. In 2019, ICA carried out more than 100 operations in locations suspected in harbouring illegal immigrants throughout the country for deportation, arresting almost a thousand offenders. Of these, 128 were illegal immigrants and 804 were overstayers. - [Johor–Singapore Causeway](/wiki/Johor%E2%80%93Singapore_Causeway) - [Immigration to Singapore](/wiki/Immigration_to_Singapore) - [Permanent residency in Singapore](/wiki/Permanent_residency_in_Singapore)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:11:41.924070",
  "title": "Illegal immigration to Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Illegal_immigration_to_Singapore"
}