{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:11:43.961887"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Imbiah Lookout\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(April 2011)* *(Learn how and when to remove this message)* **Imbiah Lookout** is [Singapore](/wiki/Singapore)'s biggest cluster of attractions, it is located in [Sentosa Island](/wiki/Sentosa). The area contains 11 attractions. ## History Built in the 1980s, Imbiah lookout was unnamed until 2003. The area originally covered 30% of Sentosa's area. Later, much of Imbiah Lookout was demolished to make way for [Resorts World Sentosa](/wiki/Resorts_World_Sentosa), so that it now only covers 20% of Sentosa, which is half the area of Mount Imbiah and down its slope facing Siloso Beach. ## Attractions ### Madame Tussauds Singapore Opened on 25 October 2014, the popular wax museum originated in London displaying the waxworks of famous historical figures as well as contemporary leaders, and show business personalities. The Singapore branch consists of 5 main zones of wax figures: Music, A-List Party, Sports, History & Leaders, and Film & TV. It also incorporates a 'Spirit of Singapore' boat ride, the first boat ride in a [Madame Tussauds](/wiki/Madame_Tussauds) attraction. The 'Spirit of Singapore' boat ride takes visitors down a short trip down the history of Singapore from its founding as a small fishing village to the current metropolis. The full experience also includes a Marvel 4D cinema, a Formula One VR simulator ride, and an IIFA [International Indian Film Academy Awards](/wiki/International_Indian_Film_Academy_Awards) green carpet allowing for an immersive experience among Bollywood stars. Notable waxworks in the museum include Singapore first leaders [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) and [Yusof Ishak](/wiki/Yusof_Ishak), as well as global celebrities like [Tom Cruise](/wiki/Tom_Cruise), [Lewis Hamilton](/wiki/Lewis_Hamilton), [Cristiano Ronaldo](/wiki/Cristiano_Ronaldo), [Justin Timberlake](/wiki/Justin_Timberlake), [Benedict Cumberbatch](/wiki/Benedict_Cumberbatch), [Donnie Yen](/wiki/Donnie_Yen), [Bruce Lee](/wiki/Bruce_Lee) and ET. There is also a wax station where visitors can get their own hand waxed and take home the figurine. Madame Tussauds Singapore is housed in the same premise as the [Images of Singapore](/wiki/Images_of_Singapore) historical interactive exhibition, and is packaged as a combined experience. ### Images of Singapore Images of Singapore, at 1°15′14″N 103°49′03″E﻿ / ﻿1.2540°N 103.8176°E﻿ / 1.2540; 103.8176, is an historical museum in that exhibits the [culture](/wiki/Culture_of_Singapore) and [history of Singapore](/wiki/History_of_Singapore) using multi-media displays, multi-screen theatre presentations and lifesize tableaus depicting major events in Singapore's history. The attraction is housed in a former military hospital known as the \"Sick Quarters\", used throughout 1893–1950. The museum is near the [Singapore Cable Car](/wiki/Singapore_Cable_Car) stop at Sentosa and the [Merlion](/wiki/Merlion). It offers a chronological [history of Singapore](/wiki/History_of_Singapore) from its earliest days to the present. There are numerous exhibitions, covering the pre-British period of Malaysian rule, [British colonialism](/wiki/British_colonialism), the founding of colonial Singapore by [Thomas Stamford Raffles](/wiki/Thomas_Stamford_Raffles), the [Japanese occupation](/wiki/Japanese_occupation_of_Singapore), and the post-colonialist era under Singapore's first Prime Minister [Lee Kuan Yew](/wiki/Lee_Kuan_Yew). It was opened in 1983. The museum was closed in 2003 for a major upgrade. Experience designer [Bob Rogers](/wiki/Bob_Rogers_(designer)) and the design team BRC Imagination Arts, were tasked to undertake the retelling of the story of the multicultural melting pot of the island's citizens. When the renewed Images of Singapore experience reopened in 2005 it contained a more integrated look and additional attractions, including the multi-screen special effects show Four Winds of Singapore, a tribute to the national contributions of Singapore's [Chinese](/wiki/Han_Chinese), Eurasian, [Malay](/wiki/Malays_(ethnic_group)) and [Indian](/wiki/India) populations. The 2005 renovation won a prestigious [Thea Award](/wiki/Themed_Entertainment_Association#Awards) for \"Best Reinvention of a Cultural Heritage Center\" in April 2006. A restaurant and a souvenir shop is located inside and at the exit area of the museum. The attraction is housed in the same premises as Madame Tussauds Singapore and packaged as a single entry. ### Butterfly Park and Insect Kingdom The Butterfly Park is a landscape garden with over 15,000 live butterflies, representing more than fifty [species](/wiki/Species). Housed in a cool outdoor conservatory, these butterflies range from the 25 millimetre (1 in) *Eurema sari* to the 150 mm (6 in) *[Papilio iswara](/wiki/Papilio)*. Opened in June 1987, The Insect Kingdom houses some 3,000 species of rare insects from around the world, including a 160 mm *[Dynastes Hercules](/wiki/Hercules_beetle)* beetle. ### Sentosa 4D Adventureland The Sentosa 4D Adventureland is [Singapore](/wiki/Singapore)'s first and [Southeast Asia's](/wiki/Southeast_Asia) original 4-dimensional theatre. Opened in January 2006 at the cost of S$3.5 million, the theatre is equipped with digital projection and a DTS 6.1 sound system. Guests are seated on a motion based chair in a typical movie theatre watching a 3D show with visual effects popping out of the screen coupled with environmental effects providing a lifelike feel. The current show is the 'Journey2!' in 4D comedy, as offered in other theme parks around the world. It also has a simulation ride which is called Extreme Log Ride and also a shooting game name Desperados. All of which are in 4D. ### Sentosa CineBlast Opened in June 2007, Cineblast, which replaced Cinemania, is Singapore's only cinema ride. It features high definition wide-screen projection and a 6 axis motion system, and takes visitors on a log ride. ### Mega Adventure Park Located at the top of Mount Imbiah, [Mega Adventure Park](/wiki/Mega_Adventure_Park) is Singapore's first adventure park with one of the longest and steepest zip wires in [Asia](/wiki/Asia), a 12m high ropes course, a free-fall [parachute](/wiki/Parachute) simulator and a challenging [climbing wall](/wiki/Climbing_wall). ### Sentosa Luge & Skyride The [Sentosa Luge & Skyride](/wiki/Sentosa_Luge) has a self-steering, gravity-driven three-wheel cart. Originally from New Zealand, the non-motorised cart allows rider to speed down a hill over a course of 650 m ending at the Siloso Beach. At the end of the luge, there is the Skyride that can allow rider to see from a high view. It also can be boarded at the start of the Luge. It was opened in September 2005. ### The Flying Trapeze The Flying trapeze is a first of its kind in [Singapore](/wiki/Singapore). It allows guest to do a simulation of a [flying fox](/wiki/Flying_Fox) and at the same time bounce on to a [trapeze](/wiki/Trapeze). The minimum age should be around 4 years old to simulate The Flying Trapeze. ## Defunct attractions ### Sijori Wondergolf Sijori Wondergolf was a miniature [golf](/wiki/Golf) park. There were 54 landscaped greens set in three different 18-hole courses. It eventually went under redevelopment and will re-open in the coming years. ### Fantasy Island Fantasy Island was a water based [theme park](/wiki/Theme_park) in Sentosa. Opened in December 1994 at a cost of S$54 million, it had numerous water slides and other features. Once a very popular park, it was plagued by several accidents, including two fatalities, and this eventually led to the closure of the park on 2 November 2002. ### Volcanoland Volcanoland featured an artificial [volcano](/wiki/Volcano) along with [Mayan](/wiki/Maya_civilization) motifs and scenery. It was closed down and demolished to make way for the [new integrated resort](/wiki/Resorts_World_Sentosa) that will feature a similar attraction. ### Musical Fountain The Musical Fountain opened in 1982 and was the star attraction of its era. It underwent three extensive renovations in 1972 (construction), 1992 (upgrading project), and 1999 (major restoration and upgrading project). In 2002, world-renowned fountain designer, Yves Pepin (who also designed *[Songs of the Sea](/wiki/Songs_of_the_Sea)*) replaced all the musical fountain shows with the Magical Sentosa Show for a permanent basis but the show did not last long. After operating for 25 years, it was shut down and demolished to make way for the [integrated resort](/wiki/Resorts_World_Sentosa). Its last show was staged on 25 March 2007. It was replaced by the *[Songs of the Sea](/wiki/Songs_of_the_Sea)* show. ### Tiger Sky Tower The [Tiger Sky Tower](/wiki/Tiger_Sky_Tower) (previously known as the Carlsberg Sky Tower) is free-standing observation tower on Sentosa. At a height of 110 metres above ground and 131 metres above sea level, it offers visitors a panoramic view of Sentosa, Singapore, and the Southern Islands. On a clear day, the view extends to parts of [Malaysia](/wiki/Malaysia) and [Indonesia](/wiki/Indonesia). At ground level, visitors enter a large disc-shaped airconditioned cabin fitted with glass windows all round. The cabin then revolves slowly as it ascends the column of the tower. The cabin has a capacity of 72 visitors. The Sky Tower used to sit at the very spot of what was formerly known as the *[Dragon](/wiki/Dragon) Court*. It has a dragon statue in the centerpiece with water spouting out from its mouth. In one of its claws, it holds a previous logo of Sentosa which was used in the 1980s. Its tail ends at the dragon trail at the northern part of Imbiah Lookout. It was demolished a few months before the groundbreaking ceremony of the sky tower. It was opened on 7 February 2004, is situated in the Imbiah Lookout zone in the centre of Sentosa and can be reached by [Cable Car](/wiki/Singapore_Cable_Car), [Sentosa Luge Chair Lift](/wiki/Sentosa_Luge), by [Sentosa Express](/wiki/Sentosa_Express) or by bus. It was closed on 28 December 2018 after three cases of breakdowns were occurred. - [Sentosa Island](/wiki/Sentosa) - [Resorts World Sentosa](/wiki/Resorts_World_Sentosa) - [Tiger Sky Tower](/wiki/Tiger_Sky_Tower) - [Images of Singapore](/wiki/Images_of_Singapore) - [Sentosa Luge](/wiki/Sentosa_Luge) - [Sentosa Musical Fountain](/wiki/Sentosa_Musical_Fountain) - [Magical Sentosa](/wiki/Magical_Sentosa) - Media related to Imbiah Lookout at Wikimedia Commons - Sentosa.com: official **Imbiah Lookout** website - Official Images of Singapore Live website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:11:43.961153",
  "title": "Imbiah Lookout",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Images_of_Singapore"
}