{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:11:50.088622"
  },
  "content": "Part of a series on the[Culture of Singapore](/wiki/Culture_of_Singapore)[History](/wiki/History_of_Singapore) - [Singaporeans](/wiki/Singaporeans) - Immigration - [Holidays](/wiki/Public_holidays_in_Singapore) - [Languages](/wiki/Languages_of_Singapore) - [Multiculturalism](/wiki/Demographics_of_Singapore) - [Symbols](/wiki/National_symbols_of_Singapore) - [Women](/wiki/Women_in_Singapore) [Topics](/wiki/Outline_of_Singapore) - [Architecture](/wiki/Architecture_of_Singapore) - [Art](/wiki/Visual_art_of_Singapore) - [Cinema](/wiki/Cinema_of_Singapore) - [Cuisine](/wiki/Singaporean_cuisine) - [Festivals](/wiki/List_of_festivals_in_Singapore) - [Hawker centre](/wiki/Hawker_centre) - [Literature](/wiki/Singaporean_literature) - [Media](/wiki/Media_of_Singapore) - [Music](/wiki/Music_of_Singapore) - [National Service](/wiki/National_service_in_Singapore) - [Politics](/wiki/Politics_of_Singapore) - [Religion](/wiki/Religion_in_Singapore) - [Sports](/wiki/Sports_in_Singapore) - [Singlish](/wiki/Singlish) - [Television](/wiki/Television_in_Singapore) Research - [Bibliography](/wiki/Bibliography_of_Singapore) Symbols - [Anthem](/wiki/Majulah_Singapura) - [Flag](/wiki/Flag_of_Singapore) - [Flower](/wiki/Papilionanthe_Miss_Joaquim) - [Symbol](/wiki/Merlion) - [Oath Of Allegiance](/wiki/Singapore_National_Pledge) - Singapore portal - v - t - e **Immigration to Singapore** is the process by which people [migrate](/wiki/Human_migration) to [Singapore](/wiki/Singapore) for the purpose of residing there—and where a majority go on to become [permanent residents](/wiki/Permanent_residency_in_Singapore) and [Singaporean](/wiki/Singaporeans) [citizens](/wiki/Singaporean_nationality_law). Singapore is an attractive destination especially in the region as it is a country with a strong currency that offers high living standards, including in education, work, wages and safety as well as an overall far higher [quality of life](/wiki/Quality_of_life) compared to its neighbours. [High-net-worth](/wiki/High-net-worth_individual) or skilled immigrants worldwide are also attracted to Singapore's low [tax rates](/wiki/Tax_rates) (e.g. no [capital gains tax](/wiki/Capital_gains_tax)) and [ease of doing business](/wiki/Ease_of_doing_business). Immigration is historically the main impetus for population growth in the country since the founding of modern Singapore in the early 19th century due to its strategic location. During the 19th to 20th centuries, Singapore developed into a thriving and major [entrepôt](/wiki/Entrep%C3%B4t) as immigrants and merchants from all over Asia were attracted by its [free trade policy](/wiki/Free_economic_zone). For a long period after its founding, the majority of Singapore's population were immigrants. These immigrants also formed the bulk of the modern Singaporean population today. In the 1930s, the number of native births in Singapore would overtake net immigration. After [its separation and independence in 1965](/wiki/Singapore_in_Malaysia#Expulsion), immigration laws were modified in 1966 to reinforce Singapore's identity as a [sovereign state](/wiki/Sovereign_state). This time, the initial strict controls on immigrant workers were relaxed as demand for [labour](/wiki/Labour_(economics)) grew with increased [industrialisation](/wiki/Industrialisation). Immigration would again become the largest contributor to population increase in Singapore in the late 20th century and early 21st century. These recent immigration and immigrant workers in [Singapore](/wiki/Singapore) have been closely associated with [Singapore's further economic](/wiki/Economy_of_Singapore) [development](/wiki/Economic_development). However, the rates of immigrants into Singapore after the 1990s raised concerns and discontent among citizens, and curbs on immigration were introduced, resulting in a more stringent immigration policy since the 2010s. In 2022, the government introduced a [points-based immigration system](/wiki/Points-based_immigration_system) for skilled applicants who wish to work in Singapore. The [Immigration and Checkpoints Authority](/wiki/Immigration_and_Checkpoints_Authority) (ICA) publishes a number of criteria for eligibility for anyone who wishes to reside, study and work in Singapore. The [demographics of Singapore](/wiki/Demographics_of_Singapore) mainly consists of ethnic [Chinese](/wiki/Chinese_Singaporeans), [Malay](/wiki/Malay_Singaporeans) and [Indian](/wiki/Indian_Singaporeans), who collectively make up virtually the entirety of its citizen population (98.4%). They are the descendants of their ancestors who moved to Singapore prior to its independence, with these three ethnic groups being the forefront of the country's contemporary cultural and social customs, including its [cuisine](/wiki/Cuisine_of_Singapore), [language](/wiki/Languages_of_Singapore),[a] [religion](/wiki/Religion_in_Singapore) as well as traditions that are unique to Singapore. ## History Population growth and immigration in selected periods PeriodPopulation increaseNatural IncreaseNet Immigration1881–189143,857−30,932A74,7981901–191175,729−59,978A135,7071921–1931139,38718,176212,2111947–1957507,800395,600112,2001970–1980339,400315,40024,0001980–1990633,187438,249194,9381990–2000970,601330,030640,5712000–20101,058,988394,905664,084 - **^A** Negative figures are due to low birth rate and high death rate ### Early immigration Early population figures show that, for a long period of time, the growth of population in Singapore was fuelled by immigration that started soon after [Stamford Raffles](/wiki/Stamford_Raffles) landed in Singapore in 1819. The founding of colonial Singapore as a free port led to a rapid influx of people, initially mostly Malays, quickly followed by Chinese. It was estimated that when Raffles arrived in Singapore in January 1819, Singapore had about 120 Malays, 30 Chinese and some indigenous [Orang Laut](/wiki/Orang_Laut) tribe members. Another estimate put the total population of Singapore at 1,000, mostly of various local tribes. By 1821, the population was estimated to have increased to 4,724 Malays and 1,150 Chinese. [Javanese](/wiki/Javanese_people), [Bugis](/wiki/Bugis) and [Balinese](/wiki/Balinese_people) also began to arrive. In the first census of 1824, out of the 10,683 total, 6,505 were Malays and Bugis constituting over 60% of the population. The total population of Singapore then increased to 16,000 by 1829, 26,000 five years later, and 60,000 by the beginning of 1850. Chinese migrants started to enter Singapore from the Straits area and southern China to trade just months after it became a British settlement. Later migrant workers from China would also increase considerably to work on the pepper and [gambier](/wiki/Uncaria_gambir) plantations, with 11,000 recorded in one year. Indian migrants also arrived, mostly from [Bengal](/wiki/Bengal) and the [Coromandel Coast](/wiki/Coromandel_Coast). Singapore became one of the entry and dispersal points for a large number of Chinese and Indian migrants who came to work in the plantations and mines of the Straits Settlements, some of whom then settled in Singapore after their contracts ended. By 1860, the total population had reached around 90,000, of these 50,000 were Chinese, and 2,445 Europeans and Eurasians. The first thorough census in Singapore was undertaken in 1871, and it showed that Chinese were the largest ethnic group at 57.6%. In 1901, the total population of Singapore was 228,555, with 15.8% Malays, 71.8% Chinese, 7.8% Indians, and 3.5% Europeans and Eurasians. The Chinese population of Singapore has stayed at over 70% of the total ever since. The early population figures show that Chinese immigrants of the period were overwhelmingly male. The 1826 figures give a total population of 13,750, with 5,747 Chinese males and only 341 Chinese females, compared to 2,501 Malay males and 2,289 Malay females. The sex ratio of Indian migrants was similarly distorted. The imbalance of the sexes of the immigrant communities continued for a long time with the continual flow into Singapore of male migrant workers who were either single or had left their wives and children behind in China or India, for example the 1901 census figures show that there were 130,367 Chinese males and 33,674 Chinese females. Most of the early Chinese immigrants did not intend to settle permanently to raise their families there; they worked to send money back home, and many would return to China after they had earned enough money. For over a hundred years, the great proportion of the Chinese in Singapore were immigrants – by the late 1890s only around 10% of the Chinese population were native-born in Singapore. Later an increasing number would also choose to settle permanently in Singapore, especially in the 1920s when more chose to remain in Singapore rather than leave. Change in social attitude in the modern era also meant that Chinese women were freer to emigrate from China, and the sex ratio began to normalise in the 20th century, which led to a much greater number of people being born in Singapore. Immigration continued to be the main reason for the Chinese population increase in Singapore until the 1931–1947 period when the natural increase in population surpassed the net immigration figure. Immigration from China and India to Singapore stopped during the years of [Japanese occupation](/wiki/Japanese_occupation_of_Singapore). After the [Second World War](/wiki/Second_World_War), the immigration pattern shifted from the influx of migrants from other countries to movement of people between peninsular Malaya and Singapore, with a significant number of net migrants moving from Malaya to Singapore. However, after the declaration of independence of [Malaya](/wiki/Federation_of_Malaya) in 1957, the migration of people from Malaya began to fall. ### Post-independence immigration Population size and growth by residential status in selected years YearNumber (thousands)GrowthTotal populationPermanent ResidentsNon-residentsTotal populationPermanent ResidentsNon-residents19903,047.10112.1311.31.70%2.30%9.00%20004,027.90287.5754.51.80%9.90%9.30%20064,401.40418875.51.70%8.10%9.70%20084,839.40478.21,196.701.70%6.50%19.00%20105,076.705411,305.001.00%1.50%4.10%20125,312.40533.11,494.200.80%0.20%7.20% When Singapore became an independent nation in 1965, it signalled the end of free movement of people between Malaysia and Singapore. This and increasing job opportunities in Malaysia meant that the previous high level of movement of people between the two countries fell significantly. Net migration in Singapore dropped to 24,000 in the decade of 1970-80 due to tighter control of immigration from Malaysia and other countries. However, a lower rate of natural growth in population and the need for low-skill labour resulted in a deliberate shift in policy by the Singapore government to allow more foreigners to live and work in the country, and net migration increased in the 1980-1990 period to nearly 200,000. By the decade of 1990–2000, the net migrant number of over 600,000 had surpassed the natural growth of the population, and accounted for nearly two-thirds of the population increase. The same high level of immigration is also seen in the next decade with 664,083 net migration recorded. Curbs on immigration however began to be implemented in the 2010s to ease increasing social issues arising from the high level of immigration. The high level of foreign migrant workers in late 20th and early 21st centuries meant that Singapore has one of the highest percentages of foreigners in the world. By the middle of the 2010s, nearly 40% of the population were estimated to be of foreign origin; although many have become permanent residents, most of them were non-citizens made up of foreign students and workers including dependants. Between 1970 and 1980, the size of the non-resident population in Singapore doubled. The numbers began to increase greatly from 1980 to 2010. Foreigners constituted 28.1% of Singapore's total [labour force](/wiki/Labour_force) in 2000, to 34.7% in 2010, which is the highest proportion of [foreign workers](/wiki/Foreign_worker) in Asia. Singapore's non-resident workforce increased 170% from 248,000 in 1990 to 670,000 in 2006 (Yeoh 2007). By 2010, the non-resident workforce had reached nearly 1.09 million, of these 870,000 were low-[skilled](/wiki/Skill_(labor)) foreign workers in Singapore; another 240,000 were skilled foreign worker, better-educated S-pass or employment pass holders. Malaysia is the main source of immigrants in Singapore (386,000 in 2010), followed by China, Hong Kong, and Macau, then South Asia, Indonesia, and other Asian countries. As of June 2014, the total population of Singapore stands at 5.47 million: 3.34 million citizens and 0.53 million permanent residents (total resident number 3.87 million), with 1.60 million non-residents with work passes and foreign students. ## Statistics According to the [United Nations Department of Economic and Social Affairs](/wiki/United_Nations_Department_of_Economic_and_Social_Affairs), there were 2,841,665 foreign-born individuals living in Singapore in 2024. Country20242020201520102005200019951990 [Malaysia](/wiki/Malaysia)1,553,2491,384,5771,318,2171,085,108785,955733,158515,743349,149 [China](/wiki/China)533,745509,007532,271480,475358,888347,062306,636261,603 [India](/wiki/India)377,038336,901321,966263,621149,282108,73373,53948,762 [Indonesia](/wiki/Indonesia)180,437169,056172,869151,60591,67671,41753,14238,441 [United States](/wiki/United_States)26,70523,63822,25217,95210,1737,3724,9893,272 [Australia](/wiki/Australia)17,22215,13114,06011,3058,2367,7676,0724,549 [Taiwan](/wiki/Taiwan)11,1379,9919,6378,0045,9605,7625,0894,327 [Hong Kong](/wiki/Hong_Kong)3,5843,2163,1002,5751,9181,8531,6381,400 [New Zealand](/wiki/New_Zealand)3,3782,9662,7562,2151,6161,5231,191892 [Canada](/wiki/Canada)3,1972,8312,6652,1501,219884597393*Others*131,973131,793135,547135,34079,60433,90224,98016,589Total2,841,6652,589,1072,535,3402,160,3501,494,5271,319,433993,616729,377 ## Policy In Singapore, the term *migrant workers* is separated into *foreign workers* and *foreign talent*. *Foreign workers* refers to semi-[skilled](/wiki/Skill_(labor)) or unskilled workers who mainly work in the manufacturing, construction, and [domestic services](/wiki/Domestic_service) sectors. The majority of them come from places such as China, Indonesia, India, Malaysia, Bangladesh, Pakistan, Myanmar, Sri Lanka, the Philippines, Taiwan and Thailand, as part of bilateral agreements between Singapore and these countries. *Foreign talent* refers to foreigners with professional qualifications or acceptable degrees working at the higher end of Singapore's economy. They mostly come from India, Australia, China, Taiwan, Hong Kong, Japan, South Korea, Canada, Western Europe, New Zealand, United Kingdom and the United States. On 24 July 1998, the [Singaporean government](/wiki/Government_of_Singapore) first constructed a system under which different types of employment passes (EP) are issued to migrant workers according to their qualifications and monthly salaries. The \"P, Q, R\" employment pass system was put into practice on 1 September 1998; a new \"S\" type employment pass was later introduced on 1 July 2004. The government has also set different policies on recruiting foreign talent and foreign workers. In 2014, the Ministry of Manpower did away with their pass type category, however, the criteria remains the same. From 1 January 2017, new EP applicants will have to earn a fixed monthly salary of $3,600 or more, depending on their qualifications and experience. The different policies towards 'Foreign workers' and 'Foreign talent' in Singapore have led some people to feel that their contributions toward Singapore's development are valued differently. However, the Singapore government has always stressed the importance of migrant workers to [Singapore's economy](/wiki/Economy_of_Singapore) and development. [Senior Minister](/wiki/Senior_Minister_of_Singapore) [Goh Chok Tong](/wiki/Goh_Chok_Tong), then [Prime Minister](/wiki/Prime_Minister_of_Singapore), said in his 1997 [National Day](/wiki/National_Day) rally speech that the government's lack of restrictions on the recruitment of foreigners did not extend only to top-rung prestigious positions, but also to middle-level management, skilled worker and technician positions. ### Foreign talent In 1997, Contact Singapore was launched by the International Talent Division of the [Ministry of Manpower](/wiki/Ministry_of_Manpower_(Singapore)), beginning with six offices worldwide, to facilitate the inflow of international talent to Singapore. The Singapore Talent Recruitment (STAR) Committee was formed in November 1998 with the aim of attracting foreign talent to Singapore. Other similar programmes include Manpower 21, launched in 1999, and the International Manpower Program of the [Economic Development Board](/wiki/Economic_Development_Board). The government has developed the Scheme for Housing of Foreign Talent with the aim of providing affordable yet comfortable accommodations for foreign talent, to attract them to work and stay in Singapore. ### Foreign workers On the other hand, stringent policies and regulations have been set on employing foreign workers. In 1981, the government even announced its intention to phase out all unskilled foreign workers by the end of 1991, except domestic maids and those employed in construction and [shipyards](/wiki/Shipyard). The policy stance was met with strong protests from employers facing [labour shortages](/wiki/Labour_shortage). In April 1987, the Singapore government announced its [immigration policy](/wiki/Immigration_policy), which intended to control the foreign worker inflow. The two key elements in the policy were a monthly levy payable by the employer for each foreign worker employed, and a \"dependency ceiling\" that limits the proportion of foreign workers in the total workforce of any one employer. The government later introduced a two-tier levy system in October 1991 under which employers were required to pay a higher levy on workers whose employment would change the \"dependent ceiling\" value of the company. The levy and the \"dependency ceiling\" have remained the two instruments with which the government has regulated worker inflow in line with changes in domestic [labour-market](/wiki/Labour_economics) conditions. Non-residents working in Singapore will require a work visa. There are various types of Singapore work visas starting from work permits for the lower-skilled labourers, to P1 and P2 category Employment Passes to attract niche professionals with good credentials in both education and work experience. From 1 September 2012 only foreign workers with earnings of at least SG$4,000 (US$3,150) per month can sponsor their spouses and children for their stay in Singapore and some of them are also not allowed to bring their parents and in-laws on long-term visit passes. The new regulation also impacts those who switch companies on/after the date, but foreign workers whose families are already in Singapore won't be affected. The increase from SG$2,800 to SG$4,000 was to ease public disquiet over the influx of workers from overseas. In December 2012, there were over 1,268,300 foreign workers employed in Singapore, while in December 2018 this had increased to 1,386,000. As of 2020, foreign workers make up some three quarters of the whole construction industry, half of manufacturing, and 30 per cent of services. ### 2013 Population White Paper In early 2013, the [Singapore parliament](/wiki/Parliament_of_Singapore) debated over the policies recommended by the Population White Paper entitled *A Sustainable Population for a Dynamic Singapore*. Citing that Singapore's 900,000 Baby Boomers would comprise a quarter of the citizen population by 2030 and that its workforce would shrink \"from 2020 onward\", the White Paper projected that by 2030, Singapore's \"total population could range between 6.5 and 6.9 million\", with resident population between 4.2 and 4.4 million and citizen population between 3.6 and 3.8 million. The White Paper called for an increase in the number of foreign workers so as to provide balance between the number of skilled and less-skilled workers, as well as provide healthcare and domestic services. It also claimed that foreign workers help businesses thrive when the economy is good. The motion was passed albeit after amendments made to leave out \"population policy\" and add focus on infrastructure and transport development. The White Paper was criticised by opposition parties. Member of Parliament [Low Thia Khiang](/wiki/Low_Thia_Khiang) of the [Workers' Party of Singapore](/wiki/Workers%27_Party_of_Singapore) had criticised current measures of increasing the fertility rate, claiming that the high cost of living and lack of family and social support discouraged young couples from having babies. As for current immigration policies, he had noted that immigrants were a source of friction for Singaporeans and that an increased population would put more stress on the already strained urban infrastructure. PAP MP Inderjit Singh had also spoken out on the issue, citing cohesion and social issues that would have been made worse with the proposed immigrant influx rate. On 16 February 2013, nearly 3,000 people rallied to protest the White Paper and raise concerns that the increased population would lead to the deterioration of public service and the increase of the cost of living in the future. ## Impact When immigration significantly increased during the 1980s, concerns were raised by some Singaporeans about the government's policy on immigration. While the inflow of immigrants and foreign workers have helped to alleviate a labour crunch and boost the economy, it has also resulted in strong sentiment by some locals against both foreigners and the government, and was a major issue in both the 2011 [general](/wiki/2011_Singaporean_general_election) and [presidential](/wiki/2011_Singaporean_presidential_election) elections. Singaporeans have attributed to the government's immigration policy that will lead to the country's overcrowding and falling reliability of its public transportation system, increasing property prices for housing, suppressed wage level, increased competition for jobs and education, increasing income inequality and other social problems. These issues came under closer scrutiny in the aftermath of the [2013 Little India riot](/wiki/2013_Little_India_riot). ### Behavioural incidents by foreigners The government have also spoken out against a rising anti-foreigner sentiment after Singaporeans expressed outrage at disparaging statements made by foreigners residing in Singapore. For example, in March 2012, Sun Xu, a scholar from China studying in the [National University of Singapore](/wiki/National_University_of_Singapore), made a remark in his blog that \"there are more dogs than humans in Singapore\". He was eventually expelled by the university for his conduct and deported. This was also weeks after a revelation in parliament that SG$36 million worth of scholarships were awarded to 2,000 foreign students every year. The government was accused of disadvantaging local students in places for education and affordability, and in response it has made a policy change in primary education to give more priority to Singaporeans. Further incidents have also fanned local sentiments against expatriates and foreign workers in Singapore, for example, the publicity over negative comments about the locals in 2014 by British banker Anton Casey, who was a [permanent resident](/wiki/Permanent_residency) (PR), and in 2015 by Filipino nurse Ed Mundsel Bello Ello. #### Anton Casey British national Anton Casey had posted comments on Facebook which had abused, variously, a taxi driver and Singaporean commuters on public transport in general. Casey's comments also made headlines on various news outlets in his native country of the United Kingdom, with other Britons criticising his behaviour and that he should be deported. Casey was eventually fired from his job, and had his PR revoked, subsequently moving to [Perth](/wiki/Perth), Western Australia. However, a report two years later in 2016 added that Casey could have possibly returned to Singapore, this time living a low-profile life. #### Ello Ed Mundsel Bello Filipino national Ello Ed Mundsel Bello suggested via online posts that \"Filipinos were better and stronger\", and that he would \"evict Singaporeans from their country\" as well as \"take over their jobs, women and future\". He was eventually fired from his job as a nurse at [Tan Tock Seng Hospital](/wiki/Tan_Tock_Seng_Hospital) and sentenced to four months imprisonment at the [State Court](/wiki/State_Courts_of_Singapore) for his various seditious posts and lying to the police, with the judge adding that not only did he incite \"public disquiet and impassioned responses\", but also potentially harmed relations between Singaporeans and Filipinos, especially when local-foreigner relations are a \"challenging fault line in society\". He was also subsequently deported after the end of his jail term. ### Responses The government responded that it acknowledged such social concerns, with various measures put in place within the last few years, such as the [Fair Consideration Framework](/wiki/Fair_Consideration_Framework) and the Tripartite Alliance for Fair Employment Practices and increasing support for migrant workers. Furthermore, some foreigners who were interviewed by [CNA](/wiki/CNA_(news_channel)) did not feel much anti-foreigner sentiments. Singaporeans have also written in to the press to encourage fellow Singaporeans to have a mindset of being more accepting towards other cultures, reminding them that Singapore is also from immigrant stock from previous centuries. Media reports of foreign workers helping out in distress situations have also helped improve locals' perception of them. - [Singaporean nationality law](/wiki/Singaporean_nationality_law) - [Immigration and Checkpoints Authority](/wiki/Immigration_and_Checkpoints_Authority) - [National Registration Identity Card](/wiki/National_Registration_Identity_Card) ## Notes ### Bibliography - Prema-Chandra Athukorala; Premachandra Athukoralge; Chris Manning (1999). *Structural Change and International Migration in East Asia: Adjusting to Labour Scarcity*. Oxford University Press. [ISBN](/wiki/ISBN_(identifier)) 978-0-19-554173-1. - Low, Linda (June 2002). \"The Political Economy of Migrant Worker Policy in Singapore\". *Asia Pacific Business Review*. **8** (4): 95–118. [doi](/wiki/Doi_(identifier)):10.1080/713999166. [S2CID](/wiki/S2CID_(identifier)) 154305154. - Library resources in your library and in other libraries about Immigration to Singapore\n",
  "language": "en",
  "processed_at": "2026-01-12T11:11:50.088091",
  "title": "Immigration to Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Immigration_to_Singapore"
}