{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:11:57.933341"
  },
  "content": "Singaporean insurance company **Income Insurance Limited**, commonly known as **Income** and previously also known as **NTUC Income**, is a Singaporean insurance company that offers life, health and general insurance. Initially founded as a [cooperative](/wiki/Cooperative) in 1970 under the [National Trades Union Congress](/wiki/National_Trades_Union_Congress) (NTUC), it was restructured as a public non-listed company limited by shares in 2022 as part of a corporatisation exercise. ## History The idea of co-operatives, also known as social enterprises, was first conceived at NTUC's Modernisation Seminar in 1969, where delegates from NTUC-affiliated unions gathered to discuss the challenges Singaporean workers were facing. Then, Singapore was a developing nation with a population comprising mostly blue-collar and low income workers. One of the founding leaders of NTUC, [Devan Nair](/wiki/Devan_Nair), articulated the need for the labour movement to turn into a social institution to serve Singaporean workers in various ways. Then-Finance Minister [Goh Keng Swee](/wiki/Goh_Keng_Swee) supported this and urged NTUC to set up social enterprises in areas such as life insurance and essential consumer goods to meet the needs of the working population. NTUC Income was established on 11 September 1970, with seven life trustees, which included Goh Keng Swee, Devan Nair, Minister for Law and Minister for National Development [Edmund W. Barker](/wiki/Edmund_W._Barker), MP for Moulmein and NTUC deputy secretary-general [Lawrence Sia](/wiki/Lawrence_Sia) and [Ee Peng Liang](/wiki/Ee_Peng_Liang). In April 2010, NTUC Income launched the Income Family Micro-Insurance and Savings Scheme (IFMISS), a free insurance scheme for low-income households with young children. In August 2013, NTUC Income became the first insurer in Singapore to provide insurance coverage specially designed for children with autism. The plan provides coverage for medical expenses from accidents and infectious diseases. In December 2014, NTUC Income expanded its insurance coverage for the special-needs community when it unveiled SpecialCare (Down Syndrome). In 2021, NTUC Income also expanded to Indonesia, Malaysia, and Vietnam with partnerships in those countries, operating by an insurance-as-a-service model. On 6 January 2022, NTUC Income announced it would be restructured from a cooperative to a company and rebranded as Income Insurance Ltd, amid stiff competition in the insurance industry, with no changes to staff and existing policyholders' coverage. NTUC Enterprise would remain the majority shareholder. The corporatisation exercise was completed on 1 September 2022. ## Proposed sale of majority stake to Allianz In July 2024, the NTUC Enterprise co-operative gave an irrevocable undertaking to sell a majority 51% stake of Income Insurance Ltd to German insurer [Allianz](/wiki/Allianz). NTUC Enterprise Chairman [Lim Boon Heng](/wiki/Lim_Boon_Heng) stated that \"is a capital-intensive business and to grow, there is a need to tap the capital markets\" and that the sale was necessary because the \"strength of Allianz’s financial position will provide additional support to Income Insurance where required\". In Parliament, Minister of State [Alvin Tan](/wiki/Alvin_Tan_(politician)) explained that NTUC Income operated in a competitive environment and its capital buffers had repeatedly come under pressure: \"NTUC Enterprise has supported Income with capital injections and will continue to do so\", but \"NTUC Enterprise could not continue to operate on its own\". Second Minister for Finance [Chee Hong Tat](/wiki/Chee_Hong_Tat) further assured Parliament that after the sale, NTUC Income's social mission would not change, it \"will continue to look after the well-being, especially of the lower-income policyholders\", and the \"MAS [the Monetary Authority of Singapore] will look at the interests of the policyholders\". ### Reactions Reactions to the deal were largely negative, which included the company's former CEO [Tan Suee Chieh](/wiki/Tan_Suee_Chieh) and diplomat [Tommy Koh](/wiki/Tommy_Koh) being opposed to the deal. The Singapore Government announced on 14 October 2024 that it had blocked the deal. In December 2024, it was reported that Allianz had decided not to proceed with the acquisition. The failed deal became a flashpoint during the [2025 Singaporean general election](/wiki/2025_Singaporean_general_election). On 30 October, Lim retired from his role as chairman of NTUC Enterprise Co-operative citing that he takes 'ultimate responsibility' for failed Income-Allianz deal.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:11:57.932860",
  "title": "Income Insurance",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Income_Insurance"
}