{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:11:59.893207"
  },
  "content": "* *Income tax** in [Singapore](/wiki/Singapore) involves both [individual income tax](/wiki/Individual_income_tax) and [corporate income tax](/wiki/Corporate_income_tax). Income earned both inside and outside the country for individuals and corporate entities is taxed ## Individual income tax Individual income tax in [Singapore](/wiki/Singapore) is payable on an annual basis, it is currently based on the [progressive tax](/wiki/Progressive_tax) system (for local residents and tax residents), with taxes ranging from 0% to 22% since Year of Assessment 2017. The Year of Assessment (YA) is based on the [calendar year](/wiki/Calendar_year) commencing 1 January to 31 December, and is payable on a preceding year basis, whereby taxes payable per year of assessment is based on income earned in the preceding calendar year. Taxation is based on the source principle, in which only income earned at source, in this case in [Singapore](/wiki/Singapore), or those derived from overseas but received in [Singapore](/wiki/Singapore), are taxable. Any income arising from sources outside Singapore and received in Singapore on or after 1 January 2004 by an individual (other than partners of a partnership) is exempt from [tax](/wiki/Tax). This system has the potential to allow for tax avoidance practiced by individuals who derive income from abroad, gain [tax exemptions](/wiki/Tax_exemption) via their non-resident status there, and use this income outside Singapore. Expatriates and foreign workers in Singapore are also liable for paying income tax. ## Corporate income tax Corporate income tax like individual income tax is payable on an annual basis. However, foreign income earned by a Singapore company may require dual taxation once in the income origin country and in Singapore. In such a case, companies can claim Foreign Tax Credit (FTC) payable on the same income. As companies are taxed only on the preceding year, there is a need for business owners to truly understand the difference between \"year of assessment\" and \"basis period\". Companies are taxed at a flat rate of 17% of their chargeable income. This applies to both local and foreign companies. Foreign-sourced dividends, foreign branch profits and foreign-sourced service income remitted into Singapore on or after 1 June 2003 by a Singapore resident company will be tax exempt if: - the headline tax rate of the foreign country from which income is received is at least 15 percent in the year the income is received, and - the foreign income had been subjected to tax in the foreign country from which it was received. - Information on Individual Income Tax - Income Tax Act[*permanent dead link*] - Singapore Personal Income Tax Rates\n",
  "language": "en",
  "processed_at": "2026-01-12T11:11:59.892728",
  "title": "Income tax in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Income_tax_in_Singapore"
}