{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:12:06.327100"
  },
  "content": "Ethnic groupEthnic group **Indian Singaporeans** are Singaporeans of [Indian](/wiki/Indian_people) or broader [South Asian](/wiki/South_Asian_diaspora) [ancestry](/wiki/Ancestor). As of the 2020 census, they constitute approximately 9.0% of the country's residents, representing the third largest [ethnic group](/wiki/Ethnic_group) in [Singapore](/wiki/Singapore). In Singapore, \"Indian\" is an umbrella term defined in both [geographical](/wiki/Geographical) and [ethnic](/wiki/Ethnicity)-[cultural](/wiki/Culture) contexts as pertaining to [South Asia](/wiki/South_Asia) and bears no necessary relation to the contemporary [Republic of India](/wiki/Republic_of_India). Some Singaporeans of South Asian ancestry would simply just consider themselves \"Singaporean\", viewing themselves as distinct from the \"India Indians\" in terms of culture, identity and social reality. The historical presence of [ancient India](/wiki/Greater_India) influenced the indigenous [Malay](/wiki/Malay_Singaporeans) culture long before the [founding of modern Singapore](/wiki/Founding_years_of_modern_Singapore) by the British Empire in 1819. Early Indian settlement was largely transient, composed primarily of male workers and soldiers. By the mid-20th century, however, the community had become more established, exhibiting a balanced [gender ratio](/wiki/Sex_ratio) and a diversified [age distribution](/wiki/Demographic_profile). This period marked the emergence of a cohesive Indian Singaporean identity within the evolving social fabric of the island. Indian Singaporeans are linguistically and religiously heterogeneous, with ethnic [Tamils](/wiki/Tamils) forming about half of the community. Over two centuries, Indian Singaporean culture has evolved distinctly from contemporary South Asian cultures, with its elements increasingly integrated into the broader [Singaporean culture](/wiki/Culture_of_Singapore), alongside influences from the [Chinese](/wiki/Chinese_Singaporeans) and [Malay](/wiki/Malay_Singaporeans) communities. Individuals of Indian descent have historically contributed prominently to national life, with representation in [politics](/wiki/Politics_of_Singapore), [education](/wiki/Education_in_Singapore), [diplomacy](/wiki/Foreign_relations_of_Singapore), [law](/wiki/Law_in_Singapore) and sports. ## Definition of Indian Singaporeans The [Singapore Department of Statistics](/wiki/Organisation_of_the_Government_of_Singapore#Departments/Divisions_10) broadly defines \"Indian\" as a \"[race](/wiki/Race_(classification_of_human_beings))\" or \"[ethnic group](/wiki/Ethnic_group)\", comprising \"persons of Indian, Pakistani, Bangladeshi or Sri Lankan origin such as [Tamils](/wiki/Tamils), [Telugus](/wiki/Telugus), [Malayalis](/wiki/Malayali), [Punjabis](/wiki/Punjabis), [Bengalis](/wiki/Bengalis) and [Sinhalese](/wiki/Sinhalese_people), etc.\" In Singapore, the Indian population can be defined by nationality and residency status. Most ethnic Indians are Singaporeans or [permanent residents](/wiki/Permanent_residency_in_Singapore), commonly referred to as \"Indian Singaporean\" or \"local Indians\". They range from second to fifth generation descendants of migrants from [South Asia](/wiki/South_Asia), many of whom retain minimal or negligible connections to the region and consider its contemporary nations as foreign. Foreign citizens of the [Republic of India](/wiki/Republic_of_India) are generally termed \"Indian nationals\" or informally \"Indian Indians\". Foreign Indians can also be differentiated by their residency status. For instance, a significant proportion are ethnic South Asian [immigrant workers in Singapore](/wiki/Immigrant_workers_in_Singapore). Demographic statistics are generally restricted to \"Singapore residents\", defined as both Singaporean citizens and permanent residents. Many of the statistics about Indians in Singapore in this article are restricted to this group. Scholars have noted \"(o)fficial figures for workers on temporary contracts are difficult to obtain because the Ministry of Manpower in Singapore considers the information sensitive.\" Consequently, there is limited information about short-term or 'non-resident' Indians in Singapore. Note that use of the term 'non-resident' Indian should not be confused with the concept of the [Non Resident Indian](/wiki/Non-resident_Indian_and_person_of_Indian_origin) or NRI, which the government of the Republic of India uses to describe its citizens living abroad. In Singapore, an NRI may be statistically non-resident (in the case of work permit or pass holders) or he/she may be considered a Singapore resident (in the case of permanent residents). ## Ethno-linguistic profile of Indian Singaporeans Indian Singaporean are grouped according to their respective ethnolinguistic backgrounds in the [Indian subcontinent](/wiki/Indian_subcontinent) or 'dialect group'. Most Indians in Singapore have ancestral links to [Southern India](/wiki/South_India) and [Sri Lanka](/wiki/Sri_Lanka), with substantial groups from [Northern India](/wiki/North_India) and [Western India](/wiki/Western_India) accounting for most of the remainder. These are generally the descendants of both free and indentured settlers from [India](/wiki/India) during the 19th and early half of the 20th century. In 2010, the [Singapore](/wiki/Singapore) census categorised 237,473 Singaporeans and 110,646 permanent residents into a number of '[dialect](/wiki/Dialect)' groups. However, these groups included [Sikhs](/wiki/Sikhs), who are an ethnoreligious rather than linguistic group. Virtually all of the Sikhs are [Punjabi](/wiki/Punjabis), which was also captured as a separate 'dialect' category (comprising mainly Hindu Punjabis). Given their small absolute and relative numbers, the following table adapts the 2010 census data by combining the 'Sikh' (12,952) and 'Punjabi' (5,672) category under 'Punjabi'. The percentages in the table refer to the proportion of each language group within the larger Resident Indian community in Singapore. **Population Profile of Singapore Indian Dialect Groups** (*Residential population; Singaporeans and permanent residents*) Ethno-linguistic backgroundAncestral origin2010 censusPercentage[Tamil](/wiki/Tamils)[Tamil Nadu](/wiki/Tamil_Nadu) [Sri Lanka](/wiki/Sri_Lanka) [Puducherry](/wiki/Puducherry_(union_territory))188,59154.18%[Malayali](/wiki/Malayali)[Kerala](/wiki/Kerala) [Lakshadweep](/wiki/Lakshadweep)26,3487.57%[Punjabi](/wiki/Punjabis)[Punjab](/wiki/Punjab_region)18,6245.35%[Gujarati](/wiki/Gujarati_people)[Gujarat](/wiki/Gujarat)4,1241.18%[Sindhi](/wiki/Sindhis)[Sindh](/wiki/Sindh)3,9711.14%[Sinhalese](/wiki/Sinhalese_people)[Sri Lanka](/wiki/Sri_Lanka)3,1400.90%[Telugu](/wiki/Telugu_people) [Bengali](/wiki/Bengalis) [Hindustani](/wiki/Hindustani_people) [Indo-Portuguese](/wiki/Luso-Indian) ([Kristang](/wiki/Kristang_people)) [Parsi](/wiki/Parsi) Other or Mixed[Note 3][Andhra Pradesh](/wiki/Andhra_Pradesh) [Telangana](/wiki/Telangana) [Bengal](/wiki/Bengal) [Goa](/wiki/Goa) *Various*103,32129.68%348,119100% The Singaporean Indian demographic is characterised by an ethnic [Tamil](/wiki/Tamil_people) majority (54.18%) and a large number of smaller groups. Ethnic [Tamils](/wiki/Tamils) in Singapore include the descendants of Tamil settlers from India and [Sri Lanka](/wiki/Sri_Lankan_Tamils) (sometimes referred to as '[Ceylonese](/wiki/Ceylon)'). Ethnic [Malayalees](/wiki/Malayalee), tracing their heritage to [Kerala](/wiki/Kerala) in southern India, form the second largest community, making up 7.57% of the local Indian population. Tamils and Malayalees are the two main [South Indian](/wiki/South_India) ethnolinguistic communities in Singapore, forming two-thirds of the Indian population. Meanwhile, the three main [North Indian](/wiki/North_India) ethnolinguistic groups in Singapore (the [Punjabi](/wiki/Punjabis), [Gujarati](/wiki/Gujarati_people), and [Sindhi](/wiki/Sindhis) communities) constitute 7.67% of the Singaporean Indian populace. The remaining 29.68% is composed of many smaller groups with ancestry from both southern India (such as the [Telugus](/wiki/Telugu_people)) and northern India (such as the [Hindustanis](/wiki/Hindustani_people), the Malay colloquial term for Hindi-speaking Indians), or ethnically mixed Singaporeans with paternal Indian ancestry. ## History ### Pre-colonial period Ancient [India](/wiki/History_of_India) exerted a profound influence over Southeast Asia through [trade](/wiki/Spice_trade), [religious missions](/wiki/Ashoka#Buddhist_missions), [wars](/wiki/Rajendra_Chola#Overseas_conquests) and other forms of contact. [Pre-colonial](/wiki/Early_history_of_Singapore) Singapore was part of 'Indianised Kingdoms' like [Srivijaya](/wiki/Srivijaya) and the [Majapahit](/wiki/Majapahit), which formed part of a cultural region known as [Greater India](/wiki/Greater_India). Prior to the spread of [Islam](/wiki/Islam), Singapore and the rest of the [Malay world](/wiki/Malay_world), was Hindu-Buddhist. One of the most extensive and enduring Indian influence in [Malay](/wiki/Malays_(ethnic_group)) culture is the vast number of [Indian loan words](/wiki/Malay_language#Vocabulary_and_borrowed_words) in the [Malay language](/wiki/Malay_language). Indian influence is also seen in symbols and mythology associated with ancient Singapore. The [Sejarah Melayu](/wiki/Sejarah_Melayu) or Malay Annals describe the Indian prince who founded Singapore – [Sang Nila Utama](/wiki/Sang_Nila_Utama) – as being a descendant of [Alexander the Great](/wiki/Alexander_the_Great) and an Indian Princess. Meanwhile, the royal and sacred associations of [Fort Canning Hill](/wiki/Fort_Canning_Hill), the seat of ancient rulers, are related to the Hindu [Mount Meru](/wiki/Mount_Meru) concept. Archaeological digs have unearthed Hindu-Buddhist artefacts from the pre-colonial period. In 1822, [John Crawfurd](/wiki/John_Crawfurd) documented the ruins of a Hindu or Buddhist temple on [Fort Canning Hill](/wiki/Fort_Canning_Hill). Singapore's two most important pre-colonial artefacts are the [Singapore Stone](/wiki/Singapore_Stone), which is inscribed with an [Indic script](/wiki/Indic_script) and a gold armlet bearing the motif of a Hindu 'kala' head. ### Colonial period: 1820s–1950s #### Migration and settlement Following the Portuguese colonisation of [Malacca](/wiki/Sultanate_of_Malacca) ([Malaysia](/wiki/Malaysia)) in 1511, the Portuguese government encouraged their explorers to bring their married Indian women who were converted already to Roman Catholic Christianity, under a policy set by [Afonso de Albuquerque](/wiki/Afonso_de_Albuquerque), then [Viceroy](/wiki/Viceroy) of [India](/wiki/Portuguese_India). These people were [Goan Catholics](/wiki/Goan_Catholics) ([Konkani](/wiki/Konkani_people) Catholics) and [Bombay East Indians](/wiki/Bombay_East_Indians) (Catholics of [Marathi descent](/wiki/Marathi_people)). Kuparis who were of mixed Samvedic Brahmin, Goan and Portuguese descent also arrived. [Sinhalese](/wiki/Sinhalese_people) and their children from Portuguese that include [Portuguese Burghers](/wiki/Portuguese_Burghers) from [Portuguese Ceylon](/wiki/Portuguese_Ceylon) also came later. Their children already intermarried with Malay population, losing their ethnic identities. Indian contact was rekindled from 1819 to [World War II](/wiki/World_War_II), when both [India](/wiki/British_India) and Singapore were under [British colonial rule](/wiki/British_Empire). Unlike earlier forms of contact, this led to mass migration and, eventually, the formation of a large, settled and distinct population. By 1824, Singapore's first census counted 756 Indian residents, or about 7% of the total population. In 1826, official figures give a total population of 13,750, of which 1,021 are Indians – 244 from [Bengal](/wiki/Bengal) and 777 from the [Coromandel Coast](/wiki/Coromandel_Coast), most of whom were males. Initially, Indian immigrants were predominantly adult men who came from India to find work, serve military duties or prison sentences for several years before returning home. There was a constant flow of Indians in and out of the city, keeping the local community fairly transient. A minority of Indians were also wealthy merchants who settled in Singapore and built local commercial and social institutions. Best known amongst them was [Naraina Pillai](/wiki/Naraina_Pillai), the earliest Indian community leader and the island's first building contractor. In 1827, he also founded the [Sri Mariamman Temple](/wiki/Sri_Mariamman_Temple,_Singapore), Singapore oldest Hindu place of worship. The influx of Indians in the half century after 1819 led to a brief period when Indians, for the only time, overtook the Malays to become the second largest ethnic group. In 1860, they formed 16% of the population. However, their number then fell from 13,000 that year to 12,000 in 1880, or 8.7% of the population. Following this, Indians slowly began to settle permanently in greater numbers and the relative size of the community in colonial Singapore became stable, fluctuating between 7.7% and 9.4%. #### Social characteristics Scholars have characterised the Indian community in colonial times as being diverse and highly stratified along class lines. According to Dr Rajesh Rai, the social hierarchy comprised four main groups: the educated professional elite (over 0.5% of the Indian community), mercantile groups (under 10%), the white collar middle class (5–7%) and the uneducated labourers (over 80%). Economic class and job functions were also aligned with the ethnic origins of immigrants. For example, [Sri Lankan Tamils](/wiki/Sri_Lankan_Tamil) and [Malayalees](/wiki/Malayalee) formed the core of the English educated upper middle class. Mercantile families tended to be [Sindhi](/wiki/Sindhi_people), [Gujarati](/wiki/Gujarati_people), and Tamil Muslim. South Indian upper caste Hindus tended to perform traditional skilled jobs, such as moneylenders ([Chettiars](/wiki/Chettiars)) and priests ([Brahmins](/wiki/Brahmins)). [Sikhs](/wiki/Sikh) were often policemen or private security guards. Most of these migrants were voluntary migrants who entered and left Singapore freely on their own resources. Unskilled [coolies](/wiki/Coolies) tended to be landless Tamil peasants from the [Shudra](/wiki/Shudra) caste as well as [Adi Dravidas](/wiki/Adi_Dravida) or '[Untouchables](/wiki/Untouchable_(social_system))'. These were often indentured labourers who were brought through various labour recruitment systems to work on rubber plantations in [Malaya](/wiki/Peninsular_Malaysia). Many later came to work in Singapore once free of their bonds. Another group which was less than free was the military. The first Indians in Singapore were 120 [sepoys](/wiki/Sepoys) in the Bengal Native Infantry and a 'bazaar contingent' of washermen, servants and others who came with [Stamford Raffles](/wiki/Stamford_Raffles) on his first visit in 1819. Throughout the colonial period, military personnel came from all over India. Most returned home after their service without settling in Singapore. Finally, there were the convicts. In the 19th century, the British shipped Indian convicts to Singapore to relieve overcrowded Indian jails. These men (and some women) were used as labour to build public buildings and roads in Singapore. Like the sepoys, they came from all parts of India. While some returned to India, several settled in Singapore after serving their sentences. #### Social reform movements From the 19th century, **[Hindu reform movements](/wiki/Hindu_reform_movement)** emerged in India as part of a broader cultural modernisation. These movements sought to promote what they saw as a more authentic form of Hinduism while addressing social abuses, such as the [Hindu caste system](/wiki/Hindu_caste_system). These movements spread to overseas Indian communities, including Singapore. Groups like the [Ramakrishna Mission](/wiki/Ramakrishna_Mission), [Arya Samaj](/wiki/Arya_Samaj) and Sree Narayana Mission were active conduits of this reform movement. Traditional religious practices, especially among lower caste Hindus, centred around various rural folk traditions, esoteric rituals and superstitions. In contrast, the new movement appealed to better educated urban Hindus, by conducting religious education classes for children and adults, and interpreting the values, concepts and principals behind the religion for lay people. These groups also encouraged a more direct relationship with God, unmediated by Brahmin priests and rituals, through individual devotion (stemming from the [Bhakti movement](/wiki/Bhakti_movement)), chanting Bhajans, or hymns, as well as through [yoga](/wiki/Yoga). Charitable service was also promoted. The Ramakrishna Mission in Singapore set up a home for boys from troubled homes, while the Sree Narayana Mission set up a home of the destitute elderly. Another social reform movement was the **[Self-Respect Movement](/wiki/Self-Respect_Movement)**, which emerged in Tamil Nadu in the 1920s to liberate [Dravidian people](/wiki/Dravidian_people), and especially [Adi Dravidas](/wiki/Adi_Dravida) and lower caste Tamils from what was seen as [Brahmin](/wiki/Brahmin) oppression. This movement sought inspiration from Tamil history and culture. In Singapore, groups like the Tamil Reform Association were inspired by this movement. They imported publications from India that promoted the movement, and they also hosted visiting leaders of the Self-Respect Movement from Tamil Nadu when they visited Singapore. The Singapore groups focussed on moral, social and religious reform. For example, they campaigned against caste distinctions and alcohol abuse. These groups also promoted the use of the Tamil language, and the development of Tamil literature in Singapore, through the establishment of Tamil newspapers and schools. They were also involved in the union activism, especially in those work sectors dominated by Tamils. Tamil-educated journalists and teachers were at the forefront of this movement. Leaders like [Thamizhavel G. Sarangapani](/wiki/Thamizhavel_G._Sarangapani) were especially instrumental in championing the rights of Tamils and Indians, by encouraging Indians to register for Singapore citizenship in the 1950s and by campaigning to make Tamil one of Singapore's official languages. #### 1915 Singapore Mutiny The [1915 Singapore Mutiny](/wiki/1915_Singapore_Mutiny), also known as the 1915 Sepoy Mutiny, was an incident concerning 850 [Indian Army](/wiki/British_Indian_Army) soldiers who mutinied against their British superiors on 15 February 1915 in Singapore, as part of the [1915 Ghadar Conspiracy](/wiki/1915_Ghadar_Conspiracy) (not to be mistaken for the [Indian Mutiny of 1857](/wiki/Indian_Mutiny_of_1857)). The predominantly Muslim soldiers mutinied because they believed they were being sent to fight against Islamic [Ottoman Empire](/wiki/Ottoman_Empire) as part of the [Middle Eastern theatre of World War I](/wiki/Middle_Eastern_theatre_of_World_War_I). This mutiny lasted nearly seven days, and resulted in the deaths of 47 soldiers and civilians at the hands of the mutineers, who were subsequently arrested and [court-martialled](/wiki/Court-martial); those who were found guilty of capital crimes were executed by the [Singapore Volunteer Corps](/wiki/Singapore_Volunteer_Corps). In general, the mutiny was restricted to Muslim soldiers, and did not involve the wider Indian population in Singapore. While the mutiny was a significant event in Singaporean history, and one of the most important ones specifically involving the Indian diaspora, it was somewhat distinct from the mainstream development of nationalist sentiments among the Indian population in Singapore, which emerged most prominently around the time of the [Second World War](/wiki/World_War_II).[*citation needed*] #### Political movements Nationalist movements in India established branch organisations in Singapore to draw on local Indian support for Indian independence. The **[Indian Independence League](/wiki/Indian_Independence_League)** was a [political organisation](/wiki/Resistance_movement) operated from the 1920s to the 1940s to organise those living outside of India to remove the British from India. Founded in 1928 by Indian nationalists [Subhas Chandra Bose](/wiki/Subhas_Chandra_Bose) and [Jawaharlal Nehru](/wiki/Jawaharlal_Nehru), the organisation was active in Singapore and Malaya following Japan's successful [Malayan Campaign](/wiki/Malayan_Campaign) in the [Second World War](/wiki/Second_World_War). The **[Indian National Army](/wiki/Indian_National_Army)** (INA) was an armed force formed by [Indian nationalists](/wiki/Indian_independence_movement) in 1942 in [Southeast Asia](/wiki/Southeast_Asia), also during [World War II](/wiki/World_War_II). Their aim was to overthrow the [British Raj](/wiki/British_Raj) in colonial India, with [Japanese](/wiki/Imperial_Japan) assistance. Many Indian soldiers and civilians were recruited in Singapore and Malaya to join the INA during the Japanese occupation. Many of them died fighting alongside the Japanese against the British in Burma during the war. Indian nationalist sentiments in Singapore and Malaya were paralleled by the rise of Chinese nationalism amongst the overseas Chinese in these territories. As these colonies progressed towards independence, Indians and Chinese in Malaya organised themselves along the lines of ethnic political parties. For instance, the Indian Association in Singapore, today a social and recreational club, was one of a network of such clubs in early 20th century Malaya which came together to form what would become the **[Malaysian Indian Congress](/wiki/Malaysian_Indian_Congress)** (MIC), the current ethnic Indian party within Malaysia's ruling [Barisan National](/wiki/Barisan_National) coalition government. Unlike Malaysia's delicate ethno-demographic balance, Singapore had a large Chinese majority. This rendered ethnic-based politics less viable, and tended to support class-based politics instead. For example, several Indian professionals supported the more conservative pro-British parties, as they had been beneficiaries of the colonial system. In contrast, the ruling **[People's Action Party](/wiki/People%27s_Action_Party)** (PAP) espoused an ideology of [social democracy](/wiki/Social_democracy) which gained the support of Indian union workers. [S. Rajaratnam](/wiki/Sinnathamby_Rajaratnam) was one of the founding members of the PAP, and he worked to define and champion its vision of a multi-racial country, in contrast to the Malaysian model. More left-leaning Indian leaders and intellectuals, such as [C.V. Devan Nair](/wiki/C.V._Devan_Nair) and James Puthucheary initially supported more radically left-wing groups. They had been imprisoned by the British for their radical union activism. Later, some of these men join the more moderate wing of the PAP. Devan Nair went on to build the modern trades union movement in Singapore, the [National Trades Union Congress](/wiki/National_Trades_Union_Congress). Consequently, Indians in Singapore tended to align themselves, both individually and as groups, with parties advocating specific political or economic ideologies, rather than along purely racial lines. This basic difference between the Indian communities of Singapore and Malaysia has endured to the present day. ### Post-colonial history: 1960s – present #### Immediate post-colonial period: 1960s – 1980s Scholars have identified two phases in the development of the Indian community after Singaporean independence in 1965. The first phase, from 1965 to the early 1990s, saw a decline in the proportion of the community from 9% in 1957 to a low of 6.4% in 1980. One reason was the withdrawal of British military forces in the early 1970s, which led to the repatriation of many Indian base workers. Another factor was the retirement of older men, who chose to return to families in India. Meanwhile, post-1965 immigration restrictions ended new migration from India. Furthermore, there was a rise in the emigration of Indian Singaporeans to the West in the late 1980s. During this time, the Indian population continued to grow in absolute terms due to natural increase. Even as it grew proportionally smaller, the community also became more settled, with several new generations born locally. A historical novel titled 'Sembawang: A Novel' explores this notion as well traces the lives of Indian migrants who lived in an Indian enclave outside the HM Naval Base in the 1960s. From the 1960s to 1980s, the [People's Action Party](/wiki/People%27s_Action_Party) government tried to cultivate a shared national identity and to end the historical tendency of Singaporeans to identify with the national – and often nationalistic – politics of their ancestral homelands. While different ethnic groups were allowed and sometimes encouraged to retain their cultural identities, they were also pushed to integrate socially, politically and economically across ethnic lines. The government pursued policies to integrate the races in public housing estates and national schools. Young men underwent two years of compulsory national service in ethnically mixed military or police camps. Traditional family businesses were superseded by government agencies or foreign multi-national corporations, which hired multi-ethnic workforces on the basis of meritocratic ability rather than kinship or ethnicity. Consequently, \"the cultivation of a Singaporean identity has been largely successful in converting Indian migrants into Indian-Singaporeans.\" In general, Indian social patterns and political activities became aligned and integrated within the national mainstream from the 1960s. Although the Singapore government championed public policies and a political discourse of racial integration and national identity, it came to recognise that important differences in the socio-economic profiles of the three main races continued to endure in the post-colonial period. Initially, it had set up Mendaki, a quasi-autonomous [Malay](/wiki/Malay_Singaporeans) community self-help group to promote educational advancement within that community to address underperformance by Malay students. In the 1980s, this approach – which was initially seen as an exceptional measure taken in the case of the Malay community – became entwined with the rhetoric of [Asian values](/wiki/Asian_values), which saw the promotion of a greater consciousness and pride in each citizen's own ethnic heritage, as a bulwark against the supposedly negative influence of Western culture. Consequently, the government established the [Singapore Indian Development Association](/wiki/Singapore_Indian_Development_Association) (SINDA) in 1991 to address the educational and social problems of the Indian community. Shortly after, a similar body was set up for the majority Chinese community. Apart from ethnic self-help groups like SINDA (which remain controversial in Singapore), the government has in the main pursued policies emphasising racial integration and national identity. It is against this backdrop that immigration policies were liberalised in the 1990s, leading to an influx of foreigners in Singapore, particularly Indian nationals. This led to a new phase in the history of the Indian community in Singapore. #### Contemporary period: 1990s – present A second phase began in the early 1990s, when immigration policies were liberalised to attract foreign professionals to boost the size and skills of the local workforce. The government was keen to draw in well educated migrants from Asian countries who, it was hoped, would be both keen and able to settle permanently. This also addressed the problem of Singapore's extremely low fertility rates. In addition to these professionals, unskilled foreign workers were recruited as low cost manual labour for construction sites and the cleaning sector, albeit without the prospect of permanent settlement. As a result of these policies, the Indian population grew faster than other groups. The proportion of Indian citizens and permanent residents rose from 6.4% in 1980 to 9.23% in 2010. This was mainly due to rapid growth in the number of Indian nationals who acquired Singapore citizenship or permanent residency. For some years now, the Department of Statistics has stopped providing ethnic data about the short-term or 'non-resident' foreign citizens living in Singapore (i.e. those without Singapore Permanent Residence). As of end June 2007, there were 1,005,500 such persons, or 21.5% of the total population. This group includes two-year work permit holders as well as those holding renewable Employment, Dependant and Student Passes. In 2005, Dr Rajesh Rai from the [National University of Singapore](/wiki/National_University_of_Singapore) has observed that \"independent surveys approximate the number of South Asians on work permits to be… approximately 90,000–100,000.\" In November 2007, a cabinet minister said \"more than 20,000 Indian professionals had set up home\" in Singapore, although it is unclear if this referred only to Employment Pass holders, or if it included Permanent Residents, Student Pass and/or Dependant Pass holders. Based on these figures, the number of short-term or 'non-resident' Indians in Singapore in 2007 is likely to be in the region of 100,000. As such, the proportion of Indians in the total population is likely to range from 9% to 10% (suggesting 89,000 to 135,000 'non-resident' Indians). The advance release figures from Singapore's 2010 Census show, for the first time, the number of ethnic Indian Singapore citizens, and ethnic Indian Singapore Permanent Residents, separately – instead of combining the two. As of 2010, there were 237,473 Indian Singapore citizens, or 7.35% of the citizen population. There were 110,646 Indian PRs, or 20.45% of the PR population. In total, ethnic Indians formed 348,119, or 9.23% of the 'resident' population of citizens and PRs. ### In-depth studies Several in-depth studies have been conducted and published in the recent years on the Indian communities in Singapore such as Rajesh Rai's, Indians in Singapore, 1819–1945: Diaspora in the Colonial Port City, Anitha Devi Pillai's, From Kerala to Singapore: Voices from the Singapore Malayalee Community, Mathew Mathews, The Singapore Ethnic Mosaic, S A Nathanji's Singapore: Nation Building and Indians' Legacy amongst others. ## Demographics ### Income and education Alongside other ethnic groups, Indians from all social backgrounds have achieved significant advances in their educational levels, income, life expectancy and other social indicators. Singapore's extraordinary economic growth from the 1960s to 1990s lifted many out of poverty and created a broad middle class. In the process, many Indians experienced upward social mobility for the first time. Despite this progress, Indians remain somewhat stratified in terms of class relative to other ethnic groups. With the influx of highly qualified Indian Permanent Residents, the socio-economic indicators of the Indian community have improved, arguably masking the under-achievement of some Indians. In 2005, both the average and median monthly income for Indian Residents (S$3,660 and $2,480 respectively) exceeded those for all Residents (S$3,500 and S$2,410 respectively). In the same year, 25% of Indian Residents had a [university degree](/wiki/University_degree) as their highest qualification attained. In contrast the national average was only 17%. Other educations statistics are less positive. In 2004, 73% of Indians among the [Primary](/wiki/Education_in_Singapore#Primary_education) One cohort were [admitted to a post-secondary institution](/wiki/Education_in_Singapore#Admission_to_post-secondary_institutions), compared with 86% for the Chinese, and 75% for the Malays. In the same year, 73.7% of Indian students received 5 or more passes in the [Singaporean GCE 'O' Level](/wiki/Singaporean_GCE_%27O%27_Level) examinations, compared with 86.5% of Chinese students and 59.3% of Malays. Given their performance in the 'O' level examinations, it would appear Indians would have been under represented among students who sat for the ['A' level examination](/wiki/Singapore-Cambridge_GCE_Advanced_Level). However, those Indians who did reach the 'A' level and sat for this exam marginally outperformed the national average. 93% of Indians received 2 'A' and 2 'AO' level passes, compared with 92.6% among Chinese students, and 92.3% nationally. The socio-economic problems, and especially educational under-performance, facing Singapore Indians is addressed by the community through [Singapore Indian Development Association](/wiki/Singapore_Indian_Development_Association) (SINDA), the national self-help group for the Indian community. Singapore has the following international schools for expatriate Indians: - [Global Indian International School Singapore](/wiki/Global_Indian_International_School_Singapore) - [DPS International School Singapore](/wiki/DPS_International_School_Singapore) - National Public School Singapore ### Languages The official languages of Singapore are English, [Malay](/wiki/Malay_language), [Chinese (Mandarin)](/wiki/Standard_Mandarin) and [Tamil](/wiki/Tamil_language). The national language of Singapore is Malay for historical reasons, and it is used in the national anthem, \"[Majulah Singapura](/wiki/Majulah_Singapura)\". Persons of [ethnic Tamil ancestry](/wiki/Tamil_people) form about 58% of Singapore's Indian residents. Minority Indian groups include [Malayalees](/wiki/Malayalee), [Telugu](/wiki/Telugu_people), [Punjabis](/wiki/Punjabi_people), [Sindhis](/wiki/Sindhi_people), [Gujaratis](/wiki/Gujarati_people), [Sinhalese](/wiki/Sinhalese_people), and [Hindi](/wiki/Hindi)-speaking people, among others. In terms of actual daily language use, 39% of Indian residents speak mainly English at home, and a similar number use [Tamil](/wiki/Tamil_language). The remainder speak either [Malay](/wiki/Malay_language) (11%) or other languages, including other [Indian languages](/wiki/Languages_of_India) and [Kristang](/wiki/Kristang_language) (11%).There are about 3000 families which speak Marathi at home. 3.1% of all Singapore residents speak mainly Tamil at home and it is one of the country's four [official languages](/wiki/Official_language). Tamil is taught as a second language in most public schools. Tamil content (produced locally or abroad) is available on free-to-air and cable television as well as radio channels, and in libraries, cinemas, theatres and bookshops. Tamil is used in temples, mosques and churches catering to the community. Some business and non-profit groups, especially those in the [Little India](/wiki/Little_India,_Singapore) neighbourhood, use Tamil on a daily basis. Many Indian loan words are found in Malay, and, to a lesser extent, in English. The influence of Indian vocabulary, syntax and pronunciation are also found in [Singlish](/wiki/Singlish), the local English dialect. At the same time, Singapore Tamil is slightly distinct from the versions spoken in India and Sri Lanka, with its closest cousin being the Malaysian Tamil spoken across the border. Local usage includes some words from English, Malay and other languages. Meanwhile, certain Tamil words or phrases that are archaic in India and Sri Lanka are still used in Singapore. ### Religions Majority of the Indian Singaporeans are Hindus. The proportion of Indians following Islam, Christianity and Buddhism are relatively higher as the census include Pakistanis, Bangladeshis, Sri Lankans and other South Asian ethnic groups under the category of \"Indians\". According to the latest 2020 Census, 57.3% of Singapore's Indian population declared themselves as Hindus, including 23.4% Muslims, 12.6% Christians, 4.6% other religions and 2.2% non-religious, as stated in the following statistics. Origin of religionReligionNumber (2020)Percentage[Dharmic religions](/wiki/Dharmic_religions)[Hinduism](/wiki/Hinduism)171,32657.3%[Sikhism](/wiki/Sikhism)10,2653.4%[Buddhism](/wiki/Buddhism)2,0310.7%Other (most [Jainism](/wiki/Jainism))1,4200.5%***Subtotal of Indian-origin religions******185,042******61.9%***[Abrahamic religions](/wiki/Abrahamic_religions)[Islam](/wiki/Islam)69,96423.4%[Christianity](/wiki/Christianity)37,60512.6%*[Roman Catholicism](/wiki/Roman_Catholicism)**21,853**7.3%**[Protestantism](/wiki/Protestantism) and other Christians**15,752**5.3%****Subtotal of Abrahamic religions******107,569******36%***[No religion](/wiki/Irreligion)6,4432.1%***Grand total of all religions******299,054******100%*** #### Hinduism in Singapore Based on the latest 2020 Census, 5.0% of the resident population aged above 15 years, were Hindu. Almost all Hindus in Singapore were ethnic Indians (99%), with the majority of Singapore's ethnic Indians (57.3%) being Hindu. There are approximately [35 temples](/wiki/List_of_Hindu_temples_in_Singapore) serving Hindus in Singapore. Most are built in the South Indian Dravidian style. Specific communities have established their own temples. For instance, the [Sri Lankan Tamil](/wiki/Sri_Lankan_Tamil) community built the Sri Senpaga Vinayagar Temple at Ceylon Road, while the [Chettiar](/wiki/Chettiar) community set up the Sri Thandayuthapani Temple at Tank Road. The [North Indian](/wiki/North_India) community also established the Sri Lakshminarayan Temple, built in the North Indian style. Two Hindu temples have been gazetted as [National Monuments of Singapore](/wiki/National_Monuments_of_Singapore). Although temples may be historically associated with certain communities, Hindu temples in Singapore are open to all regardless or language, caste or religion (non-Hindus may visit the temples). A unique feature of Hinduism in Singapore is the fact that a noticeable number of non-Indians, usually Buddhist Chinese, do participate in a variety of Hindu activities, including praying to Hindu deities, donating money to the temple funds and participating in Hindu festivals like the [fire-walking](/wiki/Fire-walking) ceremony, and [Thaipusam](/wiki/Thaipusam). The most visible Hindu festivals in Singapore are [Deepavali](/wiki/Deepavali) and [Thaipusam](/wiki/Thaipusam). Minor celebrations include the [Fire walking](/wiki/Fire_walking) festival and Hindu temple chariot processions. [Deepavali](/wiki/Deepavali) is a national public holiday in Singapore. For a month before it, the Little India district is decorated with ornamental fairy lights. Bazaars are held in different parts of the district, with stalls selling religious paraphernalia, greeting cards, food, decorations, clothes, etc. Deepavali day itself is marked with a ritual bath and prayers in the morning, followed by feasting and visits to family and friends. Thaipusam is celebrated prominently in Singapore, Malaysia and other countries with large Tamil populations. As a [penance](/wiki/Penance), participants carry 'kavadis' along a processional route. Some men carry kavadis attached to their bodies via hooks and spears that pierce their skin. Thaipusam is the only time when major Singapore roads are closed for a religious procession. The festival is a major religious and urban event, drawing thousands of devotees, supporters and onlookers. #### Other religions Singapore's approximately 10,000 Indian Sikhs formed 3.4% of the Indian Singaporean population aged above 15 years. Most Sikhs in Singapore are of Indian Origin(accounting to 80-90% of Sikhs). There is a smaller Jain community consisting of a few thousand in population. Among over 15% Muslim Singapore Residents, approximately 13% were Indian, with most of the remainder being Malay (82%), including some Chinese (2.2%) and other ethnicity (2.8%); Indian Muslim Singaporeans easily intermarried with Malays. predate the Islamic period (c. 570-632 AD), or the birth of Islam. In reality, Indonesians and Malays came to know about Islam through the merchants of South India and not through Arab missionaries. Among Christian Singapore Residents, about 5.8% were Indian, with most of the remainder being Chinese (86%), including small Malay (0.4%) and other ethnicity (7.8%). Within the Christian community, Indians formed 10.3% of [Roman Catholics](/wiki/Roman_Catholic) (including [Kristangs](/wiki/Kristang_people) of part-Indian descent), and 3.9% of Non-Catholic Christians (mainly [Protestants](/wiki/Protestant)). Within the wider Muslim and Christian communities, Indians have established their own places of worship, where sermons, services and prayers are conducted in Indian languages. Consequently, there are a substantial number of 'Indian' churches, mosques and Buddhist temples in Singapore. For example, the [Masjid Jamae](/wiki/Masjid_Jamae), built in 1826, is the oldest Tamil mosque in Singapore, and a National Monument. In 1888, the Tamil Catholic community set up the [Church of Our Lady of Lourdes](/wiki/Our_Lady_of_Lourdes_Church,_Singapore), Singapore's oldest Tamil Catholic Church, as well as a National Monument. The [Sakya Muni Buddha Gaya Temple](/wiki/Sakya_Muni_Buddha_Gaya_Temple) is a [Theravada](/wiki/Theravada) temple, built in a mix of Chinese, Indian, Sri Lankan and Thai styles, and is quite different from most Chinese Buddhist [Mahayana](/wiki/Mahayana) temples in Singapore. The small Indian Buddhist community (mainly Sri Lankan [Sinhalese](/wiki/Sinhalese_people)) in Singapore often frequents this temple, which is located in Little India. ## Culture ### Cuisine\n",
  "language": "en",
  "processed_at": "2026-01-12T11:12:06.326624",
  "title": "Indian Singaporeans",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Indian_Singaporeans"
}