{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:12:11.947623"
  },
  "content": "International maritime border between Indonesia and Singapore The **Indonesia–Singapore border** is a [maritime boundary](/wiki/Maritime_boundary) in the [Straits of Singapore](/wiki/Straits_of_Singapore) between [Indonesia](/wiki/Indonesia)'s [Riau Islands](/wiki/Riau_Islands) which lie to the south of the [border](/wiki/Border), and the islands of [Singapore](/wiki/Singapore) which lie to the north. The Straits of Singapore is one of the region's busiest waterways as it is the main channel for Singapore's ports. Only a portion of the [maritime](/wiki/Ocean) border between the two countries has been determined. The remaining parts, especially those lying to the east of the [delimited boundary](/wiki/National_boundary_delimitation), may require the involvement of [Malaysia](/wiki/Malaysia) as the country also possesses territorial waters in the area. ## Border ### Agreements The Agreement Stipulating the Territorial Sea Boundary Lines between Indonesia and the Republic of Singapore in the Strait of Singapore signed by Indonesia and Singapore on 25 May 1973 determines the common [territorial sea](/wiki/Territorial_waters#Territorial_sea) border as a series of straight lines connecting six coordinate points located in the Straits of Singapore. Indonesia ratified the agreement on 3 December 1973 while Singapore ratified the agreement on 29 August 1974. The distance of the border is 24.55 nautical miles (45.47 km). Three of the six coordinates lie equidistant from Indonesian and Singaporean shores while the remaining are negotiated points with two lying closer to the Indonesian shores. Point 2 lies towards the landward side of Indonesia's baseline. On 10 March 2009, Indonesia and Singapore signed the Treaty between the Republic of Indonesia and the Republic of Singapore Relating to the Delimitation of the Territorial Seas of the Two Countries in the Western Part of the Strait of Singapore 2009 in Jakarta. The treaty, signed by their respective Foreign Ministers at that time, namely [Hassan Wirajuda](/wiki/Hassan_Wirajuda) and [George Yeo](/wiki/George_Yeo), extended the [delimitation](/wiki/National_boundary_delimitation) of their common maritime boundary by a further 12.1 km westwards from Point 1 determined in the 1973 agreement, to Point 1C. The treaty came into force upon [ratification](/wiki/Ratification) through an exchange of Instruments of Ratification on 31 August 2010 in Singapore by then Indonesian Foreign Minister [Marty Natalegawa](/wiki/Marty_Natalegawa) and his Singaporean counterpart [George Yeo](/wiki/George_Yeo). The new western end-point Point 1C is deemed to be located near but is not the tri-point for Indonesia, Malaysia and Singapore and tri-lateral negotiations will be further needed to determine where the maritime boundaries of the three countries meet. The 2009 extension uses the basepoints of Pulau Nipah in Indonesia and Singapore's Sultan Shoal, which has virtually been surrounded by reclaimed land. This is significant in legal terms as it indicated that Singapore was willing to not assert the use of the shores of reclaimed land as its baseline. Also significant for Indonesia is that its basepoints, of which Pulau Nipah is one, together with the [baselines](/wiki/Baselines_of_Indonesia) which were drawn according to the archipelagic baseline principle, were recognised by Singapore. The three coordinates under the 2009 treaty are based on the [World Geodetic System](/wiki/World_Geodetic_System) 1984 (WGS'84). PointLatitude (N)Longitude (E)RemarksTerritorial sea boundary end and turning point coordinates under 2009 treaty1C1° 11' 43.8\"103° 34' 00.0\"1B1° 11' 55.5\"103° 34' 20.4\"1A1° 11' 17.4\"103° 39' 38.5\"Territorial sea boundary end and turning point coordinates under 1973 agreement11° 10' 46\"103° 40' 14.6\"21° 7' 49.3\"103° 44' 26.5\"31° 10' 17.2\"103° 48' 18.0\"41° 11' 45.5\"103° 51' 35.4\"51° 12' 26.1\"103° 52' 50.7\"61° 16' 10.2\"104° 2' 00.0\" ### Undefined border With the signing of the 2009 maritime boundary agreement, the [delimitation](/wiki/National_boundary_delimitation) of the \"western segment\" of the Indonesia-Singapore boundary was deemed completed, save for the gap between the new western end point and the eventual western tri-point of the boundaries of Indonesia, Malaysia and Singapore. This final gap will require trilateral negotiations among the three countries which are not expected to take place soon as it is dependent on the delimitation of the [Indonesia–Malaysia maritime boundary](/wiki/Indonesia%E2%80%93Malaysia_border) in the southern portion of the [Straits of Malacca](/wiki/Straits_of_Malacca), as well as the delimitation of the remaining portion of the [Malaysia–Singapore border](/wiki/Malaysia%E2%80%93Singapore_border) in the western part of the [Straits of Singapore](/wiki/Straits_of_Singapore). The remaining portion of the undefined boundary is called the \"eastern segment\" as it lies to the east of the boundary delimited by the 1973 agreement, in the eastern portion of the Straits of Singapore between Singapore and Indonesia's [Riau Islands](/wiki/Riau_Islands). Singapore has indicated that this segment would be made up of two portions. The first, between Singapore island off the Changi Coast and Indonesia's [Batam](/wiki/Batam) island, will run from the eastern terminus determined in the 1973 agreement to an Indonesia-Malaysia-Singapore tri-point. Another portion will be located further east between [Pedra Branca](/wiki/Pedra_Branca,_Singapore), which the International Court of Justice awarded to Singapore in 2008 in a dispute with Malaysia, and Indonesia's [Bintan](/wiki/Bintan) island. A stretch of the [Indonesia–Malaysia border](/wiki/Indonesia%E2%80%93Malaysia_border) will lie in between the two portions. Tri-lateral negotiations among Indonesia, Malaysia and Singapore would be needed to determine the three tri-points. The signing of the 2009 treaty has given momentum for talks to determine the eastern segment to begin. During a press conference after the exchange of the Instruments of Ratification for the 2009 treaty, Singaporean Foreign Minister George Yeo said Indonesia and Singapore were going to begin the process of demarcating the portion of their common border between Singapore and Batam. The solving of the sovereignty dispute between Malaysia and Singapore over [Pedra Branca](/wiki/Pedra_Branca,_Singapore), [Middle Rocks](/wiki/Middle_Rocks) and South Ledge has also resulted in Malaysia and Singapore starting technical negotiations to determine their common border, which is necessary before the tripoints can be determined. ## History The Indonesia–Singapore border came into being as part of the [Anglo-Dutch Treaty of 1824](/wiki/Anglo-Dutch_Treaty_of_1824), which divided the Malay archipelago into spheres of influence between the United Kingdom to the north and the Netherlands to the south. This division later became the border between Malaysia and Singapore to the north, and Indonesia to the south. In 1973, Singapore and Indonesia signed an agreement formally demarcating the border through three equidistant points between the two, and three \"negotiated\" points. A new treaty was signed on 10 March 2009 and ratified on 30 August 2010, clarifying the western portion of the border. The baseline on the Singaporean side is defined by the natural land, rather than land that has been reclaimed.: 69–70 Above ground, Singapore currently controls the [Flight Information Region (FIR) above the Riau Islands](/wiki/Riau_Islands_Flight_Information_Region), which is similar to other cases where countries often administer the FIR of another country. ## Crossings - [Tanah Merah](/wiki/Tanah_Merah,_Singapore) - [Bintan](/wiki/Bintan) - [Singapore Cruise Centre](/wiki/Singapore_Cruise_Centre) - [Batam](/wiki/Batam) - [Indonesia–Malaysia border](/wiki/Indonesia%E2%80%93Malaysia_border) - [Malaysia–Singapore border](/wiki/Malaysia%E2%80%93Singapore_border) - [Riau Islands Flight Information Region](/wiki/Riau_Islands_Flight_Information_Region)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:12:11.947207",
  "title": "Indonesia–Singapore border",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Indonesia%E2%80%93Singapore_border"
}