{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:12:13.926381"
  },
  "content": "Singaporean social work volunteer **Indranee Elizabeth Nadisen** is a Singaporean social work volunteer on [child protection](/wiki/Child_protection), and served as a foster mother to abandoned, abused and neglected children under the Fostering Scheme by the [Ministry of Community Development, Youth and Sports](/wiki/Ministry_of_Community_Development,_Youth_and_Sports) (MCYS). She is also the longest serving foster mother of the program, and also holds the national record of having looked after 43 children in her 32 years' as a foster mother. Nadisen is recognised as the role model and the icon of the Fostering Scheme. Nadisen was born of Chinese ethnicity, and adopted by an Indian family when she was a baby. She volunteered herself with the Fostering Scheme and began fostering children in 1976, when her own children - five boys and a girl - started going to school and she started feeling bored at home. Her love for children was strong and she cared of the children, as if they were her own, for an average period of 2 years till they return to their own biological parents or to their adoptive parents. She also showered her love equally to her children and the adopted ones. However this strong love that she felt for them, also made it emotionally difficult for her to part with them. She confessed she had to lie to the child by saying she had to go to the toilet so that the child would let go of her, to let the child leave with their adoptive parents. 'From the toilet, I would hear the child screaming for me and my heart would hurt,' she said. As a result, she preferred not to contact them after they left her care. In 2001 Nadisen was awarded the *Friend of [MCDS](/wiki/Ministry_of_Community_Development_and_Sports)* award and in 2003, the [Reader's Digest](/wiki/Reader%27s_Digest) Inspiring Asians Award. In July 2008, Nadisen reluctantly announced her retirement from the Fostering Scheme citing health reasons. In 2014, Nadisen was inducted into Singapore Women's Hall of Fame. This Singaporean biographical article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:12:13.925902",
  "title": "Indranee Nadisen",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Indranee_Nadisen"
}