{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:12:18.016193"
  },
  "content": "Singapore news company **Initium Media** ([Chinese](/wiki/Traditional_Chinese_characters): 端傳媒) is a [Singapore](/wiki/Singapore)-based Chinese-language digital media outlet. Launched in August 2015 in Hong Kong, the media moved its headquarters to Singapore in 2021. Initium Media mainly provides in-depths news, opinions and lifestyle content with the aim of staking out neutral terrain among Chinese readers worldwide. Initium Media sourced its name from the writings of [Mencius](/wiki/The_Mencius) in which the word \"端\" ([Jyutping](/wiki/Jyutping): *dyun1*, \"beginning\", or \"initium\" in Latin) is significant.[a] ## Ownership and funding Initium Media's was initially funded by Will Cai, a Stanford-trained lawyer operating the company as a sideline to his duties at [Skadden Arps](/wiki/Skadden), an investment he considered \"better than buying a sports car.\" Mr. Cai left Initium Media in April 2017. On 2 December 2015, Initium Media received a preferred share financing led by WI Harper Group, a leading global venture capital firm. On 6 April 2017, the company announced it would be restructuring due to cash flow difficulties and staff would be laid off. Cai stepped down from his position at Initium Media when the media platform implemented its restructuring plan in April 2017. In July 2017, Initium Media kicked off a subscription model to charge readers for in-depth contents. The subscription divided into two memberships which are the normal membership and the premium one. ## Editorial team Its founding editor was Annie Zhang, who previously worked for *[Yazhou Zhoukan](/wiki/Yazhou_Zhoukan)*, *iSun Affairs Magazine*, and *City Magazine*. In April 2018, Taiwanese reporter Lee Chih-Te took over the chief executive editor, and left in 2020. Jing Wu became the chief executive editor in 2020, and was succeeded by Hui (Lulu) Ning in 2022. ## Coverage Initium Media currently has 10 channels, which are *Daily News*, *Opinions*, *International News*, *Hong Kong News*, *China News*, *Taiwan News*, *Culture*, *City*, *Parenting* and *Photos*. Since its launch, Initium Media has been criticized both for being too antagonistic of the Chinese Communist Party and too supportive. *[Apple Daily](/wiki/Apple_Daily)*, a Hong Kong newspaper owned by [Jimmy Lai](/wiki/Jimmy_Lai) and critical of China's Communist Party rulers, accused Cai of having secret ties to mainland backers and Communist Party general secretary [Xi Jinping](/wiki/Xi_Jinping). Some media observers say that Initium Media has demonstrated its independence with in-depth reports such as these. ### 2020 raid On 10 August 2020, the Hong Kong offices of *Apple Daily* were searched by over 200 national security officers in a large-scale [police raid](/wiki/Police_raid), following Lai's arrest for alleged violations of the recently implemented [national security law](/wiki/2020_Hong_Kong_national_security_law). Journalists interviewed 7 reporters from AppleDaily that night and concluded up an article for restoring the experiences and thoughts of the reporters that day when they saw the company was searched by great number of polices and alleging violations of the national security law. ### Tianjin explosion On 12 August 2015, a [series of major explosions](/wiki/2015_Tianjin_explosions) swept across [the Binhai New Area](/wiki/Binhai), a busy port just 40 kilometres east of the northern Chinese city of [Tianjin](/wiki/Tianjin). The explosions occurred less than one kilometre from several high-density residential areas, and damage extended as far as two kilometres from the blast site. Initium Media was one of the very few Hong Kong media that dispatched journalists to the scene, where toxic chemicals stored in a warehouse had erupted in a fireball that spewed debris and poisons over nearby apartments. The reporters slipped past security cordons to write about the disaster that claimed more than 150 lives and then reported on the connections of the warehouse owner. Initium Media also released an investigative report to trace the individuals behind this tragedy. ### Application development Initium Media has an in-house data journalist team. One of its works is the Legco matrix project, through which they analyze over 200,000 voting records of Hong Kong legislative council and visualize the recent movement and voting trends of lawmakers. It also dedicated a project in anticipation of the 2016 LegCo election. ## Awards and recognition Initium Medium won numerous recognitions at the SOPA Awards [zh] 2020. Award TypeCategoryTitle of EntryAward RecipientsExcellence in Photography (卓越攝影獎)Award of ExcellenceHong Kong's anti-extradition bill protest: a photo documentationLam Chun Tung (林振東)Excellence in Feature Writing (卓越專題特寫獎)Honorable MentionsA feature of the Polytechnic University siege 理大圍城之戰Stephanie Yang (楊子琪)Excellence in Reporting Breaking News (卓越突發新聞獎)Honorable MentionsInvestigation of the indiscriminate attack of 21 July Yuen Long Nightmare 721 涉黑白衣人無差別襲擊事件突發事件調查 Gemini Cheng Pui Shan, Yang Ziqi, Irene Chan, Leung Man Ki, Sam Leung, Eddie Pang, Stanley Leung, 鄭佩珊、楊子琪、陳倩兒、梁敏琪、梁中勝、彭嘉林、 梁詩聰 Excellence in Video Reporting (卓越視頻報道獎) Honorable MentionsStatement of a Hong Kong young valiant: if the problems were solved, we won't be here 一個勇武年輕人的自白：你解決了問題，這幫人就不會出現 Stanley Leung, Irene Chan (梁詩聰、陳倩兒)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:12:18.015688",
  "title": "Initium Media",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Initium_Media"
}