{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:12:19.989641"
  },
  "content": "Singaporean government board in charge of tax collectionThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Inland Revenue Authority of Singapore\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(August 2014)* *(Learn how and when to remove this message)* The **Inland Revenue Authority of Singapore** (**IRAS**) is a [statutory board](/wiki/Statutory_boards_of_the_Singapore_Government) under the [Ministry of Finance](/wiki/Ministry_of_Finance_(Singapore)) of the [Government of Singapore](/wiki/Government_of_Singapore) in charge of [tax collection](/wiki/Tax_collection). ## History ### Early beginnings The [Singapore](/wiki/Singapore) Income Tax Department was created in 1947 to administer the Income Tax Ordinance enacted during that year. Actual assessing of tax only began in November 1948. In the first Year of Assessment, about 40,000 individual tax returns and 1,000 corporate returns were received. The total tax collected for the period 1 January 1948 to 31 December 1949 was $33.2 million. ### 1960s Following self-government in 1959, the Inland Revenue Department was formed in 1960 when various revenues administered and collected by a number of separate agencies were brought together. When Singapore attained independence on 9 August 1965, substantial changes were made to the Income Tax Act, which came into effect on 1 January 1966. ### 1970s By this time, the number of Acts that came under the Department's purview had increased to twelve. That year also saw the appointment of the first local Commissioner, Mr Hsu Tse-Kwang. This period witnessed the growth of the service sector and substantial resources were devoted to staff training. In 1972, microfilming was stepped up to save space and reduce file handling. Property tax billing and collection were also computerised. ### 1980s Singapore became a more expensive place for businesses with the rapid developments. Changes were introduced to government policies, incentives and taxes in order to make the economy more competitive. The late 1980s witnessed a significant shift towards lowering both corporate and individual taxes. In 1987 corporate tax rates were lowered from 40% to 33%. ### 1990s This period witnessed major changes in tax policies. There was a shift towards lower direct taxes and the focus was on indirect taxes. The trend towards indirect taxation resulted in the introduction of the [Goods and Services Tax (GST)](/wiki/Goods_and_Services_Tax_(Singapore)) in 1994. It is a tax on domestic consumption and applies to all goods and services supplied in Singapore except for financial services and residential properties. It was in this period that the trend of lowering corporate and individual tax rates accelerated. ### 2000 to 2010/2016 Investment and talent attraction policies have been the focus at present. Tax rates were further lowered and currently capped at 18% (till 2010 YA2010 for YE2009) for companies and 20% (till 2017 YA16) for individuals. ### 2010/2017 and beyond 17% companies and max 22% for individuals ## Incorporation of IRAS On 1 September 1992, the Inland Revenue Authority of Singapore (IRAS) was established by legislation as a statutory board under the Ministry of Finance. With this conversion, IRAS was incorporated by the Inland Revenue Authority of Singapore Act to take over the functions previously performed by the Inland Revenue Department. The conversion was to give IRAS the autonomy and flexibility to manage its personnel and financial resources. ## Taxes administered by IRAS As the Singapore Government's principal revenue collection body, IRAS collects Income Tax, [Goods and Services Tax (GST)](/wiki/Goods_and_Services_Tax_(Singapore)), Property Tax, Estate Duty, Betting and Sweepstakes Duties, Stamp Duties and Casino Tax. [Blogging](/wiki/Blogging) is taxable in Singapore if it constitute gains or profits from a trade or a business under section 10(1)(a) of the [Income Tax Act 1947](/wiki/Income_Tax_Act_1947) (ITA). To foster innovation, the tax framework also includes generous incentives, such as enhanced tax deductions for qualifying research and development (R&D) expenditures under To foster innovation, the tax framework also includes generous incentives, such as the enhanced tax deductions for qualifying research and development (R&D) expenditures under Section 14D of the Income Tax Act 1947. The other tax types in Singapore which are not collected by IRAS are: - Levies on motor vehicles (Land Transport Authority) - Customs and excise duties ([Singapore Customs](/wiki/Singapore_Customs)) - Foreign worker levy (Ministry of Manpower) - Water conservation tax (Public Utilities Board) ## Initiatives The Auto-Inclusion Scheme (AIS) enables employers to submit the employment income information of their employees to IRAS electronically. The information will then be automatically pre-filled in the employees' income tax assessment. Property owners with rental income may make claims on the total amount of their rental expenses. Alternatively, they may claim deemed rental expenses calculated based on 15% of the gross rent. In addition to the 15% deemed rental expenses, property owners may claim mortgage interest on the loan taken to purchase the tenanted property. ## Performance IRAS collected S$47 billion in tax revenue in FY2016/17. Tax arrears remained low at 0.68% of net tax assessed and cost of collection was also kept low at 0.84 cents for every dollar collected. In FY2016/17, IRAS uncovered 10,626 non-compliant cases and recovered about $332 million in taxes and penalties through rigorous audits and investigation. IRAS collected S$50.2 billion in tax revenue in FY2017/2018, which was an increase of 6.8 per cent from FY2016/2017. - Politics portal - Singapore portal - [Goods and Services Tax (Singapore)](/wiki/Goods_and_Services_Tax_(Singapore)) - [Income tax in Singapore](/wiki/Income_tax_in_Singapore) - [Revenue stamps of Singapore](/wiki/Revenue_stamps_of_Singapore) - Official website - www.facebook.com/irassg, www.twitter.com/iras_sg, www.linkedin.com/company/iras, IRAS' Social Media Pages\n",
  "language": "en",
  "processed_at": "2026-01-12T11:12:19.989138",
  "title": "Inland Revenue Authority of Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Inland_Revenue_Authority_of_Singapore"
}