{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:12:28.091718"
  },
  "content": "The **Institute of Contemporary Arts (ICA) Singapore** is the curatorial division of [LASALLE College of the Arts](/wiki/LASALLE_College_of_the_Arts), dedicated to supporting innovative and emerging creative practices. Focusing on [art](/wiki/Art) and [design](/wiki/Design) from the present, it provides an active site for contemporary [culture](/wiki/Culture) in [Singapore](/wiki/Singapore). It comprises five galleries that span a total of 1,500 square metres, one of the largest spaces devoted to contemporary art in Singapore. It engages local and international audiences in critical viewing and discussion through a diverse programme of exhibitions, projects, publications and events. The ICA Singapore provides a cultural and educational tool for students and the wider public to advance their knowledge and appreciation of the contemporary local, regional and international arts. ## History The Dr Earl Lu Gallery was established by LASALLE College of the Arts in 1986, in recognition of a major contribution of artworks by [philanthropist](/wiki/Philanthropist) and artist Dr Earl Lu, it presented exhibitions of traditional and contemporary arts, often with a focus on practices from [Asia](/wiki/Asia). From 2001 to 2004, under the directorship of Binghui Huangfu, the gallery worked closely with LASALLE’s Contemporary Asian Art Centre, a research facility directed by T.K. Sabapathy that sought to advance knowledge and collaboration between artists across Asia through dialogue, research and publications. In 2004, Dr Earl Lu Gallery was renamed the **Institute of Contemporary Arts Singapore** and repositioned as a centre of Singapore and international contemporary art. In 2007, the institute moved along with LASALLE College of the Arts from the Goodman Road campus to a new campus on McNally Street, where it is based today. Since its establishment, the ICA Singapore has presented exhibitions of international [contemporary art](/wiki/Contemporary_art). These include solo exhibitions by Yeo Hwee Bin (2000), [On Kawara](/wiki/On_Kawara) (2004), [Antony Gormley](/wiki/Antony_Gormley) (2005), Lim Tzay Chuen (2005), [Roberto Chabet](/wiki/Roberto_Chabet) (2011), Ian Woo (2011), Jeremy Sharma (2012) Milenko Prvacki (2012), [Shubigi Rao](/wiki/Shubigi_Rao) (2013), [Tang Da Wu](/wiki/Tang_Da_Wu) (2013), Jack Tan (2015), Marco Fusinato (2015) and [Ana Prvački](/wiki/Ana_Prvacki) (2015–16). Group exhibitions include *Text & Subtext: International Contemporary Asian Women Artists Exhibition* (2000), *Sight and Sight: Translating Cultures* (2003), *Lost to the Future: Contemporary Art from Central Asia* (2013), *Sound: Latitudes and Attitudes* (2014), *Countershadows (tactics in evasion)* (2014), *Artists Imagine a Nation: SG50: Pictures of People and Places from the Collections of [Koh Seow Chuan](/wiki/Koh_Seow_Chuan) and Friends* (2015), *Rendez-Vous* (2015) and *Sous la Lune/Beneath the Moon* (2015–16). Past directors of the ICA Singapore include Binghui Huangfu (1996–2003), Eugene Tan (2003–08) and Charles Merewether (2010–13). From 2013 to 2019 the director of ICA Singapore was Melbourne-born curator Bala Starr. ## Controversies In February 2016, two items that were part of the group show \"Fault-lines: Disparate and desperate intimacies\" were removed from artist [Loo Zihan](/wiki/Loo_Zihan)'s installation \"Queer objects: An archive for the future\". This action was agreed after discussion between ICA Singapore staff, curator Wong Binghao, and Loo Zihan, and was due to the nature of the objects, which could potentially be considered offensive to some members of the public. The items were a penis sheath and a butt plug. The ICA Singapore, curator and artist emphasised that the decision was taken to make the exhibition accessible to all, including students of the LASALLE College of the Arts, half of whom are under 18 years old.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:12:28.091307",
  "title": "Institute of Contemporary Arts Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Institute_of_Contemporary_Arts_Singapore"
}