{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:12:25.970722"
  },
  "content": "Think tank based in SingaporeThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Institute for Defence and Strategic Studies\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(February 2013)* *(Learn how and when to remove this message)* The **Institute Of Defence and Strategic Studies** (**IDSS**) is an institute within the [S. Rajaratnam School of International Studies](/wiki/S._Rajaratnam_School_of_International_Studies) (RSIS), Singapore. It was established in July 1996 as an autonomous [research institute](/wiki/Research_institute) within the [Nanyang Technological University](/wiki/Nanyang_Technological_University). Its stated objectives are to conduct research and provide general and [graduate education](/wiki/Graduate_education) in the area of [national security](/wiki/National_security), [military technology](/wiki/Military_technology) and [international relations](/wiki/International_relations). It also promotes [joint](/wiki/Joint_warfare) and [exchange programmes](/wiki/Exchange_program) with similar regional and international institutions; and organise seminars and conferences on these topics. Constituents of IDSS include the International Centre for Political Violence and Terrorism Research (ICPVTR), the Centre of Excellence for National Security (CENS) and the Asian Programme for Negotiation and Conflict Management (APNCM). On 1 January 2007, the S. Rajaratnam School of International Studies was formed, and IDSS became an institute within the school, focussing on security research. The teaching functions were taken over by RSIS. - The Institute of Defence and Strategic Studies (IDSS) web-page at the S. Rajaratnam School of International Studies (Singapore) official website This Singaporean organisation article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:12:25.970244",
  "title": "Institute for Defence and Strategic Studies",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Institute_for_Defence_and_Strategic_Studies"
}