{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:12:24.005401"
  },
  "content": "Educational institute in SingaporeThe topic of this article **may not meet Wikipedia's notability guidelines for companies and organizations**. Please help to demonstrate the notability of the topic by citing reliable secondary sources that are independent of the topic and provide significant coverage of it beyond a mere trivial mention. If notability cannot be shown, the article is likely to be merged, redirected, or deleted. *Find sources:* \"Institute for Adult Learning\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(November 2021)* *(Learn how and when to remove this message)*‹ The template *Infobox university* is being considered for merging. › **Institute for Adult Learning Singapore** (**IAL**) is the [Training](/wiki/Training_and_development) and [Adult Education](/wiki/Adult_education) autonomous institute within the [Singapore University of Social Sciences](/wiki/Singapore_University_of_Social_Sciences) (SUSS). It was established in 2008. IAL offers a range of education programmes such as [Master's degree](/wiki/Master%27s_degree), WSQ Diploma, WSQ Advanced Certificate, and short courses in the field of training and adult education. IAL functions as the National Centre of Excellence for Adult Learning that aims to enhance the standards of Training and Adult Education (TAE) in Singapore by promoting ongoing education and partnering with higher education institutions and training providers. IAL engages in research to guide continuous education policies and practices, and aids in applying this research to develop practical tools and resources for the TAE community. Additionally, IAL contributes to the National Centre of Excellence for Workplace Learning (NACE) network, particularly through NACE@IAL, focusing on improving workplace learning theories and practices, as well as fostering innovation and technology within the TAE sector. ## History IAL was established in 2008 to provide training for adult educators and undertake research in adult learning. From 1 April 2019, IAL was restructured into an autonomous institute within [Singapore University of Social Sciences](/wiki/Singapore_University_of_Social_Sciences) (SUSS). On 11 January 2023, IAL has signed MoUs with [Microsoft](/wiki/Microsoft) and [SNEC](/wiki/Singapore_National_Eye_Centre) to guide digital learning material design and enhance continuing education and training and ophthalmic healthcare skills. From 13 March 2023, Associate Professor (Practice) Yeo Li Pheow succeeded Professor Lee Wing On as IAL Executive Director. On 20 October 2023, IAL has partnered with Agency for Integrated Care, [Home Team Academy](/wiki/Home_Team_Academy), and Kydon Holdings, enhancing the learning ecosystem through professional development, digital transformation, and creating effective learning materials across sectors. ## Programmes The Institute for Adult Learning (IAL) offers a variety of educational programs, including the WSQ Advanced Certificate in Learning and Performance (ACLP), the WSQ Workplace Learning Facilitator (WLF), the WSQ Diploma in Design and Development of Learning for Performance (DDDLP), the Master in Boundary-Crossing Learning and Leadership (MBX), and the Master of Learning and Professional Development (MLPD). ## Adult Education Professionalisation (AEP) In 2014, the Adult Education Professionalisation (AEP) was launched by IAL. There are three levels of AEP namely Associate Adult Educators (AAE), Specialist Adult Educators (SAE) with either Curriculum Development or Facilitation track or Adult Education Fellows (AEF). - [Singapore University of Social Sciences](/wiki/Singapore_University_of_Social_Sciences) - [Adult education](/wiki/Adult_education) - [Training and development](/wiki/Training_and_development) - Official website This Singaporean university, college or other education institution article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:12:24.004813",
  "title": "Institute for Adult Learning",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Institute_for_Adult_Learning"
}