{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:12:32.050047"
  },
  "content": "Post-secondary educational institute in SingaporeThis article **contains promotional content**. Please help improve it by removing promotional language and inappropriate external links, and by adding encyclopedic text written from a neutral point of view. *(March 2020)* *(Learn how and when to remove this message)* The **Institute of Technical Education** (**ITE**) is a post-secondary education institution and [statutory board](/wiki/Statutory_boards_of_the_Singapore_Government) under the purview of the [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)) in [Singapore](/wiki/Singapore). Established by the [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)), it was formerly known as Vocational and Industrial Training Board (VITB). ITE has three colleges, [ITE College Central](/wiki/ITE_College_Central), [ITE College East](/wiki/ITE_College_East) and [ITE College West](/wiki/ITE_College_West). It offers the Higher NITEC, Technical Diploma and Work-Study Diploma. Apart from providing [vocational education](/wiki/Vocational_education) to [secondary school](/wiki/Secondary_education_in_Singapore) graduates, ITE offers apprenticeships for the skilled trades and diplomas in vocational education for skilled technicians and workers in support roles in professions such as [accountancy](/wiki/Accountancy), [architecture](/wiki/Architecture), [business administration](/wiki/Business_administration), [engineering](/wiki/Engineering) and [nursing](/wiki/Nursing). ## History ### 1960s to 1970s: Vocational and Industrial Training Board (VITB) During the 1960s and 1970s, [vocational education](/wiki/Vocational_education) was managed by two separate statutory boards, the Adult Education Board (AEB) and the Industrial Training Board (ITB). They were merged in 1979 to form the Vocational and Industrial Training Board (VITB). The VITB was formed to promote and develop vocational education. ### 1992: Institute of Technical Education (ITE) The Institute of Technical Education (ITE) was established as a post-secondary education institution to improve the employability of vocational trainees and to restructure the VITB's programmes. The government decided that every student in Singapore had to have at least ten years of general education, with technically inclined students filtered into the [Normal (Technical) stream](/wiki/Singapore-Cambridge_GCE_Normal_Level#Singapore-Cambridge_GCE_Normal_(Technical)_Level) in secondary schools as preparation. These students would then attend the ITE after they finished secondary school education. ## Student intake Every year, ITE takes in about 25% of an annual school cohort[*citation needed*], or an intake of about 14,000 students, with an annual enrollment of about 25,000[*citation needed*]. Full-time students are typically secondary school graduates with the requisite GCE 'N' or 'O' Level qualifications.[*citation needed*] ## Colleges To refine technical education in Singapore, the \"One ITE System, Three Colleges\" Model of Education and Governance was introduced in 2005 to merge the 10 satellite campuses into 3 regional colleges. - [ITE College Central](/wiki/ITE_College_Central) - [ITE College East](/wiki/ITE_College_East) - [ITE College West](/wiki/ITE_College_West) ## Awards ITE has won a number of local awards as well as international awards. In 2005, it became the first educational institution to be awarded the Singapore Quality Award by Spring Singapore. This award is awarded to world-class organisations that demonstrate the highest standards of business excellence. ITE has also won the Public Service Distinguished Award, awarded by the Prime Minister's office in 2010, as well as the Singapore Innovation Class, awarded by Spring Singapore in 2011. In 2007, among 30 countries that participated, ITE won the inaugural Harvard-IBM Innovations Award in Transforming Government. This prestigious award was conferred by the [Ash Center for Democratic Governance and Innovation](/wiki/Ash_Center_for_Democratic_Governance_and_Innovation) of [Harvard University](/wiki/Harvard_University) and recognises ITE's programmes as having a profound impact on the lives of citizens. ## [U.S. Embassy Singapore Alumni Mentoring Program](/wiki/U.S._Embassy_Singapore_Alumni_Mentoring_Program) Established in 2013, the [U.S. Embassy Singapore Alumni Mentoring Program](/wiki/U.S._Embassy_Singapore_Alumni_Mentoring_Program) is a bilateral educational initiative launched by the U.S. Embassy in Singapore in partnership with the Institute of Technical Education. Now in its ninth cycle, the program pairs ITE students with mentors ranging from alumni of U.S. government exchange programs to professionals from leading global companies, diplomats, members of parliament, and senior officials from both Singapore and the United States. Mentors have included representatives from organizations such as **[Nike](/wiki/Nike,_Inc.)**, **[Boeing](/wiki/Boeing)**, **[Mastercard](/wiki/Mastercard), [Bloomberg](/wiki/Bloomberg_L.P.)** and **[Google](/wiki/Google)**, alongside U.S. and Singaporean government officials, diplomats, and members of parliament. These engagements aim to help students refine their career trajectories, articulate personal goals, and build leadership capacity, while reinforcing people-to-people ties between Singapore and the U.S. ## Notable alumni ### Entertainment - [Romeo Tan](/wiki/Romeo_Tan), actor. - [Jeremy Chan](/wiki/Jeremy_Chan), actor. - [Hayley Woo](/wiki/Hayley_Woo), actress. - [Jayley Woo](/wiki/Jayley_Woo), actress. ### Sports - [Fandi Ahmad](/wiki/Fandi_Ahmad), footballer. - [Marc Brian Louis](/wiki/Marc_Brian_Louis), sprints and hurdles. - [Safuwan Baharudin](/wiki/Safuwan_Baharudin), footballer. ### Politics - [Wong Kan Seng](/wiki/Wong_Kan_Seng), [Deputy Prime Minister of Singapore](/wiki/Deputy_Prime_Minister_of_Singapore) (2005–2011). - ITE website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:12:32.049547",
  "title": "Institute of Technical Education",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Institute_of_Technical_Education"
}