{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:12:36.030109"
  },
  "content": "Singaporean resorts with casinos Singapore led the development of [integrated resorts](/wiki/Integrated_resort) internationally. In 1923, [gambling](/wiki/Gambling) was briefly legalized in the then-British [colony of Singapore](/wiki/Colony_of_Singapore), but the experiment led to [gambling addiction](/wiki/Gambling_addiction) and increased crime, and gambling was criminalised again within three years. In the following decades, the operation of legal gambling in Singapore was limited to the government-run [Singapore Pools](/wiki/Singapore_Pools) for [lotteries](/wiki/Lottery), and [Singapore Turf Club](/wiki/Singapore_Turf_Club) for horse racing. However, during a [parliament](/wiki/Parliament_of_Singapore) session on 18 April 2005, [Lee Hsien Loong](/wiki/Lee_Hsien_Loong), the [prime minister](/wiki/Prime_minister) of [Singapore](/wiki/Singapore), announced the [cabinet](/wiki/Cabinet_of_Singapore)'s decision to develop two casinos and associated hotels and malls in [Marina South](/wiki/Marina_South) and [Sentosa](/wiki/Sentosa). The government stated that the aim of the project was to boost [Singapore's tourism industry](/wiki/Tourism_in_Singapore) which had been facing intense competition from other destinations around the region, particularly from nearby [Bangkok](/wiki/Bangkok), [Hong Kong](/wiki/Hong_Kong) and [Macau](/wiki/Macau), which has[*clarification needed*] since also considered legalisation of casinos in the wake of initiatives in Singapore. Even closer to home, [Malaysia](/wiki/Malaysia) has long had a legal casino cum theme park on [Genting Highlands](/wiki/Genting_Highlands), which proved popular with Singaporean tourists. The IRs in Singapore were expected to create about 35,000 jobs directly and indirectly. In addition to the casinos, the IRs will have other amenities including [hotels](/wiki/Hotel), [restaurants](/wiki/Restaurant), [shopping](/wiki/Shopping_center) and [convention centers](/wiki/Convention_center), [theatres](/wiki/Theatre), [museums](/wiki/Museum) and [theme parks](/wiki/Theme_park). The industry was expected to invest US$7.1 billion in integrated resorts (US$3.5 billion in Marina Bay; US$3.6 billion in Resorts World)[*citation needed*]. ## Public debate and criticisms The plan to build the integrated resorts was subject to considerable debate among Singaporeans even till 2014. Several groups, such as those belonging to the [Muslim](/wiki/Muslim) and [Christian](/wiki/Christians) communities as well as [social workers](/wiki/Social_worker), openly expressed their disapproval of the casinos. Concerns were raised about the negative social impact of casino gambling, citing worries that the casinos could encourage more gambling and increase the risk of [compulsive gambling](/wiki/Compulsive_gambling). Activist groups argued that a casino could also lead to undesirable activities often associated with gambling, including [money laundering](/wiki/Money_laundering), [loan sharks](/wiki/Loan_shark) or even organised crime. Lee acknowledged the downsides of having integrated resorts and the concerns expressed by the public. He promised that there would be safeguards to limit the social impact of casino gambling. He stated there would be restrictions on the admission of local people into the casinos, for example, family members of a patron of the casino may block him or her from entering and gambling. Lee announced a steep entrance fee of S$100 per entry or S$2,000 per year and a system of exclusions for all Singaporeans. (Increased to $150 per entry or $3,000 per year on 4 April 2019) In addition, the casinos would not be allowed to extend credit to the local population. Lee, who has been prime minister since August 2004, took a significant political risk when he made the decision, with some of his cabinet members against the plan.[*citation needed*] Nonetheless, Lee decided to go ahead with the decision; he stated: > \"As Prime Minister, I carry the ultimate responsibility for the decision.\" The six-month consultative period gave the opportunity for many sections of the population to voice their opposition to the casinos, including a [petition](/wiki/Petition) that attracted tens of thousands of signatures. When Lee approved the proposal after such widespread criticism, the opposition said that he had overruled [consensus](/wiki/Consensus_decision-making).[*citation needed*] The debate over integrated resorts also brought to the public's attention a discussion on the methods and ways government policies should be deliberated in Singapore, and whether they were effective or needed reform. This is especially because the political climate is [dominated](/wiki/Dominant_party_system) by the [People's Action Party](/wiki/People%27s_Action_Party). [Low Thia Khiang](/wiki/Low_Thia_Khiang), the leader of the opposition [Workers' Party](/wiki/Workers%27_Party_of_Singapore), warned in a parliament session: > \"The Government sought the opinion of the people but it does not go along with the opinion of the people and it has now made a unilateral decision. Eventually, will it turn out to be a blessing or a curse to our people? We have to wait and see. [...] Under the current situation, where a party is dominant and the civil society is very weak, the people cannot sway the Government's decision on such a matter that concerns the fate of the people. If the Government's judgment is wrong, it would lead the nation and our people on to the 'river of no return', where the cost would be very real and very heavy.\" By the time of the [2006 general elections](/wiki/2006_Singapore_general_election), however, the decision was already a *fait accompli*, and the opposition parties made little mention of it. The issue of casinos in Singapore was brought up by parliamentary members such as [Denise Phua](/wiki/Denise_Phua) suggesting that the place of gambling in [Singapore](/wiki/Singapore) be reviewed till putting in a total ban on remote gambling after the Remote Gambling Bill was passed. ## Development ### Marina Bay In December 2004, the [government of Singapore](/wiki/Government_of_Singapore) called for a request-for-concept (RFC), inviting industry players to submit concept proposals for the integrated resorts. A total of 19 bids were submitted during the RFC. Four companies/consortia placed formal bids for the Marina Bay site: - [Genting International](/wiki/Genting_International)/[Star Cruises](/wiki/Star_Cruises) - [Harrah's Entertainment](/wiki/Harrah%27s_Entertainment)/[Keppel Land](/wiki/Keppel_Land) - [Las Vegas Sands](/wiki/Las_Vegas_Sands) - [MGM Mirage](/wiki/MGM_Mirage)/[CapitaLand](/wiki/CapitaLand) While Harrah's and MGM were considered forerunners, Las Vegas Sands emerged as the surprise winner when it was announced on 26 May 2006. Las Vegas Sands had committed the highest development investment of S$3.85 billion. With the land price and associated capital cost, its total investment will exceed S$5 billion. It would also be one of the most expensive casinos in the world. The design by [Moshe Safdie](/wiki/Moshe_Safdie) consists of three large shells containing conference halls and other business venues, three large hotel towers linked on their top floors by a sweeping sky garden, and a centerpiece museum which juts out onto the bay. > \"Sands has submitted the best overall proposal that meets our economic tourism objective. In particular, the proposal will significantly strengthen Singapore's position as a leading MICE destination and the proposal also possesses unique design elements that will provide a memorable image for Marina Bay.\" — Deputy Prime Minister Prof [S Jayakumar](/wiki/S._Jayakumar_(Singaporean_politician)) [Marina Bay Sands](/wiki/Marina_Bay_Sands) officially launched the opening of its first phase developments on 27 April 2010 and held its official grand opening celebrations on 23 June 2010. It is billed as a centrepiece of the Marina Bay landscape. Amenities include a hotel with 2,560 rooms and suites, Sands Expo and Convention Center with dining and shopping facilities, and the Sands SkyPark at Level 57 of the hotel, which features a 150-metre long infinity-edge swimming pool. The Expo and Convention Center served as the main media center for the inaugural Youth Olympic Games 2010 held in Singapore in August 2010. Other facilities such as museums, theatres and crystal pavilions were opened throughout the year, starting from 2011. ### Sentosa Three consortia submitted their proposals by the due date on 10 October 2006, including: - Eighth Wonder with [Publishing and Broadcasting Limited](/wiki/Publishing_and_Broadcasting_Limited), [Melco International Development](/wiki/Melco_International_Development), [Isle of Capri Casinos](/wiki/Isle_of_Capri_Casinos) (design by [Peter Marino](/wiki/Peter_Marino)) - [Genting International](/wiki/Genting_International) with [Star Cruises](/wiki/Star_Cruises), [Universal Studios](/wiki/Universal_Studios,_Inc.) (design by [Michael Graves](/wiki/Michael_Graves)) - Kerzner International with [Capitaland](/wiki/Capitaland) (design by [Frank Gehry](/wiki/Frank_Gehry)) A fourth contender, a [Harrah's Entertainment](/wiki/Harrah%27s_Entertainment) and [Keppel Land](/wiki/Keppel_Land) consortium, pulled out from the race four days before the deadline. The bids were reviewed by a ministerial committee and a tender evaluation committee. The ministerial committee was headed by [Deputy Prime Minister](/wiki/Deputy_Prime_Minister) Prof [S Jayakumar](/wiki/S._Jayakumar_(Singaporean_politician)) and included [Tharman Shanmugaratnam](/wiki/Tharman_Shanmugaratnam), [S Iswaran](/wiki/S_Iswaran), [Mah Bow Tan](/wiki/Mah_Bow_Tan), [Lim Hng Kiang](/wiki/Lim_Hng_Kiang), Dr [Vivian Balakrishnan](/wiki/Vivian_Balakrishnan) and [Raymond Lim](/wiki/Raymond_Lim) as its members. Results were announced on 8 December 2006. The winning consortium was front-runner Genting International and Star Cruises with their bid for the [Resorts World Sentosa](/wiki/Resorts_World_Sentosa). > \"Genting International & Star Cruises submitted the most compelling proposal overall that best meets our economic and tourism objectives. In particular, the proposal reflects our vision for the Sentosa IR as a large-scale, family resort with its host of world-class family leisure attractions and other strong offerings. We believe that the attractions will position Sentosa as a premier island resort for families and draw significant numbers of both new and repeat visitors to Singapore.\" — Deputy Prime Minister Prof S Jayakumar - [National Council on Problem Gambling (Singapore)](/wiki/National_Council_on_Problem_Gambling_(Singapore)) - [List of integrated resorts](/wiki/List_of_integrated_resorts) Library resources about **Integrated resorts in Singapore** - Resources in your library - Resources in other libraries - Developing Industries: Integrated Resorts of the [Ministry of Trade and Industry (Singapore)](/wiki/Ministry_of_Trade_and_Industry_(Singapore)) - The Integrated Resorts: A Select Guide (English Version), https://web.archive.org/web/20100131073158/http://libguides.nl.sg/integratedresort – Singapore National Library Board (NLB) NLS Resource Guides\n",
  "language": "en",
  "processed_at": "2026-01-12T11:12:36.029557",
  "title": "Integrated resorts in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Integrated_resorts_in_Singapore"
}