{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:12:34.040896"
  },
  "content": "Education scheme in Singapore**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article's **tone or style may not reflect the encyclopedic tone used on Wikipedia**. See Wikipedia's guide to writing better articles for suggestions. *(April 2020)* *(Learn how and when to remove this message)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Integrated Programme\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(December 2023)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* The **Integrated Programme** (**IP**) is a scheme that allows high-performing students in secondary schools in Singapore to skip the [GCE Ordinary Level (O-Level)](/wiki/Singapore-Cambridge_GCE_Ordinary_Level) examination (typically taken by students at the end of their fourth or fifth year in secondary school) and proceed to sit for the [GCE Advanced Level (A-Level)](/wiki/Singapore-Cambridge_GCE_Advanced_Level) examination, [International Baccalaureate](/wiki/International_Baccalaureate) (IB), or an equivalent examination, after six years of secondary education. The A-level examination is typically taken by students at the end of their second or third year in junior college. ## Overview The programme allows for more time to be allocated to enrichment activities. Without the O-level examinations, students have greater flexibility and can immerse themselves in a more broad-based education, ultimately leading to the A-level examination. Generally, only the top performers are eligible to participate in the IP programme, which is currently regarded as experimental. As a result, the majority of students pursue their secondary education at the regular pace by completing a four-year O-level course before proceeding to a two-year A-level education. ## A-level programmes The integrated programme was first implemented in [Dunman High School](/wiki/Dunman_High_School), [Hwa Chong Institution](/wiki/Hwa_Chong_Institution) (formerly [The Chinese High School](/wiki/The_Chinese_High_School)), [Nanyang Girls' High School](/wiki/Nanyang_Girls%27_High_School), [Raffles Girls School](/wiki/Raffles_Girls_School_(Secondary)), [Raffles Institution](/wiki/Raffles_Institution_(Secondary)), and [River Valley High School](/wiki/River_Valley_High_School,_Singapore) in 2004.[*citation needed*] The IP allows students to skip the O-level at secondary four and be admitted directly to junior colleges (while there are cases of students being asked by the school to \"leave\" this system as their pace could not be kept up). However, the students would still have to take the Mother Tongue O-level.[*citation needed*] All the schools allowed in the scheme accepts the top 10% of the national cohort. This ensures that students who are under the IP can cope with their A-level after bypassing their O-level.[*citation needed*] Some junior colleges including [National Junior College](/wiki/National_Junior_College), [Temasek Junior College](/wiki/Temasek_Junior_College), and [Victoria Junior College](/wiki/Victoria_Junior_College), offer it independently. VJC is now offering it with Cedar Girls Secondary and Victoria School (more info below) For the four-year IP, secondary two students from various schools are allowed to apply for this programme. These students have their secondary three and four education in the junior college itself, followed by the A-level course. [Dunman High School](/wiki/Dunman_High_School) (DHS) applied for the IP system in mid-2004 standalone, and the [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)) approved the first batch to be enrolled in 2005, with Year 1 and Year 3 students, each having a cap of about 135 out of 380 students. Full IP was granted in late 2005, and the school went full IP at the beginning of 2006. [River Valley High School](/wiki/River_Valley_High_School,_Singapore) joined the IP system in 2006 by operating a six-year course standalone. Since 2009, National Junior College has also accepted students who have taken the [Primary School Leaving Examination](/wiki/Primary_School_Leaving_Examination) (PSLE), making it a six-year program. Since 2012, [Victoria School](/wiki/Victoria_School) and [Cedar Girls' Secondary School](/wiki/Cedar_Girls%27_Secondary_School) are offering the IP with [Victoria Junior College](/wiki/Victoria_Junior_College) which will build upon the four-year Victoria Integrated Programme (VIP) in the junior college. It is called the VCA IP (Victoria-Cedar Alliance Integrated Programme). In January 2013, the Joint Integrated Programme, commonly referred to as the JIP, offered by [Catholic High School](/wiki/Catholic_High_School,_Singapore), [CHIJ Saint Nicholas Girls' School](/wiki/CHIJ_Saint_Nicholas_Girls%27_School) and [Singapore Chinese Girls' School](/wiki/Singapore_Chinese_Girls%27_School), along with [Eunoia Junior College](/wiki/Eunoia_Junior_College), was established. The four schools are the newest additions to the Integrated Programme landscape. The three secondary schools will continue to offer the 'O' Level track alongside the IP track, thus they are termed by the MOE as dual track schools. Such schools allow students to have the flexibility to switch to the stream that is better suited to the students' needs. ## International Baccalaureate program [Anglo-Chinese School (Independent)](/wiki/Anglo-Chinese_School_(Independent)), [Methodist Girls' School](/wiki/Methodist_Girls%27_School,_Singapore), [St. Joseph's Institution](/wiki/St._Joseph%27s_Institution), [Hwa Chong International School](/wiki/Hwa_Chong_International_School), [Singapore Sports School](/wiki/Singapore_Sports_School) and School of the arts or SOTA have adopted the [International Baccalaureate](/wiki/International_Baccalaureate) (IB) which is generally regarded as a better track if the students have plans to study overseas in the future.[*opinion*] In addition, the IB allows students to take arts and science subjects, philosophy courses, and extensive research papers. Anglo-Chinese School (Independent) is regarded as one of the top schools in terms of results of the IB in the world, having averages as high as 42 out of a total of 45 points. St. Joseph's Institution started its IP in 2013.[*citation needed*] ## NUS High School Diploma The [NUS High School of Mathematics and Science](/wiki/NUS_High_School_of_Mathematics_and_Science) is the only IP school in Singapore which specialises in mathematics and science and leads to the NUS High School Diploma. It aims to develop all-rounded students through its 6-year diploma curriculum, which allows rigour and depth, or flexibility and breadth. NUS High School is also affiliated and very closely linked to the [National University of Singapore](/wiki/National_University_of_Singapore) (NUS). Students in this school graduate with the NUS High School diploma, which has been accredited by all universities in Singapore as well as top universities worldwide. For placement into overseas universities, they may also take the [Scholastic Assessment Test](/wiki/Scholastic_Assessment_Test) (SAT) and [Advanced Placement](/wiki/Advanced_Placement) (AP).[*citation needed*] ## List of schools offering the Integrated Programme ### Schools that offer IP leading to the International Baccalaureate Diploma - [Anglo-Chinese School (Independent)](/wiki/Anglo-Chinese_School_(Independent)) - [Methodist Girls' School](/wiki/Methodist_Girls%27_School,_Singapore) (with [Anglo-Chinese School (Independent)](/wiki/Anglo-Chinese_School_(Independent))) - [St. Joseph's Institution](/wiki/St._Joseph%27s_Institution) - School of the Arts ### School that offers IP leading to NUS High School Diploma - [NUS High School of Mathematics and Science](/wiki/NUS_High_School_of_Mathematics_and_Science) ### Schools that offer IP leading to the GCE Advanced level - [Catholic High School](/wiki/Catholic_High_School,_Singapore) (with [Eunoia Junior College](/wiki/Eunoia_Junior_College)) - [Cedar Girls' Secondary School](/wiki/Cedar_Girls%27_Secondary_School) (with [Victoria Junior College](/wiki/Victoria_Junior_College)) - [CHIJ St. Nicholas Girls’ School](/wiki/CHIJ_St._Nicholas_Girls%27_School) (with [Eunoia Junior College](/wiki/Eunoia_Junior_College)) - [Dunman High School](/wiki/Dunman_High_School) - [Hwa Chong Institution](/wiki/Hwa_Chong_Institution) - [Nanyang Girls' High School](/wiki/Nanyang_Girls%27_High_School) (with [Hwa Chong Institution](/wiki/Hwa_Chong_Institution)) - [National Junior College](/wiki/National_Junior_College) - [Raffles Girls' School (Secondary)](/wiki/Raffles_Girls%27_School_(Secondary)) (with [Raffles Institution](/wiki/Raffles_Institution)) - [Raffles Institution](/wiki/Raffles_Institution) - [River Valley High School](/wiki/River_Valley_High_School,_Singapore) - [Singapore Chinese Girls’ School](/wiki/Singapore_Chinese_Girls%27_School) (with [Eunoia Junior College](/wiki/Eunoia_Junior_College)) - [Temasek Junior College](/wiki/Temasek_Junior_College) - [Victoria School](/wiki/Victoria_School) (with [Victoria Junior College](/wiki/Victoria_Junior_College)) ## Criticism of the Integrated Programme The success of an IP student is based on an assumption that students are self-disciplined enough to ensure that they manage their time well and be diligent in their studies, so that they will remember all the core content taught to them and yet find enough time to engage actively in independent learning. However, this may be considered a utopian ideal. Without an important watershed intervening national examination to help them focus, students may simply let their guard down. IP may also widen inequality among students in Singapore. Most of the places in top Junior Colleges are reserved for IP students. This includes [Victoria Junior College](/wiki/Victoria_Junior_College), [Raffles Institution](/wiki/Raffles_Institution), [National Junior College](/wiki/National_Junior_College) and [Hwa Chong Institution](/wiki/Hwa_Chong_Institution). As such, students taking the [O Level](/wiki/GCE_Ordinary_Level) track will face tighter competition when they wish to enter top schools in Singapore, in comparison to their IP peers. The Integrated Programme is allegedly for clearly university-bound students. While for non-IP students who fail to perform well in the A-level, they still have their O-level qualifications, which act as a \"safety net\". However, in the absence of this \"safety net\", IP students who under-perform in the A-level will have only their [Primary School Leaving Examination](/wiki/Primary_School_Leaving_Examination) (PSLE) certificate to fall back on. ## Gallery - School Information Service on Integrated Programme Archived 27 September 2011 at the [Wayback Machine](/wiki/Wayback_Machine)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:12:34.040400",
  "title": "Integrated Programme",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Integrated_Programme"
}