{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:12:44.574897"
  },
  "content": "Statute of the Parliament of Singapore The **Internal Security Act 1960** (**ISA**) of Singapore is a [statute](/wiki/Sources_of_Singapore_law#Statutes) that grants the executive power to enforce [preventive detention](/wiki/Preventive_detention), prevent [subversion](/wiki/Subversion), suppress organized violence against persons and property, and do other things incidental to the [internal security](/wiki/Internal_security) of [Singapore](/wiki/Singapore). The present Act was originally enacted by the [Parliament of Malaysia](/wiki/Parliament_of_Malaysia) as the [Internal Security Act 1960](/wiki/Internal_Security_Act_1960) (No. 18 of 1960), and extended to Singapore on 16 September 1963 when [Singapore was a state of the Federation of Malaysia](/wiki/Singapore_in_Malaysia). Before a person can be detained under the ISA by the [Minister for Home Affairs](/wiki/Minister_for_Home_Affairs_(Singapore)), the [President](/wiki/President_of_Singapore) must be satisfied that such detention is necessary for the purposes of [national security](/wiki/National_security) or public order. In the landmark case of *[Chng Suan Tze v. Minister for Home Affairs](/wiki/Chng_Suan_Tze_v._Minister_for_Home_Affairs)* (1988), the [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore) sought to impose legal limits on the power of preventive detention by requiring the [Government](/wiki/Government_of_Singapore) to adduce objective facts which justified the President's satisfaction. Two months after the decision, a series of legislative and [constitutional](/wiki/Constitution_of_Singapore) amendments was enacted that effectively reversed the *Chng Suan Tze* decision. These amendments were subsequently confirmed to be valid by the [High Court](/wiki/High_Court_of_Singapore) and Court of Appeal in *[Teo Soh Lung v. Minister for Home Affairs](/wiki/Teo_Soh_Lung_v._Minister_for_Home_Affairs)* (1989–1990), which held it is sufficient for the President to be subjectively satisfied that a detainee is a threat to national security in order for a detention order to be issued under the ISA. Notable ISA cases include [Operation Coldstore](/wiki/Operation_Coldstore) in 1963 which led to the arrest of some 100 [left-wing](/wiki/Left-wing_politics) politicians and trade unionists, including members of the socialist opposition party, the [Barisan Sosialis](/wiki/Barisan_Sosialis). [Chia Thye Poh](/wiki/Chia_Thye_Poh), an alleged Communist, was detained and subject to other restrictions on his liberty under the ISA from 1966 to 1998. The *Chng Suan Tze* and *Teo Soh Lung* cases resulted from a 1987 security operation called [Operation Spectrum](/wiki/Operation_Spectrum) in which 22 [Roman Catholic church](/wiki/Roman_Catholicism_in_Singapore) and social activists and professionals accused of being members of a [Marxist](/wiki/Marxism) conspiracy were detained under the ISA. The ISA also empowers the authorities to prohibit political and quasi-military organizations, ban subversive documents and publications, shut down entertainments and exhibitions that are or are likely to be detrimental to the national interest, and to suppress organized violence by declaring parts of Singapore to be security areas. ## History and developments [British colonial Malaya](/wiki/British_Malaya) introduced the Emergency Regulations Ordinance 1948 on 7 July 1948 during the [Malayan Emergency](/wiki/Malayan_Emergency) in response to a Communist uprising and guerrilla war. The regulations allowed the police to arrest anybody suspected of having acted or being likely to act in a way that would threaten security without evidence or a [warrant](/wiki/Warrant_(legal)), hold them incommunicado for investigation, and detain them indefinitely without the detainee ever being charged with a crime or tried in a court of law. The successor to the Emergency Regulations Ordinance, the Preservation of Public Security Ordinance 1955 (\"PPSO\"), was introduced a result of the 1955 [Hock Lee bus riots](/wiki/Hock_Lee_bus_riots) by the Labour Party government in Singapore. There was strong opposition to the PPSO by the party then in opposition, the [People's Action Party](/wiki/People%27s_Action_Party) (\"PAP\"). In 1958, [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) of the PAP accused the [Lim Yew Hock](/wiki/Lim_Yew_Hock) government of using the PPSO to stifle political dissent. In 1960, three years after Malaya's independence, the Emergency was declared over. However, the Malayan [Internal Security Act 1960](/wiki/Internal_Security_Act_1960) (\"ISA\") was passed in place of the PPSO with much of the same powers. During parliamentary debates on the Act, [Malayan Prime Minister](/wiki/Prime_Minister_of_Malaysia) [Tunku Abdul Rahman](/wiki/Tunku_Abdul_Rahman) stated that the ISA would only be applied against only the remaining Communist insurgents. The [Malayan Communist Party](/wiki/Malayan_Communist_Party) and its insurgents eventually surrendered in 1989. Nonetheless, the ISA was retained in Malaysia. The drafter of the Malayan ISA was [Hugh Hickling](/wiki/Hugh_Hickling), a British lawyer, author and professor. In 1989, he commented that he \"could not imagine then that the time would come when the power of detention, carefully and deliberately interlocked with Article 149 of the Constitution, would be used against political opponents, welfare workers and others dedicated to nonviolent, peaceful activities\". Nonetheless, he commented that he supported review of the ISA but it was not for him to say if the law should be scrapped, as \"you've got a multi-racial society [in Malaysia] in which emotions can run high very quickly\". When Singapore joined the Federation of Malaya in 1963, the Malayan ISA was extended to Singapore. The Act was retained in Singapore even after its separation from Malaysia in 1965. The current version of the Act is known as Chapter 143 of the 1985 Revised Edition. In September 2011, the debate over whether the ISA should be retained was re-opened after Malaysia announced that it was considering repealing the ISA. [Prime Minister](/wiki/Prime_Minister_of_Malaysia) [Najib Razak](/wiki/Najib_Razak) stated that the Act would be abolished and replaced by new laws to safeguard peace and order. The ISA was finally replaced and repealed by the [Security Offences (Special Measures) Act 2012](/wiki/Security_Offences_(Special_Measures)_Act_2012) on 31 July 2012 in Malaysia. The legitimacy and relevance of the ISA were subsequently debated by former ISA detainees, the [Singapore Government](/wiki/Government_of_Singapore), and others. Member of Parliament for [Pasir Ris–Punggol Group Representation Constituency](/wiki/Pasir_Ris-Punggol_Group_Representation_Constituency), Dr. [Janil Puthucheary](/wiki/Janil_Puthucheary), commented in Parliament on 18 October 2011 that \"while he felt it inappropriate to detain a citizen without trial, he is convinced by the hard logic that the safety and security of Singapore must be paramount\". However, he agreed that there needed to be more safeguards to prevent abuse of the ISA and that \"the ISA needs to be discussed in a more transparent manner, even as the facts associated with a given detainee need to be kept secret\". The following day, 19 October 2011, Deputy Prime Minister, Coordinating Minister for National Security and [Minister for Home Affairs](/wiki/Ministry_of_Home_Affairs_(Singapore)) [Teo Chee Hean](/wiki/Teo_Chee_Hean) explained the relevance of the ISA and its powers of preventive detention. He noted that in the 1960s preventive detention was primarily used to counter the subversive Communist threat posed by the [Malayan Communist Party](/wiki/Malayan_Communist_Party) which was hiding within legal organizations. For the past two decades, though, preventive detention has helped safeguard Singapore's national security by countering threats posed by espionage and terrorism. Preventive detention allows for a comprehensive assessment of a threat, as opposed to a criminal case tried before a court which requires the court to consider only the specific acts that relate to the charge. Detaining those who have not yet committed overt deeds that warrant prosecution also allows pre-emptive action to be taken to neutralize threats before they materialize into actual harm. In addition, the Minister said that detention without trial is preferable in situations where open prosecutions in court are not practicable due to the confidentiality of certain intelligence. Such intelligence might have been obtained through foreign security agencies on the understanding that the source and details would not be disclosed to an open court. What is more, disclosure of confidential intelligence could compromise ongoing or future operations through the revelation of existing sources and methods of intelligence gathering. However, if confidential information were withheld from the court, a criminal case could be weakened due to evidential requirements, which may result in the acquittal of an otherwise guilty accused. Finally, court proceedings may stall investigations as part of a broader network, and could exacerbate situations where communal sensitivities are involved. Opposition [political parties in Singapore](/wiki/List_of_political_parties_in_Singapore) have called for the ISA to be abolished. In its [manifesto](/wiki/Manifesto) for the [2011 general election](/wiki/2011_Singaporean_general_election), the [Workers' Party](/wiki/Workers%27_Party_of_Singapore) said that specific anti-terrorism and anti-espionage laws, which allow arrests and detention without trial only under strict conditions, should be enacted to replace the ISA. The [National Solidarity Party](/wiki/National_Solidarity_Party_(Singapore)) took a similar stance in February 2013. ## Legislative authority for enactment The legislative authority for the enactment of the ISA is Article 149 of the [Constitution of Singapore](/wiki/Constitution_of_Singapore), which appears in Part XII (\"Special Powers against Subversion and Emergency Powers\"). Entitled \"Legislation against subversion\", Article 149 states: > (1) If an Act recites that action has been taken or threatened by any substantial body of persons, whether inside or outside Singapore — > > (a) to cause, or to cause a substantial number of citizens to fear, organised violence against persons or property;(b) to excite disaffection against the President or the Government;(c) to promote feelings of ill-will and hostility between different races or other classes of the population likely to cause violence;(d) to procure the alteration, otherwise than by lawful means, of anything by law established; or(e) which is prejudicial to the security of Singapore, > > any provision of that law designed to stop or prevent that action or any amendment to that law or any provision in any law enacted under clause (3) is valid notwithstanding that it is inconsistent with Article 9, 11, 12, 13 or 14, or would, apart from this Article, be outside the legislative power of Parliament. > > (2) A law containing such a recital as is mentioned in clause (1) shall, if not sooner repealed, cease to have effect if a resolution is passed by Parliament annulling such law, but without prejudice to anything previously done by virtue thereof or to the power of Parliament to make a new law under this Article. > > (3) If, in respect of any proceedings whether instituted before or after 27th January 1989, any question arises in any court as to the validity of any decision made or act done in pursuance of any power conferred upon the President or the Minister by any law referred to in this Article, such question shall be determined in accordance with the provisions of any law as may be enacted by Parliament for this purpose; and nothing in Article 93 shall invalidate any law enacted pursuant to this clause. To satisfy the requirements of Article 149(1), the [preamble](/wiki/Preamble) to the Malaysian ISA, which has been retained in Singapore's ISA, contains the following [recital](/wiki/Recital_(law)): > Whereas action has been taken by a substantial body of persons to cause a substantial number of citizens to fear organised violence against persons and property: > > And Whereas action has been taken and threatened by a substantial body of persons which is prejudicial to the security of Malaya: > > And Whereas Parliament considers if necessary to stop or prevent that action: > > Now therefore pursuant to Article 149 of the Constitution be it enacted by the Duli Yang Maha Mulia Seri Paduka Baginda [Yang di-Pertuan Agong](/wiki/Yang_di-Pertuan_Agong) with the advice and consent of the [Dewan Negara](/wiki/Dewan_Negara) and [Dewan Ra'ayat](/wiki/Dewan_Rakyat) in Parliament assembled, and by the authority of the same, as follows ... ## Provisions relating to internal security Part II of the ISA, the first substantive part of the Act, contains provisions relating to [internal security](/wiki/Internal_security). It is divided into six chapters: I. Prohibition of organisations and associations of a political or quasi-military character and uniforms, *etc.*II. Powers of preventive detention.III. Special powers relating to subversive publications, *etc.*IV. Control of entertainments and exhibitions.V. Other powers for the prevention of subversion.VI. Miscellaneous. ### Prohibition of political or quasi-military organizations Chapter I of Part II of the ISA empowers the Minister for Home Affairs to take action against political or quasi-military organizations and associations. It is a criminal offence to be a member or adherent of any association of persons who are organized, trained or equipped to enable them to be employed \"in usurping the functions of the [police](/wiki/Singapore_Police_Force) or of the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces)\" or \"for the purpose of enabling them to be employed for the use or display of physical force in promoting any political or other object, or in such a manner as to arouse reasonable apprehension that they are organised or trained or equipped for that purpose\". It is a more serious crime to promote or conspire with someone else to promote, or to participate in the control or management of, the association, or to organize or train any member or adherent of the association. The Minister is empowered to prohibit any uniform or dress to be worn in public by members or adherents of a political or quasi-military association involved in the activities mentioned in the previous paragraph, or any uniform or dress indicating an association with a political organization or with the promotion of a political object. Wearing such a uniform or dress in contravention of the Minister's order is an offence. In addition, if the Minister considers it to be in the [national interest](/wiki/National_interest) to do, he may prohibit the \"manufacture, sale, use, wearing, display or possession of any flag, banner, badge, emblem, device, uniform or distinctive dress or any part thereof\". Currently, the only emblem or device that is prohibited is one \"in the form of a 5-pointed red star or a hammer and sickle in circumstances which raise a reasonable presumption that the emblem or device was intended or was likely to be used in a manner prejudicial to the interests of Singapore or to promote or foster a purpose prejudicial to or incompatible with peace, welfare or good order in Singapore\". It is a crime for a person to be present at or to attend any meeting or assembly organized for the participants to train or drill themselves or to be trained or drilled \"in the use of arms ... or for the purpose of practising military exercises, movements or evolutions\". It is also a crime to train or drill other people in these manners or to take part in the control or management of an association whose members are so trained. The prohibition does not apply to members of the Singapore Armed Forces, the police, a legally constituted volunteer or local force, a visiting force lawfully present in the country, or any organization or association exempted by the Minister. ### Preventive detention Chapter II of Part II of the ISA, which allows for [preventive detention](/wiki/Preventive_detention) (also known as detention without trial), is the most conspicuous feature of the Act. It confers on the executive a discretionary power to arrest and detain without trial, when necessary, a person with a view to prevent \"that person from acting in any manner prejudicial to the security of Singapore or any part thereof or to the maintenance of public order or essential services therein\". For the purposes of this provision, *essential services* means services relating to water, electricity, public health, fire, prisons, post, telephony, telegraphy, [radiocommunication](/wiki/Radio) (including broadcasting and television), ports, docks, harbours, public transport, and the bulk distribution of fuel and lubricants. Instead of detaining a person for the purposes mentioned above, the executive may impose other restrictions upon the person's liberty such as [curfews](/wiki/Curfew), requiring the reporting of their movements, prohibiting the person from speaking at public meetings or taking part in political activities, and travelling beyond Singapore or any part of the country. #### Procedure ##### Before detention Before a person can be detained under the ISA, the [President](/wiki/President_of_Singapore) must be satisfied that such detention is necessary for the purposes of national security or public order. This is a precondition for the valid exercise by the Minister for Home Affairs of the power to order the detention. The detention order is supplemented by section 74 of the ISA which empowers the police to arrest and detain any person pending enquiries without a warrant under section 8. ##### Initial detention Once an individual has been detained, there are administrative processes which the executive is required to follow under sections 9, 11 and 12 of the Act. The detainee is to be informed of the grounds of detention as soon as possible, unless their disclosure is against the national interest. They are to be served with a copy of the detention order as well as the grounds and allegations of fact on which the detention order was made. The detainee is also to be informed within 14 days of their right to make representations against the order to an advisory board, which is required to hear and consider the detainee's representations. Each advisory board is chaired by a [Supreme Court](/wiki/Supreme_Court_of_Singapore) judge appointed by the President, and has two other members appointed by the President in consultation with the [Chief Justice](/wiki/Chief_Justice_of_Singapore). The board has the powers of a court to summon and examine witnesses, and to order that documents be produced. It evaluates the evidence and must make recommendations to the President concerning the matter within three months of the date of detention. When the advisory board recommends the release of the detainee against the Minister's decision, the President exercises personal discretion whether the detainee should be released. Before exercising his discretion, the President is required to consult the Council of Presidential Advisers. Non-[citizens](/wiki/Singaporean_nationality_law) detained under the ISA do not have a right to make representations to an advisory board. They may, within two months from the date of the detention order, make written representations to the Minister. The Minister may, but is not bound to, refer the representations to an advisory board. Any decision on such representations by the Minister is final and cannot be called into question in any court. The [burden of proving](/wiki/Legal_burden_of_proof) that a person is a citizen lies on the person claiming to be one, and again the Minister's decision on the matter is final. ##### Extension and suspension of detention The initial order of the Minister for Home Affairs may direct that an individual be detained for up to two years. This may be further extended by directions issued by the President for further periods of up to two years at a time. The Minister is empowered with discretion to suspend a detention order, but also has the authority to revoke the suspension at any time, which reactivates the detention order. Detention orders must be reviewed at least once every 12 months by an advisory board which thereafter makes its recommendation to the Minister. If an advisory board recommends the release of a detainee and the Minister disagrees, the President may exercise personal discretion to order the release. The requirement for regular reviews of detention orders does not apply to detainees who are not citizens. When a detention order is extended, the Minister is not required to provide the detainee with the grounds justifying the extension order or give the detainee an opportunity to appeal against the extension. #### Scope of judicial review of ISA orders Under [administrative law](/wiki/Administrative_law_in_Singapore), [judicial review](/wiki/Judicial_review) is an exercise in which the [High Court](/wiki/High_Court_of_Singapore) scrutinizes the executive's decisions and orders to ensure that they conform with the law. If the decisions and orders are not authorized by statute or if they have been made in contravention of administrative law principles, the Court can invalidate them. Similarly, if any exercise of power by an executive body contravenes the Constitution, the Court has a duty to declare it invalid. With regards to the ISA and the powers to detain without trial, the scope of judicial review was subject to a succession of changes between 1988 and 1990. These changes revolved around the issue of whether the discretion of the President and the Home Affairs Minister should be assessed objectively or subjectively. During that period, the scope of judicial review was expanded by [common law](/wiki/Common_law) developments but was subsequently curtailed by legislative and constitutional amendments. ##### Before 1988: *Lee Mau Seng v. Minister for Home Affairs* Prior to 1988, the Singapore case of *Lee Mau Seng v. Minister for Home Affairs* (1971) was authority for the application of the subjective discretion test for judicial review of executive power exercised under the ISA. The subjective test precludes the court from inquiring into the facts and grounds that are relied upon by the executive body in exercising its discretion. It is based on the literal interpretation of the words \"[i]f the President is satisfied\" that appear in section 8 of the ISA, such that no more is required than the subjective satisfaction of the President. This reasoning applies similarly to section 10 of the ISA, which requires the Minister's satisfaction for the suspension of detention orders. ##### 1988–1989: *Chng Suan Tze v. Minister for Home Affairs* In the case of *[Chng Suan Tze v. Minister for Home Affairs](/wiki/Chng_Suan_Tze_v._Minister_for_Home_Affairs)* (1988), the [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore) expanded the scope of judicial review by adopting an objective test when reviewing the exercise of executive discretion. In contrast to the subjective test, the objective test permits the court to examine whether the decision-maker's satisfaction was based on objective facts which fell within the scope of the purposes specified by the ISA. The subjective satisfaction or mere *[ipse dixit](/wiki/Ipse_dixit)* of the executive body is insufficient. However, the adoption of this objective test was only part of the *[obiter dicta](/wiki/Obiter_dictum)* of the case. The *[ratio decidendi](/wiki/Ratio_decidendi)* of the case was based on narrower technical grounds. The subjective test was rejected for several reasons by the Court of Appeal. It held that applying the subjective test to sections 8 and 10 of the ISA would render the provisions unconstitutional. The word *law* in [Article 12(1)](/wiki/Article_12_of_the_Constitution_of_Singapore) of the Constitution was held in *[Ong Ah Chuan v. Public Prosecutor](/wiki/Ong_Ah_Chuan_v._Public_Prosecutor)* (1980) to encompass [fundamental rules of natural justice](/wiki/Article_9_of_the_Constitution_of_Singapore#Fundamental_rules_of_natural_justice). Hence, Parliament cannot pass legislation which authorizes the executive to exercise power in breach of these fundamental rules or to exercise power in an arbitrary manner. If the subjective test were to be adopted, it would in effect allow the executive to exercise arbitrary powers of detention, therefore rendering sections 8 and 10 of the ISA inconsistent with Article 12(1). When the case was decided, Article 149(1) of the Constitution, which protects the validity of anti-subversion laws notwithstanding inconsistencies with specified fundamental liberties, did not cover inconsistencies with Article 12. Also, the Court noted that adopting the objective test would be consistent with Article 93 of the Constitution, which vests judicial power in the courts. It did not, however, directly address the argument by counsel that the subjective test, in conferring arbitrary powers of detention, would be inconsistent with Article 93. Further, the Court rejected the subjective test on the basis that \"the notion of a subjective or unfettered discretion is contrary to the rule of law\". The [rule of law](/wiki/Rule_of_law_doctrine_in_Singapore) requires the courts to examine the exercise of discretionary power and ensure that executive power is exercised within its legal limits. The Court of Appeal also held that [legal precedents](/wiki/Precedent) from other Commonwealth jurisdictions supported a rejection of the subjective test in favour of the objective test. The subjective test was applied in *[Liversidge v. Anderson](/wiki/Liversidge_v_Anderson)* (1941) and subsequently affirmed in *Greene v. Secretary of State for Home Affairs* (1941). However, these decisions had been departed from in subsequent decisions by the [Privy Council](/wiki/Judicial_Committee_of_the_Privy_Council) and [House of Lords](/wiki/Judicial_functions_of_the_House_of_Lords). These courts had rejected the subjective test applied by the [majority](/wiki/Majority_opinion) in *Liversidge*, preferring the objective test applied by [Lord Atkin](/wiki/James_Atkin,_Baron_Atkin) in his [dissenting judgment](/wiki/Dissenting_opinion). In the light of these developments, the Malaysian case of *Karam Singh v. Menteri Hal Ehwal Dalam Negeri (Minister for Home Affairs), Malaysia* (1969), which had applied the test in *Liversidge* and which the respondents' counsel had relied on in support of the subjective test, could no longer be considered good law. Additionally, *Teh Cheng Poh v. Public Prosecutor* (1978) decided by the Privy Council on appeal from Malaysia, was referred to by the Court in support of the objective test. The case concerned the exercise of discretionary power under the [Malaysian Internal Security Act](/wiki/Internal_Security_Act_1960), which the ISA of Singapore is derived from. Although sections 8 and 10 of the ISA concern matters of national security, the Court held that this concern does not preclude the objective review of executive discretion. Following the case of *[Council of Civil Service Unions v. Minister for the Civil Service](/wiki/Council_of_Civil_Service_Unions_v_Minister_for_the_Civil_Service)* (1983), the Court of Appeal decided that it is up to the courts to determine whether a decision is in fact based on grounds of national security. Similarly, it should also be within the court's purview to determine whether the matters relied upon in exercising powers under the ISA fall within the scope of purposes specified by sections 8 and 10. ##### 1989 amendments and *Teo Soh Lung v. Minister for Home Affairs* Parliament subsequently passed the Constitution of the Republic of Singapore (Amendment) Act 1989 and the Internal Security (Amendment) Act 1989. They took effect on 27 and 30 January 1989 respectively. Section 8B(1) of the amended ISA provides that the law pertaining to the judicial review of decisions made by the President or the Minister was restored to the legal position applicable in Singapore on 13 July 1971, the date when *Lee Mau Seng* was decided. In *[Teo Soh Lung v. Minister for Home Affairs](/wiki/Teo_Soh_Lung_v._Minister_for_Home_Affairs)* (1990), the Court of Appeal held that these amendments reinstated the legal position set out in *Lee Mau Seng* as the applicable law governing judicial review in Singapore, thus prompting a return to the subjective test in reviewing the exercise of executive discretion under the ISA. The possible inconsistencies the subjective test had with respect to Articles 12 and 93 of the Constitution were sought to be resolved with the passing of the Constitution of the Republic of Singapore (Amendment) Act 1989. Article 149(1) was amended to shield any anti-subversion laws enacted pursuant to this provision from inconsistency with Articles 11 and 12. This was in addition to [Articles 9](/wiki/Article_9_of_the_Constitution_of_Singapore), (/wiki/Article_13_of_the_Constitution_of_Singapore) and (/wiki/Article_14_of_the_Constitution_of_Singapore) which had already been present in Article 149(1) before the amendment. Furthermore, a new Article 149(3) provided that nothing in Article 93 would invalidate any provisions that were enacted pursuant to Article 149. Hence, the ruling in *Chng Suan Tze* that the subjective test was inconsistent with the Constitution was legislatively reversed, and the subjective test was restored as the valid and relevant law in Singapore. The Internal Security (Amendment) Act 1989 also introduced section 8B(2), which is an [ouster clause](/wiki/Exclusion_of_judicial_review_in_Singapore_law#Total_ouster_or_finality_clauses) providing that no judicial review of orders made under the ISA shall be available save in relation to questions relating to the procedural requirements of the ISA. In *Teo Soh Lung*, the Court of Appeal held that it was not necessary for it to decide if the subjective test in *Lee Mau Seng* precluded judicial review in the case. Hence, the position remains to be confirmed by the courts. In addition, the Court decided that it was unnecessary to consider the effect of section 8B(2) on issues not related to national security and the constitutionality of the 1989 amendments to the ISA. Parliament also introduced into the ISA section 8D, which dictates that the Internal Security (Amendment) Act 1989 is to be applied [retrospectively](/wiki/Ex_post_facto_law) to proceedings instituted \"before or after\" 30 January 1989. [Article 11(1)](/wiki/Article_11_of_the_Constitution_of_Singapore) of the Constitution states: \"No person shall be punished for an act or omission which was not punishable by law when it was done or made, and no person shall suffer greater punishment for an offence than was prescribed by law at the time it was committed.\" Though the 1989 amendments to the ISA did not retrospectively introduce any criminal offences, the legislature saw fit to amend Article 149(1) by inserting a reference to Article 11 to forestall any possible arguments on section 8D's inconsistency with the Article. As the [Minister for Law](/wiki/Ministry_of_Law_(Singapore)) [S. Jayakumar](/wiki/S._Jayakumar_(Singaporean_politician)) said in Parliament: \"The reference to Article 11 is necessary to ensure the retrospective application of the Internal Security (Amendment) Bill is not challenged.\" The test for judicial review on matters not relating to the ISA remains the objective test. In *Kamal Jit Singh v. Minister for Home Affairs* (1992), the High Court held that validity of detention under the [Criminal Law (Temporary Provisions) Act](/wiki/Criminal_Law_(Temporary_Provisions)_Act_(Singapore)) is not dependent on the Minister's subjective satisfaction. Rather, the Minister must be objectively satisfied that the person was associated with criminal activities. #### Academic views ##### *Mala fides* situations While the current law in Singapore holds that the Home Affairs Minister's decision is subjective and not judicially reviewable, there is uncertainty whether there are exceptional situations in which the courts may still step in to practice judicial review even though the ISA deals with national security matters. A possible exception is when the Minister's decision was made *mala fides*, that is, in [bad faith](/wiki/Bad_faith). Such decisions would involve the clear abuse of power, such as being \"detained solely for having red hair or for failing a professional examination or for having acted as a lawyer against the Government\". However, the law on this issue is presently unclear. In *Lee Mau Seng*, the High Court said that *mala fides* was not a justiciable issue in relation to the ISA. A similar stance was taken in Malaysia in *Karam Singh*. However, in *Teo Soh Lung* the Court of Appeal said that it did not need to decide whether *Lee Mau Seng* has precluded judicial review in *mala fides* situations until a case with a *mala fides* factual situation arises. Furthermore, there is an increasing number of Malaysian cases reflecting \"a gradual recognition that ... indicate a retreat from the purely subjective approach\". In response to the harshness of the rule in *Lee Mau Seng*, academics have offered several suggestions for circumventing it. One is that the definition of *mala fides* used by the courts in *Lee Mau Seng* is actually unreasonableness and not *mala fides* in the narrow sense of dishonesty or bad faith. In *Cannock Chase District Council v. Kelly* (1977), [Lord Justice](/wiki/Lord_Justice_of_Appeal) Megaw asserted that bad faith is \"dishonesty\" and \"always involves a grave charge\". This contrasts with the meaning of *mala fides* in *Lee Mau Seng* which includes situations of carelessness or vagueness. Thus, an allegation of bad faith in the narrow sense could permit review by the courts. ##### Freezing of the common law After the 1989 amendments to the Constitution and the ISA, there was academic discourse on the effect of section 8B(1) on the future development of the common law. The amendments merely caused a time warp in the common law, taking it back to 1971. As they did not amount to a [codifying](/wiki/Codification_(law)) or declaratory Act seeking to replace the common law of judicial review, there is uncertainty whether the courts may continue to develop the common law and move away from the legal position laid down in *Lee Mau Seng*. Michael Rutter has asserted that the common law can indeed continue to change. While the Parliament has the power to turn the clock back, \"the Parliament is powerless to stop the clock from running\" and \"as soon as the clock is placed back in the hands of the judiciary, the hands might race forward again\". Such a stance has wide implications: the High Court and Court of Appeal would not be bound by *Lee Mau Seng*. They could rule that situations involving *mala fides* are judicially reviewable, or completely re-adopt the legal position stated in *Chng Suan Tze*. The justification is that \"if Parliament intended to render judiciary law impossible, it has only to issue its laws in a more detailed shape, so that in the vast complexity of human affairs there may always be at hand a rule sufficiently precise and definite to meet each particular case\". ##### Validity of ouster clause Another issue that has undergone academic scrutiny is the nature of section 8B(2) as an [ouster clause](/wiki/Exclusion_of_judicial_review_in_Singapore_law). An ouster clause is an objectively worded provision which is drafted to exclude the jurisdiction of the courts. In *Teo Soh Lung*, the Court of Appeal declined to address the constitutionality of section 8B and, in particular, how section 8B(2) should be interpreted. Michael Hor has described the judiciary's reluctance to address these points as \"an elegant piece of judicial 'kung fu'\" in which it chose to evade the problem. In a lecture to law students in 2010, [Chief Justice](/wiki/Chief_Justice_of_Singapore) [Chan Sek Keong](/wiki/Chan_Sek_Keong) commented that, in general, \"ouster clauses may be inconsistent with Article 93 of the Constitution, which vests the judicial power of Singapore in the Supreme Court\", though he expressed no concluded opinion on the matter. However, it seems unlikely that Article 93 can be relied on to invalidate section 8B(2) since Parliament specifically enacted Article 149(3) to protect the 1989 amendments to the ISA from inconsistency with Article 93. Tham Chee Ho has opined that where a jurisdictional [error of law](/wiki/Administrative_law_in_Singapore#Distinction_between_errors_of_fact_and_errors_of_law) is involved, judicial review will be available despite the presence of an ouster clause. However, an ouster clause still precludes judicial review of non-jurisdictional errors of law. If this distinction between jurisdictional and non-jurisdictional errors of law exists, section 8B(2) will preclude judicial review of non-jurisdictional errors of law but not jurisdictional errors. Notably, there is a difference between [English](/wiki/English_law) and [Singapore law](/wiki/Law_of_Singapore) as regards this issue. In *R. v. Lord President of the Privy Council, ex parte Page* (1992), [Lord Browne-Wilkinson](/wiki/Nicolas_Browne-Wilkinson,_Baron_Browne-Wilkinson) commented that the case of *[Anisminic Ltd. v. Foreign Compensation Commission](/wiki/Anisminic_v_Foreign_Compensation_Commission)* (1968) had the effect of rendering the distinction between jurisdictional and non-jurisdictional errors of law obsolete. This has limited the effect of ouster clauses in the United Kingdom since all errors of law are considered as jurisdictional. However, the Singapore courts have not yet adopted this legal position, and there are cases indicating that the distinction between jurisdictional and non-jurisdictional errors of law still exists. ##### Basic features doctrine The [basic features doctrine](/wiki/Constitution_of_Singapore#Basic_features_doctrine) developed in *[Kesavananda Bharati v. The State of Kerala](/wiki/Kesavananda_Bharati_v._The_State_of_Kerala)* (1973) and *[Minerva Mills Ltd. v. Union of India](/wiki/Minerva_Mills_v._Union_of_India)* (1980) by the [Supreme Court of India](/wiki/Supreme_Court_of_India) rests on the notion that there are certain elements of the nation's constitutional structure which cannot be amended by Parliament. In the High Court case of *[Teo Soh Lung v. Minister for Home Affairs](/wiki/Teo_Soh_Lung_v._Minister_for_Home_Affairs#High_Court_judgment)* (1989), the plaintiff argued that the 1989 amendments to the Constitution had violated the basic features of the Constitution by breaching the principle of [separation of powers](/wiki/Separation_of_powers_in_Singapore) by usurping judicial power, and contravening the rule of law. The Court rejected the application of the basic features doctrine owing to the differences in the making of the Singapore Constitution and the [Indian Constitution](/wiki/Constitution_of_India), and the fact that the framers of the Singapore Constitution had not expressly provided for limitations to be placed on Parliament's power of [amendment](/wiki/Constitution_of_Singapore#Amendment). The Court also held that, in any case, there had been no violation of the Constitution's basic features on the facts of the case. On appeal, the Court of Appeal determined the case on other grounds, and thus found it unnecessary to decide conclusively if the basic features doctrine applies in Singapore. ##### Role of the judiciary in national security matters There are competing views over the appropriate role of the judiciary in matters concerning preventive detention under the ISA. A related concern is whether the judicial process is suitable for such matters. The legislative and constitutional amendments relating to judicial review under the ISA were intended to limit the role of the courts in national security matters. In 1989, Law Minister S. Jayakumar argued in Parliament that the amendments were needed because the courts would effectively be responsible for national security matters if judicial review was permitted. The subjective test was deemed necessary to reserve to the executive the responsibility for national security matters, and to enable the Government to deal effectively with security threats. Tham Chee Ho contends that, based on the objective test set out in *Chng Suan Tze*, the fear that the courts will take over responsibility for national security matters is misplaced. This is because the courts do not review the actions taken by the executive for national security purposes, but merely determine whether the situation in fact involves national security issues. The Court of Appeal in *Chng Suan Tze* reflected this by holding that what was required to preserve national security was a matter solely for executive judgment. Another reason that was put forward by Jayakumar to justify a limited role by the judiciary was that the judicial process is unsuitable for deciding preventive detention issues. Persons who are potential threats to national security may act covertly, hindering the collection of evidence to secure a conviction in a court trial. By its nature, however, preventive detention is a precautionary measure and involves making decisions on limited information to prevent threats to national security from materializing. Jayakumar said that the court is ill-equipped to determine whether there are suspicious circumstances which justify pre-emptive action. Tham agrees with this view, but argues that it applies only where the courts review the exercise of executive power. He distinguishes the objective test applied in *Chng Suan Tze* from the situation mentioned by Jayakumar, since the court is only interested in whether there is a national security issue involved. [Thio Li-ann](/wiki/Thio_Li-ann) has opined that the 1989 measures taken to limit judicial checks on executive power demonstrate a preference for non-legal institutional checks. One example of a non-legal institutional check is the requirement under the Constitution and the ISA for an advisory board to hear detainees' representations and recommend to the President whether a detention order should be terminated. Thio argues that such checks are weak and cannot replace judicial review. She contends that since Article 149 of the Constitution permits the enactment of repressive laws which contravene constitutional liberties, meaningful restraints should be placed on the wide discretionary powers under the ISA. Similarly, in *Chng Suan Tze*, the Court of Appeal rejected the view that the executive's accountability to Parliament is a sufficient safeguard against the arbitrary exercise of power. Eunice Chua argues against adopting the subjective test and limiting judicial review to breaches of the procedures stated in the ISA. Her argument is based on the premise that courts should consider notions of [substantive democracy](/wiki/Substantive_democracy) in performing their judicial role. Chua argues that in *Teo Soh Lung* the Court of Appeal should have considered whether there were sufficient safeguards for the protection of detainees after the curtailment of judicial review through constitutional and legislative amendments. She suggests that Article 151, which provides for restrictions on preventive detention, should be read liberally in favour of detainees, bearing in mind the exclusion of fundamental liberties by Article 149. In her view, the curtailment of judicial review should therefore be rejected, as it does not accord with the \"spirit\" of Article 151 of the Constitution which ensures safeguards for detainees. Conversely, Jayakumar argued in 1989 that judicial review is an inappropriate safeguard in preventing abuse of the detention powers under the ISA in the situation where a dishonest government is in power. He argued that judicial safeguards are illusory because such a dishonest government would \"pack the courts\" and appoint judges which would rule in their favour. He regarded the best safeguard to be for voters to elect honest and incorruptible men into the Government. #### Criticisms of preventive detention In 2006, the [United States Department of State](/wiki/United_States_Department_of_State) noted that although the ISA had not been used against the Singapore Government's political opponents for some years, \"political opposition and criticism remained restricted by the government's authority to define these powers broadly. In the past, occasional government references to speech that it considered 'out-of-bounds' were understood to be implicit threats to invoke the ISA.\" The Singapore Government itself has regularly raised the need to prevent national security threats from materializing as a justification for preventive detention. However, there have been suggestions that the [criminal law](/wiki/Criminal_law_of_Singapore) is apt for dealing with this matter as well. Crimes of [accessory liability](/wiki/Accessory_(legal_term)) such as abetment, [conspiracy](/wiki/Conspiracy_(crime)) and [unlawful assembly](/wiki/Unlawful_assembly) in the [Penal Code](/wiki/Penal_Code_(Singapore)) may apply even if harm has not actualized. Furthermore, restrictions imposed by the Societies Act, as well as the offences in the [Sedition Act](/wiki/Sedition_Act_(Singapore)), may be viable alternatives to preventive detention. Preventive detention has been preferred over open court trials, as it has been suggested that the criminal trial could be used as a platform for radicals to publicize their views, and that it might confer the honour of [martyrdom](/wiki/Martyr) on accused persons. However, it has been suggested that an open trial which details the evils of terrorism and the indiscriminate destruction that it causes could educate the public and potentially unite the various communities in the country. Under the framework of the ISA, detainees are theoretically accorded [due process](/wiki/Due_process). For instance, detainees have a right to make representations against their detention to an advisory board. However, Article 151(3) of the Constitution prevents any government authority from disclosing any information which would, \"in its own opinion, be against national interest\". Therefore, there is no means to compel the authorities to disclose information which may be pertinent for the detainee to make a proper representation to an advisory board, thus compromising due process. Moreover, the secrecy of advisory board hearings has been criticized as it may lead to the public questioning the legitimacy of the hearings, and to an impression that justice has not manifestly been done. Due to the limited form of judicial review available under the ISA, whether a person remains under detention depends largely on the Ministry of Home Affairs. This raises the question *[quis custodiet ipsos custodes?](/wiki/Quis_custodiet_ipsos_custodes%3F)* – who guards the guardians? If preventive detention is applied illegitimately in a manner that cripples lawful democratic opposition, the absence of judicial review would preclude the exposure of such abuse. It has been submitted that the voice of public opinion is most suited for this purpose. #### Instances of the application of the PPSO and ISA According to *[The Sunday Times](/wiki/The_Straits_Times)* of 28 October 1956, 234 people, including trade union leaders [Lim Chin Siong](/wiki/Lim_Chin_Siong), [James Puthucheary](/wiki/James_Puthucheary) and [C. V. Devan Nair](/wiki/Devan_Nair), were detained under the PPSO as suspected Communist subversives. On 2 February 1963 [Operation Coldstore](/wiki/Operation_Coldstore), a joint Malaysian–Singaporean anti-Communist operation, led to the arrest of 133 people. As of 5 April 1963, 17 were being detained in the Federation of Malaya and 107 in Singapore, while the remaining nine had been released. On 30 October 1966, [Chia Thye Poh](/wiki/Chia_Thye_Poh), leader of the [leftist](/wiki/Left-wing_politics) [Barisan Sosialis](/wiki/Barisan_Sosialis) political party, was detained. He was subsequently held for 32 years pursuant to the ISA, the last nine of which under forms of [house arrest](/wiki/House_arrest) and civil rights restrictions, including confinement on the island of [Sentosa](/wiki/Sentosa). All such restrictions were finally lifted on 27 November 1998. As of that date, the *[South China Morning Post](/wiki/South_China_Morning_Post)* referred to him as \"the world's second longest serving [prisoner-of-conscience](/wiki/Prisoner_of_conscience) after South Africa's [Nelson Mandela](/wiki/Nelson_Mandela)\". *The Straits Times* of 28 May 1976 reported that 50 people allegedly involved in a Communist plot had been arrested. Among them were the playwright and theatre director [Kuo Pao Kun](/wiki/Kuo_Pao_Kun), then a secretary for the [Chinese Chamber of Commerce](/wiki/Singapore_Chinese_Chamber_of_Commerce_and_Industry), and his wife [Goh Lay Kuan](/wiki/Goh_Lay_Kuan). Kuo was detained under the ISA for four years and seven months, and his citizenship was revoked. Following his release he was placed under residence and travel restrictions until 1983. His citizenship was reinstated in 1992. In 1987, in a security operation known as [Operation Spectrum](/wiki/Operation_Spectrum), 22 [Roman Catholic church](/wiki/Roman_Catholicism_in_Singapore) and social activists and professionals were detained under the ISA. They were accused of being members of a dangerous [Marxist](/wiki/Marxism) conspiracy bent on subverting the government by force and replacing it with a Marxist state. The detentions led to, among others, the *Chng Suan Tze* and *Teo Soh Lung* cases. Two people were arrested in 1997 and four in 1998 for espionage activities. Of those arrested in 1997, one was a male permanent resident who was a deep-cover operative of a foreign intelligence service who had used the other person, a female Singaporean, as a collaborator. Three of the people arrested in 1998 were agents for a foreign intelligence agency. One of them had recruited the fourth person to collect intelligence on and to subvert a local community organization. All the detainees were subsequently released. In May 1988, former [solicitor general](/wiki/Solicitor_general) and [Law Society](/wiki/Law_Society_of_Singapore) President [Francis Seow](/wiki/Francis_Seow) was detained 72 days, for allegedly receiving political campaign finance from the United States, during the [1988 general election](/wiki/1988_Singaporean_general_election) as a [Workers' Party](/wiki/Workers%27_Party_(Singapore)) candidate. From 2001, the ISA was mainly used against [al-Qaeda](/wiki/Al-Qaeda)-inspired terrorists in Singapore. In December that year, 15 members of the [Jemaah Islamiyah](/wiki/Jemaah_Islamiyah) (JI) militant group were arrested for involvement in the [Singapore embassies attack plot](/wiki/Singapore_embassies_attack_plot). JI member Mohamed Khalim bin Jaffar was detained in January 2002 (and later released in September 2011), and another 21 members were arrested and detained in August 2002. In February 2006, alleged JI head [Mas Selamat bin Kastari](/wiki/Mas_Selamat_bin_Kastari) was [extradited](/wiki/Extradition) from Indonesia and detained under the ISA. He escaped from custody on 27 February 2008 and was only rearrested by the Malaysian authorities on 1 April 2009. He was transferred back to Singapore for detention under the ISA on 24 September 2010. Between November 2006 and April 2007, four Singaporean JI members were detained under the ISA while one had a restriction order issued against him. In addition, lawyer and lecturer Abdul Basheer s/o Abdul Kader, who radicalized himself by reading extremist propaganda on the Internet, was detained in February 2007 for preparing to engage in militant activities in Afghanistan. He was released on 21 February 2010, but rearrested in September 2012 and detained under the ISA the following month for planning to resume [jihadist](/wiki/Jihadism) [terrorism](/wiki/Islamic_terrorism) against foreign military operations abroad, including leaving Singapore – illegally, if necessary – to do so. Full-time [National Serviceman](/wiki/Conscription_in_Singapore) Muhammad Fadil Abdul Hamid was detained on 4 April 2010. He was described by the media as self-radicalized, having been deeply influenced by the lectures of [Feiz Mohammad](/wiki/Feiz_Mohammad) and [Anwar al-Aulaqi](/wiki/Anwar_al-Aulaqi) which he had accessed online. Around this time, two other people influenced by al-Aulaqi were placed under restriction orders. Between January and July 2011, three Muslim radicals were [deported](/wiki/Deportation) to Singapore from other countries and detained. JI members Jumari bin Kamdi and Samad bin Subari were arrested in Malaysia and Indonesia respectively; while Abdul Majid s/o Kunji Mohammad, a member of the [Moro Islamic Liberation Front](/wiki/Moro_Islamic_Liberation_Front) (MILF), was arrested in Malaysia. As of 13 September 2011, there were 17 people on orders of detention, one whose detention had been suspended, and 49 people on restriction orders. On 7 March 2013, it was mentioned in Parliament that 64 people had been detained under the ISA for activities related to terrorism since 2002. In September 2013, the Singapore media reported that Asyrani Hussaini had been detained in March that year and was the fifth Singaporean to have been influenced by radical ideology he had read online. Asyrani had entered Thailand illegally to take part in the [armed insurgency in Southern Thailand](/wiki/South_Thailand_insurgency), but was arrested and deported to Singapore. Another Singaporean, Mustafa Kamal Mohammad, was placed on a two-year restriction order from September 2013 for being a member of the MILF in the Philippines. Three Singaporean former JI members had their restriction orders lifted; they were Jahpar Osman and Samad Subari, and Abdul Majid Kunji Mohamad who had trained with the MILF. In late January 2021, the Singaporean [Internal Security Department](/wiki/Internal_Security_Department_(Singapore)) (ISD) confirmed it had detained a 16-year old Protestant Indian youth under the Internal Security Act for [plotting to attack](/wiki/Singapore_mosque_attacks_plot) the Assyafaah and Yusof Ishak Mosques on the anniversary of the [Christchurch mosque shootings](/wiki/Christchurch_mosque_shootings). The youth had been motivated by [anti-Muslim sentiments](/wiki/Islamophobia) and regarded the Christchurch mosque shooter Brenton Tarrant as a \"saint.\" The youth is the youngest person and first far right extremist to be detained under the ISA. In March 2021, the ISD confirmed it had detained 20-year old [national serviceman](/wiki/National_service_in_Singapore) Amirull Ali under the Internal Security Act for [plotting to attack](/wiki/Maghain_Aboth_Synagogue_attack_plot) three Jewish worshippers at the [Maghain Aboth Synagogue](/wiki/Maghain_Aboth_Synagogue) in solidarity for the [Palestinians](/wiki/Palestinians). Ali also reportedly planned to travel to [Gaza](/wiki/Gaza_Strip) to join [Hamas](/wiki/Hamas)' military wing, the [Izz ad-Din al-Qassam Brigades](/wiki/Izz_ad-Din_al-Qassam_Brigades). On 24 January 2024, the ISD issued a restriction order under the Internal Security Act against a 16-year old Chinese Singaporean youth who had aspired to carry out overseas attacks against [African Americans](/wiki/African_Americans), [Arabs](/wiki/Arabs), and [LGBTQ+](/wiki/LGBTQ%2B) individuals in North America and Europe. The youth had participated in far right online chat groups and channels, and been radicalised by far right ideologies. He identified as a [White supremacist](/wiki/White_supremacist) and subscribed to the [Great Replacement](/wiki/Great_Replacement) theory. In mid-July 2024, the ISD issued restriction orders against a 14-year old Singaporean teenager and former public servant An'nadya An'nahari, who had both been radicalised in response to the [Gaza war](/wiki/Gaza_war). The teenager had wanted to fight for a prophesied Muslim army called the \"Black Flag Army\" and started an online chat group for the purpose of recruiting classmates for terror attacks in Singapore. An'nahari had expressed support for the [Islamist](/wiki/Islamism) [Axis of Resistance](/wiki/Axis_of_Resistance), a network of Islamist militant and terror groups including [Hamas](/wiki/Hamas) and the [Houthi](/wiki/Houthi), and advocated violence against Israelis and Jews. Both individuals are subject to restriction orders which restrict their residency, travel movements and Internet access. ### Subversive documents Under Chapter III of Part II of the ISA, the minister responsible for printing presses and publications – currently the [Minister for Communications and Information](/wiki/Ministry_of_Communications_and_Information) – is authorized to ban documents and publications that are subversive or otherwise undesirable. For instance, the Minister may prohibit (absolutely or conditionally) the printing, publication, sale, issue, circulation or possession of a document or publication that: > (a) contains any incitement to violence; > > (b) counsels disobedience to the law or to any lawful order; > > (c) is calculated or likely to lead to a breach of the peace, or to promote feelings of hostility between different races or classes of the population; or > > (d) is prejudicial to the national interest, public order or security of Singapore ... Such a prohibition order can extend to any past or future issue of a periodical publication, and to other publications which have been issued or appear to have been issued by the publishing house, agency or other source which issued the prohibited publication. The proprietor of a prohibited publication can lodge an objection to a prohibition order within a month of the date when the order is published in the *Government Gazette* to the [President](/wiki/President_of_Singapore), whose decision on the matter is \"final and shall not be called in question in any court\". When exercising this discretion, the President is required to follow the advice of the [Cabinet](/wiki/Cabinet_of_Singapore). It is a criminal offence to print, publish, sell, issue, circulate, reproduce or possess a prohibited publication or an extract from it; and to import, abet the importation of, or have in one's possession any imported prohibited publication. There is a [rebuttable presumption](/wiki/Rebuttable_presumption) a person knows the contents of a publication and their nature immediately after the publication comes into their possession. However, it is a defence for a person to demonstrate that the publication was \"printed, published, sold, issued, circulated or reproduced, as the case may be, without his authority, consent and knowledge, and without any want of due care or caution on his part, and that he did not know and had no reason to suspect the nature of the document or publication\". Among the publications that have been interdicted under the Act are works by [Vladimir Lenin](/wiki/Vladimir_Lenin) and [Mao Zedong](/wiki/Mao_Zedong), and the Russian political newspaper *[Pravda](/wiki/Pravda)*. A crime is committed if any person posts or distributes a placard, circular or other document which contains an [incitement](/wiki/Incitement) to violence, counsels disobedience to the law or a lawful order, or is likely to lead to a [breach of the peace](/wiki/Breach_of_the_peace). Spreading false reports or making false statements likely to cause public alarm orally, in writing, or in any newspaper, periodical, book, circular or other printed publication is also an offence. Finally, it is an offence to carry or have in one's possession or under one's control a [subversive](/wiki/Subversion) document. A document is deemed to be subversive if, in whole or in part, it has a tendency: > (a) to excite organised violence against persons or property in Singapore; > > (b) to support, propagate or advocate any act prejudicial to the security of Singapore or the maintenance or restoration of public order therein or inciting to violence therein or counselling disobedience to the law thereof or to any lawful order therein; or > > (c) to invite, request or demand support for or on account of any collection, subscription, contribution or donation, whether in money or in kind, for the direct or indirect benefit or use of persons who intend to act or are about to act, or have acted, in a manner prejudicial to the security of Singapore or to the maintenance of public order therein, or who incite to violence therein or counsel disobedience to the law thereof or any lawful order therein. A document that purports to be a subversive document is presumed to be one until the contrary has been proved, and if it is proved that a person was carrying or had in their possession or under their control a subversive document, they are deemed to have known the contents of the document and their nature. Nevertheless, a person may defend themself by proving that they were unaware of the contents and the nature of the contents of the document, and that they did not have reasonable cause to believe or suspect that the document was subversive. The ISA places a duty on any person, any office-bearer of an association, or any responsible member or agent of an organization who receives a subversive document to deliver it to a police officer without delay. Failure to do so without police authorization, or communicating the contents of such a document to others or publishing them is an offence. ### Control of entertainments and exhibitions The Home Affairs Minister may, under Chapter IV of Part II of the ISA, order that any entertainment or exhibition be closed if satisfied if it \"is or is likely to be in any way detrimental to the national interest\". *Entertainment* is defined by the Act as \"any game, sport, diversion, concert or amusement of any kind to which the public has or is intended to have access and in which members of the public may or may not take part, whether on payment or otherwise\", while *exhibition* \"includes every display of goods, books, pictures, films or articles to which the public has or is intended to have access, whether on payment or otherwise\". It is an offence to be the promoter of or a person concerned in the promotion of an entertainment or exhibition held or continued in contravention of an order requiring it to be closed, or the proprietor of the premises on which such an event is held. However, it is a defence to show that the event was \"promoted or continued without his authority, consent and knowledge and without any want of due care or caution on his part\". Alternatively, to ensure that an entertainment or exhibition is not detrimental to the public interest, the Minister can impose conditions relating to the holding of the event on its promoter, every person involved in its promotion, and the proprietor of the premises on which the event is to be held. Failure to comply with any of such conditions is an offence, unless the person involved is able to show they were not responsible for the breach and exercised due care and caution. The authorities are empowered to close an entertainment or exhibition operated in breach of any condition, or kept open in contravention of an order by the Minister. To enable the Minister to determine whether an entertainment or exhibition should be banned or allowed to be held subject to conditions, the Minister can require that its promoter, any person involved in its promotion, or the proprietor of the premises on which it is to be held to provide information on the following matters: > (a) particulars of persons concerned in the promotion of the entertainment or exhibition and the interests represented by those persons; > > (b) particulars of the persons who have agreed to participate or participated in the entertainment or exhibition or have been invited to do so and the interests represented by those persons; > > (c) the purposes to which any profits from the entertainment or exhibition are intended to be or have been applied; and > > (d) such other matters as the Minister may direct. Furnishing false or incomplete information is an offence, and also entitles the Minister to prohibit an event from being held or direct it to be closed. The person providing the information also commits a crime if the event is held in a manner contrary to the information provided. ### Other powers Chapter VI of Part II of the ISA confers additional powers on the Minister for Home Affairs to prevent subversion. If a written law confers power on a person, body or authority to appoint people to positions, the Minister can order that they be provided with a list of the people from which the appointment will be made, and other information. The Minister can then direct that people whose appointment would be prejudicial to the interests of Singapore shall not be appointed or recruited. Furthermore, no person is permitted to disclose any communication received from the Minister except in the course of official duty. The Minister, if satisfied that a school or educational institution is being used for a purpose detrimental to the interests of Singapore or the public, for instruction that is detrimental to the interests of the public or pupils, or as a meeting-place of an unlawful society, can order that it be closed for a period not exceeding six months at a time. The board of managers or governors of an affected school or educational institution can lodge an objection against an order with the President, whose decision on the matter is final and may not be questioned in any court. The Minister's power does not extend to places where the teaching \"is of a purely religious character, or for a purely religious purpose\". A person who requires a certificate of suitability for admission to an institution of higher education must apply to the Director of Education, who must not issue a certificate if \"there appear to him to be reasonable grounds for believing that the applicant, if admitted to the institution in question, would be likely to promote, or otherwise participate in, action prejudicial to the interests or security of Singapore or any part thereof\". A person who does not hold a certificate of suitability may not be admitted to an institution of higher learning as a student. A person who has been refused a certificate may appeal to the Home Affairs Minister, whose decision on the matter is final and cannot be called into question in any court. The Minister can forbid pupils, students, teachers or members; any class of pupils, students, teachers or members; or any named pupil, student, teacher or member of any school, college, educational institution or students' union or association situated or established outside Singapore to enter into or travel within Singapore as a group unless they first obtain permission from the police to do so. An individual pupil, student, teacher or member can also be barred from Singapore if they intend to carry out within the country some common object of the group to which they belong. The police can grant permission for such travel subject to conditions. If there is a reason for the [Commissioner of Police](/wiki/Commissioner_of_Police_(Singapore)) to believe that any person: > (i) is a pupil, student, teacher or member affected by an order made under subsection (1) [that is, an order by the Minister that the person must obtain police permission to travel to Singapore]; > > (ii) has entered Singapore from a place outside and has not since the date of such entry continuously remained in Singapore for a period exceeding 3 months; > > (iii) is not the holder of a valid identity card issued to him in Singapore in accordance with the provisions of any written law for the time being in force relating to identity cards and which bears an address within Singapore; and > > (iv) has contravened or intends to contravene the provisions of any such order; ... or any person has breached any conditions imposed, the Commissioner can require that the person leave Singapore within a certain time and remain abroad for six months or a lesser period; or take the person into custody and remove them from Singapore, whereupon the person must remain out of Singapore for six months. Failure to comply with any order by the Minister or a breach of the conditions of any permission to travel to Singapore is an offence. The above provisions do not authorize the removal from Singapore of any citizen of Singapore ordinarily resident in the country. ## Provisions relating to security areas Part III of the ISA deals with security areas. Section 48, which is the only provision in Chapter I of Part III, empowers the President, acting on the Cabinet's advice, to proclaim any area in Singapore a security area if in his opinion public security in the area \"is seriously disturbed or threatened by reason of any action taken or threatened by any substantial body of persons, whether inside or outside Singapore, to cause or to cause a substantial number of citizens to fear organised violence against persons or property\" and \"he considers it to be necessary for the purpose of suppressing such organised violence\". A proclamation of a security area must be published by the Home Affairs Minister in any way that the Minister thinks necessary for bringing it to the notice of all persons who, in the Minister's view, should have notice of it. It comes into effect once notice has been given, even if it has not yet been published in the *Government Gazette*. A proclamation remains in force until the President revokes it or Parliament annuls it by passing a resolution. ### Preservation of public security Chapter II of Part III of the ISA empowers the Minister to take various steps to preserve public security. Within a security area, the Minister may declare areas to be danger areas, controlled areas or protected places. No person is allowed to enter or remain in a danger area unless escorted by a member of a security force, and to enforce this prohibition security forces can take all necessary measures, including those that are \"dangerous or fatal to human life\". A person who is injured while in a danger area unlawfully cannot make any legal claim for it, though compensation may be awarded if a compensation board thinks it is equitable to do so. The declaration of an area as a controlled area enables the Minister to order that people within the area may only reside within that portion of the area declared to be the \"residential part\", and that they may not venture beyond the residential part during certain hours. Failure to comply with such orders is a criminal offence. If the Commissioner of Police is of the view that it is \"necessary or expedient in the interests of public security or order, for the maintenance of supplies or services essential to the life of the community, that special precautions should be taken to prevent the entry of unauthorised persons\", he may declare a place or premises within a security area to be a protected place. While such a declaration is in force, no person is permitted to enter or remain in the place without the permission of the authority or person stated in the declaration. Persons wishing to enter a protected place must submit to being searched by police officers and other authorized persons, and must comply with directions concerning their conduct. A failure to do so can result in their removal from the protected place. It is an offence to be present in a protected place without permission, and to wilfully fail to stop after being challenged by a police officer or unlawfully refuse to submit to a search. The Commissioner of Police can take steps that he considers necessary to secure a protected place, including those that endanger the life of anyone entering the place. If the Commissioner employs such steps, he must take precautions (including displaying prominent warning notices) that he considers reasonably necessary to prevent accidental entry into the place. Once such precautions have been put in place, if any person enters the protected place without permission and is injured or killed, they are not entitled to receive any compensation or [damages](/wiki/Damages). The Minister can declare any fence or barrier surrounding a part of a security area to be a [perimeter fence](/wiki/Perimeter_fence). The Commissioner of Police is permitted to take steps to prevent people from crossing the fence or passing articles over, through or under the fence, including defensive measures that involve or may involve danger to life. If the measures are taken in a place other than on, under or within the perimeter fence, the Commissioner must take precautions – including displaying prominent warning signs – to ensure that people do not accidentally enter the area. If anyone is injured or dies as a result of a defensive measure, no compensation is payable unless the Minister certifies that it is just and equitable for such compensation to be paid. It is an offence to cross or attempt to cross, or pass or attempt to pass any article over, though or under a perimeter fence except at an authorized entry point; and to damage, attempt to damage or tamper with any fence or any gate or movable barrier at an entry point. In the interests of [public safety](/wiki/Public_safety), the Minister can make a \"clearance order\" concerning land that is within 46 metres (151 ft) of any railway, public road or perimeter fence within a security area, or land in a security area that is \"used for or in connection with the cultivation of rubber, [oil palm](/wiki/Elaeis_guineensis), [gutta-percha](/wiki/Gutta-percha), coconut, bananas or any other fruit growing on trees, or any other agricultural or food crops\". Such an order directs the owner or occupier of the land, their agent, or any person living in the area surrounded by a perimeter fence to clear away \"all herbage, bush and undergrowth and any other object mentioned in the order, other than permanent buildings\", prevent the undergrowth from growing higher than 30 centimetres (12 in), and maintain the cleanliness of the land. Failure to comply with a clearance order is a criminal offence. The officer in charge of a police division that forms part of a security area can do the following: - **Exclusion of persons**. Give a written order excluding any person or persons from the police division. - **Curfew**. Impose a [curfew](/wiki/Curfew) on specified persons, designating that they stay indoors or within a particular area between certain hours, unless they obtain a permit to the contrary issued by a police officer of or above the rank of sergeant. - **Control of roads**. Regulate, restrict, control or prohibit the use of a road or waterway by any person or class of persons; or any vehicle or vessel, or type or description of vehicle or vessel. In addition, can issue permits to regulate, restrict, control or prohibit persons or classes of persons from travelling in any bus, car, train or other vehicle, or in a vessel. A police officer or member of the security forces who is of or above the rating of [leading rate](/wiki/Leading_rating) or rank of non-commissioned officer and on duty, or a person authorized by the officer in charge of a police division, is empowered to seize any rice or other food if, because of its quantity or situation, it \"is likely to or may become available to any persons who intend or are about to act or have recently acted in a manner prejudicial to public security or to the maintenance of public order\". In support of this power, people, premises, vehicles and vessels can be searched without a [warrant](/wiki/Warrant_(law)). If it appears to the Minister to be \"necessary or expedient ... in the interests of public security, or for the accommodation of any security forces\", they may take possession of any land or building (or part of a building) in a security area. Police officers are permitted to use reasonable force when effecting the taking of possession, and the Minister can require the owner or occupier of the land or building to provide information relating to it. Once the land or building is in the Minister's possession, they have wide power to determine how to use it. The Minister is entitled to disregard any legal restrictions on how it may be utilized, authorize other persons to do with the property anything which the owner or occupier is entitled to do, and ban or limit anyone from exercising [rights of way](/wiki/Right_of_way_(public_throughway)) over, and other rights relating to, the land or building. Anyone who feels aggrieved by the Minister taking possession of land or a building can lodge an objection with an advisory committee. The committee is required to consider the objections and any grounds against the objections put forward by the person given possession of the property, and make recommendations to the Minister. The Minister can give \"such directions [on the recommendations] as he may think fit\", and award compensation. If a building or structure in a security area is left unoccupied due to an order relating to the security area, and the officer in charge of the police division in which the building or structure is situated takes the view that it may be used by \"any person or persons who intend, or are about, to act or have recently acted in a manner prejudicial to public security or by any other person who is likely to harbour any such persons\", and it is not practical to prevent such use, the officer can authorize the destruction of the building or structure. Compensation is payable for such destruction to a person if they can demonstrate to the Minister that the building or structure was constructed with the consent of the person lawfully entitled to the land on which it stood, and it was not liable to be forfeited. Even if the building or structure was subject to [forfeiture](/wiki/Forfeiture_(law)), the Minister can still pay compensation to the owner or occupier if the latter person can prove that it was used by persons acting in a manner prejudicial to public security or for harbouring such persons without their knowledge or consent, and that they exercised [due diligence](/wiki/Due_diligence) to ensure that the building would not be used in this manner. ### Offences Chapter III of Part III of the ISA creates a number of criminal offences relating to security areas. #### Firearms, ammunition and explosives It is an offence to carry, or have in one's possession or under one's control in a security area without lawful excuse, any firearm, ammunition or explosive without lawful authority. The penalty for the offence is [death](/wiki/Capital_punishment_in_Singapore). The onus is on the person charged to prove that they have a lawful excuse for having the item, and this can only be done by demonstrating that they acquired the item in a lawful manner for a lawful purpose, and did not act \"in a manner prejudicial to public security or the maintenance of public order\" while in possession of or having control of it. Furthermore, the person charged has lawful authority to have the item only if they: - are a police officer, member of the security forces, or person employed in the Prisons Department, and have the item in connection with the performance of their duty; - are licensed, or authorized without a licence, to have the item; or - have been granted an exemption by an officer in charge of a police division, or are a member of a class of persons exempted by the Commissioner of Police. However, even if any of the above situations applies to a person, they will not be regarded as having lawful authority if they have the item for the purpose of using it in a manner prejudicial to public security or the maintenance of public order. In *Liew Sai Wah v. Public Prosecutor* (1968), the appellant was arrested at the Singapore train station for having six grenade bodies in his bag. He was charged and found guilty of possession of ammunition by the High Court, and sentenced to death. The conviction was upheld by the [Federal Court of Malaysia](/wiki/Federal_Court_of_Malaysia) (then part of [Singapore's court hierarchy](/wiki/Judicial_system_of_Singapore)). However, on further appeal to the Privy Council, their Lordships held that grenade bodies did not come within the term *ammunition*, which was defined as \"ammunition for any fire-arm as hereafter defined and includes grenades, bombs and other like missiles whether capable of use with such a fire-arm or not and any ammunition containing or designed or adapted to contain any noxious liquid, gas or other thing\". Counsel for the Public Prosecutor suggested that grenade bodies might fall within the definition of *explosive*, which includes \"any material for making an explosive and any apparatus, machine, implement or material used or intended to be used or adapted for causing or aiding in causing any explosion in or with any explosive, and any part of any such apparatus, machine or implement\". However, the Privy Council declined to allow this submission as it involved the presentation of a case completely different from the one that the appellant was required to meet during his trial and the appeal before the Federal Court. The appellant was therefore [acquitted](/wiki/Acquittal). It is a crime, while in a security area, to consort with or to be found in the company of a person carrying or having possession of or having under their control a firearm, ammunition or explosive in contravention of the offence mentioned above, if the circumstances raise a reasonable presumption that the person consorting intends or is about to act or has recently acted with the person having the item in a manner prejudicial to public security or the maintenance of public order. The penalty is either death or life imprisonment. It is a slightly less serious offence to be in a security area and consort with or be in the company of another person if it is reasonable for the person consorting to know that the other person had one of the above items. The penalty for this offence is imprisonment not exceeding ten years. If a person is carrying or has in their possession or under their control a firearm, ammunition or explosive, there is a rebuttable presumption that the person was acting in contravention of the offence mentioned above. #### Supplies It is an offence for a person, whether inside or outside a security area, to demand, collect or receive supplies from another person under circumstances which raise a reasonable presumption that: - the first person intends or is about to act, or has recently acted, in a manner prejudicial to public security or the maintenance of public order; or - the supplies are intended for someone who intends or is about to act, or has recently acted in such a manner, or are for a terrorist to use. It is also an offence, inside or outside a security area, to be found in possession of supplies which cannot be satisfactorily accounted for, or to directly or indirectly provide supplies to another person, in circumstances which raise the reasonable presumption referred to above. The penalty for all these offences is life imprisonment. However, in the latter situation, a person will not be convicted if they voluntarily provide full information of the offence to a police officer before being accused of or charged with the offence. #### Other offences A person inside or outside a security area who knows or has reasonable cause to believe that another person has committed an offence under Part III of the ISA, or has information about the present or intended movements or whereabouts of another person whom they know or have reasonable cause to believe to be a terrorist, but who fails to report the matter to a police officer, commits an offence punishable by imprisonment for up to ten years. However, if the person voluntarily gives full information to a police officer before being accused of or charged with an offence, they will not be convicted. It is also an offence to [attempt](/wiki/Attempt) to commit an offence under Part III; to assist someone that one knows or has reasonable cause to believe has committed an offence to prevent, hinder or interfere with that person's arrest, trial or punishment; or generally to contravene or fail to comply with any provision of Part III or any order made, direction given or requirement imposed under Part III, or to abet any contravention or failure by another person. ## Miscellaneous provisions The final part of the ISA, Part IV, contains various miscellaneous provisions. Some notable provisions are described in this section. A police officer is entitled to use such force as is reasonably necessary in the circumstances, including lethal weapons: - to arrest a person subject to a detention order; - to arrest a person in respect of whom the officer has reason to believe that there are grounds justifying their preventive detention, or that they have acted or are about to act or are likely to act in a manner prejudicial to national security; - to arrest a person suspected of having committed an offence under the ISA, the Corrosive and Explosive Substances and Offensive Weapons Act, or sections 435 or 436 of the Penal Code which criminalize the commission of mischief by fire or an explosive substance to damage property or destroy a building; - to overcome forcible resistance by a person to such an arrest; or - to prevent an arrested person from escaping or being rescued from arrest. A person who has been arrested for any of the offences mentioned above must, as soon as possible after arrest, be \"clearly warned of his liability to be shot at if he endeavours to escape from custody\". In addition to a police officer, the power to use force can be exercised by a member of the security forces, any guard or watchman in a protected place, and any person authorized by the Commissioner of Police. Provisions exist in the ISA to make it easier to admit statements made by people charged with offences under the Act or certain offences under other laws specified in the Second Schedule to the Act. A statement is [admissible](/wiki/Admissible_evidence) in evidence in a trial and, if the person who made the statement chooses to testify during a trial, it may be used in cross-examination and to impeach their credit, \"whether the statement amounts to a [confession](/wiki/Confession_(law)) or not or is oral or in writing, made at any time, whether before or after that person is charged and whether in the course of a police investigation or not and whether or not wholly or partly in answer to questions, by that person to or in the hearing of any police officer of or above the rank of sergeant and whether or not interpreted to him by any other police officer or any other person concerned, or not, in the arrest\". This is subject to two limitations: - A statement is not admissible \"if the making of the statement appears to the court to have been caused by any inducement, threat or promise having reference to the charge against that person, proceeding from a person in authority and sufficient in the opinion of the court to give that person grounds which would appear to him reasonable for supposing that by making it he would gain any advantage or avoid any evil of a temporal nature in reference to the proceedings against him\". - If a statement has been made by a person after being arrested, it is only admissible if the court is satisfied that a caution along the following lines was administered: \"It is my duty to warn you that you are not obliged to say anything or to answer any question, but anything you say, whether in answer to a question or not, may be given in evidence.\" However, if a person makes a statement before there is time to administer a caution, the statement remains admissible if the caution is then administered as soon as possible. Once a person has been cautioned, they have a [right to remain silent](/wiki/Right_to_silence) and are not required to answer any questions. - [Internal Security Act 1960](/wiki/Internal_Security_Act_1960) - [Criminal Law (Temporary Provisions) Act (Singapore)](/wiki/Criminal_Law_(Temporary_Provisions)_Act_(Singapore)) - [Judicial independence in Singapore](/wiki/Judicial_independence_in_Singapore) - [Hong Kong national security law](/wiki/2020_Hong_Kong_national_security_law) ## Notes ### Cases - *Lee Mau Seng v. Minister for Home Affairs* SGHC 10, [1971–1973] S.L.R.(R.) 135, [High Court](/wiki/High_Court_of_Singapore) (Singapore), archived from the original on 5 January 2012. - *[Chng Suan Tze v. Minister for Home Affairs](/wiki/Chng_Suan_Tze_v._Minister_for_Home_Affairs)* SGCA 16, 2 S.L.R.(R.) [*Singapore Law Reports (Reissue)*] 525, [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore) (Singapore), archived from the original on 24 December 2011. - *[Teo Soh Lung v. Ministry for Home Affairs](/wiki/Teo_Soh_Lung_v._Minister_for_Home_Affairs#High_Court_judgment)* 1 S.L.R.(R.) 461, H.C. (Singapore) (\"*Teo Soh Lung* (H.C.)\"). - *[Teo Soh Lung v. Minister for Home Affairs](/wiki/Teo_Soh_Lung_v._Minister_for_Home_Affairs)* 1 S.L.R.(R.) 347, C.A. (Singapore) (\"*Teo Soh Lung* (C.A.)\"). ### Legislation - [Constitution of the Republic of Singapore](/wiki/Constitution_of_Singapore) (1985 Rev. Ed., 1999 Reprint). - Essential (Detained Non-Citizens) Regulations (Cap. 90, Rg 12, 1990 Rev. Ed.). - Internal Security Act 1960 (2020 Rev. Ed.) (\"ISA\"). - Internal Security (General) Regulations (Cap. 143, Rg 2, 1990 Rev. Ed.) (\"ISGR\"). ### Other works - Hor, Michael (2002), \"Terrorism and the Criminal law: Singapore's Solution\", *Singapore Journal of Legal Studies*: 30–55, [SSRN](/wiki/SSRN_(identifier)) 426922. - [Teo Chee Hean](/wiki/Teo_Chee_Hean) (Deputy Prime Minister, Coordinating Minister for National Security and [Minister for Home Affairs](/wiki/Ministry_of_Home_Affairs_(Singapore))), \"Debate on President's Address (Third Allotted Day)\", *Singapore Parliamentary Debates, Official Report* (19 October 2011), vol. 88, cols. 61–73. - Tham, Chee Ho (1992), \"Judiciary Under Siege?\", *Singapore Law Review*, **13**: 60–84. - Yee, Chee Wai; Ho, Tze Wei Monica; Seng, Kiat Boon Daniel (1989), \"Judicial Review of Preventive Detention under the Internal Security Act – A Summary of Developments\", *Singapore Law Review*, **10**: 66–103. ### Articles - Lee, Jack Tsen-Ta (2012), *The Past, Present and Future of the Internal Security Act [Singapore Management University School of Law Opinion Series No. JL3/2012]*, SelectedWorks; first published as Lee, Jack Tsen-Ta (June 2012), \"The Past, Present and Future of the Internal Security Act\" (PDF), *Dignity Defined*, pp. 6–9, archived from the original (PDF) on 13 March 2016. - Sin, Boon Ann (1989), \"Judges and Administrative Action – A Look at *Chng Suan Tze v Minister of Home Affairs & Ors*\", *Malayan Law Journal*, **2**: ci–cvii. - Yeong, Sien Seu (1992), \"Clarity or Controversy – The Meaning of Judicial Independence in Singapore and Malaysia\", *Singapore Law Review*, **13**: 85–108. - Zee, Josiah (2011), \"Defending Singapore's Internal Security Act: Balancing the Need for National Security with the Rule of Law\", *Murdoch University Electronic Journal of Law*, **18** (1): 28–46, archived from the original on 19 April 2013. ### Books and other works - Prof. [S. Jayakumar](/wiki/S._Jayakumar_(Singaporean_politician)) ([Minister for Law](/wiki/Ministry_of_Law_(Singapore))), speech during the Second Reading of the Constitution of the Republic of Singapore (Amendment) Bill, *Singapore Parliamentary Debates, Official Report* (25 January 1989), vol. 52, cols. 463–528. - Prof. S. Jayakumar (Minister for Law), speech during the Second Reading of the Internal Security (Amendment) Bill, *Singapore Parliamentary Debates, Official Report* (25 January 1989), vol. 52, cols. 531–556. - Tan, Jing Quee; Teo, Soh Lung; Koh, Kay Yew (2009), *Our Thoughts are Free: Poems and Prose on Imprisonment and Exile*, Singapore: [Ethos Books](/wiki/Ethos_Books), [ISBN](/wiki/ISBN_(identifier)) 978-981-08-2511-9. - Tan, Kevin Y[ew] L[ee]; Thio, Li-ann (2010), \"Special Powers against Subversion and Emergency Powers\", *Constitutional Law in Malaysia and Singapore* (3rd ed.), Singapore: [LexisNexis](/wiki/LexisNexis), pp. 180–261, [ISBN](/wiki/ISBN_(identifier)) 978-981-236-795-2. - Teo, Soh Lung (2010), *Beyond the Blue Gate: Recollections of a Political Prisoner*, Petaling Jaya, Selangor, Malaysia: Strategic Information and Research Development Centre, [ISBN](/wiki/ISBN_(identifier)) 978-967-5-83201-7. - *Teo Soh Lung: Singapore [Lawyer to Lawyer Network, Human Rights Documents, General, 1582, doc. 123]*, New York, N.Y.: [Lawyers Committee for Human Rights](/wiki/Human_Rights_First), December 1988, [OCLC](/wiki/OCLC_(identifier)) 57694111. - Thio, Li-ann (2012), \"Constitutional Supremacy\", *A Treatise on Singapore Constitutional Law*, Singapore: [Academy Publishing](/wiki/Singapore_Academy_of_Law), pp. 223–271 at 260–271, paras. 04.084–04.104, [ISBN](/wiki/ISBN_(identifier)) 978-981-07-1515-1. - *Update [Lawyer to Lawyer Network, Human Rights Documents, General, 1582, doc. 175]*, New York, N.Y.: Lawyers Committee for Human Rights, June 1990, [OCLC](/wiki/OCLC_(identifier)) 57698074. - Official website of the Internal Security Department, Ministry of Home Affairs, Singapore - Official website of the Parliament of the Republic of Singapore\n",
  "language": "en",
  "processed_at": "2026-01-12T11:12:44.574345",
  "title": "Internal Security Act (Singapore)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Internal_Security_Act_(Singapore)"
}