{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:12:38.007089"
  },
  "content": "Inter-faith platforms established in 2002 The **Racial and Religious Harmony Circles** (Harmony Circle), formerly known as Inter-Racial and Religious Confidence Circles (IRCCs), are local-level inter-faith platforms in every constituency, formed to promote racial and religious harmony. The work of the Harmony Circle is instrumental in strengthening social cohesion and supports the [SGSecure](/wiki/SGSecure) movement. ## History The Inter-Racial Confidence Circles (IRCCs) were formed in 2002 by then-Prime Minister [Goh Chok Tong](/wiki/Goh_Chok_Tong) against the backdrop of the [September 11, 2001 attacks](/wiki/September_11,_2001_attacks) in the United States, and the arrest in December 2001 of 15 [Jemaah Islamiyah](/wiki/Jemaah_Islamiyah) members in Singapore who planned to [bomb diplomatic missions and attack nationals of Australia, Israel, the United Kingdom and the United States based in Singapore](/wiki/Singapore_embassies_attack_plot). Re-positioned in 2006 to include religious organisations, the IRCCs serve as the local-level inter-faith platforms under the Community Engagement Programme (CEP) to respond quickly to incidents with racial and religious dimensions. Friendships and networks of trust are built during peacetime to ensure that we can withstand challenges and strains on our social cohesion. The IRCCs were officially renamed as \"Inter-Racial and Religious Confidence Circles\" on 7 Sep 2007. The acronym, IRCC, however, remained the same. The renaming signifies the IRCCs’ active promotion of inter-religious understanding and harmony. At the IRCC's 20th-anniversary celebration (30 July 2022), the IRCC was officially renamed to the Racial and Religious Harmony Circle to ensure the platform which fosters racial and religious ties remains relevant and better meets new challenges such as evolving societal attitudes. This was one of several recommendations put forth by a newly-formed workgroup and announced by Minister for Culture, Community and Youth Edwin Tong during the celebration. ## Purpose The Harmony Circles serve as important bridges between religious, ethnic and community groups at the local level. Leaders from various religious, ethnic and other community organisations have come together to join the Harmony Circle networks to build friendships and trust. The Harmony Circles also aim to deepen people's understanding of the various faiths, beliefs and practices through inter-faith and inter-ethnic themed activities such as inter-faith heritage trails, inter-faith talks and dialogues and various ethnic and religious celebrations. The Harmony Circles are also primed to respond quickly to incidents with racial and religious tensions and to project solidarity on the ground during crises. Through the Harmony Circles, [Ministry of Culture, Community and Youth](/wiki/Ministry_of_Culture,_Community_and_Youth) (MCCY) encourages leaders and their followers from religious organisations to join in the efforts to build networks of trust during peacetime. MCCY is also actively involving the other ethnic and community organisations such as clan associations to participate in the Harmony Circles. In the aftermath of a crisis, they will be the key links to disseminate information, soothe and minimise communal tension, and maintain confidence in the community. Harmony Circle members also keep track of grievances and complaints from the ground, thus giving them a unique understanding of local racial or religious sentiments. Harmony Circles also function as the main sources of information from the Government on the ground. A National Steering Committee (NSC) on Harmony Circles provides broad guidance for Harmony Circles to deepen inter-racial and inter-religious rapport within the community. There are currently 92 Harmony Circles in Singapore, one for each constituency. ## Recent developments ### January 2007 - On 13 January 2007, speaking at a forum for chairmen and members of IRCCs, Dr. [Vivian Balakrishnan](/wiki/Vivian_Balakrishnan), [Minister for Community Development, Youth and Sports](/wiki/Ministry_of_Community_Development,_Youth_and_Sports_(Singapore)), challenged IRCCs to recruit more ethnic and religious leaders and build informal ties with cultural groups so that the confidence circles would be more representative of the ethnic and religious composition of their constituencies. This would help the nation to be better prepared in the event of a [terrorist attack](/wiki/Terrorism). He also suggested that IRCCs broaden their reach by working with grassroots organizations, sharing their networks and organizing events for residents. This way, they could reach out to a significant proportion of residents who might not be part of any ethnic- or religious-based organization. To prepare for a crisis, IRCCs should also devise \"community mobilization plans\", which would include steps to quell false, dangerous rumours that could spark communal incidents. - [Declaration of Religious Harmony](/wiki/Declaration_of_Religious_Harmony) - [Racial Harmony Day](/wiki/Racial_Harmony_Day) ## Notes - Official website of inter-racial and religious confidence circles, managed by the Ministry of Community Development, Youth and Sports of Singapore Archived 2013-06-03 at the [Wayback Machine](/wiki/Wayback_Machine)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:12:38.006520",
  "title": "Inter-racial and religious confidence circle",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Inter-racial_and_religious_confidence_circle"
}