{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:12:42.004995"
  },
  "content": "School in Singapore The **Intercultural Theatre Institute** (**ITI**), formerly known as [Theatre Training & Research Programme](/wiki/Theatre_Training_%26_Research_Programme) (TTRP), is a specialised, independent actor-training school in Singapore that offers a three-year full-time programme that trains actors through contemporary approaches and classical Asian theatre training. It is currently under the aegis of Singapore's [Committee for Private Education](/wiki/Committee_for_Private_Education). Founded by dramatist [Kuo Pao Kun](/wiki/Kuo_Pao_Kun) and current director, [T. Sasitharan](/wiki/T._Sasitharan) in 2000, the school takes in a maximum of 12 students every year from all over the world. The institute is currently located at 11 Upper Wilkie Road, near [The Istana](/wiki/The_Istana) within the city limits of [Singapore](/wiki/Singapore). ## History TTRP was founded in 2000 by the internationally known director, playwright, and father of contemporary theatre in Singapore, [Kuo Pao Kun](/wiki/Kuo_Pao_Kun), and [T. Sasitharan](/wiki/T._Sasitharan). It started operations as a division of arts charity Practice Performing Arts Centre Ltd (renamed The Theatre Practice Ltd in 2010), with seed funding from the Lee Foundation and Sim Wong Hoo. It was located at the [Creative Technology](/wiki/Creative_Technology) building in International Business Park and was later awarded a grant from the [Ministry of Information, Communications and the Arts](/wiki/Ministry_of_Communications_and_Information) for the years 2001 to 2003. In 2003, the pioneering cohort of students graduated. In 2008, TTRP moved to 11 Upper Wilkie Road as an anchor tenant and co-founded Emily Hill Enterprise Ltd, together with four other artists and organisations. As part of its research work, TTRP also organised the inaugural Asian Intercultural Conference with the theme “Theatre Today: Seeking New Paradigms”. The same year, TTRP suspended teaching and training activity. In 2011, TTRP relaunched with a new name, Intercultural Theatre Institute (ITI). In 2015, ITI was named a recipient of the National Arts Council Major Grant award. ## Approach and objectives ITI's acting programme is characterised by its performer-centred, practice-oriented training that emphasises intercultural work and original creation. It immerses students in classical theatre forms from Asia – such as [Beijing Opera](/wiki/Peking_opera), [Kutiyattam](/wiki/Koodiyattam), [Noh Theatre](/wiki/Noh) and [Wayang Wong](/wiki/Wayang_wong) – and juxtaposes these intense interactions with [Stanislavskian](/wiki/Konstantin_Stanislavski) and post-Stanislavskian actor training techniques. The process of skills acquisition and recombination takes place in a plural, intercultural environment with a variety of languages, multiple cultures and a broad, inclusive theatrical palette. Its aim is to train professional actors and performers capable of working in a variety of contemporary theatre genres and forms as well as the creation of original, critically aware and socially engaging works. ## Notable faculty members - Aarne Neeme - Alberto Ruiz Lopez - Bambang Besur Suryono - Gopalan Nair Venu - Jane Margaret Gilmer - Kanze Yoshimasa (Japanese: 観世喜正) - Kapila Venu - Kuwata Takashi (Japanese: 桑田貴志) - Lim Chin Huat - Li Qiu Ping (simplified Chinese: 李秋萍) - Phillip Zarrilli - Guillermo Roberto Angelelli ## Notable alumni - [Yeo Yann Yann](/wiki/Yeo_Yann_Yann) – Actor (Class of 2003) - Peter Sau – Actor, director, educator (Class of 2003) - Andy Ng Wai Shek – Actor, director, educator (Class of 2003) - Miyuki Kamimura – Actor, educator (Class of 2005) - [Sreejith Ramanan](/wiki/Sreejith_Ramanan) – Actor, director, researcher (Class of 2006) - [Sankar Venkateswaran](/wiki/Sankar_Venkateswaran) – Actor, director, producer, dramaturge and composer (Class of 2008) ## Board Members - Arun Mahizhnan (chairman) – Special research advisor, Institute of Policy Studies Members - [Chew Kheng Chuan](/wiki/Chew_Kheng_Chuan) – Independent consultant in philanthropy; Chairman, The Substation - Winifred Loh – Director, LeadForte Consulting - Nazry Bahrawi – Senior lecturer, Singapore University of Technology and Design - Andrew Nai – Director at Aura Private Equity, Aura Group - Jean Tay – Playwright - Official website - Class of its own: What makes Intercultural Theatre Institute different 1°18′11″N 103°50′54″E﻿ / ﻿1.30307°N 103.84840°E﻿ / 1.30307; 103.84840\n",
  "language": "en",
  "processed_at": "2026-01-12T11:12:42.004527",
  "title": "Intercultural Theatre Institute",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Intercultural_Theatre_Institute"
}