{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:12:48.039615"
  },
  "content": "* *This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **contains promotional content**. Please help improve it by removing promotional language and inappropriate external links, and by adding encyclopedic text written from a neutral point of view. *(November 2017)* *(Learn how and when to remove this message)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"International Enterprise Singapore\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(November 2017)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* **International Enterprise Singapore** (**IE Singapore**) was a [statutory board](/wiki/Statutory_boards_of_the_Singapore_Government) under the [Ministry of Trade and Industry](/wiki/Ministry_of_Trade_and_Industry_(Singapore)) of the [Government of Singapore](/wiki/Government_of_Singapore). It facilitated the growth of Singapore-based companies overseas and promoted international trade. On 1 April 2018, IE Singapore merged with [SPRING Singapore](/wiki/SPRING_Singapore) to form [Enterprise Singapore](/wiki/Enterprise_Singapore). ## History The **Singapore Trade Development Board** (TDB) formed on 1 January 1983 to develop Singapore as an international trading hub and to promote Singaporean goods and services. Activities ranged from basic trade facilitation, to reviewing existing marketing policies, strategies and techniques. It explored opportunities in both traditional and non-traditional markets, and subsequently exported business systems and developed international offshore trading. It also had a role in trade policy after Singapore joined the [General Agreement on Tariffs and Trade](/wiki/General_Agreement_on_Tariffs_and_Trade), to actively secure market access and lobby for free trade. It issued its own [revenue stamps](/wiki/Revenue_stamps_of_Singapore#Trade_Development_Board) as well. In 2002, it was renamed as International Enterprise Singapore. The re-branding coincided with an acknowledgment that Singapore had to move beyond its [investment](/wiki/Investment)-led and electronics-dominated export base and to diversify her sources of growth. One of the key thrusts in Singapore's new economic strategy was to help Singapore-based companies internationalize and grow in an increasingly global market. TDB was thus renamed International Enterprise Singapore (IE Singapore) on 12 April 2002 to mark a strategic shift in activities, which would then focus less on export promotion, and more on helping Singaporean business start and develop their business overseas. In this way, IE Singapore was analogous to other trade and export promotion agencies such as the [Australian Trade Commission](/wiki/Australian_Trade_Commission) (Austrade) and the [Japan External Trade Organization](/wiki/Japan_External_Trade_Organization). However, their roles differed to reflect the different economic strategies envisaged by their respective governments, which also depended on the relative profile and orientation of their economies. IE Singapore, for example, focused also on investment matters, while organizations such as JETRO have also shifted to activities such as import promotion. It was one of many examples of Trade Promotion Agencies (TPOs) internationally facing change, and had adjusted their mission appropriately to suit the times. On 1 April 2018, IE Singapore merged with [SPRING Singapore](/wiki/SPRING_Singapore) to form [Enterprise Singapore](/wiki/Enterprise_Singapore).\n",
  "language": "en",
  "processed_at": "2026-01-12T11:12:48.039021",
  "title": "International Enterprise Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/International_Enterprise_Singapore"
}