{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:12:52.062614"
  },
  "content": "Historical building in Singapore **Inverturret**, also known as **7 Gallop Road**, is a historic bungalow in the Gallop Extension of the [Singapore Botanical Gardens](/wiki/Singapore_Botanical_Gardens). Previously the residence of the Air Officer Commanding the [Far East Air Force](/wiki/Far_East_Air_Force_(Royal_Air_Force)) and the residence of the French consul-general, the bungalow currently houses the Botanical Art Gallery. ## Description The building's exterior features wrap-around verandahs. The interior features a grand staircase and a floor made of [Carrara marble](/wiki/Carrara_marble). It also contains hand-blown Rondel-glass panels and bay windows. ## History The building was completed on Gallop Road in 1906. It was designed by prominent architect [Regent Alfred John Bidwell](/wiki/Regent_Alfred_John_Bidwell), who also designed the nearby [Atbara House](/wiki/Atbara_House). It was built by Charles MacArthur, then the chairman of the [Straits Trading Company](/wiki/Straits_Trading_Company), who had purchased the Atbara House in 1903. On 5 June 1937, [Arthur Tedder, 1st Baron Tedder](/wiki/Arthur_Tedder,_1st_Baron_Tedder), then the Air Officer Commanding the [Far East Air Force](/wiki/Far_East_Air_Force_(Royal_Air_Force)) moved into the bungalow from his former residence at the [Seletar Camp](/wiki/Seletar_Camp). By October 1938, [John Tremayne Babington](/wiki/John_Tremayne_Babington), then the Air Officer Commanding the Far East Air Force, and his wife had moved into the building. Beginning in 1939, the building served as the residence of the French ambassador in Singapore, with Atbara House housing the French embassy, with French consul-general Jacques Pingaud and his wife moving into the building by April of that year. In July 1999, the embassy moved to 101-103 Cluny Park Road. In 2015, it was announced that the house would be a part of the Gallop Extension of the Singapore Botanic Gardens. Both Inverturret and Atbara were gazetted for conservation by the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) in September of that year. In 2016, the [National Parks Board](/wiki/National_Parks_Board) awarded the tender of the Gallop Extension to Kay Ngee Tan Architects. The house, along with the rest of the extension, opened to the public on 13 March 2021. It now houses the Forest Botanical Art Gallery the \"first permanent display of botanical art\" in Singapore. The gallery displays over 2,000 pieces of watercolours and drawings from the archives of the gardens on rotation, with a different set of 100 artworks being placed on display at the gallery every six months. The restoration of both the Atbara House and Inverturret received the Urban Redevelopment Authority Architectural Heritage Awards in 2022. 1°18′52″N 103°48′36″E﻿ / ﻿1.31452°N 103.80998°E﻿ / 1.31452; 103.80998\n",
  "language": "en",
  "processed_at": "2026-01-12T11:12:52.062121",
  "title": "Inverturret",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Inverturret"
}