{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:16:36.640889"
  },
  "content": "Species of plant ***Ipomoea aquatica***, commonly known as **water spinach** or **kangkung**, is a semi-[aquatic](/wiki/Aquatic_plant), [tropical](/wiki/Tropical) plant grown as a [vegetable](/wiki/Vegetable) for its tender shoots. *I. aquatica* is generally believed to have been first domesticated in [Southeast Asia](/wiki/Southeast_Asia). It is widely cultivated in Southeast Asia, [East Asia](/wiki/East_Asia), and [South Asia](/wiki/South_Asia). It grows abundantly near waterways and requires little to no care. ## Description *Ipomoea aquatica* grows in water or on moist soil. Its stems are 2–3 metres (7–10 ft) or longer, rooting at the nodes. The hollow cavity within the stem makes the plant buoyant. The leaves vary from typically sagittate (arrowhead-shaped) to [lanceolate](/wiki/Lanceolate), 5–15 cm (2–6 in) long and 2–8 cm (0.8–3 in) broad. The flowers are trumpet-shaped, 3–5 cm (1–2 in) in diameter, and usually white in colour with a mauve centre. Propagation is either by planting cuttings of the stem shoots, which will root along nodes, or by planting the seeds from flowers that produce seed pods. ## Names *Ipomoea aquatica* is most widely known as kangkong (also spelled *kangkung*), its common name in [Maritime Southeast Asia](/wiki/Maritime_Southeast_Asia), which likely originates from either [Malay](/wiki/Malay_language) or one of the [languages of the Philippines](/wiki/Languages_of_the_Philippines). It is also known as water spinach, river spinach, water morning glory, water convolvulus, or by the more ambiguous names Chinese spinach, Chinese watercress, Chinese convolvulus or swamp cabbage. It is known as *kōngxīncài* (空心菜) in Mandarin, *ong choy* (蕹菜) in [Cantonese](/wiki/Cantonese) and in Hawaii, and *tung choi* (通菜) in modern Cantonese. ## Origin and distribution The origin of *Ipomoea aquatica* is not quite clear, but it is generally believed to be native to [Southeast Asia](/wiki/Southeast_Asia) and was first cultivated there. This is supported by phylogenetic studies, its ideal climatic conditions, and the number of native pathogens in the region (like *[Albugo](/wiki/Albugo)* spp.); as well as its predominant cultivation range, the prevalence in usage as food and traditional medicine, and the number of distinct native names in Southeast Asian languages and language families. Several sources have also cited China or India as the location of the plant's domestication. However, these claims have no supporting evidence other than the appearance of the plant's name in historical records. The first clear mention of *I. aquatica* in Chinese records is in the *[Nanfang Caomu Zhuang](/wiki/Nanfang_Caomu_Zhuang)* written by the Chinese botanist Ji Han (AD 263-307). Ji Han specifically identifies *I. aquatica* as being \"a strange vegetable of the south\" with a foreign origin brought over by \"western countries\". The claim for an Indian origin is based on the presence of the old name *kalamba* for the plant in [Sanskrit](/wiki/Sanskrit), presumed to be from around 200 BC, but this is putative. *Ipomoea aquatica* is also found in [Africa](/wiki/Africa), the southwestern [Pacific Islands](/wiki/Pacific_Islands), and northern [Australia](/wiki/Australia). However, in Africa and the Pacific Islands, the number of native common names isn't as varied as in Southeast Asia, and there are very few references to the local use of *I. aquatica* for any purpose. Similarly, in Australia, it does not have indigenous names at all and is entirely absent in the traditional diet of [Indigenous Australians](/wiki/Indigenous_Australians). These imply that *I. aquatica* weren't native to these regions and were likely introduced relatively late from tropical Asia. ## Composition ### Nutrition ## Safety ### Health risk Many of the waters where water spinach grows are fed by domestic or other waste. Pigs in southeast Asia are a natural reservoir for the parasite *[Fasciolopsis buski](/wiki/Fasciolopsis)*. Infections in the [Mekong](/wiki/Mekong) regions resulted from feeding on water spinach. Infections of *F. buski* in humans through water spinach can be anticipated. The infection can be prevented by proper preparation, such as frying or boiling. Contamination with [thermotolerant coliforms](/wiki/Coliform_bacteria) (ThC) or [protozoan parasites](/wiki/Protozoa) with fecal origin, are very likely when the water spinach is planted in wastewater fed urban systems. Water spinach has great potential as a purifier of aquatic habitats. It is an efficient accumulator of [cadmium](/wiki/Cadmium), [lead](/wiki/Lead), and [mercury](/wiki/Mercury_(element)). This characteristic can be dangerous if water spinach is planted for human or animal feed in polluted aquatic systems. Mercury in water spinach is composed mostly as [methylmercury](/wiki/Methylmercury) and has the highest potential of becoming a threat to human health. The edible parts of the plant have a lower [heavy metal](/wiki/Heavy_metals) concentration. The stems and bottom of the edible portion of the plant are higher in concentration and should be removed to minimize the heavy metal intake. ## Uses ### Culinary The vegetable is a common ingredient in East, South and Southeast Asian dishes, such as in [stir-fried water spinach](/wiki/Stir-fried_water_spinach). In [Singapore](/wiki/Singapore), [Indonesia](/wiki/Indonesia), and [Malaysia](/wiki/Malaysia), the tender shoots along with the leaves are usually [stir-fried](/wiki/Stir_frying) with [chili pepper](/wiki/Chili_pepper), [garlic](/wiki/Garlic), [ginger](/wiki/Ginger), dried [shrimp paste](/wiki/Shrimp_paste) (*[belacan](/wiki/Belacan)*/*[terasi](/wiki/Terasi)*) and other [spices](/wiki/Spice). In [Penang](/wiki/Penang) and [Ipoh](/wiki/Ipoh), it is cooked with [cuttlefish](/wiki/Cuttlefish) and a sweet and spicy sauce. Also known as *eng chhai* in the Hokkien dialect, it can also be boiled with preserved cuttlefish, then rinsed and mixed with spicy *rojak* paste to become *jiu hu eng chhai*. Boiled *eng chhai* also can be served with fermented krill noodles – *belacan bihun* – and prawn mi. In [Burmese cuisine](/wiki/Burmese_cuisine), water spinach is the primary ingredient in a [Burmese salad](/wiki/Burmese_salads) called *gazun ywet thoke* (ကန်စွန်းရွက်သုပ်), made with blanched water spinach, lime juice, fried garlic and garlic oil, roasted [rice flour](/wiki/Rice_flour) and dried shrimp. In [Indonesian cuisine](/wiki/Indonesian_cuisine) it is called *kangkung*; boiled or blanched together with other vegetables it forms the ingredient of *[gado-gado](/wiki/Gado-gado)* or *[pecel](/wiki/Pecel)* salads in [peanut sauce](/wiki/Peanut_sauce). Some recipes that use **kangkung** include *[plecing kangkung](/wiki/Plecing_kangkung)* from Lombok, *[mie kangkung](/wiki/Mie_kangkung)* (kangkong noodles) from Jakarta, and *petis kangkung* from Semarang. In [Thailand](/wiki/Cuisine_of_Thailand), where it is called *phak bung* (Thai: ผักบุ้ง), it is eaten raw, often along with [green papaya salad](/wiki/Som_tam) or *[nam phrik](/wiki/Nam_phrik)*, in stir-fries and in curries such as *[kaeng som](/wiki/Kaeng_som)*. In the [Philippines](/wiki/Philippines), where it is called *kangkóng*, the tender shoots are cut into segments and cooked, together with the leaves, in fish and meat stews, such as *[sinigang](/wiki/Sinigang)*. The vegetable is also commonly eaten alone. In *[adobong kangkóng](/wiki/Philippine_adobo)* (also called *apan-apan*), it is sautéed in cooking oil, [onions](/wiki/Onion), garlic, [vinegar](/wiki/Vinegar), and [soy sauce](/wiki/Soy_sauce). In *ensaladang kangkóng* (or *kinilaw na kangkóng*), it is blanched and served in vinegar or [calamansi](/wiki/Calamansi) juice and fresh [tomatoes](/wiki/Tomato) and [onions](/wiki/Onion) with salt and pepper to taste. In *binagoongang kangkóng* (or *ginisang kangkóng*), it is sautéed with garlic and topped with *[bagoong alamang](/wiki/Bagoong_alamang)* (shrimp paste) or *[bagoong isda](/wiki/Bagoong_isda)* (fermented fish) and sliced fresh tomatoes and onions, commonly also with cubed crispy *liempo* ([pork belly](/wiki/Pork_belly)) or [pork *adobo*](/wiki/Philippine_adobo). It can also be spiced with *[siling haba](/wiki/Siling_haba)* or *[siling labuyo](/wiki/Siling_labuyo)* peppers, soy sauce, black pepper, and sugar. It differs from *adobong kangkóng* in that it does not use vinegar. A local appetiser called [crispy *kangkóng*](/wiki/Crispy_kangkong) has the leaves coated in a flour-based batter and fried until crisp, similar to [Japanese](/wiki/Cuisine_of_Japan) vegetable [tempura](/wiki/Tempura). In [Chinese cuisine](/wiki/Chinese_cuisine), *Ipomoea aquatica* is a popular leafy vegetable commonly stir-fried with garlic, fermented tofu, or chili, depending on regional preferences. It is particularly associated with [southern China](/wiki/Southern_China), including [Guangdong](/wiki/Guangdong) and [Fujian](/wiki/Fujian), where it is often prepared as a quick, flavorful dish. In [Sichuan](/wiki/Sichuan) cuisine, it may be stir-fried with pickled chili for a spicy twist. In [Taiwan](/wiki/Taiwan), it is cooked similar to Southeast Asia, with soy sauce and dried shrimp for added umami. ### Phytoremediation Using aquatic macrophytes to remove nutrients from wastewater and to control freshwater [eutrophication](/wiki/Eutrophication) has been reported to be a feasible way of [phytoremediation](/wiki/Phytoremediation). Various plants, including *I. aquatica*, have been tested for this use. Owing to its being edible and thus marketable, it could be an attractive option for this use. ### Animal feed Water spinach is fed to livestock as green fodder with high nutritive value—especially the leaves, for they are a good source of carotene. It is fed to cattle, pigs, fish, ducks, and chicken. In limited quantities, *I. aquatica* can have a somewhat laxative effect. ### Medicinal This section **needs more reliable medical references for verification or relies too heavily on primary sources**. Please review the contents of the section and add the appropriate references if you can. Unsourced or poorly sourced material may be challenged and removed. *Find sources:* \"Ipomoea aquatica\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(February 2025)* *I. aquatica* is used in the traditional medicine of southeast Asia and in the traditional medicine of some countries in Africa.[*citation needed*] In southeast Asian medicine it is used against [piles](/wiki/Piles), and [nosebleeds](/wiki/Nosebleeds), as an [anthelmintic](/wiki/Anthelmintic), and to treat [high blood pressure](/wiki/High_blood_pressure).[*medical citation needed*] In Ayurveda, leaf extracts are used against jaundice and nervous debility. In indigenous medicine in Sri Lanka, water spinach is supposed to have insulin-like properties.[*medical citation needed*] Christophe Wiart cites several promising studies showing improvements in blood glucose levels in humans and rats and concludes that clinical trials are warranted. Antioxidant bioactive compounds and anti-microbial substances can be detected in water spinach.[*non-primary source needed*] Furthermore, plant extracts of water spinach inhibit cancer cell growth of Vero, Hep-2, and A-549 cells, though they have moderate anti-cancer properties.[*non-primary source needed*] ## Cultivation *Ipomoea aquatica* is most commonly grown in east, south, and southeast Asia. It flourishes naturally in waterways, and requires little if any care. It is used extensively in Indonesian, Burmese, Thai, Lao, Cambodian, Malay, Vietnamese, Filipino, and Chinese cuisine, especially in rural or *[kampung](/wiki/Kampung)* (village) areas. The vegetable is also extremely popular in [Taiwan](/wiki/Taiwan), where it grows well. During the [Japanese occupation of Singapore](/wiki/Japanese_occupation_of_Singapore) in World War II, the vegetable grew remarkably easily in many areas, and became a popular wartime crop. Water spinach has been found to be cultivated in the following countries: - [Australia](/wiki/Australia) - [Bangladesh](/wiki/Bangladesh) - [Burma](/wiki/Myanmar) - [Cambodia](/wiki/Cambodia) - [China](/wiki/China) - [Fiji](/wiki/Fiji) - [India](/wiki/India) - [Maldives](/wiki/Maldives) - [Indonesia](/wiki/Indonesia) - [Japan](/wiki/Japan) - [Malaysia](/wiki/Malaysia) - [Nepal](/wiki/Nepal) - [New Guinea](/wiki/New_Guinea) - [Philippines](/wiki/Philippines) - [Sri Lanka](/wiki/Lanka) - [Taiwan](/wiki/Taiwan) - [Thailand](/wiki/Thailand) - [Vietnam](/wiki/Vietnam) In the United States, it is cultivated in California, Florida, Hawaii, Texas, Arizona, and the U.S. Virgin Islands. It is also found in Africa and in its wild form; it is collected and used by the [Sambaa](/wiki/Shambaa_people) people in [Tanzania](/wiki/Tanzania). Water spinach is also potentially suitable for cultivation in [greenhouses](/wiki/Greenhouse) in more [temperate](/wiki/Temperate_climate) regions. In non-tropical areas, it is easily grown in containers given enough water in a bright sunny location. It readily roots from cuttings.[*citation needed*] ### Requirements for climate and soil Water spinach is ideal for [sub](/wiki/Subtropics)-tropical and [tropical](/wiki/Tropics) climate, as it does not grow well below 23.9 °C (75.0 °F) and is sensitive to frost. High soil moisture is beneficial for growth. Clay soils and [marshy](/wiki/Marsh) soils rich in organic matter are suitable for water spinach. The ideal pH range for the growth is from 5 to 7. The provision of shade has been shown to have a positive influence on the yield of water spinach. ### Traditional cultivation methods Water spinach is cultivated in a variety of systems. In [Hong Kong](/wiki/Hong_Kong), two methods are traditionally used: the dryland method and the wetland method. In **the dryland method**, water spinach is grown on raised beds which are separated by irrigation ditches. The seeds can be sown directly onto the beds. Alternatively, a nursery may be used and the seedlings are transplanted when they reach a sufficient size. In either case, the distance between the plants should be about 12 centimetres (4.7 in) by the time they are 15 centimetres (5.9 in) tall. Regular irrigation is crucial in the dryland system and so is sufficient fertilization. Water spinach cultivated with the dryland method is ready for harvest 50 to 60 days after sowing. Harvesting is done by pulling up the whole plant. The **wetland method** is the traditionally more common and important method for cultivation in Hong Kong: In the wetland method, water spinach is cultivated on flat fields surrounded by raised banks, which have oftentimes been used as [rice paddies](/wiki/Paddy_field) in the past. These former rice paddies have a heavy clay soil with an iron-pan. This helps to retain water for the water spinach. The seedlings to be used in this method are usually grown in a nursery on a dry field, as germination under water is quite poor. Six weeks after sowing, cuttings can be taken from the seedlings for transplantation. One cutting is an approximately 30 centimetres (12 in) long cut from the stem containing seven or eight nodes. This is then planted in the field with a spacing of about 40 centimetres (16 in). The field is prepared beforehand by flooding it to a depth of 3 to 5 centimetres (1.2 to 2.0 in). The soil itself is tramped into a liquid mud so that the cuttings can root easily. Once the plants are established, the depth of the flooding is increased to 15 to 20 centimetres (5.9 to 7.9 in). The first harvest in the wetland method can usually be done at around 30 days after transplantation. Also, the harvesting differs from the dryland system: In the wetland, the upper part of the main shoot is cut at about water level. This stimulates lateral growth and produces horizontal shoots carrying vertical branches. After the first harvests, every seven to ten days throughout the summer, these vertical branches can be harvested. After the planting period, the fields are drained and once the fruit of the water spinach is ripe, it is harvested, dried, then trodden to release the seeds which are to be used for the following season. ### Use of fertilizer How much fertilizer is used for the cultivation strongly depends on the region. Most research is from the 1980s and 1990s. Generally, it has been shown that a dose of 60 kilograms (130 lb) [N](/wiki/Nitrogen)/ha is sufficient and that the application of [K](/wiki/Potassium) can be beneficial on the yield. Also, the application of plant growth regulators, for example [Adenine](/wiki/Adenine) and Zetanine,[*clarification needed*] has been found to be an effective means to promote water spinach growth. One study has determined, that the highest yields are produced with the application of 60 kg/ha of N, 90 kg/ha of [P2O5](/wiki/Phosphorus_pentoxide) and 50 kg/ha of [K2O](/wiki/Potassium_oxide) for the first harvest. For the second harvest the optimal fertilization was determined as 120 kg/ha of N, 45 kg/ha of P2O5 and 100 kg/ha of K2O. **Taiwan**: In Taiwan, the usual fertilization includes the basic application of about 10 t/ha of cow manure followed by 50 kg/ha of [ammonium sulfate](/wiki/Ammonium_sulfate) after each harvest. **Bangkok**: In Bangkok, it is common to apply about 300 kg/ha of NPK fertilizer twice a month. **Indonesia**: In Indonesia, usually 150 kg to 300 kg of NPK are applied per hectare. ### Pathogens and pests There are several pathogens and pests reported, affecting *I. aquatica*. Pathogens include *[Pythium](/wiki/Pythium)*, causing problems like damping-off, *[Cercospora](/wiki/Cercospora)* leaf spot and root nematodes. Also, [aphids](/wiki/Aphid) may be problems in fields. Additionally, there are several [polyphagous](/wiki/List_of_feeding_behaviours) insects feeding on *I. aquatica*. [Lepidoptera](/wiki/Lepidoptera) species include *Diacrisia strigatula* Walker and *Spodoptera litura*. The \"woolly-bear\" caterpillars (*D. virginica* [Fabricius]) of the eastern United States and *D. strigatula* (Chinese tiger moth) are other species with wide food preferences. A specialist pathogen on *I. aquatica* is the [oomycete](/wiki/Oomycete) *Albugo ipomoeae-aquaticae*, though its range is restricted to southern and southeast Asia. ### Invasiveness *Ipomoea aquatica* is listed by the [USDA](/wiki/USDA) as a noxious weed, especially in the states of [Florida](/wiki/Florida), [California](/wiki/California), and [Hawaii](/wiki/Hawaii), where it can be observed growing in the wild. In the US, water spinach has mainly become a problem in Florida. It is unclear why it is a problem there; however, although the fast growth rate has been cited as a threat to native plants in certain areas of Florida. It could be owing to the time since introduction, or owing to climatic factors. *I. aquatica* has been extensively cultivated in [Texas](/wiki/Texas) for over 30 years, having been originally brought there by Asian immigrants. Because no evidence indicates the plant has escaped into the wild, Texas lifted its ban on cultivation for personal use with no restrictions or requirements, noting its importance as a vegetable in many cultures, and also began permitting cultivation for commercial sales with the requirement of an exotic species permit. Possession of *I. aquatica* has been prohibited in Florida since 1973, but it is still being grown and sold illegally. Some of the infestations in Florida public lakes have been eradicated, or at least attempts have been made. In [Sri Lanka](/wiki/Sri_Lanka) it invades wetlands, where its long, floating stems form dense mats which can block the flow of water and prevent the passage of boats. ## Gallery - [Stir-fried water spinach](/wiki/Stir-fried_water_spinach) - [List of vegetables](/wiki/List_of_vegetables) - [Sweet potato](/wiki/Sweet_potato) (*Ipomoea batatas*), another edible species in the morning glory family - Germplasm Resources Information Network: *Ipomoea aquatica* - \" Multilingual taxonomic information\". [University of Melbourne](/wiki/University_of_Melbourne). - Water spinach nutritional information from [Kasetsart University](/wiki/Kasetsart_University) - Center for Aquatic, Wetland and Invasive Plants Archived 18 August 2019 at the [Wayback Machine](/wiki/Wayback_Machine), University of Florida - USDA Federal Noxious Weed Regulations (Possession in USA requires permit) - Species Profile - Water Spinach (*Ipomoea aquatica*), National Invasive Species Information Center, [United States National Agricultural Library](/wiki/United_States_National_Agricultural_Library). Lists general information and resources for water spinach. - *Ipomoea aquatica* in West African plants – A Photo Guide.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:16:36.640422",
  "title": "Ipomoea aquatica",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Kangkung_(vegetable)"
}