{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:12:54.090869"
  },
  "content": "Religion in SingaporereligionpercentBuddhism31.1%No religion20.0%Christianity18.9%Islam15.6%Taoism8.8%Hinduism5.0%Sikhism or Others0.6% As of 2020, 20% of Singaporeans have **no religious affiliation**. The rate of irreligion is different among ethnic groups of [Singapore](/wiki/Singapore): about 26% of [Chinese residents](/wiki/Chinese_Singaporeans) have no religion, compared to just 0.4% of [Malay residents](/wiki/Malay_Singaporeans) and 2.2% of [Indian residents](/wiki/Indian_Singaporeans). Age is also an important factor, as around 24% of people aged 15 to 24 indicated they had no religious connection, compared to 15% of residents aged 55 and over in the last census. Singapore's non-religious tend to be [atheists](/wiki/Atheism), [agnostics](/wiki/Agnosticism), [humanists](/wiki/Humanism), [theists](/wiki/Theism), [deists](/wiki/Deism) or [skeptics](/wiki/Skeptics). Some locals affiliate with no religion, but will still continue practice traditional rituals like ancestral worship, which they do not necessarily regard as religious in essence. The number of non-religious people in Singapore has risen slightly. Census reports show that those who said they have no religion rose from 13% in 1980 to 20% in 2020. In recent years, social gatherings of non-religious people have become more popular in Singapore. Since 2005, informal atheist groups had organised social gatherings to discuss religion and secularism, and popular books on the topic from authors such as [Richard Dawkins](/wiki/Richard_Dawkins) and [Christopher Hitchens](/wiki/Christopher_Hitchens). One of the earliest groups was called the *Atheist Haven*, and was formed by three Singaporeans in 2004. ## Humanist Society of Singapore In 2008, the Singapore Humanism Meetup was formed as a social network of secular humanists, atheists and agnostics. In October 2010, the [Humanist Society (Singapore)](/wiki/Humanist_Society_(Singapore)) became the first humanist group to be gazetted as a society. Many pioneer members of the society met at gatherings organised by the Singapore Humanism Meetup. ## Affiliation Non-religious groups in Singapore are also linked to other non-religious networks in [Southeast Asia](/wiki/Southeast_Asia). The Singapore Humanism Meetup, Singaporean Atheists and Humanist Society (Singapore) are listed on the Southeast Asian Atheists website. - Singapore portal - [Religion in Singapore](/wiki/Religion_in_Singapore) - [Article 15 of the Constitution of Singapore](/wiki/Article_15_of_the_Constitution_of_Singapore) - [Freedom of religion in Singapore](/wiki/Freedom_of_religion_in_Singapore) - [Singaporean Chinese religion](/wiki/Singaporean_Chinese_religion) - [Chinese ancestral veneration](/wiki/Chinese_ancestral_veneration) - [Humanism](/wiki/Humanism) - Humanist Society (Singapore) - Singapore Atheists - Singapore Humanism Meetup\n",
  "language": "en",
  "processed_at": "2026-01-12T11:12:54.090363",
  "title": "Irreligion in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Irreligion_in_Singapore"
}