{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:13:04.143431"
  },
  "content": "Palace in Singapore, Singapore **Istana Tyersall** was a palace that used to be in the former [Tyersall Park](/wiki/Tyersall_Park) bound by Holland Road and Tyersall Road near the [Singapore Botanic Gardens](/wiki/Singapore_Botanic_Gardens) in Singapore. The land it was formerly built on is currently restricted from the public. Demolished in 1935, it had long been confused with the dilapidated [Istana Woodneuk](/wiki/Istana_Woodneuk) due to its proximity, which was located on another smaller hill not far away. The difference with the roof tiles of these former palaces is that while **Woodneuk** was blue, **Tyersall** was red. ## History [William \"Royal Billy\" Napier](/wiki/William_Napier_(lawyer)), the former [Lieutenant-Governor of Labuan](/wiki/Lieutenant-Governor_of_Labuan) and first lawyer in Singapore, once had a house built in 1854 at the [Tyersall](/wiki/Tyersall,_Singapore) estate of 67 acres in Singapore. Upon his retirement and departure back to England in 1857, his house at Tyersall was put on sale by [Boustead & Co.](/wiki/Boustead_%26_Co.) in March 1857 and would later be bought over by [Wan Abu Bakar](/wiki/Abu_Bakar_of_Johor) in 1860. Abu Bakar would later move his residence there from [Telok Blangah](/wiki/Telok_Blangah) upon his reign as [Temenggong of Johor](/wiki/Temenggong_of_Johor) after the death of his father [Temenggong Daeng Ibrahim](/wiki/Temenggong_Daeng_Ibrahim) in 1862. Temenggong Abu Bakar was proclaimed as the [Maharaja](/wiki/Maharaja) of Johor on 30 June 1868, and was eventually proclaimed as the 21st [Sultan of Johor](/wiki/Sultan_of_Johor) on 13 February 1886. Later on, he decided that it was time to build a new palace in Singapore to commemorate his ascension. In 1890, Sultan Abu Bakar had Napier's former house demolished to make way for his upcoming palace. ## Architecture [Dato](/wiki/Datuk) Yahaya Awaluddin, an architect and a member of the Sultan Abu Bakar's Cabinet was deployed to design the plans according to the wishes of the Sultan's 3rd wife Sultanah Fatimah. Sultanah Fatimah was a Chinese woman of [Cantonese](/wiki/Cantonese) heritage whose name was Wong Ah Gew before she married Sultan Abu Bakar. The Sultan employed the service of his long-time acquaintance [Wong Ah Fook](/wiki/Wong_Ah_Fook), a Chinese contractor to oversee the building of the palace. Wong had already built many of Johor's heritage buildings prior to his work assignment in Singapore and was a close friend to Sultanah Fatimah who shared the same common surname and dialect. Howarth Erskine carried out most of the ironwork, with some portions of the work done by H.C. Hogan, and the upholstering of furniture and equipments was provided by [John Little & Co.](/wiki/John_Little_%26_Co.) Sultana Fatimah did not live to see the completion of the palace as she had died on 25 February 1891. According to [Singapore Free Press](/wiki/Singapore_Free_Press), they noted that: \"The rectangular building measured 210 feet long by 174 feet deep, was in the \"Corinthian style of architecture\" with a red tiled roof and a seventy-feet high tower in the center topped by the Sultan's symbolic star and crescent.\" \"Among its key features were a spacious projected carriage porch, a grand staircase with ornamental iron balustrades, a grand reception room, a ball room, a billiard room – and it was fitted with electric light. The installation of electricity was hailed by the Free Press as indicative of an improvement of \"domestic civilization, and a marked step in the industrial progress of the Colony.\" Interior-wise, the fanlights were Arabsque in design, the wood used was teak and ironwood and the building had altogether 420 doors.\" ## Opening The palace was officially declared opened on 3 December 1892 by the 13th [Governor of the Straits Settlements](/wiki/Governor_of_the_Straits_Settlements) Sir [Cecil Clementi Smith](/wiki/Cecil_Clementi_Smith) accompanied by Lady Teresa Newcomen, with the Sultan addressed in English and Malay in the ballroom attended by the selected company of power brokers of Singapore and Johor officials with the [Sultan of Pahang](/wiki/Sultan_of_Pahang) [Ahmad Muazzam Shah](/wiki/Ahmad_al-Muadzam_Shah_of_Pahang) and [Sultan of Riau](/wiki/Sultan_of_Riau) Abdul Rahman II Muazzam Shah among them. The palace was known to be first building in Singapore to be supplied with electricity. ## Historic events As well as the Sultan of Johor's official residence in Singapore, the palace was also a venue to several historic events and parties. On 10 December 1892 at the palace, the Sultan received the First Class of the First Grade of the [Order of the Double Dragon](/wiki/Order_of_the_Double_Dragon) by the [Guangxu Emperor](/wiki/Guangxu_Emperor), as conveyed by the consul general in Singapore of his care, sympathy and kindness for permitting the Chinese to settle in Johor. The presentation event was witnessed by a gathering of Chinese towkays (businessmen). On 6 April 1893, the Sultan held his reception to the [Archduke Franz Ferdinand of Austria](/wiki/Archduke_Franz_Ferdinand_of_Austria) and his party who arrived at the palace in the evening at 5.30 pm. The Archduke and Prince Franz Ferdinand and his party was shown various rooms and items of the palace, before proceeding on the Sultan's carriages towards the direction of [Tanjong Pagar](/wiki/Tanjong_Pagar). On 24 February 1894, the Sultan held a dinner reception with the 14th governor of the Straits Settlements Sir [Charles Mitchell](/wiki/Charles_Mitchell_(colonial_administrator)), attended by about eighty guests. On 14 January 1895 in the evening, the Sultan's Ball was held at the palace's ballroom, attended by Governor Sir Charles Mitchell and his wife Lady Eliza Weldon, several military and government officials. The Sultan's son Tunku Mahkota [Ibrahim Al-Marhum](/wiki/Ibrahim_of_Johor), his eventual successor, was there as well. There were also Europeans, Chinese and Arabs guests, and including several Johor nobles. On 9 March 1895, the Sultan held a luncheon gathering party in honour of his old friend [Thomas Shelford](/wiki/Thomas_Shelford), who would be leaving Singapore for England, the gathering were consisted of principal residents of Singapore and their wives, and some of the Johor officials and residents. On 15 April 1895, the Sultan held his last reception at the palace in the late afternoon attended by hundreds of guests, among them were the former [Sultan of Perak](/wiki/Sultan_of_Perak) [Abdullah Muhammad Shah II](/wiki/Abdullah_Muhammad_Shah_II_of_Perak), and representatives of the consular, military and civil societies. before embarking on the [mail steamer](/wiki/Mail_steamer) *Pekin* bound for Europe on 23 April 1895. Sultan Abu Bakar died of [pneumonia](/wiki/Pneumonia) in [South Kensington](/wiki/South_Kensington), London, on 4 June 1895, it was at the palace that his son Tunku Ibrahim Al-Marhum received the telegram from Dato Sri Amar DiRaja [Abdul Rahman Andak](/wiki/Abdul_Rahman_Andak) on the same day that informed of his father's death.[*citation needed*] [Tyersall](/wiki/Tyersall,_Singapore) and its premises was handled over to his son upon his reign as the Sultan Ibrahim of Johor on 2 November 1895. The new Sultan however, would preferred to stay at the [Woodneuk House](/wiki/Woodneuk_House), previously renamed as the Istana Woodneuk, of the nearby hill upon his arrival in Singapore.[*citation needed*] On 3 August 1896, Ungku Maimunah, the 1st Sultana to Sultan Ibrahim of Johor, and the Sultan's family held their reception to the [King of Siam](/wiki/King_of_Siam) [Rama V](/wiki/Rama_V) and his Queen [Savang Vadhana](/wiki/Savang_Vadhana) at the palace. On 9 December 1896, Spanish Consul to the Straits Settlements Guillermo Leyra and his officers paid a private visit to the Sultan of Johor in his palace. On 11 January 1897, the Sultan held a luncheon party in honour of the former and 1st Postmaster-General of the Straits Settlements Henry Trotter, before his retirement to England. His son Noel Trotter had since taken over his duties. After the Farewell [Gymkhara](/wiki/Gymkhana_(equestrian)) with 4th [King's Own Regiment](/wiki/King%27s_Own_Royal_Regiment_(Lancaster)) on 17 February 1900 at Tyersall, the Sultan held the farewell luncheon party at the palace on 21 February, with over 60 guests which included officers of the King's Own Regiment and the [16th Madras Native Infantry](/wiki/76th_Punjabis) and the rest of the Garrison, and also the representatives of the official, commercial and sports. On 24 September 1902, the Sultan Ball was held by the Sultan in connections to the celebrations of his 29th birthday anniversary at the palace, attended by four hundred invited guests. The last noted reception at the palace was held by Sultana Maimunah on 28 April 1904 in the afternoon attended by Datos, Johor Government officials and a crowd of residents in honour of four Johor princes (Sultan's sons) and other four sons of the Malay high officials, before they were sent off from Tyersall on automobiles at 6.30 pm to the P & O Wharf at [Keppel Harbour](/wiki/Keppel_Harbour) to board the steamer *SS Bengal*, which left on the morning of the following day bound for England, where they would attend school there. ## Serious fire at the palace On 10 September 1905, a fire broke out at Istana Tyersall at midnight, and there were no occupants at the palace. One of the servants at the premises spotted the fire at about 2 am on 11 September 1905 and telephoned the fire brigade. By 2.45 to 3.00 am, the alarm was sounded and three fire engines from the [Singapore Fire Brigade](/wiki/Singapore_Fire_Brigade) was deployed to the site, about 500 [Sherwood Foresters](/wiki/Sherwood_Foresters) soldiers who were stationed nearby rushed to help put out the fire. The fire was extinguished by 6.00 am, which saw the palace's ballroom and billiard room \"hopelessly wrecked\", several furniture and art collections were badly burnt. The cause of the fire was reported to be a faulty wiring which ignited the hall's floor which was coated with \"inflammable paint\". Damage cost was estimated for up to [S](/wiki/Straits_dollar)$200,000. The palace was abandoned soon after. ## Failed proposal of Tyersall Country Club On 30 November 1910, the meeting was held at the Straits Chinese Recreation Club's pavilion clubhouse in [Hong Lim Green](/wiki/Hong_Lim_Green), Singapore, announced that the Sultan was willing to lease the premises and the ground for 21 years at the rental of S$150 per month for the first 7 years, S$250 per month for the next 7 years, and S$350 per month for the last 7 years, all which have been approved by the committee and members of the club. On 7 December 1910, the Tyersall Country Club was formed at the meeting attended by the members of the various clubs of Singapore and chaired by the 16th Governor of the Straits Settlements Sir [John Anderson](/wiki/John_Anderson_(colonial_administrator)), at the abandoned Istana Tyersall with the purpose to set up a first general social club in Singapore. The club, according to Sir John Anderson, would \"supply the real want\" due to Singapore being the \"only town of the great size without the general social club\". The Club proposed the plans to become the lessees of Tyersall Palace (Istana Tyersall), to determine the issue of debentures and other matters, which included the dividing of its halls and apartments, the rebuilding of its ballroom, the erection of the new buildings nearby with the capital expenditure of S$65,000 on 21 February 1911 and later the estimated capital expenditure S$72,300 on 3 October 1911. However the scheme was reported to have fallen through during the meeting at [Tanglin Club](/wiki/Tanglin_Club) in early 1912. ## Demolition By 1930, the palace was in the state of dilapidation. On 16 December 1932, a second fire incident occurred at the palace's tower which was put out in a few minutes by two fire engines. On another hill not far away, a new palace [Istana Woodneuk](/wiki/Istana_Woodneuk), or Istana Wooden York to the [State of Johor](/wiki/State_of_Johor), was rebuilt on its former site in 1932 and completed in September 1935 as the replacement for the Sultan Ibrahim and his 3rd wife [Sultanah Helen](/wiki/Sultanah_Helen). The dilapidated Istana Tyersall was reportedly demolished under the tender issued from the Sultan in 1935. The site that was once the location of demolished Istana Tyersall, including its surrounding grounds, had since allowed by the Sultan to be used by the [Indian Army](/wiki/British_Indian_Army) to be stationed and converted as a military camp area in 1939. - [Istana Woodneuk](/wiki/Istana_Woodneuk) - [Tyersall Park](/wiki/Tyersall_Park) - [Abu Bakar of Johor](/wiki/Abu_Bakar_of_Johor) - [Ibrahim of Johor](/wiki/Ibrahim_of_Johor) - [Wong Ah Fook](/wiki/Wong_Ah_Fook)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:13:04.142961",
  "title": "Istana Tyersall",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Istana_Tyersall"
}