{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:13:02.240595"
  },
  "content": "Park in Singapore The **Istana Park** is a park in the [Civic District](/wiki/Civic_District) of Singapore. Bounded by Buyong Road, Penang Road, [Orchard Road](/wiki/Orchard_Road), and Penang Lane, Istana Park is opposite [the Istana](/wiki/The_Istana), which is the namesake of the park. The park has two buildings: My Art Space, a studio-cafe, and the Istana Heritage Gallery, a gallery focusing on the Istana's history. The Istana Park was conceptualised in February 1992 as a more prominent entrance for the Istana and the Civic District; construction began in January 1994. The park was officially opened on 6 September 1996, although it had been open to the public since December 1995; in 1998, it was added to the Civic District Heritage Trail. My Art Space and the Istana Heritage Gallery opened in March 2014 and October 2017. Current redevelopment plans for the park, including expanding the park and integrating it better with the Istana's entrance, form part of the plans to revitalise Orchard Road. The Festival Arch serves as the centrepiece of the park and the gateway to Orchard Road. At the arch's base is a [reflecting pool](/wiki/Reflecting_pool), accompanied by three rows of tall and dwarf coconut palm trees, two of which are dwarfs planted within pools to give the illusion that they are growing out of the water. The park's facilities and plants are illuminated as part of a plan to light up the Civic District. ## History On 20 February 1992, plans detailing a landscaped park for the [Civic District](/wiki/Civic_District) in Singapore to serve as its entrance were unveiled at an exhibit in [Marina Square](/wiki/Marina_Square); The [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) (URA) chose [the Istana](/wiki/The_Istana)'s front area for this purpose as they felt it would make the entrance more prominent. Two proposals were considered, but the preferred design consisted of a semicircular concept, with the centre containing a [water feature](/wiki/Water_feature) and [shrubs](/wiki/Shrubs) of the national colours planted around the park. Ren Matsui Landscape Design conceptualised the final plan of the park, which was expected to cost [S$](/wiki/Singapore_dollar)13 million (1993) ([US$](/wiki/USD)8.05 million), and was unveiled by the [Parks and Recreation Department](/wiki/NParks) (PRD) on 12 November 1993, with construction supervision from Ren Matsui and the [Public Works Department](/wiki/Public_Works_Department_(Singapore)) providing architectural and engineering services. Construction of the Istana Park began in January 1994, with expected completion at the end of 1995. In June 1995, National Development Minister [Lim Hng Kiang](/wiki/Lim_Hng_Kiang) announced that Istana Park, along with other landmarks in the Civic District, would be lit up with lights by 2000 as part of a [S$](/wiki/Singapore_dollar)10.6 million (1995) ([US$](/wiki/USD)7.48 million) plan to make the Civic District a \"world-class civic and cultural hub\". As part of construction works for the Istana Park, a section of Clemenceau Avenue between [Orchard Road](/wiki/Orchard_Road) and Penang Road was announced on 15 June to be permanently closed from 18 June onwards. By July, there was work on an [underpass](/wiki/Underpass) between the park and [Plaza Singapura](/wiki/Plaza_Singapura). By November, it was announced that the park would open in 1996. Even though it had been open since December 1995, Lim Hng Kiang officially opened the park on 6 September 1996, with the lighting plan effectuated by January 1997. In December 1998, the park was included in the [National Heritage Board](/wiki/National_Heritage_Board_(Singapore))'s Civic District [Heritage Trail](/wiki/Heritage_trail). In March 2008, My Art Space, a studio-cafe, opened in the park. On 7 October 2017, the Istana Heritage Gallery was officially opened by President [Tony Tan](/wiki/Tony_Tan). In January 2019, it was announced that there were proposed plans for Istana Park to be revitalised, as part of the government's plans to improve the Orchard Road area. Among the proposed plans included adding [horticultural history](/wiki/Horticulture#History)-themed gardens, and connecting the Istana Park to [Dhoby Ghaut Green](/wiki/Dhoby_Ghaut_Green) and the open space at Plaza Singapura. A new proposed plan for the park based on public feedback was unveiled in February 2020, which included a connection between Istana Park and other areas, along with a three times expansion of its size by including Dhoby Ghaut Green and Penang Road Open Space in its redesign. There were also plans to pedestrianise a section of Orchard Road so that it would be better integrated with the Istana's entrance. In September 2022, it was announced that works for the plan would begin in 2025, with a [tender](/wiki/Invitation_to_tender) called by the [National Parks Board](/wiki/National_Parks_Board) in August 2022 for consultancy services of the plan. ## Details Located in the [Civic District](/wiki/Civic_District), the 1.3 hectares (3.2 acres) park is bounded by Penang Road, Buyong Road, [Orchard Road](/wiki/Orchard_Road), and Penang Lane. Istana Park is opposite [the Istana](/wiki/The_Istana), which is the namesake of the park, *Istana* meaning *palace* in [Malay](/wiki/Malay_language). The park serves as the gateway for the Civic District and is designed, according to a PRD architect, \"to evoke a feeling of formality and grandeur\". A feature of the park is the 26 metres (85 ft) long, four-storey tall stainless steel and concrete Festival Arch as the focal point of the park. The design of the arch, by Ren Matsui, is based on the Istana entrance's fence. The Festival Arch symbolises the gateway to Orchard Road and is decorated with banners and flags in August to celebrate the [National Day](/wiki/National_Day_(Singapore)) of Singapore. At the arch's base is the [reflecting pool](/wiki/Reflecting_pool), which is about 40 centimetres (16 in) deep and produces a reflection of the Festival Arch in the pool. There are also three rows of 120 tall and dwarf coconut trees, with two of the rows containing dwarf coconut trees planted within specially-designed plots in eight small, shallow pools, to make it \"look as if the trees are growing in the water\", according to PRD Commissioner Chua Sian Eng. While large coconut trees were present in other parks, the ones at Istana Park were reportedly the first the PRD deliberately planted in [Downtown Singapore](/wiki/Downtown_Singapore). In order to create the illusion, the plants were grown in a small space in a [plant nursery](/wiki/Plant_nursery). As of the park's opening, it had 151 species of plants, such as the [tree fern](/wiki/Tree_fern), [elephant fern](/wiki/Angiopteris_evecta), five [foxtail palm trees](/wiki/Wodyetia), and [variegated giant reeds](/wiki/Arundo_donax). The plants were sourced from Indonesia, Malaysia, and other nearby countries as well as [Queensland](/wiki/Queensland), Australia, for the foxtail palm trees. As part of the lighting plan for the Civic District, the Festival Arch and some of the plants are illuminated at night. There are several buildings within the park, such as the My Art Space, a studio-cafe that hosts art classes. There is also the Istana Heritage Gallery, which aims to educate visitors on the history, interior, and modern-day role of the Istana, as well as make the Istana more accessible to the general public. Curated by the [National Heritage Board](/wiki/National_Heritage_Board_(Singapore))'s Preservation of Sites and Monuments division, there are six sections in the gallery with over 1,500 state gifts in the Istana's collection. - [List of parks in Singapore](/wiki/List_of_parks_in_Singapore) - NParks webpage - ROOTS article - Infopedia article\n",
  "language": "en",
  "processed_at": "2026-01-12T11:13:02.240072",
  "title": "Istana Park",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Istana_Park"
}