{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:13:06.088460"
  },
  "content": "Abaondoned building in Tanglin, Singapore **Istana Woodneuk** is an abandoned two-storey palace at the former [Tyersall Park](/wiki/Tyersall_Park), bounded by Holland Road and Tyersall Avenue, near the [Singapore Botanic Gardens](/wiki/Singapore_Botanic_Gardens) in Singapore. After it was rebuilt in 1935, it was known as **Istana Wooden York**, but this name never got into common use, with the original name still being used. The palace suffered a major fire in 2006 and was deemed beyond repair. It is not charted on most modern maps and is currently not accessible to the public. The grounds, including [Tyersall Park](/wiki/Tyersall_Park), are plotted on [Google Maps](/wiki/Google_Maps) but are marked as \"Permanently closed\". The former palace is commonly confused with the demolished [Istana Tyersall](/wiki/Istana_Tyersall), which was nearby. The most obvious difference between the two former palaces is the colour of the roof tiles: Istana Tyersall had red tiles, while those of Istana Woodneuk were blue. The remains of the palace and the land it occupied were previously private property owned by the [State of Johor](/wiki/State_of_Johor) on behalf of the [Sultan of Johor](/wiki/Sultan_of_Johor). In 2025, a land swap transferred ownership of the palace grounds to [Singapore](/wiki/Singapore) as state land. ## History in the mid 1800s, Woodneuk House was located on a 36-acre section of the [Tyersall Park](/wiki/Tyersall_Park) estate owned by the English trader Captain John Dill Ross. Ross died in 1888 and is memorialized in a biography written by his son John Dill Ross Jr. [William Napier](/wiki/William_Napier_(lawyer)) owned an adjoining estate. Both of these plots of land were sold to [Wan Abu Bakar ibni Daeng Ibrahim](/wiki/Abu_Bakar_of_Johor) in 1860. Abu Bakar became [Temenggong of Johor](/wiki/Temenggong_of_Johor) when his father, [Temenggong Daeng Ibrahim](/wiki/Temenggong_Daeng_Ibrahim) died in 1862. Three days after his father's death he moved his residence to the new combined estate, Tyersall, from [Telok Blangah](/wiki/Telok_Blangah). He made Woodneuk House his main residence ([Istana](/wiki/Palace)). The Istana Woodneuk served as a temporary residence for Sultan Abu Bakar's third wife Sultana Fatimah bte Abdullah, She was overseeing the design and planning of [Istana Tyersall](/wiki/Istana_Tyersall), which was under construction on a small hill not far away from Woodneuk. Sultana Fatimah did not live to see the completion of the palace she designed; Istana Tyersall was completed in 1892, a year after her death on 25 February 1891. Abu Bakar made a will on 14 April 1895 bequeathing the palace to his fourth wife, Sultana Khadijah. He died on 4 June 1895. Sultana Khadijah died in the palace on 1 February 1904, and Abu Bakar's son and successor Sultan [Ibrahim Al-Marhum](/wiki/Ibrahim_of_Johor) took over. The former palace was later taken down. On its former site, a replacement structure, Istana Wooden York, was later designed by [Denis Santry](/wiki/Denis_Santry) of [Swan & Maclaren](/wiki/Swan_%26_Maclaren), and built by Nanyang Structural Co. Construction began in 1932 and was completed in 1935, in time for the celebration of the 62nd birthday of Sultan Ibrahim of Johor and his 40 years of reign. The new palace was built for Sultan Ibrahim and his Scottish wife [Sultanah Helen](/wiki/Sultanah_Helen). Its new name Wooden York was not generally used, except for a few members of the royal family in the State of Johor, as the name Woodneuk was well entrenched. In 1939, Sultan Ibrahim lent part of the Tyersall estate to be used by the [Indian Army](/wiki/British_Indian_Army) as a military camp area to support an effort to mechanise the Indian Army in preparation for [World War II](/wiki/World_War_II). The palace itself continued as the royal residence for the Sultan's family before the beginning of the [Battle of Singapore](/wiki/Battle_of_Singapore) in 1942. Sultan Ibrahim himself was primarily based in [Johor](/wiki/Johor_Bahru). On 9 February 1942, during the Battle of Singapore, the palace temporarily served as the headquarters of the [2/30th Battalion](/wiki/2/30th_Battalion_(Australia)) [AIF](/wiki/Second_Australian_Imperial_Force) under Major General [Gordon Bennett](/wiki/Gordon_Bennett_(general)). It was incorrectly known as \"[Tyersall Palace](/wiki/Tyersall_Palace)\" by the battalion stationed there. On 11 February 1942, after a blast of Japanese mortar attack indicated that the nearby junction of Holland Road and Ulu Pandan Road was held by the [Imperial Japanese Army](/wiki/Imperial_Japanese_Army), Major General Bennet withdrew his headquarters to Tanglin Barracks. ## Aftermath After Singapore was liberated in 1945, the palace was briefly occupied by General Sir [Miles Dempsey](/wiki/Miles_Dempsey), followed by Commander-in-Chief Sir [Montagu Stopford](/wiki/Montagu_Stopford) in 1946. On 16 January 1947, [Governor-General](/wiki/Governor-General) of [Malaya](/wiki/Federation_of_Malaya) [Malcolm MacDonald](/wiki/Malcolm_MacDonald) and his wife Audrey Marjorie Rowley moved into the palace after their long journey from Canada. By 1948 it was returned to the Sultan for his official use. In December 1951 the [State of Johor](/wiki/State_of_Johor) spent S$14,500 to re-roof the palace and the [Istana Besar](/wiki/Istana_Besar) in [Johor Bahru](/wiki/Johor_Bahru). From 1957 to 1986, the palace and its compound were maintained by caretaker Hj. Sulaiman, hired by Johor State Council, who lived with his family not far away from the building. The [Singapore Government](/wiki/Singapore_Government) made a compulsory purchase of Tyersall Park in December 1990, but it remained inaccessible to the public and was left abandoned and uncared for. The palace fell into ruin and the surroundings were covered by thick vegetation due to decades of abandonment. It became a spot for ghost seekers and photographers due to its inaccessibility. Its walls were graffitied by vandals, and it was used as a store by construction workers for a nearby construction site. On 10 July 2006, the palace burned down due to a major fire attributed to drug addicts. Its blue roof tiles caved in and its condition was deemed beyond repair and structurally unsafe. In April 2015, the forest path leading to the premises was cordoned off by the [Singapore Police](/wiki/Singapore_Police_Force). In February 2016, a police signboard was spotted near the path warning would-be trespassers to stay away. ### Land swap In 2025, the [Government of Singapore](/wiki/Government_of_Singapore) and [Tunku Ismail Sultan Ibrahim](/wiki/Tunku_Ismail_Sultan_Ibrahim), Crown Prince of Johor, reached a land-swap agreement. The 13-hectare palace estate and its surrounding grounds were transferred to Singapore as part of Plot C, while Singapore ceded a parcel of state land, known as Plot A. Plot A is situated west of Plot B, the central plot that contained where the former [Istana Tyersall](/wiki/Istana_Tyersall) stood before it was demolished in 1935. - [Istana Tyersall](/wiki/Istana_Tyersall) - [Tyersall Park](/wiki/Tyersall_Park) - [Abu Bakar of Johor](/wiki/Abu_Bakar_of_Johor) - [Ibrahim of Johor](/wiki/Ibrahim_of_Johor)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:13:06.087923",
  "title": "Istana Woodneuk",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Istana_Woodneuk"
}