{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:13:00.053138"
  },
  "content": "Building in Singapore, Straits Settlements The **Istana Lama** was a palace once located at [Telok Blangah](/wiki/Telok_Blangah) in [Singapore](/wiki/Singapore). It was first built for [Temenggong Abdul Rahman](/wiki/Temenggong_Abdul_Rahman) in 1824. It had since been demolished in 1954. ## History About four years after the [Treaty](/wiki/1819_Singapore_Treaty) was signed in 1819 which marked Singapore as a British settlement, [Temenggong Abdul Rahman](/wiki/Temenggong_Abdul_Rahman), his family and followers moved to the 200 acres of land (part of [Teluk Belanga](/wiki/Teluk_Belanga) area) as assigned by Sir [Stamford Raffles](/wiki/Stamford_Raffles). The European-style mansion known as Istana Lama was built and completed in 1824. Temenggong Abdul Rahman died in this house on 8 December 1825 and was buried at the nearby [Makam Diraja Teluk Blangah](/wiki/Makam_Diraja_Teluk_Blangah). His eldest son Tun Haji Abdullah first informally succeed him as the *[de facto](/wiki/De_facto)* [Temenggong of Johor](/wiki/Temenggong_of_Johor). The house was later refurnished with concrete structures by his second son [Daeng Ibrahim](/wiki/Temenggong_Daeng_Ibrahim) in 1830, who would informally succeed Tun Haji Abdullah as the Temonggong in 1833. It was noted for being the birthplace for Temenggong Daeng Ibrahim's son [Wan Abu Bakar](/wiki/Abu_Bakar_of_Johor), his eventual successor and future [Sultan of Johor](/wiki/Sultan_of_Johor), who was born on 3 February 1833. Temenggong Daeng Ibrahim was officially made known on 19 August 1841, and upon becoming the [de facto](/wiki/De_facto) Maharajah of Johor on 10 March 1855, he began to administer his territory [Iskandar Puteri](/wiki/Iskandar_Puteri) from this residence. Temenggong Daeng Ibrahim died in the house on 31 January 1862 and was buried at the nearby Makam on the following day, his son Wan Abu Bakar succeed him as the Temenggong on 2 February 1862 and soon moved his residence to [Tyersall](/wiki/Tyersall,_Singapore). Temenggong Abu Bakar had once suggested the former palace to operate as a Malay high school. However, as there was an English school that existed not far from the palace, the idea of opening the school was no longer being suggested. The former palace was then given to a Chinese towkay who was a friend to the royalty. In 1931, the Chinese towkay soon rented out the former palace to a German couple B. Hackmeier and his wife Bertha and they repurposed it into a hotel named Hotel Bellevue. Following the end of [Japanese occupation of Singapore](/wiki/Japanese_occupation_of_Singapore), the former palace was sold to a company Guan Seng Kee in 1951. The company utilized it to serve as a hostel for their workers. ## Demolition In 1954, the company put up the former palace for sale. During that point, there were a few parties suggested that the former palace to be renovated as a museum to showcase Malay handicrafts, furniture and old photos related to the [Johor Sultanate](/wiki/Johor_Sultanate). Following which, the former palace was eventually sold to the [Bata company](/wiki/Bata_Corporation) and demolished on that same year. ## Aftermath On 9 April 1964, the Bata Shoe Factory was officially opened by the then [Finance Minister](/wiki/Minister_for_Finance_(Singapore)) Dr [Goh Keng Swee](/wiki/Goh_Keng_Swee) on about half of its former site from the bottom, with the address of 66 Telok Blangah Road and was granted a 30-year lease in May. The factory eventually closed and was demolished by 1994. In 1995, a condominium known as *Harbourlights* was built on the former site of the shoe factory and was completed by 1997.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:13:00.052715",
  "title": "Istana Lama",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Istana_Lama"
}