{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:12:58.017717"
  },
  "content": "Defunct palace in Bidadari, Singapore **Istana Bidadari** was a palace once located within the [Bidadari Cemetery](/wiki/Bidadari_Cemetery) in [Singapore](/wiki/Singapore) from the late-1850s to 1915. ## History An estate of about 45-acre in Singapore was first acquired by the British civil engineer Henry Minchin Simons in 1855, there he had the house built between 1855 and 1861. He later exchanged the estate with [William Napier](/wiki/William_Napier_(lawyer)) for his [Tyersall](/wiki/Tyersall,_Singapore) estate. The estate was subsequently sold to [Temenggong Abu Bakar](/wiki/Temenggong_Abu_Bakar) in the mid-1860s and he gave it to his second wife, the Danish woman [Enche' Puan Besar](/wiki/Malay_styles_and_titles) Zubaidah binti Abdullah who was born Cecilia Catharina Lange, for her residence. Thus the estate was known as [Bidadari](/wiki/Bidadari,_Singapore) and house was known as Istana Bidadari, in reference to the beauty of the Temenggong's wife as compared to the fairies. Temenggong Abu Bakar would spend much for his time there with his wife, although his main residence was at Tyersall. Istana Bidadari was noted to be the birthplaces of Maharaja of Johor Abu Bakar and Zubaidah's daughter Tengku Mariam Al-Marhum, born on 21 December 1871, and son, [Ibrahim Al-Marhum](/wiki/Ibrahim_of_Johor), his eventual successor, who was born on 17 September 1873. After her husband Abu Bakar proclaimed as the [Sultan of Johor](/wiki/Sultan_of_Johor) in 1885, Sultana Zubaidah moved to Johor and the former palace was rented out to various parties, including the [Austro-Hungarian](/wiki/Austro-Hungarian) [Consul](/wiki/Consul_(representative)) in 1889. In 1902, the Municipal Commissioners officially declared the acquisition of 26 hectares of the estate to be used as a cemetery, which would be named after the estate's name. The Bidadari Cemetery was officially opened on 1 January 1908. The former palace was demolished in 1915.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:12:58.017392",
  "title": "Istana Bidadari",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Istana_Bidadari"
}