{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:13:08.244355"
  },
  "content": "Maritime Southeast Asian matchlock firearm The term \"***istinggar***\" and **Astinggal** (in [Filipino](/wiki/Tagalog_language)) refers to a type of [matchlock](/wiki/Matchlock) [firearm](/wiki/Firearm) built by the various [ethnic groups](/wiki/Ethnic_group) of the [Maritime Southeast Asia](/wiki/Maritime_Southeast_Asia). The firearm is a result of Portuguese influence on local weaponry after the [capture of Malacca (1511)](/wiki/Capture_of_Malacca_(1511)). Before this type of gun, in the archipelago already existed early long gun called *bedil*, or [Java arquebus](/wiki/Java_arquebus) as the Chinese call it. Most of the specimens in the Malay Peninsula are actually Malaysian in origin, manufactured in the Langkasuka lands of [Kedah](/wiki/Kedah). The states of the Malay Peninsula imported this firearm as it was widely used in their wars.: 57 ## Etymology The name *istinggar* comes from the [Portuguese](/wiki/Portuguese_language) word *espingarda* meaning [arquebus](/wiki/Arquebus) or firearm. This term then corrupted into *estingarda*, eventually to setinggar or istinggar.: 53 : 64 The word has many variations in the archipelago, such as satinggar, satenggar, istenggara, astengger, altanggar, astinggal, ispinggar, and tinggar.: 209 ## History The predecessor of firearms, the [pole gun](/wiki/Hand_cannon) ([bedil tombak](/wiki/Bedil_tombak)), was recorded as being used by Java in 1413.: 245 However, the knowledge of making \"true\" firearms in the archipelago came after the middle of the 15th century. It was brought by the [Islamic](/wiki/Islam) nations of West Asia, most probably the [Arabs](/wiki/Arabs). The precise year of introduction is unknown, but it may be safely concluded to be no earlier than 1460.: 23 Before the arrival of the Portuguese in Southeast Asia, the Malays already possessed early firearms, the [Java arquebus](/wiki/Java_arquebus). This firearm has a very long barrel (up to 2.2 m (7 ft 3 in) in length), and during the Portuguese conquest of Malacca (1511), it is proven to be able to penetrate a ship's hull to the other side.: 22 However the lock mechanism and the barrel of the gun are very crude.: 53 The Portuguese in [Goa](/wiki/Portuguese_Goa) independently produced their own matchlock firearms. Starting in 1513, the tradition of German and Bohemian gun-making was merged with Turkish gun-making traditions.: 39–41 This resulted in the Indo-Portuguese tradition of matchlocks. Indian craftsmen modified the design by introducing a very short, almost pistol-like buttstock held against the cheek, not the shoulder, when aiming. They also reduced the caliber and made the gun lighter and more balanced. This was a hit with the Portuguese who did a lot of fighting aboard ship and on river craft, and valued a more compact gun.: 41 [Afonso de Albuquerque](/wiki/Afonso_de_Albuquerque) compared Malaccan gun founders as being on the same level as those of Germany. However, he did not state what ethnicity the Malaccan gun founder was.: 128 : 221 : 4 Duarte Barbosa stated that the arquebus-maker of Malacca was [Javanese](/wiki/Javanese_people).: 69 The Javanese also manufactured their own cannon in Malacca. Anthony Reid argued that the Javanese handled much of the productive work in Malacca before 1511 and in 17th century Pattani.: 69 Wan Mohd Dasuki Wan Hasbullah explained several facts about the existence of gunpowder weapons in Malacca before its fall in 1511:: 97–98 1. No evidence showed that guns, cannons, and gunpowder are made in Malay states. 2. No evidence showed that guns were ever used by the Malacca Sultanate before the Portuguese attack, even from Malay sources themselves. 3. Based on the majority of cannons reported by the Portuguese, the Malays preferred small artillery. There were 2 different lock mechanisms used in Indo-Portuguese guns. One has a single leaf mainspring of the [Lusitanian](/wiki/Lusitanian_Basin) gun prototypes, which can be found in Ceylon, Malay peninsula, Sumatra, and Vietnam, and the other has a V-shaped mainspring, which can be found in Java, Bali, China, Japan, and Korea.: 103–104 The lock mechanism of istinggar is usually made of brass.: 99 The Malays used bamboo covers in their matchlock arquebus barrel and bound them with rattan, to keep them dry in wet weather.: 100 : 53 Istinggar is typically longer than [Japanese guns](/wiki/Tanegashima_(gun)). The absence of a channel for the ramrod indicated that they were used resting on a wall or used from a ship's railing like the [lela](/wiki/Lela_(cannon)) or [rentaka](/wiki/Rentaka). In this case, the ramrod did not need a compartment. The Malays also made small mallets to drive the musket balls down the barrel.: 99–100 [Minangkabau people](/wiki/Minangkabau_people) of interior [Sumatra](/wiki/Sumatra) are renowned for their manufacture of gunpowder-based weapons. Contemporary records of [João de Barros](/wiki/Jo%C3%A3o_de_Barros) (1496–1570) indicated that before the arrival of European people, the Sumatrans had not used firearms.: 3 Iron and steel were produced in their forges, but by the 19th century, they became more reliant on the Europeans.: 347 The matchlock arquebus of Minangkabau was dubbed \"*Istenggara Menangkabowe*\" (or *istinggar Minangkabau*, or simply *satingga*).: 209 : 64 : 277 The production was enough to fulfill local needs, the Minangkabau also exported their firearms to other areas, such as [Aceh](/wiki/Aceh), [Malacca](/wiki/Malacca_Sultanate), and [Siak Sultanate](/wiki/Sultanate_of_Siak_Sri_Indrapura).: 347 The barrels are made by rolling a flatted bar of iron of proportionate dimensions spirally around a circular rod, and beating it till the parts of the former unite, and the art of [boring](/wiki/Boring_(manufacturing)) is probably unknown to them.: 347–348 This manufacture continued even into the 19th century when matchlock has already been obsolete.: 54 A manuscript called *Ilmu Bedil* (means \"knowledge of firearm\") is a treatise about this type of istinggar. The Minangkabau also produced other firearms, the *[terakul](/wiki/Dragon_(firearm))* ([dragoon](/wiki/Dragoon) pistol).: 61 The [Batak people](/wiki/Batak) used matchlock guns with locks made of copper and were regarded by Marsden as expert marksmen. However, the guns of Batak were supplied by Minangkabau traders.: 377–378 The [Makassar people](/wiki/Makassar_people) of the [Kingdom of Gowa](/wiki/Sultanate_of_Gowa), which maintained friendly relationships with the Portuguese since 1528,: 372 benefitted considerably from Portuguese assistance in building up its military strength. Converted to Islam in the early 1600s, they made [holy war](/wiki/Holy_war) ([jihad](/wiki/Jihad)) on its nonbeliever neighbor, the [Bugis](/wiki/Buginese_people).: 431 The Makassan were already manufacturing muskets, probably from Portuguese *espingarda*, sometime in the late 16th or early 17th century. By the 18th century, European people praised the guns produced by their Bugis neighbor, which has a straight bore and fine inlay work.: 384 During years of warfare, Bugis and Makassarese soldiers, dressed in [*waju rante*](/wiki/Baju_Rantai) ([chain mail](/wiki/Chain_mail)) and [muskets](/wiki/Musket) which they made themselves.: 384 Between 1603 and 1606, the [Iberian Union](/wiki/Iberian_Union) troops attacked [Ternate](/wiki/Sultanate_of_Ternate) twice and reported muskets and arquebuses were used by the \"Moros\" (i.e. Moors, or Muslims). Nicolas Gervaise notes that in Makassar \"There are no people in [East Indies](/wiki/East_Indies) more nimble in getting on horseback, to draw a bow, to discharge a fuzil (musket), or to point a cannon (than the Makassarese)\". Eventually, the Istinggar spread to the Muslim-controlled areas of the Philippine archipelago, where it was known as \"astinggal\". The [1613 *San Buenaventura* Tagalog dictionary](/wiki/Vocabulario_de_la_lengua_tagala) defines \"astingal\" as \"arquebus, of the kind they used to use in olden times in their wars and which came from Borneo\". This appears to be the first reference to them in northern Luzon. Despite this, the Spaniards never faced any in their encounters in Luzon as they did in Mindanao. In 1609, the Spaniards reported that in [Zambales](/wiki/Zambales) many of the natives handle the arquebuses and muskets quite skilfully, since they have seen the Spaniards use their weapons. The Hindu inhabitants of [Bali](/wiki/Bali) and [Lombok](/wiki/Lombok), being the remnant of Majapahit [hindus](/wiki/Hindus), are famous for their manufacture of the matchlock. In the 1800s [Alfred Wallace](/wiki/Alfred_Russel_Wallace) saw two guns of their manufacture, 6–7 ft (1.8–2.1 m) long, with a proportionately large bore. The wooden stock is well made, extended to the front end of the barrel. The barrels were twisted and finished, with [silver](/wiki/Silver) and [gold](/wiki/Gold) ornament.: 98 For making the long barrel, the natives use 18 in (460 mm) pieces of barrel which are first bored small, and then welded together upon a straight iron rod. The whole barrel is then worked with borers of gradually increasing size, and in three days the boring is finished.: 170 For firearms using [flintlock](/wiki/Flintlock_mechanism) mechanism, the inhabitants of the Nusantara archipelago are reliant on Western powers, as no local smith could produce such complex components.: cxli : 98 : 42 and 50 These flintlock firearms are completely different weapons and were known by another name, *senapan* or *senapang*, from the Dutch word [snappaan](/wiki/Snaphance).: 22 The gun-making areas of Nusantara could make these *senapan*; the barrel and the wooden part is made locally, but the mechanism is imported from the European traders.: 42 and 50 : 65 : 98 The Javanese was among the earliest to modernize: After the VOC began replacing matchlocks with flintlocks in the 1680s, the Javanese already requested them by 1690s. Flintlock *senapan* began to appear in the Javanese [arsenal](/wiki/Arsenal) in early 1700 AD.: 55–56 ## Gallery - Indonesia portal - Malaysia portal - Philippines portal - [Java arquebus](/wiki/Java_arquebus), earlier, more primitive firearm of Nusantara archipelago - [Vietnam arquebus](/wiki/Vietnam_arquebus), several type of firearms used by Vietnamese - [Lantaka](/wiki/Lantaka), light swivel gun of the Malays - [Tanegashima (gun)](/wiki/Tanegashima_(gun))\n",
  "language": "en",
  "processed_at": "2026-01-12T11:13:08.243825",
  "title": "Istinggar",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Istinggar"
}