{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:13:10.128081"
  },
  "content": "Nigerian drug traffickerThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Iwuchukwu Amara Tochi\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(May 2011)* *(Learn how and when to remove this message)* **Iwuchukwu Amara Tochi** (1985–26 January 2007) was a Nigerian national convicted of drug trafficking in Singapore. At quantities above certain weight thresholds, which varies for different types of drugs, drug trafficking carries a mandatory [death sentence](/wiki/Capital_punishment_in_Singapore) under [Singapore's Misuse of Drugs Act](/wiki/Misuse_of_Drugs_Act_(Singapore)), and despite pleas for clemency from [Amnesty International](/wiki/Amnesty_International), the United Nations, Nigerian President [Olusegun Obasanjo](/wiki/Olusegun_Obasanjo), as well as other individuals and groups, he was executed by [hanging](/wiki/Hanging) on 26 January 2007 in [Changi Prison](/wiki/Changi_Prison). ## Background Tochi was born in [Nigeria](/wiki/Nigeria). He was given to his relatives at the age of five. He grew up and attended St. Anthony's Mission School in [Ohafia](/wiki/Ohafia), [Abia State](/wiki/Abia_State). In an interview with his lawyer, he stated that his brother dropped out of school to support his father. His mother died a couple of years later. Having a passion for football, he joined a football club in [Senegal](/wiki/Senegal) and subsequently played for Nigeria in the West African Coca-Cola Cup Championships when he was 14. Later, he sought to travel to [Dubai](/wiki/Dubai) to pursue his football career. According to the interview with his lawyer, he travelled to [Pakistan](/wiki/Pakistan) to secure a [visa](/wiki/Visa_(document)) before going to Dubai, as he was under the impression that a train service travels there; he would later find out that none existed. He then sought help from St. Andrew's Church in [Islamabad](/wiki/Islamabad), where he was provided refuge. One Sunday, he met a man known as \"Mr. Smith,\" who claimed to be a distant friend. Tochi claimed Smith gave him pocket money and food and offered to help him obtain a visa in Dubai. However, Tochi could not ultimately obtain the visa because he did not meet the appropriate requirements. Smith then asked Tochi for a favour. He wanted him to deliver medicine for a sick friend in Singapore, saying that his friend would meet Tochi at [Changi Airport](/wiki/Changi_Airport) and collect the medicine. Tochi alleged that Smith led him to believe that he was delivering African herbs, not heroin. ## Arrest Tochi was arrested on 28 November 2004, in [Changi Airport](/wiki/Changi_Airport) in Singapore while in transit. Authorities became suspicious after discovering he had spent more than 24 hours in transit. One hundred capsules of [diamorphine](/wiki/Diamorphine) were found on him with a total weight of 727.02 grammes (a bit over a pound and a half), estimated by authorities to be worth S$1.5m (US$970,000). Tochi claimed that the capsules he carried were for a friend and insisted they were African herbs that tasted like chocolate. He swallowed a capsule to prove this, and police took him to a local hospital where he was given a [laxative](/wiki/Laxative) to flush the capsule out of his system. His arrest led to the arrest of another African drug figure, **Okeke Nelson Malachy**, who was the 'sick friend' of Mr. Smith, to whom Tochi had been instructed to deliver the 'African herbs'. Tochi was waiting for Malachy to arrive from [Medan](/wiki/Medan), [Indonesia](/wiki/Indonesia), but Malachy's flight had been delayed. Malachy denied being part of the conspiracy to import drugs, saying he came to Singapore to look for a second-hand car for use in South Africa. He stated that he was in the garment wholesale business; he did not have any [business cards](/wiki/Business_card) on him at the time of his arrest. He carried a South African passport, but officials believed he was Nigerian. Malachy was subsequently classified as [stateless](/wiki/Stateless_person) by officials. Later, the Department of Foreign Affairs of South Africa officially denied Malachy's South African citizenship. Malachy's cellphone records and [SIM card](/wiki/SIM_card) showed communication between him and \"Mr. Smith\", shortly after Malachy's plane from Medan landed at Changi Airport. Smith's cellphone number was stored in Malachy's SIM card under the name \"Dogo\", another of Smith's aliases, according to Tochi. The actual identity and whereabouts of \"Mr Smith\" remain unknown. Immediately after the arrest, Tochi phoned his brother in Nigeria for help. His brother has not informed their parents as he fears that this might add more burden to them. ## Trial Singaporean laws against drug trafficking are to the effect that if a person is found with more than 2 grams of [diamorphine](/wiki/Diamorphine), then the court will presume that he is trafficking unless it is proved that the drug is not for that purpose. If more than 15 grams of diamorphine is found in his possession, the person faces the mandatory death penalty if found guilty. These two aspects of Singapore law, the non-requirement for proof of [mens rea](/wiki/Mens_rea) (guilty intention) and mandatory sentencing, have been criticised for being inconsistent with international legal standards. Tochi's lawyers put up a spirited defense. Since the basic element of crime is mens rea, the defence sought to prove that Tochi has no mens rea, that he was just an 18-year-old from a Nigerian village who just wanted to further his career in football and came across Mr. Smith who took advantage of him. More so, there was enough evidence that Tochi was not aware that he had diamorphine. According to the defence, if Tochi was aware of that, he would have fled when he was notified by the hotel staff that the police was called. He never did, neither did he even attempt to dispose of the substances. Rather, he stayed in the transit area of the airport until about 20 minutes later when the police arrived. Thus the conduct of the young man was consistent with his mistaken belief that he was only in possession of African herbs meant for a sick man as opposed to having diamorphine. Tochi admitted in his statements that he knew he had the capsules in his possession; and that he had agreed with Smith to deliver the capsules to Marshal for a promised payment of US$2000. In his judgement, Justice [Kan Ting Chiu](/wiki/Kan_Ting_Chiu) noted that Tochi might not have known that the capsules contained diamorphine. He wrote that *\"There was no direct evidence that [Amara Tochi] knew the capsules contained diamorphine. There was nothing to suggest that Smith had told him they contained diamorphine, or that he had found that out of his own.\"* *paragraph 42 SGHC 233*. However, Kan found that the large sum promised should have raised suspicion. Smith was not a rich man. He did not have enough money to buy an air ticket for himself to go from Dubai to Indonesia to visit his sick friend. There must be a reason for Smith to offer him the large sum of US$2000 to deliver the capsules of herbs when he was already funding his passages to Dubai and to Singapore. Kan found that Tochi knew that Smith was a man who would break the law as Smith had arranged for false visas and endorsements to be entered into the first accused's passport to facilitate his travels. He must have realised that Smith was offering him much more than was reasonable for putting him through the minor inconvenience of meeting up with Marshal at the airport terminal and handing the capsules to him. He should have asked to be shown and be assured of the contents before agreeing to deliver them, and he could have used the ample opportunities he had when he had the capsules to check them himself, but he did nothing. Kan also found that he had willfully turned a blind eye to the contents of the capsules because he was tempted by the US$2000, which was a large sum to him. When Smith, who had befriended him and had appeared to help him get out of Pakistan, also offered him US$2000, he did not want to ask any questions or check the capsules himself. Consequently, even if he may not have actual knowledge that he was carrying diamorphine, his ignorance did not exculpate him because it is well established that ignorance is a defense only when there is no reason for suspicion and no right and opportunity of examination. Kan found Tochi guilty. Both Tochi and Malachy were sentenced to death. ## Appeals On 20 February 2006, the [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore) comprising [Chief Justice](/wiki/Chief_Justice_of_Singapore) [Yong Pung How](/wiki/Yong_Pung_How), Judge of Appeal [Chao Hick Tin](/wiki/Chao_Hick_Tin) and Justice [Choo Han Teck](/wiki/Choo_Han_Teck) upheld the sentences issued by the [High Court](/wiki/High_Court_of_Singapore). Singapore President [S.R. Nathan](/wiki/S.R._Nathan) later denied Tochi's request for clemency. On 6 December 2006, CLO (Civil Liberty Organisation, Nigeria) human rights lawyer Princewill Apakpan travelled to Singapore to conduct interviews with the Nigerian embassy in Singapore and to meet Tochi in Changi Prison. His trip was sponsored by a private human rights activist from Germany. Although carrying his legal appointment from Tochi's family to represent Tochi in all matters, Singapore's prison authorities denied him access to visit Tochi. After two weeks, Princewill returned to Nigeria, where he conducted immediate action to force the Nigerian government (which has failed to show any serious concern) to take immediate action on behalf of its nation. A lawsuit was issued against Nigeria's attorney general to force action. This was delayed by the Christmas and New Year holiday season. Nigerian President [Olusegun Obasanjo](/wiki/Olusegun_Obasanjo) issued an official appeal only 48 hours before the scheduled execution. Some activists, maintaining that Tochi was innocent, announced a [hunger strike](/wiki/Hunger_strike) in protest against the execution, beginning at 7 am on 25 January 2007, at Singapore's [Speaker's Corner](/wiki/Speaker%27s_Corner), moving to outside Changi Prison 12 hours later, and continuing until the execution of Tochi at the prison before dawn on the next day. ## Execution Tochi was executed on 26 January 2007 at around 06:00 [SST](/wiki/Singapore_Standard_Time) (22:00 [UTC](/wiki/UTC)) in [Changi Prison](/wiki/Changi_Prison), according to Stanley Seah, an [assistant superintendent](/wiki/Assistant_superintendent) at Singapore's [Central Narcotics Bureau](/wiki/Central_Narcotics_Bureau). Okele Nelson Malachy was executed together with Tochi. A Catholic funeral service was held for Tochi at the Marymount Convent Chapel. - Nigeria portal - Singapore portal - Biography portal - Law portal - [Shanmugam Murugesu](/wiki/Shanmugam_Murugesu) - [Nguyen Tuong Van](/wiki/Nguyen_Tuong_Van) - Amnesty International Statement – ASA 36/003/2006\n",
  "language": "en",
  "processed_at": "2026-01-12T11:13:10.127605",
  "title": "Iwuchukwu Amara Tochi",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Iwuchukwu_Amara_Tochi"
}