{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:13:18.110488"
  },
  "content": "1822 urban plan for Singapore The **Jackson Plan** or **Raffles Town Plan**, an [urban plan](/wiki/Urban_planning) of 1822 titled \"**Plan of the Town of Singapore**\", is a proposed scheme for [Singapore](/wiki/Singapore) drawn up to maintain some order in the urban development of the fledgling but thriving [colony](/wiki/Colony) founded just three years earlier. It was named after [Lieutenant](/wiki/Lieutenant) [Philip Jackson](/wiki/Philip_Jackson_(surveyor)), the colony's engineer and land surveyor tasked to oversee its physical development in accordance with the vision of [Stamford Raffles](/wiki/Stamford_Raffles) for Singapore, hence it is also commonly called Raffles Town Plan. Raffles gave his instructions in November 1822, the plan was then drawn up in late 1822 or early 1823 and published in 1828. It is the earliest extant plan for the town of Singapore, but not an actual street map of Singapore as it existed in 1822 or 1827 since the plan is an idealised scheme of how Singapore may be organised that was not fully realised. Nevertheless, it served as a guide for the development of Singapore in its early days, and the effect of the general layout of the plan is still observable to this day. The plan is currently on display in the [Singapore History Gallery](/wiki/Singapore_History_Gallery) at the [National Museum of Singapore](/wiki/National_Museum_of_Singapore). ## Origin [Sir Stamford Raffles](/wiki/Sir_Stamford_Raffles) founded the colony in 1819, and before he left Singapore, he wrote to [William Farquhar](/wiki/William_Farquhar) giving instructions on how the colony may be organised. Farquhar governed Singapore from 1819 until 1823, and with limited funds, he chose a pragmatic approach to allow the colony to flourish. Under the sheer volume of trade that passed through [her port](/wiki/Port_of_Singapore), some instructions were disregarded and the town grew haphazardly. Upon his final return to colony in October 1822, Raffles was displeased by the disorderliness of the town and that Farquhar had not followed closely the instructions he gave. For example, Farquhar allowed merchants to encroach on designated government area – he permitted the erection of houses and [godowns](/wiki/Godown) on the [Padang](/wiki/Padang,_Singapore) and on the nearby banks of the [Singapore River](/wiki/Singapore_River), within an area Raffles specified not to be permanently appropriated by individuals. In response, Raffles formed a Town Committee, consisting of a merchant, Alexander Laurie Johnston; a civil servant [George Bonham](/wiki/George_Bonham); and Captain Charles Edward Davis of the Bengal Native Infantry, who acted as president of the committee. They were assisted by Lieutenant [Philip Jackson](/wiki/Philip_Jackson_(surveyor)) who drew up the layout plan of the city according to Raffles' instructions. ### Raffles' instructions > It has been observed by the Supreme Government \"that in the event of Singapore being permanently retained, there seems every reason to believe that it will become a place of considerable magnitude and importance, and it is essential that this circumstance should be constantly kept in mind, in regulating the appropriation of land. Every day's experience shews that the inconvenience and expense that may arise out of the want of such a forecast\" and in this respect an economical and proper allotment of the ground intended to form the site of the principal town is an object of first importance, and one which under the present circumstance of the Settlement will not admit of delay. Stamford Raffles, 4 November 1822 Raffles issued his set of instructions to the committee on 4 November 1822, some of which are as follows: 1. The area between the Old Lines (a ruined city wall of [ancient Singapore](/wiki/Kingdom_of_Singapura) still visible in Raffles' time, roughly where [Stamford Road](/wiki/Stamford_Road) now lies) and the Singapore River including a space up to 200 yard east of the Old Lines (i.e. up to where [Bras Basah Road](/wiki/Bras_Basah_Road) is now located) would be reserved for government use. 2. The European area would be located to the east of the cantonment (the government area) as far as the ground that belonged to the Sultan. The area of the cantonment facing the sea and area southwest of the river between Circular Road and Telok Ayer Bay would be used for commerce by European and other merchants. 3. Raffles expected that the Chinese would form the largest community, a large area south west of the Singapore River was therefore reserved for the Chinese except for the area intended for commercial use. The Indians would be settled further up the river. 4. The [Bugis](/wiki/Bugis) (who had already settled in [Kampong Glam](/wiki/Kampong_Glam) to the mouth of the [Rochor River](/wiki/Rochor_River)) and the Arabs were to be allocated areas next to the Sultan's ground. Raffles did not believe that there would be large number of Malay settlers, but thought that they may settle near Panglima Prang's, at the upper banks of the river, and in small bays and inlets. 5. The sea front would be reserved for public purposes. 6. In addition to allocating land, Raffles also gave other suggestions, for example where the market should be moved to (this became the [Telok Ayer Market](/wiki/Telok_Ayer_Market)), creating a marine yard, and that burial grounds should be placed some distance away from the town. Raffles also stipulated that the streets and buildings should be arranged in a uniform and regular manner, for example the streets should have a minimum width and intersect at right angle, and that there should be an exact number of houses on each street. His recommendations included the material as well as features of the buildings. Raffles' instructions were incorporated into the plan, although not all of these were implemented. The committee consulted representatives from the Malay, Chinese, Bugis, Javanese, and Arab communities on the proposed resettlement of the population into their respective areas. The plan was drawn up some time in December 1822 or January 1823, and it was first published in an article by [John Crawfurd](/wiki/John_Crawfurd) as an engraving made in June 1828. ## Layout and effect of the plan ### Overall layout The plan is an idealised scheme of how Singapore may be arranged; the streets of the colony were laid out for the large part in a [grid](/wiki/Grid_(spatial_index)) pattern, but taking into account the curves of the seashore and rivers as well as the topology of the hills. A map of 1825 shows that the actual layout of the town at that time was irregular to the south of the river, and the streets in grid pattern on the south side of the Singapore River (the Chinese [kampong](/wiki/Kampong_(village))) shown in the Jackson Plan did not yet exist. The area west of South Bridge Road was still an undeveloped marshy land in a survey conducted by Coleman in 1829 and published in 1836, but had built up according to the maps of [John Turnbull Thomson](/wiki/John_Turnbull_Thomson) from 1846. The attempt to arrange the streets in a more regular pattern is also evident in the maps of 1836 and 1846. ### Administrative and commercial zones The area west of the European Town to the Singapore river between the [Fort Canning Hill](/wiki/Fort_Canning_Hill) and the sea was reserved for government use, and the area on the southeast of the river designated the [commercial](/wiki/Commerce) district. Although some European merchants had constructed buildings in the area designated for government and public use before the Jackson Plan was implemented, further such privately owned buildings were not permitted. Nevertheless, the rule was still ignored for a while, for example, the [Old Parliament House](/wiki/Old_Parliament_House,_Singapore) was originally built as a private home, but was then later acquired by the colonial government. The area now has a high concentration of public and government buildings, including [Victoria Theatre and Concert Hall](/wiki/Victoria_Theatre_and_Concert_Hall), [National Gallery](/wiki/National_Gallery_Singapore), [Asian Civilisations Museum](/wiki/Asian_Civilisations_Museum), [St Andrew's Cathedral](/wiki/St_Andrew%27s_Cathedral,_Singapore), [The Arts House](/wiki/The_Arts_House), as well as the [Parliament House](/wiki/Parliament_House,_Singapore) and the [Supreme Court of Singapore](/wiki/Supreme_Court_of_Singapore). The south bank of the Singapore River however was marshy and would only have become suitable for commercial purposes after the marshy land was filled in and the river embanked. A small hill once existed between what is now [Raffles Place](/wiki/Raffles_Place) and Battery Road; under the personal supervision of Raffles in 1823, the hill was levelled, and its soil used to fill and [reclaim](/wiki/Land_reclamation) the marshy land just to the southwest of the River. The level of Battery Road was raised, and the river bank was embanked to become the [Boat Quay](/wiki/Boat_Quay) and the Circular Road area. An open space with a garden in the middle was created, which became the Commercial Square, later renamed [Raffles Place](/wiki/Raffles_Place) in Raffles' honour. This section remains the financial hub of Singapore today, and together with the administrative area and other areas in the plan, evolved into the present-day [Downtown Core](/wiki/Downtown_Core). ### Ethnic areas The plan of Singapore divided the town into ethnic functional subdivisions. These ethnic residential areas were to be segregated into four areas. European Town had residents who were [European](/wiki/European_ethnic_groups) traders, Eurasians and wealthy Asians. An area south of the Singapore River was designated the Chinese *Kampong*; the Chinese area was originally further down the river, but was moved up the river to make way for the new commercial district, and this [Chinese](/wiki/Chinese_race) district evolved into the present-day [Chinatown](/wiki/Chinatown,_Singapore). The Indian area, called Chuliah Kampong, was located further up the river next to the Chinese zone (the Indians however would later also settle in another area north of the river now called [Little India](/wiki/Little_India,_Singapore)). [Kampong Glam](/wiki/Kampong_Glam) was intended for [Muslims](/wiki/Muslims), ethnic [Malays](/wiki/Malay_people) and [Arabs](/wiki/Arab) who had migrated to Singapore, and it was further divided into three parts, for the [Bugis](/wiki/Bugis), the Arabs and an area for the Sultan. The division, however, appeared not to be strictly enforced, as may be indicated by the presence of [Nagore Durgha](/wiki/Nagore_Durgha,_Singapore), [Al-Abrar](/wiki/Masjid_Al-Abrar) and [Jamae](/wiki/Masjid_Jamae) mosques in the Chinese Kampong with the Chinese temple [Thian Hock Keng](/wiki/Thian_Hock_Keng) located next to Nagore Durgha. An area marked \"[Kling](/wiki/Keling) Chapel\" nearer to the Indian area was reserved for an Indian place of worship, although the Indian mosques and [Sri Mariamman Temple](/wiki/Sri_Mariamman_Temple,_Singapore) were built within the Chinese zone. The concept of different ethnic zones would later be abandoned, but the distinction of each district is still noticeable to the present day. ### Architecture In addition to his proposal for the layout of the town of Singapore, Raffles also made recommendations on how the buildings may be constructed. Among many of Raffles' recommendations are that houses should be built with masonry and roof tiles to reduce fire risk. He also proposed that these buildings should have uniform and regular facades and that they should have a continuous sheltered public walkway at the front. This proposal produced the distinctive [five foot ways](/wiki/Five_foot_way) of the local architecture of Singapore and Malaysia where [by-laws](/wiki/By-law) were enacted requiring such walkways, and it also spread to other countries including parts of [Thailand](/wiki/Thailand) and the [Philippines](/wiki/Philippines) as well as [Taiwan](/wiki/Taiwan), [Hong Kong](/wiki/Hong_Kong) and the port cities of [southern China](/wiki/Southern_China). - [Founding years of modern Singapore](/wiki/Founding_years_of_modern_Singapore) - [Urban planning in Singapore](/wiki/Urban_planning_in_Singapore)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:13:18.110016",
  "title": "Jackson Plan",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Jackson_Plan"
}