{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:13:32.150357"
  },
  "content": "Cemetery in Singapore**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Jalan Kubor Cemetery\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(April 2023)* *(Learn how and when to remove this message)*This article includes a list of general references, but **it lacks sufficient corresponding inline citations**. Please help to improve this article by introducing more precise citations. *(April 2023)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* The **Jalan Kubor Cemetery** ([Jawi](/wiki/Jawi_script):جالن قبور) is located across [Victoria Street](/wiki/Victoria_Street,_Singapore) within the [Rochor](/wiki/Rochor) neighbourhood of the [Central Region, Singapore](/wiki/Central_Region,_Singapore). The currently disused cemetery contains over a thousand Muslim burials, including that of the royalty from the [Johor Sultanate](/wiki/Johor_Sultanate). ## History Jalan Kubor Cemetery was comprised out of three burial grounds: the burial ground for the royalty and relatives of the [Johor Sultanate](/wiki/Johor_Sultanate), a Malay Muslim burial ground, and an Indian Muslim burial ground, known as Tittacheri Muslim Cemetery. The land where the cemetery now stands was first recorded as the *Tombs of the Malayan Princes* by [John Turnbull Thomson](/wiki/John_Turnbull_Thomson) during his service as colonial prospector in Singapore, which was later noted and marked on an 1829 map by [George Drumgoole Coleman](/wiki/George_Drumgoole_Coleman), a civil architect under [Raffles](/wiki/Stamford_Raffles). The land was also listed as *Sultan Keramat* or *Keramat Sultan* on some early maps. The burials here were relatives and descendants of [Hussein Shah of Johor](/wiki/Hussein_Shah_of_Johor) and other royalty amongst the [Johor Sultanate](/wiki/Johor_Sultanate). In 1852, Syed Omar Aljunied, an Arab merchant living in Singapore, purchased the land next to the royal burial ground and donated it as a [waqf](/wiki/Waqf) (permanent charitable endowment) to be used as a Muslim burial ground. British reports state that this land was generally used by Malay Muslims and was hence described as a \"Malay Burial Ground\" in land inspection surveys of 1875. An administrative named Muhammad Syed assisting in recording the burials in the cemetery. The cemetery was a fenced-in enclosure and was generally well-maintained. Syed Omar and his family and descendants were buried here as well, although are their graves were later moved to the site of the [Masjid Omar Kampong Melaka](/wiki/Masjid_Omar_Kampong_Melaka). Another part of the burial ground, accessible from Victoria Street, was also allocated to Indian Muslims and became known as the Tittacheri Muslim Cemetery. It was nearer to the royalty's burial ground. The [Masjid Malabar](/wiki/Masjid_Malabar) was built in that land and first officially opened in 1963, a reconstruction of a previous 1929 structure that fell into disrepair. Jalan Kubor Cemetery was officially closed in 1875 and no longer accepted new burials around that time. However, the Malay portion of the cemetery was still in use by the Muslim locals including descendants of Syed Omar Aljunied around 1920. The Tittacheri Muslim Cemetery was still used after the [Second World War](/wiki/Second_World_War) (1940–1945). Today, the cemetery is no longer in use and has been earmarked for residential development since 1998. Ownership of the cemetery was transferred to the [Singapore Land Authority](/wiki/Singapore_Land_Authority) in 1987. In 2018, a restoration plan for the [Masjid Malabar](/wiki/Masjid_Malabar) building which included an expansion to the facility threatened the safety of several unidentified graves within Jalan Kubor Cemetery. ### Archaeological discoveries In 2004, the grave of Ngah Ibrahim, a warrior from [Perak](/wiki/Perak) who was complicit in the murder of [James W. W. Birch](/wiki/James_W._W._Birch), was discovered in the cemetery; he had been buried there when he died after he was exiled to Singapore from Perak due to his role in Birch's murder. Ngah Ibrahim's remains were exhumed and returned to Perak to be reburied there, along with his father-in-law's remains that were exhumed from the still functioning Pusara Aman Cemetery at [Choa Chu Kang](/wiki/Choa_Chu_Kang). Between 2014–2015, an archaeological research project commissioned by the [National Heritage Board](/wiki/National_Heritage_Board_(Singapore)) analyzed the tombstones at Jalan Kubor Cemetery, covering an investigation of at least 4,752 tombstones in total. Other archaeological research conducted at the cemetery shows that the tombstones had inscriptions in either the Arabic, Malay, Javanese Aksara, Bugis Aksara, Gujarati, as well as English and Chinese languages; indicating the racial harmony and multi-ethnic society in the areas around the cemetery. ## Burials ### Royalty of the [Johor Sultanate](/wiki/Johor_Sultanate) Among the burials at the royal part of the cemetery are: - Hussein Mua'zzam Shah II, a great-great-grandson of [Hussein Shah of Johor](/wiki/Hussein_Shah_of_Johor) - Hajjah Aisyah, the daughter of [Tengku Alam Shah](/wiki/Tengku_Alam_Shah), a prince of Johor and the instigator of the [Jementah Civil War](/wiki/Jementah_Civil_War) who died in Singapore in 1891 ### Malay burial ground Prominent figures currently buried in the Malay burial ground include: - [Ambo Sooloh](/wiki/Ambo_Sooloh), a [Bugis](/wiki/Bugis) businessman and one of the founders of [Utusan Melayu](/wiki/Utusan_Melayu), a Malay-language newspaper ### Indian Muslim burial ground, Tittacheri Muslim Cemetery - Kunhi Koya Thangal, an Indian Muslim scholar, was buried in the Tittacheri Muslim Cemetery portion of Jalan Kubor; his grave is now located within the courtyard of the modern [Masjid Malabar](/wiki/Masjid_Malabar). - [Kubur Kassim](/wiki/Kubur_Kassim) - [Muslim cemeteries in Singapore](/wiki/Muslim_cemeteries_in_Singapore) ### Sources - National Heritage Board (with input from Dr. Imran bin Tajudeen). \"Jalan Kubor Cemetery\". Archived from the original on 11 July 2017. Retrieved 25 April 2018. - Nor Afidah Abd Rahman (9 March 2016). \"Jalan Kubor Cemetery\". National Library Board. Retrieved 25 April 2018. - Michael Mukunthan and Nor Afidah Abd Rahman (29 December 2004). \"Syed Omar Aljunied\". National Library Board. Retrieved 25 April 2018. - Ummu Rabbisyfina Abdul Hamid (19 April 2018). \"Perkuburan Jalan Kubor diharap diiktiraf sebagai tapak bersejarah\". [Mediacorp Suria](/wiki/Mediacorp_Suria). Retrieved 2 May 2018. - Ummu Rabbisyfina Abdul Hamid (18 April 2018). \"Wanita Kanada ini jadi 'pembela' kubur muslim tertua S'pura; lancarkan app 'Cemetery.sg'\". [Mediacorp Suria](/wiki/Mediacorp_Suria). Retrieved 2 May 2018.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:13:32.149868",
  "title": "Jalan Kubor Cemetery",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Jalan_Kubor_Cemetery"
}