{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:13:26.152332"
  },
  "content": "This article includes a list of general references, but **it lacks sufficient corresponding inline citations**. Please help to improve this article by introducing more precise citations. *(June 2022)* *(Learn how and when to remove this message)*Place in Singapore **Jalan Besar** ([IPA](/wiki/International_Phonetic_Alphabet): /ˈdʒɑːlɑːn bəˈsɑːr/ *JAH-lahn bə-SAH*, [Chinese](/wiki/Chinese_language): 惹兰勿刹; literally \"Large Road\" in [Malay](/wiki/Malay_language), but taken to mean \"Main Road\") is a one-way road in [Singapore](/wiki/Singapore), connecting Lavender Street in [Kallang](/wiki/Kallang) and Rochor Canal Road in [Rochor](/wiki/Rochor). [Jalan Besar MRT station](/wiki/Jalan_Besar_MRT_station) is located under Jalan Besar road, at the junction with Weld Road. ## History Jalan Besar was developed in the late 19th century, around the 1880s, as part of the early urban expansion of Singapore. The area where the road now runs was originally low-lying swamp land located between the Kallang and Rochor rivers. The name *Jalan Besar* means \"Big Road\" in Malay, referencing its wide carriageway, which was suitable for bullock carts and early motor vehicles. During British colonial times, the area around Jalan Besar was gradually built up with rows of [shophouses](/wiki/Shophouses), many of which still stand today as conserved heritage buildings. Several adjacent roads were named after prominent British military figures from World War I, such as Allenby, Kitchener, and Jellicoe. Jalan Besar developed into a mixed-use neighbourhood with residential, commercial, and light industrial buildings. By the early 20th century, the area had become known for its vibrant local businesses, hardware shops, coffee shops, and workshops. In more recent years, it has undergone gentrification, attracting new cafés, creative spaces, and lifestyle businesses while preserving much of its architectural heritage. ## Landmarks ### Jalan Besar Stadium One of the most prominent landmarks along the road is **Jalan Besar Stadium**. Officially opened on 26 December 1929, it was originally the home ground of the Singapore Football Association and hosted numerous Malaya Cup matches. The stadium underwent several renovations, most notably in 2003, and now functions as the headquarters of the [Football Association of Singapore](/wiki/Football_Association_of_Singapore). It also serves as a training venue for national football teams and has hosted international youth tournaments. ### Jalan Besar MRT station **[Jalan Besar MRT station](/wiki/Jalan_Besar_MRT_station)** (DT22) is located underneath the junction of Jalan Besar and Weld Road. The underground station on the [Downtown MRT line](/wiki/Downtown_Line) was officially opened on 21 October 2017, enhancing connectivity to Rochor, Bugis, and the broader city centre. ### Masjid Abdul Gafoor Nearby, in the Little India Historic District just off Jalan Besar, is the historic **Masjid Abdul Gafoor**. Built in 1907 and gazetted as a national monument in 1979, the mosque is known for its striking Indo-Saracenic architecture and sunburst-shaped mihrab. It serves the Tamil Muslim community and remains an important cultural site. ### Conserved shophouses and creative businesses Jalan Besar is lined with rows of conserved [shophouses](/wiki/Shophouses) built in the early 20th century. These buildings, with their distinctively colourful facades and decorative tiles, house a mix of old trades—such as hardware and metalworking—as well as newer cafés, art studios, and boutique hostels. The area is part of Singapore's Urban Redevelopment Authority (URA) conservation programme. ## Culture and community In recent years, Jalan Besar has undergone significant gentrification, transforming from an industrial and hardware-centric area into a trendy lifestyle and food destination. While many traditional trades—such as metal workshops and tyre repair shops—still operate, they now coexist with a growing number of artisanal coffee shops, craft beer bars, design studios, and boutique accommodations. The neighbourhood has also gained popularity among young creatives and entrepreneurs, contributing to a diverse mix of tenants and visitors. Its blend of old and new has made Jalan Besar a popular spot for heritage walking tours and street photography. Colourful murals and well-preserved architectural details make the area visually distinctive. Jalan Besar is featured in the [National Heritage Board](/wiki/National_Heritage_Board_(Singapore))'s official heritage trails, highlighting its significance in Singapore's urban history and cultural evolution. It also hosts events like street festivals and pop-up craft markets, adding to the community-oriented atmosphere. ## Route and transport Jalan Besar is a one-way road that runs in a generally southeast–northwest direction, beginning at the junction of [Lavender Street](/wiki/Lavender_Street) and [Kallang Bahru](/wiki/Kallang_Bahru) in the [Kallang](/wiki/Kallang) planning area. It continues northwest, intersecting with several key roads including Allenby Road and Syed Alwi Road, before terminating at Rochor Canal Road in the [Rochor](/wiki/Rochor) planning area. The road spans approximately 1.4 kilometres and is lined with conserved shophouses, small businesses, and landmarks such as Jalan Besar Stadium and Jalan Besar MRT station. Due to its narrow design and heritage buildings, traffic is limited to a single one-way flow to preserve the streetscape and pedestrian friendliness. Jalan Besar is well-served by public transportation. The [Downtown MRT line](/wiki/Downtown_Line)'s **Jalan Besar MRT station** (DT22) sits beneath the intersection with Weld Road, providing underground rail connectivity to the [Central Business District](/wiki/Central_Business_District) and eastern suburbs. Several nearby MRT stations are within walking distance, including [Lavender MRT station](/wiki/Lavender_MRT_station) ([East West Line](/wiki/East%E2%80%93West_Line_(Singapore))), [Farrer Park MRT station](/wiki/Farrer_Park_MRT_station) ([North East Line](/wiki/North_East_Line)), and [Bugis MRT station](/wiki/Bugis_MRT_station) ([Downtown](/wiki/Downtown_Line) and East West lines). Public buses also serve the length of Jalan Besar, with services such as 23, 64, 65, 66, 130, 139, and 147 running through or adjacent to the area. - [Jalan Besar Stadium](/wiki/Jalan_Besar_Stadium)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:13:26.151913",
  "title": "Jalan Besar",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Jalan_Besar"
}