{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:13:24.172586"
  },
  "content": "Arterial road in western SingaporePlace in Singapore **Jalan Bahar** ([IPA](/wiki/International_Phonetic_Alphabet): /ˈdʒɑːlɑːn ˌbɑːhɑːr/, [Chinese](/wiki/Chinese_language): 惹兰巴哈) is a major arterial road from Old Choa Chu Kang Road to Jurong West Avenue 2; originally a [Jurong Road](/wiki/Jurong_Road) to Old Choa Chu Kang Road link. It was opened on 9 April 1965 to connect the rural areas of [Lim Chu Kang](/wiki/Lim_Chu_Kang) to the [Jurong Industrial Estate](/wiki/Jurong_Industrial_Estate). It also connects through the [Pan Island Expressway](/wiki/Pan_Island_Expressway). It no longer connects to the original Lim Chu Kang Road due to the expansion of [Tengah Air Base](/wiki/Tengah_Air_Base) it is realigned to the newly opened Lim Chu Kang Road on 8th June 2025. Jalan Bahar is located at the western part of Singapore, and is in close proximity to Tuas and Lim Chu Kang districts. The portion of the Jalan Bahar (west of New Lim Chu Kang Road) is part of the SAFTI Live Firing Area (deadly force may be used once unauthorised persons enter past the sign); and the eastern part of Jalan Bahar is part of the normal military training area (deadly force may be used against unauthorised persons). Primarily a wooded, forested area, the land at Jalan Bahar has been cleared over the years and is left undeveloped till today. Only a few commercial buildings stand here, mainly industrial buildings and educational institutions. ## Etymology In [Malay](/wiki/Malay_Language), *bahar* refers to a large lake or river. A [flyover](/wiki/Overpass) also takes its name from the road. ## History Jalan Bahar first appeared on maps as a major paved road in 1966. While its termini remained the same, the road which it used to terminate at its south end, the former [Jurong Road](/wiki/Jurong_Road), now exists in the area as a section of Jurong West Avenue 2. Besides the Civil Defence Academy, [Pusara Aman Muslim Cemetery](/wiki/Former_cemeteries_in_Singapore#Remaining_Cemeteries) as well as the entrance to [Nanyang Technological University](/wiki/Nanyang_Technological_University) campus at Nanyang Road, there are few ongoing developments surrounding Jalan Bahar. The road had recently completed its road widening project in late 2016. The purpose of this project was to improve the current traffic situation and to support future developments and economic activities in the West Region.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:13:24.172045",
  "title": "Jalan Bahar",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Jalan_Bahar"
}