{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:13:36.280735"
  },
  "content": "British army officer and co-founder of the White Helmets **James Gustaf Edward Le Mesurier** [OBE](/wiki/Officer_of_the_Order_of_the_British_Empire) (25 May 1971 – 11 November 2019) was a British former military officer and security consultant who was the co-founder of the [White Helmets](/wiki/White_Helmets_(Syrian_civil_war)), a volunteer civil defence organisation in the [Syrian Civil War](/wiki/Syrian_Civil_War), founded in southern Turkey in 2014. Le Mesurier was a [British Army](/wiki/British_Army) [officer](/wiki/Officer_(armed_forces)) and worked as part of the [United Nations peacekeeping](/wiki/United_Nations_peacekeeping) force in the [former Yugoslavia](/wiki/Former_Yugoslavia). He was the director of the non-profit [Mayday Rescue Foundation](/wiki/Mayday_Rescue_Foundation), headquartered in the Netherlands. Le Mesurier died in a fall from the balcony of an Istanbul building where he kept an apartment and an office. ## Early life Le Mesurier was born on 25 May 1971 at [RAF Changi](/wiki/RAF_Changi) in [Singapore](/wiki/Singapore). He was the son of an Englishman Lieutenant Colonel Benjamin Havilland Churchill Le Mesurier, of the [Royal Marines](/wiki/Royal_Marines), and his Swedish wife, Ewa. He had an older sister. Actor [John Le Mesurier](/wiki/John_Le_Mesurier) was a relative. He was educated at Northaw prep school, [Canford School](/wiki/Canford_School) and attended [Ulster University](/wiki/Ulster_University) (sponsored by the army), but for security reasons finished the final year of his degree at [Aberystwyth University](/wiki/Aberystwyth_University) studying International Relations and Strategic Studies. ## Military and government service In 1990, Le Mesurier was commissioned into the [Royal Green Jackets](/wiki/Royal_Green_Jackets), [British Army](/wiki/British_Army), as a [second lieutenant](/wiki/Second_lieutenant) (University Cadetship); the British Army was sponsoring him through university. Having graduated from university, he was appointed second lieutenant (on probation) on 20 June 1993 upon entering the [Royal Military Academy Sandhurst](/wiki/Royal_Military_Academy_Sandhurst). At Sandhurst, he graduated top of class and won the Queens' Medal award. He was promoted to [lieutenant](/wiki/Lieutenant_(British_Army_and_Royal_Marines)) on 11 August 1993, and to [captain](/wiki/Captain_(British_Army_and_Royal_Marines)) on 11 August 1996. He served in [Northern Ireland](/wiki/Northern_Ireland), then for two years became an infantry training instructor with the [Army Training Regiment](/wiki/Army_Training_Regiment) in [Winchester](/wiki/Sir_John_Moore_Barracks,_Winchester). He then returned to the Royal Green Jackets as an intelligence officer in [Bosnia](/wiki/Bosnia) and [Kosovo](/wiki/Kosovo). In 1999, he worked as a Return and Reconstruction Task Force Officer at the [Office of the High Representative](/wiki/Office_of_the_High_Representative) in the [former Yugoslavia](/wiki/Former_Yugoslavia). He retired from the military on 1 June 2000. He was affected by the West's inability to prevent in the [atrocities in the Kosovo War](/wiki/War_crimes_in_the_Kosovo_War). It appears, according to [BBC News](/wiki/BBC_News), that Le Mesurier attempted to join [MI6](/wiki/Secret_Intelligence_Service) at about this time; he failed their vetting procedures. Le Mesurier then worked for a year as a [United Nations Interim Administration Mission in Kosovo](/wiki/United_Nations_Interim_Administration_Mission_in_Kosovo) Policy Advisor in the former Yugoslavia. He then became the Head of the [Jericho Monitoring Mission](/wiki/Jericho_Monitoring_Mission) for the [Foreign and Commonwealth Office](/wiki/Foreign_and_Commonwealth_Office) from 2002 to 2004, responsible for monitoring six Palestinian prisoners. Subsequently, he took an Advisor role at the [Embassy of the United States, Baghdad](/wiki/Embassy_of_the_United_States,_Baghdad). ## Private security work From 2005 to 2007, Le Mesurier worked for the British headquartered Olive Group (later merged into the U.S. [Constellis Group](/wiki/Constellis_Group)). From 2008 to 2012,[*better source needed*] he worked as an urban security expert for Good Harbor Consulting, chaired by [Richard A. Clarke](/wiki/Richard_A._Clarke), former U.S. counter-terrorism official who later accused [George W. Bush](/wiki/George_W._Bush) of committing war crimes. Le Mesurier's work included training the [United Arab Emirates](/wiki/United_Arab_Emirates) (UAE) oil and gas field protection force, designing security infrastructure for [Abu Dhabi](/wiki/Abu_Dhabi), and safety and security for the 2010 [Arabian Gulf Cup](/wiki/Arabian_Gulf_Cup) in Yemen. From 2012 to 2014, Le Mesurier worked for the UAE consultancy Analysis, Research, and Knowledge (ARK), which stated its goal was to \"help realise the legitimate political, social and economic aspirations of conflict-affected communities\". In 2013, with the Turkish NGO [AKUT Search and Rescue Association](/wiki/AKUT_Search_and_Rescue_Association), ARK started training non-governmental Syrian civil defence teams in Turkey, funded by the UK, U.S. and Japanese governments and managed by Le Mesurier. ## Work with the White Helmets ### Foundation and activities From 2011, Le Mesurier worked for the UAE consultancy Analysis, Research, and Knowledge (ARK), an organisation created by Alistair Harris, which was involved multiple projects in Syria. However, he wished to focus on voluntary civil defence exclusively and, in 2014, founded and was the director of the charity [Mayday Rescue](/wiki/Mayday_Rescue_Foundation). It continued to train and support Syrian volunteers in what had developed into the [White Helmets](/wiki/White_Helmets_(Syrian_civil_war)) (founded in 2013 by Abdulrahman al-Mawwas) involved in emergency response, including the search and rescue of bombed buildings, and medical evacuation. The White Helmets (a nickname for the Syria Civil Defence – are not to be confused with the Syrian government's [Syrian Civil Defence Forces](/wiki/Syrian_Civil_Defence_Forces)). By 2015, the White Helmets were reported to have more than 2,700 volunteers. Le Mesurier told [Al-Jazeera](/wiki/Al_Jazeera_Media_Network) that by 2015 they had saved more than 24,000 people. \"At the time, I was working in Istanbul ... and got together with a group of Turkish earthquake rescue volunteers\", Le Mesurier told Al-Jazeera. He was connected with the introduction of a code of conduct for volunteers requiring them not to be connected to any armed groups. Volunteers who showed any sympathy for the jihadists were sacked. Le Mesurier told Dutch television in 2016: \"They have rescued regime soldiers from under piles of rubble, and they do so neutrally and they do so impartially. For them what is important is saving a life. It doesn't matter who that life belongs to.\" Mayday Rescue reported that between 2014 and 2018 it received funding of $127 million, $19 million of which came from non-government sources and the remainder from Western governments. In the [2016 Birthday Honours](/wiki/2016_Birthday_Honours#Officer_of_the_Order_of_the_British_Empire_(OBE)), Le Mesurier received an [OBE](/wiki/Officer_of_the_Order_of_the_British_Empire) \"for services to Syria Civil Defence and the protection of civilians in Syria\". In 2018, the UK agreed to give asylum to some of the 500 White Helmets members and relatives who had been evacuated to Jordan, following lobbying by Le Mesurier. The UK government justified the decision by noting that \"The White Helmets have saved over 115,000 lives during the Syrian conflict\". \"If you make the decision to risk your life, to save other people, it goes against radicalization\", Le Mesurier told di Giovanni in an article for *[Newsweek](/wiki/Newsweek)* in 2016. \"They’ve emerged as the representative of the average, good Syrian.\" ### Russian and Syrian disinformation campaign *[The Times](/wiki/The_Times)* reported that Le Mesurier was \"the subject of an intense [black propaganda](/wiki/Black_propaganda) campaign for years by pro-Assad activists and Russian diplomats\". *[The New York Times](/wiki/The_New_York_Times)* reported that the group and Le Mesurier were the target of \"unfounded conspiracy theories\". Russian media and pro-Assad bloggers, who claim the White Helmets and Le Mesurier were intending to push for regime change in Syria, alleged that Le Mesurier's British Army background meant that he was effectively operating as a British state agent. [Janine di Giovanni](/wiki/Janine_di_Giovanni) has written the claim he was a spy lacks any evidence. Ben Nimmo, of the social media analysis company [Graphika](/wiki/Graphika), found that such claims began around 2015 with the [involvement of Russian forces](/wiki/Russian_intervention_in_the_Syrian_civil_war) in the War, and increased after Syrian government forces along with their Russian allies began the [Siege of Aleppo](/wiki/Battle_of_Aleppo_(2012%E2%80%932016)) in late 2016 with their targeting of hospitals, a potential war crime, which the White Helmets witnessed and were by now able to provide video evidence. A week before Le Mesurier died, he was accused on [Twitter](/wiki/Twitter) by Russia's Ministry of Foreign Affairs official [Maria Zakharova](/wiki/Maria_Zakharova), without evidence, of being a former MI6 agent with \"connections to terrorist groups\", including [al-Qaeda](/wiki/Al-Qaeda). The UK Permanent Representative to the UN, [Karen Pierce](/wiki/Karen_Pierce) described Le Mesurier as a \"true hero\". She denied the charges, saying that they were \"categorically untrue. He was a British soldier.\" ### Financial Irregularities While working on the operation to evacuate White Helmet volunteers from Syria in July 2018, Le Mesurier took $50,000 in cash from the Mayday safe. Le Mesurier initially backdated false receipts accounting for the full sum and, when discovered, asked for it to be taken from his salary. It is reported that he admitted to fraud. In 2019, a Dutch auditing company, SMK, acting on behalf of Mayday's Dutch funder, questioned what had happened to money and met with Le Mesurier in Istanbul on 7 November (three days before his death). Le Mesurier reportedly offered his resignation. The Foundation's donors requested a forensic audit. Mayday's new financial director raised a number of issues around accounting practices at the Foundation but most were dismissed in May 2020 by forensic audit experts from [Grant Thornton](/wiki/Grant_Thornton_International). Grant Thornton concluded that \"the key finding of our investigation of the flagged transactions leads us to believe that there is no evidence of misappropriation of funds. For the most part we have been able to refute (sic) the alleged irregularities. (…) In particular, the cash withdrawals by James Le Mesurier and Emma Winberg (who took advances against her salary and a loan to pay for their wedding) were accounted for\". The audit highlighted that \"book keeping was sloppy\" in Mayday, but argued that in the complex war-time environment where the organization was operating these were understandable, and the leadership was able to ensure transparency and \"high integrity\" of its operations. In July 2020, after Le Mesurier's death, Dutch newspaper *[de Volkskrant](/wiki/De_Volkskrant)* published an article revealing that the Netherlands had investigated the Mayday Rescue Foundation for fraud; the publications *[Der Spiegel](/wiki/Der_Spiegel)* and *[De Groene Amsterdammer](/wiki/De_Groene_Amsterdammer)* challenged the accuracy of the reporting and questioned the sources used, and *Der Spiegel* claimed that *[The Guardian](/wiki/The_Guardian)* and [BBC](/wiki/BBC) had rebutted its core allegations. ## Personal life Le Mesurier was married three times; the first two marriages, to Aurelie Marle, and to Sarah Tosh with whom he had two daughters, ended in divorce. In 2018, he married Emma Winberg, who was a director of Mayday Rescue and was formerly a [Foreign and Commonwealth Office](/wiki/Foreign_and_Commonwealth_Office) diplomat. ## Death On 11 November 2019, Le Mesurier was found dead in the street at 4:30 in the morning (1:30 GMT) in the Kemankeş Kara Mustafa Paşa neighbourhood of [Beyoğlu](/wiki/Beyo%C4%9Flu), Istanbul, as a result of what appeared to have been a fall from his balcony. Le Mesurier was found with fractures to his head and legs. Le Mesurier's wife said they had only gone to bed a short while earlier at 4 a.m., taking sleeping tablets. Later *[The Times](/wiki/The_Times)* reported that the [Turkish police](/wiki/Turkish_police) were treating the death as [suicide](/wiki/Suicide), based on information from Le Mesurier's wife and his recent medical history, and that no forensic, autopsy or CCTV evidence indicated otherwise. On 14 November 2019, Le Mesurier's body was repatriated to London, while the Turkish investigation continued. At the time of his death, it was reported by *[The Independent](/wiki/The_Independent)* and *[PBS NewsHour](/wiki/PBS_NewsHour)* that the President of Syria, [Bashar al-Assad](/wiki/Bashar_al-Assad) said Le Mesurier had been murdered by Western intelligence services coordinated by the [Central Intelligence Agency](/wiki/Central_Intelligence_Agency). The television news in Moscow claimed his death was a \"purely English murder\" by his \"MI6 handlers\". A month later, the Turkish authorities confirmed the injuries he sustained were consistent with a fall from the balcony, according to the [post mortem](/wiki/Post_mortem), \"general body trauma linked to a fall from height\". No [DNA](/wiki/DNA) from other individuals was found. A [toxicology](/wiki/Toxicology) report, according to a private Turkish broadcaster [NTV](/wiki/NTV_(Turkish_TV_channel)), found signs of sleeping pills in Le Mesurier's body matching the statement from his widow. On 2 March 2020 Turkish prosecutors closed their investigation, with the death ruled as a suicide. His widow was released from her restriction on leaving Turkey. - \"Why no-one could save the man who co-founded the White Helmets\" ([Podcast](/wiki/Podcast) & text). *[BBC Radio](/wiki/BBC_Radio)*. Intrigue. 6 November 2020. - Shannon Van Sant, Death in Istanbul, [Politico](/wiki/Politico), April 2023\n",
  "language": "en",
  "processed_at": "2026-01-12T11:13:36.280244",
  "title": "James Le Mesurier",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/James_Le_Mesurier"
}