{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:13:34.307230"
  },
  "content": "Former Singaporean civil servant **James Koh Cher Siang** [PJG](/wiki/Pingat_Jasa_Gemilang) [PPA(E)](/wiki/Pingat_Pentadbiran_Awam) (born 5 February 1942) is a Singaporean former civil servant and he was the chairman of the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) (1981–1987) and the [Housing and Development Board](/wiki/Housing_and_Development_Board) (2007–2016). Koh served as a director of [DBS Bank](/wiki/DBS_Bank) (1981–1996), [National Kidney Foundation](/wiki/National_Kidney_Foundation_Singapore) (2005–2007), [Singapore Airlines](/wiki/Singapore_Airlines) (2005–2011), [United Overseas Land](/wiki/UOL_Group) (2005–2012), [CapitaMall Trust](/wiki/CapitaLand) (2009–2013) and [United Overseas Bank](/wiki/United_Overseas_Bank) (2012–2021). ## Early life and education On 5 February 1946, Koh was born, and his family lived in a shophouse on Fisher Street, located in [Clarke Quay](/wiki/Clarke_Quay). His father left his first wife and two children and migrated to [Singapore](/wiki/Singapore) from [China](/wiki/China). Working as a shopkeeper, his father sold souvenirs in his own shop along [Change Alley](/wiki/Change_Alley,_Singapore). His mother was the second wife, and Koh had two other siblings — a brother and a sister. In 1952, Koh and his family moved to a government flat built by the [Singapore Improvement Trust](/wiki/Singapore_Improvement_Trust), located on Kim Pong Road in [Tiong Bahru](/wiki/Tiong_Bahru). Koh received his early education at Tiong Bahru Primary School, and later [Outram Secondary School](/wiki/Outram_Secondary_School), where he graduated with a School Certificate of Commercial Education of the [London Chamber of Commerce and Industry](/wiki/London_Chamber_of_Commerce_and_Industry). As Koh could not progress to university with his current qualifications, he worked as a [stenographer](/wiki/Stenographer) at the [East Asiatic Company](/wiki/EAC_Invest_A/S), while taking night classes at the Adult Education Board (now merged to form the [Institute of Technical Education](/wiki/Institute_of_Technical_Education)) to obtain a [Senior Cambridge](/wiki/Senior_Cambridge). Eventually, Koh studied at [Raffles Institution](/wiki/Raffles_Institution). In 1966, Koh was chosen by the [Public Service Commission](/wiki/Public_Service_Commission_(Singapore)) as one of the first nine [President's Scholars](/wiki/President%27s_Scholar),[a] after Singapore gained independence in 1965. Koh enrolled into the [University of Oxford](/wiki/University_of_Oxford), and studied in the [Balliol College](/wiki/Balliol_College,_Oxford). In 1969, he graduated with a [Bachelor of Arts](/wiki/Bachelor_of_Arts) in [politics, philosophy and economics](/wiki/Politics,_philosophy_and_economics). In 1973, Koh graduated from the University of Oxford with a [Master of Arts](/wiki/Master_of_Arts) in politics, philosophy and economics, and in 1974, he graduated with a [Master of Public Administration](/wiki/Master_of_Public_Administration) from [Harvard University](/wiki/Harvard_University). ## Career ### Early career In 1969, Koh began his career in the economic planning unit of the [Ministry of Finance](/wiki/Ministry_of_Finance_(Singapore)), and his supervisors were [Ngiam Tong Dow](/wiki/Ngiam_Tong_Dow) and Bernard Chen Tian Lap. Shortly after, Koh was promoted to head the manpower planning unit of the ministry, looking into the training programmes required for Singaporean workers to upgrade their skills. In 1971, Koh was promoted once again, becoming the assistant director of the economic planning unit. Upon his return to Singapore in 1974, Koh continued to work in the economic planning unit, overseeing economic plans and policies. Soon after, Koh was transferred to the [Ministry of National Development](/wiki/Ministry_of_National_Development_(Singapore)) (MND), serving as its principal assistant secretary. Koh was involved in projects such as the resettlement of farmers located in [Lim Chu Kang](/wiki/Lim_Chu_Kang) and [Punggol](/wiki/Punggol), and the construction of [Benjamin Sheares Bridge](/wiki/Benjamin_Sheares_Bridge). In 1977, Koh returned to the economic planning unit, and concurrently served as the deputy secretary in the [Prime Minister's Office](/wiki/Prime_Minister%27s_Office_(Singapore)). ### Urban Redevelopment Authority (1979–1987) In February 1979, Koh was appointed as permanent secretary for MND and acting chairman of the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) (URA). In March 1979, [Teh Cheang Wan](/wiki/Teh_Cheang_Wan) appointed Koh as deputy chairman of the [Housing and Development Board](/wiki/Housing_and_Development_Board) (HDB). In April 1981, Koh was promoted to chairman of URA and announced plans to redevelop the [Central Business District](/wiki/Downtown_Core). On 19 April 1983, to develop projects such as the Jurong Expressway (now known as [Ayer Rajah Expressway](/wiki/Ayer_Rajah_Expressway)), Koh signed an agreement with Malaysian Transport Ministry secretary general Ishak Tadin to release 15.3 ha (38 acres) of land owned by the [Keretapi Tanah Melayu](/wiki/Keretapi_Tanah_Melayu) to Singapore. In July 1984, Koh announced an [S$](/wiki/Singapore_dollar)8 million exhibition to showcase 25 years of nation-building, and said the show is \"one of the biggest, if not the biggest\" ever to be held in Singapore. On 1 February 1987, following the death of Teh Cheang Wan, Koh remained as the second permanent secretary for MND, while Ngiam Tong Dow took over as the first permanent secretary for the ministry. On 1 May 1987, Koh was succeeded by Khoo Cheng Lim as chairman of URA. During a farewell dinner for Koh, [Liu Thai Ker](/wiki/Liu_Thai_Ker), deputy chairman of URA, praised Koh for leading URA through its \"golden age\". On 15 July 1987, Koh was transferred to become permanent secretary for the [Ministry of Community Development](/wiki/Ministry_of_Community_Development,_Youth_and_Sports). On 23 December 1987, Koh was one of the founding members of the Tote Board, along with three other individuals.[b] ### Later career On 1 June 1994, Koh swapped portfolios with Er Kwong Wah of the [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)). During an interview with *[The Straits Times](/wiki/The_Straits_Times)* in 1995, Koh advocated for teachers to be equipped with [21st century skills](/wiki/21st_century_skills) and be prepared for the future. On 1 April 1997, Koh left MOE to become the commissioner of the [Inland Revenue Authority of Singapore](/wiki/Inland_Revenue_Authority_of_Singapore), succeeding [Koh Yong Guan](/wiki/Koh_Yong_Guan). Koh retired on 1 July 2005. On 1 October 2007, Koh took over as chairman of the [Housing and Development Board](/wiki/Housing_and_Development_Board) from [Aline Wong](/wiki/Aline_Wong), after serving as its deputy chairman since July 2005. He was succeeded by [Bobby Chin Yoke Choong](/wiki/Bobby_Chin_Yoke_Choong) on 30 September 2016. ## Personal life Koh and his wife, Lucia Tang Nguk Kee, have two sons and a daughter. His wife died on 10 May 2003. Koh plays [golf](/wiki/Golf), and he took part in competitions against his Malaysian counterparts throughout his career. ## Awards and decorations - [Meritorious Service Medal](/wiki/Pingat_Jasa_Gemilang), in 2002. - [Public Administration Medal (Gold)](/wiki/Pingat_Pentadbiran_Awam), in 1983. ## Notes\n",
  "language": "en",
  "processed_at": "2026-01-12T11:13:34.306729",
  "title": "James Koh Cher Siang",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/James_Koh_Cher_Siang"
}