{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:13:38.116229"
  },
  "content": "Singaporean companyThis article **is an orphan, as no other articles link to it**. Please introduce links to this page from related articles. *(December 2025)* **JamiQ** Private Limited is a [Singapore](/wiki/Singapore)-based [social media](/wiki/Social_media) [monitoring](/wiki/Media_monitoring_service) company. The company was founded by Kelvin Quee, Lee Jia Yi, and Benjamin Koe in September 2008, initially incubated with NTU Ventures. JamiQ's software uses algorithms that can understand the opinions and feelings inferred from phrases and sentences. It processes English words and denotes a positive or negative value to them. JamiQ's software also uses search engines, APIs, RSS feeds, and web crawlers to monitor social media in real-time. It specializes in monitoring Asian social media. ## Products JamiQ offers a variety of products. ### JamiQ Social Media Monitoring JamiQ's flagship product is its automated and localised social media monitoring and measurement solution that provides coverage of social media in any language. Data mining methods and natural language processing technology are used to produce real-time buzz trending, sentiment detection, influence scoring, and market segmentation. Unlike other similar services based in the US that do not cover local markets in local languages, JamiQ offers reach and coverage of all languages and markets and does so in every language for Asia and other multilingual/segmented market regions. Algorithms developed by JamiQ can determine the location of a blog/site even if it is not hosted locally. ### ReputationWatch ReputationWatch is a reputation management service for small and medium-sized businesses and it is a collaboration between JamiQ and Singapore telecommunications company, Singapore Telecommunications (SingTel). Email alerts about local and relevant conversations on new sites and social media platforms such as blogs, forums, social networks and microblogs worldwide are sent to users. It is built on JamiQ’s social media monitoring technology to allow businesses to track real-time online conversations about their brands in their local market and it is only available on SingTel’s myBusiness Cloud Computing portal in Singapore. ## Notable Implementations ### Singapore General Elections Tracker 2011 Data visualisation company, Swarm, collaborated with JamiQ to launch the Singapore General Elections 2011 Tracker. The visualisation chart displayed top mentioned keywords and trending topics discussed online, along with the most shared articles circulated on the web. The tracker aggregates news articles and blog posts from Google and Twitter data. - jamiq.com\n",
  "language": "en",
  "processed_at": "2026-01-12T11:13:38.115799",
  "title": "JamiQ",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/JamiQ"
}