{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:13:46.329616"
  },
  "content": "Ethnic groupPart of a series on[Singaporeans](/wiki/Demographics_of_Singapore) - [Arabs](/wiki/Arab_Singaporeans) - [Armenians](/wiki/Armenians_in_Singapore) - [Australians](/wiki/Australians_in_Singapore) - [Burmese](/wiki/Burmese_people_in_Singapore) - [Chinese](/wiki/Chinese_Singaporeans) - [Peranakans](/wiki/Peranakans) - [PRC](/wiki/Chinese_nationals_in_Singapore) - [Chitty](/wiki/Chitty) - [Eurasians](/wiki/Eurasian_Singaporeans) - [Filipinos](/wiki/Filipinos_in_Singapore) - [Indians](/wiki/Indian_Singaporeans) - Japanese - [Jawi Peranakan](/wiki/Jawi_Peranakan) - [Jews](/wiki/History_of_the_Jews_in_Singapore) - [Koreans](/wiki/Koreans_in_Singapore) - [Malays](/wiki/Malay_Singaporeans) - [Nepalis](/wiki/Nepalis_in_Singapore) - [Pakistanis](/wiki/Pakistanis_in_Singapore) - [Sri Lankans](/wiki/Sri_Lankans_in_Singapore) - [Tamils](/wiki/Singapore_Tamils) - [Thais](/wiki/Thais_in_Singapore) - [Vietnamese](/wiki/Vietnamese_in_Singapore) - v - t - e The **Japanese people in Singapore** (在シンガポール日本人, *Zai Shingapōru Nihonjin*), consists either of corporate employees and their families, permanent residents, or Singaporeans of Japanese descent. The first Japanese person to settle in [Singapore](/wiki/Singapore) was [Yamamoto Otokichi](/wiki/Otokichi), who arrived in 1862. Larger-scale migration from Japan to Singapore is believed to have begun in the early 1870s, shortly after the [Meiji Restoration](/wiki/Meiji_Restoration). ## Migration history ### Colonial era Singapore's first resident of Japanese origin is believed to be [Yamamoto Otokichi](/wiki/Otokichi), from [Mihama, Aichi](/wiki/Mihama,_Aichi). In 1832, he was working as a crewman on a Japanese boat which was caught in a storm and drifted across the Pacific Ocean; after a failed attempt to return home, he began to work for the British government as an interpreter. After earning [British citizenship](/wiki/British_nationality_law), he settled in Singapore in 1862. He died five years later and was buried there. Most early Japanese residents of Singapore consisted of prostitutes, who would later become known by the collective name of \"*[karayuki-san](/wiki/Karayuki-san)*\". The earliest Japanese prostitutes are believed to have arrived 1870 or 1871; by 1889, there were 134 of them. From 1895 to 1918, Japanese authorities turned a blind eye to the emigration of Japanese women to work in brothels in Southeast Asia. According to the Japanese consul in Singapore, almost all of the 450 to 600 Japanese residents of Singapore in 1895 were prostitutes and their pimps, or concubines; fewer than 20 were engaged in \"respectable trades\". In 1895, there were no Japanese schools or public organisations, and the Japanese consulate maintained only minimal influence over their nationals; brothel owners were the dominating force in the community. Along with victory in the [Sino-Japanese War](/wiki/First_Sino-Japanese_War), the Japanese state's increasing assertiveness brought changes to the official status of Japanese nationals overseas; they attained formal legal equality with Europeans. That year, the Japanese community was also given official permission by the government to create [their own cemetery](/wiki/Japanese_Cemetery_Park), on twelve acres of land in [Serangoon](/wiki/Serangoon) outside of the urbanised area; in reality, the site had already been used as a burial ground for Japanese as early as 1888. Even with these changes in their official status, the community itself remained prostitution-based. Prostitutes were the vanguard of what one pair of scholars describe as the \"karayuki-led economic advance into Southeast Asia\". It was specifically seen by the authorities as a way to develop a Japanese economic base in the region; profits extracted from the prostitution trade were used to accumulate capital and diversify Japanese economic interests. The prostitutes served as both creditors and customers to other Japanese: they loaned out their earnings to other Japanese residents trying to start businesses, and patronised Japanese tailors, doctors, and grocery stores. By the time of the [Russo-Japanese War](/wiki/Russo-Japanese_War), the number of Japanese prostitutes in Singapore may have been as large as 700. They were concentrated around Malay Street (now [Middle Road](/wiki/Middle_Road,_Singapore)). However, with Southeast Asia cut off from European imports due to [World War I](/wiki/World_War_I), Japanese products began making inroads as replacements, triggering the shift towards retailing and trade as the economic basis of the Japanese community. Singapore abolished licensed Japanese prostitution in 1921. This was part of a larger governmental plan to entirely end legalised prostitution throughout the Malay Peninsula. In spite of the ban, many attempted to continue their profession clandestinely; however, both the Singaporean and Japanese governments made efforts to clamp down on the trade. By 1927, there remained roughly 126 independent Japanese prostitutes. Most eventually left Singapore or moved on to other trades. Their departure coincided with a significant shift in the composition of the Japanese population there: the businesses they patronised, such as tailors and hairdressers, run largely by Japanese men, also shut their doors, and their proprietors left as well, to be replaced by salaried employees working in Japanese trading firms. Only 14 Japanese men worked in such professions in 1914, but by 1921 there were 1,478. The shift would continue in the following decade: in 1919, 38.5% of Japanese in Singapore were commodity merchants and 28.0% company and bank employees, but by 1927, these proportions had shifted sharply, to 9.7% merchants and 62.9% employees. The Japanese population would peak in 1929 and then decline until 1933, as a result of the world-wide [Great Depression](/wiki/Great_Depression). However, it would recover somewhat after that, aided by [devaluation](/wiki/Devaluation) of the yen and the consequent increase in competitiveness of Japanese products in Southeast Asian markets. Even as other Japanese businesses suffered declines, the number of fishermen grew, from a small base of about 200 individuals in 1920 to a peak of 1,752 in 1936, accounting for between one-quarter and one-third of the resident Japanese population throughout the 1930s. ### World War II and aftermath All Japanese, whether civilian or military, were repatriated to Japan in 1947. Without anyone to maintain it, the Japanese cemetery fell into disrepair. Graves were damaged due to the tropical climate as well as mistreatment by squatters and vandals. Japanese people returned to Singapore only slowly after the war. A few Japanese were issued landing permits in 1948 and 1949, but until 1953, the only Japanese permitted to reside in the country were diplomats and their families. Other Japanese could only be issued landing permits of a maximum validity of two months. However, in the latter half of the 1950s, the restrictions on the entry of Japanese nationals were relaxed, and Japanese trading firms again set up offices in Singapore. The first post-war Japanese residents association, the Japanese Club, was founded in 1957 specifically with the aim of restoring the Japanese cemetery. ### Independence era The Japanese community began to show significant growth again in the early 1970s, as Japanese businesses shifted manufacturing activities out of Japan into Southeast Asia. Since the mid-1980s, the vast majority of Japanese expatriates come to Singapore as families, with the father employed as a manager or engineer, while the wife [stays at home with the children](/wiki/Stay_at_home_mom). A few men come without their families (a practise referred to in Japanese as *tanshin funin*). Within the Japanese community, single women tend to be \"doubly marginised\": both at the office by Japanese businessmen's restrictive views of the role of women in the workplace, and in social life by the wives of those same businessmen. Single Japanese women generally try to minimise their contacts with married Japanese women, even when the two live in the same neighbourhoods. The Japanese Association, Singapore (JAS) was established in 1915 and re-established in 1975 to promote exchange and interactions between Japanese and Singaporeans. Japan became the top foreign investor in Singapore in 1986. In 1988, over 15,000 Japanese work for 600 Japanese companies in Singapore. ## Education The Japanese community of Singapore are served by a number of Japanese-medium educational institutions, including a 400-student kindergarten, a 1,900-student primary school, a 700-student junior high school, and a 500-student senior high school, as well as twelve *[juku](/wiki/Juku)* (cram schools) to prepare them for [university entrance exams](/wiki/Higher_education_in_Japan#College_entrance). The schools are situated near Japanese neighbourhoods, and all of the student body and staff are Japanese nationals. Only a small minority of Japanese families send their children to non-Japanese [international schools](/wiki/International_school). [The Japanese School Singapore](/wiki/The_Japanese_School_Singapore) serves elementary and junior high students and the [Waseda Shibuya Senior High School in Singapore](/wiki/Waseda_Shibuya_Senior_High_School_in_Singapore) (formerly Shibuya Makuhari Singapore School) serves high school students. Both schools hold annual festivals open to members of the public who are interested in Japanese culture. The Japanese Supplementary School Singapore (シンガポール日本語補習授業校, *Shingapōru Nihongo Hoshū Jugyō Kō*; JSS), a [supplementary programme](/wiki/Hoshuko), also operates in Singapore. ## Religion A [Tenrikyo](/wiki/Tenrikyo) church was established by Japanese residents in Singapore in 1922. Their social volunteer work, especially with the handicapped, has been credited with helping to restore Japanese people's reputation in the eyes of [Chinese Singaporeans](/wiki/Chinese_Singaporean), badly damaged by atrocities during the [Japanese occupation of Singapore](/wiki/Japanese_occupation_of_Singapore). However, Tenrikyo remains largely a religion of the Japanese in Singapore, not of average Singaporeans. Its association with [Shinto](/wiki/Shinto) has proven a disadvantage in attempts to spread it beyond the Japanese community. Tenrikyo's main \"rival\" in Singapore is the [Buddhist](/wiki/Buddhism) organisation [Sōka Gakkai](/wiki/S%C5%8Dka_Gakkai). Originally, its following was also restricted to the Japanese community. However, it has had more success in outreach to local people, especially the ethnic Chinese community. ## Leisure As with Japanese in other countries, golf is a popular leisure activity among Japanese businesspeople in Singapore. As the Japanese community in Singapore grew in the 1970s, they applied political pressure to promote the upgrading of existing golf courses and development of new ones. Though other expatriates, as well as members of the local upper-middle-class, also spoke out in support of the improvement of golfing facilities in Singapore, generally the Japanese were described as making the most forceful demands. Japanese membership in golf associations grew so quickly that many established quotas on the number of foreign members with the express purpose of preventing their \"inundation\" with Japanese expatriate and tourists and also established a two-track pricing system, with higher prices for foreigners than locals. Due to the expense of playing golf in Singapore, lower-level Japanese personnel tend to head to neighbouring countries in search of cheaper green fees. Other popular leisure pursuits include tennis, football, swimming, [Mandarin](/wiki/Chinese_as_a_foreign_language) and [English language training](/wiki/English_as_a_foreign_language) as well as [cooking classes](/wiki/Cooking_school). ## Notable people - [Ghib Ojisan](/wiki/Ghib_Ojisan), Japanese travel YouTuber based in Singapore (Originally from [Osaka Prefecture, Japan](/wiki/Osaka_Prefecture,_Japan)) - [Jane Ittogi](/wiki/Jane_Ittogi) (Also known as Mrs. Tharman), [First Lady of Singapore](/wiki/First_Lady_of_Singapore) as wife to President [Tharman Shanmugaratnam](/wiki/Tharman_Shanmugaratnam), lawyer by training and has held leadership positions across art and heritage institutions in Singapore. - [Gurmit Singh](/wiki/Gurmit_Singh), Singaporean actor and television personality, best known for playing Phua Chu Kang in [Phua Chu Kang Pte Ltd](/wiki/Phua_Chu_Kang_Pte_Ltd). - [Junki Kenn Yoshimura](/wiki/Junki_Kenn_Yoshimura), Singaporean footballer currently playing as a right-midfielder for Albirex Niigata (S). - [Kimura Riki](/wiki/Kimura_Riki), Singaporean footballer currently playing as a goalkeeper for Tanjong Pagar United. - [Namiko Chan Takahashi](/wiki/Namiko_Chan_Takahashi), Singaporean contemporary artist. - [Yuumi Kato](/wiki/Yuumi_Kato), winner of [Miss Universe Japan](/wiki/Miss_Universe_Japan) 2018, who lived in Singapore until she was 13 years old (Originally from [Nagoya, Aichi](/wiki/Nagoya,_Aichi), [Japan](/wiki/Japan)) - [Middle Road, Singapore](/wiki/Middle_Road,_Singapore) - [Japan–Singapore relations](/wiki/Japan%E2%80%93Singapore_relations) ### Sources - Ben-Ari, Eyal (1996). *Globalization, 'folk models' of the world order and national identity: Japanese business expatriates in Singapore*. Occasional Papers. Vol. 18. Social Sciences Resource Centre, University of Hong Kong. [ISBN](/wiki/ISBN_(identifier)) 978-962-7558-21-7. - Thang, Leng Leng; MacLachlan, Elizabeth; Goda, Miho (September 2002). \"Expatriates on the margins––a study of Japanese women working in Singapore\". *Geoforum*. **33** (4): 539–551. [doi](/wiki/Doi_(identifier)):10.1016/S0016-7185(02)00042-8. - Thang, Leng Leng; Goda, Miho; MacLachlan, Elizabeth (2004). \"Challenging the Life Course: Japanese Women Working in Singapore\". In Thang, Leng Leng; Yu, Wei-hsin (eds.). *Old Challenges, New Strategies? Women, Work and Family in Contemporary Asia*. Leiden: Brill. [ISBN](/wiki/ISBN_(identifier)) 978-90-04-13732-5. - Chew, Daniel Kai Mun; Thang, Leng Leng (2006). \"The Japanese Kindergarten of Singapore: 'internalisation' and 'internationalisation'\". In Tsu, Yun-hui (ed.). *Japan and Singapore: A Multidisciplinary Approach*. Singapore: McGraw Hill. [ISBN](/wiki/ISBN_(identifier)) 978-0-07-125623-0. - Nakazawa, Takashi; Yui, Yoshimichi; Kamiya, Hiroo; Takezada, Yuko (March 2008). 海外就職の経験と日本人としてのアイデンティティ : シンガポールで働く現地採用日本人女性を対象に [Experience of International Migration and Japanese Identity: A Study of Locally Hired Japanese Women in Singapore]. *Geographical Review of Japan* 地理学評論 (in Japanese). **81** (3): 95–120. [doi](/wiki/Doi_(identifier)):10.4157/grj.81.95. [ISSN](/wiki/ISSN_(identifier)) 1347-9555. Archived from the original on 16 June 2017. Retrieved 21 October 2009. - Thang, Leng Leng; Goda, Miho; MacLachlan, Elizabeth (2009). \"Negotiating work and self: Experiences of Japanese working women in Singapore\". In Adachi, Nobuko (ed.). *Japanese Diasporas: Unsung Pasts, Conflicting Presents and Uncertain Futures*. London: Routledge. [ISBN](/wiki/ISBN_(identifier)) 978-0-415-49745-9. - Ng, Benjamin Wai-Ming (吳偉明) (March 2002). \"The Japanese Community in Singapore : A Comparative Study of the Japanese Association and the Kowloon Club\". *Senri Ethnological Studies* (62). [National Museum of Ethnology, Japan](/wiki/National_Museum_of_Ethnology,_Japan): 75–92. - Singapore Japanese School - The Japanese Association, Singapore - Japan Creative Center (JCC) Portals: - Japan - Singapore\n",
  "language": "en",
  "processed_at": "2026-01-12T11:13:46.329044",
  "title": "Japanese people in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Japanese_people_in_Singapore"
}