{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:13:40.218174"
  },
  "content": "Cemetery park in SingaporeThis article's **tone or style may not reflect the encyclopedic tone used on Wikipedia**. See Wikipedia's guide to writing better articles for suggestions. *(September 2022)* *(Learn how and when to remove this message)* The **Japanese Cemetery Park** ([Japanese](/wiki/Japanese_language): 日本人墓地公園; [rōmaji](/wiki/R%C5%8Dmaji): *Nihonjin bochi kōen*) is a cemetery and memorial park in [Hougang](/wiki/Hougang), [Singapore](/wiki/Singapore). Covering an area of 29,359 square metres, it is the largest Japanese cemetery in Southeast Asia and contains 910 tombstones. The cemetery servers as the final resting place for members of the [Japanese community in Singapore](/wiki/Japanese_expatriates_in_Singapore), including civilians, soldiers, and individuals who were executed as [war criminals](/wiki/Japanese_war_crimes) at [Changi Prison](/wiki/Changi_Prison), as well as others who were involved in the wartime sex trade. The site was [gazetted](/wiki/Gazette) as a memorial park by the Singapore government in 1987. ## History In 1891, The Japanese brothel owner, Tagajiro Fukaki, donated 7 acres (2.8 ha) of his rubber plantation to be used as a burial ground for young Japanese women who died in [destitution](/wiki/Destitution). Together with other fellow brothel owners Shibuya Ginji and Nakagawa Kikuzo, Fukaki applied for permission, which was granted by the British colonial government 26 June 1891. Since then, the cemetery has become the final resting place for Japanese residents in Singapore. ### World War II and aftermath During [World War II](/wiki/World_War_II), the cemetery was used to bury civilians and soldiers who had died either on the battlefield or from illness. Following Japan's defeat, the British [repatriated](/wiki/Repatriated) all Japanese nationals from Singapore in 1948, no Japanese were allowed back into Singapore or Malaya for fear of their war past. The Singapore government then took over of the cemetery, which remained disused for several years. This policy persisted until the signing of the Official Peace Treaty with Japan in 1951. ### Post-war developments In November 1952, Ken Ninomiya, the first post-war Japanese [Consul-General](/wiki/Consul-General) to Singapore, was tasked to find out the fate of Japanese war remains in Singapore. After locating the remains, the intention was to repatriate the ashes of the dead. However, the Japanese government later decided against relocating the remains to a separate cemetery or repatriating the ashes. This decision was because the surrendered Japanese personnel had put so much effort into erecting a [memorial](/wiki/Memorial) in the cemetery for their fallen comrades. Additionally, the ashes had been interred in a single mound, making identification impossible. ### Return of ownership and modern era In 1969, the Singapore government handed back ownership of the cemetery to the reformed Japanese Association, which oversees the maintenance of the cemetery. Burials continued until 1973 when the Singapore government passed an ordinance preventing the further expansion of the 42 cemeteries on the island. ## Notable graves ### Yamamoto Otokichi [Yamamoto Otokichi](/wiki/Yamamoto_Otokichi), also known as \"John Matthew Ottoson\", was born in Onoura Villageint Chita District of Owari (now Mihama Town of [Aichi Prefecture](/wiki/Aichi_Prefecture)) in 1818. In 1832, he was a sailor on board the ship \"Hojun-maru\", which sailed from [Ise Bay](/wiki/Ise_Bay) to Tokyo. The ship drifted out of the sea at Toba in a storm. Otokichi managed to survive the disaster and was washed ashore at [Cape Alava](/wiki/Cape_Alava) on the west coast of the United States after one year and two months. He eventually travelled around the world but Japan's isolationist policy at that time denied his return to his home country. Even after being rejected by his home country, he stayed proud to be a Japanese and helped to promote the opening of the country. He later became a successful trader. In 1862, Otokichi moved from Shanghai and stayed in Singapore with his Malay wife to become the first Japanese resident here. He died at the age of 49 in 1867. In February 2004, Leong Foke Meng of the [Singapore Land Authority](/wiki/Singapore_Land_Authority) (SLA), with the help of the [National Environment Agency](/wiki/National_Environment_Agency) (NEA), helped to uncover facts confirming Otokichi's remains at the [Choa Chu Kang](/wiki/Choa_Chu_Kang) Government Cemeteries. On 27 November 2004, Leong, together with Mihama Town and the Japanese Association, initiated the exhumation of Otokichi's remains at the Choa Chu Kang Christian Cemetery. The remains were later cremated and ashes were stored at the columbarium of the Japanese Cemetery. On 17 February 2005, a delegation of about 100 residents from Mihama Town visited Singapore and brought back to Japan a portion of Otokichi's ashes, realizing the homecoming of Otokichi's remains after 173 years. ### Japanese war memorials Before their repatriation in 1947, the surrendered Japanese prisoners of war who were used as manual laborers by the British took it upon themselves to commemorate their war dead. A group of them decided to clean up the cemetery and set up [Hisaichi Terauchi](/wiki/Hisaichi_Terauchi)'s tombstone in the eastern corner of the cemetery and three tombstones in the western corner of the cemetery with this inscription: > In memory of the souls of the Labour Force comprising Army and Navy personnel who died in Singapore between September 1945 and April 1947. Their work remained undisturbed by the British authorities as they could not read the Japanese inscriptions on the memorials and were too busy rebuilding the city. Behind this memorial, the ashes of 10,000 Japanese war dead collected mainly from the destroyed Syonan Chureito (now the [Bukit Batok Memorial](/wiki/Bukit_Batok_Memorial)) were put into a hole that was sealed with concrete. Terauchi's tombstone and three other distinctive memorials in the cemetery were completed by three Japanese prisoners-of-war—carpenter Kunio Higashituji, and stonemasons Tomokatsu Mizuya and Tokiyaki Tetsuka—in April 1947. There is a small concrete pillar known as *A memorial to the ashes of 135 martyrs*, which marks the spot where the ashes of the 135 Japanese officers and men who were executed at Changi Prison are buried. A similar pillar on another corner of the west end marks the burial spot of the ashes of 79 Japanese who were executed in Malaysia. ### Terauchi Hisaichi Born in 1879, [Terauchi Hisaichi](/wiki/Terauchi_Hisaichi) was the son of [Terauchi Masatake](/wiki/Terauchi_Masatake), the 18th Japanese prime minister and a close relative of the emperor [Hirohito](/wiki/Hirohito). He attended the Japanese Military Academy and after graduating in 1900 joined the Japanese Army. Terauchi spent time in Germany and worked as a lecturer at the Military Academy before taking command of the 5th Division and the Chief of Staff of the Korean Army, and later as the head of the Formosa Army. In October 1935, he was promoted to General and in 1937 was appointed War Minister. Terauchi commanded the North China Area Army before becoming the Commander of the Southern Army on 6 November 1941 – the Japanese equivalent to the British [South East Asia Command](/wiki/South_East_Asia_Command) – and devising strategies with [Isoroku Yamamoto](/wiki/Isoroku_Yamamoto). After leading the conquest of the Southern Area, he established his headquarters in Singapore. Promoted to field marshal, he moved to the Philippines in May 1944. When this area came under threat he retreated to Saigon. After receiving news of Japanese reversals in Burma, he suffered a stroke on 10 April 1945. As a consequence, when the Japanese surrendered in Singapore on 12 September 1945 to the Allied forces led by [Louis Mountbatten](/wiki/Louis_Mountbatten) they were represented by [Itagaki Seishiro](/wiki/Itagaki_Seishiro), commander of the 7th Area Army. After the formal surrender, Terauchi, on learning that Mountbatten had expressed a wish to have his two [samurai swords](/wiki/Samurai_sword), flew from [Saigon](/wiki/Ho_Chi_Minh_City) to Singapore to present them in person. Terauchi was accused of war crimes and was imprisoned in [Johor](/wiki/Johor), Malaysia, pending investigations by the British, until his death in June 1946. His remains were cremated and some of his ashes are believed to be buried at the park. The inscription on his tombstone reads: > Southern Troop Commander General Terauchi, built by the Southern Troops Work Team in April 1947. ### Hinomoto's Guardian Deity Located near the main entrance, this memorial was built in memory of 41 Japanese civilians who died in the internment camp at [Jurong](/wiki/Jurong) while waiting for repatriation after the Japanese surrender in World War II. ### Tani Yutaka [Tani Yutaka](/wiki/Tani_Yutaka), known as Harimao (ハリマオ) in Japanese, which was derived from \"Harimau\" ([Malay](/wiki/Malay_language) for \"tiger\"), was a secret agent for the Japanese military who died in a hospital in Singapore. His life story has been depicted in novels and in a film titled *[Marai no Tora](/wiki/Marai_no_Tora)* (マライの虎; \"the Tiger of Malaya\"). \"Tiger of Malaya\" is just his nickname in Japan. It's not related to Sandokan's novels nor to Tomoyuki Yamashita (he was also called \"Marai no Tora\" in Japan). It is debatable that Tani Yutaka is the true \"Harimau Malaya\" or \"Tiger of Malaya\" and not [Tomoyuki Yamashita](/wiki/Tomoyuki_Yamashita). Tani Yutaka was born in Japan in 1910 and moved to Terengganu with his family when he was two. He is the son of a Japanese family which has their grocery shop in Hulu Terengganu or a barber shop. On a side note, [Sandokan](/wiki/Sandokan), or \"Tiger of Malaysia\" is fictional. ### Futabatei Shimei [Futabatei Shimei](/wiki/Futabatei_Shimei) (1864—1909) was a writer who first brought [realism](/wiki/Realism_(arts)) to Japanese literature. Fluent in Russian, he translated books written by realists, such as [Ivan Turgenev](/wiki/Ivan_Turgenev), into Japanese while working as a correspondent for the *[Asahi Shimbun](/wiki/Asahi_Shimbun)* in Russia. On his way home, he fell ill on board a ship and died en route. The structure is not a tomb, but a memorial. ### Ueyama Kantarō The tomb of Ueyama Kantarō, the first son of the inventor of the [mosquito coil](/wiki/Mosquito_coil), Ueyama Eiichirō, is a large and unique lantern-like monument. He died in 1942 when his plane crashed at Sembawang airport. ### Nagano Saneyoshi Another noteworthy occupant of the park is Nagano Saneyoshi, the founder of the Yamato Company in Tokyo. The company is known for manufacturing and selling stationery products. ### Karayuki-san In the second half of the 19th century, during the [Meiji era](/wiki/Meiji_era), many Japanese girls from poor households were taken to East Asia and Southeast Asia to work as prostitutes. Many of these women are said to have originated from the Amakusa Islands of Kumamoto Prefecture, which had a large and long-stigmatised Japanese Christian community.[*dubious – discuss*] Referred to as *[Karayuki-san](/wiki/Karayuki-san)* (唐行きさん; literally \"Ms. Gone-overseas\"), they were found at the Japanese enclave along Hylam, Malabar, Malay, and [Bugis Streets](/wiki/Bugis_Street) until World War II. ## Flora and heritage trees The Japanese Cemetery Park is home to several notable trees, including an old [lychee](/wiki/Lychee) tree, which is designated as a Heritage Tree by the [National Parks Board](/wiki/National_Parks_Board) (NParks). Despite the tropical climate, this tree does not bear fruit. Another old \"resident\" of the park is a rubber tree, which remains from the time when the area was a rubber plantation. ## Maintenance and care of the cemetery The Japanese Association of Singapore is responsible for maintaining the cemetery, which has been designated a memorial park since 1987. The park is valued for both its historical significance and its natural flora and fauna. It serves as a cultural and historical landmark, frequently visited by Japanese students, veterans, residents, and tourists. ### Role of the tomb keeper The cemetery's caretaker plays a key role in its upkeep and preservation. The current caretaker, Mani, is an Indian national who succeeded Lim Geok Qi, the previous tomb keeper, in 2018. Lim had served as the tomb keeper for over 50 years before his passing. ### Lim Geok Qi: the second-generation tomb keeper Lim was born in 1938 and spent most of his life in the cemetery. Lim's adoptive father, surnamed Weng, found difficulty finding work when he first arrived in Singapore from China but was soon recommended for a job as a tomb keeper at the Japanese Cemetery. Lim grew up in the cemetery assisting his father in cremating bodies and arranging burials. When the young Lim came of age, he tried to seek other forms of employment but in 1960, his father fell sick and requested him to take over his duties as tomb keeper. And so the young man in his 20s took over his father's duties to become the second-generation tomb keeper. Like his father, Lim was paid a minimal salary for the job, but given free accommodation and transportation. As he was thrifty, he was able to start his own family and expanded his living quarters when his family size grew. In 1973, new burials were not allowed, so Lim's main duties were to look after and maintain the Japanese cemetery, as well as serve as a cemetery guide for visitors from Japan. - Singapore portal - [Bukit Batok Memorial](/wiki/Bukit_Batok_Memorial) - [Japanese cemeteries and cenotaphs](/wiki/Japanese_cemeteries_and_cenotaphs) - [Middle Road, Singapore](/wiki/Middle_Road,_Singapore) - [Poh Ern Shih Temple](/wiki/Poh_Ern_Shih_Temple) ### Notes ### Bibliography\n",
  "language": "en",
  "processed_at": "2026-01-12T11:13:40.217709",
  "title": "Japanese Cemetery Park",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Japanese_Cemetery_Park"
}