{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:13:42.192758"
  },
  "content": "Park in Jurong East, Singapore **Japanese Garden** ([Japanese](/wiki/Japanese_language): 星和園, [romanized](/wiki/Romanization_of_Japanese): *Seiwa-en*, [Chinese](/wiki/Simplified_Chinese_characters): 星和园) is a [park](/wiki/Park) and [garden](/wiki/Garden) located in [Jurong East](/wiki/Jurong_East), Singapore. Built in 1974 by [JTC Corporation](/wiki/JTC_Corporation), it covers 13.5 hectares (135,000 m2) of land. It is built on an artificial island in [Jurong Lake](/wiki/Jurong_Lake) and is connected to the adjacent [Chinese Garden](/wiki/Chinese_Garden,_Singapore) island by bridge named the *Bridge of Double Beauty*. Along with the aforementioned Chinese Garden, the two gardens are collectively known as the **Jurong Gardens**. ## Layout and design Where the Chinese Garden is designed to be visually exciting, the Japanese Gardens are designed with a calmness to evoke inner peace and a meditative state. The styles and methods used for designing the garden are taken from Japan's [Muromachi period](/wiki/Muromachi_period) of 1392 to 1568 and the [Azuchi–Momoyama period](/wiki/Azuchi%E2%80%93Momoyama_period) of 1568 to 1615. With its traditional arched bridges, 10 odd [Tōrō](/wiki/T%C5%8Dr%C5%8D) stone lanterns, traditional house and rest house, ponds and gravel chipped pavings it faithfully recreates the traditional Japanese style. Along with the neighbouring Chinese Garden, it was extensively remodeled in 2019, and many of its original landscape features and buildings were demolished and replaced. ## Interests On the grounds is also a Turtle & Tortoise Museum as well as one of 10 [sundials](/wiki/Sundial) placed around Singapore to promote the interest in science. The one in the Japanese Garden represents the planet Venus (while the one in the Chinese Garden is for 'Earth'). Large [monitor lizards](/wiki/Monitor_lizard) can be seen roaming in the area of the [koi](/wiki/Koi) filled ponds. Cultural festivals such as Chinese New Year (usually January/February) and the Mid-Autumn Festival (September/October) are the best times to visit the gardens. - [Geography of Singapore](/wiki/Geography_of_Singapore) - [Japan–Singapore relations](/wiki/Japan%E2%80%93Singapore_relations) - Official website of the Jurong Lake Gardens 01°20′9.46″N 103°43′50.77″E﻿ / ﻿1.3359611°N 103.7307694°E﻿ / 1.3359611; 103.7307694 This Singapore-related article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:13:42.192179",
  "title": "Japanese Garden, Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Japanese_Garden,_Singapore"
}