{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:13:48.134966"
  },
  "content": "Agriculture and food corporation **Japfa Ltd** is a multinational agriculture and food corporation headquartered in [Singapore](/wiki/Singapore) with its origins and primary operations in [Indonesia](/wiki/Indonesia) (as **PT Japfa Comfeed Indonesia Tbk**), along with subsidiaries which operate in the rest of Asia. The company was founded in 1971, and listed at the [Jakarta Stock Exchange](/wiki/Jakarta_Stock_Exchange) and the [Singapore Stock Exchange](/wiki/Singapore_Stock_Exchange) in 1989 and 2014 respectively. Its business include animal feed alongside fish and poultry products. ## History The company's operations in Indonesia originated in 1959, when Ferry Teguh Santosa founded PT Ometraco as a diversified group. Japfa was founded in 1971 at [Surabaya](/wiki/Surabaya), as a joint venture between Ometraco and German firm Internationale Graanhandel Thegrau to manufacture [copra](/wiki/Copra) pellets and coconut oil. Its name was initially PT Java Pelletizing Factory. In 1982, Ometraco took over Thegrau's stake. Ferry's son, Handojo Santosa, joined Japfa in 1986 and later took over management of the company. Japfa entered the [aquaculture](/wiki/Aquaculture) industry in 1987. It had its [initial public offering](/wiki/Initial_public_offering) at the [Jakarta](/wiki/Jakarta_Stock_Exchange) and [Surabaya Stock Exchanges](/wiki/Surabaya_Stock_Exchange) in 1989. In 1990, the company took over assets from a number of other food manufacturers under Ometra, and renamed itself to PT Japfa Comfeed Indonesia. Ometra went bankrupt due to the [Asian financial crisis](/wiki/Asian_financial_crisis) in 1997, but Japfa remained operational. The company listed itself at the [Singapore Stock Exchange](/wiki/Singapore_Stock_Exchange) on 15 August 2014. ## Corporate affairs In 2021, Japfa sold an 80% stake in its branded dairy subsidiary [Greenfields](/wiki/Greenfields_(dairy_company)) to private equity groups [TPG](/wiki/TPG_Inc.) and [Northstar Group](/wiki/Northstar_Group) for USD 236 million. In 2022, the group listed its China-based dairy subsidiary AustAsia at the [Hong Kong Stock Exchange](/wiki/Hong_Kong_Stock_Exchange), distributing the subsidiaries' shares to shareholders. As of 2022, it is the second largest poultry and animal feed producer in Indonesia, behind [Charoen Pokphand](/wiki/Charoen_Pokphand). In 2018, the company was fined Rp 2 billion (USD 140,000) by the Indonesian Business Competition Supervisory Commission [id] for failing to provide a notice to the body following its acquisition of a smaller firm. The company's Indonesian subsidiary made up approximately 75% of its total revenue in 2023, with other subsidiaries primarily operating in [Vietnam](/wiki/Vietnam), [Myanmar](/wiki/Myanmar), [India](/wiki/India), and [Bangladesh](/wiki/Bangladesh). ## Products The company produces animal and aquaculture feed, whole poultry carcasses, beef, processed poultry products, and processed seafood.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:13:48.134520",
  "title": "Japfa",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Japfa"
}