{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:13:54.882890"
  },
  "content": "Austronesian ethnic groupEthnic group**This article contains letters from the [Javanese script](/wiki/Javanese_script).** Without proper rendering support, you may see [question marks, boxes, or other symbols](/wiki/Specials_(Unicode_block)#Replacement_character) instead of Javanese characters. The **Javanese**[note 2] ([Javanese](/wiki/Javanese_language): ꦮꦺꦴꦁꦗꦮ, romanized: *Wong Jåwå* (in the [*ngoko* register](/wiki/Javanese_language#Registers)), ꦠꦶꦪꦁꦗꦮꦶ, *Tiyang Jawi* (in the [*krama* register](/wiki/Javanese_language#Registers)); [Indonesian](/wiki/Indonesian_language): *Orang Jawa*) are an [Austronesian](/wiki/Austronesian_peoples) [ethnic group](/wiki/Ethnic_group) native to the central and eastern part of [Java island](/wiki/Java_island), which covers most of the administrative areas of the provinces of [Central Java](/wiki/Central_Java), [East Java](/wiki/East_Java), and [Special Region of Yogyakarta](/wiki/Special_Region_of_Yogyakarta). With more than 100 million people, Javanese people are the largest ethnic group in both Indonesia and in [Southeast Asia](/wiki/Southeast_Asia) as a whole. Their native language is [Javanese](/wiki/Javanese_language), it is the largest of the [Austronesian languages](/wiki/Austronesian_languages) in [number of native speakers](/wiki/List_of_languages_by_number_of_native_speakers) and also the largest [regional language](/wiki/Regional_language) in Southeast Asia. As the largest ethnic group in the region, the Javanese have historically dominated the social, political, and cultural landscape of both Indonesia and Southeast Asia. There are significant numbers of [Javanese diaspora](/wiki/Javanese_diaspora) outside of [central](/wiki/Central_Java) and [eastern Java](/wiki/East_Java) regions, including the other [provinces of Indonesia](/wiki/Provinces_of_Indonesia), as well as other countries such as [Suriname](/wiki/Suriname), [Singapore](/wiki/Singapore), [Malaysia](/wiki/Malaysia), [Egypt](/wiki/Egypt), [Saudi Arabia](/wiki/Saudi_Arabia), [South Africa](/wiki/South_Africa), [Sri Lanka](/wiki/Sri_Lanka), [Yemen](/wiki/Yemen) and the [Netherlands](/wiki/Netherlands). The Javanese ethnic group has many sub-groups (based on native Javanese community on the island of Java) that can be distinguished based on their characteristics, customs, traditions, dialects, or even their respective ways of life. These include [Banyumasan](/wiki/Banyumasan_people), [Cirebonese](/wiki/Cirebonese_people), [Mataram](/wiki/Mataram_Sultanate), [Osing](/wiki/Osing_people), and [Tenggerese](/wiki/Tenggerese_people). The majority of the Javanese people identify themselves as [Sunni Muslims](/wiki/Sunni_Muslim), with a small minority identifying as [Christians](/wiki/Christians) and [Hindus](/wiki/Hindu). With a large global population, the Javanese are considered significant as they are the largest [Muslim](/wiki/Muslims) ethnic group in the [Far East](/wiki/Far_East) and the [fourth largest Muslim ethnic group in the world](/wiki/List_of_contemporary_ethnic_groups) after the [Arabs](/wiki/Arab_Muslims), [Bengalis](/wiki/Bengali_Muslims), [and Punjabis](/wiki/Punjabi_Muslims). Javanese civilisation has been influenced by more than a millennium of interactions between the native [animism](/wiki/Animism) [Kejawèn](/wiki/Kejaw%C3%A8n) and the Indian [Hindu](/wiki/Hindu)—[Buddhist](/wiki/Buddhist) culture, and this influence is still visible in Javanese history, culture, traditions, and art forms. The ancient Javanese kingdoms of [Singhasari](/wiki/Singhasari) and [Majapahit](/wiki/Majapahit) were among the most powerful maritime empires in the region, whose boundaries included most of [Maritime Southeast Asia](/wiki/Maritime_Southeast_Asia) and parts of [Indochina](/wiki/Mainland_Southeast_Asia). Javanese heritage has created magnificent religious monuments such as [Borobudur](/wiki/Borobudur) and [Prambanan](/wiki/Prambanan) which are among the world's largest temples. [Javanese culture](/wiki/Javanese_culture) has a strong influence in most of the Southeast Asian countries. In Brunei, Malaysia, and Singapore, the influence of Javanese culture can be seen in many aspects of modern [Malay culture](/wiki/Malay_culture). Javanese culture has greatly influenced their traditional cuisine with many [dishes](/wiki/Javanese_cuisine) such as [satay](/wiki/Satay), [sambal](/wiki/Sambal), [ketupat](/wiki/Ketupat), *[nasi kuning](/wiki/Nasi_kuning)* (*pulut kuning*), and [rojak](/wiki/Rojak). [Kris](/wiki/Kris) weaponry, [batik](/wiki/Batik) and [ronggeng](/wiki/Ronggeng) dance art, [gamelan](/wiki/Gamelan) musical instruments, and [wayang kulit](/wiki/Wayang) puppetry were introduced to them through [Javanese contact](/wiki/Javanisation). Javanese culture has also spread widely beyond Southeast Asia to countries such as [Sri Lanka](/wiki/Sri_Lanka), [South Africa](/wiki/South_Africa), and [Suriname](/wiki/Suriname), where many of the Javanese diaspora live. ## History Like most Indonesian ethnic groups, including the [Sundanese](/wiki/Sundanese_people) of [West Java](/wiki/West_Java), the Javanese are of [Austronesian](/wiki/Austronesian_people) origins whose ancestors are thought to have originated in [Taiwan](/wiki/Taiwan), and migrated through the [Philippines](/wiki/Philippines) to reach Java between 1,500 BC and 1,000 BC. ### Ancient Javanese kingdoms and empires [Hindu](/wiki/Hinduism) and [Buddhist](/wiki/Buddhism) influences arrived through trade contacts with the [Indian subcontinent](/wiki/Indian_subcontinent). Hindu and Buddhist — traders and visitors, arrived in the 5th century. The Hindu, Buddhist and Javanese faiths blended into a unique local philosophy. The cradle of Javanese culture is commonly described as being in [Kedu](/wiki/Kedu_Plain) and [Kewu Plain](/wiki/Kewu_Plain) in the fertile slopes of [Mount Merapi](/wiki/Mount_Merapi) as the heart of the [Mataram kingdom](/wiki/Mataram_kingdom). The earliest [Sanjaya](/wiki/Sanjaya_dynasty) and [Sailendra](/wiki/Sailendra) dynasties had their power base there.: 238–239 Between the late 8th century and the mid-9th century, the kingdom saw the blossoming of classical Javanese art and architecture reflected in the rapid growth of [temple construction](/wiki/Candi_of_Indonesia). The most notable of the temples constructed are [Kalasan](/wiki/Kalasan), [Sewu](/wiki/Sewu), [Borobudur](/wiki/Borobudur) and [Prambanan](/wiki/Prambanan). The Java valley was home to thousands of Hindu temples that co-existed with Buddhist temples, most of which were buried in the massive eruption of Mount Merapi in 1006 AD. At its peak, the Javanese kingdom had become a dominant empire that exercised its power—not only in Java island, but also in [Sumatra](/wiki/Srivijaya), [Bali](/wiki/Bali), [southern Thailand](/wiki/Ligor), Indianized kingdoms of the [Philippines](/wiki/Philippines), and the [Khmer](/wiki/Khmer_Empire) in [Cambodia](/wiki/Cambodia). [Jayavarman II](/wiki/Jayavarman_II), a prince who had lived at the Sailendra court in Java, brought Javanese art and culture, including the concept of the [devaraja](/wiki/Devaraja), to Cambodia, laying the foundations for Khmer civilization. The centre of Javanese culture and politics was moved towards the eastern part of the island when [Mpu Sindok](/wiki/Mpu_Sindok) (r. 929–947) moved the capital of the kingdoms eastward to the valleys of the [Brantas River](/wiki/Brantas_River) in the 10th century CE. The move was most likely caused by the [volcanic eruption](/wiki/Volcanic_eruption) of [Merapi](/wiki/Mount_Merapi) and/or invasion from [Srivijaya](/wiki/Srivijaya).: 238–239 At the end of the 13th century, The major spread of Javanese influence occurred under King [Kertanegara of Singhasari](/wiki/Kertanegara_of_Singhasari). The expansionist king launched several major expeditions to Madura, Bali in 1284, Borneo, the Malay Peninsula, and [most importantly to Sumatra](/wiki/Pamalayu_expedition) in 1275. He also extended Javanese involvement in the lucrative [spice trade](/wiki/Spice_trade) with the [Maluku Islands](/wiki/Maluku_Islands). Following the defeat of the [Melayu Kingdom](/wiki/Melayu_Kingdom) in eastern Sumatra, [Singhasari](/wiki/Singhasari) controlled trade in the [Strait of Malacca](/wiki/Strait_of_Malacca). Singhasari dominance was cut short in 1292 by Kediri's rebellion under [Jayakatwang](/wiki/Jayakatwang), killing Kertanegara. However, Jayakatwang's reign as king of Java soon ended as he was defeated by Kertanegara's son-in-law, [Raden Wijaya](/wiki/Raden_Wijaya) with the help of [invading Mongol troops](/wiki/Mongol_invasion_of_Java) in March 1293. [Raden Wijaya](/wiki/Raden_Wijaya) would later establish [Majapahit](/wiki/Majapahit) near the delta of the Brantas River in modern-day [Mojokerto](/wiki/Mojokerto), [East Java](/wiki/East_Java). Kertanegara policies were later continued by the Majapahits under King [Hayam Wuruk](/wiki/Hayam_Wuruk) and his minister [Gajah Mada](/wiki/Gajah_Mada), whose reign from 1350 to 1389 was marked by conquests that extended throughout Southeast Asia. This expansion marked the greatest extent of Majapahit, making it one of the most influential empires in Indonesian and Southeast Asian history. Various kingdoms of Java were actively involved in the [spice](/wiki/Spice) trade in the sea route of the [Silk Road](/wiki/Silk_Road). Although not major spice producers, these kingdoms were able to stockpile spice by trading for it with [rice](/wiki/Rice), of which Java was a major producer. Majapahit is usually regarded as the greatest of these kingdoms. It was both an agrarian and a maritime power, combining wet-rice cultivation and foreign trade. The ruin of their capital can be found in [Trowulan](/wiki/Trowulan). ### Javanese sultanates [Islam](/wiki/Islam) gained its foothold in port towns on Java's northern coast such as [Gresik](/wiki/Gresik), Ampel Denta ([Surabaya](/wiki/Surabaya)), Tuban, Demak and [Kudus](/wiki/Kudus,_Kudus). The spread and proselytising of Islam among the Javanese was traditionally credited to [Wali Songo](/wiki/Wali_Sanga). Java underwent major changes as [Islam](/wiki/Islam) spread. Following succession disputes and civil wars, Majapahit power collapsed. After this collapse, its various dependencies and vassals broke free. The [Sultanate of Demak](/wiki/Sultanate_of_Demak) became the new strongest power, gaining supremacy among city-states on the northern coast of Java. Aside from its power over Javanese city-states, it also gained overlordship of the ports of [Jambi](/wiki/Jambi) and [Palembang](/wiki/Palembang) in eastern Sumatra. Demak played a major role in opposing the newly arrived colonial power, the [Portuguese](/wiki/Portugal). Demak twice attacked the Portuguese following their capture of [Malacca](/wiki/Malacca). They also attacked [the allied forces](/wiki/Luso_Sundanese_padr%C3%A3o) of the Portuguese and the [Sunda Kingdom](/wiki/Sunda_Kingdom), establishing in the process the [Sultanate of Banten](/wiki/Sultanate_of_Banten). Demak was succeeded by the [Kingdom of Pajang](/wiki/Kingdom_of_Pajang) and finally the [Sultanate of Mataram](/wiki/Mataram_Sultanate). The centre of power moved from coastal Demak, to Pajang in Blora, and later further inland to Mataram lands in [Kotagede](/wiki/Kotagede), near present-day [Yogyakarta](/wiki/Yogyakarta). The Mataram Sultanate reached its peak of power and influence during the reign of [Sultan Agung Hanyokrokusumo](/wiki/Sultan_Agung_of_Mataram) between 1613 and 1645. ### Colonial Java In 1619 the [Dutch](/wiki/Dutch_people) established their trading headquarter in [Batavia](/wiki/Jakarta). Java slowly fell to the [Dutch East India Company](/wiki/Dutch_East_India_Company), which would also eventually control most of [Maritime Southeast Asia](/wiki/Maritime_Southeast_Asia). The internal intrigue and war of succession, in addition to Dutch interference, caused the Mataram Sultanate to break up into [Surakarta](/wiki/Surakarta_Sunanate) and [Yogyakarta](/wiki/Yogyakarta_Sultanate). The further separation of the Javanese realm was marked by the establishment of the [Mangkunegaran](/wiki/Mangkunegaran) and [Pakualaman](/wiki/Pakualaman) princedom. Although the real political power in those days actually lay with the colonial Dutch, the Javanese kings, in their [keratons](/wiki/Keraton), still held prestige as the supposed power centre of the Javanese realm, especially in and around Surakarta and Yogyakarta. Dutch rule was briefly interrupted by British rule in the early 19th century. While short, the British administration led by [Stamford Raffles](/wiki/Stamford_Raffles) was significant, and included the re-discovery of [Borobudur](/wiki/Borobudur). Conflict with foreign rule was exemplified by the [Java War](/wiki/Java_War) between 1825 and 1830, and the leadership of Prince [Diponegoro](/wiki/Diponegoro). Like the rest of the [Dutch East Indies](/wiki/Dutch_East_Indies), Java was captured by the [Empire of Japan](/wiki/Empire_of_Japan) during [World War II](/wiki/World_War_II). With Japan's defeat, independence was proclaimed in the new [Republic of Indonesia](/wiki/Republic_of_Indonesia). ### Republic of Indonesia When the Indonesian independence was proclaimed on 17 August 1945, the last sovereign Javanese monarchies, represented by the Sri Sultan of [Yogyakarta](/wiki/Yogyakarta_Sultanate), the Sunanate of [Surakarta](/wiki/Surakarta_Sunanate), Prince of Mangkunegara and Prince of Pakualaman declared that they would become part of the Republic of Indonesia. Yogyakarta and Pakualaman were later united to form the [Yogyakarta Special Region](/wiki/Special_Region_of_Yogyakarta). The Sri sultan became Governor of Yogyakarta, and the Prince of Pakualaman became vice-governor; both were responsible to the President of Indonesia. The Special Region of Yogyakarta was created after the war of independence ended and formalized on 3 August 1950. Surakarta was later absorbed as part of the [Central Java](/wiki/Central_Java) province. ## Culture The [Javanese culture](/wiki/Javanese_culture) is one of the oldest civilizations and has flourished in Indonesia and Southeast Asia. It has gradually absorbed various elements and influences from other cultures, including native reverence for ancestral and natural spirits, [Buddhist](/wiki/Buddhist) and [Hindu](/wiki/Hindu) dharmic values, Islamic civilization, and to a lesser extent, Christianity, Western philosophy and modern ideas. Nevertheless, Javanese culture — especially in the Javanese cultural heartland; those of highly polished aristocratic culture of the *[keratons](/wiki/Keraton)* in [Yogyakarta](/wiki/Yogyakarta) and [Surakarta](/wiki/Surakarta) — demonstrates some specific traits, such as particular concern with elegance and refinement (Javanese: *alus*), subtlety, politeness, courtesy, indirectness, emotional restraint and consciousness to one's social stature. Javanese culture values harmony and social order highly, and abhors direct conflicts and disagreements. These Javanese values are often promoted through Javanese cultural expressions, such as [Javanese dance](/wiki/Javanese_dance), [gamelan](/wiki/Gamelan), [wayang](/wiki/Wayang) and [batik](/wiki/Batik). It is also reinforced through adherence to Javanese *adat* (traditional rules) in ceremonies, such as *[Slametan](/wiki/Slametan), [Satu Suro](/wiki/Satu_Suro)*, Javanese weddings and *[Naloni Mitoni](/wiki/Naloni_Mitoni)*. However, the culture of *pesisiran* of Javanese north coast and in Eastern Java demonstrates some slightly different traits. They tend to be more open to new and foreign ideas, more egalitarian, and less conscious of one's social stature. Some of these northern settlements — such as [Demak](/wiki/Demak_Regency), Kudus, Tuban, Gresik and Ampel in Surabaya — have become more overtly Islamic, traditionally because these port towns are among the earliest places that Islamic teachings gained foothold in Java. Javanese culture is traditionally centered in the [Central Java](/wiki/Central_Java), [Yogyakarta](/wiki/Yogyakarta) and [East Java](/wiki/East_Java). Due to various migrations, it can also be found in other parts of the world, such as [Suriname](/wiki/Suriname) (where 15% of the population are of Javanese descent), the broader Indonesian archipelago region, [Cape Malay](/wiki/Cape_Malay), [Malaysia](/wiki/Malaysia), [Singapore](/wiki/Singapore), [Netherlands](/wiki/Netherlands) and other countries. The migrants bring with them various aspect of Javanese cultures such as Gamelan music, traditional dances and the art of [Wayang kulit](/wiki/Wayang_kulit) shadow play. The migration of Javanese people westward has created a coastal Javanese culture in West Java distinct from the inland [Sundanese culture](/wiki/Sundanese_people). ### Language [Javanese](/wiki/Javanese_language) is a member of the [Austronesian](/wiki/Austronesian_languages) family of languages and is closely related to, but distinct from, other [languages of Indonesia](/wiki/Languages_of_Indonesia). It is notable for its great number of nearly ubiquitous [Sanskrit](/wiki/Sanskrit) loans, found especially in literary Javanese. This is due to the long history of Hindu and Buddhist influences in Java. Many Javanese in Indonesia are [bilingual](/wiki/Bilingual), being fluent in [Indonesian](/wiki/Indonesian_language) and Javanese. The Javanese language was formerly written with [a script](/wiki/Javanese_script) descended from the [Brahmi script](/wiki/Brahmi_script), natively known as *Hanacaraka* or *Carakan*. In addition, Javanese language can also written with right-to-left script descended from the [Arabic script](/wiki/Arabic_script) called *[Pegon](/wiki/Pegon_script)*. Upon Indonesian independence it was replaced with a form of the [Latin alphabet](/wiki/Latin_alphabet). While Javanese was not made an [official language](/wiki/Official_language) of Indonesia, it has the status of regional language for communication in the Javanese-majority regions. The language also can be viewed as an ethnic language because it is one of the defining characteristics of the Javanese ethnic identity. ### Literature and philosophy Javanese intellectuals, writers, poets and men of letters are known for their ability to formulate ideas and creating [idioms](/wiki/Idiom) for high cultural purpose, through stringing words to express a deeper philosophical meanings. Several philosophical idioms sprung from Javanese classical literature, [Javanese historical texts](/wiki/Javanese_historical_texts) and oral traditions, and have spread into several media and promoted as popular [mottos](/wiki/Motto). For example, *\"[Bhinneka Tunggal Ika](/wiki/Bhinneka_Tunggal_Ika)\"*, used as the national motto of the [Republic of Indonesia](/wiki/Republic_of_Indonesia), *\"Gemah Ripah Loh Jinawi, Toto Tentrem Kerto Raharjo\"*, *\"Jer Basuki Mawa Bea\"*, *\"Rawe-Rawe rantas, Malang-Malang putung\"* and *\"[Tut Wuri Handayani](/wiki/Tut_Wuri_Handayani)\"*. ### Social structure American [anthropologist](/wiki/Anthropology) [Clifford Geertz](/wiki/Clifford_Geertz) divided in the 1960s the Javanese community into three *aliran* or \"streams\": [santri](/wiki/Santri), [abangan](/wiki/Abangan) and [priyayi](/wiki/Priyayi). According to him, the Santri followed an orthodox interpretation [Islam](/wiki/Islam), the abangan followed a syncretic form of Islam that mixed Hindu and animist elements (often termed *[Kejawen](/wiki/Kejawen)*), and the priyayi were the nobility. The Geertz opinion is often opposed today because he mixed the social groups with belief groups. It was also difficult to apply this social categorization in classing outsiders, for example other non-[indigenous](/wiki/Indigenous_peoples) Indonesians such as persons of [Arab](/wiki/Arab_Indonesian), [Chinese](/wiki/Chinese_Indonesian) and Indian descent. Social stratification is much less rigid in northern coast area. ### Calendar\n",
  "language": "en",
  "processed_at": "2026-01-12T11:13:54.882426",
  "title": "Javanese people",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Javanese_people"
}