{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:13:55.330375"
  },
  "content": "Ethnic group of Malaysia and SingaporeEthnic group The **Jawi Peranakan** ([Jawi](/wiki/Jawi_script): جاوي ڤرانقن‎) is an ethnic group found primarily within the [Malaysian](/wiki/Malaysia) state of [Penang](/wiki/Penang) and in [Singapore](/wiki/Singapore), both regions were part of the historical [Straits Settlements](/wiki/Straits_Settlements) where their culture and history is centred around. The term \"Jawi Peranakan\" refers to locally born, Malay-speaking [Muslims](/wiki/Muslim) of mixed [Indian](/wiki/Indian_people) and [Malay](/wiki/Malays_(ethnic_group)) ancestry (also known as Malay Peranakans). Over time, this has grown to include people with Arab ancestry as well. They were an [elite](/wiki/Elite) group within the British Malayan community in mid-19th century [Malaya](/wiki/British_Malaya). In addition to their substantial wealth and social standing, they are remembered for setting up the first Malay newspaper in Malaysia, Singapore, Indonesia and China, the *Jawi Peranakan* and their influences on Malay culture. ## History Since [Penang](/wiki/Penang) and [Singapore](/wiki/Singapore)'s founding in 1786 and 1819, the number of [South Asian immigrants](/wiki/Indians_in_Singapore) to these colonies grew rapidly. Many were South Indian men. However, Jawi Peranakan ancestry does include a large number of other South Asians, from northern India and Pakistan. Women travelled to Singapore only from the 1860s, and even then in small numbers. This led to a shortage of South Asian brides, and so South Asian Muslim men often married Malay Muslim women. The descendants of these unions were called Jawi Peranakan. \"Jawi\" is an [Arabic](/wiki/Arabic) word to denote [Southeast Asia](/wiki/Southeast_Asia), while [Peranakan](/wiki/Peranakan) is a Malay word meaning \"born of\" (it also refers to the elite, [locally born Chinese](/wiki/Peranakan)). More broadly, South Asian Muslims without mixed parentage but born in the [Straits Settlements](/wiki/Straits_Settlements) were sometimes also called Jawi Peranakan, as were children from [Arab](/wiki/Arab_people)-Malay marriages. Similar terms for mixed Malay-South Asian people were \"Jawi Pekan\" (mostly used in [Penang](/wiki/Penang)). Jawi Peranakan families were found throughout Malaysia, especially Penang, and Singapore. ## Description The Jawi Peranakan chose their spouses carefully, screening prospective matches for wealth and status, rather than racial origins. This enabled intermarriage between Jawi Peranakan and other prosperous local Muslim communities, like the Arabs, Indians and the Malay aristocrats. Despite assimilating into the Malay culture, the Jawi Peranakan maintained a distinct identity which was captured in their architecture, clothing, jewelry and cuisine. Also, the community placed a strong emphasis on getting an English education, especially since many Jawi Peranakans held Colonial Government jobs. Culturally, they contributed to the arts scene of the region, especially in music. The Jawi Peranakan were enterprising and progressive and by the late 19th century, they had accumulated considerable wealth and status and contributed to the economy as merchants and landlords. They were also literate and English-educated, easily qualifying for government jobs. A group of Jawi Peranakan financed the first Malay language newspaper, the Jawi-Peranakan. Its first editor was Munsyi Mohamed Said Bin Dada Mohiddin, a South Indian Muslim who remained as editor for 12 years, from 1876 to 1888. ## Demise of the community There are a few Jawi Peranakan families left in Singapore and Malaysia, especially Penang, which used to be their largest settlement. However, most today register as Malays. The loss of their identity is due to various causes. Economically, other competing mercantile groups were emerging. The [Great Depression](/wiki/Great_Depression) led many Jawi Peranakan business empires to bankruptcy and a severe fall in rent collected by landlords. Over time, the Jawi Peranakan grew increasingly dependent on government and clerical jobs. By the turn of the 20th century, the political climate favoured the Malays. As the largest racial group and the indigenous people of Malaya, they were seen as the natural successors to the British with the waning of the [British Empire](/wiki/British_Empire). Projecting an identity that was distinctly apart from the Malays was therefore not expedient. In the 1920s and 1930s, the Jawi Peranakan were also criticised for their brand of religious belief of [Hanafi Islam](/wiki/Hanafi) which is different from [Shafi'i Islam](/wiki/Shafi%27i) practised by the Malays. Furthermore, the Jawi Peranakan tended to be reformist and they challenged the authority of Malay royalty in religious matters. Most were born and bred in the [Straits Settlements](/wiki/Straits_Settlements), and had never been a subject of the [Sultan](/wiki/Sultan). They therefore lacked this political and cultural quality which was seen to define a \"true Malay\". ## Descendants In colonial Singapore and [British Malaya](/wiki/British_Malaya), the Jawi Peranakan remain a community held in high regard by the local Malays primarily due to the educational achievements and the wealth inherited. Families such as the Angullias have left their mark on modern day Singapore with places like Angullia Park near Singapore's famous [Orchard Road](/wiki/Orchard_Road) still bearing the name of the clan. Other families include the Maricars or Maricans. Due to intermarriage with other Muslim communities, many of their descendants inherited Arab (Syed, Sayyid) or to some extent [Malay titles](/wiki/Malaysian_names#Hereditary_titles) (Tengku, Wan, Megat). Many who are married to Malays have also dropped their surnames since most Malays practise a [patronymic](/wiki/Patronym) naming system. ## Notable Jawi Peranakan ### Malaysia - [Abdullah bin Abdul Kadir](/wiki/Abdullah_bin_Abdul_Kadir): Author, translator and teacher - [Nur Fathia](/wiki/Nur_Fathia): Malaysian actress - [Peranakan](/wiki/Peranakan) - [Tamil Muslim](/wiki/Tamil_Muslim) Nagata, J. A. (1984). The reflowering of Malaysian Islam: Modern religious radicals and their roots (pp. 14, 118-122, 186, 249). Vancouver: University of British Columbia Press. (Call no.: R 297.09595 NAG) Tan, Y. S., & Soh, Y. P. (1994). The development of Singapore's modern media industry (pp. 8–9). Singapore: Times Academic Press. (Call no.: RSING 338.4730223 TAN) Urban Redevelopment Authority, Preservation of Monuments Board. (1991). Jamae Mosque preservation guidelines (pp. 7–9). Singapore: Author. (Call no.: RSING 363.96095957 JAM) Jeman Sulaiman. (7 November 1988). The rise of Malay newspaper. The Straits Times, p. 6. Khoo, S. N. (30 August 2001). A rich legacy. The Star (Malaysia), Lifestyle. Mohani Musa. (25 October 2001). The Penang story: Flags of conflict. The Star (Malaysia), Lifestyle. - -\n",
  "language": "en",
  "processed_at": "2026-01-12T11:13:55.329900",
  "title": "Jawi Peranakan",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Jawi_Peranakan"
}