{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:14:05.102454"
  },
  "content": "The **Jean Yip Group** is a [Singaporean](/wiki/Singapore) company that runs hairstyling, [weight loss](/wiki/Weight_loss) and [cosmetology](/wiki/Cosmetology) salons in [Southeast Asia](/wiki/Southeast_Asia) and [China](/wiki/China). It operates a training academy in Singapore. Jean Yip Group has over 60 hairdressing, beauty and slimming outlets within Singapore, six in [Malaysia](/wiki/Malaysia), two in [Indonesia](/wiki/Indonesia) and one in [Guangzhou](/wiki/Guangzhou), China. The company has approximately 1,000 employees. The Group received the [Reader's Digest](/wiki/Reader%27s_Digest) Most Trusted Brand Gold Award in 2010 and the [Singapore Prestige Brand Award](/wiki/Singapore_Promising_Brand_Award) – Heritage Award in 2012. ## History The Group was found 1982 by Jean Yip as a single salon in Singapore. Her husband, Mervin Wee joined the business in 1984. The Group moved into the [slimming](/wiki/Weight_loss) and beauty industry in 1990, led by Dawn Yip, Jean Yip's younger sister. The Group expanded overseas to [Malaysia](/wiki/Malaysia) in 1995 and [Jakarta](/wiki/Jakarta), [Indonesia](/wiki/Indonesia) in 2005. Oliver Yip, younger brother of Jean Yip, is the Group Business Development Director to oversee research and development and source for new businesses. In 2010, Jean Yip Loft was built. It is a seven-storey centre which contains all Jean Yip Group's services and other amenities, serving as a clubhouse for its customers. The company ventured into China in 2013. Its [Guangzhou](/wiki/Guangzhou) flagship salon is located in [Haizhu](/wiki/Haizhu_District). ## Staff training and development The Jean Yip Group has established Jean Yip Academy to develop professional [hairstylists](/wiki/Hairdresser) and [beauty therapists](/wiki/Cosmetology). It is an Approved Training Provider for National Institute of Technical Education Certificate (NITEC) courses, as well as a Certified On-the-Job Training Centre for hairdressing, spa and aesthetic therapy [apprenticeships](/wiki/Apprenticeship). It is the only school in Singapore with both hair and beauty certification accredited by the [Institute of Technical Education](/wiki/Institute_of_Technical_Education) (ITE) of Singapore. It has also been awarded the COJTC (Certified on the Job Training Center) and NITEC Industry Training Provider status by the ITE. ## Business development According to a report by [Superbrands](/wiki/Superbrands) in 2013, the Group's Herb De Orient products are \"specially tailored for Asian skin and hair conditions [as they] are well researched and developed\", and is targeted at giving Jean Yip a competitive advantage in the industry against other competitors. Another brand, Superwhite Skin Lab, has gone through research and development by the Jean Yip team. ## Customer service In 2006, [*Today*](/wiki/Today_(Singapore_newspaper)) quoted Ms Jean Yip in an interview where she mentioned that it is the \"strong culture of being professional but very family-oriented\" that makes the difference and \"exude[s] a sense of warmth for the client[s]\". ## Management/company structure The company's senior management comprises Jean Yip as chairman; Mervin Wee as Group managing director and artistic director, and hairdressing/principal of the academy; Dawn Yip as group operations and marketing director; and Oliver Yip as group business development director. Eldest daughter Cheryl Wee is the company's current ambassador. In her interview with [Prestige Magazine](/wiki/Prestige_(magazine)), Jean Yip highlighted that \"Rachel (her second daughter) is doing her masters in [pharmacology](/wiki/Pharmacology) and has promised to join the [product development](/wiki/Product_development) arm. Russell (youngest son) has also expressed interest in developing a new area in the business\". ## Philanthropy As part of the company's [corporate social responsibility](/wiki/Corporate_social_responsibility) (CSR), a team of hairstylists was involved in [Hair for Hope](/wiki/Hair_for_Hope) from 2011 to 2014 where staff shaved thousands of heads for two days. Since 2012, to support the Breast Cancer Foundation (BCF), the Jean Yip Group of companies became a distribution outlet for BCF's newly designed pink pins. Donation boxes were placed at outlets under the Jean Yip Group and all donations went to the BCF.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:14:05.101977",
  "title": "Jean Yip Group",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Jean_Yip_Group"
}