{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:14:15.446335"
  },
  "content": "* **Jewel of Muscat*** is a ship based on the design of the [Belitung shipwreck](/wiki/Belitung_shipwreck), an Arabian [dhow](/wiki/Dhow) that was found off the coast of [Belitung Island](/wiki/Belitung_Island), [Indonesia](/wiki/Indonesia), in 1998 and subsequently salvaged. It was built in a joint effort by the governments of [Oman](/wiki/Oman) and [Singapore](/wiki/Singapore) and Mike Flecker, one of the people employed by the salvage company Seabed Explorations at the time of the original recovery. ## Background Present-day knowledge of the original materials and methods used in construction of the *Jewel of Muscat* and this type of Arab dhow stems largely from the shipwreck itself, found preserved under sediment. The sediment preserved the remains of the wooden vessel and without this the wreck would have been lost due to worms. Most important were the discoveries about the methods of construction which were repeated in the construction of *Jewel of Muscat*.[*original research?*] Fortunately pieces of the original timbers were preserved, allowing scientists to analyse the remains and determine the types of wood used. Timbers from a number of tree species were found, including one that is unique to central Africa. After analysing the hull form, timber species, and construction methods, archaeologists concluded that the wreck was of Indian or Arabian origin, utilising some imported wood. ## Construction and voyage The *Jewel of Muscat* was built at Qantab near Muscat, the capital of Oman. Construction began in October 2008 and it set sail for Singapore on 16 February 2010, arriving on 3 July 2010. The ship is remarkable in that it was sewn together, following the construction techniques used in the wrecked ship, rather than the using more traditional methods of pegs or nails. The dhow is about 21 feet (6.4 m) wide and 58 feet (18 m) long. It is an accurate reproduction thanks to the measurements taken by Walterfang's team during the excavation. Timber for the ship was made from *[Afzelia africana](/wiki/Afzelia_africana)* trees felled in [Ghana](/wiki/Ghana) and cut into planks and frames at a Ghanaian lumberyard. Boards were trimmed and sanded. Trimmed boards were steamed individually in a fire-heated steambox to make them flexible. When workers removed a board from the box, they had two minutes to carry it to the ship and clamp it into place in a bent and slightly twisted shape before it would stiffen again. It was then sewn into position using [coir](/wiki/Coir) rope and [caulking](/wiki/Caulking) made from multiple strands of fine coir rope with a diameter of about 3 millimetres (0.12 in). In addition, the planks were coated with [shark](/wiki/Shark) liver oil to make them water-resistant. The *Jewel of Muscat* made one voyage, from its shipyard in Oman 5000 kilometers to its berth in Singapore, following an ancient trade route, in stages, via Galle in Sri Lanka. The captain was Saleh al Jabri, with 25 years of sailing experience. Illustrations show that the ships were [square-rigged](/wiki/Square-rigged), but virtually nothing else was known of their rigging. The sails were handmade from [canvas](/wiki/Canvas). The main sail was 81 square metres (870 sq ft) and weighed over 150 kilograms (330 lb). The second mast bore a smaller mizzen sail. \"Mizzen\" is an Arabic word that means balance. The mizzen sail is used, in part, to steer the ship. A crew of at least eight is needed to manage the sails. In Galle the canvas sails were replaced by sails woven from palm leaves by traditional weavers in [Zanzibar](/wiki/Zanzibar) to \"test their strength and handling characteristics\". An ancient navigational tool called a [kamal](/wiki/Kamal_(navigation)) is used to make sightings of known stars compared to the horizon, measuring the ship's latitude. The ship became becalmed and the captain procured a tow from the [Indian Coast Guard](/wiki/Indian_Coast_Guard). They were towed to the city of [Cochin](/wiki/Cochin) in [Kerala State](/wiki/Kerala_State), India. After a month at sea, the boat was befouled with algae and barnacles. It was taken to dry dock, scraped, and coated with *[chunam](/wiki/Chunam)*, a mixture of goat fat and [lime](/wiki/Lime_(material)). While the ship proceeded from Cochin to Galle in Sri Lanka cracks appeared on the mast after strong gusts of wind. In Galle the masts were replaced with freshly hewn teak logs. From October 2011, the *Jewel of Muscat* was housed in the [Maritime Experiential Museum and Aquarium](/wiki/Maritime_Experiential_Museum_and_Aquarium) in the [Sentosa resort](/wiki/Resorts_World_Sentosa) in Singapore until March 2020 when the museum was closed to later on become part of the new [Singapore Oceanarium](/wiki/Singapore_Oceanarium), an expansion of the former [S.E.A. Aquarium](/wiki/S.E.A._Aquarium). - [Belitung shipwreck](/wiki/Belitung_shipwreck) - [INSV Kaundinya](/wiki/INSV_Kaundinya) - Official site - Video – Captain Saleh Said Al Jabri's account of the crossing from Galle, Sri Lanka to Penang, Malaysia - Burningham, Nick (1 September 2019). \"On the Flexibility of Indian Ocean Sewn‐Plank Vessels: the structural performance of Jewel of Muscat\". *International Journal of Nautical Archaeology*. **48** (2): 335–341. [doi](/wiki/Doi_(identifier)):10.1111/1095-9270.12362.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:14:15.445846",
  "title": "Jewel of Muscat",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Jewel_of_Muscat"
}