{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:14:17.633012"
  },
  "content": "This article **relies excessively on references to primary sources**. Please improve this article by adding secondary or tertiary sources. *Find sources:* \"Jewellery Design and Management International School\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(May 2017)* *(Learn how and when to remove this message)*Independent school in Singapore, Singapore The **Jewellery Design and Management International School** ([Abbreviation](/wiki/Abbreviation): **JDMIS**) is a school specializing in the jewellery industry based in [Singapore](/wiki/Singapore). The JDMIS is a jewellery design and management school that provides education and inspiration by means of academic programs in [jewellery design](/wiki/Jewellery_design), history, [marketing](/wiki/Marketing) and [management](/wiki/Management) as well as [vocational training](/wiki/Vocational_training) in the technology and production of designer jewellery. ## Background The JDMIS is a private limited company registered in Singapore in 2007 and provides jewellery industry training in Singapore. Over 17,000 students have completed professional jewellery training courses and over 4,500 participants have graduated with Certificate or Diploma qualifications. It offers modularized skills training: 30 hour industry-recognized and SkillsFuture-supported certification courses, formal diploma and advanced diploma qualifications with established pathways to degree courses in UK Universities including Birmingham City University and University of Sunderland. The Dean of the JDMIS, Tanja M. Sadow is a jeweller, gemologist, and educator in Singapore and has worked with the Gemological Institute of America training US-based residence and extension courses as well as teaching the first GIA international extension course in Singapore. Her background includes the development of curricula for the Jewellery Industry Training Centre of Singapore in 1991–1994. In 2018, JDMIS entered a joint-venture with [Management Development Institute of Singapore](/wiki/Management_Development_Institute_of_Singapore) in order to expand its market and provide training to younger school-leavers. In 2022, JDMIS majority shareholders bought back the shares issued to MDIS to better manage the school's focus on the development of the jewellery industry, according to the founder's vision. In 2023, JDMIS moved into the National Design Centre of Singapore, expanding its general-interest jewellery activities for the public. ## Accreditation The JDMIS is a registered private education institution with the Singapore [Committee for Private Education](/wiki/Committee_for_Private_Education). It is an approved training provider and programme partner with the [Singapore Workforce Development Agency](/wiki/Singapore_Workforce_Development_Agency). The school is a member of the Singapore Jewellers Association. The JDMIS is a founding member of the Guild of Jewellery Professionals and Artisans, a registered not-for-profit society in Singapore whose mandate is to define and uphold standards in jewellery fabrication and education in the region. ## Related Organizations JDMIS has a wholly owned subsidiary called the Creative Jewellery Studio. This company is a not-for-profit designer co-operative run by graduates of the school and is a registered Precious Metals and Precious Gemstones Dealer with the Singapore Ministry of Law. The studio maintains a retail presence for co-operative members to legally transact jewellery sales without commissions or consignment fees until they establish their own brands, companies and dealer registrations. Funded by the JDMIS CJS also contributes to local charities and co-ordinates co-operative members to participate in jewellery exhibitions, competitions and pop-up events at locations around the island. - Official site - Guild of Jewellery Professionals and Artisans website - Singapore Jewellers Association website This Singapore school-related article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:14:17.632684",
  "title": "Jewellery Design and Management International School",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Jewellery_Design_and_Management_International_School"
}