{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:14:27.397965"
  },
  "content": "Temple in SingaporeThis article needs to be **updated**. Please help update this article to reflect recent events or newly available information. *(December 2013)* **Jin Long Si Temple** ([traditional Chinese](/wiki/Traditional_Chinese_characters): 金龍寺; [simplified Chinese](/wiki/Simplified_Chinese_characters): 金龙寺; [pinyin](/wiki/Pinyin): *Jīnlóng Sì*) is a temple located at 32 Tai Seng Avenue, [Singapore](/wiki/Singapore). ## History Jin Long Si Temple, originally known as *Jin Long Miao*, was constituted under a trust and established as a religious and charity mission in 1941, with funds and donations from philanthropic Chinese merchants. The temple started off as an [attap](/wiki/Attap) hut on a land around [Bartley](/wiki/Bartley) donated by a grateful devotee. It was later rebuilt by Wan Guan Lin into a zinc-roof and wooden structure, while devotees had constructed a huge statue of the [Laughing Buddha](/wiki/Laughing_Buddha) out of saw dust, a [pagoda](/wiki/Pagoda) and also a pavilion with the life-size figure of their patron deity, *Nan Wu Wu Ji Sheng Mu*.[*citation needed*] While the temple at Lorong How Sun was basically a Chinese [Mahayana](/wiki/Mahayana) Buddhist temple, its teachings was a fusion of the \"san-jiao\" (three religion) derived mainly from [Buddhism](/wiki/Buddhism), [Taoism](/wiki/Taoism) and [Confucianism](/wiki/Confucianism). The temple also had many Taoist deities like *Nan Wu Wu Ji Sheng Mu* and [Pan Gu](/wiki/Pangu). Occupying an area of 1,840 square metres, the temple had approximately 4,000 regular worshippers and more than 300 registered members.[*citation needed*] ### Relocation On 20 January 2003, the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) (URA) issued a compulsory land acquisition order to acquire the plot of land belonging to the temple as part of URA's redevelopment plan for a nearby [Mass Rapid Transit](/wiki/Mass_Rapid_Transit_(Singapore)) (MRT) construction of the [Circle Line Project](/wiki/Circle_Line_(Singapore)) (Phase III). During this period, several community measures including blogs and online petitions were started to save the temple and the Bodhi tree; the temple remained active in contributing to the grassroots organisations in Braddell Heights with funds and manpower despite modest resources. It was reported in *[The Straits Times](/wiki/The_Straits_Times)*, the local broadsheet newspaper, that the temple regularly sponsors functions for its next door neighbour, the Ramakrishna Mission Home for orphans and wayward boys. Ramakrishna Mission Home, in reciprocating the temple's kindness, allowed the devotees to take a short cut through its premises for those walking uphill to the temple. In January 2008, a legal suit, denoted [Eng Foong Ho v. Attorney-General](/wiki/Eng_Foong_Ho_v._Attorney-General), was filed by three devotees to save the temple site from government acquisition, alleging that it was in violation of the [Constitution](/wiki/Constitution_of_Singapore). The case was dismissed by the [High Court](/wiki/Judicial_system_of_Singapore) on 25 February on the grounds that \"the devotees had no standing to make the application\". The temple was given two months to relocate to a temporary site, and subsequently to a permanent home in Tai Seng Avenue. The temple's land is to be merged with state land next to it, for sale in the second half of 2008, while the Bodhi tree will be retained by imposing for its preservation as part of the tender conditions for the redevelopment of the site. Jing Long Si relocated its premises on a plot of land at 32 [Tai Seng](/wiki/Tai_Seng) Ave, [Singapore](/wiki/Singapore). ## Bodhi Tree The Bodhi tree at the Lorong How Sun Site was one of the twelve seeds that were brought by [monks](/wiki/Sangha_(Buddhism)) from [Sri Lanka](/wiki/Sri_Lanka) in the nineteenth century. It has an age of approximately 120 years (as of 2007), is over 30 metres tall and has a girth of 8.5 metres, which is considered to be the most ancient and largest Bodhi tree in Singapore according to verifications made by the [Nature Society Singapore](/wiki/Nature_Society_Singapore) (NSS) and [National Parks Board](/wiki/National_Parks_Board) (Nparks) separately. Its roots are deeply embedded into the slope of the hill where the temple is located and even extended to the inner recesses of the temple premises; any land development at the tree's location has a high likelihood of causing soil movement and undue stress to the tree roots. Due to its ancient age and its symbiotic relationship with the temple, both the NSS and Nparks have recommended the Bodhi tree to be preserved as a 'Heritage Tree' after their findings. Trees that are classified as 'Heritage Tree' cannot be cut down and are protected with lightning conductors with money from the Heritage Trees Fund. A panel of officials and nature-loving volunteers decide if a tree should be placed on the register, based on its appearance, height and girth, as well as its social, historical and educational significance.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:14:27.397500",
  "title": "Jin Long Si Temple",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Jin_Long_Si_Temple"
}