{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:14:33.370648"
  },
  "content": "* *Joanne Ooi** (born December 13, 1967) is a [Singaporean American](/wiki/Singaporean_American) environmentalist, art dealer, marketing expert, founder & CEO of Plukka. ## Early life and education Ooi is the eldest child of two doctors, who are both [Chinese Singaporean](/wiki/Chinese_Singaporean). She was born in [Singapore](/wiki/Singapore), but moved to the [Cincinnati, Ohio](/wiki/Cincinnati,_Ohio), in the United States. She graduated from [Columbia University](/wiki/Columbia_University) in 1989 and earned her law degree from the [University of Pennsylvania](/wiki/University_of_Pennsylvania). ## Career Ooi served as the [Creative Director](/wiki/Creative_Director) of [Shanghai Tang](/wiki/Shanghai_Tang) for seven years. During her time with the company Ooi chose to focus on clothes that were based on traditional Chinese designs and themes, with sales for *Shanghai Tang* increasing 50%. Ooi was also one of the first persons to use Chinese models in international advertising campaigns and is credited with launching the career of Chinese [supermodel](/wiki/Supermodel), [Du Juan](/wiki/Du_Juan). Beginning in 2009, Ooi operated as the CEO of the environmental organization [Clean Air Network](/wiki/Clean_Air_Network), which focused on [air pollution](/wiki/Air_pollution) and [public health](/wiki/Public_health). Ooi, together with fellow Clean Air Network CEO Christine Loh, was nominated for [Time Magazine's](/wiki/Time_Magazine) \"100 Most Influential\" list in 2011. Ooi frequently speaks and comments on a wide variety of topics, including luxury retail, ecommerce, [digital marketing](/wiki/Digital_marketing), creativity and entrepreneurship. ## Plukka In December 2011 Ooi launched *Plukka*, an [ecommerce](/wiki/Ecommerce) website that specializes in fine jewelry. Ooi, together with Jai Waney, chose to open the website after noticing the steep markup for designer jewelry. Plukka’s business model made waves in the industry for its made-to-order platform that cut out the middlemen associated with traditional fine-jewellery distribution. This approach allows it to maintain extremely competitive pricing while offering directional and artistic jewellery that might be considered too risky or creative for conventional retailers. ## Personal life She lives in [Hong Kong](/wiki/Hong_Kong) with her husband John and son Sam. ## Awards - 2011: Nominated for [Time 100](/wiki/Time_100) Most Influential People in the World list - 2013: Most Promising Entrepreneur, Asia Pacific Entrepreneurship Awards - Plukka - MotherPlukka Blog Archived 2016-04-22 at the [Wayback Machine](/wiki/Wayback_Machine) - Clean Air Network\n",
  "language": "en",
  "processed_at": "2026-01-12T11:14:33.370091",
  "title": "Joanne Ooi",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Joanne_Ooi"
}