{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:14:37.760835"
  },
  "content": "* *John Francis St John Eber** (1916–1994) was a [politician](/wiki/Politician) and [lawyer](/wiki/Lawyer). ## Biography Eber was born in colonial [Singapore](/wiki/Singapore) the son of Reynold Lionel Eber (1886–1968), a lawyer. He attended [Harrow School](/wiki/Harrow_School) and later [Christ's College, Cambridge](/wiki/Christ%27s_College,_Cambridge) before being called to the bar at [Inner Temple](/wiki/Inner_Temple) in 1939, after which he returned to Singapore. During the [Japanese occupation of Singapore](/wiki/Japanese_occupation_of_Singapore), Eber was interned at [Changi Prison](/wiki/Changi_Prison) before being moved to the Sime Road Camp. After the war, he served as the prosecuting counsel against seven Japanese officers over their involvement in the construction of the [Burma Railway](/wiki/Burma_Railway). Eber was involved as a founding member and later vice chairman of the [Malayan Democratic Union](/wiki/Malayan_Democratic_Union), and participated in the [All-Malaya Council of Joint Action](/wiki/All-Malaya_Council_of_Joint_Action) to agitate for a new constitution to replace that of the Malayan Union. He was involved in authoring the People's Constitutional Proposals that were rejected by the British government in favour of what eventually became known as the Federation Agreement, which formed the basis of the [Federation of Malaya](/wiki/Federation_of_Malaya). For alleged membership of and involvement in the Singapore Anti-British League, Eber was arrested by the Singaporean Special Branch on 8 January 1951 during the [Malayan Emergency](/wiki/Malayan_Emergency) and detained at Changi Prison for two years without trial until being released on 23 February 1953. Eber became disillusioned with the legal practice in Singapore after his detention and left for the United Kingdom with his wife, Wee Swee Lian, after failing to find employment, vowing to return to Malaya in the future. In November 1953, he was elected secretary of the [Malayan Forum](/wiki/Malayan_Forum), an association of Malayan university students. He was removed from this position in February 1956 via a no-confidence vote after he referred to Malayan chief minister [Tunku Abdul Rahman](/wiki/Tunku_Abdul_Rahman) as \"[General Bourne](/wiki/Geoffrey_Bourne,_Baron_Bourne)'s messenger boy\" and the [Communist](/wiki/Malayan_Communist_Party)-led [Malayan Races Liberation Army](/wiki/Malayan_National_Liberation_Army) as \"true nationalists\" in the forum's paper. From March 1959 to December 1965, Eber served as the general secretary of the Movement for Colonial Freedom (today known as [Liberation](/wiki/Liberation_(organisation))), during which he took measures to limit the influence of the [Communist Party of Great Britain](/wiki/Communist_Party_of_Great_Britain) within the organisation. Eber was dogged by accusations of being a communist for much of his life, though he identified himself as a Malayan nationalist and [socialist](/wiki/Socialism). ### Citations\n",
  "language": "en",
  "processed_at": "2026-01-12T11:14:37.760373",
  "title": "John Eber (lawyer)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/John_Eber_(lawyer)"
}