{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:14:45.257737"
  },
  "content": "Road in Singapore**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **may require copy editing for grammar, style, cohesion, tone, or spelling**. You can assist by editing it. *(September 2025)* *(Learn how and when to remove this message)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Joo Chiat Road\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(November 2025)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* **Joo Chiat Road** ([IPA](/wiki/International_Phonetic_Alphabet): /ˌdʒuː ˈtʃjɛt/ *JOO-CHYET*) is a road in [Katong](/wiki/Katong) District and a residential [conservation area](/wiki/Conservation_areas_in_Singapore) located in the east coast of [Singapore](/wiki/Singapore). Joo Chiat Road intersects East Coast Road and Marine Parade Road and ends at Marine Parade Road junction beside [Marine Parade MRT station](/wiki/Marine_Parade_MRT_station). It has won several architectural and heritage awards, including the United Nations' UNESCO Asia-Pacific Awards for Cultural Heritage Conservation at 125 Joo Chiat Road. The area has the most amenities and diverse eateries in Singapore with numerous [Michelin](/wiki/Michelin_star) awarded restaurants. Joo Chiat was named after a businessman, Chew Joo Chiat who was the richest man in the Katong district. ## Etymology and history In the 1820s, the area that Joo Chiat occupied consisted of coconut and cotton plantations, including Confederate Estate, The Grove and Perseverance Estate. Notable plantation owners included [Francis James Bernard](/wiki/Francis_James_Bernard), [Jose d’Almeida](/wiki/Jos%C3%A9_d%27Almeida), [Thomas Dunman](/wiki/Thomas_Dunman) and [Hoo Ah Kay](/wiki/Hoo_Ah_Kay). The **Confederate Estate Road** runs alongside the Confederate Estate. While the area developed in the 1900s, Chew Joo Chiat ([Chinese](/wiki/Chinese_language): 周如切; [pinyin](/wiki/Pinyin): *Zhōu Rúqiè*; [Pe̍h-ōe-jī](/wiki/Pe%CC%8Dh-%C5%8De-j%C4%AB): *Chiu Jû-chhiat*), a famous prominent ethnic [Chinese](/wiki/Chinese_Singaporean) businessman of [Peranakan](/wiki/Peranakan) descent bought most of the area in the Katong/Joo Chiat area, inclusive of the Confederate Estate and Confederate Estate Road. Chew bought land from the [Alsagoff family](/wiki/Alsagoff_family) as well as the Little family to plant spices, such as [nutmeg](/wiki/Nutmeg), [gambier](/wiki/Gambier_(extract)), and [pepper](/wiki/Pepper_(spice)) which were in great demand by [Europeans](/wiki/Europeans), and was later known as the \"King of Katong\" due to his acquisitions. In 1913, Chew bought at auction five freehold building allotments fronting the Confederate Estate Road to further increase his land holding. In early 1917, transportation of local produce was by bullock carts and Confederate Estate Road was a cart track going through Chew's plantation. As such it was a private road maintained by Chew. At that time, Katong was still under the jurisdiction of the Rural Board. The Municipal Limit was then extended into Confederate Estate Road with the Municipality intending to construct a road for motor vehicles from [Geylang Serai](/wiki/Geylang_Serai) to the beach. The Municipality offered to buy a stretch of Chew's land, inclusive of the Confederate Estate Road, to build the road. Chew saw the benefit of a transport infrastructure going through his land, and donated the road to the authority. For his donation, the road was named after him: Joo Chiat Road. As more people moved into area around Joo Chiat Road, there was a big demand for housing. Chew divided his land into building lots and sold them to developers to build houses such as the [Peranakan](/wiki/Peranakan) [shophouses](/wiki/Shophouse). Subsequent establishment of some of Singapore's earliest season houses and holiday bungalows resulted in the area around Joo Chiat Road becoming a wealthy and upper middle class suburb. In 1957, Katong Presbyterian Church was built at Joo Chiat Terrace, off Joo Chiat Road. It later moved to Joo Chiat Lane in 1971. Joo Chiat market, at the northern end of Joo Chiat Road, was an important trading centre for [Malays](/wiki/Malays_(ethnic_group)) from [Malaysia](/wiki/Malaysia), [Brunei](/wiki/Brunei) and [Indonesia](/wiki/Indonesia). They traded in food, flowers and spices, which remain a major part of the area's economy today. In 1981, planning approval was given for a Joo Chiat Complex, to be built on the site of the former Joo Chiat Market. Joo Chiat Complex, a five-storey building, cost $37 million to build and consisted of 138 shops and 24 offices. The development of Geylang Serai in the 1960s also prompted the government to build mosques and theatres in Joo Chiat. There were other amenities for the community living there including a police station, schools and health centre. ### 1967–1975 As Singapore's population grew and people started to move out from the city centre, Joo Chiat's community increased. Four more schools were built along with a community centre. Joo Chiat continued to be an entertainment hub with Galaxy theatre and the addition of two more shopping centres. ### 1976–1984 East Coast reclamation started in 1966 and lasted for two decades until 1985. Its reclamation changed the physical landscape of the area with the modification of the coastline, landscape and even the removal of Katong jetty. Coupled with new high rise housing estate in East Coast, Joo Chiat slowly lost its distinct identity amid this de-territorialisation process. The late 1970s and early 1980s also saw more road changes where adjacent streets were linked up to ease commute. Taj Cinema, adjacent to the markets, was also renamed by Shaw to Singapura theatre. However, Singapura theatre lost its attractiveness with the rise of cinematography and eventually shut down in 1985. ### 1985–1995 As the Kampongs in Geylang made way for HDBs, a museum to showcase the life of Malays was proposed in the 1970s. This museum, Geylang Serai Malay Village, was completed in 1989 and located at the start of Joo Chiat Road. ### 1995–present In the early 2000s, due to the economic downturn, prices and rentals of shop houses went down leading to many karaoke lounges, massage parlours and pubs in Joo Chiat. Existing hotels started to offer rooms by the hour which helped promoted vice related activities. In 2005, it had 44 pubs, 38 massage parlours and eight hotels which led to Joo Chiat gaining a reputation as a red-light district. By 2010, due to efforts by local residents and policy changes, Joo Chiat had only 26 pubs, three massage parlours and six hotels in 2010. In 2011, the vicinity surrounding Joo Chiat Road was declared Singapore's first Heritage Town. It is chosen, in part, because of strong efforts to promote its Peranakan culture. Currently, Joo Chiat has become one of the hippiest and coolest towns in Singapore, with both rich and young professionals flocking to its savory cafes and restaurants. Joo Chiat is also one of the Singapore food streets with UNESCO Status. In 2014, Lucky Shophouse, formerly Lucky Bookstore, located at 125 Joo Chiat Road was awarded the Jury Commendation for Innovation at the 2014 [UNESCO Asia Pacific Heritage Awards](/wiki/UNESCO_Asia_Pacific_Heritage_Awards). ## Food There are famous eateries which contribute to Joo Chiat's popularity as a dining spot such as the Red House Bakery and [Chin Mee Chin Confectionery](/wiki/Chin_Mee_Chin_Confectionery). Since 2014, Joo Chiat begins to experience a significant shift in culture and immigration. Today, western cafe and high-class dining are sprouting over Joo Chiat Road. Joo Chiat now becomes a multicultural food enclave, not just a Peranakan enclave. The restaurants and various eateries along the street are of varied cuisines from all over the world. ## Notable places In 2014, Lucky Shophouse, formerly Lucky Bookstore, located at 125 Joo Chiat Road was awarded the Jury Commendation for Innovation at the 2014 [UNESCO Asia Pacific Heritage Awards](/wiki/UNESCO_Asia_Pacific_Heritage_Awards). - [Katong](/wiki/Katong) - National Heritage Board (2002), *Singapore's 100 Historic Places*, Archipelago Press, [ISBN](/wiki/ISBN_(identifier)) 981-4068-23-3 - Makansutra's Guide to Joo Chiat - Philip Chew's Chew Joo Chiat Blog\n",
  "language": "en",
  "processed_at": "2026-01-12T11:14:45.257171",
  "title": "Joo Chiat Road",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Joo_Chiat_Road"
}