{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:14:49.475231"
  },
  "content": "Transportation Facility in Singapore **Joo Koon Bus Interchange** is an air-conditioned [bus interchange](/wiki/Bus_station) located along Joo Koon Circle and Benoi Road, serving industrial areas around Pioneer and Tuas. It opened in November 2015. It is the eighth air-conditioned bus interchange in Singapore, integrated within the retail segment of the [NTUC FairPrice](/wiki/NTUC_FairPrice)'s FairPrice Hub mixed development, and directly connected to [Joo Koon MRT station](/wiki/Joo_Koon_MRT_station). Nearby public amenities include the [Singapore Discovery Centre](/wiki/Singapore_Discovery_Centre), Army Museum of Singapore, Kartright Speedway and Arena Country Club. ## History The interchange was first announced in 2006, together with the extension of the East–West line to Joo Koon. It was meant to improve accessibility to the [Tuas](/wiki/Tuas) area as well as reduce overcrowding at the [Boon Lay Bus Interchange](/wiki/Boon_Lay_Bus_Interchange). The interchange commenced operations on 21 November 2015, and it was opened in three phases to reduce inconvenience to commuters. It was the 8th bus interchange in Singapore to be [air-conditioned](/wiki/Air_conditioning). ## Bus Contracting Model Under the [Bus Contracting Model](/wiki/Bus_contracting_model_of_Singapore), all bus services operating from Joo Koon Bus Interchange were divided into 2 Bus Packages, operated by two different bus operators. ### List of Bus Services OperatorPackageRoutes**SBS Transit**Clementi99**SMRT Buses**Jurong West182/182M, 253, 254, 255, 257, 258/258M, 974 This Singapore bus-related article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:14:49.474689",
  "title": "Joo Koon Bus Interchange",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Joo_Koon_Bus_Interchange"
}