{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:15:01.662672"
  },
  "content": "* *This page is a primary topic and an article should be written about it.** One or more editors believe it holds the title of a broad-concept article. The article may be written here or drafted elsewhere first. Related titles should be described here, while unrelated titles should be moved to Judge of Singapore (disambiguation)[Judge of Singapore (disambiguation)](/wiki/Judge_of_Singapore_(disambiguation)). Relevant discussion may be found on the talk page. *(September 2019)* The term \"**Judge of Singapore**\" can refer to any of the following [judicial officers](/wiki/Judge): ## Senior judicial officers of Superior Courts - A senior judicial officer of the Straits Settlements (27 November 1826 – 14 February 1942): - A [recorder](/wiki/Recorder_(judge)) of the Court of Judicature of Prince of Wales' Island, Singapore and Malacca - A judge of the Supreme Court of the Straits Settlements - A senior judicial officer of the Colony of Singapore (1 April 1946 – 2 June 1959): - A judge of the Supreme Court of the Colony of Singapore - A senior judicial officer of the State of Singapore (3 June 1959 – 8 August 1965): - A judge of the Supreme Court of the State of Singapore - A judge of the High Court of Malaysia in Singapore - A senior [judicial officer of the Republic of Singapore](/wiki/Judicial_officers_of_the_Republic_of_Singapore) (9 August 1965 – present): - A judge of the [Supreme Court of the Republic of Singapore](/wiki/Supreme_Court_of_Singapore) ## Senior judicial officers of Subordinate Courts - A district judge or magistrate of the [Subordinate Courts of Singapore](/wiki/Subordinate_Courts_of_Singapore) Topics referred to by the same termThis disambiguation page lists articles associated with the title **Judge of Singapore**. If an internal link led you here, you may wish to change the link to point directly to the intended article.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:15:01.662256",
  "title": "Judge of Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Judge_of_Singapore"
}