{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:15:09.348395"
  },
  "content": "National court systemThis article is part of a series on[Politics of Singapore](/wiki/Politics_of_Singapore)[Constitution](/wiki/Constitution_of_Singapore) - [Law](/wiki/Law_of_Singapore) - [Human rights](/wiki/Human_rights_in_Singapore) [Legislature](/wiki/Parliament_of_Singapore) - **[Parliament](/wiki/Parliament_of_Singapore)** - [Speaker](/wiki/Speaker_of_the_Parliament_of_Singapore) [Seah Kian Peng](/wiki/Seah_Kian_Peng) ([PAP](/wiki/People%27s_Action_Party)) - [Leader of the House](/wiki/Leader_of_the_House_(Singapore)) [Indranee Rajah](/wiki/Indranee_Rajah) ([PAP](/wiki/People%27s_Action_Party)) - [Leader of the Opposition](/wiki/Leader_of_the_Opposition_(Singapore)) [Pritam Singh](/wiki/Pritam_Singh_(Singaporean_politician)) ([WP](/wiki/Workers%27_Party_(Singapore))) - [14th Parliament](/wiki/14th_Parliament_of_Singapore) - [Constituencies](/wiki/Constituencies_of_Singapore) [Executive](/wiki/Government_of_Singapore#Composition) - **[President of Singapore](/wiki/President_of_Singapore)** ([list](/wiki/List_of_presidents_of_Singapore)) - [Tharman Shanmugaratnam](/wiki/Tharman_Shanmugaratnam) ([I](/wiki/Independent_politician)) - **[Prime Minister of Singapore](/wiki/Prime_Minister_of_Singapore)** - [Lawrence Wong](/wiki/Lawrence_Wong) ([PAP](/wiki/People%27s_Action_Party)) - [Cabinet](/wiki/Cabinet_of_Singapore) - [Ministries](/wiki/Organisation_of_the_Government_of_Singapore) - [The Reserves](/wiki/Reserves_of_the_Government_of_Singapore) Judiciary - **[Supreme Court of Singapore](/wiki/Supreme_Court_of_Singapore)** - [Chief Justice](/wiki/Chief_Justice_of_Singapore) [Sundaresh Menon](/wiki/Sundaresh_Menon) - **[Court of Appeal](/wiki/Court_of_Appeal_of_Singapore)** - [Prakash](/wiki/Judith_Prakash) - [Tay](/wiki/Tay_Yong_Kwang) - [Chong](/wiki/Steven_Chong) - [Ang](/wiki/Belinda_Ang) - **[High Court](/wiki/High_Court_of_Singapore)** - [State Courts](/wiki/State_Courts_of_Singapore) [Elections](/wiki/Elections_in_Singapore) - [Presidential elections](/wiki/Presidential_elections_in_Singapore) - [General elections](/wiki/General_elections_in_Singapore) Singapore portal - [Other countries](/wiki/Outline_of_political_science#Politics_by_region) - v - t - e Under the [Constitution of Singapore](/wiki/Constitution_of_Singapore), the **judicial system of Singapore** is divided into the [Supreme Court](/wiki/Supreme_Court_of_Singapore) which comprises the [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore) and the [High Court](/wiki/High_Court_of_Singapore), and the subordinate courts, namely the [State Courts](/wiki/State_Courts_of_Singapore) and [Family Justice Courts](/wiki/Family_Justice_Courts) - collectively known as SG Courts. As one of the three branches of the Singapore government, the judiciary enforces and interprets the laws, ensuring that all are equal before the law and have access to justice. The judiciary is headed by the [Chief Justice](/wiki/Chief_Justice_of_Singapore). Singapore practices the [common law](/wiki/Common_law) legal system, where the decisions of higher courts constitute binding [precedent](/wiki/Precedent) upon courts of equal or lower status within their jurisdiction, as opposed to the [civil law](/wiki/Civil_law_(legal_system)) legal system in continental Europe. The current criminal code was preceded by the [Indian Penal Code](/wiki/Indian_Penal_Code) which was adopted when Singapore was a [Crown colony](/wiki/Crown_colony) of the [British Empire](/wiki/British_Empire). ## History After gaining independence in 1965, following the [Japanese Occupation](/wiki/Japanese_occupation_of_Singapore), Singapore re-established its [Supreme Court](/wiki/Supreme_Court_of_Singapore) in 1969, comprising the [High Court](/wiki/High_Court_of_Singapore), the [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore), and the Court of Criminal Appeal. [Jury trials](/wiki/Jury_trial) were abolished in 1969, and the Criminal Procedure Code was amended in 1992 to allow for trials of capital offences to be heard before a single judge. Judicial Commissioners were introduced in 1986 to assist with the judiciary’s workload, and the first female judges were appointed in the early 1990s. In 1993, the appellate system was streamlined into a single [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore) for both civil and criminal cases. The [State Courts](/wiki/State_Courts_of_Singapore) were formally established under the Subordinate Courts Act 1970, consolidating District Courts, Magistrates’ Courts, Juvenile Courts, and Coroners’ Courts into a unified subordinate judiciary. The Family Courts were established in 1995 to handle family-related matters under the Women’s Charter, later expanding to include divorce, nullity, and guardianship cases. In 2014, the Family Courts was restructured into the [Family Justice Courts](/wiki/Family_Justice_Courts) under the Family Justice Act, effective 1 October 2014. The courts include the Family Division of the High Court, Family Courts, and Youth Courts (formerly the Juvenile Court). ## Structure of the courts ### Supreme Court The Supreme Court consists of the [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore) and the [High Court](/wiki/High_Court_of_Singapore). The Court of Appeal exercises [appellate](/wiki/Appellate) criminal and civil jurisdiction, while the High Court exercises both original and appellate criminal and civil jurisdiction. The [Chief Justice](/wiki/Chief_Justice_of_Singapore), Judges of Appeal, [Judicial Commissioners](/wiki/Judicial_Commissioner) and High Court Judges are appointed by the [President](/wiki/President_of_Singapore) from candidates recommended by the [Prime Minister](/wiki/Prime_Minister_of_Singapore). The prime minister must consult with the Chief Justice before recommending the judges.[*citation needed*] ### State Courts The State Courts are the District and Magistrate Courts—both of which oversee civil and criminal matters—as well as specialised courts such as the coroner's courts and the Small Claims Tribunals. In 2023, there were 178,080 cases filed in the State Courts. ### Family Justice Courts The Family Justice Courts was established in 2014 to bring together the courts from the Supreme Court and State Courts that hear cases relating to youth and family issues.[*citation needed*] ## About the legal system The three branches of government are the Judiciary, the Executive, and the Legislature. Designed to ensure that there are checks and balances to prevent abuse of power, the three-branch arrangement is set by the [Constitution](/wiki/Constitution_of_Singapore), the most fundamental law in Singapore. - The Judiciary enforces and interprets the laws independently without influence from other branches of Government. Comprising the court system and all officers working for the courts, the Judiciary is headed by the [Chief Justice](/wiki/Chief_Justice_of_Singapore). - The [Executive](/wiki/Government_of_Singapore#Composition) formulates policy and administers the running of the state. It comprises the Cabinet, various public service agencies, and is led by the [Prime Minister](/wiki/Prime_Minister_of_Singapore), who is advised by the [Attorney-General](/wiki/Attorney-General_of_Singapore). - The [Legislature](/wiki/Parliament_of_Singapore) is responsible for making the laws. It comprises the Parliament and all members that sit within it. The Legislature is led by the Speaker of Parliament. The [President of Singapore](/wiki/President_of_Singapore) serves as the head of state but is not affiliated with any of the three branches of government. The President's approval is necessary at the final stage of the legislative process for passing laws. The [Attorney-General's Chambers](/wiki/Attorney-General_of_Singapore) provides legal assistance to both the Executive, serving as the government's legal advisor, and the Legislature, acting as parliamentary drafters. The Attorney-General also holds the office of the Public Prosecutor, responsible for overseeing all public prosecutions in Singapore. In this role, the Attorney-General acts independently, without influence from any of the three branches of government. ## Perception ### Ranking In September 2008, a Political and Economic Risk Consultancy (PERC) survey reported Hong Kong and Singapore have the best judicial systems in Asia, with Indonesia and Vietnam the worst: Hong Kong's judicial system scored 1.45 on the scale (zero representing the best performance and 10 the worst); Singapore with a grade of 1.92, followed by Japan (3.50), South Korea (4.62), Taiwan (4.93), the Philippines (6.10), Malaysia (6.47), India (6.50), Thailand (7.00), China (7.25), Vietnam (8.10) and Indonesia (8.26). In 2010, the Rule of Law Index by the World Justice Project ranked Singapore number one for access to civil justice in the high-income countries group. In 2021, the Rule of Law Index ranked Singapore 17th out of 139 countries on rule of law. ### Judicial independence Singapore has a reputation for fairness and impartiality in [commercial law](/wiki/Commercial_law), and is a popular jurisdiction for arbitration and trial in Southeast Asia. The Canadian case of *[Oakwell Engineering v. Enernorth Industries](/wiki/Oakwell_Engineering_v._Enernorth_Industries)* called into question this impartiality and raised the issue of whether the judgments of Singaporean courts are enforceable outside Singapore, but claims of links between the judiciary, business and the executive arm in Singapore which were alleged to suggest a real risk of judicial bias were dismissed in appeals to the [Court of Appeal for Ontario](/wiki/Court_of_Appeal_for_Ontario) and [Canadian Supreme Court](/wiki/Canadian_Supreme_Court). In 2004, the [United States Department of State](/wiki/United_States_Department_of_State) claimed that the [President of Singapore](/wiki/President_of_Singapore) and the [Minister for Home Affairs](/wiki/Ministry_of_Home_Affairs_(Singapore)) have substantial *[de facto](/wiki/De_facto)* judicial power, leading \"to a perception that the judiciary reflected the views of the ruling party in politically sensitive cases.\" In addition, Singapore's \"judicial officials, especially the Supreme Court, have close ties to the [ruling party](/wiki/People%27s_Action_Party) and its leaders\". It also claimed that government leaders historically have used court proceedings, in particular defamation suits, against political opponents and critics, leading to a perception that the judiciary reflected the views of the ruling party in politically sensitive cases. Notable cases include those against opposition leaders [J. B. Jeyaretnam](/wiki/J._B._Jeyaretnam) and [Chee Soon Juan](/wiki/Chee_Soon_Juan). In 1997, Australian Q.C. [Stuart Littlemore](/wiki/Stuart_Littlemore) observed the proceedings of a high-profile defamation suit filed by Prime Minister [Goh Chok Tong](/wiki/Goh_Chok_Tong) against Jeyaretnam on behalf of the Geneva-based [International Commission of Jurists](/wiki/International_Commission_of_Jurists) (ICJ). This was followed by his ICJ report stating that the Singapore judiciary was compliant to the ruling [People's Action Party](/wiki/People%27s_Action_Party) (PAP), observations which the Ministry of Law denied, and the ICJ subsequently defended. Littlemore's application to represent Chee Soon Juan in 2002 for another defamation suit was rejected by the High Court for his previous remarks about the judiciary that were seen as contemptuous and disrespectful. On the other hand, [Transparency International](/wiki/Transparency_International) noted in its 2006 country study report on Singapore that truth was a defence to the \"accusations and insinuations of [nepotism](/wiki/Nepotism) and favouritism in government appointments\" against government leaders that led to the defamation suits, and \"[a]s such, if a serious accusation is made, the public hearing of these suits would give the defendant a prime opportunity to put forward the facts they allege. However, none of the defendants have proved the truth of their allegations.\" - [High Court of Singapore](/wiki/High_Court_of_Singapore) - [Lawyers in Singapore](/wiki/Lawyers_in_Singapore) - [Judicial officers of the Republic of Singapore](/wiki/Judicial_officers_of_the_Republic_of_Singapore) - [Supreme Court of Singapore](/wiki/Supreme_Court_of_Singapore) - Karen Blöchlinger (2000). \"*Primus Inter Pares*: Is the Singapore Judiciary First among Equals?\". *[Pacific Rim Law and Policy Journal](/wiki/Pacific_Rim_Law_and_Policy_Journal)*. **9**: 591. - Peng Hong Ng (1995). Rowat, Malcolm; Malik, Waleed H.; Dakolias, Maria (eds.). \"Judicial Reform in Latin America and the Caribbean: Proceedings of a World Bank Conference [World Bank Technical Paper No. 280]\". *Judicial Reform in Latin America and the Caribbean*. Judicial Reform in Singapore: Reducing Backlogs and Court Delays. Washington, D.C.: [International Bank for Reconstruction and Development](/wiki/International_Bank_for_Reconstruction_and_Development)/[World Bank](/wiki/World_Bank): 127–133. [ISBN](/wiki/ISBN_(identifier)) 978-0-8213-3206-1. - Ross Worthington (2001). \"Between Hermes and Themis: An Empirical Study of the Contemporary Judiciary in Singapore\". *Journal of Law and Society*. **28** (4): 490. [doi](/wiki/Doi_(identifier)):10.1111/1467-6478.00200.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:15:09.348039",
  "title": "Judicial system of Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Judicial_system_of_Singapore"
}