{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:15:05.424518"
  },
  "content": "Judicial independence in the nation **[Judicial independence](/wiki/Judicial_independence)** is protected by **[Singapore](/wiki/Singapore)'**s [Constitution](/wiki/Constitution_of_Singapore), statutes such as the State Courts Act and Supreme Court of Judicature Act, and the [common law](/wiki/Common_law). [Independence of the judiciary](/wiki/Judicial_independence) is the principle that the [judiciary](/wiki/Judiciary) should be separated from [legislative](/wiki/Legislature) and [executive](/wiki/Executive_(government)) power, and shielded from inappropriate pressure from these branches of government, and from private or partisan interests. It is crucial as it serves as a foundation for the [rule of law](/wiki/Rule_of_law) and [democracy](/wiki/Democracy). To safeguard judicial independence, [Singapore law](/wiki/Law_of_Singapore) lays down special procedures to be followed before the conduct of [Supreme Court](/wiki/Supreme_Court_of_Singapore) [judges](/wiki/Judicial_officers_of_the_Republic_of_Singapore#The_Chief_Justice,_Judges_of_Appeal,_Judges_and_Judicial_Commissioners) may be discussed in [Parliament](/wiki/Parliament_of_Singapore) and for their removal from office for misconduct, and provides that their remuneration may not be reduced during their tenure. By statute, judicial officers of the [State Courts](/wiki/Subordinate_Courts_of_Singapore), and the Registrar, Deputy Registrar and assistant registrars of the Supreme Court have immunity from civil suits, and are prohibited from hearing and deciding cases in which they are personally interested. The common law provides similar protections and disabilities for Supreme Court judges. Both the State Courts and Supreme Court have power to punish for [contempt of court](/wiki/Contempt_of_court), though only the Supreme Court may convict persons of the [offence of scandalizing the court](/wiki/Offence_of_scandalizing_the_court_in_Singapore). The [Chief Justice](/wiki/Chief_Justice_of_Singapore) and other Supreme Court judges are appointed by the [President](/wiki/President_of_Singapore) acting on the advice of [Cabinet](/wiki/Cabinet_of_Singapore). The President must consult the Chief Justice when appointing other judges, and may exercise personal discretion to refuse to make an appointment if he does not concur with the Cabinet's advice. Supreme Court justices enjoy [security of tenure](/wiki/Security_of_tenure) up to the age of 65 years, after which they cease to hold office. However, the Constitution permits such judges to be re-appointed on a term basis, as well as for [judicial commissioners](/wiki/Judicial_commissioner) to be appointed for limited periods, including the hearing of single cases. Judicial officers of the State Courts are also appointed on a term basis by the Legal Service Commission (LSC), and can be transferred from the courts to other government departments to serve as legal officers, and *vice versa*. It has been claimed that this creates a risk of executive interference, although a 1986 inquiry into such allegations found no evidence of this. The courts exercise [judicial review](/wiki/Judicial_review) of executive actions and legislation for compliance with the Constitution, empowering statutes and [administrative law](/wiki/Administrative_law_in_Singapore) principles. Though it has been noted that there is a low incidence of judicial disagreement with the executive, this may not be evidence of undue deference to the executive but may merely be that the executive has attained a high degree of fairness in its decision-making. The fact that a large number of [defamation](/wiki/Defamation) cases involving opponents of the [Government](/wiki/Government_of_Singapore) have been decided in favour of the Government and members of the ruling [People's Action Party](/wiki/People%27s_Action_Party) has led to criticism that the judiciary is not impartial. On the other hand, it has been pointed out that the defendants in such cases have not been successful in proving the truth of the allegedly defamatory facts. ## Theory of judicial independence ### Importance [Judicial independence](/wiki/Judicial_independence) serves as a safeguard for the rights and privileges provided by the [Constitution](/wiki/Constitution_of_Singapore) and prevents [executive](/wiki/Executive_(government)) and [legislative](/wiki/Legislature) encroachment upon those rights. It serves as a foundation for the [rule of law](/wiki/Rule_of_law) and [democracy](/wiki/Democracy). The rule of law means that all authority and power must come from an ultimate source of law. Under an independent judicial system, the courts and its officers are free from inappropriate intervention in the [judiciary](/wiki/Judiciary)'s affairs. With this independence, the judiciary can safeguard people's rights and freedoms which ensure equal protection for all. The effectiveness of the law and the respect that people have for the law and the government which enacts it is dependent upon the judiciary's independence to mete out fair decisions. Furthermore, it is a pillar of economic growth as multinational businesses and investors have confidence to invest in the economy of a nation who has a strong and stable judiciary that is independent of interference. The judiciary's role in deciding the validity of [presidential](/wiki/Presidential_elections_in_Singapore) and [parliamentary elections](/wiki/Parliamentary_elections_in_Singapore) also necessitates independence of the judiciary. ### Disadvantages The disadvantages of having a judiciary that is seemingly too independent include possible abuse of power by judges. Self-interest, ideological dedication and even corruption may influence the decisions of judges without any [checks and balances](/wiki/Separation_of_powers#Checks_and_balances) in place to prevent this abuse of power if the judiciary is completely independent. The relationship between the judiciary and the executive is a complex series of dependencies and interdependencies which counter-check each other and must be carefully balanced. One cannot be too independent of the other. Furthermore, judicial support of the executive is not as negative as it seems as the executive is the branch of government with the greatest claim to democratic legitimacy. If the judiciary and executive are constantly feuding, no government can function well. Also, an extremely independent judiciary would lack judicial accountability, which is the duty of a public decision-maker to explain and justify a decision and to make amendments where a decision causes injustice or harm. Judges are not required to give an entire account of their rationale behind decisions, and are shielded against public scrutiny and protected from legal repercussions. However judicial accountability can reinforce judicial independence as it could show that judges have proper reasons and rationales for arriving at a particular decision. While judges are not democratically accountable to the people, the key is for judges to achieve equilibrium between the two to ensure that justice is upheld. ## Legal safeguards Part VII of the Constitution of the Republic of Singapore is the main legislation which protects the independence of Supreme Court judges. Article 93 vests judicial power in the judiciary without placing any restriction on how it may be exercised in matters within the court's jurisdiction, which shows recognition and acceptance of the judiciary as an independent institution in [Singapore](/wiki/Singapore). Part VII also provides other legislative safeguards which act as a protective wall against external pressures. These safeguards cannot be amended unless the changes are supported on the [Second](/wiki/Reading_(legislature)#Second_reading) and [Third Readings](/wiki/Reading_(legislature)#Third_reading) of constitutional amendment bills by the votes of not less than two-thirds of all [elected Members of Parliament](/wiki/Parliament_of_Singapore#Elected_Members). Other legislation which provides safeguards for judicial independence, particularly of junior Supreme Court judicial officers and judicial officers of the State Courts, includes the Judicial Proceedings (Regulation of Reports) Act, Legal Aid and Advice Act, Legal Profession Act, State Courts Act, and Supreme Court of Judicature Act. In addition, under the Code of Conduct for the [Attorney-General's Chambers](/wiki/Attorney-General_of_Singapore) legal officers are required to, among other things, \"safeguard and enhance the proper administration of justice\". ### Appointment of judges [Judges](/wiki/Judicial_officers_of_the_Republic_of_Singapore#The_Chief_Justice,_Judges_of_Appeal,_Judges_and_Judicial_Commissioners) of the [Supreme Court](/wiki/Supreme_Court_of_Singapore) are appointed by the [President](/wiki/President_of_Singapore) acting on the advice of his [Cabinet](/wiki/Cabinet_of_Singapore). The President exercises personal discretion to [refuse to make an appointment](/wiki/Powers_of_the_President_of_Singapore#Powers_relating_to_key_office_holders) if he does not concur with the Cabinet's advice. The [Chief Justice](/wiki/Chief_Justice_of_Singapore) must be consulted, though it is unclear how much weight his opinion carries. It has been noted that the current constitutional arrangements enable \"[a] well-meaning Executive, sincerely believing in the justness and legitimacy of its governmental programme,... to appoint Judges who, in essence, believe in the same fundamental policies. The problem is that this is anathema to the logic of the [separation of powers](/wiki/Separation_of_powers_in_Singapore), directed as it is on the potential for the abuse or misuse of power.\" It is possible for an executive \"bent on preserving its power at any cost\" to control the judicial appointment process entirely, which would be undesirable as this may result in a bench packed with compliant judges. On the other hand, alternative judicial appointment methods have their own problems such as the possibility that judges cannot be appointed because decision-makers are unable to agree on the matter. As former [Chief Justice of Australia](/wiki/Chief_Justice_of_Australia) [Harry Gibbs](/wiki/Harry_Gibbs) pointed out: > Judicial commissions, advisory committees and procedures for consultation will all be useless unless there exists, among the politicians of all parties, a realization that the interest of the community requires that neither political nor personal patronage nor a desire to placate any section of a society, should play any part in making judicial appointments. The current judicial appointment system may also lead to a [Bench](/wiki/Bench_(law)) enjoying legitimacy as it is aligned with popular opinion. A positive result may be a cohesive state with an interdependent judiciary and executive where the judiciary is unlikely to become too activist and the executive pays due regard to laws. ### Removal of judges In Singapore, judges can only be removed for misbehaviour or incapacity. Removal of a judge of the Supreme Court may only be effected upon the recommendation of a tribunal of his or her peers. Such a system is arguably better than a system of removal by politicians in securing judicial independence as there will be less exploitation by politicians seeking to influence judges. ### Security of tenure #### Supreme Court judges According to [Alexander Hamilton](/wiki/Alexander_Hamilton), [security of tenure](/wiki/Security_of_tenure) of judicial offices is important for judicial independence, as appointments that require periodic renewal by the executive or legislature render the judiciary liable to rule in favour of these branches of government. While Supreme Court judges in Singapore do not have tenure for life, they have security of tenure up to the age of 65 years, after which they cease to hold office. A person who has ceased to hold the office of a judge may be appointed as Chief Justice or may sit as a judge of the [High Court](/wiki/High_Court_of_Singapore) or a Judge of Appeal for a designated period as directed by the President if he concurs in his personal discretion with the Prime Minister's advice on the matter. In addition, to facilitate the disposal of business in the Supreme Court, [judicial commissioners](/wiki/Judicial_Commissioner) may be appointed for limited periods, including the hearing of a single case only. This is generally done to clear a backlog of cases, or to test a judicial commissioner's suitability for appointment as a judge. Although judicial commissioners do not enjoy security of tenure, they have the same powers and enjoy the same immunities as Supreme Court judges. It has been suggested that the risk that such judges may not act independently is mitigated by public scrutiny of judicial decisions and the fact that it is to the judge's advantage, for future appointment, if he or she were to act independently in accordance with the law. Also, issues of independence will not usually arise as most of the disputes adjudicated by judicial commissioners will not involve the other arms of government. #### State Court judges District judges and magistrates of the [State Courts](/wiki/Subordinate_Courts_of_Singapore) are appointed to their positions by the Legal Service Commission (LSC) on a term basis, and do not enjoy security of tenure. These judges can be transferred by the LSC from the courts to other government departments to serve as legal officers, and *vice versa*. This may be said to create a risk of executive interference. The transfer of Senior District Judge Michael Khoo is often cited as an illustration of this. Opposition [Member of Parliament](/wiki/List_of_Singapore_MPs) [J.B. Jeyaretnam](/wiki/Joshua_Benjamin_Jeyaretnam) and a co-accused had each been charged with three charges of having fraudulently transferred cheques to prevent the distribution of money to the creditors of the [Workers' Party of Singapore](/wiki/Workers%27_Party_of_Singapore), and one charge of making a false declaration. In January 1981, Khoo acquitted the defendants of all charges except a single charge of fraud involving a cheque for [S$](/wiki/Singapore_dollar)400. He sentenced Jeyaretnam to a $1,000 fine, which was below the amount of $2,000 that would have caused him to lose his seat in Parliament. Upon the Public Prosecutor's appeal to the High Court, [Chief Justice](/wiki/Chief_Justice_of_Singapore) [Wee Chong Jin](/wiki/Wee_Chong_Jin) ordered retrials on the two charges of [cheque fraud](/wiki/Cheque_fraud) that the defendants had been acquitted of. In August 1981, before the retrials, Khoo was transferred to the Attorney General's Chambers to take up appointment as a deputy public prosecutor. The defendants were convicted of the charges by a different senior district judge and sentenced to three months' imprisonment each. Jeyaretnam and his co-accused then appealed to the High Court, which confirmed their convictions but reduced the sentences to a fine of $5,000 each. However, a commission of inquiry convened in 1986 to examine Khoo's transfer determined that no evidence of executive interference in the State Courts had been presented, and that the transfer had been decided by the Chief Justice in consultation with the Attorney-General. It did not investigate why the transfer was made. In Parliamentary debates before and after the inquiry it was suggested on the one hand that the transfer had been routine and the timing coincidental, and on the other that it was related to Khoo's competence in handling the case. The reason for the transfer was never clearly established. While a potential for executive interference exists due to the LSC's control of State Court judicial appointments, it has been commented that in a small state like Singapore it may not be practical to have a separate judicial and legal service. Also, the appointment process may not be detrimental to the independence of the lower judiciary as the Chief Justice, who is not part of the executive or legislature, is the head of the LSC and has the final say on judicial postings. ### Remuneration Appropriate remuneration is important for judicial independence as \"a power over a man's subsistence amounts to a power over his will\". In Singapore, a Supreme Court judge's remuneration is constitutionally protected as it may not be reduced during his or her tenure. Additionally, the quantum of remuneration is adequate to accord judges a standard of living which matches their standing in society. Such measures prevent judicial corruption, which would damage judicial independence, as judges who are poorly paid are more likely to succumb to bribes from interested parties. However, the Constitution does not prevent the Government from instituting a policy of positive incentivization by increasing judicial pay whenever decisions go their way. There is no evidence that this has occurred. ### Immunity from civil suits Immunity from suits for acts or omissions in the discharge of judicial duties can promote the independence of judges in their decision-making. The State Courts Act (\"SCA\") provides that a judicial officer of the State Courts – that is, a district judge, magistrate, [coroner](/wiki/Coroner) or registrar – may not be sued for any act done by him in the discharge of his judicial duty, whether or not the judge is acting within the limits of his [jurisdiction](/wiki/Jurisdiction), so long as at the time he in [good faith](/wiki/Good_faith) believed himself to have jurisdiction to do or order the act complained of. There is no corresponding statutory provision applicable to Supreme Court judges, but at [common law](/wiki/Common_law) a superior court judge enjoys absolute immunity from personal civil liability in respect of any judicial act which he does in his capacity as a judge. The immunity extends to acts done outside the judge's jurisdiction, so long as he has acted reasonably and believing in good faith that the act was within his powers. Like judicial officers of the State Courts, the Registrar, Deputy Registrar, Assistant Registrars and other persons acting judicially in the Supreme Court are given statutory immunity from civil suit. ### Measures protecting respect and support for the judiciary The conduct of a Supreme Court judge cannot be discussed in Parliament, except on a substantive [motion](/wiki/Motion_(parliamentary_procedure)) of which notice has been given by not less than a quarter of the total number of MPs. In Singapore's context, given the large majority of seats held by the ruling party and the [whip system](/wiki/Parliament_of_Singapore#Party_whip) that is in place, it is not difficult for the 25% requirement to be achieved. The procedure has not been invoked to date. Additionally, the law provides that the High Court and the [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore) have power to punish for [contempt of court](/wiki/Contempt_of_court). This has been interpreted by the courts to include punishing a person for [scandalizing the court](/wiki/Offence_of_scandalizing_the_court_in_Singapore) when he or she is not in a judge's physical presence and in a context unconnected with matters pending before the Supreme Court. On the other hand, the State Courts only have power to punish contemptuous acts committed or words spoken in the face of the court or in connection with proceedings in the courts. ### Judges not to act where personally interested To maintain public confidence in the judiciary, it is important to maximize judges' independence from personal interests, beliefs and prejudices, and ensure that they are not perceived to be affected by their personal beliefs and prejudices. The State Courts Act and Supreme Court of Judicature Act (\"SCJA\") provide that judicial officers of the State Courts, and the Registrar, Deputy Registrar and assistant registrars of the Supreme Court, are not permitted to investigate or hear and decide any proceedings to or in which they are parties or personally interested, unless the parties to the proceedings have consented and the Chief Justice has given approval. In addition, judges should be independent from the pressures exerted by third parties such as the general public, the media and [non-governmental organizations](/wiki/Non-governmental_organization). To reduce direct third-party influence on judges, the SCA and SCJA provide that judicial officers of the State Courts, and the Registrar, Deputy Registrar and assistant registrars of the Supreme Court, cannot take any office of emolument (that is, a paid position), carry out any business directly or indirectly, or accept fees for any office, perquisites, [emoluments](/wiki/Emoluments) or advantages in addition to their salaries and allowances. While judges cannot join private legal practice during their tenure, Singapore law does not forbid judges who have resigned or retired to return to private practice. It has been said that this causes potential executive interference with judicial independence to be counterproductive, and may give a judge more confidence to decide disputes without fear or favour. The SCJA does not contain any provisions similar to the ones referred to above that apply to Supreme Court judges. Nonetheless, at common law a judge can be disqualified from hearing or deciding a case if he or she is actually biased against a party, or appears to biased. The test for apparent bias is whether a reasonable and fair-minded person sitting in court and knowing all the relevant facts would have a reasonable suspicion that a fair trial for the litigant is not possible. ## In practice ### Judicial review Article 4 of the Constitution declares: \"This Constitution is the supreme law of the Republic of Singapore and any law enacted by the Legislature after the commencement of this Constitution which is inconsistent with this Constitution shall, to the extent of the inconsistency, be void.\" As regards laws that were in force prior to the Constitution coming into force on 9 August 1965, Article 162 states that they continue to apply after the Constitution's commencement but must be construed with such modifications, adaptations, qualifications and exceptions as may be necessary to bring them into conformity with the Constitution. Although neither of these Articles expressly confers power on the judiciary to strike down unconstitutional executive decisions or laws, the High Court held in the 1994 case *[Chan Hiang Leng Colin v. Public Prosecutor](/wiki/Chan_Hiang_Leng_Colin_v._Public_Prosecutor)*: > The court has the power and duty to ensure that the provisions of the Constitution are observed. The court also has a duty to declare invalid any exercise of power, legislative and executive, which exceeds the limits of the power conferred by the Constitution, or which contravenes any prohibition which the Constitution provides. In addition, the courts possess the power of judicial review to correct or nullify executive acts or decisions which are contrary to the executive's statutory powers or otherwise contravene [administrative law](/wiki/Administrative_law_in_Singapore) principles. The low incidence of judicial disagreement with the executive in Singapore has been noted by commentators, but may not necessarily mean that the judiciary is unduly deferential to the executive. It may be the case that the executive has attained a high degree of fairness in its own decision-making. In 1989, Parliament intentionally curtailed the judiciary's ability to exercise judicial review of executive decisions made pursuant to the [Internal Security Act](/wiki/Internal_Security_Act_(Singapore)). ### Statutory interpretation When it comes to interpreting [statutes](/wiki/Statute), judges are expected to abide by the rules set out by the Legislature. On 26 February 1993, the Interpretation (Amendment) Act 1993 was passed to reform the law relating to statutory interpretation. The amending Act inserted section 9A into the Interpretation Act, which mandates that judges take a [purposive approach](/wiki/Purposive_rule) to interpreting written law by requiring that an interpretation that promotes the purpose or object underlying the law be preferred to one that does not promote the purpose or object. In determining the meaning of a provision of written law, the court may consider extrinsic materials, that is, materials not forming part of the written law. Such materials include the speech made in Parliament by a minister during the [Second Reading](/wiki/Reading_(legislature)#Second_reading) of a [bill](/wiki/Bill_(proposed_law)) containing the provision, and other relevant material in any official record of Parliamentary debates. Through section 9A, Parliament requires judges to determine the meaning of written law by understanding the Parliamentary intention underlying the law and its purpose. Therefore, judges' freedom when it comes to statutory interpretation is somewhat restricted. However, it may be said that this [deference](/wiki/Judicial_deference) to Parliament is quintessential to uphold the [certainty of law](/wiki/Legal_certainty) and to avoid defeating the Parliament's intention in enacting statutes. ### Criminal proceedings In Singapore, where conviction rates for criminal offences are high, an acquittal is akin to the judiciary rejecting the executive's stand regarding a party's guilt. Although it has been suggested that the low acquittal rate is evidence of a lack of judicial independence, it is also consistent with a stringent prosecution process that takes action only against persons who are manifestly guilty, such that even the most fair and independent-minded judge would decide to convict. Heavy scrutiny of the criminal justice system occurs when a person on trial is a political opponent of the executive government. The [pertinent](/wiki/Pertinent) question here, which is extremely difficult to answer, is whether the judge presiding over that particular case would have arrived at his decision in a different manner if the accused had not been a political opponent. However, the impartiality of the judiciary cannot necessarily be impugned on the ground that the courts have to enforce laws or rules of evidence and procedure that are felt to be unjust, because even the most independent judiciary must comply with laws enacted by the legislature. ### [Defamation](/wiki/Defamation) suits Government leaders historically have used court proceedings, in particular defamation suits, against political opponents and critics, leading to a perception that the judiciary reflected the views of the ruling party in politically sensitive cases. According to a 1996 report by [Dato'](/wiki/Malay_styles_and_titles#Dato') Param Cumaraswamy, then [United Nations Special Rapporteur](/wiki/United_Nations_Special_Rapporteur) on the independence of judges and lawyers, allegations concerning the independence and impartiality of the Singapore judiciary \"could have stemmed from the very high number of cases won by the [Government](/wiki/Government_of_Singapore) or members of the ruling party in either contempt of court proceedings or [defamation](/wiki/Defamation) suits brought against critics of the Government, be they individuals or the media\". Similar allegations have been made by other commentators. The [United States Department of State](/wiki/United_States_Department_of_State) claims the [President of Singapore](/wiki/President_of_Singapore) and the [Minister for Home Affairs](/wiki/Ministry_of_Home_Affairs_(Singapore)) have substantial *[de facto](/wiki/De_facto)* judicial power, leading \"to a perception that the judiciary reflected the views of the ruling party in politically sensitive cases.\" In addition, Singapore's \"judicial officials, especially the Supreme Court, have close ties to the ruling party and its leaders\". The President appoints judges to the Supreme Court on the recommendation of the Prime Minister and in consultation with the Chief Justice. The President also appoints subordinate court judges on the recommendation of the Chief Justice. Notable cases include those against opposition leaders [J. B. Jeyaretnam](/wiki/J._B._Jeyaretnam) and [Chee Soon Juan](/wiki/Chee_Soon_Juan). In 1997, Australian Q.C. [Stuart Littlemore](/wiki/Stuart_Littlemore) observed the proceedings of a high-profile defamation suit filed by Prime Minister [Goh Chok Tong](/wiki/Goh_Chok_Tong) against Jeyaretnam on behalf of the Geneva-based [International Commission of Jurists](/wiki/International_Commission_of_Jurists) (ICJ). This was followed by his ICJ report stating that the Singapore judiciary was compliant to the ruling [People's Action Party](/wiki/People%27s_Action_Party) (PAP), observations which the Ministry of Law denied, and the ICJ subsequently defended. Littlemore's application to represent Chee Soon Juan in 2002 for another defamation suit was rejected by the High Court for his previous remarks about the judiciary that were seen as contemptuous and disrespectful. These issues have led to the establishment of the [Reform Party (Singapore)](/wiki/Reform_Party_(Singapore)). Who seek an \"independently appointed judiciary\" as a central political goal. [Transparency International](/wiki/Transparency_International), in their 2006 country study report on Singapore, stated that truth was a defence to the \"accusations and insinuations of [nepotism](/wiki/Nepotism) and favouritism in government appointments\" against government leaders that led to the defamation suits, and \"[a]s such, if a serious accusation is made, the public hearing of these suits would give the defendant a prime opportunity to put forward the facts they allege. However, none of the defendants have proved the truth of their allegations.\" ## Notes - [Chan, Sek Keong](/wiki/Chan_Sek_Keong) (2010), \"Securing and Maintaining the Independence of the Court in Judicial Proceedings\", *[Singapore Academy of Law Journal](/wiki/Singapore_Academy_of_Law)*, **22**: 229–251, archived from the original on 22 August 2017. - [Constitution of the Republic of Singapore](/wiki/Constitution_of_Singapore) (1985 Rev. Ed., 1999 Reprint). - [Hamilton, Alexander](/wiki/Alexander_Hamilton) (1982) , \"The Federalist No. 78\", in Jacob E. Cooke (ed.), *The Federalist*, Middletown, Conn.: [Wesleyan University Press](/wiki/Wesleyan_University_Press), pp. 521–530, [ISBN](/wiki/ISBN_(identifier)) 978-0-819-53016-5. - Hor, Michael (2002), \"The Independence of the Criminal Justice System in Singapore\", *Singapore Journal of Legal Studies*: 497–513, [SSRN](/wiki/SSRN_(identifier)) 956056. - Interpretation Act (Cap. 1, 2002 Rev. Ed.) (\"IA\"). - Subordinate Courts Act (Cap. 321, 2007 Rev. Ed.) (\"SCA\"). - Supreme Court of Judicature Act (Cap. 322, 2007 Rev. Ed.) (\"SCJA\"). - [Thio, Li-ann](/wiki/Thio_Li-ann) (2004), \"Rule of Law within a Non-liberal 'Communitarian' Democracy: The Singapore Experience\", in Randall Peerenboom (ed.), *Asian Discourses of Rule of Law: Theories and Implementation of Rule of Law in Twelve Asian Countries, France and the U.S.*, London; New York, N.Y.: [RoutledgeCurzon](/wiki/Routledge), pp. 183–224, [ISBN](/wiki/ISBN_(identifier)) 978-0-415-32613-1. - Warren, Roger K. (January 2003), *The Importance of Judicial Independence and Accountability*, [National Center for State Courts](/wiki/National_Center_for_State_Courts), retrieved 8 August 2010[*dead link*]. ### Articles - Bryan, Kelley; Davidson, Gail; Stanier, Margaret (17 October 2007), *Rule of Law in Singapore: Independence of the Judiciary and the Legal Profession in Singapore*, Lawyers' Rights Watch Canada, archived from the original on 14 December 2011, retrieved 18 August 2010. - [Seow, Francis T.](/wiki/Francis_Seow) (1 February 2002), *The Politics of Judicial Institutions in Singapore* (PDF), [United Nations Public Administration Network](/wiki/United_Nations_Public_Administration_Network), archived from the original (PDF) on 27 February 2012, retrieved 17 August 2010. ### Books - Jayasuriya, Kanishka (1999), \"Corporatism and Judicial Independence within Statist Legal Institutions in East Asia\", in Jayasuriya, Kanishka (ed.), *Law, Capitalism and Power in Asia: The Rule of Law and Legal Institutions*, London; New York, N.Y.: [Routledge](/wiki/Routledge), pp. 173–204, [ISBN](/wiki/ISBN_(identifier)) 978-0-415-19742-7. - Tan, Kevin Y[ew] L[ee] (2011), \"Without Fear or Favour: The Judiciary\", *An Introduction to Singapore's Constitution* (rev. ed.), Singapore: Talisman Publishing, pp. 107–131 at 126–131, [ISBN](/wiki/ISBN_(identifier)) 978-981-08-6456-9. - Tan, Kevin Y[ew] L[ee]; [Thio, Li-ann](/wiki/Thio_Li-ann) (2010), \"The Judiciary\", *Constitutional Law in Malaysia and Singapore* (3rd ed.), Singapore: [LexisNexis](/wiki/LexisNexis), pp. 573–604, [ISBN](/wiki/ISBN_(identifier)) 978-981-236-795-2. - Thean, L[ip] P[ing] (2003), \"Judicial Independence and Effectiveness\", *The Eighth General Assembly and Conference ASEAN Law Association: Workshop Papers, 29 November 2003 to 2 December 2003, Singapore* (PDF), [Singapore]: [ASEAN](/wiki/Association_of_Southeast_Asian_Nations) Law Association, pp. 29–41, archived from the original (PDF) on 22 July 2011. - Official website of the Supreme Court of Singapore - Official website of the State Courts of Singapore\n",
  "language": "en",
  "processed_at": "2026-01-12T11:15:05.423999",
  "title": "Judicial independence in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Judicial_independence_in_Singapore"
}