{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:15:04.520367"
  },
  "content": "Person appointed on a non-permanent basis to a judicial office A **judicial commissioner** is person appointed on a non-permanent basis to a judicial office. In some countries, such as Malaysia and Singapore, judicial commissioners have the powers of full judges. In other jurisdictions their powers are limited. ## Brunei Darussalam A number of serving and retired [Hong Kong High Court](/wiki/High_Court_(Hong_Kong)) Judges are appointed by the [Sultan](/wiki/Sultan_of_Brunei) to sit as [Supreme Court](/wiki/Politics_of_Brunei#Judicial_branch) Judges and Judicial Commissioners in [Brunei](/wiki/Brunei). For example, while Mr Justice Rogers served as Vice President of the [Hong Kong Court of Appeal](/wiki/Court_of_Appeal_(Hong_Kong)), he also sat as a non-resident Judicial Commissioner of the [Supreme Court of Brunei Darussalam](/wiki/Supreme_Court_of_Brunei_Darussalam) between 2010 and 2011. As of 2020, three retired [Hong Kong High Court](/wiki/High_Court_(Hong_Kong)) Judges sit as Judges of the Court of Appeal of Brunei Darussalam (Mr Justice Burrell, who is the President of the Brunei Court of Appeal, and Mr Justice Seagroatt and [Mr Justice Lunn](/wiki/Michael_Lunn), who are Justices of Appeal); two retired [Hong Kong High Court](/wiki/High_Court_(Hong_Kong)) Judges sit as Judicial Commissioners of the Supreme Court of Brunei Darussalam (Mr Justice Findlay and Mr Justice Lugar-Mawson). Further, another retired Hong Kong Judge, Edward Woolley, who previously served as Registrar of the [Court of Final Appeal](/wiki/Court_of_Final_Appeal_(Hong_Kong)), [Deputy High Court Judge](/wiki/High_Court_(Hong_Kong)#Part-time_Deputy_Judges) and [High Court Master](/wiki/High_Court_(Hong_Kong)), sits as a Judicial Commissioner of the Supreme Court of Brunei Darussalam. Justice Kannan Ramesh of the [Supreme Court of Singapore](/wiki/Supreme_Court_of_Singapore) also sits as a Judicial Commissioner of the Supreme Court of Brunei Darussalam. ## Hong Kong In 1983, the position of Commissioner of the [High Court](/wiki/High_Court_(Hong_Kong)) was re-named as [Deputy Judge](/wiki/High_Court_(Hong_Kong)#Part-time_Deputy_Judges) of the High Court. ## Malaysia In Malaysia judicial commissioners are appointed for a term of two years. Judicial commissioners are elected under Article of 122AB Federal Constitution and must go through the selection process by Judicial Appointments Commission (*Suruhanjaya Pelantikan Kehakiman*) if applied pursuant to Section 29 Judicial Appointments Commission Act 2009. ## Singapore In [Singapore](/wiki/Singapore), judicial commissioners are appointed to the [Supreme Court](/wiki/Supreme_Court_of_Singapore) by the [president of Singapore](/wiki/President_of_Singapore) on the [constitutional advice](/wiki/Constitutional_advice) of the [prime minister of Singapore](/wiki/Prime_minister_of_Singapore), and have the powers of a [judge](/wiki/Judge). People may be appointed a judicial commissioner after being a \"qualified person\" within the meaning of Section 2 of the Legal Profession Act and/or a member of the [Singapore Legal Service](/wiki/Singapore_Legal_Service) for at least ten years. The appointment is for a specific period which is determined by the president of Singapore. Many judicial commissioners went on to become judges of the Supreme Court, such as [Andrew Phang Boon Leong](/wiki/Andrew_Phang_Boon_Leong), [Tay Yong Kwang](/wiki/Tay_Yong_Kwang), [Belinda Ang Saw Ean](/wiki/Belinda_Ang_Saw_Ean), [Tan Lee Meng](/wiki/Tan_Lee_Meng) and [V. K. Rajah](/wiki/V._K._Rajah). ## United States ### California Superior court commissioners are subordinate judicial officers who are appointed by, and serve at the pleasure of, the superior court judges. ### Tennessee In Tennessee, judicial commissioners may be appointed at a county level to handle minor criminal matters. ### Wisconsin Similarly, in Wisconsin, a court commissioner is an attorney appointed by a county's [circuit court](/wiki/Circuit_court) judges to handle [small claims](/wiki/Small_claims), preliminary criminal proceedings, and [family court](/wiki/Family_court) cases. ## Notes\n",
  "language": "en",
  "processed_at": "2026-01-12T11:15:04.519986",
  "title": "Judicial commissioner",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Judicial_commissioner"
}