{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:15:13.261845"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Junction 8\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(December 2016)* *(Learn how and when to remove this message)*Shopping mall in Bishan Place, Singapore **Junction 8** ([Chinese](/wiki/Chinese_language): 碧山第八站; [pinyin](/wiki/Pinyin): *dì bā zhàn*, stylised as **JUNCTI8N**) is a popular heartland [shopping mall](/wiki/Shopping_mall) located in the centre of [Bishan](/wiki/Bishan,_Singapore). It is located outside [Bishan MRT station](/wiki/Bishan_MRT_station) and [Bishan Bus Interchange](/wiki/Bishan_Bus_Interchange). ## Etymology The name of this shopping centre was derived from the old station numbering of the [North South line](/wiki/North_South_MRT_line) sector of nearby [Bishan](/wiki/Bishan_MRT_station) (N8). ## History Junction 8 was completed and opened in November 1993 and officially opened on 22 January 1994 by Minister for Home Affairs [Wong Kan Seng](/wiki/Wong_Kan_Seng). Junction 8 was developed as a joint venture between Singapore Technologies Industrial Corporation (STIC) and Liang Court Holdings. When it first opened, it had 73 tenants, such as a Daimaru department store and supermarket, a Golden Village cineplex, Food Junction's first outlet, a duplex level SAFE Superstore and various specialty shops settling in a mall environment for the first time. In 2004, the mall had an expansion block expanded to accommodate more retail spaces and a linkbridge was built, connecting to the car park opposite the mall. Daimaru was replaced by NTUC FairPrice and Seiyu (now BHG, subsequently replaced with Sketchers and other stores) during the former's exit from Singapore in 2003. The roof garden was relocated from Level 2 to Level 3, equipped with a children's playground and an event plaza. Also, the office tower space was decanted into the retail mall, and was subsequently leased to voluntary welfare organisations. In 2013, it underwent a major renovation, repainting its exterior and refreshing the interior of the mall. The children's playground was also renovated. The mall's basement was connected to the southbound platform of Bishan MRT station. In March 2025, the famous newsstand Newspoint at Junction 8 permanently closed down after 30 years, due to [URA](/wiki/Urban_Redevelopment_Authority)'s plan to develop new offices and work spaces in the region. - [List of shopping malls in Singapore](/wiki/List_of_shopping_malls_in_Singapore) - Official website This [Singapore](/wiki/Singapore) location article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:15:13.261451",
  "title": "Junction 8",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Junction_8"
}