{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:15:15.500534"
  },
  "content": "Type of pre-university educational institution in Singapore **Junior colleges** (JC) are pre-university institutions in [Singapore](/wiki/Singapore) that offer two-year pre-university courses that leads to either the [Singapore-Cambridge GCE Advanced Level](/wiki/Singapore-Cambridge_GCE_Advanced_Level) (A-Level) or the [International Baccalaureate Diploma](/wiki/International_Baccalaureate_Diploma) (IB - offered by only Anglo-Chinese School, School of the Arts, Singapore Sports School, and St. Joseph’s Institution). Admission to junior college is based on attaining an aggregate raw score of 20 points or less in the [O-Level](/wiki/Singapore-Cambridge_GCE_Ordinary_Level) examination. ## History of JCs The junior college system was first introduced at the end of the 1960s as a standardisation of all pre-university courses offered by various high schools in Singapore. It aims to offer a challenging environment for students to develop their talents, both academically and non-academically. The educational blueprint of a junior college system was first made public by [Prime Minister](/wiki/Prime_Minister_of_Singapore) [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) in May 1965, terming it as a \"super secondary boarding school\". The first junior college, subsequently named [National Junior College](/wiki/National_Junior_College), was the first specialised co-educational government school established in independent Singapore for pre-university students. In December 1965, then-Minister for Education [Ong Pang Boon](/wiki/Ong_Pang_Boon) announced that the centralised \"junior college\" system would replace the pre-university education that are formerly conducted at various middle schools across the state, in order to optimise the use of teachers and laboratory facilities and open up more educational opportunities for [pre-university](/wiki/Pre-university) students. National Junior College was officially declared open by [Prime Minister](/wiki/Prime_Minister_of_Singapore) [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) on 14 May 1970. In 1970, the [Singapore Chinese Chamber of Commerce and Industry](/wiki/Singapore_Chinese_Chamber_of_Commerce_and_Industry) (SCCCI) collaborated with the Singapore government to fund the establishment of two junior colleges. Mr [Tan Keong Choon](/wiki/Tan_Keong_Choon), a prominent businessman and the managing director of the board of [The Chinese High School](/wiki/The_Chinese_High_School_(Singapore)) was appointed to oversee the project, estimated to cost S$2.2 million of which half of the total funds is to be funded by SCCCI. In 1974, Hwa Chong Junior College was officially inaugurated as the first government-aided junior college in Singapore. With the graduation of the last batch of pre-university classes from various high schools, pre-university courses were officially ceased at all high schools by 1975. In the past, there used to be two intakes, namely the Provisional Admission Exercise (PAE) and the Joint Admissions Exercise (JAE). However, from the 2009 academic year onwards, a single intake system is being implemented with the O-level examinations being brought forward to minimise movement and excessive administration work involved in the two-intake system. [*citation needed*] ## Admissions Junior colleges accept students based on their \"[L1R5](/wiki/Singapore-Cambridge_GCE_Ordinary_Level#Subjects)\" aggregate grading attained in the [Singapore-Cambridge GCE Ordinary Level](/wiki/Singapore-Cambridge_GCE_Ordinary_Level) examination. The term L1R5 refers to the aggregate scores attained from the individual subject grades of a first language and five relevant content subjects in the examination. A raw L1R5 score of 20 points or less must be attained for a student to gain admission to a junior college. Lower aggregate is considered better, i e. 7 aggregate score is better than aggregate score 10. There are two ways to be admitted into a junior college: either through the traditional Joint Admissions Exercise (JAE) or through the less common [Direct School Admission](/wiki/Direct_School_Admission) (DSA). ### Joint Admission Exercise (JAE) The Joint Admission Exercise (JAE) is an admission exercise for [Singapore-Cambridge GCE Ordinary Level](/wiki/Singapore-Cambridge_GCE_Ordinary_Level) result holders to gain admission to post-secondary institutes, namely junior colleges, [centralised institutes](/wiki/Centralised_institutes_(Singapore)), [polytechnics](/wiki/Education_in_Singapore) and [institutes of technical education.](/wiki/Institute_of_Technical_Education) ### Integrated Programme (IP) The Integrated Programme (IP) is a 6-year programme that allows students who perform well in the Primary School Leaving Examination (PSLE) to skip the [Singapore-Cambridge GCE Ordinary Level](/wiki/Singapore-Cambridge_GCE_Ordinary_Level) (O-level) examination, and proceed directly to a Junior College to sit for the [Singapore-Cambridge GCE Advanced Level](/wiki/Singapore-Cambridge_GCE_Advanced_Level) (A-level) examination, [International Baccalaureate Diploma](/wiki/International_Baccalaureate_Diploma) (IB), or an equivalent examination, after 6 years. Depending on which IP school they enter, the student may either study for 6 years within the same school which functions as both a secondary school and junior college, or study for 4 years in a secondary school before moving to a separate but affiliated junior college for the next 2 years. ### Direct School Admission (DSA) The Direct School Admission (DSA) exercise is an annual standardised discretionary admission programmes, which students apply directly to the various colleges for placement on the basis of talent which can range from the academic to the cultural and performing arts to sports. Upon acceptance, students will be automatically admitted to the college irrespective of the year's JAE cut-off score, although students will still have to meet the minimum criterion of scoring an L1R5 of below 20 points for entrance into a junior college. ## Academic programmes ### A Level curriculum This section **may need to be rewritten** to comply with Wikipedia's quality standards. Relevant discussion may be found on the talk page. You can help. The talk page may contain suggestions. *(October 2017)* From January 2006, the two-year and three-year university curriculum framework in pre-university centres was replaced with a new and revised curriculum, with the pioneer batch of students sitting for the GCE A-level examinations in 2007. In this newly enforced curriculum, the system of categorising subjects according to \"Alternative Ordinary (AO)\", \"Advanced (A)\" and \"Special (S)\" papers or levels has been replaced with the Higher 1 (H1), Higher 2 (H2) and Higher 3 (H3) categories respectively. H1 and H3 subjects are worth 1 Academic Unit (AU), while H2 subjects are worth 2 AUs. Students are expected to take a minimum of 10 AUs (viz. 3H2+1H1) and a maximum of 12 AUs (viz. 4H2+1H3 or 3H2+2H3), inclusive of Mother Tongue Language (MTL), Project Work and General Paper or Knowledge & Inquiry. However, there have been exceptions; a very small number of outstanding students have been granted approval by MOE to take 13 AUs. Students who have taken the Higher Mother Tongue language paper at the O-level and have obtained a minimum grade of 'D7' are exempted from taking formal MTL lessons and examinations in JC1. However, they are still required to attend MTL-related enrichment and cannot replace the MTL academic unit with another subject, as MTL is still regarded as an integral component of the curriculum. From 2026, PW and the fourth content-based subject (H1 or H2) will not be counted in the calculation of University Admission Score. In tandem with the MOE's aim of achieving more depth rather than mere breadth, the H1 and H2 categories complement each other; in general, a subject taken at H1 is half the breadth of that taken at H2, but is of the same depth and difficulty. For example: - students studying Mathematics at H1 will study fewer Pure Mathematics topics (which are largely Physics-related) than those studying Mathematics at H2, but will still face the same depth and difficulty in similar topics (such as Statistics). - For History, students taking the subject at H1 level will only sit for Paper 1 (International History from 1945–2000), while students taking the subject at H2 level will sit for a similar Paper 1 (International History from 1945–2000) in addition to having to sit for Paper 2 (Southeast Asian History from 1900–1997) as well. - Students taking the Science subjects Physics, Chemistry or Biology at H1 will only sit for the Multiple-Choice Questions (MCQ) and one written paper, while students taking these subjects at H2 level will be required to take an additional written paper with longer structured questions, and the School-based Science Practical Assessment (SPA) or Practical examination. As such, an H1 paper can theoretically be said to be half of the content of an H2 paper albeit being at equal depth and difficulty (as opposed to how \"AO\" level subjects were merely easier papers than the A-level subjects previously). Consequently, this new grouping system bears some resemblance to the International Baccalaureate Diploma A1/A2/SL/HL grouping system. The new curriculum framework gives students more choice of subjects to choose from and enables more permutations of subject combinations. However, students are now required to take up at least one contrasting subject - i.e. Science students have to take up at least one Arts subject, usually Economics, while Arts students must take up at least one Science-based subject, usually Mathematics. This was in contrast to the old curriculum which was criticised for being too specialised and unholistic. For example, subjects previously not available to Arts/Humanities students such as Physics, Chemistry and Biology are now made possible at both H1 and H2 levels, while Science students now have more choice of doing an Arts/Humanities subject (such as Literature) at either H1 or H2 level. Alternatively, students can choose to take up a new subject, Knowledge & Inquiry, in lieu of the General Paper (GP) as a contrasting subject, as Knowledge & Inquiry (KI) is designed to expose students to [epistemology](/wiki/Epistemology) as well as to the construction and nature of knowledge, thus calling for the need to learn across disciplines such as Mathematics, the Sciences and the Humanities. KI is said to be similar to the IB Diploma's Theory of Knowledge paper, albeit with a 2500-3000-word Independent Study research paper, in addition to a sit-in examination paper. Due to its intensive nature, KI is classified as an H2 subject instead of an H1 subject like the General Paper (GP). The \"highest\" level subjects, the H3 subjects, are meant to be more pragmatic and promote critical thinking unlike the previous \"S\" Papers. Under the revised curriculum, H3 subjects are examined either in the form of Research Papers (be it by Cambridge, or by local Universities), Research work (such as the HSSRP and A*Star Research Programmes) or (advanced) University Modules offered by the various local Universities which are approved by the MOE. Consequently, students are able to gain extra credits and skip several modules in the University with the H3 paper done with their other GCE A-level subjects. However, in order to do an H3 subject, students must be offering the corresponding subject at H2 level. H3 subjects are not offered in Millennia Institute. #### Academic Subjects This section **may need to be rewritten** to comply with Wikipedia's quality standards. Relevant discussion may be found on the talk page. You can help. The talk page may contain suggestions. *(October 2017)* The subjects offered under the current Singapore-Cambridge GCE A-level Examinations are: Academic Subjects Examined by Cambridge SubjectsH1H2H3Knowledge SkillsGeneral Paper✔Knowledge and Inquiry✔LanguagesBengali✔China Studies in English✔Chinese Language and Literature✔English Language and Linguistics✔French✔✔German✔✔Gujarati✔Hindi✔Japanese✔✔Malay Language and Literature✔Panjabi✔Spanish✔Tamil Language and Literature✔Urdu✔Humanities and the ArtsArt✔✔✔Economics✔✔✔Geography✔✔✔History✔✔✔Literature in English✔✔✔Music✔✔Theatre Studies and Drama✔Mathematics and SciencesBiology✔✔✔Chemistry✔✔✔Computing✔Physics✔✔✔Mathematics✔✔✔Further Mathematics✔Academic Subjects Examined by Singapore Examinations and Assessment Board SubjectsH1H2H3Knowledge SkillsProject WorkStandard levelLanguagesChina Studies in Chinese✔Chinese BNot an 'A' Level subjectGeneral Studies in ChineseChinese Language✔Chinese Language and Literature✔Malay BNot an 'A' Level subjectMalay Language✔Malay Language and Literature✔Tamil BNot an 'A' Level subjectTamil Language✔Tamil Language and Literature✔Translation (Chinese)✔ **Others**: ***H3 Subjects***: 1. **Research Programmes:** Humanities and Social Sciences Research Programme (HSSRP) by [National University of Singapore](/wiki/National_University_of_Singapore) (NUS), NUS Science Research Programme (NUS H3 SRP), H3-STaR Science Research Programme (only offered to students of NJC), H3 NAV Science Research Programme (only offered to students of VJC). 2.University Modules: Modules such as **\"Geopolitics: Geographies of War and Peace\"** for Geography and History students and **\"Game Theory\"** for Economics students are offered and examined by the [National University of Singapore](/wiki/National_University_of_Singapore) and the [Singapore Management University](/wiki/Singapore_Management_University) respectively. [Nanyang Technological University](/wiki/Nanyang_Technological_University) also offers several modules such as Molecular Biology. Previously, students took two subjects at \"Alternative Ordinary\" level (\"AO\" level), namely their General Paper (GP) and Mother Tongue, and three or four subjects at \"A\" level. \"A\" level subjects include [Economics](/wiki/Economics), Mathematics, Further Mathematics, Physics, Chemistry, Biology, English Literature, History, Geography, Art, Art with Higher Art (A-level) taken by students in the [Art Elective Programme](/wiki/Art_Elective_Programme), Theatre Studies and Drama, Computing, Higher Chinese, Chinese (A-level) Language Elective Programme, Music (A-level), Music with Higher Music (A-Level) taken by students in the Music Elective Programme, General Studies in Chinese, French, German, Japanese (A-level), Malay (A-level), Tamil (A-level). Project Work was also made compulsory from 2003. To gain admittance to local universities, students must pass either General Paper (GP) or Knowledge & Inquiry (KI) and obtain a minimum grade of S for the \"AO\" or \"H1\" level Mother Tongue Language paper. The grade obtained for the Higher Mother Tongue paper taken at \"O\" level may be used in lieu of an \"AO\" or \"H1\" level Mother Tongue Language grade. Since 2008, the scores of a student's three H2 and one H1 subject are computed inclusive of Project Work (PW) and either GP or KI for admittance into local universities (namely NUS, NTU, SMU and SUSS). ## Elective programmes ### Humanities Programme The Humanities Programme is a pre-university programme under the Ministry of Education offered at junior colleges and integrated programme schools. Formerly the Promsho programme (pre-university cum overseas undergraduate scholarship for the study of humanities at Oxbridge), the programme was formally introduced in Hwa Chong Junior College and Raffles Junior College in 1981. The programme is currently offered in the following junior colleges: [Anglo-Chinese Junior College](/wiki/Anglo-Chinese_Junior_College), [Anglo-Chinese School (Independent)](/wiki/Anglo-Chinese_School_(Independent)), [Catholic Junior College](/wiki/Catholic_Junior_College), [Eunoia Junior College](/wiki/Eunoia_Junior_College), [Hwa Chong Institution](/wiki/Hwa_Chong_Institution), [National Junior College](/wiki/National_Junior_College), [Raffles Institution](/wiki/Raffles_Institution), [Temasek Junior College](/wiki/Temasek_Junior_College), and [Victoria Junior College](/wiki/Victoria_Junior_College). Applicants for the Humanities Programme must attain at least a B3 in English for the [Singapore-Cambridge GCE Ordinary Level](/wiki/Singapore-Cambridge_GCE_Ordinary_Level) examination or equivalent. Every student under the Humanities Programme must offer H2 English Literature as a core subject, and offer two other Humanities subjects, as well as one contrasting subject. Singaporean students under the programme are eligible for the Humanities Scholarship offered by the Ministry of Education. ### Language Elective Programmes The Chinese Language Elective Programme (CLEP) was introduced in 1990 in [Hwa Chong Junior College](/wiki/Hwa_Chong_Junior_College) and [Temasek Junior College](/wiki/Temasek_Junior_College). It aims to deepen the field of study of the use of Chinese Language and understanding of contemporary and traditional Chinese literary texts and works. Currently, five junior colleges offer the Chinese Language Elective Programme: [Dunman High School](/wiki/Dunman_High_School), [Hwa Chong Institution](/wiki/Hwa_Chong_Institution), [Jurong Pioneer Junior College](/wiki/Jurong_Pioneer_Junior_College), [Nanyang Junior College](/wiki/Nanyang_Junior_College), and [Temasek Junior College](/wiki/Temasek_Junior_College). Singaporean students under the programme are eligible for the Chinese Language Elective Scholarship offered by the Ministry of Education. The Malay Language Elective Programme (MLEP) was introduced in 2001. It is offered at [Jurong Pioneer Junior College](/wiki/Jurong_Pioneer_Junior_College), [National Junior College](/wiki/National_Junior_College), [Raffles Institution](/wiki/Raffles_Institution), [Tampines Meridian Junior College](/wiki/Tampines_Meridian_Junior_College) and [Yishun Innova Junior College](/wiki/Yishun_Innova_Junior_College). Singaporean students under the programme are eligible for the Malay Language Elective Scholarship (MLES) offered by the Ministry of Education. The Tamil Language Elective Programme (TLEP) was introduced in 2020 at two junior colleges: [Anderson Serangoon Junior College](/wiki/Anderson_Serangoon_Junior_College) and [National Junior College](/wiki/National_Junior_College). Singaporean students under the programme are eligible for the Tamil Language Elective Scholarship (TLES) offered by the Ministry of Education. ### Art Elective Programme The Art Elective Programme in junior colleges is offered as a two-year programme to junior college students with the aptitude and passion for art. It is offered in [Hwa Chong Institution](/wiki/Hwa_Chong_Institution), [Nanyang Junior College](/wiki/Nanyang_Junior_College), and [National Junior College](/wiki/National_Junior_College). Singaporean students under the programme are eligible for the Music Elective Scholarship (MES) offered by the Ministry of Education. ### Music Elective Programme The Music Elective Programme (MEP) in junior colleges is offered as a two-year programme to junior college students with the aptitude and passion for music. It is offered in [Anglo-Chinese Junior College](/wiki/Anglo-Chinese_Junior_College), [Anglo-Chinese School (Independent)](/wiki/Anglo-Chinese_School_(Independent)), [Dunman High School](/wiki/Dunman_High_School), [Eunoia Junior College](/wiki/Eunoia_Junior_College), [Raffles Institution](/wiki/Raffles_Institution), and [Temasek Junior College](/wiki/Temasek_Junior_College). Singaporean students under the programme are eligible for the Music Elective Scholarship (MES) offered by the Ministry of Education. ## School fees, financial assistance, and scholarships This section **may need to be rewritten** to comply with Wikipedia's quality standards. Relevant discussion may be found on the talk page. You can help. The talk page may contain suggestions. *(October 2017)* Singaporean students in most junior colleges and centralised institutes pay subsidised school fees of [S$](/wiki/Singapore_dollar)6 and up to S$27 per month for miscellaneous fees. However, independent junior colleges require Singaporean students to pay fees from about S$300 to S$600 per month. For Singaporean students in need attending non-independent junior colleges, they are able to apply for the MOE Financial Assistance Scheme (FAS), where their school fees are subsidised depending on their household's monthly gross income and their monthly per capita income. Similarly, Singaporean students who attend independent junior colleges and require financial assistance can apply for the MOE Independent School Bursary (ISB), as well as the UPLIFT Scholarship, depending on their household's monthly gross income and their monthly per capita income. Singaporean students who are attending independent junior colleges qualify for the Edusave scholarships for Independent Schools (ESIS) at the Pre-University 1 level, if they had not already been awarded it at Secondary 1 or Secondary 3. These are usually awarded to students whose score falls within the 95th percentile from the O-levels or who meet the cut-off score for the ESIS and are admitted to an independent junior college through the DSA. There are also a number of MOE pre-university scholarships awarded to academically able students who choose to pursue their education at a junior college, providing yearly scholarship allowance and remission of school fees. This includes the Pre-University Scholarship, which provides a scholarship allowance of S$750 per annum. This also includes scholarships for students pursuing specific programmes such as the Humanities Scholarship, Art Elective Scholarship, Music Elective Scholarship, and others. They typically provide scholarship allowances of S$1000 per annum in addition to a remission of school fees, subject to an annual cap of S$2400. Additionally, there are several awards and bursaries awarded to junior college students for their good character, leadership qualities, and improvement in academic performance, among others. - [CEGEP](/wiki/CEGEP), an equivalent level of education in [Quebec](/wiki/Quebec), [Canada](/wiki/Canada) - [Sixth-form college](/wiki/Sixth-form_college), for other equivalent-type institutions - Ministry of Education, Singapore - Guide to Resources on Singapore's Education System in the National Library of Singapore\n",
  "language": "en",
  "processed_at": "2026-01-12T11:15:15.500220",
  "title": "Junior college (Singapore)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Junior_college_(Singapore)"
}