{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:15:46.584143"
  },
  "content": "Residential town in the West Region of SingaporePlanning Area and HDB Town in West Region, Singapore **Jurong West** is a [planning area](/wiki/Planning_Areas_of_Singapore) and [residential town](/wiki/New_towns_of_Singapore) located in the [West Region](/wiki/West_Region,_Singapore) of [Singapore](/wiki/Singapore). It shares boundaries with [Tengah](/wiki/Tengah,_Singapore) in the north, [Jurong East](/wiki/Jurong_East) in the east, [Boon Lay](/wiki/Boon_Lay_Planning_Area) and [Pioneer](/wiki/Pioneer,_Singapore) in the south, and [Western Water Catchment](/wiki/Western_Water_Catchment) in the west. Originally a [forested area](/wiki/Forest), Jurong West underwent rapid development by the [Housing and Development Board](/wiki/Housing_and_Development_Board) (HDB), in an effort to transform it into a fully mature housing estate. ## History Jurong West originated from the area once called Peng Kang, named after the [gambier](/wiki/Gambier_(extract)) plantations along [Sungei Jurong](/wiki/Sungei_Jurong). By the mid-20th century, the area was home to several [brickworks](/wiki/Brickworks), [palm oil](/wiki/Palm_oil) plantations and [nurseries](/wiki/Plant_nursery). At that time, the only public housing estates in Jurong West were [Boon Lay](/wiki/Boon_Lay) and [Taman Jurong](/wiki/Taman_Jurong). Jurong West was largely left alone until 1984, when the HDB began conceptualisation for a new town in Jurong West. Jurong West was carved into nine subzones that would house a total of 94,000 public and private housing units in the long term. The town's first apartment blocks (known locally as *flats*) were completed at Taman Jurong in 1963. By November 2004, about 71,522 dwelling units were completed. As of 31 March 2018, there are 74,301 HDB dwelling units in Jurong West. ## Geography Jurong West is a primarily residential town situated west of [Tengah New Town](/wiki/Tengah,_Singapore) in the western part of Singapore, under the [West Region](/wiki/West_Region,_Singapore) as defined by the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) (URA). The town is bordered to the north by the [Pan Island Expressway](/wiki/Pan_Island_Expressway) (PIE), to the east by [Sungei Jurong](/wiki/Sungei_Jurong) ([Jurong](/wiki/Jurong) River) and [Jurong Lake](/wiki/Jurong_Lake), to the south by the [Ayer Rajah Expressway](/wiki/Ayer_Rajah_Expressway) (AYE), and to the west by Benoi Road and Upper Jurong Road. Jurong West Town Centre is located in [Jurong West Central](/wiki/Jurong_West_Central). An industrial area, part of the [Jurong Industrial Estate](/wiki/Jurong#Jurong_Industrial_Estate), is located south of Boon Lay Way and Upper Jurong Road. Another industrial area is currently under development in [Wenya](/wiki/Wenya) as part of the Jurong Innovation District. ### Subzones Jurong West New Town is divided into the following nine subzones. - [Boon Lay](/wiki/Boon_Lay) - [Chin Bee](/wiki/Chin_Bee) - [Hong Kah](/wiki/Hong_Kah) - [Jurong West Central](/wiki/Jurong_West_Central) - [Kian Teck](/wiki/Kian_Teck) - [Safti](/wiki/Safti) - [Taman Jurong](/wiki/Taman_Jurong) - [Wenya](/wiki/Wenya) - [Yunnan](/wiki/Yunnan,_Singapore) ## Demographics As of 2025, the most populous subzone in Jurong West is [Yunnan](/wiki/Yunnan,_Singapore) with 65,400 residents, closely followed by [Jurong West Central](/wiki/Jurong_West_Central) with 60,840 residents, while [Chin Bee](/wiki/Chin_Bee), [Kian Teck](/wiki/Kian_Teck) and [Safti](/wiki/Safti) are completely unpopulated. Packed into an area of 9.87 km2 (3.81 mi2), of which 4.8 km2 (1.9 mi2) are designated as residential areas, Jurong West has a population density of 25,700 people per km2. ### Population history Resident Population 2000-2025YearPop.±%2000204,750—2001217,270+6.1%2002224,370+3.3%2003226,070+0.8%2004229,570+1.5%2005233,750+1.8%2006238,530+2.0%2007243,620+2.1%2008253,160+3.9%2009264,020+4.3%2010267,520+1.3%2011270,140+1.0%2012271,870+0.6%2013271,320−0.2%2014271,930+0.2%2015272,660+0.3%2016270,350−0.8%2017267,840−0.9%2018266,720−0.4%2019264,860−0.7%2020262,730−0.8%2021255,110−2.9%2022258,240+1.2%2023259,740+0.6%2024257,470−0.9%2025253,840−1.4%Source: ### Age profile The data below is from the population report published by the Singapore Department of Statistics as of June 2025. Age group (years)MalesFemalesTotal population% of total population0–44,1503,8708,0203.165–95,7205,35011,0704.3610–146,6206,37012,9905.1215–197,5707,32014,8905.8720–248,1107,65015,7606.2125–298,8808,39017,2706.8030–348,9908,77017,7607.0035–398,0708,85016,9206.6740–448,6909,92018,6107.3345–499,43010,03019,4607.6750–5410,0509,87019,9207.8555–599,6209,22018,8407.4260–649,3708,72018,0907.1365–698,2508,14016,3906.4670–746,4106,68013,0905.1675–794,1004,2208,3203.2880–841,5602,0103,5701.4185–897901,1201,9100.7590+2806709500.37Age group (years)MalesFemalesTotal population% of total population0–1416,49015,59032,08012.6415–6488,78088,740177,52069.9365+21,39022,84044,23017.42 The population distribution of Jurong West in 2025 demonstrates a mature population structure. There is a higher population concentration among middle-aged groups, with the highest concentration of residents between 50 and 54 years old at 7.85%. Specifically, the male population peaks at the 50-54 age range at 3.96%, and the female population peaks at the 45-49 age range at 3.95%. ### Household As of 2025, there were 230,990 people living in [HDB](/wiki/Housing_and_Development_Board) flats, representing 91.0% of the population. This is significantly higher than the national proportion of HDB dwellers (75.8%), reflecting a greater prevalence of public housing in the area. This makes Jurong West have the second highest proportion of HDB dwellers among all planning areas in Singapore, behind [Woodlands](/wiki/Woodlands,_Singapore). Among the population, 97,410 residents, or 38.4% of the population, live in 5-Room and Executive HDB Flats, making it the most common type of dwelling. 17,630 residents (6.95%) live in condominiums and other apartments, while 4,100 residents (1.62%) live in landed properties. As of 2020, the average household size in Jurong West is 3.39. Among the 83,879 households in Jurong West, the most common household size is four persons, representing 23.2% of total households. This is closely followed by a household size of four persons, representing 22.1% of all households. Jurong West has a [home ownership](/wiki/Owner-occupancy) rate of 91.0% as of 2020. This is higher than the national home ownership rate of 87.9%, reflecting a greater prevalence of homeowners in Jurong West. ### Ethnicity Ethnic groups in Jurong West (2010−2020) Year[Chinese](/wiki/Chinese_Singaporeans)[Malays](/wiki/Malay_Singaporeans)[Indians](/wiki/Indian_Singaporeans)Others[Pop.](/wiki/Population)PercentagePop.PercentagePop.PercentagePop.Percentage**2000**147,42972%39,90019.49%15,9567.79%1,4650.72%**2010**184,65869.02%48,66318.19%27,13410.14%7,0692.64%**2015**190,24069.77%48,63017.84%27,0909.94%6,7102.46%**2020**183,59069.88%46,52017.71%26,36010.03%6,2602.38% Jurong West has a greater ethnic diversity in comparison to the national average. Despite having a majority Chinese population, the proportion of residents of Chinese ethnicity, 69.88%, is substantially lower than the national proportion of 74.35%. ### Religion Consistent with the rest of Singapore, the largest religion in Jurong West is [Buddhism](/wiki/Buddhism_in_Singapore), with 78,615 practising residents (34.82% of the population). The second most common group consists of residents practising Islam (46,353 residents, 20.53%), followed by those with [no religion](/wiki/Irreligion_in_Singapore) (41,074 residents, 18.19%). Additionally, there are 24,184 residents practising [Taoism](/wiki/Taoism_in_Singapore) and [other Chinese religions](/wiki/Chinese_folk_religion) (10.71%), as well as 22,114 Christians (9.79%), including 7,769 Catholics (3.44%). Other religious affiliations include [Hinduism](/wiki/Hinduism_in_Singapore) (12,143 residents, 5.38%), and [Sikhism](/wiki/Sikhism_in_Singapore) (666 residents, 0.29%). Jurong West is the planning area with the lowest proportion of practising Christians in Singapore, significantly below the national average of 18.92%. Additionally, Jurong West is the only planning area where more residents practise Taoism and other Chinese religions than Christianity. ### Education As of 2020, 97.0% of the population above 15 is literate, similar to the national literacy rate of 97.1%. 64.6% of residents are literate in two languages, with the most common language pair being English and Chinese (41.5%). 5.5% of Jurong West residents are literate in three or more languages. 48,675 residents (24.0% of the population) in Jurong West have attained a university qualification, lower than the national average of 32.1%, ranking the third lowest in Singapore. In contrast, 24,024 residents, or 11.8% of the population, have no educational qualifications, higher than the national average of 10.6%. ### Language Languages most frequently spoken at home, Jurong West (2020 census)Languagespercent[English](/wiki/Singapore_English)36.5%[Mandarin Chinese](/wiki/Mandarin_Chinese)37.0%[Malay](/wiki/Malay_Language)12.7%[Chinese dialects](/wiki/Chinese_dialects)8.2%[Tamil](/wiki/Tamil_Language)3.8%[Other Indian languages](/wiki/Languages_of_India)0.67%Others1.0% The proportion of residents in Jurong West using [English](/wiki/Singapore_English) as the most frequently spoken language (36.5%) is the lowest among all planning areas in Singapore, significantly below the national average of 48.3%. Notably, Jurong West is the only planning area in Singapore where there are more [Mandarin Chinese](/wiki/Singaporean_Mandarin) speakers than English speakers. Additionally, there are 9,056 [Tamil](/wiki/Tamil_Language) speakers, representing 84.8% of the 2,695 [Indian language](/wiki/Languages_of_India) speakers in Jurong West. ### Employment and income According to the 2020 Census of Population, 148,785 residents aged 15 years and over in Jurong West are employed, out of the 156,732 in the [labour force](/wiki/Workforce). This equates to an employment rate of 94.9%, higher than the [national employment rate](/wiki/Employment_in_Singapore) of 94.2%. The remaining 69,039 residents aged above 15 (30.6%) in Jurong West are outside the labour force. Among the employed residents in Jurong West aged 15 years and over, most earn a gross monthly income of between S$3,000 and S$3,999, with 14.6% being in that category. 6.9% earn less than S$1,000 per month, while 3.6% earn above S$15,000 per month. Notably, the proportion of residents earning less than S$1,000 per month in Jurong West is the second highest in Singapore, behind [Yishun](/wiki/Yishun). According to the 2020 Census of Population, most resident households in Jurong West have no employed person, encompassing 9.6% of all households. The second highest category for monthly household income is S$20,000 and over, encompassing 8.2% of all households. ## Notable places Jurong West's two main rivers, [Sungei Jurong](/wiki/Sungei_Jurong) and Sungei Lanchar, run through the town with a network of green connectors along their [banks](/wiki/Bank_(geography)). They link housing precincts to neighbourhood parks such as [Jurong Central Park](/wiki/Jurong_Central_Park), as well as the [Jurong West Sports Centre](/wiki/Jurong_West_Sports_and_Recreation_Centre), Jurong West Stadium and Frontier Community Centre. These park connectors are linked to the [Chinese Garden](/wiki/Chinese_Garden,_Singapore) in [Jurong East New Town](/wiki/Jurong_East) and the [Bukit Batok Town Park](/wiki/Bukit_Batok_Town_Park) in the north, to better serve the recreational needs of the residents of Jurong West. [Jurong Central Park](/wiki/Jurong_Central_Park), located in [Kian Teck](/wiki/Kian_Teck), is a rectangular green space created behind [Boon Lay MRT station](/wiki/Boon_Lay_MRT_station). Jurong West's major [public transport](/wiki/Transport_in_Singapore) amenities were built in tandem with the main public housing development. The elevated track infrastructure of the [East West MRT line](/wiki/East_West_MRT_line) was developed as the existing public housing blocks were being built in the 1980s. The amenities were built in a contiguous [building complex](/wiki/Building), which gives commuters direct access between [Boon Lay MRT station](/wiki/Boon_Lay_MRT_station), [Boon Lay Bus Interchange](/wiki/Boon_Lay_Bus_Interchange), The Centris condominium and [Jurong Point](/wiki/Jurong_Point) shopping centre. ## Transportation City planners plan for [public transport](/wiki/Public_transport) to eventually become the preferred [mode of transport](/wiki/Mode_of_transport). The government of Singapore uses public transport to reduce pollution caused by heavy road traffic. Jurong West is part of the [Urban Redevelopment Authority's](/wiki/Urban_Redevelopment_Authority) focus for realising this [urban planning](/wiki/Urban_planning) model. As Jurong West is relatively distant from the [city](/wiki/City) centre at the [Central Area](/wiki/Central_Area,_Singapore), an efficient, high-volume and high-speed public transport system is also preferred to using [road networks](/wiki/Road_transport_in_Singapore), as the government is aiming to reduce the number of cars on the road. ### Public transport #### East West Line Jurong West Town is linked to the rest of Singapore via the [East West Line](/wiki/East%E2%80%93West_Line_(Singapore)) (EWL) on the [Mass Rapid Transit](/wiki/Mass_Rapid_Transit_(Singapore)) (MRT) network. There are three [MRT stations](/wiki/List_of_Singapore_MRT_stations) that serve Jurong West – [Lakeside](/wiki/Lakeside_MRT_station), [Boon Lay](/wiki/Boon_Lay_MRT_station) and [Pioneer](/wiki/Pioneer_MRT_station) stations. Boon Lay station is located next to [Boon Lay Bus Interchange](/wiki/Boon_Lay_Bus_Interchange) for commuters' ease of switching across different modes of public transport. The station began operations on 6 July 1990, as the western terminus of the EWL, before additional stations were added further west of the line at Pioneer and Joo Koon on 28 February 2009. Lakeside station, which began operations on 5 November 1988, serves the housing developments in [Taman Jurong](/wiki/Taman_Jurong), [Hong Kah](/wiki/Hong_Kah) and [Boon Lay](/wiki/Boon_Lay). Pioneer station began operations on 28 February 2009, and serves the residential areas of [Nanyang](/wiki/Yunnan,_Singapore) and [Pioneer](/wiki/Jurong_West_Central), as well as the industrial areas located south of the station. #### Jurong Region Line The [Jurong Region Line](/wiki/Jurong_Region_Line) (JRL) is an upcoming 24 km fully elevated MRT line, opening from 2027 onwards. Stations on the line in Jurong West will include an interchange with the existing [Boon Lay](/wiki/Boon_Lay_MRT_station) station on the EWL, as well as [Corporation](/wiki/Corporation_MRT_station), [Jurong West](/wiki/Jurong_West_MRT_station), [Bahar Junction](/wiki/Bahar_Junction_MRT_station), [Gek Poh](/wiki/Gek_Poh_MRT_station), and [Enterprise](/wiki/Enterprise_MRT_station) stations. #### Boon Lay Bus Interchange [Boon Lay Bus Interchange](/wiki/Boon_Lay_Bus_Interchange) originally opened in July 1990 along with Boon Lay MRT station. At that time, developments around the area in Jurong West New Town were still actively in progress. It was later rebuilt and reopened in 2009 at the ground level of [Jurong Point Shopping Centre](/wiki/Jurong_Point), next to Centris condominium, and is the fourth [air-conditioned](/wiki/Air-conditioned) bus interchange in Singapore, after [Toa Payoh Bus Interchange](/wiki/Toa_Payoh_Bus_Interchange), [Sengkang Bus Interchange](/wiki/Sengkang_Bus_Interchange) and [Ang Mo Kio Bus Interchange](/wiki/Ang_Mo_Kio_Bus_Interchange).These bus services from this interchange would be mostly operated by SMRT Buses from September 2024 onwards after being operated by SBS Transit for many years with the incumbent operations under the Jurong West Bus Package. ### Road network Jurong West is connected to many parts of Singapore through its road network. The [Pan Island Expressway](/wiki/Pan_Island_Expressway) (PIE) and [Ayer Rajah Expressway](/wiki/Ayer_Rajah_Expressway) (AYE) link Jurong West Town with Singapore's [expressway](/wiki/Controlled-access_highway) network. Major roads that run within the boundaries of Jurong West Planning Area include Corporation Road, Boon Lay Way, [Jalan Boon Lay](/wiki/Jalan_Boon_Lay), [Jalan Bahar](/wiki/Jalan_Bahar), Upper Jurong Road, Pioneer Road North, Jurong West Avenue 4 and Jurong West Avenue 2. ## Jurong West Town Centre There are four major [building complexes](/wiki/Building#Complex) within the Jurong West Town Centre. ### Jurong Point Shopping Centre [Jurong Point Shopping Centre](/wiki/Jurong_Point) is Singapore's largest suburban shopping centre. The shopping centre started operations in December 1995 and expanded twice in 1999 and 2008. ### The Centris The Centris is a private condominium that is located above Jurong Point Shopping Centre. ### Jurong West Community Building The Jurong West Community Building is an integrated development comprising the [Jurong West Public Library](/wiki/Jurong_West_Public_Library), The Frontier Community Club and Jurong Medical Centre. It is located behind Jurong Point Shopping Centre. ### Boon Lay Interchange Boon Lay Interchange, located in the centre of the town, consists of the [Boon Lay Bus Interchange](/wiki/Boon_Lay_Bus_Interchange) and [Boon Lay MRT station](/wiki/Boon_Lay_MRT_station). ## Amenities ### Education There are 12 [primary schools](/wiki/Primary_school), 11 [secondary schools](/wiki/Secondary_school) and 2 international schools in Jurong West New Town. ### Fire stations Jurong Fire Station, which opened on 17 November 2017, is the first [fire station](/wiki/Fire_station) in Singapore to have a slide. The fire station covers 4,000 square metres, and is used by the [Singapore Civil Defence Force](/wiki/Singapore_Civil_Defence_Force). ### Medical facilities Pioneer Polyclinic is a government healthcare institution serving the local community in Jurong West. The polyclinic was opened in January 2018. Also located in Jurong West is the Jurong Medical Centre, which complements the acute and step-down care services of [Ng Teng Fong General Hospital](/wiki/Ng_Teng_Fong_General_Hospital) and [Jurong Community Hospital](/wiki/Jurong_Community_Hospital). ### Sports facilities [Jurong West Sports Centre](/wiki/Jurong_West_Sports_and_Recreation_Centre), formerly known as Jurong West Sports and Recreation Centre, is the largest sports centre in Singapore, and offers one of the two sheltered pools managed by [Sport Singapore](/wiki/Sport_Singapore). ## Politics Currently, Jurong West is represented in the [Parliament of Singapore](/wiki/Parliament_of_Singapore) by seven members of parliament (MPs): one MP from [Jurong Central SMC](/wiki/Jurong_Central_Single_Member_Constituency), one MP from [Pioneer SMC](/wiki/Pioneer_Single_Member_Constituency), and five MPs from [West Coast-Jurong West GRC](/wiki/West_Coast-Jurong_West_Group_Representation_Constituency), with effect from the [2025 General Election](/wiki/2025_Singaporean_general_election). - Chua Chu Kang Town Council - Jurong-Clementi Town Council - West Coast Town Council - South West Community Development Council Archived 30 December 2019 at the [Wayback Machine](/wiki/Wayback_Machine)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:15:46.583653",
  "title": "Jurong West",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Jurong_West"
}