{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:15:35.534540"
  },
  "content": "Singaporean commercial oil storageThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Jurong Rock Caverns\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(March 2017)* *(Learn how and when to remove this message)* The **Jurong Rock Caverns** (JRC) ([Chinese](/wiki/Simplified_Chinese_characters): 裕廊岛地下储油库, [Malay](/wiki/Malay_language): *Gua Batu Simpanan Barang Mentah Jurong*) is the first underground rock cavern for [oil storage](/wiki/Oil_storage) in [Southeast Asia](/wiki/Southeast_Asia). It is owned by [Jurong Town Corporation](/wiki/Jurong_Town_Corporation). The rock caverns were officially opened on 2 September 2014 by the third [Prime Minister of Singapore](/wiki/Prime_Minister_of_Singapore), [Lee Hsien Loong](/wiki/Lee_Hsien_Loong). Located at a depth of 130 m (430 ft) beneath Banyan Basin on Jurong Island, the 61-hectare (150-acre) caverns, provide infrastructural support to companies on Jurong Island such as Shell, [ExxonMobil](/wiki/ExxonMobil) and Chevron Philips, and meet the storage needs for liquid hydrocarbons such as crude oil, condensate, naphtha and gas oil. The first phase comprises five 340 m (1,120 ft) long, 20 m (66 ft) wide and 27 m (89 ft) high caverns with nine storage galleries providing 1,470,000 cubic metres (52,000,000 cu ft) of storage, and 8 km (5 mi) of tunnels costing SGD 950 million. The second phase of 1.3 million cubic meter, double this capacity to 2.8 million cubic meters (100 million cu ft). In a study focussed on Swedish policies and conditions in the Cold War (1938-98) it was concluded that environmental investigation into storage of oil and fuel in undressed rock chambers needed to take place over a long period of time, and that the impact and types of potential damage as at 2021 are unknown. This Singapore-related article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:15:35.534141",
  "title": "Jurong Rock Caverns",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Jurong_Rock_Caverns"
}