{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:15:29.577013"
  },
  "content": "Singaporean Harbor **Jurong Port Pte Ltd** is a port operator headquartered in [Singapore](/wiki/Singapore). Jurong Port, which operates the only multi-purpose port in Singapore, handles [bulk](/wiki/Bulk_cargo), [break-bulk](/wiki/Break_bulk_cargo) and [containerised](/wiki/Containerization) cargo. It handled over 40,000 vessel-calls annually in 2019. The port owns and operates its own subzone located in the town of [Jurong East](/wiki/Jurong_East) in Singapore. It is bounded by Jalan Ahmad Ibrahim, Jurong Pier Road, Jurong Island Highway, Seraya Avenue and Sungei Jurong, including Pulau Damar Laut. ## History **Corporate** In 1963, Jurong Port was set up by the [Singapore Economic Development Board](/wiki/Singapore_Economic_Development_Board) (EDB) to support the growth of Singapore's first and biggest industrial estate, [Jurong Industrial Estate](/wiki/Jurong_Industrial_Estate). In 1965, the port officially commenced operations. In 1968, [Jurong Town Corporation](/wiki/Jurong_Town_Corporation) (JTC) was set up to drive the industrial estate development in Singapore and Jurong Port became a business division under JTC. On 1 January 2001, Jurong Port was corporatised and became a fully owned subsidiary of JTC Corporation. **Infrastructure** Jurong Port commenced operations with only two berths. Growing in tandem with the rapid growth of industries in JTC, cargo traffic in Jurong Port passed the million ton mark for the first time in 1970. In 1971, Jurong Port embarked on an expansion programme that provided for four additional [deep water](/wiki/Deep-water_port) general purpose berths, the extension of an existing berth and the addition of warehouses and transit sheds. Further extensions on the five berths were carried out again in 1971. As the Company continued to grow, additional capacity was required and Jurong Port announced the construction and reclamation of Pulau Damar Laut (PDL) in 1989. PDL provided additional land area and created more deepwater multi-purpose berths. In 1996, Singapore went through a land intensification program to increase land utilisation. Resulting from the program was the Jurong Port Cement Terminal, a dedicated common-user cement facility. In 2001, Jurong Port started its Container Terminal on PDL becoming a full-fledged multi-purpose port. In 2008, Jurong Port started the Penjuru Terminal to handle lighterage and shipchandling businesses. In 2019, Jurong Port started the operation of its Jurong Port Tank Terminals (JPTT). JPTT is a 60:40 joint venture between Jurong Port Pte Ltd and Advario. It is Located in Pulau Damar Laut in Jurong Port, the liquid bulk terminal is designed to store and handle clean petroleum products and petrochemicals. JPTT has a total capacity of about 580,000 cubic metres. In March 2021, Jurong Port acquired a 41% stake in Universal Terminal, one of the world's largest commercial storage terminal, and the country's largest petroleum storage terminal, with a total of 15 jetties, including two for VLCCs very large crude carriers. There are nine bunker barge berths in its inner basin, with capabilities to load 1,000m³ an hour per hose. The other existing owners of the terminal are PetroChina (25%) and MAIF Investments Singapore (34%), a unit of Australian investment bank Macquarie Group. Jurong Port Universal Terminal (JPUT) has a total capacity of about 2.33 million cubic metres. ## Facilities Jurong Port is an international Multi-Purpose Port Operator operating a General Cargo Terminal, Bulk Cargo Terminal, Container Terminal, Energy Terminals, Penjuru Terminal and Marina South Wharves for lighter Services, a Small Craft Terminal and mechanical ramps for Roll-On Roll-Off landing crafts. Jurong Port handled about 17.33 million tonnes and 320,000 twenty-foot equivalent units (TEU)s of containers in 2014. Its port facilities are as follows: - Total Land Area:155 ha - Land Area under [Free Trade Zone](/wiki/Free_Trade_Zone) (FTZ): 127 ha - Total Berth Length: 5.6 km - Total No. of Berths: 30 + 2 Roll-on Roll-off mechanical ramps - Maximum Permissible Draft Alongside: 15.7 m - Maximum Vessel Size: 150,000 [deadweight](/wiki/Deadweight_tonnage) tonnes(DWT) - FTZ Warehouses: 178,000 m2 - Non-FTZ Warehouses: 15,000 m2 ### General cargo terminal The General Cargo Terminal handles a diverse range of cargoes including steel products, project cargo, machinery and mechanical appliances. As a [transshipment](/wiki/Transshipment) and storage hub accredited by the London Metal Exchange, Jurong Port's General Cargo Terminal also handles metal ingots. ### Bulk cargo terminal The [Bulk Cargo Terminal](/wiki/Bulk_cargo_port) handles bulk cargo like bulk [cement](/wiki/Cement), furnace [slag](/wiki/Slag), [copper slag](/wiki/Copper_slag) and liquid bulk. Jurong Port has a dedicated common-user facility to handle bulk cement. The Cement Terminal is one of the world's largest common-user cement facilities and consists of two dedicated berths equipped with three cement screw unloaders linked to a fully enclosed air-slide, non-pollutive conveyor system. Jurong Port handles more than 90% of cement throughput into Singapore.[*citation needed*] ### Container terminal Operations started in July 2001. The terminal has an annual handling capacity of 500,000 TEUs. The terminal has a global direct connectivity to over 80 ports in 45 countries. ### Energy terminals Jurong Port owns stakes in 2 of the largest Energy Terminals in Singapore - Jurong Port Tank Terminals (JPTT) and Jurong Port Universal Terminal (JPUT), with a combined capacity of about 2.9 million cubic metres. ### Solar power Jurong Port is building a 10MWp solar installation on the roofs of its warehouses. The system is expected online by the second quarter of 2016. ### Ro-Ro [Wallenius Wilhelmsen Logistics](/wiki/Wallenius_Wilhelmsen_Logistics) plans to develop a [ro-ro](/wiki/Ro-ro) hub at the port. ## Accolades **Singapore Quality Class (SQC) Certification** - 2015 – The award recognises Jurong Port's quality management in the seven dimensions of Leadership, Planning, Information, People, Processes, Customers and Results.[*citation needed*] **Frost and Sullivan** - 2010 – 2015 Best Multi-purpose Terminal Operator of the Year (Asia Pacific) **BCA Green Mark Award (Gold)** - 2015 – The award recognises the green construction methods and environmental sustainability features during the upgrading of two berths'. **BCA Green Mark Award (Platinum)** - 2012 – The award recognises Jurong Port's success in creating an environment-friendly work space. **Singapore National Infocomm Awards** - 2010 – Merit Award under the category \"Most Innovative Use of Infocomm Technology\" (Private Sector) **IDC Awards** - 2010 – IDC Enterprise Innovation Awards **Lloyd's List Asia Award**[*citation needed*] - 2009 – Award for Achievement in Safety **Asian Freight and Supply Chain Awards (AFSCA)**[*citation needed*] - 2003, 2004, 2005, 2006, 2007 – Best Emerging Container Terminal Operator – Asia[*citation needed*] - 2008, 2009, 2010 – Best Container Terminal Operator (Under 1 million TEUs per Annum) – Asia **Supply Chain & Management Logistics World Awards** - 2007 – Best Asia Pacific Container Terminal ## Safety On 8 May 2007 some workers were injured while loading containers on board MV'Rickmers New Orleans' when they tripped and fell over steel plates, which were improperly stacked. Operations were halted temporarily for investigations. Following this incident, steps were taken to further enhance the safety management of the port; it subsequently won a safety award from *Lloyd's List*. After an accident in 2008, Jurong Port re-doubled its efforts to build and consolidate its safety culture through a series of programs and initiatives. As a result, Jurong Port was recognised with the *Award for Achievement in Safety* from *Lloyd's List* in 2009. - Official website - Corporate Video - Jurong Port Accident\n",
  "language": "en",
  "processed_at": "2026-01-12T11:15:29.576573",
  "title": "Jurong Port",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Jurong_Port"
}