{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:15:19.509249"
  },
  "content": "Planning Area and Regional Centre in West Region, SingaporePlanning area and regional centre in West Region, Singapore **Jurong East** is the [regional centre](/wiki/Regional_centre_(Singapore)) of the [West Region](/wiki/West_Region,_Singapore) of [Singapore](/wiki/Singapore). It borders [Jurong West](/wiki/Jurong_West) and [Boon Lay](/wiki/Boon_Lay) to the west, [Clementi](/wiki/Clementi,_Singapore) to the east, [Tengah](/wiki/Tengah,_Singapore) and [Bukit Batok](/wiki/Bukit_Batok) to the north and Selat Jurong to the south. First developed in the 1970s, it is located approximately 20 km (12 miles) west of the [city-centre](/wiki/Central_Area,_Singapore). Jurong East is the 7th most populated planning area in the West Region. Jurong East, along with the entire [Jurong](/wiki/Jurong) area in general, is envisioned to be the country's second [central business district](/wiki/Central_business_district) (CBD) as part of the [Jurong Lake District](/wiki/Jurong_Lake_District) project. ## History The development of Jurong started in the 1970s when estates such as [Boon Lay](/wiki/Boon_Lay), [Taman Jurong](/wiki/Taman_Jurong), [Bukit Batok](/wiki/Bukit_Batok), [Bukit Gombak](/wiki/Bukit_Gombak), [Hong Kah](/wiki/Hong_Kah), [Teban Gardens](/wiki/Teban_Gardens) and [Yuhua](/wiki/Yuhua,_Singapore) were built, mostly due to the resettlement of Hong Kah (present-day [Tengah](/wiki/Tengah)) and surrounding villages. [Yuhua](/wiki/Yuhua,_Singapore), [Teban Gardens](/wiki/Teban_Gardens), [Bukit Batok](/wiki/Bukit_Batok) and [Bukit Gombak](/wiki/Bukit_Gombak) formed Jurong East. ## Subzones There are 10 subzones in Jurong East. - [Jurong Port](/wiki/Jurong_Port) - [Penjuru Crescent](/wiki/Penjuru_Crescent) - [Jurong River](/wiki/Jurong_River) - [Teban Gardens](/wiki/Teban_Gardens) - [Lakeside](/wiki/Jurong_Lake) - Jurong Gateway - [International Business Park](/wiki/International_Business_Park) - Toh Guan - [Yuhua](/wiki/Yuhua,_Singapore) East - Yuhua West ## Politics The northern section is under [Jurong East–Bukit Batok GRC](/wiki/Jurong_East%E2%80%93Bukit_Batok_Group_Representation_Constituency) while the southern section belongs to [West Coast–Jurong West GRC](/wiki/West_Coast%E2%80%93Jurong_West_Group_Representation_Constituency). After the electoral boundaries were redrawn for the [2011 Singaporean general election](/wiki/2011_Singaporean_general_election), a portion of the then-existing [Jurong GRC](/wiki/Jurong_Group_Representation_Constituency) was carved out to form [Yuhua SMC.](/wiki/Yuhua_Single_Member_Constituency) In 2025, the majority of Yuhua SMC was given to the new Jurong East–Bukit Batok GRC while the remainder was given to the new [Jurong Central SMC](/wiki/Jurong_Central_Single_Member_Constituency). ## Education There are three primary schools and three secondary schools in Jurong East. - Fuhua Primary School (which Pandan Primary School merged into) - Jurong Primary School - Yuhua Primary School - [Commonwealth Secondary School](/wiki/Commonwealth_Secondary_School) - [Crest Secondary School](/wiki/Crest_Secondary_School) - [Jurongville Secondary School](/wiki/Jurongville_Secondary_School) (which Hong Kah Secondary School merged into) Jurong East is also home to the Devan Nair Institute for Employment and Employability, an Employment and Employability Institute (e2i) established by the [National Trades Union Congress](/wiki/National_Trades_Union_Congress) (NTUC). It was opened in 2014 and provides workforce training programs to workers and employers. ## Recreation ### Sports - Jurong East Sports and Recreation Centre ### Leisure - Jurong Lake Park - Pandan Gardens Park Connector - Jurong Park Connector - Toh Guan Neighbourhood Park - Pandan Gardens Leisure Park - Pandan Reservoir Fitness Corner - Hong Kah East Neighbourhood Park - Yuhua Village Neighbourhood Park - Genting Hotel Jurong ### Tourist attractions There are 4 tourist attractions in Jurong East – - [Science Centre](/wiki/Science_Centre_Singapore) - [Snow City](/wiki/Snow_City) - [Chinese Garden](/wiki/Chinese_Garden,_Singapore) - [Japanese Garden](/wiki/Japanese_Garden,_Singapore) ## Transport ### Roads **Jurong East** is connected to the rest of Singapore with the [Pan Island Expressway](/wiki/Pan_Island_Expressway) (PIE) and the [Ayer Rajah Expressway](/wiki/Ayer_Rajah_Expressway) (AYE). - Jurong Town Hall Road interconnects the two expressways with [Boon Lay](/wiki/Yuhua,_Singapore), [Yuhua](/wiki/Yuhua,_Singapore), [Jurong Regional Centre](/wiki/Jurong_Regional_Centre), [International Business Park](/wiki/International_Business_Park), [Jurong Lake](/wiki/Jurong_Lake) and [Teban Gardens](/wiki/Teban_Gardens). - Toh Guan is connected to the [PIE](/wiki/Pan_Island_Expressway) via Toh Guan Road, while Jurong Canal Road provides an alternative at Boon Lay for traffic to ([Tuas](/wiki/Tuas)) and from ([Changi](/wiki/Changi)) the [PIE](/wiki/Pan_Island_Expressway). - From the [AYE](/wiki/Ayer_Rajah_Expressway), arterial roads Jurong Pier Road, Jurong Port Road and Penjuru Road (along with [Minor Arterial road](/wiki/Collector_road) Teban Gardens Crescent) carry the traffic to [Jurong River](/wiki/Jurong_River), [Penjuru Crescent](/wiki/Penjuru_Crescent) and [Jurong Port](/wiki/Jurong_Port). - Boon Lay Way and Jalan Buroh are the two other arterial roads in Jurong East, which provides inter-connectivity across the various subzones in the area. ### Public transport #### Mass Rapid Transit (MRT) **Jurong East** is currently served by two MRT stations across two lines, the [East West Line](/wiki/East-West_MRT_line) and the [North South Line](/wiki/North-South_MRT_line), namely: - **EW24** **NS1** [Jurong East](/wiki/Jurong_East_MRT_station) - **EW25** [Chinese Garden](/wiki/Chinese_Garden_MRT_station) Extensive rail expansion is ongoing in Jurong East with five new MRT stations undergoing construction as part of the [Jurong Region MRT line](/wiki/Jurong_Region_Line) and [Cross Island MRT line](/wiki/Cross_Island_Line), scheduled to be completed in 2028 and 2032 respectively. [Jurong East MRT station](/wiki/Jurong_East_MRT_station) will also contain an additional interchange station for the [Jurong Region Line](/wiki/Jurong_Region_Line). The future stations in Jurong East are: - **JE4** [Toh Guan](/wiki/Toh_Guan_MRT_station) - **JE5** [Jurong East](/wiki/Jurong_East_MRT_station) - **JE6** [Jurong Town Hall](/wiki/Jurong_Town_Hall_MRT_station) - **JE7** [Pandan Reservoir](/wiki/Pandan_Reservoir_MRT_station) - **CR19** [Jurong Lake District](/wiki/Jurong_Lake_District_MRT_station) #### Bus [Jurong East Bus Interchange](/wiki/Jurong_East_Bus_Interchange) started operations in 1985. It later moved to its first temporary site on 17 December 2011. All the bus services, except 51, 52, 105, 160, 197 & 506 were handed over to Tower Transit Singapore on 12 June 2016. On 6 December 2020, the former temporary bus interchange was relocated to facilitate the construction of the Jurong Region Line and the Jurong East Integrated Transport Hub. The new relocated interchange was located opposite the current interchange, along Jurong Gateway Road between the junctions of Jurong Gateway Road/Jurong East Street 12 and Jurong Gateway Road/Jurong East Central 1. All bus services with the exception of service 78, 79, CW3 and CW4 were relocated there. On 3 November 2023, the Land Transport Authority (LTA) announced more inclusive public transport facilities with the opening of the new [Jurong Town Hall Bus Interchange](/wiki/Jurong_Town_Hall_Bus_Interchange) (JTHBI) on Sunday, 26 November 2023. Located along Venture Drive, JTHBI complements Jurong East MRT station and Jurong East Bus Interchange, and will provide added bus capacity to cater to future developments in the area. ## Demographics ### Population history Resident Population 2000-2025YearPop.±%200089,090—200187,880−1.4%200288,390+0.6%200386,230−2.4%200485,850−0.4%200586,010+0.2%200686,210+0.2%200786,550+0.4%200886,800+0.3%200988,520+2.0%201088,120−0.5%201186,890−1.4%201286,550−0.4%201386,950+0.5%201486,570−0.4%201584,980−1.8%201684,660−0.4%201783,590−1.3%201881,180−2.9%201979,240−2.4%202078,600−0.8%202175,890−3.4%202276,390+0.7%202376,180−0.3%202474,530−2.2%202572,960−2.1%Source: ### Age profile The data below is from the population report published by the Singapore Department of Statistics as of June 2025. Age group (years)MalesFemalesTotal population% of total population0–49208801,8002.475–91,2601,1202,3803.2610–141,4601,4102,8703.9315–191,7801,6903,4704.7620–242,1301,9904,1205.6525–292,4402,2104,6506.3730–342,4302,2904,7206.4735–392,1802,3904,5706.2640–442,2102,4504,6606.3945–492,2202,5904,8106.5950–542,6102,8305,4407.4655–592,6002,6905,2907.2560–642,8502,9505,8007.9565–692,9403,1606,1008.3670–742,6602,7005,3607.3575–791,8301,9903,8205.2480–847808801,6602.2885–893605809401.2990+1703305000.69Age group (years)MalesFemalesTotal population% of total population0–143,6403,4107,0509.6615–6423,45024,08047,53065.1565+8,7409,64017,68025.20 The population distribution of Jurong East in 2025 demonstrates a super-aged population structure. There is a higher population concentration among middle-aged and older groups, with males and females both peaking at the 65-69 age range at 4.03% and 4.33% respectively. Notably, the elderly population (aged above 65) constitutes 25.20% of all residents. This is more than double the children population (9.66% aged between 0 and 14), indicating a declining younger demographic and a super-aged population. ### Household As of 2024, there were 66,030 people living in [HDB](/wiki/Housing_and_Development_Board) flats, representing 90.5% of the population. This is significantly higher than the national proportion of HDB dwellers (75.8%), reflecting a greater prevalence of public housing in the area. Among the population, 24,340 residents, or 33.4% of the population, live in 5-Room and Executive Flats, making it the most common type of dwelling. 6,160 residents (8.44%) live in condominiums and other apartments. No residents reside in landed properties. The average household size in Jurong East is 3.09 as of 2020. Among the 27,213 households in Jurong East, the most common household size is two persons, representing 24.4% of total households. Jurong East has a [home ownership](/wiki/Owner-occupancy) rate of 90.1% as of 2020. This is higher than the national home ownership rate of 87.9%, reflecting a greater prevalence of homeowners in Jurong East. ### Ethnicity Ethnic groups in Jurong East (2000−2020) Year[Chinese](/wiki/Chinese_Singaporeans)[Malays](/wiki/Malay_Singaporeans)[Indians](/wiki/Indian_Singaporeans)Others[Pop.](/wiki/Population)PercentagePop.PercentagePop.PercentagePop.Percentage**2000**67,03075.24%14,92216.75%6,4327.22%7050.79%**2010**62,15570.48%14,08415.97%9,75711.06%2,1222.41%**2015**60,13070.75%13,74016.17%9,1501,970**2020**55,44070.53%12,70016.16%8,61010.95%1,8502.35% Consistent with the rest of Singapore, Jurong East has an ethnically diverse population, with a majority Chinese population, constituting 70.53% of the population as of 2020. This is lower than the national proportion of 74.35%. ### Religion Consistent with the rest of Singapore, the largest religion in Jurong East is [Buddhism](/wiki/Buddhism_in_Singapore), with 21,756 practising residents (31.5% of the population). The second most common group consists of residents with [no religion](/wiki/Irreligion_in_Singapore) (12,575 residents, 18.2%). [Islam](/wiki/Islam_in_Singapore) is also prominent in Jurong East, with 12,743 Muslims (18.47%). [Christianity](/wiki/Christianity_in_Singapore) is practised by 9,431 residents (13.67%), with 2,879 Catholics (4.17%). Other religious affiliations include [Taoism](/wiki/Taoism_in_Singapore) and [other Chinese religions](/wiki/Chinese_folk_religion) (7,343 residents, 10.6%), [Hinduism](/wiki/Hinduism_in_Singapore) (4,832 residents, 7.0%), and [Sikhism](/wiki/Sikhism_in_Singapore) (183 residents, 0.27%). Compared to the national average of 18.92%, there is a substantially lower proportion of practising Christians in Jurong East. ### Education As of 2020, 96.6% of the population aged above 15 is literate, ranking the 8th lowest among all planning areas in Singapore. 62.7% of residents are literate in two languages, with the most common language pair being English and Chinese (40.5%). 6.5% of Jurong East residents are literate in three or more languages. 16,602 residents (26.5% of the population) in Jurong East have attained a university qualification. This ranks the fourth lowest of all planning areas in Singapore. In contrast, 8,293 residents, or 13.2% of the population, have no educational qualifications, ranking the 6th highest in Singapore. ### Language Languages most frequently spoken at home, Jurong East (2020 census)Languagespercent[English](/wiki/Singapore_English)37.9%[Mandarin Chinese](/wiki/Mandarin_Chinese)32.5%[Malay](/wiki/Malay_Language)12.6%[Chinese dialects](/wiki/Chinese_dialects)11.2%[Tamil](/wiki/Tamil_Language)4.2%[Other Indian languages](/wiki/Languages_of_India)0.75%Others0.78% In Jurong East, the proportion of residents using [English](/wiki/English_language) as the most frequently spoken language (37.9%) is lower than the national average of 48.3%, ranking the third lowest among all subzones in Singapore. Additionally, there are 2,961 [Tamil](/wiki/Tamil_Language) speakers, representing 84.5% of the 3,485 [Indian language](/wiki/Languages_of_India) speakers in Jurong East. ### Employment and income According to the 2020 Census of Population, 41,926 of residents aged 15 years and over in Jurong East are employed, out of the 44,698 in the [labour force](/wiki/Workforce). This equates to an employment rate of 93.8%, slightly lower than the [national employment rate](/wiki/Employment_in_Singapore) of 94.2%. The remaining 24,310 residents aged above 15 in Jurong East are outside the labour force. Among the employed residents in Jurong East aged 15 years and over, most earn a gross monthly income of between S$1,000 and S$1,999, with 15.3% being in that category. 6.7% earn less than S$1,000 per month, while 4.8% earn above S$15,000 per month. According to the 2020 Census of Population, most resident households in Jurong East have no employed person, constituting 15.6% of all households. The second highest category for monthly household income is S$20,000 and over, encompassing 9.6% of all households. ## Economy At [Jurong Port](/wiki/Jurong_Port), [Jurong River](/wiki/Jurong_River), [Penjuru Crescent](/wiki/Penjuru_Crescent), and parts of Toh Guan and [Teban Gardens](/wiki/Teban_Gardens), there is land allocated for business activities. ### Jurong Lake District The 'Jurong Lake District Project' was unveiled in 2008 and set to be completed in 2040 as part of the plan by [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) to provide more job and recreational options in the heartlands. There will be about 200,000 jobs created and 20,000 homes built in the 360-hectare Jurong Lake District. Consisting of [Jurong Lake](/wiki/Jurong_Lake), Jurong Gateway, [International Business Park](/wiki/International_Business_Park) and the southern section of Toh Guan, the [Jurong Lake District](/wiki/Jurong_Lake_District) will be a prime [regional centre](/wiki/Regional_centre_(Singapore)) serving as a commercial hub for business developments remote from the [Central Area](/wiki/Central_Area,_Singapore), to meet the various demands of businesses and provide employment opportunities closer to people staying in the [West Region](/wiki/West_Region,_Singapore) of Singapore. #### International Business Park The International Business Park (IBP) is also located in Jurong East. Major companies and corporations present in the business park include [Creative Technology](/wiki/Creative_Technology), [Sony](/wiki/Sony), TYLin, [Acer](/wiki/Acer_Inc.), [Merck](/wiki/Merck_%26_Co.), [Johnson & Johnson](/wiki/Johnson_%26_Johnson) and [JTC Corporation](/wiki/JTC_Corporation).[*citation needed*] #### Commercial - Perennial Business City #### Shopping malls Within the boundaries of [Jurong Gateway](/wiki/Jurong_Lake_District) and Toh Guan, there are 3 shopping malls: - [IMM](/wiki/IMM_(Singapore)) - [Jem](/wiki/Jem_(shopping_mall)) - [Westgate](/wiki/Westgate_(Singapore)) #### Town centre The Town Centre of Jurong East is located at [Jurong Regional Centre](/wiki/Jurong_Lake_District), presently known as Jurong Gateway subzone. - Jurong East Town Centre - Jurong Regional Library ## Healthcare ### Polyclinic Jurong East houses one polyclinic, [Jurong Polyclinic](/wiki/National_University_Health_System), located in the [Yuhua](/wiki/Yuhua,_Singapore) precinct. Built in 1988, it was upgraded in 2007. By 2025, the polyclinic will be relocated to a new site 150 metres from its current premises, with a 2.5 times larger capacity and include elderly-friendly features. A 700-bed nursing home will also be built on the new site to cater to the Jurong East's rapidly ageing population. ### Hospitals There are two hospitals in Jurong East, namely [Ng Teng Fong General Hospital](/wiki/Ng_Teng_Fong_General_Hospital) (a 700-bed hospital) and [Jurong Community Hospital](/wiki/Jurong_Community_Hospital) (a 400-bed hospital), located within a single integrated healthcare development. Plans for a new hospital in Jurong East were announced in the Singapore Master Plan 2003. Named Jurong General Hospital, the proposed hospital was to be located within walking distance from the [Jurong East MRT station](/wiki/Jurong_East_MRT_station), and built by 2006 to replace the existing [Alexandra Hospital](/wiki/Alexandra_Hospital). It was to have 650 beds for inpatients and 90 specialist clinics for outpatients. However, in 2004, these plans were scrapped in favour of a new 500-bed hospital in Yishun to be called [Khoo Teck Puat Hospital](/wiki/Khoo_Teck_Puat_Hospital), planned for completion by 28 March 2009. Under the Singapore Master Plan 2008, the plan for Jurong General Hospital was revived. The hospital was renamed to Ng Teng Fong General Hospital and Jurong Community Hospital and construction was completed in 2015. - Media related to Jurong East at Wikimedia Commons\n",
  "language": "en",
  "processed_at": "2026-01-12T11:15:19.508759",
  "title": "Jurong East",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Jurong_East"
}