{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:15:43.159429"
  },
  "content": "Commercial building in Jurong East, Singapore The **Jurong Town Hall**, or **Trade Association Hub (TA Hub)** is a commercial building and the former headquarters of the [Jurong Town Corporation](/wiki/Jurong_Town_Corporation). The building is symbolic of the success of Singapore's industrialisation programme in [Jurong](/wiki/Jurong) and was gazetted as a national monument on 2 June 2015. It served as a hub space for head start technology companies in the 2000s. The building was further developed into a new hub for trade associations with [Singapore Chinese Chamber of Commerce and Industry](/wiki/Singapore_Chinese_Chamber_of_Commerce_and_Industry) as the anchor tenant by 2017. The road [Jurong Town Hall Road](/wiki/Jurong_Town_Hall_Road) was named after this building. ## History Jurong Town Hall was first announced in December 1968, with the [Jurong Town Corporation](/wiki/Jurong_Town_Corporation) (JTC) planning to set aside [S$](/wiki/Singapore_dollar)200,000 (1968) ([US$](/wiki/USD)65,333.43) for the building among other projects summing to [S$](/wiki/Singapore_dollar)30 million (1968) ([US$](/wiki/USD)9.8 million). In April 1969, the JTC hosted a design competition for the building, with 34 entries by October. Local architectural company Team 3 won the competition in December. In February 1971, it was announced that Jurong Town Hall would be part of [S$](/wiki/Singapore_dollar)50.9 million (1971) ([US$](/wiki/USD)16.68 million) spent by the JTC on spillover projects. In the same month, the JTC started calling on tenders with experiences in constructing multi-million dollar office projects and unlimited class in building works for the construction of the Jurong Town Hall. During that time, it was estimated that the building construction would cost [S$](/wiki/Singapore_dollar)7 million (1971) ([US$](/wiki/USD)2.29 million). Construction began later in May, with [piling](/wiki/Piling) works already done and expected completion in January 1973. By December, JTC claimed that the Jurong Town Hall along with a shopping complex were \"the biggest and the most prestigious [projects] planned for [Jurong](/wiki/Jurong) so far\", with Jurong Town Hall's cost being [S$](/wiki/Singapore_dollar)8 million (1971) ([US$](/wiki/USD)2.62 million). In January 1972, its cost was [S$](/wiki/Singapore_dollar)7 million (1972) ([US$](/wiki/USD)2.49 million). In the same month, it was announced that operations in the JTC would be transferred from its headquarters in Yung Kuang Road to Jurong Town Hall by early next year, though some departments like the Estates Department would remain for convenience. At a ceremony on 23 February 1973 officiated by then-Minister for Finance [Hon Sui Sen](/wiki/Hon_Sui_Sen), a [time capsule](/wiki/Time_capsule) containing memorabilia of Jurong between 1960 and 1973 was buried and intended to be open by 2001. By March, the building was nearly complete. In August 1974, [Indonesian President](/wiki/Indonesian_President) [Suharto](/wiki/Suharto) along with his wife [Tien Suharto](/wiki/Tien_Suharto) visited the building since they were interested in the \"Jurong success story\". An eight-people [Indonesian parliamentary](/wiki/People%27s_Consultative_Assembly) delegation led by Deputy Speaker [Mohammad Isnaeni](/wiki/Mohammad_Isnaeni) also visited the building for lunch. The [Shah of Iran](/wiki/Mohammad_Reza_Pahlavi) and [Empress Farah](/wiki/Empress_Farah) also visited the building a month later. ## Tenants of Trade Association Hub (TA Hub) - [Singapore Institute of Purchasing and Materials Management](/wiki/Singapore_Institute_of_Purchasing_and_Materials_Management) (SIPMM) - Singapore Vehicle Traders Association (SVTA) - Container Depot and Logistics Association (CDLA) - Singapore Food Manufacturers' Association (SFMA) - [JTC Corporation](/wiki/JTC_Corporation) - [Singapore Chinese Chamber of Commerce and Industry](/wiki/Singapore_Chinese_Chamber_of_Commerce_and_Industry) (SCCCI) - [Jurong Town Hall Road](/wiki/Jurong_Town_Hall_Road) - Infopedia article\n",
  "language": "en",
  "processed_at": "2026-01-12T11:15:43.159124",
  "title": "Jurong Town Hall",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Jurong_Town_Hall"
}