{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:15:17.506463"
  },
  "content": "Commercial district and Regional centre in West Region, Singapore **Jurong** (/dʒuːrɒŋ/) is a major [geographical region](/wiki/Region) located at the south-westernmost point of the [West Region](/wiki/West_Region,_Singapore) of [Singapore](/wiki/Singapore). Although mostly vaguely defined, the region's extent roughly covers the [planning areas](/wiki/Planning_Areas_of_Singapore) of [Jurong East](/wiki/Jurong_East), [Jurong West](/wiki/Jurong_West), [Boon Lay](/wiki/Boon_Lay_Planning_Area), and [Pioneer](/wiki/Pioneer,_Singapore), along with [Jurong Island](/wiki/Jurong_Island) in the [Western Islands](/wiki/Western_Islands,_Singapore) cluster and the southernmost portions of the [Western Water Catchment](/wiki/Western_Water_Catchment).[note 1] The Jurong region can also include present-day [Bukit Batok](/wiki/Bukit_Batok) and [Tuas](/wiki/Tuas). Jurong also covers several offshore islands as well, including Pulau Damar Laut and [Pulau Samulun](/wiki/Pulau_Samulun), both of which are located within the planning areas of Jurong East and Boon Lay respectively; along with the aforementioned Jurong Island. The coastline of the region on [mainland Singapore](/wiki/Pulau_Ujong), faces the strait of Selat Jurong, while the southernmost island of the region, Jurong Island, faces the strait of [Selat Pandan](/wiki/Selat_Pandan). Jurong was first developed and heavily industrialised in the late 1960s in response to the general economic situation of post-independence Singapore, and remains vital to the country's economic growth, either [commercial](/wiki/Commercial_area), [industrial](/wiki/Industrial_city) and [residential](/wiki/Residential). The heavy redevelopment of the region paved the way for the opening of a large-scale industrial sector in the country, something which was unprecedented at that time. Today, Jurong has become one of the most densely populated industrial areas in the country. Since the turn of the century, Jurong is envisioned to be the country's second [central business district](/wiki/Central_business_district) (CBD) as part of the [Jurong Lake District](/wiki/Jurong_Lake_District) project. ## Etymology \"Jurong\" took its name from [Sungei Jurong](/wiki/Sungei_Jurong), a river that still channels into [Jurong Lake](/wiki/Jurong_Lake), the latter of which was created by damming the river itself. Although its origins are disputed, the core definition of \"Jurong\", is probably derived from several meanings in [Malay](/wiki/Malay_Language). The term could probably refer to the word for [shark](/wiki/Shark), \"*Jerung*\". It can also be derived from the word \"*Jurang*\" or a [gorge](/wiki/Canyon). Jurong could also take its name from the word, \"*Penjuru*\", which roughly translates to, corner. Penjuru may most likely refer to the peninsula that sits between Sungei Jurong and Sungei Pandan. The [native Malays](/wiki/Ethnic_Malays) named this peninsula, Tanjong Penjuru, which can be translated as Cape Corner in English. The present-day site of Tanjong Penjuru is now the subzone of [Penjuru Crescent](/wiki/Penjuru_Crescent). ## Geography ### Pre-industrial Jurong #### Landscape Although Jurong's geography was documented on a few maps and records following [Singapore's founding in 1819](/wiki/Founding_years_of_modern_Singapore), the area only became clearer to the British in an 1828 geographical survey of the island by [Lieutenant Philip Jackson](/wiki/Philip_Jackson_(surveyor)). In a map that was drawn after the survey, the lieutenant clearly describes most of Jurong's natural geography with the two rivers of Jurong, Sungei Jurong and Sungei Pandan, marked on the map. He also noted down several islands which have since ceased to exist. Such islands include, Pulau Ayer Chawan, Pulau Butun, Pulau Pese (Pulau Pesek), Pulau Sakra and Pulau Saraya (Pulau Seraya), all of which have since merged to form [Jurong Island](/wiki/Jurong_Island). Current geographical landmarks such as Pulau Damar Laut and the strait of Selat Sembilan (now Selat Jurong) have also been included on the map. The two rivers of Jurong were mentioned again in 1848, when a second survey conducted by [John Turnbull Thomson](/wiki/John_Turnbull_Thomson), described the original shape and settlements of Sungei Jurong and Sungei Pandan. Turnbull describes both rivers as, \"large creeks\" with settlements around them both. However, in the case of Sungei Jurong, Thomson gives his description as such: > a large creek which divides at the top into two branches, the east one being called by the Chinese the Jurong, and the west Peng Kang — John Turnbull Johnson Before the damming of Sungei Jurong, the present-day site of [Jurong Lake](/wiki/Jurong_Lake) was once occupied by two streams that split at the junction of the river. These two streams have since ceased to exist. However, like what Thomson said, these bodies of water roughly marked the present day locations of Jurong East and West, at that time identified as Jurong and Peng Kang on colonial era maps respectively. Before its development in the 1960s, Jurong was left close to its pristine state after Singapore's founding in 1819. Although there were a few settlements around Jurong, most of the land was mainly uncharted territory. Swamps dominated the coastline of Jurong, yielding large amounts of wildlife such as [mudskippers](/wiki/Mudskipper) and [horseshoe crabs](/wiki/Horseshoe_crab). A forest reserve of [dipterocarp](/wiki/Dipterocarpaceae) trees would have once stood inland behind the grove of [rhizophora](/wiki/Rhizophora_apiculata) trees along the coast. Low hills were mainly the highest elevated points around Jurong, although most of them were later levelled over the years. This was evident, given the description made by [Commodore Perry](/wiki/Matthew_C._Perry) in his accounts of Jurong made during the [Perry Expedition](/wiki/Perry_Expedition): > Inland, the surface of the country is diversified with low hills and shallow valleys. — Matthew Calbraith Perry, [Narrative of the Expedition of an American Squadron to the China Seas and Japan](/wiki/Narrative_of_the_Expedition_of_an_American_Squadron_to_the_China_Seas_and_Japan) #### Territorial extent In maps made by the British administration before Singapore's self-governance in 1959, the colonial era district (mukim) of Jurong was rather small, occupying what is today the present-day town of [Bukit Batok](/wiki/Bukit_Batok) and Tengah. Jurong Mukim was earlier known as West Bukit Timak Mukim, the renaming to Juong Mukim is probably with reference the Jurong settlement located at the head of Jurong River and also located at the south-west corner of this Mukim. Other than that, most part of Jurong Mukim has very little historical basis for calling herself 'Jurong'. Furthermore, many residents have often regarded the areas along the stretch of [Jurong Road](/wiki/Jurong_Road), especially the southern areas, as part of the extant of Jurong. Such areas include the colonial era districts (mukims) of Peng Kang (now Jurong West and Boon Lay), the southern portions of Choa Chu Kang (now Jurong West extension and NTU), Pandan (now split into Jurong East to the west and Clementi to the east) and Tuas (now Pioneer and the newly reclaimed Tuas peninsula).[note 2] ### Modern Jurong #### Ecology Today, most of what is left of the original pristine Jurong is restricted to the areas around the [Pandan Reservoir](/wiki/Pandan_Reservoir) and Sungei Pandan. Little traces of the dipterocarp forest still remain. The mangrove swamps today are now just a fraction of its former self, located at the mouth of Sungei Pandan. The untouched mangrove fringes still hold the last remnants of wildlife in Jurong. It is because of this that area remains a hotspot for nature enthusiasts and bird watchers to this day. #### Water bodies > the sea shore is low and overgrown with mangroves, and occasionally broken by the entrances of salty creeks, which, penetrating sometimes to the extent of six or seven miles, overflow their banks, and convert their neighbouring soil into marsh. — Matthew Calbraith Perry, [Narrative of the Expedition of an American Squadron to the China Seas and Japan](/wiki/Narrative_of_the_Expedition_of_an_American_Squadron_to_the_China_Seas_and_Japan) Jurong is home to two prominent rivers, Sungei Jurong and Sungei Pandan, both of which flow into two larger water bodies, Jurong Lake and [Pandan Reservoir](/wiki/Pandan_Reservoir) respectively. The two rivers also source from Selat Jurong, a strait that faces south of mainland Singapore and north of Jurong Island. The two rivers also have extensions that flow into the mainland portion of the region. Sungei Pandan has a western branch, Sungei Ulu Pandan, which flows from Jurong East into the town of Clementi before cutting off at [Queenstown](/wiki/Queenstown,_Singapore) located east of Clementi. Sungei Jurong channels out of Jurong Lake via a stream located west of the lake and Jurong Canal located directly north of the lake. The canal also serves as the boundary line between the towns of Jurong East and West. #### Elevation points The highest elevation point in the region is [Jurong Hill](/wiki/Jurong_Hill), which is located close to the centre of the industrial estate at Jurong (positioned north of [Jurong Island](/wiki/Jurong_Island)) just adjacent to [Jurong Bird Park](/wiki/Jurong_Bird_Park). #### Geology Jurong's unique locale lends to itself a special rock formation unlike any other in Singapore. Named the [Jurong Formation](/wiki/Jurong_Formation), the [sedimentary rock](/wiki/Sedimentary_rock) deposits can trace its roots back to the [late Triassic](/wiki/Late_Triassic) and [early](/wiki/Early_Jurassic) to [middle Jurassic](/wiki/Middle_Jurassic) periods. #### Territorial extent The name \"Jurong\" is often used to collectively describe the region's five main planning areas. However, the URA does not officially recognise all of these places as a single territorial entity. Since the gazetting of the 1998 Master Plan, the Authority has officially classified Jurong as five individual separate planning areas. When Jurong is split into these five contiguous parts, it forms Jurong East and West in the north and north-west, Boon Lay and Pioneer to the south and south-west and Tuas to the extreme west of the region. Each of these individual areas can yet be further divided into subzones, smaller [subdistricts](/wiki/Subdistrict) that are a part of the larger planning area itself. If all five planning areas are combined, there would be a grand total of 34 subzones in Jurong. The boundaries of modern-day Jurong were first demarcated in the 1960 proposal of the new town. The planned town was to be located entirely south of Jurong Road, combining land that was once the colonial era districts (mukims) of Peng Kang, Pandan and the southernmost portion of Choa Chu Kang.[note 2] As a result of this proposal, the government gazetted portions of land from these areas to increase the overall size of Jurong. These boundaries were later further defined with the introduction of the URA 1991 Concept Plan in September 1991. ## History ### Before Raffles (c. 1600 – 1819) The earliest known significance of Jurong can be traced back to 1595 on a maritime documentation of oriental trading routes. Titled \"*Reys-gheschrift van de Navigation der Portugaloysers in Orienten*\", the journal written by Dutch author [Jan Huyghen van Linschoten](/wiki/Jan_Huyghen_van_Linschoten), names a certain \"Selat Sembilan\" that one must cross eastwards after reaching the southernmost end of the [Strait of Malacca](/wiki/Strait_of_Malacca). This suggests that the straits near Jurong witnessed a significant role in the ancient maritime [Silk Road](/wiki/Silk_Road). Although not mapped by Linschoten, the location of Selat Sembilan was later identified in [Philip Jackson](/wiki/Philip_Jackson_(surveyor))'s 1828 survey of Singapore. Despite much land-reclamation works along most coastal parts of Jurong and Tuas, Selat Sembilan still exists today as Selat Jurong, stretching along the entire coastline of the region. Even before the [arrival](/wiki/Founding_years_of_modern_Singapore) of [Sir Stamford Raffles](/wiki/Stamford_Raffles) in 1819, small settlements had already been built along Jurong's coastal areas as well as the present-day site of Jurong Island, Pulau Damar Laut and Pulau Sembulan. Such squatters were inhabited by the native [Orang laut](/wiki/Orang_laut), and there also immigrants from the nearby [Dutch East Indies](/wiki/Dutch_East_Indies) and [Malaya](/wiki/Malay_Peninsula). ### Colonial era (1819 to 1942) #### Earliest developments Post-colonization, Jurong had a small population of inhabitants scattered along the banks of the area's two main rivers, Sungei Jurong and Sungei Pandan. It consisted mainly of a large [Chinese](/wiki/Han_Chinese) and [Malay](/wiki/Ethnic_Malay) migrant population. The majority of the Chinese population was [Hokkien](/wiki/Hokkien)-speaking, immigrating from [Anxi County](/wiki/Anxi_County) in the province of [Fujian](/wiki/Fujian), [China](/wiki/Qing_dynasty). A [Teochew](/wiki/Teochew_people) demographic was also prevalent in Jurong. Originating from the City of [Jieyang](/wiki/Jieyang), the Teochew-speaking population mainly settled along the westernmost portions of Jurong. Most of the Malays and Orang Laut in the area were natives of the land, settling in squatters and villages located along the coast of Jurong long before the founding of Singapore as a British colony in 1819. There were also other ethnic Malay groups that came down from the rest of the [Malay Archipelago](/wiki/Malay_Archipelago) who migrated from various parts of present-day [Malaysia](/wiki/Malaysia) and [Indonesia](/wiki/Indonesia). However, the exact statistics concerning foreign Malays settling in Jurong after 1819 is not clear. In a visit to the area in 1848, the then-Chief Surveyor of Singapore, [John Turnbull Thomson](/wiki/John_Turnbull_Thomson), made one of the earliest accounts regarding human settlements in Jurong. He described the demographics along Sungei Jurong as such: > The Chinese here are numerous and there are also several Malay villages. — John Turnbull Thomson, Thomson also gave his description on the population along Sungei Pandan: > a large creek with Chinese and Malays at the head... — John Turnbull Thomson, With the increase in population size over the years, the need for a mode of travel to and from the Town of Singapore, was necessary. Between 1852 and 1853, the first few portions of [Jurong Road](/wiki/Jurong_Road) were paved to connect villages around Jurong to the metropolitan areas of Singapore Town and the rest of the island. This first portion of Jurong Road started from the seventh milestone of Bukit Timah Road ending along the head of Sungei Jurong. Although it isn't known when the rest of the road was paved, by 1936, the road stretched up to the district of Tuas. ##### An American expedition In 1853, US Navy [Commodore](/wiki/Commodore_(United_States)) [Matthew C. Perry](/wiki/Matthew_C._Perry) led a maritime expedition to Japan in an attempt to open up the country (then under self-imposed isolation) to the world for trade and the possible building of political and economic ties. The fleet of the [Perry Expedition](/wiki/Perry_Expedition) stopped over at a few countries before reaching the [Japanese archipelago](/wiki/Japanese_archipelago). One of the few docking locations during the trip was Singapore. This made it the second time that the United States had made a diplomatic presence on the island since the [Exploring Expedition](/wiki/United_States_Exploring_Expedition). Perry's crew anchored their fleet of two [frigates](/wiki/Frigates) and two [sloops-of-war](/wiki/Sloop-of-war) along Selat Sembilan and Sungei Jurong, where they surveyed the surroundings of the strait and the river. [Wilhelm Heine](/wiki/Wilhelm_Heine) and Eliphalet Brown, two of the official expedition's artists, were tasked at producing a lithograph depicting the villages along Sungei Jurong. The resulting image was one of the earliest illustrations of colonial-era Jurong. The interesting point of the image is the scene of a forest fire shown in the background. This was common at the time as such raging wildfires were often rampant and common throughout most of Jurong in the mid-19th century. Another point worthy of note in the image is the [United States flag](/wiki/Flag_of_the_United_States) seen affixed on the [stern](/wiki/Stern) of the [sampan](/wiki/Sampan) in the foreground. #### Earliest industries ##### Agriculture and aquaculture Before the early 1960s, the area was dominated by small and large plantations, cultivating crops such as [pineapple](/wiki/Pineapple), [pepper](/wiki/Black_pepper), [gambier](/wiki/Uncaria_gambir) and [nutmeg](/wiki/Nutmeg). These crops provided key sources of income for the district's population. Among them, gambier was the primary export of Jurong's plantations during the early period. Valued for its practical uses and medicinal properties, gambier became a highly profitable crop for Chinese [kangchu](/wiki/Kangchu_system)-owners, local communities and other plantation owners, both local and foreign. In 1855, the Municipal Committee of the British colonial government reported the existence of 20 legally recognised gambier plantations existing within Jurong. However, this figure is likely an underestimation, as numerous illegal plantations were also set up in the area. [Rubber](/wiki/Natural_rubber) was also a popular agricultural industry in Jurong during this period and was regarded as a strong competitor to the thriving gambier plantation businesses. By the first half of the 20th century, rubber tapping and plantation practices had largely replaced the planting and harvesting of gambier, which had previously dominated Jurong's agricultural scene. A notable example of a business that transitioned from gambier to rubber cultivation was the plantation firm owned by Chinese business magnate Chew Boon Lay. The extensive land his plantation stood on became associated with his name. Today, this area is known as [Boon Lay Place](/wiki/Boon_Lay), a subzone within the new town of Jurong West. Aside from the reliance on cash crops and large plantations, fishing was also another prominent source of income for the locals in Jurong. This livelihood was predominantly undertaken by the local Malay and Orang Laut community, most of whom chose to live along the coastlines of Jurong or had already settled there for many generations. Fishing was also conducted along two prominent rivers in the area, Sungei Jurong and Sungei Pandan. Numerous prawn farms were also set up along these two rivers where crustacean species thrived naturally. By the 1950s, 500 acres of land in Jurong were specifically designated for prawn farming. This was roughly half of the total land used for prawn farms across Singapore at that time. ##### Manufacturing and processing For some time before the period of rapid industrialisation occurring in Jurong throughout the 1960s, Jurong was already a host to several businesses in the heavy industry (primarily dealing with construction and manufacturing), most notably, the brickwork industrial sector. Local businesses involved in brick manufacturing and earthenware production were largely set up around [Yunnan](/wiki/Yunnan,_Jurong_West) in Jurong West, where the soil conditions there could yield much [clay](/wiki/Clay) and [terracotta](/wiki/Terracotta). Although almost all of these factories and industries closed down over the years (most were shut down by the late 1990s and early 2000s), the brickwork industry remains significant in Jurong, primarily through its historical legacy and enduring influence. The earliest brick factories in Jurong emerged in the 1920s, exporting large quantities of building materials to construction sites around Singapore and Malaya (now Malaysia). Among the notable factories was Jurong Brickworks, established in the 1930s. It became one of Singapore's largest privately owned brick manufacturers and suppliers. At its peak in the 1970s, the company manufactured more than three million bricks per month. Jurong Brickworks was acquired by the government for redevelopment in 2004 for the construction of Tengah New Town, and the manufacturing plant was demolished in 2005. Another notable earthenware-production business located in Jurong is the [Thow Kwang Dragon Kiln](/wiki/Thow_Kwang_Pottery_Jungle). Set up by Chinese immigrants in the 1940s, this pottery manufacturer, along with its neighbouring counterpart, the Jalan Bahar Clay Studios, continues to exist to this day and remains the only possessor of a pair of [dragon kilns](/wiki/Kiln) in Singapore. Although located in an area that is traditionally a part of Jurong, the kilns are technically located next to [Nanyang Technological University](/wiki/Nanyang_Technological_University), which is situated in the [Western Water Catchment](/wiki/Western_Water_Catchment). ##### Similar business ventures Aside from his plantation, Chew Boon Lay also owned one of the earliest factories (a manufacturing plant) that was located in Jurong. During its time in business operation from 1950 to 1958, the manufacturing plant produced a wide range of [canned goods](/wiki/Canning) (foodstuff) that ranged from [kaya](/wiki/Kaya_(jam)) to [curry](/wiki/Curry) and even [peanut butter](/wiki/Peanut_butter). It was located along [Jalan Ahmad Ibrahim](/wiki/Jalan_Ahmad_Ibrahim) and was opposite the location of the former [Jurong Bird Park](/wiki/Jurong_Bird_Park). This same building was also a temporary location for the management offices of the [Jurong Town Corporation](/wiki/JTC_Corporation) in 1968. ### Second World War (1941–45) #### 101 Special Training School Following the [invasion of Thailand](/wiki/Japanese_invasion_of_Thailand) in the beginning of December 1941, the [Imperial Japanese Army](/wiki/Imperial_Japanese_Army) was rapidly heading southwards down the [Malay Peninsula](/wiki/Malay_Peninsula) towards Singapore. It was rather obvious, by then, to many that a Japanese military assault on the island was nearly imminent. In light of the oncoming threat, the Oriental Mission of the UK's [Special Operations Executive](/wiki/Special_Operations_Executive) chose to set up a training institution/school in Singapore to assist and train members of possible anti-Japanese resistance movements throughout Japanese-occupied British Malaya and, later, Singapore. One proposed site for the training base was at [Pulau Ubin](/wiki/Pulau_Ubin). However, the suggestion was dropped due to several reasons. Issues such as the difficulty of clearing thick jungle foliage, the cost of building and developing the training base's site, the lack of access to freshwater and the risk of contagious [malaria](/wiki/Malaria) and other diseases made Pulau Ubin unsuitable for a possible location. Later on, during the formation of the Singapore Armed Forces, the proposed site for the training bases were located at [Pasir Laba](/wiki/Pasir_Laba) and [Pulau Tekong](/wiki/Pulau_Tekong) respectively. [Pasir Laba](/wiki/Pasir_Laba) was the first to be built during the formation of SAF, and set up the live firing zone in the west. Pulau Tekong was the second to be built. The SOE eventually settled on a small, isolated island known as Tanjong Balai. Located at the mouth of Sungei Jurong, the island featured a single man-made structure consisting of a lone bungalow formerly owned by Jewish businessman Joseph Brook David. In addition to the bungalow, the island was concealed within a canopy of secondary-type rainforest. Its location offered the advantage of accessibility either by boat or via a discreet jungle path. With the SOE's settling down at Tanjong Balai, the Number 101 Special Training School was created and mainly trained its personnel in the various fields of sabotage, reconnaissance and espionage to prepare them for resistance efforts against Japanese occupation forces. With the invading Japanese military pushing into Singapore by February in 1942, the training base was quickly closed down with the destruction of related documents and the abandonment of the training base Tanjong Balai. A new SOE training base was later established in [Burma](/wiki/Myanmar) in the former capital city of Myanmar at [Rangoon](/wiki/Yangon). Today, the island of Tanjong Balai and the training base located there are largely unheard of by many modern-day Singaporeans. The island has since been subsumed by [Jurong Port](/wiki/Jurong_Port) after further land-reclamation works were carried out in the 1980s to expand the harbour. ### Modern history (1960–present) #### The need to industrialise Post-war Singapore was plagued with significant economic and financial challenges. A largely uneducated population and a chronic lack of job opportunities contributed to a scarcity of skilled manpower. By the end of the decade of the 1950s, the unemployment rate in post-war Singapore stood at about 14%, encompassing an estimated 200,000 people across the population. Compounding the issues of widespread unemployment and resulting poverty was the government's need to address the country's high birth rate, which was increasing annually by about 4%. With the [Cold War](/wiki/Cold_War) and the then-constant threat of [communism](/wiki/Malayan_Communist_Party) spreading from Malaya, the country's [Legislative Assembly](/wiki/Legislative_Assembly_of_Singapore) was being pressured to keep the British-ruled [crown colony](/wiki/Colony_of_Singapore) financially stable and economically strong. In 1959, the [People's Action Party](/wiki/People%27s_Action_Party) won the [first general election held in a self-governing Singapore](/wiki/1959_Singaporean_general_election). A crucial element of the party's agenda upon coming to power was the promise of creating more and better employment opportunities for the people and the need to build and strengthen the weak economy of a newly developing self-governing nation. To address this urgent need, the new PAP-led government tasked [Goh Keng Swee](/wiki/Goh_Keng_Swee), the then-[finance minister](/wiki/Ministry_of_Finance_(Singapore)) was quickly put in charge of tackling Singapore's economic challenges. Goh determined that industrialisation was the only way to improve and strengthen Singapore's weak economy. He envisioned the development of a major industrial town featuring modern industries mainly based in the manufacturing sector, such as shipyards, steelworks, chemical plants and other factories. While the idea of industrialisation in Singapore was not new, Goh's plans for an industrial estate in Jurong were far more ambitious and comprehensive than previous proposals. #### Jurong Industrial Estate On the 4th of July in 1960, the [Legislative Assembly of Singapore](/wiki/Legislative_Assembly_of_Singapore) announced a proposal to construct a new industrial town in Jurong. The entire project, which totalled $45.7 million in cost, begun almost immediately after the proposal's announcement, with the immediate processes of planning and designing taking place in August in that same year. For Jurong's industrialisation, Singapore sought international assistance for its economic development. The United Nations Industrial Survey Mission assigned Dutch economic/financial advisor [Albert Winsemius](/wiki/Albert_Winsemius) to lead the nation's economic development efforts. The same UN mission also deployed Frenchman Mr P. Schereschewsky to survey Jurong's suitability as an industrial town. In 1961, the [Economic and Development Board](/wiki/Economic_Development_Board) (the EDB) was formed to spearhead Singapore's industrialisation. That same year, [earthworks](/wiki/Earthworks_(engineering)) commenced for the development of Jurong's industrial estate. In 1962, the then-[finance minister](/wiki/Ministry_of_Finance_(Singapore)) of Singapore, Dr. [Goh Keng Swee](/wiki/Goh_Keng_Swee), laid the [foundation stone](/wiki/Foundation_stone) for the newly established National Iron and Steel Mills, the first factory in the new industrial estate. This factory, now known as NatSteel, is currently a subsidiary of Tata Steel of India. Jurong Industrial Estate expanded rapidly after the opening of National Iron and Steel Mills.: 80 In May 1965, [Jurong Port](/wiki/Jurong_Port) became operational. In 1968, the [Jurong Town Corporation](/wiki/Jurong_Town_Corporation) was established to direct and manage Jurong's development.: 80 By this time, a total of 14.78 square kilometres of industrial land had been prepared, with 153 factories fully operational and 46 more under construction. As [Singapore's economy](/wiki/Economy_of_Singapore) continued to grow rapidly, addressing the challenge of accommodating new businesses and industries became increasingly pressing. To meet these demands, seven [islets](/wiki/Islet) off the southern coast of Jurong were merged to create the 30 square-kilometre [Jurong Island](/wiki/Jurong_Island), which became the hub for [oil](/wiki/Petroleum), [chemical](/wiki/Chemical) and [petrochemical](/wiki/Petrochemical) factories, manufacturing industries and plants in Singapore. The construction and development of Jurong Island began in the early 1990s and was scheduled to be completed by 2010. By 2016, much of the development works have been completed, with some newer developments continuing to emerge. A number of heavy-type industrial companies and firms, such as DuPont and Teijin Polycarbonate, began operations on the island in the late 1990s. The Jurong Island Causeway provides the only land-based link to Jurong Island from mainland Singapore. Following the [September 11 attacks](/wiki/September_11_attacks) in 2001, access to Jurong Island became heavily restricted. An entry/exit security pass is now required for all employees working at Jurong Island, and cameras and all other recording equipment are banned from being transported into the island. The success of Jurong Industrial Estate was a model for Singapore's later Regional Industrial Parks program, through which Singapore sought to boost its domestic economy through foreign industrial parks modeled on Jurong Industrial Estate.: 80 #### Townships of Jurong The first few low-rise flats in Jurong Town emerged in the precinct of [Taman Jurong](/wiki/Taman_Jurong) between 1963 and 1964, developed by the [Housing and Development Board](/wiki/Housing_and_Development_Board). Around this time, other notable housing estates, such as [Boon Lay](/wiki/Boon_Lay), began breaking ground. Despite the new residential developments, Jurong lacked a growing population, largely due to its location and the lack of infrastructure around the region at the time. The development of Jurong East and West started in 1979 when estates such as [Taman Jurong](/wiki/Taman_Jurong), [Boon Lay Place](/wiki/Boon_Lay_Place), [Bukit Batok](/wiki/Bukit_Batok), [Bukit Gombak](/wiki/Bukit_Gombak), [Hong Kah](/wiki/Hong_Kah), [Teban Gardens](/wiki/Teban_Gardens) and [Yuhua](/wiki/Yuhua,_Singapore) were built, mostly due to the resettlement of Hong Kah and surrounding villages. Boon Lay Place, Taman Jurong and Hong Kah formed Jurong West New Town. Yuhua, Teban Gardens, Bukit Batok and Bukit Gombak formed Jurong East New Town. In 1982, Jurong West New Town started expanding as Jurong West Extension, which saw the realignment of the [PIE](/wiki/Pan_Island_Expressway), rerouting it to pass the southern boundary of present-day [NTU](/wiki/Nanyang_Technological_University). The former section of the [PIE](/wiki/Pan_Island_Expressway) was converted into Jurong West Avenue 2, and Upper Jurong Road was renamed to Jurong West Avenue 4. Pioneer Road was extended northward from present-day Upper Jurong Road, becoming Pioneer Road North, to connect to the new [PIE](/wiki/Pan_Island_Expressway) exit. This signalled the start of the development of Jurong West Extension ([Yunnan](/wiki/Yunnan,_Singapore), [Pioneer](/wiki/Pioneer,_Singapore) and [Gek Poh](/wiki/Gek_Poh_Ville)). The N9 estate was the first to be built, while the N6 estate was the last, constructed only in the early 2000s. The MRT Line was extended from Lakeside to Boon Lay in 1990 and again to Pioneer in 2009. #### Spyros disaster On 12 October 1978, a Greek oil [tanker](/wiki/Tanker_(ship)), *Spyros*, exploded at [Jurong Shipyard](/wiki/Samulun), killing more than 70 people in the immediate vicinity. The result was one of the worst man-made disasters/calamities since the [Second World War](/wiki/Japanese_occupation_of_Singapore) in Singapore and the worst industrial accident since the country gained full independence in 1965. ## Transportation ### Private Jurong is well connected to the rest of Singapore by road, with [Kranji Expressway](/wiki/Kranji_Expressway) linking them to the northern part of Singapore, [Pan Island Expressway](/wiki/Pan_Island_Expressway) linking them to the Eastern part of Singapore and the [Ayer Rajah Expressway](/wiki/Ayer_Rajah_Expressway) linking them to the south-eastern part of Singapore. Clementi Avenue 6 and Jurong Town Hall Road complement the 3 expressways, topping off the well-built road connection from Jurong to all parts of the island. ### Mass Rapid Transit (MRT) The region is well-connected to the [MRT](/wiki/Mass_Rapid_Transit_(Singapore)) system, served by two MRT lines, the [East West Line](/wiki/East-West_MRT_line) and the [North South Line](/wiki/North-South_MRT_line). Two MRT stations serve the [Jurong East](/wiki/Jurong_East) region: - **EW24** **NS1** [Jurong East](/wiki/Jurong_East_MRT_station) - **EW25** [Chinese Garden](/wiki/Chinese_Garden_MRT_station) Three MRT stations serve the [Jurong West](/wiki/Jurong_West) region: - **EW26** [Lakeside](/wiki/Lakeside_MRT_station) - **EW27** [Boon Lay](/wiki/Boon_Lay_MRT_station) - **EW28** [Pioneer](/wiki/Pioneer_MRT_station) Four MRT stations serve the [Pioneer](/wiki/Pioneer,_Singapore) & [Tuas](/wiki/Tuas) industrial areas: - **EW29** [Joo Koon](/wiki/Joo_Koon_MRT_station) - **EW30** [Gul Circle](/wiki/Gul_Circle_MRT_station) - **EW31** [Tuas Crescent](/wiki/Tuas_Crescent_MRT_station) - **EW32** [Tuas West Road](/wiki/Tuas_West_Road_MRT_station) - **EW33** [Tuas Link](/wiki/Tuas_Link_MRT_station) Scheduled to be completed in 2029 and 2032 respectively, the [Jurong Region MRT line](/wiki/Jurong_Region_Line) and [Cross Island MRT line](/wiki/Cross_Island_Line) will help to further connect commuters to places in Jurong and the rest of Singapore. ### Bus Jurong is served by public bus services originating from 5 interchanges and 1 bus depot, namely the [Jurong East](/wiki/Jurong_East_Bus_Interchange), [Jurong Town Hall](/wiki/Jurong_Town_Hall_Bus_Interchange), [Boon Lay](/wiki/Boon_Lay_Bus_Interchange), [Joo Koon](/wiki/Joo_Koon_Bus_Interchange) & [Tuas](/wiki/Tuas_Bus_Terminal) bus interchanges and [Soon Lee Bus Depot](/wiki/Soon_Lee_Bus_Depot). ## Economy ### Commercial The more notable shopping malls in Jurong are [Jurong Point Shopping Mall](/wiki/Jurong_Point_Shopping_Mall) in [Pioneer](/wiki/Pioneer,_Singapore) and the cluster of malls in [Jurong East](/wiki/Jurong_East), as part of the Jurong Gateway commercial hub. These include [IMM](/wiki/IMM_(Singapore)), [Jem](/wiki/Jem,_Singapore) and [Westgate](/wiki/Westgate,_Singapore). The largest suburban mall in Singapore, Jurong Point Shopping Mall is well-accessible by bus services from all the residential precincts of Jurong except [Yuhua](/wiki/Yuhua,_Singapore) and [Teban Gardens](/wiki/Teban_Gardens). This mall targets young adults and families with stalls selling fashion, food and beverages, sports, entertainment and lifestyle products. It also serves the elderly population with body-wellness stores and healthcare centres located at levels 4 and 5 of the mall. It is well linked to the [Boon Lay MRT station](/wiki/Boon_Lay_MRT_station) and [Boon Lay Bus Interchange](/wiki/Boon_Lay_Bus_Interchange). The largest [outlet mall](/wiki/Outlet_store) in Singapore, IMM is located within walking distance from [Jurong East MRT station](/wiki/Jurong_East_MRT_station). The mall contains a [Kopitiam](/wiki/Kopitiam_(company)) food court on Level 3, as well as many furniture stores and other retail stores. These include a [Daiso](/wiki/Daiso) department store and a [Giant Hypermarket](/wiki/Giant_Hypermarket). [J-Walk](/wiki/J-Walk_(pedestrian_network)), a pedestrian network made up of [elevated walkways](/wiki/Skyway) and at-grade sheltered walkways, connects the shopping malls and hospitals in Jurong East to [Jurong East MRT station](/wiki/Jurong_East_MRT_station). There are other shopping malls in Jurong, but are only well known within the precinct they are located in. Such malls include Hong Kah Point in [Hong Kah](/wiki/Hong_Kah) and Taman Jurong Shopping Centre in [Taman Jurong](/wiki/Taman_Jurong). ## Tourism - [Singapore Science Centre](/wiki/Singapore_Science_Centre) - [Snow City](/wiki/Snow_City) - [Singapore Discovery Centre](/wiki/Singapore_Discovery_Centre) - Singapore Army Museum - [Jurong Bird Park](/wiki/Jurong_Bird_Park) (ceased and relocated to Mandai in 2023) - Jurong Lake Gardens - ABC Waters @ Jurong Lake (largest man-made floating wetlands with a total area of 3,850 sqm) ## Education There are multiple primary and secondary schools in each precinct of Jurong. Examples include the Shuqun Primary School established in 1925 in Jurong West, as well as [River Valley High School](/wiki/River_Valley_High_School_(Singapore)) established in 1956 in Boon Lay. Prior to 2019, Jurong had one junior college, [Jurong Junior College](/wiki/Jurong_Junior_College), located between [Hong Kah](/wiki/Hong_Kah) and [Boon Lay](/wiki/Boon_Lay). The school has since merged with Pioneer Junior College to form [Jurong Pioneer Junior College](/wiki/Jurong_Pioneer_Junior_College). ## Politics Jurong used to be an independent political constituency in the 1959 general elections. [Chia Thye Poh](/wiki/Chia_Thye_Poh) represented the constituency in parliament between 1963 and 1966. Then, Boon Lay Constituency was carved out in 1976 and Hong Kah Constituency in 1984, forming four separate constituencies. Hong Kah Constituency eventually became a [GRC](/wiki/Group_Representation_Constituency) that consisted of [Nanyang](/wiki/Nanyang,_Singapore), [Hong Kah](/wiki/Hong_Kah), [Gek Poh](/wiki/Gek_Poh_Ville) and [Bukit Batok](/wiki/Bukit_Batok) in 1988. [Teban Gardens](/wiki/Teban_Gardens), [Pioneer](/wiki/Pioneer,_Singapore), [Yuhua](/wiki/Yuhua,_Singapore) and [Taman Jurong](/wiki/Taman_Jurong) were under Bukit Timah Constituency and the N9 region of [Nanyang](/wiki/Nanyang,_Singapore) was under Jurong Constituency all that while. In 2001, there were major changes in the political constituencies of Jurong. Boon Lay Constituency, together with [Teban Gardens](/wiki/Teban_Gardens) and [Pioneer](/wiki/Pioneer,_Singapore), were absorbed into the expanded [West Coast GRC](/wiki/West_Coast_Group_Representation_Constituency). Hong Kah Constituency was re-designed to include towns of [Chua Chu Kang](/wiki/Chua_Chu_Kang) (Limbang and Yew Tee) and [Bukit Gombak](/wiki/Bukit_Gombak) and only [Nanyang](/wiki/Nanyang,_Singapore) and [Gek Poh](/wiki/Gek_Poh_Ville) remained in the constituency, this time including the N9 region of [Nanyang](/wiki/Nanyang,_Singapore). Jurong Constituency was abolished. [Hong Kah](/wiki/Hong_Kah) and [Bukit Batok](/wiki/Bukit_Batok) were regrouped into the newly created [Jurong GRC](/wiki/Jurong_Group_Representation_Constituency), along with [Yuhua](/wiki/Yuhua,_Singapore) and [Taman Jurong](/wiki/Taman_Jurong). As such, the entire political system of Jurong was changed with 3 [GRCs](/wiki/Group_Representation_Constituency) as a result. 10 years later, in 2011, [Gek Poh](/wiki/Gek_Poh_Ville), [Yuhua](/wiki/Yuhua,_Singapore) and [Pioneer](/wiki/Pioneer,_Singapore) were crafted out from each of the three [GRCs](/wiki/Group_Representation_Constituency) to become [SMCs](/wiki/Single_Member_Constituency). In total, there are now six constituencies in Jurong. In 2025, there were major changes in the political constituencies of Jurong. Yuhua Constituency was absorbed into Jurong GRC, and renamed to Jurong East-Bukit Batok GRC, and to compensate; Jurong Central SMC was split from Jurong GRC as a result. Gek Poh Ville is no longer under the SMC. Those within the Jurong West all moved to West Coast-Jurong West GRC. There are only four constituencies in Jurong - - Jurong Central SMC - Jurong East-Bukit Batok GRC - Pioneer SMC - West Coast-Jurong West GRC Nonetheless, though divided into six separate constituencies, all the precincts are collectively managed by the [PAP](/wiki/People%27s_Action_Party) and known as Jurong. ## Notes ## Sources - Victor R Savage; Brenda S A Yeoh (2003). *Toponymics – A Study of Singapore Street Names*. Eastern Universities Press. [ISBN](/wiki/ISBN_(identifier)) 981-210-205-1. - National Heritage Board (2002). *Singapore's 100 Historic Places*. Archipelago Press. [ISBN](/wiki/ISBN_(identifier)) 981-4068-23-3. - Southwest CDC Website Archived 18 August 2013 at the [Wayback Machine](/wiki/Wayback_Machine)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:15:17.505981",
  "title": "Jurong",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Jurong"
}