{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:15:27.295146"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Jurong Police Division\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(April 2020)* *(Learn how and when to remove this message)* 1°21′04.22″N 103°42′08.42″E﻿ / ﻿1.3511722°N 103.7023389°E﻿ / 1.3511722; 103.7023389 The **Jurong Police Division** (or **'J' Division**) is one of the seven land divisions of the [Singapore Police Force](/wiki/Singapore_Police_Force). Jurong Division first came into existence as the 'Rural West' Division on 24 September 1965 and operated from a standalone building located at Bukit Panjang. As the communities in the west grew, police posts were built in Ama Keng, Mandai and Kranji. Following Singapore's independence, the western part of Singapore underwent rapid rural, industrial and urban development. From then on, the Rural West Division expanded to meet the challenges of policing a larger population. In 1976, it shifted to the Taman Jurong Police Station at Yung Ho Road. In 1980, the Division shifted to Corporation Road and became known as the Jurong Police Division. On 5 May 2002, Jurong Police Division moved to its current premises at No. 2 Jurong West Ave 5 which became the Division's headquarters. Jurong Division serves a residential population of over 730,000 residents which covers a stretch of land from Boon Lay and Tuas in the west to areas like Bukit Batok, Choa Chu Kang and Bukit Panjang in the northwest. Besides residential estates, it also covers major industrial areas and has a long coastal area lined with over 100 sea-fronting companies. ## History Jurong Division traces its history back to the **Rural West Division**, which manages a large swath of previously uninhabited and agricultural areas. Rapid urbanisation resulted in a reorganisation of divisional boundaries, and the division's headquarters moved to the [Taman Jurong Police Station](/wiki/Singapore_Police_Force#Defunct_Units/Facilities) at Yung Ho Road in 1975. It relocated again in 1980 to Corporation Road, concurrently changing its name to its present-day name, Jurong Police Division. With the implementation of the Neighbourhood Police Centre system in the division in 1999, the headquarters was moved to its present location at 2 Jurong West Avenue 5, Singapore 649482. In November 2018, [Woodlands Police Division](/wiki/Woodlands_Police_Division) was formed, and took over operations of two NPCs from Jurong Police Division (Woodlands East NPC & Woodlands West NPC). ## Establishments - Jurong Division HQ - Bukit Batok Neighbourhood Police Centre - Bukit Batok Neighbourhood Police Post - Hong Kah North Neighbourhood Police Post - Bukit Panjang Neighbourhood Police Centre - Bukit Panjang South Neighbourhood Police Post - Choa Chu Kang Neighbourhood Police Centre - Choa Chu Kang Neighbourhood Police Post - Jurong West Neighbourhood Police Centre - Boon Lay Neighbourhood Police Post - Jurong Neighbourhood Police Post - Nanyang Neighbourhood Police Centre - Nanyang Extended Police Post - Jurong Police Division This Singapore-related article is a stub. You can help Wikipedia by expanding it. - v - t - e This law enforcement agency article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:15:27.294822",
  "title": "Jurong Police Division",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Jurong_Police_Division"
}