{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:15:48.565404"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Jurong West Central\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(December 2025)* *(Learn how and when to remove this message)*Place in Singapore **Jurong West Central** is a subzone of [Jurong West](/wiki/Jurong_West), located in the [West Region of Singapore](/wiki/West_Region,_Singapore). This is the town centre of Jurong West. ## Transport ### Roads There are 4 main roads in this subzone – Boon Lay Way, Jalan Boon Lay, Jurong West Avenue 4/2 and Pioneer Road North. ### Public transport ### Rail #### Mass Rapid Transit The [East West Line](/wiki/East_West_MRT_line) threads through the subzone along Street 63, with 2 stations ([Boon Lay](/wiki/Boon_Lay_MRT_station) and [Pioneer](/wiki/Pioneer_MRT_station)), situated at the Eastern and Western ends of the subzone. By 2027, there will be the [Jurong Region Line](/wiki/Jurong_Region_Line), which would ply through the Eastern end of the subzone. ### Bus The [Boon Lay Bus Interchange](/wiki/Boon_Lay_Bus_Interchange) is situated here, along Central 3, within Jurong Point Shopping Centre and next to Boon Lay MRT Station. ## Healthcare At the junction of Central 1 and Street 64, there is a government healthcare institution named **Jurong Medical Centre**. A polyclinic, Pioneer Family Healthcare Centre near Pioneer MRT station along Street 61 started operations in November 2017 and opened in February 2018. ## Recreation The Frontier Community Club is situated at the junction of Street 64 and Central 3, it is co-located with *Jurong West Public Library*. There are two parks – Jurong Central Park and Jurong West Neighbourhood Park. They can jog along the Jurong West Park Connector. In addition, there is Jurong West Public Library. There is also SAFRA Clubhouse at Jurong, which is situated at the south-eastern fringe of the subzone, near to Boon Lay MRT Station. The Jurong West Sports and Recreation Centre is located at the western fringe of the subzone along Pioneer Road North. ## Commercial There are 2 Shopping malls in this subzone, namely Jurong Point and Pioneer Mall. There are retail spaces at the concourse level of [Pioneer](/wiki/Pioneer_MRT_station) and [Boon Lay](/wiki/Boon_Lay_MRT_station) MRT stations, of which the one at [Boon Lay](/wiki/Boon_Lay_MRT_station) is known as *Boon Lay Xchange*. There is a market and hawker centre located adjacent to Pioneer Mall along Street 61 which opened in 2017. ## Education There are 4 education institutions here, namely - [Jurong West Primary School](/wiki/Jurong_West_Primary_School) - Jurong West Secondary School - Frontier Primary School - [Boon Lay Secondary School](/wiki/Boon_Lay_Secondary_School) At the fringes of the subzone, there are 2 education institutions, namely - West Grove Primary School - [River Valley High School, Singapore](/wiki/River_Valley_High_School,_Singapore) ## Housing There are a total of 188 housing blocks in this subzone, consisting of 176 (6 under construction) Public apartments and 12 blocks of Private Condominium. Most of the flats were built in 1999 – 2000, and earthworks had begun on 18 June 1995. ### Public Apartments #### HDB estates at N6 StreetEstate nameBlocksQuantityNote62/65601–6131361/62/65617–63721The neighbourhood shopping mall, Pioneer Mall (Block 638-638A) is located here.61639–647, 648A-648D, 649A-649B, 650A-650C1861651A-651B, 652A-652C, 653A-653C, 654A-654C, 655A-655B1361/65656A-656D, 657A-657B, 658A-658D1065/64659A-659D, 650A-650D, 661A-661D, 662A-662D1662/64663A-663D, 664A-664D, 665A-665B, 666A-666B1265/64667A-667D, 668A-668D, 669A-669B1265670A, 671A-671C, 672A, 673A-673C, 674A-674B1064Edelweiss@Jurong675A-675B, 676A-676B, 677A-677C, 678A-678D1164/Central 1679A-679C, 680A-680C, 681A-681C, 682A-682C, 683A-683C, 684A-684C, 685A-685C, 686A-686C24Central 1/3Jurong Point Estate687–69610Central 2/3Jurong West Blossom697A-697C, 698A-698C6*Completed in late 2016* The Public Apartments and the associated infrastructure are managed and maintained by **West Coast Town Council**. ### Private Housing StreetEstate nameBlockQuantityNoteCentral 3The Centris65/7/9, 71/3/5/7/9, 81/3/5/712Integrated with Jurong Point and Boon Lay Bus Interchange ## Politics The northern portion is referred to Boon Lay constituency, part of the West Coast-Jurong West GRC. Its MP is [Desmond Lee](/wiki/Desmond_Lee_(Singaporean_politician)). The southern portion is referred to Pioneer constituency. Its MP is [Patrick Tay](/wiki/Patrick_Tay). Both portions are separated by Street 61/2 and Central 1. ## Neighbouring Areas - West Coast Town Council - South West Community Development Council Archived 18 August 2013 at the [Wayback Machine](/wiki/Wayback_Machine)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:15:48.564992",
  "title": "Jurong West Central",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Jurong_West_Central"
}