{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:15:52.739126"
  },
  "content": "Subzone of Bedok Planning Area in East Region, Singapore **Kaki Bukit** is an industrial area located in [Bedok](/wiki/Bedok) in the [East Region](/wiki/East_Region,_Singapore) of Singapore. It is home to many high tech industrial companies and warehouses. There used to be a prison complex called Kaki Bukit Centre, which was converted to a prison school in 2000. It has since moved to [Tanah Merah](/wiki/Tanah_Merah,_Singapore) and the Acacia Welfare Home now stands in its place. On the south of Kaki Bukit is Jalan Tenaga and Jalan Damai neighbourhoods of Bedok Reservoir Road. Redevelopments are in the pipeline for Kaki Bukit beyond 2030 when [Paya Lebar Airbase](/wiki/Paya_Lebar_Airbase), located just north of the estate, relocates to [Changi](/wiki/Changi). Not only would land be freed up for use but building height restrictions, that are currently in place for safety reasons because the estate is directly aligned with the airbase runway, would also be lifted. Kaki Bukit is classified by [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) (URA) as a subzone under the planning area of Bedok, its boundaries differ from the constituency boundaries used by the Singapore Parliament. ## History The history of Kaki Bukit can be traced since the 1960s as an extension of the Jalan Eunos Malay Settlement. The name, Kaki Bukit translates to \"*[Foothill](/wiki/Foothill)*\" from Malay as the area was an upland area. Back then, it was filled with [kampung](/wiki/Kampong) houses and roads bearing Malay names. Most of its residents were resettled from the [Kampong Glam](/wiki/Kampong_Glam) and [Bugis](/wiki/Bugis,_Singapore) regions. By the 1980s, the Jalan Eunos Malay Settlement had been degazetted. The kampung houses were brought down, its residents compensated with newly built HDB flats in present-day [Bedok Reservoir](/wiki/Bedok_Reservoir). Most of the old roads in the area were then removed and new roads running from Bedok Reservoir were built. The hilly incline of Kaki Bukit was also flattened for land reclamation of the East Coast area. ## Amenities There are limited amenities in Kaki Bukit, with Kaki Bukit Amenity Centre and Kaki Bukit Recreation Centre providing several food options. There are more amenities located in the nearby [Bedok Reservoir](/wiki/Bedok_Reservoir) or [Eunos](/wiki/Geylang_East) estates. There are various dormitories located in the area to house foreign workers working nearby. The area falls under the jurisdiction of the [Bedok Police Division](/wiki/Bedok_Police_Division) and the 2nd [Singapore Civil Defence Force](/wiki/Singapore_Civil_Defence_Force) DIV HQ. ### Education There are currently no public government schools in the area, although there used to be several that have since been defunct: - Hwa Ming Chinese School, c.1950 to c.1980, Paya Lebar Air Base now occupies the land it once stood on - Kaki Bukit Primary School/ Kaki Bukit English & Malay School, from 1962 to 1984, the Acacia Welfare Home now stands in its place, its name was changed to Bedok West Primary School during its move, it was then merged into Damai Primary School in 2015 - Kaki Bukit Secondary School, from 1965 to 1984, located formerly beside Jalan Eunos Service Reservoir, its name was changed to Bedok Town Secondary School during its move, it was then merged into Ping Yi Secondary School in 2016 - Kampong Melayu Malay Boys' School, from 1936 to 1979, formerly located north of Madrasah Al-Ridzwan - Kampong Melayu Malay Girls' School, from 1936 to 1979, formerly located north of Madrasah Al-Ridzwan - Madrasah Al-Ridzwan, till c.1985, formerly located north of Jalan Singa - Sin Sheng School, 1937 to c.1972, near where Eunos Mansion stands today ### Transportation #### MRT [Kaki Bukit MRT station](/wiki/Kaki_Bukit_MRT_station), which is part of the [Downtown MRT line](/wiki/Downtown_Line), serves this vicinity. During the construction of the station, a section of Kaki Bukit Avenue 1 was closed from August 2011 to April 2016. Jalan Tenaga and Jalan Damai were widened due to this road closure to cope with traffic redirected towards them. Bus services plying along that stretch of road were also diverted accordingly for that period of time. #### Bus [SBS Transit](/wiki/SBS_Transit) services, 5, 58, 59, 87 and Go-Ahead service 15 ply along Kaki Bukit Avenue 1, the only main road in Kaki Bukit. Bus service 137 is the only service that operates within the industrial part of the estate, but it does not bypass the Kaki Bukit MRT Station, which means commuters cannot make their last mile journey to the industrial estate via this MRT station. #### Road The [Kallang-Paya Lebar Expressway](/wiki/Kallang-Paya_Lebar_Expressway) (KPE) found north-west of Kaki Bukit has one exit (Exit 6) which leads to the estate. North and south bound, entrances and exits for KPE near Kaki Bukit are not adjacent to each other. Exit 9 of the [Pan Island Expressway](/wiki/Pan_Island_Expressway) (PIE) which is found a short distance south of the estate leads towards the estate too. In addition, Bartley Road East that cuts through Kaki Bukit is part of a semi-expressway [Outer Ring Road System](/wiki/Outer_Ring_Road_System) that stretches from [Queenstown](/wiki/Queenstown,_Singapore) to [Tampines](/wiki/Tampines). ## Industries Aside from the high tech industrial companies and warehouses located at the industrial estate. The area is also home to many other industries including the automobile industry that cater to vehicle inspection, learning and maintenance. The Singapore Armed Forces (SAF) Driving School located in Kaki Bukit Camp together with the neighbouring [Comfort Delgro](/wiki/ComfortDelGro) Driving School in [Ubi](/wiki/Ubi,_Singapore) makes [L-plate](/wiki/L-plate) learning drivers a common sight in the area. Waterworks is also another important industry in the area. [Jalan Eunos Service Reservoir](/wiki/Jalan_Eunos_Service_Reservoir) is the main supplier of water in the east of Singapore, it receives its water from the PUB Bedok Waterworks which treats water collected from the nearby [Bedok Reservoir](/wiki/Bedok_Reservoir). This service reservoir then stores and pumps the treated water to various neighbourhoods in the east. ## Incidents - On 19 April 2017, 13 foreigners were arrested by Police for vice related activities at the forested part of Kaki Bukit near Kaki Bukit Avenue 4. Various charges, including those such as willful trespass on state land, offences under the Women’s Charter, suspected consumption of controlled drugs and offences under the Immigration Act, Chapter 133, were considered against those arrested. 1°20′07″N 103°54′33″E﻿ / ﻿1.3354022°N 103.9091185°E﻿ / 1.3354022; 103.9091185\n",
  "language": "en",
  "processed_at": "2026-01-12T11:15:52.738458",
  "title": "Kaki Bukit, Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Kaki_Bukit,_Singapore"
}