{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:15:59.364089"
  },
  "content": "Subzone of Kallang Planning Area in Central Region, Singapore **Kallang Bahru** is a subzone within the planning area of [Kallang](/wiki/Kallang), [Singapore](/wiki/Singapore), as defined by the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) (URA). This subzone is bounded by Bendemeer Road and Sungei Whampoa in the north; the [Kallang River](/wiki/Kallang_River) in the east; [Kallang Road](/wiki/Kallang_Road) and [Sims Avenue](/wiki/Sims_Avenue) in the south; and Lavender Street in the west. \"Kallang Bahru\" is also the name of a two-way road in the area. This road connects the [Pan Island Expressway](/wiki/Pan_Island_Expressway) (PIE) in the northeast with Lavender Street in the southwest, with major junctions located at [Geylang Bahru](/wiki/Geylang_Bahru) and Boon Keng Road. This road is unique as it is one of the few roads in Singapore to have a [name](/wiki/Road_names_in_Singapore) without any generic element. The name of the subzone was derived from this road. The subzone of Kallang Bahru consists mostly of industrial and office developments. Notable places include the Kallang Delivery Base of [Singapore Post](/wiki/Singapore_Post), Aperia Mall and Victoria Wholesale Centre. [Bendemeer MRT station](/wiki/Bendemeer_MRT_station) along the [Downtown Line](/wiki/Downtown_Line) is located within this subzone. ## History The name \"Kallang Bahru\" first appeared in a street directory as a proposed road in 1969. Meaning \"New Kallang\" in the [Malay language](/wiki/Malay_language), the road and its surrounding area were seen as an extension of the [Kallang](/wiki/Kallang) settlement. Prior to the construction of the road, the area was a swampland. - [Kallang](/wiki/Kallang) - [Bendemeer MRT station](/wiki/Bendemeer_MRT_station) - [Geylang Bahru](/wiki/Geylang_Bahru) - [Geylang Bahru MRT station](/wiki/Geylang_Bahru_MRT_station) (construction alias: *[Kallang Bahru](/wiki/Kallang_Bahru_MRT_Station)*) Media related to Kallang Planning Area at Wikimedia Commons This [Singapore](/wiki/Singapore) location article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:15:59.363764",
  "title": "Kallang Bahru",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Kallang_Bahru"
}