{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:16:21.416176"
  },
  "content": "Village in SingaporeVillage in Hougang, Singapore 1°23′0″N 103°52′41″E﻿ / ﻿1.38333°N 103.87806°E﻿ / 1.38333; 103.87806 **Kampong Lorong Buangkok** (alternatively *Kampung Selak Kain*; [Jawi](/wiki/Jawi_alphabet): كامڤوڠ لوروڠ بواڠكوق; [Chinese](/wiki/Simplified_Chinese_characters): 甘榜罗弄万国; [pinyin](/wiki/Pinyin): *Gānbǎng Luónòng Wànguó*) is a village located in [Hougang](/wiki/Hougang), [Singapore](/wiki/Singapore). Built in 1956, it is notable for being the last surviving *[kampong](/wiki/Village#Southeast_Asia)* located on [Singapore Island](/wiki/Singapore_Island) in the 21st century. It is situated right beside a canal that drains into the nearby [Sungei Punggol](/wiki/Sungei_Punggol). ## History The kampong was also known as *Selak Kain* in [Malay](/wiki/Malay_language), which meant 'hitching up one's [sarong](/wiki/Sarong) (skirt)' as people hitch up their sarongs to wade through floods whenever the village experienced [flash floods](/wiki/Flash_flood) in the 20th century Singapore. The land which the kampong rests on, was acquired in 1956 from Mr Huang Yu Tu by Sng Teow Koon, a [traditional Chinese medicine](/wiki/Traditional_Chinese_medicine) seller and [herbalist](/wiki/Herbalist). At the point of purchase, there were already 4 to 6 houses built on the land. He set up home in the village with his family, and started renting out land to people to build homes. The land was handed down to his children. It evolved into a kampong. It was initially a swampy piece of land with only 5-6 homes. By the 1960s, it housed about 40 families. The land area used to be 21,460 m2 but has shrunken in size to 12,248.1 m2. Electricity, running water, and garbage collection are provided by the government. Post is provided by a postman on a motorcycle once a day. ### Residents In the 1960s, most residents of Kampong Lorong Buangkok worked in the nearby [Woodbridge Hospital](/wiki/Woodbridge_Hospital) or factories, while their children studied in nearby schools. A small rental fee of $2–$3 was paid by the residents back then. They also tended to rear their own chickens for food. In the present day, the residents consist of make-up artists, workers, and mostly elderly residents. Currently it houses 25 families (12 [Chinese](/wiki/Chinese_people) and 13 [Malay](/wiki/Malays_(ethnic_group))). Paying an average of $18.25 in rent, they continue to enjoy the slower pace of life that the kampong setting offers. The Muslim residents have the [Surau Al Firdaus](/wiki/Surau_Al_Firdaus), a small prayer house that functions as a mosque. However, it is also used by Muslims from the urban areas outside Kampong Lorong Buangkok as well. ## Floods In the past, the kampong was constantly hit by floods. When heavy rains coincided with high tides, flash floods resulted in low-lying areas. The water level in drains and canals became so high that the water could not be drained off quickly enough, causing floods to occur. In 1970, a canal was built at Gerald Dr in an attempt to minimise or absolve the floods. However, it proved to be insufficient in the face of mighty floods. Currently, the area is still affected by floods, the most recent being in 2006. A $10 million plan to improve the drainage system and to raise the ground level was aborted as it was said to be a cost-ineffective project for just 28 families. ## Media and awareness The kampong served as the main subject of interest in the documentary Selak Kain *The Last Kampong*. The film received national air-time on free-to-air television channel Arts Central. The documentary focused on the residents' struggles to maintain their way of life in the kampong in the 21st century. The documentary juxtaposes modernities and nostalgic kampong life to bring out the dualities of living in a kampong in a cosmopolitan city like Singapore and how both young and old residents adapt to the changes both within, and without. The film was [Ngee Ann Polytechnic](/wiki/Ngee_Ann_Polytechnic)'s entry in the 2006 Project Pilot Showcase and also was Singapore's entry in India's Consortium for Educational Communication's Student Documentary Category. The area was featured in a January 2009 New York Times article headlined \"Singapore prepares to gobble up its last village,\" which covered how the kampong was due to be demolished and redeveloped into two schools (primary and secondary), and also a road linking Buangkok Drive and Yio Chu Kang Road. Even the housing developments where HDB built Blocks 990 - 999 are not spared, and were planned according to the 2008 URA Masterplan. Plans for building of two schools and the road were however dropped with the proposed conservation of the kampong since December 2015, along with the car-lite society and merging of schools taking place since 2015. The kampong has also served as a filming location, such as the 2013 drama *[Beyond](/wiki/Beyond_(2012_TV_series))*, where some scenes in the \"Kampong Minpi\" world in episodes 10 and 11 were filmed, and an episode in 2021 of [Crimewatch](/wiki/Crimewatch_(Singaporean_TV_series)) where it depicted [Kelantan](/wiki/Kelantan). ## Gallery - \"A place and lifestyle trapped in time\". The Straits Times. 1999-01-19. - \"Alert: Flood could hit on March 21 to 23\". The Straits Times. 2004-03-11. p. H1. - \"Floods fail to wash away kampung's charm\". The Straits Times. 2004-03-11. p. H2. - \"No spare S10m? Get out the changkul\". The Straits Times. 2004-03-17. p. H2. - \"Relak! Flood-prone kampung Lorong Buangkok ...\". The Straits Times. 2004-03-23. p. H1, H6, H10. - \"Volunteers help tackle kampung's flood woes\". The Straits Times. 2004-04-19. - \"DPM Wong lauds 'kampung spirit' tack to boost bonding\". The Straits Times. 2004-05-04. - Kor, Kian Beng (2004-03-08). \"We told you so\". The New Paper. - \"Kampung calm\". The New Paper. 2004-03-23. - Sim, Chi Yin (2004-03-23). \"Kampunk weekend\". The New Paper. - \"Peace and quiet: Priceless\". The New Paper. 2007-08-20. - Virtual Reality Tour of Kampong Buangkok - An interview with a resident - Photo Gallery of Kampong Lorong Bahru - Compilation of information on Kampong Lorong Buangkok - Project on KB by NTU final year students - Blog on KB\n",
  "language": "en",
  "processed_at": "2026-01-12T11:16:21.415717",
  "title": "Kampong Lorong Buangkok",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Kampong_Lorong_Buangkok"
}