{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:16:29.463101"
  },
  "content": "Area of central Kuala Lumpur, Malaysia **Kampung Baru** or *Kampong Bharu* (meaning \"New Village\") is a [Malay](/wiki/Malay_people) enclave in central [Kuala Lumpur](/wiki/Kuala_Lumpur), [Malaysia](/wiki/Malaysia). One of the most valuable tracts of land in the capital, it has been estimated to be worth up to US$1.4 billion.[*citation needed*] ## Location Kampung Baru is located in the northern part of Kuala Lumpur's central business district. It is separated from [KLCC](/wiki/Kuala_Lumpur_City_Centre) district by a section of the [Klang River](/wiki/Klang_River). Kampung Baru is bordered by [Jalan Tun Razak](/wiki/Jalan_Tun_Razak) in the north, [Jalan Tuanku Abdul Rahman](/wiki/Jalan_Tuanku_Abdul_Rahman) in the west, Jalan Dewan Sultan Sulaiman in the southwest, and the Klang River and the [Ampang-KL toll road](/wiki/Ampang-Kuala_Lumpur_Elevated_Expressway) (E 12) in the southeast. Clockwise, from north to south, Kampung Baru borders [Titiwangsa](/wiki/Titiwangsa), [Dato' Keramat](/wiki/Dato%27_Keramat), [Ampang Hilir](/wiki/Ampang,_Kuala_Lumpur), [KLCC](/wiki/Kuala_Lumpur_City_Centre), [Medan Tuanku](/wiki/Medan_Tuanku) and [Chow Kit](/wiki/Chow_Kit). ## History Kampung Baru was established in 1899 by a grant from the then-[Sultan of Selangor](/wiki/Sultan_of_Selangor), [Sultan Alaeddin Suleiman Shah](/wiki/Sulaiman_of_Selangor), to allow the [Malays](/wiki/Malay_people) to retain their village lifestyle within the city. It was formally gazetted as the *Malay Agricultural Settlement* in 1950. Since then Kampung Baru has held out against development and modern-city living, turning into a political symbol of Malay culture. The area held a special place for Malay politics during the pro-independence movement that grew up after [World War II](/wiki/World_War_II). Kampung Baru is home to the Sultan Sulaiman Club (3°9′41.35″N 101°42′3.75″E﻿ / ﻿3.1614861°N 101.7010417°E﻿ / 3.1614861; 101.7010417), where anti-colonial political gatherings were often held, including those that led to the formation of the [United Malays National Organisation](/wiki/United_Malays_National_Organisation) (UMNO), Malaysia's ruling party since independence until 2018, and then again since 2021. Documents dating back to the period were unearthed at the grounds of the Club several years ago. Kampung Baru, which sprawls over almost 4 km2, was among the hardest-hit areas during the [May 13 Incident](/wiki/May_13_Incident) in 1969, where bloody racial clashes occurred between ethnic Malays and Chinese. The riots started after Chinese-led opposition parties marched through the village to celebrate their good showing in [general elections of that year](/wiki/Malaysian_general_election,_1969). In recent years, Kampung Baru also played a central role in the *[Reformasi](/wiki/Reformasi_(Malaysia))* protests of 1998, when former deputy premier [Anwar Ibrahim](/wiki/Anwar_Ibrahim) launched protests against then premier [Mahathir Mohamad](/wiki/Mahathir_Mohamad), calling for reforms to government and the judiciary. ## Developments Plans to redevelop Kampung Baru had been around since the 2000s, and intensified in recent years. Negotiations between kampung residents and successive governments have been ongoing since 2018. ## Amenities and notable landmarks ### Healthcare Kampung Baru district is notable for being home to [Kuala Lumpur Hospital](/wiki/Kuala_Lumpur_Hospital) and the [National Heart Institute](/wiki/Institut_Jantung_Negara). ## Night Market Kampung Baru Night Market (Pasar Malam Kampung Baru) in Kuala Lumpur is a must-visit destination. This bustling night market is renowned for its mouthwatering Malay street food, vibrant atmosphere, and a true glimpse into local culture — all set in one of KL’s oldest Malay neighborhoods. ### Other landmarks - **Kelab Sultan Sulaiman** - Galeri Kelab Sultan Sulaiman - [National Library of Malaysia](/wiki/National_Library_of_Malaysia) - [Kampung Baru LRT station](/wiki/Kampung_Baru_LRT_station), on the [Rapid KL](/wiki/Rapid_KL) [Kelana Jaya line](/wiki/Kelana_Jaya_line) - [Raja Uda MRT station](/wiki/Raja_Uda_MRT_station) station, on the [Rapid KL](/wiki/Rapid_KL) [Putrajaya line](/wiki/Putrajaya_line), serving the northern end of Kampung Baru - [NAZA Group](/wiki/Naza_Group_of_Companies) headquarters - Masjid Jamek Kampung Baru - Rumah Limas Kampung Baru - Master Mat's House - Tatt Khalsa Diwan Gurdwara - Jalan Raja Muda Musa - Jalan Raja Alang - Sikh Temple - [Saloma Link](/wiki/Saloma_Link) ## Access [Kampung Baru LRT station](/wiki/Kampung_Baru_LRT_station), served by the [Rapid KL](/wiki/Rapid_KL) [Kelana Jaya line](/wiki/Kelana_Jaya_line), is located in the southern part of Kampung Baru. [Chow Kit Monorail station](/wiki/Chow_Kit_Monorail_station) is located at the western end of Kampung Baru. [Raja Uda MRT station](/wiki/Raja_Uda_MRT_station), served by the [Putrajaya Line](/wiki/Putrajaya_Line), located in the northern part of Kampung Baru. Bus routes running through Kampung Baru include the **220** and **302**. The [Saloma Link](/wiki/Saloma_Link) pedestrian bridge, spanning the Klang River and the Ampang-Kuala Lumpur toll road, is a shortcut from Kampung Baru to the [Petronas Towers](/wiki/Petronas_Towers). ## Notable residents - Tan Sri S.M. Salim - Malaysian singer - [Tan Sri SM Nasimuddin SM Amin](/wiki/Tan_Sri_SM_Nasimuddin_SM_Amin) - [Naza](/wiki/Naza) Group Chairman - Tan Sri Dato' Azman Hashim - [AmBank](/wiki/AmBank) Group Chairman - Dato' Mohamed Azlan Hashim - [Proton](/wiki/PROTON_Holdings) Ex Chairman - Dato' Zainal Abidin Putih - Chairman [CIMB Bank](/wiki/CIMB_Bank) Bhd. - Dato Mat Shah Safuan - businessman - Dato Seri Drs Suleiman Mohamed - former Deputy Minister of Information, politician - Allahyarham M Shariff - Malaysian singer - Sheikh Hassan bin Sheikh Mubarak - businessman, trader - [Kampung Padang Balang](/wiki/Kampung_Padang_Balang) - Planet Ark - Malay Village Clings Onto its City-Centre Address[*permanent dead link*] - New documents suggest Umno has origins in KL, The Star, 14 December 2007. - Kampung Baru plan expected out in April, The Star, 26 January 2008. 3°9′47″N 101°42′22″E﻿ / ﻿3.16306°N 101.70611°E﻿ / 3.16306; 101.70611\n",
  "language": "en",
  "processed_at": "2026-01-12T11:16:29.462678",
  "title": "Kampung Baru, Kuala Lumpur",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Kampung_Baru,_Kuala_Lumpur"
}