{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:16:15.445717"
  },
  "content": "Neighborhood within Rochor Planning Area, Central Region, SingaporeThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Kampong Glam\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(August 2012)* *(Learn how and when to remove this message)*Subzone of Rochor Planning Area **Kampong Glam** ([IPA](/wiki/International_Phonetic_Alphabet): /ˈɡlɑːm/ *GLAHM*; [Malay](/wiki/Malay_language): Kampung Gelam; [Jawi](/wiki/Jawi_alphabet): کامڤوڠ ڬلم ; [Chinese](/wiki/Simplified_Chinese_characters): 甘榜格南; [pinyin](/wiki/Pinyin): *Gānbǎnggénán*; [Tamil](/wiki/Tamil_language): கம்போங் கிளாம்) is a neighbourhood and [ethnic enclave](/wiki/Ethnic_enclave) in Singapore. It is located north of the [Singapore River](/wiki/Singapore_River), in the [planning area](/wiki/Planning_Areas_of_Singapore) of [Rochor](/wiki/Rochor), known as the Malay-Muslim quarter. ## History The name of the area is thought to be derived from a *[Melaleuca](/wiki/Melaleuca)* species tree, called \"[gelam](/wiki/Melaleuca_cajuputi)\" in [Malay](/wiki/Malay_language). \"Kampong\" (modern spelling \"kampung\") simply means \"village\". Prior to colonisation by the [British](/wiki/United_Kingdom_of_Great_Britain_and_Ireland) in 1819, the area was home to the Malay aristocracy of Singapore. It became prominent and more populous after the signing of a [treaty](/wiki/Treaty) between the [British East India Company](/wiki/British_East_India_Company), [Sultan Hussein Shah](/wiki/Sultan_Hussein_Shah) of [Johor](/wiki/Johor) and [Temenggong Abdul Rahman](/wiki/Temenggong_Abdul_Rahman) in 1819. The company was given the right to set up a [trading post](/wiki/Trading_post) in Singapore under this treaty. During the colony's early history, under the [Raffles Plan](/wiki/Raffles_Plan_of_Singapore) of 1822, the settlement was divided according to different [ethnic](/wiki/Ethnic) groups which included European Town, Chinese, Chulia (people from the [Coromandel Coast](/wiki/Coromandel_Coast) of India), [Arab](/wiki/Arab) and Bugis kampongs. Kampong Glam was designated for the Sultan and his household, as well as the [Malay](/wiki/Malay_people) and [Arab](/wiki/Arab) communities, many of whom were [merchants](/wiki/Merchant). It was situated east of what was then the European Town. While the Temenggong and his followers settled in [Telok Blangah](/wiki/Telok_Blangah), Sultan Hussein, his family and followers settled in Kampong Glam. In return, the Sultan was given large areas of land for [residential](/wiki/Residential) use in Kampong Glam under the treaty. The land was allocated to the Malays and other [Muslim](/wiki/Muslim) immigrants to Singapore, including the Malays from [Malacca](/wiki/Malacca), the [Riau](/wiki/Riau) Islands and [Sumatra](/wiki/Sumatra) in Indonesia. It also included the Baweanese, Banjarese, Chinese and Indians. The second half of the nineteenth century saw the rapid growth of immigrant communities in Kampong Glam, initially from Sumatra, and later from other parts of Indonesia and [Malaya](/wiki/Malay_Peninsula). This resulted in the setting up of different kampongs, like Kampong Malacca, Kampong Java and Kampong Bugis. There were also a small but successful Arab community of [traders](/wiki/Merchant) in the area. In the early twentieth century, commercial activities in Kampong Glam expanded as new [shop houses](/wiki/Shop_house) and residential buildings were built. A [multi-ethnic](/wiki/Multi-ethnic) community soon developed there, comprising not only Malays and Arabs but also the Chinese and Indians. Later, due to an expansion of commercial activities and an increase in immigrant settlers in Kampong Glam, the Arabs moved to areas like [Joo Chiat](/wiki/Joo_Chiat), [Tanglin](/wiki/Tanglin) and Bukit Tunggal (the stretch of [Dunearn Road](/wiki/Dunearn_Road) near the [junction](/wiki/Road_junction) of Balmoral Road and Chancery Lane, near [Anglo-Chinese School (Barker Road)](/wiki/Anglo-Chinese_School_(Barker_Road)) today, was called Tunggal Road). By the early 1920s, many Malays also moved out to designated resettlement areas in [Geylang Serai](/wiki/Geylang_Serai) and [Kampong Eunos](/wiki/Eunos,_Singapore). ## Present Today, Kampong Glam still retains strong ties to the Native-Malay and Muslim community and has sometimes been termed the \"Muslim Quarter\" due to its history. The Muslim population still remains a significant presence in Kampong Glam, especially in [Bussorah Street](/wiki/Bussorah_Street). The area remains a centre for Muslim activities and the Sultan Mosque remains a major landmark and congregation point for the Singapore Muslims. Like [Little India](/wiki/Little_India,_Singapore) and [Chinatown](/wiki/Chinatown,_Singapore), Kampong Glam has been [restored](/wiki/Building_restoration), refurbished and new life breathed into it, bringing back the former colour and vibrancy of the area. Rows of conserved shophouses can be found in [Haji Lane](/wiki/Haji_Lane), [Arab Street](/wiki/Arab_Street), [Baghdad Street](/wiki/Baghdad_Street_(Singapore)) and Bussorah Street. Many of these shophouses have new [tenants](/wiki/Leasehold_estate) such as design and [IT](/wiki/Information_technology) firms, [art galleries](/wiki/Art_gallery), [crafts](/wiki/Crafts) and curiosity shops, food caterers, cafes, bars and restaurants. They blend in with traditional businesses like textile and carpet shops, [blacksmiths](/wiki/Blacksmith) and shops selling religious items used by Muslims. It is also an area of good restaurants, from Malaysian coffee shops and bakeries to fine modern European dining. On 16 December 2006, a fire destroyed four [shophouses](/wiki/Shophouse) at Sultan Gate at 2145 ([SST](/wiki/Singapore_Standard_Time)). Two were vacant, one was a [blacksmith](/wiki/Blacksmith) shop and the other a shoe shop. [Firefighters](/wiki/Singapore_Civil_Defense_Force) controlled the fire by surrounding it as it spread through the roof. According to eyewitnesses, the fire started from the second floor of the blacksmith shop. The blacksmith shop is one of the oldest types of shophouses in Singapore which was used for educational tours. It is the last blacksmith shop in the area. On 20 June 2014, the One Kampong Gelam association was established to enliven and establish Kampong Glam as a vibrant cultural district. The association has since initiated changes such as better car parking systems, road closures, and Ramadan celebrations. ## Notable places - [Gedung Kuning](/wiki/Gedung_Kuning) - [Malay Heritage Centre](/wiki/Malay_Heritage_Centre) - [Vintage Camera Museum](/wiki/Vintage_Camera_Museum) ## Politics Beginning from the [1959 general elections](/wiki/1959_Singaporean_general_election), Kampong Glam was a division of its own called [Kampong Glam Single Member Constituency](/wiki/Kampong_Glam_Single_Member_Constituency) (SMC) where the Member of Parliament (MP) seat was held by Former [Deputy Prime Minister](/wiki/Deputy_Prime_Minister_of_Singapore) [S. Rajaratnam](/wiki/Sinnathamby_Rajaratnam) until 1988 when Loh Meng See took over and served until 2006. However, after the [1991 general elections](/wiki/1991_Singaporean_general_election), Kampong Glam SMC along with several neighbouring wards were absorbed into the bigger [Kampong Glam Group Representation Constituency](/wiki/Kampong_Glam_Group_Representation_Constituency) (GRC) which existed for only one term and the ruling party [People's Action Party](/wiki/People%27s_Action_Party) had won the seats on the nomination day itself. Prior to the [1997 general elections](/wiki/1997_Singaporean_general_election), [Kampong Glam GRC](/wiki/Kampong_Glam_GRC) was disbanded and Kampong Glam's electoral division was reverted to [Kampong Glam SMC](/wiki/Kampong_Glam_SMC) with single-member representation that lasted until the [2001 general election](/wiki/2001_Singaporean_general_election) whereby the redrawing of electoral boundaries saw it absorbed into [Jalan Besar GRC](/wiki/Jalan_Besar_Group_Representation_Constituency), which includes parts of the [Downtown Core](/wiki/Downtown_Core). [Denise Phua](/wiki/Denise_Phua) became elected MP for the area. In the [2011 general elections](/wiki/2011_Singaporean_general_election), Jalan Besar GRC was dissolved and became part of the newly created [Moulmein-Kallang GRC](/wiki/Moulmein-Kallang_Group_Representation_Constituency); Phua was also transferred to the new GRC and remained as its MP. In 2015, the short-lived Moulmein-Kallang GRC was abolished with Jalan Besar GRC revived. Phua continued to be the area's MP till present day. - [Haji Lane](/wiki/Haji_Lane) - [Arab Street](/wiki/Arab_Street) - National Heritage Board (2006), *Discover Singapore – Heritage Trails*, [ISBN](/wiki/ISBN_(identifier)) 981-05-6433-3 - G. Byrne Bracken (2004), *A Walking Tour: Singapore*, Times Editions, 2nd ed., [ISBN](/wiki/ISBN_(identifier)) 981-232-630-8 - Visit Kampong Gelam Official Site - Urban Redevelopment Authority – Shophouse styles at Kampong Glam - Frommer's Guide - Kampong Glam at mosque.org.sg - 360 degree virtual tour of Kampong Glam\n",
  "language": "en",
  "processed_at": "2026-01-12T11:16:15.445287",
  "title": "Kampong Glam",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Kampong_Glam"
}