{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:16:25.785961"
  },
  "content": "Subzone of Geylang Planning Area **Kampong Ubi**, also known as **Ubi Estate**, is a subzone located in the [planning area](/wiki/Planning_Areas_of_Singapore) of [Geylang](/wiki/Geylang) in the [Central Region](/wiki/Central_Region,_Singapore) of [Singapore](/wiki/Singapore). It lies within a somewhat [rhombic](/wiki/Rhombus) piece of land bounded by Airport Road at the north, the [Pan-Island Expressway](/wiki/Pan-Island_Expressway) at the south, Eunos Link at the east and Paya Lebar Road at the west. The area was formerly a Malay [village](/wiki/Village). ## Etymology and early history The Malay word *Ubi* refers to the [tapioca](/wiki/Tapioca) plant. Malays used to grow small tapioca farms in the area. Kampong Ubi ([Jawi](/wiki/Jawi_alphabet): كامڤوڠ اوبي) was a rather large village even for its time. The first settlements began at the junction of Jalan Ubi and Changi Road, and quickly expanded northwards to the areas designated as the Kampong Ubi subzone today. All the roads and side-lanes within the kampong were named after vegetables, e.g. Jalan Kobis ([cabbage](/wiki/Cabbage)), Jalan Bayam ([spinach](/wiki/Spinach)), Jalan Tauge ([bean sprouts](/wiki/Bean_sprouts)) as these areas used to have many of these plants. These road names became expunged with the development of the area. Due to housing and industrial developments sometime in the late 80s, villages were resettled to nearby Bedok and Bedok Reservoir. Most of the Jalan Ubi main road was expunged, leaving a short lane in the Eunos area. ## Ubi Estate Today, Ubi Estate is mainly an industrial area with only the south-eastern corner developed for residential use with about 50 blocks of flats built by the [Housing and Development Board](/wiki/Housing_and_Development_Board) (HDB). The industrial estate has a high concentration of automotive related businesses with many major dealerships having their showrooms and workshops there. Other related businesses such as body-and-paint shops also have their workshops there, along with other [small and medium-sized enterprises](/wiki/Small_and_medium-sized_enterprises). A few factories of multi-national firms stand alongside purpose-built flatted-factories of the [Jurong Town Corporation](/wiki/Jurong_Town_Corporation) and other private developers. Currently, two schools are located in Ubi. They are [Manjusri Secondary School](/wiki/Manjusri_Secondary_School) and Maha Bodhi School. Two estates are currently located in Ubi, namely View@Ubi and Ubi Greenville. By last quarter of 2023, the new [BTO](/wiki/Build_to_order_(HDB)) estate by HDB called Ubi Grove was completed, on a plot of land next to Manjusri Secondary School. There is also a reserved plot of land along Ubi Road 3 for a place of worship. There are Chinese temples located along Arumugam Road and Paya Lebar Road within Kampong Ubi, like Sheng Hong Temple, Hong Hian Keng Temple, Kew Huang Keng Temple, Kim Hong Temple, Cheng Hong Siang Tng, Da Sheng Kong Temple, Sze Hock Keng Temple, Tien Sen Tua Temple and Fung Huo Yuan Temple. There are also two Chinese temples located at Ubi Road 4, Shi Niu Dong Temple and Sze Cheng Keng Temple. Teochew Temple & Funeral Parlour is located at Ubi Road 4. It is managed by [Ngee Ann Kongsi](/wiki/Ngee_Ann_Kongsi), and catered for Teochew community and general public. ## Transportation [Ubi MRT station](/wiki/Ubi_MRT_station) on the [Downtown Line](/wiki/Downtown_Line) serves the residents and industrial workers in the estate. It opened on 21 October 2017. ## Other organizations - [ComfortDelGro Driving Centre](/wiki/ComfortDelGro) - [SPF](/wiki/Singapore_Police_Force) Traffic Police Department Headquarters\n",
  "language": "en",
  "processed_at": "2026-01-12T11:16:25.785599",
  "title": "Kampong Ubi",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Kampong_Ubi"
}