{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:16:41.529522"
  },
  "content": "British historian and academic **Karl Anthony Hack** is a British historian and academic, who specialises in the history of [Southeast Asia](/wiki/Southeast_Asia), the [British Empire](/wiki/British_Empire), and of [insurgency](/wiki/Insurgency) and [counter-insurgency](/wiki/Counter-insurgency). Drawing on interviews with insurgents, his work has demonstrated the role of high-level [coercion](/wiki/Coercion) in winning post-war counter-insurgencies, and explored extreme violence and violence limitation. He has also carried out a wide range of public work, ranging across heritage, memory, the media and the courts. He is a professor of history at [The Open University](/wiki/Open_University) where he has also been head of history, and head of the School of History, Religious Studies, Sociology, Social Policy and Criminology . Prior to joining The Open University in 2006, he taught at the [National Institute of Education](/wiki/National_Institute_of_Education), at Singapore's [Nanyang Technological University](/wiki/Nanyang_Technological_University), from 1995 to 2006. ## Early life and education Karl Hack was born in 1966 at [RAF Hospital Changi](/wiki/Changi_Hospital), [Singapore](/wiki/Singapore). He was educated at [Hardye's School](/wiki/Thomas_Hardye_School) in [Dorchester](/wiki/Dorchester,_Dorset), [Dorset](/wiki/Dorset), starting when it was a state grammar and finishing after it had become a comprehensive school. He took the first year of the [Philosophy, Politics and Economics](/wiki/Philosophy,_Politics_and_Economics) [bachelor's degree](/wiki/Bachelor%27s_degree) course at [Keble College, Oxford](/wiki/Keble_College,_Oxford), before transferring to read [History](/wiki/History). He then undertook postgraduate research, initially at [Keble College, Oxford](/wiki/Keble_College,_Oxford), moving to [St Hugh's College, Oxford](/wiki/St_Hugh%27s_College,_Oxford) on the award of a Gateway Scholarship. He completed his [Doctor of Philosophy](/wiki/Doctor_of_Philosophy) (DPhil) degree in 1995. ## Academic career From 1995 to 2006, he was an assistant and then an associate professor of history at the [Nanyang Technological University](/wiki/Nanyang_Technological_University) (NTU), in [Singapore](/wiki/Singapore), teaching a range of [Southeast Asian history](/wiki/History_of_Southeast_Asia). As part of NTU's [National Institute of Education](/wiki/National_Institute_of_Education) he visited Singapore secondary schools and [junior colleges](/wiki/Junior_college_(Singapore)), and provided services and advice to the [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)), [Singapore Tourism Board](/wiki/Singapore_Tourism_Board), and [Ministry of Foreign Affairs](/wiki/Ministry_of_Foreign_Affairs_(Singapore)). He also experimented with early versions of the '[flipped classroom](/wiki/Flipped_classroom)', moving lectures on subjects such as [Chinatown](/wiki/Chinatown,_Singapore) online in order to increase the quality and range of face to face teaching. He worked particularly closely with NTU colleague Dr Kevin Blackburn. Together they integrated [oral history](/wiki/Oral_history) projects on family and on place into the teaching of [Singapore history](/wiki/History_of_Singapore) and [social studies](/wiki/Social_studies), and collaborated on publications and heritage projects. In 2006, he moved to [The Open University](/wiki/Open_University), where he helped to chair the production of a new module, \"Empire: 1492-1975 (A326)\"., which has been delivered by blended online and traditional methods to several hundred students yearly since 2009. From 2009 to December 2015 he was director of the Ferguson Centre for Asian and African Studies, editing its series of online working papers. He has also served as head of the Open University History Department, and in August 2016 he became inaugural head of the new School of History, Religious Studies, Sociology, Social Policy and Criminology (HRSSC). In 2016 he also chaired production of an entirely online dissertation module, A329 The Making of Welsh History, which trialled new methods of direct authoring of online modules, and of involving students as co-educators in an intensive and continuous online learning community. The dissertations are online here. ## Public engagement Together with Dr Kevin Blackburn of [NTU](/wiki/Nanyang_Technological_University), Dr Hack led the historical consultancy behind the new Singapore heritage site, the [Johore Battery](/wiki/Johore_Battery), which opened in 2002. They also took the lead in organizing the 2005 *Forum with the Wartime Generation at the Singapore History Museum and The Japanese Occupation Conference*, which was open to students and the public at what is now known as the [National Museum of Singapore](/wiki/National_Museum_of_Singapore). He was also the Open University's lead academic on the [BBC](/wiki/BBC) series [*Empire*](/wiki/Empire_(2012_TV_series)) – which was first aired on BBC One from February to May 2012 as well as being issued as a DVD – producing a historical poster, of which more than 63,700 hard copies were distributed. The latter was expanded into the website \"Selling Empire: The Empire Marketing Board\". (*OpenLearn*, The Open University), which has informed public understanding of the [Empire Marketing Board](/wiki/Empire_Marketing_Board) in particular. Other radio and television work has included interviews for [Radio 4](/wiki/BBC_Radio_4)'s *Terror Through Time* series, and appearing on *Crisis in Malaya*, *Black Ops* episode 8, series 2 (2014), talking about the [Malayan Emergency](/wiki/Malayan_Emergency). In 2012 he was expert witness in the [Penang](/wiki/Penang) High Court, testifying on the historically contested and diverse ways and degrees to which people could be defined as ['communist'](/wiki/Communism) in [Malaysia](/wiki/Malaysia) and [Singapore](/wiki/Singapore). He is also involved with the [Imperial War Museum](/wiki/Imperial_War_Museum) in a collaborative studentship, jointly supervising doctoral research on *The Impact of postwar counter-insurgency on the British military*. ## Personal life In 1989, Karl married Vanessa Jones. Together they have two daughters and one son. He is a member of Oxford Hawks Hockey Club and was formerly a member of Ceylon Sports Club, Singapore.[*citation needed*] ## Selected books - *Defence and decolonisation in Southeast Asia : Britain, Malaya and Singapore 1941-1967*. Richmond: Curzon. 2001. [ISBN](/wiki/ISBN_(identifier)) 9780700713035. - *Did Singapore have to fall? Churchill and the impregnable fortress*. London: RoutledgeCurzon. 2004. [ISBN](/wiki/ISBN_(identifier)) 9780415308038. With Kevin Blackburn. - *Colonial armies in Southeast Asia*. New York, NY: Routledge. 2005. [ISBN](/wiki/ISBN_(identifier)) 9780415334136. Edited with Tobias Rettig - *Dialogues with Chin Peng: new light on the Malayan Communist Party. Dialogues and papers originating from a workshop with Chin Peng held at the Centre for the Study of the Chinese Southern Diaspora, Australian National University, Canberra, 22-23 February 1999* (Repr. ed.). Singapore: Singapore University Press. 2004. [ISBN](/wiki/ISBN_(identifier)) 978-9971-69-287-2.Singapore: NUS Press, 2004). Chinese edition in 2006. Edited with C.C. Chin. - *Forgotten captives in Japanese-occupied Asia*. London: Routledge. 2008. [ISBN](/wiki/ISBN_(identifier)) 9780415426350. With Kevin Blackburn. - *Singapore from Temasek to the 21st century : reinventing the global city*. Singapore: NUS Press. 2010. [ISBN](/wiki/ISBN_(identifier)) 978-9971-69-515-6. Edited with Jean-Louis Margolin and Karine Delaye. Also University of Chicago Press. - *Les décolonisations au XXe siècle : la fin des empires européens et japonais*. Paris: A. Colin. 2012. [ISBN](/wiki/ISBN_(identifier)) 978-2-200-24945-8. With Pierre Brocheux et al. - *War memory and the making of modern Malaysia and Singapore*. Singapore: NUS Press. 2012. [ISBN](/wiki/ISBN_(identifier)) 978-9971-69-599-6.With Kevin Blackburn. Also University of Chicago Press. ## Selected online materials - \"Selling Empire: The Empire Marketing Board\". *OpenLearn*. The Open University. - \"Empire poster\". *Open University*. Archived from the original on 19 August 2016. Retrieved 9 August 2016. - Interview on the [Malayan emergency](/wiki/Malayan_emergency) on the series \"The British Way, Terror Through Time\". *BBC Radio 4*. - \"Chinatown as a Microcosm of Singapore\" (PDF). *National Institute of Education, NTU, Singapore*. Archived from the original (PDF) on 5 March 2017. Retrieved 9 August 2016.. Online lecture. - Foreword to John Coast, *Railroad of Death: The Original, Classic Account of the 'River Kwai' Railway*. Myrmidon. 2014. - Preface (covering the [fall of Singapore](/wiki/Battle_of_Singapore)) to William Nash and John Nash, \"The Story of the end of Johore Battery during the Battle for Singapore And The War Experiences of Gunner William Nash, as compiled from records & conversations with his son Malcolm Nash\" (PDF) (Working Paper No. 5). Ferguson Centre, Open University. May 2013. `{{cite journal}}`: Cite journal requires `|journal=` (help) - Preface (covering the Ugandan Bukedi disturbances and imperial policing) to Stewart West, \"Policing, Colonial Life and Decolonisation in Uganda, 1957-1960\" (PDF) (Working Paper No. 3). Ferguson Centre, Open University. February 2012. `{{cite journal}}`: Cite journal requires `|journal=` (help) - Preface (covering [Sierra Leone](/wiki/Sierra_Leone) from colony to independence) to Stewart West, \"The Military, Policing and Decolonisation in Sierra Leone, 1953-1957\" (PDF) (Working Paper No. 4). Ferguson Centre, Open University. May 2013. `{{cite journal}}`: Cite journal requires `|journal=` (help) - Interview with Octavian Manea, \"Setting the Record Straight on Malayan Counterinsurgency Strategy\". *Small Wars Journal*. 11 February 2011. - Hack, Karl (2 December 2009). \"Extracting counterinsurgency lessons: The Malayan Emergency and Afghanistan\". *History on Rusi.org*. Expand. - \"Excerpts of talks by INA and Dalforce veterans\". *YouTube*. from *Forum with the Wartime Generation 2005*, available on Dr Blackburn's YouTube channel. ## Selected articles and chapters - 'Detention, Deportation, and Resettlement: British Counterinsurgency and Malaya's Rural Chinese, 1948–60'. *Journal of Imperial and Commonwealth History*, 43, 5 (2015), pp. 611–640 - 'Everyone lived in fear: Malaya and the British way of counter-insurgency'. *Small Wars & Insurgencies*, 23, 4–5 (2012), pp. 671–699 - 'Framing Singapore's History', in [Nicholas Tarling](/wiki/Nicholas_Tarling), ed., *Studying Singapore's past: C.M. Turnbull and the history of modern Singapore*. Singapore: NUS Press. 2012. [ISBN](/wiki/ISBN_(identifier)) 978-9971-69-646-7. pp. 17–64 - 'The Malayan Emergency as counter-insurgency paradigm'. *Journal of Strategic Studies*, 32, 3 (2009), pp. 383–414 - 'The origins of the Asian Cold War: Malaya 1948'. *Journal of Southeast Asian Studies*, 40, 3 (2009), pp. 471–496 - Karl Hack's web profile at The Open University - The Ferguson Centre for African and Asian Studies, Open University\n",
  "language": "en",
  "processed_at": "2026-01-12T11:16:41.529193",
  "title": "Karl Hack",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Karl_Hack"
}