{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:16:44.955340"
  },
  "content": "Singaporean singer (1941–2014) Biduanita Negara **Kartina Dahari** (12 November 1941 – 30 April 2014) was a Singaporean [Malay](/wiki/Malays_in_Singapore) singer and entertainer who was a fixture on [television](/wiki/Television_in_Singapore) and radio from the 1950s to the 1980s. Dahari, who was nicknamed \"Queen of [Keroncong](/wiki/Keroncong),\" a type of [Malay](/wiki/Music_of_Malaysia) [folk music](/wiki/Folk_music) popular at the time, was best known for her hit single, \"Sayang Di Sayang\" (\"Lover is Loved\"), which was composed by [Zubir Said](/wiki/Zubir_Said). She was the first [Malay language](/wiki/Malay_language) singer to record English language songs, releasing four [EPs](/wiki/EPs), two [LPs](/wiki/LPs) and four [singles](/wiki/Single_(music)) in that language. ## Early life Dahari was born to a family of Malay and [Javanese](/wiki/Javanese_people) origin. In 2009, Dahari was awarded a Golden Award (Perdana Emas), which was presented to her by former [President of Singapore](/wiki/President_of_Singapore) [S. R. Nathan](/wiki/S._R._Nathan). She was also the recipient of the Artistic Excellence Award, which was bestowed on her in 2010 by The Composers and Authors Society of Singapore. Her last public appearance took place at the [Esplanade, Singapore](/wiki/Esplanade,_Singapore) in 2013 when she went on stage to express her appreciation for the support shown by the organizers and her fans, at the close of her tribute concert performed by her peers. In March 2015 Dahari became the first singer/entertainer to be inducted into the Singapore Women's Hall of Fame. ## Death Dahari was diagnosed with ovarian cancer in 2010. She died on 30 April 2014, at the age of 72. Her three children and three grandchildren survive her. - New Straits Times: Tribute for Keroncong Queen Kartina Dahari This article about a Singaporean singer is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:16:44.954683",
  "title": "Kartina Dahari",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Kartina_Dahari"
}