{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:16:47.128891"
  },
  "content": "Collection of unwanted items for a nominal fee A ***karung guni*** (locally /ˌkɑːɹʌŋ ˈɡuːni, -ɒŋ -/, Malay pronunciation: [karɔŋ ɡuni]), also spelled as ***karang guni***, is a type of scrap dealer in [Singapore](/wiki/Singapore) and [Malaysia](/wiki/Malaysia). Its practitioners are a modern form of [rag and bone man](/wiki/Rag_and_bone_man) that visit [residences](/wiki/House) [door-to-door](/wiki/Door-to-door) to acquire unwanted items. ## Etymology *Karung guni* is the [Malay](/wiki/Malay_language) term for a [gunny sack](/wiki/Gunny_sack), that was used in the past to hold newspapers; the word is now used [metonymically](/wiki/Metonym) to refer to the rag and bone men or scrap dealers who, in the past, would haul the heavy sacks on their backs as they walked their rounds to collect items. Nowadays, most *karung guni* will use [hand trucks](/wiki/Hand_truck) to move their items around. ## Business practice *Karung guni* either walk along corridors (if that particular [HDB](/wiki/Housing_and_Development_Board) estate has a [multistorey car park](/wiki/Multistorey_car_park)) or for certain HDB estates where the carpark is right under the HDB blocks, walk through the carpark downstairs honking a horn. Around landed properties, they may drive around in a lorry with a horn attached to it, instead of going door-to-door. They make visits in carts, collecting old newspapers and other unwanted items. These will be resold at specialized markets and eventually [recycled](/wiki/Recycling) or reused. These *karung guni* are distinguished by their use of [horns](/wiki/Vehicle_horn) and hand bells, as well as their shouts that can be heard as they make their rounds in high-density residential areas: *karang guni, poh zhua, gu sa kor, pai leh lio, dian si ki...*[a] (“*Karung guni*, [newspapers](/wiki/Newspapers) and old clothes, spoilt [radios](/wiki/Radio), [televisions](/wiki/Television)”). Depending on the person, a nominal fee is paid for the quantity of newspapers or unwanted items sold. The *karung guni* industry is made highly profitable due to the dense urban nature of [Singapore](/wiki/Singapore), where hundreds of [public housing](/wiki/Public_housing) [apartment](/wiki/Apartment) units are located in one block, with often a dozen blocks in each [housing estate](/wiki/Housing_estate). This gives the karang guni men large access to sources of scrap. There are reported stories of rag-to-riches, *karung guni* men who have become [millionaires](/wiki/Millionaire) just from the karang guni business. Today, however, competition is usually too great due to the over-saturation. In the past, second-hand items in good condition bought by the *karung guni* are usually resold in [flea markets](/wiki/Flea_markets) such at the now defunct [Sungei Road](/wiki/Sungei_Road), though in recent times some have begun listing items additionally on [online auctions](/wiki/Online_auction). Because *karung guni* are motivated by the resale value of these materials on the market, there are also reported cases where some collectors have been selective in what to receive from households, even though they may be still recyclable or reusable. At the beginning of the 21st century, *karung guni* men have been facing [competition](/wiki/Competition) due to [recycling](/wiki/Recycling) initiatives and charities that directly collect from residents material to be recycled. ## Notes - [Culture of Singapore](/wiki/Culture_of_Singapore) Portal: - Singapore\n",
  "language": "en",
  "processed_at": "2026-01-12T11:16:47.128512",
  "title": "Karung guni",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Karung_guni"
}