{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:16:48.754248"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Kate Liu\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(September 2025)* *(Learn how and when to remove this message)*Musical artist **Kate Liu** (born May 23, 1994 in Singapore) is an American classical [pianist](/wiki/Pianist). On October 20, 2015, she won the third prize and the [Polish Radio](/wiki/Polish_Radio) Award for the best performance of [mazurkas](/wiki/Mazurka) in the [17th International Fryderyk Chopin Piano Competition](/wiki/XVII_International_Chopin_Piano_Competition). ## Biography Liu began playing piano at age four. At six, she was admitted to the gifted music program of the Yamaha Music School in Singapore. When she was eight, she moved with her family to the Chicago area, United States. In Chicago, she studied piano with Alan Chow, Micah Yui and Emilio del Rosario in the Academy program for talented young pianists and string players at the [Music Institute of Chicago](/wiki/Music_Institute_of_Chicago). She graduated from [New Trier High School](/wiki/New_Trier_High_School) in 2012 and received her Bachelor of Music degree from the [Curtis Institute of Music](/wiki/Curtis_Institute_of_Music). While studying at Curtis, she was named a 2018-19 Gilmore Rising Star. She is pursuing her graduate degree at the [Juilliard School](/wiki/Juilliard_School), where she studies with Robert McDonald and Yoheved Kaplinsky. Liu has won many top prizes at international piano competitions: - 2010: [New York International Piano Competition](/wiki/New_York_International_Piano_Competition) in New York City, USA – 1st prize - 2010: Thomas & Evon Cooper International Competition in Oberlin, USA – 3rd prize - 2011: [Hilton Head International Piano Competition](/wiki/Hilton_Head_International_Piano_Competition) for Young Artists in Hilton Head, USA - 6th prize - 2012: Eastman Young Artist International Piano Competition in Rochester, USA – 3rd prize - 2014: Montreal International Musical Competition in Montreal, Canada - finalist - 2015: The 3rd Asia-Pacific International Chopin Competition in Daegu, South Korea – 1st prize - 2015: [17th International Fryderyk Chopin Piano Competition](/wiki/XVII_International_Chopin_Piano_Competition) in Warsaw, Poland – 3rd prize (bronze medal) and the special prize by the Polish Radio for the best performance of Mazurkas - 2022: Quarterfinalist, [Sixteenth Van Cliburn International Piano Competition](/wiki/Sixteenth_Van_Cliburn_International_Piano_Competition) - 2024: Semifinalist, Sixteenth [Concours Géza Anda](/wiki/Concours_G%C3%A9za_Anda) in Zürich, Switzerland As a soloist, Liu has performed in many major venues, including the Seoul Arts Center, Tokyo Metropolitan Theatre, Carnegie's Weill Hall, Severance Hall in Cleveland, La Maison Symphonique de Montréal, Warsaw National Philharmonic, Kennedy Center in Washington, D.C., Shanghai Concert Hall, Osaka Symphony Hall, Polish National Radio Symphony Orchestra Hall, the Phillips Collection, and so on. She has collaborated with the Cleveland Orchestra, Warsaw Philharmonic Orchestra, Orchestre Symphonique de Montréal, Polish Radio Orchestra, Poznan Philharmonic, Yomiuri Nippon Symphony Orchestra, Daegu Symphony Orchestra, Rochester Philharmonic, Hilton Head Symphony Orchestra, and Evanston Symphony Orchestra. ## Reception from the Polish public During the Chopin competition, Liu had wide popular support from the Polish public. She received the highest number of votes cast by listeners of the Second Program of the Polish Radio, and won the contest \"My Chopin.\" In the opinion of Program listeners, she was the best pianist of the competition. Her average score from the 17 competition judges placed her third overall, but she received the highest score three times. - Official website of Kate Liu Portals: - Classical music - Music - Singapore - United States - Biography This article on a classical pianist is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:16:48.753835",
  "title": "Kate Liu",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Kate_Liu"
}