{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:16:51.145948"
  },
  "content": "Neighbourhood in Central Region, SingaporeThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Katong\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(April 2023)* *(Learn how and when to remove this message)*Subzone of Marine Parade Planning Area in Singapore **Katong**[a] (commonly referred to as **Tanjong Katong**) is a [residential neighbourhood](/wiki/Residential_neighbourhood) in the eastern portion of the [Central Region of Singapore](/wiki/Central_Region,_Singapore), within the [Marine Parade](/wiki/Marine_Parade) planning area. The Katong district stretches from Fort Road area to the [Joo Chiat area](/wiki/Joo_Chiat_Road). It used to be located by the [sea](/wiki/Singapore_Strait), before [land reclamation](/wiki/Land_reclamation_in_Singapore) towards the south to [East Coast Park](/wiki/East_Coast_Park) was created for housing and recreational purposes beginning in the 1960s to 1970s. Katong was the location of many villas and mansions of the wealthy elite in the late 19th to the mid-20th centuries. They made their fortunes in the Far East and built seaside resorts, villas and manors along the beachfront of Katong, beginning from [Katong Park](/wiki/Katong_Park) to the end of the East Coast. Katong's rich cultural mix has contributed to its unique cuisine. Katong is well known among locals as a food district with a variety of shophouse restaurants serving [Peranakan](/wiki/Peranakan) cuisine and particularly, a spicy Singaporean noodle soup known as [Katong laksa](/wiki/Katong_laksa). Its famous icons include Joo Chiat Road's \"food street\", Dunman food center, Koon Seng Road & Everitt Road's Peranakan conservation house, Eurasian Heritage Gallery.[*citation needed*] ## Etymology *Tanjong Katong* derived from the popular beach shoreline along the [East Coast](/wiki/East_Coast_Park). In [Malay](/wiki/Malay_language), *Tanjong* means [cape](/wiki/Cape_(geography)) whilst *Katong* refers to a now extinct species of [turtles](/wiki/Turtle) as well as \"the effect of a [sea mirage](/wiki/Mirage)\" when looking at the shoreline. This coastal feature was located near the present Tanjong Katong Flyover across [East Coast Parkway](/wiki/East_Coast_Parkway) and has since disappeared due to land reclamation.[*citation needed*] ## History In 1822, [Sir Stamford Raffles](/wiki/Sir_Stamford_Raffles) designated a plot of land between the tip of [Sandy Point](/wiki/Tanjong_Rhu) (present day Tanjong Rhu) and Deep Water Point (present day Tanjong Katong) as a [shipyard](/wiki/Shipyard). In order to expedite the growth of the shipping industry, the Chinese settlers living there were given compensation for moving out. By the 1860s, the ship yards were flourishing. In the 1820s, many wealthy Chinese, English, Portuguese, Jewish, and Anglo-French settlers bought parcels of land in Katong beside the sea to cultivate plantations, such as the Confederate Estate, Grove Estate and Perseverance Estate, and built business empires from trading in commodities such as [cotton](/wiki/Cotton), [coconut](/wiki/Coconut) and [gambier](/wiki/Uncaria). One of them is the Wee family where Thiam Siew Avenue is named after them. Many of these plantations were found beside Grove Road (now Mountbatten Road). Other notable plantation owners included Chew Joo Chiat, [Francis James Bernard](/wiki/Francis_James_Bernard), [Jose d’Almeida](/wiki/Jos%C3%A9_d%27Almeida), [Thomas Dunman](/wiki/Thomas_Dunman) and [Hoo Ah Kay](/wiki/Hoo_Ah_Kay). In the 1900s, the city centre was overcrowded and residents started moving to the east. Due to the need of more residential lands, the plantations began to break up. Catholic churches and schools were built in the area which attracted a significant Eurasian presence and [Peranakan](/wiki/Peranakan_Chinese) families. As more people moved into area around Joo Chiat, especially along East Coast Road, there was a big demand for housing, Chew divided his plantation into building lots and sold them to developers to build houses. The area developed from a weekend seaside retreat into a home for the wealthy, who built immense colonial seaside bungalows away from the hustle and bustle of town life. The wealthy suburb stretched along Meyer Road and Mountbatten Road from [Katong Park](/wiki/Katong_Park) to Tanjong Katong. By 1928 Katong had grown to the extent that the Inspector-General of the [Singapore Police](/wiki/Singapore_Police_Force) Force H. Fairburn remarked: \"The development of the area from Katong to [Joo Chiat](/wiki/Joo_Chiat_Road), which has been so rapid in the past two years, promises to continue, and from every point of view one sees the necessity of providing for a sub-divisional station in the suburb. The suburb at present possess no police station.\" During the [Japanese Occupation of Singapore](/wiki/Japanese_occupation_of_Singapore) (1942-1945), [shophouses](/wiki/Shophouse) between Wilkinson Road and Goodman Road in Tanjong Katong Road were used to house [comfort women](/wiki/Comfort_women) from [Indonesia](/wiki/Dutch_East_Indies) and [Korea](/wiki/Korea_under_Japanese_rule). The east coast reclamation started in 1966 and lasted for two decades until 1985. Its reclamation changed the physical landscape of the area with the modification of the coastline, landscape and even the removal of Katong jetty. Coupled with new high rise housing estate in East Coast, Katong slowly lost its distinct identity amid this de-territorialisation process. The late 1970s and early 1980s also saw more road changes where adjacent streets were linked up to ease commute. In the early 2000s, due to the economic downturn, prices and rentals of shop houses went down leading to many karaoke lounges, massage parlours and pubs in Joo Chiat. Existing hotels started to offer rooms by the hour which helped promoted vice related activities. In 2005, it had 44 pubs, 38 massage parlours and eight hotels which led to Joo Chiat gaining a reputation as a red-light district. By 2010, due to efforts by local residents and policy changes, Joo Chiat had only 26 pubs, three massage parlours and six hotels in 2010. The present Katong area stretches from Mountbatten Road, East Coast Road to Joo Chiat. ### Kampong Amber In the early twentieth century, [Kampong](/wiki/Kampong) Amber, a Malay fishing village between East Coast Road and Amber Road, was a prominent landmark in the coastal area of Katong. The village was named after the adjacent Amber Road, which was in turn named after the clan name of [Joseph Aaron Elias](/wiki/Joseph_Aaron_Elias), a prominent property owner in early-20th-century Singapore. The inhabitants of Kampong Amber were mostly Malay fishermen, who lived in thatched timber houses on stilts, irregularly clustered into a porous urban fabric. Between these houses were many large communal spaces, where the inhabitants spent much of their time, engaging in activities such as plucking beansprout, pounding chili paste, and talking to their neighbors. Since the [salty soil](/wiki/Soil_salinity) was unfriendly to agriculture, the villagers largely depended on the ocean for their livelihoods. Just across Amber Road were the beachfront bungalows of wealthy [Peranakan](/wiki/Peranakan) businessmen, notably [Lee Choon Guan](/wiki/Lee_Choon_Guan) and his wife, who owned the land which Kampong Amber sits on. Mr and Mrs Lee allowed the villagers to live in Kampong Amber rent-free; as a show of appreciation, the villagers held an annual parade on Mrs Lee's birthday. After [World War II](/wiki/World_War_II), Katong became an active retail and entertainment hub in the 1950s and 1960s, with popular supermarket Tay Buan Guan, Red House Katong Bakery and food specialties such as Katong Laksa. As part of the 1971 Concept Plan, land reclamation along the East Coast was carried out between 1963 and 1985. This reclaimed land transformed the swampy coastline with its foul smells into a scenic vista of white sandy beaches, and made it a desirable location for high-end residential developments; at the same time, the reclaimed land and increased motor vehicle traffic on the road combined to separate the villagers of Kampong Amber from the ocean on which they depended. As Singapore continued to [industrialise](/wiki/Industrialisation) through the 1970s, Kampong Amber was among the kampongs destroyed to make room for economic developments: first four- to eight-storey residential buildings, then high-rise flats. The occupants were relocated to newly-built, government-subsidised flats. In a 2003 master plan, the land was parcelled out for further development. A few remnants of earlier Kampong Amber survived the process of industrialization. The iconic car porch of the Butterfly House, a beachfront bungalow built in 1912 by Regent A. J. Bidwell, was incorporated into a new 18-storey condo. Another surviving early Kampong Amber landmark is the Chinese Swimming Club, founded in 1909 and moved to a permanent site at Amber Road in 1921. Originally a Chinese response to the European-only Singapore Swimming-club founded by the British in 1994, the Chinese Swimming Club was sponsored by wealthy philanthropist Lee Choon Guan. The club went on to become a social gathering place, a training location for many world-class athletes, and a prominent local landmark that drew visits from figures including [Prime Minister](/wiki/Prime_Minister_of_Singapore) [Lee Kuan Yew](/wiki/Lee_Kuan_Yew), [President](/wiki/President_of_Singapore) [Wee Kim Wee](/wiki/Wee_Kim_Wee), and President [Tony Tan Keng Yam](/wiki/Tony_Tan_Keng_Yam). Today, the club extends membership to non-Chinese residents. Katong Apartments was built in 1996 and located at Mangis Road in District 15. After [World War II](/wiki/World_War_II), East Coast Road became an active retail and entertainment hub in the 1950s and 1960s, with popular supermarket Tay Buan Guan, Red House Katong Bakery and food specialties such as Katong Laksa. In 2011, Joo Chiat was awarded [National Heritage Board](/wiki/National_Heritage_Board_(Singapore))'s inaugural Heritage Town Award and $100,000 as funding to develop heritage activities for the year. ## Transportation An electric tramway was built between the Joo Chiat-Changi Market and Tanjong Pagar. ## Amenities **Places of worship** - [Church of the Holy Family](/wiki/Church_of_the_Holy_Family,_Singapore) (also known as Holy Family Church and Katong Catholic Church), a [Catholic](/wiki/Catholic) church in the [Archdiocese of Singapore](/wiki/Archdiocese_of_Singapore): It was founded in early 1902 by four Eurasian families living in [Tanjong Katong](/wiki/Tanjong_Katong). It is located at Chapel Road, off [East Coast Road](/wiki/East_Coast_Road,_Singapore), and has one of the largest parish populations in the archdiocese. - [Masjid Kassim](/wiki/Masjid_Kassim): The mosque was built at Joo Chiat through [waqf](/wiki/Waqf) donations from a Muslim merchant, Ahna Mohammed Kassim. - Katong Presbyterian Church: It was built at Joo Chiat Terrace before moving to Joo Chiat Lane in 1971. - Mangala Vihara, a [Theravada](/wiki/Theravada) [Buddhist temple](/wiki/Buddhist_temple): In 1959, Madam Chew Quee Neo, daughter of Chew Joo Chiat, donated a piece of land to build the temple catering for the Peranakan Buddhist community. **Shopping centres** Katong also has many shopping centers such as Eastgate building, Katong Plaza, [i12 Katong](/wiki/I12_Katong) (formerly Katong Mall and Katong People's Complex), [Katong Shopping Centre](/wiki/Katong_Shopping_Centre), Roxy Square, Paramount Shopping Centre and Odeon Katong Shopping Complex. There are famous eateries which contribute to Katong's popularity as a dining spot such as the Red House Bakery and [Chin Mee Chin Confectionery](/wiki/Chin_Mee_Chin_Confectionery). ## Education ### Secondary schools - [Tanjong Katong Secondary School](/wiki/Tanjong_Katong_Secondary_School) - [Tanjong Katong Girls' School](/wiki/Tanjong_Katong_Girls%27_School) ## Highlights The area is traditionally associated with the [Eurasian](/wiki/Eurasian_Singaporeans) and [Peranakan](/wiki/Peranakan_Chinese) community. However, many high-rise apartment blocks now stand alongside the traditional shophouses and Peranakan terrace houses. In 1993, the [Joo Chiat](/wiki/Joo_Chiat) neighbourhood which comprises the historical centre of Katong, with its uniquely Singaporean architecture mixing Chinese, Peranakan and [English colonial](/wiki/Colonial_architecture) styles, was designated a national heritage conservation area by the Singapore Government. The conservation area consists of many shop houses which are refurnished into cafes as well as specialty shops. ## Notable residents It was home to the earlier scions of the Englishmen [Lord Mountbatten of Burma](/wiki/Louis_Mountbatten,_1st_Earl_Mountbatten_of_Burma) and [Cathay Organisation](/wiki/Cathay_Organisation) film magnate, [Loke Wan Tho](/wiki/Loke_Wan_Tho). Its illustrious residents include the ancestral family of [Minister Mentor](/wiki/Minister_Mentor) [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) and [Senior Minister](/wiki/Senior_Minister_of_Singapore) [Goh Chok Tong](/wiki/Goh_Chok_Tong). The former President [Sellapan Ramanathan](/wiki/Sellapan_Ramanathan) lived in Katong in his primary residence on Ceylon Road. It is also home to performance artist [Nicholas Tee](/wiki/Nicholas_Tee). ## Notable places - [25 Chapel Road](/wiki/25_Chapel_Road), conserved building ## Politics The area used to be part of the [Marine Parade Group Representation Constituency](/wiki/Marine_Parade_Group_Representation_Constituency) (GRC) with the Joo Chiat area represented by [Joo Chiat Single Member Constituency](/wiki/Joo_Chiat_Single_Member_Constituency) (SMC). Prior to the [2015 general election](/wiki/2015_Singaporean_general_election), Joo Chiat SMC was merged into Marine Parade GRC. Prior to the [2025 general election](/wiki/2025_Singaporean_general_election), Marine Parade GRC was abolished and Katong is represented by [Marine Parade–Braddell Heights GRC](/wiki/Marine_Parade%E2%80%93Braddell_Heights_Group_Representation_Constituency). In the 2025 general elections, the governing [People's Action Party](/wiki/People%27s_Action_Party) (PAP) won the contest with a walkover with [Goh Pei Ming](/wiki/Goh_Pei_Ming), [Muhammad Faishal Ibrahim](/wiki/Muhammad_Faishal_Ibrahim), [Diana Pang](/wiki/Diana_Pang_(Singaporean_politician)), [Seah Kian Peng](/wiki/Seah_Kian_Peng) and [Tin Pei Ling](/wiki/Tin_Pei_Ling) being the elected Members of Parliament of the GRC. ## In popular culture - *Katong Miss Oh*, a sitcom that aired on [MediaCorp Channel 8](/wiki/Channel_8_(Singaporean_TV_channel)) in 2002. - Tanjong Katong is mentioned in a song \"*Nak Dara Rindu*\" by actor, filmmaker, musician, and composer [P. Ramlee](/wiki/P._Ramlee) - Tanjong Katong is mentioned in the Singaporean folk song \"Di Tanjong Katong\" - Singapore portal - [Joo Chiat Road](/wiki/Joo_Chiat_Road) - [Katong laksa](/wiki/Katong_laksa) ## Notes - Victor R Savage, Brenda S A Yeoh (2003), *Toponymics – A Study of Singapore Street Names*, Eastern Universities Press, [ISBN](/wiki/ISBN_(identifier)) 981-210-205-1 - The Singapore House 1819–1942 by Lee Kip Lin (pg 119) - Yuen, Belinda (June 2005). \"Searching for place identity in Singapore\". *Habitat International*. **29** (2): 197–214. [doi](/wiki/Doi_(identifier)):10.1016/j.habitatint.2003.07.002.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:16:51.145588",
  "title": "Katong",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Katong"
}