{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:17:00.931016"
  },
  "content": "Toast with coconut jam **Kaya toast** is a dish consisting of two slices of [toast](/wiki/Toast_(food)) with [butter](/wiki/Butter) and [kaya](/wiki/Kaya_(jam)) (coconut jam), commonly served alongside [kopi](/wiki/Kopi_(drink)) and [soft-boiled eggs](/wiki/Soft-boiled_eggs). The dish was believed to be created by Hainanese immigrants to the [Straits Settlements](/wiki/Straits_Settlements) in the 19th century while serving on British ships at the [Port of Singapore](/wiki/Port_of_Singapore). The dish is commonly consumed for [breakfast](/wiki/Breakfast) or as a late afternoon snack. It became integrated into coffeeshop culture, being widely available in eating establishments such as [kopi tiams](/wiki/Kopi_tiam), [hawker centres](/wiki/Hawker_centre), [food courts](/wiki/Food_court) and Singaporean café chains such as [Ya Kun Kaya Toast](/wiki/Ya_Kun_Kaya_Toast), [Killiney Kopitiam](/wiki/Killiney_Kopitiam) and [Breadtalk](/wiki/Breadtalk)'s [Toast Box](/wiki/BreadTalk#Toast_Box). ## History It is believed that [Hainanese](/wiki/Hainan_people) immigrants created the kaya toast by adapting what they had previously prepared while serving on British ships docked at ports during the [Straits Settlements](/wiki/Straits_Settlements) period. The kaya spread was considered a replacement for Western fruit jams. The Hainanese eventually settled in Singapore and opened *kopitiams* (coffee shops). Established in 1919 as Kheng Hoe Heng Coffeeshop, Killiney Kopitiam is one of the oldest coffee shops in Singapore specialising in the dish. Kopitiams started becoming a common sight in Singapore after the [Japanese occupation](/wiki/Japanese_occupation_of_Singapore) around 1945, when rental for commercial spaces were affordable. Mostly set up by the Hainanese, these kopitiams specialised in selling coffee, tea, cakes as well as making their own kaya. In the past, traditional snack shops could only be found in a few locations such as [Chinatown](/wiki/Chinatown,_Singapore) and [Balestier Road](/wiki/Balestier_Road). However, Singapore started actively promoting its [street food](/wiki/Street_food) or [hawker](/wiki/Hawker_centre) fare via the [Singapore Tourism Board](/wiki/Singapore_Tourism_Board) (STB). In 1994, it held a month-long event to advertise traditional foods called the Singaporean Food Festival, which is hosted every year. Particularly in 2004, Kaya toast was featured by the Singapore Tourism Board in its \"Uniquely Singapore Shop & Eat Tours\", serving as the symbol for a local snack. Government efforts of placing coffee carts situated on the streets into hawker centres also significantly assisted the kaya toast business. As of December 2005, the Singapore foodscape houses an estimate of over 70 outlets selling kaya toast, excluding small [coffee-shops](/wiki/Coffeehouse) that are not listed on the internet or does not have a website. Since then, kaya toast has become a regular item in café and can be found at almost every hawker centre. ## Preparation The preparation method and appearance of kaya toast has changed. Sellers use electric grills instead of the traditional [charcoal grills](/wiki/Charcoal_grill). Previously, hawker workers would use homemade bread but have now opted to order bread supplies from factories. While the methods and ingredients have been simplified, one thing that has yet to change drastically is the kaya spread itself. The kaya spreads used in renowned retailers, such as Ya Kun Kaya Toast and Killiney Kopitiam, are still produced from traditional recipes. It is also worth noting that changes in the method, menu, and economy have not necessarily led to a decline in traditional food sellers. Singapore itself does not prevent the rise of micro-entrepreneurs in the department of traditional food. ### Variations One slice of kaya toast is usually accompanied by another with butter, to make a sandwich, alongside coffee and two runny soft-boiled eggs, paired with dark [soy sauce](/wiki/Soy_sauce) and [white pepper](/wiki/White_pepper). In Malaysia, *[roti bakar](/wiki/Roti_bakar)* or [toast](/wiki/Toast_(food)) which is prepared with butter and kaya, is sometimes referred to as \"kaya toast\" in English. ## Nutrition [Macronutrient](/wiki/Macronutrient) Composition Food[Carbohydrate](/wiki/Carbohydrate) (g/100g)[Fat](/wiki/Fat) (g/portion)[Protein](/wiki/Protein) (g/portion)[Total energy](/wiki/Calorie) (kJ/portion)Kaya toast46.017.67.31,623 One portion of kaya toast (108.7 gram) is categorized as a low [Glycemic Index](/wiki/Glycemic_Index) (GI) food with an average score of 49 on the scale. ## Cultural impact Kaya toast is generally associated with the [Singaporean cuisine](/wiki/Singaporean_cuisine), due to the active promotion of the dish by the Singapore Tourism Board. In October 2021, the [Monetary Authority of Singapore](/wiki/Monetary_Authority_of_Singapore) (MAS) unveiled [commemorative coins](/wiki/Commemorative_coins) that features kaya toast as well as other local dishes, as part of its commemoration over the inscription of hawker culture into the [UNESCO Intangible Cultural Heritage Lists](/wiki/UNESCO_Intangible_Cultural_Heritage_Lists) that previous year. In March 2024, kaya toast was listed as Singaporean at number 42 in the '100 Best Rated Breads in the World', by TasteAtlas. - Food portal - Singapore portal - Malaysia portal - [Roti bakar](/wiki/Roti_bakar) - [Ogura toast](/wiki/Ogura_toast) - [Toast sandwich](/wiki/Toast_sandwich) - Lynch. Rene (July 22, 2009). \"Sending out an SOS for the Kaya Toast at Susan Feniger's Street\". *[Los Angeles Times](/wiki/Los_Angeles_Times)*. Retrieved 2 December 2013.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:17:00.930582",
  "title": "Kaya toast",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Kaya_toast"
}