{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:17:10.493775"
  },
  "content": "Singaporean neurosurgeon **Dr. Keith Goh** ([simplified Chinese](/wiki/Simplified_Chinese_characters): 吴有晶; [traditional Chinese](/wiki/Traditional_Chinese_characters): 吳有晶; [pinyin](/wiki/Pinyin): *Wú Yǒu Jīng*) is a [neurosurgeon](/wiki/Neurosurgeon) from [Singapore](/wiki/Singapore). Dr. Goh is known for his operations in separating [conjoined twins](/wiki/Conjoined_twins) with two known successful cases and a failed attempt in separating [Ladan and Laleh Bijani](/wiki/Ladan_and_Laleh_Bijani). ## Education Dr. Goh earned his medical degree from the [National University of Singapore](/wiki/National_University_of_Singapore) (NUS) in 1985. Then he underwent neurosurgical residency in [Hong Kong](/wiki/Hong_Kong) and subspecialty training in [paediatric neurosurgery](/wiki/Paediatric_neurosurgery) in New York. ## Career He is an honorary associate professor of neurosurgery at [Prince of Wales Hospital](/wiki/Prince_of_Wales_Hospital), [Chinese University of Hong Kong](/wiki/Chinese_University_of_Hong_Kong). His bibliography includes 40 original articles, 10 book chapters, and 104 abstracts and lectures on his various research interests such as brain and spinal cord tumours, stroke and neurologic disorders in children. ## Notable surgeries In 2001, Dr. Goh had successfully led a surgical team in separating a set of [conjoined twins](/wiki/Conjoined_twins). It was the first surgery on such separation of conjoined twins in Singapore. In 2003, Dr. Goh was a consultant neurosurgeon at [Raffles Hospital](/wiki/Raffles_Hospital). In the same year, he led an international medical and surgical team and attempted to separate adult conjoined twins, Ladan and Laleh Bijani, who were joined at the head. The operation, carried out in Raffles Hospital, was unsuccessful leading to the deaths of the twins shortly after separation. Shortly after the operation on the Bijani twins, Dr. Goh successfully led a team to separate a pair of conjoined twins, 4-month-old Korean girls who were joined at the base of their spine, on 22 July. The family of the Korean twins had consulted Goh before the Bijani twins and managed to raise funds for the operation shortly after the Bijani twins' operation. As of 2004, Dr. Goh became an associate professor of neurosurgery at the [Chinese University of Hong Kong](/wiki/Chinese_University_of_Hong_Kong). In 2009, he agreed to operate on another pair of conjoined twins, Vani and Veena, in India. The Indian government consented to fund the cost of the separation operation.After further assessment, the operation did not go ahead. This Singaporean biographical article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:17:10.493263",
  "title": "Keith Goh",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Keith_Goh"
}