{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:17:12.583533"
  },
  "content": "Chinese and American actress **Kelsey Wang** (born December 29) is a Chinese-American actress. Wang portrayed the recurring role of Daisy Kwan in the soap opera *[General Hospital](/wiki/General_Hospital)* from 2018 to 2020. Wang was then cast as [Allie Nguyen](/wiki/Allie_Nguyen) in the [CBS](/wiki/CBS) soap opera *[The Young and the Restless](/wiki/The_Young_and_the_Restless)*, appearing in the role from 2022 to 2023. ## Early life Kelsey Wang was born on December 29 in [Beijing](/wiki/Beijing), China. Wang lived in China and Singapore and then moved to the United States when she was seven-years-old and grew up in [Dallas](/wiki/Dallas), Texas. For her high school education, Wang went to the [Culver Academies](/wiki/Culver_Academies) boarding school in [Indiana](/wiki/Indiana); Wang had applied for a scholarship for the boarding school independently after seeing an advert for it and was successful, which helped her find her passion for theatre. Wang performed well in academic tests and was placed in an [honors](/wiki/Honors_student#United_States) program. Wang also attended the [Yale School of Drama](/wiki/Yale_School_of_Drama)'s summer conservatory program when she was in high school. Wang wanted to go to [New York University Tisch School of the Arts](/wiki/New_York_University_Tisch_School_of_the_Arts) and applied there along with some other colleges, including [Duke University](/wiki/Duke_University). Wang ultimately decided to go Duke as they were offering her \"a full ride\" whilst Tisch offered no financial benefits. Wang majored in economics and took part in an acting exchange program with USC,[*clarification needed*] where she went to Los Angeles to experience the industry. She found Los Angeles to be \"really lonely\" and decided that the place was not for her before leaving the program. ## Career After graduating from Duke University, Wang moved to [New York City](/wiki/New_York_City) for the opportunities of both an internship and also her first job in investment banking. She explained that whilst she wanted to be an actress, she was unsure if she could make it as a career and her parents wanted her to be successful. Wang received a call-back for *[Madam Secretary](/wiki/Madam_Secretary_(TV_series))* but ultimately was unsuccessful. Wang caught the attention of director Pat McCorkle, who cast Wang in the theatre role of Liuli in *[Chimerica](/wiki/Chimerica_(play))*, which had its US premiere at the [Studio Theatre](/wiki/Studio_Theatre_(Washington,_D.C.)) in Washington, D.C. In 2016, Wang starred as Daiyu in *A Dream of Red Pavilions*, which was performed by the [Pan Asian Repertory Theatre](/wiki/Pan_Asian_Repertory_Theatre) at the Clurman Theater; the play was based on the 18th century Chinese novel *[Dream of the Red Chamber](/wiki/Dream_of_the_Red_Chamber)*. Wang later moved to Los Angeles and worked for a film and TV investment fund, which she really liked. Wang also took a two-year break from acting during this time to establish stability in Los Angeles. Wang also made appearances in the series *[Daredevil](/wiki/Daredevil_(TV_series))* and the dual-language pilot *Journey to the East*. Wang was later cast as Daisy Kwan in the soap opera *[General Hospital](/wiki/General_Hospital)* and made her first appearance in the episode airing on September 26, 2018, in a recurring role. The character briefly departed in early 2019, but made additional appearances that aired in March to April and July of that year. Wang's last appearance as Daisy aired in 2020. After *General Hospital*, Wang took a break from acting due to personal reasons and the [COVID-19 pandemic](/wiki/COVID-19_pandemic). Wang resumed acting in April 2021, when she got through to the final stages of an audition for a lead role in a [Netflix](/wiki/Netflix) series. Wang was really hopeful to get the role and was \"heartbroken\" when they chose another actress. A few months later, Wang got an audition for the contract role of [Allie Nguyen](/wiki/Allie_Nguyen) in the [CBS](/wiki/CBS) soap opera *[The Young and the Restless](/wiki/The_Young_and_the_Restless)*; Wang believed that she had not done well in the self-tape she submitted, but the casting team liked her read and she was successful following further auditions. Wang believed that the team noticed the similarities between Wang and Allie and that it may have contributed to their decision to cast Wang. Her casting was announced in February 2022. Wang revealed that watching the soap when she was younger sparked her interest in acting. Wang had previously portrayed a server on *The Young and the Restless* in 2011; she had played the extra when she went to Los Angeles for a semester when she was in college. The actress made her first appearance as Allie in the episode that aired on March 10, 2022. Wang's final appearance as Allie aired on April 18, 2023. Wang then appeared in an episode of *[Magnum P.I.](/wiki/Magnum_P.I._(2018_TV_series))* in 2024. ## Personal life Wang has volunteered to support the [AAPI community](/wiki/Asian_Pacific_Americans). Wang also enjoys playing poker and took part in a MGM amateur tournament, which was male-dominated. In November 2024, Wang married Max Gordon in [Haleʻiwa, Hawaii](/wiki/Hale%CA%BBiwa,_Hawaii). ## Filmography YearTitleRoleNotesRef.2011*[The Young and the Restless](/wiki/The_Young_and_the_Restless)*Server[Extra](/wiki/Extra_(acting)) (1 episode)2016*[Daredevil](/wiki/Daredevil_(TV_series))*Young woman1 episode2016*Journey to the East*Yi TianPilot episode2018–20*[General Hospital](/wiki/General_Hospital)*Daisy KwanRecurring role2022–23*The Young and the Restless*[Allie Nguyen](/wiki/Allie_Nguyen)Regular role2024*[Magnum P.I.](/wiki/Magnum_P.I._(2018_TV_series))*Helen Yu1 episode (\"Extracurricular Activities\") - Kelsey Wang at [IMDb](/wiki/IMDb_(identifier))\n",
  "language": "en",
  "processed_at": "2026-01-12T11:17:12.583166",
  "title": "Kelsey Wang",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Kelsey_Wang"
}