{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:17:14.261972"
  },
  "content": "Singaporean film director (born 1974)This biography of a living person **needs additional citations for verification**. Please help by adding reliable sources. Contentious material about living persons that is unsourced or poorly sourced **must be removed immediately** from the article and its talk page, especially if potentially libelous. *Find sources:* \"Kelvin Sng\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(September 2018)* *(Learn how and when to remove this message)* **Kelvin Sng** (born 28 April 1974) is a [Singaporean](/wiki/Singaporean) filmmaker and lyricist, known for directing blockbuster films *[Taxi! Taxi!](/wiki/Taxi!_Taxi!_(2013_film))* (2013), *[The Fortune Handbook](/wiki/The_Fortune_Handbook)* (2017) and *[King of Hawkers](/wiki/King_of_Hawkers)* (2024). ## Education In 2003, Sng left his teaching position as a head of department and took up [Ngee Ann Polytechnic](/wiki/Ngee_Ann_Polytechnic)'s (NP) Advanced Diploma in Film Production (Directing) programme with the Media Education Scheme Award from the [Media Development Authority](/wiki/Media_Development_Authority) (MDA) of Singapore. ## Career Sng while teaching, produced two short films, *While Waiting* in 2001 and *Timeless* in 2002. In 2005, he produced another short film, *More Than Words*, a tribute to the Asian songstress [Teresa Teng](/wiki/Teresa_Teng). The film was invited to be screened and compete at international film festivals around the world including France, Italy, Canada, Germany, United Kingdom, Romania and Africa. In 2006, Sng was awarded the Script Development Grant by the [Singapore Film Commission](/wiki/Media_Development_Authority) to develop *More Than Words* into a feature film screenplay. That same year, his thesis film *Kichiro* premiered at the [Beijing Film Academy](/wiki/Beijing_Film_Academy) at the 5th International Student Film and Video Festival to a crowd of more than 1000. The short film was also featured in the Singapore Short Film Festival in 2008. In 2010, Sng wrote, produced and directed [*The Gang*](/wiki/The_Gang_(film)), a 32-minute mini feature, which was developed into a full-length feature film. *The Gang* premiered at [The Grand Cathay](/wiki/Cathay_Organisation) to positive reviews and had a one-month run at Sinema Old School. It was also screened at various film festivals including *Sinema Showoff! The Fortune Cookie Collection* where it was the curator's pick, as well as the 4th La Cabina International Medium Length Film Festival of Valencia in Spain, where it was one of the official selections together with 14 other films out of a few hundred entries around the world. Since 2008, Sng has been the managing director of Kelvin Sng Productions Pte Ltd, which focuses on production, education and corporate in film and theatre. Sng produced [Chai Yee Wei](/wiki/Chai_Yee_Wei)'s award-winning short film *My Blue Heaven*, which was screened internationally in several film festivals, as well as the acclaimed short film *The Buddy*, which was part of a series of short films known as 15 Shorts created by veteran film producer [Daniel Yun](/wiki/Daniel_Yun). As executive producer, Sng has produced *The Forgotten*, a mid-length film produced by Eusoff Works, the film production arm of Eusoff Hall at the [National University of Singapore](/wiki/National_University_of_Singapore) (NUS) and *Steadfast*, another mid-length action film with an international cast directed by newcomers David Liu and Linus Chen. The letter received \"Honourable Mention\" at the Los Angeles Movie Awards 2010. In addition, Sng has worked with various organisations and institutions such as Blackmagic Design Asia, [Singapore Media Academy](/wiki/Singapore_Media_Academy), the Substation, [Canon Singapore](/wiki/Canon_Inc.) and the [British Council](/wiki/British_Council) to support and promote filmmaking in Singapore. He has also curated film screenings for several organisations including Toronto-Singapore Film Festival to help promote local films abroad. Sng's body of works also include television commercials, music videos and the 45-minute mini feature *Fairytales*. *Fairytales* premiered at the 24th [Singapore International Film Festival](/wiki/Singapore_International_Film_Festival) as a double bill with *The Gang* at Shaw Lido, and was commercially released on DVD by Innoform Media. Sng's debut feature film [*Taxi! Taxi!*](/wiki/Taxi!_Taxi!_(2013_film)) starred comedians [Mark Lee](/wiki/Mark_Lee_(Singaporean_actor)) and [Gurmit Singh](/wiki/Gurmit_Singh) and was inspired by the local best seller *[Diary of a Taxi Driver](/wiki/Taxi!_Taxi!_(2013_film))*, was released theatrically in both Singapore and Malaysia in January 2013. It was the second highest grossing local film after Jack Neo's *[Ah Boys to Men 2](/wiki/Ah_Boys_to_Men_2)* for that year. The film was also the first official entry from Singapore at the [ASEAN](/wiki/ASEAN) International Film Festival and Awards 2013 held in [Sarawak](/wiki/Sarawak), where it also won the Special Jury Award. In 2016, Sng directed his second feature film, *[The Fortune Handbook](/wiki/The_Fortune_Handbook)*, starring [Christopher Lee](/wiki/Christopher_Lee_(Malaysian_actor)), [Mark Lee](/wiki/Mark_Lee_(Singaporean_actor)) and [Li Nanxing](/wiki/Li_Nanxing). The [Chinese New Year](/wiki/Chinese_New_Year)-themed [comedy film](/wiki/Comedy_film) was theatrically released in Singapore and Malaysia on 26 January and 2 February 2017 respectively. Both *Taxi! Taxi!* and *The Fortune Handbook* crossed the million dollar mark at box offices in Singapore and Malaysia, earning Sng the title of million dollar director (百万导演) by the media. In 2018, Sng was invited to be one of the three mentors for 华谊 Icon Search 新星盛典 2018 by [Huayi Brothers](/wiki/Huayi_Brothers) for the Singapore stop. Apart from filmmaking and education, Sng is also a lyricist. He has written lyrics for the theme songs of both his feature films *Taxi! Taxi!* and *The Fortune Handbook*, as well as for other singers and [Mediacorp](/wiki/Mediacorp) drama series. Sng's third feature film *[Don't Go Home Tonight](/wiki/Don%27t_Go_Home_Tonight)* (今夜不回家) was released in July 2023. He followed up swiftly with *[King of Hawkers](/wiki/King_of_Hawkers)* (小贩之王) the following year, which was released concurrently in Singapore and Malaysia on 22 February 2024. ## Selected filmography ### As director - *While Waiting* (2001) - short film - *Timeless* (2002) - short film - *Indefinitely Daphne* (2004) - *Mothers and Sons* (2004) - *More Than Words* (千言万语; 2005) - *Cafe* (2005) - *Bad Times* (2005) - *Kichiro* (2006) - *The Gang* (私会党; 2010) - *Fairytales* (童话; 2011) - *[Taxi! Taxi!](/wiki/Taxi!_Taxi!_(2013_film))* (德士当家; 2013) - *BFF* (有情常在; 2016) - *Kichiro* - \"Redux\" (2016) - *[The Fortune Handbook](/wiki/The_Fortune_Handbook)* (财神爷; 2017) - *Unbroken* (不倒翁; 2017) - *7* (柒; 2021) - *[Don't Go Home Tonight](/wiki/Don%27t_Go_Home_Tonight)* (今夜不回家; 2023) - *What is Love* (爱, 是什么？; 2023) - short film - *[King of Hawkers](/wiki/King_of_Hawkers)* (小贩之王; 2024) - Kelvin Sng at [IMDb](/wiki/IMDb_(identifier))\n",
  "language": "en",
  "processed_at": "2026-01-12T11:17:14.261596",
  "title": "Kelvin Sng",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Kelvin_Sng"
}