{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:17:16.584958"
  },
  "content": "Place in East Region, Singapore **Kembangan** (/kəmˈbɑːŋɑːn/ *kəm-BAHNG-ahn*) is a subzone and residential precinct located in the town of [Bedok](/wiki/Bedok) in the [East Region](/wiki/East_Region,_Singapore) of Singapore. It consists largely of private residential areas and a small [public housing](/wiki/Public_housing) estate along Lengkong Tiga. ## Etymology Kembangan means \"expansion\" in [Malay](/wiki/Malay_language). The road Jalan Kembangan was officially named in 1932. ## History Kembangan along with the wider [Geylang](/wiki/Geylang) district was badly hit by the September 1964 race riots and schools in the area had to be closed for an extended period despite other schools in Singapore reopening after the curfew was lifted. Later in the 1980s, the [Malay](/wiki/Malays_(ethnic_group)) villages of Kampong Kembangan and Kampong Pachitan, which used to stand at present day Kembangan estate, were demolished to make way for redevelopments in the area. Kampong Kembangan lies approximately to the east of the present day HDB flats in the estate, while Kampong Pachitan lie west of the flats. Several roads in the area were removed or realigned with the redevelopments that were in tandem with the construction of the MRT Line and station there. ## Amenities Kembangan is served by limited amenities like the Kembangan Plaza, which mainly consists of tuition centres, as well as shophouses around the estate. The social welfare of residents are catered for with facilities like the Kwan-In Welfare Free Clinic and the Moral Home for the Disabled in the area. The estate is served by the Kampong Kembangan Community Club, which also serves the wider Kembangan-Chai Chee constituency in the [Marine Parade Group Representation Constituency](/wiki/Marine_Parade_Group_Representation_Constituency). The Siglap Park Connector which runs to either the [Bedok Reservoir Park](/wiki/Bedok_Reservoir#Bedok_Reservoir_Park) or the [East Coast Park](/wiki/East_Coast_Park) cuts through the area too. There are more amenities located in the nearby [Chai Chee](/wiki/Chai_Chee) and [Eunos](/wiki/Geylang_East) estates. Kembangan has a number of places of worship. Churches include the Bethesda chapel, while temples include the Mangala Vihara Buddhist Temple and Hong San Si Temple. There are three mosques in Kembangan; Masjid Abdul Razak, Masjid Mydin, and [Masjid Kassim](/wiki/Masjid_Kassim). The headquarters of The Buddhist Union is also located in Kembangan. The area falls under the jurisdiction of the Kampong Kembangan Neighbourhood Police Post (NPP), which is part of the [Bedok Police Division](/wiki/Bedok_Police_Division), and the 2nd [Singapore Civil Defence Force](/wiki/Singapore_Civil_Defence_Force) DIV HQ. ## Education There are currently no public government schools in the Kembangan estate. There is only a government funded school, the MINDS Towner Gardens School. It is the first purpose built special education school in Singapore, established since 1985. It has been operating from that location since December 1997. ### Former schools - Chin Hua School, from before 1936 to c.1970, formerly located at 503A Changi Road - Kembangan Integrated Primary School (KIPS), from 1963 to 1987, formerly located at 2 Lengkong Satu the current site of MINDS School - [Madrasah Al-Arabiah Al-Islamiah](/wiki/Madrasah_Al-Arabiah_Al-Islamiah), it formerly stood at where Muhammadiyah Association is today from c.1980s to 2005 and now stands at its present location in Toa Payoh - Madrasah Alsagoff Al-Arabiah, it occupied the defunct KIPS premises from 1989 to 1992 and now stands at its present location in Kampong Glam - Madrasah Irsyad or Madrasatul Irsyad Al Islamiyah from 1979, it is managed by Masjid Mydin and is not to be confused with the current [Madrasah Al-Irsyad Al-Islamiah](/wiki/Madrasah_Al-Irsyad_Al-Islamiah) ## Transportation The estate is served by the [East West MRT line](/wiki/East_West_MRT_line) at the [Kembangan MRT station](/wiki/Kembangan_MRT_station). There are two bus services that serve the estate. They are service 42, which also serves the neighbouring [Opera Estate](/wiki/Siglap), and service 135. There are more bus services to be found along the one directional Sims Avenue East that lies south of the estate, or the further Changi Road which runs in the opposite direction towards the city.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:17:16.584512",
  "title": "Kembangan, Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Kembangan,_Singapore"
}