{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:17:18.679453"
  },
  "content": "Singapore headquarters of the KempeitaiPart of a series on the[History of Singapore](/wiki/History_of_Singapore)[Early history](/wiki/Early_history_of_Singapore) (pre-1819)[Srivijaya](/wiki/Srivijaya)650–1377[Temasek](/wiki/Temasek), [Long Ya Men](/wiki/Long_Ya_Men), [Ban Zu](/wiki/Ban_Zu)c.14th century[Kingdom of Singapura](/wiki/Kingdom_of_Singapura)1299–1398[Majapahit](/wiki/Majapahit)1398–1400[Malacca Sultanate](/wiki/Malacca_Sultanate)1400–1528[Johor Sultanate](/wiki/Johor_Sultanate)1528–1819British colonial era (1819–1942)[Founding](/wiki/Founding_years_of_modern_Singapore)1819–1826[Straits Settlements](/wiki/Singapore_in_the_Straits_Settlements)1826–1867[Crown colony](/wiki/Singapore_in_the_Straits_Settlements#Crown_colony_(1867–1942))1867–1942[Japanese Occupation](/wiki/Japanese_occupation_of_Singapore) (1942–1945)[Fall of Singapore](/wiki/Fall_of_Singapore)1942[Sook Ching](/wiki/Sook_Ching)1942[Double Tenth incident](/wiki/Double_Tenth_incident)1943[Post-war period](/wiki/Colony_of_Singapore) (1945–1962)[First Legislative Council](/wiki/History_of_Singapore#First_Legislative_Council_(1948–1951))1948–1951[Maria Hertogh riots](/wiki/Maria_Hertogh_riots)1950[Second Legislative Council](/wiki/History_of_Singapore#Second_Legislative_Council_(1951–1955))1951–1955[Anti-National Service Riots](/wiki/1954_National_Service_riots)1954[Internal self-government](/wiki/Self-governance_of_Singapore) (1955–1963)[Hock Lee bus riots](/wiki/Hock_Lee_bus_riots)1955[Singapore Glass Factory strikes](/wiki/Singapore_Glass_Factory_strikes)1960[Pulau Senang prison riots](/wiki/Pulau_Senang_prison_riots)1963[Merger with Malaysia](/wiki/History_of_the_State_of_Singapore_(Malaysia)) (1963–1965)[Singaporean referendum](/wiki/1962_Singaporean_integration_referendum)1962[Operation Coldstore](/wiki/Operation_Coldstore)1963[Race riots in Singapore](/wiki/1964_race_riots_in_Singapore)1964[MacDonald House bombing](/wiki/MacDonald_House_bombing)1965[Republic of Singapore](/wiki/History_of_the_Republic_of_Singapore) (1965–present)[ASEAN Declaration](/wiki/ASEAN_Declaration) ([ASEAN](/wiki/Association_of_Southeast_Asian_Nations))1967[1969 race riots of Singapore](/wiki/1969_race_riots_of_Singapore)1969[Laju incident](/wiki/Laju_incident)1974[Operation Spectrum](/wiki/Operation_Spectrum)1987[Asian financial crisis](/wiki/1997_Asian_financial_crisis#Singapore)1997[Embassies attack plot](/wiki/Singapore_embassies_attack_plot)2001[H1N1 pandemic](/wiki/2009_swine_flu_pandemic_in_Asia#Singapore)2009–2010[Bus drivers' strike](/wiki/2012_Singapore_bus_drivers%27_strike)2012[Little India riot](/wiki/2013_Little_India_riot)2013[2018 North Korea–United States Singapore Summit](/wiki/2018_North_Korea%E2%80%93United_States_Singapore_Summit)2018[COVID-19 pandemic](/wiki/COVID-19_pandemic_in_Singapore)2020–2022By topic - [Timeline](/wiki/Timeline_of_Singaporean_history) - [Riots](/wiki/List_of_riots_in_Singapore) - [Military](/wiki/Military_history_of_Singapore) Singapore portal - v - t - e The **Kempeitai East District Branch** was the headquarters of the [Kempeitai](/wiki/Kempeitai), the [military police](/wiki/Military_police) corps of the [Imperial Japanese Army](/wiki/Imperial_Japanese_Army), during the [Japanese occupation of Singapore](/wiki/Japanese_occupation_of_Singapore) from 1942 to 1945. It was located at the old YMCA building, at the present site of Singapore's [YMCA Building](/wiki/YMCA_Building,_Singapore) on [Stamford Road](/wiki/Stamford_Road). Opened in 1911, the distinctive [Art Deco](/wiki/Art_Deco) YMCA building was the site of interrogation and torture of many innocent civilians, including the war heroine [Elizabeth Choy](/wiki/Elizabeth_Choy). After the war, the [Singapore government](/wiki/Government_of_Singapore) erected several memorials with some at the former massacre sites. In 1995, the former site of the old YMCA building was gazetted by the [National Heritage Board](/wiki/National_Heritage_Board_(Singapore)) as one of the eleven [World War II](/wiki/World_War_II) sites of Singapore. ## Kempeitai The Kempeitai was formed as a semi-autonomous unit on 4 January 1881 by order of the [Meiji](/wiki/Meiji_period) Council of State. Its brief covered military discipline, law and order, intelligence and subversion as well as policing thoughts in the civilian population. Their political influence increased when [Hideki Tojo](/wiki/Hideki_Tojo) became the Vice-Minister of War in the 1930s. From 1895 to 1945, the Kempeitai built up a large network of influence in the [Greater East Asia Co-Prosperity Sphere](/wiki/Greater_East_Asia_Co-Prosperity_Sphere), the Japanese-occupied territories in Asia during World War II. All prisoners-of-war (POW) and POW camps came under the control of the Kempeitai, as did [comfort women](/wiki/Comfort_women) and comfort houses. ### Training Kempeitai officers were trained at special training schools, with the main ones being in Tokyo and [Keijō](/wiki/Keij%C5%8D) in [Korea](/wiki/Korea). Officers were trained to conduct espionage, weaponry, [code-breaking](/wiki/Cryptanalysis), running spy networks and other subversive activities in a year-long course. Kempeitai personnel were dressed in the standard Japanese military uniform, but they were distinguished by an armband bearing the Japanese characters for *Kempei* (憲兵). They also wore [khaki](/wiki/Khaki) uniforms with an armband or were simply dressed in civilian clothes. While officers were armed with a [shin guntō](/wiki/Gunt%C5%8D#Shin_guntō_(new_military_sword)) (military sword) and a pistol, non-commissioned officers often carried a [bamboo](/wiki/Bamboo) stick split at the ends to make it pliable and to increase the pain felt by a person who was hit. ### Informers and spies The Kempeitai made use of [informers](/wiki/Informers) and recruited spies from within the community, and encouraged giving information with rewards and privileges in return. Many of the informers had dubious backgrounds: [secret society](/wiki/Secret_society) members, gangsters, prostitutes and those of other races with criminal records, who were obliged to provide information to save themselves from torture or execution. As a result, many innocent people were taken away mysteriously, and an atmosphere of distrust and fear ruled life during the Japanese occupation. ## Old YMCA building In 1909, the colonial government granted the [YMCA](/wiki/YMCA) a 999-year lease for a site at Dhoby Ghaut to be built as their headquarters. The building was completed in 1911 and the YMCA officially relocated to its new premises. In *[Syonan](/wiki/Syonan)* (as Singapore was called during the [Japanese occupation of Singapore](/wiki/Japanese_occupation_of_Singapore)) in 1942, the Kempeitai came under the jurisdiction of the Ministry of War in Tokyo. It was led by Oishi Masayuki [ja], with his headquarters established at the old YMCA building, which also served as the East District Branch after the Kempeitai had all its British YMCA administrators and staff incarcerated at the [Changi Prison](/wiki/Changi_Prison). There were about 200 regular Kempeitai in Singapore but 1,000 auxiliaries were recruited from the army. The Kempeitai jail was in Outram, with branches in Stamford Road, [Chinatown](/wiki/Chinatown,_Singapore), and the Central Police Station. A former residence at [Smith Street](/wiki/Smith_Street,_Singapore) in Chinatown formed the [Kempeitai West District Branch](/wiki/Kempeitai_West_District_Branch). The YMCA building also served as a prison for people suspected of being anti-Japanese. Typically, prisoners were cramped into small cells and forced to be motionless and absolutely silent. Those arrested would be tortured for the purpose of extracting names of anti-Japanese accomplices from them; refusal to offer such names led to further punishment. Should a prisoner surrender under the torment, any person identified by him as a \"subversive force\" would be sentenced to death or imprisonment. ### Interrogation methods The Kempeitai believed that a person suspected of committing a crime had to prove his innocence, but was given no opportunity to do so. Pain and threats to life were standard methods of interrogation used by the Kempeitai to obtain a 'confession'. Called \"treatments\" by the Kempeitai, some that were described by victims and witnesses during the Singapore Chinese Massacre Trial in 1947 were: - Water torture: The victim was tied up and laid flat on the ground. Water was forced through the mouth and nose until the victim's stomach became distended, after which the interrogators would jump on the victim's stomach to force out the water, until the victim lost consciousness. - Beatings: Victims were beaten with metal bars, wooden or [bamboo](/wiki/Bamboo) sticks, whips, wet knotted ropes, belts with buckles or revolver butts. - Burning and electric shocks: 'Live' electric wires, candles, lighted cigarettes, boiling oil or water were applied to sensitive parts of the victim's body. - Breaking fingers: Sticks were placed between the victim's fingers and squeezed, fracturing the bones. - Tearing out fingernails and toenails: Toothpicks were inserted under the nails before they were torn out by pliers. - Eardrum piercing: The sharp ends of pencils were inserted into the victim's ears until they pierced the victim's eardrums. - Body suspension: The victim's body was suspended by the wrists or neck or hung upside down by the legs. Interrogators would then pull the victim's limbs from their sockets. After the \"treatment\" was meted out, those who had 'confessed' to minor crimes were sentenced to imprisonment, while others were summarily executed. After the British surrender on 15 February 1942, the heads of looters were displayed on stakes outside the Kempeitai Headquarters and [Cathay Building](/wiki/Cathay_Building) — used by the Japanese Military Propagation Department – as a deterrent to looting and gruesome reminder of its power. Rudy Mosbergen, a former principal of [Raffles Institution](/wiki/Raffles_Institution_(Secondary)), wrote in a book, *In The Grip of A Crisis* (2007), about his life as a teenager during the Japanese occupation, during which he witnessed the following scene at the Cathay Building: > Being somewhat curious and adventurous, I decided to see one for myself... I could see the bloodied head of a male Chinese on show... After a week's exposure, the heads eventually shrank and turned blue-black... It was truly a disgusting sight. ### *Sook Ching* During the early days of the Japanese occupation, an extensive clean-up operation to purge anti-Japanese elements—including former members of [Dalforce](/wiki/Dalforce), [Force 136](/wiki/Force_136), and supporters of the China Relief Fund—known as *[Sook Ching](/wiki/Sook_Ching)* was undertaken. The massacres were executed under the supervision of the Kempeitai with the *Hojo Kempei* (\"auxiliary military police\") being employed to carry out the actual shooting under orders of a Kempeitai officer. Although the exact figures will never be fully known, it was estimated that a total figure between 25,000 and 50,000 victims were massacred according to the post-war trial testimonies in 1947. [Masanobu Tsuji](/wiki/Masanobu_Tsuji) was identified by Japanese army commanders as the man responsible for the Sook Ching massacre during the Singapore Chinese Massacre Trial in 1947. Tsuji was appointed as the Chief Planning and Operations Officer of the 25th Army, which was led by [Tomoyuki Yamashita](/wiki/Tomoyuki_Yamashita) during the [Malayan Campaign](/wiki/Malayan_Campaign). He had close links with the Imperial Headquarters in Tokyo and enjoyed certain privileges that officers of more senior ranks were not allowed. Overstepping his authority, he had issued orders during the massacre of thousands of Chinese civilians in Singapore and Malaya with Yamashita's knowledge but without his approval. He was also responsible for the slaughter of thousands of American and Filipino prisoners-of-war in the [Philippines](/wiki/Philippines). Tsuji was in [Myanmar](/wiki/Myanmar) at the time of Japan's unconditional surrender to British forces in August 1945 and made his getaway to [Thailand](/wiki/Thailand) disguised as a wandering Buddhist monk. He later spent a short spell in China during the [Chinese Civil War](/wiki/Chinese_Civil_War). He was pursued by the British but they were unable to capture him, as he was sheltered by the United States for political reasons when he resurfaced in Japan in 1947. He was cleared of any war crimes in 1950 and later became one of Japan's most prominent post-war [parliamentarians](/wiki/Diet_of_Japan). In 1961, Tsuji disappeared mysteriously in [Indochina](/wiki/Indochina) and was officially declared dead in 1968. ## Aftermath After the war, the main masterminds who were mainly responsible for the Sook Ching massacre, namely [Tomoyuki Yamashita](/wiki/Tomoyuki_Yamashita) and [Masanobu Tsuji](/wiki/Masanobu_Tsuji) were not on trial. Tsuji escaped and hid himself and Yamashita was on trial in Manila. Only seven officers, who followed orders to massacre and torture civilians and prisoners, were charged for their alleged role in *Sook Ching* in 1947: 1. Oishi Masayuki, commander of the 2nd Field Kempeitai. 2. [Takuma Nishimura](/wiki/Takuma_Nishimura), commander of the Imperial Guards Division. 3. Kawamura Saburo [ja], commander of the Syonan Defence Garrison. 4. Yokota Yoshitaka [ja] 5. Jyo Tomotatsu [ja] 6. Onishi Satoru [ja] 7. Hisamatsu Haruji [ja] Kawamura and Oishi received [death sentences](/wiki/Capital_punishment_in_Singapore); the remaining five were given [life sentences](/wiki/Life_imprisonment_in_Singapore) but served just five years until 1952, when Japan regained its sovereignty. Despite being spared the gallows, Takuma did not evade the death penalty when he was separately tried and executed for the 1942 [Parit Sulong massacre](/wiki/Parit_Sulong_massacre) at Johor. Kawamura Saburo published his reminiscences in 1952 (after his death) and in the book, he expressed his condolences to the victims of Singapore and prayed for the repose of their souls. ### Demolition Following the end of World War II, there were several differing views on what should be done with the Old YMCA Building. The British had wanted it demolished and then to designate the open space as a memorial to the victims who had suffered under the Kempeitai. The building briefly became a Forces Centre for a Salvation Army services welfare Indian team. The YMCA later reclaimed their building and, after fundraising and refurbishment, resumed operations at the building in December 1946. Plans to rebuild the YMCA premises on the site began in 1969. They came to fruition in 1981, when the Old YMCA Building was demolished. [Elizabeth Choy](/wiki/Elizabeth_Choy) expressed her gratitude for the building's destruction, as she had been detained and tortured at the old YMCA building for nearly 200 days for her crime of \"being pro-British and anti-Japanese\" during the *[Double Tenth Incident](/wiki/Double_Tenth_Incident)* inquisition. Her tormentor, a Kempeitai warrant officer named Monai Tadamori, had since been sentenced to death by a military court in 1946 after the war. She said: > After my release, I avoided Stamford Road as I just could not bring myself to look at the YMCA building. It was the Japanese army's other killing field besides *[Operation Clean Up](/wiki/Sook_Ching)*. It bore the blood of their victims whose lives they could never compensate. The new [YMCA Building](/wiki/YMCA_Building,_Singapore) was officially opened on 24 November 1984 on the former site of its old building. ## Memorials To keep alive the memory of the Japanese occupation and its lessons learnt for future generations, the Singapore government erected several memorials with some at the former massacre sites. ### Civilian War Memorial Spearheaded and managed by the [Singapore Chinese Chamber of Commerce and Industry](/wiki/Singapore_Chinese_Chamber_of_Commerce_and_Industry), the [Civilian War Memorial](/wiki/Civilian_War_Memorial) is located in the War Memorial Park at [Beach Road](/wiki/Beach_Road,_Singapore). Comprising four white concrete columns, this 61 metres tall memorial commemorates the civilian dead of all races. It was built after thousands of remains were discovered all over Singapore during the urban redevelopment boom in the early 1960s. The memorial was officially unveiled by Singapore's first prime minister [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) on the 25th anniversary of the start of the Japanese occupation in 1967. It was constructed with part of the S$50 million 'blood debt' compensation paid by the Japanese government in October 1966. Speaking at the unveiling ceremony, Lee said: > We meet to remember the men and women who were the hapless victims of one of the fires of history... If today we remember these lessons of the past, we strengthen our resolve and determination to make our future more secure then these men and women for whom we mourn would not have [died in vain](/wiki/Died_in_vain). On 15 February every year, memorial services (opened to the public) are held at the memorial. ### Sook Ching Centre Monument The site of this monument lies within the compound of Hong Lim Complex in Chinatown. The inscription on the monument reads: > The site was one of the temporary registration centres of the Japanese Military Police, the *Kempeitai*, for screening 'anti-Japanese' Chinese. > > On 18 February 1942, three days after the surrender of Singapore, the *Kempeitai* launched a month-long purge of 'anti-Japanese elements' in an operation named *Sook Ching*. All Chinese men between 18 and 50 years old, and in some cases women and children, were ordered to report to these temporary registration centres for interrogation and identification by the *Kempeitai*. > > Those who passed the arbitrary screening were released with 'Examined' stamped on their faces, arms or clothes. Others not so fortunate were taken to outlying parts of Singapore and executed for alleged anti-Japanese activities. Tens of thousands were estimated to have lost their lives. > > For those who were spared, the *Sook Ching* screening remains one of their worst memories of the Japanese Occupation. > — [National Heritage Board](/wiki/National_Heritage_Board_(Singapore)). ### Changi Beach Massacre Monument The site of this monument is located in [Changi Beach Park](/wiki/Changi_Beach_Park) (near Camp Site 2) in the eastern part of Singapore. The inscription on the monument reads: > 66 male civilians were killed by Japanese *Hojo Kempei* (auxiliary military police) firing at the water's edge on this stretch of Changi Beach on 20 February 1942. They were among tens of thousands who lost their lives during the Japanese *Sook Ching* operation to purge suspected anti-Japanese civilians among Singapore's Chinese population between 18 February and 4 March 1942. Tanah Merah Besar Beach, a few hundred metres south (now part of [Singapore Changi Airport](/wiki/Singapore_Changi_Airport) [runway](/wiki/Runway)) was one of the most heavily-used killing grounds where well over a thousand Chinese men and youths lost their lives. > — National Heritage Board. ### Sentosa Beach Massacre Monument The site of this monument is located off the tee box of Hole 3 in the Serapong course in the [Sentosa Golf Club](/wiki/Sentosa_Golf_Club). The inscription on the monument reads: > Near this site, victims of Sook Ching, a Japanese military operation which took place during the Second World War, were buried. For about two weeks from 18 February 1942, Chinese men from ages 18 to 50 underwent screening at various centres around Singapore. Those suspected to be anti-Japanese were executed at various locations. Victims were also brought out to sea in boats, stopping near Pulau Blakang Mati (today Sentosa), where they were thrown overboard and shot by the Hojo Kempei (Japanese auxiliary military police). Some of these bodies were buried around the nearby Berhala Reping, by British soldiers who later became Prisoners-of-War. ### Punggol Beach Massacre Monument The site of this monument is located off Punggol Road in northeastern Singapore. The inscription on the monument reads: > On 23 February 1942, some 300–400 Chinese civilians were killed along Punggol [foreshore](/wiki/Foreshore) by *Hojo Kempei* (auxiliary military police) firing squad. They were among tens of thousands who lost their lives during the Japanese *Sook Ching* operation to purge suspected anti-Japanese civilians among Singapore's Chinese population between 18 February and 4 March 1942. The victims who perished along the foreshore were among 1,000 Chinese males rounded up following a house-to-house search of the Chinese community living along [Upper Serangoon Road](/wiki/Upper_Serangoon_Road) by Japanese soldiers. > — National Heritage Board. - Singapore portal - [Double Tenth Incident](/wiki/Double_Tenth_Incident) - [Selarang Barracks Incident](/wiki/Selarang_Barracks_Incident) - [Shinozaki Mamoru](/wiki/Shinozaki_Mamoru) - [Japanese Cemetery Park](/wiki/Japanese_Cemetery_Park) ### Notes ### Bibliography - Picture archives of the old YMCA building - History of YMCA Singapore - Rudy Mosbergen—\"In the Grip of a Crisis\" - Colonel Tsuji Masanobu of Malaya\n",
  "language": "en",
  "processed_at": "2026-01-12T11:17:18.678979",
  "title": "Kempeitai East District Branch",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Kempeitai_East_District_Branch"
}