{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:17:30.525378"
  },
  "content": "Park in Singapore **Kent Ridge Park** is a 47-[hectare](/wiki/Hectare) public park located in [Kent Ridge](/wiki/Kent_Ridge), [Singapore](/wiki/Singapore), between the [National University of Singapore](/wiki/National_University_of_Singapore) and the [Singapore Science Park](/wiki/Singapore_Science_Park). Due to its undisturbed [habitat](/wiki/Habitat) and abundant plant life, it is a popular venue for [bird-watchers](/wiki/Bird-watcher) and [eco-tourists](/wiki/Ecotourism). During the [Second World War](/wiki/Second_World_War), a hill in the park was the site of one of the last and fiercest battles fought by the [Malay Regiment](/wiki/Royal_Malay_Regiment) against the invading [Japanese](/wiki/Empire_of_Japan) army, the [Battle of Bukit Chandu](/wiki/Battle_of_Bukit_Chandu) (also known as the [Battle of Pasir Panjang](/wiki/Battle_of_Pasir_Panjang)), 12–14 February 1942. The park was officially opened in 1954, and was gazetted by the [National Heritage Board](/wiki/National_Heritage_Board_(Singapore)) as one of 11 World War II sites in Singapore in 1995. It is one of over 300 parks managed by Singapore's National Parks Board, NParks. ## History The area occupied by Kent Ridge Park and the [National University of Singapore](/wiki/National_University_of_Singapore) was formerly known as Pasir Panjang Ridge, and was originally a lowland evergreen [rainforest](/wiki/Rainforest). The park's natural vegetation now consists of groves of [Tembusu](/wiki/Tembusu), [Acacias](/wiki/Acacia) and [Dillenias](/wiki/Dillenia). When the first settlers arrived in Singapore in the early 19th century, they grew crops such as rubber, pepper, [gambier](/wiki/Uncaria) and pineapple on the ridge. During [World War II](/wiki/World_War_II), it was used as a fortress by the [British](/wiki/British_Army) in the defence of Singapore. Many of these plantations were either abandoned or destroyed during the [Japanese Occupation](/wiki/Japanese_Occupation_of_Singapore) (1942–1945), which allowed such crops to grow wild. On 23 February 1954, the Governor of Singapore, [Sir John Fearns Nicoll](/wiki/John_Fearns_Nicoll) unveiled a plaque which declared the area had been renamed Kent Ridge to commemorate the visit by the [Duchess of Kent](/wiki/Princess_Marina,_Duchess_of_Kent) and her son, the [Duke of Kent](/wiki/Duke_of_Kent), on 3 October 1952. The plaque was erected at the junction of what is now Kent Ridge Road and South Buona Vista Road. The park contains [Bukit Chandu](/wiki/Bukit_Chandu), alternatively known as *Opium Hill* (in [Malay](/wiki/Malay_language)), after the opium processing factory owned by the British [East India Company](/wiki/East_India_Company) that was at the foot of the hill until 1910. During 12–14 February 1942, it was the site of the [Battle of Bukit Chandu](/wiki/Battle_of_Pasir_Panjang#Bukit_Chandu), fought by the 42 survivors of the [Malay Regiment](/wiki/Royal_Malay_Regiment) led by Lieutenant [Adnan Bin Saidi](/wiki/Adnan_Bin_Saidi) against the 13,000 men of [Lieutenant-General](/wiki/Lieutenant-General) [Mutaguchi Renya](/wiki/Mutaguchi_Renya)'s 18th Division. The Malay Regiment's position on the hill was overrun by the Japanese and the battle ended in hand-to-hand combat after the last few defenders ran out of ammunition. All the officers except one, Lieutenant Abbas Abdul-Manan, and most of the men, were massacred in the aftermath. ## The park today Formerly used to house senior [British Army](/wiki/British_Army) officers, the last remaining black and white colonial bungalow at 31K Bukit Chandu has been restored and converted into a [World War II](/wiki/World_War_II) war museum called Reflections at Bukit Chandu, commemorating the war and those who fought in it. Originally there were two smaller bungalows below 31K, but they were demolished in 1987 to make way for a public parking lot. There are three life-size statues and a plaque outside the museum, honoring the Malay Regiment and commemorating the lives of those who died. Kent Ridge Park, [Labrador Park](/wiki/Labrador_Park), and the war museum, are part of the Pasir Panjang Historic District, which focuses on World War II [battlefield](/wiki/Battle) events in western Singapore. Together with [Fort Siloso](/wiki/Fort_Siloso) at [Sentosa](/wiki/Sentosa) and [The Battle Box](/wiki/The_Battle_Box) at [Fort Canning](/wiki/Fort_Canning), they serve as a reminder of an important chapter in Singapore's modern history. Near to the top of the ridge, there is a commemorative heritage site marker which shows the area where the [Battle of Pasir Panjang](/wiki/Battle_of_Pasir_Panjang) of 1942 was fought. The park also has some decommissioned [Singapore Army](/wiki/Singapore_Army) military equipment, consisting of two WWII-vintage US M114 155mm field howitzers and a French AMX-13 light tank on permanent outdoor display until December 2015, donated by the [Ministry of Defence](/wiki/Ministry_of_Defence_(Singapore)) as part of its adoption of Kent Ridge Park as *The Army Green Park* in support of the [National Parks Board](/wiki/National_Parks_Board) \"Adopt-a-Park\" scheme to inculcate a greater ownership among the public of local parks and greenery. The park's facilities include fitness corners, look-out points, a nature trail, a multi-purpose court and a canopy walk. The highest point of the park is 61 metres above [sea level](/wiki/Sea_level), from where there is a panoramic view of the coast of [Pasir Panjang](/wiki/Pasir_Panjang) and some of the [Southern Islands](/wiki/Southern_Islands), approximately 5 km off the south-western coast of Singapore. Islands such as [Pulau Bukom](/wiki/Pulau_Bukom) and Pulau Semakau are visible on a clear day. Kent Ridge park, [Telok Blangah Hill Park](/wiki/Telok_Blangah_Hill_Park), and [Mount Faber Park](/wiki/Mount_Faber_Park) are part of the [Southern Ridges](/wiki/Southern_Ridges) trail that links all 3 parks via connecting bridges and paths. ## Plant and animal life The park is managed by the National Parks Board, and is open daily to the public. Admission is free except for entrance to the war museum. The park is accessible via entrances on Vigilante Drive and Pepys Road, off [Pasir Panjang Road](/wiki/Pasir_Panjang_Road). Most of the remaining wild part of the park comprises [secondary forest](/wiki/Secondary_forest) with plants native to Singapore and Peninsular [Malaysia](/wiki/Malaysia) such as [tembusu](/wiki/Tembusu), [angsana](/wiki/Angsana), white leaf fig, [common pulai](/wiki/Common_pulai), [Singapore rhododendron](/wiki/Singapore_rhododendron), [pitcher plants](/wiki/Pitcher_plants), cicada tree and [simpoh air](/wiki/Simpoh_air). The trails through the park, including one for mountain biking, run almost parallel along the ridge. There is a natural pond with fishes and turtles in the north-west of the park. A 280-metre long canopy walk was completed in the eastern part of the park in October 2003, linking Kent Ridge Park to the war museum, Reflections at Bukit Chandu, enhancing the park's and museum's accessibility to the public. Along the walk, there are information boards providing educational information on the [flora](/wiki/Flora) and [fauna](/wiki/Fauna) in the park. At the half-way point, there is a shelter for visitors to take a short break or to enjoy a scenic view of Normanton Park and the National Parks Board's plant [nursery](/wiki/Nursery_(horticulture)). It is one of four popular birdwatching sites on mainland Singapore along with [Pasir Ris Park](/wiki/Pasir_Ris_Park), [Fort Canning Park](/wiki/Fort_Canning_Park) and [Sungei Buloh Wetland Reserve](/wiki/Sungei_Buloh_Wetland_Reserve). Birds found in the park include: [white-crested laughing thrush](/wiki/White-crested_laughing_thrush), [collared kingfisher](/wiki/Collared_kingfisher), [white-bellied sea eagle](/wiki/White-bellied_sea_eagle), [banded woodpecker](/wiki/Banded_woodpecker), [pink-necked pigeon](/wiki/Pink-necked_pigeon), [blue-tailed bee-eater](/wiki/Blue-tailed_bee-eater), [white-breasted waterhen](/wiki/White-breasted_waterhen), and [spotted dove](/wiki/Spotted_dove). Eco-tours and heritage tours are regularly organised by various special interest groups such as the [Nature Society Singapore](/wiki/Nature_Society_Singapore) and the [Raffles Museum of Biodiversity Research](/wiki/National_University_of_Singapore), for students and the general public. - Singapore portal - [Battle of Pasir Panjang](/wiki/Battle_of_Pasir_Panjang) - [Fort Pasir Panjang](/wiki/Fort_Pasir_Panjang) - [Poh Ern Shih Temple](/wiki/Poh_Ern_Shih_Temple) - [List of Parks in Singapore](/wiki/List_of_parks_in_Singapore) ### Notes ### Bibliography - National Parks Board website - Kent Ridge Park - Interactive 360 degree view of Kent Ridge Park 1°17′1.53″N 103°47′25.98″E﻿ / ﻿1.2837583°N 103.7905500°E﻿ / 1.2837583; 103.7905500\n",
  "language": "en",
  "processed_at": "2026-01-12T11:17:30.524830",
  "title": "Kent Ridge Park",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Kent_Ridge_Park"
}