{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:17:29.289683"
  },
  "content": "Subzone of Queenstown Planning Area in Singapore **Kent Ridge** is the name of a ridge and a neighbourhood located in [Pasir Panjang](/wiki/Pasir_Panjang), in the [Queenstown Planning Area](/wiki/Queenstown,_Singapore) of Singapore. The area is notable for housing two parks within the [Southern Ridges](/wiki/Southern_Ridges), [Kent Ridge Park](/wiki/Kent_Ridge_Park) and [HortPark](/wiki/HortPark). The main campus of the [National University of Singapore](/wiki/National_University_of_Singapore) is located adjacent to it, straddling along the southern boundary of Kent Ridge. It is served by the [Kent Ridge MRT station](/wiki/Kent_Ridge_MRT_station). The area occupied by Kent Ridge was formerly known as Pasir Panjang Ridge, and was originally a lowland evergreen [rainforest](/wiki/Rainforest). The natural vegetation of the area mainly consists of groves of [Tembusu](/wiki/Tembusu), [Acacias](/wiki/Acacia) and [Dillenias](/wiki/Dillenia). When the first settlers arrived in Singapore in the early 19th century, they grew crops such as rubber, pepper, [gambier](/wiki/Uncaria) and pineapple on the ridge. During [World War II](/wiki/World_War_II), it was used as a fortress by the [British](/wiki/British_Army) in the defence of Singapore. Many of the plantations were destroyed or abandoned during the [Japanese Occupation](/wiki/Japanese_Occupation_of_Singapore) (1942–1945), allowing the crops to grow wild. On 23 February 1954, the Governor of Singapore, [Sir John Fearns Nicoll](/wiki/John_Fearns_Nicoll) unveiled a plaque which declared the area had been renamed Kent Ridge to commemorate the visit by the [Duchess of Kent](/wiki/Princess_Marina,_Duchess_of_Kent) and her son, the [Duke of Kent](/wiki/Duke_of_Kent), on 3 October 1952. The plaque was erected at the junction of what is now Kent Ridge Road and South Buona Vista Road. The ridge contains [Bukit Chandu](/wiki/Bukit_Chandu), alternatively known as *Opium Hill* (in [Malay](/wiki/Malay_language)), after the opium processing factory owned by the [British East India Company](/wiki/British_East_India_Company) that was at the foot of the hill until 1910. During 12–14 February 1942, it was the site of the [Battle of Bukit Chandu](/wiki/Battle_of_Pasir_Panjang#Battle_of_Bukit_Chandu), fought by the 159 survivors of the [Malay Regiment](/wiki/Royal_Malay_Regiment) led by Lieutenant [Adnan Bin Saidi](/wiki/Adnan_Bin_Saidi) against the 13,000 men of [Lieutenant-General](/wiki/Lieutenant-General) [Mutaguchi Renya](/wiki/Mutaguchi_Renya)'s 18th Division. The Malay Regiment's position on the hill was overrun by the Japanese and the battle ended in hand-to-hand combat after the last few defenders ran out of ammunition. All the officers except one, Lieutenant Abbas Abdul-Manan, and most of the men, were massacred in the aftermath. This [Singapore](/wiki/Singapore) location article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:17:29.289130",
  "title": "Kent Ridge",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Kent_Ridge"
}