{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:17:38.491997"
  },
  "content": "Small private island of Singapore **Keppel Island** is a small private island located in the precinct of [HarbourFront](/wiki/HarbourFront) in [Bukit Merah](/wiki/Bukit_Merah), [Singapore](/wiki/Singapore). The island is largely flat, situated in northern part of Keppel Bay, between [Singapore's main island](/wiki/Main_island_of_Singapore) and the island of [Sentosa](/wiki/Sentosa). Keppel Island is connected to Singapore's main island by the 250 m long [cable stayed](/wiki/Cable_stayed_bridge) [Keppel Bay Bridge](/wiki/Keppel_Bay_Bridge), which opened in 2008. Keppel Bay Bridge also carries the lines for electricity, water, and other services to the island. ## History The island became prosperous in mid-19th century thanks to the development of the [Keppel Harbour](/wiki/Keppel_Harbour). Keppel Island was used for shipbuilding and ship repair operations by [Keppel Shipyard](/wiki/Keppel_Corporation) until 2000. The island was previously known as Pulau Hantu, which means \"Ghost Island\" in [Malay](/wiki/Malay_language). In 1983, the company that owned the island changed the name to Keppel Island. As the previous name was deemed to be disagreeable for some and Pulau Hantu being the name of [another island](/wiki/Pulau_Hantu) in Singapore, the government allowed the change. The island was part of a waterfront luxury development effort in 2008, and it was thereafter connected to the mainland via the construction of the Keppel Bay Bridge. Today, Keppel Island houses high-end restaurants and a [marina](/wiki/Marina) for yachts. This [Singapore](/wiki/Singapore) location article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:17:38.491525",
  "title": "Keppel Island, Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Keppel_Island,_Singapore"
}