{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:17:36.464596"
  },
  "content": "Port in Singapore **Keppel Harbour** ([Chinese](/wiki/Simplified_Chinese_characters): 吉宝港口 or 岌巴港口; [pinyin](/wiki/Pinyin): *Jíbǎo Gǎngkǒu or Jíbā Gǎngkǒu*; [Malay](/wiki/Malay_language): *Pelabuhan Keppel*), also called the **Keppel Channel** and formerly **New Harbour**, is a stretch of water in [Singapore](/wiki/Singapore) between the mainland and the southern islands of [Pulau Brani](/wiki/Pulau_Brani) and [Sentosa](/wiki/Sentosa) (formerly Pulau Blakang Mati). Its naturally sheltered and deep waters was to meet the requirements of [British](/wiki/United_Kingdom) [colonists](/wiki/Colonialism) attempting to establish a [Far East](/wiki/Far_East) maritime colony in that part of the world, thereby setting the stage for the eventual formation of [Singapore](/wiki/Singapore) as a successful independent state. ## Etymology and history Keppel Harbour, by association with the rocky outcrop known as Batu Berlayar (and \"Lot's Wife\" in colonial times) has been speculated to be the site of [Long Ya Men](/wiki/Long_Ya_Men), one of two 14th-century settlements described by Chinese sojourner [Wang Dayuan](/wiki/Wang_Dayuan) during his travels in Southeast Asia; it has not been systematically excavated to confirm this, however. In the modern period, the harbour was first noticed in August 1819 by [William Farquhar](/wiki/William_Farquhar), who reported his discovery of a \"new harbour\" inhabited by *[orang laut](/wiki/Orang_laut)* (\"sea people\", the indigenous ethnic group made up of various tribes of seafarers in and around the straits of singapore) living in boats to [Sir Stamford Raffles](/wiki/Sir_Stamford_Raffles) the following month. In the 1830s, the [Straits Settlements](/wiki/Straits_Settlements), consisting of [Singapore](/wiki/Singapore), [Malacca](/wiki/Malacca) and [Penang](/wiki/Penang), was a [pirates' haven](/wiki/Piracy_in_the_Strait_of_Malacca#History). By 1832, Singapore had become the busy centre of government for the three areas. It was also at this time that Captain [Henry Keppel](/wiki/Henry_Keppel) came to Singapore and helped to clear the Straits of [pirates](/wiki/Pirate). Whilst based at Singapore, he discovered the deep water anchorage that came to be called by his name. Keppel first sailed to Singapore as a [midshipman](/wiki/Midshipman) in 1832 and took part in the Naning ([Malacca](/wiki/Malacca)) expedition, and came again later in 1842 to help with the suppression of piracy in the [Malay Archipelago](/wiki/Malay_Archipelago). Keppel had a long association with Singapore, having visited the island on several occasions up to 1903. He [surveyed](/wiki/Hydrographic_survey) the new harbour of Singapore, which was formed based on his plans. The harbour was completed in 1886. In 1855, Captain William Cloughton, William Paterson and William Wemyss Ker purchased Pantai Chermin from [Temenggong Daeng Ibrahim](/wiki/Temenggong_Daeng_Ibrahim), the [Temenggong of Johor](/wiki/Temenggong_of_Johor). In 1859, Cloughton built the first [dry dock](/wiki/Dry_dock) known as Number 1 Dock. In 1868, the second dock, Victoria Dock, was inaugurated by [Sir Harry George Ord](/wiki/Harry_Ord), [Governor of the Straits Settlements](/wiki/Governor_of_the_Straits_Settlements). The Albert Dock was opened in 1879. For a while, the harbour was simply known as New Harbour but it was renamed Keppel Harbour in honour of [Admiral Keppel](/wiki/Henry_Keppel), who was instrumental in clearing the straits of pirates, by the Acting Governor, Sir [James Alexander Swettenham](/wiki/James_Alexander_Swettenham), on 19 April 1900. New Harbour Road was also renamed Keppel Road. The [Chinese](/wiki/Chinese_language) names for Keppel Road and Keppel Harbour were *sin kam kong chu u* or \"Kampong Bahru dock\", and *sek lat moi* or \"*selat* passage\" (*selat* is [Malay](/wiki/Malay_language) for [straits](/wiki/Strait)). ## Plans Singapore's largest [conglomerate](/wiki/Conglomerate_(company)), the [Keppel Corporation](/wiki/Keppel_Corporation), has announced plans to build exclusive [villas](/wiki/Villa) on the 5.3 [hectare](/wiki/Hectare) [Keppel Island](/wiki/Pulau_Keppel) that it owns in Keppel Bay at Keppel Harbour — home to a [shipyard](/wiki/Shipyard) until 2000. ≥ The group has launched a [condominium](/wiki/Condominium_(living_space)) designed by renowned [architect](/wiki/Architect) [Daniel Libeskind](/wiki/Daniel_Libeskind), who is designing the masterplan for [New York](/wiki/New_York_City)'s [ground zero](/wiki/Ground_zero) site. The 1,200-unit waterfront condominium — known as *Keppel Bay phase two* — was launched in early 2007. It sits on about 84,000 square metres of land on the mainland opposite Keppel Island, with a [shoreline](/wiki/Shoreline) of 750 metres. It has six high-rise blocks and spacious low-rise [apartments](/wiki/Apartment). The condominium is part of the 4,860,000 square feet (452,000 m2) Keppel Bay mega development, which is 70 per cent owned by [Keppel Corp](/wiki/Keppel_Corp) and 30 per cent by its unit [Keppel Land](/wiki/Keppel_Land). About 2,800 homes are set to be built, including the existing 969-unit *Caribbean at Keppel Bay*. The most exclusive homes of the lot are reserved for Keppel Island, where the *Marina@Keppel Bay*, a separate development, was completed in late 2007. The [marina](/wiki/Marina) will have high-end [restaurants](/wiki/Restaurant) and tentative plans are for high-end villas and possible condominium units on the island. A 250-metre [Keppel Bay Bridge](/wiki/Keppel_Bay_Bridge), a [cable-stayed bridge](/wiki/Cable-stayed_bridge) links Keppel Island to the mainland. Keppel also has two other smaller plots for condominium on the other side of the *Caribbean*. Corals condominium is located beside *Caribbean*, adjacent to the former site of King's Dock (the second largest dock in the world at the time after its opening on 26 August 1913) with 366 units. One is 3.4 ha in size while the other, a joint venture with Mapletree, is 2.9 ha. - Victor R Savage, Brenda S A Yeoh (2004), *Toponymics - A Study of Singapore Street Names*, Eastern University Press, [ISBN](/wiki/ISBN_(identifier)) 981-210-364-3 1°16′N 103°50′E﻿ / ﻿1.267°N 103.833°E﻿ / 1.267; 103.833\n",
  "language": "en",
  "processed_at": "2026-01-12T11:17:36.464215",
  "title": "Keppel Harbour",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Keppel_Harbour"
}