{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:17:40.668768"
  },
  "content": "Singaporean Company **Keppel Ltd.**, previously **Keppel Corporation** (or **Keppel Corp**) is a Singaporean company headquartered in Keppel Bay Tower, [HarbourFront](/wiki/HarbourFront). Keppel Ltd. is a Singapore-based company with operations in more than 20 countries. Since 2024, the group has been organised into four main business platforms: Infrastructure, Real Estate, Connectivity, and Fund Management & Investment. The company was founded in 1968 as Keppel Shipyard at the [Keppel Harbour](/wiki/Keppel_Harbour) situated in [Tanjong Pagar](/wiki/Tanjong_Pagar) before moving its operations to Jurong, where the company focused on offshore and marine activities. Keppel Offshore & Marine was the world's largest oil rig builder before its sale to [Sembcorp Marine](/wiki/Sembcorp_Marine) on 28 February 2023. Keppel Land is the world's 2nd most sustainable diversified real estate developer. ## History ### 1900 to 1980s: Keppel Harbour, establishment of Keppel Shipyard and expansion The name of the company *Keppel* was derived from a British ship captain, Captain [Henry Keppel](/wiki/Henry_Keppel), who discovered a natural, deepwater harbour (the Keppel Harbour) in Tanjong Pagar in 1848. The harbour was previously known as New Harbour until 1900 when the acting governor of Singapore, Sir Alexander Swettenham, renamed the harbour to Keppel Harbour in the honour of Captain Henry Keppel when he visited Singapore in 1900. In 1968, [Temasek Holdings](/wiki/Temasek_Holdings) founded Keppel Shipyard when Keppel Harbour was taken over from the British Royal Navy after it withdrew from the island. In the 1970s and 1980s, Keppel Corporation focused on diversification within the company and regionalisation with the first overseas venture in 1975, Keppel Philippines Shipyard was set up in partnership with Filipino investors, with head offices in Cebu and Manila. In 1978, Keppel then ventured into the finance industry by providing financial services to marine contractors under Shin Loong Credit (renamed Shin Loong Finance) which propelled the growth and expansion of the financial services provided by Keppel. Keppel then ventured into the property market in 1983 after acquiring [Straits Steamship Company](/wiki/Straits_Steamship_Company_Limited), an established shipping company with substantial land holdings in Singapore. The Straits Steamship Company was then renamed to Straits Steamship Land (now known as Keppel Land) to focus on the property market. ### 1990–1999: Expanding into the banking industry and moving of operations In 1990, with the acquisition of the Asia Commercial Bank, Keppel Corporation established banking and financial services as a major pillar of growth for the company and in 1997 Keppel Bank acquired Tat Lee Bank, resulting in an enlarged bank called Keppel TatLee Bank to expand its services in the banking industry. In 1999, Keppel Shipyard (now known as Keppel Offshore & Marine group) moved its operations base from Keppel Harbour to Jurong to expand Keppel Corporation's offshore and marine operations in yards around Tuas, Gul and Benoi, which were close to one another and also to develop the land which Keppel Harbour was situated on into waterfront residential area. ### 2001 to present In 2001, Keppel divested its banking and financial services business and privatised its offshore and marine business which resulted in the integration of Keppel Shipyard together with Keppel FELS and Keppel Singmarine to form the Keppel Offshore & Marine group in 2002. In 2015, Keppel Shipyard got a secured floating Production storage and Offloading conversion project worth of $89 million. The project includes repair, upgrade and modification. FPSO Conversion has already started and it is going to be completed in third quarter of 2016. They were the recipients of the Business China Enterprise Award in 2015, for their contributions to China-Singapore business relations. On 28 February 2023, [Sembcorp Marine](/wiki/Sembcorp_Marine) completed its acquisition of Keppel Corporation's Offshore & Marine division for $3.34 billion. Subsequently, on 27 April 2023, Sembcorp Marine's shareholders approved Sembcorp Marine's name change to [Seatrium](/wiki/Seatrium). On 1 January 2024, Keppel Corporation was renamed Keppel Ltd. following the completion of its restructuring into a global asset manager and operator, organised under four business platforms: Infrastructure, Real Estate, Connectivity, and Fund Management & Investment. ## Subsidiaries and Associated Companies As of 31 December 2024, Keppel had 179 significant subsidiaries, associated companies and joint ventures, as disclosed in its annual report. ### Infrastructure - Keppel Infrastructure Holdings Pte Ltd – infrastructure investment holding - Keppel Electric Pte Ltd – electricity and power supply in Singapore - Keppel DHCS Pte Ltd – district heating and cooling systems ### Real Estate - Keppel Land – property development and investment in Asia - Saigon Centre (Vietnam) – mixed-use commercial and retail development - Tianjin Eco-City joint ventures (China) ### Connectivity - Keppel Telecommunications & Transportation Ltd – telecommunications and logistics - Keppel Data Centres Pte Ltd – data centre operations - M1 Limited – mobile and fixed telecommunications provider in Singapore ### Fund Management & Investment - Keppel Capital Holdings Pte Ltd – investment and fund management holding company - Keppel REIT Management Ltd – manager of Keppel REIT - Keppel Infrastructure Fund Management Pte Ltd – manager of Keppel Infrastructure Trust ## Bribery probe In a press release after an American subsidiary pleaded guilty in federal court in Brooklyn, New York, U.S. prosecutors said Keppel units paid about $55 million to win 13 contracts with [Petrobras](/wiki/Petrobras) and another company. The payments, through a series of shell companies, were bribes disguised as consulting agreements. Keppel Offshore & Marine USA pleaded guilty to the bribery scheme which ran for more than a decade, while its parent, Singapore-based Keppel Offshore & Marine, entered into a deferred-prosecution agreement with the government. It agreed to pay $422 million to end the U.S. bribery probe. In July 2016, during testimony in court, a former agent for Keppel alleged that high-ranking Keppel executives Chow Yew Yuen, Tong Chong Heong, Tay Kim Hock, Kwok Kai Choong, and Choo Chiau Beng, approved the former agent's bribing of Brazilian officials to secure contracts with Brazil's state-controlled Petroleo Brasileiro SA. Meanwhile, Jeffery Shiu Chow, a long-time attorney for Keppel, told an American court that he had assisted in the bribe payments. - [Ocean Financial Centre](/wiki/Ocean_Financial_Centre) - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:17:40.668219",
  "title": "Keppel Ltd.",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Keppel_Ltd."
}