{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:17:44.507613"
  },
  "content": "Historic cemetery in Bukit Purmei, Singapore The **Keramat Bukit Kasita**, also known as **Tanah Kubor Diraja** ([Jawi](/wiki/Jawi_script): مقبرة الملك; literally *Royal Burial Ground*) is a closed cemetery located within the grounds of the [Bukit Purmei](/wiki/Bukit_Purmei) housing estate in [Bukit Merah](/wiki/Bukit_Merah), [Singapore](/wiki/Singapore). Comprising burials of Malay royalties and enshrined graves, known as keramat, the site is listed as a reserve site, with no current plans to clear it for redevelopments in the area. The cemetery is generally believed to be the resting place of [Sang Nila Utama's](/wiki/Sang_Nila_Utama) descendants. It is also the resting place of Abdul Rahman II, the last [sultan](/wiki/Sultan_of_Riau-Lingga) of the [Riau-Lingga Sultanate](/wiki/Riau-Lingga_Sultanate) who was in exile. There is dispute to the origins of the cemetery as to whether it was established in the 16th or 19th centuries. ## History The burial ground was first opened by [Alauddin Riayat Shah II of Johor](/wiki/Alauddin_Riayat_Shah_II_of_Johor) in 1530, when Singapore was originally part of the [Sultanate of Johor](/wiki/Sultanate_of_Johor). However, some have argued that the burial ground was instead established in the 19th century during the reign of Sultan Hussein. Regardless, it was considered to be a royal cemetery, with ties to Malay royalty. Sultan Abdul Rahman II, the last ruler of the [Riau-Lingga Sultanate](/wiki/Riau-Lingga_Sultanate), was buried in the cemetery in the 1930s; he had lived in Singapore after his exile from Riau and the dissolution of his Sultanate by the Dutch colonial authorities. Parts of the cemetery was exhumed between 1979 and 1980 to make way for the construction of the Bukit Purmei housing estate. However, the core of the cemetery, which included the royal graves, enshrined graves and some of the ruined village buildings were retained. The remaining burial ground was eventually listed as a reserve site, with no plans to demolish it in future, under the complete ownership of the [Singapore Land Authority](/wiki/Singapore_Land_Authority). Keramat Bukit Kasita received renovations in 2017, which including upgrading the sanctuary and installing metal bars for security and stability. Currently, a volunteer caretaker manages the site. The public are occasionally allowed to access the royal burial ground within the site. ## Architecture The Keramat Bukit Kasita burial ground is surrounded by stone walls with an elaborate, grand gate built in a traditional Malay architectural style. Just outside the enclosed burial ground are dilapidated village houses, including an unused mosque, all of which are in built with traditional Malay architecture with zinc roofs and wooden walls. Inside, the compound contains a few enshrined graves known as *keramat*. These graves have yellow tombstones or cloth to signify their enshrined status. One of the enshrined graves is attributed to a Raja Iskandar, who is regarded as a saint. Other tombs in the compound are attributed to the descendants of [Sang Nila Utama](/wiki/Sang_Nila_Utama), the semi-legendary founder of Singapore. The tombstones differ in size, with important tombs having larger tombstones known as *dapur*, while the less important tombs only have a simple tombstone known as *batu nisan*. ## Notable burials - Abdul Rahman II Muazzam Shah (1851–1930) the last [sultan](/wiki/Sultan_of_Riau-Lingga) of the [Riau-Lingga Sultanate](/wiki/Riau-Lingga_Sultanate) who died in Singapore during exile ## In literature The Keramat Bukit Kasita was featured in a fictional short horror story published in *[The Straits Times](/wiki/The_Straits_Times)* newspaper in July 1961. The story involved a man discovering the burial ground of \"Raja Mohamed Said\" after encountering ghostly skeleton gravediggers near his house. The story ended with the man moving home to [Farrer Park](/wiki/Farrer_Park) as the paranormal occurrences continued to haunt him and his family. ## Gallery - [Muslim cemeteries in Singapore](/wiki/Muslim_cemeteries_in_Singapore)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:17:44.507192",
  "title": "Keramat Bukit Kasita",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Keramat_Bukit_Kasita"
}