{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:17:48.011604"
  },
  "content": "Malay traditional clothing **Kerikam** ([Jawi](/wiki/Jawi_script): کريکم‎) is a coarse metal thread made of gold or silver used for embroidering. The term *kerikam* either comes from the French word clinquant, or from \"Keling\" (referring to South Indians) and \"kam\" (Cambodian for \"type of fabric\") or \"kham\" (Thai for gold). It is an important material in the Malay art of embroidery, traditionally used by the Malays in [Brunei](/wiki/Brunei), [Indonesia](/wiki/Indonesia), [Malaysia](/wiki/Malaysia) and southern [Thailand](/wiki/Thailand). *Kerikam* embroidery can be found on [baju kurung](/wiki/Baju_kurung), [kebaya](/wiki/Kebaya) and [tudung](/wiki/Tudung). ## History This section **does not cite any sources**. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed. *(November 2020)* *(Learn how and when to remove this message)* This art of using *kerikam* for embroidery originated from the court of [Malaca sultanate](/wiki/Malacca_Sultanate), in the early 15th century. With the fall of the [Malaca sultanate](/wiki/Malacca_Sultanate), the art spreads all over the Malay archipelago. It is known as *kelingkan* and *kelengkan* in Selangor, *keringkam* in Sarawak, *teringkam* or *terekam* in Terengganu, *kelingkam* and *kelengkang* in Kelantan. In Riau islands, it is known as Manto, in Palembang as *mudawarah* and in South Africa as *mediora*. All of these names carry the same meaning. The use of *kerikam* was even mentioned in the Sejarah Melayu (Malay Annals) and Ranee Margaret Brooke's My Life in Sarawak: The Ranee of Sarawak. Kerikam was brought to the Malay archipelago by South Indian traders. It is therefore possibly derived from [mukaish](/wiki/Muqayyash) embroidery, and part of the family that includes the techniques badla and tulle bi telli. Much like kerikam, [tulle bi telli](/wiki/Tulle_bi_telli) is a counted thread embroidery worked with flat metal threads that need to be controlled by flat, two holed needles. Telli embroidery was done on gauze (as well as more solid fabrics) before the invention of bobbinet tulle. Another connection is that the basic embroidery of kerikam, often completed as the second step of the process, is called tali air. Telli can also be transliterated from Arabic as \"tali\", and us known to have definitively been used in Egypt since the 16th century (possibly earlier, though the evidence is not conclusive). ## Tudung Keringkam *Keringkam* or *Selayah* is a traditional type of headscarf traditionally worn by women in the Malaysian state of Sarawak. It is handcrafted with fine embroidery work, that complements the traditional Malay clothing of Sarawak. In the old days, *Keringkam* was only worn by the Malay royalty and nobility. However now, this traditional headscarf is often worn when attending special occasions such as weddings and cultural events. The term *tudung keringkam* is believed to be originated from *kerikam*, the name of the thread used for embroidery. This intricate craft of embroidery is also found in other states in Malaysia, such as Kelantan, Terengganu, Perak, and Johor. - Clothing portal - Fashion portal - Malaysia portal - [Malaysian cultural outfits](/wiki/Malaysian_cultural_outfits) - [Culture of Malaysia](/wiki/Culture_of_Malaysia) ### Cited texts\n",
  "language": "en",
  "processed_at": "2026-01-12T11:17:48.011103",
  "title": "Kerikam",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Kerikam"
}