{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:17:51.556028"
  },
  "content": "Malaysian musical ensemble **Kertok** is a traditional Indonesian/Malay [idiophone](/wiki/Idiophone) ensemble native to the [Malay Peninsula](/wiki/Malay_Peninsula), especially [Kelantan](/wiki/Kelantan) and [Terengganu](/wiki/Terengganu) in northern Malaysia . It features multiple xylophones—often made of hardwood such as nangka or pulai—mounted over coconut-shell resonators (kertok kelapa) and played with mallets. Musicians play interlocking, rapid rhythmic patterns, while a lead player guides the tempo and dynamics. Originating from rural harvest festivities, it served both entertainment and communal communication roles. Today, it continues to feature in cultural ceremonies, weddings, and formal events, and is recognized as part of the broader Southeast Asian xylophone tradition. ## Origins Kertok is believed to originate from the Kelantan region of Malaysia, where it evolved from simple bird-scaring instruments used during the rice-harvest season into more musical forms. It gradually transitioned into an entertainment medium, featuring rhythmic contests and festive gatherings across rural Malay communities. ## Construction and sound The xylophone keys (belira) are crafted from woods like nangka, pulai, merbau, or cengal; the resonator (body or ibu kertok) resembles a rice mortar in shape.The malleable rubber-tipped mallets produce two basic tones: a higher-pitched \"cak\" and a lower \"kung\". A typical ensemble includes six xylophones, each played by a pair of musicians (12 players total). ## Cultural context and function Historically, it was played during the rice harvest to scare away birds, and after to entertain villagers and animate nighttime festivities through rhythmic contests, working as a public call-to-gather tool before announcements in rural communities. Now, it remains popular at weddings, official ceremonies, and cultural festivals, and is sometimes adorned to look more elaborate. ## Musical style and technique It is mainly characterized by *hocket-style* interlocking patterns: each player contributes complementing melodic fragments, creating a continuous, dynamic tapestry with rhythms cycling from slow to fast, often mirroring the narrative of traditional stories or dances - such as representing the footsteps of a character in folk tales. ## Relation to regional traditions It is part of a wider Southeast Asian xylophone family, similar in structure and function to Thai [ranat ek](/wiki/Ranat_ek), Cambodian rèat, and Burmese pattalà, which frequently interweave across cultural traditions in performance style and construction techniques.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:17:51.555661",
  "title": "Kertok",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Kertok"
}