{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:17:53.318938"
  },
  "content": "Southeast Asian dish made of rice in the shape of a diamond **Ketupat** (Indonesian and Malay pronunciation: kəˈt̪upat̪̚) is a type of compressed [rice cake](/wiki/Rice_cake) commonly found across [Southeast Asia](/wiki/Southeast_Asia), particularly in [Indonesia](/wiki/Indonesia), [Malaysia](/wiki/Malaysia), [Brunei](/wiki/Brunei), [Singapore](/wiki/Singapore), [Timor-Leste](/wiki/Timor-Leste), southern [Thailand](/wiki/Thailand) and the [Cham community](/wiki/Cham_people) in [Cambodia](/wiki/Cambodia) and southern [Vietnam](/wiki/Vietnam). It is traditionally made by filling a pouch woven from young [palm leaves](/wiki/Arecaceae) with [rice](/wiki/Rice), which is then boiled until the grains expand and form a firm, compact mass. *Ketupat* is typically served as an accompaniment to meat, vegetable or [coconut milk](/wiki/Coconut_milk)-based dishes and is widely prepared for festive and ceremonial occasions. The dish is known by various regional names, including *kupat* ([Javanese](/wiki/Javanese_language) and [Sundanese](/wiki/Sundanese_language)), *tipat* ([Balinese](/wiki/Balinese_language)), *katupat* ([Banjar](/wiki/Banjarese_language)), *katupa* ([Tetum](/wiki/Tetum_language)), *katupa’* ([Makassarese](/wiki/Makassarese_language)), *topat* ([Sasak](/wiki/Sasak_language)) and *katupek* ([Minangkabau](/wiki/Minangkabau_language)), among others. Similar preparations are found in other [Austronesian regions](/wiki/Austronesian_peoples), such as *patupat* and *[puso](/wiki/Pus%C3%B4)* in the [Philippines](/wiki/Philippines) as well as *katupat* in the [Pacific islands](/wiki/List_of_islands_in_the_Pacific_Ocean), particularly in [Guam](/wiki/Guam). Beyond its role as a staple and festive dish, ketupat carries deep symbolic and ritual significance across the region. It is most closely associated with the Islamic celebration of [Eid al-Fitr](/wiki/Eid_al-Fitr) (known regionally as Lebaran or Hari Raya), during which it is often prepared in large quantities and shared among family, neighbours and guests. Beyond Islamic traditions, *ketupat* also appears in [Balinese Hindu](/wiki/Balinese_Hinduism) temple offerings, traditional healing practices and seasonal rites marking harvests and ancestral veneration. It plays a role in multiple belief systems, including Christianity and various indigenous spiritual practices. Numerous regional variations of *ketupat* exist, differing in the type of rice used, wrapping materials, preparation methods and accompanying dishes. These include [triangular](/wiki/Triangle) *ketupat palas*, [pandan](/wiki/Pandanus_tectorius)-wrapped *katupa'*, alkaline-boiled *ketupat landan* and [vegetable](/wiki/Vegetable)-filled *ketupat jembut*. *Ketupat* is also featured as a central ingredient in a variety of local dishes such as *[ketoprak](/wiki/Ketoprak_(dish))*, *kupat tahu*, *ketupat sotong* and *ketupat kandangan*. ## History ### Leaf-wrapped rice traditions The exact origin of *ketupat* is not clearly documented, and there is no definitive evidence identifying where or when the dish was first developed. In some [Austronesian languages](/wiki/Austronesian_languages), the term *kupat* is thought to derive from *epat*, meaning \"four\", possibly in reference to the [four-sided shape](/wiki/Quadrilateral) of the woven rice pouch. This linguistic connection suggests that the concept of wrapping rice in leaves may have developed across multiple regions or been shared through cultural exchange within the [Austronesian-speaking world](/wiki/Austronesian_peoples). The widespread use of similar terms and preparation methods reflects a common cultural heritage in which rice and leaf-wrapping hold both practical and symbolic importance. In the Philippines, leaf-wrapped rice cakes take several regional forms that reflect both cultural traditions and local ingredients. In the [northern region](/wiki/Luzon) of [Ilocos](/wiki/Ilocos_Region), a variant known as *patupat* is prepared during the [sugarcane](/wiki/Sugarcane) harvest season. Classified as a type of *suman*, *patupat* is distinctive for its use of intricately woven palm leaf pouches filled with unsoaked [glutinous rice](/wiki/Glutinous_rice) (malagkit), which are simmered in freshly extracted sugarcane juice. Once cooked, the pouches are hung to drain over the cooking vessel. The sugar-rich liquid not only imparts a sweet flavour but also acts as a natural preservative, allowing *patupat* to be stored for several days. Further east, in the [Mariana Islands](/wiki/Mariana_Islands), the [Chamorro people](/wiki/Chamorro_people) prepare *katupat*, a [diamond](/wiki/Diamond_(gemstone))- or [square](/wiki/Square)-shaped rice pouch woven from coconut fronds and boiled until compact. Archaeological and linguistic evidence suggests that both [rice cultivation](/wiki/Rice_cultivation) and *katupat* production were established before [Spanish colonisation](/wiki/Mariana_Islands#Spanish_exploration_and_control) in the seventeenth century. Closely resembling *ketupat*, this tradition reflects the deep Austronesian roots of leaf-wrapped rice practices. Early Spanish records also highlight the craftsmanship of [Chamorro women](/wiki/Chamorro_people) in weaving coconut leaves into both decorative and utilitarian items, including *katupat* containers. Beyond its role as food, *katupat* also holds ceremonial and symbolic significance. In Chamorro tradition, Laso Fu’a, a rock [outcrop](/wiki/Outcrop) in [Fouha Bay](/wiki/Fouha_Bay_Site), is considered the cradle of creation for the people of the Mariana Islands, and in some accounts, for all of humankind. Chamorros have begun returning to this sacred site to offer prayers and gifts, including katupat, as a gesture of reverence and to ask permission to enter [Guam](/wiki/Guam). ### Ritual feasting Early written evidence of leaf-wrapped rice-based foods in Island Southeast Asia appears in the travel records of the Chinese Buddhist monk [Yijing](/wiki/Yijing_(monk)), who visited the [Srivijaya realm](/wiki/Srivijaya) in the seventh century. In his account of the “islands of the Southern Sea”, likely referring to parts of the Southeast Asia Archipelago, Yijing described [monastic](/wiki/Monasticism) feasts during religious [fast days](/wiki/Fasting) in which hosts served [rice](/wiki/Rice) and [rice cakes](/wiki/Rice_cake) on large plates made by sewing leaves together. These leaf plates were sometimes as wide as half a [mat](/wiki/Mat) and could accommodate generous portions of food. Guests were served multiple types of dishes, with boiled rice and cakes often portioned in quantities large enough to satisfy several people, reflecting a strong tradition of [communal dining](/wiki/Communal_meal). Yijing noted that these practices extended across both elite and common households, with offerings made to [Buddhist monks](/wiki/Bhikkhu) in vessels made of bronze or sewn leaves, depending on social status. The widespread use of leaf-based containers and rice cakes in religious and communal settings reflects the longstanding role of leaf-wrapping and rice preparation in the region's food culture. ### *Kupatay*, *kupat* and pre-Islamic traditions in post-Islamic Java In ancient [Java](/wiki/Java), the preparation of rice cakes wrapped in woven leaves held both cultural and ritual significance within pre-Islamic agricultural traditions. Among [Javanese communities](/wiki/Javanese_people), rice was not only a dietary staple but also a sacred symbol of life and prosperity, closely associated with the worship of Dewi Sri, the Javanese rice goddess of fertility and abundance. Leaf-wrapped rice offerings were likely used in rituals dedicated to Dewi Sri, expressing gratitude for [successful harvests](/wiki/Harvest). This practice reflects a broader pattern across Austronesian societies, where leaf-wrapped rice cakes served both practical and ceremonial purposes. Although the term *ketupat* does not appear in early inscriptions, [Old Javanese](/wiki/Old_Javanese) literary sources suggest the existence of related traditions. The [Kakawin Ramayana](/wiki/Kakawin_Ramayana), a Javanese epic poem composed in the 9th century during the [Mataram Kingdom](/wiki/Mataram_kingdom), contains a reference to a rice cake called *kupatay*, indicating the practice of wrapping rice in woven leaves was already established in Java. The term *kupat* also appears in later works, including the Kakawin Kresnayana (12th century, [Kediri Kingdom](/wiki/Kediri_kingdom)), Kakawin Subadra Wiwaha and Kidung Sri Tanjung (14th to 15th century, [Majapahit period](/wiki/Majapahit)). These references suggest that leaf-wrapped rice cakes were a longstanding element of [Javanese culture](/wiki/Javanese_culture) prior to the widespread adoption of Hinduism, Buddhism and Islam, and that *ketupat* likely evolved from older [Austronesian culinary](/wiki/Austronesian_peoples) and ritual practices. With the [arrival of Islam](/wiki/Islam_in_Indonesia), these leaf-wrapped rice cakes became part of [Islamic celebrations](/wiki/Islamic_culture), especially [Eid al-Fitr](/wiki/Lebaran). In [Javanese tradition](/wiki/Javanese_culture), *kupat* is associated with the festival through the [phrases](/wiki/Javanese_language) *laku papat*, which refers to four key actions of the celebration: *lebaran* (after fasting), *luberan* (abundance), *leburan* (dissolving sins) and *laburan* (chalk for cleansing). Meanwhile, *ngaku lepat*, meaning to admit one's mistakes to others. This demonstrates how pre-Islamic culinary and ritual practices were adapted to new religious contexts while retaining symbolic significance. ### *Ketupat* in Malay sources Early written references to *ketupat* in the [Malay world](/wiki/Malay_world) appear in both foreign and local sources dating to the period of the [Malacca Sultanate](/wiki/Malacca_Sultanate). A [Chinese–Malay vocabulary](/wiki/Dictionary) compiled between 1403 and 1511 includes the term *tu pa*, referring to rice cakes cooked in woven palm or coconut leaf pouches. This suggests that such rice-based dishes were already an established part of [Malay culinary traditions](/wiki/Malay_cuisine) by the early 15th century, reflecting broader Austronesian food practices. In [literature](/wiki/Malaysian_literature), the term *ketupat* is first recorded in the 16th-century [Hikayat Inderaputera](/wiki/Hikayat_Inderaputera), a courtly romance that includes *ketupat* among the cultural elements of aristocratic life. These sources suggest that *ketupat* had become an established part of both daily cuisine and cultural expression in the Malay world by the late Malacca Sultanate and early post-Malacca era. ## Religious and spiritual significance ### Role in Balinese Hindu rituals and offerings In [Hindu-majority regions](/wiki/Hinduism_in_Indonesia) of Indonesia, particularly in [Bali](/wiki/Bali) and parts of [Java](/wiki/Java), *ketupat* plays an important role in religious rituals and ceremonial offerings. In [Balinese Hinduism](/wiki/Balinese_Hinduism), *ketupat*, locally known as tipat, is included in temple offerings (banten) presented to Dewi Sri, the goddess of rice, fertility and prosperity. During the Kuningan festival, which marks the conclusion of the [Galungan celebrations](/wiki/Galungan), [Balinese families](/wiki/Balinese_people) prepare and weave tipat as part of offerings to honour ancestral spirits and celebrate the triumph of [dharma](/wiki/Dharma) over [adharma](/wiki/Adharma). The woven palm leaf and the rice within symbolise gratitude for sustenance and spiritual harmony. Following the ceremony, the tipat may also be consumed. A key element in the Galungan and Kuningan celebrations, *ketupat* is typically offered alongside other symbolic foods and placed near the [penjor](/wiki/Penjor), a tall decorated bamboo pole adorned with young palm leaves and set up outside homes and temples. These ritual practices express the importance of agriculture, ancestral reverence and balance in the [cosmos](/wiki/Cosmos), reflecting core elements of Balinese cosmology. ### Islamic traditions and the role of *ketupat* during Lebaran The tradition of preparing and consuming *ketupat* during [Eid al-Fitr](/wiki/Eid_al-Fitr) is widely observed across maritime Southeast Asia, particularly in Indonesia, Malaysia, Brunei, Singapore and southern Thailand. In these regions, *ketupat* has become a cultural symbol marking the conclusion of the [fasting month](/wiki/Fasting_in_Islam) of [Ramadan](/wiki/Ramadan). It is commonly served alongside various festive dishes during family gatherings and open house celebrations, and is considered an integral part of Eid festivities. In Indonesia, particularly on the island of Java, *ketupat* holds deep religious and cultural significance, especially during Lebaran (Eid al-Fitr). Its symbolic use is widely associated with the efforts of the [Wali Songo](/wiki/Wali_Sanga), the nine revered saints credited with spreading Islam in Java during the 15th century. [Sunan Kalijaga](/wiki/Sunan_Kalijaga), in particular, is traditionally believed to have introduced *Bada Kupat*, a celebration held a few days after Eid, which incorporates *ketupat* as a meaningful part of the festivities. The association between *ketupat* and *Lebaran* is believed to have originated in the [Sultanate of Demak](/wiki/Demak_Sultanate), one of Java's earliest Islamic kingdoms. [Sunan Bonang](/wiki/Sunan_Bonang), another prominent Wali Songo figure, is said to have emphasised the importance of seeking forgiveness and reconciliation as part of the post-Ramadhan observance. This teaching became an integral aspect of Lebaran, during which *ketupat* serves not only as festive food but also as a symbol of purification, humility and restored social harmony. ### *Ketupat* in Javanese and Sundanese spiritual traditions In Java, *ketupat* is also featured in sajen (ritual offerings) within indigenous traditions such as [Kejawen](/wiki/Kejaw%C3%A8n) and [Sunda Wiwitan](/wiki/Sunda_Wiwitan). It may be placed on household altars or suspended at doorways during spiritual observances to welcome ancestral spirits believed to return temporarily to the earthly realm. These practices reflect *ketupat’s* role not only as nourishment but also as a ritual object symbolising the connection between the material and spiritual worlds in traditional Javanese and Sundanese cosmology. ### *Ketupat* in Malay *Main Teri* rituals In [Kelantan](/wiki/Kelantan), Malaysia and [Pattani](/wiki/Pattani_province), Thailand, *ketupat* is used in the traditional healing ritual known as *Main Teri*, which was historically practised by segments of the [Malay community](/wiki/Malays_(ethnic_group)). The ritual involves music, [trance](/wiki/Trance), symbolic gestures and recitations by a practitioner known as the *Tok Teri*. It has been described as a form of psycho-spiritual healing rooted in local beliefs and cultural expressions. As part of the ceremonial setting, a [pavilion](/wiki/Pavilion) (*balai*) is decorated with ritual offerings such as *ketupat*, traditional cakes like putu and fragrant flowers. Young coconut leaves are folded into ornamental shapes including *ketupat* and grasshoppers, then arranged around the space. These elements are believed to serve symbolic purposes or appeal to unseen spiritual entities according to local cosmology. Although once considered an important part of traditional medicine and community healing, *Main Puteri* has declined significantly in recent decades. This decline is due to a combination of factors including growing public access to modern healthcare, changing social attitudes and increased religious awareness. The decline has also been influenced by criticisms from Islamic scholars and religious authorities, who view certain aspects of the ritual as incompatible with Islamic teachings. ### Spiritual significance among the Orang Asli *Ketupat burung* is a type of decorative *ketupat* woven to resemble a bird, complete with a beak, wings and tail. It is traditionally made using a single coconut leaf that has been split in half and stripped of its midrib. Although it can technically be used for cooking, this form of *ketupat* is typically not used as a food container. Instead, *ketupat burung* serves a symbolic function in sewang ceremonies, which are ritual healing practices performed by some Indigenous [Orang Asli](/wiki/Orang_Asli) communities in Malaysia. In this context, the bird-shaped *ketupat* is believed to carry spiritual significance within the framework of traditional healing and [animistic belief systems](/wiki/Animism). ### Symbolism in Dayak ceremonial practices Among [Dayak communities](/wiki/Dayak_people) in [Central Kalimantan](/wiki/Central_Kalimantan), *ketupat* is used in religious and ceremonial offerings as a representation of harmony between humans, nature and the spiritual realm. Its woven form, made from young coconut leaves, symbolises the complexity of life and the connection between people and their ancestors. *Ketupat* is commonly included in rituals such as *Pakanan Batu* and *Manyanggar*, which are conducted to honour guardian spirits of forests and rice fields, and to give thanks for bountiful harvests. ### *Ketupat* in Cina Benteng ancestral traditions Among [Chinese Indonesian](/wiki/Chinese_Indonesians) communities, particularly the [Cina Benteng](/wiki/Peranakan_Chinese) of [Tangerang](/wiki/Tangerang), *ketupat* is sometimes included in offerings during sembahyang Imlek ([Chinese New Year](/wiki/Chinese_New_Year) prayer rituals). While not traditionally part of [Chinese cuisine](/wiki/Chinese_cuisine), ketupat has been incorporated into local practice alongside items such as [lepet](/wiki/Lepet) and various traditional snacks. Its inclusion reflects the syncretic nature of Chinese Indonesian culture, where ancestral veneration often blends with regional customs and symbolic foods. ## Cultural traditions and celebrations ### Symbolic and decorative use In Indonesia, Malaysia, Singapore and Brunei, *ketupat* motifs made from [colourful ribbons](/wiki/Ribbon) or plastic are commonly used as festive decorations during Hari Raya Aidilfitri. Known as ribbon *ketupat*, these ornamental versions are typically hung in homes, [shopping centres](/wiki/Shopping_center) and public spaces, often alongside [oil lamps](/wiki/Oil_lamp) (pelita) and festive lights to create a celebratory atmosphere. While *ketupat* is traditionally a food item, its woven diamond-shaped form has become a widely recognised symbol of the holiday. ### *Ketupat* in Syawal festivities In several regions of Indonesia, the days following Idul Fitri are marked by local traditions centred on *ketupat*. These post-Eid celebrations, commonly referred to as *kupatan*, reflect a blend of Islamic observance and local cultural practices. In [Lombok](/wiki/Lombok), the *Lebaran Topat* tradition is observed on the sixth day of [Syawal](/wiki/Shawwal). Rooted in the syncretic *Waktu Telu* tradition, the celebration includes pilgrimages to sites such as Makam Loang Baloq and Makam Bintaro, ritual activities including *berseraup* (ritual washing) and *ngurisan* (baby hair-cutting), and culminates in the *Perang Topat* (*Ketupat* battle) at Pura Lingsar, a temple shared by Muslims and Hindus. The event symbolises interreligious harmony and social purification, while *ketupat* serves as a symbol of community ties and spiritual reflection. In [Gorontalo](/wiki/Gorontalo), a similar tradition known as *Ketupat Lebaran Jaton* takes place on the seventh day of Syawal. It was introduced by the Jawa-Tondano community, who migrated from [Minahasa](/wiki/Minahasa_Regency) in the early 20th century. Centred in Yosonegoro village, the celebration involves communal prayers and an open-table practice in which residents provide food to anyone passing by. Folk festivities, such as [horse racing](/wiki/Horse_racing) and [cattle](/wiki/Cattle) contests, are also held. Although not originally native to the region, the tradition has been adopted more broadly and is regarded as a means of strengthening social ties and promoting generosity. In [East Java](/wiki/East_Java), the village of Durenan in [Trenggalek](/wiki/Trenggalek_Regency) holds Kupatan Durenan on the eighth day of Syawal, coinciding with the completion of six days of the Syawal fast. The tradition is attributed to KH Imam Mahyin of Pondok Pesantren Babul Ulum, who initiated the practice in the 19th century. Households prepare *ketupat* in large quantities to serve guests during open house gatherings. Unlike most regions where visiting typically occurs on the first day of Idul Fitri, residents of Durenan reserve such visits for *Hari Kupatan*, which serves as the primary occasion for community-wide social interaction. In [Lamongan](/wiki/Lamongan_Regency), *Lebaran Kupat* is celebrated on 7 Syawal with the Festival Kupatan Tanjung Kodok, rooted in the teachings of Sunan Sendang Duwur. The festival features communal feasting, *pawai gunungan ketupat* (a procession of cone-shaped *ketupat* offerings), cultural performances and culinary demonstrations, aimed at preserving tradition and promoting tourism. In [Central Java](/wiki/Central_Java), the post-Eid celebration is known as *Bada Kupat*, during which families prepare both *ketupat* and *[lepet](/wiki/Lepet)*. In [Kudus Regency](/wiki/Kudus_Regency), the celebration features a gunungan parade—cone-shaped offerings made from *ketupat*, *lepet* and other foods—carried in procession to the grave of Sunan Muria on [Mount Muria](/wiki/Mount_Muria). In [Boyolali Regency](/wiki/Boyolali_Regency), a procession of [livestock](/wiki/Livestock) decorated with *ketupat* forms part of the local festivities ### *Ketupat* in Lebaran and Galungan–Kuningan celebrations There are notable similarities between the Javanese Muslim celebration of [Lebaran](/wiki/Lebaran) and the Balinese Hindu observance of the [Galungan](/wiki/Galungan) and Kuningan holy days, in which *ketupat* features prominently. In both traditions, families visit the graves of deceased relatives before the commencement of the religious festivities and *ketupat* is consumed as part of the concluding rituals. Although *ketupat* is widely associated today with the Muslim celebration of Eid al-Fitr in Indonesia, these parallels suggest a pre-Islamic origin rooted in indigenous cultural practices. ### Charitable practices involving *ketupat* The tradition of sedekah *ketupat*, which involves the offering and distribution of *ketupat*, is practised across various regions in Indonesia with distinct cultural and religious expressions. In western [Cilacap](/wiki/Cilacap_Regency), particularly in the Sundanese-influenced districts of [Tambaksari](/wiki/Tambaksari) and [Dayeuhluhur](/wiki/Dayeuhluhur), sedekah *ketupat* is held during *Rebo Wekasan*, the final Wednesday of the Islamic month of [Safar](/wiki/Safar). The event is rooted in local beliefs associated with the potential misfortune of the day. Villagers hang *ketupat* at village borders, gather for communal prayers, and consume the *ketupat* together as a symbolic act of protection and gratitude. In some areas, the practice has evolved into a cultural festival featuring processions and gunungan, large decorative structures made of ketupat, while maintaining its spiritual significance. In [Central Java](/wiki/Central_Java), particularly in Dusun Gledek, Desa Podosoko, Candimulyo in [Magelang Regency](/wiki/Magelang_Regency), sedekah *ketupat* takes the form of charitable distribution ahead of [Lebaran](/wiki/Lebaran). Community members, dressed in traditional sorjan attire, go from house to house delivering *ketupat*, rice and basic food items to underprivileged residents. Recipients are encouraged to cook the *ketupat* with [coconut milk](/wiki/Coconut_milk) (*toyo santen*), symbolising a request for forgiveness (*sedoyo lepat nyuwun pangapunten*). The practice fosters social cohesion and includes both Muslim and non-Muslim participants. ### Mid-Ramadan *ketupat* traditions In [Betawi culture](/wiki/Betawi_people), the tradition of *malam ketupat* or *ketupat qunut* is observed during the second half of [Ramadan](/wiki/Ramadan), particularly on the 15th night or on the odd-numbered nights following the 17th of Ramadan (*malam likuran*). On these evenings, Betawi families prepare *ketupat* along with accompanying dishes such as *sayur labu* ([gourd](/wiki/Gourd) curry) and side dishes, which are brought to local mosques or prayer houses (*musala*) as communal offerings. The practice is often accompanied by the sharing of traditional snacks such as *kue abug*, a steamed *[kue](/wiki/Kue)* filled with [palm sugar](/wiki/Palm_sugar) and grated coconut. The tradition is typically held after the [tarawih prayers](/wiki/Tarawih), followed by communal recitations of [Yasin](/wiki/Ya-Sin) and [Tahlil](/wiki/Tahlil), and concludes with the collective meal. It serves as an expression of gratitude for having reached the midpoint or final stretch of Ramadan and as an opportunity for charity and community bonding. The *ketupat*, beyond its role as festive food, symbolises unity, humility and shared blessings during the holy month. In [Maluku](/wiki/Maluku_Islands), the Muslim community in the village of Kaitetu, [Leihitu](/wiki/Leihitu) subdistrict on [Ambon Island](/wiki/Ambon_Island) observes sedekah *ketupat* towards the end of [Lailatul Qadar](/wiki/Night_of_Power) during Ramadan. Each family donates *ketupat* in accordance with the number of household members, offering them to mosque elders ([penghulu](/wiki/Penghulu)) at Masjid Wapauwe, one of the oldest mosques in the region, and at other local places of worship. The offering expresses gratitude for the leadership of Ramadan prayers and is followed by prayers for the wellbeing of the donors. One *ketupat* is ceremonially returned to each household and its wrapper is hung in the home as a symbolic *doa tolak bala* (prayer to ward off misfortune). The tradition also serves as an informal census and reflects a long-standing integration of religious and communal values. Members of the local nobility traditionally contribute agricultural produce instead of *ketupat*. ### *Ketupat Lepas* tradition *Ketupat Lepas* is a ritual tradition observed by the Malay community in the village of Kudung, East Lingga District, part of the [Lingga Archipelago](/wiki/Lingga_Regency) in the [Riau Islands](/wiki/Riau_Islands). Held annually during the month of [Muharram](/wiki/Muharram), the tradition involves communal prayers at the mosque, attended by both men and women, followed by a shared meal prepared from food brought by each household. After the prayers, participants gather at the river to ceremonially release the wrappings of ketupat into the water. This act symbolises a spiritual cleansing, letting go of misfortune and returning to a state of purity for the new year. Two types of *ketupat lepas* are made: the larger *jantan* (male), and the smaller *betina* (female), both representing the importance of collective responsibility in resolving communal challenges. ### Ketupat during Christmas and New Year celebrations In [Palu](/wiki/Palu), [Central Sulawesi](/wiki/Central_Sulawesi), *ketupat* is not only prepared for Islamic celebrations such as Eid al-Fitr and [Eid al-Adha](/wiki/Eid_al-Adha), but is also commonly served by members of the local Christian community during [Christmas](/wiki/Christmas) and [New Year](/wiki/New_Year). Seasonal vendors begin offering *ketupat* in the days leading up to 25 December, reflecting a regional tradition in which the dish is shared across religious communities as part of broader festive observances. ### Ceremonial use of *ketupat* in symbolic battles One of the most distinctive ceremonial uses of *ketupat* in the region is found in traditional [mock battles](/wiki/Combat) known as *Perang Ketupat* or *ketupat* wars, held in areas such as [Bangka Belitung](/wiki/Bangka_Belitung_Islands), [Sanggau](/wiki/Sanggau_Regency), [Lombok](/wiki/Lombok) and [Bali](/wiki/Bali). While each version differs in context and meaning, they all involve the symbolic throwing of ketupat and reflect shared values of protection, gratitude, and social harmony. At the royal palace of Tayan in [Sanggau Regency](/wiki/Sanggau_Regency), [West Kalimantan](/wiki/West_Kalimantan), the traditional ceremonies of *Mandi Bedil* and *Perang Ketupat* are preserved as part of the local cultural heritage. *Mandi Bedil* involves the ritual cleansing of [royal heirlooms](/wiki/Heirloom) such as [keris](/wiki/Keris), swords, spears and cannons, and is believed to date back to the founding of the Tayan Kingdom under Raja Gusti Lekar. Meanwhile, *Perang Ketupat* is a symbolic ritual in which residents on land and those on boats in the river throw *ketupat* at one another as a form of communal protection against misfortune. In [Bangka Belitung](/wiki/Bangka_Belitung_Islands), the tradition known as *Ruah tempilang* takes place on Tempilang Beach, typically before [Ramadan](/wiki/Ramadan) or during the [Islamic New Year](/wiki/Islamic_New_Year). Participants throw *ketupat* at one another to symbolically cleanse the community and ward off misfortune. The practice is believed to have originated in the eighteenth century as a communal response to [pirate](/wiki/Piracy) threats and foreign incursions. The event usually begins with residents welcoming guests into their homes, followed by a spirited *ketupat* throwing ritual signalled by a [cannon](/wiki/Cannon) blast. A miniature boat is also floated out to sea to symbolically carry away unseen forces. In [Lombok](/wiki/Lombok), a similar tradition called *Perang Topat* is held at Pura Lingsar, a temple revered by both Muslims and Hindus. During the event, members of both communities toss *ketupat* at each other in a festive and friendly manner. The tradition symbolises peaceful coexistence and is believed to bring blessings of fertility to local agriculture. In [Bali](/wiki/Bali), *ketupat* is used in the *Aci Rah Pengangon* ritual, a thanksgiving ceremony to express gratitude for the year's blessings. *Ketupat* are included as ritual offerings and thrown in a ceremonial gesture that aligns with local spiritual and agricultural rhythms. ### Ceremonial use in Bisaya infant rites Among the [Bisaya people](/wiki/Bisaya_(Borneo)) of [Sabah](/wiki/Sabah), a distinctive variant of *ketupat* known as Talimbu Lapas is featured in the *Adat Mencukur Jambul*, a traditional infant hair-cutting ceremony. This loosely woven *ketupat* is filled with yellow [glutinous rice](/wiki/Glutinous_rice) and is intentionally designed to unravel easily. Following the ritual shaving of the infant's hair, the *ketupat* is pulled apart to scatter the rice, a symbolic gesture signifying the fulfilment of a religious vow (nazar). The ceremony customarily concludes with the distribution of [alms](/wiki/Alms). ## Varieties There are numerous regional varieties of ketupat found across Southeast Asia, prepared using either regular or glutinous rice and traditionally wrapped in woven palm leaves. While [coconut palm](/wiki/Coconut_palm) leaves are the most commonly used materials, some local adaptations employ alternative wrappings such as nipah palm or pandan leaves. The following are some notable regional variants: ### *Ketupat darlamu/tamanggung* *Ketupat darlamu*, also known as *ketupat dalamu*, is a traditional [Bruneian Malay](/wiki/Bruneian_Malays) variety of ketupat. It is characterised by a seven-pointed woven casing (*kelongsong*) that is generally larger than typical *ketupat*. Its most distinctive feature is the sharply raised corners on both sides, giving it a unique shape compared to other local variants, including the similarly shaped but smaller *ketupat tamanggung*. ### *Katupek bareh* *Katupek bareh* is a traditional variety of *ketupat* originating from the [Minangkabau people](/wiki/Minangkabau_people) of [West Sumatra](/wiki/West_Sumatra), Indonesia. It is also commonly found along the western coast of [North Sumatra](/wiki/North_Sumatra), particularly in the city of [Sibolga](/wiki/Sibolga). Unlike standard *ketupat*, which is usually boiled in water, *Katupek bareh* is made from white rice cooked in [coconut milk](/wiki/Coconut_milk), resulting in a firmer texture and a savoury, aromatic flavour. The dish is typically served with *[sambal](/wiki/Sambal) kelapa* (spiced grated coconut) and [asam padeh](/wiki/Asam_pedas) ikan, a tangy and spicy fish stew. *Katupek Bareh* is often prepared for festive occasions, family gatherings and community events. ### *Ketupat landan* *Ketupat landan* is a unique variation of *ketupat* traditionally made in Desa Kecitran, [Banjarnegara Regency](/wiki/Banjarnegara_Regency), [Central Java](/wiki/Central_Java) and is typically prepared only for Eid al-Fitr. Its distinctive feature is the use of air landan, which is [alkaline water](/wiki/Alkaline_water) extracted from the ash of burnt [coconut fronds](/wiki/Frond), to boil the *ketupat*. This gives it a dark reddish hue and a slightly salty, savoury flavour, unlike regular *ketupat* which is typically neutral in taste. The alkaline water not only enhances flavour but also helps preserve the *ketupat* for several days without [refrigeration](/wiki/Refrigeration). *Ketupat landan* is commonly served with dishes such as [opor ayam](/wiki/Opor_ayam), [sate](/wiki/Satay) or the locally favoured ayam petis, combining rich, spicy and [umami](/wiki/Umami) notes in one meal. ### *Ketupat daun palas* *Ketupat palas*, also known as *ketupat daun palas*, is a traditional variety of *ketupat* commonly found in northern and eastern [Peninsular Malaysia](/wiki/Peninsular_Malaysia), [southern Thailand](/wiki/Southern_Thailand) and parts of [North Sumatra](/wiki/North_Sumatra), particularly among [Malay communities](/wiki/Malays_(ethnic_group)). It is made using palas ([licuala](/wiki/Licuala)) leaves instead of the more widespread young coconut leaves and is typically folded into a [triangular](/wiki/Triangle) shape. Unlike regular *ketupat* made with ordinary rice, *ketupat palas* uses [glutinous rice](/wiki/Glutinous_rice) (*pulut*), often partially cooked and mixed with [coconut milk](/wiki/Coconut_milk), pandan leaves, salt or sugar for added flavour. Once wrapped and tied tightly, it is boiled or steamed until fully cooked and is often served during festive occasions such as [Hari Raya](/wiki/Eid_al-Fitr). ### *Ketupat daun kapau* *Ketupat daun kapau* is a traditional variety of *ketupat* associated with [Malay communities](/wiki/Riau_Malays) in [Pekanbaru](/wiki/Pekanbaru) and the wider coastal regions of [Riau](/wiki/Riau), Indonesia. It is distinguished by the use of *daun kapau*, a type of leaf harvested from peat swamp vegetation, which gives the rice cake a clean white colour, a distinctive aroma and a longer shelf life compared to *ketupat* wrapped in young coconut or palm leaves. This variety is particularly popular during Eid al-Fitr, when it is prepared and sold in large quantities by local artisans, especially along Jalan Meranti near the [Siak River](/wiki/Siak_River). Although once widespread, the practice has declined due to the decreasing availability of the raw materials and a shrinking number of craftspeople skilled in weaving the traditional wrappings. ### *Katupa'* *Katupa* is a type of *ketupat* from [South Sulawesi](/wiki/South_Sulawesi), particularly among the [Makassarese community](/wiki/Makassar_people). Unlike most *ketupat*, which are wrapped in young coconut leaves, katupa uses [pandan leaves](/wiki/Pandanus_amaryllifolius), giving it a darker green colour and a distinct aroma. It is typically boiled for several hours. Katupa is commonly eaten during Lebaran and is also a staple accompaniment to dishes like [Coto Makassar](/wiki/Coto_makassar). ### *Ketupat jembut* *Ketupat jembut* is a unique variation of *ketupat* originating from [Semarang](/wiki/Semarang), [Central Java](/wiki/Central_Java), traditionally associated with the Syawalan or *Lebaran Ketupat* celebrations held after Eid al-Fitr. Unlike regular *ketupat*, it is filled not only with rice but also with simple [vegetables](/wiki/Vegetable) such as [bean sprouts](/wiki/Sprouting), shredded [cabbage](/wiki/Cabbage) and spiced [grated coconut](/wiki/Coconut), creating a textured surface and [savoury](/wiki/Savoury_(dish)) flavour that requires no additional side dishes. The name, which literally means \"pubic *ketupat*\" in Javanese, is derived from its visual resemblance due to the inclusion of sprouts partially visible through a diagonal cut in the *ketupat* casing, which is made from young coconut or bamboo leaves. Believed to have originated in the 1950s in the village of Jaten Cilik by refugees from [Demak](/wiki/Demak_Regency), the dish was a creative response to limited food supplies during Ramadan. In later years, especially from the 2000s, the *ketupat* also became a medium for THR (holiday allowances), with money tucked inside and distributed to children as part of the festive tradition. ### *Ketupat balamak* *Ketupat balamak* is a regional variation of *ketupat* from [Kandangan](/wiki/Kandangan), [South Kalimantan](/wiki/South_Kalimantan), Indonesia. Unlike the better-known *ketupat Kandangan* served with [coconut milk](/wiki/Coconut_milk) gravy and [grilled](/wiki/Grilling) [snakehead fish](/wiki/Snakehead_(fish)), *ketupat balamak* is boiled in coconut milk with salt and served dry, typically accompanied by a variety of local [sambals](/wiki/Sambal) such as [peanut sauce](/wiki/Peanut_sauce), sate-style sauce, *sambal nagara* or *sambal terasi* mixed with grated coconut and [dried shrimp](/wiki/Dried_shrimp) (*ebi*). It is especially popular during the month of Ramadan, widely sold at the Kandangan Ramadan Market and eaten with [salted duck eggs](/wiki/Salted_duck_egg). Although less commonly found at restaurants, it is regularly sold at morning markets and food stalls during festive seasons. ### *Kupat sumpil* *Kupat sumpil* is a distinctive variety of ketupat from [Central Java](/wiki/Central_Java), characterised by its small triangular shape and the use of [bamboo leaves](/wiki/Bamboo) instead of the more typical coconut fronds as wrapping. It is commonly served as a substitute for [steamed rice](/wiki/Cooked_rice) and eaten with dishes such as *opor ayam, sate, ketoprak* or *ketupat sayur*. While kupat sumpil is available throughout the year in local markets such as Pasar Gladak and Pasar Pagi in [Kaliwungu](/wiki/Kaliwungu,_Banjarnegara), Kendal, it also features prominently in local cultural traditions. The dish is often prepared and shared by the people of Kaliwungu during the *weh-wehan* celebration, a communal festivity held in conjunction with the commemoration of the [Prophet Muhammad's birthday](/wiki/Mawlid) (*Maulid* Nabi Muhammad). ## Derivative dishes *Ketupat* is traditionally served by Indonesians and Malays during festive occasions, especially during [Lebaran](/wiki/Lebaran) or Idul Fitri (Hari Raya Aidilfitri), often at open houses. *Ketupat* is commonly accompanied by dishes such as *[opor ayam](/wiki/Opor_ayam)* (chicken stewed in coconut milk), chicken or beef [curry](/wiki/Curry), *[rendang](/wiki/Rendang), sambal goreng ati* (spiced [beef liver](/wiki/Liver_(food))), *krechek* (spicy stewed buffalo or [beef skin](/wiki/Beef_shank)) and *sayur labu Siam* (chayote soup). *Ketupat* and its close variant *lontong* are also used as alternatives to plain [steamed rice](/wiki/Cooked_rice) in dishes like [gado-gado](/wiki/Gado-gado), [soto](/wiki/Soto_(food)), [karedok](/wiki/Karedok) and [pecel](/wiki/Pecel). Beyond its role as a rice substitute, ketupat has inspired a number of derivative dishes in which it serves as a central component rather than a side. These include distinctive regional preparations that incorporate local ingredients, cooking techniques and flavour profiles. The following are some notable examples: ### *Ketoprak* *[Ketoprak](/wiki/Ketoprak_(dish))* is a traditional [vegetarian](/wiki/Vegetarianism) [street food](/wiki/Street_food) dish from [Jakarta](/wiki/Jakarta), Indonesia, popular among the [Betawi](/wiki/Betawi_people) and broader urban communities. Typically served at roadside stalls, it consists of fried [tofu](/wiki/Tofu), [rice vermicelli](/wiki/Rice_vermicelli) (*bihun*), bean sprouts, cucumber and steamed [rice cake](/wiki/Rice_cake) (*lontong* or *ketupat*), all doused in a rich, sweet-spicy [peanut sauce](/wiki/Peanut_sauce) made from ground peanuts, garlic, chili, palm sugar, salt and sweet [soy sauce](/wiki/Soy_sauce) (*kecap manis*). Common garnishes include *[krupuk](/wiki/Krupuk)* (crackers) and fried [shallots](/wiki/Shallot), with some versions adding a [boiled egg](/wiki/Boiled_egg). The dish's name is sometimes explained as a [Betawi acronym](/wiki/Betawi_language): ket (*ketupat*), to (*tahu* and *toge*) and *prak* (crushed), referring to its key ingredients and preparation, although another folk etymology attributes it to the clattering sound of plates associated with street vendors. ### *Ketupat sotong* *Ketupat Sotong* is a traditional [Malaysian dish](/wiki/Malaysian_cuisine) originating from the east coast states of [Terengganu](/wiki/Terengganu) and [Kelantan](/wiki/Kelantan). It consists of whole [squids](/wiki/Squid) (*sotong*) stuffed with [glutinous rice](/wiki/Glutinous_rice) (*pulut*) and simmered in rich [coconut milk](/wiki/Coconut_milk). The rice is typically pre-soaked or partially cooked, sometimes mixed with coconut milk and salt, then inserted into the squid and secured before cooking. The dish is commonly served during festive occasions such as Hari Raya Aidilfitri and is known for its unique combination of textures, with tender squid encasing sticky, aromatic rice. Regional variations reflect local taste preferences. In Terengganu, *Ketupat Sotong* is generally [savoury](/wiki/Savoury_(dish)), featuring a lighter coconut broth spiced with ingredients such as pandan leaves, ginger and [fenugreek](/wiki/Fenugreek). In contrast, the Kelantanese version often includes [palm sugar](/wiki/Palm_sugar) (gula melaka), resulting in a sweeter, [caramel](/wiki/Caramel)-like gravy. ### *Ketupat Kandangan* *Ketupat Kandangan* is a [traditional dish](/wiki/Banjar_cuisine) originating from [Kandangan](/wiki/Kandangan), the capital of [Hulu Sungai Selatan](/wiki/South_Hulu_Sungai_Regency) Regency in [South Kalimantan](/wiki/South_Kalimantan), Indonesia. It features *ketupat* served with grilled fish in a rich, spiced coconut milk gravy. The dish commonly uses [snakehead fish](/wiki/Snakehead_(fish)) (ikan gabus), though gourami or [catfish](/wiki/Catfish) may also be substituted. The fish is first grilled to deepen its flavour before being simmered in a coconut-based sauce seasoned with aromatic spices such as cinnamon, nutmeg, cloves and cardamom. The resulting gravy is slightly thick and fragrant, contributing to the dish's distinctive character. *Ketupat Kandangan* is closely tied to the riverine culture of South Kalimantan and is often enjoyed during festive or communal gatherings. While some diners prefer the sauce poured over the *ketupat*, others serve the components separately. ### *Ketupat sayur* A popular [street food](/wiki/Street_food) in Indonesia is *ketupat sayur* (\"vegetable *ketupat*\"). The dish consists of *ketupat* served in a thin, spicy coconut milk soup, typically prepared with vegetables such as *labu siam* ([chayote](/wiki/Chayote)) or unripe [jackfruit](/wiki/Jackfruit). It is commonly garnished with cooked tofu, [telur pindang](/wiki/Telur_pindang) (spiced boiled egg) and krupuk (crackers). When lontong is used in place of *ketupat*, the dish is known as *lontong sayur*. Ketupat sayur is widely consumed as a breakfast dish and is particularly associated with two regional variants: the [Betawi version](/wiki/Betawi_cuisine) from [Jakarta](/wiki/Jakarta) and katupek sayua, the [Minangkabau version](/wiki/Padang_cuisine) from [West Sumatra](/wiki/West_Sumatra). The Betawi style is generally simpler, while the [Padang](/wiki/Padang) (Minangkabau) version tends to be more elaborate, often accompanied by side dishes such as *[rendang](/wiki/Rendang), [gulai](/wiki/Gulai)* or telur balado. Both variants are commonly sold by street vendors, especially in the mornings. ### *Kupat tahu* *Ketupat* is also a key ingredient in the traditional [Sundanese](/wiki/Sundanese_cuisine) and [Javanese dish](/wiki/Javanese_cuisine) kupat tahu. The dish typically consists of *ketupat*, tahu goreng (fried [tofu](/wiki/Tofu)) and bean sprouts, served with a savoury peanut sauce and topped with crispy *[krupuk](/wiki/Krupuk)* (crackers). It is a popular street food and breakfast dish across Java, with several well-known regional variations. Notable variants include *Kupat Tahu Kuningan* from [Kuningan Regency](/wiki/Kuningan_Regency) in [West Java](/wiki/West_Java), *Kupat Tahu Padalarang* from [Padalarang](/wiki/Padalarang,_West_Bandung) in [West Bandung](/wiki/West_Bandung_Regency), *Kupat Tahu Bandung* in the city of [Bandung](/wiki/Bandung), *Kupat Tahu Bumiayu* from [Brebes Regency](/wiki/Brebes_Regency) and *Kupat Tahu Magelang* from [Magelang Regency](/wiki/Magelang_Regency) in [Central Java](/wiki/Central_Java). Each variation may feature slight differences in sauce composition, toppings or accompaniments, reflecting local taste preferences. ### *Tipat cantok* In [Bali](/wiki/Bali), a local variation of *ketupat* known as *tipat cantok* is a popular traditional dish. It consists of sliced *ketupat* served with blanched or boiled vegetables such as [long beans](/wiki/Asparagus_bean), [water spinach](/wiki/Water_spinach), bean sprouts, cucumber and fried tofu, all mixed in a savoury peanut sauce. The sauce is typically made from ground fried peanuts, garlic, chili peppers, salt and [tauco](/wiki/Tauco) (fermented soybean paste).) The level of spiciness varies depending on the amount of chili used. Tipat cantok is one of the few Balinese dishes that are traditionally vegetarian. It shares similarities with Javanese *[pecel](/wiki/Pecel)* and the Betawi dish [gado-gado](/wiki/Gado-gado), particularly in its use of peanut sauce and mixed vegetables. ### *Kupat glabed* *Kupat glabed* is a traditional dish from [Tegal](/wiki/Tegal), [Central Java](/wiki/Central_Java), Indonesia, consisting of *ketupat* served with a thick yellow gravy. The name glabed derives from a local [Javanese word](/wiki/Javanese_language) describing a viscous, slurpy texture, aptly reflecting the dish's rich, savoury sauce, which is thickened with maize starch to create a consistency resembling cream soup. Kupat glabed is typically topped with shredded chicken and a generous heap of [kerupuk](/wiki/Krupuk) kuning, whose crumbled bits often cover the entire surface of the dish. It is commonly sold by street vendors or served at roadside stalls ([warung](/wiki/Warung) lesehan). Although visually similar to chicken *[opor](/wiki/Opor)*, a common festive dish served during Eid, kupat glabed is distinguished by its thicker gravy and distinctive street food presentation. The dish is a local favourite in Tegal and is often eaten as a hearty evening meal. It is also frequently accompanied by side dishes such as offal satay or sate blengong (duck-goose [satay](/wiki/Satay)). ## Local variations ## Similar dishes Variations of this practice are found across the region. In [southern Thailand](/wiki/Southern_Thailand), a dish known as *khao tom sam liap* (ข้าวต้มสามเหลี่ยม), or *tom bai kaphor*, consists of [glutinous rice](/wiki/Glutinous_rice) steamed inside triangular-shaped palm leaf pouches. It is commonly prepared for cultural and religious festivals, including *[Sart Duean Sib](/wiki/Sat_Thai)* (ancestral merit day), the [Chak Phra](/wiki/Chak_Phra) procession and ordination ceremonies. Traditionally made with plain white or [black glutinous rice](/wiki/Black_rice), contemporary versions may include fillings such as [mung beans](/wiki/Mung_bean), [pork floss](/wiki/Meat_floss), sweet egg threads or [bananas](/wiki/Banana). Like ketupat, this dish exemplifies the adaptation of leaf-wrapping techniques to local customs and ritual contexts. In the [Philippines](/wiki/Philippines), similar rice pouches are known as *[puso](/wiki/Puso)* (literally \"heart\") and had their origins from pre-colonial [animistic](/wiki/Anito) ritual offerings as recorded by Spanish historians. Unlike *ketupat*, however, they are not restricted to diamond shapes and can come in a wide variety of weaving styles (including bird and other animal forms) which still survive among various [ethnic groups in the Philippines](/wiki/Ethnic_groups_in_the_Philippines) today. *Ketupat* are also woven differently; the leaf base and the loose leaf strands do not exit at the same point, as in most Filipino *puso*. *Ketupat* somewhat resemble the *tamu pinad* version among [Muslim Filipinos](/wiki/Muslim_Filipino) the most, which are shaped like a flattened diamond, although they are also woven differently. In [Cambodia](/wiki/Cambodia), a similar dish of pounded sticky rice wrapped in a pentagonal woven palm leaf is called *katom* (កាតំ) in [Khmer](/wiki/Khmer_language). It is a non-traditional variant of *num kom* which uses banana leaves instead of palm. In Indonesia, similar dish of compressed rice in leaf container includes *[lepet](/wiki/Lepet)*, *[lontong](/wiki/Lontong)*, *[lemper](/wiki/Lemper)*, *[arem-arem](/wiki/Arem-arem)* and *[bacang](/wiki/Bakchang)*. In [China](/wiki/China), there is a similar dish called *lap* (苙) that is a local speciality of the island of [Hainan](/wiki/Hainan). Hainanese *lap* is usually bigger in size than Indonesia's *ketupat*. *Lap* skin might be woven into pillow-shaped or triangular, the sticky rice is filled with pork belly. Outside China, *lap* can also be found in Port Dickson in Malaysia and Singapore. - Food portal - Indonesia portal - Malaysia portal - Singapore portal - [Binalot](/wiki/Binalot) - [Burasa](/wiki/Burasa) - [Lamban](/wiki/Lamban) - [Lemang](/wiki/Lemang) - [Lemper](/wiki/Lemper) - [Lepet](/wiki/Lepet) - [Lontong](/wiki/Lontong) - [Onigiri](/wiki/Onigiri) - [Pastil](/wiki/Pastil) - [Zongzi](/wiki/Zongzi)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:17:53.318449",
  "title": "Ketupat",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Ketupat"
}