{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:17:54.487675"
  },
  "content": "Singaporean classical guitar player **Kevin Loh** is a [classical guitar](/wiki/Classical_guitar) player from [Singapore](/wiki/Singapore). He has won several guitar competitions and he has been called a guitar prodigy by *Classical Guitar Magazine*. ## Early life and education Loh was born in [Singapore](/wiki/Singapore) and began playing guitar when he was five years old under the guidance of his father. In 2010, Loh was discovered on [YouTube](/wiki/YouTube) and was invited to attend the [Yehudi Menuhin School](/wiki/Yehudi_Menuhin_School) in [England](/wiki/England), where he studied for seven years. In 2017, Loh returned to Singapore, where he was required to serve in the military for two years. Loh then went back to England to study Music at [Girton College](/wiki/Girton_College,_Cambridge), [University of Cambridge](/wiki/University_of_Cambridge) for three years. In 2021, Loh then moved to the United States to study at the [University of Wisconsin–Milwaukee](/wiki/University_of_Wisconsin%E2%80%93Milwaukee) under the tutelage of Cuban-born guitarist René Izquierdo. ## Career *Classical Guitar Magazine* called him a guitar prodigy and a superb guitarist. In 2010 we won the HSBC Youth Excellence Award for Musical Excellence. He was twelve years old at the time and he won US$200,000 which he planned to use for his studies and competitions. In 2018 he was awarded the Goh Soon Tioe Centenary Award. It was the first time a guitar player won the award which is given annually to string players in Singapore. The prize also came with a SGD$8000 award. In 2023 he competed in the [Guitar Foundation of America](/wiki/Guitar_Foundation_of_America) International Concert Artist Competition (ICAC), and was awarded second place. - 2013 YouTube Video - Kevin Loh - Moon River\n",
  "language": "en",
  "processed_at": "2026-01-12T11:17:54.487242",
  "title": "Kevin Loh",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Kevin_Loh"
}