{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:17:57.356800"
  },
  "content": "Subzone of Yishun, SingaporePlace in Yishun, Singapore **Khatib** is a subzone of [Yishun](/wiki/Yishun), [Singapore](/wiki/Singapore). It is bounded by Yishun Avenue 1/2/3 to the south, east and north respectively, and Sembawang Road to the west. ## Etymology Khatib was named after the nearby Sungei Khatib Bongsu, located in Yishun East Subzone. The name \"[Khatib](/wiki/Khatib)\" originates from Arabic ([Arabic](/wiki/Arabic_language): خاطب), referring to the person who delivers the sermon during Friday prayers and Eid Prayers. In most of the early- and mid-20th century Khatib was mostly used for pineapple, rubber and gambier plantations owned by [Lim Nee Soon](/wiki/Lim_Nee_Soon), from which [Yishun](/wiki/Yishun) [residential town](/wiki/New_Towns_of_Singapore) is named. ## Amenities ### Leisure Areas - HomeTeamNS — A non-profit association set up to recognise the contributions of [National Servicemen in Singapore](/wiki/National_service_in_Singapore). Opened in August 2020 and has a wide range of amenities and various restaurants and shops. - ORTO — ORTO was a 24-hour recreational destination known for fishing, prawning, and dining options. ORTO also catered for corporate events and weddings. It was closed down in mid-2023 to make way for housing developments in the future. ### Transport Khatib MRT Station: A [Mass Rapid Transit (MRT)](/wiki/Mass_Rapid_Transit_(Singapore)) station serving as a transportation hub in the area. Located south of Yishun MRT station on the [North-South line](/wiki/North-South_MRT_line). It was formerly named Nee Soon South MRT station but was renamed to Khatib in January 1987 after Sungei Khatib Bongsu and Khatib Camp. ### Other places A small local park, called Yishun Park @ N8, is located beside Blk 810, Yishun Ring Rd. The park includes a fitness corner, playground and a running track. Two schools, Peiying Primary School and Naval Base Secondary School, can be found in Khatib, along with Khatib camp, a military base. Places of worship in Khatib include Teong Siew Wei Ling Dong Shan Temple. ## Politics Khatib is a subzone located within the larger Yishun planning area in Singapore. Khatib is currently part of the Nee Soon South Parliamentary Constituency within the [Nee Soon Group Representation Constituency (GRC)](/wiki/Nee_Soon_Group_Representation_Constituency), helmed by the current ruling party, [People's Action Party (PAP)](/wiki/People%27s_Action_Party). Nee Soon South Parliamentary Constituency is overseen by [Member of Parliament](/wiki/Parliament_of_Singapore) [Lee Hui Ying](/wiki/Lee_Hui_Ying).\n",
  "language": "en",
  "processed_at": "2026-01-12T11:17:57.356304",
  "title": "Khatib, Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Khatib,_Singapore"
}