{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:18:00.866223"
  },
  "content": "Convicted murderer executed in Singapore **Kho Jabing**[a][b] (4 January 1984 – 20 May 2016), later in life **Muhammad Kho Abdullah**,[c] was a Malaysian of mixed [Chinese](/wiki/Chinese_people) and [Iban](/wiki/Iban_people) descent from [Sarawak](/wiki/Sarawak), Malaysia, who partnered with a friend to rob and murder a Chinese construction worker named Cao Ruyin in [Singapore](/wiki/Singapore) on 17 February 2008. While [his accomplice](/wiki/Galing_Kujat) was eventually jailed and caned for robbery, Kho Jabing was convicted of murder and [sentenced to death](/wiki/Sentenced_to_death) on 30 July 2010, and lost his [appeal](/wiki/Appeal) on 24 May 2011. Later, when the [changes to Singapore's death penalty laws](/wiki/Capital_punishment_in_Singapore#Changes_to_the_law) took effect in January 2013, Kho Jabing was granted a [re-trial](/wiki/Re-trial), and thus have his death sentence commuted to [life imprisonment](/wiki/Life_imprisonment_in_Singapore) and 24 [strokes of the cane](/wiki/Caning_in_Singapore) on 14 August of that same year, only for his joy to short-lived, because on 14 January 2015, the life sentence was overturned and the death sentence was reinstated on Kho Jabing once again upon the prosecution's appeal. After a lengthy appeal process, and despite the public appeals for mercy on his life, Kho Jabing was finally put to death by [long drop hanging](/wiki/Hanging#Long_drop)[d] at 3.30 pm on 20 May 2016 for his crime.[e] The prosecution's appeal in the case of Kho Jabing was also a landmark in Singapore's legal history, setting the main guiding principles for all judges in Singapore to decide where the discretionary death penalty is appropriate in future murder cases, which directly or indirectly affected both the sentencing and appeal outcomes of some murder cases that occurred in Singapore. Other than the death penalty issues in Singapore, Kho Jabing had also had an effect on the requirements of the Singaporean courts to reopen concluded criminal appeals and cases, which made its first effect on an unrelated capital case on 2 August 2017, leading to the acquittal of 34-year-old Nigerian citizen and alleged drug trafficker Ilechukwu Uchechukwu Chukwudi on 17 September 2020. ## Early life Kho Jabing was born on 4 January 1984, the eldest of two children and the only son in his family. His mother Lenduk Anak Baling[f] reportedly gave birth to him in a [taxi](/wiki/Taxicab) while on the way to the hospital. Kho grew up in [Ulu Baram](/wiki/Ulu_Baram), Sarawak, living in a [longhouse](/wiki/Longhouse) with his parents and younger sister Kho Jumai[g][h] (born 20 May 1988). His younger sister, with whom Kho shared a close bond, described him as a loving older brother, never having fought with his teachers, friends, or any others. He was also said to be active, helpful, hard working, and responsible. Kho left school after finishing [Primary 6](/wiki/Education_in_Malaysia) because his family was not well-off and could not afford to send him to [secondary school](/wiki/Secondary_school) to further his studies. After he left schooling, Kho worked at his family's [plantation](/wiki/Plantation), and later as a [technician](/wiki/Technician) for two years in [Miri](/wiki/Miri,_Malaysia). After this, in 2007, Kho decided to leave Sarawak and move to Singapore to find employment, in hopes of earning a higher income to provide a better life for his family. While in Singapore, he made phone calls daily - once in the morning, and once at night - to his mother. ## Murder of Cao Ruyin On the afternoon of 17 February 2008, Kho Jabing, then 24 years old and an employee of a [rag and bone](/wiki/Rag-and-bone_man) company, together with four others - [Galing Anak Kujat](/wiki/Galing_Kujat),[i] Vencent Anak Anding, Alan Anak Ajan, and Anthony Anak Jaban - planned to rob two [Bangladeshi](/wiki/Bangladesh) construction workers and Vencent's colleagues from Vencent's workplace in [Tiong Bahru](/wiki/Tiong_Bahru). However, before the plan could be executed, the two construction workers had left with their boss. The five remained in Tiong Bahru for drinks. After that, at about 7 pm, the five travelled to [Geylang](/wiki/Geylang) for more drinks. In light of their earlier failure, they argued about whether they should commit robbery and murder in Geylang. Later on, Kho and Galing, then a shipyard worker, separated from the group. They walked for some distance and came upon two men walking along a pathway in an open space near Geylang Drive. The two formed a plan to rob the pair. The two men - mainland Chinese nationals and construction workers **Cao Ruyin**[j][k] ([Traditional Chinese](/wiki/Traditional_Chinese_characters): 曹如銀; [Simplified Chinese](/wiki/Simplified_Chinese_characters): 曹如银) and **Wu Jun** ([Traditional Chinese](/wiki/Traditional_Chinese_characters): 吳軍; [Simplified Chinese](/wiki/Simplified_Chinese_characters): 吴军) - were walking together in that same area after dinner when they were unknowingly targeted by Kho and Galing. Kho picked up a fallen tree branch and used it to hit one of the men, Cao, from behind. As Kho began to assault Cao, Galing went after Cao's companion Wu and assaulted him, but the 44-year-old managed to escape from Galing with minor injuries. However, Cao was continually struck on the head by Kho. Galing joined in by using his belt to hit Cao. The assault eventually stopped and the pair took Cao's mobile phone. The unprovoked attack left Cao with 14 skull fractures that led to brain injuries. Cao was rushed to [Tan Tock Seng Hospital](/wiki/Tan_Tock_Seng_Hospital) where doctors operated on him to treat his head injuries. Despite the doctors' efforts, Cao slipped into a coma. Six days later, on 23 February 2008, Cao died at the age of 40. After Cao's death, [forensic](/wiki/Forensic_science) [pathologist](/wiki/Pathology) Teo Eng Swee conducted an autopsy and determined that the severe head injuries were the cause of death. ## Arrest and trial ### Arrests and indictments of Kho Jabing and Galing Anak Kujat After robbing Cao Ruyin and Wu Jun, Kho Jabing and Galing Kujat regrouped with their three friends and they together sold Cao's mobile phone for [S$](/wiki/S$)300. The five men each received S$50, and the remaining S$50 was used to pay for their drinks and food. Nine days later, police investigations based on the retrieved phone records from Cao's handphone led to the arrests of both Kho and Galing on 26 February 2008 (3 days after Cao's death). They were charged with murder under Section 300(c), which was a hanging offence and thus carried the [mandatory death penalty](/wiki/Mandatory_death_penalty) under Singapore law at that time. Subsequently, their three friends - Vencent Anak Anding, Alan Anak Ajan, and Anthony Anak Jaban - were also arrested in connection to their attempted robbery of the Bangladeshi workers. The trio were all later found guilty and sentenced to imprisonment between 3.5 and 6 years and caning between 12 and 16 strokes of the cane in June 2009, a month before both Kho and Galing stood trial for murder. When a police officer contacted them about Kho's arrest and involvement in the murder, Kho's family and friends in Sarawak were stunned and shocked to hear that Kho was involved in such a violent crime, given the non-violent personality they knew of him. Kho's younger sister said to a newspaper in 2015 about the news of her older brother's arrest, \"Since young, he is not fierce or naughty at all. He is good. When we were growing up, he has never committed a crime, so we don't know why this happened to him.\" ### Murder trial of Kho Jabing and Galing Anak Kujat The trial of Kho Jabing and Galing Anak Kujat began in July 2009. Kho was represented by lawyers Johan Ismail and Zaminder Singh Gill, while Galing was represented by lawyers Chandra Mohan s/o K Nair and Chia Soo Michael, while the prosecution consisted of Deputy Public Prosecutors (DPPs) Leong Wing Tuck and Gordon Oh of the [Attorney-General's Chambers](/wiki/Attorney-General_of_Singapore) (AGC). The case was heard before [Justice](/wiki/Judicial_officers_of_the_Republic_of_Singapore) [Kan Ting Chiu](/wiki/Kan_Ting_Chiu) in the [High Court](/wiki/High_Court_of_Singapore). Dr Teo Eng Swee, the pathologist who performed an autopsy on the victim Cao Ruyin, testified at the trial and presented his medical report, stating that he believed that the skull fractures on Cao was caused by at least 5 fatal blows or more, and one of these were possibly caused by either a blow or a fall on the back of the head. He added that the first fractures were caused with severe force, and the subsequent ones resulted from less severe impacts on the head. When presented with Galing's belt buckle by the prosecution as a possible weapon used to cause the injuries, Dr. Teo could not make any conclusions, but he confirmed from Galing's account that the tree branch which Kho used to hit Cao was capable enough to cause the fractures on Cao's skull. When cross-examined by Kho's lawyer over the possibility of a fall might cause the fractures, Dr. Teo noted that he could not rule out that the fracture as being due to a fall, but the injuries were generally due to blunt force. When re-examined by the prosecution, Dr Teo confirmed that a fall could not cause all the injuries sustained by Cao. Cao's companion Wu Jun[l] also testified how he was attacked by Galing and how he managed to escape and call the police, but he could not tell the court how his friend was attacked, whether himself or Cao was attacked first, or who attacked the deceased. Kho testified that he only struck the deceased twice, but claimed he did not know the force exerted or where he aimed at; the prosecution later indicated that he said so in his police statements that he hit the victim on the head twice. Kho also insisted that he did not have the intention to kill Cao Ruyin, but only to rob him, stating that he felt deep remorse for causing the death of the victim. Kho also added that he was drunk when he robbed and assaulted Cao. Galing also claimed no intention to commit murder. His account differed from his police statements; he initially told police he saw Kho hitting the victim several times, but at the trial, he insisted that Kho hit the victim only once. The police officers interrogating Galing were called to the stand and cross-examined by Galing's lawyer over the alleged inaccuracy of the statements. The officers maintained that they did not record the statements incorrectly. ### High Court verdict The trial ended on 30 July 2010, around two years and five months after Cao's death. Justice Kan Ting Chiu found both Kho Jabing and Galing Kujat guilty of murder committed under Section 300(c) and sentenced both of them to death by [long drop hanging](/wiki/Hanging#Long_drop) (the standard method of execution in Singapore). In his judgement, Justice Kan determined that both Kho and Galing shared a common intention to commit robbery. He also determined that Kho's actions of causing the injuries on the deceased victim was in the furtherance of the common intention of the pair to rob the victim and his friend, and that the injuries he intentionally caused were in the ordinary cause of nature to cause death, which constitutes an offence of murder under Section 300(c) of the [Penal Code](/wiki/Penal_Code_(Singapore)). He also reject Kho's claim of alcohol intoxication as he cited that Kho was able to clearly recount the events that took place, showing full control of his faculties at the time. Justice Kan stated that Galing's participation in the robbery was an indication that he knew that his accomplice's actions were likely to cause death and thus he would have to bear the same responsibility as Kho. Accordingly, Kan J convicted Galing of murder in lieu of the shared common intention to commit robbery, and sentenced him to death together with Kho. ## Defence's appeal ### Hearing of appeal and outcome After their conviction and sentence, both Kho and Galing jointly filed an [appeal](/wiki/Appeal) against their conviction and sentence. For the appeal process, one of Kho's original lawyers Johan Ismail was replaced by James Bahadur Masih, and Zaminder Singh Gill remained as Kho's defence lawyer. For Galing, his original defence counsel was completely replaced by lawyers N Kanagavijayan and [Gloria James](/wiki/Gloria_James) to help him in his appeal. DPP Gordon Oh remained in the prosecuting team while his partner Leong Wing Tuck was replaced by DPP Lee Lit Cheng from the AGC. Both men's appeals were heard before [Chief Justice](/wiki/Chief_Justice_of_Singapore) (CJ) [Chan Sek Keong](/wiki/Chan_Sek_Keong) and two [Judges of Appeal](/wiki/Judicial_officers_of_the_Republic_of_Singapore) (JA) [V. K. Rajah](/wiki/V._K._Rajah) and [Andrew Phang](/wiki/Andrew_Phang) in the [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore). On 24 May 2011, the Court of Appeal released their judgement, and Justice Rajah delivered the verdict. For Kho's appeal, the three judges dismissed his appeal and upheld both his conviction and sentence. Chan stated that they were of the opinion that Justice Kan was correct to convict Kho, then aged 27, of murder as they agreed that Kho did intentionally cause the fatal injuries on Cao, which were sufficient to cause death even if he had no intent to kill the victim. They also agreed that from the review of evidence presented at the original trial, Kho had demonstrated a considerable amount of violence by inflicting several severe blows on the victim. Later, Kho petitioned to the [President of Singapore](/wiki/President_of_Singapore) for clemency on 5 December 2011, but it was rejected. ### Fate of Galing Anak Kujat Coming to the appeal of Galing Kujat, however, the Court of Appeal disagreed with Justice Kan's decision to convict Galing of murder. They agreed that Galing did share a common intention with Kho to commit robbery and cause hurt, but not to intentionally cause any lethal injuries on the victim. They also added that there was no evidence to show the type of injury inflicted by Galing on Cao, no evidence on any discussion or planning, and also no evidence of Galing making any moves to make Kho to assault Cao more easily to cause him to sustain fatal skull fractures and death. Therefore, the Court of Appeal found Galing not guilty of murder and set aside his death sentence. Instead, they convict him of a lower charge of robbery with hurt under section 394 of the Penal Code, and ordered that his case was to be remitted to the original trial judge for re-sentencing. For his part in the robbery of the Chinese nationals, Galing was re-sentenced to 18 years and six months' imprisonment and 19 strokes of the cane on 23 August 2011, four days before Justice Kan's retirement on 27 August 2011. If Galing maintains good behaviour while serving his sentence in prison, he would be released on one-third remission after serving at least two-thirds of his sentence (12 years and 4 months). Assuming that he was eligible for early release, Galing's possible release date would be between mid-2020 to late-2023, depending on when he started to serve his sentence. It is not known if Galing appealed against his new sentence. The allowing of Galing's appeal left Kho Jabing the sole robber to hang for the murder of Cao Ruyin. ## Changes to the law ### Re-sentencing In July 2011, the government decided to make a review of the mandatory death penalty applied to certain drug trafficking or murder offences. In the midst of this review, a [moratorium](/wiki/Moratorium_(law)) was imposed on all the 35 pending executions in Singapore at that time, including Kho Jabing's. This review was completed in July 2012 and the amendments to the law were set to take effect on a later date. In January 2013, the law was amended to make the death penalty no longer mandatory for certain capital offences. Through the removal of the mandatory death penalty, the judges in Singapore were given an option to impose a discretionary sentence of [life imprisonment](/wiki/Life_imprisonment_in_Singapore) with or without [caning](/wiki/Caning_in_Singapore) for offenders who commit murder but had no intention to kill (the death penalty remains mandatory only for murder under section 300(a) of the Penal Code, which were murder offences committed with intention to kill). This discretion is similarly applied to those convicted of drug trafficking, provided that they only act as couriers, suffering from impaired mental responsibility (e.g. [depression](/wiki/Major_depressive_disorder)) or any other conditions. For this, all death row inmates were given a chance to have their cases to be reviewed for re-sentencing. For this, through his newly appointed defence counsel (which consisted of lawyers Anand Nalachandran, [Josephus Tan](/wiki/Josephus_Tan) and Keith Lim), Kho Jabing applied for re-sentencing. His case, together with that of another convicted murderer Bijukumar Remadevi Nair Gopinathan (an Indian who was eventually re-sentenced to life imprisonment and 18 strokes of the cane for the 2010 robbery and murder of a [Filipino](/wiki/Filipinos) [prostitute](/wiki/Prostitute)), became the first two cases to be sent back to the High Court for re-sentencing. Kho's case was ordered to be remitted to the original trial judge for re-sentencing; however, by this time, High Court judge Kan Ting Chiu had retired from the Bench since 27 August 2011 at the age of 65,[m] and High Court judge [Tay Yong Kwang](/wiki/Tay_Yong_Kwang) was appointed to do the work instead. DPP Seraphina Fong, the prosecutor who took over the case in the retrial, argued that the death penalty should be reimposed on Kho. She raised the fact that Kho possess a high culpability by setting upon vulnerable victims, arming himself with a weapon and using excessive force. He had also exhibited violence and viciousness when bludgeoning the victim on the head with the tree branch. In her prosecution, Fong said that the death penalty ought to be imposed on persons who use \"gratuitous violence without regard to the risk of fatality to their victims\". In addition, she also said that Kho's crime \"would outrage the feelings of the community\" and called on the court to take a strong stance against \"violent, opportunistic and heinous crimes\". She also said that the crime was concocted out of Kho's greed and committed with a scant disregard for human life, which warrants severe condemnation by the community. Fong described the self-induced alcohol intoxication by Kho as aggravating, and she said there should be no leniency even with the offender's remorse, personal circumstances and lack of criminal record, as Cao's family had suffered grief as a result of his untimely death at the hands of Kho himself. In defence, Anand and Tan urged Justice Tay to reduce Kho's death sentence to life imprisonment. Both of them argued that although Kho may have had the intention to rob Cao Ruyin, but before that, he did not bring any weapons or mastermind the robbery of the Chinese nationals. They also cited their client's lack of criminal records or records of violent crime in Singapore and Malaysia and his full cooperation with the police in their arguments. They also argue over Kho's young age at that time, his deep remorse over the tragic incident and his wish to seek forgiveness from the victim's family while helping them to cope with their grief as best as he could, and the tragedies which his family had to face before, during and after the court proceedings of Kho, especially the death of Kho's unnamed father[n] a year before his son's trial (it is mentioned from a source that Kho's father never got to see his son one last time before his death on [Gawai Dayak](/wiki/Gawai_Dayak), which fell on 1 June 2008[o]), and that the family were financially unable to visit him during his time in prison. They also pointed out the words of Kho's mother written in the clemency petition submitted earlier to the President, which said that her son's death sentence would also be a death sentence for her. The lawyers conceded that the victim Cao Ruyin's bereaved family could be in the same position as Kho's, but they said that \"the loss of another life would only add to the tragedy and sorrow from this unfortunate and ill-fated robbery and would not serve the ends of justice.\" Not only that, the defence counsel also said that life imprisonment should be the \"starting and default position\" for all cases in subject to their respective factors, and that the death penalty should be imposed restrictively and \"ought to be the exception rather than the rule\". They cited that there was a decline in the number of homicidal cases and the number of fatal assaults during a robbery throughout the years. They also added that there was an unclear and undisputed sequence of events and circumstances of the crime, the insufficient aggravation surrounding the case, the brutality displayed was not exceptional to require a death sentence and that the fatal outcome of the injuries were inadvertent. ### Sentence As he was not the original trial judge in Kho's murder trial, Justice Tay referenced Justice Kan's written verdict, as well as that of the Court of Appeal in order to reach his decision in this case. On 14 August 2013, Justice Tay announced his decision, in which he decided that the death penalty would be inappropriate in the case of Kho Jabing, as he had taken into consideration Kho's young age (24 years old) at the time of the offence and his choice and use of weapon during the robbery, which was \"opportunistic and improvisational\", and there was an unclear sequence of events on that night, as noted by the Court of Appeal's verdict. He additionally disagreed with the defence's earlier argument that a life term would be the starting and default position in sentencing when it comes to all cases in relation to its respective circumstances. He also disagreed that the death of another would not serve the ends of justice and only deepens the tragedy because the murderer himself is the one who deprives the victim of his right to life; the victim's life is as equally precious to him and his family as the murderer's life is to himself and his family. Nevertheless, Justice Tay revoked Kho's death sentence, and instead exercised his discretion to sentence the 29-year-old Malaysian to life imprisonment.[p] He ordered that Kho's life sentence would commence from the date of his arrest on 26 February 2008. Tay also ordered that Kho was to receive the maximum of 24 strokes of the cane, based on the violence he exhibited during his attack on Cao and the resulting grievous consequences. As a result of this re-trial, Kho Jabing became the second convicted murderer to escape the gallows after 23-year-old convicted killer and death row convict Fabian Adiu Edwin,[q] who was similarly re-sentenced to life imprisonment and 24 strokes of the cane in July 2013 for robbing and murdering a security guard in August 2008, when he was only 18 years old. According to his lawyers, Kho expressed relief and gratitude at the fact that he would be not hanged, before being taken away. Given that he was sentenced to life behind bars, under Singapore law, Kho Jabing's life imprisonment meant that he would have to remain in jail for the rest of his natural life, though he could be considered for a possible chance of release on [parole](/wiki/Parole) based on the evaluation of his overall behaviour in prison once he finished serving at least 20 years of his sentence. Since Kho's sentence was backdated to the date of his arrest on 26 February 2008, Kho would have needed to serve roughly another 15 years and six months in jail before his review for parole on or after 26 February 2028 (by then Kho would have been at least 44 years old). However, despite being re-sentenced to life and caning in lieu of death, Kho's ultimate fate would be put into question three months later as the prosecution launched an appeal against the verdict of life imprisonment and caning. ## Prosecution's appeal ### Hearing of prosecution's appeal In November 2013, the prosecution filed an appeal against the re-sentencing of Kho; it was the first time an appeal was made against the High Court's decision to re-sentence a convicted murderer to life imprisonment since the 2013 death penalty law reforms in Singapore. A rare five-judge Court of Appeal, consisting of two Judges of Appeal [Chao Hick Tin](/wiki/Chao_Hick_Tin) and [Andrew Phang](/wiki/Andrew_Phang),[r] and three High Court Judges [Chan Seng Onn](/wiki/Chan_Seng_Onn), [Lee Seiu Kin](/wiki/Lee_Seiu_Kin) and [Woo Bih Li](/wiki/Woo_Bih_Li), was set to hear the appeal. Normally, in the Court of Appeal, all appeals were heard before three judges. Proceeding with its appeal on 20 March 2014, the prosecution mainly argued for Kho to be sentenced to death instead of giving him [life imprisonment](/wiki/Life_imprisonment_in_Singapore) with 24 strokes of the cane, on the grounds that during his attack on Cao Ruyin, Kho had done so in an extremely vicious manner and did not relent even after Cao Ruyin was knocked down by the first blow and continued to assault him repeatedly. They said that Kho may have chanced upon the murder weapon (the tree branch), but the fact was he used it when he rained strikes with great force on Cao's head. In response, the defence counsel argued that Kho only planned to commit robbery and the assault was not premeditated; they also highlighted that since there was no establishment of an undisputed account detailing what really happened on that fateful night of 17 February 2008, it would be unsafe to sentence Kho to death. They also submitted that the case did not sufficiently warrant the harsh penalty of death and thus urged the Court of Appeal to uphold Kho's life sentence and caning. After hearing the appeal, the five-judge Court of Appeal reserved its judgement till a later date. ### Judgement #### Decision On 14 January 2015, the five-judge Court of Appeal returned with a 3-2 majority decision in favour of allowing the prosecution's appeal. As a result of this decision, the life sentence was overturned and 31-year-old Kho Jabing was once again sentenced to death. Among the five judges, Chao, Phang and Chan were all in favour of allowing the appeal, while both Lee and Woo dissented with separate judgements. #### Considerations and majority judgement Due to the fact that this particular appeal marked the first time when a decision of re-sentencing was challenged by the prosecution, the judges detailed their considerations that led to them reaching their decision to sentence Kho to death. Before they came to the decision regarding Kho's final sentence, the five judges asked this question in the verdict, \"At the very heart of this appeal lies a critical legal question - for an offence of murder where the mandatory death penalty does not apply, in what circumstances would the death penalty still be warranted?\" In order to answer this question, which led to them deciding that in this appeal, there should be some guiding principles laid down for judges to decide the appropriacy of the death penalty in future murder cases committed with no intention to kill since the mandatory death penalty was removed for such offences. Not only did they take into consideration both Kho and Galing's court testimonies and police statements, they also took into consideration three factors - death-penalty-related parliamentary debates, foreign and local cases - before reaching the final decision of the main guiding principles which judges should follow in deciding if the death penalty should be imposed. After making these references, they decided that in murder cases where an offender demonstrated viciousness and/or a blatant disregard for human life and the actions of the offender led to the outrage of the feelings of the community, the death penalty ought to be imposed. The majority three of the five judges also wrote, \"It is the manner in which the offender acted which takes centre stage. For example, in the case of a violent act leading to death, the savagery of the attack would be indicative of the offender's regard for human life. The number of stabs or blows, the area of the injury, the duration of the attack and the force used would all be pertinent factors to be considered.\" Justice Chao, who delivered the majority judgement in the court, stated that they found that in Kho Jabing's case, he simply did not care less as to whether Cao Ruyin would survive even though his mere intention was, together with his accomplice Galing Anak Kujat, to rob both Cao and Cao's companion, Wu Jun. The verdict also found that \"this was a case where even after the deceased (referring to Cao Ruyin) was no longer retaliating (after the first blow), the Respondent (referring to Kho Jabing) went on to strike the deceased an additional number of times, completely unnecessary given that his initial intention was merely to rob him.\" In addition, Justice Chao also addressed the minority judges' view of insufficient evidence to prove beyond a reasonable doubt that Kho did struck Cao on the head at least thrice or more (a point which Chao, Chan and Phang disagreed with). From the verdict, Chao said, \"Even if we were to accept the position that it was unclear as to how many times the Respondent had struck the head of the deceased, what is vitally important to bear in mind is that what we have here was a completely shattered skull. Bearing in mind the fact that the alleged intention of the Respondent and Galing was merely to rob the deceased, what the Respondent did underscores the savagery of the attack which was characterised by needless violence that went well beyond the pale.\" As such, the majority three of the five judges were satisfied that Kho Jabing had demonstrated both a blatant disregard for human life and viciousness while killing Cao Ruyin, and Kho's actions were such that it outraged the feelings of the community. Hence they overturned the High Court's re-sentencing decision and increased Kho's life sentence to death with effect by the majority judgement of the five-judge Court of Appeal. The 24 strokes of the cane, which Kho Jabing received in addition to his life sentence in August 2013 and postponed pending the outcome of the appeal, were also scrapped since the law does not allow caning for convicts who were sentenced to death. #### Dissenting judgements On the other hand, the remaining two dissenting judges - Lee and Woo - made a total reconsideration over the finding of facts made by the Court of Appeal when Kho was sentenced to death the first time. In their separate, but dissenting judgements, both Justice Lee and Justice Woo agreed with the majority that the discretionary death penalty should be applied to those particular murder cases where an offender demonstrated viciousness and/or a blatant disregard for human life despite having a substantiated lack of intention to kill, as laid out by the majority. However, they disagreed with the fact that Kho had substantially demonstrated any of the above to warrant a death sentence for his case. In his individual judgement, Justice Lee said that there is no clear evidence of the exact number of blows Kho inflicted on Cao's head - Kho's statements and oral testimonies in court said that he only hit the victim twice; Galing told police that he saw Kho hitting the victim repeatedly, yet he said in court that Kho did it only once; the medical evidence had suggested one or more blows from each man and a possible fall causing one of the fractures - or that he had inflicted more than two strikes with great force on Cao's head, as well as many other facts. As such, Justice Lee concluded that the life sentence and reprieve given to Kho should be upheld while dismissing the prosecution's appeal, as there is insufficient evidence to suggest a repeated cycle of assaults on the victim by Kho and that the injuries were intended minimally to incapacitate the victim. Justice Woo reflected his agreement with Justice Lee's finding of facts through the writings in his own individual dissenting judgement, though he additionally stated that there is some risk relying on Galing's evidence due to the discrepancies in his evidence to the police and on court and that he might be inclined to concoct some of it to deflect blame from himself for Cao's unfortunate death. ### Reactions to appeal ruling After the conclusion of the appeal process, Kho's lawyer Anand Nalachandran told reporters that Kho's feelings were one of \"understandably hopeful\" after the sentence was passed. The only hope left for him, was an appeal to the [President of Singapore](/wiki/President_of_Singapore) for clemency. Upon hearing the verdict, Kho's family felt devastated and disappointed over the decision. ## Clemency plea and stay of execution ### Second clemency plea After he was sentenced to death the second time, Kho Jabing filed for clemency a second time, to President [Tony Tan](/wiki/Tony_Tan) in a final bid to have his death sentence [commuted](/wiki/Commutation_of_sentence) to [life imprisonment](/wiki/Life_imprisonment_in_Singapore). The petition was submitted to [the Istana](/wiki/The_Istana) on 24 April 2015, and Kho later submitted an [addendum](/wiki/Addendum) to his second clemency appeal on 15 May 2015. Later, on 27 May 2015, Kho's family also submitted another petition for clemency to the President. During that time, or long before that presumably, Kho began to convert from [Christianity](/wiki/Christianity) to [Islam](/wiki/Islam), and adopted a Muslim name, Muhammad Kho Abdullah. Kho's three lawyers submitted in the clemency appeal that the death penalty is inappropriate, given that it was not a unanimous decision from the Court of Appeal when they passed a death sentence on Kho. Lawyer Anand Nalachandran stated that they proposed that the death penalty should require a unanimous decision before a convict's sentencing, citing that in certain countries, their laws decreed that without reaching a unanimous decision, which is required for capital punishment, the convict will be sentenced to the next highest punishment of life imprisonment. In his own words, Mr Anand said, \"Our legislation does not have a similar threshold but clemency could have the same effect.\" He also said that in Singapore, the death sentence is meted out on appeal by a two-tier system and there was no further avenue for appeal. A [YouTube](/wiki/YouTube) video was posted by an anti-death penalty advocate group in Singapore, in which both Kho's sister Kho Jumai and Kho's orphaned blood cousin Juliah Jau were featured speaking about Kho's life prior to the murder and the emotional turmoil the family had to go through during the time Kho was standing trial for murder and subsequent court proceedings. Visibly emotional, both Jumai and Juliah (who lost her parents since young and was thus raised by Kho's parents) pleaded for mercy from the President of Singapore and sought forgiveness from Cao Ruyin's family for Kho's actions. Juliah also stated she could not bear to see Kho's mother to suffer and expressed that she was willing to take Kho's place if she could. The anti-death penalty group who interviewed Juliah and Jumai also highlighted that Kho's mother Lenduk Baling, who worked as a chambermaid in a hotel, was suffering from poor health and could no longer continue working and had to depend on the kindness of the neighbours to live through, and because of Kho's status as a breadwinner of the family, it led to Kho's family suffering from a precarious financial situation. Kho Jumai, who married at age 16, was a homemaker and could not take care of her mother since she was living away from home, and Jumai's husband's salary was barely enough to support their own small family of four. Having highlighted the sympathetic circumstances of Kho's loved ones, the group asked for mercy from the President on behalf of these aforementioned factors. At the time Kho Jabing filed his second petition for clemency, it was known that since 1965, there were only [six cases](/wiki/Capital_punishment_in_Singapore#List_of_death_row_inmates_granted_clemency_by_the_President) where a President of Singapore accepted the clemency plea and commuted a death row inmate's death sentence to life imprisonment. The last time when clemency was granted was in April 1998 when 19-year-old [Mathavakannan Kalimuthu](/wiki/Mathavakannan_Kalimuthu)'s death sentence was commuted to life imprisonment by then President [Ong Teng Cheong](/wiki/Ong_Teng_Cheong). Mathavakannan was earlier found guilty of helping his two friends to murder a gangster on 26 May 1996 when he was merely 18 years and 16 days old. Mathavakannan was eventually released on [parole](/wiki/Parole) in 2012 due to good behaviour behind bars. ### Dismissal of clemency appeal and first execution order On 19 October 2015, on the advice of the Cabinet, President Tony Tan decided to not grant Kho Jabing clemency and turned down his petition, which therefore finalized the death sentence and effectively setting Kho to hang for Cao Ruyin's murder. Anand Nalachandran told reporters of *[The Straits Times](/wiki/The_Straits_Times)* on 30 October 2015 that his client had received news of the plea's rejection the week before during his visit in prison with both his co-counsel Josephus Tan and Keith Lim, stating that they are contacting the Malaysian High Commission in Singapore and there will be arrangements for Kho's mother and sister to travel from Sarawak to Singapore to visit him. The lawyer also requested the [Singapore Prison Service](/wiki/Singapore_Prison_Service) to inform them about the execution date once a date is fixed to fulfill Kho's sentence, adding that he and his colleagues will help Kho to fulfill his last wishes. Soon after, an [execution order](/wiki/Execution_order) was issued for Kho, scheduling him to be hanged at dawn on Friday, 6 November 2015. Kho's family were not informed of the pending execution long beforehand. Shortly after the dismissal of the clemency appeal, a motion was filed by human rights lawyer [M Ravi](/wiki/M_Ravi) to avert the execution. When it was heard, Ravi argued that he did so as a \"concerned citizen\" and \"anti-death penalty activist\", he had the legitimacy to argue for Kho. Later on however, when the Court of Appeal asked Ravi to reconsider proceeding with the case since Kho currently had legal counsel representing him, Ravi declined to. [James Masing](/wiki/James_Masing), a senior state minister from Sarawak, acknowledged the execution and said it would not be appropriate for the Malaysian government to interfere in Singapore's justice system, just as they themselves do not want other countries to interfere with their country's judicial system. He also urged Sarawakians working overseas to respect and abide by the law of the other countries where they currently work or live in. On 3 November 2015, Kho's sister Jumai told Malaysian newspaper *[Malay Mail](/wiki/Malay_Mail)* in a phone interview that she and her family are appealing for help from the Malaysian and Singaporean governments to reduce her brother's sentence, citing that their family were in distress and suffered from nightmarish moods regarding the upcoming execution of her brother. She also added that during the time her brother was imprisoned in Singapore, her then 11-year-old son had been asking her when his uncle (referring to Kho Jabing) will be home, while her then two-year-old daughter has never met her uncle, highlighting the turmoil that her family was in over Kho's imminent fate. Masing's earlier comment for non-intervention caused disappointment to Kho's family, who had earlier sought help from the Malaysian government to help save Kho from the hangman's noose. ### Stay of execution granted Upon hearing that Kho was going to hang, Kho's family scrambled for efforts to save Kho from the gallows. Amidst these efforts, they managed to engage another lawyer, Chandra Mohan K Nair,[s] to take over Kho's case on 3 November 2015, merely three days before Kho was due to hang. After being appointed, on 4 November 2015, Chandra filed a criminal motion to reduce his client's sentence and petitioned for a [stay of execution](/wiki/Stay_of_execution) to allow more time to prepare his client's case. The next day, on 5 November 2015, the day before Kho's scheduled hanging, the Court of Appeal granted a stay of execution, effectively suspending Kho's scheduled execution while pending the outcome of the appeal. The prosecution objected to this decision, arguing that there were no arguable issues raised in the criminal motion. Chandra told reporters that he wanted the court \"to give us a second chance to go back to the hearing to go through all those all over again before the trial judge\". He also said that Kho's original trial did not go into details of the evidence surrounding the severity of the injuries and the degree of force exerted to inflict these injuries. ## Appeal and efforts to save Kho Jabing's life ### Last-minute appeal and extended stay of execution The appeal was heard more than two weeks later on 23 November 2015, and the original five judges who heard the prosecution's appeal were set to hear it. Chandra mainly argued for the Court to reopen its decision by pointing out that the court had applied the wrong guiding principle as every murder case outraged the feelings of the community and the court was restricting its own discretion. He also said that Kho was not given a chance to testify in the re-trial about the number of blows and the force used when he attacked the victim Cao. In rebuttal, the prosecution pointed out that Kho had given a testimony in the original trial on how many times he hit the victim and the degree of force he exerted during the assault. Not only that, DPP Francis Ng of the AGC, who was the prosecutor at the appeal ruling, described Kho's case at this moment was \"a disappointed litigant's attempt to convince the court to revisit a point that has been thoroughly considered\". The judgement was reserved till a later date, which prolonged the stay of execution till such time the Court of Appeal's final decision was released. Kho's family, who were given a chance to speak to Kho before he left, left in tears and declined to be interviewed. ### First international efforts to save Kho Jabing Meanwhile, the case caught the attention of Rachel Zeng from Singapore Anti-Death Penalty Campaign (SADPC). Through Kho's legal team, she got in touch with Kho's family in Miri, Sarawak, and privately raised funds to cover their trip to Singapore in 2015. SADPC also collaborated with We Believe in Second Chances (WBSC) in helping both Kho and his loved ones raise awareness of Kho's story and case in order to let more people to think about his case and the issue of the death penalty in Singapore. It was reported that Kho's family was relieved that Kho would not be hanged for now, even though they knew the appeal might not succeed. Amnesty International stepped up to pressure the government to grant Kho clemency and reduce his death sentence to a life sentence. At the same time, Malaysian lawyers from the [Malaysian Bar](/wiki/Malaysian_Bar), Advocates' Association of Sarawak (AAS) and Sabah Law Association (SLA) lobbied the Malaysian government to intervene and commute Kho Jabing's sentence to life imprisonment, if the appeal were to fail and the death sentence on Kho Jabing was maintained. WBSC also facilitated a press conference with Kho's family and several activist groups appealing to the President of Singapore for clemency, in which Kho's 54-year-old mother Lenduk Anak Baling apologised for her son's actions and stated that her son regretted his actions. Amnesty International Malaysia, Civil Rights Committee of the Kuala Lumpur and Selangor Chinese Assembly Hall (KLSCAH), [Suaram](/wiki/Suaram) (Suara Rakyat Malaysia) also joined in to rally for a successful clemency outcome for Kho Jabing. On 31 March 2016, it was reported that the Court of Appeal will release its verdict regarding Kho's case in the following week on 5 April 2016, at 9.30 am. ### Appeal dismissed and second execution order On 5 April 2016, the five-judge Court of Appeal unanimously dismissed Kho Jabing's appeal and maintained the death sentence. Justice Chao Hick Tin stated in the judges' verdict that the defence had rehashed their arguments and produced little new material, much less compelling ones to sufficiently made them re-consider their earlier decision to sentence Kho to death. They also took note of the rise in numbers of applications made to reopen concluded criminal appeals (including Kho Jabing's); he said that the court would only reopen exceptional cases where there is new and compelling evidence to show that there had been a miscarriage of justice, or that a decision is wrong, tainted by fraud or is a breach of natural justice, for which Kho's case was not one of them. The judgement considered \"the present application ... an attempt to re-litigate a matter which had already been fully argued and thoroughly considered\". A new date was to be set once again to carry out the hanging of Kho. Before he was led away, Kho, who was given a chance to speak to his family, told his weeping mother and sister to accept his fate. Kho's family members, including a young niece, declined to speak to the media. Eventually, a fresh [death warrant](/wiki/Death_warrant) was made, and Kho's family received news of the second execution warrant from the [Singapore Prison Service](/wiki/Singapore_Prison_Service) on 12 May 2016. In this new execution order, Kho's execution was rescheduled to be carried out 8 days later on the Friday morning of 20 May 2016 at 6 am. Coincidentally, that day happened to be the 28th birthday of Kho's younger sister Kho Jumai. On 13 May 2016, after hearing that Kho was going to hang on the day of her birthday, Jumai told a Malaysian newspaper, \"I can't believe that they are going to hang my brother on my birthday.\" She expressed that her family will try their best to help her brother, hoping that a miracle can happen. Jumai also reportedly stated that the family will ask for her brother's sentence to be lowered to life imprisonment so that they can, in the future, regularly visit her brother, and she did not want her brother to return home in a coffin. The family would not be alone in their efforts to save Kho from the gallows. ### Final efforts to save Kho Jabing's life Since the loss of the appeal, the case of Kho attracted the attention from both local and international anti-death penalty and human rights organisations and individuals, namely the [Embassy of Switzerland](/wiki/Embassy_of_Switzerland,_Singapore), Hakam, the [United Nations](/wiki/United_Nations), the [FIDH](/wiki/FIDH), [Human Rights Watch](/wiki/Human_Rights_Watch), the [European Union](/wiki/European_Union), [Amnesty International](/wiki/Amnesty_International), ELSAM and the [World Coalition Against the Death Penalty](/wiki/World_Coalition_Against_the_Death_Penalty), who tried to put in efforts to save Kho's life and called on for the government to commute Kho's sentence to life imprisonment, based on the sympathethic circumstances of his case's background and concerns over the impartiality of the decision to send Kho to the gallows. Not only did they ask for mercy, these organisations also urged Singapore to place a [moratorium](/wiki/Moratorium_(law)) on all its pending executions and abolish the [death penalty in Singapore](/wiki/Death_penalty_in_Singapore). These efforts lasted up until the time Kho was formally executed. Even the Malaysian bar and concerned members of the public also joined in the efforts to plead for Kho's life to be spared. Not only that, with the support of local anti-death penalty activists (notably Kirsten Han and Rachel Zeng), Kho Jabing's family - including Kho's mother, sister and two uncles Sunggoh Baling and Lunchom Gansi - also called on the public to persuade the government to spare Kho's life by using the press conferences to attract their attention and raise awareness of the case. The Malaysian government also stepped in to convince the Singaporean politicians to review Kho's case and lower his sentence. Still, it did not prevent the Singaporean government to go ahead with the upcoming execution. The news of the new execution date was said to have shocked the parties who tried to save Kho's life, as they thought there would be time to file a fresh clemency petition, which would take three months to process and would bought Kho more time to live. Later, President Tony Tan made his stance and stated he will not pardon Kho from the hangman's noose despite the last-minute appeals for Kho's life to be spared. ## Final appeals and execution ### Dismissal of two last-minute appeals On 19 May 2016, the final day before Kho Jabing was due to be executed, a last-minute appeal, filed by one of Kho's two newly engaged lawyers Gino Hardial Singh (on the instructions of Kho's sister), was heard, and the same five judges who heard the 2015 appeal earlier were once again set to hear it. In the appeal, Singh argued on behalf of Kho that in both the appeal processes in 2011 and 2013, Judge of Appeal Andrew Phang was present in both appeal hearings. Singh argued that this could have made Justice Phang considering over and repeating his previous decision to uphold Kho's death sentence during the second appeal hearing when it comes to the Court of Appeal's imposition of the death penalty in 2015, suggesting biasedness on Phang's part (for which the prosecutors argued otherwise in rebuttal). However, Justice Phang, who was one of the five judges hearing this particular last-minute appeal, stated that both appeals were different. The first appeal was related to Kho's murder conviction, the judge reportedly said, at a time when the mandatory death penalty still applied to the charge for which Kho was convicted of. The second appeal was during the time when the death penalty is no longer mandatory and Kho was re-sentenced, the appeal court at that time had considered carefully before reaching the conclusion (by majority) that Kho's culpability and actions ultimately deserves the death penalty. Hence the appeal was dismissed, because the court could not accept this argument of bias. Not only that, Justice Phang said to Singh, \"I know you are trying your best to argue on behalf of your client but you need to be fair, objective and logical as well\", citing that the conviction and sentence are \"part of an inextricable whole, you (Singh) can't divorce them\" since the appeals for conviction and sentence were heard separately due to the amendment of the death penalty laws; he said that if the amended laws applied at the time of Kho's appeal, the same three judges hearing it will consider both the issues of sentence and conviction. Judge of Appeal Chao Hick Tin even asked Singh why he could not accept Justice Phang being the judge involved in the appeal processes for conviction and re-sentencing and yet he accepted the notion of the judge who convicted Kho in the original trial being the same one who re-sentenced Kho (this is likely an error since the original trial judge was retired by the time Kho was re-sentenced). The court also labelled Kho's legal actions as an \"abuse of the court process\" and called his arguments of bias were plainly wrong. On the same day itself, Kho's other lawyer [Jeanette Chong-Aruldoss](/wiki/Jeanette_Chong-Aruldoss), an opposition politician from Singapore, separately tried to seek a stay of execution after filing a civil application and appealing to Judicial Commissioner Kannan Ramesh, but it was dismissed. However, she was given an 11 pm deadline to file a criminal appeal, and later in that day, Chong-Aruldoss successfully met the deadline and secured a temporary stay of execution for Kho Jabing pending the outcome of the newly filed appeal, for which Kho would not be hanged till the appeal was heard. For her appeal, Chong-Aruldoss sought help from Alfred Dodwell, another lawyer, who agreed to help her in this appeal. Over this appeal, the five same judges who heard Singh's appeal earlier that day gathered overnight. Kho's family members also came to Singapore to hear the outcome of the appeal, with the help of the anti-death penalty activists who raised funds to pay for their trip to Singapore. On 20 May 2016, at 9 am, after hearing the appeal, the Court of Appeal once again rejected this appeal, reiterating that the lawyers representing Kho had been rehashing their old arguments made before or withdrawn by Kho's previous lawyers in the previous appeals. Judge of Appeal Chao Hick Tin said, \"This court should not be seen as a device to undermine the legal process. We cannot allow applications made at the eleventh hour, one after another\". Justice Chao also said that the legal system of Singapore would be thrown into disrepute if it is allowed to be scuttled. He was also surprised at Chong-Aruldoss's decision to file a civil application when it was a criminal matter. Another civil application filed by Mr Dodwell to stay Kho's execution was also thrown out. The outcome of the final last-minute appeal had also effectively put an end to Kho's 8-year long legal challenge against the death penalty. After the rejection of his final appeal, Kho, who was then finally resigned to his imminent fate, smiled and waved at the activists and bowed to them as gratitude for their support throughout his appeal process. Shortly after his final appeal was thrown out by the Court of Appeal, the stay of execution was lifted and Kho Jabing's execution was ordered to take place in the afternoon of 20 May 2016 at 4.30 pm, according to the Malaysian High Commission. Kho's family went to Changi Prison to see him one last time. Rachel Zeng, an anti-death penalty activist, expressed that this is the first time ever in Singapore where an execution was not carried out in the usual timing of dawn, and expressed why is there a rush to hang Kho. ### Execution At 3.30 pm on the Friday afternoon of 20 May 2016, more than eight years after the murder of Cao Ruyin, and merely hours after the dismissal of his final appeal, 32-year-old Kho Jabing was hanged at [Changi Prison](/wiki/Changi_Prison). The execution was carried out an hour earlier than the scheduled timing of 4.30 pm. Before his death, Kho Jabing reportedly told his sister Jumai that he wanted her to celebrate her birthday, which fell on the same day he was hanged. \"Don't worry about me,\" Kho told her. \"You should celebrate your birthday and not think about me. When you blow out the candles, you have to think that I am by your side.\" Kho also left behind a birthday card to his sister before he died. On the same day of 20 May 2016, shortly after Kho was executed, the [Singapore Police Force](/wiki/Singapore_Police_Force) released a statement and confirmed Kho's execution. They stated that the 32-year-old Malaysian had been \"accorded full due process under the law\" and was represented by legal counsel through the legal process. It was reported that on the same day of Kho's execution, Wang Zhijian, the perpetrator of the [Yishun triple murders](/wiki/Yishun_triple_murders), had been executed at dawn of the same day. ### Funeral and burial Kho Jabing's body was brought back to Sarawak the next day by flight, and it arrived at Mascargo. A funeral was held, and Kho was laid to rest in a Muslim cemetery in Jalan Kuala Baram, [Miri](/wiki/Miri,_Malaysia). The funeral was attended by Kho's mother and sister, as well as the non-Muslim relatives of their family. The atmosphere of the funeral was reportedly filled with heartbreak from Kho's relatives, especially with Kho's mother being seen holding back her tears while mourning the death of her son as the coffin was brought from Mascargo to Ar-Arryan Mosque Permyjaya for prayers before the burial of Kho's body. On 22 May 2016, two days after Kho's death, [Ustaz](/wiki/Ustaz) Fadlon Osman, who acted as Kho's counsellor during the period Kho was on death row, recounted his experiences with Kho while the man is still on death row, saying that during [tazkirah](/wiki/Tadhkirah_(disambiguation)) sessions, Kho would sit quietly and listen to talks by others. Kho was also able to quote verses of the [Quran](/wiki/Quran) and [hadith](/wiki/Hadith) (religious texts) and recite the former fluently, and fasted during [Ramadan](/wiki/Ramadan) and even voluntarily did so regularly. Fadlon also added that Kho had recited the [Surah Yasin](/wiki/Surah_yasin) (prayer) before his death, requesting his friends to perform haj on behalf of him and prayed that his family would receive the guidance of Islam. Fadlon also held the funeral for Kho in Sarawak. ## Aftermath ### Reactions to Kho Jabing's execution When the news of Kho Jabing's execution was first released, many abolitionist activists, notably Rachel Zeng, expressed their condolences to Kho's family and some even stepped in to fund the executed convict's funeral and asked for donations to help the bereaved family. One of them, Kirsten Han, published an emotional tribute dedicated to Kho Jabing on [Facebook](/wiki/Facebook), titled \"*The life of Kho Jabing*\", which contained details of Kho's life in Sarawak and his time of employment in Singapore prior to the murder of Cao Ruyin, and also included some photographs of Kho's childhood. Other than that, human rights organisations like [Suaram](/wiki/Suaram) and [Amnesty International](/wiki/Amnesty_International) criticised and condemned Singapore for executing Kho despite the public calls to spare his life. Some even stated they will not stop pushing for Singapore to join the international trend to abolish the death penalty. On the other hand, netizens in Singapore supported the hanging while they also condemned the people who opposed both the death penalty and Kho's execution. For example, in the case of Kirsten Han, who published Kho's tribute on Facebook. Many users of Facebook were angered at the tribute's publication; many of them posted furious comments, accusing the activist for romanticising the deceased Kho and giving the convicted killer a hero treatment while not paying the same respect to the murdered victim Cao Ruyin. To an extent, some even questioned the true moral character of Kirsten Han, and pointed that even Cao Ruyin himself had a childhood and his death made him unable have a second chance at life and yet no details of his life in China and his family were given. One Facebook user, in response, made a tribute dedicated to Cao and described in graphic detail of how Kho attacked Cao on that fateful night of 17 February 2008, and another asked if Han cared to write a similar tribute about the victim and called her shameless. In general, many of these commentators condemned Kho as a murderer, with some stating that he deserved to die. Another report also revealed that, due to them being the lawyer and activist defending Kho Jabing and his case respectively, both Jeanette Chong-Aruldoss and Kirsten Han were continually facing harsh online abuse by netizens angered at them for defending a condemned murderer like Kho. One of these netizens included a lawyer, who also criticised Chong-Aruldoss for her conduct and decision to defend Kho, and accused her for trying to gain political mileage through this case given her status as an opposition politician in the Singapore government (an allegation which Chong-Aruldoss denied in response). A Chinese news report also showed support to the Singaporean government, praising them for not yielding to the international pressure to pardon Kho and went ahead with the hanging of Kho, as to ensure that judicial justice was fully served and brought closure to its legal process. ### AGC's criticism of Kho Jabing's lawyers On 25 May 2016, five days after Kho Jabing's death, for the abuse of legal and court processes and \"legal opportunism\", Kho's lawyers - Jeanette Chong-Aruldoss, Alfred Dodwell and Gino Hardial Singh - were all severely reprimanded by the Attorney-General's Chambers (AGC). The AGC also said that the actions by Kho's lawyers were not upholding the paramount duty a lawyer owes to the court and the abuse of process cannot be justified by the lawyer's duty to his/her clients. They noted that \"cherished principle in our legal tradition that a legal practitioner must do his utmost to uphold the administration of justice\", but the proceedings should be held in a fair and efficient manner with integrity. They considered the conduct of the lawyers amounted to an abuse of process since the case of Kho Jabing was already exhausted of all avenues of appeal and that there were repeatedly old arguments in all the last-bid attempts to save his life. The [Ministry of Home Affairs](/wiki/Ministry_of_Home_Affairs_(Singapore)) (MHA) additionally commented on the same day, agreeing with the AGC's statements, saying that the last-ditch attempts by Kho's lawyers appeared to be solely trying to delay Kho's execution. On the other hand, some people, including lawyer Choo Zheng Xi and Kirsten Han, spoke up for Kho's lawyers in support. Choo said on Facebook, \"In the best traditions of the bar, Jeannette (Chong-Aruldoss) and Alfred (Dodwell) stepped into the breach and argued their client's case with vigour.\" Han also shared Choo's Facebook post and thanked \"all the lawyers, past and present, who have tried so hard against such massive odds.\" Chong-Aruldoss and Dodwell also spoke up their side of the story to the media. Chong-Aruldoss said that after the conclusion of the case, she received a phone call from Kho's sister Kho Jumai, who thanked her for her efforts, \"I was merely her lawyer acting under her instructions. A lawyer's job is to explore, pursue and exhaust his/her client's legal recourses. Jumai would not regret that she had not done enough for her brother. Neither will I regret that I did not do my best for my client.\" Dodwell also said that there is a firm belief among lawyers that Kho did not deserve capital punishment, and in his own words, he added, \"So we mounted a constitutional challenge. Only in Singapore can a constitutional challenge be characterised as an abuse of process. If we invoke the supreme law of the land, the courts should not wave it away to hurry toward execution.\" Alongside the allegations made to the court, both Chong-Aruldoss and Dodwell also called the AGC's statement \"self-serving\". Later on however, Dodwell retracted his allegations against the court, and issued a letter of apology to the [Supreme Court of Singapore](/wiki/Supreme_Court_of_Singapore), acknowledging the criticisms of his conduct after the AGC pointed out to him that certain allegations he had made were in contempt of court and entirely untrue. This apology was made public on Dodwell's Facebook page. ### Steven Chong's 2016 lecture On 15 November 2016, five months after the hanging of Kho Jabing, there was a lecture titled \"**Recalibration of the Death Penalty Regime: Origin, Ramifications and Impact**\", sponsored by a law firm (Withers KhattarWong), at its auditorium in [Raffles Place](/wiki/Raffles_Place). The lecture was attended by judges, academics and others from the legal industry, including [National University of Singapore](/wiki/National_University_of_Singapore) law students. The lecturer was Supreme Court Justice [Steven Chong Horng Siong](/wiki/Steven_Chong_Horng_Siong), who was previously the [Attorney-General of Singapore](/wiki/Attorney-General_of_Singapore) from 25 June 2012 to 25 June 2014 before his appointment as a judge in the [Supreme Court of Singapore](/wiki/Supreme_Court_of_Singapore). In his lecture, Justice Steven Chong said that while the amended laws are significant, they fall short of initiating \"any paradigm shift in policy\". He said it was an overstatement to say that the government had made a dramatic shift in its position on the mandatory death penalty (which remained so for all categories of murder for around 120 years before 2013). He said that there will still be an emphasis on deterrence regardless of any change in the area. Citing the case of Kho Jabing, Justice Chong stated that it was not an easy task to the exercising of discretion in capital cases, as there are challenges arising from many applications of re-sentencing since the 2013 law reforms. Regarding the 3-2 decision of the Court of Appeal (which led to Kho Jabing being sentenced to hang again), Justice Chong pointed out that the five-judge panel was unanimous on the principle involved and adopted even though it was \"divided on the outcome\". He noted that all five judges had agreed that in cases where the death penalty was not mandatory, a death sentence was justified if the offender's actions had \"outraged the feelings of the community\". Justice Chong also said it is arguable whether the Court of Appeal, in its 2015 decision, should have established a balance sheet of aggravating and mitigating factors, which could be taken into account in exercising discretion. The issue was the \"perennial tension\" between \"individualised justice and consistency in sentencing\": > The balance between the two is delicate. Incline too far in favour of the former, and you risk arbitrariness and capriciousness in sentencing; lean too far in favour of the latter, the benefits of individualised consideration brought about by the amendment Act would be lost. Justice Chong also did not neglect to make it clear that the courts would still have to examine all the facts and circumstances of every case to determine whether a death sentence is appropriate. He commented that the principle and approach adopted by the five-judge Court of Appeal in its 2015 judgement of Kho Jabing's case was the right one. ## Effect on other cases ### Singapore's death penalty guidelines for murder (2015–present) The outcome of the prosecution's appeal set the main guiding principles for judges to decide when the death penalty should be warranted - whether an offender had demonstrated a blatant disregard for human life or viciousness or both during the killing - and when it was inappropriate based on the circumstances of whichever murder case even without an intention to cause death. These cases include the [2010 Kallang slashing](/wiki/2010_Kallang_slashing), the [murder of Dexmon Chua Yizhi](/wiki/Murder_of_Dexmon_Chua_Yizhi), the [Circuit Road murder](/wiki/Circuit_Road_murder), the [Azlin Arujunah](/wiki/Azlin_Arujunah) case and the [Cui Yajie murder case](/wiki/Leslie_Khoo_Kwee_Hock). ### Re-opening of concluded criminal appeals Not only did Kho Jabing have an effect on Singapore's legal history through the death penalty, he also left behind a legacy for the requirements of reopening any concluded criminal appeals through the first of his three last-minute appeals made in November 2015, which effectively suspended his hanging. The Court of Appeal, in dismissing Kho's appeal in April 2016 (the month before Kho's execution in May), earlier ruled that the reviews of concluded criminal appeals would be allowed \"only in truly exceptional cases\" to avoid potential miscarriage of justice. - [Capital punishment in Singapore](/wiki/Capital_punishment_in_Singapore) - [Life imprisonment in Singapore](/wiki/Life_imprisonment_in_Singapore) - [Galing Anak Kujat](/wiki/Galing_Anak_Kujat), Kho Jabing's accomplice of the crime - [Yong Vui Kong](/wiki/Yong_Vui_Kong), a Malaysian from Sabah who, like Kho Jabing, also faced the death sentence in Singapore but subsequently re-sentenced to life imprisonment and 15 strokes of the cane. - [List of cases affected by the Kho Jabing case](/wiki/List_of_cases_affected_by_the_Kho_Jabing_case) - [Mathavakannan Kalimuthu](/wiki/Mathavakannan_Kalimuthu) - [Ronald Ebens](/wiki/Ronald_Ebens) ## Notes\n",
  "language": "en",
  "processed_at": "2026-01-12T11:18:00.865775",
  "title": "Kho Jabing",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Kho_Jabing"
}