{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:18:03.452008"
  },
  "content": "Singaporean poet (1874–1941)This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Khoo Sook Yuen\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(September 2017)* *(Learn how and when to remove this message)* **Khoo Sook Yuen** (1874 – December 1941) ([Chinese](/wiki/Simplified_Chinese_characters): 邱菽园) was a [Singaporean](/wiki/Singapore) [poet](/wiki/Poet). He penned more than a thousand poems and is historically considered an important figure in Chinese language poetry. ## Life and career Khoo Sook Yuen was born 1874 in [Changzhou](/wiki/Changzhou), [Fujian](/wiki/Fujian), [China](/wiki/China). His father, who died in 1907, was a rice merchant. The family relocated to Singapore when Khoo was only eight years old. Khoo took over his father's company in 1896 and with the profits, donated generously to the public. However, his ineptitude in business caused the company to fall into bankruptcy. Ridden in debt, Khoo became a newspaper writer. Khoo founded two newspapers – the *Tian Nan Xin Bao* with [Lim Boon Keng](/wiki/Lim_Boon_Keng) in 1898 and the *Zhen Nan Ri Bao* in 1912. He was also the editor of the [Sin Chew Jit Poh](/wiki/Sin_Chew_Jit_Poh_(Singapore)) from 1929. He was an enthusiastic poet and in his lifetime wrote more than 1,200 poetry works, all in the Chinese language. He had shown an interest in poetry in as early as his teenaged years; *The Jade Flute*, his first poem, was written when Khoo was fifteen. \"[E]asily one of the best poets in Singapore\", he is historically considered a major figure in Chinese poetry. He died in December 1941, aged 68. Khoo was a good friend of Reverend Swee Oi (瑞于上人), who founded Seng Wong Beo Temple (都城隍庙) at Peck Seah Street. Rev. Swee Oi was a former Qing dynasty's tributary scholar before he ordained as a monk, and both of them had strong interest in literary and poetry appreciation. Khoo was able to financially support Swee in the establishment of Seng Wong Beo Temple in 1905. After the Seng Wong Beo Temple was constructed, Khoo and Swee were known to have had lively conversations about poetry and art in the backyard. ## Bibliography - Lee, Khoon Choy (2013). *Golden Dragon and Purple Phoenix: The Chinese and Their Multi-Ethnic Descendants in Southeast Asia*. World Scientific. [ISBN](/wiki/ISBN_(identifier)) 978-981-4383-43-1. This article about a Singaporean poet is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:18:03.451592",
  "title": "Khoo Sook Yuen",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Khoo_Sook_Yuen"
}