{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:18:06.894963"
  },
  "content": "This article **does not cite any sources**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Kian Teck\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(December 2022)* *(Learn how and when to remove this message)*Subzone of Jurong West Planning Area in Singapore **Kian Teck** ([IPA](/wiki/International_Phonetic_Alphabet): /ˈkjɛn tɛk/ *KYEN tek*, [Chinese](/wiki/Chinese_language): 建德) is an area in Jurong Industrial Estate in Singapore. It is in between [Joo Koon](/wiki/Joo_Koon_MRT_station) and [Boon Lay](/wiki/Boon_Lay_MRT_station) stations. It is home to many dormitories which houses foreign workers as well as factories and warehouses. Arena Country Club is also located within the industrial estate. ## Bus Services These bus services plies Kian Teck area along Pioneer Road North, Upper Jurong Road, Kian Teck Road and International Road. All the bus services are operated by [SBS Transit](/wiki/SBS_Transit). Following the opening of [Joo Koon Bus Interchange](/wiki/Joo_Koon_Bus_Interchange) in late 2015, several bus routes were amended to better serve the industrial areas in the west and the updated list of bus services plying the Kian Teck area are shown below. - 252 plies along International Road - 99, 192 and 974 plies along Upper Jurong Road - 193, 251, 258, 258M, 185, 502 ply along Pioneer Road North with 185 and 502 terminating at the nearby [Soon Lee Bus Depot](/wiki/Soon_Lee_Bus_Depot), 258 and 258M plying [Pioneer station](/wiki/Pioneer_MRT_station) which is the nearest Mass Rapid Transit station from the precinct ## Mass Rapid Transit services The area is within walking distance to [Pioneer station](/wiki/Pioneer_MRT_station). This [Singapore](/wiki/Singapore) location article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:18:06.894420",
  "title": "Kian Teck",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Kian_Teck"
}