{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:18:10.631756"
  },
  "content": "Hokkien word for 'fear of losing' **Kiasu** ([simplified Chinese](/wiki/Simplified_Chinese_characters): 惊输; [traditional Chinese](/wiki/Traditional_Chinese_characters): 驚輸; [Pe̍h-ōe-jī](/wiki/Pe%CC%8Dh-%C5%8De-j%C4%AB): *kiaⁿ-su*) is a term derived from the [Hokkien](/wiki/Hokkien) “kia” meaning afraid and “su” meaning to lose. It is commonly defined as “the fear of losing,” and is directed at a person who behaves competitively to either attain their goal or to get ahead of others. The term has been part of the [Singlish](/wiki/Singlish) (formally known as Colloquial Singaporean English) lexicon spoken in [Singapore](/wiki/Singapore) since the 1980s. Since then, **Kiasuism** has settled into Singapore society and has become part of the cultural norms such as within the local education system or the queuing culture. Nevertheless, Kiasuism still exists in other countries, which have their own variation of the word. Acts of Kiasuism can be either positive or negative depending on the intent of the person committing the act and on the act's end result. Kiasuism has had a notable history since its move away from the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces) (SAF) army barracks to the streets of Singapore, from the emergence of *[Mr. Kiasu](/wiki/Mr._Kiasu)* to government attempts to curb Kiasuism. Others have considered Kiasuism as something positive and beneficial. Among others, factors include the mentality to drive many Singaporeans to work harder and strive for success, which helped the country to become one of the most prosperous and competitive countries in the world. This mindset has also fostered a culture of innovation and continuous improvement, encourage people to be prepared for any situation, and promote a culture of safety and risk management. This has led many Singaporeans to be careful and cautious, which has helped to improve overall safety in the country. ## Etymology and usage The word is derived from the [Hokkien](/wiki/Hokkien) language, with “kia” meaning “fear” and “su” meaning “to lose”. It is often used to denote an anxious and competitive attitude that arises from fear of missing out. It highlights one’s insistent want to be better than others. Kiasu can be used as an adjective in a “descriptive state” to describe a person who wants to get ahead of others. Kiasu can also be used as a verb to describe an action a person did out of fear of losing out, and as a “feeling state” when a person has the desire to act in a way that is kiasu. Kiasuism is the action noun form of kiasu. Kiasu is part of the vocabulary of Singapore's colloquial language, [Singlish](/wiki/Singlish). Singlish is an English-based creole language comprising vocabulary from Chinese languages such as Hokkien, Teochew, and Cantonese, as well as English and Malay, and to a lesser extent Tamil and Mandarin. The latter four are [Singapore’s four official languages](/wiki/Languages_of_Singapore). However, the language represents a homogeneous Singaporean way of thinking, rather than a mixture of the various cultures from which the specific languages originate. The word reflects a Singaporean mindset and has become ingrained in Singapore’s national culture. Kiasu is also similar in etymology to another Singlish term: *[kiasi](/wiki/Kiasi)* which literally translates to “fear of death”. Both terms are used to describe similar attitudes, but have almost opposite uses. *Kiasu* or *kiasuism* means taking extreme measures to achieve success, whereas *kiasi* or *kiasiism* means to take extreme, risk-avoidant measures. Academics have identified that kiasuism has two different types of tactics: “kiasu-positive” tactics and “kiasu-negative” tactics. Whether an act of kiasuism involves positive or negative tactics depends on the initial intention, the results of the act, and whether the amount of effort put into the kiasu tactic matches the intended result. Kiasu-positive tactics involve an individual using more effort to attain their goals, with the end reward justifying the means. Kiasu-negative tactics involve an individual gaining an advantage by putting others down, often harming themselves and others, with the end reward not justifying the means. ### Kiasu-like traits in other countries Studies conducted on residents of Australia and the United States have concluded that kiasuism exists outside of Singapore. A study conducted among Australians uncovered a lack of notable distinction between the “kiasu” behaviour in Singaporeans and Australians, meaning that kiasuism is not an exclusively Singaporean trait. The term “Par Chup Sue” ([simplified Chinese](/wiki/Simplified_Chinese_characters): 怕执输; [traditional Chinese](/wiki/Traditional_Chinese_characters): 怕執輸; [Jyutping](/wiki/Jyutping): *paa3 zap1 syu1*) from Hong Kong is a close synonym of kiasu; its literal translation is “scared to lose out”. Since kiasu is derived from a Chinese dialect, it is unsurprising that similar sentiments to kiasu are found in Chinese vocabulary and values. For instance, the Chinese phrase: “Don’t let your kids lose in the beginning” ([simplified Chinese](/wiki/Simplified_Chinese_characters): 不要让孩子输在起跑线上; [traditional Chinese](/wiki/Traditional_Chinese_characters): 不要讓孩子輸在起跑線上; [pinyin](/wiki/Pinyin): *bùyào ràng háizi shū zài qǐpǎoxiàn shàng*), has a similar meaning to kiasu. Internationally, terms like [FOMO](/wiki/Fear_of_missing_out#History) (fear of missing out) and hyper-competitiveness have been used in similar situations as kiasu. However, both terms are not direct synonyms. While both FOMO and kiasuism possess the compulsive want to be connected with others, FOMO lacks the competitive element of kiasuism. Hyper-competitiveness does share its competitive element with kiasu. However, hyper-competitiveness and FOMO are better defined as unintentionally “[maladaptive](/wiki/Maladaptation)” and hard to control while kiasuism is a controllable and intentional tactic to get above. A closer English synonym to kiasu is the idiom “[keeping up with the Joneses](/wiki/Keeping_up_with_the_Joneses)”. The *Merriam-Webster* dictionary defines this term as a person showing that they are \"as good as other people by getting what they have and doing what they do”. However, this term differs from kiasu in terms of compulsivity. The lack of close synonyms to kiasu outside of Chinese values and vocabulary can be attributed to Singapore being more attentive to kiasu tactics compared to other countries. ## History According to Annetta Ayyavoo and Brendan Tennakoon, the emergence of kiasu behaviour among Singaporeans is likely due to the country being an immigrant nation. Since immigrants typically lacked education and were of lower social classes, they had to be overtly competitive to earn a sufficient living. The word “kiasu” first emerged in the 1980s in its original form: “kian su”, and was used among men completing their compulsory [national service](/wiki/National_service_in_Singapore). “Kian su” was used to refer to soldiers who were afraid of failure. Eventually, kiasu entered the vocabulary of everyday Singaporeans. In the 1990s, the term was mostly used to describe negative tactics, particularly due to the increasing local and international popularity of the character Mr. Kiasu, who was known for his exaggerated kiasuism. The [Singapore government](/wiki/Government_of_Singapore) grew concerned that the rest of the world would have a negative image of Singaporeans. As such, the government began implementing methods to target and fix kiasuism. For instance, the 1993 edition of the government's [*National Courtesy Campaign*](/wiki/National_Courtesy_Campaign_(Singapore)) had the tagline “If we could only see ourselves sometimes”, in hope that the Singaporean population would make an effort to exhibit less kiasu behaviour. Furthermore, in a parliamentary debate in 1990, [Lee Siew-Choh](/wiki/Lee_Siew_Choh), a member of parliament, stated that he hoped that ministers would not fall ill with the “kiasu syndrome” which the government had been actively preaching against. This speech marked the first time the word “kiasu” was used in a parliamentary setting. Despite their efforts, the government still found kiasuism to be a problem past the 1990s. For example, during the 2012 National Day Speech, [Prime Minister Lee Hsien Loong](/wiki/Lee_Hsien_Loong), told the audience to be wary of “ugly Singaporean” behaviour in reference to kiasuism among other negative behaviours. Four years later, in 2016, a member of parliament claimed that kiasuism was inhibiting innovation in Singapore. Moreover, according to a National Values Assessment survey conducted in 2012 which surveyed 2000 people, “kiasu” and “competitive” appeared as the two highest answers on a list of how Singaporeans would label their society. Rather than purely viewing kiasuism as a negative behaviour, Singaporeans have begun to embrace kiasuism as part of their national identity. For example, in 2017, the supermarket chain Giant, sent out an online quiz to find out which town in Singapore was the most kiasu. The quiz received 57,000 entries, with Tampines winning the competition. As a prize, Giant gave away free goods such as milo and canned drinks to Tampines residents. Kiasu also reached prominence in its international status when it entered the online version of the *[Oxford English Dictionary](/wiki/Oxford_English_Dictionary)* (OED) in March 2007. In 2015, kiasu was OED’s Word of the Day. ## Cultural contexts In February 1989, the *Report of the Advisory Council on Youths* announced that kiasuism played an important role in shaping Singaporean youth’s perspective towards various facets of life such as education and work. While kiasuism is a behaviour taken on by an individual, this behaviour is also part of the Singaporean shared “cultural norm”. This means that in social situations where competition is required, Singaporeans would feel obliged to adopt a kiasu behaviour because they presume that everyone else would do so too. For example, the inflow of foreign talent into Singapore has convinced Singaporeans, collectively, of the need to be more competitive to be on top of their field of work. To match Singapore’s high quality of living, Singaporeans find themselves pressured to embrace kiasuism as a means to improve their studies, be eligible for benefits at their work, and have an ideal personal life. ### Education culture Kiasuism is noticed in regard to Singaporean attitudes towards education. Due to the elite nature of Singaporean society, success is often measured by how well one performs at school. Therefore, to get ahead of others and be successful, students perform kiasu acts such as the kiasu-negative tactic of [sandbagging](/wiki/Glossary_of_cue_sports_terms#sandbag). In the context of Singaporean schools, sandbagging refers to students lying that they have not studied much hoping it convinces other students to not put in too much effort. Other tactics include attempting to secure more and higher quality study materials and attending tuition, both of which can be seen as either positive or negative depending on intent. Many Singaporean parents equate kiasuism as a means of achieving academic excellence. Hence, children are pressured by their parents to be kiasu in order to be high scorers. For example, in 2014, the *[Singapore Department of Statistics](/wiki/Singapore_Department_of_Statistics)* found that almost S$1.1 billion was collectively spent on external tuition classes by parents every year to ensure that their children would fare better than other students. Moreover, a study in 1992 indicated that the percentage of students receiving private tuition rose from 19% in the early 1980s, to 32% by the 1990s. Parents would send their children of preschool age to enrichment classes as well, to provide them with a head-start against other students. Parents have also taken great measures to ensure that their children go to more reputable schools, such as by joining churches affiliated with the schools, donating large amounts to the schools, and lying about their home addresses. For example, in 2015, a couple provided a falsified home address that was 1km away from the school to secure a position for their child during Phase 2C of the Primary 1 registration exercise, which gave spaces to children who lived close to the school. ### Queuing culture Kiasuism also plays a primary role in Singapore’s queueing culture. A notable example of this queuing culture is seen from the “Hello Kitty fever” in 2019. When McDonald’s launched a limited edition carrier *[Hello Kitty](/wiki/Hello_Kitty)*, a famous Japanese fictional character, Singaporeans began to queue hours before the launch to be one of the first to get a carrier. To get around the limit of two carriers per transaction, some Singaporeans joined the queue a second time to purchase more of the good. According to interviews by *The New Paper*, customers revealed that they were unsure of what to do with the carrier after their purchase. Others were selling the carriers for more than five times the original price on [Carousell](/wiki/Carousell_(company)), an online community marketplace. Queuing culture highlights how kiasuism, particularly kiasu-negative tactics, has become a cultural norm in Singapore. An individual would get into a random queue they notice because the kiasu mindset ingrained within Singaporeans will convince them that the queue is for something valuable. Kiasuism makes people idly stand in lines just because they want to fit into the status quo and not lose out in what they perceive as an opportunity. ## In popular works “Kiasu” has also found itself used in popular Singaporean works, such as in its usage of the 1987 play: Army Daze. ### Mr. Kiasu The word is most prominently associated with the “Mr. Kiasu” comic book series published in the 1990s created by [Johnny Lau](/wiki/Johnny_Lau) and written by Yu Cheng and James Suresh. The book series followed the lead character, Mr. Kiasu, who was known for showcasing extreme kiasu tactics. Singaporeans were able to relate to the character because he was able to well-encompass the kiasu characteristic that many of them possessed, even if the character's kiasu tactics were exaggerated. Following the character’s quick success, McDonald’s worked with Lau to produce and promote the “kiasu burger” for a limited time in 1993, successfully selling 1.2 million burgers. Due to the books’ popularity, in 2001, the local broadcasting company, [Mediacorp](/wiki/Mediacorp), produced a live-action sitcom, \"Mr. Kiasu\", based on the books. There were also numerous pieces of merchandise of the character that was produced, such as mugs, watches, and stationery. - [Kiasi](/wiki/Kiasi) - [Chengyu](/wiki/Chengyu) - [Abundance mentality](/wiki/Endowment_(philosophy)) (antonym) ### Works cited - Thirumaran, K.; Foo, Koong Hean (2018). \"Kiasu - Who Isn't?\". *First Class Behaviours for First World Nations. Public behaviour in Singapore* (1. Auflage ed.). München. pp. 111–122. [ISBN](/wiki/ISBN_(identifier)) 978-3-668-86537-2. [OCLC](/wiki/OCLC_(identifier)) 1189314127.`{{cite book}}`: CS1 maint: location missing publisher (link) - Bedford, Olwen; Chua, Sheryl H (December 2018). \"Everything also I want: An exploratory study of Singaporean Kiasuism (fear of losing out)\". *Culture & Psychology*. **24** (4): 491–511. [doi](/wiki/Doi_(identifier)):10.1177/1354067X17693831. [ISSN](/wiki/ISSN_(identifier)) 1354-067X. [S2CID](/wiki/S2CID_(identifier)) 151574461. - Cheng, Chi-Ying; Hong, Ying-Yi (December 2017). \"Kiasu and Creativity in Singapore: An Empirical Test of the Situated Dynamics Framework\". *Management and Organization Review*. **13** (4): 871–894. [doi](/wiki/Doi_(identifier)):10.1017/mor.2017.41. [ISSN](/wiki/ISSN_(identifier)) 1740-8776. [S2CID](/wiki/S2CID_(identifier)) 148941347. - Ho, Janice T.S.; Ang, C.E.; Loh, Joanne; Ng, Irene (1 January 1998). \"A preliminary study of kiasu behaviour - is it unique to Singapore?\". *Journal of Managerial Psychology*. **13** (5/6): 359–370. [doi](/wiki/Doi_(identifier)):10.1108/02683949810220015. [ISSN](/wiki/ISSN_(identifier)) 0268-3946. - Kirby, Eric G.; Ross III, John K. (January 2007). \"Kiasu tendency and tactics: A study of their impact on task performance\". *Journal of Behavioral and Applied Management*. **8** (2): 108–121. [doi](/wiki/Doi_(identifier)):10.21818/001c.16716. - Ooi, Jackie Jie Qi (2013). \"A Singapore way of life : an investigation into kiasu-ism as a way of life\". `{{cite journal}}`: Cite journal requires `|journal=` (help) - Definition of kiasu in the Oxford Dictionary - See: **kiasu** from *A Dictionary of Singlish and Singapore English* Portals: - Society - Singapore\n",
  "language": "en",
  "processed_at": "2026-01-12T11:18:10.631300",
  "title": "Kiasu",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Kiasu"
}