{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:18:13.653316"
  },
  "content": "2010 Singaporean film ***Kidnapper*** ([Chinese](/wiki/Chinese_language): 绑匪; [pinyin](/wiki/Pinyin): *Bǎngfěi*) is a 2010 Singaporean [thriller](/wiki/Thriller_(genre)) film about a [kidnap](/wiki/Kidnap) set in [Singapore](/wiki/Singapore). The first action-thriller film made by [Kelvin Tong](/wiki/Kelvin_Tong), it was a joint venture between Scorpio East Pictures of Singapore and RAM Pictures and PMP Entertainment from [Malaysia](/wiki/Malaysia). Tong opted for a thriller film as opposed to a full-fledged action film as he felt this was more realistic in Singapore saying \"people here (in Singapore) don't run around with machine guns\". ## Plot Lim is a struggling 40-year-old taxi driver whose wife [divorced](/wiki/Divorce) him years ago. He has a close relationship with his son, Wei Xiang, whom he chauffeurs to school every day. Mistaken for a rich man's son, Wei Xiang is kidnapped one day at an [arcade](/wiki/Video_arcade) and held for a ransom of S$1 million. Thus begins one father's relentless quest to get his son back. Events begin with Lim and his son in a taxi, making attempts to guess the final fare on the taxi metre as they make their way through Singapore' jammed streets on the way to school. After school, Wei Xiang follows his friend to an arcade. He is then mistakenly kidnapped after donning his friend's cap. Upon realising that his son is kidnapped Lim is then made to race through Singapore to meet tight time frames in order to appease the kidnapper. ## Cast - [Christopher Lee](/wiki/Christopher_Lee_(Malaysian_actor)) - [Phyllis Quek](/wiki/Phyllis_Quek) This article related to a Singaporean film is a stub. You can help Wikipedia by expanding it. - v - t - e This article about an [action thriller](/wiki/Action_thriller) film is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:18:13.652922",
  "title": "Kidnapper (film)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Kidnapper_(film)"
}