{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:18:22.844184"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Kim Seng Road\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(September 2020)* *(Learn how and when to remove this message)*Place in Singapore **Kim Seng Road** ([Chinese](/wiki/Simplified_Chinese_characters): 金声路) is a street in Singapore that runs along the upper-easternmost portion of the [Bukit Merah](/wiki/Bukit_Merah)-[Central Area](/wiki/Central_Area,_Singapore) border. It was named after Peranakan philanthropist, [Tan Kim Seng](/wiki/Tan_Kim_Seng). Today, the boundaries of Kim Seng division are: Indus Road and Alexandra Canal in the north; Jalan [Bukit Ho Swee](/wiki/Bukit_Ho_Swee) in the south; Kim Seng Road and [Outram](/wiki/Outram,_Singapore) Road in the east; and Lower Delta Road in the west. It is served by the [Thomson–East Coast MRT line](/wiki/Thomson%E2%80%93East_Coast_Line) which opened on 13 November 2022. ## History & Etymology The Kim Seng Bridge on Kim Seng Road, the most westerly of the 9 bridges crossing the Singapore River, carries Kim Seng Road from [River Valley Road](/wiki/River_Valley_Road) to Havelock Road. It also marks the supposed source of the Singapore River, and its upper reaches flows as the Alexandra Canal. In 1857, [Tan Kim Seng](/wiki/Tan_Kim_Seng) donated $130,000 to improve the town's water supply and the Commissioners erected a water fountain (now located at the Esplanade) in 1882, in appreciation of his contribution. A road and [bridge](/wiki/Kim_Seng_Bridge) also bear his name. In the 1950s, Kim Seng and its neighbouring area, [Bukit Ho Swee](/wiki/Bukit_Ho_Swee) were a notorious crime-filled slum area with thousands of dilapidated huts. Squalid conditions affected the health and morale of residents. Two big fires in (/wiki/Bukit_Ho_Swee_Fire) and 1968 made 9,000 people homeless and changed all that. The burnt-out, rundown shacks were replaced by modern flats and people were rehoused in what became Bukit Ho Swee and Kim Seng Housing Estates. The newly established [Housing and Development Board](/wiki/Housing_and_Development_Board) ensured that the estate was self-sufficient, incorporating schools, business and social amenities in its design. The boundaries of Kim Seng Constituency have shifted over the years, due to population and re-zoning changes. The Kim Seng area was made a constituency only in 1972. Prior to this, the area was part of the Delta constituency. In 1991, Kim Seng was incorporated into the Kampong Glam Group Representation Constituency, together with the former single wards of [Kampong Glam](/wiki/Kampong_Glam), [Cairnhill](/wiki/Cairnhill) and Moulmein. The constituencies were therefore replaced by the [Kreta Ayer-Tanglin GRC](/wiki/Kreta_Ayer-Tanglin_GRC) (Kim Seng), followed by merging of Kreta Ayer into the [Jalan Besar GRC](/wiki/Jalan_Besar_GRC) and lastly the [Tanjong Pagar GRC](/wiki/Tanjong_Pagar_GRC). The road itself is now looked after by both Tanjong Pagar Town Council (Henderson-Dawson, the northern part of the road) and Jalan Besar Town Council (the rest of the road) (formerly City Centre Town Council and Tanjong Pagar Town Council). In the 1990s, the housing developments have been improved through the HDB's Main Upgrading Programme. Private developments include Tiara Condominium Apartments, Mirage Tower Apartments and King's Centre at the corner of Havelock Road. 2 new roads, Kim Seng Walk and Kim Seng Promenade, were created also. Former landmarks included the [Great World Amusement Park](/wiki/Great_World_Amusement_Park) with 2 movie theatres: the Sky and Globe built in the 1960s, the Times House, built in the early 1960s and demolished in April 2004 and redeveloped into a 36-storey high condominium, The Cosmopolitan, by Wheelock Properties. Current landmarks includes [Great World](/wiki/Great_World,_Singapore), a mixed retail and residential complex. The street gained Tan's name when he contributed financially to the building of the thoroughfare. He was known as the founder of the firm of Kim Seng & Co. and was a well-known philanthropist and businessman. In Hokkien, Hong Hin kio and its Cantonese variant Fung heng lo. which means \"Hong Hin Bridge\" where Hong Hin refers to the seal of Tan. ## Landmarks Famous landmarks in this constituency today include the Giok Hong Tian Temple (玉皇殿) (built in 1887), which is one of the most architecturally decorative and ornate temples in Singapore founded by prominent Hokkien leader [Cheang Hong Lim](/wiki/Cheang_Hong_Lim) (章芳林), and Hock Teck Tong Temple (福德堂) (built in 1921) which is related to the Tua Pek Kong Temple in [Kusu Island](/wiki/Kusu_Island). Both Giok Hong Tian Temple and Hock Teck Tong Temple are located along Havelock Road; the Chwee Hean Keng Temple (水显宫) (built in 1927) located on Zion Road was unfortunately demolished; and Great World, Former Kim Seng Plaza, Times House in Kim Seng Road. ## Sights & Attractions Located next to the [Singapore River](/wiki/Singapore_River), it is not uncommon to see tourists strolling along the pavements of the Kim Seng Road. As it is of close proximity to the chillout bars at colonial houses located in [Tiong Bahru](/wiki/Tiong_Bahru) and the Great World, visitors can also experience a taste of Singapore's heritage at those century-old temples. ## Bus routes Bus services 5, 16, 75, 175, 195 and 970 ply along Kim Seng Road (southbound) and Zion Road (northbound).\n",
  "language": "en",
  "processed_at": "2026-01-12T11:18:22.843675",
  "title": "Kim Seng Road",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Kim_Seng_Road"
}