{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:18:27.097904"
  },
  "content": "This article **may rely excessively on sources too closely associated with the subject**, potentially preventing the article from being verifiable and neutral. Please help improve it by replacing them with more appropriate citations to reliable, independent sources. *(August 2020)* *(Learn how and when to remove this message)*Medical college in Singapore **King Edward VII Medical College** (**KEMC**) was a [medical school](/wiki/Medical_school) from 1905 to 1949 in [Singapore](/wiki/Singapore), the first one in what was then [Malaya](/wiki/British_Malaya). It was officially named King Edward VII Medical College in 1921 and subsequently became the [Faculty of Medicine, University of Malaya](/wiki/Faculty_of_Medicine,_University_of_Malaya). ## History The establishment of [King Edward VII](/wiki/Edward_VII) Medical College began with the issue of the shortage of [medical](/wiki/Medical) and [public health](/wiki/Public_health) assistants in [Singapore](/wiki/Singapore) and [Penang](/wiki/Penang) and elsewhere in the [Straits Settlements](/wiki/Straits_Settlements) in the late 1890s. This problem was voiced by the [Board of Education](/wiki/Board_of_Education) in April 1902. Thus, the prospect of its own establishment emerged from among the board members. The King Edward VII Medical College of Medicine was established in 1905 as a [tertiary institution](/wiki/Tertiary_institution), and is also the original parent or pioneer college to the establishment of the [University of Malaya](/wiki/University_of_Malaya) in [Kuala Lumpur](/wiki/Kuala_Lumpur) and the [National University of Singapore](/wiki/National_University_of_Singapore) in Singapore. In a report issued by the Board of Education in 1902, members of the board agreed to set up the first medical college in both the [Straits Settlements](/wiki/Straits_Settlements) and [Malaya](/wiki/British_Malaya) at that time to meet the needs of medical assistants in government hospitals. However, this desire was not liked by many in the British community within those territories. Specific legislation on the establishment of colleges was approved by the Legislative Board of the Straits Settlements in June 1905 under Ordinance No. XV 1905. Officially, the medical college was opened on 3 July 1905 and operates in September. On 8 September 1905, Sir John inaugurated the establishment of the college under the name 'The Straits and Federated Malay States Government Medical School.' At the beginning, it was located at the old Women's Lunatic Asylum near the Singapore General Hospital near Sepoy Lines off New Bridge Road, where four asylum buildings were operating to become medical schools. In 1907, a lecture hall and medical laboratory were added. However, due to limited space, there is no library and a special room to house clinical pathology specimens. One of the historic buildings that are synonymous with the Government Medical School Malay States and the Straits, is the Tan Teck Guan Building, along with the connection Building Medical College (Singapore), the remains of history is the most significant in the history of medical education in Singapore. This is where the beginning of the Singapore medical school where it trains local students in the knowledge of Western medicine. In 1905, the college housed about 16 medical students, 4 of whom majored in medical assistants in hospitals. In 1910, applications increased to 90 medical students and 30 medical assistants in hospitals. There is only one permanent staff, the Principal of the college, while the lecturer is taken part-time from the medical doctor. The principal of the college is Gerald Dudley Freer, he is a Senior Colonial Resident Surgery in Penang. In 1910, Robert Donald Keith was appointed the second Principal of the College. For the first 2 years of the 5 years of medical studies at the College, students are required to study pure science subjects which include biology, chemistry and physics, followed by the study of basic anatomy and physiology of medicine. For the second 3 years, it is compulsory to study clinical clerical knowledge in the fields of medicine, surgery and general midwifery. Course titles include courses in medical pathology, hygiene and medical legal ethics. Materia Medica has been included in 4 years of study in pharmacy education. Students were also sent for clinical training at several hospitals, but most were at the Singapore General Hospital in the early stages. Beginning in 1908 and above, clinical training was conducted at Tan Tock Seng Hospital (for medical and surgical training) and the Buffalo Cage Children's and Women's Hospital (for midwifery). The College Board wants to ensure that appropriate recognition is given for the Diploma offered at the College, equivalent to the Diploma issued by the General Board of Medical Education in the United Kingdom. This is important so that the Diploma offered by the College is in line with the global market equivalent to the Diploma in Medical and Surgical Licensing (LMSD) qualification. In 1916, the General Board of Medical Education, United Kingdom recognized the College's Diploma in Medicine and Surgery. Licensing was granted under the List of General Colonial Boards for the Registrar of British Medicine and legally certified for practice throughout the British Empire. In 1912, the school received initial financial funding of $120,000 from the King Edward VII Memorial Foundation started by Lim Boon Keng. Since then, the school was renamed King Edward VII Medical College on November 18, 1913. In 1921, this medical school received recognition of college status. Between the years, 1920 to 1930, a transformation plan took place in the college management, where the administrators changed the previous staff to a younger generation of professionals and 9 new seats were established. First in the field of Anatomy in 1920, followed by Medicine, Surgery, Midwifery and Gynecology in 1922 and Clinical Surgery, Bacteriology, Biology, Biochemistry, and Dental Surgery, in 1926. Pathology chair was published in 1935. In 1923, the College of moved to its building on Outram Road. The building was completed in November 1925 and the opening was inaugurated by Sir Laurence Guillemard in February 1926. During the inauguration ceremony, the College awarded Honorary Diploma Degrees to Sir David James Galloway, [Malcolm Watson](/wiki/Malcolm_Watson) and Lim Boon Keng. In 1929, [George V. Allen](/wiki/George_Vance_Allen) was appointed the new Principal of the College replacing [G. H. K. Macalister](/wiki/G._H._K._Macalister). Beginning in 1949, four years after the end of [World War II](/wiki/World_War_II), King Edward VII Medical College merged with Raffles College (Singapore) under one administration to form the University of Malaya. Through this merger, King Edward VII Medical College was upgraded to become the [Faculty of Medicine, University of Malaya](/wiki/Faculty_of_Medicine,_University_of_Malaya). Desmond William G. Faris was the last principal of the medical college, and the first dean of the new university's faculty of medicine. - [Faculty of Medicine, University of Malaya](/wiki/Faculty_of_Medicine,_University_of_Malaya)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:18:27.097516",
  "title": "King Edward VII College of Medicine",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/King_Edward_VII_College_of_Medicine"
}