{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:18:28.612154"
  },
  "content": "Singaporean journalist and social activist **A major contributor to this article appears to have a close connection with its subject.** It may require cleanup to comply with Wikipedia's content policies, particularly neutral point of view. Please discuss further on the talk page. *(December 2025)* *(Learn how and when to remove this message)* **Kirsten Han Li Ying** ([Chinese](/wiki/Simplified_Chinese_characters): 韩俐颖; [pinyin](/wiki/Pinyin): *Hán Lìyǐng*; born 11 November 1988) is a Singaporean journalist and social activist. In 2017, she co-founded the Malaysian-based online journalism platform *[New Naratif](/wiki/New_Naratif)* with [Sonny Liew](/wiki/Sonny_Liew) and [Thum Ping Tjin](/wiki/Thum_Ping_Tjin), and served as its editor-in-chief till March 2020. ## Activism Han is mostly known for her criticism of the [People's Action Party](/wiki/People%27s_Action_Party), the current governing party of Singapore, and its policies. She has advocated against [capital punishment](/wiki/Capital_punishment_in_Singapore) and co-founded We Believe in Second Chances, an anti-death penalty organisation in Southeast Asia, in 2010; in March 2018, she wrote an [op-ed](/wiki/Op-ed) in *[The New York Times](/wiki/The_New_York_Times)* titled \"What Trump Is Learning From Singapore — and Vice Versa\", in which she claimed that Singapore was \"an authoritarian paradise\" and that \"(b)oth the [Trump administration](/wiki/First_presidency_of_Donald_Trump) and the Singapore government have little time for human rights\". Writing for the American magazine *[Foreign Policy](/wiki/Foreign_Policy)* in May 2020 as the [COVID-19 pandemic](/wiki/COVID-19_pandemic) was in its earnest, Han criticised the government's alleged \"utilitarian, dehumanising approach\" to the [COVID-19 pandemic in Singapore](/wiki/COVID-19_pandemic_in_Singapore), such as mandatory mask wearing and strict [contact tracing](/wiki/Contact_tracing). In October 2021, while defending the proposed [Foreign Interference (Countermeasures) Act](/wiki/Foreign_Interference_(Countermeasures)_Act) (FICA), [Minister for Home Affairs](/wiki/Minister_for_Home_Affairs_(Singapore)) [K. Shanmugam](/wiki/K._Shanmugam) accused Han of \"actively trying to put out misinformation\" and cited her 2018 meeting with Malaysian Prime Minister [Mahathir Mohamad](/wiki/Mahathir_Mohamad), during which he claimed that she is engaging in foreign interference having \"(urged) him to bring democracy to Singapore\". Han was later served with a correction order under the [Protection from Online Falsehoods and Manipulation Act](/wiki/Protection_from_Online_Falsehoods_and_Manipulation_Act) (POFMA), asking her to correct false statements and misquoting Shanmugam. In May 2022, Han published a post of Facebook stating that costs orders made against lawyers representing persons on death row were \"acts of intimidation that deter other lawyers\", and will create a \"more brittle system in which it will become even more likely that wrongful executions and miscarriages of justice will occur. In October 2022, Han was issued a warning stating that the Attorney-General's Chambers found that Han's post amounted to contempt of court. Han applied to the Singapore courts to quash the warning issued to her. In May 2023, the High Court of Singapore dismissed her application and found that the warning had no legal effect and was not susceptible to judicial review. ## Personal life Han was born and raised in Singapore. She went to the United Kingdom to attend university, where she met a Scottish man named Calum Stuart and married in Scotland in 2014. Han has also described herself as a [feminist](/wiki/Feminism). - Official website - Stories behind the death penalty in Singapore | Kirsten Han | TEDxNUS\n",
  "language": "en",
  "processed_at": "2026-01-12T11:18:28.611605",
  "title": "Kirsten Han",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Kirsten_Han"
}