{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:18:30.917897"
  },
  "content": "School in Singapore**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*The topic of this article **may not meet Wikipedia's notability guidelines for companies and organizations**. Please help to demonstrate the notability of the topic by citing reliable secondary sources that are independent of the topic and provide significant coverage of it beyond a mere trivial mention. If notability cannot be shown, the article is likely to be merged, redirected, or deleted. *Find sources:* \"Knightsbridge House International School\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(November 2025)* *(Learn how and when to remove this message)*This article **relies excessively on references to primary sources**. Please improve this article by adding secondary or tertiary sources. *Find sources:* \"Knightsbridge House International School\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(November 2025)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* **Knightsbridge House International School**, founded in August 2021 in [Singapore](/wiki/Singapore) by John Fearon, is an independent [co-educational international school](/wiki/Co-educational_school) with the Cambridge [IGCSE](/wiki/International_General_Certificate_of_Secondary_Education) [curriculum](/wiki/Curriculum). Initially located on the [Sentosa](/wiki/Sentosa) [campus](/wiki/Campus), the school moved to the [Bukit Merah](/wiki/Bukit_Merah) campus in January 2022. In August 2025, Knightsbridge House expanded with a new campus in Changi. ## History Knightsbridge House International School started operations in August 2021 at its Sentosa campus. In January 2022, Knightsbridge House International School inaugurated a campus in Bukit Merah Central, Singapore. The school received the best MidYIS Cambridge results globally as a school in 2023. In 2024, Knightsbridge House International School obtained [accreditation](/wiki/Educational_accreditation) from [Cambridge](/wiki/University_of_Cambridge). In August 2025, the school launched its Changi campus to accommodate growing enrolment. By September 2025, Knightsbridge House International School had expanded to serve more than 500 students from Year 1 through Year 11, reflecting significant growth since its establishment in 2021. ## Overview Knightsbridge House International School delivers the Cambridge [International General Certificate of Secondary Education](/wiki/International_General_Certificate_of_Secondary_Education) (IGCSE) curriculum. With campuses at Bukit Merah Central and Changi Business Park in Singapore, the school serves more than 500 students from Year 1 to Year 11. It is managed by its founder, John Fearon. Knightsbridge House International School provides education for Year 1 to Year 11 students, with a bilingual [Mandarin](/wiki/Mandarin_Chinese) program, an English medium program. Students Year 1-11 follow the Cambridge Curriculum. School has Cambridge Primary curriculum for students age 5–11, Cambridge International Lower Secondary Curriculum for lower secondary school (age 11–13) and Cambridge International General Certificate of Secondary Education for upper secondary school (age 14–16). - Singapore portal - Schools portal - [List of international schools in Singapore](/wiki/List_of_international_schools_in_Singapore) This Singapore school-related article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:18:30.917426",
  "title": "Knightsbridge House International School",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Knightsbridge_House_International_School"
}