{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:18:41.228594"
  },
  "content": "Singaporean engineer and civil servant **Koh Yong Guan** [PJG](/wiki/Pingat_Jasa_Gemilang) (born 9 June 1946) is a former Singaporean engineer and civil servant, and served as the permanent secretary for the [Ministry of Health](/wiki/Ministry_of_Health_(Singapore)) from 1996 to 1999, and the [Ministry of National Development](/wiki/Ministry_of_National_Development_(Singapore)) in 2001. Koh served as chairman of the [Singapore Turf Club](/wiki/Singapore_Turf_Club) (2001–2008), [Central Provident Fund](/wiki/Central_Provident_Fund) (2001; 2005–2013), Singapore Island Country Club (2002–?), and [SMRT Corporation](/wiki/SMRT_Corporation) (2009–2017). Koh also served as director of [Keppel](/wiki/Keppel_Ltd.) in 1996, and managing director of the [Monetary Authority of Singapore](/wiki/Monetary_Authority_of_Singapore) (1998–2001; 2001–2005). ## Early life and education On 9 June 1946, Koh was born in [Singapore](/wiki/Colony_of_Singapore). He received his early education at [Siglap Secondary School](/wiki/Meridian_Secondary_School#Siglap_Secondary_School_(1955–2016)), and obtained a [Senior Cambridge](/wiki/Senior_Cambridge) in 1964. Thereafter, Koh studied at [Raffles Institution](/wiki/Raffles_Institution). A [Colombo Plan](/wiki/Colombo_Plan) scholar, Koh studied at the [University of Toronto](/wiki/University_of_Toronto), obtaining a [Bachelor of Applied Science](/wiki/Bachelor_of_Applied_Science) in [mechanical engineering](/wiki/Mechanical_engineering) in 1970, and a [Master of Applied Science](/wiki/Master_of_Applied_Science) in mechanical engineering and [biomedical engineering](/wiki/Biomedical_engineering) in 1972. In 1981, Koh graduated from the [Katholieke Universiteit Leuven](/wiki/Katholieke_Universiteit_Leuven) with a [Master in Business Administration](/wiki/Master_in_Business_Administration). ## Career Upon returning to Singapore in 1972, Koh joined the [Ministry of Health](/wiki/Ministry_of_Health_(Singapore)) (MOH) as a biomedical engineer. In 1979, he was transferred to the administrative service, serving in the [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)). In January 1980, as the head of recruiting foreign talent, Koh was sent to the [High Commission of Singapore in London](/wiki/High_Commission_of_Singapore,_London) to conduct a recruitment drive for British teachers to teach in Singapore. More than 300 teachers responded, and Koh was involved in interviewing and shortlisting the candidates. In July 1980, the first batch of 45 expatriate teachers arrived in Singapore. In 1986, Koh was transferred to the [Ministry of Defence](/wiki/Ministry_of_Defence_(Singapore)) (MINDEF). On 1 May 1989, Koh was appointed as its second permanent secretary, assisting [Lim Siong Guan](/wiki/Lim_Siong_Guan). To address the shortage of available training area for the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces), Koh announced the usage of [Pulau Sudong](/wiki/Pulau_Sudong) for training exercises from September 1990. On 10 January 1991, Koh was appointed as commissioner of the [Inland Revenue Authority of Singapore](/wiki/Inland_Revenue_Authority_of_Singapore) (IRAS), replacing Hsu Tse Kwang. In August 1992, during the first convocation ceremony at [Nanyang Technological University](/wiki/Nanyang_Technological_University), Koh gave a speech to more than 400 accountancy graduands, reminding them that [creative accounting](/wiki/Creative_accounting) will not be condoned. > Scheming and contriving to avoid paying a fair share of tax is certainly not in the public interest. Accountants must be conscious of their ethical and moral responsibilities to the community at large. Accountants and the integrity of our accounting profession are important ingredients. They are key factors in our ability to maintain our reputation. It contributes to the confidence which investors have in doing business with us. But, ultimately, what determines the integrity of the profession is the personal integrity and accountability of the individuals who make the profession. After his speech, companies such as Straits Steamship Land (now known as [Keppel Land](/wiki/Keppel_Ltd.)) released financial statements with changes to their accounting policy. In late 1992 and early 1993, to help businesses understand and file tax returns easily, Koh launched a new publication to help clarify tax laws, and announced new measures such as a one-stop service branch and computer-assisted appraisal system to improve efficiency. On 1 June 1996, Koh was appointed as the second permanent secretary for MOH, assisting Kwa Soon Bee. On 5 September 1996, Kwa retired from the civil service, and Koh succeeded him on the next day. Shortly after, Koh announced that salary and promotion criteria for senior doctors will be reviewed to match with the private sector. On 1 April 1997, Koh was given an additional portfolio of second permanent secretary for the [Ministry of Finance](/wiki/Ministry_of_Finance_(Singapore)), assisting [Ngiam Tong Dow](/wiki/Ngiam_Tong_Dow). In addition, Koh relinquished his position at IRAS to [James Koh Cher Siang](/wiki/James_Koh_Cher_Siang). On 1 January 1998, Koh was appointed as managing director of the [Monetary Authority of Singapore](/wiki/Monetary_Authority_of_Singapore) (MAS). To act against any speculative attack on the [Singapore dollar](/wiki/Singapore_dollar), Koh said that Singapore operated on a [floating exchange rate](/wiki/Floating_exchange_rate) policy, and MAS will intervene in the foreign exchange market to ensure the Singapore exchange rate remains consistent with its policy. In August 1998, Koh officiated the launch of the [MAS Electronic Payment System](/wiki/MAS_Electronic_Payment_System), facilitating interbank transfers. In preparation for the [Year 2000 problem](/wiki/Year_2000_problem), Koh declared 31 December a bank holiday. On 1 April 2000, Koh was appointed as deputy chairman of the [Singapore Turf Club](/wiki/Singapore_Turf_Club) (STC), assisting chairman Herman Ronald Hochstadt. On 1 April 2001, [Tharman Shanmugaratnam](/wiki/Tharman_Shanmugaratnam) replaced Koh as managing director of MAS, and Koh was appointed as permanent secretary for the Ministry of National Development, while still remaining on the MAS board. On 1 July 2001, Koh became the chairman of STC. On 1 August 2001, Koh succeeded Ngiam as chairman of the [Central Provident Fund](/wiki/Central_Provident_Fund) (CPF). On 21 October 2001, Tharman resigned from MAS to contest in the [2001 general election](/wiki/2001_Singaporean_general_election) as a candidate for the [People's Action Party](/wiki/People%27s_Action_Party), and Koh assumed his position. On 1 January 2002, [Moses Lee Kim Poo](/wiki/Moses_Lee_Kim_Poo) succeeded Koh as chairman of CPF. On 31 May 2005, Koh retired from the civil service and stepped down as managing director of MAS, with [Heng Swee Keat](/wiki/Heng_Swee_Keat) as his replacement. The next day, Koh replaced Lee as chairman of CPF. On 1 April 2008, Koh stepped down as chairman of the STC, with Tan Guong Ching as his successor. ## Diplomatic career In January 2008, Koh was appointed as High Commissioner to Canada, while residing in Singapore. In July 2009, Koh succeeded Choo Chiau Beng as chairman of [SMRT Corporation](/wiki/SMRT_Corporation). In December 2011, major disruptions occurred along the [North-South MRT line](/wiki/North%E2%80%93South_Line_(Singapore)), and Koh apologised on behalf of the board: > My colleagues and I take the disruptions and inconveniences caused to our train passengers last week very seriously. The board will spare no effort and resources to ensure that SMRT earns back the confidence of the commuters and public. We apologise to the travelling public for the disruptions and inconveniences in the last week. In May 2013, Koh was appointed as a non-resident ambassador to the [Greece](/wiki/Greece). On 1 July 2013, Koh stepped down as chairman of CPF. In July 2017, he stepped down as chairman of SMRT, and [Seah Moon Ming](/wiki/Seah_Moon_Ming) succeeded Koh. In January 2020, [Simon Tay](/wiki/Simon_Tay) replaced Koh as ambassador. ## Personal life Koh is married to Helen with two sons. ## Awards and decorations - [Meritorious Service Medal](/wiki/Pingat_Jasa_Gemilang), in 1995.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:18:41.228132",
  "title": "Koh Yong Guan",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Koh_Yong_Guan"
}