{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:18:43.244505"
  },
  "content": "This article **may incorporate text from a large language model**. It may include [hallucinated](/wiki/Hallucination_(artificial_intelligence)) information, copyright violations, claims not verified in cited sources, original research, or fictitious references. Any such material should be removed and content with an unencyclopedic tone should be rewritten. *(September 2025)* *(Learn how and when to remove this message)*Singaporean brand of instant noodles **Koka** (可口) is a [Singaporean](/wiki/Singapore) brand of [instant noodles](/wiki/Instant_noodles) manufactured by Tat Hui Foods Pte. Ltd., a company founded in 1986. The noodles are available in a variety of flavors, including packets, bowls, and cup noodles. ## History Founded in 1986 in Singapore, Tat Hui Foods Pte. Ltd. manufactures Koka noodles, which have been sold domestically and exported worldwide since 1987. They have become a leading brand in Ireland, distributed by Boyne Valley Foods, where they compete with Unilever's [Pot Noodle](/wiki/Pot_Noodle). ## Manufacturing Koka's products are manufactured and packaged in Tat Hui's factory in [Jurong](/wiki/Jurong), Singapore. Their noodles are air-dried rather than deep-fried in the usual Asian manner. ## Products Koka offers a wide range of instant noodle products, including: - **KOKA Original:** Chicken, Curry, Masala, Mi Goreng, Mushroom, Prawn, Spicy Stir-Fried, Tom Yum, Tomato, Vegetable, and Beef flavors. - **KOKA Original Noodle Bowls:** Mushroom, Chicken, Seafood, Tom Yum, and Beef flavors. - **KOKA Original Noodle Cups:** Chicken & Corn, Mushroom, Curry, Seafood, Tom Yum, Vegetable, Beef, Chicken, and Tomato flavors. - **KOKA Signature (Authentic Singapore):** A range of noodles that incorporate Singapore's favorite herbs and spices. - **KOKA Delight:** Low-fat noodles. - **KOKA Silk:** Gluten-free noodles. - **KOKA Purple Wheat:** Antioxidant-rich noodles made with Peruvian purple corn. - **KOKA Creamy Soup:** A range of soups containing noodle croutons. - [List of instant noodle brands](/wiki/List_of_instant_noodle_brands) - Official website Portals: - Food - Singapore\n",
  "language": "en",
  "processed_at": "2026-01-12T11:18:43.244073",
  "title": "Koka (brand)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Koka_(brand)"
}