{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:18:46.780349"
  },
  "content": "Religious leader and convicted criminal in Singapore **Kong Hee** ([Chinese](/wiki/Chinese_language): 康希; [pinyin](/wiki/Pinyin): *Kāng Xī*; born 23 August 1964) is the founder and senior pastor of [City Harvest Church](/wiki/City_Harvest_Church). He was convicted in 2015 of being involved in the [City Harvest Church Criminal Breach of Trust Case](/wiki/City_Harvest_Church_Criminal_Breach_of_Trust_Case), Singapore's biggest case in misuse of charitable funds. He was seen to be the \"key man\" behind the scandal who had guided his five accomplices by the Singapore court of three charges of criminal breach of trust. Although Kong and the five were guilty of serious breaches, the court noted that the $50 million was also ultimately returned to the church. He served his sentence at Changi Prison Complex from 21 April 2017 to 22 August 2019. Kong is also involved in the Christian [Charismatic Movement](/wiki/Charismatic_Movement), a philosophy of ministry that emphasises the [Great Commandment](/wiki/Great_Commandment), the [Great Commission](/wiki/Great_Commission) and the [Cultural Mandate](/wiki/Cultural_Mandate). ## Early life Kong is the fifth child of Kong Leng, a [professional engineer](/wiki/Professional_engineer), and Toh Poh-Eng, a diamond trader. From 1975 to 1988, Kong was a member of Marine Parade Christian Centre, an [Anglican church](/wiki/Anglican_church) located in eastern Singapore. He studied at [Raffles Institution](/wiki/Raffles_Institution) (1977–1981), [Raffles Junior College](/wiki/Raffles_Junior_College) (1982) as well as [National University of Singapore](/wiki/National_University_of_Singapore), Bachelor of Science (Computer & Information Sciences) (1985–1988). During his university years, he worked part-time for the [Chapel of the Resurrection](/wiki/Chapel_of_the_Resurrection) under the oversight of Anglican vicar, Reverend Dr. Canon James Wong. During that tenure, he helped Canon Wong set up a new congregation, Orchard Christian Centre. Upon university graduation in 1988, Kong worked a short stint in a local publishing house as a programmer. In 1989, Kong was a staff evangelist with \"Christ For Asia\", a missions organisation in the [Philippines](/wiki/Philippines) led by [Assemblies of God](/wiki/Assemblies_of_God) minister, Reverend Randy Sing. At that same time, there was an opportunity for Kong to pioneer a new church in Singapore. With the support and encouragement of some senior pastors in the city, Kong decided to relocate back to Singapore and helped set up a new congregation with 20 youths. ## City Harvest Church On 7 May 1989, City Harvest Church was founded as a department (known as \"Ekklesia Ministry\") of Bethany Christian Centre (Assemblies of God). From 1997, Kong was the executive director of the [Festival of Praise](/wiki/Festival_of_Praise), an annual event that brought together churches for united prayer and worship.[*needs update?*] Kong was a board member of Dr. [David Yonggi Cho](/wiki/David_Yonggi_Cho)'s Church Growth International (South Korea) and Dr. [Luis Bush](/wiki/Luis_Bush)'s Transform World (Indonesia). Kong is a protege, friend and mentee of [Phil Pringle](/wiki/Phil_Pringle), the founder and senior pastor of [C3 Church Global](/wiki/C3_Church_Global) (Australia) and advisory pastor to City Harvest Church. With his wife [Sun Ho](/wiki/Sun_Ho), they once owned two companies, International Harvest and Skin Couture. In December 2010, City Harvest Church had an average of 23,256 attendees with 47 affiliate \"Harvest\" churches, as well as 29 affiliate churches and 6 Bible schools in Asia, namely, in Singapore, Australia, Indonesia, Malaysia and Taiwan. Another 18 affiliate churches in East and West Malaysia are under the Malaysian Harvest Fellowship which Kong Hee co-founded. ## Conviction ### Investigations On 31 May 2010, the Office of the Commissioner of Charities and the [Commercial Affairs Department](/wiki/Commercial_Affairs_Department) of the Singapore Police began investigating more than 16 individuals linked to City Harvest Church, including church founder Kong Hee and his wife, [Sun Ho](/wiki/Sun_Ho). The police were looking into financial transactions involving the possible falsification of accounts and criminal breach of trust amounting to millions of dollars which dated back a number of years. The authorities allowed regular church activities and services to continue for the congregation during ongoing investigations. On 26 June 2012, the Commissioner of Charities released a press statement detailing the results of its inquiry. It stated that there were misconduct and mismanagement in the administration of City Harvest Church. There were irregularities of at least $23 million in the church's funds, which were used to finance [Sun Ho](/wiki/Ho_Yeow_Sun)'s secular music career. There was also a concerted effort to conceal this movement of funds from stakeholders. Kong Hee and seven others were suspended from their roles in the church. A subsequent report indicated that the investigations were trigged by complaints made to the authorities. ### Arrests and charges Also on 26 June 2012, Kong Hee and four other leaders of City Harvest Church were arrested and charged with misuse of funds. A sixth leader was charged on 25 July 2012. All six accused were granted bail of S$500,000 and had their passports impounded. ### Trial and conviction The trial of Kong Hee and the five other leaders commenced in May 2013 and was adjourned several times. There was a total of 142 days of hearings. The verdicts were announced on 21 October 2015. Kong Hee and the other five leaders were found guilty of all charges. Sentencing was on 20 November 2015. Kong Hee received the heaviest sentence of the six, 8 years in prison. Following a request from the defendants, the judge agreed to defer the start of the sentences until 11 January 2016. ### Related decisions In 2017, the Commissioner of Charities permanently barred the six in the case, with two additional church executive members, Kelvin Teo Meng How and Tan Su Pheng Jacqueline, from holding key management positions or being a board member in City Harvest Church or any other charity. Additionally the church was barred from paying the legal fees for the six. However, they were still allowed to perform their religious activities. ### Appeals On 27 November 2015, it was reported that the Attorney General's Chambers had filed appeals against the sentence issued to Kong Hee and the five other defendants, on the grounds that it was \"manifestly inadequate\". On 2 December 2015, it was reported that Kong Hee and the other five defendants had also filed appeals. On 4 March 2016, it was reported that the appeal hearing would commence on 19 September 2016. On 7 April 2017, his original sentence of 8 years in prison was reduced to 3.5 years. In delivering their decision, the judges noted that there was no element of wrongful gain or personal financial benefit, either direct or indirect. The Court of Appeal acknowledged that “The theological legitimacy of the Crossover as a means of evangelism is not an issue in this case.” (Para 1) “The Crossover – which is central to the entire case – is an evangelistic endeavour to spread the gospel through the secular music of Sun Ho. It is not disputed that the Crossover had the full support of the CHC Board.” (Para 21) Pages 264-267 of the appeal judgement characterised Kong as \"coloured by greed and self-interest\", as the Crossover project appeared to have been designed to benefit Sun Ho and Kong Hee. Sun Ho's contract with Xtron (a company controlled by Kong Hee) was to entitle Sun to 25% of gross income (estimated to reach US$30M[*citation needed*]) regardless of project costs, in addition to a monthly salary of US$10,000. However, this contract between Sun Ho and Xtron was terminated in August 2008. In addition, he had told members they were off-salary from the church. A private fund was set up to and raised over $3 million “to fund the [Crossover] Project” and was fully expended in just 3 years for the purposes of the Project. Kong Hee began serving his sentence on 21 April 2017. ### Comments by the Minister for Law Expressing his disappointment by the Court of Appeal's decision to overrule a 1976 High Court decision, which had held that company directors could be convicted for criminal breach of trust under section 409 of the Penal Code, [Minister for Law](/wiki/Minister_for_Law) [K Shanmugam](/wiki/K_Shanmugam) said, “The government believes the sentences are too low. But the sentences reflect the law as it stands after the High Court’s decision last year confirmed by the Court of Appeal. The courts decide these matters. All of us have to respect the decision regardless of whether we agree or disagree with it.” “It is now up to Parliament to amend the law, and that we should do soon. We will ensure that legislation provides for higher penalties for directors and other senior officers who commit criminal breach of trust,” he added. ### Release On 22 August 2019, Kong Hee was released from prison, having served 2 years and 4 months of the sentence. Inmates typically serve two-thirds of their sentence before released on remission for good behaviour. In his first appearance at the church after his release, Kong delivered a four-minute speech apologising to church members for \"any pain, anxiety, disappointment, or grief that you have suffered because of me\". ## Controversies ### Plagiarism In March 2010, a blogger identified plagiarism on Kong Hee's *Daily Devotionals* as they were similar to writings in another publication, *The Leadership Bible* which had been published ten years prior. The copied text were published as physical copies into two books, *Renewing Your Spiritual Energy in 90 Days*, without accreditation to the original authors. Kong Hee's daily devotionals were originally compiled from his personal reading notes and printed as supplementary reading for his members, free of charge. Some years later, due to popular demand overseas, a local publisher compiled and released foreign language translations of the devotional for sale.[*citation needed*] Kong Hee posted a note on his website and explained that the devotion was \"originally meant only for internal circulation among the members of my church. As such, there was an oversight in not quoting the sources of some portions that borrow from the writings of other Christian authors.\" There was also an apology for the oversight. The publisher, who is also a member of City Harvest Church, acknowledged that at the time of publication, both himself and Mr Kong were aware that certain portions of the content were not original. The publisher of \"Renewal\" has since made amendments to the soft copies to include accreditation. ## Personal life Kong is married to pastor-turned-pop-singer [Ho Yeow Sun](/wiki/Ho_Yeow_Sun), also known as Sun Ho. They have one son, Dayan Kong, who was born in 2005. Kong was the co-owner of a 5,242 sq ft duplex penthouse located on the 11th floor of The Oceanfront in the premium residential enclave [Sentosa Cove](/wiki/Sentosa_Cove). The penthouse was co-owned with Indonesian tycoon Mr Wahju Hanafi, a church follower. The pair bought the penthouse for $9.33 million in 2007, each paying monthly installments of $17,000, before the apartment was sold at a loss of over S$2 million to a Kenyan diplomat. - [List of religious leaders convicted of crimes](/wiki/List_of_religious_leaders_convicted_of_crimes) - Kong Hee's Official Website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:18:46.779902",
  "title": "Kong Hee",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Kong_Hee"
}