{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:15:51.850338"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"KOP Limited\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(January 2024)* *(Learn how and when to remove this message)* **KOP Limited** is a Singaporean holding company with business interests in real estate development, hospitality and entertainment. It has three wholly owned subsidiaries: KOP Properties, KOP Hospitality, and KOP Entertainment. In May 2014, KOP Limited was listed on the [Singapore Exchange](/wiki/Singapore_Exchange) Catalist board listing following a reverse takeover of Scorpio East by KOP Properties. ## History ### 2006–2010 KOP Group, formerly KOP Capital, was founded in 2006. In 2007, it acquired sites for The Ritz-Carlton Residences in Cairnhill, Singapore and Hamilton Scotts, Singapore. It further commenced project planning and development of its first commercial project, Scotts Spazio and subsequently The Spazio. In 2008, KOP Properties Private Limited was founded (“KOP Properties”) and it acquired the site for Montigo Resorts, Nongsa in Batam, Indonesia. In 2009, KOP Group acquired Franklyn Hotels and Resorts, Luxury Lifestyle Hotels & Resorts and LUX Magazine. ### 2011–2015 In 2011, KOP Properties acquired an interest in 10 Trinity Square in the United Kingdom which was subsequently divested in 2012. In the same year, KOP Properties acquired an interest in Cranley hotel under Franklyn Hotels and Resorts. In 2013, KOP Properties acquired the Semara Resort in Seminyak, Bali to be renovated and renamed Montigo Resorts, Seminyak. In the same year, KOP Properties divested its interest in Hamilton Scotts. KOP Properties announced its plans for Northernlight with the first phase slated to open in 2018. Northernlight is a mix-use development comprising residential, commercial and entertainment components anchored by Winterland, the world's largest indoor ski and winter sports facility. KOP Properties announced its partnership with [Pinacothèque de Paris](/wiki/Pinacoth%C3%A8que_de_Paris) to open the [Singapore Pinacothèque de Paris](/wiki/Singapore_Pinacoth%C3%A8que_de_Paris) at the Fort Canning Centre. In 2014, KOP properties acquired Scorpio East in a reverse take-over to be listed on Singapore Catalist as KOP Limited. In the same year, KOP Limited led a consortium consisting of Lian Beng Group, Kim Seng Holdings, and Centurion Global to acquire a 92.8% interest in Prudential Tower for S$512 million. KOP Limited divested its 39.9% stake in The Ritz-Carlton Residences via the redemption of 2013 junior notes issued by Royce Properties, a wholly owned subsidiary of KOP Group. In 2015, KOP Limited announced the official renovation and opening plans for the opening of Montigo Resorts, Seminyak.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:15:51.850026",
  "title": "KOP Limited",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/KOP_Limited"
}