{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:18:50.872268"
  },
  "content": "Coffee shop in Southeast Asian countriesThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Kopitiam\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(September 2012)* *(Learn how and when to remove this message)* A ***kopitiam*** or ***kopi tiam*** is a type of [coffee shop](/wiki/Coffeehouse) found in [Indonesia](/wiki/Indonesia), [Malaysia](/wiki/Malaysia), [Singapore](/wiki/Singapore), [Brunei](/wiki/Brunei) and [Southern Thailand](/wiki/Southern_Thailand), patronised for meals and drinks, and traditionally operated by the [Chinese](/wiki/Overseas_Chinese) communities of these countries. The word *[kopi](/wiki/Kopi_(drink))* is the [Indonesian](/wiki/Indonesian_language) and [Malay](/wiki/Malay_language) term for 'coffee', while *tiam* derives from the [Hokkien](/wiki/Hokkien) term for 'shop' ([Chinese](/wiki/Chinese_language): 店; [Pe̍h-ōe-jī](/wiki/Pe%CC%8Dh-%C5%8De-j%C4%AB): *tiàm*). ## Malaysia This section **does not cite any sources**. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed. *(October 2025)* *(Learn how and when to remove this message)* In Malaysia, as in Singapore, kopitiams are found almost everywhere. However, there are a few differences. In Malaysia: - the term kopitiam in Malaysia is usually referred specifically to Malaysian Chinese coffee shops; - [food courts](/wiki/Food_courts) and [hawker centres](/wiki/Hawker_centres) are usually not referred to as kopitiams. Recently a new breed of \"modern\" kopitiams has sprung up. The popularity of the old-fashioned outlets along with society's obsession with nostalgia and increasing affluence has led to the revival of these pseudo-kopitiams. The new kopitiams are fast-food outlets that are reminiscent of the old kopitiams in terms of decor but are usually built in a more modern, hygienic setting such as a shopping mall rather than in the traditional shophouse, catering mainly for young adults.[*citation needed*] To tap into the sizeable [Muslim](/wiki/Muslim) market, these kopitiams usually serve food that is prepared to conform to [Islamic dietary laws](/wiki/Islamic_dietary_laws), unlike the traditional shophouse kopitiams.[*citation needed*] Today, more than 100 modern kopitiam brands operate across various parts of Malaysia.[*citation needed*] Kopitiams in Ipoh Oldtown district serve [Ipoh white coffee](/wiki/Ipoh_white_coffee). The coffee beans are roasted with palm-oil [margarine](/wiki/Margarine) and with less sugar, resulting in a brew that is lighter in colour than normal coffee beans that use sugar – hence the name 'white coffee'. ## Singapore Kopitiams in Singapore are commonly found in almost all residential areas as well as some industrial and business districts in the country, numbering about 2,000 in total. Although most are an aggregate of small stalls or shops, some may be more reminiscent of [food courts](/wiki/Food_court), although each stall has a similar appearance and the same style of signage. Usually, in a typical kopitiam, the owner will either manage the [tze char](/wiki/Tze_char) stall, which usually sells simple stir-fry dishes made to order, or the drinks stall which sells [coffee](/wiki/Coffee), [tea](/wiki/Tea), [soft drinks](/wiki/Soft_drinks), and other beverages as well as breakfast items like [kaya toast](/wiki/Kaya_toast), [soft-boiled eggs](/wiki/Soft-boiled_egg), and snacks. In Singapore, the coffee in kopitiams is made from Robusta beans. [Kopi](/wiki/Kopi_(drink)) (coffee) was introduced to the island in the mid-19th century. Robusta beans, brought in from Indonesia via Arab traders, were preferred by the majority of the local population, compared to the more expensive Arabica beans favoured by the European population working in Singapore. Most kopitiams in Singapore consist of the drinks stall and food stalls leased by independent stallholders who mainly focus on a variety of food dishes that are commonly found in [Singaporean cuisine](/wiki/Singaporean_cuisine). Traditional dishes from different ethnicities are usually available at kopitiams to encourage people from different ethnic backgrounds with different dietary habits to dine in a common place or even at a common table. *Kopitiam* is also the name of a food court chain in Singapore. Some of the popular kopitiams in Singapore include [Kim San Leng](/wiki/Kim_San_Leng), [Killiney](/wiki/Killiney_Kopitiam) & Tong Ah Eating House, or [Ya Kun Kaya Toast](/wiki/Ya_Kun_Kaya_Toast). Some of the more common foods that can be seen in kopitiams, besides the ever-popular soft-boiled eggs and toast, consist of [char kway tiao](/wiki/Char_kway_tiao) (fried flat rice noodles ([hor fun](/wiki/Hor_fun)), sometimes cooked with eggs and [cockles](/wiki/Cockle_(bivalve))), [Hokkien mee](/wiki/Hokkien_mee) (yellow wheat noodles served with various seafood, pork slices, egg, and served with a [calamansi](/wiki/Calamansi) and spicy chilli paste on the side), [chicken rice](/wiki/Hainanese_chicken_rice) and [nasi lemak](/wiki/Nasi_lemak) (a Malay dish of coconut-flavoured rice, served with [sambal](/wiki/Sambal), egg, roasted peanuts, fried anchovies, etc.). ## \"Coffee shop talk\" \"Coffee shop talk\" is a phrase used to describe gossip because it is often a familiar sight at kopitiams where a group of workers or senior citizens would linger over cups of coffee and exchange news and comments on various topics including national politics, office politics, TV dramas, sports, and food. Former [Too Phat](/wiki/Too_Phat) member Malique has a song called \"Cerita Kedai Kopi\", satirizing the stereotype. - Drink portal - Coffee portal - Indonesia portal - Malaysia portal - Singapore portal - [Punjabi dhaba](/wiki/Punjabi_dhaba) - [Indonesian cuisine](/wiki/Indonesian_cuisine) - [Kopi](/wiki/Kopi_(drink)) - [Malaysian cuisine](/wiki/Malaysian_cuisine) - [Singaporean cuisine](/wiki/Singaporean_cuisine) - [Hawker centre](/wiki/Hawker_centre) - [Pasar malam](/wiki/Pasar_malam) (night market) - [Mamak stall](/wiki/Mamak_stall) - [Warung](/wiki/Warung) - [Coffeeshop](/wiki/Coffeehouse) - [Cha chaan teng](/wiki/Cha_chaan_teng) - [Carinderia](/wiki/Carinderia) - Rowthorn, C.; Cohen, M.; Williams, C. (2008). *Borneo. Ediz. Inglese*. Lonely Planet Borneo. Lonely Planet. p. 43. [ISBN](/wiki/ISBN_(identifier)) 978-1-74059-105-8. Retrieved 30 July 2016.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:18:50.871895",
  "title": "Kopitiam",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Kopitiam"
}