{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:18:53.551566"
  },
  "content": "Singaporean food court chain **Kopitiam Investment Pte Ltd**, more commonly known as **Kopitiam**, is a [Singaporean](/wiki/Singapore) food court chain focused on local cuisine. Under the FairPrice group along with NTUC FairPrice, NTUC Foodfare and Link, the group serves more than 2 million customers with over 100 million meals annually through its 100+ outlets located islandwide. Founded in 1988, it operates around 120+ outlets at many locations across [Singapore](/wiki/Singapore), including [Changi Airport](/wiki/Singapore_Changi_Airport), [Plaza Singapura](/wiki/Plaza_Singapura), [VivoCity](/wiki/VivoCity) and [Jem](/wiki/Jem,_Singapore). Kopitiam also owns three subsidiary food court companies, Bagus, Cantine, and Sedap. ## Etymology The name derives from the generic portmanteau term \"[kopi tiam](/wiki/Kopi_tiam)\". *[Kopi](/wiki/Kopi_(drink))* means coffee in Hokkien, and *tiam* is the Hokkien word for shop. ## History On 21 September 2018, it was announced that [NTUC Enterprise](/wiki/National_Trades_Union_Congress) would acquire Kopitiam by the end of 2018. The acquisition was approved by the [Competition and Consumer Commission of Singapore](/wiki/Competition_and_Consumer_Commission_of_Singapore) on 20 December 2018. In November 2019, [NTUC FairPrice](/wiki/NTUC_FairPrice), NTUC Foodfare, Kopitiam, and Link joined forces under the FairPrice Group to collectively serve the people of Singapore under the philosophy of \"Everything Food Made Easy.\" As part of this partnership, Kopitiam and NTUC Foodfare were merged to form a single Food Services business unit. The aim of this unit is to provide nourishing meals through various formats, such as food courts in malls, coffee shops, hawker centers, quick-service cafes, and kiosks. - food portal - Singapore portal ### Other Singaporean food court chains - [Food Republic](/wiki/Food_Republic) - [Koufu](/wiki/Koufu_(company)) This food and/or confectionery corporation or company-related article is a stub. You can help Wikipedia by expanding it. - v - t - e This Singapore-related article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:18:53.551139",
  "title": "Kopitiam (company)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Kopitiam_(company)"
}