{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:18:54.693506"
  },
  "content": "Ethnic groupEthnic groupPart of a series on[Singaporeans](/wiki/Demographics_of_Singapore) - [Arabs](/wiki/Arab_Singaporeans) - [Armenians](/wiki/Armenians_in_Singapore) - [Australians](/wiki/Australians_in_Singapore) - [Burmese](/wiki/Burmese_people_in_Singapore) - [Chinese](/wiki/Chinese_Singaporeans) - [Peranakans](/wiki/Peranakans) - [PRC](/wiki/Chinese_nationals_in_Singapore) - [Chitty](/wiki/Chitty) - [Eurasians](/wiki/Eurasian_Singaporeans) - [Filipinos](/wiki/Filipinos_in_Singapore) - [Indians](/wiki/Indian_Singaporeans) - [Japanese](/wiki/Japanese_people_in_Singapore) - [Jawi Peranakan](/wiki/Jawi_Peranakan) - [Jews](/wiki/History_of_the_Jews_in_Singapore) - Koreans - [Malays](/wiki/Malay_Singaporeans) - [Nepalis](/wiki/Nepalis_in_Singapore) - [Pakistanis](/wiki/Pakistanis_in_Singapore) - [Sri Lankans](/wiki/Sri_Lankans_in_Singapore) - [Tamils](/wiki/Singapore_Tamils) - [Thais](/wiki/Thais_in_Singapore) - [Vietnamese](/wiki/Vietnamese_in_Singapore) - v - t - e **Koreans in Singapore** consist mainly of [South Korean](/wiki/South_Korea) expatriates. The community formed a population of 21,203 as of 2023[update], according to South Korea's [Ministry of Foreign Affairs and Trade](/wiki/Ministry_of_Foreign_Affairs_and_Trade_(South_Korea)), making them the world's 18th-largest [Korean diaspora](/wiki/Korean_diaspora) community. Their population has grown by about 60% since 2007. Many South Koreans living in Singapore are usually expatriates, consisting of 40-45% of the community, self-employed or Korean business owners consisting of 30% and students consisting of 20%. ## History There is evidence of Koreans living in Singapore as early as the 1930s, when [their homeland was under Japanese rule](/wiki/Korea_under_Japanese_rule). A few Koreans are buried in the pre-[World War II](/wiki/World_War_II) cemetery of [Singapore's Japanese community](/wiki/Japanese_expatriates_in_Singapore). In the early 2000s, a variety of factors attracted South Korean migration to Singapore, including education, low taxes, and the ease of obtaining permanent residency status. In 2006, the number of Koreans purchasing Singapore real estate jumped by 132% compared to 2005, with many purchasing as [owner-occupiers](/wiki/Owner-occupier) as well as for investment purposes. Following the increase in the Korean population, the number of restaurants and retailers aimed at the community is on the rise, with a majority of these establishments setting up in [Tanjong Pagar](/wiki/Tanjong_Pagar), within the [Central Region](/wiki/Central_Region,_Singapore) of Singapore. This resulted in locals dubbing the Tanjong Pagar area as *Korea Town* or *Little Korea*. The [increasing popularity](/wiki/Korean_Wave) of South Korean culture has also led to an increase in South Korean cosmetic brands, food chains and other consumer brands opening stores in Singapore. Food products from South Korea are also increasingly common in local supermarkets, such as [NTUC FairPrice](/wiki/NTUC_FairPrice), and are no longer found only in specialised Korean supermarkets. In the late 2010s, the new wave of Korean migration to Singapore consisted mostly of office workers, whom are usually expatriates working in South Korean companies based in the country, business owners and students. Other reasons includes working in the service sector - for positions such as waiters, shop assistants and other service positions. Reasons citied for working in the service line includes the chance to master English, being able to work in a multiracial environment and also Singapore being a safe country. Intermarriages with [Singaporeans](/wiki/Singaporeans) has also increased, due to the growing Korean population in the country. South Korea's Andong General Hospital and Singapore's [Gleneagles Hospital](/wiki/Gleneagles_Hospital) established a clinic aimed at Koreans in Singapore as well as [those living in Malaysia](/wiki/Koreans_in_Malaysia); initially staffed by a single Andong doctor assisted by a number of Korean-speaking attendants, the clinic cost [S$](/wiki/Singapore_dollar)200,000 to set up. ### North Koreans [Kim Jong-nam](/wiki/Kim_Jong-nam), the eldest son of the late North Korean leader [Kim Jong-il](/wiki/Kim_Jong-il), moved to Singapore in 2012 after fleeing [Macau](/wiki/Macau), and other high ranking North Koreans visit Singapore frequently to [receive health care](/wiki/Medical_tourism) or to purchase [luxury goods unavailable](/wiki/United_Nations_Security_Council_Resolution_1718) in their home country. [North Korean defectors](/wiki/North_Korean_defectors) state that this relationship is the reason why the official [Korean Central News Agency](/wiki/Korean_Central_News_Agency) referred to Singaporean leader [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) as an \"intimate friend\" of North Korea. The Singaporean organisation [Choson Exchange](/wiki/Choson_Exchange) has also arranged for North Korean university students to obtain business internships in Singapore; under their auspices, two men and three women between the ages of 25 and 39 spent a month working at a [business incubator](/wiki/Business_incubator) in Singapore in 2013. ## Education Singapore's only school for Korean nationals, the Singapore Korean School, was established on 17 February 1993; as of 2018[update], it had 450 students at the pre-school, primary, middle and high school levels. It conducts roughly two-thirds of its class hours in [Korean](/wiki/Korean_language), and one-third in English. Its associated weekend school, opened at the same time, enrolled a total of 261 students at the elementary and middle school levels. Despite the challenge they face from the local school system, the [Singapore Korean International School](/wiki/Singapore_Korean_International_School) still projects rising student numbers, and in 2010 the school moved to a new campus with room for 500 students. Many Korean students bypass the Korean International School entirely in order to take advantage of English-medium education at government or non-Korean international schools. Singapore has become a popular destination for South Korean students and their parents, who see it as an ideal place to learn both English and Chinese, the two most popular foreign languages in South Korea. The [Singapore Tourism Board](/wiki/Singapore_Tourism_Board) began actively marketing Singaporean education to South Koreans in 2005; they form one of the larger sources of international students, along with other Asian countries such as China, India, Indonesia, Malaysia and Vietnam. By 2008, Singaporean schools enrolled an estimated 6,500 Korean students. In many cases, mothers come to Singapore with their young school-age children, while [the bread-winning father remains behind](/wiki/Gireogi_appa) in South Korea and sends money to support them. ## Notable people - [Jin Yinji](/wiki/Jin_Yinji), actress of South Korean descent - [Song Ui-young](/wiki/Song_Ui-young), professional footballer, naturalised in 2021 - [Suzanne Jung](/wiki/Suzanne_Jung), former primetime news anchor, journalist and editor - Singapore Korean International School - 싱가포르 한인회 (Korean Association of Singapore)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:18:54.693130",
  "title": "Koreans in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Koreans_in_Singapore"
}