{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:18:56.876400"
  },
  "content": "Singaporean food and beverage company **Koufu** ([Chinese](/wiki/Simplified_Chinese_characters): 口福) is a Singaporean [food and beverage](/wiki/Food_and_beverage) company operating a chain of [food courts](/wiki/Food_courts), [coffee shops](/wiki/Coffeehouse) and casual eateries. Founded in 2002, the company currently operates 180 outlets of coffee shops and food courts and 12 brands in Singapore and one food court in [Macau](/wiki/Macau). ## History Before opening their own coffeeshop, Pang Lim and his wife operated a stall selling [bee hoon](/wiki/Rice_vermicelli) and [nasi lemak](/wiki/Nasi_lemak) in a [hawker centre](/wiki/Hawker_centre) in [Hougang](/wiki/Hougang). In 1990, Pang Lim and his wife, Ng Hoon Tien, opened their first coffeeshop, Aik Hua and expanded the business in 1992, when the government launched the Sale of Tenanted Shop Scheme, which gave business owners operating out of shops leased from the Government in the public housing estate to buy over their shops instead of renting them, resulting in more business owners renting out the newly bought shops. In 1994, the government further introduced a policy of selling shop houses at subsidised rates to help local enterprises, which enabled Aik Hua to become the largest coffeeshop chain at that time with 56 outlets across the country. In the late 1990s, as food courts became more common, Pang Lim ventured into the food court business with his first food court, Happy Times Food Court in 1996. With increasing competition from the food court industry, Pang found the management of the 56 outlets of coffeeshops difficult as each coffeeshop was run as an independent entity without much synergy to one another. In 2002, Pang Lim sold Aik Hua to the Kopitiam Group for [SGD](/wiki/Singapore_dollar)10 million while buying back three Kopitiam food courts, founding Koufu in that same year. Other than Koufu food courts, the company branched out and operates different concept food courts such as Fork & Spoon, which is a [halal](/wiki/Halal) food court, The Gallerie, which is inspired by Peranakan cuisine, 1983, which is a coffee shop selling toast and coffee and local cuisine, Happy Hawkers, which is nostalgic based, and Dough Culture for an urban experience in shopping malls' basements. Koufu also manages [Punggol Plaza](/wiki/Punggol_Plaza), a shopping mall located in [Punggol](/wiki/Punggol) through its subsidiary, Abundance Development Pte Ltd. On 19 October 2022, Koufu officially opened its new headquarters building at Woodlands. The building housed its production factories, food processing kitchens, cloud kitchen units, workers' dormitories and its office workforce. It also included the Elemen Academy to teach its junior chef and experience running a kitchen. ## Products and stores Most of Koufu's food courts have a modern contemporary design. Other brands of food courts such as Cookhouse by Koufu has different concepts and design at each outlet, taking inspiration from the location the outlet is located in. ## Brands ### R&B Tea R&B Tea is a milk and bubble tea brand. It has more than 1,000 outlets in the US, China, Singapore, Cambodia, Vietnam, Malaysia, Indonesia and Philippines. - [Food Republic](/wiki/Food_Republic) - [Kopitiam](/wiki/Kopitiam_(company)) - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:18:56.875955",
  "title": "Koufu (company)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Koufu_(company)"
}