{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:18:58.764304"
  },
  "content": "Place in Singapore **Kovan** ([IPA](/wiki/International_Phonetic_Alphabet): /ˈkoʊvən/ *KOH-vən*; [Chinese](/wiki/Simplified_Chinese_characters): 高文; [pinyin](/wiki/Pinyin): *Gāo Wén*) is a neighbourhood located within the town of [Hougang](/wiki/Hougang), in [Singapore](/wiki/Singapore). The neighbourhood today largely consists of private housing properties, where majority of the residents live in terrace homes, semi-detached houses and bungalows. ## Geography As part of Hougang, Kovan is situated east of [Serangoon](/wiki/Serangoon), in Singapore. As a relatively small suburb, Kovan's boundaries are relatively unclear. The [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) defines its boundaries as Hougang Avenue 2 to the north, Yio Chu Kang Road to the west, southwest and south and Upper Serangoon Road to the east. However in reality, numerous Kovan amenities are at the other side of Upper Serangoon Road outside the above boundary. These include: Kovan [Heartland Mall](/wiki/Heartland_Mall), Kovan City, Kovan Hub, Kovan Market and Food Centre, Kovan Sports Centre, Paya Lebar Kovan Community Club. As with the North East MRT Line opening back in 2003, using Kovan as its station name, the surrounding areas began to adopt and incorporate its name into its amenities. ## Etymology Kovan was traditionally an area associated with the [Teochew](/wiki/Teochew_people) community. Kovan's [Teochew](/wiki/Teochew_Min) name is 六块石 ([Peng'im](/wiki/Peng%27im): *lag8 go3 zioh8*), literally \"six pieces of stone\", referring to how it is six miles (as measured in milestones) from the [old General Post Office at Fullerton Building](/wiki/The_Fullerton_Hotel_Singapore). A number of road names at Kovan commemorate the more prominent members of this community. ### Road name origins - Aroozoo Avenue and Simon Road were named after Dr Simon Aroozoo (1850-1931), also known as Dr Max Simon. He is a prominent Eurasian of Portuguese descent. A philanthropist well-known for his charitable contributions to education and healthcare causes in Singapore. He helped to manage [Gan Eng Seng](/wiki/Gan_Eng_Seng) estate at Upper Serangoon after the latter’s death in 1899. - Dix Road was probably named after R A Dix, Manager of colonial British company \"Singapore United Rubber Plantation Limited\" which owned the land in the area. - Ee Teow Leng Road is named after a Teochew Merchant. - Florence Road / Close was named after Lim Ah Pin's wife Florence Yeo (1887–1962). The couple built bungalows in the area. - Glasgow Road named after [Glasgow](/wiki/Glasgow), the biggest city of Scotland. - Hendry Close was probably named after P H Hendry (1887–1961). A Sinhalese jeweler. - Lim Ah Pin Road takes its name from Lim Ah Pin (林亚柄) (1890–1943), “bee hoon” king, a rice vermicelli manufacturer. - Lorong Ah Soo was named after Ng Ah Soo (-1929), also known as Ng Thye Hiong. He owned a large coconut plantation at 7 miles Serangoon Road. - Parry Avenue / Road was probably named after one of \"Singapore United Rubber Plantation Limited\" Director, E H Parry. - Poh Huat Road was probably named after a land owner Ong Poh Huat. - Richard Avenue / Place were named after Peter Richards (-1936) who owned a large plot of land in Kovan. He was the chief engineer of the official Yacht of the Singapore Governor. - Robey Crescent was named after Gordon Robey who developed that area. - Rosyth Road named after [Rosyth](/wiki/Rosyth), a town on the Firth of Forth in Fife, Scotland. Rosyth Avenue was named in 1953. - Sirat Place / Road was named after Sirat, a Malay businessman who was supplying satay and Indonesian delicacies. - Surin Avenue was named after the Eurasian Surin family who owned silent movie theaters. ## Demographics As of 2024, Kovan has a population of 27,280, with 13,110 (48.06%) males and 14,170 (51.94%) females. 3,710 (13.60%) people live in HDB flats, 11,690 (42.85%) live in condominium/other apartments, 11,590 (42.48%) live in landed properties and 300 (1.10%) live in other accommodations. ## Transportation The main road connecting Kovan to the other parts of Singapore is [Upper Serangoon Road](/wiki/Upper_Serangoon_Road). Both [Kovan MRT station](/wiki/Kovan_MRT_station) and [Heartland Mall](/wiki/Heartland_Mall) are situated along this major road. Nearby is the [Kallang-Paya Lebar Expressway](/wiki/Kallang-Paya_Lebar_Expressway), which provides a direct route to the city area. Public transport in Kovan includes the North East line served by [Kovan MRT station](/wiki/Kovan_MRT_station), which is just in front of [Heartland Mall](/wiki/Heartland_Mall). Kovan formerly had a bus interchange, which is now renamed [Kovan Hub](/wiki/Kovan_Hub). However, many buses still pass through Kovan, as they ply through the main [Upper Serangoon Road](/wiki/Upper_Serangoon_Road). The pair of bus stops connected to [Kovan MRT station](/wiki/Kovan_MRT_station) is a major one, and a relatively high number of buses passing through heads towards Hougang, Serangoon or to the city. ### Former Bus Interchange **Hougang South Bus Interchange** was closed since 15 February 2004 with the surrounding neighbourhoods expansion in Hougang over the years. Thus with the move of main town centre, its purpose for another interchange in the same town slowly diminished. The facility was then acquired and repurposed for other developments. It was situated at Hougang Street 21 next to the Kovan food centre/Wet Market, near Heartland Mall. All bus services were relocated to [Hougang Central Bus Interchange](/wiki/Hougang_Central_Bus_Interchange), except 62 (of which it was modified as Punggol - Geylang Lor 1 service, and feeder services were merged into 101, 112 and 113 respectively. The old bus interchange is now a community space with a public carpark residing at the former end-on berths of the northern end. Only one former sawtooth berth is still existent on the southern end, and it serves the express coach buses that crosses the borders and 4 public bus services currently serve the bus stop (Kovan Hub): - Hougang Ave 3 (Loop) - 115 - Hougang Central - 112 & 113 - [Punggol](/wiki/Punggol) - 119 ## Housing The main type of housing in Kovan are landed homes. The condominiums Kovan Melody, and Kovan Residences are on the main road, directly opposite [Kovan MRT station](/wiki/Kovan_MRT_station). Recently completed is Stars of Kovan, which is at the corner of Upper Serangoon Road and Tampines Road. A new HDB Built-To-Order (BTO), Kovan Wellspring with a new Community Club will be the latest addition to Kovan. ## Amenities The main amenity in Kovan is [Heartland Mall](/wiki/Heartland_Mall). Heartland Mall is well-served by a number of well-known outlets and shops. Across the road from Heartland Mall is a sports facility with eight sheltered indoor futsal courts. There is also a neighbourhood park south of [Heartland Mall](/wiki/Heartland_Mall) which is opposite [Yuying Secondary School](/wiki/Yuying_Secondary_School). There are also two community clubs in Kovan, the Aljunied Community Club (Blk 110) and the Paya Lebar Kovan Community Club which is opposite Kovan Hub. ## Places of worship ### Buddhist Temple - Buddhist Union Dharma Centre - Lam Hai Poh Toh San (南海普陀山) - Lin Chee Cheng Sia Temple (萬佛堂蓮池精舍), their late Abbess [Venerable Jing Run](/wiki/Ho_Yuen_Hoe) founded Man Fut Tong Nursing Home ### Chinese Temples - [Hougang Tou Mu Kung Temple](/wiki/Tou_Mu_Kung_Temple) (后港斗母宫) - Long Xu Yan Temple (龍鬚巖), inside Nanyang Neo Clan Association (南洋梁氏公會) - Phoh Kiu Siang Tng (普救善堂), Teochew Charitable Hall Temple - Sai Ho Piat Su Temple (西河别墅), Lim Clan Temple dedicated to [Goddess Mazu](/wiki/Mazu) - Shi Niu Dong Temple (石牛洞), founded in 1988 at Chuan Hoe Avenue and moved to Ubi Road 4 ### Churches - Immaculate Heart of Mary Church - Kim Tian Christian Church - Lim Ah Pin Church of Christ - Living Sanctuary Brethren Church - Russian Orthodox Church - St. Paul's Church - Tai Seng Christian Church - Victory Family Centre - Yio Chu Kang Chapel ### Mosque - [Masjid Haji Yusoff](/wiki/Masjid_Haji_Yusoff) ### Cemetery - [Japanese Cemetery Park](/wiki/Japanese_Cemetery_Park) ## Education There is only one primary (Xinghua) and secondary school (Yuying) in Kovan. These two schools are part of the 19 educational institutions in [Hougang](/wiki/Hougang). There used to be several more schools located deep inside the housing estate and the surrounding area. These include Rosyth School, Serangoon Secondary School, Monfort Secondary School, XinMing Secondary School. These schools have moved to other areas such as Serangoon North and Hougang. The last school to stop operations, Parry Primary School, closed down in late 2006. ## Politics Kovan falls under and is located in [Hougang SMC](/wiki/Hougang_Single_Member_Constituency). Residents are currently represented by [Dennis Tan](/wiki/Dennis_Tan), who is a member of the [Workers' Party (WP)](/wiki/Workers%27_Party_(Singapore)) and the member of parliament (MP) for Hougang SMC. In addition, [Dennis Tan](/wiki/Dennis_Tan) has been the MP for Hougang SMC since 2020. Previous WP members of parliament for Hougang SMC include [Low Thia Khiang](/wiki/Low_Thia_Khiang) from 1991 to 2011 and [Png Eng Huat](/wiki/Png_Eng_Huat) from 2011 to 2020. ## Gallery - [Hougang](/wiki/Hougang) - [Kovan MRT station](/wiki/Kovan_MRT_station)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:18:58.763947",
  "title": "Kovan, Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Kovan,_Singapore"
}