{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:19:05.064323"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Kranji Reservoir\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(July 2013)* *(Learn how and when to remove this message)*Reservoir in Kranji Northern Singapore **Kranji Reservoir** ([Chinese](/wiki/Simplified_Chinese): 克兰芝蓄水池; [Malay](/wiki/Malay_language): *Empangan Air Kranji*) is a [reservoir](/wiki/Reservoir_(water)) in the northern part of [Singapore](/wiki/Singapore), near the [Straits of Johor](/wiki/Straits_of_Johor). It was a former freshwater [river](/wiki/River) that flowed out into the sea that was dammed at its mouth to form a freshwater reservoir. It can also be classified as an [estuary](/wiki/Estuary). The dam has a road bridging the two banks, and now prevents the [sea](/wiki/Sea) from coming in, and is home to a [marsh](/wiki/Marsh). The former Kranji River has three main tributaries - the Sungei Peng Siang, Sungei Kangkar and Sungei Tengah. ## Historical significance Although known as a place for fishing and picnicking, the Kranji Reservoir Park is a historical site. A war memorial plaque tells visitors of the historical and violent past of this place. The [Battle of Kranji](/wiki/Battle_of_Kranji) here in February 1942 was part of the [Imperial Japanese Army](/wiki/Imperial_Japanese_Army)'s plan to capture Singapore during the [Second World War](/wiki/World_War_II). ## Kranji Reservoir Park In 1985 it became permissible to fish in the Kranji Reservoir Park. The Park now has two fishing areas, named A and B. The greenery around the park has made it a favorite haunt of picnickers. ## Incidents In 2002, a mother and two young children were picking shells from the shores of Kranji Reservoir when the [PUB](/wiki/Public_Utilities_Board) opened up the barrage to let water into the reservoir from the sea. Mother, son and daughter died. PUB later clarified that drownings were not due to the water release as the slow rise in water levels would not cause the trio to be swept off their feet, though it was not established how or why the tragedy happened. Additional precautionary measures have since been implemented such as sounding of a siren and patrol officers using loud hailers to warn people about the impending release of water. Additional warning signs have also been put up cautioning people not to get too near the reservoir. This [Singapore](/wiki/Singapore) location article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:19:05.063876",
  "title": "Kranji Reservoir",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Kranji_Reservoir"
}