{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:19:10.856929"
  },
  "content": "Frequent-flyer program of Singapore Airlines **KrisFlyer** is the name given by [Singapore Airlines](/wiki/Singapore_Airlines) to its [frequent-flyer programme](/wiki/Frequent-flyer_programme) and airport lounges. The name is derived from the [kris](/wiki/Kris) in the Singapore Airlines logo. ## KrisFlyer miles KrisFlyer miles can be earned and redeemed on Singapore Airlines own services as well as with Singapore Airlines' Low-cost subsidiary [Scoot](/wiki/Scoot) and KrisFlyer partners. Partners include all [Star Alliance](/wiki/Star_Alliance) members, non-Star Alliance airline partners, and selected hotel chains as well as car-hire companies. KrisFlyer is divided into KrisFlyer, KrisFlyer Elite Silver and KrisFlyer Elite Gold, which correspond to Star Alliance [Silver](/wiki/Star_Alliance#Frequent_flyer_programs,_Star_Alliance_Silver_and_Gold_status) and [Gold](/wiki/Star_Alliance#Star_Alliance_Gold), respectively. Elite Silver and Elite Gold status is given to passengers who have accrued 25,000 and 50,000 miles (80,000 km), respectively, within a 12-month period. The 12-month period is predefined according to when a passenger initially applied for KrisFlyer membership, so travelling 25,000 miles (40,000 km) over a 12-month period may not qualify for Silver status unless it corresponds with the 12-month period assigned to them by Singapore Airlines. Singapore Airlines flights in booking class G (group and promotional fares) earn no miles, while Singapore Airlines flights in booking classes V, Q, N and T (promotional fares) will receive between 10% and 50% of mileage ## PPS Club The *Priority Passenger Service Club (PPS Club)* is for passengers who have accumulated [S$](/wiki/S$)25,000 worth of PPS Value within a year. Unlike KrisFlyer miles which can be obtained while flying *Premium Economy Class* and *Economy Class*, PPS Value is acquired while flying *Singapore Airlines Suites*, *First Class* or *Business Class* on Singapore Airlines. The PPS is divided into the PPS Club, Solitaire PPS Club and the Solitaire PPS Club Life. A member with PPS Club status will qualify for Solitaire PPS Club by accumulating PPS Value of [S$](/wiki/S$)250,000 within five years. The Solitaire Life PPS Club status was formerly given to members who accrued a total of 1,875,000 miles (3,018,000 km) or 1,000 PPS sectors. Benefits are equal to Solitaire PPS Club members but did not have a re-qualification criteria. Singapore Airlines has since ceased accepting new Solitaire Life PPS Club members. All PPS members have priority check-in, baggage handling, guaranteed Economy Class seats when wait-listed on Business and First Class and have access to the business-class section of the SilverKris Lounge. Solitaire PPS members and their spouses also access First Class check-in and the First Class sections of the SilverKris Lounge.[*citation needed*] ## Lounges ### SilverKris Lounge Singapore Airlines' premium lounges, branded as SilverKris Lounge, are available to departing *Singapore Airlines Suites*, *First Class* and *Business Class* passengers in addition to Solitaire PPS Club, PPS Club and KrisFlyer Elite Gold members travelling on Singapore Airlines. These lounges are found in the following locations: #### Locations Asia - [Singapore](/wiki/Singapore_Changi_Airport) - [Terminal 3](/wiki/Singapore_Changi_Airport_Terminal_3) *(flagship)* - [Terminal 2](/wiki/Singapore_Changi_Airport_Terminal_2) - [Bangkok](/wiki/Suvarnabhumi_Airport) - [Hong Kong](/wiki/Hong_Kong_International_Airport) - [Manila](/wiki/Ninoy_Aquino_International_Airport) - [Seoul](/wiki/Incheon_International_Airport) - [Taipei](/wiki/Taiwan_Taoyuan_International_Airport) Europe - [London-Heathrow](/wiki/Heathrow_Airport) Oceania - [Adelaide](/wiki/Adelaide_Airport) (discontinued) - [Brisbane](/wiki/Brisbane_Airport) - [Melbourne](/wiki/Melbourne_Airport) - [Perth](/wiki/Perth_Airport) - [Sydney](/wiki/Sydney_Airport) The flagship SilverKris Lounge at Changi Airport Terminal 3 are open from 0500 to 0230 hours daily, and are accessible to departing first class and business class passengers travelling on any [Star Alliance](/wiki/Star_Alliance) flights. They feature internet workstations, wireless internet access, conference rooms, bars, restrooms, showers as well as dining and lounge areas. #### The Private Room The Private Room opened on 1 July 2008 and is located in the First Class section of the Changi Airport Terminal 3 SilverKris Lounge. Originally for the exclusive use of full-fare Singapore Airlines Suites and first class passengers, the entry requirements were relaxed in 2009 to include access for all Suites and First Class passengers. It features a restaurant as well as two private rooms, as well as lounge facilities, business centre, and a buffet and dining room. ### KrisFlyer Gold Lounge There is a KrisFlyer Gold Lounge in Changi Airport Terminals 2 and 3, both located adjacently to the respective SilverKris Lounges in both terminals. They are accessible to Star Alliance Gold members (including KrisFlyer Elite Gold members) travelling in economy class on Singapore Airlines or other [Star Alliance](/wiki/Star_Alliance) flights. KrisFlyer Gold Lounges features buffet and dining areas, televisions, lounge areas, Internet workstations as well as complimentary wireless internet, but unlike the SilverKris Lounge, does not feature bathrooms or showers. - Aviation portal - Companies portal - Singapore portal - [List of airlines of Singapore](/wiki/List_of_airlines_of_Singapore) - [Transport in Singapore](/wiki/Transport_in_Singapore) Library resources about **KrisFlyer** - Resources in your library - Resources in other libraries - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:19:10.856483",
  "title": "KrisFlyer",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/KrisFlyer"
}