{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:19:13.096269"
  },
  "content": "Creole language spoken in Malaysia and Singapore **Papia Kristang** or **Kristang** is a [creole language](/wiki/Creole_language) spoken by the [Kristang](/wiki/Kristang_people), a community of people of mixed Portuguese and indigenous [Malay](/wiki/Malays_(ethnic_group)) ancestry, chiefly in [Malaysia](/wiki/Malaysia) ([Malacca](/wiki/Malacca)), [Singapore](/wiki/Singapore) and [Perth](/wiki/Perth), [Western Australia](/wiki/Western_Australia). In Malacca, the language is also called **Cristão**, **Portugues di Melaka** ('Malacca Portuguese'), **Linggu Mai** ('mother tongue'), or simply **Papia** ('to speak'). In Singapore, it is generally known as Kristang, where it is undergoing sustained revitalisation. In *[Atlas of the World's Languages in Danger](/wiki/Atlas_of_the_World%27s_Languages_in_Danger)* published by [UNESCO](/wiki/UNESCO), Kristang is classified as a \"severely endangered\" language, with only about 2,000 speakers. Up to 2014, linguists concerned with Kristang have generally accepted a combined speaker population of about 1,000 individuals or less. The language has about 750 speakers in Malacca. A small number of speakers also live in other Portuguese Eurasian communities in [Kuala Lumpur](/wiki/Kuala_Lumpur) and [Penang](/wiki/Penang) in Malaysia, and in other diaspora communities in [Canada](/wiki/Canada), the United Kingdom, and elsewhere. ## Etymology Its [endonym](/wiki/Endonym) *Papia Kristang* is taken from Portuguese *papear cristão* ('to chat Christian'). The *papia* element of the name is [cognate](/wiki/Cognate) with [Papiamento](/wiki/Papiamento), another Portuguese-based creole spoken in the Dutch West Indies. ## History ### Origins The Kristang language originated after the conquest of [Malacca](/wiki/Sultanate_of_Malacca) (Malaysia) in 1511 by the [Portuguese Empire](/wiki/Portuguese_Empire). Until a takeover by the Dutch in 1642, Malacca served as one of the key ports in the trade and administration network of Portuguese establishments along with [Goa](/wiki/Goa) and [Hormuz](/wiki/Hormuz_Island), allowing Portugal control over main Asiatic trade routes. The lingua franca of Malacca then was a pidginised form of Malay known as [Bazaar Malay](/wiki/Malay_trade_and_creole_languages#Malaccan_Creole_Malay) or *Melayu Pasar*, used amongst the resident foreign population which then consisted mainly of Javanese, Tamils and Hokkien Chinese. The constant traffic of Portuguese and traders of other origins such as India eventually gave birth to Papia Kristang, one of many [Portuguese-derived contact languages](/wiki/Portuguese-based_creole_languages) which resulted from Portuguese colonial expansion during the fifteenth and sixteenth centuries. A pidgin Portuguese preceding the Kristang creole has also been proposed, whereby a reduced system based on Portuguese converges with other languages present in the contact situation. The community of Kristang speakers descends mainly from [interracial relationships](/wiki/Interracial_relationship) between Portuguese men and local women, as well as a number of migrants from [Portuguese India](/wiki/Portuguese_India), themselves of mixed [Indo-Portuguese](/wiki/Luso-Indian) ancestry. This was supported by Portuguese officials who advocated mixed marriages in the face of a labour shortage in the colonies, leading to the very first native speakers of Kristang as well as the development of the creole. Even after Portugal lost Malacca and almost all contact in 1641, the Kristang community largely preserved its language. The demographics of Malacca in the mid-17th century was still predominantly made up of the Portuguese even under Dutch control. The *Irmang di Greza* (Brothers of the Church), a manifestation of the bond between language and religion in the Kristang culture, acted as an intermediary between the priest and the remnants of the Portuguese population despite prohibition by the Dutch. Liturgy and pastoral sessions were conducted in Kristang in Malacca, which contributed to the longevity of the language into a period as late as the 20th century. Kristang also had a substantial influence on [Macanese](/wiki/Macanese_language), the creole language spoken in [Macau](/wiki/Macau), due to substantial migration from Malacca after its conquest by the [Dutch](/wiki/Dutch_Empire). ### Attrition of Kristang The ceding of Malacca by the Dutch to the British via the Anglo-Dutch Treaty of 1824 directly caused the decline of the Kristang language. By the mid 19th century, many Kristangs flocked towards clerical and auxiliary positions provided by their new colonial masters. As such, the Kristang language saw a decline in use compared to English. In addition, the rising affluence of the region meant more job opportunities, resulting in many Kristangs moving away from Malacca. Moreover, the language is not taught at school, although there are still some Church services in Kristang. In the context of Singapore, Kristang arrived in the 1820s due to the large influx of Eurasian immigrants from Malacca. However, there was little exposure and recognition of Kristang in Singapore, especially when English became entrenched as the sole language of education and the major language used in most spheres of society after the country gained independence in 1965. As a result, the intergenerational transmission of Kristang ceased almost completely. The upkeep of Kristang can largely be attributed to its connection with the dominant religion of the Portuguese and their relative social standing in their communities between the 1600s to the late 1800s. The core Kristang-speaking communities gradually eroded due to better socioeconomic opportunities elsewhere. Post-World War Two, the new generation of Catholic priests that arrived to replace the pre-war priests who had been executed demonstrated little sensitivity towards the Kristang language and culture. Eventually, the bond between Kristang and religion was severed due to the association of the Portuguese Mission with the St Xavier's Church. Migration overseas and intermarriage with other nationalities have also led to Kristang speakers leaving the Portuguese Settlement in order to live and work in other parts of Malaysia. Furthermore, the dominantly Kristang-speaking middle-class gradually began to speak English for practical reasons, altering the prestige of English with regards to Kristang. To many in the community, they grew to accept that speaking English was a key to employment instead of Kristang, facilitating a breakdown in the transmission of Kristang. ### Revitalisation efforts Papia Kristang is facing a steep decline in language use within the community. There has been an apparent language shift to [English](/wiki/English_language) and [Bahasa Malaysia](/wiki/Malay_language) due to the reduced prestige and accessibility of Kristang. However, revitalization efforts have begun in recent years in both the Portuguese Settlement in Singapore and Malacca. Such efforts have seen some success, nearly tripling the number of Kristang speakers of varying fluency. #### Malacca The Kristang-speaking community located at the Portuguese Settlement, or Padri sa Chang (\"The Priest's Land\") was able to undertake more sustained revitalisation efforts and publicise itself to non-Eurasian Malaysians, and the language. Notably with texts, stories and phrasebooks in Kristang produced by [Joan Margaret Marbeck](/wiki/Joan_Margaret_Marbeck) and through investments and interest from individuals and organisations outside the community. Joan Marbeck has produced three publications: *Ungu Adanza* (An Inheritance), *Linggu Mai* (Mother Tongue) and the Kristang Phrasebook. She is also credited with writing probably the only play in Kristang, called *Seng Marianne* (Without Marianne) and was also instrumental in staging a musical in Kristang – *Kazamintu no Praiya* which translates to 'Wedding on the beach'. Support was also received from the Lisbon-based Calouste Gulbenkian Foundation, which funded and published Marbeck's Kristang text. Within the community, there were efforts made together with the help of academics to promote their culture and the Kristang language. In 1988, Alan Baxter published *A Grammar of Kristang* based on his fieldwork within the community. This was the first book which focused on the descriptive grammar of Kristang and established many core concept on Kristang linguistics. It also had a significant impact on many later studies on Kristang. ## Vocabulary The Kristang lexicon borrows heavily from Portuguese, but often with drastic truncation. Due to its largely Portuguese vocabulary, the Kristang lexicon has much in common with other Portuguese-based creoles, including the near-extinct creoles of [Indonesia](/wiki/Indonesia) and [East Timor](/wiki/East_Timor). As it is primarily a creole, much of its vocabulary is also derived from Chinese, Indian and Malay languages to varying degrees. Examples of vocabulary from various origins MeaningKristangOrigin WordOrigin Word Languageshrimp paste*blacan**belacan*Malaywalking stick*tongkah**tongkat*hoe*changkol**cangkul*jellyfish*ampeh**ampai*loincloth*kachu**katchu*Tamillime*churutu*சுருட்டு *curuṭṭu*grandfather*tata*தாத்தா *tāttā*spatula*chengsi*煎匙 *tsian-sî*Hokkienlantern*aloleng**leng tsu*open-air restaurant*kolau**kou lau*Cantoneseconvent*konventu**convento*Portuguesehospital*ospital**hospital*toilet*kakus**kakhuis*Dutchtombstone*kelda**kelder* [Metathesis](/wiki/Metathesis_(linguistics)) was common in the derivation of the Kristang lexicon from Portuguese root words. e.g. - Portuguese *go**rd**o* → Kristang *go**dr**u* \"fat\" ## Orthography ### Polynomy Kristang is a polynomic language, where [standardisation](/wiki/Standardisation) of the language's spoken and written forms is dispreferred and the natural [morphophonological](/wiki/Morphophonology) and [orthographic](/wiki/Orthography) [variation](/wiki/Linguistic_variation) that Kristang developed as a result of its history and sociocultural context is preferred. This variation is usually concentrated around \"famililects\" spoken by families rather than geographical [dialects](/wiki/Dialects), with Kristang famililects generally being categorisable into three distinct forms: 1. A system based on [Portuguese orthography](/wiki/Portuguese_orthography)The 19th and 20th centuries saw a rise in the use of Modern Portuguese-based orthography (for example, Rego (1942)) due to the perception of Kristang as a variety of Portuguese instead of a distinct creole language partially based on Old Portuguese. This is characterized by the use of [diacritics](/wiki/Diacritics) such as [acute accents](/wiki/Acute_accent) (á, é, í, ó, ú). The system has been adopted by some native Kristang speakers as well.2. A system based on a mixture of Portuguese, English and MalayOther speakers have used a system influenced by Portuguese, English and Malay orthography. This creates an issue as the system is inconsistent in the representation of Kristang sounds and are not immediately intelligible to both speakers and non-speakers of Kristang.3. A system based on Malay orthographyThere are many observable parallels between the phonology of Malay and Kristang which has led to inherent similarities in the orthographic representations of the two languages as well. The first proposal for a standard Kristang orthography was made in 1973 by Ian F. Hancock (1973:25) who recognised this quality and advocated the Malay-based system due to the speakers' familiarity with it. This would, therefore, lead to a swift acquisition of literacy in the reading and writing of the Kristang language.This system to spell Kristang was further expanded on in *A Grammar of Kristang* by Alan N. Baxter, in which he agreed on and emphasized the use of the [Malay orthography](/wiki/Malay_alphabet). Published in 1995, [Joan Margaret Marbeck](/wiki/Joan_Margaret_Marbeck)'s book *Ungua Andanza* also followed this approach, with the orthography written in a Luso-Malay context. ## Phonology The acoustic and articulatory properties of Kristang have not been extensively studied. However, Hancock (1969, 1973), Batalha (1981), and most recently, Baxter (1988) have outlined brief descriptions of its sound system. In general, Kristang's inventory of consonant and vowel phonemes shows a significant parallel to that of [Standard Malay](/wiki/Malay_phonology). ### Consonants Consonant phonemes of Kristang [Labial](/wiki/Labial_consonant)[Alveolar](/wiki/Alveolar_consonant)[Palatal](/wiki/Palatal_consonant)[Velar](/wiki/Velar_consonant)[Stop](/wiki/Stop_consonant)[voiceless](/wiki/Voicelessness)[p](/wiki/Voiceless_bilabial_plosive)[t](/wiki/Voiceless_alveolar_plosive)[k](/wiki/Voiceless_velar_plosive)[voiced](/wiki/Voice_(phonetics))[b](/wiki/Voiced_bilabial_plosive)[d](/wiki/Voiced_alveolar_plosive)[ɡ](/wiki/Voiced_velar_plosive)[Affricate](/wiki/Affricate_consonant)[voiceless](/wiki/Voicelessness)[tʃ](/wiki/Voiceless_postalveolar_affricate) [a][voiced](/wiki/Voice_(phonetics))[dʒ](/wiki/Voiced_postalveolar_affricate)[Fricative](/wiki/Fricative_consonant)[voiceless](/wiki/Voicelessness)[f](/wiki/Voiceless_labiodental_fricative)[s](/wiki/Voiceless_alveolar_fricative)[voiced](/wiki/Voice_(phonetics))[v](/wiki/Voiced_labiodental_fricative)[z](/wiki/Voiced_alveolar_fricative)[Nasal](/wiki/Nasal_consonant)[m](/wiki/Voiced_bilabial_nasal)[n](/wiki/Voiced_alveolar_nasal)[ɲ](/wiki/Voiced_palatal_nasal)[b][ŋ](/wiki/Voiced_velar_nasal)[c][Tap](/wiki/Tap_consonant)/[Trill](/wiki/Trill_consonant)[r](/wiki/Voiced_alveolar_trill)[Lateral](/wiki/Lateral_consonant)[l](/wiki/Voiced_alveolar_lateral_approximant) **Orthographic note**: Using a Malay-based orthography, the sounds are represented orthographically by their symbols as above, except: - /[ɲ](/wiki/Voiced_palatal_nasal)/ is written as ⟨ny⟩ - /[ŋ](/wiki/Voiced_velar_nasal)/ is written as ⟨ng⟩ - /[tʃ](/wiki/Voiceless_postalveolar_affricate)/ is written as ⟨c⟩ (or ⟨ch⟩, a pre-1972 Malay letter) - /[dʒ](/wiki/Voiced_postalveolar_affricate)/ is written as ⟨j⟩ Portuguese words which begin with ⟨ch⟩, pronounced [ʃ] (\"sh\") in modern Portuguese, are often pronounced as [tʃ] (\"ch\") in Kristang, e.g.: - Portuguese *chegar* /ʃɨˈɡar/ → Kristang *chegak* /tʃəɡak/ \"to arrive\" - Portuguese *chuva* /ˈʃuvɐ/ → Kristang *chua* /tʃua/ \"rain\" This may be due to [Malay](/wiki/Malay_language) influence, or the preservation of an Old Portuguese pronunciation [tʃ] in Kristang. It is also worth noting that Northern Portugal also retains the Portuguese [tʃ] pronunciation. #### Phonological contrasts Baxter (1988), in particular, established various phonemic contrasts in the Kristang consonant system. **Stops** and **affricates** contrast in the initial and medial positions. *Examples of contrastive distribution between voiced and voiceless stops:* [Bilabial](/wiki/Bilabial_consonant)[Alveodental](/wiki/Dental_consonant)[Velar](/wiki/Velar_consonant)initialmedialinitialmedialinitialmedial**p**ai *(father)* ka**p**a *(castrate)* **t**eng *(have, be)* a**t**i *(until)* **k**aba *(finish)* sa**k**u *(sack, pocket)* **b**ai *(go)* ka**b**a *(finish)* **d**eng *(dried stingray)* a**d**i *(duck)* **g**aba *(praise)* sa**g**u *(sago)* *Examples of contrastive distribution between voiced and voiceless affricates:* [Palato-alveolar](/wiki/Palato-alveolar_consonant)initialmedial**c**eru *(smell)* in**c**hidu *(full)* **j**eru *(son-in-law)* jin**j**ibri *(ginger, gums)* **Fricatives** contrast in the medial positions. No clear distinctions between voiced-voiceless pairs and all fricative counterparts can be drawn as /v/ is highly infrequent and restricted in distribution and initial /z/ has fallen into disuse. *Examples:* /[f](/wiki/Voiceless_labiodental_fricative)/ vs /[s](/wiki/Voiceless_alveolar_fricative)//[f](/wiki/Voiceless_labiodental_fricative)/ vs /[z](/wiki/Voiced_alveolar_fricative)//[f](/wiki/Voiceless_labiodental_fricative)/ vs /[s](/wiki/Voiceless_alveolar_fricative)/initialmedialmedialmedial**f**ai *(pretend/do)* ko**f**i *(coffee)* ba**f**a *(steam)* ba**f**u *(breath)* **s**ai *(go out)* ko**s**i *(kick)* ba**z**a *(pour)* ba**s**u *(under)* **Nasals** contrast do not contrast before a consonant, and no contrasts have been found in identical environments in the final position. In the initial position, only /[m](/wiki/Voiced_bilabial_nasal)/, /[n](/wiki/Voiced_alveolar_nasal)/ and /[ɲ](/wiki/Voiced_palatal_nasal)/ contrast, while all nasals /[m](/wiki/Voiced_bilabial_nasal), [n](/wiki/Voiced_alveolar_nasal), [ɲ](/wiki/Voiced_palatal_nasal), [ŋ](/wiki/Voiced_velar_nasal)/ contrast in the medial position. **Tap**, as well as **lateral liquid** consonants, contrast in all positions. ### Vowels Vowel phonemes of Kristang UnroundedRounded[Front](/wiki/Front_vowel)[Central](/wiki/Central_vowel)[Back](/wiki/Back_vowel)[Close](/wiki/Close_vowel)[i](/wiki/Close_front_unrounded_vowel)[u](/wiki/Close_back_rounded_vowel)[Close-mid](/wiki/Close-mid_vowel)[e](/wiki/Close-mid_front_unrounded_vowel)[o](/wiki/Close-mid_back_rounded_vowel)[Mid](/wiki/Mid_vowel)[ɛ](/wiki/Open-mid_front_unrounded_vowel)[a][ə](/wiki/Mid_central_vowel)[b][ɔ](/wiki/Open-mid_back_rounded_vowel)[a][Open](/wiki/Open_vowel)[a](/wiki/Open_front_unrounded_vowel) The inventory of vowel phonemes in Kristang is also highly similar to Standard Malay vowel phonemes. Diphthongs in Kristang SpellingsExamples1.**[au]***aw**paw* \"stick\"2.**[ai]***ay**pay* \"father\"*ai**raina* \"queen\"3.**[eu]***e̹w**se̹w* \"sky\"*ew**pew* \"foot\"4.**[oi]***o̹y**no̹yba* \"girlfriend\"*oy**noybu* \"boyfriend\"5.**[io]***yo**byola* \"violin\"6.**[ui]***uy**ruybu* \"bream fish\"*wi**mwi* \"grind\"7.**[iu]***iw**friw* \"cold\"*yu**syumi* \"jealousy\"8.**[ua]***wa**rakwa* \"shift\"*ua**cua* \"rain\"9.**[ia]***ya**pyang* \"spinning top\"*ia**dia* \"day\"10.**[ue]***we**dwenti* \"ill\"*we̹**gwe̹la* \"gullet\" #### Diphthongs and vowel sequences Diphthongs in Kristang are formed when either the vowel /i/, or the vowel /u/, occurs in the same syllable as another vowel. The vowel /i/ and /u/ are pronounced as the semivowels (or glides) [j] and [w] respectively in such cases. There are 10 word-internal diphthongs in Kristang as outlined by Baxter (1988). Of all 10, 3 (/ai/ as in *rainya* 'queen', /ua/ as in *chua* 'rain' and /ia/ as in *dia* 'day') may also constitute hiatus, i.e. the vowels in would be pronounced as two distinct syllables in certain environments. The relatively large number of diphthongs is also in contrast to Malay, whereby only three native diphthong phonemes are described: 1. /ai̯/: *ked**ai*** ('shop') 2. /au̯/: *kerb**au*** ('buffalo') 3. /oi̯/: *dod**oi*** ('lullaby') These diphthongs also display visible parallels to certain Kristang vowel sequences [ai], [au] and [oi]. The Portuguese diphthong [oj] (or archaic [ou]) are often reduced to [o] in Kristang in Portuguese loan words, e.g.: - Portuguese *dois*/*dous* → Kristang *dos* 'two' - Portuguese *à noite*/*à noute* → Kristang *anoti*/*anuti* 'tonight' Kristang diphthongs are monosyllabic and the vowel sequences are differentiated according to its stress position. For example, the stress in /au/ is on the first vowel whereas in /io/, the second vowel is stressed. ### Stress and rhythm Kristang is a syllable-timed language (not unlike Malay which also displays syllable-based rhythm). According to Baxter (2004), most polysyllabic words in Kristang can be classified into two large groups based on the stress position in the word. Stress Rule A Most words which end in a vowel have tonic stress on the penultimate syllable. - ***ka**za* 'house' - ***no**mi* 'name' - ***ra**yu* 'wicked' - *a**po**yu* 'support' - *kume**ri**a* 'food' - ***ru**a* 'street' Stress Rule B Most words which end in a consonant have tonic stress on the final syllable. - *lan**des*** 'Dutch' - *na**tal*** 'Christmas' However, stress pattern is not completely predictable in Kristang, as there are also certain words which are exceptions to the above two rules. **Exception to Rule A**Verbs which end in a stressed vowel (e.g. *ku**mi*** 'to eat'). Attention should be paid to the lexical stress in such instances as it brings about a difference in meaning (e.g. ***ka**za* 'house' vs *ka**za*** 'to marry\").Some vowel-ending words are also stressed on the antepenultimate syllable instead. (such as *fa**mi**lia* 'family', ***a**nimu* 'valour')**Exception to Rule B**Some consonant-ending words are stressed on the penultimate syllable (such as ***o**kel* 'spectacles', ***no**bas* 'news') Kristang also displays stress shifting in that many verbs display a tendency to shift their stress from the final syllable to penultimate syllable when followed by a stressed syllable in the next word, especially in rapid speech. ## Grammar The grammatical structure of Kristang is similar to that of the [Malay language](/wiki/Malay_language). The usage of verbs is one of the grammatical features of Kristang that displays this quality. While Portuguese verbs mainly use morphology, or suffixes, to change a verb's tense or for it to match with the person and number of its subject, Malay does not change the form of the verb itself. Instead, it makes use of pre-verbal words to convey tense and does not indicate the person or number of the subject in the form of the verb. Kristang's structure is practically identical to Malay, although the choice of words comes from Portuguese. ### Syntax Papiá Kristang has [Subject–Verb–Object](/wiki/Subject%E2%80%93verb%E2%80%93object) (SVO) word order in simple sentences. The direct human objects are case-marked by the preposition *ku*. The same preposition also marks indirect objects. Intransitive clauses, the case-marked indirect object may precede the direct object, especially when the former is pronominal. Noncore arguments are generally located either at the beginning or at the end of the sentence as shown in example (1). (1) Amiang tomorrow Diego Diego lo FUT dá give ku DAT bos 2SG aké that doi money na LOC butika shop Amiang Diego lo dá ku bos aké doi na butika tomorrow Diego FUT give DAT 2SG that money LOC shop 'Tomorrow, Diego will give you that money, at the shop.' **Adversity Passive**, which is used to talk about situations where a negative action happens to something, but the person or originator of the negative action is not mentioned something, is also present both in Kristang and Malay. The Adversity Passive is signalled by *kena* (Malay), and by *tokah* (Kristang). Colloquial MalayKristangColloquial English near-equivalentIkan kena makanPesi tokah kumihThe fish got eaten For complex sentences, the phrases and clauses are joined by coordinating conjunctions *ku* \"with, and\", *kě* \"or\", and *mas* \"but\". There are also instances where object clauses may be headed by *ki*; however, this is rare and is only found in traditional formal registers, as in a wedding speech. The most frequent means of expressing nominal subordination is parataxis as shown in example (2) and (3). (2) Nus 1PL pidi ask ki COMP tudu all bolotu 3PL podi can kumí eat sabrozu tasty Nus pidi ki tudu bolotu podi kumí sabrozu 1PL ask COMP all 3PL can eat tasty 'We ask that you may all eat to your satisfaction.' (3) Yo 1SG ja PFV skribé write ku ACC eli 3SG Ø Ø John John ja PFV kazá. marry Yo ja skribé ku eli Ø John ja kazá. 1SG PFV write ACC 3SG Ø John PFV marry 'I wrote to him that John has married.' **Adverbial clauses** are headed by *antis di* \"before\", *kiora* \"when\", *chuma* \"as\", *kantu* \"if\", *padi* \"in order to\", *kauzu ki* \"because\", *kifoi* \"because\", etc., yet may also be indicated by parataxis without conjunctions. **Relative clauses** are headed by *ki* \"what, who\" (and very rarely by *keng* \"who\"), yet also commonly occur with a pronoun head or may occur without it. This can be seen in example (4) and (5). (4) Tantu many yo 1SG sa GEN kambra friend kambradu friend ki REL ja PFV bai go skola school pun. too Tantu yo sa kambra kambradu ki ja bai skola pun. many 1SG GEN friend friend REL PFV go school too 'many of my friends who went to school too.' (5) Jenti person prenya pregnant eli 3SG parí bear muré die ja PFV fiká become pontianak. vampire Jenti prenya eli parí muré ja fiká pontianak. person pregnant 3SG bear die PFV become vampire 'A pregnant woman who dies in childbirth becomes a vampire.' In Kristang, The [noun phrase](/wiki/Noun_phrase) (NP) is a structure which can occur as subject of a verb, object of a verb, object of a relator or as a predicate. There are five types of prenominal determiners in Kristang: **Quantifier**: (6) kada each kaza house kada kaza each house 'Each house’. **Numeral**: (7) dos two prau boat dos prau two boat 'Two boats’. **Interrogative determiner**: (8) kí REL redi net ? Q kí redi ? REL net Q 'What net?’ **Demonstrative article**: (9) aké DEM albi tree aké albi DEM tree 'That tree.’ The demonstratives *isi* and *ake(li)* 'that' precede the noun and indicate a distance contrast. **Possessive NP + *sa*** :\n",
  "language": "en",
  "processed_at": "2026-01-12T11:19:13.095364",
  "title": "Kristang language",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Kristang_language"
}