{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:19:15.011425"
  },
  "content": "Southeast Asian deep fried crackers **Krupuk** (Indonesian pronunciation: [/kruˈpʊk/]), also known as **keropok** (Malay pronunciation: [/kəˈro.poʔ/]) and **kropek** (Filipino pronunciation: [/ˈkro.pɛk/]) refers to traditional [deep-fried](/wiki/Deep_frying) crackers made from [starch](/wiki/Starch) combined with flavouring ingredients such as [prawn](/wiki/Prawn), [fish](/wiki/Fish) or other [seafood](/wiki/Seafood). The food has long-standing traditions throughout [maritime Southeast Asia](/wiki/Maritime_Southeast_Asia) and neighbouring coastal regions, particularly in [Indonesia](/wiki/Indonesia), [Malaysia](/wiki/Malaysia), the [Philippines](/wiki/Philippines), southern [Thailand](/wiki/Thailand), [Brunei](/wiki/Brunei) and [Singapore](/wiki/Singapore). *Krupuk*, *keropok* and *kropek* encompasses numerous regional varieties, ranging from [cassava](/wiki/Cassava)- or [rice](/wiki/Rice)-based forms to those made with seafood or animal products such as cattle skin. These varieties are widely consumed as [snacks](/wiki/Snack), served alongside main dishes, or sold as regional specialities. Certain forms hold strong associations with local cuisines, including *[krupuk kulit](/wiki/Krupuk_kulit)* in [Java](/wiki/Java) and [Sumatra](/wiki/Sumatra), *[keropok lekor](/wiki/Lekor)* in [Malay Peninsula](/wiki/Malay_Peninsula) and *[amplang](/wiki/Amplang)* in [Borneo](/wiki/Borneo). Variants are also found internationally. In the [Netherlands](/wiki/Netherlands) the food is known as *kroepoek*, reflecting historical ties with [Indonesia](/wiki/Indonesia%E2%80%93Netherlands_relations), while in [Suriname](/wiki/Suriname) it forms part of [Javanese-Surinamese](/wiki/Javanese_Surinamese) cuisine. In [global markets](/wiki/International_finance) it is often sold as “[prawn crackers](/wiki/Prawn_cracker)” or “[fish crackers](/wiki/Fish_cracker).” Comparable preparations exist in [Vietnam](/wiki/Vietnam) ([Vietnamese](/wiki/Vietnamese_language): *bánh phồng tôm*; [Lao](/wiki/Lao_language): ແຄບໝູ), southern [China](/wiki/China) ([Chinese](/wiki/Traditional_Chinese_characters): 虾片; [pinyin](/wiki/Pinyin): *xiāpiàn*) and other coastal areas of Asia, where drying and frying provided a practical method of preserving food resources. ## Origins ### Animal-based preparations in Southeast Asia Early forms of such foods in the region are thought to have been made from [animal skin](/wiki/Animal_skin), which could be preserved, dried and later [fried](/wiki/Frying) for consumption. Across [Southeast Asia](/wiki/Southeast_Asia), buffalo, cow and pig skins were traditionally kept for non-culinary purposes such as [leatherwork](/wiki/Leatherwork) or [drum](/wiki/Drum)-making, while frying or [roasting](/wiki/Roasting) the skin as food represented a way of maximising the use of [slaughtered animals](/wiki/Animal_slaughter) in peasant or village settings where little was wasted. The technique of drying and rendering skin before frying, which causes it to puff when cooked, is believed to have developed independently in different regions, including in Thailand and Indonesia. In Indonesia, historical sources suggest that *krupuk* was already known by the 9th or 10th century. The Batu Pura inscription mentions *krupuk rambak*, a cracker made from cow or buffalo skin that survives today as *[krupuk kulit](/wiki/Krupuk_kulit)*, often served with the [Javanese dish](/wiki/Javanese_cuisine) krechek. According to A. G. Pringgodigdo in the *[Ensiklopedi Umum](/wiki/Ensiklopedi_Umum_dalam_Bahasa_Indonesia)*, its preparation involved cleaning and boiling hides before slicing and drying them for later use. Similar skin-based crackers also appear in other regional traditions, such as the [Sundanese](/wiki/Sundanese_cuisine) *dorokdok* and the [Minangkabau](/wiki/Padang_cuisine) *karupuak jangek*. ### Development of starch-based crackers Alongside these skin-based varieties, [starch](/wiki/Starch)-based crackers developed as a distinct preparation method and eventually became the predominant form across Southeast Asia. Their emergence is often linked to broader food practices in [Asia](/wiki/Asia), where [root crops](/wiki/Root_vegetable), [grains](/wiki/Grain) and seafood formed important components of the diet. [Mixing](/wiki/Food_pairing) starch with ingredients such as fish, shrimp or [tubers](/wiki/Tuber) and then drying the mixture provided a practical way to preserve and extend food resources, and similar techniques appear to have arisen independently in multiple parts of maritime and coastal Southeast Asia. In the [Mekong Delta](/wiki/Mekong_Delta) of [Vietnam](/wiki/Vietnam), bánh phồng tôm developed in areas where [rice cultivation](/wiki/Rice_cultivation) and [shrimp farming](/wiki/Shrimp_farming) were central to local livelihoods, with production in Sa Đéc becoming particularly prominent during the 19th-century [Nguyễn dynasty](/wiki/Nguy%E1%BB%85n_dynasty). Through trade along the [South China Sea](/wiki/South_China_Sea), these prawn crackers circulated widely and showed close similarities to varieties found elsewhere in maritime Southeast Asia. Comparable preparations were also made in [southern China](/wiki/Southern_China), particularly in [Fujian](/wiki/Fujian) and [Guangdong](/wiki/Guangdong), where [shrimp paste](/wiki/Shrimp_paste) and [rice flour](/wiki/Rice_flour) were combined to produce xiāpiàn. Maritime exchange, especially through [Hokkien](/wiki/Hoklo_people) and [Teochew merchants](/wiki/Teochew_people), facilitated the spread of such crackers into Southeast Asia, where they were adapted to local tastes and ingredients. In the [Malay Peninsula](/wiki/Malay_Peninsula), local tradition traces the origin of *keropok udang* ([prawn crackers](/wiki/Prawn_cracker)) to the 16th century, when leftover prawn heads from a feast were used to prepare the first crackers. By the 19th century, *keropok* was documented by the [Malay](/wiki/Malaysian_literature) writer [Abdul Kadir Munsyi](/wiki/Abdullah_Abdul_Kadir), who noted its production in the [Kuantan region](/wiki/Kuantan). The tradition also extended to the [Philippines](/wiki/Philippines), where a related preparation known as *kropeck* is believed to have been introduced through early contact with Malay communities prior to [Spanish colonisation](/wiki/History_of_the_Philippines_(900%E2%80%931565)). Made from shrimp or fish paste combined with flour and dried before frying, it became a familiar snack and remains widely consumed. ### Regional variations and spread The development of *keropok* reflects a broader trend in which local variations of *krupuk* evolved across Southeast Asia, responding to the availability of [cassava](/wiki/Cassava), [sago](/wiki/Sago), shrimp, fish and other protein sources. This diversity gave rise to numerous regional varieties throughout Sumatra, the Malay Peninsula, Java, Borneo, Sulawesi, Luzon, the Visayas and beyond, with established centres of trade and [cultural exchange](/wiki/Cultural_diplomacy) enabling the spread of ingredients and culinary techniques. ## Culinary profile ### Preparation and culinary uses Most varieties of pre-packaged raw *krupuk* require [sun-drying](/wiki/Sun-drying) before being deep-fried to achieve their characteristic crisp texture. They are typically cooked in a [wok](/wiki/Wok) with hot oil, although alternative methods exist; for example, [microwaving](/wiki/Microwaving) raw *krupuk* for about one minute at medium power (~700 W) can produce a lower-fat version. In its uncooked form, *krupuk* is small, hard, and darker in colour compared to its puffed, cooked state. *Krupuk* and kripik may be eaten on their own as snacks or used as accompaniments to enhance the texture of various dishes. Certain types are commonly paired with preparations such as [gado-gado](/wiki/Gado-gado), [karedok](/wiki/Karedok), [rujak](/wiki/Rojak), [asinan](/wiki/Asinan), [bubur ayam](/wiki/Bubur_ayam) and certain varieties of [soto](/wiki/Soto_(food)). *Krupuk* is also the primary ingredient in [seblak](/wiki/Seblak), a savoury and spicy preparation in which softened *krupuk* is stir-fried with meat or seafood in a chilli-based sauce. ### Variations #### Indonesia Indonesia has a wide variety of *krupuk*, with types found in almost [every region](/wiki/Provinces_of_Indonesia). The most common are prepared from starch combined with seafood such as shrimp, fish or squid, while others make use of rice or animal products such as cattle skin. These preparations are consumed both as standalone snacks and as accompaniments to meals, reflecting regional preferences and available ingredients. Among the most widespread types are *krupuk putih* or *krupuk kampung*, [cassava starch](/wiki/Cassava) crackers common throughout the [archipelago](/wiki/Indonesian_archipelago) and *krupuk gendar*, a rice-based cracker especially associated with [Java](/wiki/Java). Seafood-based varieties include *krupuk udang* (prawn crackers), the most internationally recognised type, and *krupuk ikan*, widely produced in coastal centres such as [Palembang](/wiki/Palembang), [Bangka](/wiki/Bangka_Island), [Cirebon](/wiki/Cirebon) and [Sidoarjo](/wiki/Sidoarjo_Regency). Regional specialities also include *krupuk kemplang* from Palembang, *amplang* from [Kalimantan](/wiki/Kalimantan) and *krupuk kupang*, a [clam](/wiki/Clam)-based cracker from [East Java](/wiki/East_Java). Other distinctive forms highlight cultural and culinary diversity. *Krupuk kulit* (*rambak* or *jangek*) is prepared from cattle skin and is especially popular in [West Sumatra](/wiki/West_Sumatra) and [Java](/wiki/Java), while *krupuk kulit babi* (pork rinds) are associated with non-Muslim-majority regions such as [Bali](/wiki/Bali), [North Sumatra](/wiki/North_Sumatra) and [North Sulawesi](/wiki/North_Sulawesi). Local innovations include *krupuk melarat* from [Cirebon](/wiki/Cirebon), roasted in clean river sand instead of oil, *krupuk mie* (noodle crackers) used as toppings for asinan, and speciality products such as *krupuk petis* from [Kendal](/wiki/Kendal_Regency), *krupuk telur* asin from [Brebes](/wiki/Brebes_Regency), and *krupuk siput gonggong* from the [Riau Islands](/wiki/Riau_Islands). #### Malaysia In Malaysia, *keropok* is most often associated with fish and other seafood, reflecting the country's coastal [food traditions](/wiki/Malaysian_cuisine). It is widely available in [markets](/wiki/Marketplace) and roadside stalls, eaten as a snack or served alongside meals, usually with dipping sauces such as chilli. Production is closely tied to [fishing communities](/wiki/Fishing), where *keropok* has long formed part of local food culture and small-scale economies. Among the many varieties, *keropok kering* is widely produced across different states and sold throughout the country, with common flavours including *ikan tamban* ([sardine](/wiki/Sardine)), *ikan parang* ([wolf herring](/wiki/Wolf_herring)), *udang merah* (red [prawn](/wiki/Prawn)) and *udang putih* (white prawn). Distinct regional specialities include *[keropok lekor](/wiki/Lekor)*, a chewy fish cracker emblematic of [Terengganu](/wiki/Terengganu), is usually eaten freshly fried and is also known as *keropok gote* in [Kelantan](/wiki/Kelantan). *Keropok sira* refers to fish crackers coated in a sweet and spicy glaze, particularly associated with the east coast of [Malay Peninsula](/wiki/Malay_Peninsula). In [Sabah](/wiki/Sabah), [amplang](/wiki/Amplang) is a popular nugget-shaped fish cracker characteristic of the coastal town of [Tawau](/wiki/Tawau). #### Thailand In the [southern Thai](/wiki/Southern_Thailand) provinces of [Pattani](/wiki/Pattani_province), [Yala](/wiki/Yala_province) and [Narathiwat](/wiki/Narathiwat_province), fish crackers are locally known as *keropok* or *krue po* ([Thai](/wiki/Thai_language): กรือโป๊ะ). The product is traditionally associated with the [Thai Malays](/wiki/Thai_Malays) and is produced primarily in coastal fishing communities. Similar to Malaysian *keropok*, it is made either as a chewy form (*[keropok lekor](/wiki/Keropok_lekor)*) or as dried slices (*keropok keping*) that can later be deep-fried. Preparation typically involves combining minced fish with [flour](/wiki/Flour), shaping the mixture into [cylinders](/wiki/Cylinder), boiling until firm and slicing. The product is distributed both as a common snack and as a [regional speciality](/wiki/Regional_cuisine), with more than 200 [small-scale producers](/wiki/Small_business) active in the area. #### Philippines In the Philippines, the snack is more commonly known as *kropek* or *kropeck*. It is sometimes marketed in English as \"fish crackers\" or \"prawn crackers\", and less frequently compared with [chicharrón](/wiki/Chicharr%C3%B3n), though the latter usually refers to [fried pork](/wiki/Fried_pork) or [fish skin](/wiki/Fish_skin). While some commercially available vegetarian snacks made from tapioca starch or [green peas](/wiki/Green_peas) resemble *kropek*, they are typically considered distinct products despite their similarities. Kropek is widely sold in small portions at neighbourhood [sari-sari stores](/wiki/Sari-sari_store), as well as in larger bags at supermarkets and convenience shops. *Kropek* is typically served as a light snack or [appetiser](/wiki/Appetiser), often accompanied by a [vinegar](/wiki/Vinegar) and chilli dipping sauce, and is also consumed during social occasions or as a [side dish](/wiki/Side_dish) with meals. Numerous local brands produce different varieties, among them La La Fish Crackers and Oishi, the latter being a Philippines-based snack food company that has expanded across Asia and become one of the region's major producers of prawn and fish crackers. #### Netherlands In the Netherlands, *kroepoek* is commonly known as a familiar element of Indonesian and [Indo-Dutch cuisine](/wiki/Indo_people). It is widely available in supermarkets, Asian grocery stores ([toko](/wiki/Toko_(shop))), and Indonesian or [Chinese-Indonesian](/wiki/Chinese_Indonesians) restaurants, where it is typically served as a side dish or snack. The most common variety is prawn crackers, sold both as dried slices for home frying and in [ready-to-eat](/wiki/Convenience_food) form. Commercial brands such as Conimex, along with [imported products](/wiki/Import) like Krupuk Udang Sidoarjo, have made *kroepoek* a well-integrated part of [Dutch food culture](/wiki/Dutch_cuisine). #### Suriname In Suriname, *kroepoek* is widely consumed as part of [Javanese-Surinamese](/wiki/Javanese-Surinamese) cuisine, introduced through Indonesian migration during the [colonial period](/wiki/Suriname_(Kingdom_of_the_Netherlands)). It is typically served as a snack or as an accompaniment to meals. Common varieties include prawn crackers, cassava-based crackers and rempeyek, all of which are prepared in both household and restaurant settings. - Food portal - Indonesia portal - Malaysia portal - Philippines portal - Thailand portal - Singapore portal - Netherlands portal - Suriname portal - [Prawn cracker](/wiki/Prawn_cracker) - [Fish cracker](/wiki/Fish_cracker) - [Kabkab](/wiki/Kabkab) - [Kiping](/wiki/Kiping) - [Kripik](/wiki/Kripik) - [Rempeyek](/wiki/Rempeyek) - [Emping](/wiki/Emping) - [Seblak](/wiki/Seblak) - [Duros](/wiki/Duros_(food))\n",
  "language": "en",
  "processed_at": "2026-01-12T11:19:15.011020",
  "title": "Krupuk",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Krupuk"
}