{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:19:24.815581"
  },
  "content": "Singaporean lawyer **Kwa Geok Choo** ([Chinese](/wiki/Chinese_language): 柯玉芝; [pinyin](/wiki/Pinyin): *Kē Yùzhī*; [Pe̍h-ōe-jī](/wiki/Pe%CC%8Dh-%C5%8De-j%C4%AB): *Koa Gio̍k-tsi*; 21 December 1920 – 2 October 2010) was a Singaporean lawyer. She was the wife of [Lee Kuan Yew](/wiki/Lee_Kuan_Yew), the founding Prime Minister of Singapore and the mother of [Lee Hsien Loong](/wiki/Lee_Hsien_Loong), [Lee Hsien Yang](/wiki/Lee_Hsien_Yang), and [Lee Wei Ling](/wiki/Lee_Wei_Ling). She was the co-founder and partner of law firm [Lee & Lee](/wiki/Lee_%26_Lee) and took the role as the spouse of the [Prime Minister of Singapore](/wiki/Prime_Minister_of_Singapore) between 1959 and 1990. ## Early life and education Kwa was the daughter of Kwa Siew Tee, former general manager of [Oversea-Chinese Bank](/wiki/Oversea-Chinese_Banking) and [Singapore Municipal Commissioner](/wiki/Singapore_Municipal_Commission) who was a [Tong'anese](/wiki/Tong%27an) on his paternal side who also had a [Teochew](/wiki/Teochew_people) mother, and Wee Yew Neo, Geok Choo's Teochew mother was from [Shantou](/wiki/Shantou). Kwa attended the [Methodist Girls' School](/wiki/Methodist_Girls%27_School,_Singapore), [Raffles Institution](/wiki/Raffles_Institution) and [Raffles College](/wiki/Raffles_College), and was a [Queen's Scholar](/wiki/Queen%27s_Scholar_(British_Malaya_and_Singapore)) of [Malaya](/wiki/British_Malaya). According to Lee Kuan Yew's memoirs, by 1939, Kwa and Lee were both top students in Raffles, often coming first and second in exams. They continued their courtship during the Japanese occupation when their studies were disrupted. After the war, Kwa resumed her studies at Raffles College in 1946 while Lee left Singapore to pursue his law degree at the [University of Cambridge](/wiki/University_of_Cambridge). Kwa was admitted to [Girton College](/wiki/Girton_College,_Cambridge) in 1947, after Lee petitioned for her, saying she was \"a very bright girl, brighter than I was\". She graduated with first-class honours in 1949 and was called to the bar in the subsequent year. She returned to Singapore and was admitted to the Colony Bar in 1951. Kwa was one of the few female lawyers of the country then, practising at Laycock & Ong. ## Career On 1 September 1955, Kwa founded law firm Lee & Lee with Lee Kuan Yew and Dennis Lee Kim Yew. Kwa practised conveyancing and legal draftsmanship. She retired from partnership in 1987 but stayed on as a consultant thereafter. Kwa was a founding member of the [People's Action Party](/wiki/People%27s_Action_Party) (PAP) and helped to draft the PAP Constitution. She made her first political speech on Radio Malaya on PAP's policy on women before the [1959 elections](/wiki/1959_Singaporean_general_election), advocating equal pay for women and for monogamous marriages. She mostly stayed out of the political limelight throughout her husband's career. When Singapore [separated](/wiki/Singapore_in_Malaysia) from the [Malaysian Federation](/wiki/Malaysia), Kwa drafted the clauses in the Separation Agreement for the guarantee of the [water agreements](/wiki/Water_conflicts_between_Malaysia_and_Singapore) between the Malaysian state of Johor and Singapore. This guarantee was done via an amendment to the [Federal Constitution of Malaysia](/wiki/Constitution_of_Malaysia). Kwa was also a pioneer advocate of women's rights in Singapore. She spoke on family planning, and supported legal protection for women. Together with other women's activists such as [Chan Choy Siong](/wiki/Chan_Choy_Siong), Kwa's suggestions were included into the landmark 1961 [Women's Charter](/wiki/Women%27s_Charter), which sought to improve and protect the legal rights of women. ## Personal life Kwa married Lee in secret in London in 1947 and then remarried in Singapore on 30 September 1950. They had two sons – Lee Hsien Loong and [Lee Hsien Yang](/wiki/Lee_Hsien_Yang) – and a daughter – [Lee Wei Ling](/wiki/Lee_Wei_Ling). Her brother, Kwa Soon Bee, served as a Permanent Secretary in the [Ministry of Health](/wiki/Ministry_of_Health_(Singapore)), and [Kwa Soon Chuan](/wiki/Kwa_Soon_Chuan), was a civil servant who served as a chairman of the [Central Provident Fund Board](/wiki/Central_Provident_Fund). She had three sisters: Mrs Cheah, a teacher at [Methodist Girls' School](/wiki/Methodist_Girls%27_School,_Singapore); Mrs Yong, the wife of [Yong Nyuk Lin](/wiki/Yong_Nyuk_Lin); and Mrs Earnest Lau, who was also a teacher at Methodist Girls School. During Lee's years as Prime Minister and [Senior Minister](/wiki/Senior_Minister_of_Singapore), Kwa was frequently seen with her husband, especially on diplomatic trips and meetings with other foreign ministers. After suffering two strokes in May and June 2008, she was bedridden and developed [locked-in syndrome](/wiki/Locked-in_syndrome), being unable to speak, but remained conscious and able to understand speech. ### Death Kwa died in her sleep at home, following a long illness on 2 October 2010 at around 05:40 [Singapore Standard Time](/wiki/Singapore_Standard_Time). She was given a [state funeral](/wiki/State_funeral) and cremated at [Mandai Crematorium](/wiki/Mandai_Crematorium_and_Columbarium) on 7 October 2010. ## Legacy In 2011, the [Singapore Management University](/wiki/Singapore_Management_University) named its new law library, a new scholars programme and a top law graduate award after Kwa. In the same year, the [National University of Singapore](/wiki/National_University_of_Singapore) established a professorship in property law, a distinguished visitors programme, bursaries and scholarships in her honour. [Nanyang Girls' High School](/wiki/Nanyang_Girls%27_High_School) also unveiled a bust of Kwa at its Yu Zhi Library, which is named after her. Her alma mater, the Methodist Girls' School, named their auditorium in her honour after it was refurbished in 2011. Singapore's [Peranakan Museum](/wiki/Peranakan_Museum) currently displays Kwa's barrister wig on its third floor. ### Cultural depictions In 2011, former *[Far Eastern Economic Review](/wiki/Far_Eastern_Economic_Review)* comic artist [Morgan Chua](/wiki/Morgan_Chua) released *In Memory of Kwa Geok Choo (1920-2010)*, a book of sketches and political cartoons in tribute to her. In October 2014, the [Madame Tussauds](/wiki/Madame_Tussauds) Singapore museum unveiled wax figures of Kwa and [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) seated and smiling together against a backdrop of red flowers formed in the shape of two hearts. The statues were created based on a photograph that was taken by Kwa's niece, Kwa Kim Li, of the pair on Valentine's Day in 2008 at [Sentosa](/wiki/Sentosa). In the same month, [Cultural Medallion](/wiki/Cultural_Medallion) recipient [Tan Swie Hian](/wiki/Tan_Swie_Hian) completed a painting of Kwa and Lee Kuan Yew entitled *A Couple*. The painting, which took Tan five years to complete, was partially damaged by a fire in 2013. It depicts Kwa and Lee in their youth, is based on a 1946 black-and-white photograph of the couple in the University of Cambridge, and incorporates in its background Tan's poem written in memory of Kwa. Tan said, \"I have always felt [Madam Kwa] was a great woman who, despite her intelligence and capability, was also a humble and dedicated wife.\" *A Couple* was donated to the National Library of Singapore in 2017 and is displayed at the National Library Building in Victoria Street. In 2022, Toy Factory Productions produced a play, *Madam Kwa Geok Choo*, a monologue where Tan Rui Shan portrayed Kwa. ## Honours and awards - [Philippines](/wiki/Philippines): Golden Heart Presidential Award (15 January 1974) Media related to Kwa Geok Choo at Wikimedia Commons - The Singapore Story: Memoirs of Lee Kuan Yew - Lee Kuan Yew | Articles Speeches and Interviews - Lee Kuan Yew 李光耀 - Press statement from Prime minister's office: Passing of Mrs Lee Kuan Yew\n",
  "language": "en",
  "processed_at": "2026-01-12T11:19:24.815259",
  "title": "Kwa Geok Choo",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Kwa_Geok_Choo"
}