{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:19:31.560780"
  },
  "content": "Chinese snack ***Kway chap*** ([Chinese](/wiki/Chinese_language): 粿汁; [pinyin](/wiki/Pinyin): *guǒzhī*; [Pe̍h-ōe-jī](/wiki/Pe%CC%8Dh-%C5%8De-j%C4%AB): *kóe-chiap*), also spelt ***kway jap*** and ***kueh jap***, is a [Teochew](/wiki/Teochew_cuisine) [noodle soup](/wiki/Noodle_soup) originating in [Chinese cuisine](/wiki/Chinese_cuisine) consisting of flat, broad rice sheets (*kway*) in a soup made with dark soy sauce, served with an assortment of pork cuts including [offal](/wiki/Offal), [pork belly](/wiki/Pork_belly), intestines, and [pig's ears](/wiki/Pig%27s_ear_(food)), braised duck meat, various kinds of beancurd, preserved salted vegetables, and braised hard-boiled eggs. Alongside [Southern China](/wiki/Southern_China), the dish is popular particularly in [Singapore](/wiki/Singapore) where there is a significant Teochew diaspora community. Similar variants of the dish can be found in other parts of [Southeast Asia](/wiki/Southeast_Asia) such as [Indonesia](/wiki/Indonesia), [Malaysia](/wiki/Malaysia) and [Thailand](/wiki/Thailand). ## History Kway chap is a traditional Chinese dish that has a long history, particularly in Southern China, including regions like Guangdong, Guangxi, Fujian, and Hong Kong. The term \"粿\" (guǒ) refers to a type of rice cake or rice noodle made from glutinous rice flour, while \"汁\" (zhī) means soup or broth. Thus, \"粿汁\" typically consists of these rice cakes or noodles served in a flavorful broth with various toppings and ingredients. The history of kway chap dates back to ancient China, where rice has been a staple food for thousands of years. Over time, different regions developed their own variations of rice-based dishes, including 粿汁, adapting to local ingredients and culinary traditions. Kway chap has evolved over centuries, influenced by cultural exchanges, migration, and trade along China's coastal regions. It has also been influenced by the influx of immigrants from different regions, leading to the incorporation of diverse ingredients and flavors into the dish. In modern times, kway chap remains a popular comfort food and street food in Southern China. It is often enjoyed as a hearty and satisfying meal, especially during breakfast or as a light lunch. While the basic concept of rice cakes or noodles in broth remains consistent, there are many regional variations of 粿汁, with different toppings, broths, and seasonings. ## Ingredients The ingredients for kway chap can vary depending on personal preference and regional variations, but common ingredients typically used include: 1. **Flat rice sheets (kway)**: These are broad, flat rice sheets that are similar to wide noodles. They are the main component of the dish. 2. **Braised pork belly**: Pork belly slices are commonly used and are braised until tender and flavorful. 3. **Pork intestines**: Cleaned and braised pork intestines add a rich flavor and chewy texture to the dish. 4. **Tofu**: Firm tofu is often included and absorbs the flavors of the broth during braising. 5. **Hard-boiled eggs**: These are often braised along with the other ingredients and take on the flavors of the broth. 6. **Bean curd skin**: Also known as tofu skin, this adds texture and absorbs the flavors of the broth. 7. **Pork skin**: Sometimes included for its gelatinous texture and flavor. 8. **Duck meat**: In some versions of kway chap, duck meat or duck offal is included for additional variety and flavor. 9. **Chinese herbs and spices**: The broth is flavored with a combination of aromatic herbs and spices such as star anise, cinnamon, cloves, and garlic, among others. The exact combination can vary. 10. **Dark soy sauce**: This is often added to the broth for color and flavor. 11. **Chili sauce**: Served as a condiment. 12. **Soy sauce**: Sometimes served alongside the dish for dipping. ## In Thailand กวยจั๊บ (kway chap) is a Thai-Chinese noodle dish consisting of wide rice noodles served in a broth with various meats and offal included. ### Kway chap nam khon (กวยจั๊บน้ำข้น) \"น้ำข้น\" (nam khon) translates to \"thick broth\" or \"rich broth.\" This variation features a broth that is typically rich and flavorful, achieved through long hours of simmering pork bones, spices, and herbs. The broth is usually thicker and more opaque compared to other versions of kway chap. It often includes a variety of pork offal, such as intestines, liver, and stomach. Additional ingredients may include hard-boiled eggs, tofu, and bean curd skin. ### Kway chap nam sai (กวยจั๊บน้ำใส) \"น้ำใส\" (nam sai) translates to \"clear broth.\" In contrast to kway chap nam khon, this variation features a clear and light broth. The broth is typically made by simmering pork bones and aromatics, resulting in a clearer soup base compared to the richer broth of nam khon. The accompaniments in kway chap nam sai are similar to those in kway chap nam khon, often including pork offal, tofu, eggs, and bean curd skin. ### กวยจั๊บญวน (Kway Chap Yuan) - \"ญวน\" (Yuan) is term referring to Vietnamese. - \"Kway Chap\" is Chinese thick noodle dish. - \"Kway Chap Yuan\" is a name referring to a Lao-Vietnamese noodle soup introduced to Northeastern Thailand from Laos. In Isan it is also known by its Laotian name: [khao piak sen](/wiki/Khao_piak_sen). ### ก๋วยเตี๋ยวเซี่ยงไฮ้ (Shanghai Noodle Salad) - This dish uses quite similar type of noodles with green color. - Mostly this noodle will combine with Thai style spicy salad with different type of meat. - It mixed very well with flavor in the Thai style salad dishes, and they also have other variants more. - There are also the different styles of this type of dishes from Thailand and China. ## In Singapore Singaporean Kway Chap is a popular dish in Singaporean cuisine, especially among the Chinese community. It consists of flat, broad rice sheets (kway) served in a flavorful herbal broth with various types of braised ingredients. The dish typically includes a variety of braised items such as pork belly, intestines, tofu, hard-boiled eggs, and sometimes duck meat or other offal. These ingredients are braised in a sticky broth made from a combination of herbs and spices, which gives the dish its distinctive flavor. Kway Chap is often served with condiments such as chili sauce and dark soy sauce. It is a hearty and comforting dish that is commonly enjoyed for breakfast, lunch, or dinner in Singapore. Many hawker centers and food stalls across the country serve Kway Chap, and it is a favorite among locals and tourists alike. ## In Malaysia Kway Chap, sometimes colloquially spelled as 'Koay Chiap' or 'Kuih Chiap' is also popular among the Northern Malaysian Chinese community, particularly in [Penang](/wiki/Penang). Kimberley Street in Penang is a well known street where many stalls serve the dish. It is also popular among the [Chinese community](/wiki/Malaysian_Chinese) in the [Sarawak](/wiki/Sarawak) and [Johor](/wiki/Johor), commonly found in restaurants that serve [Teochew cuisine](/wiki/Teochew_cuisine). The dish consists of broad rice flour noodles (kway) served in herbal broth. Hard-boiled eggs, tofu, braised pork belly, intestines, braised pig ear, duck meat and offal are usually included in the dish. Chili sauce is also served as condiments. - [Noodle soup](/wiki/Noodle_soup) Portals: - Food - China - Singapore - Malaysia - Thailand\n",
  "language": "en",
  "processed_at": "2026-01-12T11:19:31.560176",
  "title": "Kway chap",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Kway_chap"
}