{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:19:43.557951"
  },
  "content": "Public holiday, 1 MayThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Labour Day\" Singapore – news **·** newspapers **·** books **·** scholar **·** JSTOR *(April 2021)* *(Learn how and when to remove this message)* In [Singapore](/wiki/Singapore), **May Day** (or **Labour Day**) is celebrated on 1 May each year as a mark of solidarity amongst workers. The celebration of May Day as a public holiday began only in 1960 after the [People's Action Party](/wiki/People%27s_Action_Party) (PAP) came into power. Before then, only workers defined as such under the Labour Ordinance 1955 and those defined as industrial clerks under the Clerks Employment Ordinance 1957 were given paid holidays. May Day is a day of special significance for organised workers, as it serves to remind others what their collective strength has achieved for workers. By making it a public holiday, the [Government of Singapore](/wiki/Government_of_Singapore) had intended it to be a day set aside in honour of workers and their contributions to the country. It also makes it easier for workers to come together for celebrations. In the past, rallies and resolutions also form the central features of May Day celebrations. Through these activities, organised workers symbolically express their unity of purpose and their faith in solidarity. Today, May Day celebrations are increasingly planned for the enjoyment of workers and their families, which include events like the May Day Family Fiesta. ## History of May Day In the early days of Singapore, May Day rallies had the atmosphere of a persecuted sect preparing for another round of war. [S. R. Nathan](/wiki/S._R._Nathan), then Minister of Labour in 1968, quoted that May Day rallies were intended as demonstrations of worker's strength and solidarity. Militant speeches and militant attitudes were necessary as this was a time when organised labour had to struggle against the colonial government. As labour relations improved through the years, May Day presented an opportunity to celebrate the solidarity and the achievements of the democratic trade unions, and to rededicate worker's alignments to the ideal of a just society in which men are not exploited by their fellow men, and in which labour enjoys a fair share of the fruits of labour. In the 1969 May Day message, Mr. Peter Vincent, President of the [National Trades Union Congress](/wiki/National_Trades_Union_Congress) (NTUC) stated that \"May Day celebrations have undergone a change of character… less of an aggressive spirit, little or no slogan shouting and few or none of the grandiloquent resolutions. In its place there is harmony of outlook oriented towards the advancement of our developing economy\". ## Milestones ### May Day 1970 This marked the start of the Singapore Trade Union Movement's \"First Year of Development\". Workers at the [NTUC](/wiki/National_Trades_Union_Congress) rally resolved to ensure the complete success of the movement's modernisation programme in the new era. ### May Day 1971 In cognisance of the coming of age of organised labour in Singapore, May Day was restored to its correct perspective of a festive occasion for commemorating the dignity of labour in 1971. A small rally was held on the eve of May Day to honour outstanding unions and officials. Three major functions were held on May Day for workers to enjoy themselves in the company of their families and friends. ### May Day 1972 This marked the end of [wage restraint](/wiki/Incomes_policy), and in many cases, of wage freeze for labour in Singapore. It also marked the beginning of the pay-off for the effort, discipline and restraint in the last few years. It was the beginning of a pay-off not only for labour but for the people of Singapore as a whole. Starting from this May Day, it became an annual affair that the Labour Minister will announce the decision of the government with respect to the National Wages Council's recommendations for the year. However, in 1974, with the world caught up with the energy crisis, the National Wages Council, after presenting the interim recommendation in January, could not make the final recommendations in time for announcement on May Day. ### May Day 1978 The launch of the [Singapore Labour Foundation](/wiki/Singapore_Labour_Foundation) in 1978 testified to the evolution and expansion of the role of the trade union movement. Trade unions evolved from one of mere concern with traditional collective bargaining to involvement in other socio-economic areas designed to further improve the welfare of our workers. This move made the Labour Movement (NTUC et al.) a co-driver of national agenda instead of merely a bargainer. The Prime Minister in his May Day message recapitulated the anti-communist struggle in the early years. He was quoted, \"Never must such a perilous situation as that which existed from 1945-1961 ever be allowed to occur. The duty of the Government and the [NTUC](/wiki/National_Trades_Union_Congress) is to create a series of overlapping and reinforcing organic links through which every worker identifies himself directly with the building of our young nation of which he is a part\". ### May Day 1979 This year marked the 10th anniversary of NTUC’s modernisation seminar, which was the year to review and past and survey the future. In line with this, the major May Day resolution was the smooth and efficient transition from the old to the new. This was also the theme of the then Prime Minister’s message and Labour Minister’s address. ### May Day 1980 Mr Lim Chee Onn, then Secretary-General of [NTUC](/wiki/National_Trades_Union_Congress), considered May Day 1980 as a significant milestone in the history of Singapore’s labour movement’s development for two reasons. Firstly, it marked the beginning of a national effort to transform the country’s labour-intensive economy to one driven by middle-technology industries and a high-skilled labour force. Secondly, it signified the start of a plan by Singapore’s union movement to enhance the status of unionists. [Devan Nair](/wiki/Devan_Nair), then President of NTUC, considered this May Day as an occasion to rally the Singapore youth, intensify their stake in the future of the nation and give them an appreciation of the basic social, economic and political priorities of the Republic. ### May Day 1981 From 1981, the task was to foster \"greater team spirit at the work place and… the objective is higher productivity and upgraded economy to pay higher wages and benefits to all.\" Nair called on all Singaporeans to appreciate the vital importance of maximising their skills and performance. ### May Day 1984–1985 Productivity continued to be the resonating message from 1984 to 1985. In 1984, [Ong Teng Cheong](/wiki/Ong_Teng_Cheong), Secretary-General of NTUC, called for a redefinition of the role of trade unions and the adoption of new concepts to strengthen the cohesiveness of workers in the company to raise productivity. With the slowdown of the economy in 1985, the call for higher productivity through harmonious labour management was again reiterated. ### May Day 1986 May Day 1986 marked the 25th anniversary of NTUC. In his message, Ong stated that tripartite cooperation has helped to achieve a standard of living for the people of Singapore rivalled by few in the Asian region. He called for the resolve to put the true spirit of [tripartite](/wiki/Tripartism) cooperation between labour, management and the government to the test through the economic recession. ## Speaker and theme of speeches at May Day rallies YearSpeakerTheme1960Mr Lee Kuan Yew, Prime MinisterThe PAP government and the trade union movement1961Mr Lee Kuan Yew, Prime MinisterThe PAP1963Mr Lee Kuan Yew, Prime MinisterThe unity of the working class movement1964Dr Toh Chin Chye, Deputy Prime MinisterNTUC’s part in coordinating trade union activity throughout Malaysia1965Mr Lee Kuan Yew, Prime MinisterPower comes with responsibility1966Dr Toh Chin Chye, Deputy Prime MinisterCall for double efforts to boost productivity1967Dr Toh Chin Chye, Deputy Prime MinisterProblems posed by British military withdrawal1968Mr S Rajaratnam, Minister for LabourThe role of the trade union movement1969Mr S Rajaratnam, Minister for LabourThe trade union, new labour laws, employment and industrialisation1970Mr S Rajaratnam, Minister for LabourBetter times ahead1972Mr Ong Pang Boon, Minister for LabourThe national cake and the importance of increasing its size1973Mr Ong Pang Boon, Minister for LabourGovernment agrees: 9%; goodwill and good sense must prevail1974Mr Ong Pang Boon, Minister for LabourThe spirit of responsible trade unionism1975Mr Ong Pang Boon, Minister for LabourEconomic development remains a national priority1976Mr Ong Pang Boon, Minister for LabourWork together for Singapore's prosperity1977Mr Ong Pang Boon, Minister for LabourThe achievement of competitive cost is a tripartite affair1978Mr Ong Pang Boon, Minister for LabourTripartism in action1979Mr Ong Pang Boon, Minister for LabourTrade union leadership1980Mr Ong Pang Boon, Minister for LabourRestructuring our economy1981Mr Ong Teng Cheong, Minister for LabourGreater team spirit at the work place1982Mr Ong Teng Cheong, Minister for LabourWorker's welfare - an important productivity factor1983Mr Lee Kuan Yew, Prime MinisterNTUC needs self-renewal too; why house unions1984Mr Goh Chok Tong, Minister of Defence and Second Minister for HealthKeep Singapore flying on course1985Mr Goh Chok Tong, First Deputy Prime MinisterBright future since our basics are right1986Mr Goh Chok Tong, First Deputy Prime MinisterGreater team spirit at the work place1987Mr Ong Teng Cheong, Second Deputy Prime Minister and Secretary General, NTUC—N/a2004Mr. Goh Chok Tong, Prime MinisterSingapore’s core strengths: fighting spirit, unity and nimbleness, and adaptability2005Mr. Lee Hsien Loong, Prime MinisterContinue to strengthen tripartite relationship, tackle our challenges and make Singapore a small but special country2006Mr. Lee Hsien Loong, Prime MinisterTogether a bright future for all2007Mr. Lee Hsien Loong, Prime MinisterKeep Singapore special and unique through creating prosperity for a new generation of Singaporeans2008Mr. Lee Hsien Loong, Prime MinisterLiving the Singapore story – growth for the country, investing in our people and thinking long-term2009Mr. Lee Hsien Loong, Prime MinisterSingaporeans need to stand together to ride out the economic uncertainties2010Mr. Lee Hsien Loong, Prime MinisterSingapore’s long-term strategy and the importance of raising productivity2011Mr. Lee Hsien Loong, Prime MinisterCelebrating 50 years of NTUC: U & Me signifying the strong and indelible bond that the labour movement has forged with union members and workers of Singapore2012Mr. Lee Hsien Loong, Prime MinisterTo build an inclusive society and share the fruits of growth with every Singaporean2019Mr. Heng Swee Keat, Deputy Prime MinisterCelebrating 200 years of Singapore History & Pioneer Generation2020Mr. Lee Hsien Long, Prime MinisterCOVID-19's impact on Singapore's workers, economy and the road ahead2021Mr. Lee Hsien Long, Prime MinisterStrengthening the partnership, and building a brighter future for Singapore for the next 60 years and beyond2022Mr. Lee Hsien Long, Prime MinisterThe imperative to move forward, to renew, to endure and to transform ourselves has never been stronger2023Mr. Lawrence Wong, Deputy Prime MinisterThe volatile external environment, geopolitical tensions, and the risk of recession in the West - [Labour movement of Singapore](/wiki/Labour_movement_of_Singapore)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:19:43.557546",
  "title": "Labour Day (Singapore)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Labour_Day_(Singapore)"
}