{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:19:46.259822"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Labour movement of Singapore\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(May 2025)* *(Learn how and when to remove this message)* The [National Trades Union Congress](/wiki/National_Trades_Union_Congress) (NTUC) spearheads the **labour movement of Singapore**, which represents almost a million workers in the country across more than 70 unions, affiliated associations and related organisations. Singapore runs on a [tripartism](/wiki/Tripartism) model which aims to offer competitive advantages for the country by promoting economic competitiveness, harmonious government-labour-management relations and the overall progress of the nation. NTUC, along with its tripartite partners, the Singapore National Employers Federation (SNEF) and [Ministry of Manpower](/wiki/Ministry_of_Manpower_(Singapore)) (MOM), work together to tackle issues such as job re-creation, raising the effective retirement age, skills training and upgrading of the workforce, promotion of fair and progressive employment practices, and a flexible wage system, among other labour-related issues. The modernisation of the labour movement in the late 1960s has nurtured cooperation-based rather than confrontational labour relations between employees and employers. Today, rather than engaging in traditional adversarial unionism, union leaders in Singapore also sit on major statutory boards and are actively involved in state policymaking, allowing them to use negotiation, conciliation and arbitration, thus eradicating strikes and other industrial action as a form of settling labour disputes. Major strikes are a rare occurrence in Singapore; only two major strikes were observed in recent decades, once by shipyard workers in 1986 that was sanctioned by then NTUC secretary-general [Ong Teng Cheong](/wiki/Ong_Teng_Cheong), and the November 2012 [wildcat strike](/wiki/2012_Singapore_bus_drivers_strike) by [SMRT Corporation](/wiki/SMRT_Corporation)'s bus drivers. ## Tripartism in Singapore Tripartism in Singapore, which refers to the collaboration among Singapore unions, employers and the government, has been practised since 1965 when the [National Trades Union Congress](/wiki/National_Trades_Union_Congress) (NTUC) and the Singapore government signed a Charter for Industrial Progress and a Productivity Code of Practice. In the 1960s, the tripartism institution was still weak, but the formation of the National Wages Council (NWC) in 1972 and later the Tripartite Alliance for Fair Employment Practices (TAFEP) in 2007 helped strengthen ties between the members. The tripartite was set up to strive for better working conditions for employees in Singapore and to maintain harmonious employment relations through the implementation of specific policies governing labour relations. The Singapore General Labour Union (SGLU) was formed in October 1945 to help Singapore develop a stable employment environment in times of turmoil and uncertainty. SGLU was quickly renamed as the Singapore Federation of Trade Union (SFTU) in 1946, which eventually became the NTUC as we know it today. The role of NWC is to formulate wage guidelines in line with Singapore's social development and long-term economic growth. Every year, NWC convenes to discuss wage and wage-related matters, and issues guidelines pertaining to the remuneration of Singapore workers based on tripartite consensus. TAFEP works in partnership with employer organisations, unions and the government to create awareness and facilitate the adoption of fair, responsible and merit-based employment practices, providing tools and resources, including training workshops, advisory services, and educational materials, to help organisations implement fair employment practices. With the [Protection from Harassment Act 2014](/wiki/Protection_from_Harassment_Act_2014), the [Ministry of Manpower (Singapore)](/wiki/Ministry_of_Manpower_(Singapore)), NTUC and the Singapore National Employers Federation (SNEF) have also developed an advisory since 23 December 2015 fighting workplace harassment. ## History\n",
  "language": "en",
  "processed_at": "2026-01-12T11:19:46.259361",
  "title": "Labour movement of Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Labour_movement_of_Singapore"
}