{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:19:49.795848"
  },
  "content": "Singaporean tennis club The **Ladies' Lawn Tennis Club** was a [lawn tennis](/wiki/Tennis) club for women in [Dhoby Ghaut, Singapore](/wiki/Dhoby_Ghaut). Established in 1884, it was the first sporting club for women in Singapore. ## History The club was established in 1884 by solicitor Alexander Leathes Donaldson of the law firm [Donaldson & Burkinshaw](/wiki/Donaldson_%26_Burkinshaw). In May, the government permitted the club to occupy Dhoby Green, which was located at the corner of [Bencoolen Street](/wiki/Bencoolen_Street) and [Orchard Road](/wiki/Orchard_Road), after which a pavilion was constructed, painted and furnished on the grounds for $632. The club was endorsed as the Ladies Tennis Club in July and was led by a committee comprising five women and two men. The club's rules were drawn up and passed during a meeting at the [Town Hall](/wiki/Victoria_Theatre_and_Concert_Hall) on 29 September. By then, the club had 69 subscribers, with seven courts at Dhoby Green. The club was rather exclusive and admittance was hard to come by. The clubhouse was located on Penang Lane. Men were allowed in the club but only as subscribers; only women could obtain membership. Then colonial secretary of the [Straits Settlements](/wiki/Straits_Settlements) [Cecil Clementi Smith](/wiki/Cecil_Clementi_Smith) and his aunt were invited to become an honorary member and the lady patroness respectively. The first competitive match held at Dhoby Green took place on 1 December. In 1905, a new clubhouse was built at Dhoby Green. By then, the club had expanded to include 12 tennis courts and two [croquet](/wiki/Croquet) courts, as well as a $5,000 pavilion, and had over 270 members. However, by the 1920s, many other clubs had begun offering tennis, and the club's membership began dwindling. The club closed in July 1932, and Dhoby Green was taken over by the [YMCA](/wiki/YMCA) on 1 August. ## Former tournaments The club was one of the first in Asia to stage open tennis tournaments including. - [Singapore LLTC Spring Open](/wiki/Singapore_LLTC_Spring_Open) (1886-1905), - [Singapore LLTC Summer Open](/wiki/Singapore_LLTC_Summer_Open) (1885-1896) - Singapore LLTC Autumn Open (1889-1892), - Singapore LLTC Winter Tournament\n",
  "language": "en",
  "processed_at": "2026-01-12T11:19:49.795490",
  "title": "Ladies' Lawn Tennis Club",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Ladies%27_Lawn_Tennis_Club"
}