{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:19:51.011697"
  },
  "content": "Historic Chinese opera house in SingaporeThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Lai Chun Yuen Opera House\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(June 2022)* *(Learn how and when to remove this message)* **Lai Chun Yuen Opera House** was a [Cantonese](/wiki/Cantonese) opera house that was built before 1887 and located on [Smith Street](/wiki/Smith_Street,_Singapore), [Chinatown](/wiki/Chinatown,_Singapore), Singapore. It was owned by Lin Dingxing and subsequently, Loh Ghim. [Chinese opera](/wiki/Chinese_opera) performances have religious significance for the [Chinese](/wiki/Chinese_people) as they believe it entertains the gods and spirits. ## History The opera house was designed in the style of a traditional three levels Chinese teahouse with balconies. There are small tables on the first level for the audiences. The stage was located on the second floor. This was designed by [Regent Alfred John Bidwell](/wiki/Regent_Alfred_John_Bidwell) from Swan and Maclaren, whose portfolio includes other notable buildings such as [Raffles Hotel](/wiki/Raffles_Hotel) and [Stamford House](/wiki/Stamford_House). His works are prominent as he considered the usage of the buildings for the clients and clientele. The opera house was able to accommodate 834 people. It was a well-frequented opera house as it provided a form of entertainment for the immigrants. The popularity of the opera house is evident by its twice daily plays. The architecture design followed that of Chinese buildings – decorated corbel brackets, architrave tie ends, steps and door nail studs. Other opera houses, such as Heng Wai Sun and Heng Seng Peng Opera Houses, which were located mainly on Wayang Street in Singapore. Even though “Wayang Street” was “Theatre Street” translated from [Malay](/wiki/Malays_(ethnic_group)), it was not the hub of the entertainment business. The main entertainment district was on Smith Street. Lai Chun Yuen Opera House was able to attract many famous Cantonese performers such as Leng Yuen Hung, Ma Si Chang and Hung Sin Nui in the early 1900s. Famous performers could earn up to 450 to 700 dollars a day, which was a hefty sum for that era. According to a visitor, no other places in Singapore could be compared with the Lai Chun Yuen Opera House. However, the place was the epitome of vice as Smith Street was the red-light district back then. There were private cubicles designed for discreet activities and [opium](/wiki/Opium) smoking was a common sight in the theatre as it was normal in the era. Ironically, the theatre would sometimes be used for [fund-raising](/wiki/Fundraising) activities for campaigns such as “Canton Flood Relief Fund”. These activities were huge successes as they were able to hire famous performers. Hence, the Opera House was able to raise funds from the public tickets and by auctioning off performer’s items, which were well received. In the late 1920s, movies were invented and introduced to the world. This had greatly impacted Lai Chun Yuen’s business as people preferred “[talking films](/wiki/Talking_film)” as compared to opera shows. The increase in [cinema halls](/wiki/Cinema_hall) in amusement parks like the [Great World City](/wiki/Great_World_Amusement_Park) was a competition to the opera house. The owner of the opera house wanted to include a movie room to ensure the opera house’s survival but eventually the opera house was rented to the [Shaw Brothers](/wiki/Shaw_Brothers_Studio) and the opera house was renamed Sun Seng Theatre. However, the business did not last long as the theatre was bombed during [World War II](/wiki/World_War_II). Much of the building was destroyed and the building was only repaired after the war. After the restorations, the building was used for a merchandise shop and then a warehouse for street hawkers. The building was restored in the 1990s and was donated to [Buddhist Tzu Chi Charity Foundation (Singapore)](/wiki/Tzu_Chi) for use as a headquarters. Due to the expansion of the foundation, the building was insufficient for usage and was subsequently returned in 2007. Since 2007, the building was put on sale and in 2010, it was sold as part of an en bloc sale with surrounding units for a total of $51.8 million to Royal & Sons. The building was then converted into Santa Grand Hotel Lai Chun Yuen, part of the Santa Grand Hotel chain. ## Current building This section needs to be **updated**. Please help update this article to reflect recent events or newly available information. Last update: Hotel operator has changed multiple times (Santa Grand Hotel → Opera House Hotel → Hotel 1887 → Hotel Calmo Chinatown). Not clear if decor has been retained. *(June 2022)* In line with the [zoning](/wiki/Zoning) of the neighborhood for commercial purposes, much of the ground level is occupied by [storefronts](/wiki/Storefront), while the interior of the building has been repurposed for use as a hotel. This takes advantage of its strategic location in Chinatown which is promoted by the [Singapore Tourism Board](/wiki/Singapore_Tourism_Board) as a major tourist destination in Singapore. The small cubicles used for private activities back in the opera days have been converted into hotel rooms, escalators were built for ease of moving between floors, and steel structures were installed from ground to ceiling to reinforce the old building. The biggest change is that the stage on the second floor has been torn down and replaced by a sitting area in the hotel for the guests. The hotel has displays of artifacts and paintings from the Chinese opera. However, the artefacts were not from the original Lai Chun Yuen Opera House, but were bought and designed[*clarify*] by the owner of Opera House Hotel. There are also information boards all around the hotel educating the guests on Chinese opera. As such, numerous curious guests and passer-by have also approached the manager to enquire on the history of the hotel. Although this is most attention that the opera house would receive – passing curiosity. Despite scholarly and news articles written on it, it is still not widely known or recognised. As of November 2022, the building is used by Hotel Calmo Chinatown.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:19:51.011133",
  "title": "Lai Chun Yuen Opera House",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Lai_Chun_Yuen_Opera_House"
}