{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:20:03.180885"
  },
  "content": "Coffee roaster and shop in SingaporeThe topic of this article **may not meet Wikipedia's notability guidelines for companies and organizations**. Please help to demonstrate the notability of the topic by citing reliable secondary sources that are independent of the topic and provide significant coverage of it beyond a mere trivial mention. If notability cannot be shown, the article is likely to be merged, redirected, or deleted. *Find sources:* \"Lam Yeo Coffee Powder Factory\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(May 2022)* *(Learn how and when to remove this message)* **Lam Yeo Coffee Powder Factory**, also known as simply **Lam Yeo Coffee Powder**, is a shop selling roasted coffee beans and coffee powder blends along [Balestier Road](/wiki/Balestier_Road) in [Balestier](/wiki/Balestier), Singapore. ## History Originally beginning as a door-to-door business in 1959, the Lam Yeo Coffee Powder Factory was constructed in 1960 on 328 Balestier Road, selling roasted coffee beans coffee powder blends. The name of the shop comes from the Hokkien translation of \"Nanyang\", as the original owner, Tan Thian Kang, who set up the store with his wife Lim Chok Tee, formerly worked as a deputy editor at the *[Nanyang Siang Pao](/wiki/Nanyang_Siang_Pao)*. Tan passed ownership to his son, Tan Bong Heong, who later passed ownership to his son, Benny Tan. The coffee blend \"Manheling\", which is from [Sumatra](/wiki/Sumatra), is one of the most popular blends sold at the shop. The shop remains profitable, having reported a yearly growth by 10% in 2013. In 2020, the shop is included in [National Heritage Board](/wiki/National_Heritage_Board_(Singapore))'s Street Corner Heritage Galleries programme. The shop has been included in the Balestier Heritage Trail. 1°19′26″N 103°50′59″E﻿ / ﻿1.3238°N 103.8497°E﻿ / 1.3238; 103.8497 This article about a Singapore building or structure is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:20:03.180415",
  "title": "Lam Yeo Coffee Powder Factory",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Lam_Yeo_Coffee_Powder_Factory"
}