{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:20:04.772402"
  },
  "content": "Chinese-American conductorThis biography of a living person **needs additional citations for verification**. Please help by adding reliable sources. Contentious material about living persons that is unsourced or poorly sourced **must be removed immediately** from the article and its talk page, especially if potentially libelous. *Find sources:* \"Lan Shui\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(October 2023)* *(Learn how and when to remove this message)* **Lan Shui** ([Chinese](/wiki/Simplified_Chinese_characters): 水蓝, born 1957) is an American conductor. He was the music director of the [Singapore Symphony Orchestra](/wiki/Singapore_Symphony_Orchestra) from 1997 to 2019. He has retired as Music Director on 26 January 2019, and was given the title of Conductor Laureate by chairman of the SSO Mr Goh Yew Lin. Born in [Hangzhou](/wiki/Hangzhou), [China](/wiki/China), Shui is the son of a doctor and a banker. He began his musical studies on violin, but the [Cultural Revolution](/wiki/Cultural_Revolution) interrupted his violin studies, and a subsequent football injury ended his dreams of becoming a violinist. At the [Central Conservatory of Music](/wiki/Central_Conservatory_of_Music) in [Beijing](/wiki/Beijing), he focused on conducting and composition, and worked regularly with the [Beijing Symphony Orchestra](/wiki/Beijing_Symphony_Orchestra). He continued his musical studies in the US at [Boston University](/wiki/Boston_University) and [Tanglewood](/wiki/Tanglewood), where his instructors included Michael Charry, David Hoose, and classes at Tanglewood with [Leonard Bernstein](/wiki/Leonard_Bernstein). He served as an assistant conductor with the [Baltimore Symphony Orchestra](/wiki/Baltimore_Symphony_Orchestra), and associate conductor with the [Detroit Symphony Orchestra](/wiki/Detroit_Symphony_Orchestra). [Choo Hoey](/wiki/Choo_Hoey) invited Shui to the [Singapore Symphony Orchestra](/wiki/Singapore_Symphony_Orchestra) (SSO) in 1993. Shui succeeded Hoey as music director in 1997. His work in contemporary music has included leading the world premiere of Bernard Tan's Violin Concerto in January 2006, with the orchestra's leader [Lynnette Seah](/wiki/Lynnette_Seah) as soloist. With the SSO, Shui has made commercial recordings for the BIS label. From 2007 to 2015, he was chief conductor of the [Copenhagen Philharmonic](/wiki/Copenhagen_Philharmonic). He was formerly principal guest conductor of the Aalborg Symphony Orchestra. He also appears semi-regularly with the [National Taiwan Symphony Orchestra](/wiki/National_Taiwan_Symphony_Orchestra). ## Accolades Shui is the recipient of several international awards, including the Boston University's Distinguished Alumni Award. He also received the [Cultural Medallion](/wiki/Cultural_Medallion) in 2009 in recognition of his work for the Singapore Symphony Orchestra. ## Personal life Shui is a permanent resident of Singapore. Shui has been married twice. He has a son from his first marriage, and a son from his second marriage. - Harrison Parrott agency biography of Lan Shui Preceded by[Choo Hoey](/wiki/Choo_Hoey) **[Music Director, Singapore Symphony Orchestra](/wiki/Singapore_Symphony_Orchestra)** 1997–presentSucceeded byincumbentPreceded by[Giordano Bellincampi](/wiki/Giordano_Bellincampi) **[Principal Conductor, Copenhagen Philharmonic Orchestra](/wiki/Copenhagen_Philharmonic_Orchestra)** 2007–2015Succeeded byToshiyuki Kamioka This article about a Singaporean musician is a stub. You can help Wikipedia by expanding it. - v - t - e This article about a classical musician is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:20:04.772070",
  "title": "Lan Shui",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Lan_Shui"
}