{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:20:07.663417"
  },
  "content": "Chinese venture capital firm **Lanchi Ventures** (LCV; [Chinese](/wiki/Simplified_Chinese_characters): 蓝驰创投; [pinyin](/wiki/Pinyin): *Lánchí Chuàngtóu*) is a Chinese [venture capital](/wiki/Venture_capital) (VC) firm that focuses on early stage companies and is headquartered in Beijing and Singapore. It was previously the China arm of BlueRun Ventures (BRV). As of 2024, Lanchi Ventures has invested in over 200 companies. ## Background The origins of LCV can be traced to Nokia Venture Partners, a VC platform established by [Nokia](/wiki/Nokia) in 1998. In early 2005, Nokia Venture Partners was spun off into an independent firm called BlueRun Ventures which is based in [Menlo Park, California](/wiki/Menlo_Park,_California). The name change was done to prevent confusing people that it was still connected to Nokia although Nokia remained an investor in its funds. BRV invested in [PayPal](/wiki/PayPal) and [Pogo.com](/wiki/Pogo.com). In the same year BRV expanded into China by launching BRV China with its first office being in Shanghai. Jui Tan who had joined BRV in 2001 was the founding partner of BRV China. In December 2007, BRV China opened an office in Beijing making it the second office in China. In 2010, BRV China split from BRV to become an independent firm. However it kept the BRV brand name to reflect its \"same investment philosophy\" and \"profound friendship\" with BRV. In November 2019, BRV China stated it would invest in healthcare and new modes of consumption as there are changes in the [demographics of China](/wiki/Demographics_of_China). In July 2023, Tan said although there were geopolitical risks between the US and China, they were less of an issue for BRV China as it operates separately from BRV despite operating under the same brand name. BRV aimed to allocate over 50% of its latest fund to [Artificial intelligence](/wiki/Artificial_intelligence) (AI) startup companies in China. In September 2023, BRV China announced that it would be dropping the BRV brand name and renaming itself to Lanchi Ventures. This made it the second big VC firm in China to distance itself from its US origins after [HongShan](/wiki/HongShan) split from [Sequoia Capital](/wiki/Sequoia_Capital). Due to rising tensions in [China–United States relations](/wiki/China%E2%80%93United_States_relations) there was an increase in scrutiny of American investment in China's technology sector. BRV was the fourth-largest US investor in China's AI industry between 2015 and 2021 by number of transactions, according to the [Center for Security and Emerging Technology](/wiki/Center_for_Security_and_Emerging_Technology). In July 2024, it was reported that LCV was expanding into Hong Kong to connect global markets with Chinese AI entrepreneurs. Notable investments by LCV include [Li Auto](/wiki/Li_Auto), [Mogujie](/wiki/Mogujie), [Guazi.com](/wiki/Guazi.com). - Official website - English website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:20:07.663059",
  "title": "Lanchi Ventures",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Lanchi_Ventures"
}