{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:20:12.996908"
  },
  "content": "[Singapore](/wiki/Singapore) embraces an English-based bilingual education system. Students are taught subject-matter curriculum with English as the medium of instruction, while the official [mother tongue](/wiki/Mother_tongue) of each student - Mandarin Chinese for Chinese, Malay for Malays and Tamil for South Indians – is taught as a second language. Additionally, Higher Mother Tongue (HMT) is offered as an additional and optional examinable subject to those with the interest and ability to handle the higher standards demanded by HMT. The content taught to students in HMT is of a higher level of difficulty and is more in-depth so as to help students achieve a higher proficiency in their respective mother tongues. The choice to take up HMT is offered to students in the Primary and Secondary level. Thereafter, in [junior colleges](/wiki/Junior_college_(Singapore)), students who took HMT at the secondary level have the choice to opt out of mother tongue classes entirely. Campaigns by the government to encourage the use of official languages instead of home languages (e.g. other [Chinese varieties](/wiki/Varieties_of_Chinese)) have been largely successful, although English seems to be becoming the dominant language in most homes. To date, many campaigns and programmes have been launched to promote the learning and use of mother tongue languages in Singapore. High ability students may take a third language if they choose to do so. The **language education in Singapore** has been a controversial topic in Singapore - although Singaporeans are becoming increasingly English-dominant speakers, many have not achieved a good grasp of their mother tongue. This results a separate controversy regarding the assigned weightage of mother tongue in major examinations such as the [PSLE](/wiki/PSLE) and [GCE Ordinary Level](/wiki/GCE_Ordinary_Level) as parents worry that children who are taught English as a first language and who are brought up in English-speaking families are at a disadvantage for not knowing their mother tongue well. ## Background Singapore is a racially and linguistically diverse city-state, with four official languages: [English](/wiki/English_language), [Mandarin Chinese](/wiki/Mandarin_Chinese), [Malay](/wiki/Malay_language) and [Tamil](/wiki/Tamil_language). During British colonial rule (1819-1942), a variety of school systems were in place and most schools taught exclusively in one of the above four languages. After World War II, schools were gradually brought under government control and the government recognised that a *[lingua franca](/wiki/Lingua_franca)* was needed to facilitate communication among the different racial and dialect groups. Malay was briefly considered for this role, in anticipation of the merger with Malaysia. However, English was eventually selected as the common language. Due to the status of English as a [world language](/wiki/World_language) and the desire for Singaporeans to retain their cultures, the government encourages Singaporeans to be fluent in both English and their mother tongue. In this context, the mother tongue of a Singaporean refers to the official language assigned to their racial group (Mandarin for [Chinese](/wiki/Chinese_in_Singapore), Malay for [Malays](/wiki/Malays_in_Singapore) and Tamil for most [Indians](/wiki/Indians_in_Singapore)), regardless of the language spoken at home. The bilingual education policy was officially introduced in 1966 and in its early stages, English could be taught as either the first language or the second language. However, schools teaching English as a second language saw a rapid decline in enrolment and many closed down or switched to teaching English as the first language. This resulted in the mother tongue being taught only as an academic subject. Thus all other lessons and activities conducted beyond the classroom are conducted in English, with the exception of moral education and mother tongue; this is unlike the typical bilingual education models where academic content is taught in two languages. This applies throughout primary school (six years), secondary school (four or five years) and junior college (two years, 20% of cohort) education. However, [Special Assistance Plan](/wiki/Special_Assistance_Plan) (SAP) schools, where some activities are conducted in Mandarin, private schools such as [madrasahs](/wiki/Madrasa), international schools and special education schools are exceptions to the system. In tertiary institutions, such as universities, polytechnics and the [Institute of Technical Education](/wiki/Institute_of_Technical_Education) (ITE), languages are no longer academic subjects almost all content is taught in English, with the exception of some courses on Chinese Studies. In 2011, the [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) Fund for Bilingualism was set up to aid the [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)) (MOE) in their efforts to promote the teaching and learning of the English language and the mother tongue languages. ## English The [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)) places heavy emphasis on English, believing that \"mastery of English is vital to Singapore's pupils\" because English is \"the language of administration, education, commerce, science, technology, and global communication\". English skills are assessed through written examinations, oral examinations and listening comprehension. Written examinations include composition writing and comprehension passages, while in oral examinations, students are asked to verbally read passages and describe pictures. The primary school syllabus aims to develop speaking and listening skills, as well as to nurture students into independent readers who can express their ideas in writing. In secondary school, students are expected to speak and write in grammatically correct English tailored to purpose, audience and context. [Junior college](/wiki/Junior_college_(Singapore)) students are assumed to be fluent in English. Hence, at this level English as an academic subject is replaced by [General Paper](/wiki/General_Paper), where students formulate analysis and arguments about current issues. English language teaching originally focused on [grammar](/wiki/English_grammar) (primary school students were taught over a hundred sentence structures) and oral skills (there were frequent speech drills). A syllabus review in 1981 removed many enrichment activities to enable more students to develop functional literacy in English. Ten years later, another syllabus review replaced grammar teaching with compulsory fiction reading. However, the increasing prevalence of [Singlish](/wiki/Singlish) sparked concerns about declining English standards, leading to a renewed focus on \"systematic and explicit instruction of grammar\" in subsequent syllabus reviews. In 2010, the Ministry of Education engaged language facilitators to conduct enrichment lessons (such as storytelling and drama) in primary schools and announced plans to set up an English Language Institute of Singapore (ELIS) to provide training for English teachers. ### English Language support for dyslexic students To support dyslexic students who are struggling with foundational aspects of English (e.g. basic literacy), the MOE has implemented the Learning Support Programme (LSP) and School-based Dyslexia Programme (SDR) in all of its public schools. Eligibility for the LSP is extended to students at the Primary 1 and 2 levels, while those at Primary 3 and 4 can opt in for the SDR. ### Changes in PSLE English Syllabus From 2025, there are some changes made to the PSLE English paper. The key changes include: ComponentChange in WeightageSectionChange in Requirements and/or FormatPaper 1 (Writing)Reduced from 27.5% to 25%Situational WritingTotal mark reduced **from** **15 marks** (6 marks for Task Fulfilment, 9 marks for Language) **to 14 marks** (6 marks for Task Fulfilment, 8 marks for Language. **1 bullet point** will require students to **offer their own ideas**. Continuous WritingTotal mark reduced **from 40 marks** (20 marks each for Content and Language) **to 36 marks** (18 marks each for Content and Language).Paper 2 (Language Use and Comprehension)Reduced from 47.5% to 45%Visual Text**Total mark** and **number of questions** reduced **from 8 to 5**. Students will be given **2 texts instead of 1**. **1 question** will require students to **make comparisons between the 2 texts**. Editing**Total mark** and **number of questions** reduced **from 12 to 10**.Paper 4 (Oral)Increased from 15% to 20%Reading Aloud**Total mark** increased **from 10 marks to 20 marks**. A **preamble** stating the purpose, audience and context will be provided. Stimulus-based Conversation (SBC)**Total mark** increased **from 20 marks to 25 marks**. A **real-life photograph** instead of a poster or drawing will be used as the stimulus. Only **3 main prompts** will be asked. ## Mother Tongue Although English is the language of instruction in Singapore schools, Mother Tongue is a compulsory subject at the [Primary School Leaving Examination](/wiki/Primary_School_Leaving_Examination) (PSLE), [Singapore-Cambridge GCE Ordinary Level](/wiki/Singapore-Cambridge_GCE_Ordinary_Level) ('O' Level) and [Singapore-Cambridge GCE Advanced Level](/wiki/Singapore-Cambridge_GCE_Advanced_Level) ('A' Level). Students with strong aptitude for their mother tongue could take up Higher Mother Tongue (together with standard Mother Tongue) at the PSLE and 'O' Levels. If they pass 'O' Level Higher Mother Tongue, they need not study Mother Tongue in junior college, but can choose to take Mother Tongue Literature. In [secondary school](/wiki/Secondary_schools_in_Singapore), interested students may study a third language, such as [Mandarin](/wiki/Mandarin_Chinese) (for non-Chinese); [Malay](/wiki/Malay_language) or [Indonesian](/wiki/Indonesian_language) (for non-Malays); [Arabic](/wiki/Arabic_language), [Japanese](/wiki/Japanese_language), [French](/wiki/French_language), and [German](/wiki/German_language) (the last three are restricted to the top 10% of the PSLE cohort). In 1972, both languages were given double weighting at PSLE. However, since 1980, both languages, along with mathematics and science, have been given equal weighting of 25%. High dropout rates sparked the 1979 introduction of a streaming system, whereby the academically weakest students were transferred to the Monolingual stream and prepared for vocational education. This was replaced in 1992 by EM1 (for top students), EM2 (for average students) and EM3 (for the weakest students) at the primary level, followed by Special, Express, Normal Academic and Normal Technical at the secondary level. Policymakers assumed a correlation between intelligence and language learning, to the extent that the only difference between EM1 and EM2 was that the former offered Higher Mother Tongue (likewise for Special and Express). In 2004, the Ministry of Education started replacing the streaming system (first merging EM1 and EM2) with the current system of ability banding for each subject. ### Mother Tongue Exceptions In certain situations, students are allowed to opt for a simpler Mother Tongue syllabus (Mother Tongue 'B' Syllabus) or a complete exemption from mother tongue lessons altogether. One possible situation where this applies is when a student has learning disabilities, such as [dyslexia](/wiki/Dyslexia), which makes it difficult for him or her to write the language. Another situation would be that a student has been living abroad and hence has no contact with his or her mother tongue for many years. In the latter case, a student can opt to study an unofficial language such as French, German or Japanese as their mother tongue. Such situations are assessed on a case-by-case basis. ### Mandarin Chinese Mandarin Chinese, known simply as Chinese, is the official language representing the Chinese community and the home language of 47.7% of Chinese Singaporeans. Other [Chinese varieties](/wiki/Varieties_of_Chinese), such as [Hokkien](/wiki/Hokkien), [Teochew](/wiki/Teochew_dialect), [Cantonese](/wiki/Cantonese), [Hakka](/wiki/Hakka) and [Hainanese](/wiki/Hainanese), remain widely spoken (home language of 19.2% of Chinese Singaporeans), but the government discourages their use through the [Speak Mandarin Campaign](/wiki/Speak_Mandarin_Campaign). Mandarin was first introduced to Singapore during British colonisation through Chinese schools in the 1920s, since then, it has gained popularity. After Singapore gained independence, the government has maintained continuous efforts to promote the language at the expense of other Chinese varieties in an effort to benefit from China's increasing importance on the world stage, although they claimed that it is to ensure that Chinese Singaporeans know about their ethnic roots, culture and maintain traditional [Asian values](/wiki/Asian_values). Further efforts to encourage the use of Chinese include Chinese-medium SAP schools, which teach both English and Chinese as first-language standard. #### Chinese Education Changes The following table summarises the changes made with regard to the Chinese Language syllabus. YearRevisions made to SyllabusMore information1999Increase number of students to take HCL (Higher Chinese Language)HCL (Higher Chinese Language) introduced to encourage students' with a strong aptitude for Chinese to develop their skills further.1999Admission to SAP Schools.Increase intake from top 10% of PSLE cohort to 30%.2006Chinese handheld dictionaries allowed into examinations.–2008Introduction to Modular approach.For Primary 1 to Primary 4. (see below for details)2010Revision in PSLE examination format.– #### Syllabus The basic aims of the Chinese syllabus are the master of a specific number of characters from a designated list for each level. #### Curriculum The new Chinese-language curriculum aims to make language learning more enjoyable, in hope that the students would take Mandarin beyond the classroom. Key learning areas include listening and speaking more, as well as building a firm foundation in Chinese character learning skills in lower primary before developing essay skills in upper primary. The Ministry of Education has taken on a differentiated approach in ensuring that each student will learn the language to the best of their abilities via a step-by-step process: - Bridging Module - For students with little or no Chinese-language background - Aims to provide support and foundation in basic speaking and writing skills - Once the student is ready, they may then continue with the Core Module - Core module - For students who have an interest in Chinese - Aims to develop and build literacy - Makes up 70%–80% of curriculum time throughout primary school - Is examined at PSLE - Enrichment module - For students in the Core Module who have a higher ability and interest in pursuing the language further - Aims to encourage extensive reading As of now, the education board is looking into making language learning more interesting and IT-based. For example, language learning through the use of smart phones and online computer games. The following table summarises the changes made with regard to the expanding the education of teaching the Chinese language. Unlike the table above, it focuses on how the Chinese language can be greater appreciated through a more holistic teaching of mother tongue languages. YearEducation ChangesMore information1999Nan Hua Secondary School added to list of SAP schools.–1999Introduction of 'Introduction to Appreciation of Chinese' enrichment programme in SAP schools.–2006'Literature in Chinese' offered for 'O'-level examinations.2006Changes in exam format.Emphasis on memorising decreases while context-understanding is greater emphasised.2007Choice of additional mother tongue.Requirements from previously (top 30% of PSLE cohort) relaxed. Students are offered another mother tongue subject that is not their native mother tongue so long as they have an interest.2007Bicultural Studies Programme.Students interested in pursuing studies in two cultures are allowed to take up electives such as Chinese History and Chinese Philosophy. ### Malay As Malays are the indigenous people of Singapore, the Malay language, specifically in [Rumi](/wiki/Rumi) (Roman script) rather than [Jawi script](/wiki/Jawi_script), is ceremonially recognised as the national language of Singapore. Once the lingua franca of Southeast Asia, Malay is the home language of 82.7% of Malay Singaporeans, as of 2010. During the period of British colonisation, instilling basic literacy and numeracy were the aims of the then available Malay-medium primary schools built by the government, in addition to maintaining the Malay culture. In contrast, the colonial government did not provide for the Chinese and Tamil vernacular schools. By 1986, only a single class of 28 students at the end of their Malay-medium secondary education remained, with no primary level students left. Malay-medium schools thus came to a natural demise, as children ceased to register for Malay-medium education. This was unlike the Chinese-medium schools, which were removed by the government. Currently, the status and development of the Malay language in Singapore is overseen by the Malay Language Council of Singapore (Majlis Bahasa Melayu Singapura), which was first established in April 1981. In addition to standardising Malay spelling in Singapore, the council also promotes the usage of the Malay language through the Malay Language Month (Bulan Bahasa Melayu Singapura), first introduced in 1962. The Malay Language Month aims to ensure the continuity of the language as a strong part of the Malay heritage through activities like performances, competitions, and workshops. It also aims to encourage the use of the language in the daily lives of its native speakers. This is a way to ensure that the language retains its relevance in the society for generations to come. #### Syllabus Primary School: The primary level of the Malay language syllabus covers the foundations of students' proficiency at listening, speech, reading, and writing in Malay. The table below outlines the intended learning outcomes of the syllabus. Syllabus stageListeningSpeechReadingWritingPrimary 2Hear and understand messages, stories, and nursery rhymes.Speak clearly using appropriate reference.Comprehend text from essays, poetry, and song.Write a paragraph.Primary 4Hear and understand children's stories, advertisements, dialogues, and poetry.Speak clearly and efficiently using standard pronunciation, intonation, and pauses.Comprehend text from short stories, essays, and poetry.Write narrative, descriptive, or functional prose.Primary 6Hear and understand speeches, news, short stories, novels, and poetry.Speak clearly, smoothly and effectively, using standard pronunciation, intonation, and pauses.Comprehend text from essays, short stories, novels, and poetry.Write various types of text. Recently, the [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)) enabled increased flexibility in the Malay language curriculum, at the Lower Primary level (Primary 1–3), by introducing \"ability banding or differentiated instruction within a class\". The following table summarises the changes made with regard to the Malay language curriculum: YearRevisions made to SyllabusMore information2006Less emphasis on rote memory in PSLE.Increased emphasis on contextual understanding and increased weighting for speaking/listening aspect.2008New Malay language curriculum for Primary 1–4.–2009New Malay language curriculum for Primary 5.–2010New Malay language curriculum for Primary 5.– In [Secondary School](/wiki/Secondary_schools_in_Singapore), the secondary level of the Malay language syllabus aims to further students' acquisition and use of effective Malay language, such that their enhanced communication skills will facilitate their appreciation of the Malay language, literature, culture, and values. The following table summarises the changes made with regard to the teaching of the Malay Language.Unlike the table above, this focuses on a greater flexibility for the teaching of Malay in order to provide more opportunities for a student to study the language. YearRevisions made to SyllabusMore information1960Secondary Malay-medium classes were started at Geylang Craft Centre, Monk's Hill, Kallang, and Serangoon.–1961Malay-medium secondary schools were built.–1967MOE accepted new Malay spelling system adopted by Malaysia and Indonesia in 1973[*citation needed*]–1987Malay Language Elective Programme introduced.Non-Malay Secondary 1 pupils who are in the top 10% of their PSLE cohort are eligible if they have never learnt Malay in primary school.2001Elective Programme in Malay Language for Secondary Schools (EMAS) introduced in Bukit Panjang Government High School and Tanjong Katong Secondary School.Four-year Higher Malay programme. In addition, the pupils could offer Malay Literature.2007Students of the Malay Special Programme (formerly known as the Malay Language Elective Programme) will be awarded two bonus points for admission to junior college.Only eligible if they pass their third language O-levels.2008All Secondary 1 pupils from Express and Normal (Academic) courses offered [Indonesian](/wiki/Indonesian_language) and [Arabic](/wiki/Arabic_language) as Third Languages.Lessons twice a week outside school curriculum time, for two hours per session, at the [Ministry of Education Language Centre](/wiki/Ministry_of_Education_Language_Centre). #### Examination Structure The Malay examination for PSLE consists of 2 papers, listed in the table below. Paper TypeExamination structurePaper 12 essays in total. One chosen from a list of topics given, and a choice of one from the two picture based questions.Paper 2 (Booklet A)Focuses on Imbuhan (affixes), proverbs and comprehension. All are in [multiple choice question](/wiki/Multiple_choice_question) format.Paper 2 (Booklet B)Focuses on comprehension and 2 language components : Golongan Kata, and Frasa.Paper 3Oral and Listening Comprehension The Malay examination for O Levels consists of 3 papers, listed in the table below. Paper TypeExamination structurePaper 1Composition which focuses on email, and another description/narrative/expository essay (depending on what the student chooses)Paper 2Explores language-use through comprehension, fill-in-the-blanks/Open-ended questionsPaper 3Oral and Listening Comprehension ### Tamil The Indian community speaks many languages, but as Tamils form the largest group (60% of Indian Singaporeans), Tamil is the official language representing the Indian community and the home language of 36.7% of Indian Singaporeans. Tamil-medium education ended in 1982 when the only Tamil-medium secondary school, the Umar Pulavar Tamil High School, closed down, but Tamil remains taught as a mother tongue. #### Syllabus In Primary School, the objective of studying the language would be to learn the basic language skills in listening, writing and speaking, while also explaining the cultural values and values needed for the growth of Singapore. Students are taught basic language skills and thinking skills, as well as areas regarding national education, information technology, social and emotional learning through a specific number of Tamil lessons every week. The primary school syllabus is also divided into 3 different triangles which target various areas of learning. These triangles include Triangle typeTarget areaGreen TriangleOral and Aural communicationBlueReadingPurpleWriting The triangles are also listed in a decreasing order of emphasis. Hence, there is an added focus on speaking and listening of the Tamil language. In Secondary school, the objective is to ensure that Tamil is a living language among Singaporean Tamil students. Students are taught to understand instructions, stories and debates about the Tamil Language, and are also educated about Tamil customs. Students are also expected to speak with correct intonation and pronunciation, and achieve fluency in reading and writing the language. Students are also taught to listen and read paragraphs appropriate for their age. They will also be expected to converse fluently in spoken and written Tamil. In addition, students will read poems, simple essays and short stories. Just as in primary school, there is an emphasis on the oral and aural components of the language. #### Examination structure In primary school, Tamil skills are evaluated through essay writing, written comprehension, listening comprehension and oral communication. Tamil examinations in secondary school include essay and letter writing, sentence completion, written comprehension, listening comprehension and oral components. In 2006, the Tamil syllabus was reformed to increase weighting of speaking and listening components at the PSLE, teach spoken Tamil instead of the formal variety and reduce emphasis on rote memorisation. #### Other Indian Languages To meet the needs of smaller linguistic groups within the Indian community, five other Indian languages, namely [Bengali](/wiki/Bengali_language), [Gujarati](/wiki/Gujarati_language), [Hindi](/wiki/Hindi), [Punjabi](/wiki/Punjabi_language) and [Urdu](/wiki/Urdu), have been offered as mother tongues since the early 1990s. Lessons are held outside school hours at special centres run by seven Indian community groups, who employ their own teachers and design their own syllabuses. #### Tamil outside of the school Some primary and secondary schools do not have sufficient resources or Tamil students to offer Tamil language classes within school hours. Tamils studying in these schools are required to take their Tamil lessons outside school hours, either at the [Umar Pulavar Tamil Language Centre](/wiki/Umar_Pulavar_Tamil_Language_Centre) (UPTLC) or one of the eleven school-based Tamil language centres. The Tamil Language Learning Promotion Committee (TLLPC) was established in 2006 by the MOE. Its establishment is aimed at garnering the support from other Tamil organisations who would be able to contribute resources towards events and programmes that promote the teaching and learning of the Tamil language. ## Higher Mother Tongue Language (HMTL) Higher Mother Tongue is an optional subject offered to eligible students at primary and secondary school levels. The [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)) aims to help students with the ability, aptitude and interest in MTL to achieve higher levels of language proficiency and cultural knowledge through HMTL. Over the years, there has been an increase in the percentage of students taking Higher Mother Tongue Languages (HMTL) at PSLE and 'O' level. In 2003, 17.6% and 16.3% offered Higher Mother Tongue at PSLE and 'O' level respectively. In 2012, the percentage increased to 23.1% at PSLE and 26.9% at 'O' level. See table below for specific statistics. Languages% of students at PSLE% of students at 'O' Level2003201220032012Higher Chinese21.627.418.230.1Higher Malay5.77.18.310.7Higher Tamil15.121.411.524.7 Primary school students are able to take Higher Mother Tongue in Primary 5. The EM1/EM2/EM3 streaming system previously, has been replaced with a 'subject-based' banding scheme. As such, parents may opt for their children who have the ability and interest, to pursue mother tongue at a higher level in Primary 5. For students progressing on to the secondary level, the top 11-30% of the cohort scoring an A* grade in the Mother Tongue or at least a Merit in the Higher Mother Tongue during [Primary School Leaving Examination](/wiki/Primary_School_Leaving_Examination) (PSLE) will be eligible to take Higher Mother Tongue in secondary school. Additionally, those ranked in the top 10% of the PSLE are also eligible for HMTL. Students who took Higher Mother Tongue at O Levels are exempted from taking Mother Tongue in JC/[MI](/wiki/Millennia_Institute). Students who obtain at least a D7 in Higher Mother Tongue at O Levels are considered to have satisfied the requirements for Mother Tongue, for the admission to the three local universities - [NUS](/wiki/National_University_of_Singapore), [NTU](/wiki/Nanyang_Technological_University) and [SMU](/wiki/Singapore_Management_University). ### Chinese Higher Mother Tongue Language [PSLE](/wiki/PSLE): Higher Mother Tongue students learn quantitatively more words per chapter- these words are also more advanced than the MTL syllabus. Students reading Chinese as a Higher Mother Tongue would be assessed in only 2 separate formats: Composition and comprehension, with no oral and listening components. The table below compares the words a student must study for Higher Mother Tongue, and for Mother Tongue. TypeComparisons between Higher Mother Tongue and Mother TongueHMTL片 它 去 过 来 马 出 走 和 到MTL只 它 去 过 来 马 出 走 和 O Levels: There is a focus on the writing component for Higher Mother Tongue. Their assessment format is as follows: Type of paperExamination structurePaper 12 written compositions - writing an email (informal/formal) and one essayPaper 2Comprehension and summary ### Malay Higher Mother Tongue Language Malay (PSLE): Higher Mother Tongue (Malay) subject syllabuses for the primary level cover the learning of proverbs, which are more extensive than the list of proverbs for Mother Tongue. There is also no oral and listening components for Higher Mother Tongue (Malay). Hence, the examination format is as follows: Type of PaperExamination StructurePaper 1CompositionPaper 2Comprehension Malay ( O Levels) : Students are expected to be familiar with a list of proverbs which are more extensive than that for Mother Tongue. Students reading Higher Mother Tongue (Malay) are assessed in Written examination through 2 papers, consisting of: Type of PaperExamination StructurePaper 12 written compositions - writing an email and one essayPaper 2Comprehension ### Tamil Higher Mother Tongue Language Tamil (PSLE): There is a focus on the learning of basic language skills in listening, writing and talking. There was also an emphasis on explaining cultural values. Students are taught a variety or proverbs and seyyul (a type of poem), which include Thirukkural, Moothurai, Nalvazhi, Athichoodi, kondraivaenthan, and vetrivaerkkai. In addition, students are also taught the grammar and syntax of Tamil. For example, in two Tamil words ஒலி & ஒளி, both of which are pronounced as Oli, students are expected to know the difference in meanings of both words. They are also taught [prepositions](/wiki/Prepositions), knowns as vaetrumai urubu. Other areas include [synonyms](/wiki/Synonyms), [antonyms](/wiki/Antonyms) and numerals, Irattai kilavi (a form of sound word), as well as direction words. Tamil (O Level) : There is a focus on proverbs, grammar, [syntax](/wiki/Syntax), specifically, learning how to add connective words to sentences and phrases. The students are then tasked with writing sentences without changing the meaning of the given sentences. They are also tested on Seyyul proverbs. The examination structure follows two papers as well, as seen in the table below. Type of paperExamination structurePaper 1Vocabulary and comprehensionPaper 2Composition ## Outcomes As Quentin Dixon, Assistant Professor at Texas A&M University, concluded, Singapore's language education system has succeeded in domain shift of the various languages – from non-standard Chinese varieties to Mandarin and English. Aggressive campaigning to encourage the shifting of home language use to the official languages has allowed students to perform bilingually well compared to some other monolingual countries. The mother tongue languages have always been regarded as cultural markers, with English as the key to the door of international opportunities (Wee, 2004). Early bilingual education policy in the 'Efficiency-driven' period (1978–1997) was based on a 'one-size fits all' approach. This has resulted in numerous present-day Singaporeans not having a good grasp of either English or mother tongue. The Singapore government has admitted to using the wrong teaching methods to teach languages in the past; particularly with regards to its efforts in encouraging bilingual proficiency. In the past, with constant review of the curriculum, the government has admitted the flaws lying in their bilingual policy, pointed out by Lionel Wee: - 2004 – The government admitted that despite an increase in the number of English speakers, English has now become the dominant language spoken in most homes. Singaporeans find it difficult to cope with their mother tongue despite its relevance to ethnicity. They acknowledged their initial aim of having equal proficiency in both English and mother tongue has failed. - 2009 – Ex-Minister Mentor Lee Kuan Yew reflected in a statement made in *The Straits Times*, initial bilingual education policies were based on an assumption of a strong correlation between intelligence and language learning. Mother tongue lessons are aimed at being more interactive and fun for the student, in the hope of increasing interest in the language rather than perceiving it to be an academic subject. Digital media, such as e-learning, is also emerging as a strong tool for education. In addition, the new bilingual education initiatives aim to consider students' home language backgrounds as well as their learning abilities to further ensure they receive the best education possible. The Ministry of Education constantly reviews curricula and policies to ensure their students develop their languages to the best of their ability with a more customised and differentiated approach. ### Controversies With the English-based bilingual education policy in the Singapore education system, there has been a shift from students' mother tongues to English as the home language. This is especially so among the ethnic Chinese group, and it is possible that English can potentially emerge as their lingua franca. This has resulted in the controversy of whether English should be used to teach students' mother tongue, specifically Chinese, to help them learn the language better. This method of using the student's first language (L1) to teach a second language (L2) has been recognised by many professionals who teach English as a second language. However, the use of English to teach students' mother tongue in schools is treated as taboo in Singapore. Another controversy is in relation to the weightage allocated to mother tongues in examinations such as the [PSLE](/wiki/PSLE). Parents have complained that their children can possibly be excluded from further progression and disadvantaged in their education path if they are unable to excel in their mother tongue, despite doing well in the other subjects. Although some parents support the reduction of weightage of Mother Tongues in examinations – more than 1,024 parents signed a petition to support the reduction of Mother Tongue weightage – there are parents who are against this reduction. These parents are worried that the act of reducing the weightage will undermine the importance of Chinese, or the Mother Tongue, and also encourage a defeatist attitude towards language learning. Chinese community leaders have also expressed their concern towards the issue. Chinese community leaders, as well as parents, are afraid that students will view and learn the Mother Tongue merely as an examinable subject, and not as a living language with social relevance. However, the Prime Minister, [Lee Hsien Loong](/wiki/Lee_Hsien_Loong), had mentioned in his Prime Minister's speech in 2010 that the Mother Tongue weightage in examinations will not be reduced. Instead, the teaching and examination formats for Mother Tongues will be revised and improved. - Ministry of Education Singapore - Speak Mandarin Campaign - Malay Language Council of Singapore\n",
  "language": "en",
  "processed_at": "2026-01-12T11:20:12.996448",
  "title": "Language education in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Language_education_in_Singapore"
}