{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:20:19.193666"
  },
  "content": "Art school in Singapore‹ The template *Infobox university* is being considered for merging. › **Lasalle College of the Arts**, simply known as **Lasalle**, is a publicly-funded post-secondary arts institution in Singapore, and a constituent college of the [University of the Arts Singapore](/wiki/University_of_the_Arts_Singapore) (UAS) from 2024. Founded in 1984, Lasalle has eight art and design schools that offer more than 30 diploma, undergraduate and postgraduate programmes in contemporary arts and design education. Lasalle's bachelor's and master's degrees are validated by [Goldsmiths College, University of London](/wiki/Goldsmiths_College,_University_of_London). Many leaders in the Singapore arts scene are linked to Lasalle, including Alan Oei as artistic director of [The Substation](/wiki/The_Substation) and Eugene Tan as director of the [National Gallery Singapore](/wiki/National_Gallery_Singapore). ## History ### 1984–1994 Brother [Joseph McNally](/wiki/Joseph_McNally_(brother)), the founder of Lasalle College of the Arts, was known for his outstanding educational and artistic contributions in Singapore, which he made his home in 1946. He spent almost 40 years in Singapore teaching in various affiliated schools of the [De La Salle Order](/wiki/De_La_Salle_Brothers) including [St Joseph's Institution](/wiki/St._Joseph%27s_Institution,_Singapore) and St Patrick's Secondary School. Upon retirement, McNally decided to follow through with his vision to elevate the arts culture in Singapore, holding the belief that the arts is instrumental to a nation. In 1984, McNally founded Lasalle College of the Arts. Originally known as the St Patrick's Arts Centre, the institution was funded largely through McNally's own pocket, given the low priority, the Singapore government placed on the arts at that time. As an integrated arts college, the first cohort had a strength of 27 students who were offered diplomas in Painting, Ceramics, Sculpture, and Music. In 1993, McNally's effort in securing resources finally paid off when [Singapore Airlines](/wiki/Singapore_Airlines) contributed S$15 million to enhance campus facilities. The college was subsequently renamed Lasalle-SIA College of the Arts. Other financial contributors to the college include the Khoo, Lee, Shaw and Hong Leong Foundations, and Airbus Industries. In the same year, an agreement was formalised with Australia's [RMIT University](/wiki/RMIT_University) for its bachelor's degree in Fine Arts to be awarded to graduates of Lasalle's Fine Arts programme.[*citation needed*] ### 1995–2009 Following the government's plans to rejuvenate Singapore's art space, Lasalle began receiving financial support from the [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)). At Lasalle's 10th anniversary celebration in 1995, then-Deputy Prime Minister [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) remarked that Lasalle played an important role in developing artists and their audience in Singapore, and announced that the Singapore government would be extending financial assistance to the college by providing an estimated sum of $4 million in grants. The college also started offering degrees, designed and developed in Singapore, to support the local and regional creative industries. ### 2010–present In 2010, Lasalle launched the MA Asian Art Histories programme, the first of its kind worldwide. Its focus is on Asian modern and contemporary art, where students are able to investigate recently emerged artists and movements within the geographical domain, and undertake research. In 2012, Lasalle established a partnership with [Goldsmiths, University of London](/wiki/Goldsmiths,_University_of_London), to introduce 14 publicly-funded undergraduate arts degree programmes. A year later, the college introduced the MA Arts Pedagogy and Practice Programme. Its most recent programmes include MA Creative Writing and MA Design. In March 2021, Minister for Education [Lawrence Wong](/wiki/Lawrence_Wong) announced that Singapore's first arts university will be established in an alliance between the [Nanyang Academy of Fine Arts](/wiki/Nanyang_Academy_of_Fine_Arts) and Lasalle College of the Arts. The formation of the University of the Arts Singapore (UAS) will see both colleges under the umbrella university be given degree-awarding powers independent of their current foreign partners, where the current long-distance degrees are issued through foreign universities. Singaporeans and permanent residents enrolled in the approved degree programmes at the university of the arts will pay subsidised fees, comparable to the autonomous universities in Singapore. ## Facilities Lasalle moved to its new city campus at 1 McNally Street in 2007, and was re-branded as Lasalle College of the Arts. The Winstedt Campus opened in 2013, giving the college an additional 5,000 square metres of studio and workshop space. ### McNally Campus The McNally Campus is located in the Rochor area of Singapore, which is part of Singapore's Urban Redevelopment Authority zoning of an Arts, Culture, Learning and Entertainment hub. The campus has 1,500 square metres of contemporary art exhibition and gallery spaces, and is the region's first Theatre and Art Production Workshop for the construction of full-scale stage sets. It has 10 computer labs, 6 classrooms, 3 lecture theatres, and 56 studios. ### Winstedt Campus As Lasalle's second campus, the Winstedt Campus is located near the Newton area. The campus was designed for students involved in studio-based modules, such as the visual arts, to develop and complete their semester projects. It is equipped with 14 Fine Arts, Media Arts & Design Studios, 4 Fine Arts and Design technical workshops, 7 computer labs, and 5 classrooms. This campus used to be Madrasah Al-Irysad Al-Islamiah Secondary school before being added to Lasalle's campuses. ## Schools and programmes Lasalle has eight distinct schools offering a range of arts and design programmes. All Bachelor of Arts (BA) and Master of Arts (MA) programmes are offered in partnership with Goldsmiths, University of London. ### School of Contemporary Music The School of Contemporary Music has two diploma programmes: Diploma in Audio Production and Diploma in Music. The School also offers a BA(Hons) Music programme, which has five specialisations in Pop, Jazz, Classical, Composition or Electronic Music. ### McNally School of Fine Arts The School of Fine Arts involves all levels of education for Fine Arts, with contemporary research and practice-based programmes including Diploma in Fine Arts, BA(Hons) Fine Arts, and MA Fine Arts. The School offers a variety of Fine Arts disciplines, including sculpture, printmaking, drawing installation, photography, technology-based art, performance art, interdisciplinary art, and critical studies in art history and theory. The School also offers MA Asian Art Histories, which is the first MA programme worldwide to focus on Asian modern and contemporary art. ### School of Dance & Theatre The School of Dance & Theatre focuses on dance and performance. For dance, the School's programmes include Diploma in Dance and BA(Hons) Dance. The four branches of dance techniques taught by Lasalle can be categorised into Urban Dance, Jazz, ballet, and Contemporary Dance. For performance, the School's programmes include Diploma in Performance, BA(Hons) Acting, and BA(Hons) Musical Theatre. The School also offers a Diploma in Theatre Production and Management. It is common for programmes under the School of Dance & Theatre to collaborate with other Schools, such as the Puttnam School of Film & Animation and the School of Contemporary Music. ### School of Creative Industries The School of Creative Industries offers programmes that focus on the development and expansion of creative industries. Programmes include foundation courses such as a Certificate in English Language for the Creative Arts. The School also has a BA(Hons) Arts Management programme. Additionally, there are six postgraduate programmes, including: - MA Arts and Cultural Management, - MA Arts Pedagogy and Practice which is the first of its kind in the region, - Postgraduate Diploma in Arts Pedagogy and Practice, - MA Art Therapy, - MA Music Therapy, - MA Creative Writing ### School of Fashion The School of Fashion has one Diploma and two Honours Degree programmes. The Diploma in Fashion programme has components in Textile Design, Marketing, Styling, and Art Direction, while the BA(Hons) Fashion Design and Textiles programme, has four specialisations: Womenswear, Menswear, Creative Pattern Cutting, or Fashion Textiles. There is also a BA(Hons) Fashion Media and Industries programme, which offers two specialisations, the first comprising Fashion Journalism, Styling, Art Direction, Fashion Photography, and the second comprising Marketing and Branding, Fashion Curation, Entrepreneurship. Lasalle holds an annual Graduate Fashion Show. In 2015, Lasalle's Graduate Fashion Show was part of Singapore Fashion Week. ### School of Spatial & Product Design The School of Spatial & Product Design offers a Diploma programme, Diploma in Interior Design, and two Honours Degree programmes, BA(Hons) Product Design and BA(Hons) Interior Design. Alumni often continue into design industries, such as interior design, architectural practice, furniture design, and product design. ### School of Design Communication The School of Design Communication consists of a Diploma in Design Communication programme, which involves disciplines of Graphic Design, Advertising, and Illustration. The School also has a BA(Hons) Design Communication and MA Design programmes. In 2017, the School hosted *Open Studios* to showcase the works of Design Communication students. Many alumni have continued into the advertising industry like Creative Director Ang Sheng Jin of [MullenLowe Profero](/wiki/MullenLowe_Profero) Singapore and Art Director Sid Lim Xian Hao of [DDB](/wiki/DDB_Worldwide) Singapore.[*citation needed*] ### Puttnam School of Film & Animation The Puttnam School of Film & Animation focuses on animation, broadcast media, and film. For animation, the School has a Diploma in Animation and a BA(Hons) Animation Art programme where students can specialise in either 2D or 3D animation. These programmes also have practical components such as Acting for Animation, and Drawing Classes and Programming. Animation students often work with external partners, such as the partnership between Lasalle students and local company Presence Pictures in which students transformed their 3D videos into virtual reality. For broadcast media, the School offers a Diploma in Broadcast Media. Students collaborate with other programmes, such as Music, Fashion, Film, Animation, Technical and Production Management, Fine Arts, and Lasalle's Media Lab. The School offers a BA(Hons) in Film programme. ## Scholarships Lasalle offers scholarships to eligible students. Eligible students are able to receive grants and subsidised tuition fees. Lasalle students, from Diploma, BA(Hons), and postgraduate programmes may also apply for externally sponsored scholarships. ### President's Young Talents Inaugurated by [Singapore Art Museum](/wiki/Singapore_Art_Museum) in 2001, the President's Young Talents recognises young artists under the age of 35. The award involves participating in the mentoring and commissioning exhibition programme. A number of Lasalle alumni were recipients of the award, including filmmaker [Boo Junfeng](/wiki/Boo_Junfeng). ## Controversies In February 2016, two items that were part of the group show *Fault-lines: Disparate and desperate intimacies* were removed from artist Loo Zihan's installation \"Queer objects: An archive for the future\". This action was agreed between the staff of Institute of Contemporary Arts (ICA) Singapore, part of Lasalle College of the Arts, curator Wong Binghao and Loo, and was due to the nature of the objects which could be potentially considered offensive to some members of the public. The items were a penis sheath and a [butt plug](/wiki/Butt_plug). The ICA Singapore, curator and artist emphasised that the decision was taken to make the exhibition accessible to all, including students of the Lasalle College of the Arts, half of whom are under 18 years old.[*non-primary source needed*] ## Alumni - [Yu Shuxin](/wiki/Yu_Shuxin), singer and actress, former member of [THE9](/wiki/The9_(group)) - [Kit Chan](/wiki/Kit_Chan), singer and actress - [Oon Shu An](/wiki/Oon_Shu_An), Singaporean actress and host - [Sezairi Sezali](/wiki/Sezairi_Sezali), Singaporean singer and Singapore Idol winner - [Amanda Heng](/wiki/Amanda_Heng), international arts practitioner - [Boo Junfeng](/wiki/Boo_Junfeng), filmmaker - [Tay Bee Aye](/wiki/Tay_Bee_Aye), multi-disciplinary visual artist - [Cynthia Delaney Suwito](/wiki/Cynthia_Delaney_Suwito), [Forbes 30 Under 30](/wiki/Forbes_30_Under_30) Asia: The Arts 2017 - [Herman Keh](/wiki/Herman_Keh), actor and model - [Maria Grace Koh](/wiki/Maria_Grace_Koh), Bruneian singer - Official website - UAS website 1°18′11″N 103°51′07″E﻿ / ﻿1.303068°N 103.851852°E﻿ / 1.303068; 103.851852\n",
  "language": "en",
  "processed_at": "2026-01-12T11:20:19.193232",
  "title": "Lasalle College of the Arts",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Lasalle_College_of_the_Arts"
}