{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:20:28.103843"
  },
  "content": "Singaporean coachThis article includes a list of general references, but **it lacks sufficient corresponding inline citations**. Please help to improve this article by introducing more precise citations. *(July 2018)* *(Learn how and when to remove this message)* **Lau Teng Chuan** [BPE](/wiki/Bachelor_of_Physical_Education), [MSc](/wiki/Master%27s_degree) ([Chinese](/wiki/Simplified_Chinese_characters): 刘镇泉; 13 April 1929 – 8 May 2012) was a Singaporean sportsman, coach, teacher, and sports administrator, and considered to be the 'father of physical education' in [Singapore](/wiki/Singapore). Lau was instrumental in the development of sports in Singapore. ## Education Lau attended [Victoria School](/wiki/Victoria_School) in Singapore, where he had excelled in sports, and he graduated from [Loughborough College](/wiki/Loughborough_College) in the United Kingdom, where he studied physical education to become a Physical Education teacher, graduating with a DLC 1st Class Honours in 1956. In 1973, he obtained a Master of Science from the [University of Oregon](/wiki/University_of_Oregon) in United States. ## Career Lau was a national badminton player and had represented Singapore from 1956 to 1958. While playing competitive badminton, he was also a lecturer and eventually the chief of physical education at [Institute of Education](/wiki/National_Institute_of_Education), until 1975. He was also Singapore's chief badminton coach from 1963 to 1965, after which he served as honorary visiting coach of the [New Zealand](/wiki/New_Zealand) national badminton team. Lau served as the executive director of the [Singapore Sports Council](/wiki/Singapore_Sports_Council) from 1975 to 1992, where he assisted the government in shaping and implementing the strategy for physical education and sports in Singapore. He started an initiative to enhance coaching education and development in Singapore, which saw physical fitness instructors certified at the national level. The National Physical Fitness Award/Assessment (NAPFA) test for students was introduced and the test was later adapted by the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces) as the [Individual Physical Proficiency Test](/wiki/Individual_Physical_Proficiency_Test) (IPPT). Lau was appointed to the [Singapore National Olympic Council](/wiki/Singapore_National_Olympic_Council) in 1995 and took over from S S Dhillon as secretary general in 1996. He resigned from the post in 2001 after six years in the council. As one of Singapore's sports administrators, Lau played a key role in implementing the physical education strategy in Singapore schools. He championed sports-for-all initiatives and was behind pushing for sports facilities to be built in the heartlands, fitness apparatus to be built in parks, stadiums and educational institutions, as well as mass sports participation events. He had also previously served as a vice-president of Singapore Amateur Athletics Association, and was the honorary secretary of the [Football Association of Singapore](/wiki/Football_Association_of_Singapore) from 1982, a post he held for more than a decade. Lau was encouraged by his grandchildren to write an autobiography to share his sporting experiences and service to sports in various capacities. In 2012, Lau published his autobiography, *Lau Teng Chuan (Sportsman, Teacher, Sports Administrator)*. More than 400 copies of the book was printed and distributed to the sporting fraternity of Singapore. Proceeds of the book go to the Lau Teng Chuan Scholarship Fund, which will benefit physical education teachers. ## Awards Lau was awarded the National Day Public Service Administration awards in 1969 (bronze) for education and 1981 (silver) for sports, and the [International Badminton Federation](/wiki/International_Badminton_Federation)'s Distinguished Service Award in 1997. He received the Honorary Doctorate (Honoris Causa) from Loughborough University in 2003 for his contribution to the public service and the development of sports in Singapore. ## Personal life Lau had a brother, Lau Teng Siah, who was also a badminton player. Lau was also an avid football player, squash player, and golfer beside badminton. Lau died on 8 May 2012 at the age of 83 from stomach cancer. He was married to Mary and had two sons, a daughter, and seven grandchildren. Chris Chan, [Singapore National Olympic Council](/wiki/Singapore_National_Olympic_Council)'s secretary-general said: \"Every Singaporean has benefited in some way from Lau's work, whether they know it or not.\" Former Singapore Sports Council chairman, Tan Eng Liang said: \"His contribution as a teacher, sportsman and administrator is second to none\" and that it will be hard to find another person who exhibit such selflessness and dedication to local sport.\" - \"Dr Lau Teng Chuan\"[*permanent dead link*] - (Summer 2003) \"Degree Speeches – Lau Teng Chuan\" - (13 May 2012) Obituary – \"Dr Lau Teng Chuan\" - (2 July 1975). \"Lau gets top post in Sports Council\"[*permanent dead link*]. *The Straits Times* (Singapore). - Sanjay Nair (27 April 2012). \"Father of PE relives passion for sports\"[*permanent dead link*]. *The Straits Times* (Singapore). - May Chen (9 May 2012). \"Farewell to father of P.E.\". *The Straits Times* (Singapore). - Godfrey Robert (9 May 2012). \"GOODBYE, sporting legend\" *The New Paper* (Singapore). - Ian De Cotta (9 May 2012). \"A sporting pioneer\"[*permanent dead link*]. *Today* (Singapore).\n",
  "language": "en",
  "processed_at": "2026-01-12T11:20:28.103345",
  "title": "Lau Teng Chuan",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Lau_Teng_Chuan"
}