{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:20:28.869386"
  },
  "content": "Subzone of Kallang Planning Area in Central Region, Singapore **Lavender** is a subzone within the planning area of [Kallang](/wiki/Kallang), [Singapore](/wiki/Singapore), as defined by the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) (URA). Lavender is composed of an area bounded by Tessensohn Road in the north; Balestier Road, Lavender Street and Crawford Street in the east; the [Rochor River](/wiki/Rochor_River) and [Rochor Canal](/wiki/Rochor_Canal) in the south; as well as Syed Alwi Road, [Serangoon Road](/wiki/Serangoon_Road) and Rangoon Road in the west. Lavender is largely commercial, even though several blocks of public housing provided by the [Housing and Development Board](/wiki/Housing_and_Development_Board) (HDB) exist at Jellicoe Road and French Road. Notable places in this subzone include [Jalan Besar Stadium](/wiki/Jalan_Besar_Stadium), Jalan Besar Swimming Complex, Jalan Besar Community Club, the series of historic shophouses along [Jalan Besar](/wiki/Jalan_Besar), the headquarters of [People's Association](/wiki/People%27s_Association_(Singapore)), [Immigration and Checkpoints Authority](/wiki/Immigration_and_Checkpoints_Authority) (ICA) Building, [Sri Srinivasa Perumal Temple](/wiki/Sri_Srinivasa_Perumal_Temple), [Mustafa Centre](/wiki/Mustafa_Centre), [Umar Pulavar Tamil Language Centre](/wiki/Umar_Pulavar_Tamil_Language_Centre) and [City Square Mall](/wiki/City_Square_Mall_(Singapore)). In addition, the [New World Amusement Park](/wiki/New_World_Amusement_Park) once stood in this area. The district has not changed a lot in a city known for its frenetic urban planning, and as a source puts it, \"entering Lavender is like entering Singapore in the late 1980s\", where old public housing is occupied by an elderly community, with small automotive shops, hardware resellers and temples. A trend of [gentrification](/wiki/Gentrification) began in around 2014, mainly along Jalan Besar. Parts of the [Little India](/wiki/Little_India,_Singapore) ethnic neighbourhood extends into this area. There are now many small coffee shops and music studios in this rather vintage-looking district. [Lavender MRT station](/wiki/Lavender_MRT_station) and [Farrer Park MRT station](/wiki/Farrer_Park_MRT_station) serve Lavender subzone. ## Etymology The subzone of Lavender derived its name from Lavender Street. The road was officially named on 8 March 1858, as a result of suggestions by the nearby residents. Contrary to what the name may suggest, the area around Lavender Street was foul-smelling, probably due to either the [Kallang Gasworks](/wiki/Kallang_Gasworks) in the vicinity, or the use of [nightsoil](/wiki/Nightsoil) as fertilizer at nearby farms. The name was suggested by residents of the area as tongue-in-cheek humour. ## Notable locations - [161 Lavender Street](/wiki/161_Lavender_Street) 1°17′54″N 103°51′23″E﻿ / ﻿1.2984°N 103.8564°E﻿ / 1.2984; 103.8564 This [Singapore](/wiki/Singapore) location article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:20:28.869000",
  "title": "Lavender, Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Lavender,_Singapore"
}