{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:20:32.328291"
  },
  "content": "The **legal system of Singapore** is based on the [English common law](/wiki/English_common_law) system. Major areas of law – particularly [administrative law](/wiki/Administrative_law_in_Singapore), [contract law](/wiki/Contract), [equity](/wiki/Equity_(law)) and [trust law](/wiki/Trust_law#United_Kingdom), [property law](/wiki/Property_law) and [tort law](/wiki/Tort) – are largely judge-made, though certain aspects have now been modified to some extent by statutes. However, other areas of law, such as [criminal law](/wiki/Criminal_law_of_Singapore), [company law](/wiki/Corporations_law) and [family law](/wiki/Family_law_of_Singapore), are largely statutory in nature. Apart from referring to relevant [Singaporean](/wiki/Singapore) cases, judges continue to refer to English [case law](/wiki/Case_law) where the issues pertain to a traditional common-law area of law, or involve the interpretation of Singaporean statutes based on English enactments or English statutes applicable in Singapore. In more recent times, there is also a greater tendency to consider decisions of important [Commonwealth](/wiki/Commonwealth_of_Nations) jurisdictions such as [Australia](/wiki/Law_of_Australia) and [Canada](/wiki/Law_of_Canada), as the Singapore Courts tend to consider decisions based on their logic, rather than their provenance. Certain Singapore statutes are not based on English enactments but on legislation from other jurisdictions. In such situations, court decisions from those jurisdictions on the original legislation are often examined. Thus, [Indian law](/wiki/Law_of_India) is sometimes consulted in the interpretation of the Evidence Act (Cap. 97, 1997 Rev. Ed.) and the [Penal Code](/wiki/Penal_Code_(Singapore)) (Cap. 224, 2008 Rev. Ed.) which were based on Indian statutes. On the other hand, where the interpretation of the [Constitution of the Republic of Singapore](/wiki/Constitution_of_Singapore) (1985 Rev. Ed., 1999 Reprint) is concerned, courts remain reluctant to take into account foreign legal materials on the basis that a constitution should primarily be interpreted within its own four walls rather than in the light of analogies from other jurisdictions; and because economic, political, social and other conditions in foreign countries are perceived as different. Certain laws such as the [Internal Security Act](/wiki/Internal_Security_Act_(Singapore)) (Cap. 143) (which authorises detention without trial in certain circumstances) and the Societies Act (Cap. 311) (which regulates the formation of associations) remain in the statute book, and both [corporal](/wiki/Caning_in_Singapore) and [capital punishment](/wiki/Capital_punishment_in_Singapore) are still in use. ## History ### Before 1826 Modern Singapore was founded on 6 February 1819 by Sir [Stamford Raffles](/wiki/Stamford_Raffles), an officer of the [British East India Company](/wiki/British_East_India_Company) and [Lieutenant-Governor](/wiki/Bencoolen_Presidency) of [Bencoolen](/wiki/Bengkulu), in an attempt to counter Dutch domination of trade in the East. Permission for the East India Company to set up a \"factory\" on the island was obtained from the [Sultan of Johor](/wiki/Sultan_of_Johor) and [Temenggung](/wiki/Temenggung) of Johor on that date under the terms of the [Treaty of Singapore](/wiki/1819_Singapore_Treaty), and outright [cession](/wiki/Cession) of Singapore took place in 1824. It has been suggested that prior to British acquisition of the island, the [Malay](/wiki/Malay_people) chief in charge of Singapore was the Temenggung of Johor. The [Johor Sultanate](/wiki/Johor_Sultanate) was the successor of the [Malacca Sultanate](/wiki/Malacca_Sultanate), both of which had their own codes of law. It is also possible that [adat law](/wiki/Adat), often inadequately translated as \"customary law\", governed the inhabitants of the island prior to its acquisition by the British. However, little, if anything, is known about the laws that were actually applicable. The British have always assumed that no law prevailed on the island of Singapore when it was acquired. In 1823 Raffles promulgated \"Regulations\" for the administration of the island. Regulation III of 20 January 1823 established a [magistracy](/wiki/Magistrate) which had jurisdiction over \"all descriptions of persons resorting under the British flag\". The magistrates were enjoined to \"follow the course of the British magistracy, as far as local circumstances permit, avoiding technicalities and unnecessary forms as much as possible, and executing the duties of their office with temper and discretion, according to the best of their judgement and conscience and the principles of substantial justice\". Raffles' Regulations were most likely illegal as he was acting beyond the scope of his legal powers in making them – although he had power to place the factory at Singapore under the jurisdiction of Bencoolen, he was not vested with power to place the entire island under Bencoolen's control. In this respect, he had treated Singapore as if the entire island had been ceded to the British when the Treaty with the Sultan and the Temenggung had only permitted the establishment of a trading factory. The same year, Raffles appointed [John Crawfurd](/wiki/John_Crawfurd) as [Resident](/wiki/Resident_(title)#Residents_in_(British)_Asia) of Singapore. Crawfurd doubted the legitimacy of the judicial system set up by Raffles, and annulled proceedings in which magistrates had ordered the flogging of gamblers and the seizure of their properties. He eventually abolished the magistracy, replacing it with a [Court of Requests](/wiki/Court_of_Requests) overseen by an Assistant Resident which dealt with minor civil cases, and a Resident's Court hearing all other cases which he himself presided over. Crawfurd had no authoritative guide to the applicable law, so he decided cases on \"general principles of English law\", taking into account so far as he could the \"character and manners of the different classes\" of local inhabitants. Unfortunately, Crawfurd's courts also lacked legal foundation, and he had no legal powers over Europeans in Singapore. Serious cases involving British subjects had to be referred to Calcutta; otherwise, all he could do was to banish them from the island. Despite the dubious legal status of the courts established in Singapore by Raffles and Crawfurd, they indicate that the *de facto* position was that between 1819 and 1826 English legal principles applied to Singapore. On 24 June 1824 Singapore and Malacca were formally transferred to the East India Company's administration by the [Transfer of Singapore to East India Company, etc. Act 1824](/wiki/Transfer_of_Singapore_to_East_India_Company,_etc._Act_1824) ([5 Geo. 4](/wiki/5_Geo._4). c. 108 (UK)). By virtue of the Fort Marlborough in India Act 1802 ([42 Geo. 3](/wiki/42_Geo._3). c. 29 (UK)). both territories, together with others in the region ceded to Britain by the [Netherlands](/wiki/Netherlands), became subordinate to the [Presidency](/wiki/Bengal_Presidency) of [Fort William](/wiki/Fort_William,_India) in [Bengal](/wiki/Bengal), and under the Government of India Act 1800 these territories became subject to the [jurisdiction](/wiki/Jurisdiction) of the [Supreme Court](/wiki/Supreme_court) of Fort William. The Indian Salaries and Pensions Act 1825 authorised the East India Company to place Singapore and Malacca under the administration of Prince of Wales' Island (now [Penang](/wiki/Penang)). The Company did so, thus creating the [Straits Settlements](/wiki/Straits_Settlements). ### 1826–1867: The \"Indian period\" The statute 6 Geo. 4 c. 85 empowered the [British Crown](/wiki/The_Crown#United_Kingdom) to issue [letters patent](/wiki/Letters_patent) providing for the administration of justice in the Straits Settlements. The East India Company petitioned the Crown for the grant of such letters patent establishing \"such Courts and Judicatures for the due administration of Justice and the security of the persons rights and property of the Inhabitants and the Public Revenue of and the Trial and Punishment of Capital and other Offences committed and the repression of vice within the said Settlement of Prince of Wales’ Island Singapore and Malacca...\" Granting the petition, the Crown issued the Second Charter of Justice on 27 November 1826. The Charter established the Court of Judicature of Prince of Wales' Island, Singapore and Malacca, which was conferred \"full Power and Authority... to give and pass Judgement and Sentence according to Justice and Right\". This key clause was later judicially interpreted to have introduced English law into the Straits Settlements. The present understanding of this clause is that it made all English statutes and principles of English [common law](/wiki/Common_law) and equity in force as at 27 November 1826 applicable in the Straits Settlements (including Singapore), unless they were both unsuitable to local conditions and could not be modified to avoid causing injustice or oppression. The Charter provided that the Court of Judicature was to be presided over by the [Governor](/wiki/Governor#British_Empire_and_Commonwealth) of the Straits Settlements and Resident Councillor of the settlement where the court was to be held, and another judge called the [Recorder](/wiki/Recorder_(judge)). Problems occurred with the first Recorder, Sir [John Thomas Claridge](/wiki/John_Thomas_Claridge). He complained that the Governor and Resident Councillors had refused to take any judicial business, and so responded by also refusing to take on the full business of the Court. He also bemoaned the lack of a \"full, efficient and respectable court establishment of clerks, interpreters. etc.\" Although expected to travel from his base at Prince of Wales' Island to Singapore and Malacca, due to disputes over travelling expenses and arrangements, Claridge refused to do so. Thus, on 22 May 1828 the Governor [Robert Fullerton](/wiki/Robert_Fullerton), together with the Resident Councillor Kenneth Murchison, were obliged to hold the first [assizes](/wiki/Assizes) in Singapore by themselves. Claridge was eventually recalled to the UK in 1829. The Charter conferred no legislative power on the Governor and Council of Prince of Wales' Island or, indeed, on any other individual or institution. The general power to make laws was vested with the Supreme Government of India and the British Parliament. By the East India Company Act 1813 (also known as the [Charter Act 1813](/wiki/Charter_Act_1813)) ([53 Geo. 3](/wiki/53_Geo._3). c. 155 (UK)), Prince of Wales' Island itself had been conferred an extremely limited power to issue regulations relating to duties and taxes it was empowered to levy; pursuant to this power, it issued nine regulations that applied to the Straits Settlements. However, on 20 June 1830 the East India Company reduced the status of Prince of Wales' Island from a Presidency to a Residency. The island thus lost power to legislate for the Straits Settlements, which power was assumed by the [Governor General of Bengal](/wiki/Governor_General_of_India). He issued four such regulations applicable to the Straits Settlements. Upon the downgrading of the Straits Settlements, the offices of Governor and Resident Councillors were abolished. This led Governor Fullerton to conclude that neither he nor the Resident Councillors were empowered any longer to administer justice under the Second Charter. In late 1830, Fullerton closed the courts and dismissed the judicial establishment before leaving for England. This led to legal chaos. Members of the mercantile community were in an uproar as they felt the ensuing confusion and inconvenience of having no local courts would disrupt commercial activity. In Singapore the Deputy Resident Murchison felt compelled to convene a court. However, the Acting Registrar James Loch took the view that the court was illegal, and it was soon closed again. In September 1831 merchants of the Straits Settlements appealed to the British Parliament. By then, the East India Company had already decided that Fullerton had been mistaken. It decided to restore the titles of Governor and Resident Councillor so that these officers could continue to administer justice pursuant to the Charter. On 9 June 1832 the Court of Judicature reopened at Prince of Wales' Island, and disposed of many outstanding cases that had amassed during the two years when the courts were closed. In 1833, the [Government of India Act 1833](/wiki/Government_of_India_Act_1833) (also known as the Charter Act 1833) ([3 & 4 Will. 4](/wiki/3_%26_4_Will._4). c. 85 (UK)). was passed by the British Parliament for the better government of the East India Company's possessions. Sole legislative power was transferred to the [Governor General of India in Council](/wiki/Governor_General_of_India#Council), thus inaugurating the period of Straits Settlements history known as the period of the \"Indian Acts\". The Court of Judicature was reorganised by the Third Charter of Justice of 12 August 1855. The Straits Settlements now had two Recorders, one for Prince of Wales' Island, the other for Singapore and Malacca. In 1858 the East India Company was abolished, and territories formerly administered by the Company were transferred to the Crown acting through the recently appointed [Secretary of State for India](/wiki/Secretary_of_State_for_India). This was effected by the Government of India Act 1858 ([21 & 22 Vict.](/wiki/21_%26_22_Vict.) c. 106 (UK)). There was no change to the structure of the legal system – the Governor General of India continued to legislate for the Straits Settlements. Unfortunately, many Acts passed by the Governor General during this period were not relevant to the Straits Settlements, and it was difficult to determine which were applicable. The situation was remedied by the passing of the Statute Law Revision Ordinance 1889 (No. 8 of 1889) (Ind.), which appointed commissioners to inquire into the matter and empowered them to publish a volume containing the text of any Indian Acts considered in force. Any Acts not included ceased to be applicable forthwith. ### 1867–1942: The Straits Settlements as a Crown colony On 1 April 1867, the [Straits Settlements](/wiki/Straits_Settlements) were detached from India and constituted as a separate [Crown colony](/wiki/British_overseas_territories) by way of the [Straits Settlements Act 1866](/wiki/Straits_Settlements_Act_1866) ([29 & 30 Vict.](/wiki/29_%26_30_Vict.) c. 115 (UK)). A separate [Legislative Council](/wiki/Legislative_Council_of_the_Straits_Settlements) with the authority to make laws was set up for the Straits Settlements. Pieces of legislation passed by the Legislative Council were known as \"ordinances\". By the Supreme Court Ordinance 1868 (S.S.), the Court of Judicature of the Straits Settlements was abolished, and in its place the Supreme Court of the Straits Settlements was established. The Governor and Resident Councillors ceased to be judges of the Court. In 1873, the Supreme Court was reconstituted to consist of the [Chief Justice](/wiki/Chief_Justice) and the Judge at Penang as well as a Senior and a Junior [Puisne Judge](/wiki/Puisne_Judge). There were two divisions of the court, one at Singapore and Malacca and the other at Penang. As Singapore had become the Straits Settlements' centre of government and trade, the Chief Justice and Senior Puisne Judge were required to reside in Singapore, while the Judge of Penang and the Junior Puisne Judge resided in Penang. The Supreme Court was also conferred with jurisdiction to sit as a [Court of Appeal](/wiki/Court_of_Appeals) in [civil matters](/wiki/Civil_law_(common_law)). Following changes in the court structure in England, in 1878 the jurisdiction and residence of judges was made more flexible, thus impliedly abolishing the geographical division of the Supreme Court. The first hierarchy of courts was also established, consisting of the Supreme Court of the Straits Settlements, Courts of Request, Courts of Two Magistrates, Magistrates' Courts, Coroners' Courts and Justices of the Peace. Appeals from decisions of the Supreme Court lay in the first instance to the Court of Appeal, and then to Her Majesty in Council, the latter appeals being heard by the [Judicial Committee of Her Britannic Majesty's Privy Council](/wiki/Judicial_Committee_of_the_Privy_Council). Also in 1878, a provision later known as section 5 of the Civil Law Act was introduced into Straits Settlements law. The provision stated that if a question or issue arose locally with respect to certain named categories of law or with respect to [mercantile law](/wiki/Law_merchant) generally, the law to be administered was to be the same as that administered in England at the corresponding period, unless other provision had been made by any law having force locally. It was felt the provision was needed because the Straits Settlements Supreme Court had a tendency to follow English case law premised on the existence of statutes that were not in force in the Colony. There was also a general sentiment that the common law should be common to the whole Empire. However, the manner in which section 5 was worded created much difficulty in determining whether particular English statutes applied locally. Despite major amendments to the provision in 1979, the problems with it were not resolved until it was finally repealed in 1993 (see below). Under the Courts Ordinance Amendment 1885 (S.S.), the set-up of the Supreme Court was again altered so that it now consisted of the Chief Justice and three puisne judges. In 1907 the jurisdiction of the Supreme Court was given a major overhaul. The Court was split into two divisions – a Civil Division and a Criminal Division, each with both [original](/wiki/Original_jurisdiction) and [appellate jurisdiction](/wiki/Appellate_jurisdiction). District Courts and Police Courts, which replaced the Magistrates' Courts, were also established. The Court of Requests, the jurisdiction of which had been drastically reduced in the intervening years, was abolished. The last major changes in the court system before World War II took place in 1934 when a Court of Criminal Appeal, essentially an extension of the Supreme Court's jurisdiction, was created, and in 1936 when it was declared that the Supreme Court would consist of a High Court and Court of Appeal. ### 1942–1946: Singapore under Japanese and British Military Administration During [World War II](/wiki/World_War_II), Singapore fell under Japanese Military Administration on 15 February 1942. There is much confusion as to where legislative authority lay, as there were several government or military bodies which had the power to make laws. These were, in order of descending authority, the Supreme Command of the Southern Army Headquarters, the 25th Army Headquarters, the Military Administration Department, the Malay (Malayan) Military Administration Headquarters, and the City Government of Tokubetu-si. Numerous regulations, laws and notices were issued by all these bodies through the Tokubetu-si without adhering to the normal chain of command. Although these laws were often contradictory, the body higher in the hierarchy always prevailed. When the [Japanese occupation of Singapore](/wiki/Japanese_occupation_of_Singapore) began, all existing courts ceased to function. By a decree of 7 April 1942, a Military Court of Justice of the Nippon Army was established, and the civil courts were reopened by a proclamation dated 27 May. This Proclamation made all former British laws applicable so long as they did not interfere with the Military Administration. The highest court was the Syonan Koto-Hoin (Syonan Supreme Court) which was opened on 29 May. Although a court of appeal was constituted, it never sat. There is some disagreement as to the status of judgments handed down by courts during the Japanese Occupation. The view has been taken by some post-Occupation courts that decisions by Japanese tribunals applying the law were valid. Others have held that since the Japanese administration did not set up tribunals in compliance with the requirements of Straits Settlements law, while the law continued to apply there were no proper courts in existence to enforce it. The Japanese surrendered on 12 September 1945. By Proclamation No. 1 (1945), the [Supreme Allied Commander](/wiki/Supreme_Allied_Commander) [South East Asia](/wiki/South_East_Asia_Command) established the [British Military Administration](/wiki/British_Military_Administration_(Malaya)) which assumed full judicial, legislative, executive and administrative powers and responsibilities and conclusive jurisdiction over all persons and property throughout such areas of Malaya as were at any given time under the control of forces under his command. The proclamation also declared that all laws and customs existing immediately prior to the Japanese Occupation would be respected, except that such of the existing law as the Chief Civil Affairs Officer considered practicable to administer during the period of military administration. Otherwise, all proclamations and legislative enactments of whatever kind issued by or under the authority of the Japanese Military Administration ceased to have effect. By Proclamation No. 23 (1945), the Deputy Chief Civil Affairs Officer for the Singapore Division provided that every conviction of any offence by a tribunal established by the Japanese Military Administration was quashed, and any judgment convicting or purporting to convict any person or any offence was set aside. Civil proceedings were dealt with by the Japanese Judgements and Civil Proceedings Ordinance 1946 (No. 3 of 1946), which had the effect of permitting post-Occupation courts to review the decrees of Japanese tribunals and to confirm, modify or reverse them. ### 1946–1963: The end of the Straits Settlements: Singapore as a separate colony and self-governing state The British Military Administration was terminated by Proclamation No. 77 (1946) dated 18 March 1946, and with effect from 1 April, the Straits Settlements were disbanded by the [Straits Settlements (Repeal) Act 1946](/wiki/Straits_Settlements_(Repeal)_Act_1946) ([9 & 10 Geo. 6](/wiki/9_%26_10_Geo._6) c. 37 (UK)). By the Singapore Colony Order in Council 1946, Singapore was constituted as a new colony under the British Settlements Acts 1887 ([50 & 51 Vict.](/wiki/50_%26_51_Vict.) c. 54 (UK)). A Singapore Legislative Council was created with power to legislate for the peace, order and good government of the Colony. The High Court and Court of Appeal of the Straits Settlements became the Colony of Singapore High Court and Court of Appeal. In 1958 Singapore was granted internal self-government and became the State of Singapore. This change was put into place by the Singapore (Constitution) Order in Council 1958 made under powers conferred by the State of Singapore Act 1958 ([6 & 7 Eliz. 2](/wiki/6_%26_7_Eliz._2). c. 59 (UK)). The Legislative Council was transformed into a Legislative Assembly consisting mainly of elected members. During this period, the basic structure of the courts remained much as it had been in the pre-war colonial era, with only minor changes being made such as the redesignation of the Police Courts as Magistrates' Courts in 1955. ### 1963–1965: Independence from the British Empire and merger with Malaysia Singapore joined the [Federation of Malaysia](/wiki/Malaysia) on 16 September 1963, and thus ceased to be a colony of the British empire. The legal arrangements were effected by the enactment of the [Malaysia Act 1963](/wiki/Malaysia_Act_1963) ([c. 35](/wiki/List_of_Acts_of_the_Parliament_of_the_United_Kingdom_from_1963) (UK)). the Sabah, Sarawak and Singapore (State Constitutions) Order in Council 1963 and the Malaysia Act 1963 (Malaysia). The 1963 Order in Council provided that all laws in force in Singapore continued to apply subject to modifications, adaptations, qualifications and exceptions that might be necessary to bring them into conformity with its new Constitution and the Malaysia Act. With Singapore now a state in a larger federation, the Singapore Legislative Assembly was transformed into the Legislature of Singapore with power to make laws only regarding certain matters set out in the [Malaysian Federal Constitution](/wiki/Constitution_of_Malaysia). Article 75 of the Federal Constitution also stated: \"If any state law is inconsistent with a federal law, the federal law shall prevail and the state law shall, to the extent of the inconsistency, be void.\" During this period, a substantial number of Malaysian laws, including [Federated Malay States](/wiki/Federated_Malay_States) Enactments and [Malayan Union](/wiki/Malayan_Union) and [Federation of Malaya](/wiki/Federation_of_Malaya) Ordinances, were extended to Singapore. Some of these statutes continue to apply, often in modified form, in Singapore today. Under the Malaysia Act 1963, the judicial power of Malaysia was vested in a [Federal Court](/wiki/Courts_of_Malaysia#Federal_Court), a [High Court](/wiki/Courts_of_Malaysia#High_courts) in Malaya, a High Court in Borneo and a High Court in Singapore. This new structure was officialised with effect from 16 March 1964 through the Courts of Judicature Act 1964 (M'sia), which replaced the Supreme Court of the Colony of Singapore with the High Court of Malaysia in Singapore. The jurisdiction of the High Court in Singapore was limited to all territory in the State of Singapore. ### 1965 to the present: Singapore as a fully independent nation Merger with Malaysia did not last: within two years, on 9 August 1965, Singapore was expelled from the Federation and became a fully independent [republic](/wiki/Republic). This was effected by the signing of the Independence of Singapore Agreement of 7 August 1965 by Singapore and Malaysia, and the changes consequent to the Agreement were implemented by two Malaysian Acts, the Constitution and Malaysia (Singapore Amendment) Act 1965 and the Constitution (Amendment) Act 1966; and by two Singapore Acts, the Constitution (Amendment) Act 1965 and the Republic of Singapore Independence Act 1965. Section 5 of the latter Act provided that the legislative powers of the [Yang di-Pertuan Agong](/wiki/Yang_di-Pertuan_Agong), the supreme ruler of Malaysia, ceased to extend to Singapore, and vested instead in the Head of State (that is, the [President of Singapore](/wiki/President_of_Singapore)) and the Legislature of Singapore. Again, all laws were expressed to continue in force with such modifications, adaptations, qualifications and exceptions as might be necessary to bring them into conformity with the independent status of Singapore upon separation from Malaysia. Today, the [Parliament of Singapore](/wiki/Parliament_of_Singapore) is an organ of state with [plenary power](/wiki/Plenary_power) to enact legislation for Singapore. At the time of independence, the Singapore Parliament did not make any changes to the judicial system. Thus, for an anomalous four-year period, the High Court in Singapore remained part of the Malaysian court structure. This was remedied in 1969, when the Constitution was amended to establish the [Supreme Court of Singapore](/wiki/Supreme_Court_of_Singapore) replacing the Federal Court of Malaysia with respect to Singapore, while retaining the [Judicial Committee of the Privy Council](/wiki/Judicial_Committee_of_the_Privy_Council) in London as Singapore's court of final appeal. The Supreme Court was divided into two divisions: the upper division consisted of the Court of Appeal and the Court of Criminal Appeal, which respectively dealt with civil and criminal matters; the lower division being the [High Court of Singapore](/wiki/High_Court_of_Singapore). In 1970 the subordinate courts were re-organised. Since that time, the Subordinate Courts of Singapore have consisted of the District Courts, the Magistrates' Courts, the Juvenile Courts and the Coroners' Courts. The Subordinate Courts were renamed the [State Courts of Singapore](/wiki/State_Courts_of_Singapore) on 7 March 2014. Steps to restrict appeals to the Privy Council were first taken in 1989. In that year, the law was changed such that appeals to the Privy Council would only be permitted in a civil case if all the parties agreed to such an appeal prior to the hearing of the case by the Court of Appeal. In criminal cases, an appeal to the Privy Council could only be taken if the death penalty was involved and if the judges of the Court of Criminal Appeal were not unanimous in their decision. These changes came shortly after the Privy Council restored a prominent opposition Member of Parliament, [Joshua Benjamin Jeyaretnam](/wiki/Joshua_Benjamin_Jeyaretnam), to the roll of advocates and solicitors of the Supreme Court of Singapore after he had been struck off for a criminal conviction for making false statements in a [statutory declaration](/wiki/Statutory_declaration); the court described the conviction as \"a grievous injustice\". In 1993, the previous set-up of a separate Court of Appeal and Court of Criminal Appeal was done away with, and in their place a unified Court of Appeal was constituted for both civil and criminal appeals. Judges of Appeal appointed to the Court of Appeal were no longer required to engage in High Court work. The Chief Justice sat as the President of the Court of Appeal. The establishment of the permanent Court of Appeal paved the way for the abolition of all appeals to the Privy Council with effect from 8 April 1994. Following this, the Court of Appeal issued a Practice Statement dated 11 July 1994, stating that while the Court would treat its own prior decisions and those of the Privy Council as normally binding, where it appeared that adherence to such decisions \"would cause injustice in a particular case or constrain the development of the law in conformity with the circumstances of Singapore\" it would regard itself as free to depart from such decisions. It added that this power would be exercised sparingly, bearing in mind the danger of retrospectively disturbing contractual, proprietary and other legal rights. Today, the [Court of Appeal of Singapore](/wiki/Court_of_Appeal_of_Singapore) is the highest court in the land. The independent status of Singapore's legal system was underlined by the repeal of section 5 of the Civil Law Act (see above) on 12 November 1993 by the Application of English Law Act 1993. The Act aims to clarify the extent of the application of English law in Singapore. It states that the common law of England (including the principles and rules of equity), so far as it was part of the law of Singapore immediately before the commencement of the Act, continues to be part of Singapore law so far as it is applicable to the circumstances of Singapore and its inhabitants and subject to such modifications as those circumstances may require. As for English statutes, only those that are listed in the Schedules to the Act apply or continue to apply in Singapore; no other English enactment is part of Singapore law. ## Sources of law Generally, Singapore has three sources of law: [legislation](/wiki/Legislation), [judicial precedents](/wiki/Precedent) ([case law](/wiki/Case_law)), and [custom](/wiki/Custom_(law)). ### Legislation Legislation, or [statutory law](/wiki/Statutory_law), can be divided into statutes and subsidiary legislation. [Statutes](/wiki/Statute) are written laws enacted by the Singapore Parliament, as well as by other bodies such as the British Parliament, Governor-General of India in Council and Legislative Council of the Straits Settlements which had power to pass laws for Singapore in the past. Statutes enacted by these other bodies may still be in force if they have not been [repealed](/wiki/Repeal). One particularly important statute is the [Constitution of the Republic of Singapore](/wiki/Constitution_of_Singapore), which is the supreme law of Singapore – any law enacted by the Legislature after the commencement of the Constitution which is inconsistent with it is, to the extent of the inconsistency, void. Statutes of the Singapore Parliament, as well as English statutes in force in Singapore by virtue of the Application of English Law Act 1993 (see above), are published in looseleaf form in a series called the *Statutes of the Republic of Singapore* which is gathered in red binders, and are also accessible on-line from Singapore Statutes Online Archived 15 December 2017 at the [Wayback Machine](/wiki/Wayback_Machine), a free service provided by the Attorney-General's Chambers of Singapore. [Subsidiary legislation](/wiki/Delegated_legislation), also known as \"delegated legislation\" or \"subordinate legislation\", is written law made by ministers or other administrative agencies such as government departments and [statutory boards](/wiki/Statutory_boards_of_the_Singapore_Government) under the authority of a statute (often called its \"parent Act\") or other lawful authority, and not directly by Parliament. Subsidiary legislation currently in force in Singapore is published in looseleaf form in a series called the *Subsidiary Legislation of the Republic of Singapore* which is gathered in black binders. New subsidiary legislation published in the *Gazette* may be viewed for free online for five days on the Electronic Gazette website. ### Judicial precedent As Singapore is a [common law](/wiki/English_common_law) [jurisdiction](/wiki/Jurisdiction), judgements handed down by the courts are considered a source of law. Judgements may interpret statutes or subsidiary legislation, or develop principles of common law and [equity](/wiki/Equity_(law)) which have been laid down, not by the legislature, but by previous generations of judges. Major portions of Singapore law, particularly [contract law](/wiki/Contract), equity and [trust law](/wiki/Trust_law#United_Kingdom), [property law](/wiki/Property_law) and [tort law](/wiki/Tort), are largely judge-made, though certain aspects have now been modified to some extent by statutes. Since 1992, judgements of the High Court, Court of Appeal and Constitutional Tribunal of Singapore have appeared in the *Singapore Law Reports* (SLR), which is published by the [Singapore Academy of Law](/wiki/Singapore_Academy_of_Law) under an exclusive licence from the [Supreme Court of Singapore](/wiki/Supreme_Court_of_Singapore). The Academy has also republished cases decided since Singapore's full independence in 1965 in special volumes of the SLR, and is currently working on a reissue of this body of case law. Cases published in the SLR as well as unreported judgements of the Supreme Court and Subordinate Courts are available on-line from a fee-based service called LawNet, which is also managed by the Academy. Outside Singapore, Malaysia and Brunei, they are available online from another fee-based service called Justis. ### Custom A [custom](/wiki/Custom_(law)) is an established practice or course of behaviour that persons who engaged in it consider law. Customs do not have the force of law unless recognised in a case. \"Legal\" or \"trade\" customs are not recognised as law unless they are certain and not unreasonable or illegal. In Singapore, custom is a minor source of law as not many customs have judicial recognition. ## Civil law Since independence, the civil law of Singapore has developed distinctly from the English common law. Nonetheless, much of the Singaporean law is based upon the English law, and although English decisions made before 1827 are not considered binding, they are still persuasive in the judgments of the Singaporean court. ### Contract The law of [contract](/wiki/Contract) deals with the rules of contract and dispute resolution pertaining to breaches of contract. With regard to remedies in contract, the Singapore court has affirmed the English case of *[Hadley v Baxendale](/wiki/Hadley_v_Baxendale)* — which establishes two limbs that allow for the establishment of [remoteness](/wiki/Remoteness_in_English_law) in cases of breach: natural losses arising from breach, and special knowledge of a plaintiff — in the case of *MXM Restaurants v Fish & Co*. In doing so, the court rejected Lord Hoffman's requirement of assumption of liability in the English case of *[Transfield Shipping Inc v Mercator Shipping Inc](/wiki/Transfield_Shipping_Inc_v_Mercator_Shipping_Inc)*. ### Tort [Tort](/wiki/Tort) law is the branch of law that concerns private wrongs, including [negligence](/wiki/Negligence), [malpractice](/wiki/Malpractice), and [intentional tort](/wiki/Intentional_tort). Whilst the current English paradigm for establishing a duty of care in cases of negligence was established in [Caparo v Dickman](/wiki/Caparo_Industries_plc_v_Dickman), which formulated a three-stage test for determining duty of care, the Singaporean Court of Appeal has rejected the Caparo test in favour of their own test in [Spandeck v DSTA](/wiki/Spandeck_Engineering_v_Defence_Science_and_Technology_Agency). Determining medical malpractice and standards of care have also differed from the English common law. ## Criminal law Unlike the common [criminal law of England](/wiki/English_criminal_law), the criminal law of Singapore is largely statutory in nature, owing largely from the importation of the Indian penal code into Singapore law. The general principles of criminal law, as well as the elements and penalties of common criminal offences such as homicide, theft and cheating, are set out in the [Penal Code](/wiki/Penal_Code_(Singapore)). Other important offences are created by statutes such as the Arms Offences Act, Kidnapping Act, [Misuse of Drugs Act](/wiki/Misuse_of_Drugs_Act_(Singapore)) and [Vandalism Act](/wiki/Vandalism_Act_(Singapore)). In addition, Singapore society is highly regulated through the criminalisation of many activities which are considered as fairly harmless in other countries. These include failing to flush toilets after use, [littering](/wiki/Litter), [jaywalking](/wiki/Jaywalking), the possession of [pornography](/wiki/Pornography), the sale of [chewing gum](/wiki/Chewing_gum_ban_in_Singapore), and, prior to December 2022, sexual activity such as [oral](/wiki/Oral_sex) and [anal sex](/wiki/Anal_sex) between men. Nonetheless, Singapore is one of the countries with the least crime in the world, with a low incidence of violent crimes. Singapore retains both [corporal punishment](/wiki/Corporal_punishment) (in the form of [caning](/wiki/Caning_in_Singapore)) and [capital punishment](/wiki/Capital_punishment) (by [hanging](/wiki/Capital_punishment_in_Singapore)) as punishments for serious offences. For some offences, most notably trafficking in drugs above a certain specified quantity, the imposition of these penalties is mandatory. - [Caning in Singapore](/wiki/Caning_in_Singapore) - [Capital punishment in Singapore](/wiki/Capital_punishment_in_Singapore) - [Constitution of Singapore](/wiki/Constitution_of_Singapore) - [Judicial system of Singapore](/wiki/Judicial_system_of_Singapore) - [Law enforcement in Singapore](/wiki/Law_enforcement_in_Singapore) - [Lawyers in Singapore](/wiki/Lawyers_in_Singapore) - [Parliament of Singapore](/wiki/Parliament_of_Singapore) ## Notes ### General - Chan, Helena H[ui-]M[eng] (1995), *The Legal System of Singapore*, Singapore: [Butterworths Asia](/wiki/LexisNexis_Butterworths), [ISBN](/wiki/ISBN_(identifier)) 978-0-409-99789-7. - Lim, Min, ed. (2005), *Teens and the Law*, Singapore: Singapore Association of Women Lawyers, [ISBN](/wiki/ISBN_(identifier)) 978-981-3065-97-0. - Myint Soe, U. (2001), *Principles of Singapore Law (including Business Law)* (4th ed.), Singapore: Institute of Banking and Finance, [ISBN](/wiki/ISBN_(identifier)) 978-9971-9900-9-1. - [Phang, Andrew Boon Leong](/wiki/Andrew_Phang) (1990), *The Development of Singapore Law: Historical and Socio-Legal Perspectives*, Singapore: Butterworths, [ISBN](/wiki/ISBN_(identifier)) 978-0-409-99588-6. - Phang, Andrew Boon Leong (2006), *From Foundation to Legacy: The Second Charter of Justice*, Singapore: [Singapore Academy of Law](/wiki/Singapore_Academy_of_Law), [ISBN](/wiki/ISBN_(identifier)) 978-981-05-7194-8. - Sheridan, L[ionel] A[stor], ed. (1961), *Malaya and Singapore, the Borneo Territories: The Development of Their Laws and Constitutions*, London: Stevens, [OCLC](/wiki/OCLC_(identifier)) 1838341. - Tan, Kevin Y[ew] L[ee], ed. (2005), *Essays in Singapore Legal History*, Singapore: Singapore Academy of Law; Marshall Cavendish Academic, [ISBN](/wiki/ISBN_(identifier)) 978-981-210-349-9. - Tan, Kevin Y[ew] L[ee], ed. (1999), *The Singapore Legal System* (2nd ed.), Singapore: Singapore University Press, [ISBN](/wiki/ISBN_(identifier)) 978-9971-69-213-1. - *You & the Law 3* (3rd ed.), Singapore: Singapore Association of Women Lawyers, 2002, [ISBN](/wiki/ISBN_(identifier)) 978-981-04-5152-3. ### Commercial law - Phang, Andrew Boon Leong, ed. (2012), *The Law of Contract in Singapore*, Singapore: Academy Publishing, [ISBN](/wiki/ISBN_(identifier)) 978-981-08-8692-9. - Shenoy, George T.L.; Loo, Wee Ling, eds. (2009), *Principles of Singapore Business Law*, Singapore: Cengage Learning Asia, [ISBN](/wiki/ISBN_(identifier)) 978-981-425-373-4. ### Constitutional law - Tan, Kevin Y[ew] L[ee]; [Thio, Li-ann](/wiki/Thio_Li-ann) (2010), *Constitutional Law in Malaysia and Singapore* (3rd ed.), Singapore: LexisNexis, [ISBN](/wiki/ISBN_(identifier)) 978-981-236-795-2. - Thio, Li-ann; Tan, Kevin Y[ew] L[ee], eds. (2009), *Evolution of a Revolution: Forty Years of the Singapore Constitution*, London; New York, N.Y.: [Routledge-Cavendish](/wiki/Routledge), [ISBN](/wiki/ISBN_(identifier)) 978-0-415-43862-9. - Thio, Li-ann (2012), *A Treatise on Singapore Constitutional Law*, Singapore: [Academy Publishing](/wiki/Singapore_Academy_of_Law), [ISBN](/wiki/ISBN_(identifier)) 978-981-07-1516-8. ### Criminal law - Chan, Wing Cheong; Hor, Michael Yew Meng; Ramraj, Victor V[ridar] (2005), *Fundamental Principles of Criminal Law: Cases and Materials*, Singapore: [LexisNexis](/wiki/LexisNexis), [ISBN](/wiki/ISBN_(identifier)) 978-981-236-409-8 - Chan, Wing Cheong; [Phang, Andrew](/wiki/Andrew_Phang) (2001), *The Development of Criminal Law and Criminal Justice in Singapore*, Singapore: Singapore Journal of Legal Studies, [Faculty of Law, National University of Singapore](/wiki/National_University_of_Singapore_Faculty_of_Law), [ISBN](/wiki/ISBN_(identifier)) 978-981-04-3720-6. - Yeo, Stanley Meng Heong; Chan, Wing Cheong; Morgan, N[eil] A. (2009), *Criminal Law in Malaysia and Singapore: A Casebook Companion*, Singapore: LexisNexis, [ISBN](/wiki/ISBN_(identifier)) 978-981-236-680-1. ### Other subjects - Chan, Gary Kok Yew; Lee, Pey Woan (2011), *The Law of Torts in Singapore*, Singapore: Academy Publishing, [ISBN](/wiki/ISBN_(identifier)) 978-981-08-8691-2. - Leong, Wai Kum (1997), *Principles of Family Law in Singapore*, Singapore: Butterworths Asia, [ISBN](/wiki/ISBN_(identifier)) 978-0-409-99888-7. - Tan, Sook Yee; Tang, Hang Wu; Low, Kelvin F[att] K[in] (2009), *Tan Sook Yee's Principles of Singapore Land Law* (2nd ed.), Singapore: LexisNexis, [ISBN](/wiki/ISBN_(identifier)) 978-981-236-732-7. ### Singapore law - Singapore Statutes Online – a service of the Attorney-General's Chambers, Singapore ### Government ministries and agencies - Attorney-General's Chambers (AGC), Singapore - Ministry of Law - **Departments** - Community Mediation Centre (CMC) - Insolvency and Public Trustee's Office (IPTO) - Legal Aid Bureau - **Statutory boards** - Intellectual Property Office of Singapore (IPOS) - Singapore Land Authority (SLA) - **Boards** - Appeals Board (Land Acquisition) - Copyright Tribunal - Land Surveyors Board, Singapore ### Parliament - Parliament of Singapore ### Courts - Singapore Courts - Small Claims Tribunals - Syariah Court of Singapore ### Alternative dispute resolution - Community Mediation Centre (CMC) - Singapore International Arbitration Centre (SIAC) - Singapore Mediation Centre (SMC) ### Legal education - National University of Singapore (NUS) - Centre for International Law (CIL) - Department of Business Policy, NUS Business School - Faculty of Law - Asian Law Institute (ASLI) - Asia-Pacific Centre for Environmental Law (APCEL) - EW Barker Centre for Law & Business - Singapore Management University (SMU) - School of Law - Nanyang Technological University (NTU) — College of Business (Nanyang Business School) - Division of Business Law - Temasek Polytechnic — Temasek Business School - Diploma in Law and Management ### Legal associations and organisations - Law Society of Singapore - Singapore Academy of Law - Singapore Corporate Counsel Association - ASEAN Law Association, Singapore\n",
  "language": "en",
  "processed_at": "2026-01-12T11:20:32.327812",
  "title": "Law of Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Law_of_Singapore"
}