{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:20:33.647196"
  },
  "content": "Prime Minister of Singapore since 2024 **Lawrence Wong Shyun Tsai**[b] (born 18 December 1972) is a Singaporean politician who has served as the fourth [prime minister of Singapore](/wiki/Prime_minister_of_Singapore) since 2024 and the [minister of finance](/wiki/Ministry_of_Finance_(Singapore)) since 2021. A member of the governing [People's Action Party](/wiki/People%27s_Action_Party) (PAP), he has been a [member of Parliament](/wiki/Parliament_of_Singapore#Members_of_Parliament) (MP) for the Limbang division of [Marsiling–Yew Tee Group Representation Constituency](/wiki/Marsiling%E2%80%93Yew_Tee_Group_Representation_Constituency) (GRC) since 2015. He had previously represented the Boon Lay division of [West Coast GRC](/wiki/West_Coast_Group_Representation_Constituency) between 2011 and 2015. Prior to entering politics, Wong worked at the [Ministry of Trade and Industry](/wiki/Ministry_of_Trade_and_Industry_(Singapore)) (MTI), the [Ministry of Finance](/wiki/Ministry_of_Finance_(Singapore)) (MOF) and the [Ministry of Health](/wiki/Ministry_of_Health_(Singapore)) (MOH). He was the [principal private secretary](/wiki/Private_secretary) to Prime Minister [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) between 2005 and 2008. He also served as the [chief executive officer](/wiki/Chief_executive_officer) (CEO) of the [Energy Market Authority](/wiki/Energy_Market_Authority) (EMA) between 2009 and 2011. Wong made his political debut in the [2011 general election](/wiki/2011_Singaporean_general_election) where he contested in West Coast GRC as part of a five-member PAP team and won. Wong subsequently contested in Marsiling–Yew Tee GRC during the [2015 general election](/wiki/2015_Singaporean_general_election), and retained his parliamentary seat in the [2020 general election](/wiki/2020_Singaporean_general_election). Prior to his appointment as Minister of Finance, Wong served as the [minister of culture, community and youth](/wiki/Ministry_of_Culture,_Community_and_Youth) between 2012 and 2015, [second minister of communications and information](/wiki/Ministry_of_Communications_and_Information_(Singapore)) between 2014 and 2015, [minister of national development](/wiki/Ministry_of_National_Development_(Singapore)) between 2015 and 2020, [second minister of finance](/wiki/Ministry_of_Finance_(Singapore)) between 2016 and 2021, and [minister of education](/wiki/Ministry_of_Education_(Singapore)) between 2020 and 2021. Wong was the co-chair of a multi-ministerial committee set up by the government in January 2020 to manage the [COVID-19 pandemic](/wiki/COVID-19_pandemic_in_Singapore). As Minister for Finance, he has overseen the gradual increase in [Goods and Services Tax](/wiki/Goods_and_Services_Tax_(Singapore)) (GST) which [Lee's government](/wiki/Fifth_Lee_Hsien_Loong_Cabinet) has advocated for – 8% in 2023 and 9% in 2024, up from 7% which had been set since 2007. In April 2022, he was chosen as the leader of the PAP's fourth generation team, placing him in line as Lee's apparent successor. Wong assumed the office of [Deputy Prime Minister of Singapore](/wiki/Deputy_Prime_Minister_of_Singapore) on 13 June 2022, serving alongside [Heng Swee Keat](/wiki/Heng_Swee_Keat). On 26 November 2022, Wong was appointed to the newly created position of Deputy Secretary-General of the PAP. Wong was previously Chairman of the [Monetary Authority of Singapore](/wiki/Monetary_Authority_of_Singapore) (MAS) from 2023 to 2024 as well as Deputy Chairman between 2021 and 2023. He assumed Chairmanship of the Investment Strategies Committee of [GIC](/wiki/GIC_(Singaporean_sovereign_wealth_fund)) from 7 July 2023 while he assumed Chairmanship of the International Advisory Council (IAC) of the [Economic Development Board](/wiki/Economic_Development_Board) (EDB) from 8 July 2023 until his subsequent relinquishment to [Gan Kim Yong](/wiki/Gan_Kim_Yong) on 1 June 2024. Wong was also appointed Deputy Chairman of GIC's Board of Directors on 1 October 2023. On 15 May 2024, Wong was sworn in as prime minister of Singapore, becoming the first prime minister born after the [establishment of modern-day Singapore](/wiki/Independence_of_Singapore_Agreement_1965). On 4 December 2024, he was elected as the Secretary-General of People's Action Party. He led the PAP to victory with an increased share of the vote in the [2025 general election](/wiki/2025_Singaporean_general_election). As prime minister, Wong is the [highest-paid head of government](/wiki/List_of_heads_of_state_and_government_salaries) in the world. ## Early life and education Wong was born to a [Hainanese](/wiki/Hainanese_people) family on 18 December 1972, in the [eastern part](/wiki/East_Region,_Singapore) of [Singapore](/wiki/Singapore). Growing up, Wong and his family lived in a public [Housing and Development Board](/wiki/Housing_and_Development_Board) (HDB) flat in [Marine Parade](/wiki/Marine_Parade). Wong's father, who was born in [Hainan](/wiki/Hainan) and later moved to [Malaya](/wiki/British_Malaya) and finally to Singapore, had worked as a sales executive while his mother was a teacher at his primary school. As a child, his father gave him a [guitar](/wiki/Guitar), and he developed a love for music. Wong attended Haig Boys' Primary School, Tanjong Katong Technical School (now [Tanjong Katong Secondary](/wiki/Tanjong_Katong_Secondary_School) and Primary Schools), and [Victoria Junior College](/wiki/Victoria_Junior_College) before going to university in the United States. Wong received a [Bachelor's of Science](/wiki/Bachelor_of_Science) with a major in [economics](/wiki/Economics) from the [University of Wisconsin–Madison](/wiki/University_of_Wisconsin%E2%80%93Madison) in 1994 and a [Master's of Arts](/wiki/Master_of_Arts) in [applied economics](/wiki/Applied_economics) from the [University of Michigan](/wiki/University_of_Michigan) in 1995 under the [Public Service Commission](/wiki/Public_Service_Commission_(Singapore)) scholarship. He also received a [Master's in Public Administration](/wiki/Master_of_Public_Administration) from [Harvard University](/wiki/Harvard_University) in 2004. ## Civil service career Wong began his career as an [economist](/wiki/Economist) working in the [Ministry of Trade and Industry](/wiki/Ministry_of_Trade_and_Industry_(Singapore)) (MTI) in August 1997. It was the beginning of the [1997 Asian financial crisis](/wiki/1997_Asian_financial_crisis) and his first assignment involved preparing a report on regional economies and their effects on Singapore. He described the experience by saying \"nothing that I learned in school prepared me for such an assignment\" and recounted having to learn on the job. Wong was posted to the [Ministry of Finance](/wiki/Ministry_of_Finance_(Singapore)) (MOF) in January 2002 and then the [Ministry of Health](/wiki/Ministry_of_Health_(Singapore)) (MOH) in July 2004, where he served as Director of Healthcare Finance until May 2005. Wong served as the [principal private secretary](/wiki/Private_secretary) to Prime Minister Lee Hsien Loong between May 2005 and August 2008. In September 2008, Wong became deputy chief executive officer of the [Energy Market Authority](/wiki/Energy_Market_Authority), rising to chief executive officer on 1 January 2009. He relinquished the role on 1 April 2011. ## Political career Wong entered politics at the [2011 general election](/wiki/2011_Singaporean_general_election) when he contested as part of a five-member [People's Action Party](/wiki/People%27s_Action_Party) (PAP) team in [West Coast GRC](/wiki/West_Coast_Group_Representation_Constituency). The PAP team won with 66.66% of the vote against the [Reform Party](/wiki/Reform_Party_(Singapore)) and Wong was elected as the Member of Parliament representing the [Boon Lay](/wiki/Boon_Lay) ward of West Coast GRC. ### Minister of State On 21 May 2011, Wong was appointed [Minister of State for Defence](/wiki/Ministry_of_Defence_(Singapore)) and [Minister of State for Education](/wiki/Ministry_of_Education_(Singapore)). He was also appointed to the board of directors of the [Monetary Authority of Singapore](/wiki/Monetary_Authority_of_Singapore) on 10 June 2011. On 1 August 2012, he was promoted to [Senior Minister of State for Information, Communications and the Arts](/wiki/Ministry_of_Communications_and_Information) and Senior Minister of State for Education. On 1 November 2012, he was appointed Acting [Minister for Culture, Community and Youth](/wiki/Ministry_of_Culture,_Community_and_Youth) and Senior Minister of State for Communications and Information. Wong led a team to bid for the [Singapore Botanic Gardens](/wiki/Singapore_Botanic_Gardens) to be recognised as Singapore's first [UNESCO](/wiki/UNESCO) [World Heritage Site](/wiki/World_Heritage_Site). Wong also spearheaded the free museum entry policy for all Singaporeans and permanent residents, to all national museums and heritage institutions from 18 May 2013. In 2013, Wong also announced the setting up of a new S$100 million National Youth Fund for youth to champion community and social causes. ### Minister On 1 May 2014, Wong was promoted to [Minister for Culture, Community and Youth](/wiki/Ministry_of_Culture,_Community_and_Youth) and [Second Minister for Communications and Information](/wiki/Ministry_of_Communications_and_Information). He was also a co-opted Member of the 32nd, 33rd and 35th CEC before his win in the election into the 36th [PAP Central Executive Committee](/wiki/Central_Executive_Committee_(PAP)) (CEC). Wong was also appointed as the Head of the SG50 Programme Office that coordinates the work of five committees for Singapore's Golden Jubilee Year celebrations. Wong was also the co-chair for the SG50 Culture and Community Committee in August 2013. As Minister for Culture, Community and Youth, Wong was involved in the transformation of the [Civic District](/wiki/Civic_District,_Singapore)—the birthplace of modern Singapore which contained many institutions that have witnessed important turning points in Singapore's history. In January 2016, he assumed office as Chairman of the [PAP Community Foundation](/wiki/PAP_Community_Foundation) from 2016 until June 2022 where it was handed over to Minister [Josephine Teo](/wiki/Josephine_Teo) In August 2016, the [National Arts Council](/wiki/National_Arts_Council_(Singapore)) attracted criticisms over the high consultation fees paid for a bin centre, as flagged by the Auditor-General's Office. Wong addressed the issue in Parliament, saying that the project was at acceptable cost due to the need for extensive study of the location and technicality involved with the building of the refuse centre in the Civic District. Under his charge, Wong also introduced the S$200 million Cultural Matching Fund, a dollar-for-dollar matching grant for cash donations to arts and heritage charities and Institutions of Public Character in Singapore. In the [2015 general election](/wiki/2015_Singaporean_general_election), Wong was part of a four-member PAP team contesting in the newly formed [Marsiling–Yew Tee GRC](/wiki/Marsiling%E2%80%93Yew_Tee_Group_Representation_Constituency). The PAP team won with 68.7% of the vote against the [Singapore Democratic Party](/wiki/Singapore_Democratic_Party) (SDP) and Wong was elected as the Member of Parliament representing the [Limbang](/wiki/Yew_Tee) ward of Marsiling–Yew Tee GRC. Wong was also the Chairman of the Steering Committee for the [2015 Southeast Asian Games](/wiki/2015_Southeast_Asian_Games). Wong had also announced several key initiatives to get more Singaporeans involved in sports. This includes a national movement called ActiveSG, which gives all Singaporeans and permanent residents ActiveSG$100 to sign up for sports programmes, and enter into swimming pools and gyms at the various sports centres islandwide. Wong also chaired the Singapore High Performance Sports Steering Committee, which provides strategic guidance on identifying and nurturing high performing sporting talents. Wong said that the accomplishments of Singapore athletes at the 2015 Southeast Asian Games indicate that Singapore's investment in sports is paying off. On 1 October 2015, Wong became the [Minister for National Development](/wiki/Ministry_of_National_Development_(Singapore)). He also chaired the steering committee for the development of [Jurong Lake Gardens](/wiki/Jurong_Lake_District). On 22 August 2016, Wong was appointed [Second Minister for Finance](/wiki/Ministry_of_Finance_(Singapore)), in addition to being Minister for National Development. On 29 August 2016, he stepped down from the board of directors of the [Monetary Authority of Singapore](/wiki/Monetary_Authority_of_Singapore) and was replaced by [Ong Ye Kung](/wiki/Ong_Ye_Kung). As Minister for National Development, Wong was responsible for reducing the supply of HDB flats from 2017. During the [COVID-19 pandemic in Singapore](/wiki/COVID-19_pandemic_in_Singapore), Wong and [Gan Kim Yong](/wiki/Gan_Kim_Yong) were appointed co-chairs of a multi-ministerial committee formed by the government in January 2020 to manage the situation. On 26 March 2020, while paying tribute to frontline workers helping in Singapore's fight against COVID-19, Wong turned emotional and teary-eyed while delivering his address in Parliament. He thanked healthcare workers, as well as those working in cleaning, transport and security sectors for providing much-needed services to keep Singapore going during this difficult time. In the [2020 general election](/wiki/2020_Singaporean_general_election), Wong led a four-member PAP team to contest in [Marsiling–Yew Tee GRC](/wiki/Marsiling%E2%80%93Yew_Tee_Group_Representation_Constituency) again. The PAP team won with 63.18% of the vote against the [Singapore Democratic Party](/wiki/Singapore_Democratic_Party) and Wong retained his seat as the Member of Parliament representing Limbang ward. On 27 July 2020, following a Cabinet reshuffle, Wong succeeded [Ong Ye Kung](/wiki/Ong_Ye_Kung) as [Minister for Education](/wiki/Ministry_of_Education_(Singapore)). On 8 November that year, Wong was elected into the PAP's Central Executive Committee for the first time after rising to prominence for leading the Government's fight against COVID-19. On 15 May 2021, following another [Cabinet reshuffle](/wiki/Fifth_Lee_Hsien_Loong_Cabinet), Wong relinquished his portfolio as Minister for Education and became [Minister for Finance](/wiki/Ministry_of_Finance_(Singapore)) after Heng relinquished his Cabinet portfolio. On 28 May 2021, he was reappointed to the board of directors of the [Monetary Authority of Singapore](/wiki/Monetary_Authority_of_Singapore) as deputy chair, replacing [Lim Hng Kiang](/wiki/Lim_Hng_Kiang). In February 2022, Wong announced that the government's postponed plan to increase Singapore's Goods and Services Tax would take place, going from 7% to 9% progressively in 2023 and 2024, with a 1% increase each year. Wong also announced a S$500 million stimulus package due to the impact of the COVID-19 pandemic in Singapore, and said the government would set aside an additional S$560 million to \"help Singaporean citizens deal with the rising cost of living\". Later in June 2022, Wong announced another $1.5 billion support package to provide targeted relief for lower-income and vulnerable groups. At Budget 2023, Wong announced that the Assurance Package was enhanced from $6.6 billion, announced in 2022, to $9.6 billion. This was to offset additional GST expenses for the majority of Singaporean households for at least five years. In September 2023, Wong announced an additional $1.1 billion Cost-of-Living (COL) Support Package to provide more relief for Singaporean households, especial lower- to middle-income families. ### Deputy Prime Minister On 14 April 2022, Wong was selected as the leader of the PAP's fourth-generation (4G) team, succeeding [Deputy Prime Minister](/wiki/Deputy_Prime_Minister_of_Singapore) [Heng Swee Keat](/wiki/Heng_Swee_Keat), who had stepped down as 4G leader on 8 April 2021. Prior to his appointment, Prime Minister [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) delegated former PAP chairman [Khaw Boon Wan](/wiki/Khaw_Boon_Wan) to initiate a consultation process among the fourth-generation ministers of the [Cabinet](/wiki/Cabinet_of_Singapore), aimed at garnering their individual views regarding the selection of a new 4G leader. Lee and [Senior Ministers](/wiki/Senior_Minister_of_Singapore) [Tharman Shanmugaratnam](/wiki/Tharman_Shanmugaratnam) and [Teo Chee Hean](/wiki/Teo_Chee_Hean) abstained from participating in the process. Wong received an \"overwhelming majority\" of support in the consultation process, surpassing that of [Ong Ye Kung](/wiki/Ong_Ye_Kung) and [Chan Chun Sing](/wiki/Chan_Chun_Sing), his cabinet colleagues and co-contestants in the 4G leadership race. He received 15 out of the 19 votes from the stakeholders polled, and as no candidate is allowed to vote for himself, this meant that only three other individuals did not vote for him as their first choice. His candidature was unanimously endorsed by the Cabinet and subsequently, by the PAP [MPs](/wiki/Member_of_parliament) at a party caucus on 14 April. His appointment was announced by Prime Minister Lee in a [Facebook post](/wiki/Facebook) the same day. On 6 June 2022, a Cabinet reshuffle was announced where Wong was promoted to Deputy Prime Minister, which further cemented his position as Prime Minister [Lee Hsien Loong](/wiki/Lee_Hsien_Loong)'s successor. In addition to becoming Deputy Prime Minister, he was also named \"Acting Prime Minister\" in Lee's absence. He had also taken over responsibility of the Strategy Group in the [Prime Minister's Office](/wiki/Prime_Minister%27s_Office_(Singapore)) (PMO) from [Heng Swee Keat](/wiki/Heng_Swee_Keat). On 28 June 2022, Wong launched the \"Forward Singapore\" movement as part of his vision for a society that \"benefits many, not a few\". The Forward Singapore report was released on 27 October 2023. Following the resignation of former Senior Minister and current President [Tharman Shanmugaratnam](/wiki/Tharman_Shanmugaratnam), Wong was appointed to several positions such as Chair of the GIC Investment Strategies Committee, Chair of the EDB International Advisory Council until his subsequent relinquishment of the Chairmanship to [Gan Kim Yong](/wiki/Gan_Kim_Yong) and Deputy Chairman of the [GIC](/wiki/GIC_(sovereign_wealth_fund)). On 5 November 2023, Lee Hsien Loong announced that he handover the premiership to Wong by November 2024, before the [next general election](/wiki/2025_Singaporean_general_election), \"if all goes well\". He eventually succeeded Lee in May 2024. ## Prime Minister (2024–present) Wong subsequently emerged as Lee's apparent successor to the position of prime minister; the latter's initial plan to step down at the age of 70 had been complicated by Heng's withdrawal. On 15 April 2024, the [Prime Minister's Office](/wiki/Prime_Minister%27s_Office_(Singapore)) issued a press statement confirming that Lawrence Wong would succeed Lee Hsien Loong as prime minister. Wong was officially sworn in at 20:00 local time on 15 May at [The Istana](/wiki/The_Istana). He became the country's fourth prime minister, as well as the first to be born after [Singapore's independence in 1965](/wiki/Independence_of_Singapore_Agreement_1965). At his swearing-in ceremony, during his first speech as Prime Minister, Wong stated \"This is my promise to all Singaporeans: I will serve you with all my heart. I will never settle for the status quo. I will always seek better ways to make tomorrow better than today.\" He also stated that his mission as Prime Minister was \"to continue defying the odds and to sustain this miracle called Singapore.\" On 12 June 2024, it was announced that [Gan Kim Yong](/wiki/Gan_Kim_Yong) had taken over as Chairman of the Economic Development Board's International Advisory Council since 1 June from Wong, who previously took over from Tharman in July 2023. On 4 December 2024, he was elected as the Secretary-General of [People's Action Party](/wiki/People%27s_Action_Party). ### Foreign policy Wong made his first overseas visits as Prime Minister from 11 to 12 June 2024 where he made his introductory visits to Brunei and Malaysia as Prime Minister. Wong attended his first ASEAN Meeting as Prime Minister from 9 to 12 October and first Commonwealth Heads of Government Meeting from 23 to 26 October. Wong attended his first APEC and G20 Meetings as Prime Minister from 14 to 16 in Peru and 17 to 20 November in Brazil. ### 2025 general election Wong led the PAP in the [2025 general election](/wiki/2025_Singaporean_general_election) in May, contesting in [Marsiling–Yew Tee Group Representation Constituency](/wiki/Marsiling%E2%80%93Yew_Tee_Group_Representation_Constituency) (GRC) against the [Singapore Democratic Party](/wiki/Singapore_Democratic_Party) (SDP). This was his first general election as prime minister, and was described as his \"first electoral test as leader\". The PAP would subsequently retain its [supermajority](/wiki/Supermajority) of 65.57% of the vote, consisting of 87 of the 97 seats in parliament. In Marsiling–Yew Tee GRC, Wong and his team were elected with 73.46% of the vote, as compared to the SDP's 26.54%. He unveiled his [second cabinet](/wiki/Second_Lawrence_Wong_Cabinet) on 21 May 2025. ## Personal life Wong previously married at the age of 28, but divorced his first wife after three years because of \"incompatibility\". His second wife is Loo Tze Lui, a former banker currently working in [wealth management](/wiki/Family_office#single_family_office) and who served on the board of directors of YMCA Singapore. He has no children and is a [Methodist](/wiki/Methodist). His elder brother is an aerospace engineer at [DSO National Laboratories](/wiki/DSO_National_Laboratories). His hobbies include playing the guitar and riding motorcycles. - [List of current heads of state and government](/wiki/List_of_current_heads_of_state_and_government) - [List of heads of the executive by approval rating](/wiki/List_of_heads_of_the_executive_by_approval_rating) ## Notes - Lawrence Wong on Singapore Prime Minister's Office - Lawrence Wong on [Parliament of Singapore](/wiki/Parliament_of_Singapore) Political offices**New office** **[Minister for Culture, Community and Youth](/wiki/Ministry_of_Culture,_Community_and_Youth)** 2012–2015Succeeded by[Grace Fu](/wiki/Grace_Fu)Preceded by[Khaw Boon Wan](/wiki/Khaw_Boon_Wan) **[Minister for National Development](/wiki/Ministry_of_National_Development_(Singapore))** 2015–2020Succeeded by[Desmond Lee](/wiki/Desmond_Lee_(Singaporean_politician))**Vacant** **[Second Minister for Finance](/wiki/Ministry_of_Finance_(Singapore))** 2016–2021**Vacant**Preceded by[Ong Ye Kung](/wiki/Ong_Ye_Kung) **[Minister for Education](/wiki/Ministry_of_Education_(Singapore))** 2020–2021Succeeded by[Chan Chun Sing](/wiki/Chan_Chun_Sing)Preceded by[Heng Swee Keat](/wiki/Heng_Swee_Keat) **[Minister for Finance](/wiki/Ministry_of_Finance_(Singapore))** 2021–present**Incumbent****Vacant** **[Deputy Prime Minister](/wiki/Deputy_Prime_Minister_of_Singapore)** 2022–2024 Served alongside: **[Heng Swee Keat](/wiki/Heng_Swee_Keat)**Succeeded by[Gan Kim Yong](/wiki/Gan_Kim_Yong)Preceded by[Lee Hsien Loong](/wiki/Lee_Hsien_Loong) **[Prime Minister](/wiki/Prime_Minister_of_Singapore)** 2024–present**Incumbent**[Parliament of Singapore](/wiki/Parliament_of_Singapore)Preceded by[S. Iswaran](/wiki/S._Iswaran) [Ho Geok Choo](/wiki/Ho_Geok_Choo) [Arthur Fong](/wiki/Arthur_Fong) [Cedric Foo](/wiki/Cedric_Foo) [Lim Hng Kiang](/wiki/Lim_Hng_Kiang) **Member of Parliament for [West Coast GRC](/wiki/West_Coast_GRC)** 2011–2015 Served alongside: **[Foo Mee Har](/wiki/Foo_Mee_Har), [Arthur Fong](/wiki/Arthur_Fong), [Lim Hng Kiang](/wiki/Lim_Hng_Kiang), [S. Iswaran](/wiki/S._Iswaran)**Succeeded by[Foo Mee Har](/wiki/Foo_Mee_Har) [Patrick Tay](/wiki/Patrick_Tay) [Lim Hng Kiang](/wiki/Lim_Hng_Kiang) [S. Iswaran](/wiki/S._Iswaran)**New constituency** **[Member of Parliament](/wiki/List_of_Singapore_MPs) for [Marsiling–Yew Tee GRC](/wiki/Marsiling%E2%80%93Yew_Tee_Group_Representation_Constituency)** 2015–present Served alongside: **(2015-2020): [Ong Teng Koon](/wiki/Ong_Teng_Koon), [Halimah Yacob](/wiki/Halimah_Yacob), [Alex Yam](/wiki/Alex_Yam) (2020-2025): [Hany Soh](/wiki/Hany_Soh), [Zaqy Mohamad](/wiki/Zaqy_Mohamad), Alex Yam (2020-present): Hany Soh, Zaqy Mohamad, Alex Yam****Incumbent**Portals: - Biography - Politics - Singapore **Lawrence Wong** at Wikipedia's sister projects: - **News** from Wikinews - **Quotations** from Wikiquote - **Texts** from Wikisource - **Data** from Wikidata\n",
  "language": "en",
  "processed_at": "2026-01-12T11:20:33.646675",
  "title": "Lawrence Wong",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Lawrence_Wong"
}