{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:20:36.197206"
  },
  "content": "American theoretical physicist (1943–2020) **Lay Nam Chang** ([traditional Chinese](/wiki/Traditional_Chinese_characters): 章禮南; [simplified Chinese](/wiki/Simplified_Chinese_characters): 章礼南; [pinyin](/wiki/Pinyin): *Zhāng Lǐnán*, June 1, 1943 – December 8, 2020) was an American [theoretical physicist](/wiki/Theoretical_physics). Over the course of his career, he published research on topics in [particle physics](/wiki/Particle_physics), [nuclear physics](/wiki/Nuclear_physics), [general relativity](/wiki/General_relativity), and [quantum cosmology](/wiki/Quantum_cosmology). In the mid-1970s, he also published pioneering work on the foundations of [string theory](/wiki/String_theory). In 2003, he served as the founding dean of the College of Science at [Virginia Polytechnic Institute and State University](/wiki/Virginia_Polytechnic_Institute_and_State_University) (\"Virginia Tech\") and held that position until 2016. ## Education Lay Nam Chang was born in [Singapore](/wiki/Singapore) on June 1, 1943. He received his AB degree from Columbia University in 1964 and earned his PhD in physics from the [University of California, Berkeley](/wiki/University_of_California,_Berkeley) in 1967. [Steven Weinberg](/wiki/Steven_Weinberg), who won the [Nobel Prize in Physics](/wiki/Nobel_Prize_in_Physics) in 1979, supervised Chang's dissertation. ## Career and research After earning his PhD at Berkeley, Lay Nam Chang was a resident associate at [MIT](/wiki/Massachusetts_Institute_of_Technology) from 1967 to 1969. He next held a postdoctoral fellowship at the Enrico Fermi Institute of the University of Chicago from 1969 to 1971. Lay Nam Chang served as an assistant professor of physics at the [University of Pennsylvania](/wiki/University_of_Pennsylvania) from 1971 to 1978. During his time at Penn, he was a visiting scientist at the [Niels Bohr Institute](/wiki/Niels_Bohr_Institute) in [Copenhagen, Denmark](/wiki/Copenhagen,_Denmark) (1974), [Stanford University](/wiki/Stanford_University), and the [Brookhaven National Laboratory](/wiki/Brookhaven_National_Laboratory) (1976, 1978). In 1976, during his time at Penn, Chang wrote pioneering articles on the foundations of [string theory](/wiki/String_theory), in collaboration with Freydoon Mansouri of [Yale University](/wiki/Yale_University). He moved to Virginia Tech in 1978 and rose from associate (1978–83) to full professor (post-1983). During his tenure at Virginia Tech, he was a visiting scientist at [Los Alamos National Laboratory](/wiki/Los_Alamos_National_Laboratory) (1981), [Stony Brook University](/wiki/Stony_Brook_University) (1982, 1984), Brookhaven National Laboratory (1980), and the [Kavli Institute for Theoretical Physics](/wiki/Kavli_Institute_for_Theoretical_Physics) at the [University of California, Santa Barbara](/wiki/University_of_California,_Santa_Barbara) (1988). For several years he served as chair of the Physics Department at Virginia Tech. From 2002 to 2003, he served as the last dean of Virginia Tech's College of Arts and Science, which, following a restructuring, split into a College of Liberal Arts and Human Sciences, and a College of Science. In 2003, Lay Nam Chang became first dean of Virginia Tech's newly formed College of Science and filled that role until his retirement in 2016. He held responsibility for eight departments, established a new School of Neuroscience, and initiated interdisciplinary programs including the Virginia Tech Academy of Integrated Science, which fosters research across fields such as computational analytics and data modeling, nanoscience, and systems biology. Lay Nam Chang continued to publish research articles in theoretical physics during his years as a dean. In 2005, he published a study called, \"Hydrogen-Atom Spectrum under a Minimal-Length Hypothesis,\" with Sandor Benczik, Djordje Minic, and Tatsu Takeuchi; while in 2013, he wrote an article with Zachary Lewis, Djordje Minic, and Tatsu Takeuchi entitled, \"Is Quantum Gravity a Super-Quantum Theory?\" ## Death and legacy Lay Nam Chang died from [COVID-19](/wiki/COVID-19) on December 8, 2020, at age 77, during the [COVID-19 pandemic in Virginia](/wiki/COVID-19_pandemic_in_Virginia). Students at Virginia Tech remembered him, among other things, for taking science- and non-science majors to visit [CERN](/wiki/CERN), the European Organization for Nuclear Research in [Geneva, Switzerland](/wiki/Geneva,_Switzerland), on a study abroad tour, and for introducing new specialized and interdisciplinary undergraduate programs in subjects like [nanomedicine](/wiki/Nanomedicine), [polymer chemistry](/wiki/Polymer_chemistry), and [medicinal chemistry](/wiki/Medicinal_chemistry). To honor Lay Nam Chang's service, Virginia Tech established an endowed chair, called the Lay Nam Chang Dean's Chair. This position provides its holder with funds to initiate new programs as dean of the College of Science. Upon establishing this position, the head of the Roundtable – Virginia Tech's advisory board of alumni and friends – called Chang a \"visionary\" for his work in promoting neuroscience within the university, while Virginia Tech's official news bureau described a college dean's chair like this one \"the most prestigious position that can be held\" within one of the institution's constituent colleges. The statistician [Sally C. Morton](/wiki/Sally_C._Morton) became the first recipient of the Lay Nam Dean's Chair in the College of Science at Virginia Tech in 2016.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:20:36.196852",
  "title": "Lay Nam Chang",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Lay_Nam_Chang"
}