{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:20:39.896308"
  },
  "content": "High-security storage facility in Singapore 1°20′42″N 103°58′09″E﻿ / ﻿1.3450°N 103.9691°E﻿ / 1.3450; 103.9691 **Le Freeport**, formerly known as **Singapore Freeport**, is a high-security storage and display facility in Singapore. Since 2022, the facility is owned by Chinese cryptocurrency billionaire [Jihan Wu](/wiki/Jihan_Wu) through his holding company Bitdeer Technologies. Prior to that, a majority stake was held by Natural Le Coultre S.A. of art dealer and shipper [Yves Bouvier](/wiki/Yves_Bouvier). Opened near [Singapore Changi Airport](/wiki/Singapore_Changi_Airport) in May 2010, the facility is modelled after similar institutions in [Geneva](/wiki/Geneva_Freeport) and [Luxembourg](/wiki/Luxembourg_Freeport). ## History The Freeport concept was pioneered by [Swiss](/wiki/Switzerland) art dealer [Yves Bouvier](/wiki/Yves_Bouvier) through his art shipping company Natural Le Coultre, who also founded the Freeports in [Geneva](/wiki/Geneva_Freeport) and [Luxembourg](/wiki/Luxembourg_Freeport). Following the success of the concept in Europe, Bouvier expanded it to Asia in the early 2000s at a time when Singapore was beginning to implement a series of laws that increased [banking secrecy](/wiki/Bank_secrecy), strengthened trusts and reduced taxes in order to develop into a global hub for private banking. At the same time, [banking secrecy](/wiki/Bank_secrecy) was rolled back in Switzerland, following greater scrutiny on the country's role as a [tax haven](/wiki/Tax_haven). Bouvier and [diamond](/wiki/Diamond) dealer Alain Vandenborre are both shareholders in the Singapore Freeport. In 2022, the facility was purchased by Chinese cryptocurrency billionaire [Jihan Wu](/wiki/Jihan_Wu) through his holding company Bitdeer Technologies for [S$](/wiki/Singapore_dollar)40 million (US$28.4 million). ## The facility The Freeport building was designed by architects and security experts from Switzerland. Owing to its security features, the facility has been described as \"part bunker, part gallery\" and \"Singapore’s [Fort Knox](/wiki/Fort_Knox) for [fine art](/wiki/Fine_art) and collectibles.\" The Freeport's interior features furniture by contemporary designers [Ron Arad](/wiki/Ron_Arad_(industrial_designer)) and [Johanna Grawunder](/wiki/Johanna_Grawunder). Covering 30,000 square metres (320,000 sq ft), the facility sports climate-controlled storage rooms. Among its most prominent corporate clients was auction house [Christie's](/wiki/Christie%27s), which rented more than a third of the Freeport's storage space until it pulled out in 2018, and [Deutsche Bank](/wiki/Deutsche_Bank), which used it to store [gold bullion](/wiki/Gold_bar) worth $8.9 billion but stated it is no longer a customer there. The Freeport has been credited as one reason, besides the government's exempting of investment-grade [precious metals](/wiki/Precious_metal) trading from goods and services tax, that Singapore has been slowly reclaiming its role as a physical gold trading hub. According to *[Bloomberg](/wiki/Bloomberg_News)*, the Freeport has reportedly accumulated losses of S$14.4 million over about ten years until 2018, and any potential buyer would inherit a S$20 million [debt](/wiki/Debt) to Singapore's largest bank, DBS Group Holdings. Just like the Geneva and Luxembourg facilities, the Singapore freeport has been called into question since the [Bouvier Affair](/wiki/The_Bouvier_Affair), in which Yves Bouvier allegedly misrepresented the cost of artworks and subsequently overcharged clients. A 2018 [European Commission](/wiki/European_Commission) report also observed that freeports increased in demand as banks began fighting illegal financial activities, making them potential hotspots for financial crime. ### Alleged role in illicit financial activities #### 2013 *Economist* article An article published by *[The Economist](/wiki/The_Economist)* in 2013 named the Singapore Freeport as one of such facilities possibly used by ultra-rich people to [evade taxes](/wiki/Tax_evasion) thanks to the facility's confidentiality. The Freeport denied the truthfulness of the article. #### 2014 Monetary Authority of Singapore report A 2014 National Risk Assessment Report by the Monetary Authority of Singapore (MAS) identified the Freeport as a potential risk for [illicit financial activities](/wiki/Financial_crime). Company chairman Tony Reynard at that time denied this possibility, stating that \"all operations at the Singapore Freeport are under the supervision of Singapore Customs, which can access anything at any time.\" However, Freeport managers have admitted to having no knowledge of what is being stored inside the facility due to the strict policy of discretion with their clients. #### 2016 Financial Action Task Force (FATF) report In its 2016 mutual evaluation report on [anti-money laundering](/wiki/Money_laundering) and counter-terrorist financing measures, the [FATF](/wiki/Financial_Action_Task_Force_on_Money_Laundering) identified the Freeport as \"an emerging risk to consider\" as it presented \"a medium to high\" money-laundering and terrorist-financing risk. The report further noted that \"The relevant authorities…did not demonstrate a comprehensive understanding of what activities were being undertaken in the Singapore Freeport.\" #### Storage of looted objects In 2016, a [UNESCO](/wiki/UNESCO) report on the protection of [cultural heritage sites](/wiki/List_of_cultural_heritage_sites_in_Sindh) identified the Freeports in Geneva, Luxembourg and Singapore as a \"possible problem for the protection of [cultural property](/wiki/Cultural_property) and its illicit [trafficking](/wiki/Smuggling)\" and warned that these facilities could be used \"to store works of art from [thefts](/wiki/Theft), [lootings](/wiki/Looting) or illicit [excavations](/wiki/Excavation_(archaeology)) for resale in the [black market](/wiki/Black_market)...even many years later.\" - Official website - [Geneva Freeport](/wiki/Geneva_Freeport) - [Luxembourg Freeport](/wiki/Luxembourg_Freeport)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:20:39.895810",
  "title": "Le Freeport",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Le_Freeport"
}