{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:20:53.119077"
  },
  "content": "Singapore physician (1895–1947) **Lee Choo Neo** ([Chinese](/wiki/Simplified_Chinese_characters): 李珠娘; [pinyin](/wiki/Pinyin): *Lǐ Zhūniáng*; 7 September 1895 – 7 September 1947) was the first female medical doctor to practice in [Singapore](/wiki/Singapore). Her father, Lee Hoon Leong, was a merchant of [Hakka descent](/wiki/Hakka_people). Her mother was her father's first wife, Mak Hup Sin, who was of [Cantonese descent](/wiki/Cantonese_people). Lee Choo Neo was also the aunt of [Lee Kuan Yew](/wiki/Lee_Kuan_Yew), Singapore's first Prime Minister; his father was her younger half-brother, [Lee Chin Koon](/wiki/Lee_Chin_Koon). ## History Lee attended [Singapore Chinese Girls’ School](/wiki/Singapore_Chinese_Girls%27_School) and [Raffles Girls’ School](/wiki/Raffles_Girls%27_School_(Secondary)). In 1911, Lee Choo Neo became the first Straits Chinese girl to earn the Senior Cambridge Certificate, and in 1918, she graduated from [King Edward VII College of Medicine](/wiki/King_Edward_VII_College_of_Medicine), Singapore. She originally served as an assistant surgeon, overseeing two women's wards at the General Hospital. Lee Choo Neo married Teo Koon Lim at 114 Emerald Hill on 21 September 1923 and had a son named Lionel Teo Cheng Ann and two daughters namely Eileen Teo Cheng Sim and Winnie Teo Cheng Kim. After several years in the government service, she resigned and followed her husband to [Kuala Lumpur](/wiki/Kuala_Lumpur) who had business there. However, in 1930, she went back to Singapore and opened her own clinic *Lee Dispensary* on Bras Basah Road, which specialized in maternity care. In addition to her medical work, she was a founder of the Chinese Ladies' Association of Malaya (later called the Chinese Women's Association), founded in 1915, which raised funds for war, taught domestic skills, introduced outdoor sports, and sponsored a rescue home for at-risk women. She served as the Association's honorary secretary for many years. In 1925 she and two other women were appointed to the Chinese Marriage Committee, which was investigating the need for laws to govern Chinese marriage and divorce in the Straits Settlements. The Chinese Marriage Committee found that women wanted an end to [polygamy](/wiki/Polygamy), while men did not; their findings were a preliminary to the 1961 passage of the [Women's Charter](/wiki/Women%27s_Charter), which outlawed polygamy. Lee Choo Neo died on 7 September 1947, and her grave is located in Singapore in the [Bukit Brown](/wiki/Bukit_Brown) Chinese Cemetery. The [Singapore Women's Hall of Fame](/wiki/Singapore_Women%27s_Hall_of_Fame) was created in 2014, and Lee Choo Neo was inducted into it that same year, under the category \"Health.\" This biographical article related to medicine in Singapore is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:20:53.118767",
  "title": "Lee Choo Neo",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Lee_Choo_Neo"
}