{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:05:31.081612"
  },
  "content": "Prime Minister of Singapore from 2004 to 2024, Senior Minister of Singapore since 2024 **Lee Hsien Loong**[a] [PPA(E)](/wiki/Pingat_Pentadbiran_Awam_(Tentera)) [SPMJ](/wiki/Order_of_the_Crown_of_Johor#Knight_Grand_Commander) [DK](/wiki/Family_Order_of_Laila_Utama) [AC](/wiki/Order_of_Australia) (born 10 February 1952), also known by his initials **LHL**, is a Singaporean politician and former military officer who has served as the [Senior Minister of Singapore](/wiki/Senior_Minister_of_Singapore) since 2024, having previously served as the third [Prime Minister](/wiki/Prime_Minister_of_Singapore) between 2004 and 2024. He also served as the secretary-general of the governing [People's Action Party](/wiki/People%27s_Action_Party) (PAP) between 2004 and 2024. As a [Member of Parliament](/wiki/Parliament_of_Singapore#Members_of_Parliament) (MP), he has represented the Teck Ghee division of [Ang Mo Kio Group Representation Constituency](/wiki/Ang_Mo_Kio_Group_Representation_Constituency) (GRC) since 1991, having previously represented [Teck Ghee Single Member Constituency](/wiki/Teck_Ghee_Single_Member_Constituency) (SMC) between 1984 and 1991. Born and raised in [Singapore during British colonial rule](/wiki/Colony_of_Singapore), Lee is the eldest son of Singapore's first prime minister, [Lee Kuan Yew](/wiki/Lee_Kuan_Yew). He graduated from [Trinity College, Cambridge](/wiki/Trinity_College,_Cambridge), in 1974 with [first class honours](/wiki/British_undergraduate_degree_classification#First-class_honours) in mathematics and a [Diploma in Computer Science](/wiki/Cambridge_Diploma_in_Computer_Science) with distinction (equivalent to a first-class master's in computer science). He served in the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces) (SAF) between 1971 and 1984, and attained the rank of [Brigadier-General](/wiki/Brigadier-General), completing a [Master of Public Administration](/wiki/Master_of_Public_Administration) degree at [Harvard Kennedy School](/wiki/Harvard_Kennedy_School) in 1980. Lee discharged from the SAF in 1984 to enter politics. Lee served in several cabinet posts under prime ministers [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) and [Goh Chok Tong](/wiki/Goh_Chok_Tong) before assuming the office of prime minister in August 2004. In his first two years, his government enacted a [five-day work week](/wiki/Workweek_and_weekend) and extended [maternity leave](/wiki/Maternity_leave). His proposal to build two [integrated resorts](/wiki/Integrated_resorts_in_Singapore) in Singapore to increase tourism revenue led to the development of the [Marina Bay Sands](/wiki/Marina_Bay_Sands) and [Resorts World Sentosa](/wiki/Resorts_World_Sentosa). Following the [Great Recession](/wiki/Great_Recession) of 2008, he oversaw the country's economic recovery within two years. Political reforms in 2010 saw an increase in the number of [non-constituency members of parliament](/wiki/Non-Constituency_Member_of_Parliament). In 2020 and 2021, Lee oversaw the government response to the [COVID-19 pandemic](/wiki/COVID-19_pandemic_in_Singapore) and its [associated recession and recovery](/wiki/COVID-19_recession). In 2022, he also oversaw the government response to the [Russian invasion of Ukraine](/wiki/Russian_invasion_of_Ukraine), making Singapore the only [Southeast Asian](/wiki/Southeast_Asia) country to impose sanctions on Russia. That same year, his government legalised [same-sex sexual activity](/wiki/Same-sex_relationship) between men by repealing the [unenforced](/wiki/Unenforced_law) colonial-era [Section 377A](/wiki/Section_377A_(Singapore)). In April 2024, Lee announced that he would not seek a sixth term as prime minister in the [forthcoming general election](/wiki/2025_Singaporean_general_election); he was succeeded by [Lawrence Wong](/wiki/Lawrence_Wong), who formed a [new cabinet](/wiki/First_Lawrence_Wong_Cabinet) and subsequently appointed Lee as a [senior minister](/wiki/Senior_Minister_of_Singapore). Lee's premiership had been marked by maintaining political continuity, institutional stability and [technocratic](/wiki/Technocratic) governance under the PAP. He implemented incremental political reforms and social policy enhancements such as expanded safety nets and public housing to address inequality. However, his tenure drew criticism for the continued high level of control exercised over political discourse similar to his father. His use of [defamation](/wiki/Defamation) lawsuits against journalists, bloggers and opposition figures including cases involving [Roy Ngerng](/wiki/Roy_Ngerng) and Leong Sze Hian was widely reported and criticised as a means of [discouraging](/wiki/Self-censorship) further dissent. His leadership was also marked by a public family dispute with his siblings over the fate of their late father's house at [38 Oxley Road](/wiki/38_Oxley_Road), which attracted significant media attention and public debate. His government's reliance on laws such as the [Protection from Online Falsehoods and Manipulation Act](/wiki/Protection_from_Online_Falsehoods_and_Manipulation_Act) (POFMA) also raised concerns about its [chilling effect](/wiki/Chilling_effect) on free speech and democratic discourse. As prime minister, Lee was the [highest-paid head of government](/wiki/List_of_salaries_of_heads_of_state_and_government) in the world, a status that has continued under Wong's leadership. ## Early life Lee Hsien Loong was born at [KK Women's and Children's Hospital](/wiki/KK_Women%27s_and_Children%27s_Hospital) in Singapore on 10 February 1952, during the time when [Singapore was a British colony](/wiki/Colony_of_Singapore). He is the eldest child of Lee Kuan Yew and [Kwa Geok Choo](/wiki/Kwa_Geok_Choo) and the [patriline](/wiki/Patrilineality) grandson of a retired storekeeper-turned-[salesman](/wiki/Salesman), [Lee Chin Koon](/wiki/Lee_Chin_Koon) (1903–1995) and [Chua Jim Neo](/wiki/Chua_Jim_Neo) (1905–1980), a [chef](/wiki/Chef). His mother has ancestry from [Tong'an District](/wiki/Tong%27an_District) and [Longhu](/wiki/Longhu_District) while his father has ancestry from [Dabu County](/wiki/Dabu_County) in China. ### Education Lee was educated at [Nanyang Primary School](/wiki/Nanyang_Primary_School) and [Catholic High School](/wiki/Catholic_High_School_(Singapore))—where he played [clarinet](/wiki/Clarinet) in the school band, and [National Junior College](/wiki/National_Junior_College) before he was awarded the [President's Scholarship](/wiki/President%27s_Scholar) and [Singapore Armed Forces Overseas Scholarship](/wiki/Singapore_Armed_Forces_Overseas_Scholarship) in 1971 by the [Public Service Commission](/wiki/Public_Service_Commission_(Singapore)) (PSC) to study mathematics at [Trinity College, University of Cambridge](/wiki/Trinity_College,_Cambridge). He became the [Senior Wrangler](/wiki/Senior_Wrangler_(University_of_Cambridge)) at Cambridge in 1973, and graduated in 1974 with a [Bachelor of Arts](/wiki/Bachelor_of_Arts) with first class honours degree (later promoted to [Master of Arts](/wiki/Master_of_Arts_(Oxford,_Cambridge,_and_Dublin)) by seniority) in mathematics and a [diploma in computer science](/wiki/Cambridge_Diploma_in_Computer_Science) (now equivalent to a master's degree in computer science) with distinction. His college tutor, Denis Marrian, later described Lee as \"the brightest mathematician he had admitted to the college\". [Béla Bollobás](/wiki/B%C3%A9la_Bollob%C3%A1s) said that Lee \"would have been a world-class research mathematician\", but his father did not realise this and persuaded Lee to leave the field. In an interview prior to Lee's resignation as prime minister in 2024, Lee revealed that he did not regret on choosing to pursue the path of politics over mathematics, saying that he \"had the responsibility to come back to Singapore, be part of Singapore, and do what [he] could to help the country to succeed\", which was \"the right thing to do\". He subsequently went on to complete a [Master of Public Administration](/wiki/Master_of_Public_Administration) degree, becoming a Mason Fellow at [Harvard University](/wiki/Harvard_University)'s [John F. Kennedy School of Government](/wiki/Harvard_Kennedy_School) in 1980. ### Military career Lee joined the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces) (SAF) in 1972, and served as a commissioned officer between 1974 and 1984, and held various staff and command posts, including Director of the Joint Operations and Plans Directorate, and Chief of Staff of the General Staff. He also attended the [United States Army Command and General Staff College](/wiki/United_States_Army_Command_and_General_Staff_College) at [Fort Leavenworth](/wiki/Fort_Leavenworth) in 1978. Lee rose quickly through the ranks in the [Singapore Army](/wiki/Singapore_Army), becoming the youngest [brigadier-general](/wiki/Brigadier-general) in Singapore's history after his promotion in July 1983 at the age of 31. Notably, he was put in command of the rescue operations following the [Sentosa cable car disaster](/wiki/Singapore_Cable_Car_disaster). Lee served as commanding officer of the [23rd Battalion Singapore Artillery](/wiki/Singapore_Artillery) in the Singapore Army before he left the SAF in 1984 for politics. ## Early political career During the 1980s, Lee was regarded as the core member of the next batch of new leaders in the People's Action Party (PAP) [leadership transition](/wiki/Leadership_transition_in_the_People%27s_Action_Party) that was taking place in the mid-1980s, as Lee Kuan Yew had declared that he would step down as prime minister in 1984. Following the [1984 general election](/wiki/1984_Singaporean_general_election), all of the old [Central Executive Committee](/wiki/Central_Executive_Committee_(PAP)#Old_Guards) members except Lee Kuan Yew resigned on 1 January 1985. Lee was first elected [Member of Parliament](/wiki/Parliament_of_Singapore) for the [Teck Ghee SMC](/wiki/Teck_Ghee_Single_Member_Constituency) in 1984, at the age of 32. He was subsequently appointed [Minister of State for Trade and Industry](/wiki/Ministry_of_Trade_and_Industry_(Singapore)), and [Minister of State for Defence](/wiki/Ministry_of_Defence_(Singapore)). In 1985, Lee chaired the government's economic committee, which recommended changes to established government policies to reduce business costs, foster longer-term growth and revive the Singapore economy, which was experiencing a recession at the time. The committee's recommendations included reductions in corporate and personal taxes and the introduction of a [consumption tax](/wiki/Consumption_tax). In 1986, Lee was appointed Acting [Minister for Trade and Industry](/wiki/Ministry_of_Trade_and_Industry_(Singapore)#Ministers). In 1987, he became a full member of the Cabinet as Minister for Trade and Industry and Second Minister for Defence. ### PAP Youth Committee In March 1986, First Deputy Prime Minister Goh Chok Tong discussed the question with Lee on encouraging younger Singaporeans to join the party. Goh was firm that the proposed committee should attract only the right kinds of members, ruling out material rewards as an incentive. The proposed youth wing was to encourage the improvement of the system from within, which would give new members a stake in the country's future. Lee later said the establishment of the youth wing reflected concerns by the leadership that the lack of an official channel to engage with the younger generation might lead them to vote for opposition parties and potentially bring the PAP government down. The youth wing was an official \"tailor-made\" mechanism to allow dissenting opinions to be heard. Lee was the first chairman of the PAP Youth Committee upon its establishment, the predecessor to [Young PAP](/wiki/Young_PAP). ## Deputy Prime Minister ### Ministerial duties On 28 November 1990, Goh Chok Tong succeeded Lee Kuan Yew as prime minister. Lee Hsien Loong was made one of two deputy prime ministers, along with [Ong Teng Cheong](/wiki/Ong_Teng_Cheong). He continued to serve as the minister for trade and industry until 1992, when he was diagnosed with [lymphoma](/wiki/Lymphoma). He subsequently relinquished his ministerial position and underwent three months of [chemotherapy](/wiki/Chemotherapy), though he continued to be a deputy prime minister during his illness. The chemotherapy was successful, and his cancer has gone into remission. Lee was appointed chairman of the [Monetary Authority of Singapore](/wiki/Monetary_Authority_of_Singapore) (MAS) in January 1998, and in 2001 he was made the [finance minister](/wiki/Minister_for_Finance_(Singapore)). To ease the growing budget deficit due to falling tax revenues from cuts in corporate and personal income taxes and other factors such as the [Iraq War](/wiki/Iraq_War) and [SARS](/wiki/Severe_Acute_Respiratory_Syndrome) outbreak, Lee proposed on 29 August 2003 to raise the [GST](/wiki/Goods_and_Services_Tax_(Singapore)) from three per cent to five per cent, a change that took place in January 2004. Lee initiated several amendments to render requirements for [Singapore citizenship](/wiki/Singapore_citizenship) less restrictive, notably for foreign-born children of Singaporean women. The changes were made after repeated pleas from MPs and the [Remaking Singapore Committee](/wiki/Remaking_Singapore_Committee). ### Visit to Taiwan On 10 July 2004, Lee visited [Taiwan](/wiki/Taiwan), an island claimed by the People's Republic of China (PRC) that has been ruled by the [Republic of China](/wiki/Government_of_the_Republic_of_China) (ROC) since 1945. The Singapore government maintains a policy of neutrality in the [Cross-Strait relations](/wiki/Cross-Strait_relations) between the two sides despite having severed diplomatic relations with the Republic of China on 3 October 1990 in favour of the People's Republic. To continue facilitating this policy when Lee becomes Prime Minister, Lee believed it to be important for him to \"personally feel for the situation\" in Taiwan and made the trip going to Taiwan. Ministry of Foreign Affairs officials advised that any visit to Taiwan by an incumbent prime minister would be diplomatically impossible, hence the trip was planned a month before Lee assumed the premiership and in his capacity as a private citizen, not as a government minister or as the head of government, with the PRC embassy informed on 9 July 2004. On the same day's afternoon, the PRC government summoned the Singapore ambassador in Beijing and urged the cancellation of Lee's trip, citing the likelihood of [Chen Shui Bian](/wiki/Chen_Shui_Bian)'s administration in Taiwan exploiting the trip as a diplomatic coup and using it to promote [the independence of Taiwan](/wiki/Taiwan_independence), with the PRC claiming that Singapore was making a \"historical error\" for the trip. Then-Foreign Minister [S. Jayakumar](/wiki/S._Jayakumar_(Singaporean_politician)) replied to the PRC counterpart of him [Li Zhaoxing](/wiki/Li_Zhaoxing) that the ROC government had been asked to keep the visit low-profile and that it would proceed as planned. > \"When our vital interests are at stake, we must quietly stand our ground. As Dr [Habibie](/wiki/B._J._Habibie) said, Singapore is a [little red dot](/wiki/Little_red_dot). If we don't defend our interests, who will?\" Lee in his National Day Rally speech The PRC later retaliated by cancelling several visits by high-ranking PRC officials to Singapore and delaying planned [signing ceremonies](/wiki/Signing_ceremony), hinting that free trade negotiations would also be pushed back. The matter was further complicated and magnified when Taiwanese media headlined the visit and portrayed it as a diplomatic breakthrough, which raised tensions with the PRC. The Singapore government later published the full records of the discussion with the Chinese embassy in Singapore's local media. On 28 August 2004, in his first National Day Rally speech and as prime minister, Lee criticised some Taiwanese political leaders over their lack of understanding over the shifting balance of power across the Taiwan strait and Taiwan's international position in their zeal for Taiwanese independence; and he criticised Taiwanese for capitalising on his private visit. He reiterated the reasons for the visit and said that Singapore's decision to stand firm on its vital interests had earned it international respect. Relations were eventually mended when Lee met [Hu Jintao](/wiki/Hu_Jintao) at the [APEC](/wiki/APEC) Economics Leaders' Meeting on 19 November 2004, which signified the end of the dispute. ## Prime Minister (2004–2024) ### 2004–2006: First term On 12 August 2004, Lee succeeded [Goh Chok Tong](/wiki/Goh_Chok_Tong) as prime minister and relinquished his chairmanship of the [Monetary Authority of Singapore](/wiki/Monetary_Authority_of_Singapore) to Goh. [Chief Justice](/wiki/Chief_Justice_of_Singapore) [Yong Pung How](/wiki/Yong_Pung_How) had Lee sworn in at [the Istana](/wiki/The_Istana). As prime minister, Lee also became chairman of the [People's Association](/wiki/People%27s_Association). In his maiden [National Day Rally](/wiki/Singapore_National_Day_rally) speech on 22 August 2004, Lee announced several new initiatives, among them the policy of the \"five-day work week\" which removed the half-working day on Saturday. The plan took effect on 1 January 2005. In response to public feedback, maternity leave was also extended from eight to twelve weeks after consultation with employers and unions. To encourage the growth of the birthrate in Singapore, the Baby Bonus scheme was expanded to provide financial support to women who bear a fourth child. In November 2004, Lee sparked a national debate when he proposed to build two [Integrated Resorts](/wiki/Integrated_resorts_in_Singapore) (IRs), or hotel-casinos. Despite the longstanding stance against gambling in Singapore, with the exception of regulated industries such as the [Singapore Turf Club](/wiki/Singapore_Turf_Club) and [Singapore Pools](/wiki/Singapore_Pools), the government was concerned its stance was hurting the economic competitiveness of the country, risking the loss of tourism revenue to other cities. In April 2005, despite some public opposition, the government approved the proposal. The IRs were built in [Marina Bay](/wiki/Marina_Bay,_Singapore) and [Sentosa](/wiki/Sentosa). To limit the negative social impact of [casino](/wiki/Casino) gambling, Lee suggested safeguards such as prohibiting minors from the casinos and charging an entrance fee for Singaporeans of [S$](/wiki/S$)100 (or S$2000 for a yearly pass). The Casino Control Act was enacted into law on 1 June 2006, which regulated the operations of the casino operators and provided social safeguards intended to deter problem gambling. In February 2006, Lee announced a S$2.6 billion *Progress Package* to distribute budget surpluses in the form of cash, top-ups to the [Central Provident Fund](/wiki/Central_Provident_Fund), rental and utilities rebates, and educational funds. The cash bonuses were distributed in early May 2006. As the announcement came three months before the [2006 Singaporean general election](/wiki/2006_Singaporean_general_election), it drew criticism that the ruling party was involved in \"vote buying\". ### 2006–2011: Second term In that election, the PAP won 82 of the 84 seats, including 37 walkovers. The [Ang Mo Kio GRC](/wiki/Ang_Mo_Kio_Group_Representation_Constituency) was contested for the first time in 15 years. The [Workers' Party](/wiki/Workers%27_Party_(Singapore)) (WP) claimed that they wanted to give Ang Mo Kio residents a chance to exercise their vote. Lee and his six-member GRC team won 66.14% of the votes against WP's team led by [Yaw Shin Leong](/wiki/Yaw_Shin_Leong). On 29 November 2007, Lee announced that he would relinquish his finance ministerial portfolio to [Tharman Shanmugaratnam](/wiki/Tharman_Shanmugaratnam) on 1 December of that year. The handover was largely supported by business analysts, who felt that the importance of the position necessitated the dedication of a full-time minister for Singapore to entrench and promote its role as a financial hub. Regional economist Song Seng Wun said that with the growing sophistication of the economy and the financial markets' increasing volatility, Lee \"may not have the full-time attention\" due to his concurrent duties as prime minister. #### Great Recession The economy grew for the first two years of Lee's tenure but plunged 12.5% during the [Great Recession](/wiki/Great_Recession). Singapore became the first Asian country to slip into a recession during the fourth quarter of 2008, with the financial, construction and manufacturing sectors being particularly affected by the [Great Recession](/wiki/Great_Recession); the downturn was attributed to the city's trade-dependent economy. To counteract the ailing economy, the government announced a S$2.8 billion stimulus fund in November 2008 for SMEs and local firms and further pledged a S$20.5 billion Resilience Package in January 2009. These measures were intended to keep the unemployment rate low, having risen to 2.6% in December 2008 and 3.3% by the end of Q2 2009. In August 2009, Lee declared that \"the worst [was] over\" and that Singapore was in a stronger position due to better-than-forecast growth in the manufacturing and services industries. The Ministry of Trade and Industry announced an end to the recession in November 2009 and forecast a 3–5% growth for 2010. Singapore subsequently saw a record-high economic recovery of 14.53%, defying predictions of moderate growth, with the unemployment rate falling to 1.8% by September 2010. #### Political reforms On 27 May 2009, Lee gave a speech in Parliament validating the roles of nonpartisan [Nominated members of parliament](/wiki/Nominated_Member_of_Parliament) (NMP) and praising the NMP scheme as having improved \"quality of debate\" in the-PAP dominated parliament. He proposed to make the scheme permanent. In May 2010, Lee instituted electoral reforms to the [electoral system](/wiki/Parliamentary_elections_in_Singapore) by reducing the number of [group representation constituencies](/wiki/Group_representation_constituency) (GRC) and increasing the number of [non-constituency members of parliament](/wiki/Non-constituency_Member_of_Parliament) (NCMP) and [nominated members of parliament](/wiki/Nominated_Member_of_Parliament) (NMP) to a maximum of nine each (inclusive of the number of elected opposition members). A [cooling-off day](/wiki/Election_silence) on the day before the election was instituted, where campaigning is prohibited except for party political broadcasts. ### 2011–2015: Third term In the [2011 Singapore general election](/wiki/2011_Singapore_general_election), the PAP saw a 6.46% swing downwards to 60.14%, its lowest since independence. The result, while a landslide victory for the PAP by international standards, was seen as a rebuke to the ruling party as a result of massive immigration of low-skilled workers, high-profile rail transport breakdowns and the rising cost of living in the intervening years. During the campaigning period, Lee has sensed the discontent in public sentiment and made a public apology. While the PAP swept into power, winning 81 out of 87 seats, it lost [Aljunied GRC](/wiki/Aljunied_Group_Representation_Constituency) to the [Workers' Party](/wiki/Workers%27_Party_(Singapore)) (WP) led by [Low Thia Khiang](/wiki/Low_Thia_Khiang), a historic win by an opposition party. Foreign Minister [George Yeo](/wiki/George_Yeo) and Minister in the Prime Minister's Office [Lim Hwee Hua](/wiki/Lim_Hwee_Hua) of the GRC were defeated. Following the election, Lee Kuan Yew and Goh Chok Tong resigned from the cabinet as part of a rejuvenation process in the government and to provide a clean slate for Lee. Lee was sworn in to a third term on 21 May 2011. On 1 June 2011, Lee was named chairman of the [Government of Singapore Investment Corporation](/wiki/GIC_(sovereign_wealth_fund)), which manages more than S$100 billion in assets. He succeeded his father, Lee Kuan Yew, who remained as senior advisor to the fund until his death. In 2012, Lee indicated that he hoped not to be prime minister beyond the age of seventy, noting the need for someone to be in tune with the public. ### 2015–2020: Fourth term In the [2015 Singapore general election](/wiki/2015_Singapore_general_election), Lee was re-elected in Ang Mo Kio GRC, with the PAP winning 83 of 89 seats in Parliament and 69.9% of the national vote. Lee's fourth term as prime minister was marked by events such as the [China–United States trade war](/wiki/China%E2%80%93United_States_trade_war), which adversely affected the nation's economy, being highly reliant on free markets and trade. Increased cyberattacks on Singapore-related services and websites led to the introduction of the Cybersecurity Act in 2018 and the establishment of the [Cyber Security Agency](/wiki/Cyber_Security_Agency_(Singapore)). The defeat of the [Barisan Nasional](/wiki/Barisan_Nasional) government in the [2018 Malaysian general election](/wiki/2018_Malaysian_general_election), which saw the return of [Mahathir Mohamad](/wiki/Mahathir_Mohamad) as prime minister, led to a chill in relations as the new [Pakatan Harapan](/wiki/Pakatan_Harapan) government sought to overturn previously signed agreements on the [Kuala Lumpur-Singapore high-speed rail](/wiki/Kuala_Lumpur-Singapore_high-speed_rail) and [Johor Bahru-Singapore Rapid Transit System](/wiki/Johor_Bahru-Singapore_Rapid_Transit_System), and also disputed with Singapore on airspace and maritime rights. As part of the Lee government's effort to promote Singapore as an international center for arbitration, the city hosted the leaders of Mainland China and Taiwan for the [Ma–Xi meeting](/wiki/2015_Ma%E2%80%93Xi_meeting) on 7 November 2015 and the [North Korea–United States summit](/wiki/2018_North_Korea%E2%80%93United_States_Singapore_Summit) on 12 June 2018. Singapore hosted the signing of the [Singapore Convention on Mediation](/wiki/Singapore_Convention_on_Mediation) on 7 August 2019, the first United Nations treaty named after it, and ratified it on 25 February 2020. On 20 July 2018, it was announced that sophisticated state-linked actors had [hacked](/wiki/2018_SingHealth_data_breach) Lee's health data along with that of 1.5 million other residents. The hack was intended to access Lee's data in particular. On 23 April 2019, Lee reshuffled his cabinet and promoted [Heng Swee Keat](/wiki/Heng_Swee_Keat) to [deputy prime minister](/wiki/Deputy_Prime_Minister_of_Singapore), effective 1 May 2019. As part of the party's leadership succession, the move was widely interpreted as a prelude to Heng succeeding Lee as Singapore's fourth prime minister after the next general election. Lee noted that the cabinet reshuffle \"was more extensive than usual\", with younger, fourth-generation ministers being prioritised and now heading two-thirds of the ministries. #### Planned GST hike to 9% Speaking at his party convention on 19 November 2017, Lee said that raising taxes was a necessity to fund investment in the social, healthcare, economic and infrastructure sectors. Annual expenses on preschools is expected to reach $1.7 billion by 2022, while the growth in the [ageing population](/wiki/Ageing_population) is predicted to create a larger demand for affordable healthcare. Construction and refurbishment of new port and rail infrastructure, coupled with economic restructuring and training of workers, also necessitated tax increases. The taxes raised would be in the form of the [GST](/wiki/Goods_and_Services_Tax_(Singapore)), which is expected to rise from 7% to 9% by 2025. Lee's government said that it was necessary to plan ahead for increasing annual recurrent expenses, with Heng Swee Keat saying that the \"hike cannot be put off or scrapped\" to pay for critical future needs, especially in the healthcare sector. In his Budget 2020 speech in February, Heng announced amendments to the GST Voucher Fund Act that would allow grants-in-aid to be given to parents or guardians for infants and children to mitigate their expenses. Second Minister for Finance [Lawrence Wong](/wiki/Lawrence_Wong) said the intent was to expand the range of people who qualify for the fund. With the amendment, the Act would allow for the funding of the $6 billion Assurance Package, which was intended to delay the impact of the impending hike for five years. The proposed hike met with broad disapproval from the opposition, with the Workers' Party and Progress Singapore Party calling for the GST to be retained at its present rate of 7% and others calling for the GST to be suspended entirely or for the exemption of essential goods from the tax. #### POFMA implementation Lee's government introduced the [Protection from Online Falsehoods and Manipulation Act](/wiki/Protection_from_Online_Falsehoods_and_Manipulation_Act) (POFMA) in 2018, colloquially known as the \"fake news law\", which was first mooted by Minister of Law and Home Affairs [K Shanmugam](/wiki/K_Shanmugam). Despite concerns by activists and opposition Members of Parliament that the Act would limit free speech under the guise of preventing disinformation, the bill passed by a 72–9 vote on 8 May 2019 after two days' debate. [Reporters Without Borders](/wiki/Reporters_Without_Borders) called the bill \"terrible\", \"totalitarian\", and a tool for censorship. [Reuters](/wiki/Reuters) wrote that the act \"ensnares\" government critics. Social media firms like Facebook expressed concern that the law would grant \"broad powers to the Singapore executive branch to compel us to remove content they deem to be false and pro-actively push a government notification to users\". In the leadup to the 2020 general election, Lee's own brother [Lee Hsien Yang](/wiki/Lee_Hsien_Yang) accused him of reneging on promises made in his 2004 [National Day Rally](/wiki/National_Day_Rally) speech about promising increased civil liberties and the freedom to express diverse views without interference. Lee and his ministers actively rebutted allegations by overseas media that POFMA is a tool for censorship, saying that \"no information or view has been suppressed\" as a result of the Act and that the government \"has not restricted free debate\". In an interview with *The Straits Times*, Lee noted that fake news could disrupt society, and that the United States and Europe were struggling to manage the situation, especially in light of alleged [Russian interference in recent elections](/wiki/Russian_interference_in_the_2016_United_States_elections). He cited Germany as a country that [has enacted a similar law](/wiki/Network_Enforcement_Act). In response to concerns that POFMA could curb free speech, Lee said that free speech exists within appropriate boundaries, with no society having absolute freedom of speech, and that defamatory or threatening speech should be banned to facilitate meaningful exchange of information and ideals. #### Response to COVID-19 pandemic The first [COVID-19 case in Singapore](/wiki/COVID-19_pandemic_in_Singapore) was confirmed on 23 January 2020. Early cases were primarily imported until local transmission began to develop. By late March, clusters were detected at multiple dormitories for foreign workers, which soon contributed to an overwhelming number of new cases in the country. In response, Lee announced on 3 April 2020 that Singapore would enter a limited [lockdown](/wiki/Lockdown) with restrictions on movement. The policy, officially called \"[circuit breaker](/wiki/2020_Singapore_circuit_breaker_measures)\" in governmental parlance, was intended to halt the disease's spread in the wider community. Workplaces were shut and all schools switched to home-based learning from 7 April to 1 June. Lee served as advisor to a multi-ministry level task force that had been set up in January, chaired by Minister for Education [Lawrence Wong](/wiki/Lawrence_Wong) and Minister for Health [Gan Kim Yong](/wiki/Gan_Kim_Yong). Lee's government also contributed US$500,000 to support the [World Health Organization](/wiki/World_Health_Organization). With the pandemic pushing Singapore into a recession, the government unveiled four successive stimulus packages intended to keep the economy afloat, the *Unity*, *Resilience*, *Solidarity* and *Fortitude* budgets. ### 2020–2024: Fifth term Following the [2020 Singapore general election](/wiki/2020_Singapore_general_election), Lee was re-elected in Ang Mo Kio GRC, with the PAP securing 61.23% of the national vote, beginning his fifth successive term as prime minister. The election was widely seen as a setback for the ruling party, with the opposition Workers' Party capturing a second GRC. While noting that voters had delivered a clear mandate, Lee wrote in a letter to the party (\"rules of prudence\") that with the official appointment of a leader of the opposition to reflect ground sentiments for alternative ideals, PAP MPs should expect more vigorous debates and probing questions in Parliament. He encouraged party MPs to express their views honestly on proposed policies regardless of their party affiliation, while instructing them to defend their convictions and engage the opposition constructively. As a recognition of the Workers' Party's performance in the election and acknowledgement of society's desire for alternative ideas and more robust debate, Lee appointed [Pritam Singh](/wiki/Pritam_Singh_(Singaporean_politician)) as the first official [Leader of the Opposition](/wiki/Leader_of_the_Opposition_(Singapore)). Following the election, Lee announced a delay to his planned retirement in 2022 at his 70th birthday, given the demands of the COVID-19 pandemic. Lee attended the [Pacific Alliance](/wiki/Pacific_Alliance) summit on 11 December 2020 following three years of negotiations with the Latin American trade bloc on the Pacific Alliance-Singapore free trade agreement (PASFTA), with the PASFTA due to be signed in 2021. In 2022, his government strongly opposed [Russia](/wiki/Russia)'s [invasion of Ukraine](/wiki/2022_Russian_invasion_of_Ukraine) due to concerns of the territorial integrity of smaller nations around the world – the only country in Southeast Asia to openly condemn and sanction the Eurasian country. On 21 August 2022, Lee announced during his annual [National Day Rally](/wiki/National_Day_Rally) as prime minister that his government intends to repeal the colonial-era [of the Penal Code (Singapore)|Section 377A of the Penal Code](/wiki/Section_377A_(Singapore)), an [unenforced law](/wiki/Unenforced_law) that criminalised sex between consenting male adults, effectively ending criminalisation both *[de facto](/wiki/De_facto)* and *[de jure](/wiki/De_jure)*. The announcement was celebrated by the [LGBT community in Singapore](/wiki/LGBT_rights_in_Singapore), while adding that this will be the \"first step on a long road towards full equality\". During the 2023 National Day Rally speech, Lee indicated a resumption of his succession plan, indicating [Lawrence Wong](/wiki/Lawrence_Wong) as his likely successor as prime minister. On 5 November 2023, Lee announced that he would hand over the role of prime minister role to [Lawrence Wong](/wiki/Lawrence_Wong) by November 2024, before the next General Election which is due by November 2025. The handover ultimately occurred on 15 May 2024. He remains the Secretary-General of the PAP after the handover until the next PAP [Central Executive Committee](/wiki/Central_Executive_Committee_(PAP)) (CEC) meeting. ## Senior Minister (2024–present) Lee tendered his resignation as prime minister alongside his cabinet to President [Tharman Shanmugaratnam](/wiki/Tharman_Shanmugaratnam) on 13 May 2024, with effect from 15 May 2024. Lee was subsequently appointed as senior minister by Lee's successor [Lawrence Wong](/wiki/Lawrence_Wong) in his new [cabinet](/wiki/Lawrence_Wong_Cabinet) while remaining as the chairman of the Research, Innovation and Enterprise Council (RIEC) on 15 May 2024. ## Foreign policy ### China The Lee government's policy towards the [People's Republic of China](/wiki/China) has been marked by extensive cooperation in government-to-government projects such as the [Suzhou Industrial Park](/wiki/China-Singapore_Suzhou_Industrial_Park), [Tianjin Eco-City](/wiki/Tianjin_Eco-City) and Chongqing Connectivity Initiative. The China-Singapore Free Trade Agreement, the first of any Asian country with China, came into effect in 2009 and was upgraded in 2018, with new regulations governing e-commerce, [fair competition](/wiki/Fair_competition) and the environment; Singaporean firms were also granted greater access to Chinese markets, including the legal sector, which has been denied to other nations. Under Lee's government, Singapore has been the largest investor in China's [Belt and Road](/wiki/Belt_and_Road) Initiative and one of its earliest proponents, having signed a memorandum of understanding in April 2018. In April 2019, it agreed to further cooperation in trade and law enforcement, with Trade and Industry Minister [Chan Chun Sing](/wiki/Chan_Chun_Sing) and Shanghai Mayor Ying Yong formalising plans on the formation of the Singapore-Shanghai Comprehensive Cooperation Council, which will be managed on the ministerial level. China has been Singapore's largest trading partner since 2013, with trade reaching US$137.1 billion in 2017. Bilateral relations between the two nations under Lee and the [Hu Jintao](/wiki/Hu_Jintao) and [Xi Jinping](/wiki/Xi_Jinping) administrations have been called strong. Lee's government formally adheres to the [One-China policy](/wiki/One-China_policy), most recently reiterating the principle governing its relations with [Taiwan](/wiki/Taiwan) in January 2020, despite the pro-independence [Tsai Ing-wen](/wiki/Tsai_Ing-wen) administration's refusal to recognise the [1992 consensus](/wiki/1992_consensus). In spite of Chinese pressure and repeated offers of [Hainan](/wiki/Hainan) as an alternative site, Singapore continues to regularly send troops to train in Taiwan under *Project Starlight* and expects Beijing to respect its right to do so. Relations between the two nations cooled in 2016 after Singapore expressed its support on the ruling of the [South China Sea arbitration case](/wiki/Philippines_v._China) by the [Permanent Court of Arbitration](/wiki/Permanent_Court_of_Arbitration) between China and the Philippines, which had dismissed Chinese claims to \"historical rights\" to the sea; Singapore views the surrounding seas as its lifeline and is sensitive to any attempts at hegemony. On 23 November 2016, the [Customs and Excise Department](/wiki/Customs_and_Excise_Department_(Hong_Kong)) of [Hong Kong](/wiki/Hong_Kong) seized nine [Singapore Armed Forces](/wiki/Singapore_Armed_Forces) military vehicles at the [Port of Hong Kong](/wiki/Port_of_Hong_Kong), which had been en route from Taiwan to Singapore after a military training exercise, in what became known as the \"Terrex incident\". Both sides downplayed the incident and official responses were described as \"relatively muted\", but international and local observers widely interpreted the seizure as a warning to Singapore. The detained vehicles were eventually released in January 2017 after it was officially deemed a customs import violation. Singapore has since sought to improve its relations with China, signing a defence agreement in October 2019 to enlarge military exercises with the [People's Liberation Army](/wiki/People%27s_Liberation_Army), provide mutual logistics support, and increase exchanges between the two armed forces. ### United States Singapore has a close defence and political relationship with the United States and is one of its strongest bilateral partners in Southeast Asia. The US is an important arms supplier to Singapore, with US$7.34 billion in active sales under the [Foreign Military Sales](/wiki/Foreign_Military_Sales) system as of 2020. Singapore has traditionally viewed the US as a critical guarantor of stability and security in the Asia-Pacific region and Lee's government has continued that policy, emphasising the US's role as an important counterweight to the [rise of China](/wiki/Rise_of_China) and its increasing military prowess. The two nations have a defence pact dating to the 1990 [memorandum of understanding](/wiki/Memorandum_of_understanding) (MoU), which allowed US access to Singapore's air and naval bases and established the [Logistics Group Western Pacific](/wiki/Task_Force_73) at Sembawang Terminal. On 12 July 2005, Lee and President [George W. Bush](/wiki/George_W_Bush) signed the Strategic Framework Agreement (SFA), which recognised Singapore as a \"Major Security Cooperation Partner\". The two nations agreed to address the threats of terrorism and the proliferation of [weapons of mass destruction](/wiki/Weapons_of_mass_destruction), while also furthering defence and security cooperation. Under the [Barack Obama](/wiki/Barack_Obama) administration's [Pivot to Asia](/wiki/Pivot_to_Asia) strategy, the United States Navy has completed multiple [littoral combat ship](/wiki/Littoral_combat_ship) deployments to Singapore since 2014. In December 2015, the SFA was upgraded when Defence Minister [Ng Eng Hen](/wiki/Ng_Eng_Hen) and Secretary of Defense [Ashton Carter](/wiki/Ashton_Carter) signed the Defence Cooperation Agreement, which expanded cooperation to humanitarian assistance and disaster relief, cyber defence, biosecurity and public communications. US [P-8A Poseidon](/wiki/P-8A_Poseidon) surveillance planes were also based in Singapore for the first time, which analysts said was a response to China's actions in the South China Sea, with Lee reiterating Singapore's commitment to \"defend the rights of freedom of navigation and overflight\". In support of the US military intervention against [ISIS](/wiki/ISIS), the [Republic of Singapore Air Force](/wiki/Republic_of_Singapore_Air_Force) has also contributed aerial refuelling and logistical support to [Operation Inherent Resolve](/wiki/Operation_Inherent_Resolve). In September 2019, a year before the 1990 MoU's expiry, Lee and the [Donald Trump](/wiki/Donald_Trump) administration renewed it for another 15 years. The United States is Singapore's largest foreign investor, with US$15 billion invested in 2017 and stock reaching US$274.3 billion. The [Singapore-United States Free Trade Agreement](/wiki/Singapore-United_States_Free_Trade_Agreement) was implemented in January 2004, with trade reaching $45 billion in 2016. Lee was one of the early drafters and a strong advocate of the [Trans-Pacific Partnership](/wiki/Trans-Pacific_Partnership), which was intended to lower both [non-tariff](/wiki/Non-tariff_barriers_to_trade) and tariff [barriers to trade](/wiki/Trade_barriers) and establish an [investor-state dispute settlement](/wiki/Investor-state_dispute_settlement) (ISDS) mechanism, and on many occasions urged the [U.S. Congress](/wiki/U.S._Congress) to ratify the deal as soon as possible, adding that not to do so would \"affect U.S. standing and credibility\" in the world. [Fitch](/wiki/Fitch_Ratings) analyst Andrew Colquhoun said that membership in the pact would have given Singapore an advantage over Hong Kong's close links to China. As a country dependent on free trade, it was \"vital\" that Singapore retain a seat at the negotiating table. The agreement was ultimately not ratified after Trump became president in 2017 and pulled the US out of the pact. ### Malaysia Malaysia has had [six prime ministers](/wiki/Prime_Minister_of_Malaysia) and four changes of government since Lee became prime minister in 2004. Lee has sought to improve relations with Malaysia after decades of acrimony by enhancing the countries' economic integration and infrastructural links. Since 2010, Lee has attended the annual Leaders' Retreat set for the two countries' leaders to discuss issues and enhance the dispute resolution mechanism. But bilateral relations remain complex and fraught with occasional disputes involving [water supply](/wiki/Water_conflicts_between_Malaysia_and_Singapore), [land reclamation](/wiki/Land_reclamation_in_Singapore), and airspace and maritime territorial claims. To avoid harming the relationship, efforts have been made to isolate unresolved disputes from cross-border cooperation tackling [transnational crime](/wiki/Transnational_crime), terrorism and drug trafficking; this has resulted in close collaboration between Singapore's and Malaysia's police and security agencies. In May 2007, Lee agreed with [Abdullah Badawi](/wiki/Abdullah_Badawi)'s government to invest in the [Iskandar Malaysia](/wiki/Iskandar_Malaysia) project and assist in building a tourism and industrial zone; the project was seen as a complement to the Singaporean economy and a strategy for Singapore to expand economically into its immediate hinterland, with RM20.57 billion invested as of 2019. In September 2010, Lee and Prime Minister [Najib Razak](/wiki/Najib_Razak) resolved the longstanding [KTM railway land dispute](/wiki/Malaysia%E2%80%93Singapore_Points_of_Agreement_of_1990#Agreement_reached), with Malaysia agreeing to vacate a railway line cutting through the island to [Tanjong Pagar railway station](/wiki/Tanjong_Pagar_railway_station) in exchange for land parcels in the [Central Business District](/wiki/Central_Area,_Singapore) and [Marina South](/wiki/Marina_South), to be managed jointly. With the expiration of the 1961 Water Agreement in August 2011, Singapore handed the Skudai and Gunung Pulai water treatment plants over to the [Johor state government](/wiki/Johor#Government), marking the end of one of two water agreements. To ease congestion on the [Johor–Singapore Causeway](/wiki/Johor%E2%80%93Singapore_Causeway), which links the two countries, Lee revived a dormant 1991 plan to link the [Singapore MRT](/wiki/Singapore_MRT) network to [Johor Bahru](/wiki/Johor_Bahru) in 2011. During this period, Malaysia also reinstated a plan to connect [Kuala Lumpur](/wiki/Kuala_Lumpur) to Singapore via a [high-speed rail](/wiki/High_speed_rail) network. After joint preliminary technical studies on both rail projects, it was agreed to proceed with the [Kuala Lumpur–Singapore high-speed rail](/wiki/Kuala_Lumpur%E2%80%93Singapore_high-speed_rail) (KL-SG HSR) in February 2013 and the [Johor Bahru-Singapore Rapid Transit System](/wiki/Johor_Bahru-Singapore_Rapid_Transit_System) (JB-SG RTS) in December 2016. After the [2018 Malaysian general election](/wiki/2018_Malaysian_general_election) and the fall of the [Barisan Nasional](/wiki/Barisan_Nasional) government, the [Mahathir Mohamad](/wiki/Mahathir_Mohamad) government repeatedly delayed the rail projects, citing their high cost and its financial indebtedness. Lee reiterated the legally binding nature of the joint projects, which stipulated compensation to Singapore in the event of a cancellation, but nevertheless acceded to Malaysia's request for an extension to conduct a review. In October 2018, tensions rose when Malaysia extended its Johor Bahru port limits past its 1979 maritime claims into undelimited waters off Singapore's reclaimed Tuas sector. The maritime dispute occurred in conjunction with the Pasir Gudang airspace dispute, which began in early December; the airspace is under Malaysian sovereignty but was previously delegated to Singapore to manage in a 1973 agreement. In April 2019, Transport Minister [Khaw Boon Wan](/wiki/Khaw_Boon_Wan) and his counterpart [Anthony Loke](/wiki/Anthony_Loke) reached a joint agreement to revert to the previous status quo on both disputes. The [2020 Malaysian political crisis](/wiki/2020_Malaysian_political_crisis) resulted in the [Pakatan Harapan](/wiki/Pakatan_Harapan) government's collapse and the appointment of [Muhyiddin Yassin](/wiki/Muhyiddin_Yassin) as prime minister. Singapore has since worked closely with Malaysia to combat the ongoing [COVID-19 pandemic](/wiki/COVID-19_pandemic). In July 2020, Lee and Muhyiddin formally agreed to recommence the JB-SG RTS project in a signing ceremony on the causeway. On 6 May 2022, Lee alongside his wife visited the [Malaysian state of Johor](/wiki/State_of_Johor) and attended a Johor state award investiture ceremony at the invitation of the [Sultan of Johor](/wiki/Sultan_of_Johor). Lee was appointed Grand Commander of the [Order of the Crown of Johor](/wiki/Order_of_the_Crown_of_Johor) (First Class), the highest honour awarded in the State of Johor while his wife was appointed Grand Commander of the [Order of Sultan Ibrahim of Johor](/wiki/Order_of_Sultan_Ibrahim_of_Johor), being the first Singaporean to be appointed to this order at this class. Lee made another visit to Johor alongside his cabinet ministers on 11 January 2024 to attend a commemorative ceremony for the [Johor Bahru-Singapore Rapid Transit System](/wiki/Johor_Bahru-Singapore_Rapid_Transit_System) (RTS) Link project and witnessed the signing of a memorandum of understanding on the [Johor-Singapore Special Economic Zone](/wiki/Johor-Singapore_Special_Economic_Zone) (JS-SEZ). ## Controversies ### Condominium rebates In 1996, while serving as deputy prime minister, Lee and his father [Senior Minister](/wiki/Senior_Minister_of_Singapore) [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) addressed Parliament on the allegations of receiving special discounts on four luxury condominium units that they had purchased from Hotel Properties Limited (HPL) on the properties of Nassim Jade and Scotts 28 in 1994 and 1995 respectively. Lee Kuan Yew's brother Lee Suan Yew was the director of HPL, leading to the controversy. Prime Minister [Goh Chok Tong](/wiki/Goh_Chok_Tong) ordered an immediate investigation into the matter, since although the provision of special discounts or rebates to relatives and associates of directors is permitted under Singapore law, shareholders must approve such transactions. ### Ministerial salary Lee's salary has been a source of public discontent. From 2008 to 2012, Lee received an annual salary of S$3,870,000 (US$2,856,930), an increase of 25% from the previous S$3,091,200 (US$2,037,168). In January 2012, due to public discontent, Lee took a 28% pay cut, reducing his salary to S$2.2 million (US$1.7 million). He remained the [highest-paid head of government in the world](/wiki/List_of_salaries_of_heads_of_state_and_government) until his resignation as prime minister in 2024. ### Allegations of nepotism In 2010, Lee, together with his predecessors, threatened legal action against [The New York Times Company](/wiki/The_New_York_Times_Company), which owns the *[International Herald Tribune](/wiki/International_Herald_Tribune),* regarding an op-ed piece titled \"All in the Family\" of 15 February 2010 by [Philip Bowring](/wiki/Philip_Bowring), a freelance columnist and former editor of the *[Far Eastern Economic Review](/wiki/Far_Eastern_Economic_Review)*. The *International Herald Tribune* apologised in March that readers of the article may \"infer that the younger Lee did not achieve his position through merit\". The New York Times Company and Bowring agreed to pay S$60,000 to Lee, S$50,000 to Lee Kuan Yew and S$50,000 to Goh (amounting to about US$114,000 at the time), in addition to legal costs. The case stemmed from a 1994 settlement between the three Singaporean leaders and the paper about an article also by Bowring that referred to 'dynastic politics' in East Asian countries, including Singapore. In that settlement, Bowring agreed not to say or imply that the younger Lee had attained his position through nepotism. In response, media rights watchdog [Reporters Without Borders](/wiki/Reporters_Without_Borders) wrote an open letter urging Lee and other top Singapore government officials to stop taking \"libel actions\" against journalists. Legal action had been taken in the Singapore courts for defamation against the *[Financial Times](/wiki/Financial_Times)* (2007) and the [New York Times Company](/wiki/New_York_Times_Company). In a 2008 report, the International Bar Association Human Rights Institute cast doubts on the independence of the judiciary in cases involving PAP litigants or interests. As the eldest son of Lee Kuan Yew, Lee's career has been shadowed by allegations of [nepotism](/wiki/Nepotism). He was widely tipped to be prime minister with several critics viewing Goh Chok Tong as a seat-warmer. Lee has challenged his critics to prove their allegations of nepotism or put the matter to rest. ### Oxley Road house dispute In June 2017, Lee became embroiled in a dispute with his brother [Lee Hsien Yang](/wiki/Lee_Hsien_Yang) and sister [Lee Wei Ling](/wiki/Lee_Wei_Ling), over the fate of their father's house at [38 Oxley Road](/wiki/38_Oxley_Road). Founding prime minister Lee Kuan Yew was averse to a [cult of personality](/wiki/Cult_of_personality). As a result, he had inserted in his final will a demolition clause stating that the house was to be torn down when his daughter moves out; it also states that should demolition be impossible, the house shall be closed to the public. Lee's siblings alleged that he was abusing his powers, using \"organs of the state\" as prime minister to preserve the house against their father's wishes. Lee and the [Cabinet](/wiki/Cabinet_of_Singapore) denied all their allegations and convened a special sitting of [Parliament](/wiki/Parliament_of_Singapore) to debate the matter thoroughly. In his closing speech, Lee stated: \"After two days of debate, nobody has stood behind these [his siblings'] allegations or offered any evidence, not even opposition MPs ... It shows that the Government and I have acted properly and with due process.\" He left open options to convene a select committee or Commission of Inquiry should substantive evidence be presented. The siblings accepted Lee's offer to settle the dispute in private the following day. On 1 September 2019, Lee sent a letter, via the Prime Minister Office, to journalist Terry Xu of [The Online Citizen](/wiki/The_Online_Citizen) (TOC) requesting that Xu take down a TOC article with false allegations. On 5 September, Lee sued Xu for repeating statements made by Lee's siblings. By doing so, Lee attracted critics for using the prime minister's office for personal matters. ### 1MDB defamation case In December 2018, Lee sued Leong Sze Hian, a prominent government critic, for sharing an online article on his Facebook page alleging that former Malaysian prime minister [Najib Razak](/wiki/Najib_Razak) had signed \"secret deals\" with Lee to secure help from Singaporean banks to facilitate money laundering from Malaysia's government-run strategic development company [1Malaysia Development Berhad](/wiki/1Malaysia_Development_Berhad), in what became known as the [1MDB scandal](/wiki/1Malaysia_Development_Berhad_scandal). Lee's lawyers claimed that Lee had been \"gravely injured in his character and reputation\" and \"brought into public scandal, odium and contempt\". Leong removed the post thereafter but justified his actions by claiming that it was \"a matter of public interest... whether or not it was correct\" and filed a countersuit against Lee, claiming that the lawsuit proceedings against him were \"an abuse of the process of the court\". The Court of Appeal dismissed the countersuit in September 2019, citing that Singapore law does not recognise the concept of the abuse of court process. In October 2020, Lee took the stand in a four-day trial in the [High Court](/wiki/High_Court_of_Singapore) against Leong, who was defended by lawyer [Lim Tean](/wiki/Lim_Tean), secretary-general of the opposition party [Peoples Voice](/wiki/Peoples_Voice_(Singapore)). In an opening statement, Lee's lawyer Davinder Singh said that 1MDB had become \"a byword for corruption and criminal activity\" and that Leong's sharing the post might have implied that \"Lee was complicit in criminal activity relating to 1MDB\". Lee claimed that he was compelled to file the suit because not to do so would have raised questions, given his history of filing lawsuits against defamatory statements. Leong did not take the witness stand, with Lim arguing that it was unnecessary for Leong to give evidence, and that it was Lee's responsibility to prove that Leong's actions were malicious and had damaged Lee's reputation. The case was adjourned to November 2020. Leong was found guilty in March 2021 of defamation and ordered to pay damages to Lee. ## Personal life Lee married his first wife, Wong Ming Yang, a Malaysian-born physician, on 20 May 1978. They have a daughter and a son, Li Xiuqi, born in 1981, and Li Yipeng, born in 1982. Three weeks after giving birth to their son, Wong died of a heart attack on 28 October 1982, at the age of 31. In 1985, Lee remarried to [Ho Ching](/wiki/Ho_Ching), a [President's Scholar](/wiki/President%27s_Scholar) and civil servant who subsequently became the executive director and chief executive officer of [Temasek Holdings](/wiki/Temasek_Holdings). They have two sons, Li Hongyi and Li Haoyi. Their elder son, Li Hongyi, was a commissioned officer in the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces) (SAF), and is the deputy director of the [Government Technology Agency](/wiki/Government_Technology_Agency). Their younger son, Li Haoyi, is a software engineer who authors books on the [Scala](/wiki/Scala_(programming_language)) programming language. Lee was initially diagnosed with [lymphoma](/wiki/Lymphoma), for which he underwent [chemotherapy](/wiki/Chemotherapy) in the early 1990s. He subsequently underwent a successful robot-assisted keyhole [prostatectomy](/wiki/Prostatectomy) on 15 February 2015 after being diagnosed with [prostate cancer](/wiki/Prostate_cancer). Lee is interested in computer programming and has written a [Sudoku](/wiki/Sudoku) solver in [C++](/wiki/C%2B%2B) in his spare time. ## Honours and awards ### National honours - [Singapore](/wiki/Singapore) : - [Pingat Pentadbiran Awam, Emas (Tentera)](/wiki/Pingat_Pentadbiran_Awam_(Tentera)) (Public Administration Medal, Gold (Military)) - [Singapore Armed Forces Long Service and Good Conduct (10 Years) Medal](/wiki/Singapore_Armed_Forces_Long_Service_and_Good_Conduct_(10_Years)_Medal) - [Singapore Armed Forces Good Service Medal](/wiki/Singapore_Armed_Forces_Good_Service_Medal) ### Foreign honours - [Australia](/wiki/Australia) : - Honorary Companion of the [Order of Australia](/wiki/Order_of_Australia), awarded 6 August 2025. - [Brunei](/wiki/Brunei) : - [Sultan of Brunei Golden Jubilee Medal](/wiki/50th_Anniversary_Celebrations_of_Sultan_Hassanal_Bolkiah%27s_Accession_to_the_Throne_of_Brunei), awarded 6 October 2017. - [Family Order of Laila Utama](/wiki/Family_Order_of_Laila_Utama) (DK), bestowed 16 July 2022. - [Japan](/wiki/Japan) : - Grand Cordon of the [Order of the Rising Sun](/wiki/Order_of_the_Rising_Sun), bestowed 29 April 2025. - [Malaysia](/wiki/Malaysia) : - Knight Grand Commander of the [Order of the Crown of Johor](/wiki/Order_of_the_Crown_of_Johor) (First Class) – Dato' Sri Paduka Mahkota Johor (SPMJ), bestowed 6 May 2022. - [Peru](/wiki/Peru) : - Orden El Sol del Perú en el grado de Gran Cruz con Brillantes ([Order of the Sun of Peru](/wiki/Order_of_the_Sun_of_Peru) Grand Cross with Diamonds), bestowed 22 November 2008. ### Awards - [International Olympic Committee](/wiki/International_Olympic_Committee) : - [Olympic Order](/wiki/Olympic_Order) (Gold), conferred 13 August 2010. - [Government of Singapore](/wiki/Government_of_Singapore) - [Politics of Singapore](/wiki/Politics_of_Singapore) - *[Mee siam mai hum](/wiki/Mee_siam_mai_hum)* ## Notes ### Citations ### Bibliography Library resources about **Lee Hsien Loong** - Resources in your library - Resources in other libraries **By Lee Hsien Loong** - Resources in your library - Resources in other libraries - Lee Hsien Loong on Singapore Prime Minister's Office - Lee Hsien Loong on [Parliament of Singapore](/wiki/Parliament_of_Singapore) - Appearances on [C-SPAN](/wiki/C-SPAN) [Parliament of Singapore](/wiki/Parliament_of_Singapore)**New constituency** **Member of Parliament for [Teck Ghee SMC](/wiki/Teck_Ghee_Single_Member_Constituency)** 1984–1991**Constituency abolished** **Member of Parliament for [Ang Mo Kio GRC](/wiki/Ang_Mo_Kio_Group_Representation_Constituency)** 1991–present Served alongside: **(1991 - 1997): [Yeo Toon Chia](/wiki/Yeo_Toon_Chia), Umar Abdul Hamid, Lau Ping Sum (1997 - 2001): [Tang Guan Seng](/wiki/Tang_Guan_Seng), [Inderjit Singh](/wiki/Inderjit_Singh_(Singaporean_politician)), Tan Boon Wan, [Seng Han Thong](/wiki/Seng_Han_Thong) (2001- 2006): [Balaji Sadasivan](/wiki/Balaji_Sadasivan), Inderjit Singh, [Wee Siew Kim](/wiki/Wee_Siew_Kim), Tan Boon Wan, Seng Han Thong (2006- 2011): Balaji Sadasivan, Inderjit Singh, Wee Siew Kim, [Lee Bee Wah](/wiki/Lee_Bee_Wah), [Lam Pin Min](/wiki/Lam_Pin_Min) (2011- 2015): [Yeo Guat Kwang](/wiki/Yeo_Guat_Kwang), [Ang Hin Kee](/wiki/Ang_Hin_Kee), Inderjit Singh, [Intan Azura Mokhtar](/wiki/Intan_Azura_Mokhtar), Seng Han Thong (2015 - 2020): Darryl David, Ang Hin Kee, Intan Azura Mokhtar, [Gan Thiam Poh](/wiki/Gan_Thiam_Poh), [Koh Poh Koon](/wiki/Koh_Poh_Koon) (2020 - 2025): Darryl David, [Nadia Ahmad Samdin](/wiki/Nadia_Ahmad_Samdin), [Ng Ling Ling](/wiki/Ng_Ling_Ling), [Gan Thiam Poh](/wiki/Gan_Thiam_Poh) (2025 - present): Darryl David, Nadia Ahmad Samdin, [Jasmin Lau](/wiki/Jasmin_Lau), [Victor Lye](/wiki/Victor_Lye)****Incumbent**Political officesPreceded by[Tony Tan](/wiki/Tony_Tan) **[Minister for Trade and Industry](/wiki/Ministry_of_Trade_and_Industry_(Singapore))** 1986–1992Succeeded by[S. Dhanabalan](/wiki/S._Dhanabalan)Preceded by[Goh Chok Tong](/wiki/Goh_Chok_Tong) **[Deputy Prime Minister of Singapore](/wiki/Deputy_Prime_Minister_of_Singapore)** 1990–2004 Served alongside: **[Goh Chok Tong](/wiki/Goh_Chok_Tong), [Shunmugam Jayakumar](/wiki/S._Jayakumar_(Singaporean_politician))**Succeeded by[Tony Tan](/wiki/Tony_Tan)Preceded by[Richard Hu](/wiki/Richard_Hu) **[Minister for Finance](/wiki/Minister_for_Finance_(Singapore))** 2001–2007Succeeded by[Tharman Shanmugaratnam](/wiki/Tharman_Shanmugaratnam)Preceded by[Goh Chok Tong](/wiki/Goh_Chok_Tong) **[Prime Minister of Singapore](/wiki/Prime_Minister_of_Singapore)** 2004–2024Succeeded by[Lawrence Wong](/wiki/Lawrence_Wong)**Vacant**Title last held by**[Tharman Shanmugaratnam](/wiki/Tharman_Shanmugaratnam) 2023** **[Senior Minister of Singapore](/wiki/Senior_Minister_of_Singapore)** 2025–present Served alongside: **[Teo Chee Hean](/wiki/Teo_Chee_Hean) (2024–2025)****Incumbent**Party political officesPreceded by[Goh Chok Tong](/wiki/Goh_Chok_Tong) **Secretary General of the [People's Action Party](/wiki/People%27s_Action_Party)** 2004–2024Succeeded by[Lawrence Wong](/wiki/Lawrence_Wong)Positions in intergovernmental organisationsPreceded by[Gloria Macapagal Arroyo](/wiki/Gloria_Macapagal_Arroyo) **Chair of the [ASEAN](/wiki/Association_of_Southeast_Asian_Nations)** 2007Succeeded by[Abhisit Vejjajiva](/wiki/Abhisit_Vejjajiva)Preceded by[Rodrigo Duterte](/wiki/Rodrigo_Duterte) **Chair of the [ASEAN](/wiki/Association_of_Southeast_Asian_Nations)** 2018Succeeded by[Prayut Chan-o-cha](/wiki/Prayut_Chan-o-cha)Preceded by[Alan García](/wiki/Alan_Garc%C3%ADa) **Chair of the [APEC](/wiki/Asia-Pacific_Economic_Cooperation)** 2009Succeeded by[Naoto Kan](/wiki/Naoto_Kan)Portals: - Biography - Politics - Singapore **Lee Hsien Loong** at Wikipedia's sister projects: - **Media** from Commons - **News** from Wikinews - **Quotations** from Wikiquote - **Texts** from Wikisource - **Data** from Wikidata\n",
  "language": "en",
  "processed_at": "2026-01-12T10:05:31.081148",
  "title": "Lee Hsien Loong",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Controversies_surrounding_Lee_Hsien_Loong"
}