{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:20:48.249319"
  },
  "content": "Singaporean landscape painter **Lee Boon Wang** (1 January 1934 – 30 October 2016) was a Chinese-born Singaporean landscape painter, best known for his riverside and seaside paintings. Many of his paintings are exhibited at the [National Gallery Singapore](/wiki/National_Gallery_Singapore). ## Early life Lee Boon Wang was born on 1 January 1934 in [Guangdong](/wiki/Guangdong), China. He emigrated to Singapore with his family as a child. He had a brother, [Lee Boon Yang](/wiki/Lee_Boon_Yang), who became a businessman and politician, and a sister, Lee Boon Ngan, who married the painter [Chua Mia Tee](/wiki/Chua_Mia_Tee). Boon Wang graduated from the [Nanyang Academy of Fine Arts](/wiki/Nanyang_Academy_of_Fine_Arts) in 1953. ## Career Boon Wang began his career by teaching at his alma mater, the Nanyang Academy of Fine Arts. He subsequently worked in advertising, first for [S. H. Benson](/wiki/S._H._Benson) and later for [Leo Burnett Worldwide](/wiki/Leo_Burnett_Worldwide). By the 1970s, he became a full-time landscape painter. He painted many scenes by the river and the sea. Many of his paintings were acquired by the National Gallery Singapore. It was also exhibited at the [Ngee Ann Cultural Centre](/wiki/Ngee_Ann_Cultural_Centre) and the [Empress Place Museum Gallery](/wiki/Empress_Place_Building). Boon Wang was a co-founder of the [Equator Art Society](/wiki/Equator_Art_Society), a left-leaning [realist](/wiki/Realism_(art)) organization in the mid-1950s. He later joined the Singapore Watercolour Society. ## Personal life and death Boon Wang had a son and two daughters from his first marriage. He was then married to Helen Teo for four decades. Boon Wang underwent surgery for pancreatic cancer in 2014 and relapsed with colon cancer in 2016. He died on 30 October 2016 at the St Andrew's Community Hospital in Singapore. This Singaporean biographical article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:20:48.248933",
  "title": "Lee Boon Wang",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Lee_Boon_Wang"
}