{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:21:04.439450"
  },
  "content": "Prime Minister of Singapore from 1959 to 1990 **Lee Kuan Yew**[a] [GCMG](/wiki/Knight_Grand_Cross_of_the_Order_of_St_Michael_and_St_George) [CH](/wiki/Companion_of_Honour) [SPMJ](/wiki/Order_of_the_Crown_of_Johor) [DK](/wiki/Family_Order_of_Laila_Utama) (born **Harry Lee Kuan Yew**; 16 September 1923 – 23 March 2015), often referred to by his initials **LKY**, was a Singaporean statesman and barrister who was the first [prime minister of Singapore](/wiki/Prime_Minister_of_Singapore) from 1959 to 1990. A [founding father](/wiki/List_of_national_founders#Singapore) of the modern Singaporean state, his [authoritarian](/wiki/Authoritarian) political leadership transformed [post-independence Singapore](/wiki/History_of_the_Republic_of_Singapore) into a [highly developed country](/wiki/Developed_country) and one of the [four Asian Tigers](/wiki/Four_Asian_Tigers). Born in [Singapore during British colonial rule](/wiki/Singapore_in_the_Straits_Settlements) to a family of Chinese descent, Lee studied law in England at [Cambridge University](/wiki/Cambridge_University) and was [called to the bar](/wiki/Called_to_the_bar) at the [Middle Temple](/wiki/Middle_Temple) in 1950. Shortly after, he returned to Singapore and practised law, founding the law firm [Lee & Lee](/wiki/Lee_%26_Lee). In 1954, Lee co-founded the [People's Action Party](/wiki/People%27s_Action_Party) (PAP), which won significant support among the [working class](/wiki/Working_class) and [trade unions](/wiki/Trade_unions) in the lead up to the [1955 general election](/wiki/1955_Singaporean_general_election), securing him a seat in the [Tanjong Pagar](/wiki/Tanjong_Pagar_SMC) division and making him the *[de facto](/wiki/De_facto)* [leader of the opposition](/wiki/Leader_of_the_Opposition_(Singapore)). In 1959, Lee led the PAP to [its first electoral victory](/wiki/1959_Singaporean_general_election), becoming Singapore's first prime minister. Seeking [sovereignty](/wiki/Sovereignty) from the [British Empire](/wiki/British_Empire), Lee led Singapore to a [merger](/wiki/Malaysia_Agreement) with [Malaya](/wiki/Federation_of_Malaya) along with [Sarawak](/wiki/Crown_Colony_of_Sarawak) and [Sabah](/wiki/Crown_Colony_of_North_Borneo), forming [Malaysia](/wiki/Malaysia) in 1963. [Racial strife](/wiki/1964_race_riots_in_Singapore) and [ideological differences](/wiki/Malaysian_Malaysia) later led to Singapore's [expulsion](/wiki/Singapore_in_Malaysia) from Malaysia and [consequent independence](/wiki/Independence_of_Singapore_Agreement_1965) in 1965. Lee oversaw major economic reforms and urban development, instituting policies promoting [meritocracy](/wiki/Meritocracy), [multiracialism](/wiki/Multiracialism) and [anti-corruption](/wiki/Anti-corruption). His administration, generally characterised as an [illiberal democracy](/wiki/Illiberal_democracy) with [nanny state](/wiki/Nanny_state) tendencies, restricted [press freedoms](/wiki/Press_freedom), [public assembly](/wiki/Freedom_of_assembly), [labour activism](/wiki/Labour_activism) and [civil liberties](/wiki/Civil_liberties). From (/wiki/1968_Singaporean_general_election) to (/wiki/1981_Anson_by-election), Singapore was a *de facto* [one-party state](/wiki/Dominant-party_system), with the PAP facing no opposition in Parliament. Although Lee maintained legal and institutional procedures that formally characterised Singapore as a democratic [parliamentary republic](/wiki/Parliamentary_republic), he employed [defamation laws](/wiki/Defamation), [detention without trial](/wiki/Internal_Security_Act_(Singapore)) and social engineering to ensure continued electoral success. In justifying his policies, Lee was a major proponent of [Asian values](/wiki/Asian_values), arguing that [communitarianism](/wiki/Communitarianism) and limited [human rights](/wiki/Human_rights) were necessary for the [social cohesion](/wiki/Group_cohesiveness), [political stability](/wiki/Political_stability) and rapid [economic development](/wiki/Development_economics) of Singapore. Lee stepped down as prime minister in 1990 but continued to serve in the Cabinet as [senior minister](/wiki/Senior_Minister_of_Singapore) until 2004 and subsequently as [minister mentor](/wiki/Minister_mentor) until his retirement in 2011. Throughout his political career, he remained an influential figure in shaping Singapore's domestic and foreign policies, at the same time serving as an advisor to foreign leaders as an elder statesman. Lee died of pneumonia on 23 March 2015 at the age of 91. In Singapore, Lee is widely regarded as instrumental in the development of [Singapore's economy](/wiki/Economy_of_Singapore), [bureaucracy](/wiki/Singapore_Civil_Service), [education system](/wiki/Education_in_Singapore), [foreign policy](/wiki/Foreign_relations_of_Singapore), [public housing](/wiki/Public_housing_in_Singapore) and [healthcare](/wiki/Healthcare_in_Singapore). The [Lee Kuan Yew School of Public Policy](/wiki/Lee_Kuan_Yew_School_of_Public_Policy) at the [National University of Singapore](/wiki/National_University_of_Singapore) is named in his honor. Following his death, a [week of national mourning](/wiki/Death_and_state_funeral_of_Lee_Kuan_Yew) was announced, during which approximately 1.7 million people paid their respects at tribute sites around the country. ## Early life ### Childhood and early education Harry Lee Kuan Yew was born on 16 September 1923, the first child of [Lee Chin Koon](/wiki/Lee_Chin_Koon), who was born in [Semarang](/wiki/Semarang) during [Dutch colonial rule](/wiki/Dutch_East_Indies) and subsequently moved to Singapore, and [Chua Jim Neo](/wiki/Chua_Jim_Neo), at 92 Kampong Java Road in Singapore, then part of the [Straits Settlements](/wiki/Straits_Settlements). Both of Lee's parents were English-educated third-generation [Peranakan Chinese](/wiki/Peranakan_Chinese), with his paternal side being of [Hakka](/wiki/Hakka_people) descent from [Dabu County](/wiki/Dabu_County). He was named 'Kuan Yew',[b] meaning 'light and brightness', alternately meaning 'bringing great glory to one's ancestors'. Lee's paternal grandfather Lee Hoon Leong, who was described as \"especially westernised\", had worked on British ships as a [purser](/wiki/Purser), and hence gave Lee the Western name 'Harry'. While the family spoke English as its first language, Lee also learned Malay. Lee had three brothers and one sister, all of whom lived to old age. Lee was not close to his father, who worked as a storekeeper within the [Shell Oil Company](/wiki/Shell_Oil_Company) and had a gambling addiction. His mother Chua often stood up against her husband for his poor financial management and parenting skills. The family was considered prosperous with a high social standing compared to recent immigrants, and had the means to hire servants. During the [Great Depression](/wiki/Great_Depression) the family fortunes declined considerably, though Lee's father retained his job at Shell. Later in life, Lee described his father as a man with a nasty temper, and he credited his mother with holding the family together amidst her husband's gambling addiction. In 1930, Lee enrolled at [Telok Kurau English School](/wiki/List_of_primary_schools_in_Singapore) where he spent six years of his primary education. Attending [Raffles Institution](/wiki/Raffles_Institution) in 1935, Lee did poorly in his first two years but later topped the [Junior Cambridge](/wiki/GCE_Ordinary_Level) examinations. He also joined the [Scouts](/wiki/Scouting) and partook in several physical activities such as cricket, tennis, swimming as well as debates. Lee was the top scorer in the [Senior Cambridge](/wiki/Senior_Cambridge) examinations in 1940 across the Straits Settlements and Malaya, earning the John Anderson scholarship to attend Raffles College, as well as the Tan Jiak Kim scholarship.[c] During the prize-awarding ceremony, Lee met his future wife [Kwa Geok Choo](/wiki/Kwa_Geok_Choo); she was the only girl at the school. Lee's subsequent university studies at Raffles College were disrupted by the onset of [World War II](/wiki/World_War_II) in Asia, with the school being converted into a medical facility in 1941. The war arrived in [December of that year](/wiki/Bombing_of_Singapore_(1941)) and following the [British surrender](/wiki/Battle_of_Singapore#Fall_of_Singapore) in February 1942, the [Japanese occupation of Singapore](/wiki/Japanese_occupation_of_Singapore) began. ### World War II Lee was amongst the Chinese men rounded up by the Japanese *[Sook Ching](/wiki/Sook_Ching)* operation. By his own account, he feared getting caught by the *[Kempeitai](/wiki/Kempeitai)* (military police) and reported with a friend to be screened. He attempted to leave the next morning but was ordered to join a group of already segregated men. Lee requested to collect his clothes first and managed to spend a second night in the dormitory before successfully leaving the site the next day when a different guard cleared him through. He later learned that the group of men were likely taken to the beach and executed. Lee obtained a Japanese language proficiency certificate in August 1942 and worked in a friend's company and then the *Kumiai*, which controlled essential items. He got a job with the Japanese propaganda department (*Hōdōbu*) in late 1943 and worked for the [Japanese occupation force](/wiki/Japanese_occupation_of_Singapore) as an English specialist. Working at the top of the [Cathay Building](/wiki/Cathay_Building), he was assigned to listen to Allied radio stations for Morse code signals. By late 1944, Lee knew Japan had suffered major setbacks and planned to move to the [Cameron Highlands](/wiki/Cameron_Highlands) with his family to avoid a possible British invasion. He was tipped off that he was being followed and abandoned the plan. He engaged in private enterprises and [black market](/wiki/Black_market) sales for the rest of the war. During this time, Lee helped develop a glue based on tapioca, which he sold under the name Stikfas, as a means to support himself during the war. The Stikfas logo later appeared on the base of his wedding cake. The rapid Japanese victory in the [Malaya](/wiki/Malayan_campaign) and [Singapore](/wiki/Fall_of_Singapore) campaign had a major impact on Lee as he recalled: \"In 70 days of surprises, upsets and stupidities, British colonial society was shattered, and with it all the assumptions of the Englishman's superiority\". In a radio broadcast made in 1961, Lee said he \"emerged [from the war] determined that no one—neither Japanese nor British—had the right to push and kick us around... (and) that we could govern ourselves.\" It also influenced his perceptions of raw power and the effectiveness of harsh punishment in deterring crime. ### University, marriage and politics Lee chose not to return to Raffles College after the war and pursued higher education in the United Kingdom. He sailed from Singapore in 1946 on his 23rd birthday on the [MV *Britannic*](/wiki/MV_Britannic_(1929)), arriving in the UK on 3 October. He initially enrolled at the [London School of Economics](/wiki/London_School_of_Economics), but found himself disliking life in the British capital. He visited [Cambridge](/wiki/Cambridge) in November and was introduced to [W. S. Thatcher](/wiki/William_Thatcher), Censor of Fitzwilliam House. He was admitted into the following year's Lent term and [matriculated](/wiki/Matriculated) in January 1947, reading law at [Fitzwilliam College](/wiki/Fitzwilliam_College,_Cambridge). Prior to his departure from Singapore, Lee had begun a relationship with Kwa, with whom he had kept in contact during the war. They married in secret at [Stratford-upon-Avon](/wiki/Stratford-upon-Avon) in December. Lee achieved a [first class](/wiki/British_undergraduate_degree_classification) result in both the Prelims and Part I of the [Tripos](/wiki/Tripos), and graduated with a Starred First for Part II Law in 1949. As the top student of his cohort, he was awarded the Fitzwilliam's Whitlock Prize; Lee was [called to the bar](/wiki/Called_to_the_bar) from the [Middle Temple](/wiki/Middle_Temple) in 1950. > If you value fairness and social justice, not only to the people of Britain but also to the millions of British subjects in the colonies, return another Labour government. Lee to voters in the [Totnes](/wiki/Totnes_(UK_Parliament_constituency)) constituency During his studies, Lee's political convictions and anti-colonial sentiments were hardened by personal experiences and an increasing belief that the British were ruling Singapore for their own benefit. He supported the [Labour Party](/wiki/Labour_Party_(UK)) against the [Conservatives](/wiki/Conservative_Party_(UK)) whom he perceived as opposing [decolonisation](/wiki/Decolonisation). In the leadup to the [1950 United Kingdom general election](/wiki/1950_United_Kingdom_general_election), Lee engaged in politics for the first time and actively campaigned for a friend, [David Widdicombe](/wiki/David_Widdicombe_(QC)) in [Totnes](/wiki/Totnes_(UK_Parliament_constituency)) constituency, driving Widdicombe around in a lorry and delivering several speeches on his behalf. Before returning to Singapore, Lee dropped his English name, Harry.[d] Notwithstanding, even until the end of his life, old friends and relatives referred to him as Harry. ## Early career (1951–1955) ### Litigation practice Lee and his wife returned to Singapore in August 1950 on board the [MS *Willem Ruys*](/wiki/MS_Willem_Ruys). He joined the Laycock and Ong law firm founded by British lawyer [John Laycock](/wiki/John_Laycock). Laycock was a co-founder of the pro-British [Progressive Party](/wiki/Progressive_Party_(Singapore)) and Lee represented the party during the [1951 legislative council election](/wiki/1951_Singaporean_general_election) as an election agent. Lee was called to the Singapore bar on 7 August 1951. During the postal union strike in May 1952, Lee negotiated a settlement marking his first step into the labour movement. In due course, Lee represented nearly fifty trade unions and associations against the British authorities on a *[pro bono](/wiki/Pro_bono)* basis. The disputes often centered around wages and Laycock eventually requested Lee to cease taking on such cases as it was hurting the firm. In May 1954, the left-wing [University Socialist Club](/wiki/University_Socialist_Club) published an article 'Aggression in Asia' in the club's magazine *The Fajar*, and the student editors were charged with sedition. Lee became junior counsel to [Denis Pritt](/wiki/Denis_Pritt). The court quashed the charges and the two counsel gained a reputation through the trial, with Lee thereafter becoming a \"major leader\" of the movement against British rule. During the same year, Lee also appealed on behalf of the students arrested during the [13 May incident](/wiki/1954_National_Service_riots). The colonial government upheld the sentences, though the case enhanced Lee's reputation as a \"left-wing lawyer\" and marked his first involvement with the Chinese intelligentsia. ### Forming the PAP During his studies in Britain, Lee met [Goh Keng Swee](/wiki/Goh_Keng_Swee) and [Toh Chin Chye](/wiki/Toh_Chin_Chye) via the [Malayan Forum](/wiki/Malayan_Forum). The forum sought to promote an independent Malaya which included Singapore and met at 44 Bryanston Square in London. Lee and his contemporaries deliberately avoided the topic of forming a political party to avoid charges of [subversion](/wiki/Subversion), beginning work on forming a political party only after returning to Singapore. Lee had sought to build support among the English-educated, Malay, and Indian communities by taking on cases against the British authorities. In the course of his work, Lee became acquainted with the journalist [Sinnathamby Rajaratnam](/wiki/Sinnathamby_Rajaratnam); [Abdul Samad Ismail](/wiki/Abdul_Samad_Ismail), a writer for the Malay newspaper *[Utusan Melayu](/wiki/Utusan_Melayu)*; and [Devan Nair](/wiki/Devan_Nair). He next turned his attention to the Chinese-speaking majority and was introduced to [Lim Chin Siong](/wiki/Lim_Chin_Siong) and Fong Swee Suan, leaders of the influential bus and factories unions. While the unions had been infiltrated by communists, Lee consciously sought their support as he wanted a popular front. With elections approaching in 1955, Lee and his associates debated the name, ideology, and policies of the party they wanted to create at [38 Oxley Road](/wiki/38_Oxley_Road). The [People's Action Party](/wiki/People%27s_Action_Party) (PAP) was inaugurated on 21 November 1954 at the [Victoria Memorial Hall](/wiki/Victoria_Memorial_Hall). As the party still lacked members, trade union leaders rounded up an estimated audience of 800 to 1,500 supporters. Lee had also invited [Tunku Abdul Rahman](/wiki/Tunku_Abdul_Rahman) and [Tan Cheng Lock](/wiki/Tan_Cheng_Lock), presidents of the [United Malays National Organisation](/wiki/United_Malays_National_Organisation) and [Malayan Chinese Association](/wiki/Malayan_Chinese_Association). In his inaugural speech, Lee denounced the British for the slow transition to self-rule, demanded their immediate withdrawal, and said that the PAP would pursue a Singapore-Malaya union. Lee became [secretary-general](/wiki/Secretary_(title)) of the party, a post he held until 1992, barring a brief period in 1957 when the post was taken up by [T. T. Rajah](/wiki/T._T._Rajah). In July 1953, Governor [John Nicoll](/wiki/John_Fearns_Nicoll) initiated the [Rendel Commission](/wiki/Rendel_Commission) to provide for a transition to self-rule. The commission created the legislative assembly and opened 25 of 32 seats for direct contest in the upcoming [1955 election](/wiki/1955_Singaporean_general_election). The PAP and [Labour Front](/wiki/Labour_Front), led by Lee and [David Marshall](/wiki/David_Marshall_(Singaporean_politician)) respectively, both criticised the concessions as \"inadequate\". The PAP faced manpower constraints but decided to prioritise resources and contest four seats as a protest gesture. In a rally speech, Lee said he chose the Tanjong Pagar division as it was a \"working class area\" and that he did not want to represent \"wealthy merchants or landlords\". During the campaigning period, the British press labelled Lee as a \"[commissar](/wiki/Commissar)\" and accused the PAP of being a \"communist-backed party\". [Democratic Party](/wiki/Democratic_Party_(Singapore)) (DP) challenger Lam Thian also capitalised on Lee's inability to converse in Chinese. Lee's proposal for a multilingual debate was never reciprocated by Thian, though he eventually made his maiden Chinese speech after several hours of coaching. On polling day, 2 April, the ruling Progressive Party captured only four seats, shocking both the British establishment and its opposition. Lee defeated his competitors and won Tanjong Pagar, with the PAP winning three of their four contested seats. He pledged to work with Marshall and the new Labour Front government. As independent member [Ahmad Ibrahim](/wiki/Ahmad_Ibrahim_(Singaporean_politician)) joined PAP following the election, PAP had 4 members in the Assembly and thus Lee became the new Leader of the Opposition. ## Leader of the Opposition (1955–1959) ### Strikes and power struggle > Any man in Singapore who wants to carry the Chinese-speaking people with him cannot afford to be anti-Communist. The Chinese are very proud of China. If I had to choose between colonialism and communism, I would vote for communism and so would the great majority. Lee to an Australian journalist a week before the riot On 23 April 1955, workers from the Hock Lee Amalgamated Bus Company began a strike under the direction of Fong Swee Suan, leader of the Singapore Buses Workers' Union (SBWU). As SBWU's legal advisor, Lee worked with [Marshall's government](/wiki/Chief_ministership_of_David_Marshall) to negotiate a resolution, which was initially agreed by the SBWU but then reneged on by the company. Seeking to exert greater pressure, Lee, Fong and [Lim Chin Siong](/wiki/Lim_Chin_Siong) addressed the strikers on 1 May ([May Day](/wiki/Labour_Day_(Singapore))), where Lee called the government a \"half-past six democracy\". The strike subsequently escalated into a [riot on 12 May](/wiki/Hock_Lee_bus_riots). Lee, Marshall and the company agreed on a further resolution on 14 May, which conceded to several of the strikers' demands. In an emergency legislative assembly sitting on 16 May, Chief Secretary [William Goode](/wiki/William_Allmond_Codrington_Goode) accused Lee of losing control of the PAP to Lim. Lee was constrained between defending the actions of his colleagues and denouncing them, instead reiterating the PAP's committal to non-violence. Marshall defended him and the PAP as \"decent men\" against Goode's accusations and called upon the party to \"purge themselves of communists\". The riot led the public to perceive the PAP as being led by \"young, immature and troublesome politicians\", resulting in a shortfall of new members. It deepened the divide between two emerging factions, with Lee's faction advocating [Fabian](/wiki/Fabian_Society)'s brand of socialism for gradual reform and Lim's faction, later described by Fong as \"favour(ing) a more radical approach\". Lee was convinced that Lim and Fong's influence were pushing the party toward \"political disaster\". After consulting his allies [Toh Chin Chye](/wiki/Toh_Chin_Chye), [S. Rajaratnam](/wiki/S._Rajaratnam) and [Byrne](/wiki/Kenneth_Michael_Byrne), Lee censured the two men privately and demanded they change strategies or leave the party. By 1956, Lee believed that the PAP \"had been captured by the communists\" and privately endorsed the Labour Front government purge of suspected \"leftists\" in the aftermath of the 1956 [Chinese middle schools riots](/wiki/Chinese_middle_schools_riots). The arrestees included his rival Lim and several other PAP members. When other leftist members captured six seats in the PAP central executive committee (CEC) elections on 4 August 1957, Lee refused to allow his allies to assume their appointments and said that his faction had \"lost their moral right\" to enforce the party's founding philosophy. Overtures were made by fellow CEC member [T. T. Rajah](/wiki/T._T._Rajah) to remain in his post, to which he declined. The government arrested the leftist leaders on 22 August and Lee was restored as secretary-general on 20 October. He later blamed the attempted takeover on lax admission rules to the party and permanently distrusted the leftists thereafter. On 23 November 1958, the party constitution was amended to implement a cadre system. The right to vote in party elections and run for office were revoked from ordinary party members, whom now had to seek approval from the CEC to be a cadre and regain these privileges. Lee credited the Vatican system where the pope pre-selects its cardinals for the idea. ### Merdeka talks The Labour Front government's conciliatory approach to the Hock Lee strikers led to a drastic increase in strikes. Frustrated by his limited powers, Marshall demanded further constitutional reforms towards the aim of \"true self-government\". Lee supported Marshall in his efforts, though he initially threatened an opposition boycott over wording disputes in the agreement. Between 1956 and 1958, there were three rounds of constitutional talks. Lee was part of Marshall's 13-member delegation to London in April 1956. Marshall's demands for independence were repeatedly rejected by Colonial Secretary [Alan Lennox-Boyd](/wiki/Alan_Lennox-Boyd) and Lee departed early over Marshall's refusal to compromise. He criticised Marshall for his \"political ineptitude\" in the British press and received widespread media and radio coverage. He returned to London in March 1957 as part of a five-member delegation led by the new chief minister [Lim Yew Hock](/wiki/Lim_Yew_Hock). Britain conceded to Singapore's self-governance but also demanded that a tripartite Internal Security Council be established, which proved controversial back home. Marshall challenged Lee to seek a fresh mandate from his Tanjong Pagar constituents, which Lee accepted. In the June [1957 by-elections](/wiki/1957_Singaporean_by-elections), Lee was reelected with 68.1% of the vote. Lee returned to London for the third and final talks in May 1958, where it was agreed that Singapore would assume self-governance with a [Yang di-Pertuan Negara](/wiki/Yang_di-Pertuan_Negara) as head of state, with Britain retaining control of defence and foreign policy. The British [House of Lords](/wiki/House_of_Lords) passed the State of Singapore Act on 24 July 1958, which received [royal assent](/wiki/Royal_assent) on 1 August, and became law following the subsequent general election. ### 1957 and 1959 elections As the [1957 City Council election](/wiki/1957_Singaporean_City_Council_election) in December approached, a Hokkien-speaking candidate, [Ong Eng Guan](/wiki/Ong_Eng_Guan), became the PAP's new face to the Chinese electorate. The 32-seat city council's functions were restricted to up-keeping public amenities within city limits, but party leaders decided to contest the election as a \"dry run\" for the upcoming general election. Lee limited the PAP to contesting 14 seats to avoid provoking the government and formed an electoral pact with the Labour Front and [United Malays National Organisation](/wiki/United_Malays_National_Organisation) (UMNO) to jointly tackle the new [Liberal Socialist Party](/wiki/Liberal_Socialist_Party).[e] The PAP campaigned on a slogan to \"sweep the city clean\" and emerged with 13 seats, allowing it to form a [minority administration](/wiki/Minority_administration) with UMNO's support. Lee and the rest of the CEC unanimously endorsed Ong to become [mayor](/wiki/Mayor_of_Singapore). Early in 1959, Communications and Works Minister [Francis Thomas](/wiki/Francis_Thomas_(politician)) received evidence of corruption on Education Minister [Chew Swee Kee](/wiki/Chew_Swee_Kee). Thomas brought the evidence to Lee after the chief minister dismissed the matter. Lee tabled a motion in the assembly on 17 February, which forced Chew's resignation. As the expiry of the assembly's term approached, the PAP was initially split on whether to capture power but Lee chose to proceed. While picking the candidates, Lee deliberately chose people from different racial and education backgrounds to repair the party's image of being run by intellectuals. In the [1959 general election](/wiki/1959_Singaporean_general_election) held on 30 May 1959, the PAP won a [landslide victory](/wiki/Landslide_victory) with 43 of the 51 seats, though with only 53.4% of the popular vote which Lee noted. The PAP's victory reportedly created a dilemma within the 12-member CEC as there was no formal process in place to choose a prime minister-elect. A vote was purportedly held between Lee and Ong Eng Guan and after both men received six votes, party chairman Toh Chin Chye cast the tie-breaking vote for Lee. When interviewed nearly five decades later, Toh and one other party member recalled the vote, but Lee and several others denied the account. Lee was summoned by Governor William Goode to form a new government on 1 June, to which he requested the release of arrested PAP members. On 3 June, Singapore became a self-governing state, ending 140 years of direct British rule. Lee was sworn in as [Prime Minister of Singapore](/wiki/Prime_Minister_of_Singapore) on 5 June at [City Hall](/wiki/City_Hall,_Singapore), along with the [rest of his Cabinet](/wiki/First_Lee_Kuan_Yew_Cabinet). ## Prime Minister, State of Singapore (1959–1963) ### First years in power Lee's first speech as prime minister to a 50,000-strong audience at the [Padang](/wiki/Padang,_Singapore) sought to dampen his supporters' euphoria of the PAP's electoral win. In the first month of Lee taking power, Singapore experienced an economic slump as foreign capital fell and Western businesses and [expatriates](/wiki/Expatriates) left for [Kuala Lumpur](/wiki/Kuala_Lumpur) in Malaya, fearing the new government's anti-colonial zeal. As part of an 'anti-yellow culture' drive, Lee banned jukeboxes and pinball machines, while the police under Home Affairs Minister [Ong Pang Boon](/wiki/Ong_Pang_Boon) raided [pubs](/wiki/Pubs) and pornography publications.[f] The government cracked down on [secret societies](/wiki/Secret_societies_in_Singapore), prostitution and other illegal activities, with *TIME* magazine later reporting that a full week passed without \"kidnapping, extortion or gangland rumble(s)\" for the first time. Lee also spearheaded several 'mobilisation campaigns' to clean the city, introduced [air-conditioning](/wiki/Air-conditioning) to government offices, and slashed the salaries of civil servants. The last act provoked anger from the sector, which Lee justified as necessary to balance the budget. In February 1960, the [Housing and Development Board](/wiki/Housing_and_Development_Board) (HDB) superseded the [Singapore Improvement Trust](/wiki/Singapore_Improvement_Trust) (SIT) and assumed responsibility of [public housing](/wiki/Public_housing_in_Singapore). With strong government support, the HDB under chairman [Lim Kim San](/wiki/Lim_Kim_San) completed more flats in three years than its predecessor did in thirty-two. Government expenditure for public utilities, healthcare and education also increased significantly. By the end of the year, however, unemployment began to rise drastically as the economy slowed. Lee reversed anti-colonial policies and launched a five-year plan to build new industries, seeking to attract foreign investors and rival [Hong Kong](/wiki/British_Hong_Kong). [Jurong](/wiki/Jurong), a swampland to the island's western coast was chosen to be the site of a new [industrial estate](/wiki/Jurong_Industrial_Estate) and would house steel mills, shipyards, and oil refineries, though Finance Minister Goh Keng Swee was initially worried the venture would fail. The government promoted multiculturalism by recognising Chinese, English, Malay, and Tamil as the official languages of the new state and sought to create a new national Malayan identity. The Ministry of Culture under [S. Rajaratnam](/wiki/S._Rajaratnam) held free outdoor concerts with every ethnic race represented in the performances. Lee also introduced the [People's Association](/wiki/People%27s_Association), a government-linked organisation to run community centers and youth clubs, with its leaders trained to spread the PAP's ideology. Youth unemployment was alleviated by the establishment of work brigades. ### PAP split of 1961 Lee took measures to secure his position in the aftermath of the 1957 party elections. In 1959, he delayed the release of leftist PAP members arrested under the former Labour Front government and appointed five of its leaders,[g] including Lim Chin Siong, as parliamentary secretaries lacking political power. Lee clashed further with Lim when the government sought to create a centralised labour union in the first half of 1960. Trouble also arose from former mayor and Minister of National Development [Ong Eng Guan](/wiki/Ong_Eng_Guan), who Lee had appointed in recognition of Ong's contribution to the PAP's electoral win. Ong's relocation of his ministry to his Hong Lim stronghold and continued castigation of the British and civil servants was regarded by his colleagues as disruptive and Lee removed several portfolios from Ong's purview in February 1960. In the party conference on 18 June 1960, Ong filed \"16 resolutions\" against the leadership, accusing Lee of failing to seek party consensus when deciding policy, not adhering to anti-colonialism and suspending left-wing unions. Lee regarded it as a move to split the party and together with his allies expelled Ong from the party. Ong resigned his seat in December, precipitating the [Hong Lim by-election](/wiki/1961_Singaporean_by-elections) on in April 1961 which he won against a PAP candidate. The death of the PAP assemblyman for Anson that April triggered a second by-election. For the first time, Lim's faction openly revolted against Lee and endorsed Workers' Party chairman David Marshall who won the seat. Lee assumed responsibility for the two by-election defeats and submitted his resignation to party chairman Toh Chin Chye on 17 July. Toh rejected it and upheld Lee's mandate. Lee moved a [motion of confidence](/wiki/Motion_of_no_confidence) in his own government in the early hours of 21 July after a thirteen-hour debate which had begun the preceding day, narrowly surviving it with 27 \"Ayes\", 8 \"Noes\" and 16 abstentions. The PAP now commanded a single seat majority in the 51-seat assembly after 13 of its members had abstained. Lee expelled the 13 who had broken ranks in addition to Lim, Fong and Woodhull. ### Leadup to referendum and merger Lee and his colleagues believed that Singapore could only survive through merger with Malaya and was unwilling to call for complete independence. Merger would allow goods to be exported to the peninsula under a [common market](/wiki/Common_market), while devolving unpopular internal security measures to [Kuala Lumpur](/wiki/Kuala_Lumpur). Malaya's ruling [Alliance Party](/wiki/Alliance_Party_(Malaysia)) coalition dominated by the [United Malays National Organisation](/wiki/United_Malays_National_Organisation) (UMNO) had repeatedly opposed the scheme and was apprehensive that Singapore's Chinese majority would reduce 'Malay political supremacy'. Prime Minister [Tunku Abdul Rahman](/wiki/Tunku_Abdul_Rahman) backtracked after the PAP's Hong Lim by-election defeat, fearing a \"pro-communist government\" in Singapore should Lee fall from power. On 27 May 1961, Tunku announced that Malaya, Singapore, and the British colonies of [North Borneo](/wiki/Crown_Colony_of_North_Borneo) and [Sarawak](/wiki/Crown_Colony_of_Sarawak) should pursue \"political and economic cooperation\". Lee endorsed the program six days later and commenced negotiations on the formation of Malaysia. In August 1961, Lee and Tunku agreed that Singapore's defence, foreign affairs and internal security would be transferred to the federal government, while education and labour policy remained with the state government. Lim Chin Siong and his supporters saw Lee's ceding control of internal security—then controlled by the Internal Security Council with British, Malayan, Singaporean representatives—to the federal government as a threat as Tunku was convinced they were communists. In a meeting with British Commissioner General [Lord Selkirk](/wiki/George_Douglas-Hamilton,_10th_Earl_of_Selkirk), Selkirk reaffirmed that the British would not suspend Singapore's constitution should Lee be voted out. Lee saw the meeting as a British endorsement of Lim and accused it as a plot against his government. On 13 August, Lim founded the [Barisan Sosialis](/wiki/Barisan_Sosialis) and became its secretary-general, with 35 of 51 branches of the PAP defecting. Lee anticipated a Barisan win in the next election and saw 'independence through merger' as the only means for the PAP to retain power. Beginning on 13 September 1961, Lee gave twelve multilingual radio speeches outlining the benefits of merger in what he called the 'Battle for Merger'. The speeches proved to be a massive success for Lee's campaign, while Barisan's demands for equal airtime were rejected. Lee employed full use of state resources to suppress his opponents by revoking the Barisan's printing permits, banning or relocating its rallies, and purging its supporters from the government, while the judiciary and police engaged to \"obstruct, provoke and isolate\" the party. The Barisan lambasted Lee for securing only 15 seats in the Malaysian parliament for Singapore in contrast to North Borneo (16) and Sarawak (24), despite both having a combined population well below Singapore's 1.7 million. Singapore citizens would also be categorised as \"nationals\" and not be granted Malaysian citizenship. On 6 December, the legislative assembly voted 33–0 in favour of the agreements struck by Lee and Tunku, which the Barisan boycotted. A referendum for merger was scheduled for 1 September 1962. Lee ensured that the ballot lacked a \"no\" option, with all three options having varying terms for admission into Malaysia. The ballot was crafted by Lee and Goh Keng Swee to capitalise on a mistake which the Barisan had made the previous year. The Barisan had inadvertently endorsed merger under terms \"like [Penang](/wiki/Penang)\" (a state of Malaya) with full citizenship rights, not realising that Malayan law entitled only a native-born to qualify for automatic citizenship, which would [disenfranchise](/wiki/Disenfranchise) nearly one third of those eligible to vote; it issued a clarification but never recovered from the mistake. Lee placed the [flag of Singapore](/wiki/Flag_of_Singapore) alongside option A with the terms of Singapore retaining control of education and labour policy, while portraying the Barisan's choice as option B favouring entry into the federation with no special rights, next to the [flag of Penang](/wiki/Flag_of_Penang). When Lim called for his supporters to submit [blank votes](/wiki/Blank_votes), Lee countered that blank votes would count as a vote for the majority choice. 71% eventually voted for option A, while 26% cast blank votes. In November, Lee embarked on a ten-month visit to all fifty-one constituencies, prioritising those with the highest count of blank votes. ### Operation Coldstore detentions The Malayan government considered the arrests of Singapore's left-wing groups as non-negotiable for the formation of Malaysia. Tunku felt that Lee lacked the initiative to suppress \"pro-communist elements\" and warned that a Malay-led dictatorship would be instated to prevent a \"socialist majority\" in the next Malayan election. As the Malayans increased pressure on the Internal Security Council (ISC) to take action, Lee began supporting the idea of a purge in March 1962. The Malayan and Singapore special branches collaborated on an arrest list of major opposition members, though doubts arose if Lim Chin Siong and Fong Swee Suan could be classified as 'communists'. Up until the end of November 1962, the British declined to support the operation without a pretext, noting that Lim and the Barisan Sosialis had not broken any laws. The [Brunei revolt](/wiki/Brunei_revolt) on 8 December led by [A. M. Azahari](/wiki/A._M._Azahari) provided a \"heaven-sent opportunity\" to take action, as Lim had met Azahari on 3 December. The Malayan government convened the ISC to discuss the operation, while Singapore's Special Branch produced alleged evidence of the communist control of Barisan. On 13 December, Lord Selkirk gave his authorisation for the arrests to proceed on 16 December. However, Lee's attempt to add two Malayan parliamentarians opposed to the formation of Malaysia into the arrest list caused the Malayan representative to rescind his consent, stopping the operation. Tunku suspected that Lee was trying to eliminate his entire opposition, while Lee felt that Tunku was evading his shared responsibility for the arrests. An ISC meeting was scheduled to be held on 1 February 1963 to remount the operation. During the interim period, Lee had added three names from the United People's Party, one of them being former PAP minister Ong Eng Guan. Selkirk expressed concerns that Ong's arrest lacked any justification and Lee conceded that it was meant as a \"warning\" to Ong. Tunku told [Geofroy Tory](/wiki/Geofroy_Tory), the [British High Commissioner in Kuala Lumpur](/wiki/List_of_High_Commissioners_of_the_United_Kingdom_to_Malaysia) on 30 January, that 'if this operation failed, merger with Singapore was off'. Selkirk was pressured to put his reservations aside and finally consented. On 2 February, Operation Coldstore commenced across Singapore, with 113 detained including Lim and 23 others from Barisan Sosialis. Lee offered Lim a path into exile which Lim rejected. The Malayans and British later pressured Lee to retract his comment when he said he \"disapproved\" of the operation. In his memoirs, Lee portrayed himself as reluctant in supporting the operation, though declassified British documents revealed that Lee was \"somewhat more enthusiastic\" than he eventually admitted. ## Prime Minister, Singapore in Malaysia (1963–1965) ### Elections and tensions On 31 August 1963, Lee declared Singapore's independence in a ceremony at the Padang and pledged loyalty to the federal government. With the conclusion of the trials of Barisan Sosialis' leaders, Lee dissolved the legislative assembly on 3 September and called for a [snap election](/wiki/Snap_election). He touted \"independence through merger\" as a success and utilised television and the mass media effectively. In conjunction with [Sabah](/wiki/Sabah) (formerly North Borneo) and [Sarawak](/wiki/Sarawak), Lee proclaimed Singapore as part of Malaysia in a second ceremony on 16 September accompanied by a military parade.[h] Lim Chin Siong's arrest had, however, generated widespread sympathy for the Barisan and a close result was predicted. Australian and British officials expected a Barisan win. When the PAP defeated the Barisan in a landslide victory on 21 September, it was seen as a public endorsement of merger and Lee's socio-economic policies. Relations between the PAP and Malaysia's ruling [Alliance Party](/wiki/Alliance_Party_(Malaysia)) quickly deteriorated as Lee began espousing his policies to the rest of the country. The United Malays National Organisation (UMNO) was also shocked by the loss of three Malay-majority seats to the PAP in the recent 1963 Singapore election. [Ultra-nationalists](/wiki/Ultra_(Malaysia)) within UMNO alleged that Lee sought to overthrow the [Malay monarchies](/wiki/Monarchies_of_Malaysia) and infringe on [rural life](/wiki/Rural_life). Lee's attempts to reconcile the PAP with UMNO were rebuffed as the latter remained committed to the [Malaysian Chinese Association](/wiki/Malaysian_Chinese_Association). Further hostility ensued when the PAP decided to contest in the [1964 Malaysian general election](/wiki/1964_Malaysian_general_election) in contravention of a [gentlemen's agreement](/wiki/Gentlemen%27s_agreement) that it disavow itself from peninsula politics, but PAP already regarded the agreement to be rendered moot as the Alliance contested the 1963 Singapore state election and broke the agreement first. Lee's speeches in Malaysia attracted large crowds and he expected the PAP to win at least seven parliamentary seats. The party ultimately won only one seat in [Bangsar](/wiki/Bangsar_(federal_constituency)), Selangor under Devan Nair. Lee and other party insiders later conceded that UMNO's portrayal of the PAP as a \"Chinese party\" and its lack of [grassroots](/wiki/Grassroots) in the peninsula had undermined its support from the Malay majority. Ethnic tensions had risen prior to the April election when UMNO secretary-general [Syed Jaafar Albar](/wiki/Syed_Jaafar_Albar) utilised the *[Utusan Melayu](/wiki/Utusan_Melayu)* to accuse Lee of evicting Malays from their homes in March 1964. Lee explained personally to the affected neighbourhoods that the scheme was part of an [urban renewal](/wiki/Urban_renewal) plan and that eviction notices had been sent to everyone irrespective of race. Albar responded by warning Lee to not \"treat the [sons of the soil](/wiki/Bumiputera_(Malaysia)) as step-children\" and led calls for the deaths of Lee and Social Affairs Minister [Othman bin Wok](/wiki/Othman_bin_Wok) on 12 July. On 21 July, the [1964 race riots in Singapore](/wiki/1964_race_riots_in_Singapore) erupted during a celebration of [Prophet Muhammad's birthday](/wiki/Mawlid), lasting four days, killing 22 and injuring 461. Further riots occurred in late-August and early-September resulting in communities self-segregating from each other, which Lee characterised as \"terribly disheartening\" and against \"everything we had believed in and worked for\". Lee never forgot the Malay PAP leaders who stood against UMNO during the turmoil and as late as 1998, paid tribute to them for Singapore's survival. ### Malaysian Malaysia and separation Lee's perceptions that merger was becoming infeasible was also due to the federal government's obstruction of his industrialisation program and its imposition of new taxes on Singapore in the November 1964 federal budget. Tunku mentioned to deputy prime minister [Goh Keng Swee](/wiki/Goh_Keng_Swee) in December 1964 about his desire to have Singapore “hived off” from Malaysia. Lee authorized Goh to renegotiate with Deputy Prime Minister [Abdul Razak Hussein](/wiki/Abdul_Razak_Hussein) on Singapore's place in the federation in early 1965. Seeking to provide an alternative to the Alliance Party government, Lee and his colleagues formed the [Malaysian Solidarity Convention](/wiki/Malaysian_Solidarity_Convention) (MSC) with the Malayan and Sarawakian opposition on 9 May, with its goals for a [Malaysian Malaysia](/wiki/Malaysian_Malaysia) and race-blind society. The MSC was seen by UMNO as a threat to the Malay monopoly of power and special rights granted to Malays under [Article 153](/wiki/Article_153_of_the_Constitution_of_Malaysia). UMNO supreme council member and future prime minister [Mahathir Mohamad](/wiki/Mahathir_Mohamad) called the PAP \"pro-Chinese, communist-oriented and positively anti-Malay\", while others called for Lee's arrest under the [Internal Security Act](/wiki/Internal_Security_Act_(Malaysia)) for trying to split the federation. Mathathir in his speech stated the *huaren* (ethnic Chinese) of Singapore were of \"the insular, selfish and arrogant type of which Mr. Lee is a good example...They are in fact Chinese first, seeing China as the center of the world and Malaysia as a very poor second\". Such fears were sincerely felt by the UMNO leaders as one UMNO politician who was friendly with Lee privately told him: \"You Chinese are too energetic and clever for us...we cannot stand the pressure\". Many UMNO politicians felt threatened by Lee, a politician who sought to appeal to both ethnic Chinese and Malay voters. Albar warned in a speech that the Malay voters of Singapore must have been \"misled\" into voting for the PAP, and the UNMO would not allow this to happen in the next election. Lee later wrote of Tunku that was \"a nice man\", but \"he was a prince who understood power and knew how to use it. He did not carry a big stick, but he had many hatchet-bearers who would do the job for him while he looked the other way and appeared as benign as ever\". Tunku was a Malay aristocrat who spent his undergraduate years at Cambridge by his own admission on \"fast women\" rather than studying and whom Lee contemptuously noted had been awarded a degree at Cambridge that he did not deserve solely because he was an aristocrat. Tunku in turn felt threatened by Lee, a man who had worked his way up via his intelligence and self-discipline, which made him very different from the people in his world. On 26 May 1965, Lee addressed the Malaysian parliament for the final time, delivering his speech entirely in the Malay language. He challenged the Alliance Party to commit itself to a Malaysian Malaysia and denounce its extremists, and also argued that the PAP could better uplift the livelihood of the Malays. Then-social affairs minister Othman Wok later recounted: \"I noticed that while he was speaking, the Alliance leaders sitting in front of us, they sank lower and lower because they were embarrassed this man (Lee) could speak Malay better than them\". Then-national development minister Lim Kim San also noted: \"That was the turning point. They perceived [Lee] as a dangerous man who could one day be the prime minister of Malaya. This was the speech that changed history.\" Prime Minister Tunku labelled the speech as the final straw which contributed to his decision in July 1965, while being treated for shingles in London, that Singapore's secession was necessary. The more extreme UMNO politicians such as Albar were pressing to have Lee arrested and martial law proclaimed, but Tunku chose to accept Singapore's secession instead. The British government received allegations of a plot to arrest Lee, and thus the British prime minister Harold Wilson quietly pressured Tunku against taking any such action, warning of potential repercussions on the Malaysian government. As Britain was defending Malaysia from Indonesian attempts to annex the country, Britain was in a strong position to apply pressure on Malaysia. Lee in his memoirs stated that Singapore owed Wilson a major debt for his role in pressuring Tunku for a peaceful resolution of the crisis, calling Wilson a \"good friend\". On 13 July 1965, Deputy Prime Minister [Goh Keng Swee](/wiki/Goh_Keng_Swee) met with Malaysian Deputy Prime Minister Tun [Abdul Razak Hussein](/wiki/Abdul_Razak_Hussein) and Home Affairs Minister [Ismail Abdul Rahman](/wiki/Ismail_Abdul_Rahman), in Razak's office while Tunku was still overseas, being treated for shingles. Goh proposed separation of Singapore from Malaysia, before reporting back to Lee about the proposal. Lee agreed, and during another meeting between Goh, Razak and Ismail on 20 July 1965, Goh told the Malaysians that Lee had given the greenlight for separation arrangements to be done quickly. Lee then summoned Law Minister [E. W. Barker](/wiki/E._W._Barker) to draft documents effecting Singapore's separation from the federation and its proclamation of independence. To ensure that a 1962 agreement to draw water from [Johor](/wiki/Johor) was retained, Lee insisted that it be enshrined in the separation agreement and Malaysian constitution. The negotiations of post-separation relations were held in utmost secrecy and Lee tried to prevent secession to the last minute, trying to convince Tunku upon his return from London to continue negotiating a looser confederation. However, Tunku's mind was already made up. Lee was persuaded to finally relent by Goh on 7 August. That day, Lee and several cabinet ministers signed the separation agreement at Razak's home, which stipulated continued co-operation in trade and mutual defence. Cabinet ministers [Toh Chin Chye](/wiki/Toh_Chin_Chye) and [S. Rajaratnam](/wiki/S._Rajaratnam), were asked to meet Lee in Kuala Lumpur. Upon being informed of the impending separation, they refused to sign the agreement at first and were distraught at the idea, before the fear of further violence and bloodshed finally convinced them to sign. Lee returned to Singapore the following day and convened the rest of his cabinet to sign the document, whereupon it was flown back to Kuala Lumpur. On 9 August 1965 at 10am, Tunku convened the Malaysian parliament and moved the [Constitution and Malaysia (Singapore Amendment) Bill 1965](/wiki/Constitution_and_Malaysia_(Singapore_Amendment)_Act_1965), which passed unanimously by a vote of 126–0 with no PAP representatives present. Singapore's independence was announced locally via radio at the same time and Lee broke the news to senior diplomats and civil servants. In a televised press conference that day, Lee fought back tears and briefly stopped to regain his composure as he formally announced the news to an anxious population: > Every time we look back on this moment when we signed this agreement which severed Singapore from Malaysia, it will be a moment of anguish. For me it is a moment of anguish because all my life. ... You see, the whole of my adult life [...] I have believed in Malaysian merger and the unity of these two territories. You know, it's a people connected by geography, economics, and ties of kinship.... We could not achieve multiracialism and integration in Malaysia. ## Prime Minister, Republic of Singapore (1965–1990) Despite the momentous event, Lee did not call for the parliament to convene to reconcile the issues that Singapore would face immediately as a new nation. Without giving further instructions on who should act in his absence, he went into isolation for six weeks, unreachable by phone, at [Changi Cottage](/wiki/Changi_Cottage). According to then-deputy prime minister [Toh Chin Chye](/wiki/Toh_Chin_Chye), the parliament hung in \"suspended animation\" until the sitting in December that year. In his memoirs, Lee said that he was unable to sleep and was prescribed tranquilizers from doctors. Upon learning of Lee's condition from the [British High Commissioner](/wiki/High_commissioner_(Commonwealth)) to Singapore, John Robb, the British prime minister, [Harold Wilson](/wiki/Harold_Wilson), expressed concern, in response to which Lee replied: > Do not worry about Singapore. My colleagues and I are sane, rational people even in our moments of anguish. We will weigh all possible consequences before we make any move on the political chessboard. Lee began to seek international recognition of Singapore's independence. Singapore joined the United Nations on 21 September 1965, and founded the [Association of Southeast Asian Nations](/wiki/ASEAN) (ASEAN) on 8 August 1967 with four other South-East Asian countries. Lee made his first official visit to Indonesia on 25 May 1973, just a few years after the [Indonesia–Malaysia confrontation](/wiki/Indonesia%E2%80%93Malaysia_confrontation) under [Sukarno](/wiki/Sukarno)'s regime. Relations between Singapore and Indonesia substantially improved as subsequent visits were made between the two countries. Singapore has never had a dominant culture to which immigrants could assimilate, even though Malay was the dominant language at that time. Together with efforts from the government and ruling party, Lee tried to create a unique Singaporean identity in the 1970s and 1980s—one which heavily recognised racial consciousness within the umbrella of [multiculturalism](/wiki/Multiculturalism). Lee and his government stressed the importance of maintaining religious tolerance and racial harmony, and they were ready to use the law to counter any threat that might incite ethnic and religious violence. For example, Lee warned against \"insensitive evangelisation\", by which he referred to instances of Christian proselytising directed at Malays. In 1974 the government advised the Bible Society of Singapore to stop publishing religious material in Malay. ### Defence The vulnerability of Singapore was deeply felt, with threats from multiple sources, including the communists and Indonesia with its confrontational stance. Adding to this vulnerability was the impending withdrawal of British forces from [East of Suez](/wiki/East_of_Suez). As Singapore gained admission to the United Nations, Lee quickly sought international recognition of Singapore's independence. He appointed [Goh Keng Swee](/wiki/Goh_Keng_Swee) as [Minister for the Interior and Defence](/wiki/Ministry_of_Interior_and_Defence) to build up the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces) (SAF) and requested help from other countries, particularly Israel and Taiwan, for advice, training and facilities. In 1967, Lee introduced conscription for all able-bodied male Singaporean citizens 18 years of age to serve National Service (NS) either in the SAF, [Singapore Police Force](/wiki/Singapore_Police_Force) or the [Singapore Civil Defence Force](/wiki/Singapore_Civil_Defence_Force). By 1971, Singapore had 17 national service battalions (16,000 men) with 14 battalions (11,000 men) in the reserves. In 1975, Lee and Republic of China premier [Chiang Ching-kuo](/wiki/Chiang_Ching-kuo) signed an agreement permitting Singaporean troops to train in Taiwan, under the codename \"Project Starlight\". ### Economy One of Lee's most urgent tasks upon Singapore's independence was to address high unemployment. Together with his economic aide, [Economic Development Board](/wiki/Economic_Development_Board) chairman [Hon Sui Sen](/wiki/Hon_Sui_Sen), and in consultation with Dutch economist [Albert Winsemius](/wiki/Albert_Winsemius), Lee set up factories and initially focused on the manufacturing industry. Before the British completely withdrew from Singapore in 1971, Lee also persuaded the British not to destroy their dock and had the British naval dockyard later converted for civilian use. Eventually, Lee and his cabinet decided the best way to boost Singapore's economy was to attract foreign investments from [multinational corporations](/wiki/Multinational_corporations) (MNCs). By establishing First World infrastructure and standards in Singapore, the new nation could attract American, Japanese and European business. By the 1970s multinational corporations like [Texas Instruments](/wiki/Texas_Instruments), [Hewlett-Packard](/wiki/Hewlett-Packard), and [General Electric](/wiki/General_Electric) began turning Singapore into a major [electronics](/wiki/Electronics) exporter. Workers were frequently trained to familiarise themselves with the work systems and cultures of foreign companies. The government also started several new industries, such as steel mills under 'National Iron and Steel Mills', service industries like [Neptune Orient Lines](/wiki/Neptune_Orient_Lines), and the [Singapore Airlines](/wiki/Singapore_Airlines). Lee and his cabinet also worked to establish Singapore as an international financial centre. Foreign bankers were assured of the reliability of Singapore's social conditions, with top-class infrastructure and skilled professionals, and investors were made to understand that the Singapore government would pursue sound [macroeconomic](/wiki/Macroeconomics) policies, with [budget surpluses](/wiki/Balanced_budget), leading to a stable valued Singapore dollar. Throughout the tenure of his office, Lee placed great importance on developing the economy, and his attention to detail on this aspect went even to the extent of connecting it with other facets of Singapore, including the country's extensive and meticulous tending of its international image of being a \"Garden City\". The 1967 \"Garden City\" planning initiative included prominent roadside greenery along the [East Coast Parkway](/wiki/East_Coast_Parkway) (ECP) highway connecting [Singapore Changi Airport](/wiki/Singapore_Changi_Airport) with [Singapore Central Area](/wiki/Central_Area,_Singapore). ### Anti-corruption measures Lee introduced legislation giving the [Corrupt Practices Investigation Bureau](/wiki/Corrupt_Practices_Investigation_Bureau) (CPIB) greater power to conduct arrests, search, call up witnesses, and investigate bank accounts and income-tax returns of suspected persons and their families. Lee believed that ministers should be well paid in order to maintain a clean and honest government. On 21 November 1986, Lee received a complaint of corruption against then Minister for National Development [Teh Cheang Wan](/wiki/Teh_Cheang_Wan). Lee authorised the [CPIB](/wiki/CPIB) to carry out investigations on Teh, but Teh committed suicide before any charges could be pressed against him. In 1994, he proposed to link the salaries of ministers, judges, and top civil servants to the salaries of top professionals in the private sector, arguing that this would help recruit and retain talent to serve in the public sector. ### Population policies In the late 1960s, fearing that Singapore's growing population might overburden the developing economy, Lee started a \"[Stop at Two](/wiki/Stop_at_Two)\" [family planning](/wiki/Family_planning) campaign. Couples were urged to undergo [sterilisation](/wiki/Sterilization_(medicine)) after their second child. Third or fourth children were given lower priorities in education and such families received fewer economic [rebates](/wiki/Tax_refund). In 1983, Lee sparked the \"Great Marriage Debate\" when he encouraged Singapore men to choose highly educated women as wives. He was concerned that a large number of graduate women were unmarried. Some sections of the population, including graduate women, were upset by his views. Nevertheless, a match-making agency, the [Social Development Unit](/wiki/Social_Development_Network) (SDU), was set up to promote socialising among men and women graduates. In the Graduate Mothers Scheme, Lee also introduced incentives such as [tax rebates](/wiki/Tax_rebate), schooling, and housing priorities for graduate mothers who had three or four children, in a reversal of the over-successful \"Stop at Two\" family planning campaign in the 1960s and 1970s. Lee suggested that perhaps the campaign for [women's rights](/wiki/Women%27s_rights) had been too successful: > *Equal employment opportunities, yes, but we shouldn't get our women into jobs where they cannot, at the same time, be mothers...our most valuable asset is in the ability of our people, yet we are frittering away this asset through the [unintended consequences](/wiki/Unintended_consequences) of changes in our education policy and [equal career opportunities](/wiki/Equal_opportunities) for women. This has affected their traditional role ... as mothers, the creators and protectors of the next generation.* — Lee Kuan Yew, \"Talent for the future\", 14 August 1983 The uproar over the proposal led to a swing of 12.9 per cent against the PAP government in the [1984 general election](/wiki/1984_Singaporean_general_election). In 1985, some especially controversial portions of the policy, that gave education and housing priorities to educated women, were abandoned or modified. By the late 1990s the birth rate had fallen so low that Lee's successor [Goh Chok Tong](/wiki/Goh_Chok_Tong) extended these incentives to all married women, and gave even more incentives, such as the \"baby bonus\" scheme. ### Water resources Singapore has traditionally relied on water from Malaysia. However, this reliance has made Singapore subject to the possibility of price increases and allowed Malaysian officials to use the water reliance as political leverage by [threatening to cut off supply](/wiki/Water_conflicts_between_Malaysia_and_Singapore). To reduce this problem, Lee decided to experiment with water recycling in 1974. As a result of such efforts, Singapore has achieved self-sufficiency with its water supply since the mid-2010s. Under Lee [tree planting](/wiki/Tree_planting) was pursued, in 1963 he began a tree-planting campaign which aimed to plant 10,000 saplings a year and in 1971 a 'Tree-Planting Day' was established. One of the goals of this was to increase rainfall. He also made efforts to clean Singapore's waters for collection and use. ### Environment Lee envisioned Singapore as a [garden city](/wiki/Garden_city_movement), declaring that \"no other hallmark of success will be more distinctive than that of achieving our position as the cleanest and greenest city in [Southeast Asia](/wiki/Southeast_Asia)\". He later said that \"[greening](/wiki/Greening) is the most cost-effective project I have launched\". Lee set up an 'Anti-Pollution Unit' stating that its importance resided in giving citizens \"respite from city centres\" and in the small size of Singapore which made it necessary to \"preserve a clean and gracious environment for rich and poor alike\". In 1995 Lee declared \"I have always believed that a blighted urban landscape, a concrete jungle, destroys the human spirit. We need the greenery of nature to lift our spirits\". Lee saw this as a means of attracting tourists and businesspeople to the city. He wrote that \"without a word being said, they would know that Singaporeans were competent, disciplined, and reliable, a people who would learn the skills they required soon enough\". After independence Lee sought for \"some dramatic way to distinguish ourselves from other Third World countries. I settled for a clean and green Singapore\" because \"if we had [First World](/wiki/First_World) standards then business people and tourists would make us a base for their business and tours of the region\". Lee considered [air conditioning](/wiki/Air_conditioning) the most important invention of the 20th century for Singapore. Air quality relates to work quality and as such Lee made sure air conditioning was installed in the offices of the Singaporean civil service in the 1960s. ### Foreign policy #### Malaysia and Mahathir Mohamad Lee looked forward to improving relationships with [Mahathir Mohamad](/wiki/Mahathir_Mohamad) upon the latter's promotion to Deputy Prime Minister. Knowing that Mahathir was in line to become the next [Prime Minister of Malaysia](/wiki/Prime_Minister_of_Malaysia), Lee invited Mahathir to visit Singapore in 1978. The first and subsequent visits improved both personal and diplomatic relationships between them. Then [UMNO](/wiki/UMNO)'s Secretary-General Mahathir asked Lee to cut off all links with the [Democratic Action Party](/wiki/Democratic_Action_Party) (DAP); in exchange, Mahathir undertook not to interfere in the affairs of [Malay Singaporeans](/wiki/Malay_Singaporeans). In June 1988, Lee and Mahathir reached an agreement in [Kuala Lumpur](/wiki/Kuala_Lumpur) to build the Linggui dam on the [Johor River](/wiki/Johor_River). Lee said he had made more progress solving bilateral issues with Dr Mahathir from 1981 to 1990 than in the previous 12 years with the latter's two predecessors. Mahathir ordered the lifting of the ban on the export of construction materials to Singapore in 1981, agreed to sort out Malaysia's claim to [Pedra Branca](/wiki/Pedra_Branca,_Singapore) island and affirmed it would honour the 1962 Water Agreement. One day before Lee left office in November 1990, Malaysia and Singapore signed the [Malaysia–Singapore Points of Agreement of 1990](/wiki/Malaysia%E2%80%93Singapore_Points_of_Agreement_of_1990) (POA). [Malayan Railways (KTM)](/wiki/Keretapi_Tanah_Melayu) would vacate the [Tanjong Pagar railway station](/wiki/Tanjong_Pagar_railway_station) and move to [Bukit Timah](/wiki/Bukit_Timah_railway_station) while all KTM's land between Bukit Timah and Tanjong Pagar would revert to Singapore. Railway land at Tanjong Pagar would be handed over to a private limited company for joint development, the equity of which would be divided 60% to Malaysia and 40% to Singapore. However, Prime Minister Mahathir expressed his displeasure with the POA, for it failed to include a piece of railway land in Bukit Timah for joint development in 1993. Following Lee's death, Mahathir posted a blog post that suggested his respect for Lee despite their differences, stating that while \"I am afraid on most other issues we could not agree [...] [h]is passage marks the end of the period when those who fought for independence lead their countries and knew the value of independence. ASEAN lost a strong leadership after President [Suharto](/wiki/Suharto) and Lee Kuan Yew\". #### Indonesia In March 1967, the [president of Indonesia](/wiki/President_of_Indonesia), [Sukarno](/wiki/Sukarno), who had initiated the *Konfrontasi*, resigned from the presidency under pressure by military general [Suharto](/wiki/Suharto) amidst the [30 September Movement](/wiki/30_September_Movement). A clemency plea by President Suharto for Osman bin Mohamed Ali and Harun bin Said, the perpetrators of the [MacDonald House bombing](/wiki/MacDonald_House_bombing) in March 1965 during *Konfrontasi*, was rejected. The Singapore Embassy in Jakarta was occupied on the day of the saboteurs' hanging by 300 students. However, [Bilateral relations between Singapore and Indonesia](/wiki/Indonesia%E2%80%93Singapore_relations) would improve after 1973, when Lee visited the graves of Harun and Osman in Indonesia (*nyekar*) and scattered flowers on them. This was followed by Suharto's visit to Singapore in 1974. From the 1980s, exchanges would sharply increase between the two countries in politics, tourism, defence, business, and [student](/wiki/Student_exchange_program) and community-based exchanges. Lee and Suharto developed a strong relationship, with the growing trust between both leaders developing into friendship. Lee and Suharto regarded each other as trustworthy and reliable. Lee kept up his relationship with Suharto until his death in 2008, even advising him and his children during the 1997-98 Asian financial crisis which led to Suharto's fall from power. In 1978, Suharto rallied ASEAN to oppose Australia's newly proclaimed integrated civil aviation policy, which cut [Kangaroo Route](/wiki/Kangaroo_Route) air access to Singapore while providing inducements to Indonesia and other countries in the region. Suharto believed that ASEAN should not give in to such tactics and inducements, and Australia relented. Singapore remains a crucial stopover for Kangaroo Route flights between the United Kingdom and Australia. Singapore and Indonesia entered joint projects such as the [Batam](/wiki/Batam) Industrial Park, [Bintan Resorts](/wiki/Bintan_Resorts), the Riau Water Agreement and the Air Combat Manoeuvring Range in Pekan Baru proceeded smoothly. Swift implementation of factory and hotel development proposals by foreign investors demonstrated Singapore's honesty and reliability to Suharto. #### United States In his book The *Singapore Story: Memoirs of Lee Kuan Yew*, Lee detailed an incident where in 1960, the CIA allegedly attempted to bribe certain members of his party, the PAP, in an attempt to create division and weaken his leadership, however the official had reported the bribery attempt instead of accepting the money. According to Lee, this was part of a broader strategy by the United States to influence the political landscape in Southeast Asia during the Cold War. He mentioned that he confronted the CIA's representative in Singapore and demanded an explanation and compensation for this interference. After having two CIA agents arrested, Lee requested 3.5 million dollars in [economic aid](/wiki/Economic_aid) in exchange for the covert release of the two agents. The Americans rejected this offer and presented a counter-offer of 3.3 million dollars to be given directly to Lee and the People's Action Party, but the men were later released without any financial exchange. However instead of taking a passive approach, Lee negotiated with the CIA and eventually the US government agreed to pay a sum of 3.3 million dollars in formal economic aid to Singapore, which Lee claimed was to ensure that the U.S. would not interfere in Singapore's internal affairs. Lee revealed this incident in 1965, which led to the Americans to deny it ever occurred; however, Lee later made public a letter of apology from the US Secretary of State [Dean Rusk](/wiki/Dean_Rusk) over the incident. Lee fully supported the US involvement in the [Vietnam War](/wiki/Vietnam_War). Even as the war began to lose its popularity in the United States, Lee made his first official visit to the United States in October 1967, and declared to President [Lyndon B. Johnson](/wiki/Lyndon_B._Johnson) that his support for the war in Vietnam was \"unequivocal\". Lee saw the war as necessary for states in Southeast Asia like Singapore to buy time for stabilising their governments and economies. Lee cultivated close relationships with presidents [Richard Nixon](/wiki/Richard_Nixon) and [Ronald Reagan](/wiki/Ronald_Reagan), as well as former secretaries of state [Henry Kissinger](/wiki/Henry_Kissinger) and [George Shultz](/wiki/George_Shultz). In 1967 Nixon, who was running for president in 1968, visited Singapore and met with Lee, who advised that the United States had much to gain by engaging with China, culminating in [Richard Nixon's 1972 visit to China](/wiki/Richard_Nixon%27s_1972_visit_to_China). In the 1980s, closer defence relations between Singapore and the United States enabled Singapore to acquire advanced American weapon platforms and capabilities. The United States provided Singapore with aircraft such as the [F-16](/wiki/General_Dynamics_F-16_Fighting_Falcon) and the [E-2C](/wiki/Northrop_Grumman_E-2_Hawkeye) [airborne early warning](/wiki/Airborne_early_warning_and_control) (AEW) to strengthen its air defences. In October 1985, Lee made a state visit to the United States on the invitation of President Reagan and addressed a [joint session of the United States Congress](/wiki/Joint_session_of_the_United_States_Congress). Lee stressed to Congress the importance of free trade and urged it not to turn towards protectionism: > It is inherent in America's position as the preeminent economic, political and military power to have to settle and uphold the rules for orderly change and progress... In the interests of peace and security America must uphold the rules of international conduct which rewards peaceful cooperative behaviour and punishes transgressions of the peace. A replay of the depression of the 1930s, which led to World War II, will be ruinous for all. All the major powers of the West share the responsibility of not repeating this mistake. But America's is the primary responsibility, for she is the anchor economy of the free-market economies of the world. In May 1988, E. Mason \"Hank\" Hendrickson was serving as the First Secretary of the United States Embassy when he was expelled by the Singapore government. The Singapore government alleged that Hendrickson attempted to interfere in Singapore's internal affairs by cultivating opposition figures in a \"[Marxist conspiracy](/wiki/Operation_Spectrum)\". Then-First Deputy Prime Minister [Goh Chok Tong](/wiki/Goh_Chok_Tong) claimed that Hendrickson's alleged conspiracy could have resulted in the election of 20 or 30 opposition politicians to Parliament, which in his words could lead to \"horrendous\" effects, possibly even the paralysis and fall of the Singapore government. In the aftermath of Hendrickson's expulsion, the U.S. State Department praised Hendrickson's performance in Singapore and denied any impropriety in his actions. The State Department also expelled Robert Chua, a senior-level Singaporean diplomat equal in rank to Hendrickson, from Washington, D.C., in response. The State Department's refusal to reprimand Hendrickson, along with its expulsion of the Singaporean diplomat, sparked a rare protest in Singapore by the [National Trades Union Congress](/wiki/National_Trades_Union_Congress); they drove buses around the U.S. embassy, held a rally attended by four thousand workers, and issued a statement deriding the U.S. as \"sneaky, arrogant, and untrustworthy\". #### China Singapore did not establish diplomatic relations with China until the U.S. and Southeast Asia had decided they wanted to do so in order to avoid portraying a pro-China bias. His official visits to China starting in 1976 were conducted in English, to assure other countries that he represented Singapore, and not a \"Third China\" (the first two being the [Republic of China](/wiki/Republic_of_China) ([Taiwan](/wiki/Taiwan)) and [People's Republic of](/wiki/People%27s_Republic_of_China) [ [Mainland](/wiki/Mainland_China) ] [China](/wiki/China) ). In November 1978, after China had stabilised following political turmoil in the aftermath of [Mao Zedong](/wiki/Mao_Zedong)'s death and the [Gang of Four](/wiki/Gang_of_Four), [Deng Xiaoping](/wiki/Deng_Xiaoping) visited Singapore and met Lee. Deng, who was very impressed with Singapore's economic development, greenery and housing, and later sent tens of thousands of Chinese to Singapore and countries around the world to learn from their experiences and bring back their knowledge as part of the [reform and opening up](/wiki/Reform_and_opening_up) beginning in December 1978. Lee, on the other hand, advised Deng to stop exporting Communist ideologies to Southeast Asia, an advice that Deng later followed. This culminated in the exchange of Trade Offices between the two nations in September 1981. In 1985, commercial air services between mainland China and Singapore commenced and China appointed [Goh Keng Swee](/wiki/Goh_Keng_Swee), Singapore's finance minister in the post-independence years, as advisor on the development of [Special Economic Zones](/wiki/Special_economic_zones_of_China). On 3 October 1990, Singapore [revised](/wiki/Dates_of_establishment_of_diplomatic_relations_with_the_People%27s_Republic_of_China) [diplomatic relations](/wiki/Diplomacy) from the Republic of China to the People's Republic of China. #### United Kingdom Lee developed friendships with Prime Ministers [Harold Wilson](/wiki/Harold_Wilson) and [Margaret Thatcher](/wiki/Margaret_Thatcher). Lee regarded Wilson's support and swift recognition of Singapore's independence crucial to Singapore's survival in its early days. Singapore was still heavily dependent on Britain for its defence and economy, and the British military bases were contributing over 20 percent to Singapore's gross national product. About 15 per cent of Singapore's workforce had jobs linked to British military bases on the island. However, mounting economic problems in Britain led to a weakening faith in the pound sterling, and the Singapore Government began reducing its sterling holdings from about 90 percent to just 50 percent by November 1967, when the Labour government devaluated pound sterling. Chancellor of the Exchequer [Roy Jenkins](/wiki/Roy_Jenkins), in a letter to Goh Keng Swee, expressed his “regret that [Singapore] did not take [the UK] into their confidence” when diversifying out of Sterling. To which Goh retorted in reply that Singapore sustained losses of about US$157 million as a result of the pound's devaluation. No longer able to afford its military commitment in Southeast Asia, Britain announced in January 1968, the total withdrawal of its troops East of Suez, with the pullout from Malaysia and Singapore to be done by 31 March 1971 – four years earlier than planned. The announcement came as a shock to Singapore, because the British had earlier committed to a phased withdrawal. As the first batch of 900 national servicemen had just started their training on 17 August 1967, Singapore was ill-equipped to take up its own defence. It was projected that about 25,000 base workers in Singapore would be rendered unemployed in 1971 as a result of the military withdrawal. When informed of the decision, Lee's government responded with dismay and anger. Lee threatened to withdraw from the [sterling area](/wiki/Sterling_area), give the dockyards to the Japanese, and disrupt British shipping and trade. He also suggested that if the British forces withdrew too quickly, he would have to “hire mercenaries to defend Singapore”. Lee and Minister for Finance Goh Keng Swee left for London, meeting with British political leaders, rallying for support through television appearances. With intense lobbying by Lee and Goh, the Wilson government went ahead with withdrawal, but agreed to a compromise to extend the withdrawal deadline from March to December 1971. Lee successfully negotiated with the British for a soft loan of £50 million, free transfer of key assets, help with operating air defence systems, and training of military staff. Plans were set up to oversee the conversion and commercialisation of lands and facilities including the naval bases that had belonged to the British, which later proved instrumental in propelling Singapore's shipbuilding industry forward. Singapore acquired a squadron of British [Hawker Hunter](/wiki/Hawker_Hunter) planes for its new air force, arriving in Singapore in 1970. To make up for Britain's withdrawal, Singapore's military spending was tripled, and an air force and a navy were added to support the army. When Wilson's Labour government lost the 1970 election to the Conservatives under [Edward Heath](/wiki/Edward_Heath), the new Conservative government facilitated the [Five Power Defence Arrangements](/wiki/Five_Power_Defence_Arrangements), comprising the United Kingdom, Australia, New Zealand, Malaysia and Singapore, to give a deterrent message that any attack on Singapore or Malaysia would lead to a potential intervention of British, Australian and New Zealand forces. Although most of the British troops had withdrawn from Singapore by October 1971, a small contingent of British, Australian and New Zealand forces stayed on as a token military presence. The last British soldier left Singapore in March 1976. Lee and Thatcher, who became Britain's prime minister in 1979, admired each other's leadership qualities and had \"ideological convergence\" in policies like cracking down on trade union power, privatisation, low taxation and trimming the excesses of the welfare state. Lee also advised Thatcher while Britain was negotiating with China on the [handover of Hong Kong](/wiki/Handover_of_Hong_Kong). #### Australia Australia, under Prime Minister [Robert Menzies](/wiki/Robert_Menzies) was one of the first countries to recognise Singapore's independence. However, Lee would later clash with Australian leaders [John Gorton](/wiki/John_Gorton) and [Gough Whitlam](/wiki/Gough_Whitlam) who were inclined to pull Australia back from the Five Power Defence Arrangement (FPDA). Lee clashed fiercely with Whitlam. Whitlam was initially reluctant to take too many of the Vietnamese boat people and tried to make Singapore take the first refugees from the Vietnam War. Lee retorted that Whitlam ‘a very sympathetic Prime Minister who believes the White Australia policy is most deplorable and damnable and here is his chance.’ Lee criticised Whitlam's pro-Asian rhetoric as political posturing because of his stance on the Vietnam boat refugees, and blocking Asian imports into Australia. In his memoirs, Lee wrote of his verbal jousts with Whitlam at Commonwealth meetings. Lee called Whitlam ‘quick-witted but also quick-tempered’, and was glad to see the end of the ‘acerbic’ Whitlam, calling it ‘a relief when their Governor-General removed Whitlam…’. Singapore-Australia relations improved with Whitlam's successor, [Malcolm Fraser](/wiki/Malcolm_Fraser). Lee held him in high regard for his support in confronting communism and defending the FPDA. However, he urged Fraser to reform the Australian economy, prompting the famous remark from Lee that Australia was in danger of becoming the \"poor white trash of Asia\" if it did not open up its economy. The comments were widely circulated in Australian political circles. [Bob Hawke](/wiki/Bob_Hawke), who led the Labor party to a victory over Fraser in 1983, said \"I thought [Lee] was right, and his harsh but fair comment helped galvanise my determination to undertake the reforms that would save us from that fate and set us on a better path.\" Upon Lee's death, Hawke said \"Lee Kuan Yew was a great friend of Australia, if at times an outspoken one\". Singapore was Australia's strongest backer within ASEAN in the effort to create [APEC](/wiki/APEC) in 1989. #### Cambodia Lee opposed the Vietnamese invasion of Cambodia in 1978. The Singapore government organised an international campaign to condemn Vietnam and provided aid to the [Khmer Rouge](/wiki/Khmer_Rouge) which was fighting against Vietnamese occupation during the [Cambodian–Vietnamese War](/wiki/Cambodian%E2%80%93Vietnamese_War) from 1978 to 1989. In his memoirs, Lee recounted that in 1982, \"Singapore gave the first few hundreds of several batches of [AK-47](/wiki/AK-47) rifles, hand grenades, ammunition and communication equipment\" to the Khmer Rouge resistance forces. ## Senior Minister (1990–2004) After leading the [PAP](/wiki/People%27s_Action_Party) to victory in seven elections, Lee stepped down on 28 November 1990, handing over the [prime ministership](/wiki/Prime_Minister_of_Singapore) to [Goh Chok Tong](/wiki/Goh_Chok_Tong). By that time, he had become the world's longest-serving prime minister. This was the first leadership transition since independence. Goh was elected as the new prime minister by the younger ministers then in office. When Goh Chok Tong became head of government, Lee remained in the cabinet with a non-executive position of [Senior Minister](/wiki/Senior_Minister_of_Singapore) and played a role he described as advisory. Lee subsequently stepped down as [secretary-general](/wiki/Secretary_(title)) of the PAP and was succeeded by Goh Chok Tong on 2 December 1992. ### Condominium rebates In April 1996, Lee and his son, [Lee Hsien Loong](/wiki/Lee_Hsien_Loong), disclosed that they had [purchased apartments](/wiki/1995_Hotel_Properties_Limited_apartment_sales) located at Nassim Jade and Scotts 28 from Hotel Properties Ltd, a real estate developer listed on the Stock Exchange of Singapore, at substantial discounts ranging from 5 to 12 per cent. The dispute arose amidst rampant property speculation in Singapore. Upon learning of the issue, Prime Minister Goh Chok Tong swiftly initiated an immediate investigation into the matter. While Singapore law permits the provision of special discounts or rebates to relatives and associates of directors, it is imperative that such transactions receive approval from shareholders. This disclosure prompted sufficient public disquiet for Lee to appear before Parliament to explain the purchases. Lee said that as he was a prominent figure, the developer had a \"legitimate incentive\" to provide discounts for publicity, and that he had previously purchased a car and acquired services from his tailor and cobbler at a discount. The amount saved was donated to charity. ## Minister Mentor (2004–2011) In December 2004, Lee stepped down to become Minister Mentor. Expressing concern about the declining proficiency of [Mandarin](/wiki/Singaporean_Mandarin) among younger [Chinese Singaporeans](/wiki/Chinese_Singaporeans), he started a year-long campaign called \"华语 Cool!\" (Mandarin is Cool!) to garner interest in using Mandarin. On 13 September 2008, Lee underwent treatment for abnormal heart rhythm ([atrial flutter](/wiki/Atrial_flutter)) at [Singapore General Hospital](/wiki/Singapore_General_Hospital). The treatment was successful, and he was well enough to address a philanthropy forum via video link from the hospital. On 28 September 2010, he was hospitalised for a chest infection, cancelling plans to attend the wake of the Senior Minister of State for Foreign Affairs, [Balaji Sadasivan](/wiki/Balaji_Sadasivan). In November 2010, Lee's private conversations with [James Steinberg](/wiki/James_Steinberg), [US Deputy Secretary of State](/wiki/United_States_Deputy_Secretary_of_State), on 30 May 2009 were among the [leaked US Embassy cables](/wiki/United_States_diplomatic_cables_leak). In a US Embassy report classified as \"Secret\", Lee gave his assessment of a number of Asian leaders and views on political developments in North Asia, including implications for nuclear proliferation. In January 2011, the Straits Times Press published the book *Lee Kuan Yew: Hard Truths To Keep Singapore Going*. Targeted at younger Singaporeans, it was based on 16 interviews with Lee by seven local journalists in 2008–2009. The first print run of 45,000 copies sold out in less than a month after it was launched in January 2011. Another batch of 55,000 copies was made available shortly after. After the [2011 general elections](/wiki/2011_Singaporean_general_election) in which the [Workers' Party](/wiki/Workers%27_Party_(Singapore)), a major opposition political party in Singapore, made unprecedented gains by winning a [Group Representation Constituency](/wiki/Group_representation_constituency) (GRC), Lee announced that he decided to leave the Cabinet for his son, Prime Minister [Lee Hsien Loong](/wiki/Lee_Hsien_Loong), and his team to have a clean slate. Some analysts, such as [Citigroup](/wiki/Citigroup) economist Kit Wei Zheng, believed that the senior Lee had contributed to the PAP's poor performance. In particular, he stated during campaigning that the voters of Aljunied constituency had \"five years to live and repent\" if they elected the [Workers' Party](/wiki/Workers%27_Party_(Singapore)), which some viewed as having backfired for the PAP as the opposition went on to win Aljunied. In a column in the *Sunday Times* on 6 November 2011, Lee's daughter, Lee Wei Ling, revealed that her father had [peripheral neuropathy](/wiki/Peripheral_neuropathy). In the column, she recounted how she first noticed her father's ailments when she accompanied him to meet the former US Secretary of State [Henry Kissinger](/wiki/Henry_Kissinger) in [Connecticut](/wiki/Connecticut) in October 2009. Wei Ling, a neurologist, \"did a few simple neurological tests and decided the nerves to his legs were not working as they should\". A day later, when interviewed at a constituency tree-planting event, Lee stated: \"I have no doubt at all that this has not affected my mind, my will nor my resolve\" and that \"people in wheel chairs can make a contribution. I've still got two legs, I will make a contribution\". ## Illness and death On 15 February 2013, Lee was admitted to [Singapore General Hospital](/wiki/Singapore_General_Hospital) following a prolonged [cardiac dysrhythmia](/wiki/Arrhythmia), which was followed by a brief stoppage of blood flow to the brain. For the first time in his career as a Member of Parliament (MP), Lee missed the annual Chinese New Year dinner at his [constituency](/wiki/Tanjong_Pagar_GRC), where he was supposed to be the guest-of-honour. He was subsequently discharged, but continued to receive [anti-coagulant](/wiki/Anticoagulant) therapy. The following year, Lee missed his constituency's Chinese New Year dinner for the second consecutive time owing to bodily bacterial invasion. In April 2014, a photo depicting a thin and frail Lee was released online, drawing strong reactions from netizens. According to Lee's daughter, Lee Wei Ling, Lee had discussed [euthanasia](/wiki/Euthanasia) which is not a legal option in Singapore. On 5 February 2015, Lee was hospitalised for [pneumonia](/wiki/Pneumonia) and was put on a ventilator at the intensive care unit of Singapore General Hospital, although his condition was reported initially as \"stable\". A 26 February update stated that he was again being given antibiotics, while being sedated and still under mechanical ventilation. From 17 to 22 March, Lee continued weakening as he developed an infection while on life support, and he was described as \"critically ill\". On 18 March that year, a [death hoax](/wiki/Death_hoax) website reported false news of Lee's death. The suspect is an unidentified minor who created a false webpage that resembled the PMO official website. Several international news organisations reported on Lee's death based on this and later retracted their statements. On 23 March 2015, Singapore Prime Minister [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) announced his father's death at the age of 91. Lee had died at 03:18 [Singapore Standard Time](/wiki/Singapore_Standard_Time) (UTC+08:00). A week of national mourning took place, during which time Lee was [lying in state](/wiki/Lying_in_state) at [Parliament House](/wiki/Parliament_House,_Singapore). As a mark of respect, State flags at all Government buildings were flown at [half-mast](/wiki/Half-mast). During this time, 1.7 million Singaporean residents as well as world leaders paid tribute to him at Parliament house and community tribute sites throughout the country. A [state funeral](/wiki/State_funeral) for Lee was held on 29 March and attended by world leaders. Later that day, Lee was [cremated](/wiki/Cremation) in a private ceremony at the [Mandai Crematorium](/wiki/Mandai_Crematorium_and_Columbarium). ## Legacy > I'm not saying that everything I did was right, but everything I did was for an honourable purpose. I had to do some nasty things, locking fellows up without trial. Lee in 2010 during an interview with Seth Mydans of the *[New York Times](/wiki/New_York_Times)* and the former *[International Herald Tribune](/wiki/International_Herald_Tribune)*, reflecting on his legacy during his premiership As prime minister from 1959 to 1990, Lee presided over many of Singapore's advancements. He oversaw Singapore's transformation from an island nation with a high [illiteracy rate](/wiki/Literacy) and no [natural resources](/wiki/Natural_resource) into a [developed country](/wiki/Developed_country) with a [high-income](/wiki/World_Bank_high-income_economy) economy within a single generation, commonly termed (from his autobiography) as 'From the third world to the first world'. Singapore's [gross national product](/wiki/Gross_national_product) per capita (GNP) rose from $1,240 in 1959 to $18,437 in 1990. The unemployment rate in Singapore dropped from 13.5% in 1959 to 1.7% in 1990. [External trade](/wiki/International_trade) increased from $7.3 billion in 1959 to $205 billion in 1990. In other areas, the [life expectancy](/wiki/Life_expectancy) at birth for Singaporeans rose from 65 years in 1960 to 74 years in 1990. The [population of Singapore](/wiki/Demographics_of_Singapore#Population) increased from 1.6 million in 1959 to 3 million in 1990. The number of [public flats in Singapore](/wiki/Public_housing_in_Singapore) rose from 22,975 in 1959 (then under the [Singapore Improvement Trust](/wiki/Singapore_Improvement_Trust)) to 667,575 in 1990. The Singaporean [literacy](/wiki/Literacy) rate increased from 52% in 1957 to 90% in 1990. [Telephone lines](/wiki/Telecommunications_in_Singapore#Telephones) per 100 Singaporeans increased from 3 in 1960 to 38 in 1990. Visitor arrivals to Singapore rose from 100,000 in 1960 to 5.3 million in 1990. These economic accomplishments were achieved in large part due to Lee's [stewardship](/wiki/Stewardship) of [public administration](/wiki/Public_administration) through relevant and targeted [public policy](/wiki/Public_policy); Lee introduced measures to jumpstart manufacturing of [finished goods](/wiki/Finished_goods) for export ([export-oriented industrialisation](/wiki/Export-oriented_industrialisation)) and sought to create a conducive business environment in the [trading nation](/wiki/Trading_nation) to attract [foreign direct investment](/wiki/Foreign_direct_investment) (through the establishment of the [Economic Development Board](/wiki/Economic_Development_Board), EDB). Lee also forged a symbiotic and mutually dependent relationship between the PAP and the national trade union, the [National Trades Union Congress](/wiki/National_Trades_Union_Congress) (NTUC), whereby the PAP receives a degree of [grassroots](/wiki/Grassroots) labour input, whilst NTUC is led by prominent PAP politicians who usually have ministerial portfolios within the [Government](/wiki/Government_of_Singapore). The Government's tight control over trade union activities and [industrial relations](/wiki/Industrial_relations) ensured near-total industrial peace, which was assessed to be a prerequisite for rapid [economic development](/wiki/Economic_development). Lee was a staunch promoter of [economic globalisation](/wiki/Economic_globalisation) and a vocal opponent of [protectionism](/wiki/Protectionism). Lee said that Singapore's only natural resources are its people and their strong work ethic. In addition, Lee was focused on social policies such as improving and mandating higher public [standards](/wiki/Standard_of_living) for education, [sanitation](/wiki/Sanitation) and [hygiene](/wiki/Hygiene), whilst concurrently improving [public health](/wiki/Public_health) by expanding modern health care and greatly increasing the quantity and quality of [high-rise](/wiki/High-rise_building) [affordable housing](/wiki/Affordable_housing) (through the establishment of the [Housing and Development Board](/wiki/Housing_and_Development_Board), HDB) for [working-](/wiki/Working-class) and middle-class families. Various world leaders have praised Lee's governance and political achievements. British Foreign Secretary [George Brown](/wiki/George_Brown_(British_Labour_politician)) called Lee \"the best bloody Englishman east of Suez\". Former U.S. Secretary of State [Henry Kissinger](/wiki/Henry_Kissinger) once wrote of Lee: \"One of the asymmetries of history is the lack of correspondence between the abilities of some leaders and the power of their countries.\" Former British prime minister [Margaret Thatcher](/wiki/Margaret_Thatcher) praised \"his way of penetrating the fog of propaganda and expressing with unique clarity the issues of our time and the way to tackle them\". Former [president of Kazakhstan](/wiki/President_of_Kazakhstan) [Nursultan Nazarbayev](/wiki/Nursultan_Nazarbayev) stated in his memoirs that after the [independence](/wiki/Independence_Day_(Kazakhstan)) of [Kazakhstan](/wiki/Kazakhstan) from the [Soviet Union](/wiki/Soviet_Union) in 1991, he met Lee and stated Lee's \"observations and advice became for us [Kazakhstan] guidelines in the development of long-term state strategies.\" Lee's achievements in Singapore were a major source of inspiration on [Communist leadership in China](/wiki/Politburo_Standing_Committee_of_the_Chinese_Communist_Party), who made a major effort, especially under [Deng Xiaoping](/wiki/Deng_Xiaoping), to emulate his policies of economic growth, [entrepreneurship](/wiki/Entrepreneurship) and [suppression of dissent](/wiki/Dissent). From 1996 to 2019, 55,000 Chinese officials were sent to Singapore to study its methods. He has also had a major influence on thinking in Russia in recent years. On the other hand, proponents of [liberal democracy](/wiki/Liberal_democracy) especially in the West criticised Lee's rule as authoritarian and as intolerant of dissent, citing his numerous attempts to sue political opponents and newspapers who express unfavourable opinions of Lee. [Reporters Without Borders](/wiki/Reporters_Without_Borders), an international media [advocacy group](/wiki/Advocacy_group), requested Lee and other senior Singaporean officials to stop taking libel suits against journalists. Lee was a co-inventor of \"[Asian values](/wiki/Asian_values)\". Lee was criticised for curtailing [press freedoms](/wiki/Freedom_of_the_press), often imposing limits on public protests which prevented further occurrences, restricting [labour movements](/wiki/Labour_movement) from [industrial action](/wiki/Industrial_action) or strike action, suppressing [wage growth](/wiki/Wage_growth) of [skilled workers](/wiki/Skilled_worker) (in order to be competitive with [developing countries](/wiki/Developing_country)) amid widening and [high levels](/wiki/List_of_countries_by_income_equality) of [income inequality](/wiki/Economic_inequality) along with [wealth inequality](/wiki/Distribution_of_wealth) (relative to other [developed countries](/wiki/Developed_country)), had encouraged an [elitist](/wiki/Elitist) mindset as well as filing [defamation](/wiki/Defamation) lawsuits against prominent [political opponents](/wiki/Political_libel). However, supporters argued in retrospect that his actions were necessary for the country's early development, and various international political analysts note that Lee's [governance](/wiki/Governance) was generally [pragmatic](/wiki/Pragmatism) and [benevolent](/wiki/Benevolent_dictatorship).[*better source needed*] During the three decades in which Lee held office, Singapore grew from a [developing country](/wiki/Developing_country) to one of the most [developed nations](/wiki/Developed_country) in Asia and the world. Singapore was described as an [illiberal democracy](/wiki/Illiberal_democracy) and a [nanny state](/wiki/Nanny_state) under his rule. ## Legal suits ### Action against *Far Eastern Economic Review* In April 1977, just months after a [general election](/wiki/1976_Singaporean_general_election) which saw the People's Action Party winning all 69 seats, the [Internal Security Department](/wiki/Internal_Security_Department_(Singapore)), under orders from Lee, detained [Ho Kwon Ping](/wiki/Ho_Kwon_Ping), the Singapore correspondent of the *[Far Eastern Economic Review](/wiki/Far_Eastern_Economic_Review)*, as well as his predecessor Arun Senkuttavan, over their reporting. Ho was detained under the [Internal Security Act](/wiki/Internal_Security_Act_(Singapore)) which allows for indefinite trial, held in solitary confinement for two months, and charged with endangering national security. Following a televised confession in which Ho confessed to \"pro-communist activities\", he was fined $3,000. Lee Kuan Yew later charged *FEER* editor, Derek Davies, of participating in \"a diabolical international Communist plot\" to poison relations between Singapore and neighbouring Malaysia. In 1987 Lee restricted sale of the *Review* in Singapore after it published an article about the [detention of Roman Catholic church workers](/wiki/Operation_Spectrum), reducing circulation of the magazine from 9,000 to 500 copies, on the grounds that it was \"interfering in the domestic politics of Singapore.\" On 24 September 2008 the [High Court of Singapore](/wiki/High_Court_of_Singapore), in a [summary judgment](/wiki/Summary_judgment) by Justice [Woo Bih Li](/wiki/Woo_Bih_Li), ruled that the *[Far Eastern Economic Review](/wiki/Far_Eastern_Economic_Review)* magazine (Hugo Restall, editor), defamed Lee and his son, the prime minister, [Lee Hsien Loong](/wiki/Lee_Hsien_Loong). The court found the 2006 article \"Singapore's 'Martyr': [Chee Soon Juan](/wiki/Chee_Soon_Juan)\" suggested that Lee \"ha[d] been running and continue[d] to run Singapore in the same corrupt manner as [Durai](/wiki/T.T_Durai) operated [[the National Kidney Foundation]](/wiki/National_Kidney_Foundation_Singapore) and he ha[d] been using libel actions to suppress those who questioned [him] to avoid exposure of his corruption\". The court ordered the Review, owned by [Dow Jones & Company](/wiki/Dow_Jones_%26_Company) (in turn owned by [Rupert Murdoch](/wiki/Rupert_Murdoch)'s News Corp), to pay damages to the complainants. The magazine appealed but lost. ### Action against J.B. Jeyaretnam Lee commenced proceedings for [slander](/wiki/Slander) against opposition leader [J. B. Jeyaretnam](/wiki/J._B._Jeyaretnam) for comments he made at a [Workers' Party](/wiki/Workers%27_Party_(Singapore)) rally in the [1988 general election](/wiki/1988_Singaporean_general_election). Lee alleged that Jeyaretnam's speech at the rally implied he had tried to cover up the corruption of the former [Minister for National Development](/wiki/Ministry_of_National_Development_(Singapore)), [Teh Cheang Wan](/wiki/Teh_Cheang_Wan), by aiding and abetting his suicide. The action was heard by Justice [Lai Kew Chai](/wiki/Lai_Kew_Chai), who ruled against Jeyaretnam and ordered him to pay damages of S$260,000 plus costs to Lee. Jeyaretnam lost an appeal against the judgment. ### Action against Devan Nair In 1999, former [president of Singapore](/wiki/President_of_Singapore) [Devan Nair](/wiki/Devan_Nair), who was living in Canada, remarked in an interview with the [Toronto](/wiki/Toronto)-based *[The Globe and Mail](/wiki/The_Globe_and_Mail)* that Lee's technique of suing his opponents into bankruptcy or oblivion was an abrogation of political rights. Nair also described Lee as \"an increasingly self-righteous know-all\" surrounded by \"department store dummies\". In response to these remarks, Lee sued Nair in a Canadian court and Nair countersued. Lee then brought a motion to have Nair's counterclaim thrown out of court, argued that it disclosed no reasonable cause of action and constituted an inflammatory attack on the integrity of the [Singaporean government](/wiki/Singaporean_government). However, the [Ontario Superior Court of Justice](/wiki/Ontario_Superior_Court_of_Justice) refused to throw out the counterclaim, holding that Nair had a reasonable cause of action as Lee had abused the process of litigation. Lee wrote in one of his memoirs that Nair was forced to resign as president due to his alleged [alcoholism](/wiki/Alcoholism), a charge which Nair denied. ### *International Herald Tribune* defamation case In 2010 Lee, together with his son Lee Hsien Loong, and Goh Chok Tong, threatened legal action against [The New York Times Company](/wiki/The_New_York_Times_Company), which owns the *[International Herald Tribune](/wiki/International_Herald_Tribune)*, regarding an op-ed piece titled \"All in the Family\" of 15 February 2010 by [Philip Bowring](/wiki/Philip_Bowring), a freelance columnist and former editor of the *[Far Eastern Economic Review](/wiki/Far_Eastern_Economic_Review)*. The *[International Herald Tribune](/wiki/International_Herald_Tribune)* apologised in March that readers of the article may \"infer that the younger Lee did not achieve his position through merit\". The New York Times Company and Bowring also agreed to pay S$60,000 to Lee Hsien Loong, S$50,000 to Lee and S$50,000 to Goh (totalling about US$114,000 at the time), in addition to legal costs. The case stemmed from a 1994 settlement between the three Singaporean leaders and the paper about an article, also by Bowring, that referred to \"dynastic politics\" in East Asian countries, including Singapore. In that settlement, Bowring agreed not to say or imply that the younger Lee had attained his position through nepotism by his father Lee Kuan Yew. In response, media-rights watchdog [Reporters Without Borders](/wiki/Reporters_Without_Borders) wrote an open letter to urge Lee and other top officials of the Singapore government to stop taking \"libel actions\" against journalists. ## Political positions ### Criticism of Chinese marginalisation On 15 September 2006, at the Raffles Forum hosted by the [School of Public Policy](/wiki/Lee_Kuan_Yew_School_of_Public_Policy), Lee made a remark as to how the \"Malaysian and Indonesian governments systematically marginalise its Chinese people\", by bringing up topics such as the [May 1998 riots of Indonesia](/wiki/May_1998_riots_of_Indonesia) and *[Ketuanan Melayu](/wiki/Ketuanan_Melayu)*, which subsequently caused a short diplomatic spat. He then described the systematic marginalisation of the Chinese in Malaysia, which aroused a strong response from the Malaysian government. Politicians in Malaysia and Indonesia expressed dissatisfaction with this and demanded the Singaporean government explain and apologise for Lee's remarks. Former Malaysian prime minister [Mahathir Mohamad](/wiki/Mahathir_Mohamad) criticised Lee Kuan Yew for his \"arrogance and disrespect\" for neighbouring countries and countered that Malaysia could also question Singapore's marginalisation of its local Malays and other minorities such as the Eurasians and Indians. Former Indonesian president [B. J. Habibie](/wiki/B._J._Habibie) also described the \"[little red dot](/wiki/Little_red_dot)\" term in reference to Singapore as an incentive for Indonesian youth to learn from Singapore's achievements, and that the original intention was distorted. On 30 September, while Lee Kuan Yew apologised to the Malaysian prime minister at the time [Abdullah Badawi](/wiki/Abdullah_Ahmad_Badawi) for his remarks, he did not fully retract his remarks. ### Eugenics Lee expressed views that have been characterised as pro-[eugenics](/wiki/Eugenics). He maintained that the educational background and intelligence of parents played a decisive role in shaping the abilities of their children, and he promoted policies designed to encourage highly educated women to have more children. Concerned by the sharp decline in Singapore's [total fertility rate](/wiki/Total_fertility_rate) (TFR), Lee introduced the \"Graduate Mothers' Scheme\" in 1983, which offered tax incentives for children born to women with university degrees and gave priority in primary school admissions to the children of graduate mothers with three or more offspring. In his speech at the 1983 [National Day Rally](/wiki/National_Day_Rally), Lee stated that if women graduates \"were not in the breeding pool\", society might become more \"stupid\" and that \"there will be less bright people to support dumb people in the next generation.\" In June 1984, Lee's government introduced grants for low-income and low-education women to undergo [sterilisation](/wiki/Sterilization_(medicine)). Women whose husbands and themselves lacked passes at the [Singapore-Cambridge GCE Ordinary Level](/wiki/Singapore-Cambridge_GCE_Ordinary_Level) and had fewer than three children could receive a $10,000 grant for sterilisation. Sterilised lower-class parents were also given priority in [primary school](/wiki/Education_in_Singapore#Primary_education) admission for their existing first and second children. The controversy surrounding the proposal contributed to a 12.9 per cent swing against the PAP in the [general election later that year](/wiki/1984_Singaporean_general_election), although the party still secured 64 per cent of the popular vote and the vast majority of seats. By 1985, particularly contentious aspects of the policy, such as granting education and housing advantages to educated women, were either abandoned or modified. A proponent of [nature over nurture](/wiki/Nature_versus_nurture), Lee asserted that \"[intelligence is 80% nature and 20% nurture](/wiki/Heritability_of_IQ)\" and attributed the achievements of his children to genetics. ### Islam In 1999, in a discussion forum, Lee was asked whether the emotional bonds of various ethnic groups in Singapore could be a hurdle to nation building, Lee replied by alluding that an ethnic Malay and highly religious officer of the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces) (SAF) might be hesitant to engage against an hypothetical war with Singapore's direct neighbours such as Malaysia. In 2011, [leaked diplomatic cables](/wiki/United_States_diplomatic_cables_leak) attributed to Lee some controversial comments regarding [Islam](/wiki/Islam). The cables quoted Lee as having described Islam as a \"venomous religion\". Lee called the remarks \"false\" and looked up to the [Ministry of Foreign Affairs](/wiki/Ministry_of_Foreign_Affairs_(Singapore)) (MFA)'s filenote of the meeting and found no record of the claim, stating that he was referring to extremists such as the [Jemaah Islamiyah](/wiki/Jemaah_Islamiyah) (JI). He added that he recognises that Muslims in Singapore are largely rational and that one of the solutions to extremism was to give \"moderate Muslims the courage to stand up and speak out against radicals who hijacked Islam to recruit volunteers for their violent ends\". In his book *Lee Kuan Yew: Hard Truths to Keep Singapore Going*, Lee stated that Singaporean Muslims faced difficulties in integrating because of their religion and urged them to \"be less strict on Islamic observances\". His remarks drew fire from Malay–Muslim leaders and MPs in Singapore, prompting a strong reaction from his son [Lee Hsien Loong](/wiki/Lee_Hsien_Loong), the Prime Minister at that time, who said his views differs from his father and that he values and respects the Malay–Muslim community \"who have done a good deal to strengthen our harmony and social cohesion.\" Lee Kuan Yew eventually made a further comment that his comment was \"out of date\" and that he recognises the efforts made by Muslims to integrate with the other communities. ### Homosexuality [Section 377A](/wiki/Section_377A_(Singapore)) of the [Penal Code](/wiki/Penal_Code_(Singapore)), which was first introduced in 1938 under British colonial rule that criminalised sex between adult males, remained enforced under Lee's premiership. In his later years, Lee appeared to become more supportive of LGBTQ+ issues and rights, expressing a belief that [homosexuality was genetic](/wiki/Biology_and_sexual_orientation) and questioning the rationale behind its criminalisation. In 2007, he believed that homosexuality would eventually be accepted in Singapore, but advocated for a measured and \"pragmatic approach\" toward the matter \"to maintain social cohesion.\" Section 377A was eventually repealed in 2022. ### Corporal punishment One of Lee's abiding beliefs was in the efficacy of [corporal punishment](/wiki/Corporal_punishment) in the form of [caning](/wiki/Caning). In his autobiography *The Singapore Story*, Lee described his time at [Raffles Institution](/wiki/Raffles_Institution) in the 1930s, mentioning that he was often caned there for chronic lateness by the then headmaster, D. W. McLeod. He added that he never understood why Western educationists were so much against corporal punishment as \"it did my fellow students and me no harm\". Lee's government inherited [judicial corporal punishment](/wiki/Judicial_corporal_punishment) from British rule, but greatly expanded its scope. Under the British, it had been used as a penalty for offences involving personal violence, amounting to a handful of caning sentences per year. The PAP government under Lee extended its use to an ever-expanding range of crimes. By 1993, it was mandatory for 42 offences and optional for a further 42. Those routinely ordered by the courts to be caned now include drug addicts and illegal immigrants. From 602 canings in 1987, the figure rose to 3,244 in 1993 and to 6,404 in 2007. In 1994, judicial caning was publicised in the rest of the world when an American teenager, [Michael P. Fay](/wiki/Michael_P._Fay), was caned under the vandalism legislation. [School corporal punishment](/wiki/School_corporal_punishment) (for male students only) was likewise inherited from the British, and is still in use in schools, permitted under legislation from 1957. Lee also introduced caning in the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces), and Singapore is one of the few countries in the world where corporal punishment is an official penalty in military discipline. ### Press In his interview with [Charlie Rose](/wiki/Charlie_Rose) in October 2000, when asked whether he believed in the idea of a free press, Lee responded \"I believe in truth\" and \"I don't believe that the press should be crusading and putting a spin on things\" and asserted that newspapers should keep news reporting and editorials separate. ### Immigration Lee believed that the benefits of immigration had to be carefully balanced against the associated \"social load\". In a speech he made in 1971, Lee explained that it was necessary to have non-Singapore workers take up jobs that Singaporeans were not willing to do, but observed that it was important that the number of such migrant workers be carefully controlled because \"[t]hey dirty the place... they litter... if you take too many... they will bring us down to their values because it's easier to be untidy, scruffy, dirty, anti-social than to be disciplined, well-behaved and a good citizen\". ## Personal life Lee and his wife, [Kwa Geok Choo](/wiki/Kwa_Geok_Choo), were married on 30 September 1950. Both spoke English as their [first language](/wiki/First_language). Lee first started learning Chinese in 1955, at the age of 32. During [World War II](/wiki/World_War_II), he learned the Japanese language to help him survive, and worked as a Japanese translator during the [Japanese occupation of Singapore](/wiki/Japanese_occupation_of_Singapore). Lee and Kwa have two sons and a daughter. His elder son, [Lee Hsien Loong](/wiki/Lee_Hsien_Loong), was the third prime minister of Singapore. Several members of the [Lee family](/wiki/Lee_family_(Singapore)) hold prominent positions in the Singapore society. His younger son [Lee Hsien Yang](/wiki/Lee_Hsien_Yang) was president and CEO of [SingTel](/wiki/Singtel), and Chairman of the [Civil Aviation Authority of Singapore](/wiki/Civil_Aviation_Authority_of_Singapore) (CAAS). Lee's daughter [Lee Wei Ling](/wiki/Lee_Wei_Ling), a neurologist and epileptologist, was director of the [National Neuroscience Institute](/wiki/SingHealth#National_Neuroscience_Institute). Lee's daughter-in-law [Ho Ching](/wiki/Ho_Ching) was executive director and CEO of [Temasek Holdings](/wiki/Temasek_Holdings). His wife Kwa Geok Choo died on 2 October 2010, at the age of 89. Lee had variously described himself as an [agnostic](/wiki/Agnostic) and a \"nominal Buddhist\". He also mentioned that he was brought up in a family which practiced [Chinese ancestor worship](/wiki/Ancestor_veneration_in_China) but stopped after his father died, and that he \"neither [denies] nor [accepts] that there is a God\". In his later years, Lee practised meditation under the tutelage of [Benedictine](/wiki/Benedictines) monk [Laurence Freeman](/wiki/Laurence_Freeman), director of the [World Community for Christian Meditation](/wiki/World_Community_for_Christian_Meditation). Lee was diagnosed with dyslexia in adulthood. Lee was a founding member of the [Fondation Chirac](/wiki/Fondation_Chirac)'s honour committee, which was launched by former French president [Jacques Chirac](/wiki/Jacques_Chirac) to promote world peace. He was also a member of [David Rockefeller](/wiki/David_Rockefeller)'s \"International Council\", which included [Henry Kissinger](/wiki/Henry_Kissinger), [Riley P. Bechtel](/wiki/Riley_P._Bechtel), [George Shultz](/wiki/George_Shultz) and others. Additionally, he was one of the \"Forbes' Brain Trust\", along with [Paul Johnson](/wiki/Paul_Johnson_(writer)) and [Ernesto Zedillo](/wiki/Ernesto_Zedillo). ## Cultural depictions In 1979, oil painter [Chua Mia Tee](/wiki/Chua_Mia_Tee) depicted Lee's return from London after the [Merdeka Talks](/wiki/Merdeka_Talks). In the early 1980s, Lee agreed to have a sculpture and oil painting of him done, on the condition that they not be exhibited in his lifetime. The works, respectively by British sculptor [Sydney Harpley](/wiki/Sydney_Harpley) and American portrait painter Marion Pike, were commissioned by a group of Singaporeans, including first Chief Minister [David Marshall](/wiki/David_Marshall_(Singaporean_politician)). They are now part of the [National Heritage Board](/wiki/National_Heritage_Board_(Singapore))'s national collection, but only the bronze bust has gone on public display, briefly at the [Istana](/wiki/The_Istana) and [Parliament House](/wiki/Parliament_House,_Singapore). An artist's proof of the sculpture was exhibited in 2025. In 1991, Chua Mia Tee presented an oil painting of Lee to the Minister himself, depicting him against a backdrop of Singapore's transformation. The untitled painting was commissioned by fifth president [Ong Teng Cheong](/wiki/Ong_Teng_Cheong). In 1992, artist [Lai Kui Fang](/wiki/Lai_Kui_Fang) presented historical oil paintings of Lee's 1959 swearing-in ceremony as prime minister, which are now part of the [National Museum of Singapore](/wiki/National_Museum_of_Singapore)'s collection. Also in 1992, watercolourist [Ong Kim Seng](/wiki/Ong_Kim_Seng) painted Lee visiting the aftermath of the [Bukit Ho Swee fire](/wiki/Bukit_Ho_Swee_fire), based on a 1961 photograph. The painting was reproduced in *[The Straits Times](/wiki/The_Straits_Times)* and sold to an unknown collector. In 2025, Ong recreated the painting, on a larger canvas, for an exhibition. In 2008, artist Ben Puah unveiled *Hero*, a solo exhibition of Lee portraits at Forth Gallery. In 2009, artist Richard Lim Han presented *Singapore Guidance Angel*, a solo exhibition of Lee portraits at Forth Gallery. In the same year, freelance designer, Christopher \"Treewizard\" Pereira, began making caricature figurines of Lee which range from 12 cm to 30 cm. Comics artist and painter [Sonny Liew](/wiki/Sonny_Liew) depicted Lee as part of the series *Eric Khoo is a Hotel Magnate* at Mulan Gallery. In addition, [Cultural Medallion](/wiki/Cultural_Medallion) recipient [Tan Swie Hian](/wiki/Tan_Swie_Hian) also began a painting of Lee and his late wife titled *A Couple*. The painting, which took Tan five years to complete, was partially damaged by a fire in 2013. It depicts Lee and Kwa in their youth, is based on a 1946 black-and-white photograph of the couple in Cambridge University and incorporates in its background Tan's poem in memory of Kwa. *A Couple* was purchased by art collector Wu Hsioh Kwang. In 2010, Valentine Willie Fine Art gallery asked 19 local artists to imagine a future without Lee. The resulting exhibition, *Beyond LKY*, included artist a [triptych](/wiki/Triptych) of Lee as a father figure looming over a tiny kneeling figure with the words, \"Papa can you hear me\"; an installation of a broken piano with a tape recorder playing a crackling version of Singapore's [National Anthem](/wiki/Majulah_Singapura); white ceramic chains hanging on a wall; and an installation of hammers smashed together. That year, Korean artist Kim Dong Yoo depicted Lee in *Lee Kuan Yew & Queen Elizabeth II* (2010), an oil-on-canvas portrait of Lee using small images of [Queen Elizabeth II](/wiki/Queen_Elizabeth_II)'s head, a reference to Singapore being a former British colony and current member of the Commonwealth. Indian-Swiss novelist [Meira Chand](/wiki/Meira_Chand)'s *A Different Sky*, published by UK's [Harvill Secker](/wiki/Harvill_Secker) in 2010, features Lee in his early years as a lawyer and co-founder of the [People's Action Party](/wiki/People%27s_Action_Party). In 2011, the iris image of Lee's eye was captured and artistically rendered to resemble a sand art gallery piece. His eye image with his autograph was auctioned off to raise funds for the Singapore Eye Research Institute. In 2012, urban artist [Sam Lo](/wiki/Sam_Lo) depicted Lee in their controversial *Limpeh* series, featuring his image in [Shepard Fairey](/wiki/Shepard_Fairey)-inspired stickers, mirrors and collages. In 2013, poet [Cyril Wong](/wiki/Cyril_Wong) published *The Dictator's Eyebrow*, a poetry collection revolving around a Lee-like figure and his eyebrow's thirst for recognition and power. In the same year, a group of [Tamil](/wiki/Tamil_language) poets from three countries, including [Singapore Literature Prize](/wiki/Singapore_Literature_Prize) winner Ramanathan Vairavan, produced *Lee Kuan Yew 90*, a collection of 90 new poems celebrating Lee's legacy. Artist Sukeshi Sondhi also staged *An Icon & A Legend*, a solo exhibition at featuring 20 [pop art](/wiki/Pop_art) style paintings of Lee. Speed painter Brad Blaze was commissioned to craft a portrait of Lee, *Trailblazer: Singapore*, to raise funds for Reach Community Services Society. In August, a bronze bust of Lee, cast by contemporary French artist-sculptor Nacera Kainou, was unveiled at the [Singapore University of Technology and Design](/wiki/Singapore_University_of_Technology_and_Design) as an early birthday present to Lee from the Lyon-Singapore Association and the municipality of Lyon. In 2014, Bruneian painter Huifong Ng landed an exhibition after painting a portrait of Lee. In May of that year, illustrator Patrick Yee produced the children's picture book *A Boy Named Harry: The Childhood of Lee Kuan Yew*, published by [Epigram Books](/wiki/Epigram_Books). The series was later translated into Mandarin. Chinese artist Ren Zhenyu also created [expressionist](/wiki/Expressionist) portraits of Lee in electric hues as part of his *Pop and Politics* series. Vietnamese artist Mai Huy Dung has crafted a series of oil painting portraits of Lee. Ukrainian artist Oleg Lazarenko also depicted Lee as part of his painting *Lion of Singapore*. In October 2014, cartoonist [Morgan Chua](/wiki/Morgan_Chua) released *LKY: Political Cartoons*, an anthology of cartoons about Lee published by [Epigram Books](/wiki/Epigram_Books), featuring a 1971 *[Singapore Herald](/wiki/Singapore_Herald)* cartoon of Lee on a tank threatening to crush a baby representing press freedoms. The [Madame Tussauds](/wiki/Madame_Tussauds) Singapore museum also unveiled a wax figure of Lee and his late wife, Madam [Kwa Geok Choo](/wiki/Kwa_Geok_Choo) seated and smiling together against a backdrop of red flowers formed in the shape of two hearts. The statues were created based on a photograph that was taken by Madam Kwa's niece, Ms Kwa Kim Li, of the pair on Valentine's Day in 2008 at [Sentosa](/wiki/Sentosa). In February 2015, weeks before Lee's death, Helmi Yusof of *[The Business Times](/wiki/Business_Times_(Singapore))* reported on how \"[i]n the last few years, artworks featuring Lee Kuan Yew have turned into a flourishing cottage industry\". Artworks included Jeffrey Koh's seven LKY Pez candy-dispenser sculptures, paintings of Lee in the manner of [Van Gogh](/wiki/Van_Gogh), and Korean sculptor Park Seung Mo's three-dimensional image of Lee made using stainless steel wires. In the same month, illustrator Patrick Yee launched the second title in his picture book series about Lee, called *Harry Grows Up: The Early Years of Lee Kuan Yew*, at an exhibition at the [National Library, Singapore](/wiki/National_Library,_Singapore). In March, Singaporean artist Fan Shaohua and Lebanese-British artist Laudi Abilama exhibited their portraits of Lee. In the same month, the [National Parks Board](/wiki/National_Parks_Board) named a [Singapore Botanic Gardens](/wiki/Singapore_Botanic_Gardens) [orchid](/wiki/Orchid) hybrid called the \"Aranda Lee Kuan Yew\" in honour of Lee's efforts work in conservation and environmentalism. Also in March, a portrait of Lee by Ong Yi Teck, comprising Lee's name written about 18,000 times, went viral on social media. The portrait was made in tribute to Lee, who was then critically ill. Days after Lee died in 2015, the Asian edition of *[Time](/wiki/Time_(magazine))* featured the late Lee Kuan Yew on its cover, while the 16-year-old blogger [Amos Yee](/wiki/Amos_Yee) released a video, *Lee Kuan Yew is Finally Dead!*, which criticised Lee and negatively compared him to [Jesus Christ](/wiki/Jesus_Christ). Yee also posted on his blog a stick-figure cartoon depicting Lee having sex with [Margaret Thatcher](/wiki/Margaret_Thatcher), a personal and political ally of Lee's. For his actions, Yee was charged with insulting religious feelings and obscenity, and sentenced to four weeks imprisonment despite his youth. In April 2015, an exhibition of 300 oil paintings on Lee and Singapore opened at [Suntec City](/wiki/Suntec_City). Presented by art collector Vincent Chua, *The Singapore Story* featured 80 portraits of Lee and a life-size statue of Lee shaking hands with [Deng Xiaoping](/wiki/Deng_Xiaoping) when the Chinese statesman visited Singapore in 1978. In May, [Sonny Liew](/wiki/Sonny_Liew) released his [graphic novel](/wiki/Graphic_novel) *[The Art of Charlie Chan Hock Chye](/wiki/The_Art_of_Charlie_Chan_Hock_Chye)*, in which Lee is central, while Patrick Yee launched the third and final title in his Harry Lee picture book series, *Harry Builds a Nation: The Legacy of Lee Kuan Yew*, which were later translated to Chinese. In July 2015, veteran actor [Lim Kay Tong](/wiki/Lim_Kay_Tong) portrayed Lee in the historical film *(/wiki/1965_(film))*, including a re-enactment of the iconic press conference when Lee announced that Singapore would be separated from Malaysia That same month, actor [Adrian Pang](/wiki/Adrian_Pang) played Lee in *The LKY Musical* opposite [Sharon Au](/wiki/Sharon_Au)'s [Kwa Geok Choo](/wiki/Kwa_Geok_Choo). In October 2015, sculptor Lim Leong Seng exhibited a 75 cm bronze sculpture he made of Lee, entitled *Weathering Storms As One*. In November 2015, the Singaporean Honorary Consulate General in [Barcelona](/wiki/Barcelona) unveiled a bust of Lee at Cap Roig Gardens in [Costa Brava](/wiki/Costa_Brava), while pop artist Andre Tan showed his series of portraits of Lee, *1965* and *Father of the Nation* (国父) at the Affordable Art Fair Singapore. In 2016, to mark the first death anniversary of Lee, Lee's brother Lee Suan Yew and nephew Shaun Lee completed the art installation by young Singaporeans of Singapore flag erasers put together to form Lee's face, titled *Our Father, Our Country, Our Flag*. In 2023, the centenary of Lee's birth, American artist [Daniel Arsham](/wiki/Daniel_Arsham) was commissioned to create two sculptures of Lee, *Eroded Bronze LKY Bust 1:1* and *LKY Full Body 1:2*, using bronze, stainless steel, and patina. They were exhibited, along with AI-generated videos and portraits of Lee, at the immersive exhibition *Now Is Not The Time* in September. In the same month, paintings of Lee were exhibited at Tanjong Pagar Community Club in the show *LKY100*. In 2024, Singaporean artist David Chan showed his painting *Lee And Raffles – 5 Stars Rising* at Art Seasons Gallery's booth at the Art SG fair, where it sold to a collector. In (/wiki/2025_in_Singapore), Lee's ten-year death anniversary and \"SG60\" (Singapore's 60th year of independence), INSTINC gallery's exhibition *10 Years: Remembering LKY* showcased artworks reflecting on Lee's legacy, including portraits of Lee by Boo Sze Yang, Chang Hui Fang, and Laudi Abilama; Justin Lee's series *LKY Quotes*; and Yeo Shih Yun's screenprint of Lee planting a tree in 1973. The exhibition was a follow-up to *Remembering LKY* in 2015. In July, Cuturi Gallery showcased Singaporean artist Yom Bo Sung's small-scale sculpture of Lee, *Elegy*, as part of the exhibition *Sixty Summers Here*. Also in July, the group exhibition *Artist’s Proof: Singapore At 60* showed, alongside an artist's proof of Harpley's bust of Lee, cartoonist Sonny Liew's figurine of Lee, as part of commissioned project \"P.A.P. x P.A.\"; Foo Kwee Horng's painting portrait of Lee, *Majulah* (2016); a portrait of Lee by Rajesh P Kargutkar; and Jon Chan's oil paintings of the offices of Lee and former political detainee [Chia Thye Poh](/wiki/Chia_Thye_Poh). In August, movie director [Jack Neo](/wiki/Jack_Neo) uploaded a music video for his song, \"We Are Singapore\", including AI-generated images of the late Lee. ## Awards - Lee received a number of [state decorations](/wiki/State_decoration), including the [Order of the Companions of Honour](/wiki/Order_of_the_Companions_of_Honour) (1970), Knight Grand Cross of the [Order of St Michael and St George](/wiki/Order_of_St_Michael_and_St_George) (1972), the [Ancient Order of Sikatuna](/wiki/Order_of_Sikatuna) (1974), the [Freedom of the City of London](/wiki/Freedom_of_the_City_of_London) (1982), the [Seri Paduka Mahkota Johor](/wiki/Order_of_the_Crown_of_Johor) (1984), the [Nishan-e-Quaid-i-Azam](/wiki/Nishan-e-Quaid-i-Azam) (1988) and the [Order of the Rising Sun](/wiki/Order_of_the_Rising_Sun) (1967). - In 1999, Lee was named one of *[Time](/wiki/Time_(magazine))*'s Most Influential People of the 20th Century. - In 2002, Lee became a fellow of [Imperial College London](/wiki/Imperial_College_London) in recognition of his promotion of international trade and industry and development of science and engineering study initiatives with the United Kingdom. - In 2006, Lee was presented with the [Woodrow Wilson Award for Public Service](/wiki/Woodrow_Wilson_Awards) by the [Woodrow Wilson International Center for Scholars](/wiki/Woodrow_Wilson_International_Center_for_Scholars). - In 2007, Lee was conferred an honorary Doctorate in Law at the [Australian National University](/wiki/Australian_National_University) in [Canberra](/wiki/Canberra), albeit amid protest from 150 students and staff. - In September 2009, Lee was awarded the Armenian [Order of Honor](/wiki/Orders,_decorations,_and_medals_of_Armenia#Civil_orders_of_Armenia) by President [Serzh Sargsyan](/wiki/Serzh_Sargsyan) for his activities directed at the establishment and deepening of bilateral cooperation between Armenia and Singapore, during Lee's official visit to Armenia. - In October 2009, the US–Asean Business Council conferred upon Lee its first Lifetime Achievement award, at its 25th anniversary gala dinner in Washington, D.C. His tribute, the former [United States Secretary of State](/wiki/United_States_Secretary_of_State) and [1973 Nobel Peace Prize](/wiki/1973_Nobel_Peace_Prize) winner [Henry Kissinger](/wiki/Henry_Kissinger). A day later he met United States President [Barack Obama](/wiki/Barack_Obama) at the [Oval Office](/wiki/Oval_Office) in the [White House](/wiki/White_House). - On 15 November 2009, Lee was awarded the Russian [Order of Friendship](/wiki/Order_of_Friendship) by President [Dmitry Medvedev](/wiki/Dmitry_Medvedev) on the sidelines of [APEC Singapore 2009](/wiki/APEC_Singapore_2009). - On 29 April 2010, Lee was named in the *Time 100* list as one of the people who most affect our world. - On 14 January 2011, Lee received the inaugural Gryphon Award from his alma mater, Raffles Institution, given to illustrious Rafflesians who have made exceptional contributions to the nation. - On 19 October 2011, Lee received the Lincoln Medal in Washington DC—an honour reserved for people who have exemplified the legacy and character embodied by [Abraham Lincoln](/wiki/Abraham_Lincoln). - On 21 February 2012, Lee was conferred the Kazakhstan [Order of Friendship](/wiki/Order_of_Friendship_(Kazakhstan)) by Ambassador Yerlan Baudarbek-Kozhatayev, at [The Istana](/wiki/The_Istana). - On 10 September 2013, Lee was conferred Russia's [Order of Honour](/wiki/Order_of_Honour_(Russian_Federation)) by Ambassador [Leonid Moiseev](/wiki/Leonid_Moiseev) for his contributions for forging friendship and co-operation with the Russian Federal and scientific and cultural relations development. - On 22 May 2014, the title of Honorary Doctor of the Diplomatic Academy of the Ministry of Foreign Affairs was presented by the Russian government to Lee. - In 2016, Lee was conferred the [Order of the Paulownia Flowers](/wiki/Order_of_the_Paulownia_Flowers). The award was backdated to 23 March 2015, the date of his death. - In December 2018, China conferred a posthumous [China Reform Friendship Medal](/wiki/China_Reform_Friendship_Medal) on Lee for his \"critical role in promoting Singapore's participation in China's reform journey\". In former Chinese leader [Deng Xiaoping's southern tour](/wiki/Deng_Xiaoping%27s_southern_tour), he urged Chinese leaders to learn from the Singapore model. Alan Chan Heng Loon, Singapore–China Foundation chairman and Lee's chief private secretary, said that Mr. Lee's administration did a lot to build China-Singapore ties. - [Government of Singapore](/wiki/Government_of_Singapore) - [Politics of Singapore](/wiki/Politics_of_Singapore) - [Political positions of Lee Kuan Yew](/wiki/Political_positions_of_Lee_Kuan_Yew) - [Zhonghandi](/wiki/Zhonghandi) ## Notes ### Works cited Library resources about **Lee Kuan Yew** - Resources in your library - Resources in other libraries **By Lee Kuan Yew** - Resources in your library - Resources in other libraries - Media related to Lee Kuan Yew at Wikimedia Commons - Appearances on [C-SPAN](/wiki/C-SPAN) - Portraits of Lee Kuan Yew at the [National Portrait Gallery, London](/wiki/National_Portrait_Gallery,_London) - Quotations related to Lee Kuan Yew at Wikiquote Political offices**New office** **[Prime Minister of Singapore](/wiki/Prime_Minister_of_Singapore)** 1959–1990Succeeded by[Goh Chok Tong](/wiki/Goh_Chok_Tong)Preceded by[Hon Sui Sen](/wiki/Hon_Sui_Sen) **[Minister for Finance](/wiki/Minister_for_Finance_(Singapore)) Acting** 1983Succeeded by[Tony Tan](/wiki/Tony_Tan)**Vacant**Title last held by**[S. Rajaratnam](/wiki/S._Rajaratnam) 1988** **[Senior Minister](/wiki/Senior_Minister_of_Singapore)** 1990–2004Succeeded by[Goh Chok Tong](/wiki/Goh_Chok_Tong)**New office** **[Minister Mentor](/wiki/Minister_Mentor)** 2004–2011**Position abolished** [Parliament of Singapore](/wiki/Parliament_of_Singapore)**New constituency** **Member of Parliament for [Tanjong Pagar SMC](/wiki/Tanjong_Pagar_Single_Member_Constituency)** 1959–1991**Constituency abolished** **Member of Parliament for [Tanjong Pagar GRC](/wiki/Tanjong_Pagar_Group_Representation_Constituency)** 1991–2015Succeeded by[Joan Pereira](/wiki/Joan_Pereira) (Tanjong Pagar ward)Party political offices**New office** **Secretary-General of the [People's Action Party](/wiki/People%27s_Action_Party)** 1954–1992Succeeded by[Goh Chok Tong](/wiki/Goh_Chok_Tong)Portals: - Biography - Politics - Singapore **Lee Kuan Yew** at Wikipedia's sister projects: - **Media** from Commons - **News** from Wikinews - **Quotations** from Wikiquote - **Texts** from Wikisource - **Data** from Wikidata\n",
  "language": "en",
  "processed_at": "2026-01-12T11:21:04.439129",
  "title": "Lee Kuan Yew",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Lee_Kuan_Yew"
}