{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:20:45.093546"
  },
  "content": "This article **is an orphan, as no other articles link to it**. Please introduce links to this page from related articles. *(December 2025)* **Lee Ah Mooi Old Age Home** is an old folk's home located along Thomson Lane in [Toa Payoh, Singapore](/wiki/Toa_Payoh). A second branch of the Lee Ah Mooi Old Age Home has been opened along Silat Avenue in [Bukit Merah](/wiki/Bukit_Merah). ## History The Lee Ah Mooi Old Age Home was first established in the 1960s former nurse Lay Ah Mooi began taking care of retired [samsui women](/wiki/Samsui_women) and former maids in her house in Kampong Chong Pang. The home then moved to various locations, including [Sembawang](/wiki/Sembawang), [Jalan Kayu](/wiki/Jalan_Kayu), [Teck Whye](/wiki/Teck_Whye) and [Telok Blangah](/wiki/Telok_Blangah), before eventually moving to 1 Thomson Lane in 1984, with the assistance of authorities and former Minister for Finance [Lim Kim San](/wiki/Lim_Kim_San). After Lay's death in 1992, management of the home went to her grandsons Then Mun Wah and Then Mun Tat. A second home located along Silat Avenue was later established. In 2012, the home at Thomson Lane was asked to move to make way for the upcoming [North-South Corridor](/wiki/North-South_Corridor,_Singapore). On 31 March 2020, during the [COVID-19 pandemic in Singapore](/wiki/COVID-19_pandemic_in_Singapore), a COVID-19 cluster was discovered in the home located at Thomson Lane. This resulted in suspension of visits to all nursing homes in Singapore to protect the elderlies. The cluster saw fourteen residents being infected by COVID-19, four of whom later died. Visits to the home at Silat Avenue were again suspended in September after a nurse who formerly worked at the home tested positive for COVID-19. The home along Thomson Lane has been included in the Toa Payoh Heritage Trail by the [National Heritage Board](/wiki/National_Heritage_Board_(Singapore)). 1°19′49″N 103°50′17″E﻿ / ﻿1.3304°N 103.8380°E﻿ / 1.3304; 103.8380 This article about a Singapore building or structure is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:20:45.093122",
  "title": "Lee Ah Mooi Old Age Home",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Lee_Ah_Mooi_Old_Age_Home"
}