{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:21:02.419583"
  },
  "content": "Natural history museum in Conservatory Drive, Singapore The **Lee Kong Chian Natural History Museum** (**LKCNHM**; [Malay](/wiki/Malay_language): *Muzium Sejarah Alamiah Lee Kong Chian*, [Chinese](/wiki/Chinese_language): 李光前自然历史博物馆; [pinyin](/wiki/Pinyin): *Lǐguāngqián zìrán lìshǐ bówùguǎn*) is a museum of [natural history](/wiki/Natural_history) at the Kent Ridge Campus of the [National University of Singapore](/wiki/National_University_of_Singapore). It is named after [Lee Kong Chian](/wiki/Lee_Kong_Chian), a prominent Chinese businessman and philanthropist active in Malaya and Singapore between the 1930s and the 1960s. It was officially opened on 18 April 2015. The idea for a natural history collection was first mooted by Sir [Stamford Raffles](/wiki/Stamford_Raffles), and the collection of [Southeast Asian](/wiki/Southeast_Asia) biodiversity was begun in 1849 at the Raffles Museum (now the [National Museum of Singapore](/wiki/National_Museum_of_Singapore)). In 1972, the [Government of Singapore](/wiki/Government_of_Singapore) removed the natural history collections from the National Museum and gave them to the Zoology Department of what was then the University of Singapore. They were housed in various temporary premises, including the [Nanyang Technological University](/wiki/Nanyang_Technological_University) for seven years. Subsequently, they were returned to the NUS and housed in the Raffles Museum of Biodiversity Research. LKCNHM inherited the natural history collections from the Raffles Museum of Biodiversity Research. The Museum currently has more than 560,000 catalogued lots in its collection and over a million specimens from throughout the region. The Zoological Reference Collection was formerly known as the Raffles Natural History Collection. About 2,000 of these are exhibited in the museum's galleries. In February 2016, the museum announced that $1 million was raised for scientific and educational efforts related to the 10.6m adult female sperm whale carcass dubbed \"Jubi Lee\" found in Singapore waters in July 2015. The \"Jubilee Whale Exhibit\" was unveiled on 14 March that year. - [List of museums in Singapore](/wiki/List_of_museums_in_Singapore) - Official website This Singaporean organisation article is a stub. You can help Wikipedia by expanding it.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:21:02.419286",
  "title": "Lee Kong Chian Natural History Museum",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Lee_Kong_Chian_Natural_History_Museum"
}