{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:20:56.959224"
  },
  "content": "Singaporean politician and business executive **Lee Hsien Yang** [PJG](/wiki/Pingat_Jasa_Gemilang) ([Chinese](/wiki/Chinese_language): 李显扬; [pinyin](/wiki/Pinyin): *Lǐ Xiǎnyáng*; born 24 September 1957) is a Singaporean businessman and former [brigadier-general](/wiki/Brigadier-general). He has been a member of the [Progress Singapore Party](/wiki/Progress_Singapore_Party) (PSP) since 2020. A prominent member of the [Lee family](/wiki/Lee_family_(Singapore)), he is the younger brother of [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) and the youngest son of [Lee Kuan Yew](/wiki/Lee_Kuan_Yew), the founding prime minister of Singapore. ## Early life and education Lee was born in Singapore on 24 September 1957. He attended [Catholic High School](/wiki/Catholic_High_School_(Singapore)) and [National Junior College](/wiki/National_Junior_College) before graduating from [Trinity College, Cambridge](/wiki/Trinity_College,_Cambridge), with a double first in [engineering science](/wiki/Engineering_science) under the [President's Scholarship](/wiki/President%27s_Scholar) and [Singapore Armed Forces Overseas Scholarship](/wiki/Singapore_Armed_Forces_Overseas_Scholarship) awarded by the [Public Service Commission](/wiki/Public_Service_Commission_(Singapore)). He subsequently went on to complete a [Master of Science](/wiki/Master_of_Science) degree in management at [Stanford University](/wiki/Stanford_University). ## Career ### Military Lee enlisted in the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces) (SAF) in 1976, and has held several command and staff appointments such as the Commander of the second Singapore Infantry Brigade, and had attained the rank of [brigadier-general](/wiki/Brigadier-general) before retiring in 1994. ### Private After retiring from the military, Lee joined [Singapore Telecommunications](/wiki/Singtel) (Singtel) in April 1994 as Executive Vice President of Local Services. In May 1995, he became CEO of Singtel, where he served until March 2007. That same year, Lee was awarded the [Meritorious Service Medal](/wiki/Pingat_Jasa_Gemilang) (PJG). In September 2007, [Fraser and Neave](/wiki/Fraser_and_Neave) (F&N) appointed Lee as a Non-Executive Director and Chairman-designate with effect from 6 September 2007. Lee assumed the position of Non-Executive Chairman on 15 October 2007. On 1 July 2009, Lee was appointed Chairman of the [Civil Aviation Authority of Singapore](/wiki/Civil_Aviation_Authority_of_Singapore) (CAAS) by [Minister for Transport](/wiki/Ministry_of_Transport_(Singapore)#Ministers) [Raymond Lim](/wiki/Raymond_Lim). On 26 February 2013, it was announced that Lee had stepped down from the board of F&N. Lee has also held other positions in the private sector – Board Member and Chairman of the Audit Committee of the [Singapore Exchange](/wiki/Singapore_Exchange) (SGX); Independent Director of the Islamic Bank of Asia, and the [Australia and New Zealand Banking Group Limited](/wiki/ANZ_(bank)) (ANZ); Member of the Governing Board of the [Lee Kuan Yew School of Public Policy](/wiki/Lee_Kuan_Yew_School_of_Public_Policy) (LKYSPP); Member of the Board of Asia Pacific Investment; Chairman of [Republic Polytechnic](/wiki/Republic_Polytechnic) (RP); Member of the International Advisory Board of [Rolls-Royce Holdings](/wiki/Rolls-Royce_Holdings). Lee stepped down as Chairman of the CAAS on 1 July 2018. ## Political involvement ### 2020 general election Initially in 2006, Lee said that he has \"no great interest to pursue a career in politics\". Lee joined the [Progress Singapore Party](/wiki/Progress_Singapore_Party) (PSP) led by [Tan Cheng Bock](/wiki/Tan_Cheng_Bock), on 24 June 2020, claiming that the [People's Action Party](/wiki/People%27s_Action_Party) (PAP) has \"lost its way\", and that it is no longer the PAP with the \"founding principles that [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) had envisioned\". The PSP was one of the opposition parties that ran in the [2020 general election](/wiki/2020_Singaporean_general_election). Lee ultimately decided not to run as a candidate for the [2020 general election](/wiki/2020_Singaporean_general_election), stating that \"Singapore doesn't need another Lee\". ### 2023 presidential election In March 2023, Lee hinted in a phone call interview from Europe on running for the [2023 presidential election](/wiki/2023_Singaporean_presidential_election). Lee said during a telephone interview with Bloomberg in March 2023, \"There is a view that depending on who they (referring to the government) float, if I were to run they would be in serious trouble and could lose. A lot of people have come to me. They really want me to run. It's something I would consider.\" As of March 2023, both Lee and his wife, Lee Suet Fern, are currently in self-imposed exile in the [United Kingdom](/wiki/United_Kingdom) after being under investigation for lying during judicial proceedings. Lee did not collect his application forms from the [Elections Department](/wiki/Elections_Department). However, it has been cited that he may not meet the eligibility requirements due to ongoing police investigations against him and his wife, Lim Suet Fern, over allegedly giving false evidence in the proceedings over his father Lee Kuan Yew's will. ### Exile On 22 October 2024, Lee announced that he had been granted political asylum in the United Kingdom, describing himself as a \"political refugee\". The Singaporean government dismissed his claims of persecution as unfounded and baseless, stating that there were \"no legal restraints\" preventing him or his wife from returning to Singapore. ## Ridout Road allegations On 23 July 2023, a post was made on Lee's Facebook account, including the statement: \"two ministers have leased state-owned mansions from the agency that one of them controls, felling trees and getting state-sponsored renovations\". Within a week, Singaporean ministers [K. Shanmugam](/wiki/K._Shanmugam) and [Vivian Balakrishnan](/wiki/Vivian_Balakrishnan) demanded that Lee apologize for and withdraw his statements, and additionally pay damages to them, which they said they would donate to charity; if he did not do so, they threatened to sue him. Shanmugam alleged that Lee accused him and Balakrishnan of \"acting corruptly and for personal gain by having Singapore Land Authority (SLA) give us preferential treatment\" regarding the [Ridout Road rentals](/wiki/Ridout_Road_rentals). Lee responded: \"My post did not assert that Shanmugam and V. Balakrishnan acted corruptly or for personal gain by having SLA give them preferential treatment … My post simply stated facts that were already widely published in the Singapore and international media.\" The two ministers proceeded to sue Lee for defamation. The [High Court of Singapore](/wiki/High_Court_of_Singapore) gave default judgment in November 2023 in favour of the ministers when Lee did not respond to the lawsuits. Lee was ordered to pay S$400,000 in total to the two ministers, comprising S$150,000 in general damages and S$50,000 in aggravated damages to each minister. Lee was also ordered to pay S$51,000 in costs to each Minister. In his judgment, Judge [Goh Yihan](/wiki/Goh_Yihan) stated that he was satisfied that Lee had \"consciously chosen not to respond\" and the ministers were \"public leaders and persons of the highest integrity who undoubtedly have a high standing\", which was \"a factor that points towards the award of higher damages\". ### Payment to ministers On 29 September 2024, Lee Hsien Yang reported making a payment of S$619,335.53 to Shanmugam and Balakrishnan, which he stated was equivalent to 13.6 months' rent for the two Ridout houses. He indicated that this payment was made in an effort to honor his father's wishes regarding his home at 38 Oxley Road and to allow his sister, Wei Ling, who is unwell, to continue residing there. Lee expressed disappointment that the ministers did not pursue the case in the [English courts](/wiki/Courts_of_England_and_Wales). Wei Ling died shortly after in October 2024. ## Personal life Lee is the younger son and youngest child of [Lee Kuan Yew](/wiki/Lee_Kuan_Yew), former [prime minister of Singapore](/wiki/Prime_minister_of_Singapore), and [Kwa Geok Choo](/wiki/Kwa_Geok_Choo), a lawyer. His elder brother, [Lee Hsien Loong](/wiki/Lee_Hsien_Loong), is the former prime minister. His elder sister, [Lee Wei Ling](/wiki/Lee_Wei_Ling), was a former director of the [National Neuroscience Institute](/wiki/National_Neuroscience_Institute). Lee first met Lim Suet Fern, the daughter of the economist Lim Chong Yah, while he was studying at [University of Cambridge](/wiki/University_of_Cambridge). They were married in July 1981. Lim would later become the founder and managing partner of Stamford Law Corporation and a president of the [Inter-Pacific Bar Association](/wiki/Inter-Pacific_Bar_Association) (IPBA). The couple have three sons: [Li Shengwu](/wiki/Li_Shengwu_(economist)), Li Huanwu, and Li Shaowu. Their eldest son, Li Shengwu, is currently serving as a Professor of Economics at [Harvard University](/wiki/Harvard_University). He graduated from [Balliol College](/wiki/Balliol_College,_Oxford) of the [University of Oxford](/wiki/University_of_Oxford) as the top student in the [Philosophy, Politics and Economics](/wiki/Philosophy,_Politics_and_Economics) programme in 2009, received a [Master of Philosophy](/wiki/Master_of_Philosophy) degree in economics from Oxford in 2011, and received a PhD from [Stanford University](/wiki/Stanford_University) in 2016. His child Li Huanwu came out as [gay](/wiki/Gay) in July 2018. Li Huanwu married his partner, Heng Yirui, a [vet](/wiki/Veterinarian) working for [Mandai Wildlife Group](/wiki/Mandai_Wildlife_Group), in [South Africa](/wiki/Same-sex_marriage_in_South_Africa) on 24 May 2019. ## Administrator of Lee Kuan Yew's will Lee and his sister, [Lee Wei Ling](/wiki/Lee_Wei_Ling), were the joint administrators and executors of Lee Kuan Yew's will. However, they were in a dispute in 2017 with [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) over their late father's will with regard to the house at [38 Oxley Road](/wiki/38_Oxley_Road). They \"felt threatened by [Lee Hsien Loong](/wiki/Lee_Hsien_Loong)'s misuse of his position and influence over the Singapore government and its agencies to drive his personal agenda\". They alleged that their brother thwarted the will of their father in order to use the house as a monument to milk his father's legacy. They also criticised the influence of [Ho Ching](/wiki/Ho_Ching) over the government, and alleged that the Prime Minister harboured political ambitions for his son, Li Hongyi. In 2017, a special parliamentary session was held to clear the Prime Minister of any wrongdoings and the siblings agreed to keep the dispute private after the session. However, this ultimately did not become the case with it continuing to be highly publicised. The issue was later resolved. Portals: - Biography - Politics - Singapore\n",
  "language": "en",
  "processed_at": "2026-01-12T11:20:56.958791",
  "title": "Lee Hsien Yang",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Lee_Hsien_Yang"
}