{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:21:08.253489"
  },
  "content": "Singaporean writer and poetThis article **is an orphan, as no other articles link to it**. Please introduce links to this page from related articles. *(December 2025)* **Lee Run Hu** ([Chinese](/wiki/Simplified_Chinese_characters): 李润湖; [pinyin](/wiki/Pinyin): *Lǐ RùnHú*; 1913–1947) was a [Singaporean](/wiki/Singapore) writer and poet who was remembered for his contributions to the development of Chinese literature and literary writing in [Malaya](/wiki/Malayan_Union). He was a prolific writer for Chinese newspapers and other publications, championing socio-political issues, and exposing evils by mercenary businessmen and the Japanese government during the [Japanese occupation of Singapore](/wiki/Japanese_occupation_of_Singapore). Lee was a reporter, before and after the war. He was an altruistic man who worked out of his interest in social commentary work, and wrote pr bono for local Chinese newspapers. From 1945 to his death, Lee wrote a total of 132 articles for local newspapers. Through his articles Lee obtrusively voiced his opinions, and offended many important people in the Malayan society. For instance, he once wrote about wealthy people who had a penchant of \"donating a dollar, and expecting 3 dollars' worth of recognition of patriotism, charity, and generosity\". As a result, Lee adopted different pen-names to have his work published. Lee died of illness in 1947 at the age of 34. Upon his death, the local literary circle honoured him with an elaborate funeral, and a commemorative feature in the Chinese newspapers, honoring him with the title of *Singapore Cultural Warrior*. Fang left behind his wife Liu Peh Chin, son Lee Yew Keng and daughters Lee Yew Koon and Lee Yew Hu. This Singaporean biographical article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:21:08.252973",
  "title": "Lee Run Hu",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Lee_Run_Hu"
}