{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:21:32.672741"
  },
  "content": "Singaporean legal academic **Leslie Chew Kwee Hoe** [SC](/wiki/Senior_Counsel) [PBM](/wiki/Pingat_Bakti_Masyarakat) is a Singaporean legal academic and [law professor](/wiki/Law_professor). He is the founding Dean of the [School of Law, Singapore University of Social Sciences](/wiki/SUSS_School_of_Law), Singapore's third law school. He also regularly teaches in other institutions including the Singapore Institute of Arbitrators and the [NUS Faculty of Law](/wiki/National_University_of_Singapore_Faculty_of_Law), as well as the [Lee Kwan Yew School of Public Policy](/wiki/Lee_Kuan_Yew_School_of_Public_Policy). Chew is the founding President of the Asia Pacific Institute of Experts. Apart from being a law academic, Chew is also a consultant at [Peter Low](/wiki/Peter_Low) Chambers. ## Career Chew was appointed [Senior Counsel](/wiki/Senior_counsel) in 2000. In 2002, Chew was awarded the [Public Service Medal](/wiki/Public_Service_Medal_(Singapore)) by the [President](/wiki/President_of_Singapore) of the [Republic of Singapore](/wiki/Singapore) for his contributions to the Military Court of Appeal. Chew started his legal career as a legal service officer from 1978 to 1981 before leaving for private practice, first serving in Lee & Lim before joining KhattarWong & Partners where he became Joint [Managing Partner](/wiki/Managing_Partner). He then joined Gurbani & Co. From 2007 to 2014, Chew was a District Judge and subsequently a Senior District Judge heading the Civil Justice Division of the [State Courts](/wiki/State_Courts_of_Singapore) (previously known as the Subordinate Courts). After a distinguished career on the Bench, Chew retired in 2014. Chew credits the former Registrar of the [Supreme Court of Singapore](/wiki/Supreme_Court_of_Singapore), Mr Chiam Boon Keng, and Mr [Sat Pal Khattar](/wiki/Sat_Pal_Khattar), as being major influences in his career. In 2016, Chew was appointed the founding Dean of the [School of Law, Singapore University of Social Sciences](/wiki/Singapore_University_of_Social_Sciences_Law_School). In that capacity, he has spoken about the need to strengthen the values inherent in the legal profession. Chew has also published a book on [arbitration](/wiki/Arbitration), entitled \"Introduction to the Law and Practice of Arbitration in Singapore\". - Faculty CV This Singapore law-related biographical article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:21:32.672312",
  "title": "Leslie Chew",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Leslie_Chew"
}