{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:19:39.374056"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"LGBTQ literature in Singapore\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(December 2024)* *(Learn how and when to remove this message)* This article deals with writing that deals with [LGBT](/wiki/LGBT) themes in a [Singapore](/wiki/Singapore) context. It covers literary works of fiction, such as novels, short stories, plays and poems. It also includes non-fiction works, both scholarly and targeted at the general reader, such as dissertations, journal or magazine articles, books and even web-based content. Although Singapore lacks a dedicated gay book publisher or gay bookshop, it does have at least one dedicated gay library, Pelangi Pride Centre, which is open weekly to the public. Many of the works cited here may be found both in Pelangi Pride Centre, as well as the National Library or other academic libraries in Singapore, as well as in some commercial bookshops under 'gender studies' sections. ## Plays The increasing boldness of Singapore writers in sympathetically addressing [LGBT](/wiki/LGBT) themes is intertwined with the growth of English-language theatre from the mid-1980s. It was in theatre that writers first challenged the cultural [taboo](/wiki/Taboo) surrounding [homosexuality](/wiki/Homosexuality). A fairly regular stream of [gay](/wiki/Gay) plays were staged in Singapore throughout the 1990s, raising the public profile of sexual minorities. - *Lest the Demons Get To Me* (1993) by Russell Heng depicts a dilemma in which a male-to-female [transsexual](/wiki/Transsexual) resents having to dress up as a man to perform funeral rites as her dead father's only son. - *Private Parts* (1994), a comedy by [Michael Chiang](/wiki/Michael_Chiang), addresses the theme of [Singapore](/wiki/Singapore) society's capacity to come to terms with gender minorities in the form of [transsexuals](/wiki/Transsexual). *[The Straits Times](/wiki/The_Straits_Times)* reported that \"Private Parts, with its remarkable performances and poignant message, is a special production that should not close until every person in this country has seen it\". The play has also been performed in Mandarin.[*citation needed*] - *Invitation to Treat Trilogy* by [Eleanor Wong](/wiki/Eleanor_Wong_(playwright)) tells the story of Ellen Toh, a law partner, coming to terms with her homosexuality. The trilogy consists of *Mergers and Accusations* (1995)*, Wills and Secession* (1996), and *Jointly and Severably*. - *Asian Boys Trilogy* (2001–2007) features three disparate plays written by [Alfian Sa'at](/wiki/Alfian_Sa%27at) and directed by [Ivan Heng](/wiki/Ivan_Heng). The first instalment *Asian Boys Vol.1* was staged in 2001 to rave reviews, not only on its artistic merit but also its relevance to the incumbent societal concerns. Following this was *Landmarks: Asian Boys Vol.2*, which premiered in 2004. A collection of eight short stories, this montage explores the myriad gay experiences of Singaporeans, albeit mostly clandestine. One of the stories, *Katong Fugue*, was made into a short film in 2006. Finally, the last of the trilogy, *Happy Endings: Asian Boys Vol.3*, played at the Drama Centre, at [National Library, Singapore](/wiki/National_Library,_Singapore) from 11 to 29 July 2007. ## Novels Novels with LGBT-related themes began emerging in Singapore literature scene in the 1990s. Among the earliest work is Different Strokes (1993) by [David Leo](/wiki/David_Leo) portraying victims of AIDS. - *[Peculiar Chris](/wiki/Peculiar_Chris)* (1992) by Johann S. Lee (Cannon International, 1992 [ISBN](/wiki/ISBN_(identifier)) 981-00-3557-8), the only true \"coming-out novel\" written from a Singaporean point of view so far. Describes a young athlete and national serviceman's angst-filled struggles with boyfriends, discriminatory institutions and death, as well as his coming out into the gay and lesbian community. Described by *[The Straits Times](/wiki/The_Straits_Times)* in 2008 as a 'cult classic'. - *Abraham’s Promise* (1995) by [Philip Jeyaretnam](/wiki/Philip_Jeyaretnam) tells a story of a father's rejection of and then coming to terms with his son's [homosexuality](/wiki/Homosexuality). This is no exploration of the world of a [gay](/wiki/Gay) man, for the homosexual character hardly speaks. Its intellectual touchstone is the political culture of post-colonial [Singapore](/wiki/Singapore) where many feel marginalised with little promise of respite in personal or professional life. ([ISBN](/wiki/ISBN_(identifier)) 0-8248-1769-9) - *Glass Cathedral* (1995) by Andrew Koh - a prize-winning novella, the winner of the Commendation Prize of the 1994 Singapore Literature Prize, republished by [Epigram Books](/wiki/Epigram_Books) in 2011. ([ISBN](/wiki/ISBN_(identifier)) 978-981-08-9932-5) - *Sisterhood: New Moons in San Francisco* (1993) by Joash Moo (Times Books International, [ISBN](/wiki/ISBN_(identifier)) 9-8120-4368-3) explores a transsexual's search for love and her romantic escapades in San Francisco. - *Asking for Trouble* (2005) by Jason Hahn, an *[8 Days](/wiki/8_Days_(magazine))* journalist, who based his humour book on his experiences with living with two high-maintenance women, with free advice from his 2 male friends, one gay, the other married. ([ISBN](/wiki/ISBN_(identifier)) 981-261-025-1) - *Bugis Street* by [Koh Buck Song](/wiki/Koh_Buck_Song). - *What are You Doing in My Undies?* (2002) by Jon Yi about a man's change into transvestism. - Different Strokes (1993) by [David Leo](/wiki/David_Leo). While David Leo wrote a homophobic short story in News at Nine, this book is based on an objective journalist's experience when he interviewed a gay AIDS patient. ([ISBN](/wiki/ISBN_(identifier)) 981-00-4755-X) - *The Narcissist* (2004) by Edmund Wee (Times Editions, May 2004, [ISBN](/wiki/ISBN_(identifier)) 981-232-819-X) - *Mouse Marathon* by Ovidia Yu. - *To Know Where I'm Coming From* (2007) by Johann S. Lee (Cannon International, 2007 [ISBN](/wiki/ISBN_(identifier)) 978-981-05-9472-5), Lee's indirect sequel to *Peculiar Chris*. About a gay emigrant returning to his homeland to heal from a broken heart. Rated 5 stars out of 6 by *Time Out* and 3 stars out of 5 by *The Sunday Times*. Alex Au wrote in his *Yawning Bread* review: \"It's a much more mature book than the first, but the talent for telling a story with honesty and enrapturement is still very much there… One day, I think it is safe to bet, this novel will be on the required reading list for Singapore students, even if some people might turn in their grave, or more likely in the Singapore context, stew in their urn. It will be on that list precisely because it is suspended in the tension between being gay and being Singaporean, being away and being connected; precisely because it captures a moment in our shared national history.\" - *[Quiet Time](/wiki/Quiet_Time)* (2008) by Johann S. Lee (Cannon International, 2008 [ISBN](/wiki/ISBN_(identifier)) 978-981-08-1703-9), The concluding part of Lee's Singaporean queer triptych which began with Peculiar Chris. About a gay man's paternal instincts and gay activism, set against the civil rights events of 2007. Rated 3.5 stars out of 5 by The Sunday Times. Cyril Wong wrote: “Passionate and unflinching in his portrayal of the self-contradictions and inexorable conflicts which remain part and parcel of being gay in Singapore, Johann S Lee has created a wonderfully realistic, prescient and moving book that threatens to bat his previous works (and many past Singaporean novels) off the shelf of living memory. In time, one hopes that Quiet Time will continue to instruct and encourage present and future generations of gay readers to keep questioning the value of their existence, and to look back in awe at how far we have all come as a persecuted community.” The Sunday Times: \"A remarkable book.\" Trevvy.com: \"A must-read.\" Fridae.com: \"Singapore's best gay novel ever.\" - *Tong Lei* (2009) by Ken Ang (Oogachaga, 2009 [ISBN](/wiki/ISBN_(identifier)) 978-981-08-3697-9) is Singapore's first collection of Chinese short fiction. Each story is based on a true account of the lives of gay men in contemporary Singapore. Written by Ken Ang, the book is accompanied by two theme songs 剩下 and 放心 by composed and performed by Tin Ang. The book is published by Oogachaga (OC), the publishers of the popular Singapore Queers of the 21st Century (SQ21) in conjunction with OC's tenth anniversary. The book was launched during IndigNation 2009 and all proceeds from the sale of the book will be channeled to OC's support group programmes and counselling services. - *Blame It On The Raging Hormones* (2010) by Nathan Goh (Wham Bam, 2010 [ISBN](/wiki/ISBN_(identifier)) 978-981-08-6405-7 / Tincture, 2011 [ISBN](/wiki/ISBN_(identifier)) 978-1-59021-115-1) is a coming-of-age memoir of a twenty old Singaporean gay man, written in the form of an online journal. It's about how the character, Nicky was trying to find love, validation and sense of worth but was finding them in the wrong places and how he crashes into a world of sex, drugs, orgies, prostitution and betrayal in his pursuit. - *The Last Lesson of Mrs de Souza* (2013) by Cyril Wong ([ISBN](/wiki/ISBN_(identifier)) 978-981-07-6232-2) is a quiet narrative with an unreliable narrator about a student coming out to a teacher, with disastrous consequences. - *A Certain Exposure* (2014) by Jolene Tan ([ISBN](/wiki/ISBN_(identifier)) 978-981-07-8828-5) is a sensitive coming-of-age tale about a gay government scholar, part of a pair of male twins, who commits suicide after being bullied. In Tamil language, Singaporean, Alagersamy Sakthivel wrote few LGBTQ books. One book name is 'Aavannavirkum Aavannavirkum Kadhal' (Love between A and A), and this book has been accepted by Singapore National Library board, and is available in Lee Chuan Reference Library Singapore, as reference book. This novel book depicts three homosexual love stories in Christian, Muslim and Hindu religions. One more Tamil book written by Alagersamy Sakthivel, is named as 'Oosi thwarangalum, ulle Nulaiyum ottahangalum (Needle holes and inside entering Camels) also available in National Library board Singapore. This Tamil book is collection of short stories describe about the homosexual life in and around Singapore and Indian migrants. ## Short stories [LGBT](/wiki/LGBT)-themed stories are found in different collections of short stories. Examples are: - *[Corridor: 12 Short Stories](/wiki/Corridor_(collection))* (1999) by [Alfian Sa'at](/wiki/Alfian_Sa%27at), (Raffles Editions [ISBN](/wiki/ISBN_(identifier)) 981-4032-40-9) contains several stories with GLBT themes. 'Pillow' looks at a difficult inter-generational relationship. 'Cubicle' is about the physical intimacy two lesbian students often steal in a public toilet. A flamboyant transvestite character appears in 'Bugis'. Finally, 'Disco' deals with an older man who is starting to discover the youth-dominated gay club scene. This book won the 1998 [Singapore Literature Prize](/wiki/Singapore_Literature_Prize) Commendation Award. - Cross-straits experiences by [Alfian Sa'at](/wiki/Alfian_Sa%27at), simply titled \"Bugis\" in a Singapore-Malaysia collection, *The Merlion and the Hibiscus*. - \"Worlds Apart\", written by J.C. Leahy, found in *In the Shadow of the Merlion*, an anthology of expatriates' experiences in Singapore - Students' collections like *Onewinged* with stories like \"The Transformation\" and \"Extracts from Fairy Tale\" by Cheryl Lim and Sim Yee Chiang respectively - \"Pte M\", a short story by C.S. Chong in *NS: An Air Level Story*, about an effeminate soldier who tries to be intimate with the protagonist who feels nothing but revulsion, despite not rejecting the unwanted advances until the last possible moment. - \"Drum\", a somewhat homophobic short story by [David Leo](/wiki/David_Leo) in *News at Nine* which is modeled after [Herman Melville](/wiki/Herman_Melville)'s [Billy Budd](/wiki/Billy_Budd). - *Butch and Girl Talk*, by Sabariah, a collection of short narrative pieces exclusively about the experiences of young lesbian and bisexual women (and [trans men](/wiki/Trans_men)) in Singapore. It is unclear if the stories are based on the experiences of actual women or primarily fictional. Published by VJ Times, the book is no longer widely available. - *[Let Me Tell You Something About That Night](/wiki/Let_Me_Tell_You_Something_About_That_Night)*, by [Cyril Wong](/wiki/Cyril_Wong), a collection of surreal, urban to mythical fairy tales dealing with issues of queerness and desire, including a story that puts a gay twist on the Chinese myth about the Dragon King (2nd Edition published by [Ethos Books](/wiki/Ethos_Books) in 2012). By the same author, *Ten Things My Father Never Taught me and Other Stories*, which includes both fictional and autobiographical stories about queer characters and growing up gay (published by Epigram Books in 2014 and launched at the Singapore Writers Festival). ## Poetry [Cyril Wong](/wiki/Cyril_Wong) came out into the scene in 2000 with poetry that was confessional in style but universal in scope. Completely \"out\" in newspaper and magazine interviews, he is the first and only openly gay poet to win the National Arts Council's Young Artist Award for Literature and the Singapore Literature Prize. His poetry collections are published by [Firstfruits](/wiki/Firstfruits_Publications), [Ethos Books](/wiki/Ethos_Books) and [Math Paper Press](/wiki/Math_Paper_Press) in Singapore: - *Squatting Quietly* - *The End of His Orbit* - *Below: Absence* - *[Unmarked Treasure](/wiki/Unmarked_Treasure)* - *Like a Seed With its Singular Purpose* - *Excess Baggage and Claim* (Co-authored with Terry Jaensch) - *Oneiros* - *[Tilting Our Plates to Catch the Light](/wiki/Tilting_Our_Plates_to_Catch_the_Light)* (Listed by *[The Straits Times](/wiki/The_Straits_Times)* as among the best five books of 2007) - *Straw, Sticks, Brick* - *The Dictator's Eyebrow* - *After You* - *[The Lover's Inventory](/wiki/The_Lover%27s_Inventory)* [Alvin Pang](/wiki/Alvin_Pang)'s \"The Scent of the Real\", which refers to [Cyril Wong](/wiki/Cyril_Wong), is value-neutral and mentions [Cyril Wong](/wiki/Cyril_Wong)'s sexuality as a fact, not as something disgusting or abject. [Toh Hsien Min](/wiki/Toh_Hsien_Min) and [Yong Shu Hoong](/wiki/Yong_Shu_Hoong) have written poems about friends coming out to them in \"On a Good Friend's Admission that he is Gay\" and \"A Friend's Confession\". Both were suspicious that their friends wanted sexual relations with them. [Gwee Li Sui](/wiki/Gwee_Li_Sui) in the eponymous book with the poem \"Who wants to buy a book of Poems\" refers to the stereotype used on poets as limp-wristed and \"ah kua\". In the poem, \"Edward\", he depicts the life of a cross-dresser during the time [Bugis Street](/wiki/Bugis_Street) was being redeveloped. [Ng Yi-Sheng](/wiki/Ng_Yi-Sheng)'s poetry collection, *last boy*, contains many lyrical poems celebrating and reflecting on gay love and sexuality. ## Non-fiction Academic works addressing various LGBT issues: - The chapter \"Tiptoe Out of the Closet: The Before and After of the Increasingly Visible Gay Community in Singapore\" (2001) by Dr. Russell Heng in *Gay and Lesbian Asia: Culture, Identity, Community* (edited by Gerard Sullivan and Peter A. Jackson, Haworth, New York, 2001, pp. 81–97. Reprinted in the [Journal of Homosexuality](/wiki/Journal_of_Homosexuality) 40(3–4), pp. 81–98. - The chapter entitled \"Singapore\", written by [NUS Sociology Department](/wiki/National_University_of_Singapore) senior lecturer Dr. Laurence Leong Wai Teng in *Sociolegal Control of Homosexuality- A Multi-Nation Comparison* (edited by DJ West and R Green- Plenum Press, New York, 1997)- It examines sociological, historical, and philosophical trends in attitudes and laws relating to homosexuality in 20 countries, plus chapters on Islam and Europe. - *Queer Singapore: Illiberal Citizenship and Mediated Cultures* ([Hong Kong University Press](/wiki/Hong_Kong_University_Press), 2012) edited by Audrey Yue and Jun Zubillaga-Pow contains 12 essays on various aspects of gay and lesbian experiences in past and present Singapore. - *Mobilising Gay Singapore: Rights and Resistance in an Authoritarian State* ([NUS Press](/wiki/NUS_Press), 2014) by Lynette J. Chua tells the history of the gay rights movement in Singapore and asks what a social movement looks like in a state that does not recognise their rights to seek protection of their civil and political liberties. There is also a medical reference regarding sex-reassignment. - *Cries from Within* (1970) by S. [Shan Ratnam](/wiki/Shan_Ratnam); Victor H. H. Goh and Tsoi Wing Foo- an illustrated and user-friendly tome on sex-reassignment surgery and its attendant psychological considerations by two eminent gynaecologists and a psychiatrist. A few works on gender studies for both general readers and academic interests: - *PLU: sexual minorities in Singapore* (2004) (edited by Joseph Lo and Huang Guo Qin, published by Select Books)- a pioneering collection of essays by contributors such as [Alex Au](/wiki/Alex_Au), Jason Wee, [Desmond Sim](/wiki/Desmond_Sim), William Peterson and Laurence Leong. Its style is eclectic, ranging from the academic to the casual. - *The Rainbow Connection: The Internet and the Singapore Gay Community* by Ng King Kang published by KangCuBine Publishing Pte. Ltd. The following are works mainly for general readers: *Sisterhood* by Leona Lo (Select Books, 2003, [ISBN](/wiki/ISBN_(identifier)) 981-04-7198-X)- an exposé of the local [transvestite](/wiki/Transvestite) and [transsexual](/wiki/Transsexual) community by a prominent male-to-female (MTF) transsexual Singaporean. - *My Sisters: Their Stories* by Leona Lo, photographs by Lance Lee (Viscom Editions) - a book on the lives of transsexuals. - \"Boys in the Hood\", chapter 6 of the book *Invisible Trade: High-class sex for sale in Singapore* by Gerrie Lim, an international correspondent for [porn](/wiki/Porn) network [AVN Online](/wiki/AVN_Online). It explores the world of [gay](/wiki/Gay) male escort services. - *F.O.C: Freedom of Choice* by Leslie Lung features 20 short stories about people struggling against their sexual orientation. A short commentary by Lung accompanies each story. The premise of the book is that individuals can choose and change their sexuality. It advocates gay people can and should become straight, but never advocates that they remain gay. - *SQ21: Singapore Queers in the 21st Century*, written by [Ng Yi-Sheng](/wiki/Ng_Yi-Sheng) and edited by Jason Wee (Oogachaga counselling & support 2006, [ISBN](/wiki/ISBN_(identifier)) 981-05-6205-5) - the brainchild of counsellor Clarence Singam, this groundbreaking book was the first of its kind in Asia. It documents the coming-out stories of 13 GLB individuals and a mother of 2 gay sons, using real names and photographs. - *I Will Survive* ([Math Paper Press](/wiki/Math_Paper_Press), 2013) is a collection brings together real-life experiences of love, grace, faith, dignity and courage from 21 ordinary gay, lesbian, bisexual and transgender people in Singapore who have survived extraordinary circumstances. ## LGBT writing on the Internet - The Yawning Bread is a collection of essays on various topics, particularly Singapore [LGBT](/wiki/LGBT) issues. It was started in November 1996 by activist [Alex Au](/wiki/Alex_Au) and has grown to be an influential site for intellectual comment on [gay](/wiki/Gay) issues in Singapore. - Founded by [Sean Foo](/wiki/Sean_Foo), [Dear Straight People](/wiki/Dear_Straight_People) is an LGBT media platform that first made a name of itself through its coming out stories. Over the years, it has gained prominence as one of Asia's leading LGBT publications.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:19:39.373735",
  "title": "LGBTQ literature in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/LGBTQ_literature_in_Singapore"
}