{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:21:37.064594"
  },
  "content": "Singaporean government technologistThis article **may require copy editing for grammar, style, cohesion, tone, or spelling**. You can assist by editing it. *(January 2025)* *(Learn how and when to remove this message)* **Li Hongyi** is the director of the Open Government Products (OGP) division of the [Government Technology Agency of Singapore](/wiki/Government_Technology_Agency) (GovTech). ## Early life and education Li Hongyi is the older son of [Lee Hsien Loong](/wiki/Lee_Hsien_Loong), the former [Prime Minister of Singapore](/wiki/Prime_Minister_of_Singapore), and [Ho Ching](/wiki/Ho_Ching), the former chief executive officer (CEO) of Temasek Holdings. He has a younger brother, Haoyi, and two older half-siblings from his father's first marriage. He studied at [Anglo-Chinese School (Independent)](/wiki/Anglo-Chinese_School_(Independent)) and [Raffles Junior College](/wiki/Raffles_Junior_College). In 2006, Li Hongyi won the [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) Award for mathematics and science and was awarded a [Public Service Commission](/wiki/Public_Service_Commission_(Singapore)) (PSC) Overseas Merit Scholarship to study [economics](/wiki/Economics) at the Massachusetts Institute of Technology (MIT). He switched his course of study partway and ultimately majored in [computer science](/wiki/Computer_science). ## Career ### National service In 2007, when serving his [national service](/wiki/National_service_in_Singapore) as a [Second lieutenant](/wiki/Second_lieutenant), Li Hongyi sent an email to then Minister of Defence, [Teo Chee Hean](/wiki/Teo_Chee_Hean), the [Chief of Defence Force](/wiki/Chief_of_Defence_Force_(Singapore)), the [Chief of Army](/wiki/Chief_of_Army_(Singapore)), and hundreds of military personnel alleging that one of his colleagues had been [absent without leave](/wiki/Absent_without_leave) (AWOL) on two occasions. In his email, which exceeded 2,000 words in length, Li Hongyi criticised the \"quality control of officers\" in the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces) (SAF) and asserted that the absent colleague's continued service in the organisation was \"an embarrassment\". He further wrote that \"the SAF is not a charity organisation and does not owe anyone a career\". The [Ministry of Defence](/wiki/Ministry_of_Defence_(Singapore)) found that Li Hongyi had violated the chain of command by sending that email, and formally charged and reprimanded him after a summary trial. ### Private sector Hongyi worked at [Google](/wiki/Google) from 2011 to 2013 as a product manager before returning to Singapore and joining GovTech to serve his six-year bond. ### Public service Li has held various roles within GovTech, including deputy director of the Government Digital Services Data Science Division, deputy director for data science and AI, deputy director of product and engineering, and director of OGP. In 2017, a team within GovTech led by Li Hongyi released Parking.sg, a mobile application which allows drivers in Singapore to pay parking fees digitally instead of using paper parking coupons at all public car parks managed by the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) (URA) or the [Housing and Development Board](/wiki/Housing_and_Development_Board) (HDB) that do not have vehicle gantries. In 2019, Li Hongyi founded OGP, a new division within GovTech, with the goal of rapidly building and deploying software products across the Singapore Government. Some of the products produced by OGP include: - ISOMER, a tool which allows users to easily create secure, mobile-friendly, static websites. - FormSG, a tool for creating digital government forms. - JARVIS, a platform for the Singapore Police Force allowing users to rapidly conduct searches and aggregate information. - ScamShield, a mobile application which identifies and blocks scam SMSes and calls. ## Personal life Li Hongyi is part of the [Lee family](/wiki/Lee_family_(Singapore)) that has two prime ministers of Singapore, though he ha stated that he has \"no interest in politics\". His parents have denied allegations that they have political ambitions for Li. In 2021, he founded a [rating site](/wiki/Review_site#Rating_site) for Singapore's ice cream parlours.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:21:37.064218",
  "title": "Li Hongyi (administrator)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Li_Hongyi_(administrator)"
}