{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:21:39.067902"
  },
  "content": "Singapore economist (Born 1985) **Li Shengwu** ([Chinese](/wiki/Simplified_Chinese_characters): 李绳武; [pinyin](/wiki/Pinyin): *Lǐ Shéngwǔ*; born 4 February 1985) is a Singaporean economist residing in the United States. He is a professor of economics at [Harvard University](/wiki/Harvard_University), conducting research mainly on [behavioral economics](/wiki/Behavioral_economics). Li is the grandson of [Lee Kuan Yew](/wiki/Lee_Kuan_Yew), the first [prime minister of Singapore](/wiki/Prime_minister_of_Singapore), and professor Lim Chong Yah. ## Education and career Li received a Bachelor of Arts degree in [philosophy, politics and economics](/wiki/Philosophy,_politics_and_economics) from the [University of Oxford](/wiki/University_of_Oxford) in 2009 and obtained a Master of Philosophy degree in economics from Oxford in 2011. Li then pursued a PhD in economics at [Stanford University](/wiki/Stanford_University), working on economic theory and behavioral and experimental economics. Upon completing his dissertation titled *Essays in Theoretical and Behavioral Economics*, Li graduated in 2016. As a student, Li represented Singapore at WSDC 2003 and [Oxford](/wiki/Oxford_Union) and Stanford's debating teams. His notable wins include European Universities Debating Championship 2009 open champion and 2008 open grand finalist; [World Universities Debating Championship](/wiki/World_Universities_Debating_Championship) 2010 best speaker and open grand finalist; and [HWS Round Robin](/wiki/HWS_Round_Robin) 2012 champion. Li joined, in 2016, [Harvard Society of Fellows](/wiki/Harvard_Society_of_Fellows) as a Junior Fellow. He became an assistant professor of economics at Harvard University in 2018 and an associate professor in 2023. On February 27, 2024, he announced that he received tenure. Li received a [Sloan Research Fellowship](/wiki/Sloan_Research_Fellowship) in 2023. ## Personal life and family Li was born in 1985 in Singapore to [Lee Hsien Yang](/wiki/Lee_Hsien_Yang) and Lee Suet Fern. He has two younger brothers, Li Huanwu and Li Shaowu. After the death of Singapore's longtime prime minister [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) in 2015, Li Shengwu's uncle [Lee Hsien Loong](/wiki/Lee_Hsien_Loong), then-prime minister of Singapore, began sparring with his younger siblings, including Li's father [Lee Hsien Yang](/wiki/Lee_Hsien_Yang), over the fate of [38 Oxley Road](/wiki/38_Oxley_Road), the family home that Lee Kuan Yew left behind. When the family dispute became publicized in 2017, Li made a private Facebook post complaining that \"the Singapore government is very litigious and has a pliant court system\". Singapore's [Attorney-General's Chambers](/wiki/Attorney-General_of_Singapore) (AGC) subsequently sued Li for contempt of court. Some believe that Li's post and the ensuing lawsuit are related to the family feud. Li himself claimed that the charges were \"politically motivated\". The AGC offered to stop pursuing their lawsuit if Li agrees to issue an apology that admits contempt of court as well as making \"false and baseless\" statements. However, Li refused to apologize, stating that he has not committed any crimes. The case resolved in 2020, when Li agreed to pay a fine of S$15,000, though he refused to concede that his post is illegal and claimed that he paid the fine \"to buy some peace and quiet\", while the Singapore AGC stated that Li \"contrived excuses for running away\". Even after the resolution of the lawsuit in 2020, Li continued to reside in the United States. He claimed in a 2023 interview with the New York Times that he fears being arrested if he returns to Singapore. According to Li, his uncle [Lee Hsien Loong](/wiki/Lee_Hsien_Loong), the former Prime Minister, \"doesn’t want competing claims to legitimacy\" and would not take chances. Li claimed that his parents would also be in danger if they return to Singapore because the authorities can detain them indefinitely without access to a lawyer. Jewel Stolarchuk from The Independent Singapore observed that government-linked newspapers in Singapore, such as *[The Straits Times](/wiki/The_Straits_Times)*, have remained silent on Li's achievements such as receiving a Sloan Fellowship and obtaining tenure at [Harvard University](/wiki/Harvard_University). Stolarchuk contended that the lack of coverage on Li's father's family members is due to the political pressure from the Singaporean government. - Li Shengwu's profile at [Harvard University](/wiki/Harvard_University) - Li Shengwu publications indexed by [Google Scholar](/wiki/Google_Scholar)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:21:39.067394",
  "title": "Li Shengwu (economist)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Li_Shengwu_(economist)"
}