{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:21:45.806053"
  },
  "content": "The **Library Association of Singapore (LAS)** is a national-level, professional organization for [Singapore](/wiki/Singapore)'s [librarians](/wiki/Librarians) and library workers. ## History LAS was originally part of the Malayan Library Group created in March 1955, which was renamed in 1958 to become the Library Association of Malaya and Singapore. It became the Library Association of Singapore in 1960 as it was split from Persatuan Perpustakaan Persekutuan Tanah Melayu (Malaysia). Then it was reconstituted as the Persatuan Perpustakaan Malaysia, Chawagan Singapura (Library Association of Malaysia, Singapore Branch) in 1964, and finally Persatuan Perpustakaan Singapura in 1966. The name was changed from its [Malay](/wiki/Malay_language) version to the English version used currently only in March 1975. ## Publications LAS is responsible for publishing the Singapore Journal of Library and Information Management (SJLIM) ([ISSN](/wiki/ISSN_(identifier)) 2382-5626). Beginning in 1971, this scholarly journal is written in English and refereed. Another publication is the Singapore Libraries Bulletin for news and information purposes. *In 99 Words: Stories Librarians Tell* ([ISBN](/wiki/ISBN_(identifier)) 9789810767938) is a book published by LAS in 2013 and launched during the 2013 [IFLA](/wiki/International_Federation_of_Library_Associations_and_Institutions) conference held in Singapore. ## International Involvement Together with [International Federation of Library Associations and Institutions](/wiki/International_Federation_of_Library_Associations_and_Institutions) (IFLA) and [National Library Board](/wiki/National_Library_Board) they organized the [IFLA World Library and Information Congress](/wiki/IFLA_World_Library_and_Information_Congress) in 2013. LAS was one of three partners to organize the Asia-Pacific Library and Information Conference (APLIC) held on July 29, 2018, in [Canberra, Australia](/wiki/Canberra,_Australia) - Library Association of Singapore website - Singapore Journal of Library and Information Management website - Singapore Libraries Bulletin\n",
  "language": "en",
  "processed_at": "2026-01-12T11:21:45.805732",
  "title": "Library Association of Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Library_Association_of_Singapore"
}