{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:21:49.719739"
  },
  "content": "Housing and Development Board projectThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Lift Upgrading Programme\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(June 2025)* *(Learn how and when to remove this message)* **Lift Upgrading Programme** (LUP) ([Chinese](/wiki/Chinese_language): 电梯翻新计划, [Malay](/wiki/Malay_language): *Program Peningkatan Lif*) is a [Singapore](/wiki/Singapore) [Housing and Development Board](/wiki/Housing_and_Development_Board) (HDB) project which upgrades and improves the facilities of the lifts at HDB [flats](/wiki/Apartment). This project is for housing blocks built before the year 1996, which were built with [lifts](/wiki/Elevator) that only serve some floors to meet privacy demands and to cut costs. A [poll](/wiki/Opinion_poll) with a 75% majority (calculated among citizen households) in favor is needed for the upgrading to begin. The non-citizen residents who stay in the same HDB block have no polling rights. ## Overview [Singapore](/wiki/Singapore) is an island country with land limited to 700 square kilometers and a population of 4 million; this population density means it is inevitable that most of its residents must live in high-rise apartments and work in high-rise commercial and industrial buildings. Elevators, escalators and moving walks have become a very important part of day-to-day life in [Singapore](/wiki/Singapore). The [HDB](/wiki/Housing_and_Development_Board) started the Lift **Telemonitoring System** (TMS) in 1984 to monitor lifts in high-rise public housing. As at Aug 2007, more than 17,500 lifts are monitored by the system. TMS uses [SCADA](/wiki/SCADA) technology to monitor the status of the lifts in real-time from a centralized master station for events such as breakdown and trapped passengers. The lift maintenance companies are automatically notified of any problem and in most cases, repairs are carried out even before a complaint is received. The introduction of TMS has resulted in better lift performance as historical data allowed the Town Councils, who are maintaining the HDB estates, to pinpoint problem areas and improve the method of maintenance. Besides detecting problems with the lifts, TMS can also be used to carry out remote testing of lifts and other emergency standby equipment. The [HDB](/wiki/Housing_and_Development_Board) has begun to build more apartment buildings that are taller than 30 stories. For these buildings, existing elevator specifications such as speed, central system and hoist way equipment, will have to be improved for elevator manufacturers to design, supply and install higher speed and more sophisticated types of lifts in [HDB](/wiki/Housing_and_Development_Board) estates to ensure better elevator ride, comfort and safety. The [Singapore](/wiki/Singapore) government is in the process of renovating the older public housing estates. Many of these flats had lifts which only stopped at certain floors (e.g. odd/even numbered or every three floors). All lifts installed with staged landings are to be changed so they stop at all floors. The older, conventional relay controlled type would be replaced by new generation lifts with microprocessor control of elevators. It is estimated that S$5 billion would be spent on the upgrading of elevators over the next decade. ## Elevator safety **[New modern elevators](/wiki/Elevator)** are designed to be fail-safe and user-friendly to prevent accidents. The Singapore Lift and Escalator Contractors and Manufacturers Association (SLECMA) have set up a safety committee to create awareness in the usage of elevators and escalators. The association ensures the elevators are installed under the following guidelines: - Prevent any part of the passenger from danger at the leading edges. - Prevent closing of elevator doors when passengers approach, stand near or at the door edge, even from a flat angle. - 2.5 cm from elevator cabin. - 3.0 cm from elevator lobby. - 50 cm for door horizontal sensing. - 1.8 m for door vertical sensing. - Should not fail if any fail-safe related to safety device fails. - Response time of the sensing device should be less than 50 milliseconds. - Stopping time of the door should be less than 200 milliseconds. - The voice & motor noise within control requirements. - Smoke Control - Reliability of Electrical Power Supply - Effects of Fire - Effects of Water - Effects of Electro-Radiation ## Selective Lift Replacement Programme HDB introduced a new Selective Lift Replacement Programme (SLRP) to help replace about 750 old lifts with modern lifts that come with more energy-efficient motors, vision panels and infra-red doors with motion safety sensors for added energy efficiency, safety and security. These lifts were installed between 1987 and 1997, and are in blocks that are already barrier-free and do not need upgrading under the Lift Upgrading Programme (LUP). HDB will help co-pay for the replacement of these lifts when the Town Council is ready to replace them. - - Selective Lift Replacement Programme\n",
  "language": "en",
  "processed_at": "2026-01-12T11:21:49.719215",
  "title": "Lift Upgrading Programme",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Lift_Upgrading_Programme"
}