{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:21:51.044239"
  },
  "content": "International online retail companyThis article needs to be **updated**. Please help update this article to reflect recent events or newly available information. *(December 2021)* **LightInTheBox Holding Co., Ltd.** ([simplified Chinese](/wiki/Simplified_Chinese_characters): 兰亭集势; [traditional Chinese](/wiki/Traditional_Chinese_characters): 蘭亭集勢) is an online clothing sales company which specialises in cheap men's and women's clothes, and other goods that they describe as \"lifestyle products\". The company is headquartered in Singapore and has additional offices in California, [Shanghai](/wiki/Shanghai), and [Beijing](/wiki/Beijing). ## History LightInTheBox was founded in March 2007. The company started with a registered capital of US$3 million. It operated as Light In The Box Limited until March 2008, when it was restructured and incorporated as LightInTheBox Holding Co., Ltd., acting as the ultimate holding company. On June 6, 2013, LightInTheBox opened for trading on the [New York Stock Exchange](/wiki/New_York_Stock_Exchange) (NYSE) under the ticker symbol \"LITB\". According to the Chinese publication *Business Review* ([Chinese](/wiki/Simplified_Chinese_characters): 商界评论), it became \"China's first foreign trade e-commerce stock\". The IPO netted the company [US$](/wiki/US$)79 million, valuing it at $465 million on the first day of trading. Almost three months later, a [class action lawsuit](/wiki/Class_action_lawsuit) was initiated in the [United States District Court for the Southern District of New York](/wiki/United_States_District_Court_for_the_Southern_District_of_New_York), accusing the company of misrepresenting its financial prospects to boost its share prices, which subsequently declined amid weak revenue expectations. - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:21:51.043772",
  "title": "LightInTheBox",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/LightInTheBox"
}