{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:21:53.436276"
  },
  "content": "As with their English counterparts, **lightermen in Singapore** were men who worked on a [lighter](/wiki/Lighter_(barge)) or on a [barge](/wiki/Barge). Their primary role was to transport cargo between ships in the harbour and warehouses along the [Singapore River](/wiki/Singapore_River). They were active in Singapore in the 19th and 20th century, playing a key role in the city's port functions. They were mostly migrant labourers from India or China and worked in teams ranging from two to four aboard [tongkangs](/wiki/Tongkang) and twakows. Lighterman had to be skilled in managing cargo boats as they dealt with many valuable goods that could easily be damaged or misplaced. Before the introduction of motorised boats, they were also required to have the skills to manage their boats with just oar and sail. ## Lighterage in Singapore Singapore developed rapidly in the 19th to 20th century, owing much of its accomplishments to its development as an important trading port. The Singapore River was the initial site of trade and formation of lighterage services was indispensable in Singapore's initial success as the river was too narrow and shallow for ships to enter. Large merchant vessels had to cast anchor at the harbour before transferring their goods into the lighters. From there, lightermen would then transport the cargo between warehouses by the river. These lightermen, by enabling Singapore's smooth functioning as a port, were essential figures that, while lesser known, have contributed greatly to the city's success. As such, the lighterage industry was one of the first major service industries to develop in Singapore. ## History of Lighterman in Singapore ### 19th Century: Indian Lightermen Between the period of 1819 to 1900, South Indian lightermen were the dominant group leading Singapore's lighterage industry. Consisting mainly of Chulias, Muslims who hailed from the [Coromandel Coast](/wiki/Coromandel_Coast) at the southeastern coastal region of the Indian subcontinent in the 1800s, many of the earlier lightermen were also recruited through the [East India Company](/wiki/East_India_Company)'s port at Madras. However, in the later half of the 1800s, the position of these Indian lightermen began to weaken. Numerous reasons for this decline included the transference of the [Straits Settlements](/wiki/Straits_Settlements) to the Colonial Office, which resulted in the loss of the close connection and link with the administration that operated in India. The movement of European merchants' operations from the Singapore River to [New Harbour](/wiki/Keppel_Harbour) also affected the livelihoods of Indian lightermen as lighters were not needed to move goods there. The [tongkang](/wiki/Tongkang) was the first of the lighter boats used by the Indian lightermen along the Singapore River. They were generally large, ranging in size from 20 to 120 tonnes, making it difficult to control. However, this also meant that the lighters could offer greater protection to the cargo they carried. ### 20th Century: Chinese Lightermen Between the early twentieth century up to 1983 when the Singapore government proceeded to remove the lighters from the river, the lighterage industry came to be dominated by Chinese boatmen. During the 19th and early 20th century, many Chinese migrated to Singapore to seek wealth and better lives. This was in response to a cumulation of push and pull factors such as political and social turmoil in China, as well as the rising status of Singapore as an important trading entrepot. With the large influx of Chinese migrants in the late 19th centuries, Chinese lighters and lightermen started to inevitably replace their Indian counterparts. Two main Chinese dialect groups dominated the lighterage industry, namely the [Hokkiens](/wiki/Hoklo_people) from the [Fujian](/wiki/Fujian) province and the [Teochews](/wiki/Teochew_people) from the [Guangdong](/wiki/Guangdong) area. In the years during the initial phase of Chinese domination leading to [World War II](/wiki/World_War_II), the Teochews essentially controlled the lighterage industry along the Singapore River. Nearly three quarters of the twakow in the river then were run and staffed by the Teochews. The other one quarter of the twakow were owned and operated by the Hokkiens. However, the twakow owned by the Hokkien mostly transported cargo from along the waterfront within the Telok Ayer Basin and less from the river itself. This business strategy changed after the war as the Hokkiens became the predominant conveyors of trading commodities in the river. The twakow was the lighter vessel used by Chinese lightermen in the late 19th to early 20th century. By 1900, it had replaced the tongkangs used by Indian lightermen as the preferred lighter for transporting goods between ships as they were more manoevurable. The vessel stemmed from Chinese influence and had a wide hull and nearly flat bottom, features that made it well-suited for carrying heavy cargo in shallow waters. Traditional twakows, which used punt poles and sails, were used up to the 1950s, despite the emergence of motorized versions in the 1930s. ### Late 20th to 21st Century: Changing Urban Landscape and Economy As Singapore became one of the busiest ports in the 20th century, technological advancements such as [containerism](/wiki/Containerization) and the government's decision to rely less on river-borne trade caused the previously crucial role of the Singapore River as a commercial hub to decline. As a result, jobs centered on the Singapore River also started to lose their importance, with the lighterage industry being no exception. The clean up of the Singapore River was also linked to the introduction of the [Housing and Development Board](/wiki/Housing_and_Development_Board) (HDB) which was in charge of rehousing the river communities. Another key factor leading to the decline of lightermen was the Singapore government's effort towards urban-environmental renewal through the Clean Rivers Campaign in the 1980s. The campaign saw the removal of all lighters from the Singapore River in the cleaning process and was the catalyst in their relocation and disappearance. By September 1983, lighterage activities which included approximately 800 lighters were relocated to facilities of the [Port of Singapore](/wiki/Port_of_Singapore) Authority at Pasir Panjang. ## About ### Occupation In Singapore, lightermen existed along the same spectrum of life as [coolies](/wiki/Coolie) as labourers coming from India and China. Yet, they had different roles in the early days of Singapore as they contributed to the city's development. Coolies were often unskilled labourers, employed as manual labour in nearly every sector. They were employed in various areas such as construction and plantation work. On the other hand, lightermen were distinctly situated along the Singapore River, transporting goods from ships to land. Lighterage work also required great skill and strength to load and maneuver lighters. While the main transfer of goods to lighters were carried out by coolies and stevedores, lighters would personally load their craft with the goods, as a poorly loaded lighter could cause the boat to be unstable on water. ### Working conditions The lightermen faced harsh working conditions due to the physically demanding and dangerous nature of the work. The work of lightermen was high risk and immensely back-breaking. Demanding tremendous physical strength, some of the heaviest goods lightermen were tasked with included cases of dried fish that often exceeded 200 kilograms. These crates were particularly tricky to maneuver as they were huge, bulky and haphazardly constructed. Before cranes were introduced, three coolies were even needed to hoist a single case which would be passed on to a waiting lighter. The challenges of handling bulky cargoes were further exacerbated by the conditions inside the vessel. Some of the bigger lighters had wide and deep undercarriages which would become unbearably hot and humid during certain months. Putrid and poisonous smells, coupled with the swaying and lurching unpredictably due to waves made the work as challenging as it was hazardous. It was difficult in itself to maintain one's balance while avoiding being hit by goods that were lowered along the side of the vessel. The work also had erratic hours and lightermen would work when called for. Oftentimes, they were even known to work for more than 24 hours continuously, with minimal rest. Yet, in light of the skill and effort involved, lightermen were often held in higher regard and paid more than their peers in other manual labouring occupations. ### Relationships #### Towkays Lightermen worked under Towkays - Chinese businessmen. The lightermen and their towkays generally shared a strong reciprocal relationship that exceeded the standard for typical employers and employees as it was one that was built on mutual trust and reciprocity. Towkays had the responsibility of caring for the welfare of their lightermen, being a reliable figure that they could turn to regardless of difficulties. This could be through advance payments in financial difficulties, or providing less strenuous work upon retiring from lighterage work. These welfare measures were especially important to lightermen as they were often unmarried migrants with no local connections. #### Coworkers Lightermen worked in teams and often shared close, familial relationships with their coworkers. Many lightermen were employed by and with those that shared a common dialect, surname background, or other kinship lines. This hiring practice was seen to be beneficial in ensuring a cohesive and efficient workforce. As a result, there was a close bond within the lightermen community as they often worked with those whom they shared a social bond with, and treated each other like family members. These positive relationships provided the lightermen with job security and a sense of belonging, and they changed jobs minimally. ## Industrial Organisation Early labour disputes in the lighterage industry and on the river were uncommon and usually unrelated to work conditions. The earliest record of lightermen striking took place in 1842 and was connected to a large-scale protest by the Indian community against the government who did not permit a religious procession to take place along the streets. Lightermen's main concerns in forming a union were to primarily ensure that they received fair payment and compensation for long hours and injuries incurred on the job. Over the years, they formed several unions which achieved varying levels of success. These included the Lightermen's Union, the Transport Vessel Workers Association, and Singapore Lighter Workers' Union. ### Lightermen's Union Formed in the late 1930s with 3000 members, the Lightermen's Union's goal was to address and correct lightermen's grievances over their working conditions. Despite the positive and harmonious relationship between lightermen and their towkays, the 1930s was a period of tension and volatility due to the pre-war environment. Labourers from all occupations gained increasing political awareness, especially of their political strength when banded together, and started forming unions. This also included the lightermen. ### Transport Vessel Workers Association (TVWA) The Lightermen's Union was subsequently reorganised their administration post-war and registered as the Transport Vessel Workers Association (TVWA). Yet, despite being formed for all lightermen, the union started to focus only on their representation of Chinese lightermen. Due to the increasingly militant nature, biased attitudes and persisting rivalries of the union, many Indian lightermen left as a result and formed their own union. This was short lived, however, as a number of Indian lightermen eventually did rejoin the union upon the failure of their own. Through arbitration and negotiation, the union was relatively successful in achieving their goals. Members were able to receive the appropriate amount of pay and work with better conditions. More than that, the TVWA provided the lightermen with a sense of solidarity and allowed them a strong voice. This unity was so strong that it surpassed previous clan rivalries and even reduced the frequency of clashes between the Hokkien and Teochew lightermen. ### Singapore Lighter Workers' Union The Singapore Lighter Workers' Union was formed by Indian lightermen working in the Telok Ayer Basin as a response to the growing Chinese-centric ideals of the Transport Vessel Workers Association. It was generally unsuccessful, however, as it was unable to meet the demands of its members and was filled with controversy. The leaders of the union prioritised their own interests over that of their members and rumors of the misuse of union funds caused internal distrust and dissatisfaction. The union soon collapsed, and further attempts at forming an Indian lightermen union were faced with failure.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:21:53.435843",
  "title": "Lightermen in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Lightermen_in_Singapore"
}