{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:21:57.080726"
  },
  "content": "Chinese physician and social activist **Lim Boon Keng** [OBE](/wiki/Order_of_the_British_Empire) ([Chinese](/wiki/Chinese_language): 林文慶; [Pe̍h-ōe-jī](/wiki/Pe%CC%8Dh-%C5%8De-j%C4%AB): *Lîm Bûn-khèng*; 18 October 1869 – 1 January 1957) was a [Peranakan](/wiki/Peranakan) physician who advocated social and educational reforms in [Singapore](/wiki/Singapore) in the early 20th century. He also served as the president of [Xiamen University](/wiki/Xiamen_University) in China between 1921 and 1937. ## Early life and education Lim was born on 18 October 1869 in [Singapore](/wiki/Singapore), [Straits Settlements](/wiki/Straits_Settlements), as the third generation of a [Peranakan](/wiki/Peranakan) with ancestry from [Haicheng Town](/wiki/Haicheng,_Fujian), [Longhai City](/wiki/Longhai_City), [Fujian Province](/wiki/Fujian) based from his grandfather Lim Mah Peng who first immigrated to [Penang](/wiki/Penang), [Malaya](/wiki/British_Malaya) in 1839, where he married a Straits-born Chinese woman. Lim Mah Peng later moved to [Singapore](/wiki/Singapore) where his only son, Lim Thean Geow ([Chinese](/wiki/Chinese_language): 林天堯; [Pe̍h-ōe-jī](/wiki/Pe%CC%8Dh-%C5%8De-j%C4%AB): *Lîm Thian-giâu*), the father of Lim Boon Keng, was born. Lim studied at [Raffles Institution](/wiki/Raffles_Institution_(Secondary)). However, the death of his parents during his childhood inspired him to pursue a career in medicine. In 1887, Lim became the first Singaporean to receive a [Queen's Scholarship](/wiki/Queen%27s_Scholar). He gained admission to the [University of Edinburgh](/wiki/University_of_Edinburgh) and graduated in 1892 with a first-class honors degree in medicine. ## Career In 1895, Lim became a member of the [Legislative Council of the Straits Settlements](/wiki/Legislative_Council_of_the_Straits_Settlements) in Singapore. The following year, he headed a Commission of Inquiry into the sources of poverty in Singapore. He was also a [Justice of the Peace](/wiki/Justice_of_the_Peace) and a member of the Chinese Advisory Board. Lim founded the [Philomatic society](/wiki/Philomatic_society) and published *[The Straits Chinese Magazine](/wiki/The_Straits_Chinese_Magazine)*, the first Chinese-language magazine in the Straits Settlements in 1897 with [Song Ong Siang](/wiki/Song_Ong_Siang). They were later joined by [Dr. Wu Lien-teh](/wiki/Wu_Lien-teh) as a fellow editor. In the same year, he also campaigned against the wearing of [queues](/wiki/Queue_(hairstyle)) among Chinese men, with the intention of toppling the [Qing dynasty](/wiki/Qing_dynasty) in China. In 1898, Lim co-founded the *Tian Nan Xin Bao* (天南新报) with [Khoo Sook Yuen](/wiki/Khoo_Sook_Yuen). In 1899, Lim co-founded the [Singapore Chinese Girls' School](/wiki/Singapore_Chinese_Girls%27_School) (SCGS) with his friend, [Song Ong Siang](/wiki/Song_Ong_Siang), to facilitate the education of Chinese women living in the Straits Settlements. (Chinese girls were not encouraged to be educated before the 20th century, thus many were illiterate.) The next year, Lim founded the Straits Chinese British Association and later became its president. As a member of the Legislative Council, Lim wanted [opium](/wiki/Opium) banned so he formed the Anti-Opium Society. However, opium was not banned until 1943 during the [Japanese occupation of Singapore](/wiki/Japanese_occupation_of_Singapore). The British reasoned that imposing a ban on opium would mean that the government would lose a source of income from the tax on opium. To make up for the loss, the British governor suggested taxing the people's incomes. The main group that would be affected by this tax would be the merchants. Therefore, the European and Asian merchants opposed this, and opium was not banned, although heavier taxes on opium were imposed. Lim has created an officer of the [Order of the British Empire](/wiki/Order_of_the_British_Empire) on 12 March 1918 (backdated to 1 January 1918) for his services as an Unofficial Member of the Legislative Council of the Straits Settlements. Together with [Lim Nee Soon](/wiki/Lim_Nee_Soon), Lim co-founded OAC Insurance in 1920. OAC was the first locally owned insurance company to be set up in Singapore. The following year in June, upon the request of [Sun Yat-sen](/wiki/Sun_Yat-sen), Lim served as the second president of [Xiamen University](/wiki/Xiamen_University), until the outbreak of the [Second Sino-Japanese War](/wiki/Second_Sino-Japanese_War) in July 1937. The university was founded by Lim's friend, [Tan Kah Kee](/wiki/Tan_Kah_Kee). Lim later went into banking, and co-founded the [Oversea-Chinese Banking Corporation](/wiki/Oversea-Chinese_Banking_Corporation) (OCBC). As the president of Xiamen University, Lim published his own English translation of the Chinese poem *[Li Sao](/wiki/Li_Sao)*, also known as *An Elegy on Encountering Sorrows*. In 1937, Lim founded the Straits Chinese China Relief Fund Committee of Singapore to support China in its war efforts against Japan during the Second Sino-Japanese War. ## Personal life Lim married Margaret Wong Tuan-Keng (黃端瓊; *Huáng Duānqióng*), the eldest daughter of [Sibu](/wiki/Sibu) pioneer [Wong Nai Siong](/wiki/Wong_Nai_Siong), in 1896 at a [Presbyterian church](/wiki/Presbyterian_church). They had four sons, [Robert Lim Kho-Seng](/wiki/Robert_Lim), Francis Lim Kho-Beng, Walter Lim Kho-Leng, and John Lim Kho-Liau. Wong died in 1905 and was buried at [Bukit Brown Cemetery](/wiki/Bukit_Brown_Cemetery). Lim remarried in 1908, to Grace Yin (殷碧霞; *Yīn Bìxiá*) the sister of S.C. Yin with whom he shared a medical practice. They had one son, Lim Peng Han, who later became a race car driver and the first Chinese person to race in [Brooklands](/wiki/Brooklands) in the United Kingdom. They also had a daughter, Ena Lim Guat-Kheng. Lim also had another son, George Lim Peng Thiam, with Chui Geok, the niece of his second wife. ## President of OCA In 1942, Lim's family were interned at a Japanese concentration camp at [Arab Street](/wiki/Arab_Street). Lim was asked by the Japanese to become the leader of the Overseas Chinese Association (OCA). In response, Lim refused, claiming that he was too old to take up the role of president. Lim's wife was then made to kneel down under the scorching sun for four hours at a stretch, in addition to bearing other insults. After [Shinozaki](/wiki/Mamoru_Shinozaki) let him drink beer and persuaded him, telling him that Lim's position as president was merely to be a figurehead without needing to do much work, Lim finally relented. In March 1942, Lim was ordered by the Japanese to raise a \"donation\" of 50 million straits dollars for Japan. However, only 28 million dollars were raised with much difficulty. In response to the anger of Takase, Lim made an emotional speech: > \"We never told a lie. When we promised to give the military contribution, we mean to do it. Financial conditions are now such as to be beyond our control. If we are unable to pay, then die we will. I wish to point out, however, that the manner in which the Government raise this military contribution is without any parallel in any country.\" In the end, the Japanese agreed to a loan for the remaining sum through the [Yokohama Specie Bank](/wiki/Yokohama_Specie_Bank). Known as the grand old man of the Singaporean Chinese community, during the Japanese occupation, Lim feigned a drunken stupor rather than cooperate with the Japanese. ## Later life Lim led his remaining years in recluse in Singapore as an ordinary citizen. He died on 1 January 1957, two months after his 87th birthday. He was buried at [Bidadari Cemetery](/wiki/Bidadari_Cemetery) in Singapore. His wife Grace died in 1972 and was buried there as well. ## Legacy The area now known as [Boon Keng](/wiki/Boon_Keng), including [Boon Keng MRT station](/wiki/Boon_Keng_MRT_station), [Boon Keng Road](/wiki/Boon_Keng_Road) and [Upper Boon Keng Road](/wiki/Upper_Boon_Keng_Road) are named after Lim. ## Bibliography - Cook, John Angus Bethune, *Sunny Singapore: An account of the place and its people, with a sketch of the results of missionary work*, E. Stock, 1907 - Doran, Christine, *The Chinese Origins of Democracy: Dynamic Confucianism in Singapore.*, Nebula, 2010 - Frost, Mark Ravinder, *Singapore: A Biography*, Singapore, 2009. - Frost, Mark Ravinder, *Transcultural Diaspora: The Straits Chinese in Singapore, 1819–1918*, NUS ARI Working Papers, 2003. - Shinozaki, Mamoru (1976). *Secret Record of Japanese Occupation of Singapore* (in Japanese). Tokyo: Hara Shobo. - Tan, Y.S. (12 June 1947). \"The first terrible days in Singapore\". *The Straits Times*. p. 6. Retrieved 4 November 2017. - Tan, Y.S. (13 June 1947). \"How they kept their heads on their shoulders\". *The Straits Times*. p. 4. Retrieved 4 November 2017.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:21:57.080215",
  "title": "Lim Boon Keng",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Lim_Boon_Keng"
}