{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:21:56.897655"
  },
  "content": "War memorial in Singapore The **Lim Bo Seng Memorial** is a [war memorial](/wiki/War_memorial) in [Esplanade Park](/wiki/Esplanade_Park), Singapore. It was erected in 1954 in honour of resistance fighter [Lim Bo Seng](/wiki/Lim_Bo_Seng) for his acts during [World War II](/wiki/World_War_II). The [octagonal](/wiki/Octagonal) [pagoda](/wiki/Pagoda) memorial is the only structure in Singapore that commemorates an individual's efforts in World War II. Plans for a memorial dedicated to Lim were considered by local authorities as early as November 1945. With the establishment of the Lim Bo Seng Memorial Committee in 1946, it proposed a memorial for Lim Bo Seng between 1946 and 1947, though either was rejected or had its plans modified. Its sixth plan, which intended to be the last plan submitted by the committee, was approved by the government in July 1952, where they would built the memorial as part of the proposed Esplanade Park. Works began in September 1953, with its foundation stone laid by British [Commissioner-General](/wiki/Commissioner-General) for Southeast Asia [Malcolm MacDonald](/wiki/Malcolm_MacDonald). The memorial was opened unveiled Commander-in-Chief of the [Far East Land Forces](/wiki/Far_East_Land_Forces) [Charles Loewen](/wiki/Charles_Loewen) on 29 June 1954, the 10th anniversary of Lim's death. The memorial was also the site for the 15th and 50th anniversaries of his death. The Lim Bo Seng Memorial was collectively gazetted as a [National monument](/wiki/National_monuments_of_Singapore) alongside [The Cenotaph](/wiki/The_Cenotaph) and [Tan Kim Seng Fountain](/wiki/Tan_Kim_Seng_Fountain) as the \"Esplanade Park Memorials\" on 28 December 2010. ## Background Lim Bo Seng ([Chinese](/wiki/Chinese_language): 林谋盛) was a [resistance fighter](/wiki/Resistance_fighter) in [World War II](/wiki/World_War_II) (WWII). Born on 27 April 1909 in [Fujian](/wiki/Fujian), China, Lim moved to Singapore at 16 years old. Lim's resistance movements began as early as 1937 when [Japan invaded China](/wiki/Second_Sino-Japanese_War), where he organised boycotts against Japanese products and raised funds for the Chinese war effort. Before the [Japanese captured Singapore](/wiki/Fall_of_Singapore), Lim fled to [British-controlled India](/wiki/India_in_World_War_II) in February 1942, where he joined [Force 136](/wiki/Force_136). In May 1943, he, along with several members of the group, landed in [Japanese-occupied Malaya](/wiki/Japanese-occupied_Malaya) to set up an intelligence network to prepare for [Operation Zipper](/wiki/Operation_Zipper). However, in March 1944, he was captured by the Japanese in [Ipoh](/wiki/Ipoh) after a Force 136 member was tortured to reveal information on Lim's location. Lim refused to tell the Japanese on Force 136's operations, which subsequently led them torture Lim. Lim Bo Seng died on 29 June 1944 in [Batu Gajah](/wiki/Batu_Gajah) Jail, Perak. His remains were transported back to Singapore in December 1945 and he was buried at MacRitchie Reservoir in January 1946. ## History Plans for a memorial to Lim Bo Seng were first considered by local authorities in November 1945. With the establishment of the Lim Bo Seng Memorial Committee in 1946, which had representatives from the [Chinese Nationalist Government](/wiki/Chinese_Nationalist_Government), it proposed a memorial for Lim Bo Seng between 1946 and 1947, with the government rejecting or \"trimming\" five of the committee's proposals, one of them detailing a memorial park at a spot in [MacRitchie Reservoir](/wiki/MacRitchie_Reservoir) where Lim spent time with his family. The committee was frustrated with the government's responses, with its secretary Chuang Hui Tsuan declaring that \"the delay is a painful blow to the Chinese community. Our efforts and time have been wasted\". On 26 September 1951, the committee announced that a sixth proposal will be submitted, which intended to be its final as \"[they] will not tolerate any further shabby treatment\". The proposal was approved by the committee on 27 February 1952 and an agreement was reached between the committee and the government on 5 June 1952, where the memorial will be built as part of [a proposed park in the Esplanade](/wiki/Esplanade_Park). The government approved the plan on 9 July 1952 and was expected to cost [$](/wiki/Straits_dollar)50,000. Works for the Lim Bo Seng memorial began on 8 September 1953, with the British [Commissioner-General](/wiki/Commissioner-General) for Southeast Asia [Malcolm MacDonald](/wiki/Malcolm_MacDonald) laying its [foundation stone](/wiki/Foundation_stone) on 3 November 1953. By December, its concrete foundation was already up. Originally expected to be ready by the end of 1953, it was delayed until January 1954 as the delivery for its roof and marble work was delayed. Its roof was laid in January 1954, though completion for the memorial was delayed until the end of February due to the rain. On 29 June 1954, the memorial was unveiled by Sir [Charles Loewen](/wiki/Charles_Loewen), the [Commander-in-Chief](/wiki/Commander-in-Chief) of the [Far East Land Forces](/wiki/Far_East_Land_Forces), in front of a crowd of people including Lim's widow, her children, and some members of the Force 136 present at the 10th anniversary of Lim Bo Seng. On 29 June 1959, the 15th anniversary of Lim Bo Seng's death was held at the memorial. The 50th anniversary of Lim's death was also held at his memorial on 29 June 1994. On 28 December 2010, Lim Bo Seng Memorial, along with [The Cenotaph](/wiki/The_Cenotaph,_Singapore) and [Tan Kim Seng Fountain](/wiki/Tan_Kim_Seng_Fountain), were collectively gazetted as the \"Esplanade Park memorials\" by the [Preservation of Monuments Board](/wiki/National_Heritage_Board_(Singapore)) as a [National Monument](/wiki/National_monuments_of_Singapore) since they \"honoured individuals for their contributions to the community\". ## Details The Lim Bo Seng Memorial is located in [Esplanade Park](/wiki/Esplanade_Park), which is near [Connaught Drive](/wiki/Connaught_Drive). Designed by [Ng Keng Siang](/wiki/Ng_Keng_Siang), it is modelled after the [nationalist](/wiki/Nationalist_government)-built Victory Memorial in [Nanjing](/wiki/Nanjing), China. The memorial occupies a site donated by the colonial government measuring 100 feet (30 m) by 80 feet (24 m) near [The Padang](/wiki/The_Padang).[*citation needed*] The memorial is a 12 feet (3.7 m) high [octagonal](/wiki/Octagonal) [pagoda](/wiki/Pagoda) made of white marble with a three-tier bronze roof on a marble and concrete [pedestal](/wiki/Pedestal). It is guarded by four [bronze lions](/wiki/Chinese_guardian_lions). Its bronze and marble features are imported from [Hong Kong](/wiki/Hong_Kong). Four bronze plaques with an account of Lim's life are installed on the pedestal. There are written in [English](/wiki/English_language), [Chinese](/wiki/Chinese_language), [Tamil](/wiki/Tamil_language) and [Jawi](/wiki/Jawi_alphabet); the four official languages of [Singapore](/wiki/Singapore). ## Gallery\n",
  "language": "en",
  "processed_at": "2026-01-12T11:21:56.897168",
  "title": "Lim Bo Seng Memorial",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Lim_Bo_Seng_Memorial"
}