{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:22:13.406423"
  },
  "content": "Chief Minister of Singapore from 1956 to 1959 **Lim Yew Hock** ([Chinese](/wiki/Chinese_language): 林有福; [pinyin](/wiki/Pinyin): *Lín Yǒufú*; 15 October 1914 – 30 November 1984) was a Singaporean and Malaysian politician and diplomat who served as [Chief Minister of Singapore](/wiki/Chief_Minister_of_Singapore) from 1956 to 1959. He was the [Member of Parliament](/wiki/Member_of_Parliament) (MP) for [Cairnhill](/wiki/Cairnhill_Single_Member_Constituency) between 1959 and 1963, and had earlier served as a member of the [Legislative Council of Singapore](/wiki/Legislative_Council_of_Singapore) and later the [Legislative Assembly of Singapore](/wiki/Legislative_Assembly_of_Singapore) from 1948 to 1959. Between 1959 and 1963, Lim was the [Leader of the Opposition](/wiki/Leader_of_the_Opposition_(Singapore)) in the Assembly. Following Singapore's [separation](/wiki/Independence_of_Singapore_Agreement_1965) from [Malaysia](/wiki/Malaysia) in 1965, Lim became less involved in Singaporean politics and moved to [Malaya](/wiki/Peninsular_Malaysia). Educated at [Raffles Institution](/wiki/Raffles_Institution), Lim began his career as a clerk before entering politics after [World War II](/wiki/World_War_II). He joined the [Progressive Party](/wiki/Progressive_Party_(Singapore)) in 1947. In 1949, alongside [David Marshall](/wiki/David_Marshall_(Singaporean_politician)), he co-founded the [Labour Front (LF)](/wiki/Labour_Front_(Singapore)). The implementation of the [Rendel Constitution](/wiki/Rendel_Constitution) in 1955, spurred by growing demands for self-governance, led to the first Legislative Assembly election. The LF emerged victorious, with Marshall becoming Chief Minister. Lim was appointed [Minister for Labour](/wiki/Ministry_of_Manpower_(Singapore)) and Welfare and served as Deputy Chief Minister during Marshall's tenure. After the failure of the [1956 Merdeka Talks](/wiki/Merdeka#Singapore) in [London](/wiki/London) to achieve self-governance, Marshall resigned, and Lim succeeded him as Chief Minister. Determined to gain the trust of the [British](/wiki/United_Kingdom) authorities, Lim took a strong stance against communist and leftist movements, including crackdowns on students and teachers from Chinese-medium schools accused of communist sympathies. He led an all-party delegation to London and secured an agreement for a new constitution that granted [Singapore internal self-government](/wiki/Self-governance_of_Singapore#Full_internal_self-government_(1959–1963)) in 1959. However, his actions alienated the Chinese-educated population and eroded support for his administration, boosting the popularity of the opposition [People's Action Party](/wiki/People%27s_Action_Party) (PAP) led by [Lee Kuan Yew](/wiki/Lee_Kuan_Yew). In the [1959 Singaporean general election](/wiki/1959_Singaporean_general_election), Lim's newly formed [Singapore People's Alliance](/wiki/Singapore_People%27s_Alliance) (SPA) was defeated by the PAP, prompting his resignation as Chief Minister. He remained in the Assembly until 1963 but played a diminished role in politics. Afterward, he was appointed [High Commissioner](/wiki/High_Commissioner) of Malaysia to [Australia](/wiki/Australia) by Prime Minister [Tunku Abdul Rahman](/wiki/Tunku_Abdul_Rahman). Lim's legacy is marked by both political significance and quiet mystery. While he played a pivotal role in securing self-governance for Singapore, his political career ended abruptly following his disappearance from public view in 1966 during his diplomatic posting to Australia. He later resurfaced as a [Muslim convert](/wiki/Conversion_to_Islam) living quietly in [Saudi Arabia](/wiki/Saudi_Arabia), where he died in 1984, and his reclusive final years continue to add intrigue to his complex and controversial place in Singapore's history. ## Life ### Early years Lim Yew Hock was born to [Kinmen](/wiki/Kinmen) [Hokkiens](/wiki/Hokkiens) in [Singapore of the Straits Settlements](/wiki/Singapore_in_the_Straits_Settlements) on 15 October 1914. He part of third generation of [overseas Chinese](/wiki/Chinese_Singaporean) in Singapore, and son of Lim Teck Locke. Lim was the eldest son in his family and has a brother and two sisters. He attended English language schools; the Pearl's Hill School and [Outram School](/wiki/Outram_Secondary_School) from a young age. He obtained excellent results and received a four-year scholarship. He was admitted to the prestigious [Raffles Institution](/wiki/Raffles_Institution) and completed his secondary education in 1931. Lim had planned to study law in the [United Kingdom](/wiki/United_Kingdom) upon graduation, and was ready to sit for [Cambridge](/wiki/University_of_Cambridge) entrance examinations. However, his father's sudden death made it impossible. He was only 37 years old when he died, so the assets he left behind was put under supervision of Lim's uncle, while Lim was being mistreated. As the [Great Depression](/wiki/Great_Depression) greatly impacted Singapore's economy, he had to earn a living by provision of \"private tuition\" during his post- secondary education years to support his family, made up of his mother and younger siblings. Soon, he was employed as a junior clerk of the [Imperial Chemical Industries](/wiki/Imperial_Chemical_Industries) in 1934, he transferred to [Cold Storage](/wiki/Cold_Storage_(supermarket)) as a junior clerk, which enabled him to earn a stable income. He was promoted as stenographer because of his outstanding performance in [shorthand](/wiki/Shorthand). During [World War II](/wiki/World_War_II), Japan launched the [Pacific War](/wiki/Pacific_War) in December 1941, leading to the [fall of Singapore](/wiki/Fall_of_Singapore) in February 1942. Lim lived on selling [charcoal](/wiki/Charcoal), until the end of [Japanese occupation](/wiki/Japanese_occupation_of_Singapore) and Singapore's revert to British rule in 1945, when he returned to Cold Storage as private secretary. ### Early political career Lim became involved in [trade union](/wiki/Trade_union) activities right after the war. He resigned from Cold Storage and worked as full-time Secretary-General of the Singapore Clerical and Administrative Workers' Union (SCAWU). In March 1947, he became the first Singaporean to receive the [British Council](/wiki/British_Council) scholarship, to study local trade unions in Britain. With his trade union background, Lim joined the newly formed [Singaporean Progressive Party](/wiki/Progressive_Party_(Singapore)) (PP) led by [Tan Chye Cheng](/wiki/Tan_Chye_Cheng) to start off his political career. In fact, there was a major change in politics of post-war Singapore. On the one hand, there were increasing calls for independence, and on the other hand, the [Straits Settlements](/wiki/Straits_Settlements) was dissolved in 1946 by the [British Government](/wiki/Government_of_the_United_Kingdom), while the [Legislative Council of the Straits Settlements](/wiki/Legislative_Council_of_the_Straits_Settlements) was restructured in 1948 as the [Legislative Council of Singapore](/wiki/Legislative_Council_of_Singapore). In March 1948, Singapore held its first [Legislative Council election](/wiki/1948_Singaporean_general_election) to elect its six out of the 22 Councillors; Three out of five PP candidates won in the election. Lim did not participate in the election, but was appointed as an unofficial member in April, representing the trade union in the council. Lim left the PP in July 1949 and joined the Singaporean [Labour Party](/wiki/Labour_Party_(Singapore)) (LP), whom Lim shared a similar political stand with. Later in June 1950, he was elected LP's Chairman, and was chosen to serve as Chairman of the SCAWU in July of the same year. Under support of the union, he contested in the Keppel constituency during the [Legislative Council election](/wiki/1951_Singaporean_general_election) held in April 1951, and was elected as a Councillor. In this election, the number of elected seats increased from six to nine; The PP won six, LP won two, while the remaining seat was won by an [independent candidate](/wiki/Independent_candidate). In May 1951, Lim founded the [Singapore Trades Union Congress](/wiki/National_Trades_Union_Congress) (STUC) and appointed himself as chairman. In the same year, he was funded by the [United States Information Agency](/wiki/United_States_Information_Agency) to study the [labour movement](/wiki/Labour_movement) in the [America](/wiki/United_States). However, LP's internal struggle among the different factions was growing weaker. The faction led by party's Secretary-General Peter M. Williams successfully coerced Lim to step down as chairman. He eventually left the party. ### Labour Front Soon after leaving the party, Lim was appointed as a member of the Rendel Commission, chaired by British [diplomat](/wiki/Diplomat) [Sir George Rendel](/wiki/George_William_Rendel), which was formed in July 1953 by Singapore's colonial government to provide advice on constitutional development in Singapore. The Commission subsequently submitted a report in February 1954 for major changes in constitutional law of Singapore, heading towards self-rule. At the same time, Lim formed the [Labour Front](/wiki/Labour_Front) (LF) with [Francis Thomas](/wiki/Francis_Thomas_(politician)) and well-known [barrister](/wiki/Barrister) [David Marshall](/wiki/David_Marshall_(Singaporean_politician)), with Marshall as president. In February 1955, a new constitution, the [Rendel Constitution](/wiki/Rendel_Constitution), was implemented. Singapore would create its first [Legislative Assembly](/wiki/Legislative_Assembly_of_Singapore) with majority of the seats popularly elected, to replace the existing Council. 25 out of 32 seats would be elected by the general populace, four seats would be allocated to [Governor](/wiki/List_of_Governors_of_Singapore)-appointed unofficial members, three seats taken by [*ex officio* members](/wiki/Ex_officio_member), respectively the [Chief Secretary](/wiki/Chief_Secretary,_Singapore), [Attorney-General](/wiki/Attorney-General_of_Singapore) and Financial Secretary, while the remaining seat would be for the unofficial Speaker of the Assembly nominated by the Governor. Moreover, the post of the [Chief Minister](/wiki/Chief_Minister_of_Singapore) was added, which would be assumed by the leader of the majority party in the Assembly, sharing the responsibility with the Chief Secretary. The Chief Secretary continued to take control over areas such as external affairs, internal security, defence, broadcasting and public relations, whereas the power of policy-making for the people's welfare lied in the hands of the Chief Minister. The existing Executive Council was replaced by the newly formed [Council of Ministers](/wiki/Cabinet_of_Singapore), chaired by the Governor, composed of the three *[ex officio](/wiki/Ex_officio)* members (Chief Secretary, Attorney General, Financial Secretary) and the remaining six unofficial members, inclusive of the Chief Minister and five other members from the Assembly. Although the Governor presided over the Council of Ministers, the Chief Minister could lead discussions, whereas the other Council members who was also Assemblymen would also take up different ministerial posts, similar to the [Westminster](/wiki/Westminster_system) and [parliamentary system](/wiki/Parliamentary_system). In April 1955, in the subsequent [Legislative Assembly election](/wiki/1955_Singaporean_general_election), the Marshall-led LF won in the election with 10 seats. The remaining seats were taken by the PP (four), [Singapore Alliance](/wiki/Singapore_Alliance_Party) (coalition of [UMNO](/wiki/United_Malays_National_Organisation)－[MCA](/wiki/Malaysian_Chinese_Association)－[SMU](/wiki/List_of_political_parties_in_Malaysia#Singapore_Malay_Union), three), [People's Action Party](/wiki/People%27s_Action_Party) (PAP, three), [Democratic Party](/wiki/Democratic_Party_(Singapore)) (two) and three independent candidates. After the election, Marshall became Singapore's first Chief Minister, but as the LF did not obtain [absolute majority](/wiki/Absolute_majority), he formed a coalition government with the Singapore Alliance, and appointed two pro-LF unofficial nominated members into the Assembly under the help of Governor [Sir John Nicoll](/wiki/John_Fearns_Nicoll). Lim was elected as [Havelock](/wiki/Havelock_Single_Member_Constituency) constituency's Assemblyman. He was the only popularly elected Legislative Councillor who transited over to the Legislative Assembly. After the election, Lim was appointed as Minister for Labour and Welfare under [Marshall's government](/wiki/Chief_ministership_of_David_Marshall), and he resigned from his chairmanship with the STUC. Then, workers were [on strikes](/wiki/Strike_action) one after another, often escalating into civil unrest incidents, so Lim, as Labour and Welfare Minister, had to meditate and assist in subsiding such strikes. He had handled the April–May 1955 [Hock Lee bus strikes](/wiki/Hock_Lee_bus_riots), May–July 1955 [Singapore Harbour Board](/wiki/Singapore_Harbour_Board) Staff Association strikes, and also strikes from hotels, [City Council of Singapore](/wiki/City_Council_of_Singapore), [Singapore Traction Company](/wiki/Singapore_Traction_Company), etc. The Hock Lee bus strikes turned into a riot in May 1955, killing four and injuring many, including two police officers who died. Soon after, Marshall led an all-party delegation with Governor [Sir Robert Black](/wiki/Robert_Brown_Black) to [London](/wiki/London), [UK](/wiki/United_Kingdom) in March 1956, to negotiate with the British for self-rule in Singapore. However, talks failed by May 1956, and in his return to Singapore, Marshall resigned as Chief Minister on 6 June. On 8 June 1956, Marshall's deputy, Lim, who was also Minister for Labour and Welfare, took over and became Singapore's second Chief Minister. Lim's Council of Minister was similar to that of Marshall's. Besides continuing to serve as Labour and Welfare Minister, while the other members include his deputy [Abdul Hamid bin Haji Jumat](/wiki/Abdul_Hamid_bin_Haji_Jumat) (Minister for Local Government, Lands and Housing), J. M. Jumabhoy (Minister for Commerce and Industry), [Francis Thomas](/wiki/Francis_Thomas_(politician)) (Minister for Communications and Works), [Chew Swee Kee](/wiki/Chew_Swee_Kee) (Minister for Education), and [A. J. Braga](/wiki/A._J._Braga) (Minister for Health). Marshall, former Chief Minister, later left the LF and founded the [Worker's Party](/wiki/Workers%27_Party_of_Singapore). In March 1958, Lim was chosen as LF's president. ### Chief Minister #### Chinese schools riots After Lim succeeded as Chief Minister, his top priority was to achieve full self-governance for Singapore from the [British Government](/wiki/Government_of_the_United_Kingdom). The British had taken to account Singapore's future early during Marshall's tenure as Chief Minister. The British had agreed to [Malaya](/wiki/Peninsular_Malaysia)'s ([Malaysia](/wiki/Malaysia)'s predecessor) [independence](/wiki/Independence), and due to the strategic value of Singapore's geography, the British wanted to continue taking control over foreign and defence affairs of Singapore. Hence, the British are inclined to granting Singapore self-governance instead of independence. Though [Sir Robert Black](/wiki/Robert_Brown_Black), the then-Governor, had taken a more open and friendly approach to self-governance for Singapore, as compared to his predecessor [Sir John Nicoll](/wiki/John_Fearns_Nicoll), he believed in gradual self-governance. If the handover of power were to be carried out too hastily, self-governing political leaders might not have sufficient experience in governing. When Marshall led a delegation in March to May 1956 to negotiate talks with the British for self-rule, Black emphasised the priority of internal security issues, while anti-[colonialist](/wiki/Colonialism) [LF](/wiki/Labour_Front) was ineffective in suppression of the series of riots incited by the communists. As a result, talks broke down and complete self-rule was refused. To enhance the internal security, Lim arrested the [leftist](/wiki/Left-wing_politics) trade union members, teachers and students under the [Preservation of Public Security Ordinance](/wiki/Internal_Security_Act_(Singapore)), in September to October 1956 and August 1957 upon taking office. Some of them were deported. In addition, alleged pro-communist organisations such as the Singapore Women's Association, the Chinese Musical Gong Society and the Singapore Chinese Middle School Students Union were banned by the authorities. The series of raids prompted the teachers and students from Chinese schools in October 1956 to launch [sit-in](/wiki/Sit-in) protests at [Chung Cheng High School](/wiki/Chung_Cheng_High_School_(Main)) and [The Chinese High School](/wiki/The_Chinese_High_School_(Singapore)), eventually [escalating into riots](/wiki/Chinese_middle_schools_riots). Under the support of Black, the riot police were dispatched by Lim to clear the school grounds. The Government also imposed a [curfew](/wiki/Curfew) from 26 October to 2 November, suppressing the riots effectively. However, the riots killed 13 and injured hundred more in the five days. Hundreds were arrested, including [assemblymen](/wiki/Legislative_Assembly_of_Singapore) [Lim Chin Siong](/wiki/Lim_Chin_Siong), [Fong Swee Suan](/wiki/Fong_Swee_Suan) and [Devan Nair](/wiki/Devan_Nair), who were [radicals](/wiki/Political_radicalism) from the opposition [PAP](/wiki/People%27s_Action_Party). They were released when the PAP came to power in 1959. #### Negotiation for self-rule British Government was assured of Singapore's internal security due to Lim's tough stance against the communists. This allowed re-negotiations for self-rule from December 1956 to June 1958. Under Lim's leadership, a delegation of representatives from various political parties headed to London in March 1957 to commence talks with the British for self-rule. They reached a consensus in April, while Lim signed a new constitutional agreement with [Secretary of State for the Colonies](/wiki/Secretary_of_State_for_the_Colonies) [Alan Lennox-Boyd](/wiki/Alan_Lennox-Boyd,_1st_Viscount_Boyd_of_Merton) on behalf of Singapore. Representatives from Singapore drafted a new constitution; In August 1958, the [British Parliament](/wiki/Parliament_of_the_United_Kingdom) passed the State of Singapore Act, 1958. Based on the agreement, there would be a great increase in the number of Legislative Assembly seats to be contested in the [1959 election](/wiki/1959_Singaporean_general_election), where all seats would be popularly elected; Singapore would become a self-governing state, with the Chief Minister and the Council of Ministers being replaced respectively by the [Prime Minister](/wiki/Prime_Minister_of_Singapore) and the [Cabinet of Singapore](/wiki/Cabinet_of_Singapore), in charge of all affairs except defence and diplomacy; The [Yang di-Pertuan Negara](/wiki/Yang_di-Pertuan_Negara) would replace the existing Governor. Meanwhile, Lim prompted the Assembly in October 1957 to pass the Singapore Citizenship Ordinance, 1957. The Ordinance defined [Singapore citizens](/wiki/Singaporean_nationality_law) as those who were born in Singapore, who were born outside Singapore whose fathers were born in Singapore and did not hold foreign nationality, who were born in Malaya and had been living in Singapore for at least two years, who were [citizens of the United Kingdom and Colonies](/wiki/Citizen_of_the_United_Kingdom_and_Colonies) living in Singapore for at least two years, and who were foreigners living in Singapore for at least ten years. In recognition of his performance, the [University of Malaya](/wiki/University_of_Malaya) conferred Lim the Honorary [Doctor of Laws](/wiki/Doctor_of_Laws) degree in September 1957, while he was presented the rank of *[Seri Maharaja Mangku Negara](/wiki/Order_of_the_Defender_of_the_Realm#Grand_Commander)* (S.M.N) in August 1958 by [Malaysian King](/wiki/Yang_di-Pertuan_Agong) [Tuanku Abdul Rahman](/wiki/Abdul_Rahman_of_Negeri_Sembilan), therefore being granted the title of [Tun](/wiki/Malay_styles_and_titles#Tun). #### Acknowledging Nanyang Lim had taken a friendlier approach to the [Nanyang University](/wiki/Nanyang_University) prior to the creation of a self-ruling state in June 1959, in order to gain the support of the Chinese [majority](/wiki/Ethnic_majority). Nanyang was the first [university](/wiki/University) with [Chinese](/wiki/Chinese_language) as its main [medium of instruction](/wiki/Medium_of_instruction), which was funded and set up by [Tan Lark Sye](/wiki/Tan_Lark_Sye) and other Singaporean businessmen with [Fujian](/wiki/Fujian) ancestry in 1953. However, Nanyang had been disfavoured by the Government due to the latter's [English](/wiki/English_language)-first policies and the former's alleged [CPM](/wiki/Malayan_Communist_Party) involvement. During [Marshall's](/wiki/David_Marshall_(Singaporean_politician)) rule, the-then Minister for Education [Chew Swee Kee](/wiki/Chew_Swee_Kee) said in May 1956 that degrees conferred by Nanyang would not be recognised by the Government. Ever since Lim took over as Chief Minister, the Government had taken a positive attitude to Nanyang's development despite its policies of non-recognition to Nanyang's degrees. The building of Nanyang's campus was completed in March 1958 and [Sir William Goode](/wiki/William_Allmond_Codrington_Goode), the-then Governor was invited to host the institute's opening ceremony. In October 1958, Lim's government announced that it would provide financial assistance to Nanyang, where half of the $840,000 ([Malaya and British Borneo dollar](/wiki/Malaya_and_British_Borneo_dollar)) would be used for Nanyang's expenditures while the other half would be used for student bursaries. This was the first time Nanyang received government funding. Lim had the Assembly pass the Nanyang University Ordinance in March 1959, officially granting Nanyang university status. Lim also reassessed the possibility of full acknowledgment of Nanyang's university status. He appointed the Prescott Commission in January 1959, chaired by S. L. Prescott to evaluate the standard and recognisability of Nanyang's degree. Nevertheless, in the *Prescott Report* submitted to the Government in March the same year, the performance of Nanyang was bitterly criticised by the commission, which had reservations about granting full recognition to Nanyang's degrees by the Government. Lim, who did not want to lose support from the people and put his election campaign in danger, chose not to release the report immediately. The report was not made public until after the establishment of the State of Singapore in July 1959. By that time Lim had already stepped down as Chief Minister. #### Loss of support Even though Lim had successfully achieved [self-rule](/wiki/Self-governance) from the British, he lost the support of the Chinese [majority](/wiki/Ethnic_majority) due to his tough stance in the crackdown of teachers and students from Chinese schools. He had aroused negative public reaction in several other aspects; This includes the resale of [Christmas Island](/wiki/Christmas_Island) to the [Government of Australia](/wiki/Government_of_Australia) at a low price, under the request of the [British Government](/wiki/Government_of_the_United_Kingdom), and also the insistence of extending the validity of the [Preservation of Public Security Ordinance](/wiki/Internal_Security_Act_(Singapore)). There was a rapid decline in support for the Lim's [LF](/wiki/Labour_Front) due to several other factors: His government was not able to crack down the rapid growth of [secret societies](/wiki/Secret_society), and gang fights occurred frequently, resulting in the deterioration of law and order; The lives of the people had not improved and there was no economic growth; The [PAP](/wiki/People%27s_Action_Party) exposed [Chew Swee Kee](/wiki/Chew_Swee_Kee), the then-Education Minister in early 1959 for being accused of accepting large sums of money. Conversely, under the leadership of Chairman [Toh Chin Chye](/wiki/Toh_Chin_Chye) and Secretary-General [Lee Kuan Yew](/wiki/Lee_Kuan_Yew), the PAP, then opposition, won the support of the people by accusing the LF as being the puppet of the British Government. After a major restructure, the [City Council](/wiki/City_Council_of_Singapore) held its first [election](/wiki/1957_Singapore_City_Council_election) in 1957; The PAP won 13 out of 32 seats while the LF won only four. In the following year, the LF was defeated once again by the PAP in the [Kallang by-election](/wiki/1958_Singapore_City_Council_by-election) held in July. In November 1958, Lim founded the [Singapore People's Alliance](/wiki/Singapore_People%27s_Alliance) (SPA), with himself as chairman. However, he failed in his attempts to re-gain support from the people. Under the new constitution, the [legislature](/wiki/Legislative_Assembly_of_Singapore) was officially dissolved on 31 March 1959. An [election](/wiki/1959_Singaporean_general_election) was held on 30 May of the same year, where all 51 seats in the Assembly will be [popularly elected](/wiki/Direct_election). In this election, 43 out of 51 PAP candidates were elected; Lim-led SPA had only four out of 34 candidates elected; the [United Malays National Organisation](/wiki/United_Malays_National_Organisation) won three seats, while the remaining seat was won by an independent candidate. The [Liberal Socialist Party](/wiki/Liberal_Socialist_Party_(Singapore)) (led by E. H. Holloway), the [Workers' Party](/wiki/Workers%27_Party_of_Singapore) (led by David Marshall) and the LF (led by [Francis Thomas](/wiki/Francis_Thomas_(politician))) did not win any seats. On 3 June 1959, he officially stepped down as Chief Minister. The British officially proclaimed the establishment of the [State of Singapore](/wiki/Self-governance_of_Singapore), marking the end of British colonial rule. PAP's Secretary-General Lee Kuan Yew was sworn in on 5 June as the first [Prime Minister of Singapore](/wiki/Prime_Minister_of_Singapore), where Singapore came under full internal self-governance. ### Political involvement in the Federation Lim won the [Cairnhill](/wiki/Cairnhill_Single_Member_Constituency) seat in the [Legislative Assembly election of 1959](/wiki/1959_Singaporean_general_election) and despite serving as the Leader of the Opposition in the Assembly, his political influence unceasingly reduced. Lim started to lose interest in Singaporean politics; Back during his tenure as Chief Minister, he had already established friendly relations with [Tunku Abdul Rahman](/wiki/Tunku_Abdul_Rahman), the [Prime Minister of Malaya](/wiki/Prime_Minister_of_Malaya), and had expressed increased concern for politics in Malaya; He had also called for the merger of the State of Singapore with Malaya, so as to bring an end to British rule in Singapore. Following a [referendum](/wiki/1962_Singaporean_national_referendum) held in Singapore, the [Federation of Malaysia](/wiki/Malaysia), which comprised [Malaya](/wiki/Federation_of_Malaya), Singapore, [Sarawak](/wiki/Crown_Colony_of_Sarawak) and [North Borneo](/wiki/Crown_Colony_of_North_Borneo), was proclaimed in September 1963. The Legislative Assembly of Singapore held [an election](/wiki/1963_Singaporean_general_election) in the same month; the [SPA](/wiki/Singapore_People%27s_Alliance) had formed the [Singapore Alliance Party](/wiki/Singapore_Alliance_Party) together with some other members of the Opposition back in 1961, under the support of the ruling [Alliance Party in Malaysia](/wiki/Alliance_Party_(Malaysia)), with the attempts of challenging the [PAP](/wiki/People%27s_Action_Party) once again. However, Lim did not contest in the election, while the Alliance Party did not win any seats; Lim resigned his chairmanship from the SPA, fading out of Singaporean politics. In January 1964, the then-Malaysian Prime Minister Tunku Abdul Rahman appointed Lim as Malaysian High Commissioner in [Australia](/wiki/Australia). When Singapore gained independence from Malaysia in August 1965, he acquired [Malaysian citizenship](/wiki/Malaysian_nationality_law) and was issued a [Malaysian passport](/wiki/Malaysian_passport). Remained in office as the High Commissioner, he described himself as a 'child of estranged parents', hoping for the reunification of the two states. #### Disappearance in Australia and return During his term of office in [Canberra](/wiki/Canberra), Australia, he was reported missing on 11 June 1966. A reporter in [Sydney](/wiki/Sydney) claimed to have seen Lim taking a domestic flight to Sydney, with the alias of 'Hawk'. There were also rumours that he patronised the Paradise Club in [Kings Cross, New South Wales](/wiki/Kings_Cross,_New_South_Wales) and Sandra Nelson, a 19-year-old [stripper](/wiki/Stripper) was his all-time favourite. However, Lim's exact whereabouts were unknown, and the police failed to get in touch with Nelson. The Australian police conducted a large-scale search on Lim; the Malaysian Government deployed an envoy to Australia to find his whereabouts, while his wife and two of his daughters also flew there to aid in the search. In an interview by Australian televisions, Lim's wife, in tears, asked for her husband's early return. On the other hand, the envoy from the Malaysian Government said that Lim was probably \"wounded from stumbling upon a stone, and might be currently under care from someone with unknown identity\". While in the Malaysian capital [Kuala Lumpur](/wiki/Kuala_Lumpur), Prime Minister Tunku Abdul Rahman spoke to the Australian reporters over the telephone, calling for Lim to show up; The Tunku said, \"My friend, come back, I will welcome you, and am willing to let bygones be bygones.\" After nine days of disappearance, Vincent Laus, a guesthouse operator drove Lim back to Canberra on 19 June 1966, where Lim was in a poor mental condition. Laus claimed that he met Lim in the Sydney streets and found him vomiting and in discomfort; he brought him back to his guesthouse to rest, only to realise several days later that he was whom the police was searching for. However, the media raised doubts about Laus' words, including why he had taken days to find out Lim's identity, and why he had not sought the police for help, instead of driving Lim personally back to Canberra. The Malaysian Government declined to comment further on his disappearance, while its envoy only described Laus as a '[Good Samaritan](/wiki/Good_Samaritan)', filling the event with mystery. Soon after, Lim returned to Kuala Lumpur in July 1966, under his family members' accompaniment. In Malaysia, Lim was alleged for having an [extramarital affair](/wiki/Extramarital_affair) with Nelson, but Lim denied this. Nelson also spoke to the reporters in Australia; she stressed that she and Lim were just ordinary friends and that she was totally unaware of his whereabouts during his disappearance. [Malaysian Parliament](/wiki/Parliament_of_Malaysia) opposition members even invited her to Malaysia to answer queries about her relationship with Lim, which she declined; but she said that she could send a pile of photographs of her to them if they wanted. Before his disappearance, the [Foreign Ministry](/wiki/Ministry_of_Foreign_Affairs_(Malaysia)) had scheduled for him to serve as Malaysian Ambassador to [Italy](/wiki/Italy). However, after the incident, the Foreign Ministry arranged for him to work as Deputy Secretary (Special Duties) to the Ministry instead. Lim resigned from the Foreign Ministry in August 1968, putting an end to his political career in Malaysia. Shortly after, the Government abruptly revoked his title as Tun in late November of the same year, making his disappearance in Australia a bewildering mystery. According to his autobiography published after his death, he chose to go missing because his relationship with his wife had broken down and he was emotionally overwhelmed. ### Late years Lim met with a traffic accident and was badly injured in September 1961. Despite having made a full recovery, he had occasional health problems. For instance, before his disappearance in June 1966, he had undergone two months of medical treatment earlier on. After resigning from the Malaysian Foreign Affairs Ministry, Lim initially settled in [Malacca](/wiki/Malacca), until his marriage broke down. He then chose to convert to [Islam](/wiki/Islam) and emigrated to [Mecca](/wiki/Mecca), [Saudi Arabia](/wiki/Saudi_Arabia) to start a new life and adopted an Islamic-sounding name, Haji Omar Lim Yew Hock. In his late years, Lim moved to [Jeddah](/wiki/Jeddah). He joined the [Organisation of Islamic Cooperation](/wiki/Organisation_of_Islamic_Cooperation) and worked as a special assistant to the President of the [Islamic Development Bank](/wiki/Islamic_Development_Bank). He died on 30 November 1984 at his Jeddah home, at the age of 70, and was buried in Mecca that night. His autobiography, *Reflections*, was published after his death in [Kuala Lumpur](/wiki/Kuala_Lumpur) in 1986. ## Legacy and reputation Unlike [Lee Kuan Yew](/wiki/Lee_Kuan_Yew), [David Marshall](/wiki/David_Marshall_(Singaporean_politician)), [Toh Chin Chye](/wiki/Toh_Chin_Chye) and other Singaporean political leaders who emerged after [World War II](/wiki/World_War_II), who received their [tertiary education](/wiki/Higher_education) in prestigious [UK](/wiki/United_Kingdom) institutions, Lim had only received local education. Despite this, he started work as a clerk and later joined [trade unions](/wiki/Trade_union). He was elected to the [Legislative Council](/wiki/Legislative_Council_of_Singapore), later the [Legislative Assembly](/wiki/Legislative_Assembly_of_Singapore), and was eventually appointed as [Chief Minister](/wiki/Chief_Minister_of_Singapore), becoming an influential politician in colonial Singapore. Unlike his predecessor Marshall, Lim chose to cooperate with the British. He adopted a tough stance against [leftist](/wiki/Leftist) groups, students and teachers, gaining trust from the British, leading to re-negotiations for self-rule with the British. Under his leadership, Singapore reached an agreement with Britain following a series of talks, granting full internal self-rule in 1959. However, he lost the support of the Chinese majority due to his crackdown of teachers and students in Chinese schools. Moreover, the British had gradually changed their position to support the opposition [PAP](/wiki/People%27s_Action_Party) and its leader Lee Kuan Yew throughout the successive self-rule talks in London, tipping Lee as the potential future leader of Singapore. Despite having achieved full internal self-rule for Singapore, he lost the support of the people, handing over the post of [Prime Minister](/wiki/Prime_Minister_of_Singapore) to Lee. There have been views, showing that despite losing the support of the people, he had achieved full internal self-governance for Singapore and eliminated left-wing influence in the PAP, paving the way for Lee and his PAP to remain in power thereafter for a long period of time. After he stepped down as Chief Minister, he gradually declined in Singaporean politics. His political career in Singapore came to an end when he chose not to contest in the Legislative Assembly election in 1963. Lim got involved in Malaysian politics the following year. However, it, too, came to an end after his disappearance in 1966 in [Australia](/wiki/Australia). He eventually chose to lead a low-profile life in [Saudi Arabia](/wiki/Saudi_Arabia) and was no longer involved in Singaporean nor Malaysian politics. Lim made such an evaluation about himself in his autobiography published after his death: > I have always been humble, irrespective of my position in life ... I have found that there is no true greatness in greatness itself, but there is truly greatness in humility. Lim Yew Hock was not great when he was Chief Minister in Singapore, but Chief Minister Lim Yew Hock was great, when he remained humble, in his relationship with his fellow men. ## Personal life Lim married Chia Kim Neo on 12 January 1937. They had one son and four daughters. After having been through his disappearance in 1966 and resignation from the Malaysian Government in 1968, Lim's marriage with Chia broke down. When he converted to [Islam](/wiki/Islam) and was living in [Saudi Arabia](/wiki/Saudi_Arabia) in his late years, he remarried ethnic Chinese Hajjah Hasnah Abdullah, another [Muslim](/wiki/Muslim) convert. Both of them had a daughter with the name of Hayati. ## Works - *Reflections*. Kuala Lumpur: Pustaka Antara, 1986. [ISBN](/wiki/ISBN_(identifier)) 978-967-937-029-4 ## Honours ### Foreign honours - [Malaya](/wiki/Federation_of_Malaya) - Honorary Grand Commander of the [Order of the Defender of the Realm](/wiki/Order_of_the_Defender_of_the_Realm#Grand_Commander) (SMN (K)) – **Tun** (conferred 31 August 1958, revoked 1968) - [Brunei](/wiki/Brunei) - [Order of Seri Paduka Mahkota Brunei](/wiki/Order_of_Seri_Paduka_Mahkota_Brunei) Second Class (DPMB; 1961) – *Dato Paduka* ### Honorary degrees - **[Doctor of Laws](/wiki/Doctor_of_Laws)** - [University of Malaya](/wiki/University_of_Malaya) (September 1957) ### Titles - Lim Yew Hock (15 October 1914 - August 1958) - Tun Lim Yew Hock, SMN (August 1958 - November 1968) - Lim Yew Hock (November 1968 – 1972) - Haji Omar Lim Yew Hock (1972–30 November 1984) ## Notes - Singapore portal - Politics portal - Biography portal ### English-language ### Chinese-language Library resources about **Lim Yew Hock** - Resources in your library - Resources in other libraries **By Lim Yew Hock** - Resources in your library - Resources in other libraries - Legislative Council election, 1951 - Legislative Assembly election, 1955 - Legislative Assembly election, 1959 Political officesPreceded by[David Marshall](/wiki/David_Marshall_(Singaporean_politician)) **[Chief Minister of Singapore](/wiki/Chief_Minister_of_Singapore)** 1956–1959**Office abolished** [Parliament of Singapore](/wiki/Parliament_of_Singapore)Preceded bySoh Ghee Soon **Member of the [Legislative Assembly](/wiki/Legislative_Assembly_of_Singapore) for [Cairnhill](/wiki/Cairnhill_Single_Member_Constituency)** 1959–1963Succeeded by[Lim Kim San](/wiki/Lim_Kim_San)**New constituency** **Member of the [Legislative Assembly](/wiki/Legislative_Assembly_of_Singapore) for [Havelock](/wiki/Havelock_Constituency)** 1955–1959Succeeded byPeter Lau Por Tuck\n",
  "language": "en",
  "processed_at": "2026-01-12T11:22:13.406033",
  "title": "Lim Yew Hock",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Lim_Yew_Hock"
}