{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:21:59.701147"
  },
  "content": "Planning Area in North Region, SingaporePlanning Area in West Region, Singapore **Lim Chu Kang**, often abbreviated as **LCK**, is a [planning area](/wiki/Planning_areas_of_Singapore) located in the [North Region](/wiki/North_Region,_Singapore) of [Singapore](/wiki/Singapore). It shares its boundaries with the [Western Water Catchment](/wiki/Western_Water_Catchment) to the west and south, [Sungei Kadut](/wiki/Sungei_Kadut) to the east and the [Straits of Johor](/wiki/Straits_of_Johor) to the north. Unlike most parts of Singapore which have undergone extensive [urban development](/wiki/Urban_development), Lim Chu Kang has remained largely undeveloped and continues to serve as one of the few rural zones in the country. The area is characterised by its agricultural activities and pockets of forested land. The rural nature of Lim Chu Kang is reflected in its landscape and land use. It is home to many farms, including [vegetable](/wiki/Vegetable_farming) and [livestock](/wiki/Livestock) farms, [fish hatcheries](/wiki/Fish_hatcheries) and [nurseries](/wiki/Plant_nursery), which supply a portion of Singapore's local produce. The area's limited public transport access, low population density and absence of high-rise buildings further distinguish it from the rest of the country. ## History ### Early years Lim Chu Kang Village was founded by [Neo Ao Tiew](/wiki/Neo_Ao_Tiew) ([traditional Chinese](/wiki/Traditional_Chinese_characters): 梁後宙; [simplified Chinese](/wiki/Simplified_Chinese_characters): 梁后宙; [Pe̍h-ōe-jī](/wiki/Pe%CC%8Dh-%C5%8De-j%C4%AB): *Niô͘ Āu-tiū*; 1884 - 1975), a [Chinese](/wiki/Han_Chinese) immigrant from [Fujian](/wiki/Fujian) who was the [sheriff](/wiki/Sheriff) of the village. \"Lim\" was taken from Lim Chwee Chian who was the [kangchu](/wiki/Kangchu_system#Singapore), or leader, of the area. The village is on the banks of the Sungei [Kranji](/wiki/Kranji) and was controlled by the Lim [clan](/wiki/Clan). Neo Tiew also set up a [primary school](/wiki/Primary_school) and health centre in the village. Neo Tiew Road is named after him. The area was originally noted for its numerous [pepper](/wiki/Black_pepper) and [gambier](/wiki/Uncaria) plantations. Later there were [rubber](/wiki/Rubber) plantations, e.g. Namazie-Cashin rubber estates. ### Japanese occupation of Singapore Lim Chu Kang was one of the locations where the [Imperial Japanese Army](/wiki/Imperial_Japanese_Army) first landed on the north-western coastline on 8 February 1942 during the [Invasion of Singapore](/wiki/Invasion_of_Singapore) of the [World War II](/wiki/World_War_II), catching the defending [22nd Brigade Australian soldiers](/wiki/22nd_Brigade_(Australia)) by surprise. The battle was fought over the night between the Imperial Japanese Army and Australian soldiers, which saw some 360 Australian soldiers killed despite having inflicted heavy casualties on the Japanese soldiers. ### Ama Keng Village Ama Keng Village (亞媽宮村) was one of the three villages in the Lim Chu Kang, together with Neo Tiew and Sungei Gedong. It takes its name from the Mazu, the goddess of the sea in 1900. In the 1950s, the government developed the bustling farming site to serve as the main food production centre. In 1980s, residents of the Ama Keng were resettled and all eventually moved out to Jurong West, Choa Chu Kang and Yew Tee. After the last resident left, on 10 April 2002, the SAF took possession of the entire Ama Keng for military training use. On 27 September 2012, an SAF serviceman died during training in the camp. After the removal of the military training area in [Tengah](/wiki/Tengah,_Singapore) by 2016, it became the largest training ground for the Lim Chu Kang and Keat Hong camps. In the 1960s and 1970s, Ama Keng was well-served by shops, a police station as well as a maternity and child welfare centre. All these were closed down by 1990. The Ama Keng English School was founded in 1951 and was moved to Choa Chu Kang in 1990 and renamed to South View Primary School. The old school building became a workers' quarters and military training ground. ### Neo Tiew Neo Tiew is named after [Neo Ao Tiew](/wiki/Neo_Ao_Tiew) (梁後宙), a prominent Chinese businessman. Neo is credited with the development of the Lim Chu Kang area, where he built roads, houses and a seaport. He was also the founder and [sheriff](/wiki/Sheriff) of Lim Chu Kang Village. In 1967, the British colonial government named a 3.5[km](/wiki/Kilometer) stretch of road \"Neo Tiew Road\" or \"Neo Tiew Lane\" in recognition of his contributions to the area. On 17 February 2011, most parts of Neo Tiew became a military training area. ### Sungei Gedong In the 1960s, Sungei Gedong Road was lined with shophouses and cinemas. A major plan by the government to move residents into HDB flats have seen the decline of the small town. A small HDB estate which was opposite Lim Chu Kang Road was built in the early 1980s, but had been cleared by the late 1990s and expanded the Sungei Gedong Camp's military training area in 2000s. On 11 July 2001, SAF took possession of the entire Sungei Gedong for military training area. ### Lim Chu Kang Bus Terminal In the 1980s, Lim Chu Kang Road End Bus Terminal was served by Services 172 (to Shenton Way Bus Terminal and later shortened to loop at Jalan Anak Bukit) and 206 (to Jurong Bus Interchange and later amended to [Boon Lay Bus Interchange](/wiki/Boon_Lay_Bus_Interchange).) On 3 January 1993, route 172 was amended to Boon Lay Interchange. On 18 July 1993, new service 175 was introduced from Lim Chu Kang to Upper Bukit Timah Road (Loop) replacing route 206 which was withdrawn. In 2005 service 175 was shortened to Bukit Panjang, amended to loop at the Lim Chu Kang Road End and renumbered service 975. The bus stop is renamed as Police Coast Guard. ### BBC Far Eastern Relay Station In 1978 the [BBC Far Eastern Relay Station](/wiki/BBC_Far_Eastern_Relay_Station) began broadcasting radio programmes addressing the largest audiences in Asia of the [BBC World Service](/wiki/BBC_World_Service) from Kranji. Closure of the site was announced in July 2023. ## Today Today, Lim Chu Kang is still largely [rural](/wiki/Rural) and is located in close proximity with the [Western Water Catchment](/wiki/Western_Water_Catchment). Lim Chu Kang is served by two main roads known as Lim Chu Kang Road and [Old Choa Chu Kang Road](/wiki/Choa_Chu_Kang_Road). As this area is still undeveloped, its land use primarily consists of military training areas, [agriculture](/wiki/Agriculture), [farms](/wiki/Farms), the only remaining cemeteries in Singapore (due to exhumations in others to make way for new developments) and a major [cinerarium](/wiki/Cinerarium). There are also side-roads, like [Jalan Sungei Poyan](/wiki/Poyan_Reservoir) and Jalan Bahtera. The area will not be used for residential purposes in the near future or in the Land Use Plan 2030. Rather, it will largely retain its agricultural and military value. In 2017, it was announced that approximately 106 hectares of surrounding land — an area roughly the size of 75 football fields was going to be acquired to make way for the expansion of [Tengah Air Base](/wiki/Tengah_Air_Base), which will accommodate some of the assets and facilities from Paya Lebar Air Base, scheduled to be vacated and relocated by 2030. Murai Farmway, Murai Urban Training Facility, Ama Keng (entire military training area) and more than 50,000 graves was affected by the acquisition. The SAFTI Live Firing Area boundary was trimmed by 30 per cent. The 62 farms in the western part of Lim Chu Kang was cleared progressively from April 2020 to December 2022, to make way for military training areas. In June 2025, a newly realigned Lim Chu Kang Road was opened to replace the previous route which was decommissioned at the same time to make way for the expansion of the [Tengah Air Base](/wiki/Tengah_Air_Base). Various types of farms where sustainable agriculture is practiced such as vegetable, goat and crocodile farms give city dwellers an insight on nature. It has also been an increasingly popular exploration for tourists in recent years, due in part to its close proximity to the [Kranji MRT station](/wiki/Kranji_MRT_station). ### Ama Keng Chinese Temple The Ama Keng Chinese Temple (亞媽宮) in Lim Chu Kang was built in 1900 to worship [Mazu](/wiki/Mazu), the holy mother, a goddess of peace and happiness. *Ama* means \"grandmother\" in [Teochew](/wiki/Teochew_dialect) and [Hokkien](/wiki/Min_Nan), and *keng* means \"[temple](/wiki/Temple)\". The \"incense ashes\" of this temple were brought in from [Wak Hai Cheng Bio Temple](/wiki/Wak_Hai_Cheng_Bio) (粵海清廟), the oldest Teochew temple in Singapore. The first temple was made of [attap](/wiki/Nypa_fruticans). The temple was renovated in 1943 with a [zinc](/wiki/Zinc) roof and [timber](/wiki/Timber). In 1965, it was redeveloped with a [tiled](/wiki/Tile) roof, and the renovations cost [S$](/wiki/S$)16,000. The temple holds [wayang](/wiki/Wayang) performances a few times a year. In the late 1980s, the government acquired the temple's land for military purposes. The temple committee, residents and devotees attempted to petition against the acquisition without success, and the temple was eventually demolished. All of the Ama Keng Road was eventually closed down during COVID-19 pandemic and expunged the road. ### Lim Chu Kang Rural Centre In 1979, a [Housing Development Board](/wiki/Housing_Development_Board) estate was constructed in Neo Tiew. In addition to public housing units, a wet market and an old playground were also constructed in this estate. In 2002, the entire estate was sold back to the government in an en-bloc sale; its residents moved to newly built housing units in [Jurong West](/wiki/Jurong_West). The remains of the old housing estate are currently used by the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces) for their [Fighting in Built-Up Areas](/wiki/Urban_warfare) (FIBUA) training from 2004, which has restricted access and only accessible from the Sungei Gedong Camp (TRMC) Operations Room. In 2012, the site was used for the shooting of a war scene in the film, *[Ah Boys to Men](/wiki/Ah_Boys_to_Men)*. - [List of Kangchu system placename etymologies](/wiki/List_of_Kangchu_system_placename_etymologies)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:21:59.700376",
  "title": "Lim Chu Kang",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Lim_Chu_Kang"
}