{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:22:09.054057"
  },
  "content": "Singaporean civil servant **Lim Siong Guan**, [DUNU (First Class)](/wiki/Darjah_Utama_Nila_Utama) ([Chinese](/wiki/Chinese_language): 林祥源; [pinyin](/wiki/Pinyin): *Lín Xiángyuán*, born 1947) is currently advisor to the group executive committee of [GIC](/wiki/GIC_Private_Limited), Singapore's sovereign wealth fund. He was group president of [GIC](/wiki/GIC_Private_Limited) from 2007 until his retirement at the end of 2016. ## Education Lim was educated at the [Anglo-Chinese School](/wiki/Anglo-Chinese_School), Singapore. He was awarded the President's Scholarship to study at the [University of Adelaide](/wiki/University_of_Adelaide), Australia, where he graduated with First Class Honours in Mechanical Engineering in 1969. He attained a Postgraduate Diploma in Business Administration from the [National University of Singapore](/wiki/National_University_of_Singapore) in 1975. ## Career Lim was the head of the [Singapore Civil Service](/wiki/Singapore_Civil_Service) from September 1999 to March 2005. He was the permanent secretary of the Ministry of Defence from July 1981 to May 1994, permanent secretary in the Prime Minister's Office from June 1994 to July 1998, (concurrently) permanent secretary of the Ministry of Education from April 1997 to June 1999, and permanent secretary of the Ministry of Finance (June 1999 to September 2006). He was the first principal private secretary to former prime minister Lee Kuan Yew from May 1978 to June 1981. Lim was the chairman of the [Accounting and Corporate Regulatory Authority](/wiki/Accounting_and_Corporate_Regulatory_Authority) (ACRA) and the [Inland Revenue Authority of Singapore](/wiki/Inland_Revenue_Authority_of_Singapore) from 2004 to 2006. Previously he had been the chairman of the [Central Provident Fund](/wiki/Central_Provident_Fund) Board from 1986 to 1994 and deputy chairman of the [Board of Commissioners of Currency, Singapore](/wiki/Board_of_Commissioners_of_Currency,_Singapore) (now absorbed into the [Monetary Authority of Singapore](/wiki/Monetary_Authority_of_Singapore))from 1999 to 2002. He was a board member of the Monetary Authority of Singapore from 1999 to 2006. In 2005, Lim was one of the 3-member Presidential Elections Committee who reviewed the qualifications of candidates for the [2005 Singapore President Elections](/wiki/2005_Singaporean_presidential_election). Lim is an adjunct professor of the [Lee Kuan Yew School of Public Policy](/wiki/Lee_Kuan_Yew_School_of_Public_Policy) and has been a member of the Lee Kuan Yew Exchange Fellowship from 2005 to 2006. He has been a director of [Temasek Holdings](/wiki/Temasek_Holdings) Pte. Ltd., a director of [DBS Bank](/wiki/DBS_Bank) Ltd, a director of [Neptune Orient Lines Limited](/wiki/Neptune_Orient_Lines_Limited), and variously chairman or director of a number of companies which are now part of the [Singapore Technologies Engineering](/wiki/Singapore_Technologies_Engineering) group of companies. He is also a member of the international advisory panel of the Asia Competitiveness Institute. He was chairman of the [Economic Development Board](/wiki/Economic_Development_Board) from October 2006 to June 2009. He was first appointed group managing director of Government of Singapore Investment Corporation on 22 September 2007. Lim was appointed the group president of the [Government of Singapore Investment Corporation](/wiki/Government_of_Singapore_Investment_Corporation) (GIC), a newly created role that oversees all three GIC investment units: GIC Real Estate, GIC Asset Management and GIC Special Investments on 1 July 2009. Lim was awarded the [Order of Nila Utama](/wiki/Darjah_Utama_Nila_Utama) (First Class) in 2006, the [Meritorious Service Medal](/wiki/Pingat_Jasa_Gemilang) in 1991 and the [Public Administration Medal](/wiki/Pingat_Pentadbiran_Awam) (Gold) in 1982. In 2014, a book Lim co-authored with his daughter, Joanne H Lim, *The Leader, The Teacher & You* ([World Scientific](/wiki/World_Scientific), 2013), co-won the [Singapore Literature Prize](/wiki/Singapore_Literature_Prize) for English Non-fiction. In 2016, Lim and his daughter released another book, *Winning With Honour in Relationships, Family, Organisations, Leadership, And Life* ([World Scientific](/wiki/World_Scientific)). ## Honour (Singapore) In August 2014, Lim founded Honour Singapore, a non-profit organisation advocating a culture of [honour](/wiki/Honour), as founding chairman. It attracted scrutiny on social media when it was revealed that all the original members of the board are also senior members of the Full Gospel Business (FGB) Singapore, a group that believes in bringing the Christian teachings to the \"marketplace\" and all levels of society. Lim denied categorically that Honour Singapore had Christian inclination, and that Honour Singapore and FGB Singapore share the same office for convenience. The organisation has since added Mohammad Alami Musa, non-executive President of the [Islamic Religious Council of Singapore](/wiki/Majlis_Ugama_Islam_Singapura), to its board in 2016. ## Bibliography - Lim, Siong Guan (2018). *Can Singapore fall? making the future for Singapore*. IPS-Nathan lectures. Singapore: World Scientific Publishing Co. Pte. Ltd. [ISBN](/wiki/ISBN_(identifier)) 978-981-323-862-6. - *The Leader, The Teacher & You* ([World Scientific](/wiki/World_Scientific), 2013) [ISBN](/wiki/ISBN_(identifier)) 978-1-783263-97-4 - *Winning With Honour in Relationships, Family, Organisations, Leadership, And Life* ([World Scientific](/wiki/World_Scientific), 2016) [ISBN](/wiki/ISBN_(identifier)) 978-981-3108-63-9\n",
  "language": "en",
  "processed_at": "2026-01-12T11:22:09.053654",
  "title": "Lim Siong Guan",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Lim_Siong_Guan"
}