{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:22:07.425041"
  },
  "content": "Singaporean politicianThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Lim Kim San\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(October 2021)* *(Learn how and when to remove this message)* **Lim Kim San** ([Chinese](/wiki/Chinese_language): 林金山; [Pe̍h-ōe-jī](/wiki/Pe%CC%8Dh-%C5%8De-j%C4%AB): *Lîm Kim-san*; [pinyin](/wiki/Pinyin): *Lín Jīnshān*; 30 November 1916 – 20 July 2006) was a Singaporean businessman, civil servant, and politician who served as a [Cabinet minister](/wiki/Cabinet_of_Singapore) with a variety of portfolios between 1965 and 1981. Prior to his tenure as a [member of parliament](/wiki/Parliament_of_Singapore), Lim was appointed chairman of Singapore's newly created [Housing & Development Board](/wiki/Housing_Development_Board) (HDB), and he would go on to be recognized for the HDB's success in its resolution of Singapore's housing shortage. Following his elected political career, Lim would go on to hold other positions in Singapore's public sector. ## Early life and education Born in 1916 in [Singapore](/wiki/Singapore), Lim was the eldest of six children. He was educated at Oldham Hall School and the [Anglo-Chinese School](/wiki/Anglo-Chinese_School) before graduating from [Raffles College](/wiki/National_University_of_Singapore) in 1939 with a diploma in [economics](/wiki/Economics). During [World War II](/wiki/World_War_II), Lim was tortured by the [Kempeitai](/wiki/Kempeitai), and was labeled as a [communist](/wiki/Communist) and [British](/wiki/British_Empire) sympathiser by occupying Japanese forces. Following the war, Lim stated that those who survived the horror and the brutality of the [Japanese occupation](/wiki/Japanese_occupation_of_Singapore) \"will never forget them.\" He added that the traumatic and humiliating experience politicised his generation of Singaporeans and made them vow to \"never let our fate be decided by others.\" ## Civil career In 1951, Lim was appointed a member of the [Public Service Commission](/wiki/Public_Service_Commission_(Singapore)) and later became its deputy Chairman. After retiring from politics in 1980, Lim remained active in the public sector. Overseeing reservoir development and expansion, Lim served as Chairman of the [Public Utilities Board](/wiki/Public_Utilities_Board_(Singapore)) following appointment in 1970. He was then appointed as Chairman of the [Port of Singapore Authority](/wiki/Port_of_Singapore_Authority) between 1979 and 1994, and from 1981 to 1982, served as the managing director of the [Monetary Authority of Singapore](/wiki/Monetary_Authority_of_Singapore). Lim was also Chairman of the [Council of Presidential Advisers](/wiki/Council_of_Presidential_Advisers) between 1992 and 2003. ### Housing & Development Board In 1960, Lim was appointed Chairman of the [Housing & Development Board](/wiki/Housing_Development_Board). Due to a rapidly increasing population, more than 400,000 people were either living in over-crowded conditions in ramshackle “shophouse” buildings or in squatter settlements with substandard living conditions. Lim had volunteered for the position and was not paid for his three years of service. During his tenure, he oversaw the construction of high-rise, low-cost apartments that would eventually become the main source of housing for Singaporeans. Defying detraction from former employees of the Singapore Improvement Trust, Lim would forgo a detailed planning stage and instead chose a \"rough and ready\" approach using rough estimates of the housing requirement. A committee was eventually set up under Lim Tay Boh to find out whether the HDB had the capability and the materials to reach the construction goal. In the first Five Year Housing Programme, HDB completed 5,000 units of housing by 1965. The largest project at that time was [Queenstown](/wiki/Queenstown,_Singapore), a satellite residential area of more than 17,500 flats, capable of housing close to 22,000 people. The new neighborhood was built as a self-contained entity, with all amenities and shops built along with the houses, so people would not need to travel to other areas for basic necessities. This philosophy—which was ultimately extended into modernity with the planning concept of the [New Town](/wiki/New_towns_of_Singapore) was meant to lower the rate of congestion and burden on the [central business district](/wiki/Central_business_district). In May 1961, the [Bukit Ho Swee Fire](/wiki/Bukit_Ho_Swee_Fire) broke out and some 16,000 people became homeless. Under Lim's guidance, the HDB took four years to complete the relocation and reconstruction of the lost housing, and 1,200 housing flats were made available to those who lost their homes in the fire. The housing project used standardised architectural designs. Lim also opted for private contractors rather than employing construction workers directly. This had allowed the HDB to supervise the contractors to ensure standards, rather than dealing with minute problems. The overall cost was also kept low by employing a large pool of contractors and sourcing building materials from a variety of vendors. Lim's HDB worked closely with Prime Minister [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) and the Minister for Finance [Goh Keng Swee](/wiki/Goh_Keng_Swee). These connections kept the housing programme well-funded, and in addition to Lim's centralization of the HDB also allowed the housing programme to cut through rigid regulations that would have otherwise hindered progress. ## Political career Following convincing from Prime Minister [Lee Kuan Yew](/wiki/Lee_Kuan_Yew), Lim contested in the [Cairnhill](/wiki/Cairnhill_Constituency) constituency as a PAP candidate during the [1963 general election](/wiki/1963_Singaporean_general_election) and won 7,749 out of the 11,659 votes. He was subsequently appointed Minister for National Development. Lim was also appointed as the PAP's \"talent scout\". Following Singapore's independence in 1965, Lim served as [Minister of Finance](/wiki/Ministry_of_Finance_(Singapore)) between until 1967 and then [Minister of Interior and Defence](/wiki/Ministry_of_Interior_and_Defence) between 1967 and 1970. Thereafter, he returned to the [Cabinet](/wiki/Cabinet_of_Singapore) and served as Minister for Environment between 1972 and 1975 and again between 1979 and 1981, Minister for Communications between 1975 and 1978, and Minister for National Development between 1978 and 1979. ## Business career Lim made his first million when 36 years old, using a machine to produce [sago pearls](/wiki/Sago) cheaply. At the same time as his venture into the sago pearl and sago flour business, Lim would enter finance, becoming the director of two banks. In 1988, Lim was appointed Executive Chairman of the Board of [Singapore Press Holdings](/wiki/Singapore_Press_Holdings), but only accepted on the condition that he was given executive powers. He restructured the company and upgraded the printing presses with full color capabilities and a new press centre. ## Personal life Lim married Pang Gek Kim in 1939 and they had five children. Pang died in 1994. One of his grandnephews is [Luke O’Nien](/wiki/Luke_O%27Nien), an [English](/wiki/English_people) professional [association football](/wiki/Association_football) player. Lim died at approximately 5:30pm [Singapore Standard Time](/wiki/Singapore_Standard_Time) (UTC+08:00) on 20 July 2006 at his home after prolonged illness. He was cremated at [Mandai Crematorium](/wiki/Mandai_Crematorium_and_Columbarium). As a mark of respect for Lim's contributions to the country, State flags at all Government buildings were flown at [half-mast](/wiki/Half-mast) on the day of his funeral. ## Honours In June 1962, Lim was awarded the [Order of Temasek](/wiki/Darjah_Utama_Temasek) (First Class), Singapore's highest civilian honour for his service in the Housing Development Board. In July 1963, he was conferred the Order of the Life of the Crown of Kelantan (Honorary) in conjunction with the 45th birthday of the Sultan of Kelantan, Malaysia. In August 1965, he was awarded the [Ramon Magsaysay Award](/wiki/Ramon_Magsaysay_Award) for his community leadership. Government officesPreceded by[Tan Kia Gan](/wiki/Tan_Kia_Gan) **[Minister for National Development](/wiki/Ministry_of_National_Development_(Singapore)#Ministers)** 1963 - 1965Succeeded by[E. W. Barker](/wiki/E._W._Barker)Preceded by[Goh Keng Swee](/wiki/Goh_Keng_Swee) **[Minister for Finance](/wiki/Ministry_of_Finance_(Singapore)#Ministers)** 1965 - 1967Succeeded by[Goh Keng Swee](/wiki/Goh_Keng_Swee)Preceded by[Goh Keng Swee](/wiki/Goh_Keng_Swee) **[Minister for Interior and Defence](/wiki/Ministry_of_Interior_and_Defence#Ministers)** 1967 - 1970Succeeded by[Goh Keng Swee](/wiki/Goh_Keng_Swee)Preceded by[Ong Pang Boon](/wiki/Ong_Pang_Boon) **[Minister for Education](/wiki/Ministry_of_Education_(Singapore)#Ministers)** 1970 - 1972Succeeded by[Lee Chiaw Meng](/wiki/Lee_Chiaw_Meng)**New ministerial post** **[Minister for the Environment](/wiki/Ministry_of_the_Environment_(Singapore)#Ministers)** 1972 - 1975Succeeded by[E. W. Barker](/wiki/E._W._Barker)Preceded by[E. W. Barker](/wiki/E._W._Barker) **[Minister for National Development](/wiki/Ministry_of_National_Development_(Singapore)#Ministers)** 1975 - 1979Succeeded by[Teh Cheang Wan](/wiki/Teh_Cheang_Wan)Preceded by[E. W. Barker](/wiki/E._W._Barker) **[Minister for the Environment](/wiki/Ministry_of_the_Environment_(Singapore)#Ministers)** 1979 - 1981Succeeded by[Ong Pang Boon](/wiki/Ong_Pang_Boon)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:22:07.424659",
  "title": "Lim Kim San",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Lim_Kim_San"
}