{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:22:16.898292"
  },
  "content": "* *Lin Chen** ([Chinese](/wiki/Simplified_Chinese_characters): 林晨; [pinyin](/wiki/Pinyin): *Lín Chén*) was a [playwright](/wiki/Playwright) and one of the important pioneers of Singapore theatre. Chen was born in Singapore in 1919, his alma mater were [Tao Nan Primary School](/wiki/Tao_Nan_Primary_School) and [The Chinese High School](/wiki/The_Chinese_High_School_(Singapore)). Chen's first exposure to the dramatic arts was watching a play titled *The Military Hospital* by the Singapore Amateur Drama Society. The 18-year-old was deeply moved by the drama performance, and soon joined the Society. He had also worked in the comics and wood carving industries from 1937 until he joined World Bookshop in the 1950s. After his retirement in 1980, he joined the [People's Association](/wiki/People%27s_Association_(Singapore)) as an instructor for drama groups. Chen's theatrical training was accumulated from years of experience. Writing short stories and essays under different pseudonyms, he also wrote scripts for local radio stations and [Rediffusion](/wiki/Rediffusion_Singapore). In addition, he participated actively in directing and writing for the theatres. From its inception in 1955, Chen was the resident playwright for the Singapore Arts Theatre and directed 162 dramas from 1954 to 1991. His work *The Woman Who Broke the Mirror* was included in the local secondary school curriculum. On October 30, 1982, Lin Chen was awarded the [Cultural Medallion](/wiki/Cultural_Medallion). He died on 29 August 2004. ## Selected plays - 陋巷里 [Lou xiang li]. (1959). - 酒巴间 [Jiu ba jian]. (1959). - 打破镜子的人 [Da po jing zi de ren]. (1959). - 圣诞财神 [Sheng dan cai shen]. (1960). - 一个有钱的人家 [Yi ge you qian de ren jia] (1961) - 建筑工地上 [Jian zhu gong di shang] (1961). - 开斋节前后 [Kai Zhai jie qian hou] (1961). - 不能再走这条路 [Bu neng zai zou zhe tiao lu] (1961). This Singaporean biographical article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:22:16.897882",
  "title": "Lin Chen (playwright)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Lin_Chen_(playwright)"
}