{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:22:21.720193"
  },
  "content": "The **lion head symbol** was introduced in 1986 as an alternative [national symbol](/wiki/National_emblem#Symbols) of [Singapore](/wiki/Singapore). The lion head was chosen due Singapore's reputation as a Lion City.[*clarification needed*] It is used in less formal occasions mainly to promote Singapore's national [identity](/wiki/Cultural_identity). When it was first unveiled, some sections of the public felt that it should have been facing rightwards to represent a more forward looking nature.[*citation needed*] However, the original left-facing lion was maintained. ## Origin In the 13th-century *[Malay Annals](/wiki/Malay_Annals)*, [Sang Nila Utama](/wiki/Sang_Nila_Utama), a prince from [Palembang](/wiki/Palembang) was shipwrecked and washed ashore to an island, where he saw a creature which he believed was a lion. He named the island \"Singa Pura\" (\"Lion City\" in [Malay](/wiki/Malay_language)), from which the name Singapore was derived. ## Meaning According to the [Singapore government](/wiki/Singapore_government): > The lion head symbolises courage, strength and excellence, as well as resilience in the face of challenges. It is in solid red against a white background - the colours of the [national flag](/wiki/Flag_of_Singapore). Its mane's five partings represent the same five ideals that are embodied in the five stars of the national flag, namely democracy, peace, progress, justice and equality. Its tenacious mane symbolises the nation's single-minded resolve to rise to any challenges and overcome any obstacles. ## Guidelines for use Extracted from *Guidelines on the use of National Symbols: The Singapore Lion Symbol* (July 1999) published by the [Ministry of Information, Communications and the Arts](/wiki/Ministry_of_Information,_Communications_and_the_Arts): 1. Subject to approval, organisations can use the Singapore Lion Symbol for the purpose of identifying with the nation and with the endeavour to achieve excellence for Singapore. 2. In application, the symbol should not be modified in any way. However, the symbol in outline, embossed or portrayed as a watermark, are acceptable forms of depiction. It should preferably face left and be used together with the word \"Singapore\". 3. The symbol should preferably be in red on a white background or white on a red background. However, it may also appear in gold, silver or in the corporate colours of the user organisation. Users must ensure that the symbol is depicted only in one colour. - [Republic of Singapore Air Force](/wiki/Republic_of_Singapore_Air_Force): Uses the lion head symbol enclosed by a circle as a [roundel](/wiki/Military_aircraft_insignia) - The Singapore Infomap Archived 2008-01-18 at the [Wayback Machine](/wiki/Wayback_Machine)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:22:21.719815",
  "title": "Lion head symbol of Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Lion_head_symbol_of_Singapore"
}