{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:22:23.456449"
  },
  "content": "Singaporean film-maker and directorThis article includes a list of general references, but **it lacks sufficient corresponding inline citations**. Please help to improve this article by introducing more precise citations. *(February 2021)* *(Learn how and when to remove this message)* **Lionel Chok Ko Hon** is a Singaporean film-maker and director. His documentary, Geraldine, was premiered at the New York International Independent Film & Video Festival. His other short films were also screened in New York City and Singapore. Since completing the Intensive Directing Workshop at [New York University](/wiki/New_York_University), he has written the telemovie Dirty Laundry (released in 2004 and shot on [HD](/wiki/High-definition_video) video). ## Filmography ### Series - Heritage Series (1988) – Awarded Best Documentary finalist in the New York Festivals – Best Documentary nominee at the [Asian Television Awards](/wiki/Asian_Television_Awards) 1988 ### Documentaries - Geraldene (2001) – Official selection in the New York International Independent Film and Video Festival 2001 ### Features - To Speak (2007) ### Plays - Nonsensical Idiosyncrasies (2001) - Nonsensical Idiosyncrasies 2 - Hearing Voices (2002) - Threesome (2004) - Adultery (2005) ### Short films - Writer's Block (2001) - Life After (2001) - Time (1999) - Nana & Damien (2005) - Crossroad (2006) ### Digital Online films - 24 Hours in Central Singapore ### HD Telemovie - *Dirty Laundry* (2004) ### Music Videos - WISH (2006) ### Musicals - Swingle (2006) ## Awards - Best Documentary finalist in the New York Festivals - Best Documentary nominee at the Asian Television Awards (1988) - 2007 Digital Film Fiesta Audience Choice Award - [Cinema of Singapore](/wiki/Cinema_of_Singapore) - [Royston Tan](/wiki/Royston_Tan) - Lionel Chok at [IMDb](/wiki/IMDb_(identifier)) - Lionel Chok's website - Bio at Substation - LC at Substation - Adultery - wirecrossing.org - Wirecrossing: 24 Hours in Central Singapore - Nana & Damien - \"Eco 4 the World\" – from Internet Movie Database (2006) - Crossroad – 2007 Digital Film Fiesta Audience Choice Award - To Speak Movie's website - youth.sg - www.thaicinema.org - Urban Nomad Film Fest - 新竹市文化局影像博物館 This article about a Singaporean film director is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:22:23.456006",
  "title": "Lionel Chok",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Lionel_Chok"
}