{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:24:19.299668"
  },
  "content": "The below list are the cases which were affected by the case of convicted murderer [Kho Jabing](/wiki/Kho_Jabing), who robbed and murdered a Chinese construction worker named Cao Ruyin in Singapore on 17 February 2008. Kho Jabing was convicted of murder and sentenced to death on 30 July 2010, and lost his appeal on 24 May 2011. Later, when the changes to Singapore's death penalty laws took effect in January 2013, Kho was re-sentenced to life imprisonment and 24 strokes of the cane on 14 August of that same year. However, the prosecution filed an appeal and it led to Kho being sentenced to death once again, albeit by a 3–2 decision. Kho was consequently executed on 20 May 2016. The outcome of the prosecution's appeal set the main guiding principles for judges to decide when the death penalty should be warranted – whether an offender had demonstrated a blatant disregard for human life or viciousness or both during the killing – and when it was inappropriate based on the circumstances of whichever murder case even without an intention to cause death. Not only did Kho Jabing have an effect on Singapore's legal history through the death penalty, he also left behind a legacy for the requirements of reopening any concluded criminal appeals through the first of his three last-minute appeals made in November 2015, which effectively suspended his hanging. The Court of Appeal, in dismissing Kho's appeal in April 2016 (the month before Kho's execution in May), earlier ruled that the reviews of concluded criminal appeals would be allowed \"only in truly exceptional cases\" to avoid potential [miscarriage of justice](/wiki/Miscarriage_of_justice). ## Singapore's death penalty guidelines for murder (2015–present) The below sequential list of cases are the murder cases and appeals that were directly or indirectly effected by the landmark ruling of the Court of Appeal regarding Kho Jabing's fate in 2015. ### Murder of taxi driver Yuen Swee Hong (11 April 2009) Shortly after the conclusion of the prosecution's appeal, it did not take long before the appeal verdict of Kho Jabing's case had a direct effect on another appeal made by the prosecution against another High Court decision to re-sentence a murderer to life imprisonment. Another appeal filed by the prosecution for the re-sentencing of a murderer was that of convicted murderer and Chinese national [Wang Wenfeng](/wiki/Wang_Wenfeng_(murderer)). Wang was initially sentenced to death for killing 57-year-old taxi driver Yuen Swee Hong during an attempted armed robbery, but he was eventually re-sentenced to life imprisonment and 24 strokes of the cane on 14 November 2013 after the new death penalty laws took effect in January of that same year. Wang committed the crime on 11 April 2009 when he tried to rob Yuen and threatened him from behind the driver's seat with the knife. A struggle ensued, and the driver was injured with knife wounds and bled heavily. Panicked upon seeing the driver's limp body, Wang thought that the man had died and abandoned the body in a nearby forest. He later attempted to extort ransom by using Yuen's phone to contact Yuen's widow, Mdm Chan Oi Lin, lying to her that her husband was kidnapped. Chan, who had a son and daughter with Yuen, contacted the police without the realisation that her husband had died. Wang was promptly arrested and despite his denials of the crime, Wang later confessed to the killing out of eventual guilt and led the police to the place where he disposed Yuen's body. Wang, who was married with a daughter back in [China](/wiki/China), was charged with murder and later sentenced to death in September 2011; he also lost his appeal sometime before his re-sentencing. The reasons behind his re-sentencing was that he had no intention to murder but to rob, and there was no premeditation to cause death. DPP [Bala Reddy](/wiki/Bala_Reddy), who led the prosecution in the re-sentencing trial, argued in that trial itself that Wang's case deserved the death penalty because Wang had shown a high degree of premeditation and planning in committing the crime and the time he chosen to commit the crime – 4 in the morning – was the time likely to have a lower risk of detection of his crime, and there should be a deterrence of future crimes committed against public transport workers, especially taxi drivers; and the courts should severely punish those who commit violent, opportunistic and heinous offences. Wang's defence lawyer Wendell Wong meanwhile, argued for a life term with not more than 10 strokes of the cane, pointed out that there is no increase in the number of cases where taxi drivers were killed, a point which Justice [Lee Seiu Kin](/wiki/Lee_Seiu_Kin) (the High Court judge presiding Wang's original trial) agreed with. He also said if Wang had wanted to kill Yuen, he would not have to wait for the struggle to erupt. Wong also said, \"He (referring to Wang Wenfeng) had every opportunity and the upper hand to stab Yuen the moment he stepped into the rear passenger side of the taxi.\" But Wang did not do so. Like in Kho Jabing's case, the prosecution filed an appeal for the death penalty on Wang. At the time of the delivery of the judgement of the appeal over Kho's case, the prosecution is still appealing against Wang's sentence. While pending its appeal, the prosecution reviewed Wang's case extensively while they referred to the written verdict of Kho's case. Eventually, on 19 April 2015, they decided to drop the appeal against Wang, effectively making Wang Wenfeng escaping the gallows, as the high degree of decomposition of Yuen Swee Hong's corpse made it so that the prosecution could not fully assess the level of brutality of Wang's attack on the deceased victim. They also took note that unlike Kho's premeditated assault on Cao Ruyin, Wang injured the taxi driver during a struggle. Wang is currently in prison serving his life sentence (backdated to the date of his arrest) with the possibility of parole after 20 years. He was the fifth convicted murderer to escape the gallows since the changes to the law, as preceded by Kamrul Hasan Abdul Quddus, a Bangladeshi national who was re-sentenced to imprisonment for life with 10 strokes of the cane for the 2007 murder of his girlfriend. ### The death of Shanmuganathan Dillidurai (29–30 May 2010) One notable case that was affected by the appeal verdict was the [2010 Kallang Slashings](/wiki/2010_Kallang_Slashings), where a group of robbers from [Sarawak](/wiki/Sarawak) committed a series of violent robberies around Kallang Area, leading to the violent death of Indian construction worker Shanmuganathan Dillidurai during the last of these four robberies. One of the perpetrators, [Micheal Anak Garing](/wiki/Micheal_Anak_Garing), who used a 58 cm long parang to fatally attack and slash Shanmuganathan while robbing him, was convicted of murder on 20 January 2014 and sentenced to death on 20 April the following year (as the trial judge found that he had violently attacked his victims in each robbery and thus his conduct warrants the death penalty). In upholding Micheal's death sentence in 2017, the Court of Appeal, with reference to the judgement of Kho's case, were satisfied that Micheal had attacked Shanmuganathan in a savage and merciless manner and demonstrated a blatant disregard for human life during the attack. Another one of the perpetrators, [Tony Anak Imba](/wiki/Tony_Anak_Imba), who stood trial together with Micheal, was also found guilty of murder; however, unlike Micheal, he was spared the gallows and sentenced to life in prison and 24 strokes of the cane, with the sentence backdated to the date of his conviction. The prosecution appealed for the death penalty, but the Court of Appeal dismissed the appeal in 2017, as they found that Tony did not sufficiently reflect a blatant disregard for human life from the review of his conduct and mental state at the time of the crime, citing that even if he likely knew that Micheal would use the parang on Shanmuganathan as he did on all their previous victims, and had been the one initiating the attack, it is insufficient to indicate any blatant disregard for human life on Tony's part. Thus, they upheld Tony's life sentence, and currently, Tony Imba is still placed under incarceration with respect to his life sentence since 20 January 2014. The other two main accomplices were each sentenced to severe penalties of 33 years’ imprisonment with 24 strokes of the cane each in 2013 and 2018 respectively for four charges of armed robbery with hurt while the remaining four arrested in connection to the crime spree of Kallang were imprisoned between 2 and 6 years and caned between 6 and 12 strokes of the cane. On 22 March 2019, after losing his final appeal for clemency, 30-year-old Micheal Garing was put to death in Changi Prison for his crime. A day after his execution, Micheal's body was sent back to his hometown in Sarawak, [Malaysia](/wiki/Malaysia) for burial. ### Murder of Dexmon Chua Yizhi (28–29 December 2013) Another example is a 58-year-old murder convict named Chia Kee Chen, whose life imprisonment sentence was overturned by the Court of Appeal upon the prosecution's appeal and was given the death penalty on 27 June 2018 for the brutal killing of his wife's 37-year-old former lover [Dexmon Chua Yizhi](/wiki/Murder_of_Dexmon_Chua_Yizhi). On 28 December 2013, Chia abducted the victim with two accomplices, Indonesian Febri Irwansyah Djatmiko and Singaporean Chua Leong Aik from a carpark in [Choa Chu Kang](/wiki/Choa_Chu_Kang), and inside their van, he and Febri electrocuted and grievously assaulted the victim until he died (during the assault, Chua Leong Aik fled half-way out of fear) and later abandoned Dexmon Chua's dead body in a [Singapore Armed Forces](/wiki/Singapore_Armed_Forces) live firing area in [Lim Chu Kang](/wiki/Lim_Chu_Kang). Prior to the cold-blooded murder, Chia was said to have discovered the affair between his own 47-year-old wife Serene Goh Yen Hoon and the victim Dexmon Chua (who was Goh's colleague) in November 2012, and out of revenge, he planned to kill Dexmon Chua. Chua Leong Aik, who acted as driver, was subsequently arrested on 9 January 2013 and nearly 3 years later, on 8 January 2016, Chua Leong Aik was sentenced to 5 years' imprisonment by Senior judge Kan Ting Chiu for abetting the abduction while Febri fled Singapore and went on the run in Indonesia. As for Chia meanwhile, he was brought to trial for murder in late 2016, and he was found guilty of murder under Section 300(c) of the Penal Code on 17 January 2017, and sentenced to life imprisonment seven months later despite the prosecution's demands for a death sentence. The Court of Appeal, in sentencing Chia to death a year later, citing the guiding principles set by Kho's case, stated that Chia had \"exhibited such viciousness and such a blatant disregard for the life of the deceased, and are so grievous an affront to humanity and so abhorrent that the death penalty is the appropriate, indeed the only adequate sentence\", given that he masterminded the abduction out of revenge for his wife's adultery, shown a high degree of premeditation and planning and had a lack of remorse. The three-judge panel, led by Chief Justice Sundaresh Menon, also cited that although it may be true that Febri could have inflicted the fatal injuries, he did so under Chia's directions and Chia himself not only do not tell Febri to stop the assault, but joined in the attack. Before his arrest, Chia even calmly went for a holiday trip to Malaysia with his wife and two daughters (then aged 18 and 22 respectively) while taking the chance to help Febri to flee the country. CJ Menon, who read out the judgement he made together with two other judges Judith Prakash and Tay Yong Kwang, said in his own words regarding Chia's role, \"One who hires an assassin to kill another or who otherwise controls a killer, cannot be less culpable than the one who does the killing.\" Additionally, Chia's appeal against his conviction was dismissed by the same three judges in the same court where the prosecution's appeal was heard and allowed.[a] ### Chan Lie Sian v Public Prosecutor (14 January 2014) The prosecution's appeal against Chia Kee Chen's case, as well as the case of Kho Jabing, was also crucial to helping 55-year-old [brothel](/wiki/Brothel) owner Chan Lie Sian to escape the gallows. Chan, alias Benny Seow, was initially sentenced to death on 31 May 2017 for the 2014 murder of 35-year-old William Tiah Hung Wai, but on 30 July 2019, the Court of Appeal allowed Chan's appeal and reduced his death sentence to life imprisonment. Chan's case was that he found some $6,500 in cash missing from his brothel, and suspected Tiah, who pimped at his brothel, as the one who stole the money. After Tiah, who is also known as \"William Kia\", came to the brothel as summoned by Chan, Chan physically assaulted Tiah (who denied stealing the $6,500) by using a dumbbell to hit him while asking for the whereabouts of the missing money until the victim fell unconscious. 10 injuries were caused on Tiah's head and it landed him to hospital, where he would die exactly a week later on 21 January 2014, the day before Tiah's 36th birthday. [Chief Justice](/wiki/Chief_Justice_of_Singapore) [Sundaresh Menon](/wiki/Sundaresh_Menon), and Judges of Appeal [Andrew Phang](/wiki/Andrew_Phang) and [Judith Prakash](/wiki/Judith_Prakash), who heard Chan's appeal, found that [Judicial Commissioner](/wiki/Judicial_Commissioner) Hoo Sheau Peng, the original trial judge of Chan's case, had erred in convicting Chan of murder under Section 300(a) of the Penal Code and sentencing him to the mandatory penalty of death, as there was no intention on Chan's part to cause death, and that some of William Tiah's injuries were caused by \"interventing objects\" and not from Chan's assault as evidenced by the forensic expert's court testimony. Furthermore, if Chan intended to cause death, he would have done it during those moments where there were no witnesses and the victim being helpless on the bed, and he would not have splashed water on Tiah's face to attempt to revive him and threatened to further attack the victim once he woke up under the eyes of a witness. Hence, they instead convicted Chan of murder under Section 300(c) of the Penal Code. With regards to the sentence, the Court of Appeal also found that from the facts of the case, Chan did not deserve the death penalty as he did not exhibit any blatant disregard for human life or viciousness in contrast to Kho Jabing's case. They also accept that Chan was not aware of the fatality of the injuries he caused to Tiah from the time of and aftermath of the attack. Chan had in fact surrendered himself to the police 2 days after the assault, with the assumption that Tiah's injuries were not fatal, and he thought he would be charged and tried for voluntarily causing grievous hurt. Hence, Chan escaped with his life and received a life term instead. No caning is imposed due to his age of 55 at the time of the conclusion of his appeal process. ### Circuit Road flat murder (21 March 2016) The murder of Zhang Huaxiang at a rented flat in Circuit Road on 21 March 2016 was another case where Kho Jabing's case was once again, mentioned and referred to. The 28-year-old Chinese national and nurse was found strangled to death on her bed, and the owner of the flat and Zhang's murderer, 47-year-old Malaysian and cafeteria worker Boh Soon Ho, fled Singapore into Malaysia, where he was arrested on 4 April of that same year. Boh was said to have a close relationship with Zhang since 2011 or 2012, regarding her as his girlfriend but his feelings for her were not reciprocated and they never been physically intimate. He found out that she was seeing other men and was angry and suspicious. When he asked her about it and received an reply that she did, Boh was enraged and used a towel to strangle her to death, before attempting to have sex with Zhang's corpse. The case became known as the *[Circuit Road flat murder](/wiki/Circuit_Road_flat_murder).* Boh Soon Ho, who was represented by prominent lawyer [Eugene Thuraisingam](/wiki/Eugene_Thuraisingam), was subsequently brought to trial in September 2019 and convicted of murder under Section 300(c) of the Penal Code on 7 February 2020, as the trial judge, Justice Pang Khang Chau, rejected Boh's defence of grave and sudden provocation and loss of self-control despite acknowledging that Boh was indeed provoked into killing Zhang, as he found the provocative acts from Zhang was not sufficiently grave enough to have Boh convicted of a reduced charge of [culpable homicide](/wiki/Culpable_homicide) not amounting to murder. The next day, 51-year-old Boh Soon Ho was sentenced to life imprisonment, nearly 4 years after the death of Zhang Huaxiang. Justice Pang stated in his judgement that he accepted Boh's killing of Zhang was not premeditated, and that there were no viciousness or blatant disregard for human life in the case as compared to Kho Jabing's case, which made the death penalty inappropriate in Boh's case; the judge also took note of Boh's low IQ of 74 and his remorse over the incident during sentencing. As he is aged more than 50 at the time of sentencing, Boh was thus not caned. On 28 October 2020, 52-year-old Boh Soon Ho's appeal was dismissed by the Court of Appeal, which likewise rejected his defence of sudden and grave provocation against the murder charge. ### Public Prosecutor v Toh Sia Guan (9 July 2016) Kho Jabing's case, as well as Chia Kee Chen's, was once again mentioned in the case of 67-year-old Toh Sia Guan, a [rag and bone](/wiki/Rag_and_bone) man who was sentenced to life in prison in March 2020 for murdering a 52-year-old coffee shop assistant named Goh Eng Thiam by inflicting a fatal stab wound across Goh's right upper arm, which cut through a major blood vessel and caused him to bleed to death. Earlier before the incident on that fateful day of 9 July 2016, 64-year-old Toh was involved in a dispute with Goh, and got into a fight before Toh left to purchase a knife to settle scores with the man once more. This resulted into a second fight which cost Goh Eng Thiam his life. After the fight (in which Toh escaped to another place to clean himself up and change his clothes), Goh, who laid down and rested his head on the kerb, was subsequently pronounced dead at the scene by paramedics arriving at the scene. Toh was arrested 12 days later at Labrador Park MRT station and charged with murder, and his trial started on 6 August 2019. High Court judge Aedit Abdullah, who found Toh Sia Guan guilty and convict him of murder under Section 300(c) of the Penal Code on 12 February 2020 before reserving his judgement until 2 March 2020, accepted that Toh did not reflect any blatant disregard for human life or viciousness during the fight with Goh Eng Thiam, because of the absence of premeditation and planning as compared to Chia's case, and also unlike Kho Jabing (who injured Cao Ruyin by surprise and further assaulted him even after he was down), Toh injured the victim during a fight where he is still retaliating against him and never further made any additional injuries on the victim. In Toh's case, there is only one fatal injury sustained by Goh Eng Thiam in contrast to the multiple fatal injuries which Cao Ruyin received from Kho Jabing's attack; and the fight was the elderly Toh pitted against the younger, stronger and more aggressive victim. Justice Aedit also accepted that Toh was unaware of the fatality of the stab wound. He further noted that the prosecution is not seeking the death penalty while the defence argued for life imprisonment for the accused. Because of these above factors, and the absence of outrage of the feelings of the community from Toh's actions, Justice Aedit found the death penalty inappropriate in Toh's case and hence sentenced him to incarceration for life with effect from 21 July 2016, the date of Toh's remand. Toh was not subjected to caning due to his age. Not only did Justice Aedit referred to Kho Jabing and Chia Kee Chen's cases in his verdict while making his decision, he also cited the cases of Chan Lie Sian and Micheal Anak Garing while determining whether Toh acted in a manner where it particularly warranted the death penalty while murdering Goh. In the aftermath, nearly a year later since he was convicted and sentenced, Toh Sia Guan's appeal against his sentence and conviction was dismissed on 2 February 2021 (Toh argued the appeal on his own without a lawyer this time). The three-judge Court of Appeal (consisting of Judges of Appeal Tay Yong Kwang, Andrew Phang and [Belinda Ang](/wiki/Belinda_Ang)), in its *[ex tempore](/wiki/Ex_tempore)* judgement, cited that Justice Aedit was not incorrect to convict Toh of murder and also rejected his defence that he done the stabbing accidentally or the deceased coffee shop assistant being the one starting the fight. They rejected that Toh's life sentence was harsh on the basis that murder under Section 300(c) of the Penal Code only warranted two alternative penalties and thus the trial judge could not impose any other punishment lower than life imprisonment. Toh is currently in jail serving his life sentence since 21 July 2016. ### Gardens by the Bay murder (12 July 2016) Through Chia Kee Chen's case, the guiding principles from Kho's case had also indirectly determined the final fate of 51-year-old Leslie Khoo Kwee Hock,[b] who was sentenced to life imprisonment on 19 August 2019. He was convicted of murder under Section 300(b) of the Penal Code the month before for the death of his 31-year-old lover, Chinese national Cui Yajie, on 12 July 2016. Cui, who was an only child in her family, was an engineer from [Tianjin](/wiki/Tianjin), [China](/wiki/China). She first came to work in Singapore since 2012. When both Khoo and Cui first met in 2015, Khoo lied to Cui that he was single and was an owner of a laundry business when he himself was actually married with a son and was a retail manager of that same laundry business he claimed was his. Later, when Cui became suspicious, Khoo told her that he was divorced. The relationship would later on be riddled with quarrels over Khoo spending less time with Cui and a debt of $20,000 which he owed her for making investment with that same amount of money in gold (half of that amount was eventually paid back by Khoo asking a former lover to remit the money in Cui's father's bank account). Khoo's wife Mdm Toh Lee Nah also eventually confronted her husband about the affair after receiving a Facebook message from Cui telling her to leave Khoo alone. It was on that fateful day of 12 July 2016, in an unexpected turn of events, when Cui wanted to go to Khoo's workplace, supposedly to expose Khoo's lies, but Khoo intercepted her, taking her to a secluded place near [Gardens by the Bay](/wiki/Gardens_by_the_Bay) to calm her down. It was then during a heated quarrel, Khoo strangled Cui to death. The next day, Khoo took the body to Lim Chu Kang Lane 8 after buying some charcoal and kerosene, where he burnt it for three consecutive days before his arrest on 17 July 2016. There were only a few clumps of hair, a bra hook and partially burnt pieces of Cui's dress left at the site where Khoo burnt Cui's body. This case was known as the *[Gardens by the Bay murder](/wiki/Gardens_by_the_Bay_murder)* in media reports. Khoo's case was the second case in Singapore's legal history where a person was charged with and tried for murder in the absence of a body (the first was that of [Sunny Ang Soo Suan](/wiki/Sunny_Ang_Soo_Suan), who was sentenced to death in 1965 for the murder of his barmaid girlfriend during a scuba diving trip, solely based on circumstantial evidence and without the body). High Court judge [Audrey Lim](/wiki/Audrey_Lim) noted in her judgement that in contrast to Chia Kee Chen's case (and indirectly, Kho Jabing's case), Khoo did not show any blatant disregard for human life or viciousness from the manner of killing, for which his case would not warrant the death penalty. She also accept that there is no premeditation of killing Cui Yajie on Khoo's part, as his intention all along was just to calm her down and dissuade her from confronting his supervisors before the tragic incident. Hence, she decided to sentence Khoo to life in jail instead of death and backdate Khoo's life term to the date of his remand. Khoo, who denied having an affair with Cui and claimed abnormality of mind and other factors in his defence during his trial (which lasted from March to July 2019), was spared the cane as he was above 50 years old at the time of sentencing. Khoo initially appealed his sentence, but he later withdrew it. ### Azlin Arujunah (23 October 2016) Azlin Arujunah was found guilty of murdering her five-year-old son by scalding him multiple times on four occasions, resulting in the child dying from the infection of his wounds. Her husband Ridzuan Mega Abdul Rahman was also involved in the abuse. The couple were initially acquitted of murder in April 2020 and received jail terms of 27 years each for voluntarily causing grievous hurt by dangerous means before the prosecution successfully appealed in July 2022 for Azlin to be convicted of murder and Ridzuan's sentence be increased to life imprisonment. On 18 October 2022, despite the prosecution's arguments for the death penalty, 30-year-old Azlin Arujunah was sentenced to life imprisonment. The Court of Appeal found that despite Azlin's inhumane conduct and cruelty against her son, she did not have the intention to scald her son to death and she was fully unaware that the scald injuries would likely kill her son, and she and her husband both had applied ointment before the boy's condition deteriorated to the point of death. They also agreed with the trial judge that Azlin's husband, who was responsible for most of the abuse despite his lower culpability in the fatal scalding incidents, was the one who introduced the concept of domestic abuse into his family and made Azlin adopting it against her son. The Court of Appeal made these above findings based on references to the landmark case of Kho Jabing, and in comparison, Azlin's disregard for her son's life and cruelty was not the same as Kho's case and it was not severe enough to call for a death sentence, and even though cruelty is a relevant factor for consideration during sentencing, the court \"should not be distracted by the gruesomeness of the scene of the crime\". ## Re-opening of concluded criminal appeals ### The acquittal of Ilechukwu Uchechukwu Chukwudi (2 August 2017) On 2 August 2017, for the first time, the Court of Appeal ordered a review of its previous decision from 2015 regarding the case of a convicted drug trafficker who was pending the mandatory capital punishment in Singapore, which resulted in his acquittal upon the review of his case. The case was about a [Nigerian](/wiki/Nigeria) man named Ilechukwu Uchechukwu Chukwudi, who, at age 25, came to Singapore on 13 November 2011 to purchase laptops to sell back home in Nigeria. In Ilechukwu's account, he said that he was told by a childhood friend to pass a black suitcase to the friend's Singaporean contact, which Ilechukwu did by passing it to Hamidah binte Awang, a 45-year-old Singaporean woman. Ilechukwu was arrested in a Chinatown hotel the next day when nearly 2 kg of methamphetamine were found in the suitcase during Hamidah's arrest at the [Woodlands Checkpoint](/wiki/Johor%E2%80%93Singapore_Causeway#Woodlands_Checkpoint). Both Ilechukwu and Hamidah were tried in the High Court together for drug trafficking, but on 5 November 2014, only Hamidah was found guilty while Ilechukwu was acquitted of the crime, as the trial judge, High Court judge [Lee Seiu Kin](/wiki/Lee_Seiu_Kin), accepted that Ilechukwu did not know that the suitcase contained drugs. Nearly a year later, on 16 October 2015, 49-year-old Hamidah, who was certified to be a drug courier and had substantively assisted the [Central Narcotics Bureau](/wiki/Central_Narcotics_Bureau) in disrupting drug trafficking activities from in and/or out Singapore, was sentenced to life in prison, with her life sentence backdated to the date of her arrest (13 November 2011). She was not caned since caning is not allowed for women under Singapore law. However, as for Ilechukwu, the prosecution appealed the acquittal of the Nigerian, and after hearing the appeal, the Court of Appeal overturned Ilechukwu's acquittal in June 2015 and convicted him of drug trafficking, making Ilechukwu potentially facing the gallows. The three-judge court found that Ilechukwu had lied numerous times in his statements to the police to distance himself from the methamphetamine found in the suitcase he had brought into Singapore and passed to Hamidah. Ilechukwu earlier said in court that the reason he told these lies was he did not know the full facts of what had occurred, so he felt that the safest thing to do was to deny anything that was not in his possession. He also earlier denied passing the suitcase to Hamidah and other facts (which were disputed by Hamidah's testimony and other evidence like CCTV footages of Ilechukwu passing the suitcase to Hamidah). The Court of Appeal also rejected the Nigerian's reasoning behind his lies, saying they were \"no more than convenient excuses\". The case was subsequently remitted back to the High Court for sentencing, meaning that Ilechukwu will either be sentenced to death, or at least to life imprisonment. The defence sought for medical evidence to see if Ilechukwu was eligible for a requirement under the [Misuse of Drugs Act](/wiki/Misuse_of_Drugs_Act_(Singapore)) which would warrant life imprisonment instead of death for Ilechukwu if the requirement is met (the requirement is that if a person who is convicted of capital drug trafficking is substantially suffering from diminished responsibility at the time of the offence, the punishment would not be the mandatory death penalty but mandatory life imprisonment without caning). During a psychiatric evaluation in preparation for the sentencing of Ilechukwu, psychiatrists found that Ilechukwu was suffering from [post-traumatic stress disorder](/wiki/Post-traumatic_stress_disorder) (PTSD) at the time of his interrogations and giving his statements to the police. The illness was a result of trauma when Ilechukwu witnessed a massacre at [Wukari](/wiki/Wukari), [Taraba State](/wiki/Taraba_State), Nigeria in 1990, where members of the [Hausa tribe](/wiki/Hausa_tribe), armed with choppers and cutlasses, attacked his native tribe, the [Igbo tribe](/wiki/Igbo_tribe). A corpse outside his mother's shop and the deaths that happened before him affected Ilechukwu, who was merely five or six years old at that time. Dr Jaydip Sarkar from the [IMH](/wiki/Institute_of_Mental_Health_(Singapore)), one of the four psychiatrists assessing Ilechukwu, said the PTSD was likely to have caused him to lie in the statements he gave to the anti-narcotics officers interviewing him shortly after his arrest. In light of this new evidence, Ilechukwu applied to reopen the case, and the Court of Appeal allowed the application and reopen his case on 2 August 2017, ordering the High Court to assess if Ilechukwu was indeed suffering from PTSD during the time of the alleged offence. It cited and referred to the case of Kho Jabing (regarding the reopening of his case), stating that from Ilechukwu's case and his new medical evidence, \"The present motion is, in our view, such a 'truly exceptional' case because of the unique turn of events. It is entirely fortuitous that the IMH report – issued only at the sentencing stage and emanating from the prosecution's request for a psychiatric report – has raised a matter which has a crucial bearing on our decision.\" On 5 July 2019, the original trial judge Lee Seiu Kin found that Ilechukwu was indeed suffering from symptoms of PTSD during the recording of his statements. On 17 September 2020, after reviewing Ilechukwu's case, a rare five-judge Court of Appeal, by a historic split decision of 4 to 1, overturned Ilechukwu's conviction and acquitted him once again, allowing Ilechukwu, then 34 years old, to walk out of prison a free man nearly 9 years after his arrest. Four judges hearing the appeal – [Chief Justice](/wiki/Chief_Justice_of_Singapore) [Sundaresh Menon](/wiki/Sundaresh_Menon), Judges of Appeal [Andrew Phang](/wiki/Andrew_Phang) and [Judith Prakash](/wiki/Judith_Prakash), and Senior Judge [Chao Hick Tin](/wiki/Chao_Hick_Tin) – consisted of the majority who quashed Ilechukwu's conviction while the fifth and last judge, Judge of Appeal [Tay Yong Kwang](/wiki/Tay_Yong_Kwang), was the sole judge who upheld Ilechukwu's conviction. CJ Menon, who read out the judgement in court, said that the majority had concluded that the 2015 decision was \"demonstrably wrong\". In his own words, CJ Menon read, \"In our judgment, there is now a plausible innocent explanation that accounts for the applicant's lies and omissions in his statements.\" He also said that the majority accepted the defence psychiatric team's report that due to PTSD, Ilechukwu had overestimated the threat on his life in being accused of a capital crime that potentially will lead to him being hanged and prompted the Nigerian to \"utter the unsophisticated and blatant falsehoods in his statements in an attempt to escape from the death penalty and to save his life.\" He additionally commented that if the medical evidence was presented earlier in 2015, the outcome would have been different. In his individual dissenting judgement, Justice Tay opined that the new evidence did not reveal much error in the previous appeal decision in 2015 regarding Ilechukwu's alleged guilt of the crime. Although the judge expressed his sincere sympathy to Ilechukwu for the horrors of the massacre he witnessed back in his homeland as a young boy of five or six years old, he said in his own words, \"However, in the final analysis of all the evidence here, (Ilechukwu)'s defence was truly a highly unlikely account from a totally unreliable and untruthful source.\" He described Ilechukwu's defence as \"a case of hypothesis built upon hypothesis built upon hypothesis, in order to try to explain away a continuous and consistent stream of very focused lies\". Ilechukwu Uchechukwu Chukwudi was the second case of a Nigerian escaping the death penalty in Singapore in the last two years after Adili Chibuike Ejike, who was initially sentenced to death in 2017 for a 2013 drug trafficking crime but acquitted on 27 May 2019 by the Court of Appeal. After his acquittal, Ilechukwu, however, could not immediately return to Nigeria because he faced issues of travelling restrictions due to the ongoing [COVID-19 pandemic in Singapore](/wiki/COVID-19_pandemic_in_Singapore). These issues were eventually settled, allowing Ilechukwu to be able to return to Nigeria in late November 2020. Singapore's leading criminal lawyer [Eugene Singarajah Thuraisingam](/wiki/Eugene_Singarajah_Thuraisingam), who represented Ilechukwu since 2011, cited that having gone through ups and downs together with his client in this case, it became a special case to him in his heart and he would remember it. As for Hamidah, she is in prison serving her life sentence since 13 November 2011. She will be possibly be in prison for the remainder of her natural lifespan, unless she was deemed eligible for release on parole upon the pending review of her conduct, which is to take place from 13 November 2031 onwards once she finished serving at least 20 years of her sentence. ### The failed application of Abdul Kahar bin Othman (16 August 2018) Another case which was affected by Kho Jabing's November 2015 appeal was that of convicted drug trafficker [Abdul Kahar bin Othman](/wiki/Abdul_Kahar_bin_Othman), who was under a sentence of death since February 2015 for two different charges of drug trafficking for trafficking 26.13g of diamorphine and 40.64g of diamorphine respectively. After his arrest on 6 July 2010, Abdul Kahar was found guilty in a High Court trial on 27 August 2013, and he was sentenced to death on 4 February 2015. Abdul Kahar's appeal against the death sentence was dismissed on 1 October 2015. A judicial review application filed in 2016 to challenge the Public Prosecutor's decision not to grant Abdul Kahar a certificate was also dismissed. On 16 August 2018, while he still remains on death row, Abdul Kahar filed for an application to reopen his case, and his lawyer argued against the constitutionality of the alternative sentencing regime in the Misuse of Drugs Act, stating that it violates the principles of equality before the law and separation of powers. However, the Court of Appeal did not accept the arguments and dismissed the appeal, stating that Abdul Kahar had no basis in to reopen the case, and based on the requirements to reopen concluded cases laid out by Kho Jabing's case, Abdul Kahar had not passed the test, since he had repeated his previous arguments from previous appeals, and there was no violation of constitutionality in his case. Seven years after his sentencing, 68-year-old Abdul Kahar bin Othman was executed at [Changi Prison](/wiki/Changi_Prison) on 30 March 2022, and he was the first person to be executed in Singapore during the COVID-19 pandemic. ### The re-trial of Norasharee bin Gous (5 August 2019) The second application to be granted to reopen the case through the Kho Jabing principle belongs to [Norasharee bin Gous](/wiki/Norasharee_Gous), an alleged drug trafficker on death row for abetment of capital drug trafficking. Norasharee was arrested in July 2015 and charged with instigating drug trafficker Mohamad Yazid bin Md Yusof to traffic in not less than 120.90g of diamorphine on 23 October 2013. Together with Yazid and another alleged mastermind [Kalwant Singh a/l Jogindar Singh](/wiki/Kalwant_Singh_a/l_Jogindar_Singh), Norasharee was brought to trial in the High Court. Yazid alleged that Norasharee had personally met him at Vivo City on 23 October 2013 and told him to collect the drug bundles from a Malaysian courier, to which Norasharee denied and claimed in his defence that he had met up with a colleague at Marina Keppel Bay for lunch at Vivo City. However, on 1 June 2016, the High Court found that Yazid was a truthful witness and hereby rejected Norsharee's defence and therefore convicted him as charged. Since Norasharee was not a courier, he was sentenced to death. Similarly, Kalwant was also sentenced to death while in contrast, Yazid received a certificate of substantive assistance and thus sentenced to life imprisonment and 15 strokes of the cane for his crime. His sentence was backdated to the date of his arrest and has the possibility of parole after 20 years. Norasharee and Kalwant both appealed their sentences. While the Court of Appeal granted Kalwant's request to adduce further evidence to support his case in midst of dismissing his appeal, they agreed with the High Court's findings in Norasharee's case and thus rejected his appeal on 10 March 2017. Norasharee's appeal for clemency was also rejected. Kalwant, a native of [Cameron Highlands](/wiki/Cameron_Highlands), also exhausted his appeals and executed on 7 July 2022. Two years later since the loss of his appeal, an application was filed by then 45-year-old Norasharee seeking to reopen his concluded appeal and to receive fresh evidence. The application was based on the fact that his previous lawyer from the trial and appeal Amarick Singh Gill, had failed to call for Norasharee's colleague to support his alibi defence despite Norasharee's instructions. The evidence was considered new and had given rise to the possibility that Norasharee might be falsely accused, as revealed from the judgement of Norasharee's High Court case and those of two unrelated drug trafficking cases, there is a similar phrase of \"Bujang Hawk\" being used, indicating a possible collaboration between Yazid and other people to frame Norasharee. As such, on 5 August 2019, the Court of Appeal approved the case to be reopened since it passed the test set by Kho Jabing's case, and ordered it be sent back to the High Court for a re-trial. However, the High Court, on 26 August 2020, dismissed the application and upheld the conviction and sentence of Norasharee. In his judgement issued on 14 September 2020, the original trial judge [Choo Han Teck](/wiki/Choo_Han_Teck) stated that there were material discrepancies between Norasharee and the new witness's accounts of events during the material time. He also found that the witness to be contradictory and inconsistent between written declarations, and his late appearance in the case to testify for Norasharee had also undermined his credibility. Norasharee's appeal against the High Court's re-trial verdict was also dismissed on 21 April 2021. Norasharee was hanged on 7 July 2022, the same day as Kalwant. ### The case of Gobi Avedian (25 February 2020) The case of alleged drug trafficker [Gobi Avedian](/wiki/Gobi_Avedian), a Malaysian of Indian descent, was another concluded case reopened as a result of the Kho Jabing case. This is also the first capital case in Singapore's legal history where a death sentence was revoked on a review by the Court of Appeal after exhausting all the usual avenue of appeals. Gobi was arrested on 11 December 2014 for illegal importation of 40.22g of heroin, and he did so as he was desperate to pay off his daughter's medical fees. He claimed that he was told that he was only transporting disco drugs that were mixed with chocolate instead of heroin. The High Court initially accepted his explanation and sentenced him to 15 years in jail with ten strokes of the cane for a lower drug charge. However, the prosecution appealed in 2018 and the Court of Appeal sentenced him to death, after they deemed that he failed to rebut the statutory presumption of knowledge of the nature of the drugs he was carrying. Subsequently, after he was sentenced to death, Gobi filed for clemency, but it was denied in July 2019. Later, in January 2020, Gobi, together with another death row inmate [Datchinamurthy Kataiah](/wiki/Datchinamurthy_Kataiah) (a convicted drug trafficker), also filed a joint lawsuit over allegations that illegal methods are used to carry out executions in Singapore, which was also dismissed. After this, Gobi, through his lawyer [M Ravi](/wiki/M_Ravi), filed for an application to reopen his case in light of a recent appeal ruling by the Court of Appeal over an unrelated drug trafficking case, which clarified that the legal concept of wilful blindness is irrelevant in considering whether the presumption of possession under Section 18(2) of the MDA has been rebutted. Ravi argued on behalf of his client that since the prosecution's case in the original trial was one of willful blindness, the prosecution could not have invoked the presumption in the first place. On 19 October 2020, in accordance to the framework laid out by Kho Jabing's case based on the reopening of concluded criminal cases, the Court of Appeal reopened the case, and they decided that Gobi's failure to rebut the presumption of knowledge should not be used as a basis for a capital charge. They judged that Gobi was not willfully blind to the nature of the drugs, and noted that Gobi did questioned the nature of the drugs but felt assured that they are not serious. As such, they overturned Gobi's death sentence, and reinstated his initial conviction by the High Court, and restored Gobi's original sentence of 15 years' imprisonment and 10 strokes of the cane, and backdated it to the date of his remand. He was paroled on 17 December 2024. - [Kho Jabing](/wiki/Kho_Jabing) - [Capital punishment in Singapore](/wiki/Capital_punishment_in_Singapore) - [Life imprisonment in Singapore](/wiki/Life_imprisonment_in_Singapore) ## Notes\n",
  "language": "en",
  "processed_at": "2026-01-12T11:24:19.299261",
  "title": "List of cases affected by the Kho Jabing case",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/List_of_cases_affected_by_the_Kho_Jabing_case"
}