{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:25:29.402454"
  },
  "content": "[Singapore](/wiki/Singapore) maintains an active [conscription](/wiki/Conscription) system in accordance with the regulations set by the [Government of Singapore](/wiki/Government_of_Singapore), known as **National Service** (**NS**). This requires all qualified male Singaporean citizens and second-generation permanent residents to serve a period of [active duty](/wiki/Active_duty) [military service](/wiki/Military_service) in the uniformed services, in either the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces) (SAF), [Singapore Civil Defence Force](/wiki/Singapore_Civil_Defence_Force) (SCDF) or the [Singapore Police Force](/wiki/Singapore_Police_Force) (SPF). Below is a list of reported deaths that resulted from training incidents. This list is incomplete; you can help by adding missing items. *(January 2019)* ## Service-related deaths in Singapore National servicemanDateAgeIncidentPlaceRecruit (REC) Allen Tan Chong Huat24 October 196819Fatally stung by [hornets](/wiki/Hornet).[Chua Chu Kang](/wiki/Chua_Chu_Kang), SingaporeSecond Lieutenant (2LT) Tay Seow Kai26 August 1970212LT Tay grabbed a grenade from a recruit who fumbled while handling the grenade during a live exercise. The grenade detonated in his hand, killing him and causing minor injuries for 2 others.[Singapore Armed Forces Training Institute](/wiki/SAFTI_Military_Institute), SingaporeRecruit (REC) Lim Soon Aik15 September 197719Recruit Lim Soon Aik was shot in the stomach during a live firing exercise by another soldier who negligently discharged his AR-15. He died 2 weeks later from septicaemia.Nee Soon, SingaporePrivate (PTE) Edward Rengasamy29 August 198118Soldier died after iron piece pierced his throat during SAF Display Rehearsal [West Coast Park](/wiki/West_Coast_Park), SingaporeCorporal (CPL) Tamil Selvam s/o Suppiah9 October 198222Fatally wounded in a training exercise.[Sembawang](/wiki/Sembawang), SingaporePrivate (PTE) Tham Wai Keong23 May 198318Tham was found dead a day after he had gone missing from a route march. The state coroner reported that the private died from a ruptured stomach, but an open verdict was recorded as a forensic pathologist was unable to exclude the possibility that Tham was hit by the entrenching tool found next to his body.[Pulau Tekong](/wiki/Pulau_Tekong), SingaporeLieutenant (LTA) Koh Meah Wan10 April 198423Died of unspecified \"serious injuries\" during a training exercise.[Sungei Gedong](/wiki/Lim_Chu_Kang), SingaporeRecruit (REC) Sim Keat Kee13 April 198419Collapsed during a two-kilometre run.-Recruit (REC) Bak Yow Hock18 April 198417Died while undergo training at School of Naval Training.[Sembawang](/wiki/Sembawang), SingaporePrivate (PTE) Hay Yong Chye26 November 198619Buried alive.[Sarimbun Ave](/wiki/Lim_Chu_Kang), SingaporeStaff Sergeant (SSG) Goh Kim Loong Corporal (CPL) Ramiya Mohan Lieutenant (LTA) Ng Soon Hup Lieutenant (LTA) Siow Poh Guan Lieutenant (LTA) Wee Tong Leong Captain (CPT) Lakbir Singh24 January 1987-Helicopter crash.Near [Brunei International Airport](/wiki/Brunei_International_Airport), BruneiPrivate (PTE) Lim Chee Keng19 February 199421Collapsed at the end of a 10-kilometre run.[Kranji](/wiki/Kranji), SingaporeSecond Lieutenant (2LT) Zulhelmi Mohammad Said3 August 199620Struck by lightning while moving his platoon out of a training area due to bad weather.[Lim Chu Kang](/wiki/Lim_Chu_Kang), SingaporeOfficer Cadet Trainee (OCT) Tan Sek Hong9 December 199619Tan Choon Ming (OCT), 20, loaded a general purpose machine gun without permission and meddled with its trigger in front of a group of officer cadets trainees. He shot Tan Sek Hong, 19, in the chest. Tan later died of a gun shot wound.Rest area of the live-firing area of Safti Camp, off Upper Jurong RoadThird Sergeant (3SG) Ronnie Tan Han Chong Lance Corporal (LCP) Low Yin Tit9 March 1997-A 155mm artillery round exploded in the barrel of a [FH-2000](/wiki/FH-2000) [howitzer](/wiki/Howitzer) during a live-firing exercise conducted by the 23rd Battalion, [Singapore Artillery](/wiki/Singapore_Artillery). Twelve other servicemen were injured in the incident, including a liaison officer from the [New Zealand Army](/wiki/New_Zealand_Army). The explosion was caused by a defective [fuze](/wiki/Fuze) supplied by the Chartered Ammunition Industries which failed to ensure that the fuzes procured by its contractor met military specifications.Waiouru Army Camp, [New Zealand](/wiki/New_Zealand)Captain (CPT) Teddy Quah Kok Meng11 December 1999-Died after the vehicle he was travelling in crashed into a tree.[Shoalwater Bay Training Area](/wiki/Shoalwater_Bay_Training_Area), [Queensland](/wiki/Queensland), [Australia](/wiki/Australia)Captain (CPT) Lim Kim Hock02 November 2000-An Air Force Weapons Systems Officer was perished onboard [SQ 006](/wiki/SQ_006) was on his way to attend the Advanced Fighter Weapons Instructor Course at the Air National Guard, USA.[Taoyuan International Airport](/wiki/Taoyuan_International_Airport), [Taipei](/wiki/Taipei), [Taiwan](/wiki/Taiwan)Second Lieutenant (2LT) Daryl Loh Chuan Rong26 February 2001-A Full-Time National Serviceman. Thrown overboard as the Missile Gunboat he was on suddenly accelerated and struck another gunboat.Changi Naval Base, SingaporeCorporal (CPL) Kwok Wei Ming29 October 200120A Full-Time National Serviceman. Collapsed during a Commando Battalion training and died in camp after being transported to its medical facility.Hendon Camp, SingaporeLance-Corporal (LCP) (NS) Mohd Shahlan bin Abdul Rahim15 May 2002-Collapsed while taking his Individual Physical Proficiency Test (IPPT), and died in hospital.[Clementi Camp](/wiki/Clementi,_Singapore), SingaporeRecruit (REC) Ivan Ho Yong Hua10 Oct 2002-Found unconscious at training ground and died in hospital.[Pulau Tekong](/wiki/Pulau_Tekong), SingaporeSecond Sergeant (2SG) Hu Enhuai21 August 2003-Died from [asphyxia](/wiki/Asphyxia) and near [drowning](/wiki/Drowning) during a [POW](/wiki/Prisoner_of_war) survival training course. Four [commando](/wiki/Singapore_Armed_Forces_Commando_Formation) officers conducting the training were jailed for carrying out an inappropriate \"dunking\" procedure that led to his death.[Pulau Tekong](/wiki/Pulau_Tekong), SingaporeFirst Sergeant (1SG) Shiva s/o Mohan13 July 2005-Accident while performing heli-borne rappelling. Also involved one other foreign serviceman.Sembawang AirbaseRecruit (REC) Andrew Cheah Wei Siong10 June 2008-Fainted during a 2 kilometre training walk as part of the enhanced Basic Military Training (BMT) for [obese](/wiki/Obesity) recruits. He was evacuated by helicopter to Singapore General Hospital where he was pronounced dead.[Pulau Tekong](/wiki/Pulau_Tekong), SingaporeSecond-Lieutenant (2LT) Lam Jia Hao Clifton[a]12 June 200820Collapsed during a jungle orientation training in Brunei; died in hospital.BruneiPrivate (PTE) Foo Wei Rong Joe1 October 200820Collapsed while doing [pull-ups](/wiki/Pull-up_(exercise)). He was later evacuated to Tengah Medical Centre, where the doctors tried to resuscitate him. He subsequently sent to National University Hospital while the medical doctor and medic continued their resuscitation attempt en route, but was subsequently pronounced dead.[Lim Chu Kang Camp](/wiki/Lim_Chu_Kang), SingaporeFirst Warrant Officer (1WO) Tan Poh Eng21 May 200953Died in a parachuting accident.Bloemfountein, South Africa2nd Warrant Officer (2WO) Poh Eng HuatApril 200936Found unconscious at 6.05pm in a flight crew room after performing 'tunnel crawl demo of an F-5 Tiger aircraft. He was later sent to the Changi General Hospital where the SAF doctors and medics team continued their attempts to resuscitate him en route to the hospital. Unfortunately, he was pronounced dead at 7:24pm at the [Changi General Hospital](/wiki/Changi_General_Hospital).[Paya Lebar Airbase](/wiki/Paya_Lebar_Airbase), Singapore2nd Lieutenant (2LT) Nicholas Chan Wei Kit3 July 200923Hit backwards by a reversing Land Rover driven by Private Muhammad Abdul Qaiyuum Muhammed Iskander at the garage while 2LT Nicholas was performing engine checks behind the vehicle.Seletar Camp, SingaporeLance Corporal (LCP) Eugin Wee Yong Choon28 January 201120Hit by a truck driven by another serviceman while unloading stores.[Jurong Camp](/wiki/Jurong), SingaporeSpecialist Cadet Trainee (SCT) Ee Chun Sheng2 August 201121Found not breathing after separated from his teammates during a training exercise. Due to either \"natural disease process\" caused by a heart defect or possible heat stroke.Ama Keng Training Area, Lim Chu Kang, SingaporeCorporal (CPL) Li Hong Yang10 January 201228Collapsed after completing the 2.4 kilometre run in the IPPT.[Kranji Camp](/wiki/Kranji), SingaporePrivate (PTE) Dominique Sarron Lee Rui Feng17 April 201221Breathing difficulties triggered by an [allergic reaction](/wiki/Allergic_reaction) to smoke grenades. COI found out that CPT Najib Hanuk Bin Muhamad Jalal was responsible for throwing 6 smoke grenades (three times more than needed for training). Death could have been prevented if Safety officer CPT (now LTC) Chia Thye Siong had stopped CPT Najib.[Murai Urban Training Facility](/wiki/Murai_Urban_Training_Facility)Third Sergeant (3SG) Tan Mou Sheng10 May 201220Found pinned to his [jeep](/wiki/Jeep) and unconscious after its driver, 3SG Cavin Tan, lost control of the vehicle.[Marsiling](/wiki/Marsiling), SingaporeLance Corporal (LCP) Muhammad Fahrurrazi Bin Salim12 August 201220Went missing during a jungle training exercise. He was the [coxswain](/wiki/Coxswain) in a convoy of four boats meant to support water crossing segment of the exercise. His body was found three days later, 200 metres from his last known position.Sungai Batu Apoi river, [Temburong District](/wiki/Temburong_District), BruneiLance-Corporal (LCP) (NS) Tan Tai Seng27 September 201223Hit by falling tree while waiting to enter training area.Ama Keng Training Area, [Lim Chu Kang](/wiki/Lim_Chu_Kang), SingaporeThird Sergeant (3SG) Chan Hiang Cheng Gavin15 September 201721His [Bionix Infantry Fighting Vehicle](/wiki/Bionix_Infantry_Fighting_Vehicle) toppled sideways while he was guiding it out of difficult terrain; he was heli-evacuated to Rockhampton Hospital, where he succumbed to his injuries.[Shoalwater Bay Training Area](/wiki/Shoalwater_Bay_Training_Area), [Queensland](/wiki/Queensland), [Australia](/wiki/Australia)Corporal First Class (CFC) Lee Han Xuan Dave[b]30 April 201819Displayed signs of [hyperthermia](/wiki/Hyperthermia) on 18 April after completing an 8 kilometre fast march. Lee was evacuated to the camp's medical centre and subsequently transferred to [Changi General Hospital](/wiki/Changi_General_Hospital), where he was warded in an [intensive care unit](/wiki/Intensive_care_unit), but his condition only worsened.[Bedok Camp](/wiki/Bedok), SingaporeCorporal First Class (CFC) Liu Kai[c]3 November 201822Killed in a training accident when a [Bionix AFV](/wiki/Bionix_AFV) vehicle reversed into his Land Rover during a training exercise.[Murai Urban Training Facility](/wiki/Murai_Urban_Training_Facility)Corporal First Class (CFC) (NS) [Aloysius Pang](/wiki/Aloysius_Pang)24 January 201928Died four days after sustaining severe chest and abdominal injuries when the barrel of a self-propelled [Howitzer](/wiki/Howitzer) was lowered while he was repairing it with two other SAF personnel during Exercise Thunder Warrior.[Waiouru Military Camp](/wiki/Waiouru_Military_Camp), [New Zealand](/wiki/New_Zealand) ## Notes\n",
  "language": "en",
  "processed_at": "2026-01-12T11:25:29.402046",
  "title": "List of military training deaths in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/List_of_military_training_deaths_in_Singapore"
}