{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:25:21.406982"
  },
  "content": "This list **contains entries that may be out of scope and need to be evaluated for removal**. Please help clean it up by removing items that do not meet the inclusion criteria agreed upon on the talk page. *(August 2022)*This article may **require cleanup** to meet Wikipedia's quality standards. The specific problem is: **This list does not seem to adhere to some WP:BLP policies, specifically WP:BLPNAME.** Please help improve this article if you can. *(August 2022)* *(Learn how and when to remove this message)* The following is a list of **major** [crimes in Singapore](/wiki/Crime_in_Singapore) that happened in 2020 and beyond. They are arranged in chronological order. ## 2020 - 3 January 2020: Paul Leslie Quirk, a [schizophrenic](/wiki/Schizophrenia) [Australian](/wiki/Australians), was arrested at his condominium at [Compassvale](/wiki/Compassvale) for allegedly killing his Singaporean wife Christina Khoo Gek Hwa using a mop stick and then throwing his dog from the balcony resulting in its death. Initially charged with murder, Quirk was found guilty of a lesser charge of [culpable homicide](/wiki/Culpable_homicide) not amounting to murder as he was suffering from a relapse of his schizophrenia at the time he murdered Khoo. Quirk was later sentenced to serve a 10-year jail sentence on 24 May 2021. - 21 February 2020: Four-year-old [Megan Khung](/wiki/Megan_Khung_Yu_Wai) was abused and killed by her mother Foo Li Ping and her boyfriend Wong Shi Xiang. Her corpse was later burned with the help of their friend Nouvelle Chua Ruo Shi about three months later. Khung's grandmother lodged a police report on 20 July which led to the arrest of all three suspects for the murder. On 28 February 2025, Wong pleaded guilty to the manslaughter and abuse of Khung, and Foo pleaded guilty to allowing the death of her child and inflicting abuse, and on 3 April 2025, Wong was sentenced to 30 years in jail with 17 strokes of the cane while Foo was sentenced to 19 years in jail. As of 2025, Chua is currently awaiting trial for helping to dispose of the body. - [March 2020 – 10 November 2020](/wiki/2020_Jurong_child_killing): For eight months, an 11-year-old girl (whose name was withheld due to a gag order) was physically abused by her stepfather Mohamad Fazli Selamat and mother Roslinda Jamil inside their [Jurong](/wiki/Jurong) flat. The girl was reportedly made to eat [chilli padi](/wiki/Bird%27s_eye_chili) or being beaten by an exercise bar or other objects as punishment for her supposed misconducts. The girl died from the abuse around 7 November following another abuse from Fazli (her mother Roslinda acted as a bystander). Both parents were charged for murder, but in February 2023, Fazli pleaded guilty to manslaughter and another five counts of child abuse while Roslinda pleaded guilty to allowing the death of her child in the same household and child abuse. Fazli was sentenced to 15 years and 11 months' imprisonment and 12 strokes of the cane on 15 February 2024, while Roslinda was jailed for seven years, eight months and three weeks. - [10 May 2020](/wiki/Punggol_Field_murder): A jogger was stabbed to death by a man in [Punggol](/wiki/Punggol); the attack was recorded by a CCTV camera. About a week after the victim, Tay Rui Hao, was killed, Surajsrikan Diwakar Mani Tripathi was arrested. Surajsrikan was reported to have emotional distress on 10 May; in 1999, his father abandoned his then-pregnant mother about two months after the marriage, and in 2018, he was enlisted by the military. He was assessed to be suffering from [borderline intelligence](/wiki/Borderline_intellectual_functioning), and both severe [social anxiety disorder](/wiki/Social_anxiety_disorder) and [obsessive-compulsive disorder](/wiki/Obsessive%E2%80%93compulsive_disorder), although he was mentally sound and fit to stand trial. Surajsrikan was found guilty of murder and sentenced to [life imprisonment](/wiki/Life_imprisonment) with 15 [strokes of the cane](/wiki/Caning_in_Singapore) on 15 September 2022. This case also prompted the government to pass laws to allow police to obtain data from [TraceTogether](/wiki/TraceTogether) for police investigations. - 27 August 2020: A Chinese foreigner Cui Huan beat up his wife, Liang Xueqiu, for four years after being caught in an affair with another man. Liang died due to [intracerebral hemorrhage](/wiki/Intracerebral_hemorrhage) as a result of the injuries. Initially charged with murder, the charge was lowered to a charge of voluntarily causing grievous hurt in November 2021. He was indicted on 15 February 2022 with a seven-year jail term and nine strokes of the cane. - 11 December 2020: A 14-year-old boy (name withheld due to child protection act) killed his father through stabbing with a fruit knife. The boy had been diagnosed with [Internet gaming disorder](/wiki/Video_game_addiction) and [autism](/wiki/Autism) at a young age, and plotted revenge after his father restricted his access to computer games since June that year. He pleaded guilty on 24 January 2022 to a reduced charge of culpable homicide not amounting to murder in the [High Court](/wiki/High_Court_of_Singapore), and the boy was remanded at the Singapore Boys' Home for five years at the time of arrest. This was the first case where a minor committed murder, culpable homicide, attempted murder or causing grievous hurt. Under the Children and Young Persons Act, a detention period has to be imposed instead of a jail sentence. ## 2021 - 2 April 2021: A cleaner on a work permit from [Myanmar](/wiki/Myanmar), Naing Lin, stabbed his fellow roommate and engineer Myo Kyaw Thu, also from Myanmar, following an argument and insult over Myo's issue over moneylending. Naing fled from the scene before returning to his dorm to discover Myo was found dead; he surrendered to the police for a murder charge and was sentenced to [life imprisonment](/wiki/Life_imprisonment_in_Singapore) on 22 September 2022 after Naing pleaded guilty; however, he was not caned due to his age. - 12 April 2021: In the first case of an armed robbery involving firearms in 15 years, a debt-ridden [Aetos](/wiki/Aetos_Security_Management) auxiliary police officer Mahadi Muhamad Mukhtar, armed with his service revolver, robbed a licensed moneylending company at [Jurong](/wiki/Jurong) and stole more than $24,800, of which he used part of the proceeds to clear his debts and remit some to his girlfriend. Mahadi was convicted on 13 September for one charge of robbery and two charges of illegal possession of firearms and ammunition under the [Arms Offences Act](/wiki/Arms_Offences_Act), and he was sentenced to 16 years and six months' imprisonment and 18 strokes of the cane. Mahadi's girlfriend was initially charged with dishonestly receiving stolen property in the same month of Mahadi's arrest but was [acquitted](/wiki/Acquittal) by the court in August 2022 following further investigations. In May 2023, an appeal reduced Mahadi's term to 14 years, although his caning remained at 18. - 14 July 2021: Heng Boon Chai, a schizophrenic man who was previously jailed for killing his uncle in 2007, was arrested for stabbing his neighbour Kim Wee Ming outside his flat at [Punggol](/wiki/Punggol). Investigations and court hearings revealed that in addition to previous altercations with Heng and his mother, Kim had harassed Heng with taunts after returning home drunk, and the repeated provocations led to Heng stabbing Kim. Heng was convicted of murder, and sentenced to life imprisonment with ten strokes of the cane on 7 November 2024. - [19 July 2021](/wiki/River_Valley_High_School_attack): [River Valley High School](/wiki/River_Valley_High_School,_Singapore) student Ethan Hun Zhe Kai was killed by a 16-year-old student (who could not be named under the Children and Young Persons Act) via an [axe](/wiki/Axe) and a kitchen knife. He was subsequently arrested and charged with murder the following day, and these weapons were recovered on the scene in a toilet. The attacker was found to have previously attempted suicide in 2019 and subsequently assessed at the [Institute of Mental Health](/wiki/Institute_of_Mental_Health_(Singapore)) that same year. On 1 December 2023, the charge was subsequently reduced to culpable homicide not amounting to murder; the student pleaded guilty and was served a 16-year jail sentence. The sentence was imposed by Justice Hoo Sheau Peng over deterrence and noted that the student had gone through premeditation and planning to kill Hun. An appeal to reduce his sentence to 8–10 years was made on 23 October 2023, but was dropped by the High Court exactly a year after its appeal. ## 2022 - [11 January 2022](/wiki/2022_Ang_Mo_Kio_flat_stabbing): David Brian Chow Kwok-Hun murdered his wife Isabel Elizabeth Francis, who was 15 weeks' pregnant at the time of death, through stabbing while she was asleep. Chow did this because he wanted to commit suicide following a misunderstanding of his company going bankrupt over a wrong accounting report, and that he would relieve Francis' fear of being a widow; he ultimately surrendered himself to the police following two unsuccessful attempts. He was jailed for seven years following the court indicting him a reduced charge of culpable homicide not amounting to murder on 26 October 2023. - [21 January 2022](/wiki/Greenridge_Crescent_twin_killings): A pair of 11-year-old twin boys with disabilities, Ethan Yap E Chern and Aston Yap Kai Shern, were found dead in a canal next to a playground along Greenridge Crescent. Their father, Xavier Yap Jung Houn, was arrested the day after. Following psychiatric investigations of major depressive disorder of moderate severity, the court reduced his charge to culpable homicide not amounting to murder, and on 15 August 2023, pleaded guilty with a 14-year jail sentence. - 17 February 2022: A knife-wielding man, Soo Cheow Wee was shot by police officers during a confrontation outside the [Clementi](/wiki/Clementi,_Singapore) Police Centre at around 11pm. Soo was involved in an earlier assault case that happened around 8:40pm where police were alerted that a 41-year-old man was allegedly assaulted with a knife by the same suspect along Block 420A Clementi Avenue 1. The victim sustained injuries on his right arm and wrist. Preliminary investigations revealed that neither of them knew each other. In a statement, the police revealed that immediately after the first incident took place, Soo took a taxi to Clementi Police Division and was seen wielding a knife while standing outside the police station. Officers that were on duty approached Soo but he was shouting at the police officers incoherently and despite repeated instructions to drop his knife, the suspect refused to do so and charged towards one of the officers, who fired a shot at Soo. Soo suffered a gunshot wound on his left arm and was detained by the officers, before he was taken to hospital for treatment. Soo was charged in court on 18 February 2022 for criminal intimidation and voluntarily causing hurt with a dangerous weapon, and on 26 October 2022, Soo, who turned 50 before his September 2022 trial, was convicted and sentenced to 33 months' imprisonment for committing these armed assaults, and he escaped caning due to his age. In April 2023, the prosecution appealed for a sentence of at least five years' corrective training or a jail term of 57 to 63 months on the grounds that Soo's sentence was \"manifestly inadequate\" while Soo's defence lawyer Chooi Jing Yen sought to further reduce his client's sentence to 23 months. On 31 July 2023, Chief Justice [Sundaresh Menon](/wiki/Sundaresh_Menon) dismissed the prosecution's appeal but allowed Soo's appeal, and lowered his sentence from 33 months to 27 months, after finding that Soo's mental condition was not adequately taken into consideration by the district judge during sentencing. While serving his sentence, Soo would be allowed parole in August 2023. - 6 April 2022: Niswan Thiruchelvam and Muhammad Sajid Saleem both used bread knives to attack two wedding guests, Praveen Raj Chanthiran and Sarankumar Subramaniam, at an open-air carpark. They were arrested through a manhunt, and were charged for voluntarily causing grievous hurt. Niswan was additionally charged for being a member of an unlawful assembly as he joined a gang in 2016 and was given three years and three-month jail sentence and six strokes of the cane; he also was fined S$1,800 and given a 12-month driving disqualification for a separate traffic offence. Sajid pleaded guilty on 2 November, while Niswan was separately tried and convicted after he pled guilty to his charges a week later and the court determined the sentence on 30 November. - 14 April 2022: 46-year old Chinese national Cheng Guoyuan attacked 42-year old Han Hongli with a [cleaver](/wiki/Cleaver) outside a restaurant located at along Beach Road. Several colleagues and workers from other restaurants managed to save the victim from the attack and endured a retaliation from the man itself in the process; he was eventually cornered in another restaurant where police officer subdued him with a taser following him ignoring repeated instructions to surrender. He was charged two days later for attempted murder, pleading guilty to that charge on 20 May 2025. On 3 June 2025, Justice Audrey Lim sentenced Cheng to 19 years jail and 8 strokes of the cane. - 4 July 2022: A China-born Singaporean permanent resident, Kevin Pi Jiapeng, and his Thai wife, Pansuk Siriwipa, who were both wanted in connection with Tradenation Pte Ltd and Tradeluxury Pte Ltd, both involving a luxury goods scam amounting to S$32 million in undelivered goods, fled from Singapore by hiding in a container compartment of a lorry departing for Malaysia, driven by Mohamed Alias; the two Malaysian drivers were arrested for abetting the couple to flee and illegal entry. An [Interpol red notice](/wiki/Interpol_notice) was issued for the couple on 21 July. They were arrested on 11 August inside a hotel around [Johor Bahru](/wiki/Johor_Bahru) and were deported to Singapore. Of 180 charges brought against her, Pansuk pleaded guilty to 30 counts of cheating, fraudulent trading and money laundering and was sentenced to 14 years' imprisonment; Pi faces nine charges, with his case pending before the courts. According to the [Singapore Police Force](/wiki/Singapore_Police_Force) in a statement of Pansuk's arrest, 187 police reports were filed against them over the past three months. In February 2022, both companies were operating at significant losses, as they were sourcing their goods at a higher price, which precipitated the crime. - 10 October 2022: Eddie Seah Wee Teck was murdered by his 19-year-old son Sylesnar Seah Jie Kai through slashing with cake knife following a heated argument at their [Yishun](/wiki/Yishun) flat in the evening and was arrested immediately with a charge issued on 12 October. On 30 September 2024, Justice Dedar Singh Gill sentenced Sylesnar Seah to six years’ imprisonment for culpable homicide. ## 2023 - 14 January 2023: A couple was charged for the [infanticide](/wiki/Infanticide) of their two-month-old biological daughter, later identified as [Zabelle Peh](/wiki/Killing_of_Zabelle_Peh), who was abused and suffered a fractured skull. Originally charged with murder, Sim Liang Xiu (Zabelle's mother) was sentenced to eight years in prison for a reduced charge of manslaughter, while the father, Peh Wei Jian, was sentenced to seven years' jail for failing to protect his daughter from the abuse. - January 2023: A teenager boy and his schoolmates attacked and injured two unnamed victims (names of all of them are withheld due to the Children and Young Persons Act) in a local carpark in [Choa Chu Kang](/wiki/Choa_Chu_Kang), and later in December, injured another three victims in a fight at [Peninsula Plaza](/wiki/Bras_Basah_Road); the teenager was also involved in scamming people through [Telegram](/wiki/Telegram_(software)) between April 28 and May 2, and on May 31, was caught by the security guards of [State Courts](/wiki/State_Courts_of_Singapore) for disposing both a [karambit](/wiki/Karambit) and a [vaporizer](/wiki/Electronic_cigarette) and suspicious behavior while attending the hearing of his friend. The court ruled the boy guilty of these charges on March 15, 2024, and sentencing is yet to be determined. - [15 August 2023](/wiki/2023_Singapore_money_laundering_case): Ten Chinese foreigners were arrested for the involvement of the largest money laundering case in Singapore's history, where a total of $3 billion were seized during the investigations. All of them were given jail terms ranging from 13 to 17 months in 2024, including a [reentry ban](/wiki/Persona_non_grata). The number later extended to 17 and the pursuit for the 15 individuals ended on 19 November 2024 and all charges were dropped in exchange of being banned in Singapore; the charges for the other two individuals are yet to be determined. - 20 August 2023: A brawl occurred at the Concorde Hotel along [Orchard Road](/wiki/Orchard_Road), where a group of more than ten people severely injured two people, one of which, Mohammad Isrrat, later died. 14 people were arrested for the death of Mohammad Isrrat; one of which was charged with murder while 16 other suspects were convicted with lesser charges ranging between rioting and causing hurt. On 25 June 2024, one of the suspects, Sharvin Jay Nair, who caused hurt to Isrrat, who was given a 12 month-eight week jail term and a $2,000 fine. One suspect was acquitted of all charges and a third was granted a discharge not amounting to an acquittal as of June 2024. - 30 October 2023: A man was charged for assaulting two policemen with a stun device at [Victoria Street](/wiki/Victoria_Street,_Singapore), alongside possession of dangerous weapons and controlled drugs, both of which are legally forbidden by law. The two policemen were taken to the hospital for recovery. ## 2024 - 29 March 2024: For five weeks, between 26 February and 29 March, the Singapore Police Force collaborated with the [Hong Kong Police Force](/wiki/Hong_Kong_Police_Force) and [South Korean National Police Agency](/wiki/National_Police_Agency_(South_Korea)) in a joint operation targeting child pornography. A total of 272 suspects, with the youngest being 12 years of age, were arrested. In Singapore alone, 28 people between the ages of 18 and 59 were nabbed in this operation. - 10 May 2024: 27-year-old [Certis](/wiki/Certis_Group) auxilliary police officer Heng Jun Hao was arrested for failing to return his service revolver after his duty ended. He was arrested at Bugis+ shopping centre on 11 May. If found guilty, he faces a jail term of between five and 14 years, and at least six strokes of the cane. - 6 September 2024: A Chinese national and Singapore permanent resident Wu Tao, 41, was accused of the murder of 48-year-old female hawker Tan Kamonwan at a hawker stall called *Dao Xiang Ju*, at Maxwell Food Centre located at Kadayanallur Street; preliminary investigations revealed that both parties knew each other. Wu surrendered to the police in the early hours of 7 September; Wu was brought to the crime scene for investigation purpose on 15 October. - 22 September 2024: A barbaric brawl happened at Kim San Leng Eating House along Verdun Road at 4am; there are two reported injuries and one fatality. The case has been classified as murder and as a riot. Three men and four suspects were accused of rioting and is currently under investigation. - 21 October 2024: A video footage of a suspect, 50-year-old Toh Chee Hong, fatally assaulting a victim, 41-year-old Winson Khoo, at a Clementi housing block was taken by residents. Toh drove away in his car in an attempt to escape from the scene after the assault, but he was stopped and arrested by police. Following preliminary investigation including interview of eyewitnesses, Toh was charged for murder on 23 October and remanded for a week. The suspect and victim were known to each other according to investigation. On 30 October, the court adjourned Toh's case to 20 November after the prosecution asked the court to further remand Toh for psychiatric assessment following the completion of their investigation. No objection was raised by Toh's defense lawyers. - 29 October 2024: Jasmine Au, a 70-year-old [Yakult](/wiki/Yakult) delivery woman, was allegedly assaulted by a 30-year-old man Lim Chuan Xun at a residential block in [Sengkang](/wiki/Sengkang). Au was punched on the right side of the face and was later sent to the hospital, where she later fell into a coma. She died a week later on 6 November shortly after the family decided to pull her off the life support system after learning that her condition had deteriorated critically. Lim was arrested and handed six count of charges in court on 15 November, including one for voluntarily causing grievous hurt to the victim; his sentence is currently pending. - 8 November 2024: Timothy Heng Shengxian, a 42-year-old Singaporean man, was shot by the police at Pasir Ris Park Mangrove Boardwalk in the early morning hours after he threatened to attack the police officers with an improvised [flamethrower](/wiki/Flamethrower). The police were responding to a call from a man alleging that a woman was purportedly sitting on the ledge at the top of a bird-watching tower, which investigation later showed was an attempt by Heng to lure officers out using false information with the intent to cause harm to them. Heng sustained puncture wounds on his left forearm and abdomen but was taken conscious to hospital. On 9 November, Heng was charged in court with attempted murder. He was also handed two other charges for a previous case of causing grievous hurt and harassment that took place in September 2023 in which he had a warrant of arrest issued against him after failing to attend court. - 9 November 2024: A Catholic priest, Christopher Lee, was stabbed by a Singaporean Sinhalese man, Basnayake Keith Spencer, also an ex-convict for a crime in 2019, during a communion at the parish's monthly children's mass at [Saint Joseph's Church, Bukit Timah](/wiki/Saint_Joseph%27s_Church,_Bukit_Timah), in which the identity was quickly known through several sources. Keith was currently reprimanded for safety reasons and was awaiting trial on 6 January 2025. - 29 November 2024: A 66-year-old Singaporean man, Ng Chen Heng, was charged with the murder of a 67-year-old woman, Lim Suan Lian, in her Ang Mo Kio Housing Board flat. According to neighbours, both suspect and victim could be often heard quarrelling and it was known suspect had been locked out of the house on multiple occasions. - 2 December 2024: The case of a 30-year-old woman found dead in a flat along Dover Road was classified as murder by the Singapore police. A 34-year-old man, suspected of being involved in the murder, left Singapore prior to the police receiving a call for assistance. The suspect and the victim were known to each other. The police is currently engaging foreign authorities to obtain more information and locate the whereabouts of the suspect. - 10 December 2024: In the Hougang knife attack, a 42-year-old man, Chinese national Du Zaixing, allegedly stabbed a female employee of a hardware store in Hougang, 36-year-old Vietnam national Dao Thi Hong, who later succumbed to her injuries. Another worker at the store, a 26-year-old man, was injured by the same man when he tried to intervene. All parties involved were believed to know each other. The man was arrested at the scene and was charged with murder on 12 December 2024. ## 2025 - 11 March 2025: 57-year-old Abdul Rahman Mohamad Ariffin was found lying motionless at Block 187 [Boon Lay](/wiki/Boon_Lay) Avenue at 11:35am. Preliminary investigations showed that both parties were known to each other. Neighbours told the media they heard loud arguing voices across the unit many times during late night. The victim who was a younger brother believed to have died from asphyxiation. His 58-year-old brother Abdul Rani Md Ariffin was arrested in connection of the murder on the next day. Police investigations are ongoing, and the cause of death has yet to be officially confirmed. - 1 June 2025: 44 year old Mr Lim Yuen Li was arrested for killing & slashing his mother Mdm Wang How Khiew in Block 465B Fernvale Road at 11:48 am. Preliminary investigations revealed that both parties were known to each other. Neighbours noticed Ms Wang lying motionless with pool of blood coming out from her stabbed chest & abdomen inside the living room flat. SCDF paramedics pronounced her dead at 12 noon. On 3 June, Lim was ordered to be remanded for psychiatric assessment at the [Changi Prison](/wiki/Changi_Prison) Complex Medical Centre. His case will be mentioned again in court on 24 June. - 13 July 2025: A provision shop owner named Ramalingam Selvasekaran was charged for sexually assaulted the 11 year old girl twice after the victim returned later that day to buy ice cream from the minimart. Ramalingam was guilty of all three charges for one count of rape and two counts of outrage of modesty after a trial in which he represented himself in court. The rape victim was taken to KK Women’s & Children’s Hospital for medical treatment. Ramalingam, who was 55 years old at the time of the offences, was accused by the prosecution of leading the girl to the inner confines of his shop to touch her and make her perform oral sex on him. While there was no dispute that Ramalingam suffered from [erectile dysfunction](/wiki/Erectile_dysfunction), the judge said the prosecution’s expert witness gave a cogent explanation that oral rape remained possible. 0n 30 July 2025, Ramalingam was sentenced to 14 years, 3 months & 2 weeks jail for sexual crimes. Due to his age, he was given extra months of jail term in lieu of caning. - 25 September 2025: A 30-year-old Vietnamese woman was stabbed at the housing unit in Block 323 Yishun Central at 7:25am. Neighbours next door saw one woman and two men lying injured at the sixth-floor corridor & were taken to [Khoo Teck Puat Hospital](/wiki/Khoo_Teck_Puat_Hospital). The Vietnamese woman succumbed to her stabbing injuries. Loud screams & yells were heard opposite the blocks when the argument started fifteen minutes earlier. The police found bloodstains at the lift lobby, and inside the lifts at the 6th storey. A knife, a watch, a mobile phone, a set of car keys and a slipper lay on the bloodstained floor. The entire sixth level was cordoned off, with at least eight police officers present. 66 year old suspect, Koh Ah Hwee was arrested for murder at 8:15am & was taken to hospital. If found guilty, he will face the death penalty. - 15 October 2025: A 23-year-old on duty full-time Police national serviceman was found alone with a gunshot wound to his neck by his teammates in a toilet at a shell petrol kiosk along 328 Pasir Panjang Road at 9pm. He was conveyed conscious to the hospital. His service revolver and remaining ammunition were accounted for and seized at scene. No other person was injured at the scene. - 13 November 2025: A 23-year-old man was charged in a district court on Nov 15 with the murder of an older man at Laguna Park condominium in Marine Parade. Yeo Tze How is accused of murdering Mr Tham Lup Hong, 68, at the lift lobby on the 13th floor of 5000C Marine Parade Road between 12.20pm and 12.45pm on Nov 13. - [Capital punishment in Singapore](/wiki/Capital_punishment_in_Singapore) - [Life imprisonment in Singapore](/wiki/Life_imprisonment_in_Singapore) - [List of major crimes in Singapore](/wiki/List_of_major_crimes_in_Singapore)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:25:21.406441",
  "title": "List of major crimes in Singapore (2020–present)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/List_of_major_crimes_in_Singapore_(2020%E2%80%93present)"
}