{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:25:20.640066"
  },
  "content": "Major crimes in Singapore 2010–2019: murders, drugs, abuse, and major fraud cases**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This list **contains entries that may be out of scope and need to be evaluated for removal**. Please help clean it up by removing items that do not meet the inclusion criteria agreed upon on the talk page. *(August 2022)*This article may **require cleanup** to meet Wikipedia's quality standards. The specific problem is: **This list does not seem to adhere to some WP:BLP policies, specifically WP:BLPNAME.** Please help improve this article if you can. *(August 2022)* *(Learn how and when to remove this message)*This article **may contain an excessive number of citations**. Please help improve it by removing low-quality or irrelevant citations. *(December 2023)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* The following is a list of **major** [crimes in Singapore](/wiki/Crime_in_Singapore) that happened between 2010 and 2019. They are arranged in chronological order. ## 2010 - 14 February 2010: Lee Heng Wong allegedly murdered Xi Wei Feng, a [bouncer](/wiki/Bouncer) in De Basement Live Disco in [Geylang Road](/wiki/Geylang_Road), in which he fled afterwards. Lee would not be captured until 12 years later as a [fugitive](/wiki/Fugitive); he surrendered to the Malaysian police on October 11, 2022. He was taken back to Singapore two days later and arrested the same day. On October 18, 2024, Lee was sentenced to 16 years' imprisonment by the High Court after he pleaded guilty to a reduced charge of culpable homicide, following further investigations and assessment. - [29 May 2010](/wiki/2010_Kallang_slashings): Four Malaysians committed a series of armed robberies which resulted in three injuries and one death. The robbers, Tony Anak Imba, Hairee Landak and Michael Garing, were arrested after the crime, while Donny Meluda who fled to Malaysia afterwards, was later arrested in 2017. Garing and Tony were found guilty on murder with the former receiving a death penalty and the latter receiving [life imprisonment](/wiki/Life_imprisonment) and 24 [strokes of the cane](/wiki/Caning_in_Singapore); Garing unsuccessfully appealed against their sentencing and the [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore) upheld their verdict. Garing was hung on 22 March 2019 following another unsuccessful clemency appeal from then-President [Halimah Yacob](/wiki/Halimah_Yacob). Hairee and Donny were each sentenced to 33 years' imprisonment and 24 strokes of the cane for multiple charges of armed robbery with hurt in 2013 and 2018 respectively. - 6 July 2010: [Abdul Kahar Othman](/wiki/Abdul_Kahar_Othman), who was previously released in 2005 after serving ten years of [preventive detention](/wiki/Preventive_detention) and had repeated records on entering prison since the age of 18, was re-arrested for drug trafficking 66.77 grams of [diamorphine](/wiki/Diamorphine). Othman was charged and convicted in 2013 and sentenced to death in 2015 after the High Court deemed that he was not a [courier](/wiki/Courier), making him ineligible for the alternative penalty of [life imprisonment](/wiki/Life_imprisonment). While on [death row](/wiki/Death_row), Othman unsuccessfully made multiple appeals for seven years; ultimately, he was hanged on 30 March 2022. His execution was the first to be conducted in Singapore since 2019, and also the first execution to be authorised during the [COVID-19 pandemic in Singapore](/wiki/COVID-19_pandemic_in_Singapore). - 22 September 2010: [Soh Wee Kian](/wiki/Soh_Wee_Kian) stabbed Hoe Hong Lin to death and four months prior, was also involved in an assault of How Poh Ling and two other incidents against women. Soh was initially charged with murder but due to an adjustment disorder with a depressed mood, he was found guilty of both culpable homicide and inflicting grievous hurt and was sentenced to life imprisonment on 22 August 2013; no caning was given due to his psychiatric conditions. - [30 October 2010](/wiki/Death_of_Darren_Ng_Wei_Jie): Darren Ng, a [Republic Polytechnic](/wiki/Republic_Polytechnic) student, was killed by a 12-member group of gang members at [Downtown East](/wiki/NTUC_Downtown_East). These members were arrested and charge for rioting and were given jail sentences ranging between three and 12 years and between three and 12 strokes of the cane for their respective crimes and other unrelated minor offences. ## 2011 - 18 January 2011: Malaysian [Datchinamurthy Kataiah](/wiki/Datchinamurthy_Kataiah) and his accomplice Christeen Jayamany were arrested at the [Woodlands Checkpoint](/wiki/Woodlands_Checkpoint) by the Singapore authorities for allegedly trafficking over 44.96g of [heroin](/wiki/Heroin) while crossing the border. Jayamany was a certified courier and sentenced to [life imprisonment](/wiki/Life_imprisonment) on 8 May 2015. Datchinamurthy, who failed his validiation as a courier, was given a death penalty. He was originally scheduled to be executed on 29 April 2022 following unsuccessful appeals, however Datchinamurthy obtained a stay of execution to allow him to continue to live while his current lawsuit was pending in the court. - [26 May 2011](/wiki/Murder_of_Celine_Ng): Celine Ng allegedly went missing on the date of her birthday after telling her flatmate that she wanted to go on a short overseas trip; she was reported missing two days after losing contact. Ng's family and friends, and the police, attempted to search for her, and her skeleton was later discovered 41 days after her disappearance, but the cause of death remained unknown. Police initially classified the case as a murder but later reduced it to manslaughter. Her flatmate Ang Soo Hoon, confessed to strangling Ng to death after failing to help Ng commit suicide, and was arrested. Ang was charged with a 12.5-year imprisonment in July 2015 to one charge of manslaughter, one charge of misappropriating Ng's money and one charge of providing false information to the police. - 28 December 2011: In a high-profile case involving an online [vice](/wiki/Vice) [syndicate](/wiki/Syndicate), 48 men, most of which were [civil servants](/wiki/Civil_servants), were charged for having sex with an underage prostitute. An eight-hour raid was held. Subsequent investigations revealed the online vice ring lead, Tang Boon Thiew, acquired at least S$370,000 from sexual services provided by the prostitutes he hired, including a 17-year-old minor from China. On 11 January 2013, Tang was sentenced to 58 months' imprisonment and a S$90,000 fine for 20 vice-related charges. ## 2012 - [30–31 March 2012](/wiki/2012_Jurong_West_killing): Gabriel Lee Haw Ling killed his fiancée Elsie Lie Lek Chee in their rented flat after believing that Lie was possessed by evil spirits. The charge was reduced to [culpable homicide](/wiki/Culpable_homicide) not amounting to murder after he was diagnosed to be suffering from a brief psychotic disorder at the time of incident, and on 24 February 2017 he was sentenced to 10 years' imprisonment. - 13 April 2012: [Nazeri Lajim](/wiki/Nazeri_Lajim) was arrested for trafficking 33.89g of diamorphine at the Far East Shopping Centre, along with [Dominic Martin Fernandez](/wiki/Dominic_Martin_Fernandez), who was his accomplice, was caught shortly after separation. A trial lasted for two years and on 8 August 2017, both were convicted of drug trafficking. Dominic was a certified courier and was sentenced to [life imprisonment](/wiki/Life_imprisonment) and 15 [strokes of the cane](/wiki/Caning_in_Singapore), while Nazeri was given the death penalty, in which he was hanged on 22 July 2022. - 27 May 2012: [Sujay Solomon Sutherson](/wiki/Sujay_Solomon_Sutherson), who had a history of [paranoid schizophrenia](/wiki/Paranoid_schizophrenia), killed his mother Mallika Jesudasan by stabbing. Unsuccessfully hiding the body by stuffing it into a suitcase, the body was discovered by Sujay's siblings and uncle hours after the murder who called the police. Sujay was charged to culpable homicide and in August 2015, following a five-day trial, was sentenced to [life imprisonment](/wiki/Life_imprisonment_in_Singapore). Seven years into imprisonment, Sujay died of illness on 8 September 2022. ## 2013 - 15 June 2013: A group of nine gang members attacked Wilson Siau with [parangs](/wiki/Parang_(knife)) outside [Cathay Cineleisure Orchard](/wiki/Cathay_Cineleisure_Orchard), which was witnessed by several passers-by at the time of attack. Nine men were arrested for rioting and involvement of an unlawful assembly, each given a jail sentence and strokes of the cane. - [10 July 2013](/wiki/Kovan_double_murders): Former police officer Iskandar bin Rahmat killed Tan Boon Sin and his son Chee Hong, in an ensuing robbery citing financial difficulties and bankruptcy which could affect his job. Boon Sin's body was discovered in his home at Hillside Drive, in [Kovan](/wiki/Kovan,_Singapore), while Chee Heong's body was dragged under a car for 1 km from the home before being dislodged outside [Kovan MRT station](/wiki/Kovan_MRT_station). Iskandar fled to Malaysia shortly, he was arrested in [Johor Bahru](/wiki/Johor_Bahru) two days later, extradited back to Singapore and charged with murder three days after arrest. On 4 December 2015, following unsuccessful claims of self-defence and that the killings was a result of a robbery gone wrong, Iskandar was found guilty of murder and sentenced to death. According to the prosecution, the injuries on the victims were inflicted on vital parts of the body and the force used were too excessive for self-defence, which clearly showed that Iskandar had intended to cause death and silence the victims. He lodged an appeal in 2017, which was unsuccessful, and was denied clemency in 2019. On 5 February 2025, Iskandar was hanged at 6.00 a.m. after all the appeals to court including clemency to president [Tharman Shanmugaratnam](/wiki/Tharman_Shanmugaratnam) were dismissed. - 6 September 2013: Malaysian Mogan Valo was arrested prior to crossing [Tuas Checkpoint](/wiki/Tuas_Checkpoint) for possessing 1.0179 kg of [marijuana](/wiki/Marijuana). Mogan confessed that he was asked by a man named \"India\" (actual name [Tangaraju Suppiah](/wiki/Tangaraju_Suppiah)) to deliver the drugs for trafficking. Mogan pleaded guilty to a non-capital charge of trafficking 499.99g of marijuana and was sentenced to 23 years' imprisonment and [15 strokes of the cane](/wiki/Caning_in_Singapore). Tangaraju was arrested in March 2014 while Mogan was in remand for a drug consumption offence and following with sufficient evidence on his coordination of drug trafficking and orchestrated Mogan for abetting the trafficking of marijuana, was given a death penalty on 9 October 2018. Tangaraju was executed on 26 April 2023. - 24 October 2013: Mohamad Yazid Md Yusof and [Kalwant Singh Jogindar Singh](/wiki/Kalwant_Singh_Jogindar_Singh) were both arrested by the [Central Narcotics Bureau](/wiki/Central_Narcotics_Bureau) at a carpark in Woodlands Drive upon discovery of diamorphine inside Yazid's motorcycle and Kalwant's possession. Yazid's future confession led to a third arrest of [Norasharee Gous](/wiki/Norasharee_Gous), who ordered the smuggling and trafficking, in July 2015. Yazid was a certified courier and was given life imprisonment with 15 strokes of the cane; Norasharee and Kalwant were issued death penalties and were both hanged on 7 July 2022. - [8 December 2013](/wiki/2013_Little_India_riot): Sakthivel Kumaravelu, a construction worker, was killed in a traffic accident at [Little India](/wiki/Little_India,_Singapore), which initiated a major-scale riot for the first time since (/wiki/1969_race_riots_of_Singapore). Over 20 men from Bangladesh and India were charged for their respective roles in the riot and sentenced to jail terms; three of them were also each sentenced to three [strokes of the cane](/wiki/Caning_in_Singapore). The riot led to the government passing a law, [Liquor Control (Supply and Consumption) Act 2015](/wiki/Liquor_Control_(Supply_and_Consumption)_Act_2015) to regulate the supply and consumption of liquor at public places, following investigations that many of the accused were drunk at the time. The riot further sparked national headlines and public criticism over various social issues in Singapore, including ongoing ethnic tensions, rising income inequality, Singapore's heavy reliance on foreign labour, as well as the working conditions of migrant workers. - 9 December 2013: P Mageswaran, an ex-convict who had a long criminal record of rape, theft and robbery crimes since 1991 and recently released from prison after serving a six-year jail term with caning of 24 strokes for previous serial robberies, committed another robbery to Kanne Lactmy in which he murdered an elderly in the process and stole jewerly amounting to RM26,300, which was pawned to pay off his flat's installment. Mageswaran was arrested eight days later; he was tried and convicted in May 2017, and later on 21 July, was given an 18-years' imprisonment following his criminal record and poor intelligence but could not be caned due to his age. In 2019, Mageswaran and his prosecutor made an appeal on changing his sentence but neither passed, therefore upholding his 18-year sentence. - 12 December 2013: A dismembered body, identified as Jasvinder Kaur, was discovered in [Whampoa River](/wiki/Whampoa,_Singapore). Police arrested Gursharan Singh for assisting Jasvinder's husband, Harvinder Singh, in disposing of her body and failing to make a police report, in which he was sentenced to 30 months' imprisonment in April 2015. A coroner's report had issued a verdict of murder, effectively finding Harvinder guilty of murder in the case, as the manner of disposal of the headless corpse and circumstances of the crime was well-organised and did not indicate any signs of a crime of passion. Currently, Harvinder is still on [Interpol](/wiki/Interpol)'s wanted list. - 28–29 December 2013: Chia Kee Chen, along with his accomplices, Chua Leong Aik and Djatmiko Febri Irwansyah, murdered [Dexmon Chua Yizhi](/wiki/Dexmon_Chua_Yizhi) after being caught having an affair with his wife. The body was later discovered in [Lim Chu Kang](/wiki/Lim_Chu_Kang) on 1 January 2014, at the time of which Febri fled Singapore and still a fugitive. Chua was jailed for five years in 2016, and Chia with [life imprisonment](/wiki/Life_imprisonment) in 2017, in which later upgraded to death penalty following a successful appeal from his prosecution. ## 2014 - [8 January 2014](/wiki/Sheng_Siong_kidnapping): Lee Sze Yong and his accomplice, Heng Chen Boon, kidnapped Ng Lye Poh, the mother of the three founders of supermarket chain [Sheng Siong](/wiki/Sheng_Siong). Having conducted reconnaissance before the abduction, Lee approached Ng at an overhead bridge in [Hougang](/wiki/Hougang) on the morning to deceive and luring her in the car blindfolded. Lee met Heng later and they demanded from her sons a S$20 million ransom. Police tracked down the duo before receiving the ransom and were arrested and charged with abduction two days later. Heng was sentenced to three years in jail in 2015 for abetting the kidnapping and was released in January 2016 on remission. On 1 December 2016, Lee, who had asked for the death penalty, was sentenced by [High Court](/wiki/High_Court_of_Singapore) judge [Chan Seng Onn](/wiki/Chan_Seng_Onn) to [life imprisonment](/wiki/Life_imprisonment) and three [strokes of the cane](/wiki/Caning_in_Singapore). - 14 January 2014: Chan Lie Sian assaulted [William Tiah Hung Wai](/wiki/William_Tiah_Hung_Wai) through bludgeoning with a metal dumbbell rod several times and eventually died in hospital seven days after the assault. Chan, who earlier surrendered himself and faced an initial charge of causing grievous hurt, had his charge amended to murder. Originally given a death penalty in 2017, the charge was reduced to life imprisonment following the appeal that Chan did not intend to cause death to Tiah. - [March 2014](/wiki/Chin_Swee_Road_child_death): A two-year-old girl (identified as Umaisyah) was allegedly killed by her biological parents, who burned her corpse and sealed her remains inside a metal cooking pot from their kitchen. The body was accidentally discovered 5.5 years later in September 2019 by her mother's intellectually disabled younger brother, who was searching for food to eat at the time of the grisly discovery. The couple, who were already in prison serving sentences or pending trial for unrelated offences, were arrested and charged with murder. In March 2021, Umaisyah's mother was granted a discharge not amounting to an acquittal for murdering her daughter, but the father still faced the murder charge. The couple were also charged with having abused Umaisyah and their other surviving children, perverting the course of justice, as well as giving false information to the social welfare agencies in relation to the girl's whereabouts. Umaisyah's father was later convicted of culpable homicide not amounting to murder and three other lesser charges, and sentenced to a total of 21 years and six months in jail, in addition to 18 strokes of the cane. Umaisyah's mother pleaded guilty to four charges of child abuse and obstruction of justice and was sentenced to 14 years in prison on 7 February 2024. The identities of Umaisyah's parents and Umaisyah's surname were not made public to avoid the identification of the girl's surviving siblings. - 19 March 2014: Philanthropist [Nancy Gan Wan Geok](/wiki/Nancy_Gan_Wan_Geok) was killed by her Indonesian maid Dewi Sukowati and her body was drowned inside her bungalow's swimming pool in Victoria Park, [Bukit Timah](/wiki/Bukit_Timah). Dewi was assessed to be suffering from diminished responsibility and was sentenced to 18 years in prison with a possibility of parole after completing at least two-thirds of her sentence (equivalent to 12 years). - 28 May 2014: [Azuar Ahamad](/wiki/Azuar_Ahamad) committed several sexual offences against 22 women in 2008 and 2009 after getting to know them online, and after his arrest, he was tried and pleaded guilty in 2012, including a more recent case on spiking his victims' drinks with sleeping pills before raping, in which he was sentenced to a total of 37.5 years' imprisonment and 24 strokes of the cane. - [11 June 2014](/wiki/Murder_of_Muhammad_Noor): Two Pakistani nationals murdered their flatmate, Muhammad Noor through suffocation and strangling, then dismembered his body and stored it in two suitcases. One of the suitcases was discovered in Syed Alwi Road and the two men were arrested. They were eventually sentenced to death on 17 February 2017 and were hung in early 2018. - [August 2014](/wiki/Death_of_Mohammad_Airyl_Amirul_Haziq_Mohamed_Ariff): Mohammad Airyl Ariff succumbed from a fractured skull four days upon hospitalization. His mother, Noraidah Mohd Yussof, who was divorced, had abused the child for two years prior to his death; he had recently got beaten for not able to recite the numbers 11 to 18 in [Malay](/wiki/Malay_language). Noraidah pleaded guilty of voluntarily causing grievous hurt and child abuse, and she was sentenced to eight years' imprisonment by the High Court, which rejected Noraidah's defence of diminished responsibility by [Asperger's Syndrome](/wiki/Asperger_syndrome). However, a revision of her prosecution's appeal found her eight-year sentence manifestly inadequate due to the aggravating circumstances of the case (including the boy's young age and Noraidah's cruelty at the time of the crime), which later increased her term to 14.5 years. The case of Airyl's death also prompted the Court of Appeal to call for lawmakers to allow judges to mete out enhanced sentences for certain crimes against vulnerable victims by increasing the maximum penalty prescribed to up to half. - [21 August 2014](/wiki/2014_Tampines_flat_stabbing): Ong Guat Leng was stabbed to death by her father-in-law Char Chin Fah following an argument between the two (who was married to Char's eldest son) and alleged disrespect. Char had a personality disorder, which the court downgraded his murder change to culpable homicide (or manslaughter) and was jailed for eight years. After his release from prison on an unknown date, Char, who returned to live with his daughter, died at the age of 90 on 25 February 2024. - 3 September 2014: [Pannir Selvam Pranthaman](/wiki/Pannir_Selvam_Pranthaman) was arrested for importing 51.84g of heroin into Singapore. As he was not certified to be a courer, he was instead found guilty of drug trafficking and sentenced to death. Several appeals and clemency petitions were made but were unsuccessful. On 24 May 2019, his planned execution was delayed following a last-minute appeal to challenge the outcome and its prosecution's decision, but it was rejected by the High Court in February 2020, and the legal challenge against the 2019 appeal's rejection is also dismissed by the Court of Appeal on 26 November 2021. On 8 October 2025, Pannir was executed after his appeal to court & stay of execution were dismissed. - September 2014: Police arrested tour guide Yang Yin, when his niece and guardian of retired physiotherapist Chung Khin Chun, Hedy Mok, misappropriated her funds amounting to $500,000 in February 2010 and $600,000 in January 2012 from Chung, whom he claimed wanted him to be her grandson, since she was childless and her husband and doctor Chou Sip King died in 2007, a year prior to her first meeting. Yang, who was married with two children back in China, also obtained permanent residency in 2011 and lasting power of attorney in 2012 through his manipulation and cheating of Chung and even made her set a will that Yang was to inherit her assets (estimated at $40 million) in 2010. The turn of events made Chung's relatives and niece suspected Yang had malicious intent and finally, he was arrested, and his crimes came to light in September 2014. Yang, who was held in remand since 31 October 2014, was brought to trial in September 2016, and he pleaded guilty to all the charges he faced for cheating Chung. He was sentenced to an eight-year and two-month imprisonment, a combination of his six years' jail for the misappropriation of Chung's money, and another 26 months for falsifying his immigration status. On 3 March 2017, the prosecution's appeal allowed High Court to increase Yang's sentence by another three years; however, he was released early by parole in April 2022 after serving two-thirds of his jail term, and was deported to China two months later; he was also [banned from re-entry](/wiki/Persona_non_grata). - [20 November 2014](/wiki/Murder_of_Tran_Cam_Ny): Jackson Lim Hou Peng killed Tran Cam Ny and was arrested at his flat, where he was suffering from [diminished responsibility](/wiki/Diminished_responsibility) at the time of incident due to the effects of drugs, and that he had no intention to kill when he covered Tran's mouth to stop her from screaming. Lim had an offence record for consuming [methamphetamine](/wiki/Methamphetamine). He was jailed for nine years and six months' imprisonment and three strokes of the cane. - 11 December 2014: [Gobi Avedian](/wiki/Gobi_Avedian) was arrested for trafficking over 40.22g of heroin. In his trial, Gobi's friend, Vinod, offered him to deliver the drugs, unaware that it was heroin. He described it as mild \"disco drugs\" mixed with chocolate, in order to get paid and use the money to pay for his daughter's medical fees. In May 2017, the High Court sentenced Gobi to 15 years' imprisonment and ten strokes of the cane for a lower charge of attempted importation of a Class C drug. The sentence was upgraded to a death penalty on an October 2018 appeal, but following two unsuccessful re-appeals, Gobi clarified the \"willful blindness\" and \"presumption of knowledge\" principles in Singapore's drug laws. In October 2020, the death penalty was overturned by the Court of Appeals, reversing back to his original 15-year imprisonment. ## 2015 - 20 March 2015: [Yap Weng Wah](/wiki/Yap_Weng_Wah) was convicted of 76 sexual offences committed against 31 pubescent boys (including 14 more in Malaysia) aged between 11 and 15 whom he met through online social networking, occurring between November 2009 and June 2012. He was arrested three months later after the sister of one of his victims lodged a police report. His apartment was also raided and over 2,000 videos of his indecent acts was found on his laptop. The charges against Yap involved him performing [oral sex](/wiki/Oral_sex) on or [sodomising](/wiki/Sodomy) 30 of his victims. The [Institute of Mental Health](/wiki/Institute_of_Mental_Health_(Singapore)) released a diagnosis report that Yap was suffering from [hebephilia](/wiki/Hebephilia), a type of sexual preference for early adolescent children between 11 and 14 years of age. Yap pleaded guilty to 12 counts of sexual penetration with a minor and have 64 other charges taken into consideration during sentencing and was jailed for 30 years and 24 strokes of the cane. - 13 April 2015: A couple abused their intellectually disabled flatmate [Annie Ee Yu Lian](/wiki/Annie_Ee_Yu_Lian), for over eight months from August 2014 until her death on that date. Ee moved in to live with the couple, Tan Hui Zhen and Pua Hak Chuan, in 2013; throughout the eight months, Ee suffered in silence while the couple had beaten her frequently and the beatings had increased in intensity over time, with some sessions lasting up to two hours; this caused Ee to have difficulty in movement and [urinary incontinence](/wiki/Urinary_incontinence). Autopsy report revealed that Ee suffered 12 fractured ribs, seven fractured vertebrae, a ruptured stomach and a body full of blisters and bruises; the beatings also resulted in [acute fat embolism](/wiki/Fat_embolism_syndrome), the cause of her death. The couple was convicted on 1 December 2017 with 16.5 and 14 years (and 14 strokes of the cane) in jail respectively. - [1 June 2015](/wiki/Shooting_of_Mohamed_Taufik_Zahar): Mohamed Taufik Zahar took an incorrect turn and ended up at a high security checkpoint near the [Shangri-La Hotel](/wiki/Shangri-La_Hotel_Singapore) where the [Shangri-La Dialogue](/wiki/Shangri-La_Dialogue) was held. When the police ordered Taufik to open the car boot for checks, he sped up and crashed the car through concrete barriers despite repeated warnings to stop. The police then opened fire and fatally shot Taufik through the windscreen. - [20 June 2015](/wiki/Khoo_Teck_Puat_Hospital_shooting): Muhammad Iskandar Sa'at was arrested on 19 June 2015 for the theft of a motor vehicle and escorted by the police to [Khoo Teck Puat Hospital](/wiki/Khoo_Teck_Puat_Hospital) the next day for a medical examination after he claimed that he had chest pain. After his grip restraints were loosened on his left arm and right wrist for blood drawing and minimising discomfort respectively, Iskandar attacked police staff sergeant Muhammad Sadli Razali by grabbing his baton and hit it multiple times, as well as his [Taurus Model 85](/wiki/Taurus_Model_85) revolver. Sadli and two paramedics managed to stop Iskandar. Two days later, he was charged with unlawful discharge of a firearm under the [Arms Offences Act](/wiki/Arms_Offences_Act) but was later reduced to unlawful possession of a firearm for causing hurt to a public servant, to which Iskandar pleaded guilty on 19 March 2018 and sentenced to life imprisonment with a possibility of parole and 18 strokes of the cane. - 26 August 2015: Zackeer Abbass Khan, the owner of a [murtabak](/wiki/Murtabak) restaurant 'Zam Zam' at [North Bridge Road](/wiki/North_Bridge_Road), allegedly paid S$2,000 to Anwer Ambiya Kadir Maideen, his friend who was also a headman of the Sio Ang Koon gang, to hire a hitman, Joshua Navindran Surainthiran, to attack Liakath Ali Mohamed Ibrahim, the supervisor of the neighbouring Victory Restaurant. Three of the aforementioned accused were each jailed and caned for causing grievous hurt, among other charges. - 31 August 2015: Syed Maffi Hasan had an argument with his friend [Atika Dolkifli](/wiki/Atika_Dolkifli) over the repair costs of an [iPhone 5](/wiki/IPhone_5) that went faulty after Atika purchased it for Syed to use. Syed pushed Atika from a flight of stairs and later threw her from building (along with her belongings) to death. Syed was charged with murder in May 2019, and he was sentenced to life imprisonment with a possibility on parole, and 12 strokes of the cane on 4 July 2019. - 6 October 2015: Five people were arrested in [Jurong West](/wiki/Jurong_West) for trafficking 32.54g of diamorphine. Two of them, Suhaizam Khariri and Azidah Zainal, pleaded guilty to non-capital drug charges and each sentenced to 25 years' imprisonment, while the other three, [Roszaidi Osman](/wiki/Roszaidi_Osman) (Azidah's husband), Aishammudin Jamaludin and Mohammad Azli Mohammad Salleh, pleaded guilty for drug trafficking. Following an appeal in 2020, Azli was acquitted of all charges, while Aishammudin and Roszaidi's sentences were changed to life imprisonment by 2022. - [23 November 2015](/wiki/Death_of_Mohamad_Daniel_Mohamad_Nasser): Mohamad Daniel Nasser was found dead in his home, after allegedly being severely abused by his mother Zaidah and her boyfriend Zaini Jamari. Daniel's father Mohamad Nasser Abdul Gani was serving his jail term at the time of his death. On 24 June 2016, they were convicted and were given jail sentences and strokes of the cane. [Netizens](/wiki/Netizen), Daniel's relatives and his paternal relatives criticized their sentence citing that it was too light. District judge [Bala Reddy](/wiki/Bala_Reddy) clarified that the sentence was for their ruthless and callous conduct, and for their lack of remorse. then-[Minister of Social and Family Development](/wiki/Ministry_of_Social_and_Family_Development) (MSF) [Tan Chuan-jin](/wiki/Tan_Chuan-Jin) prompted using the case for all Singaporeans to be more mindful of possible signs of child abuse from their neighbours. - [December 2015 – 11 August 2017](/wiki/Ayeesha_child_abuse_case): A three-year-old girl, only known as Ayeesha, and her younger brother were both relentlessly starved and abused by their biological father and his second wife, and the two siblings were also confined naked in the toilet of Ayeesha's father's flat. The abuse went on for two years before Ayeesha, who was mortally wounded from one of the physical assaults inflicted by her father, died on the time between the night of 10 August 2017 or the morning of 11 August 2017. Her father was subsequently arrested for the murder and abuse. Ayeesha's father, who stood trial in July 2023, pleaded guilty to child abuse and manslaughter in April 2024, sentenced to a 34.5 years' imprisonment and 12 strokes of the cane. ## 2016 - [14 February 2016](/wiki/Choa_Chu_Kang_Combined_Temple_murder): A helper in Choa Chu Kang Combined Temple, Tan Poh Huat, was hammered to death by a burglar, Loh Suan Lit, and was fatally injured due to a crushed voice box. Loh was arrested 10 days later and was jailed for 14 years and six strokes of the cane. - 19 February 2016: Muhammad Khairulanwar Bin Rohmat committed sexual exploitation and lured two underage girls into prostitution, along with sexual penetration of a minor under 16 years of age with consent, in which he was jailed 6.25 years' imprisonment and fined $30,000. This is the first case where a convict was indicted under the [Prevention of Human Trafficking Act 2015](/wiki/Prevention_of_Human_Trafficking_Act_2015). - [13 March 2016](/wiki/Murder_of_Wong_Chik_Yeok): Kong Peng Yee revealed to have suffered from a brief psychotic episode as a result of severe psychotic delusions, which caused Kong to erratically believe that his wife and daughters wanted to harm him and decided to make a pre-emptive strike by killing his wife Wong Chik Yeok. He was charged with culpable homicide and was jailed for six years. - [21 March 2016](/wiki/Circuit_Road_flat_murder): Boh Soon Ho strangled Zhang Huaxiang to death and also had sex with the corpse to alleviate his fit of rage. He shortly fled to Malaysia but was later arrested on 7 April 2016 by the [Royal Malaysia Police](/wiki/Royal_Malaysia_Police). He was charged with murder and sentenced to [life imprisonment](/wiki/Life_imprisonment) on 8 February 2020, with a possibility of parole after 20 years. - April 2016: Lim Hong Liang engaged his nephew Ron Lim and a middleman Ong Hong Chye to hire several men to attack a couple, Joshua Koh and Audrey Chen. All the attackers were subsequently arrested and convicted and were given jail terms and caning. A re-trial in 2019 discharged Lim of his charges amounting to an acquittal on the conditions that he must not reoffend for the next 36 months as compensation. - 7 June 2016: [Daryati](/wiki/Daryati) killed her employer Seow Kim Choo and injured her husband Ong Thiam Soon while restraining her. At her trial, Daryati claimed that she had confronted Seow to get back her passport, which Seow kept in a safe, and wanted to steal money from a locked drawer so that she could return to Indonesia. In March 2020, the prosecution initially charged Daryati to the lesser charge of murder but retracted her plea in September 2020 and attempted to escape the murder charge with a defence of [diminished responsibility](/wiki/Diminished_responsibility). The High Court revised her verdict to life sentence with a possibility of parole. - 17 June 2016: [Saridewi binte Djamani](/wiki/Saridewi_binte_Djamani) and her accomplice [Muhammad Haikal bin Abdullah](/wiki/Muhammad_Haikal_bin_Abdullah) were both arrested for diamorphine trafficking. Djamani was sentenced to death and Haikal with life imprisonment with 15 strokes of the cane. Djamani was hanged on 28 July 2023 after her five-year incarceration on death row, making her the first female inmate to be hung in 19 years, the last being [Yen May Woen](/wiki/Yen_May_Woen) in 2004. - [7 July 2016](/wiki/2016_Standard_Chartered_bank_robbery): David James Roach robbed a [Standard Chartered Singapore](/wiki/Standard_Chartered_Singapore) bank in [Holland Village](/wiki/Holland_Village,_Singapore), presenting a note to the bank teller about having a weapon before making off with $30,000; he immediately fled to [Bangkok](/wiki/Bangkok), where was subsequently charged with violating Thai exchange control laws and [money laundering](/wiki/Money_laundering), and sentenced to 14 months in jail. Singapore was unsuccessful at requesting Roach's extradition from Thailand since both countries have no such treaty. Upon his release on 11 January 2018, Roach was deported to Canada via the United Kingdom. Singapore requested Roach's extradition from the United Kingdom on the same day, which led to Roach being detained while in transit at [London](/wiki/London). To secure the extradition, Singapore assured the United Kingdom that Roach would not be sentenced to caning, a mandatory punishment for robbery under the [Singapore Penal Code](/wiki/Penal_Code_(Singapore)), if he is found guilty. Roach was extradited on 16 March 2020 from the United Kingdom to Singapore and subsequently charged with robbery and unlawfully removing the money out of Singapore. He was given a five-year imprisonment and six strokes of the cane; however, arrangements made by the [Attorney-General of Singapore](/wiki/Attorney-General_of_Singapore) allowed to secure his extradition, and his caning was remitted followed a successful clemency by president [Halimah Yacob](/wiki/Halimah_Yacob). - 9 July 2016: [Toh Sia Guan](/wiki/Toh_Sia_Guan) and Goh Eng Thiam were engaged in an argument which spurred Toh into going to a hardware store to procure a knife to fight Goh, therefore inflicting several knife wounds onto Goh and killing him. He was found guilty of murder and sentenced him to [life imprisonment](/wiki/Life_imprisonment) with a possibility of parole. - 12 July 2016: [Leslie Khoo Kwee Hock](/wiki/Leslie_Khoo) strangled his girlfriend Cui Yajie, in his car on a quiet road near [Gardens by the Bay](/wiki/Gardens_by_the_Bay). Her body was burned in an undisclosed location in [Lim Chu Kang](/wiki/Lim_Chu_Kang) leaving only a few pieces of charred fabric and a brassiere hook. The police arrested Khoo after knowing he was the last person to interact with Cui and he revealed the location where he burnt her body. On 19 August 2019, Khoo pleaded guilty of murder and was sentenced to [life imprisonment](/wiki/Life_imprisonment) with a possibility of parole. - 26 July 2016: [Piang Ngaih Don](/wiki/Piang_Ngaih_Don) was abused to death by her employer Gaiyathiri Murugayan and her mother Prema Naraynasamy. Piang was physically assaulted for nine months including being starving her to death. The day before her death, both Gaiyathiri and Prema beat her up and tied her hand to a window grille and abandoned her. Piang died of [hypoxic ischaemic encephalopathy](/wiki/Cerebral_hypoxia) according to autopsy reports. Both Gaiyathiri and Prema and her husband Kevin Chelvan, were arrested and charged in court for their respective roles in causing Piang's death. Several trials are underway along with appeals and ultimately, Prema was granted a discharge not amounting to an acquittal for murder, but was sentenced to 14 years' imprisonment on 9 January 2023 for 48 charges of maid abuse and causing hurt, before the sentence of Prema was increased to 17 years in June 2023 after she was found guilty of the 49th and final charge of causing evidence of a homicidal case to disappear; Gaiyathiri was sentenced to 30 years' imprisonment by the High Court. Currently Chelvam's case is still pending in court. - 11 August 2016: [Mohamed Shalleh Abdul Latiff](/wiki/Mohamed_Shalleh_Abdul_Latiff), a Singaporean delivery driver, was arrested for trafficking 54.04g of diamorphine. His defence was that he believed he was delivering contraband cigarettes for a friend to whom he owed money, and he did not verify the contents of the bag as he trusted his friend, the trial court ruled that his relationship with the friend was not close enough for him to have so much trust to the friend. Mohamed Shalleh was found guilty and sentenced to death in January 2019; he was hung on 3 August 2023. - October 2016: Between 15 and 22 October 2016, an unemployed couple [Ridzuan bin Mega Abdul Rahman and Azlin binte Arujunah](/wiki/Azlin_Arujunah_and_Ridzuan_Mega_Abdul_Rahman), abused their unnamed five-year-old son repeatedly; on 23 October, they also repeatedly scalded their son covering three-quarters of his body, which resulted in his death. The couple had also committed other acts of abuse against their son. The couple were convicted to 27 years' imprisonment each; Ridzuan was given 24 strokes of the cane and Azlin with an additional year of imprisonment to accommodate caning as it is not allowed for women. An appeal in 2022 changed both sentences to life imprisonment. - 19 – 24 October 2016: [Poh Yuan Nie](/wiki/Poh_Yuan_Nie), former principal of a private tuition centre, orchestrated a plan to help six students from China to cheat in their O-level examinations. Poh, together with three tutors (her niece Fiona Poh Min, her ex-girlfriend Tan Jia Yan and Chinese national Feng Riwen), made use of Bluetooth devices and video-calling application [FaceTime](/wiki/FaceTime) to capture images of the exam papers and work out answers to share with the six students. The plan was foiled on 24 October when one of the students discovered about the cheat. In April 2018, Tan was pleaded guilty to 27 cheating charges and was sentenced to three years of imprisonment. In 2020, Poh, her niece Fiona and Feng were respectively jailed for four years, three years and 28 months' imprisonment respectively. Poh and her niece remained out on bail while appealing against their conviction, but both the High Court and Court of Appeal dismissed their appeal in October 2021 and November 2022 respectively. However, while Fiona was jailed after the end of her appeal hearing, Poh was uncontactable since September 2022, and she failed to show up in court to serve her sentence during that month. An arrest warrant was issued in November 2022, but Poh was suspected to have fled the country, and she could not be located. In January 2023, an [Interpol](/wiki/Interpol) [red notice](/wiki/Interpol_notice) was issued for Poh's arrest, and currently is still on lookout. - 25 November 2016: [Ahmad Muin bin Yaacob](/wiki/Ahmad_Muin_bin_Yaacob) robbed Maimunah Awang of her jewellery at [Tanah Merah Ferry Terminal](/wiki/Tanah_Merah_Ferry_Terminal) and killed her by stabbing her with a pair of grass cutters and bludgeoning her on the head until she became motionless. He then abandoned her body in a drain and fled back to Malaysia, which was later discovered the following day. Under a collaboration with the [Royal Malaysia Police](/wiki/Royal_Malaysia_Police), Ahmad was arrested and extradited back to Singapore on 18 December 2016. On 4 November 2020, Ahmad was sentenced to [life imprisonment](/wiki/Life_imprisonment_in_Singapore) with a possibility of parole, and 18 strokes of the cane. ## 2017 - [20 January 2017](/wiki/Woodlands_double_murders): Teo Ghim Heng strangled and burnt his wife Choong Pei Shan, who was then pregnant, and their daughter Teo Zi Ning following an argument. The bodies were discovered eight days later. On 20 November 2020, Teo was then charged with the murders of only his wife and daughter, while the third charge for the murder of his unborn child was dropped, in which he was sentenced to death. On 16 April 2025, Teo was executed by hanging in [Changi Prison](/wiki/Changi_Prison) after his appeals & clemency to President Tharman were dismissed. - 13 February 2017: [MMA](/wiki/Mixed_martial_arts) trainer Joshua Robinson pleaded guilty to four counts of making obscene films and three counts of having consensual sex with minors, in which he had unprotected sex with two 15-year-old girls on separate occasions in 2013 and 2015 in his apartment at [Upper Circular Road](/wiki/Clarke_Quay) and had filmed the encounters with his mobile phone. On 25 June 2015, after the parents of the second victim lodged a police report, the police seized Robinson's computer and portable hard drive, containing 5,902 obscene films, of which 321 contained [child pornography](/wiki/Child_pornography). On 28 July 2015, while out on bail, Robinson visited a martial arts gym and showed an obscene video to a six-year-old girl while her father was training, leading to the father calling the police. He was sentenced to a four-year imprisonment on 2 March. Public criticized Robinson's sentence, leading online to question about his nationality and why the sentence was \"light\". Six days later, the Attorney-General's Chambers stated that the public prosecutor would not be appealing against Robinson's sentence and explained that the sentence was broadly in line with relevant sentencing precedents, with caning not part of the punishment. Law minister [K. Shanmugam](/wiki/K._Shanmugam) prompted the government a consideration on child exploitation and meting out severe punishments. - [12 March 2017](/wiki/St_James_Power_Station_murder): Satheesh Kumar Manogaran and his cousin Naveen Lal Pillar were attacked by a group of three men near [St James Power Station](/wiki/St_James_Power_Station), with the former pronounced dead in hospital. A total of five men were arrested and were respectively charged with different offences in 2018 and 2019, among which was Shawalludin bin Sa'adon, who led the fight, and had a conflict between him and Satheesh prior to the incident, in which he was charged for voluntarily causing grievous hurt. Currently, Muhammad Khalid bin Kamarudin, who was jailed for 8.5 years and eight strokes of the cane, is pending trial for murder. - [21 June 2017](/wiki/Bedok_double_murder): Khasanah, an Indonesian maid, murdered her employer Chia Ngim Fong and his wife Chin Sek Fah in their flat, and shortly fled to Indonesia only to be caught upon entry. However, Khasanah was not extradited back to Singapore for trial under a local law that decree Indonesians who committed crimes overseas but caught in their home country should be tried in their home country instead. With assistance from the [Indonesian National Police](/wiki/Indonesian_National_Police), Khasanah was tried in Indonesia for the couple's murders and the local courts found her guilty of the murders. She was sentenced to life imprisonment to be served in a prison in Indonesia but the sentence was later reduced to 20 years' following her appeal. - [10 July 2017](/wiki/Murder_of_Spencer_Tuppani): Tan Nam Seng stabbed his son-in-law Spencer Tuppani, in broad daylight at [Telok Ayer Street](/wiki/Telok_Ayer_Street). Tuppani escaped from the attack but later collapsed outside an eatery on [Boon Tat Street](/wiki/Boon_Tat_Street). Tan also prevented others from rendering help to Tuppani, leading to the latter's death in hospital thereafter. Tan was remanded for three weeks for psychiatric evaluation and revealed to have suffered from [major depressive disorder](/wiki/Major_depressive_disorder); on 21 September 2020, Tan was given an 8.5 years' imprisonment for [culpable homicide](/wiki/Culpable_homicide) not amounting to murder. In mid 2023, Tan Nam Seng was released from prison and died on 10 August 2025 at the age of 77 of cardiac arrest. - 16 August 2017: Mohammad Rosli Abdul Rahim fatally stabbed his flatmate [Mohammad Roslan Zaini](/wiki/Mohammad_Roslan_Zaini) with a knife following an argument on monthly rent and alleged insults. Rosli was arrested and charged for murder; he tried to argue that he was gravely provoked into killing Roslan out of a loss of self-control due to anger. A trial in 2021 later convicted Rosli of murder and was given a life imprisonment sentence on 13 January 2022. Rosli's appeal against his conviction and sentence was dismissed by the [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore) on 30 June 2022. - 2 September 2017: Romanian National Iosif Kiss and Frenchman David Weidmann cheated shipping firm Oceanic Group of $1.5 million. Weismann gave part of the money to a Dutchman named Nikolic Predrag and a French woman Nikolic Dalida. Kiss and Weidmann were arrested at Woodlands Checkpoint on the night of the crime. On 25 June 2018, Nikolic Predrag and Nikolic Dalida were sentenced to 2.5 years imprisonment, while on 20 August 2018, Iosif Kiss and David Weidmann were sentenced to 3 years and 8 months imprisonment. ## 2018 - 26 January 2018: Munusamy Ramarmurth, a Malaysian cleaning supervisor working in Singapore for 14 years, was arrested after being found importing 57.54g of heroin through a motorcycle search. The High Court could not determine about his courier status and quashed a claim that Munusamy thought he was carrying stolen phones since at first, he admitted to the presence of drugs to the police. Ultimately, he was sentenced to death on 15 November 2021. - 25 June 2018: Myanmar citizen and domestic maid [Zin Mar Nwe](/wiki/Zin_Mar_Nwe) murdered her employer Mehrotra Shashi, who travelled from India to Singapore to visit her son-in-law who was Zin's employer. A trial lasting for 1.5 years in 2021 found Zin guilty of murder and was sentenced to life imprisonment on 4 July 2023. The police withheld the family's identities as one of the witness' was under 18, and Zin's age was actually 17 according to her passport documents; Zin could not be given the death penalty also due to the age per the law requirements. However, upon her appeal in May 2025, the Court of Appeal reduced Zin's murder conviction to manslaughter due to her defence of sudden and grave provocation, and she was re-sentenced to 17 years' jail by the Court of Appeal. - 19 July 2018: retiree [Seet Cher Hng](/wiki/Seet_Cher_Hng) murdered his ex-wife Michelle Low Hwee Geok, who was also an ITE examinations director, in a carpark near [ITE College Central](/wiki/ITE_College_Central). They had divorced in 2011 after an 18-year marriage in which they had a daughter. Seet reported about Low's alleged infidelity and supposedly unfair division of their matrimonial assets, including a refusal of his request for a $500,000 share. On 14 September 2021, Seet pleaded guilty for murder and on 22 September, was given life imprisonment with a possibility of parole. - 25 July 2018: Arjun Retnavelu, who revealed his previous disputes to Dhines Selvarajah, led a team of five men to attack Dhines through the use of weapons and was arrested 22 hours later. One of the men was a youth offender, Sharvin Raj Suraj, in which he was sentenced to a year of reformative training. Arjun was sentenced to nine years of corrective training, while the other three were given jail terms; all four non-youths were also caned.[*citation needed*] - 28 July 2018: Sheikh Md Razan, a [Bangladeshi](/wiki/Bangladeshi) having disguised himself as a [Sikh](/wiki/Sikh) by putting on a turban, attempted robbery in a [pawnshop](/wiki/Pawnbroker) in [Boon Lay](/wiki/Boon_Lay). The robbery was unsuccessful and even declared a [bomb threat](/wiki/Bomb_threat) by abandoning a device claiming it was a \"bomb belt\", which was later revealed to be fake. After a 5-day-long manhunt, Sheikh, who had shaved off his beard and gone into hiding, was arrested and convicted for attempted armed robbery. Along with overstaying since December 2017 and using a forged work permit to obtain employment in Singapore, the combined offences were announced on 30 September 2019, sentencing Sheikh to a 3.5-year imprisonment and 18 strokes of the cane. - 1 September 2018: [Muhammad Salihin Ismail](/wiki/Muhammad_Salihin_Ismail), allegedly kicked his stepdaughter Nursabrina \"Sabrina\" Agustiani's abdomen twice with the latter leading to her death. Ismail, who married Sabrina's mother in 2016 and had two sons, stated in his trial that he and his wife tried to teach Sabrina to use the toilet properly in preparation for school, and out of anger over Sabrina still urinating the floor at her age, Salihin kicked her abdomen intentionally, but had no intention of her murder. Over a year after the trial began in February 2021, he was defended by [Eugene Thuraisingam](/wiki/Eugene_Thuraisingam) and asked for a charge of voluntarily causing grievous hurt. On 9 May 2022, he was sentenced to nine years' imprisonment and 12 strokes of the cane. However, an appeal from the prosecution upgraded his charge to murder and his penalty upgraded to life imprisonment with parole. - September 2018 – 28 June 2019: Lin Rongxin committed 64 rape and sexual assault charges involving at least twenty females, through the use of social media platforms such as [WeChat](/wiki/WeChat) by impersonating different person to lure the victims and extorting them while pretending to be a savior from certain harassment. Of those victims, 15 of which were aged between 14 and 19, three of which had even become his girlfriend at one point unaware that they were raped. Lin spent three years awaiting trial before he pleaded guilty to seven out of 64 charges on 28 November 2022, in which was given a 31 years' imprisonment and 24 strokes of the cane. - 19 November 2018: Desiree Tan Jiaping was strangled to death by his elderly father Tan Tian Chye, and at the time she was suffering from anxiety disorder and depression, the court reduced his charge to culpable homicide. It was also revealed that his daughter had been demanding the parents' attention and abused them despite Tan and his wife giving their care for her. He was sentenced to 33-months imprisonment in 2020; however, as because the sentence was backdated at the time, he was granted parole during his 22-month remand period behind bars and was released on one-third remission upon the date of sentence. - 30 December 2018: [Ahmed Salim](/wiki/Ahmed_Salim_(murderer)) fatally strangled his girlfriend Nurhidayati Wartono Surata at the Golden Dragon Hotel. Her body was discovered by a hotel receptionist later that night and Ahmad was arrested the following day. In his trial in September 2020, he initially defended himself by saying that he was provoked into killing Nurhidayati but the High Court found about his intentions of murder when she was unfaithful to him by seeing other men. On 14 December 2020, Ahmed was sentenced to death and was hung on 28 February 2024 following an unsuccessful appeal on 19 January 2022 and an unsuccessful clemency plea from President [Tharman Shanmugaratnam](/wiki/Tharman_Shanmugaratnam); it was also the first execution for a murder case in five years. ## 2019 - 12 March 2019: Yee Jing Man attacked his three employers while being in the view of former colleagues at his former workplace at [Sungei Kadut](/wiki/Sungei_Kadut), seeking revenge after being fired from his job for the second time for poor work performance. One of the employers later died and one escaped unscathed. Yee, at the time was also suffering from depression, attempted suicide unsuccessfully (by lacerating his liver) and the police arrested him later. On 9 June 2021, he was convicted of lesser offences of culpable homicide and voluntarily causing grievous hurt and was sentenced to a total of 20 years' imprisonment without caning. - 29 May 2019: Lawyer Jeffrey Ong Su Aun was arrested in [Kuala Lumpur](/wiki/Kuala_Lumpur) with a stolen Malaysian passport and extradited to Singapore after allegedly misappropriating a large sum of money. He has been held in remand since June 2019 and faced 76 charges including cheating, forgery and criminal breach of trust as an attorney in a case involving over S$75 million. The case first came to light after [precision engineering](/wiki/Precision_engineering) firm Allied Technologies, one of Ong's clients, filed a police report in May 2019 over S$33.4 million having gone missing from its [escrow](/wiki/Escrow) account. On 17 July 2023, Ong, who was disbarred in 2022, was found guilty and sentenced to 19 years in prison. - [2 July 2019](/wiki/2019_Orchard_Towers_murder): A fight broke at [Orchard Towers](/wiki/Orchard_Towers) involving seven people killing one of their friends, Satheesh Noel Gobidass that night, by Tan Sen Yang through a [karambit](/wiki/Karambit); they were arrested and initially charged with murder by common intention on 4 July 2019. However, six of them eventually had their charges reduced to voluntarily causing hurt, consorting with a person possessing an offensive weapon, obstructing justice by discarding evidence, rioting, being a member of an unlawful assembly to assault a person, or any combination of these charges with each of the sentences determined between 2020 and 2023. The sentencing for one of the accused, Chan Jia Xing, who was given conditional warning instead of jail sentence, drew allegations on social media that Chan and others had received preferential treatment in sentencing because of their race, but these claims were dismissed on 16 October 2020 and directed the police to investigate those responsible for the allegations that are potentially in [contempt of court](/wiki/Contempt_of_court). Another accused, Tan Hong Sheng, had prior convictions of rioting and at the time of the incident was on bail. On 3 October 2023, Tan Sen Yang officially stood trial for one count of murder at the High Court, and was given a life imprisonment with possibility of parole. Tan was found guilty of the murder charge and was sentenced to life imprisonment with 12 strokes of the cane on 25 April 2024, more than 4 years after the murder took place in July 2019. - [1 September 2019](/wiki/2019_Toa_Payoh_chopper_attack): Pak Kian Huat killed his longtime partner Lim Soy Moi with a chopper after she refused to let him move to a bigger bedroom in their [Toa Payoh](/wiki/Toa_Payoh) flat. Pak's charge was reduced to culpable homicide not amounting to murder; in an ensuing trial on 22 May 2023 (originally September 2022 when Pak disputed some of the facts and demanded for a death sentence), the court convicted Pak of culpable homicide charge and was sentenced to 15 years' imprisonment. - October 2019: The last of four men were arrested in a series of islandwide raids, and were either jailed, fined, put on probation or both, for suspected involvement of operating a [Telegram](/wiki/Telegram_(software)) chat group, \"SG Nasi Lemak\", a platform meant for sharing obscene photos and videos of women in Singapore, with about 44,000 members being active in the group and paid a sum of money for membership. - [27 October 2019](/wiki/Commonwealth_double_murders): Gabriel Lien Goh was alleged to have murdered both his mother, Lee Soh Mui, and his grandmother See Keng Keng at their residential HDB block in [Commonwealth](/wiki/Commonwealth,_Singapore). Goh was also found to be consuming [LSD](/wiki/LSD) prior to his homicidal crime spree and he was first convicted and sentenced to 22 months' imprisonment on 11 November 2021 for both possession and consumption of drugs. In a trial on 18 November 2019, the court charged him with murder in relation to the death of his grandmother. As Goh was being of unsound mind as induced by drugs at the time of murder, and unaware on how he killed them following psychiatric reports, he was acquitted of lower charges of culpable homicide and he was sentenced to indefinite detention under [the President's Pleasure](/wiki/The_President%27s_Pleasure_(Singapore)) on 23 September 2022. - 8 November 2019: A male infant [Izz Fayyaz Zayani Ahmad](/wiki/Izz_Fayyaz_Zayani_Ahmad) died during his hospitalization due to [haemorrhage](/wiki/Intracerebral_hemorrhage) in the brain following a traumatic head injury. His mother's boyfriend, Aliff Mohamed Yusoff, was arrested for voluntarily causing grievous hurt before the charge was upgraded to murder. It was alleged that Aliff intentionally caused the fatal head injuries to Izz by pushing his head against the floorboard of his van between 10pm on the night of 7 November and 12.15am the next day, though Aliff insisted that the boy sustained the injuries due to an accidental fall. Aliff was convicted of murder on 13 July 2022 and on 11 August, was sentenced with a life imprisonment with 15 strokes of the cane. Aliff's appeal against his conviction was rejected on 11 September 2023. - [Capital punishment in Singapore](/wiki/Capital_punishment_in_Singapore) - [Life imprisonment in Singapore](/wiki/Life_imprisonment_in_Singapore) - [List of major crimes in Singapore](/wiki/List_of_major_crimes_in_Singapore)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:25:20.639082",
  "title": "List of major crimes in Singapore (2010–2019)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/List_of_major_crimes_in_Singapore_(2010%E2%80%932019)"
}