{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:22:47.473143"
  },
  "content": "* *This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"List of Indian Singaporeans\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(February 2018)* *(Learn how and when to remove this message)*This list of people **may not follow Wikipedia's verifiability policy**. Please help improve it by adding reliable sources for existing names which prove they are members of this list. Unsourced names may be challenged and removed. *(December 2019)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* This is a list of **prominent Indian Singaporeans** who have made significant contributions nationally or internationally across various fields. The list primarily includes [ethnic](/wiki/Ethnicity) South Asians in Singapore and does not include [permanent residents](/wiki/Permanent_residency) of Indian ethnicity. Prominent ethnic South Asian citizens of other countries who have lived in Singapore only on a short-term basis may be found under the relevant list of persons from their respective countries. ## Government and politics ### Presidents of Singapore - The late [Chengara Veetil Devan Nair](/wiki/Chengara_Veetil_Devan_Nair) (1923–2005) – Singapore's third President (1981–1985) and former head of the [National Trades Union Congress](/wiki/National_Trades_Union_Congress), the umbrella body for trades unions in Singapore. Widely seen as the founder of the modern trades union movement in Singapore. During Singapore's brief membership o4554f Malaysia, Nair was the only [People's Action Party](/wiki/People%27s_Action_Party) (PAP) member to win a national seat in the [Federal Parliament](/wiki/Parliament_of_Malaysia#History) in Kuala Lumpur. He was an ethnic Indian of [Malayali](/wiki/Malayali) [Hindu](/wiki/Hinduism) background and married to a fellow ethnic Indian of Tamil Hindu origin. - The late [Sellapan Ramanathan](/wiki/Sellapan_Ramanathan) (1924–2016) – Singapore's sixth President (1999–2011). He was formerly a senior civil servant, serving as [Permanent Secretary](/wiki/Permanent_Secretary) at the [Home Affairs](/wiki/Minister_for_Home_Affairs_(Singapore)) and [Foreign Affairs Ministries](/wiki/Ministry_of_Foreign_Affairs_(Singapore)). He was also Director of the [Security and Intelligence Division](/wiki/Security_and_Intelligence_Division), *[The Straits Times](/wiki/The_Straits_Times)* newspaper, [Singapore Press Holdings](/wiki/Singapore_Press_Holdings) and [Singapore Mint](/wiki/Singapore_Mint). From 1990 to 1996, he was Ambassador to the United States, and subsequently an [Ambassador-at-Large](/wiki/Ambassador_at_Large). He was an Indian [Tamil](/wiki/Tamil_people) Hindu married to a [Bengali](/wiki/Bengali_Hindus) Singaporean Indian Hindu. - Mr [Tharman Shanmugaratnam](/wiki/Tharman_Shanmugaratnam) (1957-) – Singapore's ninth and current president (since 2023). Formerly a Senior Minister for Social Policies. Mr Tharman was Singapore's first Indian Minister for Education and later Minister for Finance and Deputy Prime Minister. He is a Sri Lankan Tamil Hindu married to a Singaporean of mixed Chinese Japanese descent. ### Cabinet ministers - The late [Sinnathamby Rajaratnam](/wiki/Sinnathamby_Rajaratnam) (1915–2006) – Singapore's first Foreign Minister, Culture Minister and Senior Minister, as well as a former Labour Minister and Deputy Prime Minister. Widely regarded as one of the core members of the \"old guard\", or the founding fathers of Modern Singapore, he cofounded the [People's Action Party](/wiki/People%27s_Action_Party) as well as [ASEAN](/wiki/ASEAN). In the wake of the [1964 Race Riots](/wiki/1964_Race_Riots) in Singapore, he wrote the [Singapore National Pledge](/wiki/Singapore_National_Pledge), which enshrines the ideals of the nation. He was from a Sri Lankan Tamil Hindu background and was married to a [Hungarian](/wiki/Hungarian_people) woman. Both were secular agnostics. - Mr [Suppiah Dhanabalan](/wiki/Suppiah_Dhanabalan) (1937– ) – Current Chairman of [DBS Bank](/wiki/DBS_Bank) and [Temasek Holdings](/wiki/Temasek_Holdings). former Minister of Trade and Industry, National Development, Foreign Affairs, Culture and Community Development in the 1980s and 1990s. He was publicly mentioned by Singapore's first Prime Minister as one of the four men he considered as his successor, but he decided against Dhanabalan as he felt Singapore was 'not ready' for a non-Chinese Prime Minister. He is an Indian Tamil Baptist married to a Chinese Singaporean Baptist. - Prof [Shunmugam Jayakumar](/wiki/S._Jayakumar_(Singaporean_politician)) (1939– ) – Former Co-ordinating Minister for National Security. Former Minister of Law, Labour, Home Affairs and Foreign Affairs. Member of the [ASEAN Eminent Persons Group](/wiki/ASEAN_Eminent_Persons_Group), tasked with drafting an [ASEAN Charter](/wiki/ASEAN_Charter). Previously Dean of the Law School at the [National University of Singapore](/wiki/National_University_of_Singapore) and Ambassador to the UN (1971–1974). He is an Indian Tamil Hindu married to an Indian Tamil Hindu. - Dr [Vivian Balakrishnan](/wiki/Vivian_Balakrishnan) (1961– ) – Minister for Foreign Affairs. He is the son of a Tamil ethnic origin Indian Singaporean father and a [Foochowese](/wiki/Foochow_people) origin Chinese Singaporean mother. His wife is Chinese Singaporean and they are Christians. - Mr [K Shanmugam](/wiki/K_Shanmugam) (1959-) – Minister of Law and Minister for Home Affairs. Mr Shanmugam was a four-term [backbench](/wiki/Backbench) member of parliament was a lawyer in private practice. He had been one of the youngest persons to have been appointed a [Senior Counsel](/wiki/Senior_Counsel) in Singapore, as was widely seen as one of the nation's top litigators. He is an Indian Tamil Hindu Singaporean. - Mr [S Iswaran](/wiki/S_Iswaran) (1962– ) – Minister of Communications and Information. He was formerly a Colombo Plan scholar and the CEO of [Singapore Indian Development Association](/wiki/Singapore_Indian_Development_Association), the Indian community self-help group as well as managing director of [Temasek Holdings](/wiki/Temasek_Holdings). - Ms [Indranee Rajah](/wiki/Indranee_Rajah) (1963– ) – Born to an ethnically [Tamil](/wiki/Tamils) father and a [Cantonese](/wiki/Cantonese_people) origin Chinese Singaporean mother, Ms Indranee is a lawyer by training. She entered politics in 2001 was appointed Minister in the Prime Minister's office in 2018. She follows her mother's Christian faith. ### Junior Ministers - Dr [Balaji Sadasivan](/wiki/Balaji_Sadasivan) (1955–2010) – He was Senior Minister of State at the Ministries of Foreign Affairs and Information, Communications and the Arts. He was formerly a neurosurgeon at Gleneagles Hospital. He was a South Indian Hindu. - Dr [Janil Puthucheary](/wiki/Janil_Puthucheary) (1972-) – Was a paediatric intensivist prior to entering politics. Currently serves as a Senior Minister of State for the Ministries of Transport and Communications and Information. ### Opposition leaders - [Joshua Benjamin Jeyaretnam](/wiki/Joshua_Benjamin_Jeyaretnam) (1926–2008) – the first opposition politician to break the PAP monopoly on parliament when he won a by election in 1984. In the 1980s, he was the leader of the Workers' Party and was seen as the de facto leader of the Singapore opposition. He served several terms in Parliament as an MP before he was bankrupted by government lawsuits and disqualified from being an MP. He was a former magistrate and is currently a lawyer in private practice. He was from a Sri Lankan Tamil Christian background, and he married an Englishwoman. - Dr [Vincent Wijeysingha](/wiki/Vincent_Wijeysingha) – prominent opposition politician. - Dr [James Gomez](/wiki/James_Gomez_(politician)) (1965– ) – is a prominent opposition politician and academic. He contested in Singapore's 2006 General Elections at Ajlunied GRC polling 44% as part of the [Workers' Party, Singapore](/wiki/Workers%27_Party,_Singapore) team. Prior to entering politics, he founded in 1999 Think Centre a non-government organisation dedicated to promoting human rights, democracy and more open political discourse in Singapore. He is an Indian Catholic Singaporean of Goan descent. He is presently Lecturer at Monash University, Australia. - [Pritam Singh](/wiki/Pritam_Singh_(Singaporean_politician)) (1976– ) – Current Secretary-General of the Workers' Party, the largest opposition party in Singapore. He entered politics in 2006, and was elected into Parliament in 2011. ### Members of parliament - S Ramaswamy – Legislative Assembly & 1st – 2nd Parliament - S V Lingam – Legislative Assembly & 1st Parliament - [Avadai Dhanam Lakshimi](/wiki/Avadai_Dhanam_Lakshimi) – 1st Parliament - S Rajoo – 1st Parliament - S T Bani – 1st Parliament - P Coomaraswamy – 1st – 2nd Parliament - [Perumal Govindaswamy](/wiki/Perumal_Govindaswamy) – 1st – 4th Parliament - [P Selvadurai](/wiki/P._Selvadurai) – 1st – 5th Parliament - [N Govindasamy](/wiki/N_Govindasamy) – 2nd – 4th Parliament - S Chandra Das – (manager) 5th – 8th Parliament - Dr [S Vasoo](/wiki/S_Vasoo) – (academic) 6th – 9th Parliament - [Davinder Singh](/wiki/Davinder_Singh_(lawyer)) – (lawyer) 7th – 10th Parliament - R Sinnakaruppan – 8th – 9th Parliament - Ravindran s/o Ramasamy – 9th – 10th Parliament - Inderjit Singh – (entrepreneur) 9th – 12th Parliament - [Hri Kumar Nair](/wiki/Hri_Kumar_Nair) – (lawyer) 11th-12th Parliament - [Vikram Nair](/wiki/Vikram_Nair) – (lawyer) 12th Parliament-present - [Murali Pillai](/wiki/Murali_Pillai) – (lawyer) 13th Parliament-present - [Darryl David](/wiki/Darryl_David) (media personality/educator) 13th Parliament- present. Mixed parentage of an Indian father and a Chinese mother. - SV Lingam - Member of Parliament, 1959–1968 - PV Sharma - former Member of Parliament and communist leader #### Nominated MPs - Dr [Kanwaljit Soin](/wiki/Kanwaljit_Soin) – Neurosurgeon & activist (8th Parliament); First female NMP in Singapore - Braema Mathi – Journalist & activist (9th Parliament) - Chandra Mohan K Nair – Lawyer (9th Parliament) - [Thomas Thomas](/wiki/Thomas_Thomas_(trade_unionist)) – Unionist (9th Parliament) - Shriniwas Rai – Lawyer (9th Parliament) - A Nithiah Nandan – Unionist (10th Parliament) - Prof Kalyani Mehta – Academic (11th Parliament) - Gautam Banerjee Chairman, PricewaterhouseCoopers (11th Parliament) - [Viswa Sadasivan](/wiki/Viswa_Sadasivan) – CEO, Strategic Moves (11th Parliament) - R Dhinakaran – Managing director, Jay Gee Melwani Group (12th Parliament) - Karthikeyan s/o R. Krishnamurthy – Unionist (12th Parliament) - Ganesh Rajaram – Executive vice-president, FremantleMedia International Asia branch (13th Parliament) - Mahdev Mohan – Lawyer/Legal Academic (13th Parliament) - K Thanaletchmi – Unionist (13th Parliament) - Arasu Duraisamy – Unionist (13th Parliament) - Abbas Ali Mohamed Irshad – President, Roses for Peace NGO (13th Parliament) ## Arts and culture Singapore's first ever Deepavavali Queen contest was organised in Oct 1967 at the Victoria Theatre by Indian Movie News magazine. Singapore's First Deepavavali queen elected was Miss Impaljit Kaur from Jesselton, Sabah. Source: Indian Movie News Magazine - Dec 1967 Second Deepavavali Queen contest was organised in 1971 also by Indian Movie News mag at the Singapore Conference Hall and Miss Nirmala Rajoo was elected as the (2nd) Deepavavali Queen in Singapore. Source: Indian Movie News Magazine - Dec 1971 ### Dance - [Santha Bhaskar](/wiki/Santha_Bhaskar) – [Indian classical dance](/wiki/Indian_classical_dance) choreographer, and 1990 Cultural Medallion winner - [Madhavi Krishnan](/wiki/Madhavi_Krishnan) – 1979 Cultural Medallion winner - [Neila Sathyalingam](/wiki/Neila_Sathyalingam) – Indian classical dance choreographer, and 1989 Cultural Medallion winner - Usha Rani Maniam - Indian Classical Dance choreographer ### Literature - [M. Balakrishnan](/wiki/M._Balakrishnan) – Tamil writer, and 2005 Cultural Medallion winner - [Gopal Baratham](/wiki/Gopal_Baratham) – English language novelist (and [neurosurgeon](/wiki/Neurosurgeon)). He was a Tamil Hindu Singaporean. - [Thamizhavel G. Sarangapani](/wiki/Thamizhavel_G._Sarangapani) – Tamil writer, social reformer and founder of the [Tamil Murasu](/wiki/Tamil_Murasu) newspaper. - [Haresh Sharma](/wiki/Haresh_Sharma) – English language playwright and [dramaturge](/wiki/Dramaturge). He is a North Indian Hindu Singaporean. - [Edwin Thumboo](/wiki/Edwin_Thumboo) – English language poet and literature professor, and 1979 Cultural Medallion winner. He is a [Chindian](/wiki/Chindian) Christian Singaporean. - SA Nathanji, writer, author, former publisher/managing editor of Indian Movie News magazine. Author of MY MEMOIRS: MY UNBELIEVABLE JOURNEY WITH INDIAN CINEMA launched by former president of Singapore the Hon S R Nathan (2014 & SINGAPORE: NATION BUILDING & INDIANS' LEGACY (2017). - S Varathan – Tamil theatre practitioner, and 1984 Cultural Medallion winner[*citation needed*] - MK Bhasi – Poet and social activist who wrote primarily in English and Malayalam. ### Music - [Alex Abisheganaden](/wiki/Alex_Abisheganaden) – 1988 Cultural Medallion winner, a classical guitarist, double-bassist, stage actor and singer in operas and musicals. He is a Tamil Christian Singaporean who has been called \"the father of the guitar in Singapore\". - [Jacintha Abisheganaden](/wiki/Jacintha_Abisheganaden) – songwriter and [jazz](/wiki/Jazz) singer. She has released 13 albums. She is a [Chindian](/wiki/Chindian) Singaporean Christian. - [Paul Abisheganaden](/wiki/Paul_Abisheganaden) – 1986 Cultural Medallion winner. He has been called \"the doyen of orchestral music in Singapore\". He is a Tamil Christian Singaporean. - [Michelle Saram](/wiki/Michelle_Saram) – Popular actress who have appeared in Singapore, Taiwan and Hong Kong television series. She is a [Chindian](/wiki/Chindian) Singaporean Christian. - [Shabir](/wiki/Shabir) – Winner of the first iteration of the Vasantham Star singing competition 2005. He is considered a leader in the Tamil-language contemporary music scene in Singapore, and has also done work composing for the Indian film industry. ### Visual arts and architecture - [Chandrasekaran](/wiki/Chandrasekaran) – sculptor, installation and performance artist. He won the National Arts Council Young Artist Award in 1993. He is a Singaporean Indian Tamil Hindu. - Vikas Gore – project director of the [Esplanade - Theatres on the Bay](/wiki/Esplanade_-_Theatres_on_the_Bay) [performing arts](/wiki/Performing_arts) centre. He is a Director at DP Architects Pte Ltd, a major architectural practice in Singapore. An American citizen, he lived in India till 1977 and has since been based in Singapore. - [Ketna Patel](/wiki/Ketna_Patel) – visual artist (formerly an architect). She is a Uganda-born Gujarati Hindu, a British national and Singapore PR - [T. Sasitharan](/wiki/T._Sasitharan) - theatre practitioner and educator; [Cultural Medallion](/wiki/Cultural_Medallion) (Theatre) winner, 2012 - Chandran K. Lingam - Singapore theatre pioneer ## Business and entrepreneurship - [Naraina Pillai](/wiki/Naraina_Pillai) - Raj Kumar and Kishin RK - Father-son duo Raj Kumar and Kishin RK have combined assets of US$2.6 billion coming out top among the Indian-origin businessmen in Singapore. However, they come in at the ninth position in the richest list. Both father and son are one of Singapore's leading landlords with their Royal Holdings/RB Capital property empire. - [JY Pillay](/wiki/JY_Pillay) – Joseph Yubaraj Manuel Pillay (b. 30 March 1934, Klang, Malaya), also known as J. Y. Pillay, served 34 years till 1995 as a top-ranking civil servant and an entrepreneur. He is one of the pioneers who helped build the Singapore economy after its separation from Malaysia in 1965. His single most significant contribution is in building [Singapore Airlines](/wiki/Singapore_Airlines) (SIA) into a leading world-class carrier. One of the few highest-ranked Civil Service officers (Staff Grade III), he is also known as a visionary and a brilliant bureaucrat. He was the Chairman of the [Singapore Exchange](/wiki/Singapore_Exchange) between 1999 and 2010. In 2012, [NUS](/wiki/National_University_of_Singapore) set up two professorships to honour him for his contributions. - [Sudhir Gupta](/wiki/Sudhir_Gupta) – At age 47 and with a personal fortune estimated at $320 million, he was ranked by [Forbes](/wiki/Forbes) as the 13th richest person/family in Singapore in 2006. He is also the second richest ethnic Singapore Indian on that list. He was born in India, and moved to Russia to get a PhD in agricultural chemistry. he started a tyre company in Moscow and acquired a Dutch company to form Amtel-Vredestein. He listed the tyre maker on the [London Stock Exchange](/wiki/London_Stock_Exchange) last year. He escaped an assassination attempt in Moscow 4 years ago, and now shuttles between that city and Singapore, where he's a citizen. - Murli Kewalram Chanrai – Heads Kewalram Chanrai Group, one of 5 companies spun off from 150-year-old Chanrai family empire. KCG has interests in textiles, commodities, real estate. Its Olam International, the world's largest trader of cashews and second-largest trader of cocoa, debuted on the Singapore stock exchange last year. Aged 83, and with a personal fortune valued at $880 million, [Forbes](/wiki/Forbes) estimated in 2006 that he was the 7th wealthiest person in Singapore, and the city-state's wealthiest ethnic Indian. He is a North Indian of Sindhi origin. - Kartar Singh Thakral – Joined family's trading business in 1949, built family empire; it now includes Singapore-listed Thakral Corp., which distributes tech gear such as iPods in China and India, and Australian property group Thakral Holdings. Son Inderbethal helps run business. Forbes ranks him as the 25th richest person in Singapore in 2006, with a fortune of $175million. - [Sanjeev Sanyal](/wiki/Sanjeev_Sanyal) - Economist, bestselling writer, environmentalist, and urban theorist; was Global Strategist for [Deutsche Bank](/wiki/Deutsche_Bank); writer of popular history books on India, South and South-East Asia; Adjunct Fellow of [IPS-NUS](/wiki/Institute_of_Policy_Studies_(Singapore)) and advocate of \"walkability\" in cities. - Manohar Khiatani - Senior Executive Director at CapitaLand, one of the largest real estate companies in Asia - [G. Ramachandran](/wiki/G._Ramachandran) - longest-serving president of the Singapore Indian Chamber of Commerce and Industry - Anuvrat Rao - Google pioneer; Co-founder and CEO, AI startup 1Bstories - Parthiban Murugaiyan - owner of Ishtara Jewellery and Maestro Productions ## Civil Service - Prof. Satkunanantham Kandiah, Director of Medical Services, [Ministry of Health, Singapore](/wiki/Ministry_of_Health_(Singapore)) - [Bilahari Kausikan](/wiki/Bilahari_Kausikan), former [Permanent Secretary](/wiki/Permanent_Secretary), [Ministry of Foreign Affairs, Singapore](/wiki/Ministry_of_Foreign_Affairs_(Singapore)) - Manohar Khiatani, CEO, [JTC Corporation](/wiki/JTC_Corporation) - [Ravi Menon](/wiki/Ravi_Menon), managing director, [Monetary Authority of Singapore](/wiki/Monetary_Authority_of_Singapore) - R. Puniamoorthy, Senior Assistant Commissioner, [Singapore Civil Defence Force](/wiki/Singapore_Civil_Defence_Force) - Juthika Ramanathan, Chief Executive, [Accounting and Corporate Regulatory Authority](/wiki/Accounting_and_Corporate_Regulatory_Authority) - [Major General](/wiki/Major_General) [Ravinder Singh](/wiki/Ravinder_Singh_(general)), [Chief of Army](/wiki/Chief_of_Army_(Singapore)), [Singapore Armed Forces](/wiki/Singapore_Armed_Forces) - Vijakumar Sethuraj, deputy director, [Central Narcotics Bureau](/wiki/Central_Narcotics_Bureau) - Dr. N. Varaprasad, Chief Executive, [National Library Board](/wiki/National_Library_Board) - Aaron Sharil Yusoff Maniam, Head, Centre for Strategic Futures - Janadas Devan, Head of Government Communications, Ministry of Communications and Information ## Diplomacy and foreign relations - [Gopinath Pillai](/wiki/Gopinath_Pillai) – Ambassador at Large - [Vanu Gopala Menon](/wiki/Vanu_Gopala_Menon) – Permanent Representative of Singapore to the United Nations during 2004–2011, High-Commissioner to Malaysia, Ambassador to Turkey. - Burhan Gafoor – Ambassador/Permanent Representative to the UN in New York - V K Rajan – Former Ambassador - T Jasudasen – High Commissioners to Malaysia - M P H Rubin – High Commissioners to South Africa - Anil Kumar s/o N T Nayar – Ambassadors to Belgium (*de facto* representative to the [European Union](/wiki/European_Union)) - A Selverajah – Ambassador to Germany - Ashok Kumar Mirpuri – Ambassador to US - Hirubalan V P – Ambassadors to Saudi Arabia - Karan Singh Thakral - Non Residential Ambassador to Denmark ## Education and higher learning (Academia) - J. Mohan Rao – Director, [Institute of South Asian Studies](/wiki/Institute_of_South_Asian_Studies) - K. Kesavapany – Director, [Institute of Southeast Asian Studies](/wiki/Institute_of_Southeast_Asian_Studies) - [Kishore Mahbubani](/wiki/Kishore_Mahbubani) – Dean, [Lee Kuan Yew School of Public Policy](/wiki/Lee_Kuan_Yew_School_of_Public_Policy), NUS - Arcot Desai Narasimhalu – Director, Institute for Innovation and Entrepreneurship, SMU - [Cherian George](/wiki/Cherian_George) - Professor of Journalism at [Hong Kong Baptist University](/wiki/Hong_Kong_Baptist_University) and previously at [WKSCI, NTU](/wiki/Nanyang_Technological_University#Wee_Kim_Wee_School_of_Communication_and_Information). ## Law and the judiciary - [Choor Singh](/wiki/Choor_Singh) – Former [judge](/wiki/Judicial_officers_of_the_Republic_of_Singapore#List_of_judges_of_the_Supreme_Court) of the [Supreme Court of Singapore](/wiki/Supreme_Court_of_Singapore), nicknamed \"The Hanging Judge\" - [T. S. Sinnathuray](/wiki/T._S._Sinnathuray) – Former judge who presided over a number of high-profile cases, including, the infamous [Toa Payoh ritual murders](/wiki/Toa_Payoh_ritual_murders) of the 1980s. - Justice [V.K. Rajah](/wiki/V_K_Rajah) – Judge of Appeal (one of Singapore's top three judges, including the Chief Justice) - [Sundaresh Menon](/wiki/Sundaresh_Menon) – [Chief Justice of Singapore](/wiki/Chief_Justice_of_Singapore) as of November 2012 - [Subhas Anandan](/wiki/Subhas_Anandan) (1947–2015) - Lawyer noted for his pro bono work and for taking several high-profile criminal cases. - [Eugene Thuraisingam](/wiki/Eugene_Thuraisingam) - [Human rights lawyer](/wiki/Human_rights_lawyer) - [Davinder Singh](/wiki/Davinder_Singh_(lawyer)) - Continued practising law after retiring from politics in 2006. - [Ravi Chandran](/wiki/Ravi_Chandran) - top NUS law professor, specialty in employer relations, wrote 4 textbooks on subject - Subra M Suppiah - Conveyancing lawyer who runs his own law firm, Subra TT Law LLC - [M Ravi](/wiki/M_Ravi) - Human rights lawyer and former politician. - [Hri Kumar Nair](/wiki/Hri_Kumar_Nair) – Continued practising law after retiring from politics in 2015. Was appointed Deputy Attorney General in 2017. ## News and Media - Parapuram Joseph John - Former Editor of The Malaya Tribune in Singapore; Forced to work as No.2 of [Dōmei Tsushin](/wiki/D%C5%8Dmei_Tsushin) in Singapore, the Japanese news agency serving anti-British propaganda; Author of Sayonara Singapura, a book (published posthumously in 2016, 3 decades after his death) on the Japanese Occupation and life in Singapore during those tumultuous times. - Ravi Velloor is an Associate Editor of The [Straits Times](/wiki/Straits_Times), Singapore's largest daily broadsheet newspaper. A 36-year veteran journalist and Jefferson Fellow, Velloor has reported from across Asia, the US and Europe, and has worked at [Bloomberg News](/wiki/Bloomberg_News), [Time Warner](/wiki/Time_Warner) magazines and [Agence France-Press](/wiki/Agence_France-Press). - Indian Movie News (IMN) monthly magazine. The Shaw Organisation started the movie magazine on 15 August 1952 to publicise their imported movies before screening at their vast theatre network. IMN became a household magazine in Singapore, Malaya, Brunei & Indonesia. Early editors were Koshy Tharian and MK Menon. Later in the 60s, the readers of the movie magazine formed a readers club - Indian Movie News Readers Club and the first president was S A Nathan. The club organised many social & cultural activities including annual picnics & organised tours in Singapore and Malaya. The club also organised the first ever Deepavali Queen contest in Singapore at the Victoria Theater in October 1967. Miss Impaljit Kaur from Sabah, Malaysia was crowned as the first Deepavali Queen winner. ## Science and medicine - Dr [Shan Ratnam](/wiki/Shan_Ratnam) – Emeritus Professor Sittampalam Shanmugaratnam (1928–2001) was head of the Department of Obstetrics and Gynaecology at the National University Hospital of Singapore. He was widely recognised as a world leader in human reproduction research. He was a Sri Lankan Tamil Hindu Singaporean. - Prof Ariff Bongso – Dr Ariff Bongso holds several patents and has 430 research publications in internationally refereed journals, conference papers and chapters in books. He was one of the founder scientists of Embryonic Stem Cell International (ESI), a Singapore registered Biotechnology Company. He is currently Research Professor and Scientific Director of the Assisted Reproductive Technology programme at the [NUS](/wiki/National_University_of_Singapore) Department of Obstetrics and Gynaecology. He is also Principal Investigator for in Vitro Fertilization and human embryonic stem cell research at the NUS National University Hospital. - [Kanagaratnam Shanmugaratnam](/wiki/Kanagaratnam_Shanmugaratnam) - [histopathologist](/wiki/Histopathology) and Singapore's \"father of pathology ## Sports - [Nadesan Ganesan](/wiki/Nadesan_Ganesan) - Criminal lawyer, former President of [Football Association of Singapore](/wiki/Football_Association_of_Singapore). Founded the [Lion City Cup](/wiki/Lion_City_Cup) - [George Suppiah](/wiki/George_Suppiah) – Singapore's first Football World Cup referee - [V Sundramoorthy](/wiki/V_Sundramoorthy) – Former national footballer - [Samson Gimson](/wiki/Samson_Gimson) - Golfer, won the Japan Golf Tour once - [Rajesh Sreenivasan](/wiki/Rajesh_Sreenivasan) – Technology lawyer - [Fazrul Nawaz](/wiki/Fazrul_Nawaz) - National football team member - [Hariss Harun](/wiki/Hariss_Harun) - National football team member - Arul Subramaniam - Vice captain of the Singapore Hockey Team for the 7th SEAP Games and won the Hockey gold medal at the 7th SEAP Games. Captain of the Singapore Hockey team from 1973- 1977.[*citation needed*] - [Stacey Muruthi](/wiki/Stacey_Muruthi) - former national cricket captain who holds the record for playing 45 consecutive years in the [Singapore Cricket Association](/wiki/Singapore_Cricket_Association) (SCA) league, 1968–2012 - [S. Jeyathurai](/wiki/S._Jeyathurai) - Olympian (hockey), [1956 Summer Olympics](/wiki/1956_Summer_Olympics) - [Kesavan Soon](/wiki/Kesavan_Soon) - Olympian (athletics), [1956 Summer Olympics](/wiki/1956_Summer_Olympics) - [Arumugam Vijiaratnam](/wiki/Arumugam_Vijiaratnam), Olympian (hockey), [1956 Summer Olympics](/wiki/1956_Summer_Olympics); only Singaporean who had represented Singapore in four sports - hockey, football, cricket and rugby; first Pro-Chancellor, [Nanyang Technological University](/wiki/Nanyang_Technological_University) - R Alagirisamy - First Singaporean to run the 1500 metres below 4 minutes, 1972 ## Others - [Pav Gill](/wiki/Pav_Gill) - whistleblower who uncovered the [Wirecard scandal](/wiki/Wirecard_scandal), one of the largest corporate frauds in history - [Kokila Annamalai](/wiki/Kokila_Annamalai) - anti-death penalty activist\n",
  "language": "en",
  "processed_at": "2026-01-12T11:22:47.472801",
  "title": "List of Indian Singaporeans",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/List_of_Indian_Singaporeans"
}