{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:25:23.813472"
  },
  "content": "This list **contains entries that may be out of scope and need to be evaluated for removal**. Please help clean it up by removing items that do not meet the inclusion criteria agreed upon on the talk page. *(August 2022)*This article may **require cleanup** to meet Wikipedia's quality standards. The specific problem is: **This list does not seem to adhere to some WP:BLP policies, specifically WP:BLPNAME.** Please help improve this article if you can. *(August 2022)* *(Learn how and when to remove this message)* The following is a list of **major** [crimes in Singapore](/wiki/Crime_in_Singapore) that happened before 1990. They are arranged in chronological order. ## 1950s ### 1950 - 29 June 1950: Winnie Annie Spencer, a ten-year-old schoolgirl, was found dead at the beach near [Labrador Park](/wiki/Labrador_Nature_Reserve). An autopsy revealed that she had been raped and strangled to death. 25-year-old Joseph Michael Nonis was arrested and charged with the murder of Spencer. At the trial starting on 24 October 1950, despite having signed a confession, Nonis insisted on going on the stand, where he claimed that he was innocent and that he had been tortured by Chief Inspector J. Rayney, who had forced him to pen down and sign the confession of how he killed Spencer. He also testified he was afraid of Rayney, who was notorious for using torture to extract confessions from suspects during and after the [Japanese Occupation of Singapore](/wiki/Japanese_Occupation_of_Singapore) (one of them suffered from brain damage as a result of the torture). [David Marshall](/wiki/David_Marshall_(Singaporean_politician)), the lawyer who represented Nonis, called in witnesses who had been tortured by Rayney to testify in court. All of Nonis's family members and acquaintances also testified that Nonis was seen at home on the same night when Spencer was murdered, which supported Nonis's alibi defence. A psychiatrist was also called in to assess Nonis's character and the confession written by Nonis. The psychiatrist said in court that such a confession could only be written by an individual of psychopathic behaviour, and Nonis's true character did not fit that of a psychopath. After a trial lasting nine days, in view of the evidence, the seven-man jury found Nonis not guilty of murder and as a result, Nonis was discharged and acquitted of murder. As of July 2024[update], the rape and murder of Spencer remains unsolved, and the murderer(s) was never found. In the aftermath, Rayney resigned from the police force and he died in 1986 at the age of 82, while Nonis eventually immigrated to England more than a decade later, and finally to Spain, where he lived until his death before 2002. - 11–13 December 1950: 13-year-old Dutch-[Eurasian](/wiki/Eurasians_in_Singapore) girl [Maria Hertogh](/wiki/Maria_Hertogh) was adopted by Che Aminah binte Mohammad in 1943 and raised as a Muslim under the name Nadra binte Ma'arof. In April 1950, the Hertoghs, through the Dutch Consulate in Singapore, applied to the [High Court](/wiki/High_Court_of_Singapore) to regain custody of their daughter. On 1 August 1950, Maria Hertogh entered an arrangement, regarded as a valid marriage from an Islamic perspective, to marry 21-year-old Mansoor Adabi. On 2 December 1950, High Court judge T. A. Brown ruled that the marriage was illegal and awarded custody of Maria Hertogh to her biological parents. The ruling sparked outrage from the Muslim community in Singapore and led to riots that killed 18 people, including police officers and civilians. Hundreds of rioters were arrested, prosecuted and jailed for rioting; nine of them were even given the death penalty for murder. In 1959, after the Malaysian government intervened, the convicted rioters on death row had their sentences commuted to [life imprisonment](/wiki/Life_imprisonment) and they were all subsequently pardoned and released from prison. ## 1960s ### 1960 - April 1960: 49-year-old \"Biscuit King\" Lee Gee Chong, chairman of the Thye Hong biscuit factory in [Johor](/wiki/Johor), was being driven by his chauffeur to his residence in [Garlick Avenue](/wiki/Bukit_Timah) when another car forced his car onto an embankment. Three men then pulled him out of his car and into their own and abducted him. Lee Gee Chong was the son of [Lee Choon Seng](/wiki/Lee_Choon_Seng), a former president of [SCCCI](/wiki/Singapore_Chinese_Chamber_of_Commerce_and_Industry) and chairman of [OCBC Bank](/wiki/OCBC_Bank). Five days after the kidnapping, Lee Gee Chong's dead body was found wrapped in a blanket at a graveyard in [Yio Chu Kang](/wiki/Yio_Chu_Kang). He had died of severe head injuries. It was not reported whether a ransom had been paid and the killer(s) were never caught till today. In July 1965, Lee Gee Chong's son, Lee Boon Leong, was ambushed while he was driving and shot in the shoulder. However, his attackers fled when they saw that he had a gun too. Lee Boon Leong, then in his 30s, survived the encounter. - July 1960: 60-year-old [C. K. Tang](/wiki/Tang_Choon_Keng), the founder of the department store [Tangs](/wiki/Tangs) at [Orchard Road](/wiki/Orchard_Road), was kidnapped outside his bungalow in [St Thomas Walk](/wiki/River_Valley,_Singapore) at 7:15 am in full view of children heading to a nearby school. Tang was released four days later after a S$150,000 ransom was paid. One of the kidnappers was Loh Ngut Fong (卢岳鹏), a notorious gang leader who was also behind several other kidnappings in that era. Loh was eventually killed on 11 November 1968 at his hideout in [St Heliers Avenue](/wiki/Yio_Chu_Kang) after a seven-hour shootout against police and [Gurkha](/wiki/Gurkha_Contingent) forces. ### 1961 - May 1961: 48-year-old shipping tycoon Tay Kie Thay was ambushed while in his car outside his bungalow at [Katong](/wiki/Katong). The gunmen forced his chauffeur out of the car before hijacking it and driving to Broadrick Road, where they transferred to another car. Tay's family paid a S$130,000 ransom but Tay did not return home safely. A few months later, it was discovered that Tay had been shot dead and buried in a vacant plot of land in [Tampines](/wiki/Tampines). One of the kidnappers, 33-year-old Sim Bin Peng, was arrested and charged with murder, but in the end, Sim was convicted of culpable homicide after pleading guilty, and he was sentenced to seven years in jail in April 1967, and lost his appeal for a lighter sentence in June of that same year. ### 1963 - 12 July 1963: The [Pulau Senang prison riot](/wiki/Pulau_Senang_prison_riot) occurred at the experimental-type offshore penal colony. A group of 70 to 90 inmates, led by Tan Kheng Ann, started a riot which destroyed and burned everything the inmates had built on Pulau Senang. During the riot, prison officer Daniel Stanley Dutton and his three assistants – Arumugan Veerasingham, Tan Kok Hian and Chok Kok Hong – were murdered by the rioters. About 58 men were accused of murder and rioting; the others received jail terms for rioting. During the five-month trial, [David Marshall](/wiki/David_Marshall_(Singaporean_politician)) represented the accused in court. Eventually, 18 men, including Tan Kheng Ann, were convicted of murder and hanged in [Changi Prison](/wiki/Changi_Prison) on 29 October 1965. Another 29 men were found guilty of rioting – among them, 11 were sentenced to two years' jail for rioting while the other 18 received three years' jail for rioting with deadly weapons. The remaining 11 men were acquitted and freed. - 27 August 1963: 22-year-old Jenny Cheok Cheng Kid had disappeared in the sea during a scuba-diving trip in the straits between [Sisters' Islands](/wiki/Sisters%27_Islands). Sixteen months later, her boyfriend, then 24-year-old [Sunny Ang Soo Suan](/wiki/Sunny_Ang), was arrested and charged with murder based on circumstantial evidence such as his eligibility to claim insurance for her death, as well as his strangely calm behaviour towards her disappearance. On 18 May 1965, by a unanimous decision, the seven-man jury found Ang guilty of murder; Ang was thus sentenced to death by [High Court](/wiki/High_Court_of_Singapore) judge Murray Buttrose. After failing in his appeals to the [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore) and the [Privy Council](/wiki/Judicial_Committee_of_the_Privy_Council), and after the rejection of his clemency petition by President [Yusof bin Ishak](/wiki/Yusof_Ishak), Ang was hanged on 6 February 1967. Cheok's body was never found. ### 1964 - 5 February 1964: 31-year-old Vee Ming Shaw, the eldest son of [Shaw Organisation](/wiki/Shaw_Organisation) founder [Run Run Shaw](/wiki/Run_Run_Shaw), was kidnapped at gunpoint at [Andrew Road](/wiki/Caldecott_Hill) on his way to work. The kidnappers also abducted his chauffeur, 45-year-old Mundari bin Iklal. Shaw and Mundari were released 12 days later after the Shaw family paid a ransom of S$250,000. A total of five youths - Ng Kim Cheng, Low Ngat Yeow, Ooi Chye Kooi, Han Jin Juan and Ng Song Lim (who also kidnapped a rich businessman Ng Quee Lam in another case) - were all sentenced to life imprisonment in June 1966. - November 1964: 44-year-old rubber magnate Ng Quee Lam was ambushed and abducted by four or five armed youths when he arrived in his limousine at [Kee Choe Avenue](/wiki/Potong_Pasir) to pick up a friend for dinner. A fortnight later, Ng was released after his family paid a S$400,000 ransom. Two of the youths, Ng Song Lim and Wong Tien Soon, were both sentenced to life in prison in June 1966. ### 1965 - 10 March 1965: In an incident known as the [MacDonald House bombing](/wiki/MacDonald_House_bombing), three [Indonesian marines](/wiki/Indonesian_Marine_Corps) – 23-year-old [Usman bin Haji Muhammad Ali](/wiki/Usman_Haji_Muhammad_Ali), 21-year-old [Harun bin Said](/wiki/Harun_Thohir) and Gani bin Arup – initiated an explosion at the [MacDonald House](/wiki/MacDonald_House) along [Orchard Road](/wiki/Orchard_Road) during the [Indonesia–Malaysia confrontation](/wiki/Indonesia%E2%80%93Malaysia_confrontation). The bombing caused the deaths of three people – 43-year-old Mohammed Yasin Kesit, 20-year-old Juliet Goh Hwa Kuang and 39-year-old Elizabeth Suzie Choo Kway Hoi – and injured at least 33 people. Gani managed to escape capture, while Usman and Harun were arrested and charged with murder. They were eventually found guilty of murder and sentenced to death by [High Court](/wiki/High_Court_of_Singapore) judge F. A. Chua. On 17 October 1968, more than three years after the bombing, the two men were hanged in [Changi Prison](/wiki/Changi_Prison). In retaliation, 400 students in [Jakarta](/wiki/Jakarta) burnt the [Singapore flag](/wiki/Flag_of_Singapore) and attacked the Singapore embassy. Singapore–Indonesia relations improved in 1973 after Singaporean prime minister [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) visited Indonesia and scattered flowers on the two marines' graves. In February 2014, bilateral ties between Singapore and Indonesia were strained after the [Indonesian Navy](/wiki/Indonesian_Navy) named a warship after the two marines, prompting Singapore to suspend inter-military relations with Indonesia. Indonesia eventually made an apology but said that it would not reverse its move on naming the warship after the two marines. In response, Singapore accepted the apology and said that it would resume inter-military relations with Indonesia. - 15 March 1965: Ian Reed, a soldier with the [British Army](/wiki/British_Army) based in Singapore, murdered his wife, Dorothy Reed (née Campbell). Ian had been having an affair with Dorothy's sister Joan. Ian and Dorothy had a fight, which resulted in Ian losing control and strangling Dorothy to death. Ian then buried Dorothy's body in his backyard in [Yio Chu Kang](/wiki/Yio_Chu_Kang). After Dorothy's death, Joan took on the identity of her sister and moved in with Ian, while everyone else thought it was Joan who went missing, and Ian pretended to help Joan's husband Ismail Omar look for her. This continued for several years. Joan, who knew that Ian killed Dorothy, began to threaten to expose Ian, and repeatedly called Ian a murderer openly. One day in September 1971, Joan exploded in a rage at Ian in front of two friends, repeatedly screaming that Ian was a murderer. This led Ian to confess about the murder to the police the following morning, and police recovered the skeleton of Dorothy in the backyard. On 6 June 1972, Ian was convicted of manslaughter and jailed for 5 years. ### 1968 - 5 February 1968: 24-year-old police detective [D. Munusamy](/wiki/D._Munusamy) was stabbed by two men seven times after attempting to arrest their friend under suspicion of being a gang member. Although he was able to wound one of the assailants by shooting him twice, Detective Munusamy was mortally wounded and he died twenty minutes after reaching the hospital. The two attackers, 28-year-old Lim Heng Soon and 29-year-old Low Ngah Ngah were arrested within the next two months and charged with murder. A seven-member jury unanimously found both Lim and Low guilty of murder and the pair were sentenced to death on 30 November 1968. A third suspect, 19-year-old Quek Hock Bee, was initially charged with murder before he received a discharge not amounting to an acquittal. Lim and Low lost their appeals between November 1969 and March 1970, and they were eventually hanged. - 24 May 1968: 19-year-old [Ong Beang Leck](/wiki/Ong_Beang_Leck) was last seen alive by his father when he left his father's shop. Later on, Ong's father received two separate phone calls on 26 May and 5 June, in which the caller claimed he had kidnapped Ong and demanded a ransom from Ong's father to free his son. A ransom of S$20,000 was eventually negotiated and paid, but still, there was no sign of Ong. A week after the ransom was paid, a rental car owner found one of the cars he rented out three weeks before had a foul-smelling odour. Tests revealed that the smell was that of blood. The person who last rented the car was 22-year-old Richard Lai Choon Seng. Lai confessed that he, along with four others, was part of a kidnapping, in which the victim was Ong. Lai also stated that he took part in the plan as he needed money to save his failing business, and that he thought the plan was to lure Ong into the rental car, render him unconscious and hold him hostage until the ransom was paid. However, on the night of 24 May 1968, as soon as Ong entered the car, Lai saw three of his four other accomplices use weapons to attack Ong, leading to Ong's death. This revelation led to the arrest of the other four accomplices; one of them was Ong's 24-year-old close friend Lee Chor Pet, the others were 29-year-old Chow Sien Cheong, 32-year-old Lim Kim Kwee, and 23-year-old Ho Kee Fatt. Lim and Ho had escaped to Malaysia before they were arrested by Malaysian police and extradited to Singapore. Lee led the police to a manhole in [Jurong](/wiki/Jurong), where Ong's highly decomposed body was found. Lee, Lim and Ho, who attacked Ong from the back of the car, were charged with murder. On 11 June 1970, [High Court](/wiki/High_Court_of_Singapore) judges A. V. Winslow and D. C. D'Cotta found the trio guilty of murder and sentenced them to death; the three men were hanged in [Changi Prison](/wiki/Changi_Prison) on 27 January 1973. Lai, who became the prosecution's main witness against the three murder defendants, was subsequently jailed for four years for his involvement in both the ransom negotiation and the abduction of Ong. For possessing the ransom money, Chow was also given a four-year jail sentence as well. ### 1969 - 26 March 1969: A group of four men, armed with guns and knives, entered a shophouse in [Sims Avenue](/wiki/Sims_Avenue) and robbed Chow Sow Lin, a mother of two, of her jewellery and money. When they left the shophouse, the robbers were chased by a mob led by the shophouse owner, who had been alerted of the armed robbery by someone in the shophouse. During their escape, one of the four robbers – 36-year-old [Teo Cheng Leong](/wiki/Teo_Cheng_Leong) – was separated from his group so he hid in an empty hut in [Lorong 39, Geylang](/wiki/Geylang). The police, who had been alerted by the mob, arrived at the hut where Teo was hiding. Teo suddenly came out of the hut and fired two shots at Inspector Desmond D'Oliveiro, the police officer nearest to the hut, but the shots missed him. After Teo retreated back into the hut, the police fired [tear gas](/wiki/Tear_gas) into the hut. Teo eventually came out and surrendered to the police. Within the next four days, two of Teo's accomplices – 26-year-old Khoo Meng Hwa and 31-year-old Ng Chwee Bock – were arrested. Khoo and Ng were later each sentenced to ten years' imprisonment for armed robbery. Teo, who stood trial in February 1970 for armed robbery and discharging a firearm twice, was found guilty and sentenced to death for the latter offence. On 21 October 1970, the court dismissed Teo's appeal against his death sentence, and he was eventually hanged in May 1971. Teo was the first person in Singapore's legal history to be tried for a capital case before two judges in the [High Court](/wiki/High_Court_of_Singapore) and also the first person to be sentenced to death following the abolishment of [jury trials](/wiki/Jury_trials) in January 1970. The fourth robber was never caught. - 15 June 1969: Known as the [Upper Bukit Timah factory murders](/wiki/Upper_Bukit_Timah_factory_murders), two Hongkongers - Kan Sze Hing and Leung Fung - were fatally stabbed by two youths who broke into their workplace (a duck feather factory) to commit armed robbery. The two robbers, Kee Ah Tee and Liew Kim Siong, were arrested and charged with the double killings, but both of them denied killing the victims and blamed it on their alleged mastermind, who instructed them both to commit robbery at the factory. Kee and Liew were both found guilty of murdering the Hongkongers and sentenced to death. They were hanged in 1972. - 21 June 1969: Inside his flat at [Bukit Merah](/wiki/Bukit_Merah), after a heated argument, 19-year-old Chow Kim Hoong stabbed his brother's 17-year-old fiancée [Kwong Sau Lan](/wiki/Kwong_Sau_Lan) and Kwong's 45-year-old mother Lee Gan Yoke. Kwong died at Outram Hospital while Lee survived and recovered. The stabbing happened due to Chow's resentment towards Kwong, his former girlfriend, for breaking up with him and allegedly mistreating his girlfriend, who was Kwong's sworn sister and ex-girlfriend of his brother. Chow was arrested three months later and charged with murder and voluntarily causing grievous hurt. He was found guilty of both counts and sentenced to death on 18 July 1970. However, a re-trial was ordered with respect to the charge of murder upon Chow's appeal, since two-judge panels were constituted to hear only the capital charges while non-capital charges could only be heard by single judges. Nevertheless, Chow's death sentence was reinstated after the re-trial's two judges found him guilty of murder a second time on 20 November 1971. Chow's appeal was dismissed and he was hanged on 3 August 1973. ## 1970s ### 1970 - 6 January 1970: 31-year-old dance hostess [Mimi Wong Weng Siu](/wiki/Mimi_Wong) and her 37-year-old ex-husband, [Sim Woh Kum](/wiki/Sim_Woh_Kum), murdered 33-year-old Japanese national Watanabe Ayako, the wife of Wong's lover, Watanabe Hiroshi. The murder was witnessed by the Watanabes' nine-year-old daughter Chieko, who came to Singapore with her mother and two siblings to visit her father. Watanabe Hiroshi, an engineer, had an affair with Wong for three years. After his wife found out about the affair, Watanabe wanted to end the affair but Wong was unwilling to. Filled with jealousy, Wong then asked for help from Sim, with whom she bore two sons, to help her in the murder. At the trial, both Wong and Sim accused each other of masterminding the murder, with Wong even putting up a defence of [diminished responsibility](/wiki/Diminished_responsibility). Wong's psychiatrist, Wong Yip Chong, also claimed that she had caught the [Japanese encephalitis virus](/wiki/Japanese_encephalitis) from Watanabe Hiroshi and thus suffered from a viral brain infection at the time of the killing. However, the prosecution's psychiatrist found that she was not suffering from any condition. After a trial lasting 26 days, on 7 December 1970, Wong and Sim were found guilty of murder and sentenced to death by [High Court](/wiki/High_Court_of_Singapore) judges Tan Ah Tah and [Choor Singh](/wiki/Choor_Singh). Their subsequent appeals to the [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore) and pleas for clemency to President [Benjamin Sheares](/wiki/Benjamin_Sheares) were rejected. On the morning of 27 July 1973, they were hanged in [Changi Prison](/wiki/Changi_Prison). Wong was the first woman to be executed in Singapore for murder since the country gained independence in 1965. - 1 November 1970: At a bungalow house in Leedon Park, 31-year-old gardener [Osman bin Ali](/wiki/Osman_bin_Ali) strangled both 68-year-old cook Tan Tai Hin and 58-year-old amah Wu Tee, and he was arrested a day after the murders were committed. Osman was charged and brought to trial for killing both Tan and Wu, and sentenced to death after he was convicted of both counts of murder. He later lost his appeals and was hanged on 27 July 1973. ### 1971 - 29 December 1971: In a case known as the [Gold Bars Triple Murders](/wiki/Gold_Bars_Triple_Murders), 55-year-old businessman Ngo Cheng Poh and his two employees, 57-year-old Ang Boon Chai and 51-year-old Leong Chin Woo, were murdered by a group of ten men. The group had also robbed the three men of 120 gold bars worth S$500,000. This robbery-murder was masterminded by 25-year-old Andrew Chou Hock Guan, a former business associate of Ngo, and several other gold bar syndicates smuggling gold bars from Vietnam into Singapore through the Vietnamese flights bound for Singapore. Chou, who started this job in early 1971, later lost the trust of the syndicates when he lost US$235,000, the money meant for the syndicates' funding in the business. Frustrated with the loss of trust from the syndicates, Chou hatched a plan to rob one of the syndicates still in contact with him. He engaged his 34-year-old elder brother David Chou Hock Heng, and two friends – 24-year-old Peter Lim Swee Guan and 25-year-old Augustine Ang Cheng Siong – to plan the robbery-murder. Six youths – 19-year-old Alex Yau Hean Thye, 20-year-old Stephen Francis, 18-year-old Richard James, 18-year-old Konesekaram s/o Nagalingam, 16-year-old Stephen Lee Hock Khoon, and 16-year-old Ringo Lee Chiew Chwee – were hired by Lim and Ang to commit the crime with a promised reward of S$20,000 to each of them. The group of ten were later arrested and charged with murder, while the stolen gold bars were later recovered by the police. Among the ten, only Ang confessed to his role in the robbery-murder. Ang was thus given a discharge not amounting to an acquittal. For his involvement in the murder, Ang was [detained indefinitely without trial](/wiki/The_President%27s_Pleasure_(Singapore)) for more than 10 years before being released. Ang later became the prosecution's key witness against all the nine accused persons, who pleaded not guilty to the triple murder charges. Additionally, the Chou brothers also asserted that Ang was the mastermind of the robbery-murder, while the others claimed they only helped to dispose or transport the bodies. After a trial lasting around 40 days, on 4 December 1972, [High Court](/wiki/High_Court_of_Singapore) judges [Choor Singh](/wiki/Choor_Singh) and F. A. Chua rejected the testimonies of all the nine defendants but accepted that the prosecution witness, Ang, was telling the truth, determining Chou as the mastermind and the equal roles played by all nine in the triple murder. All were found guilty of murder. Out of the nine accused, seven of them (including the Chou brothers) were sentenced to death. The two remaining people – Stephen Lee and Ringo Lee – escaped the death penalty as they were both under the age of 18 at the time of the murders; both of them were detained indefinitely under [the President's Pleasure](/wiki/The_President%27s_Pleasure_(Singapore)). The subsequent appeals made by the seven condemned to the [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore) and the [Privy Council](/wiki/Judicial_Committee_of_the_Privy_Council) against their sentences (in which their respective lawyers argued that Ang's testimony should not be trusted); and their pleas to President [Benjamin Sheares](/wiki/Benjamin_Sheares) for clemency all met with failure. On 28 February 1975, the seven men were hanged in [Changi Prison](/wiki/Changi_Prison). ### 1972 - 22–23 April 1972: In a case known as the [Pulau Ubin murder](/wiki/1972_Pulau_Ubin_murder), 25-year-old Harun bin Ripin and 19-year-old Mohamed Yasin bin Hussin barged into the home of 58-year-old Poon Sai Imm at [Pulau Ubin](/wiki/Pulau_Ubin) and robbed her. During the robbery, when Harun went around the house to look for valuables to steal, Yasin restrained Poon and tried to rape her. While trying to rape Poon, Yasin sat on her chest and caused her ribs to fracture, and these fractures ultimately caused Poon's death. The two men then disposed of Poon's body in the sea before returning to mainland Singapore; Poon's body was discovered by a fisherman the following morning. Nine months later, when he was arrested for another crime, Harun surprised the police by confessing to his involvement in the robbery. Harun's confession led to Yasin's arrest, and the two men were charged with Poon's murder. On 15 March 1974, [High Court](/wiki/High_Court_of_Singapore) judges [Choor Singh](/wiki/Choor_Singh) and A. V. Winslow found Harun guilty of robbery by night and sentenced him to 12 years' jail and 12 [strokes of the cane](/wiki/Caning_in_Singapore); Yasin was found guilty of murder and sentenced to death. Although Yasin's appeal against his sentence was rejected by the [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore) in November 1974, his appeal to the [Privy Council](/wiki/Judicial_Committee_of_the_Privy_Council) was accepted and he was sentenced to two years' jail for committing a rash/negligent act not amounting to [culpable homicide](/wiki/Culpable_homicide). However, Yasin was brought back to court again and promptly charged with rape. At the trial on 11 May 1977, Yasin denied raping Poon despite the forensic evidence presented by the prosecution and Harun's testimony against him. At the end of the trial on 12 May 1977, Yasin was found guilty of attempted rape and sentenced to eight years' imprisonment. - 9 August 1972: During the morning of Singapore's [National Day](/wiki/National_Day_of_Singapore), after a drinks session, at [Amoy Street](/wiki/Amoy_Street,_Singapore), 42-year-old wine shop owner [Chew Liew Tea](/wiki/Chew_Liew_Tea) was shot and killed by two [Penang](/wiki/Penang)-born [Chinese Malaysians](/wiki/Chinese_Malaysians) who tried to rob him. The two robbers - Neoh Bean Chye and Lim Kim Huat - fled to Penang, Malaysia following the crime, but they were both arrested by the Malaysian authorities and being sent back to Singapore, where they were charged with the murder of Chew Liew Tea. It was revealed in the trial that Lim was the one who used a revolver to shoot Chew to death and Neoh was the one who provided Lim with the fully loaded revolver prior to their robbery attempt; for this, it was argued by the prosecution that while it was not their plan to kill Chew, Lim fired the gun in furtherance of their common intention to commit robbery and Neoh should be held liable given they had premeditated using the gun to facilitate their crime and use violence if necessary. On 8 November 1973, the High Court's two judges - D. C. D'Cotta and [Choor Singh](/wiki/Choor_Singh) - accepted the prosecution's arguments and thus condemned both Neoh and Lim [to death](/wiki/Capital_punishment) for murder after rejecting the two men's defences of accidental shooting and lack of intention to cause death. Neoh and Lim were both hanged on 27 June 1975 following the dismissal of their appeals against the death penalty. - 17 September 1972: 22-year-old Malaysian citizen [Chan Chee Chan](/wiki/1972_Queenstown_shooting) was walking with her sister along [Queen's Circus](/wiki/Queenstown,_Singapore) on the way to her home in [Tanglin Halt](/wiki/Commonwealth,_Singapore) when she suddenly screamed and collapsed after being shot in the chest. She never regained consciousness and died in [Singapore General Hospital](/wiki/Singapore_General_Hospital). The bullet extracted from her wound was of .22 calibre. As of July 2021[update], the case remains unsolved. - 16 October 1972: 21-year-old Chelliah Silvanathan, alias Tampines Rajah, attacked and fatally stabbed his fellow gang member, 21-year-old [Arumugam Jayamani](/wiki/Arumugam_Jayamani) (alias Beatles Rajah), after they had a dispute over a gambling affair sometime prior to the murder. Chelliah was found guilty of murder and sentenced to hang in September 1973. Chelliah lost his appeals to the Singapore Court of Appeal and Privy Council, and after his clemency plea was rejected, Chelliah was hanged on 11 April 1975. - 24 November 1972: 32-year-old [Lim Ban Lim](/wiki/Lim_Ban_Lim), a gangster who killed 27-year-old police corporal Koh Chong Thye on 23 June 1968, was ambushed by police officers near Golden City Theatre in [Queenstown](/wiki/Queenstown,_Singapore). The officers shot Lim three times in his body in a firefight, killing him. Lim's right-hand-man, Chua Ah Kow, shot himself dead during a gunfight three weeks later at [Tank Road](/wiki/River_Valley,_Singapore). ### 1973 - 1 February 1973: 52-year-old [Karuppan Velusamy](/wiki/Murder_of_Karuppan_Velusamy), a one-armed jobless man, was brutally murdered while he was sleeping along a five-foot way street in Jalan Berseh. His killer, Ismail bin U. K. Abdul Rahman, was arrested less than a week after his death. Ismail confessed during investigations that he committed the murder due to a misunderstanding between him and the victim, but during his trial, Ismail denied in court that he was the perpetrator and put up a defence of alibi, claiming he was sleeping at his girlfriend's home at the time of the offence. Subsequently, the High Court found Ismail guilty of murdering Velusamy and sentenced him to death, after rejecting his alibi defence and accepting both his confession and the evidence of two men who saw or heard Ismail killing Velusamy. Ismail was hanged on 28 February 1975 after losing his appeal. - 15 September 1973: At a coffee shop in Bras Basah, 24-year-old vegetable seller [Tan Eng Kim](/wiki/Bras_Basah_coffeeshop_murder) was attacked and stabbed to death by 25-year-old seaman Pehn Kwan Jin, who sought revenge against Tan due to a previous dispute. During his trial, Pehn denied that he killed Tan out of vengeance and claimed that it was Tan who tried to attack him and he only acted in self-defence. On 28 May 1974, Justice T Kulasekaram and Justice Tan Ah Tah, the two trial judges of Pehn's case, found Pehn guilty of murdering Tan and sentenced him to death after rejecting his claims of self-defence. Pehn's appeals were all dismissed, and he was hanged on 16 April 1976. - 21 December 1973: On the night of 21 December 1973, nearby a Kampong Kapor community centre, 24-year-old crane driver [Ahora Murthi Krishnasamy](/wiki/Murder_of_Ahora_Murthi_Krishnasamy) was stabbed to death by a Malaysian labourer K. Vijayan Krishnan. Vijayan, who was charged and put on trial, put up a defence that he was gravely provoked into using a chopper to inflict 11 stab wounds on Murthi and thus caused Murthi's death. Vijayan was found guilty of murdering Murthi and sentenced to death in November 1974, after the High Court found that he intentionally killed Murthi and there was no provocation coming from Murthi prior to the chopper attack. Later, the Court of Appeal and Privy Council rejected Vijayan's appeals, and 23-year-old K. Vijayan Krishnan was hanged in [Changi Prison](/wiki/Changi_Prison) at dawn on 30 April 1976. ### 1974 - 2 April 1974: At the army camp on Portsdown Road, 19-year-old [National Serviceman](/wiki/National_service_in_Singapore) Liew Ah Chiew discharged his rifle and killed his 21-year-old platoon commander [Hor Koon Seng](/wiki/Hor_Koon_Seng), who died from a gunshot wound to the chest. Holding a lieutenant and driver hostage, Liew escaped to his girlfriend's workplace at a textile factory in Boon Keng before the girlfriend persuaded him to surrender to the police. Liew was charged with the murder the next day and after a trial lasting twelve days, Liew was found guilty of murder, and [sentenced to death](/wiki/Capital_punishment_in_Singapore) on 25 October 1974. Liew's appeals were dismissed and he was hanged on 28 November 1975. - 9 May 1974: 44-year-old Sim Joo Keow strangled her 53-year-old sister-in-law [Quek Lee Eng](/wiki/Murder_of_Quek_Lee_Eng) over S$2,000, before dismembering her body and keeping her torso in two earthen jars in her home. Quek's head and arms were found in a parcel near the [Kallang River](/wiki/Kallang_River). Sim was sentenced to 10 years in jail in January 1975 after being convicted of [culpable homicide](/wiki/Culpable_homicide) not amounting to murder and hiding evidence. - 6 June 1974: Secret society member and notorious gunman Chua Hung Peng, better known as Gia Kang, attempted to rob a finance company along Alexandra Road, holding a female employee at gunpoint. As the employee did not have enough cash, Chua forced her to withdraw the remaining amount from a bank at Orchard Road. The police were called and three police officers, including Detective Sergeant (Sgt) Anthony Low arrived at the office, and set up an ambush while waiting for Chua to return. Chua eventually showed up, recognised Sgt Low who had arrested him twice before, and fled the scene. The police gave chase, and Chua entered a nearby building, Block 148 Alexandra Road, to hide. While the police were searching the building, Chua ambushed Sgt Low at the thirteenth floor, snatched his service revolver, and held him at gunpoint. Chua shoved Sgt Low down the stairs, as they made their way down 13 storeys. Just before reaching the ground floor, Sgt Low managed to snatch back his service revolver. Chua pulled out his own gun and was about to open fire when Sgt Low fired three shots at him, killing Chua on the spot. - 11 to 26 August 1974: 22-month-old toddler [Eva Soh Ai-Mei](/wiki/Murder_of_Eva_Soh) died of unnatural causes in her flat in Holland Road, Singapore. She had suffered from multiple injuries over the few weeks before her death, including a ruptured spleen and liver. Her family's maidservant, Ng Cha Boo, who was believed to have abused Eva, was charged with murder. Ng was initially convicted and sentenced to death; she later successfully appealed her sentence, her murder charge was reduced to culpable homicide and she was re-sentenced to six years' imprisonment. - 17 September – 9 December 1974: The \"Botak\" gang, a notorious gang of six armed robbers from Malaysia, targeted two major jewellery shops at North Bridge Road and Arab Street respectively and in total, they reaped a loot of jewellery worth more than S$148,539 from both robberies. After committing the second firearm robbery, the Botak gang fled to Malaysia, where they were finally caught merely two days later. The gang's leader, Jamaluddin bin Abu Bakar, a Malaysian gunman and infamous fugitive wanted for murder, committed suicide by shooting himself in the left temple, while his remaining five accomplices were arrested and brought into custody. One of the five members, identified as a Malaysian soto seller [Talib Haji Hamzah](/wiki/Talib_Haji_Hamzah), was eventually extradited back to Singapore for trial. In October 1975, Talib became the first person to be sentenced to death under the Arms Offences Act for being an accomplice in a firearm offence, and after losing his appeal, Talib bin Haji Hamzah was hanged at the age of 23 on 28 January 1977. - 6 October 1974: 37-year-old Vartharajoo Krishnasamy, a port labourer, was found dead alongside Clementi Road near Kent Ridge university complex. It was ascertained that the death may be related to gang violence. At the time of his death, Vartharajoo left behind a wife, his elderly mother, and four children, including a son Rajoo Mani who most recently appealed to the public for information about his father's death in 2021. As of July 2021, Vartharajoo's killer(s) were never caught. - 16 November 1974: Late at night in a [shophouse](/wiki/Shophouse) from [Serangoon Road](/wiki/Serangoon), 59-year-old Nadarajah Govindasamy had brutally murdered 29-year-old [Mohamed Azad s/o Mohamed Hussein](/wiki/Mohamed_Azad_s/o_Mohamed_Hussein), the fiancé of his youngest daughter Deva Kumari. When Azad's body was found, there are seven fatal wounds on his head. Nadarajah was later arrested and charged with murder. Before the tragic events, Nadarajah was disapproving of Azad as his son-in-law because Azad was an Indian [Muslim](/wiki/Muslim) while Nadarajah and his family were [Hindus](/wiki/Hindus), only gave in a month after first meeting him. On 20 August 1975, after deliberating over the evidence and submissions from both sides, both the [High Court](/wiki/High_Court_of_Singapore) judges – Justice [Choor Singh](/wiki/Choor_Singh) and Justice Frederick Arthur Chua (also known as Justice F. A. Chua) – determined that Nadarajah had intended to cause death from the 7 fatal wounds found on Azad's head, therefore they both rejected Nadarajah's defence of sudden and grave provocation, found him guilty of murder and sentenced him to death. Nadarajah's appeal was dismissed on 17 February 1976 and he was hanged on 28 January 1977. - 29 November 1974 to 11 January 1975: Within a three-month crime spree, Singaporean seaman [Sha Bakar Dawood](/wiki/Sha_Bakar_Dawood) (alias Bakar Negro) committed a total of six firearm robberies, and he also shot his victims, who all survived. In his sixth and latest robbery to date, Sha Bakar shot and wounded three people - 26-year-old brothel owner Wong Meng Seng, 78-year-old caretaker Tan Tai Meng and a prostitute Soyah Mohammed Ali - at a brothel and then opening fire at police at Thiam Siew Avenue. After escaping the scene with the S$305 he forcibly taken from the three victims, Sha Bakar fled to Malaysia but was caught 16 days later by the [Royal Malaysia Police](/wiki/Royal_Malaysia_Police), and extradited back to Singapore for trial. Sha Bakar was found guilty of five counts of discharging a firearm to cause injury, and sentenced to death on 2 September 1975, and after losing his appeals, Sha Bakar was hanged on 3 September 1976 in [Changi Prison](/wiki/Changi_Prison); he was 38 years old at the time of his execution. - 5 December 1974: Along Kramat Road near Orchard Road, 22-year-old [Wong Thng Kiat](/wiki/Wong_Thng_Kiat), the operator of a call-girl syndicate, was stabbed to death during a dispute between himself, his girlfriend and a couple. The killer, identified as 21-year-old Tay Eng Whatt, was arrested and charged with murder. Tay was found guilty of murdering Wong and sentenced to death in July 1976, and after he lost his appeals to both the Court of Appeal in Singapore and Privy Council in London, Tay was hanged on 29 June 1979. ### 1975 - 25 May 1975: 54-year-old Mohamad Kunjo s/o Ramalan murdered his 54-year-old friend, Arumugam Arunachalam, by hitting him on the head with an exhaust pipe at [Pulau Saigon Road](/wiki/Pulau_Saigon). Kunjo was later arrested and charged with murder. Both men were intoxicated at the time of the killing. Forensic pathologist Seah Han Cheow, who performed an autopsy on the body, discovered a high level of alcoholic content inside the victim's blood, leading him to raise a possibility of acute alcoholic poisoning that might have contributed to Arunachalam's death. Kunjo, who raised a defence of intoxication at the time of the commission of the offence, was found guilty of murder and sentenced to death in 1976. After losing his appeals against the death sentence within the next two years, Kunjo filed for clemency through his lawyer in January 1978. Two months later, on 26 March 1978, a Malay newspaper article reported that President [Benjamin Sheares](/wiki/Benjamin_Sheares) accepted the clemency petition, and as a result, Kunjo's death sentence was commuted to [life imprisonment](/wiki/Life_imprisonment). Kunjo was reportedly the first person to receive a presidential pardon from the death sentence since Singapore gained independence in 1965. - July 1975: Four serial robbers – 40-year-old Suhaymi Harith, 39-year-old Khalil Mohammed Dol, 45-year-old Wassan Sakeebun, and 47-year-old Wagiman Abdullah – were found guilty of their crimes and sentenced by district judge E. C. Foenander to a total of 64 years in jail and 144 [strokes of the cane](/wiki/Caning_in_Singapore). All four had pleaded guilty to 228 charges of housebreaking, robbery and theft committed between 5 January 1973 and 13 June 1975. They were known as the \"Swimming Trunks Gang\" because they committed the crimes while they were dressed in only swimming trunks. - 18 December 1975: Bobby Chung Hua Watt was approached by his sister, Patsy Chung, to help her settle marital issues with her abusive and unfaithful husband, Lim Hong Chee. Chung went to his sister's flat in [Chai Chee](/wiki/Chai_Chee) to confront Lim. The confrontation turned violent after Lim and his two brothers treated Chung with disrespect and contempt; Chung killed 23-year-old Lim Hong Kai, one of Lim's two brothers. He was later arrested and charged with murder. In November 1976, Chung, who was married with two daughters before the crime, was found guilty of murder and sentenced to death. He lost his appeal to the [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore), and was scheduled to be hanged on 18 January 1980. However, on 15 January 1980, a 26-year-old Chung received news that his petition to President [Benjamin Sheares](/wiki/Benjamin_Sheares) for clemency had been accepted. As a result, Chung's death sentence was commuted to [life imprisonment](/wiki/Life_imprisonment). After serving at least two-thirds of his life sentence, Chung was released from prison in May 1993 for good behaviour. ### 1976 - 23 January 1976: At a bar in Jalan Besar, two males patrons of the bar got into a fight that resulted in one of them using a knife to stab the other to death. The victim, 46-year-old [Madikum Puspanathan](/wiki/Madikum_Puspanathan), died as a result of a knife wound to the heart. The killer, 23-year-old Malaysian Visuvanathan Thillai Kannu, fled to Malaysia after the killing but he was arrested and charged with murder. In November 1976, Visuvanathan was found guilty of murdering Madikum and sentenced to hang. Visuvanathan lost his appeal in January 1978 and he was hanged on 25 May 1979. - 3 September 1976: 30-year-old [Low Hong Eng](/wiki/Low_Hong_Eng), a seamstress and mother of four, was arrested alongside her accomplice, 30-year-old Malaysian illegal taxi driver Tan Ah Tee (alias Tan Kok Ser), for trafficking 459.3g of diamorphine (or pure heroin) at Dickson Road, [Jalan Besar](/wiki/Jalan_Besar). Low and Tan were found guilty and sentenced to hang on 22 September 1978; Low became the second woman to be given the death penalty for drug trafficking since 1975. After losing her appeals, Low and Tan were both hanged on 9 October 1981. - 18 October 1976: On the evening of 18 October 1976, at a paint shop in Singapore's Balestier Road, two armed robbers - [Chang Bock Eng and Tay Cher Kiang](/wiki/1976_Balestier_Road_shooting) - held a total of three people hostage in an attempt to commit armed robbery, and during the holdup, Chang, who wielded a revolver, engaged in a gunfight with the police, injuring a police constable named Neo Koon San. One of the hostages was also hurt. Both Chang and Tay were subsequently arrested and charged under the Arms Offences Act for the unauthorized use of firearms, and they were both given the death penalty in August 1977. Both Chang and Tay were hanged on 9 May 1980. - 12 December 1976: At Margaret Drive Hawker Centre in [Queenstown](/wiki/Queenstown,_Singapore), after having a dispute over the cleaning of tables, 35-year-old roast pork hawker [Haw Tua Tau](/wiki/Haw_Tua_Tau) violently attacked 24-year-old Phoon Ah Leong and his 56-year-old mother Hu Yuen Keng, stabbing the both of them to death with a bearing scrapper. After his arrest at [Singapore General Hospital](/wiki/Singapore_General_Hospital), Haw was charged with the double murder and sentenced to death in March 1978, after the trial court rejected his \"untenable\" defence of accidental stabbing and himself not knowing he was armed. Haw was hanged in 1982 after his appeals to both the [Singaporean Court of Appeal](/wiki/Court_of_Appeal_of_Singapore) and [Privy Council](/wiki/Judicial_Committee_of_the_Privy_Council) in [London](/wiki/London) were all dismissed. ### 1977 - 6 May 1977: 18-year-old Siti Aminah binte Jaffar and 25-year-old Anwar Ali Khan were caught trafficking 43.5 grams of [diamorphine](/wiki/Heroin), which exceeds the 15 grams that would lead to a death sentence under Singapore law. After both of them were sentenced to death in August 1978, they appealed to President [Devan Nair](/wiki/Devan_Nair) for clemency. The President rejected Anwar's plea so Anwar was eventually hanged in 1983. Siti was granted presidential clemency so her death sentence was commuted to [life imprisonment](/wiki/Life_imprisonment). - 10 November 1977: Seven-year-old [Usharani Ganaison](/wiki/Usharani_Ganaison), the youngest of three daughters in her family, went missing after she last departed her home to buy drinks for the family guests to celebrate [Deepavali](/wiki/Deepavali). However, she never came back and was reported missing. She was found dead the next morning nearby her flat, with signs of being sexually assaulted and strangled to death. A denture mark on the body was later matched to Usharani's uncle Kalidass Sinnathamby Narayanasamy, a 23-year-old lance corporal of the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces), who admitted to molesting the girl but he denied that he intentionally killed her. Nonetheless, he was arrested and charged with the murder of his niece. Kalidass was sentenced to death on 27 March 1980 and lost his appeal on 17 May 1982, and he was eventually hanged. - 25 November 1977: Ten-year-old [Cheng Geok Ha](/wiki/Cheng_Geok_Ha) (钟玉霞), the youngest of twelve children in her family, went missing after she was last seen playing in her Chai Chee neighbourhood with her two [Malay](/wiki/Malay_People) friends. According to the Malay brother-sister pair, they last saw Geok Ha after they ended their game and went back home for mealtime. Despite appeals for information after filing a missing persons report, Geok Ha was found dead on 7 December 1977, when a group of four Malay youths playing ball nearby detected a decomposing smell and discovered her body in a manhole, where it was wrapped inside a gunny sack. The police later questioned the neighbours, and arrested one of them: 41-year-old labourer Quek Kee Siong (郭祺祥). Quek, a family friend of the Cheng family, was charged with murder after admitting that he strangled Geok Ha out of accident. However, forensic pathologist [Chao Tzee Cheng](/wiki/Chao_Tzee_Cheng) revealed in Quek's 1979 murder trial that the girl was being intentionally strangled due to extensive fractures on her ribs and neck, and she was also being sexually assaulted before her death. Quek was found guilty of murder, and sentenced to death on 6 March 1979. Quek lost his appeal on 17 November 1980, and he was eventually hanged. A 2005 crime documentary revealed that Geok Ha's mother, who never truly get over her youngest child's death, died several years after her daughter's murder, and after Quek's execution, one of Cheng's elder sisters Cheng Siok Ngee found solace in Buddhist religion and came to forgive Quek despite hating him initially. ### 1978 - 25 April 1978: 18-year-old policeman [Lee Kim Lai](/wiki/Lee_Kim_Lai) was abducted by three men – 20-year-old Ong Hwee Kuan, 20-year-old Yeo Ching Boon and 20-year-old Ong Chin Hock – from his sentry post at [Mount Vernon](/wiki/Mount_Vernon,_Singapore) and forced into a taxi. They killed him along with the taxi driver, 60-year-old Chew Theng Hin, and took his [revolver](/wiki/Smith_%26_Wesson_Model_36). On the same night, a police officer, Siew Man Seng, had seen Ong Hwee Kuan and Yeo behaving suspiciously around the area where they had abandoned the taxi. He went out of his car, chased the two men and managed to arrest Ong Hwee Kuan and bring him in for questioning. At the same time of Ong Hwee Kuan's arrest, Lee's body was found inside the abandoned taxi with 15 stab wounds on his body. Later on, the next day, Chew's body was also found in a drain, further linking Ong Hwee Kuan to the double murder. Yeo was later arrested in his flat and the revolver was recovered, together with some bullets. Ong Chin Hock surrendered himself soon after. The three men were eventually convicted of murder on 23 May 1979 and sentenced to death. They were hanged on 24 February 1984. - 20 August 1978: [Five social escorts](/wiki/1978_disappearance_of_Singapore_social_escorts) – 24-year-old Diana Ng Kum Yim and four Malaysians – 22-year-old Yeng Yoke Fun, 22-year-old Yap Me Leng, 19-year-old Seetoh Tai Thim, and 19-year-old Margaret Ong Guat Choo – were last seen boarding a cargo ship for a party together with three \"Japanese\" men by a boatman. The five women have gone missing since then and there has been no trace of their whereabouts. Before the mysterious disappearance, the employer of the five women had been approached by one of the three men, who only introduced himself as Wong. Wong, who claimed to be a businessman from [Hong Kong](/wiki/Hong_Kong), asked for the five women's services. He had brought them to shopping, expensive meals and entertainment. This lasted nine days before the fateful day when Wong invited the women to attend a party on a ship with two associates from Japan. Police investigations showed that Wong's identity, as well as those of his two associates, were fake. Recent theories suggest that North Korea was involved in this matter since there were incidents of North Korean agents abducting citizens from other countries in the same year the five women went missing. Furthermore, in 2005, [Charles Robert Jenkins](/wiki/Charles_Robert_Jenkins), a [United States Army](/wiki/United_States_Army) deserter who entered North Korea in 1965, claimed that he had seen one of the five women, Yeng, in an amusement park in [Pyongyang](/wiki/Pyongyang) in 1980 or 1981. However, despite the renewed interest, there is still no evidence to substantiate this claim. The five missing women were never found. ### 1979 - 6 January 1979: In a case known as the [Geylang Bahru family murders](/wiki/Geylang_Bahru_family_murders), four siblings – ten-year-old Tan Kok Peng, eight-year-old Tan Kok Hin, six-year-old Tan Kok Soon and five-year-old Tan Chin Nee – were found brutally slashed to death in their flat in [Geylang Bahru](/wiki/Geylang). As of July 2021[update], the case remains unsolved. - 16 June 1979 – 16 October 1979: In different locations across Singapore, 25-year-old [Vadivelu Kathikesan](/wiki/Vadivelu_Kathikesan_murders) had murdered two men - 61-year-old watchman Abdul Rahiman Adnan (16 June 1979) and 54-year-old cigarette-seller Mohamed Dawood Abdul Jaffar (16 October 1979) - during separate robbery bids. Vadivelu was wanted by the police for the second killing and arrested in [Ipoh](/wiki/Ipoh) five months after he killed Mohamed Dawood. After his extradition, Vadivelu was charged in court for both the murders and subsequently placed on trial for solely the murder of Mohamed Dawood while the other charge of killing Abdul Rahiman was temporarily withdrawn. In the end, Vadivelu was found guilty of murdering Mohamed Dawood and sentenced to death in March 1982. Vadivelu was eventually hanged sometime after losing his appeal in January 1983. - 29 November 1979: Yong Kwee Kong and Lim Kok Yew, both Malaysian armed robbers and fugitives wanted by both Malaysian and Singaporean police, took three people hostage while exchanging fire with police during the [Tiong Bahru bus hijacking](/wiki/Tiong_Bahru_bus_hijacking), which ended with a wounded Yong committing suicide on the bus and Lim surrendering to the police. He was later hanged for being an accomplice of a person who uses arms while committing a scheduled offence, contrary to Section 5 of the [Arms Offences Act](/wiki/Arms_Offences_Act). ## 1980s ### 1980 - 25 July 1980: 16-year-old student [Ong Ai Siok](/wiki/Ong_Ai_Siok), alias Goh Luan Kheng, who stayed at home to study overnight while her adoptive parents went out for supper, was murdered by her relative Lau Ah Kiang, who was 25 years old and facing financial trouble, which led to Lau committing the murder with the intention to commit robbery. Lau was arrested four days later and it took six years before he was finally brought to trial for Ong's murder. Although Lau confessed to the murder, he denied that he was involved in the robbery but after due consideration, the judges [T. S. Sinnathuray](/wiki/T._S._Sinnathuray) and Abdul Wahab Ghows accepted the trial prosecutor [Lawrence Ang](/wiki/Lawrence_Ang)'s arguments and hence found Lau guilty of murder, and sentenced him to death on 21 February 1986. - 23 September 1980: 23-year-old babysitter [Chia Chun Fong](/wiki/Chia_Chun_Fong) was attacked by a family friend, who stabbed her in the mouth while attempting to rob her. Chia died from the stabbing while the perpetrator managed to make off with some jewellery stolen from Chia's terrace house in Opera Estate. The robber, identified as Tan Cheow Bock, remained at large for seven years before he was arrested in Malaysia for stealing cars, and he was extradited to Singapore for trial in May 1987. Tan was subsequently convicted of murder in September 1990 and sentenced to death. Tan's appeal was dismissed a year later in September 1991 and he was eventually hanged on an unknown date. - 3 October 1980: Police Constable Nawi bin Saini and another policeman spotted 25-year-old Malaysian national Seow Lam Seng and his accomplice, 30-year-old Lee Ah Fatt, loitering suspiciously just metres away from a bank along [Tanjong Katong Road](/wiki/Katong). When the duo were searched and screened, Lee allegedly drew a pistol and pointed it at the policemen. Nawi then drew his [revolver](/wiki/Smith_%26_Wesson_Model_2) and fired three shots at Lee. Lee continued to struggle with the policemen even though he had been shot; Seow took advantage of the distraction to escape, discarding the pistol as he fled. Lee succumbed to his injuries in hospital, while Seow fled to Malaysia and was on the run for 38 years. On 22 March 2018, a 63-year-old Seow was nabbed in [Penang](/wiki/Penang) by the [Royal Malaysia Police](/wiki/Royal_Malaysia_Police) and extradited to Singapore two days later. On 26 March 2018, he was charged with unlawful possession of a firearm. If found guilty, Seow would be sentenced to mandatory life imprisonment. However, on 20 May 2018, according to the police as reported by a Chinese newspaper, Seow, who confessed to his crime during police investigations, died from an illness while in remand before he could be tried for his arms charge. - 2 November 1980: At a fishing port located in Jurong, 16-year-old fishery employee [Teo Keng Siang](/wiki/Teo_Keng_Siang) and 31-year-old fish dealer [Lee Cheng Tiong](/wiki/Lee_Cheng_Tiong), were killed inside Lee's office by an unknown group of assailants. Two years later, a 22-year-old Malaysian named Beh Meng Chai was arrested shortly after he arrived at Singapore after a breakthrough in police investigations. Beh confessed that he and two others were involved in robbing and killing the victims and gave away the names of his accomplices, who all ran off to Malaysia after the killings. One of them, 21-year-old Sim Min Teck, was arrested in Kuantan, Malaysia in July 1983 and sent back to Singapore to be charged with murder. Beh, who fully cooperated with the police and expressed his willingness to testify against Sim, had his charges reduced to culpable homicide and he was sentenced to life imprisonment and 24 strokes of the cane on 8 October 1984. Sim, on the other hand, was found guilty of the two original charges of murder and thus sentenced to death on 27 March 1985. Sim lost his appeal on 7 July 1986, and he was eventually hanged. As of today, the third and final suspect Chng Meng Joo remained on the run for killing the two victims. - 19 November 1980: At a kampung in Jalan Petua, Jurong Road (now known as [Bukit Batok](/wiki/Bukit_Batok)), eight-year-old schoolgirl [Goh Beng Choo](/wiki/Murder_of_Goh_Beng_Choo) was found dead behind the kampung's Taoist temple. Goh's then-ten-year-old brother Leng Hai last saw her on the road in front their house as he went to buy noodles for his family, and she went missing for a few hours before her body was found on that same night. The cause of death was a ruptured liver, resulting from blows to the abdomen. Goh was also sexually assaulted prior to her death. The Goh family put up a reward of S$10,000 for information leading up to the arrest and conviction of Beng Choo's murderer. 41 years later, Goh's brother and elderly parents (still alive in their eighties) once again made a public appeal for information to help solve the case. As of 2022, the murderer(s) of Goh Beng Choo remains undiscovered. ### 1981 - 25 January and 7 February 1981: In a case known as the [Toa Payoh ritual murders](/wiki/Toa_Payoh_ritual_murders), 39-year-old Adrian Lim, a self-professed [medium](/wiki/Mediumship), and his two accomplices – 26-year-old Catherine Tan Mui Choo and 25-year-old Hoe Kah Hong – kidnapped, tortured and killed two children – nine-year-old Agnes Ng Siew Heok and ten-year-old Ghazali bin Marzuki – purportedly as blood sacrifices in a ritual in Lim's flat in [Toa Payoh](/wiki/Toa_Payoh). On 25 May 1983, all three of them were found guilty of murder and sentenced to death by [High Court](/wiki/High_Court_of_Singapore) judges [T. S. Sinnathuray](/wiki/T._S._Sinnathuray) and F. A. Chua. They were hanged on 25 November 1988. - 20 September 1981: 22-year-old Ramu Annadavascan and 16-year-old Rathakrishnan Ramasamy took turns to assault 45-year-old [Kalingam Mariappan](/wiki/Kalingam_Mariappan) with a rake at [East Coast Parkway](/wiki/East_Coast_Parkway) after an argument between Ramu and Kalingam. Due to the injuries, Kalingam lost consciousness and collapsed. Ramu and Rathakrishnan then set him on fire, causing him to be burned to death. Both of them were later arrested and found guilty of murder in July 1984. Ramu was sentenced to death and hanged on 19 September 1986, while Rathakrishnan, who was under the age of 18 when he committed the murder, was indefinitely detained under [the President's Pleasure](/wiki/The_President%27s_Pleasure_(Singapore)). After serving nearly 20 years in prison, Rathakrishnan was released in September 2001. - 6 November 1981: 31-year-old Goh Siew Foon was shot from behind by 31-year-old Chin Sheong Hon, who used a revolver to injure Goh and stole her suitcase containing $92,000 of cash and cheques. Goh was seriously wounded and was hospitalized for 45 days and she survived. Chin, who also attacked and robbed Ee Chong Leong and Chua Boon Leong in July and October 1981 respectively, fled Singapore soon after, and he spent 32 years hiding in [Thailand](/wiki/Thailand). Chin was finally arrested in 2013 and repatriated to Singapore after completing his jail term in [Bangkok](/wiki/Bangkok) for joining an illegal \"red shirt\" protest, but in 2015, Chin was assessed mentally unfit to stand trial, leading to suspension of court proceedings and Chin's indefinite detention at the [Institute of Mental Health](/wiki/Institute_of_Mental_Health_(Singapore)) (IMH) from 2015 to 2021. On 15 November 2022, 72-year-old Chin Sheong Hon pleaded guilty to robbing and harming Goh with a firearm, as well as the two other robberies of Ee and Chua. After receiving the defendant's guilty plea, Justice Pang Khang Chau rejected the prosecution's request for [life imprisonment](/wiki/Life_imprisonment_in_Singapore) (which would mean a term of 20 years due to the offences having taken place 16 years before [the 1997 Abdul Nasir appeal](/wiki/Oriental_Hotel_murder#Abdul_Nasir's_kidnapping_trial_and_landmark_appeal)) and instead sentenced Chin to 18 years' imprisonment. Goh, who was interviewed in 2015, revealed that even after many years, she was still traumatized but when asked about Chin's capture, Goh stated she found closure by thinking \"heaven is fair and that people who commit crimes will receive their punishment.\" ### 1982 - 6 October 1982: Ng Beng Kee and his accomplice Tan Hock Bin were arrested with 27.3 kg of heroin in the car park of the Apollo Hotel in [Havelock Road](/wiki/Bukit_Ho_Swee). It was believed the drugs were smuggled into Singapore by speedboat and were due to be brought to [Hong Kong](/wiki/Hong_Kong) via ship, and Singapore was not the final destination. Central Narcotics Bureau agents had been investigating the syndicate for over six months before they moved in to make an arrest. During their trial in 1985, Deputy Public Prosecutor Michael Khoo stated Ng and Tan were arrested after moving 20.4 kg of pure heroin, with an estimated street value of over $32 million, from [Bukit Panjang](/wiki/Bukit_Panjang) village to the car park of the Apollo Hotel in Havelock Road. This was by far the largest amount of heroin ever seized by Singaporean authorities up until that date in time. Taking the stand in his own defence, Ng admitted he was a member of an international drugs syndicate and that the heroin seized on the day in question belonged to him. Ng also claimed he was due to receive a commission of HK$8 million if he succeeded in smuggling the approximately 27 kg of heroin to Hong Kong. Ng and Tan were both found guilty as charged and sentenced to death, and were hanged on 26 May 1989. ### 1983 - 28 March 1983: At a flat in [Ang Mo Kio](/wiki/Ang_Mo_Kio), two drug addicts - 30-year-old [Michael Tan Teow](/wiki/Michael_Tan_Teow) and 26-year-old [Lim Beng Hai](/wiki/Lim_Beng_Hai) - armed themselves with knives and attacked Tan's 28-year-old landlady, a housewife named Soh Lee Lee, and killed her. The men also stabbed Soh's two children three-year-old Jeremy Yeong Yin Kit and two-year-old Joyce Yeong Pei Ling to death. Both men, who also stole some items from the flat, were arrested within a month, and charged with murder. The men were sentenced to hang on 10 April 1985 and lost their appeals, but Tan committed suicide by drug overdose in May 1990, leaving only Lim to remain on death row for five more months before he was hanged on 5 October 1990 for the three murders. - 30 June and 23 July 1983: In a case known as the [Andrew Road triple murders](/wiki/Andrew_Road_triple_murders), 19-year-old Sek Kim Wah broke into the home of 61-year-old Robert Tay Bak Hong at [Andrew Road](/wiki/Caldecott_Hill) on 23 July with the aid of a Malaysian national, 19-year-old Nyu Kok Meng. They were armed with a [M16S1 assault rifle](/wiki/M16_rifle#M16S1) which Sek had stolen from [Nee Soon Camp](/wiki/List_of_Singapore_Armed_Forces_bases). All five victims – Tay, 45-year-old Annie Tay (Tay's wife), 12-year-old Dawn Tay (the Tays' daughter), 27-year-old Jovita S. Virador (the Tays' Filipino domestic helper), and Tang So Ha (Dawn's private tutor) – were confined in a bedroom. Sek and Nyu robbed the Tay family of their jewellery and made them cash out money from their bank accounts. Sek murdered the Tay couple and Virador one-by-one while Nyu was guarding the others in another room. When Nyu found out about the murders, he took the rifle with him into a bedroom and locked the door. Sek tried to get Nyu to open the door but Nyu refused, so Sek fled. Nyu then released Dawn Tay and Tang before fleeing to Malaysia. On 29 July 1983, Sek was arrested at his sister's home, where he attempted suicide while the police were closing in on him. Prior to the Andrew Road murders, Sek had strangled two other victims – 42-year-old Lim Khee Sin and 32-year-old Ong Ah Hong – at [Marine Parade](/wiki/Marine_Parade) in June 1983 and disposed of their bodies near [Seletar Reservoir](/wiki/Seletar_Reservoir). During the trial, Sek said that he was inspired by the outlaw [Lim Ban Lim](/wiki/Lim_Ban_Lim) and had always wanted to die on the gallows. On 14 August 1985, [High Court](/wiki/High_Court_of_Singapore) judges [Lai Kew Chai](/wiki/Lai_Kew_Chai) and Abdul Wahab Ghows found Sek guilty of murder and sentenced him to death; Sek was eventually hanged on 9 December 1988. Nyu, who surrendered to the [Royal Malaysia Police](/wiki/Royal_Malaysia_Police), was extradited to Singapore to stand trial. He was acquitted of murder but charged with armed robbery and sentenced to life imprisonment and six [strokes of the cane](/wiki/Caning_in_Singapore). - 24 October 1983: 24-year-old housewife [Khor Gek Hong](/wiki/Murder_of_Khor_Gek_Hong) was attacked and stabbed to death by her lover along [Kim Seng Road](/wiki/Kim_Seng_Road), Singapore. Khor's lover, 31-year-old welder Wong Foot Ling surrendered himself two days after the fatal stabbing, and he was charged with murder. During Wong's trial, it was revealed that Wong was angered at Khor choosing to return to her husband rather than continuing their relationship with one another, and it caused Wong to commit the murder. Wong was found guilty of murder and sentenced to death by hanging in August 1984. Wong's appeal was dismissed and he was hanged on 19 September 1986. - 31 October 1983: 23-year-old [Teo Boon Ann](/wiki/Teo_Boon_Ann) brutally murdered 66-year-old Chong Kin Meng in her home while planning to commit robbery. Tracing the fingerprints from a wedding card found at the crime scene, the police tracked down and arrested Teo, who was charged with murder. During his trial, Teo claimed that he had tried to rob Chong, but she had turned aggressive and attacked him, so he had acted in self-defence and unintentionally caused her to die. However, the evidence showed that Teo had tried to convince his girlfriend to assist him in the robbery and he had told her to murder Chong if their plot was discovered, and from the pathologist [Chao Tzee Cheng](/wiki/Chao_Tzee_Cheng)'s autopsy results, the severe injuries found on the victim and lack of defensive wounds on Teo showed that there was no way Chong could be the aggressor and her injuries were not inflicted by Teo in self-defence. Teo was thus found guilty of murder by the two trial judges - Justice [Punch Coomaraswamy](/wiki/Punch_Coomaraswamy) and [Judicial Commissioner](/wiki/Judicial_Commissioner) [Chan Sek Keong](/wiki/Chan_Sek_Keong) - and he was sentenced to death on 3 February 1987. Teo lost his appeal on 15 August 1988 and was eventually hanged on 20 April 1990. ### 1984 - 27 July 1984: 74-year-old provision shop owner [Packiria Pillai Krishnasamy](/wiki/Murder_of_Packiria_Pillai_Krishnasamy) was stabbed to death inside his home at Tah Ching Road. Between August 1984 and January 1986, two Malaysian men were arrested for his murder, and it was alleged that one of them used a letter-opener to fatally stabbed Packiria while the other restrained him during the stabbing. Both the two men, Ramachandran Suppiah and Krishnan Varadan, were found guilty of murdering the old man and sentenced to death in May 1987. Although the two men lost their appeals in 1991, their second appeal led to the acquittal of Ramachandran, after the Court of Appeal ordered a re-hearing and found lack of proof to show that Ramachandran had taken part in the robbery and murder of Packiria, and acquitted of murder in October 1992, leaving only Krishnan, who admitted to stabbing the victim, to remain on death row for the murder. After spending seven years on death row, Krishnan was hanged on 15 April 1994 at [Changi Prison](/wiki/Changi_Prison); he was then the longest-serving death row inmate in Singapore. - 30 July 1984: 31-year-old [Khor Kok Soon](/wiki/Khor_Kok_Soon) and his accomplice, Toh Huay Seow, were looking for victims to rob in [Shenton Way](/wiki/Shenton_Way) when they were ambushed by police. Toh was arrested while Khor managed to escape. During the escape, Khor fired three shots at 43-year-old police sergeant Lim Kiah Chin, who managed to dodge the gunshots, before getting onto a lorry. Khor then forced the lorry driver, 25-year-old Ong King Hock, to drive him away before killing him and abandoning the lorry in an alley. He escaped to Malaysia and was arrested on 27 December 2003 in [Johor](/wiki/Johor) before he was extradited to Singapore to face charges. During the trial, Khor denied killing Ong and maintained that he never intended to harm anyone even though he used a firearm. On 25 February 2005, [High Court](/wiki/High_Court_of_Singapore) judge [Kan Ting Chiu](/wiki/Kan_Ting_Chiu) gave Khor a discharge not amounting to an acquittal for Ong's murder, but sentenced him to death for unlawfully discharging a firearm thrice. Khor appealed to the [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore) but his appeal was dismissed on 26 September 2005 and he was eventually hanged. - 4 September 1984: 27-year-old Neo Man Lee murdered 30-year-old Lim Chiew Kim (Judy Quek) in the women's bathroom outside the swimming pool of the condominium she was living in. He was arrested three weeks later and charged with murder. However, after he was found to be suffering from [schizophrenia](/wiki/Schizophrenia) and that he had a relapse on the night he killed Lim, the original charge of murder was reduced to one of [culpable homicide](/wiki/Culpable_homicide) not amounting to murder. On 25 May 1989, Neo was found guilty of culpable homicide not amounting to murder and sentenced to [life imprisonment](/wiki/Life_imprisonment). - 24 October 1984: 39-year-old [American Express](/wiki/American_Express) banker [Frankie Tan Tik Siah](/wiki/Murder_of_Frankie_Tan) was found murdered by strangulation. His wife, 50-year-old Lee Chee Poh, confessed that she had plotted with Tan's adoptive brother, 41-year-old Vasavan Sathiadew, and three Thai nationals – 42-year-old Phan Khenapin (also spelt Phan Khenapim), 21-year-old Wan Pathong (also spelt Wan Phatong), and a third accomplice known as \"Ah-Poo\" (real name Buakkan Vajjarin) – to murder Tan. The police managed to arrest Lee, Sathiadew, Phan and Wan but Ah-Poo, who escaped Singapore to Thailand after committing the crime, was not caught. Meanwhile, the four conspirators of Tan's murder were all charged with murder. During Lee's trial in 1988, it was revealed that Tan had affairs with other women, including Sathiadew's wife. Lee's charge of murder was reduced to abetment of [culpable homicide](/wiki/Culpable_homicide) not amounting to murder, and she was sentenced to seven years' imprisonment on 17 October 1988, with her jail term backdated to the date of her arrest. Sathiadew, Phan and Wan, who all stood trial in a separate court in July 1989, claimed that they only wanted to beat up Tan, and that it was \"Ah-Poo\" who strangled Tan. Sathiadew's defence of [diminished responsibility](/wiki/Diminished_responsibility) was corroborated by his daughter's testimony. [High Court](/wiki/High_Court_of_Singapore) judges [Joseph Grimberg](/wiki/Joseph_Grimberg) and [T. S. Sinnathuray](/wiki/T._S._Sinnathuray) rejected the three men's defences based on the evidence, found them guilty of murder on 6 October 1989, and sentenced them to death. They were hanged on 23 October 1992. Lee was subsequently released from prison on parole in June 1989 after serving her jail term with good behaviour. As of July 2021[update], \"Ah-Poo\" is still at large. - 2 November 1984: In front of a witness, 28-year-old [Hensley Anthony Neville](/wiki/Hensley_Anthony_Neville) killed 19-year-old Lim Hwee Huang by throwing her off to her death, and evidence showed that he had allegedly raped Lim before killing her. After being on the run for more than two years, Neville was arrested in Malaysia in 1987; he was also suspected of killing two more people in 1986 while hiding at the Malaysian state of [Selangor](/wiki/Selangor). He was extradited from [Kuala Lumpur](/wiki/Kuala_Lumpur) to Singapore on 18 March 1987, and later found guilty of murder on 22 November 1990, and sentenced to death. He lost his appeal on 12 November 1991. According to a 1992 Crimewatch episode, it was revealed that Neville was hanged on 28 August 1992, nine months after his appeal was dismissed. - 9 November 1984: At the Sea View Hotel in Amber Road, 26-year-old Gan Thian Chai was attacked and allegedly killed before being thrown to his death from the balcony. There were evidence of gambling found in Gan's hotel room, implying that the murder was due to possible money disputes. Two years later, one 43-year-old Singaporean suspect by the name of Tham Kwok Wah (alias Tham Kok Wah; born 7 October 1943) was placed on the police's wanted list for his suspected involvement in Gan's alleged murder. However, Tham had changed his name to Tham Kwok Theng and fled Singapore to Australia since 1986 by the time the police established his identity. Tham hid in Australia, where he faked his Australian citizenship, for 32 years before he was finally caught in 2018, with his false identity exposed and him being charged in the courts of Australia for identity fraud and falsely claimed pension benefits, which alerted the Singapore authorities to Tham's presence. Tham is currently serving six years and nine months in jail since January 2020 for his identity fraud offences, and the Singapore authorities requested his extradition, but Australia has a law which decreed that anyone facing the death penalty in whichever foreign countries will not face extradition, unless there is assurance that the person would not receive it or be executed. Since January 2021, the Singapore authorities are currently working with the Australian police to facilitate investigations in the unsolved murder of Gan Thian Chai, as well as to discuss about Tham Kwok Wah's possible extradition. - 12 December 1984: In a case known as the [\"curry murder\"](/wiki/Death_of_Ayakannu_Marithamuthu), 34-year-old Ayakanno Marithamuthu, a caretaker at the [PUB](/wiki/Public_Utilities_Board_(Singapore))-run holiday chalets in [Changi](/wiki/Changi), was reported missing. He was allegedly bludgeoned to death in the [Orchard Road Presbyterian Church](/wiki/Orchard_Road_Presbyterian_Church) near his residence, dismembered and cooked in curry. His remains were suspected to have been packed in plastic bags and disposed in rubbish bins around Singapore. Over a two-year-long investigation, neither the remains nor any evidence of the alleged murder were found. On 23 March 1987, a total of six suspects were arrested and charged with murder: 33-year-old Nagaratha Vally Ramiah (Marithamuthu's wife); Kamachi Krishnasamy (Marithamuthu's mother-in-law); and Ramiah's three brothers and one of Ramiah's sisters-in-law. On 6 June 1987, the six were brought to court but due to insufficient evidence, district judge Zainol Abeedin bin Hussin granted them a discharge not amounting to an acquittal. Ramiah's three brothers were detained at [Changi Prison](/wiki/Changi_Prison) from 22 June 1987 until their unconditional release on 21 June 1991. As of July 2021[update], the case remains unsolved. ### 1985 - 26 April 1985: [Sim Ah Cheoh](/wiki/Sim_Ah_Cheoh) was arrested together with her two accomplices, 30-year-old Ronald Tan Chong Ngee and 31-year-old Lim Joo Yin, for transporting 1.37 kg of heroin in a taxi from Hotel Negara in [Claymore Drive](/wiki/Orchard_Road) to [Changi Airport](/wiki/Changi_Airport). All were charged with drug trafficking. Sim, a single mother with two sons, was said to have led a difficult life of poverty and tragedy, including being orphaned at the age of three after her mother's death. She had accepted the job out of desperation for money to pay her debts. On 30 July 1988, all three were convicted of drug trafficking and sentenced to death; Lim and Tan were hanged on 3 April 1992. On 25 March 1992, Sim was granted clemency by President [Wee Kim Wee](/wiki/Wee_Kim_Wee) and had her death sentence commuted to [life imprisonment](/wiki/Life_imprisonment). In November 1993, Sim fell sick while serving her sentence and was diagnosed with [cervical cancer](/wiki/Cervical_cancer). In 1995, after she was told that she had at most one year left to live, she appealed to President [Ong Teng Cheong](/wiki/Ong_Teng_Cheong) to be released so that she could spend the final moments of her life with her sons and relatives. The President granted her request and she was released from prison on 16 February 1995. She died on 30 March 1995 at the age of 47. - 28 April 1985: At his workplace in [Tanjong Rhu](/wiki/Tanjong_Rhu), 38-year-old ice factory worker [Samynathan Pawathai](/wiki/Samynathan_Pawathai), alias Chelia Dorai, was attacked by eight men who sought revenge against one of Samynathan's friends, who hurt one of the attackers in an earlier fight, and Samynathan died as a result of grievous injuries sustained from the attack. Out of the eight murderers, five of them were arrested while the remaining three were never caught till today. Out of the five arrested, two of the attackers - Abdul Ghaffur Parith Mohamed Kassim and S. Ganesan Shanmugam- were each jailed six years for manslaughter, while the other three - Kumar Nadison, Jabar Kadermastan and Chandran Gangatharan - were sentenced to death after being found guilty of murder. Kumar, Jabar and Chandran were executed on 28 April 1995. - 22 May 1985: [Winnifred Teo Suan Lie](/wiki/Winnifred_Teo_Suan_Lie), an 18-year-old [Catholic Junior College](/wiki/Catholic_Junior_College) student, was the victim of a rape-and-murder case. She had left her house for a jog on 22 May 1985 but never returned home. After her mother made a police report, Teo's naked body was later found lying in undergrowth off [Old Holland Road](/wiki/Bukit_Timah). She had suffered multiple stab wounds on her neck and her body showed signs of a fierce but futile struggle. An autopsy showed that she had been sexually assaulted and had died of bleeding from the stab wounds. As of July 2021[update], the case remains unsolved. - 10 September 1985: 22-year-old administrative officer and part-time polytechnic student [Chong Yun Jing](/wiki/Chong_Yun_Jing) died as a result of [meningitis](/wiki/Meningitis), which was the result of complications coming from the surgery she received to remove her pituitary tumour. After her family filed a complaint to the police in 1986, the police conducted investigations into Chong's death and it was suspected that Chong's medical results of a brain tumour was a misdiagnosis made by Dr Lim Djoe Phing, an Indonesian-born neurosurgeon who conducted the surgery on Chong, given that several medical experts consulted in this case stated that Chong did not actually suffer from a brain tumour all along, and she should not have received surgery in the first place. After conducting a coroner's inquiry for 27 days from November 1987 to June 1988, State Coroner Lim Keng Seong found Dr Lim criminally responsible of causing Chong's [death by negligence](/wiki/Negligent_homicide), and as a result, in April 1989, Dr Lim was suspended from medical practice for one year, and he was ordered to pay more than S$375,000 in damages to Chong's surviving kin in a civil lawsuit filed against him in September 1992, and the [Attorney-General's Chambers](/wiki/Attorney-General_of_Singapore) (AGC) also reviewed the case to decide whether to prosecute Dr Lim for negligently causing Chong's death. A Chinese newspaper *[Lianhe Wanbao](/wiki/Lianhe_Wanbao)* reported that Dr Lim died in Singapore on 14 December 1995, ten years after Chong died. Dr Lim was 50 years old at the time of his death. - 13 November 1985: At a hotel in Waterloo Street, Singapore, 33-year-old Indonesian fish merchant [Nurdin Nguan Song](/wiki/Nurdin_Nguan_Song) was slashed and stabbed repeatedly by two men, who were revealed to have been paid by Nurdin's business rival to attack him, and this led to Nurdin's death. Within the next four years, the two perpetrators, Loh Yoon Seong and Tan Swee Hoon, were arrested and charged with murder. Loh, a Malaysian, was caught in 1988 and sentenced to death for murder in 1990, while Tan was arrested in 1992 and later pleaded guilty to manslaughter and unrelated robbery charges, which allowed Tan to serve 23 years in jail and caned 24 strokes. In the aftermath of Tan's trial, Loh was hanged on an unknown date. - November 1985: The [Corrupt Practices Investigation Bureau](/wiki/Corrupt_Practices_Investigation_Bureau) (CPIB) received a report from Liaw Teck Kee, a former employee of [National Development Minister](/wiki/Ministry_of_National_Development_(Singapore)) [Teh Cheang Wan](/wiki/Teh_Cheang_Wan), revealing that he had bribed Teh on two occasions by paying him a total of S$800,000 in 1981 and 1982 for him to prevent the government from acquiring part of a company's land. Teh denied the accusations and even convinced the CPIB director to drop the case. After hearing about the case, [Prime Minister](/wiki/Prime_Minister_of_Singapore) [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) ordered a secret investigation into the double allegations of bribery. After sufficient evidence was gathered, Lee approved the request for an open investigation on 28 November 1986. The CPIB went with Liaw to [the Istana](/wiki/The_Istana) to interrogate Teh over the allegations after they were convinced that Liaw was a truthful witness. Lee also demanded Teh to take a leave of absence until 31 December 1986. On 14 December 1986, a 58-year-old Teh was found dead at home with a signed handwritten letter addressed to Lee, in which he wrote that he felt depressed by the investigation and allegations, adding that it would be appropriate for him to \"pay the highest penalty\" for his mistake. An autopsy certified that the cause of Teh's death was suicide from an overdose of sleeping pills. Since Teh was dead, the [Attorney-General's Chambers](/wiki/Attorney-General_of_Singapore) could not proceed with the charges of corruption against Teh. The investigation was revealed only in January 1987 when Lee addressed [Parliament](/wiki/Parliament_of_Singapore) on Teh's death and his suicide note. The incident was mentioned again by Lee in a speech to Parliament as [Minister Mentor](/wiki/Minister_Mentor) in 2004, in which he reiterated it as an example to emphasise Singapore's zero tolerance towards corruption. Despite the allegations, Lee acknowledged Teh's contributions to the [Housing and Development Board](/wiki/Housing_and_Development_Board) and as National Development Minister during his political career from 1979 to 1986. - 18 December 1985: [Lim Keng Peng](/wiki/Lim_Keng_Peng) had committed theft and fled from the crime scene. When he was spotted by Detective Goh Ah Khia who had earlier attended to the crime scene, Lim fired a fatal shot at Goh's chest and fled. Goh's death sparked a manhunt for Lim, who was also found to be responsible for the shooting of a restaurant owner in a robbery attempt in April 1985. On 3 May 1988, Lim was confronted by three policemen at a coffee shop at [Sunset Way](/wiki/Clementi,_Singapore). When they attempted to arrest him, he pulled out his gun but they fired at him and killed him on the spot. ### 1986 - 14 May 1986: Toh Hong Huat and Keh Chin Ann, two Primary Six students from the now-demolished [Owen Primary School](/wiki/Novena,_Singapore), were last seen together walking to school at around 12:30 pm. The two boys never showed up in class and had been missing since then. According to their families and teachers, the boys were generally well-behaved and had never missed classes before. Their families called the police and a search for the missing boys, extending to Malaysia and Thailand, was carried out. The two boys' families also offered rewards for any information on the boys' whereabouts. This case was dubbed the \"[McDonald's boys case](/wiki/McDonald%27s_boys_case)\" as the fast food chain [McDonald's](/wiki/McDonald%27s) offered a reward of S$100,000 for any information of the boys' whereabouts. ### 1987 - 9 February 1987 – 18 January 2000: Over a period of 13 years, [Singapore Airlines](/wiki/Singapore_Airlines) cabin crew supervisor [Teo Cheng Kiat](/wiki/Teo_Cheng_Kiat) misappropriated an approximate sum of S$35 million from his company. Teo joined Singapore Airlines as a clerk in May 1975 and was promoted to cabin crew supervisor in 1988. It was his job at that time to oversee the allowance payments to the cabin crew. Teo siphoned money off the payments and transferred them to his bank accounts while doctoring records of the cabin members on the flights, using names of those who did not fly on the various flights to conceal his criminal activities. He also manipulated his wife and younger sister to allow him to gain control of their bank accounts and transfer the money he embezzled to their bank accounts. It was due to an internal audit error that led to the arrest of a 47-year-old Teo on 19 January 2000. On 30 June 2000, [High Court](/wiki/High_Court_of_Singapore) judge [Tay Yong Kwang](/wiki/Tay_Yong_Kwang) found Teo guilty of ten charges of criminal breach of trust and sentenced him to 24 years in prison. - 14 February 1987: 47-year-old cake shop proprietor [Lee Juay Heng](/wiki/Lee_Juay_Heng) was attacked and stabbed to death by a suspected robber(s) during a robbery bid in [Hougang](/wiki/Hougang), [Singapore](/wiki/Singapore). The police managed to arrest three suspects - Luah Kang Hai, Ong Ah Lek and Tan Joo Cheng - and they were charged with murder. Ong was said to have masterminded the robbery that let to Tan and Luah approaching Lee, who was stabbed to death by Tan. On 20 April 1989, in midst of the trio's murder trial, the murder charge against Ong was dropped and he pleaded guilty to attempted armed robbery and sentenced to jail for six years and given 18 strokes of the cane. Luah and Tan were tried for another year before the verdict was delivered: Tan was sentenced to death for murder while Luah was acquitted of murder and therefore spared the death sentence; Luah received a jail term of six years with caning (18 strokes). Tan was eventually hanged on an unknown date after losing his appeal in February 1992. ### 1988 - 22 January 1988: 20-year-old Bangladeshi national [Mohamed Shafiqul Islam](/wiki/Murder_of_Mohamed_Shafiqul_Islam) was found murdered at a construction site at Bukit Timah, and his genitals were chopped off and laid next to his corpse. Within the following month, two Bangladeshi workers - Mohamed Bachu Miah and Mohamed Mahmuduzzaman Khan - were arrested for Mohamed Shafiqul's murder. It was revealed in court that Mohamed Shafiqul acted as an informant to the police, who arrested Mohamed Bachu's younger brother for working illegally in Singapore, and Mohamed Bachu harboured a great sense of hatred towards Mohamed Shafiqul for having snitched on his younger brother and thus, Mohamed Bachu and Mahmuduzzaman collaborated with one another to murder Mohamed Shafiqul. On 27 March 1991, two trial judges (Judicial Commissioner M P H Rubin and Justice [T. S. Sinnathuray](/wiki/T._S._Sinnathuray)) found the duo guilty of murder, and sentenced them to death. The killers were both hanged in [Changi Prison](/wiki/Changi_Prison) on 23 July 1993. - 16 February 1988: Upon hearing that his foster father, Tan Ai Soon, had been severely assaulted, 22-year-old [Koh Swee Beng](/wiki/Koh_Swee_Beng_case) gathered five people – Tan's three sons Tan Eng Chye, Tan Eng Poh and Tan Eng Geok; the Tan brothers' brother-in-law Ng Eng Guan; and their friend Ong Hong Thor – to confront 31-year-old Tay Kim Teck, the man who assaulted the elder Tan. When they were beating up Tay, Koh used a knife to stab Tay five times. Two of those wounds were fatal, leading to Tay's death within minutes. All six of them were later arrested and charged with murder. However, only Koh was found guilty of murder and sentenced to death on 20 April 1990, while the other five had their charges reduced to rioting and they were each sentenced to two years' jail and four [strokes of the cane](/wiki/Caning_in_Singapore). Although he lost his appeal in September 1991, Koh was eventually granted clemency by President [Wee Kim Wee](/wiki/Wee_Kim_Wee) on 13 May 1992 and had his death sentence commuted to [life imprisonment](/wiki/Life_imprisonment). During his imprisonment, Koh turned to Buddhism and completed his [GCE O-levels](/wiki/Singapore-Cambridge_GCE_Ordinary_Level). He also went on to study a two-year electronics course at [ITE](/wiki/Institute_of_Technical_Education) while serving his life sentence at Kaki Bukit Centre (now a defunct prison). Koh was released from prison in September 2005 for good behaviour after serving at least two-thirds of his life sentence. - 25 March 1988: While he was smoking outside his parked lorry at [Bukit Timah](/wiki/Bukit_Timah), 49-year-old [Yeu Lam Ching](/wiki/Murder_of_Yeu_Lam_Ching) was robbed and killed by two robbers, one of whom stabbed him in the neck four times and caused him to die. The two robbers were arrested and charged with murder. On 23 May 1992, one of the two robbers, Mazlan Maidun (the man who stabbed Yeu to death), was found guilty of murder and sentenced to death. The other robber, Abdul Aziz Abdul Rahman, was jailed for ten years and given 12 strokes of the cane. Mazlan's appeal was dismissed and he was hanged on 21 January 1994. - 4 May 1988: 48-year-old taxi driver [Jaswant Singh](/wiki/Murder_of_Jaswant_Singh) was robbed and killed by four men who boarded his taxi, and they were arrested within the next two years after the case. One of them, 20-year-old Murgan Ramasamy, was sentenced to death for murder and hanged on 16 September 1994, while the remaining three killers - Narayanasamy Jairam, Ganesan Suppiah and Amuthan Murugasu - were convicted for robbery with hurt and jailed between five years and 78 months, in addition to caning of 12 strokes for each of the trio. - 15 December 1988: [Tong Ching Man](/wiki/Tong_Ching_Man) and [Lam Cheuk Wang](/wiki/Lam_Cheuk_Wang), both [Hongkongers](/wiki/Hongkongers) aged 18 and 19 respectively, were arrested for trafficking 4.8 kg of heroin. The duo stood trial five years later and they were found guilty on 19 August 1993, and sentenced to death. Tong and Lam were both hanged at Changi Prison on the morning of 21 April 1995. ### 1989 - 28 January 1989: A 26-year-old man named [Lim Lee Tin](/wiki/Lim_Lee_Tin) was found dead at a Chinese cemetery. When forensic pathologist Wee Keng Poh conducted an autopsy on Lim, he found that Lim was not a man, but rather a woman who often dressed in men's clothes. Six days later, Lim's girlfriend, a 29-year-old Malaysian and married housewife named Chin Seow Noi was arrested as a suspect, and Chin's 27-year-old younger brother Chin Yau Kim was also arrested at [Johor](/wiki/Johor) before being extradited to Singapore. It was revealed that Chin Seow Noi, who was repeatedly harassed by Lim due to her wanting money, asked her brother and a third accomplice - a 25-year-old Malaysian bus ticket seller Ng Kim Heng (a friend of the Chin siblings) - to murder Lim due to her unable to take the harassment any longer. Ng was arrested two years later on 20 July 1991 in Malaysia, and extradited back to Singapore to stand trial together with the Chin siblings for Lim's murder. The three conspirators elected to remain silent in the trial and tried to raise doubts over their confessions despite admitting to the crime. On 9 October 1992, Judicial Commissioner Amarjeet Singh found the trio guilty of murder and sentenced them to death. After the loss of their appeals, Chin Seow Noi, Chin Yau Kim and Ng Kim Heng were eventually hanged on 31 March 1995. - 2 February 1989: In a coffeeshop in [Yishun](/wiki/Yishun), [Singapore](/wiki/Singapore), 65-year-old coffeeshop caretaker [Ang Chye](/wiki/1989_Yishun_coffeeshop_murder) was murdered after a break-in. After initial investigations, the police arrested four men, charging three of them with murder after the fourth man implicated them. However, none of the three suspects' fingerprints DNA was found at the crime scene. It was later revealed during their murder trial that a fingerprint found at the crime scene matched a Mohamed Sulaiman Samsudin; the initial three suspects, who had been held in remand for three years, were acquitted and released. Sulaiman was later convicted of murdering Ang and sentenced to death. - 15 February 1989: 29-year-old [Ong Yeow Tian](/wiki/Ong_Yeow_Tian) and 26-year-old [Chua Gin Boon](/wiki/Chua_Gin_Boon) were attempting to break into a shop unit at [Tampines Street 11](/wiki/Tampines) in the early hours of the morning when they were spotted by two policemen following a tip-off by a member of the public. Ong ran away while one of the policemen arrested Chua. The other policeman, 22-year-old Police Constable [Mirza Abdul Halim bin Mirza Abdul Majid](/wiki/Mirza_Abdul_Halim_bin_Mirza_Abdul_Majid), chased Ong. When Ong attacked Mirza, the latter took out his [revolver](/wiki/Smith_%26_Wesson_Model_2) in an attempt to defend himself but the former overpowered him and shot him in the head before fleeing with the revolver. Ong tried to escape in a taxi until he was sighted by two other policemen. The taxi pulled over and Ong used the stolen revolver to fire at them. In return, they shot Ong in the abdomen but Ong managed to flee. The [Police Task Force](/wiki/Police_Tactical_Unit_(Singapore)) was activated to hunt for Ong. During the ensuing firefight, Ong managed to shoot one policeman, who was saved by the bulletproof vest he wore. Ong was eventually subdued and arrested. Mirza went into a coma and was given a rare field promotion to the rank of Corporal before he died the next day. Chua was sentenced to two years and three months' jail and [six strokes of the cane](/wiki/Caning_in_Singapore) on 4 March 1989 for robbery and lower firearm charges, while Ong was found guilty of unlawfully discharging a firearm and sentenced to death in October 1992. Ong appealed his sentence but lost the appeal and was hanged on 25 November 1994. This incident resulted in the introduction of snatch-resistant holsters for police officers in later years. - 28 February 1989: After arriving at Singapore from [Phuket](/wiki/Phuket), two Hong Kong citizens [Cheuk Mei Mei](/wiki/Cheuk_Mei_Mei) and Tse Po Chung were caught having more than 4 kg of drugs, mainly heroin, in their possession. Cheuk and Tse were charged with drug trafficking and later sentenced to death on 14 January 1992. Cheuk Mei Mei and Tse Po Chung were both hanged at [Changi Prison](/wiki/Changi_Prison) on the morning of 5 March 1994. Cheuk, who was 29 years old when she was hanged, was the first female to be executed in Singapore for drug trafficking. - 11 April 1989: 56-year-old [Phang Tee Wah](/wiki/Phang_Tee_Wah), a goldsmith, was kidnapped and the two people who abducted him demanded a ransom of $1 million from Phang's family. However, four days after his disappearance, Phang was found murdered in a deserted area at [Pasir Ris](/wiki/Pasir_Ris). That same day, the kidnappers - Liow Han Heng (alias William Liow) and Ibrahim Masod - were arrested for allegedly holding Phang hostage at Liow's [Yishun](/wiki/Yishun) flat before killing him, as well as stealing Phang's watch to sell for money. On 23 July 1992, both Liow and Ibrahim were found guilty of murder by Justice [T S Sinnathuray](/wiki/T_S_Sinnathuray), and consequently sentenced to death. However, 48-year-old Liow died from a heart attack while on death row on 10 August 1993, leaving only Ibrahim to appeal against his sentence, but the three judges of Appeal [Chao Hick Tin](/wiki/Chao_Hick_Tin), Goh Joon Seng and M Karthigesu of the Court of Appeal rejected his appeal on 11 November 1993, and Ibrahim was later executed at age 55 on 29 July 1994. - 24 May 1989: Known as the [Tanglin Halt double murders](/wiki/Tanglin_Halt_double_murders), 32-year-old Ithinin Kamari had fatally stabbed two men - Mohamed Johar Selamat (33) and Mohd Said Abdul Majid (29) - due to the two men, one of whom was his girlfriend's ex-lover, allegedly insulting him. Although Ithinin raised a defence that he killed the two men as a result of sudden and grave provocation, Ithinin was judged to be still capable of self-control and was not substantively suffering from grave and sudden provocation when he committed the double murder. Ithinin was found guilty of murdering both Mohd Said and Mohamed Johar, and sentenced to death in January 1992. Ithinin lost his appeal in 1993 and he was hanged on an unknown date since then. - 3 August 1989: 34-year-old illegal moneylender [Ho Hon Sing](/wiki/Murder_of_Ho_Hon_Sing) was found dead at the foot of a Housing and Development Board (HDB) block at Beach Road, Singapore. Initially thought to have committed suicide, he was later found to have been drugged and thrown out of the flat by his childhood friend, 37-year-old Yeo Watt Song, who was only arrested nearly five months after Ho's death. On 3 December 1992, Yeo was found guilty of murder and sentenced to death. Yeo was executed on an unknown date in March 1994. - 2 October 1989: [Liang Shan Shan](/wiki/Liang_Shan_Shan), a 17-year-old student from [Mayflower Secondary School](/wiki/Mayflower_Secondary_School), was reported missing by her parents. She was last seen boarding her school bus at 1 pm. 12 days later, her highly decomposed body was discovered by [National Servicemen](/wiki/National_service_in_Singapore) training at [Yishun Industrial Park](/wiki/Yishun). Although her cause of death could not be determined, police investigations narrowed down to one suspect: 35-year-old Oh Laye Koh, the school bus driver. Oh was then charged with Liang's murder based on only [circumstantial evidence](/wiki/Circumstantial_evidence), and Oh was also suspected of murdering 18-year-old lounge waitress Norhayah binti Mohamed Ali in 1982, which led to him facing a second murder charge a month after his arrest for killing Liang. Oh was initially acquitted of murdering Liang at the end of his trial in 1992. However, the prosecution appealed the acquittal and it was accepted, and the re-trial began on 27 April 1994. Oh chose to remain silent when he had to make his defence. On 3 May 1994, [High Court](/wiki/High_Court_of_Singapore) judge Amarjeet Singh concluded from Oh's decision to remain silent and his failure to provide evidence \"arose from a consciousness of guilt in the face of the circumstantial evidence\". He found Oh guilty of murder and sentenced him to death. Oh's appeal to the [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore) was dismissed on 29 July 1994, and his clemency petition was rejected on 5 April 1995. On 19 May 1995 after losing his final bid to escape the gallows, 39-year-old Oh Laye Koh was hanged. - 24 November 1989: 25-year-old Michael Lim Hock Hoe and his friend Gan Ching Huat were arrested in the coffee shop of [The Plaza Hotel](/wiki/The_Plaza_(Singapore)) on [Beach Road](/wiki/Beach_Road,_Singapore) after Lim had attempted to sell approximately 2.2 kilograms of heroin to an undercover Central Narcotics Bureau officer for $35,000. During their trial in February 1993, Lim denied he had previously conducted extensive negotiations with the undercover officer regarding the price and the amount of heroin he could supply, and claimed he was tricked by another person into thinking the bag containing the drugs contained electronic parts, while Gan admitted to handling the bag on Lim's orders but did not know it contained narcotics. Justice [Lai Kew Chai](/wiki/Lai_Kew_Chai) ruled that Gan had satisfied the court on a balance of probabilities that he did not have prior knowledge of the heroin, and was thus acquitted of all charges. However, the judge highlighted how Lim had previously engaged in contrived and tortuous negotiations with the undercover officer regarding delivery and payment, which the court found to be unbelievable that the arrangements pertained to a few packets of electronic goods. Lim was therefore convicted of trafficking 400 grams of pure heroin and sentenced to death. - 19 December 1989: At a coffee shop in Ang Mo Kio, 72-year-old coffee shop owner Ling Ha Hiang was attacked by a group of three robbers who used raffia string, metal wires and masking tape to bind the elderly man's hands and legs, as well as wrapping the tape around his nose and mouth. This led to Ling to suffocate to death. The trio stole around S$4,100 in cash before they left. It took two years for police investigations to finally identify the robbers and arrest one of them: 35-year-old Wong Onn Cheong, who was charged with murder in 1991 and robbery but subsequently sentenced to ten years' imprisonment and 18 strokes of the cane in January 1993. Another offender, Sim Thiam Seng, who migrated to Canada six months after the crime, was arrested at Changi Airport in 1991 when he returned to Singapore, and he was convicted of robbery and received a jail term of eight years with 12 strokes of the cane. The third and final suspect, 25-year-old Ong Seng Chuen, meanwhile, remained in Singapore under a low profile while hiding from the authorities. Slowly, during the next 21 years while leading a tough life on the run, Ong increasingly felt remorse for his crime, and in October 2010, he finally surrendered to the police and faced charges of culpable homicide and robbery. Ong's family, including his long-time girlfriend and son (whom he fathered in 2000 while on the run), pleaded for leniency on account that Ong did not commit any offences while on the run and acted as a loving and caring husband and father to his girlfriend and son. On account that Ong did surrender himself out of guilt and has kept a clean record while on the run, the High Court sentenced 48-year-old Ong to six years' imprisonment and 12 strokes of the cane. - [Capital punishment in Singapore](/wiki/Capital_punishment_in_Singapore) - [Life imprisonment in Singapore](/wiki/Life_imprisonment_in_Singapore) - [List of major crimes in Singapore](/wiki/List_of_major_crimes_in_Singapore)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:25:23.813147",
  "title": "List of major crimes in Singapore (before 1990)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/List_of_major_crimes_in_Singapore_(before_1990)"
}