{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:23:29.171459"
  },
  "content": "This article contains a **list of Singaporean patriotic songs**. A patriotic song is one which inspires feelings of pride in one's country, which in this context is [Singapore](/wiki/Singapore). The list has both traditional [folk songs](/wiki/Folk_music) that have special meaning to [Singaporeans](/wiki/Singaporeans), as well as modern songs composed specifically for national celebrations, particularly the [National Day Parade](/wiki/Singapore_National_Day_Parade) held on 9 August each year since 1965 on Singapore's [National Day](/wiki/National_Day_(Singapore)). Generally speaking, there may be said to be two types of [Singaporean](/wiki/Singaporeans) patriotic songs. The first type is traditional [folk songs](/wiki/Folk_music) that have, over time, come to have special meaning to [Singaporeans](/wiki/Singaporeans). Many of these are in [mother tongue](/wiki/Language_education_in_Singapore#Mother_Tongue) languages – [Chinese](/wiki/Chinese_language), [Malay](/wiki/Malay_language) and [Tamil](/wiki/Tamil_language), for instance. Examples of such songs include [Chinese](/wiki/Chinese_language) song \"Xiao Ren Wu De Xin Sheng\" \"(小人物的心声)\", [Malay](/wiki/Malay_language) song \"Di Tanjung Katong\" and [Tamil](/wiki/Tamil_language) song \"Munnaeru Vaalibaa\". The second type is the comparatively modern songs, mostly in [English](/wiki/English_language), that were composed specifically for national events – particularly the [National Day Parade](/wiki/Singapore_National_Day_Parade) held annually on 9 August – and for use in schools. Each year since 1985, the National Day Parade Executive Committee has designated one such song as a [National Day Parade theme song](/wiki/Singapore_National_Day_Parade#Theme_songs). The song is usually broadcast on radio and television starting from a month before National Day, and is given prominence during the Parade itself. Examples of such songs include \"Stand Up for Singapore\" (1985), \"[Count On Me Singapore](/wiki/Count_On_Me_Singapore)\" (1986) and \"One People, One Nation, One Singapore\" (1990). In 1998, there were two National Day Parade theme songs, \"[Home](/wiki/Home_(Kit_Chan_song))\" and \"City For The World\". The former was reused for the 2004 ceremony. In 2007, they used two National Day Parade theme songs, \"There's No Place I'd Rather Be\" and \"Will You?\". As for the National Day Ceremony song, \"My People My Home\", it was conducted by Dr [Lee Tzu Pheng](/wiki/Lee_Tzu_Pheng), it came out in the late 1990s and was reused for National Day Parade 2012, together with \"[Love at First Light](/wiki/Love_at_First_Light)\" which is sung by singer [Olivia Ong](/wiki/Olivia_Ong). In 1984, the [National Arts Council](/wiki/National_Arts_Council_Singapore) inaugurated the Sing Singapore Festival, with the aim of discovering and promoting home-grown music and artistes. According to the Council, it also hoped to nurture a love for music and singing and cultivate a greater sense of togetherness amongst Singaporeans. The programme led to the creation of a number of new songs by Singaporean composers, some of which were selected for National Day celebrations. These included \"Home\" (1998) by [Dick Lee](/wiki/Dick_Lee), \"Where I Belong\" (2001) by [Tanya Chua](/wiki/Tanya_Chua), and \"A Place in My Heart\" (2003) by Kevin Quah. Local singers such as [Taufik Batisah](/wiki/Taufik_Batisah), [Kit Chan](/wiki/Kit_Chan) and [Stefanie Sun](/wiki/Stefanie_Sun) have performed songs in the Sing Singapore collection. ## The National Anthem TitleDateAuthor(s)Copyright owner(s)**Majulah Singapura** (**Onward Singapore**) 1958Lyrics and music: [Zubir Said](/wiki/Zubir_Said)[Ministry of Information, Communications and the Arts](/wiki/Ministry_of_Information,_Communications_and_the_Arts_(Singapore)) ## National Day Theme Songs (by year) YearSongSingersComposerLyricistMusic directorMusic Video DirectorChinese VersionSingers1984\"Stand Up for Singapore\"Hugh HarrisonHugh Harrison19851986\"[Count On Me Singapore](/wiki/Count_On_Me_Singapore)\"Clement ChowHugh HarrisonHugh Harrison1987\"We are Singapore\"Jonathan Tan, Roslinda Baharudin, Anne Weerapass and Robert FernandoHugh HarrisonHugh Harrison19881989\"Five Stars Arising\"Lim Su Chong\"1990\"One People, One Nation, One Singapore\"Faridah Ali, [Jacintha Abisheganaden](/wiki/Jacintha_Abisheganaden), Stephen Francis and Clement Chow[Jeremy Monteiro](/wiki/Jeremy_Monteiro)[Jim Aitchison](/wiki/Jim_Aitchison)1991\"It's the Little Things\"Patrick SeetIvan Chua1995\"My People My Home\"Dr Lee Tzu Pheng1996\"Count On Me Singapore\"Clement Chow1997\"Singapore Town\"The Sidaislers1998\"[Home](/wiki/Home_(Kit_Chan_song))\"[Kit Chan](/wiki/Kit_Chan)[Dick Lee](/wiki/Dick_Lee) [Dick Lee](/wiki/Dick_Lee)家[Kit Chan](/wiki/Kit_Chan) 陈洁仪\"City for the World\"1999\"Together\"[Evelyn Tan](/wiki/Evelyn_Tan) & Dreamz FMKen LimKen Lim心连心[Evelyn Tan](/wiki/Evelyn_Tan) & Dreamz FM 陈毓云、梦飞船2000\"Shine on Me\"Jai WahabJim LimJim Lim星月[Mavis Hee](/wiki/Mavis_Hee) 许美静2001\"[Where I Belong](/wiki/Where_I_Belong_(Tanya_Chua_song))\"[Tanya Chua](/wiki/Tanya_Chua)Tanya ChuaTanya Chua属于[Tanya Chua](/wiki/Tanya_Chua) 蔡健雅2002\"We Will Get There\"[Stefanie Sun](/wiki/Stefanie_Sun)Dick LeeDick Lee一起走到[Stefanie Sun](/wiki/Stefanie_Sun) 孙燕姿2003\"One United People\"Joshua WanJoshua Wan全心全意2004\"Home\"[Kit Chan](/wiki/Kit_Chan) and [JJ Lin](/wiki/JJ_Lin) The MTV versions were choral renditions performed by Young Voices, which comprises the Choirs from the Tanjong Katong Girls' School and Tampines Primary School.Dick LeeDick Lee家[Kit Chan](/wiki/Kit_Chan) and [JJ Lin](/wiki/JJ_Lin) 陈洁仪、林俊杰2005\"Reach Out for the Skies\"[Taufik Batisah](/wiki/Taufik_Batisah) and [Rui En](/wiki/Rui_En)Elaine ChanSelena Tan勇敢向前飞[Rui En](/wiki/Rui_En) 瑞恩2006\"[My Island Home](/wiki/My_Island_Home_(2006_song))\"[Kaira Gong](/wiki/Kaira_Gong)Joshua WanJoshua Wan幸福的图形[Kaira Gong](/wiki/Kaira_Gong) 龚诗嘉2007\"[There's No Place I'd Rather Be](/wiki/There%27s_No_Place_I%27d_Rather_Be)\"[Kit Chan](/wiki/Kit_Chan)Jimmy YeJimmy Ye\"[Will You](/wiki/Will_you_(2007_song))\"Janani Sridhar, Asha Edmund, [Emma Yong](/wiki/Emma_Yong), Lily Ann Rahmat, Jai Wahab, Shabir Mohammed, Sebastian Tan, Gani KarimJimmy YeJimmy Ye2008\"[Shine for Singapore](/wiki/Shine_for_Singapore)\"[Hady Mirza](/wiki/Hady_Mirza)Benny WongBenny Wong晴空万里[Joi Chua](/wiki/Joi_Chua) 蔡淳佳2009\"[What Do You See?](/wiki/What_Do_You_See%3F_(2009_song))\"[Electrico](/wiki/Electrico)ElectricoElectrico就在这里[Kelvin Tan](/wiki/Kelvin_Tan_Wei_Lian) 陈伟联2010\"[Song for Singapore](/wiki/Song_for_Singapore)\"[Corrinne May](/wiki/Corrinne_May)Corrine MayCorrine May2011\"[In a Heartbeat](/wiki/In_a_Heartbeat_(Sylvia_Ratonel_song))\"[Sylvia Ratonel](/wiki/Sylvia_Ratonel)Goh Keng LongHaresh SharmaBrian Gothong Tan2012\"[Love At First Light](/wiki/Love_At_First_Light)\"[Olivia Ong](/wiki/Olivia_Ong) and Natanya TanIskandar IsmailPaul Tan2013\"One Singapore\"68-member choir \"Sing A Nation\"Elaine ChanSelena Tan2014\"We Will Get There\"Farisha Ishak, Fauzi Laili, Tay Ke Wei and [Rahimah Rahim](/wiki/Rahimah_Rahim_(singer,_born_1955))2015\"Our Singapore\"[Dick Lee](/wiki/Dick_Lee) & [JJ Lin](/wiki/JJ_Lin)Dick LeeDick Lee2016\"Tomorrow's Here Today\"[53A](/wiki/53A_(band))Don RichmondDon Richmond2017\"Because it's Singapore\"[Jay Lim](/wiki/Jay_Lim)Lee Wei SongJay LimMiso Tan2018We Are Singapore (Remake)[Charlie Lim](/wiki/Charlie_Lim), [Vanessa Fernandez](/wiki/Vanessa_Fernandez), [Aisyah Aziz](/wiki/Aisyah_Aziz), Shak'thiya Subramaniamm, [Joanna Dong](/wiki/Joanna_Dong) and THELIONCITYBOYCharlie Lim (Preface), Hugh Harrison (Original chorus)Charlie Lim (Preface), Hugh Harrison (Original chorus)Dr Sydney Tan, Charlie Lim, Evan LowLi Lin Wee2019Our Singapore (Remake)[Rahimah Rahim](/wiki/Rahimah_Rahim_(singer,_born_1992)), [Jacintha Abisheganaden](/wiki/Jacintha_Abisheganaden), [Stefanie Sun](/wiki/Stefanie_Sun), [JJ Lin](/wiki/JJ_Lin), [Dick Lee](/wiki/Dick_Lee), [Kit Chan](/wiki/Kit_Chan)Dick LeeDick LeeDr Sydney TanRoyston Tan2020Everything I Am[Nathan Hartono](/wiki/Nathan_Hartono)Joshua WanJoshua WanDr Sydney Tan2021The Road Ahead[Linying](/wiki/Linying_(singer-songwriter)), [Sezairi Sezali](/wiki/Sezairi_Sezali), [Shabir](/wiki/Shabir), Shye-Anne BrownLinying, Evan LowLinying, Evan LowDr Sydney TanHuang Junxiang, Jerrold Chong2022Stronger Together[Taufik Batisah](/wiki/Taufik_Batisah) ft. The Island VoicesDon RichmondDon RichmondLindsay Jialin2023Shine Your Light[53A](/wiki/53A_(band)), The Island Voices, lewloh, [Olivia Ong](/wiki/Olivia_Ong), [ShiGGa Shay](/wiki/Shigga_Shay), [Iman Fandi](/wiki/Iman_Fandi), LineathDon RichmondDon Richmond, ShiGGa ShayJin Pek2024Not Alone[Benjamin Kheng](/wiki/Benjamin_Kheng), Music & Drama CompanyBenjamin KhengBenjamin Kheng, Evan LowKoo Chia Meng, Brian Gothong Tan, Davier Yoon2025Here We Are[Charlie Lim](/wiki/Charlie_Lim), [Kit Chan](/wiki/Kit_Chan), The Island Voices[Charlie Lim](/wiki/Charlie_Lim), Chok KerongCharlie LimDr Sydney Tan[He Shuming](/wiki/He_Shuming) ## Songs with English lyrics TitleDateAuthor(s)Copyright owner(s)First verse and/or chorus**Count On Me, Singapore**1986Lyrics and music: Hugh Harrison Commissioned by the Cultural Affairs Division, [Ministry of Community Development](/wiki/Ministry_of_Community_Development,_Youth_and_Sports_(Singapore)) [Ministry of Information, Communications and the Arts](/wiki/Ministry_of_Information,_Communications_and_the_Arts_(Singapore)) and the National Arts Council We have a vision for tomorrow, just believe, just believe We have a goal for Singapore, we can achieve, we can achieve You and me, we'll do our part, stand together, heart to heart We're going to show the world what Singapore can be We can achieve, we can achieve There is something down the road that we can strive for We are told no dream's too bold that we can't try for There's a spirit in the air, it's a feeling we all share We're going to build a better life, for you and me We can achieve, we can achieve Count on me Singapore, count on me to give my best and more You and me, we'll do our part, stand together, heart to heart We're going to show the world what Singapore can be We can achieve, we can achieve Chorus: Count on me Singapore, Count on me Singapore Count on me to give my best and more, count on me Singapore (Repeat Chorus) Together Singapore, Singapore! (x2) **Five Stars Arising**1969Lyrics and music: Lim Su Chong[Ministry of Information, Communications and the Arts](/wiki/Ministry_of_Information,_Communications_and_the_Arts_(Singapore)) and the National Arts Council*First verse*: There's a new moon arising, out of the stormy sea Youthful and bright and bearing hope, and tranquil as can be Reach out for the moon above, savour freedom, truth and love There's a new moon arising, out of the stormy sea Second verse: There are five stars arising, out of the stormy sea Each is a lamp to guide our way; a lamp for all to see Reach out for the stars above, savour freedom, truth and love There are five stars arising, out of the stormy sea Third verse:(x2) There's a new flag arising, out of the stormy sea Crimson as the blood of all mankind, yet white and pure and free Reach out for the flag above, savour freedom, truth and love There is a new flag arising, happy and proud are we Ending: There is a new moon arising, out of the stormy sea five stars arising, happy and proud are we **It's the Little Things**1991Lyrics: Patrick Seet Music: Ivan Chua [Ministry of Information, Communications and the Arts](/wiki/Ministry_of_Information,_Communications_and_the_Arts_(Singapore)) and the National Arts Council*Chorus*: It's the little things that we share, the love and joy that's in the air The children's laughter everywhere, and all our favourite things Over the years, I've grown accustomed to your ways And no matter where I'll be, it warms my heart to know that You're always here for me **[Moments of Magic](/wiki/Moments_of_Magic)**1999Lyrics and music: Ken Lim[Ministry of Information, Communications and the Arts](/wiki/Ministry_of_Information,_Communications_and_the_Arts_(Singapore)) and the National Arts Council*Chorus*: Let us celebrate this moment, A brand new day awaits Let us reach out for our dreams out there Moments of magic we will share Let us celebrate this moment, A brand new day awaits We will always be a city of friends Time will bring for us to share Moments of magic **One People, One Nation, One Singapore**1990Lyrics: [Jim Aitchison](/wiki/James_Lee_(writer)) Music: [Jeremy Monteiro](/wiki/Jeremy_Monteiro) Commissioned by the [Ministry of Information and the Arts](/wiki/Ministry_of_Information,_Communications_and_the_Arts_(Singapore)) [Ministry of Information, Communications and the Arts](/wiki/Ministry_of_Information,_Communications_and_the_Arts_(Singapore)) and the National Arts Council\"First verse\": We've built a nation with our hands The toil of people from a dozen lands. Strangers when we first begun, now we are Singaporeans Let's reach out for Singapore. Join our hands forevermore *Chorus*: One people, one nation, one Singapore That's the way that we will be forevermore Every creed and every race, has its role and has its place One people, one nation, one Singapore **Singapore Town**1967Lyrics and music: The Sidaislers*First verse*: You could take a little trip around Singapore town In a Singapore city bus To see Collyer Quay and Raffles Place The Esplanade and all of us *Chorus*: Because in Singapore, Singapore Their hearts are big and wide you'll find Because in Singapore, Singapore You'll find happiness for everyone **[Singapura, Sunny Island](/wiki/Singapura,_Sunny_Island)**1962Translated from Indonesian version[MediaCorp Pte. Ltd.](/wiki/MediaCorp)*First verse*: Singapura, O Singapura Sunny island set in the sea Singapura, O Singapura Pretty flowers bloom for you and me **[Song for Singapore](/wiki/Song_for_Singapore)**2010Lyrics and music: [Corrinne May](/wiki/Corrinne_May)*Chorus*: I want to sing Sing a song for Singapore With every generation there's more to be grateful for So come and sing Sing a song for Singapore You're my brother you're my sister I'm thankful for my Singapore My Singapore Singapore **Stand Up for Singapore**1984Lyrics and music: Hugh Harrison Commissioned by the [Ministry of Culture](/wiki/Ministry_of_Information,_Communications_and_the_Arts_(Singapore)) [Ministry of Information, Communications and the Arts](/wiki/Ministry_of_Information,_Communications_and_the_Arts_(Singapore)) and the National Arts Council*First verse*: Stand up for Singapore, do the best you can Reach out for your fellow man You've got to make a stand Recognise you can play your part Let it come right from your heart Be prepared to give a little more Stand up, stand up for Singapore **[There's No Place I'd Rather Be](/wiki/There%27s_No_Place_I%27d_Rather_Be)**2007Lyrics and music: [Jimmy Ye](/wiki/Jimmy_Ye_Liang_Jun)*Chorus*: There's no place I'd rather be You'll always be a part of me And even though I've roamed the world It's still my home I long to see. **These Are The Days**2015Lyrics and music: Lee Chin Sin*Chorus*: These are the days To breathe and feel To touch the skies To name our dreams and make them real And never close our eyes We've fought the fears We've braved the years When all we could believe was all we had to give Now what we only dreamed is what we live **We Are Singapore**1987Lyrics and music: Hugh Harrison Orchestration: [Jeremy Monteiro](/wiki/Jeremy_Monteiro) Commissioned by the Cultural Affairs Division, [Ministry of Community Development](/wiki/Ministry_of_Community_Development,_Youth_and_Sports_(Singapore)) [Ministry of Information, Communications and the Arts](/wiki/Ministry_of_Information,_Communications_and_the_Arts_(Singapore)) and the National Arts Council*First verse*: There was a time when people said That Singapore won't make it But we did There was a time when troubles Seemed too much for us to take But we did We built a nation Strong and free Reaching out together For peace and harmony *Chorus 1*: This is my country, this is my flag This is my future, this is my life This is my family, these are my friends We are Singapore, Singaporeans **[What Do You See?](/wiki/What_Do_You_See%3F_(2009_song))**2009Lyrics and music: [Electrico](/wiki/Electrico)*Chorus*: See the moon and the stars, look how far we have come Look around at our faces, they shine brightly in the sun With our hopes and dreams, imagine what tomorrow it may bring What do you see? What do you see? **[Will You](/wiki/Will_you_(2007_song))**2007Lyrics and music: Jimmy Ye*First verse*: Will you make this island Amazing in all ways? Surprises every corner, Delightful nights and days. **Not Alone**2024Lyrics and music: Benjamin KhengHow do I reach for the skies If I’m feeling low, Don’t know where to go How do I stand when it’s time When spirits are high And flags are flying But then I come to the river That runs through my town Where our fathers and mothers have watered the ground And the roads I have walked And the faces I know Oh I know, I know If we just look to each other Then this house will feel like home And the more we’re together the further we’ll go You and I we’re Not alone How do I know I belong? We’ll find love for Every creed and colour If we lean on one another How will I ever get there? All I know is You and me do better When we run together But then I come to the river And fears start to fade My brothers and sisters We journey the same And I know, I know If we just look to each other Then this house will feel like home And the more we’re together the further we’ll go You and I we’re Not alone Just one ripple in a river Can be the one to turn the tide When the water rises I’ll be right by your side And if they ask of my home When I’m miles apart I’ll think of the people I hold in my heart The family I’ve found And the faces I know Oh I know, I know If we just look to each other Then this house will feel like home And the more we’re together the further we’ll go You and I we’re Not alone **Here We Are**2025 Threads of a tapestry A house full of love Every voice is a story Waiting to unfold To be seen, heard, and known Our differences will make us whole Here we are We're in this together Our spirits forever Look how far we have come Here we are No matter the weather Through the storms and changes Wave your flag in the sun Here we are Through the fire We can live our hopes and dreams Here we are This is what home means to me Do you remember When we sailed through seasons of change? Our journey's not over I'm so glad you're my neighbor, We'll look to each other As we face the unknown Just know you're never on your own Here we are We're in this together Our spirits forever Look how far we have come Here we are No matter the weather through the storms and changes wave your flag in the sun Here we are Through the fire We can live our hopes and dreams Here we are This is what home means to me Wave your flag in the sun Look how far we have come Living our hopes and dreams This is what home means to me Here we are We're in this together Our spirits forever Look how far we have come Here we are No matter the weather Through the storms and changes Wave your flag in the sun Here we are Through the fire We can live our hopes and dreams Here we are This is what home means to me Here we are This is what home means to me Wave your flag in the sun Look how far we have come This is what home means to me **Notes** - The song highlighted in blue was designated as the \"millennium song\" by the National Arts Council. - The four songs highlighted in pink were designated as \"national songs\" by the National Arts Council. - Songs highlighted in red are National Day Parade theme songs. - Songs highlighted in yellow were designated as \"community songs\" by the National Arts Council. - The song highlighted in green is the winner of SG50: The Gift of Song. ## Songs with Malay lyrics TitleDateAuthor(s)Copyright owner(s)First verse and/or chorus**[Chan Mali Chan](/wiki/Chan_Mali_Chan)**2010- from Nusa Tenggara -Traditional, not copyrighted*First verse*: Di mana dia anak kambing saya? Anak kambing saya yang makan daun talas Di mana dia buah hati saya? Buah hati saya bagai telur dikupas *Chorus*: Chan mali chan, chan mali chan, Chan mali chan, ketipung payung (twice) **Di Tanjung Katong**Composer Osman Ahmad, musician in 1930s. Reference found in MUSIKA: Arena Muzik Silam di Malaya. NLB.Copyright controlled.*First verse*: Di Tanjung Katong, airnya biru Disitu tempatnya, dara jelita Duduk sekampung, lagikan rindu Kononlah pula nun jauh di mata **[Semoga Bahagia](/wiki/Semoga_Bahagia)** (**May You Achieve Happiness**) Lyrics and music: [Zubir Said](/wiki/Zubir_Said)*First verse*: Sama-sama maju ke hadapan Pandai cari pelajaran Jaga diri dalam kesihatan Serta sopan-santun dengan kawan-kawan *English translation*: Together we progress Clever at seeking knowledge Take care of your health And be courteous to your friends **Notes** - Songs highlighted in yellow were designated as \"community songs\" by the National Arts Council. - Semoga Bahagia was designated as the official Children's Day song. ## Songs with Chinese lyrics TitleDateAuthor(s)Copyright owner(s)First verse and/or chorus**小人物的心声 (Xiao Ren Wu De Xin Sheng)** (**Voices from the Heart**) 1986Lyrics: Bok Sek Yieng Music: Tan Kian Chin Touch Music Publishing Pte. Ltd.*First verse*: 也许我一个人 不能成就一番大事业 但我尽力贡献一份微薄的力量 也许我自己 不能发出万丈光和亮 但我能为斗室带来足够的光芒 我从来都不在乎 自己不是一个大人物 因为平凡也是一种幸福 看到名人总是忙忙碌碌 我的时间由我控制 平凡日子一样会充实 *English translation*: Perhaps I, as only one person, can't take on a large task But I can work hard and contribute a decent effort. **相信我吧，新加坡! (Xiāngxìn wǒ ba, Xīnjiāpō!** (**Believe in me, Singapore!**) 1980sLyrics and music: UnknownNot copyrighted*First verse*: 我是年轻的卫国军 有的是满腔的热血 有的是精力充沛 相信我吧！新加坡！ 我要用这股力量 献身与新加坡 我要把敌人消灭 相信我吧！新加坡！ *English translation*: I am a young soldier who serves the nation Who is filled with hot blood So believe in me, Singapore! I desire to use this strength To sacrifice myself for the sake of Singapore I want to destroy our enemies So believe in me, Singapore! ## Songs with Tamil lyrics TitleDateAuthor(s)Copyright owner(s)First verse and/or chorus**Munnaeru Vaalibaa**1966S. JesudassanNot copyrighted*Lyrics*: Munnaeru vaalibaa munaeri endrum Thoduvaan noakkuvaai Kann theriyaatha Kaari rulil Olirum vinmeenae Thanimaiyaalae payantha naadugal Irulil oli pera unnai naadum Mael noakku vaaliba endrum munnaeri Thoduvaan noakkuvaai thoduvaan noakkuvai *The lyrics in Tamil Language:* முன்னேறு வாலிபா முன்னேறி என்றும் தொடுவான் நோக்குவாய் கண் தெரியாத காரி ருளில் ஒளிரும் விண்மீனே தனிமை யாலே பயந்த நாடுகள் இருளில் ஒளிபெற உன்னை நாடும் மேல் நோக்கு வாலிபா என்றும் முன்னேறி தொடுவான் நோக்குவாய் தொடுவான் நோக்குவாய் *The lyrics in English are:* Forward o'youth forever advancing Look to horizons far Eyes do not grope in the depths of the night That look on a shining star Nations fearful in apartness Need your sight to light their darkness Look up o'youth forever advancing Look to horizons far... **Engkal Singapore**1966Lyrics: Peri Nela Palanivelan Music: L Krishna SamyNot copyrighted***Lyrics*:** Engkal Singapore - ithu Engkal Singapore - inbam Engkum pongkum Engkal Singapore Oru nilaiyaana aatchi ulakil Uyarnthu oangkum naadu - engkal Orumaippaattinai vilakkum - ina Otrumai kanda naadu **Lyrics in Tamil Language:** எங்கள் சிங்கப்பூர் - இது எங்கள் சிங்கப்பூர் - இன்பம் எங்கும் பொங்கும் எங்கள் சிஙப்பூர் ஒரு நிலையான ஆட்சி உலகில் உயர்ந்து ஓங்கட்டும் நாடு - எங்கள் ஒருமைப்பாட்டினை விளக்கும் - இன ஒற்றுமை கண்ட நாடு **Singai Naadu**2012Composed & Performed by: Shabir Tabare Alam Lyrics: Shabir Tabare Alam Copyright: Shabir Tabare Alam***Lyrics*:** Boomi, Unnai Azhaikkuthu Unnai Azhaikkuthu, Vaa Vaa Nam Naadu, Kural Ezhupputhu Kural Ezhupputhu, Vaa Vaa Pala Inangal Sera, Orumai Kondaade En Veedu Enthan Thaai Naadu Endru Sollu Pala Inangal Sera, Orumai Kondaade En Veedu Enthan Thaai Naadu Endru Sollu Singai Naadu, Enthan Veedu Singai Naadu, Enthan Veedu **Lyrics in Tamil Language** பூமி, உன்னை அழைக்குது உன்னை அழைக்குது, வா வா நம் நாடு, குரல் எழுப்புது குரல் எழுப்புது, வா வா பல இனங்கள் சேர, ஒருமை கொண்டாடி என் வீடு எந்தன் தாய் நாடு என்று சொல்லு பல இனங்கள் சேர, ஒருமை கொண்டாடி என் வீடு எந்தன் தாய் நாடு என்று சொல்லு சிங்கை நாடு, எந்தன் வீடு சிங்கை நாடு, எந்தன் வீடு **English Translation:** The land is calling you, come home Our country is calling you, come home Many races come together to celebrate unity Say that this is your home and your Motherland Singapore My Country, My Home **Notes** - Songs highlighted in yellow were designated as \"community songs\" by the National Arts Council. ## Reception A minor controversy also erupted over \"There's No Place I'd Rather Be\" (2007). Some people queried why the song does not mention Singapore by name, while others commented that the song was \"touching\" and that they related to it immediately, and that \"[t]he spirit of patriotism is woven so well in the song\". One correspondent to the *[Straits Times](/wiki/The_Straits_Times)* asked: \"How did such a dreadful song become the National Day song?\", lambasting the melody as \"uninspiring\" and the lyrics as \"insipid\" – \"it is quite obvious what the brief to [the composer] was: Write a song to persuade Singaporeans who have sought greener pastures to come home.\" The song's composer Jimmy Ye defended it, saying, \"There's no need for it to be so in-your-face just because it's a National Day song\". He noted that he had submitted the first draft of the song to the National Day Parade song committee, which had returned it with several changes. There was no mention of why \"Singapore\" got left out: \"I guess the committee wanted to have a soft-sell approach too\". Apart from \"There's No Place I'd Rather Be\", earlier songs like \"Shine On Me\" (2000), \"Where I Belong\" (2001), and \"We Will Get There\" (2002) also do not mention Singapore by name. - [Music of Singapore – National Day songs](/wiki/Music_of_Singapore#National_Day_songs) - [National Day Parade – Theme songs](/wiki/Singapore_National_Day_Parade#Theme_songs) ## Notes - Aisha Akbar, comp. (1966), *Thirty-Six Best Loved Songs of Malaysia and Singapore*, Singapore: Eastern University Press. - Cheng, Shao Chang; Leong, Yoon Pin (1973), *Our Songs*, Singapore: Educational Publications Bureau, 3 vols. - *Sing Singapore: A Celebration in Song, National Day 1988*, Singapore: F & N Sarsi in conjunction with Psychological Defence Division, Ministry of Communications and Information, 1988. - Teo, Lay Na, comp. (1980), *Sing a Song of Singapore*, Singapore: Educational Publications Bureau`{{citation}}`: CS1 maint: multiple names: authors list (link). - Zubir Said (1990), *Zubir Said: His Songs*, Singapore: Times Books International for Singapore Cultural Foundation. - www.sg music page - Sing Singapore\n",
  "language": "en",
  "processed_at": "2026-01-12T11:23:29.171100",
  "title": "List of Singaporean patriotic songs",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/List_of_Singaporean_patriotic_songs"
}