{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:25:15.617148"
  },
  "content": "This list **contains entries that may be out of scope and need to be evaluated for removal**. Please help clean it up by removing items that do not meet the inclusion criteria agreed upon on the talk page. *(August 2022)*This article may **require cleanup** to meet Wikipedia's quality standards. The specific problem is: **This list does not seem to adhere to some WP:BLP policies, specifically WP:BLPNAME.** Please help improve this article if you can. *(August 2022)* *(Learn how and when to remove this message)* The following is a list of **major** [crimes in Singapore](/wiki/Crime_in_Singapore) that happened between 1990 and 1999. They are arranged in chronological order. ## 1990 - 24 March 1990: At two different locations, two women were found murdered on that same night. One of them, 18-year-old Ng Lee Kheng, died from a fall from a flat at Circuit Road, while the other, Ng's 19-year-old best friend Foo Chin Chin, was stabbed fourteen times at an area near East Coast Park. The killings, which stirred the nation at that time, were all committed by 19-year-old carpenter [Ng Soo Hin](/wiki/Ng_Soo_Hin), who was Foo's boyfriend. Ng Soo Hin was charged with the two murders, and later stood trial solely for killing his girlfriend (who tried to break up with him before her death) while the other charge for killing Ng Lee Kheng was stood down temporarily. Despite confessing to the two murders, Ng Soo Hin stated he suffered from diminished responsibility at the time of the offences, but his defence was rejected and he was sentenced to death on 27 May 1993 for Foo's murder, and he was eventually hanged. - 16 April 1990: Mohamed Nasir bin Taha, 35, and Zainali bin Yahya, 29, abducted and raped a 26 year old Chinese woman using a White Nissan Van. The victim was abducted along Jalan Bumbong, off Woodlands Road, at 9.30pm. The men were said to have forced her into the van and raped her in it, then taking her to Pender Road in Mount Faber, off Telok Blangah Road. On June 8, at 11pm, they abducted another 19 year old girl along Dover Close and raped her in the van. They then attempted to murder the girl by throwing her, tied up, into a canal along East Coast road at 1am. - 15 May 1990: Known as the [Amber Beacon Tower murder](/wiki/Amber_Beacon_Tower_murder), both 21-year-old Kelly Tan Ah Hong and her boyfriend, 22-year-old James Soh Fook Leong, were attacked by two men while they were on a date at Amber Beacon Tower in [East Coast Park](/wiki/East_Coast_Park). Tan was stabbed in the neck while Soh was knifed in the back. Soh managed to reach a nearby restaurant to seek help before losing consciousness. Both of them were hospitalized. Soh survived the attack, but Tan died from her neck wound. Soh was unable to identify the attackers and had no idea why he and Tan were attacked. There were also no murder weapons found at the scene. A 2015 report revealed that Soh is married and has a son. He is still haunted by the memory of that incident. As of 2023[update], the case remains unsolved. - 16 June 1990: Indian national Hartej Sidhu and his Singaporean accomplice Sarjit Singh were arrested in the coffee shop of the [Sea View Hotel](/wiki/Sea_View_Hotel) on [Meyer Road](/wiki/Meyer_Road) after they had attempted to sell 1 kilogram of [heroin](/wiki/Heroin) and 10 kilograms of opium to an undercover Central Narcotics Bureau officer for a total of $40,000. Both were found guilty at trial and sentenced to death for the joint enterprise of trafficking over 600 grams of heroin and 9.3 kg of [opium](/wiki/Opium), and they were hanged on 19 May 1995. - 10 October 1990: 38-year-old Clementina Curci Di Girolamo, who had just migrated from Italy to Singapore with her family three days before her death, was found dead in a bathroom at her new house around Bo Seng Avenue. She had died due to being immersed in water and strangulation. 18-year-old [Maksa bin Tohaiee](/wiki/Maksa_bin_Tohaiee), a cleaner working for the family, had been stealing items from the house when Curci had caught and confronted him. They got into a fight which led to Curci losing consciousness after Maksa strangled her. Maksa claimed that he thought that she was dead so he left her body in the bathtub and fled. Maksa was arrested and charged with murder. Although he had confessed earlier, during the trial Maksa denied signing the confession and tried to establish an alibi that he was not at the murder scene on the day. However, the testimonies given by Maksa's family members about where Maksa's whereabouts at the time of the murder were riddled with inconsistencies, resulting in Maksa failing to substantiate his alibi defence. On 25 November 1992, Maksa was found guilty of murder and sentenced to death. Maksa filed an appeal to the [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore) and made a plea for presidential clemency, but both pleas were rejected and he was eventually hanged a year later on 26 November 1993. - 12 October 1990: 30-year-old [Tan Hui Ngin](/wiki/Tan_Hui_Ngin) was last seen leaving her home to go babysit her brother-in-law's children but she never came back. Tan was reported missing for four days before her half-naked corpse was discovered at an abandoned egg hatchery in [Punggol](/wiki/Punggol). Five months later, a suspect was arrested in Malaysia and extradited to Singapore to face a murder charge. The killer, who was Tan's childhood friend Lim Lye Hock, a Singaporean, was found guilty of murder by Justice [Lai Kew Chai](/wiki/Lai_Kew_Chai) and sentenced to death on 1 December 1993, and was eventually hanged. - 27 October 1990: 30-year-old Malaysian and [transvestite](/wiki/Transvestite) [Lim Yeow Chuan](/wiki/Lim_Yeow_Chuan) was found dead in Johore Road, [Bugis Street](/wiki/Bugis,_Singapore). His body was riddled with stab wounds. According to witnesses, Lim was last seen with two men, 23-year-old Malaysian national [Soosay a/l Sinnappen](/wiki/Soosay_a/l_Sinnappen) and 21-year-old Singaporean prison guard [Kuppiah s/o Saravanan](/wiki/Kuppiah_s/o_Saravanan), who were arrested and charged with Lim's murder. However, Soosay, who stabbed Lim, would eventually stand trial alone for murder, while Kuppiah was sentenced to five years' jail and 12 [strokes of the cane](/wiki/Caning_in_Singapore) for robbery and assault. At the trial in 1992, Soosay told the court that they had a friend, Leo Chin Hwang, who had met Lim two days before the murder, and revealed that Lim had stolen Leo's gold chain and money; Leo had sought Soosay and Kuppiah's help to get the gold chain back from Lim. However, when they confronted Lim, he not only refused to return the gold chain, but also turned aggressive and threatened the men with a knife, going as far as to insult Soosay's mother. Soosay then fought with Lim. When Lim refused to stop fighting, Soosay stabbed him a few times. Lim had pursued the two men for a few yards before he collapsed and died. Soosay's account was corroborated by Kuppiah's testimony at the trial. On 2 November 1992, Soosay was found guilty of murder and sentenced to death by [High Court](/wiki/High_Court_of_Singapore) judge M. P. H. Rubin. However, upon appeal, the [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore) found Soosay guilty of [culpable homicide](/wiki/Culpable_homicide) not amounting to murder on 10 August 1993, and sentenced him to nine years in jail. - 6 November 1990: Mr Ng Kwang Keng drove to 27-year-old Mr Lim Kim Leng's residence at Block 14 Taman Ho Swee with two other men, identified as “Tan” and “Pui Kia”. He then stabbed Lim in the upper thigh after an argument regarding $22,000 Lim owed him.Lim subsequently died on 8 December after developing renal failure and other complications. Lim was arrested in Malaysia and deported back to Singapore in 2023. He was convicted of voluntarily causing grievous hurt by dangerous weapons or means, and will be sentenced on 30 December. - 22 November 1990: - 20-year-old National Serviceman [Lee Teck Sang](/wiki/Lee_Teck_Sang), who deserted from his military service and hid at [Singapore Polytechnic](/wiki/Singapore_Polytechnic) for 17 days, armed himself with a knife and attacked a 45-year-old lecturer Tan Chin Liong. Tan, a Malaysian, was stabbed three times, and one of the wounds penetrated the heart, causing him to die from excessive blood loss. Lee was arrested, and sentenced to death for murder on 7 October 1992. He lost his appeal and was hanged on 29 July 1994. - Hong Kong national [Daniel Chan Chi-pun](/wiki/Daniel_Chan_Chi-pun) was caught with 464g of heroin. He was found guilty of drug trafficking and sentenced to death on 8 May 1993. Chan's appeal was dismissed and he was initially scheduled to hang on 25 November 1994, before it was postponed by a clemency appeal. Subsequently, the plea was denied, and Chan was hanged at the age of 38 on 10 March 1995. - 1 December 1990: At her rented house in Katong, a 20-year-old Malaysian woman named [Wong Mee Hiong](/wiki/Wong_Mee_Hiong) was murdered by one of her male tenants Yap Biew Hian, who stabbed her with a knife and bludgeoned her head with a spanner while attempting to steal her valuables. Yap, a Malaysian, also fled to Malaysia but was arrested nine days later when he returned to Singapore. 22-year-old Yap was charged and sentenced to death for murder three years later on 10 March 1993. His appeal was dismissed in October 1993, and he was eventually executed. - 10 December 1990: Nigerian nationals Gabriel Okonkwo and Paul Okechukwu Ngwudo were arrested at the Harbour View Dai-Ichi hotel on Anson Road, after the [Central Narcotics Bureau](/wiki/Central_Narcotics_Bureau) raided their room and discovered 784 grams of heroin in the secret compartment of a briefcase. Undercover [DEA](/wiki/Drug_Enforcement_Administration) agent Wilbert Lee Plummer, who was also involved in the operation that resulted in the arrest of [Johannes van Damme](/wiki/Johannes_van_Damme), had earlier collected another briefcase containing heroin from the pair, on the understanding that he was a [drug mule](/wiki/Mule_(smuggling)) who would take it back to [America](/wiki/America). Both were found guilty of drug trafficking, sentenced to death, and hanged on 5 August 1994. - 14 December 1990: At a void deck in [Marsiling Drive](/wiki/Marsiling), 14 members of infamous gang [Ang Soon Tong](/wiki/Ang_Soon_Tong) arrived to wage a war with their rival gang Gi Leng Hor, which was active in that area itself. Several innocent bystanders were attacked by the Ang Soon Tong under the presumption that they were gang members. Five people were injured and a sixth victim, [Sivapragasam Subramaniam](/wiki/Sivapragasam_Subramaniam) (a 20-year-old Malaysian), died as a result. The 14 Ang Soon Tong members were arrested and charged with the murder of Sivapragasam, and in the end, the gang's headman Sagar Suppiah Retnam was convicted and hanged on 7 July 1995 for murder, while the remaining 13 people were jailed for lesser charges of rioting and causing grievous hurt (with some of them given caning for the offences). ## 1991 - 12 February 1991: 78-year-old [Sukarti Amari](/wiki/Sukarti_Amari) was attacked and strangled to death by two men, who intruded her flat at Telok Blangah and blinded her by throwing chilli powder into her eyes. The two killers - 29-year-old Mohamed Jaafar Abidin and 34-year-old Yacob Rusmatullah - used raffia string to strangle Sukarti and even stole her gold valuables from her flat. Three months later, the police managed to arrest the two of them and charged them with murder. Subsequently, Yacob and Jaafar were found guilty of murdering Sukarti and sentenced to death on 13 April 1993. After the loss of their appeals against the death penalty, Jaafar and Yacob were both hanged on 26 August 1994. - 27 February 1991: At his house in Geylang, 32-year-old businessman [Ng Keng Hua](/wiki/Ng_Keng_Hua) was attacked and stabbed by two burglars who entered his home. Ng was fatally wounded on the lung and heart and he died as a result. Within a month, the police managed to arrest one of the burglars, Tan Bee Hock, who was charged with murder. Tan, who was identified as the one responsible for the fatal stabbing, put up a defence that Ng's death was an accidental stabbing resulting in death, and he only wanted to commit burglary with his friend, Toh Laie, who was not arrested at the time of Tan's trial. Tan was found guilty of murder and sentenced to death in March 1993, while Toh, who was classified as one of Singapore's ten most wanted criminals, remains on the run as of today. - 19 April 1991: 59-year-old Dutch national Maria Krol-Hmelak was arrested after the [Central Narcotics Bureau](/wiki/Central_Narcotics_Bureau) raided her room at the Holiday Inn Park View hotel on [Orchard Road](/wiki/Orchard_Road) and found five steel cylinders (which were engine [pistons](/wiki/Piston)) containing a total of 1.6 kilograms of [heroin](/wiki/Heroin). Her accomplice, 36-year-old Nigerian national Peter Johnson, had been arrested a few days earlier at the same hotel after being found with a similar steel cylinder containing more than 330 grams of heroin. Krol & Johnson both worked for a Nigerian firm (Kenrod Limited) who sent them on business trips to Asia. During their trial in October 1994, Krol claimed to have been handed the six engine pistons by a cousin of her boss in [Bangkok](/wiki/Bangkok), who instructed her to take them to Singapore and then arrange their transport to [Nigeria](/wiki/Nigeria). She thereafter gave one of the cylinders to Johnson so that he could enquire with local cargo companies about their export overseas. However Johnson, who claimed to be in Singapore on a business trip to buy sewing machines, testified that Krol had asked him to keep one of the cylinders as security for a $500 loan. Both claimed not to know that the cylinders contained heroin, as they were sealed so completely that the authorities had to use a metal saw to open them. Both Krol & Johnson were acquitted after a 29 day trial by Justice Lai Kew Chai, who ruled Krol had effectively rebutted the presumption of possession with intent to commit drug trafficking by giving constituent testimony throughout the proceedings and her evidence had therefore cleared Johnson of all charges also. Krol then returned to [The Netherlands](/wiki/The_Netherlands) while Johnson flew home to Nigeria. - 23 April 1991: Ten-year-old schoolgirl [Kuah Bee Hong](/wiki/Kuah_Bee_Hong) was found murdered at her flat in Viking Road by her sister who just returned home from school. The killer was revealed to be Goh Hong Choon, the 25-year-old neighbour and friend of the Kuah family. Goh entered the house that day to commit robbery, and for fear of leaving behind witnesses, Goh killed Kuah by strangulation and even slit her wrists to make sure she was dead. Goh was found guilty after a 2-day murder trial and sentenced to death on 22 April 1993. Goh was executed on 29 July 1994. - 4 May 1991: 39-year-old Filipino domestic worker [Flor Contemplacion](/wiki/Flor_Contemplacion) murdered another Filipino domestic worker, 34-year-old Delia Maga, and Nicholas Huang, the four-year-old son of Maga's employer. She was sentenced to death in January 1993 and hanged on 17 March 1995. The incident caused diplomatic relations between Singapore and the Philippines to be strained for some years. - 13 May 1991: 23-year-old Malaysian national Lai Kam Loy Tee Seh Ping, along with his accomplices Yeo Choon Chau and Yeo Choon Poh, were arrested at the Apollo Hotel on Havelock Road after attempting to sell approximately 2.2 kilograms of heroin to an undercover Central Narcotics Bureau officer for $39,000. The gang had earlier that morning smuggled the drugs into Singapore via the [Woodlands Checkpoint](/wiki/Woodlands_Checkpoint) after smearing the packages in [toothpaste](/wiki/Toothpaste) to prevent detection by narcotic [sniffer dogs](/wiki/Sniffer_dogs). After being found guilty at trial and sentenced to death for the joint enterprise of trafficking 200 grams of pure heroin, they were all hanged on 13 May 1994. - 16 July 1991: 17-year-old [Lam Hoi-ka](/wiki/Lam_Hoi-ka) and 19-year-old [Poon Yuen-chung](/wiki/Poon_Yuen-chung), two Hong Kong tourists who flew from [Bangkok](/wiki/Bangkok) to Singapore, were arrested by the police at [Changi Airport](/wiki/Changi_Airport) for carrying a total of more than 6 kg of heroin, which were hidden in the false bottom of their suitcases. The two women were found guilty of drug trafficking on 28 September 1993. High Court judge M. P. H. Rubin sentenced Lam to indefinite imprisonment under [the President's Pleasure](/wiki/The_President%27s_Pleasure) due to her actual age of 17 years and 6 months at the time of her arrest. As for Poon, she was sentenced to death since her actual age was 18 years and 10 months when she committed the offence. After her appeals were dismissed, Poon was hanged on 21 April 1995. - 29 August 1991: 21-year-old [Angel Mou Pui Peng](/wiki/Angel_Mou_Pui_Peng), a Macau-born Hong Kong resident with Portuguese citizenship, was caught at the [Changi Airport](/wiki/Changi_Airport) for importing 4 kilograms of heroin into Singapore. She was charged for the offence the next day, and on 11 March 1993, Mou was found guilty as charged and sentenced to death, and had failed in her appeals to overturn the sentence. Initially scheduled to hang on 22 December 1994, Mou was granted a two-week stay of execution so her family could visit her in prison and celebrate Christmas with Mou one final time before she could be put to death. At the end of the stay order, Mou's execution was re-scheduled on 6 January 1995, and despite the pleas for mercy by politicians from Portugal, Macau and Hong Kong, Mou was executed as scheduled on 6 January 1995. - 27 September 1991: 56-year-old Dutch national [Johannes van Damme](/wiki/Johannes_van_Damme) was arrested at [Changi Airport](/wiki/Changi_Airport) after the police found 4.3 kg of heroin in his suitcase. He was found guilty of drug trafficking, sentenced to death, and hanged on 23 September 1994. - 22 November 1991: Thai nationals Vinit Sopon and his accomplice Pairoj Bunsom were arrested in the Apollo Hotel on Havelock Road after they had attempted to sell 2.1 kilograms of heroin to an undercover Central Narcotics Bureau officer for $140,000. Both were found guilty at trial and sentenced to death for the joint enterprise of trafficking approximately 1.4 kilograms of pure heroin, and they eventually were hanged on 16 December 1994. ## 1992 - 26 March 1992: 38-year-old Goh Lai Wak was arrested in the coffee shop of The Miramar Hotel in [Bukit Merah](/wiki/Bukit_Merah) after Goh had attempted to sell approximately 2.7 kilograms of heroin to an undercover Central Narcotics Bureau officer for $33,000. A [revolver](/wiki/Revolver) with live rounds of ammunition was discovered tucked into Goh's trousers by arresting officers at the scene. During his trial in December 1993, Goh claimed he was at the hotel to deliver 5 cartons of duty free [Salem cigarettes](/wiki/Salem_cigarettes), and that the undercover officer switched the bag he handed over to one containing drugs after he briefly took it to the toilet to inspect its contents. Justice Goh Phai Cheng dismissed Goh's testimony as untrue and sentenced him to death for the trafficking of 120 grams of pure heroin. Goh was eventually hanged on 30 September 1994. - 30 March 1992: A car bomb exploded at Bedok Reservoir Road, killing 32-year-old Soon Ah Tin and injuring her 33-year-old husband Wong Eng Meng. - 26 July 1992: 28-year-old [Elke Tsang Kai-mong](/wiki/Elke_Tsang_Kai-mong), a Hong Kong merchandiser and daughter of a police officer, was caught carrying more than 4kg of diamorphine when she was arrested at [Changi Airport](/wiki/Changi_Airport). Tsang was therefore charged with drug trafficking, and she was found guilty on 19 October 1993, and sentenced to death on the same day of her conviction. Tsang lost her appeal in January 1994, and she was hanged on 16 December 1994. - 18 November 1992 and 17 September 1993: A gang of five Thai workers - Prawit Yaowbutr, Manit Wangjaisuk, Panya Marmontree, Prasong Bunsom and Panya Amphawa - were involved in a series of worksite robberies, which resulted into the [deaths of three foreign workers](/wiki/1992%E2%80%9393_construction_site_murders): a Burmese worker in November 1992 and two Indian workers in September 1993. All five were arrested and charged with gang robbery with murder. All five were later found guilty and were eventually hanged on 15 March 1996. - 19 November 1992: After a failed hold-up at Tin Seng Goldsmith, 26-year-old [Ng Theng Shuang](/wiki/Ng_Theng_Shuang) and 27-year-old [Lee Kok Chin](/wiki/Lee_Kok_Chin), both Malaysians armed with guns and grenades, engaged in a shootout with 22-year-old Cisco officer Karamjit Singh and Singh was injured on the thigh as a result of Ng shooting him but he survived. Two other people - 57-year-old salesman Ou Kai San and 39-year-old Rosie Kee Lye Choon were also shot by Ng but they survived as well. During the robbers' escape, Lee was shot in the chest by Singh and he died while getting away on a motorcycle. Ng alone escaped from Singapore to Penang, where he was caught on 29 December 1993. On 15 September 1994, Ng was found guilty of illegally discharging a firearm under the amended Arms Offences Act, which mandated the death penalty for the crime Ng was convicted of. Ng lost his appeal against the death sentence and he was hanged on 14 July 1995. As for Ng's accomplice Lee Kok Chin, he was suspected of killing another moneychanger during an unrelated robbery and a coroner's court found Lee guilty of the murder on 1 December 1997. In the aftermath, Officer Singh, who recovered and returned to his job after a six-month medical leave, received a plate from Certis Cisco and a certificate of commendation from the police, and Singh, who was since married with two daughters, commented in a 2014 article that he never forgotten about the incident despite leaving the past behind him. - 29 November 1992: 26-year-old Maniam Rathinswamy and his accomplice, 31-year-old S.S. Asokan, used an axe to murder 32-year-old illegal moneylender [Tan Heng Hong](/wiki/Tan_Heng_Hong). After killing Tan, the duo drove his car to [Mandai](/wiki/Mandai), where they set fire to the car with his body inside. Forensic pathologist [Chao Tzee Cheng](/wiki/Chao_Tzee_Cheng) managed to ascertain Tan's identity and identify that the cause of death was a cut artery on the neck. Maniam, who was arrested and charged in January 1993, was sentenced to death for murder on 3 December 1993. Asokan, who had fled to Malaysia before he was arrested and extradited to Singapore to stand trial, was charged with murder and found guilty on 19 January 1995, and received the death penalty as well. Both Asokan and Maniam were hanged on 9 September 1995. The case was re-enacted in *Whispers of the Dead*, a Singaporean crime show which features notable cases solved by Chao Tzee Cheng. - 24 December 1992: On Christmas Eve, 22-year-old Junalis Lumut and 21-year-old Mohammad Ashiek Salleh robbed and killed taxi driver [Teo Kim Hock](/wiki/Teo_Kim_Hock) and called his family for ransom. The duo were subsequently arrested for Teo's murder and were found guilty of murder and on 13 November 1994, the duo were sentenced to death and later hanged on 16 June 1995 after losing their appeals. On 17 April 1992, it was discovered that Junaidi also murdered another taxi driver, 57-year-old [Seing Koo Wan](/wiki/Seing_Koo_Wan) in an unrelated case. ## 1993 - 26 February 1993: Known as the [Hougang double murders](/wiki/Hougang_double_murders), 53-year-old Lau Gek Leng and his 55-year-old wife Luke Yip Khuan were both killed by their 38-year-old neighbour Jamaludin Ibrahim inside their matrimonial flat at [Hougang](/wiki/Hougang). Jamaludin also stole a television set and VCR from the couple's flat. After the couple's son and second daughter found the bodies and called the police, Jamaludin was arrested hours later after his daughter told police that she witnessed her father stealing the missing items from the couple's flat. After failing to substantiate his defence of diminished responsibility, Jamaludin was sentenced to death for the two murders on 21 November 1994, and he was hanged on 28 July 1995 after losing his appeals. - 8 March 1993: 35-year-old Inspector [Rajab Mohamed](/wiki/Rajab_Mohamed) of the [Central Narcotics Bureau](/wiki/Central_Narcotics_Bureau) disappeared after he was last seen by his wife leaving home to meet an informant, and his last phone call was to his colleagues, informing them to get ready for a drug bust. Inspector Rajab's wife reported her husband missing a day later and subsequently, the police arrested the 34-year-old informant [Roshdi Abdullah Altway](/wiki/Roshdi_Abdullah_Altway), who was the same informant Inspector Rajab was planning to meet before he disappeared. Roshdi confessed that he killed Inspector Rajab by fatally hitting him on the head with a chilli mortar during a fight over some money issues, and even led the police to a [Tampines](/wiki/Tampines) carpark he abandoned the officer's decomposing body and car. Roshdi was charged and put on trial, and sentenced to death for murdering Inspector Rajab in 1993 after the trial court rejected his claims of self-defense. However, in 1994, the Court of Appeal accepted that Roshdi acted in self-defense during the fight that took the life of Inspector Rajab, and due to this ruling, Roshdi's murder conviction and death sentence were both set aside and he was instead given ten years' jail for manslaughter, as well as a consecutive sentence of six years' jail with 12 strokes of the cane for stealing and possessing the dead officer's revolver and six bullets. Although Roshdi successfully escaped the gallows for killing Inspector Rajab, he was sentenced to death a second time 26 years later in 2020 for trafficking 78.77g of diamorphine. Roshdi was ultimately hanged on 10 April 2025 for the drug offence after losing his appeals against his second death sentence. - 14 July 1993: After his request to borrow money was rejected by a moneylender, 36-year-old [Phua Soy Boon](/wiki/Phua_Soy_Boon) used a chopper to attack the 50-year-old moneylender Sim Ah Lek, who also worked as a contractor. Sim died due to two fatal wounds on his neck that caused him to suffer excessive blood loss. The body, which was stuffed inside a gunny sack, was discovered the next day at a carpark outside Jurong Swimming Complex. Phua was arrested a day after the body was discovered, and charged with murder. Phua was found guilty as charged and sentenced to death on 6 May 1994, and after losing his appeals, Phua was hanged on 16 June 1995. - September 1993: 25-year-old Chong Poh Choon, a [navy](/wiki/Republic_of_Singapore_Navy) sergeant, murdered his three children at their flat in [Bukit Batok](/wiki/Bukit_Batok). He was sentenced to [life imprisonment](/wiki/Life_imprisonment) in September 1994. - 8 October 1993: 50-year-old [Shamsul Hameed](/wiki/Shamsul_Hameed), an Indian moneychanger, was strangled to death by his friend during a drinks session, after they both argued over a prostitute. The friend, 23-year-old Jahabar Bagurudeen, who was an Indian businessman, was arrested and sentenced to death in July 1994 for killing Shamsul, and he was executed on 2 June 1995. - 25 October 1993: While they were having their supper at a Chander Road coffee shop, 34-year-old [Thampusamy Murugian Gunasekaran](/wiki/Thampusamy_Murugian_Gunasekaran) and 41-year-old Murugear Singaram were attacked by three men, who were armed with weapons. Thampusamy sustained severe skull fractures and died, while Murugear survived with minor injuries. One of the suspects, 31-year-old Anbuarsu Joseph, was arrested in March 1994 and charged with murder; Anbuarsu was the leader of infamous gang Gi Leng Kiat, and had led the attack in order to wage war on their rival gang [Ang Soon Tong](/wiki/Ang_Soon_Tong). Anbuarsu was found guilty of murdering Thampusamy and sentenced to death in August 1994, and he was hanged in [Changi Prison](/wiki/Changi_Prison) on 7 July 1995. The remaining two assailants were still at large as of today. - 25 November 1993: 22-year-old [Rozman Jusoh](/wiki/Rozman_Jusoh) and his childhood friend Razali Mat Zin were both arrested for trafficking nearly 2kg of [marijuana](/wiki/Marijuana) (or cannabis). Rozman and Razali, who were both Malaysians from [Kelantan](/wiki/Kelantan), were charged with two counts and brought to trial in October 1994. Rozman was found to have a sub-normal IQ of 74 and easily prone to manipulation, which may have played a part in Rozman selling drugs to undercover officers (who pretended to be marijuana buyers) after their persuasion. Razali, on the other hand, stated that he only rode the motorcycle that day to escort Rozman out of goodwill for his friend and fellow villager and did not know the presence of drugs on his motorcycle. Rozman was therefore sentenced on 7 March 1995 to seven years' imprisonment for two reduced charges of drug possession while Razali was cleared of all charges on the same day. However, the prosecution appealed against the trial verdict in August 1995, and it led to the Court of Appeal sentencing both Rozman and Razali to death for the original drug charges, on the grounds that both Razali and Rozman were active and willing participants in selling drugs despite the latter's low intellect and such mitigating factors cannot be used to discount the mandatory nature of the death penalty or the intention to commit the crime. Both men were hanged on 12 April 1996. - 14 December 1993: Three youths – Too Yin Sheong, Ng Chek Siong and Lee Chez Kee – attempted to rob 54-year-old university professor [Lee Kok Cheong](/wiki/Murder_of_Lee_Kok_Cheong) at his home and ended up killing him. The trio were only identified, arrested and put on trial between 1997 and 2006. In August 1998, 26-year-old Too Yin Sheong, who was arrested in December 1997, was convicted of murder and sentenced to death; he was hanged on 30 April 1999. In the same year of Too's trial, a 27-year-old Ng, who was apprehended in May 1998, was sentenced to eight years' imprisonment and ten [strokes of the cane](/wiki/Caning_in_Singapore) for robbery, theft and cheating. Lee, who caught in February 2006, was sentenced to death in October 2006 and the [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore) dismissed his appeal in May 2008, and he was eventually hanged. ## 1994 - 5 January 1994: In a gang-related incident, 15-year-old [Chia Lap Lai](/wiki/Murder_of_Chia_Lap_Lai) was beaten to death by three youths in the lift of a [Teban Gardens](/wiki/Teban_Gardens) HDB block where he lived. The three youths, Ng Beng Kiat, Allan Ong Chee Hoe and Kyaneth Soo Kian Fong, all aged 17, fled to Malaysia after the killing. Ng surrendered himself in August of the same year, while Ong and Soo were only apprehended several years later. All three were charged with murder; however due to their ages, they were sentenced to detention at [The President's Pleasure](/wiki/The_President%27s_Pleasure_(Singapore)). After appealing to President [Tony Tan](/wiki/Tony_Tan) in 2012, Ong and Soo were released. Ng’s date of release is unknown. - 16 April 1994: When 80-year-old Loo Kwee Hwa was on the way to a friend's flat at Bedok North to play a card game, she was attacked inside a lift by a robber who not only robbed her of her gold chain and bangle, but also slit her throat using a paper cutter, causing Loo to die while staggering to a flight of stairs between the 15th and 16th floor. Two weeks later, a 22-year-old drug addict named [Indra Wijaya Ibrahim](/wiki/Indra_Wijaya_Ibrahim) was arrested for the killing, and he was charged with murder. After Indra stood trial in January 1995, he was sentenced to death a month later on 7 February 1995, and after losing his appeals, Indra was put to death at [Changi Prison](/wiki/Changi_Prison) on 29 September 1995. - 6 June 1994: In a case known as the [Oriental Hotel murder](/wiki/Oriental_Hotel_murder), 25-year-old Abdul Nasir bin Amer Hamsah and 32-year-old Abdul Rahman bin Arshad barged into a room shared by two Japanese tourists – 49-year-old Fujii Isae and 56-year-old Takishita Miyoko. Earlier that day, the two men were at the [Oriental Hotel](/wiki/Mandarin_Oriental_Singapore) for a job interview when they spotted the Japanese tour group that Fujii and Takishita were with. They decided to rob the two women; Takishita was assaulted by Rahman and she pretended to faint to escape further injury. When Nasir attempted to escape after severely assaulting and robbing Fujii, he lost his balance and accidentally stepped on Fujii's face as he held onto the wall to try to steady himself, causing a facial fracture which obstructed her breathing and caused her death. Despite appeals for witnesses and a police sketch of the robbers being published on newspapers, the case went unsolved for 18 months. In January 1996, Nasir was arrested for attempting to rob and murder a taxi driver, and his fingerprints were found to match those found in Fujii and Takishita's room. Nasir confessed that he was involved in the robbery, while Rahman was later found to be in prison serving a 20-month jail sentence for theft. Both men were charged with murder; however, Rahman's charge was reduced to robbery with hurt, and he was sentenced to 10 years' jail and 16 [strokes of the cane](/wiki/Caning_in_Singapore). At the end of Nasir's murder trial on 4 July 1996, [High Court](/wiki/High_Court_of_Singapore) judge [Choo Han Teck](/wiki/Choo_Han_Teck) accepted Nasir's defence that he accidentally stepped on Fujii's face while rejecting the prosecution's argument that Nasir intentionally stamped on Fujii's face to kill her. For this, Nasir was acquitted of murder and he was sentenced to 18 years' jail and 18 strokes of the cane for robbery with hurt. The prosecution appealed against Nasir's acquittal. However, by a split decision of 2 to 1, the [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore) dismissed the appeal. Nasir still had to go back to court to face a kidnapping charge, which he committed during the time of his remand. At the time of his remand, Nasir, together with drug trafficker Low Theng Gee, briefly kidnapped two police officers for ransom before being subdued by the police. Nasir was later found guilty of kidnapping and sentenced to [life imprisonment](/wiki/Life_imprisonment) and 12 strokes of the cane on 3 March 1997. However, the life sentence was ordered to run consecutively with the jail term he received for robbing Fujii, meaning that he would be serving a total of 38 years in prison. Nasir appealed for the two jail terms to run concurrently, but it was dismissed on 20 August 1997. However, in the course of the appeal, Chief Justice [Yong Pung How](/wiki/Yong_Pung_How) also decided that life imprisonment should be considered as a term of incarceration for the remainder of a convicted prisoner's natural life instead of a jail term of 20 years. He also ruled that this amendment will apply to future cases after 20 August 1997. Nasir was not affected by this amendment, hence his life term remained a 20-year prison sentence, and he would be spending 38 years behind bars. - 30 November 1994: 27-year-old [Zainal Abidin Abdul Malik](/wiki/Zainal_Abidin_Abdul_Malik), who had a long criminal record for robbery and housebreaking offences, was returning from a foiled robbery attempt at a hotel near Newton Road when he encountered two police officers who were on their routine spot checks. When the officers approached him to discharge their usual duties, Zainal Abidin took out an axe and violently struck one of the officers - 47-year-old Senior Staff Sergeant [Boo Tiang Huat](/wiki/Boo_Tiang_Huat) - on the head, leading to SSSgt Boo dying instantly on the spot. Zainal Abidin was subsequently arrested after a manhunt and charged with murder. For intentionally using the axe to directly kill SSSgt Boo, Zainal Abidin was found guilty and sentenced to death on 15 July 1995, and after losing his appeals against the sentence, Zainal Abidin was hanged on 30 August 1996. In the aftermath, SSSgt Boo was posthumously promoted as Station Inspector (SI) for his long years of service in the [Singapore Police Force](/wiki/Singapore_Police_Force). As of today, SI Boo Tiang Huat remains as the last [policeman in Singapore to be murdered while in the line of duty](/wiki/List_of_Singapore_police_officers_killed_in_the_line_of_duty). ## 1995 - 22 January 1995: - 47-year-old [Lee Kok Yin](/wiki/Lee_Kok_Yin), a [ComfortDelGro](/wiki/ComfortDelGro) taxi driver, was attacked by four Thai migrant workers who hailed his taxi from [Hougang](/wiki/Hougang) to [Woodlands](/wiki/Woodlands,_Singapore) and targeted him during a robbery bid. Lee died from a lethal knife wound to his neck. Four months after his murder, two suspects - 26-year-old Kraisak Sakha and 29-year-old Pracha Thanomnin - were caught and indicted for murder, while the final two assailants, known only as \"Wan\" and \"Dorn\", were never caught. In January 1996, Judicial Commissioner Amarjeet Singh found both Pracha and Kraisak guilty of murdering Lee and sentenced them to death, but upon his appeal in May 1996, Kraisak's murder conviction was reduced to attempted robbery and his death sentence was commuted to five years' imprisonment and six strokes of the cane, although he was assessed to be medically unfit for caning and therefore spared the cane. On the other hand, Pracha lost his appeal and he was eventually hanged on 10 January 1997. As of today, both Dorn and Wan remain on the run for killing Lee. - 63-year-old taxi driver [Tay Chin Wah](/wiki/Tay_Chin_Wah) fired a revolver at a moneylender Lee Yang Ping and his companion Soh Keng Ho, who both confronted Tay's girlfriend over a debt she owed to Lee. Although the shooting left Lee injured, Lee was able to recover fully with timely medical treatment. Tay fled to Malaysia, where he was arrested and extradited to Singapore about five years later. In February 2001, Tay was found guilty of illegally discharging his firearm with intent to cause harm and [sentenced to death](/wiki/Capital_punishment_in_Singapore) under the [Arms Offences Act](/wiki/Arms_Offences_Act). Tay was hanged on 26 October 2001 after the loss of his appeal. - 16 February 1995: 35-year-old Thai worker [Somwang Yapapha](/wiki/Somwang_Yapapha) was battered to death with a sledgehammer by both his compatriots Khampun Sriyotha and Samlee Prathumtree over their interpersonal conflicts during a drinking session. Khampun and Samlee both put up a defence that there was a fight between them all while they were drinking, which caused the two defendants to bludgeon Somwang to death during the fight itself. The claims of self-defence were rejected by the High Court and the pair were hence found guilty of murdering Somwang and sentenced to death in November 1995. Both Samlee and Khampun lost their appeals, and they were jointly hanged on 4 July 1997. - 26 February 1995: Britain's oldest merchant bank, [Barings Bank](/wiki/Barings_Bank), collapsed due to the trading activities of [Nick Leeson](/wiki/Nick_Leeson), who lost S$1.4 billion by speculating on the [Singapore International Monetary Exchange](/wiki/Singapore_International_Monetary_Exchange) primarily using [futures contracts](/wiki/Futures_contract). Leeson was arrested on 23 November 1995 after fleeing Singapore for 272 days. He pleaded guilty to two out of three charges of forgery and eight charges of cheating and was sentenced by district judge Tan Siong Thye to six years and six months in prison. - 8 March 1995: British national [John Martin](/wiki/John_Martin_Scripps) killed South African national Gerard George Lowe in [River View Hotel](/wiki/River_Valley,_Singapore), dismembered his body, and disposed the body parts in the [Singapore River](/wiki/Singapore_River). He was arrested at [Changi Airport](/wiki/Changi_Airport) on 19 March 1995 with some controlled items (e.g. an [electroshock weapon](/wiki/Electroshock_weapon)) and 24 sticks of [cannabis](/wiki/Cannabis) in his possession. On 7 November 1995, [High Court](/wiki/High_Court_of_Singapore) judge [T. S. Sinnathuray](/wiki/T._S._Sinnathuray) found Martin guilty of murder and sentenced him to death. Martin was eventually hanged on 19 April 1996 after withdrawing his appeal to the [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore) and turning down his chance to appeal for presidential clemency. - 17 April 1995: 40-year-old [Nadasan Chandra Secharan](/wiki/Nadasan_Chandra_Secharan) allegedly killed his 39-year-old girlfriend, Ramapiram Kannickaisparry. Ramipiram's face was brutally slashed and her body was rolled over several times by a vehicle before her body was abandoned in a forested area in [Sembawang](/wiki/Sembawang). Nadasan was arrested on 20 April 1995 and charged with murder. Some gold items and jewellery were found in Nadasan's van, and a tooth fragment was found at the underside of the van. After the tooth was confirmed to be Ramapiram's, the prosecution alleged that Nadasan had killed Ramipiram and ran her over with his van. A forensic expert confirmed that the tyre marks on Ramapiram's body belonged to Nadasan's van. However, the defence lawyer, [Subhas Anandan](/wiki/Subhas_Anandan), argued that Nadasan did not kill Ramipiram. The two forensic experts called by the defence claimed that the prosecution's expert witnesses were wrong to conclude the tyre marks were from Nadasan's van and that the tooth was Ramapiram's. Nadasan also denied killing Ramipiram, stating that he was on his way home on the day of the murder when his van broke down, and that he had taken over an hour to fix the van as it was raining. Nadasan also added he and Ramapiram had been intimate inside his van, and that Ramapiram had a habit of using her teeth to open beer bottles so her tooth could have broken off during one of such occasions. However, the prosecution produced an expert witness who claimed that it would only take 30 to 40 minutes to fix a van. Anandan countered that the witness did not understand the nature of the van, and that Nadasan himself was not a well-trained mechanic. At the end of the trial, [High Court](/wiki/High_Court_of_Singapore) judge [Lai Kew Chai](/wiki/Lai_Kew_Chai) found Nadasan guilty and sentenced him to death for murder in October 1996. After Nadasan filed an appeal, the [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore) found the High Court's judgement weak and that the judge had erred in convicting Nadasan of murder despite all the evidence and arguments from both the prosecution and defence. Unanimously, in January 1997, the Court of Appeal allowed the appeal so Nadasan was acquitted of murder and released from prison. As of January 2022[update], the murder remains unsolved. - May 1995: Outside her flat at [Choa Chu Kang](/wiki/Choa_Chu_Kang), 29-year-old Tan Hang Cheng, a mother of two daughters, was accused of murdering her daughters, one aged two months and the other three years, by throwing them outside the flat to their deaths. Tan was later convicted of culpable homicide not amounting to murder, as she was suffering from depression and insomnia at the time of the murders. It was revealed in court that Tan was overly stressed with her sole responsibility to take care of her father-in-law and her two daughters, the latter two whom happened to be suffering from health conditions at a young age. Her baby who was born in February 1995, suffered from [jaundice](/wiki/Jaundice) while her elder child had [asthma](/wiki/Asthma). Her father-in-law often woke up in the middle of the night screaming due to nightmares, which worsen her insomnia. High Court judge [T S Sinnathuray](/wiki/T_S_Sinnathuray) sentenced Tan to a six-year term of imprisonment, after he personally addressed to her in his own words, \"You will have to live with the memory of what you have done and that may be a punishment far more severe than any punishment the court can impose on you.\" and to send a message of deterrence and the courts to not condone the conduct of criminals who committed crimes due to sympathetic circumstances. - 17 June 1995: 23-year-old Thai forklift operator [Suk Malasri](/wiki/Suk_Malasri) was bludgeoned to death by his Thai friend and welder Thongbai Naklangdon inside his living quarters at a Sungei Kadut construction site. Before his death, the victim threatened to seek revenge over a previous physical assault he suffered from four of his colleagues, and for fear that Suk would really seek revenge, Thongbai used an iron pipe to batter Suk to death. Thongbai was found guilty of murdering Suk and sentenced to death by the High Court in November 1995, and he was hanged on 30 August 1996. - 24 June 1995: 7-year-old [Lim Shiow Rong](/wiki/Lim_Shiow_Rong) was found raped and murdered after she was last seen running off from her mother's coffee shop to see a friend of her father. The case remains unsolved as of 2022. - 8 August 1995: At a brothel along [Teck Lim Road](/wiki/Teck_Lim_Road), 26-year-old [Sarawak](/wiki/Sarawak)-born Malaysian [Ching Bee Ing](/wiki/Ching_Bee_Ing), a prostitute working at the brothel, was attacked and stabbed by one of her co-workers Teo Kim Hong, which resulted in four fatal wounds that took Ching's life. Teo, a cousin of notorious gunman [Lim Ban Lim](/wiki/Lim_Ban_Lim), was arrested for the brutal stabbing and charged with murder. Judicial Commissioner [Choo Han Teck](/wiki/Choo_Han_Teck) found Teo guilty and sentenced her to death in January 1996. Teo lost her appeal in March 1996, and she was subsequently hanged at the age of 36 on 30 August 1996. - 30 October 1995: 27-year-old [Lim Chwee Soon](/wiki/Lim_Chwee_Soon) robbed a goldsmith shop known as Kee Hing Hung Rolex boutique at [People's Park Complex](/wiki/People%27s_Park_Complex). He also fired a gun seven times at the shop manager How Sau Che, who was injured but later survived. Lim stole four Rolex watches worth $80,000 during the robbery before fleeing on a stolen motorcycle. He was arrested in November 1995 at Kuala Lumpur and extradited to Singapore for trial. Lim was found guilty under the [Arms Offences Act](/wiki/Arms_Offences_Act) for use of firearms to commit robbery, and sentenced to death in July 1996. Lim was hanged on 25 July 1997 after losing his appeal. - 28 December 1995: At his rented flat in [North Bridge Road](/wiki/North_Bridge_Road), 82-year-old opium addict [Ng Gee Seh](/wiki/Ng_Gee_Seh) (also named Ng Ee Seng) was slashed on his throat and died after having an argument with his 27-year-old Malaysian friend Ong Teng Siew. Ong, who worked as a chicken slaughterer in Singapore, fled to Johor before he returned to Singapore days later to work, and he was thus arrested on 2 January 1996. Ong was charged with murder and despite his claims of diminished responsibility due to alcohol and opium intoxication and sudden and grave provocation, Ong was found guilty of murder and sentenced to death in August 1996. However, during the course of his appeal, Ong was hospitalized due to an outbreak of his skin disease, known as [Darier's disease](/wiki/Darier%27s_disease), a rare and hereditary skin disorder that could cause psychiatric illnesses. With the new information, a re-trial was granted and eventually, in April 1998, Ong's defence of diminished responsibility was accepted as he was indeed suffering from an abnormality of the mind as induced by Darier's disease at the time of killing Ng, and therefore, he was re-sentenced to life imprisonment for a reduced charge of manslaughter, which was affirmed by the Court of Appeal in May 1998. ## 1996 - 23 May 1996: 38-year-old [Benny Probocemdana Oen](/wiki/Benny_Probocemdana_Oen), a Chinese-Indonesian businessman, was stabbed by a lone assailant outside a discotheque he frequented at Pacific Plaza. Oen was mortally wounded and died at [Singapore General Hospital](/wiki/Singapore_General_Hospital) fifty minutes after the stabbing. Through five months of investigation, the police identified one possible suspect, 19-year-old Sim Eng Teck, a jobless teenager and Singaporean citizen. Sim was arrested on 11 March 1997 at [Johor Bahru](/wiki/Johor_Bahru) by the [Royal Malaysia Police](/wiki/Royal_Malaysia_Police), and indicted for murder. Although Sim claimed he never had the intent to commit murder and only wanted to stab Oen on the arm once out of vengeance for Oen selling him fake Ecstasy pills, the trial judge Amarjeet Singh found that Sim had intentionally attacked Oen and voluntarily inflicted the fatal wounds on Oen, and therefore sentenced Sim to death on 19 May 1998 for the \"daringly cold-blooded\" murder of Oen. Sim's appeal was rejected on 1 August 1998, and he was eventually hanged. - 26 May 1996: 23-year-old Asogan Ramesh Ramachandren, together with his two friends, 24-year-old Selvar Kumar Silvaras and 18-year-old [Mathavakannan Kalimuthu](/wiki/Mathavakannan_Kalimuthu), murdered 25-year-old Saravanan Michael Ramalingam, a gangster whom Asogan had previous conflicts with. On 27 November 1996, [High Court](/wiki/High_Court_of_Singapore) judge [Kan Ting Chiu](/wiki/Kan_Ting_Chiu) found the trio guilty of murder and sentenced them to death. After losing their appeals on 14 October 1997, the trio petitioned to President [Ong Teng Cheong](/wiki/Ong_Teng_Cheong) for clemency on 13 January 1998. However, the President declined clemency to Asogan and Selvar so they were eventually hanged on 29 May 1998. On 28 April 1998, the President granted clemency to a 19-year-old Mathavakannan, who then had his death sentence commuted to [life imprisonment](/wiki/Life_imprisonment). In 2012, a 33-year old Mathavakannan received an early release from prison for good behaviour after winning his appeal against the life sentence (as his life sentence was considered to be 20 years, since he committed the crime before 20 August 1997). - 26 August 1996: At a flat in Bedok Reservoir, [Chua Hwa Soon Jimmy](/wiki/1996_Bedok_Reservoir_flat_murder), a 25-year-old [Singapore Army](/wiki/Singapore_Army) sergeant, had brutally murdered his 39-year-old sister-in-law, Neo Lam Lye, and even slashed his four-year-old nephew, Chua Kwee Hao Garret. Neo was found dead with 109 stab and slash wounds on her body, while Garret survived. Witnesses told police they saw Chua running out of the flat with his hands and army uniform stained with blood. Following the witnesses' descriptions, the police tracked down and arrested Chua, who confessed that he killed Neo, and revealed that when he was 15, he had an affair with Neo who started it. He stated that he wanted to let go of the past and did not want to restart the affair again as he was already married for two years and had a daughter. Chua was then charged with the murder of his sister-in-law and the attempted murder of his nephew. At the end of the trial on 14 April 1997, [High Court](/wiki/High_Court_of_Singapore) judge [T. S. Sinnathuray](/wiki/T._S._Sinnathuray) rejected Chua's defence of [diminished responsibility](/wiki/Diminished_responsibility) and found him guilty of both charges, thereby sentencing him to death. Chua lost his appeal in February 1998 and was subsequently hanged. - 4 October 1996: - 29-year-old Kwan Cin Cheng, a Malaysian working in Singapore, was accused of murdering his 23-year-old Malaysian girlfriend [Phang Ai Looi](/wiki/Murder_of_Phang_Ai_Looi), whom he met since 1988, at Yung Kuang Road. Prior to the murder, Phang was said to have broke up with him in favour of another man and a heartbroken Kwan tried to make her come back to his side by threatening to kill himself in front of her, to which Phang coldly and callously insulted him for being useless and more inferior to her new boyfriend, with whom she was much happier with. Kwan was thus provoked into killing Phang and had stabbed her multiple times before he attempted to kill himself, and the police managed to intervene and arrest him before he could. On 25 April 1997, the judge acquitted Kwan of capital murder and instead found Kwan guilty of culpable homicide after accepting that Kwan could not be held fully accountable for his actions due to the killing being a product of \"a grave and sudden provocation\" and loss of self control. Consequently, Kwan was sentenced to ten years in jail. On 19 January 1998, the prosecution lost their appeal against Kwan's acquittal for murder, but the Court of Appeal, having observed the extreme violence and harrowness of Kwan's outburst during the crime, decided to increase Kwan's \"manifestly inadequate\" ten-year sentence to life imprisonment. - 29-year-old Zulkarnain bin Kemat murdered his drinking and smoking partner, 51-year-old Jetkor Miang Singh, at her flat in [Ang Mo Kio](/wiki/Ang_Mo_Kio). Zulkarnain and Singh had been arguing before the former stabbed the latter in the neck with a pocket nail knife and kicked her repeatedly. To conceal his crime, Zulkarnain wiped the table containing his fingerprints. He also discarded the ashtray, but failed to discard the cigarette butts which contained his saliva. The case was initially unsolved as the police could not establish concrete evidence that Zulkarnain had murdered Singh and [DNA profiling](/wiki/DNA_profiling) was not fully reliable. Over the years, as DNA profiling became more accurate and faster, collection of DNA samples from all convicts was made mandatory in 2002. The case was reopened in November 2003 and investigations revealed that the DNA sample found on the cigarette matched Zulkarnain's. In 2005, a 37-year-old Zulkarnain was charged with [culpable homicide](/wiki/Culpable_homicide) and sentenced by [High Court](/wiki/High_Court_of_Singapore) judge [Woo Bih Li](/wiki/Woo_Bih_Li) to eight years' imprisonment and six [strokes of the cane](/wiki/Caning_in_Singapore). His sentence ran concurrently with his sentence of six years and six months' imprisonment and three strokes of the cane for consuming drugs, which was imposed in September 2000. After his release, Zulkarnain was arrested again and sentenced to [life imprisonment](/wiki/Life_imprisonment) for drug trafficking on 20 November 2013. - 6 November 1996: 28-year-old [Kelvin Lim Hock Hin](/wiki/Kelvin_Lim_Hock_Hin) was arrested following a police report that he had allegedly sexually abused five boys (including his two godsons) ranging from the ages of 9 to 13 for over a year before his arrest. Lim was charged for illegally having unnatural sex with the minors, whom he enticed with gifts and free tuition before convincing them to allow him to perform sex on them. Lim, who had two previous convictions for such offences in 1988 and 1993 (for the first, he spent 15 months in prison and for the second, he served a jail sentence of 32 months), had in fact was only out of jail for only four months when he reoffended again. In June 1997, Lim pleaded guilty to 10 charges of unnatural sex, with another 30 charges against him. A psychiatrist, Liow Pei Hsiang, assessed him and she found that Lim was a [paedophile](/wiki/Paedophile) and had a sexual interest in young boys, and she told the court that his condition showed a high chance of reoffending. Bearing this in mind, on 29 August 1997, [High Court](/wiki/High_Court_of_Singapore) judge [T. S. Sinnathuray](/wiki/T._S._Sinnathuray) sentenced Lim to four consecutive terms of 10 years, effectively making Lim serve a total of 40 years in prison. The Court of Appeal later dismissed Lim's appeal and finalized his 40-year sentence. In their landmark ruling of Lim's appeal, the appeal judges decreed that for future cases of chronic paedophiles and sex offenders who were incapable of or unwilling to control themselves and targeted children as their victims should be liable to the maximum term of life imprisonment. Lim's High Court trial was the last major case heard by High Court judge Sinnathuray before his retirement three weeks after Lim's sentencing. ## 1997 - 12 March 1997: 43-year-old [Tan Tiong Huat](/wiki/Tan_Tiong_Huat), a loan shark and businessman, was shot at a carpark in Singapore's Beach Road, and he died from a gunshot wound to the head. Tan's death, which was classified as murder, remained unsolved for seven years before the suspected gunman, who fled Singapore for Thailand, was caught and extradited back to Singapore for trial. The gunman, Lim Thian Lai, was found guilty of illegally discharging his firearm with intent to cause harm and [sentenced to death](/wiki/Capital_punishment_in_Singapore) under the [Arms Offences Act](/wiki/Arms_Offences_Act) in May 2005. Lim lost his appeal in September 2005 and he was eventually hanged. - 13 March 1997: 53-year-old [Sivapackiam Veerappan Rengasamy](/wiki/Sivapackiam_Veerappan_Rengasamy) was found dead in a flat at [King George's Avenue](/wiki/Lavender,_Singapore). The police then interviewed Sivapackiam's 36-year-old tenant Gerardine Andrew, who told them that when she returned home after visiting her son, a group of two men and a woman suddenly came to the flat, apparently to rob her and her landlady. According to Andrew's statements, the trio had restrained Sivapackiam and threatened her with a knife to look for valuables, but she was later told to leave after she failed to locate any valuables. With this information, the police arrested the three robbers – 23-year-old Mansoor Abdullah, 28-year-old Nazar Mohamed Kassim, and 22-year-old Kamala Rani Balakrishnan. All three admitted to the robbery and revealed that Andrew was the mastermind. Andrew later confessed that she had collaborated with the trio to rob her landlady, but insisted that she had no intention of causing death. Nevertheless, she was charged with murder along with Mansoor and Nazar. In February 1998, the two men were condemned to hang for the murder, while Andrew was sentenced to eight years in prison for a reduced charge of [culpable homicide](/wiki/Culpable_homicide) not amounting to murder. The prosecution filed an appeal against her conviction and sentence. On 9 September 1998, the [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore) accepted the prosecution's appeal and sentenced Andrew to death. On 26 February 1999, the three were hanged in [Changi Prison](/wiki/Changi_Prison). As for Kamala, she was sentenced to seven years' jail for conspiring to rob and murder the victim. - 20 June 1997: In a case known as the \"[Duck Den murder](/wiki/Duck_Den_murder)\", 19-year-old Malaysian national Lim Chin Chong murdered his 65-year-old employer, Phillip Low Cheng Quee, who operated a \"duck den\", a brothel with male prostitutes. Lim fled to Malaysia and was on the run for nearly 20 days, seeking refuge in the homes of his acquaintances and relatives before his arrest by the [Royal Malaysia Police](/wiki/Royal_Malaysia_Police) on 9 July 1997. He was later extradited to Singapore and charged with the murder of Low. On 1 December 1997, [High Court](/wiki/High_Court_of_Singapore) judge [Kan Ting Chiu](/wiki/Kan_Ting_Chiu) found Lim guilty of murder and sentenced him to death. Lim's appeal against the sentence was later dismissed and he was hanged on 23 October 1998. - 25 October 1997: 18-year-old full-time [National Serviceman](/wiki/National_service_in_Singapore) [Png Hock Seng](/wiki/Murder_of_Png_Hock_Seng), a member of the Sio Gi Ho gang, was attacked by seven members of the Sio Koon Tong gang, who were earlier attacked by Sio Gi Ho and sought revenge, but Png was not involved in the earlier gang clash. Png died from a single stab wound to his back, and was also sustaining multiple injuries due to punches and kicks directed at him. The seven attackers, aged between 16 and 19, were all arrested and charged with murder. Allan Tan Kei Loon, an 18-year-old part time waiter, was found guilty of culpable homicide not amounting to murder in August 1998, and the High Court sentenced Tan to seven years' imprisonment and nine strokes of the cane despite the prosecution's arguments for life imprisonment, which would mean behind bars for the rest of the convict's natural life due to [Abdul Nasir Amer Hamsah](/wiki/Abdul_Nasir_Amer_Hamsah)'s landmark appeal the year before. In October 1998, the prosecution's appeal for a life term was rejected, but the Court of Appeal increased Tan's sentence to ten years' imprisonment and 15 strokes of the cane. The remaining six accused were jailed between 18 and 30 months and given five strokes of the cane each ## 1998 - 6 January 1998: A naked body was found dead in bushes near [Woodlands MRT station](/wiki/Woodlands_MRT_station). The body belonged to 19-year-old hotel receptionist [Dini Haryati](/wiki/Dini_Haryati). Dini, who was a black belt in karate and taekwondo, was being raped and murdered, and her cause of death was a fatal skull fracture. As of today, her murderer(s) was never caught. - 11 January 1998: 26-year-old [Iordanka Apostolova](/wiki/Murder_of_Iordanka_Apostolova), a student from Bulgaria, was involved in an argument with 22-year-old Shaiful Edham bin Adam at a housing unit in [Depot Road](/wiki/Depot_Road). Shaiful used a [parang](/wiki/Parang_(knife)) to cut Apostolova's throat with the help of his friend, 26-year-old Norishyam bin Mohamed Ali. Shaiful's wife, Hezlinda binte A. Rahman, assisted the two of them in disposing Apostolova's body at a canal near [Tanah Merah Ferry Road](/wiki/Tanah_Merah,_Singapore). Apostolova's body was discovered on 13 January, which led to the arrests of Shaiful and Hezlinda. Norishyam surrendered to the police shortly after. On 14 August 1998, the [High Court](/wiki/High_Court_of_Singapore) found Shaiful and Norishyam guilty of murder and sentenced them to death. They were hanged on 2 July 1999. Hezlinda was sentenced to six years' imprisonment for helping to dispose Apostolova's body, as well as failing to report the murder to the police. - 20 April 1998: 23-year-old Malaysian national [Jonaris Badlishah](/wiki/Rolex_watch_murder) killed 42-year-old Sally Poh Bee Eng by repeatedly bashing her on the head with a hammer and robbed her of a [Rolex](/wiki/Rolex) watch. Two days before the incident, he had seen Poh wearing the watch and planned to rob her so that he could give the watch to his girlfriend, 31-year-old Thai prostitute Saifon Ngammoo. On 8 December 1998, [High Court](/wiki/High_Court_of_Singapore) judge Amarjeet Singh rejected Jonaris's defence that he suffered from a mental disorder and found him guilty of premeditated murder. Jonaris was thus sentenced to death and lost his appeal on 24 February 1999 and subsequently, he was hanged. - 10 May 1998: Outside a coffee shop at [Geylang](/wiki/Geylang), 40-year-old prison warden [Jaranjeet Singh](/wiki/Jaranjeet_Singh) was attacked and slashed by two men with a broken beer bottle when he tried to break up a quarrel between one of the attackers and a prostitute, and as a result of a fatal wound to his neck, Jaranjeet died due to massive loss of blood. The two killers, Saminathan Subramaniam and S. Nagarajan Kuppusamy, both 38 years old, were arrested eight days later and charged with murder, although one of them, Saminathan, was jailed nine months and caned six strokes for causing hurt with a dangerous weapon, leaving only Nagarajan, who directly killed Jaranjeet, to stand trial for murder. Nagarajan was found guilty of murder and sentenced to death in October 1998, and after losing his appeal in January 1999, Nagarajan was hanged on 23 July 1999. In the aftermath, Saminathan was released from prison sometime in 1999, but he was once again arrested in 2002 and sentenced to life imprisonment with 18 strokes of the cane for the manslaughter of his wife's 78-year-old godfather. - 11 August 1998: Outside her workplace in [Bukit Merah](/wiki/Bukit_Merah), 43-year-old factory employee [Ooi Ang Yen](/wiki/Ooi_Ang_Yen) was stabbed to death by her ex-boyfriend right in front of her colleagues. The suspect, 41-year-old Chan Chim Yee, was arrested 12 days later and charged with murder. Chan, who first met Ooi during a 1995 trip to China, was said to have stabbed Ooi with a knife after confronting her about her new boyfriend, and it caused Ooi to die from two fatal wounds to the heart. After standing trial in late October 1999, Chan was found guilty of murdering Ooi and sentenced to hang on 5 November 1999. Eventually, Chan's appeal was dismissed and he was hanged on 15 September 2000. - 26 August 1998: 50-year-old [Lily Tan Eng Yan](/wiki/1998_Tampines_flat_murder) was violently hacked to death in her flat in [Tampines](/wiki/Tampines). Her hands had been nearly chopped off and she had sustained over 58 injuries, of which four were fatal. S$6,600 worth of coins and S$2,200 worth of cash were also missing from her flat. Over the next five days, the police questioned Tan's acquaintances at the market where she worked. Eventually, 46-year-old Lau Lee Peng, one of Tan's close friends, confessed that he had killed Tan with the aid of an accomplice known as \"Ah Meng\". A few days after his arrest, Lau changed his statement and claimed that he committed the murder alone. It turned out that Lau, who had run up huge debts from compulsive gambling, had robbed and killed Tan after learning about her wealth as he desperately needed to pay his debts. On 12 November 1999, Lau was found guilty of murder and sentenced to death. Through his lawyer [Subhas Anandan](/wiki/Subhas_Anandan), Lau tried to overturn the death sentence but the [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore) dismissed his appeal in March 2000, and he was hanged on 1 September 2000. ## 1999 - 28 January 1999: 16-year-old Siddharth Mujumdar, then a secondary school student, was found guilty of committing multiple sexual assaults of underaged females prior, as well as theft and causing hurt. His sexual offences, which were committed in Yishun, had terrorized members of the community in Yishun and Siddharth became known as the \"Terror of Yishun\". For his crimes, Siddharth was sentenced to three years' reformative training and he later lost his appeal in May 1999. While pending his appeal, Siddharth was out on bail and returned to his former school, [Anglo-Chinese School (Independent)](/wiki/Anglo-Chinese_School_(Independent)) to finish his O-levels, and with good grades, he enrolled into [Catholic Junior College](/wiki/Catholic_Junior_College) to begin his two-year junior college education in 2000 while in prison and was granted a supervised release at end-2000. However, in October 2001, Siddharth reoffended by committing more sexual assaults of female minors and even performed oral sex on them besides molestation. Siddharth was caught on 21 January 2002 and he was later sentenced to 18 years' imprisonment and 12 strokes of the cane in August of that same year. - 25 March 1999: 19-year-old Chan Choon Wai was arrested and charged with the [murder of Koh Mew Chin](/wiki/Murder_of_Koh_Mew_Chin), his 18-year-old girlfriend. Chan and Koh, who were both Malaysians, first met in September or October 1998 and fell in love, but on the afternoon when Koh was killed, she expressed her intention to break up with Chan for another man, resulting in Chan strangling Koh to death. Chan was found guilty in January 2000 of murdering Koh, and sentenced to death. His appeal against the death sentence was rejected in May 2000, and he was eventually hanged. - 21 April 1999: 55-year-old [T. Maniam](/wiki/Murder_of_T._Maniam) was beaten to death by 25-year-old Indian national Loganatha Venkatesan and 24-year-old Chandran s/o Rajagopal in [Phoenix Garden](/wiki/Bukit_Batok). The brutal killing was witnessed by Fairos Banu, Maniam's stepdaughter, and two others. Loganatha and Chandran were arrested and charged with murder. Maniam's second wife and Fairos's mother, 51-year-old Julaiha Begum, was also arrested for plotting to murder her husband so she could gain full ownership of their house and the proceeds from selling the house. Julaiha had plotted with Loganatha, Chandran and a third accomplice, 28-year-old Govindasamy Ravichandran, to murder her husband. They had hired a truck driver known as Mani to drive them to Maniam's house to murder him. After two failed attempts, Govindasamy backed out of the plan and fled to India. They succeeded on their third attempt. During the trial, Loganatha and Chandran denied killing Maniam and put the blame on Mani, while Julaiha denied her involvement and attempted to discredit testimonies against her made by her daughters (Fairos and Sairah) and Govindasamy. On 14 March 2000, [High Court](/wiki/High_Court_of_Singapore) judge [Choo Han Teck](/wiki/Choo_Han_Teck) found the trio found guilty of murder and sentenced them to death. Their subsequent appeals to the [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore) were unsuccessful, and the trio were eventually hanged on 16 February 2001. As of January 2022[update], Mani is still at large. - 2 May 1999: At a coffeeshop in Singapore's Geylang, 56-year-old rag-and-bone man [S. Salim Ahmad](/wiki/S._Salim_Ahmad) was brutally battered to death by Seah Kok Meng, whose girlfriend was allegedly harassed by Salim. Seah fled to Malaysia after murdering Salim, but he was arrested and extradited back to Singapore in May 2000 and charged with murder. Seah was convicted of murder and sentenced to death in November of that same year, and after failing to appeal against his sentence, Seah was hanged on 30 November 2001. - 5 May 1999: At a Wushu association club in [Geylang](/wiki/Geylang), 43-year-old seaman and Sio Kun Tong triad leader [Aw Teck Boon](/wiki/Murder_of_Aw_Teck_Boon) was found dead with three stab wounds to his neck, waist and armpit. Prior to this, Aw was infamously known as a kingpin of the underworld, had at least 60 members under his wing and even managed over 20 brothels. It was speculated that Aw, who was seen drinking heavily before he slept at the club, was murdered in his sleep by possible underworld rivals over unsettled conflicts. One prime suspect was later identified as Chew Tse Meng, who was wanted by the police for killing Aw but till today, his whereabouts were unknown. A coroner's inquiry recorded a verdict of murder in 2002 after hearing the case of Aw's death. Till today, the murder of Aw Teck Boon remains unsolved. - 9 September 1999: At [Sian Tuan Avenue](/wiki/Bukit_Timah), the 14-year-old daughter of a car dealer was kidnapped by 33 year-old [Vincent Lee Chuan Leong](/wiki/Vincent_Lee_Chuan_Leong) and his two accomplices from China – 26-year-old [Zhou Jian Guang](/wiki/Zhou_Jian_Guang) and 29-year-old [Shi Song Jing](/wiki/Shi_Song_Jing). They kept the girl in a rented house and demanded S$500,000 for her release. They eventually agreed to settle for S$330,000, which was paid to them before she was released on the morning of 12 September 1999. 20 minutes after the girl was released, the police arrested Lee at his flat. Zhou and Shi were separately arrested on 14 September 1999. In April 2000, all three accused were found guilty of kidnapping by ransom and sentenced to [life imprisonment](/wiki/Life_imprisonment). A 2021 YouTube video revealed that Lee had been released from prison on [parole](/wiki/Parole) for good behaviour on 22 June 2020 and had found a job as a lorry driver. - 15 December 1999 – 2 January 2000: 14-year-old [Ong Li Xia](/wiki/1999_Ang_Mo_Kio_torture_case) called her 14-year-old friend to her flat and confined her there for 17 days. During that period, the victim suffered extreme abuse and humiliation at the hands of Ong, Ong's three sisters aged between 11 and 17, and the three sisters' boyfriends, all aged 17. At one point, she was forced to perform oral sex on a dog. After the victim was released, she was hospitalised for severe injuries which had left her traumatised and maimed for life. The seven perpetrators – the four Ong sisters, Yeo Kim Han, Neo Soo Kai and Melvin Yeo Yew Beng – were arrested and charged with multiple offences related to unlawful confinement and causing grievous hurt. During the trial, it was revealed that the Ong sisters' mother neglected them as she was busy working at a karaoke lounge while their father was in jail for a drug offence. All seven of them were eventually sentenced to jail terms of between two and seven years for the respective charges they faced. The three boys were also sentenced to between 12 and 16 [strokes of the cane](/wiki/Caning_in_Singapore) each for their crimes. - [Capital punishment in Singapore](/wiki/Capital_punishment_in_Singapore) - [Life imprisonment in Singapore](/wiki/Life_imprisonment_in_Singapore) - [List of major crimes in Singapore](/wiki/List_of_major_crimes_in_Singapore)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:25:15.616820",
  "title": "List of major crimes in Singapore (1990–1999)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/List_of_major_crimes_in_Singapore_(1990%E2%80%931999)"
}