{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:26:20.072949"
  },
  "content": "* *This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"List of variations of satay\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(November 2025)* *(Learn how and when to remove this message)*Some of this article's listed sources **may not be reliable**. Please help improve this article by looking for better, more reliable sources. Unreliable citations may be challenged and removed. *(November 2025)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)*Across Southeast Asia **[Satay](/wiki/Satay)** has developed into a lot of variations throughout Southeast Asia, reflecting local ingredients, culinary traditions, and cultural influences. Popular satay using Javanese seasonings and condiments like [peanut sauce](/wiki/Peanut_sauce) and [kecap manis](/wiki/Sweet_soy_sauce), it was adapted over time to suit the tastes and available ingredients of Indonesia, Malaysia, Singapore, Brunei, and southern Thailand. Variants differ in their primary components, including chicken, beef, mutton, goat, seafood, and vegetables. ## Indonesia This article is part of the series on[Indonesian cuisine](/wiki/Indonesian_cuisine) *Masakan Indonesia*National dishes - [Gado-gado](/wiki/Gado-gado) - [Nasi goreng](/wiki/Nasi_goreng) - [Rendang](/wiki/Rendang) - [Satay](/wiki/Satay) - [Soto](/wiki/Soto_(food)) - [Tumpeng](/wiki/Tumpeng) Regional and cultural cuisines - [Acehnese](/wiki/Acehnese_cuisine) - [Arab](/wiki/Arab_Indonesian_cuisine) - [Balinese](/wiki/Balinese_cuisine) - [Banjarese](/wiki/Banjarese_cuisine) - [Batak](/wiki/Batak_cuisine) - [Betawi](/wiki/Betawi_cuisine) - [Chinese](/wiki/Chinese_Indonesian_cuisine) - [Gorontalese](/wiki/Gorontalo_cuisine) - [Indian](/wiki/Indian_Indonesian_cuisine) - [Indo](/wiki/Indo_cuisine) - [Javanese](/wiki/Javanese_cuisine) - [Madurese](/wiki/Madurese_cuisine) - [Makassarese](/wiki/Makassarese_cuisine) - [Malay](/wiki/Malay_cuisine) - [Minahasan](/wiki/Minahasan_cuisine) - [Minangkabau](/wiki/Padang_cuisine) - [Palembangese](/wiki/Palembangese_cuisine) - [Peranakan](/wiki/Peranakan_cuisine) - [Sundanese](/wiki/Sundanese_cuisine) Ingredients - *[Bumbu](/wiki/Bumbu_(seasoning))* - [Condiments](/wiki/List_of_Indonesian_condiments) - [Peanut sauce](/wiki/Peanut_sauce) - *[Sambal](/wiki/Sambal)* - *[Santan](/wiki/Coconut_milk)* Types of food**Foods** - [Dishes](/wiki/List_of_Indonesian_dishes) - [Noodles](/wiki/Indonesian_noodles) - [Soups](/wiki/List_of_Indonesian_soups) - [Desserts](/wiki/List_of_Indonesian_desserts) - [Snacks](/wiki/List_of_Indonesian_snacks) - *[Kue](/wiki/Kue)* - *[Krupuk](/wiki/Krupuk)* - *[Kripik](/wiki/Kripik)* **Drinks** - [Beverages](/wiki/List_of_Indonesian_drinks) - [Alcohol](/wiki/Alcohol_in_Indonesia) - [Coffee](/wiki/Coffee_production_in_Indonesia) Preparation and cooking**Main** - [Frying](/wiki/Frying) - [Stir frying](/wiki/Stir_frying) - [Grilling](/wiki/Grilling) - [Roasting](/wiki/Roasting) - [Dry roasting](/wiki/Dry_roasting) - [Sautéing](/wiki/Saut%C3%A9ing) - [Boiling](/wiki/Boiling) - [Steaming](/wiki/Steaming) **Other** - [Pepes](/wiki/Pepes) - [Pindang](/wiki/Pindang) - [Rendang](/wiki/Rendang) - [Semur](/wiki/Semur_(Indonesian_stew)) Styles - [Nasi campur](/wiki/Nasi_campur) - [Nasi padang](/wiki/Nasi_padang) - [Rijsttafel](/wiki/Rijsttafel) - [Tumpeng](/wiki/Tumpeng) - [Street food](/wiki/Street_food_of_Indonesia) Holidays and festivals - *[Kenduri](/wiki/Kenduri)* - [*Lebaran* (Eid al-Fitr)](/wiki/Lebaran#Lebaran_feast) - *[Naloni Mitoni](/wiki/Naloni_Mitoni)* - [*Natal* (Christmas)](/wiki/List_of_Christmas_dishes#Indonesia) - *[Serak Gulo](/wiki/Serak_Gulo)* - *[Slametan](/wiki/Slametan)* Related cuisines - [Bruneian](/wiki/Bruneian_cuisine) - [Chinese](/wiki/Chinese_cuisine) - [Dutch](/wiki/Dutch_cuisine) - [East Timorese](/wiki/Cuisine_of_East_Timor) - [Egyptian](/wiki/Egyptian_cuisine) - [Filipino](/wiki/Filipino_cuisine) - [Indian](/wiki/Indian_cuisine) - [Malaysian](/wiki/Malaysian_cuisine) - [Portuguese](/wiki/Portuguese_cuisine) - [Singaporean](/wiki/Singaporean_cuisine) - [Sri Lankan](/wiki/Sri_Lankan_cuisine) - [South African](/wiki/South_African_cuisine) - [Surinamese](/wiki/Surinamese_cuisine) - [Thai](/wiki/Thai_cuisine) - [Yemeni](/wiki/Yemeni_cuisine) See also - [History](/wiki/Indonesian_cuisine#History) - [Etiquette](/wiki/Etiquette_in_Indonesia#Table_manner) - Cookbook: Cuisine of Indonesia Indonesia portal Food portal - v - t - e Many variants are named after their main ingredients, others after their city or region of origin. Specific examples of satay include: ### Chicken 1. *Sate Ambal*: A satay variant from Ambal, [Kebumen](/wiki/Kebumen_Regency), [Central Java](/wiki/Central_Java). This satay uses a native breed of poultry, *[ayam kampung](/wiki/Ayam_Kampong)*. The sauce is not based on peanuts, but rather ground [tempe](/wiki/Tempeh), chilli and spices. The chicken meat is marinated for about two hours to make the meat tastier. This satay is accompanied with *[ketupat](/wiki/Ketupat)*. 2. *sate asam/asem*: chicken/beef/tripe/pork satay with three different sambals from [Karangasem](/wiki/Karangasem_Regency), [Bali](/wiki/Bali). The sambals are yellow sambal, red spicy sambal, and coconut sambal called *sambal nyuh*. 3. *Sate asin pedas*: A salty and spicy chicken, goat and beef satay from [Bandung](/wiki/Bandung) in [West Java](/wiki/West_Java). 4. *Sate ayam*: [Chicken](/wiki/Chicken_(food)) satay, the most common and widely distributed type of satay in Indonesia. 5. *Sate ayam kampung*: Using *ayam kampung* ([free range](/wiki/Free_range) chicken) meat. 6. *Sate ayam rebus*: Boiled chicken satay. It has become a side dish of *[soto](/wiki/Soto_(food))*, *[mie jawa](/wiki/Mie_jawa)*, or *[nasi goreng jawa](/wiki/Nasi_goreng_jawa)*. 7. *Sate Banjar*: A variant of chicken satay popular in [Southern Kalimantan](/wiki/South_Kalimantan), especially in the town of [Banjarmasin](/wiki/Banjarmasin). 8. *Sate Blater*: A chicken satay dish from Blater Village, in [Purbalingga](/wiki/Purbalingga_Regency). The chicken is seasoned with *[bumbu](/wiki/Bumbu)* without sweet soy sauce before being grilled and skewered using coconut skewers. This satay is sold in the seller's home. 9. *Sate blendet*: Chicken satay with yellow sauce from Balong District in [Ponorogo](/wiki/Ponorogo). The sauce is made of shallots, garlic, candlenuts, coconut milk, and turmeric. 10. *Sate Blora [id]*: A variant originating in [Blora](/wiki/Blora), in [Central Java](/wiki/Central_Java). This variant is made of chicken (meat and skin) pieces that are smaller compared to the other variants. It is normally eaten with peanut sauce, rice, and a traditional soup made of coconut milk and herbs. Sate Blora is grilled in front of buyers as they are eating. The buyers tell the vendor to stop grilling when they are sated. 11. *Sate brutu*: Fleshy part of chicken's tail satay. 12. *Sate kulit*: Skin satay. Found in [Sumatra](/wiki/Sumatra), this is a crisp satay made from marinated chicken skin. 13. *[Sate Madura](/wiki/Sate_Madura) [id]* (Madura satay): Originating on the island of [Madura](/wiki/Madura), near Java, it is a famous satay variant among Indonesians. Most often made from mutton or chicken, the recipe's main characteristic is the black sauce made from [Indonesian sweet soy sauce/kecap manis](/wiki/Soy_sauce#Indonesian) mixed with palm sugar (called *gula jawa* or \"Javanese sugar\" in Indonesia), garlic, deep fried shallots, peanut paste, petis (a kind of [shrimp paste](/wiki/Shrimp_paste)), *kemiri* (candlenut), and salt. Chicken Madura satay is usually served in peanut sauce, while the mutton Madura satay is usually served in sweet soy sauce. *Sate Madura* uses thinner chunks of meat than other variants. It is eaten with rice or rice cakes wrapped in banana/coconut leaves (*lontong/ketupat*), they are usually sliced into smaller pieces before being served. Raw thinly sliced shallots and plain sambal are often served as condiments. In [Pamekasan](/wiki/Pamekasan_Regency), there is a mini-sized Madura satay called *sate lalat [id]* because the meat is the size of a fly. 14. *Sate Ponorogo [id]* (Ponorogo satay): A variant of satay originating in [Ponorogo](/wiki/Ponorogo), a town in [East Java](/wiki/East_Java). It is made from sliced marinated chicken meat, and served with a sauce made of peanuts and chili sauce and garnished with shredded shallots, [sambal](/wiki/Sambal) (chili paste) and lime juice. The meat is marinated in spices and sweet soy sauce, in a process called *bacem* and is served with rice or lontong (rice cake). The grill is made from terracotta earthenware with a hole in one side to allow ventilation for the coals. After three months of use, the earthenware grill disintegrates, and must be replaced. 15. *Sate serapah*: Balinese chicken satay with sauce made of mixture of *[bumbu](/wiki/Bumbu_(seasoning)) base genep [id]* and [serundeng](/wiki/Serundeng). 16. *Sate srepeh*: A variant of chicken satay from [Rembang](/wiki/Rembang). The satay uses spicy orange sauce and eaten with rice and tofu. 17. *[Sate taichan](/wiki/Sate_taichan)*: A spicy chicken satay in hot [sambal](/wiki/Sambal) sauce, served with *lontong*, popular in Jakarta. It was said that the dish was an adaptation of skewered Chinese snack from Taiwan, which originally uses pork or rabbit meat, and served with soy sauce. The Indonesian version maintain the light Chinese-style seasoning, replaces pork with chicken, and adds spiciness with the addition of hot sambal. Another source mentioned that sate Taichan was devised from a Japanese man's specific request that his satay omits peanut sauce and sweet soy sauce, and only seasoned with a dash of salt and lime juice, and served with chili paste. ### Beef 1. *Sate bumbon*: A spiced beef satay from [Kendal](/wiki/Kendal_Regency), [Central Java](/wiki/Central_Java). It serves with peanut sauce, [lontong](/wiki/Lontong), boiled bean sprouts, and young jackfruit [sayur lodeh](/wiki/Sayur_lodeh). 2. *Sate buntel*: Lit: Wrapped satay, a speciality from [Solo](/wiki/Solo,_Central_Java) or [Surakarta](/wiki/Surakarta), [Central Java](/wiki/Central_Java). It is made from minced beef, goat, [lamb and mutton](/wiki/Lamb_and_mutton) (especially meats around ribs and belly area). The minced fatty meats are wrapped by thin fat or muscle membrane and wrapped around a bamboo skewer. The size of this satay is quite large, very similar to a Middle Eastern [kebab](/wiki/Kebab). After being grilled on charcoal, the meat is separated from the skewer, cut into bite-size chunks, then served in sweet soy sauce and *merica* ([pepper](/wiki/Black_pepper)). 3. *Sate bulayak*: Beef satay with spicy soupy sauce from [Lombok](/wiki/Lombok). It is eaten with rice cake called *bulayak*. 4. *Sate cucuk manis*: Beef satay from [Palembang](/wiki/Palembang), [South Sumatra](/wiki/South_Sumatra). It served with some soups, one of them is *kuah [pindang](/wiki/Pindang)*. 5. *Sate gajih*: Beef fat satay popular in [Yogyakarta](/wiki/Yogyakarta), especially in [Beringharjo](/wiki/Beringharjo) Market. The fat satay is seasoned with sweet soy sauce and considered as snack since it is commonly served without any rice or additional sauces. 6. *Sate gebug*: \"hit\" satay from Malang, East Java. The satay seller pounds the selected beef, then grills it over a fire lit over charcoal. 7. *Sate jando*: A specialty dish from [Bandung](/wiki/Bandung), this satay is made from cow's breast fat. 8. *Sate kenul*: Cubed beef satay smeared with grated coconut and spices made of turmeric, ginger, cumin, garlic, pepper, salt and coriander. It is a specialty dish from [Nganjuk](/wiki/Nganjuk_Regency). 9. *Sate klopo*: Lit: Coconut Satay, the beef is wrapped in coconut processed spices and then grilled. It is delicacy from [Surabaya](/wiki/Surabaya). 10. *Sate komoh [id]/komo*: Beef satay from [East Java](/wiki/East_Java). Diced beef is sautéed with *[bumbu](/wiki/Bumbu_(seasoning))* before grilling. 11. *Sate kuah*: Lit: Soupy Satay, beef satay served in creamy and spicy *kuah* soup akin to [soto](/wiki/Soto_(food)). Sate kuah can be found in [Betawi cuisine](/wiki/Betawi_cuisine) of Jakarta and also in [Pontianak](/wiki/Pontianak), Western Kalimantan. The Jakarta version sate kuah soup base is akin to Betawi's soto tangkar, since sate kuah was a variant of soto tangkar created in 1960s. Thus usually the seller offers both sate kuah and soto tangkar. The serving method are either grilled beef satay are dipped into soto soup, or the satay meat are stripped from the skewers and put into the soto soup. Compared to soto meat soup, sate kuah has smoky aroma due to grilling process. The Pontianak version sate kuah is smeared with peanut sauce, doused with spiced broth, and sprinkled with spring onion and calamansi juice. 12. *Sate lembut*: A rare satay recipe of the [Betawi people](/wiki/Betawi_people). It is can be found in Jalan Kebon Kacang, [Central Jakarta](/wiki/Central_Jakarta). The satay is made from minced beef mixed with shredded coconut and spices, wrapped around a flat bamboo skewer. Usually eaten with *[ketupat](/wiki/Ketupat) [laksa](/wiki/Laksa) betawi* (Betawi style Laksa with ketupat glutinous compressed rice). 13. *Sate manis* or *sate asem manis*: Also a speciality from the [Betawi people](/wiki/Betawi_people). It is also can be found in Jalan Kebon Kacang, [Central Jakarta](/wiki/Central_Jakarta). The satay is made from slices of *has dalam* ([tenderloin](/wiki/Beef_tenderloin)) the finest part of beef, marinated with sour and sweet spices. Usually eaten with [ketupat](/wiki/Ketupat) [laksa](/wiki/Laksa) betawi. 14. *Sate maranggi*: Commonly found in [Purwakarta](/wiki/Purwakarta) and [Cianjur](/wiki/Cianjur), the cities in [West Java](/wiki/West_Java), this satay is made from beef marinated in a special paste. The two most important elements of the paste are *kecombrang* (*[Nicolaia speciosa](/wiki/Etlingera_elatior)*) flower buds and *ketan* (sweet rice) flour. Nicola buds bring a unique aroma and a liquorice-like taste. The satay is served in sweet soy sauce with *acar* pickles. It is served with ketan cake (*jadah*) or plain rice. 15. *Sate matang*: A satay variant from Matang Geulumpang Dua, [Bireun](/wiki/Bireun), [Aceh](/wiki/Aceh). This satay is made from beef, usually served with peanut sauce and [soto](/wiki/Soto_(food)) or soup separately. 16. *Sate rembiga*: Beef satay from [Lombok](/wiki/Lombok). The basic seasoning for the satay is chili. However, it is also given some additional spices, such as tamarind, brown sugar, onions, coriander, and candlenut. It is usually eaten with rice cake, [plecing kangkung](/wiki/Plecing_kangkung), and beef bone soup. 17. *Sate sapi*: Beef satay, served in sweet soy sauce and peanut sauce. Specialty of [Jepara](/wiki/Jepara), [Salatiga](/wiki/Salatiga), and [Semarang Regency](/wiki/Semarang_Regency) in Central Java. 18. *Sate sumsum*: Bone marrow satay commonly found in Bogor, West Java. 19. *Sate susu*: Literally it means \"milky satay\", however it contains no milk, the term *susu* is actually refer to cow's breast or [udder](/wiki/Udder). This dish that can be found in [Java](/wiki/Java) and [Bali](/wiki/Bali), is made from grilled spicy beef udder, served with hot chilli sauce. 20. *Sate tambulinas*: Spiced beef satay from [Sulawesi](/wiki/Sulawesi). Tambulinas satay do not use peanut sauce or soy sauce, it is marinated in spice mixture containing ground chilli pepper, ginger, lemongrass, shallot and garlic, and served with juice of kaffir lime. ### Other red meats 1. *[Sate kambing](/wiki/Sate_kambing)*: Goat satay, a variant of satay popular in [Java](/wiki/Java), made with goat, [lamb](/wiki/Lamb_and_mutton) or mutton meat. Different from other satays, *sate kambing* (lamb satay) is not usually pre-seasoned or pre-cooked. Raw lamb, mutton, and goat is skewered and grilled directly on the charcoal. It is then served with [sweet soy sauce](/wiki/Sweet_soy_sauce) (*kecap manis*), sliced shallots, and cut-up tomatoes. Since the meat is not pre-cooked, it is important to use young lamb. The best vendors use lamb under three to five months old. Lamb from goat is also more popular than lamb from sheep due to milder flavor. 2. *Sate kerbau [id]*: [Water buffalo](/wiki/Water_buffalo) satay, a variant of satay popular in [Kudus](/wiki/Kudus_Regency), where most Muslim believed that it is forbidden to eat beef to respect the Hindus. This satay is made with water buffalo meat. The meat is cooked first with palm sugar, coriander, cumin, and other seasoning until very tender. Some vendor choose to even grind the meat first to make it really tender. It is then grilled on charcoal, and served with sauce made with [coconut milk](/wiki/Coconut_milk), palm sugar, and other seasoning. Traditionally, satay kerbau is served on a plate covered with teak wood leaves. 3. *[Sate klatak](/wiki/Sate_klatak)/klathak*: Goat satay with coconut milk soup from [Bantul Regency](/wiki/Bantul_Regency), [Yogyakarta](/wiki/Yogyakarta). Uniquely, the meat is skewered with bicycle tire spokes. 4. *Sate kronyos*: Breast of goat satay can be found in [Bantul Regency](/wiki/Bantul_Regency), [Yogyakarta](/wiki/Yogyakarta). 5. *Sate loso*: Water buffalo meat or sometimes replaced with beef satay, served in spicy chili peanut sauce. Specialty of [Pemalang](/wiki/Pemalang_Regency), Central Java. 6. *Sate rusa*: Deer satay, a delicacy from [Merauke](/wiki/Merauke), [Papua](/wiki/Papua_(province)). In [East Kalimantan](/wiki/East_Kalimantan), a satay dish made of [venison](/wiki/Venison) called *sate payau*. 7. *Sate Tegal* (Tegal satay): A sate of a yearling or five-month-old lamb; the nickname for this dish in Tegal is *balibul*, an acronym of *baru lima bulan* (just five months). Each *kodi*, or dish, contains twenty skewers, and each skewer has four chunks—two pieces of meat, one piece of fat and then another piece of meat. It is grilled over wood charcoal until it is cooked between medium and well done; however it is possible to ask for medium rare. Sometimes the fat piece can be replaced with liver or heart or kidney. This is not marinated prior to grilling. On serving, it is accompanied by sweet soya sauce (medium sweetness, slightly thinned with boiled water), sliced fresh chilli, sliced raw shallots (*eschalot*), quartered green tomatoes, and steamed rice, and is sometimes garnished with fried shallots. ### Pork 1. *Sate babi* (pork satay): Pork satay, popular among the [Indonesian Chinese](/wiki/Chinese_Indonesian) community, most of whom do not share the [Muslim](/wiki/Muslims) prohibition against pork. This dish can be found in Chinatowns in Indonesian cities, especially around Glodok, Pecenongan, and Senen in the [Jakarta](/wiki/Jakarta) area. It is also popular in [Bali](/wiki/Bali) where the majority are [Hindus](/wiki/Hindu), it is also popular in Northern Sulawesi, Northern Tapanuli, and Nias, where most people are Christians, and also popular in the Netherlands. 2. *Sate plecing*: Satay made with variety of grilled meat most often pork, served with [sambal](/wiki/Sambal) plecing, sauce made from chili, garlic, onion, tomatoes, and shrimp paste, popular in [Balinese cuisine](/wiki/Balinese_cuisine). 3. *Sate ragey*: Pork satay popular in [Minahasan cuisine](/wiki/Minahasan_cuisine). The size is bigger than the common pork satay. It is combined of pork meat and the fat. It can be easily found in [Tomohon](/wiki/Tomohon), [North Sulawesi](/wiki/North_Sulawesi). ### Fish and seafood 1. *Sate ikan tuhuk*: [Blue marlin](/wiki/Blue_marlin) satay, a delicacy from Krui [id; nl], [Lampung](/wiki/Lampung). 2. *Sate ikan pari*: [Stingray](/wiki/Stingray) satay, a satay dish from [Tana Tidung Regency](/wiki/Tana_Tidung_Regency), [North Kalimantan](/wiki/North_Kalimantan). 3. *[Sate bandeng](/wiki/Sate_Bandeng)*: [Milkfish](/wiki/Milkfish) satay, from [Banten](/wiki/Banten). It is a satay made from boneless *bandeng* ([milkfish](/wiki/Milkfish)). The seasoned spicy milkfish meat is separated from the small bones, then placed back into the milkfish skin, clipped by a bamboo stick, and grilled over charcoal. 4. *Sate belut*: [Eel](/wiki/Eels_as_food) satay, another [Lombok](/wiki/Lombok) rare delicacy. It is made from *belut*, (lit. [eel](/wiki/Eel)) commonly found in watery rice paddies in Indonesia. A seasoned eel is skewered and wrapped around each skewer, then grilled over charcoal fire, so each skewer contains an individual small eel. 5. *Sate gurita*: [Octopus](/wiki/Octopus_as_food) satay, a specialty dish from [Sabang](/wiki/Sabang,_Aceh). 6. *Sate kepiting*: [Crab](/wiki/Crab_meat) satay. In [Langkat Regency](/wiki/Langkat_Regency) of [North Sumatera](/wiki/North_Sumatera), the crab's outer shell is removed and the crab is fried in flour mixed with *[bumbu](/wiki/Bumbu)* and then skewered. 7. *Sate kerang [id]*: [Shellfish](/wiki/Shellfish) satay, [cockle](/wiki/Cockle_(bivalve)) satay or [clam](/wiki/Clam) satay. The most popular variant of sate kerang is from [Medan](/wiki/Medan), [North Sumatra](/wiki/North_Sumatra), it is rich spicy cooked shellfish in skewer and often become *oleh-oleh* ([souvenir](/wiki/Souvenir)) for visitors visiting Medan. In Java, sate kerang it is mildly marinated and boiled, also served as a side-dish to accompany soto. In [Southeast Sulawesi](/wiki/Southeast_Sulawesi), *sate pokea* is made of *pokea* clam or *Batissa violacea var. celebensis* and the satay is smeared with peanut sauce and eaten with *[burasa](/wiki/Burasa)* or *gogos*. 8. *Sate tanjung*: Fish satay from [Lombok](/wiki/Lombok). It is made from fish meat which is smeared with spices consisting of coconut milk and spices. The fish used in this satay are usually skipjack tuna and giant trevally. 9. *Sate temburung [id]*: [Telescope snail](/wiki/Telescopium_telescopium) satay, a dish from [North Kalimantan](/wiki/North_Kalimantan). 10. *[Sate tuna](/wiki/Sate_Tuna)*: [Tuna](/wiki/Tuna_as_food) satay, a specialty satay from [Gorontalo](/wiki/Gorontalo). 11. *Sate udang*: [Shrimp](/wiki/Shrimp_(food)) satay that uses large shrimps or prawns, shelled and cleaned and often with the tails off and lightly grilled. Some recipes call for a marinade of thick coconut milk with *sambal* (chili paste), powdered *laos* (galangal root), ground *kemiri* (candlenut, one can substitute macadamia nuts in a pinch), minced shallots and pressed garlic. One can add salt to taste. Shrimp satay seldom served with the peanut sauce so popular with other satays, because it might overpower a delicate shrimp flavour. 12. *Sate ubur-ubur*: [Jellyfish](/wiki/Jellyfish_as_food) satay. It is a specialty dish from Temajuk Village in [Sambas Regency](/wiki/Sambas_Regency), [West Kalimantan](/wiki/West_Kalimantan). ### Offals 1. *Sate ampet*: Another [Lombok](/wiki/Lombok) delicacy. It is made from beef, cow's intestines and other cow's internal organs. The sauce for *sate ampet* is hot and spicy, which is no surprise since the island's name, *lombok merah*, means red chili. The sauce is *santan* ([coconut milk](/wiki/Coconut_milk)) and spices. 2. *Sate babat*: [Tripe](/wiki/Tripe) satay. Mildly marinated and mostly boiled than grilled, usually served as a side-dish to accompany [soto](/wiki/Soto_(food)). 3. *Sate burung ayam-ayaman*: [Watercock](/wiki/Watercock) satay, the satay is made from gizzard, [liver](/wiki/Liver_(food)), and [intestines](/wiki/Intestines) of *burung ayam-ayaman* ([watercock](/wiki/Watercock)). After being seasoned with mild spices and stuck on a skewer, this bird's internal organs are not grilled, but are deep fried in cooking oil instead. 4. *Sate hati*: [Liver](/wiki/Liver_(food)) satay. There is two types of liver satays, cattle liver (goat or cow) and chicken liver satay. The cattle liver made by diced whole liver, while the chicken liver satay is made from mixture of chicken liver, [gizzard](/wiki/Gizzard), and [intestines](/wiki/Intestines). Usually gizzard is placed on the bottom, intestine on the center and liver or heart on the top. After seasoning, the internal organs are not fried or grilled, but are boiled instead. It is not treated as a main dish, but often as a side dish to accompany *[bubur ayam](/wiki/Bubur_ayam)* (chicken rice [porridge](/wiki/Porridge)). 5. *Sate kikil [id]*: Cow's leg skin satay from [Java](/wiki/Java), this satay is made from boiled cow's leg skin, skewered and seasoned either in spicy peanut sauce or yellow sauce. 6. *Sate Makassar*: From a region in Southern [Sulawesi](/wiki/Sulawesi), this satay is made from beef and cow offal marinated in sour [carambola](/wiki/Carambola) sauce. It has a unique sour and spicy taste. Unlike most satays, it is served without sauce. 7. *[Sate Padang](/wiki/Sate_Padang)*: A dish from [Padang](/wiki/Padang,_Indonesia) and the surrounding area in [Western Sumatra](/wiki/West_Sumatra), which is made from cow or goat [offal](/wiki/Offal) and meat boiled in spicy broth then grilled. Its main characteristic is a yellow sauce made from rice flour mixed with spicy offal broth, turmeric, ginger, garlic, coriander, [galangal](/wiki/Galangal) root, [cumin](/wiki/Cumin), curry powder and salt. It is further separated into three sub-variants, the [Pariaman](/wiki/Pariaman), the [Padang Panjang](/wiki/Padang_Panjang) and the [Lima Puluh Kota](/wiki/Lima_Puluh_Kota_Regency)'s *Sate Danguang-Danguang [id]*, which differ in taste and the composition of their yellow sauces. 8. *Sate paru*: Beef lung satay. 9. *Sate torpedo*: [Testicles](/wiki/Testicles_as_food) satay. Satay made from goat testicles marinated in soy sauce and grilled. It is eaten with peanut sauce, pickles, and hot white rice. 10. *Sate usus*: Chicken [intestine](/wiki/Intestine) satay. This mildly marinated satay is usually fried, also as a side-dish to accompany [bubur ayam](/wiki/Bubur_ayam). ### Mixture 1. *Sate kalong*: A satay dish from [Cirebon](/wiki/Cirebon). The word *kalong* (bat) does not mean the satay used bat meat but because the food is sold in the evening. This satay is made from minced water buffalo, which is mixed with spices, and palm sugar and dipped into buffalo broth, it is then grilled on charcoal. The peanut sauce mixed with [oncom](/wiki/Oncom). 2. *[Sate lilit](/wiki/Sate_Lilit)*: A satay variant from [Balinese cuisine](/wiki/Balinese_cuisine). This satay is made from minced pork, chicken, fish, beef, or even turtle meat, which is then mixed with grated coconut, thick coconut milk, lemon juice, shallots, and pepper. Wound around bamboo, sugar cane or lemon grass sticks, it is then grilled on charcoal. 3. *Sate pusut*: A delicacy from [Lombok](/wiki/Lombok), the neighbouring island east of [Bali](/wiki/Bali). It is made from a mixture of minced meat (beef, chicken, or fish), shredded [coconut](/wiki/Coconut) meat, and spices. The mixture then is wrapped around a skewer and grilled over charcoal. ### Eggs and vegetarian 1. *Sate aci*: The satay is made from [tapioca](/wiki/Tapioca) starch batter. 2. *Sate jengkol*: [Jengkol](/wiki/Archidendron_pauciflorum) satay. 3. *Sate jamur*: Mushroom satay. It is usually made from [oyster mushroom](/wiki/Pleurotus_ostreatus). 4. *Sate kere [id]*: Lit: Poorman's satay. A cheap vegetarian satay made from grounded [tempe](/wiki/Tempeh) from [Solo](/wiki/Surakarta) city, served in peanut sauce and pickles. There are two kinds of [tempe](/wiki/Tempeh): the most popular is made from soybean, and the second is made from the side product material of tofu production (called *tempe gembus*). *Sate kere* is usually made from *tempe gembus*. The word *kere* in the [Javanese language](/wiki/Javanese_language) means \"poor\"; it originally was meant to provide the poor people of Java with the taste of satay at an affordable price, since meat was considered a luxury. Although originally it was only vegetarian tempeh, today, *sate kere* also includes intestine, liver, and beef satays mixed with tempeh ones. The materials are pre-cooked in *baceman* before being grilled, then served with peanut sauce. 5. *Sate pencok*: The satay from [Lombok](/wiki/Lombok) is made from [sago](/wiki/Sago) starch. It is smeared with *pelalah* sauce. 6. *Sate tahu*: Lit: Tofu satay. A specialty from [Ponorogo](/wiki/Ponorogo). Tofu is soaked first with *bacem* seasoning before being grilled on a clay kiln. 7. *Sate telur muda*: Young egg satay. This satay is made from premature chicken egg (*uritan*) obtained upon slaughtering the hens. The immature eggs that have not developed the [eggshell](/wiki/Eggshell) yet are boiled and put onto skewers to be grilled as satay. The *telur muda* or *uritan* is often cooked on the same skewer as chicken skin satay, and mixed with chicken satay. This kind of satay is also usually served as a side dish to accompany [bubur ayam](/wiki/Bubur_ayam). 8. *Sate telur puyuh*: [Quail eggs](/wiki/Quail_eggs) satay. Several hard-boiled quail eggs are put into skewers, marinated in sweet soy sauce with spices, and boiled further also served as a side dish for soto. ### Others 1. *Sate bebek*: Duck satay, a specialty dish from [Cilegon](/wiki/Cilegon), [Banten](/wiki/Banten) and [Banyumas](/wiki/Banyumas). 2. *Sate bekicot [id]*. Land snail satay is served in Southern Mountainous region of East Java. 3. *Sate biawak*. Monitor lizard satay, one of extreme dishes in Indonesia, which is believed to be able to eliminate skin diseases and increase stamina. 4. *Sate blengong*: The satay is made from *blengong* meat, an animal that is the result of crossbreeding between ducks and [muscovy ducks](/wiki/Muscovy_duck) or locals called *menthok*. It is a delicacy of [Brebes](/wiki/Brebes). 5. *Sate bulus*: Turtle satay, another rare delicacy from [Yogyakarta](/wiki/Yogyakarta). It is a satay made from freshwater *bulus* ([softshell turtle](/wiki/Softshell_turtle)). It is served with sliced fresh shallots (small red onion), pepper, and sweet soy sauce. Bulus meat is also served in soup or [tongseng](/wiki/Tongseng) (Javanese style spicy-sweet soup). 6. *Sate emprit [id]*. [Estrildidae](/wiki/Estrildidae) bird satay. A delicacy dish from Kediri, East Java. 7. *Sate kelinci*: Rabbit meat satay, this variant of satay is made from rabbit meat, a delicacy from [Java](/wiki/Java). It is served with sliced fresh shallots (small red onion), peanut sauce, and sweet soy sauce. Rabbit satay usually can be found in mountainous tourist region in Java where locals breed rabbit for its meat, such as [Lembang](/wiki/Lembang) in [West Java](/wiki/West_Java), [Kaliurang](/wiki/Kaliurang) in [Yogyakarta](/wiki/Yogyakarta), Bandungan and Tawangmangu resort in [Central Java](/wiki/Central_Java), also Telaga Sarangan in [East Java](/wiki/East_Java). 8. *Sate keong*: Freshwater snail satay. This kind of satay is also served as a side dish of [pecel](/wiki/Pecel). In [Minahasan cuisine](/wiki/Minahasan_cuisine), *sate keong* is grilled and smeared with spicy sambal and known as *sate kolombi*. In Bali, *sate keong* is called *sate kakul* with Balinese *bumbu*. 9. *Sate kuda*: Horse meat satay. Locally known in Javanese as *sate jaran*, this is made from horse meat, a delicacy from [Yogyakarta](/wiki/Yogyakarta). It is served with sliced fresh shallots (small red onion), pepper, and sweet soy sauce. 10. *Sate landak*: Porcupine satay, it is rare satay served in Central Java and East Java. 11. *Sate penyu [id]*: [Sea turtle](/wiki/Sea_turtle) satay. This satay is no longer produced due to sea turtle conservation concerns. 12. *Sate ular*: Snake satay, a rare and exotic delicacy usually founds in foodstalls specialise on serving exotic reptile meats like snakes and *biawak* (monitor lizards), such as the one founds near Gubeng train station in [Surabaya](/wiki/Surabaya), or near Mangga Besar and Tebet train station in Jakarta. It usually uses *ular sendok* ([cobra](/wiki/Cobra)) or *sanca* ([python](/wiki/Pythonidae)) meat. It is served with sliced fresh shallots (small red onion), pickles, pepper, and sweet soy sauce. 13. *Sate ulat sagu*: Sago caterpillar satay from [Papua](/wiki/Western_New_Guinea), [Kalimantan](/wiki/Kalimantan), and [Sulawesi](/wiki/Sulawesi). Indonesian satays - Food portal - Indonesia portal - Malaysia portal - Singapore portal - Sri Lanka portal - [List of variations of nasi goreng](/wiki/List_of_variations_of_nasi_goreng) - [List of chicken dishes](/wiki/List_of_chicken_dishes) - [Cuisine of Brunei](/wiki/Bruneian_cuisine) - [Cuisine of Indonesia](/wiki/Cuisine_of_Indonesia) - [Cuisine of Malaysia](/wiki/Malaysian_cuisine) - [Cuisine of Singapore](/wiki/Singaporean_cuisine) - [Cuisine of the Netherlands](/wiki/Dutch_cuisine) - Satay\n",
  "language": "en",
  "processed_at": "2026-01-12T11:26:20.072541",
  "title": "List of variations of satay",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/List_of_variations_of_satay"
}