{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:24:57.546768"
  },
  "content": "This is a non-exhaustive listing of former bus [interchanges](/wiki/Transport_interchange) or terminals that were once part of [Singapore's bus system](/wiki/Bus_transport_in_Singapore), and decommissioned due to geographical retention or the introduction of new [town centres](/wiki/Town_centre), or creation of consolidated transportation hubs. ## Former bus interchanges Bus interchangeClosure dateFateCompassvale1 December 2024All services relocated to [Buangkok Bus Interchange](/wiki/Buangkok_Bus_Interchange); temporarily serving as an extension of [Sengkang Bus Interchange](/wiki/Sengkang_Bus_Interchange) from 31 January 2026 to end-October 2026.Hougang South15 February 2004Ceased operations totally and became Kovan Hub. The vacated facility does occasionally hold atrium exhibitions and for other commercial uses. It is now converted into a community space with an open carpark on the former end-on berths. It also serves as a transit stop for coaches to and from Malaysia with routes from destinations such as [Genting Highlands](/wiki/Genting_Highlands) and [Kuala Lumpur](/wiki/Kuala_Lumpur). Moreover, bus services 112, 113 and 119 still calls at the facility for passengers to alight and disembark there as a bus stop at the former sawtooth berths. Service 115 starts its journey from there and Service 53M layovers at the bus stop.Jurong1 July 1990Services relocated to [Boon Lay](/wiki/Boon_Lay), [Jurong East](/wiki/Jurong_East_Bus_Interchange) and [Clementi Bus Interchange](/wiki/Clementi_Bus_Interchange). It functioned as a bus depot in the western part of Singapore before it was demolished when SBS Transit built a new multi storey bus depot ([Soon Lee Bus Depot](/wiki/Soon_Lee_Bus_Depot)) along Soon Lee Road in the Jurong Industrial Area. It is located at the junction of Jalan Ahmad Ibrahim and Jurong Port Road. It was completed in 1978 at a cost of [S$](/wiki/S$)1.2 million, and was the first bus station in Singapore built to serve feeder services, which were then being introduced as part of a rationalisation plan by [Singapore Bus Service](/wiki/SBS_Transit). Woodlands4 December 1996All services relocated to Woodlands Regional Bus Interchange. ### Woodlands **Woodlands Bus Interchange** is a former bus interchange that was located at Woodlands Town Centre. Initially planned in the late 1970s as part of a bus service improvement scheme, the interchange commenced operations in 1981, and had 17 berths. The announcement to build the [North-South Line](/wiki/North%E2%80%93South_Line_(Singapore)) [MRT](/wiki/Mass_Rapid_Transit_(Singapore)) extension and the [Woodlands MRT station](/wiki/Woodlands_MRT_station) that was scheduled to complete and open on 10 February 1996, accelerated plans to relocate and develop an entirely new town centre for Woodlands New Town at Woodlands Square, the new regional centre for Woodlands or more precisely, the North region. In late-1996, electronic display boards of TIBS buses serving the Woodlands Bus Interchange began to display notices that the TIBS Woodlands' fleet would be moving to the new interchange at Woodlands Square, Singapore's first mass underground bus interchange – [Woodlands Regional Bus Interchange](/wiki/Woodlands_Regional_Bus_Interchange), conveniently located under the Woodlands MRT station, and is connected to [Causeway Point](/wiki/Causeway_Point) with escalators. Woodlands Regional Bus Interchange was closed on 12 March 2016 for upgrading works as part of the construction of the Stage 1 [Thomson–East Coast Line](/wiki/Thomson%E2%80%93East_Coast_Line) Woodlands station and was temporarily replaced by Woodlands Temporary Bus Interchange. The interchange reopened as part of the [Woodlands Integrated Transport Hub](/wiki/Woodlands_Bus_Interchange) on 13 June 2021. ### Hougang South **Hougang South Bus Interchange** was a [bus interchange](/wiki/Bus_station), located in Hougang Street 21, which ceased operations on 15 February 2004. The interchange's structure continues to stand pending a major redevelopment of the site, and is currently called Kovan Hub. Initially named Hougang Bus Interchange, construction of the interchange commenced in 1981, and it commenced operations in October 1983, with an exhibition held prior to the interchange's opening to get commuters accustomed to it. Fitted out with 34 bus bays, the interchange was built to handle additional bus services with the further development of [Hougang](/wiki/Hougang) new town. At that time, Hougang comprised just four neighbourhoods, with large tracts to the northwest of Upper Serangoon Road still undeveloped. The commercial centre at Hougang Street 21 thus served as a town centre. From the 1990s, however, the town was rapidly expanded with five more neighbourhoods constructed, and a new, permanent town centre further north was built. As is the case for all other bus interchanges (except the [Eunos Bus Interchange](/wiki/Eunos_Bus_Interchange)) in which they are located in their respective town centres, the Hougang Bus Interchange was to be moved to the new town centre, while the existing facility was then converted to other uses. Its bus services were then amended to terminate at either Hougang Central or Punggol.[*citation needed*] When this plan was publicised, it created an uproar amongst the local populace, particularly shopowners in Hougang Street 21. With the help of local politicians, their discontentments were made to the relevant authorities, resulting in a delay in the interchange's closure. The government was adamant on removing the interchange, however, as it insists it makes little sense to have two bus interchanges in one town, and the opening of the [Kovan MRT station](/wiki/Kovan_MRT_station) on the [North East Line](/wiki/North_East_Line) will help to continue bringing in the crowds. It proceeded to build a new, permanent interchange, known as the [Hougang Central Bus Interchange](/wiki/Hougang_Central_Bus_Interchange), and renamed the existing interchange as the Hougang South Bus Interchange.[*citation needed*] In the meantime, the vacated facility does occasionally hold atrium exhibitions and for other commercial uses. It is now converted into a community space with an open carpark on the former end-on berths. It also serves as a transit stop for coaches to and from Malaysia with routes from destinations such as [Genting Highlands](/wiki/Genting_Highlands) and [Kuala Lumpur](/wiki/Kuala_Lumpur). Moreover, bus services 112, 113 and 119 still calls at the facility for passengers to alight and disembark there as a bus stop at the former sawtooth berths. Services 53M and 115 start their journey from the bus stop.[*citation needed*] ## Former bus terminals TerminalClosure dateStatusImageChoa Chu Kang Road End1971Downgraded to a bus stop whereas it became part of the SAFTI Live Firing Area while the public is still having limited access.Keppel Harbour2 May 1971New Market Road6 June 1971Kim Keat Avenue2 August 1971Replaced by Toa Payoh Town Centre Bus Terminus.Lorong 1 Toa PayohLorong 6 Toa PayohClementi Road14 September 1971Keppel Road10 November 1971Changi Road1 July 1973Replaced by Chai Chee Bus Terminal.Fidelio StreetJoo Chiat PlaceTelok KurauUpper Changi Road (13.3km)1974Near to Anglican High School.Jalan Jurong Kechil3 February 1974Kallang ParkMarsiling AvenueSouth Buona Vista RoadToh Tuck RoadChangi Point1975Relocated to Changi Village Bus Terminal.Outram Park1 January 1976Kranji Road6 June 1976Kampong Bahru8 August 1976Rotherham Gate23 August 1976Jalan Kolam Ayer13 December 1976Replaced by Sims Place Bus Terminal.Sembawang Hills Drive16 May 1977Lorong 5 Geylang17 October 1977Benoi Road1 June 1978Replaced by Jurong Bus Interchange.Corporation DriveInternational RoadJalan Ahmad IbrahimJalan Boon LayShipyard RoadTanjong KlingBalestier Road2 December 1978Bedok South8 April 1979Replaced by Bedok Bus Interchange.Yio Chu Kang Road26 October 1979Mei Chin Road25 November 1979Replaced by [Bukit Merah Bus Interchange](/wiki/Bukit_Merah_Bus_Interchange).Lengkok Bahru23 December 1979Ang Mo Kio Avenue 66 January 1980Replaced by Ang Mo Kio Avenue 3 Bus Terminal.Upper Changi Road (15.5km)15 June 1980Replaced by Somapah Bus Interchange/Terminal, and is at the current site of ITE College East.Bukit Merah Central28 September 1980Replaced by Bukit Merah Bus Interchange.Clementi Avenue 316 November 1980Replaced by [Clementi Bus Interchange](/wiki/Clementi_Bus_Interchange).Jurong Road 10ms Market1 February 1981Telok Blangah Heights15 February 1981Replaced by Bukit Merah Bus Interchange.Telok Blangah Way16 February 1981Bukit Timah 7ms25 May 1981Paya Lebar Airport30 June 1981Closure of Paya Lebar Airport.Ang Mo Kio Avenue 35 July 1981Replaced by Ang Mo Kio Central Bus Terminal.Pasir PanjangReplaced by Kent Ridge Bus Terminal.Upper Bukit Timah15 November 1981Replaced by Kent Ridge Bus Terminal.Commonwealth Avenue27 May 1982Replaced by Buona Vista Bus Terminal.Jalan Aman2 January 1983Replaced by St Michael's Bus Terminal.Ang Mo Kio Avenue 1010 April 1983Replaced by [Ang Mo Kio Bus Interchange](/wiki/Ang_Mo_Kio_Bus_Interchange).Ang Mo Kio Central 2Ang Mo Kio Industrial Park 1Ang Mo Kio Industrial Park 2Hougang Street 2130 October 1983Replaced by Hougang South Bus Interchange.Tampines WayUpper SerangoonUpper JurongReplaced by Tuas Bus Terminal.Toa Payoh Town Centre26 December 1983Replaced by [Toa Payoh Bus Interchange](/wiki/Toa_Payoh_Bus_Interchange).Tanjong Berlayar1984Tanjong Rhu27 May 1984Kaki Bukit Malay Settlement17 June 1984Replaced by Jalan Eunos Bus Terminal.Tanjong Pagar Road13 January 1985Replaced by [HarbourFront Bus Interchange](/wiki/HarbourFront_Bus_Interchange).Anson Road27 January 1985Replaced by Prince Edward Road Bus Terminal.Alexandra Road28 April 1985Replaced by [Clementi Bus Interchange](/wiki/Clementi_Bus_Interchange).Jurong East Central30 June 1985Replaced by [Jurong East Bus Interchange](/wiki/Jurong_East_Bus_Interchange).Chai Chee15 September 1985Replaced by [Bedok Bus Interchange](/wiki/Bedok_Bus_Interchange) expansion.Redhill Close15 September 1985Replaced by Bukit Merah Bus Interchange.Sembawang18 January 1987Replaced by Yishun Central Bus Terminal.Jalan Eunos22 March 1987Replaced by Eunos Bus Terminal. 51 was later merged with 54 to extend to Hougang South.Lower Delta12 April 1987Replaced by HarbourFront Bus Interchange.Prince Edward Road28 June 1987Replaced by Shenton Way Bus Terminal.Ulu Pandan5 July 1987Yishun Avenue 523 August 1987Replaced by [Yishun Bus Interchange](/wiki/Yishun_Bus_Interchange).Yishun CentralBukit Batok27 September 1987Replaced by [Bukit Batok Bus Interchange](/wiki/Bukit_Batok_Bus_Interchange).Tampines Avenue 529 November 1987Replaced by [Tampines Bus Interchange](/wiki/Tampines_Bus_Interchange).Serangoon Avenue 313 March 1988Replaced by [Serangoon Bus Interchange](/wiki/Serangoon_Bus_Interchange).Serangoon GardensMarine Terrace26 June 1988Before the terminal shifted to its former site (Marine Parade Bus Terminal) in the 1980s, it was located at Marine Terrace within the Marine Parade housing estate. There were Services 15, 16 and 211. Service 15 former routing merged into the current Service 196, Service 16 remains today being extended to Siglap Road and later extended once more to absorb CSS 608 routing to Bedok while Service 211 was a feeder service to Katong which was withdrawn on 5 March 1989.Bukit Timah31 July 1988Upper Changi23 October 1988Replaced by Tampines Bus Interchange.Commonwealth Drive18 December 1988Bishan30 April 1989Replaced by [Bishan Bus Interchange](/wiki/Bishan_Bus_Interchange).Holland11 June 1989Labrador27 August 1989Delta5 November 1989This bus terminal was discontinued with the opening of MRT.SomapahThe terminal was originally a bus maintenance and refuelling depot owned by the then Associated Bus Company that ran two services, numbered 1 and 2, from Changi Point to the city. With the opening of the MRT and the discontinuation of Service 1, Somapah Bus Terminal closed down. It became Singapore University of Technology and Design (SUTD).Eunos10 December 1989Replaced by [Eunos Bus Interchange](/wiki/Eunos_Bus_Interchange).Pasir RisReplaced by [Pasir Ris Bus Interchange](/wiki/Pasir_Ris_Bus_Interchange).Choa Chu Kang8 April 1990Replaced by [Choa Chu Kang Bus Interchange](/wiki/Choa_Chu_Kang_Bus_Interchange).Circuit Road24 June 1990Tuas (Pioneer Road)1 July 1990Replaced by [Boon Lay Bus Interchange](/wiki/Boon_Lay_Bus_Interchange).NTI7 April 1991Princess Elizabeth28 April 1991Princess Elizabeth estate in [Hillview](/wiki/Hillview,_Singapore) was fully demolished in the coming years.Potong Pasir29 March 1992Old Upper Thomson3 May 1992Replaced by [Yio Chu Kang Bus Interchange](/wiki/Yio_Chu_Kang_Bus_Interchange); Converted to a public car park.MacPherson28 June 1992Merged with Sims Place Bus Terminal.South Canal4 April 1993Replaced by Marina Centre Bus Terminal.Upper Serangoon Road End17 December 1994Replaced by [Hougang Central Bus Interchange](/wiki/Hougang_Central_Bus_Interchange).Marsiling4 February 1996Replaced by [Woodlands Regional Bus Interchange](/wiki/Woodlands_Regional_Bus_Interchange). It was the original bus terminal serving the entire north of Singapore, which was predominantly undeveloped and neglected in the course of developing the country's suburb throughout the 1960s till the 1980s. Development of this area started to sprout when former-Deputy Prime Minister [Tony Tan](/wiki/Tony_Tan_Keng_Yam) (who later became [President of the Republic of Singapore](/wiki/President_of_Singapore)) became the MP for Sembawang, and pledged to develop [Sembawang](/wiki/Sembawang) into a prosperous suburb. This allowed for the creation of the Woodlands New Town and the entire extension of Woodlands from the original old town centre at Woodlands Centre Road and the integration of [Marsiling](/wiki/Marsiling), a small estate of only around 20 4-storeys HDB blocks, into the new town. Woodlands New Town was speedily developing in the mid-1980s and first plans to build an entirely new bus interchange to replace the relatively small Marsiling Bus Terminal surfaces after Woodlands become part of the new Sembawang GRC in 1988. By the mid-1990s, the Woodlands Bus Interchange based at Woodlands Centre Road was fully functional. Marsiling Bus Terminal continued operations with Services 950, 951, 952 with Service 950 plying the route to [Shenton Way](/wiki/Shenton_Way), Service 951 to Boon Lay and Service 952 to [Marina Centre](/wiki/Marina_Centre), were periodically moved to the new bus interchange. The closure of the bus terminal comes as TIBS axed the 95x services, in favour of the new 96x services that served the downtown city areas. Singapore Zoological Gardens28 April 1996Converted to a bus stop when it was fully extended to Choa Chu Kang.Holland Drive1998Roadside bus lanes converted into lane for the main road.Crawford Street27 December 1998Replaced by Lorong 1 Geylang Bus Terminal, all buses extended to Lorong 1 Geylang as a result. One bus route is operated by SMRT Buses and one bus route is operated by Tower Transit currently.Bukit Panjang26 December 1999Replaced by [Bukit Panjang Bus Interchange](/wiki/Bukit_Panjang_Bus_Interchange).Sengkang28 April 2001Replaced by [Sengkang Bus Interchange](/wiki/Sengkang_Bus_Interchange).Hougang20 May 2001Replaced by Hougang Central Bus Interchange with the completion of the [North East Line](/wiki/North_East_Line).Marine Parade16 September 2001Replaced by Upper East Coast Bus Terminal (Service 13 and 853#), Bedok Bus Interchange (Service 196) and to loop at Siglap Road (Service 16, 55, 76, 135, 155). When the land plot was slated as the new site of [Victoria School](/wiki/Victoria_School), the terminal was demolished to make way. Old routes of Service 16, 55, 135, 155 that used to terminate there were made to make a loop around the school site. The former site of the roadside terminal is now replaced with a bus stop and Service 36 and 401 serves the area today. It was constructed by the [Singapore Bus Service](/wiki/SBS_Transit) in 1981 at a cost of $500,000, as part of its plan to eliminate roadside bus terminals. The terminal also allowed for more bus services to serve the Marine Parade area. However, the terminal's construction was opposed by residents of nearby housing estates due to concerns over noise pollution. Consequently, SBS noted that the terminal would be \"tastefully designed and properly landscaped\", and the site was at least 220 metres away from the nearest housing estate. Rumah Tinggi2002Temporarily reopened on 26 October 2025.Teban Gardens12 May 2002Replaced by Soon Lee Bus Depot. Service 143 was extended to Jurong East Bus Interchange and 331 subsequently replaced by 143M.Woodlands Checkpoint23 March 2003Jalan Kayu7 December 2003Converted to a public carpark and demolished in the late 2000s. With the closure of the terminal, Service 103 was integrated with Service 214E (renumbered into 820 and 378) to form Serangoon - Picadilly (Loop). Bus 379 (originally numbered 821 and 214W) was withdrawn with the introduction of service 103M (now integrated into main 103 with the partial closure of West Camp Road), which started from Serangoon Interchange, but looped at West Camp Road instead. It was once served by service 103 and 163, before 163 was extended to Sengkang Temporary Interchange and 103 was amended under NEL Rationalisation Phase 3.PunggolReplaced by Punggol Bus Interchange. Service 82 was then shortened to run from Punggol Bus Interchange and loop at Serangoon Central, and service 84 was then introduced from Punggol to Punggol Road End (Loop).Sin Ming Road5 September 2004Closed down with the removal of City Shuttle Service 605. Also replaced by Ang Mo Kio Bus Interchange with the extension of service 130 and Bishan Bus Interchange with the renumbering from 353, to 57 and 410. The terminal was one of the few surviving terminals of the 1970s era in which it was common for terminals to be built along the road side with only a small booth for drivers to report when completing their runs.Lim Chu Kang27 February 2005Converted to a bus stop.Admiralty Road West20 November 2005Replaced by Sembawang Bus Interchange.Sembawang Road EndMarina South Pier28 November 2011Taman Jurong22 November 2015This is the last and latest roadside bus terminal to be built in Singapore. It opened in 2013 when the new bus service 49 was introduced from Taman Jurong to Jurong West Street 41. The terminal was also used by bus service 98A, a short trip service from Lakeside MRT Station to Corporation Rd, as a layover stop. Although the facilities were similar to Ghim Moh and Sims Place Terminals, passengers were not allowed to board or alight at Taman Jurong Terminal. On 22 November 2015, the container box office for bus captains to rest in during their break was removed as the bus service 49 was extended to [Jurong East](/wiki/Jurong_East_Bus_Interchange). Service 98A buses continue to layover till 2018. As of 2018, the bus bays were covered up and remains of the terminal can no longer be found.New Bridge Road10 March 2018Replaced by Kampong Bahru Bus Terminal. It was opened on 6 June 1987 and was near to [Outram Park MRT station](/wiki/Outram_Park_MRT_station). This bus terminal had an alighting berth after the entrance of the bus park. No boarding facilities were available at the terminal, thus was done at the bus stop outside the terminal. Before the terminal was built, many bus services that ply the terminal used to ply at some bus stops along [New Bridge Road](/wiki/New_Bridge_Road). The plot of land occupied by it will be redeveloped into a new elective surgery centre by the [Singapore General Hospital](/wiki/Singapore_General_Hospital). ## Former bus depots DepotClosure dateStatusChangi Bus DepotDecember 1982Replaced by [Bedok North Bus Depot](/wiki/Bedok_North_Bus_Depot).Bedok South Bus ParkBedok Bus Depot1984Replaced by [Hougang Bus Depot](/wiki/Hougang_Bus_Depot).Paya Lebar Bus DepotAlexandra Bus DepotJanuary 1985Replaced by [Bukit Batok Bus Depot](/wiki/Bukit_Batok_Bus_Depot).Portsdown Bus ParkWhitley Bus ParkKing Albert Park Bus ParkWoodlands Bus Depot1996Merged with Bukit Batok Bus Depot due to redevelopment into the Singapore Turf Club.Toa Payoh Bus Depot1997Renamed to Braddell Bus Park, later replaced by Hougang Bus Depot in 2025.Jurong Bus Park12 May 2002Replaced by Soon Lee Bus Park.Changi Bus Park11 December 2016Replaced by [East Coast Integrated Depot](/wiki/East_Coast_Integrated_Depot).Ayer Rajah Bus Park9 September 2018Replaced by [Ulu Pandan Bus Depot](/wiki/Ulu_Pandan_Bus_Depot).Ang Mo Kio Bus Depot (SMRT)3 October 2021Replaced by [Mandai Depot](/wiki/Mandai_Depot).Ang Mo Kio Bus Depot (SBST)3 January 2025Replaced by Sengkang West Bus Depot.Kranji Bus Depot4 October 2025Replaced by [Gali Batu Depot](/wiki/Gali_Batu_Depot). - [Public buses of Singapore](/wiki/Public_buses_of_Singapore)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:24:57.546303",
  "title": "List of former bus stations in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/List_of_former_bus_stations_in_Singapore"
}