{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:24:01.192568"
  },
  "content": "This is a **list of the bird species recorded in Singapore**. The avifauna of [Singapore](/wiki/Singapore) include a total of 450 species, 35 of which have been [introduced](/wiki/Introduced_species) by humans. This list's [taxonomic](/wiki/Taxonomy_(biology)) treatment (designation and sequence of orders, families and species) and nomenclature (common and scientific names) follow the conventions of *[The Clements Checklist of Birds of the World](/wiki/The_Clements_Checklist_of_Birds_of_the_World)*, 2023b edition. The family accounts at the beginning of each heading reflect this taxonomy, as do the species counts found in each family account. The following tags have been used to highlight several categories, but not all species fall into one of these categories. Those that do not are commonly occurring native species. ## Abundance - Very common (**VC**) - found almost all the time in suitable locations - Common (**C**) - found most of the time in suitable locations - Uncommon (**U**) - found some of the time - Rare (**R**) - found several times a year - Very rare (**VR**) - not found every year - Extirpated (**Ex**) - used to be found in Singapore, but not any more ## Status - Resident (**R**) - stays throughout the year without known breeding record - Resident breeder (**RB**) - stays throughout the year with known breeding record - Winter visitor (**WV**) - spends months at wintering site - Passage migrant (**PM**) - spends days to weeks at wintering site - Migrant breeder (**MB**) - breeds locally, but winters elsewhere - Non-breeding visitor (**NBV**) - can be found throughout the year for days to months, but does not breed locally - Vagrant (**V**) - not usually found locally - Introduced (**I**) - either released or escaped birds - Reintroduced (**rI**) - previously extirpated, but has been re-introduced into the wild ## Locations There are many locations for bird watching in Singapore. The habitats include forests, mangroves, rivers, coasts, grasslands, woodlands, marshes, and offshore islands. There are no mountains in Singapore, but there are several hills, i.e., \"bukit\" (**Bt.**) in the Malay language. The [house crow](/wiki/House_crow) is the most successful introduced bird in Singapore. It was originally brought in from [Sri Lanka](/wiki/Sri_Lanka) for the purpose of controlling the caterpillar population, but the plan back-fired and instead of attacking the caterpillars, they became a pest. Prior to the COVID-19 pandemic, crow cullings were common in Singapore and were guided by the [Certis CISCO](/wiki/Certis_CISCO). Crow cullings were discontinued since the COVID-19 pandemic. Many of the areas were largely cleared for redevelopment, such as Tengah New Town. The expiring leases of Neo Tiew in 2014 were also given to Ministry of Defence (MINDEF) restricted area. LocationAreasNotes[Admiralty Park](/wiki/Admiralty_Park)[Bedok Reservoir Park](/wiki/Bedok_Reservoir_Park)Bidadari ParkFormerly [Bidadari Cemetery](/wiki/Bidadari_Cemetery)Bishan-Ang Mo KioAng Mo Kio Town Garden West, [Bishan-Ang Mo Kio Park](/wiki/Bishan-Ang_Mo_Kio_Park) (**BAMKP**)[Bukit Batok Nature Park](/wiki/Bukit_Batok_Nature_Park) (**BBNP**)A forest near the western part of Singapore with a quarry within.[Bukit Brown Cemetery](/wiki/Bukit_Brown_Cemetery) (**BBC**)[Bukit Timah Nature Reserve](/wiki/Bukit_Timah_Nature_Reserve) (**BTNR**)[Hindhede Nature Park](/wiki/Hindhede_Nature_Park) (**HNP**), Hindhede Quarry, Wallace Education Centre and Singapore Quarry[Central Catchment Nature Reserve](/wiki/Central_Catchment_Nature_Reserve) (**CCNR**)MacRitchie Reservoir, Lower Peirce Reservoir, Upper Peirce Reservoir, Upper Seletar Reservoir[Changi](/wiki/Changi_East)[Changi Business Park](/wiki/Changi_Business_Park) (**CBP**)[Choa Chu Kang Cemetery](/wiki/Choa_Chu_Kang_Cemetery) (**CCKC**)[Choa Chu Kang Park](/wiki/Choa_Chu_Kang_Park) (**CCKP**)[Gardens by the Bay](/wiki/Gardens_by_the_Bay) (**GBTB**)Kranji Dam & Neo Tiew Lane (**NTL**)A dam at north-western Singapore. It is the northern border of the Kranji Reservoir.[Labrador Nature Reserve](/wiki/Labrador_Nature_Reserve)Lower Seletar Dam (**LSD**)A mudflat and sandy beach at north-eastern Singapore. It is the northern border of Lower Seletar Reservoir (**LSR**).Mandai MudflatA mudflat at north-western Singapore. It is a feeding ground for migratory waders.North-eastern IslandsPulau (**P.**) Tekong, P. Ubin, Coney Island (**Is.**)Only P. Tekong is restricted access[Pasir Ris Park](/wiki/Pasir_Ris_Park) (**PRP**)[Pedra Branca](/wiki/Horsburgh_Lighthouse)Easternmost end of Singapore strait, restricted access[Punggol Reservoir](/wiki/Punggol_Reservoir)A river in the north-eastern part of Singapore. It has been converted into a reservoir in 2011 and is now known as Punggol Reservoir. It contains [Sengkang Floating Wetland](/wiki/Sengkang_Riverside_Park#Sengkang_Floating_Wetland) (**SFW**) and is beside [Sengkang Riverside Park](/wiki/Sengkang_Riverside_Park) (**SRP**).[Serangoon Reservoir](/wiki/Serangoon_Reservoir)A river in the north-eastern part of Singapore. It has been converted into a reservoir in 2011 and is now known as Serangoon Reservoir. It is beside Lorong **Halus** Wetland and **Punggol** grassland.[Singapore Botanic Gardens](/wiki/Singapore_Botanic_Gardens) (**SBG**)Singapore's only [UNESCO](/wiki/UNESCO) site containing three lakes (Eco, Symphony and Swan).Southern Islands[Sentosa](/wiki/Sentosa), [Sisters' Is.](/wiki/Sisters%27_Islands), [St. John Is.](/wiki/Saint_John%27s_Island), [Lazarus Is.](/wiki/Lazarus_Island), [Kusu Is.](/wiki/Kusu_Island), [Jurong Is.](/wiki/Jurong_Island), [P. Hantu](/wiki/Pulau_Hantu), P. Salu, [P. Semakau](/wiki/Pulau_Semakau)P. Senang, P. Pawai and P. Sudong are restricted access.Southern Ridges[Kent Ridge Park](/wiki/Kent_Ridge_Park) (**KRP**), [Mount Faber Park](/wiki/Mount_Faber) (**MFP**) and [Telok Blangah Hill Park](/wiki/Telok_Blangah_Hill_Park) (**TBHP**).[Sungei Buloh Wetland Reserve](/wiki/Sungei_Buloh_Wetland_Reserve) (**SBWR**)Wetland Centre, Visitor Centre and Kranji Nature TrailSungei (**S.**) is Malay for river.Tampines Eco Green (**TEG**)TengahTuas[West Coast Park](/wiki/West_Coast_Park) (**WCP**)[Western Water Catchment](/wiki/Western_Water_Catchment) (**WWC**)Wrexham, Tengeh Reservoir, Pasir Laba, Peng Kang Hill, Poyan Reservoir, Murai Reservoir, Sarimbun Reservoir, Lim Chu Kang, Neo Tiew, Ama Keng, Jalan Bahar, Nanyang Technological University. [Jurong Eco-Garden](/wiki/CleanTech_Park) (**JEG**)Most of it are restricted access including the four reservoirs, except for Nanyang Technological University and Cleantech Park. Bird watchers secretly enter military and live firing premises without getting caught by the security or military warden. ## Waterfowl Order: [Anseriformes](/wiki/Anseriformes) Family: [Anatidae](/wiki/Anatidae) Anatidae includes the [ducks](/wiki/Duck) and most duck-like waterfowl, such as [geese](/wiki/Goose) and [swans](/wiki/Swan). These birds are adapted to an aquatic existence with webbed feet, flattened bills, and feathers that are excellent at shedding water due to an oily coating. - Wandering whistling duck (*[Dendrocygna arcuata](/wiki/Dendrocygna_arcuata)*) - U/IRB - SBG, SBTB, WCP, *Marina East, Marina South, P. Punggol* - Lesser whistling duck (*[Dendrocygna javanica](/wiki/Dendrocygna_javanica)*) - U/RB - Halus, Jurong Central Park, Kranji Marsh, SBTB, SBG, SBWR, WCP, Yishun, *P. Punggol, S. Serangoon* - Cotton pygmy-goose (*[Nettapus coromandelianus](/wiki/Nettapus_coromandelianus)*) - VR/NBV - BAMKP, CCNR, Halus, Kranji Marsh, LSR, SBTB, Seletar East, *Marina South, WWC (Poyan), WCP* - Garganey (*[Spatula querquedula](/wiki/Spatula_querquedula)*) - R/WV - Changi, CCNR, Halus, WWC (Poyan), SBWR, Tuas, *Marina South, Tanah Merah* - Northern shoveler (*[Spatula clypeata](/wiki/Spatula_clypeata)*) - VR/WV - Changi, Halus, WWC (Poyan), SBWR (2008) - Gadwall (*[Mareca strepera](/wiki/Mareca_strepera)*) - VR/V - *Punggol (1989)*, SBWR (2020) - Eurasian wigeon (*[Mareca penelope](/wiki/Mareca_penelope)*) - VR/V - Kranji Marsh (2018), SBWR (1986-7) - Northern pintail (*[Anas acuta](/wiki/Anas_acuta)*) - VR/WV - SBWR (2016, 2020), *WWC (Poyan,* Wrexham*), Senoko, S. Jurong* - Green-winged teal (*[Anas crecca](/wiki/Anas_crecca)*) - VR/V - *S. Jurong (1978)* - Tufted duck (*[Aythya fuligula](/wiki/Aythya_fuligula)*) - V - *Changi (1999)*, Marsiling Park (2020), SBWR/Kranji Marsh (2023) ## Pheasants, grouse, junglefowl, quails and allies Order: [Galliformes](/wiki/Galliformes) Family: [Phasianidae](/wiki/Phasianidae) The Phasianidae are a family of terrestrial birds. In general, they are plump (although they vary in size) and have broad, relatively short wings. - Blue-breasted quail (*[Synoicus chinensis](/wiki/Synoicus_chinensis)*) - U/RB - Changi, Halus, JLG, NTL, Pasir Ris Farmway, P. Punggol, Punggol, SBWR, Tuas - Red junglefowl (*[Gallus gallus](/wiki/Gallus_gallus)*) - C/RB+IRB - - Changi District (Grand Venture Technology): Pasir Ris, Tampines, Simei, Changi Village, Changi - Kaki Bukit District (Axiom Tab): Kaki Bukit, Kampong Ubi - North East District: Hougang, Serangoon Gardens - Bukit Timah District: Botanic Gardens, Bukit Timah - Fort Canning District: Fort Canning, Oxley Road, Dhoby Ghaut - Gardens by the Bay - Thomson District: Thomson, MacRitchie Reservoir, Bishan Park, Bishan, Ang Mo Kio - Chinatown District: Chinatown, Amoy Street - Ayer Rajah District: Clementi, Singapore Polytechnic, Science Park, Alexandra Hospital, Henderson, Kim Tian, Kampong Bahru, Labrador Park - Bukit Panjang District: Bukit Panjang ## Grebes Order: [Podicipediformes](/wiki/Podicipediformes) Family: [Podicipedidae](/wiki/Podicipedidae) [Grebes](/wiki/Grebe) are small to medium-large freshwater diving birds. They have lobed toes and are excellent swimmers and divers. However, they have their feet placed far back on the body, making them quite ungainly on land. - Little grebe (*[Tachybaptus ruficollis](/wiki/Tachybaptus_ruficollis)*) - VR/RB - Halus, Rasir Ris Farmway, P. Ubin, KRP, Kranji Marsh, P. Punggol, Punggol, Singapore Quarry, Tampines Quarry ## Pigeons Order: [Columbiformes](/wiki/Columbiformes) Family: [Columbidae](/wiki/Columbidae) [Pigeons](/wiki/Pigeon) are stout-bodied birds with short necks and short slender bills with a fleshy [cere](/wiki/Cere). - Rock pigeon (*[Columba livia](/wiki/Columba_livia)*) - VC/IRB - urban areas - Oriental turtle-dove (*[Streptopelia orientalis](/wiki/Streptopelia_orientalis)*) - VR/V - LNR, Lim Chu Kang Lane 3, Rower's Bay, Sisters' Is. - Red collared-dove (*[Streptopelia tranquebarica](/wiki/Streptopelia_tranquebarica)*) - U/IRB - Admiralty Park, Changi, Halus, NTL, PRP, P. Punggol, P. Ubin - Spotted dove (*[Spilopelia chinensis](/wiki/Spilopelia_chinensis)*) - VC/RB - urban areas - Asian emerald dove (*[Chalcophaps indica](/wiki/Chalcophaps_indica)*) - U/RB - Admiralty Park, BBNP, BTNR, CCNR, DFNP, P. Ubin, SBWR - Zebra dove (*[Geopelia striata](/wiki/Geopelia_striata)*) - VC/RB - urban areas - Little green-pigeon (*[Treron olax](/wiki/Treron_olax)*) - *Ex/R* + VR/NBV - BTNR, CCNR, Punggol 17th Ave - Pink-necked green-pigeon (*[Treron vernans](/wiki/Treron_vernans)*) - C/RB - woodlands - Cinnamon-headed green-pigeon (*[Treron fulvicollis](/wiki/Treron_fulvicollis)*) - R/NBV - CCNR, P. Tekong, P. Ubin, SBWR, TEG - Orange-breasted green-pigeon (*[Treron bicinctus](/wiki/Treron_bicinctus)*) - VR/NBV - JLG - Thick-billed green-pigeon (*[Treron curvirostra](/wiki/Treron_curvirostra)*) - U/RB - BBC, BTNR, CCNR, DFNP, Springleaf, St. John Is., Sentosa, *Marina South* - Jambu fruit-dove (*[Ptilinopus jambu](/wiki/Ptilinopus_jambu)*) - U/NBV - BBNP, Bidadari, BTNR, CCNR, Changi, DFNP, JLG, Kranji Marsh, KRP, MFP, P. Punggol, SBG - Green imperial-pigeon (*[Ducula aenea](/wiki/Ducula_aenea)*) - U/RB - BBNP, CBP, Halus, Loyang, PRP, P. Ubin, P. Tekong - Mountain imperial-pigeon (*[Ducula badia](/wiki/Ducula_badia)*) - VR/V - P. Ubin (2012, 2016-7) - Pied imperial-pigeon (*[Ducula bicolor](/wiki/Ducula_bicolor)*) - R/NBV + C/IRB - NBV: P. Salu, Singapore Strait, Southern Islands; IRB: BBNP, Bt Batok West, JLG, LNR, WWC (Poyan), PRP, Tuas, WCP ## Cuckoos Order: [Cuculiformes](/wiki/Cuculiformes) Family: [Cuculidae](/wiki/Cuculidae) The family Cuculidae includes [cuckoos](/wiki/Cuckoo), [roadrunners](/wiki/Geococcyx) and [anis](/wiki/Ani_(bird)). These birds are of variable size with slender bodies, long tails and strong legs. The Old World cuckoos are [brood parasites](/wiki/Brood_parasite). - Greater coucal (*[Centropus sinensis](/wiki/Centropus_sinensis)*) - U/RB - woodlands: CCNR, Halus, Mandai, NTL, WWC (Poyan), PRP, SBG, SBWR, TBHP, Venus Drive - Lesser coucal (*[Centropus bengalensis](/wiki/Centropus_bengalensis)*) - C/RB - grasslands - Chestnut-bellied malkoha (*[Phaenicophaeus sumatranus](/wiki/Phaenicophaeus_sumatranus)*) - U/RB - BTNR, CCNR, DFNP, JEG, Mandai, WWC (Poyan), TBHP - Chestnut-winged cuckoo (*[Clamator coromandus](/wiki/Clamator_coromandus)*) - U/WVPM - Bidadari, CCNR, Changi, SBTB, Halus, JEG, JLG, WWC (Murai, Thousand Oaks, Poyan), PRP, P. Punggol, Simpang, SBG, SBWR, Tengah, TEG, Tuas, *Khatib Bongsu, Marina South* - Pied cuckoo (*[Clamator jacobinus](/wiki/Clamator_jacobinus)*) - VR/V - Halus (2013-4, 2015) - Asian koel (*[Eudynamys scolopaceus](/wiki/Eudynamys_scolopaceus)*) - C/RBWV - Islandwide (including offshore islands) - Asian emerald cuckoo (*[Chrysococcyx maculatus](/wiki/Chrysococcyx_maculatus)*) - VR/V - JLG (2021), P. Ubin (2021), Sentosa (2017-8), Ulu Pandan (2020) - Violet cuckoo (*[Chrysococcyx xanthorhynchus](/wiki/Chrysococcyx_xanthorhynchus)*) - U/RBWV - BBNP, BTNR, CCNR, DFNP, JEG, Mandai, NTL, PRP, WWC (Poyan), P. Ubin, SBG, Simpang, Springleaf, Tengah - Horsfield's bronze-cuckoo (*[Chrysococcyx basalis](/wiki/Chrysococcyx_basalis)*) - R/WV - Changi Beach, CCKC, Halus, Kranji, P. Punggol, P. Tekong, Punggol, Sentosa, Tuas, *Marina East*, *Marina South* - Little bronze-cuckoo (*[Chrysococcyx minutillus](/wiki/Chrysococcyx_minutillus)*) - C/RB - woodlands - Banded bay cuckoo (*[Cacomantis sonneratii](/wiki/Cacomantis_sonneratii)*) - U/RB - Bidadari, BBNP, BTNR, CCNR, Halus, Marina East, NTL, P. Ubin, SBWR - Plaintive cuckoo (*[Cacomantis merulinus](/wiki/Cacomantis_merulinus)*) - U/RB - Bidadari, BBNP, BTNR, CCNR, Changi, Halus, JLG, NTL, P. Punggol, P. Ubin, WWC (Poyan), PRP, Punggol, SBWR, Tampines, Tuas - Brush cuckoo (*[Cacomantis variolosus](/wiki/Cacomantis_variolosus)*) - U/RB - Bidadari, BTNR, CCNR, Coney Is., Halus, JLG, NTL, WWC (Poyan), P. Tekong, P. Ubin, PRP, SBG, SBWR, Sentosa, *Khatib Bongsu* - Square-tailed drongo-cuckoo (*[Surniculus lugubris](/wiki/Surniculus_lugubris)*) - U/RBWV - Bidadari, BBNP, BTNR, CCNR, JLG, Mandai, NTL, PRP, WWC (Poyan), SBG, SBWR - Large hawk-cuckoo (*[Hierococcyx sparverioides](/wiki/Hierococcyx_sparverioides)*) - R/WVPM - Bidadari, CCNR, Changi, JLG, P. Punggol, PRP, Sentosa, Tuas, *Khatib Bongsu* - Hodgson's hawk-cuckoo (*[Hierococcyx nisicolor](/wiki/Hierococcyx_nisicolor)*) - R/WVPM - Bidadari, BTNR, CCNR, Changi, CCKC, Coney Is., JLG, Kusu Is., Mandai, PRP, WWC (Poyan), P. Punggol, Sembawang, Tuas - Malaysian hawk-cuckoo (*[Hierococcyx fugax](/wiki/Hierococcyx_fugax)*) - R/NBV - BAMKP, Bidadari, BTNR, CCNR, Halus, JLG, WWC (Poyan), SBWR - Indian cuckoo (*[Cuculus micropterus](/wiki/Cuculus_micropterus)*) - U/WVPM - Bidadari, BTNR, CCNR, Changi, JLG, Mandai, MFP, NTL, WWC (Poyan), P. Punggol, SBG, SBWR, Sembawang, Sentosa, Tuas - Himalayan cuckoo (*[Cuculus saturatus](/wiki/Cuculus_saturatus)*) - R/PM - Bidadari, BBNP, CCNR, Coney Is., JLG, Tuas ## Nightjars and allies Order: [Caprimulgiformes](/wiki/Caprimulgiformes) Family: [Caprimulgidae](/wiki/Caprimulgidae) [Nightjars](/wiki/Nightjar) are medium-sized nocturnal birds that usually nest on the ground. They have long wings, short legs and very short bills. Most have small feet, of little use for walking, and long pointed wings. Their soft plumage is camouflaged to resemble bark or leaves. - Malaysian eared-nightjar (*[Lyncornis temminckii](/wiki/Lyncornis_temminckii)*) - *Ex/R* - BBNP, CCNR - Grey nightjar (*[Caprimulgus jotaka](/wiki/Caprimulgus_jotaka)*) - U/WVPM - Bidadari, CCNR, Changi, JLG, SBWR, TBHP - Large-tailed nightjar (*[Caprimulgus macrurus](/wiki/Caprimulgus_macrurus)*) - C/RB - woodlands - Savanna nightjar (*[Caprimulgus affinis](/wiki/Caprimulgus_affinis)*) - U/RB - grasslands: Changi, Halus, NTL, P. Ubin, Punggol, Seletar East, TEG, Tuas ## Swifts Order: [Caprimulgiformes](/wiki/Caprimulgiformes) Family: [Apodidae](/wiki/Apodidae) [Swifts](/wiki/Swift_(bird)) are small birds which spend the majority of their lives flying. These birds have very short legs and never settle voluntarily on the ground, perching instead only on vertical surfaces. Many swifts have long swept-back wings which resemble a crescent or boomerang. - Silver-rumped needletail (*[Rhaphidura leucopygialis](/wiki/Rhaphidura_leucopygialis)*) - VR/NBV - CCNR, Changi, WWC (Poyan) - White-throated needletail (*[Hirundapus caudacutus](/wiki/Hirundapus_caudacutus)*) - VR/PM - BTNR, CCNR, Henderson Waves - Silver-backed needletail (*[Hirundapus cochinchinensis](/wiki/Hirundapus_cochinchinensis)*) - R/WVPM - BTNR, CCNR, DFNP, Henderson Waves - Brown-backed needletail (*[Hirundapus giganteus](/wiki/Hirundapus_giganteus)*) - U/WVPM - BTNR, CCNR, Henderson Waves, Marina East, P. Ubin - Plume-toed swiftlet (*[Collocalia affinis](/wiki/Collocalia_affinis)*) - U/R - BBNP, BTNR, CCNR, DFNP, Henderson Waves, MFP, SBG - Black-nest swiftlet (*[Aerodramus maximus](/wiki/Aerodramus_maximus)*) - C/RB - islandwide, including offshore islands - Germain's swiftlet (*[Aerodramus germani](/wiki/Aerodramus_germani)*) - C/RB - islandwide, including offshore islands - Common swift (*[Apus apus](/wiki/Apus_apus)*) - VR/V - CCNR, Henderson Waves - Pacific swift (*[Apus pacificus](/wiki/Apus_pacificus)*) - U/WVPM - BTNR, CCNR, KRP, P. Ubin, Singapore Strait, Tuas - House swift (*[Apus nipalensis](/wiki/Apus_nipalensis)*) - U/RB - Buangkok, Changi, CCNR, DFNP, Halus, Henderson Waves, NTL, P. Punggol, P. Ubin, Tuas - Asian palm-swift (*[Cypsiurus balasiensis](/wiki/Cypsiurus_balasiensis)*) - U/RB - BTNR, CCKC, CCNR, Halus, KRP, WWC (Poyan), P. Ubin ## Treeswifts Order: [Caprimulgiformes](/wiki/Caprimulgiformes) Family: [Hemiprocnidae](/wiki/Hemiprocnidae) The treeswifts, also called crested swifts, are closely related to the [true swifts](/wiki/Swift_(bird)). They differ from the other swifts in that they have crests, long forked tails and softer plumage. - Grey-rumped treeswift (*[Hemiprocne longipennis](/wiki/Hemiprocne_longipennis)*) - U/RB - BAMKP, BBNP, Bidadari, CCNR, KRP, Mandai, SBG, TBHP - Whiskered treeswift (*[Hemiprocne comata](/wiki/Hemiprocne_comata)*) - *Ex/RB* + VR/NBV - BTNR, CCNR, Dairy Farm ## Rails, gallinules and coots Order: [Gruiformes](/wiki/Gruiformes) Family: [Rallidae](/wiki/Rallidae) Rallidae is a large family of small to medium-sized birds which includes the [rails](/wiki/Rail_(bird)), [crakes](/wiki/Crake), [coots](/wiki/Coot) and [gallinules](/wiki/Rallidae). Typically they inhabit dense vegetation in damp environments near lakes, swamps or rivers. In general they are shy and secretive birds, making them difficult to observe. Most species have strong legs and long toes which are well adapted to soft uneven surfaces. They tend to have short, rounded wings and to be weak fliers. - Slaty-breasted rail (*[Lewinia striata](/wiki/Lewinia_striata)*) - U/RB - tall grass areas - Eurasian moorhen (*[Gallinula chloropus](/wiki/Gallinula_chloropus)*) - U/RB - BAMKP, Halus, Kranji Marsh, Lim Chu Kang Lane 3, Marina East, One-North, WWC (Poyan), SBG, WCP, *Marina South, P. Punggol, Serangoon* - Eurasian coot (*[Fulica atra](/wiki/Fulica_atra)*) - VR/V - *WWC (Poyan)* - Black-backed swamphen (*[Porphyrio indicus](/wiki/Porphyrio_indicus)*) - VR/NBV - CBP, Kranji Marsh - Grey-headed swamphen (*[Porphyrio poliocephalus](/wiki/Porphyrio_poliocephalus)*) - *R/RB* - *Halus, Kranji Marsh, Neo Tiew, WWC (Poyan), TEG* - Watercock (*[Gallicrex cinerea](/wiki/Gallicrex_cinerea)*) - U/WV - Changi, Halus, Jurong East, Kranji Marsh, Marina East, WWC (Poyan), SBG, SBWR, Tuas, *Khatib Bongsu*, *Marina South* - White-breasted waterhen (*[Amaurornis phoenicurus](/wiki/Amaurornis_phoenicurus)*) - C/RBWV - islandwide - White-browed crake (*[Poliolimnas cinereus](/wiki/Poliolimnas_cinereus)*) - U/RB - Halus, Kranji Marsh, SBWR, *Punggol* - Red-legged crake (*[Rallina fasciata](/wiki/Rallina_fasciata)*) - U/RBWV - BBNP, BBC, BTNR, CCNR, Halus, MFP, P. Ubin, SBG, SBWR - Slaty-legged crake (*[Rallina eurizonoides](/wiki/Rallina_eurizonoides)*) - VR/WVPM - Admiralty Park, Bedok, Haig Road, Jurong Is., JLG, LPR, Punggol, Sentosa - Ruddy-breasted crake (*[Zapornia fusca](/wiki/Zapornia_fusca)*) - U/RBWV - BAMKP, Changi, Halus, Kranji Marsh, LSR, Marina East, Punggol, P. Punggol, Tampines, Tuas, *Marina South* - Band-bellied crake (*[Zapornia paykullii](/wiki/Porzana_paykullii)*) - VR/PM - Bedok, CCNR, JLG, Lor Lada Hitam, SBG, Venus Drive - Baillon's crake (*[Zapornia pusilla](/wiki/Zapornia_pusilla)*) - R/WVPM - Bt. Batok, Halus, Marina East, NTL, SBTB, Tampines, Tuas, P. Punggol ## Finfoots Order: [Gruiformes](/wiki/Gruiformes) Family: [Heliornithidae](/wiki/Heliornithidae) Heliornithidae is a small family of tropical birds with webbed lobes on their feet similar to those of grebes and coots. - Masked finfoot (*[Heliopais personatus](/wiki/Heliopais_personatus)*) - V - SBWR (1999), USR (2002, 2010) ## Thick-knees Order: [Charadriiformes](/wiki/Charadriiformes) Family: [Burhinidae](/wiki/Burhinidae) The thick-knees are a group of largely tropical waders in the family Burhinidae. They are found worldwide within the tropical zone, with some species also breeding in temperate Europe and Australia. They are medium to large waders with strong black or yellow-black bills, large yellow eyes and cryptic plumage. Despite being classed as waders, most species have a preference for arid or semi-arid habitats. - Beach thick-knee (*[Esacus magnirostris](/wiki/Esacus_magnirostris)*) - **Ex/R** - Southern Islands ## Stilts and avocets Order: [Charadriiformes](/wiki/Charadriiformes) Family: [Recurvirostridae](/wiki/Recurvirostridae) Recurvirostridae is a family of large wading birds, which includes the [avocets](/wiki/Avocet) and [stilts](/wiki/Stilt). The avocets have long legs and long up-curved bills. The stilts have extremely long legs and long, thin, straight bills. - Black-winged stilt (*[Himantopus himantopus](/wiki/Himantopus_himantopus)*) - VR/WV + VR/RB - WVPM: Changi, JLG, Kranji Marsh, LSD, Marina East, SBWR, Tuas, *P. Punggol*. RB: P. Tekong (2019) - Pied stilt (*[Himantopus leucocephalus](/wiki/Himantopus_leucocephalus)*) - VR/RB+NBV - Marina East (2023), P. Tekong (2019, 2021), Seletar Dam (2023) ## Plovers and lapwings Order: [Charadriiformes](/wiki/Charadriiformes) Family: [Charadriidae](/wiki/Charadriidae) The family Charadriidae includes the [plovers](/wiki/Plover), [dotterels](/wiki/Dotterel) and [lapwings](/wiki/Lapwing). They are small to medium-sized birds with compact bodies, short, thick necks and long, usually pointed, wings. They are found in open country worldwide, mostly in habitats near water. - Black-bellied plover (*[Pluvialis squatarola](/wiki/Pluvialis_squatarola)*) - U/WVPM - Changi, P. Tekong, P. Ubin, SBWR - Pacific golden-plover (*[Pluvialis fulva](/wiki/Pluvialis_fulva)*) - C/WVPM - rivers, coasts, mudflats, open areas - Grey-headed lapwing (*[Vanellus cinereus](/wiki/Vanellus_cinereus)*) - R/WVPM - Holland Plain, Marina East, NTL, SBG, SBWR, Tuas - Red-wattled lapwing (*[Vanellus indicus](/wiki/Vanellus_indicus)*) - U/RB - Bukit Batok West, Changi, Kranji, Marina East, Neo Tiew, Kranji, Marina East, NTL, Punggol, P. Punggol, P. Tekong, P. Ubin, SBWR, WWC (Sarimbun), Tuas, Warren - Masked lapwing (*[Vanellus miles](/wiki/Vanellus_miles)*) - U/IRB - Marina East, Seletar West, Sungei Bedok - Tibetan sand-plover (*[Charadrius atrifrons](/wiki/Charadrius_atrifrons)*) - C/WV - Seletar Dam, SBWR, Mandai Mudflat, Ubin, Marina East and Pulau Punggol - Greater sand-plover (*[Charadrius leschenaultii](/wiki/Charadrius_leschenaultii)*) - U/WVPM - Changi, LSD, Marina East, SBWR - Malaysian plover (*[Charadrius peronii](/wiki/Charadrius_peronii)*) - U/RB - Changi, Halus, LSD, Marina East, P. Semakau, Tuas - Kentish plover (*[Charadrius alexandrinus](/wiki/Charadrius_alexandrinus)*) - U/WVPM - Changi, Marina East, Tuas - White-faced plover (*[Charadrius dealbatus](/wiki/Charadrius_dealbatus)*) - U/WVPM - Changi, Marina East - Javan plover (*[Charadrius javanicus](/wiki/Charadrius_javanicus)*) - VR/NBV - Marina East, P. Tekong - Common ringed plover (*[Charadrius hiaticula](/wiki/Charadrius_hiaticula)*) - VR/PM - Changi, SBWR - Little ringed plover (*[Charadrius dubius](/wiki/Charadrius_dubius)*) - U/WVPM - open areas, rivers, coasts - Oriental plover (*[Charadrius veredus](/wiki/Charadrius_veredus)*) - VR/PM - Changi, LSD, P. Ubin, Tuas ## Painted-snipes Order: [Charadriiformes](/wiki/Charadriiformes) Family: [Rostratulidae](/wiki/Rostratulidae) Painted-snipes are short-legged, long-billed birds similar in shape to the true snipes, but more brightly coloured. - Greater painted-snipe (*[Rostratula benghalensis](/wiki/Rostratula_benghalensis)*) - R/RB - Halus, Jurong Central Park, Jurong West, Kranji Marsh, Marina East, Pasir Ris Farmway, Punggol, Tuas, SBG ## Jacanas Order: [Charadriiformes](/wiki/Charadriiformes) Family: [Jacanidae](/wiki/Jacanidae) The jacanas are a group of tropical waders in the family Jacanidae. They are found throughout the tropics. They are identifiable by their huge feet and claws which enable them to walk on floating vegetation in the shallow lakes that are their preferred habitat. - Pheasant-tailed jacana (*[Hydrophasianus chirurgus](/wiki/Hydrophasianus_chirurgus)*) - VR/WV - CCNR, Halus, HNP (Hindhede Quarry), Marina East, NTL (Kranji Marsh), SBTB, SBWR ## Sandpipers and allies Order: [Charadriiformes](/wiki/Charadriiformes) Family: [Scolopacidae](/wiki/Scolopacidae) Scolopacidae is a large diverse family of small to medium-sized shorebirds including the [sandpipers](/wiki/Sandpiper), [curlews](/wiki/Curlew), [godwits](/wiki/Godwit), [shanks](/wiki/Tringa), [tattlers](/wiki/Tattler_(bird)), [woodcocks](/wiki/Woodcock), [snipes](/wiki/Snipe), [dowitchers](/wiki/Dowitcher) and [phalaropes](/wiki/Phalarope). The majority of these species eat small invertebrates picked out of the mud or soil. Variation in length of legs and bills enables multiple species to feed in the same habitat, particularly on the coast, without direct competition for food. - Whimbrel (*[Numenius phaeopus](/wiki/Numenius_phaeopus)*) - C/WVPM - rivers, coasts, mudflats - Little curlew (*[Numenius minutus](/wiki/Numenius_minutus)*) - VR/V - Tuas (1997) - Far Eastern curlew (*[Numenius madagascariensis](/wiki/Numenius_madagascariensis)*) - VR/PM - Changi, SBWR - Eurasian curlew (*[Numenius arquata](/wiki/Numenius_arquata)*) - R/WVPM - Changi, P. Tekong, P. Ubin, SBWR, Tuas - Bar-tailed godwit (*[Limosa lapponica](/wiki/Limosa_lapponica)*) - U/WVPM - Changi, Mandai Mudflat, P. Ubin, SBWR - Black-tailed godwit (*[Limosa limosa](/wiki/Limosa_limosa)*) - U/WVPM - Changi, Mandai Mudflat, SBWR - Ruddy turnstone (*[Arenaria interpres](/wiki/Arenaria_interpres)*) - U/WV - Changi, Halus, LSD, Mandai Mudflat, P. Tekong, P. Ubin, SBWR - Great knot (*[Calidris tenuirostris](/wiki/Calidris_tenuirostris)*) - R/PM - Changi, LSD, Mandai Mudflat, SBWR - Red knot (*[Calidris canutus](/wiki/Calidris_canutus)*) - VR/WV - LSD, P. Ubin, SBWR - Ruff (*[Calidris pugnax](/wiki/Calidris_pugnax)*) - VR/WV - Changi, SBWR - Broad-billed sandpiper (*[Calidris falcinellus](/wiki/Calidris_falcinellus)*) - U/WVPM - Changi, Mandai Mudflat, SBWR - Sharp-tailed sandpiper (*[Calidris acuminata](/wiki/Calidris_acuminata)*) - R/V - Changi - Curlew sandpiper (*[Calidris ferruginea](/wiki/Calidris_ferruginea)*) - U/WVPM - Changi, LSD, Mandai Mudflat, P. Tekong, SBWR - Temminck's stint (*[Calidris temminckii](/wiki/Calidris_temminckii)*) - VR/PM - *S. Jurong, Senoko* - Long-toed stint (*[Calidris subminuta](/wiki/Calidris_subminuta)*) - R/WVPM - Changi, NTL, Pulau Punggol, SBWR, Tuas - Spoon-billed sandpiper (*[Calidris pygmaea](/wiki/Calidris_pygmaea)*) - VR/WV - Changi - Red-necked stint (*[Calidris ruficollis](/wiki/Calidris_ruficollis)*) - U/WVPM - Changi, Mandai Mudflat, P. Ubin, SBWR - Sanderling (*[Calidris alba](/wiki/Calidris_alba)*) - U/WV - Changi, LSD, Marina East, P. Tekong, P. Ubin, SBWR - Dunlin (*[Calidris alpina](/wiki/Calidris_alpina)*) - VR/PM - *Changi, Senoko* - Little stint (*[Calidris minuta](/wiki/Calidris_minuta)*) - VR/PM - P. Ubin (2017) - Pectoral sandpiper (*[Calidris melanotos](/wiki/Calidris_melanotos)*) - R/V - Changi - Asian dowitcher (*[Limnodromus semipalmatus](/wiki/Limnodromus_semipalmatus)*) - U/WVPM - Changi, Halus, P. Ubin, SBWR - Eurasian woodcock (*[Scolopax rusticola](/wiki/Scolopax_rusticola)*) - VR/V - *Changi, Serangoon* - Common snipe (*[Gallinago gallinago](/wiki/Gallinago_gallinago)*) - U/WV - Changi, JLG, Halus, WWC (Poyan), SBWR, Tuas, Venus Drive, Khatib Bongsu, P. Punggol, Punggol - Pin-tailed snipe (*[Gallinago stenura](/wiki/Gallinago_stenura)*) - U/WV - Changi, CCKC, Halus, JLG, Punggol, P. Ubin, SBWR, Tuas, Warren - Swinhoe's snipe (*[Gallinago megala](/wiki/Gallinago_megala)*) - R/WV - Changi, Jurong West, Punggol, NTL - Terek sandpiper (*[Xenus cinereus](/wiki/Xenus_cinereus)*) - U/WVPM - Changi, LSD, Mandai Mudflat, P. Tekong, P. Ubin, SBWR - Red-necked phalarope (*[Phalaropus lobatus](/wiki/Phalaropus_lobatus)*) - VR/WV - P. Tekong, Singapore Strait - Common sandpiper (*[Actitis hypoleucos](/wiki/Actitis_hypoleucos)*) - VC/WVPM - waterbodies - Green sandpiper (*[Tringa ochropus](/wiki/Tringa_ochropus)*) - VR/WV - CCK, Lim Chu Kang Lane 3, NTL, SBWR - Grey-tailed tattler (*[Tringa brevipes](/wiki/Tringa_brevipes)*) - U/WVPM - Changi, Mandai Mudflat, SBWR - Spotted redshank (*[Tringa erythropus](/wiki/Tringa_erythropus)*) - VR/WV - Punggol, SBWR - Common greenshank (*[Tringa nebularia](/wiki/Tringa_nebularia)*) - VC/WVPM - rivers, coasts, mudflats - Nordmann's greenshank (*[Tringa guttifer](/wiki/Tringa_guttifer)*) - VR/WV - Changi, SBWR - Marsh sandpiper (*[Tringa stagnatilis](/wiki/Tringa_stagnatilis)*) - U/WVPM - rivers, coasts, mudflats - Wood sandpiper (*[Tringa glareola](/wiki/Tringa_glareola)*) - U/WVPM - Changi, Halus, JLG, NTL, Punggol, P. Punggol, SBWR, Tuas - Common redshank (*[Tringa totanus](/wiki/Tringa_totanus)*) - VC/WVPM - rivers, coasts, mudflats ## Buttonquail Order: [Charadriiformes](/wiki/Charadriiformes) Family: [Turnicidae](/wiki/Turnicidae) The buttonquail are small, drab, running birds which resemble the true quails. The female is the brighter of the sexes and initiates courtship. The male incubates the eggs and tends the young. - Barred buttonquail (*[Turnix suscitator](/wiki/Turnix_suscitator)*) - U/RB - Changi, Coney Is., Halus, JLG, NTL, Pasir Ris Farmway, P. Punggol, P. Ubin, Punggol, TEG, Tuas ## Pratincoles and coursers Order: [Charadriiformes](/wiki/Charadriiformes) Family: [Glareolidae](/wiki/Glareolidae) Glareolidae is a family of wading birds comprising the [pratincoles](/wiki/Pratincole), which have short legs, long pointed wings and long forked tails, and the [coursers](/wiki/Courser), which have long legs, short wings and long, pointed bills which curve downwards. - Oriental pratincole (*[Glareola maldivarum](/wiki/Glareola_maldivarum)*) - U/PM - CCNR, Changi, Henderson Waves, Kranji Marsh, Marina East, Punggol, P. Punggol, P. Semakau, P. Ubin, Seletar East, Tuas - Small pratincole (*[Glareola lactea](/wiki/Glareola_lactea)*) - VR/PM - *Changi, P. Punggol* ## Skuas and jaegers Order: [Charadriiformes](/wiki/Charadriiformes) Family: [Stercorariidae](/wiki/Stercorariidae) The family Stercorariidae are, in general, medium to large birds, typically with grey or brown plumage, often with white markings on the wings. They nest on the ground in temperate and arctic regions and are long-distance migrants. - Pomarine jaeger (*[Stercorarius pomarinus](/wiki/Stercorarius_pomarinus)*) - VR/V - Singapore Strait - Parasitic jaeger (*[Stercorarius parasiticus](/wiki/Stercorarius_parasiticus)*) - R/WV - P. Punggol, Singapore Strait - Long-tailed jaeger (*[Stercorarius longicaudus](/wiki/Stercorarius_longicaudus)*) - VR/V - Singapore Strait ## Gulls, terns, and skimmers Order: [Charadriiformes](/wiki/Charadriiformes) Family: [Laridae](/wiki/Laridae) Laridae is a family of medium to large seabirds, the [gulls](/wiki/Gull), [terns](/wiki/Tern), and [skimmers](/wiki/Skimmer_(bird)). Gulls are typically grey or white, often with black markings on the head or wings. They have stout, longish bills and webbed feet. Terns are a group of generally medium to large seabirds typically with grey or white plumage, often with black markings on the head. Most terns hunt fish by diving but some pick insects off the surface of fresh water. Terns are generally long-lived birds, with several species known to live in excess of 30 years. - Black-headed gull (*[Chroicocephalus ridibundus](/wiki/Chroicocephalus_ridibundus)*) - R/WV - LSD, Mandai Mudflat, P. Ubin, Singapore Strait - Brown-headed gull (*[Chroicocephalus brunnicephalus](/wiki/Chroicocephalus_brunnicephalus)*) - VR/V - Johor Strait, Kranji - Lesser black-backed gull (*[Larus fuscus](/wiki/Larus_fuscus)*) - VR/V - Singapore Strait (2011) - Bridled tern (*[Onychoprion anaethetus](/wiki/Onychoprion_anaethetus)*) - U/RB, C/PM - Pedra Branca, Singapore Strait - Aleutian tern (*[Onychoprion aleuticus](/wiki/Onychoprion_aleuticus)*) - U/WV - Singapore Strait - Little tern (*[Sternula albifrons](/wiki/Sternula_albifrons)*) - C/RBWV - inland (nest), rivers, coasts, seas - Gull-billed tern (*[Gelochelidon nilotica](/wiki/Gelochelidon_nilotica)*) - R/WVPM - Changi, Mandai Mudflat, P. Tekong, P. Ubin, Sentosa, Singapore Strait - Caspian tern (*[Hydroprogne caspia](/wiki/Hydroprogne_caspia)*) - R/WV - Mandai Mudflat - White-winged tern (*[Chlidonias leucopterus](/wiki/Chlidonias_leucopterus)*) - U/WVPM - rivers, coasts, seas - Whiskered tern (*[Chlidonias hybrida](/wiki/Chlidonias_hybrida)*) - R/WVPM - Halus, Johor Strait, JLG, Kranji Dam, Serangoon, Singapore Strait - Roseate tern (*[Sterna dougallii](/wiki/Sterna_dougallii)*) - VR/V - Pedra Branca - Black-naped tern (*[Sterna sumatrana](/wiki/Sterna_sumatrana)*) - U/RB - Changi, Johor Strait, Pedra Branca, P. Tekong, P. Ubin, Singapore Strait - Common tern (*[Sterna hirundo](/wiki/Sterna_hirundo)*) - U/WV - Changi, Halus, Mandai Mudflat, Singapore Strait - Great crested tern (*[Thalasseus bergii](/wiki/Thalasseus_bergii)*) - C/WV - Changi, Johor Strait, Mandai Mudflat, Pedra Branca, P. Ubin, Singapore Strait - Lesser crested tern (*[Thalasseus bengalensis](/wiki/Thalasseus_bengalensis)*) - U/WV - Changi, Johor Strait, Mandai Mudflat, Pedra Branca, P. Ubin, Punggol, Singapore Strait ## Tropicbirds Order: [Phaethontiformes](/wiki/Phaethontiformes) Family: [Phaethontidae](/wiki/Phaethontidae) [Tropicbirds](/wiki/Tropicbird) are slender white birds of tropical oceans, with exceptionally long central tail feathers. Their heads and long wings have black markings. - Red-billed tropicbird (*[Phaethon aethereus](/wiki/Phaethon_aethereus)*) - VR/V - *S. Serangoon (1986)* - White-tailed tropicbird (*[Phaethon lepturus](/wiki/Phaethon_lepturus)*) - VR/V - Tuas (2015) ## Northern storm-petrels Order: [Procellariiformes](/wiki/Procellariiformes) Family: [Hydrobatidae](/wiki/Hydrobatidae) Though the members of this family are similar in many respects to the southern storm-petrels, including their general appearance and habits, there are enough genetic differences to warrant their placement in a separate family. - Swinhoe's storm-petrel (*[Hydrobates monorhis](/wiki/Hydrobates_monorhis)*) - C/PM - P. Ubin, Singapore Strait ## Shearwaters and petrels Order: [Procellariiformes](/wiki/Procellariiformes) Family: [Procellariidae](/wiki/Procellariidae) The procellariids are the main group of medium-sized \"true petrels\", characterised by united nostrils with medium septum and a long outer functional primary. - Bulwer's petrel (*[Bulweria bulwerii](/wiki/Bulweria_bulwerii)*) - R/PM - Singapore Strait - Short-tailed shearwater (*[Ardenna tenuirostris](/wiki/Ardenna_tenuirostris)*) - U/PM - Singapore Strait - Wedge-tailed shearwater (*[Ardenna pacifica](/wiki/Ardenna_pacifica)*) - VR/V - BAMKP (2021) ## Storks Order: [Ciconiiformes](/wiki/Ciconiiformes) Family: [Ciconiidae](/wiki/Ciconiidae) Storks are large, long-legged, long-necked, wading birds with long, stout bills. Storks are mute, but bill-clattering is an important mode of communication at the nest. Their nests can be large and may be reused for many years. Many species are migratory. - Asian openbill (*[Anastomus oscitans](/wiki/Anastomus_oscitans)*) - R/NBV - islandwide - Lesser adjutant (*[Leptoptilos javanicus](/wiki/Leptoptilos_javanicus)*) - U/RB, R/NBV - Kranji Marsh, P. Ubin, SBWR, WWC (All) - Milky stork (*[Mycteria cinerea](/wiki/Mycteria_cinerea)*) - U/IRB - Admiralty Park, JLG, SBWR - Painted stork (*[Mycteria leucocephala](/wiki/Mycteria_leucocephala)*) - U/IRB - Admiralty Park, JLG, SBWR ## Frigatebirds Order: [Suliformes](/wiki/Suliformes) Family: [Fregatidae](/wiki/Fregatidae) [Frigatebirds](/wiki/Frigatebird) are large seabirds usually found over tropical oceans. They are large, black-and-white or completely black, with long wings and deeply forked tails. The males have coloured inflatable throat pouches. They do not swim or walk and cannot take off from a flat surface. Having the largest wingspan-to-body-weight ratio of any bird, they are essentially aerial, able to stay aloft for more than a week. - Lesser frigatebird (*[Fregata ariel](/wiki/Fregata_ariel)*) - VR/NBV - Pedra Branca, Singapore Strait - Christmas Island frigatebird (*[Fregata andrewsi](/wiki/Fregata_andrewsi)*) - VR/NBV - P. Ubin, Singapore Strait, SBWR ## Boobies and gannets Order: [Suliformes](/wiki/Suliformes) Family: [Sulidae](/wiki/Sulidae) The sulids comprise the [gannets](/wiki/Gannet) and [boobies](/wiki/Booby). Both groups are medium to large coastal seabirds that plunge-dive for fish. - Brown booby (*[Sula leucogaster](/wiki/Sula_leucogaster)*) - VR/V - Pedra Branca, SBWR, Singapore Strait - Red-footed booby (*[Sula sula](/wiki/Sula_sula)*) - VR/V - CCKC, Henderson Waves, Singapore Strait, St. John Is., Marina East (carcass) ## Anhingas Order: [Suliformes](/wiki/Suliformes) Family: [Anhingidae](/wiki/Anhingidae) Anhingas or darters are often called \"snake-birds\" because of their long thin neck, which gives a snake-like appearance when they swim with their bodies submerged. The males have black and dark-brown plumage, an erectile crest on the nape and a larger bill than the female. The females have much paler plumage especially on the neck and underparts. The darters have completely webbed feet and their legs are short and set far back on the body. Their plumage is somewhat permeable, like that of cormorants, and they spread their wings to dry after diving. - Oriental darter (*[Anhinga melanogaster](/wiki/Anhinga_melanogaster)*) - R/NBV - Bt. Gombak, Hindhede Quarry, P. Ubin, Singapore Quarry, SBWR ## Cormorants and shags Order: [Suliformes](/wiki/Suliformes) Family: [Phalacrocoracidae](/wiki/Phalacrocoracidae) Phalacrocoracidae is a family of medium to large coastal, fish-eating seabirds that includes cormorants and shags. Plumage colouration varies, with the majority having mainly dark plumage, some species being black-and-white and a few being colourful. - Great cormorant (*[Phalacrocorax carbo](/wiki/Phalacrocorax_carbo)*) - U/F - Changi, JLG, Johor Strait, Kranji Dam, Mandai Mudflat, Tuas ## Herons, egrets, and bitterns Order: [Pelecaniformes](/wiki/Pelecaniformes) Family: [Ardeidae](/wiki/Ardeidae) The family Ardeidae contains the [bitterns](/wiki/Bittern), [herons](/wiki/Heron) and [egrets](/wiki/Egret). Herons and egrets are medium to large wading birds with long necks and legs. Bitterns tend to be shorter necked and more wary. Members of Ardeidae fly with their necks retracted, unlike other long-necked birds such as storks, ibises and spoonbills. - Yellow bittern (*[Ixobrychus sinensis](/wiki/Ixobrychus_sinensis)*) - C/RB+WV - reeds - Schrenck's bittern (*[Ixobrychus eurhythmus](/wiki/Ixobrychus_eurhythmus)*) - R/WV - CCNR, Changi, Halus, JLG, Jurong West, PRP, Punggol, Sengkang, SBG, SBTB, SBWR, Tuas, Venus Drive - Cinnamon bittern (*[Ixobrychus cinnamomeus](/wiki/Ixobrychus_cinnamomeus)*) - U/RB+WV - Bidadari, CCKC, Changi, Halus, JLG, NTL, PRP, SBG, SBWR, Tuas, *Jurong West, P. Punggol, Seletar West* - Black bittern (*[Ixobrychus flavicollis](/wiki/Ixobrychus_flavicollis)*) - U/WV - BAMKP, CCNR, DFNP, Hindhede Quarry, JEG, JLG, Halus, PRP, P. Ubin, SBG, SBTB, SBWR, Tuas - Grey heron (*[Ardea cinerea](/wiki/Ardea_cinerea)*) - C/RB - waterbodies - Great-billed heron (*[Ardea sumatrana](/wiki/Ardea_sumatrana)*) - U/RB - Changi, Coney Is., Jurong Is., JLG, LNR, LSD, KRP, WWC (Poyan), P. Hantu, P. Jong, P. Punggol, P. Semakau, P. Tekong, P. Ubin, Sentosa, SBWR, WCP, Tuas - Purple heron (*[Ardea purpurea](/wiki/Ardea_purpurea)*) - C/RB - grassfields, waterbodies - Great egret (*[Ardea alba](/wiki/Ardea_alba)*) - C/WV - waterbodies - Medium egret (*[Ardea intermedia](/wiki/Ardea_intermedia)*) - C/WV - grassfields, waterbodies - Chinese egret (*[Egretta eulophotes](/wiki/Egretta_eulophotes)*) - R/WV - Changi, PRP, P. Ubin, SBWR, *S. Serangoon* - Little egret (*[Egretta garzetta](/wiki/Egretta_garzetta)*) - C/WV - waterbodies - Pacific reef-heron (*[Egretta sacra](/wiki/Egretta_sacra)*) - U/R - Changi, LSD, Marina East, P. Hantu, P. Semakau, P. Ubin, PRP, Siglap Canal, SBWR, WCP, *S. Punggol, S. Serangoon* - Eastern cattle egret (*[Bubulcus coromandus](/wiki/Bubulcus_coromandus)*) - C/WV - grassfields - Indian pond-heron (*[Ardeola grayii](/wiki/Ardeola_grayii)*) - VR/V - Bidadari, Dover Road, Holland Plain, Jurong Lake, Pasir Ris Farmway, Punggol, S. Bedok - Chinese pond-heron (*[Ardeola bacchus](/wiki/Ardeola_bacchus)*) - C/WV - Changi, Halus, JLG, LNR, WWC (Poyan), SBWR, *Marina South* - Javan pond-heron (*[Ardeola speciosa](/wiki/Ardeola_speciosa)*) - U/WV - BAMKP, Marina East, Pasir Ris Farmway, SBWR, *S. Serangoon* - Striated heron (*[Butorides striata](/wiki/Butorides_striata)*) - C/RBWV - waterbodies - Black-crowned night-heron (*[Nycticorax nycticorax](/wiki/Nycticorax_nycticorax)*) - U/RB - waterbodies - Malayan night-heron (*[Gorsachius melanolophus](/wiki/Gorsachius_melanolophus)*) - R/WVPM - Bidadari, CCNR, Halus, JLG, NTL, SBG, Tuas ## Ibises and spoonbills Order: [Pelecaniformes](/wiki/Pelecaniformes) Family: [Threskiornithidae](/wiki/Threskiornithidae) Threskiornithidae is a family of large terrestrial and wading birds which includes the [ibises](/wiki/Ibis) and [spoonbills](/wiki/Spoonbill). They have long, broad wings with 11 primary and about 20 secondary feathers. They are strong fliers and despite their size and weight, very capable soarers. - Glossy ibis (*[Plegadis falcinellus](/wiki/Plegadis_falcinellus)*) - VR/V - Halus, Kranji Dam, Sime Road, SBWR - Black-headed ibis (*[Threskiornis melanocephalus](/wiki/Threskiornis_melanocephalus)*) - VR/V - SBWR (2022) ## Osprey Order: [Accipitriformes](/wiki/Accipitriformes) Family: [Pandionidae](/wiki/Pandionidae) The family Pandionidae contains only one species, the osprey. The osprey is a medium-large [raptor](/wiki/Bird_of_prey) which is a specialist fish-eater with a worldwide distribution. - Osprey (*[Pandion haliaetus](/wiki/Pandion_haliaetus)*) - U/NBV - Changi, DFNP, Halus, Henderson Waves, Kranji, Mandai Mudflat, NTL, P. Punggol, P. Tekong, P. Ubin, PRP, SBWR, Sembawang Park, S. Punggol, S. Serangoon ## Hawks, eagles, and kites Order: [Accipitriformes](/wiki/Accipitriformes) Family: [Accipitridae](/wiki/Accipitridae) Accipitridae is a family of birds of prey, which includes [hawks](/wiki/Hawk), [eagles](/wiki/Eagle), [kites](/wiki/Kite_(bird)), [harriers](/wiki/Harrier_(bird)) and [Old World vultures](/wiki/Old_World_vulture). These birds have powerful hooked beaks for tearing flesh from their prey, strong legs, powerful talons and keen eyesight. - Black-winged kite (*[Elanus caeruleus](/wiki/Elanus_caeruleus)*) - C/RB - grasslands - Oriental honey-buzzard (*[Pernis ptilorhynchus](/wiki/Pernis_ptilorhynchus)*) - orientalis: C/WVPM, torquatus: U/NBV - Jerdon's baza (*[Aviceda jerdoni](/wiki/Aviceda_jerdoni)*) - U/WVPM - AMK TGW, Bidadari, BTNR, CCKC, CCNR, Changi, Clementi, DFNP, Halus, JLG, PRP, WWC (Poyan), Springleaf, TEG, *Marina South* - Black baza (*[Aviceda leuphotes](/wiki/Aviceda_leuphotes)*) - C/WVPM - islandwide - Cinereous vulture (*[Aegypius monachus](/wiki/Aegypius_monachus)*) - VR/V - SBG (2021) - Himalayan griffon (*[Gyps himalayensis](/wiki/Gyps_himalayensis)*) - R/V - AMK, BBNP, BTNR, Central Business District, Changi, HNP, Orchard Road, SBG, Toa Payoh, Tuas - Crested serpent-eagle (*[Spilornis cheela](/wiki/Spilornis_cheela)*) - R/RB - BTNR, CCNR, Goldhill Avenue, JLG, Malcolm Park, P. Tekong, P. Ubin, Sembawang Park, SBG, Springleaf, SBWR - Short-toed snake-eagle (*[Circaetus gallicus](/wiki/Circaetus_gallicus)*) - V - CCNR, Changi, JLG, Halus, NTL, SBWR, Southern Ridges, Tuas - Bat hawk (*[Macheiramphus alcinus](/wiki/Macheiramphus_alcinus)*) - VR/NBV - Kranji, MacRitchie, MFP - Changeable hawk-eagle (*[Nisaetus cirrhatus](/wiki/Nisaetus_cirrhatus)*) - U/RB - forests, woodlands - Rufous-bellied eagle (*[Hieraaetus kienerii](/wiki/Hieraaetus_kienerii)*) - R/WVPM - BBNP, BBC, BTNR, CCNR, Halus, Pang Sua, SBG, SBWR, Swiss Club Road - Greater spotted eagle (*[Clanga clanga](/wiki/Clanga_clanga)*) - VR/WV - Changi, Henderson Waves, WWC (Murai, Sungei Gedong), NTL, P. Punggol, SBG, Tuas - Booted eagle (*[Hieraaetus pennatus](/wiki/Hieraaetus_pennatus)*) - U/WV - Bidadari, Bt. Panjang, CCKC, CCNR, Changi, WWC (Poyan), Punggol, P. Punggol, Tuas - Steppe eagle (*[Aquila nipalensis](/wiki/Aquila_nipalensis)*) - VR/V - Changi, Pasir Ris, Halus, Tuas, *Punggol, S. Serangoon* - Eastern imperial eagle (*[Aquila heliaca](/wiki/Aquila_heliaca)*) - VR/V - Changi, P. Ubin (2016-7), *Punggol* - Grey-faced buzzard (*[Butastur indicus](/wiki/Butastur_indicus)*) - U/WV - BBNP, CCNR, Changi, Henderson Waves, P. Ubin, SBWR, Tuas - Eastern marsh-harrier (*[Circus spilonotus](/wiki/Circus_spilonotus)*) - U/WV - Changi, Henderson Waves, NTL, WWC (Poyan), P. Semakau, Sengkang, SBWR, Tuas - Hen harrier (*[Circus cyaneus](/wiki/Circus_cyaneus)*) - VR/WV - *Halus, WWC (Poyan)* - Pied harrier (*[Circus melanoleucos](/wiki/Circus_melanoleucos)*) - R/WV - Changi, NTL, P. Punggol, SBWR, TBHP, Tuas - Crested goshawk (*[Accipiter trivirgatus](/wiki/Accipiter_trivirgatus)*) - U/RB - AMK TGW, BAMKP, Bedok, BTNR, CCNR, Changi, Goldhill Ave, JLG, Kranji Dam, NTL, PRP, Punggol, P. Ubin, SBG, SBTB, Sembawang Park, Sentosa, Southern Ridges, Zoo - Shikra (*[Accipiter badius](/wiki/Accipiter_badius)*) - VR/V - CCNR (2019), Changi (2012) - Chinese sparrowhawk (*[Accipiter soloensis](/wiki/Accipiter_soloensis)*) - U/WVPM - AMK TGW, CCNR, Changi, Coney Is., JLG, LSD, NTL, P. Punggol, P. Ubin, PRP, SBG, SBWR, Southern Ridges, Tuas, WCP - Japanese sparrowhawk (*[Accipiter gularis](/wiki/Accipiter_gularis)*) - C/WVPM - islandwide - Besra (*[Accipiter virgatus](/wiki/Accipiter_virgatus)*) - R/PM - CCNR, Changi, Singapore Quarry, Southern Ridges, Tuas - Eurasian sparrowhawk (*[Accipiter nisus](/wiki/Accipiter_nisus)*) - VR/V - Henderson Waves (2016, 2017), Pasir Panjang (2022), TBHP (2018), Tuas (2010) - Black kite (*[Milvus migrans](/wiki/Milvus_migrans)*) - U/WV - BBNP, CCNR, Changi, Jurong West, NTL, Punggol, P. Punggol, P. Ubin, Seletar Camp, SBWR, Southern Ridges, Tuas, *Marina South* - Brahminy kite (*[Haliastur indus](/wiki/Haliastur_indus)*) - C/RB - islandwide - White-bellied sea-eagle (*[Haliaeetus leucogaster](/wiki/Haliaeetus_leucogaster)*) - C/RB - islandwide near water - Grey-headed fish-eagle (*[Icthyophaga ichthyaetus](/wiki/Icthyophaga_ichthyaetus)*) - U/RB - CCNR, Changi, JLG, Little Guilin, LSR, NTL, WWC (Poyan), Seletar Camp, SBG, Springleaf, SBWR, Southern Ridges, Tampines - Common buzzard (*[Buteo buteo](/wiki/Buteo_buteo)*) - U/WV - Himalayan buzzard (*[Buteo refectus](/wiki/Buteo_refectus)*) - R/WV - Eastern buzzard (*[Buteo japonicus](/wiki/Buteo_japonicus)*) - U/WV - Long-legged buzzard (*[Buteo rufinus](/wiki/Buteo_rufinus)*) - VR/V ## Barn owls Order: [Strigiformes](/wiki/Strigiformes) Family: [Tytonidae](/wiki/Tytonidae) [Barn owls](/wiki/Eastern_barn_owl) are medium to large owls with large heads and characteristic heart-shaped faces. They have long strong legs with powerful talons. - Eastern barn owl (*[Tyto javanica](/wiki/Tyto_javanica)*) - U/RB - Changi, Halus, Istana, JLG, Kranji Dam, Marina Barrage, Sentosa, Tanjong Rhu, Toa Payoh, Tuas ## Typical owls Order: [Strigiformes](/wiki/Strigiformes) Family: [Strigidae](/wiki/Strigidae) The [typical owls](/wiki/Typical_owl) are small to large solitary nocturnal birds of prey. They have large forward-facing eyes and ears, a hawk-like beak and a conspicuous circle of feathers around each eye called a facial disk. - Collared scops-owl (*[Otus lettia](/wiki/Otus_lettia)*) - C/RB - Alexandra Hill, BBC, BBNP, BTNR, CCNR, HNP, P. Ubin, PRP, SBWR, Sentosa - Oriental scops-owl (*[Otus sunia](/wiki/Otus_sunia)*) - R/WVPM - Bidadari, BTNR, CCKP, CCNR, DFNP, Fort Canning, Kent Road, KRP, Mimosa Walk, MFP, P. Ubin, Seletar Country Club, SBWR - Barred eagle-owl (*[Ketupa sumatrana](/wiki/Ketupa_sumatrana)*) - R/RB - BBC, BTNR, CCNR, DFNP, P. Ubin - Buffy fish-owl (*[Ketupa ketupu](/wiki/Ketupa_ketupu)*) - U/RB - CCNR, JEG, NTL, WWC (Poyan), P. Ubin, PRP, SBG, SBWR, Sentosa - Spotted wood-owl (*[Strix seloputo](/wiki/Strix_seloputo)*) - U/RB - Bidadari, Chinatown, City, Dover Road, JLG, PRP, P. Ubin, WWC (Poyan), St. John Is., Sentosa, SBG, TBHP, Toa Payoh - Brown wood-owl (*[Strix leptogrammica](/wiki/Strix_leptogrammica)*) - VR/RB - CCNR, P. Ubin - Long-eared owl (*[Asio otus](/wiki/Asio_otus)*) - VR/V - Marina East (2021) - Short-eared owl (*[Asio flammeus](/wiki/Asio_flammeus)*) - VR/V - *Changi, Marina East* - Brown boobook (*[Ninox scutulata](/wiki/Ninox_scutulata)*) - C/RBWV - BTNR, CCNR, HNP, JLG, P. Ubin, Sentosa - Northern boobook (*[Ninox japonica](/wiki/Ninox_japonica)*) - R/PMWV - DFNP, PRP, SBTB, SBWR, Tuas ## Hornbills Order: [Bucerotiformes](/wiki/Bucerotiformes) Family: [Bucerotidae](/wiki/Bucerotidae) Hornbills are a group of birds whose bill is shaped like a cow's horn, but without a twist, sometimes with a casque on the upper mandible. Frequently, the bill is brightly coloured. - Rhinoceros hornbill (*[Buceros rhinoceros](/wiki/Buceros_rhinoceros)*) - VR/NBV - SBWR - Black hornbill (*[Anthracoceros malayanus](/wiki/Anthracoceros_malayanus)*) - VR/NBV - P. Ubin - Oriental pied hornbill (*[Anthracoceros albirostris](/wiki/Anthracoceros_albirostris)*) - C/IRB+RB - BAMKP, Bidadari, CCNR, Changi Village, P. Ubin, PRP, SBWR, *St. John Is.* ## Kingfishers Order: [Coraciiformes](/wiki/Coraciiformes) Family: [Alcedinidae](/wiki/Alcedinidae) Kingfishers are medium-sized birds with large heads, long, pointed bills, short legs and stubby tails. - Common kingfisher (*[Alcedo atthis](/wiki/Alcedo_atthis)*) - C/WV - water edges - Blue-eared kingfisher (*[Alcedo meninting](/wiki/Alcedo_meninting)*) - R/RB - BBNP, CCNR, HNP, NTL, WWC (Poyan), P. Ubin, SBTB, SBWR - Black-backed dwarf-kingfisher (*[Ceyx erithaca](/wiki/Ceyx_erithaca)*) - R/WV - Bidadari, BTNR, CCNR, SBWR, Tuas - Rufous-backed dwarf-kingfisher (*[Ceyx rufidorsa](/wiki/Ceyx_rufidorsa)*) - VR/NBV - KRP, Peninsula Plaza, P. Tekong, WWC (Poyan) - Stork-billed kingfisher (*[Pelargopsis capensis](/wiki/Pelargopsis_capensis)*) - U/RB - water edges - Ruddy kingfisher (*[Halcyon coromanda](/wiki/Halcyon_coromanda)*) - R/RBWV - RB: P. Tekong. WV: Bidadari, CBP, CCNR, City, DFNP, Fort Canning, JLG, P. Ubin, SBG, SBWR, Venus Drive - White-throated kingfisher (*[Halcyon smyrnensis](/wiki/Halcyon_smyrnensis)*) - C/RB - water edges - Black-capped kingfisher (*[Halcyon pileata](/wiki/Halcyon_pileata)*) - U/WV - Bidadari, CCNR, Changi, Halus, JLG, LSD, NTL, PRP, SBWR, S. Serangoon, Tuas - Collared kingfisher (*[Todiramphus chloris](/wiki/Todiramphus_chloris)*) - VC/RB - water edges ## Bee-eaters Order: [Coraciiformes](/wiki/Coraciiformes) Family: [Meropidae](/wiki/Meropidae) The bee-eaters are a group of [near passerine](/wiki/Near_passerine) birds in the family Meropidae. Most species are found in Africa but others occur in southern Europe, Madagascar, Australia and New Guinea. They are characterised by richly coloured plumage, slender bodies and usually elongated central tail feathers. All are colourful and have long downturned bills and pointed wings, which give them a swallow-like appearance when seen from afar. - Blue-throated bee-eater (*[Merops viridis](/wiki/Merops_viridis)*) - C/MB - islandwide (including offshore islands) - Blue-tailed bee-eater (*[Merops philippinus](/wiki/Merops_philippinus)*) - C/WV - islandwide (including offshore islands) ## Rollers Order: [Coraciiformes](/wiki/Coraciiformes) Family: [Coraciidae](/wiki/Coraciidae) Rollers resemble [crows](/wiki/Crow) in size and build, but are more closely related to the [kingfishers](/wiki/Kingfisher) and [bee-eaters](/wiki/Bee-eater). They share the colourful appearance of those groups with blues and browns predominating. The two inner front toes are connected, but the outer toe is not. - Dollarbird (*[Eurystomus orientalis](/wiki/Eurystomus_orientalis)*) - C/RB+WV - woodlands ## Asian barbets Order: [Piciformes](/wiki/Piciformes) Family: [Megalaimidae](/wiki/Megalaimidae) The Asian barbets are plump birds, with short necks and large heads. They get their name from the bristles which fringe their heavy bills. Most species are brightly coloured. - Coppersmith barbet (*[Psilopogon haemacephalus](/wiki/Psilopogon_haemacephalus)*) - C/RB - woodlands - Red-crowned barbet (*[Psilopogon rafflesii](/wiki/Psilopogon_rafflesii)*) - U/RB - BBNP, BTNR, CCNR, DFNP, WWC (Poyan) - Lineated barbet (*[Psilopogon lineatus](/wiki/Psilopogon_lineatus)*) - C/IRB - woodlands ## Woodpeckers Order: [Piciformes](/wiki/Piciformes) Family: [Picidae](/wiki/Picidae) Woodpeckers are small to medium-sized birds with chisel-like beaks, short legs, stiff tails and long tongues used for capturing insects. Some species have feet with two toes pointing forward and two backward, while several species have only three toes. Many woodpeckers have the habit of tapping noisily on tree trunks with their beaks. - Sunda pygmy woodpecker (*[Yungipicus moluccensis](/wiki/Yungipicus_moluccensis)*) - VC/RB - parks - Rufous woodpecker (*[Micropternus brachyurus](/wiki/Micropternus_brachyurus)*) - U/RB - woodlands - Buff-rumped woodpecker (*[Meiglyptes tristis](/wiki/Meiglyptes_tristis)*) - VR/NBV - Bidadari, CCNR, P. Ubin - Common flameback (*[Dinopium javanense](/wiki/Dinopium_javanense)*) - C/RB - woodlands - Greater flameback (*[Chrysocolaptes guttacristatus](/wiki/Chrysocolaptes_guttacristatus)*) - VR/NBV - P. Ubin (2024) - Crimson-winged woodpecker (*[Picus puniceus](/wiki/Picus_puniceus)*) - VR/NBV - BTNR - Laced woodpecker (*[Picus vittatus](/wiki/Picus_vittatus)*) - C/RB - woodlands - Banded woodpecker (*[Chrysophlegma miniaceum](/wiki/Chrysophlegma_miniaceum)*) - C/RB - forests - Great slaty woodpecker (*[Mulleripicus pulverulentus](/wiki/Mulleripicus_pulverulentus)*) - VR/NBV - BTNR, CCNR, SBG, Ulu Sembawang - White-bellied woodpecker (*[Dryocopus javensis](/wiki/Dryocopus_javensis)*) - **Ex/R** - *CCNR* ## Falcons and caracaras Order: [Falconiformes](/wiki/Falconiformes) Family: [Falconidae](/wiki/Falconidae) Falconidae is a family of diurnal birds of prey. They differ from hawks, eagles and kites in that they kill with their beaks instead of their talons. - Black-thighed falconet (*[Microhierax fringillarius](/wiki/Microhierax_fringillarius)*) - VR/NBV - Goldhill Avenue, Jalan Mashhor, Punggol, Yishun, *CCNR, Sembawang*. - Lesser kestrel (*[Falco naumanni](/wiki/Falco_naumanni)*) - VR/WV - Changi (2001, 2010), Simei (2001) - Eurasian kestrel (*[Falco tinnunculus](/wiki/Falco_tinnunculus)*) - R/WV - Bt. Batok West, Changi, CCKC, JLG, Kranji, KRP, P. Punggol, Tuas, *Jurong West* - Amur falcon (*[Falco amurensis](/wiki/Falco_amurensis)*) - VR/V - Changi (2007), Halus (2021), LSD (2016), Tanah Merah Coast Road (2017) - Eurasian hobby (*[Falco subbuteo](/wiki/Falco_subbuteo)*) - VR/V - Henderson Waves (2020) - Peregrine falcon (*[Falco peregrinus](/wiki/Falco_peregrinus)*) - U/WV, R/RB - islandwide including Raffles Place & Orchard Rd ## Cockatoos Order: [Psittaciformes](/wiki/Psittaciformes) Family: [Cacatuidae](/wiki/Cacatuidae) The cockatoos share many features with other parrots including the characteristic curved beak shape and a [zygodactyl](/wiki/Dactyly#In_birds) foot, with two forward toes and two backwards toes. They differ, however in a number of characteristics, including the often spectacular movable [headcrest](/wiki/Crest_(feathers)). - Tanimbar corella (*[Cacatua goffiniana](/wiki/Cacatua_goffiniana)*) - C/IRB - Bidadari, BBNP, Changi Village, LNR, Malcolm Park, MFP, PRP SBG, Sembawang Park, Sentosa, Springleaf - Yellow-crested cockatoo (*[Cacatua sulphurea](/wiki/Cacatua_sulphurea)*) - U/IRB - Bidadari, BAMKP, Changi Village, Clementi, Dover Road, LNR, Malcolm Park, St. John Is., Sentosa, SBG, Southern Ridges - Sulphur-crested cockatoo (*[Cacatua galerita](/wiki/Cacatua_galerita)*) - U/IR - Loyang, Sentosa, SBG, Southern Ridges ## Old world parrots Order: [Psittaciformes](/wiki/Psittaciformes) Family: [Psittaculidae](/wiki/Psittaculidae) Characteristic features of parrots include a strong curved bill, an upright stance, strong legs, and clawed [zygodactyl](/wiki/Zygodactyl) feet. Many parrots are vividly coloured, and some are multi-coloured. In size they range from 8 cm (3.1 in) to 1 m (3.3 ft) in length. Old World parrots are found from Africa east across south and southeast Asia and Oceania to Australia and New Zealand. - Blue-rumped parrot (*[Psittinus cyanurus](/wiki/Psittinus_cyanurus)*) - U/RB - Bt. Batok West, CCNR - Rose-ringed parakeet (*[Psittacula krameri](/wiki/Psittacula_krameri)*) - C/IRB - woodlands - Red-breasted parakeet (*[Psittacula alexandri](/wiki/Psittacula_alexandri)*) - C/IRB - woodlands - Long-tailed parakeet (*[Psittacula longicauda](/wiki/Psittacula_longicauda)*) - C/RB - woodlands - Coconut lorikeet (*[Trichoglossus haematodus](/wiki/Trichoglossus_haematodus)*) - U/IRB - BAMKP, BBC, Bidadari, BTNR, Buona Vista, CCNR, Goldhill Ave, JLG, SBG, Sentosa - Blue-crowned hanging-parrot (*[Loriculus galgulus](/wiki/Loriculus_galgulus)*) - C/RB - BAMKP, BBNP, BTNR, CCNR, KRP, Malcolm Park, MFP, SBG ## African and green broadbills Order: [Passeriformes](/wiki/Passeriformes) Family: [Calyptomenidae](/wiki/Calyptomenidae) The broadbills are small, brightly coloured birds which feed on fruit and also take insects in flycatcher fashion, snapping their broad bills. Their habitat is canopies of wet forests. - Green broadbill (*[Calyptomena viridis](/wiki/Calyptomena_viridis)*) - VR/NBV - East Coast Park (2014), P. Ubin (2014, 2021) ## Asian and Grauers broadbills Order: [Passeriformes](/wiki/Passeriformes) Family: [Eurylaimidae](/wiki/Eurylaimidae) The broadbills are small, brightly coloured birds which feed on fruit and also take insects in flycatcher fashion, snapping their broad bills. Their habitat is canopies of wet forests. - Black-and-red broadbill (*[Cymbirhynchus macrorhynchos](/wiki/Cymbirhynchus_macrorhynchos)*) - VR/NBV - P. Ubin, SBWR ## Pittas Order: [Passeriformes](/wiki/Passeriformes) Family: [Pittidae](/wiki/Pittidae) Pittas are medium-sized by passerine standards and are stocky, with fairly long, strong legs, short tails and stout bills. Many are brightly coloured. They spend the majority of their time on wet forest floors, eating snails, insects and similar invertebrates. - Blue-winged pitta (*[Pitta moluccensis](/wiki/Pitta_moluccensis)*) - U/WVPM+R/RB - WVPM: Bidadari, BBNP, BTNR, Bt. Batok West, CCNR, Hougang, Jurong Is., JLG, NTL, PRP, WWC (Poyan), Punggol Park, SBG, Sembawang Park, Tuas, WCP, *Kranji Nature Trail*. RB: P. Ubin (2016) - Fairy pitta (*[Pitta nympha](/wiki/Pitta_nympha)*) - VR/V - CCNR (2019), HNP (2021) - Western hooded pitta (*[Pitta sordida](/wiki/Pitta_sordida)*) - U/WVPM - Bidadari, BTNR, CCNR, DFNP, HNP, JLG, SBG, Tampines, WCP - Mangrove pitta (*[Pitta megarhyncha](/wiki/Pitta_megarhyncha)*) - R/RB - PRP, P. Ubin, P. Tekong, SBG, SBWR ## Thornbills and allies Order: [Passeriformes](/wiki/Passeriformes) Family: [Acanthizidae](/wiki/Acanthizidae) Thornbills are small passerine birds, similar in habits to the tits. - Golden-bellied gerygone (*[Gerygone sulphurea](/wiki/Gerygone_sulphurea)*) - C/RB - woodlands ## Cuckooshrikes Order: [Passeriformes](/wiki/Passeriformes) Family: [Campephagidae](/wiki/Campephagidae) The cuckooshrikes are small to medium-sized passerine birds. They are predominantly greyish with white and black, although some species are brightly coloured. - Scarlet minivet (*[Pericrocotus flammeus](/wiki/Pericrocotus_flammeus)*) - *Ex/R* + VR/R - BTNR, CCNR, P. Ubin - Ashy minivet (*[Pericrocotus divaricatus](/wiki/Pericrocotus_divaricatus)*) - C/WV - woodlands - Pied triller (*[Lalage nigra](/wiki/Lalage_nigra)*) - VC/RB - woodlands - Lesser cuckooshrike (*[Coracina fimbriata](/wiki/Coracina_fimbriata)*) - *Ex/R* - BTNR ## Vireos, shrike-babblers, and erpornis Order: [Passeriformes](/wiki/Passeriformes) Family: [Vireonidae](/wiki/Vireonidae) The family Vireonidae includes the vireos, shrike-babblers, and erpornis. - White-bellied erpornis (*[Erpornis zantholeuca](/wiki/Erpornis_zantholeuca)*) - VR/NBV - BTNR (2020) ## Whistlers and allies Order: [Passeriformes](/wiki/Passeriformes) Family: [Pachycephalidae](/wiki/Pachycephalidae) The family Pachycephalidae includes the whistlers, shrikethrushes, and some of the pitohuis. - Mangrove whistler (*[Pachycephala grisola](/wiki/Pachycephala_grisola)*) - R/RB - Changi, JEG, LNR, P. Hantu, P. Semakau, P. Tekong, P. Ubin, SBWR ## Old World orioles Order: [Passeriformes](/wiki/Passeriformes) Family: [Oriolidae](/wiki/Oriolidae) The Old World orioles are colourful passerine birds. They are not related to the New World orioles. - Black-naped oriole (*[Oriolus chinensis](/wiki/Oriolus_chinensis)*) - C/RB + R/WV - parks, woodlands, mangroves ## Vangas, helmetshrikes, and allies Order: [Passeriformes](/wiki/Passeriformes) Family: [Vangidae](/wiki/Vangidae) The family Vangidae is highly variable, though most members of it resemble true shrikes to some degree. - Large woodshrike (*[Tephrodornis gularis](/wiki/Tephrodornis_gularis)*) - VR/NBV - CCNR (2018), P. Ubin (2022) - Black-winged flycatcher-shrike (*[Hemipus hirundinaceus](/wiki/Hemipus_hirundinaceus)*) - VR/NBV - CCNR, DFNP, P. Ubin ## Ioras Order: [Passeriformes](/wiki/Passeriformes) Family: [Aegithinidae](/wiki/Aegithinidae) The ioras are [bulbul](/wiki/Bulbul)-like birds of open forest or thorn scrub, but whereas that group tends to be drab in colouration, ioras are sexually dimorphic, with the males being brightly plumaged in yellows and greens. - Common iora (*[Aegithina tiphia](/wiki/Aegithina_tiphia)*) - VC/RB - woodlands ## Fantails Order: [Passeriformes](/wiki/Passeriformes) Family: [Rhipiduridae](/wiki/Rhipiduridae) The fantails are small insectivorous birds which are specialist aerial feeders. - Malaysian pied-fantail (*[Rhipidura javanica](/wiki/Rhipidura_javanica)*) - C/RB - woodlands, mangroves ## Drongos Order: [Passeriformes](/wiki/Passeriformes) Family: [Dicruridae](/wiki/Dicruridae) The drongos are mostly black or dark grey in colour, sometimes with metallic tints. They have long forked tails, and some Asian species have elaborate tail decorations. They have short legs and sit very upright when perched, like a shrike. They flycatch or take prey from the ground. - Black drongo (*[Dicrurus macrocercus](/wiki/Dicrurus_macrocercus)*) - U/WVPM - Changi, Halus, NTL, P. Punggol, WWC (Poyan), Punggol, SBWR, Seletar, Tuas - Ashy drongo (*[Dicrurus leucophaeus](/wiki/Dicrurus_leucophaeus)*) - R/WV - Bidadari, BBNP, CCNR, CBP, MFP, NTU, P. Semakau, P. Ubin, SBG, TBHP, Ulu Pandan - Crow-billed drongo (*[Dicrurus annectens](/wiki/Dicrurus_annectens)*) - U/WVPM - Bidadari, CCNR, Changi, Fort Canning, Halus, LNR, MFP, NTL, P. Ubin, PRP, SBG, SBWR, Sentosa, St. John Is., Tuas - Hair-crested drongo (*[Dicrurus hottentottus](/wiki/Dicrurus_hottentottus)*) - VR/V - CBP (2019) - Greater racket-tailed drongo (*[Dicrurus paradiseus](/wiki/Dicrurus_paradiseus)*) - C/RB - forests ## Monarch flycatchers Order: [Passeriformes](/wiki/Passeriformes) Family: [Monarchidae](/wiki/Monarchidae) The monarch flycatchers are small to medium-sized insectivorous passerines which hunt by flycatching. - Black-naped monarch (*[Hypothymis azurea](/wiki/Hypothymis_azurea)*) - VR/R - CCNR, Clementi Woods, JLG, P. Tekong, P. Ubin, SBG - Black paradise-flycatcher (*[Terpsiphone atrocaudata](/wiki/Terpsiphone_atrocaudata)*) - R/PM - BAMKP, Bidadari, BTNR, CCNR, Coney Is. DFNP, JLG, Kranji Marsh, LNR, PRP, P. Hantu, SBWR, TBHP, TEG, Tuas - Amur paradise-flycatcher (*[Terpsiphone incei](/wiki/Terpsiphone_incei)*) - C/WVPM - forests, woodlands - Blyth's paradise-flycatcher (*[Terpsiphone affinis](/wiki/Terpsiphone_affinis)*) - C/WVPM - forests, woodlands - Indian paradise-flycatcher (*[Terpsiphone paradisi](/wiki/Terpsiphone_paradisi)*) - VR/V - JLG (2022), SBWR (2017-8) ## Shrikes Order: [Passeriformes](/wiki/Passeriformes) Family: [Laniidae](/wiki/Laniidae) Shrikes are passerine birds known for their habit of catching other birds and small animals and impaling the uneaten portions of their bodies on thorns. A typical shrike's beak is hooked, like a bird of prey. - Tiger shrike (*[Lanius tigrinus](/wiki/Lanius_tigrinus)*) - C/WVPM - woodlands - Brown shrike (*[Lanius cristatus](/wiki/Lanius_cristatus)*) - C/WVPM - grasslands, woodlands - Long-tailed shrike (*[Lanius schach](/wiki/Lanius_schach)*) - C/RB - grasslands ## Crows, jays, and magpies Order: [Passeriformes](/wiki/Passeriformes) Family: [Corvidae](/wiki/Corvidae) The family Corvidae includes [crows](/wiki/Crow), [ravens](/wiki/Raven), [jays](/wiki/Jay), [choughs](/wiki/Chough), [magpies](/wiki/Magpie), [treepies](/wiki/Treepie), [nutcrackers](/wiki/Nutcracker_(bird)) and [ground jays](/wiki/Ground_jay). Corvids are above average in size among the Passeriformes, and some of the larger species show high levels of intelligence. - Black magpie (*[Platysmurus leucopterus](/wiki/Platysmurus_leucopterus)*) - VR/NBV - HNP (2021) - House crow (*[Corvus splendens](/wiki/Corvus_splendens)*) - VC/IRB - islandwide - Large-billed crow (*[Corvus macrorhynchos](/wiki/Corvus_macrorhynchos)*) - U/RB - forested areas ## Tits, chickadees, and titmice Order: [Passeriformes](/wiki/Passeriformes) Family: [Paridae](/wiki/Paridae) The Paridae are mainly small stocky woodland species with short stout bills. Some have crests. They are adaptable birds, with a mixed diet including seeds and insects. - Japanese tit (*[Parus minor](/wiki/Parus_minor)*) - VR/V - Coney Is., JLG, LNR, PRP, Tuas ## Larks Order: [Passeriformes](/wiki/Passeriformes) Family: [Alaudidae](/wiki/Alaudidae) Larks are small terrestrial birds with often extravagant songs and display flights. Most larks are fairly dull in appearance. Their food is insects and seeds. - Eurasian skylark (*[Alauda arvensis](/wiki/Alauda_arvensis)*) - VR/V - Pandan Reservoir (2018) ## Cisticolas and allies Order: [Passeriformes](/wiki/Passeriformes) Family: [Cisticolidae](/wiki/Cisticolidae) The Cisticolidae are warblers found mainly in warmer southern regions of the Old World. They are generally very small birds of drab brown or grey appearance found in open country such as grassland or scrub. - Common tailorbird (*[Orthotomus sutorius](/wiki/Orthotomus_sutorius)*) - C/RB - scrubby areas - Dark-necked tailorbird (*[Orthotomus atrogularis](/wiki/Orthotomus_atrogularis)*) - C/RB - forests - Ashy tailorbird (*[Orthotomus ruficeps](/wiki/Orthotomus_ruficeps)*) - C/RB - mangroves - Rufous-tailed tailorbird (*[Orthotomus sericeus](/wiki/Orthotomus_sericeus)*) - U/RB - forests - Yellow-bellied prinia (*[Prinia flaviventris](/wiki/Prinia_flaviventris)*) - C/RB - grasslands - Zitting cisticola (*[Cisticola juncidis](/wiki/Cisticola_juncidis)*) - C/RB - grasslands ## Reed warblers and allies Order: [Passeriformes](/wiki/Passeriformes) Family: [Acrocephalidae](/wiki/Acrocephalidae) The members of this family are usually rather large for \"warblers\". Most are rather plain olivaceous brown above with much yellow to beige below. They are usually found in open woodland, reedbeds, or tall grass. The family occurs mostly in southern to western Eurasia and surroundings, but it also ranges far into the Pacific, with some species in Africa. - Booted warbler (*[Iduna caligata](/wiki/Iduna_caligata)*) - VR/V - Kranji Marsh (2017-8) - Black-browed reed warbler (*[Acrocephalus bistrigiceps](/wiki/Acrocephalus_bistrigiceps)*) - U/WV - Changi, Halus, JLG, NTL, Punggol, SFW, SBWR, Tuas, *Marina South* - Oriental reed warbler (*[Acrocephalus orientalis](/wiki/Acrocephalus_orientalis)*) - C/WV - marshes, woodlands near water ## Grassbirds and allies Order: [Passeriformes](/wiki/Passeriformes) Family: [Locustellidae](/wiki/Locustellidae) Locustellidae are a family of small insectivorous songbirds found mainly in Eurasia, Africa, and the Australian region. They are smallish birds with tails that are usually long and pointed, and tend to be drab brownish or buffy all over. - Pallas's grasshopper-warbler (*[Helopsaltes certhiola](/wiki/Helopsaltes_certhiola)*) - U/WVPM - BAMKP, Changi, Halus, JLG, Marina East, NTL, Pasir Ris Farmway, SFW, Tuas - Lanceolated warbler (*[Locustella lanceolata](/wiki/Locustella_lanceolata)*) - U/WVPM - Halus, KRP, Marina East, MFP, NTL, P. Punggol, Punggol, SFW, Tuas ## Swallows Order: [Passeriformes](/wiki/Passeriformes) Family: [Hirundinidae](/wiki/Hirundinidae) The family Hirundinidae is adapted to aerial feeding. They have a slender streamlined body, long pointed wings and a short bill with a wide gape. The feet are adapted to perching rather than walking, and the front toes are partially joined at the base. - Bank swallow (*[Riparia riparia](/wiki/Riparia_riparia)*) - U/WVPM - BTNR, CCNR, Changi, Halus, Kranji Marsh, LSD, Marina East, NTL, P. Punggol - Barn swallow (*[Hirundo rustica](/wiki/Hirundo_rustica)*) - VC/WVPM - islandwide (including offshore islands) - Pacific swallow (*[Hirundo tahitica](/wiki/Hirundo_tahitica)*) - C/RB - islandwide (including offshore islands) - Red-rumped swallow (*[Cecropis daurica](/wiki/Cecropis_daurica)*) - U/WVPM - Admiralty Park, BTNR, CCKC, CCNR, Changi, Halus, Henderson Waves, LSD, Marina East, WWC (Poyan), Punggol, TEG, Tuas - Siberian house-martin (*[Delichon lagopodum](/wiki/Delichon_lagopodum)*) - VR/V - Marina East, NTL - Asian house-martin (*[Delichon dasypus](/wiki/Delichon_dasypus)*) - R/PM - BTNR, CCNR, Changi, NTL, Southern Ridges ## Bulbuls Order: [Passeriformes](/wiki/Passeriformes) Family: [Pycnonotidae](/wiki/Pycnonotidae) Bulbuls are medium-sized songbirds. Some are colourful with yellow, red or orange vents, cheeks, throats or supercilia, but most are drab, with uniform olive-brown to black plumage. Some species have distinct crests. - Black-and-white bulbul (*[Microtarsus melanoleucos](/wiki/Microtarsus_melanoleucos)*) - VR/NBV - CCNR (2012), P. Ubin (2022) - Black-headed bulbul (*[Brachypodius melanocephalos](/wiki/Brachypodius_melanocephalos)*) - R/RB - BBC, BTNR, CCNR, DFNP, P. Ubin, PRP - Black-crested bulbul (*[Rubigula flaviventris](/wiki/Rubigula_flaviventris)*) - R/IR - BTNR - Straw-headed bulbul (*[Pycnonotus zeylanicus](/wiki/Pycnonotus_zeylanicus)*) - U/RB - BBC, BBNP, BTNR, Choa Chu Kang, CCNR, DFNP, HNP, NTL, WWC (Poyan), P. Ubin - Red-whiskered bulbul (*[Pycnonotus jocosus](/wiki/Pycnonotus_jocosus)*) - C/IRB - Changi, Halus, JLG, Marina East, WWC (Poyan), P. Punggol, P. Ubin, Saddle Club, SBG, Sentosa, S. Serangoon - Sooty-headed bulbul (*[Pycnonotus aurigaster](/wiki/Pycnonotus_aurigaster)*) - U/IRB - BAMKP, Halus, Marina East, NTL, P. Punggol, PRP, Punggol, S. Serangoon, TEG - Stripe-throated bulbul (*[Pycnonotus finlaysoni](/wiki/Pycnonotus_finlaysoni)*) - VR/NBV - P. Ubin (May 2023), USR (Apr 2022) - Yellow-vented bulbul (*[Pycnonotus goiavier](/wiki/Pycnonotus_goiavier)*) - VC/RB - parks - Olive-winged bulbul (*[Pycnonotus plumosus](/wiki/Pycnonotus_plumosus)*) - C/RB - BTNR, CCNR, DFNP, P. Hantu, P. Ubin, PRP, SBG, SBWR - Cream-vented bulbul (*[Pycnonotus simplex](/wiki/Pycnonotus_simplex)*) - U/RB - BTNR, CCNR - Red-eyed bulbul (*[Pycnonotus brunneus](/wiki/Pycnonotus_brunneus)*) - U/RB - BBNP, BTNR, CCNR, DFNP - Buff-vented bulbul (*[Iole olivacea](/wiki/Iole_olivacea)*) - VR/NBV - BTNR - Cinereous bulbul (*[Hemixos cinereus](/wiki/Hemixos_cinereus)*) - R/NBV - Bidadari, BBNP, BTNR, CCNR, JLG, KRP, Lazarus Is., NTL, P. Ubin, SBTB, SBWR, TBHP, Tuas, *Marina South* - Streaked bulbul (*[Ixos malaccensis](/wiki/Ixos_malaccensis)*) - R/NBV - BBNP, BTNR, Central Catchment, Changi Village, KRP, SBWR, Tuas ## Leaf warblers Order: [Passeriformes](/wiki/Passeriformes) Family: [Phylloscopidae](/wiki/Phylloscopidae) Leaf warblers are a family of small insectivorous birds found mostly in Eurasia and ranging into [Wallacea](/wiki/Wallacea) and Africa. The species are of various sizes, often green-plumaged above and yellow below, or more subdued with greyish-green to greyish-brown colours. - Yellow-browed warbler (*[Phylloscopus inornatus](/wiki/Phylloscopus_inornatus)*) - R/WVPM - BBNP, BTNR, Bidadari, CBP, CCNR, DFNP, NTL, P. Hantu, SBTB, SBWR, Sentosa, Southern Ridges - Dusky warbler (*[Phylloscopus fuscatus](/wiki/Phylloscopus_fuscatus)*) - VR/PM - CBP, Marina East, SBWR, Tuas, Yishun Pond - Eastern crowned warbler (*[Phylloscopus coronatus](/wiki/Phylloscopus_coronatus)*) - U/WV - Bidadari, BTNR, CCNR, Changi, DFNP, PRP, SBWR, York Road - Two-barred warbler (*[Phylloscopus plumbeitarsus](/wiki/Phylloscopus_plumbeitarsus)*) - VR/V - Kent Vale (2024) - Pale-legged leaf warbler (*[Phylloscopus tenellipes](/wiki/Phylloscopus_tenellipes)*) - VR/V - CCNR (2021-2) - Sakhalin leaf warbler (*[Phylloscopus borealoides](/wiki/Phylloscopus_borealoides)*) - R/WV - BTNR, CCNR, DFNP, P. Ubin, PRP, Rail Corridor, SBG, SBWR, WCP - Arctic warbler (*[Phylloscopus borealis](/wiki/Phylloscopus_borealis)*) - C/WVPM - parks, woodlands ## White-eyes, yuhinas, and allies Order: [Passeriformes](/wiki/Passeriformes) Family: [Zosteropidae](/wiki/Zosteropidae) The white-eyes are small and mostly undistinguished, their plumage above being generally some dull colour like greenish-olive, but some species have a white or bright yellow throat, breast or lower parts, and several have buff flanks. As their name suggests, many species have a white ring around each eye. - Swinhoe's white-eye (*[Zosterops simplex](/wiki/Zosterops_simplex)*) - C/rIRB - woodlands ## Tree-babblers, scimitar-babblers, and allies Order: [Passeriformes](/wiki/Passeriformes) Family: [Timaliidae](/wiki/Timaliidae) The babblers, or timaliids, are somewhat diverse in size and colouration, but are characterised by soft fluffy plumage. - Pin-striped tit-babbler (*[Mixornis gularis](/wiki/Mixornis_gularis)*) - C/RB - forested areas - Chestnut-winged babbler (*[Cyanoderma erythropterum](/wiki/Cyanoderma_erythropterum)*) - U/RB - CCNR ## Ground babblers and allies Order: [Passeriformes](/wiki/Passeriformes) Family: [Pellorneidae](/wiki/Pellorneidae) These small to medium-sized songbirds have soft fluffy plumage but are otherwise rather diverse. Members of the genus *Illadopsis* are found in forests, but some other genera are birds of scrublands. - Moustached babbler (*[Malacopteron magnirostre](/wiki/Malacopteron_magnirostre)*) - **Ex/RB** - *CCNR* - Short-tailed babbler (*[Pellorneum malaccense](/wiki/Pellorneum_malaccense)*) - C/RB - CCNR - White-chested babbler (*[Pellorneum rostratum](/wiki/Pellorneum_rostratum)*) - **Ex/RB**, VR/NBV - P. Ubin, Pasir Ris Farmway, *CCNR, P. Tekong, SBWR, Turut Track* - Abbott's babbler (*[Malacocincla abbotti](/wiki/Malacocincla_abbotti)*) - U/RB - BTNR, CCNR, JEG, NTL, P. Ubin, Sentosa, SBG, SBWR, WCPR ## Laughingthrushes and allies Order: [Passeriformes](/wiki/Passeriformes) Family: [Leiothrichidae](/wiki/Leiothrichidae) The members of this family are diverse in size and colouration, though those of genus *Turdoides* tend to be brown or greyish. The family is found in Africa, India, and southeast Asia. - White-crested laughingthrush (*[Garrulax leucolophus](/wiki/Garrulax_leucolophus)*) - C/IRB - forests - Chinese hwamei (*[Garrulax canorus](/wiki/Garrulax_canorus)*) - R/IRB - Bt. Gombak, Sentosa, *KRP, MFP* ## Nuthatches Order: [Passeriformes](/wiki/Passeriformes) Family: [Sittidae](/wiki/Sittidae) Nuthatches are small woodland birds. They have the unusual ability to climb down trees head first, unlike other birds which can only go upwards. Nuthatches have big heads, short tails and powerful bills and feet. - Velvet-fronted nuthatch (*[Sitta frontalis](/wiki/Sitta_frontalis)*) - VR/NBV - BTNR ## Starlings Order: [Passeriformes](/wiki/Passeriformes) Family: [Sturnidae](/wiki/Sturnidae) Starlings are small to medium-sized passerine birds. Their flight is strong and direct and they are very gregarious. Their preferred habitat is fairly open country. They eat insects and fruit. Plumage is typically dark with a metallic sheen. - Asian glossy starling (*[Aplonis panayensis](/wiki/Aplonis_panayensis)*) - VC/RB - islandwide - Common hill myna (*[Gracula religiosa](/wiki/Gracula_religiosa)*) - C/RB - BTNR, CCNR, SBG, - European starling (*[Sturnus vulgaris](/wiki/Sturnus_vulgaris)*) - VR/V - Marina East Dr (2021) - Rosy starling (*[Pastor roseus](/wiki/Pastor_roseus)*) - R/WV - Changi, GBTB, Halus, KRP, Marina East, St. John Island, Tuas, WCP - Daurian starling (*[Agropsar sturninus](/wiki/Agropsar_sturninus)*) - VC/WVPM - woodlands - Chestnut-cheeked starling (*[Agropsar philippensis](/wiki/Agropsar_philippensis)*) - VR/V - Bidadari, Dover, Loyang, Henderson Waves, JLG, Turf City, Ulu Pandan - Siamese pied starling (*[Gracupica floweri](/wiki/Gracupica_floweri)*) - R/I - NTL, S. Tengah, *Changi* - White-shouldered starling (*[Sturnia sinensis](/wiki/Sturnia_sinensis)*) - U/WVPM - Changi, Coney Is., Halus, JLG, KRP, Punggol, Seletar, Simei, TEG, Tuas - Brahminy starling (*[Sturnia pagodarum](/wiki/Sturnia_pagodarum)*) - VR/V - Bidadari, JLG, Marina East, P. Punggol - Red-billed starling (*[Spodiopsar sericeus](/wiki/Spodiopsar_sericeus)*) - VR/PM - Dempsey Hill (2022-3), SBTB (2013), SBWR (2023), TEG (2015), Turut Track (2021) - White-cheeked starling (*[Spodiopsar cineraceus](/wiki/Spodiopsar_cineraceus)*) - VR/V - Seletar End (2020) - Common myna (*[Acridotheres tristis](/wiki/Acridotheres_tristis)*) - C/RB - islandwide (including offshore islands) - Black-winged starling (*[Acridotheres melanopterus](/wiki/Acridotheres_melanopterus)*) - **Ex/IRB** - Javan myna (*[Acridotheres javanicus](/wiki/Acridotheres_javanicus)*) - VC/IRB - islandwide (including offshore islands) - Crested myna (*[Acridotheres cristatellus](/wiki/Acridotheres_cristatellus)*) - **Ex/IR** ## Thrushes and allies Order: [Passeriformes](/wiki/Passeriformes) Family: [Turdidae](/wiki/Turdidae) The [thrushes](/wiki/Thrush_(bird)) are a group of passerine birds that occur mainly in the Old World. They are plump, soft plumaged, small to medium-sized insectivores or sometimes omnivores, often feeding on the ground. Many have attractive songs. - Siberian thrush (*[Geokichla sibirica](/wiki/Geokichla_sibirica)*) - R/PM - Bidadari, BTNR, CCNR, DFNP, KRP, JLG, Sentosa, Tuas - Orange-headed thrush (*[Geokichla citrina](/wiki/Geokichla_citrina)*) - R/WV - Bidadari, BTNR, CCNR, Coney Is., DFNP, HNP, SBG, WCP - Chinese blackbird (*[Turdus mandarinus](/wiki/Turdus_mandarinus)*) - VR/V - JLG (2020) - Eyebrowed thrush (*[Turdus obscurus](/wiki/Turdus_obscurus)*) - U/WVPM - Bidadari, BTNR, CCNR, KRP, NTL, P. Ubin, SBG, TBHP, Tuas - Whites thrush (*[Zoothera aurea](/wiki/Zoothera_aurea)*) - VR/V - SBG (2023) ## Old World flycatchers Order: [Passeriformes](/wiki/Passeriformes) Family: [Muscicapidae](/wiki/Muscicapidae) Old World flycatchers are a large group of small passerine birds native to the Old World. They are mainly small arboreal insectivores. The appearance of these birds is highly varied, but they mostly have weak songs and harsh calls. - Grey-streaked flycatcher (*[Muscicapa griseisticta](/wiki/Muscicapa_griseisticta)*) - VR/PM - Sembawang (2021) - Dark-sided flycatcher (*[Muscicapa sibirica](/wiki/Muscicapa_sibirica)*) - U/WVPM - Bidadari, BBNP, BTNR, CCNR, DFNP, NTL, SBG, Southern Ridges - Ferruginous flycatcher (*[Muscicapa ferruginea](/wiki/Muscicapa_ferruginea)*) - U/WVPM - Bidadari, CCNR, JLG, SBG - Asian brown flycatcher (*[Muscicapa dauurica](/wiki/Muscicapa_dauurica)*) - C/WVPM - woodlands - Brown-breasted flycatcher (*[Muscicapa muttui](/wiki/Muscicapa_muttui)*) - VR/V - Dairy Farm (2022), TBHP (2024), Punggol Park (2025) - Brown-streaked flycatcher (*[Muscicapa williamsoni](/wiki/Muscicapa_williamsoni)*) - R/WVPM - BBNP, Bidadari, CCKP, CCNR, JLG, MFP, PRP, SBWR - Spotted flycatcher (*[Muscicapa striata](/wiki/Muscicapa_striata)*) - VR/V - KRP (2021) - Oriental magpie-robin (*[Copsychus saularis](/wiki/Copsychus_saularis)*) - U/RB - woodlands - White-rumped shama (*[Copsychus malabaricus](/wiki/Copsychus_malabaricus)*) - R/RB - BBNP, BTNR, CCNR, DFNP, MFP, WWC (Poyan), P. Tekong, P. Ubin, SBWR - Chinese blue flycatcher (*[Cyornis glaucicomans](/wiki/Cyornis_glaucicomans)*) - VR/PM - Bidadari (2013), CCNR (2020), JLG (2020), SBWR (1997) - Mangrove blue flycatcher (*[Cyornis rufigastra](/wiki/Cyornis_rufigastra)*) - VR/RB - Bidadari, P. Tekong, P. Ubin, PRP, SBWR - Brown-chested jungle-flycatcher (*[Cyornis brunneatus](/wiki/Cyornis_brunneatus)*) - R/WVPM - BBNP, Bidadari, BTNR, CCKP, CCNR, DFNP, Jurong Is., JLG, Punggol Park, SBG, SBWR, Sentosa, St John Is., TEG, Tuas - Blue-and-white flycatcher (*[Cyanoptila cyanomelana](/wiki/Cyanoptila_cyanomelana)*) - R/PM - Bidadari, BBNP, BTNR, CCNR, DFNP, Sentosa - Zappey's flycatcher (*[Cyanoptila cumatilis](/wiki/Cyanoptila_cumatilis)*) - R/PM - Bidadari, BBNP, BTNR, CCNR, DFNP, JLG, KRP, SBG, TEG, Tuas - Verditer flycatcher (*[Eumyias thalassinus](/wiki/Eumyias_thalassinus)*) - VR/NBV - DFNP (2017) - Siberian blue robin (*[Luscinia cyane](/wiki/Luscinia_cyane)*) - U/WVPM - Bidadari, BTNR, CCNR, P. Ubin, Punggol Park, SBG, SBWR - Yellow-rumped flycatcher (*[Ficedula zanthopygia](/wiki/Ficedula_zanthopygia)*) - C/PM - woodlands, forests - Green-backed flycatcher (*[Ficedula elisae](/wiki/Ficedula_elisae)*) - R/WVPM - BAMKP, Bidadari, CCNR, KRP, NTL, Tuas, *Khatib Bongsu*, *Marina South* - Narcissus flycatcher (*[Ficedula narcissina](/wiki/Ficedula_narcissina)*) - VR/PM - Bidadari (2015), DFNP (2017) - Mugimaki flycatcher (*[Ficedula mugimaki](/wiki/Ficedula_mugimaki)*) - U/PM - AMKTGW, Bidadari, BBNP, BTNR, CCNR, JLG, KRP, MFP, PRP, Sentosa, Tuas - Taiga flycatcher (*[Ficedula albicilla](/wiki/Ficedula_albicilla)*) - VR/V - Labrador Nature Reserve, SBG, WCP - Black redstart (*[Phoenicurus ochruros](/wiki/Phoenicurus_ochruros)*) - VR/V - Jambol Walk (2021) - Daurian redstart (*[Phoenicurus auroreus](/wiki/Phoenicurus_auroreus)*) - R/V - SBTB (2013), Cashew Road (2014), SBG (2019), NUS (2020) - White-throated rock-thrush (*[Monticola gularis](/wiki/Monticola_gularis)*) - VR/WVPM - BTNR - Blue rock-thrush (*[Monticola solitarius](/wiki/Monticola_solitarius)*) - R/PM - Ascentia Sky, BTNR, Labrador Villa Road, Marina Barrage, Pinnacle@Duxton, Sentosa, Tuas - Siberian stonechat (*[Saxicola maurus](/wiki/Saxicola_maurus)*) - R/WVPM - Changi, Halus, NTL, WWC (Poyan), P. Punggol, Tuas, Warren, *Marina South*, *Punggol* ## Flowerpeckers Order: [Passeriformes](/wiki/Passeriformes) Family: [Dicaeidae](/wiki/Dicaeidae) The flowerpeckers are very small, stout, often brightly coloured birds, with short tails, short thick curved bills and tubular tongues. - Scarlet-breasted flowerpecker (*[Prionochilus thoracicus](/wiki/Prionochilus_thoracicus)*) - VR/NBV - BTNR (2021), P. Ubin (2015, 2022) - Thick-billed flowerpecker (*[Dicaeum agile](/wiki/Dicaeum_agile)*) - VR/NBV - BBNP, BTNR, CCNR, DFNP - Yellow-vented flowerpecker (*[Dicaeum chrysorrheum](/wiki/Dicaeum_chrysorrheum)*) - VR/R - BBNP, BTNR, CCNR, DFNP - Orange-bellied flowerpecker (*[Dicaeum trigonostigma](/wiki/Dicaeum_trigonostigma)*) - C/RB - forests - Scarlet-backed flowerpecker (*[Dicaeum cruentatum](/wiki/Dicaeum_cruentatum)*) - C/RB - parks ## Sunbirds and spiderhunters Order: [Passeriformes](/wiki/Passeriformes) Family: [Nectariniidae](/wiki/Nectariniidae) The sunbirds and spiderhunters are very small passerine birds which feed largely on nectar, although they will also take insects, especially when feeding young. Flight is fast and direct on their short wings. Most species can take nectar by hovering like a hummingbird, but usually perch to feed. - Ruby-cheeked sunbird (*[Chalcoparia singalensis](/wiki/Chalcoparia_singalensis)*) - VR/R - CCNR, P. Ubin, SBWR - Plain sunbird (*[Anthreptes simplex](/wiki/Anthreptes_simplex)*) - VR/R - *CCNR, Senoko* - Brown-throated sunbird (*[Anthreptes malacensis](/wiki/Anthreptes_malacensis)*) - C/RB - parks - Van Hasselt's sunbird (*[Leptocoma brasiliana](/wiki/Leptocoma_brasiliana)*) - U/RB - BBNP, BTNR, CCNR, P. Ubin - Copper-throated sunbird (*[Leptocoma calcostetha](/wiki/Nectarinia_calcostetha)*) - U/RB - BBNP, P. Ubin, SBWR - Ornate sunbird (*[Cinnyris jugularis](/wiki/Cinnyris_jugularis)*) - VC/RB - parks - Crimson sunbird (*[Aethopyga siparaja](/wiki/Aethopyga_siparaja)*) - C/RB - parks, forests - Thick-billed spiderhunter (*[Arachnothera crassirostris](/wiki/Arachnothera_crassirostris)*) - *Ex/R* + VR/R - *BTNR, CCNR* - Little spiderhunter (*[Arachnothera longirostra](/wiki/Arachnothera_longirostra)*) - U/RB - BBNP, BTNR, CCNR, DFNP, Mandai, P. Ubin - Yellow-eared spiderhunter (*[Arachnothera chrysogenys](/wiki/Arachnothera_chrysogenys)*) - *Ex/R* + VR/V - *BTNR, CCNR, P. Tekong, P. Ubin* ## Fairy-bluebirds Order: [Passeriformes](/wiki/Passeriformes) Family: [Irenidae](/wiki/Irenidae) The fairy-bluebirds are [bulbul](/wiki/Bulbul)-like birds of open forest or thorn scrub. The males are dark-blue and the females a duller green. - Asian fairy-bluebird (*[Irena puella](/wiki/Irena_puella)*) - U/RB - BBNP, BBC, BTNR, CCNR, DFNP ## Leafbirds Order: [Passeriformes](/wiki/Passeriformes) Family: [Chloropseidae](/wiki/Chloropseidae) The leafbirds are small, [bulbul](/wiki/Bulbul)-like birds. The males are brightly plumaged, usually in greens and yellows. - Greater green leafbird (*[Chloropsis sonnerati](/wiki/Chloropsis_sonnerati)*) - U/RB - BTNR, CCNR, DFNP - Lesser green leafbird (*[Chloropsis cyanopogon](/wiki/Chloropsis_cyanopogon)*) - R/RB - BTNR, CCNR, DFNP, P. Ubin - Blue-winged leafbird (*[Chloropsis cochinchinensis](/wiki/Chloropsis_cochinchinensis)*) - U/RB - BTNR, CCNR, DFNP ## Weavers and allies Order: [Passeriformes](/wiki/Passeriformes) Family: [Ploceidae](/wiki/Ploceidae) The weavers are small passerine birds related to the [finches](/wiki/Finch). They are seed-eating birds with rounded conical bills. The males of many species are brightly coloured, usually in red or yellow and black, some species show variation in colour only in the breeding season. - Golden-backed weaver (*[Ploceus jacksoni](/wiki/Ploceus_jacksoni)*) - U/IRB - Coney Is., Halus, Marina East, NTL, P. Punggol - Streaked weaver (*[Ploceus manyar](/wiki/Ploceus_manyar)*) - R/IRB - Halus, SBWR, *Khatib Bongsu*, *Sg. Serangoon* - Baya weaver (*[Ploceus philippinus](/wiki/Ploceus_philippinus)*) - U/RB - grasslands ## Waxbills and allies Order: [Passeriformes](/wiki/Passeriformes) Family: [Estrildidae](/wiki/Estrildidae) The [estrildid finches](/wiki/Estrildid_finch) are small passerine birds of the Old World tropics and [Australasia](/wiki/Australasia). They are gregarious and often colonial seed eaters with short thick but pointed bills. They are all similar in structure and habits, but have wide variation in plumage colours and patterns. - Orange-cheeked waxbill (*[Estrilda melpoda](/wiki/Estrilda_melpoda)*) - U/IRB - BAMKP, Coney Is., JLG, NTL, P. Punggol, S. Pandan, SBTB - Common waxbill (*[Estrilda astrild](/wiki/Estrilda_astrild)*) - U/IRB - Coney Is., Halus, JLG, Marina East, NTL, P. Punggol, Punggol, SBWR - Red avadavat (*[Amandava amandava](/wiki/Amandava_amandava)*) - R/IRB - BAMKP, Changi, Halus, NTL, P. Punggol, Tuas, *Marina South, Punggol* - White-rumped munia (*[Lonchura striata](/wiki/Lonchura_striata)*) - R/RB - BTNR, CCNR, DFNP, Halus, NTL, P. Tekong, P. Ubin, SBG, SBWR, Sentosa, Tuas, Telok Blangah - Javan munia (*[Lonchura leucogastroides](/wiki/Lonchura_leucogastroides)*) - U/IRB - Bidadari, Halus, Hort Park, Marina East, WWC (Murai, Wrexham), SBTB, Serangoon Reservoir, SBWR, BAMKP - Scaly-breasted munia (*[Lonchura punctulata](/wiki/Lonchura_punctulata)*) - C/RB - grasslands - Chestnut munia (*[Lonchura atricapilla](/wiki/Lonchura_atricapilla)*) - U/RB - grasslands - White-capped munia (*[Lonchura ferruginosa](/wiki/Lonchura_ferruginosa)*) - **Ex/IR** - grasslands - White-headed munia (*[Lonchura maja](/wiki/Lonchura_maja)*) - U/RB - grasslands ## Indigobirds Order: [Passeriformes](/wiki/Passeriformes) Family: [Viduidae](/wiki/Viduidae) The indigobirds are finch-like species which usually have black or indigo predominating in their plumage. All are [brood parasites](/wiki/Brood_parasite) which lay their eggs in the nests of [estrildid finches](/wiki/Estrildid_finch). - Pin-tailed whydah (*[Vidua macroura](/wiki/Vidua_macroura)*) - R/I - Changi, Pasir Ris Farmway, P. Punggol, Tuas ## Old World sparrows Order: [Passeriformes](/wiki/Passeriformes) Family: [Passeridae](/wiki/Passeridae) Old World sparrows are small passerine birds. In general, sparrows tend to be small, plump, brown or grey birds with short tails and short powerful beaks. Sparrows are seed eaters, but they also consume small insects. - House sparrow (*[Passer domesticus](/wiki/Passer_domesticus)*) - VR/IRB - Jurong Is. - Eurasian tree sparrow (*[Passer montanus](/wiki/Passer_montanus)*) - VC/RB - urban areas ## Wagtails and pipits Order: [Passeriformes](/wiki/Passeriformes) Family: [Motacillidae](/wiki/Motacillidae) Motacillidae is a family of small passerine birds with medium to long tails. They include the wagtails, longclaws and pipits. They are slender, ground feeding insectivores of open country. - Forest wagtail (*[Dendronanthus indicus](/wiki/Dendronanthus_indicus)*) - U/WVPM - Admiralty Park, BBNP, Bidadari, BTNR, CCNR, Jurong Central Park, Mandai, P. Ubin, Sembawang, Simpang, Tengah, SBWR, Yishun - Grey wagtail (*[Motacilla cinerea](/wiki/Motacilla_cinerea)*) - U/WVPM - Admiralty Park, BAMKP, Bedok, Bt Batok, BTNR, Buona Vista, CCNR, Changi, JLG, Marsiling Park, NTL, Punggol, P. Punggol, P. Ubin, Sembawang, Simpang, Tengah, Yishun - Eastern yellow wagtail (*[Motacilla tschutschensis](/wiki/Motacilla_tschutschensis)*) - C/WV - Bidadari, Changi, Halus, LSD, NTL, P. Punggol, P. Ubin, Punggol, Sembawang, Yishun - Citrine wagtail (*[Motacilla citreola](/wiki/Motacilla_citreola)*) - VR/WV - NTL (2018, 2024), Punggol (1989), Tuas (1994) - White wagtail (*[Motacilla alba](/wiki/Motacilla_alba)*) - U/WV - BAMKP, BBC, Buona Vista, Changi, Jurong West, Marina East, NTL, P. Punggol, Punggol, SBG, TEG, Yishun - Paddyfield pipit (*[Anthus rufulus](/wiki/Anthus_rufulus)*) - C/RB - grass fields - Tree pipit (*[Anthus trivialis](/wiki/Anthus_trivialis)*) - VR/V - Ulu Pandan (2021) - Olive-backed pipit (*[Anthus hodgsoni](/wiki/Anthus_hodgsoni)*) - VR/PM - Bidadari (2010) - Red-throated pipit (*[Anthus cervinus](/wiki/Anthus_cervinus)*) - R/WV - Changi, NTL, P. Punggol, Pasir Ris Farmway, Seletar East, Sembawang, Tuas ## Finches, euphonias, and allies Order: [Passeriformes](/wiki/Passeriformes) Family: [Fringillidae](/wiki/Fringillidae) This is a large family of passerine birds. They are seed-eating birds with generally stout conical bills. - Yellow-fronted canary (*[Crithagra mozambica](/wiki/Crithagra_mozambica)*) - U/IR - BAMKP, Changi, JLG, Kusu Is., Lazarus Is., Marina East, Mt. Faber, St. John Is. ## Old World buntings Order: [Passeriformes](/wiki/Passeriformes) Family: [Emberizidae](/wiki/Emberizidae) They are seed-eating birds with stubby conical bills. There is only one genus in this family. - Yellow-breasted bunting (*[Emberiza aureola](/wiki/Emberiza_aureola)*) - VR/WV - *Marina East* - [Lists of birds by region](/wiki/Lists_of_birds_by_region) - [List of mammals of Singapore](/wiki/List_of_mammals_of_Singapore) - [List of reptiles of Singapore](/wiki/List_of_reptiles_of_Singapore) - [List of amphibians of Singapore](/wiki/List_of_amphibians_of_Singapore) - Lepage, Denis. \"Checklist of birds of Singapore\". *Bird Checklists of the World*. Avibase. Retrieved 27 January 2020. - Clements, James F. (2000). *Birds of the World: a Checklist*. Cornell University Press. p. 880. [ISBN](/wiki/ISBN_(identifier)) 0-934797-16-1.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:24:01.192089",
  "title": "List of birds of Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/List_of_birds_of_Singapore"
}