{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:23:21.580421"
  },
  "content": "This is a **list of Singaporean dishes**. [Singaporean cuisine](/wiki/Singaporean_cuisine) includes both unique dishes and others that, while sharing names with dishes in other cuisines, have evolved to mean something distinctly different in [Singapore](/wiki/Singapore). ## Noodle dishes NameImageTypeDescription[Beef Kway Teow](/wiki/Beef_Kway_Teow)Noodle dishFlat rice flour ([kway teow](/wiki/Kway_teow)) noodles stir-fried with beef, served dry or with soup[Beef noodle soup](/wiki/Beef_noodle_soup)Noodle dishChinese noodle soup made of stewed or red braised beef, beef broth and vegetables.[Mee pok](/wiki/Mee_pok)Noodle dishNoodle dish with Chinese noodle characterized by its flat and yellow appearance, varying in thickness and width.[Banmian](/wiki/Banmian)Noodle dishHand-made flat noodles served with vegetables, minced meat, sliced mushrooms, and an egg in an anchovy (ikan bilis)-based soup.[Char kway teow](/wiki/Char_kway_teow)Noodle dishFlat rice flour (kuay teow) noodles stir-fried in dark soy sauce with prawns, eggs, beansprouts, fish cake, cockles, green leafy vegetables, Chinese sausage, and lard.[Crab bee hoon](/wiki/Crab_bee_hoon)Noodle dish[Singapore](/wiki/Singapore) [rice vermicelli](/wiki/Rice_vermicelli) dish with whole [mud crab](/wiki/Crab) served in a claypot and spiced milky broth.[Fish soup bee hoon](/wiki/Fish_soup_bee_hoon)Noodle dish[Singaporean](/wiki/Singaporean) soup-based seafood dish, served hot usually with bee hoon. The dish is viewed as a healthy food in Singapore.[Hokkien mee](/wiki/Hokkien_mee)Noodle dishA stir-fried dish of egg noodles and rice noodles in a fragrant stock.[Kwetiau goreng](/wiki/Kwetiau_goreng)Noodle dishSoutheast Asia stir fried flat rice noodles.Shredded chicken noodlesNoodle dishNoodle dish topped with shredded chicken, fish dumpling and mushroom.[Vegetarian bee hoon](/wiki/Vegetarian_bee_hoon)Noodle dishSingaporean noodle dish which comprises [vegetarian spring rolls](/wiki/Vegetarian_spring_roll), [fried tofu](/wiki/Fried_tofu) skin, and [mock meats](/wiki/Mock_meat) made from [gluten](/wiki/Gluten).[Mee rebus](/wiki/Mi_rebus)Noodle dishThe dish is made of yellow egg noodles, which are also used in Hokkien mee, with a spicy slightly sweet curry-like gravy.[Mee siam](/wiki/Mee_siam)Noodle dishThe dish served with spicy, sweet and sour light gravy. The gravy is made from a rempah spice paste, tamarind and taucheo (salted soy bean).[Mee soto](/wiki/Soto_mie)Noodle dishSpicy noodle soup dish.[Katong Laksa](/wiki/Katong_Laksa)Noodle dishKatong Laksa is a variant of laksa lemak inspired by the Straits Chinese who live in the Katong area, Singapore. It has a spicy soup stock the colour of a flaming sunset, flavoured with coconut milk and dried shrimp, and topped with ingredients like cockles, prawns and fishcake. The noodles are normally cut up into smaller pieces so that the entire dish can be eaten with a spoon alone, without chopsticks or a fork.[Mee goreng](/wiki/Mie_goreng)Noodle dishThin yellow noodles fried in cooking oil with garlic, onion or shallots, fried prawn, chicken, pork, beef, or sliced bakso (meatballs), chili, Chinese cabbage, cabbages, tomatoes, egg, and other vegetables.[Satay bee hoon](/wiki/Satay_bee_hoon)Noodle dishSatay bee hoon sauce is a chilli-based peanut sauce very similar to the one served with satay. The [satay sauce](/wiki/Peanut_sauce) is spread on top of rice [vermicelli](/wiki/Vermicelli).[Curry chicken noodles](/wiki/Curry_chicken_noodles)Noodle dishUsually contains chicken meat and tau pok, and uses curry as soup base coupled with yellow noodles. ## Main dishes NameImageTypeDescription[Hainanese Curry Rice](/wiki/Hainanese_Curry_Rice)Rice dishHainanese Curry Rice is a dish consisting of plenty of steamed white rice smothered in a mess of curries and braised pork gravy.[Bak kut teh](/wiki/Bak_kut_teh)Meat dishMeat dish cooked in broth[Chai tow kway](/wiki/Chai_tow_kway)Rice dishCommon dish or dim sum of Teochew cuisine[Drunken prawn](/wiki/Drunken_prawn)SeafoodPrawns cooked with Chinese rice wine[Char siu](/wiki/Char_siu)Meat dishBarbecued pork in Cantonese cuisine.[Duck rice](/wiki/Duck_rice)Rice dish[Singaporean](/wiki/Singapore) Chinese meat dish, made of either braised or roasted duck and plain white rice. The braised duck is usually cooked with yam and shrimps; it can be served simply with plain white rice and a thick dark sauce; side dishes of braised hard-boiled eggs, preserved salted vegetables, or hard beancurd may be added.[Har Cheong Gai](/wiki/Har_Cheong_Gai)Meat dishChicken wings fried in a batter with fermented shrimp paste.Pig's brain soupMeat disha soup dish comprising pig brain with special herbs.[Pig fallopian tubes](/wiki/Pig_fallopian_tubes)Meat dishPig fallopian tubes (Sang Cheong) are used as an ingredient in some Singaporean dishes.[Pig's organ soup](/wiki/Pig%27s_organ_soup)Meat dishThe dish is a clear and refreshing soup; the reason why sometimes referred just as chheng-thng, served with other optional side dishes as well as rice.[Sliced fish soup](/wiki/Sliced_fish_soup)Seafood dishSliced fish soup is a dish in Singapore.[Teochew Porridge](/wiki/Teochew_Porridge)Rice dishRice porridge dish accompanied with various small plates of side dishes. [Singapore](/wiki/Singapore) Teowchew-style rice porridge is plain, simply cooked and not flavoured at all by the stock it's cooked in.[Turtle soup](/wiki/Turtle_soup)Turtle dishTurtle soup is soup or stews made from the flesh of the turtle. The dish exists in some cultures and is viewed as a luxury or delicacy.[Assam pedas](/wiki/Assam_pedas)Seafood dishSeafood and vegetables cooked in a sauce consisting of tamarind, coconut milk, chilli, and spices.[Ayam penyet](/wiki/Ayam_penyet)Meat dishFried chicken dish consisting of fried chicken that is smashed with the pestle against mortar to make it softer, served with sambal, slices of cucumbers, fried tofu and tempeh.Dendeng paruMeat dishDish of dried beef lung cooked in spices.[Gudeg Putih](/wiki/Gudeg)Vegetable dishWhite jackfruit curryGulai daun ubiVegetable dishSweet potato leaves stewed in coconut milkLemak siputShellfishShellfish cooked in a thick coconut milk-based gravy.[Nasi goreng](/wiki/Nasi_goreng)Rice dishStir-fried rice[Satay](/wiki/Satay)Meat dishDish of seasoned, skewered and grilled meat, served with a sauce.[Sayur lodeh](/wiki/Sayur_lodeh)Vegetable dishVegetables in coconut milk soup[Soto](/wiki/Soto_(food))SoupSoup mainly composed of broth, meat and vegetables.[Soto ayam](/wiki/Soto_ayam)SoupYellow spicy chicken soup.Soup kambingSoupTamil Muslims dish of spiced mutton soupSoup tulangSoupMutton or beef leg bones stewed in a spicy.[Fish head curry](/wiki/Fish_head_curry)CurryThe head of a red snapper is semi-stewed in a Kerala-style curry with assorted vegetables such as okra and eggplants.Kari lemak ayamCurryChicken curry with a coconut milk baseKari debalSoupEurasian Singaporean curry dish with Portuguese and Peranakan influences. Includes chicken, cabbage, sausage, and bacon pieces stewed in a curry sauce.Cereal prawnsSeafood dishPrawns that have been stir fried with sweetened cereal.[Black pepper crab](/wiki/Black_pepper_crab)Seafood dishIt is made with hard-shell crabs, and fried with black pepper.[Chilli crab](/wiki/Chilli_crab)Seafood dishSingaporean seafood dish. Mud crabs are commonly used and are stir-fried in a semi-thick, sweet and savoury tomato and chilli based sauce.[Oyster omelette](/wiki/Oyster_omelette)Seafood dishThe dish consists of an omelette with a filling primarily composed of small oysters.[Hainanese chicken rice](/wiki/Hainanese_chicken_rice)Rice dishIt is based on a well-known Hainanese dish called [Wenchang chicken](/wiki/Wenchang_chicken). ## Snacks and desserts NameImageTypeDescription[Kaya toast](/wiki/Kaya_toast)SnackKaya toast is prepared with kaya (coconut jam).[Roti john](/wiki/Roti_john)SandwichOmelette sandwich from Singapore.[Curry puff](/wiki/Curry_puff)SnackIt is a small pie consisting of specialised curry with chicken and potatoes in a deep-fried or baked).[Pisang goreng](/wiki/Pisang_goreng)SnackSnack food made of banana or plantain being deep fried in hot cooking oil.[Keropok](/wiki/Krupuk)SnackDeep fried crackers made from starch and other ingredients that serve as flavouring[Otak-otak](/wiki/Otak-otak)SnackGrilled fish cake made of ground fish meat mixed with tapioca starch and spices[Cheng tng](/wiki/Cheng_tng)DessertA light refreshing soup with longans, barley, agar strips, lotus seeds and a sweet syrup, served either hot or cold. It is analogous to the Cantonese Ching bo leung.[Ice kachang](/wiki/Ais_kacang)DessertMalaysian dessert which is also common in Singapore.[Cendol](/wiki/Chendol)DessertThe dessert's basic ingredients are coconut milk, jelly noodles made from rice flour with green food coloring (usually derived from the pandan leaf), shaved ice and palm sugar. ## Beverages NameImageTypeDescription[Bandung (drink)](/wiki/Bandung_(drink))DrinkIt consists of evaporated milk or condensed milk flavoured with rose cordial syrup, giving a pink colour.[Chin chow drink](/wiki/Chin_chow)DrinkGrass jelly made into a sweet beverage.[Kopi](/wiki/Kopi_(drink))DrinkNanyang coffee, mixed with condensed milk and sugar.[Milo](/wiki/Milo_(drink))DrinkChocolate and malt powder typically mixed with hot water and condensed milk. Served hot or cold (Milo Peng).[Milo dinosaur](/wiki/Milo_dinosaur)DrinkComposed of a cup of iced Milo (a chocolate malt beverage) with undissolved Milo powder added on top of it.[Teh tarik](/wiki/Teh_tarik)DrinkPulled tea, made from black tea blended with condensed milk.[Singapore Sling](/wiki/Singapore_Sling)BeveragesThe cocktail was invented in Singapore's Raffles Hotel, and is still served at the hotel's Long Bar. - Food portal - Singapore portal\n",
  "language": "en",
  "processed_at": "2026-01-12T11:23:21.579870",
  "title": "List of Singaporean dishes",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/List_of_Singaporean_dishes"
}