{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:23:11.320261"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"List of Singapore police officers killed in the line of duty\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(November 2022)* *(Learn how and when to remove this message)* 1°19′27.56″N 103°50′43.24″E﻿ / ﻿1.3243222°N 103.8453444°E﻿ / 1.3243222; 103.8453444 This is a **list of police officers from the [Singapore Police Force](/wiki/Singapore_Police_Force) who were killed in the line of duty**, based on official records from the year 1900 to date. Line of duty deaths refers to any police officer who has died while carrying out duty which he is obligated and/or authorised to carry out. This would include officers who respond to incidents while off-duty as obligated by the Police Force Act, as well as those commuting to and from their place of duty or training. The Singapore establishment generally avoids personalising or glorifying acts of personal sacrifice in contemporary Singaporean society, and this applies to the police force as well. There had been no public memorial or monument dedicated to police officer deaths until the opening of the Police Heritage Centre in the Police Headquarters at New Phoenix Park on 15 August 2002, where a Commemorative Gallery features a wall inscribed with the names of all fallen officers. Although open to the public, access to the centre is restricted via an appointment-only policy. There are otherwise no readily accessible published lists of all fallen officers' names whether in print or electronically. Fallen officers are, however, honoured and commemorated through ceremonies or functions, such as a one-minute silence observed during the annual Police Day Parade. Police funerals featuring a flag draped casket, a [three-volley salute](/wiki/3-volley_salute), and a procession, amongst other elements, may be organised depending on the circumstance of death. Most funerals in recent years are much simpler affairs, partly as many of these deaths are attributed to accidents, but many of these ceremonies still receive local media coverage. Other ways of commemoration may include posthumous promotions and the awarding of [state medals](/wiki/Singaporean_orders_and_decorations); there has been seven posthumous promotions and two posthumous [Police Medal of Valour](/wiki/Pingat_Keberanian_Polis) awardees since the 1990s. ## Trends ### Causes of death Cause of death1900s1910s1920s1930s1940s1950s1960s1970s1980s1990s2000s2010s to dateTotal to dateMurder/[Culpable homicide](/wiki/Culpable_homicide) (with firearms)6633422Murder/Culpable homicide (with sharp object)1124Murder/Culpable homicide (with blunt object)33Murder/Culpable homicide (other/unspecified)191121Accidental death (traffic accident)1484812239Accidental death ([drowning](/wiki/Drowning))1326Accidental death (weapon mishandling)213Accidental death (Other)11Natural causes1214Cause of death not recorded22833624**Total****2****2****8****3****31****21****4****16****10****11****15****2****125** ### Victims' Profile The average age of slain police officers is 29.3 years of age, excluding 62 officers whose age were not reported. The highest number of casualties were in the 21–25 age band, making up 31.7% amongst officers whose age were reported, followed closely by those in the 26–30 age band, who make up 28.3%. While relative inexperience may be a factor, the generally young profile of police officers in Singapore and their greater probability of facing operational danger as frontline officers may also contribute to their premature deaths. Age1900s1910s1920s1930s1940s1950s1960s1970s1980s1990s2000s to dateTotal to date18-200000100(/wiki/Murder_of_Lee_Kim_Lai)011421–25000011212571926–30000024162031831–3500000002131736–4000001001200441–4500000002104746–50000000000(/wiki/Murder_of_Boo_Tiang_Huat)0151–55000001000001Not reported228326150321062 The ethnic profile of police officers has been traditionally disproportionate compared to the national ethnic profile, with a significantly higher proportion of ethnic Malays especially in the earlier decades. However, the number of casualties involving ethnic Chinese police officers are statistically higher overall due in part to the high mortality rates involving the ethnic Chinese community during the [Japanese occupation of Singapore](/wiki/Japanese_occupation_of_Singapore) in the 1940s, and they make up 60.7% of total deaths. Ethnicity1900s1910s1920s1930s1940s1950s1960s1970s1980s1990s2000s to dateTotal to date[Chinese](/wiki/Chinese_in_Singapore)2251251011038774[Malay](/wiki/Malays_in_Singapore)0011590542936[Indian](/wiki/Indians_in_Singapore)002001113109[Eurasians/Other](/wiki/Eurasians_in_Singapore)000111100004Rank1900s1910s1920s1930s1940s1950s1960s1970s1980s1990s2000s to dateTotal to dateVigilante ConstableNANANANANANA000101[Police Constable](/wiki/Constable)10031280970NA30[Police Constable (VSC)](/wiki/Constable)1NANANANA01000001Detective Police Constable12151236220NANA42[Trainee Special Constable](/wiki/Special_Constable)000000000011[Special Constable](/wiki/Special_Constable)000020011004[Lance Corporal](/wiki/Lance_Corporal)1010000000102[Corporal](/wiki/Corporal)000010021419[Detective Corporal](/wiki/Corporal)1000002000NANA2[Special Constable Corporal](/wiki/Special_Constable)NANANANANANA000134[Detective Lance Sergeant](/wiki/Lance_Sergeant)1000020000NANA2[Sergeant](/wiki/Sergeant)000000021137[Staff Sergeant](/wiki/Staff_Sergeant)000001000135[Senior Staff Sergeant](/wiki/Senior_Staff_Sergeant)000000000202[Senior Staff Sergeant (VSC)](/wiki/Senior_Staff_Sergeant)NANANANA00000011[Station Inspector](/wiki/Station_Inspector)000000000033[Detective Sub-Inspector](/wiki/Sub-Inspector)10000110000NA2[National Service Probationary Inspector](/wiki/Inspector)NANANANANANA000011[Inspector](/wiki/Inspector)000101100003[Assistant Commandant](/wiki/Commandant)10000010000NA1Service1900s1910s1920s1930s1940s1950s1960s1970s1980s1990s2000s to dateTotal to dateRegular2283312203159910112[Police National Service](/wiki/National_Service_in_Singapore)3NANANANANANA011259[Volunteer Special Constabulary](/wiki/Volunteer_Special_Constabulary)4NANANANA01000012Notes - **^1** These ranks no longer exist in the present rank structure of the Singapore Police Force (with the exception of some ranks in the [Gurkha Contingent](/wiki/Gurkha_Contingent)). - **^2** Includes two Special Constables. - **^3** Part-time [Police National Service](/wiki/National_Service_in_Singapore) was introduced in 1967, and full-time NS in 1975. - **^4** The [Volunteer Special Constabulary](/wiki/Volunteer_Special_Constabulary) began in 1946. ## Incidents by chronology The following cases are listed by the date of death, although the incident attributing to death may have occurred earlier. The indicated ranks are as at time of death, and do not include posthumous promotions. Ranks/service numbers are colour-coded based on the cause of death as per the following general classifications. Uncoded entries refer to cases whereby incident details are unknown or unclear: **Key** — denotes information is not available. denotes the officer was killed (Murder or Culpable homicide) using firearms. denotes the officer was killed (Murder or Culpable homicide) via other means (or where the exact weapon used, if any, was not specified). denotes the officer's death was accidental, including those involving a rash or negligent act. denotes the officer's death was attributed to natural causes/[act of God](/wiki/Act_of_God) ## 1940s DateRank/noNameAgeDivision/unitCircumstance1942D/SUB-InspTan Boo Leng——Executed by the Japanese during the [Japanese occupation of Singapore](/wiki/Japanese_occupation_of_Singapore)DPC 001Quek Ah Kee——DPC 003Kho Kee Thiam——DPC 019Lim Ah Kow——DPC 036Yip Keng Sam——DPC 066Tan Ah Kee——DPC 086Tee Boon Hye——DPC 099Tan Chan——DPC 102Lim Keng Seng——DPC 104Sim Kim Hock——DPC 112Ng Kim Hock——DPC 117Eng Yong Khoon——D/L/Sgt 135Chang Hak Joe——DPC 136Chan Wai Wah——DPC 143Tay Teng Liong——DPC 169Low Peng Hai——DPC 179Tan Sam Tuck——DPC 195Lim Kian Siong——DPC 4447Tan Kim Hock——18 October 1946DPC 41Lee Koh Beng39—He was on armed mobile patrol when their vehicle chanced upon several men who fled on sight along [Middle Road](/wiki/Middle_Road,_Singapore) near Queens Street. While jumping off the vehicle, DPC 41 sustained a fatal gunshot wound near his heart and died at the scene. The gunmen escaped, but were apprehended later.2 February 1947DPC 426Mohamed Bin Che Dol——Shot by several gangsters on 1 February 1947 along Cheong Hong Lim Street in [Chinatown](/wiki/Chinatown,_Singapore), and died subsequently in hospital a day later.4 June 1947Cpl 2054Mohamed Gul—[Marine](/wiki/Police_Coast_Guard)Cpl 2054, PC 3776 and PC 1315 were on patrol in Police Boat No. 16 when they stopped a boat with ten male Chinese on board in the waters off [Beach Road](/wiki/Beach_Road,_Singapore) in [Kallang Basin](/wiki/Kallang_Basin). Cpl 2054 boarded the boat alone to check their clearance papers. As it was not in order, he asked the crew to return to port. Gunshots were heard before he could finish, and he was not heard of since, believed to be killed and his body dumped overboard. Shots were also fired at the police boat, hitting PC 3776 six times. He fell overboard, but was pulled back into the police boat as it sped off to summon for help. PC 3776 died in hospital a day later, while PC 1315 escaped unhurt.5 June 1947PC 3776Attan Bin Haji Siraj3028 October 1947SC 5221Teo Kim Swan23—SC 5221 was on duty at a police duty hut along Henderson Road outside the [Singapore Glass Factory](/wiki/Singapore_Glass_Factory) with fellow Special Constable Abu Bakar. About to go off-duty, SC Abu Bakar reached for his rifle which was leaning against a table, but the rifle fell to the ground and a round was discharged, hitting SC5221 and killing him.14 November 1947DPC 809Cheong Ngit Cheong28—DPC 809 was having coffee at a [coffeeshop](/wiki/Kopitiam) along [Balestier Road](/wiki/Balestier_Road) with a former detective, Wong Khim Seang, when three men, two of whom were armed, walked into the eatery and fired at the two men at point blank range. DPC 809 was shot in the back of his head and died two hours later in hospital, while Wong was hit in the leg and survived.10 March 1948SC 5194C. S. Dascen20—SC 5194 was on guard duty at the [HSBC](/wiki/HSBC) Bank Building on 9 March 1948 when he was shot accidentally in the neck by SC 5220 who was checking clear his service revolver prior to handing over the weapon to him. ## 1950s DateRank/noNameAgeDivision/unitCircumstance5 April 1950S/Sgt 4098Mahadhoj Limbu——Killed in an operation in [Johor Bahru](/wiki/Johor_Bahru), [Malaysia](/wiki/Malaysia), as a result of the [Malayan Emergency](/wiki/Malayan_Emergency).19 December 1950InspAlfred Ratnashingam27—Killed by rioters while escorting a Eurasian woman in distress to her home in [Changi](/wiki/Changi). He was dragged out of his car along Changi Road, beaten, and dumped in the drain on 11 December 1950 during the [Maria Hertogh riots](/wiki/Maria_Hertogh_riots). His revolver was stolen, and he died eight days later in hospital.1951-01-02DPC 280Ang Beng Siong27[Orchard Road](/wiki/Tanglin_Police_Division)DPC 280 was stepping out of his home and starting his motorbike at the junction of Havelock Road and Beng Hoon Road when two gunmen fired at him from point-blank range, hitting him in both sides of his chest and in his face. The killers escaped in bicycles, while he staggered to a medicine shop nearby and collapsed on the floor. He died on the way to hospital.1951-01-19D/Cpl 3066Yap Beng Teck—[CID](/wiki/Criminal_Investigation_Department_(Singapore))D/Cpl 3066 left the home of his second wife at 67 [Fraser Street](/wiki/Fraser_Street) and was getting into his car when two Chinese men shot him in the head, stole his revolver, and escaped in bicycles. He died in hospital an hour later.1951-02-05Asst ComdntAbdul Rahman Bin Abdul Aziz55[SC](/wiki/Singapore_Volunteer_Corps)Assistant Commandant Abdul Rahman was leaving for work from his home at Lorong 6 Geylang when a lone Chinese gunman shot him at pointblank range twice in the back and neck. His police driver tried but failed to find the escaped assailant.1951-11-09PC 630Mohamed Din Bin Merah22Kandang KerbauPC 630 was travelling to work in a police van when the van crashed into a lamppost at the junction of [Newton Road](/wiki/Newton_Road) and [Thomson Road](/wiki/Thomson_Road,_Singapore). All four officers were injured, two seriously, including PC 630 who died later.1952-04-02DPC 108Tan Toa Tee28[Orchard Road](/wiki/Tanglin_Police_Division)DPC 108 was last seen cycling from his friend's home at Henderson Road when gunshots were heard. His body was found by his friend with three gunshot wounds in a lallang field, and his revolver was missing.1955-05-12PC(V) 1039Teo Bock Lan Andrew——Severely beaten by the rioting mob during the [Hock Lee bus riots](/wiki/Hock_Lee_bus_riots) and died in hospital later. He was the first [Volunteer Special Constabulary](/wiki/Volunteer_Special_Constabulary) officer to die in the line of duty.1955-05-12D/CplYuen Yau Phang——Burned to death after rioters set his car alight during the [Hock Lee bus riots](/wiki/Hock_Lee_bus_riots). ## 1960s DateRank/noNameAgeDivision/unitCircumstance1964-04-11DPC 2802Reddy Melvyn Douglas24[Queenstown](/wiki/Clementi_Police_Division)DPC 2802 was off-duty when he came across two thieves who just robbed the cashier of the Singapore Trading Company at [Collyer Quay](/wiki/Collyer_Quay) of $60,000 and were trying to make their escape in a scooter along Prince Street. While arresting one of them, he was shot twice by the other thief. The thieves fled, while DPC 2802 collapsed and died in hospital later. One of them, Lim Toh Sin, was initially sentenced to death for murder before his sentence was reduced to ten years for armed robbery, while the other, Tay Ngee Siang, served a five-year sentence for armed robbery.1965-08-05InspAllan Lim Kim Sai28[CID](/wiki/Criminal_Investigation_Department_(Singapore))Part of a police party attempting an ambush on the hideout of wanted man Morgan Teo and his accomplices along Siang Lim Park after a tip-off. The house where Teo was holed up was surrounded by police, who asked the gang to surrender. Teo's accomplices surrendered after no response was made and tear gas lobbed into the house. Teo escaped by climbing into a neighbouring house, and fired a single gunshot, which hit Insp Lim in the head. Two hand grenades lobbed at the police also injured another two policemen. Insp Lim died shortly after in hospital.1968-02-05DPC 6603[Munusamy Naidu s/o Doresamy](/wiki/Munusamy_Naidu_s/o_Doresamy)23[Joo Chiat](/wiki/Bedok_Police_Division)DPC 6603 arrested a suspected [secret society](/wiki/Secret_societies_in_Singapore) gang member along Anamalai Avenue, and brought him to a telephone booth along [Bukit Timah Road](/wiki/Bukit_Timah_Road) where he tried to call for reinforcements. Three of the gang member's friends were following behind, and attacked the policeman, who managed to fire three rounds, injuring one of them. The policeman sustained seven stab wounds and collapsed on the road, while the gang members escaped with his revolver. He died on the way to the hospital. Two of the gang member's friends, Lim Heng Soon (the one injured by Munusamy) and Low Ngah Ngah, were subsequently arrested and [sentenced to death](/wiki/Capital_punishment_in_Singapore) for his murder.1968-06-23CplKoh Chong Thye27unknownOn 23 June 1968, Corporal Koh Chong Thye and two other officers spotted wanted gunman [Lim Ban Lim](/wiki/Lim_Ban_Lim) at somewhere in Rangoon Road, and trailed him. Lim, who was involved in a few previous armed robberies and two non-fatal shootings of police officers, later noticed the three policemen and confronted them at gunpoint, demanding the corporal to hand over his revolver. When Koh refused to, during a struggle, Lim shot Koh in the chest. Despite being injured, Koh fired back but missed Lim. Lim then fired back point blank, aiming the shot at Koh's forehead, leading to Koh dying from the headshot. Lim later fled after a shoot-out with Koh's two other colleagues. The coroner's report later concluded and classified Koh's death as murder. Koh was married with two children at the time of his death. Lim was then placed on the wanted list for Corporal Koh's murder and a reward of $17,000 was placed on his head. Subsequently, after spending four more years on the run, on 24 November 1972, 32-year-old Lim, together with his most trusted right-hand man Chua Ah Kow, was spotted by police in a [pasar malam](/wiki/Pasar_malam) from [Queenstown](/wiki/Queenstown,_Singapore), and after engaging in a shoot-out with the police, Lim was shot to death by the police. One police detective named Tan Lee Keng was wounded and another unnamed policeman was killed by Lim during the shootout. Chua managed to flee from the police but three weeks later, he was once again spotted and before the police could capture him, Chua killed himself with his gun after engaging in a brief shoot-out with the officers. ## 1970s DateRank/noNameAgeDivision/unitCircumstance1973-04-17DPC 3393Ng Poh Hock27[CID](/wiki/Criminal_Investigation_Department_(Singapore))A police operation to ambush a group of criminals resulted in a shootout along Geylang Lorong 27A when officers approached one of the suspects, Ng Ah Bai, in his vehicle. DPC 3393 was shot dead just as he reached one side of the vehicle, while the suspect was shot by another detective from the other side. The suspect died later in hospital.1973-07-12DPC 0110Ong Poh Heng28[Orchard Road](/wiki/Tanglin_Police_Division)He was off-duty when stopped to intervene in an argument between a bus driver and a gunman along Still Road. As soon as he identified himself as a police officer, the gunman suddenly fired two shots into the officer's chest, one of which pierced his heart, killing him instantly. The gunman then removed the cop's revolver and drove off. A cash award of [S$](/wiki/S$)10,000 was put up for information on the murderer.1973-12-02PC 8358Mohammed Sanusi Bin Siraj26[Paya Lebar](/wiki/Ang_Mo_Kio_Police_Division)PC 8358 was refuelling his police van at the Paya Lebar Police Station when he spotted a police mini-bus rolling down a slope. He tried to stop the vehicle, but was run over instead. He died four hours later in hospital.1974-03-15PC 8358Abu Habir Bin Kassim42[Marine](/wiki/Police_Coast_Guard)The police boat he was in was returning to base in [Kallang Basin](/wiki/Kallang_Basin) when it capsized and sank after a collision with a Russian trawler *Pechorsk* at the mouth of [Sungei Jurong](/wiki/Sungei_Jurong) near the [Jurong Pier](/wiki/Jurong_Pier). Three of the crew were rescued, while PC 8358 was swept away. His body was later found.1975-06-23PC 8835Low Tong Seng37[Traffic](/wiki/Highway_patrol)PC 8835 was killed when he collided with a cyclist at the junction of Jalan Toa Payoh and Kim Keat Road. The cyclist died instantly, while PC 8835 died in hospital a few hours later.1976-11-27PC 3031Chan Ban Thian31—PC 3031 was pursuing after a speeding motorcyclist when his police car smashed into an oncoming lorry along [Upper Thomson Road](/wiki/Upper_Thomson_Road) near [Ang Mo Kio](/wiki/Ang_Mo_Kio) on 25 November 1976. The lorry driver died on the spot, while the police officer died in hospital two days later.1977-02-26Cpl 3881O. Patpanavan30[Jurong Town](/wiki/Jurong_Police_Division)Upon return from duty, he was later found lying outside the police station armoury with a gunshot wound to his chest. He died on the way to hospital. The shot was later found to be accidentally discharged.1978-01-01Cpl 8210Abu Kassim Bin Katon30[Marine](/wiki/Police_Coast_Guard)Cpl 8210, PC 0944, and two other officers from the Jurong Marine Base were off duty when their vehicle was forced into the back of a stationary [SBS](/wiki/SBS_Transit) bus along [Jalan Ahmad Ibrahim](/wiki/Jalan_Ahmad_Ibrahim) by another speeding vehicle. Their civilian vehicle caught fire upon impact, and the front-seat passenger, Cpl 8210, was killed on the spot. PC 0944 died three hours later in hospital, while the other two recovered from their injuries.PC 0944Loh Teng Hock301978-04-25SC[Lee Kim Lai](/wiki/Lee_Kim_Lai)18—Stabbed to death by three men who were attempting to steal his weapon. He was abducted while performing sentry duty at the [Police Reserve Unit 1](/wiki/Police_Tactical_Unit_(Singapore)) base at [Mount Vernon](/wiki/Mount_Vernon,_Singapore) and dragged into a hijacked taxi, whose driver has also been murdered earlier. Lee's body was found in the abandoned taxi later with 15 cut and stab wounds, including a fatal double stab wound in the neck. The three killers were eventually convicted of murder and sentenced to death by hanging.1978-05-17Sgt 7571Toh Say Tin31[PRU 1](/wiki/Police_Tactical_Unit_(Singapore))Sgt 7571 was on special duties with 11 other officers when he slipped and fell overboard while attempting to board a boat from marine police speedboat PA 6 off [Marine Parade](/wiki/Marine_Parade). A non-swimmer, he was not wearing a life vest, and was swept away by the currents. His body was found on 19 May 1978 about eight kilometres from the incident. Wearing of life vests were made mandatory for all persons aboard police vessels henceforth.1979-04-19Sgt 1288Mohamed Saad Bin Omar43[Beach Road](/wiki/Central_Police_Division)Sgt 1288 and PC Collin Han were responding to a call with regards to a female drug suspect. While escorting her back to the police station along Lorong 10 Geylang and [Geylang Road](/wiki/Geylang_Road), she suddenly snatched Sgt 1288's service revolver, and fired a shot into his stomach. PC Han, who was driving the vehicle, managed to remove the revolver from the woman, who appeared dazed. Sgt 1288 died soon after.1979-08-04PC 2446Soon Say Boon22[Traffic](/wiki/Highway_patrol)PC 2446 was pursuing a vehicle along Kampong Bahru Road when he collided into the back of a stationary lorry. He died from severe injuries. ## 1980s DateRank/noNameAgeDivision/unitCircumstance1983-06-29PC 8726Abdul Rahman Bin Abdul Kadir35[Traffic](/wiki/Highway_patrol)PC 8726 was involved in a convoy transporting three [RSAF](/wiki/Republic_of_Singapore_Air_Force) aircraft by road from [Tengah Air Base](/wiki/Tengah_Air_Base) to West Coast Road when he collided into one of the aircraft at the junction of Upper Ayer Rajah Road and [Jurong Town Hall Road](/wiki/Jurong_Town_Hall_Road). He was dead on arrival at the hospital.1984-09-21SCAbdul Rahman Bin Bujang21—He was posted to do sentry duty at the guardroom of the Police Headquarters at [Phoenix Park](/wiki/Phoenix_Park). While taking a lunch break, fellow officer, VC Jamaluddin Bin Ibrahim, 19, took SC Abdul Rahman's service revolver, and began to play with it despite being told not to do so by SC Abdul Rahman. Loading a single bullet into the revolver, he fired at SC Abdul Rahman's head, resulting in a single round discharged on his second trigger which killed the officer. Jamaluddin was sentenced to jail for 15 months after facing an initial charge of murder for Abdul Rahman's death, for which the charge was reduced to causing death by a rash act.1984-11-24PC 2816Supayah S/O K Marimuthu26[Tanglin](/wiki/Tanglin_Police_Division)PC 2816 and PC Lou Chung Hung, 20, were on mobile squad duty when they stopped two cyclists to conduct a routine check along [Newton Road](/wiki/Newton_Road). PC 2816 was standing to the front of the police car and PC Lou towards the rear when a passing car knocked the police car into the pavement, injuring both officers. The car driver was found to be under the influence of alcohol. PC 2816 subsequently died in hospital, while PC Lou escaped with minor injuries.1984-12-06Sgt 3370Chin Ah Kow43[Marine](/wiki/Police_Coast_Guard)Police boat PX-5 left its base in Jurong for routine patrol. En route, SC Abdul Rashid Bin Mohammed Said shot Sgt 3370 in the head and threw his body overboard. PC 8627 and a fourth officer, PC Shamsudin Bin Haji Ali were forced off the boat, and subsequently found near [Pulau Senang](/wiki/Pulau_Senang), by which time PC 8627 had drowned and PC Shamsudin the sole survivor. Sgt 3370's body was never found.PC 8627Wahid Bin Ahmad261985-07-04PC 7365Mohd Sarwar S/O Mohd Afzal36[Paya Lebar](/wiki/Ang_Mo_Kio_Police_Division)Died in hospital from his injuries sustained in a traffic accident when the patrol car he was driving collided into the back of a taxi in April 1985.1985-12-19PC 3649Goh Ah Khia40[CID](/wiki/Criminal_Investigation_Department_(Singapore))Shot and killed by notorious gunman [Lim Keng Peng](/wiki/Lim_Keng_Peng) aka Ah Huat, who had earlier killed a restaurant owner. PC 3649 and two other officers instructed Ah Huat to stop along Jalan Pelikat on 18 December 1985 after responding to a report of theft at the nearby Aroozoo Avenue, when he suddenly turned around and shot PC 3649. The officer died in hospital several hours later.1989-02-16Cpl 2977[Mirza Abdul Halim Bin Mirza Abdul Majid](/wiki/Mirza_Abdul_Halim_Bin_Mirza_Abdul_Majid)23[Bedok](/wiki/Bedok_Police_Division)PC 2977 was on patrol duty when he and PC Chua Yew Hua gave chase to two suspects who had tried to break into a minimart and a hairdressing salon. The suspects ran in different directions, and the two officers pursued after each suspect alone. PC 2977 brought down one of the suspects, and engaged in a tussle with him on the ground near [Tampines](/wiki/Tampines) Block 127, during which the officer was repeatedly stabbed. The suspect managed to snatch the officer's revolver from his holster and shot him in the head. He went into a coma, and was given a rare field promotion to a rank of Corporal just before he died in hospital. PC Chua was also injured and hospitalised, but successfully arrested the other suspect. Cpl 2977 was the last police officer to die from firearms violence. After years of similar incidents, this incident prompted a redesign of the gun holster to make it snatch-proof, and officers were advised against splitting up when pursuing suspects for their personal safety. ## 1990s DateRank/noNameAgeDivision/unitCircumstance1990-09-21Cpl 8951Tan Tiang Hwa31[Traffic](/wiki/Highway_patrol)Cpl 8951 was on enforcement patrol with the ROV Enforcement Unit when he rammed into the back of a lorry which was reversing after missing a junction along [Jalan Ahmad Ibrahim](/wiki/Jalan_Ahmad_Ibrahim). Cpl 8951 was knocked off his motorbike, and was rolled over by the lorry's wheels, killing him instantly.1991-08-26LCP 7290Ong Chin Woo23[CID](/wiki/Criminal_Investigation_Department_(Singapore))His unmarked police car with three officers lost control and collided into an [SBS](/wiki/SBS_Transit) bus at the junction of Upper Changi Road and Bedok South Road. LCP 7290, the back-seat passenger, was killed on the spot, while the other two officers and six passengers on the bus were injured. He was posthumously promoted to the rank of Cpl .1991-10-25VCKannan S/O Pinnasamy19—He was riding his bicycle to work when he collided with a van at the junction of Boon Lay Drive and [Corporation Road](/wiki/Corporation_Road) on 23 October 1991. He succumbed to his injuries two days later.1994-05-21Cpl[Hoi Kim Heng](/wiki/Hoi_Kim_Heng)24[Central](/wiki/Central_Police_Division)While on a routine spot-check on a subject, Soh Loo Ban, along Nankin Street, Cpl Hoi and his partner, Cpl Tan Huang Yee gave chase when Soh stabbed Cpl Tan on his arm with a 10-cm knife after being stopped during a routine security check. When nearing the Fook Hai Building, Soh collided with a pursuing Cpl Hoi, stabbing him fatally in the neck with his knife. Cpl Tan subsequently shot Soh dead in the chest at the Hong Lim Food Centre after a struggle on the floor in which Cpl Tan received more stab wounds. Cpl Tan recovered from his injuries, and was given a rare field promotion to a sergeant on 23 May 1994. Cpl Hoi was given the same promotion posthumously, and was ceremoniously cremated with full police honours and awarded the [Medal of Valour](/wiki/Pingat_Keberanian_Polis).1994-11-30SSSgt 800[Boo Tiang Huat](/wiki/Boo_Tiang_Huat)47[Tanglin](/wiki/Tanglin_Police_Division)During a routine spot-check at [Newton Road](/wiki/Newton_Road), SSSgt Boo requested [Zainal Abidin Abdul Malik](/wiki/Zainal_Abidin_Abdul_Malik), 29, to open his car boot for Inspection, and upon doing so, Zainal withdrew an axe and struck SSSgt Boo in the head with it. Zainal was arrested after a short chase, convicted of murder, and [executed](/wiki/Capital_punishment_in_Singapore) on 30 August 1996 after his appeal was rejected. He was given a posthumous promotion to the rank of SI, and awarded the [Medal of Valour](/wiki/Pingat_Keberanian_Polis). This incident was the last since an officer has been feloniously killed while on official duty.1996-02-16Cpl 7531Asri Bin Mohd Jalil31[Bedok](/wiki/Bedok_Police_Division)The [Fast Response Car](/wiki/Fast_Response_Car) he was in was responding to a case when it lost control, skidded, and crashed into a tree along Upper Changi Road East, resulting in his death. Three other officers in the car recovered from their injuries.1997-02-18Cpl 2176Lim Kok Seng24[Traffic](/wiki/Highway_patrol)Cpl 2176 was travelling along Upper Changi Road when he collided with an on-coming garbage truck turning into Changi North Street 1. The impact caused Cpl 2176 to be thrown off his police motorbike, and died at the scene an hour later. The truck driver was believed to be drunk. As he was due for promotion soon after his time of death, he was given a posthumous promotion to the rank of Sergeant.1998-10-26SSgt 9858Mohamad Asri Bin Amin35[Central](/wiki/Central_Police_Division)Killed in a hit-and-run accident while on his way to work at the junction of Tampines Avenue 1 and Tampines Avenue 10. The traffic lights was in his favour when a lorry collided into his motorcycle.1999-10-09SC/CplJohaan Kwah Choon Khiat23[Jurong](/wiki/Jurong_Police_Division)Succumbed to his injuries in hospital after meeting with a traffic accident on 4 October 1999. The [fast response car](/wiki/Fast_response_car) he was in crashed into the central divider along Woodlands Road near junction with Jalan Bumbong while responding to a message. The impact sent SC/Cpl Kwah crashing through the windscreen and landing on the opposite side of the road, and died five days later from severe head injuries. Upon his death, his case was highlighted in the media when his family agreed to donate his organs to six recipients, although one patient who received his heart subsequently developed complications and died. The driver of the police vehicle, SSgt Yeo Jin Kin Adrain, 25, escaped relatively unhurt and was subsequently charged for dangerous driving.1999-11-29Sgt 98574Ho Boon Chee21[Jurong](/wiki/Jurong_Police_Division)Killed when his [fast response car](/wiki/Fast_response_car) crashed along Choa Chu Kang Avenue 1 into a tree while responding to a message in the night of 28 November 1999. The driver, a 21-year-old sergeant, was trapped in the vehicle, while Sgt 98574 was removed from the car by passersby. Sgt 98574, who was 11 months in the force, died in hospital about five hours later, while the driver recovered from his injuries. He was the third police officer to die in three months, the first case of which involved an off-duty officer, sergeant Fazil Sengwan, 23, who died instantly in a car crash along Changi Coast Road on 7 September 1999. The police came forward to publicise the driving skills which officers are equipped in the media. ## 2000s DateRank/noNameAgeDivision/unitCircumstance2001-03-03SC/CplDzulkha Bin Basru22[Airport](/wiki/Airport_Police_Division)The police Land Rover driven by Sgt Tan lost control and flipped several times across Airport Boulevard near the [Singapore Airport Terminal Services](/wiki/Singapore_Airport_Terminal_Services) Inflight Catering Centre in the direction towards [Singapore Changi Airport](/wiki/Singapore_Changi_Airport), tossing several officers onto the road. SC/Cpl Dzulkha and NSPI Ranosasni died in hospital on the same day of the accident, while Sgt 98227 died the next day. Seven other officers survived the accident. The police pointed out that the Land Rover was not overloaded, as the vehicle was carrying ten officers while the maximum capacity was 11. The accident is the worst in terms of numbers of casualties in a single incident involving Singapore police officers since the death of three Constables on 24 July 1950 after a car ploughed into them.NSPIRanosasni Bin Mohamed Salleh232001-03-04Sgt 98227Tan Chiew Leong Benny232001-06-14Sgt 96782Quek Yew Ming26CentralFlung off the police scooter he was riding on when it collided into a taxi at the junction of [Victoria Street](/wiki/Victoria_Street,_Singapore) and [Ophir Road](/wiki/Ophir_Road) at about 0515 hours while he was on night shift. He died in hospital eight hours later.2002-12-27SIOng Kah Kiong Anthony43[Bedok](/wiki/Bedok_Police_Division)Team leader SI Ong and SC/Cpl Muhammad Syakir on normal supervisory rounds from the Changi Neighbourhood Police Centre died when their patrol car was hit from the rear by a large garbage truck along Tanah Merah Ferry Road. The impact of the crash sent the patrol car off the road, flipping over and landing on its roof, with the truck landing on top of the patrol car. Both officers were crushed and killed on the spot.SC/CplMuhammad Syakir Bin Ishak222003-06-29Sgt 99308Sri Norashikin Binte Ishak24[Jurong](/wiki/Jurong_Police_Division)Died from her injuries in hospital when the police van she was in collided with another vehicle along Kranji Way on 24 June 2003. She was the first female police officer of the Singapore Police Force to die while on duty. The other two officers, including the 25-year-old driver, recovered from their injuries.2005-10-09SSgt 4199Noranzor Bin Abdul Latiff32[Ang Mo Kio](/wiki/Ang_Mo_Kio_Police_Division)Lost control of his police motorbike along Yio Chu Kang Road near the Tamarind Road junction and died from internal chest injuries sustained after being thrown off his vehicle. His partner who was riding ahead of him was not involved in the accident.2005-11-09SSSgt(V) 1104Seah Ben Hur42Traffic PoliceKilled after being hit by a tipper lorry which failed to stop at a routine police road block along Dairy Farm Road towards [Upper Bukit Timah Road](/wiki/Upper_Bukit_Timah_Road). He was the second [Volunteer Special Constabulary](/wiki/Volunteer_Special_Constabulary) (VSC) to die in the line of duty, since 12 May 1955. Two other VSC officers, including his 46-year-old wife, were injured. He was given a posthumous promotion to the rank of [Station Inspector](/wiki/Station_Inspector). The lorry driver, Lim Hock Siew, 43, pleaded guilty to causing grievous hurt on 27 September 2006, and was sentenced on 2 October 2006.2007-04-14SI 2459Mohd Khalid Bin Muhamad41[PCG](/wiki/Police_Coast_Guard)Two Interceptor Crafts of the Special Task Squadron were on ambush duty off [Tuas](/wiki/Tuas) in the vicinity of Tuas Jetty, when a speedboat with six illegal immigrants and cartons of cigarettes intruded into [Singapore's territorial waters](/wiki/List_of_waterways_in_Singapore) at about 9.30 pm on 13 April 2007. The speedboat sped off when approached by the police, resulting in a five-minute chase which resulted in a collision between one of the crafts and the speedboat near [Pulau Merambong](/wiki/Pulau_Merambong). Both boats capsized, while the speedboat was completely wrecked. SSgt Sharul Khamis, 33, and Cpl Benji Lim, in his 20s, were rescued from the scene within minutes with minor injuries, while SI Mohd Khalid and SSgt Heah were reported missing. Their bodies were later found trapped in the steering compartment of the capsized craft on 14 April 2007 at about 8.15 am. All four officers were wearing lifevests at the time of the incident. Three passengers on the intruding vessels were also rescued, and a fourth man found dead. The rest of the passengers were not found. The two officers were the first casualties for the STS and the PCG since the latter's evolution from the Marine Division in 1993. It was also the first instance in which a police boat capsizes, and the first police fatalities arising as a result of a high speed chase. Both officers were posthumously promoted to the ranks of [Senior Station Inspector](/wiki/Senior_Station_Inspector) and [Senior Staff Sergeant](/wiki/Senior_Staff_Sergeant) respectively.SSgt T01217Heah Khim Han292008-03-05Cpl T07260Abdul Halim Bin Abdul Samad22[Central](/wiki/Central_Police_Division)Killed in a traffic accident on his way to work at [Parliament House](/wiki/Parliament_House,_Singapore) for routine security duties. His motorcycle collided with a van at the junction of [Eu Tong Sen Street](/wiki/Eu_Tong_Sen_Street) and Hospital Drive at about 09:30 hours, and was pronounced dead at the scene at about 09:40 hours. The officer joined the force in 2007.2008-05-15TSCRoslan Bin Saharo19[Training Command](/wiki/Training_Command_(Singapore))Collapsed shortly after commencing a trial [Individual Physical Proficiency Test](/wiki/Individual_Physical_Proficiency_Test) conducted at the [Home Team Academy](/wiki/Home_Team_Academy) on 13 May 2008. He was reported to have been unwell before the run, and died in hospital two days later due to complications caused by [heat stroke](/wiki/Heat_stroke). Further enquiry found that he has failed to report that he had a fever, and insisted on continuing the run despite concerns from squad-mates. ## 2010s DateRank/noNameAgeDivision/unitCircumstance1 June 2017SSgt T09574Nadzrie Bin Matin29Traffic PoliceCritically injured after being in a collision with a black van while performing his traffic patrol duties along [Serangoon Road](/wiki/Serangoon_Road) around 10:30 hours. He was taken to [Tan Tock Seng Hospital](/wiki/Tan_Tock_Seng_Hospital), where he succumbed to his injuries.10 February 2019SSgtSalinah Mohamed41[Central](/wiki/Central_Police_Division)Critically injured after being hit by an Aston Martin car on Sunday at the junction of Maxwell Road and Shenton Way while walking to the MRT station on the way home from work at 9.20pm. She was pronounced dead at [Singapore General Hospital](/wiki/Singapore_General_Hospital) on the next day. A 51-year-old male driver was arrested for dangerous driving & causing death by negligent act. - Singapore Police Force\n",
  "language": "en",
  "processed_at": "2026-01-12T11:23:11.319826",
  "title": "List of Singapore police officers killed in the line of duty",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/List_of_Singapore_police_officers_killed_in_the_line_of_duty"
}