{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:25:17.611381"
  },
  "content": "This article **may contain an excessive number of citations**. Please help improve it by removing low-quality or irrelevant citations. *(December 2023)* *(Learn how and when to remove this message)* This is a list of major [crimes in Singapore](/wiki/Crime_in_Singapore) between 2000 and 2009, arranged in chronological order. ## 2000 - 7 February: 27-year-old finance executive [Linda Chua](/wiki/Death_of_Linda_Chua) was assaulted and raped while she was jogging in the [Bukit Batok Nature Park](/wiki/Bukit_Batok_Nature_Park). She died on 14 February. As of November 2025[update], the case remained unsolved. - 17 May: 36-year-old [Leong Fook Weng](/wiki/Murder_of_Leong_Fook_Weng), who had fought with four people, was found dead in a vacant lot wearing only his underwear and with several stab wounds on his body. 22-year-old William Ho Kah Wei (alias Soh Tan Huat), who knew that the four killed Leong but never reported the crime to police, was imprisoned for six months. The assailants fled Singapore after killing Leong but one, 36-year-old Robson Tay Teik Chai, was found in France serving a two-year sentence for drug offences. He was sent back to Singapore in 2003, where he was sentenced to nine years' imprisonment and 12 strokes of the cane for culpable homicide. A second assailant, 34-year-old See Chee Keong, was found in a Cambodian prison serving an 18-year sentence for drug trafficking. See received a royal pardon, and was returned to Singapore for trial in November 2013. Expressing remorse for the crime, he was sentenced to ten years' imprisonment on 20 April 2016 for culpable homicide. The remaining two assailants remain at large. - 15 June: 65-year-old part-time taxi driver [Ong Huay Dee](/wiki/Ong_Huay_Dee) was bludgeoned to death by a passenger. Ong's killer, 25-year-old Thai national Khwan-On Natthaphon, was convicted in August 2001 and hanged on 27 September 2002. - 8 and 26 August: On the morning of 8 August, 34-year-old Wan Kamil bin Md Shafian, 35-year-old Ibrahim bin Mohd and 30-year-old Rosli bin Ahmat robbed 42-year-old taxi driver [Koh Ngiap Yong](/wiki/Koh_Ngiap_Yong) in [Bukit Batok](/wiki/Bukit_Batok). After handcuffing Koh, Kamil ordered Rosli to stab him with a [bayonet](/wiki/Bayonet) before they unlocked the handcuffs. The robbers dropped a handcuff key before driving to [Woodlands](/wiki/Woodlands,_Singapore) for another planned robbery. Koh's body was discovered the following morning, but the murder was unsolved until another murder on the evening of 26 August; Kamil and Ibrahim robbed and fatally shot 39-year-old money changer Jagabar Sathik on an overhead bridge in [Jalan Kukoh](/wiki/River_Valley,_Singapore). Police traced a stolen phone from Sathik to Kamil and Ibrahim, and all three were arrested on 15 October 2000 by the [STAR](/wiki/Special_Tactics_and_Rescue_(Singapore)) tactical unit. Koh's murder was traced to them when handcuffs and keys recovered from Kamil's flat did not match. They were found guilty of murder and sentenced to death by [High Court](/wiki/High_Court_of_Singapore) judge M. P. H. Rubin on 5 September 2001, and were hanged on 25 October 2002. ## 2001 - 14 May: 34-year-old [Anthony Ler Wee Teang](/wiki/Anthony_Ler_Wee_Teang) hired a youth to assassinate his wife, 30-year-old Annie Leong Wai Mun (who was divorcing him), to become the sole owner of their flat and gain custody of their four-year-old daughter. Ler approached four youths and offered them [S$](/wiki/Singapore_dollar)100,000 to kill Leong. A 15-year-old boy whom Ler had known for five years accepted the offer. Ler coerced the youth, who (after several failed attempts) fatally stabbed Leong with a knife provided by Ler. Because of his age, the boy was not named. Ler, who smiled throughout the court proceedings and in the media, was convicted of masterminding the murder and sentenced to death by [High Court](/wiki/High_Court_of_Singapore) judge [Tay Yong Kwang](/wiki/Tay_Yong_Kwang) on 5 December 2001 and was hanged in [Changi Prison](/wiki/Changi_Prison) on 13 December 2002. The youth, detained under [the President's Pleasure](/wiki/The_President%27s_Pleasure_(Singapore)) for 17 years, was released on 2 November 2018 with his identity still protected. - 30–31 May: Seventeen-year-old football player [Sulaiman bin Hashim](/wiki/Murder_of_Sulaiman_bin_Hashim) was assaulted and murdered by eight members of the street gang [Salakau](/wiki/Salakau), led by their 21-year-old leader Norhisham bin Mohamad Dahlan, outside a [South Bridge Road](/wiki/South_Bridge_Road) pub. Six gang members were found guilty of [culpable homicide](/wiki/Culpable_homicide), rioting, voluntarily causing grievous hurt, or a combination of those charges. One (Muhamad Hasik bin Sahar) was sentenced to [life imprisonment](/wiki/Life_imprisonment) and 16 [strokes of the cane](/wiki/Caning_in_Singapore); the rest, including Norhisham, received jail terms of three to 10 years and six to 16 strokes of the cane. As of July 2021[update], two other gang members were still at large. - 10 August: - In Queenstown Remand Prison, 19-year-old [Shankar Suppiahmaniam](/wiki/Shankar_Suppiahmaniam) (held in remand for abducting and raping two young girls) was strangled to death by 35-year-old cellmate Kanesan Ratnam. Kanesan confessed to the murder, saying that he was angry with Shankar over spilled tea and wanted the death penalty after several suicide attempts. Kanesan (in remand for a sex crime) was charged with murder and, after a three-day trial, was found guilty of murder and sentenced to death on 27 February 2002. He was hanged on 10 January 2003. - 33-year-old businessman Tay Teng Joo was kidnapped the day before his wedding by 45-year-old Chng Teo Heng and two accomplices, 52-year-old Agnes Ng Lei Eng and 42-year-old Ng Soon Teck, who blindfolded him and demanded a S$4 million ransom from his family. The ransom was reduced to S$1.22 million, and Tay was released. Police arrested all three kidnappers and recovered the ransom; they were convicted of kidnapping and sentenced to [life imprisonment](/wiki/Life_imprisonment), and Chng was sentenced to six strokes of the cane for using a knife during the kidnapping. Ng had asked the judge to sentence her to death. She died on 13 June 2013, and her cause of death is unknown. - 20 September: After giving a package to an undercover police officer, 21-year-old [Vignes Mourthi](/wiki/Vignes_Mourthi) was arrested in an operation by the [Central Narcotics Bureau](/wiki/Central_Narcotics_Bureau). Vignes's accomplice, family friend Moorthy Angappan, was also arrested. Charged with trafficking 27.65 grams (0.975 oz) of [diamorphine](/wiki/Heroin), they were found guilty in August 2002 and sentenced to death. Vignes insisted that he was innocent, but he and Moorthy were hanged on 26 September 2003. - 2 October: 16-year-old Gunasegaran Ramasamy robbed and stabbed 28-year-old [Soh San](/wiki/Death_of_Soh_San) in a lift at an [HDB](/wiki/Housing_and_Development_Board) block in Bukit Batok. Soh died of her injuries, and Gunasegaran fled with S$30. The case was unsolved, despite appeals for eyewitnesses in an episode of the television series *[Crimewatch](/wiki/Crimewatch_(Singaporean_TV_series))*. Gunasegaran was arrested for other offences over the following years, and police did not know about his role in Soh's death. On 17 November 2013, he surrendered and admitted killing Soh. He was initially charged with murder, but the charge was reduced to robbery with assault in 2016; on 20 March 2017, Gunasegaran was sentenced to 10 years' imprisonment and 12 strokes of the cane. - 8 November: 48-year-old [Peh Thian Hui](/wiki/Peh_Thian_Hui_case) was arrested at his flat after a police report filed by a 15-year-old girl. The girl reported that from 1996 to 2000, she had been raped by Peh over 50 times with the consent of her mother (Peh's lover). The girl reportedly contracted a sexually transmitted disease as a result of the rapes. Peh was charged with rape, and the girl's mother was arrested and charged with abetting rape. In May 2002, Peh and the mother pleaded guilty and were sentenced to 36 years in prison; Peh also received the maximum of 24 strokes of the cane. - 2 December: 19-year-old Indonesian domestic worker [Muawanatul Chasanah](/wiki/Killing_of_Muawanatul_Chasanah) was abused and starved over a nine-month period by her employer, 47-year-old Ng Hua Chye. A kick by Ng ruptured her stomach on 1 December, and she died of [peritonitis](/wiki/Peritonitis); Ng surrendered on 2 December. Initially charged with murder, his charges were reduced to [culpable homicide](/wiki/Culpable_homicide) and voluntarily causing hurt. On 19 July 2002, Ng was sentenced to 18+1⁄2 years' imprisonment and 12 strokes of the cane. Ng's wife, 30-year-old Rainbow Tan Chai Hong, was charged with voluntarily causing hurt to Muawanatul and failing to report her husband's actions to the police. On 19 February 2003, she was sentenced to nine months' imprisonment. - 9–24 December: A plot by the terrorist group [Jemaah Islamiyah](/wiki/Jemaah_Islamiyah) (JI) to [bomb several embassies in Singapore](/wiki/Singapore_embassies_attack_plot) and the [Yishun MRT station](/wiki/Yishun_MRT_station) was discovered by the [Internal Security Department](/wiki/Internal_Security_Department_(Singapore)), leading to the arrests of 15 Singapore-based JI members. Over the next few years, about 40 more JI-linked individuals were arrested. - 22 December: During a late-night argument, 23-year-old Indian electrician [Arun Prakash Vaithilingam](/wiki/Arun_Prakash_Vaithilingam) stabbed flatmate and colleague Lourdusamy Lenin Selvanayagan (also 23) in the chest with a kitchen knife in their crowded Marsiling flat. Lenin was pronounced dead at 1.02 a.m. on 23 December in [Alexandra Hospital](/wiki/Alexandra_Hospital). Arun went into hiding until he was caught trying to leave Singapore with a fake passport at the [Woodlands Checkpoint](/wiki/Woodlands_Checkpoint) on 18 March 2002. Sentenced to death, he was hanged on 3 October 2003. - 31 December: 56-year-old [Quek Loo Ming](/wiki/Quek_Loo_Ming) added a teaspoon of the insecticide [methomyl](/wiki/Methomyl) to a bottle of water in the hope that 49-year-old Doreen Lum, chairperson of a residents' committee in [Bukit Timah](/wiki/Bukit_Timah), would drink it; Quek said that Lum treated him like an \"errand boy\" when he was a committee volunteer, and he wanted to give her [diarrhoea](/wiki/Diarrhoea). Three other people drank the water and were hospitalised; one, 62-year-old Fong Oi Lin, died on 3 January 2002. Initially charged with murder, Quek was sentenced on 5 August 2002 to nine years' imprisonment for [culpable homicide](/wiki/Culpable_homicide) and three years (concurrent) for voluntarily causing grievous hurt. On 8 November 2002, the [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore) increased Quek's jail terms to ten and five years respectively; the sentences were consecutive, for a total of 15 years' imprisonment. ## 2002 - 2 January: 44-year-old British financial adviser Michael McCrea [killed his chauffeur and friend](/wiki/Orchard_Towers_double_murders), 46-year-old Kho Nai Guan, and Kho's girlfriend, 29-year-old Chinese national Lan Ya Ming, in his apartment in [Balmoral Park](/wiki/Bukit_Timah). The killings followed a quarrel after Kho insulted McCrea's girlfriend, 22-year-old Audrey Ong Pei Ling. McCrea strangled Kho to death and knocked Lan unconscious, securing plastic bags over her head which suffocated her. McCrea and Ong contacted their respective friends, Gemma Louise Ramsbottom and Justin Cheo Yi Tang, for help in disposing of the bodies. On 4 January, Kho's body was stuffed into a wicker basket and left on the rear seat of a [Daewoo Chairman](/wiki/SsangYong_Chairman); Lan's body was stuffed into the boot, and the car was abandoned at [Orchard Towers](/wiki/Orchard_Towers). McCrea and Ong fled Singapore on 5 January, and were arrested in [Melbourne](/wiki/Melbourne) in June 2002 and extradited to Singapore in 2003 and 2005, respectively. Singapore had to assure Australia that he would not be sentenced to death if convicted, since Australian law prohibits extradition if an individual could be sentenced to death. Ong was sentenced on 7 February 2003 to 12 years' imprisonment for her role in disposing of the bodies. Ramsbottom and Cheo testified against McCrea, saying that he coerced them into cooperating. McCrea pleaded guilty to culpable homicide and concealing evidence, and was sentenced to 24 years' imprisonment on 29 June 2006; he was eligible for early release on 29 June 2022. - 4 February: During a drinking-session argument, 34-year-old [Jin Yugang](/wiki/Jin_Yugang) stabbed 32-year-old roommate Wang Hong to death. Jin, convicted of murder on 16 January 2003 and sentenced to death, was hanged on 19 March 2004. - February 2002 – July 2012: For more than ten years, Perak-born Malaysian accountant Ewe Pang Kooi siphoned $41 million from over 20 companies for which he worked to gamble, pay debts or reinstate past embezzlement. In July 2012, one of the companies questioned him about assets from liquidation of the companies. Ewe faced 50 charges of criminal breach of trust as an agent, which potentially warrants the maximum term of life imprisonment. Only $17 million were recovered by the police, and the remaining $24 million remained unaccounted for. Ewe was found guilty; due to his age (65), his remorse and cooperation with the police, he was sentenced to 25 years and 10 months on 16 July 2019. - 8 May: 36-year-old [Yen May Woen](/wiki/Yen_May_Woen) was caught with 120 sachets of diamorphine when she left a taxi at a [Toa Payoh](/wiki/Toa_Payoh) carpark. Yen was found guilty of smuggling 30.16 grams (1.064 oz) of diamorphine in March 2003 and sentenced to death. She was executed at Changi Prison on 19 March 2004, the last woman to be hanged in Singapore for 19 years until drug trafficker [Saridewi binte Djamani](/wiki/Saridewi_binte_Djamani) was scheduled to hang on 28 July 2023. - 28 May: 23-year-old Indonesian domestic worker [Sundarti Supriyanto](/wiki/Sundarti_Supriyanto) fatally stabbed her 34-year-old employer, Angie Ng, in her office in [Bukit Merah](/wiki/Bukit_Merah). She then set fire to the office and removed Ng's 18-month-old son, Leon Poh; Ng's three-year-old daughter, Crystal Poh, died in the fire. Sundarti was arrested after knife wounds were discovered on Ng's body; she admitted starting the fire, but denied killing Ng. [High Court](/wiki/High_Court_of_Singapore) judge M. P. H. Rubin accepted Sundarti's corroborated claims that Ng starved and abused her, finding her guilty of [culpable homicide](/wiki/Culpable_homicide) and sentencing her to life imprisonment on 25 September 2004. - 5 August: Soosainathan Dass Saminathan (40 years old and unemployed) raped and murdered six-month-old [Anjeli Elisaputri](/wiki/Anjeli_Elisaputri), the daughter of his friend and his Indonesian girlfriend. On 15 July 2003, he was found guilty and sentenced to death; he was hanged on 21 May 2004. - December 2002: Australian [Van Tuong Nguyen](/wiki/Van_Tuong_Nguyen) was convicted of carrying about 400 grams (14 oz) of heroin at [Changi Airport](/wiki/Changi_Airport) while travelling from Cambodia to Australia, and was sentenced to death on 20 March 2004. Despite pleas for clemency from the Australian government, Nguyen was hanged on 2 December 2005. ## 2003 - 9 January: 26-year-old Thai housewife [Thabun Pranee](/wiki/Thabun_Pranee) was raped and murdered by a robber who stole gold items and other valuables from her Chai Chee flat. Twenty-nine-year-old Tan Chee Wee, a Malaysian friend and gambling partner of Thabun's husband, was charged with murder, rape and robbery. He was found guilty and sentenced to death on 29 September 2003, and was hanged on 11 June 2004. - 10 March: Thirty-two-year-old [Diana Teo Siew Peng](/wiki/Murder_of_Diana_Teo_Siew_Peng), a divorcee with a son, was pushed to her death by 38-year-old boyfriend Harith Gary Lee (also known as Lee Cheng Thiam). Lee was found guilty of murder and sentenced to death in April 2004, and was hanged on 22 April 2005. - 28 June: Sixty-eight-year-old [Chi Tue Tiong](/wiki/Chi_Tue_Tiong), the caretaker of a [Geylang](/wiki/Geylang) apartment, was bludgeoned to death in his room. One of the killers, 35-year-old Zailani Ahmad, was arrested two days later and charged with murder. He was convicted and sentenced to death in March 2004, lost his appeal in November of that year, and was hanged. Zailani's Indonesian girlfriend Rachel, who was also involved in the murder, fled to [Batam](/wiki/Batam) and remains at large. - 7 August: Selvaraju s/o Satippan, unemployed, was arrested for kidnapping 22-year-old [MediaCorp](/wiki/MediaCorp) journalist Nina Elizabeth Varghese. Selvaraju, charged with kidnapping, causing hurt and attempted murder, was sentenced the following year to life imprisonment and 24 strokes of the cane. - 25 December: A seven-year-old girl was kidnapped in a car by 35-year-old [Tan Ping Koon](/wiki/Tan_Ping_Koon) and 42-year-old [Chua Ser Lien](/wiki/Chua_Ser_Lien). A witness noted the car's licence-plate number, and her husband followed it; the kidnappers released the girl in [Tampines](/wiki/Tampines) before demanding S$1 million from the girl's father the following day. Seventy thousand dollars was agreed and paid before Tan and Chua were arrested on 27 December. They were found guilty of kidnapping and sentenced to life imprisonment and three strokes of the cane. Chua died by suicide in [Changi Prison](/wiki/Changi_Prison) on 8 July 2020. ## 2004 - 2 March: Forty-seven-year-old oil-rig purchasing officer [Esther Ang Imm Suan](/wiki/Esther_Ang_Imm_Suan) was strangled to death by her two maids, 15-year-old Siti Aminah and 18-year-old Juminem, due to harsh treatment. Charged with murder, they were found guilty of culpable homicide. Juminem was sentenced to life imprisonment, and Siti received a ten-year sentence on 5 September 2005. - 2 April: Forty-four-year-old [Chia Teck Leng](/wiki/Chia_Teck_Leng) was sentenced to 42 years in jail after defrauding four foreign banks of S$117 million from 1999 to 2003 in his position as financial manager of [Asia Pacific Breweries](/wiki/Asia_Pacific_Breweries). Chia's sentence was the longest for a commercial crime in Singapore. - 2 April 2004: Forty-four-year-old Lim Poh Lye and two accomplices attempted to rob 56-year-old scrap-car dealer [Bock Thuan Thong](/wiki/Murder_of_Bock_Tuan_Thong) and stabbed him to death when he tried to escape. Bock's body was left in a car in [Boon Keng](/wiki/Boon_Keng). Two days later, Lim surrendered to police. About ten weeks later, 36-year-old Tony Koh Zhan Quan (an accomplice who fled to Malaysia) surrendered to the [Royal Malaysia Police](/wiki/Royal_Malaysia_Police) and was extradited to Singapore. Lim and Koh were charged with murder; the second accomplice remains at large. They were found guilty of murder on 15 July 2005, and were hanged on 28 April 2006. - 17 May: Forty-three-year-old [G. Krishnasamy Naidu](/wiki/G._Krishnasamy_Naidu) hacked his wife, 39-year-old Chitrabathy d/o Narayanasamy, to death with a chopper in front of several witnesses at his wife's workplace in [Tuas](/wiki/Tuas); Krishnasamy was free on bail after stabbing his wife twice with a knife on 8 April 2004. Nine hours after killing his wife, he surrendered to police and was charged with murder. Found guilty of murder and sentenced to death, his appeal was successful; Krishnasamy was found guilty of culpable homicide and sentenced to life imprisonment. - 1 June: Thirty-seven-year-old [Chong Keng Chye](/wiki/Chong_Keng_Chye) was sentenced to 20 years' preventive detention and nine strokes of the cane for abusing a seven-year-old boy to death and for cheating six people out of S$284,000. He manipulated the boy's mother (his 40-year-old girlfriend Sung Peck Imm, who had an IQ of 80) to assist him in abusing the boy for several months until his death on 3 June 1999. When they were arrested in August 2003 for cheating, police discovered that they were responsible for the boy's death as well. Chong and Sung were initially charged with murder and abetment of murder, respectively; Sung, convicted of cheating and abetting Chong to abuse her son and two daughters, was sentenced to four years and seven months' imprisonment on 11 May 2004. - 7 October: Four-year-old [Sindee Neo](/wiki/Sindee_Neo) was abducted from her home and thrown from a flat in [Telok Blangah](/wiki/Telok_Blangah); head injuries led to her death five days later. Chee Cheong Hin Constance, a 37-year-old former [Singapore Airlines](/wiki/Singapore_Airlines) stewardess and the lover of Neo's father, was initially charged with abduction and murder; the charge was reduced to culpable homicide after it was learned that she had [schizophrenia](/wiki/Schizophrenia). In January 2006, Chee was found guilty of abducting Neo and causing her death. On 7 April 2006, she was sentenced to 13 years' imprisonment: 10 years for killing Neo, and three years for the abduction. - 10 October: Eight-year-old [Huang Na](/wiki/Murder_of_Huang_Na) was found dead and stuffed inside a box in [Telok Blangah Hill Park](/wiki/Telok_Blangah_Hill_Park). Took Leng How, a Malaysian who was an acquaintance of Huang's mother, was arrested and charged with murder; found guilty and sentenced to death, Took was hanged on 3 November 2006. - November: Nigerian citizen [Iwuchukwu Amara Tochi](/wiki/Iwuchukwu_Amara_Tochi) was arrested at [Changi Airport](/wiki/Changi_Airport) for carrying 100 capsules containing heroin. On 22 December 2005, Tochi was found guilty of drug trafficking and sentenced to death. He was hanged on 26 January 2007. - [Ng Teck Lee](/wiki/Ng_Teck_Lee) was charged with embezzling S$72 million worth of electronic waste. ## 2005 - 6 May: 29-year-old Muhammad bin Kadar fatally stabbed 69-year-old [Tham Weng Kuen](/wiki/Tham_Weng_Kuen) over 110 times during a robbery in her flat in [Boon Lay](/wiki/Boon_Lay). When he was arrested, Muhammad implicated his 37-year-old brother as an accomplice and said that he killed Tham. Muhammad recanted his accusation, but he and his brother were found guilty of murder and sentenced to death; on appeal, his brother was acquitted on 6 July 2011. Muhammad was hanged on 17 April 2015 in Changi Prison. - 15–16 June: Fifty-year-old Leong Siew Chor [murdered his lover](/wiki/Kallang_River_body_parts_murder), 22-year-old Chinese national Liu Hong Mei, dismembered her and dumped the pieces in several places throughout Singapore, including the [Kallang River](/wiki/Kallang_River). He stole her credit card and withdrew S$2,000 from her bank account after having sex with her. Leong was arrested on 17 June. On 19 May 2006, he was found guilty of murder and sentenced to death; he was hanged on 30 November 2007. - 7 September: Twenty-nine-year-old Filipino domestic helper Guen Garlejo Aguilar [killed her friend](/wiki/Orchard_Road_body_parts_murder), 26-year-old colleague Jane Parangan La Puebla. The women had quarreled over La Puebla's S$2,000 debt, and Aguilar smothered and strangled La Puebla to death in the [Serangoon](/wiki/Serangoon) condominium where Aguilar worked. Aguilar hid La Puebla's body in luggage, unknown by her employers. Two days later, after her employers went to work, Aguilar dismembered La Puebla's body and disposed of the parts along [Orchard Road](/wiki/Orchard_Road) and near [MacRitchie Reservoir](/wiki/MacRitchie_Reservoir). After the body parts were discovered, police arrested Aguilar. Her charges were reduced to [manslaughter](/wiki/Manslaughter), she pleaded guilty and was sentenced to ten years' imprisonment. - 13 September: Twenty-seven-year-old sex worker Lim Ah Liang stabbed and bludgeoned his 37-year-old lover [Ho Kien Leong](/wiki/Murder_of_Ho_Kien_Leong) to death in Ho's flat on Indus Road. Lim had been a freelance masseur for Ho, paying him a commission for client referrals. Ho demanded a higher commission in June of that year, and Lim quit. To renegotiate, they met in Ho's flat on 13 September. Ho threatened Lim with a kitchen knife, but Lim grabbed the knife and stabbed Ho 13 times. Lim fled to Malaysia, leaving Ho's body in the flat until neighbours called the police nine days later. Lim, initially charged with murder, pleaded guilty to culpable homicide due to [dysthymia](/wiki/Dysthymia) and was sentenced to life imprisonment. - 19 October: Seventy-five-year-old [Wee Keng Wah](/wiki/Wee_Keng_Wah) caught her Indonesian maid, Barokah, sneaking out to meet her boyfriend. Barokah knocked Wee unconscious before throwing her out the bedroom window of Wee's ninth-floor [Chai Chee](/wiki/Chai_Chee) flat. Charged with murder, the charge was reduced due to [depression](/wiki/Major_depressive_disorder) and [dependent personality disorder](/wiki/Dependent_personality_disorder). On 26 November 2007, Barokah pleaded guilty and was sentenced to life imprisonment. - 25 October: Thirty-seven-year-old Lim Ah Seng murdered his abusive wife, [Riana Agustina](/wiki/Killing_of_Riana_Agustina), whom he married in 1998. Lim experienced frequent beatings and psychological abuse by his wife, becoming deaf in one ear. Their two children were also beaten by Riana. On the night of the murder, after they had sex, Riana threatened to report Lim for rape and attacked him repeatedly, threatening to kill him. Lim was arrested for murder. According to psychiatric assessments, Lim Ah Seng had post-traumatic stress disorder (PTSD). The charge was amended to culpable homicide, and Lim pleaded guilty. On 7 July 2006, he was sentenced to 2+1⁄2 years' imprisonment effective the date of his arrest. - 2 December: In front of his 13-year-old nephew, 44-year-old condominium caretaker Mohammad Zam Abdul Rashid assaulted his 38-year-old wife [Ramona Johari](/wiki/Murder_of_Ramona_Johari) in their Dover Road flat. Ramona died two days later, and Mohammad Zam was charged with murder. He was sentenced to life imprisonment in September 2006. - 24 December: Four Malaysians (20-year-old Hamir Bin Hasim, 21-year-old Kamal Bin Kupli, 25-year-old Abdul Malik Bin Usman and 17-year-old Benedict Inyang Anak Igai) attacked 41-year-old Myanmar national [Thein Naing](/wiki/Upper_Boon_Keng_Road_murder). Benedict was the lookout, and the remaining three stabbed Thein and kicked him in the head. Thein died, and the gang took his wallet and cash. A passer-by discovered Thein's body and contacted police, who arrested the four Malaysians (who had committed additional robberies before Thein's murder). Benedict was sentenced to five years' imprisonment and 12 strokes of the cane for robbery with hurt, and the other three were hanged in September 2008. ## 2006 - 15 February: 39-year-old [Tan Chor Jin](/wiki/Tan_Chor_Jin), nicknamed the \"One-Eyed Dragon\" because he was blind in his right eye, forcefully entered the apartment of 41-year-old nightclub owner Lim Hock Soon. He robbed Lim and his family and shot Lim to death before fleeing Singapore with help from accomplice Ho Yueh Keong. Tan was captured by the [Royal Malaysia Police](/wiki/Royal_Malaysia_Police) ten days later at a hotel in [Kuala Lumpur](/wiki/Kuala_Lumpur), and was extradited to Singapore on 1 March. Initially charged with murder, his charge was reduced to unlawful discharge of a firearm. Unrepresented by legal counsel and claiming self-defence, Tan's prosecution noted that Lim was tied up. He was found guilty of murder on 22 May 2007, and was hanged on 9 January 2009. Ho, who was on the run for nine years before he was arrested and extradited to Singapore, was charged on 15 July 2015 with harbouring a fugitive and pleaded guilty on 8 August 2016. Two days later, he was sentenced to 20 months in prison. - 1 March: Nurasyura binte Mohamed Fauzi, a two-year-old girl known as [Nonoi](/wiki/Murder_of_Nonoi), went missing in early 2006 and was the subject of an extensive search. Three days later, 29-year-old Mohammed Ali bin Johari (Nonoi's stepfather) tearfully confessed to his wife and mother-in-law that he had accidentally drowned her while trying to get her to stop crying. Mohammed Ali surrendered himself to the police and led them to Nonoi's body. Autopsy results indicated that Mohammed Ali had raped her before the murder. He was found guilty on 31 August 2007, and was hanged on 19 December 2008. - 25 April: At a playground in [Ang Mo Kio](/wiki/Ang_Mo_Kio), 26-year-old bouncer [Jagagevan Jayaram](/wiki/Murder_of_Jagagevan_Jayaram) was stabbed 11 times by three men (including his brother-in-law) and died. Melvin Mathenkumar Segaram, Sadayan Ajmeershah and Arull Wanan Thangarasu were charged with murder after they surrendered. The attack sprang from a dispute between one of Sadayan's friends and Jagagevan's sister, leading to the fatal fight. Melvin and Arull pleaded guilty to rioting, and were sentenced to four years' imprisonment and eight strokes of the cane in April 2007. Sadayan pleaded guilty to culpable homicide not amounting to murder (or manslaughter), and was sentenced to nine years in jail and 12 strokes of the cane in August 2007. - 30 May: In a robbery masterminded by two accomplices, 22-year-old Daniel Vijay s/o Katherasan, 23-year-old Christopher Samson s/o Anpalagan, and 47-year-old Nakamuthu Balakrishnan robbed 46-year-old lorry driver [Wan Cheon Kem](/wiki/Murder_of_Wan_Cheon_Kem) of 2,700 mobile phones valued at S$1.3 million. Balakrishnan used a baseball bat to strike Wan at least 15 times, causing his death in hospital six days later. The accomplices were 36-year-old Ragu [a/l](/wiki/Malaysian_names#Indian_names) Ramajayam and 38-year-old Arsan s/o Krishnasamy Govindarajoo. Only 2,158 of the phones were recovered. Ragu and Arsan were charged with abetting armed robbery with hurt, and Daniel, Christopher and Balakrishnan were charged with murder. Ragu, who knew about Wan's assignment to deliver the phones and informed the others, pleaded guilty. Sentenced to six years' imprisonment and 12 strokes of the cane on 24 April 2007, his sentence was reduced to 4+1⁄2 years in jail and six strokes of the cane. Arsan was convicted of abetment of armed robbery with hurt and other charges, and was sentenced to 16+1⁄2 years' imprisonment and 24 strokes of the cane. Daniel, Christopher and Balakrishnan were found guilty of murder and sentenced to death on 28 July 2008. Daniel and Christopher appealed their sentences, and were convicted of armed robbery with hurt on 3 September 2010. On 4 October, they were sentenced to 15 years' imprisonment and 15 strokes of the cane. Balakrishnan was hanged on 8 July 2011 after he did not appeal the death sentence. - 2 June: 42-year-old lawyer David Rasif fled Singapore with S$11.3 million of his clients' money and remains at large. The [Commercial Affairs Department](/wiki/Commercial_Affairs_Department) has recovered S$7.4 million in cash and gold bars from bank accounts in Singapore, Hong Kong and Vietnam. Rasif's accomplices (property agent Goh Chong Liang and lawyer David Tan Hock Boon) were sentenced to five years and five months' imprisonment in August 2007 and five years' imprisonment in November 2008, respectively. - 18 June: 29-year-old Chinese [peidu mama](/wiki/Peidu_mama) [Yu Hongjin](/wiki/Yu_Hongjin) stabbed 52-year-old Singaporean boyfriend Eu Lim Hoklai during an argument in her [Ang Mo Kio](/wiki/Ang_Mo_Kio) massage parlour, and Eu fatally stabbed her. Sentenced to death in 2009, he appealed his conviction and received ten years' imprisonment for manslaughter instead. - August 2006 – November 2007: [James Phang Wah](/wiki/James_Phang_Wah), director of [Sunshine Empire](/wiki/Sunshine_Empire), swindled a number of people (including retirees and students) of S$190 million in a [Ponzi scheme](/wiki/Ponzi_scheme). Phang was sentenced to nine years' imprisonment and fined S$66,000 for criminal breach of trust in July 2010. His wife Neo Kuon Huay was fined S$60,000, and his accomplice Hoo Choon Cheat was jailed for seven years for their roles in Phang's criminal activities. When Phang was released from prison on 20 December 2017, he faced fraud charges in Malaysia. ## 2007 - 12 June: Nineteen-year-old Malaysian [Yong Vui Kong](/wiki/Yong_Vui_Kong) was arrested for transporting more than 47 grams (1.7 oz) of heroin from Malaysia to Singapore. He was found guilty of drug trafficking and sentenced to death in November 2008. He lost his appeal and failed in a plea for clemency, but 2013 legislative changes gave judges discretion to sentence drug couriers to life imprisonment instead of death. Yong was re-sentenced to life imprisonment and 15 strokes of the cane in November of that year. On 22 August 2014, Yong's lawyer appealed the sentence with the argument that caning was unconstitutional. On 4 March 2015, the three-judge [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore) dismissed the appeal. - 30 June: Nineteen-year-old [Felicia Teo Wei Ling](/wiki/Felicia_Teo_Wei_Ling), a student at [Lasalle College of the Arts](/wiki/Lasalle_College_of_the_Arts), was last seen near a friend's flat in [Marine Parade](/wiki/Marine_Parade) before she was reported missing on 3 July 2007. The case was transferred in mid-2020 to the [Criminal Investigation Department](/wiki/Criminal_Investigation_Department_(Singapore)), which found that Teo had been killed by two schoolmates who lived near where she was last seen. One, 35-year-old Ahmad Danial bin Mohamed Rafa'ee, was arrested and charged with murder in December 2020. The other, 32-year-old Ragil Putra Setia Sukmarahjana, was not in Singapore when Ahmad was arrested and remained at large as of 2022[update]. Ahmad was granted a discharge not amounting to acquittal on 27 June 2022 for Teo's murder but served 26 months in prison for disposal of Teo's corpse, misappropriating Teo's belongings and falsifying his 2007 statements to the police. - 1 July: - 16-year-old Muhammad Nasir bin Abdul Aziz was ordered by his lover, 24-year-old Aniza binte Essa, to murder her 29-year-old husband [Manap bin Sarlip](/wiki/Murder_of_Manap_Sarlip). In the early morning of 1 July 2007, Nasir stabbed Manap nine times at Block 74 Whampoa Drive. Nasir and Aniza were soon arrested and charged with murder. Aniza initially faced the death penalty for abetting murder, but the charge was reduced to abetment of [culpable homicide](/wiki/Culpable_homicide) not amounting to murder because she had a mental condition at the time of the offence. On 28 April 2008, she was sentenced to nine years' imprisonment. Nasir pleaded guilty to murder; since he was under 18 at the time of the crime, he was indefinitely detained under [the President's Pleasure](/wiki/The_President%27s_Pleasure_(Singapore)). - Thirty-eight-year-old odd-job worker Tharema Vejayan Govindasamy [murdered](/wiki/Stirling_Road_murder) his 32-year-old ex-wife, Smaelmeeral Abdul Aziz, by throwing her from the 13th floor of an [HDB](/wiki/Housing_and_Development_Board) block in Stirling Road. Two days later, Tharema surrendered and was charged with murder. He was found guilty, and was sentenced to hang on 25 May 2009. - 2 September: Twenty-year-old [national serviceman](/wiki/National_service_in_Singapore) [Dave Teo Ming](/wiki/2007_Singapore_AWOL_incident) went [AWOL](/wiki/Desertion) from [Mandai Hill Camp](/wiki/List_of_Singapore_Armed_Forces_bases) with a [SAR-21 assault rifle](/wiki/SAR-21) and eight [5.56 mm rounds](/wiki/5.56%C3%9745mm_NATO). He wanted to kill Crystal Liew, his girlfriend who broke up with him in April of that year, and five other people. Teo faced several charges under the [Arms Offences Act](/wiki/Arms_Offences_Act). His fellow serviceman, Ong Boon Jun (who was with Teo when he had the weapons), was also charged under the Arms Offences Act. An [Institute of Mental Health](/wiki/Institute_of_Mental_Health_(Singapore)) report indicated that he had depression, and snapped after the breakup. On 9 July 2008, Teo was convicted and sentenced to nine years and two months' imprisonment and 18 strokes of the cane. Ong was sentenced to six years and six months in jail and six strokes of the cane for consorting with a person in unlawful possession of a firearm. - 4 September: Twenty-nine-year-old [Heng Boon Chai](/wiki/Heng_Boon_Chai) used three knives to stab his 55-year-old uncle, Heng Kim Teck, in [Telok Blangah](/wiki/Telok_Blangah) flat. Heng was charged with attempted murder, which was upgraded to murder after his uncle died in hospital four days later. After psychiatric reports indicated that Heng had [schizophrenia](/wiki/Schizophrenia) at the time of the murder, his charge was reduced to manslaughter and he was sentenced to jail for eight years in August 2008. Released in 2013, he was charged with murdering his neighbour during a 2021 dispute and sentenced to life imprisonment with ten strokes of the cane. - 20 October: Forty-five-year-old bus driver Ong Pang Siew strangled his 15-year-old Chinese stepdaughter, [Pan Hui](/wiki/Pan_Hui_(murder_victim)) (also known as Ong Pan Hui), after an argument in a [Marsiling](/wiki/Marsiling) flat. Ong was divorced from his wife (Pan's birth mother), with whom he also had one son. Charged with murder, he was sentenced to death in March 2009. His conviction was reduced to manslaughter on appeal in November 2010, and his sentence was reduced to ten years’ imprisonment the following May. ## 2008 - 17 February: [Kho Jabing](/wiki/Kho_Jabing) and [Galing Anak Kujat](/wiki/Galing_Kujat), two Malaysians working in Singapore, robbed two Chinese nationals in [Geylang](/wiki/Geylang). One, 40-year-old Cao Ruyin, was severely beaten on the head by Kho and died six days later. Kho and Galing were found guilty of murder and sentenced to death in 2010. After a 2011 appeal, Galing's conviction was reduced to robbery with hurt and his sentence was reduced to 18+1⁄2 years and 19 strokes of the cane. Kho's death sentence was commuted to life imprisonment and 24 strokes of the cane after an August 2013 appeal and re-trial. The prosecution appealed the life sentence, and Kho was re-sentenced to death in 2015; he was hanged on 20 May 2016. - 27 February: [Jemaah Islamiyah](/wiki/Jemaah_Islamiyah) terrorist [Mas Selamat bin Kastari](/wiki/Mas_Selamat_Kastari) escaped from the Whitley Road Detention Centre. He fled Singapore for Malaysia with a handmade floatation device on 3 March, and hid in [Skudai](/wiki/Skudai) before he was arrested by Malaysian police on 1 April 2009. He was repatriated to Singapore on 24 September 2010, and was detained indefinitely under the [Internal Security Act](/wiki/Internal_Security_Act_(Singapore)). - 27 April – 10 June: Forty-seven-year-old [Bala Kuppusamy](/wiki/Bala_Kuppusamy) robbed seven women, aged 16 to 34, over a two-month period; he raped four. Arrested on 30 June 2008, he was charged with rape, robbery with hurt and aggravated molestation, and other charges. Bala had been convicted of rape in 1987 and 1993; he was sentenced to 11 years' imprisonment and 24 strokes of the cane in 1987, and 23 years' imprisonment and 24 strokes of the cane in 1993. On 4 March 2009, he was sentenced to 42 years' imprisonment and 24 strokes of the cane. - 16 June: Twenty-four-year-old [Cheong Chun Yin](/wiki/Cheong_Chun_Yin), a native of [Perak](/wiki/Perak), was caught after he passed a bag filled with at least 2.7 kilograms (6.0 lb) of heroin to 54-year-old accomplice [Pang Siew Fum](/wiki/Pang_Siew_Fum). Cheong and Pang were found guilty of drug trafficking, sentenced to death by hanging in 2010, and lost their appeals. After legislative changes in 2013, Cheong was certified as a drug courier and re-sentenced to life imprisonment with 15 strokes of the cane on 20 April 2015. Although Pang was not a certified drug mule, her death sentence was also commuted to life imprisonment due to depression at the time of her crime. - 28 June: At the [Paya Lebar](/wiki/Paya_Lebar) home of opposition politician [Tan Lead Shake](/wiki/Tan_Lead_Shake), his 25-year-old wife [Wu Yun Yun](/wiki/Wu_Yun_Yun) stabbed her brother-in-law Tan Lead Sane to death. Tan's 35-year-old wife, Huang Mei Zhe, was stabbed in the neck twice but survived; Tan's mother was also injured. Wu, arrested seven hours later, was charged with murdering Tan and trying to murder Huang. Wu was later found to have depression and her charges of murder and attempted murder were reduced to culpable homicide not amounting to murder and attempted culpable homicide, respectively, in November 2008. Wu pleaded guilty in April 2009, and was sentenced to 16 years in jail on 17 November 2009. - 7 July: At a power substation near [Ang Mo Kio West Garden](/wiki/Ang_Mo_Kio), 22-year-old Pathip Selvan s/o Sugumaran stabbed his 18-year-old girlfriend and kindergarten teacher [Jeevitha d/o Panippan](/wiki/Murder_of_Jeevitha_Panippan) to death out of jealousy. Pathip fled to Malaysia before surrendering, and was charged with murder three days after the crime. On 12 November 2010, Pathip was found guilty and sentenced to death, but on appeal, he was found not guilty of murder. On 15 August 2012, Pathip's death sentence was set aside and he was sentenced to 20 years' imprisonment for culpable homicide not amounting to murder. - 3 September: At a hotel in Geylang, 21-year-old [Radika Devi Thayagarajah](/wiki/Murder_of_Radika_Devi_Thayagarajah) (a Sri Lankan sex worker who was seven months pregnant) was strangled to death by 19-year-old client and Indian national Madhuri Jaya Chandra Reddy during an argument about payment. Reddy stole Devi's phone and other belongings, and disposed of the rest. He hid her body under the bed, and continued using the hotel room with another sex worker. Devi's body was found more than 30 hours after the murder, and Reddy was arrested 22 hours later at his dormitory in [Lim Chu Kang](/wiki/Lim_Chu_Kang). Originally charged with murder, Reddy pleaded guilty to culpable homicide not amounting to murder (manslaughter) and was sentenced to 17 years in jail and 12 strokes of the cane. - 19 September: Forty-two-year-old Chinese national Wang Zhijian [killed](/wiki/Yishun_triple_murders) his 41-year-old lover Zhang Meng, 17-year-old Feng Jianyu (Zhang's daughter), and 36-year-old Yang Jie (Zhang's flatmate) in Zhang's [Yishun](/wiki/Yishun) flat; he also tried to kill Yang's 15-year-old daughter, but the daughter survived. Wang was arrested the following day and charged with three counts of murder. On 30 November 2012, he was sentenced to death for Yang's murder of after a successful defence of [diminished responsibility](/wiki/Diminished_responsibility) for the other two charges. On 30 November 2014, Wang's appeal of the death sentence was turned down; the prosecution's appeal found Wang guilty of all three murders, and he was hanged. - 20 October: The decomposed body of 47-year-old [Choo Xue Ying](/wiki/Murder_of_Choo_Xue_Ying) was found in [Bukit Batok Nature Park](/wiki/Bukit_Batok_Nature_Park). Police traced Choo's phone to 48-year-old Rosli Bin Yassin and his 35-year-old Indonesian girlfriend, Jelly, and arrested them. Rosli admitted assaulting Choo during an argument in her car in the park and abandoning her after she lost consciousness, thinking that she was still alive. On 11 May 2012, Rosli (who had previous convictions for theft, cheating, forgery and criminal breach of trust) was sentenced to 12 years' preventive detention for cheating and [culpable homicide](/wiki/Culpable_homicide) not amounting to murder. After the prosecution appealed, his sentence was increased to 20 years' preventive detention in March 2013. Jelly, charged with cheating and overstaying her visa, was sentenced to 36 months' imprisonment and fined S$3,000 and was deported upon her release from prison. ## 2009 - 11 April: 29-year-old Chinese national Wang Wenfeng tried to rob a taxi driver, 57-year-old [Yuen Swee Hong](/wiki/Murder_of_Yuen_Swee_Hong), after flagging him down and telling him to drive to a secluded spot in [Sembawang](/wiki/Sembawang). Wang fatally stabbed Yuen, abandoning him in a nearby forested area before driving the taxi to a multi-storey [Sembawang](/wiki/Sembawang) car park and cleaning the bloodstains. He then called Yuen's wife, Chan Oi Lin, saying that he kidnapped her husband and demanding a ransom. Chan and her son contacted police, who arrested Wang two days later. On 17 April, he led police to Yuen's body. In September 2011, Wang was found guilty of murder and sentenced to death. When legal changes were enacted in January 2013, Wang applied for re-sentencing. In November of that year, he was re-sentenced to life imprisonment and 24 strokes of the cane following his defence that he only wanted to rob Yuen. Wang's life sentence has the possibility of parole after 20 years. - 22 April: 20-year-old [Nagaenthran K. Dharmalingam](/wiki/Nagaenthran_K._Dharmalingam) was arrested for trafficking 42.72 grams (1.507 oz) of heroin while entering Singapore from Malaysia at Woodlands Checkpoint. He admitted the crime, but said that he was ordered to commit it by a mastermind who assaulted him and threatened to kill his girlfriend, and that he did so to get money to pay off his debts. Nagaenthran was convicted and sentenced to death in 2010. When changes to the law took effect in January 2013, he applied for re-sentencing but he lost his appeals in 2019. Local and international calls to the government were made for clemency based on Nagaenthran's reported intellectual disability. After several delays, his appeal was dismissed on 29 March 2022 and he was hanged on 27 April of that year. - [Capital punishment in Singapore](/wiki/Capital_punishment_in_Singapore) - [Life imprisonment in Singapore](/wiki/Life_imprisonment_in_Singapore) - [List of major crimes in Singapore](/wiki/List_of_major_crimes_in_Singapore)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:25:17.611050",
  "title": "List of major crimes in Singapore (2000–2009)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/List_of_major_crimes_in_Singapore_(2000%E2%80%932009)"
}