{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:25:43.987879"
  },
  "content": "This is a **list of [prizes](/wiki/Prize), [medals](/wiki/Medal) and [awards](/wiki/Award)** including cups, [trophies](/wiki/Trophy), bowls, [badges](/wiki/Badge), [state decorations](/wiki/State_decoration) etc., awarded in [Singapore](/wiki/Singapore). ## National honours, [military](/wiki/Armed_force) and [patriotic](/wiki/Patriotism) medals - National Day Awards: [Singaporean orders and decorations](/wiki/Singaporean_orders_and_decorations) - [Awards and decorations of the Singapore Armed Forces](/wiki/Awards_and_decorations_of_the_Singapore_Armed_Forces) - [Awards and decorations of the Singapore Police Force](/wiki/Awards_and_decorations_of_the_Singapore_Police_Force) ## [Science](/wiki/Science), [mathematics](/wiki/Mathematics), [technology](/wiki/Technology) - Defence Science Award - President's Science and Technology Awards - Tan Kah Kee Young Inventors' Award - ThinkQuest Junior Awards (defunct from 2013) - Singapore Computer Society IT Leader Awards ## [Arts](/wiki/Art), heritage and entertainment ### [Art](/wiki/Art) - [Cultural Medallion](/wiki/Cultural_Medallion) - DBS Life! Theatre Awards - National Arts Education Award - Patron of the Arts Award - [Young Artist Award](/wiki/Singapore_Young_Artist_Award) ### Heritage - Patron of Heritage Awards ### Beauty - Miss Singapore Chinatown - [Miss Singapore Universe](/wiki/Miss_Singapore_Universe) - Miss World (Singapore) ### [Film](/wiki/Film) - [Silver Screen Awards](/wiki/Silver_Screen_Awards) - [Singapore Short Film Awards](/wiki/Singapore_Short_Film_Awards) ### [Journalism](/wiki/Journalism) - ACCA Singapore Environmental and Social Reporting Awards ### [Literature](/wiki/Literature) - Golden Point Award - Singapore Chinese Literature Award - [Singapore Literature Prize](/wiki/Singapore_Literature_Prize) - Singapore Student Literary Award ### [Music](/wiki/Music) - Singapore Hit Awards ### [Radio](/wiki/Radio) - [Singapore Radio Awards](/wiki/Singapore_Radio_Awards) ### [Television](/wiki/Television) - [Star Awards](/wiki/Star_Awards) ## [Architecture](/wiki/Architecture) and construction - Asia Responsible Corporate Awards - BEI Asia Awards - Construction Excellence Awards - SIA-ICI Colour Dulux Award - URA Architectural Heritage Award ## [Business](/wiki/Business) and [management](/wiki/Management) - Enterprise 50 Awards - established in 1995, recognises local, privately held companies who have contributed to economic development in Singapore and abroad. - Singapore Enterprise Medal of Honour -By Singapore Enterprise Association (SEA) - British Chamber of Commerce Annual Business Awards - 8 categories across industries, and special recognition for Small businesses - Top Entrepreneur Awards - Asia Pacific Entrepreneurship Awards - [Ernst & Young Entrepreneur of the Year Award](/wiki/Ernst_%26_Young_Entrepreneur_of_the_Year_Award) - One Asia Awards - Asia Responsible Entrepreneurship Awards - International Management Action Award - The NORNS Awards - Excellence and Innovation Worldwide. - National Innovation and Quality Circles Award - People Excellence Award - Singapore Brand Award - Rotary ASME Entrepreneur of the Year Award - Singapore Business Awards - Businessman of the Year Award - Enterprise Award - Outstanding Chief Executive Award - Singapore Innovation Award - Singapore Quality Award for Business Excellence - Singapore Tourism Award ## [Education](/wiki/Education) - National Arts Education Award - National Young Leader Award - Outstanding Youth in Education Award - Special Academic Awards - Prime Minister's Book Prize - Lee Kuan Yew Award for Mathematics and Science - Lee Kuan Yew Scholarship to Encourage Upgrading (LKY-STEP Award) - Masterplan of Awards - School Excellence Award - School Distinction Award - Best Practice Award - Sustained Achievement Award - Lee Kuan Yew National Education Award - Outstanding Development Award - Top 25 in school award - [Academic achievement](/wiki/Academic_achievement) - Edusave Merit Bursary ## [Humanitarianism](/wiki/Humanitarianism) - President's Social Service Award ## [Sports](/wiki/Sport) and [Games](/wiki/Game) - Singapore Sports Awards ## General achievement - Excellent Service Award (EXSA), a national award that recognises individuals who have delivered outstanding service. It seeks to develop service models for staff to emulate, create service champions and professionalise services, managed by SPRING Singapore\n",
  "language": "en",
  "processed_at": "2026-01-12T11:25:43.987448",
  "title": "List of prizes, medals, and awards in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/List_of_prizes,_medals,_and_awards_in_Singapore"
}