{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:22:51.464058"
  },
  "content": "* *This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **may be in need of reorganization to comply with Wikipedia's layout guidelines**. Please help by editing the article to make improvements to the overall structure. *(August 2020)* *(Learn how and when to remove this message)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"List of LGBTQ organisations in Singapore\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(June 2021)* *(Learn how and when to remove this message)*This article includes a list of general references, but **it lacks sufficient corresponding inline citations**. Please help to improve this article by introducing more precise citations. *(June 2021)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)*Part of a series on[LGBTQ organizations](/wiki/List_of_LGBTQ-related_organizations_and_conferences)By country or region - [Singapore](/wiki/List_of_LGBT_organisations_in_Singapore) [LGBTQ rights](/wiki/List_of_LGBTQ_rights_organizations) - [Bisexual organizations and conferences](/wiki/List_of_bisexuality-related_organizations_and_conferences) - [Transgender rights](/wiki/List_of_transgender-rights_organizations) - [In the United States](/wiki/List_of_LGBTQ_rights_organizations_in_the_United_States) [Medical](/wiki/List_of_LGBTQ_medical_organizations) [Political party affiliates](/wiki/LGBTQ_wing) Religious [Student](/wiki/LGBTQ_student_movement) - [Student center](/wiki/LGBTQ_student_center) - [LGBTQ and LGBTQ-friendly fraternities and sororities](/wiki/List_of_LGBTQ_and_LGBTQ-friendly_fraternities_and_sororities) [Military and veterans](/wiki/List_of_LGBT_military_and_veteran_organizations) [Community centers](/wiki/LGBTQ_community_centre) - [Community centers in the US](/wiki/List_of_LGBTQ_community_centers_in_the_United_States) - v - t - e **List of LGBT Organisations in Singapore** contain a summary of [LGBT rights organizations](/wiki/LGBT_rights_organization) in [Singapore](/wiki/Singapore). There are many online and offline groups dedicated to providing support for the queer community within Singapore. While [LGBT rights in Singapore](/wiki/LGBT_rights_in_Singapore) still face challenges, support groups have grown in popularity, and attitudes towards the LGBT community are becoming more tolerant, particularly among the younger population. ## Active groups ### Groups active both online and offline - [Pink Dot SG](/wiki/Pink_Dot_SG) - Pink Dot SG is the most visible and well-known event of the LGBT movement in Singapore, and it has inspired similar movements around the world. A public event that brings together Singaporeans who support the freedom to love, it is attended by both straight and LGBT people and widely reported in local and international media. The first Pink Dot was held in 2009 and drew 2,500 people. 4,000 turned out the following year, and in 2011, the number more than doubled to 10,000. In 2012, over 15,000 people attended the first Pink Dot at night. - [Oogachaga](/wiki/Oogachaga)- This organization provides professional training, counseling, support groups, and a helpline through email and WhatsApp. The WhatsApp helpline serves Singapore and neighboring countries inckuding Indonesia, Brunei, and Malaysia. ### Groups active online only - [Dear Straight People](/wiki/Dear_Straight_People) - Founded by [Sean Foo](/wiki/Sean_Foo), Dear Straight People has gained prominence as one of Asia's leading LGBT publications. - [Herstory](/wiki/Herstory) - a website for girls which organises real-world events like the annual Butch Hunt and Femme Quest contests. Other social activities include Grrrls Night Out parties, various sports and dance classes. ### Disbanded/inactive groups - [People Like Us 3](/wiki/People_Like_Us_3) (PLU3) - The first and still the main gay-equality advocacy group in Singapore, started in 1993 by Joseph Lo and later joined by activists [Alex Au](/wiki/Alex_Au) and Russell Heng. - SGButterfly - Singapore’s first transgender community portal. ### Groups formerly active both online and offline - Friends Like Us (F.L.US, pronounced \"flas\") - an LGBT social enterprise which aspires to be the nexus between business, innovation and community work. They are committed to reaching out to diverse members of LGBT society with the primary objective to better lives through entrepreneurial and other community projects. Net proceeds from their ad hoc activities and events including Dragon Boat racing, inline skating, kayaking, movie outings, a dating club, gatherings and trips, are used to fund community service initiatives including their Caresports, Careout and Carefund programmes. - [Young Out Here](/wiki/Young_Out_Here) - Singapore's first and only queer community group catered towards queer youths, unbiased against the lesbian youth community. Their main programme is a support group for queer youths, with a repertoire of several events organised also catering towards queer youths. - [Trevvy](/wiki/Trevvy), formerly known as SgBoy – was set up in March 1999, originally known as \"Singapore Boy Homepage\" before being renamed SgBoy. It is one of the most popular LGBT portals in Singapore. It underwent a makeover, rebranding itself as Trevvy.com in August 2006, shifting its focus to the more mature 25 to 40-year age group of the local gay market and expanding its user base regionally. On 30 April 2021, Trevvy.com announced the closure of its website, due to its dwindling popularity. \"QUEER(IN) SPACES A GUIDE TO LGBTQ+ FRIENDLY SPACES IN SINGAPORE\" (PDF).\n",
  "language": "en",
  "processed_at": "2026-01-12T11:22:51.463501",
  "title": "List of LGBTQ organisations in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/List_of_LGBTQ_organisations_in_Singapore"
}