{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:23:19.665911"
  },
  "content": "This article lists and documents Singaporean documentaries on [LGBT](/wiki/LGBT) issues in that country. ## Background [LGBT rights](/wiki/LGBT_rights_in_Singapore) and [culture](/wiki/Homosexuality_in_Singapore) in the [Republic of Singapore](/wiki/Republic_of_Singapore) are a controversial topic, due to the country's history of [homophobia](/wiki/Homophobia). Over the years, Singapore has taken steps to open up to [gender equality](/wiki/Gender_equality), however the issue of LGBT rights and culture in Singapore is a taboo subject for the Singaporean media. ## List ### *Crunch Time* It was only in May 2003 that the very first locally produced television documentary dealing with homosexuality as its main subject was broadcast on Singaporean airwaves. It was a [homophobic](/wiki/Homophobic), 30-minute episode in a [Mandarin](/wiki/Mandarin_Chinese)-language series called *Crunch Time 2* shown on [Channel U](/wiki/Channel_U_(Singaporean_TV_channel)), a television station owned by [Singapore Press Holdings](/wiki/Singapore_Press_Holdings). The series was advertised in *[The Straits Times](/wiki/The_Straits_Times)* which promoted it as one that featured the turning points in the lives of 12 people including a [loan shark](/wiki/Loan_shark), an unwed mother and a drug addict. The particular program featured actors re-enacting the supposedly true-life account of a young, masculine gay Singaporean man cruising for sex in public swimming pools and toilets. It reinforced the misconception that homosexuality resulted from having an unhappy home, parents who constantly fight, and being sexually abused. In this case, the protagonist was only 6 years old when he was asked by an adult female to perform sexual acts with a girl his age. The episode wound up with an interview with a spokesman from [Choices](/wiki/Choices), a [Christian](/wiki/Christianity) counselling group from the [Church of our Saviour](/wiki/Church_of_Our_Saviour,_Singapore) (COOS) in [Queenstown](/wiki/Queenstown,_Singapore) which helps \"straighten\" out gay lives, which was the eventual outcome for the gay man in the story. He was depicted as having been \"successfully'\" converted through counselling from a dissatisfied, unfulfilled homosexual to a man happily married to a female spouse and producing a son. The negative and stereotypical depiction of homosexuality in the program prompted an online petition which garnered more than 200 signatories over the ensuing weekend. It probably had a significant effect as the episode was the last time a homophobic documentary was aired in Singapore. However, the overwhelmingly influential factor in ending televised [homophobia](/wiki/Homophobia) was Prime Minister [Goh Chok Tong](/wiki/Goh_Chok_Tong)'s statements in *[Time magazine](/wiki/Time_magazine)* in July 2003 about reversing anti-gay hiring policies in the Civil Service. - Read a video storyboard of the documentary: - View a compressed video of the original broadcast: ### *OK, No Problem* In a 180-degree turnaround just 2 months after the above documentary, which aimed to encourage homosexuals to turn straight, Channel U aired a groundbreaking episode in the info-tainment hands-on series *OK, No Problem* at 7:30 p.m. on 30 July 2003. This time, it sought instead to educate the public that one could not judge a man's sexual orientation merely from his external appearance and to foster understanding and acceptance of homosexuals. Popular compère Chuan Yi Fong was filmed in a [hawker centre](/wiki/Hawker_centre) in [Ang Mo Kio](/wiki/Ang_Mo_Kio) where she asked random diners about their opinions on homosexuality. A range of positive and negative views were offered. A live telephone interview with Dr. Tan Chong Kee, who was introduced as having written a thesis on homosexuality in [Taiwan](/wiki/Taiwan), was interpolated during a voting session by onlookers. The latter were asked to pick which, amongst 3 chosen men, they thought were gay, judging from externalities. After the votes were cast, it was revealed to the audience's surprise that none of the three were gay. In fact, one had brought along his wife and baby son. The highlight of the episode was the appearance of an actual gay man named Anthony who was initially hidden behind a black curtain. After a suspenseful emergence to face a wall of curious onlookers, he spoke emotionally about his own struggles as a homosexual and how he hoped society would accept them. He also publicly thanked Prime Minister [Goh Chok Tong](/wiki/Goh_Chok_Tong) for his recent announcement that openly homosexual individuals would now be employed in the Civil Service. Anthony choked back his tears as he spoke, causing the compère's eyes to also redden, and members of the audience to listen sympathetically. For his courage, Anthony was presented with a bouquet of flowers and received a huge round of applause. - Watch a compressed video of the original broadcast: , and the drama segment preceding it, which dealt with a gay man who experienced discrimination in applying for a job: ### *Detik* Later, on the same night of 30 July 2003 at 8:30 p.m., the [Malay](/wiki/Malay_language)-language channel [Suria](/wiki/MediaCorp_Suria) aired another documentary on homosexuality in its *[Detik](/wiki/Detik)* (meaning \"a second in time\") series. The particular episode was entitled \"Haruskah golongan Homoseksual diterima?\" (Should Homosexuals be accepted?) It featured interviews with a Malay gay man named Helmi and a [Malay](/wiki/Malay_people) lesbian named Zac in which they recounted their self-discovery and personal relationships. People on the street were asked whether they could accept homosexuals and a diverse range of negative to positive opinions were expressed. It revealed to the [Malay](/wiki/Malay_people) community, the presence of websites providing support for [Muslim](/wiki/Muslim) homosexuals. Figures of authority queried for their views included Dr. Francis Ngui (President, Singapore Psychiatric Association) and [Ustaz](/wiki/Ustaz) Fatris Bakaram (Assistant [Mufti](/wiki/Mufti) and Head of the [Mufti](/wiki/Mufti) Office, [Majlis Ugama Islam Singapura](/wiki/Majlis_Ugama_Islam_Singapura), [MUIS](/wiki/Majlis_Ugama_Islam_Singapura) or Singapore Islamic Religious Council). All in all, the programme tried its best to present a balanced view of homosexuality without moralising or injecting any subliminal message. - Read a Malay transcript of the programme with selected video still-frames: - Watch a compressed video of the original broadcast: ### *Inside Out* On 23 February 2005, Mandarin-language [Channel U](/wiki/Channel_U_(Singaporean_TV_channel)) broadcast its third programme dealing with homosexuality in the 'Inside Out' current affairs series. The topic of the episode was \"Do homosexuals have space for their activities?\" This programme was a landmark in that it was the first time that the views of leading gay activists, in this case Eileena Lee and Charles Tan from [People Like Us 3](/wiki/People_Like_Us_3) (PLU3), were given a relatively lengthy airing on primetime television. Artistic co-director [Nelson Chia](/wiki/Nelson_Chia) from Toy Factory Theatre Ensemble, a drama company which had staged several plays with homosexual themes and assisted in producing the episode itself, also presented a pro-gay voice for theatre in particular and society in general. Chia expressed, with great conviction, his disquietude with the contradictions between Singapore's liberalisation drive and the recent curbing of public gay spaces, despite the fact that he himself was a heterosexual family man. An anonymous gay man named \"David\" was also interviewed at length, in which he doubted Singaporeans' general level of acceptance of homosexuals. The programme was thought to have been produced to give an opportunity for the gay community to vent its concerns after an official clampdown on gay parties like [Nation.04](/wiki/Nation.04) and [Snowball](/wiki/Snowball) in 2004, presumably as part of a conservative backlash against the rampant spread of [HIV](/wiki/HIV) infection within the community. In spite of NUS sociologist Associate Professor [Paulin Tay Straughan](/wiki/Paulin_Tay_Straughan)'s assertion in the documentary that homosexuals in Singapore enjoyed almost everything their straight counterparts were entitled to, gay community leaders like [Alex Au](/wiki/Alex_Au) begged to differ. - Watch a compressed video of the original broadcast: - Read [Yawning Bread](/wiki/Yawning_Bread)'s analysis of the documentary: ### *Regardless Of Sexuality* Produced by [CNA](/wiki/CNA_(TV_network)), *Regardless of Sexuality* premiered on national TV on 26 April 2023 at 11pm. It was the first LGBT documentary to air on national television in almost 20 years. Hosted by Senior Minister Of State [Janil Puthucheary](/wiki/Janil_Puthucheary), the documentary gathered LGBT individuals, along with their parents and religious leaders, to share their views on sexuality in Singapore. Notable features in the documentary include gay filmmaker [Sean Foo](/wiki/Sean_Foo) and The [Mufti](/wiki/Mufti) of Singapore, Dr Nazirudin Mohd Nasir. At the 2023 [Asian Academy Creative Awards](/wiki/Asian_Academy_Creative_Awards), *Regardless of Sexuality* won the national award for ‘'Best Documentary Programme (one-off)'’. - International documentaries dealing with homosexuality shown on Singapore cable television:\n",
  "language": "en",
  "processed_at": "2026-01-12T11:23:19.665562",
  "title": "List of Singaporean LGBTQ documentaries",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/List_of_Singaporean_LGBTQ_documentaries"
}