{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:22:35.892925"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"List of Chinese criminal organizations\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(October 2012)* *(Learn how and when to remove this message)* Criminal gangs are found throughout mainland China but are most active in [Chongqing](/wiki/Chongqing), [Shanghai](/wiki/Shanghai), [Macau](/wiki/Macau), [Tianjin](/wiki/Tianjin), [Shenyang](/wiki/Shenyang), and [Guangzhou](/wiki/Guangzhou). Some are also active in [Hong Kong](/wiki/Hong_Kong), [Malaysia](/wiki/Malaysia), [Singapore](/wiki/Singapore) and [Taiwan](/wiki/Taiwan). The number of people involved in [organized crime](/wiki/Organized_crime) on the mainland has risen from around 100,000 in 1986 to around 1.5 million in the year 2000. Since the new century, there are two academic books focusing on Chinese organized crime. Based on rich empirical work, these books offer how Chinese criminal organizations survive in the changing socio-economic and political environment. Y. K. Chu's ***Triads as Business*** looks at the role of Hong Kong Triads in legal, illegal and international markets. Peng Wang's ***The Chinese Mafia*** examines the rise of mainland Chinese organized crime and the political-criminal nexus (collusion between gangs and corrupt police officers) in [reform and opening](/wiki/Reform_and_opening) era of China. ## Triad societies The following is a list of Chinese triad societies: - [14K Group](/wiki/14K_Triad) 十四K - 14K Baai Lo 十四K 湃廬 - 14K Chung 十四K 忠字堆 - 14K Hau 十四K 孝字堆 - 14K Kim 十四K 劍字堆 - 14K Lai 十四K 禮字堆 - 14K Lun 十四K 倫字堆 - 14K Ngai 十四K 毅字堆 - 14K Sat 十四K 實字堆 - 14K Shun 十四K 信字堆 - 14K Tak 十四K 德字堆 - 14K Yan 十四K 仁字堆 - 14K Yee 十四K 義字堆 - 14K Yung 十四K 勇字堆 - 14K Tai Huen Chai 十四K 大圈仔 - Long Zi Group 龙子字頭 - Long Zi Tong 龙子堂 - Long Zi Kongsi 龙子會館 - Long Zi Association 龙子协会 - LZK - [Luen Group](/wiki/Luen_Group) 聯字頭 - Luen Kung Lok 聯公樂 - Luen Lok Tong 聯樂堂(單耳) - Luen Shun Tong 聯順堂 - Luen Ying She 聯英社(老聯) - Luen Fei Ying 聯飛英 - Luen Hung Ying 聯鴻英 - Luen To Ying 聯桃英 - [Wo Group](/wiki/Wo_Group) 和字頭 - [Wo Shing Wo](/wiki/Wo_Shing_Wo) 和勝和 - Wo Shing Yee 和勝義 - [Wo On Lok (Shui Fong)](/wiki/Wo_On_Lok/Shui_Fong) 和安樂(水房) - [Wo Hop To](/wiki/Wo_Hop_To) 和合圖(老和) - Wo Lee Kwan zh-yue:和利羣 - Wo Kao Chi 和九指 - Wo Kwan Lok zh-yue:和羣樂 - Wo Lee Wo 和利和 - Wo Shing Tong 和勝堂 - Wo Yau Wo 和友和 - Wo Yee Tong 和義堂 - Wo Yung Yee 和勇義 - Wo Hung Shing 和洪勝 - Wo Kwan Ying zh-yue:和羣英 - Wo Yat Ping 和一平 - Wo Yee Ping 和二平 - [Ah Kong](/wiki/Ah_Kong) Company 阿公党 - Ang Bin Hoay 昂斌會 - [Ang Soon Tong](/wiki/Ang_Soon_Tong) 洪顺堂 - [Big Circle Gang](/wiki/Big_Circle_Gang) 大圈幫 - [Black Dragons](/wiki/Black_Dragons_(gang)) 黑龍 - Cai Group - [Chongqing group](/wiki/Chongqing_gang_trials) 重慶組 - Chuen Group 全字頭 - Chuen Chi Wo 全志和 - Chuen Yat Chi 全一志(老全) - [Ghee Hin Kongsi](/wiki/Ghee_Hin_Kongsi) 義興公司 - [Green Gang](/wiki/Green_Gang) 青帮 - CP=√169 Gang - [Hai San](/wiki/Hai_San) 海山 - [Ping On](/wiki/Ping_On) 平安 - Rung Group 梯級組 - Shing Group 盛集團 - Sin Ma 仙馬 - [Sio Sam Ong](/wiki/Sio_Sam_Ong) 小三王 - Tung Group 東字頭 - Tung Kung She 東公社 - Tung Kwan She 東群社 - Tung Luen She 東聯社(老東) - Tung On Tong 東安堂 - Tung Ying She 東英社 - Tung On Wo 東安和 - Tung Kwan Ying 東群英 - Tong Group 同字頭 - Tong Kwan Ying 同群英 - Tong Lok 同樂 - Tong San Wo 同新和(老同) - [Jackson Street Boys](/wiki/Jackson_Street_Boys) 積臣街小子 - Kung Lok 功乐 - Kwong Group 廣字頭 - Kwong Hung 廣雄 - Kwong Luen Shing 廣聯盛(老廣) - Kwong Shing 廣盛 - Kwong Sing Tong 廣聲堂 - Yuet Group 粵字頭 - Yuet Kwong 粵廣 - Yuet Tung 粵東 - Ching Group 正字頭 - Ching Lung Tuen 正龍團 - Chiu Chow Group 潮州幫 - Fuk Yee Hing 福義興(老福) - [Sun Yee On](/wiki/Sun_Yee_On) 新義安(老新) - Chiu Kwong She 潮光社 - Chiu Luen Yee 潮聯義 - Chung Chau Yuet 中秋月 - Chung Sun Tong 忠信堂 - Hoi Luk Fung 海陸豐互助社 - King Yee 敬義 - Sam Shing She 三聖社 - Tai Ho Choi 大好彩 - Yat Lo Fat 一路发幫 - Yee Kwan 義群 - Yee Shing Tong 義勝堂 - [Wah Ching](/wiki/Wah_Ching) 華青 - [Wah Kee](/wiki/Wah_Kee) 華記 - Taiwan Gangs 台灣幫派 - [Four Seas Gang](/wiki/Four_Seas_Gang) 四海幫 - [Bamboo Union](/wiki/Bamboo_Union) 竹聯幫 - Tien Tao Meng (Heavenly Way Alliance) 天道盟 - Sung Lien Gang (Pine Union) 松聯幫 - Niu Pu Gang 牛埔幫 - Chi Hsien Gang (Seven Yin Gang) 七賢幫 - Ta hu Gang (Big Lake Gang) 大湖幫 - Hsi Pei Gang (Northwest Gang) 西北幫 - Pei Lien Gang (North Union) 北聯幫 - Sun Kuang Gang (Three Lights) 三光幫 - San Huan Gang (Three Circle) 三環幫 - Fei Ying Gang (Fly Eagle) 飛鷹幫 - Monga Group 艋舺角頭 ## Criminally influenced tongs - Ivan Tong - [Bing Kong Tong](/wiki/Bing_Kong_Tong) - Chang Sing - [Four Brothers](/wiki/Four_Brothers_(tong)) - Ghee Kong Tong 致公堂 - [Hop Sing Tong](/wiki/Hop_Sing_Tong) - [Hip Sing Tong](/wiki/Hip_Sing_Tong) - Hung Mun Tong - Kim Ghee Tong - Long Zii Tong - Pa Hai Tong - Tong Meng Gok - Tong Tran - Tsung Tsin Association - Tung Oon Association - Wing Kong - W Zhang Tong ## Gangs - 21 Boys 廿一仔 - Asian Militants 亞洲進擊 - Black Bugs 黑蟲 - Black Eagles 黑鷹 - [Chung Ching Yee (Joe Boys)](/wiki/Chung_Ching_Yee) 忠精義 - Chung Yee 忠義 - [Continentals](/wiki/Continentals_(gang)) 大陸幣 - Dai Ben (Cookies) 大餅 - Eagle Dragons 龍鷹 - Flying Circle Boys 飛圈仔 - [Flying Dragons](/wiki/Flying_Dragons_(gang)) 飛龍幫 - Fong-Fong Boys 豐芳男 - Fuk Ching 福青 - [Ghost Shadows](/wiki/Ghost_Shadows) 鬼影幫 - Golden Star 金星 - Green Dragons 青龍 - NICKAR CHING 香港仔 - [Hop Sing Boys](/wiki/Hop_Sing_Boys) 合勝仔 - Hung Pho 紅火 - Immortals 神仙 - Kit Jai 傑仔 - Korrupted Boys 男孩 - Liang Shan (Quen Ying) 梁山 - Mo Ming Pai 無名派 - Phoenician Warriors - Ping Boys 平仔 - Raiders 攻略 - Red Dragon - Red Sun 紅陽 - [Salakau](/wiki/Salakau) 369 - Seven Stars 七星 - Sing Wa 興華 - [Snakehead (gang)](/wiki/Snakehead_(gang)) 蛇頭 - Suey Sing Boys 萃勝仔 - Taiwan Boys 台灣仔 - Thien Long Boyz 天龍 - Tung On 東安幫 - Viet Ching 越青 - White Dragons 白龍 - White Eagles 白鷹 - [White Tigers](/wiki/White_Tigers_(gang)) 白虎 - Yau Lai 友利 ## Currently active groups in mainland China - [Snakehead (gang)](/wiki/Snakehead_(gang)) - [14K (triad)](/wiki/14K_(triad)) - [Wo Shing Wo](/wiki/Wo_Shing_Wo) - [Shui Fong](/wiki/Shui_Fong) - [Big Circle Gang](/wiki/Big_Circle_Gang) - [Sun Yee On](/wiki/Sun_Yee_On) - [List of criminal enterprises, gangs and syndicates](/wiki/List_of_criminal_enterprises,_gangs_and_syndicates) - [Organized crime in Taiwan](/wiki/Organized_crime_in_Taiwan) - [Secret societies in Singapore](/wiki/Secret_societies_in_Singapore) - [Tiandihui](/wiki/Tiandihui) ## Notes - Chu, Y. K. (2002). The triads as business. Routledge. - Ko-lin Chin.*Chinatown Gangs: Extortion, Enterprise, and Ethnicity*. Oxford University Press, 2000. - Peter Huston. *Tongs, Gangs, and Triads: Chinese Crime Groups in North America* (1995) - Lo, T. W. (2010). Beyond Social Capital: Triad Organized Crime in Hong Kong and China. British Journal of Criminology, 50(5), 851–872. - Wang, Peng. \"The Increasing Threat of Chinese Organised Crime: national, regional and international perspectives\", The RUSI Journal Vol. 158, No.4, (2013), pp. 6–18. - Wang, Peng (2017). The Chinese Mafia: Organized Crime, Corruption, and Extra-Legal Protection. Oxford: Oxford University Press. - Q&A for tourists on triads in Hong Kong - SF Weekly Feature Article Profiling Member of Hop Sing Tong -- Raymond \"Shrimp Boy\" Chow (2007) - An essay about Triads - *Asian Gang Sweep 2 Chinatown biz bigs busted*. Pete Bowles. *Newsday*. 12/10/1993. - Asian Organized Crime Groups - Chinese - Tongs and Street Gangs - SF Weekly Feature Article Profiling Member of Hop Sing Tong -- Raymond \"Shrimp Boy\" Chow (2007) - Tongs, Encyclopedia of Chicago - Phoenix TV Special Coverage\n",
  "language": "en",
  "processed_at": "2026-01-12T11:22:35.892184",
  "title": "List of Chinese criminal organizations",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/List_of_Chinese_criminal_organizations"
}