{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:26:26.303795"
  },
  "content": "Subzone of Rochor Planning Area in Singapore **Little India** ([Tamil](/wiki/Tamil_language): லிட்டில் இந்தியா) is an [ethnic enclave](/wiki/Ethnic_enclave) in [Singapore](/wiki/Singapore) located east of the [Singapore River](/wiki/Singapore_River), across from [Chinatown](/wiki/Chinatown,_Singapore), and north of [Kampong Glam](/wiki/Kampong_Glam). Little India is commonly known as *Tekka* among the [Indian Singaporean](/wiki/Indian_Singaporean) community. The [precinct](/wiki/Neighborhood) is notable for its markets, including the [Tekka Market](/wiki/Tekka_Centre), and the festivals it hosts throughout the year, such as [Deepavali](/wiki/Diwali) and [Thaipusam](/wiki/Thaipusam). ## History Little India was initially a [district](/wiki/District) used by [Europeans](/wiki/Ethnic_groups_in_Europe) for cattle trading, where [Indian](/wiki/Indian_people) migrant workers found jobs, specializing in cattle rearing. Its location along the [Serangoon River](/wiki/Serangoon_River) provided good conditions for raising livestock, resulting in the growth of that industry. Eventually, the swamps were drained, and the European cattle farmers and traders moved out. Many of the cattle rearing migrant workers stayed, and the neighborhood became predominantly inhabited by South Asians, namely people of Indian descent. The [Tamil Muslims](/wiki/Tamil_Muslim), also known as Chulias, were among the earliest groups of Indian traders who arrived, engaging in commerce and various occupations, including infrastructure construction and serving in colonial positions. Little India was officially gazetted as a conservation area on 7 July 1989, with subsequent conservation of additional buildings along Desker Road, Syed Alwi Road, and Jalan Besar occurring over the following decades. ### 2013 Little India riot On 8 December 2013, a fatal accident occurred at [SST](/wiki/Singapore_Standard_Time) 21:23 at the junction of Race Course Road and Hampshire Road. Sakthivel Kumarvelu, a 33-year-old Indian construction worker, was run over by a private bus, which was to transport migrant workers to their dormitories, and was killed. While emergency vehicles arrived at the accident, the migrant workers started a riot over the accident. Twenty-five emergency vehicles were damaged in the riots, alongside five that were set on fire. Video footage uploaded on the Internet shows rioters pushing police cars on their sides and setting an ambulance on fire. 39 police, four civil defence and auxiliary officers were injured. There were an estimated 300 rioters while the [Singapore Police Force](/wiki/Singapore_Police_Force) dispatched 300 riot police. 27 arrests were made in relation to the riots where 24 were migrant labourers from India. Nine more labourers from [Tamil Nadu](/wiki/Tamil_Nadu) were also arrested for their involvement in the riot with a total 33 workers who were eventually charged. In addition, 53 workers were deported for offences ranging from obstructing the police to failing to follow police orders to disperse, while 200 workers received formal advisories to obey the law. The riot eventually led to the implementation of a new law, the [Liquor Control (Supply and Consumption) Act](/wiki/Liquor_Control_(Supply_and_Consumption)_Act_2015) in 2015 banning consumption of alcohol in all public places from 10:30 pm to 7 am. This also included banning the sales of alcohol products such as Rum and Raisin ice cream between the time periods, which was lifted in 2019. ## Culture Under the Singapore government's policy of racial integration, Little India is deemed as a historical landmark. Many Indian businesses and [cottage industries](/wiki/Cottage_industries) remain concentrated in Little India for the purpose of preserving cultural heritage. However, Little India is not the only zone in Singapore with a significant South Asian population, and Indian-dominant commercial zones can also be found in various [Housing and Development Board](/wiki/Housing_and_Development_Board) estates. Little India is also home to [Chinese Clan Associations](/wiki/Singapore_Federation_of_Chinese_Clan_Associations), places of worship for various religions, and a range of businesses, including those selling electrical supplies, hardware, second-hand goods, and traditional items such as spice grinders and groceries. ## Amenities Along Serangoon Road are the [Tekka Centre](/wiki/Tekka_Centre), the [Tekka Mall](/wiki/Tekka_Mall), the Little India Arcade, Serangoon Plaza, and the [Mustafa Centre](/wiki/Mustafa_Centre) (on a side road). [Farrer Park Fields](/wiki/Farrer_Park_Field) is located in the district. Little India is also home to several art houses. In 1985, the [National Arts Council](/wiki/National_Arts_Council,_Singapore) launched the Arts Housing Scheme, aimed at identifying and renovating old buildings for arts and cultural activities. A line of shophouses along Kerbau Road were designated for the project, and the area is currently known as the Little India Arts Belt. As of 2011, there are seven arts organizations in the Belt. Three are contemporary theatre companies, while the other organizations involve traditional arts such as Malay dance and Indian theatre. ### Places of worship #### Churches - [Foochow](/wiki/Foochow) Methodist Church - [Kampong Kapor Methodist Church](/wiki/Kampong_Kapor_Methodist_Church) (completed in 1929) #### Temples - The [Sakya Muni Buddha Gaya Temple](/wiki/Sakya_Muni_Buddha_Gaya_Temple), along Racecourse Road, was established by a [Thai monk](/wiki/Bhikkhu), Venerable Vutthisasara, in 1927. - Leong San See Temple was built in 1917 and is dedicated to [Guanyin, Bodhisattva of Compassion](/wiki/Kuan_Yin). - Far Kor Sun [Monkey](/wiki/Monkey) God Temple #### Hindu temples - [Sri Veeramakaliamman Temple](/wiki/Sri_Veeramakaliamman_Temple) - [Sri Vadapathira Kaliamman Temple](/wiki/Sri_Vadapathira_Kaliamman_Temple) #### Mosques - [Angullia Mosque](/wiki/Masjid_Angullia) - Jalan Mosque ## Notable places - [House of Tan Teng Niah](/wiki/House_of_Tan_Teng_Niah) ## Transport Serangoon Road is the main commercial thoroughfare in Little India. It intersects Rochor Canal Road and [Bukit Timah](/wiki/Bukit_Timah) Sungei Road. The area is served by the [MRT](/wiki/MRT_(Singapore)) on the [North East line](/wiki/North_East_Line) (at [Little India](/wiki/Little_India_MRT_station) and [Farrer Park](/wiki/Farrer_Park_MRT_station)) and [Downtown line](/wiki/Downtown_Line) (at [Rochor](/wiki/Rochor_MRT_station) and [Jalan Besar](/wiki/Jalan_Besar_MRT_station)). [Bus services](/wiki/Bus_Services_in_Singapore) 23, 64, 65, 67, 131, 139, 147, and 857 pass through Little India via Serangoon Road. ## Gallery - [Collapse of Hotel New World](/wiki/Collapse_of_Hotel_New_World) - [City Square Mall](/wiki/City_Square_Mall) - [Jalan Besar](/wiki/Jalan_Besar) - [New World Amusement Park](/wiki/New_World_Amusement_Park) - [The Verge, Singapore](/wiki/The_Verge,_Singapore) - [Singapore](/wiki/Singapore) - [Changi Airport](/wiki/Changi_Airport) - [Lavender](/wiki/Lavender,_Singapore) - Little India, Singapore travel guide from Wikivoyage\n",
  "language": "en",
  "processed_at": "2026-01-12T11:26:26.303367",
  "title": "Little India, Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Little_India,_Singapore"
}