{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:26:28.209726"
  },
  "content": "Nickname used in reference to Singapore \"**Little red dot**\", also known as \"**The Red Dot**\", is a [nickname](/wiki/Nickname) often used in the media and in casual conversation to refer to [Singapore](/wiki/Singapore). It refers to how the nation is depicted on many maps of Asia and the world as a red dot. The sovereign country and [city-state](/wiki/City-state), comprising the [main island](/wiki/Singapore_Island) and [all its islets](/wiki/List_of_islands_of_Singapore), has a total land area of approximately 750 square kilometres (290 sq mi; 190,000 acres) and is much smaller than its [Southeast Asian](/wiki/Southeast_Asian) neighbours. Initially used as a [pejorative](/wiki/Pejorative) by other countries to refer to Singapore, the term was quickly adopted and [reappropriated](/wiki/Reappropriated) by Singaporean politicians and citizens with pride as a sense of the nation's prosperity and success despite its physical limitations. In 2015, Singapore celebrated its [Golden Jubilee](/wiki/Golden_Jubilee), the 50th anniversary of its [independence](/wiki/History_of_the_Republic_of_Singapore#Independence_from_Malaysia), with the term \"SG50\" depicted inside a red dot. ## Origin and subsequent developments The term \"little red dot\" gained currency after the third Indonesian [president](/wiki/President_of_Indonesia), [B. J. Habibie](/wiki/B._J._Habibie), was regarded as having criticized Singapore in an article published in the *[Asian Wall Street Journal](/wiki/The_Wall_Street_Journal_Asia)* on 4 August 1998. It was reported that Habibie had remarked that he did not feel that Singapore was a friend and had pointed to a map, saying: \"It's O.K. with me, but there are 211 million people [in Indonesia]. Look at that map. All the green [area] is Indonesia. And that red dot is Singapore. Look at that.\" The remark was seen as a dismissal of Singapore, having referred to the country in a disparaging manner. Then-[Prime Minister of Singapore](/wiki/Prime_Minister_of_Singapore) [Goh Chok Tong](/wiki/Goh_Chok_Tong) responded in his [National Day Rally Speech](/wiki/Singapore_National_Day_rally) on 23 August 1998. Goh called the effect of the [1997 Asian financial crisis](/wiki/1997_Asian_financial_crisis) on Indonesia a \"major tragedy\", noting that the [rupiah](/wiki/Rupiah) was worth only a fifth of what it had been against the [US dollar](/wiki/United_States_dollar) in June 1997. Other things mentioned by Goh include that the banking system had almost collapsed, the economy was expected to contract by 15% in 1998, and that riots had taken place in the country in May 1998, mostly targeting [Chinese Indonesians](/wiki/Chinese_Indonesian). He then said, \"Singapore will help Indonesia within the limits of our ability. We are a small economy. ... After all we are only three million people. Just a little red dot on the map. Where is the capacity to help 211 million people?\" Reflecting on Habibie's remarks at a conference on 3 May 2003, then-[Deputy Prime Minister](/wiki/Deputy_Prime_Minister_of_Singapore) [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) said: \"This [Habibie's remark] was a vivid and valuable reminder that we are indeed very small and very vulnerable. The little red dot has entered the psyche of every [Singaporean](/wiki/Singaporeans), and become a permanent part of our vocabulary, for which we are grateful.\" On 19 September 2006, Habibie explained to reporters that far from dismissing Singapore in 1998, he had meant to highlight Singapore's achievements despite its small size. He said he had remarked while speaking off-the-cuff with members of an Indonesian youth group and trying to \"give them spirit\". He said that he had told them: \"If you look at the map of Southeast Asia, you [Indonesia] are so big, and Singapore is just a dot. But if you come to Singapore, you see people with vision.\" He also claimed that \"I have corrected [myself] many times, but they have never put it [*[sic](/wiki/Sic)*]. And I could not prove it in writing because I was talking freely.\" ## Popular usage The term \"little red dot\" has come to be used by both Singaporean politicians and ordinary citizens with pride and with a sense of the nation's success despite its physical limitations. Referencing Singapore, the term has also been used in the following contexts: - *Little Red Dot*, a magazine aimed at primary school students published by *[The Straits Times](/wiki/The_Straits_Times)* that was launched in 2005. - *The Little Red Dot*, the title of a 2005 book edited by [Tommy Koh](/wiki/Tommy_Koh) and Chang Li Lin about the rise of Singapore through the eyes of 50 of its [diplomats](/wiki/Foreign_relations_of_Singapore). - The Little Red Dot series of storybooks for Primary 1 and 2 students developed by Nexus (the Central National Education Office of the [Government of Singapore](/wiki/Government_of_Singapore)). Four books have been published: *Little Red Dot*, *Little Red Dot Bounces Back*, *Little Red Dot Fights Back*, and *Little Red Dot Comes Home*. The stories have themes such as resilience, a sense of rootedness, teamwork, unity, and vigilance. - Little Red Dot Academy, an aviation training and consultancy company headquartered in Singapore which was founded in 2004. - Little Red Dots, a design collective based in Singapore that was conceived in 2004. - Treasures of the Little Red Dot, a project initiated by [Creativeans](/wiki/Creativeans) to develop and showcase designs inspired by Singapore culture and its immediate reality. - *[On the Red Dot](/wiki/On_the_Red_Dot)*, a [Channel NewsAsia](/wiki/Channel_NewsAsia) current affairs programme which first aired in 2012. ## Notes - Chua, Mui Hoong (27 February 1999), \"Whither Singapore-Jakarta ties?\", *[The Straits Times](/wiki/The_Straits_Times) (reproduced on Singapore Window)*, archived from the original on 22 June 2013. - *PM Goh urges 'dignified' reaction to Malaysian criticisms*, [Agence France Presse](/wiki/Agence_France_Presse) (AFP) (reproduced on Singapore Window), 15 March 2002, archived from the original on 21 June 2013. - Mok, Ly Yng (12 April 2006), *Little Red Dot: A Short Story by Mok Ly Yng*, Yesterday.sg, archived from the original on 28 September 2007. - layyoong (20 April 2006), *Little Red Dot Two*, Yesterday.org, archived from the original on 6 February 2012. - Chang, Clarence (17 September 2006), \"MM Lee on ensuring S'pore's future as 'special red dot': Firm, yet subtle, in doing things our way\", *[The New Paper](/wiki/The_New_Paper) (reproduced on Singapore Window)*, archived from the original on 22 June 2013. - *Why is Singapore a little red dot?*, ASK!, Advisory and Enquiry Service, [National Library Board](/wiki/National_Library_Board), 8 October 2007, archived from the original on 4 June 2012. - \"Little red dot\" at the Double-Tongued Dictionary - \"Little red dot\" at the *Dictionary of Singlish and Singapore English* Portals: - Society - Singapore\n",
  "language": "en",
  "processed_at": "2026-01-12T11:26:28.209239",
  "title": "Little red dot",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Little_red_dot"
}