{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:26:33.521245"
  },
  "content": "* *This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Long Gen\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(May 2014)* *(Learn how and when to remove this message)*This article's **tone or style may not reflect the encyclopedic tone used on Wikipedia**. See Wikipedia's guide to writing better articles for suggestions. *(May 2014)* *(Learn how and when to remove this message)*This article **may incorporate text from a large language model**. It may include [hallucinated](/wiki/Hallucination_(artificial_intelligence)) information, copyright violations, claims not verified in cited sources, original research, or fictitious references. Any such material should be removed and content with an unencyclopedic tone should be rewritten. *(October 2024)* *(Learn how and when to remove this message)*This article **possibly contains original research**. Please improve it by verifying the claims made and adding inline citations. Statements consisting only of original research should be removed. *(December 2024)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* Venerable **Long Gen** ([Chinese](/wiki/Simplified_Chinese): 隆根长老) (1921–2011) was a key monastic figure in the [Singapore Buddhist community](/wiki/Buddhism_in_Singapore). ## Early life Venerable Long Gen, a revered figure in the realm of Chinese Buddhism, was born in the picturesque Jiangsu province of China in the year 1921. His spiritual journey commenced at an extraordinarily young age, as he embarked on the path to enlightenment by becoming a [Buddhist novice](/wiki/Samanera) at the tender age of 10. It was at the venerable Mount Bao Hua in the historic city of [Nanjing](/wiki/Nanjing) where his commitment to the monastic life took a profound turn. At the age of 22 he underwent [formal ordination](/wiki/Upasampada), marking the commencement of his lifelong dedication to Buddhism. The mid-20th century brought about a period of immense change and turmoil in China's history. In 1949, amidst the sweeping social and political transformations, Venerable Long Gen made the challenging decision to leave his hometown of [Wuchang](/wiki/Wuchang_District). Driven by his unwavering devotion to his spiritual calling, he embarked on a journey that would take him to the southern cities of [Guangzhou](/wiki/Guangzhou) and [Hong Kong](/wiki/Hong_Kong). While details of his activities during this period remain largely hidden, his presence in these bustling urban centers undoubtedly played a crucial role in the propagation of and practices.[*citation needed*] Furthermore, the year 1956 witnessed another significant chapter in Venerable Long Gen's life, as he made a visit to the island of [Taiwan](/wiki/Taiwan). ## Achievements in South East Asia When Ven Long Gen was in [Penang](/wiki/Penang) in 1960 propagating Buddhism, he also began the publication of Buddhist collateral in [Malaysia](/wiki/Malaysia) and Singapore. Thereafter in 1964, Venerable Long Gen stayed settled down in Singapore, gradually relocating the Nanyang Buddhist Bookstore from Penang to Singapore[*citation needed*]. In November 1973, Venerable Long Gen was appointed as the [Abbot](/wiki/Abbot) of Leng Foong Prajna Temple. He also participated in the Singapore Buddhist Federation since 1984 before taking on the leadership of Buddhist Federation in July 1994. He died in 2011, aged 91. - [Venerable Zhuan Dao](/wiki/Zhuan_Dao) - [Venerable Hong Choon](/wiki/Hong_Choon) - [Buddhism in Singapore](/wiki/Buddhism_in_Singapore) This Singaporean biographical article is a stub. You can help Wikipedia by expanding it. - v - t - e This [Buddhist](/wiki/Buddhism) biography-related article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:26:33.520931",
  "title": "Long Gen",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Long_Gen"
}