{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:26:36.494369"
  },
  "content": "Granite outcrop formerly located at Keppel Harbour ***Long Ya Men*** or ***Longyamen*** ([simplified Chinese](/wiki/Simplified_Chinese_characters): 龙牙门; [traditional Chinese](/wiki/Traditional_Chinese_characters): 龍牙門; [pinyin](/wiki/Pinyin): *lóngyámén*; [Malay](/wiki/Malay_language): *Batu Berlayar*) or **Dragon's Teeth Gate**, is the name that Chinese explorer [Wang Dayuan](/wiki/Wang_Dayuan) recorded for ***Batu Belayar***, a craggy [granite](/wiki/Granite) [outcrop](/wiki/Outcrop) that formerly stood at the gateway to [Keppel Harbour](/wiki/Keppel_Harbour) in [Singapore](/wiki/Singapore). In his description, \"The strait runs between the two hills of the *[Temasek](/wiki/Temasek)* ([Chinese](/wiki/Traditional_Chinese_characters): 單馬錫; [pinyin](/wiki/Pinyin): *Dānmǎxī*; [Pe̍h-ōe-jī](/wiki/Pe%CC%8Dh-%C5%8De-j%C4%AB): *Tan-má-sek* or [Chinese](/wiki/Chinese_language): 淡馬錫; [pinyin](/wiki/Pinyin): *Dànmǎxī*; [Pe̍h-ōe-jī](/wiki/Pe%CC%8Dh-%C5%8De-j%C4%AB): *Tām-má-sek*) natives which looked like a dragon's teeth.\" From there, the name *Long Ya Men* or Dragon Teeth's Gate was born. The rocky outcrop served as a navigational aid to ancient mariners sailing through the swift waters of the narrow channel, but was subsequently destroyed by the British in 1848 to widen the channel for larger vessels to sail through. In 2005, a symbolic replica was erected by the [Singapore government](/wiki/Government_of_Singapore) near its original site to mark the role it played in Singapore's maritime history. *Long Ya Men* was documented in Wang Dayuan's travelogue *[Daoyi Zhilüe](/wiki/Daoyi_Zhil%C3%BCe)* as one of the two settlements of *Temasek*. It was marked in the [Mao Kun](/wiki/Mao_Kun_map) navigational map historical maritime annal *[Wubei Zhi](/wiki/Wubei_Zhi)* said to date from the voyages of [Ming dynasty](/wiki/Ming_dynasty)'s Admiral [Zheng He](/wiki/Zheng_He). Long Ya Men in the map was also used to refer to the strait between [Sentosa](/wiki/Sentosa) island and Labrador Point, and named after a pinnacle of stone that was called *Batu Berlayar*, which means \"Sail Rock\" in [Malay](/wiki/Malay_language). Another suggestion is that it refers to the Singapore Main Strait south of [Pulau Satumu](/wiki/Pulau_Satumu). The unique features of the *Long Ya Men* was said to have assisted Zheng He in navigating the waters around Singapore during his seven maritime voyages to the west between 1405 and 1433. ## History Part of the [Early history of Singapore](/wiki/Early_history_of_Singapore)[Topynymy](/wiki/Names_of_Singapore)[Sabana](/wiki/Golden_Chersonese#Settlements)**[Temasek](/wiki/Temasek)** • Long Ya Men • [Ban Zu](/wiki/Ban_Zu)*[Malay Annals](/wiki/Malay_Annals)***[Kingdom of Singapura](/wiki/Kingdom_of_Singapura)** • [Sang Nila Utama](/wiki/Sang_Nila_Utama) • [Parameswara](/wiki/Parameswara_of_Malacca)[Badang](/wiki/Badang)[Hang Nadim](/wiki/Hang_Nadim#In_legend_and_popular_culture)**[Sack of Singapore](/wiki/Sack_of_Singapore)**[Archaeology in Singapore](/wiki/Archaeology_in_Singapore)[Singapore Stone](/wiki/Singapore_Stone)[Fort Canning Hill](/wiki/Fort_Canning_Hill) Singapore portal - v - t - e Historically the rocky outcrop was known locally by the [Malays](/wiki/Malay_Singaporeans) in earlier times as *Batu Berlayar* (\"Sailing Rock\") near the present site of [Labrador Park](/wiki/Labrador_Park), off [Pasir Panjang Road](/wiki/Pasir_Panjang_Road). Another rock outcrop used to stand on the opposite shore of *Tanjong Rimau* on [Sentosa](/wiki/Sentosa) Island. These two rock outcrops once formed a gateway at the western entrance to [Keppel Harbour](/wiki/Keppel_Harbour). [British sailors](/wiki/British_Empire) named the more prominent *Batu Berlayar*, \"**Lot's Wife**\" in reference to the biblical story of the wife of [Abraham](/wiki/Abraham)'s nephew. She was transformed into a pillar of salt when she disobeyed divine orders not to look back at the destruction of [Sodom](/wiki/Sodom_and_Gomorrah) while fleeing from the city. It is argued that the two rocky outcrops are the two hills of [Temasek](/wiki/Temasek) named in Yuan sources as Long Ya Men (Dragon's Teeth Gate) since they resembled two dragon's teeth between which a passage of water runs. Another name *Ling Ya Men* ([Chinese](/wiki/Chinese_language): 凌牙門; [pinyin](/wiki/Pinyin): *Líng Yá Mén*) is recorded in the [Song dynasty](/wiki/Song_dynasty) work *[Zhu Fan Zhi](/wiki/Zhu_Fan_Zhi)*, however it is usually considered to be a different place. It was recorded that during the [Yuan dynasty](/wiki/Yuan_dynasty), envoys were sent to *Long Ya Men* in 1320 to obtain tame elephants. The people of *Long Ya Men* then returned in 1325 with a tribute and trade mission to China. In around 1330, the traveller [Wang Dayuan](/wiki/Wang_Dayuan) was said to have sailed through this passageway. In his [travelogue](/wiki/Travel_journal) *[Daoyi Zhilüe](/wiki/Daoyi_Zhil%C3%BCe)*, he recorded that *Long Ya Men* was the two hills of *Temasek* between which a strait runs, and it was so called because the two hills looked like \"Dragon's teeth\". Wang described the people of *Long Ya Men* as being prone to acts of piracy, and that while the natives traded with Chinese from [Quanzhou](/wiki/Quanzhou), Chinese [junks](/wiki/Junks) on their way back from the Western Oceans (西洋) may be met by pirates there who attacked with two to three hundred [perahus](/wiki/Perahu) (boats). He mentioned that in olden times a chief there found a jewelled head-dress while digging in the ground, and that \"the beginning of the year is calculated from the [first] rising of the moon, when the chief put on this head-gear and wore his [ceremonial] dress\". He also said the natives would \"gather their hair into a [chignon](/wiki/Chignon_(hairstyle)), and wear short cotton [bajus](/wiki/Baju_Melayu) girded about with black cotton [sarongs](/wiki/Sarong)\". The description of the people may be the first known record of the [Orang Laut](/wiki/Orang_Laut) who inhabited the region. A different settlement called *[Ban Zu](/wiki/Ban_Zu)* (班卒), described as being located on a hill behind *Long Ya Men*, is thought to be a [transcription](/wiki/Transcription_into_Chinese_characters) of the Malay *Pancur* and may be today's [Fort Canning](/wiki/Fort_Canning) Hill. The Keppel passageway was used by [Asian](/wiki/Asian_people) and early [European](/wiki/European_ethnic_groups) sailors and traders for hundreds of years to sail past Singapore. Between 1405 and 1433, Zheng He made seven voyages to more than 30 countries, travelling in fleets of up to 300 ships to the [South Pacific](/wiki/Pacific_Ocean), Indian Ocean, [Persian Gulf](/wiki/Persian_Gulf) and Africa. The admiral travelled on the order of the [Chinese Emperor](/wiki/Emperor_of_China) to establish trade relations with countries west of China. He is believed to have sailed through the waters off Labrador Park, though whether he landed in Singapore is uncertain. In the 17th century, the passageway was abandoned in favour of the wider and more open Main Straits, that lies south of [Pulau Satumu](/wiki/Pulau_Satumu), where [Raffles Lighthouse](/wiki/Raffles_Lighthouse) stands today. [Stamford Raffles](/wiki/Stamford_Raffles) of the [British East India Company](/wiki/British_East_India_Company) did not know of the \"Lot's Wife\", or the deep water harbour it led to when he landed in Singapore in January 1819. [William Farquhar](/wiki/William_Farquhar), the first British Resident and Commandant of Singapore, wrote to Raffles on 2 September 1819 that he had founded a new harbour west of the settlement. The two rock outcrops were subsequently blown up by the [Straits Settlements](/wiki/Straits_Settlements) Surveyor, [John Turnbull Thomson](/wiki/John_Turnbull_Thomson), in August 1848 to widen the entrance to the new harbour. ### Commemoration In July 2005, a 6m high stone replica of *Long Ya Men* was put up near its original site by a joint collaboration involving the [Singapore Tourism Board](/wiki/Singapore_Tourism_Board) (STB), the [Maritime and Port Authority of Singapore](/wiki/Maritime_and_Port_Authority_of_Singapore) (MPA) and the [National Parks Board](/wiki/National_Parks_Board) (NParks). This was part of a three-month-long celebration of the 600th anniversary of Zheng He's maiden voyage, which began in [Nanjing](/wiki/Nanjing), China. A [storyboard](/wiki/Storyboard) telling *Long Ya Men'*s significance to Singapore and Zheng He's story, was also put up next to the replica. The authorities had initially planned for the replica to replace the red Berlayer Beacon, but the Singapore Heritage Society was against the decision, saying the beacon was itself a heritage site and should not be destroyed because the beacon has been at Labrador Park since the end of [World War II](/wiki/World_War_II). The replica was finally built just meters away from the beacon. The authorities hope the symbolic replica can serve to preserve the memory of *Long Ya Men*, which is an important part of Singapore's maritime history, for future generations and visitors familiar with the historical voyages of Zheng He. ### Doubts over identification with Keppel Harbour The Mao Kun map shows on the position of the [Singapore Strait](/wiki/Singapore_Strait), a navigational route and instructions for sailing from *Longyamen* to [Pedra Branca](/wiki/Pedra_Branca,_Singapore). In addition, it marks the name *Longyamen* on what appears to be [Lingga Island](/wiki/Lingga_Island), off the [Sumatran](/wiki/Sumatra) east coast. Supported by the testimony of Fei Xin, who sailed on four occasions with Zheng He, that Longyamen was situated to the north-west of Sanfoqi, a polity believed to be [Palembang](/wiki/Palembang), Willem Pieter Groeneveldt believed *Longyamen* was the Strait of Lingga. John Vivian Gottlieb Mills, who questioned the association of Keppel Harbour with *Longyamen*, carefully compared the sailing instructions on the Mao Kun Map with corresponding directions given in relevant itineraries found in three Ming era Chinese rutters, namely Shun Feng Xiang Song (順風相送, \"Fair Winds for Escort\", dated circa 1430), Bing Qian (兵鈐, Military Manual, dated 1674) and Dong Xi Yang Kao (東西洋考, \"A Study of the Eastern and Western Oceans”, dated 1617). Mill's conclusion was that the *Longyamen* was the main Singapore Strait, and not Keppel Harbour. This is precisely as drawn on the Mao Kun Map. Significantly the instructions from Shun Feng Xiang Song and Dong Xi Yang Kao referred to a *Temasek Gate* (淡馬錫門) by which vessels passed no matter if they were sailing in and out of *Longyamen* from [Karimun](/wiki/Great_Karimun) or Pedra Branca. Wang Dayuan's actual words were that \"*Longyamen* is intersected with two mountains belonging to the *Temasek* natives, akin to a dragon teeth-like formation, with a water channel running through the middle\". [Teochew](/wiki/Teochew_people) settlers who first came to Singapore in 1819 referred to the Telok Blangah area by Keppel Harbour as Sek-lak-mung (石叻門), meaning the \"Gate of Selat\", or the \"Gate of the Strait\". This shows *Temasek Gate* was Keppel Harbour and supports that *Longyamen* was the main Singapore Straits. Moreover, Wang Dayuan's writing was clear that the \"dragon teeth\" were mountains/hills, and not rocks. - Singapore portal - [Pasir Panjang](/wiki/Pasir_Panjang) - [Fort Pasir Panjang](/wiki/Fort_Pasir_Panjang) - [Kent Ridge Park](/wiki/Kent_Ridge_Park) - Old drawings of Long Ya Men - Examining the granite outcrops that played a role in Singapore’s maritime history | Video – News report about *Long Ya Men* produced by [CNA](/wiki/CNA_(TV_network)) in 2019. 01°15′45.06″N 103°48′18.68″E﻿ / ﻿1.2625167°N 103.8051889°E﻿ / 1.2625167; 103.8051889\n",
  "language": "en",
  "processed_at": "2026-01-12T11:26:36.494029",
  "title": "Long Ya Men",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Long_Ya_Men"
}