{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:26:57.424999"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Love Me, Love Me Not\" Singaporean TV series – news **·** newspapers **·** books **·** scholar **·** JSTOR *(January 2021)* *(Learn how and when to remove this message)* **Love Me, Love Me Not** (真爱无敌) is a romance drama about two [angels](/wiki/Angel) who must fulfill a mission to make certain people fall in love. It stars [Jacelyn Tay](/wiki/Jacelyn_Tay), [Xie Shaoguang](/wiki/Xie_Shaoguang), [Wong Li-Lin](/wiki/Wong_Li-Lin), [Chen Hanwei](/wiki/Chen_Hanwei) and [Dennis Chew](/wiki/Dennis_Chew). ## Plot Two angels, Hong Luanxing ([Jacelyn Tay](/wiki/Jacelyn_Tay), the Love Star) and Gu Guaxing ([Wong Li-Lin](/wiki/Wong_Li-Lin), the Lonesome Star), are sent to Earth as a punishment for breaking a rule in heaven. On Earth, they take on new identities as Song Xingxing, a lawyer, and Song Jingjing, a matchmaker from the Social Development Board. Their punishment is to complete conflicting tasks: Hong Luanxing, the Love Star, now is a lawyer and has to break couples up. Gu Guaxing, the Lonesome Star, now has to pair singles up. Each of them has to break up/pair up 100 couples before their punishment is considered complete. Xingxing and Jingjing fell in love with Ziyan and Yiqin respectively later on in the show. In the end, both of the angels went back to heaven after completing their punishments and Xingxing broke another rule on purpose again in order to be sent back to Earth, so that she can be with Ziyan again. Yiqin was hit by a coconut on his head and died, thus went to heaven and Jingjing can be with him once again with a happy ending. ## Cast - [Jacelyn Tay](/wiki/Jacelyn_Tay) as Hong Luanxing (Song Xingxing) - [Wong Li-Lin](/wiki/Wong_Li-Lin) as Gu Guaxing (Song Jingjing) - [Xie Shaoguang](/wiki/Xie_Shaoguang) as Zhao Ziyan - [Chen Hanwei](/wiki/Chen_Hanwei) as Lin Yiqin - [Dennis Chew](/wiki/Dennis_Chew) as Xiongxiong - [Chen Huihui](/wiki/Chen_Huihui) ## Accolades OrganisationYearCategoryNomineeResultRef[Star Awards](/wiki/Star_Awards)(/wiki/Star_Awards_2001)[Best Actor](/wiki/Star_Awards_for_Best_Actor)[Chen Hanwei](/wiki/Chen_Hanwei)Won[Best Supporting Actress](/wiki/Star_Awards_for_Best_Supporting_Actress)[Chen Huihui](/wiki/Chen_Huihui)Nominated This Singapore-related article is a stub. You can help Wikipedia by expanding it. - v - t - e This drama television program–related article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:26:57.424615",
  "title": "Love Me, Love Me Not (Singaporean TV series)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Love_Me,_Love_Me_Not_(Singaporean_TV_series)"
}