{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:26:55.343704"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Love Matters\" film – news **·** newspapers **·** books **·** scholar **·** JSTOR *(February 2024)* *(Learn how and when to remove this message)*2009 Singaporean film ***Love Matters*** ([Chinese](/wiki/Simplified_Chinese_characters): 幸福万岁) is a Singaporean comedy film written and directed by [Jack Neo](/wiki/Jack_Neo) and Gilbert Chan, and produced by Neo Studios, MM Studios & Grand Brilliance ## Plot Love Matters revolves around three main protagonists – 52-year-old Tan Bo Seng, his 17-year-old son Benny and 36-year-old Jeremy Tan, Bo Seng's ‘adopted’ brother – and their accidental journey in seeking and keeping love and happiness. Bo Seng leads a routine life. Attempts to revive the passion with his wife Jia Li cannot improve their stale love life. Jeremy lives a colourful life, colourful in reference to his long list of girlfriends. “Never to commit” is his motto for love. Benny has just school life, his only vice is anything to do with the computer, his only distraction is his crush, Jennifer, his classmate's girl. Bo Seng & Jia Li the old fashion couple has more misses than hits in the love department and a series of madness spin off one night. Jeremy meets Benny's teacher, Ms Wong - a lady, unlike the wild things he has had. His charm wins him her heart, but his Casanova means refuse to take a back seat, a new lady friend threatens to change his life ... Benny starts to see hope in relationships, when Jennifer notices him and invites him over to her place. Over the visit, Jennifer's friendly attention, takes a turn into something that Benny wish he has not been. ## Cast - [Henry Thia](/wiki/Henry_Thia) as Tan Bo Seng - [Yeo Yann Yann](/wiki/Yeo_Yann_Yann) as Jia Li - Jack Lim as Jeremy Tan - Alex Leong as Benny Tan - Cheryl Lee as Miss Wong - Natalli Ong as Jennifer - [Mark Lee](/wiki/Mark_Lee_(Singaporean_actor)) - [Lai Meng](/wiki/Lai_Meng) ## Production The film is co-directed by [Jack Neo](/wiki/Jack_Neo) and Gilbert Chan. ## Reception May Seah of [*Today*](/wiki/Today_(Singapore_newspaper)) rated the film two out of five stars. This article related to a Singaporean film is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:26:55.343282",
  "title": "Love Matters (film)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Love_Matters_(film)"
}