{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:27:00.794100"
  },
  "content": "Singaporean politician (born 1956) **Low Thia Khiang**[b] (born 5 September 1956) is a Singaporean former politician who has served as the secretary-general of the [Workers' Party](/wiki/Workers%27_Party_(Singapore)) (WP) between 2001 and 2018 and the [leader of the opposition](/wiki/Leader_of_the_Opposition_(Singapore)) between 2006 and 2018. He was the [Member of Parliament](/wiki/Parliament_of_Singapore#Members_of_Parliament) (MP) for [Hougang Single Member Constituency](/wiki/Hougang_Single_Member_Constituency) (SMC) from 1991 to 2011 and the Bedok Reservoir–Punggol division of [Aljunied Group Representation Constituency](/wiki/Aljunied_Group_Representation_Constituency) (GRC) from 2011 to 2020. Throughout his political career, Low was widely recognised for his tenacity and measured [pragmatism](/wiki/Pragmatism). As one of only two opposition MPs in Parliament between 1997 and 2011, he played a pivotal role in maintaining parliamentary opposition representation during a period dominated by the governing [People's Action Party](/wiki/People%27s_Action_Party) (PAP). His leadership style, often characterised by consensus-building and party discipline, was credited with transforming the WP into a cohesive and electorally credible force. In 2011, he led a landmark victory that saw the WP secure the first GRC won by an opposition party, representing the Bedok Reservoir–Punggol division of Aljunied GRC until his retirement. His tenure in Parliament, spanning 29 years, remains the longest of any opposition MP in Singapore's post-independence history. In 2018, as part of a leadership renewal strategy, Low stepped down as secretary-general and was succeeded by [Pritam Singh](/wiki/Pritam_Singh_(Singaporean_politician)). He did not seek re-election in the [2020 general election](/wiki/2020_Singaporean_general_election) but remained an influential presence within the party, continuing to serve on its Central Executive Committee (CEC) from 2022. ## Early life Born and raised in [Singapore during British colonial rule](/wiki/Colony_of_Singapore), Low was Chinese-educated and attended Lik Teck Primary School followed by [Chung Cheng High School](/wiki/Chung_Cheng_High_School_(Main)). He later enrolled at [Nanyang University](/wiki/Nanyang_University), where he majored in Chinese language and literature as well as government and public administration. In 1981, he graduated with a [Bachelor of Arts](/wiki/Bachelor_of_Arts) (Honours) in Chinese studies from the [National University of Singapore](/wiki/National_University_of_Singapore). The following year, in 1982, he obtained a diploma in education. Low worked as a teacher for several years before venturing into business. ## Political career ### 1982–1991: Early political career Low joined the WP in 1982, and was subsequently appointed as its Organising Secretary. At the [1984 general election](/wiki/1984_Singaporean_general_election), he was the election agent for the party's [secretary-general](/wiki/Secretary-general), [J. B. Jeyaretnam](/wiki/J._B._Jeyaretnam), in his successful campaign to retain [Anson Constituency](/wiki/Anson_Constituency). Low was well known for giving speeches in [Teochew](/wiki/Teochew_dialect), which won him much support from a large number of Teochew-speaking residents in Hougang SMC. In 1988, Low represented the WP in a televised debate with the PAP government on proposals to create an [elected presidency](/wiki/President_of_Singapore) for Singapore, during which he engaged [Ong Teng Cheong](/wiki/Ong_Teng_Cheong) and [Lee Hsien Loong](/wiki/Lee_Hsien_Loong), who later became the President and Prime Minister of Singapore respectively. In the [general election](/wiki/1988_Singaporean_general_election) later that year, Low, together with Gopalan Nair and Lim Lye Soon, contested [Tiong Bahru GRC](/wiki/Tiong_Bahru_Group_Representation_Constituency) against the PAP and lost with 47.63% of the vote to the PAP's 52.37%. ### 1991–2000: Political success In 1991, Low, as the Workers' Party's assistant secretary-general, won the Hougang SMC in the [1991 general election](/wiki/1991_Singaporean_general_election) and entered Parliament. In 1992, Low was appointed by Prime Minister [Goh Chok Tong](/wiki/Goh_Chok_Tong) as a member of the Cost Review Committee. Low was re-elected as the MP for Hougang SMC with increased votes at the [1997 general election](/wiki/1997_Singaporean_general_election), his second election victory in Hougang. ### 2001–2011: Leadership of WP On 27 May 2001, Low became the secretary-general of the Workers' Party, replacing [J. B. Jeyaretnam](/wiki/Joshua_Benjamin_Jeyaretnam). He was re-elected again as the MP for Hougang at the [2001 general election.](/wiki/2001_Singaporean_general_election) At the [2006 general elections](/wiki/2006_Singapore_general_election), Low won his fourth straight term for the Hougang constituency. He received 13,987 of the votes cast, a 62.74 per cent victory margin which was an increase of 7.74% from the last general election in November 2001. His opponent from the [People's Action Party](/wiki/People%27s_Action_Party), [Eric Low](/wiki/Eric_Low_Siak_Meng), received 8,306 votes. Between 1997 and 2011, Low and [Chiam See Tong](/wiki/Chiam_See_Tong) from the [Singapore People's Party](/wiki/Singapore_People%27s_Party) (SPP) were the only elected opposition Members of Parliament (MP) in Parliament. ### 2011–2016: Success with GRC During the [2011 general election](/wiki/2011_Singaporean_general_election), Low and Chiam left their respective strongholds in Hougang and Potong Pasir SMC to challenge the ruling PAP in [Group Representation Constituencies](/wiki/Group_representation_constituency) (GRCs). Low's team along with [Pritam Singh](/wiki/Pritam_Singh_(Singaporean_politician)), [Sylvia Lim](/wiki/Sylvia_Lim), [Faisal Manap](/wiki/Faisal_Manap) and [Chen Show Mao](/wiki/Chen_Show_Mao) challenged the ruling PAP in [Aljunied GRC](/wiki/Aljunied_Group_Representation_Constituency), while Chiam contested [Bishan–Toa Payoh GRC](/wiki/Bishan%E2%80%93Toa_Payoh_Group_Representation_Constituency), leading [Benjamin Pwee](/wiki/Benjamin_Pwee), Wilfred Leung, Jimmy Lee and Mohamad Hamim Bin Aliyas. In doing so, the two opposition MPs caused a risk of there being no elected opposition MPs in Parliament if both lost. Low led the WP to a victory in Aljunied GRC. On the other hand, Chiam was defeated, while his wife lost [Potong Pasir SMC](/wiki/Potong_Pasir_Single_Member_Constituency) for the SPP by a margin of 114 votes. The WP win marked the first time that an opposition party won a GRC. As a result of the victory, the party had a total of six elected MPs in Parliament, including the seat in Hougang SMC (which was retained by [Yaw Shin Leong](/wiki/Yaw_Shin_Leong)). At the [2015 general election](/wiki/2015_Singapore_general_election), Low's team along with [Pritam Singh](/wiki/Pritam_Singh_(Singaporean_politician)), [Sylvia Lim](/wiki/Sylvia_Lim), [Faisal Manap](/wiki/Faisal_Manap) and [Chen Show Mao](/wiki/Chen_Show_Mao) won and retained their seats in Aljunied GRC. However, as part of a national swing to the PAP, the team's votes share decreased to 50.96%, a drop of 3.76%, with a narrow margin of 1.9% (2,626 votes). As the margin was within the 2% range, there was a recount. This was Low's sixth continuous win as an elected opposition MP (four in Hougang SMC and two in Aljunied GRC). He was one of few elected opposition MPs to successfully defend a GRC as an incumbent; he also tied with Chiam for being elected the most number of times as an opposition candidate, with six terms. In the 2016 Central Executive Committee (CEC) elections for the WP, Low's position of secretary-general was contended by fellow Aljunied MP [Chen Show Mao](/wiki/Chen_Show_Mao). This was the first time Low was challenged for the post since he took it up in 2001. Low retained his seat with 61 votes, to Chen's 45. ### 2017–present: Stepping down In 2017, Low announced at WP's 60th anniversary dinner that he would not be contesting for the post of secretary-general for the 2018 party elections and would step down to renew leadership in the WP after being at its helm for 17 years. Low formally stepped down as WP chief on 8 April 2018. [Minister for Trade and Industry](/wiki/Minister_for_Trade_and_Industry_(Singapore)) [Chan Chun Sing](/wiki/Chan_Chun_Sing) subsequently praised Low during the Parliament sitting on 15 May 2018 for the role he played in Parliament, acknowledging him as \"a fellow Singaporean and very much part of Team Singapore\", and saying that the PAP appreciated his \"efforts to work together to build a better Singapore\" despite disagreements on perspective and methods. In 2020 while Low was recuperating in hospital, the WP announced that he would not contest in the [2020 general election](/wiki/2020_Singaporean_general_election) in a move to \"broaden its leadership base and also remain in touch with the ground\" as the Singaporean population changed. When the parliament was dissolved prior to [2020 general election](/wiki/2020_Singaporean_general_election), Low was Singapore's longest-serving opposition MP with 29 years in service. In interviews following the decision not to contest, Low stated that he was unlikely to make a political comeback in the future. Low felt that he had achieved his goals of securing a GRC, which he did with the [2011 general election](/wiki/2011_Singaporean_general_election), and renewal of the party leadership. Pritam Singh succeeded Low as secretary-general. Low had indicated his desire to remain active in politics and be involved with the party in a mentoring role, advising the succeeding leadership when asked. However, on 7 December 2024, Low announced his complete retirement from politics stating that he will no longer contest in further elections. However, he remains as a member of the WP's CEC. ## Personal life Low first met Han Mui Keow while they were students at Chung Cheng High School in 1973. They were married in 1982 and had two sons and a daughter. He is a [Buddhist](/wiki/Buddhism). On 30 April 2020, Low sustained a head injury after a fall at his home and was subsequently hospitalised in the [intensive care unit](/wiki/Intensive_care_unit) (ICU) at [Khoo Teck Puat Hospital](/wiki/Khoo_Teck_Puat_Hospital). He remained in the ICU for five days before being transferred to the general ward on 4 May. He continued his recovery in the general ward until he was discharged from hospital on 21 May. The injury reportedly affected his [olfactory nerve](/wiki/Olfactory_nerve) centre, resulting in a loss of his sense of smell. - [List of Singapore opposition party MPs elected](/wiki/List_of_Singapore_opposition_party_MPs_elected) ## Notes [Parliament of Singapore](/wiki/Parliament_of_Singapore)Preceded by[Chiam See Tong](/wiki/Chiam_See_Tong) **[Unofficial Leader of the Opposition](/wiki/Leader_of_the_Opposition_(Singapore))** 2006–2018Succeeded by[Pritam Singh](/wiki/Pritam_Singh_(Singaporean_politician))Preceded by[Tang Guan Seng](/wiki/Tang_Guan_Seng) **[Member of Parliament](/wiki/Members_of_the_Singapore_Parliament) for [Hougang](/wiki/Hougang_Single_Member_Constituency)** 1991–2011Succeeded by[Yaw Shin Leong](/wiki/Yaw_Shin_Leong)Preceded by[Lim Hwee Hua](/wiki/Lim_Hwee_Hua) [Zainul Abidin](/wiki/Zainul_Abidin_(politician)) [Yeo Guat Kwang](/wiki/Yeo_Guat_Kwang) [George Yeo](/wiki/George_Yeo) [Cynthia Phua](/wiki/Cynthia_Phua) **[Member of Parliament](/wiki/Members_of_the_Singapore_Parliament) for [Aljunied GRC](/wiki/Aljunied_Group_Representation_Constituency)** 2011 –2020 Served alongside: **(2011-2015): [Pritam Singh](/wiki/Pritam_Singh), [Faisal Manap](/wiki/Faisal_Manap), [Chen Show Mao](/wiki/Chen_Show_Mao), [Sylvia Lim](/wiki/Sylvia_Lim) (2015-2020): Pritam Singh, Faisal Manap, Chen Show Mao, Sylvia Lim**Succeeded by[Gerald Giam](/wiki/Gerald_Giam) [Pritam Singh](/wiki/Pritam_Singh) [Faisal Manap](/wiki/Faisal_Manap) [Sylvia Lim](/wiki/Sylvia_Lim) [Leon Perera](/wiki/Leon_Perera)Party political officesPreceded by[J.B. Jeyaretnam](/wiki/Joshua_Benjamin_Jeyaretnam) **[Secretary-General of the Workers' Party](/wiki/Workers%27_Party_of_Singapore)** 2001–2018Succeeded by[Pritam Singh](/wiki/Pritam_Singh_(Singaporean_politician))\n",
  "language": "en",
  "processed_at": "2026-01-12T11:27:00.793784",
  "title": "Low Thia Khiang",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Low_Thia_Khiang"
}