{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:27:02.660769"
  },
  "content": "Park in Singapore **Lower Peirce Reservoir Park** is a park located along Old Upper Thomson Road in [Singapore](/wiki/Singapore) and overlooks [Lower Peirce Reservoir](/wiki/Lower_Peirce_Reservoir), Singapore's second oldest reservoir. A mature secondary rainforest lines the bank with numerous rubber trees and oil palms. A 900-metre boardwalk constructed in Nov 1998 provides an outdoor classroom for nature study and recreation in a natural forest environment. Interpretative boards on the flora and fauna in the forest serves as a guide together with bum rest, scenic view and picnic points along the route. The boardwalk was specially routed and built on existing trails to elevate the compaction and soil erosion caused by the overuse of these trails in the forest to ensure the protection floral and fauna on the forest floor. ## Flora and fauna Some trees in the park are over 100 years old. [Pitcher plants](/wiki/Pitcher_plants) (*Nepenthe* spp.) and the [Nibong palm](/wiki/Oncosperma_tigillarium) (*Oncosperma tigillarium*) are some of the interesting plants located within the park. [Long-tailed macaques](/wiki/Long-tailed_macaque) (*Macaca fascicularis*), [Oriental whip snakes](/wiki/Oriental_whip_snake) (*Ahaetulla prasina*) and the occasional [white-bellied sea eagle](/wiki/White-bellied_sea_eagle) (*Haliaeetus leucogaster*) flying above the reservoir are the common wildlife residing in that area. [Raffles' banded langur](/wiki/Raffles%27_banded_langur) monkeys, endangered in Singapore, are also sometimes seen in the park. Freshwater species such as snakeheads (*[Channa](/wiki/Channa)* spp.) can also be found in the waters of the reservoir. - [List of Parks in Singapore](/wiki/List_of_parks_in_Singapore) This [Singapore](/wiki/Singapore) location article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:27:02.660395",
  "title": "Lower Peirce Reservoir Park",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Lower_Peirce_Reservoir_Park"
}