{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:27:05.902558"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Lower Seletar, Singapore\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(October 2023)* *(Learn how and when to remove this message)*Place in Yishun, Singapore **Lower Seletar** is a subzone of [Yishun](/wiki/Yishun), [Singapore](/wiki/Singapore). It is bounded by Yishun Avenue 1/4 and Yishun Street 41/51 to the north, [Seletar Expressway](/wiki/Seletar_Expressway) and Seletar West Link to the south, Yishun Avenue 1 to the east and Lentor Avenue to the west. ## Etymology Lower Seletar is named from the planning area [Seletar](/wiki/Seletar), which is located on the east of Lower Seletar. Seletar itself was named after the indigenous group that resided around the area before the 19th Century, the Orang Seletar The area is mostly taken up by [Lower Seletar Reservoir](/wiki/Lower_Seletar_Reservoir), a reservoir constructed under the Sungei Seletar/Bedok Water Scheme ## Amenities ### Hotel - Orchid Golf & Resort Hotel - A 75-room hotel with views of the Aranda Course and Seletar Reservoir. ### Country Clubs - Orchid Country Club - Opened in 1993 and located near beside Lower Seletar Reservoir along Yishun Avenue 1. Member facilities include gym, swimming pool, golf driving range and tennis courts. Also offer accommodations and staycations. - Seletar Country Club - Opened in 1930. Located on a hill overlooking Lower Seletar Reservoir and the Orchid Country Club. ## Recreation A major park, [Lower Seletar Reservoir Park](/wiki/Lower_Seletar_Reservoir) is located at the southern edge of the housing estate bordering the northern edge of the reservoir. Facilities include a water sports rental facility. There are also two small parks, Rockridge Park and Rower's Bay Park. Yishun Dam is also located in Lower Seletar, at the north-eastern side of [Lower Seletar Reservoir](/wiki/Lower_Seletar_Reservoir).\n",
  "language": "en",
  "processed_at": "2026-01-12T11:27:05.902253",
  "title": "Lower Seletar, Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Lower_Seletar,_Singapore"
}