{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:27:08.683425"
  },
  "content": "* *This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*The topic of this article **may not meet Wikipedia's notability guideline for geographic features**. Please help to demonstrate the notability of the topic by citing reliable secondary sources that are independent of the topic and provide significant coverage of it beyond a mere trivial mention. If notability cannot be shown, the article is likely to be merged, redirected, or deleted. *Find sources:* \"Loyang Bus Depot\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(June 2022)* *(Learn how and when to remove this message)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Loyang Bus Depot\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(June 2022)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* 1°22′04″N 103°58′01″E﻿ / ﻿1.3677°N 103.967°E﻿ / 1.3677; 103.967 **Loyang Bus Depot** is a [bus depot](/wiki/Bus_garage) in [Loyang](/wiki/Loyang,_Singapore), Singapore. The second bus depot following [Bulim Bus Depot](/wiki/Bulim_Bus_Depot) to be built by the [Land Transport Authority](/wiki/Land_Transport_Authority), it is located at Loyang Way at the junction of Pasir Ris Drive 3. The depot serves 31 bus services under the Loyang Bus Package. It is currently being operated by [Go-Ahead Singapore](/wiki/Go-Ahead_Singapore). Completed in 2015, the new bus depot is able to accommodate about 500 buses and be equipped with facilities for daily bus operations, bus maintenance and a rest area for bus drivers. On 19 June 2016, the Loyang Bus Depot was officially opened by MP for [Pasir Ris-Punggol Group Representation Constituency](/wiki/Pasir_Ris-Punggol_Group_Representation_Constituency), [Zainal Sapari](/wiki/Zainal_Sapari) and the Group Chief Executive of the Go-Ahead Group David Brown. Loyang Bus Depot Carnival was also held on the same day to allow the public to tour the depot and also learn more about Go-Ahead Singapore. ## History Announced by [LTA](/wiki/Land_Transport_Authority) on 29 May 2013, the bus depot will be the second depot that LTA is developing and funding, as part of the review of the enhanced structural assistance that Government is providing the bus industry announced in Committee of Supply (COS) 2012. The depot is intended to accommodate the additional buses that it is bringing in over the next few years. The operator's existing bus depots and bus park are reaching full capacity, and the new facility is necessary to support the higher number of buses as the overall bus capacity is progressively increased under the Bus Service Enhancement Programme (BSEP). On 11 December 2015, LTA handed the depot to [Go-Ahead Singapore Pte Ltd](/wiki/Go-Ahead_Singapore) for the operator to prepare for operations, as well as the recruitment and training of bus captains and technicians, to support a smooth transition. This Singapore bus-related article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:27:08.682986",
  "title": "Loyang Bus Depot",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Loyang_Bus_Depot"
}