{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:27:06.580601"
  },
  "content": "Subzone of Pasir Ris Planning Area in Singapore **Loyang** is a subzone region located in the town of [Pasir Ris](/wiki/Pasir_Ris) in the [East Region](/wiki/East_Region,_Singapore) of Singapore. The region consists of three subzones, Loyang West, Loyang East and Flora Drive. The name means *brass* or *tray* in [Malay](/wiki/Malay_language). The region is served with the exterior road of Loyang Avenue, which leads to [Pasir Ris](/wiki/Pasir_Ris) and [Tampines](/wiki/Tampines) and [Changi City Point](/wiki/Changi_City_Point). Much of the industrial estate is dealing with aviation related services, due to its proximity to [Changi Airport](/wiki/Changi_Airport). Loyang was a Malay [kampong](/wiki/Village) that once existed in the area, *Kampong Loyang* or *Loyang Besar*. Before redevelopment, its village [mosque](/wiki/Mosque), *Kampong Loyang Besar Mosque,* used to be located in the area. The area today is well-developed with residential estates, industrial parks and amenities such as [NTUC Downtown East](/wiki/NTUC_Downtown_East) on Jalan Loyang Besar and a HDB owned neighbourhood shopping mall Loyang Point on 259 Pasir Ris Street 21. ## Landmarks There is a famous and popular Chinese temple, known as [Loyang Tua Pek Kong Temple](/wiki/Loyang_Tua_Pek_Kong_Temple) (洛陽大伯公宮) located at Loyang Way. The temple is dedicated to [Tua Pek Kong](/wiki/Tua_Pek_Kong) and various [Chinese deities](/wiki/Chinese_gods_and_immortals) with several shrines dedicated to [Hindu deities](/wiki/Hindu_deities) and [Datuk Keramat](/wiki/Datuk_Keramat), reflecting the spirit of religious harmony in Singapore. The temple is one of the few Chinese temple in Singapore that is opened 24 hours for worship and attracts many devotees from all over the nation. This [Singapore](/wiki/Singapore) location article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:27:06.580282",
  "title": "Loyang, Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Loyang,_Singapore"
}