{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:27:14.936731"
  },
  "content": "Australian visual artist **Luke Sullivan** (born 30 March 1961, in Singapore) is an Australian visual artist most notable for his internationally controversial work, *The Fourth Secret of Fatima*. Sullivan's practice is considered to be representative of [Eclecticism](/wiki/Eclecticism), a European tangent of [Postmodernism](/wiki/Postmodernism) that emphasizes the artist's obligation to explore diverse subject matter, mediums and referencing. Since the 1990s, the movement has taken a more critical examination of social, political, religious and corporate institutions, and includes the UK's [Tracey Emin](/wiki/Tracey_Emin) and America's [Tom Sachs](/wiki/Tom_Sachs_(artist)). Since 2000, Sullivan's work has moved from a predominantly constructionist application of found objects and materials, to a more complex exploration of style and medium. [Terrorism](/wiki/Terrorism), [Religious Symbolism and Iconography](/wiki/Religious_Symbolism_and_Iconography), [Environmental degradation](/wiki/Environmental_degradation) and social mores form much of Sullivan's subject matter. *Rhythm Method* 2007, a work referencing the only form of contraception approved by [The Vatican](/wiki/Holy_See), was exhibited at London's [Royal Academy of Arts](/wiki/Royal_Academy_of_Arts) in the same year, further building the artist's reputation for irreverent social and religious commentary. ## The Fourth Secret of Fatima In August 2007, Sullivan's work *The Fourth Secret of Fatima* became the focus of international media attention and is regarded as one of the most provocative and controversial works of religious art since [Andres Serrano](/wiki/Andres_Serrano)'s [Piss Christ](/wiki/Piss_Christ). The piece, a statue of the [Virgin Mary](/wiki/Virgin_Mary) wearing a [burqa](/wiki/Burqa), was intended to draw attention to the oppression of women in dogmatic forms of religion such as [Islam](/wiki/Islam), but ignited world-wide debate and condemnation in the media. Exhibited with fellow Australian artist Priscilla Brack's incendiary image of [Jesus Christ](/wiki/Jesus_Christ) morphing into [Osama bin Laden](/wiki/Osama_bin_Laden), the works were reported in over 250 international newspapers as well as broad network coverage including [Reuters](/wiki/Reuters), [CNN](/wiki/CNN), [BBC](/wiki/BBC) and [Al Jazeera](/wiki/Al_Jazeera_Media_Network). Leading a wave of political and religious condemnation, then Australian Prime Minister [John Howard](/wiki/John_Howard) declared the work to be \"gratuitously offensive\". In the aftermath to the controversy [ABC](/wiki/ABC_Television_(Australian_TV_network))'s [Virginia Haussegger](/wiki/Virginia_Haussegger) noted, > \"In the tradition of some of the greatest art scandals, Luke Sullivan's work has challenged, provoked and unsettled everyone who has laid eyes on it\". In his 2008 exhibition, *Freestyler*, Sullivan expanded his oeuvre to include paintings of air disasters and hijackings. His recreation of [Flight 175](/wiki/Flight_175)'s infamous approach moments before its collision with the [World Trade Center](/wiki/World_Trade_Center_(1973%E2%80%932001)) was explained by the artist as \"a painting of an image that had been burnt into my psyche\".\n",
  "language": "en",
  "processed_at": "2026-01-12T11:27:14.936286",
  "title": "Luke Sullivan",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Luke_Sullivan"
}