{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:27:19.993287"
  },
  "content": "Singaporean model and beauty pageant titleholderThis biography of a living person **needs additional citations for verification**. Please help by adding reliable sources. Contentious material about living persons that is unsourced or poorly sourced **must be removed immediately** from the article and its talk page, especially if potentially libelous. *Find sources:* \"Lynn Tan\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(September 2014)* *(Learn how and when to remove this message)* **Lynn Tan** (born 24 February 1988) is a Singaporean model and beauty pageant titleholder who won [Miss Universe Singapore](/wiki/Miss_Universe_Singapore) 2012. She represented her [country](/wiki/Singapore) in the 2012 [Miss Universe 2012](/wiki/Miss_Universe_2012) pageant. ## Education Tan studied at [CHIJ Saint Nicholas Girls' School](/wiki/CHIJ_Saint_Nicholas_Girls%27_School) for her primary and secondary school education. She also studied at [Raffles Junior College](/wiki/Raffles_Junior_College) and Singapore Management University ## Pageant career ### Miss Singapore Universe 2012 Tan was the winner of Miss Universe Singapore 2012 and also won three other awards, Miss Body Beautiful, Miss Lumiere International and Miss Sensational Smile. ### Miss Universe 2012 Tan represented [Singapore](/wiki/Singapore) at [Miss Universe 2012](/wiki/Miss_Universe_2012) in [Las Vegas](/wiki/Las_Vegas), [USA](/wiki/United_States) but was unplaced at the pageant on December 19, 2012. ## Modelling career In 2011, Tan also won the FHM Model of the Year (Singapore) competition. In 2012, Tan was awarded the Star Model of Singapore award at the Asian Models Festival Awards in Seoul, Korea. Lynn was a part-time model in university and has modeled for brands such as La Perla, Softbake, Mondial Jewelry, Luxor Champagne, Ecco, Epson and Singtel. ## Career Tan previously worked in mergers and acquisitions at [Deloitte & Touche](/wiki/Deloitte_%26_Touche). and [UBS](/wiki/UBS). She is now a homemaker. She is married to Ken Tonkinson, CEO of hedge fund Keystone Investors. ## Philanthropy Lynn is actively engaged in philanthropy. - Her adopted charity and cause for awareness is [Guide Dogs Singapore](/wiki/Guide_Dogs_Singapore). She raised S$33,000 for the charity with the help of Deloitte & Touche. - She was also the Ambassador for the Color Run, an international festival which supports Project Happy Feet. Her other charitable activities include: - ICAP Charity Day 2013 & 2014 - Volunteering at the Lee Ah Mooi old age home - Conducting grooming classes for underprivileged girls - Lynn Tan Facebook page - Official Miss Singapore Facebook Awards and achievementsPreceded byValerie Lim **[Miss Singapore Universe](/wiki/Miss_Singapore_Universe)** 2012Succeeded by[Shi Lim](/wiki/Shi_Lim) This Singaporean biographical article is a stub. You can help Wikipedia by expanding it. - v - t - e This biography article about an Asian contestant in a beauty pageant is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:27:19.992957",
  "title": "Lynn Tan",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Lynn_Tan"
}