{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:27:22.183427"
  },
  "content": "Mascots of 2010 Summer Youth OlympicsPart of a series on[2010 Summer Youth Olympics](/wiki/2010_Summer_Youth_Olympics) - [Bid process](/wiki/Bids_for_the_2010_Summer_Youth_Olympics) - [Venues](/wiki/Venues_of_the_2010_Summer_Youth_Olympics) - Mascots - [Theme song](/wiki/Everyone_(Olympics_song)) - [Torch relay](/wiki/2010_Summer_Youth_Olympics_torch_relay) - [Medal table](/wiki/2010_Summer_Youth_Olympics_medal_table) ([medalists](/wiki/List_of_2010_Summer_Youth_Olympics_medal_winners)) - [Event calendar](/wiki/2010_Summer_Youth_Olympics#Calendar) - [Chronological summary](/wiki/Chronological_summary_of_the_2010_Summer_Youth_Olympics) - **[IOC](/wiki/International_Olympic_Committee)** - **[SNOC](/wiki/Singapore_National_Olympic_Council)** - **[SYOGOC](/wiki/Singapore_Youth_Olympic_Games_Organising_Committee)** - v - t - e **Lyo** and **Merly** were the official [mascots](/wiki/Mascots) of the inaugural [2010 Summer Youth Olympics](/wiki/2010_Summer_Youth_Olympics) held in [Singapore](/wiki/Singapore). Lyo is an anthropomorphic red male lion whose name stands for \"Lion of the Youth Olympics\", while Merly is an anthropomorphic blue female [Merlion](/wiki/Merlion) whose name combines \"mer\" (meaning \"sea\") with \"liveliness\" and \"youthfulness\". The duo represent several Olympic values (such as excellence) and traits of Singapore (known as the Lion City). Cubix International designed the mascots, while another local company, Mascots and Puppets Specialists, developed their [costumes](/wiki/Costumed_character). Before and during the Youth Olympics, Lyo and Merly appeared in school events, launches and roadshows. They also participated in pre-[National Day Parade](/wiki/Singapore_National_Day_Parade) activities, were displayed at competition venues and were featured in Youth Olympics memorabilia. ## Background The first official [Olympics mascot](/wiki/Olympic_symbols#Mascots) was [Waldi](/wiki/Waldi), introduced at the [1972 Summer Olympics](/wiki/1972_Summer_Olympics) in [Munich](/wiki/Munich), Germany. Games mascots have varied between being animals native to the area where the Games take place, humans, and imaginary creatures. They often reflect the culture and history of the hosting region, and have traits chosen to embody the ideals of Olympism and the Paralympic movement. The introduction of a mascot or mascots is often highlighted in the lead-up to the Games, to help build event anticipation, with a focus placed on them in contemporary Olympics. The first ever Summer Youth Olympics, Singapore's organizing committee extended the tradition of having mascots to this new event. ## Development In early 2009, seven shortlisted mascot design proposals were submitted to the [Singapore Youth Olympic Games Organising Committee](/wiki/Singapore_Youth_Olympic_Games_Organising_Committee) (SYOGOC). Amongst the seven, the proposal of Cubix International, a company specialising in branding, animation and character development, was eventually selected. Cubix initially sought to develop robot mascots, intending to showcase Singapore as a \"technologically advanced country\". However, research on Olympic mascots prompted them to move away from the robot theme and focus on animal mascots. The company stated it wanted to develop a pair of mascots \"who had contrasting yet complementary personalities\". Mascots and Puppets Specialists, led by creative director Frankie Malachi Yeo, was hired to transform the mascots from designs to actual three dimensional forms. Designing the mascots took about six months. There were issues over the materials used to build the mascot suits. Eventually, foam was selected as the main material. The mascot suits are heavy, with Lyo's head weighing 8 kilograms (18 lb) and Merly's weighing 6 kilograms (13 lb). The heads are strapped on to a harness donned by the mascot wearer. To minimize overheating, costumes included a built-in fan, and optional cooling vests were made available. Parts of the mascot production process were captured in the documentary, *Beyond Gold: The Journey to the first Youth Olympic Games*, which was commissioned by the Singapore Youth Olympic Games Organising Committee (SYOGOC). ## Mascots The mascots' designers created elaborate descriptions of Lyo and Merly, which are summarised below: NameLyoMerlyColourRedBlueGenderMaleFemaleCreature[Lion](/wiki/Lion)[Merlion](/wiki/Merlion)[Astrological sign](/wiki/Astrological_sign)[Leo](/wiki/Leo_(astrology))[Aquarius](/wiki/Aquarius_(astrology))Favourite foods[Chilli crabs](/wiki/Chilli_crab) and [Hainanese chicken rice](/wiki/Hainanese_chicken_rice)[Ais kacang](/wiki/Ais_kacang) and [Slush](/wiki/Slush_(beverage))Personal motto\"Never say never\"\"You can achieve anything if you pour your heart into it!\"Olympic valuesExcellence, RespectExcellence, FriendshipDream\"To win a gold medal in an international basketball championship\"\"To become an [environmental scientist](/wiki/Environmental_science)\"HobbiesJamming the guitar, exploring and discovering new things and playing sports, especially basketballSinging, swimming and returning seashells to the seaSymbolismLion City; fire; \"Blazing the Trail\" (tagline of the [Singapore 2010 bid](/wiki/Singapore_2010_Youth_Olympics_bid))Merlion; water Lyo's name is the initials (L.Y.O.) of \"Lion of the [Youth Olympics](/wiki/Youth_Olympic_Games)\", while Merly's name is a combination of *mer*, which means the sea, and the letters *L* and *Y* which stand for liveliness and youthfulness. The two characters allude to the \"[Lion City](/wiki/Lion_City)\" label of Singapore, and the Merlion, a [national symbol of Singapore](/wiki/National_symbols_and_emblems_of_Singapore), respectively. Lyo's mane resembles the Flame of Passion of the Spirit of Youth, the emblem of the Games. It is also a reference to the Singapore 2010 bid tagline \"Blazing the Trail\". The pad on his paw is shaped like the [island of Singapore](/wiki/Pulau_Ujong). Merly is [vegetarian](/wiki/Vegetarianism) due to \"a deep respect for all living creatures\", and her paw pad is shaped like a heart. ## Outreach The two mascots were officially introduced by [Minister for Community Development, Youth and Sports](/wiki/Minister_for_Community_Development,_Youth_and_Sports) Dr. [Vivian Balakrishnan](/wiki/Vivian_Balakrishnan) on 21 November 2009 at [Suntec City](/wiki/Suntec_City). He commented that the duo are \"an interesting play on fire and water\". He added that \"there are aspects of [the mascots] we clearly can identify with as Singaporeans, but really what we hope is these mascots will be embraced by Singaporeans as well as the visitors who come\". Before and throughout the Youth Olympics, the mascots appeared in various activities and programmes, including events in schools, launches and roadshows. The Olympic theme featured in Singapore's 2010 [National Day Parade](/wiki/Singapore_National_Day_Parade), also held in the month of August, and Lyo and Merly participated in pre-parade activities. Lyo and Merly were also widely featured in Games memorabilia sold at the official Youth Olympic Games Superstore in front of [Ngee Ann City](/wiki/Ngee_Ann_City) shopping centre on [Orchard Road](/wiki/Orchard_Road), Singapore's main shopping street, and at competition venues. Male medal winners at the Games are presented with a Lyo plush toy during victory ceremonies, and female winners receive a Merly toy. Four postage stamps depicting the mascots in poses featuring the Games' Culture and Education Programme (CEP) and [Olympic sports](/wiki/Olympic_sports) were also launched by the SYOGOC and [Singapore Post](/wiki/Singapore_Post). In addition, a limited-edition Singapore 2010 Youth Olympic Games Commemorative Pack, which depicted the journey taken by the country since it won the bid to host the Games, featured an exclusive MyStamp Sheet of the mascots in all 26 sport poses. Lyo and Merly also appeared on three coins released by the [Monetary Authority of Singapore](/wiki/Monetary_Authority_of_Singapore) to commemorate the Games. A mural of the duo made by artist Charlene Tenio was showcased at a party held at the official hotel partner, [Fairmont Singapore](/wiki/Fairmont_Singapore), to commemorate the 150-day countdown to the Games. - Olympics portal - Media related to Lyo and Merly at Wikimedia Commons Preceded by**First event mascot** ***[Olympic mascot](/wiki/List_of_Olympic_mascots)* Lyo and Merly** *Singapore 2010*Succeeded by[Yoggl](/wiki/2012_Winter_Youth_Olympics#Mascot)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:27:22.183034",
  "title": "Lyo and Merly",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Lyo_and_Merly"
}