{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:27:23.217568"
  },
  "content": "Telecommunication company in SingaporeThis article **contains promotional content**. Please help improve it by removing promotional language and inappropriate external links, and by adding encyclopedic text written from a neutral point of view. *(June 2022)* *(Learn how and when to remove this message)* **M1 Limited** (commonly known as **M1**; formerly **MobileOne**) is a [telecommunications](/wiki/Telecommunications) company based in Singapore. Founded in 1994, M1 was listed on the [Singapore Exchange](/wiki/Singapore_Exchange) from 2002 to 2019. The company is a subsidiary of [Keppel Ltd](/wiki/Keppel_Ltd.). ## History ### 1994–2002: Early years M1 was founded as a consortium known as MobileOne in Singapore in 1994. [Cable & Wireless plc](/wiki/Cable_%26_Wireless_plc), [Hong Kong Telecom](/wiki/Hong_Kong_Telecom), [Keppel Telecommunications](/wiki/Keppel_Corporation), and [Singapore Press Holdings](/wiki/Singapore_Press_Holdings) all owned stake in the company at its outset. In May 1995, it became the first firm (outside of government-owned [Singtel](/wiki/Singtel)) to acquire a cellular license and one of three to receive a [paging](/wiki/Pager) license from the Telecommunications Authority of Singapore. The company's first CEO, Neil Montefiore, was appointed in 1996. In January 1997 in the lead-up to the deregulation of the [telecommunications industry in Singapore](/wiki/Telecommunications_in_Singapore), MobileOne offered a free trial of its cellular service to build market share. On 1 April 1997, MobileOne was officially allowed to conduct business as a mobile phone operator. By June 1998, the company had a valuation of $1 billion ([SGD](/wiki/Singapore_dollar)). In 2000, MobileOne launched its own [GPRS](/wiki/General_Packet_Radio_Service) service, becoming the first telecom company in Singapore to do so. Over the course of 2000 and 2001, [MobileOne](/wiki/Mobile_One_(TV_series)) transferred all of its customers from a [CDMA](/wiki/Code-division_multiple_access) network to a [GSM](/wiki/GSM)-(/wiki/GSM_frequency_bands) network. In 2001, the firm signed an agreement with [Nokia](/wiki/Nokia) to help expand its GSM network. It had around 880,000 subscribers at that time, accounting for around one-third of the mobile phone market in Singapore. In July 2002, M1 signed another agreement with Nokia which would see the latter supply M1's nationwide [MMS](/wiki/Multimedia_Messaging_Service) system, expanding its future [3G](/wiki/3G) capabilities. ### 2002–2009: IPO, ventures into 3G and broadband MobileOne had its [IPO](/wiki/Initial_public_offering) in December 2002 and began trading on the [Singapore Exchange](/wiki/Singapore_Exchange) under the stock ticker symbol, MONE. In May 2004, M1 introduced POINT, a [music recognition](/wiki/Music_information_retrieval) service. Later that year, MobileOne enlisted Taiwanese boy band, (/wiki/5566), to promote the company's prepaid \"M Card\" in a series of ads. 2004 also saw M1 partner with [Google](/wiki/Google) on an image search feature and begin [push-to-talk](/wiki/Push-to-talk) trials with enterprise customers in Singapore. In February 2005, the company introduced prepaid cards that allowed for free incoming calls. It also launched its consumer 3G services, becoming the first Singapore-based operator to do so. In August 2005, SunShare Investments–a joint venture between [Telekom Malaysia](/wiki/Telekom_Malaysia) and [Malaysia](/wiki/Malaysia)'s government-run investment arm, [Khazanah Nasional](/wiki/Khazanah_Nasional)–acquired a 12.06% stake in M1 from Great Eastern Telecommunications (a separate joint venture with Cable & Wireless and [PCCW](/wiki/PCCW) as owners). With those shares, SunShare increased its ownership stake in M1 to 17.7%. By March 2006, SunShare's stake had grown again to 27.55%. In December 2006, MobileOne introduced Singapore's first [3.5G](/wiki/3.5G) wireless broadband service. Known as M1 Broadband, the service used [High Speed Downlink Packet Access](/wiki/High_Speed_Downlink_Packet_Access) (HSDPA) technology to achieve internet connection speeds of up to 3.6 Mbit/s. In April 2008, Telekom Malaysia (TM) demerged from one of its mobile and telecom divisions, [Axiata](/wiki/Axiata). The M1 shares that TM held through its SunShare Investments arm were then diverted to Axiata. In August of that year, the company entered into the fixed broadband sector. M1 Fixed Broadband used [StarHub](/wiki/StarHub) Cable's existing open access network to connect its service. In January 2009, it was announced that Neil Montefiore would step down as CEO of MobileOne. [CFO](/wiki/Chief_financial_officer) Karen Kooi was named acting CEO before being appointed to the position permanently in April 2009. In 2009, M1 began offering prepaid 3G broadband service and instituted a mobile handset rental program called \"Take3.\" It also launched a [near-field communication](/wiki/Near-field_communication) NFC pilot program in a partnership with [Citibank](/wiki/Citibank) and [Visa](/wiki/Visa_Inc.). In September 2009, M1 acquired Singaporean [internet service provider](/wiki/Internet_service_provider), Qala, with the goal of entering the corporate fixed broadband market. The acquisition of Qala also allowed the company to begin offering [ADSL](/wiki/ADSL) broadband. ### 2010–2017: Rebrand as M1, introduction of LTE and NB-IoT In April 2010, MobileOne officially changed its name to M1. In September of that year, M1 became the first Singaporean company to announce a 1 Gbit/s fiber optic internet plan. It also began offering four other internet plans to businesses and consumers. In June 2011, M1 launched the first commercial [LTE](/wiki/LTE_(telecommunication)) service in Southeast Asia, with coverage initially centered on the financial district. In April 2013, M1 announced that it would spend up to $85 million to modernize its mobile networks, as well as to deploy a nationwide 3G radio network on the 900 MHz frequency band. The project was completed by the first quarter of 2014. In 2015, M1 was named the service provider of the Home Access program by the [Infocomm Development Authority Of Singapore](/wiki/Infocomm_Media_Development_Authority), which would see the company offer subsidised rates for broadband internet access to low-income households. In April that year, it began offering [Voice over LTE](/wiki/Voice_over_LTE) (VoLTE) on its 3G and 4G networks. The following month, M1 acquired a 15% stake in the [Oman](/wiki/Oman) telecom company, TeO, through its subsidiary, M1 TeliNet. In June 2015, M1 launched a cashless, mobile [point of sale](/wiki/Point_of_sale) service in collaboration with [Mastercard](/wiki/Mastercard), [CIMB](/wiki/CIMB), and [Wirecard](/wiki/Wirecard). The service allows small businesses to accept credit, debit, and prepaid card payments using their smartphones or tablets. M1 entered into an agreement in July 2015 to host the postpaid [mobile virtual network operator](/wiki/Mobile_virtual_network_operator) (MVNO), Liberty Wireless, on its network under the brand name Circles Asia. In April 2017, M1's 2G network (along with all other 2G networks in Singapore) was shut down. In early 2016, M1 achieved 4G peak download speeds of more than 1 Gbit/s and peak upload speeds in excess of 130 Mbit/s through a collaboration with [Huawei](/wiki/Huawei). In March of that year, M1 introduced an NFC-enabled service that would allow users to pay transit fares with their smartphones. It also began providing Wi-Fi for M1 customers on public transit vehicles. In April 2017, M1's 2G network (along with all other 2G networks in Singapore) was shut down. That month, M1 also introduced a digital mobile [remittance](/wiki/Remittance) service. In August 2017, M1 launched Southeast Asia's first commercial nationwide [narrowband](/wiki/Narrowband) [Internet of Things](/wiki/Internet_of_Things) ([NB-IoT](/wiki/Narrowband_IoT)) network. Throughout 2017 and 2018, M1 worked with both Huawei and Nokia on a series of [5G](/wiki/5G) trials, one of which used M1's NB-IoT network. In March 2018, M1 announced a partnership with Keppel Electric that would see the two entities bundling price packages for mobile and electricity services in preparation of the launch of the Open Electricity Market in Singapore in 2019. ### 2018–present: Keppel, SPH, delisting, and 5G Karen Kooi officially stepped down as CEO of M1 in 2018 and was replaced by former Pareteum Asia CEO, Manjot Singh Mann. Also that month, M1 agreed to provide a wireless private network that would cover all of Singapore's [Jurong Port](/wiki/Jurong_Port), and it made digital [eSIM](/wiki/ESIM) services available on select [iPhones](/wiki/IPhones) on its network for the first time. In February 2019, Singapore Press Holdings (SPH) and the Keppel Corporation (through their joint venture, Connectivity Ltd) completed a buyout of Axiata's shares in M1, which totaled 28.7%. Prior to the buyout, SPH held a 13.45% stake in M1 and Keppel had a 19.33% stake. By the following month, Connectivity held a 94.55% stake in M1 and exercised its right to purchase the remaining shares in the company. It indicated at the time that it would delist M1 from the Singapore Exchange. M1 was officially delisted in April 2019. In January 2020, it was announced that M1 and fellow telecommunications company, StarHub, would submit a joint bid for one of four 5G licenses to be administered by the [Infocomm Media Development Authority](/wiki/Infocomm_Media_Development_Authority) (IMDA). The IMDA approved the joint bid along with the solo bid submitted by Singtel in April 2020. M1 will use Nokia's Core platform to build out its 5G network and provide nationwide 5G coverage by 2025. By 2021, 90 percent of M1's back-end system had been shifted to the [cloud](/wiki/Cloud_computing), and its 200 databases had been removed in favor of a large \"[data lake](/wiki/Data_lake).\" According to the company, this technological shift was part of an effort to provide more flexibility to create new services and engage consumers. In February of that year, the company announced that it would be offering three new mobile plans with customizable options. This was part of a rebrand where the company introduce a new logo, expand the functionality of its \"My M1+\" mobile app, and focus on becoming \"Singapore's first digital network operator.\" It also launched the \"Be\" campaign, a marketing effort highlighting seven Singaporeans and their individuality. On 11 August 2025, Keppel announced it will sell its 83.9 per cent effective stake in M1 to [Simba Telecom](/wiki/Simba_Telecom). While Simba will acquire the telecommunication portion of M1, Keppel will retain M1’s enterprise business. The sale is still pending [Infocomm Media Development Authority](/wiki/Infocomm_Media_Development_Authority)'s approval. ## Network Frequencies used on M1 Network in Singapore BandFrequencyFrequency Width (MHz)ProtocolNotes8 (900 MHz)(890~895; 935~940)2x5[LTE](/wiki/LTE_(telecommunication))3 (1800 MHz)(1765~1785; 1860~1880)2x20[LTE](/wiki/LTE_(telecommunication))1 (2100 MHz)(1955~1965; 2145~2155) (1960~1975; 2150~2165)2x10 2x15[5G NR](/wiki/5G_NR) StarHub-M1 Consortium7 (2600 MHz)(2520~2540; 2640~2660)2x20[LTE](/wiki/LTE_(telecommunication))78 (3.5 GHz)3550~3650100[5G NR](/wiki/5G_NR)StarHub-M1 Consortium ## Products and services M1 is one of the four major full service communications providers in Singapore. It offers a suite of mobile voice-and-data communication services over its 3G/3.5G/4G/LTE-A network, including international-call services to both mobile- and fixed-line customers. These include SMS, MMS, WAP, GPRS, 3G, 3.5G and 4G. It also offers prepaid mobile services, including prepaid data plans, under its M Card brand. It is one of the operators in Singapore to offer a prepaid 4G service. As of 2021, M1 currently offers three customizable mobile plans and offers non-standalone access to 5G networks in select areas throughout Singapore. Its three plans are known as Bespoke Contract, Bespoke SIM, and Bespoke Flexi, all of which allow the customer to build a personalized plan with specific price points, data, and talk time. The Bespoke Contract plan allows customers to enter into a contract with a set monthly price for up to two years. The Bespoke SIM and Bespoke Flexi plans are non-contract plans and can be adjusted once a month at no charge. The Bespoke SIM plan provides SIM cards to users with existing handsets while the Bespoke Flexi plan combines both a SIM card and a handset in the monthly price. On 26 July 2022, M1, with 2 other fellow telecommunications companies Singtel and StarHub, announced the retiring of 3G services by 31 July 2024. This would include voice, messaging and data services that run on 3G. ## External - Official website - Yahoo Finance Stock Quote Archived 11 March 2007 at the [Wayback Machine](/wiki/Wayback_Machine)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:27:23.217148",
  "title": "M1 (Singaporean company)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/M1_(Singaporean_company)"
}