{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:27:36.626954"
  },
  "content": "1965 bombing of the MacDonald House in SingaporePart of a series on the[History of Singapore](/wiki/History_of_Singapore)[Early history](/wiki/Early_history_of_Singapore) (pre-1819)[Srivijaya](/wiki/Srivijaya)650–1377[Temasek](/wiki/Temasek), [Long Ya Men](/wiki/Long_Ya_Men), [Ban Zu](/wiki/Ban_Zu)c.14th century[Kingdom of Singapura](/wiki/Kingdom_of_Singapura)1299–1398[Majapahit](/wiki/Majapahit)1398–1400[Malacca Sultanate](/wiki/Malacca_Sultanate)1400–1528[Johor Sultanate](/wiki/Johor_Sultanate)1528–1819British colonial era (1819–1942)[Founding](/wiki/Founding_years_of_modern_Singapore)1819–1826[Straits Settlements](/wiki/Singapore_in_the_Straits_Settlements)1826–1867[Crown colony](/wiki/Singapore_in_the_Straits_Settlements#Crown_colony_(1867–1942))1867–1942[Japanese Occupation](/wiki/Japanese_occupation_of_Singapore) (1942–1945)[Fall of Singapore](/wiki/Fall_of_Singapore)1942[Sook Ching](/wiki/Sook_Ching)1942[Double Tenth incident](/wiki/Double_Tenth_incident)1943[Post-war period](/wiki/Colony_of_Singapore) (1945–1962)[First Legislative Council](/wiki/History_of_Singapore#First_Legislative_Council_(1948–1951))1948–1951[Maria Hertogh riots](/wiki/Maria_Hertogh_riots)1950[Second Legislative Council](/wiki/History_of_Singapore#Second_Legislative_Council_(1951–1955))1951–1955[Anti-National Service Riots](/wiki/1954_National_Service_riots)1954[Internal self-government](/wiki/Self-governance_of_Singapore) (1955–1963)[Hock Lee bus riots](/wiki/Hock_Lee_bus_riots)1955[Singapore Glass Factory strikes](/wiki/Singapore_Glass_Factory_strikes)1960[Pulau Senang prison riots](/wiki/Pulau_Senang_prison_riots)1963[Merger with Malaysia](/wiki/History_of_the_State_of_Singapore_(Malaysia)) (1963–1965)[Singaporean referendum](/wiki/1962_Singaporean_integration_referendum)1962[Operation Coldstore](/wiki/Operation_Coldstore)1963[Race riots in Singapore](/wiki/1964_race_riots_in_Singapore)1964MacDonald House bombing1965[Republic of Singapore](/wiki/History_of_the_Republic_of_Singapore) (1965–present)[ASEAN Declaration](/wiki/ASEAN_Declaration) ([ASEAN](/wiki/Association_of_Southeast_Asian_Nations))1967[1969 race riots of Singapore](/wiki/1969_race_riots_of_Singapore)1969[Laju incident](/wiki/Laju_incident)1974[Operation Spectrum](/wiki/Operation_Spectrum)1987[Asian financial crisis](/wiki/1997_Asian_financial_crisis#Singapore)1997[Embassies attack plot](/wiki/Singapore_embassies_attack_plot)2001[H1N1 pandemic](/wiki/2009_swine_flu_pandemic_in_Asia#Singapore)2009–2010[Bus drivers' strike](/wiki/2012_Singapore_bus_drivers%27_strike)2012[Little India riot](/wiki/2013_Little_India_riot)2013[2018 North Korea–United States Singapore Summit](/wiki/2018_North_Korea%E2%80%93United_States_Singapore_Summit)2018[COVID-19 pandemic](/wiki/COVID-19_pandemic_in_Singapore)2020–2022By topic - [Timeline](/wiki/Timeline_of_Singaporean_history) - [Riots](/wiki/List_of_riots_in_Singapore) - [Military](/wiki/Military_history_of_Singapore) Singapore portal - v - t - e Part of the [Formation of Malaysia](/wiki/Malaysia_Agreement)Events[Malaysia Bill](/wiki/Malaysia_Bill)[Cobbold Commission](/wiki/Cobbold_Commission) • [18-point agreement](/wiki/18-point_agreement) • [20-point agreement](/wiki/20-point_agreement)[Singaporean referendum](/wiki/1962_Singaporean_integration_referendum)[Sarawak communist insurgency](/wiki/Communist_insurgency_in_Sarawak)[North Borneo dispute](/wiki/North_Borneo_dispute) • [Cross border attacks in Sabah](/wiki/Cross_border_attacks_in_Sabah) • [Moro conflict](/wiki/Moro_conflict) • [Piracy in Sulu and Celebes](/wiki/Piracy_in_the_Sulu_and_Celebes_Seas)[Brunei revolt](/wiki/Brunei_revolt) • [North Borneo Federation](/wiki/North_Borneo_Federation)[Konfrontasi](/wiki/Indonesia%E2%80%93Malaysia_confrontation)[Manila Accord](/wiki/Manila_Accord)[Maphilindo](/wiki/Maphilindo)[Sarawak Self-governance](/wiki/Sarawak_Independence_Day)[Malaysia Act 1963](/wiki/Malaysia_Act_1963)[North Borneo Self-governance](/wiki/North_Borneo_Self-government_Day)[Proclamation of Malaysia](/wiki/Proclamation_of_Malaysia)[Operation Claret](/wiki/Operation_Claret)[1964 race riots in Singapore](/wiki/1964_race_riots_in_Singapore)[Keningau Oath Stone](/wiki/Keningau_Oath_Stone)MacDonald House bombing[PAP–UMNO relations](/wiki/PAP%E2%80%93UMNO_relations)[Proclamation of Singapore](/wiki/Proclamation_of_Singapore)[UN Security Council Resolution 213](/wiki/United_Nations_Security_Council_Resolution_213)[Singapore Agreement](/wiki/Independence_of_Singapore_Agreement_1965)[South Thailand insurgency](/wiki/South_Thailand_insurgency)[Double Six Tragedy](/wiki/1976_Sabah_Air_GAF_Nomad_crash)[Pedra Branca dispute](/wiki/Pedra_Branca_dispute)[2019 failed constitutional amendment](/wiki/Proposed_2019_amendment_to_the_Constitution_of_Malaysia)[2021 constitutional amendment](/wiki/2021_amendment_to_the_Constitution_of_Malaysia) Malaysia portal - v - t - e The **MacDonald House bombing** was a [terrorist attack](/wiki/Terrorist_attack) that occurred in [Singapore](/wiki/State_of_Singapore_(Malaysia)) on 10 March 1965 at 15:07 [local time](/wiki/Singapore_Time). A bomb that was planted in the [MacDonald House](/wiki/MacDonald_House) at [Orchard Road](/wiki/Orchard_Road) exploded, instantly killing two and injuring 33 others. Part of the building was also damaged by the bomb. A third victim of the bombing died two days later after being in a coma. As it was planted by [Indonesian marines](/wiki/Indonesian_Marine_Corps) [Harun bin Said](/wiki/Harun_Thohir) and [Osman bin Haji Muhammad Ali](/wiki/Usman_Haji_Muhammad_Ali), the bombing affected [bilateral relationships between Indonesia and Singapore](/wiki/Indonesia%E2%80%93Singapore_relations). The [nitroglycerin](/wiki/Nitroglycerin) [bomb](/wiki/Bomb) was planted as part of the [Indonesia–Malaysia confrontation](/wiki/Indonesia%E2%80%93Malaysia_confrontation) (*Konfrontasi*), a conflict between Indonesia and Malaysia over Indonesia's opposition to the [creation of Malaysia](/wiki/Malaysia_Agreement). At the time, Singapore was still an [autonomous state](/wiki/Autonomous_state) within Malaysia. They were originally instructed to bomb a [power station](/wiki/Power_station) but went to the MacDonald House instead. At the time, the building was used by the [Hongkong and Shanghai Bank](/wiki/Hongkong_and_Shanghai_Bank) (HSBC), the Australian High Commission and the Japanese Consulate. Both marines subsequently attempted to flee Singapore but were apprehended by the [Police Coast Guard](/wiki/Police_Coast_Guard). They were charged with the murders of three victims, although the bombing itself was not mentioned in the charges. They were put to trial in the [High Court](/wiki/High_Court_of_Singapore) and after a 13-day trial, were found guilty for their charges of murder and sentenced to death. Despite multiple appeals, including a [clemency](/wiki/Clemency) plea from [President of Indonesia](/wiki/President_of_Indonesia) [Suharto](/wiki/Suharto), they were hanged on 17 October 1968, causing about 300 students to raid the Singapore Embassy in [Jakarta](/wiki/Jakarta). Following the bombing, security measures for buildings increased, particularly with packages. The bombing strained bilateral relationships between Indonesia and Singapore until 1973, when [Prime Minister of Singapore](/wiki/Prime_Minister_of_Singapore) [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) went to Indonesia and scattered flowers over the marines' graves, largely restoring bilateral relationships between the two countries. Singapore–Indonesia bilateral relationships were affected again in 2014 following the naming of the [KRI Usman Harun](/wiki/KRI_Usman_Harun), which was named after Harun and Osman. Indonesia officially apologised for the naming but clarified that the naming is irreversible. A memorial at [Dhoby Ghaut Green](/wiki/Dhoby_Ghaut_Green) dedicated to the victims of the *Konfrontasi* was opened in 2015. ## Background ### Indonesia–Malaysia confrontation The [Indonesia–Malaysia confrontation](/wiki/Indonesia%E2%80%93Malaysia_confrontation) (also called the *Konfrontasi*) was a conflict between Indonesia and Malaysia that took place between 1963 and 1966. The Konfrontasi was started by Indonesia since it opposed the formation of Malaysia, perceiving it to be a \"[neo-colonial](/wiki/Neo-colonial) project\" for the British. Indonesian saboteurs mounted a campaign of terror in Singapore, then a major state and city within Malaysia. There were a total of 37 bombings from 1963 to 1966. The saboteurs were trained to attack military installations and public utilities. However, when the saboteurs failed in their attempts to attack these installations that were heavily guarded, they set off bombs indiscriminately to create panic and disrupt life in Singapore as well as in Malaysia. By 1964, bomb explosions became frequent. To help the police and army defend Singapore from these attacks, a volunteer force was set up. More than 10,000 people signed up as volunteers. Community centers served as bases for the volunteers to patrol their neighbourhoods. In schools, students underwent bomb drills. The government also warned Singaporeans not to handle any suspicious-looking parcels in the buildings or along streets. Despite the efforts of the British, small groups of saboteurs managed to infiltrate the island and plant bombs. By March 1965, a total of 29 bombs had been set off in Singapore. ### MacDonald House The [MacDonald House](/wiki/MacDonald_House) is a 10-storey office building in [Orchard Road](/wiki/Orchard_Road), Singapore. Built for the [Hongkong and Shanghai Bank](/wiki/Hongkong_and_Shanghai_Bank) (HSBC), it was the first building in [Southeast Asia](/wiki/Southeast_Asia) to be air-conditioned. Land for the building was acquired in 1946 and work on the building began in May 1947. The building opened on 2 July 1949 and was given its name after then-Governor General of Singapore [Malcolm MacDonald](/wiki/Malcolm_MacDonald). At the time of the bombing, it housed the Australian High Commission, which had relocated to the building from [Robinson Road](/wiki/Robinson_Road,_Singapore) in September 1951, and the Japanese Consulate. It was located just 1.4 kilometres (0.87 mi) from [The Istana](/wiki/The_Istana), the official residence of the [Yang di-Pertuan Negara](/wiki/Yang_di-Pertuan_Negara#Singapore), now [President](/wiki/President_of_Singapore), of Singapore. ## Attack The two Indonesian marines, [Harun Said](/wiki/Harun_Said) and [Osman bin Haji Mohamed Ali](/wiki/Osman_bin_Haji_Mohamed_Ali) had arrived in Singapore from Java at 11:00 am, wearing civilian clothes and planted the bomb there. They had been instructed to bomb an electric power house but instead headed to MacDonald House and planted the bomb at the [mezzanine](/wiki/Mezzanine) floor. Goh Nam Soon, a food [hawker](/wiki/Hawker_(trade)), smelled a scent similar to \"tyres being burnt\" and went to the building to investigate. He discovered at a dark corner of the mezzanine, there was a bag with smoke coming out of it and a \"hissing\" sound, and decided to inform George Conceicao, a staff officer of HSBC, of the \"evil smelling smoke\". Multiple other witnesses also noticed the smell. ### Explosion At 15:07 [SST](/wiki/Singapore_Standard_Time) (UTC+08:00), the bomb exploded. The bank had closed for business 7 minutes earlier and 150 employees were there at the time of the explosion. The bomb instantly killed two people: 36-year old Elizabeth Suzie Choo, a secretary to the bank manager, and 23-year old Juliet Koh, a clerk, as well as injuring at least 33 others. *[The Straits Times](/wiki/The_Straits_Times)* speculated that \"many more would have been killed or injured if the bomb had gone off 10 minutes later\". It was also reported by *The Straits Times* that many workers initially thought it was a thunderclap as it was heavily raining at the time. The bomb damaged parts of the building, including an inner wall at the mezzanine floor, lift doors, and windows up to 9 storeys. It also caused an elevator to fall to the basement, with the occupants having to pry open the doors. The surroundings of the building was also affected by the explosion; the windscreens of cars were shattered and neon signs fell to the ground. Later examination of the building showed that about 9 to 11 kilograms (20 to 24 lb) of [nitroglycerine](/wiki/Nitroglycerin) explosives were used for the bomb. By 3:30 pm, the Reserve Unit arrived at the site to control the crowd, with policemen already diverting traffic in Penang Road and Tank Road. A [station wagon](/wiki/Station_wagon) belonging to the Australian High Commission had to be pushed from the middle of the road to the side to let ambulances pass. High-ranking police officers from [Pearl's Hill](/wiki/Pearl%27s_Hill) was soon at the scene, followed by the British Army's bomb disposal squad. Around that time, the [General Hospital](/wiki/Singapore_General_Hospital) was \"crammed\" with relatives and friends of the injured, with all doctors and nurses activated for emergency duties. In MacDonald House, workers in the upper floor were ordered to vacate the building via the fire escape at the back of the building over the possibility of a second bomb or more walls caving in. Once the building was cleared, only policemen and foreign news correspondents were allowed at the site, with local news correspondents driven away such as a *[Sin Chew Jit Poh](/wiki/Sin_Chew_Jit_Poh_(Singapore))* reporter manhandled by an inspector. By 5:00 pm, a team from the [Health Department](/wiki/Ministry_of_Health_(Singapore)) arrived at the site to clean up the shattered glass on the road as it stopped raining. On 12 March, 45-year old Mohammed Yasin bin Kesit, a driver who slipped into a coma from the blast, died, becoming the third victim of the bombing. It was rumoured by workers that a disgruntled employee or the Bank Employee's Union, following a dispute, caused the explosion, though this was denied by HSBC's bank manager for Malaysia S. F. T. B Lever, who said that \"I am not prepared to accept that the union will try to bomb the bank because of a dispute. That is an entirely irresponsible statement. I am fully convinced that it has nothing to do with the union or any of the staff of the bank\". The Special Investigations Section of the [Criminal Investigation Department](/wiki/Criminal_Investigation_Department_(Singapore)) (CID) interviewed several people in connection to the attack. ### Arrest Harun and Osman boarded a bus in Orchard Road after planting the bomb. Afterwards, they tried to return to Indonesia via a motorboat, though it either sprung a leak or hit an object. They were floating on a piece of plank until they were picked up by Lim Ah Paw, a [bumboat](/wiki/Bumboat) operator. Harun claimed both of them were fishermen, though when asked by Lim to present his identity card, Harun claimed it fell in ocean. Lim then told his helmsman to hail a passing police boat. When questioned by the police, Harun said he was a farmer whilst Osman was a fisherman. Both were charged with entering a controlled area. When Marine Police Inspector Mahamed bin Haji Ali spoke of them to Inspector Hill, who was in charge of the MacDonald House bombing investigation. Hill took over the case as he thought the two could assist with the bombing investigation. It was later discovered Harun and Osman were the perpetrators behind the bombing. On 15 March, the two marines were charged in a [magistrate's court](/wiki/Magistrates%27_court) for \"knowingly caus[ing]\" the deaths of the three victims, though the bombing is not mentioned within the charges. Harun and Osman were remanded in police custody. The case came up for mention week later on 22 March, though magistrate Sachi Saurajen ordered for the two be further remanded. On 5 April, Harun and Osman were ordered to stand trial in the [High Court](/wiki/Supreme_Court_of_Singapore), with senior inspector T. S. Zain submitting a certificate for the two to be trialed without holding a preliminary enquiry under the 1964 Emergency Criminal Trials Regulations. The two would have the same charges be applied by the High Court on 17 May, with both pleading not guilty. Director of Public Prosecutions Dalip Singh requested for the case to be adjourned indefinitely, though this was rejected by Justice Ambrose, who \"[didn't] think it was proper in a criminal case to have the case be [adjourned sine die](/wiki/Adjourned_sine_die)\". Singh then requested for the case to be postponed until May 31, which was granted. The case was postponed again from 30 August until the next Assizes, with 150 witnesses to testify for the case. ## Trial The trial began on 4 October 1965, with Justice Chua presiding over the trial. Inche Kamil Suhaimi, who was assigned to Harun and Osman, said the two were \"seeking protection\" under the [Geneva Convention](/wiki/Geneva_Conventions) since they were members of [Indonesian Armed Forces](/wiki/Indonesian_Armed_Forces) and should be treated as [prisoners of war](/wiki/Prisoner_of_war), whilst Senior Crown Counsel [Francis T. Seow](/wiki/Francis_T._Seow) contested this claim and alleged that the two were \"mercenary soldiers\" who were paid $350 to carry out a \"particular assignment\". Inche alleged there had been an attempt obstruct the case's \"flow of justice\", where he claimed that Osman and Harun's military uniforms, which were worn in previous High Court hearings, were taken away by prison authorities, with one of them allegedly told that he would not be tried in court if he were to wear the uniform. Seow presented the uniform to the court, where he alleged that the Osman and Harun received them from other Indonesian prisoners and that they took off their uniforms when separated from each other as \"they were assuming an identity to which they were not legally entitled\". When called for a [cross-examination](/wiki/Cross-examination) by Seow, Osman denied that when he and Harun were picked up, they claimed they were from [Kampong Kapor](/wiki/Kampong_Kapor_Constituency) in Singapore, as well as denying that he was bare-bodied and only wearing shorts when rescued, instead in uniforms. Harun denied to be a mercenary, instead claiming that he is a regularly-paid soldier, and denying that he received the military uniform from an Indonesian when remanded as well as information on the Korps Kommando Operasi's military structure from other Indonesian prisoners. On the second day of the trial, seven witnesses were called to the stand by Seow against Harun and Osman's claims of wearing uniforms when picked up. Lim Ah Paw, the [bumboat](/wiki/Bumboat) operator, testified when he picked up the two, Harun was wearing a sports shirt and long trousers whilst Osman was bare-bodied and only wearing long trousers. Four members of the police gave similar accounts to Lim's. Wong Kee Huat of [Outram Prison](/wiki/Outram_Prison) said that the two were in civilian clothing when they were administered in the remand until a few days later, when 40 prisoners, said to have been captured in the Pontian Landing in [Johor](/wiki/Johor), were brought to prison. 10 of the 40 were wearing military uniforms that were allowed to be kept and according to Wong, there were opportunities for them to give the uniform to Osman and Harun. Wong did not take action until another police officer noticed that Osman and Harun were wearing uniforms. However, Wong stressed that he could not be sure that the uniforms were taken from the other prisoners as that was his presumption. When recalled to the stand, Osman claim that he wore his uniform until two days after his arrest, when it was taken away by a police officer and his and Harun's were given back to them cleaned. Osman also said that he and Harun were in civilian clothing during the lower court's hearings. On the third day, Seow called in two police photographers to testify against the accused's claim of wearing military uniforms at the time of the explosion. The defendant asked the judge to give Osman and Harun the benefit of the doubt, though this was overruled by Chua, who said: > \"The evidence is overwhelming that when the two accused were picked up in Singapore waters by the bumboat-man, they were not in military uniform... I also found in the evidence that when picked up, the two accused claimed to be fishermen, whose boat had capsized. Later to an inspector of police, the first accused claimed to be a fishermen [sic], and the second accused, a farmer. The two accused claim to be members of the regular armed forces of the Republic of Indonesia. They also claim that they are prisoners of war under Article 4 (A1) of the Conventions of 1949. The onus of proving that they are members of the regular armed forces of the Republic of Indonesia lies on the two accused. They have failed to discharge their onus. In any case, I have no doubt that they are not members of the regular armed forces of the Republic of Indonesia. Even if they are members of the regular armed forces of the Republic of Indonesia, they are not in my opinion, entitled to the status of prisoners of war. In my view, members of the enemy armed forces who are combatants, and who come here with the assumption resemblance of peaceful pursuits, and divesting themselves of the character or appearance of soldiers and are captured, such persons are not entitled to the privileges of prisoners of war.\" After 13 days, on 20 October, Osman and Harun were found guilty on all three murder chargers and were [sentenced to death](/wiki/Capital_punishment_in_Singapore). Justice Chua described the bombing as a \"cowardly act\" and that \"there [was] only one sentence that [he] can pass\". Appeals were made by Inche, who urged the judge to give both defendants the benefit of the doubt, though this was rejected by Chua as \"they were beyond any doubt on all the three murder charges\". Harun and Osman also appealed against the sentencing, which began on 31 August 1966 in the Federal Court in front of a group of judges, justices [Wee Chong Jin](/wiki/Wee_Chong_Jin), Tan Ah Tah, and Ambrose. Harun and Osmam were represented by A. J. Barga whilst [Francis Seow](/wiki/Francis_Seow) represented the public prosecutor. Barga argued that they were \"protected persons\" under the Geneva Convention Act 1962 as Chua pointed out that there was a conflict between Indonesia and Malaysia. However, Seow said that there was \"overwhelming evidence\" that Osman and Harun were not part of Indonesia's regular armed forces. Seow also argued that the bombing was not \"a war-like action\" but a \"murderous action\" to civilians as it was conducted during peak hour, which is forbidden by the Geneva Convention Act. The appeal was rejected by the court on 6 October, though Harun and Osman were granted special leave to appeal by the [Judicial Committee of the Privy Council](/wiki/Judicial_Committee_of_the_Privy_Council) in London. As they were in civilian clothes and had targeted a civilian building, the two men were tried in Singapore for the murder of the three people who died in the blast. They were convicted and hanged in [Changi Prison](/wiki/Changi_Prison) on 17 October 1968. ## Aftermath ### MacDonald House and Orchard Road Repair works for the building begun on 11 March 1965. The building was declared safe by [P.W.D](/wiki/Public_Works_Department_(Singapore)) engineers and architects, with workers accessing the upper floors via the fire escape staircase. It was expected that the windows of the ground floor will be replaced by the next day, though it was estimated that it would take at least a week for the glass fronts of the buildings affected by the bombing to be fully repaired. HSBC and the Australian Trade Commission was opened for business whilst the Australian High commission temporarily moved offices to one of their employee's home in Orange Grove Road. Some businesses were closed due to a lack of staff. The closed stretch of Orchard Road opened on 11:30 am, where it was revealed that Penang Road and Clemenceau Avenue were congested due to the closed stretch. It was estimated that the cost of the damages in MacDonald House were up to [$](/wiki/Malaya_and_British_Borneo_dollar)250,000. A bomb hoax occurred in Orchard Road on 18 March, where a caller threatened to blow up [Amber Mansions](/wiki/Amber_Mansions), resulting in a stretch of Orchard Road to be temporarily closed. It was reopened 15 minutes after the bomb was due to go off. ### Heightened security Following the explosion, a warning was issued by the government on 11 March 1965 for the general public to be vigilant of \"mischievous and irresponsible elements\" after a bomb scare at the [National Library](/wiki/Old_National_Library_Building), half a mile from MacDonald House. The Singapore International Chamber of Commerce (SICC) decided to establish \"security committees\" on 15 March to protect its members' buildings from being sabotaged by Indonesian agents. The SICC also listed four precautionary measures that businesses should take, being control of entrances, inspection of identity cards, disclosure of package contents from unknown persons, and treatment of packages. SICC members such as the [Cathay Organisation](/wiki/Cathay_Cineplexes) and [Shaw Organisation](/wiki/Shaw_Organisation) started inspecting packages, along with other businesses in the city. It was reported by a security firm that after the bombing, \"there has been an increased 'security consciousness'. We have been swamped with requests for security guards and advice on security measures from firms and the public\". Vulnerable buildings such as Pasir Panjang power station, which was a target by several Indonesia military agencies, had its security precautions strengthened. ### Allegations of discrimination against local news reporters On 13 March 1965, the Singapore National Union of Journalists (SNUJ) sent a letter to acting Commissioner of Police A. T. Rajah criticising the police's \"discriminatory and strong-arm treatment\" of Malaysian news reporters, referring to the manhandling incident at the MacDonald House bombing. The letter also alleged that this was not the first time such incident occurred and requested for the union and the acting-Commissioner to meet. When asked by news reporters about the manhandling incident, Minister of Home Affairs Ismail bin Dato Abdul Rahman revealed that he ordered a full enquiry into the incident, and that police officers found guilty of manhandling news reporters will be punished, though refused to comment further to be impartial to the police. By 15 March, thirteen news reporters were interviewed and the SNUJ was to meet with Rajah on 18 March to discuss police manhandling incidents towards local news reporters, as well as for the two groups to better cooperate. By 19 March, the probe was at its final stage, with a full report to be sent to the Inspector-General of Police by the next day or early next week. The probe would be completed on 22 March and Rajah would receive the report by 29 March. After reading the report, it was determined by Ismail that the police officer who twisted the news reporter, Inspector K. Dyrian, would not be charged as according to Ismail, the officer had no intention of discrimination between local and foreign journalists. Ismail speculated that Dyrian \"lost his head\" when he applied the twist to the reporter. The SNUJ and Malaya National Union of Journalist criticised the decision, calling for an \"impartial enquiry\" and the release of the full report. However, the Ministry of Home Affairs refused to release the report, adding that \"all future action should be designed to improve relations [between the police and the press] and not exacerbate them\". ### Effect on Indonesia–Singapore bilateral relations Singapore would [gain independence and leave Malaysia](/wiki/Singapore_independence) on 9 August 1965, just five months after the bombing. In March 1967, the [President of Indonesia](/wiki/President_of_Indonesia), [Sukarno](/wiki/Sukarno), who had initiated the *Konfrontasi*, resigned from the presidency under pressure by Indonesian military general [Suharto](/wiki/Suharto) amidst the [30 September Movement](/wiki/30_September_Movement). A clemency plea by Suharto, who assumed the position of President, was rejected. The Singapore Embassy in Jakarta was occupied on the day of the saboteurs' hanging by 300 students. [Bilateral relations between Singapore and Indonesia](/wiki/Indonesia%E2%80%93Singapore_relations) would improve after 1973, when [Prime Minister of Singapore](/wiki/Prime_Minister_of_Singapore), [Lee Kuan Yew](/wiki/Lee_Kuan_Yew), visited the graves of Harun and Osman in Indonesia (*nyekar*) and scattered flowers on them. As Indonesians believe in [life cycles](/wiki/Reincarnation), flowers are sprinkled on graves to decorate and make it fragrant, allowing peaceful rest of the deceased. This was followed by Suharto's visit to Singapore in 1974. From the 1980s, exchanges would sharply increase between the two countries in politics, tourism, defence, business, and [student](/wiki/Student_exchange_program) and community-based exchanges. #### Warship-naming controversy In February 2014, it was reported in the *[Kompas Daily](/wiki/Kompas)* that one of the three new [*Bung Tomo*-class corvette](/wiki/Bung_Tomo-class_corvette) warships would be named the [KRI *Usman Harun*](/wiki/KRI_Usman_Harun) after Harun and Osman, which caused concern in Singapore. Then-coordinating Minister for Political, Legal and Security Affairs [Djorko Suyanto](/wiki/Djoko_Suyanto) defended the decision. In response to the naming, Singapore banned the ship from entering its water. Suyato responded to the ban by stating \"the ship has not even arrived yet, so what’s the fuss\"? They also withdrew its delegation from an international defence meeting, after two Indonesian men at the event were seen dressed in uniform. General [Moeldoko](/wiki/Moeldoko), Indonesia's military chief, apologised for the naming of the ship, which was accepted by Singapore in a statement by Singapore Defence Minister [Ng Eng Hen](/wiki/Ng_Eng_Hen). Moeldoko however later clarified that the naming of the ship was unfortunately irreversible. ### Memorial On 10 March 2015, 50 years after the bombing, a memorial dedicated to the victims of the [*Konfrontasi*](/wiki/Indonesia%E2%80%93Malaysia_confrontation) as well as soldiers who died during that period, was unveiled at [Dhoby Ghaut Green](/wiki/Dhoby_Ghaut_Green), situated across MacDonald House. It was built at the recommendation of the [Singapore Armed Forces Veterans League](/wiki/Singapore_Armed_Forces) (SAFVL) with the objective as a remembrance of the victims, as well as to educate younger generations about the tragedy. The unveiling was officiated by [Minister for Culture, Community and Youth](/wiki/Ministry_of_Culture,_Community_and_Youth) [Lawrence Wong](/wiki/Lawrence_Wong), as \"a lasting reminder of the victims of *Konfrontasi*, and those who risked their lives defending our country\". Religious leaders from the [Inter-Religious Organisation](/wiki/Inter-Religious_Organisation) also prayed at the site, before laying a wreath on the monument. - [Indonesia–Malaysia confrontation](/wiki/Indonesia%E2%80%93Malaysia_confrontation) - [Capital punishment in Singapore](/wiki/Capital_punishment_in_Singapore) - [Usman Haji Muhammad Ali](/wiki/Usman_Haji_Muhammad_Ali) - [Harun Thohir](/wiki/Harun_Thohir) - David Brazil (1 May 2006). *Insider's Singapore*. [Times Books](/wiki/Times_Books); [National Library Board](/wiki/National_Library_Board). [ISBN](/wiki/ISBN_(identifier)) 981204762X. - Mushahid Ali (23 March 2015). \"Konfrantasi: Why Singapore was in Forefront of Indonesian Attacks\" (PDF). *RSIS Commentary*. [S. Rajaratnam School of International Studies](/wiki/S._Rajaratnam_School_of_International_Studies), [Nanyang Technological University](/wiki/Nanyang_Technological_University). Portals: - Singapore - Indonesia - Malaysia\n",
  "language": "en",
  "processed_at": "2026-01-12T11:27:36.626617",
  "title": "MacDonald House bombing",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/MacDonald_House_bombing"
}