{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:27:39.116630"
  },
  "content": "Neighbourhood in MacPherson, Geylang, Singapore **MacPherson** is a neighbourhood located within the district of [Geylang](/wiki/Geylang) in the [Central Region](/wiki/Central_Region,_Singapore) of [Singapore](/wiki/Singapore). Its location roughly corresponds to the identically titled subzone in the [Geylang Planning Area](/wiki/Planning_Areas_of_Singapore) and is approximately sandwiched between the neighbourhoods of [Aljunied](/wiki/Aljunied) and Paya Lebar. MacPherson largely consists of various [public housing](/wiki/Public_housing) estates centred on Circuit Road and an industrial area. The [Pelton Canal](/wiki/Kallang_River#Pelton_Canal) runs through the neighbourhood, which separates a private housing estate off MacPherson Road, and the public housing estate along Circuit Road. Many residents in MacPherson are from the older generation, as the area was one of the first major public housing projects developed between the 1950s to 1970s. As a result, the majority of facilities in MacPherson are designed to be wheelchair and elderly-friendly. Nevertheless, in recent years, multiple [built-to-order](/wiki/Build_to_order_(HDB)) (BTO) public housing developments have been constructed, such as MacPherson Spring and MacPherson Weave, which are geared towards newly established young families. The neighbourhood is served by MacPherson Community Club, operated by the [People's Association](/wiki/People%27s_Association) (PA) with Residents' Committee (RCs) and Neighbourhood Committees (NCs) scattered around the entire neighbourhood. These organisations facilitate various programmes to promote community involvement and interaction among residents. Politically, MacPherson is represented in [Parliament](/wiki/Parliament_of_Singapore) as a division in [Marine Parade–Braddell Heights Group Representation Constituency](/wiki/Marine_Parade%E2%80%93Braddell_Heights_Group_Representation_Constituency) (GRC), with [Tin Pei Ling](/wiki/Tin_Pei_Ling) from the governing [People's Action Party](/wiki/People%27s_Action_Party) (PAP) as its [Member of Parliament](/wiki/Member_of_Parliament) (MP) since 2011.[a] ## Etymology The area is also alternatively called **Jalan Klapa**, as the area historically ran through a coconut plantation. MacPherson Road was named after [Colonel](/wiki/Colonel) [Ronald MacPherson](/wiki/Ronald_MacPherson) (1817–1869). MacPherson was involved in the [First Opium War](/wiki/First_Opium_War) of 1841 and was appointed Staff Officer to the [Artillery](/wiki/Artillery) in the [Straits Settlements](/wiki/Straits_Settlements) in 1843. He succeeded [Colonel](/wiki/Colonel) H. Man as Executive [Engineer](/wiki/Engineer) and Superintendent of Convicts and Resident Councillor, [Malacca](/wiki/Malacca) in 1855 and 1857 respectively. He had been active in forming a local volunteer [corps](/wiki/Corps) at the outbreak of the [Crimean War](/wiki/Crimean_War) and was appointed First Captain Commandment of the [Singapore Volunteer Rifle Corps](/wiki/Singapore_Volunteer_Corps) (SVRC) that was formed in 1854. When the first Municipal Act came into operation in 1856, he became an [ex officio](/wiki/List_of_Latin_phrases_(A%E2%80%93E)) member of the Commission, becoming President on three later occasions. He was appointed the first Colonial Secretary when the [Straits Settlements](/wiki/Straits_Settlements) became a [Crown Colony](/wiki/Crown_Colony) in 1867. MacPherson had also designed the current [St Andrew's Cathedral](/wiki/Saint_Andrew%27s_Cathedral,_Singapore) along the lines of the ruined [Netley Abbey](/wiki/Netley_Abbey) in [England](/wiki/England) and had built it in six years using forced [penal labour](/wiki/Penal_labour) sent over from the [British Raj](/wiki/British_Raj). Completed in 1862, the [cathedral](/wiki/Cathedral) is considered one of the finest specimens of ecclesiastical [architecture](/wiki/Architecture) in the [Far East](/wiki/Far_East). On the [cathedral](/wiki/Cathedral) grounds, the architect is commemorated in a [memorial](/wiki/Memorial) called the MacPherson Memorial Monument. MacPherson died in 1869 and was subsequently buried at the old [Bukit Timah](/wiki/Bukit_Timah) Road Christian Cemetery, by which around this time Jalan Klapa was subsequently renamed in commemoration. The cemetery today has since been [landscaped](/wiki/Landscape_architecture) and made into a [park](/wiki/Park). The name [Macpherson](/wiki/Macpherson) itself – or MacPherson or [McPherson](/wiki/McPherson), according to different spellings – is believed to have come from the [Gaelic](/wiki/Goidelic_languages) Mac a' phearsain and means 'Son of the parson'. For some old folks it was called Persiaran Keliling. ## Religion The neighbourhood is served by religious sites such as churches, temples and mosques. They include Trinity Christian Centre, Grace Baptist Church, Sallim Mattar Mosque and Huang Lao Xian Shi Temple. These religious organisations often have charity extensions and are actively serving the needy in the MacPherson neighbourhood. ## Parks and greenspace Parks and recreational facilities are distributed around the neighbourhood, with the main park being the [Pelton Park Connector](/wiki/Park_Connector_Network), which stretches the entire distance from Balam Road to Paya Lebar Way. There are also larger parks such as the [Aljunied Park](/wiki/National_Parks_Board) located near the neighbourhood. ## Education The [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)) has a total of 4 mainstream Primary and Secondary Schools in MacPherson, Singapore. They are [Geylang Methodist School (Primary)](/wiki/List_of_primary_schools_in_Singapore), [Geylang Methodist School (Secondary)](/wiki/List_of_secondary_schools_in_Singapore), [Canossa Catholic Primary School](/wiki/List_of_primary_schools_in_Singapore), and [St. Margaret's Primary School](/wiki/List_of_primary_schools_in_Singapore), which is temporarily relocated here for improvements work to be conducted on their old campus. There is also a school for special needs students, called Canossian School. ## Infrastructure ### Transportation The neighbourhood is served by the [Circle MRT line](/wiki/Circle_Line_(Singapore)) and [Downtown MRT line](/wiki/Downtown_Line) at [MacPherson MRT station](/wiki/MacPherson_MRT_station) and [Mattar MRT station](/wiki/Mattar_MRT_station). ### Healthcare The neighbourhood is served by the [Geylang Polyclinic](/wiki/National_Healthcare_Group), which is operated by the [National Healthcare Group](/wiki/National_Healthcare_Group) (NHG). There are also many private general practitioners around the neighbourhood, usually located below the public housing flats. The nearest shopping malls are 18 Tai Seng, Paya Lebar Square, and Paya Lebar Quarter. The majority of the shopping options here in MacPherson are located in the markets or along the [HDB shophouses](/wiki/Housing_and_Development_Board). ## Hawker food culture A distinctive identity of MacPherson from the rest of Singapore are its [hawker food](/wiki/Hawker_centre) culture. The neighbourhood's hawker centres are often featured and patronised by [local media](/wiki/Mediacorp) as well as [food bloggers](/wiki/Food_blog), including international ones. In particular, five distinctive and large hawker centres located in MacPherson encompasses the entire neighbourhood. To cater to the diversity of races and religions in MacPherson, and Singapore in general, they serve unique dishes stemming from [Singaporean cuisine](/wiki/Singaporean_cuisine) which had been created by the local [Chinese](/wiki/Chinese_Singaporean), [Malay](/wiki/Malay_Singaporean), [Indian](/wiki/Indian_Singaporean) and [Eurasian](/wiki/Eurasians_in_Singapore) communities. Most notably, the hawker centres that have been intensively featured by the news and on social media are 79 and 79A Circuit Road Hawker Centre, as well as the two-storey complex located at 80 Circuit Road Food Centre. Although hawker centres are widespread throughout the country, the allure towards MacPherson are due to the fact that the majority of the hawker stall owners are older and would prepare their food in the traditional styles, and due to the demographics of MacPherson, the cost of food is also lower for more widespread affordability. However, there is also a trend of newer hawkers, typically of a younger age, starting out their first hawker stall which sells regional Asian cuisines, such as [Japanese](/wiki/Japanese_cuisine), [Korean](/wiki/Korean_cuisine), and [Thai cuisine](/wiki/Thai_cuisine). ## Notes\n",
  "language": "en",
  "processed_at": "2026-01-12T11:27:39.116160",
  "title": "MacPherson, Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/MacPherson,_Singapore"
}