{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:27:24.985081"
  },
  "content": "The topic of this article **may not meet Wikipedia's notability guidelines for companies and organizations**. Please help to demonstrate the notability of the topic by citing reliable secondary sources that are independent of the topic and provide significant coverage of it beyond a mere trivial mention. If notability cannot be shown, the article is likely to be merged, redirected, or deleted. *Find sources:* \"MAD School\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(September 2021)* *(Learn how and when to remove this message)*Advertising & design school in Singapore **MAD School** is a school established by Chatsworth Medi@rt Academy in [Singapore](/wiki/Singapore) in 2003. The school's name is an acronym for \"Marketing, Advertising, and Design\". It is an [undergraduate](/wiki/Undergraduate) and [postgraduate](/wiki/Postgraduate) school for studies in the fields of [marketing](/wiki/Marketing), [advertising](/wiki/Advertising) and [design](/wiki/Design). It was founded by Ms. Michelle Lim, who used to work as a financial trader at a top investment firm in Singapore. The school trains around 300 - 500 students a year. ## Lecturers The school sometimes employs practitioners in [advertising](/wiki/Advertising) as instructors. \"Lim was also adamant that the lecturers be current industry practitioners in order to remain relevant to students. Some of them, like Pocket Magazine's creative director Andrew Tan, have won a host of international awards. Others come with impressive portfolios and a long client list: Felix Ng's works have generally received good reviews in publications such as The Wall Street Journal and Monocle, while Muhammad Suhaimi Paat has done work for a range of clients including the government and Getty Images.\" The Edge Singapore, 1 February 2016 . Recently, the school has launched postgraduate program in [digital marketing](/wiki/Digital_marketing), gathers a group of master grade practitioners to be the mentors and speakers of the program. Such as Nick -CEO of YP Consulting, Jean - founder of AAGO Consulting, Daniel - APAC Director of Cloudera, Chelsea - CX of PayPal, Michelle - EVP of Lazada, Shah - HD of Palo IT etc. ## Partners The school has partnered with [Inquirer.net](/wiki/Philippine_Daily_Inquirer) to run advertising related courses in Philippines. The school is currently the partner of Association of Accredited Agency of Singapore (4As) in offering Professional Conversion Program under the Singapore nationwide skillsfuture and WSQ scheme. ## Charitable work The school has established a sister organisation called Make The Change to provide services to [charitable organizations](/wiki/Charitable_organization) at reduced rates or in some cases [pro bono](/wiki/Pro_bono). Make The Change also offers a series of workshops to empower the PWD communities for employment and changemaker programs for the youth to give back. ## Events Supported by the SG50 Celebration Fund (a fund from the government of Singapore to celebrate the turning of 50 years old of Singapore) “MAD About Singapore” was an Instagram exhibition organised by MAD School by Chatsworth Mediart Academy in collaboration with InstaSG (a community of Singapore Instagrammers) that allowed Singaporeans to share their online Instagram photos, expressing their Singaporean identity and passion for the nation. The exhibition was launched in September 2014 at ION. This Singapore school-related article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:27:24.984572",
  "title": "MAD School",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/MAD_School"
}