{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:27:42.796802"
  },
  "content": "Islamic-secular education institutions **Madrasahs in Singapore** are full-time, religious institutions that offer a [pedagogical](/wiki/Pedagogy) mix of [Islamic religious education](/wiki/Islamic_studies) and [secular education](/wiki/Secular_education) in their [curricula](/wiki/Curriculum). While the Arabic term '[madrasah](/wiki/Madrasa)' literally translates to 'school', whether religious or secular, the term 'madrasah' is legally and [colloquially](/wiki/Colloquialism) defined in [Singapore](/wiki/Singapore) today as an 'Islamic religious school'. There are currently six [madrasahs](/wiki/Madrasa) in Singapore offering primary to tertiary education, namely, [Aljunied Al-Islamiah](/wiki/Madrasah_Aljunied_Al-Islamiah), [Irsyad Zuhri Al-Islamiah](/wiki/Madrasah_Al-Irsyad_Al-Islamiah), [Al-Maarif Al-Islamiah](/wiki/Madrasah_Al-Maarif_Al-Islamiah), [Alsagoff Al-Arabiah](/wiki/Madrasah_Alsagoff_Al-Arabiah), [Al-Arabiah Al-Islamiah](/wiki/Madrasah_Al-Arabiah_Al-Islamiah), and Wak Tanjong Al-Islamiah. Four of them are [co-educational](/wiki/Mixed-sex_education), while the other two offer madrasah [education exclusively to girls](/wiki/Single-sex_education). Madrasah students take a range of Islamic religious subjects in addition to mainstream curriculum subjects and sit for the national examinations like their peers. They can often be easily identified by their distinctive traditional Malay uniform, including the *[songkok](/wiki/Songkok)* for boys and *[tudung](/wiki/Tudung)* for girls, in stark contrast to national schools that prohibit such religious headgear. Madrasahs are deeply rooted in [Singapore's history](/wiki/History_of_Singapore), and prior to [Singapore's independence](/wiki/Independence_of_Singapore_Agreement_1965), had enjoyed a \"golden period\" in becoming the centre of Islamic education in the region by producing and attracting many of the prominent [Islamic religious scholars](/wiki/Ulama). But by the turn of the 21st century, madrasahs were forced to adapt and implement sweeping reforms in response to government policies and contemporary expectations by society and the Malay-Muslim society. Today, madrasahs have largely improved and excelled. However, challenges that pertain to their funding, curricula and teaching methodologies remain largely unsolved till today. ## History The term 'madrasah' is legally and colloquially defined in Singapore as a 'religious school'. Madrasahs have existed in Singapore since the import of Islam in the early 15th century . ### Medieval Era (1400s—1800s) Following the import of Islam into Singapore in the early 15th century, the earliest forms of Islamic schools in Singapore were rudimentary and informal in nature. These schools, namely the Qur'anic schools and *pondok* schools, usually centered around one [religious teacher](/wiki/Ustaz) offering to teach [Islam](/wiki/Islam) to students who became mere 'receptacles' to such teachings. Nonetheless, these Qur'anic schools and *pondok* schools flourished from the 15th to the late 19th century. #### Qur'anic school One of the earliest types of an informal Islamic educational institution was the Qur'anic school. It started in the halls of [Malay royal](/wiki/Monarchies_of_Malaysia) palaces where the religious teacher was engaged to teach Islam privately and voluntarily. The venue of these lessons gradually shifted to the homes of religious teachers, in mosques or in the surau (prayer halls). Qur'anic schools focused on the mastery of the [Arabic language](/wiki/Arabic) for the sole purpose of facilitating the [memorization](/wiki/Memorization) and [recitation](/wiki/Recitation) of the [Qur'an](/wiki/Quran). The students were taught about how to perform the [five daily prayers](/wiki/Salah), [fasting](/wiki/Fasting_in_Islam), [pilgrimage](/wiki/Pilgrimage_to_mecca) to [Mecca](/wiki/Mecca), [articles of faith](/wiki/Iman_(concept)), some forms of supplication and Arabic songs. Beyond this, students were not taught to learn the Qur'anic principles to comprehend their social, moral, political and economical roles as espoused in the Qur'an. In spite of the admittedly narrow approach to Islamic education, students of the Qur'anic school could proceed to learn the [Malay language](/wiki/Malay_language), which was then written in [Jawi script](/wiki/Jawi_alphabet), and in time be appointed as teachers. #### Pondok school Another type of Islamic educational institution that subsequently emerged was the *[pondok](/wiki/Pesantren)* [schools](/wiki/Pesantren) or pesantrans (*funduq* in Arabic), which literally translates to 'inn' or 'hotel'. It was an institution of learning that resembled a [boarding school](/wiki/Boarding_school), as students lived in simple huts built around the religious teacher's house. It was a private institution usually established by a well-known religious teacher. Subjects taught in the *pondok* include [Islamic theology](/wiki/Aqidah_(Islamic_theology)) (*tauhid*), [Quranic exegesis](/wiki/Tafsir) (*tafsir*), [Islamic jurisprudence](/wiki/Fiqh) (*fiqh*), [collections of sayings and teachings of the Prophet](/wiki/Hadith) (*hadith*), [Arabic grammar](/wiki/Arabic_grammar) (*nahu*), [Islamic mysticism](/wiki/Sufism) (*tasawwuf*) and [Islamic history](/wiki/History_of_Islam) (tarikh). These subjects were taught using [rote learning](/wiki/Rote_learning), [memorization](/wiki/Memorization), and the copying of texts of the teachings of Islam. Criticisms of the *pondok* schools were later leveled at their \"limited\" and \"constricted methods of teaching of Islam\". Despite its shortcomings, it is important to note that *pondok* schools significantly contributed \"towards a progressive eradication of myths and legends which were pervasive in Malay texts and society during the [Hindu](/wiki/Hinduism) era\". #### Madrasah As-Sibyan (1905—1923) The first recorded madrasah in Singapore, As-Sibyan, was established in 1905 at Bussorah Street in the vicinity of the [Sultan Mosque](/wiki/Masjid_Sultan). Despite its name, As-Sibyan resembled more of a *pondok* than that of a madrasah. As-Sibyan was run by an Indonesian religious teacher who taught in his home at Bussorah street. The main educational focus in As-Sibyan was the memorization of the Qur'an. As-Sibyan relocated to Lorong Engku Aman in [Geylang Serai](/wiki/Geylang) sometime around 1923. Unfortunately, little is known about As-Sibyan after that year. However, what is evident is that As-Sibyan had long since ceased operations because no *pondok* schools currently exist in Singapore today. ### Colonial Era (1908—1945) Muslim reformists were aware and discontented with the limitations of the Qur'anic and *pondok* schools, which they felt devoted too much attention on devotional worship and basic rituals of Islam (*fardhu a'in*) and did not sufficiently prepare Muslim students for [socio-economic](/wiki/Socio-economic) development and [employment](/wiki/Employment) opportunities. The early madrasahs in Singapore established by the reformists were therefore \"modernist institutions\", and were lauded for the attempt (albeit limited) to shift Islamic education away from such traditional forms to a more Westernised structure. #### Madrasah Al-Iqbal Al-Islamiah (1908—1909) The first \"modern madrasah\" in Singapore, Al-Iqbal Al-Islamiah, was established on 4 February 1908, and was located at 107 Selegie Road. It was founded by an Islamic reformist, Syed Sheikh Ahmad Al-Hadi, a prominent figure in Malay journalism, who was in turn influenced by other Islamic reformists such as [Muhammad Abduh](/wiki/Muhammad_Abduh) and [Rashid Rida](/wiki/Rashid_Rida). Compared to its predecessors, Al-Iqbal was a \"modern\" and \"revolutionary\" madrasah. In terms of pedagogy, it advocated [discourse](/wiki/Discourse) and [reasoning](/wiki/Reason), and emphasized on [debates](/wiki/Debate) and rhetoric in lieu of traditional [rote learning](/wiki/Rote_learning) and memorization. Its curriculum integrated a broad range of subjects from religious topics such as the usual recitation of the Qur'an, Arabic language and [grammar](/wiki/Arabic_grammar), and [Islamic ethics](/wiki/Islamic_ethics), to other secular subjects such as [geography](/wiki/Geography), [history](/wiki/History), [mathematics](/wiki/Mathematics), [English](/wiki/English_language) and [town planning](/wiki/Urban_planning). Its founder, Al-Hadi, had also refined the madrasah [academic year](/wiki/Academic_year), introduced a new system of [examination](/wiki/Test_(assessment)), and established proper rules and regulations. Al-Iqbal was not well-received by the local Muslim community then. This can be attributed to two reasons. The first being its expensive school fees: boarders had to pay an annual fee of 300 [Straits dollars](/wiki/Straits_dollar) for accommodation, [uniforms](/wiki/School_uniform), [stationery](/wiki/Stationery), [laundry](/wiki/Laundry) and [medical](/wiki/Medicine) expenses, while non-boarders had to pay between 24 and 96 Straits dollars. Such fees were beyond the reach of the Muslim community at that time. Another reason for its poor reception was the resistance and disapproval of Al-Iqbal's modernist and reformist agenda by religious traditionalists. These traditionalists, who mainly comprised the official religious hierarchy and traditional Malay elite, deemed Al-Iqbal's practices as \"Westernized\" and \"profane\", and therefore contradictory to Islam. In the face of negative feedback by the local community, Al-Iqbal was forced to close and relocate to [Riau](/wiki/Riau) within 18 months of its opening. The quick demise of Al-Iqbal had diminished the \"reformist zeal\" of the early madrasahs, but did not extinguish it. Despite Al-Iqbal's premature closure, its legacy as a reformist madrasah was apparent—it is postulated that Al-Iqbal represented \"the forerunner of other reformist schools that were subsequently established throughout the Malay Peninsula in the following years.\" #### Madrasah Al-Maarif Al-Islamiah (1936—present) As an alternative to Al-Iqbal, Madrasah Al-Maarif was established in 1936 by Syeikh Muhammad Fadhlullah Suhaimi, a strong advocate of education for girls. Al-Maarif's reformist ideals were apparent from its inception: its curriculum included non-religious subjects. Al-Maarif was also the first madrasah to accept female students as well as male. Today, Al-Maarif is one of the only two madrasahs that offer madrasah [education exclusively to girls](/wiki/Single-sex_education). Associate Professor Khairudin and Dayang Hussin postulated that Al-Maarif and Al-Iqbal represented a new breed of madrasahs imbibing aspects of Islamic reformist ideals and accordingly, represented the beginning of formal Muslim education. As Assoc. Prof. Khairudin and Dayang Hussin wrote: > The structure of this madrassah was generally characterized by its systematic organization, such as fixed curriculum period, division of educational levels into primary and secondary, as well as existence of facilities such as chairs and tables for students. As for the enhancement of intellectual tradition, the madrassah incorporated other 'non-religious' subjects, such as mathematics and science (and other subjects depending on respective madrassah) in addition to subjects on Islam. By 1941, the madrasahs in Singapore were educating about 2,000 students in total. By this time, Singapore was a major regional centre of Islamic education, producing and attracting many of the prominent [Islamic religious scholars](/wiki/Ulama) (ulama) in the region. This period is thus often referred to as the \"golden period\" of madrasahs in Singapore. The question of whether madrasahs conformed to the mainstream [educational system of Singapore](/wiki/Education_in_Singapore) did not arise during the colonial era because the education landscape was already varied and each community catered to its own educational needs. Madrasahs were thus very much left to their own devices. ### Post-Independence Era (1945—2000) After [World War II](/wiki/World_War_II) ended in 1945, education became crucial for a young nation trying to ensure economic survival after [independence](/wiki/Independence). In response, more madrasahs attempted to stay relevant by incorporating secular subjects in their curriculum. By the time Singapore attained self-governance in 1959, the number of madrasahs had doubled from 6 to 12. The number of madrasahs, and students attending such institutions, further ballooned during the period of [merger between Singapore and Malaysia](/wiki/Singapore_in_Malaysia) (1963–1965), with the highest number reaching 28 Muslim schools in 1962. Another reported claimed a numerical peak of 26 madrasahs in Singapore by 1966. Despite its initial expansion, the popularity of madrasahs declined with the emergence of national schools, and many were closed. Whilst madrasahs in Singapore had previously shone as regional beacons of knowledge during the colonial era, their roles in the post-independence era were very much dim. The role of madrasahs became confined to the sole production of religious teachers and officials for the local community. Beyond this limited role, madrasahs merely served as \"a kind of [safety net](/wiki/Social_safety_net), taking in students who had failed the national school system... [in functioning] as providers of a social service to the community.\" By 1982, only four madrasahs providing secondary education and five providing primary education remained. To a large extent, the madrasahs \"became, very much, schools on the periphery\". #### Introduction of the Administration of Muslim Law Act (1966—present) With the passing of the [Administration of Muslim Law Act](/wiki/Administration_of_Muslim_Law_Act) (AMLA) in 1966, madrasahs came under the purview of the [Islamic Religious Council of Singapore](/wiki/Islamic_Religious_Council_of_Singapore) (MUIS) and numerous reforms were made. In that year, Madrasah Aljunied Al-Islamiah included English, Malay, mathematics and science in its curriculum, 39 years after its existence, and offered the GCE ['O' level examination](/wiki/Singapore-Cambridge_GCE_Ordinary_Level) for the first time in 1973. Madrasah Al-Maarif became the first to prepare its students for the GCE 'O' and ['A' level examinations](/wiki/Singapore-Cambridge_GCE_Advanced_Level) as private candidates. Despite these developments, madrasahs still faced challenges. By the mid-1980s, a gender disparity was apparent—almost 95% of madrasah students were female. This became a cause of concern for MUIS, which was worried that there would be a lack of male religious officials. #### Management and control by MUIS (1990—present) On 1 March 1990, MUIS gained control of the registration and management of madrasahs pursuant to Section 87 and 88 of AMLA. Sweeping reforms were made that \"revived interest in the kind of education madrasahs could offer\". A centralized curriculum for madrasahs was established. A degree of standardization among full-time madrasahs was also established. For example, the *Peperiksaan Sijil Thanawi Empat* (PSTE), which is a religious knowledge component certificate examination for students at the Secondary Four level in the madrasahs was introduced. By the late 1990s, the curriculum was revamped to include initiatives from the [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)) such as [information technology](/wiki/Information_technology) education and national education. However, despite the efforts by MUIS in consolidating and upgrading the madrasah system, results were \"slow and few, partly due to tacit resistance by the madrasahs\". These madrasahs, having established and managed themselves independently for many years, \"resented having to be answerable to MUIS under the new arrangement.\" Nevertheless, by the early 1990s, the decline in demand for madrasahs in the post-independence era began to reverse. During this period, the popularity and demand for madrasah education rose and peaked, so much so that the number of applications always superseded the enrollment, half of such applications had to be turned down, and the resulting student enrollment had more than doubled. ### Modern Era (2000—present) Despite the apparent popularity of the madrasahs, the growing community support had also added new pressures. During this period, both the Muslim community and Singaporeans as a whole experienced a general rise in [living standards](/wiki/Standard_of_living) and socio-economic status—and with it, a \"greater desire to widen the scope and vision of Islamic education\". There was a new expectation that madrasahs should provide not only religious education, but also academic skills like Mathematics, Science and English. Accordingly, this period was marked by debates and discourse over the purpose and relevance of madrasah education. In response, madrasahs were forced to adapt to such rapidly changing circumstances. #### Introduction of the Compulsory Education Act (2001—present) In light of the growing enrollment of students into madrasahs, the [Government of Singapore](/wiki/Government_of_Singapore) began to seriously raise its growing concerns of madrasah students of not conforming with the objectives of [national schools](/wiki/Education_in_Singapore) espoused by the state. In particular, questions were raised on the national platform as to whether madrasahs students can effectively contribute to a [knowledge-based economy](/wiki/Knowledge_economy), and participate in [social integration](/wiki/Social_integration) as part of [nation-building](/wiki/Nation-building). Statistics revealed by the Education Minister, [Rear Admiral](/wiki/Singapore_Armed_Forces_ranks) (NS) [Teo Chee Hean](/wiki/Teo_Chee_Hean), were particularly incriminating: Malay-Muslim students in national schools performed far better than their counterparts in madrasahs. Data further revealed a high attrition rate of 65% amongst madrasah students. This was troubling, because madrasah students who dropped out with only a primary or secondary education found that they had neither the necessary skills to join the national labor force nor the necessary qualifications to be religious educators. With these concerns at hand, [Prime Minister](/wiki/Prime_Minister_of_Singapore) [Goh Chok Tong](/wiki/Goh_Chok_Tong) mooted his proposal for a compulsory education policy in his 1999 [National Day Rally](/wiki/Singapore_National_Day_Rally) Speech. This proposed policy meant that children between the ages of six and 15 must attend six years of primary school education at a national school. The policy effectively implied that madrasahs could no longer offer their primary classes as an alternative to national primary schooling. In support of the policy, PM Goh said: > Issue not about madrasah's future, but the future of Muslim children ... 'Do you want them to grow up all being religious teachers and religious preachers, or do you want them to be trained in IT, to be engineers, doctors, architects, professionals? If the madrasahs were training 100 or 200 students a year, I think we can live with that. But if you are training 400, 500, 1000, 2000 in full-time madrasahs or in full-time religious education supplemented by some secular subjects, what will be the future of the Malay community? ... I cannot say, however, that some madrasahs may not close because we want to have standards. — Prime Minister Goh Chok Tong , *May Day Rally, The Straits Times, 2 May 2000* Senior Minister [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) (as he then was) echoed his successor's views in an exclusive interview with the [Reader's Digest](/wiki/Reader%27s_Digest): > But for the resurgence of Islam, it would have been a success. … Some 10 per cent of the population are [sic] in specially run religious schools where you learn Arabic and the Quran and Malay, and a little bit of Science and Mathematics and English, but in a fast-changing society like Singapore, how are you going to make a living later on? That worries me. — Senior Minister Lee Kuan Yew, Interview with the Reader's Digest The proposal for a compulsory education policy drew \"mixed but intense response from different sections of the Malay-Muslim community\". On one hand, some recognized the inadequacies of the madrasah system and supported the policy—such was the view of the Malay political leaders and some community leaders. On the other hand, madrasah advocates were \"aroused, if not agitated\", and vehemently resisted the policy which they had perceived to be a governmental ploy, made with a \"sinister motive\" \"to undermine the Muslim parochial school system\". Many saw the policy as infringing on their right and [freedom to educate](/wiki/Freedom_of_education) their children in a manner they see fit. They were also genuinely concerned that there would be insufficient number of students who would be motivated to switch to the madrasah after having spent six years in the national schools, leading to an extinction of the madrasahs. In any case, they argued, religious education would be less effective if it were to start later at the secondary level. In a statement released to the press, the Singapore Islamic Scholars & Religious Teachers Association (PERGAS) tersely asserted: > PERGAS rejects the proposal, in its present form, to implement this [compulsory education] if it causes the closure of schooling in primary madrasah, which to PERGAS is tantamount to the gradual and inevitable closure of the madrasah, even if not intended... Any future proposal seen as undermining this institution would certainly invite negative reaction. — Singapore Islamic Scholars & Religious Teachers Association (PERGAS), Press Statement, \"The 'Compulsory Education' – Madrasah Issue: The Stand of PERGAS\" The defiant stance of madrasah advocates made clear that the majority of the Muslim community was anxious to maintain the madrasah institution. After a series of closed-door meetings and open forums, PM Goh announced that madrasahs could be exempted from compulsory education on condition that they prepared their primary school students for the national exam, the [Primary School Leaving Examination](/wiki/Primary_School_Leaving_Examination) (PSLE). Madrasah students must meet the score set by Malay pupils in the six lowest-performing national schools at the PSLE at least twice within a three-year period. Failure to meet this benchmark would mean that particular madrasah would not be allowed to offer primary classes for a year. New intakes of students into madrasahs would be capped at 400 a year. PM Goh further emphasized that the policy was not intended to close down the madrasahs, and the Government's willingness to support one madrasah from primary to secondary level was testimony to its recognition of the importance of madrasahs. This was later honoured when the Government upgraded Madrasah Irsyad with the necessary funding and infrastructure support, allowing the madrasah to shift to a $16 million, eight-storey building at the Singapore Islamic Hub on Braddell Road. The enactment of the Compulsory Education Act in 2001, and its eventual implementation in 2003, meant that madrasahs had to prepare the pioneer batch of madrasah students seating for their PSLE in 2008 to meet the benchmark, lest the authorities halt primary enrollment for that particular madrasah. To this end, the \"PSLE requirement\" has been described as \"the main driver of change for Singapore madrasahs in the 21st century.\" In order to make the cut, madrasahs made sweeping reforms and necessary preparations by equipping students with improved competencies in English, Mathematics and Science. Such measures include a greater emphasis on English as a medium of instruction, and the introduction of a learning support programme to assist weaker students. Madrasah Aljunied, for example, devoted 7 hours a week to the subject of mathematics, compared to 3 previously. School hours were also extended to accommodate both religious and secular subjects in preparation for the PSLE. Despite taking such measures, Madrasah Wak Tanjong did not meet the benchmark twice in the 3-year assessment period from 2008 to 2010. As a result, it could only resume its primary school enrollment in 2015. Of the pioneer batch in 2008, 98% of the 321 pupils qualified to progress to secondary school, higher than the national average of 97%. In 2009, 93% of the 363 pupils who sat for the PSLE qualified for secondary school. Since the inception of the PSLE requirement, the majority of the madrasahs in Singapore have consistently met the benchmark till today. In 2015, Minister-in-charge of Muslim Affairs, [Yaacob Ibrahim](/wiki/Yaacob_Ibrahim) announced that the academic performance of madrasah students have improved over the years. He pointed out that in 2014, 61.7% of madrasah students made it to the Express stream, a 16% increase compared to the year before. ## Madrasah education in Singapore As private institutions, madrasahs do not receive full Government funding and are only \"loosely regulated\" by the Ministry of Education. Madrasahs are individually run by their self-appointed management committees, and are thus conferred significant autonomy to develop and select their own curriculum time, teaching methodologies, educational materials and their own teachers. As a consequence, the structure and pedagogy of the madrasahs often greatly differ from the conventional [educational system in Singapore](/wiki/Education_in_Singapore), and even amongst themselves. ### Structure Today, there are six full-time madrasahs with approximately 4,400 students and 220 religious teachers in total. They have a combined annual intake of about 400 students. It was recognised that it was not \"efficient or effective for each madrasah to have primary and secondary or even pre-university classes\", given the small number of students entering the madrasahs each year. Accordingly, in January 2009, the Joint-Madrasah System (JMS) was implemented to further improve the quality of madrasah education in Singapore. The JMS includes three of the six full-time madrasahs. Under the new system, Irsyad will provide only primary education while Aljunied and Al-Arabiah will only offer secondary and tertiary education. Accordingly, Irsyad will become the feeder primary school to Aljunied and Al-Arabiah. Aljunied will specialize in religious schooling, while Al-Arabiah will specialize in academic, secular schooling. Under this system, students are thus afforded \"more choices\" to excel in what they desire, be it in religious studies or in academic learning. The system would also offer a \"broad-based\", \"multidisciplinary and integrated curriculum\", which has been described as \"a major paradigm shift in madrasah education.\" Facilities of madrasahs under the JMS have been upgraded to support the revamped curriculum, thus allowing for more enrichment programs beyond the classroom and madrasah. A S$2 million fund has been allocated to the JMS for the recruitment of new teaching and administrative staff. The JMS is expected to be fully implemented by 2015. Upon graduation from the tertiary level, the most outstanding students often choose to pursue [undergraduate studies](/wiki/Undergraduate_education) at the prestigious [Al-Azhar University](/wiki/Al-Azhar_University) in [Cairo](/wiki/Cairo), [Egypt](/wiki/Egypt). Others may opt for enrollment at the [International Islamic University Malaysia](/wiki/International_Islamic_University_Malaysia) or [Universiti Sains Islam Malaysia](/wiki/Universiti_Sains_Islam_Malaysia), among other overseas universities. When graduates return, most end up as religious teachers at full-time or part-time madrasahs. Others find jobs that deal with Muslim affairs in government institutions such as MUIS or the Syariah Court. A handful of students who attend local universities or polytechnics would go on to obtain careers in their respective professional fields. ### Pedagogy Different madrasahs provide different pedagogies and juggle both religious and secular subjects in differentiated ways and with varying degrees of success—there are no uniform approaches or common curriculum. Madrasah Alsagoff and Madrasah Aljunied, riding on their reputation as excellent institutions of religious education, \"have kept as much as seventy percent of the curriculum time for religious subjects, including Arabic, while English, Malay and Mathematics remain at the periphery.\" In contrast, madrasahs such as Wak Tanjong, Al-Maarif and Irsyad provide roughly equal emphasis to religious and secular subjects. In recent years, madrasahs have been increasing curriculum time for English, Mathematics, and Science to match the time spent on these subjects in mainstream schools. To accommodate both, the school day at Irsyad Zuhri Al-Islamiah is three hours longer than at the mainstream schools. It is accepted that such an orientation, however, will compromise to a great extent the emphasis on religious education and values in madrasahs. In spite of fears that the madrasah identity would be lost, such improvements in the students' knowledge repertoire have, in fact, added to the attractiveness of madrasah education. Irsyad said it was in talks to export its widely commended madrasah model to madrasas in the Philippines and Thailand. ## Challenges ### Curriculum objectives One of the challenges madrasahs face is whether madrasah students can effectively contribute to the knowledge-based economy. Professor Mukhlis particularly asserts that the current objectives of including secular subjects has been \"mostly for [utilitarian](/wiki/Utilitarianism) ends,\" and does not fully embody the true reformist objective of acquiring secular knowledge \"as intrinsic to man's rational nature,\" which was evident in the early madrasahs. ### Finances As private institutions, madrasahs historically receive funding mainly from wealthy Muslim philanthropists or Muslim-based organizations. Today, the issue of funding poses one of the most severe, perennial problems plaguing madrasah education since the 1960s, and is often a contributing factor itself to the other challenges faced by madrasahs. The lack of funds naturally hinders madrasahs from procuring the necessary upgrades to resources, facilities, supplies and [infrastructure](/wiki/Infrastructure). Whilst teachers at national schools are among the most highly paid [civil servants](/wiki/Civil_service), madrasahs often face difficulties in attracting qualified teachers due to their lack of funds. In addition, most madrasah teachers receive little training in pedagogy, making standards \"rather patchy\". In the case of one madrasah, more than S$800,000 was required to finance its annual operations, but only 50% of this was met through fees and miscellaneous grants disbursed by MUIS. Valuable, scarce resources had to be diverted to fulfill the other 50% through [fund raising](/wiki/Fundraising) efforts. The long-standing issue of funding has been noted and discussed on numerous occasions, but without being adequately resolved. The launch of the Madrasah Fund in 1994 allowed madrasahs to tackle existing funding problems with contributions from the public, MUIS and Mendaki, and provided a respite to a certain extent. As of 2012, a total of S$5.18 million were directly disbursed to all six madrasahs from the Madrasah Fund. In addition, an endowment fund was set up by MUIS in 2012 to provide further financing for the madrasahs. Wakaf Ilmu, as the fund is called, is composed of contributions from an Islamic general endowment fund administered by the MUIS, corporate donations, and donations and pledges from the public, including students. As of 2014, the Wakaf Ilmu fund has grown to $6.3 million, more than double the initial amount of $3 million when it was first set up. These funding issues have been repeatedly raised to the Government. In August 2011, an email [petition](/wiki/Petition) was collated on behalf of the parents of Madrasah Irsyad students calling upon the Government to extend annual [Edusave scheme](/wiki/Edusave) to their children. The Edusave scheme was implemented in 1993 to provide yearly monetary contributions to every student for their holistic development, but madrasah students were conspicuously left out. It was only after 20 years from its inception did the Government decide to grant the annual Edusave grant to madrasah students in 2013. Madrasahs students, however, remain ineligible for Edusave awards. The rationale given by Minister of State for Education, [Sim Ann](/wiki/Sim_Ann), was that these awards only recognise \"secular academic and non-academic achievements in the context of Ministry of Education-funded schools\", and are thus inappropriate for madrasahs. On 23 August 2015, Prime Minister [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) pledged that the Government will work with the MUIS to strengthen the teaching of secular subjects in madrasahs such as mathematics and science. It will also give financial aid to improve the skills of these teachers, and fund awards for students who do well in them. Speaking in Malay, PM Lee said that it is \"important for our religious scholars and leaders to have a good grounding in non-religious subjects. It prepares them to guide Singapore's Muslims to live in a modern, technological society.\" PM Lee assured that while the Government will help with secular subjects, it will leave religious education in the hands of MUIS and the community. It is reported that these enhanced Government support to madrasahs have enjoyed a \"positive response\" by madrasah students and staff alike. In 2015, Minister [Yaacob Ibrahim](/wiki/Yaacob_Ibrahim) announced that madrasah students will no longer have to pay national examination fees, similar to that of other students studying in national schools. These fees will be footed by MUIS and the [Ministry of Culture, Community and Youth](/wiki/Ministry_of_Culture,_Community_and_Youth). ### Teaching methodology In addition, most madrasah teachers receive little training in pedagogy, making standards \"rather patchy\". Since 2008, MUIS has spent more than S$3 million on teacher training programmes organised in partnership with the National Institute of Education (NIE) and Edith Cowan University in Australia, workshops and seminars. a number of teachers to pursue teaching qualifications at the National Institute of Education in Singapore and at Edith Cowan University in Australia. In November 2007, MUIS and the National Institute of Education jointly launched a specialist diploma course aimed at equipping madrasah teachers with critical pedagogical skills. It is estimated that 90% of the teachers at madrasahs would have sat for the diploma by the end of 2010. By 2012, 73 madrasah teachers have obtained their Diploma in Education qualification and another 76 teachers have graduated from the Specialist Diploma Programme at the NIE. Informally, some teachers have, at their own initiative, tapped into their networks of friends and acquaintances in mainstream schools to arrange for brief attachments to these schools for lesson observations. ### National Integration Another challenge madrasahs face is whether the madrasah students can integrate into the larger society. In 2004, Madrasah Wak Tanjong (located at Sims Avenue) included in its national day celebrations and open house, four teachers and 40 students from Takada Junior High, a Buddhist school in Nagoya, Japan. These teachers and students were part of an ongoing exchange programme with the madrasah. - Singapore portal - Education portal - [Abu Bakar bin Taha](/wiki/Abu_Bakar_bin_Taha) - Noor Aisha Abdul Rahman & A. E. Lai (2006). \"Between State Interests and Citizen Rights: Whither the Madrasah\". Secularism and Spirituality: Seeking Integrated Knowledge and Success in Madrasah Education in Singapore. Singapore: Singapore: Institute of Policy Studies & Marshall Cavendish Academic. pp. 29–57. [ISBN](/wiki/ISBN_(identifier)) 978-9812104526. - Mutalib, Hussin (2012). Singapore Malays: Being Ethnic Minority and Muslim in a Global City-state. Singapore: Routledge. p. 72. [ISBN](/wiki/ISBN_(identifier)) 978-0415509633. - http://www.madrasah.sg/News/index.html Archived 2016-03-04 at the [Wayback Machine](/wiki/Wayback_Machine)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:27:42.796356",
  "title": "Madrasahs in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Madrasahs_in_Singapore"
}