{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:27:40.700764"
  },
  "content": "Madrasah school in Singapore **Madrasah Alsagoff Al-Arabiah** is one of the six [full-time Madrasahs in Singapore](/wiki/Madrasahs_in_Singapore) recognised by [Majlis Ugama Islam Singapura](/wiki/Majlis_Ugama_Islam_Singapura) (MUIS). It is known for its academic emphasis on its language and religious subjects.[*citation needed*] The [architectural design](/wiki/Architecture) of the school is partly influenced by the Dutch-Indies, and also reflects the local culture and climate. Alsagoff is recognised as one of Singapore's heritage schools. ## History Alsagoff was founded in accordance to the will of [Syed Mohamed bin Syed Ahmad Alsagoff](/wiki/Syed_Mohamed_Syed_Ahmad_Alsagoff) in 1912. It is therefore the oldest madrasah in Singapore. Alsagoff was first established as an [all-boys](/wiki/Single-sex_education) school. In the 1940s, Alsagoff began taking in female students as well, albeit in a separate school session, making it a [co-ed](/wiki/Mixed-sex_education) school. When the number of male students started to decrease, Alsagoff stopped taking in boys, making it an all-girls school. ## Curriculum Alsagoff places great emphasis on the [Arabic language](/wiki/Arabic). Arabic is the medium language in almost all religious subjects and students are encouraged to speak in Arabic during these lessons. It also offers other academic and language (English and Malay) subjects. Students can participate in various co-curricular activities catered for different levels. ## Notable alumni - [Dato Seri Setia Dr. Haji Pengiran Mohammad Bin Pengiran Haji Abdul Rahman](/wiki/Mohammad_bin_Abdul_Rahman), Brunei's Minister of Religious Affairs. - Singapore portal - Education portal This Singapore school-related article is a stub. You can help Wikipedia by expanding it.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:27:40.700248",
  "title": "Madrasah Alsagoff Al-Arabiah",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Madrasah_Alsagoff_Al-Arabiah"
}