{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:27:46.716026"
  },
  "content": "* *Maestro Guitars** is a [guitar](/wiki/Guitar) manufacturing company based in [Singapore](/wiki/Singapore). It is best known for creating custom-made [acoustic guitars](/wiki/Acoustic_guitar) and [ukuleles](/wiki/Ukulele). The founder is Ho Zen Yong, a former Singapore Management University (SMU) graduate. Their instruments are used by professional Italian musician [Franco Morone](/wiki/Franco_Morone) and were also used by guitarist Paul Ponnudorai. ## History The founder of Maestro Guitars, Ho Zen, started off learning how to fix guitars in his father’s piano shop. In 2004, he improved his guitar-making skills by learning them from an English [luthier](/wiki/Luthier) Chris Horton, in Goa. He further understudied with the famed Ervin Somogyi in 2015 in a bid to increase the responsiveness of his guitars. Upon his return in 2006, Ho Zen started Maestro Guitars Singapore's workshop in Kaki Bukit. The company's name, Maestro, was inspired by the [Spanish](/wiki/Spanish_language) word of the same spelling which translates to mean \"master\". In music, a \"maestro\" refers to someone who is a master in his art, especially a composer, conductor or music teacher.[*citation needed*] In 2015, Maestro Guitars launched two new acoustic guitar models and showcasing a few models from their Double Top Series and Island Series ukuleles at the [NAMM Show](/wiki/NAMM_Show). ## Company Profile Maestro Guitars is best known for its custom-made guitars. The guitars are handcrafted in a 100% humidity controlled facility to ensure its stability and dependability. They also use new technology such as the flame-resistant material, [Nomex](/wiki/Nomex), to craft their guitars. The company is presently looking to expand to Asian countries such as Hong Kong and Malaysia. Their products are also available in Australia, Belgium and France. The company works with various companies to provide materials for their custom-made guitars, such as [Elixir Strings](/wiki/Elixir_Strings), [Grover Musical Products](/wiki/Grover_Musical_Products) and [d'Addario](/wiki/D%27Addario_(manufacturer)).[*citation needed*] - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:27:46.715563",
  "title": "Maestro guitars",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Maestro_guitars"
}