{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:27:48.976881"
  },
  "content": "Singaporean physician **Maggie Lim** ( 5 January 1913 – November 1995, [Chinese](/wiki/Traditional_Chinese_characters): 林陈美仪) was a Singaporean physician and public health official. She was inducted into the [Singapore Women's Hall of Fame](/wiki/Singapore_Women%27s_Hall_of_Fame) posthumously, in 2014. ## Early life Maggie Tan was born into a prominent family, the daughter of businessman Tan Kwee Swee, granddaughter of businessman [Tan Kim Ching](/wiki/Tan_Kim_Ching), and great-granddaughter of Chinese philanthropist [Tan Tock Seng](/wiki/Tan_Tock_Seng). She attended [Raffles Girls' School](/wiki/Raffles_Girls%27_School_(Secondary)), and later, by special arrangement, Raffles Boys' School. In 1930, she was the first Singaporean schoolgirl to win a [Queen's Scholarship](/wiki/Queen%27s_Scholar_(British_Malaya_and_Singapore)). (Her brother [Tan Thoon Lip](/wiki/Tan_Thoon_Lip) won the same scholarship the previous year.) She earned a medical degree at the [London School of Medicine for Women](/wiki/London_School_of_Medicine_for_Women) and the [Royal Free Hospital](/wiki/Royal_Free_Hospital). She returned to Singapore in 1940. ## Career During [World War II](/wiki/World_War_II), Lim was a camp doctor at Endau Settlement in [Johor](/wiki/Johor_Bahru), supporting the [Malayan Peoples' Anti-Japanese Army](/wiki/Malayan_Peoples%27_Anti-Japanese_Army). After the war, Lim was an obstetrician and public health official in Singapore. She worked for the Singapore Municipal Health Department at the Prinsep Street Infant Welfare Clinic, especially on promoting birth control awareness, addressing childhood infectious diseases, and expanding maternal and child clinic access. Lim was honorary medical officer of the Singapore Family Planning Association when it began in 1949. In early 1951, she was briefly detained with others, by the government, on charges of spreading [Malayan Communist Party](/wiki/Malayan_Communist_Party) propaganda. In 1963, she became head of the maternal and child welfare department in the Ministry of Health. She was president of the Family Planning and Population Board, and an advisor to the Midwives' Council. She served on the Singapore Hospitals Board, and was an officer of the Singapore Paediatric Society. Later in her career, Lim was a professor of epidemiology and public health at the [University of Hawai'i](/wiki/University_of_Hawai%CA%BBi)'s [East–West Center](/wiki/East%E2%80%93West_Center). While in Hawai'i, she served as vice president of Hawaii [Planned Parenthood](/wiki/Planned_Parenthood). Lim was a member of the [Royal College of Surgeons](/wiki/Royal_College_of_Surgeons) and the [Royal College of Physicians of London](/wiki/Royal_College_of_Physicians). ## Personal life Maggie Tan married another Queen's Scholar, political activist Lim Hong Bee. They had two daughters; Patricia Lin, a television presenter in Singapore and later a professor in California, and Gillian Lin, a graduate of the Royal College of Music, London who performed internationally as a concert pianist and recording artist for RCA. Lim died in [Claremont, California](/wiki/Claremont,_California). She was posthumously inducted into the Singapore Women's Hall of Fame in 2014. Singaporean playwright [Stella Kon](/wiki/Stella_Kon) is Maggie Lim's grand-niece. - Photographs of Maggie Lim, from [National Heritage Board, Singapore](/wiki/National_Heritage_Board_(Singapore)). Portal: - Biography\n",
  "language": "en",
  "processed_at": "2026-01-12T11:27:48.976514",
  "title": "Maggie Lim",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Maggie_Lim"
}