{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:27:52.699853"
  },
  "content": "2021 terrorist plot in Singapore The **Maghain Aboth Synagogue attack plot** was a plan by 20-year old Amirull Ali, a member of the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces), to stab three members of the [Maghain Aboth Synagogue](/wiki/Maghain_Aboth_Synagogue) in retaliation for the role of Israel and Jews in the [Israel-Palestine conflict](/wiki/Israel-Palestine_conflict). Ali also planned to travel to [Gaza](/wiki/Gaza_Strip) to join [Hamas](/wiki/Hamas)' military wing, the [Izz ad-Din al-Qassam Brigades](/wiki/Izz_ad-Din_al-Qassam_Brigades). The plot was foiled when Ali was arrested by the [Internal Security Department of Singapore](/wiki/Internal_Security_Department_(Singapore)) in February 2021. ## Background ### The suspect The suspect Amirull bin Ali was a 20-year old full-time national serviceman in the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces) at the time of his arrest in February 2021. According to the [Internal Security Department](/wiki/Internal_Security_Department_(Singapore)) (ISD), Amirull developed an interest in the [Israel-Palestine conflict](/wiki/Israel-Palestine_conflict) after watching a video of Palestinian civilians being bombed by Israeli jets in 2014. His subsequent online research into the conflict led him to develop the view that Israel was oppressing the [Palestinians](/wiki/Palestinians), which led him to hate Israel and [Jewish people](/wiki/Jewish_people). In 2015, Amirull began supporting Hamas' military wing, the [Izz ad-Din al-Qassam Brigades](/wiki/Izz_ad-Din_al-Qassam_Brigades). By 2018, he had discussed his intentions to travel to [Gaza](/wiki/Gaza_Strip) and join the al-Qassam Brigades with a foreign contact. Amirull believed that he would become a [martyr](/wiki/Martyr) if he were to die fighting the enemies of [Islam](/wiki/Islam) in combat. Between 2018 and 2020, he also researched travel routes to Gaza. Amirull intended to join the al-Qassam Brigades after completing his national service and raising funds. For this purpose, he also trained with a replica [AK-47](/wiki/AK-47). ### Planning and manifesto According to the ISD's investigation, Amirull began planning his attack on Jewish worshipers at [Maghain Aboth Synagogue](/wiki/Maghain_Aboth_Synagogue) after watching a [Channel News Asia](/wiki/Channel_News_Asia) documentary on the Jewish community. He was reportedly enraged that [Singaporean Jews](/wiki/Jews_in_Singapore) were thriving peacefully in [Singapore](/wiki/Singapore) while the Palestinians were suffering. Amirull's plans reportedly included practising stabbing techniques with a [Smith & Wesson](/wiki/Smith_%26_Wesson) knife, conducting at least two [reconnaissance](/wiki/Reconnaissance) trips to the mosque between August and October 2019 to identify [ambush](/wiki/Ambush) positions, and making plans to wear a white [keffiyeh](/wiki/Keffiyeh) to hide his identity. He planned to kill three Jewish males on the pretext that they had conducted [national service](/wiki/Israel_Defense_Forces#Service) in Israel and carried out alleged atrocities against Palestinians. Amirull also intended to make a short online [manifesto](/wiki/Manifesto) following his attack advocating violent attacks against so-called \"tyrannical regimes.\" Amirull reportedly shelved his plan in October 2019 due to the belief that he could only obtain [martyrdom](/wiki/Martyrdom) through death in combat. However, he revisited his plan in December 2020 after watching a [TRT World](/wiki/TRT_World) [YouTube](/wiki/YouTube) video showing the [shooting](/wiki/Shooting_of_Eyad_al-Hallaq) of an unarmed [autistic](/wiki/Autism) Palestinian man named Eyad al-Hallaq by Israeli security forces. Amirull planned to attack the synagogue on Christmas Day while wearing a black ski mask. He abandoned the second attempt due to his concerns about not attaining martyrdom if he was captured by law enforcement authorities. ## Arrest, investigation and detention In February 2021, Amirull was arrested and detained under the [Internal Security Act](/wiki/Internal_Security_Act_(Singapore)), which allows detention without trial for a two-year period. The ISD had been alerted to Amirull's case by the [Ministry of Defence](/wiki/Ministry_of_Defence_(Singapore)), which expressed concern that he had been radicalised by \"extremist ideologies.\" According to the ISD, Amirull had acted alone and there was no evidence that he had tried to influence or recruit others. His family and friends were unaware of his attack plans. The Defence Ministry also confirmed that Amirull did not intend to influence anyone in his unit and that no military equipment was missing. Amirull was released on a restriction order in March 2023 after reportedly being rehabilitated by the [Religious Rehabilitation Group](/wiki/Religious_Rehabilitation_Group_(Singapore)) (RRG). ## Media coverage and reactions Singaporean authorities first disclosed the case to the media and public on 10 March 2021. During a visit by Muslim leaders to the Maghain Aboth Synagogue, the Singaporean [Minister for Law](/wiki/Minister_for_Law_(Singapore)) and [Minister for Home Affairs](/wiki/Minister_for_Home_Affairs_(Singapore)) [K. Shanmugam](/wiki/K._Shanmugam) stated that Amirull was arrested not because of his sympathies to the Palestinian cause but because he wanted to kill innocent people, which would have undermined religious and racial harmony in [Singapore](/wiki/Singapore). The Maghain Aboth Synagogue attack plot was covered by several Singaporean and international media including *[The Straits Times](/wiki/The_Straits_Times)*, *[South China Morning Post](/wiki/South_China_Morning_Post)*, *[Channel NewsAsia](/wiki/Channel_NewsAsia)*, *[The Jerusalem Post](/wiki/The_Jerusalem_Post)*, [Ynet](/wiki/Ynet), the *[Jewish Chronicle](/wiki/Jewish_Chronicle)*, *[The Star](/wiki/The_Star_(Malaysia))*, and *[Arutz Sheva](/wiki/Arutz_Sheva)*. In addition, several representatives of the [Singapore Muslim community](/wiki/Islam_in_Singapore) including Mufti Dr Nazirudin Mohd Nasir, [Majlis Ugama Islam Singapura](/wiki/Majlis_Ugama_Islam_Singapura) (MUIS) Chief Executive Mr Esa Masood, and Head of Harmony Centre Liyana Rosli Asmara met with leading representatives of the Singapore Jewish community including Chief Rabbi Mordechai Abergel, Jewish Welfare Board Singapore President Mr Nash Benjamin and Vice-President Mr Reuben Khafi at the Maghain Aboth Synagogue to reaffirm communal ties between the two communities and condemn extremism, radicalism, and violence. Mufti Dr Naziruddin also condemned \"radical and extremist ideas\" within the Muslim community and emphasized the common [Abrahamic](/wiki/Abraham) heritage between Jews and Muslims. The [Jewish Agency for Israel](/wiki/Jewish_Agency_for_Israel)'s Chairman [Isaac Herzog](/wiki/Isaac_Herzog) linked the synagogue attack plot to an upsurge of [antisemitism](/wiki/Antisemitism) in the post-[COVID-19 pandemic](/wiki/COVID-19_pandemic) world and called security forces across the world to increase their vigilance. - [List of attacks on Jewish institutions](/wiki/List_of_attacks_on_Jewish_institutions) ## Notes and references 1°17′54″N 103°51′03″E﻿ / ﻿1.29825°N 103.85070°E﻿ / 1.29825; 103.85070\n",
  "language": "en",
  "processed_at": "2026-01-12T11:27:52.699558",
  "title": "Maghain Aboth Synagogue attack plot",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Maghain_Aboth_Synagogue_attack_plot"
}