{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:27:50.531364"
  },
  "content": "Synagogue in Rochor, Singapore The **Maghain Aboth Synagogue**[a] is a [Hasidic](/wiki/Hasidic_Judaism) [Jewish](/wiki/Judaism) congregation and [synagogue](/wiki/Synagogue), located at 24/26 [Waterloo Street](/wiki/Waterloo_Street) in [Rochor](/wiki/Rochor), within the [Central Area](/wiki/Central_Area,_Singapore) of [Singapore](/wiki/Singapore). Constructed in 1878, it is the oldest and largest Jewish synagogue in [Southeast Asia](/wiki/Southeast_Asia) and the second largest in [Asia](/wiki/Asia) itself, outside of [Israel](/wiki/Israel). Managed by the Jewish Welfare Board, it remains to be the main place of worship for the Jewish community in Singapore. It was designated as a [national monument](/wiki/National_monuments_of_Singapore) of Singapore in 1998. Today, the synagogue and its surroundings has served as the unofficial centre of Jewish activity in Singapore, with several Jewish buildings standing within its vicinity, including a [kosher](/wiki/Kosher) supermarket and a museum. ## History ### Early years As early as 1831, Singapore's earliest Jewish settlers were [Mizrahi](/wiki/Mizrahi_Jews)/[Sephardic](/wiki/Sephardic_Jews) merchants from mainly modern-day Iraq and Iran who came to trade. In 1870, one of the synagogue's new trustees, Joseph Joshua, negotiated to buy a plot of land owned by Raffles Institution at [Bras Basah](/wiki/Bras_Basah) for $4,000 in order to build a new synagogue. However, not enough funds were raised to build the new synagogue within the 3-years period agreement. ### Construction Construction of Maghain Aboth began after the land was acquired and was completed in 1878. In 1893, a U-shaped balcony was added to form the second-storey of the building with the purpose of accommodating the female members of the community. Later in 1924 to 1925, extensions were made to the building and a more solid and permanent gallery was built. The synagogue started to hold a congregation of approximately 40 and served the local Jewish community for 30 years before it was sold. The building was later demolished after [World War II](/wiki/World_War_II). However, parts of the original building remains in use in the present. ### Japanese occupation During the [Japanese Occupation of Singapore](/wiki/Japanese_occupation_of_Singapore), the synagogue was a significant gathering place for the local Jews to exchange news and collect funds to help those in need. In the past, oil lamps were used during services and they still remain in the present day, hanging from steel rods in loving memory of those who have passed on. The Maghain Aboth Synagogue was [gazetted](/wiki/Gazette) as a [national monument](/wiki/National_Monuments_of_Singapore) later on 27 February 1998. ### Contemporary era In 2007, a seven-storey building called the Jacob Ballas Centre was added to the compound next to the Maghain Aboth Synagogue. It was named after the late [Jacob Ballas](/wiki/History_of_the_Jews_in_Singapore#Jacob_Ballas) who was seen as a pillar of the Jewish community in Singapore. The centre provides facilities to meet the needs of the Jewish community such as offices and homes for the Rabbis and the Yeshivah boys, a women's mikvah, a slaughter room for kosher chickens, a [kosher restaurant](/wiki/Kosher_restaurant), a kosher shop and a social hall for events and functions including [Shabbat](/wiki/Shabbat) and festival meals. Descendants of most of the earliest Jewish settlers in the country are today Singaporean citizens. In March 2021, the [Internal Security Department](/wiki/Internal_Security_Department_(Singapore)) (ISD) reported that it had detained a 20-year old [national serviceman](/wiki/National_service_in_Singapore), Amirull Ali, in February under the [Internal Security Act](/wiki/Internal_Security_Act_(Singapore)) (ISA) for [plotting to attack](/wiki/Maghain_Aboth_Synagogue_attack_plot) three Jewish worshippers at the Maghain Aboth Synagogue. Ali was motivated by sympathy towards the [Palestinians](/wiki/Palestinian_people) and believed that these three men had served in the [Israel Defense Forces](/wiki/Israel_Defense_Forces) (IDF) and committed [atrocities against the Palestinians](/wiki/Human_rights_violations_against_Palestinians_by_Israel). He also reportedly planned to travel to [Gaza](/wiki/Gaza_Strip) to join [Hamas](/wiki/Hamas)' military wing, the [Izz ad-Din al-Qassam Brigades](/wiki/Izz_ad-Din_al-Qassam_Brigades). #### The Jews of Singapore Museum On 2 December 2021, The Jews of Singapore Museum opened its doors beside the synagogue at the Jacob Ballas Centre, which traces the history of the Jews in Singapore and the contributions notable Jews have made to Singaporean society. ## Architecture As Jewish men and women worship separately in an Orthodox synagogue, the synagogue's original single-storey building could only accommodate men. The U-shaped second-storey balcony was originally made up wooden slats of makeshift nature which the women were able to see through very clearly. Therefore, the original simple design was deemed inadequate and thus, later constructed to be a solid gallery which was added to the main building which remains in use today. The synagogue is a symmetrical building which has adopted a [neo-classical style](/wiki/Neo-Classical_style) and [colonial architecture](/wiki/Colonial_architecture). The design of the building was influenced by the Late Renaissance architectural style in Britain. The building has a repetitive sequence of [Palladian](/wiki/Palladian_architecture) arcades and pedestals and within the building, the hall has traditional Roman columns and [rusticated](/wiki/Rustication_(architecture)) walls which is bare of any decoration or image. Along the corners and sides of the building are [pilasters](/wiki/Pilaster) topped with decorative [capitals](/wiki/Capital_(architecture)). The synagogue's doorways are also adorned with arches with [classical keystone architecture](/wiki/Keystone_(architecture)). A covered [porch](/wiki/Porch) fronts the building with steps leading up to the vestibule originally designed for [horse carriages](/wiki/Horse_carriage). Most of the [windows](/wiki/Window) are of a similar rectangular design and are [timber](/wiki/Timber)-[louvred](/wiki/Louvre_(window)). The windows are an important feature of a synagogue because based on the [Talmud](/wiki/Talmud), Jewish synagogues are required to have windows. Despite the deliberate simple design of the synagogue, the building still remains to be elegant due to the combination of its timber-louvred windows, marble floors and red carpets with teak and rattan pews. The prayer hall is facing west towards Jerusalem and the [bimah](/wiki/Bema), an elevated platform in the centre, faces the [alcove](/wiki/Alcove_(architecture)) known as the '*hekhal*', which is used to store the Torah scrolls, that is at the West wall of the hall. The [parochet](/wiki/Parochet) which is an embroidered fringed curtain that is rich in details is used to cover the [Torah ark](/wiki/Torah_ark). In front of it hangs the [sanctuary lamp](/wiki/Sanctuary_lamp) which signifies the eternal flame that burned in the former [Temple of Jerusalem](/wiki/Temple_in_Jerusalem). - Singapore portal - Judaism portal - [History of the Jews in Singapore](/wiki/History_of_the_Jews_in_Singapore) - List of synagogues in Singapore ## Notes - Boi, Lee Geok (2004). *The Religious Monuments of Singapore*. Landmark Books. [ISBN](/wiki/ISBN_(identifier)) 981-3065-62-1. - Maghain Aboth Synagogue – National Heritage Board - Official website - \"Virtual Jewish History Tour of Singapore\". *Jewish Virtual Library*. - \"Home page\". *The Jewish Community of Singapore*.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:27:50.530923",
  "title": "Maghain Aboth Synagogue",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Maghain_Aboth_Synagogue"
}