{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:27:54.730741"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Magical Sentosa\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(November 2012)* *(Learn how and when to remove this message)*Musical by Philippe Villar and Pascal Lengagne **Magical Sentosa** (also known as *Sentosa Magique* [in [French](/wiki/French_language)] or *神奇圣淘沙* [in [Chinese](/wiki/Chinese_language)]) was a [multimedia](/wiki/Multimedia) nighttime show hosted at the [Sentosa Musical Fountain](/wiki/Sentosa_Musical_Fountain) on the resort island of [Sentosa](/wiki/Sentosa), [Singapore](/wiki/Singapore). The multimedia show is the last musical to be staged on the fountain itself. The musical ran for less than five years before being eventually discontinued in 2007 and replaced by *[Songs of the Sea](/wiki/Songs_of_the_Sea)*. The show was conceived using ideas from an earlier *ECA2* production in France, titled \"*Le Lac Aux Images*\", using some of the characters and plot elements of the previous show. The plot centers around fountain master, Mr Whamsey, and the maniacal antics of *Kiki the Hyperactive Monkey of Sentosa*, both of whom serve as the show's main hosts. The show was known internally at ECA2 as \"*Sentosa Water and Fire Fantasy Show*\". ## Development ### Origins In 1997, ECA2 commissioned the creation of *Le Lac Aux Images* to celebrate French theme park, [Futuroscope](/wiki/Futuroscope)'s tenth anniversary. The show; which operated in Futuroscope's own musical fountain in [France](/wiki/France), closed down in 2002, the same year of Magical Sentosa's release. Its plot contained similarities with some of Magical Sentosa's own plot elements and characters. Most assets from the show were later recycled for Magical Sentosa, most prominently imagery used for the character, Princess Pearl. The musical centers on a character by the name of *Ouïatouké*, who is voiced by renowned French voice actor, Luq Hamet. Ouïatouké's name is a French pun on the abbreviation, \"*[Y2K](/wiki/Year_2000_problem)*\" or the year 2000 problem; a reference to him as a [glitch](/wiki/Glitch). ### Production and Opening Not much is known about the show's development and very little information is provided regarding Magical Sentosa. A majority of information sources have directed viewers to the show's credits and reviews. Bang Productions managed the show's technical design while Fischer Media Group was involved in an undisclosed role. The show, was eventually opened on 19 September 2002 to an audience of an estimated 150,000. ### Credits The following people who are listed, are according to ECA2 press releases: - Design and Direction: [Yves Pépin](/wiki/Yves_P%C3%A9pin) - Music and Soundtrack: Philippe Villar / Pascal Lengagne - Cartoons and Animation: Dominique Fages - Laser Design: Claude Lifante - Content Production: Thierry Nutchey - Project Manager: Jean-Christophe Canizarès - Production: ECA2 #### Uncredited in Press Release - Technical design and setup: Alain Gaillard ## Plot The show begins with a [fountain master](/wiki/Magician_(fantasy)) named Mr Whamsey (as mentioned by Kiki later on in the show), greeting the audience. He shows off his skills to the audience, by first showing the fountain repeating his tune, followed by a grand orchestra piece, and finally a soft soothing water-themed song, ([Water Waltz](/wiki/Magical_Sentosa_(soundtrack)#Songs)), but before he can finish a segment known as \"[Grand Finale](/wiki/Magical_Sentosa_Soundtrack#Scores)\", the fountain displays on both the terrace pools grind to a sudden halt. Mr Whamsey is startled, and desperately attempts to restart the fountains. There is a sudden flashing of strobe lights, followed by Kiki making his signature laugh. He then appears laughing out of control at the audience before going back into hiding. When Mr Whamsey asks the audience what was making the noise, Kiki reappears and introduces himself to the audience. He then challenges Mr Whamsey to a duel for control of the [Sentosa Musical Fountain](/wiki/Sentosa_Musical_Fountain), resulting in a semi-chaotic fountain sequence playing, with whimsical circus-like music and ending with several powerful bursts of water. Soon after, he introduces Mr Whamsey and the audience to his friends ([Hello Hello](/wiki/Magical_Sentosa_Soundtrack#Hello_Hello)), and the amazed Mr Whamsey decides to enter \"*Magical [Sentosa](/wiki/Sentosa)*\", the parallel universe which Kiki lives in. Kiki then directs Mr Whamsey into a secret tunnel, which can be entered through the fountain's \"SENTOSA\" plaster sculpture's letter \"O\". Upon arrival, he is greeted by an unseen school of [sirens](/wiki/Siren_(mythology)) and [mermaids](/wiki/Mermaid) alongside on-screen [faries](/wiki/Fairy). Mr Whamsey, who attempts to enter \"*Magical Sentosa*\" through its gates is then put through two challenges, a levitating scaffold and a colliding entrance gate which attempts to crush him. After succeeding in both challenges, he briefly plays with bubbles before meeting the beautiful siren princess, Princess Pearl, who sings her enchanting siren song ([Princess Pearl Song](/wiki/Magical_Sentosa_(soundtrack)#Scores)) to the audience and dances gracefully for them as she is surrounded by more bubbles. After the image of Princess Pearl fades, Kiki, while floating on a bubble himself, reveals to the audience his feelings towards Princess Pearl, then treats the audience to a song ([It's My World](/wiki/Magical_Sentosa_(soundtrack)#Songs)). Magical Sentosa's 'creatures of fire' are then summoned by Kiki to put on a terrific fire show while Mr Whamsey dances in the background. He is then forcibly ejected upwards in an animation similar to 'Le Lac Aux Images' and finally exits through the sculpture's \"O\", and compliments Kiki for the wonderful experience. Kiki then sings the song, [Here Everybody Lives in Harmony](/wiki/Magical_Sentosa_Soundtrack#Here_Everybody_Lives_in_Harmony). When he sings the last note completely out of tune, a fireball suddenly shoots up, awakening the [Merlion](/wiki/Merlion) who puts on a laser display for the audience. Kiki performs his last fountain piece, a reprise of [Here Everybody Lives in Harmony](/wiki/Magical_Sentosa_Soundtrack#Here_Everybody_Lives_in_Harmony) then bids the audience goodbye and Mr Whamsey completes of what is left of the \"[Grand Finale](/wiki/Magical_Sentosa_Soundtrack#Scores)\" before bowing to the audience and taking his leave. ## Music The original, \"*Songs and Tunes from The Original Soundtrack of Magical Sentosa*\" [soundtrack](/wiki/Soundtrack) album has largely survived in home video format. The entire original soundtrack in high-fidelity audio was lost after the fountain's closure (apart from a recording of Water Waltz which surfaced in 2011), until an anonymous Singaporean YouTube user found a surviving copy in January 2013. All tracks are written by Philippe Villar and Pascal Lengagne. No.TitleLength1.\"Water Waltz\"1:372.\"Circus\"00:493.\"The Mermaids Song\"02:124.\"Princess Pearl Song\"1:575.\"It's My World\"01:516.\"The Fire Ballet\"00:577.\"Here Everybody Lives in Harmony\"2:298.\"Grand Finale\"02:10 ### 2013 rediscovery On 30 January 2013, an anonymous YouTuber by the username of, \"*caix92*\", rediscovered the album in its original entirety. In a comment he / she mentioned that the album was originally bought by him / her shortly before the show stopped operations in March 2007. The rediscovery of the album also revealed entirely new and unknown cast members involved in the making of the soundtrack. Examples included, Adele Masquelier and Jerome Scemla. The album's artwork was also prominently displayed in all of the video thumbnails. ## Characters ### Kiki the Hyperactive Monkey of Sentosa Kiki, a lime green coloured monkey; is the main protagonist of the show. During Mr Whamsey's performance, he interrupts the \"usual program\" intended and appears laughing hysterically at the audience. He then challenges Mr. Whamsey to a duel over the control of the [Sentosa Musical Fountain](/wiki/Sentosa_Musical_Fountain). Afterwards, he introduces the surprised Mr. Whamsey to several of his friends, namely the mock band \"The Fantastic Fish\", and other unnamed characters. He then invites Mr. Whamsey to the alternate dimension where he lives. Kiki also acts as a guide to Mr. Whamsey throughout his journey in the alternate dimension. Despite this, the both never appear on the water screen at the same time. When the latter finally returns, he bids Mr. Whamsey and the audience farewell, reminding them that he'll be waiting for them. He then makes his trademark laughter and disappears from the scene. ### Mr. Whamsey Mr Whamsey is a \"[fountain master](/wiki/Magician_(fantasy))\" who first appears when he makes his entrance on to the fountain's symphony stage. He shows off the audience his skills with several performances on the fountain but before he could finish the final segment, his performance is suddenly interrupted by the arrival of Kiki, who is first seen laughing out of control before jumping back into hiding. Kiki then reveals himself to Mr. Whamsey, and he is challenged by the latter to a duel over the control of the [Sentosa Musical Fountain](/wiki/Sentosa_Musical_Fountain). He is then introduced to several of Kiki's friends, and persuades Kiki in excitement to invite him to the alternate dimension where the hyperactive monkey lives. When he does, he is greeted by the beautiful siren princess, Princess Pearl. He later exits the alternate dimension and compliments Kiki for the wonderful experience. When Kiki bids the audience farewell, he finishes the final segment of his performance, before bowing and taking his leave. ### Princess Pearl She is the beautiful siren princess who first appears after Mr. Whamsey manages to arrive in Kiki's world. Her head is adorned with countless bubbles, or pearls, hence giving her name. She appears as she rises from the fountain, and smiles at the audience. A dolphin plunges into the fountain, before she breaks into her enchanting siren song. Her image then switches, where she dances to the audience. As she finishes her dance, her image fades and sinks back into the fountain. Princess Pearl's sequence has been noted as the most remarkable as she was directly recycled from ECA2's earlier production, *Le Lac Aux Images*. The only differences being her image mirrored for Magical Sentosa, and the use of only one of the two dolphins that were part of her original sequence in Le Lac Aux Images. ### The Fantastic Fish The Fantastic Fish are a band consisting of laser-colored fishes that are just a few of Kiki's friends. They first appear in the song segment for, [Hello Hello](/wiki/Magical_Sentosa_Soundtrack#Hello_Hello). Later on, more of Kiki's friends appear, namely two sea creatures called, \"*The Crazy Fish*\", a monstrous whale-like creature, and a robot named, Omeo. The band then reappears during the climax of the song and as they disappear from the scene, a mass of laser-colored bubbles shoots up in front of them. They would later reappear in a cameo in Kiki's song, \"[It's My World](/wiki/Magical_Sentosa_(soundtrack)#Songs)\". As Magical Sentosa uses quite a number of references to *Le Lac Aux Images*, most of Kiki's friends and the laser-colored bubbles were actually from the latter. ### The Merlion Although not considered a prominent character, the [Merlion](/wiki/Merlion) statue located behind the fountain comes to \"life\" when Kiki sings the last note of, [Here Everybody Lives in Harmony](/wiki/Magical_Sentosa_Soundtrack#Here_Everybody_Lives_in_Harmony), completely out of tune. The eyes of the statue emitted a green Stella Ray laser that shone down onto the fountain and when the song ends, it comes to take Kiki, who subsequently bids farewell to Mr. Whamsey and the audience. ## Reception The musical opened with a few positive reviews from the media. [Today](/wiki/Today_(Singapore_newspaper)) mentioned that the show's fire and water elements made \"fantastic partners\" while [The Straits Times](/wiki/The_Straits_Times) noted it as an \"even more spectacular fountain show\". [Sentosa Development Corporation](/wiki/Sentosa_Development_Corporation)'s then CEO, Darrell Metzger, complemented that the show \"needs to be experienced to be believed\". British author, [Neil Humphreys](/wiki/Neil_Humphreys), critiqued the interaction shown between Kiki and Princess Pearl as \"infatuated\" and \"randy\". He also remarked that \"the show's storyline must have been written by someone high on [LSD](/wiki/Lysergic_acid_diethylamide)\", describing the show's experience as \"an acid trip\". ## Closure After 25 years of operation, the [Sentosa Musical Fountain](/wiki/Sentosa_Musical_Fountain) was closed down to make way for [Resorts World Sentosa](/wiki/Resorts_World_Sentosa), Magical Sentosa staged its last show on 25 March 2007, after less than 5 years in operation, before it was shut down to let demolition works commence. A few [amateur videos](/wiki/Home_movies) of the final show eventually surfaced to video sharing site, [YouTube](/wiki/YouTube). ## Legacy As a result of the [fountain's closure](/wiki/Sentosa_Musical_Fountain#Demolition), many came to film the final show. A majority of these footages filmed have ended up in family archives and mostly on video sharing website, [YouTube](/wiki/YouTube). One such notable example is a video done up by YouTube user *jingxi*. Another notable video posted by *alvinngheng*, can also be found on YouTube. The [tribute video](/wiki/Tribute) consist of a mix of other YouTubers uploads of their own videos of the fountain. ## Web documentation ### On the Web *Fischer Media footage* - During the first performance of that night, a Fischer Media cameraman filmed the show with a [standard definition](/wiki/480p) camera. It was later edited by ECA2 to produce the show's promotional reel, now only existing as a fragment on Fisher Media's website. In 2010, the footage was restored to the [high definition](/wiki/720p) format as ECA2's trailer for Magical Sentosa. But this trailer was reedited and cut in 2012. The edited trailer from 2010 has since resurfaced on ECA2's [YouTube](/wiki/YouTube) page, alongside the trailers of all the permanent shows produced by ECA2, including the full trailer of *Le Lac Aux Images*. *Magical Sentosa HD Trailer* - ECA2's promotional trailer of Magical Sentosa, which used footage from Fischer Media's promotional footage. ### On YouTube A video covers up the first 51 seconds of the show with the full and muted soundtrack of *[Here Everybody Lives in Harmony](/wiki/Songs_and_Tunes_from_The_Original_Soundtrack_of_Magical_Sentosa#Here_Everybody_Lives_in_Harmony)* which not many have filmed. *Soundtrack from Magical Sentosa - Water Waltz* - A high-fidelity recording of Water Waltz, the earliest of its kind to be uploaded on to the platform before the 2013 soundtrack rediscovery. *Futuroscope - Le Lac aux Images 2000 - Spectacle Entier - Partie 1 un 2* This video is possibly the only video to show one of ECA2's earlier productions, *Le Lac aux Images* which uses some of Magical Sentosa's characters and plot elements, most notably Princess Pearl. - [Sentosa Island](/wiki/Sentosa) - [Sentosa Musical Fountain](/wiki/Sentosa_Musical_Fountain) - [Songs and Tunes from The Original Soundtrack of Magical Sentosa](/wiki/Songs_and_Tunes_from_The_Original_Soundtrack_of_Magical_Sentosa) - [Songs of the Sea](/wiki/Songs_of_the_Sea) - [Fountain of Wealth](/wiki/Fountain_of_Wealth) ## Notes - Sentosa's Official Website - Magical Sentosa Part 1 on [YouTube](/wiki/YouTube) - Magical Sentosa Part 2 on [YouTube](/wiki/YouTube) - Magical Sentosa Part 3 on [YouTube](/wiki/YouTube)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:27:54.730410",
  "title": "Magical Sentosa",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Magical_Sentosa"
}