{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:27:56.425173"
  },
  "content": "Brand owned by Fraser and Neave **Magnolia** (branded as **F&N Magnolia**) is a brand of dairy products owned by [Singaporean](/wiki/Singapore) [multinational](/wiki/Multinational_corporation) conglomorate [Fraser and Neave](/wiki/Fraser_and_Neave) (F&N). Aside from Singapore, the product is also sold in several other countries throughout the [Asia-Pacific](/wiki/Asia-Pacific) as well as at [Asian supermarkets](/wiki/Asian_supermarket) in non-Asian countries. ## History ### Early years The Singaporean company [Cold Storage](/wiki/Cold_Storage_(supermarket)), which was then known as the Singapore Cold Storage Company, was the main manufacturer of ice in Singapore. Taking advantage of the booming ice manufacturing and refrigeration business, Cold Storage ventured into the [ice cream](/wiki/Ice_cream) business. In 1923, a small factory was set up at the [Borneo Wharf](/wiki/Borneo_Wharf_railway_station) of the [Harbourfront](/wiki/HarbourFront_(Singapore)) district to manufacture ice cream under the Paradise brand. ### Tropical dairy farm at Bukit Timah In 1937, Australian Fred Heron, the managing director of Cold Storage, founded the world's first tropical dairy farm at the [Bukit Timah](/wiki/Bukit_Timah) district of Singapore, which aimed to produce fresh [pasteurised milk](/wiki/Pasteurised_milk). This farm, then known as the Singapore Dairy Farm, was situated inside what is now the [Bukit Timah Nature Reserve](/wiki/Bukit_Timah_Nature_Reserve). It kept as many as 800 cows. Pasteurised milk produced at the farm was packaged in pyramid-shaped cartons and sold under the brand Magnolia. That same year, a deal was reached between Cold Storage and San Miguel Brewery (now [San Miguel Corporation](/wiki/San_Miguel_Corporation)), which owned the successful [Magnolia ice cream](/wiki/Magnolia_(SMC_brand)) in the [Philippines](/wiki/Philippines) established in 1925. Cold Storage Creameries Ltd. was founded with an initial capital of $100,000, to which Cold Storage owned the majority 55% and San Miguel owned the balance 45%. San Miguel provided technology for ice cream manufacturing. The success of Cold Storage's ice cream led to a legal battle with San Miguel over the ownership of the Magnolia trademark in Singapore. - Official website – Magnolia Milk Singapore - F&N Creameries Portals: - Singapore - Drink This [Singaporean corporation or company](/wiki/List_of_companies_of_Singapore) article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:27:56.424728",
  "title": "Magnolia (Fraser and Neave brand)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Magnolia_(Fraser_and_Neave_brand)"
}