{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:28:01.332572"
  },
  "content": "The **Mahatma Gandhi Memorial Hall** is a building on Race Course Lane in [Little India, Singapore](/wiki/Little_India,_Singapore). Officially opened in 1953 in honour of [Mahatma Gandhi](/wiki/Mahatma_Gandhi), it housed the [Singapore Indian Development Association](/wiki/Singapore_Indian_Development_Association) in the 1990s. Beginning in 2008, it was occupied by The Hindi Society. ## History During a mourning session for Mahatma Gandhi held on 31 January 1948, a day after his [assassination](/wiki/Assassination_of_Mahatma_Gandhi), legislative councilor [Rajabali Jumabhoy](/wiki/Rajabali_Jumabhoy) announced that a fund would be established by the Singapore Indian Chamber of Commerce in order to raise $100,000 for the construction of a statue of Gandhi in Singapore. In February, [Mary Lobo](/wiki/Mary_Lobo) of the Singapore Regional Indian Congress' women's section proposed the construction of a Gandhi Memorial Institute, which would include an assembly hall, a school, a women's centre and a library. This proposal was supported by both the Singapore Regional Indian Congress's women's section and the Singapore Indian Chamber of Commerce. The Gandhiji Memorial Fund Committee was then established in order to raise funds for the construction of the hall. Jumabhoy served as the committee's president, while [Gangaram Maganlal](/wiki/G._Maganlal) and [Jesudoss Muthaiya Dorai Raj](/wiki/Jesudoss_Muthaiya_Dorai_Raj) served as the committee's treasurer and secretary respectively. In September 1949, Padma Ramakrishnan, the wife of Chief Inspector K. Ramakrishnan, won a $100 prize for suggesting that the memorial should contain an assembly hall with books by and about Gandhi. It was then decided that if the fund could raise $250,000, a school would be built instead. The fund was able to raise over $117,000 for the memorial. Several leaders of the local Indian community, such as [Vayloo Pakirisamy Pillai](/wiki/Vayloo_Pakirisamy_Pillai) and [P. Govindasamy Pillai](/wiki/P._Govindasamy_Pillai), supported the construction of the memorial. In June 1950, the Gandhi Memorial Committee purchased 680.5 m2 (7,325 sq ft) of land on Race Course Lane for $32,000 with the aim of constructing two buildings. The first was to have a free library on the first floor and a stage and two office rooms on the second, while the second building would be rented out, with the income generated being donated to local charities. The [Prime Minister of India](/wiki/Prime_Minister_of_India) [Jawaharlal Nehru](/wiki/Jawaharlal_Nehru) laid the memorial's foundation stone while visiting Singapore in the same month. He also made several suggestions for alterations of the memorial's original plans, some of which were incorporated into the memorial's final plans. In November, Jumabhoy announced that one two-storey building would be built, with the first floor being occupied by a library hall and the secretary's office, along with the foundation stone, and the second floor being occupied by an assembly hall and a meeting room. A life-sized bronze bust of Gandhi mounted on a marble pillar was placed in the foyers. Construction was completed in July 1952 and the memorial was furnished by the end of September. On 25 April 1953, the memorial was officially opened by [Malcolm MacDonald](/wiki/Malcolm_MacDonald), then the Commissioner-General for Southeast Asia. The building, which was made of brick and built in the modern style with [Art Deco](/wiki/Art_Deco) influences, features a wall relief of Gandhi. The building's architect was [Ng Keng Siang](/wiki/Ng_Keng_Siang). Beginning in 1954, an annual event would be held on every 2 October to commemorate the anniversary of Gandhi's birthday. The memorial also served as a centre for religious ceremonies and meetings and Indian weddings. The [Singapore Indian Development Association](/wiki/Singapore_Indian_Development_Association), a charity organisation established in September 1990, was initially headquartered on the building's ground floor. In May 1993, the association's Family Service Centre also moved its headquarters to the memorial. However, both the association and its Family Service Centre were relocated to Beatty Road in April 1998, after which the memorial was left vacant. In 2008, the Hindi Society moved into the building and raised $1 million for its restoration, which began in the following year. The building was gazetted for conservation on 30 April 2010. The building was officially reopened by then-[President of Singapore](/wiki/President_of_Singapore) [S. R. Nathan](/wiki/S._R._Nathan) on 22 January 2011. The building was placed on the Little India Heritage Trail by the [National Heritage Board](/wiki/National_Heritage_Board_(Singapore)) in 2017. In 2018, The Hindu Society moved out of the building, which was closed on 12 September and again left vacant. The memorial was reopened by the Singapore Indian Fine Arts Society in January 2022 after a refurbishment. 1°18′34″N 103°51′11″E﻿ / ﻿1.30937°N 103.85305°E﻿ / 1.30937; 103.85305\n",
  "language": "en",
  "processed_at": "2026-01-12T11:28:01.332131",
  "title": "Mahatma Gandhi Memorial Hall",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Mahatma_Gandhi_Memorial_Hall"
}