{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:28:05.149784"
  },
  "content": "Statute of the Parliament of SingaporeThis article needs to be **updated**. Please help update this article to reflect recent events or newly available information. *(December 2020)* The **Maintenance of Religious Harmony Act 1990** (\"**MRHA**\") is a [Singapore](/wiki/Singapore) [statute](/wiki/Sources_of_Singapore_law#Statutes) which, according to its [long title](/wiki/Long_title), provides for the maintenance of religious harmony, for the establishment of a Presidential Council for Religious Harmony (\"PCRH\"), and for matters connected therewith. The Act, which was passed on 9 November 1990 and came into force on 31 March 1992, empowers the [Minister for Home Affairs](/wiki/Ministry_of_Home_Affairs_(Singapore)) to make a [restraining order](/wiki/Restraining_order) against a person who is in a position of authority in any religious group or institution if the Minister is satisfied that the person has committed or is attempting to commit any of the following acts: causing feelings of enmity, hatred, ill-will or hostility between different religious groups, promoting a political cause, carrying out [subversive](/wiki/Subversion) activities, or exciting disaffection against the [President](/wiki/President_of_Singapore) or the [Government](/wiki/Government_of_Singapore) under the guise of propagating or practicing a religious belief. A restraining order may also be made against a person who [incites](/wiki/Incitement), instigates or encourages any religious leader or any religious group or institution to commit the above acts; or a person who is not a religious leader who causes or attempts to cause feelings of enmity, hatred, ill-will or hostility between different religious groups. A restraining order made against a religious leader may direct that he or she must obtain the permission of the Minister before addressing members of any religious group or institution, assisting or contributing to religious publications, or holding office in the editorial board or committee of such publications. Breaching a restraining order is a criminal offence. The Minister must consult the PCRH before issuing a restraining order, and must inform the Council once an order is made. The council is responsible for recommending to the President whether an order should be confirmed, cancelled or varied in some manner. If the council's recommendations are contrary to the Minister's views on the matter, the President may act in his personal discretion in deciding whether to cancel or confirm the order. A restraining order cannot exceed two years in duration, but may be extended for periods not exceeding two years at a time. The Minister must review an order every 12 months or less. The Act declares decisions of the President, the Minister and the council to be final and not subject to being called in question in any court. Some concerns that have been raised about the MRHA include the lack of checks on the Minister's power to issue a restraining order; the difficulty of distinguishing between religious and political matters where moral and social issues are involved, which might be a particular problem for religions such as [Islam](/wiki/Islam_in_Singapore) and [Christianity](/wiki/Christianity_in_Singapore) that have comprehensive [worldviews](/wiki/World_view); and the lack of transparency of the PCRH's proceedings which are held in private. The consistency of the MRHA with [Article 15](/wiki/Article_15_of_the_Constitution_of_Singapore) of the [Constitution of Singapore](/wiki/Constitution_of_Singapore), which guarantees the right to [freedom of religion](/wiki/Freedom_of_religion_in_Singapore), has not yet been tested in court, though the Act may be a restriction on the right authorized by Article 15(4) as it can be regarded as a law relating to public order. No restraining orders have yet been issued under the Act, but in 2001 the Minister for Home Affairs disclosed that the Government had been prepared to do so against a number of religious leaders who had mixed religion with politics or denigrated other faiths during incidents occurring in the 1990s. ## Function and operation The Maintenance of Religious Harmony Act (\"MRHA\") is a [Singapore](/wiki/Singapore) [statute](/wiki/Sources_of_Singapore_law#Statutes) allowing the [Government](/wiki/Government_of_Singapore) to act promptly and effectively to \"nip the budding effects of inter-religious discord\", by taking discreet steps to prevent what it perceives to be \"factional political activity along racial-religious lines\" from escalating into situations which threaten to harm the religious harmony currently enjoyed in Singapore. ### Prohibited acts Section 8(1) of the MRHA permits the [Minister for Home Affairs](/wiki/Ministry_of_Home_Affairs_(Singapore)) to make a restraining order against any priest, monk, pastor, [imam](/wiki/Imam), elder, office-bearer or any other person who is in a position of authority in any religious group or institution where the Minister is satisfied that the person has committed or is attempting to commit any of the following acts: (a) causing feelings of enmity, hatred, ill-will or hostility between different religious groups;(b) carrying out activities to promote a political cause, or a cause of any political party while, or under the guise of, propagating or practising any religious belief;(c) carrying out [subversive](/wiki/Subversion) activities under the guise of propagating or practising any religious belief; or(d) exciting disaffection against the [President](/wiki/President_of_Singapore) or the Government while, or under the guise of, propagating or practising any religious belief. In addition to the persons mentioned above, under section 9(1) of the MRHA the Minister may also make an order against any other persons where the Minister is satisfied that (a) the person is inciting, instigating or encouraging any religious group or religious institution or any person mentioned in section 8(1) to commit any of the acts specified in that subsection; or that (b) the person, who is not one of the persons mentioned in section 8(1), has caused or is attempting to cause feelings of enmity, hatred, ill-will or hostility between different religious groups. ### Nature and effect of restraining orders A restraining order made against officials or members of religious group or institution under section 8(1) may be made for the following reasons: (a) to restrain them from addressing orally or in writing any congregation, parish or group of worshippers or members of any religious group or institution on any subject, topic or theme as may be specified in the order without the prior permission of the Minister;(b) to restrain them from printing, publishing, editing, distributing or in any way assisting or contributing to any publication produced by any religious group without the prior permission of the Minister; or(c) to restrain them from holding office in an editorial board or a committee of a publication of any religious group without the prior permission of the Minister. However, a restraining order made against other persons under section 9(1) may only restrain the person from addressing or advising any religious group or religious institution or any other member thereof; or making any statement or causing any statement to be made, whether orally or in writing, concerning or affecting the relations between that religious group or religious institution and the Government or any other religious group or religious institution. Criminal sanctions may be imposed in the event of a breach of a restraining order. Such breaches may result in prosecution and, upon conviction, a maximum fine of [S$](/wiki/Singapore_dollar)10,000 or imprisonment for up to two years or both. For second or subsequent offences, the maximum penalty is a fine of up to $20,000 or imprisonment for up to three years or both. ### Procedure Before making any restraining order, the Minister must give notice to the person against whom the order is proposed to be made, as well as the head or governing body or committee of management of the religious group or institution, enclosing details of the grounds and allegations of fact in support of the restraining order, and allow the person to make written representations to the Minister. All written representations by the person must be made within 14 days of the date of notice from the Minister. The Minister shall then take the representations into consideration before deciding whether to make a restraining order. A copy of every notice, grounds and allegations of fact given under sections 8(4) and 9(4) must be given immediately to the Presidential Council for Religious Harmony (\"PCRH\"), which is then required to give its views on the proposed order to the Minister within 14 days of the date of the notice. The PCRH's views also have to be taken into consideration by the Minister in making the order. Thereafter, any restraining order by made by the Minister under section 8 or 9 shall be referred to the PCRH within 30 days of the date of the order. The PCHR, having considering all the relevant grounds, facts or documents tendered by the Minister, and representations, if any, received by the Minister prior to making the order, recommends to the President whether the order should be confirmed, cancelled or varied in some manner, within 30 days of the receipt of the order and the necessary documents. Where necessary, the PCRH may invite the person against whom the order is made to be present for an oral examination. The President is obliged to act on the advice of the [Cabinet](/wiki/Cabinet_of_Singapore). It is only when the Cabinet's advice is contrary to the PCRH's views that the President may act in his personal discretion to cancel or confirm the order, having first considered the PCRH's recommendations. In confirming an order, he may make such variations as he thinks fit. In exercising his discretion the President may, but is not bound to, consult the [Council of Presidential Advisers](/wiki/Powers_of_the_President_of_Singapore#Powers). All orders made under sections 8 and 9 cease to have effect unless they are confirmed by the President within 30 days from the date the PCRH's recommendations are received by the President. Any restraining order issued cannot exceed two years. However, an order may be extended before its expiration for a further period or periods not exceeding two years at a time. Any order made or extended is reviewable by the Minister every 12 months or less, with the date of the first review being not more than 12 months after the date the order was made or extended. The Minister may at any time revoke any restraining order. Section 18 of the MRHA declares the decisions of the President, Minister and the council to be final and not capable of being called in question in any court. Since the President's circumscribed veto is conditional on a disagreement between the Cabinet and the PCRH, there is a low probability of the original decision by the Minister being altered. ### Presidential Council for Religious Harmony #### Composition The Presidential Council for Religious Harmony comprises a chairman and between six and fifteen other members appointed by the President on the advice of the [Presidential Council for Minority Rights](/wiki/Presidential_Council_for_Minority_Rights) (\"PCMR\"). Appointments last for three years, after which the members may be reappointed for between one and three years. Any appointment by the President is entirely a matter of his personal discretion and cannot be challenged in court. At least two-thirds of the Council must be representatives of major [religions in Singapore](/wiki/Religion_in_Singapore). The term *major religions* is not defined in the Act. The remaining members must, in the opinion of the PCMR, have distinguished themselves in public service or community relations in Singapore. All members of the PCRH must meet certain qualification requirements that are set out in the Act. They must be [Singapore citizens](/wiki/Singaporean_nationality_law) resident in Singapore who are at least 35 years old and not liable to the following disqualifications: - Being mentally disordered and incapable of managing themselves or their affairs. - Being insolvent or undischarged bankrupts. - Having been convicted of an offence by a [court in Singapore](/wiki/Judicial_system_of_Singapore) or [Malaysia](/wiki/Judiciary_of_Malaysia#Current_system) and sentenced to imprisonment for not less than one year or to a fine of not less than $2,000, and not having received a free [pardon](/wiki/Pardon). (Where a person has been convicted by a Malaysian court, he or she is not regarded as disqualified unless the offence is one which, if it had been committed in Singapore, would have been punishable by a Singapore court.) - Having voluntarily acquired the citizenship of, or exercised the rights of citizenship in, a foreign country, or having made a declaration of allegiance to a foreign country. If these disqualifications apply after appointment, the disqualified member must vacate his or her seat. In addition, any member may voluntarily resign from the council by writing under his or her hand addressed to the Chairman. As of 15 September 2017, there are ten members on the PCRH. Of these, seven are representatives of major religions in Singapore. Chairing the council is the Chairman of the [Public Service Commission](/wiki/Public_Service_Commission_(Singapore)), [Eddie Teo](/wiki/Eddie_Teo). **Chairman**Eddie Teo, Chairman, Public Service Commission**Members representing major religions in Singapore** - Venerable Seck Kwang Phing, Secretary-General of the Singapore Buddhist Federation (representing [Buddhists](/wiki/Buddhism_in_Singapore)). - M. Rajaram, past President of the Singapore Indian Chamber of Commerce and Industry (representing [Hindus](/wiki/Hinduism_in_Singapore)). - Dr. Mohamed Fatris Bakaram, [Mufti](/wiki/Mufti) of Singapore (representing [Muslims](/wiki/Islam_in_Singapore)). - Bishop Emeritus Wee Boon Hup, past President of the [National Council of Churches of Singapore](/wiki/National_Council_of_Churches_of_Singapore) (representing Protestant Christians). - [Archbishop](/wiki/Archbishop_of_Singapore) [William Goh](/wiki/William_Goh), [Roman Catholic Church in Singapore](/wiki/Roman_Catholicism_in_Singapore). - Surjit Singh s/o Wazir Singh, Chairman of the Sikh Advisory Board (representing [Sikhs](/wiki/Sikhism_in_Singapore)). - Associate Professor Lee Cheuk Yin, academic adviser to the Taoist Federation and Taoist Mission (representing [Taoists](/wiki/Taoism_in_Singapore)). **Lay members** - Professor [Lily Kong](/wiki/Lily_Kong), President, [Singapore Management University](/wiki/Singapore_Management_University) - Juthika Ramanathan, Chief Executive, Office of the Chief Justice, [Supreme Court](/wiki/Supreme_Court_of_Singapore) #### Function and powers The PCRH has two main functions. First, and more generally, it is an advisory body to the Minister for Home Affairs on matters relating to the maintenance of religious harmony in Singapore that are referred to it by the Minister or by Parliament. Secondly, and more specifically, it advises the Minister as to whether restraining orders should be issued, confirmed, varied or cancelled, and the President as to whether such orders should be confirmed or cancelled. One commentator has expressed the view that certain features of the MRHA remove any transparency over the council's proceedings, making it impossible to discover if it has been performing its duties satisfactorily and to hold them accountable for any lack of conscientiousness. For one, the secrecy of the PCRH's workings is protected by section 7 of the MRHA, shielding their conclusions and recommendations from public scrutiny. Secondly, the prevention of judicial review by section 18 of the Act means that explanations in court which can be publicly accessible later cannot be extracted. These control mechanisms and protective provisions of the Act are said to have cumulatively made it impossible to determine what religious behaviour is allowed or disallowed. On the other hand, it has been argued that without the interposition of judicial review, the Government is able to use the MRHA's nebulous nature to specify norms of acceptable interaction between religious communities as it seeks to \"propagate an ethic of personal responsibility and intercultural tolerance\". #### Comparison with the PCMR The general functions of the PCRH and PCMR are similar in that they may both consider and report on religious matters referred to them. However, the most immediate distinction between the PCRH and the PCMR is the source of each body's legal powers. The existence of the PCMR and its powers are derived from the [Constitution of Singapore](/wiki/Constitution_of_Singapore), whereas the PCRH originates from the MRHA, an ordinary Act of Parliament. The scope of the PCMR's duty is broader as it is required to consider and report on racial matters as well. Although both the PCMR and PCRH act as advisory bodies on certain matters, the contexts in which advice is given and the recipients of such advice are different. The PCMR advises Parliament on bills, subsidiary legislation, and statutes in force on 9 January 1970, drawing attention to any form of differentiating measures contained in them. The advice provided by the PCRH is to the President, on whether to confirm, vary or cancel a restraining order which the Minister for Home Affairs has issued. Therefore, the PCMR's advisory role largely lies within the legislative process, while the PCRH renders advice on the exercise of executive power. One final difference is that the PCRH is protected by an [ouster clause](/wiki/Ouster_clause) in the MRHA, which prevents its decisions and recommendations from being [judicially reviewed](/wiki/Judicial_review) in [administrative](/wiki/Administrative_law_in_Singapore) or constitutional law. No such clause is found in the Constitution to protect the PCMR's discretion to take particular views or arrive at certain decisions. It is therefore unclear as to whether the acts of the PCMR are similarly shielded from the judicial review. ## History of the MRHA ### Enactment The process leading up to the passing of the Maintenance of Religious Harmony Bill began with the publication in 1989 of a [white paper](/wiki/White_paper#Government_white_papers) entitled *Maintenance of Religious Harmony*. This white paper detailed the religious trends in Singapore, the need for legislation to maintain religious harmony, and the main features of the proposed legislation. Annexed to it was a report by the [Internal Security Department](/wiki/Internal_Security_Department_(Singapore)) (ISD) in which were compiled instances of the problems discussed in the white paper. The white paper was presented to Parliament on 26 December 1989. On 15 January 1990, the Maintenance of Religious Harmony Bill was introduced in Parliament by [S. Jayakumar](/wiki/S._Jayakumar_(Singaporean_politician)), the [Minister for Home Affairs](/wiki/Ministry_of_Home_Affairs_(Singapore)). The [second reading](/wiki/Reading_(legislature)#Second_reading) of the bill in Parliament took place on 22 February 1990. It was resolved in Parliament that the bill be committed to a [Select Committee](/wiki/Parliament_of_Singapore#Select_committees). However, Parliament was [prorogued](/wiki/Parliament_of_Singapore#Sessions) on 21 April 1990 and the bill and proceedings on it lapsed. Thus, parliamentary proceedings for the passing of the bill had to be started afresh. The bill was introduced for its [first reading](/wiki/Reading_(legislature)#First_reading) in Parliament once again on 12 June 1990. The second reading took place on 18 July 1990 and an identical resolution that the Bill be committed to a Select Committee was passed. The Bill was read for the third time and passed by Parliament on 9 November 1990. It came into force on 31 March 1992. ### Social and political backdrop There were several prevailing social and political conditions in the 1980s which prompted the introduction of the bill. These were detailed in the *Maintenance of Religious Harmony* white paper. First, there had been an increase in religious fervour and assertiveness among religious groups, which was part of a worldwide religious revival. This had led to an increase in inter-religious tensions. Secondly, intra-religious tensions had also been observed. Thirdly, several incidents had taken place suggesting that religious groups and leaders were entering the realm of politics. #### Inter-religious tensions Inter-religious tensions were largely attributed to aggressive and insensitive proselytization by religious groups, mostly [Protestant](/wiki/Protestantism) churches and organizations. Examples cited in the ISD report annexed to the white paper included tensions in August 1986 when [Hindus](/wiki/Hinduism_in_Singapore) found posters publicizing a [Christian](/wiki/Christianity_in_Singapore) seminar pasted at the entrance to their temple, and when Christian missionaries distributed pamphlets to devotees going into temples along [Serangoon Road](/wiki/Serangoon_Road). There were also two disputes in July 1988 and January 1989 involving the funerals of non-Muslims who had converted to [Islam](/wiki/Islam_in_Singapore). The non-Muslim families had wanted to cremate the bodies according to their respective non-Islamic religious rites, but a Muslim organization applied for court orders to claim the bodies and bury them according to Islamic rites. Both these disputes were eventually settled out of court. #### Intra-religious tensions Hostility between sub-groups under the same religious umbrella also became apparent in the 1980s. In October 1989, for instance, a Hindu sect called the Shiv Mandir burnt an effigy of [Ravana](/wiki/Ravana), a Hindu mythological king, during a religious festival. This caused outrage among Tamil Hindus, who wanted to retaliate by staging a protest demonstration and threatened to retaliate by burning the effigy of Lord [Ramachandra](/wiki/Rama). Intra-religious tensions among Christian groups surfaced after the distribution of pamphlets and booklets denigrating the [Roman Catholic Church](/wiki/Roman_Catholicism_in_Singapore) and the Pope by some Protestants. #### Mixing of religion and politics According to the ISD report, the mid-1980s also saw Catholic priests engaging in social activism and using Catholic religious gatherings and publications as platforms to comment on political issues. Following the arrest of [Vincent Cheng](/wiki/Vincent_Cheng_(dissident)) and others associated with him and their detention under the [Internal Security Act](/wiki/Internal_Security_Act_(Singapore)) (\"ISA\"), several priests spoke out against the arrests at masses, describing it as an injustice and an attack on the Church. Several foreign Muslim theologians such as Imaduddin Abdul Rahim, [Ahmed Hoosen Deedat](/wiki/Ahmed_Deedat) and Mat Saman bin Mohamed were banned from entering Singapore after they delivered lectures or speeches inciting the Muslim community in Singapore against the Government. ### Concerns During debates at the Second Reading of bill in Parliament in February 1990, many concerns were raised regarding various aspects of the bill. These concerns were categorized by the Minister for Home Affairs in his speech during the Third Reading of the bill as follows: 1. Concerns that the bill framed the Minister's powers in rather excessive terms, and calls for additional safeguards. 2. Concerns that clause 8 of the bill, which set out the conduct that might lead to a restraining order being issued, had language which was subjective in nature and might give rise to difficulties. 3. Concerns about the composition of the proposed PCRH. Following the reference of the bill to a Select Committee, amendments were made in response to the concerns raised. These were presented in Parliament in November 1990 at the Third Reading of the bill, during which it was eventually passed. #### Wide-ranging nature of Minister's powers Concerns were expressed over the lack of checks on the Minister's power to issue a prohibiting or restraining order. It was suggested that the Minister's decision should be subject to judicial review or an appeal process since a decision made by a single minister could be fairly subjective, and if the decision-making power lay solely within the Minister's purview this might may fail to convince the public that any decision made was just and fair. Another suggestion raised in Parliament was to widen the purely advisory powers of the PCMR and grant it a more substantial power to act as a check and balance to the powers of the Minister. The Minister for Home Affairs pointed out that the Minister would not in practice make the decision in isolation from the rest of the Cabinet. Even so, amendments were made to the process of the decision to issue a restraining order. While the Minister would have power to make the order in first instance by issuing a notice to the individual, this order would have to be confirmed by the President within 30 days of the receipt of the report of the PCRH. The President would act on Cabinet's advice except where it was contrary to the PCRH's recommendation. These changes formalized the involvement of the Cabinet in the decision-making process and involved the President as an additional safeguard, thereby addressing the concern about the subjectivity of allowing the Minister to be the sole decision-maker. However, it was decided that the decision to issue a restraining order would remain non-justiciable and would not be subject to judicial review. #### Clause 8 There were also concerns that the earlier drafts of the bill phrased clause 8, which listed the unacceptable conduct which could be subject to a restraining order, in broad and subjective terms. One of the phrases in question was *causing feelings of enmity, hatred, ill-will or hostility* in clause 8(1)(a) of the earlier draft of the bill. The view was taken that this was drafted in a subjective manner, suggesting that if any person felt offended this would be a sufficient ground upon which a restraining order might be issued. It was suggested that this clause should be phrased to suggest that the objective view of a reasonable person would be the standard adopted. Another phrase in question appeared in clause 8(1)(b), which prohibited religious leaders or groups from promoting political causes. The concern raised was that some religious causes might be regarded as political causes, and that it was difficult to distinguish between the religious and the political where there were moral and social issues involved. In addition, religions which hold comprehensive [worldviews](/wiki/World_view), such as Islam and Christianity, might fall afoul of this provision as such religions were seen as a code of life which encompassed everything else including politics. Thus, the freedom of these particular religious groups to practice and propagate their religion guaranteed by [Article 15](/wiki/Article_15_of_the_Constitution_of_Singapore) of the Constitution might be curtailed. Clause 8(1)(d) of the draft bill empowered the Minister to issue a restraining order against a person for \"exciting disaffection against the President or the Government of Singapore\". The lack of clarity on the definition of \"exciting disaffection\" also raised some concerns. Eventually, several amendments were made to clause 8 of the bill. The changes included, *[inter alia](/wiki/Inter_alia)*, the deletion of the phrase *prejudicing the maintenance of harmony* in clause 8(1)(a) and establishing a nexus between the concept of exciting disaffection and the abuse of religion in clause 8(1)(d). These amendments sought to address concerns that the clause was too widely phrased. Nonetheless, critics have submitted that the object of the statute – to separate religion from politics – is futile. To religions with holistic worldviews, the practice of faith will inevitably tread on issues falling within the broad, undefined meaning of *politics* under the Act. #### Composition of the PCRH Concerns were raised about how the members of the PCRH would be selected and who they would represent. The importance of the credibility of these members among their own religious groups and in the larger society was raised. There were also differing opinions as to whether non-religious persons should be made members of the PCRH. Another concern was that the composition of the PCRH should be a fair representation of all the major religions in Singapore. It was pointed out that the diversity within religions such as Christianity made it difficult for fair representation and might lead to the exclusion of smaller and independent religious bodies. It was ultimately decided that two-thirds of the members of the PCRH would be representatives of religious groups; and provision for the qualifications and disqualifications of Council members were included, which were modelled on the provisions of the PCMR. Other amendments included the provision for a quorum at meetings of the PCRH. ### Legislative justification for executive decisions? The backdrop against which the MRHA was enacted has engendered suspicion that the Act was introduced for political reasons. [Operation Spectrum](/wiki/Operation_Spectrum) took place in May 1987, leading to the arrest of 16 alleged [Marxist](/wiki/Marxism) conspirators. At the Second Reading of the bill in Parliament, it was noted that the bill had been drafted in June 1987, soon after the Marxist arrests. The Opposition [Non-constituency Member of Parliament](/wiki/Non-constituency_Member_of_Parliament) Dr. [Lee Siew Choh](/wiki/Lee_Siew_Choh) alleged that the timing of the drafting indicated that the bill was \"an attempt, a belated attempt by Government to justify the arrests of the so-called Marxists\". In response, the [Minister for Home Affairs](/wiki/Ministry_of_Home_Affairs_(Singapore)) [S. Jayakumar](/wiki/S._Jayakumar_(Singaporean_politician)) said the ruling [People's Action Party](/wiki/People%27s_Action_Party) (PAP) had challenged Opposition parties to make the Marxist conspiracy an election issue before the [September 1988 general election](/wiki/1988_Singaporean_general_election), but this had not been taken up by them. The PAP had made this an election issue, and had received the people's mandate at the election. Lee then called for an immediate [referendum](/wiki/Referendum) on the issue of the arrests. ## Relationship with right to freedom of religion [Article 15](/wiki/Article_15_of_the_Constitution_of_Singapore) of the Constitution guarantees the [freedom of religion](/wiki/Freedom_of_religion_in_Singapore). In particular, Article 15(1) provides for the right to profess and practise one's religion and to propagate it. However, such a right is qualified by Article 15(4), which states that the Article does not authorize any act contrary to any general law relating to public order, public health or morality. The MRHA's constitutionality has not yet been tested in court. The Act *[prima facie](/wiki/Prima_facie)* violates Article 15(1) since the imposition of a restraining order effectively inhibits a person's rights to profess, practise and propagate his or her religion. However, given Parliament's rationales for the enactment of the MRHA, it is likely that the Act amounts to a general law relating to public order. Thus, its constitutionality may be preserved by Article 15(4). The term *public order* is not defined in the Constitution. In the [High Court](/wiki/High_Court_of_Singapore) case *[Chan Hiang Leng Colin v. Public Prosecutor](/wiki/Chan_Hiang_Leng_Colin_v._Public_Prosecutor)* (1994), [Chief Justice](/wiki/Chief_Justice_of_Singapore) [Yong Pung How](/wiki/Yong_Pung_How) held: \"I could not see how the concept of public order as envisaged under Art 15(4) is dissimilar to the notion of public peace, welfare and good order within s 24(1)(a) of the Societies Act [(Cap. 311, 1985 Rev. Ed.)]\". This was later reiterated by Justice [Judith Prakash](/wiki/Judith_Prakash) in *Chan Hiang Leng Colin v. Minister for Information and the Arts* (1995). This definition of *public order* is broad and, arguably, ambiguous. The MRHA falls comfortably within its purview, since the Act was passed with the aim of preventing people from causing feelings of enmity, hatred, ill will or hostility to arise between different religious groups. Thus, a person's expression of religion is guaranteed under Article 15(1), so long as it is not contrary to the MRHA. ## Comparison with other legislation ### Sedition Act The [Sedition Act](/wiki/Sedition_Act_(Singapore)) criminalizes any act that has a [seditious tendency](/wiki/Sedition). This includes the publication of seditious materials, the utterance of seditious words, and the importing of seditious material. *Seditious tendency* is defined in section 3 of the Act and includes, among other things, a tendency to promote feelings of ill will and hostility between different races or classes of the population of Singapore. The Sedition Act and the MRHA are thus similar in that the purpose of both statutes is to maintain public order. Seditious words or acts tear the societal fabric, which manifests in the social evil of feelings of ill-will and hostility between different races. The enactment of the MRHA counters the problem caused by some \"mischievous, irresponsible people ... [T]hough they may be few, they can cause great harm not to just one religious group but to the very fabric of our society.\" However, there are also notable differences between the Sedition Act and the MRHA. The first relates to the consequences of violation. Under section 4 of the Sedition Act, an offender is criminally liable. In contrast, under the MRHA, the imposition of a restraining order does not *[per se](/wiki/List_of_Latin_phrases_(P)#per_se)* carry criminal liability. It is only when this restraining order has been breached that criminal liability will attach to the offender. This difference reflects the varying approach towards disruption of public order – the punitive approach of the Sedition Act contrasts with the pre-emptive approach of the MRHA. Such an arrangement allows the Government to mount a calibrated response against perpetrators. If the Sedition Act was the only relevant statute in operation, it might result in disproportionately harsh action being taken against minor public order disturbances. The second difference relates to the mischief that both statutes address. It is clear that the MRHA was meant to address mischiefs of a religious nature. In comparison, the Sedition Act encompasses a broader category of mischief. This is seen in section 3(1)(e), where only hostile actions relating to race and classes of people have a seditious tendency. Whether \"classes of people\" includes religious groups has yet to be directly commented on by the courts. However, the [District Court](/wiki/Subordinate_Courts_of_Singapore) case *Public Prosecutor v. Koh Song Huat Benjamin* (2005) suggests that a perpetrator can be charged under the Sedition Act when the acts committed connote anti-religious sentiments. This effectively subsumes the mischief of the MRHA under the Sedition Act. ### Penal Code, section 298A This section's **factual accuracy may be compromised due to out-of-date information**. The reason given is: Consequential amendments made by s. 17 of the Maintenance of Religious Harmony (Amendment) Act 2019.. Please help update this article to reflect recent events or newly available information. *(January 2023)* Section 298A of the [Penal Code](/wiki/Penal_Code_(Singapore)) states: > Whoever — > > (a) by words, either spoken or written, or by signs or by visible representations or otherwise, knowingly promotes or attempts to promote, on grounds of *religion* or race, disharmony or feelings of enmity, hatred or ill-will between different *religious* or racial groups; or(b) commits any act which he knows is prejudicial to the *maintenance of harmony between different religious* or racial groups and which disturbs or is likely to disturb the *public tranquility*, > > shall be punished with imprisonment for a term which may extend to 3 years, or with fine, or with both. [Emphasis added.] A literal reading of the above provision shows clearly that the purpose of section 298A is to preserve public tranquility, and only to criminalize acts that incite racial and religious disharmony. This seems extremely similar to the objective of the MRHA. The only significant difference is that a violation of section 298A results in the commission of a criminal offence, while criminal liability attaches under the MRHA only when a restraining order has been breached. The High Court has rejected \"public tranquility\" as a definition of *public order*. In *Chan Hiang Leng Colin v. Public Prosecutor*, Yong C.J. declined to adopt the test laid down in the Malaysian case *Tan Boon Liat v. Menteri Hal Ehwal Dalam Negeri* (1976), where *public order* was held to mean \"danger to human life and safety and the disturbance of public tranquility\". Instead, the expression \"public peace, welfare and good order\" was adopted. Does it follow that section 298A is not a general law relating to public order, and thus is unconstitutional since this restriction on the right to freedom of religion is not caught by Article 15(4)? It is also unclear whether there is any difference in the objective of the Sedition Act and section 298A. In August 2010 it was reported that a man had been jailed for two weeks for contravening section 298A for injuring the religious feelings of Muslims by leaving cards on the windscreens of cars he believed to belong to Muslims which were parked in the car park of a condominium. The cards bore information about [Muhammad](/wiki/Muhammad) which was said to be \"calculated to insult Muslims\". ### Internal Security Act The Internal Security Act was introduced in the 1940s primarily to \"counter communist-sparked violence\", and is one of the most controversial laws in Singapore. The sources of contention largely pertain to the wide powers conferred on the Government by the Act, and the lack of transparency and checks in the exercise of such discretion. The powers exercisable by the Minister for Home Affairs under the MRHA form a subset of the powers exercisable under the ISA. Section 8 of the ISA empowers the Minister, among other things, to detain a person without trial, to restrain the person's actions, and to prohibit the person from addressing public meetings or taking part in the activities of any association. The power to restrict publications under section 8(2)(b) of the MRHA is mirrored in section 20(1)(c) of the ISA which allows for the prohibition of subversive publications that are \"calculated or likely to lead to a breach of the peace, or to promote feelings of hostility between different races or classes of the population\". Both the ISA and the MRHA have provisions that oust judicial review. The ouster clause in the ISA appears to be qualified, as it states: > There shall be no judicial review in any court of any act done or decision made by the President or the Minister under the provisions of this Act *save in regard to any question relating to compliance with any procedural requirement of this Act governing such act or decision*. [Emphasis added.] Section 18 of the MRHA merely states: \"All orders and decisions of the President and the Minister and recommendations of the Council made under this Act shall be final and shall not be called in question in any court.\" The extent to which these clauses prevent the courts from exercising judicial review remains somewhat unclear, as a 1999 High Court decision held on an *[obiter](/wiki/Obiter_dictum)* basis that an ouster clause would not have the effect of barring the High Court from exercising judicial review \"if the inferior tribunal has acted without jurisdiction or 'if it has done or failed to do something in the course of the inquiry which is of such a nature that its decision is a nullity'\", such as acting in breach of the rules of [natural justice](/wiki/Natural_justice). ### Assessment The MRHA, the Sedition Act, section 298A of the Penal Code and the ISA all share an underlying objective: to maintain public order. The greatest disparity between the MRHA and the other pieces of legislation lies in the fact that the former provides for a much more benign resolution of issues. One commentator has said that there seems to be no apparent purpose for having a wide array of outcomes to choose from when dealing with the same mischief – religious disharmony. On the other hand, it might be argued that given a highly sensitive topic like religion, which incites deep feelings, an arsenal of options is vital so that an outcome best suiting the scenario can be tailored. Nevertheless, the MRHA, despite having the least severe consequences, has not yet been invoked. ## Developments On 28 July 1991, the Executive Committee of the [World Methodist Council](/wiki/World_Methodist_Council), which was holding its five-yearly World Methodist Conference in Singapore, issued a press statement criticizing provisions in the MRHA which permitted Singapore to \"impose restrictions on officials or members of any religious group without recourse to the courts\". The committee also commended the [Methodist Church in Singapore](/wiki/Methodist_Church_in_Singapore) (\"MCS\") for raising questions about these provisions, and resolved that a group of council officers should remain in close contact with the MCS to monitor the Act's impact on religious freedom. Subsequently, the Council issued another statement in which it said that it \"regrets the dissemination of information not approved by the council and apologises to members of the Singapore Methodist Church and its leaders for any grief, pain or embarrassment\". On 30 July Bishop Ho Chee Sin, the head of the MCS, informed *[The Straits Times](/wiki/The_Straits_Times)* that the council had voted to modify the Executive Committee's resolutions. According to him, the Council did not object to the Act but expressed a desire to learn more about it. He also said: \"The council is keen to learn more about religious harmony here, and how religious liberty, which is enshrined in the Singapore Constitution, can be promoted.\" Four days before polling day of the [1991 general election](/wiki/1991_Singaporean_general_election), [Jufrie Mahmood](/wiki/Jufrie_Mahmood), a candidate for the [Workers' Party of Singapore](/wiki/Workers%27_Party_of_Singapore), mentioned at a rally on 27 August 1991 that he opposed the MRHA which aimed to separate religion and politics. He said: \"Now, the imams of mosques who deliver sermons must feel disturbed but they can't say a thing against Government policy for under the Maintenance of Religious Harmony law, if they touch on the issue of lewd movies, they can be in for trouble. That's the reason why I oppose.\" In response, the [Minister for Community Development](/wiki/Ministry_of_Community_Development,_Youth_and_Sports) [Wong Kan Seng](/wiki/Wong_Kan_Seng) said that there was nothing preventing religious leaders from advising their congregations not to watch [R-rated films](/wiki/Censorship_in_Singapore#Films_and_videos), and, in their individual capacity, it was open to them to write to the [Ministry of Information and the Arts](/wiki/Ministry_of_Information,_Communications_and_the_Arts) to express their disapproval of such films. However, the Act prevented them from inciting their congregants to oppose the Government on the issue. Wong also said that Jufrie had mentioned imams to talk about a secular issue and incite Malay feelings against the Government. In May 2001, the Minister for Home Affairs disclosed that the Government had been prepared to use the Act against a number of religious leaders who had mixed religion with politics or denigrated other faiths. These leaders had ceased their actions after warnings from the police and the ISD. One incident involved a Muslim religious leader who had urged Muslims to vote for Muslim candidates with deep religious beliefs at the 1991 general election; he was given a warning in 1992. In the same year, a Christian pastor was cautioned for using church publications and sermons to criticize [Buddhism](/wiki/Buddhism_in_Singapore), [Taoism](/wiki/Taoism_in_Singapore) and Roman Catholicism. In 1995, another Muslim religious leader was warned for having called a [Hindu](/wiki/Hinduism_in_Singapore) belief that statues of [Ganesha](/wiki/Ganesha) could [drink milk offerings](/wiki/Hindu_milk_miracle) the work of Satan. - [Article 15 of the Constitution of Singapore](/wiki/Article_15_of_the_Constitution_of_Singapore) - [Declaration of Religious Harmony](/wiki/Declaration_of_Religious_Harmony) - [Freedom of religion in Singapore](/wiki/Freedom_of_religion_in_Singapore) ## Notes ### Legislation and related documents - [Constitution of the Republic of Singapore](/wiki/Constitution_of_Singapore) (1985 Rev. Ed., 1999 Reprint). - Maintenance of Religious Harmony Act 1990 (2020 Revised Edition) (\"MRHA\"). - *Maintenance of Religious Harmony [Cmd. 21 of 1989]*, Singapore: Printed for the [Government of Singapore](/wiki/Government_of_Singapore) by the Singapore National Printers, 1989, [OCLC](/wiki/OCLC_(identifier)) 220660657 (\"white paper\"). - Second Reading of the Maintenance of Religious Harmony Bill, *Singapore Parliamentary Debates, Official Report* (22–23 February 1990), vol. 54, cols. 1047–1130 and 1143–1212. - *Report of the Select Committee on the Maintenance of Religious Harmony Bill (Bill no. 14/90) [Parl. 7 of 1990]*, Singapore: Printed for the Government of Singapore by the Singapore National Printers, 1990, [OCLC](/wiki/OCLC_(identifier)) 213382819. - [Sedition Act](/wiki/Sedition_Act_(Singapore)) (Cap. 290, 1985 Rev. Ed.) (\"SA\"). ### Other works - Tey, Tsun Hang (2008), \"Excluding Religion from Politics and Enforcing Religious Harmony – Singapore-Style\", *Singapore Journal of Legal Studies*: 118–142. - Zhong, Zewei (2009), \"Racial and Religious Hate Speech in Singapore: Management, Democracy, And The Victim's Perspective\", *Singapore Law Review*, **27**: 13–59, [SSRN](/wiki/SSRN_(identifier)) 1418654. ### Articles and websites - Lim, Jean (31 January 2010), *Maintenance of Religious Harmony Act*, Singapore Infopedia, [National Library Board](/wiki/National_Library_Board), archived from the original on 8 October 2010, retrieved 5 October 2011. - Ramakrishna, Kumar (10 June 2010), *'Muscular' versus 'Liberal' Secularism and the Religious Fundamentalist Challenge in Singapore [RSIS Working Paper no. 202]* (PDF), [S. Rajaratnam School of International Studies](/wiki/S._Rajaratnam_School_of_International_Studies), [Nanyang Technological University](/wiki/Nanyang_Technological_University), archived from the original (PDF) on 2 April 2012. - Steiner, Kerstin (February 2011), \"Religion and Politics in Singapore – Matters of National Identity and Security?: A Case Study of the Muslim Minority in a Secular State\" (PDF), *Osaka University Law Review* (58): 107–134, archived from the original (PDF) on 25 April 2012. - [Thio, Li-ann](/wiki/Thio_Li-ann) (2009), \"Between Eden and Armageddon: Navigating 'Religion' and 'Politics' in Singapore\", *Singapore Journal of Legal Studies*: 365–405, [SSRN](/wiki/SSRN_(identifier)) 1543624. - Thio, Li-ann (1995), \"The Secular Trumps the Sacred: Constitutional Issues Arising from *Colin Chan v Public Prosecutor*\", *Singapore Law Review*: 26. - Wan, William (July 2007), \"Religion and the Law\", *Singapore Law Gazette*, archived from the original on 25 April 2012. - Winslow, V[alentine] S. (1990), \"The Separation of Religion and Politics: The Maintenance of Religious Harmony Act 1990\", *Malaya Law Review*: 327. ### Books - Louis, Evelyn Teresa (1998), *Religious Harmony in Singapore [unpublished PhD in Religious Studies thesis]*, [New Zealand]: [Massey University](/wiki/Massey_University), [OCLC](/wiki/OCLC_(identifier)) 154794147. - Tan, Kevin Y[ew] L[ee] (2011), \"Fundamental Liberties III: Freedom of Expression • Association • Assembly • Religion\", *An Introduction to Singapore's Constitution* (rev. ed.), Singapore: Talisman Publishing, pp. 186–203 at 197–203, [ISBN](/wiki/ISBN_(identifier)) 978-981-08-6456-9. - Tan, Kevin Y[ew] L[ee]; Thio, Li-ann (2010), \"Freedom of Religion\", *Constitutional Law in Malaysia and Singapore* (3rd ed.), Singapore: [LexisNexis](/wiki/LexisNexis), pp. 1197–1344, [ISBN](/wiki/ISBN_(identifier)) 978-981-236-795-2. ### News reports - Chua, Mui Hoong (5 November 2004), \"Beware of mixing religion and politics\", *[The Straits Times](/wiki/The_Straits_Times)*, p. 33. - Thio, Li-ann (15 December 2004), \"Hearing out religion in public debate\", *The Straits Times*, p. 20. - Lim, Lydia; Koh, Leslie (23 April 2005), \"Religion – private or public affair?\", *The Straits Times*, p. 8. - Chua, Mui Hoong (18 May 2007), \"Is there a place for God in public morals debate?\", *The Straits Times*. - Thio, Li-ann (30 October 2007), \"Secularism, the Singapore way\", *The Straits Times*. - Chua, Mui Hoong (16 November 2007), \"Rules of engagement for God and politics\", *The Straits Times*. - Janadas Devan (24 November 2007), \"Secularism – not from theory but bloody history\", *The Straits Times*. - Chua, Mui Hoong (16 May 2009), \"The roles for faith-based groups\", *The Straits Times*. - [S. Jayakumar](/wiki/S._Jayakumar_(Singaporean_politician)) (24 July 2009), \"Foolhardy to take harmony for granted\", *The Straits Times*. - Zakir Hussain (24 July 2009), \"Religious harmony: 20 years of keeping the peace\" (PDF), *The Straits Times (reproduced on SMU website)* - Zakir Hussain (25 July 2009), \"Jaya: Don't take harmony for granted: Fundamental problems that led to religious harmony Act still exist\", *The Straits Times (reproduced on the [Ministry of Foreign Affairs](/wiki/Ministry_of_Foreign_Affairs_(Singapore)) website)*, archived from the original on 31 March 2012. - Oon, Clarissa (17 August 2009), \"PM warns of religious fault lines\", *The Straits Times*. - \"Three side effects of religious fervour\", *The Straits Times*, 17 August 2009. - Leong, Wee Keat (17 August 2009), \"The three pitfalls of fervour\", *[Today](/wiki/Today_(Singapore_newspaper))*, p. 2. - \"Risks of religious fervour\", *The Straits Times*, 18 August 2009. - Tan, Eugene K[heng] B[oon] (17 April 2010), \"Religion still matters: But we must resist the tendency to view every contentious issue from a religious perspective\" (PDF), *Today*, p. 13. - Tan, Seow Hon (7 April 2011), \"Room for religion in public discourse: Why, in some situations, it makes sense to let religious citizens speak up on their convictions\" (PDF), *Today*, p. 16. - Chia, Roland (10 June 2011), \"Religion and the public space: Valuable lessons from the Singapore model\", *The Straits Times*.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:28:05.149295",
  "title": "Maintenance of Religious Harmony Act",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Maintenance_of_Religious_Harmony_Act"
}