{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:28:53.392916"
  },
  "content": "Austronesian ethnic groupEthnic group **Malays**[Note 5] ([Malay](/wiki/Malay_language): *Orang Melayu*, [Jawi script](/wiki/Jawi_script): اورڠ ملايو‎) are an [Austronesian](/wiki/Austronesian_peoples) [ethnoreligious group](/wiki/Ethnoreligious_group) native to the [Malay Peninsula](/wiki/Malay_Peninsula), eastern [Sumatra](/wiki/Sumatra), coastal [Borneo](/wiki/Borneo), and the smaller islands that lie between these locations known as [Riau Archipelago](/wiki/Riau_Archipelago). These locations are today part of the countries of [Malaysia](/wiki/Malaysia), [Indonesia](/wiki/Indonesia) (eastern and southern [Sumatra](/wiki/Sumatra), [Bangka Belitung Islands](/wiki/Bangka_Belitung_Islands), [West Kalimantan](/wiki/West_Kalimantan), [Riau Islands](/wiki/Riau_Islands), and the coast of [East Kalimantan](/wiki/East_Kalimantan)), the southern part of [Thailand](/wiki/Thailand) ([Pattani](/wiki/Pattani_Province), [Satun](/wiki/Satun_Province), [Songkhla](/wiki/Songkhla_Province), [Trang](/wiki/Trang_Province), [Krabi](/wiki/Krabi_Province), [Yala](/wiki/Yala_Province), and [Narathiwat](/wiki/Narathiwat_Province)), [Singapore](/wiki/Singapore), [Brunei Darussalam](/wiki/Brunei_Darussalam), and the southern tip of [Myanmar](/wiki/Myanmar) ([Tanintharyi](/wiki/Tanintharyi_Region)). There is considerable linguistic, cultural, artistic and social diversity among the many Malay subgroups, mainly due to hundreds of years of immigration and assimilation of various regional ethnicity and tribes within [Maritime Southeast Asia](/wiki/Maritime_Southeast_Asia). Historically, the Malay population is descended primarily from the earlier [Malayic](/wiki/Malayic_languages)-speaking Austronesians and [Austroasiatic](/wiki/Austroasiatic_languages) tribes who founded several ancient maritime trading states and kingdoms, notably [Brunei](/wiki/History_of_Brunei), [Kedah](/wiki/Kedah_Kingdom), [Langkasuka](/wiki/Langkasuka), [Gangga Negara](/wiki/Gangga_Negara), [Chi Tu](/wiki/Chi_Tu), [Nakhon Si Thammarat](/wiki/Nakhon_Si_Thammarat_Kingdom), [Pahang](/wiki/Old_Pahang_Kingdom), [Melayu](/wiki/Melayu_Kingdom), and [Srivijaya](/wiki/Srivijaya). The advent of the [Malacca Sultanate](/wiki/Malacca_Sultanate) in the 15th century triggered a major revolution in Malay history, the significance of which lies in its far-reaching political and cultural legacy. Common definitive markers of [Malayness](/wiki/Malayness)—the religion of [Islam](/wiki/Islam), the [Malay language](/wiki/Malay_language) and traditions—are thought to have been promulgated during this era, resulting in the [ethnogenesis](/wiki/Ethnogenesis) of the Malay as a major [ethnoreligious group](/wiki/Ethnoreligious_group) in the region. In literature, architecture, [culinary traditions](/wiki/Malay_cuisine), traditional dress, performing arts, martial arts and royal court traditions, Malacca set a standard that later Malay sultanates emulated. The golden age of the [Malay sultanates](/wiki/Malay_sultanate) in the [Malay Peninsula](/wiki/Malay_Peninsula), [Sumatra](/wiki/Sumatra) and [Borneo](/wiki/Borneo) saw many of their inhabitants, particularly from various tribal communities like the [Batak](/wiki/Batak), [Dayak](/wiki/Dayak_people), [Orang Asli](/wiki/Orang_Asli), and the [Orang Laut](/wiki/Orang_Laut) become subject to [Islamisation](/wiki/Islamisation) and [Malayisation](/wiki/Malayisation). In the course of history, the term \"Malay\" has been extended to other ethnic groups within the \"[Malay world](/wiki/Malay_world)\"; this usage is nowadays largely confined to Malaysia and Singapore, where descendants of immigrants from these ethnic group are termed as *[anak dagang](/wiki/Anak_dagang)* (\"traders\") and who are predominantly from the [Indonesian archipelago](/wiki/Indonesia), such as the [Acehnese](/wiki/Acehnese_people), [Banjarese](/wiki/Banjar_people), [Bawean](/wiki/Bawean_people), [Bugis](/wiki/Bugis), [Mandailing](/wiki/Mandailing_people), [Minangkabau](/wiki/Minangkabau_people), and [Javanese](/wiki/Javanese_people). Throughout their history, the Malays have been known as a coastal-trading community with fluid cultural characteristics. They [absorbed](/wiki/Trans-cultural_diffusion), [shared](/wiki/Intercultural_communication_principles) and [transmitted](/wiki/Cultural_learning) numerous cultural features of other local ethnic groups, such as those of Minangkabau and Acehnese. ## Etymology The epic literature the *[Malay Annals](/wiki/Malay_Annals)* associates the etymological origin of \"Melayu\" to a small river named *Sungai Melayu* ('Melayu river') in [Sumatra](/wiki/Sumatra), Indonesia. The epic incorrectly stated that the river flowed to the [Musi River](/wiki/Musi_River_(Indonesia)) in [Palembang](/wiki/Palembang), while in reality it flowed to the [Batang Hari River](/wiki/Batang_Hari_River) in [Jambi](/wiki/Jambi).: 298 The term is thought to be derived from the [Malay](/wiki/Malay_language) word *melaju*, a combination of the verbal [prefix](/wiki/Prefix) 'me' and the [root word](/wiki/Root_word) 'laju', meaning \"to accelerate\", used to describe the accelerating strong current of the river. ### As a place name (toponym) Prior to the 15th century, the term \"Melayu\" and its similar-sounding variants appear to apply as an old [toponym](/wiki/Toponym) to the [Strait of Malacca](/wiki/Strait_of_Malacca) region in general. - ***Malaya Dwipa***, \"Malaya [Dvipa](/wiki/Dvipa)\", is described in chapter 48, [Vayu Purana](/wiki/Vayu_Purana) as one of the provinces in the eastern sea that was full of gold and silver. Some scholars equate the term with [Sumatra](/wiki/Sumatra), but several Indian scholars believe the term should refer to the mountainous [Malay Peninsula](/wiki/Malay_Peninsula), while Sumatra is more correctly associated with [Suvarnadvipa](/wiki/Suvarnabhumi). - ***Maleu-kolon*** – a location in the [Golden Chersonese](/wiki/Golden_Chersonese), from [Ptolemy](/wiki/Ptolemy)'s work, [Geographia](/wiki/Geographia_(Ptolemy)). - ***Mo-lo-yu*** – mentioned by [Yijing](/wiki/I_Ching_(monk)), a [Tang dynasty](/wiki/Tang_dynasty) [Chinese Buddhist](/wiki/Chinese_Buddhism) monk who visited the Southeast Asia in 688–695. According to Yijing, the *Mo-Lo-Yu* kingdom was located at a distance of 15 days sailing from Bogha (Palembang), the capital of Sribhoga ([Srivijaya](/wiki/Srivijaya)). It took a 15-day sail as well to reach Ka-Cha ([Kedah](/wiki/Kedah)) from Mo-lo-yu; therefore, it can be reasoned that Mo-Lo-Yu would lie halfway between the two places. A popular theory relates *Mo-Lo-Yu* with the [Jambi](/wiki/Muaro_Jambi_Temple_Compounds) in Sumatra, however the geographical location of Jambi contradicts with Yi Jing's description of a \"half way sail between *Ka-Cha* (Kedah) and *Bogha* (Palembang)\". In the later [Yuan dynasty](/wiki/Yuan_dynasty) (1271–1368) and [Ming dynasty](/wiki/Ming_dynasty) (1368–1644), the word *Ma-La-Yu* was mentioned often in Chinese historical texts – with changes in spelling due to the time span between the dynasties – to refer to a nation near the southern sea. Among the terms used was \"Bôk-lá-yù\", \"Mók-là-yū\" (木剌由), Má-lì-yù-er (麻里予兒), Oō-laì-yu (巫来由) — traced from the written source of monk [Xuanzang](/wiki/Xuanzang)) and Wú-laī-yû (無来由). - ***Malaiyur*** – mentioned in the [Tanjore inscription](/wiki/Tamil_inscriptions_in_the_Malay_world#Tanjore_Inscription). It was described as a kingdom that had \"a strong mountain for its rampart\" that fell to the Chola invaders during [Rajendra Chola I](/wiki/Rajendra_Chola_I)'s campaign in the 11th century. It may have been situated in Sumatra, between Pannai and Srivijaya (Palembang),: 77–78, 170 possibly in the [Muaro Jambi](/wiki/Muaro_Jambi_Regency) archaeological site.: 405 - ***Malai*** – mentioned by the 12th century Arab geographer [Muhammad al-Idrisi](/wiki/Muhammad_al-Idrisi) in [Tabula Rogeriana](/wiki/Tabula_Rogeriana), it described the Malay peninsula as a long island and called it Malai, bordering the Qmer ([Khmer](/wiki/Khmer_Empire)) and lying 12 days sail from Sanf ([Champa](/wiki/Champa)). - ***Bhūmi Mālayu*** – (literally \"Land of Malayu\"), a transcription from [Padang Roco Inscription](/wiki/Padang_Roco_Inscription) dated 1286 CE by Slamet Muljana. The term is associated with [Dharmasraya](/wiki/Dharmasraya) kingdom. - ***Ma-li-yu-er*** – mentioned in the chronicle of [Yuan dynasty](/wiki/Yuan_dynasty), referring to a nation of the Malay Peninsula that faced the southward expansion of [Sukhothai Kingdom](/wiki/Sukhothai_Kingdom), during the reign of [Ram Khamhaeng](/wiki/Ram_Khamhaeng). The chronicle stated: \"*..Animosity occurred between [Siam](/wiki/Thai_people) and Ma-li-yu-er with both killing each other ...*\". In response to the Sukhothai's action, a Chinese envoy went to the Ram Khamhaeng's court in 1295 bearing an imperial decree: \"Keep your promise and do no evil to Ma-li-yu-er\". - ***Malauir*** – mentioned in [Marco Polo](/wiki/Marco_Polo)'s [account](/wiki/Travels_of_Marco_Polo) as a kingdom located in the Malay Peninsula, possibly similar to the one mentioned in Yuan chronicle. - ***Malayapura*** – (literally \"city of Malaya\" or \"fortress of Malaya\"), inscribed on the [Amoghapasa inscription](/wiki/Amoghapasa_inscription) dated 1347 CE. The term was used by [Adityawarman](/wiki/Adityawarman) to refer to [Dharmasraya](/wiki/Dharmasraya). Other suggestions include the [Javanese](/wiki/Javanese_language) word *mlayu* (as a verb: to run, participle: fugitive), or the Malay term *melaju* (to steadily accelerate), referring to the high mobility and migratory nature of its people. De Barros (1552) mentioned that [Iskandar Shah](/wiki/Iskandar_Shah) named the *Malaios* (Malays) so because of the banishment of his father from his country. Albuquerque explained that [Parameswara](/wiki/Parameswara_(king)) fled (*malayo*) from the kingdom of Palembang to Malacca. ### As an ethnic name (ethnonym) The word \"Melayu\" as an [ethnonym](/wiki/Ethnonym), to allude to a clearly different ethnological cluster, is assumed to have been made fashionable throughout the integration of the Malacca Sultanate as a regional power in the 15th century. It was applied to report the social partialities of the Malaccans as opposed to foreigners as of the similar area, especially the [Javanese](/wiki/Javanese_people) and [Thais](/wiki/Thai_people). This is evidenced from the early 16th century Malay word-list by [Antonio Pigafetta](/wiki/Antonio_Pigafetta) who joined the [Magellan's circumnavigation](/wiki/Timeline_of_Magellan%27s_circumnavigation), that made a reference to how the phrase *chiara Malaiu* ('Malay ways') was used in the [maritime Southeast Asia](/wiki/Maritime_Southeast_Asia), to refer to the *al parlare de Malaea* ([Italian](/wiki/Italian_language) for \"to speak of Malacca\"). Classical Malay literature described the Malays in a narrower sense than the modern interpretation. *Hikayat Hang Tuah* (ca. 1700, manuscript ca. 1849) only identifies the Malay people as the subject of Malacca Sultanate; Brunei, at that time, is not considered Malay. *Hikayat Patani* (manuscript: 1876) for example, does not call Patani and Brunei as Malay, that term is only used for [Johor](/wiki/Johor). Kedah is not included as Malay in the Kedah chronicle/[Hikayat Merong Mahawangsa](/wiki/Hikayat_Merong_Mahawangsa) (ca. 1821). *Hikayat Aceh* (ca. 1625, manuscript ca. 1675) linked Malay ethnicity with Johor, but certainly not Aceh or Deli. ## Origins ### Proto-Malay models Also known as *Melayu asli* (aboriginal Malays) or *Melayu purba* (ancient Malays), the [Proto-Malays](/wiki/Proto-Malay) are of [Austronesian](/wiki/Austronesian_people) origin and thought to have migrated to the [Malay Archipelago](/wiki/Malay_Archipelago) in a long series of migrations between 2500 and 1500 BCE. Notable [Proto-Malays](/wiki/Proto-Malay) of today are [Moken](/wiki/Moken), [Jakun](/wiki/Jakun_people), [Orang Kuala](/wiki/Orang_Kuala), [Temuan](/wiki/Temuan_people) and [Orang Kanaq](/wiki/Orang_Kanaq). *The Encyclopedia of Malaysia: Early History*, has pointed out a total of three theories of the origin of Malays: - The [Yunnan](/wiki/Yunnan) theory (published in 1889) – The theory of Proto-Malays originating from Yunnan approximately 4,000 to 6,000 years ago. The theory is supported by R.H Geldern and his team who theorised that their migration occurred from the Mekong River to the Malay Peninsula. Other evidence that supports this theory includes stone tools found in the Malay Archipelago being analogous to Central Asian tools, which shows the similarity of Malay and [Assamese](/wiki/Assamese_people) customs. - The New Guinea/Seafarers theory (published in 1965) – The migration of seafarers with strong oceanographic skills who travelled from island to island between New Zealand and Madagascar. The theory claims the Malay's morphology at the time were similar to that of Negroids. - The [Taiwan](/wiki/Taiwan) theory (published in 1997) – The migration of a group of people from [Southern China](/wiki/Southern_China) occurred 6,000 years ago, some moved to Taiwan (today's [Taiwanese aborigines](/wiki/Taiwanese_aborigines) are their descendants), then to the [Philippines](/wiki/Philippines) and later to [Borneo](/wiki/Borneo) (roughly 4,500 years ago) (today's [Dayak](/wiki/Dayak_people) and other groups). These ancient people also split with some heading to [Sulawesi](/wiki/Sulawesi) and others progressing into [Java](/wiki/Java), and [Sumatra](/wiki/Sumatra), all of which now speak languages that belong to the Austronesian Language family. The final migration was to the Malay Peninsula roughly 3,000 years ago. A sub-group from Borneo moved to Champa in modern-day Central and South Vietnam roughly 4,500 years ago. There are also traces of the [Dong Son](/wiki/Dong_Son_culture) and [Hoabinhian](/wiki/Hoabinhian) migration from Vietnam and Cambodia. All these groups share DNA and linguistic origins traceable to the island that is today Taiwan, and the ancestors of these ancient people are traceable to southern China. #### Deutero-Malays The Deutero-Malays are an [Iron Age](/wiki/Iron_Age) people descended partly from the subsequent [Austronesian peoples](/wiki/Austronesian_peoples) who came equipped with more advanced farming techniques and new knowledge of metals. The Deutero-Malay settlers were not [nomadic](/wiki/Nomadic) like their predecessors: instead they settled and established [kampungs](/wiki/Kampung) which serve as the main units in society. These kampungs were normally situated on the riverbanks or coastal areas and generally self-sufficient in food and other necessities. By the end of the 1st century BCE, these kampungs were beginning to engage in some trade with the outside world. The Deutero-Malays are considered the direct ancestors of the present-day Malay people. #### Expansion from Sundaland model A more recent theory holds that rather than being populated by expansion from the mainland, the [Ice Age](/wiki/Last_Glacial_Period) populations of the Malay Peninsula, neighbouring Indonesian Archipelago, and the then-exposed continental shelf ([Sundaland](/wiki/Sundaland)) instead developed locally from the first human settlers and expanded to the mainland. Proponents of this theory hold that this expansion gives a far more parsimonious explanation of the linguistic, archaeological, and anthropological evidence than earlier models, particularly the Taiwan model. This theory also draws support from recent genetic evidence by [Human Genome Organisation](/wiki/Human_Genome_Organisation) suggesting that the primary peopling of Asia occurred in a single migration through Southeast Asia; this route is held to be the modern Malay area and that the diversity in the area developed mainly in-place without requiring major migrations from the mainland. The expansion itself may have been driven by [rising sea levels](/wiki/Sea_level_rise) at the end of the Ice Age. Proponent [Stephen Oppenheimer](/wiki/Stephen_Oppenheimer) has further theorised that the expansion of peoples occurred in three rapid surges due to rising sea levels at the end of the Ice Age, and that this diaspora spread the peoples and their associated cultures, myths, and technologies not just to mainland Southeast Asia, but as far as India, the Near East, and the Mediterranean. Reviewers have found his proposals for the original settlement and dispersal worthy of further study, but have been sceptical of his more [diffusionist](/wiki/Diffusionist) claims. ### Genetic evidence Malays are an Austronesian-speaking ethnic group of [Insular Southeast Asia](/wiki/Insular_Southeast_Asia), and the [Malay Peninsula](/wiki/Malay_Peninsula). According to a 2015 study, Malays from Peninsular Malaysia, Singapore, Indonesia and Sri Lanka have 4 major ancestral components, including Austronesian (17%–62%), Proto-Malay (15%–31%), East Asian (4%–16%) and South Asian (3%–34%). But the Austronesian and Southeast Asian aboriginal components were more significant for Malays from Peninsular Malaysia, Singapore and Indonesia than East Asian and South Asian. In contrast, Malays from Sri Lanka possessed about 34% South Asian ancestry in their genetic makeup, making them relatively distinct. A study in 2021 concluded that a distinctive [Basal-East Asian](/wiki/East_Asian_people) lineage (sometimes termed as '*East- and Southeast Asian lineage*' (ESEA)), which is ancestral to modern East and Southeast Asians, Polynesians, and Siberians, originated in [Mainland Southeast Asia](/wiki/Mainland_Southeast_Asia) at ~50,000 BCE, and expanded through multiple migration waves southwards and northwards respectively. Basal-East Asian ancestry, as well as later [Austroasiatic](/wiki/Austroasiatic_languages)-associated ancestry, spread into [Maritime Southeast Asia](/wiki/Maritime_Southeast_Asia) prior to the Austronesian expansion. Austronesian-speakers themselves are suggested to have arrived on [Taiwan](/wiki/Geography_of_Taiwan) and the northern Philippines between 10,000 and 7,000 BCE from coastal southern China, and spread from there throughout Insular Southeast Asia. The authors concluded that the Austronesian expansion into Insular Southeast Asia and [Polynesia](/wiki/Polynesia) was outgoing from the Philippines rather than Taiwan, and that modern Austronesian-speaking peoples, such as the Malays, have largely ancestry from the earliest Basal-East Asians, Austroasiatic migrants from Mainland Southeast Asia, and Austronesian-speaking seafarers from the Philippines, without much admixture from previous groups. ## History ### Indian influence There is no definite evidence which dates the first [Indian](/wiki/India) voyages across the [Bay of Bengal](/wiki/Bay_of_Bengal) but conservative estimates place the earliest arrivals on Malay shores at least 2,000 years ago. The discovery of jetty remains, iron smelting sites, and a clay brick monument dating back to 110 CE in the [Bujang Valley](/wiki/Bujang_Valley), shows that a maritime trading route with South Indian [Tamil kingdoms](/wiki/Tamil_Nadu) was already established since the second century. The growth of trade with India brought coastal people in much of maritime Southeast Asia into contact with the major religions of [Hinduism](/wiki/Hinduism) and [Buddhism](/wiki/Buddhism). Throughout this area a most profound in influence has been exerted by India which seems to have introduced into it architecture, sculpture, writing, monarchy, religion, iron, cotton and a host of elements of higher culture. Indian religions, cultural traditions and [Sanskrit](/wiki/Sanskrit) began to spread across the land. [Hindu temples](/wiki/Hindu_temple) were built in the Indian style, local kings began referring to themselves as \"[raja](/wiki/Raja)\" and more desirable aspects of Indian government were adopted. The beginning of the Common Era saw the rise of Malay states in the coastal areas of the [Sumatra](/wiki/Sumatra) and [Malay Peninsula](/wiki/Malay_Peninsula); [Srivijaya](/wiki/Srivijaya), [Nakhon Si Thammarat Kingdom](/wiki/Nakhon_Si_Thammarat_Kingdom), [Gangga Negara](/wiki/Gangga_Negara), [Langkasuka](/wiki/Langkasuka), [Kedah](/wiki/Bujang_Valley), [Pahang](/wiki/Old_Pahang_Kingdom), the [Melayu Kingdom](/wiki/Melayu_Kingdom) and [Chi Tu](/wiki/Chi_Tu). Between the 7th and 13th centuries, many of these small, often prosperous peninsula and Sumatran maritime trading states, became part of the [mandala](/wiki/Mandala_(Southeast_Asian_political_model)) of Srivijaya, a great confederation of city-states centred in [Sumatra](/wiki/Sumatra).[*page needed*] Early during this period, the earliest known mention of the word \"Malayu\" was used in Chinese sources in 644 CE. Later in the mid-14th century, the word Malay was already recognised as a collective people sharing similar lineage, culture and lingua. Srivijaya's influence spread over all the coastal areas of Sumatra and the Malay Peninsula, western [Java](/wiki/Java) and western [Borneo](/wiki/Borneo), as well as the rest of the [Malay Archipelago](/wiki/Malay_Archipelago). Enjoying both Indian and Chinese patronage, its wealth was gained mostly through trade. At its height, the [Old Malay language](/wiki/Old_Malay_language) was used as its official language and became the [lingua franca](/wiki/Lingua_franca) of the region, replacing Sanskrit, the language of Hinduism. The Srivijayan era is considered the golden age of Malay culture. The glory of Srivijaya however began to drastically wane after the series of raids by the Tamil [Chola dynasty](/wiki/Chola_dynasty) in the 11th century. After the fall of Srivijaya in 1025 CE, the Melayu kingdom of Jambi in Sumatra, became the most dominant Malay state of the region. By the end of the 13th century, the remnants of the Malay empire in Sumatra was finally destroyed by the [Javanese invaders](/wiki/Javanese_people) during the [Pamalayu expedition](/wiki/Pamalayu_expedition) (*Pamalayu* means \"war against the Malays\"). In 1299, through the support of the loyal servants of the empire, the [Orang laut](/wiki/Orang_laut), a Malay prince of Palembang origin, [Sang Nila Utama](/wiki/Sang_Nila_Utama) established the [Kingdom of Singapura](/wiki/Kingdom_of_Singapura) in [Temasek](/wiki/Temasek). His dynasty ruled the island kingdom until the end of the 14th century, when the Malay polity once again faced the wrath of Javanese invaders. In 1400, his great-great-grandson, [Parameswara](/wiki/Parameswara_(king)), headed north and established the [Malacca Sultanate](/wiki/Malacca_Sultanate). The new kingdom succeeded Srivijaya and inherited much of the royal and cultural traditions, including a large part of the territories of its predecessor in Palembang. In the north of the peninsula, the power vacuum left by the collapse of Srivijaya was filled by the growth of the kingdom of [Tambralinga](/wiki/Tambralinga) in the 12th century. Between the 13th and early 14th centuries, the kingdom succeeded to incorporate most of the Malay Peninsula under its mandala. The campaign led by [Chandrabhanu Sridhamaraja](/wiki/Chandrabhanu_Sridhamaraja) (1230–1263) managed to capture [Jaffna kingdom](/wiki/Jaffna_kingdom) in [Sri Lanka](/wiki/Sri_Lanka) between 1247 and 1258. He was eventually defeated by the forces of the [Pandyan dynasty](/wiki/Pandyan_dynasty) from Tamil Nadu in 1263 and was killed by the brother of Emperor [Sadayavarman Sundara Pandyan I](/wiki/Sadayavarman_Sundara_Pandyan_I). The invasion marked an unrivaled feature in the [history of Southeast Asia](/wiki/History_of_Southeast_Asia), it was the only time there was an armed maritime expedition far beyond the boundaries of the region. The cultivation of Malay polity system also diffused beyond the proper Sumatran-Peninsular border during this era. The age avowed by exploration and migration of the Malays to establish kingdoms beyond the traditional Srivijayan realm. Several exemplification are the enthronement of a Tambralingan prince to reign the [Lavo Kingdom](/wiki/Lavo_Kingdom) in present-day [Central Thailand](/wiki/Central_Thailand) and the establishment of the [Tanjungpura Kingdom](/wiki/Tanjungpura_Kingdom) in what is now [West Kalimantan](/wiki/West_Kalimantan), [Borneo](/wiki/Borneo). ### Islamisation The period of the 11th until 15th centuries saw the arrival of [Islam](/wiki/Islam) and the rise of the great port-city of Malacca on the southwestern coast of the Malay Peninsula — two major developments that altered the course of Malay history. The Islamic faith arrived on the shores of what are now the states of [Kedah](/wiki/Kedah), [Perak](/wiki/Perak), [Kelantan](/wiki/Kelantan) and [Terengganu](/wiki/Terengganu), from the beginning of 12th century. The earliest archaeological evidence of Islam from the Malay Peninsula is the [Terengganu Inscription Stone](/wiki/Terengganu_Inscription_Stone) dating from the 14th century found in [Terengganu](/wiki/Terengganu) state, [Malaysia](/wiki/Malaysia). By the 15th century, the Malacca Sultanate, whose hegemony reached over much of the western [Malay Archipelago](/wiki/Malay_Archipelago), had become the centre of [Islamisation](/wiki/Islamisation) in the east. As a Malaccan state religion, Islam brought many great transformation into the Malaccan society and culture, and It became the primary instrument in the evolution of a classical Malay identity. The Malaccan era witnessed the close association of Islam with Malay society and how it developed into a definitive marker of Malay identity. Over time, this common Malay cultural idiom came to characterise much of the Malay Archipelago through the [Malayisation](/wiki/Malayisation) process. The expansion of Malaccan influence through trade and [Dawah](/wiki/Dawah) brought with it together the [Classical Malay](/wiki/Classical_Malay) language, the Islamic faith, and the Malay Muslim culture; the three core values of *Kemelayuan* (\"Malayness\"). In 1511, the Malaccan capital fell into the hands of [Portuguese](/wiki/Portuguese_people) [conquistadors](/wiki/Conquistadors). However, Malacca remained an institutional prototype: a paradigm of statecraft and a point of cultural reference for successor states such as [Johor Sultanate](/wiki/Johor_Sultanate) (1528–present), [Perak Sultanate](/wiki/Perak) (1528–present), [Pahang Sultanate](/wiki/Pahang_Sultanate) (1470–present), [Siak Sri Indrapura Sultanate](/wiki/Siak_Sri_Indrapura_Sultanate) (1725–1946), Pelalawan Sultanate (1725–1946) and [Riau-Lingga Sultanate](/wiki/Riau-Lingga_Sultanate) (1824–1911). Across the [South China Sea](/wiki/South_China_Sea) in the 14th century, another Malay realm, the [Bruneian Empire](/wiki/Bruneian_Empire) was on the rise to become the most powerful polity in [Borneo](/wiki/Borneo). By the middle of the 15th century, Brunei entered into a close relationship with the Malacca Sultanate. The sultan married a Malaccan princess, adopted Islam as the court religion, and introduced an efficient administration modelled on Malacca. Brunei profited from trade with Malacca but gained even greater prosperity after the great Malay port was conquered by the Portuguese in 1511. It reached its golden age in the mid-16th century when it controlled land as far south as present day [Kuching](/wiki/Kuching) in [Sarawak](/wiki/Sarawak), north towards the [Philippine Archipelago](/wiki/Philippine_Archipelago). The empire broadened its influence in [Luzon](/wiki/Luzon) by defeating Datu Gambang of the [Kingdom of Tondo](/wiki/Kingdom_of_Tondo) and by founding a [satellite state](/wiki/Satellite_state), [Kota Seludong](/wiki/Kota_Seludong) in present-day [Manila](/wiki/Manila), setting up the Muslim Rajah, [Rajah Sulaiman I](/wiki/Rajah_Sulaiman_I) as a vassal to the Sultanate of Brunei. Brunei also expanded its influence in Mindanao, [Philippines](/wiki/Philippines) when Sultan Bolkiah married Leila Macanai, the daughter of the [Sultan of Sulu](/wiki/Sultanate_of_Sulu). However, states like the [kingdom of Pangasinan](/wiki/Caboloan), [Rajahnate of Cebu](/wiki/Rajahnate_of_Cebu) and [Kedatuan of Madja-as](/wiki/Kedatuan_of_Madja-as) tried to resist Brunei's and Islam's spread into the Philippines. Brunei's fairly loose river based governmental presence in Borneo projected the process of [Malayisation](/wiki/Malayisation). Other significant Malay sultanates were the [Kedah Sultanate](/wiki/Kedah_Sultanate) (1136–present), [Kelantan Sultanate](/wiki/Kelantan) (1411–present), [Patani Sultanate](/wiki/Pattani_Kingdom) (1516–1771), [Reman Kingdom](/wiki/Reman_Kingdom) (1785–1909) and Legeh Kingdom (1755–1902) that dominated the northern part of the Malay Peninsula. [Jambi Sultanate](/wiki/Jambi_Sultanate) (1460–1907), [Palembang Sultanate](/wiki/Palembang_Sultanate) (1550–1823) and Indragiri Sultanate (1298–1945) controlled much of the southeastern shores of Sumatra. [Deli Sultanate](/wiki/Deli_Sultanate) (1632–1946), [Serdang Sultanate](/wiki/Serdang_Sultanate) (1728–1948), [Langkat Sultanate](/wiki/Langkat_Sultanate) (1568–1948) and [Asahan Sultanate](/wiki/Asahan_Sultanate) (1630–1948) governed eastern Sumatra. While West Borneo observed the rise of [Pontianak Sultanate](/wiki/Pontianak_Sultanate) (1771–1950), Mempawah Sultanate (1740–1950) and Matan Sultanate (1590–1948), Sanggau Sultanate, Sintang Sultanate, and Sekadau Sultanate. ### Colonisation by foreign powers Between 1511 and 1984, numerous Malay kingdoms and sultanates fell under direct [colonisation](/wiki/Colonisation) or became the [protectorates](/wiki/Protectorate) of different foreign powers, from European colonial powers like [Portuguese](/wiki/Portugal), [Dutch](/wiki/Netherlands) and [British](/wiki/United_Kingdom), to regional powers like [Aceh](/wiki/Aceh_Sultanate), [Siam](/wiki/Siam) and [Japan](/wiki/Japan). In 1511, the [Portuguese Empire](/wiki/Portuguese_Empire) [captured](/wiki/Capture_of_Malacca_(1511)) the capital city of the [Malacca Sultanate](/wiki/Malacca_Sultanate). The victorious Portuguese however, were unable to extend their political influence beyond the [fort of Malacca](/wiki/A_Famosa). The Sultan maintained his overlordship on the lands outside Malacca and established the [Johor Sultanate](/wiki/Johor_Sultanate) in 1528 to succeed Malacca. [Portuguese Malacca](/wiki/Portuguese_Malacca) faced several unsuccessful retaliation attacks by Johor until 1614, when the combined forces of Johor and the [Dutch Empire](/wiki/Dutch_Empire), [ousted](/wiki/Battle_of_Malacca_(1641)) the Portuguese from the peninsula. As per agreement with Johor in 1606, the Dutch later took control of Malacca. Historically, [Malay states](/wiki/Malay_states) of the peninsula had hostile relations with the [Siamese](/wiki/Thai_people). The Malacca Sultanate Itself fought two wars with the Siamese while the northern Malay states came intermittently under Siamese dominance for centuries. In 1771, the [Kingdom of Siam](/wiki/Thonburi_Kingdom) under the new [Chakri dynasty](/wiki/Chakri_dynasty) abolished the [Patani Sultanate](/wiki/Pattani_Kingdom) and later annexed a large part of [Kedah Sultanate](/wiki/Kedah_Sultanate). Earlier, the Siamese under [Ayutthaya Kingdom](/wiki/Ayutthaya_Kingdom) have had already absorbed [Tambralinga](/wiki/Tambralinga) and overrun the [Singgora Sultanate](/wiki/Singgora_Sultanate) in the 17th century. Between 1808 and 1813, the Siamese imposed a new administrative structure and created the [semi-independent](/wiki/Satellite_state) Malay kingdoms of [Patani](/wiki/Pattani_Kingdom), [Saiburi](/wiki/Sai_Buri_District), [Nongchik](/wiki/Nong_Chik_District), [Yaring](/wiki/Yaring_District), [Yala](/wiki/Yala_Province), [Reman](/wiki/Reman) and [Rangae](/wiki/Rangae) from [Greater Patani](/wiki/Pattani_Province) and similarly obtained [Rundung](/wiki/Ranong_province), [Kupa](/wiki/Takua_Pa_District), [Tongkah](/wiki/Phuket_province), [Terang](/wiki/Trang_Province) while carving [Setul](/wiki/Setul_Kingdom), Langu, [Perlis](/wiki/Perlis), [Kubang Pasu](/wiki/Kubang_Pasu_Kingdom) from the [Kedah Kingdom](/wiki/Kedah_Kingdom) in 1839. In 1902, the Siamese stripped the political powers of all the 7 kingdoms of Patani following a planned revolt for independence against the central government. The [coup de grâce](/wiki/Coup_de_gr%C3%A2ce) was cultivated by 1906, when the Siamese [redraw](/wiki/National_boundary_delimitation) the border of the Patani territories and installed a new governance and administrative system. In 1786, the island of [Penang](/wiki/Penang) was leased to [East India Company](/wiki/East_India_Company) by [Kedah Sultanate](/wiki/Kedah_Sultanate) in exchange of military assistance against the Siamese. In 1819, the company also acquired [Singapore](/wiki/Singapore) from [Johor Empire](/wiki/Johor_Empire), later in 1824, [Dutch Malacca](/wiki/Dutch_Malacca) from the Dutch, followed by [Dindings](/wiki/Straits_Settlements#Dindings_and_Province_Wellesley) from [Perak](/wiki/Perak) by 1874 and finally [Labuan](/wiki/Labuan) from [Brunei](/wiki/Brunei) in 1886. All these trading posts officially known as [Straits Settlements](/wiki/Straits_Settlements) in 1826 and became the crown colony of [British Empire](/wiki/British_Empire) in 1867. Additionally, the Straits Settlements would also encompass the [Indian Ocean](/wiki/Indian_Ocean) islands of [Christmas Island](/wiki/Christmas_Island) and the [Cocos Islands](/wiki/Cocos_Islands) in 1886. British intervention in the affairs of Malay states was formalised in 1895, when [Malay rulers](/wiki/Malay_rulers) accepted [British Residents](/wiki/British_Resident) in administration, and the [Federated Malay States](/wiki/Federated_Malay_States) was formed. In 1909, [Kedah](/wiki/Kedah), [Kelantan](/wiki/Kelantan), [Terengganu](/wiki/Terengganu) and [Perlis](/wiki/Perlis) were [handed over](/wiki/Anglo-Siamese_Treaty_of_1909) by Siam to the British. These states along with [Johor](/wiki/Johor), later became known as [Unfederated Malay States](/wiki/Unfederated_Malay_States). During the [World War II](/wiki/World_War_II), all these [British possessions](/wiki/British_possessions) and [protectorates](/wiki/British_protectorate) that collectively known as [British Malaya](/wiki/British_Malaya) were occupied by the [Empire of Japan](/wiki/Empire_of_Japan). The twilight of the vast Bruneian Empire began during the [Castille War](/wiki/Castille_War) against the [Spanish](/wiki/Spanish_Empire) conquistadors who arrived in the Philippines from Mexico. The war resulted in the end of the empire's dominance in the present-day [Philippine Archipelago](/wiki/Philippine_Archipelago). The decline further culminated in the 19th century, when the Sultanate lost most of its remaining territories in [Borneo](/wiki/Borneo) to the [White Rajahs](/wiki/White_Rajah) of [Sarawak](/wiki/Sarawak), [North Borneo Chartered Company](/wiki/North_Borneo_Chartered_Company) and its [lower Borneo](/wiki/Kalimantan) vassals to [Dutch East India Company](/wiki/Dutch_East_India_Company). Brunei was a British protectorate from 1888 to 1984. Following the [Anglo-Dutch Treaty of 1824](/wiki/Anglo-Dutch_Treaty_of_1824) which divided the [Malay Archipelago](/wiki/Malay_Archipelago) into a British zone in the north and a Dutch zone in the south, all Malay sultanates in [Sumatra](/wiki/Sumatra) and [Southern Borneo](/wiki/Kalimantan) became part of the [Dutch East Indies](/wiki/Dutch_East_Indies). Though some of Malay sultans maintain their power under Dutch control, some were abolished by the Dutch government under the accusation of retaliation against the colonial rule, like the case of Palembang Sultanate in 1823, Jambi Sultanate in 1906 and [Riau Sultanate](/wiki/Riau_Sultanate) in 1911. In the late 19th century, Germany sought to establish a naval base in [Langkawi](/wiki/Langkawi), requesting its lease from Siam, influenced by Grand Admiral [Alfred von Tirpitz](/wiki/Alfred_von_Tirpitz)'s vision of using the island as a hub for a global submarine cable network. With its deep natural harbour, Langkawi was strategically positioned between German territories in China and the Pacific, facilitating warship restocking and enhancing commercial interests for German investors. In October 1899, Behn, Meyer & Co approached Kedah's Crown Prince to lease the island for 50 years, but the plan faltered due to Siam's refusal, as dictated by the Secret Siamese Treaty of 1897, which required British consent for territorial concessions. A subsequent attempt in 1900 to acquire Pulau Lontar was similarly dismissed, prompting British concerns over potential German expansion in the region and its implications for their economic and political dominance. The prospect of a German annexation of the northern peninsula and the potential of its involvement for a [commercial canal](/wiki/Thai_Canal) or railway network across the [Isthmus of Kra](/wiki/Isthmus_of_Kra), posed a serious threat to the British economic interest and political dominance in the region. Severely alarmed, the British and the Siamese entered the Anglo-Siamese Treaty of 1909, partitioning the peninsula between the British and the Siamese jurisdiction. The Anglo-Siamese Treaty attested that the Siamese to control the [upper portion](/wiki/Southern_Thailand) of the peninsular while the lower region was to be held under the [British dominance](/wiki/British_Empire). The British originally planned for the inclusion of [Reman](/wiki/Kingdom_of_Reman), Legeh and [Setul](/wiki/Kingdom_of_Setul) under their dominion together with a cluster of northern Malay states. Nonetheless, they only managed to secure [Kedah](/wiki/Kedah), [Kelantan](/wiki/Kelantan), [Terengganu](/wiki/Terengganu) and [Perlis](/wiki/Perlis) under the agreement. The treaty also witnessed the state of Kedah being reduced the most, with [Tarutao](/wiki/Tarutao_National_Park), [Butang islands](/wiki/Tarutao_National_Park) groups, [Sendawa](/wiki/Sadao_District), [Langgu](/wiki/La-ngu_District) and the principality of [Setul](/wiki/Setul_Kingdom) were all being divorced into the Siamese hands, a similar fate was also followed in northeastern coast of Kelantan that was demanded to renounced their right on the [Tabal district](/wiki/Tak_Bai_District), including [Sungai Golok](/wiki/Su-ngai_Kolok_District) and [Sungai Padi](/wiki/Su-ngai_Padi_District); while [Perlis](/wiki/Perlis) lost its Pujoh district. Then-British controlled [Federated Malay State](/wiki/Federated_Malay_States) of [Perak](/wiki/Perak) however, saw an enlargement of their land area, with [southern territories](/wiki/Hulu_Perak) of [Reman](/wiki/Reman) being transferred into the state and additionally Kelantan received [Jeli](/wiki/Jeli_District) from Legeh (which had been under Siamese jurisdiction since 1902). The Siamese then [abdicated](/wiki/Abdicated) Tunku Baharuddin, the [King of Setul](/wiki/Kingdom_of_Setul_Mambang_Segara), the sole Malay kingdom remained under Siamese territory in 1916. The treaty nonetheless, manage to seal the fate of the Malay states of [Kedah](/wiki/Kedah), [Kelantan](/wiki/Kelantan), [Terengganu](/wiki/Terengganu) and [Perlis](/wiki/Perlis) to retain a degree of their sovereign powers under the [British colonial government](/wiki/British_Malaya), a legacy that can be witnessed today in the Malaysian administrative system. Later during the [Japanese occupation of the Dutch East Indies](/wiki/Japanese_occupation_of_the_Dutch_East_Indies), [British Malaya](/wiki/Japanese_occupation_of_Malaya) and [Borneo](/wiki/Japanese_occupation_of_British_Borneo), the Japanese maintained a favourable relationship with the Sultans and other Malay leaders, this is partially composed to foster the trust of the Malay public that was generally loyal towards the sultan. Nonetheless, in a series of massacres known as [Pontianak incidents](/wiki/Pontianak_incidents), the Japanese assassinated virtually all of the [West Kalimantan](/wiki/West_Kalimantan) Malay sultans, including a large numbers of Malay intelligentsias after they have been falsely accused of planning an uprising and [coup d'etat](/wiki/Coup_d%27etat) against the Japanese. It was believed that West Kalimantan took two generations to recover from the near-total collapse of the Malay ruling class in the territory. ### Malay nationalism Despite the widespread distribution of the Malay population throughout the Malay Archipelago, modern Malay nationalism was only significantly mobilised in the early twentieth century [British Malaya](/wiki/British_Malaya) i. e. the [Malay Peninsula](/wiki/Malay_Peninsula). In the [Netherlands Indies](/wiki/Netherlands_Indies), the struggle against colonisation was characterised by the trans-ethnic nationalism: the so-called \"[Indonesian National Awakening](/wiki/Indonesian_National_Awakening)\" united people from the various parts of the Dutch colony in the development of a national consciousness as \"Indonesians\". In Brunei, despite some attempt made to arouse Malay political consciousness between 1942 and 1945, there was no significant history of ethnic-based nationalism. In Thailand however, [Pattani separatism](/wiki/Southern_Thailand_insurgency) against Thai rule is regarded by some historians as a part of the wider sphere of peninsular Malay nationalism. A similar [secession movement](/wiki/Secession_movement) can be witnessed in modern-day Indonesia, where both autochthonously-Malay provinces of [Riau](/wiki/Riau) and [Riau Islands](/wiki/Riau_Islands) sought to gain independence under the name of Republic of Riau. Nevertheless, what follows is specific to the peninsula Malay nationalism that resulted in the formation of the [Federation of Malaya](/wiki/Federation_of_Malaya), later reconstituted as Malaysia. The earliest and most influential instruments of Malay national awakening were the [periodicals](/wiki/Periodical) which politicised the position of the Malays in the face of colonialism and alien immigration of non-Malays. In spite of repressions imposed by the British colonial government, there were no less than 147 journals and newspapers published in [Malaya](/wiki/British_Malaya) between 1876 and 1941. Among notable periodicals were *Al-Imam* (1906), *Pengasuh* (1920), *Majlis* (1935) and *[Utusan Melayu](/wiki/Utusan_Melayu)* (1939). The rise of [Malay nationalism](/wiki/Malay_nationalism) was largely mobilised by three nationalist factions – the radicals distinguishable into the Malay left and the Islamic group which were both opposed to the conservative elites. The Malay [leftists](/wiki/Leftist) were represented by [Kesatuan Melayu Muda](/wiki/Kesatuan_Melayu_Muda), formed in 1938 by a group of Malay intelligentsia primarily educated in [Sultan Idris Training College](/wiki/Sultan_Idris_Training_College), with an ideal of *[Greater Indonesia](/wiki/Greater_Indonesia)*. In 1945, they reorganised themselves into a political party known as Partai Kebangsaan Melayu Malaya (PKMM). The [Islamists](/wiki/Islamist) were originally represented by *Kaum Muda* consisted of Middle east – educated scholars with [Pan-Islamic](/wiki/Pan-Islamism) sentiment. The first Islamic political party was *Partai Orang Muslimin Malaya* (Hizbul Muslimin) formed in March 1948, later succeeded by [Pan-Malayan Islamic Party](/wiki/Pan-Malaysian_Islamic_Party) in 1951. The third group was [the conservatives](/wiki/Conservatism) consisted of the westernised elites who were bureaucrats and members of royal families that shared a common English education mostly at the exclusive [Malay College Kuala Kangsar](/wiki/Malay_College_Kuala_Kangsar). They formed voluntary organisations known as *Persatuan Melayu* ('Malay Associations') in various parts of the country with the primary goals of advancing and protecting the interests of Malays. In March 1946, 41 of these Malay associations formed [United Malays National Organisation](/wiki/United_Malays_National_Organisation) (UMNO), to assert [Malay dominance](/wiki/Malay_dominance) over Malaya. The Malay and [Malayness](/wiki/Malayness) has been the fundamental basis for Malay ideology and Malay nationalism in Malaysia. All three Malay nationalist factions believed in the idea of a *Bangsa Melayu* ('Malay Nation') and the position of Malay language, but disagreed over the role of Islam and Malay rulers. The conservatives supported [Malay language](/wiki/Malay_language), [Islam](/wiki/Malay_Islamic_identity) and [Malay monarchy](/wiki/Malay_rulers) as constituting the key pillars of Malayness, but within a secular state that restricted the political role of Islam. The leftists concurred with the [secular state](/wiki/Secular_state) but wanted to end [feudalism](/wiki/Feudalism), whereas the Islamic group favoured ending royalty but sought a much larger role of [Islam](/wiki/Islam). Since the foundation of the [Republic of Indonesia](/wiki/Republic_of_Indonesia) as a [unitary state](/wiki/Unitary_state) in 1950, all traditional Malay monarchies in Indonesia were abolished, and the Sultans positions reduced to [titular heads](/wiki/Titular_head) or [pretenders](/wiki/Pretender). The violent demise of the sultanates of [Deli](/wiki/Sultanate_of_Deli), [Langkat](/wiki/Sultanate_of_Langkat), [Serdang](/wiki/Sultanate_of_Serdang), [Asahan](/wiki/Asahan_Sultanate) and other Malay principalities in [East Sumatra](/wiki/East_Sumatra) during the \"[Social revolution](/wiki/East_Sumatra_revolution)\" of 1946 orchestrated by the [Communist Party of Indonesia](/wiki/Communist_Party_of_Indonesia), drastically influenced their Malayan counterparts and politically motivating them against the PKMM's ideal of [Greater Indonesia](/wiki/Greater_Indonesia) and the Islamists' vision of [Islamic Republic](/wiki/Islamic_Republic). In March 1946, UMNO emerged with the full support of the Malay sultans from the [Conference of Rulers](/wiki/Conference_of_Rulers). The new movement forged a close political link between rulers and subjects never before achieved. It generated an excited Malay public opinion which, together with the surprising political apathy of the non-Malays, led to Britain's abandonment of the radical [Malayan Union](/wiki/Malayan_Union) plan. By July, UMNO succeeded in obtaining an agreement with the British to begin negotiations for a new constitution. Negotiations continued from August to November, between British officials on the one hand, and the Sultans' representatives and UMNO and the other. Two years later the semi independent [Federation of Malaya](/wiki/Federation_of_Malaya) was born. The new constitutional arrangement largely reverted to the basic pattern of pre-war colonial rule and built on the supremacy of the individual Malay states. Malay rights and privileges were safeguarded. The traditional [Malay rulers](/wiki/Malay_rulers) thus retained their prerogatives, while their English-educated descendants came to occupy positions of authority at the centre, which was being progressively decolonised. In August 1957, the [Federation of Malaya](/wiki/Federation_of_Malaya), the West's last major dependency in Southeast Asia, attained independence in a [peaceful transfer of power](/wiki/Peaceful_transition_of_power). The federation was reconstituted as [Malaysia](/wiki/Malaysia) with the addition in 1963 of [Singapore](/wiki/Singapore) (separated in 1965), [Sabah](/wiki/Sabah) and [Sarawak](/wiki/Sarawak). ## Culture ### Language The Malay language is one of the most prominent languages of the world, especially of the [Austronesian](/wiki/Austronesian_peoples) family. Variants and dialects of Malay are used as an official language in [Brunei](/wiki/Brunei), [Malaysia](/wiki/Malaysia), [Indonesia](/wiki/Indonesia) and [Singapore](/wiki/Singapore). The language is also spoken in southern [Thailand](/wiki/Thailand), [Cocos Islands](/wiki/Cocos_(Keeling)_Islands), [Christmas Island](/wiki/Christmas_Island), [Sri Lanka](/wiki/Sri_Lanka). It is spoken natively by approximately 33 million people throughout the [Malay Archipelago](/wiki/Malay_Archipelago) and is used as a second language by an estimated 220 million. The oldest form of Malay is descended from the [Proto-Malayo-Polynesian language](/wiki/Proto-Malayo-Polynesian_language) spoken by the earliest [Austronesian](/wiki/Austronesian_people) settlers in Southeast Asia. This form would later evolve into [Old Malay](/wiki/Old_Malay) when Indian cultures and religions began penetrating the region. Old Malay contained some terms last until today, but remained unintelligible to modern speakers, while the modern language is already largely recognisable in written [Classical Malay](/wiki/Classical_Malay), which the oldest form dating back to 1303 CE. Malay evolved into Classical Malay through the gradual influx of numerous Arabic and Persian vocabulary when Islam made its way to the region, changing significantly in the process. Initially, Classical Malay was a diverse group of dialects, reflecting the varied origins of the Malay kingdoms of Southeast Asia. One of these dialects, that was developed in the literary tradition of the Malacca Sultanate in the 15th century, eventually became predominant. The Malaccan era was marked with the transformation of the Malay language into an Islamic language, in similar fashion to Arabic, Persian, Urdu and Swahili. An adapted Arabic script called [Jawi](/wiki/Jawi_script) was used replacing the Kawi script, Islamic religious and cultural terminologies were abundantly assimilated, discarding many Hindu-Buddhist words, and Malay became the language of Islamic medium of instruction and dissemination throughout Southeast Asian region. At the height of Malacca's power in the 15th century, the Classical Malay spread beyond the traditional Malay speaking world and resulted in a *[lingua franca](/wiki/Lingua_franca)* that was called *Bahasa Melayu pasar* (\"Bazaar Malay\") or *Bahasa Melayu rendah* (\"Low Malay\") as opposed to the *Bahasa Melayu tinggi* (\"High Malay\") of Malacca. It is generally believed that [Bazaar Malay](/wiki/Malay_trade_and_creole_languages) was a pidgin and the most important development, however, has been that pidgin creolised, creating several new languages such as the [Ambonese Malay](/wiki/Ambonese_Malay#Ambonese_Malay), [Manado Malay](/wiki/Manado_Malay) and [Betawi language](/wiki/Betawi_language). European writers of the 17th and 18th centuries, such as [Tavernier](/wiki/Jean-Baptiste_Tavernier), [Thomassin](/wiki/Louis_Thomassin) and Werndly describe Malay as \"*language of the learned in all the Indies, like [Latin](/wiki/Latin_language) in Europe*\". It is also the most widely used during British and Dutch colonial era in the Malay Archipelago. The reversed was seen in the [Spanish East Indies](/wiki/Spanish_East_Indies), where mass [latinisation](/wiki/Romanization_(cultural)) of the archipelago during the colonial years resulted the historical [coup de grâce](/wiki/Coup_de_gr%C3%A2ce) of the Malay language in the Philippines. The dialect of [Johor Sultanate](/wiki/Johor_Sultanate), the direct successor of Malacca, became the standard speech among Malays in [Singapore](/wiki/Singapore) and [Malaysia](/wiki/Malaysia), and it formed the original basis for the standardised [Indonesian language](/wiki/Indonesian_language). Apart from the standard Malay, developed within the Malacca-Johor sphere, various local [Malay dialects](/wiki/Malayan_languages) exist. For example, the [Bangkanese](/wiki/Bangka_language), the [Bruneian](/wiki/Brunei_Malay), the [Jambian](/wiki/Jambi_Malay), the [Kelantanese](/wiki/Kelantanese), the [Kedahan](/wiki/Kedah_Malay), the [Negeri Sembilanese](/wiki/Negeri_Sembilan_Malay_language), the [Palembangnese](/wiki/Musi_language), the [Pattanese](/wiki/Pattani_Malay), the [Sarawakian](/wiki/Sarawak_Malay), the [Terengganuan](/wiki/Terengganu_Malay), and many others. The Malay language was historically written in [Pallawa](/wiki/Pallava_script), [Kawi](/wiki/Kawi_script) and [Rencong](/wiki/Rencong_script). After the arrival of Islam, [Arabic](/wiki/Arabic_script)-based [Jawi script](/wiki/Jawi_script) was adopted and is still in use today as one of the two official scripts in Brunei and as an alternative script in [Malaysia](/wiki/Malaysia). Beginning from the 17th century, as a result of British and Dutch colonisation, Jawi was gradually replaced by the Latin-based [Rumi script](/wiki/Rumi_script) which eventually became the official modern script for Malay language in Malaysia, Singapore, and Indonesia, and co-official script in Brunei. ### Literature The rich oral literature and classical literature of the Malays contain a great number of portraits of the people, from the [servant](/wiki/Servant) to the minister, from the judge to the [Rajas](/wiki/Raja), from the ancient to the very contemporary periods, which together form the amorphous identity of the Malays. Considering the softness and mellifluence of the Malay language, which lends itself easily to the requirements of rhyme and rhythm, the originality and beauty in Malay literature can be assessed in its poetical elements. Among the forms of poetry in Malay literature are – the [Pantun](/wiki/Pantun), [Syair](/wiki/Syair) and [Gurindam](/wiki/Gurindam). The earliest form of Malay literature was the [oral literature](/wiki/Oral_literature) and its central subjects are traditional [folklore](/wiki/Folklore) relating to [nature](/wiki/Nature), animals and people. The classical Malay folklore is composed of traditional songs and music, heroic poems, animal fables, ghost stories, past events, fairy tales, symbolic lore, myths and bardic tales. Each of the stories possessed its own energy in terms of character, spirit, backdrop and storytelling and was largely crafted with the intend of happiness, guidance, educating, reminiscing, explaining, among few. The folklore were memorised and passed from one generation of storytellers to the next. Many of these tales were also written down by *penglipur lara* (storytellers) for example: *[Hikayat Malim Dewa](/wiki/Hikayat_Malim_Dewa)*, *Hikayat Malim Deman*, *Hikayat Raja Donan*, *Hikayat Anggun Cik Tunggal*, and *[Hikayat Awang Sulung Merah Muda](/wiki/Hikayat_Awang_Sulung_Merah_Muda)*. When Indian influences made their way to the Malay Archipelago around 2000 years ago, Malay literature began incorporating Indian elements. Literature of this time is mostly translations of [Sanskrit literature](/wiki/Sanskrit_literature) and romances, or at least some productions inspired by such, and is full of allusions to [Hindu mythology](/wiki/Hindu_mythology). Probably to this early time may be traced such works as *[Hikayat Seri Rama](/wiki/Hikayat_Seri_Rama)* (a free translation of the *[Ramayana](/wiki/Ramayana)*), *[Hikayat Bayan Budiman](/wiki/Hikayat_Bayan_Budiman)* (an adaptation of [Śukasaptati](/wiki/%C5%9Aukasaptati)) and *[Hikayat Panca Tanderan](/wiki/Hikayat_Panca_Tanderan)* (an adaptation of *[Hitopadesha](/wiki/Hitopadesha)*). The era of classical Malay literature started after the arrival of Islam and the invention of [Jawi script](/wiki/Jawi_script) (Arabic based Malay script). Since then, Islamic beliefs and concepts began to make its mark on Malay literature. The [Terengganu Inscription Stone](/wiki/Terengganu_Inscription_Stone), which is dated to 1303, is the earliest known narrative Malay writing. The stone is inscribed with an account of history, law, and [romance](/wiki/Romance_(love)) in Jawi script. At its height, the Malacca Sultanate was not only the center of Islamisation, but also the center of Malay cultural expressions including literature. During this era, notable [Middle Eastern literary works](/wiki/Islamic_literature) were translated and religious books were written in Malay language. Among famous translated works are *[Hikayat Muhammad Hanafiah](/wiki/Hikayat_Muhammad_Hanafiah)* and *[Hikayat Amir Hamzah](/wiki/Hikayat_Amir_Hamzah)*. The rise of Malay literature during the period was also penned by other homegrown literary composition coloured by mystical [Sufism](/wiki/Sufi) of the middle-east, the notable works of [Hamzah Fansuri](/wiki/Hamzah_Fansuri) such as *Asrar al-Arifin* (*Rahsia Orang yang Bijaksana;* The Secret of the Wise), *Sharab al-Asyikin* (*Minuman Segala Orang yang Berahi;* The Drink of All the Passionate) and *Zinat al-Muwahidin* (*Perhiasan Sekalian Orang yang Mengesakan;* The Ornament of All the Devoted) can be seen as the [magna opera](/wiki/Masterpiece) of the era. The most important piece of Malay literary works is perhaps the famed [Malay Annals](/wiki/Malay_Annals) or Sulalatus Salatin. It was called \"the most famous, distinctive and best of all Malay literary works\" by one of the most prominent scholars in Malay studies, [Sir Richard O. Winstedt](/wiki/Richard_Olaf_Winstedt). The exact date of its composition and the identity of its original author are uncertain, but under the order of [Sultan Alauddin Riaayat Shah III](/wiki/Alauddin_Riayat_Shah_III) of Johor in 1612, [Tun Sri Lanang](/wiki/Tun_Sri_Lanang) oversaw the editorial and compilation process of the Malay Annals. In the 19th century, the Malay literature received some notable additions, including *Kitab Ilmu Bedil* (Book of Traditional Weaponry) that provides valuable details of traditional Malay ammunition and weaponry. The era also witnessed the wider usage of Malay [medical journals](/wiki/General_medical_journal), known as *Kitab Tib*. These works are indeed important as it serve as references to the Malay knowledge and technology during the classical era. Other 19th century Malay texts were written in Sumatra, these include the *Kitab Pengetahuan Bahasa* (Book of Linguistic Knowledge) by Raja Ali Haji and *Perhimpunan Gunawan bagi Laki-Laki dan Perempuan* (A Compendium of Charms for Men and Women) by Khatijah Terung, a wife of Raja Haji Abdullah bin Raja Hassan. The same century also witnessed a monumental shift in the Malay literature through writings of [Abdullah bin Abdul Kadir](/wiki/Abdullah_bin_Abdul_Kadir), a famous [Malacca](/wiki/Malacca)-born [munshi](/wiki/Munshi) of [Singapore](/wiki/Singapore). Abdullah is regarded as the most cultured Malay who ever wrote, one of the greatest innovators in Malay letters and the father of modern Malay literature. His most important works are the *[Hikayat Abdullah](/wiki/Hikayat_Abdullah)* (an autobiography), *[Kisah Pelayaran Abdullah ke Kelantan](/wiki/Kisah_Pelayaran_Abdullah_ke_Kelantan)* (an account of his trip for the government to [Kelantan](/wiki/Kelantan)), and *[Kisah Pelayaran Abdullah ke Mekah](/wiki/Kisah_Pelayaran_Abdullah_ke_Mekah)* (a narrative of his [pilgrimage](/wiki/Hajj) to [Mecca](/wiki/Mecca) 1854). His work was an inspiration to future generations of writers and marks an early stage in the transition from classical Malay literature to modern Malay literature. ### Religion The early Malay communities were largely [animists](/wiki/Animist), believing in the existence of *semangat* (spirits) in everything. Around the opening of the [common era](/wiki/Common_era), [Hinduism](/wiki/Hinduism) and [Buddhism](/wiki/Buddhism) were introduced by South Asian traders to the Malay Archipelago, where they flourished until the 13th century, just before the arrival of Islam brought by Arab, South Asian and Chinese Muslim traders. In the 15th century, Islam of the orthodox [Sunni](/wiki/Sunni) sect flourished in the Malay world under the Malacca Sultanate. In contrast with Hinduism, which superficially transformed early Malay society, Islam can be said to have been fully integrated into the daily life of the population. Since this era, the Malays are considered as [ethnoreligious group](/wiki/Ethnoreligious_group) and traditionally had a close identification with Islam and they have not changed their religion since. This identity is so strong that it is said to become Muslim was to *[masuk Melayu](/wiki/Malayisation)* (to enter Malayness). Nevertheless, the earlier beliefs having deeper roots, they have maintained themselves against the anathemas of Islam – and indeed [Sufism](/wiki/Sufism) [mysticism](/wiki/Mysticism) have become intertwined among the Malays, with the spirits of the earlier animistic world and some elements of Hinduism. Following the 1970s, [Islamic revival](/wiki/Islamic_revival) (also referred as re-[Islamisation](/wiki/Islamisation)) throughout the [Muslim world](/wiki/Muslim_world), many traditions that are regarded as contravene the teachings of Islam and contain elements of [shirk](/wiki/Shirk_(Islam)) were abandoned by the Malays in Malaysia, whereas in among Malays in Indonesia, these traditions are not considered as superstitious and containing elements of [shirk](/wiki/Shirk_(Islam)). Among these traditions was the *[mandi](/wiki/Mandi_(bath)) safar* festival ([Safar](/wiki/Safar) bath), a bathing festival to achieve spiritual purity, which can be discerned features similar to some of those of the [Durga Puja](/wiki/Durga_Puja) of India. A vast majority of modern ethnic Malays are the adherents of [Sunni](/wiki/Sunni) Islam and the most important Malay festivals are those of [Islamic origin](/wiki/Muslim_holidays) — *[Hari Raya Aidilfitri](/wiki/Eid_ul-Fitr)*, *[Hari Raya Aidiladha](/wiki/Eid_al-Adha)*, *[Awal Muharram](/wiki/Islamic_New_Year)*, and *[Maulidur Rasul](/wiki/Mawlid)*. It is considered [apostasy](/wiki/Apostasy) for Malays to convert out of Islam in Malaysia and Brunei. However, there are a number of ethnic Malays living outside of these countries have also embraced other religions legally under the law. ### Architecture\n",
  "language": "en",
  "processed_at": "2026-01-12T11:28:53.392456",
  "title": "Malays (ethnic group)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Malays_(ethnic_group)"
}