{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:28:29.069087"
  },
  "content": "Austronesian language **Malay** ([UK](/wiki/British_English): /məˈleɪ/ *mə-LAY*; [endonym](/wiki/Endonym): *Bahasa Melayu*, [Jawi script](/wiki/Jawi_script): بهاس ملايو) is an [Austronesian language](/wiki/Austronesian_languages) spoken primarily in several islands of Maritime Southeast Asia and [Malay Peninsula](/wiki/Malay_Peninsula) on mainland Asia. The language is an [official language](/wiki/Official_language) of [Brunei](/wiki/Brunei), [Malaysia](/wiki/Malaysia), [Singapore](/wiki/Singapore) and [Indonesia](/wiki/Indonesia). [Indonesian](/wiki/Indonesian_language), a standardized variety of Malay, is the official language of [Indonesia](/wiki/Indonesia) and one of the working languages of [Timor-Leste](/wiki/Timor-Leste). Malay is also spoken as a regional language of [ethnic Malays](/wiki/Malays_(ethnic_group)) in [Indonesia](/wiki/Malay_Indonesians), southeast [Philippines](/wiki/Philippines) and the [southern part](/wiki/Thai_Malays) of [Thailand](/wiki/Thailand). Altogether, it is spoken by 60 million people across [Maritime Southeast Asia](/wiki/Maritime_Southeast_Asia). The language is [pluricentric](/wiki/Pluricentric) and a [macrolanguage](/wiki/ISO_639_macrolanguage), i.e., a group of [mutually intelligible](/wiki/Mutual_intelligibility) speech varieties, or [dialect continuum](/wiki/Dialect_continuum), that have no traditional name in common, and which may be considered distinct languages by their speakers. Several varieties of it are standardized as the national language (*bahasa kebangsaan* or *bahasa nasional*) of several nation states with various official names: in Malaysia, it is designated as either *Bahasa Melayu* (\"Malay language\") or in some instances, *Bahasa Malaysia* (\"Malaysian language\"); in Singapore and Brunei, it is called *Bahasa Melayu* (\"Malay language\") where it in the latter country refers to a formal standard variety set apart from its own [vernacular dialect](/wiki/Brunei_Malay);[a] in Indonesia, an autonomous normative variety called *Bahasa Indonesia* (\"[Indonesian language](/wiki/Indonesian_language)\") is designated the *bahasa persatuan/pemersatu* (\"unifying language\" or [lingua franca](/wiki/Lingua_franca)) whereas the term \"Malay\" (*bahasa Melayu*) refers to vernacular varieties of Malay [indigenous](/wiki/Malay_Indonesians) to areas of Central to Southern [Sumatra](/wiki/Sumatra) and [West Kalimantan](/wiki/West_Kalimantan) as the ethnic languages of [Malay](/wiki/Malay_Indonesians) in Indonesia.[b] [Classical Malay](/wiki/Classical_Malay), also called Court Malay, was the literary standard of the pre-colonial [Malacca](/wiki/Malacca_Sultanate) and [Johor](/wiki/Johor_Sultanate) Sultanates and so the language is sometimes called Malacca, Johor or Riau Malay (or various combinations of those names) to distinguish it from the various other [Malayic languages](/wiki/Malayic_languages). According to *[Ethnologue](/wiki/Ethnologue)* 16, several of the Malayic varieties they currently list as separate languages, including the *[Orang Asli](/wiki/Orang_Asli)* varieties of the [Malay Peninsula](/wiki/Malay_Peninsula), are so closely related to [standard Malay](/wiki/Standard_Malay) that they may prove to be dialects. There are also several [Malay trade and creole languages](/wiki/Malay_trade_and_creole_languages) (e.g. [Ambonese Malay](/wiki/Ambonese_Malay)) based on a lingua franca derived from Classical Malay as well as [Makassar Malay](/wiki/Makassar_Malay), which appears to be a [mixed language](/wiki/Mixed_language). ## Origin Malay historical linguists agree on the likelihood of the Malayic homeland being in western [Borneo](/wiki/Borneo). A form known as Proto-Malayic was spoken in Borneo at least by 1000 BCE, it has been argued to be the ancestral language of all subsequent [Malayic languages](/wiki/Malayic_languages). Its ancestor, [Proto-Malayo-Polynesian](/wiki/Proto-Malayo-Polynesian), a descendant of the [Proto-Austronesian language](/wiki/Proto-Austronesian_language), began to break up by at least 2000 BCE, possibly as a result of the southward expansion of [Austronesian peoples](/wiki/Austronesian_peoples) into [Maritime Southeast Asia](/wiki/Maritime_Southeast_Asia) from the island of [Taiwan](/wiki/Taiwan). ## History The history of the Malay language can be divided into five periods: Old Malay, the Transitional Period, Classical Malay, Late Modern Malay and Modern Malay. Old Malay is believed to be the actual ancestor of Classical Malay. Old Malay was influenced by [Sanskrit](/wiki/Sanskrit), the ancient [Indo-Aryan language](/wiki/Indo-Aryan_languages) of [India](/wiki/India). Sanskrit loan words can be found in Old Malay vocabulary. The earliest known stone inscription in the Old Malay language was found on the island of [Sumatra](/wiki/Sumatra). Written in the [Pallava variety](/wiki/Pallava_alphabet) of the [Grantha alphabet](/wiki/Grantha_alphabet), it is dated 1 May 683. Known as the [Kedukan Bukit inscription](/wiki/Kedukan_Bukit_inscription), it was discovered by the [Dutchman](/wiki/Dutch_people) C. J. Batenburg on 29 November 1920 at Kedukan Bukit, on the banks of the Tatang River, a tributary of the [Musi River](/wiki/Musi_River_(Indonesia)), near [Palembang](/wiki/Palembang), in what is now [South Sumatra](/wiki/South_Sumatra), [Indonesia](/wiki/Indonesia). The stone measures approximately 45 by 80 centimetres (18 by 31 in). For centuries, [Srivijaya](/wiki/Srivijaya), a maritime empire based on the island from the 7th to the 11th centuries, was responsible for the spread of Old Malay throughout the [Malay Peninsula](/wiki/Malay_Peninsula) and the [Malay Archipelago](/wiki/Malay_Archipelago) through its expansion and economic power. Old Malay served as the [lingua franca](/wiki/Lingua_franca) of traders and was widely used in various ports and marketplaces across the region. The Tanjung Tanah Law was a 14th-century pre-Islamic legal text that was produced during the reign of [Adityawarman](/wiki/Adityawarman) (1345–1377) of the [Melayu Kingdom](/wiki/Melayu_Kingdom) (also known as Malayu or Dharmasraya Kingdom), a Hindu-Buddhist kingdom that arose after the end of [Srivijayan](/wiki/Srivijaya) rule in [Sumatra](/wiki/Sumatra). The laws were for the [Minangkabau people](/wiki/Minangkabau_people), who today still live in the highlands of Sumatra, [Indonesia](/wiki/Indonesia). The [Terengganu Inscription Stone](/wiki/Terengganu_Inscription_Stone) (Malay: *Batu Bersurat Terengganu*; Jawi: باتو برسورت ترڠݢانو) is a granite stele bearing an inscription in [Jawi script](/wiki/Jawi_script), discovered in [Terengganu](/wiki/Terengganu), on the east coast of the [Malay Peninsula](/wiki/Malay_Peninsula) (in what is now [Malaysia](/wiki/Malaysia)). It is considered the earliest evidence of Classical Malay. Dated approximately to 702 [AH](/wiki/Anno_Hegirae) (1303 [CE](/wiki/Common_Era)), it represents the oldest known evidence of Jawi writing in the [Malay world](/wiki/Malay_world) and stands as one of the earliest testimonies to the advent of [Islam](/wiki/Islam) as a [state religion](/wiki/State_religion) in the region. The inscription contains a proclamation issued by a ruler of Terengganu, referred to as *Seri Paduka Tuan*, urging his subjects to uphold and propagate Islam, while outlining 10 basic [Sharia laws](/wiki/Sharia) as guidance. Classical Malay came into widespread use as the [lingua franca](/wiki/Lingua_franca) of the region during the [Malacca Sultanate](/wiki/Malacca_Sultanate) era (1402–1511), a powerful maritime kingdom strategically located along the [Strait of Malacca](/wiki/Strait_of_Malacca) that became a hub of international trade and Islamic learning in the region. During this period, the Malay language developed rapidly under the influence of [Islamic literature](/wiki/Islamic_literature), which brought about significant linguistic changes, including a massive infusion of [Arabic](/wiki/Arabic) vocabulary, as well as continued influence from [Sanskrit](/wiki/Sanskrit) and [Tamil](/wiki/Tamil_language). This enriched form of the language came to be known as Classical Malay. It was during this time the language evolved into a form recognisable to speakers of modern Malay.[*citation needed*] After the [Capture of Malacca](/wiki/Capture_of_Malacca_(1511)) by the [Portuguese](/wiki/Portuguese_Empire) in 1511, marking the fall of the [Malacca Sultanate](/wiki/Malacca_Sultanate), the [royal court](/wiki/Royal_court) re-established itself as the [Johor Sultanate](/wiki/Johor_Sultanate). The court continued to use Classical Malay as its literary and administrative language. Over time, this literary tradition became strongly associated with the territories under the sultanate, including the present-day [Malaysian](/wiki/Malaysia) state of [Johor](/wiki/Johor) and the [Indonesian](/wiki/Indonesia) province of [Riau Islands](/wiki/Riau_Islands). As a result, many assumed that the spoken Malay of Johor and Riau was closely related to Classical Malay. However, while the [literary language](/wiki/Literary_language) used in the region reflects the classical tradition, the local spoken dialects differ. The fall of Malacca led to the dispersal of Malay literary centres, as many literati and scholars sought refuge in areas outside the immediate control of European colonial powers. As a result, new Malay literary works began to emerge from [Aceh](/wiki/Aceh_Sultanate), [Java](/wiki/Java), [Makassar](/wiki/Sultanate_of_Gowa), the [Moluccas](/wiki/Maluku_Islands), [Champa](/wiki/Champa), and other regions. Among the oldest surviving letters written in Malay are the letters from Sultan Abu Hayat of [Ternate](/wiki/Sultanate_of_Ternate), in the [Maluku Islands](/wiki/Maluku_Islands) of present-day [Indonesia](/wiki/Indonesia), dated around 1521–1522. The text is addressed to the king of [Portugal](/wiki/Portuguese_Empire), following contact with Portuguese explorer [Francisco Serrão](/wiki/Francisco_Serr%C3%A3o). The letters show a sign of non-native usage, as the Ternateans used (and still use) the unrelated [Ternate language](/wiki/Ternate_language), a [West Papuan language](/wiki/West_Papuan_languages), as their [first language](/wiki/First_language). Malay was used solely as a [lingua franca](/wiki/Lingua_franca) for inter-ethnic communications. The 19th century marked a period of strong [Western](/wiki/Western_world) political and commercial domination in the [Malay Peninsula](/wiki/Malay_Peninsula) and the [Malay Archipelago](/wiki/Malay_Archipelago). The colonial demarcation brought by the [1824 Anglo-Dutch Treaty](/wiki/Anglo-Dutch_Treaty_of_1824) led to [Dutch East India Company](/wiki/Dutch_East_India_Company) effectively colonising the [East Indies](/wiki/Dutch_East_Indies) in the south, while the [British Empire](/wiki/British_Empire) held several colonies and protectorates in the [Malay peninsula](/wiki/British_Malaya) and [Borneo](/wiki/British_Borneo) in the north. Both colonial powers used the Malay language as a tool of centralisation and modernisation. They made use of each other's scholarly publications in developing the standardised versions of the Malay language. The flourishing of pre-modern Malay literature in the 19th century led to the rise of intellectual movements among the locals and the emergence of new communities of Malay [linguists](/wiki/Linguistics). ## Classification Malay is a member of the [Austronesian](/wiki/Austronesian_languages) family of languages, which includes languages from [Southeast Asia](/wiki/Southeast_Asia) and the [Pacific Ocean](/wiki/Pacific_Ocean), with a smaller number in continental [Asia](/wiki/Asia). [Malagasy](/wiki/Malagasy_language), a geographic outlier spoken in [Madagascar](/wiki/Madagascar) in the [Indian Ocean](/wiki/Indian_Ocean), is also a member of this language family. Although these languages are not necessarily mutually intelligible to any extent, their similarities are often quite apparent. In more conservative languages like Malay, many roots have come with relatively little change from their common ancestor, [Proto-Austronesian language](/wiki/Proto-Austronesian_language). There are many [cognates](/wiki/Cognate) found in the languages' words for kinship, health, body parts and common animals. Numbers, especially, show remarkable similarities. Within Austronesian, Malay is part of a cluster of numerous closely related [forms of speech](/wiki/Variety_(linguistics)) known as the [Malayic languages](/wiki/Malayic_languages), which were spread across Malaya and the Indonesian archipelago by Malay traders from Sumatra. There is disagreement as to which varieties of speech popularly called \"Malay\" should be considered dialects of this language, and which should be classified as distinct Malay languages. The [vernacular](/wiki/Vernacular) of Brunei—[Brunei Malay](/wiki/Brunei_Malay)—for example, is not readily intelligible with the [standard language](/wiki/Standard_language), and the same is true with some lects on the Malay Peninsula such as [Kedah Malay](/wiki/Kedah_Malay). However, both Brunei and Kedah are quite close. ## Writing system Malay is now written using the [Latin script](/wiki/Latin_script), known as *Rumi* in Brunei, Malaysia and Singapore or *Latin* in Indonesia, although an [Arabic script](/wiki/Arabic_script) called *Arab Melayu* or [*Jawi*](/wiki/Jawi_alphabet) also exists. Latin script is official in Malaysia, Singapore, and Indonesia. Malay uses [Hindu-Arabic numerals](/wiki/Hindu-Arabic_numerals). *Rumi* (Latin) and *Jawi* are co-official in [Brunei](/wiki/Brunei) and [Malaysia](/wiki/Malaysia) only. Names of institutions and organisations have to use Jawi and Rumi (Latin) scripts in Brunei and some parts of Malaysia. Jawi is used fully in schools, especially the religious school, *sekolah agama*, which is compulsory during the afternoon for Muslim students aged from around 6–7 up to 12–14. Efforts are currently being undertaken to preserve Jawi in Malaysia, and students taking Malay language examinations in Malaysia have the option of answering questions using Jawi. The Latin script, however, is the most commonly used in Brunei and Malaysia, both for official and informal purposes. Historically, Malay has been written using various scripts. Before the introduction of Arabic script in the Malay region, Malay was written using the [Pallava](/wiki/Pallava_script), [Kawi](/wiki/Kawi_script) and [Rencong](/wiki/Rencong_script) scripts; these scripts are no longer frequently used, but similar scripts such as the [Cham alphabet](/wiki/Cham_alphabet) are used by the [Chams](/wiki/Chams) of [Vietnam](/wiki/Vietnam) and [Cambodia](/wiki/Cambodia). Old Malay was written using Pallava and Kawi script, as evident from several inscription stones in the Malay region. Starting from the era of kingdom of Pasai and throughout the golden age of the Malacca Sultanate, *Jawi* gradually replaced these scripts as the most commonly used script in the Malay region. Starting from the 17th century, under [Dutch](/wiki/Dutch_language) and British influence, Jawi was gradually replaced by the [Rumi](/wiki/Malay_alphabet) script. ## Extent of use Malay is spoken in [Brunei](/wiki/Brunei), [Indonesia](/wiki/Indonesia), [Malaysia](/wiki/Malaysia), [Timor-Leste](/wiki/Timor-Leste), [Singapore](/wiki/Singapore), southeastern [Philippines](/wiki/Philippines) and southern [Thailand](/wiki/Thailand). [Indonesian](/wiki/Indonesian_language) is the national language in Indonesia by Article 36 of the 1945 Constitution of the Republic of Indonesia, while \"Malay\" (*bahasa Melayu*) has been recognised as the ethnic languages of [Malay](/wiki/Malay_Indonesians) in Indonesia alongside [Malay-based trade and creole languages](/wiki/Malay_trade_and_creole_languages) and [other ethnic languages](/wiki/Languages_of_Indonesia). Malaysia and Singapore use a common standard Malay. Brunei, in addition to Standard Malay, uses a distinct [vernacular dialect](/wiki/Nonstandard_dialect) called [Brunei Malay](/wiki/Brunei_Malay). In Timor-Leste, Indonesian is recognised by the constitution as one of two working languages (the other being [English](/wiki/English_language)), alongside the official languages of [Tetum](/wiki/Tetum_language) and [Portuguese](/wiki/Portuguese_language). The extent to which Malay is used in these countries varies depending on historical and cultural circumstances. Malay is the national language in Malaysia by [Article 152](/wiki/Constitution_of_Malaysia#Article_152_–_National_Language_and_Other_Languages) of the [Constitution of Malaysia](/wiki/Constitution_of_Malaysia), and became the sole official language in [Peninsular Malaysia](/wiki/Peninsular_Malaysia) in 1968 and in [East Malaysia](/wiki/East_Malaysia) gradually from 1974. [English](/wiki/English_language) continues, however, to be widely used in professional and commercial fields and in the superior courts. Other minority languages are also commonly used by the country's large ethnic minorities. The situation in Brunei is similar to that in Malaysia. In the [Philippines](/wiki/Philippines), [Indonesian](/wiki/Indonesian_language) is spoken by the overseas Indonesian community concentrated in [Davao City](/wiki/Davao_City). Functional phrases are taught to members of the [Armed Forces of the Philippines](/wiki/Armed_Forces_of_the_Philippines) as well as local students. Bahasa Indonesia (Indonesian) exercises in the development of Malay as an international language as well as a language of science. The [VOA](/wiki/VOA) and [BBC](/wiki/BBC) use Indonesian as one of their standard language for broadcasting. In [Australia](/wiki/Australia), Indonesian is one of three Asian target languages, together with [Japanese](/wiki/Japanese_language) and [Mandarin](/wiki/Standard_Chinese), taught in some schools as part of the [Languages Other Than English](/wiki/Languages_Other_Than_English) programme. Indonesian has been taught in Australian schools and universities since the 1950s. Indonesian has been recognised as an official language of the General Conference of UNESCO since 2023. ## Phonology Malay, like most Austronesian languages, is not a [tonal language](/wiki/Tonal_language). The pronunciation of Standard Malay is based on the pronunciation of English dialects on the island of Great Britain. ### Consonants The consonants of Malaysian and also Indonesian are shown below. Non-native consonants that only occur in borrowed words, principally from Arabic, Dutch and English, are shown in brackets. Malay consonant phonemes [Labial](/wiki/Labial_consonant)[Dental](/wiki/Dental_consonant)/ [Alveolar](/wiki/Alveolar_consonant)[Post‑alv.](/wiki/Post-alveolar_consonant)/ [Palatal](/wiki/Palatal_consonant)[Velar](/wiki/Velar_consonant)[Glottal](/wiki/Glottal_consonant)[Nasal](/wiki/Nasal_consonant)[m](/wiki/Voiced_bilabial_nasal)[n](/wiki/Voiced_alveolar_nasal)[ɲ](/wiki/Voiced_palatal_nasal)[ŋ](/wiki/Voiced_velar_nasal)[Stop](/wiki/Stop_consonant)/ [Affricate](/wiki/Affricate)[voiceless](/wiki/Voicelessness)[p](/wiki/Voiceless_bilabial_plosive)[t](/wiki/Voiceless_alveolar_plosive)[t͡ʃ](/wiki/Voiceless_postalveolar_affricate)[k](/wiki/Voiceless_velar_plosive)([ʔ](/wiki/Glottal_stop))[voiced](/wiki/Voice_(phonetics))[b](/wiki/Voiced_bilabial_plosive)[d](/wiki/Voiced_alveolar_plosive)[d͡ʒ](/wiki/Voiced_postalveolar_affricate)[ɡ](/wiki/Voiced_velar_plosive)[Fricative](/wiki/Fricative)[voiceless](/wiki/Voicelessness)([f](/wiki/Voiceless_labiodental_fricative))[s](/wiki/Voiceless_alveolar_fricative)([ʃ](/wiki/Voiceless_postalveolar_fricative))([x](/wiki/Voiceless_velar_fricative))[h](/wiki/Voiceless_glottal_fricative)[voiced](/wiki/Voice_(phonetics))([v](/wiki/Voiced_labiodental_fricative))([z](/wiki/Voiced_alveolar_fricative))([ɣ](/wiki/Voiced_velar_fricative))[Approximant](/wiki/Approximant)[semivowel](/wiki/Semivowel)[w](/wiki/Voiced_labial%E2%80%93velar_approximant)[j](/wiki/Voiced_palatal_approximant)[lateral](/wiki/Lateral_consonant)[l](/wiki/Voiced_alveolar_lateral_approximant)[Trill](/wiki/Trill_consonant)[r](/wiki/Voiced_alveolar_trill) **Orthographic note**: The sounds are represented orthographically by their symbols as above, except: - /[ð](/wiki/Voiced_dental_fricative)/ is 'z', the same as the /[z](/wiki/Voiced_alveolar_fricative)/ sound (only occurs in Arabic loanwords originally containing the /[ð](/wiki/Voiced_dental_fricative)/ sound, but the writing is not distinguished from Arabic loanwords with /[z](/wiki/Voiced_alveolar_fricative)/ sound, and this sound must be learned separately by the speakers). - /[ɲ](/wiki/Voiced_palatal_nasal)/ is 'ny'; 'n' before 'c' and 'j' - /[ŋ](/wiki/Voiced_velar_nasal)/ is 'ng' - /[θ](/wiki/Voiceless_dental_fricative)/ is represented as 's', the same as the /[s](/wiki/Voiceless_alveolar_fricative)/ sound (only occurs in Arabic loanwords originally containing the /[θ](/wiki/Voiceless_dental_fricative)/ sound, but the writing is not distinguished from Arabic loanwords with /[s](/wiki/Voiceless_alveolar_fricative)/ sound, and this sound must be learned separately by the speakers). Previously (before 1972), this sound was written 'th' in Standard Malay (not Indonesian) - the glottal stop /[ʔ](/wiki/Glottal_stop)/ is final 'k' or an apostrophe ' (although some words have this glottal stop in the middle, such as *rakyat*) - /[tʃ](/wiki/Voiceless_postalveolar_affricate)/ is 'c' - /[dʒ](/wiki/Voiced_postalveolar_affricate)/ is 'j' - /[ʃ](/wiki/Voiceless_postalveolar_fricative)/ is 'sy' - /[x](/wiki/Voiceless_velar_fricative)/ is 'kh' - /[j](/wiki/Voiced_palatal_approximant)/ is 'y' - /[q](/wiki/Voiceless_uvular_plosive)/ is 'k' **Loans from Arabic**: - Phonemes which occur only in Arabic loans may be pronounced distinctly by speakers who know Arabic. Otherwise they tend to be replaced with native sounds. Table of borrowed Arabic consonants DistinctAssimilatedExample/[x](/wiki/Voiceless_velar_fricative)//[k](/wiki/Voiceless_velar_plosive)/, /[h](/wiki/Voiceless_glottal_fricative)/*khabar, kabar* \"news\"/[ð](/wiki/Voiced_dental_fricative)//[d](/wiki/Voiced_alveolar_plosive)/, /[l](/wiki/Voiced_alveolar_lateral_approximant)/*redha, rela* \"good will\"/zˤ//[l](/wiki/Voiced_alveolar_lateral_approximant)/, /[z](/wiki/Voiced_alveolar_fricative)/*lohor, zuhur* \"noon (prayer)\"/[ɣ](/wiki/Voiced_velar_fricative)//[ɡ](/wiki/Voiced_velar_plosive)/, /[r](/wiki/Voiced_alveolar_trill)/*ghaib, raib* \"hidden\"/[ʕ](/wiki/Voiced_pharyngeal_fricative)//[ʔ](/wiki/Glottal_stop)/*saat, sa'at* \"second (time)\"/[θ](/wiki/Voiceless_dental_fricative)//[s](/wiki/Voiceless_alveolar_fricative)/*Selasa* \"Tuesday\"/[q](/wiki/Voiceless_uvular_plosive)//[k](/wiki/Voiceless_velar_plosive)/*makam* \"grave\" ### Vowels Malay originally had four vowels, but in many dialects today, including Standard Malay, it has six, with /i/ split into /i, e/ and /u/ split into /u, o/. Many words are commonly pronounced variably, with either [i, u] or [e, o], and relatively few words require a mid vowel [e, o]. Table of vowel phonemes of Standard Malay [Front](/wiki/Front_vowel)[Central](/wiki/Central_vowel)[Back](/wiki/Back_vowel)[Close](/wiki/Close_vowel)[i](/wiki/Close_front_unrounded_vowel)[u](/wiki/Close_back_rounded_vowel)[Mid](/wiki/Mid_vowel)[e](/wiki/Close-mid_front_unrounded_vowel)[ə](/wiki/Mid_central_vowel)[o](/wiki/Close-mid_back_rounded_vowel)[Open](/wiki/Open_vowel)[a](/wiki/Open_front_unrounded_vowel) **Orthographic note**: both /e/ and /ə/ are written with ⟨e⟩. Orthographic /e, o/ are relatively rare, so the letter ⟨e⟩ usually represents /ə/. There are some homographs; for example, *perang* is used for both /pəraŋ/ \"war\" and /peraŋ ~ piraŋ/ \"blond\". (In Indonesia, \"blond\" is written as *pirang* instead of *perang*.) Some analyses regard /ai, au, oi/ as diphthongs. However, [ai] and [au] can only occur in open syllables, such as *cukai* (\"excise\") and *pulau* (\"island\"). Words with a phonetic diphthong in a closed syllable, such as *baik* (\"good\") and *laut* (\"sea\"), are actually two syllables. An alternative analysis therefore treats the phonetic diphthongs [ai], [au] and [oi] as a sequence of a monophthong plus an approximant: /aj/, /aw/ and /oj/ respectively. There is a rule of [vowel harmony](/wiki/Vowel_harmony): the non-open vowels /i, e, u, o/ in bisyllabic words must agree in height, so *hidung* (\"nose\") is allowed but **hedung* is not. Comparison of several standard pronunciations of Malay–Indonesian ExampleStandard PronunciationIndonesian–*Baku**Johor–Riau* (*Piawai*)Northern Peninsular⟨a⟩ in final open syllable⟨keret**a**⟩/a//ə//a/⟨i⟩ in final closed syllable with final ⟨n⟩ and ⟨ng⟩⟨kamb**i**ng⟩/i//e//i/⟨i⟩ in final closed syllable with other final consonants⟨it**i**k⟩/i//e//e/⟨u⟩ in final closed syllable with final ⟨n⟩ and ⟨ng⟩⟨tah**u**n⟩/u//o//u/⟨u⟩ in final closed syllable with other final consonants⟨lump**u**r⟩/u//o//o/final ⟨r⟩⟨lumpu**r**⟩/r/silent/r/ Study by Uri Tadmor which was published in 2003 shows that mutation of ⟨a⟩ in final open syllable is an areal feature. Specifically, it is an areal feature of Western Austronesia. Uri Tadmor classify those types into four groups as below. Final /a/ mutation in Malay-Indonesian dialects and nearby Austronesian languages TypesPhonemes\"Malay\" homelandNative languages area[a] (origin)[a][Kedah](/wiki/Kedah), [Brunei](/wiki/Brunei)Arekan (eg. [Tengger](/wiki/Tenggerese_dialect)), [Sarawak](/wiki/Sarawak), [Sabah](/wiki/Sabah), [Kalimantan](/wiki/Kalimantan) (except Pontianak), [East Indonesia](/wiki/East_Indonesian_Malay)Raised[ə], [ɨ][Johor](/wiki/Johor), [Pontianak](/wiki/Pontianak), [Tanah Abang](/wiki/Tanah_Abang) ([Jakarta](/wiki/Jakarta))[Bali](/wiki/Bali)Rounded[o], [ɔ][Pattani](/wiki/Pattani_province), [Palembang](/wiki/Palembang)[Minangkabau](/wiki/Minangkabau_language), Mataraman (eg. [Yogyakarta](/wiki/Yogyakarta))Fronted[ɛ], [e][Perak](/wiki/Perak), [Jakarta](/wiki/Jakarta), [Sambas](/wiki/Sambas_Regency) ## Grammar Malay is an [agglutinative language](/wiki/Agglutinative_language), and new words are formed by three methods: attaching affixes onto a root word ([affixation](/wiki/Affixation)), formation of a [compound word](/wiki/Compound_word) (composition), or repetition of words or portions of words ([reduplication](/wiki/Reduplication)). Nouns and verbs may be basic roots, but frequently they are [derived](/wiki/Derivation_(linguistics)) from other words by means of [prefixes](/wiki/Prefix), [suffixes](/wiki/Suffix) and [circumfixes](/wiki/Circumfix). Malay does not make use of [grammatical gender](/wiki/Grammatical_gender), and there are only a few words that use natural gender; the same word is used for 'he' and 'she' which is *dia* or for 'his' and 'her' which is *dia punya*. There is no grammatical plural in Malay either; thus *orang* may mean either 'person' or 'people'. Verbs are not [inflected](/wiki/Inflected_language) for person or number, and they are not marked for tense; tense is instead denoted by time adverbs (such as 'yesterday') or by other tense indicators, such as *sudah* 'already' and *belum* 'not yet'. On the other hand, there is a complex system of verb affixes to render nuances of meaning and to denote [voice](/wiki/Voice_(grammar)) or intentional and accidental [moods](/wiki/Grammatical_mood). Malay does not have a [grammatical subject](/wiki/Grammatical_subject) in the sense that English does. In intransitive clauses, the noun comes before the verb. When there is both an [agent](/wiki/Agent_(grammar)) and an [object](/wiki/Object_(grammar)), these are separated by the verb (OVA or AVO), with the difference encoded in the voice of the verb. OVA, commonly but inaccurately called \"passive\", is the basic and most common word order.[*citation needed*] ## Vocabulary This section **needs expansion**. You can help by expanding it. *(July 2019)* The Malay language has many words borrowed from [Arabic](/wiki/Arabic_language) (in particular religious terms), [Sanskrit](/wiki/Sanskrit_language), [Tamil](/wiki/Tamil_language), certain [Sinitic languages](/wiki/Sinitic_languages), [Persian](/wiki/Persian_language) (due to historical status of Malay Archipelago as a trading hub), and more recently, [Portuguese](/wiki/Portuguese_language), [Dutch](/wiki/Dutch_language) and [English](/wiki/English_language) (in particular many scientific and technological terms). [Indonesian](/wiki/Indonesian_language) has inclination toward [Sanskrit](/wiki/Sanskrit) in formulation of new words due to extensive [Javanese](/wiki/Javanese_language) and [Balinese](/wiki/Balinese_language) speaking community, while Malaysian and Bruneian Malay prefer [Arabic](/wiki/Arabic) as source for neologism due to acceptance of Islamic Arabic practices. Arabic in Indonesian tends to reside in (Islamic) religious sphere. The presence of Sanskritised neologism in Malaysian and Bruneian Malay is a result of \"importation\" from Indonesian. Terminology for various subjects such as administration, business, and law was derived from the languages of respective colonial master, those are Dutch for Indonesian and English for Malaysian and Bruneian Malay. Although the rule for scientific terms development is agreed, the result can be differ because of (1) the difference in traditional vocabulary (such as Dutch vs English and Sanskritic Javanese vs Arabised Malay) and (2) the loan-shift difference on semantics and grammatical feature choice. The divergence between Indonesian and \"Standard\" Malay are systemic in nature and, to a certain extent, contribute to the way the two sets of speakers understand and react to the world, and are more far reaching with a discernible cognitive gap than the difference between dialects. ## Varieties and related languages There is a group of closely related languages spoken by [Malays](/wiki/Malays_(ethnic_group)) and related peoples across [Brunei](/wiki/Brunei), [Indonesia](/wiki/Indonesia), [Malaysia](/wiki/Malaysia), [Singapore](/wiki/Singapore), [Southern Thailand](/wiki/Southern_Thailand), [Timor-Leste](/wiki/Timor-Leste), and the far southern parts of the [Philippines](/wiki/Philippines). They have traditionally been classified as Malay, Para-Malay, and Aboriginal Malay, but this reflects geography and ethnicity rather than a proper linguistic classification. The Malayic languages are [mutually intelligible](/wiki/Mutually_intelligible) to varying extents, though the distinction between language and dialect is unclear in many cases. Para-Malay includes the Malayic languages of [Sumatra](/wiki/Sumatra). They are: [Minangkabau](/wiki/Minangkabau_language), [Central Malay](/wiki/Central_Malay) (Bengkulu), [Pekal](/wiki/Pekal_language), Talang Mamak, [Musi](/wiki/Musi_language) (Palembang), [Negeri Sembilan](/wiki/Negeri_Sembilan_Malay) (Malaysia), and [Duano’](/wiki/Duano_language). Aboriginal Malay are the Malayic languages spoken by the [Orang Asli](/wiki/Orang_Asli) ([Proto-Malay](/wiki/Proto-Malay)) in [Malaya](/wiki/Peninsular_Malaysia). They are [Jakun](/wiki/Jakun_language), [Orang Kanaq](/wiki/Orang_Kanaq_language), [Orang Seletar](/wiki/Orang_Seletar_language), and [Temuan](/wiki/Temuan_language).[*citation needed*] The other Malayic languages, included in neither of these groups, are associated with the expansion of the Malays across the archipelago. They include Riau-Johor Malay ([Malaysian](/wiki/Malaysian_language) and [Indonesian](/wiki/Indonesian_language)), [Kedah Malay](/wiki/Kedah_Malay), [Brunei Malay](/wiki/Brunei_Malay), [Berau Malay](/wiki/Berau_Malay), [Bangka Malay](/wiki/Bangka_Malay), [Jambi Malay](/wiki/Jambi_Malay), [Kutai Malay](/wiki/Kutai_Malay), [Terengganu Malay](/wiki/Terengganu_Malay), Riau Malay, [Loncong](/wiki/Orang_Laut_language), [Pattani Malay](/wiki/Pattani_Malay), [Bacan Malay](/wiki/Bacan_Malay), and [Banjarese](/wiki/Banjar_language). [Menterap](/wiki/Menterap_language) may belong here. There are also several [Malay-based creole languages](/wiki/Malay-based_creole_languages), such as [Betawi Malay](/wiki/Betawi_language), [Cocos Malay](/wiki/Cocos_Malay), [Makassar Malay](/wiki/Makassar_Malay), [Ambonese Malay](/wiki/Ambonese_Malay), [Dili Malay](/wiki/Dili_Malay), [Kupang Malay](/wiki/Kupang_Malay), [Manado Malay](/wiki/Manado_Malay), [Papuan Malay](/wiki/Papuan_Malay), [Thousand Islands Malay](/wiki/Orang_Pulo_language), [Larantuka Malay](/wiki/Larantuka_Malay), [Alor Malay](/wiki/Alor_Malay), [Balinese Malay](/wiki/Balinese_Malay),[Sri Lankan Malay](/wiki/Sri_Lankan_Malay) and [Sabah Malay](/wiki/Sabah_Malay), which may be more or less distinct from standard (Malaccan) Malay. Due to the early settlement of a [Cape Malay](/wiki/Cape_Malay) community in [Cape Town](/wiki/Cape_Town), who are now known as [Coloureds](/wiki/Coloured), numerous [Classical Malay](/wiki/History_of_the_Malay_language#Classical_Malay) words were brought into [Afrikaans](/wiki/Afrikaans_language). ### Usages This section **does not cite any sources**. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed. *(February 2021)* *(Learn how and when to remove this message)* The extent to which Malay and related Malayan languages are used in the countries where it is spoken varies depending on historical and cultural circumstances. Malay is the national language in Malaysia by [Article 152](/wiki/Constitution_of_Malaysia#Article_152_–_National_Language_and_Other_Languages) of the [Constitution of Malaysia](/wiki/Constitution_of_Malaysia), and became the sole official language in [West Malaysia](/wiki/West_Malaysia) in 1968, and in [East Malaysia](/wiki/East_Malaysia) gradually from 1974. [English](/wiki/English_language) continues, however, to be widely used in professional and commercial fields and in the superior courts. Other minority languages are also commonly used by the country's large ethnic minorities. The situation in Brunei is similar to that of Malaysia. In Singapore, Malay was historically the *[lingua franca](/wiki/Lingua_franca)* among people of different nationalities. Although this has largely given way to English, Malay still retains the status of national language and the [national anthem](/wiki/National_anthem), [Majulah Singapura](/wiki/Majulah_Singapura), is entirely in Malay. In addition, parade commands in the military, police and civil defence are given only in Malay. Most residents of the five southernmost provinces of [Thailand](/wiki/Thailand)—a region that, for the most part, used to be part of an ancient Malay kingdom called [Pattani](/wiki/Pattani_kingdom)—speak a dialect of Malay called [Yawi](/wiki/Yawi_language) (not to be confused with Jawi), which is similar to Kelantanese Malay, but the language has no official status or recognition. Owing to earlier contact with the [Philippines](/wiki/Philippines), Malay words—such as *dalam hati* (sympathy), *luwalhati* (glory), *tengah hari* (midday), *sedap* (delicious)—have evolved and been integrated into [Tagalog](/wiki/Tagalog_language) and other [Philippine languages](/wiki/Languages_of_the_Philippines). This linguistic exchange reflects broader patterns of cultural interaction and mutual influence that have contributed to shared concepts of social values and inclusion within Philippine society.[*citation needed*] By contrast, Indonesian has successfully become the *lingua franca* for its disparate islands and ethnic groups, in part because the colonial language, Dutch, is no longer commonly spoken. (In [East Timor](/wiki/East_Timor), which was governed as a province of Indonesia from 1976 to 1999, Indonesian is widely spoken and recognized under its [Constitution](/wiki/Constitution) as a 'working language'.) Besides [Indonesian](/wiki/Indonesia_language), which developed from the Riau Malay dialect, there are many Malay varieties spoken in Indonesia; they are divided into western and eastern groups. Western Malay dialects are predominantly spoken in [Sumatra](/wiki/Sumatra) and [Borneo](/wiki/Borneo), which itself is divided into Bornean and Sumatran Malay; some of the most widely spoken Sumatran Malay dialects are [Riau Malay](/wiki/Riau), [Langkat](/wiki/Langkat), [Palembang Malay](/wiki/Musi_language) and [Jambi Malay](/wiki/Jambi_Malay). [Minangkabau](/wiki/Minangkabau_people), [Kerinci](/wiki/Kerinci_people) and [Bengkulu](/wiki/Bengkulu) are believed to be Sumatran Malay descendants. Meanwhile, the [Jakarta](/wiki/Jakarta) dialect (known as [Betawi](/wiki/Betawi_language)) also belongs to the western Malay group. The eastern varieties, classified either as dialects or [creoles](/wiki/Malay_trade_and_creole_languages), are spoken in the eastern part of the Malay or Nusantara archipelago and include [Makassar Malay](/wiki/Makassar_Malay), [Manado Malay](/wiki/Manado_Malay), [Ambonese Malay](/wiki/Ambonese_Malay), [North Moluccan Malay](/wiki/North_Moluccan_Malay), [Kupang Malay](/wiki/Kupang_Malay), [Dili Malay](/wiki/Dili_Malay), and [Papuan Malay](/wiki/Papuan_Malay). The differences among both groups are quite observable. For example, the word *kita* means 'we, us' in western, but means 'I, me' in Manado, whereas 'we, us\" in Manado is *torang* and Ambon *katong* (originally abbreviated from Malay *kita orang* 'we people'). Another difference is the lack of possessive pronouns (and suffixes) in eastern dialects. Manado uses the verb *pe* and Ambon *pu* (from Malay *punya* 'to have') to mark possession. So 'my name' and 'our house\" are translated in western Malay as *namaku* and *rumah kita* but *kita pe nama* and *torang pe rumah* in Manado and *beta pu nama*, *katong pu rumah* in Ambon dialect. The pronunciation may vary in western dialects, especially the pronunciation of words ending in the vowel 'a'. For example, in some parts of Malaysia and in Singapore, *kita* (inclusive 'we, us, our') is pronounced as /kitə/, in Kelantan and Southern Thailand as /kitɔ/, in Riau as /kita/, in Palembang as /kito/, in Betawi and Perak as /kitɛ/ and in Kedah and Perlis as /kitɑ/. Batavian and eastern dialects are sometimes regarded as Malay creole, because the speakers are not ethnically Malay. ## Examples Despite that statement of \"all Malay speakers should be able to understand either of the translations below, which differ mostly in their choice of wording,\" the divergence between Indonesian and \"Standard\" Malay are systemic in nature and, to a certain extent, contribute to the way the two sets of speakers understand and react to the world, and are more far reaching with a discernible cognitive gap than the difference between dialects. The words for 'article', *pasal* and *perkara*, and for 'declaration', *pernyataan* and *perisytiharan*, are specific to the Indonesian and Malaysian standards, respectively, but otherwise all the words are found in both (and even those words may be found with slightly different meanings). Article 1 of the [Universal Declaration of Human Rights](/wiki/Universal_Declaration_of_Human_Rights) EnglishMalay–IndonesianIndonesianStandard \"Malay\"**Universal Declaration of Human Rights****Pernyataan Umum tentang Hak Asasi Manusia** (General Declaration about Human Rights)**Perisytiharan Hak Asasi Manusia Sejagat** (Universal Declaration of Human Rights)**Article 1****Pasal 1****Perkara 1**All human beings are born free and equal in dignity and rights. They are endowed with reason and conscience and should act towards one another in a spirit of brotherhood.*Semua orang dilahirkan merdeka dan mempunyai martabat dan hak-hak yang sama. Mereka dikaruniai akal dan hati nurani dan hendaknya bergaul satu sama lain dalam semangat persaudaraan.**Semua manusia dilahirkan bebas dan sama rata dari segi maruah dan hak-hak. Mereka mempunyai pemikiran dan perasaan hati dan hendaklah bertindak di antara satu sama lain dengan semangat persaudaraan.*(All human beings are born free and have the same dignity and rights. They are endowed with reason and conscience and should get along with each other in a spirit of brotherhood.)(All human beings are born free and are equal in dignity and rights. They have thoughts and feelings and should get along with a spirit of brotherhood.) - [Comparison of Standard Malay and Indonesian](/wiki/Comparison_of_Standard_Malay_and_Indonesian) - [Indonesian language](/wiki/Indonesian_language) - [Jawi script](/wiki/Jawi_script), an [Arabic alphabet](/wiki/Arabic_script) for Malay - [Languages of Indonesia](/wiki/Languages_of_Indonesia) - [List of English words of Malay origin](/wiki/List_of_English_words_of_Malay_origin) - [Malajoe Batawi](/wiki/Malajoe_Batawi) - [Malaysian English](/wiki/Malaysian_English), the English used formally in Malaysia - [Malaysian language](/wiki/Malaysian_language) ## Notes - Adelaar, K. Alexander (2004). \"Where does Malay come from? Twenty years of discussions about homeland, migrations and classifications\". *[Bijdragen tot de Taal-, Land- en Volkenkunde](/wiki/Bijdragen_tot_de_Taal-,_Land-_en_Volkenkunde)*. **160** (1): 1–30. [doi](/wiki/Doi_(identifier)):10.1163/22134379-90003733. [hdl](/wiki/Hdl_(identifier)):11343/122869. [JSTOR](/wiki/JSTOR_(identifier)) 27868100. - B., C. O. (1939). \"Corrigenda and Addenda: A Chinese Vocabulary of Malacca Malay Words and Phrases Collected between A.D. 1403 and 1511 (?)\". *Bulletin of the School of Oriental Studies, University of London*. **10** (1). [JSTOR](/wiki/JSTOR_(identifier)) 607921. - Braginsky, Vladimir, ed. (2013) [First published 2002]. *Classical Civilizations of South-East Asia*. Oxford: Routledge. [ISBN](/wiki/ISBN_(identifier)) 978-1-136-84879-7. - Edwards, E. D.; Blagden, C. O. (1931). \"A Chinese Vocabulary of Malacca Malay Words and Phrases Collected between A. D. 1403 and 1511 (?)\". *Bulletin of the School of Oriental Studies, University of London*. **6** (3): 715–749. [doi](/wiki/Doi_(identifier)):10.1017/S0041977X00093204. [JSTOR](/wiki/JSTOR_(identifier)) 607205. [S2CID](/wiki/S2CID_(identifier)) 129174700. - Wilkinson, Richard James (1901–1903). *A Malay-English Dictionary*. Singapore: Kelly & Walsh. - Swadesh list of Malay words - Digital version of Wilkinson's 1926 Malay-English Dictionary - Pusat Rujukan Persuratan Melayu, online Malay language database provided by the [Dewan Bahasa dan Pustaka](/wiki/Dewan_Bahasa_dan_Pustaka) - Kamus Besar Bahasa Indonesia dalam jaringan (Online Great Dictionary of the Indonesian Language published by Pusat Bahasa, in Indonesian only) - Dewan Bahasa dan Pustaka (Institute of Language and Literature Malaysia, in Malay only) - The Malay Spelling Reform, Asmah Haji Omar, (Journal of the Simplified Spelling Society, 1989-2 pp. 9–13 later designated J11) - Malay Chinese Dictionary - Malay English Dictionary - Malay English Translation\n",
  "language": "en",
  "processed_at": "2026-01-12T11:28:29.068612",
  "title": "Malay language",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Malay_language"
}