{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:28:38.894856"
  },
  "content": "Geopolitical and sociolinguistic term The **Malay world** or **Malay realm** ([Indonesian](/wiki/Indonesian_language)/[Malay](/wiki/Malay_language): *Dunia Melayu* or *Alam Melayu*[a]) or **Malaysphere** is a political concept or an expression that has been used by different authors and groups over time to denote several different notions, derived from varied interpretations of 'Malay' either as an [ethnic group](/wiki/Malay_(ethnic_group)), as a [racial category](/wiki/Malay_race), as a [linguistic group](/wiki/Linguistic_group) or as a [cultural group](/wiki/Ethnoreligious_group). The use of the term Malay in much of the conceptualisation is largely based on the prevalent [Malay cultural influence](/wiki/Malayisation), manifested in particular through the [spread of the Malay language](/wiki/Malay_trade_and_creole_languages) in [Southeast Asia](/wiki/Southeast_Asia) as observed by different colonial powers during the [Age of Discovery](/wiki/Age_of_Discovery) and [spread of Islam](/wiki/Spread_of_Islam). The term remains highly [controversial](/wiki/Controversial) in [Indonesia](/wiki/Indonesia) and outside the Malay-speaking areas, because it is considered politically charged and [irredentist](/wiki/Irredentism) rather than purely cultural. The concept in its broadest territorial stretch may apply to a region synonymous with [Austronesia](/wiki/Austronesia), homeland to the [Austronesian peoples](/wiki/Austronesian_peoples), that extends from [Easter Island](/wiki/Easter_Island) in the east to [Madagascar](/wiki/Madagascar) in the west. Such description has its origin in the introduction of the term [Malay race](/wiki/Malay_race) in the late 18th century that has been popularised by [orientalists](/wiki/Orientalism) to describe the Austronesian peoples. In the development of further research, the Malay race was categorized as a [Malayo-Polynesian languages](/wiki/Malayo-Polynesian_languages). In a narrower sense, the Malay world has been used as a synonym for Malay *[sprachraum](/wiki/Sprachraum)*, referring to the [Malay](/wiki/Malay_language)-speaking countries and territories of Southeast Asia, where different standards of Malay are the [national languages](/wiki/National_language) or a variety of it is an important minority language. The term in this sense encompasses [Brunei](/wiki/Brunei), [Indonesia](/wiki/Indonesia), [Malaysia](/wiki/Malaysia), [Singapore](/wiki/Singapore) and [Southern Thailand](/wiki/Southern_Thailand), and is sometimes used interchangeably with the concepts of '[Malay Archipelago](/wiki/Malay_Archipelago)' and '[Nusantara](/wiki/Nusantara_(archipelago))'. Malayophones (peoples and nations that speak Malay/Indonesian as their native language or recognize it as an official language) are projected to number an estimated 330 million people by 2025, comprising just under half of the population of Southeast Asia in eight sovereign states and territories: Indonesia, Malaysia, Singapore and Brunei, where Malay is an official language under the name 'Malay', 'Indonesian' or 'Malaysian'; [East Timor](/wiki/East_Timor) and parts of [Thailand](/wiki/Thailand) and the [Philippines](/wiki/Philippines), where Malay/Indonesian is recognized as a minority or trade language, and the [Australian territories](/wiki/Australian_territories) of the [Cocos (Keeling) Islands](/wiki/Cocos_(Keeling)_Islands) and [Christmas Island](/wiki/Christmas_Island), where Malay is the majority language and a significant minority, respectively. Alternatively, modern scholars correct these extended notions of the Malay world, defining it as a political and [cultural area](/wiki/Cultural_area) instead. In this context, the Malay world is reduced to a region that is homeland to the [Malay ethnicity](/wiki/Malays_(ethnic_group)), historically ruled by rival [sultanates](/wiki/Sultan#Southeast_and_East_Asia), where various [Malayic languages](/wiki/Malayic_languages) and cultural values are predominant. This area includes the coastal areas of the [Malay Peninsula](/wiki/Malay_Peninsula), [Sumatra](/wiki/Sumatra), [Borneo](/wiki/Borneo), and the smaller islands in between. The most notable use of the concept was in the early 20th century, embraced in an [irredentist](/wiki/Irredentism) fashion, by [Malay nationalists](/wiki/Early_Malay_nationalism) in the form of '[Greater Indonesia](/wiki/Greater_Indonesia)' or 'Greater Malay' (*Indonesia Raya*/*Melayu Raya*), as an aspiration for the natural or desired borders of a modern nation for the Malay race. Classical works of Malay literature such as [Sejarah Melayu](/wiki/Sejarah_Melayu) and [Hikayat Hang Tuah](/wiki/Hikayat_Hang_Tuah) do not mention the term \"Alam Melayu\" (Malay world). The term only developed after 1930, with the first recorded examples coming from *Majalah Guru*, a [Malay states](/wiki/Monarchies_of_Malaysia) monthly magazine, and the newspaper *Saudara*, which was published in Penang and circulated throughout the [Straits Settlements](/wiki/Straits_Settlements). *Alam Melayu* as a concept was only developed and gained popularity after the emergence of [Malay nationalism](/wiki/Early_Malay_nationalism) in the early 20th century. ## Historical origin ### Early conception The epic literature, the *[Malay Annals](/wiki/Malay_Annals)*, associates the etymological origin of \"Melayu\" to *Sungai Melayu* ('Melayu river') in [Sumatra](/wiki/Sumatra), [Indonesia](/wiki/Indonesia). The term is thought to be derived from the [Malay](/wiki/Malay_language) word *melaju*, a combination of the verbal [prefix](/wiki/Prefix) 'me' and the [root word](/wiki/Root_word) 'laju', meaning \"to accelerate\", used to describe the accelerating strong current of the river. ### As a place name (toponym) - ***Malayadvipa***, \"Malaya [Dvipa](/wiki/Dvipa)\", is described in chapter 48, [Vayu Purana](/wiki/Vayu_Purana) as one of the mountainous provinces in the eastern sea that was full of gold and silver. The exact modern location befitting with this term is disputed. Some scholars equate the term with [Sumatra](/wiki/Sumatra), while several Indian scholars associating it with the mountainous [Malay Peninsula](/wiki/Malay_Peninsula). Other scholars even suggested [Sri Lanka](/wiki/Sri_Lanka)'s possibility. while Sumatra is more correctly associated with [Suvarnadvipa](/wiki/Suvarnabhumi) (an ancient name referred to Sumatra) which means \"The Gold Land\" and the [Barisan Mountains](/wiki/Barisan_Mountains) which is the mountainous range scattered from north to the south Sumatra hemisphere. - ***Maleu-kolon*** – a location in the [Malay Peninsula](/wiki/Malay_Peninsula), from [Ptolemy](/wiki/Ptolemy)'s work, [*Geographia*](/wiki/Geographia_(Ptolemy)). - ***Mo-lo-yu*** – mentioned by [Yijing](/wiki/Yijing_(monk)), a [Tang dynasty](/wiki/Tang_dynasty) [Chinese Buddhist](/wiki/Chinese_Buddhism) monk who visited the Southeast Asia in 688–695. According to Yijing, the *Mo-Lo-Yu* kingdom was located at a distance of 15 days sailing from Bogha ([Palembang](/wiki/Palembang)), the capital of Sribhoga ([Srivijaya](/wiki/Srivijaya)). It took a 15-day sail as well to reach Ka-Cha ([Kedah](/wiki/Kedah)) from Mo-lo-yu; therefore, it can be reasoned that Mo-Lo-Yu would lie halfway between the two places. A popular opinion as espoused by Coedes, relates *Mo-Lo-Yu* with [Jambi](/wiki/Muaro_Jambi_Temple_Compounds) in Sumatra, thus creating the theory of a '[Melayu Kingdom](/wiki/Melayu_Kingdom)'. However, the geographical location of Jambi contradicts with Yi Jing's description of a \"half way sail between *Ka-Cha* ([Kedah](/wiki/Kedah)) and *Bogha* ([Palembang](/wiki/Palembang))\". - ***Malayur*** – inscribed on the south wall of the [Brihadeeswarar Temple](/wiki/Brihadeeswarar_Temple) in [Tamil Nadu](/wiki/Tamil_Nadu). It was described as a kingdom that had \"a strong mountain for its rampart\" in Malay Peninsula, that fell to the Chola invaders during [Rajendra Chola I](/wiki/Rajendra_Chola_I)'s campaign in the 11th century. - ***Bhūmi Mālayu*** – (literally \"Land of Malayu\"), a transcription from [Padang Roco Inscription](/wiki/Padang_Roco_Inscription) dated 1286 CE by Slamet Muljana. The term is associated with [Dharmasraya](/wiki/Dharmasraya) kingdom. - ***Ma-li-yu-er*** – mentioned in the chronicle of [Yuan Dynasty](/wiki/Yuan_dynasty), referring to a nation of Malay Peninsula that faced the southward expansion of [Sukhothai Kingdom](/wiki/Sukhothai_Kingdom), during the reign of [Ram Khamhaeng](/wiki/Ram_Khamhaeng). The chronicle stated: \"*..Animosity occurred between [Siam](/wiki/Thai_people) and Ma-li-yu-er with both killing each other ...*\". In response to the Sukhothai's action, a Chinese envoy went to the Ram Khamhaeng's court in 1295 bearing an imperial decree: \"Keep your promise and do no evil to Ma-li-yu-er\". - ***Malauir*** – mentioned in [Marco Polo](/wiki/Marco_Polo)'s [account](/wiki/Travels_of_Marco_Polo) as a kingdom located in the Malay Peninsula, possibly similar to the one mentioned in Yuan chronicle. - ***Malayapura*** – (literally \"city of Malaya\" or \"fortress of Malaya\"), inscribed on the [Amoghapasa inscription](/wiki/Amoghapasa_inscription) dated 1347 CE. The term was used by [Adityawarman](/wiki/Adityawarman) to refer to [Dharmasraya](/wiki/Dharmasraya). Territorial identification of Malay is of ancient origin. Various foreign and local records show that *Melayu* (Malay) and its similar sounding variants appear to apply as an old toponym to the ancient [Straits of Malacca](/wiki/Straits_of_Malacca) region in general. > *\"... starting point by the Island of Pulo Catay in the region of Pattane ([Pattani](/wiki/Patani_(historical_region))), situated in the east coast in 8 degrees of latitude, the pass round to the other or western coast of Ujontana ([Malay peninsula](/wiki/Malay_peninsula)), to Taranda and Ujon Calan situated in the same latitude in district of Queda ([Kedah](/wiki/Kedah)): this stretch of territory lies within the region of \"Malayos\" and the same language prevail throughout ...\"* – [Manuel Godinho de Erédia](/wiki/Manuel_Godinho_de_Er%C3%A9dia),1613. In the 15th century, the term gradually developed into an [ethnonym](/wiki/Ethnonym) throughout the consolidation of [Melaka Sultanate](/wiki/Melaka_Sultanate) as a regional power. [Tome Pires](/wiki/Tome_Pires), an apothecary who stayed in Melaka from 1512 to 1515, after the [Portuguese conquest](/wiki/Capture_of_Malacca_(1511)), explained how the former Melaka classified merchants calling its port into four groups, of which the Malays or *Melayu* did not appear in the list, suggesting they were not then regarded as category outside the Melaka itself. Another term, *Malayos* or the 'Sea of Malayu' was espoused by the [Portuguese](/wiki/Portuguese_people) [historian](/wiki/Historian), [Manuel Godinho de Erédia](/wiki/Manuel_Godinho_de_Er%C3%A9dia) to describe areas under [Malaccan](/wiki/Melaka_Sultanate) dominance. The area covers the [Andaman Sea](/wiki/Andaman_Sea) in the north, the entire [Strait of Malacca](/wiki/Strait_of_Malacca) in the centre, a part of [Sunda Strait](/wiki/Sunda_Strait) in the south and the western [South China Sea](/wiki/South_China_Sea) in the east. It was generally described as a [Muslim](/wiki/Muslim) centre of international trade, with [Malay language](/wiki/Malay_language) as its *[lingua franca](/wiki/Lingua_franca)*. [Erédia](/wiki/Manuel_Godinho_de_Er%C3%A9dia)'s description indicates that *Malayos* was a geo-religio-sociocultural concept, a concept of geographical unity characterised by the common religious belief and cultural features. An identical term, *[Tanah Melayu](/wiki/Tanah_Melayu)* (literally 'Malay land') is found in various Malay texts, of which the oldest are dating back to the early 17th century. It is frequently mentioned in the *[Hikayat Hang Tuah](/wiki/Hikayat_Hang_Tuah)*, a well known classical work that began as oral tales associated with the legendary heroes of Melaka Sultanate. *Tanah Melayu* in the text is consistently employed to refer to the area under Melakan dominance. In the early 16th century, Tomé Pires coins an almost similar term, *Terra de Tana Malaio* for the southeastern part of Sumatra, where the deposed Sultan of Melaka, [Mahmud Shah](/wiki/Mahmud_Shah_of_Malacca) established his exiled government. > *\"... the country which Europeans denominate the Malay Peninsula, and which, by the natives themselves, is called 'the land of the Malays' ('Tanah Melayu'), has, from its appearing to be wholly occupied by that people, been generally considered as their original country ...\"* – [John Crawfurd](/wiki/John_Crawfurd), 1820 The application of *Tanah Melayu* to the [Malay Peninsula](/wiki/Malay_Peninsula) entered into the European authorship, when [Marsden](/wiki/William_Marsden_(orientalist)) and [Crawfurd](/wiki/John_Crawfurd) noted it in their historical works published in 1811 and 1820 respectively. Another important term, the *Malaya*, an English term for the Peninsula, was already used in English writings from the early 18th century. Due to the lack of available research, it is difficult to trace the development of the concept of the Malay world as a term which later refers to the [archipelago](/wiki/Malay_Archipelago). However, thus classical territorial identifications are believed to have formed an important antecedent for the future conceptualisation of the Malay world. The term \"Alam Melayu\" itself did not exist before the 20th century. [Classical Malay literatures](/wiki/Classical_Malay_literature) between the 14th century to the 20th century never mentioned \"Alam Melayu\" or any similar term. Instead, the term emerged along with the emergence of the Malay identity and nationality movement after 1930, mentioned in Malay [periodicals](/wiki/Periodical_literature) such as *Majalah Guru* magazine, *Saudara* newspaper, *Majlis* newspaper, and *Puisi-Puisi Kebangsaan* newspaper. ### Malay as a racial category The broader concept of Malay world has its origin from the conceptualisation of Malay as a race by the German scientist [Johann Friedrich Blumenbach](/wiki/Johann_Friedrich_Blumenbach). Blumenbach identified 'Malay' as a subcategory of both the [Ethiopid](/wiki/Ethiopid_race) and [Mongoloid](/wiki/Mongoloid) races, and expanded the term to include the native inhabitants of the [Mariana Islands](/wiki/Mariana_Islands), the [Philippines](/wiki/Philippines), the [Maluku Islands](/wiki/Maluku_Islands), [Sunda Islands](/wiki/Sunda_Islands), [Indochina](/wiki/Indochina), as well as [Pacific Islands](/wiki/Pacific_Island) like the [Tahitians](/wiki/Tahiti). This broad conception of Malay was largely derived from the strong presence of [Malay cultural influence](/wiki/Malay_people#Culture), particularly in [linguistic](/wiki/Malayic_languages), throughout Southeast Asia at the time of European colonisation. The Malay language was one aspect of the prestige of the sultanates in the region, and considered as a language of the educated people in Southeast Asia during the 17th and 18th century. An 18th century European account even suggests that one is not considered a very broadly educated man in the east, if he don't understand [Malay](/wiki/Malay_language). The popularisation of Malay as a racial category was in essence a colonial product, the significant role of which played by the [Spanish](/wiki/Spanish_Empire) since the 17th century and that of the [British](/wiki/British_Empire) since the 18th century in identifying [the Archipelago](/wiki/Maritime_Southeast_Asia) as the Malay world. The view held by [Thomas Stamford Raffles](/wiki/Thomas_Stamford_Raffles) for example, had a significant influence on English-speakers, lasting to the present day. He should probably be regarded as the most important voice in projecting the idea of a 'Malay' race or nation, not limited to the traditional [Raja-Raja Melayu](/wiki/Malay_rulers) or even their supporters, but embracing a large if unspecified part of the Archipelago. [William Marsden](/wiki/William_Marsden_(orientalist)), another British \"merchant-scientist\", classified the inhabitants of the Archipelago as Malays, based on religion ([Islam](/wiki/Islam)), language ([Malay](/wiki/Malay_language)) and origin. ### Malay territoriality in three tiers In the late 19th century, an important innovation was introduced into the political vocabulary of the [Malay language](/wiki/Malay_language). The word *kerajaan*, which had in older times usually meant \"king\", \"royalty\" and \"kingdom\", began to be defined as \"government\". In the same period, the term *negeri* was increasingly being used as a word equivalent to \"state\", in contrast to its earlier use in court texts more in the sense of a 'settlement' than of a political entity. With growing frequency, publications of the 1870s and 1880s employed the term to refer either to individual [Malay sultanates](/wiki/Malay_sultanate) or any political state in the world beyond the Malay territories. [British](/wiki/British_people) historian, [Wilkinson](/wiki/Richard_James_Wilkinson), prefers the term \"state\" to refer to an administrative or territorial unit in the Malay Peninsula in his time, while he uses the word \"kingdom\" or \"sultanate\" for a Malay polity of older times. While Wilkinson often uses \"the Peninsula\" or \"the Malay Peninsula\", he also calls the Peninsula \"[Malaya](/wiki/British_Malaya).\" His use of the word \"Malaya\" occasionally includes not merely the Peninsula under British rule but also its other parts under [Siamese rule](/wiki/Rattanakosin_Kingdom). In referring to [the Archipelago](/wiki/Maritime_Southeast_Asia), Wilkinson not only uses \"the Archipelago\" or \"the Indian Archipelago\", but also \"the Malay world\", which might have more sociocultural connotations. Among the textbooks available during [colonial Malaya](/wiki/British_Malaya), [Winstedt](/wiki/Richard_Olaf_Winstedt)'s *Ilmu Alam Melayu* ('Geography of the Malay world') presents the clearest picture of the territoriality of the Malay community. As expressed in the title, Winstedt attempts to cover most of the Archipelago. He describes not only the British colonies and protectorates in the Malay Peninsula and Borneo, but also the [Netherlands East Indies](/wiki/Netherlands_East_Indies) and the [Philippines](/wiki/Philippines). The structure of *Ilmu Alam Melayu* shows the three-tiered constitution of the Malay world. The Malay world (*Alam Melayu*) is divided into sub-regions, namely, Malaya (*Tanah Melayu*), the [British Borneo](/wiki/British_Borneo) territories, the Netherlands East Indies and the Philippines. Malaya, in turn, is made up of the [Malay states](/wiki/Malay_states) (*Negeri-Negeri Melayu*). It is also important to note the standardization of geographical knowledge in this geography textbook. All states in the peninsula, the main islands and areas of the Netherlands East Indies and all of the Philippines are systematically discussed through the common topics of overview, districts and towns, products, inhabitants and history. Such a systematic and comprehensive catalogue of geographical knowledge helps to convey an image of the Malay world as a territorial entity. [Malay](/wiki/Malay_people) historian Abdul Hadi Haji Hassan, who cites [Winstedt](/wiki/Richard_Olaf_Winstedt)'s textbooks in his *Sejarah 'Alam Melayu* ('History of the Malay world'), had much in common with [Winstedt](/wiki/Richard_Olaf_Winstedt)'s view of the Malay world. According to him, the Malay territories are made up of the Malay states, [Malaya](/wiki/British_Malaya) and the Malay world in general. Of the 12 chapters in the three volumes of Abdul Hadi's textbook, four chapters focus on the history of the [Malays](/wiki/Ethnic_Malays) in [Malaya](/wiki/British_Malaya), while other chapters deal with the history of the Malays in the Malay world generally. It ought to be added that the history of each colony or state (*negeri*) in the [Straits Settlements](/wiki/Straits_Settlements) and the [Federated Malay States](/wiki/Federated_Malay_States) is explained in the fourth and the fifth volumes of the book written by another Malay historian, [Buyong Adil](/wiki/Buyong_Adil) in 1934 and 1940. Thus, both British and Malay authors conceptualised Malay territoriality in three tiers, that is, the [Malay states](/wiki/Malay_states), [Malaya](/wiki/British_Malaya) and the Malay world. ### Malay nationalism The standardisation of geographical knowledge and systematic quantification, served to objectify the territoriality of the Malay community. Early authors in Malaya also developed a Malaya-centric view on the subject, proclaiming Malaya or *Tanah Melayu* as the focal point of the Malay territories. This view reflected the substantialisation of the colonial territorial boundary and provided new objectification of space seems to have played an important role in conceiving a potential national territory. It is probable that these three territorial identities, namely, Malay states, Malaya and the Malay world had much to do with the strands of [Malay nationalism](/wiki/Malay_nationalism). On the one hand, in the late 1930s, Malay aristocrats and their supporters began to organize Malay state associations. For them, Malay states were the focus of territorial identity. In postwar Malaya, these state-based Malay associations were dissolved into a Malaya-based Malay political party, that is, the [United Malays National Organisation](/wiki/United_Malays_National_Organisation). Their territorial identity was gradually shifted from Malay states to Malaya or *[Tanah Melayu](/wiki/Persekutuan_Tanah_Melayu)*. On the other hand, in the late 1930s, some Malay non-aristocrat intellectuals formed a pan-Malay-oriented association, that is, [Kesatuan Melayu Muda](/wiki/Kesatuan_Melayu_Muda) or Young Malay Union. As shown by its president, [Ibrahim Hj Yaacob](/wiki/Ibrahim_Hj_Yaacob), the territorial stretch of their imagined homeland covered the Malay world or the [Malay Archipelago](/wiki/Malay_Archipelago) as a whole. ## Modern conception Although the extended notions of Malay world still gained widespread currency, such conceptualisation is sometimes described in other terms, perceived as more 'neutral', like [Nusantara](/wiki/Nusantara_(archipelago)), [Indonesian archipelago](/wiki/Indonesian_archipelago), and [Maritime Southeast Asia](/wiki/Maritime_Southeast_Asia). New approaches have also been taken by modern authors to redefine the 'Malay world', by taking into account the historic political pattern of the region, in addition to the existing racial-linguistic spread model. In this context, modern authors in Malay studies like [Anthony Milner](/wiki/Anthony_Milner_(historian)), Geoffrey Benjamin, and Vivienne Wee provide a narrower definition, reducing the concept into a political and [cultural area](/wiki/Cultural_area). Benjamin for example, describes the concept in an historically responsive manner to refer to the areas currently or formerly falling under *Kerajaan Melayu* ('Malay kingdoms'), the rule of a Malay king. It does not refer to [Insular Southeast Asia](/wiki/Insular_Southeast_Asia) at large, and certainly not the [Austronesian](/wiki/Austronesian_people)-speaking world as a whole, both of which are usages of Malay world that have crept into scholarly discourse. In this sense, the Malay world refers to various kingdoms and their attendant hinterlands that have existed or still exist along the coasts of [Brunei](/wiki/Brunei), the east coast of [Sumatra](/wiki/Sumatra) and on the [Malay Peninsula](/wiki/Malay_Peninsula). This limited conceptualisation of Malay world was also espoused by Wee. She added further, that the concept is a spatial configuration that resulted from the serial patterning of political alliances, unified by *[Sejarah Melayu](/wiki/Sejarah_Melayu)*, that is a particular genealogical tree of kingship. The other, non-Malay areas would be those where the rulers did not claim to belong to this particular genealogical tree. For example, [Aceh](/wiki/Aceh) is located on the northern tip of the [Sumatran](/wiki/Sumatran) mainland, yet the rulers evidently did not claim to belong to the Malay genealogical tree. And indeed Aceh is generally not regarded as part of *Alam Melayu*. On the contrary, both the indigenous and foreign texts indicate that Aceh, similar to [Java](/wiki/Java), was an historical enemy of *Alam Melayu*. Hence to locate oneself within *Alam Melayu* is to claim membership in a specific network of political alliances. - [Malayness](/wiki/Malayness) - *[Pribumi](/wiki/Native_Indonesians)* - *[Bumiputera](/wiki/Bumiputera_(Malaysia))* - [Malayisation](/wiki/Malayisation) - [Malay Archipelago](/wiki/Malay_Archipelago) - [Malay Peninsula](/wiki/Malay_Peninsula) - [Indonesian Archipelago](/wiki/Indonesian_Archipelago) - [East Indies](/wiki/East_Indies) - [Dutch East Indies](/wiki/Dutch_East_Indies) - [Spanish East Indies](/wiki/Spanish_East_Indies) - [East Indies Company](/wiki/East_India_Company) - [Malay race](/wiki/Malay_race) - [Greater Indonesia](/wiki/Greater_Indonesia) - [Maphilindo](/wiki/Maphilindo) ## Notes ## Bibliography - [Andaya, Leonard Y.](/wiki/Leonard_Andaya) (2008), *Leaves of the Same Tree: Trade and Ethnicity in the Straits of Melaka*, New York: University of Hawaii press, [ISBN](/wiki/ISBN_(identifier)) 978-0-8248-3189-9 - [Andaya, Barbara W.](/wiki/Barbara_Watson_Andaya); [Andaya, Leonard Y.](/wiki/Leonard_Andaya) (1984), *A History of Malaysia*, London: Palgrave Macmillan, [ISBN](/wiki/ISBN_(identifier)) 978-0-312-38121-9 - Barnard, Timothy P. (2004), *Contesting Malayness: Malay identity across boundaries*, Singapore: Singapore University press, [ISBN](/wiki/ISBN_(identifier)) 9971-69-279-1 - Bakar, Abdul Latiff Abu, ed. (1987), *Puisi-Puisi Kebangsaan 1913-1957*, Kuala Lumpur: Dewan Bahasa dan Kebangsaan - Benjamin, Geoffrey; Chou, Cynthia (2002), *Tribal Communities in the Malay World: Historical, Cultural and Social Perspectives*, Institute of Southeast Asian Studies, [ISBN](/wiki/ISBN_(identifier)) 978-981-230-166-6 - Bunnell, Tim (2004), \"From nation to networks and back again: Transnationalism, class and national identity in Malaysia\", *State/Nation/Transnation: Perspectives on Transnationalism in the Asia Pacific*, Routledge, [ISBN](/wiki/ISBN_(identifier)) 0-415-30279-X - Coedes, George (1968), *The Indianized states of Southeast Asia*, Australian National University Press, [ISBN](/wiki/ISBN_(identifier)) 0708101402 - [Cordier, Henri](/wiki/Henri_Cordier) (2009), *Ser Marco Polo; notes and addenda to Sir Henry Yule's edition, containing the results of recent research and discovery*, Bibliolife, [ISBN](/wiki/ISBN_(identifier)) 978-1-110-77685-6 - Deka, Phani (2007), *The great Indian corridor in the east*, Mittal Publications, [ISBN](/wiki/ISBN_(identifier)) 978-81-8324-179-3 - [Esposito, John Louis](/wiki/John_Esposito) (1999), *The Oxford History of Islam*, New York: Oxford University Press, [ISBN](/wiki/ISBN_(identifier)) 978-0-19-510799-9 - Farrer, Douglas. S (2009), *Shadows of the Prophet: Martial Arts and Sufi Mysticism*, Springer, [ISBN](/wiki/ISBN_(identifier)) 978-1-4020-9355-5 - Malaysian Branch of the Royal Asiatic Society (1923), \"Malayan languages\", *[Journal of the Malaysian Branch of the Royal Asiatic Society](/wiki/Journal_of_the_Malaysian_Branch_of_the_Royal_Asiatic_Society)*, **III** - [Gerini, Gerolamo Emilio](/wiki/Gerolamo_Emilio_Gerini) (1974), *Researches on Ptolemy's geography of eastern Asia (further India and Indo-Malay archipelago)*, New Delhi: Oriental Books Reprint Corporation, [OCLC](/wiki/OCLC_(identifier)) 1068575751 - Gibson-Hill, C. A. (July 1953). \"Notes on the old Cannon found in Malaya, and known to be of Dutch origin\". *Journal of the Malayan Branch of the Royal Asiatic Society*. **26** (1): 145–174. [JSTOR](/wiki/JSTOR_(identifier)) 41502911. - Gopal, Lallanji (2000), *The economic life of northern India: c. A.D. 700–1200*, Motilal Banarsidass, [ISBN](/wiki/ISBN_(identifier)) 978-81-208-0302-2 - [Hall, Daniel George Edward](/wiki/D.G.E._Hall) (1981), *History of South East Asia*, Macmillan, [ISBN](/wiki/ISBN_(identifier)) 978-0-333-24163-9 - [I Ching](/wiki/I_Ching_(monk)) (2005), [Takakusu, Junjiro](/wiki/Takakusu_Junjiro) (ed.), *A Record of the Buddhist Religion As Practised in India and the Malay Archipelago (A.D. 671–695)*, Asian Educational Services, [ISBN](/wiki/ISBN_(identifier)) 978-81-206-1622-6 - Melebek, Abdul Rashid; Moain, Amat Juhari (2006), *Sejarah Bahasa Melayu (\"History of the Malay Language\")*, [Utusan Publications & Distributors](/wiki/Utusan_Malaysia), [ISBN](/wiki/ISBN_(identifier)) 978-967-61-1809-7 - [Milner, Anthony](/wiki/Anthony_Milner_(historian)) (1982), *Kerajaan: Malay Political Culture on the Eve of Colonial Rule*, University of Arizona Press, [ISBN](/wiki/ISBN_(identifier)) 978-0-8165-0772-6 - [Milner, Anthony](/wiki/Anthony_Milner_(historian)) (2010), *The Malays (The Peoples of South-East Asia and the Pacific)*, Wiley-Blackwell, [ISBN](/wiki/ISBN_(identifier)) 978-1-4443-3903-1 - Mohd Fauzi Yaacob (2009), *Malaysia: Transformasi dan perubahan sosial*, Kuala Lumpur: Arah Pendidikan Sdn Bhd, [ISBN](/wiki/ISBN_(identifier)) 978-967-323-132-4 - Mohamed Anwar Omar Din (2011), *Asal Usul Orang Melayu: Menulis Semula Sejarahnya (The Malay Origin: Rewrite Its History)*, Jurnal Melayu, [Universiti Kebangsaan Malaysia](/wiki/Universiti_Kebangsaan_Malaysia), retrieved 4 June 2012 - Mohamed Anwar Omar Din (2012), \"Legitimacy of the Malays as the Sons of the Soil\", *Asian Social Science*, Canadian Center of Science and Education, [ISSN](/wiki/ISSN_(identifier)) 1911-2025 - [Mukerjee, Radhakamal](/wiki/Radhakamal_Mukerjee) (1984), *The culture and art of India*, Coronet Books Inc, [ISBN](/wiki/ISBN_(identifier)) 978-81-215-0114-9 - Muljana, Slamet (1981), *Kuntala, Sriwijaya Dan Suwarnabhumi* (in Indonesian), Jakarta: Yayasan Idayu, [OCLC](/wiki/OCLC_(identifier)) 565235680 - Ooi, Keat Gin (2009), *Historical Dictionary of Malaysia*, Scarecrow Press, [ISBN](/wiki/ISBN_(identifier)) 978-0-8108-6305-7 - [Pande, Govind Chandra](/wiki/Govind_Chandra_Pande) (2006). *India's Interaction with Southeast Asia: History of Science, Philosophy and Culture in Indian Civilization, Vol. 1, Part 3*. Munshiram Manoharlal. [ISBN](/wiki/ISBN_(identifier)) 978-81-87586-24-1. - [Reid, Anthony](/wiki/Anthony_Reid_(academic)) (2010), *Imperial alchemy : nationalism and political identity in Southeast Asia*, Cambridge University Press, [ISBN](/wiki/ISBN_(identifier)) 978-0-521-87237-9 - [Reid, Anthony](/wiki/Anthony_Reid_(academic)) (2001), \"Understanding Melayu (Malay) as a Source of Diverse Modern Identities\", *Journal of Southeast Asian Studies*, **32** (3), Cambridge University Press: 295–313, [doi](/wiki/Doi_(identifier)):10.1017/s0022463401000157, [ISSN](/wiki/ISSN_(identifier)) 1474-0680, [PMID](/wiki/PMID_(identifier)) 19192500, [S2CID](/wiki/S2CID_(identifier)) 38870744 - Sarkar, Himansu Bhusan (1970), *Some contributions of India to the ancient civilisation of Indonesia and Malaysia*, Calcutta: Punthi Pustak, [ISBN](/wiki/ISBN_(identifier)) 978-0-19-580302-0 - Roff, William R. (1974), *The Origins of Malay Nationalism* (2nd ed.), Kuala Lumpur: Penerbit Universiti Malaya - [S. Pathmanathan](/wiki/S._Pathmanathan) (2006), *Hindu temples of Sri Lanka*, Colombo Kumaran Book House, [ISBN](/wiki/ISBN_(identifier)) 9559429914 - Sneddon, James N. (2003), *The Indonesian language: its history and role in modern society*, University of New South Wales Press, [ISBN](/wiki/ISBN_(identifier)) 0-86840-598-1 - Soda, Naoki (2001), \"The Malay World in Textbooks: The Transmission of Colonial Knowledge in British Malaya\", *Southeast Asian Studies*, **39**, Center for Southeast Asian Studies, [Kyoto University](/wiki/Kyoto_University), [hdl](/wiki/Hdl_(identifier)):2433/56780 - Tirtosudarmo, Riwanto (2005), *The Orang Melayu and Orang Jawa in the 'Lands Below the Winds*, Centre for research on inequality, human security and ethnicity, retrieved 21 June 2010 - Wee, Vivienne (1985), *Melayu : hierarchies of being in Riau*, [Australian National University](/wiki/Australian_National_University), [doi](/wiki/Doi_(identifier)):10.25911/5d78d8ed021e0, [hdl](/wiki/Hdl_(identifier)):1885/9923 - Wright, Thomas (2004), *The travels of Marco Polo, the Venetian: the translation of Marsden revised, with a selection of his notes*, Kessinger Publishing, LLC, [ISBN](/wiki/ISBN_(identifier)) 978-1-4191-8573-1 - Malay Concordance Project, contains resources for Malay literatures, especially classical Malay literatures\n",
  "language": "en",
  "processed_at": "2026-01-12T11:28:38.894388",
  "title": "Malay world",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Malay_world"
}