{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:28:45.055572"
  },
  "content": "Left-wing political party in Malaya The **Malayan Democratic Union** was a [left-wing](/wiki/Left-wing) [socialist](/wiki/Socialism) political party active in [British Malaya](/wiki/British_Malaya) from 1945 to 1948. It was founded by English-educated intellectuals and advocated for the independence of British Malaya as a single entity inclusive of [Singapore](/wiki/Singapore). ## History There exists differing accounts of the party's origins, although it is generally accepted that it was first conceived by its leaders while under Japanese internment in occupied Malaya. Two contradictory accounts have been provided by Gerald de Cruz, who claimed that he had been approached by Wu Tian Wang, a member of the [Malayan Communist Party](/wiki/Malayan_Communist_Party), to initiate the party's founding, and later that the party had been conceived by Lim Hong Bee and the Malayan Communist Party during Lim's involvement with the Communist-led [Malayan Peoples' Anti-Japanese Army](/wiki/Malayan_Peoples%27_Anti-Japanese_Army) in [Endau](/wiki/Endau), [Johor](/wiki/Johor). Other accounts, including those of party chairman Philip Hoalim Sr., repudiated any claims of Communist influence in the party's founding. The party adopted a moderate and liberal attitude at its inception and called for, among other things, a self-governing democratic Malaya within the [British Commonwealth](/wiki/Commonwealth_of_Nations). It was broadly in support of the [Malayan Union](/wiki/Malayan_Union), which united the [federated](/wiki/Federated_Malay_States) and [unfederated Malay States](/wiki/Unfederated_Malay_States), and the [Straits Settlements of Malacca and Penang](/wiki/Straits_Settlements) into a single entity, and of the union's accompanying liberal citizenship scheme on the condition that Singapore be included in any such union. However, the Malayan Union faced significant opposition from [Malay nationalists](/wiki/Early_Malay_nationalism) who engaged in clandestine negotiations with British administrators to produce new constitutional proposals that would restore the sovereignty of Malay rulers and introduce a more restrictive citizenship scheme. In opposition to the Anglo-Malay constitution, the Malayan Democratic Union alongside other parties and organisations formed the [All-Malaya Council of Joint Action](/wiki/All-Malaya_Council_of_Joint_Action) (AMCJA), which styled itself the sole representative body of \"domiciled Malays and non-Malays\", and sought to engage in direct negotiations with the British government for a more democratic constitution. The efforts of the party through the AMCJA to push through a more equitable constitution, including through a [hartal](/wiki/Hartal) in October 1947, were unsuccessful. The party was voluntarily dissolved in June 1948 at the beginning of the [Malayan Emergency](/wiki/Malayan_Emergency), when its leaders heard rumours that the colonial government was considering taking action against it. The party was generally considered to have been strongly influenced by and acted as a [communist front](/wiki/Communist_front) owing to the presence of Malayan Communist Party members in its central committee from May 1948 onwards, as well as the two parties' close cooperation as part of the AMCJA. ### Citations\n",
  "language": "en",
  "processed_at": "2026-01-12T11:28:45.055214",
  "title": "Malayan Democratic Union",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Malayan_Democratic_Union"
}