{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:28:58.070527"
  },
  "content": "Policy opposing discrimination against non-Malay populations**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **may need to be rewritten** to comply with Wikipedia's quality standards. Relevant discussion may be found on the talk page. You can help. The talk page may contain suggestions. *(December 2025)*This article's lead section **may need to be rewritten**. Please review the lead guide and help improve the lead of this article if you can. *(December 2025)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)*[Politics of Malaysia](/wiki/Politics_of_Malaysia)[Head of State](/wiki/Monarchies_of_Malaysia) - **[Yang di-Pertuan Agong](/wiki/King_of_Malaysia)** - [Ibrahim Iskandar](/wiki/Ibrahim_Iskandar_of_Johor) - [Conference of Rulers](/wiki/Conference_of_Rulers) [Legislature](/wiki/Parliament_of_Malaysia) - **[Parliament of Malaysia](/wiki/Parliament_of_Malaysia)** - [15th Parliament](/wiki/Members_of_the_Dewan_Rakyat,_15th_Malaysian_Parliament) - **[Senate (Dewan Negara)](/wiki/Dewan_Negara)** - [President](/wiki/President_of_the_Dewan_Negara) [Awang Bemee Awang Ali Basah](/wiki/Awang_Bemee_Awang_Ali_Basah) - **[House of Representatives (Dewan Rakyat)](/wiki/Dewan_Rakyat)** - [Speaker](/wiki/Speaker_of_the_Dewan_Rakyat) [Johari Abdul](/wiki/Johari_Abdul) - [Leader of the Government](/wiki/Prime_Minister_of_Malaysia) [Anwar Ibrahim](/wiki/Anwar_Ibrahim) - [Leader of the Opposition](/wiki/Leader_of_the_Opposition_(Malaysia)) [Hamzah Zainudin](/wiki/Hamzah_Zainudin) [Executive](/wiki/Government_of_Malaysia#Executive) - **[Cabinet](/wiki/Cabinet_of_Malaysia)** - [Prime Minister](/wiki/Prime_Minister_of_Malaysia) [Anwar Ibrahim](/wiki/Anwar_Ibrahim) - **[Civil service](/wiki/Civil_service_in_Malaysia)** ([agencies](/wiki/List_of_federal_ministries_and_agencies_in_Malaysia)) - [Chief Secretary](/wiki/Chief_Secretary_to_the_Government_of_Malaysia) [Shamsul Azri Abu Bakar](/wiki/Shamsul_Azri_Abu_Bakar) [Judiciary](/wiki/Judiciary_of_Malaysia) - **[Federal Court](/wiki/Federal_Court_of_Malaysia)** - [Chief Justice](/wiki/Chief_Justice_of_Malaysia) [Wan Ahmad Farid Wan Salleh](/wiki/Wan_Ahmad_Farid_Wan_Salleh) - **[Court of Appeal](/wiki/Court_of_Appeal_of_Malaysia)** - [President](/wiki/President_of_the_Court_of_Appeal_of_Malaysia) Zabariah Mohd Yusof *(acting)* - **[High Court in Malaya ∙ High Court in Sabah and Sarawak](/wiki/High_court_(Malaysia))** - [Chief Judge of Malaya](/wiki/Chief_Judge_of_Malaya)[Hasnah Mohammed Hashim](/wiki/Hasnah_Mohammed_Hashim) - [Chief Judge of Sabah and Sarawak](/wiki/Chief_Judge_of_Sabah_and_Sarawak)Abdul Rahman Sebli [Elections](/wiki/Elections_in_Malaysia) - **[Election Commission of Malaysia](/wiki/Election_Commission_of_Malaysia)** - [General elections](/wiki/Elections_in_Malaysia): (/wiki/2022_Malaysian_general_election) - [Electoral districts](/wiki/List_of_Malaysian_electoral_districts) [Political parties](/wiki/List_of_political_parties_in_Malaysia) - [BN](/wiki/Barisan_Nasional) - [PH](/wiki/Pakatan_Harapan) - [PN](/wiki/Perikatan_Nasional) - [GPS](/wiki/Gabungan_Parti_Sarawak) - [GRS](/wiki/Gabungan_Rakyat_Sabah) [List of political parties in Malaysia](/wiki/List_of_political_parties_in_Malaysia)[Federalism](/wiki/Federalism_in_Malaysia) - **[State governments](/wiki/State_governments_in_Malaysia)** - [Chief ministers of the states](/wiki/Chief_ministers_in_Malaysia) - [State legislatures](/wiki/State_legislative_assemblies_of_Malaysia) ([members](/wiki/List_of_Malaysian_State_Assembly_Representatives_(2018%E2%80%93))) - **[Local governments](/wiki/Local_government_in_Malaysia)** ([list](/wiki/List_of_local_governments_in_Malaysia)) Ideologies and concepts - [Anarchism](/wiki/Anarchism_in_Malaysia) - [Communism](/wiki/Communism_in_Malaysia) - [Conservatism](/wiki/Conservatism_in_Malaysia) - [Feminism](/wiki/Feminism_in_Malaysia) - *[Rukun Negara](/wiki/Rukun_Negara)* - [Malay nationalism](/wiki/Early_Malay_nationalism) - [Reformasi](/wiki/Reformasi_(Malaysia)) - [Islam Hadhari](/wiki/Islam_Hadhari) - [Asian values](/wiki/Asian_values) **Race and politics** - [Dayaks in politics](/wiki/Dayaks_in_politics) - *[Ketuanan Melayu](/wiki/Ketuanan_Melayu)* - [*Bumiputera*](/wiki/Bumiputera_(Malaysia)) - Malaysian Malaysia - [Social contract](/wiki/Social_contract_(Malaysia)) - Malaysia portal - Politics portal - [Other countries](/wiki/Outline_of_political_science#Politics_by_region) - v - t - e ***Malaysian Malaysia*** was a phrase used to support the idea of Malaysia as a country for all Malaysians, as opposed to emphasising [affirmative action](/wiki/Affirmative_action) to support the [Malay ethnic group](/wiki/Malays_(ethnic_group)). \"Malaysian Malaysia\", first used in the mid-1960s, was the rallying [motto](/wiki/Motto) of the [Malaysian Solidarity Convention](/wiki/Malaysian_Solidarity_Convention), a coalition of political parties led by [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) of the [People's Action Party](/wiki/People%27s_Action_Party) (PAP) that served as an opposition bloc to the governing [Alliance Party](/wiki/Alliance_Party_(Malaysia)). Although Lee Kuan Yew did not object to the special rights of the Malays as accorded in [Article 153 of the Federal Constitution](/wiki/Article_153_of_the_Constitution_of_Malaysia) (which allows for special [quotas](/wiki/Quota_Share) to be allocated to the [Malays](/wiki/Malays_(ethnic_group)) and other [indigenous peoples](/wiki/Demographics_of_Malaysia#Ethnolinguistic_groups) of Malaysia in admission to the public service, awarding of public scholarships, admission to public education institutions and the awarding of trade licences), he disagreed with the approach of the Alliance Party on the basis that Malay special rights alone could not solve the problem of Malay poverty. This difference in approach can be seen in Article 89 of the State Constitution of Singapore (now Article 152 (2) of the Constitution of the Republic of Singapore) which states that the Malays are in a special position as the indigenous people of Singapore and that the Government of Singapore has a duty to safeguard their interests. Although special rights with respect to certain quotas are not specifically listed, the government still provided free education to all from primary education up until university. The rationale for [affirmative action](/wiki/Affirmative_action) was due to the Malays and other indigenous people in Malaysia being marginalised by the British, throughout [British colonial rule](/wiki/British_Empire) in [Malaya](/wiki/British_Malaya) and [Borneo](/wiki/British_Borneo). Britain gradually colonised the predecessor entities of Malaysia from 1786 to 1957 after the [Anglo-Dutch Treaty of 1824](/wiki/Anglo-Dutch_Treaty_of_1824). During these years, the British declined to employ and resettle Malays away from their traditional [villages](/wiki/Village), as they preferred to harvest nearby [paddy fields](/wiki/Paddy_field#Malaysia) and engage in [artisanal fishing](/wiki/Artisanal_fishing) and were reluctant to work and move to new [settlements](/wiki/Human_settlement) around the then-newly formed [tin mines](/wiki/Mining_in_Malaysia) and [rubber plantations](/wiki/Rubber_industry_in_Malaysia). As a result, the British preferred to import and employ [Chinese](/wiki/Malaysian_Chinese) and [Indian](/wiki/Malaysian_Indians) emigrants instead, thus preventing any relocation or lifestyle disturbances to the Malays and other aborigines. The State Government of Singapore and the Federal Government of Malaysia both agreed that the economic status of the Malays had to be alleviated, but disagreed on the approach. Although Lee Kuan Yew supported [Tunku Abdul Rahman](/wiki/Tunku_Abdul_Rahman), [Abdul Razak Hussein](/wiki/Abdul_Razak_Hussein) and other primary leaders of UMNO who wanted a gradual transition to non-communal politics, he was wary of the secondary leaders of UMNO, who he believed used Malay special rights as a [red herring](/wiki/Red_herring) to divide the population along racial lines. He believed that special quotas allocated to Malays concerning licenses and the creation of a \"Malay capitalist class\" would only benefit the aristocrats from elite Malay families. Lee believed that the problems of Malay farmers could be solved by education and by raising the standards of Malay farms, such that the profession could be considered lucrative like in [Australia](/wiki/Australia) and [New Zealand](/wiki/New_Zealand). He also argued that if the focus was solely on creating a Malay capitalist class, it would only lead to a widening of the economic gap both within the Malay community and with other communities, which would lead to non-Malays being used as scapegoats.[*citation needed*] The ultra Malay nationalists, or 'ultras' as coined by Lee Kuan Yew, were operating based on the old demographics of the Federation of Malaya, where Malays made up 65% of the vote, when in fact the demographics after the formation of Malaysia were roughly 40% Malays, 40% Chinese, 20% Indians, Eurasians and others. Additionally, Singapore, Sabah and Sarawak constituted about 35% of the seats in [Parliament](/wiki/Parliament_of_Malaysia). Due to this state of affairs, Lee Kuan Yew decided to rally the parties from the [Borneo States of Sabah and Sarawak](/wiki/East_Malaysia) along with like-minded parties in the [States of Malaya](/wiki/Peninsular_Malaysia) like Penang and Malacca under the Malaysian Solidarity Convention using 'Malaysian Malaysia' as a slogan to counter the communal politics of the ultras.[*citation needed*] In 1965, Singapore was ejected from Malaysia, and affirmative action for Malays was strengthened through policies such as the [New Economic Policy](/wiki/Malaysian_New_Economic_Policy). Critics have described such affirmative action as [racial discrimination](/wiki/Racial_discrimination) against other Malaysian citizens, aimed at promoting *[ketuanan Melayu](/wiki/Ketuanan_Melayu)* (Malay supremacy). \"Malaysian Malaysia\" is not a mere [tautology](/wiki/Tautology_(rhetoric)), as it distinguishes between [nationality](/wiki/Nationality) and ethnic classification. The complaint was that Malaysia was not being \"Malaysian\" and [egalitarian](/wiki/Egalitarianism) (due to discrimination against non-Malays) but was instead being an [ethnocentric](/wiki/Ethnocentrism) \"Malay Malaysia.\" ## Early use The phrase \"Malaysian Malaysia\" is widely associated with [Lee Kuan Yew](/wiki/Lee_Kuan_Yew), then leader of the [Singapore](/wiki/Singapore_in_Malaysia)-based [People's Action Party](/wiki/People%27s_Action_Party) (PAP), the prime constituent in the Malaysian Solidarity Convention, who was foremost a critic against the raced-based economic policy.[*citation needed*] In a speech, Lee argued that operating based on race was no substitute for sound economic policy. While he acknowledged that the Malay economic status had to be alleviated, he believed that a racial approach alone would not lead to efficient distribution of wealth across the rural class of Malays as anyone could constitutionally become a Malay by professing the religion of Islam and practice Malay customs, whether they were from Malaya or not: \"According to history, the [Perak Man](/wiki/Perak_Man) was believed to survive in Malaysia 10,000 years ago and more skeletons were found in Sarawak indicating the human living there since 3,000 – 4,000 years ago. Of the 50.1% percent Malays in Malaysia today, about one-third are comparatively new immigrants like the secretary-general of UMNO, Dato' [Syed Ja'afar Albar](/wiki/Syed_Ja%27afar_Albar), who came to Malaya from [Indonesia](/wiki/Indonesia) just before the war at the age of more than thirty. Therefore, the supporters of \"Malaysian Malaysia\" argue that it is wrong and illogical for a particular ethnic group to think that they are more entitled to be called Malaysians than others, and that the others can become Malaysian only through their favour.\" Lee still believed in affirmative action for indigenous Malays, he believed that it was folly to demonise non-Malays as a crutch to win Malay support as the demographics of Malaysia were more balanced instead of the old Federation of Malaya. He asserted that using special rights as a crutch would open up a lot of loopholes which would inevitably lead to a racial and class segregation in the population which would be detrimental to Malaysia as it could be exploited to benefit the elite Malay aristocrats.[*citation needed*] The campaign for a \"Malaysian Malaysia\" was not viewed highly by the government of Malaysia and the parties in the ruling coalition of the [Alliance](/wiki/Barisan_Nasional) (later the Barisan Nasional). Those against the concept of a Malaysian Malaysia cited the fact that Malaya was progressively colonised by the British from the mid-19th century to its height in 1926. During this period, a large number of immigrant labourers, including [Chinese](/wiki/Han_Chinese) and Indian peoples, came to Malaysia and Singapore. They suggest that during the colonial era, the Malays were forced to accommodate other peoples.[*citation needed*] Those historic immigrants and their descendants allowed to remain after the nation achieved independence should understand their presence was a privilege, not a right. Such people said that the influx of immigrants had negatively affected the rights and resources of the Malays. The argument was made in spite of the existence of Malay-Chinese [Peranakans](/wiki/Peranakan) since the late 18th century, as well as regular Chinese merchant presence in Malaya long before the arrival of the British. However, the Alliance and the PAP both wanted gradual integration of a Malaysian nation, the subtle difference was in emphasis and speed. The Alliance focused on the cultural emphasis, bringing the non-Malays into the norms of the Malays through the speaking of the national language which will precipitate a national identity. The PAP focused on the economic emphasis, helping the Malays compete with the non-Malays through sound economic policy with the focus on the new Malaysian consciousness.[*citation needed*] Neither disagreed on the fundamentals (national language, special position of the Malays) but disagreed with the other on accent and timing.[*citation needed*] The political mudslinging eventually provoked a response from a segment of politicians in the [United Malays National Organisation](/wiki/United_Malays_National_Organisation) (UMNO) who thought Malaysian Malaysia threatened the [Malays](/wiki/Malays_(ethnic_group))' special position in Malaysia. They considered Lee to be a dangerous and seditious trouble-maker; one politician called him a traitor to the country. The more moderate [Prime Minister of Malaysia](/wiki/Prime_Minister_of_Malaysia), [Tunku Abdul Rahman](/wiki/Tunku_Abdul_Rahman), was perturbed by the campaign. He thought it would lead to trouble, as he believed that the Malays were not ready to compete without their special privileges. Singapore was ejected from the Federation in 1965.[*citation needed*] ## Contemporary use In 1999, controversy was reignited when [Lim Kit Siang](/wiki/Lim_Kit_Siang) of the [Democratic Action Party](/wiki/Democratic_Action_Party) (DAP, the former Malaysian branch of the PAP) called for a second campaign for a \"Malaysian Malaysia\". Then acting UMNO Youth Chief [Hishamuddin Hussein](/wiki/Hishamuddin_Hussein) responded by warning not to \"play with fire,\" and accused Lim of politicising an issue that had been decided at independence with the [social contract](/wiki/Social_contract_(Malaysia)). Lim argued that the concept of a Malaysian Malaysia did not differ much from the government policy of establishing a *[Bangsa Malaysia](/wiki/Bangsa_Malaysia)* (Malaysian race or Malaysian nation). Some noted that Hishamuddin's grandfather, Dato' [Onn Jaafar](/wiki/Onn_Jaafar), the founder of UMNO, had left the party to form the [Independence of Malaya Party](/wiki/Independence_of_Malaya_Party) based on the concept of eliminating special privileges for the Malays.[*citation needed*] In 2006, at the Johor UMNO convention, Johor's [Menteri Besar](/wiki/Menteri_Besar_of_Johor) (Chief Minister) [Abdul Ghani Othman](/wiki/Abdul_Ghani_Othman) linked the \"Malaysian Malaysia\" campaign to those advocating the *[Bangsa Malaysia](/wiki/Bangsa_Malaysia)* concept, insinuating that *Bangsa Malaysia* was a threat to the Bumiputra/Malay privileges granted under [Article 153](/wiki/Article_153_of_the_Constitution_of_Malaysia) of the [Constitution](/wiki/Constitution_of_Malaysia). However, others criticised Ghani, with Deputy Prime Minister [Najib Tun Razak](/wiki/Najib_Tun_Razak) stating: \"It (*Bangsa Malaysia*) does not question the special rights of the Malays, our quota or anything of that sort.\" In 2023, UMNO Supreme Council member [Nur Jazlan Mohamed](/wiki/Nur_Jazlan_Mohamed) called for DAP to drop the slogan “Malaysian Malaysia” from its constitution if it wants to gain support from the Malays. UMNO was in a coalition government with DAP when this statement was made. ## 1Malaysia concept This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Malaysian Malaysia\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(June 2012)* *(Learn how and when to remove this message)* [1Malaysia](/wiki/1Malaysia) or One Malaysia (Malay: Satu Malaysia) is a Malaysian idea introduced by the sixth Malaysian prime minister, [Najib Razak](/wiki/Najib_Razak) on 5 April 2009. The main motto is People First; Performance Now (Rakyat Didahulukan, Pencapaian Diutamakan). Najib Razak explained the concept of 1Malaysia as: \"We stand, we think and act as a Malaysia race. And we take actions based on the needs of all ethnic groups in our country; (\"Kita berdiri, kita berfikir dan bertindak sebagai bangsa Malaysia. Dan kita mengambil tindakan-tindakan berdasarkan kehendak semua kumpulan etnik dalam negara kita;). While 1Malaysia does not seek to do away with Article 153 of the Constitution it does place a strong emphasis on protecting the rights and welfare of non-Malays. The 1Malaysia concept is to harmonise citizens of the country regardless of race without changing its racial identity. - Adam, Ramlah binti, Samuri, Abdul Hakim bin & Fadzil, Muslimin bin (2004). *Sejarah Tingkatan 3*. [Dewan Bahasa dan Pustaka](/wiki/Dewan_Bahasa_dan_Pustaka). [ISBN](/wiki/ISBN_(identifier)) 983-62-8285-8. - Goh, Jenny (23 July 1997). \"Small spark can create big mess\". *[Straits Times](/wiki/Straits_Times)*. - \"'Impossible to co-operate with Singapore while Lee is Premier'\". (2 June 1965). *[Straits Times](/wiki/Straits_Times)*. - Khaw, Ambrose (1998). \"This man is making too much noise\". Retrieved 16 November 2005. - Lim, Kit Siang (1999). \"Advice to Hishammuddin to abhor the old politics of bigotry and fear and set an example of the new politics of reason in Malaysia on the threshold of a new millennium\". Retrieved 22 October 2004. - Wong, Douglas (21 May 1999). \"Call for a 'New Malaysia'\". *[Straits Times](/wiki/Straits_Times)*. Portals: - Malaysia - Politics\n",
  "language": "en",
  "processed_at": "2026-01-12T11:28:58.070081",
  "title": "Malaysian Malaysia",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Malaysian_Malaysia"
}