{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:28:58.563788"
  },
  "content": "Ethnic groupEthnic group **Malaysians in Singapore** refers to [citizens](/wiki/Malaysians) of [Malaysia](/wiki/Malaysia) or [Singaporean](/wiki/Singaporeans) citizens of Malaysian origin residing in [Singapore](/wiki/Singapore). According to the [United Nations Department of Economic and Social Affairs](/wiki/United_Nations_Department_of_Economic_and_Social_Affairs), the community had a population of 1,132,924 in 2020, making them the world's largest [Malaysian diaspora](/wiki/Malaysian_diaspora) community. The community is also the largest foreign community in Singapore, constituting 44% of the country's foreign-born population and an additional 350,000 Malaysians cross the [Johor–Singapore Causeway](/wiki/Johor%E2%80%93Singapore_Causeway) daily for work and school in the city-state. Many Malaysians in Singapore are usually expatriates, working in various industries of the Singaporean economy since its rapid industrialisation in the 1970s. Malaysia and Singapore sharing similar historical and cultural roots and as well as cross-border familial ties, are some of the reasons for the huge community of Malaysians in the country. Other reasons include the country's proximity to Malaysia and the high exchange rate of the [Singapore dollar](/wiki/Singapore_dollar) over the [Malaysian ringgit](/wiki/Malaysian_ringgit). ## History With both Malaysia and Singapore being part of [British Malaya](/wiki/British_Malaya) during the British colonial rule, the people of both countries share similar cultural and historic roots, with similar multiracial populations consisting of [Malays](/wiki/Malays_(ethnic_group)), [Chinese](/wiki/Overseas_Chinese) and [Indians](/wiki/Non-resident_Indian_and_person_of_Indian_origin). On September 16, 1963 [Malaysia](/wiki/Malaysia) was formed by the merger of the [Federation of Malaya](/wiki/Federation_of_Malaya) with the former British colonies of [North Borneo](/wiki/Crown_Colony_of_North_Borneo), [Sarawak](/wiki/Crown_Colony_of_Sarawak) and [Singapore](/wiki/Colony_of_Singapore). However, on August 9, 1965, due to distrust and ideological differences between the leaders of Singapore and of the [federal government of Malaysia](/wiki/Government_of_Malaysia), [Singapore](/wiki/Singapore_in_Malaysia) was expelled from Malaysia and became an independent republic. Malaysian migration to Singapore began in the mid 1960s to 1970s after Singapore's independence as the government focused on transforming Singapore's economy to a export-oriented one and a manufacturing hub. Singapore experienced rapid industrialisation and Malaysians has been the main source of foreign unskilled labour for the Singaporean workforce, especially in the manufacturing and service sectors. In the early 1970s, the government of Singapore focused on developing its electronics industry and services sector and most Malaysian workers were concentrated in those areas. By the late the 1990s, however, the number of unskilled Malaysian labourers decreased and foreign labourers from other [Southeast Asian](/wiki/Southeast_Asia) states were hired to offset the labour shortage instead. The [outflow of skilled](/wiki/Human_capital_flight) Malaysians, mostly to Singapore, was identified as a problem by the Malaysian government in 1995 and various programs such as the 1Malaysia initiative were introduced to counter the issue. Today, Malaysian migration includes a mix of both [white-collar workers](/wiki/White-collar_worker) and [blue-collar workers](/wiki/Blue-collar_worker), with the Singaporean government actively encouraging highly skilled workers to settle in the country and offering scholarship programmes to attract students to its educational institutions. ## Demographics demographic vertical bar chart of between 1990 and 2020 Population of Malaysians in Singapore from 1990 to 2020. During the 1990s, as Singapore moved to diversify its economy from a manufacturing-based one into a knowledge-based economy, the government relied more on foreign labour to offset Singapore's small local workforce. This resulted in the population of the Malaysian community to increase from a total of 195,072 in 1990, to 431,854 in 1995, a 121% increase within a five year period. By the late 1990s, there were 80,000 employment pass holders and another 450,000 on work permits, with majority being Malaysians, which constitutes 20% of the Singaporean workforce. There was a gradual increase of Malaysians migrating to Singapore from 2000 to 2005, increasing from 710,434 individuals to 818,337. In 2010, the total population of Malaysians in Singapore increased to 971,827 and according to the [World Bank](/wiki/World_Bank), Singapore residents, both permanent residents and Singaporean citizens, of Malaysian origin was at a population of 385,979, accounting for 46% of the Malaysian diaspora. It was also estimated that 81% of Malaysian emigrants to all countries from that year were [Malaysian Chinese](/wiki/Malaysian_Chinese), and 57% of those ethnic Chinese emigrated to Singapore. By 2015, the population of Malaysians was at 1,123,654, accounting for 20.3% of Singapore's 5,535,000 population for that year. As of 2020, there are 1,132,924 Malaysians or Singaporeans of partial or full Malaysian origin residing in Singapore. In addition to the permanent population in the country, about 350,000 Malaysians cross the Johor-Singapore Causeway daily to commute to work or school. The community includes [white-collar workers](/wiki/White-collar_worker), [blue-collar workers](/wiki/Blue-collar_worker) and students studying in the city-state. Factors contributing to the huge community of Malaysians in Singapore includes a stronger Singaporean currency, [Bumiputera race-based policies](/wiki/Bumiputera_(Malaysia)), cross border marriages and admittance of students into Singaporean educational institutions through the [ASEAN](/wiki/ASEAN) scholarship programme provided by the Singaporean government. ## Notable people Singaporean residents of Malaysian origin are well represented in all levels of Singaporean society. Many notable Singaporeans have either partial or full Malaysian origin, as Malaysia and Singapore were both under British colonial rule from the 1820s to 1950s. Below is a list of notable Singaporeans of Malaysian origin and Malaysians living in Singapore. - [Ahmad Ibrahim](/wiki/Ahmad_Ibrahim_(Singaporean_politician)), was a Singaporean politician and served as the [Minister for Manpower](/wiki/List_of_Ministers_for_Manpower_(Singapore)). - [Anthony Tan](/wiki/Anthony_Tan), Singaporean entrepreneur of Malaysian Chinese descent, founder & CEO of [Grab](/wiki/Grab_(company)). - [Chan Sek Keong](/wiki/Chan_Sek_Keong), former [Chief Justice of Singapore](/wiki/Chief_Justice_of_Singapore), of [Malaysian Chinese](/wiki/Malaysian_Chinese) descent. - [Soo K. Chan](/wiki/Soo_K._Chan), Singaporean architect, of Malaysian Chinese descent, founder of SCDA Architects. - [Chen Hanwei](/wiki/Chen_Hanwei), Malaysian actor based in Singapore. - [Michael Chiang](/wiki/Michael_Chiang), Singaporean playwright and screenwriter, of Malaysian Chinese descent. - [Chin Liew Ten](/wiki/Chin_Liew_Ten), Singaporean professor of [philosophy](/wiki/Philosophy). - [Chin Tet Yung](/wiki/Chin_Tet_Yung), Singaporean politician, of Malaysian Chinese descent. - [Elizabeth Choy](/wiki/Elizabeth_Choy), was a Singaporean educator and councillor. - [Eu Chooi Yip](/wiki/Eu_Chooi_Yip), was a Singaporean activist known for his participation in anti-colonial and Communist movements in Malaya and Singapore. - [Shamini Flint](/wiki/Shamini_Flint), Malaysian author based in Singapore, of [Malaysian Indian](/wiki/Malaysian_Indians) descent. - [Foo Mee Har](/wiki/Foo_Mee_Har), Singaporean politician, of Malaysian Chinese descent. - [Goh Eng Wah](/wiki/Goh_Eng_Wah), was a Singaporean film distributor and founder of [Eng Wah Global](/wiki/Eng_Wah_Global). - [Goh Keng Swee](/wiki/Goh_Keng_Swee), was a Singaporean politician and former [Deputy Prime Minister of Singapore](/wiki/Deputy_Prime_Minister_of_Singapore). - [Goh Poh Seng](/wiki/Goh_Poh_Seng), was a Singaporean author and doctor, of Malaysian Chinese descent. - [Henry Golding](/wiki/Henry_Golding), is an actor and TV host, of English-[Iban](/wiki/Iban_people) Malaysian descent, living in Singapore - [Ian Goodenough](/wiki/Ian_Goodenough), Singaporean-born Australian politician, of Chinese Malaysian descent. - [Hon Sui Sen](/wiki/Hon_Sui_Sen), was a Singaporean politician and 4th [Minister for Finance](/wiki/Ministry_of_Finance_(Singapore)). - [Huang Wenyong](/wiki/Huang_Wenyong), was a Singaporean actor, of Malaysian Chinese descent. - [Khaw Boon Wan](/wiki/Khaw_Boon_Wan), Singaporean retired politician. - [Khoo Swee Chiow](/wiki/Khoo_Swee_Chiow), Singaporean adventurer and author, first Southeast Asian to complete the [Explorers Grand Slam](/wiki/Explorers_Grand_Slam). - [Amy Khor](/wiki/Amy_Khor), Singapore retired politician. - [Song Hoot Kiam](/wiki/Song_Hoot_Kiam), was a Singaporean community leader, of Malaysian Chinese descent. - [Kiong Kong Tuan](/wiki/Kiong_Kong_Tuan), was a merchant from [Penang](/wiki/Penang), holder of opium and spirit farms in Singapore in 19th century. - [Kuok Khoon Hong](/wiki/Kuok_Khoon_Hong), Singaporean business magnate, of Malaysian Chinese descent. - [Lai Kew Chai](/wiki/Lai_Kew_Chai), was a Singaporean judge, of Malaysian Chinese descent. - [Lai Siu Chiu](/wiki/Lai_Siu_Chiu), Singaporean lawyer and judge, of Malaysian Chinese descent. - [Aaron Lee](/wiki/Aaron_Lee), Singaporean poet, of Malaysian Chinese descent. - [Addy Lee](/wiki/Addy_Lee), Malaysian hair stylist, known for his unique styling with hairstyle. - [Lee Bee Wah](/wiki/Lee_Bee_Wah), Singaporean engineer and politician, of Malaysian Chinese descent. - [Lee Khoon Choy](/wiki/Lee_Khoon_Choy), was a Singaporean journalist and politician, of Malaysian Chinese descent. - [Lee Siew Choh](/wiki/Lee_Siew_Choh), was a Singaporean politician and medical doctor. - [Sonny Liew](/wiki/Sonny_Liew), Singaporean comic artist, of Malaysian Chinese descent. - [Catherine Lim](/wiki/Catherine_Lim), Singaporean fiction author, of Malaysian Chinese descent. - [Suchen Christine Lim](/wiki/Suchen_Christine_Lim), Singaporean author, of Malaysian Chinese descent. - [Loh Kean Hean](/wiki/Loh_Kean_Hean), Singaporean national badminton player, of Malaysian Chinese descent. - [Loh Kean Yew](/wiki/Loh_Kean_Yew), Singaporean national badminton player, of Malaysian Chinese descent. - [Lina Loh](/wiki/Lina_Loh), Singaporean politician, of Malaysian Chinese descent. - [Loke Cheng Kim](/wiki/Loke_Cheng_Kim), Malaysian–Singaporean businesswoman and philanthropist. - [Loke Wan Tho](/wiki/Loke_Wan_Tho), was a Malaysian business magnate, one of the founders of [Cathay Organisation](/wiki/Cathay_Organisation). - Nooryana Najwa Najib, daughter of former Malaysian Prime Minister, [Najib Razak](/wiki/Najib_Razak). - [Bonnie Loo](/wiki/Bonnie_Loo), Malaysian actress and singer based in [Singapore](/wiki/Singapore). - [Olivia Lum](/wiki/Olivia_Lum), Singaporean businesswoman, of Malaysian Chinese descent. - [Mohammad Din Mohammad](/wiki/Mohammad_Din_Mohammad), Singaporean painter, of [Malaysian Malay](/wiki/Malaysian_Malay) descent. - [Devan Nair](/wiki/Devan_Nair), was a Singaporean politician and the third [President of Singapore](/wiki/President_of_Singapore). - [Irene Ng](/wiki/Irene_Ng_(politician)), Singaporean politician, of Malaysian Chinese descent. - [Ong Pang Boon](/wiki/Ong_Pang_Boon), retired Singaporean politician, of Malaysian Chinese descent. - [Adrian Pang](/wiki/Adrian_Pang), Singaporean actor, of Malaysian Chinese descent. - [Janil Puthucheary](/wiki/Janil_Puthucheary), Singaporean politician and doctor, of Malaysian Indian descent. - [Phyllis Quek](/wiki/Phyllis_Quek), Malaysian model and actress, of Malaysian Chinese descent. - [K. S. Rajah](/wiki/K._S._Rajah), was a Singaporean lawyer, of Malaysian Indian descent. - [Adnan Saidi](/wiki/Adnan_Saidi), was a [Malayan](/wiki/British_Malaya) military officer, known for his heroics in the Battle of Pasir Panjang. - [Sha'ari Tadin](/wiki/Sha%27ari_Tadin), Singaporean politician, of Malaysian Malay descent. - [Huzir Sulaiman](/wiki/Huzir_Sulaiman), Singaporean director and actor, of Malaysian Malay descent. - [Leaena Tambyah](/wiki/Leaena_Tambyah), Singaporean special education advocate, recipient of the [Bintang Bakti Masyarakat](/wiki/Bintang_Bakti_Masyarakat) (Public Service Star). - [Tan Boon Teik](/wiki/Tan_Boon_Teik), was a Singaporean judicial officer and former [Attorney-General of Singapore](/wiki/Attorney-General_of_Singapore). - [Jason Pomeroy](/wiki/Jason_Pomeroy), British-Malaysian architect - [Julie Tan](/wiki/Julie_Tan), Singaporean actress, of Malaysian Chinese descent. - [Tan Hooi Ling](/wiki/Tan_Hooi_Ling), Malaysian Chinese entrepreneur based in Singapore, co founder & COO of [Grab](/wiki/Grab_(company)). - [Tan Kim Seng](/wiki/Tan_Kim_Seng), was a Singaporean merchant and philanthropist, of [Peranakan](/wiki/Peranakan) descent. - [Tan Tock Seng](/wiki/Tan_Tock_Seng), Singaporean merchant and philanthropist, contributed to the construction of [Tan Tock Seng Hospital](/wiki/Tan_Tock_Seng_Hospital). - [Toh Chin Chye](/wiki/Toh_Chin_Chye), was a Singaporean politician and former Deputy Prime Minister of Singapore. - [Tung Soo Hua](/wiki/Tung_Soo_Hua), Singaporean news anchor of [Channel 8](/wiki/Channel_8_(Singapore)) news. - [Wee Chong Jin](/wiki/Wee_Chong_Jin), was a Singaporean judge and the first [Chief Justice of Singapore](/wiki/Chief_Justice_of_Singapore). - [Brandon Wong](/wiki/Brandon_Wong_(actor)), Singaporean actor, of Malaysian Chinese descent. - [Claire Wong](/wiki/Claire_Wong), Singaporean-Malaysian director, of Malaysian Chinese descent. - [Lawrence Wong](/wiki/Lawrence_Wong_(actor)), Singaporean actor, of Malaysian Chinese descent. - [Race Wong](/wiki/Race_Wong), Singaporean singer, best known for being part of the duo group, [2R](/wiki/2R_(group)). - [Rosanne Wong](/wiki/Rosanne_Wong), Singaporean singer, best known for being part of the duo group, [2R](/wiki/2R_(group)). - [Yong Pung How](/wiki/Yong_Pung_How), was a Singaporean banker, judge, and lawyer, and former Chief Justice of Singapore. - [You Jin](/wiki/You_Jin), Singaporean writer and recipient of the [Cultural Medallion](/wiki/Cultural_Medallion). - [Ke Le](/wiki/Ke_Le), Singaporean Malaysian getai singer & actress from [Ah Girls Go Army](/wiki/Ah_Girls_Go_Army) - [Ruzaini Zainal](/wiki/Ruzaini_Zainal), Singapore professional footballer, of Malaysian Malay descent. - [Malaysia–Singapore relations](/wiki/Malaysia%E2%80%93Singapore_relations) - [Singaporeans in Malaysia](/wiki/Singaporeans_in_Malaysia) - [Malaysian diaspora](/wiki/Malaysian_diaspora) - [Immigration to Singapore](/wiki/Immigration_to_Singapore) ## Bibliography - Takashi, Shiraishi (2009), *Across the Causeway: A Multi-dimensional Study of Malaysia-Singapore Relations*, Institute of Southeast Asian Studies, [ISBN](/wiki/ISBN_(identifier)) 978-9-812-30783-5 - Koh, Jamie (2009), *Culture and Customs of Singapore and Malaysia*, ABC-CLIO, [ISBN](/wiki/ISBN_(identifier)) 9780313351167 - Wright, Arnold (2012), *Twentieth Century Impressions of British Malaya: Its History, People, Commerce, Industries, and Resources*, Repressed Publishing LLC, (originally first published in 1908), [ISBN](/wiki/ISBN_(identifier)) 9781462298440 - Aris Ananta, Evi Nurvidya Arifin (2004), *International Migration in Southeast Asia*, ISEAS Publishing, [ISBN](/wiki/ISBN_(identifier)) 978-981-230-279-3 - Stubbs, Richard (2005), *Rethinking Asia's Economic Miracle: The Political Economy of War, Prosperity*, Red Globe Press, [ISBN](/wiki/ISBN_(identifier)) 978-0333964613 - Overseas Malaysian Communities Portals: - Malaysia - Singapore\n",
  "language": "en",
  "processed_at": "2026-01-12T11:28:58.563461",
  "title": "Malaysians in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Malaysians_in_Singapore"
}