{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:28:26.556703"
  },
  "content": "Traditional wood-made house style **Malay houses** ([Malay](/wiki/Malay_language): *Rumah Melayu;* [Jawi](/wiki/Jawi_script): رومه ملايو‎) refer to the vernacular dwellings of the [Malays](/wiki/Malays_(ethnic_group)), an ethno-linguistic group inhabiting [Sumatra](/wiki/Sumatra), coastal [Borneo](/wiki/Borneo) and the [Malay Peninsula](/wiki/Malay_Peninsula). Traditional architectural forms, such as tropically-suited roofs and harmonious proportions with decorative elements are considered to still have great cultural value by many in the region. However, these buildings require significant maintenance compared to modern construction; such as the challenges in preserving its main material, wood, from the decaying effect of tropical weather as well as [termite](/wiki/Termite) infestation. These vernacular construction skills are gradually being lost as [Malaysia](/wiki/Malaysia) continues its process of industrialisation, while in [Indonesia](/wiki/Indonesia) such traditional dwellings still survive in rural areas.[*fact or opinion?*] Though urban transformation in [Singapore](/wiki/Singapore) has expunged almost all Malay urban wards, a few houses displaying this vernacular architecture have survived, mainly concentrated in the offshore island of [Pulau Ubin](/wiki/Pulau_Ubin).[*citation needed*] The effort to preserve [indigenous architectural styles](/wiki/Architecture_of_Indonesia#Traditional_vernacular_architecture) of the [Indonesian archipelago](/wiki/Indonesian_archipelago) has been conducted through documentation and the creation replicas in [provinces](/wiki/Indonesian_provinces) pavilions in [Taman Mini Indonesia Indah](/wiki/Taman_Mini_Indonesia_Indah), [Jakarta](/wiki/Jakarta).[*relevant?*] ## Construction Using renewable [natural materials](/wiki/Natural_material) including timber and [bamboo](/wiki/Bamboo), the dwellings are often built without the use of metal including nails. Instead pre-cut holes and grooves are used to fit the timber elements into one another, effectively making it a 'prefabricated house'. Although nails had been invented and in later houses used minimally for non-structural elements (for example, windows or panels), structural flexibility was a benefit which nailing inhibited. Without nails, a timber house could be dismantled and reconstructed in a new location. Most of the ancient Malay peoples of [South-East Asia](/wiki/Southeast_Asia) maintained a form of self-regenerating environmental culture. ## Design Traditional timber houses incorporated design principles relevant in contemporary architecture such as shading and ventilation, qualities present in the basic house features. Although Malay houses have diversity of styles according to each states, provinces, and sub-ethnics, there are common style and similarities shared among them: 1. Built on stilts 2. Have stairs 3. Partitioned rooms 4. Vernacular roof 5. Adorned with decoration ### Stilts Most of Malay houses are built as *Rumah Panggung* (lit: \"stage house\") houses built on [stilts](/wiki/Stilts_(architecture)). The main characteristic of a typical Malay *kampung* house is its on stilts or [piles](/wiki/Deep_foundation). This was to avoid wild animals and floods, to deter thieves, and for added ventilation. In Sumatra, traditionally stilted houses are designed to avoid dangerous wild animals, such as snakes and tigers. While in areas located close to big rivers of Sumatra and Borneo, the stilts help to elevated house above flood surface. In parts of Sabah, the number of dowry buffaloes could even depend on the number of stilts there are in the bridal family's home. ### Stairs The traditional Malay house require [stairs](/wiki/Stairs) to reach the elevated interior. Usually the stairs connected the land front of the house to the serambi ([porch](/wiki/Porch) or [verandah](/wiki/Verandah)). Additional stairs might be found on back of the house. The stairs can be made of wood or brick structure covered with tiles. For example, in [Melaka](/wiki/Melaka) and Riau the staircase is always decoratively moulded and colourfully tiled. ### Rooms The interior is partitioned to create rooms such as serambi (verandah), living room, and bedrooms. A traditional Malay timber house usually in two parts: the main house called Rumah Ibu in honour of the mother (ibu) and the simpler Rumah Dapur or kitchen annexe, which was separated from the main house for fire protection. The proportion was important to give the house a human scale. The Rumah Ibu was named after the spacings between stilts which are said to typically follow the arms-spread width of the wife and mother in the family of the house when being built. At least one raised veranda (serambi) is attached to the house for seated work or relaxation, or where non-familiar visitors would be entertained, thus preserving the privacy of the interior. ### Roof The roof of traditional Malay houses are designed to provide shade and protection from heat and rain, as well as to provide ventilation. The basic design of a roof on a Malay house is [gabled roof](/wiki/Gabled_roof), an extended frame with ornaments on the edges of the roof. The vernacular Malay roof is best suited for hot and humid tropical climates. An example of the gabled roof can be found in the design of Rumah Lipat Kajang. However a pyramidal styled pitched roof can also be found on houses such as the Palembang Rumah Limas. In [Riau](/wiki/Riau) and [Jambi](/wiki/Jambi) there are several different styles, especially of the roof design. The Rumah Lancang or Rumah Lontik have curved roof with boat-like structure on stilts. The design somehow similar to [Minang](/wiki/Minangkabau_people) [Rumah Gadang](/wiki/Rumah_Gadang). The Rumah Lipat Kajang have flat roof structure with crossing edges forming \"x\" pinnacle on corners of the roof. The larger structure with similar crossed corner roof is called Rumah Limas. This type of roof and structure often used in palaces of Malay kings as well as government buildings. The Rumah Limas is also known as the traditional house of [South Sumatra](/wiki/South_Sumatra) and [Sundanese](/wiki/Sundanese_people) West Java, although they have same \"Rumah Limas\" name, the design is slightly different. The modern government and public buildings often based on Malay style roof design, such as government buildings in Riau and Jambi, as well as the roof design of [Muzium Negara](/wiki/Muzium_Negara) in [Kuala Lumpur](/wiki/Kuala_Lumpur). ### Decoration Each Malay region, state or sub-ethnic groups has its own regional or group style of house with preferred details. However most of Malay houses have a typical roof ornament, a crossed roof edge structure forming \"x\"-like pinnacle ornament on the edge of the roof. This kind of ornament can be found in Lontik, Lipat Kajang and Limas styles. In [Peninsular Malaysia](/wiki/Peninsular_Malaysia)'s east coast, many houses have distinctive carved roof gable-end boards akin to those in [Thailand](/wiki/Thailand) and [Cambodia](/wiki/Cambodia). ## Types - *[Rumah limas](/wiki/Rumah_limas)* – Predominantly found in the city of [Palembang](/wiki/Palembang) and related with the nobles of the [Palembang Sultanate](/wiki/Palembang_Sultanate) - *Rumah Limas* – A different styled Rumah Limas that can be found in [Riau Islands](/wiki/Riau_Islands), [Johor](/wiki/Johor), [Malacca](/wiki/Malacca), [Pahang](/wiki/Pahang), [Terengganu](/wiki/Terengganu) and [Selangor](/wiki/Selangor). - *Rumah Potong Limas* – Predominantly found at West Kalimantan. - *Rumah Lipat Kajang* or *Rumah Kejang Lako* – Predominantly found in [Jambi](/wiki/Jambi) and [Riau](/wiki/Riau). - *Rumah Melaka* – Predominantly found at Johor and Malacca. - *Rumah Tiang Dua Belas* – Predominantly found in east coast of [North Sumatra](/wiki/North_Sumatra). - *Rumah Lancang* or *Rumah Lontik* – Predominantly found in [Riau](/wiki/Riau) [Kampar Regency](/wiki/Kampar_Regency). - *Rumah Belah Bubung* – Predominantly found in [Riau Islands](/wiki/Riau_Islands). - *Rumah Kutai* – Predominantly found in [Perak](/wiki/Perak) and northern Selangor, Kutai mean Old in Perak Malays dialect Kutey, Kuteh or Kutai, example word, Sudah Kutey kamu nih, payah doh. - *Rumah Perabung Lima* – Predominantly found in [Kelantan](/wiki/Kelantan) and Terengganu. - *Rumah Gajah Menyusu* – Predominantly found in [Penang](/wiki/Penang). - *Rumah Tiang Dua Belas* – Predominantly found in Kelantan, Terengganu and [Pattani](/wiki/Pattani_Province). - *Rumah Bumbung Panjang* – Predominantly found in [Kedah](/wiki/Kedah), [Perlis](/wiki/Perlis), Perak, Selangor, Johor and Pahang. - *Rumah Air* – Predominantly found in [Brunei](/wiki/Brunei) and [Labuan](/wiki/Labuan_Territory). - *Rumah Berbumbung Lima* – Predominantly found in [Bengkulu](/wiki/Bengkulu). ## Gallery - Malaysia portal - Indonesia portal - Singapore portal - Thailand portal - [Kampong Ayer](/wiki/Kampong_Ayer) - [Malay culture](/wiki/Malay_culture) - [Architecture of Indonesia](/wiki/Architecture_of_Indonesia) - [Architecture of Sumatra](/wiki/Architecture_of_Sumatra) - [Rumah adat](/wiki/Rumah_adat) - [Bahay kubo](/wiki/Bahay_kubo) - [Bahay na Bato](/wiki/Bahay_na_Bato) - [Torogan](/wiki/Torogan) - Ariffin, A. Najib; \"A Disappearing Heritage: The Malaysian Kampung House\", in *Heritage Asia* (Kuala Lumpur: Mediahub), September 2005, 6–8 -Passages in the above entry appear with permission of the Author/Publisher - Effendy, Tenas; \"Rumah, An Ode to the Malay House\" (George Town, Penang: Areca Books), 2014. - Lee Ho Yin, \"The Kampong House: An Evolutionary History of Peninsular Malaysia's Vernacular Houseform,\" in *Asia's Old Dwellings: Tradition, Resilience, and Change,* ed. Ronald G. Knapp (New York: Oxford University Press), 2003, 235–258. - Yuan, Lim Jee; \"*The Malay House: Principles to Building Simple and Beautiful Homes for Comfort and Community*\" (Fox Chapel Publishing), 2010.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:28:26.556238",
  "title": "Malay house",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Malay_house"
}