{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:28:42.987440"
  },
  "content": "Former building on Battery Road, Singapore **Malayan Bank Chambers**, also known as **Maybank Chambers** and originally known as the **Whiteaway Laidlaw Building** or the **Whiteaway Laidlaw & Co Building**, was a building on Battery Road in Singapore. ## Description The four-storey building was built in a stripped-down classical style, typical of commercial buildings of the period, featuring simplified classical mouldings, and an engaged giant order of pilasters spanning the second and third floors, with an attic storey above the main entablature. It was described in the press at the time as having 'no particular style of architecture' due to the prevalence of this type of simplified classicism at the time, and contained no specific architectural reference (eg. moorish or baroque). The building was fire-proof. The ground floor of the building had a lift and a staircase, both connecting to the first, second and third floors of the building. An 8 ft [verandah](/wiki/Verandah) ran along the building's frontage. The basement was 12,000 sq ft large and 20 ft high. The flooring was made of concrete, and the room was light and airy. The window fronts were made of [teak](/wiki/Teak). The ground floor also contained permanent show cases. The roof of the building was cut in two. The building also had vaulted concrete slabs spanning steel girders with corrugated iron permanent shuttering. ## History The building was constructed in 1915 as the signature department store of [Whiteaway Laidlaw](/wiki/Whiteaway_Laidlaw) in Singapore. The building cost $300,000 to build. The building was designed by [London](/wiki/London)-based architects H. O. Ellis and W. H. Clarke. During the [Japanese occupation of Singapore](/wiki/Japanese_occupation_of_Singapore), the building was taken over by the Japanese army, and department store chain [Tokyu](/wiki/Tokyu_Department_Store) commenced business in the building. In 1951, a $2,040,000 bid to take over the building after the expiration of the building's lease in 1963 was rejected. [Maybank](/wiki/Maybank) took over the building for $3.6 million in 1962, renaming it Malayan Bank Chambers, and spent $15 million on upgrading the building. Maybank also spent $7 million on refurbishing the interior of the building, which was done in phases from 1989 to 1994. On 29 September 1997, Maybank announced plans to redevelop the building for $110 million. The building was demolished in 1998 to make way for the [Maybank Tower](/wiki/Maybank_Tower_(Singapore)). 1°17′09″N 103°51′08″E﻿ / ﻿1.2859°N 103.8523°E﻿ / 1.2859; 103.8523\n",
  "language": "en",
  "processed_at": "2026-01-12T11:28:42.986959",
  "title": "Malayan Bank Chambers",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Malayan_Bank_Chambers"
}