{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:28:48.830617"
  },
  "content": "Currency of British Malaya and Brunei The **Malayan dollar** ([Malay](/wiki/Malay_Language): *ringgit*, [Jawi](/wiki/Jawi_script): رڠڬيت) was the currency of the British colonies and protectorates in [Malaya](/wiki/British_Malaya) and [Brunei](/wiki/Brunei) until 1953. It was introduced in 1939, replacing the [Straits dollar](/wiki/Straits_dollar) at par, with 1 dollar = two [shillings](/wiki/Shilling) four [pence](/wiki/Penny) [sterling](/wiki/Pound_sterling) (60 dollars = 7 pounds). ## History ### Board of Commissioners of Currency, Malaya formed The Malayan dollar was issued by the [Board of Commissioners of Currency, Malaya](/wiki/Board_of_Commissioners_of_Currency,_Malaya), with a hiatus during the Japanese occupation (1942–1945). The Board of Commissioners of Currency, Malaya, came into being in October 1938 following the Blackett Report which recommended that the sole power of issuing currency for the various [Malay States](/wiki/Malay_States), including [Brunei](/wiki/Brunei), and the [Straits Settlements](/wiki/Straits_Settlements) should be entrusted to a pan-Malayan Currency Commission. Sir [Basil Phillott Blackett](/wiki/Basil_Phillott_Blackett) was appointed in 1933 by the [Secretary of State for the Colonies](/wiki/Secretary_of_State_for_the_Colonies) to lead a commission to consider the participation of the various [Malay States](/wiki/Malay_States), including [Brunei](/wiki/Brunei), in the profits and liabilities of the [Straits Settlements](/wiki/Straits_Settlements) currency. The Blackett Report was adopted by the Government of the [Straits Settlements](/wiki/Straits_Settlements), the [Federated Malay States](/wiki/Federated_Malay_States), [Unfederated Malay States](/wiki/Unfederated_Malay_States) and [Brunei](/wiki/Brunei). Legislation was enacted by the Straits Settlements Currency Ordinance (No. 23) of 1938, and ratified by the various states during 1939. The board started to issue currency in 1939. In 1952 the board was renamed the Board of Commissioners of Currency, Malaya and British Borneo. See [Malaya and British Borneo dollar](/wiki/Malaya_and_British_Borneo_dollar). ### Currencies issued Banknotes in denominations of 1, 5 and 10-dollar notes were printed in the UK for circulation in Malaya in 1940. However, out of 27,000,000 one dollar notes and 5,600,000 five-dollar notes of the same series despatched to Malaya before the Japanese invasion; 25,800,000 one dollar notes and 5,000,000 five-dollar notes arrived. Of the remainder, 700,000 one dollar notes and 500,000 five-dollar notes were lost when the [SS *Automedon*](/wiki/SS_Automedon) was captured and then scuttled on 11 November 1940, by the German raider *Atlantis* in the Indian Ocean approach to the Malacca Straits; and further 500,000 one dollar notes and 100,000 five-dollar notes were lost when the carrying ship, the SS *Eumanes*, was sunk. None of these notes were ever put into circulation by the Straits Settlements Government. Only the 10-dollar notes were issued for use in Malaya in March 1941. ### Japanese Occupation During the [Japanese Occupation](/wiki/Japanese_occupation_of_Malaya), the [Japanese government-issue dollar](/wiki/Japanese_government-issued_dollar_in_Malaya_and_Borneo) replaced the Malayan dollar as legal tender. At the time of Japanese invasion, stocks of dollar notes were still held in treasury vaults in Singapore and [Penang](/wiki/Penang). When Penang was evacuated in December 1941, 600,000 one-dollar notes and 100,000 five-dollar notes were abandoned in the treasury, where they fell into the hands of the Japanese. In Singapore, 4,200,000 one-dollar and 1,000,000 five-dollar notes were destroyed, and 21,000,000 one-dollar notes and 3,900,000 five-dollar notes shipped to [India](/wiki/India) for safety. When British forces reoccupied Singapore in September 1945, they found all the abandoned notes of this series, except for a bundle of one thousand dollar notes captured in [Penang](/wiki/Penang), in the vaults of the Japanese sub-treasury. Nevertheless, all stocks were destroyed in 1946, as it was feared that the notes from the captured ship might have been handed over by the Germans to their Japanese allies, and were being hoarded in bulk, ready to be passed into circulation when the notes became current. There is no evidence that these notes ever reaching [Malaya](/wiki/British_Malaya). All the notes were signed by L. G. Corney, the chairman of the board of the Commissioners of Currency. ### British Military Administration British forces landed at [Penang](/wiki/Penang) on 3 September 1945 and at Singapore on 5 September 1945 and gradually reoccupied the whole of [Malaya](/wiki/British_Malaya). Until 1 April 1946, the country's finances were administrated by the department of the Controller of Finance and Accounts of the Army Pay Corps, and currency was put into circulation against payment in sterling by the [War Office](/wiki/War_Office) to the account of the Board of Commissioners of Currency, Malaya. It was decided that no value whatever should be accorded the Japanese [banana money](/wiki/Banana_money) then in circulation, as it had been estimated that during the three and a half years occupation the Japanese had issued a minimum of 4,000 million dollars' worth of currency against a normal 1941 circulation of about 220 million (Donnison p. 223). The pay service made available currency notes from 1 cent to 10,000 dollars which had been printed in Britain either before, or during, the occupation but had not previously been sent to [Malaya](/wiki/British_Malaya). In addition, the 1940 ten-dollar note issued by the Board of Commissioners of Currency Malaya and the old [Straits Settlements](/wiki/Straits_Settlements) notes, with the exception of denominations of 1,000 or 10,000 dollars and 10 and 25 cents, were declared a legal tender. These old notes were gradually withdrawn, however, as the new issue became adequate for the country's needs. The notes of this series from 1 cent to 10 dollars were dated 1 July 1941, those of 50, 100 and 1,000 dollars 1 January 1942, while the 10,000-dollar notes were signed and dated on the day of their issue. The chairman of the Currency Board was H. Weisberg. The emergency issues of 10 cents with [King George VI](/wiki/King_George_VI) as the portrait was issued on 15 August 1940, designed and printed by the Survey Department (F.M.S.) in Kuala Lumpur with the controlled serial number. On 1 September 1940, also an emergency issues of 25 cents was designed and printed by the Survey Department with [King George VI](/wiki/King_George_VI) as the portrait. On 1 July 1941, a set of new regular issues, with the denomination of 1, 5, 10, 20 and 50 cents was printed by [Thomas de la Rue & Co. Ltd.](/wiki/De_La_Rue), London with the portrait of [King George VI](/wiki/King_George_VI). Also on the same date of 1 July 1941, the 1, 5 and 10-dollar notes were engraved and printed by Waterlow & Sons Ltd., London, and the higher denomination of 50, 100, 1000 and 10,000-dollar notes were printed by [Bradbury, Wilkinson & Co. Ltd.](/wiki/Bradbury_Wilkinson), Surrey, London. ### Civil Administration Civil administration was restored on 1 April 1946 and from the same date the Board of Commissioners of Currency Malaya was reconstituted by the authority or Ordinance No.4 of 1946 in Singapore and Ordinance No.5 of 1946 in the [Malayan Union](/wiki/Malayan_Union). The Board continued to operate in the same way as before the [Japanese occupation](/wiki/Japanese_occupation_of_Malaya,_North_Borneo_and_Sarawak). All notes bearing dates prior to 1 July 1941, were de-monetised on 31 August 1948. ## Coins Coins were issued between 1939 and 1950 in denominations of square shaped 1⁄2 and 1 cent in bronze, and round 5, 10 and 20 cents (silver until 1945, and cupro-nickel from 1948 to 1950). These all had the same designs and appearance of previous Straits Settlements coinage, which they replaced. The 1 cent coins were reduced in size in 1943 due to cost and wartime materials shortages while the 1⁄2 cents were discontinued after 1940, even though they continued to be legal tender. All coins of this series depict [King George VI](/wiki/King_George_VI). Older Straits coinage also continued to circulate alongside, though silver pieces of both types quickly began to disappear. The very last Coinage was issued in 1950, following which the transition from the Malayan Dollar to its successor currencies was planned. The Malayan Dollar was the formal currency of the region until 1953. ## Banknotes Banknotes in denominations of 1, 5 and 10-dollar were printed in the UK for circulation in Malaya in 1940. However, because a shipload of 1 and 5-dollar notes were captured by German forces, only the 10 dollars were issued (see History section above). Because of the war in Europe, the Survey Department printed 10 and 25 cents for circulation. These were replaced in 1941 by notes printed by [Thomas de la Rue](/wiki/Thomas_de_la_Rue) in denominations of 1, 5, 10, 20 and 50 cents. When the British regained control of Malaya after World War II, notes were issued in 1945 (dated 1941), in denominations of 1, 5, 10, 50, 100, 1,000 and 10,000 dollars. Cent NoteImageValueMain colourDescriptionDate of issuePrintedObverseReverseObverseReverseBlank1 centpurple/orange[King George VI](/wiki/George_VI_of_the_United_Kingdom)blank1941Thomas De La Rue5 centsred/green10 centsdark blue/pink/brown1940Survey Department, [Federated Malay States](/wiki/Federated_Malay_States)Blue/pink1941Thomas De La Rue20 centsbrown/orange[Coat of arms](/wiki/State_emblem_of_Malaysia) of the [Federated Malay States](/wiki/Federated_Malay_States) (left), the Straits Settlements (centre top), and the [Unfederated Malay States](/wiki/Unfederated_Malay_States) and [Brunei](/wiki/Coat_of_arms_of_Brunei_Darussalam) (right).25 centsgreen/orange1940Survey Department, [Federated Malay States](/wiki/Federated_Malay_States)50 centspurple/orange1941Thomas De La RueMalayan DollarImageValueMain colourDescriptionDate of issueObverseReverseObverseReverse$1green[King George VI](/wiki/George_VI_of_the_United_Kingdom)[Coat of arms](/wiki/State_emblem_of_Malaysia) of the [Federated Malay States](/wiki/Federated_Malay_States) (left), the Straits Settlements (centre top), and the [Unfederated Malay States](/wiki/Unfederated_Malay_States) and [Brunei](/wiki/Coat_of_arms_of_Brunei_Darussalam) (right).1940Blue1941$51940Green/yellow1941$10purple1940Red1941$50Blue/mauve$100red/green$1000blue/purple$10,000green/light brown - [British North Borneo dollar](/wiki/British_North_Borneo_dollar) - [Malaya and British Borneo dollar](/wiki/Malaya_and_British_Borneo_dollar) - [Sarawak dollar](/wiki/Sarawak_dollar) - [Straits dollar](/wiki/Straits_dollar) - Money portal - Numismatics portal Pre-WWIIPreceded by: **[Straits dollar](/wiki/Straits_dollar)** **Ratio:** at par, or 60 dollars = 7 British pounds**Currency of [Straits Settlements](/wiki/Straits_Settlements), [Brunei](/wiki/Brunei)** 1939 – 1942Succeeded by: **[Japanese government-issued dollar](/wiki/Japanese_government-issued_dollar_in_Malaya_and_Borneo)** **Location:** present day [Malaysia](/wiki/Malaysia), Singapore, [Brunei](/wiki/Brunei) **Ratio:** at par **Note:** The Japanese allowed the Malayan dollar to circulate. But they were in practice hoarded as a more reliable store of value.Post-WWIIPreceded by: **[Japanese government-issued dollar](/wiki/Japanese_government-issued_dollar_in_Malaya_and_Borneo)** **Location:** present day [Malaysia](/wiki/Malaysia), Singapore, [Brunei](/wiki/Brunei) **Reason:** Japan lost [World War II](/wiki/World_War_II) **Ratio:** The occupation currency became worthless. The value of the pre-occupation currency was restored.**Currency of [Straits Settlements](/wiki/Straits_Settlements)** September 1945 – 31 March 1946**Currency of [Malaya](/wiki/Federation_of_Malaya), Singapore** 1946 – 1953Succeeded by: **[Malaya and British Borneo dollar](/wiki/Malaya_and_British_Borneo_dollar)** **Reason:** creation of a common Board of Commissioners of Currency **Ratio:** at par, or 60 dollars = 7 British pounds**Currency of [Brunei](/wiki/Brunei)** 1945 – 1953\n",
  "language": "en",
  "processed_at": "2026-01-12T11:28:48.830239",
  "title": "Malayan dollar",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Malayan_dollar"
}