{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:28:50.864081"
  },
  "content": "Assimilation and acculturation to Malay culture **Malayisation** ([Commonwealth](/wiki/English_in_the_Commonwealth_of_Nations) spelling) or **Malayization** ([North American](/wiki/North_American_English) and [Oxford](/wiki/Oxford_spelling) spelling) is a process of [assimilation](/wiki/Cultural_assimilation) and [acculturation](/wiki/Acculturation), that involves acquisition ([Malay](/wiki/Malay_language): *Masuk Melayu*, literally \"embracing [Malayness](/wiki/Malayness)\") or imposition ([Malay](/wiki/Malay_language): *Pemelayuan* or *Melayuisasi*) of elements of [Malay culture](/wiki/Ethnic_Malays), in particular, [Islam](/wiki/Islam) and the [Malay language](/wiki/Malay_language), as experienced by non-Malay populations of territories fully controlled or partially influenced by historical [Malay sultanates](/wiki/Malay_sultanate) and modern Malay-speaking countries. It is often described as a process of civilisational expansion, drawing a wide range of indigenous peoples into the [Muslim](/wiki/Muslim), Malay-speaking polities of [Maritime Southeast Asia](/wiki/Maritime_Southeast_Asia). Examples of Malayisation have occurred throughout [Asia](/wiki/Asia) including in [Brunei](/wiki/Brunei), [Cambodia](/wiki/Cambodia), [Indonesia](/wiki/Indonesia), [Malaysia](/wiki/Malaysia), [Singapore](/wiki/Singapore), and [Sri Lanka](/wiki/Sri_Lanka). Malayisation started to occur during the territorial and commercial expansion of [Melaka Sultanate](/wiki/Melaka_Sultanate) in the 15th century, which spread the [language](/wiki/Classical_Malay), [culture](/wiki/Malay_people#culture), and [Islam](/wiki/Islam) to the [Maritime Southeast Asia](/wiki/Maritime_Southeast_Asia). Following the demise of Melaka in the early 16th century, instances of this assimilation of people from different [ethnic origins](/wiki/Austronesian_peoples) into [Malay culture](/wiki/Malay_people#culture), continued under numerous [sultanates](/wiki/Sultanate#Southeast_Asia) that emerged in [Malay Peninsula](/wiki/Malay_Peninsula), [Sumatra](/wiki/Sumatra), [Riau Islands](/wiki/Riau_Islands) and [Borneo](/wiki/Borneo). Malayisation could either be voluntary or forced and is most visible in the case of territories where the [Malay language](/wiki/Malay_language) or culture were dominant or where their adoption could result in increased prestige or social status. The ultimate manifestation of this cultural influence can be observed in the present [dominant](/wiki/Linguistic_imperialism) position of [Malay language](/wiki/Malay_language) and its variants in [Maritime Southeast Asia](/wiki/Maritime_Southeast_Asia), the establishment of [ethnic Malays realm](/wiki/Malay_world) within the region, the forming of new cultures such as the [Peranakan](/wiki/Peranakan), and the development of many [Malay trade and creole languages](/wiki/Malay_trade_and_creole_languages). In linguistics, the term Malayisation may refer to the adaptation of oral or written elements of any other language into a form that is more comprehensible to a speaker of [Malay](/wiki/Malay_language); or in general, of altering something so that it becomes [Malay](/wiki/Malay_people) in form or character. ## History ### Early history There is significant genetic, linguistic, cultural, and social diversity among modern Malay subgroups, mainly attributed to centuries of migration and assimilation of various ethnic groups and tribes within [Southeast Asia](/wiki/Southeast_Asia). Historically, the Malays are descended from the [Malayic](/wiki/Malayic_languages)-speaking [Austronesians](/wiki/Austronesian_peoples), various [Austroasiatic](/wiki/Austroasiatic) tribes, [Cham](/wiki/Cham_people) and [Funan](/wiki/Kingdom_of_Funan) settlers of ancient polities in coastal areas of the Malay Peninsula, Sumatra and Borneo; [Brunei](/wiki/History_of_Brunei), [Old Kedah](/wiki/Kedah_Kingdom), [Langkasuka](/wiki/Langkasuka), [Gangga Negara](/wiki/Gangga_Negara), [Old Kelantan](/wiki/Chi_Tu), [Negara Sri Dharmaraja](/wiki/Nakhon_Si_Thammarat_Kingdom), [Malayu](/wiki/Melayu_Kingdom) and [Srivijaya](/wiki/Srivijaya). [The coming of Islam to Southeast Asia](/wiki/Spread_of_Islam_in_Southeast_Asia) constituted a new era in Malay history. The new religion transformed many aspects of the old Hindu–Buddhist–animistic cultural practices and beliefs of the people, and imbued it with an Islamic worldview. Beginning 12th century, the old polities were soon gradually superseded by Islamic kingdoms across the region. The most important of these was the [Melaka Sultanate](/wiki/Melaka_Sultanate), established around 1400 CE. At the zenith of its power in the 15th century, Melaka exercised its special role not only as a trading centre, but also as the centre of Islamic learning, therefore promoting the development of Malay literary traditions. The blossoming of [Malay literature](/wiki/Malaysian_literature) in this era had transformed the [Classical Malay](/wiki/Classical_Malay) dialect of Melaka, enabling it to attain [linguistic prestige](/wiki/Prestige_(sociolinguistics)). As a result, growth in trade between Melaka and the rest of the archipelago led to the dialect spreading beyond the traditional Malay speaking world, and eventually it became a *[lingua franca](/wiki/Lingua_franca)* of maritime Southeast Asia. It was then further evolved into *Bahasa Melayu pasar* (\"[Bazaar Malay](/wiki/Malay_trade_and_creole_languages)\") or *Bahasa Melayu rendah* (\"Low Malay\"), which is generally understood as a form of pidgin influenced by contact between Malay and Chinese traders. The most important development has been that pidgin Malay creolised, creating several new languages such as the [Ambonese Malay](/wiki/Ambonese_Malay), [Manado Malay](/wiki/Manado_Malay) and [Betawi languages](/wiki/Betawi_language). The period of Melaka was also known as the era of Malay [ethnogenesis](/wiki/Ethnogenesis), signified by strong infusion of Islamic values into Malay identity, and the flourishing of various important aspects of Malay culture. The term 'Melayu' (\"Malay\") to refer to a distinct group of people had been clearly defined to describe the cultural preferences of the Melakans as against foreigners from the same region, notably the [Javanese](/wiki/Javanese_people) and [Thais](/wiki/Thai_people). The *cara Melayu* ('ways of Malay') were the *cara Melaka* ('ways of Melaka'); in language, dress, manners, entertainments and so forth, these might be referred to as 'Malay', and this Melaka-based culture or civilisation was acknowledged right across the archipelago. The aboriginal communities from [Orang Asli](/wiki/Orang_Asli) and [Orang Laut](/wiki/Orang_Laut) who constituted a majority original population of Melaka were also Malayised and incorporated into the hierarchical structure of Melaka. So successfully did Melakan rulers equate the kingdom with \"Melayu\" that one Malay text describes how, after a defeat, the people of Melaka fled into the jungle where they became *[Jakun](/wiki/Jakun_people)*, that is *Orang Hulu* ('upriver people'). It shows that, without the mantle of Melaka's prestige, the local inhabitants were undifferentiated from the other non-Malay elements in neighbouring areas. The Melakans were described by European travellers as *\"white\", well-proportioned, and proud. The men normally wear cotton garments (*[sarongs](/wiki/Sarong)*) which cover them only from the waist down, but a few of the more distinguished wear short, silk coats, under which they carry [krises](/wiki/Kris). Their women, who are olive-coloured, comely, and brunette, usually wear fine silk garments and short shirts. Nobody but the Sultan may wear yellow colours without special permission under pain of death. The faces of the natives are broad with wide noses and round eyes. Both sexes are well-mannered and devotees of all forms of refined amusement, especially music, ballads, and poetry. The rich pass life pleasantly in their country homes at Bertam which are surrounded by bountiful orchards. Most of them maintain separate establishments in the city from which they conduct their business. They take offence easily and will not permit anyone to put his hand on their head or shoulders. Often malicious and untruthful, they take pride in their ability to wield the kris adroitly against their personal enemies. In larger engagements they fight in bands with bows and arrows, spears and krises. In their beliefs, they are devout Muslims.* Their language *\"is reported to be the most courteous and seemelie speech of all the Orient.\" It is readily learned by foreigners, and is the lingua franca for the entire region.* ### Later Malay sultanates After Melaka was [conquered](/wiki/Capture_of_Malacca_(1511)) by the [Portuguese](/wiki/Portuguese_Empire) in 1511, and the ruling family had established a successor polity in [Johor](/wiki/Johor_Sultanate), it would appear that the 'ways of Malay' continued to be fostered and began to have an influence in surrounding sultanates. Startling even to the Portuguese conquerors was the extent to which most of [Sumatra](/wiki/Sumatra)'s east coast had been influenced by its neighbour across the straits; almost all urban elites spoke Melakan Malay, and they also acknowledged not only correct speech but also good manners and appropriate behaviour, as Malay custom. The role of Melaka as a model also becomes evident, when comparing its [law codes](/wiki/Undang-Undang_Melaka) with those of other succeeding Malay sultanates. Malay language was one aspect of the prestige of the sultanates and considered as a language of the learned in Southeast Asia in 17th and 18th century comments. An 18th-century European account even suggests that one is not considered a very broadly educated man in the east unless he understands Malay. Such observations on the influence of the Malay language and kingship concepts relate to the inter-monarchical context. At the local level, individual Malay sultanates all over the archipelago that usually based on rivers and often close to the coast, exercised sufficient attractiveness, or suasion, to foster a process of assimilation. They were operating on a range of frontiers – in Sumatra, Borneo and the peninsula – where non-Muslim peoples, in many cases the tribal communities, were gradually being brought into Malay realm: learning to speak the Malay language, adopting Islam, changing their customs and style of dress and assuming roles of one type or another within the expanding sultanates. In an early example from eastern Sumatra, the 15th century Sultanate of Aru, believed to be the precursor of Malay [Sultanate of Deli](/wiki/Sultanate_of_Deli), is described in the Melaka-Johor chronicle as being of [Batak](/wiki/Batak) origin. European observations on the same region from the 19th century suggests that people further upstream on the rivers of Deli, people who had long had a trading relationships with the coast, and were later called [Karo Batak](/wiki/Karo_people_(Indonesia)), were being incorporated in the Deli Sultanate. The Batak and Malay distinction was not racial but cultural, and by converting to Islam and taking on Malay dress and culture, the Batak could become Malay. Both European and Malay writings show them being tutored in the new culture, receiving Malay titles such as *Orang Kaya Sri di Raja* as part of the process of conversion. Similar developments were underway in [Asahan](/wiki/Sultanate_of_Asahan), to the south, and on the [Barus](/wiki/Barus) frontier in the northwest of Sumatra where entry to the new sphere entailed not only a change in manners and clothing styles, but also the adoption of the Islamic religion and the Malay language. On the peninsula, the effects of the continued contacts between the non-Malays with Malay-dominated centre is suggested in a 19th-century account of [Pahang](/wiki/Pahang), which mentions that some of the natives who had strong trading ties with the Malays had begun to emulate their speech and dress. The population of [Pattani](/wiki/Pattani_Kingdom) also has been described as partly aboriginal in origin. In the case of [Johor](/wiki/Johor_Sultanate), the aboriginal people who were reported in the 19th century to be speaking [Aslian languages](/wiki/Aslian_languages), were called 'Malay' a century later. It has been suggested that these people would probably have joined the [Jakun](/wiki/Jakun_people) first before becoming Malay. The Jakun are described as being similar to Malays in their kinship arrangements, but resistant to aspects of social structure as well as the Islamic religion of the Malays. In 17th century [Cambodia](/wiki/Cambodia), a polity renowned for its [Buddhism](/wiki/Buddhism), [king](/wiki/List_of_kings_of_Cambodia) Ramathipadi I converted to Islam, took the name Muhammad Ibrahim, married a Malay Muslim of a princely Cham family,[*citation needed*] had his courtiers wear [krisses](/wiki/Kris) and used Malay language in correspondence. During the same century in [Champa](/wiki/Champa), a once powerful Indianized polity but by that time retreating before the advancing [Vietnamese](/wiki/Vietnamese_people), the rulers held the title *Paduka Seri Sultan* which is so common in the Malay polities. These rulers were in close contact with the peninsula, in particular [Kelantan](/wiki/Kelantan). French missionaries reported the presence of scribes and religious scholars from Kelantan right into the 19th century. It was believed that Kelantanese who eventually helped to give the Cham struggle against the Vietnamese, the character of a [religious crusade](/wiki/Jihad). In [Brunei Sultanate](/wiki/Brunei_Sultanate), many of the Muslim subjects of the Sultan were converts from local [Dayak](/wiki/Dayak_people) groups. Acculturation had also taken place in [Sarawak](/wiki/Sarawak) and Northern Borneo (modern day [Sabah](/wiki/Sabah)), where Brunei Sultanate and by the 18th century the Sulu Sultanate were collecting products for China and other markets, and establishing a fairly loose, river based governmental presence. Dayak chiefs were incorporated into the Brunei hierarchy, being given [Malay titles](/wiki/Malay_styles_and_titles) such as *[Datuk](/wiki/Datuk)*, *[Temenggong](/wiki/Temenggong)* and *Orang Kaya*. What had once been independent villages were gradually built into wider units, and their leaders co-opted into the hierarchy of the polity. A colonial writing about Sarawak, observed that many non-Malays would be amazed to learn the degree to which the present Malay population derives from the local native sources, and among the latter are Sea ([Iban](/wiki/Iban_people)) and Land Dayaks ([Bidayuh](/wiki/Bidayuh)). In [northeastern Borneo](/wiki/Kalimantan_Utara), the [Bulungan](/wiki/Bulungan_Sultanate) Malays appear to be of [Kayan](/wiki/Kayan_people_(Borneo)) origin. Further down the [east coast](/wiki/East_Kalimantan), the [Paser](/wiki/Paser_Regency) polity had extended its influence into the [Barito](/wiki/Barito_River)-speaking Dayak, and some of these people became Muslim and were eventually referred to as 'Paser Malays'. In [southern Borneo](/wiki/Kalimantan_Selatan), the Malay-speaking [Sultanate of Banjar](/wiki/Sultanate_of_Banjar) had been pushing inland since the 17th century, bringing Dayaks into its Muslim culture. In the [west](/wiki/West_Kalimantan), the development of such sultanates of [Sambas](/wiki/Sultanate_of_Sambas), [Sukadana](/wiki/Sukadana) and [Landak](/wiki/Landak_Regency) tells a similar tale of recruitment among Dayak people. Malay culture also influenced many [Philippine](/wiki/Philippine) kingdoms where things may have only developed differently after Christianisation and cultural separation due to [Spanish conquest](/wiki/History_of_the_Philippines_(1521%E2%80%931898)) and subsequent policies. By 1521, it is certain that the Malay language was extensively used for international communication, making it established that the Philippines was part of linguistically diverse Southeast Asia that used Malay as a common language among the ruling classes. Besides the use of Malay when Filipinos first interacted with Spaniards and other Europeans, other Malayan cultural influence is also evidenced by the use of the Malay language in titles and other diplomatic and religious terms in Philippine kingdoms, as was the case for much of the rest of Malayan Southeast Asia. These include titles such as *[datu](/wiki/Datu)* and *[laksamana](/wiki/Laksamana)*, as well as the terms for 'rank' (pangkat), 'sitting legs crossed' (bersila), 'treason' (derhaka), 'magical chanting' (mantera) and 'story' (hikayat). As for specific diplomatic ties, the influence of the Brunei sultanate on the [Kingdom of Luzon](/wiki/Kingdom_of_Luzon), for example, is well recorded. [King Ache the Old](/wiki/Raja_Matanda) of Luzon, or *Raja Matanda*, who resided in [Manila](/wiki/Manila) in 1521, was said to be a grandson of [Sultan Bolkiah](/wiki/Sultan_Bolkiah) of Brunei. Borneans were described to have taught Islam to people of [Balayan](/wiki/Balayan), [Manila](/wiki/Manila), [Mindoro](/wiki/Mindoro) and Bonbon. Borneans and Luzonians were also described as 'almost one people', and their clothing styles and ceremonies and customs were certainly similar. Malayisation also occurred in the form of acculturation, in addition to complete assimilation into Malay identity. In this way, it shaped the ethnocultural development of [creole](/wiki/Creole_peoples) ethnic group such as [Betawi](/wiki/Betawi_people), [Banjar](/wiki/Banjar_people), [Peranakan](/wiki/Peranakan), [Jawi Peranakan](/wiki/Jawi_Peranakan), [Kristang](/wiki/Kristang_people), [Chitty](/wiki/Chitty) and so forth. Such acculturation process was also reflected by assimilation of immigrants from other part of Maritime Southeast Asia, commonly known as *anak dagang* ('traders'), into the established Malay communities, aided by similarity in lifestyle and common religion ([Islam](/wiki/Islam)). Among these immigrant communities, some cultural elements of Malay origin were later combined in various forms and degrees with their own elements, which partly retained. Notable groups including the [Javanese](/wiki/Javanese_people), [Minangkabau](/wiki/Minangkabau_people) and [Bugis](/wiki/Bugis) Malays. ## Contemporary events ### Malaysia The Malay Peninsula, now an important part of Malaysia, has been the stronghold of Malay sultanates for centuries. As the entire peninsula was consolidated under Melaka's rule in the 15th century, it became the core of the [Malay world](/wiki/Malay_world) since then, thus earning its name *[Tanah Melayu](/wiki/Tanah_Melayu)* (\"Malay land\") in Malay language. The traditional institutions of [sultanates](/wiki/Monarchies_of_Malaysia) in the peninsula survived the [colonisation](/wiki/History_of_Southeast_Asia#European_colonisation), and were incorporated into the blueprints of the modern state in 1948. Ultimately, [Malay rulers](/wiki/Malay_rulers) remained at the highest hierarchical order of the society. Malayness has been conceived as fundamental basis for state's ideology and it became the main driving force for [Malay nationalism](/wiki/Malay_nationalism) in a struggle against British colonisation. The state itself is largely organised around the idea of maintaining the special status of Malays as the first among equals of the *[Bumiputra](/wiki/Bumiputra)* communities. The historical identification of the Malays with Islam was entrenched in the [Article 160 of the Constitution of Malaysia](/wiki/Article_160_of_the_Constitution_of_Malaysia). The article defines specifically a \"Malay\" as a person who professes the religion of Islam, habitually speaks the Malay language and conforms to Malay custom. The Malaysian government also has taken the step of defining Malaysian Culture through the 1971 [National Culture Policy](/wiki/National_Culture_Policy), which defined what was considered official culture, basing it around Malay culture and integrating Islamic influences. The government has historically made little distinction between \"Malay culture\" and \"Malaysian culture\". Although it has been a subject of criticism even by the Malays themselves, the notion of becoming a Muslim means *Masuk Melayu* (entering Malayness) remains popular. This could have been caused by the centuries-old unclear distinction between \"Islamisation\" and \"Malayisation\", for there is a high tendency of the new revertees having eventually Malayised by the dominant Malay-Muslim culture. [Peninsular Malaysia](/wiki/Peninsular_Malaysia) is home to a small indigenous tribal populations, collectively known as [Orang Asli](/wiki/Orang_Asli). The Malayic speakers among them, already share a common cultural-historical background with the Malays, who can therefore easily see them as \"incomplete\" Malays, requiring only Islam and an acceptance of social hierarchy to make them \"complete\". There are also those who speak languages unrelated to Malay, such as Aslian-speakers, are not quite so easily seen as incomplete Malays, but the gap can be closed to a considerable extent by conversion to Islam. Governmental agencies, both state and federal, including for many years the JHEOA (now known as [JAKOA](/wiki/Orang_Asli_Affairs_Department)) itself, have accordingly spent much effort in converting the Orang Asli to Islam. The motivation for this is sometimes authentically religious, but it is more usually seen primarily as the means of Malayisation. Governmental policy towards Orang Asli has long proposed their integration into the broader Malaysian community should be brought about by assimilating them specifically into the Malay community, which by local custom and national law is Sunni Muslim by religion. JHEOA officers have been heard to comment that the Orang Asli \"problem\" - usually defined as that of poverty - would disappear if they became Muslims, and hence Malays. In September 1996, for example, the Secretary General of the Ministry of Land and Co-operative Development, Nik Mohamed Zain Nik Yusof, gave the following justification for the Federal government's newly announced review of legislation relating to Orang Asli land rights: \"If these amendments are made, Orang Asli can be more easily integrated into Malay society. It will help them to embrace Islam and follow Malay customs too\". The impact of this institutionalised assimilation efforts has been tremendous to the demographics in certain area of the peninsula. One instance was in the [Sedili](/wiki/Sedili) valley, where modern anthropologists discovered in the 1970s that villages formerly reported by travellers to be Jakun, are now Malay communities. In the multi-ethnic state of [Sabah](/wiki/Sabah), the period of [Mustapha Harun](/wiki/Mustapha_Harun) leadership (1967–1976) saw the processes of Malayisation and Islamisation, which from the federal government's view appeared to be a check on Kadazandusun nationalism and was therefore perceived as an integration and unifying process with the other native Muslim society, namely the Bajaus, Bruneis, Sungei and Ida'an. The then-mostly pagan Kadazandusun traditionally formed minority of a third of the state population and inhabited the western shores of Sabah. The successor [Berjaya](/wiki/Sabah_People%27s_United_Front) government under [Harris Salleh](/wiki/Harris_Salleh) continued the same policies. The state government promoted Malay language in government-aided schools, sponsored the [Quran](/wiki/Quran)-reading competitions and organised various [dawah](/wiki/Dawah) activities. All these the Berjaya government considered to be in line with the spirit of Article 12(2) of the [Constitution of Malaysia](/wiki/Constitution_of_Malaysia) that provide legitimacy for the state to promote and assist in the funding of Islamic institutions and instruction, the core of which was to be derived from Malay-Muslim elements. ### Brunei The traditional Malay notion of fealty to a ruler, charged to protect Islam in his territory, is still central in both Malaysia and Brunei. In Brunei, this has been institutionalised under the state ideology of *[Melayu Islam Beraja](/wiki/Melayu_Islam_Beraja)* (\"Malay Islamic Monarchy\"). As a still functioning Malay sultanate, Brunei places Islamic institutions at the centre of the state's interest. It retains an elaborated Malay social hierarchy central to the community. As a result, there are two kind of Malayness in Brunei: the general Malay cultural pattern to which most of the population have by now assimilated, and the higher ranking social position labelled as \"Berunai\" which distinguishes some of those cultural-Malays from others. The other main community, the [Kedayans](/wiki/Kedayan), still rank lower, despite being Muslims and living in a manner virtually identical to that of the *Orang Berunai*. Thus, unlike what happens elsewhere, assimilation to Malay cultural pattern in Brunei does not necessarily eradicate difference. ### Singapore [Singapore](/wiki/Singapore) was once the powerhouse of sophisticated Malay cultural production, until [Kuala Lumpur](/wiki/Kuala_Lumpur) took over in the 1970s. Malays were the most urbanised of the island's three main races, and there was no such concentration of urbanised Malays anywhere else in the Malay world. Here were produced a high proportion of the modernist Malay writings, including novels and newspapers, that generated Malay nationalism. The emergence of Singapore-Malay community was added to by intermarriage with [Arabs](/wiki/Arab_people), [Indian Muslims](/wiki/Indian_Muslims) and Peninsula Malays immigrants, as well as the adoption of Chinese babies. In other words, Singapore's Malayness was a creolised culture, closer in character to the *Pesisir* (coastal) Malay culture that had developed elsewhere in the archipelago than to the kind of Malayness that characterised the Malay world proper of the peninsula and Sumatra. In Singapore itself, assimilation to Malayness was and is purely cultural, with no guiding hand to facilitate the process. ### Indonesia Historically, Indonesia was home to a number of Malay sultanates that were involved in the process of Malayisation throughout the archipelago. The three main elements often associated with the concept of Malayization, namely the Malay monarchy or loyalty to the sultan as the ruler of the Malays, the dominance of Malay identity which includes ethnic and linguistic aspects, and the position of Islam as the official religion, have no official recognition in modern Indonesian statehood. This is mostly because the [pluralism](/wiki/Pluralism_(political_theory)) and [diversity](/wiki/Unity_in_diversity) policy enshrined in the [Pancasila](/wiki/Pancasila_(politics)) national ideology avoids domination of certain group over another.[*citation needed*] Contrary to Brunei and Malaysia, a major component of Malayness — fealty to a ruling sultan — was removed from the modern Indonesian [republican](/wiki/Republic) ideology. Indonesian republican outlook regard [monarchy](/wiki/Monarchy) as a form of ancient [feudalism](/wiki/Feudalism) and incompatible to modern [democratic](/wiki/Democracy) statehood envisioned by Indonesian founding fathers. The movement against ruling monarch mainly led by [leftist](/wiki/Leftist) and [nationalist](/wiki/Nationalist) that seek to dismantle traditional royal institution. In March 1946, a [major uprising](/wiki/East_Sumatra_revolution) broke out against several Malay-Muslim Sultanates and rich Malay classes in East Sumatra, removing the traditional feudal social structure in the region. Today, several regional kingdoms or sultanate survive, despite holding no actual political power and without real authority, being replaced by provincial [gubernatorial](/wiki/Governor) administration. The exception is the Javanese [Yogyakarta Sultanate](/wiki/Yogyakarta_Sultanate) that won special region status, mostly owed to the sultanate's bid and support for the Indonesian Republic during the [Indonesian National Revolution](/wiki/Indonesian_National_Revolution). These sultanates and kingdoms are only recognised as the custody of local culture, arts and traditions, although they might still enjoy prestige and held in high esteem especially among the local community. Officially, Malayness has no special position in Indonesian state ideology, except as one of the constituent regional cultures — which tend to be represented on a province-by-province basis. Loyalty for a certain ethnic group was overshadowed with the new inter-ethnic loyalty, advocating the importance of the national unity and national identity of *Bangsa Indonesia* (\"Indonesian nation\") instead. Despite having widespread influence in the archipelago, [ethnic Malay](/wiki/Ethnic_Malay) is only recognised as one of myriad [Indonesian ethnic groups](/wiki/Ethnic_groups_in_Indonesia), which enjoy equal status with other Indonesians such as [Javanese](/wiki/Javanese_people), [Sundanese](/wiki/Sundanese_people), [Minang](/wiki/Minangkabau_people), [Dayak](/wiki/Dayak_people), [Chinese Indonesian](/wiki/Chinese_Indonesian), [Ambonese](/wiki/Ambonese_people) and [Papuan](/wiki/Indigenous_people_of_New_Guinea). Despite being the source of the [Indonesian national language](/wiki/Indonesian_language), Malay itself has been degraded as a mere local dialect in Sumatra, equal in status with [Minangkabau](/wiki/Minangkabau_language), [Acehnese](/wiki/Acehnese_language) and [Batak](/wiki/Batak_language) languages. Compared to local Malay dialects in Sumatra, Indonesian developed further which absorbed terminology and vocabulary from other native Indonesian languages, as well as variations of local dialects across Indonesia. Despite being the overwhelmingly majority religion, [Islam](/wiki/Islam_in_Indonesia) is recognized just as one among six official [religions recognized in Indonesia](/wiki/Religion_in_Indonesia), together with [Protestantism](/wiki/Protestantism), [Catholicism](/wiki/Catholicism), [Hinduism](/wiki/Hinduism), [Buddhism](/wiki/Buddhism) and [Confucianism](/wiki/Confucianism). There is also no legal law, apart from family and peer pressure, to restrict [Malay Indonesians](/wiki/Malay_Indonesian) to Islam. The strength of nationalist sentiments, rapidly progressing democracy, the destruction of the sultanates, and rampant [Javanisation](/wiki/Javanisation), ushered in a prolonged period of Malay political acquiescence, significantly reducing the momentum of Malayisation in Indonesia. ### Cambodia The strong influence of Malaysia in religious education has involved a degree of Malayisation among the [Cham](/wiki/Cham_people) community in [Cambodia](/wiki/Cambodia), including the wearing of Malay dress and the study of the Malay language. The many thousands of Chams who were allowed into Malaysia as refugees from [the war in Indochina](/wiki/Indochina_Wars) tended to be referred to by Malays in Malaysia as *Melayu Champa* (\"Champa Malays\") or *Melayu Kemboja* (\"Cambodian Malays\"). Another community in Cambodia, the Chvea who tend to live in villages in the southern region of [Kampot](/wiki/Kampot_(town)), are a separate community from the Chams, who have illustrious historic roots in [Vietnam](/wiki/Vietnam). The [Khmer](/wiki/Khmer_language)-speaking Chvea are distinct from the Cham, and preferred to be called as 'Khmer Islam', so as not to draw attention to their foreignness. Nevertheless, they use Malay language religious materials, write in the Jawi script, and many also speak Malay. Both Chvea and Cham have in recent years been drawn into pan-Malay conferences and networks promoted primarily by Malaysia. ### Sri Lanka There is a sizeable [Malay community](/wiki/Sri_Lankan_Malays) in Sri Lanka, descended from soldiers, convicts, and political exiles brought from the [Dutch East Indies](/wiki/Dutch_East_Indies) and [British Malaya](/wiki/British_Malaya). The [Sri Lankan Creole Malay](/wiki/Sri_Lankan_Creole_Malay) varieties spoken by the community, are currently endangered as they are no longer spoken by the younger generation. However, in recent years, there have been efforts in sharpening the sense of Malay identity by promoting the usage of 'standard Malay' language. This move was favoured by the urban segment of the community as it enables them to feel linked to the larger Malay groups in Southeast Asia. The community's effort to teach standard Malay to its members is largely aided by the [Malaysian government](/wiki/Government_of_Malaysia) through its high commission in [Colombo](/wiki/Colombo). The high commission conducted courses in standard Malay, exclusively for members of the Malay community, and those who fared the best were trained as language teachers in Malaysia. They were then expected to teach 'standard' Malay to their respective communities in Sri Lanka. These initiatives were welcomed and appreciated by the community. The language programmes and trips to Malaysia were made possible through the offices of the *Gabungan Persatuan Penulis Nasional* (GAPENA - the Federation of National Writers' Association of Malaysia). The Malaysian government, chose to conduct the second GAPENA conference in Colombo in 1985. The Malaysian government also arranges periodic visits by representatives of the Malaysian government to the Malay Club in Colombo where grants are given for various community projects, and finances occasional trips to Malaysia for members of the community to attend conferences and seminars paid for by Malaysia. The Indonesian government, does not seem to have similar aggressive efforts through its embassy in Colombo. As a result, although the Sri Lankan Malays are predominantly of Indonesian origins (especially [Javanese](/wiki/Javanese_people)), an attempt by a Sri Lanka Indonesian organization to reconstitute them as 'Indonesians', was not successful. ## Bibliography\n",
  "language": "en",
  "processed_at": "2026-01-12T11:28:50.863647",
  "title": "Malayisation",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Malayisation"
}