{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:28:33.154017"
  },
  "content": "Languages descended from Low Malay In addition to its [classical](/wiki/Classical_language) and modern [literary](/wiki/Literary_language) form, [Malay](/wiki/Malayic_languages) had various [regional dialects](/wiki/Nonstandard_dialect) established after the rise of the [Srivijaya empire](/wiki/Srivijaya) in [Sumatra](/wiki/Sumatra), [Indonesia](/wiki/Indonesia). Also, Malay spread through interethnic contact and trade across the south East Asia Archipelago as far as the Philippines. That contact resulted in a [lingua franca](/wiki/Lingua_franca) (\"trade language\") that was called *Bazaar Malay* or *low Malay* and in Malay *Melayu Pasar*. It is generally believed that Bazaar Malay was a [pidgin](/wiki/Pidgin), influenced by contact among Malay, Hokkien, Portuguese, and Dutch traders. Besides the general simplification that occurs with pidgins, the Malay lingua franca had several distinctive characteristics. One was that possessives were formed with *punya* 'its owner, to have'; another was that plural pronouns were formed with *orang* 'person'. The only Malayic affixes that remained productive were *tər-* and *bər-*. Other common features: - *Ada* became a [progressive](/wiki/Continuous_and_progressive_aspects) particle. - Reduced forms of *ini* 'this' and *itu* 'that' (>*ni*, *tu*) before a noun. - The verb *pərgi* 'go' was reduced, and became a preposition 'towards'. - [Causative](/wiki/Causative) constructions were formed with *kasi* or *bəri* 'to give' or *bikin* or *buat* 'to make'. - A single preposition, often *sama*, was used for multiple functions, including direct and indirect object. For example, - *Rumahku* 'my house' becomes *Aku punya rumah* (lit. 'I have (that) house') - *Aku pukul dia* 'I hit him' becomes *Aku kasi pukul dia* (lit. 'I give a hit to him') - *Ardi dipukul oleh Dani* 'Ardi is hit by Dani' becomes *Ardi kena pukul dek Dani* ## Peranakan-Baba Malay ### Baba Malay **Baba Malay** is spoken by the [Peranakans](/wiki/Peranakan) in [Malacca](/wiki/Malacca) (in Malaysia) and [Singapore](/wiki/Singapore). A typical contact language between [Hokkien](/wiki/Hokkien) male settlers and local Malay women, it has \"more Hokkien grammar and more Malay lexicon\". As of 2014, there are 1,000 speakers in Malaysia and another 1,000 in Singapore. It is mostly spoken among the older populations. In 1986, Pakir estimated there were 5,000 speakers in Singapore. A Baba Indonesian variant is also spoken in [East Java](/wiki/East_Java). Example (spoken in Melaka-Singapore): - *Dia suka datang sini sembang.*: He likes to come here and gossip. - *Keliap-keliap, dia naik angin.*: Slightly provoked, he gets angry. - *Gua tunggu dia sampai gua k'ee geram.*: I waited for him until I got angry. - *Oo-wa! Kinajeet, dia pasang kuat.*: Wow! Today he dresses stylishly! ### Baba Indonesian A kind of Baba Malay, locally called *Peranakan* from the ethnonym, is spoken among [Chinese-Indonesians](/wiki/Chinese-Indonesian) living in various regions of Indonesia, most visibly in Surabaya and Medan. It is a mixture of three languages: [Indonesian](/wiki/Indonesian_language) (national language), a local language and Chinese elements (ancestry/ethnic language, particularly for certain jargon or glossary such as family relations, business and commerce, and culinary fields). The most famous variety is found in East Java, especially in [Surabaya](/wiki/Surabaya) and surrounding areas, called *Basa Suroboyoan* (Surabayan language), with a strong emphasis of low Javanese (*ngoko* Javanese) and informal tone, which is not only spoken by Chinese-Indonesian in Surabaya, but also by non-Chinese-Indonesians when conversing with the former. Example (spoken in [Surabaya](/wiki/Surabaya)): - *Kamu mbok ojok gitu!*: Don't act that way! - *Yak apa kabarnya si Eli?*: How's Eli? - *Ntik kamu pigio ambek cecemu ae ya.*: Go with your sister, okay? - *Nih, makanen sakadae.*: Please have a meal! - *Kamu cariken bukune koko ndhek rumahe Ling Ling.*: Search your brother's book in Ling Ling's house. Apart from East Javan Chinese-Indonesian, other Chinese-Indonesians tend to speak the language varieties of the places in which they live, such as the Central Javan Chinese-Indonesian can speak with formal/high Javanese (*krama* Javanese) when necessary, while in daily conversation they will use Indonesia-Javanese-Chinese pidgin. West Javan Chinese-Indonesians tend to mix [Sundanese](/wiki/Sundanese_language) in their vocabulary, and Medan (North Sumatran) Chinese-Indonesian have more [Hokkien words](/wiki/Hokkien_language) mixed in. ## Betawi Malay [Betawi](/wiki/Betawi_language), also known as Batavian, Jakartanese, Betawi Malay, Batavian Malay, or Jakarta Malay, is the spoken [language](/wiki/Language) of the [Betawi people](/wiki/Betawi_people) in and around [Jakarta](/wiki/Jakarta), [Indonesia](/wiki/Indonesia). The name \"Betawi\" stems from *Batavia*, the official name of Jakarta during the era of the [Dutch East Indies](/wiki/Dutch_East_Indies). A precise number of speakers is difficult to determine due to the vague use of the name. Linguistically, the traditional dialects as spoken for [in-group](/wiki/In-group) communication within the Betawi community differ quite significantly from [Colloquial Jakarta Indonesian](/wiki/Colloquial_Jakarta_Indonesian), the vernacular [Indonesian](/wiki/Indonesian_language) variety used as a lingua franca among the diverse urbanites in [Greater Jakarta](/wiki/Greater_Jakarta) and elsewhere in Indonesia. In modern-day Jakarta and the surrounding area, Betawi and Indonesian are often used in a [continuum](/wiki/Post-creole_continuum), with traditional varieties as the [basilect](/wiki/Basilect) and Standard Indonesian as the [acrolect](/wiki/Acrolect). Colloquial Jakarta Indonesian, which sits in the middle, incorporate significant influence not only from Betawi, but also from other languages brought by migrants to Jakarta. According to Uri Tadmor, there is no clear border distinguishing Colloquial Jakarta Indonesian from Betawi language. ## Thousand Islands Malay The [Orang Pulo language](/wiki/Orang_Pulo_language) (*Logat Orang Pulo*), alternatively known as *Melayu Campuran* (Mixed Malay) or *Melayu Kepulauan Seribu* (Thousand Islands Malay), is a Malay-based creole spoken by the Orang Pulo (lit. 'People of Island') inhabiting the [Thousand Islands](/wiki/Thousand_Islands_(Indonesia)) off the coast of [Jakarta](/wiki/Jakarta), [Indonesia](/wiki/Indonesia). This language emerged from a mixture of many [languages in Indonesia](/wiki/Languages_of_Indonesia), particularly [Buginese](/wiki/Buginese_language) and [Malay](/wiki/Malay_language). ## Malaccan Creole Malay The [Malay Chetty creole language](/wiki/Malay_Chetty_creole_language) (also known as Malaccan Creole Malay, Malacca Malay Creole and Chitties/Chetties Malay) is a Malay-based creole spoken by the [Chetties](/wiki/Chitty) (also known as Indian Peranakans), a distinctive group of [Tamil people](/wiki/Tamils) found mainly in [Malacca](/wiki/Malacca) in [Malaysia](/wiki/Malaysia) and [Singapore](/wiki/Singapore), who have adopted Chinese and Malay cultural practices whilst also retaining their Hindu heritage. ## Sri Lanka Malay [Sri Lankan Malay](/wiki/Sri_Lanka_Malay_language), also known as Sri Lankan Creole Malay, bahasa Melayu, Ja basawa, or Java mozhi, is a Malay-based creole language spoken in [Sri Lanka](/wiki/Sri_Lanka), formed as a mixture of [Sinhala](/wiki/Sinhala_language) and Shonam ([Sri Lankan Muslim Tamil](/wiki/Sri_Lankan_Moors#Sri_Lankan_Muslim_Tamil)), with [Malay](/wiki/Malay_language) being the major [lexifier](/wiki/Lexifier). It is traditionally spoken by the [Sri Lankan Malays](/wiki/Sri_Lankan_Malays), [Javanese Sri Lankans](/wiki/Javanese_Sri_Lankans), and among some [Sinhalese](/wiki/Sinhalese_people) in [Hambantota](/wiki/Hambantota). Today, the number of speakers of the language have dwindled considerably but it has continued to be spoken notably in the [Hambantota District](/wiki/Hambantota_District) of Southern Sri Lanka, which has traditionally been home to many Sri Lankan Malays. ## Singapore Bazaar Malay **Singapore Bazaar Malay**, also known as **Bazaar Malay**, **Pasar Malay**, or **Market Malay**, is a Malay-lexified pidgin, which is spoken in Singapore. Tamil and Hokkien contributed to the development of Bazaar Malay, with Hokkien being the dominant substrate language of Bazaar Malay, with Malay being the lexifier language. However, there are many input languages spoken by immigrants that also contributed to the development of Bazaar Malay, including languages spoken by Malays, Chinese, Indians, Eurasians, and Europeans. Singapore Bazaar Malay emerged along with the opening of Singapore's free trade port in 1819, to overcome barriers in communication and business transactions. Since Singapore has only four official languages (English, Mandarin, Malay, and Tamil), Singapore Bazaar Malay not only is a lingua franca in interethnic communication, it is also used in intra-group communication. Singapore Bazaar Malay is mostly spoken by elders and middle-aged workers today, but its language status is declining due to education policies and language campaigns with less than 10,000 speakers. Bazaar Malay is used in a limited extent in Singapore and Malaysia, mostly among the older generation or people with no working knowledge of English. The most important reason that contributed to the decline of Bazaar Malay is that pidgin Malay has [creolised](/wiki/Creole_(linguistics)) and created several new languages. Another reason is due to language shift in both formal and informal contexts, Bazaar Malay in Singapore is gradually being replaced by English, with English and its creole [Singlish](/wiki/Singlish) being the lingua franca among the younger generations. ## Sabah Malay\n",
  "language": "en",
  "processed_at": "2026-01-12T11:28:33.153542",
  "title": "Malay trade and creole languages",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Malay_trade_and_creole_languages"
}