{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:28:16.801098"
  },
  "content": "Ethnic group of SingaporeEthnic groupPart of a series on[Singaporeans](/wiki/Demographics_of_Singapore) - [Arabs](/wiki/Arab_Singaporeans) - [Armenians](/wiki/Armenians_in_Singapore) - [Australians](/wiki/Australians_in_Singapore) - [Burmese](/wiki/Burmese_people_in_Singapore) - [Chinese](/wiki/Chinese_Singaporeans) - [Peranakans](/wiki/Peranakans) - [PRC](/wiki/Chinese_nationals_in_Singapore) - [Chitty](/wiki/Chitty) - [Eurasians](/wiki/Eurasian_Singaporeans) - [Filipinos](/wiki/Filipinos_in_Singapore) - [Indians](/wiki/Indian_Singaporeans) - [Japanese](/wiki/Japanese_people_in_Singapore) - [Jawi Peranakan](/wiki/Jawi_Peranakan) - [Jews](/wiki/History_of_the_Jews_in_Singapore) - [Koreans](/wiki/Koreans_in_Singapore) - Malays - [Nepalis](/wiki/Nepalis_in_Singapore) - [Pakistanis](/wiki/Pakistanis_in_Singapore) - [Sri Lankans](/wiki/Sri_Lankans_in_Singapore) - [Tamils](/wiki/Singapore_Tamils) - [Thais](/wiki/Thais_in_Singapore) - [Vietnamese](/wiki/Vietnamese_in_Singapore) - v - t - e **Malay Singaporeans** ([Malay](/wiki/Malay_language): *Orang Melayu Singapura*) are [Singaporeans](/wiki/Singaporeans) of [Malay](/wiki/Malays_(ethnic_group)) ancestry, including those from the [Malay Archipelago](/wiki/Malay_Archipelago). As of the 2020 census, they constitute approximately 13.5% of the country's residents, making them the second largest ethnic group in [Singapore](/wiki/Singapore). Under the [Constitution of Singapore](/wiki/Constitution_of_Singapore), they are recognised by the government as the [indigenous people](/wiki/Indigenous_people) of the country, with [Malay](/wiki/Malay_language) as the [national](/wiki/National_language) and [official language](/wiki/Official_language) of Singapore. At the time of the arrival of British colonial official [Stamford Raffles](/wiki/Stamford_Raffles) in 1819, the estimated population of Malays on the island was approximately 1,000. Another estimate suggests that at the time of Raffles' arrival, the population comprised around 120 Malays, 30 Chinese and some local indigenous [Orang Laut](/wiki/Orang_Laut) tribes. From the nineteenth century until [World War II](/wiki/World_War_II), the Malays generally enjoyed favourable treatment, as they were not resettled for labour and their traditional lifestyles were largely left undisturbed. However, as the British required coolies[b] to support their colonial enterprises, immigration rates among Malays remained relatively low compared to Indians and Chinese immigrants. The latter group notably became the majority ethnic population by the mid-nineteenth century. A significant portion of Malay Singaporeans trace their roots to nearby regions throughout [Maritime Southeast Asia](/wiki/Maritime_Southeast_Asia), such as the [Malay Peninsula](/wiki/Malay_Peninsula), [Java](/wiki/Java), [Sumatra](/wiki/Sumatra), [Sulawesi](/wiki/Sulawesi) and the [Riau Islands](/wiki/Riau_Islands). Many Malay Singaporeans originally belonged to different ethnic groups before assimilating into the Malay community. This migration has contributed to the rich cultural heritage of Malays in Singapore. These groups share common culture, customs, language and religion with the wider Singaporean society. They actively participate in all aspects of Singaporean life, with independent representation in areas such as media, politics and sports. ## History of the Malay kings of Singapore The seventeenth-century Malay chronicle, the [Sejarah Melayu](/wiki/Sejarah_Melayu) or [Malay Annals](/wiki/Malay_Annals), tells of the founding of a great trading city on the island of [Temasek](/wiki/Temasek) in 1299 AD by a prince from [Palembang](/wiki/Palembang). Palembang was then the capital of the diminishing [Srivijaya Empire](/wiki/Srivijaya_Empire). The prince, Sri Tri Buana, (also known as [Sang Nila Utama](/wiki/Sang_Nila_Utama)) was said to be a descendant of [Alexander the Great](/wiki/Alexander_the_Great) and an Indian princess called Shahru Al-Bariyah. Legend states that he renamed the city [Singapura](/wiki/Kingdom_of_Singapura) (\"lion city\") after sighting a strange beast that he took to be a lion, although there is no real historical evidence of this. In the mid-14th century, Singapura suffered raids by the expanding Javanese [Majapahit Empire](/wiki/Majapahit) to the south and the emerging Thai kingdom of [Ayutthaya](/wiki/Ayutthaya_Kingdom) to the north, both claiming the island as a vassal state at several points in time. Around 1388, the ruler of [Palembang](/wiki/Palembang), [Parameswara](/wiki/Parameswara_(king)), came to Singapore to flee from Majapahit control. He murdered the king and seized power, but it was a futile act. The Srivijaya Empire, already in decline, finally met its end when Majapahit attacked its capital Palembang in 1391. In 1396, Majapahit or Ayutthaya forces drove out Parameswara, who fled northward and founded kingdom of [Malacca](/wiki/Malacca_Sultanate) in 1400. When the [Portuguese captured Malacca in 1511](/wiki/Battle_of_Malacca_(1511)), the last Malaccan sultan, [Mahmud Shah](/wiki/Mahmud_Shah_of_Malacca), fled to [Johor](/wiki/Johor), where he established the new [Johor Sultanate](/wiki/Johor_Sultanate). Singapura became part of this sultanate. In 1613, however, the Portuguese reportedly burning down a trading outpost at the mouth of the [river](/wiki/Singapore_River) and Singapura passed into history. In 1718, Raja Kecil of [Minangkabau-Siak](/wiki/Sultanate_of_Siak_Sri_Indrapura) who claimed he was the posthumous son of Sultan Mahmud II, took control of the Johor Sultanate. Four years later, Raja Kecil was dethroned by Raja Sulaiman's supporters with the assistance of the [Bugis](/wiki/Bugis). The territory controlled by the [Johor-Riau Sultanate](/wiki/Johor_Sultanate) in the late eighteenth century still included Singapore as part of its territory. The sultanate had become increasingly weakened by a division into a Malay faction, which controlled the Malay peninsula and Singapore vis a vis a Bugis faction which controlled the [Riau Archipelago](/wiki/Riau_Archipelago). When Sultan [Mahmud Riayat Shah III](/wiki/Mahmud_Shah_III_of_Johor) died in 1811, the Bugis had proclaimed the younger of his two sons, [Abdul Rahman](/wiki/Abdul_Rahman_Muazzam_Shah_of_Johor), as sultan instead of the elder son, [Tengku Long](/wiki/Tengku_Long). While the sultan was the nominal ruler of his domain, senior officials actually governed the sultanate. In control of Singapore and the neighbouring islands was [Temenggong Abdul Rahman](/wiki/Temenggong_Abdul_Rahman), Tengku Long's father-in-law. In 1818, he and some of his followers left Riau for Singapore shortly after the Dutch signed a treaty with the Sultan Abdul Rahman, allowing the Dutch to station a garrison at Riau. In 1819, Tengku Long signed a treaty with the British led by Sir [Stamford Raffles](/wiki/Stamford_Raffles). In exchange for British protection and recognising him as Sultan of Johor, Tengku Long agreed to allow the British to establish a trading post in Singapore. Proclaimed as Sultan Hussein Shah, he became the Sultan of Johor. Hussein Shah's claim to be Sultan of Johor and Singapore was by all accounts not recognised by the Malay rulers and was only a nominal title. Sultan Hussein on his part, did not pursue any active claim to his sovereignty rights over Johor, spent much of his time at his residence in [Istana Kampong Glam](/wiki/Istana_Kampong_Glam) until he moved to Malacca in 1834. In 1835, Sultan Hussein Shah died and was succeeded by his eldest son, [Tengku Ali](/wiki/Ali_Iskandar_of_Johor). In 1855, due to his debts caused by his extravagant lifestyle, Sultan Ali formally ceded his sovereignty rights of Johor to [Temenggong Daeng Ibrahim](/wiki/Temenggong_Daeng_Ibrahim) with the exception of the [Kesang](/wiki/Kesang,_Malaya) territory in [Muar](/wiki/Muar_(district)), plus an annual stipend for his family. Thus, Temenggong Daeng Ibrahim was made the de facto Maharajah of Johor until his death in 1862. He was succeeded by his son [Abu Bakar](/wiki/Temenggong_Abu_Bakar), who eventually went on to become the Sultan of modern Johor in 1886. After Sultan Ali's death in 1877, disputes broke out among his descendants. In the late 1890s, they went to court, where it was decided that no one in the family had the rights as the successor to the sultanate and the land at Kampong Glam should revert to the state [***Tengku Mahmud vs. Tengku Ali, Straits Settlements Laws Report 1897 (Vol. 5)***]. ### Malay kings of Singapore (1299–1396 AD) - Sri Tri Buana ([Sang Nila Utama](/wiki/Sang_Nila_Utama)) (1299–1347) - Raja Kecil Besar ([Paduka Seri Wikrama Wira](/wiki/Paduka_Seri_Wikrama_Wira)) (1348–1362 (?) ) - Raja Muda ([Paduka Seri Rana Wikrama](/wiki/Paduka_Seri_Rana_Wikrama)) (1363–1374 (?) ) - Damia Raja ([Paduka Seri Maharaja](/wiki/Paduka_Seri_Maharaja)) (1375–1386 (?) ) - Parameswara ([Paduka Seri Iskandar Shah](/wiki/Iskandar_Shah)) (1388 or 1390 (?) –1397) ### Malay kings of Singapore (1699–1835 AD) - [Bendahara Sultan Abdul Jalil Riayat Shah IV](/wiki/Abdul_Jalil_Shah_IV_of_Johor) (Sultan of Riau-Lingga-Pahang) (1699–1718) - [Abdul Jalil Rahmat Shah](/wiki/Raja_Kecil) (Raja Kecil) (Sultan of Riau-Lingga-Pahang) (1718–1722) - Sultan Sulaiman Badrul Al-Alam Shah (Sultan of Johor-Riau-Lingga-Pahang) (1722–1760) - Sultan Mahmud Riayat Shah III (Sultan of Johor-Pahang) (1761–1812) - Sultan Abdul Rahman (Sultan of Lingga) (1812–1832) (Placed on the throne instead of his older brother Hussein, supported by Bugis) - Sultan Hussein Shah (Sultan of Johor) (1819–1835) (Recognised by the British as the rightful Sultan of Johor.) ## Migration of Malays to Singapore after 1819 When Raffles arrived in Singapore, thousands of Malays were estimated living in the surrounding areas. The waters of [Telok Blangah](/wiki/Telok_Blangah), the [Kallang River](/wiki/Kallang_River) and other rivers had long been home to the [Orang Laut](/wiki/Orang_Laut) or *Sea Nomads*. There were also Malay settlements along the Kallang River Basin and the [Singapore River](/wiki/Singapore_River). Turnbull reported that about 1,000 people lived in Singapore, including approximately 500 Orang Kallang, 200 Orang Seletar, 150 Orang Gelam, 100 Orang Laut and 20 to 30 Malays who were followers of [Temenggong Abdul Rahman](/wiki/Temenggong_Abdul_Rahman). The first census taken in 1824 revealed that Malays (including the [Bugis](/wiki/Bugis)) comprised 60.9 per cent of the total population of 10,683. The 1826 census recorded 4,790 Malays, 1,242 Bugis, and 267 Javanese out of a total population of 13,750. **Resident population of early Singapore** Ethnic GroupPopulation18241826Europeans7487Armenians1619Arabs1526Malays4,5804,790Bugis1,9251,242Javanese188267Indians7561,021Others12Total10,68313,750 ## Malay subgroups Most Singaporean Malays are descended from different ethnic groups that are found throughout the [Malay Archipelago](/wiki/Malay_Archipelago). Most notable are the indigenous tribes of the [Orang Laut](/wiki/Orang_Laut), Local [Malays](/wiki/Malays_(ethnic_group)), [Javanese](/wiki/Javanese_people), [Boyanese](/wiki/Bawean_people), [Bugis](/wiki/Bugis), [Minangkabau](/wiki/Minangkabau_people), [Banjarese](/wiki/Banjar_people), [Sundanese](/wiki/Sundanese_people), and [Bataks](/wiki/Bataks). ### Orang Laut (Sea Nomads) According to Sopher (1977), the Orang Kallang, [Orang Seletar](/wiki/Orang_Seletar), Orang Selat and Orang Gelam were the [Orang Laut](/wiki/Orang_Laut) that lived in Singapore. The Orang Kallang (also called the Orang Biduanda Kallang) lived in the swampy areas in the Kallang River. They lived on boats and sustained their lives by fishing and collecting other materials from the forests. After 1819, they were relocated by Temenggong Abdul Rahman to the northern Singapore Straits at Sungai Pulau. In 1847 most of the Orang Kallang were wiped out by a smallpox epidemic. The Orang Seletar lived in the river swamps and the small islands surrounding mainland Singapore. They would often gather in the coastal areas, especially on the estuary of the Seletar River. They lived a nomadic lifestyle until the 1850s when they started living on land and followed the lifestyles of others living in Singapore. The Orang Selat lived in the harbour waters of Keppel Singapore. They were believed to have traversed the waters of Keppel Harbour since the early 16th century, making them one of the earliest settlers of the island. They sold fish and fruits to the trading vessels that passed the area. The Orang Gelam came from a tribe in [Batam Island](/wiki/Batam_Island). They were brought by the Temenggong of Johor together with a group of his followers to establish a settlement in the first decade of the 19th century. Many of the Orang Gelam who lived along the Singapore River served as boatmen for merchant ships while their womenfolk were fruit sellers on boats. The Orang Laut differed from the Malays in that they lived a nomadic lifestyle and lived at sea in their boats whereas the Malays lived in settlements in the villages on the land. One example of an Orang Laut is Mohammed Abdul Rahmah. ### Malays proper (Johor–Riau) When Raffles came to Singapore, there were already hundreds of [indigenous Malays](/wiki/Malay_people) and orang laut living there. They were made up of the nobility that was headed by the Temenggong, the palace officials and his followers as well as the Orang Laut. Subsequently, the numbers increased with the arrivals of other Malays from [Malaya](/wiki/Malay_Peninsula) and the [Malay Archipelago](/wiki/Malay_Archipelago). In a matter of several months, hundreds of Malays from [Malacca](/wiki/Malacca) came to Singapore, encouraged by the British who wanted to develop Singapore as a centre for trade and administration. When Singapore became more developed and there were better economic opportunities, many Malays from [Johor](/wiki/Johor), [Riau Islands](/wiki/Riau_Islands), [Sumatra](/wiki/Sumatra), [Penang](/wiki/Penang) and [Malacca](/wiki/Malacca) came to Singapore. Many of these Malays lived in the towns and worked there. The census for 1931 showed that the total number of Malay men working here were as many as 11,290. Out of this number, 18% worked as fishermen and as many as 12% lived by farming the land. In the 1930s and 1950s, many Malay residents from Malaya were working in the British uniformed services. In 1957 alone, there were more than 10,000 Malays working in the uniform services because the British preferred them to the Javanese or [Malays from Indonesia](/wiki/Malay_Indonesian) (Betts, 1975:41; Djamour, 1959:5). However, during the period 1957–1970, most of them returned to Malaysia when their terms of services ended. ### Javanese The largest Malay sub-group in Singapore are the [Javanese](/wiki/Javanese_people). They came from [Java](/wiki/Java) in the [Dutch East Indies](/wiki/Dutch_East_Indies) (modern Indonesia). In the 1931 Population Census, the number of Javanese in Singapore was 16,063. The 1981 Population Census, however, showed that they made up 6% of the Malay population. However, many Javanese had actually registered themselves as 'Malay'. It is likely that the actual percentage of the Javanese within the Malay population was much higher. An ethnographic study in 1990 estimated that approximately 50–60% of Singaporean Malays have at least some degree of Javanese ancestry. The Javanese came to Singapore in stages. In the mid-19th century, they came and worked as ironsmiths, leather makers as well as spice merchants and religious books dealers. There were also a group of Javanese printers and publishers in the Arab Street area. There were also a community of pilgrim brokers that played an important role in encouraging the migration of the Javanese to Singapore. There are many Singapore's area and neighborhoods that has Javanese names such as [Kampong Java](/wiki/Kampong_Java), [Radin Mas](/wiki/Radin_Mas), Kampong Pachitan, Kampong Wak Hassan, Kampong Kembangan, and others. The political situation in the Dutch East Indies created by the Dutch government caused many Javanese to go through Singapore to travel to [Mecca](/wiki/Mecca) to perform the [Hajj](/wiki/Hajj). From the mid-19th century until 1910, between 2,000 and 7,000 Javanese travelled to Mecca through Singapore until the regulations were eased (Roff 1967:39). Usually, these pilgrims would work in Singapore for several months or years before or after performing the hajj to earn money or pay their debts to their pilgrim brokers. Many of them stayed in Singapore and became part of the Muslim community in the city (Roff, 1967:43). A number of Javanese also came to Singapore with the help of the pilgrim brokers. They came voluntarily and a majority of them were young men who stayed in the lodgings of the pilgrim brokers until they found work. They worked as food sellers, gardeners and provided labour for the pilgrim brokers to build lodging homes for them. The pilgrim brokers also took in bonded labourers who worked for Malay or Javanese employers to clear forests to set up settlements in [Johor](/wiki/Johor), Malaya (Roff, 1967:37). The activities with these bonded labourers continued until the 1920s. From 1886 till 1890, as many as 21,000 Javanese became bonded labourers with the Singapore Chinese Protectorate, an organisation formed by the British in 1877 to monitor the Chinese population. They performed manual labour in the rubber plantations. After their bond ended, they continued to open up the land and stayed on in Johor. After the Second World War, the total number of Javanese coming to Singapore continued to increase. The first wave consisted of conscript labour that was brought by the Japanese and their numbers were estimated to be about 10,000 (Turnbull, 1976:216). The second wave were those who moved to Singapore through Malaya. The 1970 Population Census showed that a total of 21,324 Malays who were born in Malaya (later Malaysia) had moved to Singapore in the years 1946–1955, and as many as 29,679 moved to Singapore from 1956–1970 (Census 1970:262-3). Interviews conducted showed that a majority of them were young men of Javanese descent from Johor who wanted to find a better life in Singapore. Most of them were not educated and not highly skilled and worked as manual labourers in the post-war years. In the 2010 census, Malays of Javanese descent numbered 89,000. ### Sundanese Just like their more populous Javanese neighbors, the [Sundanese](/wiki/Sundanese_people) also have a [diaspora in Singapore](/wiki/Sundanese_Singaporeans). However, their numbers are limited, even small. Most of them prefer to identify as Malays of Javanese descent, due to the Javanese dominance there. Their original territory came from the western part of [Java](/wiki/Java) in [Indonesia](/wiki/Indonesia) which currently includes [West Java](/wiki/West_Java), [Banten](/wiki/Banten), [Jakarta](/wiki/Jakarta) and a western part of [Central Java](/wiki/Central_Java) ([Brebes](/wiki/Brebes_Regency) and [Cilacap](/wiki/Cilacap_Regency)). The number was around 500 to 600 people in 2003. However, most of them are no longer of pure Sundanese descent many are mixed with other Malay races. Most of the Sundanese people come from East Priangan, such as [Tasikmalaya](/wiki/Tasikmalaya), [Majalengka](/wiki/Majalengka), [Garut](/wiki/Garut), and [Ciamis](/wiki/Ciamis), mainly working as traders. There are also some from West Priangan and [Banten](/wiki/Banten), such as from [Bandung](/wiki/Bandung), [Bogor](/wiki/Bogor), [Karawang](/wiki/Karawang) and [Purwakarta](/wiki/Purwakarta), most of whom previously worked as government employees during the colonial era. ### Boyanese The [Boyanese](/wiki/Bawean_people) originally came from the [Bawean Island](/wiki/Bawean_Island) in the Dutch East Indies (modern-day [Indonesia](/wiki/Indonesia)). They built the Kampung Boyan (Boyanese Village) by the banks of the Rochor River, between Jalan Besar and Syed Alwi Road since the time of [Munshi Abdullah](/wiki/Munshi_Abdullah). Most of them came to Singapore in the late 19th century until the end of Second World War. The majority of them worked as horse cart drivers and later as motorcar drivers. They could not be considered poor as their lands in Bawean were fertile; they had come in search of cash earnings. They wanted to purchase jewellery made of gold and goods that they could bring back to their villages. Some also wanted to build a better life for themselves in Singapore. Most of them were young men who came and supported themselves, living in communal houses. There were several such houses built in Singapore. They were found in places like Adam Communal House in Ann Siang Hill, Teluk Dalam Communal House in Dixon Road and Dedawang Communal House in Sophie Road. There was also a village within the town area that was inhabited by the Baweanese called Kampung Kapur (literally 'Lime Village') in the western part of Kampung Boyan (Boyan Village). A mosque called the Masjid Bawean Kampung Kapur (Bawean Mosque of Lime Village) located at Weld Road was built in 1932. There was also a communal house that became the gathering point for writers and their friends from the literary group called Jejak Kembara (literally 'Wanderers' Steps') in the late 1970s. Due to the fact that they shared the same religion and were closely related racially, both the Baweanese and the Javanese were able to mix freely and even intermarried with the Malays. In time, this caused the differences between them to be less obvious and more Baweanese and Javanese began identifying themselves as Malays. ### Bugis The [Bugis](/wiki/Bugis) came from [Sulawesi](/wiki/Sulawesi) Island in [Indonesia](/wiki/Indonesia). They were well known for a long time as maritime traders. In the mid-seventeenth century, the Bugis were spreading out from Celebes to set up trading centres throughout the region. Often they had to sail to distant lands and fight indigenous tribes. They rarely lost and acquired a reputation as fierce warriors. The Dutch control of the Dutch East Indies and their blockades cut off the Bugis from their traditional spice trade routes from Celebes to Java. This forced them to migrate to other areas to continue trading. Their migration to what is today Malaysia and [Riau Archipelago](/wiki/Riau_Archipelago) began around the 18th century or even earlier. Their influence in Riau was strong. Among the Bugis traders were also members of the nobility like Engku Karaeng Talibak who married the daughter of Raja Ali Haji. According to Raja Ali Haji in his work, *Tuhfat al-Nafis*, the presence of Karaeng Talibak brought more Bugis traders to Riau. In 1819, conflicts between the Dutch and Bugis result in a number of Bugis leaving Riau, and soon after Raffles arrival to Singapore, a group of 500 Bugis led by Chieftain Arong Bilawa fled to Singapore. By the time of the first census in 1824, there were 1,951 Bugis recorded in Singapore, over 18% of the island's population of 10,683. The establishment of a free port in Singapore allowed the Bugis to expand their network in the archipelago. Sailing from Sumatra to north Australia, the Bugis ships brought cargoes of cotton cloth, gold dust, birds-of-paradise feathers, pepper, trepang (sea cucumbers), sandalwood, tortoiseshell, coffee, and rice to Singapore. Most of these goods were very much in demand by the Chinese merchants in Singapore. The Bugis also traded in slaves. James Cameron gave a description in 1865 of the various ships that would visit Singapore's harbour. According to him, each year during October and November, the Bugis ships would come from [Bali](/wiki/Bali) and the Celebes. By the 1830s, the Bugis had established themselves in Singapore and formed the majority of the pioneer communities in the Kampung Gelam area. By 1831, the Census of Population reported over 2,000 Bugis in Singapore. The Bugis gradually formed kampongs and settlements in places like Kampung Bugis (around the Kallang River), Kampung Soopoo, Jalan Pelatok and Jalan Pergam. The number of Bugis however would decline as they lost their dominance in the sea trade, and by 1860, there were only about 900 Bugis left in Singapore. Many of them also became assimilated into the larger Malay community. Many Bugis pioneers and historical figures are buried in [Jalan Kubor Cemetery](/wiki/Jalan_Kubor_Cemetery). ### Minangkabau The [Minangkabau people](/wiki/Minangkabau_people) came from Western [Sumatra](/wiki/Sumatra). The Minangkabau people are known for their matrilineal social system and their tradition for travelling. They would leave their homes and travel in search of work, knowledge and experience. They would usually return home once they had fulfilled their objective. This tradition of travelling was a rite of passage for the young Minangkabau men and was considered a way for them to be in touch with the outside world. The Minangkabau people have been migrating to Malaysia and Singapore since long ago. In the 19th century, the cross-strait traders from [Payakumbuh](/wiki/Payakumbuh) and [Tanah Datar](/wiki/Tanah_Datar_Regency) of [Minangkabau Highlands](/wiki/Minangkabau_Highlands) brought agricultural products from the interior of Sumatra to be sold at the port of Singapore. In the first half of 20th century, the majority of Minangkabau people who came to Singapore came from Pariaman and Agam in Western Sumatra. This only stopped when Malaya achieved independence from the British in 1957, when the immigration laws were tightened. The majority of they were engaged in business, apart as religious teachers and politician. They sold religious items, toys and clothes in Arab Street and Geylang. Another [Minang business](/wiki/Minangkabau_businesspeople) that is quite well-known in Singapore is the Padang restaurant that sells [Nasi Padang](/wiki/Nasi_Padang). The Minangkabau people even formed an association at one time but this was subsequently banned during the 1962–66 [Indonesia-Malaysia confrontation](/wiki/Indonesia-Malaysia_confrontation). Then in 1995, they established the Singapore Minangkabau Association with a mission to preserve and promote the Minangkabau culture in Singapore. After Singapore became an independent state in 1965, the majority of Minangkabau people either migrated to Malaysia or returned to Sumatra. Those who stayed in Singapore assimilated into the Malay community. Not many Minangkabaus brought their wives or women with them to Singapore. As such, many married the local Malay women and did not maintain strong ties with the other Minangkabau communities. By 1973, it was estimated that there were 200 Minangkabau families in Singapore and almost all of them were Singaporean residents. ### Banjarese The [Banjarese](/wiki/Banjar_people) originated from the southern and eastern coast of [Kalimantan](/wiki/Kalimantan) in Borneo. Most came from [Banjarmasin](/wiki/Banjarmasin) in the area surrounding the Barito basin. These areas were used for the cultivation of paddy. The Banjarese who migrated to the Malay Peninsula were farmers who were experienced in paddy cultivation. They also migrated to spread Islam to the region, to escape poverty and the oppressive Dutch rule of their homeland. Some also wanted to escape the presence of wild animals that threatened their farms in Kalimantan. The Banjarese generally did not like to be employees. They preferred to be self-employed, working as either farmers or businessmen. The Banjar were also well known as jewel cutters and dealers in the region. Many came to Singapore to deal in the jewellery trade and had their shops in Arab Street. They even formed a Kalimantan Association in Singapore. The Banjarese made up a very small percentage of the Malay population in Singapore. In 1931, they numbered 445 out of a total Malay population of 65,104 (0.7%). In 1947, they formed only 0.3% of the population. This dropped to 0.2% in 1957 and 0.1% in 1970. By 1980 and 1990, the total numbers could not be determined, probably because the Banjarese have effectively assimilated into the Malay community. ### Bataks The [Bataks](/wiki/Batak_(Indonesia)) are the smallest Malay group in [Singapore](/wiki/Singapore). Up to 1978, there were fewer than 350 Bataks in Singapore. Unlike other Malay groups that are predominantly Muslim, the Bataks are largely [Christians](/wiki/Christianity_in_Singapore), including [Lutherans](/wiki/Lutheran) and [Seventh-Day Adventists](/wiki/Seventh-Day_Adventist). The Bataks had been coming to Singapore before the twentieth century, though little is known about those who arrived in the 19th century and before World War II. Most were young men in their twenties from the [Toba](/wiki/Toba_Batak_people), [Mandailing](/wiki/Mandailing_people) and [Angkola people](/wiki/Angkola_people) groups. The Bataks came to Singapore for economic, educational and social reasons. Many who arrived before the War had received their primary education in Batak and Malay. Some continued their studies in private and Christian schools, such as those supported by the Seventh-day Adventist organisation, which in 1915 encouraged Batak families from Sipirok, Angkola and Pematang Siantar in Sumatra to send their children to Singapore. English education was especially prized as it provided access to white-collar jobs on plantations in Eastern Sumatra owned by the Dutch and Americans. After completing their education, many returned home, while some married and brought their wives to Singapore. The Batak Christians were the first to introduce this practice. Most Bataks who arrived before World War II worked as gardeners, peons and manual labourers. During the Japanese Occupation, they were conscripted as foot soldiers or forced labourers, and some received military training in Singapore. After the War, many returned home, while others came from places such as [Medan](/wiki/Medan), [Palembang](/wiki/Palembang) and the [Riau Islands](/wiki/Riau_Islands). Some found work as clerks, storekeepers or business partners with non-Bataks, while others joined the British army in roles such as soldiers, technicians and electricians. Some adopted Malay identity to gain access to military service or employment. In 1947, Bataks in Singapore formed the welfare organisation *Saroha* (\"one heart\"), which aimed to support the community. The organisation lasted until 1954 and was briefly revived in 1958 but ultimately disbanded. Since then, most Bataks and their descendants have assimilated into the Malay community and identify as Malays. ## Ethnic composition of Malay population 1931–1990 The following figures show the composition of the various Malay ethnic population in Singapore for the past 60 years. The great increase shown in the other Malay groups, especially the Javanese, in 1990 is likely due to the increase in the employment of Indonesian domestic workers in Singapore. **Ethnic Composition of Malay population in Singapore 1931–2020** Malay Ethnic Group193119471957197019801990Population (2020)Percentage (2020)Total65,104113,803197,059311,379351,508384,338545,498100%[Malays](/wiki/Malays_(ethnic_group))57.5%61.8%68.8%86.1%89.0%68.3%370,44567.9%[Javanese](/wiki/Javanese_people)24.5%21.7%18.3%7.7%6.0%17.2%94,58417.3%[Baweanese](/wiki/Bawean_people) (Boyanese)14.4%13.5%11.3%5.5%4.1%11.3%60,28511.1%[Bugis](/wiki/Bugis)1.2%0.6%0.6%0.2%0.1%0.4%N.A.N.A.[Banjar](/wiki/Banjar_people)0.7%0.3%0.2%0.1%N.A.N.A.N.A.N.A.OtherN.A.N.A.N.A.N.A.N.A.N.A.20,1843.7% (Reference: Arumainathan 1973, Vol 1:254; Pang, 1984, Appendix m; Sunday Times, 28 June 1992) ## Culture Many aspects of Singaporean Malay culture includes: ### Cuisine There is several major local Singaporean Malay foods that was famous among the community. It includes, among others,: - Sup Tulang Merah - Mee Rebus - Mee Siam - Bihun Singapura - Epok-Epok (Curry Puff) - Nasi Lemak - Ayam masak merah - Putu piring - Beef rendang At the same time, there is also several major non-Malay cuisines that is predominantly popular among the Malay/Muslim community as it is not only delicious, but also certified as Halal. Most of the cuisines are predominantly refers to [Middle Eastern](/wiki/Middle_Eastern_cuisine) ([Arab](/wiki/Arab_cuisine)) cuisine, ([southern](/wiki/Tamil_cuisine)) [Indian](/wiki/Indian_cuisine) cuisine, South [Korean cuisine](/wiki/Korean_cuisine) etc. - [Nasi Arab](/wiki/Mandi_(food)) (Mandi Rice) - Rojak India - [Thosai](/wiki/Dosa_(food)) - [Vadai](/wiki/Vadai) - [Kimchi](/wiki/Kimchi) - [Bulgogi](/wiki/Bulgogi) - [Kek Lapis](/wiki/Layer_cake) (Layer Cake) - [Mee kolok](/wiki/Mee_kolo) (beef and/or chicken only) ### Dialects, languages and pronunciations [Malay](/wiki/Malay_language) is the national language of Singapore and one of its official languages. It is written in a [Roman script](/wiki/Latin_script) known as [Rumi](/wiki/Malay_alphabet). It is the home language of 15% of the Singaporean population. Malay is also the ceremonial national language and used in the [national anthem of Singapore](/wiki/Majulah_Singapura), in citations for [Singapore orders and decorations](/wiki/Singapore_orders_and_decorations) and military foot drill commands, [mottos](/wiki/Mottos) of several organisations and is the variety taught in [Singapore's language education system](/wiki/Language_education_in_Singapore) as a [mother tongue](/wiki/Mother_tongue). Linguistically, the Malay spoken in Singapore is similar to that of in southern [Johor](/wiki/Johor) of the [Malay Peninsula](/wiki/Malay_Peninsula) and the [Riau Archipelago](/wiki/Riau_Archipelago); though the Straits Branch of the Royal Asiatic Society in the early 20th century noted that the variety is \"much influenced by [Singapore's] proximity to [Java](/wiki/Java). The now-relocated [Orang Laut](/wiki/Orang_Laut) of the [Southern Islands](/wiki/Southern_Islands) were recorded to have spoken a variety of Malay that velarises its [rhotic consonant](/wiki/Rhotic_consonant) (as /[ɣ](/wiki/Voiced_velar_fricative)/) in contrast to the flap (/[ɾ](/wiki/Voiced_dental_and_alveolar_taps_and_flaps)/) in the variety heard in the main island. Some of the old generations of people now identified as \"Malay\" in Singapore can also converse in languages belonging to their original [ethnolinguistic](/wiki/Ethnolinguistic_group) immigrant groups such as [Javanese](/wiki/Javanese_language), [Bawean](/wiki/Bawean), [Buginese](/wiki/Buginese_language), [Banjarese](/wiki/Banjarese_language), [Minangkabau](/wiki/Minangkabau_language) and [Batak](/wiki/Batak_language); the native lands of these subgroups are now part of modern-day [Indonesia](/wiki/Indonesia). #### Differences between Singaporean Malay and other forms Prior to independence, Singapore was a historical centre for Malay literature, culture and cinema, led by the [Malay Film Productions](/wiki/Malay_Film_Productions) at [Jalan Ampas](/wiki/Jalan_Ampas). However, after independence, this cultural role declined. Singapore participates as an observer in the [Brunei–Indonesia–Malaysia Language Council](/wiki/Majlis_Bahasa_Brunei%E2%80%93Indonesia%E2%80%93Malaysia) (MABBIM), which coordinates [pluricentric](/wiki/Pluricentric_language) Malay standards, though it is not formally a member. Nevertheless, Singapore occasionally follows the standardisations agreed upon in this forum and adheres to them in cases of disagreements. Within Singapore, standards are set by the Malay Language Council of Singapore (MLCS). Some differences remain between the official standard and colloquial usage. While the historical standard was the Johor–Riau dialect, a cultivated [accent](/wiki/Accent_(sociolinguistics)) known as *Sebutan Baku* (standard pronunciation) or *Bahasa Baku* (standard language) was adopted in 1956 by the Third Malay Language and Literary Congress to create consistency between written and spoken forms. Implementation was gradual, with Malaysia fully adopting it in education in 1988, and Singapore introducing it at the primary school level in 1993. Despite its expanded use in formal education, Johor–Riau pronunciation remains dominant for most speakers. The artificial creation of *Bahasa Baku* means there are were initially no truly native speakers, and its pronunciation is closer to [Indonesian](/wiki/Indonesian_language) than the traditional Johor–Riau standard. Cultural resistance has emerged, as accent differences between older and younger generations have raised questions about Malay cultural identity. These issues were further heightened when Malaysia abandoned *Bahasa Baku* in 2000 whereas Singapore has continued to retain the standard. As a result, this led to a gradual divergence of Malay in both written and spoken forms between Malaysia and Singapore. In practice, the Malay language in Singapore tends to adhere to a more traditional and formal register compared to Malaysia. This resulted in a linguistic style in Singapore that often maintains classical vocabulary and structures, particularly in education, media and official communication when compared to Malaysia, which may view it as archaic. Examples include the use of *pemerintah* for [government](/wiki/Government), aligning with Indonesian terminology rather than the Malaysian *kerajaan*. Another example is for the verb *bilang* to mean \"to say,\" whereas Malaysian Malay typically favours *cakap* or *beritahu*. ### Holidays and festivities Some of the major Muslim festivals celebrated every year among the Singapore's Malay/Muslim community include [Hari Raya Aidilfitri](/wiki/Eid-ul-Fitr), [Hari Raya Haji](/wiki/Eid-ul-Adha), [Maal Hijrah](/wiki/Islamic_New_Year) and [Maulidur Rasul](/wiki/Birthday_of_Prophet_Mohamed), with the minor festivals includes [Israk & Mikraj](/wiki/Isra%27_and_Mi%27raj), [Awal Ramadhan](/wiki/Ramadan), [Nuzul Alquran](/wiki/Laylat_al-Qadr) and [Arafah Day](/wiki/Day_of_Arafah). It is just as similar as their Muslim neighbour countries that was celebrated in [Malaysia](/wiki/Malaysia), [Indonesia](/wiki/Indonesia) and [Brunei Darussalam](/wiki/Brunei_Darussalam). However, only [Hari Raya Aidilfitri](/wiki/Eid-ul-Fitr) and [Hari Raya Haji](/wiki/Eid-ul-Adha) is recognised and gazetted as Muslim religious public holiday in Singapore despite the significant presence of Malay/Muslim community as indigenous in the country. Previously, [Maulidur Rasul](/wiki/Birthday_of_Prophet_Mohamed) (birthday of Prophet Mohamed) has been recognised as public holiday prior to 1968 amendment of the 1966 Holidays Act, where since that two public holidays were designated each for both Muslim and Christian as well as one for Hindu community. It is implemented in purpose to improve business competitiveness and valid until now. Prior to the fasting month of Ramadan and Syawal, most Malay/Muslim settlements and streets will decorated with green-based or colourful decoration of Eid such as lights, *[Ketupat](/wiki/Ketupat)*, *pelita api* (fire lamp) and many more, with most of them centered in [Geylang Serai](/wiki/Geylang) as the main Malay settlement area in Singapore. During the fasting month, *Bazar Ramadhan* (Ramadan bazaar(s)) are the most famous events during the holy month where it provides diverse foods and beverages (F&B). The popular F&Bs includes Mee Rebus, Air Kathira, Roti John, Nasi Arab, Vadai etc. While moving to the month of Syawal, almost all Malay/Muslim families and organisations will hold *Rumah Terbuka Aidilfitri* (Eid openhouse(s)), where all communities regardless of ethnics and religions are not only having a chance to meet and greet their Muslim friends and relatives, but at the same time they are also invited to a variety of dishes that are commonly served during Aidilfitri. The Aidilfitri popular dishes in Singapore are relatively similar to [Malaysia](/wiki/Malaysia), [Indonesia](/wiki/Indonesia) and [Brunei Darussalam](/wiki/Brunei_Darussalam) such as [Rendang](/wiki/Rendang), [Lemang](/wiki/Lemang) and [Ketupat](/wiki/Ketupat), as well as the famous layer cakes from [Sarawak](/wiki/Sarawakian_cuisine), [Kek Lapis](/wiki/Layer_cake) which is predominantly provided during the sole-month Aidilfitri season. ### Religion According to the latest 2020 Census, almost 99% of Singapore's Malay population declared themselves Muslims, with small populations of 0.4% non-religious and 0.8% other religions, as stated in the following statistics. ReligionNumber (2020)Percentage[Islam](/wiki/Islam_in_Singapore)442,36898.8%[Christianity](/wiki/Christianity_in_Singapore)2,7430.6%*[Roman Catholicism](/wiki/Roman_Catholicism_in_Singapore)**1,097**0.2%**[Protestantism](/wiki/Protestantism) and other Christians**1,646**0.4%*[No religion](/wiki/Irreligion_in_Singapore)1,6400.4%[Buddhism](/wiki/Buddhism_in_Singapore)4470.1%[Hinduism](/wiki/Hinduism_in_Singapore)2230.1%Other religions3260.1% An overwhelming majority of Malays in Singapore are predominantly the followers of [Sunni](/wiki/Sunni) [Islam](/wiki/Islam), belonging to the [Shāfi'ī](/wiki/Shafi%27i) (شافعي) school of thought. A very small Christian community also exists among the local Malays, with approximately 0.6% of Malays being Christians. There is also a small Buddhist community, mostly consisting of Malays with mixed Chinese and [Peranakan](/wiki/Peranakan) ancestry and even there are Hindu minorities, mostly among the Malays with mixed Indian (Tamil) or [Chitty](/wiki/Chitty) ancestry and of those who trace their origins to the [Balinese Hindus](/wiki/Balinese_Hindus) and [Javanese](/wiki/Javanese_people) Hindus. ### Performing arts [Dikir Barat Singapura](/wiki/Dikir_Barat_Singapura) is a localised adaptation of the traditional Malay choral performance art, [Dikir barat](/wiki/Dikir_barat), which originated in the northeastern [Malay Peninsula](/wiki/Malay_Peninsula), particularly in [Kelantan](/wiki/Kelantan) and [Patani](/wiki/Patani_(historical_region)). Introduced to [Singapore](/wiki/Singapore)’s Malay community in the 1970s, the art form gradually evolved to reflect the city-state’s multicultural landscape. While retaining core elements such as the *tok juara* (lead singer), *tukang karut* (jester), and *awok-awok* (chorus), Singaporean *dikir barat* distinguishes itself with faster tempos, synchronised movements, and an expanded thematic range that includes social issues and national identity. The practice is widely supported by educational institutions and community organisations, which promote its continuity through school-based [co-curricular activities](/wiki/Co-curricular_activity) and national competitions. Beyond its artistic significance, *dikir barat* serves as a medium for community engagement and cultural preservation among the Singaporean Malay population. Events such as *Mega Perdana*, organised by the Singapore Dikir Barat Federation, provide a platform for troupes to showcase their skills and creativity. The genre’s adaptability has also led to its inclusion in major national celebrations, such as the [Chingay Parade](/wiki/Chingay_Parade) and the [National Day Parade](/wiki/Singapore_National_Day_parade). With continued institutional and community support, *dikir barat* remains a vibrant expression of [Malay culture](/wiki/Malay_culture) in Singapore. ## Status of Malays in Singapore Malays are recognised and considered as the indigenous people of Singapore by the Singapore Constitution, Part XIII, General Provisions, Minorities and special position of Malays, section 152: > The Government shall exercise its functions in such manner as to recognise the special position of the Malays, who are the indigenous people of Singapore, and accordingly it shall be the responsibility of the Government to protect, safeguard, support, foster and promote their political, educational, religious, economic, social and cultural interests and the Malay language. ## Notable Malay Singaporeans For Malays in Singapore, the last name is [patronymic](/wiki/Patronymic), not a family name. The person should be referred to by his or her first or second name which is the given name. The Malay word bin (b.) or binte (bte.), if used, means \"son of\" or \"daughter of\" respectively. NameBirthDeathOccupation(s)Notable for[Malay](/wiki/Malay_language) · [English](/wiki/English_language)[Jawi](/wiki/Jawi_alphabet)[Sang Nila Utama](/wiki/Sang_Nila_Utama)13th century1347KingFirst king of [Singapura](/wiki/Kingdom_of_Singapura).[Parameswara](/wiki/Parameswara_(king))1344c. 1414KingLast king of [Singapura](/wiki/Kingdom_of_Singapura).[Yusof bin Ishak](/wiki/Yusof_Ishak)يوسف بن اسحاق‍12 August 191023 November 1970PoliticianFirst [President of Singapore](/wiki/President_of_Singapore) (1965–1970).[Zubir Said](/wiki/Zubir_Said)زبيرسعيد‍22 July 190716 November 1987MusicianComposed the [national anthem](/wiki/National_anthem) of Singapore, *[Majulah Singapura](/wiki/Majulah_Singapura)*.[Yaacob Ibrahim](/wiki/Yaacob_Ibrahim)يعقوب بن إبراهيم‍3 October 1955–PoliticianProminent Singaporean politician[Fandi Ahmad](/wiki/Fandi_Ahmad)‍29 May 1962–SportsmenFirst Singaporean millionaire sportsperson and national football player[Taufik Batisah](/wiki/Taufik_Batisah)‍10 December 1981–SingerWinner of the first season of [Singapore Idol](/wiki/Singapore_Idol)[Othman Wok](/wiki/Othman_Wok)عثمان بن ووك‍8 October 192417 April 2017PoliticianProminent Singaporean Politician & Community Leader[Wandly Yazid](/wiki/Wandly_Yazid)24 February 19255 August 2005Composer, Arranger and Musician[Anita Sarawak](/wiki/Anita_Sarawak)March 1952–Singer, Actress and Talk-Show Host[Masagos Zulkifli](/wiki/Masagos_Zulkifli)1963–Politician[Minister-in-charge of Muslim Affairs](/wiki/Minister-in-charge_of_Muslim_Affairs), Minister for Social and Family Development and Second Minister for Health[Halimah Yacob](/wiki/Halimah_Yacob)1954–PoliticianEighth [President of Singapore](/wiki/President_of_Singapore) (2017–2023) ## Notes - Dr Syed Farid Alatas, *Keadaan Sosiologi Masyarakat Melayu, Occasional Paper Series Paper No.5-97*, Association of Muslim Professionals Singapore, 1997 - Dr [Syed Hussein Alatas](/wiki/Syed_Hussein_Alatas), Prof Khoo Kay Kim & Kwa Chong Guan, *Malays/Muslims and the History of Singapore, Occasional Paper Series Paper No.1-98*, Centre for Research on Islamic & Malay Affairs, Association of Muslim Professionals Singapore, 1997 - Brown, C.C, [Sejarah Melayu](/wiki/Sejarah_Melayu) or [Malay Annals](/wiki/Malay_Annals): a translation of Raffles MS 18, Journal of the Malayan Branch of the Royal Asiatic Society, Volume 25, No. 2 & 3, 1952 - Chia Jeannette Hwee Hwee, *A History of Javanese and Baweanese of Singapore*, Department of History, Thesis for the BA of Arts and Social Sciences, 1993 - Djamour, Judith *Malay Kinship and Marriage in Singapore*, London: Athlone Press, 1965 - Gibson-Hill, C. A., '*he Orang Laut Of The Singapore River and the Sampan Panjang*, Singapore: Malayan Branch, Royal Asiatic Society, 1952. - Hadijah Rahmat, *Kilat Senja: Sejarah Sosial dan Budaya Kampung-Kampung di Singapura*, H S Yang Publishing Pte Ltd, Singapore, 2005. - Haffidz A. Hamid, Mohd Azhar Khalid, Mohd Alami Musa & Yusof Sulaiman, *Factors Affecting Malays/Muslim Pupils' Performance in Education, Occasional Paper Series Paper No.1-95*, Centre for Research on Islamic & Malay Affairs, Association of Muslim Professionals Singapore, 1995 - Dr Khoo Kay Kim, Elinah Abdullah, Wan Meng Hao (ed.), *Malays/Muslims in Singapore: Selected Readings in History 1819–1965*, Centre for Research on Islamic & Malay Affairs, Association of Muslim Professionals Singapore, 2006 - Li Tania, *Malays in Singapore: Culture, Community and Ideology*, Oxford University Press, Singapore, 1989 - Lily Zubaidah Rahim, *The Singapore Dilemma: The Political and Educational Marginality of the Malay Community*, Oxford University Press, New York, 1998 - Mohamed Pitchay Gani Bin Mohamed Abdul Aziz, *Leksikon: Direktori Penulis Melayu Singapura Pasca 1965*, Angkatan Sasterawan '50, Singapore, 2005. - Pang Keng Fong, *The Malay Royals of Singapore*, Department of Sociology, Thesis for the BA of Social Science, 1984 - Parliamentary Debates of Singapore, Sultan Hussain Ordinance/Kampong Glam Conservation, Volume 57(7), Tuesday 12 March 1991 - Perkins, Jane, *Kampong Glam: Spirit of a Community, Singapore'*, Times Publishing, 1984 - Tengku Mahmud vs. Tengku Ali, Straits Settlements Laws Report 1897 (Vol. 5) - Tham Seong Chee, *Malay Family Structure: Change and Opportunity with reference to Singapore*, Seminar Paper No. 13, Academic Session 1993/94, Department of Malay Studies, National University of Singapore - Zarinah Binte Ali, *The Istana at Kampong Gelam: From Royal Ground to National Heritage*, Department of Southeast Asian Studies Programme, Thesis for the BA of Arts, 2001/2002 Library resources about **Malay Singaporeans** - Resources in your library - Resources in other libraries - The Singapore Constitution - Minorities at Risk (MAR) Project Chronology for Malays in Singapore - Malay Heritage Centre - Asas 50 - Year 2010 Census Report Singapore:Key Population Indicators - Year 2010 Census Report:Key Indicators of Resident Population - Report on religion in Singapore by Exploitz.com, a public domain information from the US State Department Country Guide - Singapore Book of Records - Demographic Characteristics- Table 5[*permanent dead link*] - 1820 – Arrivals from Riau – a short documentary about the Bugis community in Singapore, produced for the Singapore Bicentennial in 2019.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:28:16.800750",
  "title": "Malay Singaporeans",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Malay_Singaporeans"
}