{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:29:00.455945"
  },
  "content": "Singaporean man (born 2004) **Malone Lam Yu Xuan** (born July 19, 2004) is a Singaporean man indicted in 2024 as the main perpetrator behind cryptocurrency theft and [money laundering](/wiki/Money_laundering) schemes exceeding $260 million. Prosecutors allege that Lam and his associates stole more than 4,100 [Bitcoin](/wiki/Bitcoin) from a single investor, in what authorities describe as the largest known single-victim cryptocurrency heist in history, and the first Bitcoin-related [Racketeer Influenced and Corrupt Organizations Act (RICO)](/wiki/Racketeer_Influenced_and_Corrupt_Organizations_Act) in history. Lam has admitted to being involved in multiple crypto thefts. ## Early life and education Lam grew up in [Singapore](/wiki/Singapore). He attended [Unity Secondary School](/wiki/Unity_Secondary_School) in [Choa Chu Kang, Singapore](/wiki/Choa_Chu_Kang), in 2017. By his teenage years, he had dropped out of school and became involved in cryptocurrency trading and online gaming communities, including [Minecraft](/wiki/Minecraft) and [Discord](/wiki/Discord). In 2023, he moved to the United States, residing in [Miami, Florida](/wiki/Miami,_Florida), and [Los Angeles, California](/wiki/Los_Angeles,_California). ## Background According to *[The New York Times](/wiki/The_New_York_Times)*, Lam and his co-conspirator Jeandiel Serrano live-streamed a [social engineering](/wiki/Social_engineering_(security)) heist to friends online and later used the stolen funds to go on a spending spree involving 33 luxury cars, jewelry, travel, and nightclubs before being arrested within a month of the theft. Lam was arrested by the [Federal Bureau of Investigation](/wiki/Federal_Bureau_of_Investigation) in September 2024 in Miami, Florida. In 2025, a superseding federal indictment expanded the case, describing a wider criminal enterprise that allegedly operated from 2023 to 2025. According to the indictment, Lam and 12 others allegedly orchestrated additional thefts, including an incident in July 2024 in which cryptocurrency was taken from a second victim, and are said to have coordinated a burglary in New Mexico. A number of these individuals have pleaded guilty. In 2025, it was reported that U.S. prosecutors had offered Lam a new plea deal.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:29:00.455631",
  "title": "Malone Lam",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Malone_Lam"
}