{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:29:02.471123"
  },
  "content": "Type of convenience store in Singapore A **mama shop** or **mamak shop** (from [Tamil](/wiki/Tamil_language) மாமா *māmā*, meaning *uncle* or *elder*) is a [convenience store](/wiki/Convenience_store) or sundry shop in [Singapore](/wiki/Singapore) that is often located under a high-rise apartment block built by the [Housing and Development Board](/wiki/Housing_and_Development_Board) (HDB). Traditionally, they are owned and operated by [Singaporean Indians](/wiki/Singaporean_Indian). Unlike other stores such as [7-Eleven](/wiki/7-Eleven), mama shops are not air-conditioned and sell a variety of provisions within their limited area of approximately 9 square metres (97 sq ft). Local residents often make use of mama shops as location markers. ## History The earliest mama shops were started by the early Indian immigrants to Singapore who were traders and businessmen. Many eventually became small shopkeepers along [Serangoon Road](/wiki/Serangoon_Road) in the early 20th century. In its early days, the mama shop served mainly villagers in the vicinity. Since the shopkeeper was most likely to be the shop owner, service was rendered largely on a friendly and personal basis. In earlier times many customers were granted unlimited [credit](/wiki/Credit_(finance)), according to Ubid bin Ibrahim, co-owner of one of the oldest surviving mama shops. Bargaining, discounting of prices and personal delivery of goods were also common. Over time, shopkeepers became familiar with customers from the other racial communities, particularly the [Chinese](/wiki/Chinese_Singaporean) who observed the custom of [reciprocity](/wiki/Reciprocity_(cultural_anthropology)). As English was not a commonly spoken tongue back then, the [Malay language](/wiki/Malay_language) served as the main form of communication between them. When Singapore's population underwent a major resettlement from villages to high-rise flats in the 1960s, many mama shops were relocated to [void decks](/wiki/Void_deck) – open areas on the ground floors of HDB flats. While in the villages they had catered mostly to housewives, they now were frequented by children who would stop at the stores to browse through thrift comics, inexpensive sweets and cheap stationery. However, the resettlement caused a weakening in what had been a strong sense of community established back in the village, and many mama shops witnessed a loss in an otherwise frequent and loyal patronage. With the passing of time and increasing modernization, rising competition from air-conditioned mini-marts and upbeat convenience chain stores also dealt a blow to the survival of many traditional mama shops. Portal: - Singapore\n",
  "language": "en",
  "processed_at": "2026-01-12T11:29:02.470739",
  "title": "Mama shop",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Mama_shop"
}