{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:29:06.827899"
  },
  "content": "Beach club in SingaporeThis article **is an orphan, as no other articles link to it**. Please introduce links to this page from related articles. *(December 2025)* **Mana Mana Beach Club** is a beach club at [East Coast Park](/wiki/East_Coast_Park), [Singapore](/wiki/Singapore). It has [sailing](/wiki/Sailing), [windsurfing](/wiki/Windsurfing), [snorkelling](/wiki/Snorkelling) and [kayaking](/wiki/Kayaking) equipment and place for storage of boats and windsurf equipment. It also has one indoors function room and one outdoor function area which is available for rent to hold parties and events. It has a restaurant serving Mediterranean and western as well as local cuisines. The beach club offers regular watersports courses and programmes for adults and children, equipment rental, storage facilities, [al-fresco](/wiki/Al_fresco_dining) dining with bar, events function room, beach volleyball court, dip/ dive pool, resort standard shower facilities and a proshop. The club is surrounded in coconut groves. ## History The Mana Mana Beach Club concept was founded in late 1994 as a pioneer watersports centre on the island of [Bintan](/wiki/Bintan), across from Singapore in Indonesia. It was then a part of the Bintan Beach International Resort, where it remained in operation until January 2007. Since 1995, the Bintan location hosted the Mana Mana Amslam, its annual windsurfing event, seen by more than 150 million viewers on cable sports channels around the world and in the last two years, it also hosted [kite surfing](/wiki/Kite_surfing) events. This article about a [hotel](/wiki/Hotel) or [resort](/wiki/Resort) in [Singapore](/wiki/Singapore) is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:29:06.827536",
  "title": "Mana Mana Beach Club",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Mana_Mana_Beach_Club"
}