{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:29:13.309276"
  },
  "content": "Branch of the Chinese language family **Mandarin** (/ˈmændərɪn/ *MAN-dər-in*) is the largest branch of the [Sinitic languages](/wiki/Sinitic_languages). Mandarin varieties are natively spoken by 70 percent of all Chinese speakers, spread over a large geographical area that stretches from [Yunnan](/wiki/Yunnan) in the southwest to [Xinjiang](/wiki/Xinjiang) in the northwest and [Heilongjiang](/wiki/Heilongjiang) in the northeast. Its spread is generally attributed to the overall greater ease of travel in the [North China Plain](/wiki/North_China_Plain) compared to the more mountainous south, combined with the relatively recent spread of northern varieties to frontier areas. Many varieties of Mandarin, such as [those of the Southwest](/wiki/Southwestern_Mandarin) and the [Lower Yangtze](/wiki/Lower_Yangtze_Mandarin), are not [mutually intelligible](/wiki/Mutually_intelligible) with the [Beijing dialect](/wiki/Beijing_dialect). Nevertheless, Mandarin as a group is often placed first in [lists of languages by number of native speakers](/wiki/Lists_of_languages_by_number_of_native_speakers) (with nearly one billion). Because Mandarin originated in [North China](/wiki/North_China) and most Mandarin varieties are found north of the [Yangtze River](/wiki/Yangtze_River), the group is sometimes referred to as **Northern Chinese**. Most Mandarin varieties have four [tones](/wiki/Tone_(linguistics)). The final stops of [Middle Chinese](/wiki/Middle_Chinese) have disappeared in most of these varieties, but some have merged them as a final [glottal stop](/wiki/Glottal_stop). Many Mandarin varieties, including that of [Beijing](/wiki/Beijing), retain [retroflex](/wiki/Retroflex) initial consonants, which have been lost in southern Chinese varieties. The [historical capitals of China](/wiki/Historical_capitals_of_China) have been within the Mandarin-speaking area for most of the last two millennia, making these dialects very [prestigious](/wiki/Prestige_(sociolinguistics)). Some form of Mandarin has served as a *[lingua franca](/wiki/Lingua_franca)* for government officials and the courts since at least the 14th century. In the early 20th century, a [standard language](/wiki/Standard_language) based on the Beijing dialect, with elements from other Mandarin varieties, was adopted as the [national language](/wiki/National_language). Today, Standard Chinese is the [official language](/wiki/Official_language) of [China](/wiki/China) and [Taiwan](/wiki/Taiwan), one of [four official languages](/wiki/Languages_of_Singapore) of [Singapore](/wiki/Singapore), and one of [six official languages](/wiki/Official_languages_of_the_United_Nations) of the [United Nations](/wiki/United_Nations). Recent increased migration from Mandarin-speaking regions of China and Taiwan has resulted in the language being one of the more frequently used varieties of Chinese among [Chinese diaspora](/wiki/Chinese_diaspora) communities. It is also the most commonly taught form of [Chinese as a foreign language](/wiki/Chinese_as_a_foreign_language). ## Name The English word \"mandarin\" (from [Portuguese](/wiki/Portuguese_language) *mandarim*, from [Malay](/wiki/Malay_language) *menteri*, from [Sanskrit](/wiki/Sanskrit) *mantrī*, *mantrin*, meaning 'minister or counsellor') originally meant an [official](/wiki/Mandarin_(bureaucrat)) of the [Ming](/wiki/Ming_dynasty) and [Qing](/wiki/Qing_dynasty) empires.[a] Since their native varieties were often mutually unintelligible, these officials communicated using a [koiné language](/wiki/Koin%C3%A9_language) based on various northern varieties. When [Jesuit](/wiki/Jesuit) missionaries learned this standard language in the 16th century, they called it \"Mandarin\", from its Chinese name *Guānhuà* (官话; 官話; 'language of the officials'). In everyday English, \"Mandarin\" refers to [Standard Chinese](/wiki/Standard_Chinese), which is often called simply \"Chinese\". Standard Mandarin Chinese is based on [Beijing dialect](/wiki/Beijing_dialect), with some lexical and syntactic influence from other Mandarin dialects. It is the official spoken language of the [People's Republic of China](/wiki/China) (PRC) and [Taiwan](/wiki/Taiwan) (Republic of China, ROC), as well as one of the four official languages of [Singapore](/wiki/Singapore), and a high-prestige minority language in [Malaysia](/wiki/Malaysia). It also functions as the language of instruction in mainland China and Taiwan. It is one of the [six official](/wiki/Official_languages_of_the_United_Nations) languages of the [United Nations](/wiki/United_Nations), under the name \"Chinese\". Chinese speakers refer to the modern standard language as *Pǔtōnghuà* (普通话; 普通話; 'common speech') in mainland China, *Guóyǔ* (国语; 國語; 'national language') in Taiwan, and *Huáyǔ* (华语; 華語; '[Huaxia](/wiki/Huaxia) language') in Malaysia and Singapore, but not as *Guānhuà* (官话; 官話; 'officials' language'). Linguists use the term \"Mandarin\" to refer to the diverse group of dialects spoken in northern and southwestern China, which Chinese linguists call *Guānhuà*. The alternative term *Běifānghuà* (北方话; 北方話; 'Northern dialects'), is used less and less among Chinese linguists. By extension, the term \"Old Mandarin\" or \"Early Mandarin\" is used by linguists to refer to the northern dialects recorded in materials from the Yuan dynasty. Native speakers who are not academic linguists may not recognize that the variants they speak are classified in linguistics as members of \"Mandarin\" (or so-called \"Northern dialects\") in a broader sense. Within Chinese social or cultural discourse, there is not a \"Mandarin\" identity based on language; rather, there are strong regional identities centred on individual dialects because of the wide geographical distribution and cultural diversity of their speakers. Speakers of forms of Mandarin other than the standard typically refer to the variety they speak by a geographic name—for example the [Sichuan dialect](/wiki/Sichuanese_Mandarin) and the Hebei dialect or [Northeastern dialect](/wiki/Northeastern_Mandarin), all being regarded as distinct from the standard language, with which they may not share much mutual intelligibility. ## History The hundreds of modern local [varieties of Chinese](/wiki/Varieties_of_Chinese) developed from regional variants of [Old Chinese](/wiki/Old_Chinese) and [Middle Chinese](/wiki/Middle_Chinese). Traditionally, seven major groups of dialects have been recognized. Aside from Mandarin, the other six are [Wu](/wiki/Wu_Chinese), [Gan](/wiki/Gan_Chinese), and [Xiang](/wiki/Xiang_Chinese) in central China and [Min](/wiki/Min_Chinese), [Hakka](/wiki/Hakka_Chinese), and [Yue](/wiki/Yue_Chinese) on the southeast coast. The *[Language Atlas of China](/wiki/Language_Atlas_of_China)* (1987) distinguishes three further groups: [Jin](/wiki/Jin_Chinese) (split from Mandarin), [Huizhou](/wiki/Huizhou_Chinese) in the [Huizhou region](/wiki/Huizhou_region) of [Anhui](/wiki/Anhui) and [Zhejiang](/wiki/Zhejiang), and [Pinghua](/wiki/Pinghua) in [Guangxi](/wiki/Guangxi) and [Yunnan](/wiki/Yunnan). ### Old Mandarin After the fall of the [Northern Song](/wiki/Song_dynasty#Northern_Song,_960–1127) (959–1126) and during the reign of the [Jin](/wiki/Jin_dynasty_(1115%E2%80%931234)) (1115–1234) and [Yuan](/wiki/Yuan_dynasty) (Mongol) dynasties in northern China, a common form of speech developed based on the dialects of the North China Plain around the capital, a language referred to as Old Mandarin. New genres of vernacular literature were based on this language, including verse, drama and story forms, such as the *[qu](/wiki/Qu_(poetry))* and *[sanqu](/wiki/Sanqu)* poetry. The rhyming conventions of the new verse were codified in a [rime dictionary](/wiki/Rime_dictionary) called the *[Zhongyuan Yinyun](/wiki/Zhongyuan_Yinyun)* (1324). A radical departure from the [rime table](/wiki/Rime_table) tradition that had evolved over the previous centuries, this dictionary contains a wealth of information on the phonology of Old Mandarin. Further sources are the ['Phags-pa script](/wiki/%27Phags-pa_script) based on the Tibetan alphabet, which was used to write several of the languages of the Mongol empire, including Chinese and the *[Menggu Ziyun](/wiki/Menggu_Ziyun)*, a rime dictionary based on 'Phags-pa. The rime books differ in some details, but overall show many of the features characteristic of modern Mandarin dialects, such as the reduction and disappearance of final plosives and the reorganization of the Middle Chinese tones. In Middle Chinese, initial [stops](/wiki/Stop_consonant) and [affricates](/wiki/Affricate_consonant) showed a three-way contrast between [tenuis](/wiki/Tenuis_consonant), voiceless aspirated and voiced consonants. There were [four tones](/wiki/Four_tones_(Middle_Chinese)), with the fourth or \"entering tone\", a [checked tone](/wiki/Checked_tone) comprising syllables ending in plosives (*-p*, *-t* or *-k*). Syllables with voiced initials tended to be pronounced with a lower pitch and by the late [Tang dynasty](/wiki/Tang_dynasty), each of the tones had split into two registers conditioned by the initials. When voicing was lost in all languages except the Wu subfamily, this distinction became phonemic and the system of initials and tones was rearranged differently in each of the major groups. The *Zhongyuan Yinyun* shows the typical Mandarin four-tone system resulting from a split of the \"even\" tone and loss of the entering tone, with its syllables distributed across the other tones (though their different origin is marked in the dictionary). Similarly, voiced plosives and affricates have become voiceless aspirates in the \"even\" tone and voiceless non-aspirates in others, another distinctive Mandarin development. However, the language still retained a final *-m*, which has merged with *-n* in modern dialects and initial voiced fricatives. It also retained the distinction between velars and alveolar sibilants in palatal environments, which later merged in most Mandarin dialects to yield a palatal series (rendered *j-*, *q-* and *x-* in [pinyin](/wiki/Pinyin)). The flourishing vernacular literature of the period also shows distinctively Mandarin vocabulary and syntax, though some, such as the third-person pronoun *tā* (他), can be traced back to the Tang dynasty. ### Vernacular literature Until the early 20th century, formal writing and even much poetry and fiction was done in [Literary Chinese](/wiki/Literary_Chinese), which was modeled on the [classics](/wiki/Chinese_classics) of the [Warring States period](/wiki/Warring_States_period) and the [Han dynasty](/wiki/Han_dynasty). Over time, the various spoken varieties diverged greatly from Literary Chinese, which was learned and composed as a special language. Preserved from the sound changes that affected the various spoken varieties, its economy of expression was greatly valued. For example, 翼 (*yì*; 'wing') is unambiguous in written Chinese, but has over 75 [homophones](/wiki/Homophone) in [Standard Chinese](/wiki/Standard_Chinese). The literary language was less appropriate for documents that were meant to be performed or recited, such as plays or stories. From at least the Yuan dynasty plays that recounted the subversive tales of China's Robin Hoods to the Ming dynasty novels such as *[Water Margin](/wiki/Water_Margin)*, on down to the Qing dynasty novel *[Dream of the Red Chamber](/wiki/Dream_of_the_Red_Chamber)* and beyond, there developed a literature in [written vernacular Chinese](/wiki/Written_vernacular_Chinese) (白话; 白話; *báihuà*). In many cases, this written language reflected Mandarin varieties and since pronunciation differences were not conveyed in this written form, this tradition had a unifying force across all the Mandarin-speaking regions and beyond. [Hu Shih](/wiki/Hu_Shih), a pivotal figure of the first half of the twentieth century, wrote an influential and perceptive study of this literary tradition, entitled \"A History of Vernacular Literature\" (*Báihuà Wénxuéshǐ*). ### Late imperial koiné > The Chinese have different languages in different provinces, to such an extent that they cannot understand each other.... [They] also have another language which is like a universal and common language; this is the official language of the mandarins and of the court; it is among them like Latin among ourselves.... Two of our fathers [Michele Ruggieri and Matteo Ricci] have been learning this mandarin language... — [Alessandro Valignano](/wiki/Alessandro_Valignano), *Historia del principio y progresso de la Compañía de Jesús en las Indias Orientales*, I:28 (1542–1564) Until the mid-20th century, most Chinese people living in many parts of [South China](/wiki/South_China) spoke only their local variety. As a practical measure, officials of the Ming and Qing dynasties carried out the administration of the empire using a common language based on Mandarin varieties, known as *Guānhuà*. Knowledge of this language was thus essential for an official career, but it was never formally defined. Officials varied widely in their pronunciation; in 1728, the [Yongzheng Emperor](/wiki/Yongzheng_Emperor), unable to understand the accents of officials from [Guangdong](/wiki/Guangdong) and [Fujian](/wiki/Fujian), issued a decree requiring the governors of those provinces to provide for the teaching of proper pronunciation. Although the resulting Academies for Correct Pronunciation (正音書院; *Zhèngyīn Shūyuàn*) were short-lived, the decree did spawn a number of textbooks that give some insight into the ideal pronunciation. Common features included: - loss of the Middle Chinese voiced initials except for *v-* - merger of *-m* finals with *-n* - the characteristic Mandarin four-tone system in open syllables, but retaining a final glottal stop in \"entering tone\" syllables - retention of the distinction between [palatalized](/wiki/Palatalization_(sound_change)) [velars](/wiki/Velar_consonant) and dental [affricates](/wiki/Affricate), the source of the spellings \"Peking\" and \"Tientsin\" for modern \"Beijing\" and \"Tianjin\". As the last two of these features indicate, this language was a [koiné](/wiki/Koin%C3%A9_language) based on dialects spoken in the [Nanjing](/wiki/Nanjing) area, though not identical to any single dialect. This form remained prestigious long after the capital moved to [Beijing](/wiki/Beijing) in 1421, though the speech of the new capital emerged as a rival standard. As late as 1815, [Robert Morrison](/wiki/Robert_Morrison_(missionary)) based the [first English–Chinese dictionary](/wiki/A_Dictionary_of_the_Chinese_Language) on this koiné as the standard of the time, though he conceded that the Beijing dialect was gaining in influence. By the middle of the 19th century, the Beijing dialect had become dominant and was essential for any business with the imperial court. ### Standard Chinese The variant of Mandarin as spoken by educated classes in [Beijing](/wiki/Beijing) was made the official language of China by the [Qing dynasty](/wiki/Qing_dynasty) in the early 1900s and the successive Republican government. In the early years of the [Republic of China](/wiki/Republic_of_China_(1912%E2%80%931949)), intellectuals of the [New Culture Movement](/wiki/New_Culture_Movement), such as [Hu Shih](/wiki/Hu_Shih) and [Chen Duxiu](/wiki/Chen_Duxiu), successfully campaigned for the replacement of [Literary Chinese](/wiki/Literary_Chinese) as the written standard by [written vernacular Chinese](/wiki/Written_vernacular_Chinese), which was based on northern dialects. A parallel priority was the definition of a standard national language ([traditional Chinese](/wiki/Traditional_Chinese_characters): 國語; [simplified Chinese](/wiki/Simplified_Chinese_characters): 国语; [pinyin](/wiki/Pinyin): *Guóyǔ*; [Wade–Giles](/wiki/Wade%E2%80%93Giles): *Kuo²-yü³*). After much dispute between proponents of northern and southern dialects and an abortive attempt at [an artificial pronunciation](/wiki/Old_National_Pronunciation), the [National Language Unification Commission](/wiki/National_Languages_Committee) finally settled on the Beijing dialect in 1932. The People's Republic, founded in 1949, retained this standard, calling it *pǔtōnghuà* (普通话; 普通話; 'common speech'). Some 54% of speakers of Mandarin varieties could understand the standard language in the early 1950s, rising to 91% in 1984. Nationally, the proportion understanding the standard rose from 41% to 90% over the same period. This standard language is now used in education, the media, and formal occasions in both [mainland China](/wiki/Mainland_China) and [Taiwan](/wiki/Taiwan), as well as among the [Chinese community of Singapore](/wiki/Chinese_Singaporeans). However, in other parts of the [Chinese-speaking world](/wiki/Sinophone), namely [Hong Kong](/wiki/Hong_Kong) and [Macau](/wiki/Macau), the standard form of Chinese used in education, the media, formal speech, and everyday life remains the local [Cantonese](/wiki/Cantonese) because of their colonial and linguistic history. While Standard Mandarin is now the medium of instruction in schools throughout China, it still has yet to gain traction as a common language among the local population in areas where Mandarin dialects are not native. In these regions, people may be either [diglossic](/wiki/Diglossia) or speak the standard language with a notable accent. However, since the start of the 21st century, there has been an effort of mass education in Standard Mandarin Chinese and discouragement of local language usage by the Chinese government in order to erase these regional differences. From an official point of view, the mainland Chinese and the Taiwanese governments maintain their own forms of the standard under different names. The codified forms of both *Pǔtōnghuà* and *Guóyǔ* base their [phonology](/wiki/Phonology) on the Beijing accent, and also take some elements from other sources, and deviate from the Beijing dialect in vocabulary, grammar, and [pragmatics](/wiki/Pragmatics). Comparison of dictionaries produced in the two areas will show that there are few substantial differences. However, both versions of \"school-standard\" Chinese are often quite different from the Mandarin varieties that are spoken in accordance with regional habits, and neither is wholly identical to the [Beijing dialect](/wiki/Beijing_dialect). The written forms of Standard Chinese are also essentially equivalent, although [simplified characters](/wiki/Simplified_Chinese_characters) are used in mainland China and Singapore, while [traditional characters](/wiki/Traditional_Chinese_characters) remain in use in Taiwan, Hong Kong, and Macau. Singapore has followed mainland China in officially adopting simplified characters. ## Geographic distribution Mandarin is spoken across northern and southwestern China, with some pockets in neighbouring countries. Unlike their compatriots on the southeast coast, few Mandarin speakers engaged in [overseas emigration](/wiki/Overseas_Chinese) until the late 20th century, but there are now significant communities of them in cities across the world. ### Mainland China Most Han Chinese living in northern and southwestern China are native speakers of a dialect of Mandarin. The [North China Plain](/wiki/North_China_Plain) provided few barriers to migration, leading to relative linguistic homogeneity over a wide area in northern China. In contrast, the mountains and rivers of southern China have spawned the other six major groups of Chinese varieties, with great internal diversity, particularly in [Fujian](/wiki/Fujian). However, the varieties of Mandarin cover a huge area containing nearly a billion people. As a result, there are pronounced regional variations in [pronunciation](/wiki/Pronunciation), [vocabulary](/wiki/Vocabulary), and [grammar](/wiki/Grammar), and many Mandarin varieties are not mutually intelligible.[b] Most of [northeast China](/wiki/Northeast_China), except for [Liaoning](/wiki/Liaoning), did not receive significant settlements by Han Chinese until the 18th century, and as a result the [Northeastern Mandarin](/wiki/Northeastern_Mandarin) dialects spoken there differ little from the [Beijing dialect](/wiki/Beijing_dialect). The [Manchu people](/wiki/Manchu_people) of the area now speak these dialects exclusively; their native language is only maintained in northwestern [Xinjiang](/wiki/Xinjiang), where [Xibe](/wiki/Xibe_language), a modern dialect, is spoken. The frontier areas of [northwest China](/wiki/Northwest_China) were colonized by speakers of Mandarin dialects at the same time, and the dialects in those areas similarly closely resemble their relatives in the core Mandarin area. The Southwest was settled early, but the population fell dramatically for obscure reasons in the 13th century, and did not recover until the 17th century. The dialects in this area are now relatively uniform. However, long-established cities even very close to [Beijing](/wiki/Beijing), such as [Tianjin](/wiki/Tianjin), [Baoding](/wiki/Baoding), [Shenyang](/wiki/Shenyang), and [Dalian](/wiki/Dalian), have markedly different dialects. ### Taiwan Standard Mandarin is one of the official languages of [Taiwan](/wiki/Taiwan). The Taiwanese standard of Mandarin differs very little from that of mainland China, with differences largely in some technical vocabulary developed from the 1950s onwards. While the spoken standard of Taiwanese Mandarin is nearly identical to that of mainland China, the colloquial form has been heavily influenced by other local languages, especially [Taiwanese Hokkien](/wiki/Taiwanese_Hokkien). Notable differences include: the merger of [retroflex](/wiki/Retroflex) sounds (zh, ch, sh, r) with the [alveolar](/wiki/Alveolar_consonant) series (z, c, s), frequent mergers of the \"neutral tone\" with a word's original tone, and absence of [erhua](/wiki/Erhua). [Code-switching](/wiki/Code-switching) between Mandarin and Taiwanese Hokkien is common, as the majority of the population continues to also speak the latter as a native language. ### Southeast Asia #### Singapore Mandarin is one of the four official languages of [Singapore](/wiki/Singapore) along with [English](/wiki/English_language), [Malay](/wiki/Malay_language), and [Tamil](/wiki/Tamil_language). Historically, it was seldom used by the [Chinese Singaporean community](/wiki/Chinese_Singaporeans), which primarily spoke the Southern Chinese languages of [Hokkien](/wiki/Hokkien), [Teochew](/wiki/Teochew_dialect), [Cantonese](/wiki/Cantonese), or [Hakka](/wiki/Hakka_Chinese). The launch of the [Speak Mandarin Campaign](/wiki/Speak_Mandarin_Campaign) in 1979 by the government prioritized the language over traditional vernaculars in an attempt to create a common ethnic language and foster closer connections to China. This has led to a significant increase and presence of Mandarin usage in the country, coupled with a strong decline in usage of other Chinese variants. [Standard Singaporean Mandarin](/wiki/Standard_Singaporean_Mandarin) is nearly identical to the standards of China and Taiwan, with minor vocabulary differences. It is the Mandarin variant used in education, media, and official settings. Meanwhile, a colloquial form called Singdarin is used in informal daily life and is heavily influenced in terms of both grammar and vocabulary by local languages such as Cantonese, Hokkien, and Malay. Instances of code-switching with English, Hokkien, Cantonese, Malay, or a combination of any of these is also common. #### Malaysia In [Malaysia](/wiki/Malaysia), Mandarin has been adopted by local Chinese-language schools as the medium of instruction with the standard based on that of Singapore. However, it is not as widespread in daily life among the [Malaysian Chinese](/wiki/Malaysian_Chinese) community, as [Hokkien](/wiki/Hokkien) speakers continue to form a plurality among the ethnic Chinese population and [Cantonese](/wiki/Cantonese) serves as the common language (especially in commerce and local media). An exception is in the state of [Johor](/wiki/Johor), where Mandarin is increasingly used alongside Cantonese as a lingua franca in part due to Singaporean influence. As in Singapore, the local colloquial variant of Mandarin exhibits influences from Cantonese and Malay. #### Myanmar In northern [Myanmar](/wiki/Myanmar), a [Southwestern Mandarin](/wiki/Southwestern_Mandarin) variant close to the Yunnanese dialect is spoken by local Chinese and other ethnic groups. In some [rebel group](/wiki/List_of_insurgent_groups_in_Myanmar)-controlled regions, Mandarin also serves as the lingua franca. ### Central Asia The [Dungan people](/wiki/Dungan_people) of [Kyrgyzstan](/wiki/Kyrgyzstan), [Kazakhstan](/wiki/Kazakhstan) and [Uzbekistan](/wiki/Uzbekistan) are descendants of [Hui people](/wiki/Hui_people) who fled to the [Russian Empire](/wiki/Russian_Empire) from [Dzungaria](/wiki/Dzungaria) in 1877 after the fall of [Kashgaria](/wiki/Kashgaria) to Qing forces and from the [Ili](/wiki/Ili_(river)) valley after it was ceded to China in the [Treaty of Saint Petersburg](/wiki/Treaty_of_Saint_Petersburg_(1881)) in 1881. About 500 speakers live in a compact area in [Rovensky District, Saratov Oblast](/wiki/Rovensky_District,_Saratov_Oblast) in Russia. The Dungan speak two dialects, descended from [Central Plains Mandarin](/wiki/Central_Plains_Mandarin) dialects of southeast Gansu and southwest Shaanxi, and write their language in the [Cyrillic script](/wiki/Dungan_alphabets#Cyrillic). ## Classification ### Boundaries The classification of Chinese dialects evolved during the 20th century, and many points remain unsettled. Early classifications tended to follow provincial boundaries or major geographical features. In 1936, [Wang Li](/wiki/Wang_Li_(linguist)) produced the first classification based on phonetic criteria, principally the evolution of [Middle Chinese](/wiki/Middle_Chinese) voiced initials. His Mandarin group included dialects of northern and southwestern China, as well as those of [Hunan](/wiki/Hunan) and northern [Jiangxi](/wiki/Jiangxi). [Li Fang-Kuei](/wiki/Li_Fang-Kuei)'s classification of 1937 distinguished the latter two groups as [Xiang](/wiki/Xiang_Chinese) and [Gan](/wiki/Gan_Chinese), while splitting the remaining Mandarin dialects between Northern, Lower Yangtze and Southwestern Mandarin groups. The widely accepted seven-group classification of [Yuan Jiahua](/wiki/Yuan_Jiahua) in 1960 kept Xiang and Gan separate, with Mandarin divided into Northern, Northwestern, Southwestern and Jiang–Huai (Lower Yangtze) subgroups. Of Yuan's four Mandarin subgroups, the Northwestern dialects are the most diverse, particularly in the province of [Shanxi](/wiki/Shanxi). The linguist [Li Rong](/wiki/Li_Rong_(linguist)) proposed that the northwestern dialects of Shanxi and neighbouring areas that retain a final glottal stop in the Middle Chinese [entering tone](/wiki/Entering_tone) (plosive-final) category should constitute a separate top-level group called [Jin](/wiki/Jin_Chinese). He used this classification in the *[Language Atlas of China](/wiki/Language_Atlas_of_China)* (1987). Many other linguists continue to include these dialects in the Mandarin group, pointing out that the Lower Yangtze dialects also retain the glottal stop. The southern boundary of the Mandarin area, with the central [Wu](/wiki/Wu_Chinese), Gan and Xiang groups, is weakly defined due to centuries of diffusion of northern features. Many border varieties have a mixture of features that make them difficult to classify. The boundary between Southwestern Mandarin and Xiang is particularly weak, and in many early classifications the two were not separated. [Zhou Zhenhe](/wiki/Zhou_Zhenhe) and You Rujie include the [New Xiang](/wiki/New_Xiang) dialects within Southwestern Mandarin, treating only the more conservative [Old Xiang](/wiki/Old_Xiang) dialects as a separate group. The [Huizhou](/wiki/Huizhou_Chinese) dialects have features of both Mandarin and Wu, and have been assigned to one or other of these groups or treated as separate by various authors. Li Rong and the *Language Atlas of China* treated it as a separate top-level group, but this remains controversial. ### Subgroups The *Language Atlas of China* calls the remainder of Mandarin a \"supergroup\", divided into eight dialect groups distinguished by their treatment of the Middle Chinese entering tone (see Tones below):[c] - [Northeastern Mandarin](/wiki/Northeastern_Mandarin) (98 million), spoken in [northeast China](/wiki/Northeast_China) except the [Liaodong Peninsula](/wiki/Liaodong_Peninsula). This dialect is closely related to Standard Chinese, with little variation in lexicon and very few tonal differences. - [Beijing Mandarin](/wiki/Beijing_Mandarin_(division_of_Mandarin)) (27 million), spoken in Beijing and environs such as [Chengde](/wiki/Chengde) and northern [Hebei](/wiki/Hebei), as well as some areas of recent large-scale immigration, such as northern [Xinjiang](/wiki/Xinjiang). The Beijing dialect forms the basis of Standard Chinese. This classification is controversial, as a number of researchers view Beijing and Northeastern Mandarin as a single dialect group. - [Jilu Mandarin](/wiki/Jilu_Mandarin) (89 million), spoken in [Hebei](/wiki/Hebei) (\"Ji\") and [Shandong](/wiki/Shandong) (\"Lu\") provinces except the [Shandong Peninsula](/wiki/Shandong_Peninsula), as well as in few counties of [Heilongjiang](/wiki/Heilongjiang), due to migration. Includes [Tianjin dialect](/wiki/Tianjin_dialect). Tones and vocabulary are markedly different. In general, there is substantial intelligibility with Beijing Mandarin. - [Jiaoliao Mandarin](/wiki/Jiaoliao_Mandarin) (35 million), spoken in [Shandong](/wiki/Shandong_Peninsula) (Jiaodong) and [Liaodong Peninsulas](/wiki/Liaodong_Peninsula), as well as in few counties of [Heilongjiang](/wiki/Heilongjiang), due to migration. Very noticeable tonal changes, different in \"flavour\" from Ji–Lu Mandarin, but with more variance. There is moderate intelligibility with Beijing. - [Central Plains Mandarin](/wiki/Central_Plains_Mandarin) (186 million), spoken in [Henan](/wiki/Henan) province, the central parts of [Shaanxi](/wiki/Shaanxi) in the [Yellow River](/wiki/Yellow_River) valley, eastern [Gansu](/wiki/Gansu), as well as southern [Xinjiang](/wiki/Xinjiang), due to recent migration. There are significant phonological differences, with partial intelligibility with Beijing. The [Dungan language](/wiki/Dungan_language) spoken in [Kazakhstan](/wiki/Kazakhstan) and [Kyrgyzstan](/wiki/Kyrgyzstan) belongs to this group. Dungan speakers such as the poet [Iasyr Shivaza](/wiki/Iasyr_Shivaza) have reported being understood by speakers of the Beijing dialect, but not vice versa. - [Lanyin Mandarin](/wiki/Lanyin_Mandarin) (17 million), spoken in central and western [Gansu](/wiki/Gansu) province (with capital [Lanzhou](/wiki/Lanzhou)) and [Ningxia](/wiki/Ningxia) autonomous region (with capital [Yinchuan](/wiki/Yinchuan)), as well as northern [Xinjiang](/wiki/Xinjiang). - [Lower Yangtze Mandarin](/wiki/Lower_Yangtze_Mandarin) (or Jiang–Huai, 86 million), spoken in the parts of [Jiangsu](/wiki/Jiangsu) and [Anhui](/wiki/Anhui) on the north bank of the [Yangtze](/wiki/Yangtze), as well as some areas on the south bank, such as [Nanjing](/wiki/Nanjing) in [Jiangsu](/wiki/Jiangsu), [Jiujiang](/wiki/Jiujiang) in [Jiangxi](/wiki/Jiangxi), etc. There are significant phonological and lexical changes to varying degrees, and intelligibility with Beijing is limited. Lower Yangtze Mandarin has been significantly influenced by [Wu Chinese](/wiki/Wu_Chinese). - [Southwestern Mandarin](/wiki/Southwestern_Mandarin) (260 million), spoken in the provinces of [Hubei](/wiki/Hubei), [Sichuan](/wiki/Sichuan), [Guizhou](/wiki/Guizhou), [Yunnan](/wiki/Yunnan), and the Mandarin-speaking areas of [Hunan](/wiki/Hunan), [Guangxi](/wiki/Guangxi) and southern [Shaanxi](/wiki/Shaanxi). There are sharp phonological, lexical, and tonal changes, and intelligibility with Beijing is limited to varying degrees. The *Atlas* also includes several unclassified Mandarin dialects spoken in scattered pockets across southeastern China, such as [Nanping](/wiki/Nanping) in [Fujian](/wiki/Fujian) and [Dongfang](/wiki/Dongfang,_Hainan) on [Hainan](/wiki/Hainan). Another Mandarin variety of uncertain classification is apparently [Gyami](/wiki/Gyami), recorded in the 19th century in the Tibetan foothills, who the Chinese apparently did not recognize as Chinese. Some northwestern Mandarin varieties in the [Qinghai–Gansu sprachbund](/wiki/Qinghai%E2%80%93Gansu_sprachbund) have undergone drastic changes in phonology, lexicon and grammar. ## Phonology This section **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources in this section. Unsourced material may be challenged and removed. *(July 2011)* *(Learn how and when to remove this message)* A [syllable](/wiki/Syllable) consists maximally of an initial consonant, a medial [glide](/wiki/Semivowel), a vowel, a coda, and [tone](/wiki/Tone_(linguistics)). In the traditional analysis, the medial, vowel and coda are combined as a *final*. Not all combinations occur. For example, Standard Chinese (based on the Beijing dialect) has about 1,200 distinct syllables. Phonological features that are generally shared by the Mandarin dialects include: - the [palatalization](/wiki/Palatalization_(sound_change)) of [velar consonants](/wiki/Velar_consonant) and [alveolar sibilants](/wiki/Voiceless_alveolar_fricative) when they occur before [palatal glides](/wiki/Palatal_approximant); - one syllable contains maximum four phonemes (maximum three vowels and no consonant cluster) - the disappearance of final [stop consonants](/wiki/Stop_consonant) and /-m/ (although in many Lower Yangtze Mandarin and [Jin Chinese](/wiki/Jin_Chinese) dialects, an echo of the final stops is preserved as a [glottal stop](/wiki/Glottal_stop)); - the presence of [retroflex consonants](/wiki/Retroflex_consonant) (although these are absent in many [Southwestern](/wiki/Southwestern_Mandarin) and [Northeastern Mandarin](/wiki/Northeastern_Mandarin) dialects); - the historical [devoicing](/wiki/Consonant_voicing_and_devoicing) of stops and sibilants (also common to most non-Mandarin varieties). ### Initials The maximal inventory of initials of a Mandarin dialect is as follows, with bracketed pinyin spellings given for those present in the standard language: [Labial](/wiki/Labial_consonant)[Apical](/wiki/Apical_consonant)[Retroflex](/wiki/Retroflex_consonant)[Palatal](/wiki/Alveolo-palatal_consonant)[Velar](/wiki/Velar_consonant)[Stops](/wiki/Stop_consonant)/[p](/wiki/Voiceless_bilabial_plosive)/ ⟨b⟩/[t](/wiki/Voiceless_alveolar_plosive)/ ⟨d⟩/[k](/wiki/Voiceless_velar_plosive)/ ⟨g⟩/[pʰ](/wiki/Aspirated_consonant)/ ⟨p⟩/[tʰ](/wiki/Aspirated_consonant)/ ⟨t⟩/[kʰ](/wiki/Aspirated_consonant)/ ⟨k⟩[Affricates](/wiki/Affricate_consonant)/[t͡s](/wiki/Voiceless_alveolar_affricate)/ ⟨z⟩/[ʈ͡ʂ](/wiki/Voiceless_retroflex_affricate)/ ⟨zh⟩/[t͡ɕ](/wiki/Voiceless_alveolo-palatal_affricate)/ ⟨j⟩/[t͡sʰ](/wiki/Aspirated_consonant)/ ⟨c⟩/[ʈ͡ʂʰ](/wiki/Aspirated_consonant)/ ⟨ch⟩/[t͡ɕʰ](/wiki/Aspirated_consonant)/ ⟨q⟩[Fricatives](/wiki/Fricative_consonant)/[f](/wiki/Voiceless_labiodental_fricative)/ ⟨f⟩/[s](/wiki/Voiceless_alveolar_fricative)/ ⟨s⟩/[ʂ](/wiki/Voiceless_retroflex_fricative)/ ⟨sh⟩/[ɕ](/wiki/Voiceless_alveolo-palatal_fricative)/ ⟨x⟩/[x](/wiki/Voiceless_velar_fricative)/ ⟨h⟩[Nasals](/wiki/Nasal_consonant)/[m](/wiki/Voiced_bilabial_nasal)/ ⟨m⟩/[n](/wiki/Voiced_alveolar_nasal)/ ⟨n⟩/[ŋ](/wiki/Voiced_velar_nasal)/[Approximants](/wiki/Approximant)/[w](/wiki/Voiced_labial%E2%80%93velar_approximant)/ ⟨w⟩/[l](/wiki/Voiced_alveolar_lateral_approximant)/ ⟨l⟩/[ɻ](/wiki/Voiced_retroflex_approximant)/ ~ /[ʐ](/wiki/Voiced_retroflex_fricative)/ ⟨r⟩/[j](/wiki/Voiced_palatal_approximant)/ ⟨y⟩ - Most Mandarin-speaking areas distinguish between the retroflex initials /ʈʂ ʈʂʰ ʂ/ from the apical sibilants /ts tsʰ s/, though they often have a different distribution than in the standard language. In most dialects of the southeast and southwest the retroflex initials have merged with the alveolar sibilants, so that *zhi* becomes *zi*, *chi* becomes *ci*, and *shi* becomes *si*. - The alveolo-palatal sibilants /tɕ tɕʰ ɕ/ are the result of merger between the historical palatalized velars /kj kʰj xj/ and palatalized alveolar sibilants /tsj tsʰj sj/. In about 20% of dialects, the alveolar sibilants did not palatalize, remaining separate from the alveolo-palatal initials. (The unique pronunciation used in [Peking opera](/wiki/Peking_opera) falls into this category.) On the other side, in some dialects of eastern [Shandong](/wiki/Shandong), the velar initials did not undergo palatalization. - Many southwestern Mandarin dialects mix /f/ and /xw/, substituting one for the other in some or all cases. For example, *fei* /fei/ 'to fly' and *hui* /xwei/ 'grey' may be merged in these areas. - In some dialects, initial /l/ and /n/ are not distinguished. In Southwestern Mandarin, these sounds usually merge to /n/; in Lower Yangtze Mandarin, they usually merge to /l/. - People in many Mandarin-speaking areas may use different initial sounds where Beijing uses initial *r-* /ɻ/. Common variants include /j/, /l/, /n/ and /w/. - Some dialects have initial /ŋ/ corresponding to the zero initial of the standard language. This initial is the result of a merger of the Middle Chinese zero initial with /ŋ/ and /ʔ/. - Many dialects of Northwestern and Central Plains Mandarin have /pf pfʰ f v/ where Beijing has /tʂw tʂʰw ʂw ɻw/. Examples include /pfu/ 'pig' for standard *zhū* 豬 /tʂu/, /fei/ 'water' for standard *shuǐ* 水 /ʂwei/, /vã/ 'soft' for standard *ruǎn* 軟 /ɻwan/. ### Finals Most Mandarin dialects have three medial glides, /j/, /w/ and /ɥ/ (spelled *i*, *u* and *ü* in pinyin), though their incidence varies. The medial /w/, is lost after apical initials in several areas. Thus Southwestern Mandarin has /tei/ 'correct' where the standard language has *dui* /twei/. Southwestern Mandarin also has /kai kʰai xai/ in some words where the standard has *jie qie xie* /tɕjɛ tɕʰjɛ ɕjɛ/. This is a stereotypical feature of southwestern Mandarin, since it is so easily noticeable. E.g. *hai* 'shoe' for standard *xie*, *gai* 'street' for standard *jie*. Mandarin dialects typically have relatively few vowels. [Syllabic fricatives](/wiki/Syllabic_fricative), as in standard *zi* and *zhi*, are common in Mandarin dialects, though they also occur elsewhere. The Middle Chinese off-glides /j/ and /w/ are generally preserved in Mandarin dialects, yielding several [diphthongs](/wiki/Diphthong) and [triphthongs](/wiki/Triphthong) in contrast to the larger sets of monophthongs common in other dialect groups (and some widely scattered Mandarin dialects). The Middle Chinese coda /m/ was still present in [Old Mandarin](/wiki/Old_Mandarin), but has merged with /n/ in the modern dialects. In some areas (especially the southwest) final /ŋ/ has also merged with /n/. This is especially prevalent in the rhyme pairs *-en/-eng* /ən əŋ/ and *-in/-ing* /in iŋ/. As a result, *jīn* 'gold' and *jīng* 'capital' merge in those dialects. The Middle Chinese final stops have undergone a variety of developments in different Mandarin dialects (see Tones below). In [Lower Yangtze dialects](/wiki/Lower_Yangtze_Mandarin) and some north-western dialects they have merged as a final [glottal stop](/wiki/Glottal_stop). In other dialects they have been lost, with varying effects on the vowel. As a result, Beijing Mandarin and Northeastern Mandarin underwent more vowel mergers than many other varieties of Mandarin. For example: CharacterMeaningStandard (Beijing)Beijing, Harbin ColloquialJinan (Ji–Lu)Xi'an (Central Plains)Chengdu (Southwestern)Yangzhou (Lower Yangtze)Middle Chinese ReconstructedPinyinIPA课'lesson'*kè*kʰɤkʰɤkʰəkʰwokʰokʰokʰɑ客'guest'tɕʰie[d]kʰeikʰeikʰekʰəʔkʰɰak果'fruit'*guǒ*kwokwokwəkwokokokwɑ国'country'*guó*kweikwekɔʔkwək [R-coloring](/wiki/R-colored_vowel), a characteristic feature of Mandarin, works quite differently in the southwest. Whereas Beijing dialect generally removes only a final /j/ or /n/ when adding the rhotic final *-r* /ɻ/, in the southwest the *-r* replaces nearly the entire rhyme. ### Tones In general, no two Mandarin-speaking areas have exactly the same set of [tone](/wiki/Tone_(linguistics)) values, but most Mandarin-speaking areas have very similar tone *distribution*. For example, the dialects of [Jinan](/wiki/Jinan), [Chengdu](/wiki/Chengdu), [Xi'an](/wiki/Xi%27an) and so on all have four tones that correspond quite well to the [Beijing dialect](/wiki/Beijing_dialect) tones of [˥] (55), [˧˥] (35), [˨˩˦] (214), and [˥˩] (51). The exception to this rule lies in the distribution of syllables formerly ending in a stop consonant, which are treated differently in different dialects of Mandarin. [Middle Chinese](/wiki/Middle_Chinese) stops and affricates had a three-way distinction between tenuis, voiceless aspirate and voiced (or breathy voiced) consonants. In Mandarin dialects the voicing is generally lost, yielding voiceless aspirates in syllables with a Middle Chinese level tone and non-aspirates in other syllables. Of the [four tones](/wiki/Four_tones) of Middle Chinese, the level, rising and departing tones have also developed into four modern tones in a uniform way across Mandarin dialects; the Middle Chinese level tone has split into two registers, conditioned on voicing of the Middle Chinese initial, while rising tone syllables with voiced obstruent initials have shifted to the departing tone. The following examples from the standard language illustrate the regular development common to Mandarin dialects (recall that pinyin *d* denotes a non-aspirate /t/, while *t* denotes an aspirate /tʰ/): Reflexes of Middle Chinese initials and tones in modern Mandarin Middle Chinese tone\"level tone\" (*píng* 平)\"rising tone\" (*shǎng* 上)\"departing tone\" (*qù* 去)Example丹灘蘭彈亶坦懶但旦炭爛彈Middle ChinesetantʰanlandantantʰanlandantantʰanlandanStandard Chinese*dān**tān**lán**tán**dǎn**tǎn**lǎn**dàn**tàn**làn**dàn*Modern Mandarin tone1 (*yīnpíng*)2 (*yángpíng*)3 (*shǎng*)4 (*qù*) In traditional Chinese phonology, syllables that ended in a stop in Middle Chinese (i.e. /p/, /t/ or /k/) were considered to belong to a special category known as the \"[entering tone](/wiki/Entering_tone)\". These final stops have disappeared in most Mandarin dialects, with the syllables distributed over the other four modern tones in different ways in the various Mandarin subgroups. In the Beijing dialect that underlies the standard language, entering-tone syllables beginning with original voiceless consonants are distributed across the four tones. For example, the three characters 積脊跡, all *tsjek* in Middle Chinese ([William H. Baxter's transcription](/wiki/Baxter%27s_transcription_for_Middle_Chinese)), are now pronounced *jī*, *jǐ* and *jì* respectively. Older dictionaries such as *[Mathews' Chinese-English Dictionary](/wiki/Mathews%27_Chinese-English_Dictionary)* mark characters whose pronunciation formerly ended with a stop with a superscript 5; however, this tone number is more commonly used for syllables that always have a neutral tone (see below). In Lower Yangtze dialects, a minority of Southwestern dialects (e.g. [Minjiang](/wiki/Minjiang_dialect)) and Jin Chinese (sometimes considered non-Mandarin), former final stops were not deleted entirely, but were reduced to a [glottal stop](/wiki/Glottal_stop) /ʔ/. (This includes the dialect of [Nanjing](/wiki/Nanjing) on which the [Postal Romanization](/wiki/Postal_Romanization) was based; it transcribes the glottal stop as a trailing *h*.) This development is shared with [Wu Chinese](/wiki/Wu_Chinese) and is thought to represent the pronunciation of [Old Mandarin](/wiki/Old_Mandarin). In line with traditional Chinese phonology, dialects such as Lower Yangtze and Minjiang are thus said to have five tones instead of four. However, modern linguistics considers these syllables as having no [phonemic](/wiki/Phonemic) tone at all. Reflexes of the Middle Chinese entering tone in Mandarin dialects subgroupMiddle Chinese initialvoicelessvoiced [sonorant](/wiki/Sonorant)voiced obstruentBeijing1,3,442NortheasternJiao–Liao3Ji–Lu1Central Plains1Lan–Yin4Southwestern2Lower Yangtzemarked with final glottal stop (*rù*) Although the system of tones is common across Mandarin dialects, their realization as [tone contours](/wiki/Tone_contour) varies widely: Phonetic realization of Mandarin tones in principal dialects Tone name1 (*yīnpíng*)2 (*yángpíng*)3 (*shǎng*)4 (*qù*)marked with glottal stop (*rù*)Beijing[Beijing](/wiki/Beijing)˥ (55)˧˥ (35)˨˩˦ (214)˥˩ (51)Northeastern[Harbin](/wiki/Harbin)˦ (44)˨˦ (24)˨˩˧ (213)˥˨ (52)Jiao–Liao[Yantai](/wiki/Yantai)˧˩ (31)(˥ (55))˨˩˦ (214)˥ (55)Ji–Lu[Tianjin](/wiki/Tianjin)˨˩ (21)˧˥ (35)˩˩˧ (113)˥˧ (53)[Shijiazhuang](/wiki/Shijiazhuang)˨˧ (23)˥˧ (53)˥ (55)˧˩ (31)Central Plains[Zhengzhou](/wiki/Zhengzhou)˨˦ (24)˦˨ (42)˥˧ (53)˧˩˨ (312)[Luoyang](/wiki/Luoyang)˧˦ (34)˦˨ (42)˥˦ (54)˧˩ (31)[Xi'an](/wiki/Xi%27an)˨˩ (21)˨˦ (24)˥˧ (53)˦ (44)[Tianshui](/wiki/Tianshui)˩˧ (13)˥˧ (53)˦ (44)Lan–Yin[Lanzhou](/wiki/Lanzhou)˧˩ (31)˥˧ (53)˧ (33)˨˦ (24)[Yinchuan](/wiki/Yinchuan)˦ (44)˥˧ (53)˩˧ (13)Southwestern[Chengdu](/wiki/Chengdu)˦ (44)˨˩ (21)˥˧ (53)˨˩˧ (213)[Xichang](/wiki/Xichang)˧ (33)˥˨ (52)˦˥ (45)˨˩˧ (213)˧˩ʔ (31)[Kunming](/wiki/Kunming)˦ (44)˧˩ (31)˥˧ (53)˨˩˨ (212)[Wuhan](/wiki/Wuhan)˥ (55)˨˩˧ (213)˦˨ (42)˧˥ (35)[Liuzhou](/wiki/Liuzhou)˦ (44)˧˩ (31)˥˧ (53)˨˦ (24)Lower Yangtze[Yangzhou](/wiki/Yangzhou)˧˩ (31)˧˥ (35)˦˨ (42)˥ (55)˥ʔ (5)[Nantong](/wiki/Nantong)[e]˨˩ (21)˧˥ (35)˥ (55)˦˨ (42), ˨˩˧ (213)˦ʔ (4), ˥ʔ (5) Mandarin dialects frequently employ neutral tones in the second syllables of words, creating syllables whose tone contour is so short and light that it is difficult or impossible to discriminate. These atonal syllables also occur in non-Mandarin dialects, but in many southern dialects the tones of all syllables are made clear. ## Vocabulary There are more polysyllabic words in Mandarin than in all other major varieties of Chinese except [Shanghainese](/wiki/Shanghainese)[*citation needed*]. This is partly because Mandarin has undergone many more sound changes than southern varieties of Chinese have, and needed to deal with many more [homophones](/wiki/Homophone). New words have been formed by adding [affixes](/wiki/Affix) such as *lao-* 老, *-zi* 子, *-(e)r* 儿/兒, and *-tou* 头/頭, or by compounding, e.g. by combining two words of similar meaning as in *cōngmáng* 匆忙, made from elements meaning 'hurried' and 'busy'. A distinctive feature of southwestern Mandarin is its frequent use of noun [reduplication](/wiki/Reduplication), which is hardly used in Beijing. In [Sichuan](/wiki/Sichuan), one hears *bāobāo* 包包 'handbag' where Beijing uses *bāor*. There are also a small number of words that have been polysyllabic since Old Chinese, such as *húdié* 蝴蝶 'butterfly'. The singular [pronouns](/wiki/Pronoun) in Mandarin are *wǒ* 我 'I', *nǐ* 你 'you', *nín* 您 'you (formal)', and *tā* (他, 她 or 它/牠, 'he', 'she', 'it'), with *-men* 们/們 added for the plural. Further, there is a distinction between the plural first-person pronoun *zánmen* 咱们/咱們, which is inclusive of the listener, and *wǒmen* 我们/我們, which may be exclusive of the listener. Dialects of Mandarin agree with each other quite consistently on these pronouns. While the first and second person singular pronouns are cognate with forms in other varieties of Chinese, the rest of the pronominal system is a Mandarin innovation (e.g., [Shanghainese](/wiki/Shanghainese) has *non* 侬儂 'you' and *yi* 伊 'he, she'). Because of contact with Mongolian and Manchurian peoples, Mandarin (especially the Northeastern varieties) has some loanwords from these languages not present in other varieties of Chinese, such as *[hútòng](/wiki/Hutong)* (胡同) 'alley'. [Southern Chinese](/wiki/List_of_Chinese_dialects) varieties have borrowed from [Tai](/wiki/Tai_languages), [Austroasiatic](/wiki/Austroasiatic_languages), and [Austronesian languages](/wiki/Austronesian_languages). There are also many Chinese words which come from foreign languages such as *gāo'ěrfū* 高尔夫 from \"golf\", *bǐjīní* 比基尼 from \"bikini\", and *hànbǎo bāo* from \"hamburger\". In general, the greatest variation occurs in slang, in kinship terms, in names for common crops and domesticated animals, for common verbs and adjectives, and other such everyday terms. The least variation occurs in \"formal\" vocabulary—terms dealing with science, law, or government. ## Grammar Chinese varieties of all periods are considered prime examples of [analytic languages](/wiki/Analytic_language), relying on word order and particles instead of [inflection](/wiki/Inflection) or [affixes](/wiki/Affix) to provide grammatical information such as [person](/wiki/Grammatical_person), [number](/wiki/Grammatical_number), [tense](/wiki/Grammatical_tense), [mood](/wiki/Grammatical_mood), or [case](/wiki/Grammatical_case). Although modern varieties, including the Mandarin dialects, use a small number of particles in a similar fashion to suffixes, they are still strongly analytic. The basic word order of [subject–verb–object](/wiki/Subject%E2%80%93verb%E2%80%93object) is common across Chinese dialects, but there are variations in the order of the two objects of [ditransitive](/wiki/Ditransitive) sentences. In northern dialects the indirect object precedes the direct object (as in English), for example in the Standard Chinese sentence: 我 wǒ I 给 gěi give 你 nǐ you 一本 yìběn a 书 shū book [我給你一本書] 我 给 你 一本 书 wǒ gěi nǐ yìběn shū I give you a book In southern dialects, as well as many southwestern and Lower Yangtze dialects, the objects occur in the reverse order. 我 wǒ I 给 gěi give 一本 yìběn a 书 shū book 给 gěi to 你 nǐ you [我給一本書給你] 我 给 一本 书 给 你 wǒ gěi yìběn shū gěi nǐ I give a book to you Most varieties of Chinese use post-verbal particles to indicate [aspect](/wiki/Grammatical_aspect), but the particles used vary. Most Mandarin dialects use the particle *le* (了) to indicate the [perfective aspect](/wiki/Perfective_aspect) and *zhe* (着; 著) for the [progressive aspect](/wiki/Progressive_aspect). Other Chinese varieties tend to use different particles, e.g. Cantonese *zo2* (咗) and *gan2* (紧; 緊) respectively. The experiential aspect particle *guo* (过; 過) is used more widely, except in Southern Min. The subordinative particle *de* (的) is characteristic of Mandarin dialects. Some southern dialects, and a few Lower Yangtze dialects, preserve an older pattern of subordination without a marking particle, while in others a [classifier](/wiki/Classifier_(linguistics)) fulfils the role of the Mandarin particle. Especially in conversational Chinese, sentence-final [particles](/wiki/Particle_(grammar)) alter the inherent meaning of a sentence. Like much vocabulary, particles can vary a great deal with regards to the locale. For example, the particle *ma* (嘛), which is used in most northern dialects to denote obviousness or contention, is replaced by *yo* (喲; 哟) in southern usage. Some characters in Mandarin can be combined with others to indicate a particular meaning just like prefix and suffix in English. For example, the suffix -er which means the person who is doing the action, e.g. teacher, person who teaches. In Mandarin the character 師 has the same function, it is combined with 教, which means 'teach', to form the word 'teacher'. List of several common Chinese prefixes and suffixes: AffixPronunciationGlossExampleExample gloss们; 們*men*plural for human nouns, same as -s, -es学生们; 學生們, 朋友们; 朋友們'students', 'friends'可*kě*same as -able可信, 可笑, 可靠'trusty', 'laughable', 'reliable'重*chóng*same as re- (again)重做, 重建, 重新'redo', 'rebuild', 'renew'第*dì*same as -th, -st, -nd第二, 第一'second', 'first'老*lǎo*old, or show respect to a certain type of person老头; 老頭, 老板; 老闆, 老师; 老師'old man', 'boss', 'teacher'化*huà*same as -ize, -en公式化、制度化、強化'officialize', 'systemize', 'strengthen'家*jiā*same as -er or expert作家、科學家 [科学家]、藝術家 [艺术家]'writer', 'scientist', 'artist'性*xìng*same as -ness, -ability可靠性、實用性 [实用性]、可理解性'reliability', 'usability', 'understand-ability'鬼*guǐ*usually used in a disparaging way, similar to -aholic煙鬼、酒鬼、膽小鬼 [胆小鬼]'smoker', 'alcoholic', 'coward'匠*jiàng*a technician in a certain field花匠, 油漆匠, 木匠'gardener', 'painter', 'carpenter迷*mí*an enthusiast戏迷; 戲迷, 球迷, 歌迷'theater fan', 'sports fan', 'groupie (of a musician)'师; 師*shī*suffix for occupations教师; 教師, 厨师; 廚師, 律师]; 律師'teacher', 'chef', 'lawyer' ## Example text From Article 1 of the [Universal Declaration of Human Rights](/wiki/Universal_Declaration_of_Human_Rights) in Chinese (Mandarin): 人人 Rénrén 生 shēng 而 ér 自由, zìyóu, 在 zài 尊嚴 zūnyán 和 hé 權利 quánlì 上 shàng 一律 yīlù 平等。 píngděng. 他們 Tāmen 賦有 fùyǒu 理性 lǐxìng 和 hé 良心, liángxīn, 並 bìng 應 yīng 以 yǐ 兄弟 xiōngdì 關係 guānxì 的 de 精神 jīngshén 互相 hùxiāng 對待。 duìdài. 人人 生 而 自由, 在 尊嚴 和 權利 上 一律 平等。 他們 賦有 理性 和 良心, 並 應 以 兄弟 關係 的 精神 互相 對待。 Rénrén shēng ér zìyóu, zài zūnyán hé quánlì shàng yīlù píngděng. Tāmen fùyǒu lǐxìng hé liángxīn, bìng yīng yǐ xiōngdì guānxì de jīngshén hùxiāng duìdài. All human beings are born free and equal in dignity and rights. They are endowed with reason and conscience and should act towards one another in a spirit of brotherhood. - Language portal - China portal - Taiwan portal - Hong Kong portal - Singapore portal - Malaysia portal - [Chinese dictionary](/wiki/Chinese_dictionary) - [Transcription into Chinese characters](/wiki/Transcription_into_Chinese_characters) - [Written Chinese](/wiki/Written_Chinese) - [Languages of China](/wiki/Languages_of_China) - [List of varieties of Chinese](/wiki/List_of_varieties_of_Chinese) - *[Linguistic Atlas of Chinese Dialects](/wiki/Linguistic_Atlas_of_Chinese_Dialects)* - [List of languages by number of native speakers](/wiki/List_of_languages_by_number_of_native_speakers) ## Notes ### Citations ### Sources Works cited - Bagg, Mary, ed. (October 2009). \"Mandarin\". *Encyclopedia of China*. Berkshire. [ISBN](/wiki/ISBN_(identifier)) 978-0-9770159-4-8. ### Historical Western language texts - Tones in Mandarin Dialects : Comprehensive tone comparison charts for 523 Mandarin dialects. (Compiled by James Campbell) – Internet Archive mirror - Real Chinese - Mini-guides (BBC website)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:29:13.308782",
  "title": "Mandarin Chinese",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Mandarin_Chinese"
}