{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:29:16.858910"
  },
  "content": "This article **relies largely or entirely on a single source**. Relevant discussion may be found on the talk page. Please help improve this article by introducing citations to additional sources. *Find sources:* \"Mangroves of the Straits of Malacca\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(May 2010)* The **mangroves of the Straits of Malacca** are found along the coast of [Thailand](/wiki/Thailand), [Malaysia](/wiki/Malaysia), [Singapore](/wiki/Singapore) and northern [Sumatra](/wiki/Sumatra). These tropical mangrove forests are highly diverse, and are important wetlands with high conservation values. There are two [Ramsar sites](/wiki/Ramsar_site) along the Strait of Malacca: Pulau Kukup and Tanjung Piai. ## Tanjung Piai [Tanjung Piai](/wiki/Tanjung_Piai) coastal mangrove is an internationally important Ramsar site. Under the [Ramsar Convention](/wiki/Ramsar_Convention), the government and relevant stakeholders have an obligation to ensure the mangrove ecosystem and its values are maintained. [Erosion](/wiki/Erosion) at the site needs to be minimized to safeguard the ecological integrity of the mangrove ecosystem. The root causes of the erosion need to be eliminated or reduced. Tanjung Piai is a nationally important icon, being one of only five Ramsar sites in [Malaysia](/wiki/Malaysia). Tanjung Piai is also an important nature site in [Johor](/wiki/Johor), being the 3rd designated park of Johor National Park Corporation. Tanjung Piai has high socio-economic value for [fisheries](/wiki/Fishery). The site also has high [ecotourism](/wiki/Ecotourism) potential, attracting 32,360 visitors in 2006. The site is located on the southernmost tip of mainland [Asia](/wiki/Asia) and is listed as a priority site for national ecotourism. Tanjung Piai has a good representation of mangroves (22 mangrove tree species). It is also an important habitat for migratory and resident birds. These include the [IUCN-listed](/wiki/International_Union_for_Conservation_of_Nature) vulnerable species, such as the [lesser adjutant stork](/wiki/Lesser_adjutant). It is part of the [Important Bird Area](/wiki/Important_Bird_Area) (IBA) of southwest Johor, which extends from Parit Jawa to Tanjung Piai. The southwest Johor mangroves are ecologically important as a natural barrier to protect the inland villages and agricultural lands from storm events, including [tsunamis](/wiki/Tsunami). ## Mangrove fauna **This section is empty.** You can help by adding to it. *(July 2010)* ## Benthic invertebrates Mangroves are trees that grow in the intertidal zone of sheltered shores in the tropics and subtropics. The tree trunks, aerial roots, and sediment provide suitable habitats for colonization of animals. Above the ground, the trees and canopy provide a habitat for [insects](/wiki/Insect), [reptiles](/wiki/Reptile), [birds](/wiki/Bird), and [mammals](/wiki/Mammal). Mangrove roots hanging in water along creeks and inlets are home a variety of epibionts (those that encrust) such as [sponges](/wiki/Sponge), [barnacles](/wiki/Barnacle), [bivalves](/wiki/Bivalvia), and [algae](/wiki/Algae). The tree trunks within forest are also a habitat for [epibionts](/wiki/Epibiont) (small encrusting [invertebrates](/wiki/Invertebrate)) such as barnacles, bivalves, and several species of mobile gastropods including periwinkles. The soft sediment in the mangrove forest is the habitat of [polychaetes](/wiki/Polychaete), [gastropods](/wiki/Gastropod), [crabs](/wiki/Crab) and a [sipuncula](/wiki/Sipuncula) (peanut worm). Mangrove fauna may be grouped into macrofauna (larger than 2mm, gastropods/snails and crabs), meiofauna (0.1 mm to 2mm, mainly free-living [nematodes](/wiki/Nematode), [harpacticoida](/wiki/Harpacticoida), [copepods](/wiki/Copepod), and foraminifera), and microfauna (less than 0.1 mm, [ciliates](/wiki/Ciliate) and other [protozoans](/wiki/Protozoa)). ## Macrofauna Mangroves are inhabited by a variety of benthic invertebrates, such as [polychaetes](/wiki/Polychaete), gastropods, bivalves, hermit crabs, brachyuran crabs and sipuncula. Some species live on the sediment surface or reside in [burrows](/wiki/Burrow), while others live on aerial roots and lower tree trunks or prop roots. Still others burrow in decaying [wood](/wiki/Wood). The burrowing activities of benthic invertebrates have a pronounced effect on sediment properties and biochemical processes. They enhance the porosity of water flow through the sediment and assist in flushing away toxic substances. Feeding activities of invertebrates on the sediment surface and [plant](/wiki/Plant) matter promotes nutrient cycling. Benthic invertebrates are a source of food for vertebrates (for example, reptiles, birds, [otters](/wiki/Otter), and shallow water [fish](/wiki/Fish) that come into the mangrove shore at [high tide](/wiki/Tide)). Macrofauna may be divided into epifauna (living on the surface and not burrowing) and infauna (those burrowing in sediment). Many gastropods, crabs, and bivalve species are typical of epifauna. The infauna consist of few polychaetes, pistol prawns, many crabs, and a [sipuncula](/wiki/Sipuncula). Many sesarmid crabs make extensive burrows beneath the surface, and some [fauna](/wiki/Fauna) take refuge in them. ## Diversity and distribution of macrofauna Macrofaunal communities in high and low intertidal mangroves are distinctly different. This relates to prevailing different environmental conditions with different periods of tidal cover. The lower shore is frequently covered by tides, while the upper shore is covered by occasional high tides. In the high shore, the substrate is dry with more leaf litter accumulation; however, deposit feeders are abundant. Frequent inundation of the low shore also favors the presence of filter feeders like barnacles and [oysters](/wiki/Oyster) (on tree stems) and abundance of deposit feeders on the substrate. Very common invertebrates of the mangrove shore are: **Gastropods and bivalves (low shore)** - *[Littorina](/wiki/Littorina)* spp. - *[Thais tissoti](/wiki/Thais_tissoti)* - *[Murex](/wiki/Murex) capucinus* - *[Nerita](/wiki/Nerita) articulata* - *[Neritina](/wiki/Neritina) violacea* - *[Telescopium telescopium](/wiki/Telescopium_telescopium)* - *Telescopium mauritsi* - *Syncera brevicula* - *[Cerithidea cingulata](/wiki/Cerithidea_cingulata)* - *[Enigmonia aenigmatica](/wiki/Enigmonia_aenigmatica)* (bivalve) - *Xenostrobus* sp. (mytilid bivalve) - Brachyuran crabs (low shore) - *[Uca](/wiki/Fiddler_crab) mani* - *Uca dussumieri* - *Metaplax elegans* - *Metaplax crenulatus* - *[Ilyoplax](/wiki/Ilyoplax)* spp. - [Hermit crabs](/wiki/Hermit_crab) **Gastropods and a bivalve (high shore)** - *Ellobium aurismidae* - *Ellobium aurisjudae* - *Cassidula aursifelis* - *Laemodonta* spp. - *Melampus* sp. - *Cerithidea obtusa* - *Cerithidea quadrata* - *Nerita articulata* - *Telescopium telescopium* - *Telescopium mauritsi* - *Syncera brevicula* - *Geloina erosa* (bivalve) - Brachyuran crabs (high shore) - [Grapsid crabs](/wiki/Grapsidae) - *Episesarma* spp. - *Perisesarma eumople* - *Perisesarma onychophorum* - *Clistocoeloma merguiensis* ## Functional role of macrobenthos [Macrobenthos](/wiki/Macrobenthos) (crabs and gastropods) ingest sediment and food such as [bacteria](/wiki/Bacteria), [microalgae](/wiki/Microphyte), meiofauna and detritus. They burrow, move through, and modify it in many physical and chemical ways. Crab burrows provide an efficient mechanism for exchanging water between the anoxic substrate and the overlying water. A crab burrow inhabited by a sesarmid crab and a pistol [prawn](/wiki/Prawn) was completely flushed within one hour by the activities of the crustaceans during a single tidal event. Crabs and gastropods are the major seed predators in mangrove forests and play an important role in determining plant community structure. There are mutual relationships between sesarmid crabs and mangroves, where mangroves provide a suitable habitat for the crabs, and the crabs reduce competition between mangrove plant species through selective predation on seedlings. High seed predation by crabs can have negative influence on regeneration of mangrove trees. Grapsid crabs dominate in [Australia](/wiki/Australia), Malaysia and [Panama](/wiki/Panama), while gastropods Cerithidea scalariformis and Melampus coeffeus are important seed predators in [Florida](/wiki/Florida) mangroves. Detritus feeding invertebrates dominate the mangrove fauna. Grapsid crabs are major consumers of mangrove leaf litter and therefore produce large amounts of [fecal material](/wiki/Feces) rich in [nutrients](/wiki/Nutrient) and energy. These crabs graze and pick organic material off the surface of sediment, suggesting that they are using microbial resources for their [nitrogen](/wiki/Nitrogen) needs. Fish predation on mangrove invertebrates occurs at high tide when mangrove shore is inundated. Fishes netted within the mangroves at high tide showed the presence of crabs and sipuncula in their stomachs. Benthic invertebrates in the mangrove forest play an important ecological role by burrowing in the sediment where they assist in flushing toxic substances and modifying the oxidation status of the surrounding sediment. Feeding on plant matter assists in recycling organic matter and produces [animal biomass](/wiki/Biomass_(ecology)). Animal biomass is a source of food for vertebrate predators; e.g. reptiles, birds, otters, and inshore fishes that come in at high tide. - Ecology of Klang Strait - editors, A. Sasekumar, V.C. Chong\n",
  "language": "en",
  "processed_at": "2026-01-12T11:29:16.858388",
  "title": "Mangroves of the Straits of Malacca",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Mangroves_of_the_Straits_of_Malacca"
}