{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:29:18.502402"
  },
  "content": "Singaporean real estate company**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **relies excessively on references to primary sources**. Please improve this article by adding secondary or tertiary sources. *Find sources:* \"Mapletree Investments\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(February 2012)* *(Learn how and when to remove this message)*This article **may contain excessive or inappropriate references to self-published sources**. Please help improve it by removing references to unreliable sources where they are used inappropriately. *(January 2024)* *(Learn how and when to remove this message)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Mapletree Investments\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(January 2024)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* **Mapletree Investments Pte Ltd** is a global [real estate](/wiki/Real_estate) development, investment, capital and property management company. Headquartered in [Singapore](/wiki/Singapore), the Group currently manages three Singapore-listed real estate investment trusts (REITs) and nine private equity real estate funds, which hold a diverse portfolio of assets in Asia Pacific, Europe, the United Kingdom (UK) and the United States (US). ## Introduction On 7 December 2000, [PSA Corporation](/wiki/PSA_International) formed The HarbourFront Ltd to transfer its non-port properties to [Temasek Holdings](/wiki/Temasek_Holdings). Mapletree Investments Pte Ltd was later formed on 18 December 2000 and is a wholly owned subsidiary of Temasek. Mapletree owns and manages S$77.4 billion of logistics, office, retail, mixed-used, industrial, data centre, student accommodation and residential properties as at 31 March 2023/2024. The Group's properties, are located across 13 markets globally and has offices in Singapore, [Australia](/wiki/Australia), Canada, [China](/wiki/China), Europe, [Hong Kong SAR](/wiki/Hong_Kong_SAR), [India](/wiki/India), [Japan](/wiki/Japan), [Malaysia](/wiki/Malaysia), [South Korea](/wiki/South_Korea), the [United Kingdom](/wiki/UK), the [United States](/wiki/US) and [Vietnam](/wiki/Vietnam). Mapletree's property portfolio includes projects in Singapore such as [VivoCity](/wiki/VivoCity), Mapletree Business City, and Saigon South Place in Ho Chi Minh City, Vietnam. - Mapletree Investments - Not to be confused with Mapletree Studio\n",
  "language": "en",
  "processed_at": "2026-01-12T11:29:18.501942",
  "title": "Mapletree Investments",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Mapletree_Investments"
}