{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:29:46.179064"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Marina South Pier\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(March 2017)* *(Learn how and when to remove this message)* **Marina South Pier** is a [pier](/wiki/Pier) that is located in [Marina South](/wiki/Marina_South), [Singapore](/wiki/Singapore). It is used as a terminal for tourists and day-trippers who are boarding small boats and ferries heading for the [Southern Islands](/wiki/Southern_Islands). There are regular ferries from the pier to [Kusu Island](/wiki/Kusu_Island) and [Saint John's Island](/wiki/Saint_John%27s_Island). Spare parts, documents, water test kits and 3D-printed consumables are partly delivered via Unmanned Aircraft Systems (drones) to vessels anchored at the South Pier. ## History Marina South Pier was first announced in January 2004, to act as a landing point for ship's crews in place of [Clifford Pier](/wiki/Clifford_Pier). Covering an area of 92,000 square feet (8,500 m2), the pier was intended to be the first of four ferry terminals at Marina South, and to make way for the conversion of [Marina Bay](/wiki/Marina_Bay,_Singapore) into a reservoir. The pier commenced operations in April 2006, but due to poor transport connections and lack of development in the vicinity, boat operators at the pier initially fared poorly, while efforts by the [Maritime and Port Authority of Singapore](/wiki/Maritime_and_Port_Authority_of_Singapore) to publicise the pier had little effect. Marina South Pier was subsequently officially opened in June 2006, and played host to an open house showcasing careers in the maritime industry to students. In 2012, a 1,000 square metres (11,000 sq ft), S$5 million Singapore Maritime Gallery was opened at the pier, while businesses at the pier continued to do poorly as of 2013. On 22 November 2014, the [North–South MRT line](/wiki/North%E2%80%93South_Line_(Singapore)) was extended to serve Marina South Pier at [Marina South Pier MRT station](/wiki/Marina_South_Pier_MRT_station). ## Design Capable of handling up to 3,000 passengers, Marina South Pier comprises a three-storey building with immigration facilities, food establishments, a viewing deck and ticketing booths. It also sports a green glass facade and a wavy roof. - Marina South Pier at the Maritime and Port Authority of Singapore website This article about transport in [Singapore](/wiki/Singapore) is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:29:46.178584",
  "title": "Marina South Pier",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Marina_South_Pier"
}