{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:29:24.647543"
  },
  "content": "Subject of 1950 civil unrest in Singapore**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Maria Hertogh\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(February 2021)* *(Learn how and when to remove this message)*This article's **tone or style may not reflect the encyclopedic tone used on Wikipedia**. See Wikipedia's guide to writing better articles for suggestions. *(May 2023)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* **Maria Huberdina Hertogh** (born *Huberdina Maria Hertogh*; 24 March 1937 – 8 July 2009), also known as **Bertha Hertogh,** **Nadra binte Ma'arof**, **Nadra Adabi** or simply **Natrah**, was a Dutch woman of Eurasian descent and [Malay](/wiki/Malays_(ethnic_group)) upbringing. She is notable for being at the centre of the [Maria Hertogh riots](/wiki/Maria_Hertogh_riots) when she was a young girl. She was born to Dutch Roman Catholic parents in [Java](/wiki/Java) (then part of the [Dutch East Indies](/wiki/Dutch_East_Indies)). During [World War II](/wiki/World_War_II), her parents were imprisoned by the Japanese and she was given to a [Malay](/wiki/Malays_(ethnic_group)) [Muslim](/wiki/Muslim), Che Aminah binte Mohamed, and raised as a Muslim under the name Nadra. After the war, Maria’s biological parents sought to reclaim her and a custody battle ensued between the Hertoghs and Che Aminah. The British colonial court in [Singapore](/wiki/Singapore) ruled in favor of the Dutch parents in 1950, ordering that Maria be returned to them. The court's decision was seen as an insult to [Islam](/wiki/Islam), since Maria was taken from a Muslim home and forced to leave her faith. A protest by outraged Muslims escalated when images of her were published showing her kneeling before a statue of the [Virgin Mary](/wiki/Virgin_Mary) and [Saint Blaise](/wiki/Saint_Blaise), leading to riots that took place between 11 and 13 December 1950 in Singapore. 18 people were killed and 173 injured; many properties were also damaged. Part of a series on the[History of Singapore](/wiki/History_of_Singapore)[Early history](/wiki/Early_history_of_Singapore) (pre-1819)[Srivijaya](/wiki/Srivijaya)650–1377[Temasek](/wiki/Temasek), [Long Ya Men](/wiki/Long_Ya_Men), [Ban Zu](/wiki/Ban_Zu)c.14th century[Kingdom of Singapura](/wiki/Kingdom_of_Singapura)1299–1398[Majapahit](/wiki/Majapahit)1398–1400[Malacca Sultanate](/wiki/Malacca_Sultanate)1400–1528[Johor Sultanate](/wiki/Johor_Sultanate)1528–1819British colonial era (1819–1942)[Founding](/wiki/Founding_years_of_modern_Singapore)1819–1826[Straits Settlements](/wiki/Singapore_in_the_Straits_Settlements)1826–1867[Crown colony](/wiki/Singapore_in_the_Straits_Settlements#Crown_colony_(1867–1942))1867–1942[Japanese Occupation](/wiki/Japanese_occupation_of_Singapore) (1942–1945)[Fall of Singapore](/wiki/Fall_of_Singapore)1942[Sook Ching](/wiki/Sook_Ching)1942[Double Tenth incident](/wiki/Double_Tenth_incident)1943[Post-war period](/wiki/Colony_of_Singapore) (1945–1962)[First Legislative Council](/wiki/History_of_Singapore#First_Legislative_Council_(1948–1951))1948–1951[Maria Hertogh riots](/wiki/Maria_Hertogh_riots)1950[Second Legislative Council](/wiki/History_of_Singapore#Second_Legislative_Council_(1951–1955))1951–1955[Anti-National Service Riots](/wiki/1954_National_Service_riots)1954[Internal self-government](/wiki/Self-governance_of_Singapore) (1955–1963)[Hock Lee bus riots](/wiki/Hock_Lee_bus_riots)1955[Singapore Glass Factory strikes](/wiki/Singapore_Glass_Factory_strikes)1960[Pulau Senang prison riots](/wiki/Pulau_Senang_prison_riots)1963[Merger with Malaysia](/wiki/History_of_the_State_of_Singapore_(Malaysia)) (1963–1965)[Singaporean referendum](/wiki/1962_Singaporean_integration_referendum)1962[Operation Coldstore](/wiki/Operation_Coldstore)1963[Race riots in Singapore](/wiki/1964_race_riots_in_Singapore)1964[MacDonald House bombing](/wiki/MacDonald_House_bombing)1965[Republic of Singapore](/wiki/History_of_the_Republic_of_Singapore) (1965–present)[ASEAN Declaration](/wiki/ASEAN_Declaration) ([ASEAN](/wiki/Association_of_Southeast_Asian_Nations))1967[1969 race riots of Singapore](/wiki/1969_race_riots_of_Singapore)1969[Laju incident](/wiki/Laju_incident)1974[Operation Spectrum](/wiki/Operation_Spectrum)1987[Asian financial crisis](/wiki/1997_Asian_financial_crisis#Singapore)1997[Embassies attack plot](/wiki/Singapore_embassies_attack_plot)2001[H1N1 pandemic](/wiki/2009_swine_flu_pandemic_in_Asia#Singapore)2009–2010[Bus drivers' strike](/wiki/2012_Singapore_bus_drivers%27_strike)2012[Little India riot](/wiki/2013_Little_India_riot)2013[2018 North Korea–United States Singapore Summit](/wiki/2018_North_Korea%E2%80%93United_States_Singapore_Summit)2018[COVID-19 pandemic](/wiki/COVID-19_pandemic_in_Singapore)2020–2022By topic - [Timeline](/wiki/Timeline_of_Singaporean_history) - [Riots](/wiki/List_of_riots_in_Singapore) - [Military](/wiki/Military_history_of_Singapore) Singapore portal - v - t - e ## Birth and baptism Huberdina Maria Hertogh was born on 24 March 1937 to a [Dutch Catholic](/wiki/Roman_Catholicism_in_the_Netherlands) family living in [Cimahi](/wiki/Cimahi), near [Bandung](/wiki/Bandung), [Java](/wiki/Java), then a part of the [Dutch East Indies](/wiki/Dutch_East_Indies) (now [Indonesia](/wiki/Indonesia)). Her biological father, Adrianus Petrus Hertogh, came to Java in the 1920s as a [sergeant](/wiki/Sergeant) in the [Royal Netherlands East Indies Army](/wiki/Royal_Netherlands_East_Indies_Army). In the early 1930s, he married Adeline Hunter, a Eurasian of [Scottish](/wiki/Scottish_people)-[Javanese](/wiki/Javanese_people) descent brought up in Java. Maria was [baptised](/wiki/Baptism) in the Roman Catholic Church of Saint Ignatius at Tjimahi on 10 April by a [Catholic priest](/wiki/Catholic_priest). ## Early life At the outbreak of [World War II](/wiki/World_War_II), Adrianus Hertogh, a sergeant in the [Dutch Army](/wiki/Dutch_Army), was captured by the [Imperial Japanese Army](/wiki/Imperial_Japanese_Army) and sent to a [POW](/wiki/POW) camp in Japan, where he was kept until 1945. Meanwhile, Adeline Hertogh stayed with her mother, Nor Louise, and her five children, among whom Maria was the third and youngest daughter. On 29 December 1942, Adeline gave birth to her sixth child, a boy. Three days later, Maria went to stay with Che Aminah binte Mohammad, a 42-year-old Malay woman from [Kemaman](/wiki/Kemaman), [Terengganu](/wiki/Terengganu), [Malaya](/wiki/British_Malaya) (now [Malaysia](/wiki/Malaysia)) who was a close friend of Nor Louise. ### Adeline Hertogh's version of events According to Adeline Hertogh, in testimony given in evidence before the court at the hearing in November 1950, she was persuaded by her mother after the birth of her sixth child to allow Maria to go and stay with Aminah in [Bandung](/wiki/Bandung) for three or four days. Consequently, Aminah arrived on 1 January 1943 to fetch Maria. When the child was not returned, Hertogh borrowed a bicycle on 6 January and set out to retrieve her. She claimed that she was stopped by a Japanese sentry on the outskirts of Bandung as she did not possess a pass and was therefore interned. From her internment camp, she smuggled a letter to her mother, requesting for her children to be sent to her. This Nor Louise did, but Maria was not among them. Hertogh asked her mother to fetch Maria from Aminah. Her mother later wrote and told her that Aminah wanted to keep Maria for two more days, after which she herself would bring the child to the camp. However, Hertogh did not see Maria throughout her internment. After her release, she could not find either Maria nor Aminah. ### Life with Aminah Upon arriving with Aminah, Maria was given the name Nadra binte Ma'arof. For unknown reasons, her new family moved to [Jakarta](/wiki/Jakarta) for a period before moving back to Bandung, where Aminah worked for the [Japanese military police](/wiki/Kempetai) as an [interpreter](/wiki/Interpreting) until the end of the war. Aminah moved back to her hometown of Kampung Banggol in [Kemaman](/wiki/Kemaman), [Terengganu](/wiki/Terengganu). By then Maria was the same as any other Malay Muslim girl of her age: she spoke only [Malay](/wiki/Malay_language), wore Malay clothes, and practiced her religion devoutly. Maria had an adoptive elder sister of Japanese descent, Kamariah Mohd Dahan, whom Aminah had adopted in [Tokyo](/wiki/Tokyo) when she lived there with her husband. ### Custody battle In 1945, with the end of World War II, Sergeant Hertogh was released and returned to Java and reunited with his wife. The couple stated that they inquired about Maria, but could find neither her nor Aminah. They returned to the Netherlands after requesting the Dutch authorities in Java and Singapore to search for the child. Investigations were then made by the [Red Cross Society](/wiki/Red_Cross_Society), the [Royal Netherlands Army](/wiki/Royal_Netherlands_Army), the Indonesian Repatriation Service, and local police. Finally, in September 1949, Aminah and Maria were traced to the [kampung](/wiki/Kampung) in which they were living. Negotiations were opened to retrieve Maria in early 1950. The Dutch Consulate offered [$](/wiki/Malayan_dollar)500 to make up for Aminah's expenses in bringing up the girl for eight years. Aminah rejected the offer. Attempts were then made to persuade Aminah to travel with Maria to Singapore in April to discuss the issue with the Dutch Consul-General; Aminah again refused. The Consulate then applied to the [High Court of Singapore](/wiki/High_Court_of_Singapore) on 22 April for Maria to be delivered into the custody of the Social Welfare Department, pending further order. The [Chief Justice](/wiki/Chief_Justice) heard the request the same day and approved the application *[ex parte](/wiki/Ex_parte)*. The next day, an officer from the department served the order to take Maria from Aminah's custody, and Maria was then placed in the Girls' Home at York Hill. From this point on, Maria made it clear that she wanted to stay with Aminah and did not wish to be returned to her natal parents. Aminah contended that Adeline had given Maria over to her willingly, and this was supported by the testimony of Soewaldi Hunter, Adeline's elder brother, who bore witness to the adoption. However, after a 15-minute hearing on 19 May, the High Court ruled that the custody of Maria be granted to the Hertoghs. As Aminah and Maria exited the court via the back door, a car from the consulate was waiting to take Maria away. Maria refused to enter the car and clung on to Aminah, both shouting in Malay that they would kill themselves rather than be separated. A large crowd quickly formed around the commotion. It was only after much persuasion that Aminah agreed to enter the car together with Maria and pay a visit to her lawyer, who explained that Maria had to be given up until an appeal was made. The duo then parted in tears, with Maria returned to the convent for temporary safekeeping.[*citation needed*] Maria stayed at the convent for two more months under a further order from the Chief Justice pending appeal, which was filed on 28 July. The verdict was an overruling of the earlier decision; aside from the *ex parte* order to hand Maria to the Social Welfare Department, the Appellate Court found ambiguity in the Dutch Consul-General's representation of Maria's natal father. Both Aminah and Maria were overjoyed.[*citation needed*] ### Controversial marriage On 1 August 1950, Maria was married by way of a *nikah gantung* (to be consummated when both parties were of age, valid under [Islamic law](/wiki/Sharia)) to 21-year-old Mansoor Adabi, a Kelantan-born teacher-in-training at the [Bukit Panjang Government School](/wiki/Bukit_Panjang_Government_School). The marriage was later speculated to have been a manoeuvre by Aminah to prevent further retrieval attempts by the Hertoghs; Maria returned to live with Aminah after the wedding night, and the marriage was never consummated. Because the marriage had been solemnised in Singapore, which was at that time under British rule, British law controlled the validity of the marriage rather than Malayan law. The first challenges on the marriage's validity came from within the Muslim community. On 10 August, a Muslim leader wrote to [The Straits Times](/wiki/The_Straits_Times), pointing out that although Islamic law permits the marriage of girls starting after [puberty](/wiki/Puberty) (which Maria had reached a year earlier), there were Muslim countries such as [Egypt](/wiki/Egypt) that legislated for a minimum marriage age of 16. He added, however, that it would not be in the interest of \"the friendly understanding... between Christians and Muslims\" to object to the marriage since it had already taken place. The latter view was held by the majority of the Muslim population, albeit in a more antagonistic mood against the Dutch and Europeans at large.[*citation needed*] ### Second appeal Meanwhile, the Hertoghs had not given up legal pursuit to retrieve Maria. Only a day after the marriage, Aminah received the Hertoghs' representative lawyers from [Kuala Lumpur](/wiki/Kuala_Lumpur). The lawyers delivered a letter demanding Maria's return by 10 August, failing which legal action would be taken. Believing that the marriage settled the matter, Aminah and Mansoor both ignored the deadline. The Hertoghs did not. On 26 August, an originating summons was taken out, under the Guardianship of Infants Ordinance, by the Hertoghs as [plaintiffs](/wiki/Plaintiff) against Aminah, Maria and Mansoor, who were all made [defendants](/wiki/Defendant). The hearing proceeded between 20 and 24 November. For four months, the matter hung in suspense. During this time, in order to avoid public scrutiny, Maria rarely left her residence in the house of M.A. Majid, then-president of the Muslim Welfare Association and Adabi's foster father. Nevertheless, media coverage on the incident had grown to a global scale. Letters from Muslim organisations in [Pakistan](/wiki/Pakistan) promising financial and other help arrived, some going so far as to declare any further move by the Dutch Government to separate the couple as \"an open challenge to the Muslim world\". Pledges of aid also came from Maria's native [Indonesia](/wiki/Indonesia) and as far as [Saudi Arabia](/wiki/Saudi_Arabia). The hearing finally opened, and Maria's natal mother, Adeline Hertogh travelled down to Singapore to attend. The judge, Justice Brown, delivered the verdict in the case entitled *Re M. H. Hertogh, an Infant: Hertogh v. Amina binte Mohamed and Others* two weeks later. The marriage, instead of resolving the dispute, had instead complicated it. His judgment stated *inter alia*: 1. That \"after a most careful consideration of all the evidence which bears upon this marriage, the age of the child, the opportunities which she had of knowing Mansoor, and the date of the marriage in relation to the date of the Court of Appeal decision, I am compelled to the conclusion that this purported marriage was a manoeuvre designed to prejudice these proceedings, which is discreditable to all concerned. In saying that, I wish to make it clear that I am satisfied that the child was neither forced nor tricked into it.\" 2. That \"following the rule in *Sottomayor v. De Barros (No. 2)*, the validity of a marriage celebrated in Singapore between persons of whom the one has a Singapore, and the other a foreign, domicile is not affected by any incapacity which, though existing under the law of such foreign domicile, [does not exist](/wiki/Lex_loci_celebrationis) under the law of Singapore.\" 3. That nevertheless \"Maria's incapacity [to contract marriage] under the law of her (father's domicile), admittedly Holland, to contract the marriage, since she was under age, existed also under the law of Singapore.\" 4. That \"since her father had not waived or by his conduct abrogated his legal right to control the religion of his child and had not consented to her becoming a Muslim, whatever the child may say and whatever ceremonies and teaching she may have undergone, she is not in the eyes of this court a Muslim.\" 5. That \"therefore the purported marriage was void.\" Having over-ruled the purported marriage, Justice Brown went on to deal with what he described as the \"most difficult\" question of [custody](/wiki/Child_custody). He noted that his duty to the law required him \"to have regard primarily to the welfare of the infant\". He believed this meant that he not only had to consider the current wishes of Maria, but also her future well-being. He stated: > \"It is natural that she should now wish to remain in Malaya among people whom she knows. But who can say that she will have the same views some years hence after her outlooks has been enlarged, and her contacts extended, in the life of the family to which she belongs?\" He also noted that whatever the details of the contested initiation of the custody at the end of 1942 might be, Adrianus Hertogh had not been part of it and had not abrogated his parental rights. He therefore awarded the custody of Maria to the Hertoghs and ordered that she should be handed over to her mother with immediate effect. ### Stay at the convent When police came to take Maria, she wept and clung to Aminah and Mansoor. Aminah fainted on the spot and a doctor standing by had to attend to her. Mansoor advised Maria to concede for the time being and promised that he and others would carry on the legal fight. Thus Maria allowed herself to be brought away into a car.[*citation needed*] Outside, the police, including a [Gurkha Contingent](/wiki/Gurkha_Contingent), held back a crowd of several hundred. The car delivered Maria to the Roman Catholic Convent of the Good Shepherd, run by the [Sisters of the Good Shepherd](/wiki/Congregation_of_Our_Lady_of_Charity_of_the_Good_Shepherd), at Thomson Road. Mrs. Hertogh stayed at another address for a few days, from where she visited Maria daily, before moving into the convent herself. According to an official of the Netherlands Consulate-General, such arrangement was because of \"greater convenience\" while the stay of execution pending appeal was in effect. But it proved to be the spark that lit the fuse of the subsequent riots. The press was not barred from entering the [convent](/wiki/Convent) grounds. On 5 December, the *[Singapore Tiger Standard](/wiki/Singapore_Tiger_Standard)* published on its front page a photograph of Maria standing holding hands with the [Reverend Mother](/wiki/Abbess). There were several more pictures on page 2, under the headline: *Bertha knelt before [the] Virgin Mary Statue*. The [Malay](/wiki/Malay_language) press retorted. The *[Utusan Melayu](/wiki/Utusan_Melayu)* published on 7 December three photographs of Maria weeping and being comforted by a nun, as well as articles about Maria's \"lonely and miserable\" life in the convent. These pictures, whether presenting Maria as happy or sad, mostly showed Maria surrounded by symbols of Christian faith. The Muslims, who looked upon Maria as one of their own, were deeply offended by such pictures, not to mention the sensational reports, some of which explicitly labelled the case as a religious issue between Islam and Christianity. On 9 December, an organisation calling itself the Nadra Action Committee was formally constituted under the leadership of [Karim Ghani](/wiki/Karim_Ghani), a Muslim political activist from [Rangoon](/wiki/Rangoon). The Committee solicited support among local Muslims by distributing free copies of its newspaper, the *Dawn* (not the *[Dawn](/wiki/Dawn_(newspaper))*, an English paper published in Pakistan). Karim Ghani had also made an open speech at the [Sultan Mosque](/wiki/Sultan_Mosque,_Singapore) on 8 December in which he mentioned [jihad](/wiki/Jihad) as a final resort. In the light of the mounting backlash, the [Criminal Investigation Department](/wiki/Criminal_Investigation_Department) sent a memo to the [Colonial Secretary](/wiki/Chief_Secretary,_Singapore) suggesting moving Maria back to York Hill to avoid further inciting Muslim anger. The Secretary did not agree on grounds that he had received no such representations from Muslim leaders, nor did he have the authority to remove Maria without further court orders.[*citation needed*] It cannot be said definitively that moving Maria out of the convent at such a late stage could have averted the riots. ## The riots and subsequent trials The appeal hearing opened on 11 December. Maria stayed at the convent and did not attend. Since early morning, crowds carrying banners and flags with [star and crescent](/wiki/Star_and_crescent) symbols began to gather around the [Supreme Court](/wiki/Old_Supreme_Court_Building,_Singapore). By noon, when the hearing eventually began, the restive crowd had grown from 2,000 to 3,000 in number. The court threw out the appeal within five minutes. The brevity of the hearing convinced the gathering that the colonial legal system was biased against Muslims. The riots erupted. The riots continued for three days and a curfew was imposed for two weeks. The mob, largely consisting of Muslims, moved out to attack any [Europeans](/wiki/European_ethnic_groups) and even Eurasians in sight. They overturned cars and burnt them. The police force and its lower ranks largely consisted of Malays who sympathized with the rioters' cause and were ineffective in quelling the riots. By nightfall, the riots had spread to even the more remote parts of the island. Help from the [British military](/wiki/British_military) was enlisted only at around 6:45 PM. Major-General Dunlop promptly deployed two internal security battalions while calling in further reinforcements from Malaya. Meanwhile, various Muslim leaders appealed over the radio for the riots to cease. Reinforcements arrived early on 12 December, but riotous incidents continued on that day. The troops and police only managed to regain control of the situation by noon on 13 December. In total, 18 people were killed, among whom were seven Europeans or Eurasians, [two police officers](/wiki/List_of_Singapore_police_officers_killed_in_the_line_of_duty), and nine rioters shot by the police or military, 173 were injured, many of them seriously, 119 vehicles were damaged and at least two buildings were set on fire. Subsequently, two weeks of 24-hour curfew were imposed, and it was a long time before complete law and order were re-established. > The first procession to be arranged would be this – 1500 girls aged 14 and under would march in procession to the Convent to present a Quran, a praying carpet, and two Malay dresses to Maria. One of the many complaints is the rumor that the Quran, the praying carpet, and the Malay dresses sent by Aminah did not reach Maria. — The words of Karim Ghani at the congregation to adopt four remedies to calm the tense situation, quoted in, Haja Maideen, The Nadra Tragedy: the Maria Hertogh Controversy, p. 220. After the riot, the police set up a special investigation unit that detained 778 people, among them Karim Ghani. Out of these, 403 were released unconditionally and 106 were released on various conditions (they generally had to report to the police station monthly and adhere to a curfew after dark). The police eventually brought rioting charges against 200 people, of whom 25 were acquitted, 100 were convicted, 62 were referred to the Enquiry Advisory Committee and seven were brought to trial at the [Assize Court](/wiki/Assize_Court) for wanton killing and five of them were subsequently sentenced to [death](/wiki/Death_penalty) on the [gallows](/wiki/Gallows). One of the five that was sentenced to the [gallows](/wiki/Gallows) was A.K.S. Othman Ghani, a respected Indian businessman from [Madras](/wiki/Madras). On 25 August 1951, [Tunku Abdul Rahman](/wiki/Tunku_Abdul_Rahman), who would later become the first Prime Minister of Malaysia, took over as the president of [UMNO](/wiki/UMNO), a Malay-centric party. He immediately set out to save the five on death row. Having garnered support from the Muslim population, Abdul Rahman placed pressure on the authorities, who finally gave in. The British government was expecting their role as the colonial master to end very soon and did not wish to leave behind grim memories. The death sentences for all five were commuted to [life imprisonment](/wiki/Life_imprisonment_in_Singapore). ## Aftermath of the riots A Commission of Inquiry was appointed by Governor [Franklin Gimson](/wiki/Franklin_Charles_Gimson). It was headed by Sir [Lionel Leach](/wiki/Lionel_Leach), a member of the [Judicial Committee of the Privy Council](/wiki/Judicial_Committee_of_the_Privy_Council). The Commission placed large blame on the police command for not having anticipated the violence from many indicators between 2 and 11 December. Furthermore, when the riots first started, the police failed to act promptly to disperse the crowd. The [Gurkha Contingent](/wiki/Gurkha_Contingent) standing by was not put into action, while too much dependence was placed on [Malay](/wiki/Malay_people) policemen, many of whom defected or at least hesitated to carry out their duties. The [British House of Commons](/wiki/British_House_of_Commons) criticised the colonial government for its poor handling of the situation. The present-day [Government of Singapore](/wiki/Government_of_Singapore) under then-Prime Minister [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) also attributes the tragedy to the insensitivity of the colonial government towards the racial and religious feelings of the locals. It cites the incident as a vital lesson learnt in the importance of racial and religious understanding and harmony, as well as a case for imposing a certain degree of government control on the media, especially when racial or religious issues are implicated. ## Leaving for the Netherlands On the night the riots broke out, Maria was moved out of the convent, where the rioters tried twice to march on and were only kept back by the police. Plans were made at York Hill to receive her but she was instead sent to [Saint John's Island](/wiki/Saint_John%27s_Island), an offshore island 4 miles south of the main island of Singapore. The next day, Maria was taken by Adeline to the Netherlands by aeroplane. After landing in [Schiphol Airport](/wiki/Schiphol_Airport), they quickly proceeded to the Hertogh home on the outskirts of [Bergen op Zoom](/wiki/Bergen_op_Zoom). At first, Maria could only talk to Adeline, the only one in the family who understood [Malay](/wiki/Malay_language). She demanded rice with every meal, resenting the western diet, and continued to perform her Muslim prayers five times a day. In addition, a policeman in plain clothes was assigned to escort her whenever she left the house, for fear of possible kidnappers who might take her back to Singapore, following reported sighting of \"oriental strangers\" around town.[*citation needed*] The house was also placed under surveillance. Slowly, Maria began to adjust to her new environment. A nun came to the house daily to teach her [Dutch](/wiki/Dutch_language) until she was proficient enough to attend a local convent school. She also began to attend [Mass](/wiki/Mass_(liturgy)) with her family. Back in Singapore, Aminah and Mansoor had apparently given up hope of retrieving Maria after leave to appeal to the [Judicial Committee of the Privy Council](/wiki/Judicial_Committee_of_the_Privy_Council) was not granted. Earlier interest of the several Muslim groups involved had also gradually died down. ## Second and third marriages On 20 April 1956, Maria married Johan Gerardus \"Joep\" Wolkenfelt, a 21-year-old Dutch [Catholic](/wiki/Catholic). On 15 February 1957, she gave birth to a son, the first of ten children. However, Maria did not seem to be contented. As she told *[De Telegraaf](/wiki/De_Telegraaf)*, she often had rows with Adeline, who lived nearby. She also said she still longed for her Malayan homeland. Johan and Mansoor began corresponding via letters. Both expressed a wish for Maria to travel to Malaya to visit the aged Aminah, but such a trip was never made due primarily to financial difficulties. Aminah died in 1976 and Mansoor would die of a heart attack in 1988. On 16 August 1976, Maria found herself on trial in a Dutch court charged with plotting to murder her husband. She admitted in court that she had been thinking about leaving her husband but was afraid to start divorce proceedings in case she lost custody of her children. She came into contact with two regular customers at her husband's café bar. The trio bought a [revolver](/wiki/Revolver) and recruited a fourth accomplice to carry out the actual murder. However, the last member got cold feet and gossiped about the murder plan. The police quickly learnt of it and arrested all four conspirators. At her trial, Maria was quoted as saying: \"I was a slave in my own home. I lived in a prison. I was not allowed to do anything. Joep [Johan] kicked up a row even if I went to drink a coffee somewhere.\" In her defence, Maria's lawyers brought up her background, which the court acknowledged. With this in mind, and because the plot was never executed and there was no proof that she offered any inducement to the other three, the three-man bench acquitted Maria. Meanwhile, Maria had also filed for divorce on the grounds of the irreparable breakdown of her marriage. Several days before Christmas 1979, Maria married, for the third time, one of her co-conspirators, Antonius Christianus \"Tom\" Ballermans. Their domestic life was happy at first; however, three years into the marriage, Ballermans' behaviour became troublesome and worrying. He'd started drinking in excess. Suspicious, Maria followed him to a cafeteria, where she discovered he was having an affair. They would divorce in 1983. ## Fourth marriage and moving to the US After her divorce from Ballermans, Maria moved to Zuidsingel, a neighbourhood not far from [Bergen op Zoom](/wiki/Bergen_op_Zoom). There, she reconnected with an old friend who offered her employment at her Indonesian food stall at a night market. In early 1984, she was admitted to hospital due to a stroke resulting from blocked arteries. After being kept for a week, she was discharged and returned to her job at the stall. It was at this stall that Maria met Benjamin Leopold Pichel, a naturalised Dutch citizen of Indonesian descent. Pichel was originally from [Jakarta, Indonesia](/wiki/Jakarta,_Indonesia) and a sailor by profession. That same year, they married and on 15 September 1984, emigrated to the United States, intent on opening an Indonesian restaurant there. They elected to settle in [Lake Tahoe, Nevada](/wiki/Lake_Tahoe,_Nevada). Lacking employment authorisation from the [Immigration and Naturalization Service](/wiki/Immigration_and_Naturalization_Service), Maria could only work ill-paid odd jobs such as a babysitter or a chambermaid. In March 1989, Malaysian journalist Fatini Yaacob, along with two of Maria's children, flew to Lake Tahoe to interview her for the *Dewan Masyarakat.* Yaacob informed her that the Terengganu State Government, under the leadership of Tan Sri [Wan Mokhtar Ahmad](/wiki/Wan_Mokhtar_Ahmad), had offered her a parcel of land in [Kemaman District](/wiki/Kemaman_District) if she wished to [return home](/wiki/Balik_Kampung) to Malaysia. Maria declined, citing her trauma from the riots and fearing her safety. However, on 29 January 1998, Maria did return to Kemaman for [Hari Raya](/wiki/Hari_Raya) (the local name for the Muslim Eid al-Fitr festival) and reunited with Kamariah, as well as paying her respects to Che Aminah's grave. It was their first meeting in 48 years; unfortunately, it would be the only time they were able to see each other again before Kamariah died of leukemia. Sometime between 2001 and 2003, Maria left Pichel and returned to the Netherlands, settling in [Huijbergen](/wiki/Huijbergen). The two officially divorced in 2004. ## Death On 8 July 2009, Maria died of leukemia at her house in Huijbergen at the age of 72. She donated her body to scientific research. In 2014, Singaporean channel [Channel NewsAsia](/wiki/Channel_NewsAsia), in cooperation with Monsoon Pictures, broadcast a five-part documentary about the tumultuous era of the 1950s and 1960s in [Singapore](/wiki/Singapore) called *Days of Rage*. In part, it featured the Maria Hertogh riots, including exclusive interviews with Maria herself and Kamariah prior to their deaths. Maria's son and two daughters spoke about witnessing their mother's frosty relationship with Adeline, and her struggle to come to terms with her painful childhood. Her son testified that she was not happy and felt betrayed. The siblings also paid a visit to Kemaman and met several elderly *kampung* residents who remembered the young Maria, then known to them as Nadra. In an interview sometime before her death, which was featured in *Days of Rage*, Maria had once said she despised her natal mother for forcibly separating her from her adoptive mother. Rokayah Yusof (Kamariah's daughter and therefore Maria's adoptive niece) stated that during the 1998 visit, Maria still spoke Malay fluently and that she'd missed all the traditional Malay snacks when she celebrated Hari Raya together with Kamariah, whom Che Aminah adopted in Tokyo where she lived with her lecturer husband before Aminah returned to Malaya. Rokayah, who was 68 years old when she spoke about the visit in 2015, added that Maria had visited the grave of Che Aminah during her visit and even after the death of Maria, Maria's children maintained contact with her and her own children. Additionally, Maria had also been evidently unhappy in her life in the Netherlands, \"a far cry from the kampong life she had enjoyed\". - [1964 race riots in Singapore](/wiki/1964_race_riots_in_Singapore) - [1969 race riots of Singapore](/wiki/1969_race_riots_of_Singapore) - [List of riots in Singapore](/wiki/List_of_riots_in_Singapore) ## Notes 1. **^** If and only if both conditions were met could the [Muslim law](/wiki/Muslim_law) practised in Singapore be applied to the case, which would render the marriage valid. 2. **^** Karim Ghani was arrested along with several members of the Nadra Action Committee and held at the detention camp on [Saint John's Island](/wiki/Saint_John%27s_Island) for 15 months under Emergency Regulation 20 for his part in the riots before being released on grounds of poor health. 3. **^** Family tree of Johannes Gerardus Wolkenfelt, Maria and their ten children. Library resources about **Maria Hertogh** - Resources in your library - Resources in other libraries - Tom Earnes Hughes (1980). *Tangled Worlds: The Story of Maria Hertogh*. Institute of Southeast Asian Studies. [ISBN](/wiki/ISBN_(identifier)) 978-9971-902-12-4. - Fatini Yaacob, magazine – Dewan Masyarakat published by Dewan Bahasa dan Pustaka, Malaysia – Februari-Mei, 1989 (the long interview with Maria Huberdina Hertogh @ Bertha @ Nadra was done in Lake Tahoe, Nevada United States of America, Mac 1989) - Haja Maideen (2000). *The Nadra Tragedy*. Pelanduk Publications. [ISBN](/wiki/ISBN_(identifier)) 978-967-978-287-5. - \"The Maria Hertogh Riots (11 Dec 1950)\". *Ministry of Education, NationalEducation*. Archived from the original on 25 October 2005. Retrieved 19 October 2005.*broken URL* - Syed Muhd Khairudin Aljunied, *Colonialism, Violence and Muslims in Southeast Asia: The Maria Hertogh Controversy and Its Aftermath*, London: Routledge, 2009. - \"Maria Hertogh Riots\". *National Library Board*. - Fatini Yaacob, book – \"Natrah: Cinta, Rusuhan dan Air Mata, Universiti Teknologi Malaysia\", year 2010, [ISBN](/wiki/ISBN_(identifier)) 978-983-52-0731-0/[ISBN](/wiki/ISBN_(identifier)) 978-983-52-0729-7 - Fatini Yaacob, book – \"In The Name of Love – Natrah\", Institut Terjemaha Buku Negara (now ITBM),2011, [ISBN](/wiki/ISBN_(identifier)) 978-983-068-606-6 - YouTube Story of a Nation – Maria Hertogh - YouTube Message from Maria Hertogh a.k.a. Nadra - Torn Between Two Worlds at \"Headlines, Lifelines\" website of the National Educational Multimedia kit for schools (c) Singapore Press Holdings. First published in *150 years of the Straits Times (15 July 1845–1995)*. - In Dutch language, an *Algemeen Nederlands Persbureau* photo archive *Flash* slideshow of select news photos of the events published in the Netherlands - Maria Hertogh, returned to Malaysia in 1999 aged 63, for a Dutch TV documentary *De Affaire* - Singapore Media Development Authority and Christopher Chew's Monsoon Pictures Pte Ltd are developing an English language film *\"The Jungle Girl\"* aka *\"Nadra\"* (period drama) with screenwriter Sarah Lambert, Lantern Pictures, Australia. - *Maria Hertogh* *Malayan Law Journal (MLJ)* 215; *MLJ* 164.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:29:24.647174",
  "title": "Maria Hertogh",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Maria_Hertogh"
}