{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:29:40.542553"
  },
  "content": "Reservoir in Singapore The **Marina Reservoir** is a [reservoir](/wiki/Reservoir) in [Singapore](/wiki/Singapore) formed in 2008 by building a dam across the mouth of the [Marina Channel](/wiki/Marina_Channel). With the completion of the [Marina Barrage](/wiki/Marina_Barrage) on 30 October 2008, the reservoir, which contained mainly salt water, became freshwater and started operations at 7 pm on 20 November 2010 after a process of natural desalination, when excess water was released out to the sea after heavy rains. The reservoir will provide 10% of the island's water needs. The catchment area that feeds the reservoir is about one-sixth the land size of Singapore, making it the largest of all the Singaporean reservoirs. Two of the island's most notable rivers - the [Singapore River](/wiki/Singapore_River) and [Kallang River](/wiki/Kallang_River) are part of the reservoir. The [Geylang River](/wiki/Geylang_River) and the [Rochor River](/wiki/Rochor_River), both tributaries of the Kallang River form part of this reservoir as well. The reservoir was a competition venue for the 2010 Youth Olympic Games, where the canoeing and rowing events were carried out. ## History With the recent completion of the Marina Barrage in 2008, the newly created Marina Reservoir is a choice venue for a wide range of water activities including hosting the canoe-kayak and rowing events. The area includes a one-kilometre straight race course for canoeing and rowing activities. The Singapore Canoe Marathon 2009 was staged at the Marina Reservoir in January 2009. The on-land staging of canoeing and rowing competitions is along a portion of Gardens by the Bay – a new 32-hectare park next to the Marina Reservoir. With an extensive water frontage along the Marina Reservoir, the Gardens will provide an excellent vantage point. The facilities at the reservoir during Singapore 2010 include a boat-storage shed for up to 200 boats, a boat-washing area, toilets and showers, and a doping-control station. A seating gallery for approximately 1,000 spectators will be constructed. - Marina Reservoir This [Singapore](/wiki/Singapore) location article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:29:40.542141",
  "title": "Marina Reservoir",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Marina_Reservoir"
}