{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:31:07.634937"
  },
  "content": "Ancient and medieval maritime trade route The **Maritime Silk Road** or **Maritime Silk Route** is the [maritime](/wiki/Maritime_history) section of the historic [Silk Road](/wiki/Silk_Road) that connected [Southeast Asia](/wiki/Southeast_Asia), [East Asia](/wiki/East_Asia), the [Indian subcontinent](/wiki/Indian_subcontinent), the [Arabian Peninsula](/wiki/Arabian_Peninsula), eastern [Africa](/wiki/Africa), and [Europe](/wiki/Europe). It began by the 2nd century BCE and flourished until the 15th century CE. The Maritime Silk Road was primarily established and operated by [Austronesian](/wiki/Austronesian_peoples) sailors in Southeast Asia who sailed large long-distance ocean-going [sewn-plank](/wiki/Sewn-plank) and [lashed-lug](/wiki/Lashed-lug_boat) [trade ships](/wiki/Austronesian_vessels).: 11 The route was also utilized by the [dhows](/wiki/Dhow) of the [Persian](/wiki/Persian_people) and [Arab](/wiki/Arab_people) traders in the [Arabian Sea](/wiki/Arabian_Sea) and beyond,: 13 and the [Tamil](/wiki/Tamils) merchants in [South Asia](/wiki/South_Asia).: 13 [China](/wiki/China) also started building their own trade ships (*[chuán](/wiki/Junk_(ship))*) and followed the routes in the later period, from the 10th to the 15th centuries CE. The network followed the footsteps of older Austronesian [jade maritime networks](/wiki/Lingling-o) in Southeast Asia, as well as the maritime [spice networks](/wiki/Spice_trade) between Southeast Asia and [South Asia](/wiki/South_Asia), and the [West Asian](/wiki/Indo-Roman_trade_relations) maritime networks in the [Arabian Sea](/wiki/Arabian_Sea) and beyond, coinciding with these ancient maritime trade roads by the current era. The term \"Maritime Silk Road\" is a modern name, acquired from its similarity to the overland [Silk Road](/wiki/Silk_Road). Overland Silk Road was itself a modern name, the idea of which was invented as late as 1877 by a Prussian geographer, Baron von Richthofen while he engaged in a geological survey of China for connecting China with Germany through railways, and the term \"Silk Road\" only entered the English language in 1938 with the publication of a popular book by Swedish explorer Sven Hedin. The ancient maritime routes through the [Indo-West Pacific](/wiki/Indo-West_Pacific) (Southeast Asia and the Indian Ocean) had no particular name for the majority of its very long history. Despite the modern name, the Maritime Silk Road involved exchanges in a wide variety of goods over a very wide region, not just silk or Asian exports. ## History ### Precursor prehistoric maritime networks The Maritime Silk Road developed from the earlier [Neolithic](/wiki/Neolithic) [lingling-o](/wiki/Lingling-o) [jade](/wiki/Jade) [maritime trade networks](/wiki/Austronesian_maritime_trade_network) established by [Austronesians](/wiki/Austronesians) in [Southeast Asia](/wiki/Southeast_Asia). This extensive ancient maritime trade network in Southeast Asia, covering a 3000-kilometer area around the [South China Sea](/wiki/South_China_Sea), existed long before the Maritime Silk Road. It lasted for around 3,000 years, partially overlapping with the Maritime Silk Road, from 2000 BCE to 1000 CE. It was initially established by the indigenous peoples of [Taiwan](/wiki/Taiwanese_Aborigines) and the northern [Philippines](/wiki/Philippines). Raw [nephrite](/wiki/Nephrite) jade (Fengtian jade) was sourced from deposits in eastern Taiwan and worked into ornaments and tools in the Philippines (the most notable and most numerous of are double-headed pendants and penannular earrings known as [lingling-o](/wiki/Lingling-o)). This network later included southern [Vietnam](/wiki/Vietnam) (the [Sa Huỳnh culture](/wiki/Sa_Hu%E1%BB%B3nh_culture)), [Borneo](/wiki/Borneo), eastern [peninsular Malaysia](/wiki/Peninsular_Malaysia), eastern [Cambodia](/wiki/Cambodia), peninsular [Thailand](/wiki/Thailand), and other areas in Southeast Asia where these jade ornaments, along with other trade goods, were manufactured and exchanged (also known as the [Sa Huynh](/wiki/Sa_Hu%E1%BB%B3nh_culture)-[Kalanay](/wiki/Kalanay_Cave) Interaction Sphere). Taiwan-sourced jade declined in use after around 500 BCE, and non-Taiwanese jade and other materials became more common. The distribution of these jade artifacts were also accompanied by other evidence of maritime trade and shared material culture particularly between the Austronesians of the Neolithic Philippines, southern Vietnam, and Borneo. The wide distribution throughout [Island Southeast Asia](/wiki/Island_Southeast_Asia) of the ceremonial [bronze drums](/wiki/Dong_Son_drums) (c. 600 BCE to 400 CE) sourced from the [Dong Son culture](/wiki/Dong_Son_culture) of northern Vietnam is also evidence of the antiquity and density of this prehistoric Southeast Asian maritime network. During the operation of the maritime trade in jade artifacts, the Austronesian [spice trade](/wiki/Spice_trade) networks were also established by [Islander Southeast Asians](/wiki/Islander_Southeast_Asians) with [Sri Lanka](/wiki/Sri_Lanka) and [Southern India](/wiki/Southern_India) by around 1500 to 600 BCE. These early contacts resulted in the introduction of Austronesian crops and material culture to South Asia, including [betel nut chewing](/wiki/Betel_nut_chewing), [coconuts](/wiki/Coconuts), [sandalwood](/wiki/Sandalwood), domesticated [bananas](/wiki/Banana), [sugarcane](/wiki/Sugarcane), [cloves](/wiki/Clove), and [nutmeg](/wiki/Nutmeg). It also introduced Austronesian sailing technologies like [outrigger boats](/wiki/Outrigger_boat) which are still utilized in Sri Lanka and southern India. Semi-precious stone and glass ornaments showing northern [Indian](/wiki/India) designs have also been recovered from the [Khao Sam Kaeo](/wiki/Khao_Sam_Kaeo) (c. 400-100 BCE) and [Ban Don Ta Phet](/wiki/Prehistoric_Thailand) (c. 24 BCE to 276 CE) archaeological sites in [Thailand](/wiki/Thailand), along with trade goods from the Austronesian Sa Huynh-Kalanay Interaction Sphere. Both sites are coastal settlements and part of the jade trade network, indicating that the maritime routes of Austronesians had already reached [South Asia](/wiki/South_Asia) by this period. South Asian crops like the [mung bean](/wiki/Mung_bean) and [horsegram](/wiki/Horsegram) were also present in Khao Sam Kaeo, indicating the exchange was reciprocal. There is also indirect evidence of very early Austronesian contacts with [Africa](/wiki/Africa), based on the presence and spread of Austronesian domesticates like bananas, [taro](/wiki/Taro), [chickens](/wiki/Chicken), and [purple yam](/wiki/Purple_yam) in Africa in the first millennium BCE. The western circuit of the Maritime Silk Road also developed from earlier [maritime trade routes](/wiki/Indo-Roman_trade_relations) in West Asia. These linked [Sri Lanka](/wiki/Sri_Lanka), the [Malabar Coast](/wiki/Malabar_Coast) of [India](/wiki/India), [Persia](/wiki/Persia), [Mesopotamia](/wiki/Mesopotamia), [Arabia](/wiki/Arabia), [Egypt](/wiki/Egypt), the [Horn of Africa](/wiki/Horn_of_Africa), and the [Greco-Roman](/wiki/Greco-Roman) civilizations in the [Mediterranean](/wiki/Mediterranean). These trade routes (initially only near-coastal, short-range, and small-scale) has existed since the [Neolithic](/wiki/Neolithic), from at least the [Ubaid period](/wiki/Ubaid_period) (c. 5000 BCE) of [Mesopotamia](/wiki/Mesopotamia). They became regular trade routes between urban centers in West Asia by the first millennium BCE. ### Maritime Silk Road By around the 2nd century BCE, the prehistoric Austronesian jade and spice trade networks in Southeast Asia fully connected with the [maritime trade routes](/wiki/Indo-Roman_trade_relations) of [South Asia](/wiki/South_Asia), the [Middle East](/wiki/Middle_East), eastern [Africa](/wiki/Africa), and the [Mediterranean](/wiki/Mediterranean), becoming what is now known as the Maritime Silk Road. Prior to the 10th century, the eastern part of the route was primarily used by Southeast Asian Austronesian traders using distinctive [sewn-plank](/wiki/Sewn-plank) and [lashed-lug](/wiki/Lashed_lug_boat) ships, although [Persian](/wiki/Persian_people) and [Tamil](/wiki/Tamil_people) traders also sailed the western parts of the routes. It allowed the exchange of goods from [East](/wiki/East_Asia) and Southeast Asia on one end, all the way to [Europe](/wiki/Europe) and eastern Africa on the other. Austronesian [thalassocracies](/wiki/Thalassocracies) controlled the flow of trade in the eastern regions of the Maritime Silk Road, especially the [polities](/wiki/Polities) around the [straits](/wiki/Straits) of [Malacca](/wiki/Malacca_Strait) and [Bangka](/wiki/Bangka_Strait), the [Malay Peninsula](/wiki/Malay_Peninsula), and the [Mekong Delta](/wiki/Mekong_Delta); through which passed the main routes of the Austronesian trade ships to [Giao Chỉ](/wiki/Jiaozhi) (in the [Tonkin Gulf](/wiki/Tonkin_Gulf)) and [Guangzhou](/wiki/Guangzhou) (southern [China](/wiki/China)), the endpoints (later also including [Quanzhou](/wiki/Quanzhou) by the 10th century CE). Chinese records misidentified these kingdoms as being \"Indian\" due to the [Indianization](/wiki/Greater_India) of these regions. Secondary routes also passed through the coastlines of the [Gulf of Thailand](/wiki/Gulf_of_Thailand); as well as through the [Java Sea](/wiki/Java_Sea), [Celebes Sea](/wiki/Celebes_Sea), [Banda Sea](/wiki/Banda_Sea), and the [Sulu Sea](/wiki/Sulu_Sea), reconnecting with the main route through the northern Philippines and Taiwan. The secondary routes also continue onward to the [East China Sea](/wiki/East_China_Sea) and the [Yellow Sea](/wiki/Yellow_Sea) for a limited extent. Glass artifacts from [India](/wiki/India) and [Egypt](/wiki/Egypt) that passed through glassworkers in Southeast Asian and South Asian ports have been recovered from graves in the [Korean peninsula](/wiki/Korean_peninsula) (c. 2nd-6th centuries CE), showing the furthest northeastern extent of the Maritime Silk Road. The main route of the western regions of the Maritime Silk Road directly crosses the [Indian Ocean](/wiki/Indian_Ocean) from the northern tip of [Sumatra](/wiki/Sumatra) (or through the [Sunda Strait](/wiki/Sunda_Strait)) to [Sri Lanka](/wiki/Sri_Lanka), southern [India](/wiki/India) and [Bangladesh](/wiki/Bangladesh), and the [Maldives](/wiki/Maldives). It branches from here into routes through the [Arabian Sea](/wiki/Arabian_Sea) entering the [Gulf of Oman](/wiki/Gulf_of_Oman) (into the [Persian Gulf](/wiki/Persian_Gulf)), and the [Gulf of Aden](/wiki/Gulf_of_Aden) (into the [Red Sea](/wiki/Red_Sea)). Secondary routes also pass through the coastlines of the [Bay of Bengal](/wiki/Bay_of_Bengal), the Arabian Sea, and southwards along the coast of [East Africa](/wiki/East_Africa) to [Zanzibar](/wiki/Zanzibar), the [Comoros](/wiki/Comoros_Islands), [Madagascar](/wiki/Madagascar), and the [Seychelles](/wiki/Seychelles). The Maldives was of particular importance as a major hub for Austronesian sailors venturing through the western routes. The route was influential in the early spread of [Hinduism](/wiki/Hinduism) and [Buddhism](/wiki/Buddhism) to the east. The close links of these religions to trade with South Asia led to the widespread adoption of [Sanskrit](/wiki/Sanskrit) as the trade [lingua franca](/wiki/Lingua_franca) in the early Maritime Silk Road by the 4th century CE. [Han](/wiki/Han_dynasty) and [Tang](/wiki/Tang_dynasty) dynasty Chinese records also indicate that the early Chinese Buddhist [pilgrims](/wiki/Pilgrim) to South Asia booked passage with the Austronesian ships (which they called the *[k'un-lun po](/wiki/K%27un-lun_po)*) that traded in the Chinese port city of [Guangzhou](/wiki/Guangzhou). Books written by Chinese monks like Wan Chen and Hui-Lin contain detailed accounts of the large trading vessels from Southeast Asia dating back to at least the 3rd century CE. Austronesians were already sailing as far as [East Africa](/wiki/East_Africa) and the [Arabian Peninsula](/wiki/Arabian_Peninsula) even during the earlier period. Austronesians colonized the island of [Madagascar](/wiki/Madagascar) off the coast of Africa some time in between the 1st century CE to the 6th or 7th centuries CE. It remained a part of the Maritime Silk Road, along with the nearby African, Arab, and Persian trading ports of [Kilwa Kisiwani](/wiki/Kilwa_Kisiwani) and [Zanzibar](/wiki/History_of_Zanzibar) ([Tanzania](/wiki/Tanzania)), and other ports along the mainland coasts of modern [Somalia](/wiki/Somalia), [Kenya](/wiki/Kenya), and [Mozambique](/wiki/Mozambique). Records from Portuguese explorers in the late 15th and early 16th centuries indicate that direct maritime links between Indonesia and Madagascar persisted up until shortly before the colonial period. [Srivijaya](/wiki/Srivijaya), a [Hindu](/wiki/Hindu)-[Buddhist](/wiki/Buddhist) Austronesian polity founded at [Palembang](/wiki/Palembang) in 682 CE, rose to dominate the trade in the region around the straits of [Malacca](/wiki/Strait_of_Malacca) and [Sunda](/wiki/Sunda_Strait) and the South China Sea [emporium](/wiki/Emporium_(antiquity)) by controlling the trade in luxury aromatics and Buddhist artifacts from West Asia to a thriving Tang market.: 12 It emerged through the conquest and subjugation of neighboring thalassocracies. These included [Melayu](/wiki/Melayu_Kingdom), [Kedah](/wiki/Kedah), [Tarumanagara](/wiki/Tarumanagara), and [Mataram](/wiki/Mataram_Kingdom), among others. These polities controlled the sea lanes in Southeast Asia and exploited the spice trade of the [Spice Islands](/wiki/Maluku_islands), as well as maritime trade-routes between [India](/wiki/India) and [China](/wiki/China). By the 7th century CE, [Arab](/wiki/Arab_people) [dhow](/wiki/Dhow) traders also ventured into the routes earlier pioneered by Persian traders to [Sri Lanka](/wiki/Sri_Lanka), coinciding with the [spread of Islam](/wiki/Spread_of_Islam) throughout [West Asia](/wiki/West_Asia). They pushed deeper east into [Srivijaya](/wiki/Srivijaya) and [Guangzhou](/wiki/Guangzhou), leading to the earliest spread of [Islam](/wiki/Islam) into Southeast Asian polities. During this period, the [Persian language](/wiki/Persian_language) (*Fārsī*), became the dominant lingua franca of both the Maritime and overland [Silk Road](/wiki/Silk_Road). The [Butuan boat burials](/wiki/Balangay) of the [Philippines](/wiki/Philippines), which feature eleven [lashed-lug boat](/wiki/Lashed-lug_boat) remains of the [Austronesian boatbuilding traditions](/wiki/Austronesian_vessels) (individually dated from 689 CE to 988 CE), were found in association with large amounts of trade goods from [China](/wiki/China), [Cambodia](/wiki/Cambodia), [Thailand](/wiki/Thailand) ([Haripunjaya](/wiki/Haripunjaya) and [Satingpra](/wiki/Sathing_Phra_district)), [Vietnam](/wiki/Vietnam), and as far as [Persia](/wiki/Persia), indicating they traded as far as the [Middle East](/wiki/Middle_East). By the 10th to 13th centuries, there was an economic boom in maritime trade, led primarily by the fact that the [Song dynasty](/wiki/Song_dynasty) of China started building its own trading ships (*[chuán](/wiki/Junk_(ship))*) capable of sailing sea routes. The Song court also loosened restrictions on private trade, despite the traditional Chinese [Confucian](/wiki/Confucian) disdain for trade. This was partly due to the loss of access by the Song dynasty to the overland [Silk Road](/wiki/Silk_Road). [Song maritime technology](/wiki/Junk_ship#Etymology_and_history_of_the_term) was developed from observing Southeast Asian [Austronesian ships](/wiki/Austronesian_vessels). Before this, Chinese ships were essentially fluvial (riverine) in nature and operation and were not seaworthy. The Song started sending trading expeditions to the region they referred to as *Nan hai* ([Chinese](/wiki/Chinese_language): 南海; [pinyin](/wiki/Pinyin): *Nánhǎi*; lit. 'South Seas'), mostly still dominated by [Srivijaya](/wiki/Srivijaya), venturing as far south as the [Sulu Sea](/wiki/Sulu_Sea) and the [Java Sea](/wiki/Java_Sea). This led to the establishment of new trading ports in Southeast Asia (like in [Java](/wiki/Java) and [Sumatra](/wiki/Sumatra)) that specifically catered to the Chinese demand for goods like \"dragon's brain perfume\" ([camphor](/wiki/Camphor)) and other exotica. [Quanzhou](/wiki/Quanzhou) also became a major Chinese trading port during this period, joining the older trading port of [Guangzhou](/wiki/Guangzhou). Both became tightly linked to their Southeast Asian counterparts, leading historians to characterize the distinct trading circuit in this region as the \"Asian Mediterranean\", from its similarity to the [Mediterranean Sea Trade](/wiki/History_of_the_Mediterranean_region). However, the Song enacted a 9-month limit on how long trade ships can stay at sea, limiting the range of Chinese trade ships to Southeast Asia. Arab and Tamil traders also increased their participation with direct trade to Chinese ports through the [Strait of Malacca](/wiki/Strait_of_Malacca) in the 10th to 13th centuries. The surprise [naval expeditions](/wiki/Chola_invasion_of_Srivijaya) in 1025 of [Rajendra I](/wiki/Rajendra_I) of the Tamil [Chola Empire](/wiki/Chola_Empire) against [Srivijaya](/wiki/Srivijaya)'s ports along the strait, may have been motivated by Srivijaya's attempt to regulate or block Tamil trading guilds. The Chola invasions ended Srivijaya's monopoly on the Strait of Malacca routes for around a century, during which many of the Srivijayan cities were occupied by the Chola. Srivijaya was left greatly weakened and was eventually subjugated by [Singhasari](/wiki/Singhasari) by around 1275, before finally being absorbed by the successor thalassocracy of [Majapahit](/wiki/Majapahit) (1293–1527). China was invaded by the [Mongol](/wiki/Mongol_Empire) [Yuan dynasty](/wiki/Yuan_dynasty) in the 13th century. Chinese shipping during this period was monopolized by the state, via foreign Muslim merchants partnered with the Yuan government in *[ortogh](/wiki/Ortogh)* relationships. Though unlike the Song, the Yuan lifted the 9-month limit, allowing Chinese trade to venture as far as South Asia. The Yuan also attempted naval invasions on [Japan](/wiki/Mongol_invasions_of_Japan), [Majapahit](/wiki/Mongol_invasion_of_Java), and [Vietnam](/wiki/Mongol_invasions_of_Vietnam) (Austronesian [Champa](/wiki/Champa), and [Kinh](/wiki/Vietnamese_people) [Đại Việt](/wiki/%C4%90%E1%BA%A1i_Vi%E1%BB%87t)). All of which failed. China itself was later devastated by floods, drought, and famine. Concurrently, the [Black Death](/wiki/Black_Death) was sweeping through Europe and Western Asia. All of these factors led to a slump in trade along the Maritime Silk Road in the 14th century. In the late 14th century, the city-state of [Palembang](/wiki/Palembang) (the former capital of Srivijaya, which has since [Islamized](/wiki/Spread_of_Islam_in_Indonesia)) sent an envoy to the [Hongwu Emperor](/wiki/Hongwu_Emperor), the first emperor of the [Ming dynasty](/wiki/Ming_dynasty) (which overthrew the Yuan), to reestablish trade routes. The ruler of Palembang was hoping to regain the city's former wealth, independent of the Hindu-Buddhist Majapahit. [Hayam Wuruk](/wiki/Hayam_Wuruk) of Majapahit, angry at the actions of the vassal state, sent a punitive naval attack on Palembang in 1377, causing a diaspora of princes and nobles to the [Kingdom of Singapura](/wiki/Kingdom_of_Singapura). Singapura, in turn, was attacked and sacked in 1398. [Parameswara](/wiki/Parameswara_of_Malacca), originally from Palembang and the last ruler of Singapura, fled to the western coast of the [Malay Peninsula](/wiki/Malay_Peninsula) and founded the Muslim [Sultanate of Malacca](/wiki/Sultanate_of_Malacca) in the early 15th century. During the same period in the early 15th century, the Ming dynasty launched [the expeditions](/wiki/Ming_treasure_voyages) of [Zheng He](/wiki/Zheng_He), with the goal of forcing the \"barbarian kings\" of Southeast Asia to resume sending \"tribute\" (i.e. regular trade routes) to the Ming court. This was typical of the [Sinocentric](/wiki/Sinocentric) views at the time of viewing \"[trade as tribute](/wiki/Tributary_system_of_China)\". Zheng He's expeditions were short-lived, as the drain in imperial funds and the threat of invasion from the north led the [Xuande Emperor](/wiki/Xuande_Emperor) to cease the expeditions. He enacted the *hai jin* laws shortly after, and banned outgoing trade altogether. Although ultimately, Zheng He's expeditions were successful in their goal of restoring trade relations with Southeast Asia (in this case, [Malacca](/wiki/Sultanate_of_Malacca)) and the Ming dynasty. By the mid-15th century, the Sultanate of Malacca had gained effective control of the Strait of Malacca. Further weakening Majapahit's influence greatly, which was already suffering from internal rebellions. Trade from Malacca continued to arrive in Chinese ports in the brief period prior to the fall of Majapahit, the [Portuguese](/wiki/Portuguese_Empire) invasion of [Malacca](/wiki/Malacca_Sultanate), and the fall of the Ming dynasty to the [Manchu invasions](/wiki/Transition_from_Ming_to_Qing). ### Decline The Maritime Silk Route was disrupted by the [colonial era](/wiki/Western_imperialism_in_Asia) in the 15th century, essentially being replaced with European trade routes. Shipbuilding of the formerly dominant Southeast Asian trading ships (*[jong](/wiki/Djong)*, the source of the English term \"junk\") declined until it ceased entirely by the 17th century. Although Chinese-built *[chuán](/wiki/Junk_(ship))* survived until modern times. There was new demand for spices from Southeast Asia and textiles from India and China, but these were now linked with direct trade routes to the European market, instead of passing through regional ports. By the 16th century, the [Age of Exploration](/wiki/Age_of_Exploration) had begun. The [Portuguese Empire](/wiki/Portuguese_Empire)'s capture of [Malacca](/wiki/Malacca_City) led to the transfer of the trade centers to the [sultanates](/wiki/Sultanates) of [Aceh](/wiki/Sultanate_of_Aceh) and [Johor](/wiki/Sultanate_of_Johor). The [Spanish Empire](/wiki/Spanish_Empire) in the [Philippines](/wiki/Captaincy_General_of_the_Philippines) established the [Manila-Acapulco Galleon Trade](/wiki/Manila_galleon), which acquired trade goods like [Chinaware](/wiki/Chinese_ceramics) and silk from Quanzhou and Zhangzhou, and spices (mostly from the [Spice Islands of Moluccas](/wiki/Maluku_Islands)) for the markets in Latin America and Europe. All of which were traded over the [Pacific](/wiki/Pacific_Ocean) to [Acapulco](/wiki/Acapulco) in [Mexico](/wiki/New_Spain) and throughout the Spanish Americas; and also later traded via the *Flota de Indias* ([Spanish treasure fleet](/wiki/Spanish_treasure_fleet)) from [Veracruz](/wiki/Veracruz_(city)) in Mexico to [Seville](/wiki/Seville) in Spain and onward throughout Europe. The Manila-Acapulco Galleon Trade route was the first permanent trade route across the Pacific. Similarly, the [West Indies](/wiki/West_Indies) Spanish treasure fleet was the first permanent transatlantic trade route in history. Both bypassed the [Indian Ocean](/wiki/Indian_Ocean) Maritime Silk Road entirely. ## Archaeology The archaeological evidence of the Maritime Silk Road include numerous shipwrecks recovered along the route carrying (or associated with) trade goods sourced from various far-flung ports. The origins of these early ships are readily identifiable by a combination of distinctive features and shipbuilding techniques used (such as [lashed-lug](/wiki/Lashed-lug_boat) and [sewn boat](/wiki/Sewn_boat) traditions). These include the [Pontian boat](/wiki/Pontian_boat) (c. 260–430 CE), the Punjulharjo boat (c. 660-780 CE), the [Butuan ship burials](/wiki/Balangay) (multiple boats ranging from c. 689 to 988 CE), the Chau Tan shipwreck (c. late 8th to early 9th century CE), the Intan wreck (c. early to mid-10th century CE), the Karawang shipwreck (c. 10th century CE), and the [Cirebon wreck](/wiki/Cirebon_shipwreck) (c. late 10th century CE), among others.: 12 Almost all of the ships recovered from Southeast Asia before the 10th century belong to the [Austronesian shipbuilding traditions](/wiki/Austronesian_vessels), displaying variations and combinations of sewn-plank and lashed-lug techniques. Another early partial shipwreck, the Pak Klong Kluay shipwreck (c. 2nd century CE), uniquely joined planks using pegged [mortise and tenon](/wiki/Mortise_and_tenon) joints. Though this is similar to [Phoenician](/wiki/Phoenicia) and later [Greco-Roman](/wiki/Greco-Roman) shipbuilding techniques, the ship is also Austronesian, with timber sourced locally from Southeast Asian trees and evidence of lashed-lug techniques on the inner surface. Some authors have pointed to this as evidence that the Phoenician mortise and tenon shipbuilding techniques originally developed outside of the Mediterranean. Only two shipwrecks recovered from Southeast Asia prior to the 10th century CE are not Austronesian and exhibit early Arab [dhow](/wiki/Dhow) shipbuilding techniques: the Phanom-Surin ship (c. 7th century CE) and the [Belitung shipwreck](/wiki/Belitung_shipwreck) (c. 826 CE), Dhows similarly use sewn-plank techniques, but differ from Austronesian sewn-plank techniques in which the stitches are only visible from the inner surfaces and are discontinuous. They also did not originally use lashed-lug techniques, though later ships like the Belitung shipwreck adopted it from contact with Austronesian shipbuilders. Some of the timber used on the major components of the Phanom-Surin ship is also sourced from Southeast Asian trees, despite its West Asian construction. Similarly, some of the later Austronesian ships display elements of West Asian shipbuilding techniques (like cross-armed [anchors](/wiki/Anchor)) suggesting that the merchants and crew of the ships had multinational origins, regardless of where the ships were originally built. China did not start building sea-going ships that ventured into the Maritime Silk Road until the [Song dynasty](/wiki/Song_dynasty) (c. 10th century CE). The earliest known Chinese shipwrecks found along the Maritime Silk Road are the [Ming](/wiki/Ming_dynasty)-era Turiang wreck (c. 1305-1370 CE) and the Bakau wreck (c. early 15th century CE). Chinese-built ships (*chuán*) are also readily identifiable by being built with iron nails and clamps, in contrast to Austronesian and Western Asian ships which were built entirely with wood joining and fiber lashings. Other distinctive features of Chinese ships which developed from their earlier fluvial (riverine) ship technologies include a flat-bottomed design (the [keel](/wiki/Keel) was absent), a central [rudder](/wiki/Rudder) (instead of two side-mounted quarter rudders), and the division of the hull into water-tight compartments. By around the end of the Maritime Silk Road in the 14th and 15th century, ships that combined features of both Chinese and Austronesian boatbuilding traditions also start to appear, even reaching as far as India. Indian ships are similarly absent in the archaeological context in the eastern routes of the Maritime Silk Road prior to the 10th century CE.: 10 The [Godavaya shipwreck](/wiki/Godavaya#Shipwreck) (c. 2nd century CE) is the earliest evidence of maritime networking in the [Indian Ocean](/wiki/Indian_Ocean), but it only involved local exchanges in raw materials along the [South Indian](/wiki/South_India) coast. The archaeological evidence demonstrates that the trading ships in the [South China Sea](/wiki/South_China_Sea) and the [Indian Ocean](/wiki/Indian_Ocean) were Austronesian [sewn-plank](/wiki/Sewn-plank) and [lashed-lug](/wiki/Lashed-lug) vessels and Arab [dhows](/wiki/Dhow) prior to the 10th century CE. Austronesian vessels dominated the long-distance maritime trade for much of the history of the Maritime Silk Road.: 10 [Chinese ceramics](/wiki/Chinese_ceramics) are also valuable archaeological markers of the Maritime Silk Road due to their relative indestructibility and the fact that they can be precisely dated. They first entered Southeast Asia via the ancient Austronesian maritime networks in the 2nd century BCE but were not initially a major export of China. They became exported by the [Tang dynasty](/wiki/Tang_dynasty) (618-907 CE), rapidly increased in volume during the [Song](/wiki/Song_dynasty) (960-1279 CE) and [Yuan](/wiki/Yuan_dynasty) dynasties (1279-1367 CE), before declining in the [Ming Dynasty](/wiki/Ming_Dynasty) (1368-1643 CE), and ceasing entirely in the 15th century. Their distribution throughout the Southeast Asian trade network is uneven, reflecting differences in local demand, buying power, and trade specialization. The largest concentrations of Chinese ceramics are found along the [Strait of Melaka](/wiki/Strait_of_Melaka) and [Java](/wiki/Java), with other significant concentrations in [Sulawesi](/wiki/Sulawesi), [Borneo](/wiki/Borneo), the [Riau Archipelago](/wiki/Riau_Archipelago), and the [Philippines](/wiki/Philippines). ## Extent Although usually spoken of in modern times in the context of the [Eurocentric](/wiki/Eurocentric) and [Sinocentric](/wiki/Sinocentric) [demand for luxury goods and exotica](/wiki/Sino-Roman_relations) by the [Roman](/wiki/Roman_Empire) and [Chinese](/wiki/History_of_China) empires (hence the fixation on [silk](/wiki/Silk) in its name), the goods carried by the trading ships varied by which product was in demand by region and port. They included ceramics, glass, beads, gems, ivory, fragrant wood, metals (both raw and finished goods), textiles (including silk), food (including grain, wine, and spices), aromatics, and animals, among others. [Ivory](/wiki/Ivory), in particular, was a significant export of east Africa (originating from overland trade routes through the African interior), leading Chirikure (2022) to label the western leg of the trade route as the \"**Maritime Ivory Route**\". It was also not small-scale trade or high value-low volume trade as some earlier historians had assumed. The goods carried by recovered shipwrecks show that they engaged in [merchant capitalism](/wiki/Merchant_capitalism). A very large number of goods, often mass-produced, were traded along the route. The trade route encompassed numbers of seas and ocean; including [South China Sea](/wiki/South_China_Sea), [Strait of Malacca](/wiki/Strait_of_Malacca), [Indian Ocean](/wiki/Indian_Ocean), [Gulf of Bengal](/wiki/Gulf_of_Bengal), [Arabian Sea](/wiki/Arabian_Sea), [Persian Gulf](/wiki/Persian_Gulf) and the [Red Sea](/wiki/Red_Sea). The maritime route overlaps with historic Southeast Asian maritime trade, spice trade, [Indian Ocean trade](/wiki/Indian_Ocean_trade) and after 8th century—the Arabian naval trade network. The network also extend eastward to the [East China Sea](/wiki/East_China_Sea) and the [Yellow Sea](/wiki/Yellow_Sea) to connect China with the [Korean Peninsula](/wiki/Korean_Peninsula) and the [Japanese archipelago](/wiki/Japanese_archipelago). The Maritime Silk Road differed significantly in several aspects from the overland [Silk Road](/wiki/Silk_Road), from where it acquired its name, and thus should not be viewed as a mere extension of it. Traders traveling through the Maritime Silk Road could span the entire distance of the maritime routes, instead of through regional relays as with the overland route. Ships could carry far larger amounts of goods, creating greater economic impact with each exchange. Goods carried by the ships also differed from goods carried by caravans. Traders on the maritime route faced different perils like weather and [piracy](/wiki/Piracy), but they were not affected by political instability and could simply avoid areas in conflict. ## World Heritage nomination In May 2017, experts from various fields held a meeting in London to discuss the proposal to nominate \"Maritime Silk Route\" as a new [UNESCO World Heritage Site](/wiki/UNESCO_World_Heritage_Site). ## Politicization The academic research on the ancient Maritime Silk Road has been appropriated and mythologized by modern countries for political reasons. [China](/wiki/China), in particular, uses a mythologized image of the Maritime Silk Road for its [Belt and Road Initiative](/wiki/Belt_and_Road_Initiative), first proposed by [General Secretary of the Chinese Communist Party](/wiki/General_Secretary_of_the_Chinese_Communist_Party) [Xi Jinping](/wiki/Xi_Jinping) during a [visit](/wiki/List_of_international_trips_made_by_Xi_Jinping) to [Indonesia](/wiki/Indonesia) in 2015. It attempts to reconnect the old trade routes between the port cities of Southeast Asia and the Indian Ocean, and assumes erroneously that Chinese sailors played a major role in developing the route. [India](/wiki/India) has also mythologized the Maritime Silk Road with [Project Mausam](/wiki/Project_Mausam), launched in 2014, which similarly attempts to reconnect old trade links with surrounding countries in the Indian Ocean. India also portrays itself as playing a central role in the Maritime Silk Road, and early Indian nationalist historians like [R. C. Majumdar](/wiki/R._C._Majumdar) often depicted its trade connections and the overwhelmingly one way cultural diffusion (\"overwhelmingly one way\" according to leading historian [William Dalrymple](/wiki/William_Dalrymple), and the overall process is generally accepted as \"[Indianisation](/wiki/Indianisation).\") as \"Indian colonization\" under the vision of a [Greater India](/wiki/Greater_India). The old theories about \"colonization\" has been replaced by an understanding of complexities in South and South-east Asian interactions. The process occurred through the movement of priests, artisans, merchants, and scholars, along with the initiatives of local people. Even though the cross-cultural exchange might be asymmetrical, historians have tried to identify the westward movement of ideas from South-east Asia to India through the route, such as musical instruments, ceramic and ship building techniques. - Oceans portal - [Ancient maritime history](/wiki/Ancient_maritime_history) - [Belitung shipwreck](/wiki/Belitung_shipwreck) - [Cirebon shipwreck](/wiki/Cirebon_shipwreck) - [Indian Ocean trade](/wiki/Indian_Ocean_trade) - [Indo-Mediterranean](/wiki/Indo-Mediterranean) - *[Periplus of the Erythraean Sea](/wiki/Periplus_of_the_Erythraean_Sea)* - [List of ports and harbours of the Indian Ocean](/wiki/List_of_ports_and_harbours_of_the_Indian_Ocean) - [Maritime Silk Route Museum](/wiki/Maritime_Silk_Route_Museum), Guangdong Province, China - [Tapayan](/wiki/Tapayan) - [Spice trade](/wiki/Spice_trade) - [Indian Ocean slave trade](/wiki/Indian_Ocean_slave_trade) - [String of Pearls (Indian Ocean)](/wiki/String_of_Pearls_(Indian_Ocean)) - [21st Century Maritime Silk Road](/wiki/21st_Century_Maritime_Silk_Road)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:31:07.634153",
  "title": "Maritime Silk Road",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Maritime_Silk_Road"
}