{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:29:30.850747"
  },
  "content": "Integrated resort in Singapore **Marina Bay Sands** (often colloquially shortened to 'MBS') is an [integrated resort](/wiki/Integrated_resort) fronting [Marina Bay](/wiki/Marina_Bay,_Singapore) in [Singapore](/wiki/Singapore) and a landmark of the city. At its opening in 2010, it was deemed the world's most expensive standalone [casino](/wiki/Casino) property at [S$](/wiki/Singapore_dollar)8 billion (US$6.88 billion). The resort includes a 1,850-room hotel, a 120,000-square-metre (1,300,000 sq ft) meetings and conventions facility at Sands Expo & Convention Centre, a 74,000-square-metre (800,000 sq ft) luxury shopping mall, The Shoppes at Marina Bay Sands, an ArtScience museum, a 2,183-capacity theatre, the world's first floating [Apple store](/wiki/Apple_store), the world's first [Louis Vuitton](/wiki/Louis_Vuitton) Island Maison, celebrity chef and signature restaurants, and a casino with 500 tables and 3,000 electronic gaming machines. The complex includes three towers topped by the Sands Skypark, a 340-metre-long (1,120 ft) [skyway](/wiki/Skyway) connecting the towers with a capacity of 3,902 people and a 150 m (490 ft) [infinity swimming pool](/wiki/Infinity_pool), set on top of the world's largest public [cantilevered](/wiki/Cantilever) platform, which overhangs the north tower by 66.5 m (218 ft). The 20-hectare resort was designed by [Moshe Safdie](/wiki/Moshe_Safdie). The resort is owned by [Las Vegas Sands](/wiki/Las_Vegas_Sands) in agreement with the Singaporean authorities. Marina Bay Sands was originally set to open in 2009, but its construction faced delays caused by escalating costs of material and labour shortages from the outset exacerbated by the [2008 financial crisis](/wiki/2008_financial_crisis). This pressured Las Vegas Sands to delay its projects elsewhere to complete the integrated resort. Its owner decided to open the integrated resort in stages, and it was approved by the Singapore authorities. The resort and SkyPark were officially opened on 23 and 24 June 2010 as part of a two-day celebration, following the casino's [opening](/wiki/Soft_opening) on 27 April that year. The SkyPark opened the following day. The theatre was completed in time for the first performance of *[Riverdance](/wiki/Riverdance)* on 30 November. The indoor skating rink, which uses [artificial ice](/wiki/Artificial_ice), opened to a performance by [Michelle Kwan](/wiki/Michelle_Kwan) on 18 December. The ArtScience Museum opened to the public and the debut of a 13-minute light, laser and water show called Wonder Full on 19 February 2011, marked the full completion of the integrated resort. The opening of Marina Bay Sands was held on 17 February 2011. It also marked the opening of the seven celebrity chef restaurants. The last portion of the Marina Bay Sands, the floating pavilions, were finally opened to the public when the two tenants, [Louis Vuitton](/wiki/Louis_Vuitton) and Pangaea Club, opened on 18 and 22 September 2011, respectively. The property is currently being expanded to include a fourth hotel tower, an arena and additional convention space. ## Background Marina Bay Sands is one of two winning proposals for Singapore's first integrated resorts, the other being the [Resorts World Sentosa](/wiki/Resorts_World_Sentosa), which incorporates a family-friendly [Universal Studios Theme Park](/wiki/Universal_Studios_Theme_Park) ([Universal Studios Singapore](/wiki/Universal_Studios_Singapore)). The two large-scale resorts were conceived to meet Singapore's economic and tourism objectives for the next decade and will have 30-year casino licenses, exclusive for the first ten years. Bidders were assessed based on four criteria: tourism appeal and contribution, architectural concept and design, development investment, and strength of the consortium and partners. On 27 May 2006, Las Vegas Sands (LVS) was declared the winner with its business-oriented resort. LVS submitted its winning bid on its own. Its original partner City Developments Limited (CDL), with a proposed 15% equity stake, pulled out of the partnership in the second phase of the tender process. CDL's CEO, [Kwek Leng Beng](/wiki/Kwek_Leng_Beng) said his company's pullout was a combination of factors—such as difficulties in getting numerous companies he owns to comply in time, as well as reluctance of some parties to disclose certain private information in probity checks required by the [Singapore government](/wiki/Government_of_Singapore). However, Kwek was retained as an advisor for Sands' bid. ### Investment Las Vegas Sands initially committed to invest S$3.85 billion in the project, not including the fixed S$1.2 billion cost of the 6,000,000 square feet (560,000 m2) site itself. With the escalating costs of materials, such as sand and steel, and labour shortages owing to other major infrastructure and property development in the country, [Sheldon Adelson](/wiki/Sheldon_Adelson) placed the total cost of the development at S$8.0 billion as of July 2009. [Las Vegas Sands](/wiki/Las_Vegas_Sands) declared the undertaking as \"one of the world's most challenging construction projects and certainly the most expensive stand-alone integrated resort property ever built\". It expected the casino to generate at least $1 billion in annual [profit](/wiki/Profit_(accounting)). Two months after the initial phased opening, the casino was attracting around 25,000 visitors daily, about a third being [Singaporeans](/wiki/Singaporeans) and permanent residents who paid a $150 daily entry levy or $3,000 for annual unlimited access. Half a million gamblers passed through the casino in June 2010. In the third quarter of 2012, the revenues of the Marina Bay Sands fell almost 28 per cent from a year earlier. For the economy, Marina Bay Sands was projected to stimulate an addition of $2.7 billion or 0.8% to [Singapore's Gross Domestic Product](/wiki/Economy_of_Singapore) by 2015, employing 10,000 people directly and 20,000 jobs being created in other industries. On 3 April 2019, Sands announced a $3.3 billion expansion of its Marina Bay Sands property in Singapore. The expansion will include the construction of a fourth hotel tower containing 1,000 luxury suites and a 15,000-seat arena. In October 2024, Sands announced it would increase its investment to US$8 billion on its expansion, described as an entirely new development dubbed \"Marina Bay Sands IR2\". The development is slated to boast 570 luxury suites, 110,000 square feet of MICE space, its own SkyPark and high-end F&B, in addition to the 15,000-seat arena previously announced. As the development of Marina Bay Sands was perceived as critical in Singapore's urbanization efforts, a fixed price was set for the land. This was a departure from the government auctioning off the land to the highest bidder. Bidders were instead assessed holistically on factors such as the design of the Marina Bay Sands and the amenities it would offer. ### Design and construction The resort is designed by [Moshe Safdie](/wiki/Moshe_Safdie), who says it was initially inspired by card decks. The prominent feature of the design is the three hotel towers, which have 1,850 rooms and suites, and a continuous lobby at the base linking the three towers. The casino has a four-storey central atrium with four levels of gaming and entertainment in one space. In addition to the hotel and the casino, other buildings include a 19,000 m2 (200,000 sq ft) [ArtScience Museum](/wiki/ArtScience_Museum), and Sands Expo & Convention Centre with 110,000 m2 (1,200,000 sq ft) of space, capable of accommodating up to 45,000 people. The resort's architecture and major design changes along the way were also approved by its [feng shui](/wiki/Feng_shui) consultants, the late Chong Swan Lek and Louisa Ong-Lee. [Aedas](/wiki/Aedas) were responsible for employing all consultants and for developing, co-ordinating and implementing the design. The structural engineering for the project was handled by [Arup](/wiki/Arup_Group_Limited) with [Parsons Brinckerhoff](/wiki/Parsons_Brinckerhoff) the [MEP](/wiki/Mechanical,_electrical,_and_plumbing) engineers. The main contractor was [Ssangyong Engineering and Construction](/wiki/Ssangyong_Engineering_and_Construction). The three towers are broader at the base and narrow as they rise. Each tower has two asymmetric legs, with a curved eastern leg leaning against the other, creating a significant technical challenge in its construction. Substantial temporary structures were necessary to support the legs of the tower while they were under construction, and required real-time monitoring for continual assessment and analyses in the course of their erection. A distinctive feature of the hotel is Sands SkyPark, a 1.2-hectare tropical oasis that is longer than the Eiffel Tower and extends to form one of the world's longest public cantilevers. Built at the height of 200m, the structure offers 12,400sqm of space – big enough to fit three football fields. The structure bridges all three towers with a segment cantilevered off the north tower. The hull of the SkyPark was pre-fabricated off-site in 14 separate steel sections and then assembled on top of the towers. There are four movement joints beneath the main pools, designed to help them withstand the natural motion of the towers, and each joint has a unique range of motion. The total range of motion is 500 millimetres (20 inches). In addition to wind, the hotel towers are also subject to settlement in the earth over time, so engineers built and installed custom jack legs to allow for future adjustment at more than 500 points beneath the pool system. This jacking system is important primarily to ensure the infinity edge of the pool continues to function properly. ### Opening Marina Bay Sands was originally planned to be completed in a single phase in 2009, but rising construction costs and the [2008 financial crisis](/wiki/2008_financial_crisis) forced the company to open it in phases. The first phase's [soft opening](/wiki/Soft_opening) was further delayed until 27 April 2010, and the official opening was pushed back to 23 June 2010. The rest of the complex remained under construction and was opened after a [grand opening](/wiki/Grand_opening) on 17 February 2011. On 27 April 2010, Marina Bay Sands had the first of a planned 3 to 4 phase openings. The casino, parts of the conference hall, a segment of the Shoppes, 963 hotel rooms and the event plaza were opened at the auspicious time of 3:18 p.m as part of the \"preview opening\". The Inter-Pacific Bar Association (IPBA) held the first conference at Marina Bay Sands Convention Centre on 2–5 May 2010, but the event was marred by uncompleted facilities and power failure during a speech. IPBA withheld payment of S$300,000 and was consequently sued by Marina Bay Sands. In June IPBA counter-sued, describing the venue as a \"complete disaster\" and that its earlier payments had been imposed by \"duress, fear and force\". An \"amicable settlement\" with undisclosed terms was announced in August. On 23 June 2010, the resort had its official opening with a \"2-day celebration\"; this included the Sands SkyPark, the Event Plaza along [Marina Bay](/wiki/Marina_Bay,_Singapore), more shops, additional dining options and nightlife offerings, and the rest of the hotel rooms. First day events included a \"World Championship Climb\" on the glass facade of the building to the SkyPark, with seven teams of 21 top rock climbers from around the world competing, and an evening concert for 4,000 invited guests and customers, featuring [Kelly Rowland](/wiki/Kelly_Rowland) and [Sylvia Ratonel](/wiki/Sylvia_Ratonel). The SkyPark was opened on the second day at 2 p.m., with about 2,000 adult tickets costing S$20 each sold. Sands Theatre was completed in time for the first performance of the theatrical show [Riverdance](/wiki/Riverdance) on 30 November 2010. ArtScience Museum opened its doors to the public at 10 am on 19 February 2011. The musical [*The Lion King*](/wiki/The_Lion_King_(musical)) made its debut on 3 March 2011. The floating pavilions were opened when the tenants Louis Vuitton and Pangaea Club finished their refurbishment and opened on 18 September 2011, and 22 September 2011, respectively. *The Lion King* ran its last show on 30 October 2011. ### Expansion Marina Bay Sands is expanding their property with a new development set to be complete by 2031, at an estimated cost of S$10.3 billion (US$8 billion). Plans for the standalone fourth tower was earlier announced in 2019, and will feature 570 luxury suites, 10,220 square metres (110,000 sq ft) of MICE space, its own SkyPark, and a 15,000 capacity arena. In early 2025, Las Vegas Sands secured a S$12 billion (US$9 billion) loan to finance the expansion. The loan was said to be the biggest corporate loan in the history of Singapore. Las Vegas Sands broke ground on their expansion of Marina Bay Sands on 16 July 2025. Also in 2025, a renovation of all the hotel rooms in the existing structure was completed. ## Facilities Marina Bay Sands has three 55-storey hotel towers which were topped out in July 2009. The three towers are connected by a 1.2 hectare rooftop cantilever, Sands SkyPark . The Skypark [observation deck](/wiki/Observation_deck) provides panoramic views across the bay. In front of the three towers, they include the Theatre Block for performances, the Convention and Exhibition Facilities Block, as well as the Casino Block, which has 1,000 gaming tables and 1,400 slot machines. To enter the casino, Singaporeans and Permanent Residents (PRs) have to pay a SGD$150 fee for a one time entry and a S$2000 fee for an annual pass. The fee was changed on 4 April 2019, to SGD$150 for a one-time visit and S$3000 for yearly visits. The [ArtScience Museum](/wiki/ArtScience_Museum) is constructed next to the three blocks and has the shape of a [lotus](/wiki/Lotus_Flower), composed of 21 gallery spaces with a total floor area of approximately 50,000 sqft (5,000 sqm). The building is composed of 10 \"fingers\", with the tallest standing 60m above ground. Its roof is retractable, providing a waterfall through the roof of collected rainwater when closed in the day and laser shows when opened at night. In front of The Shoppes, at the Event Plaza along the Waterfront Promenade, a light and water show, Spectra, is staged each evening. An original light and water show, titled Wonder Full, produced by [Laservision](/wiki/Laservision), ran from 2011 to 2017. It was subsequently replaced by a new light and water show named Spectra in 2017. The ArtScience Museum and Wonder Full show opened on 17 February 2011. The SkyPark has the world's longest elevated swimming pool, with a 146-metre (479 ft) vanishing edge (a concept called an [infinity pool](/wiki/Infinity_pool)) located 191 metres (627 ft) above ground. The pools are made up of 422,000 pounds (191,000 kg) of stainless steel and can hold 376,500 US gallons (1,425 cubic metres) of water. The SkyPark also has rooftop nightclubs such as Lavo (New York, Vegas) and Cé La Vi, gardens, hundreds of trees and plants, and a public observatory deck on the [cantilever](/wiki/Cantilever) with 360-degree views of the Singapore skyline. The SkyPark is accessible only to hotel guests for security reasons. The Shoppes is the main shopping mall at Marina Bay Sands, with close to 93,000 m2 (1,000,000 sq ft) of retail space with over 270 stores and F&B outlets, featuring premium and luxury brands such as [Ralph Lauren](/wiki/Ralph_Lauren_Corporation), [Chanel](/wiki/Chanel), [Cartier](/wiki/Cartier_(jeweler)), [Prada](/wiki/Prada), [Gucci](/wiki/Gucci), [Hermès](/wiki/Herm%C3%A8s), [Emporio Armani](/wiki/Emporio_Armani), [Chopard](/wiki/Chopard), [Valentino](/wiki/Valentino_(fashion_house)), [Dior](/wiki/Dior), [Dunhill](/wiki/Alfred_Dunhill_Limited), [Vertu](/wiki/Vertu), [Miu Miu](/wiki/Miu_Miu), [Saint Laurent Paris](/wiki/Yves_Saint_Laurent_(brand)), [Salvatore Ferragamo](/wiki/Salvatore_Ferragamo_(company)), [Montblanc](/wiki/Montblanc_(company)), [Blancpain](/wiki/Blancpain), [Vera Wang Bride](/wiki/Vera_Wang), an [Hermès](/wiki/Herm%C3%A8s) watch boutique, and [Hervé Léger](/wiki/Herv%C3%A9_L%C3%A9ger). A canal runs through the length of the Shoppes, in the same style as [The Venetian](/wiki/The_Venetian_Las_Vegas) in [Las Vegas](/wiki/Las_Vegas_Valley). [Sampan](/wiki/Sampan) rides on the canal are available for guests and shoppers at the shopping mall, similar to the [gondola](/wiki/Gondola) rides available in the Venetian. Also housed within the Shoppes are several Celebrity Chef restaurants—Bread Street Kitchen (by [Gordon Ramsay](/wiki/Gordon_Ramsay)), Cut (by [Wolfgang Puck](/wiki/Wolfgang_Puck)), Waku Ghin (by [Tetsuya Wakuda](/wiki/Tetsuya_Wakuda)), and Maison (by [Daniel Boulud](/wiki/Daniel_Boulud)). The north side of the Shoppes used to contain an ice skating rink, which used [artificial ice](/wiki/Artificial_ice). In 2017, it was replaced with Digital Light Canvas by Japanese art collective [TeamLab](/wiki/TeamLab_(art_collective)). When Marina Bay Sands first opened, it featured two Crystal Pavilions located along the Waterfront Promenade and linked to the shopping mall. Despite a brief legal dispute in June 2011, it was decided that one of the Pavilions will house two nightclubs—Avalon and Pangaea. The second Pavilion houses the world's largest [Louis Vuitton](/wiki/Louis_Vuitton) boutique, in addition to being on a floating island, at 1,900 m2 (20,000 sq ft), which is connected to the portion of the boutique in the Shoppes via an underwater tunnel. Both Pavilions opened in 2011 just before the [2011 Formula One season](/wiki/2011_FIA_Formula_One_World_Championship) came to the [Marina Bay Street Circuit](/wiki/Marina_Bay_Street_Circuit). The Pavilion vacant by Avalon and Pangaea was taken over by Singapore's third [Apple Store](/wiki/Apple_Store), Apple Marina Bay Sands, in 2020. Their third store in Singapore feature the company's first store that sits on water and one that is of spherical design. The luxury resort also features a performance venue Sands Theatre, which seats 2,183 guests and has presented internationally acclaimed musicals and performances including The Lion King, [Cirque Éloize](/wiki/Cirque_%C3%89loize), [A. R. Rahman](/wiki/A._R._Rahman)'s [Jai Ho](/wiki/Jai_Ho_(song)), and *[Wicked](/wiki/Wicked_(musical))*. Moshe Safdie designed an Art Path within the resort, incorporating installations by five artists including Zheng Chongbin, [Antony Gormley](/wiki/Antony_Gormley) and [Sol LeWitt](/wiki/Sol_LeWitt). The pieces are meant to play on environmental influences including light, water and wind, integrating art with architecture. ### Attraction In 2011, Marina Bay Sands launched a nightly light and water show, titled *Wonder Full*, a multimedia show designed by the Australian multimedia company [Laservision](/wiki/Laservision) and incorporated various Laservision technology such as the Stella Ray. The show starts off with a single drop of water, representing the birth of life. It later stages through important stages of a person's life such as childhood, development through age and adulthood. In 2017, Wonder Full was replaced with a new light and water show, titled Spectra. Set to an original orchestral soundtrack composed by Singaporean producer and composer Kenn C., Spectra is a state-of-the-art multimedia experience that is dramatic in scale and unique in style. The 15-minute show is currently staged every night at 8pm and 9pm (Sundays to Thursdays), with a third show at 10pm on Fridays and Saturdays. ## Transportation [Mass Rapid Transit (MRT)](/wiki/Mass_Rapid_Transit_(Singapore)) - [Bayfront](/wiki/Bayfront_MRT_station) ([Circle](/wiki/Circle_Line_(Singapore)) and [Downtown](/wiki/Downtown_Line) lines) [Public buses](/wiki/Public_buses_of_Singapore) - Services 97/97e, 106, 133, 502/502A, 518/518A Water taxi - From Grand Copthorne Water Front, Raffles Landing Side, Boat Quay, River Side Point and Robertson Quay ## Controversies In 2010, about one month before Marina Bay Sands opened, Reuters reported that Marina Bay Sands had links with Hong Kong criminal organizations operating in Macau, according to court documents of a case of attempted murder. Several gangsters of the criminal group [Wo Hop To](/wiki/Wo_Hop_To), were sentenced to jail for the attempted murder. Witnesses testified that the mastermind was Cheung Chi-tai, who operates a VIP room related to the murder attempt. Cheung is also a leader of the same criminal group. Opposition parties, such as the [National Solidarity Party](/wiki/National_Solidarity_Party_(Singapore)), and media commentators, raised concerns about the links with criminal organisations. In June 2020, it was reported that Marina Bay Sands was under investigation by the US Department of Justice over alleged breaches of anti-money laundering regulations. ### Publicising of winnings In 2011, Marina Bay Sands announced it would stop publicising details of winners and the amount of their winnings on its website. Minister for Community Development, Youth, and Sports, Vivian Balakrishnan had earlier stated in Parliament that his ministry would take steps to stop such publicity. The web pages in question were titled \"Celebrate With the Winners\" and \"Mystery Car Jackpot\", and included the names of the jackpot winners, which machines they had used, and the amount of their winnings. Although it had previously stated that it had operated in accordance with applicable law, the casino subsequently took down the relevant web pages and said it would stop such future publicity. ### Slot machine malfunction In late 2011, Marina Bay Sands had a dispute with Choo Hong Eng, on whether she was entitled to winnings which a slot machine had allegedly shown that she had won SGD 416,721.12 on 18 October 2011. A casino manager claimed that it was a machine error. During negotiations, the casino offered to give her a car which was worth SGD 258,962 instead. Choo appointed a lawyer to demand that Marina Bay Sands pay her the whole sum. Several days later, the casino agreed to pay her the full amount. The Casino Regulatory Authority of Singapore censured the casino for failing to keep its machine operating properly, although it ultimately found that the casino had not intentionally sought to deceive Choo or deprive her of her prize. According to media reports, Choo subsequently donated her winnings to charities instead of keeping it for herself. ### Data breach In late October 2023, Marina Bay Sands reported a data leak of some 665,000 members of a shopper's [rewards program](/wiki/Loyalty_program). Marina Bay Sands reported that Members' personal information were accessed by an unknown third party operator. While there have not been reports of the leaked information being used to cause harm, personal information such as members' names, e-mail addresses, or phone numbers could be used against them in phishing and other scam campaigns. The incident was reported to the authorities. ## In popular culture - The towers of the Marina Bay Sands have made multiple televised appearance on various franchises of *[The Amazing Race](/wiki/The_Amazing_Race)* including the [fourth season](/wiki/The_Amazing_Race_Asia_4) of the [Asian edition of *The Amazing Race*](/wiki/The_Amazing_Race_Asia), the [first season](/wiki/The_Amazing_Race_Australia_1) of the [Australian edition of *The Amazing Race*](/wiki/The_Amazing_Race_Australia), the [second season](/wiki/HaMerotz_LaMillion_2) of the [Israeli edition of *The Amazing Race*](/wiki/HaMerotz_LaMillion), and the [twenty-fifth season](/wiki/The_Amazing_Race_25) of the original [American edition of *The Amazing Race*](/wiki/The_Amazing_Race_(American_TV_series)), all of which featured a tightrope walking task between two of the resort's towers. The SkyPark served as the finish line for the first season of the British show *[Race Across the World](/wiki/Race_Across_the_World_(series_1))*. - A partially destroyed version of the structure was featured in the 2015 video game *Call of Duty: Black Ops 3*, which takes place 10 years after a biochemical disaster rendered most of Singapore's eastern half inhospitable. - It was featured in the 2015 movie *Hitman: Agent 47*, appearing along with Gardens by the Bay. - The trailer of the 2016 movie *Independence Day: Resurgence* has a scene depicting the destruction of the property after being caught in the [gravitational pull](/wiki/Gravitational_pull) of a hovering alien spacecraft. - It was also featured in the 2018 film *[Crazy Rich Asians](/wiki/Crazy_Rich_Asians_(film))*, both in scenic [B-roll](/wiki/B-roll) of Singapore, as well as a setting towards the end of the film. - Both the completed and partially destroyed versions of the structure are featured in the 2019 animated film *Detective Conan: The Fist of Blue Sapphire*, in the opening, various parts of the film, and the end credits. - [Lego](/wiki/Lego) released a miniature set called \"Singapore 21057\" in their Architecture theme. The set includes iconic landmarks in Singapore, including the Marina Bay Sands. ## Gallery - Singapore portal - [Future developments in Singapore](/wiki/Future_developments_in_Singapore) - [List of tallest buildings in Singapore](/wiki/List_of_tallest_buildings_in_Singapore) - [Architecture of Singapore](/wiki/Architecture_of_Singapore) - [List of integrated resorts](/wiki/List_of_integrated_resorts) ### Similar towers - The Gate ([Shams Abu Dhabi](/wiki/Shams_Abu_Dhabi)), building in Abu Dhabi - [Toranomon Hills](/wiki/Toranomon_Hills) **Notes** **Further reading** - Reid, Robert (August 2011). \"Towering Imagination\". *Civil Engineering*: 50–59. Archived from the original on 10 February 2008. Discusses the engineering behind the project. - Official website - Las Vegas Sands press release on winning integrated resort bid - Safdie Designing Ambitious Resort in Singapore (Architectural Record) - Moshe Safdie and Associates | Project Details of the Marina Bay Sands - Opening Event | Laservision\n",
  "language": "en",
  "processed_at": "2026-01-12T11:29:30.850354",
  "title": "Marina Bay Sands",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Marina_Bay_Sands"
}