{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:29:28.874510"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Marina Bay Cruise Centre Singapore\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(October 2024)* *(Learn how and when to remove this message)*Cruise, Retail in Marina Coastal Drive, Singapore The **Marina Bay Cruise Centre Singapore** (**MBCCS**) is a [cruise](/wiki/Cruise_ship) [terminal](/wiki/Cruise_terminal) in [Singapore](/wiki/Singapore), located at [Marina South](/wiki/Marina_South). The construction of the S$500 million terminal began in October 2009 and was completed on 22 May 2012. It received its first ship, the *Voyager of the Seas*, on 26 May 2012. The official opening ceremony of MBCCS was on 22 October that year. The terminal is operated by SATS-Creuers Cruise Services (joint venture by [SATS](/wiki/SATS_(company)) and Creuers del Port de Barcelona). The [Singapore Cruise Centre](/wiki/Singapore_Cruise_Centre) at [HarbourFront](/wiki/HarbourFront) is set to be consolidated with MBCCS to form a cruise hub as the leisure cruise sector continues to grow in [Singapore](/wiki/Singapore). ## History The impetus for construction came from difficulties many cruise operators had with the current [Singapore Cruise Centre](/wiki/Singapore_Cruise_Centre) which is in a narrow channel with a dead end. The geographical limitations of the site impose height and berth limits on the cruise operators. The new location at [Marina South](/wiki/Marina_South) has deep waters, a large turning basin, and no height restrictions, which enables it to accommodate the largest cruise ships being built now.[*citation needed*] On 18 March 2009, the [Ministry of Trade and Industry](/wiki/Ministry_of_Trade_and_Industry_(Singapore)) (MTI) and [Singapore Tourism Board](/wiki/Singapore_Tourism_Board) (STB) revealed the cruise terminal's design.[*citation needed*] On 29 July 2011, [SATS](/wiki/SATS_Ltd) submitted a bid to manage and operate the MBCCS, in partnership with European cruise terminal operator Creuers Del Port de Barcelona SA. [Singapore Cruise Centre](/wiki/Singapore_Cruise_Centre) also participated in the tender but it was won by [SATS](/wiki/SATS_Ltd) in the end. A S$7 million upgrade was completed in 2014. A fourth passenger bridge was built to expedite boarding and disembarking. The taxi pick-up area was also redesigned to allow simultaneous boarding. In 2017, amidst growing demand in the cruise tourism industry, 20 more check-in counters were added, making a total of 120 check-in counters available.[*citation needed*] On 11 April 2025, it was announced that the cruise centre will undergo a S$40 million expansion, which will increase its capacity from 6,800 to 11,700 passengers. ## Pier and terminal design Up to 360 m (1,180 ft) in length with a draft of up to 11.5 m (38 ft) (including [mooring dolphins](/wiki/Dolphin_(structure)) of 60 m) and spanning over 120 m, it has the ability to berth ships of up to 220,000 GT. With the terminal's footprint of 120 m by 335 m and terminal space of 28,000 m2 (300,000 sq ft), it also houses a car park and coach bay area of about 32,000 m2 (340,000 sq ft) with design load of 6,800 passengers. ## Transport connections ### Rail The nearest [MRT](/wiki/Mass_Rapid_Transit_(Singapore)) station is [Marina South Pier MRT station](/wiki/Marina_South_Pier_MRT_station), located about 500m from MBCCS. The upcoming [Marina South MRT station](/wiki/Marina_South_MRT_station) is due to open in the future. Both stations will serve the cruise centre and its vicinity. ### Bus There is a bus stop in the MBCCS that caters to bus service 400.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:29:28.874082",
  "title": "Marina Bay Cruise Centre Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Marina_Bay_Cruise_Centre_Singapore"
}