{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:29:33.345108"
  },
  "content": "Residential skyscraper in SingaporeThe topic of this article **may not meet Wikipedia's notability guideline for geographic features**. Please help to demonstrate the notability of the topic by citing reliable secondary sources that are independent of the topic and provide significant coverage of it beyond a mere trivial mention. If notability cannot be shown, the article is likely to be merged, redirected, or deleted. *Find sources:* \"Marina Bay Suites\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(August 2024)* *(Learn how and when to remove this message)* **Marina Bay Suites** is a condominium in [Marina Bay](/wiki/Marina_Bay,_Singapore), Singapore. It is one of six towers of the [Marina Bay Financial Centre](/wiki/Marina_Bay_Financial_Centre). It was developed by [Keppel Land](/wiki/Keppel_Corporation), [Cheung Kong Holdings](/wiki/Cheung_Kong_Holdings) and [Hongkong Land](/wiki/Hongkong_Land). It stands at 227 metres (745 ft), with 66 floors, making it Singapore's 14th tallest tower. It consists of 108 three-bedroom units (1,572 square feet (146.0 m2) to 1,604 square feet (149.0 m2)), 110 four-bedroom units (2,045 square feet (190.0 m2) to 2,695 square feet (250.4 m2)), and three penthouses (4,682 square feet (435.0 m2) to 8,181 square feet (760.0 m2)). ## Incident In the pre-dawn hours of 14 January 2014, a fire broke out on the 65th floor's service lift lobby. Two security officers died. Residents had evacuated the building and were unharmed. The area that was damaged was the zone that were under renovation. This article about a Singapore building or structure is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:29:33.344696",
  "title": "Marina Bay Suites",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Marina_Bay_Suites"
}