{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:31:10.930172"
  },
  "content": "* *Mark Phooi Peck Lye** is a Singaporean entrepreneur in the design industry. He is the founder and CEO of First Media Pte Ltd (FM), a holding company that manages a collection of design agencies and design institutions. His first business venture at the age of 27 was a design agency he started on his own with a capital of S$2,000. He called it Lancer Design, deriving the name Lancer from the word \"freelancer\". In 2006, Phooi founded First Media Design School (FMDS), a progressive private educational institution specialising in the field of design. In August 2011, FMDS was awarded the Council for Private Education's (CPE) four-year EduTrust mark. ## Early life and education Phooi was born in Singapore. His father worked as a contractor for [PSA International](/wiki/PSA_International) and his mother was a contract labourer. At the age of 9, he joined [The Singapore Scout Association](/wiki/The_Singapore_Scout_Association)(SSA) as a Sea Scout and at the age of 12, he became a qualified lifeguard. Phooi attended his secondary school education at [Tanglin Secondary School](/wiki/Tanglin_Secondary_School). At the age of 24, he enrolled into a Fine Arts diploma program at the [Nanyang Academy of Fine Arts](/wiki/Nanyang_Academy_of_Fine_Arts)(NAFA), but switched to a Graphic Design pathway soon after. He graduated from NAFA in 1989 at the age of 27. In 2002, he graduated from the [University of New South Wales](/wiki/University_of_New_South_Wales) with a Master of Design. ## Career ### Lifeguard and swimming coach Phooi worked for a year as a lifeguard at [Big Splash](/wiki/Big_Splash,_Singapore), a water theme park in Singapore that was launched in 1976. During this period, he also taught swimming to a handful of students, aged between 6 and 10 years old, on a part-time basis. While serving his [National Service in Singapore](/wiki/National_service_in_Singapore), Phooi continued to coach swimming during the weekends to supplement his income. After completing his National Service, he started to teach on a full-time basis. Midway through his coaching career, Phooi embarked on a training program to attain the CLASS 1 Swimming Coach qualification. As part this program, he was attached to the [People's Association](/wiki/People%27s_Association) swimming team, under the tutelage of the Kee Soon Bee, a prolific national swimming coach. Phooi stopped coaching swimming at the age of 29. ### Designpreneur Phooi began his career as a designpreneur (entrepreneur in the design industry) by setting up Lancer Design in 1989. Phooi ran the company on his own without any staff. In 2002, Phooi established First Media Pte Ltd (FM) as a holding company for his design firms and design schools. His design agencies specialised in various design and media disciplines, such as corporate design, interactive media, events, publishing and advertising and promotion. Companies under the First Media brand include Lancer Design and Mint Editions in Singapore, Brand Smart in China, Auromedia, Discover Jakarta and Imago in Indonesia, BnBc Advertising Sdn Bhd and BnBc Events and Promotions Sdn Bhd in Malaysia, Clever Brand Strategy Co. Ltd in Taiwan, and P.0.P. House in Thailand. In 2005, FM received the Enterprise 50 Award – an annual business award recognising Singapore's most promising privately held companies. In 2006, Phooi was awarded one of the Top Entrepreneurs of the Year Awards (organised by the Association of Small and Medium Enterprises and the [Rotary Club](/wiki/Rotary_International) of Singapore) – one of the highest business award recognitions in Singapore, and one that no trained designer had ever attained previously. In 2007, Phooi was also selected as one of the finalists in Singapore's top design accolade – the President's Design Award. ### Education In 2006, Phooi founded First Media Design School (FMDS), a boutique private design institution that offers diploma, advanced diploma and degree programs in the areas [Graphic design](/wiki/Graphic_design), [Multimedia](/wiki/Multimedia) and [Fashion design](/wiki/Fashion_design). Its [Bachelor's degree](/wiki/Bachelor%27s_degree) program is conferred by the [University of the West of England](/wiki/University_of_the_West_of_England)(UWE). The institution's mission statement specifies that FMDS strives to cultivate a new generation of 'whole brain' trained, industry-ready designers who possess both creative and commercial cognitive abilities, through its holistic [design thinking](/wiki/Design_thinking) and design management teaching system. Its teaching methodology is partly derived from the [Herrmann Brain Dominance Instrument](/wiki/Herrmann_Brain_Dominance_Instrument) system. The students enrolled in FMDS consist of a mixture of local and international students, mostly from Indonesia and China. FMDS equips career starters and career switchers with the necessary skills to go from mere practitioner to business-owner. In an interview in 2006, when Phooi was asked about how he envisions FMDS to be different from other design schools in Singapore, he said: > We will differentiate ourselves by developing designers to become design managers. This is what is lacking in the industry today. There are many designers but not enough creative managers. We have thousands of graduates every year with few job opportunities. Not only will we create enterprising graduates, but we will also offer them jobs in our companies. ## Bibliography In 2013, Phooi co-authored *Think like a Sage, Work like a Fool, Act like a Criminal* ([ISBN](/wiki/ISBN_(identifier)) 978-981-07-5167-8), which consists of his biography, and a compilation of business theories, life lessons and personal reflections garnered from the early years of his career as a designpreneur to the present. - First Media Pte Ltd Official Website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:31:10.929648",
  "title": "Mark Phooi",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Mark_Phooi"
}