{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:31:18.850539"
  },
  "content": "Place in Singapore **Marsiling** is a suburb of [Woodlands](/wiki/Woodlands,_Singapore), Singapore, extends from the north of Woodlands Square to the [Woodlands Checkpoint](/wiki/Woodlands_Checkpoint), bordering [Malaysia](/wiki/Malaysia). It presents the older living patterns of Singapore; it is a quieter and much denser estate, often offering a reasonable and larger alternative to other housing options, and houses a large number of elderly and heavy-duty industries. ## History In the late 1990s, a plan was introduced by the [Government of Singapore](/wiki/Government_of_Singapore) to upgrade existing [Housing and Development Board](/wiki/Housing_and_Development_Board) apartment blocks by providing refurbished elevators serving every storey of each block, an additional room at the rear of each flat, and other modernising features. This led to a surge in housing prices. The community of foreigners living in Marsiling has also been increasing. ## Politics By 2015, Marsiling was merged with [Yew Tee](/wiki/Yew_Tee) in an ongoing review of electoral boundaries that also saw Marsiling-Yew Tee Town Council being formed. In 2017, [Halimah Yacob](/wiki/Halimah_Yacob) resigned from the Marsiling-Yew Tee GRC (Marsiling division) to contest for the Presidency. Halimah Yacob was sworn in as the 8th President of Singapore from 13 September 2017. Since the [2020 Singaporean general election](/wiki/2020_Singaporean_general_election), former [Chua Chu Kang GRC](/wiki/Chua_Chu_Kang_GRC) MP and Minister of State [Zaqy Mohamad](/wiki/Zaqy_Mohamad) represented Marsiling, having earlier temporarily filling the vacated seat from 2017 to 2020. This [Singapore](/wiki/Singapore) location article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:31:18.849910",
  "title": "Marsiling",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Marsiling"
}