{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:32:03.538911"
  },
  "content": "Mosque located in Geylang Serai, Singapore **Masjid Khalid** ([Jawi](/wiki/Jawi_script): مسجد خالد) is a mosque located along [Joo Chiat Road](/wiki/Joo_Chiat_Road) at [Geylang Serai](/wiki/Geylang_Serai), [Singapore](/wiki/Singapore). It was built in 1917 on [waqf](/wiki/Waqf) land donated by Haji Abdul Khalid, whom the mosque is named after. It primarily serves the residents of Geylang Serai and surrounding landed property estates in the area. ## History Masjid Khalid was established in 1907 on land bequeathed by Haji Abdul Khalid bin Haji Mohamed Tyeb. The land was formerly a place for peddlers to sell [Nasi kandar](/wiki/Nasi_kandar), until they requested Haji Abdul Khalid to establish a mosque at the site, which he agreed to and hence donated the land as a [waqf](/wiki/Waqf). The mosque was completed in 1917. Later, it was earmarked for renovation and upgrading in 1996. The reconstruction works on the mosque began in March 1998 and were completed by 1999. Further, more intensive renovation plans to expand the mosque structure were announced in 2018 and further elaborated on in 2019. The reconstruction works started in 2019, with the mosque holding its final prayers for the time being on 11 August of that year. The mosque would remain closed, even during the [COVID-19 pandemic](/wiki/COVID-19_pandemic), until it was officially reopened on 13 January 2023. ## Architecture Masjid Khalid is built in a Malay architectural style, with a cupola atop a tiered roof. The mosque can fit 2,000 congregants and has two main prayer halls. The interior of the prayer hall is equipped with a wooden [minbar](/wiki/Minbar) which the Khatib utilizes while giving the Friday sermon. Between 1999 and 2017, the mosque had a single minaret. However, this minaret is not visible at all on images after 2022. The recent renovations have added a brand new, modern annex structure to the mosque that faces Onan Road as well. The mosque has a kitchen area used to prepare their signature style of [biryani](/wiki/Biryani) dishes, which are served during special occasions. ## Accessibility The mosque is located in [Geylang Serai](/wiki/Geylang_Serai) amongst shophouses and landed property, while being sandwiched between [Joo Chiat Road](/wiki/Joo_Chiat_Road) and Onan Road with the mosque having an entrance each for both roads. The nearest MRT stations to the mosque are [Paya Lebar MRT station](/wiki/Paya_Lebar_MRT_station) and [Eunos MRT station](/wiki/Eunos_MRT_station), both on the [East-West MRT line](/wiki/East%E2%80%93West_Line_(Singapore)). Due to being located along Onan Road, Masjid Khalid is situated opposite [Masjid Taha](/wiki/Masjid_Taha), a community house and communal hall for the [Ahmadiyya](/wiki/Ahmadiyya) interfaith religious group. To avoid people from praying at Masjid Taha by mistake, the Mufti of Singapore as well as the committee of Masjid Khalid began initiatives to direct the public away from Masjid Taha. ## Gallery - [Islam in Singapore](/wiki/Islam_in_Singapore) - [List of mosques in Singapore](/wiki/List_of_mosques_in_Singapore)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:32:03.536754",
  "title": "Masjid Khalid",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Masjid_Khalid"
}