{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:32:00.190758"
  },
  "content": "Mosque in Geylang, Singapore **Masjid Khadijah** ([Jawi](/wiki/Jawi_script): مسجد خديجة; literally *Khadijah Mosque*) is a [Sufi Muslim](/wiki/Tariqa) mosque located in [Geylang](/wiki/Geylang) within the [Central Region, Singapore](/wiki/Central_Region,_Singapore). Built in 1920, the mosque is named after its founder, Khadijah binte Mohamed. Within the mosque grounds exist the headquarters of the Religious Rehabilitation Group (RRG). ## History The mosque was built on land endowed by Khadijah binte Mohamed, an Indian Muslim businesswoman. Khadijah, who donated a large sum of money to fund the construction, died in 1916 and did not live to see the mosque's completion; nor did the second mosque trustee who had also passed away a year before the mosque was completed. Construction of the mosque was ultimately completed in 1920. The mosque was also a gathering place for the Southeast Asian branch of the [Qadiriyya wa Naqshbandiyya](/wiki/Qadiriyya_wa_Naqshbandiyya) order during the early 1980s and was affiliated with a [Sufi dervish](/wiki/Dervish) named Omar Bagharib who served as the head Imam for the mosque. In 1997, a row of unidentified graves behind the mosque were discovered and then exhumed to be reburied in the [Pusara Abadi](/wiki/Pusara_Abadi_Muslim_Cemetery) cemetery at [Choa Chu Kang](/wiki/Choa_Chu_Kang). The mosque was reported to be in a state of absolute disrepair in November 1997, with the floor of the main prayer hall being infested with maggots, cracks appearing in the roof and the arches on the verge of collapse. At least $8 million was donated to the mosque's committee for an extensive reconstruction work. The mosque committee also collected funds through a charitable sale of [biryani](/wiki/Biryani). Plans to reconstruct the mosque with a new annex building were approved in November 1999. The mosque was closed on 24 September 2001 for extensive repair works. It was officially reopened in 2003 with a new annex building and minaret added to the grounds of the mosque. The then Prime Minister [Goh Chok Tong](/wiki/Goh_Chok_Tong) gave a speech at the opening ceremony of the new annex building. The Religious Rehabilitation Group (RRG) also set up their headquarters in the second level of this building. In 2021, it was announced that the mosque would undergo another renovation in future to improve its services for its worshippers. Currently, the mosque is one of two mosques that were founded by Muslim women, the other being [Masjid Hajjah Fatimah](/wiki/Masjid_Hajjah_Fatimah) in the Kampong Glam neighbourhood. ## Architecture The mosque is built in a mixed architectural style inspired by the [Nagore Dargah](/wiki/Nagore_Dargah) shrine in [Ajmer, India](/wiki/Ajmer) and the [Prophet's Mosque](/wiki/Prophet%27s_Mosque) in the Islamic holy city of [Medina](/wiki/Medina). Singaporean construction firm Hiladt Architects worked on the reconstructed mosque in 2003. The mosque has one minaret topped by a conical dome. The annex building of the mosque contains an auditorium hall and offices while the building itself is attached to the minaret. ## Religious Rehabilitation Group (RRG) The Religious Rehabilitation Group (RRG) was formed in April 2003 to combat religious extremism and self radicalization. Originally, the RRG was meant to guide youth that had been radicalized into supporting or joining the [Jemaah Islamiyah](/wiki/Jemaah_Islamiyah) terrorist group. The RRG has since started focusing on guiding people, especially Muslims, against being radicalized by terrorist groups such as ISIS, Al-Qaeda, and the Longinus Dreizehn Orden. The RRG set up their headquarters and offices in the second level of the annex building of Masjid Khadijah. ## Accessibility The nearest MRT station to Masjid Khadijah is the [Aljunied MRT station](/wiki/Aljunied_MRT_station) on the [East-West MRT line](/wiki/East%E2%80%93West_Line_(Singapore)). The mosque is located in the central Geylang area, which is infamously known for being a [red-light district](/wiki/Red-light_district) at night. This is shared with another mosque, [Masjid Haji Mohd Salleh](/wiki/Masjid_Haji_Mohd_Salleh), located along the same road in the same area. - [List of mosques in Singapore](/wiki/List_of_mosques_in_Singapore)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:32:00.190257",
  "title": "Masjid Khadijah",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Masjid_Khadijah"
}