{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:31:55.864669"
  },
  "content": "Mosque in Teban Gardens, Singapore **Masjid Hasanah** ([Jawi](/wiki/Jawi_script): مسجد الحسنات; *Mosque of Good Deeds*) is a mosque located at [Teban Gardens](/wiki/Teban_Gardens) in [Jurong East](/wiki/Jurong_East) in the [West Region, Singapore](/wiki/West_Region,_Singapore). It was first built in 1970 as a replacement for smaller, older mosques in [Jurong](/wiki/Jurong) before it was further rebuilt in the 1990s to accommodate more worshippers. ## Etymology The name of the mosque, Hasanah, is derived from the Arabic word *ḥasana* which means \"good deed.\" In Islamic tradition, God will weigh up the *ḥasanāt* of a person against the bad deeds that they have done. Muslim scholars Ibn Abbas and Muhammad Husayn al-Dhahabi state that the hasanāt of a person may be a given to someone that has been wronged or backbitten by said person. ## History The mosque was officially opened on 16 October 1970. Built by the [JTC Corporation](/wiki/JTC_Corporation), it was intended as a replacement for several older mosques located at Tanjong Kling which were demolished in order to make way for the redevelopments in [Jurong](/wiki/Jurong). In 1985, plans were confirmed for a complete reconstruction of the mosque, which would involve rebuilding the mosque in a more modern architectural style as well as increasing the capacity of the mosque to fit more worshippers. Sufficient funds were collected by 1989 and the reconstruction work started in October of the same year. A fire broke out in the mosque in 1993 which delayed the reconstruction works. However, the mosque was fully completed by 1996 and reopened in that year, offering computer classes upon its reopening. ## Incidents ### 1993 fire On 24 March 1993, a fire seized the mosque, destroying some classrooms and damaging the female prayer hall. The main prayer hall, however, was barely affected along with much of the structure. No injuries were reported. The cause of the fire is unknown and some eyewitnesses reported a large explosion seconds before the fire broke out. The police have stated that the fire may have resulted from an act of vandalism inside the mosque premises, but this had not been confirmed at the time. ## Accessibility The mosque is located in the [Teban Gardens](/wiki/Teban_Gardens) housing estate, next to the Teban Place market. The nearest MRT station is the [Jurong East MRT Station](/wiki/Jurong_East_MRT_station) located on the [East-West line](/wiki/East%E2%80%93West_Line_(Singapore)). Two bus stops lead directly to the mosque as well. Another mosque, [Masjid Al-Mukminin](/wiki/Masjid_Al-Mukminin), built in 1987, is nearer to the Jurong East MRT station. - [Masjid Kampung Siglap](/wiki/Masjid_Kampung_Siglap) - also damaged by a fire in 2009 - [List of mosques in Singapore](/wiki/List_of_mosques_in_Singapore)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:31:55.864259",
  "title": "Masjid Hasanah",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Masjid_Hasanah"
}