{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:31:43.653963"
  },
  "content": "Mosque in Bedok, Singapore **Masjid Al-Taqua** ([Jawi](/wiki/Jawi_script): مسجد التقوى, [Mandarin](/wiki/Mandarin_Chinese): 大园清真寺; literally *Mosque of God-fearing Piety*) is a mosque located along Jalan Bilal in [Bedok, Singapore](/wiki/Bedok). It was first inaugurated in 1986, although it had already been established years before that on a [waqf](/wiki/Waqf) land. ## Etymology The mosque's name, Al-Taqua, derived from the Arabic word *taqwā* (تقوى) which appears more than a hundred times in the Qur'an. It can be directly translated as \"God-fearing piety.\" According to the Muslim scholar [Ibn Kathir](/wiki/Ibn_Kathir), *taqwā* is protecting oneself from sinning through the dangerous journeys of life, so that one can successfully complete said journeys unscathed by sin. Additionally, *taqwā* is a very important concept in [Sufism](/wiki/Sufism), divided into three parts: full trust in God with respect to what has not been granted; full satisfaction with what has been granted; and full patience with respect to what has eluded. ## History The date of construction of the mosque is unknown and is dated to before 1932. Masjid Al-Taqua, built on [waqf](/wiki/Waqf) land, was one of two mosques in the former Bedok village that were frequented by villagers for the Friday prayers until the other mosque, [Masjid Bedok Laut](/wiki/Former_mosques_of_Singapore#Masjid_Bedok_Laut), was demolished after 1984 to make way for the redevelopments in the [Bedok](/wiki/Bedok) area. Due to its perceived historic importance and the fact that it was the only mosque in the southern section of Bedok at the time, Masjid Al-Taqua was spared and was instead earmarked for renovations and upgrading works. By 1964, the mosque was rebuilt, losing its appearance as a former [surau](/wiki/Surau). It was also officially inaugurated into the registry of the [Majlis Ugama Islam Singapura](/wiki/Majlis_Ugama_Islam_Singapura) (MUIS) by the Mufti, Syed Isa Semait, in 1986. The mosque was closed in 2006 for a major reconstruction, subsequently being reopened a year later on 1 September 2007. Aside from expansion of the main prayer hall, the mosque had been completely rebuilt into a modern architectural style, while retaining some of its older village house features. ## Accessibility Masjid Al-Taqua is situated along the Jalan Bilal road in the [Bedok](/wiki/Bedok) planning area. The nearest MRT stations to the mosque are the [Tanah Merah MRT station](/wiki/Tanah_Merah_MRT_station) and the [Sungei Bedok MRT station](/wiki/Sungei_Bedok_MRT_station), the latter which is still under construction as of now. - [List of mosques in Singapore](/wiki/List_of_mosques_in_Singapore) - GoogleMaps StreetView of Masjid Al-Taqua, Jalan Bilal\n",
  "language": "en",
  "processed_at": "2026-01-12T11:31:43.653614",
  "title": "Masjid Al-Taqua",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Masjid_Al-Taqua"
}