{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:32:09.614131"
  },
  "content": "Mosque located in Geylang East, SingaporeSome of this article's listed sources **may not be reliable**. Please help improve this article by looking for better, more reliable sources. Unreliable citations may be challenged and removed. *(January 2025)* *(Learn how and when to remove this message)* **Masjid Wak Tanjong** is a mosque located in [Geylang East](/wiki/Geylang_East), [Singapore](/wiki/Singapore). It is named for Wak Tanjong, a Bugis merchant who established the mosque in 1873. The mosque is situated directly next to the [Paya Lebar MRT station](/wiki/Paya_Lebar_MRT_station) of the [East–West MRT line](/wiki/East%E2%80%93West_Line_(Singapore)). ## History The site where the mosque stands on in the present day was originally a small wooden [surau](/wiki/Surau), founded in 1873 by Wak Tanjong, a Bugis trader who emigrated to Singapore from [Malacca](/wiki/Malacca). He was buried behind the mosque along with some members of his family in a simple mausoleum building. The wooden mosque was subsequently demolished and replaced with a larger, firm concrete structure in the 1930s by Mohammed Ally Tanjong, an Indian Muslim trader who was also the son of the founder. Plans were made to expand the mosque in 1990, and reconstruction works would start in April of 1996. The mosque was eventually rebuilt into its current form and then reopened by 1998. In the early 2000s, the mausoleum of Wak Tanjong and his family behind the mosque was demolished and their exhumed remains were reinterred at the [Pusara Abadi Muslim Cemetery](/wiki/Pusara_Abadi_Muslim_Cemetery). The mosque was also affected by severe flooding in January 2018, but the main prayer hall of the mosque was not affected by the flooding, only the courtyard. A commemorative plaque to celebrate the 150th anniversary of Masjid Wak Tanjong since its founding in 1873 was unveiled on December 2024, with the mosque also starting a campaign known as *Legaci Kesyukuran* (*A Grateful Legacy*) which included helping out the needy in Singapore. ## Architecture Formerly a simple wooden surau, the present day mosque is a two-storey concrete building, designed by Singaporean architectural firm, Akitek Yeokhoo. The mosque is built in a mixture of styles that combine [Indo-Saracenic architecture](/wiki/Indo-Saracenic_architecture) and traditional Malay architecture. A golden, glided onion dome tops the entrance to the female prayer hall. ## Accessibility Masjid Wak Tanjong is located right next to the [Paya Lebar MRT station](/wiki/Paya_Lebar_MRT_station) within Geylang East. Opposite the mosque, two streets across, is the Paya Lebar Quarter, a shopping mall which also contains a [musalla](/wiki/Musalla) in the mall's basement carpark. Due to its location along Paya Lebar Road next to the MRT station, the mosque is not part of the actual [Paya Lebar planning area](/wiki/Paya_Lebar), but rather, it is a part of the [Geylang planning area](/wiki/Geylang) instead. - [Islam in Singapore](/wiki/Islam_in_Singapore) - [List of mosques in Singapore](/wiki/List_of_mosques_in_Singapore) - GoogleMaps StreetView of Masjid Wak Tanjong\n",
  "language": "en",
  "processed_at": "2026-01-12T11:32:09.613718",
  "title": "Masjid Wak Tanjong",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Masjid_Wak_Tanjong"
}