{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:31:50.398163"
  },
  "content": "Mosque located in Geylang East, Singapore **Masjid Darul Aman** ([Jawi](/wiki/Jawi_script): مسجد دار الأمان) is a mosque located in [Geylang East](/wiki/Geylang_East), Singapore. Built in 1986, it is situated at the junction of Changi Road and Jalan Eunos. It has also been nominated for the [Aga Khan Award for Architecture](/wiki/Aga_Khan_Award_for_Architecture) in 1989. ## Etymology The name of the mosque, *Darul Aman*, is derived from the Arabic word *Dar al-Aman* (دار الأمان) which signifies a peaceful and tranquil place with guaranteed safety and security. A rejected name proposal for the mosque in 1982 was Masjid Aminah Baru which is Malay for \"New Masjid Aminah\", reinforcing the fact that the original Masjid Aminah was to be demolished at the time. ## History The mosque was established in the early 1980s, while the name Darul Aman was only decided in 1982. Construction on the mosque started in 1984 after funds had been raised though food sales that were held by the newly formed mosque committee between 1982–1983. The mosque was completed by 1986 and officially inaugurated on 3 August of that year. It served as a replacement to Masjid Aminah, a smaller mosque that had to be demolished in order to make way for redevelopment plans in the Geylang area. The mosque was nominated for the [Aga Khan Award for Architecture](/wiki/Aga_Khan_Award_for_Architecture) in 1989 due to its traditional and tropical architecture. ### Incidents On 8 January 2020, the mosque's corporate service officer, Marlina Abdul Rahman, was charged with criminal breach of trust after she was discovered issuing manual receipts for collection of money for various purposes and not recording it in the accounting system. A total of [S$](/wiki/Singapore_dollar)37,877.5 was taken by her. Marlina was sentenced to nine months' jail. On 3 March of the same year, Djamaludin Supadi entered the mosque to pray while under the influence of an unknown drug. While inside the mosque, he damaged the [kentong](/wiki/Bedug), a wooden drum which is used to call a congregation to prayer. He then subsequently stripped naked and lay on the ground. The mosque's staff failed to get Djamaludin dressed and he was arrested by the police later. Djamaludin was found to have two foldable knives and three cases of penknife blade refills with him which he claimed were for his previous work which his former employer denied. He was sentenced to six months' jail. ## Architecture Masjid Darul Aman was designed by Bangladeshi architect Mohammad Asaduz Zaman in cooperation with the [Housing and Development Board (HDB)](/wiki/Housing_and_Development_Board). The mosque is built in a traditionally Malay architectural style, with the main prayer hall and adjoining facilities topped with pointed and tiered roofs akin to a Malay village house. The walls and infrastructure of the mosque are built from sturdy concrete, while gypsum and timber are used for the fixtures in the mosque such as the mihrab, minbar and the railings. Aside from having a main prayer hall and a space for female worshippers to pray, the mosque also has several multi-purpose rooms on the first and second levels which have suggested usage as either a classroom or conference room. ## Accessibility The mosque is situated at the junction of Changi Road and Jalan Eunos, within walking distance from the [Eunos MRT station](/wiki/Eunos_MRT_station) and its adjoining bus interchange. ## Gallery - [Islam in Singapore](/wiki/Islam_in_Singapore) - [List of mosques in Singapore](/wiki/List_of_mosques_in_Singapore)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:31:50.397658",
  "title": "Masjid Darul Aman",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Masjid_Darul_Aman"
}