{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:31:35.685012"
  },
  "content": "Mosque located in Yishun, SingaporeThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Masjid Ahmad Ibrahim\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(January 2022)* *(Learn how and when to remove this message)* **Masjid Ahmad Ibrahim** ([Jawi](/wiki/Jawi_script): مسجد أحمد إبراهيم; *Ahmad Ibrahim Mosque*) is a mosque located along Jalan Ulu Seletar, between the areas of [Yishun](/wiki/Yishun) and [Thomson, Singapore](/wiki/Thomson,_Singapore). It is named after [Ahmad bin Ibrahim](/wiki/Ahmad_Ibrahim_(Singaporean_politician)), a Singaporean politician and the former Minister for Labour from 1959–1961. ## History The place was first established as a surau (prayer hall). The date of establishment differs with some sources stating 1955, 1956, 1957, 1958; either way all sources agree the establishment of the surau was in the mid to late 1950s. It served the residents of the villages in what is now modern day [Sembawang](/wiki/Sembawang). The surau was upgraded with funding from [Ahmad bin Ibrahim](/wiki/Ahmad_bin_Ibrahim), the then Minister of Health, in 1959. With the growing number of Muslims in the area around it, the surau received the status of a congregational mosque in 1962. The mosque was eventually named after Ahmad bin Ibrahim as a tribute to his contribution to the original surau. Renovations have been held since at least 1970. Then in the late 1980s, plans were announced of an expansion for Masjid Ahmad Ibrahim. Starting in 1997 the congregational prayers were held at temporary sites around the mosque while construction was taking place. Upon completion, congregational prayers were resumed at the mosque. The mosque has held public interest due to the obscurity of its location as well as its size. Aside from congregational prayers, it is a place for community activities and [madrasa](/wiki/Madrasa) classes. - [List of mosques in Singapore](/wiki/List_of_mosques_in_Singapore) - Official website of Masjid Ahmad Ibrahim - Masjid Ahmad Ibrahim on [Majlis Ugama Islam Singapura](/wiki/Majlis_Ugama_Islam_Singapura) This article about a [mosque](/wiki/Mosque) or other [Islamic](/wiki/Islamic) place of worship in [Singapore](/wiki/Singapore) is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:31:35.684421",
  "title": "Masjid Ahmad Ibrahim",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Masjid_Ahmad_Ibrahim"
}