{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:31:46.019453"
  },
  "content": "Mosque in Serangoon **Masjid Alkaff Upper Serangoon** ([Jawi](/wiki/Jawi_script): مسجد الكاف أعالي سيرانغون, *Alkaff Upper Serangoon Mosque*) is a mosque located in the [Serangoon](/wiki/Serangoon) planning area of the [North-East Region, Singapore](/wiki/North-East_Region,_Singapore). Gazetted as one of Singapore's national monuments, the mosque was built in 1932 and is one of two mosques in Singapore that are named for the [Alkaff family](/wiki/House_of_Al-Kaff), the other being [Masjid Alkaff Kampung Melayu](/wiki/Masjid_Alkaff_Kampung_Melayu). ## History Masjid Alkaff Upper Serangoon was built by Syed Abdul Rahman bin Shaikh Alkaff, the leader of the Alkaff family of Yemeni Arab merchants and traders who lived in Singapore and owned local properties and houses (such as the [Alkaff Mansion](/wiki/Alkaff_Mansion) at [Telok Blangah](/wiki/Telok_Blangah)). The original design and structural plans for the mosque were created in 1927, but the project was abandoned as one of the architects died; hence, the Alkaffs hired construction firm [Swan & Maclaren Group](/wiki/Swan_%26_Maclaren_Group) to design the mosque building. Construction was completed in 1932, subsequently the mosque commenced service for the first time on 24 June of that year. In March 2014, the mosque received a major renovation as well as upgrades to its facilities, including an expansion to the mosque size. Then in December of that same year, the mosque was designated as the 68th national monument of Singapore. A year later, the mosque won the [Urban Redevelopment Authority's](/wiki/Urban_Redevelopment_Authority) *Architectural Heritage Award*. In 2024, Deputy Prime Minister [Lawrence Wong](/wiki/Lawrence_Wong) visited the mosque, accompanied by the Minister of Islamic Affairs [Masagos Zulkifli](/wiki/Masagos_Zulkifli), during the Islamic month of [Ramadan](/wiki/Ramadan). They were given a guided tour of the mosque. ## Architecture The architects behind the mosque are the Swan & Maclaren group. The main building of the mosque, including the prayer hall, is built in the style of [Moorish architecture](/wiki/Moorish_architecture). The pyramidal roofs of the mosque are inspired by the architectural styles of the Malay [Nusantara](/wiki/Nusantara_(term)) region. The minaret of the mosque is seemingly inspired by [Ottoman architecture](/wiki/Ottoman_architecture), especially with the pointed top end. During the 2014 renovation and expansion works, a design agency, Shing Design Ateiler Pte Ltd, assisted in ensuring that the mosque's original shape and design elements were carefully retained. ## Gallery ### Exterior ### Interior - [Masjid Alkaff Kampung Melayu](/wiki/Masjid_Alkaff_Kampung_Melayu) - [List of mosques in Singapore](/wiki/List_of_mosques_in_Singapore)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:31:46.019084",
  "title": "Masjid Alkaff Upper Serangoon",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Masjid_Alkaff_Upper_Serangoon"
}