{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:31:37.587330"
  },
  "content": "Mosque in Singapore The **Al-Ansar Mosque** ([Malay](/wiki/Malay_language): *Masjid Al-Ansar*) is a [mosque](/wiki/Mosque) in [Singapore](/wiki/Singapore) that was among the first few to be built under Phase One of the Mosque Building Fund Programme. It was completed in 1981 and is located in the [Bedok](/wiki/Bedok) North area, at the junction of Chai Chee Street and Bedok North Avenue 1. The mosque originally could accommodate up to 3,500 people at any one time. Apart from daily and Friday prayers, the mosque offers [madrasah](/wiki/Madrasah) classes during weekdays and weekends.[*citation needed*] In October 2011, the mosque chairman announced that the masjid would undergo a major renovation, which began in October 2012. The upgrade took almost three years to complete, but increased the accommodation size to 4,500 people, while improving access to the building for the elderly. The only surviving part of the original mosque is the minaret, which has been turned into an elevator shaft.[*citation needed*] The mosque officially re-opened on the 24 April 2015. The new mosque has a total of seven floors, including a basement car park. Other features include barrier-free access, ramps, and a family prayer area. ## Transportation The mosque is accessible from [Bedok MRT station](/wiki/Bedok_MRT_station). - [Islam in Singapore](/wiki/Islam_in_Singapore) - [List of mosques in Singapore](/wiki/List_of_mosques_in_Singapore) - Majlis Ugama Islam Singapura, MUIS (Islamic Religious Council of Singapore) - List of Mosques in Singapore managed by MUIS : Masjid Al-Ansar - Makeover for 30-year-old Al Ansar Mosque in Chai Chee This article about a [mosque](/wiki/Mosque) or other [Islamic](/wiki/Islamic) place of worship in [Singapore](/wiki/Singapore) is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:31:37.586862",
  "title": "Masjid Al-Ansar",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Masjid_Al-Ansar"
}