{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:31:58.337768"
  },
  "content": "Mosque located in Queenstown, Singapore **Masjid Jamek Queenstown** is a mosque located at the junction of Margaret Drive and Tanglin Road within [Queenstown, Singapore](/wiki/Queenstown,_Singapore). Built in 1964, it is one of the smallest mosques in the country with a capacity of at least 400 worshippers. It is currently a heritage site of the Queenstown neighbourhood. ## History Masjid Jamek Queenstown was built in 1964, opened on 25 December of that year by Mohammed Khir Johari, who was then the Malayan Minister for Agriculture and Co-Operatives. Due to its location next to the Alexandra Canal, the mosque was flooded by waters from the canal during construction works in 1993. To resolve the issues, the ground surrounding the mosque was raised six times to prevent intense flooding. The mosque was eventually recognized as a landmark of Queenstown by 2011, being listed on the main heritage trail of the area as well. The mosque received a major upgrading and renovation in 2017, as part of a project to renovate old generation mosques, which included [Masjid Tasek Utara](/wiki/Masjid_Tasek_Utara) at [Farrer Park](/wiki/Farrer_Park) and [Masjid Hussain Sulaiman](/wiki/Masjid_Hussain_Sulaiman) at [Pasir Panjang](/wiki/Pasir_Panjang). During the [COVID-19 pandemic](/wiki/COVID-19_pandemic), the mosque was affected by the outbreak and was temporarily closed down but resumed functionality as per usual after the pandemic. ## Architecture Masjid Jamek Queenstown is built in a [Javanese architectural style](/wiki/Javanese_architecture), with a tiered roof, one covering the main building and the other topping the single minaret. The mosque's architectural style is also meant to have a traditional Malay village aesthetic. The mosque was formerly known for its predominantly blue colour scheme which was later changed to a white, brown and green colour scheme after the 2017 renovations. ## Gallery - [Masjid Hang Jebat](/wiki/Masjid_Hang_Jebat) - [Masjid Mujahidin](/wiki/Masjid_Mujahidin) - [List of mosques in Singapore](/wiki/List_of_mosques_in_Singapore)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:31:58.337127",
  "title": "Masjid Jamek Queenstown",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Masjid_Jamek_Queenstown"
}