{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:31:41.463263"
  },
  "content": "Mosque in Jurong East, Singapore **Masjid Al-Mukminin** ([Jawi](/wiki/Jawi): مسجد المؤمنين; *Believer's Mosque*) is a mosque located in [Jurong East, Singapore](/wiki/Jurong_East). It was built in 1987 under the Mosque Building Fund initiative. The mosque primarily serves the residents of the Jurong East residential town, along with [Masjid Hasanah](/wiki/Masjid_Hasanah) in the neighbouring [Teban Gardens](/wiki/Teban_Gardens). ## Etymology The mosque is named Al-Mukminin, which is a Malay word that is derived from the Arabic word [m*u'min*](/wiki/Mumin). Mu'min literally translates to \"believer\" and the plural is *mu'minun*, which in turn translates to \"believers.\" The name of the mosque was officially finalized in 1982 by the [Majlis Ugama Islam Singapura](/wiki/Majlis_Ugama_Islam_Singapura), the official Islamic council of Singapore. ## History Plans to construct a mosque in the residential area of [Jurong East](/wiki/Jurong_East) under the Mosque Building Fund scheme had existed for as early as 1980 before the name of the mosque had been finalized in 1982. Two years later, in 1984, the mosque's construction was delayed due to a lack of funds. [Ahmad Mattar](/wiki/Ahmad_Mattar), who was then the [Minister-in-charge of Muslim Affairs](/wiki/Minister-in-charge_of_Muslim_Affairs) as well as the [Minister for the Environment](/wiki/Environment_minister), urged Muslim readers of *[The Straits Times](/wiki/The_Straits_Times)* and *[Berita Harian](/wiki/Berita_Harian_(Singapore))* to keep donating to support the mosque's cause. In 1986, construction had been nearly completed and the mosque was expected to open in the late half of the year. Masjid Al-Mukminin was then declared open and officially inaugurated into the official list of mosques by the Majlis Ugama Islam Singapura on 7 June 1987. Between the years 2003 to 2006, the mosque was rebuilt into a larger four-storey structure, with the objective being to increase its capacity and accommodate more worshippers. ## Architecture Masjid Al-Mukminin is built in a [modernist architectural style](/wiki/Modern_architecture) designed by Bangladeshi architect Mohammad Asaduz Zaman. The mosque has four stories in its annex building, while the main prayer hall is topped by a roof that is a stylized 10-pointed star. The mosque's main architectural style was also inspired by the [National Mosque of Malaysia](/wiki/National_Mosque_of_Malaysia). ## Accessibility Masjid Al-Mukminin is within walking distance from the [Jurong East MRT station](/wiki/Jurong_East_MRT_station) on both the [East–West line](/wiki/East%E2%80%93West_Line_(Singapore)) and the [North–South line](/wiki/North%E2%80%93South_Line_(Singapore)). The bus stops near the mosque connect it to the neighbourhoods of [Bukit Timah](/wiki/Bukit_Timah), [Clementi](/wiki/Clementi,_Singapore) and [Bukit Merah](/wiki/Bukit_Merah). - [Masjid Hasanah](/wiki/Masjid_Hasanah) - [List of mosques in Singapore](/wiki/List_of_mosques_in_Singapore)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:31:41.457000",
  "title": "Masjid Al-Mukminin",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Masjid_Al-Mukminin"
}