{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:31:52.351560"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Masjid Haji Yusoff\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(August 2016)* *(Learn how and when to remove this message)* **Masjid Haji Yusoff** ([Jawi](/wiki/Jawi_script): مسجد الحاج يوسف) is a mosque located off Upper Serangoon Road in [Hougang](/wiki/Hougang), Singapore. It was built in 1921 on [waqf](/wiki/Waqf) land donated by Ahmad Mohamed Salleh Angullia, who also constructed the [Masjid Anguilla](/wiki/Masjid_Angullia) at [Farrer Park](/wiki/Farrer_Park). ## History Ahmad Mohamed Salleh Eusoofjee Angullia, a [Gujarati](/wiki/Gujarati_people) Indian Muslim merchant and former Justice of Peace, donated land under a [waqf](/wiki/Waqf) scheme for the mosque to be built. The original mosque was built in 1921 and was the first to be built in Hougang. It was known to Chinese locals as Sembahyang Tng, a combination of the Malay word Sembahyang (prayer) and the Hokkien word Tng (pavilion). A [madrasa](/wiki/Madrasa) was also located within the grounds of the mosque, but it was eventually relocated to the neighborhood of [Toa Payoh](/wiki/Toa_Payoh). In 1989, plans were made to reconstruct the mosque as a new, modernized structure with an increased capacity. The reconstruction work started in August 1994 despite the mosque's slightly insufficient funds. Renovation works were also done in 2014 to improve the structure. Currently, the mosque is not only used for prayers but is also an educational center where religious classes are held. In 2017, Japanese health and fitness company [Phiten](/wiki/Phiten) held a session in the mosque basement to demonstrate the usage of their [Elastic therapeutic tape](/wiki/Elastic_therapeutic_tape). - [List of mosques in Singapore](/wiki/List_of_mosques_in_Singapore) - GoogleMaps StreetView of Masjid Haji Yusoff This article about a [mosque](/wiki/Mosque) or other [Islamic](/wiki/Islamic) place of worship in [Singapore](/wiki/Singapore) is a stub. You can help Wikipedia by expanding it.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:31:52.351197",
  "title": "Masjid Haji Yusoff",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Masjid_Haji_Yusoff"
}