{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:31:33.784246"
  },
  "content": "Mosque in Little India, Singapore The **Abdul Gaffoor Mosque** ([Malay](/wiki/Malay_language): *Masjid Abdul Gaffoor*, [Tamil](/wiki/Tamil_language): மஸ்ஜித் அப்துல் கஃபூர், romanized: *Masjit Aptul Kaḥpūr*) is a [mosque](/wiki/Mosque) in [Little India](/wiki/Little_India,_Singapore), [Singapore](/wiki/Singapore). It is located at [Dunlop Street](/wiki/Dunlop_Street) in the Rochor Planning Area. The mosque was constructed in 1907, and major restoration of the building was completed in 2003. The mosque is currently owned by [Majlis Ugama Islam Singapura](/wiki/Majlis_Ugama_Islam_Singapura) (MUIS). The mosque is also known by the following variant names: *Abdul Gafoor Mosque*, *Abdul Gafor Mosque*, *Abdul Gaffor Mosque*, *Abdul Gaphore Mosque*, *Abdul Gapore Mosque*, *Dunlop Street Mosque* and *Indian Mosque*. ## History Masjid Abdul Gaffoor is located in the area known as Kampong Kapor, which was an active business hub for Indian [merchants](/wiki/Merchant) and for those who worked at the old [race course](/wiki/Race_course) at [Farrer Park](/wiki/Farrer_Park). The mosque on this site was originally a building with timber partitions and a tiled roof known as Masjid Al-Abrar, built in 1846 to serve the religious needs of the [South Indian](/wiki/South_India) [Muslim](/wiki/Muslim) merchants and [Baweanese](/wiki/Bawean) [syces](/wiki/Driving_in_Singapore#History) and [horse trainers](/wiki/Horse_trainer) residing in Kampong Kapor. In 1881, a [deed of assignment](/wiki/Assignment_(law)) dated 14 November 1881 created the Dunlop Street Mosque Endowment or *[wakaf](/wiki/Wakaf)*. The two [trustees](/wiki/Trustee) were Ismail Mansor and Shaik Abdul Gaffoor bin Shaik Hydert. Abdul Gaffoor was chief [clerk](/wiki/Law_clerk) at a legal firm. The *wakaf* was created for the building of a mosque for the Muslim community in Singapore. The deed of assignment also placed in trust several other [properties](/wiki/Property) including a Muslim [burial ground](/wiki/Burial_ground) and a house in Race Course Road. The burial ground was closed in 1921. In 1887, as mosque trustee, Shaik Abdul Gaffoor applied to construct shophouses and sheds on the land around the original mosque. More shophouses were added in 1903. The rental of these buildings generated income which then went towards building the new mosque. Building began in 1907 and it appeared to have taken quite a few years for the mosque to be completed because its completion date is not known. In 1910, when the new mosque was partially completed, the old mosque was demolished. When Shaik Gaffoor died in 1919, it was apparently still not completed. After his death, his son took over the management of the mosque and the *wakaf* properties. In 1927, the Dunlop Street Endowment was taken over by the Muslim and Hindu Endowments Board. The building was presumably complete then. Today, the mosque stands facing a row of shophouses that are now used for [Qur'an](/wiki/Qur%27an) classes and other subjects, as well as for communal activities. Masjid Abdul Gaffoor was [gazetted](/wiki/Gazette) as a [national monument](/wiki/National_Monuments_of_Singapore) on 13 July 1979. ## Architecture Although the *wakaf* was beleaguered by problems, the resulting Masjid Abdul Gaffoor is rich in [architectural](/wiki/Architectural) features. ### Features - The prayer hall is raised above the ground and surrounded with [verandahs](/wiki/Verandah) at the entrance and sides. It is oriented towards [Mecca](/wiki/Mecca) and thus skewed away from the lot lines and the street. - The verandahs are enclosed by a [balustrade](/wiki/Balustrade) with circular and [lancet](/wiki/Lancet_arch#Lancet_arch)-shaped openings and framed by repetitive [cinquefoil](/wiki/Cinquefoil) [arches](/wiki/Arch) double-framed with heavy [mouldings](/wiki/Molding_(decorative)). The [bays](/wiki/Bay_(architecture)) are marked out with [pilasters](/wiki/Pilaster) with ornate [capitals](/wiki/Capital_(architecture)). The wide openings give the interior an airiness that contrasts with the heavy [columns](/wiki/Column) in the centre of the prayer hall. - On either side of the main entrance are two graduated cinquefoil arched openings. The larger ones are nearest the entrance, while the smaller ones are further away. - The main entrance to the prayer hall is [pedimented](/wiki/Pediment) with an elaborate [sundial](/wiki/Sundial) in which the 25 [rays](/wiki/Ray_(optics)) of the [sunburst](/wiki/Sunburst) are done in [calligraphy](/wiki/Calligraphy). The sundial is flanked on either side by a series of pilasters and columns in miniature. The pediment above the sundial is shaped like an [onion dome](/wiki/Onion_dome). The two square [minarets](/wiki/Minaret) on the left and right are complete with miniature columns and arches. - There are [panels](/wiki/Panel_painting) with calligraphic [inscriptions](/wiki/Inscription) in several places in the mosque, including over the entrance. - The interior of the [cupola](/wiki/Cupola) at the centre of the prayer hall is supported by four large cluster columns that form semicircular arches. Square and round calligraphic inscriptions decorate the interior of the cupola. - The cluster columns that hold up the cupola have elaborate mouldings and capitals. - From the exterior, the cupola emerges from the [roof deck](/wiki/Roof_deck) as a [hexagonal](/wiki/Hexagon)-shaped tower that is divided into three levels and marked out with [Doric](/wiki/Doric_order) pilasters. - On the first level of the tower are eight cinquefoil windows with [coloured glass](/wiki/Stained_glass) panes that let light through to the interior. These windows are ornamented with recessed *[mihrab](/wiki/Mihrab)*-shaped moulding and cinquefoil arches. - The second level has pilasters and capitals and is topped by a balustrade with bottleneck [balusters](/wiki/Baluster). - There are minarets at the corners of the hexagon. These minarets are crowned with onion-shaped domes with a [crescent moon](/wiki/Hilal_(crescent_moon)) and a star at the pinnacle. The very centre of the hexagon is crowned with a large onion dome topped with a smaller onion dome. On the pinnacle is a star and crescent moon. - The corners of the front verandah have simpler and less elaborate cupolas. - The four corners of the building are anchored by large [Corinthian](/wiki/Corinthian_order) columns in a cluster with elaborate capitals in a leaf design. The interior and exterior of the mosque have several types of columns and pilasters. They are both structural and ornamental and range from Doric to Corinthian. Columns can be paired with pilasters and pilasters are inset into columns. - The *mihrab* is plain. There is a narrow rectangular panel with a quotation from the Qur'an above it. Next to the *mihrab* is the *[minbar](/wiki/Minbar)*, a three-step timber staircase from which the *[imam](/wiki/Imam)* leads prayers. - Above the prayer hall is a flat roof deck surrounded by a [parapet](/wiki/Parapet) wall with bottle-shaped balusters. It is topped with a line of 22 small six-level minarets crowned with onion domes, each with a crescent moon. The miniature minarets rise from the pilasters that frame the cinquefoil arched openings below. - There is also a type of single-leafed window that is recessed and framed by an elaborate cinquefoil arch. It is flanked with pilasters and pedimented and has the same star-and-crescent pattern of the larger arched openings. - The [ablution](/wiki/Wudu) area in this mosque was originally a pool. This was later drained and a modern wash area put in. It is located outside at the southwest end of the mosque. ## Transportation The mosque is accessible from [Rochor MRT station](/wiki/Rochor_MRT_station), Exit B. ## Gallery ### Interior - [Islam in Singapore](/wiki/Islam_in_Singapore) - Lee Geok Boi (2002), *The Religious Monuments of Singapore*, Landmark Books, [ISBN](/wiki/ISBN_(identifier)) 981-3065-62-1 - National Heritage Board (2002), *Singapore's 100 Historic Places*, Archipelago Press, [ISBN](/wiki/ISBN_(identifier)) 981-4068-23-3 - Preservation of Monuments Board, *Know Our Monuments* - Majlis Ugama Islam Singapura, MUIS (Islamic Religious Council of Singapore) - List of Mosques in Singapore managed by MUIS : Masjid Abdul Gaffoor - YourSingapore website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:31:33.783796",
  "title": "Masjid Abdul Gaffoor",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Masjid_Abdul_Gaffoor"
}