{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:32:04.725412"
  },
  "content": "Mosque in Singapore **Masjid Malabar** or **Malabar Muslim Jama-Ath Mosque** ([Malay](/wiki/Malay_language): *Masjid Malabar*, [Arabic](/wiki/Arabic_language): مسجد مالابار), also known as **Golden Dome Mosque**; is [Singapore](/wiki/Singapore)'s only [Malabar Muslim](/wiki/Malabar_Muslims) [mosque](/wiki/Mosque). The mosque is located at the junction of [Victoria Street](/wiki/Victoria_Street,_Singapore) and Jalan Sultan in the [Kampong Glam](/wiki/Kampong_Glam) district, in the Rochor Planning Area within the [Central Area](/wiki/Central_Area,_Singapore). The mosque is built on the [Sultan Mosque](/wiki/Sultan_Mosque) style with traditional blue and white [lapis lazuli](/wiki/Lapis_lazuli) tile facade. The mosque was nicknamed as little cousin of the [Sultan Mosque](/wiki/Sultan_Mosque), because of similar golden domes. ## History Before the building of the mosque, there was a [burial ground](/wiki/Burial_ground) near the site which was used until [World War II](/wiki/World_War_II). The Indian Muslims built a mosque known as the Tittacheri Muslim Cemetery and Mosque but it fell into disrepair and was abandoned until around 1929. The Mosque was then taken over by the Malabar Muslim Jama'ath. The Jama'ath's first office was located in a shophouse on Changi Road, shifted to Bussorah Street later and finally settled on [Victoria Street](/wiki/Victoria_Street,_Singapore). A fundraising campaign launched to finance the re-construction of the mosque attracted the generous amounts of donations from the Muslim as well as nonmuslim public. Malabar Mosque was declared open by [Yang di-Pertuan Negara](/wiki/Yang_di-Pertuan_Negara) [Yusof bin Ishak](/wiki/Yusof_bin_Ishak) on 24 January 1963. The Mosque has a capacity of 1,000 people. As part of the [Islamic Religious Council of Singapore](/wiki/Islamic_Religious_Council_of_Singapore)'s (Muis) Mosque Upgrading Programme, in 2018, the mosque revealed a proposed plan to construct a three-storey annex which might result in the exhumation of around 10-15 unidentified graves and affect another 15 unidentified graves in the neighbouring cemetery. The proposed annex would house a female prayer space, a heritage gallery and classrooms. The S$ 5.87 million upgrading project which encompassed the proposed annex, and conservation and repairs to the original building began on 1 September 2020. The project is funded by the public, and estimated to be completed in 2022. The mosque would also be closed for three months from 1 September 2020 to facilitate the upgrading works. ## Architecture Malabar Mosque has been built upon the conventional Islamic architectural style.[*citation needed*] A.H Sidique, an immigrant from India who also designed Sri Guru Nanak Sat Sangh Sabha [gurdwara](/wiki/Gurdwara) on Wilkinson Road, designed the Malabar Mosque. The mosque is built upon a [traditional architectural](/wiki/Traditional_architecture) style; adorned with a big, central golden [onion dome](/wiki/Onion_dome) with a crescent and a star on the center top; and a big [minaret](/wiki/Minaret) shaped like an octagonal tower capped with a smaller dome with a crescent and a star on the right of the big dome. On the left of the big dome there is another smaller dome with a crescent and a star. The ground floor courts the [Koran study](/wiki/Koran) area, the [imam](/wiki/Imam)'s room, and a visitors' lounge. A separate double-story annex houses offices and the ablution area. The main prayer hall is situated on the first floor. It faces the direction of [Mecca](/wiki/Mecca) and is surrounded by spacious verandas on its three sides. The staircase leading to the first level is also oriented towards Mecca. Mosque is a unique religious architecture in Singapore. To the rear, there is a now small, partly disused [cemetery](/wiki/Cemetery) known as Tittacheri Muslim Cemetery which comprises a small part of the main Jalan Kubor Cemetery. Jalan Kubor has 4,752 graves, with prominent local leaders such as late local Justice of Peace Haji Ambok Sooloh Haji Omar and Kunji Koya Tangal buried there. Conservation works to the two mentioned leader's graves began alongside the upgrading works that begin in 2020. ## Burials Several figures of the Malabar community are buried within the mosque's courtyard. These include Kunhi Koya Thangal, a prominent Muslim scholar of the Malabar. There are also graves for the [Bugis](/wiki/Bugis) merchant Haji Omar and his wife Hajjah Boosainah. ## Transportation The mosque is accessible from [Lavender MRT station](/wiki/Lavender_MRT_station). - [Islam in Singapore](/wiki/Islam_in_Singapore) - [List of mosques in Singapore](/wiki/List_of_mosques_in_Singapore) - Malabar Muslim Jamaath Mosque - GoogleMaps StreetView of Masjid Malabar\n",
  "language": "en",
  "processed_at": "2026-01-12T11:32:04.721731",
  "title": "Masjid Malabar",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Masjid_Malabar"
}