{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:32:12.926782"
  },
  "content": "Building in Singapore **Masonic Hall**, also known as **Masonic Lodge** and **Freemason's Hall**, is a [Masonic hall](/wiki/Masonic_Temple) located on Coleman Street in [Civic District, Singapore](/wiki/Civic_District). ## Description The building was built in the [English Renaissance](/wiki/Renaissance_architecture) style. The building initially only had a single floor, with the second storey being added in 1888. The building's original porch was torn down around 1910 and the building's entire frontage to Coleman Street was rebuilt. The basement houses the administrative offices and the library. The ground floor houses Madison Rooms, a bar. The Main Meeting Room and the West Temple, which is used for ceremonies, are housed on the second floor, along with the Member's Robing Room, the District Officers Robing Room and the Candidates Robing Room. The Masonic Temple features a domed ceiling and a chequered black-and-white floor. The letter 'G' hangs from the domed ceiling, representing the \"Supreme Being\". The temple features one of only 11 pipe organs in Singapore. The organ was installed in 1970 and replaced an earlier organ, which was installed in 1920. It underwent significant restoration works in 2014. A bronze bust of [William Henry Macleod Read](/wiki/William_Henry_Macleod_Read), the second Singaporean Freemason to be initiated, can be found on the staircase leading to the second floor. The building features a [fluted](/wiki/Fluting_(architecture)) [Doric](/wiki/Doric_order) [colonnade](/wiki/Colonnade) and arched stained-glass windows. The stained-glass windows depict the symbols of the English, Irish and Scottish lodges. [Stamford Raffles](/wiki/Stamford_Raffles), who was a Freemason, is depicted on one of the stained-glass reliefs. ## History The building's foundation stone was laid on 14 April 1879. It was consecrated on 27 December. The Masonic Club, which was occupied the ground floor, was inaugurated on 2 July 1888. The building was designed by Thomas A. Cargill, a municipal engineer and a [Freemason](/wiki/Freemasonry). A basement was excavated from 1953 to 1956 and housed the Masonic Library. The library was later moved to the Phyllis Rudd Wing, and was renamed The Masonic Archive and Research Centre. The building was gazetted for conservation on 21 November 2015. In 2007, the Masonic Club was relocated to the basement. The building underwent a $7.5 million renovation, which was completed in 2012. From 2013 to 2015, the ground floor housed the Bacchanalia restaurant, which was then replaced by Madison Rooms, a private club. In early 2019, The Masons Table - a concept by Singapore-based Food and Beverage company Victus Group Asia - took over the ground floor. Since 2023, The Masons Table has been available for rent as an event venue by the public, for weddings, corporate functions and private gatherings. Following internal refurbishments, the space has a maximum seated capacity of around 160 guests and standing capacity of more than 300 across two rooms, and all spaces are equipped with audio-visual equipment. The on-site kitchen is situated to the rear of the building, and catering is offered to all events. - [Freemasonry in Singapore](/wiki/Freemasonry_in_Singapore) 1°17′33″N 103°50′56″E﻿ / ﻿1.2926°N 103.8490°E﻿ / 1.2926; 103.8490\n",
  "language": "en",
  "processed_at": "2026-01-12T11:32:12.926541",
  "title": "Masonic Hall, Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Masonic_Hall,_Singapore"
}