{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:32:15.858046"
  },
  "content": "The **mass media in Singapore** refers to [mass communication](/wiki/Mass_communication) methods through broadcasting, publishing, and the Internet available in the [city-state](/wiki/City-state). Singapore's media environment is a [duopoly](/wiki/Duopoly) between two major conglomorates—[Mediacorp](/wiki/Mediacorp), a public broadcaster controlled by state-owned conglomerate [Temasek](/wiki/Temasek_(company)), and [SPH Media](/wiki/SPH_Media). Comprising the publishing, print, broadcasting, film, music, digital, and IT media sectors, the media industry collectively employed about 38,000 people and contributed 1.56% to Singapore's gross domestic product (GDP) in 2001 with an annual turnover of [S$](/wiki/S$)10 billion. The industry grew at an average rate of 7.7% annually from 1990 to 2000, and the government seeks to increase its GDP contribution to 3% by 2012. ## Regulation The [Ministry of Digital Development and Information](/wiki/Ministry_of_Digital_Development_and_Information) is the government's regulatory body that imposes and enforces regulation over locally produced media content. It also decides on the availability of published media from abroad. Political, regulatory and structural control over all media forms restricts and discourages criticism of the government. Issues deemed to be inciting racial and religious hatred are prohibited, and media advocating non-traditional family units and lifestyles are avoided. Most of the local media are directly or indirectly controlled by the government through shareholdings of these media entities by the state's investment arm [Temasek Holdings](/wiki/Temasek_Holdings), and are often perceived as pro-government. In 2021, [Reporters Without Borders](/wiki/Reporters_Without_Borders) ranked Singapore 158 out of 180 countries in the [Press Freedom Index](/wiki/Press_Freedom_Index). In 2011, 56% of 1,092 local respondents to a telephone poll agreed that \"there is too much government control of newspapers and television\", and 48% felt that \"newspapers and television are biased when they report on Singapore politics, political parties and elections\". ## Radio and television broadcasting After it acquired the assets of [SPH MediaWorks](/wiki/SPH_MediaWorks) in 2004, the state-owned broadcaster [Mediacorp](/wiki/Mediacorp) currently owns and operates all six free-to-air terrestrial local television channels licensed to broadcast in Singapore, as well as 12 radio channels. The majority of radio stations in Singapore are mainly operated by Mediacorp with the exception of five stations, which are owned and operated by [SPH Media](/wiki/SPH_Media). The only radio station in Singapore that is entirely outside government control is the BBC Far Eastern Relay station, which broadcasts the [BBC World Service](/wiki/BBC_World_Service) locally on 88.9 FM. Private ownership of TV satellite dishes was previously forbidden. ## Newspapers The [Newspaper and Printing Presses Act of 1974](/wiki/Newspaper_and_Printing_Presses_Act) states: > No person shall print or publish or assist in the printing or publishing of any newspaper in Singapore unless the chief editor or the proprietor of the newspaper has previously obtained a permit granted by the Minister authorising the publication thereof, which permit the Minister may in his discretion grant, refuse or revoke, or grant subject to conditions to be endorsed thereon. — Newspaper and Printing Presses Act of 1974, Cap. 206, Sec. 21. —(1) Section 10 of the same act gives the Minister the power to appoint the management shareholders of all newspaper companies and to control any transfers of such management shares. The same section specifies that a management share equals 200 ordinary shares for \"any resolution relating to the appointment or dismissal of a director or any member of the staff of a newspaper company\", and that the number of management shares must equal at least 1% of ordinary shares. This gives the management shareholders, and by proxy the government, a minimum 66% majority in any votes regarding staffing decisions. The print media are largely controlled by [SPH Media](/wiki/SPH_Media), publisher of the flagship English-language daily, *[The Straits Times](/wiki/The_Straits_Times)*. SPH publishes all daily newspapers with the exception of *[TODAY](/wiki/TODAY_(Singapore_newspaper))*, which is owned by [Mediacorp](/wiki/Mediacorp), now a digital publication. Chua Chin Hon, *The Straits Times* US bureau chief, said that the paper's \"editors have all been groomed as pro-government supporters and are careful to ensure that reporting of local events adheres closely to the official line\", and that \"the government exerts significant pressure on ST editors to ensure that published articles follow the government's line\". As with worldwide trends, SPH readership and subscription numbers have stagnated since the early-2000s, as Singaporeans increasingly turned to online media for their news. As of 2008[update], there are 16 newspapers in active circulation. Daily newspapers are published in English, Chinese, [Malay](/wiki/Malay_language) and [Tamil](/wiki/Tamil_language). Under a reciprocal agreement between Malaysia and Singapore, Malaysia's the *[New Straits Times](/wiki/New_Straits_Times)* newspaper may not be sold in Singapore, and Singapore's *The Straits Times* may not be sold in Malaysia. This is largely due to the history between these two countries. Library resources about **Mass media in Singapore** - Resources in your library - Resources in other libraries - [Cinema of Singapore](/wiki/Cinema_of_Singapore) - [Communications in Singapore](/wiki/Communications_in_Singapore) - [Article 14 of the Constitution of Singapore](/wiki/Article_14_of_the_Constitution_of_Singapore) ## Notes\n",
  "language": "en",
  "processed_at": "2026-01-12T11:32:15.857504",
  "title": "Mass media in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Mass_media_in_Singapore"
}