{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:32:18.577656"
  },
  "content": "This article **may need to be rewritten** to comply with Wikipedia's quality standards. Relevant discussion may be found on the talk page. You can help. The talk page may contain suggestions. *(July 2025)*German filmmaker **Matthias Hoene** is a London and LA based filmmaker. He began with animated [music videos](/wiki/Music_videos), then commercials and short films, before getting into feature films and episodes of television series. His film *[Cockneys vs Zombies](/wiki/Cockneys_vs_Zombies)* (2012) won multiple awards, while *[The Warriors Gate](/wiki/The_Warriors_Gate)* (2016) was an international fantasy action epic produced by Europacorp. His latest film *[Little Bone Lodge](/wiki/Little_Bone_Lodge)* (2023) was a psychological thriller with a horror twist. ## Early life Matthias Hoene was born in [Singapore](/wiki/Singapore). He grew up in [Berlin](/wiki/Berlin), where his father was a scientist specializing in high-energy transmission tubes for lasers, and his mother was an alternative medicine enthusiast. Hoene's two brothers became scientists, but he went to study [graphic design](/wiki/Graphic_design) at [Central Saint Martins](/wiki/Central_Saint_Martins) art school in [London](/wiki/London). At Saint Martins, his interest changed to focus on filmmaking. ## Career ### Music videos Hoene's early work after graduation was on creating animated [music videos](/wiki/Music_videos), starting with \"Return Trip\" for DJ Mr. Rossi. In 2001, he directed the animated video for \"[Star 69](/wiki/Star_69_(Fatboy_Slim_song))\" for [Fatboy Slim](/wiki/Fatboy_Slim); the notice he drew from this video got him signed by international video production company [Partizan](/wiki/Partizan_Midi-Minuit), for whom he started making television commercials. A 2003 music video Hoene made for [Tom McRae](/wiki/Tom_McRae)'s song \"A Day Like Today\" had objects in a [flat](/wiki/Apartment) symbolize evoking memories by coming to life and fading away. Later music videos Hoene directed include for \"Rusty Pipes\", by [Eels](/wiki/Eels_(band)) in 2018, \"Bismarck\" by [Sabaton](/wiki/Sabaton_(band)) in 2019, and \"Me Because of You\" and \"Nevermind\" by [HRVY](/wiki/HRVY) in 2020. ### Commercials Hoene's first television advertisement for Partizan was \"Doggy Style\", for singles travel company [Club 18-30](/wiki/Club_18-30), featuring copulating canines. It won a Golden Lion medal at the 2002 [Cannes Lions International Festival of Creativity](/wiki/Cannes_Lions_International_Festival_of_Creativity), which gives awards for advertisements. That advertisement and another Hoene directed for the UK [Central Office of Information](/wiki/Central_Office_of_Information), featuring computer graphics of a highly stylized, apocalyptic universe, were recognized by a 2003 directors award from *[Boards](/wiki/Boards_(magazine))* advertising magazine. Hoene directed other television commercials for Partizan over the next few years including for [London Elects](/wiki/London_Elects) in 2004, [Dyson](/wiki/Dyson_(company)) in 2005, and [Kellogg's](/wiki/Kellogg%27s) in 2006. Hoene returned to commercials after his success with dramatic works. A 2012 advertisement he directed for [AA plc](/wiki/AA_plc) pretends to be a horror film trailer, featuring a house under attack by a demonic [Jack Frost](/wiki/Jack_Frost), until an AA engineer appears to fix the family [boiler](/wiki/Boiler_(water_heating)). He reprised the zombies theme in the first television advertisement for British mobile telephone network [Giffgaff](/wiki/Giffgaff), 3 minutes long, titled \"#dontbescared\" in 2013, about helpful zombies. Another horror-themed advertisement Hoene directed for Giffgaff, the 4-minute \"Monster Family\", in 2018, portrayed a girl removed from then returned to her monster family. ### Dramatic narrative works In 2008 Hoene directed *[Beyond the Rave](/wiki/Beyond_the_Rave)*, a 20-episode British horror serial on [MySpace](/wiki/MySpace), which was the first film produced by [Hammer Films](/wiki/Hammer_Films) in 30 years. Three of the supporting roles were played by [Cockney](/wiki/Cockney) (East London) actors whose humorous improvisations inspired Hoene to make a movie centered around Cockney characters. Hoene and two screenwriters, [James Moran](/wiki/James_Moran_(writer)) and Lucas Roche, spent a year and a half developing the screenplay that became the motion picture *[Cockneys vs Zombies](/wiki/Cockneys_vs_Zombies)* in 2012. It is a [comedy horror](/wiki/Comedy_horror) film pitting East End bank robbers and retirees against the living dead. Hoene had then been living in East London for three years, and made the film a love letter to the [East End of London](/wiki/East_End_of_London), showing many of the area's locations. It won best feature film at the 2012 San Sebastián Horror and Fantasy Film Festival, a \"Méliès d'argent\" at the [Trieste Science+Fiction Festival](/wiki/Trieste_Science%2BFiction_Festival), and best feature film, best comedy, and best ensemble cast at the 2012 [Toronto After Dark Film Festival](/wiki/Toronto_After_Dark_Film_Festival). In 2016 Hoene directed [Luc Besson](/wiki/Luc_Besson)'s Chinese and French science fiction action-adventure film *[The Warriors Gate](/wiki/The_Warriors_Gate)*, written by Besson and [Robert Mark Kamen](/wiki/Robert_Mark_Kamen). This was Hoene's biggest work yet, with up to 900 people on set at a time, filmed in China and Canada, though with all the dialogue in English. In 2018, Hoene was one of five prominent European filmmakers who made short films for the campaign #EUandME, about the benefits of the [European Union](/wiki/European_Union), that were aired across the continent; his entry, \"The Living Hostel\", was about an elderly lady's grandchildren trying to realize her dream of travelling across Europe. It was his first German language film. The same year he also directed the three-minute documentary *Dive*, for the [Adidas Parley](/wiki/Adidas_Parley) environmental partnership, about [Anna Bader](/wiki/Anna_Bader) [cliff diving](/wiki/High_diving#Cliff_diving) from [Kahekili's Leap](/wiki/Kahekili%27s_Leap) in Hawaii, while reflecting on [plastic pollution](/wiki/Plastic_pollution). In 2021, Hoene began filming *[Theodosia](/wiki/Theodosia_(TV_series))*, a children's fantasy adventure television series based on the *[Theodosia and the Serpents of Chaos](/wiki/Theodosia_and_the_Serpents_of_Chaos)* books by [R. L. LaFevers](/wiki/R._L._LaFevers). The series premiered on [HBO Max](/wiki/HBO_Max) in 2022, and was acquired by partners including the [BBC](/wiki/BBC). It was approved for a second season. In 2023, Hoene directed *[Little Bone Lodge](/wiki/Little_Bone_Lodge)*, also known as *The Last Exit*, a [thriller film](/wiki/Thriller_film) about two criminals in a [home invasion](/wiki/Home_invasion) in the [Scottish Highlands](/wiki/Scottish_Highlands) meeting a family with its own secrets. Hoene said that he wanted to direct a straight character based thriller, unlike the action comedy and horror comedy that he had become known for. The film is rated 100% on Rotten Tomatoes. The writer, [Neil Linpow](/wiki/Neil_Linpow), also acted in the film, with [Joely Richardson](/wiki/Joely_Richardson) and [Sadie Soverall](/wiki/Sadie_Soverall). - Matthias Hoene at [IMDb](/wiki/IMDb_(identifier))\n",
  "language": "en",
  "processed_at": "2026-01-12T11:32:18.577330",
  "title": "Matthias Hoene",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Matthias_Hoene"
}