{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:32:19.415575"
  },
  "content": "Singaporean solar energy company **Maxeon Solar Technologies, Ltd.** is a [Singapore](/wiki/Singapore)-based company that designs and manufactures [photovoltaic panels](/wiki/Photovoltaic_panels). The company was previously a division of the American company [SunPower](/wiki/SunPower). Maxeon was [spun off](/wiki/Corporate_spin-off) from SunPower in August 2020. Maxeon was the primary provider of solar panels for SunPower through March 2024. Beyond the United States, Maxeon has sales operations in more than 100 countries and has the rights to use the SunPower brand in countries outside the United States. ## History When SunPower spun-off Maxeon in August 2020, the Tianjin Zhonghuan Semiconductor Company invested US$298 million for a 24% interest in Maxeon. Chinese technology company [TCL](/wiki/TCL_Technology) later purchased Tianjin Zhonghuan Semiconductor, becoming a major investor in Maxeon. SunPower investor TotalEnergies also kept a significant ownership stake in Maxeon. In March 2024, Maxeon Solar filed a patent infringement lawsuit against Canadian Solar. The alleged infringement was linked to Maxeon's TOPCon solar cell technology. TCL, a Chinese company, has the majority stake in Maxeon. The company's panels face detention from U.S. Customs & Border Protection citing the Uyghur Forced Labor Prevention Act (UFLPA). ## Products Its products are known for being more expensive, but producing energy more efficiently than competing products.[a] Maxeon panels are often used when there is a limited amount of space for the panels, such as on rooftops.[b] Ordinarily, the electrical contacts are on the front of a solar panel, facing the sun. The front of Maxeon's panels channel the light to electrical contacts on the back of the panel, reducing the amount of sunlight that is reflected rather than turned into energy. Hence, Maxeon panels are sought for efficiency and aesthetic reasons. ## Notes - Official website - Business data for Maxeon Solar Technologies, Ltd.: - Google - Reuters - SEC filings - Yahoo! Portal: - Renewable Energy\n",
  "language": "en",
  "processed_at": "2026-01-12T11:32:19.415175",
  "title": "Maxeon Solar Technologies",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Maxeon_Solar_Technologies"
}