{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:32:23.704494"
  },
  "content": "Historic building on Maxwell Road in Chinatown, Singapore **Maxwell Chambers Suites**, formerly known as the **Traffic Police Headquarters** or the **Traffic Police Building**, and later as the **Red Dot Traffic Building**, is a historic building on Maxwell Road in [Chinatown, Singapore](/wiki/Chinatown,_Singapore). It initially served as the Police Barracks and the headquarters of the Traffic Police branch of the [Singapore Police Force](/wiki/Singapore_Police_Force), which moved into the building in 1930. In 1941, the first driving test centre in Singapore was established within the building. It ceased operations in 1978 to relieve congestion in the area. Following the Traffic Police's move to a new complex in 1999, the building was left vacant. It was acquired by the [Red Dot](/wiki/Red_Dot_Design_Award), which established the Red Dot Design Museum in the building in 2005. The building was then officially renamed the Red Dot Traffic Building. In 2017, the museum moved elsewhere, after which the building was taken over by the [Ministry of Law](/wiki/Ministry_of_Law_(Singapore)), which intended to convert it into an extension of the neighbouring [Maxwell Chambers](/wiki/Maxwell_Chambers) at 32 Maxwell Road. It then underwent restoration and renovation, which also involved the construction of a new annexe building and a linkway to Maxwell Chambers, before reopening in 2019 as the Maxwell Chambers Suites. ## Description The four-storey building has a 528 ft-long frontage, with 570 ft corridors on every floor. It features timber louvre windows, with those at its rear being \"designed to be smaller than usual, located higher on the walls, and sheltered with a canopy hood.\" It was designed as a safety precaution against fires, as the communal kitchens were located at the rear of the building. Its exterior also features pediments with ornamental plasterwork and floral patterns, as well as drainpipes and gutters made of cast iron, which were manufactured by [Walter MacFarlane & Co.](/wiki/Saracen_Foundry) of Scotland. The building also includes four \"open-to-sky\" courtyards. After the Red Dot Design Museum was established within the building, a concrete-slab roof was built over the courtyards. This was removed after the museum vacated the building. The doors and vents of the building were made with timber, with glazed glass having since been installed into around half of the doors to \"make them more appropriate for office use\". It is currently painted with \"white mineral silicate paint compatible with the historic brick walls.\" ## History Construction on the Police Barracks began in July 1928. It was designed by prominent local architect [Frank Dorrington Ward](/wiki/Frank_Dorrington_Ward), who served as the chief architect of the [Public Works Department](/wiki/Public_Works_Department_(Singapore)) of the [Straits Settlements](/wiki/Straits_Settlements). It was completed in 1930, with the Traffic Branch of the local police force moving into the building from its former premises at the Central Police Station on [South Bridge Road](/wiki/South_Bridge_Road) in January of that year. It was opened to the public on 27 January. It was designed with living quarters accommodating \"118 officers and their families, 18 single officers, with flats for two sub-inspectors\". At its completion, it was the \"largest of its kind ever erected in Singapore.\" A canteen and a clubroom could be found on the ground floor, while a children's playground could be found on the first floor. The second floor featured a school room while the third featured a sunroom and a \"view of the harbour and most of the city.\" In 1941, the first driving test centre in Singapore, named the Maxwell Driving Test Centre, was established within the building. The offices of the Traffic Police were reorganised such that only people on \"official business\" could enter. This came after a local magistrate complained that the offices were in a \"shocking state of affairs\" as \"touts and middlemen\" were allowed to enter. In 1959, the Registry of Vehicles was taken over by the Traffic Police, after which its offices were moved into the building. The registry moved into a complex in 1962. In October 1976, the driving test centre stopped offering provisional driving licence renewals, which were to be offered at post offices from then onwards. In August 1977, it was announced that the centre was to be moved as a result of complaints about its location in a \"heavily congested\" area. The Accidents Branch of the Traffic Police was to move into the building from its former premises at the Sepoy Lines Police Station, which had been earmarked for redevelopment, in the following year. In September, it was announced that the centre, which did around 600 tests per day at the time, was to be \"phased out\" entirely following the completion of two new driving test centres. By then, the centre had around 20 testers, 10 of whom would be transferred to a new test centre on Lorong 8 Toa Payoh while the rest would be transferred to another new test centre on Jalan Ubi. The driving test centre was closed in May of the following year. In September 1981, it was announced that the Traffic Police would be taking over the reissuing of driver's licenses and the administration of the Points Demerit System, with the offices and staff for these facilities being relocated to the building. In July 1986, it was announced that plans for a new headquarters for the Traffic Police in [Kampong Ubi](/wiki/Kampong_Ubi), which was replace the Maxwell Road premises following its planned completion in 1990, had been shelved for the next five years as a result of the 1985 recession in Singapore, along with the plans for the [Police Cantonment Complex](/wiki/Police_Cantonment_Complex). By then, the Traffic Police had also taken over the nearby former Maxwell Community Centre. Beginning on 1 February 1988, the building's operations room was used to broadcast road conditions and floods over the radio. The broadcasts were in English, Chinese, Malay and Tamil. By 1996, the building had become too small to accommodate the staff of the Traffic Police and there was no space to house related units. In 1999, the Traffic Police moved into a newer premises on Ubi Avenue 3 within Kampong Ubi, after which the building was left vacant. In June 2005, it was announced that [Red Dot](/wiki/Red_Dot_Design_Award) would be converting the building into a \"design hub\", housing the second Red Dot Design Museum, a museum dedicated to design. According to *[The New Paper](/wiki/The_New_Paper)*, the \"last time Singapore had anything close to a museum dedicated to design was in 1991, at the now defunct Design Centre located in a carpark building next to [Capitol Building](/wiki/Capitol_Building,_Singapore).\" It was to be the \"only design museum outside [Essen, Germany](/wiki/Essen) to showcase contemporary designs.\" According to [Peter Zec](/wiki/Peter_Zec) of the Red Dot, Singapore was chosen as the location for the museum due to the \"strong creative community and awareness of design\" in the country. Red Dot's Asia President Ken Koo described the building as \"old, awkward with small rooms and uneven floor heights, low doorways and corners that you knock your head on.\" He then went on to state that this made it \"perfect for creative companies.\" The building received a $4.5 million renovation, which involved painting its exterior red. The building, which was renamed the Red Dot Traffic Building, would also house designers and design-related businesses. The Red Dot Design Museum was officially opened on 17 November, with the Concept Design Award, the third Red Dot award and the first outside of Germany, being unveiled at the opening ceremony. Both the building and the neighbouring Maxwell Chambers, formerly the Customs House, were gazetted for conservation by the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) on 2 April 2007. In January 2017, it was announced that, with The Traffic's lease on the building expiring on 30 April of that year, the Ministry of Law was to renovate and restore the building for $25 million, with the intention of converting it into an extension of the Maxwell Chambers, providing the complex with an additional 120,000 sq ft of floor space. It was announced in the following month that the museum was to move to a newer premises at [Marina Bay](/wiki/Marina_Bay,_Singapore). Mok Wei Wei served as the architect of the project, which was to involve the construction of a new annexe building and a linkway to the Maxwell Chambers crossing over Wallich Street. The newly-restored building would have around 50 new offices. The project was to be completed by early 2019. The red paint was removed in May, returning the [façade](/wiki/Fa%C3%A7ade) to its original \"off-white\" colour, removing its \"fiery red hue\". This was done such that the building would match with the Maxwell Chambers be returned to its \"original splendour\". Air-conditioning was installed within the building, which was previously naturally ventilated. The air-conditioning vents were integrated into the windows. The project's [groundbreaking](/wiki/Groundbreaking) ceremony was held on 22 June, during which the building was officially renamed the Maxwell Chambers Suites. The linkway was designed as a Z-profile steel brace, making it the first such bridge in Singapore. The newly-restored building was officially opened on 8 August 2019. At its opening, it housed 11 \"international institutions\", as well as 20 disputes chambers and practices from 11 countries. The building also housed the case management offices of five of the institutions, which were the [International Chamber of Commerce](/wiki/International_Chamber_of_Commerce), the [International Court of Arbitration](/wiki/International_Court_of_Arbitration), the [Singapore International Mediation Centre](/wiki/Singapore_International_Mediation_Centre), the [Permanent Court of Arbitration](/wiki/Permanent_Court_of_Arbitration) and the World Intellectual Property Organisation Arbitration and Mediation Centre. This reportedly resulted in the \"highest concentration of case management offices in the world.\" By May, 75% of the office space within the building had already been occupied. According to then-Deputy Secretary at the Ministry of Law Han Kok Juan, the building would \"boost Singapore's international standing as a dispute resolution hub.\" For his work on the building's restoration, KTP Consultants managing director Aaron Foong received the [Building and Construction Authority](/wiki/Building_and_Construction_Authority)'s Design and Engineering Award in 2020. The building was placed on the Police Heritage Trail, which was launched in 2020 to celebrate the 200th anniversary of the Singapore Police Force. 1°16′42″N 103°50′44″E﻿ / ﻿1.2783°N 103.8456°E﻿ / 1.2783; 103.8456\n",
  "language": "en",
  "processed_at": "2026-01-12T11:32:23.694546",
  "title": "Maxwell Chambers Suites",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Maxwell_Chambers_Suites"
}