{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:32:32.171975"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Media classifications in Singapore\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(February 2023)* *(Learn how and when to remove this message)*List of media classifications used in SingaporeThis article includes a list of general references, but **it lacks sufficient corresponding inline citations**. Please help to improve this article by introducing more precise citations. *(February 2023)* *(Learn how and when to remove this message)* Media classification in Singapore is currently administered by the [Infocomm Media Development Authority](/wiki/Infocomm_Media_Development_Authority) (IMDA). All forms of media, including films, TV programs, video games, and theatrical productions, must receive an age classification before widespread distribution. ## Background Prior to June 1991, works are either passed, censored or banned from publishing as its media classification does not exist back then. In June 1991, the [Media Development Authority](/wiki/Media_Development_Authority) (MDA) (now called Info-communications Media Development Authority (IMDA)) instituted a [content rating](/wiki/Content_rating) system. At first, the ratings had three levels but over the years, these ratings have been expanded into six classifications to comply on television broadcast standards, with three being in the general rating and three being in the restricted ratings; the shapes are also changed as such (green circles (previously green triangles) for general ratings, orange rectangles for restricted ratings) for better identification. ## Classifications There are classification systems for the following types of media: films, TV programs, video games, and arts entertainment (e.g., theatrical productions). ### Films and TV Films and TV programs share this rating system. Under the Section 5 of the Content Code, free-to-air TV content must also adhere to additional restrictions, including the content label advisory before the start of the show. RatingBadgeAlternate badgeNotes**General (G)**The program is suitable for persons or audience of all ages. Many of the [daytime programs](/wiki/Daytime_television) (barring [reruns](/wiki/Rerun)) usually fall under this category.**Parental Guidance** **(PG)**The program may contain content that is [unsuitable for children](/wiki/Age_appropriateness), and require a parent or legal guardian to monitor. While the rating is merely an advisory that is not legally enforced, distributors/providers must prominently display this rating in marketing and/or at the start of the program. The rating was seldomly used in the past, but it has become much more commonly used for many of the [primetime programming](/wiki/Prime_time) (specifically television dramas). Rating descriptions are however optional.**Parental Guidance for Children Under 13 (PG13)**Introduced in 2011, the advisory rating is given for programs that may contain content unsuitable for children under the age of 13. Similar to PG, though that it is now required to include a rating description. This is the maximum allowed rating to be broadcast for free-to-air (FTA) content, and can [only be broadcast](/wiki/Watershed_(broadcasting)) on [late hours](/wiki/Late-night_television) between 10pm and 6am. Advertisements for films with this rating cannot be shown where a child may inadvertently be exposed to them (e.g on video walls).**No Children Under 16 (NC16)**Introduced in 1993, the program is restricted to persons aged 16 or above. Patrons must be validated via a form of identification. Pay Television operators, applications and video-on-demand (VOD) must include [Parental controls](/wiki/Parental_controls) feature by setting up a PIN code to access any rated content. Promotional material for rated content must also be \"edited and scheduled appropriately.\"**Mature 18 (M18)**Introduced in 2004, similar to NC16, these program is restricted to persons aged 18 or above. This is the maximum allowed rating to be broadcast for any pay television operators. Much like PG13, M18-rated content are [watershed](/wiki/Watershed_(broadcasting)), which could only be broadcast between 10pm and 6am.**Restricted 21 (R21)**The program is restricted to persons aged 21 or above. This is the highest available rating in the current classification system, and it is legally enforced. Video-on-demand content must require a separate PIN lock by default. Advertisements for R21-rated content can only appear in venues licensed for R21 films, and/or at the start of another R21-rated movie. Free-to-air radio must not explicitly reference any R21 content.**Not Approved for Release (NAR)**Denotes content that was not approved for release in Singapore under any classification. This is not an official rating under the current system, but was formerly used by the MDA to denote films that were refused classification, and it is now used as semi-official descriptor today. Many films that the IMDA refused to classify were restricted because of concerns that they might \"undermine the public order\". For example, the film *[To Singapore, With Love](/wiki/To_Singapore,_With_Love),* which documented former political dissidents in Singapore, was refused classification, as the MDA believed it was one-sided and \"undermined national security\". ### Rating descriptors While it is optional for G and PG to display a descriptor, below here are the common possible labels: - **Action violence**: action scenes of violence or fight are more stylized and less realistic. Also called **some violence**. - **Drug Use**: scenes that display possible usage of drug or substance abuse. - **Gambling**: themes that depict potentially gambling material. - **Horror**: scenes that display horrific or disturbing content. - **Mature themes**: themes that depict potentially adult content but not explicit, including the usage of coarse language. - **Sexual themes**: scenes that explicitly contain sexual content. - **Violence**: action scenes of violence or fight are more realistic unlike action violence. ### PIN Locks and Parental Controls It is a regulation for pay television and any online content to enforce a PIN code to access content or modify the requirement rating. The parental locks can be set at a minimum level of either NC16 or M18 level. R21 content are locked by default and could only be accessed when verified by age and a separate parental lock is mandatory. ### Video games Following a controversy in November 2007, in which the government banned the video game [Mass Effect](/wiki/Mass_Effect_(video_game)), and then unbanned it a day later, over concerns that the game featured homosexuality, the IMDA announced that it would create a new classification system for games in early 2008. Therefore, starting from April 2008, video games that were sold in Singapore were required to undergo classification. As of 2022, there are 2 ratings in the classification system. Games only need to be classified if they are physically sold in Singapore - however, some digital storefronts like [Steam](/wiki/Steam_(service)) may display the IMDA rating to Singaporean users if one is present. RatingFull BadgeIconNotes**Advisory 16(ADV16)**Suitable for individuals who are at least 16 years old. Unlike the NC16 rating, this is an advisory rating, and is not legally enforced.**Mature 18(M18)**No official badge after July 2021Restricted to individuals who are at least 18 years old. This is a legally enforced restriction, and customers who attempt to purchase these games must present photo identification. Prior to July 2021, the distributor needed to purchase official labels from IMDA - today, distributors can simply self-print the labels.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:32:32.171588",
  "title": "Media classifications in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Media_classifications_in_Singapore"
}