{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:32:44.410516"
  },
  "content": "Singapore medical savings account system **MediSave**, introduced in 1984, is a national [medical savings account](/wiki/Medical_savings_account) system in [Singapore](/wiki/Singapore). By law, all working [Singaporeans](/wiki/Singaporeans) and [permanent residents](/wiki/Permanent_residents) must contribute 8-10.5% of their income to their MediSave account (MSA) to cover medical expenses for themselves or approved dependents, including hospitalization, day surgery, selected outpatient treatments, and healthcare needs in later years. MediSave is part of Singapore’s three key healthcare schemes, collectively known as the 3Ms, alongside MediShield and MediFund. Managed by the [Central Provident Fund](/wiki/Central_Provident_Fund) (CPF) under the oversight of the [Ministry of Health](/wiki/Ministry_of_Health_(Singapore)) (MOH), MediSave is designed to encourage personal responsibility in [healthcare financing](/wiki/Healthcare_financing). ## History On 1 April 1984, [Goh Chok Tong](/wiki/Goh_Chok_Tong), who served as Singapore's Second [Prime Minister](/wiki/Prime_Minister) (1990–2004), introduced MediSave to encourage individuals, particularly young people, to accumulate personal savings for future healthcare expenses. MediSave is an integral part of the [Central Provident Fund](/wiki/Central_Provident_Fund) scheme, designed specifically for healthcare financing. Under this system, salaried employees are required to allocate a portion of their earnings to their MediSave accounts. Starting in 1984, CPF members could use MediSave to cover part or all of their hospital expenses at [government hospitals](/wiki/Government_hospitals), including up to 80% of Class A ward costs and full payment for other ward classes. In 1985, [private hospitals](/wiki/Private_hospitals) and the [National University Hospital](/wiki/National_University_Hospital) (NUH) joined the scheme. In 1986, MediSave coverage was extended to family members who were [Singapore](/wiki/Singapore) [citizens](/wiki/Citizens) or [permanent residents](/wiki/Permanent_residents). In 1988, MediSave was expanded to cover Hepatitis-B [vaccinations](/wiki/Vaccinations) and assisted conception procedures for couples. In 1989, it was extended to [psychiatric treatment](/wiki/Psychiatric_treatment) in private hospitals, [renal dialysis](/wiki/Renal_dialysis), and [radiotherapy](/wiki/Radiotherapy). In 1990, eye surgery was included, followed by outpatient [chemotherapy](/wiki/Chemotherapy) in 1991. In 1994, MediSave was further expanded to cover day treatments at approved medical facilities. The government's goal in implementing the MediSave system in the 1980s was to encourage personal responsibility for healthcare among [Singaporeans](/wiki/Singaporeans) and [permanent residents](/wiki/Permanent_residents). In the 1990s, additional considerations emerged, including the system's potential to mitigate \"moral hazards\" typically associated with government-provided health coverage and private health insurance. A moral hazard refers to a situation where patients overuse medical services and [doctors](/wiki/Doctor_(title)) over-treat, as medical expenses are covered by a third party, leaving individuals with no direct financial consequences. This can lead to higher healthcare costs for the community. However, despite the intention to reduce moral hazard, health expenditure per capita increased from 11% to 13% annually after the introduction of MediSave in 1984. To ensure affordability, the government shifted its focus from personal responsibility to direct government control of [healthcare](/wiki/Healthcare) as the cornerstone of Singapore's health policy in 1993. This shift was articulated in the 1993 White Paper, which stated: \"The government has to step in to structure and regulate the health system, as market forces alone are insufficient.\" As a result, several government initiatives were introduced, including the imposition of price caps on all medical services in [government hospitals](/wiki/Government_hospitals). ## Contributions For a salaried employee who is a [Singapore](/wiki/Singapore) [Citizen](/wiki/Citizen) or [permanent resident](/wiki/Permanent_resident), MediSave contributions are deducted from their monthly [Central Provident Fund](/wiki/Central_Provident_Fund) contributions. Both the [employer](/wiki/Employer) and [employee](/wiki/Employee) contribute a percentage of the employee’s monthly salary to the CPF account, with contribution rates varying by age. CPF Contribution rates from 1 January 2025 (For monthly wages below $750) Employee's age (years)By employer (% of wage) By employee (% of wage) Total (% of wage) 55 and below172037Above 55 to 6015.51732.5Above 60 to 651211.523.5Above 65 to 7097.516.5Above 707.5512.5 Since January 1988, [self-employed](/wiki/Self-employed) individuals earning over $6,000 per year have been required to contribute to MediSave, with contributions capped at an annual income ceiling of $72,000. The contribution rates, which vary based on age, are the same as those for employed individuals. However, [self-employed](/wiki/Self-employed) individuals must cover both the [employer](/wiki/Employer) and [employee](/wiki/Employee) portions of the contributions themselves. MediSave contribution rates for [self-employed](/wiki/Self-employed) person (non-pensionable) Net trade income in 2023 (for Year of Assessment 2024)Age as of 1 January 2023**Below 35 years old****35 to below 45 years old****45 to below 50 years old****50 years old and above**Above $6,000 to $12,0004%4.5%5%5.25%Above $12,000 to $18,0004% to 8%4.5% to 9%5% to 10%5.25% to 10.5%Above $18,0008%9%10%10.5%Maximum$5,856$6,588$7,320$7,686 CPF contributions are distributed across three accounts: the Ordinary Account, the MediSave Account, and the Special Account. The allocation to the MediSave Account varies between 21% and 84%, depending on an individual's CPF contributions and age. CPF Allocation Rates from 1 January 2023 [Private Sector](/wiki/Private_Sector) / Non-Pensionable Employees ([Ministries](/wiki/Ministry_(government_department)), Statutory Bodies & Aided Schools) Employee's Age (Years)Ordinary Account (% of CPF contribution) Special Account (% of CPF contribution) MediSave Account (% of CPF contribution) 35 & below62.17%16.21%21.62%Above 35 – 4556.77%18.91%24.32%Above 45 – 5051.36%21.62%27.02%Above 50 – 5540.55%31.08%28.37%Ordinary Account (Ratio of Contribution)Retirement Account (Ratio of Contribution)MediSave Account (Ratio of Contribution)Above 55 – 6036.94%30.76%32.30%Above 60 – 6514.9%40.42%44.68%Above 65 – 706.07%30.3%63.63%Above 708%8%84% ## Medical claim and coverage MediSave can be utilized by all [Singapore](/wiki/Singapore) [Citizens](/wiki/Citizens) and permanent residents, as well as their family members, including [spouses](/wiki/Spouses), [children](/wiki/Children), [parents](/wiki/Parents), [grandparents](/wiki/Grandparents), and [siblings](/wiki/Siblings). While [family members](/wiki/Family_members) of any nationality are eligible, [grandparents](/wiki/Grandparents) and [siblings](/wiki/Siblings) must be [Singapore](/wiki/Singapore) [Citizens](/wiki/Citizens) or permanent residents. Typically, individuals share their MediSave funds with [family members](/wiki/Family_members) who have depleted their own accounts. Such MediSave transfers among family members are particularly beneficial for elderly parents who have depleted their savings or for unemployed individuals without a contribution history. A 1995 survey of 4,750 individuals aged 55 and above revealed that 65% of elderly women’s healthcare expenses and 43.8% of elderly men’s were covered by their children's MediSave. Only 17.9% of respondents—30.1% of men and 6.9% of women—relied solely on their MediSave savings. In 1998, 44% of acute patients in [public hospitals](/wiki/Public_hospitals) used their own MediSave, while 52% relied on their children’s MediSave, meaning 96% of [patients](/wiki/Patients) used CPF-related funds for medical expenses. MediSave has gradually broadened its coverage from solely [inpatient care](/wiki/Inpatient_care) to also include certain [outpatient](/wiki/Outpatient) services, including [chemotherapy](/wiki/Chemotherapy), [dialysis](/wiki/Kidney_dialysis), [chronic disease](/wiki/Chronic_disease) management, and [preventive care](/wiki/Preventive_care). This shift was introduced to encourage early intervention for chronic conditions, ultimately reducing the risk of expensive complications down the line. MediSave can be used to cover a range of medical expenses and used at [public hospitals](/wiki/Public_hospitals), [polyclinics](/wiki/Policlinics), approved general practitioner [clinics](/wiki/Clinics) and participating medical institutions (MIs). ## Incentives for the elderly ### Flexi-MediSave Starting 1 April 2025, [Singaporeans](/wiki/Singaporeans) aged 60 and above can utilize Flexi-MediSave to cover outpatient expenses using their own or their [spouse](/wiki/Spouse)’s MediSave, provided their [spouse](/wiki/Spouse) is also at least 60 years old. The scheme allows withdrawals of up to $300 per year and is applicable at [polyclinics](/wiki/Polyclinics), [public hospitals](/wiki/Public_hospitals), specialist outpatient clinics, and [general practitioner](/wiki/General_practitioner) clinics participating in the Community Health Assist Scheme (CHAS). ### 2025 Matched MediSave Scheme In his Budget 2025 speech on 18 February 2025, [Prime Minister](/wiki/Prime_Minister) [Lawrence Wong](/wiki/Lawrence_Wong) announced the introduction of the Matched MediSave Scheme (MMSS) from 2026 to 2030. Under this initiative, the government will provide a dollar-for-dollar match for voluntary cash top-ups made to seniors' MediSave accounts, capped at $1,000 per year. Top-ups can be made by eligible members such as themselves, [families](/wiki/Families), [employers](/wiki/Employers) and the community. ## Marriage and parenthood schemes ### MediSave Maternity Package In August 2004, the [Government](/wiki/Government) introduced the MediSave Maternity Package (MMP), allowing [parents](/wiki/Parents) to use their MediSave savings to cover delivery costs and other medical expenses, such as consultations and [ultrasounds](/wiki/Ultrasounds). Under this scheme, parents can withdraw up to $550 per day for the first two days of hospitalization and $400 per day from the third day onward. Additionally, they are eligible to claim $900 for pre-delivery medical expenses. The surgical withdrawal limit ranges from $750 to $2,600, depending on the type of delivery procedure. ### MediSave Grant for newborns Under this scheme, [Singaporean](/wiki/Singaporean) [newborns](/wiki/Newborns) born on or after 1 January 2015, receive a $4,000 MediSave Grant, while those born between 26 August 2012, and 31 December 2014, receive $3,000. This grant can be used to cover healthcare expenses such as vaccinations and hospitalizations. ### MediSave for Assisted Conception Procedures From 1 October 2013 onwards, under the Assisted Conception Procedures (ACP) Scheme, a couple may withdraw $6,000 for their first treatment, $5,000 for their second treatment and $4,000 for their third treatment cycle. A lifetime MediSave withdrawal limit of $15,000 per couple for ACP also applies. ## MediSave issues ### False MediSave claims In December 2014, Steven Ang Kiam Hau, a [dentist](/wiki/Dentist) at The Smile Division Dental Surgeons in Orchard, was accused of making a false claim. He allegedly did so to help a woman who had sought his services for [dental implants](/wiki/Dental_implants)—the same woman who eventually reported him. According to reports, the woman had suggested that he make additional claims against her husband's MediSave account to cover the shortfall of the $22,100 fee for four implants. In his defence, Ang claimed that he had performed 22 implants for both the woman and her husband on August 15 and September 30, 2014. However, a Ministry of Health audit found no clinical records to support his claim. Although Ang claimed to have returned the remaining amount to the patients, his actions were considered dishonest and violated the principles expected of MediSave-approved medical practitioners, who are required to maintain honesty. He later pleaded guilty to four charges and received a 12-month suspension along with a $25,000 fine. From 2013 to 2014, Sng Wee Hock, the former director of WH Dental Surgeons, with branches in Punggol, Hougang, and Seletar, was alleged to have made fraudulent MediSave claims for medical procedures he did not perform. While treating nine patients for [dental implants](/wiki/Dental_implants) and surgical insertions, he quoted a price of $4,000 per implant, claiming the full amount could be reimbursed through MediSave. However, there is a cap on the claimable amount for dental implants. Additionally, he submitted claims for \"foreign body removal\" and \"autogenous bone graft\" procedures, which the patients stated they had not received. Sng was convicted on 27 April 2023 on seven counts each of [cheating](/wiki/Cheating) and [forgery](/wiki/Forgery). He was subsequently sentenced to three years and one month in [prison](/wiki/Prison) for doctoring fake photographs of non-existent procedures and fraudulently claiming $11,750 from the Central Provident Fund Board (CPFB). **Singapore's healthcare systems** - [Healthcare in Singapore](/wiki/Healthcare_in_Singapore) - [Central Provident Fund](/wiki/Central_Provident_Fund) (CPF) **Healthcare systems** - [National Health Insurance](/wiki/National_Health_Insurance) - [Universal Healthcare](/wiki/Universal_Healthcare) - \"MediSave\". *Ministry of Health*. Retrieved 28 February 2025.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:32:44.410058",
  "title": "Medisave",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Medisave"
}