{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:32:31.121208"
  },
  "content": "Television channel **MediaCorp Teletext,** formerly known as **SBC Text** and later **INtv**, was a [Singaporean](/wiki/Singapore) [teletext](/wiki/Teletext) information service provided by [MediaCorp](/wiki/Mediacorp). It was carried on MediaCorp's [Channel 5](/wiki/Channel_5_(Singaporean_TV_channel)), [Channel 8](/wiki/Channel_8_(Singaporean_TV_channel)) and [Channel NewsAsia](/wiki/CNA_(TV_network)). The service provided standard teletext information as well as Singapore-specific data such as [COE](/wiki/Certificate_of_Entitlement) and ERP rates, announcements from selected ministries, and lottery results. The service was also accessible over the Internet from 1999 until its shutdown in 2013. ## History The [Singapore Broadcasting Corporation](/wiki/Singapore_Broadcasting_Corporation) began studying the feasilbility of a teletext service as early as November 1982, issuing tenders for thirty television sets capable of receiving the signals. By January 1983, SBC was aiming for a May 1st launch. SBC's news director, Lim Kim Tian, had studied teletext services in the [United Kingdom](/wiki/United_Kingdom), and since Singapore used similar European equipment, the service, initially named SBC Text, was designed to be similar to those deployed in the UK but with technical adjustments allowing for faster access (two to four times quicker). The launch was rescheduled for \"June or July\" 1983, making it the first of its kind in Asia. The equipment was provided by the British company [Logica](/wiki/Logica). SBC Text staff received training from Ceefax executive Graham Clayton in May 1983. The first teletext-equipped television sets were set to go on sale in April 1983. Test transmissions began by mid-March 1983. The service was carried on both channels (/wiki/Channel_5_(Singaporean_TV_channel)) and (/wiki/Channel_8_(Singaporean_TV_channel)) from 7am to 11pm, with 100 pages on each channel in the 100-199 range. The definitive launch date, 1 August 1983, was announced on 5 June. Technical concerns regarding ghosting issues, particularly in the CBD area, were raised. The service began its trial run from 3 pm to 9 pm on 17 June. SBC Text officially launched on 1 August 1983. Initial reactions were mixed: while some users (like the Hilton International Hotel) were favourable, bankers and stock brokers gave negative reviews, noting the service catered more to the \"home market\" and that the information was several hours out-of-date compared to similar services abroad. Some hotel initially withheld adoption due to financial constraints. Due to \"popular demand from businessmen\", SBC expanded the service to start an hour earlier (6 am) effective 1 February 1984. By October 1984, the user base had grown from 3,000 to 25,000 (representing 5% of TV sets in Singapore). The number of pages was increased from 100 to 300 to enhance certain information sections. The bus guide was removed in 1986 due to limited usage. The service was renamed INtv on 18 January 1993. The rebrand introduced the Newsreel function for news updates and Fastext shortcuts. The simulcast on SBC 8 was briefly halted due to a techncial update that day. This revamp coincided with [Singapore Telecom](/wiki/Singtel)'s launch of the similar *Teleview* service, though SBC maintained the two services were different and not in competition. Intv temporarily halted service on 10 December 1993 after its data lines were accidentally cut, but most services were restored that day. A PC version, Networked INtv, developed by the Network Technology Research Centre of [Nanyang Technical University](/wiki/Nanyang_Technological_University), was publicly released in January 1994. The service was expended to *Channel News Asia* upon the channel's launch on 1 March 1999. It became available 24/7 from late September 2001. The Teletext Classifieds section was shut down on 1 September 2012. On 3 September 2013, MediaCorp announced that the entire service will be discontinued from 30 September of that year, citing “declining usage”. ## Content Teletext was organised across the three MediaCorp channels to specialise in specific types of information: Channel 5 specialised in entertainment and lifestyle information, Channel 8 specialised in Classifieds, and Channel NewsAsia specialised in business information. ChannelContent (page series)MediaCorp Channel 5 - News (100s) - Financial News & Stocks (200s) - SGX (300s) - Information (500s) - Leisure (850s) MediaCorp Channel 8 - Classifieds (closed on 1 September 2012) (160s, 200s, 300s and 500s) - Vehicles (500s) - Leisure (850s) Channel NewsAsia - News (100s) - Financial News & Stocks (200s) - SGX (300s) - Financial Information (450, 480 & 490) - Information (500s) - Leisure (850s) ### Teletext Online When the service was still online, the Teletext versions of all three channels were available for browsing via the Internet and features a nearly up-to-date version of the Teletext shown on television (delays might be up to 10 minutes). As with the Teletext on television, this service is now discontinued. - Teletext Online\n",
  "language": "en",
  "processed_at": "2026-01-12T11:32:31.120732",
  "title": "MediaCorp Teletext",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/MediaCorp_Teletext"
}