{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:32:39.373884"
  },
  "content": "Singaporean state-owned media company **Mediacorp Pte. Ltd.** is the [state-owned](/wiki/State_media) [media conglomerate](/wiki/Media_conglomerate) of Singapore. Owned by [Temasek Holdings](/wiki/Temasek_Holdings)—the investment arm of the [Government of Singapore](/wiki/Government_of_Singapore)—it owns and operates television channels, [radio](/wiki/Radio), and [digital media](/wiki/Digital_media) properties. It is currently headquartered at the Mediapolis development in Queenstown's [One-north](/wiki/One-north) precinct, which succeeded [Caldecott Hill](/wiki/Caldecott_Hill), the long-time home of its predecessors, in 2015. As of 2022, Mediacorp employs over 3,000 employees; a large number of them are in both public and private sector broadcasting. The company forms half of the [mass media](/wiki/Mass_media_in_Singapore) [duopoly](/wiki/Duopoly) in the country alongside [SPH Media Trust](/wiki/SPH_Media_Trust); the company was established in its current form in 1999, following the 1994 privatization of one of its predecessors—the Singapore Broadcasting Corporation (SBC)—as a group of state-owned enterprises known as Singapore International Media. Mediacorp holds a monopoly on [terrestrial television](/wiki/Terrestrial_television) in Singapore, operating six channels broadcasting in the [official languages](/wiki/Languages_of_Singapore) of [English](/wiki/Singapore_English) ([Channel 5](/wiki/Channel_5_(Singaporean_TV_channel)) and the pan-Asian news channel [CNA](/wiki/CNA_(TV_network))), [Mandarin Chinese](/wiki/Singaporean_Mandarin) ([Channel 8](/wiki/Channel_8_(Singaporean_TV_channel)) and [Channel U](/wiki/Channel_U_(Singaporean_TV_channel))), [Malay](/wiki/Malay_language) ([Suria](/wiki/Suria_(TV_channel))), and [Tamil](/wiki/Tamil_language) ([Vasantham](/wiki/Vasantham_(TV_channel))), as well as the streaming service [meWatch](/wiki/MeWatch). It also operates eleven radio stations, and the websites *[Today](/wiki/Today_(website))* and *[8days](/wiki/8days)*—both of which had previously operated as print publications. Its monopoly on terrestrial television was briefly broken in the early-2000s by [SPH MediaWorks](/wiki/SPH_MediaWorks). In 2004, amid struggles at its two channels, SPH sold the MediaWorks subsidiary to MediaCorp in exchange for stakes in its television and publishing businesses; only its Chinese-language Channel U would continue under MediaCorp. SPH divested its stake in MediaCorp in 2017 after *Today* ceased print publication. ## History ### 1925–1965: Pre-independence era #### First experiments The history of radio broadcasting in Singapore began with the formation of the Amateur Wireless Society of Malaya (AWSM) in April 1925, which launched shortwave transmission from a studio in the Union Building at Collyer Quay using a 100-watt transmitter lent by the [Marconi Company](/wiki/Marconi_Company) under callsign 1SE (One Singapore Experimental). The transmissions could be received as far as [Penang](/wiki/Penang), albeit with atmospheric interferences at times. In 1930, Sir Earl from the Singapore Port Authority commenced its short wave broadcast every fortnight either on Sundays or Wednesdays. The [Empire Service](/wiki/BBC_World_Service) of the [British Broadcasting Corporation](/wiki/BBC) (BBC) was inaugurated on 19 December 1932, broadcasting on [shortwave](/wiki/Shortwave_listening) and aimed principally at [English speakers](/wiki/English_language) across the [British Empire](/wiki/British_Empire). In his first [Christmas Message](/wiki/Royal_Christmas_Message#The_1932_Christmas_Message) (1932), [King George V](/wiki/King_George_V) characterised the service as intended for \"men and women, so cut off by the snow, the desert, or the sea, that only voices out of the air can reach them\". First hopes for the Empire Service were low. The [Director General](/wiki/Director-General_of_the_BBC), [Sir John Reith](/wiki/John_Reith,_1st_Baron_Reith), said in the opening programme: > Don't expect too much in the early days; for some time we shall transmit comparatively simple programmes, to give the best chance of intelligible reception and provide evidence as to the type of material most suitable for the service in each zone. The programmes will neither be very interesting nor very good. In 1933, Radio ZHI was launched as the first professional shortwave broadcasting station in Singapore. Owned by the Radio Service Company of Malaya, it was a shortwave radio station that delivered static-free broadcasts. Radio ZHI acquired a loyal following in Singapore and abroad. Despite its success, the station closed at the end of December 1936 when its license expired because the British Malaya Broadcasting Corporation was granted the status of having the radio monopoly. #### British Malaya Broadcasting Corporation The **British Malaya Broadcasting Corporation** (**BMBC**) was created on 12 April 1935 with a nominal capital of $500,000, formed on 21 July 1935 and awarded a broadcasting license by the [British crown](/wiki/British_crown) on 1 June 1936 as a radio network. The station was initially scheduled to start broadcasting in 1935, but was subsequently delayed to 1936 due to initial government uncertainties. The station broadcast from the hill on Thomson Road. ZHL made its first broadcast of Chinese music on 10 June 1936 as an experiment. The BMBC conducted auditions in November 1936. On 1 March 1937 at 6pm, its studios and transmitters at [Caldecott Hill](/wiki/Caldecott_Hill) were officially opened by [Governor of the Straits Settlements](/wiki/List_of_governors_of_the_Straits_Settlements) [Shenton Thomas](/wiki/Shenton_Thomas), aiming at a potential target audience of 10,000 listeners. In a move to adjust its budget, BMBC cut the number of weekly hours in late June 1937, from the initial 34 3/4 hours to 28 3/4. The Sunday schedule was cut from seven hours to four: before the revision, the daytime period ran from 11am to 1:30pm and the evening period from 5:30pm to 10pm. This was cut to 11:30am to 1:30pm for the daytime period (reducing half an hour) and 6pm to 8pm for the evening period (cutting two and a half hours). On weekdays the schedule ran from 6pm to 10pm, simply cutting the last quarter hour on air (before then, the station closed at 10:15pm). On Saturdays, the afternoon period remained in the 12:45pm to 2pm slot, but the evening period, starting at 6pm, now ended at 9:35pm instead of 11:15pm. This also prompted ZHL to reduce the number of artists to those able to perform without paying fees. Juvenile sessions were dropped because the artists had paid more. The existing charter suggested that the daily schedule would last at least four hours, with extensions depending on listener feedback. Any potential expansion was hampered purely by lack of budget. The monthly income was of $3,500, $2,500 from the licence and $1,000 from the Municipality. There were hopes to increase the income due to the start of sponsored programmes. Plans for shortwave broadcasting had been outlined in July 1937, despite concerns over the quality of its reception. In its first trimester on air, the BMBC was operating at a loss, a cause of \"grave concern\" for the staff. Work on the shortwave BMBC station started in October 1937, aiming at a March 1938 launch date. The station was to broadcast at a frequency of 31.48 meters daytime and 49.9 meters nighttime. The programming would be the same as the existing medium wave ZHL station. In January 1938, it was announced that the BMBC would cease receiving its monthly $1,000 grant from the municipality effective the end of February. In the year ending February 28, 1938, the BMBC was operating at a net profit of $275.88; compared to the loss of $5,368.67 The number of listeners now stood at 4,213, up from the initial figure of 2,598 - even so, the figure was relatively lower than the planned target of 10,000 in the formal launch the previous year. Ahead of the start of the shortwave service, it was reported that it would be picked up by over 9,000 radio receivers in Malaya - combined with over 4,000 in Singapore, the number of potential listeners was going to increase threefold. The station started on 19 July 1938 under the callsign **ZHP** (the \"P\" stood for \"**P**rogress\") attracting an audience not just in Malaya, but also in Sarawak, Borneo and the Dutch Indies, especially in tin mines and rubber estates. Thanks to the wider coverage range of ZHP, ZHL was able to broadcast more sporting events, namely horse races, tennis and the football, specifically the [Malayan Cup](/wiki/Malaysian_Cup). Before the change in policy, it was more likely for attendees to go to the matches. The shortwave frequency moved in on 1 October 1938 from 30.96 meters to 48.58 meters, under the new callsign **ZHO**, at the request of the Posts and Telegraphs Department. The extant medium wave frequency (225 metres or 1333kc) remained unchanged. In February 1939, the government started giving aid to the BMBC. The listener base was by then upgraded to 15,000 listeners: 5,000 in Singapore, a further 5,000 in the Federated Malay States, 2,000 in Penang, 1,000 in Johor and 350 in Malacca. Statistically, out of the 5,104 licence holders (number of receivers) in Singapore, 2,574 were Europeans and Eurasians, 2,023 were Chinese, 219 were Malays, 195 were Indians, 87 were Japanese and six were Siamese. The shortwave transmitter carrying ZHO upgraded its power in mid-1939, from 400 watts to 2 kilowatts. At the 1939 Annual Report, there were plans to create two separate services, an 8+1⁄2-hour European service and a 9+1⁄2-hour Asiatic one. Included in the proposal was the creation of a second medium wave transmitter for the two programmes to be delivered from the extant facilities. Subsequently, a second plan to increase the power of the shortwave transmitter was held in early 1940, this time increasing its coverage to reach out to the entirety of Malaya, Borneo, the Netherlands Indies and Siam. Much of the equipment used was already manufactured in Singapore. #### Malaya Broadcasting Corporation The corporation was taken over by the [Straits Settlements](/wiki/Straits_Settlements) government in 1940 as a part of the British Department of Information, subsequently nationalised and reorganised as the Malaya Broadcasting Corporation (MBC), the local counterpart to the [British Broadcasting Corporation](/wiki/BBC) (BBC). Additional [French](/wiki/French_language) programming was added on 16 September 1940. In order to counter German propaganda, a second shortwave transmitter was added on 29 September 1940, ZHP 3 (the existing transmitter was renamed ZHP 1). The station carried a special programme in German on Friday nights from 10pm to 10:30pm. The remainder of the line-up consisted of music and news, in [Hindustani](/wiki/Hindi_language), [Dutch](/wiki/Dutch_language), [Tamil](/wiki/Tamil_language), [Arabic](/wiki/Arabic_language) and French. ZHL and ZHP 1 carried primarily content in English and Chinese dialects, with some Malay programming as well. By April 1941 ZHP 2 was activated. The station was merely a relayer of ZHL's output, that was also heard on ZHP 1. #### Syonan Broadcasting Station During World War II, when the Japanese Imperial Army occupied Singapore from 1942 to 1945, the radio station on the island of Singapore was seized by the Japanese authorities and renamed Syonan Hoso Kyoku ('Light of the South' Broadcasting Corporation, 昭南放送局, known in English as the Syonan Broadcasting Station or SBS), the local counterpart to the [Japan Broadcasting Corporation](/wiki/NHK) (NHK). Broadcasts under the new administration started on 13 March 1942 and broadcast over three frequencies, one in medium wave for within Singapore, another to relay output from Tokyo and a shortwave frequency aimed at the time in Australia. After repairs, broadcasts officially started on 28 March. Programming was at the outset of occupation airing daily from 7pm to 10pm (later the closing time moved to 10:30pm) with an additional hour-long period from 10am to 11am for educational programming. Programming was still in the same mix of languages as before but content in Japanese was added. In June 1942, the Syonan station broadcast [Japanese language](/wiki/Japanese_language) learning classes to students, installing sets in 87 schools. During occupation, a confidential British Far Eastern Broadcasting Service (BFEBS) was carried out by the UK to its occupied territories, briefly having its offices at Caldecott Hill. The facilities were later used as a relay station for the BBC. #### Radio Singapore After the war, the British came back into power and reclaimed the radio station, with the station managed by the interim government – British Military Administration (BMA). Two separate stations were introduced from 23 December 1945. The existing service was renamed **Blue Network**, carrying programming in English and Malay. The second service, the **Red Network**, carried content in Tamil, Hindustani and Chinese dialects. The Blue Network was carried on the 41,61,225 metre band and the Red Network, on the 41,61,300 metre band. On 1 April 1946, Radio Malaya Singapore and the Federation of Malaya (RMSFOM; or Radio Malaya), a short- and mediumwave service, was established in Singapore. Radio news and information, as well as local entertainment, were aired on its stations in English and later [Mandarin Chinese](/wiki/Mandarin_Chinese) and [Malay](/wiki/Malay_(language)). In June 1947, the BBC initiated a one-year takeover plan of the BFEBS. The plan was culminated on 8 August 1948. Changes to programming led to the Blue Network adding some Chinese content on from 1 January 1949. Both networks increased their airtime. This was due to requests from individual communities, who demanded more programmes for them. The Chinese output gained its own station on 1 January 1951, the **Green Network**. Radio Malaya left the [Cathay building](/wiki/Cathay_Building) on 4 November 1951 at closedown. The two networks increased their schedule again in January 1952. On the basis of the Radio Malaya broadcasters that moved to Kuala Lumpur in 1958, Radio Singapura took over on 4 January 1959 as the radio service for Singapore, organised into a station each for English, Malay and Mandarin listeners, plus a blocktime slot for Tamil speakers. Shortwave broadcasts commenced on 14 February 1960, consisting of relays of extant Radio Singapore output. The frequency changed in 1961, with test transmissions in the new frequencies (7250, 6175, 6615 and 4280) were carried from mid-January. A new radio station, *Siaran Istimewa*, was announced in May 1961 as the nation's first multilingual radio station signing on offially on 3 June, with programming in all 4 languages airing on the 990 kc (990 kHz) band. When Singapore joined Malaysia on 16 September 1963, Radio Singapura's stations became part of Radio Malaysia and rebranded as \"Radio Malaysia (Singapura)\". From 2 March 1964, the Malay, Tamil and Mandarin language divisions increased their airtime. The number of radio news bulletins was increased from 29 to 42. On 15 June 1967, a fire started in the radio station's record library at [Caldecott Hill](/wiki/Caldecott_Hill). 16 hours later, the fire was extinguished. The entire library, comprising about 80,000 to 85,000 records valued at $150,000, had been destroyed. #### Television broadcasting Shortly after Singapore [reached self-government status](/wiki/Self-governance_of_Singapore) on 3 June 1959, there were plans to obtain television transmission rights. This manifested the founding of Television Singapura on 4 April 1961. *Television Singapura* aired test broadcasts on channel 5 from 21 January to 15 February 1963, ahead of its first official [pilot broadcast](/wiki/Soft_launch) on the evening of 15 February 1963. Minister for Culture [S. Rajaratnam](/wiki/S._Rajaratnam) became the first person to appear on Singapore TV, announcing that \"Tonight might well mark the start of a social and cultural revolution in our lives.\" The first programme aired was a documentary, *TV Looks at Singapore*. The pilot service would broadcast for one hour and 40 minutes nightly; at the time, it was estimated that only one in 58 Singaporeans owned a television. On 2 April 1963, Channel 5 was officially inaugurated by [Yang di-Pertuan Negara](/wiki/Yang_di-Pertuan_Negara) [Yusof Ishak](/wiki/Yusof_bin_Ishak); the service expanded to 7:15 to 11:00 p.m. nightly. By September, its broadcast day had been lengthened to begin at 6:30 p.m. Initially, Channel 5 carried programmes in all four of [Singapore's official languages](/wiki/Languages_of_Singapore). On 31 August, [Channel 8](/wiki/Channel_8_(Singaporean_TV_channel)) started trial broadcasts, before starting its regular service on 23 November 1963. In January 1964, Television Singapura became the state branch of the new [Televisyen Malaysia](/wiki/Radio_Televisyen_Malaysia) from Kuala Lumpur and was subsequently rebranded as sister channel \"Television Malaysia (Singapura)\". [During its time as part of Malaysia](/wiki/Singapore_in_Malaysia), Singapore, like its three other partners–Sabah, Sarawak and Malaya—had its own radio network, but Singapore was the only state to have its own television network. The state's radio and television broadcast right was included as an annex in the [Malaysia Agreement](/wiki/Malaysia_Agreement#Documents) which garnered autonomy in this area, among others. Television advertising started on 15 January 1964. ### 1965–1980: Radio Television Singapore After the separation of Singapore from the Malaysian federation, its radio and television outlets became part of Radio Television Singapore (RTS), a division of the Ministry of Culture. This led to expansions of the network, including a move to the new $3.6 million Television Centre at Caldecott Hill on 27 August 1966. Within days of independence, TV Singapura's main studio was damaged by a fire on the afternoon of 16 August 1965; this did not affect Radio Singapore's broadcasts. An FM service was announced in January 1967, set to start in June or July of that year, where the four existing stations would be relayed. The experimental FM service started testing in May 1967 and upgraded to a pilot service on 23 June, with FM being ideal for Singapore's size. The service went regular on 15 July, broadcasting over five frequencies: 94.2 (Malay), 95.8 and 96.8 (Chinese), 96.8 (Tamil) and 92.4 (English). Test broadcasts of the FM Stereo service started on 18 July 1969 using the 92.4 frequency. New radio studios were built in 1972, starting with the addition of the Radio House, then in 1975 by a new complex costing $4.2 million. From 30 March 1973, Channel 5 began focusing on English and Malay-language programmes, while Channel 8 would focus on Chinese- and Tamil-language programmes. On 24 October 1973, RTS aired a 40-minute documentary titled *Addiction: Three Experiences*, chronicling the lives of three drug addicts. The documentary was given a Special Commendation by the [Asia-Pacific Broadcasting Union](/wiki/Asia-Pacific_Broadcasting_Union) in 1974. In January 1974, RTS bought two [colour television](/wiki/Color_television) transmitters worth $700,000. The old transmitters installed in 1966 would remain as standby equipment. On 2 May 1974, the two channels conducted colour test broadcasts of *[The Mary Tyler Moore Show](/wiki/The_Mary_Tyler_Moore_Show)*, followed in July by its first live colour broadcast—the [1974 FIFA World Cup final](/wiki/1974_FIFA_World_Cup_final). About 2,000 colour television sets were sold in Singapore three days before the match. The first locally produced colour production was officially *Anatomi Perbarisan* ('Anatomy of a Parade') documenting preparations for the 9th [National Day Parade](/wiki/Singapore_National_Day_parade) airing on 1 August 1974; the parade would be its first live broadcast produced on the 9th. The second phase of the pilot colour service began on 11 November 1974, with newsreels being converted to colour, but it still had to air monochrome newsreels because some of the footage available was still in black and white. The number of weekly hours given to colour programming increased from two to four on weekdays and four to six on weekends. Full-time colour broadcasts began on 1 November 1977.[*citation needed*] RTS radio stations began extending broadcasting hours of programmes in stereo on 3 April 1978, adding technical costs to the broadcaster. In accordance with the [1975 Geneva Frequency Plan](/wiki/Geneva_Frequency_Plan_of_1975), the RTS radio stations moved their frequencies effective 23 November 1978: - English Service: 630 kHz - Chinese Service: 680 kHz → 675 kHz - Multilanguage Service: 790 kHz → 792 kHz - Malay Service: 990 kHz - Tamil Service: 1370 kHz → 1368 kHz Since their frequencies were already spaced in the multiples of 9 kHz before the Geneva Frequency Plan, the English and Malay stations had their frequencies unchanged. ### 1980–1994: Singapore Broadcasting Corporation The ability for RTS to grow was hampered by administrative and budgetary constraints, leading to frequent turnover in staff, and a reliance on imported programmes rather than domestic productions. In September 1979, an act was proposed in the [Parliament of Singapore](/wiki/Parliament_of_Singapore) to separate RTS from the Ministry of Culture, and replace it with a new statutory body known as the Singapore Broadcasting Corporation (SBC). The SBC was envisioned as an autonomous, state-owned enterprise akin to [Singapore Airlines](/wiki/Singapore_Airlines) and comparable to the BBC in the United Kingdom and its neighbours' RTM and TVRI. The SBC Act was approved in parliament on 12 January 1980. The government officially dissolved RTS on 31 January 1980 and transferred its assets to the SBC. The rebrand was not ceremonious. Ahead of closedown, an announcement was made telling viewers of the rename. The following morning, at 6 a.m., SBC formally started with no preamble, with the only visible changes being a new interim [wordmark](/wiki/Wordmark) logo, updated [startup and closedown](/wiki/Sign-on_and_sign-off) sequences, and a new news intro. Its programming had not changed much following the relaunch, to the point that some viewers mockingly said that \"SBC\" stood for \"Same Boring Channel\", while some confusing it for the [Singapore Bus Service](/wiki/SBS_Transit) (SBS) and others pejoratively nicknaming it \"**s**i **b**ei **c**ham\" which meant \"damn terrible\" in Hokkien. SBC introduced \"weather girls\" on 1 May 1980 for its English news broadcasts, before expanding to other languages in 1981. The format ended in March 1982 because it wanted the weather report to be the same as the other languages and the \"weather report within the news bulletin was adequate\". From June 1980, SBC would start sponsoring the [clock before the news](/wiki/Clock_ident) on its television channels, which it anticipated could bring in an additional S$1 million in revenue. SBC began adapting a new format for its television news broadcasts in August 1980. The new format would feature two newscasters and more on-location reporting. SBC introduced [political party broadcasts](/wiki/Party_political_broadcast) for the [1980 general election](/wiki/1980_Singaporean_general_election) campaign on 17 December 1980, with the People's Action Party getting 12 minutes of broadcast, the United Front and the Workers' Party three minutes each and United People's Front three and a half minutes. The shortest available broadcasts were for parties with six candidates with two and a half minutes. The participating parties were required to send five copies of their manifestos to SBC. A final broadcast was held on 22 December. The English-language current affairs programme *Friday Background* debuted in March 1981. In April 1981, to maximise SBC's resources in improving its sports presentation, the Malay and Chinese versions of the corporation's sports programme *Sports Parade* were cancelled; the programme now only airs in English. In May 1981, on the day President [Benjamin Sheares](/wiki/Benjamin_Sheares) was pronounced dead, SBC's television channels cancelled their regular programming and replaced them with \"solemn music and serious documentaries\". The next day, the corporation aired two episodes of *Destiny* and an episode of *Sandiwara*, which SBC thinks were too serious to be aired. SBC also decided not to repeat the state funeral of Sheares because it would \"lend levity to a sad occasion\". On 1 January 1982, SBC renamed its radio stations: - Radio 1 (English; present-day Gold 905) - Radio 2 (Malay; present-day Warna 942) - Radio 3 (Chinese; present-day Capital 958) - Radio 4 (Tamil 6am to 9pm and Chinese 9pm to midnight; present-day Oli 968) - Radio 5 (Classical Music, the former FM Stereo; present-day Symphony 924) The revamp was the result of a 1978 survey where listeners preferred entertainment programming over talk. On 30 March 1982, SBC 5 began airing the children's storytelling programme *Share A Story,* with the Tuesday's broadcast aimed at 3 to 5-year-old children and the Thursday's broadcast aimed at 6 to 9-year-old children. In 1982, commercial breaks during prime time on SBC 5 were four minutes long with six to nine advertisements squeezed in, while SBC 8's were eight to ten minutes. On 1 February 1983, SBC's television news broadcasts received a new studio set, described as \"duck-egg blue\" and \"three-dimensional\". A special semi-circular table was created for the set. The previous set was \"pink\" in colour. The new set was inspired from news and current affairs programmes in the United States. Other changes include each newscaster reading different stories and more graphics and illustrations. The next day, SBC launched *Newswatch*, a children's news programme aimed at 10 to 14-year-old children It would air three times a week for 10 minutes; every Monday, Wednesday and Friday at 7:20 pm. The idea for *Newswatch* was suggested by the-then Cultural Minister in 1980 and planning for its creation started the following year, involving the studying of similar news programmes such as *[John Craven's Newsround](/wiki/Newsround)* and *Video Despatch*. The development for Newswatch was headed by SBC news executive Myrna Thomas and is assisted by William Earl of [Television New Zealand](/wiki/TVNZ). The initial presenters of *Newswatch* were Woon Liew and Shantini Sundram. Toh Seng Ling, who presented Newswatch in 1990, would later become the newscaster for *News 5 Tonight* in April 2001. SBC Radio 1 and SBC Radio 3 started carrying hourly news bulletins on 1 May 1983. It also planned the creation of a subscription-based electronic tape lending service, as well as a subscription television service. On 31 January 1984, SBC launched [Channel 12](/wiki/Suria_(TV_channel)), a new television service devoted to cultural programming. In connection to its launch, the English and Mandarin news bulletins had their length extended to 30 minutes the following day. The move was taken considering mass interest in Cantonese productions in Malaysia, as well as the limited number of Mandarin speakers in the country. Musical programmes were also included in the agreement, and would also be distributed to Australia, New Zealand, Taiwan, Europe and North America. On 30 July, SBC started dubbing its series to [Cantonese](/wiki/Cantonese_language) for the video market in Malaysia, in a contract with Unity Records that was valid from 1 September. SBC began on-camera coverage of Parliament proceedings in 1985. *Today in Parliament* began on 1 March 1985 with a one-hour long broadcast. Studio 6, a studio specially made for local programmes especially dramas, was completed in early 1985. Advertisements on SBC in 1986 were limited to four for a half-hour programme and eight for an hour-hong programme. In May 1986, SBC introduced \"subtitle ads\", advertisements appearing as a single-line sentence or one letter at a time and appear for 10 seconds. This format is used to compensate for the advertisement limit imposed by the corporation. However, they only appear on programmes that do not have translation subtitles. While this advertisement format enabled more companies to advertise on television due to its cheaper rates, it has caused irritation among viewers. On 3 August 1987, by request from listeners overseas, SBC began adding financial news bulletins from Radio 5 on the shortwave versions of Radio 1 and 3, while FM and mediumwave listeners can tune in to regular programming during the bulletin. A new computer was installed that same year, improving the graphics and the opening titles of its television programmes. It was first used for the 1987 National Day Parade and was gradually rolled out over the course of the next year. In August 1988, SBC news broadcasts adopted a new \"upbeat and viewer-friendly\" look. The backdrop is now that of the skyline of Singapore. It generated positive response from viewers. On 1 January 1989, SBC launched two new radio stations: [Perfect 10](/wiki/987FM) (airing English contemporary hits for youth) and [YES](/wiki/YES_933) (airing Mandarin music). SBC stopped airing Late News bulletins on Channel 12 in English and Channel 8 in Mandarin on 2 January 1989 due to fewer news developments happening between the main news and the late news bulletins. Two further radio services were announced in December 1989: 93.3 (airing Mandarin music) and a yet-unnamed MOR service (which would later become [Class 95](/wiki/Class_95_(radio_station))). The former was scheduled to launch on 1 January 1990, similar to Perfect 10 the year before. The existing numbered radio services had some changes: broadcasting hours on Radios 2 and 4 (Malay and Tamil) were extended to 2 a.m. in June 1989, along with Radio 3 (Chinese) but only on Fridays, Saturdays and the eve of public holidays, and Mandarin language broadcasts were phased out from Radio 5. The MOR service, Class 95, started on 1 April 1990. \"Ria\" (airing popular Malay music) started later. 93.3 at its beginning was also known as **Radio 6**. The station would also have the same broadcasting hours as almost all of SBC's radio stations. SBC announced on 21 February 1990 that it would begin [NICAM](/wiki/NICAM) stereo broadcasts by August that year, spending $3.5 million in the installation of the systems. Channel 5 began stereo broadcasting on 8 August 1990, the first programme in the new format being *Countdown to National Day 90*. With the start of stereo broadcasts, SBC invested $5 million to upgrade its production facilities for the new technology. Channel 12 followed in December. Additionally, SBC had further ambitious projects throughout the 90s, costing a grand total of $700 million: a new studio complex, upgraded equipment and transmission facilities and the development of new programmes and staff. To minimize congestion from Caldecott Hill, a second facility was to be opened tentatively from [Bukit Batok](/wiki/Bukit_Batok), the location of the television transmitter. By the early 90s, SBC's Mandarin drama series were already being exported to places such as China and Canada. Four of the five numbered SBC radio stations got their names changed over the course of several months from late 1991 to early 1992. Radio 2 was renamed Warna; Radio 3, The City Channel; Radio 4, Olikkalanjiam and Radio 5, Symphony. Radio 1 maintained its name since the station was \"well established as a leader\". However, it was all to meet a new competition: the [National Trades Union Congress](/wiki/National_Trades_Union_Congress), which launched its radio service in March 1991, ending the long monopoly of the SBC radio network in Singapore. Today the two NTUC radio stations are part of [SPH Media](/wiki/SPH_Media). SBC began accepting programmes from production houses in 1992. One of the first programmes commissioned was Kalau Dapur Tak Berasap from Communications 2000. SBC ended live broadcasts of parliament proceedings in June 1992; earlier the corporation trialed broadcasts of the Budget debate. SBC's highlights of parliament coverage continued but only as a 15-minute broadcast. In January 1993, SBC added 20 hours a week of broadcasting hours for its television channels. As a result, each channel refined its identity – SBC 5 will only air English and Malay shows, SBC 8 with Mandarin and Tamil and SBC 12 with \"serious fare\" and sports. Some programmes were reshuffled, while newer programme genres, including talk shows and classic TV in the form of sitcom reruns were introduced. The corporation also introduced [block programming](/wiki/Block_programming); originally began in 1992 with the Saturday morning cartoon slot \"Nine to Twelve\". An educational programming block known as CDIS (Curriculum Development Institute of Singapore) began airing on Channel 12 on 4 January 1993 produced by the Ministry of Education for SBC similar to Malaysia's [TV Pendidikan](/wiki/TV_Pendidikan) and the then Indonesian [TPI](/wiki/MNCTV) [blocktime service](/wiki/Brokered_programming) on [TVRI](/wiki/TVRI). On 1 February of that year, SBC celebrated its 30 years of television broadcasting. Before 7 June 1993 Channel 8 continued to sign-on as late as 5:50pm, On that day itself, Channel 8 expanded its airtime, now broadcasting from 3:00 p.m. on weekdays and from 9:00 a.m on Saturdays (3:00 p.m before the increase). In November that year, SBC announced a satellite television network named [Singapore International Television](/wiki/Singapore_International_Television) (SITV), to start on 1 January 1994. The service was to be operated by the Singapore International Foundation (SIF) with the aim of promoting the Singaporean way of life abroad, and was to broadcast over a rented transponder in the Palapa satellite from 10:00 p.m. to 11:00 p.m. nightly. By 1993, SBC had ambitions to produce more local content and broadcasting hours on channels 5 and 12, with Malay content scheduled to move to Channel 12. Channel 8 would stick to the existing formula of Mandarin and Tamil. SBC made its first attempt at producing an English drama by producing the made-for-TV movie *Time Tomorrow*, which aired on 9 March 1993. In 1993, SBC launched a [home shopping](/wiki/Informercial) programme called *Sell-a-Vision* (provided by [Quantum International](/wiki/Quantum_International) and represented locally by LeisureMart Pte Ltd) which broadcast twice daily for two hours a day on its television channels and was expected to run until May 1994. However, *The Straits Times* writer Cherian George mentioned that *Sell-a-Vision* was not part of SBC's twelve minutes of advertising per hour rule. It would also expand to SBC 8 in October 1994. On 1 January 1994, Channel 5 moved its remaining Malay programming to Channel 12, and re-launched as an English-language channel. On the same day, AM radio broadcasts were cut without prior warning. Radio Singapore International (RSI) was launched on 1 February 1994 as the official radio international broadcasting company in Singapore, airing news and current affairs, lifestyle, and music programming in English, Malay, Mandarin and [Indonesian](/wiki/Indonesian_language). SBC began preparing for 24 hour broadcasts for its information-based radio stations in late 1993. 93.3 started 24 hour broadcasts on 1 May 1994; Radio One on 16 May 1994; Class 95 in June and City Sounds 95.8 in October (later moved to December). [Love 97.2](/wiki/Love_972) launched on 23 September 1994, playing sentimental Mandarin pop music. ### 1994–1999: Privatisation On 18 December 1991, the Minister of Information and the Arts [George Yeo](/wiki/George_Yeo) announced that the Singapore Broadcasting Corporation was to be [privatised](/wiki/Privately_held_company) within a period of two years. Its three television channels would be placed under the control of \"two or three companies\" and the radio stations spun off to a separate company. There were already talks with foreign investors from Hong Kong and the United States regarding the possibility of allowing potential stakes in the new companies. The decision was delayed in March 1993 from year-end 1993 to year-end 1994 to allow for greater competition in the region and abroad. SBC held a committee for the names of the new corporations. One peculiar suggestion came from lettering artist Rathna Kumari, who suggested that the facilities service was to be called \"The Backbone\", the radio network \"Silksound\" and the company in charge of channels 5 and 8 \"FutureVision\". In September 1993, SBC announced that Malay programming would be moved to SBC 12 and expanded, and SBC 5 would become an English-language channel. On 1 January 1994, SBC 5 relaunched with its new English-language format as Channel 5. Singapore International Television launched the same day, broadcasting an hour of programming for international audiences nightly via satellite; the channel opened with a special edition of Channel 5's *Inside Asia* followed by a relay of its 10:30 p.m. news. The first half hour was to be devoted to current affairs and lifestyle programming. Radio Singapore International (RSI) was launched on 1 February 1994 as the official international radio broadcasting company in Singapore, airing news and current affairs, lifestyle, and music programming in English, Malay, Mandarin, [Indonesian](/wiki/Indonesian_language) and [Filipino](/wiki/Filipino_language). 93.3 started 24 hour broadcasts on 1 May 1994, followed by Radio One on 16 May 1994, Class 95 in June, and City Sounds 95.8 in December. [Love 97.2](/wiki/Love_972) launched on 23 September 1994, playing sentimental Mandarin pop music. On 1 October 1994, SBC was formally privatised into the new holding company Singapore International Media (SIM), with four business units: Television Corporation of Singapore (TCS, which controlled Channel 5 and 8), Radio Corporation of Singapore (RCS), [Singapore Television Twelve](/wiki/Mediacorp_TV12) (STV12, which controlled Channel 12) and SIM Communications (SIMCOM). The Singapore Broadcasting Authority allocated $40 million per annum of money to TV12 to provide 45 out of the 60 hours a week of public service broadcasting, with 19 hours for arts, sports and culture programming, 15 for Malay programming and 11 for Indian programming. The rest of the hours was funded by TV12. In early 1995, TCS scrapped the duty officers, who were responsible to gauge feedback from viewers. The programme advisory committee – which were made up of members of the public and were useful for internal check – were also scrapped. TV12 moved to the Bestway building sometime in July 1995. On 1 September 1995, Channel 8 expanded into a 24-hour network focusing exclusively on Mandarin-language programmes, while its Tamil programming was assumed by [Prime 12](/wiki/Suria_(TV_channel))—a relaunch of Channel 12 which focused on multilingual programming. TV12 also launched a UHF spin-off channel known as [Premiere 12](/wiki/Central_(TV_channel)), which featured arts, culture, documentaries, children's, and sports programmes. In October 1995, TV12 was originally asked by the Singapore Broadcasting Authority to launch another classical music station in response to changes in RCS' 92.4, but later turned down due to the lack of funding from the authorities. TCS viewed Channel 5 and Premiere 12 as practising \"complementary programming\" as much as possible, as Channel 5 was positioned as a mass appeal channel while TV12 catered to the special interest audience, with the latter promising to not appeal to the lowest common denominator. However, the separation of TCS and TV12 had caused the channels of both companies competing each other with similar programming at the same time slot, causing viewers to have less choice. Local programming production on TV12, especially Prime 12, is 60% coming from production houses while 40% comes from TV12 itself, using personnel from Vision Production. Mediacity, the holding's website, became operational in 1996. The new website offered information on TCS programmes and artistes and schedules for the TCS and STV12 channels. On the occasion of TCS' third anniversary, its executive Daniel Yun said that its two channels, Channel 5 and Channel 8 will become more Singaporean with increasing local productions and its viewers become increasingly bilingual. Yun pointed out that they are not just channels for the \"English-educated yuppie\" and \"the HDB heartlander\" respectively. In March 1998, George Yeo announced at the Parliament that RCS would launch three new radio stations later in the year – [NewsRadio 93.8](/wiki/CNA938), [Inter FM](/wiki/XFM_96.3) and an unnamed financial radio station. On 1 June, it launched 1-On-One, a video on demand website for subscribers of the Singapore broadband network Singapore One. On 1 March 1999, TCS launched [Channel NewsAsia](/wiki/CNA_(TV_network)) (CNA), a local [news channel](/wiki/News_channel). TCS launched its own film production studio [Raintree Pictures](/wiki/MediaCorp_Raintree_Pictures) on 1 August 1998. ### 1999–2015: Media Corporation of Singapore On 15 June 1999, the Singapore International Media group of companies restructured as the Media Corporation of Singapore (MediaCorp). The new name was created to avoid confusion with the [Singapore Institute of Management](/wiki/Singapore_Institute_of_Management). There were unfounded rumours of a merger between TCS and STV12, which were denied by Richard Tan. MediaCorp later announced the creation of new strategic business units in July: - TV Channel Management (channels 5 and 8, upcoming sports channel) - Public Broadcasting (Singapore Television Twelve, namely Prime 12 and Premiere 12) - Radio (12 stations owned by the Radio Corporation of Singapore) - TV/Film Production and Distribution (programme production and distribution units of TCS, STV12 and subsidiary companies) - News and Current Affairs (Channel NewsAsia) - Print Media (Caldecott Publishing) - Multimedia (multimedia units of all subsidiaries). On 30 January 2000, MediaCorp launched three new channels. Prime 12 and Premiere 12 were relaunched as [Suria](/wiki/Suria_(TV_channel)) and [Central](/wiki/Central_(TV_channel)) respectively; Suria would be a Malay-language channel, while Central would be divided into three dayparted [blocks](/wiki/Block_programming) under the brands \"Kids Central\" (children's programming), \"Vasantham Central\" (Tamil-language programming), and \"Arts Central\". [Sportscity](/wiki/City_TV_(Singapore)), a sports channel, was also launched the same day. In September 2000, CNA launched an international feed, intending to expand the service into a [pan-Asian](/wiki/Pan-Asian) network. On 10 November, [*Today*](/wiki/Today_(Singapore_newspaper)) was launched as a [free newspaper](/wiki/Free_newspaper) to compete with [Singapore Press Holdings](/wiki/Singapore_Press_Holdings)' *[Streats](/wiki/Streats)*. The newspaper was owned by MediaCorp, [Singtel](/wiki/SingTel), and [SMRT](/wiki/SMRT_Corporation), with [DelGro](/wiki/ComfortDelGro) pulling out two days earlier. Ernest Wong was appointed CEO of MediaCorp on 1 October 2000. He had worked with the corporation since 1994, when he joined the Audit Committee of what would become Singapore International Media. Among his accolades in the group were the start of its news channel and its international expansion, as well as the investment in the internet and theatrical businesses. At the time, the government planned to list MediaCorp on the stock market by the end of 2000 or the start of 2001. On 12 February 2001, MediaCorp completed its establishment of a new senior management team, with Wong serving as CEO of the holding company (Media Corporation of Singapore Pte Ltd) and MediaCorp TV, Farrell Meisel as [chief operating officer](/wiki/Chief_operating_officer) (COO) of MediaCorp, Kenneth Tan as COO of MediaCorp TV, Woon Tai Ho as COO of MediaCorp TV12, and Chua Foo Yong MediaCorp as COO of MediaCorp Radio. MediaCorp's monopoly on free-to-air television was broken in May 2001, when the Singapore government granted new free-to-air licenses to [SPH MediaWorks](/wiki/SPH_MediaWorks), a subsidiary of publisher Singapore Press Holdings. The company launched two channels in English and Chinese respectively, TVWorks (later [Channel i](/wiki/Channel_i_(Singaporean_TV_channel))) and [Channel U](/wiki/Channel_U_(Singaporean_TV_channel)). In late-2004, citing financial issues, SPH announced an agreement to merge its television business with that of Mediacorp; SPH would transfer Channel i and U to MediaCorp, take a 20% stake in MediaCorp TV, and a 40% stake in *Today*, while discontinuing its competing *Streats*. Channel i was shut down on 1 January 2005 as it was not considered to be economically viable, while Channel U continued as a complementary service to Channel 8. Alongside the takeover, Channel 8 amended its Chinese name from *Dì bā bō dào (*[Chinese](/wiki/Traditional_Chinese_characters): 第八波道) to *Bā píndào* ([Chinese](/wiki/Traditional_Chinese_characters): 八频道) to match the notation that had been used by Channel U ([Chinese](/wiki/Chinese_language): 优频道; [pinyin](/wiki/Pinyin): *Yōu píndào*); MediaCorp explained that the change was meant to reflect the integration of SPH and its ideas into the company. On 21 October 2004, Mediacorp hosted the first Singapore Radio Awards with nominations only open to its radio stations. In July 2005, Mediacorp renewed a transmission agreement with the [British Broadcasting Corporation](/wiki/British_Broadcasting_Corporation) (BBC) to extend the broadcast of the [BBC World Service Radio](/wiki/BBC_World_Service), which has been aired in Singapore since 1976. In May 2007, the company hired an experienced senior management staff team to help steer the company to strengthening position in the Asian region. On 11 November 2007, Mediacorp launched [HD5](/wiki/HD5_(Singaporean_TV_channel)), the first high definition television channel in Singapore. In 2007, in effort to establish a new generation of actresses, MediaCorp identified and grouped the seven most [promising](/wiki/Bankable_star) upcoming actresses from Singapore in the 2000s, namely [Jesseca Liu](/wiki/Jesseca_Liu), [Jeanette Aw](/wiki/Jeanette_Aw), [Rui En](/wiki/Rui_En), [Fiona Xie](/wiki/Fiona_Xie), [Joanne Peh](/wiki/Joanne_Peh), [Felicia Chin](/wiki/Felicia_Chin) and [Dawn Yeoh](/wiki/Dawn_Yeoh), then all in their twenties, and referred to them collectively as \"Seven Princesses of MediaCorp\" (新传媒七公主). A similar grouping of its male artistes for similar reasons was carried out in 2014, grouping eight promising upcoming Mediacorp actors from [Singapore](/wiki/Singapore) in the 2010s, namely [Zhang Zhenhuan](/wiki/Zhang_Zhenhuan_(actor)), [Romeo Tan](/wiki/Romeo_Tan), [Desmond Tan](/wiki/Desmond_Tan_(actor)), [Jeffrey Xu](/wiki/Jeffrey_Xu), [Xu Bin](/wiki/Xu_Bin), [Ian Fang](/wiki/Ian_Fang), [Aloysius Pang](/wiki/Aloysius_Pang) and [Shane Pow](/wiki/Shane_Pow), and were collectively known as the \"8 Dukes of Caldecott Hill\". All Mediacorp radio stations converted to 24/7 broadcasting from 1 January 2008. At the time, the only stations that still closed down were Capital 95.8, Ria 89.7, Symphony 92.4, 938LIVE and 96.3 The International Channel (renamed XFM later in 2008). In February, Mediacorp acquires 20% stake in Chinese outdoor advertising firm, Dahe Media, awhile at the same time, the company entered a strategic investment partnership with Vietnamese company, the International Media Corporation (IMC) in which they will \"look forward to lending [its] expertise in the areas of programming, branding, promotion, management and airtime sales\". In March 2008, it was announced that Central would be split into two separate channels, with Vasantham Central being spun-off as a full-time channel serving the Tamil community, and children's and arts programming moving to a new channel. The changes took effect in 19 October of that year, with the launch of the new [Vasantham](/wiki/Vasantham_(TV_channel)) and [Okto](/wiki/Okto) channels. In August 2008, MediaCorp also launched [MOBTV](/wiki/MOBTV), an online television service. Owing to the diminished effectiveness of a shortwave radio service over time with changing technology and media consumption habits, RSI was dissolved on 31 October 2008. In January 2009, Mediacorp established its Interactive Media Division where its online and mobile properties will be consolidated into a new division. In March, Mediacorp was among 6 ASEAN broadcasting companies including [Media Prima](/wiki/Media_Prima), [Media Nusantara Citra](/wiki/Media_Nusantara_Citra) (MNC) and [ABS-CBN Corporation](/wiki/ABS-CBN_Corporation) jointly to form a regional broadcasting alliance, [Smart Alliance](/wiki/Smart_Alliance) to carry out an alliance to cooperate in three areas—content, sales and marketing, and technology—and take advantage of economies of scale and combined markets that the region can offer. In December, the company began to phased out its cost-cutting measures and restoring full pay for its staffs. In 2009, Mediacorp was appointed as the media partner for the [World Expo 2010](/wiki/World_Expo_2010) in [Shanghai](/wiki/Shanghai) with [Channel NewsAsia](/wiki/Channel_NewsAsia) providing news coverage in a year-long partnership. The appointment makes the company became the first global media partner of the exhibition. Mediacorp had extended its partnership with the Japanese public broadcaster, [NHK](/wiki/NHK) for another 3 years, until 2012, during The Asian Pitch competition. In August 2009, Mediacorp Studios started a block on the [Philippine](/wiki/Philippines) network [TV5](/wiki/TV5_(Philippine_TV_network)), after doing so in Malaysia. In March 2010, the company signed a licensing deal with Global Yellow Pages in which the deal allows Mediacorp reproduced or using the latter's data on its online classified advertising platform Mocca on a \"revenue-sharing arrangement\". On 31 August 2010, MediaCorp acquired the broadcasting rights of [ABS-CBN](/wiki/ABS-CBN) drama series *[Tayong Dalawa](/wiki/Tayong_Dalawa)* to airing on [Channel 5](/wiki/Channel_5_(Singaporean_TV_channel)) as *The Two Of Us* with English-[dubbed](/wiki/Dubbing), English and Mandarin-[subtitled](/wiki/Subtitles), and [dual-language sound](/wiki/Multilingualism) ([English](/wiki/English_language) and [Filipino](/wiki/Filipino_language)) option. In March 2011, Mediacorp announced an \"organisational alignment and movements\" in its sales business which took effect on 1 April. On 12 August, Mediacorp selected [DP Architects](/wiki/DP_Architects) and Maki and Associates as the architects of its new campus, which to be located at Mediapolis@one-north. In 2012, the company partnered with French mobile advertising firm Sofialys \"to implement a new multi-platform advertising serving solution\". In August 2013, Mediacorp consolidated its sole Malay channel, [Suria](/wiki/Suria_(TV_channel)) and its two Malay radio stations, [Warna 942](/wiki/Warna_942) and [Ria 897](/wiki/Ria_897) into a new division, known as the Malay Broadcast Division. In April 2015, Mediacorp retrenched its 33 staffs as part of its corporate restructuring exercise. In June, Mediacorp set up its Digital Group to overseen products and services for online consumers and marketers. ### 2015–present: New headquarters and transition to digital On 8 December 2015, Mediacorp officially opened a new headquarters at [one-north](/wiki/One-north)'s Mediapolis development. The 12-storey complex was designed by [DP Architects](/wiki/DP_Architects) and Maki and Associates and features a \"fenceless\" design with four studios, a 1,500-seat \"broadcast-ready\" theatre, and an integrated multi-platform newsroom. The company expected to complete the migration from its previous [Caldecott Hill](/wiki/Caldecott_Hill) facilities by July 2016. Alongside the new headquarters, Mediacorp also unveiled a new logo, which was designed to reflect the broadcaster's \"vibrancy\" and \"multiplicity\", acting as an \"a window to the world and a reflection of life\". In April 2017, Mediacorp began to phase out print publication of *Today* by discontinuing its weekend editions. The weekday editions were then discontinued in September 2017, leaving *Today* as a digital publication. SPH would concurrently divest its stakes in Mediacorp for S$18 million. In September 2018, magazines [*8 Days*](/wiki/8_Days_(magazine)) and *i-Weekly* ceased print publications and went solely on their digital platforms. *i-Weekly* would later merge with *Channel 8 News* to form *[8world](/wiki/8world)* for Chinese news, entertainment and lifestyle contents. Analogue broadcasting of Mediacorp channels ended at midnight on 2 January 2019, transitioning exclusively to digital television. On 1 May 2019, Okto was discontinued as a standalone channel, with its children's programming becoming a daytime [block](/wiki/Block_programming) on Channel 5 under the *Okto on 5* branding. Okto's sports programming was moved primarily to other Mediacorp outlets. Channel 8 similarly rebranded its existing children's block as *Okto尽在8* (lit. *Okto on 8*) On 30 January 2020, Mediacorp rebranded its digital media platforms Toggle, MeRadio and MeClub as [meWatch](/wiki/MeWATCH), meListen and meRewards respectively. The rebranding came as part of the broadcaster's \"Made for You\" initiative to build multi-platform services \"designed around consumers' preferences and consumption habits\". The company partnered with technology company, Amobee on 24 February 2021 to launched Mediacorp AdDirect, a self-service advertising solution platform which \"provides an easy, efficient and effective way for businesses to reach their target customers\". In July 2022, Mediacorp collaborated with [Nanyang Polytechnic](/wiki/Nanyang_Polytechnic) to set up a new centre for omnichannel marketing to aid small and medium-sized enterprises (SMEs), which intended to \"provide training to SMEs\" and \"support them in planning, creating, and driving omnichannel marketing campaigns\". The company also partnered with [World Wide Fund for Nature](/wiki/World_Wide_Fund_for_Nature) (WWF) in November to produce science-based edutainment content for [Okto](/wiki/Okto) in order to \"build a factually accurate source of engaging edutainment for kids\". In December 2022, the company entered partnership with [YouTube](/wiki/YouTube), [The Pinkfong Company](/wiki/The_Pinkfong_Company) and Taiwan Creative Content Agency (TAICCA) to produce and acquire video content. On 16 January 2023, Mediacorp announced a rebranding of nearly all of its properties, which officially took effect on 1 February. The properties adopted a unified branding scheme based around [flat design](/wiki/Flat_design), with logos prefixed by an encircled Mediacorp insignia, and branding elements also incorporating a [chevron](/wiki/Chevron_(insignia)) formed from the top of the insignia. The company signed a deal with global technology research company, Ecosystm in May 2023 to engage with commercial and content collaborations. The deal combined Ecosystm's \"research and thought leadership\" with Mediacorp's \"creative capabilities and wide audience reach\". In December 2023, Mediacorp signed an agreement with Taiwanese production company Mission International for content development at the Asia TV Forum and Market (ATF). Both companies also will co-develop scripts ranging from different genres. The company announced a retrenchment of 93 staff (over 3% of its staff) on 1 September 2025 due to economic challenges and constant changes to the media landscape. ## Visual identity In honour of the impending launch of full-time colour broadcasts, RTS held a contest to design a new logo. After 662 submissions, the winning design by Loh Hong Liat and Lawrence Wong Heng Kwok was unveiled in August 1975. Lok designed the letters \"R and T\" which represent recording, while Wong designed the letter \"S\". A competition for a new SBC logo was initiated in January 1980. The characteristics of the new brand were to be \"simple and attractive\", while not having more than three colours, including the background. The winner would receive a cash prize worth $5,000. On 1 February 1980, SBC introduced a temporary wordmark. The new logo competition finished on 16 February. A preliminary selection was determined by five judges on 22 February. At first the logo was set to be introduced in March. A total of 4,042 entries were received. The new logo was unveiled to the public on 18 May 1980. The winner was Laurence Wong Heng Kwok—who had previously co-designed the RTS logo. Up until 1991, broadcasts of the television channels started and ended with multilingual greetings (Mandarin, Malay, Tamil, English), in what was known as the \"good-night girls\" saying \"Welcome\" for opening and \"Good Night\" for closing. The start-up and closedown sequence, including the [anthem](/wiki/Majulah_Singapura), was known in Singaporean terminology as a \"presso\". From then on, SBC replaced the videos, which changed annually, by a CGI animation created by Ong Lay Hong, that was to be used in both start-ups and closedowns. The new video bagged a bronze medal at the [Fuji Network System](/wiki/Fuji_Network_System) Title Fair in June 1991, out of more than thirty entries from Asia. Such animation conveyed \"human warmth\" by including footage from SBC programmes, and the music was arranged to match the multi-ethnic nature of Singapore, incorporating drum beats, sitars and violins. Mediacorp introduced its current logo on 8 December 2015. The flat version was in use from 1 February 2023. ## Services ### Television Mediacorp operates six commercially-supported terrestrial channels broadcast in the four [official languages](/wiki/Languages_of_Singapore) of the country ([Singapore English](/wiki/Singapore_English), [Mandarin Chinese](/wiki/Mandarin_Chinese), [Malay](/wiki/Malaysian_language) and [Tamil](/wiki/Tamil_language)). The company holds a [monopoly](/wiki/Monopoly) on [terrestrial television](/wiki/Terrestrial_television) within the country. NameLanguageProgramming[CNA](/wiki/CNA_(TV_network))English24-hour global news, current affairs and lifestyle[Channel 5](/wiki/Channel_5_(Singaporean_TV_channel))24-hour news, culture, entertainment and children[Channel 8](/wiki/Channel_8_(Singaporean_TV_channel))Chinese24-hour news, culture, entertainment and children[Channel U](/wiki/Channel_U_(Singaporean_TV_channel))News and entertainment[Suria](/wiki/Suria_(TV_channel))MalayNews, culture, entertainment and children[Vasantham](/wiki/Vasantham_(TV_channel))TamilNews, culture, entertainment and children ### Radio Mediacorp operates twelve [FM radio stations](/wiki/FM_broadcasting), with eleven domestic stations, as well as a relay of the [BBC World Service](/wiki/BBC_World_Service). The company's [digital audio broadcasting](/wiki/Digital_audio_broadcasting) service was discontinued on 1 December 2011. Mediacorp's stations dominate listenership in the country, owning all but one of the top ten stations in Singapore based on average listenership according to surveys by [Nielsen](/wiki/Nielsen_Corporation) in 2024, with its stations having an average weekly listenership of 3.93 million in total. It broadcasts on AM in the past until 1994 when it was cut with no warning. FrequencyStationLanguageFormat88.9 MHz[BBC World Service](/wiki/BBC_World_Service)English[News](/wiki/News_radio)/[Talk](/wiki/Talk_radio)89.7 MHz[Ria 897](/wiki/Ria_897)Malay[Top 40 (CHR)](/wiki/Contemporary_hit_radio)90.5 MHz[Gold 905](/wiki/Gold_905)English[Classic hits](/wiki/Classic_hits)92.4 MHz[Symphony 924](/wiki/Symphony_924)English[Classical](/wiki/Classical_music)93.3 MHz[YES 933](/wiki/YES_933)Chinese[Top 40 (CHR)](/wiki/Contemporary_hit_radio)93.8 MHz[CNA938](/wiki/CNA938)English[News](/wiki/News_radio)/[Talk](/wiki/Talk_radio)94.2 MHz[Warna 942](/wiki/Warna_942)Malay[Adult contemporary](/wiki/Adult_contemporary) [Infotainment](/wiki/Infotainment)95.0 MHz[Class 95](/wiki/Class_95_(radio_station))English[Adult contemporary](/wiki/Adult_contemporary)95.8 MHz[Capital 958](/wiki/Capital_958)Chinese[Classic hits](/wiki/Classic_hits) [News](/wiki/News_radio)/[talk](/wiki/Talk_radio)96.8 MHz[Oli 968](/wiki/Oli_968)Tamil[Adult contemporary](/wiki/Adult_contemporary) [Infotainment](/wiki/Infotainment)97.2 MHz[Love 972](/wiki/Love_972)Chinese[Adult contemporary](/wiki/Adult_contemporary)98.7 MHz(/wiki/987FM)English[Top 40 (CHR)](/wiki/Contemporary_hit_radio) ### Digital platforms #### mewatch **mewatch** (formerly Toggle) was launched on 1 February 2013 as an [OTT](/wiki/Over-the-top_media_services) service. On 1 April 2015, [xinmsn](/wiki/Xinmsn) was merged with Toggle. It is Mediacorp's digital video service that redefines TV viewing, bringing Toggle Originals, catch-up content, live coverage of key national events, news, entertainment, and behind-the-scene exclusives to viewers across multiple devices – computers, tablets, smartphones, smart television sets, and digital media players. #### melisten **melisten** (formerly MeRadio) is an audio digital platform focusing on live audio streaming of Mediacorp's eleven radio stations as well as audio [podcasts](/wiki/Podcast). This platform is also where they offered their [online radio](/wiki/Online_radio) stations, such as IndieGo for [independent music](/wiki/Independent_music) and [urban adult contemporary](/wiki/Urban_adult_contemporary). ## Mediacorp Partner Network In 2018, Mediacorp launched the Mediacorp Partner Network. Under the MPN, Mediacorp signed agreements with brands like: - [ESPN](/wiki/ESPN) on 6 August 2018, where Mediacorp will be the exclusive representative for all ad sales in Singapore for ESPN.com, while ESPN will launch a dedicated Singapore edition of the ESPN site to deliver a mix of local sports news and features in addition to coverage of global sports. - 99.co on 29 August 2018 to create property related news and information for consumers. - Edipresse in November 2018 to co-develop content across digital editorial platforms, TV, live radio and events. Such content will be made available on both Mediacorp and Edipresse Media platforms, utilising the regional reach and influence of both companies. - VICE on 23 April 2019 to bring original VICE digital and TV content to a new Singapore audience via Mediacorp's multi-platform reach. ## Flagship programmes Some of Mediacorp's flagship programmes include: - *[Star Awards](/wiki/Star_Awards)* – Mediacorp's marquee awards event, celebrating the best in local Chinese-language entertainment. The *[Pesta Perdana](/wiki/Pesta_Perdana)* and *Pradana Vizha* are the Star Awards' equivalent for Malay-language and Tamil-language entertainment. - *Lunar New Year's Eve Special Show* – Mediacorp's annual [Chinese New Year's Eve](/wiki/Chinese_New_Year%27s_Eve) Live Countdown Show similar to [CMG New Year's Gala](/wiki/CMG_New_Year%27s_Gala), featuring a wide variety of song and dance performances. - *[Star Search](/wiki/Star_Search_(Singaporean_TV_series))* - [*118*](/wiki/118_(TV_series)) – long-form Channel 8 drama. 255-episode 118 I aired from 2014 – 2015, 218-episode 118 II ran from 2016 – 2017, and a special 23-episode 118 Reunion aired in 2018. - [*Tanglin*](/wiki/Tanglin_(TV_series)) – long-form Channel 5 daily drama that centred on the lives of multiracial and multigenerational families in a middle-income neighbourhood, in the Holland Village, Tanglin. The 823-episode show ran from 2015 to 2018. - [*KIN*](/wiki/Kin_(Singaporean_TV_series)) – long-form Channel 5 weekends drama launched in 2018 (after *Tanglin'*s conclusion). - [*Getai Challenge*](/wiki/GeTai_Challenge) – singing talent search competition that aimed to promote the Getai culture and discover aspiring Getai singers. Season 1 was shown on Channel 8 in 2015, and Season 2 in 2018. - [*SPOP SING!*](/wiki/SPOP_Sing!_(season_1)) – an initiative launched by Mediacorp in 2018 to showcase and curate local music compositions. - *Abang Teksi* (*Taxi Brother*) – Suria only Malay sitcom aired season 1 from 2017 and season 2 from 2019. - *Forensik* (*Forensics*) – Suria drama and spin-off to English counterpart *Code of Law* launched in 2020. ## Production In 2000, [MediaCorp Studios](/wiki/Mediacorp_Studios) was created to produce content for MediaCorp TV channels, such as Channel 5, Channel U and Channel 8. In 2001, EagleVision was created to produce content for Suria and Vasantham. They co-produce programmes with regional broadcasters and production houses such as [Media Prima](/wiki/Media_Prima) Malaysia, [Radio Televisyen Malaysia](/wiki/Radio_Televisyen_Malaysia), [Radio Television Brunei](/wiki/Radio_Television_Brunei), [ABS-CBN Studios](/wiki/ABS-CBN_Studios) Philippines, [NET.](/wiki/MDTV_(Indonesian_TV_network)) Indonesia, Eightgeman Taiwan and [Taiwan Television](/wiki/Taiwan_Television). ## Controversies ### 1982 misinformation over Zainal Abidin At 6:54am on 6 October 1982, SBC Radio 2 claimed that Malaysian squash champion Zainal Abidin died in a car accident. Said announcement turned out to be a voice test conducted by a newsreader ahead of the 7am bulletin. In the wake of the voice test, Zainal received calls regarding his status. SBC subsequently apologised to Zainal. Azmi Mahmud, who did the voice test, was sacked on 22 January 1983, in the fallout of the incident. To prevent further mishaps, SBC tightened its controls on its news procedures. ### 1999 website hackings Two teenagers hacked the TCS and Mediacity websites on 15 June 1999. The hackers, simply known as \"7digit\" and \"m3\", defaced the main page carrying shouts to 7digit's friends, as well as messages against [Bill Gates](/wiki/Bill_Gates) (here nicknamed \"Bill Gays\"), about Windows repeatedly crashing, and the Ministry of Education for their administration. The title of one of the websites was even renamed by 7digit to Mediashitty. Mediacity was hacked again in September by mistuh green. TCS was considering a police investigation. Edwin Ling Zhaoming, who hacked the Mediacity website in June, was jailed on 21 December, for a five month period. By March 2000, he apologised both TCS and Mediacity. ### Copyright infringement with RecordTV In 2007, cloud software DVR service RecordTV (now [InstantTV](/wiki/InstantTV)) filed a lawsuit against Mediacorp for copyright infringement which the latter claimed as \"groundless threats\". This comes after the company sent two \"cease and desist\" letters to RecordTV which \"stated the consequences\" of alleged copyright violations, which led Mediacorp counter-sued against RecordTV. In December 2009, Mediacorp won the case against RecordTV, in which the Singapore High Court found that RecordTV had infringed copyright laws by allowing users to record programmes shown on three Mediacorp-owned channels. However, this ruling was later overturned in favour of RecordTV by the Court of Appeals, and MediaCorp was ordered to pay costs and damages to RecordTV, and an injunction was issued against MediaCorp from issuing further threats against RecordTV. ### 2017 *OK Chope!* controversy On 29 March 2017, an edition of the Channel 5 comedy panel game show *OK Chope!* featured the following question: > [Najib](/wiki/Najib_Razak) slams ____ for threatening Malaysia's progress. of which the answer was \"fake news\". The panelists while trying to find an answer to fill the blank, referred to \"kissing Malaysian officers\" and the [live-action version of *Beauty and the Beast*](/wiki/Beauty_and_the_Beast_(2017_film)), whose release was postponed in Malaysia due to the inclusion of a minor gay character. The segment went viral on social media and prompted anger from Malaysian netizens. The Malaysian Artistes Association and the Selangor [UMNO Youth](/wiki/UMNO_Youth) both demanded that [Vernetta Lopez](/wiki/Vernetta_Lopez) should apologise for insulting and ridiculing Najib or would face a ban from Malaysian TV shows. Mediacorp issued an apology on 5 April 2017 and removed the episode from Toggle. ### 2025 *The Assembly* episode In July 2025, [CNA](/wiki/CNA_(TV_network)) aired its fourth episode of the second season of *The Assembly* (based on the [Australian show of the same name](/wiki/The_Assembly_(TV_series))) featuring [Leader of the Opposition](/wiki/Leader_of_the_Opposition_(Singapore)) [Pritam Singh](/wiki/Pritam_Singh). The episode aired on 5 November, the day after the court hearing of Singh's appeal for the [Raeesah Khan](/wiki/Raeesah_Khan)'s controversy, which was mentioned in that episode. On 12 December, around one week after the court dismissed his appeal on 4 December, Mediacorp pulled the episode off from both their CNA's [YouTube](/wiki/YouTube) channel and its [meWatch](/wiki/MeWatch) platform, and issued an apology the day after, citing that their episode was in [contempt of court](/wiki/Contempt_of_court) according to the [Attorney-General's Chambers](/wiki/Attorney-General_of_Singapore) (AGC). AGC issued warning letters to both Singh and Mediacorp on 19 December. ### Controversial Facebook comment by CNA In October 2025, Mediacorp filed a police report after its official profile on [Facebook](/wiki/Facebook) commented on a post by home affairs minister K. Shanmugan dated 4 November 2015. The post featured Shanmugan's document about [Lee Kwan Yew](/wiki/Lee_Kwan_Yew)'s legacy and Singapore's future. On 17 October 2025, the account made this comment: > Typical playbook – talking to their base, rally their troops and generals but their real target is actually to corner and neutralise the [WP](/wiki/Workers%27_Party_(Singapore)). Filmmaker Yusri Shaggy Sapari uploaded it onto his Facebook account with the caption \"CNA adming caught. Lmao\" and made it to the Singapore subreddit, where it accumulated 2,7 upvotes within days. The post was of a political nature, while political biases on Singaporean media are often discouraged, per Protection from Online Falsehoods and Manipulation Act (POFMA) rules. ## Awards and accolades YearAward-giving bodyCategoryRecipientResultRef.2008[13th Asian Television Awards](/wiki/Asian_Television_Awards)Asia's Terrestrial Broadcaster of the YearMediacorpWon2013[18th Asian Television Awards](/wiki/Asian_Television_Awards)WonPortals: - Singapore - Companies - [Mass media of Singapore](/wiki/Mass_media_in_Singapore) - [Censorship in Singapore](/wiki/Censorship_in_Singapore) - [List of programmes broadcast by Channel 5 (Singapore)](/wiki/List_of_programmes_broadcast_by_Channel_5_(Singapore)) - [List of programmes broadcast by Mediacorp Channel 8](/wiki/List_of_programmes_broadcast_by_Mediacorp_Channel_8) - [List of programs broadcast by Vasantham](/wiki/List_of_programs_broadcast_by_Vasantham) - [List of programmes broadcast by CNA](/wiki/List_of_programmes_broadcast_by_CNA) - Category:Singapore Chinese dramas - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:32:39.373440",
  "title": "Mediacorp",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Mediacorp"
}