{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:32:40.191483"
  },
  "content": "Subsidiary of MediacorpThis article **may require copy editing for grammar, style, cohesion, tone, or spelling**. You can assist by editing it. *(October 2025)* *(Learn how and when to remove this message)* **Mediacorp TV12** (formerly **Singapore Television Twelve**, Malay: **Televisyen Duabelas Singapura**, Tamil: **சிங்கப்பூர் தொலைக்காட்சி பன்னிரண்டு**, Ciṅkappūr Tolaikkāṭci Paṉṉiraṇṭu) was a subsidiary of [Mediacorp](/wiki/Mediacorp). It operated the **[Suria](/wiki/Suria_(TV_channel))**, and **[Vasantham](/wiki/Vasantham_(TV_channel))** channels, which cater to specific groups in [Singapore](/wiki/Singapore), and before, [Central](/wiki/Central_(TV_channel)) and [Okto](/wiki/Okto). TV12 also owned production units, **Mediacorp EagleVision** for television production and **Mediacorp VizPro Entertainment** for live events. ## History ### Background TV12's origins lie in SBC Channel 12, which started broadcasting on 31 January 1984, under the control of Sandra Buenaventura. The channel had a niche, highbrow appeal, but, in order to increase its appeal, it started to tone down the amount of such programming (as some locals thought the content was \"too European\"), by reducing the amount of operas and adding mini-series and documentaries to the weekly schedule in March 1985, then, in 1986, wrestling. This format remained the norm for Channel 12 until 1994. On 1 January, all Malay programming moved here from [Channel 5](/wiki/Channel_5_(Singaporean_TV_channel)), while on 29 January, the channel rebranded. ### Television Twelve At the same time, the Singapore Broadcasting Corporation was being privatised and divided into three units owned by Singapore International Media: the Television Corporation of Singapore in charge of channels 5 and 8, the Radio Corporation of Singapore in charge of the radio stations and Television Twelve in charge of Channel 12. The new corporations came into effect on 1 October 1994. Television Twelve was positioned as a public service broadcasting company. In readiness for the creation of the new units, Brigadier General [George Yeo](/wiki/George_Yeo) announced that a fourth television channel would be created, TV12's second, a UHF outlet dedicated exclusively to cultural programming. Under these plans, all Tamil programming would move from [Channel 8](/wiki/Channel_8_(Singaporean_TV_channel)) to Channel 12, with the existing channel becoming an ethnic channel, while the former Channel 12 fare would move to the new UHF channel. Another TV12 priority was going to be for the production of \"high-quality public service programmes\". In order to fulfill its public service credentials, TV12 announced plans in May 1995 to find independent production houses to produce programming for its channels. At the time, independent production companies had little know-how, but, according to Sandra Buenaventura, this would lead to increased competition between the companies, aiming at improving the quality of the programmes. TV12 also planned to produce programmes on its own. On 29 July, it formally announced the creation of a second channel, on UHF channel 24. ### Singapore Television Twelve With the upcoming launch of the UHF channel, the company was renamed **Singapore Television Twelve** (STV12) and left the [Caldecott Hill](/wiki/Caldecott_Hill) facilities, moving to facilitites of its own at the Bestway Building in Shenton Way. The facilities featured a reception area, which *[The Straits Times](/wiki/The_Straits_Times)* found to be \"futuristic-looking\", with couches in primary colours, while its reception counter featured STV12 merchandise for sale. The new line-up set to premiere on 1 September was going to consist of Prime 12, the existing VHF channel, and Premiere 12, on UHF channel 24, inheriting the former Channel 12 format. It also wanted to become the world's first profitable public service broadcasting company, as both of its channels carried commercial advertising. [PBS](/wiki/PBS) and the [BBC](/wiki/BBC) don't. By 1996, Malay-language programming acquired from local companies had become profitable, including a documentary series, *Meniti Pelangi* (*Follow the Rainbow*), which was produced by [Fandi Ahmad](/wiki/Fandi_Ahmad)'s production company Fandi Ahmad International. It was also going to take part in the inaugural [Asian Television Awards](/wiki/Asian_Television_Awards) as a co-host, but pulled out at the last minute on the early hours of 15 November 1996 due to \"unresolved issues\" concerning budget, as well as the fact that its sports unit was created in the middle of the year, which did not qualify for the awards, as the period was only valid between July 1995 and June 1996. Premiere 12 was to screen it on 30 November; Channel 5 would repeat it on 1 December. STV12 was going to be the only outlet, but without the production facilities and the cost of hiring commercial producers, Television Asia, creator of the awards, talked to TCS instead. STV12 refused to comment. In January 1997, it announced a plan with the Economic Development Board to upgrade independent production companies producing programmes for its channels, under the Local Industry Upgrading Programme (Liup) scheme. At the end of the month, Sandra Buenaventura quit her post at STV12, but was signed again effective 5 February, when she was expected to return to Singapore. STV12 announced in 1998 that it would develop an Enhanced TV service with digital content developer Media Manager. Its two channels would use their [vertical blanking interval](/wiki/Vertical_blanking_interval) to provide value-added data to viewers. At the time, it was being trialled over the Singapore One network for a six-month period. In November, when it made its fourth anniversary carnival, it announced plans to rename the two channels, under the grounds that \"Prime\" and \"Premiere\" sounded similar, in both meaning and spelling. The rename process would take \"another two years or so\". Singapore Television Twelve was appointed as the PSB SBU of the new MediaCorp conglomerate on 1 August 1999. In September 1999, [Woon Tai Ho](/wiki/Woon_Tai_Ho) took over Lim Hup Seng as Director-General of Singapore Television Twelve, and announced to the public that its two channels, Prime 12 and Premiere 12, would be replaced effective 30 January 2000. The former was to be renamed Suria, an all-Malay channel, while the Tamil programming would move to Premiere 12, which was set to become [Central](/wiki/Central_(TV_channel)). The new service was to be divided into three programming belts: Kids Central for children, with increased airtime for the demographic, Vasantham Central for Tamil programming and Arts Central for highbrow programming. Certain types of programmes were purged, such as US newsmagazines (to [Channel NewsAsia](/wiki/CNA_(TV_network))), David Letterman (to Channel 5) and sports programming (to [SportsCity](/wiki/City_TV_(Singapore)), which was set to launch on 30 January alongside the revised STV12 offer). By changing the names, it became easier to differentiate the formats and programmes of the channels. Throughout its existence under this name, STV12 was frequently mistaken for the Television Corporation of Singapore. The confusion stems from the SBC days, when all channels were under the same owner. ### Mediacorp TV12 In January 2006, it inked a deal with US ethnic network [ImaginAsian TV](/wiki/ImaginAsian_TV) to provide the channel with 100 hours of Arts Central content. Such content included *Party Guide for an Urbanite* and *Stage to Screen*. ## List of channels ### Television - [Suria](/wiki/Suria_(TV_channel)), is a Malay free-to-air terrestrial television channel in Singapore that transmits in Malay. It is the largest Malay channel in Singapore. - [Vasantham](/wiki/Vasantham_(TV_channel)), is a Tamil free-to-air terrestrial television channel dedicated to the Indian community, launched on 19 October 2008. It replaced the Vasantham Central timebelt. ### Former television channels - [Vasantham Central](/wiki/Central_(TV_channel)#Vasantham_Central), the second timeshare on the Central channel. It is also hailed as the biggest Indian television station outside of India. It has such things as Tamil movies for Singaporeans who speak Tamil. It was replaced by the standalone Vasantham channel on 19 October 2008. - [Kids Central](/wiki/Central_(TV_channel)#Kids_Central), it's the first timeshare on the Central and broadcasts children's programmes. It was replaced by okto on 19 October 2008. - [Arts Central](/wiki/Central_(TV_channel)#Arts_Central), the third timeshared channel on Central. Arts Central generally shows alternative programs from around the globe. It was replaced by okto on 19 October 2008. It was later revived as a~ok (arts on okto). However, as the said channel rebranded to include sporting programmes by mid-2017, it was moved to Channel 5 as arts on 5. - [Okto](/wiki/Okto), was an English free-to-air terrestrial television channel with selected programmes broadcast in the language of the country of origin launched on 19 October 2008. An example was Filmart which showcases critically acclaimed films from around the world in its original language. okto retained the programming of both Kids Central and Arts Central, former timeshares of the Central channel. Meanwhile, it replaced SPH Mediaworks Channel i, a subsidiary of SPH MediaWorks, on its frequency. The kids segment was moved to Channel 5, while the Sports segment moved to Mediacorp's digital streaming service, Toggle. okto closed down on 1 May 2019 due to low viewership. ## Production - *EagleVision* is a content producer for Suria and Vasantham. It co-produces programmes with regional broadcasters and production houses. - *VizPro Entertainment* the company's events arm, has brought in and produced several world-class as well as local acts such as [Disney on Ice](/wiki/Disney_on_Ice), [Barney & Friends](/wiki/Barney_%26_Friends), [Winnie the Pooh](/wiki/Winnie_the_Pooh), Wedding Banquet and Siti Nurhaliza Concert. - [Singapore Press Holdings](/wiki/Singapore_Press_Holdings)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:32:40.191211",
  "title": "Mediacorp TV12",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Mediacorp_TV12"
}