{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:32:46.345600"
  },
  "content": "This article **needs a plot summary.** Please add one in your own words. *(January 2022)* *(Learn how and when to remove this message)*1995 Singaporean film ***Mee Pok Man*** is a 1995 Singaporean film directed by [Eric Khoo](/wiki/Eric_Khoo). ## Background The film is Eric Khoo's debut feature, released under his film production company, Zhao Wei Films, after making award-winning [short films](/wiki/Short_film) for years. It was entered into the [19th Moscow International Film Festival](/wiki/19th_Moscow_International_Film_Festival) and showed at more than 30 film festivals worldwide, winning the FIPRESCI (The [International Federation of Film Critics](/wiki/International_Federation_of_Film_Critics)) Award. ## Plot The film stars Joe Ng as the male protagonist Johnny, a Chinese seller of noodles ([mee pok](/wiki/Mee_pok)), and Michelle Goh, who plays a prostitute. The film was given an \"R(A)\" rating in [Singapore](/wiki/Singapore), restricting the movie audience to adults aged 21 and above, but after the change in film ratings in 2004, it was re-rated \"M18\" (aged 18 and above). ## Cast - Joe Ng as Johnny - [Michelle Goh](/wiki/Michelle_Goh) as Bunny - [Lim Kay Tong](/wiki/Lim_Kay_Tong) as Mike Kor - David Brazil as Jonathan Reese - George Chua ## Production The film's story was inspired by a story by [Damien Sin](/wiki/Damien_Sin), \"One Last Cold Kiss\", that appeared in *Classic Singapore Horror Stories*: Book 2 (1994). Khoo was supposed to illustrate the story about a mortuary attendant who falls in love with a fresh corpse, brings it back home, and has a relationship with it. The film was produced under a meager $70,000 budget and a shooting schedule of 16 days. With little room for error, cinematographer Ho Yoke Weng recalled limiting himself to just three takes per scene. ## Soundtrack The soundtrack album was released under [BMG](/wiki/Bertelsmann_Music_Group) and featured the film score by [Kevin Mathews](/wiki/Kevin_Mathews) and music by Singaporean acts including The Padres (a band fronted by Joe Ng, the film's male lead actor), Opposition Party, Livonia, [Etc](/wiki/Etc_(band)) and Sugarflies. ## Reception In November 2015, the film was restored by the [Asian Film Archive](/wiki/Asian_Film_Archive) and presented at the 26th [Singapore International Film Festival](/wiki/Singapore_International_Film_Festival). The restored film also enjoyed a run at independent cinema [The Projector](/wiki/The_Projector), which also celebrated its legacy with talks. In 2019, the film was presented at the inaugural [New York Asian Film Festival](/wiki/New_York_Asian_Film_Festival) winter showcase. - Official site - *Mee Pok Man* at [IMDb](/wiki/IMDb_(identifier)) This article related to a Singaporean film is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:32:46.345228",
  "title": "Mee Pok Man",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Mee_Pok_Man"
}