{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:32:50.220716"
  },
  "content": "2014 Singaporean-Chinese film ***Meeting the Giant*** ([Chinese](/wiki/Chinese_language): 再见巨人) is a 2014 Singaporean-Chinese [coming-of-age](/wiki/Coming-of-age_story) [sports](/wiki/Sports_film) [drama](/wiki/Drama_(film_and_television)) film directed by [Tay Ping Hui](/wiki/Tay_Ping_Hui) in his directorial debut. Co-producing the film, [Zhu Houren](/wiki/Zhu_Houren) also serves as an executive producer and co-writer whilst making a special appearance in the film. The film features real-life professional basketball players and began filming in early August 2013. It was released in theatres on 19 June 2014. ## Plot The film follows a young teenager's encounter with a group of young Chinese basketball talents who are brought to Singapore and groomed to play to win. After his initial resentment, the teen begins to look beyond the players' nationality and understand their personal struggles as well as the sacrifices their families had to make to give them a chance at a better life. As the young players gradually integrate and adapt to the local culture, the teen forms a friendship with them. ## Cast ### Main and supporting - [Delvin Goh](/wiki/Delvin_Goh) as Chen Hang - Chua Seng Jin as Wu Junhui - Michael Lee as Wang Shaohua - [Lim Shengyu](/wiki/Lim_Shengyu) as He Dadi - [Ian Fang](/wiki/Ian_Fang) as He Xiaodi - [Ng Han Bin](/wiki/Ng_Han_Bin) as Gao Ming - Zhuyan Manzi as Zhang Fang - Gu Shiqi as Grandpa Chen - Alvin Chiam as Li Qiang - Wang Yan Bing as Xiong - Patrick Tan as Gao Ming's father - Tan Pai Pai as Gao Ming's mother - Pan Ning as Chen Hang's mother - Ron Teh as Zhilong - [Chase Tan](/wiki/Chase_Tan) as Rongqiang - Aeson Rao as Li Jie - Rayner Lim as Wang Mao - [Zhai Siming](/wiki/Zhai_Siming) as Jiangyi - Lim Weiren as Jiaqiang - Wesley Wong as Weiwen ### Special appearances - [Zhu Houren](/wiki/Zhu_Houren) as Mr. Long - Wang Shuo as Coach Zhang Jiang - Jason Oh as Wu Yongde - [Bernard Tan](/wiki/Bernard_Tan_(actor)) as Coach Hong - Na Guangzi as Bai Na - H K Choo as Principal - Huang Jiaqiang as Jiaqiang's father - Sia Chuan as Junhui's grandpa - [Tay Ping Hui](/wiki/Tay_Ping_Hui) as Eagles player ## Reception Hon Jing Yi of [*Today*](/wiki/Today_(website)) felt that Tay had a \"pretty steady hand for a first-time director\" and the story told \"in a fairly clumsy manner\" and \"lacks focus, and becomes trite and superficial.\". - *Meeting the Giant* at [IMDb](/wiki/IMDb_(identifier)) This article related to a Singaporean film is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:32:50.220075",
  "title": "Meeting the Giant",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Meeting_the_Giant"
}