{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:32:48.273312"
  },
  "content": "Singaporean political meetingsThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Meet-the-People Sessions\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(December 2009)* *(Learn how and when to remove this message)*This article is part of a series on[Politics of Singapore](/wiki/Politics_of_Singapore)[Constitution](/wiki/Constitution_of_Singapore) - [Law](/wiki/Law_of_Singapore) - [Human rights](/wiki/Human_rights_in_Singapore) [Legislature](/wiki/Parliament_of_Singapore) - **[Parliament](/wiki/Parliament_of_Singapore)** - [Speaker](/wiki/Speaker_of_the_Parliament_of_Singapore) [Seah Kian Peng](/wiki/Seah_Kian_Peng) ([PAP](/wiki/People%27s_Action_Party)) - [Leader of the House](/wiki/Leader_of_the_House_(Singapore)) [Indranee Rajah](/wiki/Indranee_Rajah) ([PAP](/wiki/People%27s_Action_Party)) - [Leader of the Opposition](/wiki/Leader_of_the_Opposition_(Singapore)) [Pritam Singh](/wiki/Pritam_Singh_(Singaporean_politician)) ([WP](/wiki/Workers%27_Party_(Singapore))) - [14th Parliament](/wiki/14th_Parliament_of_Singapore) - [Constituencies](/wiki/Constituencies_of_Singapore) [Executive](/wiki/Government_of_Singapore#Composition) - **[President of Singapore](/wiki/President_of_Singapore)** ([list](/wiki/List_of_presidents_of_Singapore)) - [Tharman Shanmugaratnam](/wiki/Tharman_Shanmugaratnam) ([I](/wiki/Independent_politician)) - **[Prime Minister of Singapore](/wiki/Prime_Minister_of_Singapore)** - [Lawrence Wong](/wiki/Lawrence_Wong) ([PAP](/wiki/People%27s_Action_Party)) - [Cabinet](/wiki/Cabinet_of_Singapore) - [Ministries](/wiki/Organisation_of_the_Government_of_Singapore) - [The Reserves](/wiki/Reserves_of_the_Government_of_Singapore) [Judiciary](/wiki/Judicial_system_of_Singapore) - **[Supreme Court of Singapore](/wiki/Supreme_Court_of_Singapore)** - [Chief Justice](/wiki/Chief_Justice_of_Singapore) [Sundaresh Menon](/wiki/Sundaresh_Menon) - **[Court of Appeal](/wiki/Court_of_Appeal_of_Singapore)** - [Prakash](/wiki/Judith_Prakash) - [Tay](/wiki/Tay_Yong_Kwang) - [Chong](/wiki/Steven_Chong) - [Ang](/wiki/Belinda_Ang) - **[High Court](/wiki/High_Court_of_Singapore)** - [State Courts](/wiki/State_Courts_of_Singapore) [Elections](/wiki/Elections_in_Singapore) - [Presidential elections](/wiki/Presidential_elections_in_Singapore) - [General elections](/wiki/General_elections_in_Singapore) Singapore portal - [Other countries](/wiki/Outline_of_political_science#Politics_by_region) - v - t - e The **Meet-the-People Sessions** (**MPS**) is a series of one-to-one meetings between elected [Members of Parliament](/wiki/Members_of_the_Singapore_Parliament) (MPs) and their constituents in [Singapore](/wiki/Singapore). The sessions are usually held once a week at a local constituency office staffed by partisan volunteers. Constituents visit their representative in the hope of resolving their various problems encountered in daily living. The MP will then write letters to the relevant [ministry](/wiki/Organisation_of_the_Government_of_Singapore), [statutory board](/wiki/Statutory_boards_of_the_Singapore_Government) or any concerned parties to appeal on behalf of the constituent. These letters are usually accorded a higher priority by the [Civil Service](/wiki/Singapore_Civil_Service) as they come from elected Members of Parliament, regardless even from elected opposition MPs as the Singapore Civil Service is ought to accord MPs equally and democratic as based and sworn by the [Singapore National Pledge](/wiki/National_Pledge_(Singapore)). Cases deal with a wide range of issues. The list is not exhaustive such as family financial problems (e.g. health-cost issues, jobs seeking, financial assistance), [CPF](/wiki/Central_Provident_Fund) matters, various licenses, [HDB](/wiki/Housing_Development_Board)-related problems (e.g. subsidised rental housing, obtaining a subsidised HDB flat), immigration issues, and appeals for [school admissions](/wiki/Education_in_Singapore) and [school fee](/wiki/Tuition_payments) subsidy, neighbor and any other relational disputes. Almost all Meet-the-People Sessions start after 7pm and can routinely last past midnight based on queue, and are staffed by partisan volunteers. ## History The establishment of these sessions can be traced back to [Chief Minister](/wiki/Chief_Minister_of_Singapore) [David Marshall](/wiki/David_Marshall_(Singaporean_politician)) of the [Labour Front](/wiki/Labour_Front) in the 1950s. ## Rationale The rationale for the Meet-the-People Sessions (MPS) is so that Members of Parliament (MPs) can get a feel of the ground. Even Cabinet ministers are required to go to their weekly MPS, although sometimes they may seek help from other MPs to cover duties when they have ministerial duties to attend to. The 1966 Wee Chong Jin Constitutional Commission had recommended an ombudsman to deal with complaints against the bureaucracy however, Parliament rejected the recommendation and instead preferred that such cases were to be handled by the Members of Parliament themselves or the national Feedback Unit. The need to perform an ombudsman function is probably another rationale for having the Meet-the-People Sessions. ## Process The process of meeting the Members of Parliament varies from constituency to constituency, but follow a general pattern: 1. Registration and take queue number. 2. Constituent meets the writer who pens the appeal letter (either hand-written or via computer) on behalf of the MP. 3. Wait for a queue to consult the MP in person. 4. Meet and consult the MP, constituent narrates to the MP of his/her concerns. 5. MP will assure the constituent that they will provide assistance to their cases via the letters. For urgent cases, the letter will be typed out, proof-read and sign by the MP and hands it to the constituent on the spot. For typical cases, the letter will be vetted through by the MP and sent out usually after three working days. ## Incidents In May 2006, [Seng Han Thong](/wiki/Seng_Han_Thong) was attacked by a constituent of his, a 74-year-old disgruntled former taxi driver who felt that Seng was not taking any action to help him regain his lost taxi licence. The man later made a public apology to Seng, and the charges were dropped. In January 2009, Seng suffered another attack by one of his constituents; a 70-year-old man set him on fire by pouring [paint thinner](/wiki/Paint_thinner) on his back and then igniting him with a cigarette lighter. The man was believed to be mentally ill. Seng suffered burns to roughly 15 percent of his body, and received treatment at [Singapore General Hospital](/wiki/Singapore_General_Hospital). He took time off to recover from his injuries, and resumed his duties in July 2009. On 12 March 2025, [K. Shanmugam](/wiki/K._Shanmugam) was confronted by two women at his Meet-The-People session to address [Protection from Online Falsehoods and Manipulation Act](/wiki/Protection_from_Online_Falsehoods_and_Manipulation_Act) (Pofma). The [People's Action Party](/wiki/People%27s_Action_Party) said that they were members of the Monday of Palestine Solidarity group. - [Surgery (politics)](/wiki/Surgery_(politics)) - To Find Your Member of Parliament and the timing of his/her Meet-the-People Session - A Meet-the-People Session Experience\n",
  "language": "en",
  "processed_at": "2026-01-12T11:32:48.272937",
  "title": "Meet-the-People Sessions",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Meet-the-People_Sessions"
}