{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:33:00.732535"
  },
  "content": "Mental healthcare services and mental health of Singapore and its residents **Mental health in Singapore** comprises the mental healthcare systems in [Singapore](/wiki/Singapore) and the [mental health](/wiki/Mental_health) of people staying in Singapore. Singapore opened its first [psychiatric hospital](/wiki/Psychiatric_hospital), the [Institute of Mental Health](/wiki/Institute_of_Mental_Health_(Singapore)), in 1928, and all [general hospitals](/wiki/General_hospital) currently have [psychiatry](/wiki/Psychiatry) departments. [Major depressive disorder](/wiki/Major_depressive_disorder) is the most common [mental illness](/wiki/Mental_illness) in Singapore, with about six percent of the population suffering from it. [Alcohol abuse](/wiki/Alcohol_abuse) and [obsessive–compulsive disorder](/wiki/Obsessive%E2%80%93compulsive_disorder) are the second and third most prevalent mental illnesses, with incidences of 4.2% and 3.6% respectively. 13.9% of the population in Singapore has experienced either a [mood](/wiki/Mood_disorder), [anxiety](/wiki/Anxiety_disorder), or alcohol abuse disorder in their lifetimes, with more than 75% never seeking professional help. Rates of mental illness have been increasing since 2010, and a large treatment gap exists for mentally ill populations. ## History of mental healthcare services ### Post World War II After the British had re-established [colonial rule in Singapore](/wiki/Colony_of_Singapore) at the end of World War II, the first person appointed as a psychologist was V W Wilson. He was appointed to the colonial Medical Service on 11 September 1956 on contract from the United Kingdom to build up and incorporate a full [psychological](/wiki/Psychology) service within the mental health programme at Woodbridge. Upon his engagement, he aimed to develop a psychological service in four main areas: psychological services in medical, [social welfare](/wiki/Welfare_spending) and educational fields; [psychological research](/wiki/Psychological_research) in social and cultural influences; formal courses in psychology for psychiatric nurses and other mental health staff; and professional advice to government bodies on psychiatric healthcare administration. Wilson's contract expired in 1959. The first local psychologist appointed was Wong Man Kee, who received training from the [Maudsley Hospital](/wiki/Maudsley_Hospital) as a [clinical psychologist](/wiki/Clinical_psychology). He was appointed at Woodbridge, serving as its only psychologist for over ten years, following which he started a private practice. He later founded the Association for Educationally Subnormal Children, now known as the Association for Persons with Special Needs. ### Post independence The child guidance clinic at Woodbridge was founded in the 1970s and saw heavy demand. In 1971, Professor S Rachman pushed for a policy change at Woodbridge that allowed psychologists to administer [behaviour therapy](/wiki/Behaviour_therapy). A programme of [token economy](/wiki/Token_economy) was successfully carried out in a chronic ward in 1973. Woodbridge psychologists with other members of the psychiatric team were involved in rehabilitation projects in the hospital. Psychology lectures began for various groups of nurses, social workers, and psychiatric nurses. In the 1980s, the [Ministry of Interior and Defense](/wiki/Ministry_of_Home_Affairs_(Singapore)) commissioned psychological studies on [secret society](/wiki/Secret_society) members and other [youth groups](/wiki/Youth_organization). The [Public Service Commission](/wiki/Public_Service_Commission_(Singapore)) (PSC) also called on Woodbridge Hospital to provide psychological assessment on President's and PSC scholarship candidates. The [Singapore Police Force](/wiki/Singapore_Police_Force) inducted two psychologists into their hostage negotiation teams, as well as for other operational needs. The [Prime Minister's Office](/wiki/Prime_Minister%27s_Office_(Singapore)) also required psychological evaluation on political candidates earmarked for higher office. In 1984, the Department of Psychology was officially established as a centralised psychological service for the entire [civil service](/wiki/Singapore_Civil_Service), with the [Ministry of Health](/wiki/Ministry_of_Health_(Singapore)) as the central appointing authority. Long Foo Yee, the second local psychologist in Singapore, was appointed head of the department and chief psychologist. ### Present In 1993, Woodbridge Hospital moved to Buangkok Green Medical Park, and was renamed to the [Institute of Mental Health](/wiki/Institute_of_Mental_Health_(Singapore)) (IMH) under its first chief executive officer (CEO), Dr Luisa Lee. Dr [Kua Ee Heok](/wiki/Kua_Ee_Heok), the second CEO of IMH, also helped in the transition of Woodbridge to the IMH. In the aftermath of the [Hotel New World disaster](/wiki/Collapse_of_Hotel_New_World), the Ministry of Home Affairs (MHA) enhanced the country's emergency planning to include the need for psychological support for victims of traumatic incidents. In July 1994, in conjunction with the Ministry of Health and other government agencies, MHA set up the National Emergency Behaviour Management System (NEBMS) with FY Long as the chief EBO and TG Oh as deputy to provide leadership in the development of the system. The NEBMS was activated during the 1996 North-South Highway accident, the [1997 SilkAir Flight 185](/wiki/SilkAir_Flight_185) and 2000 [Singapore Airlines Flight 006 disaster](/wiki/Singapore_Airlines_Flight_006). - [Institute of Mental Health (Singapore)](/wiki/Institute_of_Mental_Health_(Singapore))\n",
  "language": "en",
  "processed_at": "2026-01-12T11:33:00.732003",
  "title": "Mental health in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Mental_health_in_Singapore"
}