{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:32:59.002838"
  },
  "content": "Statute of the Parliament of SingaporeThis article includes a list of general references, but **it lacks sufficient corresponding inline citations**. Please help to improve this article by introducing more precise citations. *(December 2024)* *(Learn how and when to remove this message)* The **Mental Health (Care and Treatment) Act 2008** of [Singapore](/wiki/Singapore) was passed in 2008 to regulate the [involuntary detention](/wiki/Involuntary_commitment) of a person in a [psychiatric institution](/wiki/Psychiatric_institution) for the treatment of a [mental disorder](/wiki/Mental_disorder), or in the interest of the health and safety of the person or the persons around him. ## Form 1 Form 1 in the first schedule of the act empowers a designated [medical practitioner](/wiki/Medical_practitioner) at a psychiatric institution to admit a person suffering from a mental disorder into the psychiatric institution, and detain the person for up to 72 hours. ## Form 2 A person that has been admitted under Form 1, may be detained for a further period of 1 month after the expiration of the 72-hour period under the provision of Form 2 in the first schedule of the act, if the following requirements are fulfilled: 1. The person is examined by another designated medical practitioner at the institution, and is of the opinion that further treatment is needed 2. The designated practitioner signs Form 2 ## Form 3 Form 3 allows for a person detained under form 2 to be further detained for up to 6 months if: 1. 2 Designated medical practitioners (of which at least one must be a [psychiatrist](/wiki/Psychiatrist)) have examined the person separately and are satisfied that the person requires further treatment at the psychiatric institution 2. It is necessary in the interest of the health or safety of the person or for the protection of other persons that the person should be detained ## Form 4 Form 4 of the Act allows for visitors to apply to a [Magistrate](/wiki/Magistrate) for Form 5. The visitors are appointed by the Minister of Health. At least 12 visitors are appointed at any time, and at least 6 have to be medical practitioners. 2 or more visitors have to visit the designated psychiatric institution at least once every 3 months. ## Form 5 Form 5 in the First Schedule of the act is an order made by a Magistrate, which allows for the person to be detained for a further 12 months.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:32:59.000400",
  "title": "Mental Health (Care and Treatment) Act",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Mental_Health_(Care_and_Treatment)_Act"
}