{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:33:02.884464"
  },
  "content": "* *Mental health in Singapore** has its roots in the West. The first medical personnel in the field were mostly from Britain. [Medical education](/wiki/Medical_education) in the early years was almost exclusively for the British, until the establishment of King Edward VII College of Medicine on the island in 1907. Hence, many influential ideas flowed over from the West through the years. ## The Colonial years (1819–1942) When Sir [Stamford Raffles](/wiki/Stamford_Raffles) set foot on the island on 28 January 1819, he had with him troops of the [Bengal Native Infantry](/wiki/Bengal_Native_Infantry) and Sub-Assistant Surgeon [Thomas Prendergast](/wiki/Thomas_Prendergast), who was in medical charge of the whole expedition. In May, Assistant Surgeon [William Montgomerie](/wiki/William_Montgomerie), a more senior officer, came to join Prendergast. Their duties were of military and civil nature, and they served in Singapore until 1823 and 1827 respectively before returning to [Bengal](/wiki/Bengal). In June 1827, the medical duties were shared between Surgeon B. C. Henderson and Assistant Surgeon Warrand, who came with a detachment of troops to relieve Montgomerie. Henderson was responsible for the General and Pauper Hospitals while Warrand was responsible for the convicts and troops. No institution for the mentally ill was available then. Prior to 1819 the population of the island was estimated to be 150. Since then, the population started to grow at a rapid pace, due to the people, mainly from the Southeast Asian region, China and [India](/wiki/India), who came to Singapore to take advantage of the employment opportunities generated by a growing [entrepôt](/wiki/Entrep%C3%B4t) trade. As a result of this large influx of penniless people, overcrowding, bad living conditions and a habit of [opium](/wiki/Opium) smoking led to a high rate of physical and mental illness. However, the medical needs of the natives were not top priority. Provision of health and medical facilities and services was limited because the government felt that the population was made up of immigrants who were not planning to make Singapore their home. The [mentally ill](/wiki/Mentally_ill) were referred to as \"insane\", and unless they were deemed dangerous, they were ignored and left on the streets. This meant almost complete neglect of the mentally ill. The first sign of a need for care for the mentally ill was a request to send John Hanson, a [Dane](/wiki/Denmark) who had lived in Singapore for about five years, \"to [Calcutta](/wiki/Calcutta) or any other place where a [Lunatic Asylum](/wiki/Lunatic_Asylum) may be established\" by the Superintendent of Police S. G. Bonham to the Secretary to Government on 27 May 1828. A similar item had been reported by acting Senior Surgeon W. E. E. Conwell, who had come in February 1828 on an inspection tour of the hospitals. In Conwell's report, it was noted that Hanson was being treated at the Singapore Infirmary and otherwise being confined in a jail since there was no suitable place for people like him. However, even after Singapore became the capital of the [Straits Settlements](/wiki/Straits_Settlements) in 1832 and the headquarters of the Medical Department in 1835, there was still no institution for the mentally ill. The jail was called the Convict Gaol, and lunatics were taken care of by the inmates. Conditions in the jail were far from ideal. Overcrowding was still the biggest problem. In 1835, Senior Surgeon William Montgomerie, who had been promoted and had returned to Singapore in 1832, received orders for himself and Assistant Surgeon Thomas Oxley to continue visiting the lunatics and convicts in the jail in their capacity as Medical Officers. Instead of improvements in mental health care, by 1837 the practice of putting lunatics in jail became more ingrained. Special allowances were given to the Sheriff's Department, instead of the Medical Department, for care of lunatics: “Gaoler 25 Rupees; Overseer 15 Rupees; Two Convicts 10 Rupees”. Public outcry regarding mental health care started in 1838. In the [Singapore Free Press](/wiki/Singapore_Free_Press) forum on 21 February 1838, it was argued that \"it has been proved that in recent cases of insanity under judicious treatment, as large a proportion of recoveries will take place as from any other acute disease of equal severity\" and the Editor added his comments highlighting the fact that \"there is space enough in the hospital yard to construct a suitable building for their reception, and we hope that the absolute necessity there exists for providing something in the nature of a Lunatic Asylum will not be overlooked.\" Despite that, little was done to improve the situation. The wakeup call came in October 1840, when one of the lunatics was killed by another in the jail. Bonham, who had become Governor by then, immediately requested that Montgomerie write \"a report on the number and state of the lunatics under treatment, and also suggestions for their better management\". Montgomerie reported on 16 November 1840 that there were 22 insane patients and he expected that the yearly average of seventeen patients would increase with growth of the settlement. In the report, he also suggested the Lunatic Asylum be built for 24 patients and should any more room be needed, buildings would be added on. In addition, floors \"should be laid with bricks on edge, embedded in good mortar so as to admit of being washed, and prevent the patients lifting the floors, which constructed with tiles as in the Jail, they have been enabled to do so;\" and \"wood for the walls and bed places in consequence of very bad effects having arisen from patients in the Jail having destroyed the bed places and by squatting on the floor and leaning against cold walls, have in several instances cramped their limbs and stiffened their joints so as to cause lameness\". Montgomerie also submitted a plan and estimate for $775.16. He did not suggest sending lunatics to India because he felt that they would feel more comfortable \"among their countrymen than among strangers\". On 28 November 1840, Governor Bonham presented the case to the [Governor of Bengal](/wiki/Governor_of_Bengal). The Governor of Bengal accepted the plan on the recommendation of the Military and Medical Boards. The Asylum was to be built for \"'the custody of the patients' and the same number of staff attended them as when they were in the Jail\". The resolution, dated 12 May 1841, had stated that the \"gross expense [was] not to exceed $775.10\". The eventual amount spent was slightly higher than that. ## The first hospital for the mentally ill (1841–1928) The Insane Hospital was completed in 1841. It was situated at the corner of [Bras Basah Road](/wiki/Bras_Basah_Road) and Bencoolen Street. In spite of the unfortunate death that occurred, due regard was still not given to mental health care. Conditions at the Hospital were not better than had been at Convict Gaol. It was a 30-bed hospital, and \"the number of lunatics seldom exceeded 30 or 40\". The lunatics were taken care of by warders who also guarded the convicts jailed in the adjacent brick structure. Colonel W. J. Butterworth was made Governor of the Settlements on 14 June 1843. On his familiarisation tour of government institutions, he noticed the poor conditions at the Hospital. On 20 June 1844, the Singapore Free Press reported one of nine Presentations by the Grand Jury, who played an important role in influencing the management of lunatics in Singapore and whose role was different from those in criminal courts. The Grand Jurors had noted that little was being done to care for the mentally ill in addition to the lack of space at the Hospital. Governor Butterworth was annoyed at this as he had believed improvements would have been made since his last visit. He then ordered that the Hospital be put under the personal charge of Dr Thomas Oxley, who had become Senior Surgeon by that time, in 1844. Dr Oxley's first step was to appoint Assistant Apothecary Henry Lloyd, a qualified medical person, to be in charge of the Hospital and personally answerable to him for the care of the lunatics. By February 1846, Dr Oxley reported improvements in the Hospital conditions. He had also been actively sourcing for avenues to supplement the Hospital income. Dr Oxley made three such attempts. The first was picking [oakum](/wiki/Oakum) for sale. The second was [basket weaving](/wiki/Basket_weaving), which was the earliest semblance to [occupational therapy](/wiki/Occupational_therapy). The money raised from the sale of oakum and baskets provided for two sets of clothing per person. The third was the manufacturing of [gutta percha](/wiki/Gutta_percha) (nutmeg) sheets for surgical purposes to be sold to the Medical Board at Calcutta at ten percent below market rate. This failed because the Board found better quality ones could be produced elsewhere. Additionally, Dr Oxley introduced a system of non-restraint and attempted to change the Hospital's public image. But the latter was to no avail due to prevalent misconceptions. Throughout the colonial period, \"isolation of the insane with proper justification was then thought necessary and custodial care was the mainstay of the day\". Treatments were administered under the belief that mental illness was caused by \"a foreign body that had to be expelled from the body\". Hence, all [lunatics](/wiki/Lunatics) were forced to take [purgatives](/wiki/Purgatives) which induced [diarrhoea](/wiki/Diarrhoea) and vomiting once every month, regardless of their physical condition. For those who were \"under peculiar excitement\" (Ng 2001a, p. 18), \"soothing medicines\" (Ng 2001a, p. 18) were given and they were locked in their cells without restraints. 1847 and 1848 were uneventful save for the persisting shortage of accommodation at the Hospital (Lee 1978, p. 197). Under these circumstances, Dr Oxley was forced to discharge \"harmless\" patients to make room for more \"dangerous\" ones (Lee 1978, p. 197). Act IV of 1849 worsened the overcrowding (Lee 1978, p. 198). It stated that people who broke the law when of unsound mind would not be sent to jail but to the Hospital instead (Lee 1978, p. 198). This was Singapore's first legislation regarding the mentally ill, and the first person committed under the Act was Lim Say Soon who was charged for murder on 21 August 1848 (Lee 1978, p. 198). Since Dr Oxley's complaints about the overcrowding were ignored, on 11 April 1849, he wrote to absolve his staff from blame should anything untoward happen if more people were sent to the Hospital (Lee 1978, p. 198). When the Grand Jury looked into the issue on 24 April 1850 following a spate of contagious [skin disease](/wiki/Skin_disease) in the Hospital, Dr Oxley took the chance to reiterate his point and highlight the poor living conditions at the Hospital (Lee 1978, p. 198). As a result, on 17 May 1850, the Governor gave orders for the Hospital to be disinfected as a temporary measure and that plans for a new extension to be submitted (Lee 1978, p. 198). Together with the Superintending Engineer, Dr Oxley submitted a proposal suggesting that the old building be kept for those \"whose insanity is at times of a violent character\" (Lee 1978, p. 199) and the new building for those who would respond to medical treatment. The plan was approved by the Government of Bengal on 9 August 1850 (Lee 1978, p. 199). Finally, the Hospital was enlarged in 1851 (Ng 2001a, p. 11), doubling accommodation to forty-eight (Lee 1978, p. 199). Unfortunately, this was for 131 patients (Ng 2001a, p. 11). One typical day at the Hospital in the 1850s consisted of work (picking oakum and cleaning of dormitories) and exercise, as well as breakfast and dinner at 9 am and 3 pm respectively. Meals were the same everyday–rice, curry and fish. Clothing was only changed every Sunday (Ng 2001a, p. 11; Lee 1978, p. 199). Because of discrimination, only locals were admitted to the Insane Hospital. The European insane were sent to the European Seamen's Hospital as they considered it an \"insult\" (Ng 2001a, p. 12) to be put among the locals. However, they caused serious problems as shown in a letter written by the Medical Officer in charge dated 25 June 1850, George Fox had struck a Chinese Toty (attendant) as a result of a lack of \"means of properly confining or efficiently watching him\" (Lee 1978, p. 199). As a result, policy was changed to authorise Medical Officers to send Europeans to the Insane Hospital (Ng 2001a, p. 12; Lee 1978, p. 199). As expected, this policy was not well received among the Europeans (Ng 2001a, p. 12). For example, the French Consul had protested when Louis Allard, a [Frenchman](/wiki/Frenchman), was admitted in February 1852 (Lee 1978, p. 199). Hence, the few insane Europeans were sent back to Europe unless they were poor (Ng 2001a, p. 12; Lee 1978, p. 199). On 17 August 1853, the Grand Jury commented that the old Hospital building be torn down because it was inappropriate for convicts to be put in the Hospital by the Superintendent of Convicts as punishment (Lee 1978, p. 199). Dr Oxley was infuriated as this was untrue (Lee 1978, p. 200). Admissions were approved of only by himself and the Superintendent of Police (Lee 1978, p. 200). Further worsening the overcrowding, lunatics from [Malacca](/wiki/Malacca) were transferred to the Hospital (Lee 1978, p. 200). Dr Oxley's subsequent request for more staff was also turned down (Lee 1978, 200). A few months before his retirement in 1857 (Ng 2001a, p. 12), on 7 April 1856, Dr Oxley brought up the issue of overcrowding to the Governor once again (Lee 1978, p. 200). No action was taken until a donation of $3,600 was made by Low Joon Teck and Chung Sam Teo, the two Chinese merchants who had government monopoly to sell opium in Singapore (Lee 1978, p. 200). The Governor immediately wrote to India to build \"a medical complex which would include a new General Hospital, Lunatic Asylum, Medical Stores and Dispensary\" (Lee 1978, p. 200). The Indian government approved, but stated that the Government would provide fully for the Asylum while the donation from the merchants would be used solely for the General Hospital and the Asylum should be separate from the General Hospital (Lee 1978, p. 200). Ironically, the former decision slowed the process rather than hastening it (Lee 1978, 200). When the [Indian Mutiny](/wiki/Indian_Rebellion_of_1857) broke out (Lee 1978, p. 201) on 10 May 1857 in the town of Meerut, Government spending was limited to those of military importance. Work on the General Hospital continued though (Lee 1978, p. 201). Since no funds were available for the Asylum, the old one was simply repaired (Lee 1978, p. 201). With an increasing number of people being admitted, inadequacy of existing facilities and the passing of Act XXXVI of 1858 that allowed for the Government to establish Lunatic Asylums, the Governor-General finally agreed to build the new Asylum as planned in 1856 (Lee 1978, p. 201). There were also plans for the Asylum to cater to the needs of the entire Straits Settlements and hence the rejection of a proposal to build an Asylum in Malacca for lunatics there (Lee 1978, p. 201). The proposal had been made because those from Malacca were unwelcome due to the lack of space here (Lee 1978, p. 201). The Grand Jury had highlighted that the only female lunatic was \"exposed to the view of the other inmates\" (Lee 1978, 202), and this demanded rectifying. May 1861 saw two changes to the Insane Hospital. Its premises was now at a site near Kandang Kerbau Maternity Hospital and the Hospital was renamed the Lunatic Asylum (Ng 2001a, p. 13). The larger building was put aside for mild cases of lunacy while the smaller buildings, where confinement cells were located, were designated for dangerous lunatics (Ng 2001a, p. 13; Lee 1978, p. 203). There was a deliberate effort to have \"shrubs, flower beds and grass plots\" (Ng 2001a, p. 13) in the grounds around the Asylum to create a pleasant environment. Although nearly doubling in size to 100 beds, the average number of lunatics admitted was 119 (Ng 2001a, p. 14). The number of lunatics increased tremendously because few died or were ever discharged. The general consensus was that \"mental maladies are seldom fatal and generally permanent\" (Ng 2001a, p. 13). Lack of space and facilities at the Asylum were constantly reported to the government in the 1870s, but to no avail (Ng 2001a, p. 14). The Grand Jury made their last Presentment on 18 October 1865, and was abolished by Ordinance VI on 1873 passed on 9 September 1873 (Lee 1978, p. 204). At that point of time, doctors had both clinical and administrative duties to fulfil (Ng 2001a, p. 15). As a result, clinical matters took up the bulk of their time, while the running of the Asylum was neglected (Ng 2001a, p. 15). Moreover, men had always been in charge of caring for the lunatics at the asylum. This was inconvenient due to lunatics in the female wards, so in January 1867 the first female employee to work in the Medical Department was sought (Ng 2001a, p. 14). The administration of the Straits Settlements was transferred from the India office to the Colonial Office on 1 April 1867, and the Settlements became a Crown Colony (Lee 1978, p. 205). Sir Harry Ord was the new Governor (Lee 1978, p. 205). The immediate impact on the Medical Department was in-depth inquiry into the state of affairs in all hospitals (Lee 1978, p. 205). The Governor was at first indignant until it was made clear that the purpose \"was to indicate the standard of care expected\" (Lee 1978, p. 205) and not to put blame. Since then the Asylum was to be managed according to the Digest on Colonial Hospitals and Asylums, published on 14 January 1867 and sent to Singapore on 18 December 1867 (Lee 1978, p. 205). The law in place at the time of transfer was the Indian Lunacy Act of 1858, which was a simplified version of the Shaftesbury's Act for the Regulation of the Care and Treatment of Lunatics passed on 4 August 1845 (Lee 1978, p. 206). The Digest also incorporated the spirit of provisions of the English Act, and that was the benchmark expected after 1869 (Lee 1978, p. 206). An outbreak of [cholera](/wiki/Cholera) in the Asylum and the surrounding [Kandang Kerbau](/wiki/Kandang_Kerbau) area in July 1873 (Ng 2001a, p. 15) necessitated a temporary shift of the Government General Hospital's patients to the military hospital at Sepoy Lines, an area adjacent to Chinatown and Pearl's Hill where Indian troops were stationed to guard Singapore (Lee 1990, p. 7). Soon after, it was decided that the shift was to be permanent, so construction of a proper building began (Lee 1990, p. 7). At the same time, a new site for the Asylum was being sought so that occupation therapy could be introduced (Ng 2001a, p. 15). It was decided that the Asylum would also shift to Sepoy Lines (Ng 2001, 15). The General Hospital was completed in 1882 (Lee 1990, p. 7). A second cholera outbreak in August 1887 forced Dr Tripp, Acting Surgeon in charge of the Asylum, to call for an early shift to the new building (Ng 2001a, p. 16). The new Asylum was built on cottage principles (Ng 2001a, p. 16) with a series of detached buildings (Lee 1990, p. 7), and had accommodation and work facilities. Based on John Colony's ideas, the lunatics were assigned accommodation first by gender and second by type of mental illness (Ng 2001a, p. 16). Treatments no longer focused solely on purgatives and included sedatives. Additionally, it was thought that \"a medical man skilled in lunacy should be given charge of the Asylum\" (Ng 2001a, p. 17), so Dr William Gilmore Ellis, the first medical specialist to be appointed in Singapore, took over from Dr Tripp (Ng 2001a, p. 18). He said that effective treatment was difficult because the lunatics came from all over the region and it was near impossible to gather each individual's medical history (Ng 2001a, p. 26). Dr Ellis also abolished strait jackets and the only mechanical restraint used was locked gloves (Ng 2001a, p. 18). He showed that the mentally ill could be treated by doctors without loss of dignity, just like any other patient (Ng 2001b, p. 2). Treatment in those days was based on the idea that treatment should be \"holistic and focused upon the lifestyle of the patient\" (Ng 2001a, p. 17), so \"crucial elements included 'kindness, freedom from restraint, regular hours, good food, open air exercise and occupation. Little luxuries such as [betel-nut](/wiki/Betel-nut) and tobacco were given'\" (Ng 2001a, p. 17). Since the shift to Sepoy Lines, there were no big changes. In 1903, female lunatics were moved to the Pasir Panjang ward (which was used to house patients of [beri-beri](/wiki/Beri-beri)) to make way for the Straits and Federated Malay States Medical School (Ng 2001a, p. 20; Samuel 1991, p. 185), later renamed as [King Edward VII College of Medicine](/wiki/King_Edward_VII_College_of_Medicine) in 1921 (Ng 2001a, p. 20). Male lunatics remained at Sepoy Lines till overcrowding resulted in their eventual transference to Pasir Panjang in 1907 as well, and then to Central Mental Hospital at Tanjong Rambutan in Perak in 1914 (Ng 2001a, p. 21). In the 1920s, the government decided to make use of the medical graduates to staff a new asylum (Ng 2001a, p. 22). Right up to that point, care for the mentally ill was the responsibility of a few expatriate nurses and health attendants who lacked training in nursing ([Institute of Mental Health](/wiki/Institute_of_Mental_Health_(Singapore)) 2003, p. 16). On 3 November 1924, the Legislative Council debated the construction of the new Mental Hospital (Ng 2001a, p. 22). Construction began in early 1926 and was completed in the latter half of 1928 (Ng 2001a, p. 22). The Mental Hospital was located on Yio Chu Kang Road (Ng 2001a, p. 22). This was the largest medical facility for the mentally ill (Ng 2001a, p. 22). Dr E. R. Stone had taken over as the first medical superintendent and in his 1928 report, he pinpointed \"privation and starvation…heredity, alcohol, fevers and critical periods of life\" (Ng 2001a, p. 23) as causes of mental illness. 1928 also witnessed the introduction of farm work, which was the earliest semblance to rehabilitation (Ng 2001a, p. 23). To further improve treatment and the overall running of the Hospital, a request was made in 1929 for an Assistant Medical Superintendent who had Diplomas in Psychological Medicine and [Tropical Medicine](/wiki/Tropical_medicine) and Hygiene, as well as experience in farming and gardening (Ng 2001a, p. 23). Two things were of particular interest at the Hospital. First was an attendance-taking machine. It was a metallic box installed with a 'keying-in' device (Ng 2001a, p. 24). \"Once 'keyed-in', a time-keeping device in the telephone operator's room would be activated and a graph could then be plot\" (Ng 2001a, p. 24). Disciplinary action was taken against those who were late (Ng 2001a, p. 24). Second was the clock tower that carried the Hospital bell, which was cast in Leicester, England (Ng 2001a, p. 24). \"Each of the four sides of the clock tower had a clock face and was even illuminated in the hours of darkness. The bell was rung three times daily at 5:00 am, noon and 4:30 pm to announce mealtimes, and chimed to herald festive occasions, to mark the change of work shifts and to alert staff of patients absconding from wards\" (Ng 2001a, p. 24). The importance of the bell diminished with time and in the 1950s, it served only as a fire alarm (Ng 2001a, p. 24). In the 1970s, some lunatics were known to have climbed up the tower to ring the bell for fun (Ng 2001a, p. 24). - [History of clinical psychological services in Singapore](/wiki/History_of_clinical_psychological_services_in_Singapore) Institute of Mental Health/Woodbridge Hospital (Singapore). (2003). *Loving Hearts, Beautiful Minds: Woodbridge Hospital Celebrating 75 years*. Singapore: Armour Publishing Pte Ltd. [ISBN](/wiki/ISBN_(identifier)) 981-4138-07-X. Lee, Edwin. (March 1990). *Historic Buildings of Singapore*. Singapore: Preservation of Monuments Board. [ISBN](/wiki/ISBN_(identifier)) 9971-88-224-8. Lee, Yong Kiat. (December 1978). *\"The Lunatic Asylum in Early Singapore (1819–1869)\"*. *The Medical History of early Singapore*, Chapter 5. Singapore: Southeast Asian Medical Information Centre (SEAMIC), a special project of the International Medical Foundation of Japan (IMFJ) started in April 1977. Ng, Beng Yeong (2001a). *Till the Break of Day: A History of Mental Health Services in Singapore, 1841–1993.* Singapore: Singapore University Press. [ISBN](/wiki/ISBN_(identifier)) 9971-69-245-7. Ng, Beng Yeong (2001b). *“History of Psychiatry in Singapore”*. *Psychiatry for Doctors*, edited by Kua Ee Hock, Ko Soo Meng and Lionel Lim Chee Chong, Section 1, Chapter 2. Singapore: Armour Publishing Pte Ltd. Samuel, Dhoraisingam S. December 1991. *Singapore’s Heritage: Through Places of Historical Interest.* Singapore: Elixir Consultancy Service. [ISBN](/wiki/ISBN_(identifier)) 981-00-3185-8.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:33:02.884128",
  "title": "Mental health in Singapore during the colonial period",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Mental_health_in_Singapore_during_the_colonial_period"
}