{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:33:09.771416"
  },
  "content": "Official mascot of Singapore The **Merlion** (/ˈmɜːrˌlaɪən/) is the official mascot of [Singapore](/wiki/Singapore). It is depicted as a mythical creature with the head of a [lion](/wiki/Lion) and the body of a [fish](/wiki/Fish). Being of prominent symbolic nature to Singapore and [Singaporeans](/wiki/Singaporeans) in general, it is widely used to represent both the city state and its people in sports teams, advertising, branding, tourism and as a [national personification](/wiki/National_personification). The Merlion was first used in Singapore as the logo for the tourism board. Its name combines \"mer\", meaning the [sea](/wiki/Sea), and \"lion\". The fish body represents Singapore's origin as a fishing village when it was called *[Temasek](/wiki/Temasek)*, which means \"sea town\" in [Javanese](/wiki/Javanese_language). The lion head represents Singapore's original name—*[Singapura](/wiki/Names_of_Singapore)*—meaning \"lion city\" or \"kota singa\". The symbol was designed by [Alec Fraser-Brunner](/wiki/Alec_Fraser-Brunner), a member of the Souvenir Committee and curator of the [Van Kleef Aquarium](/wiki/Van_Kleef_Aquarium), for the [logo](/wiki/Logo) of the [Singapore Tourism Board](/wiki/Singapore_Tourism_Board) (STB) in use from 26 March 1964 to 1997 and has been its [trademarked](/wiki/Trademark) symbol since 20 July 1966. Although the STB changed their logo in 1997, the STB Act continues to protect the Merlion symbol. Approval must be received from STB before it can be used. The Merlion frequently appears on STB-approved [souvenirs](/wiki/Souvenir). ## History The [sea-lion](/wiki/Sea-lion), a [heraldic beast](/wiki/Charge_(heraldry)) of similar appearance to the Merlion, has long been used in the heraldry of Europe and its colonies. However, it is distinct from the Merlion and was not used to symbolize Singapore prior to the design of the Merlion. The Merlion was conceptualised by the [vice-chancellor](/wiki/Vice-chancellor) Kwan Sai Kheong of the [University of Singapore](/wiki/National_University_of_Singapore) and constructed from November 1971 to August 1972 by sculptor [Lim Nang Seng](/wiki/Lim_Nang_Seng). It measures 8.6 metres high and weighs 70 tons. The project cost about [S$](/wiki/Singapore_dollar)165,000. On 15 September 1972, Prime Minister [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) officiated the installation ceremony of the Merlion statue. The original statue stood at the mouth of the [Singapore River](/wiki/Singapore_River) in [Merlion Park](/wiki/Former_Merlion_Park). The completion of the [Esplanade Bridge](/wiki/Esplanade_Bridge) in 1997 blocked the views of the Merlion from the Marina Bay waterfront. The location of the Merlion was also no longer at the entrance of Singapore River due to land reclamation works and also not sprouting water due to a [water pump](/wiki/Water_pump) malfunction in 1998, requiring maintenance works on it. To give the Merlion an unblocked view of the Singapore River, it was suggested to raise the Merlion on a pedestal at its original location. It was deemed unsuitable as the view would still be blocked by the bridge. The other solution was to relocate the Merlion to other places. Possible relocation sites considered included 120 metres away at a new [Merlion Park](/wiki/Merlion_Park), [Nicoll Highway](/wiki/Nicoll_Highway) Extension Bridge, [Esplanade Park](/wiki/Esplanade_Park), [Esplanade – Theatres on the Bay](/wiki/Esplanade_%E2%80%93_Theatres_on_the_Bay), a promontory at Marina Centre (near where the [Singapore Flyer](/wiki/Singapore_Flyer) is located now), a promontory site at Bayfront (near the tip of [Marina Bay Sands](/wiki/Marina_Bay_Sands) [integrated resort](/wiki/Integrated_resort)) and Kim Seng Park. A new Merlion Park, 120 metres away, on a newly reclaimed [promontory](/wiki/Promontory) in front of the [Fullerton Hotel](/wiki/The_Fullerton_Hotel_Singapore) with a Merlion Pier was chosen after the other relocation choices were either unsuitable or not technically feasible. The relocation took two days, from 23 to 25 April 2002. A carefully engineered journey required one [barge](/wiki/Barge), two DEMAG AC1600S [cranes](/wiki/Crane_(machine)) of 5000 tonnes lifting capacity, plus a team of 20 [engineers](/wiki/Civil_engineer) and workers on site. The entire statue was hoisted onto the barge, which then sailed to the new installation site at the current Merlion Park, near the mouth of [Singapore River](/wiki/Singapore_River). During the voyage, the statue had to be hoisted from the barge, over the [Esplanade Bridge](/wiki/Esplanade_Bridge) and then back onto the barge, as it was too tall to pass underneath. Exactly 30 years after he officially unveiled the Merlion, [Senior Minister](/wiki/Senior_Minister_of_Singapore) [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) returned on 15 September 2002 to ceremonially welcome the statue again, this time in its new home. A viewing deck now stretches over the Singapore River, allowing visitors to pose for a photograph with a front or side view of the Merlion, including a new city skyline backdrop in the picture. The sculpture was aligned to face East, a direction advised to be most [auspicious](/wiki/Feng_shui). Relocated, the statue once more spouted water from its mouth. The Merlion now has a new two-unit water pump system with units working alternatively, so a backup is always on standby. The relocation and new site (four times larger than the original) cost [S$](/wiki/Singapore_dollar)7.5 million. From 5 June till 10 July 2006, the Merlion at Merlion Park underwent maintenance. The last one was right after its relocation. Dirt and stains were removed using high-pressure water streams, and various wear and tear of the statue was mended. During that period, visitors were greeted with illustrated [hoardings](/wiki/Temporary_fencing) and [canvases](/wiki/Canvas) covering the safety nets and [scaffolding](/wiki/Scaffolding). The illustrations were designed by [Miel](/wiki/The_Straits_Times), an award-winning senior [artist](/wiki/Artist) at *[The Straits Times](/wiki/The_Straits_Times)*. The illustration on the canvases made them look like [shower curtains](/wiki/Shower_curtains), with the Merlion sticking its head out with the shadow of its tail behind the curtain. The illustration on the hoardings showed the Merlion scrubbing himself with a brush and showering using a Merlion [shower head](/wiki/Shower_head) spouting water. The Merlion said, \"EXCUSE ME while I take a shower...\" in a [speech bubble](/wiki/Speech_bubble). The Merlion on Sentosa was designed and sculpted by an Australian Artist named James Martin. It is made of Glass Reinforced Cement over a steel armature that is attached to the centre. The Merlion Park was temporarily turned into a single-unit [hotel](/wiki/Hotel) suite, as part of an artwork by [Tatzu Nishi](/wiki/Tatzu_Nishi), for the duration of the 2011 [Singapore Biennale](/wiki/Singapore_Biennale). ## Incident On Saturday, 28 February 2009, at about 4:26 pm, the Merlion in the Merlion Park was struck by lightning. A breaking news from [938NOW](/wiki/CNA938) local radio showed an image with fragments from the Merlion's head on the ground. Examination of the damage was done quickly with wooden [scaffolding](/wiki/Scaffolding) set up on Sunday, 1 March 2009 for workers to take a closer look at the hole. The incident happened as a result of the lack of [lightning protection](/wiki/Lightning_protection) on the Merlion itself. ## Merlion statues Within Singapore, there are six Merlion statues in Singapore which are approved by the STB. - The 8.6-metre-tall original statue at [Merlion Park](/wiki/Merlion_Park). - The smaller two-metre-tall statue standing behind the original statue weighed 3 ton and was commonly referred to as the \"Merlion cub\". It was inlaid with Chinese porcelain plates and bowls as part of its design. - The three-metre-tall glazed polymarble statue at Tourism Court (near Grange Road) completed in 1995 - The three-metre-tall polymarble statue placed on [Mount Faber](/wiki/Mount_Faber)'s Faber Point - A pair of Merlion statues were constructed by the Ang Mo Kio Residential Committee in 1999. They are sitting at the entrance of the car park along Ang Mo Kio Avenue 1. One of the previously approved statues, a 37-metre-tall gigantic replica at [Sentosa](/wiki/Sentosa), with Mouth Gallery Viewing Deck on the ninth storey, another viewing gallery on its head and Sentosa Merlion Shop, and capable of shining laser beams from its eyes, was closed on 20 October 2019. The area around the statue would be replaced by a [S$](/wiki/Singapore_dollar)90 million Sentosa Sensoryscape project targeted to be completed by 2022. The statues can also be found outside of Singapore in various countries, namely [Indonesia](/wiki/Indonesia), [Japan](/wiki/Japan), [South Korea](/wiki/South_Korea), [Thailand](/wiki/Thailand), [China](/wiki/China), [Cambodia](/wiki/Cambodia) and the [United Kingdom](/wiki/United_Kingdom). ## The Merlion in art and popular culture ### In music - Shortly after the introduction of the symbol, Dutch artist [Johnny Lion](/wiki/Johnny_Lion) composed a song called \"Merlion City Singapore\" which sought to boost Singapore's reputation and characteristics overseas. ### In film - In the 2021 animated movie *My Hero Academia: World Heroes' Mission*, a Singaporean hero with a design clearly based on the Merlion is seen. His quirk (superpower) allows him to spit high-pressure water from his mouth, just like the main Merlion statue. His name is Big Red Dot, a reference to Singapore's nickname of [Little red dot](/wiki/Little_red_dot). ### In TV series - The Merlion (Japanese: マーライオン) appeared in the influential anime *[Cowboy Bebop](/wiki/Cowboy_Bebop)* (episodes 18 and 24), where its appearance in an ancient home movie offers Singaporean amnesiac bounty hunter Faye Valentine a clue to her true origins. - The Merlion featured heavily in Hajime Satō's (佐藤 肇, Satō Hajime) re-imagining of [Shinjuku](/wiki/Shinjuku) in the 2005 anime, *[Karas](/wiki/Karas_(anime))*. - Together with *[The Little Mermaid](/wiki/The_Little_Mermaid_(statue))* of Denmark and *[Manneken Pis](/wiki/Manneken_Pis)* of Belgium, the Singapore Merlion is ranked in Japan as the 'Three Major Disappointments of the World'. - *[The Amazing Race 25](/wiki/The_Amazing_Race_25)* had teams search the five official Merlions in [Singapore](/wiki/Singapore) (Tourism Court, [Mount Faber](/wiki/Mount_Faber), [Sentosa](/wiki/Sentosa) and two in [Merlion Park](/wiki/Merlion_Park)) to find a clue box in front of one of them, which was at [Mount Faber](/wiki/Mount_Faber). - The Merlion and its supposed history are explained in *[JoJo's Bizarre Adventure](/wiki/JoJo%27s_Bizarre_Adventure)*: *[Stardust Crusaders](/wiki/Stardust_Crusaders)* in episode 7 of the series in which the main characters travel to Singapore. Also in *Stardust Crusaders*, there is a supporting character named Anne Merlai (Japanese: マーライ・アン), named after the Merlion, though only her given name \"Anne\" is mentioned. - On [TLC](/wiki/TLC_(TV_network)) reality series *[Cake Boss](/wiki/Cake_Boss)*, a cake was made in the shape of The Merlion to commemorate Singapore's 50th Anniversary, incorporating flavors that are typically used in Singaporean desserts. ### In gaming - Merlion Virtual Airlines, virtually based in Singapore, is a virtual airline focusing on the free flight simulator, *[FlightGear](/wiki/FlightGear)*, which uses the Merlion as its logo. - A kart based on the Merlion, known as the Roaring Racer, was added to *[Mario Kart Tour](/wiki/Mario_Kart_Tour)* during the game's Singapore Tour event in January 2022. The original Merlion statue also cameos on the Singapore Speedway track, which debuted during the same event and was later added to *[Mario Kart 8 Deluxe](/wiki/Mario_Kart_8)* as part of paid downloadable content. In addition, a Roaring Racer Mii Racing Suit based on the Merlion was introduced in the Winter Tour event for *Mario Kart Tour* in January 2023. ### In literature - [Edwin Thumboo](/wiki/Edwin_Thumboo) cemented the iconic status of the Merlion as a [personification](/wiki/Personification) of Singapore with his poem \"Ulysses by the Merlion\" in 1979. Due to Thumboo's status as Singapore's unofficial [poet laureate](/wiki/Poet_laureate) and the nationalistic mythmaking qualities of his poetry, future generations of Singaporean poets have struggled with the symbol of the Merlion, frequently taking an ironical, critical, or even hostile stand – and pointing out its artificiality and the refusal of ordinary Singaporeans to accept a tourist attraction as their national icon. The poem \"attracted considerable attention among subsequent poets, who have all felt obliged to write their own Merlion (or anti-Merlion) poems, illustrating their anxiety of influence, as well as the continuing local fascination with the dialectic between a public and a private role for poets, which Thumboo (as [Yeats](/wiki/Yeats) before him, in the Irish context) has wanted to sustain as a fruitful rather than a tense relation between the personal and the public.\" Among the poems of this nature are \"Merlign\" by [Alvin Pang](/wiki/Alvin_Pang) and \"Love Song for a Merlion\" by Vernon Chan. More recent poems include \"Merlion: Strike One\" by [Koh Buck Song](/wiki/Koh_Buck_Song) in the 2009 anthology, *Reflecting on the Merlion*. - Merlions as a species were fictional characters in [Gwee Li Sui](/wiki/Gwee_Li_Sui)'s *Myth of the Stone* (1993), the first full-length graphic novel published in Singapore. They were depicted as calm and wise creatures that fought on the side of good and eventually overcame the dreaded [Kraken](/wiki/Kraken). Gwee further popularised the [iconoclastic](/wiki/Iconoclastic) image of the spitting Merlion in the early 1990s. It reappeared later with his poem \"Propitiations\" in his book of poems *Who Wants to Buy a Book of Poems?* (1998). ### As mascots and performance characters - For the inaugural [Singapore 2010 Summer Youth Olympics](/wiki/2010_Youth_Olympic_Games), a pair of mascots, [Lyo and Merly](/wiki/Lyo_and_Merly), were introduced. Merly is a \"Merlion-ess cub\" based on the Merlion. Her hair is inspired by the lion top half, while her fish half is represented in light-blue [scales](/wiki/Scale_(anatomy)) on her body. Unlike the actual merlion, she has hands and legs instead of a tailfin. - The 37m-tall Sentosa Merlion appeared in the *[Magical Sentosa](/wiki/Magical_Sentosa)* show, awakening at the last scene of the show and shining two [laser beams](/wiki/Laser) out of its eyes at the audience. (Similar to the storyline of the *[Songs of the Sea](/wiki/Songs_of_the_Sea)* show.) ### In local parlance - Singaporeans often substitute the term \"Merlion\" in lieu of [vomiting](/wiki/Vomiting), in reference of the constant gushing of water from the Merlion's mouth. ### In sculpture - The Merlion was featured during the 2005 [Venice Biennale](/wiki/Venice_Biennale) in the controversial work *Mike* by artist [Lim Tzay Chuen](/wiki/Lim_Tzay_Chuen). He had proposed taking the sculpture in the Merlion Park to the Singapore Pavilion at the exhibition, but was refused by the STB. STB offered to install of a life-sized replica of the Merlion at the Singapore Pavilion at the Venice Biennale which was rejected by Lim. - [Lion head symbol of Singapore](/wiki/Lion_head_symbol_of_Singapore) - [Mermaid](/wiki/Mermaid) - [Merman](/wiki/Merman) - [Sea-lion](/wiki/Sea-lion), a similar mythic creature - Analysis of the mythology and meaning of the Merlion from the perspective of country branding in: Koh, Buck Song (2011). *Brand Singapore: How Nation Branding Built Asia's Leading Global City*. Marshall Cavendish, Singapore. [ISBN](/wiki/ISBN_(identifier)) 978-981-4328-15-9. Library resources about **Merlion** - Resources in your library - Resources in other libraries - Official Merlion FAQs on Singapore Tourism Board website Archived 26 October 2005 at the [Wayback Machine](/wiki/Wayback_Machine) - 938LIVE *Merlion* Struck by Lightning report - Facts on Singapore Merlion on Shinyvisa website - 360° VR view of the Merlion Park in September 2020 1°17′13.28″N 103°51′16.88″E﻿ / ﻿1.2870222°N 103.8546889°E﻿ / 1.2870222; 103.8546889\n",
  "language": "en",
  "processed_at": "2026-01-12T11:33:09.770866",
  "title": "Merlion",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Merlion"
}