{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:33:12.191569"
  },
  "content": "Landmark in downtown Singapore **Merlion Park**[a] is a famous Singapore landmark and a major tourist attraction, located at [One Fullerton](/wiki/The_Fullerton_Hotel_Singapore), [Singapore](/wiki/Singapore), near the [Central Business District](/wiki/Central_business_district#Singapore) (CBD). The [Merlion](/wiki/Merlion) is a mythical creature with a lion's head and a fish's tail that is widely used as a mascot and national personification of Singapore. Two Merlion statues are located at the park. The original Merlion structure measures 8.6 meters tall and spouts water from its mouth. It has subsequently been joined by a Merlion cub, which is located near the original statue and measures just 2 metres tall. ## History The original Merlion Park was first designed by the [Singapore Tourism Board](/wiki/Singapore_Tourism_Board) (STB) near the mouth of the [Singapore River](/wiki/Singapore_River) in 1964 as an emblem of Singapore. On 15 September 1972, the park was officially opened at an installation ceremony for the statue, officiated at by then Prime Minister of Singapore, Mr [Lee Kuan Yew](/wiki/Lee_Kuan_Yew). The original statue of the Merlion used to stand at the mouth of the [Singapore River](/wiki/Singapore_River). The building of the Merlion was started in November 1971 and was completed in August 1972. It was crafted by the late Singaporean sculptor, Mr Lim Nang Seng and his 8 children. The sculpture measures 8.6 meters high and weighs 70 tons. This massive statue with the spouting stream was constructed by Stanley Mok ### Relocation of Merlion Upon the completion of the [Esplanade Bridge](/wiki/Esplanade_Bridge) in 1997, the original Merlion Park location was also no longer the entrance of Singapore River and the statue could no longer be viewed clearly from the [Marina Bay](/wiki/Marina_Bay,_Singapore) Waterfront. On 23 April 2002, the statue was relocated to a new pier specially built on the other side of The Esplanade Bridge adjacent to [The Fullerton Hotel](/wiki/The_Fullerton_Hotel_Singapore). The move, which cost $7.5 million, was completed on 25 April 2002. On 15 September 2002, then-Senior Minister [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) ceremonially welcomed the Merlion again on its new location, the current Merlion Park, which is four times bigger than the original [site](/wiki/Former_Merlion_Park). #### Merlion statue damage On 28 February 2009, between 4 pm and 5 pm, the Merlion statue was struck by lightning. Staff in the vicinity said they heard an explosion followed by a loud thud when broken pieces fell to the ground. Repairs were completed in March that year, the Merlion itself resumed spouting water on 18 March 2009. ### Restoration Works During restoration, the Merlion statue would be closed off throughout the whole restoration process. The sculpture would be cleaned thoroughly, and new plaster or paint would be put on the Merlion to keep the Merlion looking bright and clean. Occasionally fillers are used for the cracks and hollow areas of the Sculpture. - Singapore portal - [Merlion](/wiki/Merlion) - [Former Merlion Park](/wiki/Former_Merlion_Park) ## Notes - News Asia Singapore - Anniebees website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:33:12.191076",
  "title": "Merlion Park",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Merlion_Park"
}