{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:33:12.248121"
  },
  "content": "Legendary king of LangkasukaThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Merong Mahawangsa\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(August 2014)* *(Learn how and when to remove this message)* **Merong Mahawangsa** is a legendary warrior and a ruler who is said to be the first king of [Langkasuka](/wiki/Langkasuka), or the modern-day [Pattani](/wiki/Pattani_Province). His tale is mentioned in the [Kedah Annals](/wiki/Hikayat_Merong_Mahawangsa), where it mentions him as a hero who became the first king of Langkasuka. ## The legend of Merong Mahawangsa The Kedah Annals claimed that Merong was a descendant of [Alexander the Great](/wiki/Alexander_the_Great) (known in Malay legend as *Iskandar Zulkarnain*). According to the Kedah Annals, Merong was a fighter and ruler from an unknown kingdom. He sailed dan ventured around from kingdom to kingdom but spend mostly on his life stayed in [Rome](/wiki/Rome). One day, he left Rome to do some trading in [China](/wiki/China). But then, after he passed the Arabian Sea, he was suddenly attacked by a legendary giant [phoenix](/wiki/Phoenix_(mythology)) called [Garuda](/wiki/Garuda), which destroyed most of Merong's fleet. They fled to the nearest land, which is [Bujang Valley](/wiki/Bujang_Valley), where they settled and founded the kingdom of [Langkasuka](/wiki/Langkasuka). Merong had three sons, Merong Mahapudisat, Ganjil Sarjuna, and Seri Mahawangsa, and a daughter, Raja Puteri, who is the second youngest in the family. Merong was the original ruler of Langkasuka before he made his son, Merong Mahapudisat, the king. He returned to Rome, leaving his son to rule after. His fate was unknown, as some say that he died on his way to Rome. His son ruled Langkasuka, along with his descendants, until Phra Ong Mahawangsa converted to Islam and changed the Kingdom of Langkasuka into the [Sultanate of Kedah](/wiki/Sultanate_of_Kedah). He also changed his name to [Sultan Mudzafar Shah](/wiki/Sultan_Mudzafar_Shah_I). Later, the salutation for the king of Langkasuka changed to the Sultanate of Kedah. The name 'Langkasuka' can be divided into two parts: for which 'Langka' meant 'the land of glory' in Sanskrit, while 'suka' means 'joy' or 'happiness'. ## Merong Mahawangsa in popular culture - A [Royal Malaysian Navy](/wiki/Royal_Malaysian_Navy) Vessel named *[KD Mahawangsa](/wiki/KD_Mahawangsa)* is named in his honour. - \"The Malay Chronicles: Bloodlines\" was a 2011 Malaysian epic film that tells the life and adventures of the warrior, who is portrayed by British actor [Stephen Rahman-Hughes](/wiki/Stephen_Rahman-Hughes). - [Hikayat Merong Mahawangsa](/wiki/Hikayat_Merong_Mahawangsa) - [Hikayat Hang Tuah](/wiki/Hikayat_Hang_Tuah) - [Sejarah Melayu](/wiki/Sejarah_Melayu) - [Sultanate of Kedah](/wiki/Sultanate_of_Kedah) - Hikayat Merong Mahawangsa - A manuscript at [Universiti Kebangsaan Malaysia](/wiki/Universiti_Kebangsaan_Malaysia) - Low, James (1849). \"A Translation of the Keddah Annals &c\". *The Journal of the Indian Archipelago and Eastern Asia*. **3**: 1–23, 90–101, 162–181, 253–270, 314–336, 467–488.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:33:12.247658",
  "title": "Merong Mahawangsa",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Merong_Mahawangsa"
}