{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:33:14.706603"
  },
  "content": "* *Meyer Flats** was an apartment building on [Meyer Road](/wiki/Meyer_Road) in [Katong, Singapore](/wiki/Katong). Completed in 1928, it served as a companion block to the [Crescent Flats](/wiki/Crescent_Flats), which was the first apartment building built in Singapore. Designed by [Regent Alfred John Bidwell](/wiki/Regent_Alfred_John_Bidwell) for [Manasseh Meyer](/wiki/Manasseh_Meyer), both were demolished to make way for a condominium project. ## Description The three-storey European-style apartment building housed 12 units. It featured a large [hip roof](/wiki/Hip_roof) with extended [eaves](/wiki/Eaves). The building was \"devoid of extraneous embellishments, with the details of the [facade](/wiki/Fa%C3%A7ade) pared down almost to the point of parsimony.\" According to architectural historian Julian Davison, the \"most striking aspect of the latter building is what is absent, namely [balconies](/wiki/Balconies) and [verandahs](/wiki/Veranda), a surprising omission given the building's seaside location.\" The building featured tiled [air vents](/wiki/Air_vents) placed under [windowsills](/wiki/Window_sill), with [windows](/wiki/Window) being spread out in a \"grid-like\" fashion. It featured \"identical\" entrances accompanied by stairwells at both ends. The front door was accompanied by a canopy roof made with reinforced concrete. A window which was octagonal and read \"Meyer Flats\" was placed above the roof. A window, described by Davison as a \"quasi-Venetian affair\", could be found at the upper stairwell. Each of the 12 units in the building featured two bedrooms with attached bathrooms, a living area, a \"small\" dressing room, two servants' rooms and a kitchen. According to Davison, the building stood \"in sharp contrast\" to the [Crescent Flats](/wiki/Crescent_Flats), which was \"purpose-built to make the most of the sea breezes by way of natural ventilation.\" He argued that it \"can be seen as representative of a gradual shift towards a more European style of residential architecture that took place in Singapore between the wars\", and that it represented a \"Europeanisation of the building character that corresponded with a more Western-oriented outlook and lifestyle on the part of Singapore’s expatriate community.\" ## History The building, designed by [Regent Alfred John Bidwell](/wiki/Regent_Alfred_John_Bidwell) of the prominent architectural firm [Swan & Maclaren](/wiki/Swan_%26_Maclaren_Architects) for businessman and community leader [Manasseh Meyer](/wiki/Manasseh_Meyer), was completed in 1928. It stood next to the [Crescent Flats](/wiki/Crescent_Flats), the first apartment block to have been built in Singapore, which was also designed by Bidwell for Meyer. After the end of the [Japanese Occupation of Singapore](/wiki/Japanese_Occupation_of_Singapore), the block was one of several civilian buildings that were occupied by the [Royal Air Force](/wiki/Royal_Air_Force). The Royal Air Force vacated the building, then owned by Kitty Meyer, in 1949. It was then renovated and reopened in December 1951. Most of the units were to be let out to new tenants as many of the previous tenants either could not be traced or were already living elsewhere. In 1989, the [Hong Leong Group](/wiki/Hong_Leong_Group) bought over the land on which the Meyer Flats and Crescent Flats stood for $56 million. The group, which planned to develop high-rise apartments on the site, launched a competition for its development. It approached some architects, asking if they could redevelop the site while preserving the flats, while approaching other architects, asking them to \"work on the premise that the two blocks of flats will be demolished.\" By then, the controlled rent at the building was $700. In October 1991, it was announced that both buildings were to be vacated by the following year, after which they were to be demolished to make way for a condominium project. This decision was criticised by prominent local architect Lee Kip Lin, then-Singapore Institute of Architects president Tay Kheng Soon and then-Singapore Heritage Society president [William S. W. Lim](/wiki/William_S._W._Lim), who believed that they should have been gazetted for conservation instead. The company declined the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority)'s offers of development incentives in exchange for the gazetting of the buildings for conservation.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:33:14.706224",
  "title": "Meyer Flats",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Meyer_Flats"
}