{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:33:24.941884"
  },
  "content": "The [Royal Brunei Armed Forces](/wiki/Royal_Brunei_Armed_Forces) (RBAF) is the [military](/wiki/Military) of the [sultanate](/wiki/Sultanate) nation of [Brunei Darussalam](/wiki/Brunei). In addition to the Royal Brunei Armed Forces, Brunei also hosts bases for the [British Army](/wiki/British_Army) and the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces). ## Royal Brunei Armed Forces The military of the sultanate nation of Brunei is known as the [Royal Brunei Armed Forces](/wiki/Royal_Brunei_Armed_Forces), or *Angkatan Bersenjata Diraja Brunei* in [Malay](/wiki/Malay_language), often abbreviated ABDB. It comprises the Land Forces, the Air Force, the Navy, Support Services, and the Training Institute. ## Foreign military forces ### British Garrison Brunei A [Gurkha](/wiki/Gurkha) Battalion of the [British Forces Brunei](/wiki/British_Forces_Brunei) (BFB) from the [British Army](/wiki/British_Army) has been maintained in Brunei at the request of the [Sultan of Brunei](/wiki/Hassanal_Bolkiah) subsequent to the 1962 [Brunei revolt](/wiki/Brunei_revolt). The battalion is centered on the outskirts of [Seria](/wiki/Seria) in the west of the nation. Headquarters BFB and the Resident Infantry Battalion (RIB), which is presently the 2nd Battalion, [Royal Gurkha Rifles](/wiki/Royal_Gurkha_Rifles), are located at Tuker Lines. The RIB rotates every three years with its sister Battalion in [Shorncliffe](/wiki/Shorncliffe_Army_Camp), [United Kingdom](/wiki/United_Kingdom) to maintain operational currency. It is the only completely acclimated jungle specialty Battalion in the British Army. The jungle provides a special setting for honing dismounted [infantry](/wiki/Infantry) training and skills, ranging from individual [marksmanship](/wiki/Marksman), [navigation](/wiki/Navigation), and [survival training](/wiki/Survival_skills) to the creation of [doctrine](/wiki/Doctrine) for [jungle combat](/wiki/Jungle_warfare) at the [Battle Group](/wiki/Battlegroup_(army)) level. Nearby, the [British Army's Jungle Warfare Division](/wiki/British_Army_Jungle_Warfare_Training_School) (JWD) and the [No. 230 Squadron RAF](/wiki/No._230_Squadron_RAF) both call Medicina Lines home. During their exercises in Brunei, JWD, the RIB, and other units get aerial assistance from 230 Flight. Given the complexity of the jungle and the difficulty of getting about without a vehicle, this feature, along with Brunei Boat Section, is essential. JWD offers training to certify troops from throughout the British Army and alliance partners as Operational Tracking Instructors and Jungle Warfare Instructors. The Sultan has appointed the [Gurkha Reserve Unit](/wiki/Gurkha_Reserve_Unit) (GRU), an elite group of Nepalese troops, to guard the royal household, the populace, and important oil infrastructure. The majority of the 500 Gurkhas who work for the Brunei Reserve Unit are ex-members of the Singapore Police Force and British Army who joined the GRU as a second career. ### Singapore Armed Forces A tight and long-standing defense alliance exists between [Singapore and Brunei](/wiki/Brunei%E2%80%93Singapore_relations). Both militaries cooperate through periodic bilateral exercises, business exchanges, visits, and cross-attendance of courses, in addition to the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces) (SAF)'s ongoing training exercises in Brunei that have been going on for more than 40 years. Singapore also maintains a training establishment in Brunei, known as the Jalan Aman Camp and operates [support helicopters](/wiki/Military_helicopter) mainly to transport the [soldiers](/wiki/Soldier) to Lakiun Camp in [Temburong District](/wiki/Temburong_District) for jungle training. The other Singapore military establishment in Brunei is the Lakiun Camp in Temburong. This provides jungle training for the SAF in the interior of Temburong. [Prime Minister](/wiki/Prime_Minister_of_Singapore) [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) said on 6 October 2017, during a visit to see jungle and survival training at Temburong, that SAF personnel take care to maintain the environment in excellent shape for future trainees even as they engage in realistic training there. For instance, Mr. Lee pointed us that the soldiers utilized pouches to store the [blank round cartridges](/wiki/Blank_(cartridge)) they used to fire from their [machine guns](/wiki/Machine_gun) and [rifles](/wiki/Rifle). This was done to prevent them from leaving behind empty [shells](/wiki/Shell_(projectile)) in the forest, which has served as a vital training ground for the SAF for more than 40 years. ### Pakistan Armed Forces A British Loan Service Medical Officer founded the RBAF' Medical Service in 1964. To meet the needs of the Royal Malay Regiment, the Medical Service was founded. The first Medical Reception Station, or MRS for short, was built in the Berakas Garrison at F13, Jalan Abu Bakar. The British Loan Service was discontinued in 2011 when additional regional medical officers joined the medical service. To allow local medical officers to advance professionally, [Pakistani Army](/wiki/Pakistan_Army) [medical officers](/wiki/Physician) have been seconded since 2014. There are now 20 officers working with the Medical Service, including 10 local medical officers (four of them are female), four Pakistani Army medical officers who have been seconded, one administrative officer, and one training officer. There are 105 civilian employees and 142 military employees (98 men and 44 women). - The British Army in Brunei — British Army official website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:33:24.941598",
  "title": "Military forces based in Brunei",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Military_forces_based_in_Brunei"
}