{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:33:33.589106"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Minangkabau businesspeople\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(February 2019)* *(Learn how and when to remove this message)* **Minangkabau businesspeople** refers to merchants from the [Minangkabau Highlands](/wiki/Minangkabau_Highlands) in central Sumatra, [Indonesia](/wiki/Indonesia). Minangkabau are the ethnic majority in [West Sumatra](/wiki/West_Sumatra) and [Negeri Sembilan](/wiki/Negeri_Sembilan). Minangkabau are also a recognised minority in other parts of Indonesia as well as [Malaysia](/wiki/Malaysia), [Singapore](/wiki/Singapore) and the [Netherlands](/wiki/Netherlands). ## History For centuries, the Minangkabau trade in mining and agriculture products has been a major source of the dynamic progress of the [Indian Ocean economy](/wiki/Indian_Ocean_trade). ### 7th–18th century Minangkabau traders have been trading since the 7th century. They became influential traders operating on the west and east coast of Sumatra. The gold trade was originally the main trade of the [Minangkabau people](/wiki/Minangkabau_people). The [Tanah Datar Valley](/wiki/Tanah_Datar_Regency) was an important place as gold producer for the Minangkabau economy.: 69 The pursuit of gold sometimes encourages migration of Minang people. The arrival of the Minangkabau people in the northwest of Jambi, was caused by the search for gold.: 79 Invited by King Regale and his predecessors, many Minang people crossed the [Malacca strait](/wiki/Malacca_strait) to [Johor](/wiki/Johor) to collect gold chunks. The Minangkabau gold traders were often the leading mining entrepreneurs, who relied on the [Tanah Datar political system](/wiki/Pagaruyung_Kingdom) to protect them as they led their caravan of one hundred or more men on foot down the rugged slopes of [Bukit Barisan](/wiki/Bukit_Barisan) to the harbor in the west coast. By the late 18th century, gold mines were running out and their fortunes had reached a nadir. After gold reserves declined, trade of agriculture commodities became the main business of the Minang people. The pepper, acacia and gambier trade flourished in the 15th-18th century, as well as the coffee trade in the 18th to 19th century. The commodities brought from the [Minangkabau Highlands](/wiki/Minangkabau_Highlands) to the Malacca strait or the [Indian Ocean](/wiki/Indian_Ocean) to be sold to foreign traders. Most of trade to the east coast was carried out via major rivers such as the [Kampar](/wiki/Kampar_River), [Siak](/wiki/Siak_River), [Indragiri](/wiki/Indragiri_River) and [Batang Hari](/wiki/Batang_Hari_River). Because of the trading activity, many Minang traders migrated and established colonies along the west and east coast of Sumatra, even to the [Malay peninsula](/wiki/Malay_Peninsula). On the west coast, they established trading posts in [Meulaboh](/wiki/Meulaboh), [Barus](/wiki/Barus), [Natal](/wiki/Natal,_North_Sumatra), [Pariaman](/wiki/Pariaman), [Padang](/wiki/Padang) up to [Bengkulu](/wiki/Bengkulu). In the east coast, Minang traders colonies stretched from [Batubara](/wiki/Batubara_Regency), [Pelalawan](/wiki/Pelalawan_Regency), [Siak](/wiki/Siak_Regency) up to [Jambi](/wiki/Jambi). Since the emergence of [Srivijaya Kingdom](/wiki/Srivijaya) and continued to [Malacca Sultanate](/wiki/Malacca_Sultanate), many Minangkabau traders worked for the kings. The role of Minangkabau traders began to decline since the [Dutch](/wiki/Dutch_East_India_Company) control of the west coast of Sumatra. The establishment of [Penang](/wiki/Penang) and [Singapore](/wiki/Singapore) in the Malacca strait, revived trade between Minangkabau and the outside world. Consequently, many villages in the Minangkabau highland immediately became prosperous. Besides being intermediary traders, many Minang merchants as cross-strait traders. These traders transport various commodities that came from the interior of Sumatra to be sold to foreign ships in the [Straits Settlements](/wiki/Straits_Settlements). In addition to trading in the Malacca strait, the cross-strait businessmen also operate in the west coast of Sumatra, the [Karimata Islands](/wiki/Karimata_Islands), the [Sunda Strait](/wiki/Sunda_Strait), the [Java Sea](/wiki/Java_Sea), the [Sulu Sea](/wiki/Sulu_Sea) up to the [Maluku Islands](/wiki/Maluku_Islands). Besides three brothers: Nakhoda Bayan, Nakhoda Intan, and Nakhoda Kecil; Nakhoda Mangkuto, who was later succeeded by his son Nakhoda Muda, were some of the successful cross-strait traders. In the second half 18th century, new crops and industries flourished in Minangkabau. Cotton cultivation was progress rapidly and provides material for cotton weaving in [Agam](/wiki/Agam_Regency). Gambier tree was planted and used as medicine, which later became an export commodity in [Limapuluh Kota](/wiki/Lima_Puluh_Kota_Regency). Furthermore in the west coast, growing salt ponds.: 106 It was stimulate some of entrepreneurs to achieve more wealth, and then laid the path for the development of the [Padri movement](/wiki/Padri_War), a religious reform movement pioneered by [Tuanku Nan Tuo](/wiki/Tuanku_Nan_Tuo) and [Tuanku Nan Renceh](/wiki/Tuanku_Nan_Renceh). ### 19th–20th century At the beginning 19th century, European traders especially the Dutch, began to dominate the Minangkabau economy. The Padri War which lasted for more than 30 years, tried to expel the Dutch merchants who tried to monopolize all Minangkabau trade goods. The defeat of the Padri troops destroyed the Minangkabau economy, and the Minangkabau world under the rule of the Dutch East Indies. Despite being under colonial control, the Minang realm also gave birth to several influential businessmen, including Abdul Gani Rajo Mangkuto and Muhammad Saleh. In 1914, several Minang traders, headed by Taher Marah Soetan, founded the Sarikat Usaha. In addition to strengthening Minang business, this union also aims to promote education and the struggle for independence. In 1930s, two prominent Minangs enterprises : Bank Nasional and Djohan Djohor were established in Bukittinggi and Jakarta respectively. At that time, Djohan Djohor was one of the leading textile importer who managed by three Minang entrepreneurs, namely Ayub Rais and the brothers Djohan Sutan Sulaiman and Djohor Sutan Perpatih. The revival of Minang traders occurred again after [Indonesian independence](/wiki/Indonesian_Independence). Between 1950 and 1965, many Minangkabaus business standing strengthened after being limited to small businesses in the colonial period. Hasyim Ning, Rahman Tamin, Sidi Tando and Rukmini Zainal Abidin were the top conglomerates in Indonesia during the [liberal democracy period](/wiki/Liberal_democracy_period_in_Indonesia). At that time, Minangkabau was among the most wealthy groups in Indonesia.: 107 In the [New Order era](/wiki/New_Order_(Indonesia)), the government's policy in favor of [Chinese](/wiki/Chinese_Indonesians) traders was detrimental to Minangkabau traders. Chinese capitalists, called the *cukong*, were supported by the military, which emerged as the dominant political force after 1965.: 272 At that time, the Minang merchants were experiencing difficult in bank loans and obtaining business permits. On the other hand, in [Malaysia](/wiki/Malaysia) they actually get convenience because of [government policies that prioritize indigenous traders](/wiki/Malaysian_New_Economic_Policy). As a result, many Minang entrepreneurs have succeeded in Malaysia, such as [Nasimuddin Amin](/wiki/SM_Nasimuddin_SM_Amin), [Kamarudin Meranun](/wiki/Kamarudin_Meranun), and also the royal family of [Negeri Sembilan](/wiki/Negeri_Sembilan) who owned some of companies. At the end of 1990s, several Minang businessmen led by [Abdul Latief](/wiki/Abdul_Latief_(Indonesian_businessman)), Aminuzal Amin, Nasroel Chas, and [Fahmi Idris](/wiki/Fahmi_Idris) established a joint venture company Nagari Development Corporation (NDC), which aims to improve the Minangkabau community. ## Culture The Minangkabau people are known in Indonesia because they are widely involved in various business activities. Therefore, they are seen as a community that has a high entrepreneurial spirit. Entrepreneurship is one of the ingrained cultures in Minangkabau society. For the Minang people, as a trader is not just for living and pursuing wealth, but also as a form of self-existence to become an independent person. In the egalitarian Minang culture, everyone will try to be a leader. The principle \"*elok manjadi kapalo samuik daripado manjadi ikua gajah* (better to be a leader in small business than a subordinate in large company)\" is a common principle of Minang community. Being a trader is one of the ways to fulfilling this principle. As a merchant, the Minang people can achieve their ambitions, make a live according to their wishes, live freely without any party to restrain them. So that, many young [Minangkabau migrants](/wiki/Overseas_Minangkabau) prefer to be a trader even they grapple the scorch heat on the roadside. Furthermore, the development of trading culture in the Minang community is due to the existence of inheritance (*pusako tinggi*) which guarantees land ownership, and its function like safety net and sustainability for every single person in the community. With owning of the land, the position of the Minang community is not only as cultivators, but also as traders who sell their products to the end users. ## Business The culinary business is the Minangkabau merchants' favored sector. Minangkabau restaurants, known as *Padang Restaurant*, scattered throughout Indonesia as well as [Malaysia](/wiki/Malaysia), [Singapore](/wiki/Singapore), [Australia](/wiki/Australia), and the [Netherlands](/wiki/Netherlands). Some merchants develop their own brand for their restaurants. The prominent Minangkabau restaurant chain is [Restoran Sederhana](/wiki/Restoran_Sederhana) managed by Bustamam, which has over 160 outlets across Indonesia and Malaysia. Besides Restoran Sederhana, other Minang restaurant chains that have expanded overseas are Sari Ratu, Garuda and Natrabu. There are also several food stalls owned by Minang merchants that already have hundreds outlets, such as Sabana and D'Besto. Both of brands are Indonesian version of [KFC](/wiki/KFC). In addition, there are restaurants that have characteristic and trademark of certain region. Entrepreneurs from Kapau (near [Bukittinggi](/wiki/Bukittinggi)) usually selling [Nasi kapau](/wiki/Nasi_kapau), a kind of Minang version of mixed rice. Some of [Pariaman](/wiki/Pariaman), [Payakumbuh](/wiki/Payakumbuh), and [Padang Panjang](/wiki/Padang_Panjang) food traders selling [Sate padang](/wiki/Sate_padang) and [Soto padang](/wiki/Soto_padang). Meanwhile, traders from Kubang (near Payakumbuh) selling [martabak](/wiki/Martabak) with the trademark \"Martabak Kubang\". The number of Minang traders who sell food has made [Minangkabau cuisine](/wiki/Padang_cuisine) is among the most popular food in [Maritime Southeast Asia](/wiki/Maritime_Southeast_Asia). A significant number of Minangkabau merchants were also involved in hotel and hospital industry. In major cities in Java, Sumatra, and Bali, some of Minang businessmen own medium-sized hotels. They also run many general and maternity hospitals. Two of the prominent hotel chains owned by Minangkabau entrepreneurs are Menteng Group Hotel and Hotel Pangeran. Meanwhile, Awal Bros (currently Primaya) hospital and Bunda hospital are the largest hospital chains owned by Minangs. Besides being well-known as hospitality entrepreneurs, Minang people are famous as textile merchants. Most of the traditional markets in Indonesia's major cities are occupied by Minang textile traders. In [Jakarta](/wiki/Jakarta), much of textile or fashion stores are owned by Minang traders. They are found in textile centers such as [Tanah Abang](/wiki/Tanah_Abang), [Senen](/wiki/Senen), [Jatinegara](/wiki/Jatinegara) and [Blok M](/wiki/Blok_M). The Minang traders are still dominate in textile centers of [Medan](/wiki/Medan), [Pekanbaru](/wiki/Pekanbaru), [Batam](/wiki/Batam), [Jambi](/wiki/Jambi), [Palembang](/wiki/Palembang) and [Bandung](/wiki/Bandung). They are also occupied some of textile market in [Surabaya](/wiki/Surabaya), [Yogyakarta](/wiki/Yogyakarta), [Makassar](/wiki/Makassar), as well as [Kuala Lumpur](/wiki/Kuala_Lumpur). During the 1950-1980s, Rahman Tamin was one of the leading textile entrepreneur in Indonesia. Nowadays, some of Minang textile entrepreneurs have also developing chain of wholesale clothing stores, such as Elzatta of Elidawati Ali Oemar as well as Shafira and Zoya by Fenny Mustafa. Historically, a number of publishing houses and media companies in Indonesia were founded by Minangkabaus. They include Warta Berita, Soeloeh Melajoe, and Oetoesan Melajoe, founded by Datuk Sutan Maharaja; Panji Masyarakat magazine by [Hamka](/wiki/Hamka); the Pedoman newspaper founded by [Rosihan Anwar](/wiki/Rosihan_Anwar); [Waspada](/wiki/Waspada) by [Ani Idrus](/wiki/Ani_Idrus), Kartini magazine by Lukman Umar, [Femina](/wiki/Femina_(Indonesia)) magazine by [Sutan Takdir Alisjahbana](/wiki/Sutan_Takdir_Alisjahbana)'s family, as well as Tiras magazine, Neraca daily newspaper, and Lativi (currently [tvOne](/wiki/TvOne_(Indonesian_TV_network))) by [Abdul Latief](/wiki/Abdul_Latief_(Indonesian_businessman)). In Malaysia, Hussamuddin Yaacub is a Minang tycoon that has a print media business. He founded the Karangkraf Group. Minangkabau businesspeople also play a role in developing Indonesia and Malaysia economy, ranging from banking, coal mining, oil palm and rubber plantations, pharmacy, automotive, entertainment, groceries, as well as education industry. Currently,[*when?*] they are also developing some of [start-up companies](/wiki/Startup_company) as well as being quite active as capital market players at the [Indonesia](/wiki/Indonesia_Stock_Exchange) and [Malaysia stock exchanges](/wiki/Bursa_Malaysia). At the early of Indonesian independence, Sutan Sjahsam, the brother of [Sutan Sjahrir](/wiki/Sutan_Sjahrir), was leading figures in capital market and financial brokerage. ## Notable Minangkabau business people - [Hasyim Ning](/wiki/Hasyim_Ning). A Minangkabau tycoon who owned the Indonesian Service Company, an assembler company that holds a European-American automotive brand license. He was known as the *Indonesian Henry Ford*. In addition to the automotive field, Hasyim found success in the hospitality business, focusing on hotels and tours. - [Abdul Latief](/wiki/Abdul_Latief_(Indonesian_businessman)). The owner and founder of ALatief Corporation. Its subsidiaries are Pasaraya, two shopping malls in Jakarta, and [TV One](/wiki/Lativi), the television network. Latief was a politician and [Labour minister](/wiki/Ministry_of_Manpower_(Indonesia)) in the [New Order](/wiki/New_Order_(Indonesia)) era. - [Basrizal Koto](/wiki/Basrizal_Koto). One of a successful Minangkabau conglomerate. Basrizal, usually known as Basko, has a hotel, mining company, shopping centre, and the largest cattle company in [South East Asia](/wiki/South_East_Asia). Basko's businesses are based in Sumatra, mainly in Pekanbaru and Padang. - [Fahmi Idris](/wiki/Fahmi_Idris). Founder of PT Kodel and a politician in the [Golkar](/wiki/Golkar) party. His businesses were in trading and investment. - [Tunku Tan Sri Abdullah](/wiki/Tunku_Tan_Sri_Abdullah). A Minang-Malaysian businessman who operated a manufacturing company and an iron and steel company under the corporate flag of the [Melewar Corporation](/wiki/Melewar_Corporation). - [Kamarudin Meranun](/wiki/Kamarudin_Meranun). A Minang-Malaysian businessman who is currently the Chairman of [AirAsia](/wiki/AirAsia) and CEO of the [Tune Group](/wiki/Tune_Group). - [SM Nasimuddin SM Amin](/wiki/SM_Nasimuddin_SM_Amin). A Minang-Malaysian conglomerate who founded and owned of the [Naza Group](/wiki/Naza) of Malaysia. - [List of Minangkabau people](/wiki/List_of_Minangkabau_people) - [Overseas Minangkabau](/wiki/Overseas_Minangkabau)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:33:33.588710",
  "title": "Minangkabau businesspeople",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Minangkabau_businesspeople"
}