{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:33:38.680033"
  },
  "content": "Austronesian ethnic groupEthnic group The **Minangkabau**[a] ([Minangkabau](/wiki/Minangkabau_language): *Bangso Minangkabau*, *Urang Minangkabau* or *Urang Awak*, lit. 'our people', [Jawi script](/wiki/Jawi_script): منڠكبو; [Indonesian](/wiki/Indonesian_language): *Orang Minangkabau*; [Malay](/wiki/Malay_language): *Orang Minangkabau*, [Jawi script](/wiki/Jawi_script): أورڠ مينڠکاباو), **Minangkabos**, or simply **Minang**,[b] are an [Austronesian](/wiki/Austronesian_peoples) [ethnic group](/wiki/Ethnicity) native to the [Minangkabau Highlands](/wiki/Minangkabau_Highlands) of [Western Sumatra](/wiki/West_Sumatra) region on the [Indonesian](/wiki/Indonesia) island of [Sumatra](/wiki/Sumatra). The Minangkabau's West Sumatera homelands was the seat of the [Pagaruyung Kingdom](/wiki/Pagaruyung_kingdom), believed by early historians to have been the cradle of the [Malay race](/wiki/Malay_race), and the location of the [Padri War](/wiki/Padri_Wars) (1821 to 1837). Minangkabau are the ethnic majority in [West Sumatra](/wiki/West_Sumatra) and [Negeri Sembilan](/wiki/Negeri_Sembilan). Minangkabau are also a recognised minority in other parts of [Indonesia](/wiki/Indonesia) as well as [Malaysia](/wiki/Malaysia), [Singapore](/wiki/Singapore), and the [Netherlands](/wiki/Netherlands). ## Etymology There are several possible etymologies for the term **Minangkabau** ([Minangkabau](/wiki/Minangkabau_language): *Minang* [Jawi script](/wiki/Jawi_script): منڠ). While the word \"kabau\" undisputedly translates to \"buffalo\", the word \"minang\" is traditionally known as the *pinang* fruit ([areca nut](/wiki/Areca_nut)) chewed with *sirih* ([betel](/wiki/Betel)) leaves. But there is also a folklore that mention that term *Minangkabau* came from a popular legend that was derived from a territorial dispute between a people and a prince from a neighbouring region. To avoid the battle, the local people proposed a fight to the death between two [water buffaloes](/wiki/Water_buffalo) (*kabau*) to settle the dispute. The prince agreed and produced the largest, meanest, most aggressive buffalo. The villagers on other hand produced a hungry baby calf with its small horns ground to be as sharp as knives. Seeing the adult buffalo across the field, the calf ran forward, hoping for milk. The big buffalo saw no threat in the baby buffalo and paid no attention to it, looking around for a worthy opponent. But when the baby thrust his head under the big bull's belly, looking for an udder, the sharpened horns punctured and killed the bull giving the villagers their victory (*menang*, hence *minang kabau*: \"victors of the buffalo\" which eventually became *Minangkabau*). That legend, however, is known to be a mere tale and that the word \"minang\" is too far from the word \"menang\" which means 'win'.[*citation needed*] The legend however has its rebuttals as the word 'minang' refers to the consumption of [areca nut](/wiki/Areca_nut) (*pinang*), yet there has not been any popular explanation on the word 'minang' that relates the aforementioned action to the word for \"water buffalo\".[*citation needed*] The first mention of the name Minangkabau as **Minanga Tamwan**, is in the late 7th century [Kedukan Bukit inscription](/wiki/Kedukan_Bukit_inscription), describing [Sri Jayanasa](/wiki/Sri_Jayanasa_of_Srivijaya)'s sacred journey from Minanga Tamwan accompanied with 20,000 soldiers heading to Matajap and conquering several areas in the southern of Sumatra. ## History The [Minangkabau language](/wiki/Minangkabau_language) is a member of the [Austronesian language](/wiki/Austronesian_languages) family, and is closest to the [Malay language](/wiki/Malay_language), though when the two languages split from a common ancestor and the precise historical relationship between Malay and Minangkabau culture is not known. Until the 20th century the majority of the Sumatran population lived in the highlands. The highlands are well suited for human habitation, with plentiful fresh water, fertile soil, a cool climate, and valuable commodities. It is probable that [wet rice cultivation](/wiki/Paddy_field) evolved in the [Minangkabau Highlands](/wiki/Minangkabau_Highlands) long before it appeared in other parts of Sumatra, and predates significant foreign contact. [Adityawarman](/wiki/Adityawarman), a follower of [Tantric Buddhism](/wiki/Vajrayana) with ties to the [Singhasari](/wiki/Singhasari) and [Majapahit](/wiki/Majapahit) kingdoms of Java, is believed to have founded a kingdom in the Minangkabau highlands at [Pagaruyung](/wiki/Pagaruyung_kingdom) and ruled between 1347 and 1375.: 232 The establishment of a royal system seems to have involved conflict and violence, eventually leading to a division of villages into one of two systems of tradition, *Bodi-Caniago system* based on [Adat Perpatih](/wiki/Adat_perpatih) and *Koto-Piliang system* based on Adat Temenggung, the latter having overt allegiances to royalty. By the 16th century, the time of the next report after the reign of Adityawarman, royal power had been split into three recognised reigning kings. They were the King of the World (*Raja Alam*), the King of Adat (*Raja Adat*), and the King of Religion (*Raja Ibadat*), and collectively they were known as the Kings of the Three Seats (*Rajo Tigo Selo*). The Minangkabau kings were charismatic or magical figures, but did not have much authority over the conduct of village affairs. Around the 16th century, the Minangkabau [started to convert to Islam](/wiki/Islam_in_West_Sumatra#History). The first contact between the Minangkabau and western nations occurred with the 1529 voyage of [Jean Parmentier](/wiki/Jean_Parmentier_(explorer)) to Sumatra. The [Dutch East India Company](/wiki/Dutch_East_India_Company) first acquired gold at [Pariaman](/wiki/Pariaman) in 1651, but later moved south to [Padang](/wiki/Padang) to avoid interference from the Acehnese occupiers. In 1663 the Dutch agreed to protect and liberate local villages from the Acehnese in return for a trading monopoly, and as a result setup trading posts at [Painan](/wiki/Painan) and [Padang](/wiki/Padang). Until early in the 19th century the Dutch remained content with their coastal trade of gold and produce, and made no attempt to visit the Minangkabau highlands. As a result of conflict in Europe, the British occupied Padang from 1781 to 1784 during the [Fourth Anglo-Dutch War](/wiki/Fourth_Anglo-Dutch_War), and again from 1795 to 1819 during the [Napoleonic Wars](/wiki/Napoleonic_Wars). Late in the 18th century the gold supply which provided the economic base for Minangkabau royalty began to be exhausted. Around the same time other parts of the Minangkabau economy had a period of unparalleled expansion as new opportunities for the export of agricultural commodities arose, particularly with coffee which was in very high demand. A civil war started in 1803 with the *Padri* fundamentalist Islamic group in conflict with the traditional syncretic groups, elite families and Pagaruyung royals. As a result of a treaty with a number of penghulu and representatives of the Minangkabau royal family, Dutch forces made their first attack on a Padri village in April 1821. The first phase of the war ended in 1825 when the Dutch signed an agreement with the Padri leader [Tuanku Imam Bonjol](/wiki/Tuanku_Imam_Bonjol) to halt hostilities, allowing them to redeploy their forces to fight the [Java War](/wiki/Java_War). When fighting resumed in 1832, the reinforced Dutch troops were able to more effectively attack the Padri. The main centre of resistance was captured in 1837, Tuanku Imam Bonjol was captured and exiled soon after, and by the end of the next year the war was effectively over. With the Minangkabau territories now under the control of the Dutch, transportation systems were improved and economic exploitation was intensified. New forms of education were introduced, allowing some Minangkabau to take advantage of a modern education system. The 20th century marked a rise and cultural and political nationalism, culminating in the demand for Indonesian independence. Later rebellions against the Dutch occupation occurred such as the 1908 Anti-Tax Rebellion and the 1927 Communist uprising. During World War II the Minangkabau territories were occupied by the Japanese, and when the Japanese surrendered in August 1945 Indonesia proclaimed independence. The Dutch attempts to regain control of the area were ultimately unsuccessful and in 1949 the Minangkabau territories became part of Indonesia as the province of Central Sumatra. In February 1958, dissatisfaction with the centralist and communist-leaning policies of the [Sukarno](/wiki/Sukarno) administration triggered a revolt which was centred in the Minangkabau region of Sumatra, with rebels proclaiming the [Revolutionary Government of the Republic of Indonesia](/wiki/Revolutionary_Government_of_the_Republic_of_Indonesia) (PRRI) in [Bukittinggi](/wiki/Bukittinggi). The Indonesian military invaded West Sumatra in April 1958 and had recaptured major towns within the next month. A period of guerrilla warfare ensued, but most rebels had surrendered by August 1961. In the years following, West Sumatra was like an occupied territory with Javanese officials occupying most senior civilian, military and police positions. The policies of centralisation continued under the [Suharto](/wiki/Suharto) regime. The national government legislated to apply the Javanese *desa* village system throughout Indonesia, and in 1983 the traditional Minangkabau *[nagari](/wiki/Nagari_(settlement))* village units were split into smaller *jorong* units, thereby destroying the traditional village social and cultural institutions. In the years following the downfall of the Suharto regime decentralisation policies were implemented, giving more autonomy to provinces, thereby allowing West Sumatra to reinstitute the *nagari* system. ## Historiography The traditional [historiography](/wiki/Historiography) of the Minangkabau tells of the development of the Minangkabau World (*alam Minangkabau*) and its *adat*. These stories are derived from an oral history which was transmitted between generations before the Minangkabau had a written language. The first Minangkabau are said to have arrived by ship and landed on [Mount Marapi](/wiki/Mount_Marapi) when it was no bigger than the size of an egg, which protruded from a surrounding body of water. After the waters receded the Minangkabau proliferated and dispersed to the slopes and valleys surrounding the volcano, a region called the *darek*. The *darek* is composed of three *luhak* – [Tanah Datar](/wiki/Tanah_Datar_Regency), [Agam](/wiki/Agam_Regency) and [Limapuluh Koto](/wiki/Lima_Puluh_Kota_Regency). The *tambo* claims the ship was sailed by a descendant of [Alexander the Great](/wiki/Alexander_the_Great) (*Iskandar Zulkarnain*). A division in Minangkabau *adat* into two systems is said to be the result of conflict between two half-brothers Datuak Katumangguangan and Datuak Parpatiah nan Sabatang, who were the leaders who formulated the foundations of Minangkabau *adat*. The former accepted [Adityawarman](/wiki/Adityawarman), a prince from Majapahit, as a king while the latter considered him a minister, and a civil war ensued. The Bodi Caniago/[Adat perpatih](/wiki/Adat_perpatih) system formulated by Datuak Parpatiah nan Sabatang is based upon egalitarian principles with all *panghulu* (clan chiefs) being equal while the Koto Piliang /Adat Katumangguangan system is more autocratic with there being a hierarchy of *panghulu*. Each village (*nagari*) in the *darek* was an autonomous \"republic\", and governed independently of the Minangkabau kings using one of the two *adat* systems. After the *darek* was settled, new outside settlements were created and ruled using the Koto Piliang system by *rajo* who were representatives of the king. ## Culture The Minangkabau have large corporate descent groups, but they traditionally reckon descent matrilineally. A young boy, for instance, has his primary responsibility to his mother's and sisters' [clans](/wiki/Minangkabau_clans). It is considered \"customary\" and ideal for married sisters to remain in their parental home, with their husbands having a sort of visiting status. Not everyone lives up to this ideal, however. In the 1990s, anthropologist Evelyn Blackwood studied a relatively conservative village in Sumatra Barat where only about 22 percent of the households were \"matrihouses\", consisting of a mother and a married daughter or daughters. Nonetheless, there is a shared ideal among Minangkabau in which sisters and unmarried lineage members try to live close to one another or even in the same house. Landholding is one of the crucial functions of the [*suku*](/wiki/Minangkabau_clans) (female lineage unit). Because Minangkabau men, like Acehnese men, often migrate to seek experience, wealth, and commercial success, the women's kin group is responsible for maintaining the continuity of the family and the distribution and cultivation of the land. These family groups, however, are typically led by a *penghulu* (headman), elected by groups of lineage leaders. With the agrarian base of the Minangkabau economy in decline, the suku—as a landholding unit—has also been declining somewhat in importance, especially in urban areas. Indeed, the position of penghulu is not always filled after the death of the incumbent, particularly if lineage members are not willing to bear the expense of the ceremony required to install a new penghulu. The Minangkabau (in short Minang) are also known for their devotion to Islam. A dominant majority of both males and females pray five times a day, fast during the month of Ramadan, and express the desire to make the holy pilgrimage ([Hajj](/wiki/Hajj)) to Mecca at least once in their lifetime. Each Minangkabau neighbourhood has a *Musalla*, which means \"a temporary place of prayer\" in Arabic. In the neighbourhood *Musalla*, men and women pray together, although separated into their respective gender-designated sections. A high percentage of women and girls wear the headscarf. As early as the age of 7, boys traditionally leave their homes and live in a *[surau](/wiki/Surau)* (traditionally: the house of men of a village where the boys learn from older men reading, reciting qur'an, simple math, and other survival skills) to learn religious and cultural ([adat](/wiki/Adat)) teachings. At the surau during night time (after the Isyak prayers), these youngsters are taught the traditional Minangkabau art of self-defence, called as Silek, or [Silat](/wiki/Silat) in Malay. When they are teenagers, they are encouraged to leave their hometown to learn in schools or through experiences outside of their hometown so that, as adults, they can return home wise and 'useful' to society and are able to contribute their thinking and experience to run the family or *nagari* (hometown) when they sit as members of the 'council of maternal uncles and maternal granduncles' (ninik-mamak). This tradition has created Minang communities in many Indonesian cities and towns, which nevertheless are still tied closely to their homeland; a state in [Malaysia](/wiki/Malaysia) named [Negeri Sembilan](/wiki/Negeri_Sembilan) especially is heavily influenced by Minang culture because [Negeri Sembilan](/wiki/Negeri_Sembilan) was originally Minangkabau's colony. By acquiring property and education through merantau experience, a young man can attempt to influence his own destiny in positive ways. Increasingly, married couples go off on merantau; in such situations, the woman's role tends to change. When married couples reside in urban areas or outside the Minangkabau region and a Minang woman marries a non-Minang man, the woman will rely on the protection provided by the husband more than that of her council of uncles. Because in Minang culture marriage is merely a 'commitment of two people' and not at all a 'union', there is no stigma attached to divorce. The Minangkabau were prominent among the intellectual figures in the Indonesian independence movement. Not only were they strongly embedded themselves surrounding Islamic traditions – which counteracted the influence of the Protestant Dutch – they also had a sense of cultural pride just as like every other Sumatran especially with their traditional belief of egalitarianism of \"Standing as tall, sitting as low\" (that no body stand or sit on an increased stage). They also speak a language closely related to the [Malay](/wiki/Malay_language) variant [spoken in newly formed Indonesia](/wiki/Indonesian_language), which was considerably freer of hierarchical connotations than [Javanese](/wiki/Javanese_language). The tradition of merantau also meant that the Minangkabau developed a cosmopolitan bourgeoisie that readily adopted and promoted the ideas of an emerging nation-state. Due to their culture that stresses the importance of learning, Minang people are over-represented in the educated professions in Indonesia, with many ministers from Minang. *Adat* derives in part from the ancient animist and buddhist belief system of the Minangkabau, which existed before the arrival of Islam to Sumatra. When precisely the religion spread across the island and was adopted by the Minangkabau is unclear, though it probably arrived in West Sumatra around the 16th century. It is *adat* that guides matrilineal inheritance, and though it seems that such a tradition might conflict with the precepts of Islam, the Minangnese insist that it does not. To accommodate both, the Minangkabau make a distinction between high and low inheritance. \"High inheritance\" is the property, including the home and land, which passes among women. \"Low inheritance\" is what a father passes to his children out of his professional earnings. This latter inheritance follows Islamic law, a complex system which dictates, in part, that sons get twice as much as daughters. ### Ceremonies and festivals Minangkabau ceremonies and festivals include: - *Turun mandi* – baby blessing ceremony - *Sunat rasul* – circumcision ceremony - *Baralek* – wedding ceremony - *Batagak pangulu* – clan leader inauguration ceremony. Other clan leaders, all relatives in the same clan and all villagers in the region are invited. The ceremony lasts for seven days or more. - *Turun ka sawah* – community work ceremony - *Manyabik* – harvesting ceremony - *Hari Rayo* – the local observance of [Eid al-Fitr](/wiki/Eid_al-Fitr) - Adoption ceremony - Adat ceremony - Funeral ceremony - Wild boar hunt ceremony - *Maanta pabukoan* – sending food to mother-in-law for [Ramadan](/wiki/Ramadan) - *[Tabuik](/wiki/Tabuik)* – local [Mourning of Muharram](/wiki/Mourning_of_Muharram) in the coastal village of [Pariaman](/wiki/Pariaman) - *Tanah Ta Sirah*, inaugurate a new [datuk](/wiki/Datuk) when the old one died in the few hours (no need to proceed to the batagak pangulu, but the clan must invite all datuk in the region. - *Mambangkik Batang Tarandam*, inaugurate a new datuk when the old one died in the past 10 or 50 years and even more, attendance in the Batagak Pangulu ceremony is mandatory. ### Performing arts Traditional Minangkabau music includes *saluang jo dendang,* which consists of singing to the accompaniment of a *[saluang](/wiki/Saluang)* bamboo flute and *[talempong](/wiki/Talempong)* gong-chime music. Modern popular music based on this traditional music or *pop Minang* also exists produced by record companies in West Sumatra; they are mostly ballads and are not popular with young Minangkabaus. Dances include the *[tari piring](/wiki/Piring_dance)* (plate dance), *tari payung* (umbrella dance), *[tari indang](/wiki/Indang_dance)* (also known as *endang* or *badindin*), and *[tari pasambahan](/wiki/Pasambahan_dance)*. Demonstrations of the *[silat](/wiki/Silat)* martial art are performed. *Pidato adat* are ceremonial orations performed at formal occasions. *[Randai](/wiki/Randai)* is a folk theatre tradition which incorporates music, singing, dance, drama and the *[silat](/wiki/Silat)* martial art. *Randai* is usually performed for traditional ceremonies and festivals, and complex stories may span a number of nights. It is performed as a [theatre-in-the-round](/wiki/Theatre-in-the-round) to achieve an equality and unity between audience members and the performers. *Randai* performances are a synthesis of alternating martial arts dances, songs, and acted scenes. Stories are delivered by the acting and singing and are mostly based upon Minangkabau legends and folktales. *Randai* originated early in the 20th century out of fusion of local martial arts, storytelling and other performance traditions. Men originally played male and female characters in the story but, since the 1960s, women have participated. ### Crafts Particular Minangkabau villages specialise in cottage industries producing handicrafts such as woven sugarcane and reed purses, gold and silver jewellery using [filigree](/wiki/Filigree) and [granulation](/wiki/Granulation_(jewellery)) techniques, woven [songket](/wiki/Songket) textiles, wood carving, embroidery, pottery, and metallurgy. ### Cuisine The staple ingredients of the Minangkabau diet are rice, fish, coconut, green leafy vegetables and chili. Meat is mainly limited to special occasions, and beef and chicken are most commonly used. Pork is not *[halal](/wiki/Halal)* and not consumed, while lamb, goat and game are rarely consumed for reasons of taste and availability. Spiciness is a characteristic of Minangkabau food: The most commonly used herbs and spices are chili, turmeric, ginger and galangal. Vegetables are consumed two or three times a day. Fruits are mainly seasonal, although fruits such as banana, papaya and citrus are continually available. Three meals a day are typical with lunch being the most important, except during the fasting month of [Ramadan](/wiki/Ramadan) when lunch is not eaten. Meals commonly consist of steamed rice, a hot fried dish and a coconut milk dish, with a little variation from breakfast to dinner. Meals are generally eaten from a plate using the fingers of the right hand.[*citation needed*] Snacks are more frequently eaten by people in urban areas than in villages. Western food has had little impact upon Minangkabau consumption and preference. *[Rendang](/wiki/Rendang)* is a dish which is considered to be a characteristic of Minangkabau culture; it is cooked 4–5 times a year. This particular dish is one of the world's renowned dish, especially after crowned the Best Food in CNN's World's 50 Best Foods in 2011 and 2017 by a CNN poll. Other characteristic dishes include *[Asam Padeh](/wiki/Asam_pedas)*, *Soto Padang*, *[Sate Padang](/wiki/Sate_padang)*, *Dendeng Balado* (beef with chili sauce). Food has a central role in the Minangkabau ceremonies which honour religious and life-cycle rites. Minangkabau food is popular among Indonesians and restaurants are present throughout Indonesia. *Nasi Padang* restaurants, named after the capital of West Sumatra, are known for placing a variety of Minangkabau dishes on a customer's table with rice and billing only for what is taken. *Nasi Kapau* is another restaurant variant which specialises in dishes using offal and tamarind to add a sourness to the spicy flavour. ### Architecture *[Rumah gadang](/wiki/Rumah_Gadang)* ([Minangkabau](/wiki/Minangkabau_language): 'big house') or *rumah bagonjong* ([Minangkabau](/wiki/Minangkabau_language): 'spired roof house') are the traditional homes of the Minangkabau. The architecture, construction, internal and external decoration, and the functions of the house reflect the culture and values of the Minangkabau. A *rumah gadang* serves as a residence, a hall for family meetings, and for ceremonial activities. The *rumah gadang* is owned by the women of the family who live there – ownership is passed from mother to daughter. The houses have dramatic curved roof structures with multi-tiered, upswept gables. They are also well distinguished by their rooflines which curve upward from the middle and end in points, in imitation of the upward-curving horns of the water buffalo that supposedly eked the people their name (i.e. \"[victors of the buffalo](/wiki/Minangkabau_(legend))\"). Shuttered windows are built into walls incised with profuse painted floral carvings. The term *rumah gadang* usually refers to the larger communal homes, however, smaller single residences share many of its architectural elements. ### Oral traditions and literature Minangkabau culture has a long history of oral traditions. One is the *pidato adat* (ceremonial orations) which are performed by clan chiefs (*panghulu*) at formal occasions such as weddings, funerals, adoption ceremonies, and *panghulu* inaugurations. These ceremonial orations consist of many forms including *[pantun](/wiki/Pantun)*, aphorisms (*papatah-patitih*), proverbs (*pameo*), religious advice (*petuah*, parables (*tamsia*), two-line aphorisms (*gurindam*), and similes (*ibarat*). Minangkabau traditional folktales (*kaba*) consist of narratives that present the social and personal consequences of either ignoring or observing the ethical teachings and the norms embedded in the *adat*. The storyteller (*tukang kaba*) recites the story in poetic or lyrical prose while accompanying himself on a *[rebab](/wiki/Rebab)*. A theme in Minangkabau folktales is the central role mothers and motherhood has in Minangkabau society, with the folktales *Rancak di Labuah* and *[Malin Kundang](/wiki/Malin_Kundang)* being two examples. *Rancak di Labuah* is about a mother who acts as teacher and adviser to her two growing children. Initially her son is vain and headstrong and only after her perseverance does he become a good son who listens to his mother. *Malin Kundang* is about the dangers of treating your mother badly. A sailor from a poor family voyages to seek his fortune, becoming rich and marrying. After refusing to recognise his elderly mother on his return home, being ashamed of his humble origins, he is cursed and dies when a storm ensues and turn him along with his ship to stone. The said stone is in Air Manis beach and is known by locals as *batu Malin Kundang*. Other popular folktales also relate to the important role of the woman in Minangkabau society. In the *Cindua Mato* epic the woman is the source of wisdom, while in the *Sabai nan Aluih* she is a gentle girl who takes action. *Cindua Mato* (Staring Eye) is about the traditions of Minangkabau royalty. The story involves a mythical Minangkabau queen, Bundo Kanduang, who embodies the behaviours prescribed by *adat*. Cindua Mato, a servant of the queen, uses magic to defeat hostile outside forces and save the kingdom. *Sabai nan Aluih* (The genteel Sabai) is about a girl named Sabai who despite being famous for being a gentle girl with perfect wife skills, avenged the murder of her father by a powerful and evil ruler from a neighbouring village. After her father's death, her cowardly elder brother refuses to confront the murderer and so Sabai decided to take matters into her own hands. She seeks out the murderer and shoots him in revenge. ### Matrilineage The Minangkabau are the largest [matrilineal](/wiki/Matrilineality) society in the world, with property, family name and land passing down from mother to daughter, while religious and political affairs are the responsibility of men, although some women also play important roles in these areas. This custom is called Lareh Bodi-Caniago and is known as [adat perpatih](/wiki/Adat_perpatih) in Malaysia. Today 4.2 million Minangs live in the homeland of West Sumatra.[*citation needed*] As one of the world's most populous (as well as politically and economically influential) matrilineal ethnicities, Minangkabau gender dynamics have been extensively studied by anthropologists.[*citation needed*] The *adat* (Minangkabau: *Adaik*) traditions have allowed Minangkabau women to hold a relatively advantageous position in their society compared to most patriarchal societies,[*citation needed*] because though they do not rule, they are at the center of their society. ## Language The Minangkabau language (*Baso Minangkabau*) is an [Austronesian language](/wiki/Austronesian_languages) belonging to the [Malayic](/wiki/Malayic_languages) linguistic subgroup, which in turn belongs to the [Malayo-Polynesian](/wiki/Malayo-Polynesian_languages) branch. [The Negri Sembilan dialect of Malay](/wiki/Negeri_Sembilan_Malay) used by people in [the aforementioned state](/wiki/Negeri_Sembilan) is closely related to it due to the fact many of the population are descendants of Minangkabau immigrants. The language has a number of dialects and sub-dialects, but native Minangkabau speakers generally have no difficulty understanding the variety of dialects. The differences between dialects are mainly at the [phonological](/wiki/Phonology) level, though some [lexical](/wiki/Lexicon) differences also exist. Minangkabau dialects are regional, consisting of one or more villages (*nagari*), and usually correspond to differences in customs and traditions. Each sub-village (*jorong*) has its own sub-dialect consisting of subtle differences which can be detected by native speakers. The Padang dialect has become the lingua franca for people of different language regions. The Minangkabau society has a [diglossia](/wiki/Diglossia) situation, whereby they use their native language for everyday conversations, while the Malay language is used for most formal occasions, in education, and in writing, even to relatives and friends. The Minangkabau language was originally written using the [Jawi script](/wiki/Jawi_script), an adapted Arabic alphabet. Romanization of the language dates from the 19th century, and a standardised official orthography of the language was published in 1976. Denominations[ISO 639-3](/wiki/ISO_639-3)Population (as of)DialectsMinangkabaumin6,500,000 (1981)Agam, Payakumbuh, Tanah Datar, Sijunjung, Batu Sangkar-Pariangan, Singkarak, Pariaman, Orang Mamak, Ulu, Kampar Ocu, Rokan, Pasaman, Rao, Kuantan, Kerinci-Minangkabau, Pesisir, Aneuk Jamee (Jamee), Painan, Penghulu, Mukomuko.Source: Gordon (2005). Despite widespread use of [Malay](/wiki/Malay_language) in both Malaysia and Indonesia, they do have their own mother tongue; the [Minangkabau language](/wiki/Minangkabau_language) shares many similar words with Malay, yet it has a distinctive pronunciation and some grammatical differences rendering it unintelligible to Malay speakers. ## Customs and religion Prior to conversion to Islam, [Buddhism](/wiki/Buddhism), especially [Tantric Buddhism](/wiki/Vajrayana) was popular in the region. Buddhism in central Sumatra is attested by the [Padang Roco Inscription](/wiki/Padang_Roco_Inscription), dated 1286 CE, which states that an [Avalokiteśvara](/wiki/Avalokite%C5%9Bvara) was brought from Java to Dharmasraya, and this act brought great happiness to the people. Influential Buddhist kingdoms thrived in the area, including the [Pagaruyung Kingdom](/wiki/Pagaruyung_kingdom) and [Melayu Kingdom](/wiki/Melayu_Kingdom). [Animism](/wiki/Animism) had also been an important component of Minangkabau culture. Even after the penetration of Islam into Minangkabau society in the 16th century, animistic beliefs were not extinguished. In this belief system, people were said to have two souls, a real soul and a soul which can disappear called the *semangat*. *Semangat* represents the vitality of life and it is said to be possessed by all living creatures including animals and plants. An illness may be explained as the capture of the *semangat* by an evil spirit, and a shaman (*pawang*) may be consulted to conjure invisible forces and bring comfort to the family. Sacrificial offerings can be made to placate the spirits, and certain objects such as amulets are used as protection. Until the rise of the Padri movement late in the 18th century, Islamic practices such as prayers, fasting and attendance at mosques had been weakly observed in the Minangkabau highlands. The Padri were inspired by the [Wahhabi](/wiki/Wahhabism) movement in Mecca, and sought to eliminate societal problems such as tobacco and opium smoking, gambling and general anarchy by ensuring the tenets of the quran were strictly observed.[*citation needed*] All Minangkabau customs allegedly in conflict with the quran were abolished. Although the Padri were eventually defeated by the Dutch, during this period the relationship between *adat* and religion was reformulated. Previously *adat* (customs) were said to be based upon appropriateness and propriety, but this was changed so that *adat* was more strongly based upon Islamic precepts. The Minangkabau strongly profess [Islam](/wiki/Islam) while at the same time also following their ethnic traditions, or *[adat](/wiki/Adat)*. The Minangkabau *adat* was derived from hereditary wisdom before the arrival of Islam. The present relationship between Islam and *adat* is described in the saying \"traditions [*adat*] are founded upon the [Islamic] law, and the law founded upon the [Qur'an](/wiki/Quran)\" (*adat nan kawi', syara' nan lazim*). With the Minangkabau highlands being the heartland of their culture, and with Islam likely entering the region from coast it is said that \"custom descended, religion ascended\" (*adat manurun, syarak mandaki*). ## Demographics ### Minangkabau population breakdown This table contains the Minangkabau population breakdown in [Indonesia](/wiki/Indonesia). ProvinceMinangkabau population[West Sumatra](/wiki/West_Sumatra)4,219,729[Riau](/wiki/Riau)676,948[North Sumatra](/wiki/North_Sumatra)333,241[Jakarta](/wiki/Jakarta)272,018[West Java](/wiki/West_Java)241,169[Jambi](/wiki/Jambi)163,760[Riau Islands](/wiki/Riau_Islands)162,452[Banten](/wiki/Banten)95,845[Bengkulu](/wiki/Bengkulu)71,472[Lampung](/wiki/Lampung)69,652[Riau Islands](/wiki/Riau_Islands)64,603[Banten](/wiki/Banten)33,112**[Indonesia](/wiki/Indonesia)****6,462,713** ### Overseas Minangkabau Over half of the Minangkabau people can be considered overseas Minangkabaus. They make up the majority of the population of [Negeri Sembilan](/wiki/Negeri_Sembilan), [Naning](/wiki/Naning) (in [Malaysia](/wiki/Malaysia)) as well as [Pekanbaru](/wiki/Pekanbaru) (in Indonesia). They also form a significant minority in the populations of [Jakarta](/wiki/Jakarta), [Bandung](/wiki/Bandung), [Medan](/wiki/Medan), [Batam](/wiki/Batam), [Surabaya](/wiki/Surabaya) and [Palembang](/wiki/Palembang) in Indonesia as well as [Kuala Lumpur](/wiki/Kuala_Lumpur), Malacca, [Penang](/wiki/Penang), Singapore and [Brunei Darussalam](/wiki/Brunei) in the rest of the [Malay world](/wiki/Malay_world).[*page needed*] Minangkabaus have also emigrated as skilled professionals and merchants to the [Netherlands](/wiki/Netherlands), [United States](/wiki/United_States), [Saudi Arabia](/wiki/Saudi_Arabia) and [Australia](/wiki/Australia).[*better source needed*] In the overseas (*rantau*), they have a reputation for being shrewd merchants.[*page needed*] The [matrilineal](/wiki/Matrilineality) culture and economic conditions in West Sumatra have made the Minangkabau people one of the most mobile ethnic group in [Maritime Southeast Asia](/wiki/Maritime_Southeast_Asia). For most of the Minangkabau people, wandering is an ideal way to reach maturity and success; as a consequence, they exercised great influence in the politics of many kingdom and states in Maritime Southeast Asia. Overseas Minangkabau are also great influence developing Indonesian, Malaysian, and Singaporean culture, mainly language, culinary, music, and martial art.[*page needed*] ## Ranah Minang Minang Realm, sometimes also known as Alam Minangkabau, is a term used to refer to the area inhabited by the Minang. The Minang region consists of darek ([Minangkabau Highlands](/wiki/Minangkabau_Highlands)) and rantau areas (Outer Highlands). The Minang realm is much wider than the administrative boundaries of [West Sumatra](/wiki/West_Sumatra) [Province](/wiki/Provinces_of_Indonesia), because it also includes the residential area and cultural influence of the Minang ethnic group in neighboring provinces, [Riau](/wiki/Riau), [Jambi](/wiki/Jambi), and [Bengkulu](/wiki/Bengkulu), specifically in Mukomuko, and Sungai Banyak. ## Notable Minangkabau\n",
  "language": "en",
  "processed_at": "2026-01-12T11:33:38.679740",
  "title": "Minangkabau people",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Minangkabau_people"
}