{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:33:36.141451"
  },
  "content": "People of Minangkabau ethnicity who has settled elsewhereEthnic group The **Overseas Minangkabau** is a demographic group of [Minangkabau people](/wiki/Minangkabau_people) of [Minangkabau Highlands](/wiki/Minangkabau_Highlands) origin in [Central Sumatra](/wiki/Central_Sumatra), [Indonesia](/wiki/Indonesia) who have settled in other parts of the world. Over half of the Minangkabau people can be considered overseas Minangkabaus. They make up the majority of the population of [Negeri Sembilan](/wiki/Negeri_Sembilan) (in [Malaysia](/wiki/Malaysia)) and [Pekanbaru](/wiki/Pekanbaru) (in Indonesia). They also form a significant minority in the populations of [Jakarta](/wiki/Jakarta), [Bandung](/wiki/Bandung), [Medan](/wiki/Medan), [Batam](/wiki/Batam), [Surabaya](/wiki/Surabaya) and [Palembang](/wiki/Palembang) in Indonesia as well as [Kuala Lumpur](/wiki/Kuala_Lumpur), [Malacca](/wiki/Malacca), [Penang](/wiki/Penang), [Singapore](/wiki/Singapore) and [Brunei Darussalam](/wiki/Brunei_Darussalam) in the rest of the [Malay world](/wiki/Malay_world). Minangkabaus have also emigrated as skilled professionals and merchants to the [Netherlands](/wiki/Netherlands), [United States](/wiki/United_States), [Saudi Arabia](/wiki/Saudi_Arabia) and [Australia](/wiki/Australia). The [matrilineal](/wiki/Matrilineal) culture and economic conditions in West Sumatra have made the Minangkabau people one of the most mobile ethnic group in [Maritime Southeast Asia](/wiki/Maritime_Southeast_Asia). The young people usually have to go outside the region after their teens to become traders or students. For most of the Minangkabau people, wandering is an ideal way to reach maturity and success. By moving, wealth and scientific knowledge are gained and the prestige and honor individuals in the midst of indigenous environment. The immigrants usually send part of the wealth home to be invested in family businesses, such as by expanding the ownership of paddy fields, control of land management, or pick up the rice fields of the spout. Money from the diaspora is also used to improve village facilities, such as [mosques](/wiki/Mosque), roads, or the rice fields. ## Waves of migration **Overseas Minangkabau in Major Cities** CityPercentage* Amount (2010) [Pekanbaru](/wiki/Pekanbaru)37.96%343,121[Jakarta](/wiki/Jakarta)3.18%305,538[Seremban](/wiki/Seremban)50.9%282,971[Medan](/wiki/Medan)8.6%181,403[Batam](/wiki/Batam)14.93%169,887[Singapore](/wiki/Singapore)2.29%114,151[Palembang](/wiki/Palembang)4.1%60,188[Jambi](/wiki/Jambi_(city))11.07%58,484[Bandar Lampung](/wiki/Bandar_Lampung)3.36%29,629[Bandung](/wiki/Bandung)0.92%22,033[Tanjung Pinang](/wiki/Tanjung_Pinang)9.5%17,830[Banda Aceh](/wiki/Banda_Aceh)7.8%13,606* Notes: Percentage to Population in the City The Minangkabau people have a long history of migrating overseas. They would leave their homes and travel in search of knowledge and to seek their fortunes. The first migration in the 7th century when the [Minangkabau Merchants](/wiki/Minangkabau_Merchants) sold the gold in [Jambi](/wiki/Jambi_City) and involved in the formation of the [Malayu Kingdom](/wiki/Melayu_Kingdom). In the 13th century, the Minangkabau people started colonies along the west coast of [Sumatra](/wiki/Sumatra) island from Meulaboh to [Bengkulu](/wiki/Bengkulu) when they were spice traders. In Aceh, they were known as [Aneuk Jamee](/wiki/Aneuk_Jamee_people) and Pesisir (*Ughang Pasisia*) in west coast of [North Sumatra](/wiki/North_Sumatra). Some scholars noted that the arrival of the Minangkabau to the Malay Peninsula occurred in the 12th century. This ethnic group moved in to peninsula at the height of the [Sultanate of Malacca](/wiki/Sultanate_of_Malacca), and maintains the *[Adat Perpatih](/wiki/Adat_Perpatih)* of matrilineal kinships system in Negeri Sembilan and north Malacca. In the early 18th century, many Minang merchants as cross-strait traders. These traders transport various commodities that came from the interior of Sumatra to be sold to foreign ships in the [Straits Settlements](/wiki/Straits_Settlements). The three brothers were Nakhoda Bayan, Nakhoda Intan, and Nakhoda Kecil opened up a settlement at [Penang island](/wiki/Penang). Minangkabau migration to the Malay peninsula increased dramatically in the early 1850s, as a result of [Padri War](/wiki/Padri_War) in West Sumatra. Most of them work as miners, merchants, and craftsmen. Utsman bin Abdullah and [Haji Mohamed Taib](/wiki/Mohamed_Taib_bin_Haji_Abdul_Samad) were influential tycoons in Kuala Lumpur and surrounding area. Haji Taib, one of the wealthiest [Minangkabau merchant](/wiki/Minangkabau_businesspeople) at that time, was an important person in the early development city centre of Kuala Lumpur. After [Portuguese](/wiki/Portugal) captured of [Malacca](/wiki/Malacca) in 1511, many Minangkabau family moved to [South Sulawesi](/wiki/South_Sulawesi). Datuk Makotta and his wife Tuan Sitti were pioneer of Minangkabau family in South Sulawesi. They supported [Sultanate of Gowa](/wiki/Sultanate_of_Gowa) as military leaders, administrators and ulamas. Beside as preacher, the Minangkabau were the major traders in [Makassar](/wiki/Makassar) before the Makassar War. After the Makassar War, almost of Minangkabau descendants had identified themselves as being [Makassar people](/wiki/Makassar_people) or [Bugis](/wiki/Bugis). And they belong to the \"Bugis-Makassar community\" who migrated to the Malay Peninsula, West Borneo, eastern Sumatra and Java in the late 17th century. In the mid-19th century many of Minangkabau people migrate to [Java](/wiki/Java) to continue their education and expand of business. Minang merchants are found in traditional markets of Jakarta, mainly in Tanah Abang and Senen. In 1961, the number of Minang migrants in Jakarta increased 18.7 times compared to the city's population growth rate of only 3.7 times, and in 1971 Minangkabau people was estimated to have amounted to around 10% of Jakarta's population at that time. Even though many Minang migrants were well established 'uptown', many of them later moved and settled in [Bogor](/wiki/Bogor), [Depok](/wiki/Depok), [Tangerang](/wiki/Tangerang) and [Bekasi](/wiki/Bekasi). Despite [Greater Jakarta](/wiki/Jakarta_metropolitan_area) is their major concentrations, they are also often found in many cities and towns, such as [Bandung](/wiki/Bandung), [Yogyakarta](/wiki/Yogyakarta), [Semarang](/wiki/Semarang), [Surabaya](/wiki/Surabaya), [Malang](/wiki/Malang), [Surakarta](/wiki/Surakarta) and [Tasikmalaya](/wiki/Tasikmalaya), where they have quite solid associations. ### Intellectual migration The increasing wealth of the interior of Minangkabau people has encouraged them to send their children to school in the [Middle East](/wiki/Middle_East), [Europe](/wiki/Europe) and [Java](/wiki/Java). Haji Sumanik, Haji Miskin, and Haji Piobang were Mecca alumni who carried out Islamic reforms in the early 19th century in Minangkabau. Their teachings, known as the [Padri movement](/wiki/Wahhabism), then spread to Riau and the southern Tapanuli. After the [Padri War](/wiki/Padri_War), most of the [Muslim](/wiki/Muslim) reformists went to [Mecca](/wiki/Mecca) and [Cairo](/wiki/Cairo). Among them were [Ahmad Khatib](/wiki/Ahmad_Khatib), [Tahir Jalaluddin](/wiki/Sheikh_Tahir_Jalaluddin), [Abdul Karim Amrullah](/wiki/Abdul_Karim_Amrullah), and [Muhammad Jamil Jambek](/wiki/Muhammad_Jamil_Jambek). In [Mecca](/wiki/Mecca), Ahmad Khatib served as the [Imam](/wiki/Imam) of the [Shafi'i](/wiki/Shafi%27i) school of law at the mosque known as [Masjidil Haram](/wiki/Masjidil_Haram). While Djanan Thaib founded *Jamaah al-Chairiyah* in 1923 and led *Seruan al-Azhar* magazine with [Ilyas Yakoub](/wiki/Ilyas_Yakoub) and Mahmud Junus at Cairo. In Java, most of them attended [STOVIA](/wiki/STOVIA) and [Rechtsschool](/wiki/Faculty_of_Law,_University_of_Indonesia) in [Batavia](/wiki/Jakarta), as well as [Technische Hoogeschool](/wiki/Bandung_Institute_of_Technology) in Bandung. In the period 1900 – 1914 around 18% of STOVIA graduates were Minang students. This explains why from pre-[Indonesian independence](/wiki/Proclamation_of_Indonesian_Independence) until nowadays, many doctors in Jakarta have come from Minangkabau migrants. Several Minang of STOVIA graduates who later became personages in the Indonesian government were [Adnan Kapau Gani](/wiki/Adnan_Kapau_Gani) and [Bahder Djohan](/wiki/Bahder_Djohan). In the early 20th century, many young Minangkabaus migrated to Europe. Most of them studied in the [Netherlands](/wiki/Netherlands) and [Germany](/wiki/Germany). [Abdoel Rivai](/wiki/Abdoel_Rivai), [Mohammad Hatta](/wiki/Mohammad_Hatta), [Roestam Effendi](/wiki/Roestam_Effendi), Nazir Pamuntjak, and [Sutan Sjahrir](/wiki/Sutan_Sjahrir) were overseas Minangkabaus who studied in Europe and later became activists in the movement for Indonesian independence. Another activist was [Tan Malaka](/wiki/Tan_Malaka) who lived in eight different countries including the Netherlands, China, and the Philippines. He was a member of the [Indonesian Communist Party](/wiki/Indonesian_Communist_Party) and was also a candidate for the Netherlands' member of parliament. ## Causes ### Cultural factors There are two explanations of this phenomenon. One: Because Minang culture dictates that boys need to learn to be an optimal effective man, they need to learn from the outside world, to gain knowledge and experience so that they can hopefully gain enough wisdom to take care of the women (sisters, nieces, mother, aunts, grandmother, etc.), and to gain sufficient skills to be productive men who can provide for their women. Two: [The nomads](/wiki/Nomads) who returned to their hometown, usually are considered to be more desirable by the girls and respected by the potential in-laws. Nowadays, the modern Minangkabau women also aspire to wander out of their hometown because they want to earn their living by trade, have a career, or further their education. According to Rudolf Mrázek, a Czech Michigan-based Indonesianist, two typologies of Minang culture, the dynamism and anti-parochialism gave birth to the spirit of independence, cosmopolitan, egalitarian, and liberal-minded, causing the embedded migration culture of Minangkabau people. The spirit to change the fate of the pursuit of knowledge and wealth, and Minang proverb which says *Ka ratau madang di hulu, babuah babungo balun, marantau bujang dahulu, di rumah paguno balun* (better go wander, because in kampong not useful) result in Minang youth to migrate since youth. ### Economic factors Another explanation is that because many Minangkabau people have proven to be successful merchants and the family whose men are overseas usually are wealthier at home, it drives the other men who are still at home to want to wander outside their homeland and test their economic skills as well. Meanwhile, the economic history of the Minangkabau people since long ago has been bolstered by the ability to trade and distribute their crops. Minangkabau inland area has geological reserves of raw materials especially [gold](/wiki/Gold), [copper](/wiki/Copper), [lead](/wiki/Lead), [zinc](/wiki/Zinc), [mercury](/wiki/Mercury_(element)), and [iron](/wiki/Iron). The nickname *[Suvarnadvipa](/wiki/Suvarnabhumi)* that appears on legend in [India](/wiki/India) was referred to the possibility of Sumatra as island of gold. In the 9th century, the [Arab](/wiki/Arab) traders reported that Sumatran people have been using a number of gold in trading system. Continued in the 13th century, king of Sumatra used the crown of gold. [Tomé Pires](/wiki/Tom%C3%A9_Pires) around the 16th century, says that gold was trade in [Malacca](/wiki/Malacca), Barus, Tiku and [Pariaman](/wiki/Pariaman), originated from Minangkabau inland area. He also mentioned that in the [Indragiri](/wiki/Indragiri_River) area on the east coast of Sumatra is the central port of the [Minangkabau kingdom](/wiki/Pagaruyung_Kingdom). The manuscripts written by [Adityawarman](/wiki/Adityawarman) also mentioned that he is the ruler of the earth's gold. It is then encouraged the [Dutch](/wiki/Netherlands) to build a port in [Padang](/wiki/Teluk_Bayur). And arrived at 17th-century, Dutch still call a gold ruler to the king of Pagaruyung and then asks Tomas Diaz to investigate the matter, which he tried to enter the interior of the Minangkabau from east coast of Sumatra, and Diaz' noted he had found one of the Minangkabau king at that time (Rajo Buo) and also mentioned main of the people jobs was gold miners. The geological record of the [Netherlands](/wiki/Netherlands) noted that on [Batanghari](/wiki/Batanghari) found 42 places of mined gold with the depth reaches 60 metres, and in [Kerinci](/wiki/Kerinci_Regency) they met the miners of gold. Until the 19th century, the legend of gold in Minangkabau hitterland, still pushing [Raffles](/wiki/Stamford_Raffles) to prove it, and he is listed as the first [European](/wiki/Europe) to successfully achieved Pagaruyung through the west coast of Sumatra. ## Influences Minangkabau migrants have been successful in many fields and aspects over the years. They exercised great influence in the politics of many kingdom and states in Maritime Southeast Asia. [Raja Baginda](/wiki/Rajah_Baguinda) migrated to south Philippines and founded the [Sultanate of Sulu](/wiki/Sultanate_of_Sulu) in 1390. Between the period 1558–1575, [Rajah Sulayman](/wiki/Rajah_Sulayman) was ruler of the [Kingdom of Maynila](/wiki/Kingdom_of_Maynila) in what is now [Manila](/wiki/Manila), [Philippines](/wiki/Philippines). And [Sultan Buyung](/wiki/Sultan_Buyung) was the ninth sultan of Aceh who ruled [Aceh Sultanate](/wiki/Aceh_Sultanate) in 1585-1589. The Overseas Minangkabau were also involved in political rivalry with the [Bugis](/wiki/Bugis_people) after the death of [Sultan Mahmud Shah II](/wiki/Sultan_Mahmud_Shah_II_of_Johor) in [Sultanate of Johor](/wiki/Sultanate_of_Johor). In 1723, Sultan Abdul Jalil Rahmad Syah I or known as [Raja Kecil](/wiki/Raja_Kecil), founded [Sultanate of Siak](/wiki/Sultanate_of_Siak_Sri_Indrapura) in [Riau](/wiki/Riau). Raja Ismail, a grandson of Raja Kecil, who ruled Siak in 1761 and 1779–1781 has influence in the east coast of Sumatra, Malay peninsula, southern Thai as well as [West Kalimantan](/wiki/West_Kalimantan). In 1773, [Raja Melewar](/wiki/Raja_Melewar) was appointed the [Yang di-Pertuan Besar](/wiki/Yang_di-Pertuan_Besar) in the state of [Negeri Sembilan](/wiki/Negeri_Sembilan). The mid-twentieth century, many overseas Minangkabau like [Ahmad Boestaman](/wiki/Ahmad_Boestaman), [Abdullah CD](/wiki/Abdullah_CD), [Rashid Maidin](/wiki/Rashid_Maidin), [Shamsiah Fakeh](/wiki/Shamsiah_Fakeh), and [Khadijah Sidek](/wiki/Khadijah_Sidek) were involved in the Malaysian independence movement. After Malaysia and Singapore independence, many politician and minister were Overseas Minangkabau, such as [Ghazali Shafie](/wiki/Ghazali_Shafie), [Rais Yatim](/wiki/Rais_Yatim), [Aishah Ghani](/wiki/Aishah_Ghani) and Muhammad Eunos Abdullah. While [Yusof bin Ishak](/wiki/Yusof_bin_Ishak) was the first president of Singapore and [Tuanku Abdul Rahman](/wiki/Tuanku_Abdul_Rahman) was the first Supreme Head of State ([Yang di-Pertuan Agong](/wiki/Yang_di-Pertuan_Agong)) of the Federation of Malaya. The Overseas Minangkabau also overwhelmingly on socio-religious figures who are quite influential in the Malay world, such as [Muhammad Yasin Al-Fadani](/wiki/Yasin_al-Fadani), a prolific scholar who wrote many books as well as Ahmad Khatib who became a teacher for many Malay scholars in Mecca. Three of his students: [Ahmad Dahlan](/wiki/Ahmad_Dahlan), [Hasyim Asy'ari](/wiki/Hasyim_Asy%27ari) and [Sulaiman ar-Rasuli](/wiki/Sulaiman_ar-Rasuli) established [Muhammadiyah](/wiki/Muhammadiyah), [Nahdlatul Ulama](/wiki/Nahdlatul_Ulama) and [Perti](/wiki/Islamic_Education_Movement) respectively. Muhammadiyah had been founded in 1912 in Yogyakarta, but its rapid spread throughout Indonesia was due in large part to the efforts of Minangkabau traders and teachers. Tahir Jalaluddin and [Hamka](/wiki/Hamka) were the influential scholars who published his own reformist magazine *al-Imam* (Tahir) and *Panji Masyarakat* (Hamka). The magazine's circulation covers Indonesia, Malaysia and Singapore. In the late 16th century, the Minangkabaus preachers taught Islam in [Sulawesi](/wiki/Sulawesi), [Borneo](/wiki/Borneo), and [Nusa Tenggara](/wiki/Nusa_Tenggara) islands. Dato ri Bandang, Dato ri Tiro and Dato ri Pattimang three of whom were prominent ulamas spread the word of Islam to the Gowa and [Luwu](/wiki/Luwu) kingdom in [South Sulawesi](/wiki/South_Sulawesi). [Mohammad Yamin](/wiki/Mohammad_Yamin), one of the Indonesian founding fathers, who had success a unified Indonesian identity with the [Indonesian language](/wiki/Indonesian_language). In addition to Yamin, the other Minangkabau authors, such as [Marah Rusli](/wiki/Marah_Rusli), [Abdul Muis](/wiki/Abdul_Muis), [Sutan Takdir Alisjahbana](/wiki/Sutan_Takdir_Alisjahbana), [Hamka](/wiki/Hamka) and [Chairil Anwar](/wiki/Chairil_Anwar), who migrated to Java since youth, were considered to be a pioneer of modern Indonesian literature. Their works has influence in [Maritime Southeast Asia](/wiki/Maritime_Southeast_Asia), in addition to [Minangkabau language](/wiki/Minangkabau_language) had a strong influence on [Indonesian language](/wiki/Indonesian_language). ### Influences in Malaysian and Singaporean culture They are also great influence developing Malaysian and Singaporean culture, mainly language, culinary, music, and martial art. [Zainal Abidin Ahmad](/wiki/Zainal_Abidin_Ahmad_(writer)) was a Minangkabau writer who modernized the Malay language. [Caklempong](/wiki/Talempong), the musical tradition instrument, was brought to Malaysia by the Minangkabau people as early as the 14th century. Muzammil Alias who goes by the stage name Waris is credited for giving fresh breathe to Minang culture in Malaysia as well as [Saiful Bahri](/wiki/Saiful_Bahri) who wrote the lyrics the Selangor state anthem and Malaccan state anthem. Who cannot be forgotten is [Zubir Said](/wiki/Zubir_Said), who composed *[Majulah Singapura](/wiki/Majulah_Singapura)* (the national anthem of Singapore). [Rendang](/wiki/Rendang) and [Lemang](/wiki/Lemang), the traditional cuisine of Minangkabau, also popular in Malaysia as well as Singapore. [Andalas University](/wiki/Andalas_University) historian, Prof. Gusti Asnan suggests that rendang began to spread across the region when Minangkabau merchants and workers began to trade and migrate to [Malacca](/wiki/Malacca_Sultanate) in the 16th century. Currently, Minangkabau restaurant, known as Nasi Padang Restaurant, is one of the most visible food stalls in Malaysia and Singapore. Present-day, Malay inhabitants in [Negeri Sembilan](/wiki/Negeri_Sembilan) and northern [Melaka](/wiki/Melaka) practiced the Minangkabau system of [adat perpatih](/wiki/Adat_perpatih). As opposed to adat temenggung, adat perpatih system has been studied and analysed extensively by many scholars. ## Occupations Many Minangkabau have established themselves as government employees and white collar workers in the places that they have settled. A number of them work as doctors, artisans, authors, journalist, politicians, preachers, and [merchants](/wiki/Minangkabau_Merchants). In addition to restaurateurs, a significant number of Minangkabau merchants were involved in textile, financial, hotel and hospital industry. Most of the traditional markets in Indonesia's major cities are occupied by Minang textile traders. [Hasyim Ning](/wiki/Hasyim_Ning), [Abdul Latief](/wiki/Abdul_Latief_(Indonesian_businessman)), [Basrizal Koto](/wiki/Basrizal_Koto), [Nasimuddin Amin](/wiki/SM_Nasimuddin_SM_Amin) and [Kamarudin Meranun](/wiki/Kamarudin_Meranun) were the figure of successful Minangkabau businessmen. They are also present in the field of academics and many Overseas Minangkabaus hold posts as rectors, deans and headmasters in high schools. After Indonesian independence, Minangkabau people migrated as skilled professionals to the [Australia](/wiki/Australia), [Japan](/wiki/Japan), [Europe](/wiki/Europe), and the [United States](/wiki/United_States). ## Organisations Many Overseas Minangkabaus are affiliated to the modern Muslim organisations, i.e. Muhammadiyah, Perti and [Indonesian Ulema Council](/wiki/Indonesian_Ulema_Council). In the cities, they are greatly involved with the mosque activities as well as the management of modern Muslim organisation. Several times the general chairman of Muhammadiyah and Indonesian Ulema Council as well as almost all of the chairman of Perti were held by Minangkabau migrants. For local institution, most of the *kanagarian* (literally 'little state\") in Minangkabau have an overseas organisation. They have branches and are found in the big cities in the Malay Archipelago. Several *nagari* with quite a large number of migrants also have branches in Australia and the United States. Their objectives are the promotion of the social, physical, intellectual, cultural and general welfare of its members. ## References to overseas Minangkabau (Merantau) in popular culture The phenomenon of wandering in Minangkabau society often becomes a source of inspiration for artists, primarily literary. **References in literature** - [Hamka](/wiki/Hamka), in his novel *Merantau to Deli*, telling stories about life experiences Minang nomads who went to [Deli](/wiki/Deli_Serdang_Regency) and married [Javanese](/wiki/Javanese_people) woman. Another novel *[Tenggelamnya Kapal van der Wijck](/wiki/Tenggelamnya_Kapal_van_der_Wijck)* tells the story of children who return to home. In the village, he faced obstacles by indigenous peoples who is his father's family. - A novel by [Marah Rusli](/wiki/Marah_Rusli), *[Sitti Nurbaya](/wiki/Sitti_Nurbaya)* and *[Salah Asuhan](/wiki/Salah_Asuhan)* [Abdul Muis](/wiki/Abdul_Muis) tells the story of the Minang nomads. In these novels, the intersection of Minang tradition and western culture are narrated. - *Negeri 5 Menara* by Ahmad Fuadi, tells of immigrants who study in boarding schools in Java and eventually become successful. - In a different form, through his work titled *Kemarau*, [A.A. Navis](/wiki/Ali_Akbar_Navis) invite the overseas community to build their Minang hometown. **References in film** - *[Merantau](/wiki/Merantau_(film))* is a martial arts film from 2009 which tells the story of a young Minangkabau man who leaves his hometown to teach [silat](/wiki/Silat) and the trials and tribulations of his journey. - *Negeri 5 Menara*, adaptation of the novel with the same title. - *Tenggelamnya Kapal van der Wijck*, adaptation of the novel with the same title. - [Minangkabau](/wiki/Minangkabau_people) - [Negeri Sembilan](/wiki/Negeri_Sembilan) - [Overseas Indonesians](/wiki/Overseas_Indonesians) - [Indonesian Malaysians](/wiki/Indonesian_Malaysians) - [Minangkabau Malaysians](/wiki/Minangkabau_Malaysians) - [Minangkabau Singaporeans](/wiki/Malays_in_Singapore#The_Minangkabaus) - [Rawa](/wiki/Rawa_(tribe))\n",
  "language": "en",
  "processed_at": "2026-01-12T11:33:36.141087",
  "title": "Minangkabau diaspora",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Minangkabau_diaspora"
}