{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:33:41.121987"
  },
  "content": "The **MindChamps Group of Companies** is a global education group headquartered in [Singapore](/wiki/Singapore). It comprises MindChamps PreSchool, MindChamps Enrichment Academy, MindChamps MindSpace, and MindChamps Allied Care, with a total of more than 140 centers across Singapore, Australia, Malaysia, Philippines, Indonesia, Myanmar and soon, the United States. Its [pedagogy](/wiki/Pedagogy) is based on the research of the world renowned neuroscientist Professor Emeritus [Allan Snyder](/wiki/Allan_Snyder), Fellow of the Royal Society, from the [University of Sydney](/wiki/University_of_Sydney), and incorporates concepts from Snyder’s study of the Champion Mindset. It is the first Singapore education group to have attained patent status for its education methodology in 3 major territories - the US, UK and Australia. [New York Times](/wiki/The_New_York_Times) and [Wall Street Journal](/wiki/The_Wall_Street_Journal) bestselling author Dr Joseph A. Michelli has hailed MindChamps as \"a global education movement.\" ## History MindChamps was founded in [Australia](/wiki/Australia) in 1998 as an educational research centre in [Sydney](/wiki/Sydney), by Australian [David Chiem](/wiki/David_Chiem). In 2008, it opened its first preschool in Singapore. It subsequently expanded its number of schools through a mix of company-owned, company operated centers, and as well as franchising. In 2019, the company was the subject of a book *The MindChamps Way* by [New York Times](/wiki/The_New_York_Times) and [Wallstreet Journal](/wiki/The_Wall_Street_Journal) bestselling author Dr Joseph A. Michelli. In 2022, MindChamps launched *MindChamps MindSpace* – an Afterschool Centre and Enrichment Academy. The first MindChamps MindSpace centre opened in Bishan in January 2022. As of 2024, there are now 28 MindSpace centres across Singapore. In July 2023, MindChamps won a trademark infringement case in China over a \"copycat\" school in Xi’an, the capital city of Shaanxi province. In September 2023, MindChamps conducted extensive research with the [University of South Australia](/wiki/University_of_South_Australia) to explore the mechanisms behind its programs’ promotion of children’s math and language skills. In August 2024, MindChamps became the first Singapore education group to attain patent status for its education methodology in 3 major territories - the United States, United Kingdom and Australia. In November 2024, MindChamps partnered with [Western Sydney University](/wiki/Western_Sydney_University), signing a [Memorandum of Understanding](/wiki/Memorandum_of_understanding) (MoU).\n",
  "language": "en",
  "processed_at": "2026-01-12T11:33:41.121522",
  "title": "MindChamps",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/MindChamps"
}