{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:34:10.951497"
  },
  "content": "Annual national beauty pageant competition in Singapore **Miss Universe Singapore** is a [beauty pageant](/wiki/Beauty_pageant) and organization that selects the [Singapore](/wiki/Singapore) official representative to the [Miss Universe](/wiki/Miss_Universe) pageant. The reigning Miss Universe Singapore is Annika Sager, who was crowned on 5 October 2025. ## History This article **is missing information** about Events after 2015. Please expand the article to include this information. Further details may exist on the talk page. *(March 2022)* The Miss Singapore beauty pageant was held as early as 1941 and was organised by the Singapore Amateur Weightlifting Association Club. Singapore has been sending representatives to Miss Universe contest as early as 1954. The title of the first Miss Singapore ever was won by [Siti Mariam binti Ismail](/wiki/Mariani_(actress)) in 1951. Singapore has been represented at Miss Universe every year since 1966. The country had its first semi finalist when Kathie Lee Lee Beng secured the eighth position, the highest ever placement Singapore attained when the pageant was held in [St. Louis](/wiki/St._Louis,_Missouri) in 1983. In 1987 when Singapore played host to the Miss Universe pageant, home favourite Marion Nicole Teo came in at the ninth place. After 34 years, Singapore secures a place again, with [Nandita Banna](/wiki/Nandita_Banna) being a semifinalist in the [70th edition](/wiki/Miss_Universe_2021) of the Miss Universe pageant held in Port of Eilat, Israel. Between 2001 and 2007, the contest was telecast 'live' by the local television station [Mediacorp](/wiki/Mediacorp)'s [Channel 5](/wiki/Channel_5_(Singaporean_TV_channel)). Miss Universe Singapore Organisation holds the license to oversee and produce the Miss Universe Singapore pageant (2015). Prior to 2015, the contest was organised by Derrol Stepenny Promotions. [Nuraliza Osman](/wiki/Nuraliza_Osman), the 2002 Miss Universe Singapore winner, took over the Miss Universe Singapore's licence and franchise in May 2015 from Derrol Stepenny Promotions. In April 2023, the [Miss Universe Australia](/wiki/Miss_Universe_Australia) franchisee Tony and Sophia Barbagallo; of PinkTank Events acquired the Miss Universe Singapore license. ## Titleholders The following is a list of all Miss Universe Singapore titleholders, and runners-up. YearMiss Universe SingaporeFirst Runner-upSecond Runner-up2012[Lynn Tan](/wiki/Lynn_Tan)Nowreen KhanLouissa Thomas2013[Shi Lim](/wiki/Shi_Lim)Cheryl Desiree ChanCordelia Low2014[Rathi Menon](/wiki/Rathi_Menon)Arrian NorthIjechi Nazirah Nwaozuzu2015[Lisa Marie White](/wiki/Lisa_Marie_White)No runners-up as she was appointed by the organization to compete at Miss Universe, no national pageant in 2015.2016[Cheryl Chou](/wiki/Cheryl_Chou)Tanisha Lissa KhanSonya Elisabeth Branson2017Manuela BruntraegerRudihra RamathasEmilbiany Nenggal Intong2018Zahra KhanumTiong JiaenJaslyn Tan2019Mohana PrabhaLaranya KumarCheryl Yao2020[Bernadette Belle Ong](/wiki/Bernadette_Belle_Ong)No runners-up as she was appointed by the organization to compete at Miss Universe due to the impact of COVID-19 pandemic, no national pageant in 2020.2021[Nandita Banna](/wiki/Nandita_Banna)Kalynskye Adrian[Lila Tan](/wiki/Lila_Tan)2022Carissa YapYvonne SashirekhaDenissia Delangle2023[Priyanka Annuncia](/wiki/Priyanka_Annuncia)Nikita CartersRadhika Chandhok2024Charlotte ChiaAdelene StanleyOlivia Dewi Cinta Higgins2025Annika SagerInez ChenAlexis Kaur ## Titleholders under Miss Universe Singapore organisation This article lists events whose **chronological order is ambiguous, backward, or otherwise incorrect**. Relevant discussion may be found on the talk page. Please do not remove this message until the described events are arranged in an unambiguous forward-chronological sequence. *(December 2025)* ### Miss Universe Singapore - : Declared as Winner - : Ended as runner-up or top 5/6 qualification - : Ended as one of the finalists or semifinalists - : Ended as special awards winner *On occasion, when the winner does not qualify (due to age) for either contest, a runner-up is sent.*YearMiss SingaporePlacement at Miss UniverseSpecial Award(s)NotesElaine Daly directorship — a franchise holder to Miss Universe from 2024(/wiki/Miss_Universe_2025)Annika SagerUnplaced(/wiki/Miss_Universe_2024)Charlotte ChiaUnplacedTony & Sophia Barbagallo (PinkTank Events) directorship — a franchise holder to Miss Universe in 2023(/wiki/Miss_Universe_2023)[Priyanka Annuncia](/wiki/Priyanka_Annuncia)Unplaced - Voice For Change (Silver Winner) Valerie Lim directorship — a franchise holder to Miss Universe between 2019―2022(/wiki/Miss_Universe_2022)Carissa YapUnplaced(/wiki/Miss_Universe_2021)[Nandita Banna](/wiki/Nandita_Banna)Top 16(/wiki/Miss_Universe_2020)[Bernadette Ong](/wiki/Bernadette_Ong)UnplacedAppointed — Due to the impact of [COVID-19 pandemic](/wiki/COVID-19_pandemic), no national pageant in 2020. Instead, a runner-up was appointed as the Miss Universe Singapore 2020 by the organization.2019Mohana PrabhaUnplacedNuraliza Osman directorship — a franchise holder to Miss Universe between 2016―20182018Zahra KhanumUnplaced2017Manuela BruntraegerUnplaced2016[Cheryl Chou](/wiki/Cheryl_Chou)Unplaced[Inès Ligron](/wiki/In%C3%A8s_Ligron) directorship — a franchise holder to Miss Universe i 20152015[Lisa Marie White](/wiki/Lisa_Marie_White)UnplacedErrol Pang directorship — a franchise holder to Miss Universe between 2009―20142014[Rathi Menon](/wiki/Rathi_Menon)Unplaced2013[Shi Lim](/wiki/Shi_Lim)Unplaced2012[Lynn Tan](/wiki/Lynn_Tan)Unplaced2011Valerie LimUnplaced2010Tania Lim Kim SuanUnplaced2009[Rachel Janice Kum](/wiki/Rachel_Kum)UnplacedMediacorp directorship — a franchise holder to Miss Universe between 2004―20082008Shenise Wong Yan YiUnplaced2007Jessica Tan Yue ChangUnplaced2006Carol Cheong Yim FoonUnplaced2005Cheryl TayUnplaced2004Sandy Chua Khang EinUnplacedDaryl Pang directorship — a franchise holder to Miss Universe between 2000―20032003Bernice Wong Chea MeiUnplaced2002[Nuraliza Osman](/wiki/Nuraliza_Osman)Unplaced2001Jaime TeoUnplaced2000[Eunice Elizabeth Olsen](/wiki/Eunice_Elizabeth_Olsen)UnplacedMetromedia Promotions Pte Ltd. directorship — a franchise holder to Miss Universe between 1993―19991999Cheryl Marie CordeiroUnplaced1998Alice Lim Poh ChooUnplaced1997Tricia Tan Siew SiewUnplaced1996Angeline PuttUnplaced1995Tun Neesa AbdullahUnplaced1994[Paulyn Sun](/wiki/Paulyn_Sun)Unplaced1993Rena Ramiah DeviUnplacedRena won the Best Model of the Asia & Pacific 1994, fourth runner-up at Miss Tourism International 1994 (Sri-Lanka Edition) and Miss Tourism International (Turkey Edition).Dr. Robert C K Loh directorship — a franchise holder to Miss Universe between 1970―19921992Cori TeoUnplaced1991[Eileen Yeow Yin Yin](/wiki/Eileen_Yeow)Unplaced - Preliminary Swimsuit (9th Placed) 1990Ong Lay LingUnplaced1989Pauline ChongUnplaced1988Audrey Ann TayUnplaced - Preliminary Swimsuit (4th Placed) 1987Marion Nicole TeoTop 101986Farah LangeUnplaced1985Lyana ChiokUnplaced1984Violet Lee Hui-MinUnplaced1983Kathie Lee Lee BengTop 121982Telma Judicia Mary NonisUnplaced1981Florence TanUnplaced1980Ann Chua Ai ChooUnplacedRebranding as Miss Singapore Universe Organization.1979Elaine Tan Kim LianUnplaced1978Annie Lee Mei LingUnplaced1977Marilyn Sim Choon MayUnplaced1976Linda ThamUnplaced1975Sally TanUnplaced1974Angela Teo Bee LuangUnplaced1973Debra Josephine de SouzaUnplaced1972Jacqueline Han Ghim HongUnplaced1971Jenny Ser Wang WongUnplaced1970Cecilia UndasanUnplacedShaw Brothers directorship — a franchise holder to Miss Universe between 1958―19691969Mavis Young Siew KimUnplaced1968Yasmin SaifUnplaced1967Bridget Ong Mei-LeeUnplaced1966Margaret van MeelUnplaced1965Alice Woon Yoke KweeDid not competeShe competed in various pageants including national competition of [Miss Malaysia for Miss World 1963](/wiki/Miss_World_Malaysia_1963) and [Miss Malaysia for Miss Universe 1965](/wiki/Miss_Universe_Malaysia_1965).1964Vera WeeDid not competeShe competed in Miss Universe Malaysia 1964 for Miss Universe 1964.1962Nancy LiewDid not competeCompeted in [Miss International 1962](/wiki/Miss_International_1962).1961Julie KohUnplaced [Miss Universe 1962](/wiki/Miss_Universe_1962)Withdrew from [Miss International 1961](/wiki/Miss_International_1961) due to Hepatitis. competed in [Miss Universe 1962](/wiki/Miss_Universe_1962).1960Christl d'CruzDid not competeCompeted in [Miss International 1960](/wiki/Miss_International_1960).Did not compete in 1959(/wiki/Miss_Singapore_1958)Marion WillisUnplaced1954Marjorie WeeUnplacedShe won [Miss Malaya 1954](/wiki/Miss_Malaya_1954) pageant but debuted at [Miss Universe 1954](/wiki/Miss_Universe_1954) as Miss Singapore instead.1953Latifah OmarDid not compete1951Mariani Binti IsmailDid not compete1948[Ho Lye Toh](/wiki/Ho_Lye_Toh)1947[Ho Lye Toh](/wiki/Ho_Lye_Toh)1941[Ho Lye Toh](/wiki/Ho_Lye_Toh) - [Miss Singapore World](/wiki/Miss_Singapore_World) - [Miss Singapore International](/wiki/Miss_Singapore_International) - [Miss Earth Singapore](/wiki/Miss_Earth_Singapore) - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:34:10.948506",
  "title": "Miss Universe Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Miss_Universe_Singapore"
}