{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:27:29.753847"
  },
  "content": "* *This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **contains promotional content**. Please help improve it by removing promotional language and inappropriate external links, and by adding encyclopedic text written from a neutral point of view. *(May 2024)* *(Learn how and when to remove this message)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"MOBTV\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(August 2021)* *(Learn how and when to remove this message)*Some of this article's listed sources **may not be reliable**. Please help improve this article by looking for better, more reliable sources. Unreliable citations may be challenged and removed. *(September 2024)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)*Television channel **MOBTV** (**MediaCorp Online Broadband Television**) was a Singaporean subscription-based [video on demand](/wiki/Video_on_demand) service. It was launched in August 2008, offering viewers access to a variety of television programmes through [digital streaming](/wiki/Streaming_media) or downloads via an internet connection. On 30 March 2010, MOBTV merged with xinmsn.com to become a free video on demand service, incorporating Podcast.sg and xin.sg. MOBTV Select, its version available on [Mio TV](/wiki/Singtel_TV), was discontinued on 7 January 2014, marking the end of the MOBTV service. ## Services Before the migration, subscribers could access MediaCorp TV programmes, including drama, comedy, and movies. MOBTV was available online at www.mobtv.sg and as MOBTV Select on the [SingTel](/wiki/SingTel) [mio TV](/wiki/Mio_TV) service within Singapore. Subscribers outside of Singapore could only access content owned by MediaCorp. The free video-on-demand channels provided streaming services exclusively within Singapore. Users were required to have a valid MOBTV account and a Singapore [NRIC](/wiki/National_Registration_Identity_Card) to access the content. ### Packages MOBTV offered two types of subscription packages: - MediaCorp Channels Package (accessible in Singapore and internationally), which included select content from Channel 5, Channel 8, Channel U, [Channel NewsAsia](/wiki/CNA_(TV_network)), [Suria](/wiki/Suria_(TV_channel)), [okto](/wiki/Okto), and [Vasantham](/wiki/Vasantham_(TV_channel)). Subscription options were available for either 1 month or 3 months. - Asian Channels Package (accessible in Singapore), which featured select content from Asian dramas, documentaries, and movies, as well as [MediaCorp](/wiki/Mediacorp) telemovies. This package also included movies and drama series co-produced by MediaCorp's external partners. #### Discontinued package In August 2008, MOBTV introduced anime titles under a segment called \"AnimeTrix.\" The service provided anime episodes through Internet-based subscription video on demand (SVOD), allowing users to stream or download episodes within the same week as their broadcast in Japan.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:27:29.753503",
  "title": "MOBTV",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/MOBTV"
}