{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:34:20.652704"
  },
  "content": "This biography of a living person **needs additional citations for verification**. Please help by adding reliable sources. Contentious material about living persons that is unsourced or poorly sourced **must be removed immediately** from the article and its talk page, especially if potentially libelous. *Find sources:* \"Mohan Kankanhalli\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(September 2020)* *(Learn how and when to remove this message)* **Mohan Kankanhalli** is a researcher and professor at the [National University of Singapore](/wiki/National_University_of_Singapore) School of Computing. He was named [Fellow of the Institute of Electrical and Electronics Engineers](/wiki/Fellow_of_the_Institute_of_Electrical_and_Electronics_Engineers) (IEEE) in 2014 for contributions to [multimedia](/wiki/Multimedia) content processing and security. He was named as an [ACM Fellow](/wiki/ACM_Fellow), in the 2024 class of fellows, \"for contributions to multimedia content processing and multimedia security\". ## Education Mohan completed his undergraduate studies with a B.Tech. degree from [IIT Kharagpur](/wiki/IIT_Kharagpur) in 1986. He completed M.S. in 1988 and Ph.D. in 1990 from the [Rensselaer Polytechnic Institute](/wiki/Rensselaer_Polytechnic_Institute). ## Career He worked as an Assistant Professor in Department of Electrical Engineering at the [Indian Institute of Science, Bangalore](/wiki/Indian_Institute_of_Science) in 1997 and joined the National University of Singapore as a Senior Lecturer in 1998. He is the Director of NUS AI Institute and currently is the Provost’s Chair Professor of Computer Science. He is also the Deputy Executive Chairman of AI Singapore, Singapore's national AI program. - Official Website This Singaporean biographical article is a stub. You can help Wikipedia by expanding it. - v - t - e This article about an engineer, inventor or industrial designer is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:34:20.652205",
  "title": "Mohan Kankanhalli",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Mohan_Kankanhalli"
}