{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:34:22.953045"
  },
  "content": "Malaysian politician **Mohd Effendi bin Norwawi** ([Jawi](/wiki/Jawi_alphabet): محمد أفندي بن نورووي; born 1 February 1948) is a [Malaysian](/wiki/Malaysians) politician, businessman and administrator. He has previously served as a Sarawak State Assemblyman (1991–1999), the [Minister of Agriculture](/wiki/Ministry_of_Agriculture_and_Agro-based_Industry_(Malaysia)) (1999–2004) and a Senator for the [Upper House of Parliament or Dewan Negara](/wiki/Dewan_Negara) (2006–2011). ## Early life Effendi attended the prestigious [Malay College Kuala Kangsar](/wiki/Malay_College_Kuala_Kangsar) from 1961 to 1967. He then furthered his education in Australia under a Federal Government scholarship. He founded the private TV channel [ntv7](/wiki/NTV7) in 1998, which he has divested years since. Effendi's reputation in media made him the obvious choice to collaborate with [Bloomberg L.P.](/wiki/Bloomberg_L.P.) to launch Bloomberg TV in Malaysia. Effendi was also previously the Chairman of Bank Utama (now part of the [RHB Banking Group](/wiki/RHB_Bank)) from 1990 to 1995 during which he led its turnaround into becoming one of Malaysia's more prominent major banks. ## Political career Effendi served as Executive Chairman of Sarawak Economic Development Corporation (SEDC) for 15 years from 1981 to 1995, where his numerous successes was recognized and he was awarded the Chief Secretary to the Government's Quality Award and the prestigious Malaysian Prime Minister's Quality Award in 1994. Appointed by Prime Minister [Mahathir Mohamad](/wiki/Mahathir_Mohamad), he initiated the modernization and commercialization of agriculture when he was appointed the [Minister of Agriculture](/wiki/Ministry_of_Agriculture_and_Agro-based_Industry_(Malaysia)), thereby ensuring the long-term growth of the crucial sector in the country. He was then invited by former Prime Minister [Tun Abdullah Badawi](/wiki/Abdullah_Ahmad_Badawi) to head up the Economic Planning Unit (EPU) as the [Minister in the Prime Minister's Department](/wiki/Minister_in_the_Prime_Minister%27s_Department). During his tenure as the Minister of EPU from 2006 to 2008, Effendi initiated the National Implementation Task Force, the National Implementation Directorate and National Economic Action Council to accelerate the implementation of high impact national projects. He was principally involved in coordinating the master planning of the five corridor developments in the country. He was also appointed Joint-Chairman with Singaporean Minister for National Development [Mah Bow Tan](/wiki/Mah_Bow_Tan) for the Malaysia–Singapore Coordination Committee to facilitate the development of the Johor Corridor, on the [Iskandar Regional Development Authority](/wiki/Iskandar_Regional_Development_Authority). Effendi retired from politics in 2011 and returned to Encorp Berhad, a property development company he founded in 1995 and listed on the main board of the [Bursa Malaysia](/wiki/Bursa_Malaysia) in 2003, as its Executive Chairman from 2008 to 2013. Effendi is currently the Chairman of ENcapital, an investment holding company involved in property development, construction and media plus various overseas investment and holdings. A subsidiary, ENdaya is primarily involved in infrastructure construction and maintenance in Sarawak. ## Honours His leadership at Encorp steered the company to its highest ever GDV of RM3 billion and Effendi was awarded with numerous accolades, including the Outstanding Entrepreneurship Award in conjunction with Enterprise Asia's Asia Pacific Entrepreneurship Awards 2012 plus the Brand Laureate Award for The Most Eminent Brand Iconic Leadership Category. He was also recognized as the HR Leader of the Year Award in conjunction with the Malaysia HR Awards in 2011. He holds a [Bachelor of Arts](/wiki/Bachelor_of_Arts) (Hons) majoring in Development Administration from the [University of Tasmania](/wiki/University_of_Tasmania). He was also conferred an Honorary Degree of the Doctor of Laws from the same university in October 2000. He was made Adjunct Professor under the Faculty of Business there in November 2008. In September 2013, [Swinburne University](/wiki/Swinburne_University_of_Technology) appointed Effendi as Adjunct Professor within the Faculty of Business and Design in recognition of his well-established success in business and property development. ### Honours of Malaysia - [Malaysia](/wiki/Malaysia) - Commander of the [Order of Loyalty to the Crown of Malaysia](/wiki/Order_of_Loyalty_to_the_Crown_of_Malaysia#Commander) (PSM) – **Tan Sri** (2014) - Companion of the [Order of Loyalty to the Crown of Malaysia](/wiki/Order_of_Loyalty_to_the_Crown_of_Malaysia#Companion) (JSM) (1994) - [Perlis](/wiki/Perlis) - Knight Grand Commander of the Order of the Crown of Perlis (SPMP) – **Dato' Seri** (2006) - Knight Commander of the Order of Prince Syed Sirajuddin Jamalullail of Perlis (DPSJ) – **Dato'** (2007) - [Sarawak](/wiki/Sarawak) - Knight Commander of the [Most Exalted Order of the Star of Sarawak](/wiki/Most_Exalted_Order_of_the_Star_of_Sarawak) (PNBS) – **Dato Sri** (2003) - Commander of the [Order of the Star of Hornbill Sarawak](/wiki/Order_of_the_Star_of_Hornbill_Sarawak) (PGBK) – **Datuk** (1990) - [Selangor](/wiki/Selangor) - Knight Commander of the [Order of the Crown of Selangor](/wiki/Order_of_the_Crown_of_Selangor) (DPMS) – **Dato'** (1996) ## Personal life Effendi plays golf and practices aikido. He enjoys movies, music, singing, and is a guitar enthusiast. He is married to actor and stage producer, Tiara Jacquelina.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:34:22.949746",
  "title": "Mohd Effendi Norwawi",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Mohd_Effendi_Norwawi"
}