{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:34:41.603371"
  },
  "content": "Former swimming pool in Singapore **Mount Emily Swimming Pool** was a swimming pool at Upper Wilkie Road, Singapore. Established in 1931, the pool was named after and originally occupied by the [Mount Emily Reservoir](/wiki/Mount_Emily_Reservoir), of which the pool was converted from. Mount Emily Swimming Pool was the first public pool in Singapore. During the [Japanese occupation](/wiki/Japanese_occupation_of_Singapore), the pool was reserved for soldiers use before ownership of the pool returned to the [Municipal Commission](/wiki/Municipal_Commission_of_Singapore) who closed the pool for 3 years to undergo renovation works. The pool reopened on 2 December 1949 and continued operations for 32 years before being closed and demolished in 1984. ## Etymology Mount Emily Swimming Pool was originally occupied by and named after the [Mount Emily Reservoir](/wiki/Mount_Emily_Reservoir) which, established in 1878, served as a [water pumping station](/wiki/Water_pumping) to towns in Singapore before falling out of disuse, following the completion of the [Fort Canning Reservoir](/wiki/Fort_Canning_Reservoir), and was converted into a popular resort, with a park and playground. ## Description When it was first opened in 1931, Mount Emily Swimming Pool had one pool with a smaller section that was shallower for children and non-swimmers and a larger section that was 164 feet long and 40 feet wide that was for more experienced swimmers. These sections were separated by a concrete wall. The pool could hold approximately 650,000 gallons of fresh water that was supplied by an [inlet well](/wiki/Inlet). The water travelled through a V-notch to distribute the water to the shallow and deeper section, respectively. Dressing rooms consisted of 20 cubicles with 6 showers. There was also a shelter around the pool. ## History ### Plans and construction Plans for a public swimming pool were suggested in 1929 at a municipal meeting and Mount Emily Reservoir was determined to be a suitable site. Mount Emily Swimming Pool was built on the reservoir at a cost of [S$](/wiki/Singapore_dollar)30,000 to convert it into a swimming pool and was officially opened on 10 January 1931 by President of the Municipal Commission [R. J. Farrer](/wiki/Roland_John_Farrer). The original brick-lined tank with a depth of 15 feet was changed to 2 foot 9 by 5 foot 9. This was achieved by filling it with dirt up to the desired level and covering it with concrete. The original tank also slanted 45 degrees and engineers had to build concrete pillars and beams along with a vertical wall going around the pool to make it safer for swimmers. Half of the reservoir was retained and used to flush drains and perform town cleansing. Mount Emily Swimming Pool was also the first public pool in Singapore. On 24 March 1931, at a municipal meeting, the diving board was converted into a [spring board](/wiki/Springboard) and cubicles were given [wire netting](/wiki/Wire_netting) as roof coverage. At another municipal meeting on 26 July 1931, a [swimming gala](/wiki/Swimming_gala) was decided to be held at Mount Emily Swimming Pool on 15 August along with other things such as the painting of the floor of the pool at S$450.00, by-laws for the pool, management of the pool, and admission prices for the pool. Quarterly season tickets cost S$1.50 and S$2.50 for people aged below and above 17, respectively and admission prices cost S$0.10 and S$0.20 for swimming and [mixed bathing](/wiki/Mixed_bathing), respectively. At certain times, students were allowed to enter for free. In June 1935, an estimated 8,000 people used the pool. In September 1935, the pool had been used by an estimated 9,000 people, being the best month for Mount Emily Swimming Pool. Mount Emily Swimming Pool was also sometimes lent out to schools for swimming sports. ### Acquisition of the pool by the Japanese and brief closure During the [Japanese occupation](/wiki/Japanese_occupation_of_Singapore), Mount Emily Swimming Pool, which was normally managed by the [Municipal Commission](/wiki/Municipal_Commission_of_Singapore), was managed by the Japanese. During this period, the pool was reserved for soldiers that served the Japanese and used salt water instead of fresh water. This required a salt water pump to be built. Upon the re-acquisition of the pool by the Municipal Commission in 1946, Municipal Water Engineer [D. J. Murnane](/wiki/D._J._Murnane) stated that the pool would be closed for repair as the [water purification plant](/wiki/Water_purification) used to purify the salt water was in poor condition and had to be fixed. In 1947, Mount Emily Swimming Pool was expected to be reopened on 1 February 1948. A tender had been approved for the renovation of the pool and work that still needed to be done on the pool included adding a [filter](/wiki/Water_filter) and new pumps. The tiling and other parts of the pool were also damaged that were suspected to have been sustained during the Japanese occupation. Municipal Architect D. C. Rae stated that the work was expected to have been completed by the end of January 1948. Overalls costs for the repairs totalled S$36,000. During this period, plans to build a second public pool were announced at Monk's Hill, [Bukit Timah](/wiki/Bukit_Timah), with Rae stating that Mount Emily was \"unsuitable from a long-term point of view\". Mount Emily Swimming Pool was planned to be demolished following the construction of the second pool, however no date was planned yet for the construction of the second pool. The pool briefly reopened in October 1948 before closing again due to an outbreak of [polio](/wiki/Polio). Whilst closed, a new filtration plant was built for Mount Emily Swimming Pool after it was considered that \"it [was] not possible to keep the water in the pool in a satisfactory condition for swimming with the existing equipment.\" ### Reopening and closure On 2 December 1949, the pool officially reopened following its closure since October 1948. Additional precautions were added to the pool where swimmers had to shower first before entering the pool. Police was also stationed there that turned away people who were unreasonably dressed or had skin diseases. In 1952, admission prices were raised by S$0.05 and S$0.10 cents. In 1951, the second public pool was planned to be built at Yan Kit Road, [Tanjong Pagar](/wiki/Tanjong_Pagar), at a cost of S$380,000. The pool featured three pools instead of one at Mount Emily and was opened in 1952 as [Yan Kit Swimming Complex](/wiki/Yan_Kit_Swimming_Complex). Mount Emily Swimming Pool was closed for renovation following the completion of Yan Kit Swimming Complex. Mount Emily Swimming Pool later became managed by the [Singapore Sports Council](/wiki/Singapore_Sports_Council) and was the only pool, out of ten others that the Singapore Sports Council managed, that still had \"women-only\" days. This was due to its decreasing popularity as more swimming pools were built and Mount Emily Swimming Pool's location that was far away from major housing, with it being the least frequented among the other pools managed by the Singapore Sports Council. In 1978, an estimated 46,000 people used Mount Emily Swimming Pool. In 1983, Singapore Sports Council announced that Mount Emily Swimming Pool would be demolished with the pool having been closed since December 1981. The pool was completed demolished by 1984. The former site of the Mount Emily Swimming Pool was filled up to became an expansion of [Mount Emily Park](/wiki/Mount_Emily_Park). - [Yan Kit Swimming Complex](/wiki/Yan_Kit_Swimming_Complex)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:34:41.602945",
  "title": "Mount Emily Swimming Pool",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Mount_Emily_Swimming_Pool"
}