{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:34:43.044303"
  },
  "content": "Small hill in central Singapore **Mount Vernon** ([Chinese](/wiki/Simplified_Chinese): 翡珑山; [Malay](/wiki/Malay_language): *Gunung Vernon*) is a small hill in central Singapore west of [Potong Pasir](/wiki/Potong_Pasir) and north of [MacPherson Estate](/wiki/MacPherson,_Singapore). Officially named in 1956, it is circumscribed by [Bartley Road](/wiki/Bartley_Road), Upper Aljunied Road, [Upper Serangoon Road](/wiki/Upper_Serangoon_Road), and Upper Paya Lebar Road. It is named after British [Royal Navy](/wiki/Royal_Navy) Vice Admiral [Edward Vernon](/wiki/Edward_Vernon) (1684–1757). ## Features Mount Vernon is relatively undeveloped due to Mount Vernon Crematorium and [Bidadari Cemetery](/wiki/Bidadari_Cemetery) being located on it. Both facilities have since shut down, and major residential development is expected in that area. The hill itself is likely to remain intact, however, as it is largely occupied by the [Mount Vernon Camp](/wiki/Mount_Vernon_Camp), the operational and residential base of the [Gurkha Contingent](/wiki/Gurkha_Contingent). ## Infrastructure ### Public services The [Singapore Society for the Prevention of Cruelty to Animals](/wiki/Society_for_the_Prevention_of_Cruelty_to_Animals#Oceania_and_Asia) moved to the edge of Mount Vernon in 1984 after being relocated from [Orchard Road](/wiki/Orchard_Road). [Mount Vernon Columbarium](/wiki/Mount_Vernon_Columbarium) started operations in 1962. Due to inability to handle the amount of cremations needed daily, a new crematorium was built at Mandai. On 30 June 2004, the crematorium ceased cremation services. The Columbarium is still operational. Bidadari Cemetery used to be a private burial site and 1972, became a public burial site. The Cemetery was closed on 2001 and graves exhumed to make way for a new town. ### Education Despite the small area, there are two education institutions in the area, [Bartley Secondary School](/wiki/Bartley_Secondary_School) and [Maris Stella High School](/wiki/Maris_Stella_High_School). Mount Vernon was home to other several schools, including Mount Vernon Secondary and Sang Nila Utama Secondary, which have since been closed down. ### Transportation There are two MRT stations nearby. The nearer, [Woodleigh MRT station](/wiki/Woodleigh_MRT_station), part of the [North East Line](/wiki/North_East_Line) has been operational since 20 June 2011. [Bartley MRT station](/wiki/Bartley_MRT_station), by the side of Maris Stella High School, has been operational since 28 May 2009, and is part of the [Circle Line](/wiki/Circle_Line_(Singapore)). - Victor R Savage, Brenda S A Yeoh (2004), *Toponymics – A Study of Singapore Street Names*, Eastern University Press, [ISBN](/wiki/ISBN_(identifier)) 981-210-364-3 1°20′14″N 103°52′37″E﻿ / ﻿1.3371°N 103.8769°E﻿ / 1.3371; 103.8769 This [Singapore](/wiki/Singapore) location article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:34:43.044012",
  "title": "Mount Vernon, Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Mount_Vernon,_Singapore"
}