{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:34:49.925118"
  },
  "content": "Listed retailer in SingaporeThis article **contains promotional content**. Please help improve it by removing promotional language and inappropriate external links, and by adding encyclopedic text written from a neutral point of view. *(March 2015)* *(Learn how and when to remove this message)* **Mr Bean Group Limited** is a Singapore-based retailer that specializes in soybean-based food and drink products. The company was founded in 1995 as a hawker stall that sold [soy milk](/wiki/Soy_milk) and [soy beancurd](/wiki/Soybean_curd), and has since expanded its product line and retail presence. The company operates through its managing company, Super Bean International Pte Ltd, which oversees the production and distribution of Mr Bean's products. The company's products include a variety of [soybean](/wiki/Soybean)-based food and drink items such as soy milk, beancurd, pancakes, and ice cream. As of August 2018, Mr Bean had a chain of 67 retail outlets, with four of these located overseas - two in the Philippines, one in South Korea, and one in Japan. The majority of Mr Bean's retail outlets are located in Singapore. ## History Mr Bean was founded in 1995 by Kang Puay Seng, who is now the managing director of Super Bean International, and Loh Jwee Poh, executive director of Super Bean and Kang's schoolmate. The first Mr Bean stall was located at People's Park Hawker Centre. Having found a machine that could make soya milk quickly and efficiently, they established small [kiosks](/wiki/Kiosks) in accessible areas at [shopping malls](/wiki/Shopping_malls), [hospitals](/wiki/Hospitals), [schools](/wiki/Schools) and [MRT](/wiki/Mass_Rapid_Transit_(Singapore)) stations. Subsequently, additional stalls were opened. As of January 2020, Mr Bean operates 76 outlets worldwide and has an overseas presence in Vietnam, Japan, and South Korea. ## Outlets ### Singapore In 2013, Mr Bean had more than 30 local outlets in Singapore. As of January 2020, Mr Bean has a total of 76 outlets, with some outlets located near [Singapore MRT](/wiki/Singapore_MRT) stations. ### Japan In January 2010, in a partnership with Tokyu Gourmet Front, Super Bean International opened a Mr Bean outlet in [Shibuya](/wiki/Shibuya,_Tokyo), Japan, at the Shibuya Train Station. ### Future In March 2012, the Mr Bean group announced that it will open twelve stores across the region by the end of the year, to add to its five outlets in [Tokyo](/wiki/Tokyo), [Seoul](/wiki/Seoul), [Malaysia](/wiki/Malaysia) and [Shanghai](/wiki/Shanghai). With the regional expansion underway, Mr Bean hopes to double the number of overseas stores to 34 by 2013 and eventually expand to other markets such as the United States. However, due to franchising issues in China, and poor sales and business failures in Malaysia,[*citation needed*] Mr Bean has closed all its franchise stores in Malaysia and China. ## Branding The company's name originated when both founders wanted to differentiate their stall from their competitors'. As the founders were selling soya bean drinks and both of them were men, they decided to call their company Mr Bean. When Mr Bean was launched in 1995, their original logo had an ‘oriental’ look. ## Products As of 2008, Mr Bean offered at least 28 products. Its soya drinks range from plain soya milk to variations of soya milk that include chendol soya milk, fruity soya milk, and icy mocha soya milk. Mr Bean also produces a wide range of products that use soya beans, such as various flavours of soya milk, biscuits, pancakes and ice cream. The company also diversified to sell Mr Bean merchandise. Some of their merchandise includes towels, plush toys, bookmarks and bags. Mr Bean also invested in R&D to brainstorm and develop new product ideas, as well as organised sample testing sessions. - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:34:49.924731",
  "title": "Mr Bean (company)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Mr_Bean_(company)"
}