{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:34:54.473537"
  },
  "content": "This article **relies excessively on references to primary sources**. Please improve this article by adding secondary or tertiary sources. *Find sources:* \"Municipal Services Office\" Singapore – news **·** newspapers **·** books **·** scholar **·** JSTOR *(May 2023)* *(Learn how and when to remove this message)*Government of Singapore The **Municipal Services Office** (MSO) ([Malay](/wiki/Malay_language): *Pejabat Perkhidmatan Perbandaran*; [Chinese](/wiki/Chinese_language): 社区事务署; [Tamil](/wiki/Tamil_language): நகராட்சி சேவைகள் அலுவலகத்தின்) is a coordinating office under the [Ministry of National Development](/wiki/Ministry_of_National_Development_(Singapore)) of the [Government of Singapore](/wiki/Government_of_Singapore) that works with key government agencies to improve feedback management and customer service for such municipal services. Since the office establishment in 2014, a Minister in Charge of the Municipal Services Office (MSO) in Singapore was appointed. This role involves the coordination between the different government agencies and town councils to streamline feedback and service delivery related to public areas, infrastructure, and the general upkeep of the living environment. With effect from 23 May 2025, Minister of State [Alvin Tan](/wiki/Alvin_Tan_(politician)) is in charge of the MSO. ## History The MSO was set up on 1 October 2014 to improve the Government's overall coordination and delivery of municipal services. The MSO is part of the Government's on-going efforts to improve the delivery of municipal services by various public agencies in Singapore. Municipal services are services that pertain to the upkeep and improvement of the living environment for residents and the general public. These include managing the cleanliness of public areas, maintenance of greenery and local infrastructure such as roads and footpaths. Minister in the Prime Minister's Office [Grace Fu](/wiki/Grace_Fu) was put in charge of the MSO. The MSO had conducted a four-month pilot with two [town councils](/wiki/Town_council) (Jurong Town Council and Holland-Bukit Panjang Town Council) to improve management of problems on the ground, and is currently expanding to partner with six more town councils for a second pilot phase. ## Organisation Structure The MSO has two divisions: Planning, Operations & Digital (POD) Division and Service Quality & Community Engagement (SQCE) Division. Planning, Operations & Digital (POD) Division helps prepare the municipal sector for the future with horizon scanning and [predictive analytics](/wiki/Predictive_analytics) capabilities, and future-oriented transformation thrusts such as integrated municipal operations and OneService digitalisation work. The MSO's flagship OneService mobile application is a one-stop “all things neighbourhood\" community platform for residents to provide feedback on municipal issues, find out more about their neighbourhood, and access Government and Town Council e-services. Their aim is to improve service delivery to residents, minimise local-level inconveniences, and prepare the sector to do more and better, despite future challenges. Service Quality & Community Engagement (SQCE) Division comprises two teams: the i) Service Quality team; and the ii) Engagement & Outreach team. The Service Quality team looks into 5 key areas of Feedback Management, Ops Coordination and Delivery, Capability Development, Performance Management as well as Case Management, by working closely with MSO's 10 partner agencies and 17 Town Councils (TCs) to improve municipal services delivery. Key initiatives include the Municipal Reference Guide (MRG), Digital channel migration efforts and OS App user experience which facilitate Feedback Management; key frameworks and protocols for complex municipal issues; and Capability Development programmes and initiatives for agencies and TCs. The Engagement & Outreach team promotes community partnership and civic responsibility by working with government agencies, Town Councils, and the community to: 1. Promote the use of the OneService App, 2. Educate the public on responsible social behaviour, 3. Engage youths and the community to take ownership of their living environment by developing ground-up ideas to address municipal issues, and 4. Recognise outstanding government agencies, Town Councils, and community partners through the annual Municipal Services Awards (MSA), as part of the OneService Recognition Framework. ## Scope Common municipal issues under the scope of the MSO includes: - Cleanliness issues - Maintenance of roads and footpaths - Water supply and drains issues - Pest related issues - Trees/Greenery issues - Animal related Issues ### Partners The MSO works with its partners - public agencies and Town Councils (TCs) - to improve feedback management and service delivery for these municipal services. The MSO continuously reviews and fine-tunes work processes to better manage and address public feedback on municipal issues, so that the cases can be resolved quickly and effectively. In particular, the MSO takes the lead to coordinate with public agencies and TCs to develop systemic solutions to resolve complex issues which cut across different public agencies and TCs so as to better serve residents and the general public. The MSO also supports the transformation of the municipal services sector to better leverage technology, build capabilities, and inculcate a OneService culture among its partners. The MSO also engages the community to facilitate ground-up initiatives and promote stronger civic responsibility. The MSO currently work with 10 [government agencies](/wiki/Government_agency) to better facilitate and improve inter-agency coordination in municipal matters. These are: - [Building and Construction Authority](/wiki/Building_and_Construction_Authority) (BCA) - [Housing and Development Board](/wiki/Housing_and_Development_Board) (HDB) - [Land Transport Authority](/wiki/Land_Transport_Authority) (LTA) - [National Environment Agency](/wiki/National_Environment_Agency) (NEA) - [National Parks Board](/wiki/National_Parks_Board) (NParks) - [People's Association](/wiki/People%27s_Association) (PA) - [Public Utilities Board](/wiki/Public_Utilities_Board) (PUB) - [Singapore Land Authority](/wiki/Singapore_Land_Authority) (SLA) - [Singapore Police Force](/wiki/Singapore_Police_Force) (SPF) - [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) (URA) ## Minister-in-charge of the MSO Years in OfficeMinister-in-charge2014 – 2020[Grace Fu](/wiki/Grace_Fu)2020 – 2025[Sim Ann](/wiki/Sim_Ann)2025 to Present[Alvin Tan](/wiki/Alvin_Tan_(politician)) - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:34:54.473282",
  "title": "Municipal Services Office (Singapore)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Municipal_Services_Office_(Singapore)"
}