{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:06:58.980706"
  },
  "content": "1987 unsolved murder in Sydenham, London **Daniel John Morgan** (3 November 1949 – 10 March 1987) was a British [private investigator](/wiki/Private_investigator) who was murdered with an axe in a pub car park in [Sydenham, London](/wiki/Sydenham,_London), in 1987. Despite several [Metropolitan Police](/wiki/Metropolitan_Police) investigations, arrests, and trial, the crime remains unsolved. An independent review into the handling of the investigation of Morgan's killing was published in 2021; it found that the Met Police had \"a form of institutional [corruption](/wiki/Corruption)\" which had concealed or denied failings in the case. At the time of his death, Morgan worked for Southern Investigations, a company he had founded with his business partner [Jonathan Rees](/wiki/Jonathan_Rees). Rees was arrested in April 1987 on suspicion of murder along with Morgan's future replacement at Southern, Detective Sergeant Sid Fillery, and two brothers, Glenn and Garry Vian. All were released without charge. Over the next three decades, several additional police inquiries were conducted. In 2009 Rees, Fillery, the Vian Brothers and a builder, James Cook, appeared at the [Old Bailey](/wiki/Old_Bailey) charged with Morgan's murder. The trial collapsed in 2011 after evidence obtained from [supergrasses](/wiki/Supergrass_(informant)) was deemed inadmissible by the court. Shortly after the case, the activities of Rees – as a private investigator – became the centre of allegations concerning the conduct of journalists at the now-defunct *[News of the World](/wiki/News_of_the_World)* newspaper. In 2006 Morgan's unsolved murder was described by [Jennette Arnold](/wiki/Jennette_Arnold), a former [Labour Co-op](/wiki/Labour_and_Co-operative) politician who served as chair of the [London Assembly](/wiki/London_Assembly), as a reminder of the culture of corruption and unaccountability within the Metropolitan Police. The profile of the case has been raised by investigative journalist [Peter Jukes](/wiki/Peter_Jukes), who released a podcast and book about the murder in conjunction with Alastair Morgan, Daniel's brother. ## Early life Daniel Morgan was born on 3 November 1949 in [Singapore](/wiki/Singapore), the son of an army officer. He grew up with an elder brother and younger sister in [Monmouthshire](/wiki/Monmouthshire_(historic)), [Wales](/wiki/Wales), where he attended agricultural college in [Usk](/wiki/Usk) before spending time in [Denmark](/wiki/Denmark)[*when?*] gaining experience of farming. Morgan had an exceptional memory for small details, such as car registration numbers, and in 1984 he set up a detective agency, Southern Investigations, in [Thornton Heath](/wiki/Thornton_Heath), southern Greater London. He married in his late twenties and moved to London, where he and his wife settled and had two children. At the time of his murder, Morgan was having an affair with a woman named Margaret Harrison, and had met her at 6:30 pm at a wine bar in [Thornton Heath](/wiki/Thornton_Heath) shortly before the murder. ## Murder On 10 March 1987, after having a drink with [Jonathan Rees](/wiki/Jonathan_Rees) (his partner in Southern Investigations) at the Golden Lion pub in Sydenham, 37-year-old Morgan was found dead in the pub car park next to his car. [DS](/wiki/Detective_Sergeant) Sid Fillery, based at [Catford](/wiki/Catford) police station, was assigned to the case, but did not reveal to superiors that he had been working unofficially for Southern Investigations. In April 1987, six people, including Fillery and Rees, Rees' brothers-in-law Glenn and Garry Vian, and two Metropolitan Police officers, were arrested on suspicion of murder. All were eventually released without charge. At the inquest into Morgan's death in April 1988, it was alleged that Rees, after disagreements with Morgan, told Kevin Lennon (an accountant at Southern Investigations) that officers at Catford police station who were friends of his were either going to murder Morgan or would arrange it, and that Fillery would replace Morgan as Rees's partner. When asked, Rees denied murdering Morgan. Fillery, who had retired from the Metropolitan Police on medical grounds and joined Southern Investigations as Rees's business partner, was alleged by witnesses to have tampered with evidence and attempted to interfere with witnesses during the inquiry. In the summer of 1987, [DC](/wiki/Detective_constable) Alan \"Taffy\" Holmes, an acquaintance of Morgan, was found to have died by [suicide](/wiki/Suicide_in_the_United_Kingdom) under mysterious circumstances. Morgan and Holmes had allegedly collaborated on unveiling police corruption. This was discounted by the Daniel Morgan Independent Panel report. DC Derek Haslam claimed to be one of Morgan's sources for this allegation, but was discounted as a serial fantasist by [Baroness O'Loan](/wiki/Nuala_O%27Loan,_Baroness_O%27Loan).[*citation needed*] The [murder of Stephen Lawrence](/wiki/Murder_of_Stephen_Lawrence) in 1993 and subsequent reports on police conduct brought further insight into ongoing police corruption in south-east London. ## Police investigations In the years following Morgan's death, four police inquiries were conducted.[a] There were allegations of police corruption, [drug trafficking](/wiki/Drug_trafficking) and [robbery](/wiki/Robbery). ### Morgan One Investigation During an initial Metropolitan Police inquiry, Rees and Fillery were questioned, but both denied involvement in the murder. ### Hampshire/Police Complaints Authority Investigation After an inquiry by Hampshire police in 1988, Rees and another man were charged with the murder, but the charges were dropped because of a lack of evidence. The Hampshire inquiry's 1989 report to the Police Complaints Authority stated that \"no evidence whatsoever\" had been found of police involvement in the murder. ### Operation Nigeria/Two Bridges In 1998, the Metropolitan Police [Deputy Assistant Commissioner](/wiki/Deputy_Assistant_Commissioner), [Roy Clark](/wiki/Roy_Clark_(police_officer)), secretly conducted an intelligence-gathering operation with potential links to the murder, during which Southern Investigations' office was bugged by a known police informant. In December 2000, Rees was found guilty of conspiring to plant cocaine on an innocent woman to discredit her in a child custody battle, and sentenced to seven years imprisonment for attempting to pervert the course of justice. When the Morgan family called for disclosure of the 1989 Hampshire police report, Clark imposed very restrictive conditions. ### Abelard One/Morgan Two Investigation In the fourth inquiry, which took place from 2002–2003, a suspect's car and Glenn Vian's house were bugged and conversations recorded. As a result of the inquiry, the Metropolitan Police obtained evidence that linked a number of individuals to the murder, but the [Crown Prosecution Service](/wiki/Crown_Prosecution_Service) decided that the evidence was insufficient to prosecute anyone. ### Abelard Two Investigation After the [Metropolitan Police Commissioner](/wiki/Metropolitan_Police_Commissioner) [Sir Ian Blair](/wiki/Sir_Ian_Blair) declared that the first police inquiry involving Fillery was \"compromised\", a secret fifth inquiry (fourth, according to the Independent Panel report's terminology in 2021) began. Detective Superintendent David Cook was appointed to head an inquiry to review the evidence. Cook described the murder as \"one of the worst-kept secrets in south-east London\", claiming that \"a whole cabal of people\" knew the identity of at least some of those involved. He said that efforts had been made to blacken Morgan's character, and dismissed claims that Morgan might have been killed after an affair with a client or because of an involvement with Colombian drug dealers. He identified the main suspects as \"white Anglo-Saxons\". Morgan's brother Alastair, who had been critical of police inaction and incompetence, expressed confidence in Cook. In 2006, [Jennette Arnold](/wiki/Jennette_Arnold), a member of the [Metropolitan Police Authority](/wiki/Metropolitan_Police_Authority) and Alastair Morgan's [London Assembly](/wiki/London_Assembly) constituency representative, described the unsolved murder as \"a reminder of the old police culture of corruption and unaccountability\" in London. Bugs were installed at Glenn Vian's home. Police arrested Rees and Fillery once again, along with Glenn and Garry Vian, and a builder named James Cook, all on suspicion of murder, as well as a serving police officer suspected of leaking information. Fillery was arrested on suspicion of attempting to pervert the course of justice. Alastair Morgan described it as a \"massive step forward\". ## Collapse of trial In 2009 the trial of Rees, Fillery, the Vian brothers and Cook began at the [Old Bailey](/wiki/Old_Bailey). In February 2010, the trial judge dismissed a key [supergrass](/wiki/Supergrass_(informer)) witness and a stay of prosecution was ordered in Fillery's case. In November 2010, a second supergrass witness was dismissed, James Cook was discharged, and in January 2011, a third supergrass witness was dismissed, after accusations that police had failed to disclose that he was a registered police informant. In March 2011, [Director of Public Prosecutions](/wiki/Director_of_Public_Prosecutions_(England_and_Wales)) Sir [Keir Starmer](/wiki/Keir_Starmer) abandoned the case. Rees and his former brothers-in-law were acquitted, because the prosecution were unable to guarantee the defendants' right to a fair trial. Charges against Fillery and another had already been dropped. The case had not reached the stage of considering whether the defendants had murdered Morgan but was still dealing with preliminary issues. The judge, Mr [Justice Maddison](/wiki/David_Maddison), mentioned the case's vastness and complexity, involving some of the longest legal argument submitted in a trial in the English criminal courts. While he considered that the prosecution had been \"principled\" and \"right\" to drop the case, the judge observed that the police had had \"ample grounds to justify the arrest and prosecution of the defendants\". In the course of the five inquiries, some 750,000 documents associated with the case, most of them not computerised, had been assembled. Some of these related to evidence provided by the criminal \"supergrasses\" that the defence claimed was too unreliable to be put to a jury. In March 2011, four additional crates of material not disclosed to the defence were found. This followed earlier problems with crates of documents being mislaid and discovered by chance. [Nicholas Hilliard](/wiki/Nicholas_Hilliard_(judge)) QC, appearing for the CPS, acknowledged the police could not be relied upon to ensure access to documents that the defence might require and the prosecution was fatally undermined as a result. The Metropolitan Police's senior homicide officer, Detective Chief Superintendent Hamish Campbell, apologised to the family, acknowledging the impact on the case of police corruption in the past. \"This current investigation has identified, ever more clearly, how the initial inquiry failed the family and wider public. It is quite apparent that police corruption was a debilitating factor in that investigation.\" While indicating a satisfactory relationship with the police officers present, Morgan's family condemned the way police and the Crown Prosecution Service had investigated the case and their failure to bring anyone to trial. For much of the family's 24-year-long campaign for justice, they had encountered \"stubborn obstruction and worse at the highest levels of the Metropolitan Police\", an impotent police complaints system and \"inertia or worse\" on the part of successive governments. ## *News of the World* scandal After the collapse of the Old Bailey trial in March 2011, it was revealed that Rees had earned £150,000 a year from the *[News of the World](/wiki/News_of_the_World)* for supplying illegally obtained information about people in the public eye. After Rees completed his prison sentence for perverting the course of justice, he was hired again by the *News of the World*, at the time edited by [Andy Coulson](/wiki/Andy_Coulson). Rees worked regularly on behalf of the *[Daily Mirror](/wiki/Daily_Mirror)* and the *[Sunday Mirror](/wiki/Daily_Mirror#Sunday_Mirror)* as well as the *News of the World*, investigating the bank accounts of the royal family and obtaining information on public figures. He had a network of contacts with corrupt police officers, who obtained confidential records for him. He claimed that his extensive contacts provided him with confidential information from banks and government organisations and he was routinely able to obtain confidential data from bank accounts, telephone records, car registration details and computers. He was also alleged to have commissioned burglaries on behalf of journalists. Despite detailed evidence, the [Metropolitan Police](/wiki/Metropolitan_Police) failed to pursue investigations into Rees's corrupt relationship with the *News of the World* over more than a decade. In 2006, the Metropolitan Police accepted the *News of the World*'s disclaimer that the paper's royal correspondent [Clive Goodman](/wiki/Clive_Goodman), who had been sent to prison in 2007 for intercepting the voicemail of the British royal family, had been operating alone. They did not interview any other *News of the World* journalists or executives and did not seek a court order allowing them access to *News of the World* internal records. In June 2011, *[The Guardian](/wiki/The_Guardian)* newspaper, calling for a public inquiry into the *News of the World* phone-hacking scandal, focused its criticism of the parent company [News Corporation](/wiki/News_Corporation)'s handling of accusations of crime within the organisation on the newspaper's use of Jonathan Rees's investigative services. Rees's activities were described as a \"devastating pattern of illegal behaviour\", far exceeding those of the other investigators commissioned by News Corporation, who used illicit means to target prominent figures. They included unauthorised access to computer data and bank accounts, corruption of police officers and alleged commissioning of burglaries, for information about targets at the highest level of state and government, including the royal family and the Cabinet, police chief commissioners, governors of the Bank of England and the intelligence services. *The Guardian* queried why the Metropolitan Police had chosen to exclude a very large quantity of Rees material from investigation by its Operation Weeting inquiry into phone hacking. *The Guardian* had published extensively on Rees’s involvement with corrupt police officers and the procurement of confidential information for what *Guardian* journalist [Nick Davies](/wiki/Nick_Davies) described as Rees's one \"golden source\" of income in particular, commissions from the *News of the World*. Davies has reported at length on what he described as the \"empire of corruption\" that Jonathan Rees and Sid Fillery built in the years following Daniel Morgan's murder, after Fillery replaced Morgan as Rees's partner. ## Independent inquiry In May 2013, the [Home Office](/wiki/Home_Office) announced it was to hold an independent inquiry into Morgan's death. Home Secretary [Theresa May](/wiki/Theresa_May) acknowledged that there was \"no likelihood of any successful prosecutions being brought in the foreseeable future\" but said that the independent panel would \"shine a light\" on the circumstances of his murder and the handling of the case. [Mark Ellison QC](/wiki/Mark_Ellison) published a report on 6 March 2014 into alleged [Metropolitan Police](/wiki/Metropolitan_Police) corruption in the [murder of Stephen Lawrence](/wiki/Murder_of_Stephen_Lawrence). The report also commented that there was substantial evidence linking an alleged corrupt police officer with involvement in the murder of Morgan. In July 2014, it was announced that [Baroness O'Loan](/wiki/Baroness_O%27Loan) would be taking over chairing the inquiry, on the withdrawal of previous chairman [Stanley Burnton](/wiki/Stanley_Burnton), and [Kate Blackwell](/wiki/Kate_Blackwell_(barrister)) QC was appointed as counsel to the panel. In October 2014 the Vian brothers, Fillery, Rees and Cook launched a £4 million lawsuit against the Metropolitan Police. In February 2017 the [High Court](/wiki/High_Court_of_Justice) ruled on the lawsuit. Rees and the Vians lost their claim, but Fillery was awarded £25,000 in interim damages with a higher amount to be determined later. The Rees and Vians appeal was heard in 2018. In 2019 Rees and the Vians were awarded damages of £414,000 after winning their [malicious prosecution](/wiki/Malicious_prosecution) case against the Metropolitan Police. The inquiry was due to publish its report on 17 May 2021, but was delayed further by the [Home Secretary](/wiki/Home_Secretary), [Priti Patel](/wiki/Priti_Patel) wanting to review it for national security and human rights issues. On 18 May, the panel refused to hand over the report, claiming that it had already been extensively vetted to ensure it complied with the government's human rights obligations and senior police officers had confirmed it did not pose any national security issues. Morgan's family objected that the intervention was \"unnecessary and inconsistent with the panel's independence\" and also suspected the involvement of \"[Rupert Murdoch](/wiki/Rupert_Murdoch)'s media empire\". The report was finally published on 15 June 2021. The report found that the Metropolitan Police were \"institutionally corrupt\" in its handling of the investigation into the murder of Daniel Morgan and that the force had placed protecting its reputation above the investigation. On 10 May 2023, the Metropolitan Police stated that they had found relevant documents in a locked cabinet. They apologised to the family and the Panel. ## IOPC assessment of the DMIP report On 3 August 2022, the Independent Office for Police Conduct published its assessment of the report from the Independent Panel. It found \"no new avenues for investigation which could now result in either criminal or disciplinary proceedings\" but concluded that Assistant Commissioner John Yates and Commissioner Cressida Dick may have breached professional standards. ## Media depictions ### Podcast In May 2016, Morgan's murder became the subject of a 10-part [podcast](/wiki/Podcast) presented by [Peter Jukes](/wiki/Peter_Jukes), *Untold: The Daniel Morgan Murder* which topped the UK [iTunes](/wiki/ITunes) podcast chart. The following year, Jukes co-wrote a book with Alastair Morgan titled *Untold: the Daniel Morgan Murder Exposed*, which featured new revelations about the case. ### Channel 4 documentary *Murder in the Car Park*, a three-part [Channel 4](/wiki/Channel_4) [documentary](/wiki/Documentary_film) about the murder was first broadcast on UK television on 15 June 2020, ahead of the results of an independent inquiry. ### Drama David Cook's investigation was dramatised in the 2025 ITV series about the [News International phone hacking scandal](/wiki/News_International_phone_hacking_scandal), *[The Hack](/wiki/The_Hack)*, with [Robert Carlyle](/wiki/Robert_Carlyle) as DCS Cook. ## Civil legal claim by Morgan’s family In December 2021 Morgan’s family issued a legal claim against the Metropolitan police alleging misfeasance in a public office and breaches of the [Human Rights Act](/wiki/Human_Rights_Act_1998). In July 2023 it was announced that the family had reached an agreement for a financial settlement with the Met, which admitted liability for errors and corruption. The terms of the settlement were confidential, at the request of the family. - [List of unsolved murders in the United Kingdom](/wiki/List_of_unsolved_murders_in_the_United_Kingdom) - [Metropolitan police role in phone hacking scandal](/wiki/Metropolitan_police_role_in_phone_hacking_scandal) - [Phone hacking scandal reference lists](/wiki/Phone_hacking_scandal_reference_lists) - [Murder of Lindsay Rimer](/wiki/Murder_of_Lindsay_Rimer), unsolved 1994 murder in England also subject to many theories ## Notes ## Sources - Morgan, Alastair; [Jukes, Peter](/wiki/Peter_Jukes) (2017). *Untold: Exposing the Truth About the Daniel Morgan Murder* (1st ed.). [Blink Publishing](/wiki/Bonnier_Group). p. 352. [ISBN](/wiki/ISBN_(identifier)) 9781911274605. - Untold podcast by Peter Jukes and Deeivya Meir\n",
  "language": "en",
  "processed_at": "2026-01-12T10:06:58.980254",
  "title": "Murder of Daniel Morgan",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Daniel_Morgan_(private_investigator)"
}