{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:34:56.925286"
  },
  "content": "1989 murder case in Singapore On 28 January 1989, 26-year-old **Lim Lee Tin** ([Chinese](/wiki/Chinese_language): 林丽珍; [pinyin](/wiki/Pinyin): *Lín Lìzhēn*), a Chinese Singaporean who was often [dressed like a male](/wiki/Cross-dressing), was found murdered at a Chinese cemetery in [Choa Chu Kang](/wiki/Choa_Chu_Kang), Singapore. The perpetrators were Lim's gambling partner and married housewife **Chin Seow Noi** ([Chinese](/wiki/Chinese_language): 秦秀莲; [pinyin](/wiki/Pinyin): *Qín Xiùlián*),[a] Chin's brother **Chin Yaw Kim** ([Chinese](/wiki/Chinese_language): 秦耀金; [pinyin](/wiki/Pinyin): *Qín Yàojīn*),[b] and the siblings' friend **Ng Kim Heng** ([Chinese](/wiki/Chinese_language): 黄金兴; [pinyin](/wiki/Pinyin): *Huáng Jīnxīng*). The three suspects, who were all [Malaysians](/wiki/Malaysians), were said to have plotted the murder to get rid of Lim, who often harassed Chin Seow Noi for money. Between February 1989 and July 1991, the three suspects were arrested in both Singapore and Malaysia. Despite confessing to their roles in the crime, the three killers denied in the court proceedings that they were involved in killing Lim, and chose to remain silent during the defence phase of their trial. On 9 October 1992, [Judicial commissioner](/wiki/Judicial_commissioner) Amarjeet Singh of the High Court judged the trio guilty of Lim's murder and [sentenced them to death](/wiki/Capital_punishment_in_Singapore) by [hanging](/wiki/Hanging). In the aftermath, the Chin siblings and Ng were hanged at [Changi Prison](/wiki/Changi_Prison) on 31 March 1995, and the case became a legal subject that touches on the validity of relying on a co-accused's statement to convict a person of murder. ## Murder and investigation On the morning of 28 January 1989, 26-year-old Lim Lee Tin's body was found in a drain at Choa Chu Kang Christian cemetery (a Chinese cemetery). Upon receiving the police report, the police investigators from the [CID](/wiki/Criminal_Investigation_Department_(Singapore)), led by Inspector [T. Maniam](/wiki/Murder_of_T._Maniam) (who would become a victim of murder in 1999), took charge of the investigations. Forensic pathologist Wee Keng Poh, who arrived at the scene, tested the body first-hand and found that the deceased man, who have seven knife wounds on his body, had sustained five fatal knife wounds to his heart and lungs, and Lim may have been taken by surprise when he was stabbed. At the start of the autopsy, Dr Wee discovered that Lim had [female](/wiki/Female) [sex organs](/wiki/Sex_organ). According to Lim's mother Chan Giok Mui and other family members, Lim, who possessed masculine-looking facial features, often behaved and dressed like a man, and used elastic binding to [wrap up her breasts](/wiki/Breast_binding). Due to her large man-like build, close-cropped short hair, manly appearance, and masculine mannerisms, Lim was often mistook as a man by her acquaintances and neighbours, and even the police officers prior to Dr Wee's discovery. Lim, who was also called \"Jack\" by her friends, was said to have wanted to go through a [sex change operation](/wiki/Sex_change_operation) prior to her murder. Singapore's *[The New Paper](/wiki/The_New_Paper)* described Lim as \"[trans-sexual](/wiki/Transsexual)\". She was unemployed and normally would help her parents to clean up the house and do house chores. The police investigations also extended to Lim's acquaintances. It led to the arrest of 29-year-old housewife Chin Seow Noi, a Malaysian and gambling partner of Lim. Upon her arrest on 1 February 1989 at her Jurong East flat, Chin confessed during police custody that she hired two men to help her \"get rid of\" Lim, who apparently harassed her for money over a period of time and took over S$10,000 from her. She was also allegedly shocked to hear that Lim, her former lover, was not born male. One of the two men implicated by Chin was her younger brother Chin Yaw Kim, a 27-year-old insurance agent. Yaw Kim was arrested in [Johor](/wiki/Johor) by the [Royal Malaysia Police](/wiki/Royal_Malaysia_Police) on 4 February 1989, and he was sent back to Singapore for investigations. Seow Noi was charged on 3 February 1989 with abetment of murder while Yaw Kim was charged on 7 February with murder. [Under Singapore law](/wiki/Capital_punishment_in_Singapore), an offence of murder warrants the [mandatory death penalty](/wiki/Mandatory_death_penalty) by [hanging](/wiki/Hanging). On the same date Seow Noi was charged, she was charged in the same court with two other men, who both were involved in two separate murder cases. The third culprit, identified as 25-year-old bus ticket seller Ng Kim Heng, was hiding in Malaysia as the authorities listed his name on the wanted list and traced his whereabouts. Ng spent two years living under fake names before he was caught by the Malaysian authorities on 20 July 1991, and turned over to the Singaporean police for investigations. He was the third and final suspect to be charged with murder in relation to Lim's death. ## Court proceedings On 28 September 1992, the three suspects - Chin Seow Noi, Chin Yaw Kim and Ng Kim Heng - first stood trial in the [High Court](/wiki/High_Court_of_Singapore) for the murder of 26-year-old Lim Lee Tin. Deputy Public Prosecutor (DPP) Seng Kwang Boon led the prosecution team, and [Judicial commissioner](/wiki/Judicial_commissioner) Amarjeet Singh presided the case hearing. ### Prosecution's case #### Witnesses' accounts The prosecution first presented their case and cross-examined witnesses, including Lim's family members and friends. Lim's mother Chan Giok Mui ([Chinese](/wiki/Chinese_language): 陈玉梅; [pinyin](/wiki/Pinyin): *Chén Yùmeí*) recounted that she first met Chin Seow Noi in February 1988, when she rented a room at their flat and lived in the same room with Lim. Chan said Chin lived at their flat for eight months until October 1988, the same month when Chin was married to her husband Siew See Kow ([Chinese](/wiki/Chinese_language): 萧世九; [pinyin](/wiki/Pinyin): *Xiāo Shìjiǔ*; aged 44 in 1995). Lim's father Lim Jer Min ([Chinese](/wiki/Chinese_language): 林日铭; [pinyin](/wiki/Pinyin): *Lín Rìmíng*) told the police that on the afternoon of 27 January 1989, Lim Lee Tin, who was the second of his three daughters, went outdoors from the family's Ang Mo Kio flat at around 3 pm, but she did not tell him where she was going. That was the last time Lim's father saw her alive. The last phone call made by Lim was to her eldest sister Lim Yee Fan ([Chinese](/wiki/Chinese_language): 林伊凡; [pinyin](/wiki/Pinyin): *Lín Yīfán*) on the night of 27 January at 9 pm, but Yee Fan did not take the call. She recounted that prior to her going outdoors and her murder, Lim told her she was asked to meet a [loan shark](/wiki/Loan_shark), with whom a Malaysian friend of Lim (the friend was none other than Chin Seow Noi) borrowed [S$](/wiki/Singapore_dollar)4,000 from, and she was harassed to help pay the debt. Another of these witnesses was Lim's friend Low Kum Swee, who appeared in court to testify that he first introduced Lim to Chin in late 1987 at a gambling den. Lau stated that ever since that day, Lim, who would sometimes come live at his flat, told him that she was apparently attracted to Chin and often talked about her. Lim even went as far as to make nuisance calls to Chin and would sometimes loiter around the HDB block where Chin resided. Low recalled that during the final week before her murder, Lim told him that Chin was harassed by two loan sharks for not paying back her loan of $4,000, and on the night of her murder, a few hours before Lim's death, Low received a phone call, in which the caller asked to meet up with Lim. Low recognised the caller as Chin's brother Chin Yaw Kim. After that phone call, Low last saw Lim departing his flat. #### Chin Seow Noi's confession The prosecution also based their case on the confessions of the Chin siblings and Ng. Firstly, according to Chin Seow Noi's confession, she stated that after meeting Lim, she was often asked by Lim to go on a date with her everyday. Chin, who was unaware of Lim's [sex](/wiki/Sex) back then, agreed to do so but she eventually told Lim that she was married. At that time, Chin had registered her marriage with Siew in 1985, although she had not gone through the traditional Chinese marriage ceremony. Lim thus often harassed Chin, asking to borrow money from her from time to time. Chin, who was working as a factory worker at that time, had to also borrow money from her colleagues in order to lend Lim money. On 8 October 1988, the date of Chin's formal wedding, Lim even asked Chin to meet up with her on the night itself and lived with her for seven days before Chin returned to her husband's flat. Lim went on to make nuisance calls to Chin and would sometimes loiter around the [void deck](/wiki/Void_deck) below Chin's flat. The continued harassment led to Chin unable to endure it anymore. She thus asked her brother Chin Yaw Kim to come to Singapore to meet up with her for a plan to stop Lim from coming to her again. Yaw Kim roped in his friend and sworn brother Ng Kim Heng, also known as \"Ah Heng\", to help his sister in the plan to stop Lim's harassment. They came up with a plan to let Ng pretend to be a loan shark, and Ng would, according to the plan, confront Seow Noi in front of Lim, demanding for Seow Noi to pay back S$4,000 to Ng. Their plan was also to make Lim agree to help Seow Noi discharge her debt, in order to secretly get back some of the money Seow Noi lent to Lim. The plan was executed, and as the trio hoped, Lim agreed to help Seow Noi pay off the debt. However, Lim continued to harass Seow Noi. This led to Seow Noi deciding to call Yaw Kim and Ng, asking them to help her \"get rid of\" Lim. #### Confessions of Chin Yaw Kim and Ng Kim Heng Ng Kim Heng and Chin Yaw Kim, the two men who killed Lim Lee Tin on the night of 27 January 1989, confessed that they were indeed together with Lim on the night of the murder. However, they gave contrasting accounts of who stabbed Lim and what happened before and after the stabbing. Chin Yaw Kim, in his confession, stated that on the night of the murder, he met up with Lim over his sister's debt, and they eventually came up with the agreement that Lim would pay S$3,000 and Chin would pay the remaining S$1,000 to the \"loan shark\" Ng. Together, the pair met up with Ng, who remained disguising as a loan shark, and they drove to Choa Chu Kang Christian cemetery. Chin claimed that after they parked their car near a drain in the cemetery, he saw Lim and Ng getting out of the car and they both got into a heated argument about the debt issue. Yaw Kim, who stated that their plan was merely to assault Lim and warn her not to get near his sister again, said in his confession that he was shocked to see Ng taking out a knife and stabbed Lim while the latter was standing nearby the drain. This led to the duo having to abandon Lim's corpse into the graveyard drain. Ng Kim Heng, in his individual confession, gave a different account of the murder on that fateful night. Ng said that despite having discussed about killing Lim, he was reluctant and apprehensive over the thought of killing a person. He stated that after Chin left the car for a smoke at the graveyard, he signalled to and told Lim that she was in danger and need to get to safety, but Lim, who was sitting on the front passenger seat, did not listen or leave. Ng also claimed he alighted the car and tried to dissuade Chin, but Chin was adamant about killing Lim to help his sister escape the harassment. Subsequently, after the men re-entered the car, Chin, whose right hand was paralysed in a past traffic accident, grabbed a knife with his left hand (his only good hand) and stabbed Lim multiple times until she died. Ng said that he prevented the corpse from falling over to avoid getting his car stained in blood and he was forced to help Chin dispose of the corpse in the nearby drain, and took away Lim's wallet and other belongings. ### Defence's case However, in the trial, despite having confessed to their respective roles in the murder of Lim Lee Tin, the Chin siblings and Ng denied that they made these confessions, instead they claimed there was no case to answer. Chin Seow Noi's lawyer Ronald Ng (unrelated to Ng Kim Heng) argued against the admission of the confession, stating that the prosecution proceeded with the charge of abetment of murder based on Seow Noi's confession as sole evidence against her but not other incriminating evidence. Ng also argued that Seow Noi's meaning of the three words \"get rid of\" did not actually mean that she wanted Lim to be killed during the discussion of the plot. He pointed out that there was no direct mentioning of Seow Noi procuring her brother Yaw Kim and Ng to help cause Lim's death. As for Yaw Kim's lawyer Choo Si Sen and Ng Kim Heng's lawyer Peter Cuthbert Low, they both made similar arguments against the admission of the men's confessions, stating that the two men's confessions were not amounting to their admission to committing the murder of Lim, but to clear themselves of the blame for the crime. They also stated there was no other evidence to directly prove the charges of murder against Yaw Kim and Ng, the latter who additionally claimed he was forced to make incriminating statements. The lawyers of the three accused went on to extend their submissions to the interpretation of certain laws and citations of past legal cases in comparison to the case, so as to discredit the validity of using their police statements to prove their charges against them. However, on 8 October 1992, the same date of Chin Seow Noi's fourth wedding anniversary, Judicial commissioner Amarjeet Singh ruled in favour of the prosecution and dismissed the defence lawyers' submissions, concluding that the prosecution had made out a [prima facie](/wiki/Prima_facie) case against the trio and established the essential elements of the offence charged. Singh stated that the use of the three words \"get rid of\" by Seow Noi could only reasonably mean to cause Lim's death, and there was evidence that on the night of Lim's murder, upon receiving news from Yaw Kim that they have killed Lim, Seow Noi calmly received the news, which meant she had known her plot would cause Lim's death. If her meaning of \"get rid of\" was misunderstood by Yaw Kim, Seow Noi would have shown any feelings of outrage or surprise in her reaction to the news of Lim's death. Subsequently, on the same day he admitted the confessions, Singh ordered the three defendants to go to the stand and put up their defence. However, Ng and the Chin siblings chose to remain silent and not give their testimony on the stand. The right to remain silent was a valid legal option under Singapore's law, but should an accused chose to remain silent, judges are allowed to draw an adverse inference from the decision to remain silent. ### Death penalty verdict The next day, on 9 October 1992, Judicial commissioner Amarjeet Singh prepared and made his final verdict. In his judgement, Singh ruled that based on the context of evidence, the first accused Chin Seow Noi's verbal meaning of the three words \"get rid of\" could only mean that she intended to cause the death of the deceased victim Lim Lee Tin, and she knew that the death of Lim was the probable consequence of her abetment in the two men's attempt on Lim's life, as well as Seow Noi's reaction to the death of Lim. Therefore, Singh found 32-year-old Chin Seow Noi guilty of soliciting and abetting the murder of Lim. Turning to the second accused Chin Yaw Kim, Singh judged from the forensic evidence that Lim was indeed being stabbed fatally whilst in a sitting position. Also, the autopsy report by Dr Wee Keng Poh stated that the severity of the wounds would have caused Lim to bleed out large amounts of blood, yet at the crime scene where Lim's corpse was found, there were minute drops and stains of blood in the nearby area. These above facts thus contrasted and refuted Yaw Kim's claim that Lim was stabbed by Ng outside the car while in a standing position. As such, Singh also found 30-year-old Chin Yaw Kim guilty of murder. Finally, in relation to the third and final accused Ng Kim Heng, Singh stated that he did not believe Ng's claims that he tried to warn the victim or dissuade the Chin siblings, and he viewed these statements as Ng's attempt to deflect blame from himself. Singh referred to Ng's first statement, in which Ng had confessed to holding on to Lim's body during the stabbing to prevent it from falling or slanting over; the autopsy report also concluded that Lim was held tightly in the sitting position while being stabbed to death. Singh also pointed out that after Lim was killed, Ng had actively helped Yaw Kim to dispose Lim's corpse into the drain and removed all her belongings to avoid the identification of Lim or any connection to Seow Noi. For Ng's role in the murder and his common intention with Yaw Kim to stab Lim, Singh also found 28-year-old Ng Kim Heng guilty of murder like the Chin siblings. After the conviction of the trio, Singh passed the [death penalty](/wiki/Capital_punishment_in_Singapore) - the one and only sentence allowed for murder - on all the three defendants. The Chin siblings and Ng were consequently incarcerated on [death row](/wiki/Death_row) at [Changi Prison](/wiki/Changi_Prison), Singapore's only prison where the state's death row prisoners were held. ## Fate of the convicts ### Appeal After the end of the trial, the three defendants submitted their appeals against the death penalty and their convictions, but in May 1993, the [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore) dismissed the trio's appeals and affirmed the trial judge Amarjeet Singh's decision in the case. They also agreed that the mastermind Chin Seow Noi's three words \"get rid of\" would only mean kill when she solicited Lim Lee Tin's murder. During the appeal, the appellate court turned to the question of whether a person can be convicted based on the confession of his co-accused. In the trial itself prior to the appeal, Singh earlier interpreted Section 30 of the Evidence Act and held that a co-accused's confession should not be used as evidence against a defendant in the same way as against the confessor himself/herself. With regards to this issue, the prosecutor [Bala Reddy](/wiki/Bala_Reddy) (who took over Seng Kwang Boon in the appeal) argued that Singh's earlier interpretation in the trial was not correct. After hearing Reddy's arguments, the three-judge panel noted that Singh convicted the trio based on the police statements and other evidence and not the co-accused's statements, and they agreed with Reddy that the confession of an accomplice can be evidence against a person and form a sole basis to conviction: > The natural interpretation of s30 is that it allows the conviction of an accused person to be sustained solely on the basis of a confession by his co-accused, provided, of course, that the evidence emanating from that confession satisfies the court beyond reasonable doubt of the accused’s guilt. [Amnesty International](/wiki/Amnesty_International), a foreign human rights group, appealed to the [government of Singapore](/wiki/Government_of_Singapore) in February 1994, asking for clemency on the three killers upon receiving news of the rejection of their appeals. ### Death row and executions During the time the trio were held on death row, Chin Seow Noi's husband Siew See Kow unfailingly visited his wife regularly in prison. Siew, who did not know of his wife's relationship with Lim until her arrest, stated in a 1995 Chinese newspaper interview that he was shocked about his wife's involvement in the crime and her relationship with Lim. Despite admitting his wife's responsibility for the crime, Siew maintained his love for Chin and he was often present in court to provide moral support for his wife, and he also paid for lawyers to represent her throughout the trial and appeal. Siew even wrote a personal letter to the [President of Singapore](/wiki/President_of_Singapore) for clemency (which may commute Chin's sentence to [life imprisonment](/wiki/Life_imprisonment_in_Singapore) if successful), but the plea was rejected. On the eve of his wife's execution date, Siew bought a sports attire for his wife to wear before her hanging, and Siew agreed to Chin's promise for the couple to marry again should they be reborn and reunite in their next lives. On the Friday morning of 31 March 1995, six years and two months after Lim Lee Tin was murdered, the three murderers—35-year-old Chin Seow Noi, 33-year-old Chin Yaw Kim, and 31-year-old Ng Kim Heng—were hanged at [Changi Prison](/wiki/Changi_Prison). ## Aftermath ### Popular media The case of Lim's murder was re-enacted by a crime documentary show titled *[True Files](/wiki/True_Files)*. The re-enactment episode, titled *Male Woman*, was first broadcast on television as the 12th episode of the show's second season on 12 November 2003. The series is currently viewable on [meWATCH](/wiki/MeWATCH) since 5 February 2016. ### Legal significance The appeal related to Lim Lee Tin's murder, titled *Chin Seow Noi and Others v Public Prosecutor* in law reports, became a notable [case report](/wiki/Case_report) that discussed on the validity of the use of an accomplice's confession as evidence against a person in court, and as a sole basis to convict a person. It also made an impact on several capital cases, notably the 2017 case of drug trafficker [Norasharee Gous](/wiki/Norasharee_Gous), who was convicted of drug trafficking and sentenced to death solely based on the confession of his accomplice Mohamad Yazid Md Yusof (sentenced to [life imprisonment](/wiki/Life_imprisonment_in_Singapore) and 15 [strokes of the cane](/wiki/Caning_in_Singapore)) but no other evidence connecting him to the drugs. Norasharee appealed against the death penalty and argued in his re-trial against the use of Yazid's testimony as sole evidence to convict him, and while they dismissed Norasharee's appeal, the [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore) referred to the appeal ruling of *Chin* and stated while they agreed to the legal position in *Chin*, they emphasised on the need for caution to use the co-accused's testimony to determine a person's guilt due to the accompanying risk of false incrimination by the co-accused, and the conviction of a person on such grounds should be done with satisfaction that the person is guilty after considering every factor and incentive of the case. 48-year-old Norasharee and his third accomplice [Kalwant Singh Jogindar Singh](/wiki/Kalwant_Singh_Jogindar_Singh) were eventually hanged on 7 July 2022. - [Capital punishment in Singapore](/wiki/Capital_punishment_in_Singapore) - [List of major crimes in Singapore](/wiki/List_of_major_crimes_in_Singapore) ### Notes ### Citations\n",
  "language": "en",
  "processed_at": "2026-01-12T11:34:56.924983",
  "title": "Murder of Lim Lee Tin",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Murder_of_Lim_Lee_Tin"
}