{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:35:02.508671"
  },
  "content": "Durian cultivar **Musang King** is a Malaysian [cultivar](/wiki/Cultivar) (cultivated variety) of [durian](/wiki/Durian) (*[Durio zibethinus](/wiki/Durio_zibethinus)*). Prized for its unusual combination of bitter and sweet flavours, Musang King is the most popular variety of durian in both [Malaysia](/wiki/Malaysia) and [Singapore](/wiki/Singapore), where it is known as **Mao Shan Wang** ([Chinese](/wiki/Simplified_Chinese_characters): 猫山王; [pinyin](/wiki/Pinyin): *Māo Shān Wáng*) and commands a price premium over other varieties. It is also increasingly popular in [China](/wiki/China), where it has been dubbed the \"[Hermès](/wiki/Herm%C3%A8s) of durian\". ## History Musang King was originally known as **Raja Kunyit**, meaning \"Turmeric King\", a reference to the fruit's [turmeric](/wiki/Turmeric)-colored deep yellow flesh. The first Raja Kunyit tree was planted by a farmer in 1970 at Pulau Raya, Tanah Merah, Kelantan before it was \"moved\" to Gua Musang. In the 1980s, a man named Tan Lai Fook from [Raub, Pahang](/wiki/Raub,_Pahang) stumbled upon a Raja Kunyit durian tree in [Gua Musang](/wiki/Gua_Musang_District), [Kelantan](/wiki/Kelantan), [Malaysia](/wiki/Malaysia). He brought a branch of the tree back to Raub for grafting, and this new breed attracted other cultivators. The cultivar was named after Gua Musang, its place of origin. Musang King has been assigned the cultivar ID D197. The Chinese name, literally \"Cat Mountain King\", may be either a phonetic rendering of *musang* or a reference to its Malay meaning, the cat-like [Asian palm civet](/wiki/Asian_palm_civet). In 2017, Musang King became the first variety of durian to have its [genome sequenced](/wiki/Whole_genome_sequencing). The sequencing showed [upregulation](/wiki/Upregulation) of pathways related to [sulfur](/wiki/Sulfur), [lipid oxidation](/wiki/Lipid_oxidation) and [ethylene](/wiki/Ethylene) when compared to both other fruits and other durian cultivars like Mon Thong, which correlates with the pungency and stronger perceived taste and smell of the cultivar. Musang King has [geographical indication](/wiki/Geographical_indication) status in Malaysia, preventing other countries from using the name. ## Characteristics Musang King needs 4-6 years to produce fruits. A young tree produces 30-50 fruits per annum in the first 2-3 harvests. A grown Musang King tree can produce up to 250 fruits per annum, and a second yearly harvest is possible, depending on the weather conditions. The weight per fruit can reach up to 4 kilograms. The fruit is known for its buttery, thick, bright yellow flesh and robust flavour, with a hint of bitterness. The husk is dusky green and has a distinctive star shape at the bottom. The thorns are pyramidal and not densely packed. ## Gallery\n",
  "language": "en",
  "processed_at": "2026-01-12T11:35:02.508372",
  "title": "Musang King",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Musang_King"
}