{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:35:06.957994"
  },
  "content": "Indonesian food processing company **Musim Mas** Group is an [Indonesian](/wiki/Indonesia) food processing company operating globally in the [palm oil](/wiki/Palm_oil) industry, with a presence in 13 countries spanning [Asia-Pacific](/wiki/Asia-Pacific), [Europe](/wiki/Europe), [North America, and South America](/wiki/Americas). The group owns a significant network of palm oil [refineries](/wiki/Refining) and is involved in [vegetable oil refining](/wiki/Biodiesel_production). Additionally, it manufactures consumer goods such as soap and [cooking oil](/wiki/Cooking_oil) brands in [Indonesia](/wiki/Indonesia). The company employes 37,000 people and utilizes a logistics network that includes chemical and [coastal tankers](/wiki/Coastal_trading_vessel), [barges](/wiki/Barge), [tugboats](/wiki/Tugboat), and bulk installations at major ports in [Indonesia](/wiki/Indonesia) and other strategic locations worldwide. Musim Mas is a privately owned company managed by the Karim brothers: [Bachtiar Karim](/wiki/Bachtiar_Karim), Bahari Karim, and Burhan Karim. In addition to its involvement in the palm oil industry, the company has interests in real estate and owns the 4-star Mikie Holiday Resorts in [Berastagi](/wiki/Berastagi), [North Sumatra](/wiki/North_Sumatra). ## History In 1932, Anwar Karim founded the Nam Cheong Soap Factory in [Medan](/wiki/Medan), [North Sumatra](/wiki/North_Sumatra), laying the foundation for what would later become Musim Mas. In 1970 the company commissioned its first [palm oil](/wiki/Palm_oil) [refinery](/wiki/Refining) in [Belawan](/wiki/Belawan), [Indonesia](/wiki/Indonesia). In 1972, PT Musim Mas was officially established in Tanjung Mulia, Medan. The company expanded its operations in 1988 by starting its plantation in [Rantau Prapat](/wiki/Rantau_Prapat), North Sumatra. Two years later, in 1990, Musim Mas set up its first kernel-crushing plant in Medan and in 1991, it established its first palm oil mill in Rantau Prapat. In 2002, Musim Mas set up its first subsidiary office, **Inter-Continental Oil and Fats** Pte. Ltd. (ICOF) in Malaysia. ICOF is a part of the Musim Mas Group and merchandises and distributes Musim Mas products. Based in [Singapore](/wiki/Singapore), ICOF builds \"sustainable palm oil solutions\" for their clients. In 2003, Musim Mas commenced operations for its [oleochemicals](/wiki/Oleochemistry) plant located in the Medan Industrial Area II (KIM II). The following year, Musim Mas was the first company in [Indonesia](/wiki/Indonesia) to achieve [Roundtable on Sustainable Palm Oil](/wiki/Roundtable_on_Sustainable_Palm_Oil) (RSPO) certification. The company's Executive Chairman has also served on RSPO's inaugural executive board. The company opened its first office in Europe in 2007 and in the United States of America in 2008. In 2009, PT Musim Mas achieved RSPO certification, becoming the first palm oil plantation in Indonesia to receive this recognition. Additionally, the company initiated operations in Nellore, India, and Dongguan, China. By 2012, the company obtained RSPO certification for all of its plantations in Indonesia. In 2013, Musim Mas opened its first office in Vietnam and became the first company to achieve the Indonesia Sustainable Palm Oil (ISPO) certification. Additionally, wholly owned [subsidiary](/wiki/Subsidiary) **MasChem BV** announced plans for an [ethoxylation](/wiki/Ethoxylation) facility at the [Dow](/wiki/Dow_Chemical_Company) [Benelux](/wiki/Benelux) site in [Terneuzen](/wiki/Terneuzen). This facilityspecializes in the production of [surfactants](/wiki/Surfactants), which are surface active agents derived from [alcohols](/wiki/Alcohols), [oils](/wiki/Oils), [esters](/wiki/Esters), [fatty acids](/wiki/Fatty_acids), and [amines](/wiki/Amines) and serve as essential raw materials in the manufacturing of [personal care](/wiki/Personal_care) products and [detergents](/wiki/Detergents). In 2014, the company inaugurated three biodiesel plants in Europe and its first refinery in Tanjung Langsat, Malaysia. Musim Mas joined the Fire Free Alliance (FFA) in 2016 and acquired a glycerin refinery in Groningen, The Netherlands. In 2017, the company established a joint venture with Genting Plantations to set up a refinery in Lahad Datu, Malaysia, and acquired a sulfation plant in Barbastro, Spain. By 2019, Musim Mas became the first company in Southeast Asia to attain POIG (Palm Oil Innovation Group) verification and the first mill to be certified with RSPO (Roundtable on Sustainable Palm Oil) P&C (Principles and Criteria) 2018. Additionally, the company launched the Novel IDEAS Center, a S$10 million R&D and Innovation facility located in the [Singapore Science Park](/wiki/Singapore_Science_Park), as part of its strategic expansion and innovation goals. ## Products Musim Mas offers a wide range of products including [biodiesel](/wiki/Biodiesel), bleaching earth, bypass fats/rumen bypass fats, [commodities](/wiki/Commodities), cooking oils, emulsifier-stabilizer blends, [emulsifiers](/wiki/Emulsifiers), [esters](/wiki/Ester), fatty acids, fatty alcohols, household products, margarine/shortening, medium-chain triglycerides, palm wax, refined [glycerine](/wiki/Glycerine), soap/skin care/hygiene products, soap noodles, specialty application oils, specialty fats, [surfactants](/wiki/Surfactant), and [vitamin E](/wiki/Vitamin_E). In 2021, Musim Mas was ranked 9th on FoodTalks' Global Top 30 Specialty Oil Companies list. The company offers more than 70 proprietary brands that are distributed globally. Their product portfolio includes cooking oils, margarines, and soaps. Among their well-known brands are Lervia, Medicare, and Harmony soaps, Sunco cooking oil, and Surya Gold, Margareta, and Rajni Gold. Additionally, the company has launched a new subsidiary called **Kevolve Dr MCT**, which specializes in selling premium [MCT oil](/wiki/Medium-chain_triglyceride) products. ## Sustainability In 2014, Musim Mas introduced a new sustainability policy, affirming its commitment to producing deforestation-free palm oil. The company takes measures to mitigate its greenhouse gas emissions by capturing and converting [methane](/wiki/Methane) gas into energy to power their mills and estates. According to the company, all of Musim Mas' mills are equipped with methane capture facilities, known as biogas plants. In 2021, Musim Mas announced a partnership with [AAK](/wiki/AAK_(company)) and [Nestlé](/wiki/Nestl%C3%A9) to address deforestation outside of plantation concession areas in [Aceh](/wiki/Aceh), Indonesia. The partnership aims to engage approximately 1,000 independent oil palm smallholders within two years, enrolling them in Muslim Mas' smallholders program supported by a Smallholders Hub. ## Awards Musim Mas received the \"Indonesian Best Exporter Award (Primaniyarta Award)\" in 1992.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:35:06.957665",
  "title": "Musim Mas",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Musim_Mas"
}