{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:27:35.001995"
  },
  "content": "General cargo ship sunk in a collision in the Strait of Singapore in 2015 **MV *Thorco Cloud*** was a [general cargo ship](/wiki/General_cargo_ship) owned by [Thorco Projects](/wiki/Thorco_Shipping) that sank in the [Singapore Strait](/wiki/Singapore_Strait) in December 2015 after a collision with the [chemical tanker](/wiki/Chemical_tanker) MV *[Stolt Commitment](/wiki/MV_Stolt_Commitment)*. The collision resulted in six casualties from a total crew of 12. The collision caused the ship to split into two parts, which sank approximately 1.85 kilometres (1.15 mi) apart at a depth of 70 metres (230 ft) in the [traffic separation scheme](/wiki/Traffic_separation_scheme) of the Singapore Strait, one of the world's busiest shipping lanes. The wreck was removed in 2019. ## Construction The ship was constructed by [Damen shipyards](/wiki/Damen_Group) in [Galați](/wiki/Gala%C8%9Bi), [Romania](/wiki/Romania) where it was started, and [Foxhol](/wiki/Foxhol), [The Netherlands](/wiki/The_Netherlands) where it was completed. The ship was launched in July 2004 as the MV *S. Partner* and was one of a series of identical sister ships. ## History The ship has undergone name and Flag State changes throughout its service life, including: - MV *S. Partner* flagged in the [Marshall Islands](/wiki/Marshall_Islands). - MV *UAL Gabon* flagged in the Marshall Islands. - MV *Molene* flagged in [Antigua and Barbuda](/wiki/Antigua_and_Barbuda). - MV *BBC Brazil* flagged in Antigua and Barbuda. - MV *Thorco Cloud* flagged in Antigua and Barbuda. ### Collision and sinking On 16 December 2015 the ship departed the port of Batu Ampar, [Indonesia](/wiki/Indonesia) with a crew of 12 bound for [Durban](/wiki/Durban), [South Africa](/wiki/South_Africa) and loaded with a cargo of railway rails. During *Thorco Cloud'*s transit into the Singapore Strait traffic separation scheme, chemical tanker MV *Stolt Commitment* collided with *Thorco Cloud*, breaking the ship into two parts and causing them both to sink within the strait. The bow section of the *Thorco Cloud* continued to float after the collision and drifted, while the aft section containing the bridge and engine room sank almost immediately. Six crew members were rescued from the incident, and six more crew members were declared missing, later found deceased. The Standard [P&I Club](/wiki/Protection_and_indemnity_insurance) instructed Guangzhou Salvage to recover the wreck of the *Thorco Cloud*, which was performed in 2019. This article about transport in [Singapore](/wiki/Singapore) is a stub. You can help Wikipedia by expanding it. This article about transport in [Indonesia](/wiki/Indonesia) is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:27:35.001614",
  "title": "MV Thorco Cloud",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/MV_Thorco_Cloud"
}