{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:35:11.371085"
  },
  "content": "* *My Queenstown Heritage Trail** is a walking trail in [Queenstown](/wiki/Queenstown,_Singapore), [Singapore](/wiki/Singapore). The trail was launched in 2010 by civic group, My Community, to promote the heritage, local culture and architectural styles in Queenstown . **Queenstown** was named after [Queen Elizabeth II](/wiki/Elizabeth_II) to mark her [coronation](/wiki/Coronation_of_Queen_Elizabeth_II) in 1952. Conceived by the [Singapore Improvement Trust](/wiki/Singapore_Improvement_Trust) in the 1950s and completed by its predecessor, [Housing and Development Board](/wiki/Housing_and_Development_Board) (HDB), in the 1960s, Queenstown is Singapore's first satellite town and serves as the testbed for Singapore's public housing programme. At present, the trail consists of 40 historical sites, including [Alexandra Hospital](/wiki/Alexandra_Hospital) (former British Military Hospital), [Ying Fo Fui Kun](/wiki/Ying_Fo_Fui_Kun) cemetery and ancestral hall, [Hang Jebat Mosque](/wiki/Masjid_Hang_Jebat), [Queensway Shopping Centre](/wiki/Queensway_Shopping_Centre), Princess House, Church of the Blessed Sacrament, Singapore's [first HDB flats](/wiki/45,_48_and_49_Stirling_Road), sports complex, polyclinic, branch library, neighbourhood police centre, and technical school. ## Guided Tours My Community offers three guided tours covering Tanglin Halt & Margaret Drive (Renamed as My Tanglin Halt Heritage Tour), Labrador & Alexandra (My Alexandra Heritage Tour) and Commonwealth & Holland Village (Renamed as My Holland Village Tour) Launched on 27 July 2014, Tanglin Halt & Margaret Drive guided tour traces the evolution of Queenstown as Singapore's first satellite town including many public and social institutions. The tour visits landmarks such as the first HDB flats along Stirling Road, Queenstown Sports Complex, Queenstown Branch Library, the former Malayan railways and black & white bungalows at Wessex estate. The tour was renamed as My Tanglin Halt heritage tour in June 2018. Alexandra & Dawson guided tour, launched on 4 April 2015, follows the footsteps of the Japanese troops in Queenstown during World War II and visits military installations such as Alexandra Hospital (former British Military Hospital) and bunkers along Kay Siang Road. The tour was renamed My Alexandra heritage tour in June 2018. A third guided tour covering Commonwealth & Holland was launched on 20 March 2016. The guided tour traces the transformation of Queenstown from a rubber plantation in the 1870s to a busting military village in the 1950s and a popular expatriate centre in 2000s. Some of the historical landmarks on the tour include [Holland Village](/wiki/Holland_Village,_Singapore), Shuang Long Shan Wu Shu Memorial Hall, Ridout and Holland Park conservation area and Chip Bee Gardens. The tour was renamed My Holland Village heritage tour in June 2018. ## List of sites - Alexandra Fire Station - Singapore's third fire station was built in 1954. - [Alexandra Hospital](/wiki/Alexandra_Hospital) - A former British Military Hospital constructed in 1938, where a massacre took place during [World War II](/wiki/World_War_II) that killed more than 200 hospital personnel and patients. - Black and White bungalows - Colonial bungalows constructed in the 1920s and 1930s for British military personnel - [Block 38 Commonwealth Avenue](/wiki/Commonwealth_Avenue_Wet_Market) - A conserved wet market designed by [Singapore Improvement Trust](/wiki/Singapore_Improvement_Trust) in the 1960s - Block 57, 61, 67-73 Commonwealth Drive - Three-storey residential blocks designed in the Modern style - Block 81 Commonwealth Close - Part of the Commonwealth estate which launched Singapore's [Home Ownership Scheme](/wiki/Home_Ownership_Scheme) in 1964. - Block 115A Commonwealth Drive - Singapore's first flatted factory was constructed in 1956. - Block 160 & 161 Mei Ling Street - Singapore's first point blocks built in 1970. - Block 168A Queensway - A curved shaped public housing building built in 1973. - Church of the Blessed Sacrament - A conserved Catholic parish shaped like an origami - Church of the Good Shepherd - Queenstown's first Anglican church - Commonwealth Crescent Neighbourhood Centre - A two-storey wet market and hawker centre surrounded by a quadrangle of two-storey shophouses. - Colonial Terraces - Two-storey colonial terraces along Jalan Hang Jebat constructed in the 1930s for British military personnel. - Faith Methodist Church - Queenstown's first Methodist church opened in 1967. - Former Archipelago Brewery Company - Singapore's second brewery opened in 1933. - Former Baharudin Vocational Institute - Singapore's first tertiary institution dedicated to manual and applied arts. - Former [Commonwealth Avenue Wet Market](/wiki/Commonwealth_Avenue_Wet_Market) - A conserved wet market designed by the [Singapore Improvement Trust](/wiki/Singapore_Improvement_Trust) in 1960. - Former [Forfar House](/wiki/Forfar_House) - Singapore's tallest public residential building opened in 1956. - Former Malayan Railways - A dismantled section in the West Coast Line of the Malayan Railway. - Former [Queenstown Driving Test Centre](/wiki/Queenstown_Driving_Test_Centre) - Singapore's second driving test centre opened in 1969. - Former Queenstown Polyclinic - Singapore's first polyclinic opened in 1960. - Former Thye Hong Biscuit Confectionery - One of Singapore's oldest confectionery opened in 1935 and closed in 1981. - Former Venus and Golden City Theatres - Former theatres converted to churches. - [Hang Jebat Mosque](/wiki/Masjid_Hang_Jebat) - A kampung mosque founded along Malayan railway tracks. - Jamek Queenstown Mosque - A Javanese-styled mosque opened in 1964. - Lee Kong Chian Gardens School - Singapore's first permanent school for the intellectually-disabled opened in 1969. - Mujahidin Mosque - A cylindrical mosque designed by the [Housing and Development Board](/wiki/Housing_and_Development_Board) - [Princess House](/wiki/Princess_House) - A conserved seven storey built in 1956 as the headquarters for [Singapore Improvement Trust](/wiki/Singapore_Improvement_Trust) and later [Housing and Development Board](/wiki/Housing_and_Development_Board) - Queenstown Baptist Church - A missionary church opened in 1955 - Queenstown Lutheran Church - An Art Deco styled church opened in 1966. - [Queenstown Public Library](/wiki/Queenstown_Public_Library) - Singapore's first branch library opened by former prime minister, [Lee Kuan Yew](/wiki/Lee_Kuan_Yew), in 1970. - [Queenstown Secondary School](/wiki/Queenstown_Secondary_School) - Singapore's first technical school opened in 1957 to spearhead the country's march into industrialisation. - Queenstown Sports Complex - Singapore's first sports complex opened in 1970 - [Queensway Shopping Centre](/wiki/Queensway_Shopping_Centre) - One of Singapore's oldest shopping centres constructed in the 1970s - Ridout Tea Garden - Singapore's first Japanese-themed gardens opened in 1970. - Shuang Long Shan Wu Shu Ancestral Temple (双龙山嘉应五属义祠) - Singapore's last Hakka cemetery and ancestral temple constructed in 1887. - Tanglin Halt Neighbourhood Centre - A hexagonal hawker centre surrounded by a quadrangle of two-storey shophouses. - Tanglin Halt Industrial Estate - Singapore's oldest industrial estate planned by the [Singapore Improvement Trust](/wiki/Singapore_Improvement_Trust) in the 1950s - [Tiong Ghee Temple](/wiki/Tiong_Ghee_Temple) (忠义庙) - Village temple in Queenstown, the village used to be known as Wu Wei Gang Village (无尾港村). - True Way Presbyterian Church - One of the nine churches in Queenstown ## Gallery My Queenstown Heritage Trail - My Queenstown Heritage Trail Official Website - My Queenstown Heritage Trail Registration website - Official My Queenstown Facebook page\n",
  "language": "en",
  "processed_at": "2026-01-12T11:35:11.370680",
  "title": "My Queenstown Heritage Trail",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/My_Queenstown_Heritage_Trail"
}