{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:35:08.924205"
  },
  "content": "Singapore-based Internet company**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **contains promotional content**. Please help improve it by removing promotional language and inappropriate external links, and by adding encyclopedic text written from a neutral point of view. *(April 2023)* *(Learn how and when to remove this message)*This article **may require copy editing for grammar, style, cohesion, tone, or spelling**. You can assist by editing it. *(April 2025)* *(Learn how and when to remove this message)*The topic of this article **may not meet Wikipedia's notability guidelines for companies and organizations**. Please help to demonstrate the notability of the topic by citing reliable secondary sources that are independent of the topic and provide significant coverage of it beyond a mere trivial mention. If notability cannot be shown, the article is likely to be merged, redirected, or deleted. *Find sources:* \"MyRepublic\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(February 2025)* *(Learn how and when to remove this message)*Some of this article's listed sources **may not be reliable**. Please help improve this article by looking for better, more reliable sources. Unreliable citations may be challenged and removed. *(November 2024)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* **MyRepublic Group Limited** is a Singaporean communications service provider. Launched in 2011, MyRepublic currently operates in [Singapore](/wiki/Singapore) and licenses its platform to operators in [Brunei](/wiki/Brunei) and [Indonesia](/wiki/Indonesia) through its [joint venture](/wiki/Joint_venture) with [Sinar Mas](/wiki/Sinar_Mas).[*citation needed*] MyRepublic Group Limited is a group of companies consisting of MyRepublic which offers broadband, phone, and cloud services and MyRepublic Digital offering digital platform services. ## History MyRepublic was founded by Malcolm Rodrigues, a former Vice President of [StarHub](/wiki/StarHub) International and Wholesale; KC Lai, a former StarHub Senior VP of Consumer Sales; and Greg Mittman, previously a lead of [Alcatel-Lucent](/wiki/Alcatel-Lucent)'s National Broadband Network Team, on 25 July 2011. MyRepublic became a licensed telecommunications carrier in Singapore in October 2011 and signed the Interconnection Agreement with the National Broadband Company in Singapore shortly after. A soft launch of MyRepublic took place in mid-December 2011. On 16 February 2012, MyRepublic officially launched its operations in Singapore. By the end of 2012, MyRepublic had 450 resellers, 10,000 subscribers, and more than S$5 million in revenue. Rodrigues attributed the company's growth to its \"thin operator model,\" which is unburdened by costly legacy infrastructure. In January 2014, MyRepublic expanded into [New Zealand](/wiki/New_Zealand). It also launched its 1 Gbit/s service in the same month in Singapore. Later in May, the company received an investment of S$4.4 million from Indonesian energy company Dian Swastatika Sentosa, part of Indonesian conglomerate [Sinar Mas](/wiki/Sinar_Mas). In July, It also received another S$30 million investment. Sunshine Network, a telecommunications arm of Sinar Mas, invested S$20 million, while [Xavier Niel](/wiki/Xavier_Niel), founder of French telecommunications company [Free](/wiki/Free_(ISP)), invested S$10 million. In 2015, MyRepublic expanded its operations to Indonesia in July to an initial nine locations and announced plans to expand and launch its services in Australia in August. In September, MyRepublic raised S$23 million in capital, including investment from Brunei's leading telecommunications provider, DST, a major investor. In October, MyRepublic held a Mobility Trial as part of [Infocomm Media Development Authority](/wiki/Infocomm_Media_Development_Authority)'s trial of HetNet, or [heterogeneous network](/wiki/Heterogeneous_network), in [Jurong Lake District](/wiki/Jurong_Lake_District). The trial was limited to 1,000 trial users and confined to specific areas such as malls, public housing blocks, bus interchanges, and MRT train stations. **2016** - In March, MyRepublic launched a self-service plug-and-play wide area network (WAN) service for businesses. - In November, MyRepublic officially launched its operations in Australia. **2017** - In July, MyRepublic officially connected the first town in Australia (Wollongong, NSW) to consumer-grade NBN 1 Gbit/s connections. - In September, MyRepublic was named one of the 2017 winners of the Red Hat Innovation Awards APAC for Singapore for its outstanding and innovative use of Red Hat solutions. **2018** - In February, MyRepublic was ranked #64 on the Financial Times' inaugural List of the Top 1000 fastest-growing companies in Asia-Pacific. - In March, Eugene Yeo, the CIO for MyRepublic, was nominated as a finalist for CIO of the Year by TM Forum, alongside the CIOs for British Telecom, T-Mobile USA, Bharti Airtel, and China Unicom. [*citation needed*] - Launched MyRepublic Connected Business, a streamlined networking solution designed to meet the end-to-end needs of Retail, F&B and Hospitality businesses in partnership with Cisco Meraki in May. - Announced its Mobile Virtual Network Operator (MVNO) partnership with StarHub in May to utilize StarHub's mobile network infrastructure to offer mobile services in Singapore. - In June, MyRepublic announced US$60m in new investment from CLSA Capital Partners, the asset management business of CLSA, Asia's leading capital markets and investment group, and Kamet Capital Partners, a Singapore family office. **2019** - In September, Brunei's largest mobile operator, DST, selected MyRepublic as its partner to manage Brunei's telecom infrastructure carveout and the DST transformation to a quad-play thin operator. **2020** - In February, MyRepublic Singapore commissioned its first Wi-Fi 6 (AX) managed Wi-Fi network for its enterprise customers. - In April, MyRepublic Singapore installed and commissioned a managed Wi-Fi network serving thousands of users in less than 14 days during the COVID-19 Circuit Breaker period. - In October, MyRepublic and M1 Limited (M1) signed an agreement for MyRepublic to deliver an enhanced suite of mobile services as a Mobile Virtual Network Operator (MVNO) using M1's mobile network infrastructure. **2021** - In March, the rebranding campaign of MyRepublic was launched, appearing across MRT stations and digital channels. - Later, in May, it launched a self-serve SIM card activation service for new mobile customers. - At the same time, MyRepublic refreshed its SMB and enterprise service offerings, which included Microsoft 365, Teams, and a cybersecurity suite designed in partnership with IT solutions provider Inspira Enterprise. - In September, StarHub acquired the majority interest in MyRepublic's broadband business, bringing its total investment to $162.8 million. MyRepublic's other business units, mobile, Australia, and New Zealand, and its Platform business, later known as MyRepublic Digital, remained fully owned by MyRepublic Group. In September 2022, MyRepublic Group launched MyRepublic Digital, a platform-as-a-service spin-off company, and its flagship product, Encore, a cloud-native digital platform. In December, it sold its customer contracts In Australia to [Superloop](/wiki/Superloop_(company)) and no longer operates in Australia. In July 2023, MyRepublic pulled out of New Zealand and sold its broadband customer contracts to [2degrees](/wiki/2degrees). In November, MyRepublic New Zealand rebranded to Rocket Mobile and started offering mobile plans in New Zealand. ## MyRepublic Singapore ### Consumer broadband MyRepublic offers fibre broadband and voice services to residential customers in Singapore over the country's Next-Generation Nationwide Broadband Network (Next Gen NBN). In 2012, the company launched in Singapore with fibre broadband Internet plans offering speeds of up to 150 Mbit/s and the country's first no-contract term Internet plans. In February 2012, MyRepublic rolled out its GAMER fibre broadband packages, becoming Singapore's first Internet service provider to offer fibre broadband plans specifically catered towards gamers. MyRepublic is most well known for its GAMER fibre broadband package, which features lower latency for popular games. In May 2015, MyRepublic launched the first-ever 1 Gbit/s no-contract fibre broadband plan in Singapore. The plan targets users who want greater flexibility and are unwilling to commit to a 12—or 24-month contract. According to the internet analysis firm's Q4 Speedtest, in September 2021, MyRepublic became the country's fastest provider, recording a Speed Score of 258.01. In February 2024, MyRepublic unveiled its 10Gbit/s home broadband trial offerings for households looking for speedier in-home connectivity. ### Enterprise Connectivity The company also offers fibre broadband, voice, and managed Wi-Fi services to business customers nationwide. In 2016, it launched MySDN, its first enterprise connectivity service, available to customers across the region, including Singapore, Indonesia, and New Zealand. In 2022, MyRepublic announced the launch of Ignite, a brand-new suite of enterprise ICT (Information and Communications Technology) specialized for Small and Medium Enterprises (SMEs) in Singapore. ### MyRepublic Digital MyRepublic Digital is a spin-off company of MyRepublic that aims to simplify and increase the productivity of digital transformation for telcos and aspiring digital brands worldwide. The company's product is Encore, a cloud-native digital [platform-as-a-service](/wiki/Platform_as_a_service) with [OSS/BSS](/wiki/OSS/BSS) features. MyRepublic Digital is helmed by Jason Ong, previously APAC (Asia Pacific) region head of Tech Mahindra. ### Bid to be Singapore's fourth telco In 2014, MyRepublic announced its interest in being Singapore's 4th telco, after Singtel, StarHub, and M1, promising to introduce unlimited mobile data plans as a telco. In April 2015, MyRepublic announced plans to hold a mobility trial in Jurong Lake District in the second half of 2015 as part of the Government's trial of HetNet, or heterogeneous network. HetNet is a new wireless system that leveraged NBN as part of a mobile network, allowing mobile phone users to hop across networks to minimize surfing slowdowns or disruptions automatically. As part of the trial, MyRepublic gave out 1,000 free SIM cards with unlimited 4G data to trial participants in the coverage area. In September 2015, the company submitted its bid for the New Entrant Spectrum Auction (NESA) and two other companies - Australian telco TPG Telecom and Singapore start-up airYotta. Of the three, only MyRepublic and TPG were pre-qualified to participate in the NESA. MyRepublic participated in the NESA in December 2016 but ultimately exited the auction at S$102.5 million and ceded the license to TPG, citing concerns that bidding higher would not make sense for its business case. In May 2017, reports emerged that MyRepublic was looking for private equity backing to bid for Singaporean telecommunications company M1. This would allow it to get back into the Singapore Telco market despite losing the fourth telco license. In a press conference later that year, MyRepublic confirmed the report but added that it was no longer interested in buying M1 and would seek to offer mobile services as a virtual network operator (MVNO) instead.[*citation needed*] ### Mobile services offering In May 2018, MyRepublic announced that it had formed a Mobile Virtual Network Operator (MVNO) agreement with local telco StarHub, enabling it to offer services using StarHub's mobile infrastructure. In June 2018, MyRepublic rolled out three new mobile price plans, starting from S$35/month. For a \"boundless\" data offering, the plans allowed customers to continue to consume data at reduced speeds once they hit the data limit of their plans without additional charges. In October 2020, MyRepublic and M1 Limited (M1) signed an agreement for MyRepublic to deliver an enhanced suite of mobile services as a Mobile Virtual Network Operator (MVNO) using M1's mobile network infrastructure. In January 2023, MyRepublic announced its foray into 5G and introduced its 5G plan offerings using StarHub's 5G Standalone/4G/3G infrastructure. MyRepublic's 4G plan offerings will continue using M1's 4G/3G infrastructure. ### Gigatown competition In 2017, MyRepublic launched the \"Gigatown\" Competition to connect Australia's first town to consumer-grade 1 Gbit/s gigabit service. MyRepublic wanted to demonstrate the benefits of ultra-fast next-generation fiber and the benefits it could deliver to consumers and small businesses. MyRepublic ran the Gigatown petition and gathered over 6,000 responses from individuals who expressed their feelings towards how they felt about their current internet speeds. MyRepublic began offering their 1 Gbit/s speed tier packages to Wollongong at A$129/month with unlimited data as part of their Gigatown Competition. At the end of 2017, MyRepublic expanded and launched NBN Small Business products to market. MyRepublic announced to its customers on 24 January 2023 that it would be exiting the Australian fixed broadband market and transferring customers to [Superloop](/wiki/Superloop_(company)). ## MyRepublic Indonesia In mid-2014, [Sinar Mas](/wiki/Sinar_Mas), through its subsidiary Sunshine Network Pte. Ltd., invested approximately SGD 19.63 million in MyRepublic Limited, a telecommunications company based in Singapore. As a result of this capital injection, [Sinar Mas](/wiki/Sinar_Mas) acquired a 21.5% ownership stake in MyRepublic Singapore. This strategic investment was followed by the launch of MyRepublic's operations in Indonesia in April 2015. The initial service coverage included key urban areas such as [Jabodetabek (Jakarta metropolitan area)](/wiki/Jakarta_metropolitan_area), [Semarang](/wiki/Semarang), [Palembang](/wiki/Palembang), [Surabaya](/wiki/Surabaya), and [Malang](/wiki/Malang). The company operates under PT Eka Mas Republik, a subsidiary of PT Dian Swastatika Sentosa Tbk, which is part of the Sinar Mas. Utilizing Fiber to the Home (FTTH) technology, MyRepublic Indonesia delivers high-speed, unlimited broadband services without Fair Usage Policy (FUP) restrictions. Its customer segments include residential users, small to medium-sized enterprises (SMEs), as well as online gaming and streaming communities across various cities in Indonesia. Since its inception, MyRepublic Indonesia has demonstrated substantial growth and undertaken aggressive network expansion. As of 2025, the company serves more than 1 million active subscribers and has deployed over 6 million new homepasses. Its services now span over 56 cities and 88 regencies, reinforcing its role in advancing digital inclusion and expanding access to high-quality internet infrastructure across the country. ### History ### 2015 - 2018 - MyRepublic Indonesia officially entered the Indonesian market in 2015, introducing an innovative business model aimed at addressing common pain points experienced by internet users in the country, such as data caps and speed throttling. By offering fiber-optic broadband services with no Fair Usage Policy (FUP), the company quickly gained attention from consumers seeking stable and consistent internet connectivity. - During its initial phase of operations, MyRepublic Indonesia launched services in several major cities, including [Bogor](/wiki/Bogor), [Depok](/wiki/Depok), [Tangerang](/wiki/Tangerang), [Bekasi](/wiki/Bekasi), [Palembang](/wiki/Palembang), [Semarang](/wiki/Semarang), Surabaya, and Malang. This early expansion laid the foundation for a broader rollout in the following years. - In 2016, the company expanded to [Medan](/wiki/Medan), marking its entry into [North Sumatra](/wiki/North_Sumatra) and extending its footprint beyond Java. The network reached a significant milestone in 2017, with the company reporting over 500,000 homepasses deployed. ### 2019 - 2021 - Amid the rapid growth of Indonesia's gaming and digital entertainment industry, MyRepublic Indonesia emerged as a preferred internet service provider (ISP) for professional gamers and content creators. The company actively partnered with [esports](/wiki/Esports) tournaments, gaming communities, and streaming platforms, reinforcing its reputation as a high-performance broadband provider. - In 2019, MyRepublic Indonesia expanded its services to the city of [Bandung](/wiki/Bandung), strengthening its presence in [West Java](/wiki/West_Java). By 2021, the company had surpassed 800,000 homepasses and formally launched services in [Bali](/wiki/Bali), marking its expansion into eastern [Indonesia](/wiki/Indonesia). ### 2022 - 2023 - In 2022, MyRepublic Indonesia expanded its service coverage to several major cities outside the island of [Java](/wiki/Java), including [Makassar](/wiki/Makassar), [Pekanbaru](/wiki/Pekanbaru), [Serang](/wiki/Serang), [Cilegon](/wiki/Cilegon), [Lampung](/wiki/Lampung), [Solo](/wiki/Surakarta), [Karawang](/wiki/Karawang), and [Jambi](/wiki/Jambi). - In celebration of its 8th anniversary, the company continued its expansion throughout 2023, extending services to [Cirebon](/wiki/Cirebon), [Sukabumi](/wiki/Sukabumi), [Garut](/wiki/Garut), [Boyolali](/wiki/Boyolali_Regency), [Mojokerto](/wiki/Mojokerto), [Jember](/wiki/Jember_Regency), [Purwokerto](/wiki/Purwokerto), [Cilacap](/wiki/Cilacap_Regency), and [Tegal](/wiki/Tegal). This was followed by further rollout in July 2023 to [Purwakarta](/wiki/Purwakarta), [Kendal](/wiki/Kendal), [Salatiga](/wiki/Salatiga), [Brebes](/wiki/Brebes_Regency), [Klaten](/wiki/Klaten_Regency), [Kediri](/wiki/Kediri_(city)), and [Mataram](/wiki/Mataram_(city)). - In November 2023, MyRepublic Indonesia entered additional markets in both Java and beyond, including [Tasikmalaya](/wiki/Tasikmalaya), [Sumedang](/wiki/Sumedang), [Magelang](/wiki/Magelang), [Sleman](/wiki/Sleman), [Yogyakarta](/wiki/Yogyakarta), [Madiun](/wiki/Madiun), [Jombang](/wiki/Jombang_Regency), [Gresik](/wiki/Gresik_Regency), [Banyuwangi](/wiki/Banyuwangi_(town)), as well as [Banjarmasin](/wiki/Banjarmasin) and [Balikpapan](/wiki/Balikpapan), significantly enhancing its national footprint. ### 2024 - 2025 - Entering 2024, MyRepublic Indonesia continued its growth trajectory by strengthening its fiber-optic network infrastructure, integrating AI-driven customer service solutions, and introducing new service packages tailored to the evolving digital needs of Indonesian consumers. - In celebration of its 9th anniversary, the company expanded its coverage to additional regions including [Batam](/wiki/Batam), [Blitar](/wiki/Blitar), [Ciamis](/wiki/Ciamis), [Nganjuk](/wiki/Nganjuk_Regency), [Ngawi](/wiki/Ngawi_(town)), [Pasuruan](/wiki/Pasuruan), [Ponorogo](/wiki/Ponorogo_Regency), [Subang](/wiki/Subang_Regency), and [Tulungagung](/wiki/Tulungagung_Regency), thereby reinforcing its presence in [East Java](/wiki/East_Java), [West Java](/wiki/West_Java), and the [Riau Islands](/wiki/Riau_Islands). - In September 2024, MyRepublic Indonesia launched services in a wider set of locations such as [Aceh](/wiki/Aceh), [Padang](/wiki/Padang), [Bengkulu](/wiki/Bengkulu), [Jepara](/wiki/Jepara), [Kudus](/wiki/Kudus_Regency), [Pekalongan](/wiki/Pekalongan), [Samarinda](/wiki/Samarinda), [Demak](/wiki/Demak_Regency), Pati, [Purbalingga](/wiki/Purbalingga), and [Cianjur](/wiki/Cianjur), further extending its footprint across [Sumatra](/wiki/Sumatra), [Central Java](/wiki/Central_Java), and [East Kalimantan](/wiki/East_Kalimantan). - By the end of 2024, the company had expanded into additional strategic areas including [Kuningan](/wiki/Kuningan), [Majalengka](/wiki/Majalengka), [Indramayu](/wiki/Indramayu), [Kebumen](/wiki/Kebumen_Regency), [Purworejo](/wiki/Purworejo_Regency), [Temanggung](/wiki/Temanggung_Regency), [Pemalang](/wiki/Pemalang_Regency), [Bojonegoro](/wiki/Bojonegoro_Regency), [Lamongan](/wiki/Lamongan_Regency), [Tuban](/wiki/Tuban), [Palangkaraya](/wiki/Palangka_Raya), and [Manado](/wiki/Manado), strengthening its national reach across [Kalimantan](/wiki/Kalimantan) and [North Sulawesi](/wiki/North_Sulawesi). - In early 2025, MyRepublic Indonesia announced a key milestone—surpassing 1 million active subscribers—a significant achievement that marked a decade of growth and innovation in the Indonesian telecommunications sector. The announcement was made during the [Mobile World Congress](/wiki/Mobile_World_Congress) 2025 in [Barcelona](/wiki/Barcelona), attended by the company's board of directors and international strategic partners. - This continued regional expansion forms a critical part of MyRepublic Indonesia's long-term vision to accelerate digital transformation and connectivity across the archipelago. ## Awards and recognition This section **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources in this section. Unsourced material may be challenged and removed. *(November 2025)* *(Learn how and when to remove this message)* YearAwards & RecognitionProvider2021Indonesia Popular Brand DigitalInfo BrandTop Innovation Choice AwardInfo BrandIndonesia Brand ChampionInfo BrandService Quality Diamond AwardMajalah MarketingExcellence Service Experience AwardMajalah MarketingDigital Touch Point Customer Engagement AwardMajalah MarketingIndonesia Wow BrandMarkplus IncIndonesia Millennial's Brand Choice AwardsWarta EkonomiIndonesia Best Corporate in Pandemic EraWarta Ekonomi2022Indonesia Digital Popular Brand AwardInfo BrandTop Digital Company Award 2022Majalah MarketingExcellence Service Experience AwardMajalah MarketingDigital User Experience AwardMajalah MarketingIndonesia Most Acclaimed Company AwardWarta EkonomiOMNI BrandMarkplus IncIndonesia Digital Popular Brand AwardInfo Brand2023Indonesia Brand Champion 2023Info BrandIndonesia Top Digital PR Award 2023Info BrandTop Digital Company Award 2023MarketingAsian Telecom Award - Infrastructure Initiatives of The Year IndonesiaAsian TelecomAsian Telecom Award - Cloud Initiatives of The Year IndonesiaAsian TelecomIndonesia Digital Popular Brand AwardInfo BrandBest Managed Companies Deloitte 2023DeloitteMarketeers Editors Choice Award (Internet Product for Gamer of The Year)MarketeersIDX Channel Anugerah Inovasi Indonesia 2023 (MyRepublic Infrastructure Innovation)IDX ChannelSubmission Marketing ExcellenceMarketing ExcellenceMarketing Excellence Awards Indonesia 2023 (Finalist Excellence in Anniversary Marketing for MyRepublic Infin8 Anniversary)Marketing Excellence2024Indonesia Brand Champion 2024Info BrandIndonesia Digital Popular Brand Award PLATINUM 2024Info BrandStevie Award SubmissionStevie AwardAsian Telecom Award 2024 - Infrastructure Initiatives of The Year - IndonesiaAsian TelecomAsian Telecom Award 2024 - Data Management of The Year - IndonesiaAsian TelecomOokla Fastest Fixed Network - IndonesiaOoklaExcellent Service Experience AwardMarketingMarketeers Omni Brand of The Year 2024MarketeersSILVER STEVIE® WINNER: Innovative Achievement in GrowthStevie AwardSILVER STEVIE® WINNER: Award for Innovation in Technology Management, Planning & ImplementationStevie AwardBRONZE STEVIE® WINNER: Innovative Achievement in Sales or Revenue GenerationStevie AwardIndonesia Digital Popular Brand Award 2024Info BrandService Quality Award 2024MarketingIndonesia Most Acclaimed Companies (IMACO) Awards 2024Warta Ekonomi7 Most Popular Brand of the Year 2024Jawa PosACES 2025 - Asia's Best Performing CompaniesACES AwardsACES 2025 - Asia's Most Inspiring ExecutivesACES Awards2025Infrastructure Initiatives of The Year - IndonesiaAsian TelecomBroadband of The Year - IndonesiaAsian Telecom\n",
  "language": "en",
  "processed_at": "2026-01-12T11:35:08.923868",
  "title": "MyRepublic",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/MyRepublic"
}