{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:35:14.963609"
  },
  "content": "Singaporean educator (1935–2019) **Myrna Braga-Blake** (1935 – 30 May 2019) was a pioneering social worker and educator in Singapore. She was a founding member of the [Association of Women for Action and Research](/wiki/Association_of_Women_for_Action_and_Research) (AWARE) and a prominent member of the Singapore Association of Social Workers. ## Early life and education Braga-Blake was born in Singapore in 1935. She and her family moved to [Sri Lanka](/wiki/Sri_Lanka) and [India](/wiki/India) during [World War II](/wiki/World_War_II), where she received her education. She and her family returned to Singapore in 1946. She then studied at [Convent of the Holy Infant Jesus](/wiki/CHIJMES). Following her parents' divorce, she was sent to a convent in [Australia](/wiki/Australia), and later attended a boarding school in [Ireland](/wiki/Ireland). She attended the [Bath College of Domestic Science](/wiki/Bath_College_of_Domestic_Science) and received her teaching diploma in 1956. After returning to Singapore, she attempted to register as a student at the then newly established School of Social Work. However, her application was rejected as the school was only taking in those at the age of 23 and above, while she was aged 21. The school then made an exception for her, admitting her the following year after she had spent the year exposing herself to social conditions in Singapore by teaching Domestic Science at the [Singapore Chinese Girls' School](/wiki/Singapore_Chinese_Girls%27_School) and regularly visiting a creche and a [youth club](/wiki/Youth_club) in People's Park. She received her Medical Social Worker diploma in 1960. ## Career She worked at the [KK Women's and Children's Hospital](/wiki/KK_Women%27s_and_Children%27s_Hospital), the [Singapore General Hospital](/wiki/Singapore_General_Hospital), and [Tan Tock Seng Hospital](/wiki/Tan_Tock_Seng_Hospital). In 1962, she became an assistant lecturer at the [National University of Singapore](/wiki/National_University_of_Singapore). After marrying and giving birth to a daughter, she and her family moved to [Penang](/wiki/Penang). While there, she studied sociology at the [Universiti Sains Malaysia](/wiki/Universiti_Sains_Malaysia), where she obtained her Honours, Masters, and PhD degrees. She also helped to found the Young Workers Community Education Project there. After returning to Singapore in 1981, she served as the president of the Singapore Association of Social Workers from 1982 to 1984, and edited the association's Code of Professional Ethics. In 1986, she became a founding member of the [Association of Women for Action and Research](/wiki/Association_of_Women_for_Action_and_Research), and helped set up the organisation's helpline. In 1991, she served on the management committee of the newly established organisation PAVE. She edited the book *Singapore Eurasians: Memories and Hopes*, which was published in 1992. She and Ang Bee Lian received the Outstanding Social Worker award in 1999. She was posthumously inducted into the [Singapore Women's Hall of Fame](/wiki/Singapore_Women%27s_Hall_of_Fame) in 2021. ## Personal life and death She married in 1963 and gave birth to a daughter the following year. She was diagnosed with [Alzheimer's disease](/wiki/Alzheimer%27s_disease) in 2005. She died on 30 May 2019. Her father is [A. J. Braga](/wiki/A._J._Braga), the first [Minister for Health](/wiki/Minister_for_Health_(Singapore)) of Singapore.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:35:14.963268",
  "title": "Myrna Braga-Blake",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Myrna_Braga-Blake"
}