{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:35:32.452744"
  },
  "content": "* *Nallammah \"Nalla\" Ruth Tan** (*née* **Navarednam** 12 May 1923 – 27 March 2012) was a [Singaporean](/wiki/Singaporeans) physician, [women's rights](/wiki/Women%27s_rights) advocate and writer. She is known for her early advocacy of [sex education](/wiki/Sex_education) and public [health education](/wiki/Health_education) in Singapore. She was also known for her poetry and short story writing. ## Biography Tan was born **Nallammah Navarendam** on 12 May 1923 in [Ipoh](/wiki/Ipoh). Tan's parents were teachers and she was the fourth out of six children. Tan attended the [Methodist Girls' School](/wiki/Methodist_Girls%27_School,_Ipoh) in Ipoh. She graduated from the [University of Malaya](/wiki/University_of_Malaya) in 1952 with a bachelor's degree in Medicine. Tan told *[The Straits Times](/wiki/The_Straits_Times)* in 1984, that at first she'd wanted to be a lawyer, but chose medicine because there was no law faculty at the time at the school. After school, she became a government health officer and later an administrative officer for the [Ministry of Health](/wiki/Ministry_of_Health_(Singapore)). In the 1960s, she advocated introducing sex and health education in schools. Tan would later head the [Singapore Medical Association](/wiki/Singapore_Medical_Association) committee to organize the first public health program in Singapore. Between 1967 and 1971, she was the principal of Eusoff College, which was part of the [University of Singapore](/wiki/National_University_of_Singapore). Tan was also a faculty member of the university. During the 1970s, she began writing newspaper columns and gave speeches against gender discrimination. She brought up the idea of creating a \"Women's Affairs\" department in the government. In 1975, Tan, along with [Chan Choy Siong](/wiki/Chan_Choy_Siong) and Lim Kim Choo, were recognized with Outstanding Women Awards for their work for [women's rights](/wiki/Women%27s_rights) in Singapore. Tan earned her doctorate of medicine in 1975. The next year, she was promoted to associate professor at the university. Tan became a member of the faculty of Community Medicine of the [Royal College of Physicians](/wiki/Royal_College_of_Physicians) in 1978 and five years later, became a fellow. When she retired from the university, she ran a private clinic from her home for several years. Tan served on the [World Methodist Council](/wiki/World_Methodist_Council) (WMC) Presidium between 1976 and 1981 and the WMC Family Life Committee between 1976 and 1991. She was the first Singaporean to be elected to the Presidium. She was awarded the Honorable Order of Jerusalem for her work on the council and within the [Methodist](/wiki/Methodism) community. Tan began to exhibit symptoms of [Alzheimer's disease](/wiki/Alzheimer%27s_disease) in the early 2000s. Tan died in the [Tan Tock Seng Hospital](/wiki/Tan_Tock_Seng_Hospital) on 27 March 2012, after suffering a chest infection that developed into pneumonia. In 2015, Tan was inducted into the [Singapore Women's Hall of Fame](/wiki/Singapore_Women%27s_Hall_of_Fame). ## Writing Tan wrote poetry as a young adult, but did not start writing seriously until she was on [maternity leave](/wiki/Parental_leave) in 1961. Tan's husband, Tan Joo Liang, encouraged her to explore her personal style of writing during her leave. She wrote her first story, \"Robert and the Beetroots\" at that time. In 1974, her short story, \"The Goddess of Mercy\" was aired on [BBC](/wiki/BBC). An anthology of women's fiction, called *The Sun in Her Eyes: Stories by Singapore Women* (1976), brought recognition to her writing. It was also the first time that Singaporean women's short stories had been collected into an anthology. She was also featured in *Singapore Short Stories Volume II* (1978). The collection of her short stories, *Hearts and Crosses* (1989), incorporate her own personal experiences and take place in Singapore. Many of her short stories are also characterized by a sense of [irony](/wiki/Irony) and having a [twist ending](/wiki/Plot_twist). Tan's poetry has been called \"essentially feminine\" by *[The Straits Times](/wiki/The_Straits_Times),* even though Tan herself never felt as though she was a \"woman writer\" and was influenced primarily by male writers as a young adult. The *Times* also describes how her satirical poetry has a sense of \"dry humor.\" Her non-fiction work included focus on family and social issues, as well as providing educational information about [puberty](/wiki/Puberty) and [sexual health](/wiki/Reproductive_health). Her health education books, *You Need to Know* (1976) and *Beyond Your Navel* (1977) are written in a \"inimitable, chatty style\" according to *The Straits Times*. *Beyond Your Navel* discusses both sexual and emotional health, breaking down ideas into clear and simple sections for better understanding. She also discusses drug addiction in the book. Tan wrote a weekly column in the *Sunday Times* called 'You' where she discussed issues many readers faced, politics and developing the community. ## Selected bibliography - *The Collected Poems of Nalla Tan*. Singapore: Times Books International. 1998. [ISBN](/wiki/ISBN_(identifier)) 9789812048431. - *Hearts and Crosses*. Singapore: Heinemann Asia. 1989. [ISBN](/wiki/ISBN_(identifier)) 9789971641979. - *Nalla on Sunday*. Singapore: Times Books International. 1985. [ISBN](/wiki/ISBN_(identifier)) 9789971652333. - *Beyond Your Navel*. Singapore: Federal Publications. 1977. [OCLC](/wiki/OCLC_(identifier)) 36124482. - *You Need to Know*. Singapore: Federal Publications. 1976. [OCLC](/wiki/OCLC_(identifier)) 64013693. - Nalla Tan in the [National Archives of Singapore](/wiki/National_Archives_of_Singapore)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:35:32.452466",
  "title": "Nalla Tan",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Nalla_Tan"
}