{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:35:33.266517"
  },
  "content": "Various names and nicknames of various languages for Singapore The **names of Singapore** include the various historical appellations as well as contemporary names and nicknames in different languages used to describe the island, city or country of [Singapore](/wiki/Singapore). A number of different names have been given to the settlement or the island of Singapore all through history, the earliest record may have been from *[Geography](/wiki/Geography_(Ptolemy))* by [Ptolemy](/wiki/Ptolemy) in 2nd century AD. Possible mentions of [Pulau Ujong](/wiki/Pulau_Ujong), the name for the island of Singapore, may be found in Chinese works, and it was also referred to as [Temasek](/wiki/Temasek) in Malay and Javanese literature. Sometime in the 14th century the name was changed to Singapura, which is now rendered as [Singapore](/wiki/Singapore) in English. Singapura means \"Lion City\" in Sanskrit, and [Sang Nila Utama](/wiki/Sang_Nila_Utama) is usually credited with naming the city, although its actual origin is uncertain. ## Etymology of Singapore The English name Singapore comes from the [Malay](/wiki/Malay_language) name *Singapura* which is believed to have been derived from [Sanskrit](/wiki/Sanskrit_Language) meaning \"Lion City\". *Singa* comes from the Sanskrit word *siṃha* (सिंह), which means \"lion\", and *pūra* (पुर) means \"city\" in Sanskrit and is a common suffix in many [Indian](/wiki/India) place names. The Sanskrit *[-pura](/wiki/Pur_(Vedic))* suffix is the linguistic ancestor of the Malay and Indonesian *-pura* (e.g., *Jayapura*), the Thai *-burī* (e.g., *Kanchanaburi*), the Khmer *-borei* (e.g., *Angkor Borei*) suffixes. It is also [cognates](/wiki/Cognate) with the *[-polis](/wiki/Polis)* suffix (e.g., *Acropolis*) of [Ancient Greek](/wiki/Ancient_Greek) via a common [Proto-Indo-European](/wiki/Proto-Indo-European) linguistic ancestor. Sanskrit was used as it was considered for a long period the prestigious international language of the region. [Sang Nila Utama](/wiki/Sang_Nila_Utama), said to be the founder of Singapura in the late 13th century who gave the city its name, also acquired a Sanskrit name Sri Tri Buana. The name Singapura and its related forms were fairly common in early South East Asia, with a few cities given the same name – the earliest one known is *[Simhapura](/wiki/Tr%C3%A0_Ki%E1%BB%87u)* in what is now Vietnam established by the [Cham people](/wiki/Cham_people) in the fifth century, others were found in Thailand (now [Singburi](/wiki/Singburi)) and Java. The name also appears in Buddhist [jataka tales](/wiki/Jataka_tales) and in the *[Ramayana](/wiki/Ramayana)*. According to the *[Malay Annals](/wiki/Malay_Annals)*, Singapura was named after a strange beast seen by Sang Nila Utama while hunting in [Temasek](/wiki/Temasek), and he was informed that the beast must have been a lion. He decided to stay in Temasek and named the city he founded Singapura or \"Lion City\". However, scholars have pointed out that lions are not native to Singapore or South East Asia, and the \"lion\" therefore would have been an error in identification. The *[Malay Annals](/wiki/Malay_Annals)* describes the beast seen by Sang Nila Utama as a powerful, fast-moving and fine-looking animal with a \"red body, black head, and white breast\", and size \"slightly bigger than a goat.\" Some have suggested that the beast in question may have been a tiger or some other big cat, but others argued that tigers are native to the region, which made it unlikely that Sang Nila Utama or his followers would not recognise a tiger to mistake it for a lion. It has also been suggested that the description of the beast in the *Malay Annals* fits a mythical beast called *janggi* told in [Minangkabau](/wiki/Minangkabau_people) legends as a guardian of gold mines. Many scholars, however, believe that the person Sang Nila Utama and the story of the founding of Singapura to be fictional, and a number of alternative suggestions for the origin of the name of Singapore have been given. For example, it has been proposed that the name was adopted by [Parameswara](/wiki/Parameswara_(king)) to show that he was reestablishing in Singapore the lion throne that he had originally set up in [Palembang](/wiki/Palembang). In this version of events, the lion throne was set up as a challenge to the Javanese [Majapahit Empire](/wiki/Majapahit_Empire), and the Javanese then drove Parameswara out of Palembang as a consequence of this defiance. Parameswara fled to Temasek, whereupon he assassinated the local ruler and usurped the throne. The change of name from Temasek to Singapura may therefore serve to strengthen his claim over the island. Others linked the name to the Javanese kingdom [Singhasari](/wiki/Singhasari) as well as a Majapahit Buddhist sect whose adherents were referred to as lions. Early Portuguese sources from the 16th century do not indicate that the name meant \"lion city\", in fact they suggest that it meant *falsa demora*, perhaps meaning a \"wrong, tricky or challenging interruption [of the voyage] or place to stay\", and that it may have been named after a strait. Some modern scholars have proposed alternative readings of the name Singapura; for example, it has been suggested that the *singa* in the name may simply be the Malay word *singgah* meaning \"stop over\" indicating it was a stopover place. Yet another, based on names found in old maps, proposed that the name Singapura may have came from the strait as *[bar]-čin-gapura*, where \"čin\" is China and \"gopara\" is a \"gate\" in Sanskrit, and the *bar* in the name may be from either Arabic or Persian meaning \"a large body of water\" that may also be used to refer to a coastal kingdom. *[Bar]-čin-gapura* therefore may mean \"gateway to the port of China\". Although it is believed that the name Singapura replaced Temasek some time in the 14th century, the origin of the name cannot be determined with certainty. ## Historical names ### Early records The first possible written records of Singapore possibly date to the 2nd century, when the island was identified as a trading post in the maps of the Greek astronomer, [Ptolemy](/wiki/Ptolemy). The map located a place called *Sabara* or *Sabana* at the southern tip of the [Malay Peninsula](/wiki/Malay_Peninsula) (named the [Golden Khersonese](/wiki/Golden_Chersonese)) where Singapore lies. However, identification of *Sabana* or *Sabara* varies according to different authors. It remains debated if a 3rd-century Chinese account of a locality named *Pu Luo Zhong* refers to the main island of Singapore, [Pulau Ujong](/wiki/Pulau_Ujong). Ninth century Arab sailors recorded a place called the island of Ma'it, which could be Singapore. Arab sources also refer to a place called *Betumah* that some argued to be *[Bukit Timah](/wiki/Bukit_Timah)* (meaning \"tin hill\") of Singapore, or that it was sited at or near Singapore. It was recorded that in 1320, the [Mongol](/wiki/Mongol_Empire) [Yuan Dynasty](/wiki/Yuan_Dynasty) sent a mission to obtain elephants from a place called *[Long Ya Men](/wiki/Long_Ya_Men)* ([Chinese](/wiki/Traditional_Chinese_characters): 龍牙門; [pinyin](/wiki/Pinyin): *Lóngyámén*; lit. 'Dragon's Teeth Gate'), known locally as *Batu Berlayar* in Malay, which is believed to be [Keppel Harbour](/wiki/Keppel_Harbour). #### Temasek Singapore is referred to in old Javanese and Malay literature as [Temasek](/wiki/Temasek). The *[Nagarakretagama](/wiki/Nagarakretagama)*, a [Javanese](/wiki/Java) eulogy written in 1365, names a settlement on the island as *Tumasik*. The name appears twice in the *Malay Annals* before it is replaced by \"Singapura\" following Sang Nila Utama's arrival upon the island. Temasek may have been derived from *Tasik*, the Malay word for \"lake\" or \"sea\", perhaps meaning \"Sea Town\". In a version of [Marco Polo](/wiki/Marco_Polo)'s account of his travel, a place named *Chiamassie* that could be Temasik was mentioned in relation to the island kingdom of *Malayur*. Temasik may have also been mentioned in Vietnamese records as *Sách Mã Tích* (𱏺馬錫) in the 14th century. The [Yuan dynasty](/wiki/Yuan_dynasty) Chinese sojourner [Wang Dayuan](/wiki/Wang_Dayuan), visiting the island around 1330, mentioned *Danmaxi* ([Chinese](/wiki/Chinese_language): 單馬錫; [pinyin](/wiki/Pinyin): *Dānmǎxí*, written as 淡馬錫 in the [Mao Kun map](/wiki/Mao_Kun_map)), which is a transcription of the Malay name *Temasek*. Wang described two settlements in *Danmaxi*: *[Long Ya Men](/wiki/Long_Ya_Men)* and *[Ban Zu](/wiki/Ban_Zu)* (班卒, [Malay](/wiki/Malay_language): *pancur*). Chinese records continued to use the name Temasik as seen in the [Mao Kun map](/wiki/Mao_Kun_map), even though according to the *Malay Annals'* its name had changed to Singapura in the 14th century by Sang Nila Utama. Although the name was mentioned in Malay literature, the name Temasek had become obsolete and did not appear in European maps and documents from 1500 to 1800. In more modern times, this early name for Singapore has been revived for modern institutions and for national honours in Singapore. ### Early European names Early European visitors to the region gave Singapore a number of different names. Portuguese and Spanish sources may use the name *Viontana* for *Ujong Tanah*, a name that may also be used to refer to Johor or the lower part of the Malay Peninsula. Dutch maps of the 1600s and 1700s named the island as '*t Lange Eyland* or *'t Lang Eiland* (\"The Long Island\"), or the Malay equivalent *Pulau Panjang*, as well as *Iatana* for *Ujong Tanah*. A Flemish merchant named the island as *Ysla de la Sabandaria Vieja*, or \"Island of the Old Shahbandar's House\" (the [Shahbandar](/wiki/Shahbandar) or Portmaster's house was marked on some early maps near the mouth of [Singapore River](/wiki/Singapore_River)). Xabandaria along with other place names of Singapore such as [Tana Mera](/wiki/Tanah_Merah,_Singapore) and Blakang Mati ([Sentosa](/wiki/Sentosa)) appear in a map by a Malay-Portuguese cartographer [Godinho de Erédia](/wiki/Godinho_de_Er%C3%A9dia) drawn in 1604 and published in 1613. The name Singapura and its many variants were used from the 1500s onwards in Europeans sources. Early 16th century European maps such as [Cantino planisphere](/wiki/Cantino_planisphere), showing the knowledge of Malay Peninsula before the actual arrival of the Portuguese in the region, give names such as *bargimgaparaa* or *ba(r)xingapara* and *ba(r)cingapura*, where the Persian or Arabic *bar* is added before the name. The use of the term Singapore however was inexact, and can refer to a number of geographical areas or entities. Up to the late 1700s, the name Singapura was more often used in relation to a strait rather than the island itself. The Portuguese general [Afonso de Albuquerque](/wiki/Afonso_de_Albuquerque) who conquered [Malacca](/wiki/Malacca_Sultanate) in fact claimed that Singapura was named after the strait. The [Strait of Singapore](/wiki/Strait_of_Singapore) in the early period may refer to the southern portion of the [Strait of Malacca](/wiki/Strait_of_Malacca) or other stretches of water, and maps of the 16th century may use *Cingaporla*, *Cincapula*, *Cingatola*, *Cinghapola* and many other variations to refer to island as well as the various straits or the southern portion of the Malay peninsula. The 18th century German encyclopedia *[Grosses vollständiges Universal-Lexicon](/wiki/Grosses_vollst%C3%A4ndiges_Universal-Lexicon)* provided five separate entries for Singapore: *Sincapur* (tip of the Malay Peninsula) and its Latin equivalent *Sincapurum Promontorium*, *Sincapura* (a city), *Sincapor* and *Singapour* (both straits). After the 1780s, the name *Sinkapoor* began to be commonly used on Dutch maps. In English sources, *Sincapore*, *Sincapure*, *Singahpura* and other variants of Singapore were used in the 17th to 19th century, and although a few variants such as *Singapoor* and *Singapure* continued to appear for some time, Singapore would become the standard form in English. ### Local Chinese names A number of names for Singapore were used by local [Hokkien](/wiki/Hokkien)-speaking ethnic Chinese in early modern Singapore. In addition to the now standard *Sin-ka-pho* ([Chinese](/wiki/Traditional_Chinese_characters): 新加坡; [pinyin](/wiki/Pinyin): *Xīnjiāpō*), other former names include *Seng-ka-pho* (星嘉坡 or 星加坡) and the derived shorter forms *Seng-chiu* (星洲; \"Singapore Island\") and *Seng-kok* (星國 \"Singapore State\"). Another name, *Sit-la̍t* (石叻) derived from the Malay word *selat* meaning \"strait\" (from *Sit-la̍t-mn̂g* [石叻門] another name for [Longyamen](/wiki/Longyamen))[*citation needed*] and the derivatives or variants *Sit-la̍t-po·* (石叻埠), *Si̍t-la̍t-po·* (實叻埠), and *La̍t-po·* (叻埠) were also used. ### World War II The Japanese renamed Singapore *Shōnantō* (昭南島), from Japanese *\"[Shōwa](/wiki/Sh%C5%8Dwa_period) no jidai ni eta minami no shima\"* (\"昭和の時代に得た南の島\"), or \"southern island obtained in the age of Shōwa\", and [occupied it](/wiki/Japanese_Occupation_of_Singapore) until the British repossessed the island on 12 September 1945, a month after [the Japanese surrender](/wiki/Surrender_of_Japan). The name *Shōnantō* was, at the time, [romanised](/wiki/Romanization_of_Japanese) as *Syonan-to* or *Syonan*, where the characters 昭南 literally translate to \"Light of the South\". ## Contemporary names ### Languages of Singapore #### English In [English](/wiki/English_Language), the country's name is \"Singapore\" and its official name is \"Republic of Singapore\". #### Chinese In written [Chinese characters](/wiki/Chinese_character), the country's official name, \"Republic of Singapore\" is rendered as 新加坡共和国 in [simplified Chinese](/wiki/Simplified_Chinese). The full name of Singapore in different [varieties of Chinese](/wiki/Varieties_of_Chinese) is: - [Mandarin](/wiki/Mandarin_Chinese): *Xīnjiāpō Gònghéguó* - [Hokkien](/wiki/Hokkien): *Sin-ka-pho Kiōng-hô-kok* - [Cantonese](/wiki/Standard_Cantonese): *Sān'gabō Guhng'wòhgwok* - [Hakka](/wiki/Hakka_Chinese): *Sîn-kâ-phô Khiung-fò-koet* - [Hokchiu](/wiki/Fuzhou_dialect): *Sĭng-gă-pŏ̤ Gê̤ṳng-huò-guók* A nickname for the city is *Shīchéng* ([Mandarin](/wiki/Standard_Chinese))/*Sai-siâⁿ* ([Hokkien](/wiki/Hokkien)) (獅城), literally \"Lion City.\" Modern historical names are retained as poetic or shorthand names for the island or country and include *Xīngzhōu*/*Seng-chiu* (星洲) and *Xīngguó*/*Seng-kok* (星國). *Xīng*, literally \"star,\" is used as a transcription for the first syllable of \"Singapore.\" *Zhōu* is a term for \"island\" in this case while *guó* means \"country\" or \"state.\" *Xīngzhōu* is used in names such as the *[Sin Chew Jit Poh](/wiki/Sin_Chew_Jit_Poh_(Singapore))* (星洲日報), a newspaper that was published in Singapore until the 1980s, and *[Nanyang Sin-Chew Lianhe Zaobao](/wiki/Lianhe_Zaobao)* (南洋·星洲联合早报, *Lianhe Zaobao* for short), Singapore's largest Chinese-language newspaper. #### Malay The official name of the country in [Malay](/wiki/Malay_language) is *Republik Singapura* and the Malay name is used for the country's [motto](/wiki/Motto) and its [national anthem](/wiki/National_anthem) of the same name, *\"[Majulah Singapura](/wiki/Majulah_Singapura)\"*. #### Tamil In [Tamil](/wiki/Tamil_language), the country's name is *Ciṅkappūr* (சிங்கப்பூர்) and its official name is *Ciṅkappūr Kuṭiyaracu* (சிங்கப்பூர் குடியரசு, /siŋɡəppuːr kuɽijərəsɯ/). The word *Ciṅkai* (சிங்கை) is a poetic and abbreviated form of the city name that can act as a Tamil place-of-origin or place-of-residence-prefix to [one's personal name](/wiki/Indian_name#Tamil) as in [Singai Mukilan](/wiki/Singai_Mukilan). It is also used in *[Singai Nesan](/wiki/Singai_Nesan)*, a weekly newspaper published in Singapore from 1887 to 1890. ### Other languages Nearly every language currently uses a name for Singapore derived from \"Singapore\" or \"Singapura\". #### Japanese [Japan](/wiki/Japanese_language) uses the [Katakana](/wiki/Katakana) script for Singapore, *Shingapōru* (シンガポール). There are variations of Singapore in [Kanji](/wiki/Kanji) script that are occasionally used, one of which is 新嘉坡. The one-character abbreviation for Singapore is 星, due to its historical name. Japan usually uses the Kanji script for other countries with official names in Chinese characters, i.e. China, Taiwan, South Korea. This is not the case for Singapore despite having an official name in Chinese characters. #### Khmer In the [Khmer language](/wiki/Khmer_language), the country's name is *Sernghakborey* (សិង្ហបុរី) from the word សិង្ហ meaning \"lion\" and បុរី meaning \"city\". The official name of the country is ស឵ធ឵រណៈរដ្ឋសិង្ហបុរី, literally \"Republic of Singapore\". The French word \"Singapour\" is commonly spoken. #### Vietnamese [Vietnamese](/wiki/Vietnamese_language) either uses the word *Singapore, Xin-ga-po, or Xinh-ga-po* for the country (and *Cộng hòa Singapore* or *Cộng hòa Xin-ga-po* for \"Republic of Singapore\") but has used versions taken from the *[chữ Hán](/wiki/Ch%E1%BB%AF_H%C3%A1n)* 新加坡, namely *Tân Gia Ba*. Vietnamese has also used other Sino-Vietnamese names other for historical names including *Chiêu Nam* for *Shōnan* (昭南) and *Hạ Châu* (賀州). There is also the transcription, 撑歌哺 Xinh Ca Bô, which was especially used in the newspaper Thanh Nghệ Tĩnh tân văn 清乂静新聞. #### Korean Likewise, Korea formerly used a [Hanja](/wiki/Hanja)-derived name for Singapore, *Singapa* (신가파; 新嘉坡), but now uses *Singgaporeu* (싱가포르). - [Little red dot](/wiki/Little_red_dot): A nickname for the country - Geographic name in Hokkien\n",
  "language": "en",
  "processed_at": "2026-01-12T11:35:33.266228",
  "title": "Names of Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Names_of_Singapore"
}