{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:35:45.212120"
  },
  "content": "Former university in Singapore‹ The template *Infobox university* is being considered for merging. › **Nanyang University** ([Chinese](/wiki/Chinese_language): 南洋大學) was a private university in [Singapore](/wiki/Singapore) between 1956 and 1980. During its existence it was Singapore's only private university in the Chinese language. In 1980, Nanyang University was merged with the University of Singapore to form the [National University of Singapore](/wiki/National_University_of_Singapore) (NUS). It was not until 2005 that another private school in Singapore, [SIM University](/wiki/SIM_University), was established. ## History ### Establishment The idea of a Chinese university in Singapore to provide higher education to the Chinese community was first mooted by [Tan Lark Sye](/wiki/Tan_Lark_Sye) in 1953, then chairman of the [Singapore Hokkien Association](/wiki/Singapore_Hokkien_Association). A fund was set up for this purpose, drawing donations from people of all walks of life including from Malayan philanthropist Cheong Yoke Choy and with Tan himself donating $5 million. The Singapore Hokkien Association donated 500 acres (2 km2) in the western [Jurong](/wiki/Jurong) area, which was then largely undeveloped rural land. Nanyang University conducted a flag-raising on 15 March 1956 and started classes on the 30th of that month, offering courses in the arts, sciences and commerce. The first phase of the university building programme was completed two years later, and the university held its official opening ceremony 30 March 1958, with the [Governor of Singapore](/wiki/Governor_of_Singapore) [William Goode](/wiki/William_Allmond_Codrington_Goode) as guest of honour. ### External Reviews In January 1959, the Government of Singapore and the university commissioned the first major review of the university. Led by Professor S. L. Prescott, the commission reported unfavourably on the administration of the university, library and laboratory facilities, academic staff and terms of employment, research culture, and curriculum. The commission refused to recommend that the government recognise Nantah degrees. In July 1959, Dr Gwee Ah Leng (魏雅聆) chaired a commission to follow up on the Prescott report. The Gwee commission submitted its report in November 1959, which was published by the Legislative Assembly in February 1960. The Gwee commission recommended that recruitment of students be broadened to other language streams, the learning of the national language, Malay, and wider use of English in instruction. In January 1965, Professor [Wang Gungwu](/wiki/Wang_Gungwu) of the University of Malaya was appointed to chair a committee to review the curriculum of Nanyang University. The Committee reported in May 1965. Meanwhile, in August 1965, Singapore separated from the Federation of Malaysia as an independent republic. In September 1965, the committee was released, and the university accepted the recommendations, triggering students protests, petitions, and boycotts of classes and examinations. ### Merger with the University of Singapore During the 1970s Nanyang University encountered problems in student enrolments, for many students were attending English-language schools. [Lee Kuan Yew](/wiki/Lee_Kuan_Yew), the [Prime Minister of Singapore](/wiki/Prime_Minister_of_Singapore), prompted the university to adopt the English language within five years. Subsequently, in the same year in March, a joint campus scheme was introduced to allow students from Nanyang University to jointly study with students from the University of Singapore. In 1979, Lee invited British academic [Frederick Dainton](/wiki/Frederick_Dainton) to present his views on the future of university education in Singapore. He suggested merging Nanyang University and the University of Singapore into the latter's campus at [Kent Ridge](/wiki/Kent_Ridge). His proposal gained the support of the government, and in April 1980, the merger was confirmed. Nanyang University's 21st and last convocation was held on 16 August 1980. That same month, the National University of Singapore Act took effect, legally merging the University of Singapore and Nanyang University to form the [National University of Singapore](/wiki/National_University_of_Singapore) (NUS). ## Logo The three circles in the logo represent values long held to be important in Chinese tradition. They represent a trinity of values: people, progress and productivity. The linking shows the interdependence between the need for people to work together productively and achieve progress. This symbol can now be seen in the crest of the National University of Singapore. The circle with the yellow star represents people, signifying the importance placed on human capital in Singapore.[*citation needed*] ## Relationship with Nanyang Technological University After Nanyang University was merged with the University of Singapore, the grounds formerly occupied by Nanyang University were occupied by a similarly named technical institute, the [Nanyang Technological Institute](/wiki/Nanyang_Technological_Institute) (NTI), in 1981. In 1991, the NTI was upgraded to the status of a university as Singapore's second English-medium university and became [Nanyang Technological University](/wiki/Nanyang_Technological_University) (NTU). ### Chinese Heritage Centre In 1995, the former Nanyang University Library and Administration Building was reopened as the [Chinese Heritage Centre](/wiki/Chinese_Heritage_Centre), an autonomous research institute of Nanyang Technological University. It was the first and only university institute in the world that specialises in the study of the ethnic Chinese communities from different parts of the world. It currently served as a research centre, a library and a museum.[*citation needed*] ### Proposed renaming of Nanyang Technological University as Nanyang University The NTU administration announced in 2003 a decision to rename Nanyang Technological University as Nanyang University by 2005, justifying the move based on the university's introduction of non-technology-related schools and its expansion into a full multidisciplinary university. In 2004, the administration announced that the renaming would be held off, citing a need to establish itself in other fields of study first. ## List of former Nanyang University Chancellors This section **does not cite any sources**. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed. *(January 2019)* *(Learn how and when to remove this message)*NameTerm startTerm endNotes[Lin Yutang](/wiki/Lin_Yutang)19541955Began term on 2 October 1954, resigned on 3 April 1955Zhang Tianze (張天澤)19561959Chairman of the management board. Nanyang University set up its management board as the highest administrative body on 5 March 1956, with Dr. Zhang as its chairman presiding over school affairs and taking over the duties of the president.[Chuang Chu Lin](/wiki/Chuang_Chu_Lin)19601964Vice-ChancellorLiu Konggui (劉孔貴)19641965Interim chairman of the management board. Zhuang resigned on 1 July 1964, and the university set up an interim management board on 8 July with Prof Liu as chairman, presiding over school affairs.Huang Yingrong (黃應榮)19651969Vice-Chancellor and Chancellor[Rayson Huang](/wiki/Rayson_Huang)19691972ChancellorHsueh Shou Sheng (薛壽生)19721975Chancellor[Lee Chiaw Meng](/wiki/Lee_Chiaw_Meng)19751976Vice-Chancellor[Wu Teh Yao](/wiki/Wu_Teh_Yao)19761977Acting ChancellorLu Yao (卢曜)19681977Vice-Chancellor (Administrative). From 15 August 1977, the position of Chancellor was vacant and a special committee was set up to manage the university. Chen Zhuqiang 陈祝强 served as Director-General of the University assisted by Andrew W.K. Yip as Director (Special Duties). The Directors acting as University Secretary, carried out the decisions of the committee. On 7 July 1980, Nanyang University was closed and merged into the new National University of Singapore. ## Publications - *Journal of Nanyang University, Volumes 5-6*. Contributor 南洋大學. 新加坡南洋大學. 1971. Retrieved 24 April 2014.`{{cite book}}`: CS1 maint: others (link) - Association of Nanyang University Graduates (Chinese) - Nandazhan Toronto, unofficial website of Nanyang University alumni in Toronto (Chinese) - Bibliography on the History of Nanyang University\n",
  "language": "en",
  "processed_at": "2026-01-12T11:35:45.211701",
  "title": "Nanyang University",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Nanyang_University"
}