{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:35:41.475563"
  },
  "content": "Art movement in 20th-century Singapore The **Nanyang style** of painting, also known as **Nanyang art** or the **Nanyang school**, was a [modern art](/wiki/Modern_art) movement and [painting](/wiki/Painting) tradition initially practised by [migrant Chinese](/wiki/Overseas_Chinese) painters in [Singapore](/wiki/Singapore) from the late-1940s to 1960s. As immigrant artists taken by the novelty of tropical landscapes, the Nanyang artists' works characteristically depicted [Southeast Asian](/wiki/Southeast_Asia) subject matter such as tropical fruit, [*kampung*](/wiki/Kampung_(village)) scenes, and *[batik](/wiki/Batik)* fabric while drawing upon a synthesis of Western [watercolor](/wiki/Watercolor_painting) and [oil painting](/wiki/Oil_painting) techniques with [Chinese ink](/wiki/Ink_wash_painting) traditions. The name of the movement draws from \"[Nanyang](/wiki/Nanyang_(region))\" ([Chinese](/wiki/Chinese_language): 南洋; [pinyin](/wiki/Pinyin): *nán yáng*; lit. 'Southern Ocean'), a [sinocentric](/wiki/Sinocentrism) Chinese term used to refer to [Southeast Asia](/wiki/Southeast_Asia) from the geographical perspective of [China](/wiki/China). Nanyang art is seen as a significant period in Singapore's art history, as it demonstrates some of the early conscious attempts by artists based in Singapore to generate a local art discourse. Art historian [Redza Piyadasa](/wiki/Redza_Piyadasa) would identify [Lim Hak Tai](/wiki/Lim_Hak_Tai) as a pioneer of this first generation of Nanyang artists. The most famous of the Nanyang artists further include [Liu Kang](/wiki/Liu_Kang_(artist)), [Chen Chong Swee](/wiki/Chen_Chong_Swee), [Chen Wen Hsi](/wiki/Chen_Wen_Hsi), [Cheong Soo Pieng](/wiki/Cheong_Soo_Pieng) and [Georgette Chen](/wiki/Georgette_Chen), the first four of whom had received training in traditional Chinese watercolour painting in China. Liu Kang and Chen Chong Swee arrived in Singapore during the 1930s before [World War II](/wiki/World_War_II), while Chen Wen Hsi and Cheong Soo Pieng would arrive in the post-war period. Georgette Chen would arrive in Singapore in 1953, having previously been based in locations such as [Paris](/wiki/Paris), [New York](/wiki/New_York_City), [Hong Kong](/wiki/Hong_Kong), [Shanghai](/wiki/Shanghai), and [Penang](/wiki/Penang), holding exhibitions abroad and gaining international recognition before arriving in Singapore. ## History [T.K. Sabapathy](/wiki/T.K._Sabapathy) and [Redza Piyadasa](/wiki/Redza_Piyadasa) are the first scholars who attempted to classify the artistic approaches of the Nanyang artists within an art historical framework, doing so in 1979 when they organised a survey exhibition of Nanyang art at the Muzium Seni Negara Malaysia. In the accompanying exhibition catalogue, Sabapathy examined the Nanyang artists' use of [School of Paris](/wiki/School_of_Paris) styles and [Chinese ink](/wiki/Ink_wash_painting) traditions in their practices and pictorial schemas, noting that their approaches \"can be identified with the principal directions of [modern art](/wiki/Modern_art).\" This suggests that the creation of a Nanyang style is based on the strategic selection of varied approaches and techniques, chosen to suit each artist's sense of expression in terms of connotations and aesthetics. Piyadasa would suggest that Nanyang artists were affiliated to the oldest formal tertiary art institution in Singapore, [Nanyang Academy of Fine Arts](/wiki/Nanyang_Academy_of_Fine_Arts), whether as an educator or as a student. Works from Singapore in the 1930s demonstrated early attempts of artists to capture local life and aesthetics in the region, incorporating tropical light and its motifs. During this time, Chinese-speaking writers and artists began using the term \"[Nanyang](/wiki/Nanyang_(region))\" to refer to the region of Southeast Asia where they had settled in, encouraging each other to explore localised forms of expression in literary and artistic practices. The Nanyang artists' interest in Southeast Asia may be seen as part of a broader historical phenomenon of Malayanisation, occurring as Chinese immigrants renounced ties with China to settle across Malaya and in Singapore. The search for national identity as Singapore and Malaya moved towards independence, with hopes of forming a unified Malayan identity that would supersede distinct ethnic cultures embodies the key concerns of the period. The Nanyang artists were distinctive based on their commitment towards alternative solutions based on new modes of visual perception from the West. Their aim was not to preserve Chinese arts and culture as previous art associations had attempted to do, neither was it merely to include Western modernist art traditions in their oeuvre. These ideas for creating a multicultural Malaya out of a largely immigrant society would fundamentally shape arts discourse for Singapore. Synthesising Chinese and Western approaches in Nanyang art was also a trait that arose from early art education reforms in [China](/wiki/China). During China's great reform at the beginning of the 20th century, the Chinese government sought to modernise [art education](/wiki/Visual_arts_education) by establishing modern art academies in the pedagogical style of Western art academies, modelled upon European and Japanese art schools. The programmes for these curriculums mixed Western and Chinese art subjects such as [classical calligraphy](/wiki/Chinese_calligraphy) and [ink painting](/wiki/Ink_wash_painting) for Chinese subjects, and [realism](/wiki/Realism_(arts)) techniques and [*plein air*](/wiki/En_plein_air) painting for Western. The image of the modern Chinese artist thus came to be prescribed as one equally at ease with both the concepts and practices of both Western and Chinese art. Nanyang art may be considered an open-ended category, established on the ambiguous idea of \"localness\" in their approach to subject matter that would expand over time, starting with the [Straits Settlements](/wiki/Straits_Settlements) and eventually growing in scope to encompass the entire [Southeast Asia](/wiki/Southeast_Asia) region, such as the works produced during a 1952 painting trip to [Bali](/wiki/Bali). This concept of the \"local\" is complicated when one considers that many of the Nanyang artists often viewed Southeast Asia from the perspective of a tourist with an inherent exoticisation of their subject matter, made more critical considering Nanyang art's depiction of Southeast Asia as a tropical paradise while the wider phenomenon of its decolonisation played out across the mid-20th century. Today, the works of Nanyang artists remain an interesting and unique phenomenon in the art history of both Malaysia and Singapore, with their wide range of works and consistent artistic innovation sparking off stimulating discussions on a formalistic level as well as from an art historical perspective within concepts of nationhood and nation-building. Their works situate Nanyang artists within frameworks that go beyond national boundaries to include those tied to the larger history of diaspora, migration, colonialism and modernism. ### Trip to Bali (1952) The Nanyang artists are particularly known for embarking on a 1952 painting trip to [Bali](/wiki/Bali), with the representation of Balinese and Southeast Asian material culture in their work for the resulting 1953 exhibition *Pictures from Bali*. For the painting trip, [Liu Kang](/wiki/Liu_Kang_(artist)), [Cheong Soo Pieng](/wiki/Cheong_Soo_Pieng), [Chen Wen Hsi](/wiki/Chen_Wen_Hsi), and [Chen Chong Swee](/wiki/Chen_Chong_Swee) would visit artist Adrien-Jean Le Mayeur de Merprès at his home in Bali. Le Mayeur was part of a community of European artists that had been attracted to the region and based themselves in Bali, their practices perpetuating images of the place as an idyllic corner of Southeast Asia. Earlier in the 1930s, Le Mayeur had organised a series of successful exhibitions in Singapore that captured the imaginations of the Nanyang artists. The excursion to Bali introduced new sights to the Nanyang artists, and subject matter of these works included the women of Bali and imaginings of rural Balinese life. An example is Liu Kang's *Artist and Model* (1954), which depicts fellow artist Chen Wen Hsi sketching a Balinese woman. Painted in 1954, it is theorised that the work is based on a sketch made during their field trip to Bali two years earlier. Within the painting, the outlines are rendered white instead of Liu Kang's usual black outlines—a visual style that has been said to be inspired by batik painting. The success of the trip and its resulting exhibition inspired other Nanyang artists such as the Ten Men Art Group, an informal grouping of artists who organised a series of painting trips to different parts of Southeast Asia between 1961 and 1976. ### Decline While Nanyang art gained maturity in the 1950s and 1960s, its position would decline when challenged by the emergence of other artistic influences gaining currency amongst younger artists, such as [Social Realism](/wiki/Social_realism) as was embodied by the [Equator Art Society](/wiki/Equator_Art_Society). While tropical landscapes attracted the early immigrant artists with their exotic novelty, the younger generation of Singapore-born artists who lived through complex periods of decolonisation and independence sought to be more reflexive regarding local sociopolitical issues. Abstraction also offered another visual form of expression for Singapore artists who came into contact with international art scene through overseas studies and travels during the 1960s, a method that some Nanyang artists had begun experimenting with in the early 1960s. ## Techniques The primary medium of Nanyang Style is Chinese ink and colour, or oil on canvas. A simple use of colours and lines is similar to those of [post-Impressionists](/wiki/Post-Impressionism), such as [Vincent van Gogh](/wiki/Vincent_van_Gogh). The art style reflects the universal culture of migrants, who in this case adapted to and accepted a new mix of Western, Chinese and Eastern beliefs and practices. Georgette Chen, who would paint subject matter in the environments around her across her travels, would reflect the changes in atmosphere through her paintings, with her work in Singapore and the region demonstrating the specific effect of tropical light on her subjects. The 1965 painting *Sweet Rambutans* is representative of Chen's interest in capturing a local subject matter such as [rambutan](/wiki/Rambutan) fruit with her technique of oil painting drawing from the [School of Paris](/wiki/School_of_Paris). - [Georgette Chen](/wiki/Georgette_Chen) - [Chen Chong Swee](/wiki/Chen_Chong_Swee) - [Chen Wen Hsi](/wiki/Chen_Wen_Hsi) - [Cheong Soo Pieng](/wiki/Cheong_Soo_Pieng) - [Chuah Thean Teng](/wiki/Chuah_Thean_Teng) - [Liu Kang](/wiki/Liu_Kang_(artist)) - [Lim Hak Tai](/wiki/Lim_Hak_Tai) - [Yong Mun Sen](/wiki/Yong_Mun_Sen)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:35:41.475177",
  "title": "Nanyang Style",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Nanyang_Style"
}