{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:35:35.259246"
  },
  "content": "Constituent art school of the University of the Arts Singapore‹ The template *Infobox university* is being considered for merging. › 1°18′01″N 103°51′06″E﻿ / ﻿1.300229°N 103.851573°E﻿ / 1.300229; 103.851573 **Nanyang Academy of Fine Arts** (**NAFA**; [Chinese](/wiki/Chinese_language): 南洋艺术学院; [Malay](/wiki/Malay_language): *Akademi Seni Halus Nanyang*; [Tamil](/wiki/Tamil_language): நன்யாங் அகாடமி ஆஃப் ஃபைன் ஆர்ட்ஸ்) is a publicly-funded post-secondary arts institution in Singapore, and a constituent college of the [University of the Arts Singapore](/wiki/University_of_the_Arts_Singapore) (UAS) from 2024. NAFA offers courses at high-school/Singapore's polytechnic equivalent diploma, Bachelor's Degree and Master's Degree levels. NAFA's diploma programmes provides comprehensive arts and design education appropriate for Singapore's polytechnic-level for students who have successfully completed their secondary school education, which is 10 years of studies in Singapore. As an industry-oriented alternative to a broader-based [junior college](/wiki/Junior_college_(Singapore)) education in Singapore, NAFA's diploma graduates in Singapore are sought after for work or many continue to complete [university](/wiki/University) degrees. NAFA's Diploma Programme in Singapore admits the majority of their students after [secondary school](/wiki/Secondary_school), normally at the age of 16–17, which is after ten years of formal education, similar to the other polytechnics in Singapore. Diplomas in a specialised area of study, for example 3D Design, are awarded after completing 3-years of full-time studies and industry internship. Demand for its programmes has remained strong, and the school projects a student population of 3,300 by 2024. NAFA offers full-time diploma and degree programmes across three faculties: Faculty of Art and Design comprising the School of Fine Art, School of 3D Design, School of Design and Media, as well as the School of Fashion Studies; Faculty of Performing Arts comprising School of Dance, School of Music, and School of Theatre; Faculty of Interdisciplinary Practices comprising School of Arts Management and School of Interdisciplinary Arts. The institution also offers a full range of government tuition fees subsidised, 2 to 3-years undergraduate degree programmes for NAFA's diploma graduates in partnership with the prestigious [University of the Arts London](/wiki/University_of_the_Arts_London) in [England](/wiki/England), [United Kingdom](/wiki/United_Kingdom). Students with [GCE A-Level](/wiki/GCE_A-Level) certificates as well as those without a relevant Singapore's polytechnic diplomas will be allowed to enrol in NAFA-UAL's degree programmes for the first time. Diploma courses are aligned with the degree courses offered in partnership with top universities in the world, including [Royal College of Music](/wiki/Royal_College_of_Music), [London](/wiki/London) (named as the world’s leading institution for performing arts in QS World University Rankings 2022). NAFA has nurtured 13 recipients of the [Cultural Medallion](/wiki/Cultural_Medallion)—Singapore's highest accolade bestowed on art practitioners who have significantly impacted arts and culture. Another 15 alumni have been presented the Young Artist Award. ## History NAFA was founded in a two-storey Geylang shophouse in 1938 by [Lim Hak Tai](/wiki/Lim_Hak_Tai), with its first class made up of 14 students. In February 1981, the Foochow Association announced that it would be closing the San Shan School located at [107A Sophia Road](/wiki/107A_Sophia_Road). The buildings were to be occupied by the NAFA, which was to move in following the closing of the San Shan School. NAFA paid the association a nominal rent of $120 per year. However, the association announced in 1983 that the rent would be increased to $25,000 beginning in January of the following year. NAFA moved out of the site in that year. In March 2021, Minister for Education [Lawrence Wong](/wiki/Lawrence_Wong) announced that Singapore's first university of the arts will be established from an alliance between the NAFA and [LASALLE College of the Arts](/wiki/LASALLE_College_of_the_Arts), while the colleges retain distinct identities. The university formed under this alliance will be given degree-awarding powers independent of their current foreign partners, and Singaporeans and permanent residents enrolled in the approved degree programmes at the university will pay subsidised fees, comparable to the autonomous universities in Singapore. No date has been set for the opening of the new university, ## Academics Apart from the regular academic requirements, entry into the diploma programme also requires students to fulfil their artistic and design potential aspect through portfolio submission, admission test or audition. The intakes especially for the furniture design major from the 3D design course are deliberately kept small so that each student gets focused attention. Selection is competitive and is subject to the availability of places too. Diploma students can advance into any Singaporean universities strictly depending on the diploma major the student graduated with, for example the [National University of Singapore](/wiki/National_University_of_Singapore) (NUS) or the [Singapore Management University](/wiki/Singapore_Management_University). In 2020 with the opening of the new bachelor of landscape architecture course through the [National University of Singapore](/wiki/National_University_of_Singapore), prospective students that graduated from NAFA's diploma in design (landscape and architecture) programme will be eligible for up to 28 advanced placement credits without any placement tests, into the bachelor of landscape architecture course. Many students also opted for overseas universities upon graduation with the diploma, mostly in a related areas as their diploma studies such as fine arts, architecture, interior design, landscape, graphic design, fashion, music, and theatre, among others. Other than Singapore's polytechnic-level diploma, Nanyang Academy of Fine Arts also collaborates with [University of the Arts London](/wiki/University_of_the_Arts_London) to offer a government subsidised 2-years Bachelor's degree-level education for their diploma graduates, or 3-year bachelor's degrees for Singapore's GCE A level or other non-relevant Singapore's polytechnic diploma graduates. Since 2006, Nanyang Academy of Fine Arts students are granted accelerated bachelor's degree programmes with [Nanyang Technological University](/wiki/Nanyang_Technological_University), meaning that diploma holders will have the option to pursue a direct honours degree over a shorter span of three years or less. Academy students can also apply for places in any faculty freely in the university with advanced placement through the signing ceremony for the memorandum of understanding. NAFA's partnership with RCM for the bachelor of music programme was established in 2011 with an initial batch of 20 students. Since then, more than 200 students have graduated from the programme. The key design feature of the programme is the two-year degree top up to the existing NAFA Diploma in Music programme. In the final year of the programme, students in western music studies head to RCM for a 7-week placement in January, while those studying Chinese music attend their 10-week placement in September at the Central Conservatory of Music in Beijing. For students who are looking to pursue postgraduate studies, NAFA - RCM offers performance degree courses at the Master’s level in Singapore. The Master of Performance and Master of Composition route develops Western and Chinese instrumentalists' performance or composition skills to a high professional level through intensive training within 2 years (full time) or 3 years (part time). Apart from regular diplomas, there is also a special 4-year diploma course where students will study for the first 3 years at the Nanyang Academy of Fine Arts and the final year at the [National Institute of Education](/wiki/National_Institute_of_Education), from which students will graduate with a diploma in art education or a diploma in music education from NAFA and a diploma in art education or diploma in music education from the NIE. Graduates from this scheme will be deployed to teach art or music in primary schools. ## Schools and campus location School of Design and mediaCampus 1School of Fine ArtCampus 1School of 3D DesignCampus 1School of Fashion StudiesCampus 2School of Arts ManagementCampus 3School of DanceCampus 3School of TheatreCampus 3School of MusicCampus 3School of Interdisciplinary ArtsAll Campuses ## Campuses NAFA operates from four campuses along [Bencoolen Street](/wiki/Bencoolen_Street). All four campuses are located within walking distances apart in the same vicinity. ### Campus 1 NAFA Campus 1 is divided into two wings, Wing A & Wing B, with a linking bridge. It boasts a high-definition studio, a creative media studio for 3D animation and special effects, and audio-video production facilities. Skylight studios allow painting in natural, evenly-distributed daylight. There are also photography studios equipped with studio flash systems and digital cameras and jewelry workshops with casting, processing and setting facilities, interior design material and project room, drafting studios and 3D model eorkshops and three art galleries with a total exhibition area of 850 sq m. A two-storey library is located in Wing A. It houses a collection of arts-related publications and journals available for members, staff and students. The Tanoto Foundation Centre for Southeast Asian Arts is located on the seventh floor. TFCSEA@NAFA, a website housing a full-text bilingual database of more than 100,000 pages of Southeast Asian arts materials was launched in 2011 to aid scholars and students' research in this area. Arts institutions and the general republic can join as members to access the materials online. ### Campus 1 Tower Block The NAFA Campus 1 Tower Block is located on top of the [Bencoolen MRT station](/wiki/Bencoolen_MRT_station), adjacent to NAFA Campus 1. Built in 2017 at a cost of $40 million, the building has art studios and classrooms meant to increase the available work and study space for students. It was the first expansion for the institution since its move to Bencoolen St. in 2004. Minister for Education [Ong Ye Kung](/wiki/Ong_Ye_Kung) officially opened the Nanyang Academy of Fine Arts' Campus 1 Tower Block during the school's 80th anniversary celebrations. ### Campuses 2 and 3 Campus 2 houses workshops for batik printing, textile development and embroidery design, drafting and draping, among other facilities, and houses the Fashion Studies Department. Campus 3 contains a 380-seat theatre with a rotating central platform on its stage, an adjustable orchestra pit, and two Steinway model D grand pianos. Other facilities include a recital hall, soundproof music studios and dance studios. ## Notable alumni - [Constance Lau](/wiki/Constance_Lau) - Singaporean actress - [Ceno2](/wiki/Ceno2) - Graffiti artist - [Julie Tan](/wiki/Julie_Tan) - Singaporean actress - [Mohammad Din Mohammad](/wiki/Mohammad_Din_Mohammad), painter - [Anthony Poon](/wiki/Anthony_Poon), Singaporean Artist - [Isyana Sarasvati](/wiki/Isyana_Sarasvati), Indonesian singer and songwriter - [M. Nasir](/wiki/M._Nasir), Singaporean singer and songwriter - [Chloe Chua](/wiki/Chloe_Chua), Singaporean violinist ### [Cultural Medallion](/wiki/Cultural_Medallion) recipients Year of awardNameDisciplineYear of Graduation1979Wee Beng ChongArt19581981[Ng Eng Teng](/wiki/Ng_Eng_Teng)Art19611981Lee Hock MohArt19701984[Thomas Yeo](/wiki/Thomas_Yeo)Art19601985Tay Chee TohArt19601990[Anthony Poon](/wiki/Anthony_Poon)Art19641995[Han Sai Por](/wiki/Han_Sai_Por)Art19772001Tan Kian PorArt19702005[Chng Seok Tin](/wiki/Chng_Seok_Tin)Visual arts19722006[Tan Choh Tee](/wiki/Tan_Choh_Tee)Visual arts19622009[Ang Ah Tee](/wiki/Ang_Ah_Tee)Visual arts19622011Lim Yew KuanVisual arts19502015[Chua Mia Tee](/wiki/Chua_Mia_Tee)Visual arts19522023[Isyana Sarasvati](/wiki/Isyana_Sarasvati)Music Performance2015 ### Young Artist Award recipients Year of awardNameDisciplineRef1992S. ChandrasekaranVisual arts1995Baet Yeok KuanVisual arts1997Lim Poh TeckVisual arts2000Lim Chin HuatDance2000Hong Sek ChernVisual arts2001[Goh Boon Teck](/wiki/Goh_Boon_Teck)Theatre2001Chua Say Hua AnthonyVisual arts2002Tay Bak ChiangVisual arts2006Goh Toh Chai ZechariahMusic2006Yeo Chee KiongVisual arts2013Mohammed Zulkarnaen Bin Othman (Zero)Visual arts2013Muhammad Zaki B Abd RazakVisual arts2013Chua Yew KokMusic2016Muhamad Harezam Bin Abdul Rahman (Ezzam Rahman)Fine art2022Rit XuMusic ## Image gallery - Official website - UAS website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:35:35.258877",
  "title": "Nanyang Academy of Fine Arts",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Nanyang_Academy_of_Fine_Arts"
}