{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:35:43.634520"
  },
  "content": "Autonomous university in Singapore‹ The template *Infobox university* is being considered for merging. › **Nanyang Technological University** (**NTU**) is a [national](/wiki/National_university) [public](/wiki/Public_university) [research](/wiki/Research) university in [Singapore](/wiki/Singapore). Founded in 1981, it is also the second oldest [autonomous university](/wiki/Autonomous_university) in the country. In response to Singapore’s economic restructuring in the 1970s amid a shortage of engineers, the government established the [Nanyang Technological Institute](/wiki/Nanyang_Technological_Institute) (NTI) in 1981 on the former campus of [Nanyang University](/wiki/Nanyang_University), adopting a practice-oriented polytechnic model that emphasised hands-on laboratory instruction and industrial attachments in [engineering](/wiki/Engineering) and [applied science](/wiki/Applied_science). NTI was elevated to full university status and officially inaugurated as NTU on 1 July 1991 through parliamentary legislation, incorporating the [National Institute of Education](/wiki/National_Institute_of_Education) to support national goals of industrial upgrading and research-intensive higher education in science and technology. NTU's main campus, located in the western part of [Singapore](/wiki/Singapore), covers 200 hectares (490 acres) of land, making it the largest university campus in the country. The university also operates a medical campus in [Novena](/wiki/Novena,_Singapore), Singapore's healthcare district. As of 2024, NTU enrolls 37,458 enrolled students, and employs 7,997 faculty and staff. The university is organised into a number of [colleges](/wiki/College) and [schools](/wiki/School), including the College of Engineering, College of Science, Nanyang Business School, [Lee Kong Chian School of Medicine](/wiki/Lee_Kong_Chian_School_of_Medicine), College of Humanities, Arts and Social Sciences, College of Computing and Data Science, Graduate College, [National Institute of Education](/wiki/National_Institute_of_Education), and [S. Rajaratnam School of International Studies](/wiki/S._Rajaratnam_School_of_International_Studies). NTU also hosts national research entities, including the Research Centres of Excellence (the Singapore Centre on Environmental Life Sciences Engineering, and Institute for Digital Molecular Analytics and Science) and University-level Research Institutes such as the Earth Observatory of Singapore which transitioned from a Research Centre of Excellence in June 2008 to a University Research Institute in July 2023. ## History ### Nanyang University (1955–1980) Nanyang University was founded in 1955 on land donated by the Hokkien Huay Kuan, prior to Singapore's independence from British rule. Conceived as a Chinese-medium university, it was largely supported by the local Chinese community and became the first Chinese-language university in Southeast Asia. Nanyang University was located south of the present Nanyang Technological University grounds, centered on what is now Yunan Garden. The former administration building of Nanyang University now houses the Chinese Heritage Centre, which has been designated as a [national monument](/wiki/National_monument). ### Nanyang Technological Institute (1981–1991) In 1980, Nanyang University merged with the University of Singapore to form the current [National University of Singapore](/wiki/National_University_of_Singapore). Nanyang Technological Institute (NTI), a tertiary institution affiliated to the National University of Singapore, was formed to take over Nanyang University's campus in 1981. NTI operated as an engineering institute for a decade and formed the academic and infrastructural foundation for the establishment of Nanyang Technological University. ### Legacy of Nanyang University (1991) As NTU subsequently grew into a full university, various efforts were made to have it claim the Nanyang University mantle. In 1996, the alumni rolls of Nanyang University were transferred from NUS to NTU. In 1998, the prominent local calligrapher and poet Pan Shou, who had been the first vice-chancellor of Nanyang University, called for NTU to be renamed Nanyang University, as a way to \"quieten the hearts of many\" NU alumni.[*better source needed*] ### Present form #### Establishment of Nanyang Technological University (1991) In March 1991, the Singapore Parliament approved the formation of Nanyang Technological University. It was officially established on 1 July 1991, with the [National Institute of Education (NIE)](/wiki/National_Institute_of_Education) incorporated into it. The alumni rolls of the former Nanyang University were transferred to NTU in 1996. Historically, Nanyang Technological University admitted students jointly with the affiliated [National University of Singapore](/wiki/National_University_of_Singapore) and charged the same fees. Students made only one application, and they would be accepted by either university. This arrangement ended in 2004 as both universities began to distinguish themselves with an end of its official affiliation. Currently, students apply separately to both universities. NTU became autonomous in 2006 and stands as one of the two largest public universities in Singapore today. #### Developments in the 21st century Since the early 2000s, NTU has expanded its international engagement, graduate education, and academic profile. NTU has a highly diverse international academic community. Approximately 65% of NTU's faculty and staff are foreign nationals, placing it among the world’s top 100 universities with the highest proportion of international faculty, according to QS. (NTU was ranked joint 3rd in the world on this metric, alongside [NUS](/wiki/National_University_of_Singapore).) The university is also highly international in its student body: 31% (8,089) of students are foreign nationals, with 58% of them pursuing postgraduate degrees. It remains one of the few top 100 universities with more than 60% of foreign faculty. #### Controversies in the 21st century In 2013, a public debate over [academic freedom](/wiki/Academic_freedom) in Singapore arose after [Cherian George](/wiki/Cherian_George), an outspoken academic at the Wee Kim Wee School of Communications known for his criticism of the government, was denied tenure. Although George had been recommended for tenure by the Wee Kim Wee School, his application was rejected by a university-level committee that included representatives from the [Government of Singapore](/wiki/Government_of_Singapore). The decision prompted a petition by students at the Wee Kim Wee School, but George's subsequent appeal was rejected by the university. In 2021, some applications for on-campus hostel accommodations in NTU were rejected due to [COVID-19](/wiki/COVID-19) isolation protocols. The university claimed that the rejections were due to a shortage of housing facilities, which at full capacity was still unable to house every applicant, as rooms were oversubscribed. These rejections raised concerns, especially among international students, as returning students from Academic Year 2020–2021 were not granted on-campus accommodation despite the university's much-publicised policy of guaranteeing all incoming students a minimum of two years of campus housing. NTU eventually reversed their decision on 2 July 2021, prioritising on-campus accommodations for international students that resided on campus at the time, students under scholarship programmes with guaranteed housing, and all Year 1 and 2 students under the guaranteed hall stay policy. ## Coat of arms On its foundation in July 1991, NTU adopted the Coat of Arms granted to NTI (by the [College of Arms](/wiki/College_of_Arms) of the United Kingdom in November 1982) as its coat of arms. The Coat of Arms consists of a heraldic shield divided into two sections: the lower portion shows a stalking lion facing the spectator on a white background and the upper portion two atomic symbols, one on either side of a cog-wheel above a battlement on a red background. It is [blazoned](/wiki/Blazon): > Argent a lion passant guardant proper on a chief embattled gules a cog-wheel between two conventional representations of an atom argent. The lion represents close links between NTI and NUS, the battlement represents School of Civil and Structural Engineering, the atoms represents School of Electrical and Electronic Engineering and the cogwheel represents School of Mechanical and Production Engineering. ## Campuses ### Landscape and Architecture NTU has been listed among the World's Most Beautiful Universities, with the Art, Design and Media (ADM) building featured in a 2012 report by *Travel + Leisure*. Much of NTU’s campus layout dates back to the NTI period between 1981 and 1982, when the master plan including the central academic spine known as the North Spine was designed by Japanese architect [Kenzō Tange](/wiki/Kenz%C5%8D_Tange) the recipient of the 1987 [Pritzker Architecture Prize](/wiki/Pritzker_Architecture_Prize). The North Spine was officially opened in 1986. Several landmark buildings on campus have since gained international recognition. [The ADM building](/wiki/Timothy_Seow#ADM_Building), featured in the *Travel + Leisure* report, was designed by Singaporean architect Lee Cheng Wee. *The Hive*, featured by [Times Higher Education](/wiki/Times_Higher_Education), was designed by British designer Thomas Heatherwick. - The Hive ### Yunnan Garden Campus The former [Nanyang University](/wiki/Nanyang_University) administration building was restored into the Chinese Heritage Centre and was gazetted as a [national monument](/wiki/National_monument) in 1998 – now overlooking the Yunnan Garden. The Yunnan Garden precinct has undergone restoration and redevelopment works that completed in 2021. This encompassed heritage conservation, landscaped public spaces, and upgraded facilities surrounding the Chinese Heritage Centre. The [Nanyang University Memorial](/wiki/Nanyang_University_Memorial) and original Nanyang University Arch were also declared national monuments of Singapore in 1998. The NTU Art & Heritage Museum is an approved public museum under the National Heritage Board's Approved Museum Scheme; benefactors who donate artworks and artefacts to NTU enjoy double tax deductions. There is a small lake between the Chinese Heritage Centre and Hall of Residence 4 called Nanyang Lake. Only members of NTU Anglers' Club permit holder, the fishing club at NTU, are allowed to fish in this lake. The campus also served as the Youth Olympic Village for the inaugural [Youth Olympic Games](/wiki/Youth_Olympic_Games) in 2010. ### Transportation Transportation to and around NTU is provided by means of campus shuttle buses. The Campus Loop Red and Blue services circle the campus, while the Campus Rider service connects the campus to the [Pioneer MRT station](/wiki/Pioneer_MRT_station). NTU is planned to be served directly by 3 new MRT stations on the [Jurong Region Line](/wiki/Jurong_Region_Line), which is expected to open around 2029: JW3 (Nanyang Gateway), JW4 (Nanyang Crescent) and JW5 (Peng Kang Hill). Construction is ongoing on campus, with worksites along Nanyang Avenue and Nanyang Drive. - Architecture/Facilities of NTU ### Libraries NTU maintains a comprehensive library network comprising eight specialized branches, collectively housing over two million print, digital, and audiovisual resources accessible 24/7 online for staff and students. Lee Wee Nam Library supports engineering and science collections with innovative study spaces including wellness areas and panoramic views. Other key branches include the Business Library for finance and marketing materials, Chinese Library near Yunnan Garden specializing in Chinese literature and history, Humanities and Social Sciences Library with Singapore-focused collections, Communication and Information Library for media studies, Art, Design & Media Library featuring AV setups, Wang Gungwu Library at the Chinese Heritage Centre on overseas Chinese history, and the Medical Library at Novena. ## Colleges and schools NTU is organised into several colleges and schools, each corresponding to different fields of study. The founding colleges include the College of Engineering, Nanyang Business School, Wee Kim Wee School of Communication and Information, and the [National Institute of Education](/wiki/National_Institute_of_Education), which have been part of NTU since its inception in 1991. More recently, NTU has established additional schools for the Biological Sciences (2001), Humanities and Social Sciences (2004), Physical & Mathematical Sciences (2005), [S. Rajaratnam School of International Studies](/wiki/S._Rajaratnam_School_of_International_Studies) (2007), and Art, Design and Media (2009). In 2013, NTU and [Imperial College London](/wiki/Imperial_College_London) jointly established a new medical school, the [Lee Kong Chian School of Medicine](/wiki/Lee_Kong_Chian_School_of_Medicine), on the Novena campus along 11 Mandalay Road. In October 2016, the university announced that Humanities and Social Sciences would be expanded into two separate schools, namely the School of Humanities and the School of Social Sciences. ### Nanyang Business School Nanyang Business School (NBS) is the largest business school in Singapore. NBS also houses the 165-square meter Centre for Applied Financial Education, the largest finance lab in Singapore. The new lab is equipped with 60 dedicated Thomson Reuters Eikon terminals with Datastream, along with 24 Bloomberg terminals that will allow business school students to access all kinds of real-time financial, economic and business news information. In May 2023, NTU launched a new six-storey green building named Gaia, constructed primarily from mass timber. It is NTU’s eighth zero-energy building and, at its opening, the largest wooden building in Asia. ### College of Humanities, Arts, and Social Sciences HASS consists of four schools: - The Wee Kim Wee School of Communication and Information is a school of [communication studies](/wiki/Communication_studies) and offers courses in [Journalism](/wiki/Journalism), [Broadcast](/wiki/Broadcast), [Advertising](/wiki/Advertising), Communication Policy and [Information Studies](/wiki/Information_Studies). It originally established in 1992, and it was named after Singapore's former president [Wee Kim Wee](/wiki/Wee_Kim_Wee) in 2006. - The School of Art, Design and Media is Singapore's first professional art school and offers an undergraduate programmes in [Art](/wiki/Art), [Design](/wiki/Design), and [Media](/wiki/Media_(communication)), as well as graduate degrees in arts research. Its building, which features a sloping grassy roof surrounding a central courtyard, is frequently featured in NTU's promotional materials. - In 2016, NTU announced that they will be splitting the School of Humanities and Social Sciences to 2 separate colleges: the School of Humanities (SOH) and School of Social Sciences (SSS) – to accommodate the rising intake of students. - The School of Humanities which offers programmes in a wide variety of fields including [Chinese](/wiki/Chinese_language), [English Literature](/wiki/English_Literature), [History](/wiki/History), [Linguistics & Multilingual Studies](/wiki/Linguistics) and [Philosophy](/wiki/Philosophy). - The School of Social Sciences which offers [Economics](/wiki/Economics), [Psychology](/wiki/Psychology), [Public Policy](/wiki/Public_Policy) and [Sociology](/wiki/Sociology). ### College of Engineering The College of Engineering is NTU's largest subdivision. It has been ranked among the world's top 15 schools of engineering and technology by [QS World University Rankings](/wiki/QS_World_University_Rankings), and claimed to be the world's largest engineering college, with a student population of more than 10,500 undergraduates and 3,500 graduates. It consists of five schools: - School of Chemistry, Chemical Engineering and Biotechnology (CCEB), - School of Civil and Environmental Engineering (CEE), - School of Electrical and Electronic Engineering (EEE), - School of Mechanical and Aerospace Engineering (MAE), and - School of Materials Science and Engineering (MSE). In addition to the 12 single degree programmes, the college also offers double degrees, double majors and integrated programmes as well as the only aerospace engineering programme in Singapore. ### College of Computing and Data Science The College of Computing and Data Science (CCDS) was established in February 2024 following a restructuring of Nanyang Technological University’s academic framework. It was formed through the reorganisation of the School of Computer Science and Engineering and the consolidation of computing-related disciplines previously housed under the College of Engineering. The establishment of CCDS resulted in Computer Science, Computer Engineering, Data Science, and Artificial Intelligence being separated from the College of Engineering to form an autonomous college. This transition was accompanied by the introduction of new interdisciplinary academic programmes, including Applied Computing in Finance and Artificial Intelligence & Society, reflecting the university’s growing emphasis on data-driven and societally grounded computing education. ### College of Science As of 2024, the college consists of four schools and is home to 257 faculty members, 578 research staff, 134 administrative and technical staff, 4,227 undergraduate and 1,078 graduate students. - The School of Biological Sciences was established in 2002 and offers a variety of programmes in the [Biological Sciences](/wiki/Biological_Sciences) and double degree programme in [Biomedical Sciences](/wiki/Biomedical_Sciences) and [Traditional Chinese Medicine](/wiki/Traditional_Chinese_Medicine) with the [Beijing University of Chinese Medicine](/wiki/Beijing_University_of_Chinese_Medicine) in [China](/wiki/China). - The School of Physical and Mathematical Sciences was established in 2005 and offers various disciplines in [physics](/wiki/Physics), [applied physics](/wiki/Applied_physics) and [mathematical sciences](/wiki/Mathematical_sciences). The school offers [data science](/wiki/Data_science) programmes together with the College of Computing and Data Science. - The Asian School of the Environment is a new interdisciplinary School established in 2015 to focus on Asian environmental challenges, integrating Earth systems, environmental [life sciences](/wiki/Life_sciences), [ecology](/wiki/Ecology), and the [social sciences](/wiki/Social_science) to address key issues of the [environment](/wiki/Environmentalism) and [sustainability](/wiki/Sustainability). - The School of Chemistry, Chemical Engineering and Biotechnology is a school run in conjunction with the College of Engineering established in 2022 with programmes in [organic](/wiki/Organic_chemistry) and [inorganic chemistry](/wiki/Inorganic_chemistry), [physical chemistry](/wiki/Physical_chemistry), [chemical engineering](/wiki/Chemical_engineering), and [bioengineering](/wiki/Bioengineering). ### Lee Kong Chian School of Medicine In 2010, NTU announced the formation of a pro-tem governing board to guide the establishment of the Lee Kong Chian School of Medicine, a collaboration with [Imperial College London](/wiki/Imperial_College_London). The medical college was established in 2013. Prior to its opening in 2013, the school received record donations of S$400 million, including S$150 million from the [Lee Foundation](/wiki/Lee_Foundation). The School's primary clinical partner is the [National Healthcare Group](/wiki/National_Healthcare_Group). ### Graduate College NTU's Graduate College was formed on 1 August 2018 and is in charge of graduate programmes in NTU. One such graduate programme is the Interdisciplinary Graduate Programme (IGP), which leverages on professors from multiple schools or colleges in NTU to undertake interdisciplinary research and to act as advisors for IGP PhD students. Another graduate programme is the Industrial Postgraduate Programme (IPP), which leverages on partnering industry companies to undertake industrial research and to act as advisors for IPP PhD students. ### National Institute of Education The National Institute of Education (NIE), occupying 16 hectares (0.16 km2; 40 acres) in the western part of NTU's Yunnan Garden campus, is Singapore's main teaching college and is run in close collaboration with Singapore's [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)). Full-time teachers in [Singapore's public schools](/wiki/Education_in_Singapore) are required to complete a post-graduate diploma course at NIE, sponsored by Singapore's [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)). ### S. Rajaratnam School of International Studies The S. Rajaratnam School of International Studies (RSIS), named after [Singapore's former Deputy Prime Minister and Minister for Foreign Affairs](/wiki/S._Rajaratnam), offers graduate programmes in [international relations](/wiki/International_relations) and is an autonomous graduate institution of NTU. The school has the Institute of Defence and Strategic Studies. Beyond its colleges and schools, NTU also hosts several autonomous and university-level units that anchor research, talent development and innovation: the new NTU Honours College (first intake of ~500 students in August 2025), SCELSE—a national Research Centre of Excellence and NTU autonomous institute—the Earth Observatory of Singapore (a University Research Institute since 2023), NEWRI (Nanyang Environment & Water Research Institute), ERI@N (Energy Research Institute @ NTU), the NTU Entrepreneurship Academy (NTUpreneur)—formerly the Nanyang Technopreneurship Center—and the Nanyang Centre for Public Administration (NCPA) housed under the School of Social Sciences (HASS). ## Research institutes and centres NTU hosts three Research Centres of Excellence (RCE). - The Singapore Centre on Environmental Life Sciences Engineering (SCELSE) is a unique[*citation needed*] interdisciplinary Research Centre of Excellence (RCE), funded by National Research Foundation, Singapore Ministry of Education, Nanyang Technological University and National University of Singapore. Hosted by the NTU in partnership with NUS, SCELSE is linking new insights from the [Life Sciences](/wiki/Life_Sciences) with expertise from the emerging technologies in [Engineering](/wiki/Engineering) and [Natural Sciences](/wiki/Natural_Sciences) to understand, harness and control microbial [biofilm](/wiki/Biofilm) communities. The union of these fields has established a new discipline of Environmental Life Sciences Engineering. - The Earth Observatory of Singapore (EOS) is an autonomous research institute specialising in [Earth Sciences](/wiki/Earth_Sciences) and conducts fundamental research on [earthquakes](/wiki/Earthquakes), [volcanoes](/wiki/Volcanoes), [tsunamis](/wiki/Tsunamis) & [climate change](/wiki/Climate_change) in and around [Southeast Asia](/wiki/Southeast_Asia), towards safer and more sustainable societies. - The Institute for Digital Molecular Analytics and Science (IDMxS) is an interdisciplinary RCE, funded by Singapore Ministry of Education, Nanyang Technological University and National University of Singapore. ## Academics NTU is a comprehensive national public research university with most students enrolled in full-time undergraduate and graduate degree programmes. It operates on a two-semester academic calendar, with the academic year typically running from August to May and an optional special term in between semesters. ### Undergraduate program Enrolment at NTU (2023–2025) Academic YearUndergraduatesGraduateTotal Enrollment2023–202424,75710,60835,3652024–202524,80012,65837,4582025–202625,01015,72940,739 *Source: NTU Institutional Statistics Unit* As of 2026, NTU enrolls over 25,000 undergraduate students across its colleges and schools. The College of Engineering constitutes the largest academic division, followed by the College of Humanities, Arts and Social Sciences, College of Computing & Data Science, Nanyang Business School, College of Science, Lee Kong Chian School of Medicine and the National institute of Education. Undergraduate students are required to complete a set of Interdisciplinary Collaborative Core (ICC) courses, introduced as part of a university-wide curriculum reform. The ICC framework emphasizes interdisciplinary learning, ethics, sustainability, communication, and teamwork, complementing discipline-specific coursework. Most undergraduate courses combine lectures, tutorials, laboratory sessions and project-based assessments. Final-year students typically complete a capstone project or final-year project particularly in engineering and science programs, involving independent research or applied design under faculty supervision, industry partners or research institutes. ### Undergraduate Research NTU places emphasis on undergraduate research, with students participating in faculty led projects through programmes such as the Undergraduate Research Experience on Campus (URECA) and overseas research attachments. Many undergraduates also engage in internships, industry-linked projects and/or overseas exchange programmes as part of their degree requirements. ### Graduate program NTU offers a broad range of graduate programmes, including coursework-based and research-based master's degrees, as well as Doctor of Philosophy (PhD) programmes across science, engineering, computing, medicine, education, business and the humanities. Doctoral education at NTU is research-intensive, with PhD candidates typically supported through scholarships, research assistantships or teaching assistantships. Graduate students are closely integrated into NTU's research ecosystem, which allows them to contribute to national and international research initiatives. NTU also offers professional graduate degrees, including the Master of Business Administration (MBA), specialized master's programmes in engineering and computing and joint or dual-degree programmes with international partner universities. The university also maintains over 50 joint, dual, and double-degree programmes with international partner institutions, particularly in Europe, North America, and Asia. ### Scholarships NTU is a participating institution in the Singapore International Graduate Award (SINGA), a national doctoral scholarship programme administered by the Agency for Science, Technology & Research (A*STAR). This programme supports PhD candidates worldwide and is jointly offered by A*STAR, Nanyang Technological University, the National University of Singapore, and the Singapore University of Technology and Design. ### Collaborations NTU maintains extensive global academic and industry partnerships to advance research, education, and innovation. Key collaborations include the CREATE campus with research centres alongside MIT, ETH Zurich, Technical University of Munich, Cambridge University, and others in areas like electromobility, sustainability, and AI. Notable joint initiatives feature the Centre for Lifelong Learning and Individualised Cognition (CLIC) with University of Cambridge, seed funds with Imperial College London for blue-sky research in health, AI, and urban resilience, and the Fraunhofer-NTU Research Centre. Industry ties span over 700 companies via corporate labs and NTUitive spin-offs (e.g., Nanofilm, Eureka Robotics), plus partnerships with P&G, Schaeffler, and the Millennium Technology Prize as Asia's first academic partner. ## Student Life ### Student governance and organizations Student life at NTU is vibrant and largely self-directed. The Nanyang Technological University Students’ Union (NTUSU) is the main representative body for undergraduates. Membership in NTUSU is compulsory for all full-time undergrads (and certain postgraduates in NIE). The Union consists of 16 academic constituent clubs (one for each school or college) and 3 non-academic constituent clubs – namely the Cultural Activities Club, Sports Club, and Welfare Services Club. Through its elected Council and Executive Committee, NTUSU organizes student activities and serves as the liaison between the student body and the university administration. In addition, a Graduate Students’ Association represents postgraduate students. ### Clubs and societies Beyond the Union’s constituent clubs, NTU has numerous special interest groups and societies. Students can join over 100 clubs spanning arts, culture, sports, entrepreneurship, community service, and more. These include performing arts ensembles, cultural clubs, academic societies, and hobby groups that cater to a wide range of interests. Such activities provide opportunities for students to pursue their passions and form communities on campus. Notably, NTU’s Cultural Activities Club and Sports Club coordinate many university-wide events, and the Welfare Services Club engages in year-round volunteering projects. Competitive teams (like debate, robotics, and sports teams) also represent NTU in inter-varsity competitions. ### Residential Life NTU has 23 Halls of Residence for undergraduates, each accommodating between 500 and 659 residents. All halls are co-educational by floor or wing and offer both single and double occupancy rooms, with double rooms shared by residents of the same gender. Communal facilities are available in every hall and typically include lounges, air-conditioned reading rooms, pantries, and laundry rooms equipped with washing machines and dryers. Each hall is managed by a student-run Hall Council. About 12,000 students live on campus, and every incoming freshman is guaranteed two years of hall accommodation. Halls are vibrant communities with traditions such as inter-hall competitions in sports, cheer-leading and recreational games. Senior students typically accrue “hall points” by participating in hall activities and committees to qualify for continued residency. Hall Councils also organize social events, welfare initiatives, and orientation activities for residents, contributing to a lively campus living experience. - On-campus housing ## Entrepreneurship NTU's entrepreneurship ecosystem is anchored by **NTUitive**, the university's innovation and enterprise company and wholly-owned subsidiary, which manages intellectual property, promotes innovation, supports entrepreneurship, and facilitates the commercialization of research through technology licensing, start-up incubation, and industry partnerships. The NTU **Overseas Entrepreneurship Programme** (OEP) offers selected undergraduates funded internships of 6–12 months at technology start-ups in global innovation hubs such as Silicon Valley, Shenzhen, and Tel Aviv, alongside entrepreneurship coursework and business proposal development. Participants receive up to S$10,000 in funding and are required to complete entrepreneurship modules beforehand; the programme is part of Singapore's Global Innovation Alliance initiative. NTU further supports student-led ventures through the NTU Entrepreneurship Academy (NTUpreneur), campus incubators such as the NTU Innovation Port, seed funding schemes, innovation challenges, and mentorship by venture builders. Over the past decade, NTU spin-offs have achieved a combined valuation exceeding S$800 million, with more than 1,000 technologies licensed to companies. ## Reputation and rankings ### Overall rankings NTU was #40 worldwide in 2024 in terms of aggregate performance across THE, QS, and ARWU. ### Young university rankings NTU is #1 in both the Times Higher Education Young University Rankings 2023 and the QS \"Top 50 Under 50\" 2021. NTU has been ranked as the world's #1 young university by [QS](/wiki/QS_World_University_Rankings) since 2015. ### Subject/area rankings In the 2025 QS World University Rankings by Subject, NTU ranked among the global top 10 in several engineering and science-related subjects, and held the top national position in multiple disciplines. [QS](/wiki/QS_World_University_Rankings) World University Rankings by Subject 2025 SubjectGlobalNationalArts & Humanities 48 2Archaeology 101–150 1Architecture – Built Environment 36 3Art and Design 19 1English Language and Literature 30 2History of Art 41 2History 51–100 2Linguistics 27 2Modern Languages 42 2Performing Arts 51–100 2Philosophy 101–150 2Engineering & Technology 11 1Computer Science and Information Systems 6 2Data Science and Artificial Intelligence 5 1Engineering – Chemical 10 2Engineering – Civil and Structural 9 2Engineering – Electrical and Electronic 4 1Engineering – Mechanical, Aeronautical and Manufacturing 4 1Life Sciences & Medicine 109 2Biological Sciences 30 2Medicine 84 2Psychology 27 2Natural Sciences 24 2Chemistry 8 2Earth and Marine Sciences 42 2Environmental Sciences 13 2Geography 43 2Geology 44 1Geophysics 41 1Materials Science 2 1Mathematics 20 2Physics and Astronomy 16 2Social Sciences & Management 21 2Accounting and Finance 20 2Business and Management Studies 14 2Communication and Media Studies 4 1Development Studies 51–100 2Economics and Econometrics 42 2Education 8 1Hospitality and Leisure Management 28 2Law 82 2Library and Information Management 3 1Marketing 13 2Politics and International Studies 34 2Social Policy and Administration 51–100 2Sociology 58 2Sports-Related Subjects 29 2Statistics and Operational Research 28 2 ## Notable alumni Nanyang Technological University (NTU) has produced alumni who have held high office in government across Southeast Asia, led multinational corporations, and achieved distinction in academia, arts, sports and media. ### Politics, government and public service #### International - [HE Pehin Dato Abu Bakar Apong](/wiki/Abu_Bakar_Apong) – Former Minister of Home Affairs of Brunei - [Major](/wiki/Major_(rank)) [Agus Harimurti Yudhoyono](/wiki/Agus_Harimurti_Yudhoyono) – Coordinating Minister for Infrastructure and Regional Development, Indonesia - [Edhie Baskoro Yudhoyono](/wiki/Edhie_Yudhoyono) – Member of House of Representatives, Indonesia - [Lan Tianli](/wiki/Lan_Tianli) – Chairman and deputy [party](/wiki/CCP) chief of the [Guangxi Zhuang Autonomous Region](/wiki/Guangxi_Zhuang_Autonomous_Region), China and chairman of the Guangxi Zhuang Autonomous Region Committee of the [Chinese People's Political Consultative Conference](/wiki/Chinese_People%27s_Political_Consultative_Conference) - [Dato' Seri Mohd Zuki Bin Ali](/wiki/Mohd_Zuki_Ali) – Board Chairman, Employees Provident Fund, Malaysia - [Gen.](/wiki/General) [Tito Karnavian](/wiki/Tito_Karnavian) – Minister of Home Affairs, Indonesia; former chief of the [Indonesian National Police](/wiki/Indonesian_National_Police) - [Nie Chenxi](/wiki/Nie_Chenxi) – Standing Committee Member, Deputy Director, 14th National Committee of the Chinese People's Political Consultative Conference, People's Republic of China - [Y.B. Datuk Seri Ir Wee Ka Siong](/wiki/Wee_Ka_Siong) – President of Malaysian Chinese Association; Member, House of Representative of Malaysia #### Singapore #### Current Ministers and Members of Parliament (MP) - [Ang Wei Neng](/wiki/Ang_Wei_Neng) – Member of Parliament for [West Coast GRC](/wiki/West_Coast_GRC) - [Baey Yam Keng](/wiki/Baey_Yam_Keng) – Senior Parliamentary Secretary, Ministry of Sustainability and the Environment & Ministry of Transport - [Cheryl Chan](/wiki/Cheryl_Chan) – Member of Parliament for [East Coast GRC](/wiki/East_Coast_GRC) - [Chong Kee Hiong](/wiki/Chong_Kee_Hiong) – Member of Parliament for Bishan-Toa Payoh GRC - [Eric Chua](/wiki/Eric_Chua) – Senior Parliamentary Secretary, Ministry of Culture, Community and Youth & Ministry of Social and Family Development - [Darryl David](/wiki/Darryl_David) – Member of Parliament for [Ang Mo Kio GRC](/wiki/Ang_Mo_Kio_GRC) - [Gerald Giam Yean Song](/wiki/Gerald_Giam) – Member of Parliament for [Aljunied GRC](/wiki/Aljunied_GRC) - [Derrick Goh](/wiki/Derrick_Goh) – Member of Parliament for [Nee Soon GRC](/wiki/Nee_Soon_GRC) - [Low Yen Ling](/wiki/Low_Yen_Ling) – Senior Minister of State, Ministry of Culture, Community and Youth & Ministry of Trade and Industry; Chairperson of Mayors' Committee & Mayor, South West District; Member of Parliament for [Chua Chu Kang GRC](/wiki/Chua_Chu_Kang_GRC) - [Masagos Zulkifli](/wiki/Masagos_Zulkifli) – Minister for Social and Family Development & Second Minister for Health; Minister-in-charge of Muslim Affairs; Member of Parliament for [Tampines GRC](/wiki/Tampines_GRC) - [Ng Ling Ling](/wiki/Ng_Ling_Ling) – Member of Parliament for [Ang Mo Kio GRC](/wiki/Ang_Mo_Kio_GRC), 2018 Her World Woman of the Year - [Sim Ann](/wiki/Sim_Ann) – Senior Minister of State, Ministry of Foreign Affairs & Ministry of National Development; Member of Parliament for [Holland-Bukit Timah GRC](/wiki/Holland-Bukit_Timah_GRC) - [Desmond Tan Kok Ming](/wiki/Desmond_Tan_(politician)) – Senior Minister of State, Singapore Prime Minister's Office; Member of Parliament for [Pasir Ris-Punggol GRC](/wiki/Pasir_Ris-Punggol_GRC) - [Wan Rizal Wan Zakariah](/wiki/Wan_Rizal_Wan_Zakariah) – Member of Parliament for [Jalan Besar GRC](/wiki/Jalan_Besar_GRC) - [Don Wee](/wiki/Don_Wee) – Member of Parliament for [Chua Chu Kang GRC](/wiki/Chua_Chu_Kang_Group_Representation_Constituency) - [Yip Hon Weng](/wiki/Yip_Hon_Weng) – Member of Parliament for [Yio Chu Kang SMC](/wiki/Yio_Chu_Kang_SMC) - [Melvin Yong](/wiki/Melvin_Yong) – Member of Parliament for [Radin Mas SMC](/wiki/Radin_Mas_SMC), and Assistant Secretary General [National Trades Union Congress](/wiki/National_Trades_Union_Congress) - [Zaqy Mohamad](/wiki/Zaqy_Mohamad) – Senior Minister of State, Ministry of Defence & Ministry of Manpower; Member of Parliament for [Marsiling-Yew Tee GRC](/wiki/Marsiling-Yew_Tee_GRC) - [Patrick Tay](/wiki/Patrick_Tay) – Member of Parliament for [Pioneer SMC](/wiki/Pioneer_SMC) and Assistant Secretary General of [National Trades Union Congress](/wiki/National_Trades_Union_Congress) #### Retired politicians - [Ang Mong Seng](/wiki/Ang_Mong_Seng) – former Member of Parliament for [Bukit Gombak SMC](/wiki/Bukit_Gombak_SMC) - [Cheo Chai Chen](/wiki/Cheo_Chai_Chen) – former Member of Parliament for [Nee Soon Central SMC](/wiki/Nee_Soon_Central_Single_Member_Constituency) - [Inderjit Singh](/wiki/Inderjit_Singh_(politician)) – former Member of Parliament for [Ang Mo Kio GRC](/wiki/Ang_Mo_Kio_GRC) - [Intan Azura Mokhtar](/wiki/Intan_Azura_Mokhtar) – former Member of Parliament for [Ang Mo Kio GRC](/wiki/Ang_Mo_Kio_GRC) - [Lee Bee Wah](/wiki/Lee_Bee_Wah) – former Member of Parliament for [Nee Soon GRC](/wiki/Nee_Soon_GRC) - Sinnakaruppan s/o C Ramasamy – former Member of Parliament, and first Students' Union President - [Low Thia Khiang](/wiki/Low_Thia_Khiang) – Former Secretary-General of Workers' Party; Former Member of Parliament (Singapore) - [Sebastian Teo Kway Huang](/wiki/Sebastian_Teo) – former President of the [National Solidarity Party](/wiki/National_Solidarity_Party_(Singapore)) - [Teo Ser Luck](/wiki/Teo_Ser_Luck) – former Member of Parliament for [Pasir Ris-Punggol GRC](/wiki/Pasir_Ris-Punggol_GRC), Mayor, and Minister of State ; President, Institute of Singapore Chartered Accountants - [Yee Jenn Jong](/wiki/Yee_Jenn_Jong) – former [Non-Constituency Member of Parliament](/wiki/Non-Constituency_Member_of_Parliament) - [Yu-Foo Yee Shoon](/wiki/Yu-Foo_Yee_Shoon) – former Member of Parliament for [Yuhua SMC](/wiki/Yuhua_SMC), and former Minister of State for Community Development, Youth & Sports ### Business - [Ajit Mohan](/wiki/Ajit_Mohan) – Chief Business Officer, [Snap Inc.](/wiki/Snap_Inc.) - [Dato’ Sri Tahir](/wiki/Tahir_(Indonesian_businessman)) – Founder, [Mayapada Group](/wiki/Mayapada_Group); billionaire - [Danny Yong](/wiki/Danny_Yong) – Chief Investment Officer & Founding Partner, [Dymon Asia](/wiki/Dymon_Asia) Capital - Tan Chin Hwee – Chairman, SGTraDex Services; Asia-Pacific CEO, [Trafigura](/wiki/Trafigura) - [Tan Lip-Bu](/wiki/Lip-Bu_Tan) – CEO of [Intel](/wiki/Intel); Chairman, [Walden International](/wiki/Walden_International); former CEO, [Cadence Design Systems](/wiki/Cadence_Design_Systems) - [Merry Riana](/wiki/Merry_Riana) – Founder, Merry Riana Group ### Science - [Shirley Meng](/wiki/Shirley_Meng) – Professor, Pritzker School of Molecular Engineering, University of Chicago - [Ming Joo Koh](/wiki/Ming_Joo_Koh) – Associate Professor, NUS Singapore; Young Scientist Award 2022 ### Educators, artists and literary figures - [Choo Jing Sarah](/wiki/Sarah_Choo_Jing) – Gold Award in the 2016 PX3 [Prix de la Photographie](/wiki/Prix_de_la_Photographie), Fine Art Category; First Place in the 2015 Moscow International Foto Awards - [Liang Wern Fook](/wiki/Liang_Wern_Fook) – writer and musician; Cultural Medallion for Music 2010 - [Ng Yew Kwang](/wiki/Yew-Kwang_Ng) – economist - [Nuraliah Bte Norasid](/wiki/Nuraliah_Norasid) – Epigram Books Fiction Prize 2016 for her first novel, The Gatekeeper - [Tan Swie Hian](/wiki/Tan_Swie_Hian) – local artist & sculptor; Cultural Medallion for Art 1987 - [Wong Meng Voon](/wiki/Wong_Meng_Voon) – writer and co-founder, Singapore Association of Writers; Cultural Medallion for Literature 1981 - [You Jin](/wiki/You_Jin) – author; Cultural Medallion for Literary Arts 2009 ### Media professionals and celebrities - [Vincy Chan](/wiki/Vincy_Chan) – Singer - [Annette Lee](/wiki/Annette_Lee) – Filmmaker, actress, musician - [Lee Teng](/wiki/Lee_Teng_(actor)) – Television presenter - [Lin Youyi](/wiki/Youyi_(actress)) – Newscaster and corporate trainer - [Michelle Alicia Saram](/wiki/Michelle_Saram) – Actress - [Joanne Peh](/wiki/Joanne_Peh) – Actress, filmmaker and compere - [Rui En](/wiki/Rui_En) – Actress, singer and compere - [Diana Ser](/wiki/Diana_Ser) – Presenter and TV journalist - [Stefanie Sun](/wiki/Stefanie_Sun) – Singer and Songwriter - [Zhang Haijie](/wiki/Zhang_Haijie) – Television presenter and producer ### Sports Medallists - [Dipna Lim Prasad](/wiki/Dipna_Lim_Prasad) – Silver and bronze medallist in sprinting at the SEA Games (2013 to 2017) - [Leslie Kwok](/wiki/Leslie_Kwok) – Bronze medallist in swimming at the SEA Games (1997 - 2005) - [Lee Wung Yew](/wiki/Lee_Wung_Yew) – Multiple medallist in trap shooting at SEA Games (1985 - 2009) - [Tan Cheng Yin Esther](/wiki/Esther_Tan) – First female naval diver and endurance sports specialist; Singapore Women's Hall of Fame - [Wong Wei Long](/wiki/Wei_Long_Wong) – Bronze medallist in basketball at the SEA Games (2013-2015); Gold medallist at SEABA Cup, 2014 - [Yu Mengyu](/wiki/Yu_Mengyu) – Gold medallist in table-tennis at the World Championship, Commonwealth Games, SEA Games (2007 - 2022) ### Community builders - [John Chew](/wiki/John_Chew) – Former 8th Bishop of Singapore ## Notable faculty ### Medicine, science and engineering - [Chen Xiaodong](/wiki/Xiaodong_Chen_(materials_scientist)) – Materials Science and Engineering - [Ernst Kuipers](/wiki/Ernst_Kuipers) – Gastroenterology - [Joseph Sung](/wiki/Joseph_Sung) – Gastroenterology and Hepatology - [Simon Redfern](/wiki/Simon_Redfern) – Mineralogy and Geosciences - [Warren Chan](/wiki/Warren_Chan) – Nanotechnology and Biomedical Engineering ### Business and technology - [Teck-Hua Ho](/wiki/Teck-Hua_Ho) – Behavioral Science, Marketing and Operations Management - [Vijay Sethi](/wiki/Vijay_Sethi) – First [Economist Intelligence Unit](/wiki/Economist_Intelligence_Unit) Business Professor of the Year ### Humanities and social sciences - [Duncan McCargo](/wiki/Duncan_McCargo) – Political Science - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:35:43.634109",
  "title": "Nanyang Technological University",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Nanyang_Technological_University"
}