{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:35:40.332266"
  },
  "content": "Defunct newspaper in Singapore ***Nanyang Siang Pau*** ([Chinese](/wiki/Traditional_Chinese_characters): 南洋商報; [pinyin](/wiki/Pinyin): *Nányáng Shāngbào*; lit. '[Malay Archipelago](/wiki/Malay_Archipelago) Business Paper') was a newspaper in [Singapore](/wiki/Singapore) that was founded by philanthropist-entrepreneur [Tan Kah Kee](/wiki/Tan_Kah_Kee) on 6 September 1923. It had a circulation across the [Straits Settlement](/wiki/Straits_Settlements). The newspaper was the first in Southeast Asia to use the duplex unitubular printing machine that could produce 30,000 to 40,000 copies of 24-page newspapers in three colours. Tan sold the press to his son-in-law, [Lee Kong Chian](/wiki/Lee_Kong_Chian), in August 1932. In 1937, the paper saw an expansion with an influx of funds with Lee as the chairman. His brother, George Lee Geok Eng, joined as the managing director, and businessman [Tan Lark Sye](/wiki/Tan_Lark_Sye) was also on the board of directors. The paper became a morning and evening daily on 20 November 1937. Circulation almost trebled in a year. The paper was critical of the Kuomintang during China's civil war and attracted a left-leaning readership. However, its readership declined during the [Cultural Revolution](/wiki/Cultural_Revolution) as the editor took a critical stand against the movement. As a result, the editor resigned and the paper started placing more emphasis on Chinese affairs. On 2 May 1971, four senior staff of the newspaper (senior columnist [Ly Singko](/wiki/Ly_Singko), general manager Lee Mau Seng, editor-in-chief Shamsuddin Tung Tao Chang, and public relations officer Kerk Loong Sing) were arrested, accused of \"a deliberate campaign to stir up [Chinese racial emotions](/wiki/Han_chauvinism)\". In 1973, the chairman of the paper was detained and released in 1978. The newspaper merged with Singaporean edition of *[Sin Chew Jit Poh](/wiki/Sin_Chew_Jit_Poh_(Singapore))* on 16 March 1983 to form the current ***[Lianhe Zaobao](/wiki/Lianhe_Zaobao)*** and *[Lianhe Wanbao](/wiki/Lianhe_Wanbao)* and has ceased to exist. A version of the newspaper is still in print in [Malaysia](/wiki/Malaysia). - *[Nanyang Siang Pau](/wiki/Nanyang_Siang_Pau)* - Malaysian edition spin-off and former sister publication - [List of newspapers in Singapore](/wiki/List_of_newspapers_in_Singapore) This article related to newspapers in Singapore is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:35:40.331844",
  "title": "Nanyang Siang Pau (Singapore)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Nanyang_Siang_Pau_(Singapore)"
}