{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:35:51.630535"
  },
  "content": "Malaysian performer and composerThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Nasir P. Ramlee\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(December 2020)* *(Learn how and when to remove this message)* **Nasir P. Ramlee** (23 November 1953 – 17 December 2008) was a Malaysian actor, composer, musician and singer. ## Early life Nasir was born in [Singapore](/wiki/Singapore), the son of Malaysian actor [P. Ramlee](/wiki/P._Ramlee) and Junaidah Daeng Harris, whom P. Ramlee married in 1951 and divorced in 1954.[*citation needed*] ## Career Nasir started his career as a musician in a nightclub before he joined EMI as a music composer. After that, he served as coordinator of combo music at the [Istana Budaya](/wiki/Istana_Budaya) (IB) from April 2002. He later teamed up with the late Datuk Ahmad Daud, Normadiah, Aziz Jaafar and Datuk [Aziz Sattar](/wiki/Aziz_Sattar) to form the Panca Sitara band. He had produced songs for Herman Tino, Rosemarie Abdul Hamid and Aman Shah. Among the songs is the popular *Rindu Bayangan* performed by Carefree. During his tenure at the IB, Nasir was much involved with shows that were organized by the government as well as those at an international level, such as events like Suzana 60 and Boney M Live In Kuala Lumpur in 2006. ## Personal life Nasir was married three times. His first wife was Mariati Abdul Rahman and his second wife was Rashidah Jaafar. Both marriages ended in divorce. His third marriage was to Surjangsih Abu Bakar until his demise. He had seven children from his three marriages. His first marriage saw three children, Gunina, Gunawan and Gunarisasca. His second marriage had two daughters, Natasya and Najua, and his third two sons, Zaidi and Zakaria. ## Death He died on 17 December 2008 at the age of 55 due to heart complications and diabetes. He was buried at [Jalan Ampang Muslim Cemetery](/wiki/Jalan_Ampang_Muslim_Cemetery), [Kuala Lumpur](/wiki/Kuala_Lumpur) next to the graves of his late father, [P. Ramlee](/wiki/P._Ramlee) and his two step-mothers, Norizan and [Saloma](/wiki/Salmah_Ismail). ## Filmography ### Film YearTitleRoleNotes1968*Anak Bapak*Jalil1969*Kalau Berpaut Di Dahan Rapuh*1985*[Bujang Lapok Kembali Daa](/wiki/Bujang_Lapok_Kembali_Daa)*Nasir1993*Fantasi*Mr. Rahman2007*[Budak Lapok](/wiki/Budak_Lapok)*Zakaria (voice) ### Television - *Selamat Tinggal Mawarku* (1969) ### Other roles - *Manis-Manis Sayang* (1983) - music - *[Bujang Lapok Kembali Daa](/wiki/Bujang_Lapok_Kembali_Daa)* (1985) - music - *Pagar-Pagar Cinta* (1986) - music ### Other songs - \"Pi Mai Pi Mai Tang Tu\" - \"Melanchong Ke Tanjung\" - [P. Ramlee](/wiki/P._Ramlee) - Nasir P. Ramlee at [IMDb](/wiki/IMDb_(identifier)) - Video of Nasir P. Ramlee funeral on [YouTube](/wiki/YouTube_video_(identifier))\n",
  "language": "en",
  "processed_at": "2026-01-12T11:35:51.630261",
  "title": "Nasir P. Ramlee",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Nasir_P._Ramlee"
}