{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:36:19.263347"
  },
  "content": "July 2005 scandal in Singapore**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article needs to be **updated**. Please help update this article to reflect recent events or newly available information. *(November 2010)*This article may **require cleanup** to meet Wikipedia's quality standards. The specific problem is: **Content copied from [T. T. Durai](/wiki/T._T._Durai) need copyediting and condensation of points. Sections need to be reorganised.** Please help improve this article if you can. *(May 2022)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* The **National Kidney Foundation Singapore scandal**, also known as the **NKF saga**, **NKF scandal**, or **NKF controversy**, was a July 2005 [scandal](/wiki/Scandal) involving [National Kidney Foundation Singapore](/wiki/National_Kidney_Foundation_Singapore) (NKF) following the collapse of a [defamation](/wiki/Defamation) trial which it brought against Susan Long and [Singapore Press Holdings](/wiki/Singapore_Press_Holdings_Limited) (SPH). This sparked significant controversy, causing a massive backlash and fallout of donors to the charity; it then subsequently resulted in the resignation of chief executive officer [T. T. Durai](/wiki/T._T._Durai) and its board of directors. Allegations surrounding the scandal included the false declarations on how long NKF's reserves could last, its number of patients, installation of a golden tap in Durai's private office suite, his salary, use of company cars and [first-class air travel](/wiki/First_class_travel). Former NKF patron [Tan Choo Leng](/wiki/Tan_Choo_Leng), wife of [Senior Minister](/wiki/Senior_Minister_of_Singapore) [Goh Chok Tong](/wiki/Goh_Chok_Tong), sparked further outrage when she remarked that T. T. Durai's pay of \"[S$](/wiki/S$)600,000 a year is peanuts\". President of the National Council of Social Service, [Gerard Ee](/wiki/Gerard_Ee), has since been appointed as interim chairman of the organisation. A full independent audit on its finances was conducted by [KPMG](/wiki/KPMG), and a 442-page report released on 19 December 2005 revealed a host of malpractices by the former NKF board and management. Durai was apprehended on 17 April 2006 and charged under the Prevention of Corruption Act by the [Police](/wiki/Singapore_Police_Force). A S$12 million civil suit to recover funds by the new NKF board against Durai and four other former board members began on 8 January 2007. ## Initial accusations [Singapore in 2005](/wiki/2005_in_Singapore)Events - [117th IOC Session](/wiki/117th_IOC_Session) - [Avian influenza preparedness](/wiki/Singaporean_measures_against_avian_influenza) - [Dengue outbreak](/wiki/2005_dengue_outbreak_in_Singapore) - [Murder of Huang Na](/wiki/Murder_of_Huang_Na) - [Hurricane Katrina relief effort](/wiki/Singaporean_response_to_Hurricane_Katrina) - [Kashmir earthquake relief effort](/wiki/Singaporean_response_to_2005_Kashmir_earthquake) - NKF controversy - [Police MRT Unit established](/wiki/Public_Transport_Security_Command) - [Presidential election](/wiki/2005_Singaporean_presidential_election) - [Execution of Van Tuong Nguyen](/wiki/Van_Tuong_Nguyen) Others - [Counter-terrorism in Singapore](/wiki/Counter-terrorism_in_Singapore) - [Integrated resorts proposal](/wiki/Integrated_resort) - [Singapore Flyer proposal](/wiki/Singapore_Flyer) - v - t - e In August 1997 and December 1998, NKF volunteer Archie Ong and aero-modelling instructor Piragasam Singaravelu, respectively, were hauled to court separately for [defamation](/wiki/Defamation) when both said that T. T. Durai had been [flying first class](/wiki/First_class_travel). The former mentioned in April 1997 that the NKF \"squandered monies\" in a casual conversation with former chairman of NKF's finance committee Alwyn Lim, while the latter made claims that he had personally seen Durai in [Singapore Airlines](/wiki/Singapore_Airlines)' first-class cabin. Both paid an undisclosed amount of damages to the NKF, and apologised. News of the suit affected Ong's cancer-suffering father, who eventually died in hospital. Shortly after the 2005 scandal broke, Ong mentioned to the press that he felt \"fully vindicated now. I had more than a hundred calls today to wish me well.\" In 1999, NKF tracked down and again sought legal action against Tan Kiat Noi, who allegedly circulated an e-mail from her company e-mail on 5 April, claiming that \"the NKF did not help the poor and needy, paid its staff unrealistically high bonuses\" and discouraged members of the public from donating. She later also published a public apology on local broadsheets The Straits Times and Lianhe Zaobao, while paying a total of [S$](/wiki/S$)50,000 in damages. Forty-eight additional workers who forwarded the message were also sued by the organisation, but the suit was later dropped in consideration that they would face possibly extenuating financial circumstances. Days after the 2007 civil suit began, there were calls by the public to redress the grievances of the three abovementioned [whistle-blowers](/wiki/Whistle-blower). In 2001, the [National Council of Social Service](/wiki/National_Council_of_Social_Service) refused to renew the NKF's \"Institution of Public Character\" (IPC) status (which allows it to collect tax-free donations), citing that subsidy figures had been inflated, staff costs had increased by 30% and a \"disproportionate\" amount of money was spent on fundraising. Concerns were first raised by both by the Health Ministry and NCSS two years prior. However, the former decided to intervene in January 2002 and reinstated the NKF's IPC status for a full three years. ## NKF v. SPH ### Allegations in article *[The Straits Times](/wiki/The_Straits_Times)* published an editorial \"*NKF: Controversially ahead of its time?*\" on 19 April 2004, written by senior correspondent Susan Long. This article became the subject of the dispute, and eventually the lawsuit that led to the scandal. Durai and NKF challenged the first six lines of the article, which claimed that a retired contractor (who declined to—and cannot—be named, for fear of being sued) had 'lost it' when he was asked to install \"a glass-panelled shower, a pricey German toilet bowl and a (S$1,000) gold-plated tap\" in Durai's office. The tap was said to have been replaced later with a different material. NKF shortly issued a letter of demand for an apology, retraction, and payment of damages from the paper's publisher, [Singapore Press Holdings](/wiki/Singapore_Press_Holdings_Limited) (SPH), within 24 hours. Four days after the article's publication, NKF and Durai served a writ on Long and SPH for defamation, demanding S$3.24 million in damages. They claimed that the six paragraphs in the article insinuated the mismanagement of donors' funds, that the installations were scaled down only due to the contractor's protests, and that it had avoided providing further details on that matter. ### The proceedings The trial began on 11 July 2005, with Long and SPH represented by [Senior Counsel](/wiki/Senior_Counsel) and [MP](/wiki/Members_of_the_Singapore_Parliament) [Davinder Singh](/wiki/Davinder_Singh_(lawyer)), while NKF and Durai were represented by Senior Counsel Michael Khoo. Under cross-examination, it was revealed that Durai collected a monthly salary of $25,000 and collected a 10-month bonus in 2002 and a 12-month bonus in both 2003 and 2004, for a total of $1.8 million over three years. He had access to a fleet of eight chauffeured cars and the NKF paid the taxes and maintenance costs of his personal Mercedes-Benz. The court was told that the NKF's reserves stood at S$262 million as of July 2003. SPH's lawyer, [Davinder Singh](/wiki/Davinder_Singh_(lawyer)), said during the trial that the NKF had been telling Singaporeans that its reserves would not last more than three years, according to statements made by its officials. He argued that if the NKF stopped all fundraising activities and concentrated on treating kidney patients, it would still have enough money to see through its operations for 30 years, based on its expenses scheduled for 2003. In June 2005, the NKF had told *The Straits Times* that it needed about S$2,600 per month to support each of its 2,000 patients, a total of S$62.4 million per year. The charity cited those figures to bolster its argument that its reserves were not excessive. Based on its expenditure of more than S$60 million a year for [dialysis](/wiki/Kidney_dialysis), the reserves would last three years. However, on 12 July 2005, during the trial, the court was shown how the NKF in fact spent far less on dialysis than the public had been led to believe. According to its 2003 audited financial statement, the NKF spent S$31.6 million that year on dialysis and transplantation. Of that amount, S$22.9 million came from dialysis fees it collected from patients and a further S$1.5 million came from other related income. This meant that the NKF was [out of pocket](/wiki/Out-of-pocket_expense) by only S$7.2 million. Durai initially disagreed with Singh, saying that no-one could be sure patients would continue to pay their share for the treatments. However, he finally agreed that the NKF's assertion that the reserves would last only three years was 'not accurate'. Singh noted that even if the NKF had to foot the entire dialysis bill of $31.6 million a year, its current reserves of S$262 million would last more than eight years. Singh argued that the NKF had overstated its patient numbers, and this would have given the impression to the public that more funds were needed to run its operations. In May 2004, Health Minister [Khaw Boon Wan](/wiki/Khaw_Boon_Wan) informed [Parliament](/wiki/Parliament_of_Singapore) that the NKF had treated 1,414 patients in 1999 and 1,512 patients in 2003. A letter written to *The Straits Times* in April 2004 by Gerard Chuah, the chairman of its Children's Medical Fund board, had claimed that the NKF had 3,000 patients. Singh pointed out the number had been overstated by about 1,000. Durai said he realised there was a mistake only after the letter had been published, but had not corrected it. During cross-examination, Durai admitted that an overestimate had been made and not corrected. When asked why he had done nothing to correct it, Durai said, \"It was an oversight. I did not think it was of material importance. The donor gives us money because of the brand of the NKF and I did not think it was so important at that point of time to correct this error.\" Singh suggested that the number had been inflated to create a false impression of need. In fact, according to Khaw's statement in Parliament, the NKF's \"share\" of kidney patients in Singapore had dropped, from 54% in 1999 to 44% in 2003. Durai was paid a monthly salary of S$25,000 in 2002 and received 10 months' performance bonuses (S$250,000) for that year, making a total of S$550,000 for 2002. He was paid a monthly salary of S$25,000 and received 12 months' performance bonuses (S$300,000), amounting a total of S$600,000 in both 2003 and 2004. He was paid a total of nearly S$1.8 million in three years from 2002 to 2004. These figures were closely guarded secrets until the trial. There were many occasions when he declined a pay rise but was paid the offered increase in salary, backdated to the time he was offered the pay rise, the following year. Singh said that Durai had tried to give the impression in his affidavit that he was being thoughtful when he agreed to come on board as CEO in 1992 for just $12,000 a month even though he had been offered $20,000. The truth, Singh said, was that Durai had agreed to the lower pay in exchange for freedom to earn extra income outside the NKF. Durai testified that his earnings were up to the board of directors to decide, admitting that he was unethical but arguing that he was not to blame for accepting them. NKF volunteer Archie Ong and aero-modelling instructor Piragasam Singaravelu, who claimed that they had seen Durai travelling in first class on airlines while making NKF business trips, were taken to court separately in 1998. Both apologised and paid damages and costs to the NKF after realising they were effectively fighting a losing battle against the unlimited monetary resources of the NKF. The NKF, including chairman Richard Yong, had maintained that senior executives flew business class for long-haul flights. Durai told the court on 11 July 2005 that he did fly first class. For the past two years, he had been entitled to a fare equal to [Singapore Airlines](/wiki/Singapore_Airlines) business class rate—the equivalent of first class on other airlines. Previously, he had paid the difference on his own. It was revealed during the trial that the NKF had a fleet of eight cars with company drivers and Durai was one of six officers who could make use of them at any time. The office cars were also used to transport VIPs and guests of the charity. In his [affidavit](/wiki/Affidavit), Durai said that the office fleet was used by officers who had to visit NKF facilities to attend to the needs of the centres and patients. Durai also had his own [Mercedes-Benz 200](/wiki/Mercedes-Benz_W124) for his personal and family use, and his wife also drove it. However, the NKF paid the car's road tax and picked up the bills for maintenance and repair. Singh questioned Durai on the cars. Durai said that, as CEO, he was entitled to use any of the cars any time he wanted. He also admitted that he had used the office cars for personal use. While Durai worked full-time as CEO of the NKF, he was also a director of a number of other companies. He was paid sums of up to S$25,000 a year by them, over and above his NKF remuneration package. He never told the NKF board about some of these, and did not list these directorships in his [curriculum vitae](/wiki/Curriculum_vitae) (CV). It was also revealed that Durai had a business relationship with Matilda Chua, a one-time employee of the NKF, who left to start her own company. Not only did he invest in her business, but the NKF also gave her telemarketing contracts, and she eventually became a member of the NKF board as well. When Singh produced Durai's CV and asked if it were complete, Durai answered, 'Not exactly.' He disclosed that he had once worked for a company known as Bonyad Marketing Industries, which he described as an Iranian charity, for S$7,000 a month. A December 1995 article in *[The American Spectator](/wiki/The_American_Spectator)* describes Bonyad Marketing Industries as a \"special arms trading company\" that had \"in addition to spare parts for Iran's U.S.-built F-4 and F-5 fighters ... been purchasing large quantities of [Hewlett-Packard](/wiki/Hewlett-Packard) and Sun SparcServer computers for use in Iran.\" Durai said that he was Bonyad's representative in Singapore from 1990 to 1992, but decided to give that up when he became NKF's CEO. Durai admitted that in 2000 he had invested in Chua's company, Global Net Relations, but did not disclose to the NKF board that he was a director of the company. Singh then probed him on the director's fees he had collected while he was working full-time as the NKF's CEO. Durai said he was paid S$25,000 a year each as a director of Amcol Holdings between 1990 and 1996 and an Australian company, Overseas & General, \"for a couple of years\". He also received \"some nominal sum\" as a director of [MediaCorp](/wiki/MediaCorp) TV Channel 12. Singh told him, \"The position is this: While you were expected to be and paid as a full-time CEO, you were earning fees outside NKF which were not disclosed to the NKF or to the public.\" Durai replied, \"That's correct. The NKF board gave me the liberty to do so.\" Singh continued, \"Mr Durai, your CV is yet another illustration of the lack of transparency with which you operate. You do not come clean on what you do, you do not tell the board what you do, how much you earn. You do not tell the board about your commercial relationship with a person who has a contract with the NKF. Is that transparency?\" Durai said, \"They were not very consequential, in my opinion.\" He said it was not necessary for him to disclose to the board and added that the directorships were \"just appearances\". ### Case dropped The case was dropped by Durai at 5 p.m. on the second day of the trial. ## Aftermath ### Public reaction The focus of the scandal turned to the revelation of Durai's S$600,000 pay, which caused widespread feelings of outrage, anger, and betrayal among the general public. Some 3,800 regular donors cancelled their contributions the day after the trial, and NKF's headquarters was vandalised with graffiti. Following questions about Durai's pay, [Tan Choo Leng](/wiki/Tan_Choo_Leng), wife of [Senior Minister](/wiki/Senior_Minister_of_Singapore) (SM) [Goh Chok Tong](/wiki/Goh_Chok_Tong) and patron of the NKF, defended Durai, commenting that \"for a person who runs a big million-dollar charitable organisation, with a few hundred million in reserves, S$600,000 a year is peanuts\", much to the indignation of Singaporeans. The statement was taken as an insult by many, who earn much less a year or even struggle for a living. Blogs and online message boards were quickly flooded with angry comments, and a second online petition requesting Mrs Goh to apologise was started.[*citation needed*] Jokes on the issue were later circulated, in particular, local satirical website [TalkingCock.com](/wiki/TalkingCock.com) published a post featuring a parody 1 peanut bill with a value equivalent to S$600,000. On 16 July 2005, SM Goh said that Mrs Goh regretted the statement. He also said to have explained and shown her several e-mails and letters he had received after the remark was made. In what SM Goh claims to be a separate matter, Mrs Goh has also resigned as patron of the NKF, despite an earlier announcement to remain on the board. ### Government response On 14 July 2005, after a meeting with Health Minister [Khaw Boon Wan](/wiki/Khaw_Boon_Wan), TT Durai and the NKF board resigned en masse. An interim board was appointed by the government to keep the organisation going and begin the task of restoring public confidence. [Gerard Ee](/wiki/Gerard_Ee) was appointed by Khaw as interim chairman to oversee the restructuring of the NKF, and Goh Chee Leok took over the post as interim CEO. ### Independent investigation In July 2005, [KPMG](/wiki/KPMG) was commissioned by the new NKF board to study past practices. KPMG published its report in December 2005, with key findings including: - The Board delegated its authority to the Executive Committee, and the Executive Committee in turn delegated its authority to Durai. - NKF awarded contracts worth $3 million to Forte Systems and $4 million to Protonweb, second one run by Pharis Aboobacker, a close friend of Durai. Neither project was successfully completed, but no action was taken against the companies. In KPMG's judgment, the terms of the contracts were \"unusual\" and the ExCo's disregard of the lack of performance was \"extraordinary\". - In 1995, Durai's pay was increased from S$12,000 to S$18,000. The promotion was backdated six months, so he received another S$36,000. On top of that, Durai received a S$30,000 bonus \"top-up\" based on the revised salary. - In 1997, Durai was offered a salary of S$30,000 a month but he chose to accept only S$25,000, a S$7,000 increase over his previous wage. The increment was backdated 11 months, amounting to an extra S$77,000. - From September 1997 to October 2003, his overtime pay amounted to S$187,000. - From May 1995 to November 2003, he encashed his leave entitlement brought in another S$350,000. - In 2003, only ten cents out of every dollar raised were used for dialysis costs. In its 2004 annual report, NKF had claimed that 52 cents out of every dollar went to its beneficiaries. - In 2004, Durai chalked up an average bill of S$32,952 per month on his corporate credit card. - In 2004, S$70,000 was spent on a \"study trip\" to [Las Vegas](/wiki/Las_Vegas) for six of NKF's staff, including Durai, to get fresh ideas on doing charity shows. - In 2004, S$430,000 on movie and concert tickets were given free to \"nurture\" donors. - Staff received pay increments as often as four times a year. Former director Matilda Chua's salary rose from S$1,300 to S$12,500 over nine years. - Staff were given exit payments of up to 10 months' salary. - Durai used NKF funds to pay bills relating to his wife's Mercedes, including paying for petrol and repairing the car. - In 2004, the NKF made a surplus of S$993,677 from drug sales. Although the NKF claimed it helped its patients save over S$3.5 million in treatment costs, it had charged its patients a premium for certain discounted drugs, instead of passing the savings on to them. ### Civil suit against the old NKF board In April 2006, law firm [Allen & Gledhill](/wiki/Allen_%26_Gledhill) was engaged by the new NKF board to investigate past transactions that occurred under the former board and Durai's management. The new board eventually filed a civil lawsuit against Durai, Durai's business associates and three former board members (chairman Richard Yong, treasurer Loo Say San, board member Matilda Chua) to recover monies amounting to S$12 million in salaries, benefits and failed contracts. The suit included legal fees incurred during the NKF defamation suit against SPH and loss of donations from donors after the scandal. The suit was heard on 8 January 2007 and on the second day of the trial, Durai conceded to all the claims made by NKF. However, the decision by the other defendants to continue will have implications to other equally liable directors and third parties (Alwyn Lim, Lawrence Chia, Kweh Soon Han and Chow Kok Fong). The result of Durai conceding will make the trial shorter rather than an expected eight-week trial. ### Criminal suits Durai was arrested on 17 April 2006. He was out on bail, but will stand for trial with other members of the old National Kidney Foundation board of directors. He has also agreed to pay back S$4 million to the new NKF and was sentenced to 3 months' jail for misleading NKF by fabricating a $20,000 invoice. Richard Yong (the former chairman), Mathilda Chua (ex-director) and Loo Say San (ex-treasurer) all declared bankrupt on 16 May 2007. After selling personal properties worth $7.5 million, the former left Singapore without permission early on the morning of 17 May but was apprehended on 4 July 2007 in Hong Kong and extradited back to Singapore on 3 August 2007 where he was charged the next day for charges that the NKF levied on him as well as his flight (or fleeing) from Singapore hours before being declared a bankrupt. Yong said that he had left to settle some personal matters. Yong was sentenced to 15 months in jail for the three charges. Five separate charges were taken into consideration during the sentencing. His sentence will commence from the day that he was extradited back to Singapore. Yong has said that he plans to appeal, but lost the appeal and had to serve out his sentence. However, he was given permission to serve half of his jail term (five months) at home on an electronic tag. ### Long-term consequences The scandal has raised questions about the level of [transparency](/wiki/Transparency_(humanities)) in other institutions in Singapore. Opposition politicians, notably [Chee Soon Juan](/wiki/Chee_Soon_Juan), have noted that the issues at NKF would probably not have been revealed had T. T. Durai not sued the *Straits Times*. Four people linked to the [Singapore Democratic Party](/wiki/Singapore_Democratic_Party) held a silent demonstration outside the [Central Provident Fund](/wiki/Central_Provident_Fund) (CPF) headquarters in July 2005, wearing T-shirts emblazoned with \"GIC HDB NKF CPF Transparency now!\", thus demanding greater transparency from the [Government Investment Corporation](/wiki/Government_of_Singapore_Investment_Corporation) (GIC), the [Housing Development Board](/wiki/Housing_Development_Board) (HDB) and the CPF. The protesters were arrested but later dismissed without charges, with their own countersuit for [unlawful detention](/wiki/Unlawful_detention) dismissed with costs.[*citation needed*] On 21 April 2006, [Chee Soon Juan](/wiki/Chee_Soon_Juan) and 12 other defendants were sued for defamation for questioning the government's handling of the NKF scandal in the [Singapore Democratic Party](/wiki/Singapore_Democratic_Party)'s newsletter *The New Democrat*. Eunice Tay turned over the reins to her then-chief operating officer Edmund Kwok in 2013, after steering the NKF into calmer seas. ## In popular culture *[Phua Chu Kang The Movie](/wiki/Phua_Chu_Kang_The_Movie)* featured the main antagonist Lim Lau Pek, owner of an old folks' home, who uses the majority of phone-in donations on lavish personal expenditure. - [Chilling effect](/wiki/Chilling_effect) - [List of corporate collapses and scandals](/wiki/List_of_corporate_collapses_and_scandals) - [Accounting scandals](/wiki/Accounting_scandals) - [Streisand effect](/wiki/Streisand_effect) - The full chronology of events - KPMG's independent audit report into old NKFS (PDF document, 4.4MB)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:36:19.262965",
  "title": "National Kidney Foundation Singapore scandal",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/National_Kidney_Foundation_Singapore_scandal"
}