{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:36:15.228529"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"National Institute of Education\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(August 2015)* *(Learn how and when to remove this message)* 1°20′57″N 103°40′41″E﻿ / ﻿1.3492301°N 103.678124°E﻿ / 1.3492301; 103.678124 Educational institute in Singapore The **National Institute of Education** (**NIE**) is an autonomous institute of [Nanyang Technological University](/wiki/Nanyang_Technological_University) (NTU) in Singapore. Ranked 10th in the world and 2nd in Asia by the QS World University Rankings in the subject of Education and Training in 2024, the institute is the sole teacher education institute for teachers in Singapore. The institute was first established as the Teachers' Training College in 1950. NIE provides all levels of teacher education, ranging from initial teacher preparation, to graduate and in-service programmes, and courses for serving teachers, department heads, vice-principals and principals. Its enrolment stands at more than 5,600 full-time equivalent students. ## History In 1950, the Teachers' Training College (TTC) was established as a [normal school](/wiki/Normal_school) to meet the need for teachers in Singapore. Between 1950 and 1971, the role of producing teachers was shared by the TTC and the School of Education at the [University of Malaya](/wiki/University_of_Malaya) (predecessor of the [University of Singapore](/wiki/University_of_Singapore)). TTC entered a new relationship with the University of Singapore in 1971, and resulted in the establishment of IE (Institute of Education) in 1973. The College of Physical Education (CPE) was set up in 1984 by IE to train specialist teachers in Physical Education. In 1991, IE and CPE merged to form the National Institute of Education. They occupied the campus at Bukit Timah Road, before moving to the main campus of the Nanyang Technological University in 2000. ## Programmes NIE is organised into Programme Offices with 10 supporting Academic Groups. The Office of [Teacher Education](/wiki/Teacher_Education) administers the initial teacher preparation programmes, leading to diploma, degree and postgraduate diploma qualifications, to equip student teachers with the knowledge to lead in the service of learners. The Office of Graduate Studies and Professional Learning offers master's and doctoral degrees. The office also delivers in-service and leadership programmes to enhance the career pathways of serving teachers and educators. The External Programmes Office was set up in October 2005 to act as an educational consultancy to meet the bespoke training requirements of local and international clients. In July 2009, this Office was renamed as NIE International, a private company and a subsidiary of NIE/NTU. ## Research NIE established the Centre for Research in Pedagogy and Practice in 2002 with funding from the Ministry of Education (MOE). As the largest education research centre in the Asia Pacific, the centre sits in the Office of Educational Research. It brings together researchers, educators and administrators research in and to develop new and innovative ways of teaching and learning. In January 2005, NIE established the Learning Sciences Lab which is now part of the Office of Educational Research. The Lab aims to lead and transform pedagogy enabled by ICT in teaching and learning in Singapore schools. From a research base, findings and good ideas are conceptualised and applied in learning processes so that these are effectively implemented in the schools. ## International recognition QS World University Rankings by Subject of Education 2024 published by [Quacquarelli Symonds](/wiki/Quacquarelli_Symonds) ranked NIE 10th in the world and 2nd in Asia. One of NIE's executive programmes, the Leaders in Education Programme (LEP), has attracted international attention. The six-month programme prepares senior education officers for principalship. NIE received endorsement of its five-year strategic plan by an MOE-appointed International Advisory Panel, comprising academics from overseas universities, in August 2007. Additionally, Singapore's education system and teacher education programmes were ranked among the world's best in a report by McKinsey and Company in September 2007. ## Student clubs The NTUSU consists of 16 constituent bodies, of which the NIE Student Teachers' Club is one. Only student teachers who are members of the NTUSU are eligible for full membership of the NIE Student Teachers' Club. Student teachers of NIE other than those defined under ordinary membership and students from other schools in NTU may apply for affiliate membership subject to the approval of the Management Committee and recommendation of the Advisor of the club. The main role of the NIE Student Teachers' Club is to promote and safeguard the interests and welfare of student teachers in NIE, as encapsulated by its vision *To Serve, to Provide, and Unite.* The Club achieves this by: promoting vibrancy on campus for a safe and lively environment that student-teachers feel at home in; organising events that lend a sense of vibrancy and active student life; and refining initiatives that care for the needs and wants of student-teachers in NIE. The club also functions as the core vessel of communication between the students, subsidiary clubs, and NTU-NIE administration. Regardless of race, language, religion, and other lines of divide, the TTC takes pride in upholding equal treatment and equality for all student-teachers in NIE. The NIE Student Teachers' Club comprises the following sub-clubs and societies: - Chinese Language Education and Research (CLEAR) Club - Club ArNex - Club Jeux - Club Sci·napse - DanceFuzion (DF) - Deixus - Food and Consumer Sciences (FCS) Club - Malay Language & Cultural Society (MLCS), NTU - Physical Education and Sports Science (PESS) Club - Service Learning Club (SLC) - Tamil Language Club (TLC) - Visual and Performing Arts (VPA) Club - Graduate Student Club (GSC) Together with its sub-clubs and societies, the NIE Student Teachers' Club organises a range of social, sports, cultural and educational activities for all student teachers. - National Institute of Education Official website. - NIE Portal Student Portal for news, announcements, content and online services. - IN-Learning NIE Centre for Innovation in Learning - Trainee Teachers' Club A main student club of NIE - Webometrics Ranking of World Universities\n",
  "language": "en",
  "processed_at": "2026-01-12T11:36:15.228011",
  "title": "National Institute of Education",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/National_Institute_of_Education"
}