{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:36:38.874985"
  },
  "content": "Public research university in Queenstown, Singapore‹ The template *Infobox university* is being considered for merging. › The **National University of Singapore** (**NUS**) is a [national](/wiki/National_university) [public](/wiki/Public_university) [research university](/wiki/Research_university) in [Singapore](/wiki/Singapore). It was officially established in 1980 through the government-directed merger of the public University of Singapore and the private [Nanyang University](/wiki/Nanyang_University). The university offers degree programmes in disciplines at both the undergraduate and postgraduate levels, including in the sciences, medicine and dentistry, design and environment, law, arts and social sciences, engineering, business, computing, and music. NUS's main campus is located adjacent to the [Kent Ridge](/wiki/Kent_Ridge) subzone of [Queenstown](/wiki/Queenstown,_Singapore). The [Duke–NUS Medical School](/wiki/Duke%E2%80%93NUS_Medical_School) is located at the [Outram](/wiki/Outram,_Singapore) campus. The [Bukit Timah](/wiki/Bukit_Timah) campus houses the [Faculty of Law](/wiki/National_University_of_Singapore_Faculty_of_Law) and [Lee Kuan Yew School of Public Policy](/wiki/Lee_Kuan_Yew_School_of_Public_Policy). NUS's affiliated faculty members and researchers include one [Nobel Prize](/wiki/Nobel_Prize) laureate, one [Tang Prize](/wiki/Tang_Prize) laureate, and one [Vautrin Lud](/wiki/Vautrin_Lud_Prize) laureate. ## History In September 1904, [Tan Jiak Kim](/wiki/Tan_Jiak_Kim) led a group of representatives of the Chinese and other non-European communities to petition the [governor of the Straits Settlements](/wiki/Governor_of_the_Straits_Settlements), [Sir John Anderson](/wiki/John_Anderson_(colonial_administrator)), to establish a medical school in Singapore. It was noted by Anderson that there were other petitions prior which were not successful due to concerns over having a sufficient number of students and support from the local community. Tan, who was the first president of the Straits Chinese British Association, managed to raise 87,077 [Straits dollars](/wiki/Straits_dollars) from the community, including a personal donation of $12,000. On 3 July 1905, the medical school was founded and was known as the *Straits Settlements and Federated Malay States Government Medical School*. At Anderson's directions, the school was hosted temporarily at a recently emptied block at a Government-run asylum in Pasir Panjang while providing the staff required to run the school. In 1912, the medical school received an endowment of $120,000 from the [King Edward VII](/wiki/King_Edward_VII) Memorial Fund, started by physician [Lim Boon Keng](/wiki/Lim_Boon_Keng). Subsequently, on 18 November 1913, the name of the school was changed to *[King Edward VII Medical School](/wiki/Yong_Loo_Lin_School_of_Medicine)*. In 1921, it was again changed to *King Edward VII College of Medicine* to reflect its academic status. In 1928, Raffles College, a separate institution from the medical school, was established to promote education in arts and social sciences. ### University of Malaya in Singapore (1949–1962) On 8 October 1949, Raffles College was merged with King Edward VII College of Medicine to form the [University of Malaya](/wiki/University_of_Malaya). The two institutions were merged to provide for the higher education needs of the [Federation of Malaya](/wiki/Federation_of_Malaya). The growth of University of Malaya was very rapid during the first decade of its establishment and resulted in the setting up of two autonomous divisions in 1959, one located in Singapore and the other in [Kuala Lumpur](/wiki/Kuala_Lumpur). ### Nanyang University (1955–1980) In 1955, [Nanyang University](/wiki/Nanyang_University) (abbreviated Nan-tah, 南大) was established on the backdrop of the Chinese community in Singapore. ### University of Singapore (1962–1980) In 1960, the governments of then Federation of Malaya and Singapore indicated their desire to change the status of the divisions into that of a national university. Legislation was passed in 1961, establishing the former Kuala Lumpur division as the University of Malaya, while the Singapore division was renamed the University of Singapore on 1 January 1962. ### Present form The National University of Singapore (NUS) was formed with the merger of the University of Singapore and [Nanyang University](/wiki/Nanyang_University) on 6 August 1980. This was done in part due to the government's desire to pool the two institutions' resources into a single, stronger entity and promote English as Singapore's main language of education. The original crest of Nanyang University with three intertwined rings was incorporated into the new coat-of-arms of NUS. Most departments of the university were situated at the Bukit Timah campus, with the gradual shift to the Kent Ridge site starting in 1969 and completed in 1986. NUS began its entrepreneurial education endeavours in the 1980s, with the setting up of the Centre for Management of Innovation and Technopreneurship in 1988. In 2001, this was renamed the NUS Entrepreneurship Centre (NEC), and became a division of NUS Enterprise. NEC is currently headed by Wong Poh Kam and its activities are organised into four areas, including a business incubator, experiential education, entrepreneurship development and entrepreneurship research. NUS has 17 faculties and schools across three campus locations in Singapore – Kent Ridge, Bukit Timah and Outram. NUS also collaborates with many other universities around the world, such as [Harvard University](/wiki/Harvard_University), [Yale University](/wiki/Yale_University), [UCLA](/wiki/University_of_California,_Los_Angeles), and [Georgia Institute of Technology](/wiki/Georgia_Tech). NUS has a diverse range of students and faculty stemming from distinct foreign nationalities. 65% of faculty and staff are foreign nationals, ranking it 3rd (tied with Nanyang Technological University) in terms of foreign representation among faculty across the top 100 universities according to QS. It remains one of the few top 100 universities with more than 60% of foreign faculty. Likewise, 36% or 12,057 of students are foreign nationals, with 62% them being post-graduate students. In 2025, NUS celebrated several milestones. The university commemorated its 120th anniversary, together with the Yong Loo Lin School of Medicine. NUS Engineering celebrated its 70th anniversary, while the Duke-NUS Medical School and the NUS High School marked their 20th anniversary. For its 120th anniversary, NUS organised a year-long lineup of events including a Distinguished Speaker Series, gathering experts from around the world to talk about pressing issues of the future. Notable speakers included AI experts Professors Yann LeCun and Yoshua Bengio. ## Coat of arms The coat of arms of the National University of Singapore was adopted in 1980 and modernized in 2001. It is the combination of the coat of arms of the former University of Singapore used since 1962 (consisting of an open book and a lion, which itself was derived from the former coat of arms of the University of Malaya used from 1949 until 1962, which featured a tiger instead of a lion), and the emblem of the former Nanyang University, three interlocking rings but without the star used since 1955. It is [blazoned](/wiki/Blazon): > Argent a lion passant guardant proper; on a chief azure dexter an open book also proper, bound, edged and clasped Or and sinister three annulets interlaced one and two Argent. The lion represents NUS as a Singaporean university, the open book represents knowledge and the three rings represents the university's role in creating, imparting and applying knowledge, as well as creativity, innovation and entrepreneurship. The National University of Singapore is one of two public universities in Singapore to adopt its coat of arms, alongside the [Nanyang Technological University](/wiki/Nanyang_Technological_University), with which it has relations. ## Reputation and rankings ### Overall rankings Globally, NUS was #8 in the [QS World University Rankings](/wiki/QS_World_University_Rankings) 2026, #17 in the [Times Higher Education (THE) World University Rankings](/wiki/Times_Higher_Education_World_University_Rankings) 2025, #22 in the [USNWR](/wiki/U.S._News_%26_World_Report) 2024–2025 Best Global Universities Rankings, #68 in the [Academic Ranking of World Universities (ARWU)](/wiki/Academic_Ranking_of_World_Universities) 2024, #25 in the [SCImago Institutions Rankings](/wiki/SCImago_Institutions_Rankings) 2024, and #26 in the Informatics Institute/[METU](/wiki/Middle_East_Technical_University)'s [University Ranking by Academic Performance (URAP)](/wiki/University_Ranking_by_Academic_Performance) 2022–2023. NUS was the 24th best-ranked university worldwide in terms of aggregate performance across THE, QS, and ARWU, as reported by ARTU 2024. QS has ranked NUS among the world's top 15 since 2016. THE has ranked NUS among the world's top 30 since 2013. The joint [THE–QS World University Rankings](/wiki/Times_Higher_Education%E2%80%93QS_World_University_Rankings) from 2004 to 2009 ranked NUS globally 18th (2004), 22nd (2005), 19th (2006), 33rd (2007), 30th (2008 and 2009). NUS was 19th in the THE World Reputation Rankings 2025, and was named the world's 10th most international university by THE in 2023. The World's Top 2% Scientists by Stanford University features numerous NUS researchers from a wide range of disciplines. ### Subject/area rankings In the 2024 QS World University Rankings by Subject, NUS ranked among the global top 10 for 19 subjects. In the 2024 QS Global Executive MBA Rankings, NUS ranked 14th globally. In the 2025 QS Global MBA Rankings, NUS ranked 25th globally. In the 2024 Times Higher Education (THE) World University Rankings by Subject, NUS achieved high global ranks in several subjects, being ranked 11th in Computer Science, 9th in Engineering, 11th in Law, and 15th in Business & Economics. In all subjects, NUS held the top spot nationally. In the 2023 Academic Ranking of World Universities (ARWU) Global Ranking of Academic Subjects, NUS exhibited strong global standing, being ranked among the global top 30 in 22 subjects. In most subjects, NUS achieved a national rank of 1. [QS](/wiki/QS_World_University_Rankings) World University Rankings by Subject 2024 SubjectGlobalNationalArts & Humanities 37 1Linguistics 9 1Archaeology 48 1Architecture and Built Environment 5 1Art and Design =33 1–2Classics and Ancient History 38 1English Language and Literature 16 1History 11 1Art History 2 1Modern Languages =19 1Performing Arts 41 1Philosophy 34 1Engineering and Technology =13 1Engineering – Chemical 5 1Engineering – Civil and Structural 4 1Computer Science and Information Systems 6 1Data Science and Artificial Intelligence 6 1Engineering – Electrical and Electronic 6 1Engineering – Mechanical =7 1Engineering – Mineral and Mining =17 1Life Sciences & Medicine =31 1Anatomy and Physiology 16 1Biological Sciences 16 1Dentistry 30 1Medicine =18 1Nursing 20 1Pharmacy and Pharmacology 14 1Psychology 18 1Natural Sciences 29 1Chemistry 7 1Environmental Sciences 9 1Geography 6 1Materials Sciences 8 2Mathematics 10 1Physics and Astronomy 17 1Social Sciences & Management 14 1Accounting and Finance 14 1Anthropology 13 1Business and Management Studies 10 1Communication and Media Studies 24 2Development Studies 9 1Economics and Econometrics 17 1Law and Legal Studies =12 1Marketing 8 1Politics 11 1Social Policy and Administration 6 1Sociology 14 1Sports–Related Subjects =25 1Statistics and Operational Research =10 1[THE](/wiki/Times_Higher_Education_World_University_Rankings) World University Rankings by Subject 2024 SubjectGlobalNationalArts & humanities 26 1Business & economics 15 1Clinical & health =16 1Computer science 11 1Engineering 9 1Law 11 1Life sciences 22 1Physical sciences =12 1Psychology =64 1Social sciences 16 1[ARWU](/wiki/Academic_Ranking_of_World_Universities) Global Ranking of Academic Subjects 2023 SubjectGlobalNationalNatural SciencesMathematics 76–100 1Physics 76–100 1–2Chemistry 22 2Earth Sciences 201–300 2Geography 8 1Ecology 76–100 1Oceanography 101–150 1Atmospheric Science 151–200 1EngineeringMechanical Engineering 44 2Electrical & Electronic Engineering 17 2Automation & Control 49 2Telecommunication Engineering 16 2Instruments Science & Technology 37 2Biomedical Engineering 11 1Computer Science & Engineering 12 2Civil Engineering 20 1Chemical Engineering 23 1Materials Science & Engineering 13 2Nanoscience & Nanotechnology 7 2Energy Science & Engineering 19 2Environmental Science & Engineering 51–75 1–2Water Resources 51–75 1–2Food Science & Technology 17 1Biotechnology 27 1Aerospace Engineering 29 1Marine/Ocean Engineering 24 1Transportation Science & Technology 16 2Remote Sensing 51–75 1Metallurgical Engineering 76–100 2Life SciencesBiological Sciences 51–75 1Human Biological Sciences 51–75 1Agricultural Sciences 301–400 1Medical SciencesClinical Medicine 51–75 1Public Health 33 1Dentistry & Oral Sciences 51–75 1Nursing 11 1Medical Technology 101–150 1Pharmacy & Pharmaceutical Sciences 21 1Social SciencesEconomics 24 1Statistics 20 1Law 151–200 1Political Sciences 101–150 1Sociology 51–75 1Education 151–200 2Communication 41 2Psychology 76–100 1Business Administration 51–75 1Finance 51–75 2–3Management 2 1Public Administration 27 1Hospitality & Tourism Management 201–300 2Library & Information Science 11 1 NUS's performance in the Business School Rankings by Financial Times: FT SubjectYearNUS's world rankRanked EntityEMBA202211UCLA: Anderson/National University of SingaporeEMBA202224National University of Singapore Business SchoolMBA202221National University of Singapore Business School ### Graduate employability rankings NUS graduates ranked 8th worldwide in the Times Higher Education's Global University Employability Ranking 2022, and 17th worldwide in the QS Graduate Employability Rankings 2022. ## Academic structure NUS has a semester-based modular system for conducting undergraduate courses. It adopts features of the British system, such as [small group](/wiki/Communication_in_small_groups) teaching ([tutorials](/wiki/Tutorial)) on top of regular two-hour lectures, and the American system ([course credits](/wiki/Course_credit)). NUS has 17 faculties and schools across three campuses, including a music conservatory. ### University Scholars Programme The University Scholars Programme (USP) was an undergraduate academic programme established in 2001 in NUS, which comprised a compulsory general education programme. USP admitted 240 undergraduates annually. USP students resided in Cinnamon College at the NUS University Town. This programme has since merged with [Yale-NUS](/wiki/Yale-NUS_College) to become the NUS College. ### NUS College A modernized version of the University Scholars Programme, the NUS College today serves as the university's [honors college](/wiki/Honors_college), with a more rigorous application and a focus on global citizenship. The NUS College program notably involves foreign, service-based exchange around South-East Asia, guided by their core ideal that \"Learning is a contact sport.\" ## Faculties and schools ### Business The NUS Business School was founded as the Department of Business Administration in 1965. Today, the school has over 280 faculty members and 7,000 students. ### Computing The School of Computing established in 1998, has two departments: Computer Science; and Information Systems and Analytics. ### Dentistry The Faculty of Dentistry traces its origins in 1929 as a Department of Dentistry within the King Edward VII College of Medicine. The faculty conducts a four-year dental course leading to a [Bachelor of Dental Surgery](/wiki/Bachelor_of_Dental_Surgery) degree. ### Design and Engineering The interdisciplinary College of Design and Engineering (CDE) was established in 2021, bringing together two pre-existing faculties, the School of Design and Environment (SDE) and the Faculty of Engineering (FoE). The School of Design and Environment has three departments: Department of Architecture; Department of the Built Environment; and the Division of Industrial Design. The Faculty of Engineering was established in 1968. It is the largest faculty in the university, and consists of several departments spanning diverse engineering fields. ### Humanities and Sciences The interdisciplinary College of Humanities and Sciences (CHS) was established in 2020. It comprises the two largest faculties, the Faculty of Arts and Social Sciences, and the Faculty of Science, though both faculties are still branded independently, unlike CDE. The Faculty of Arts and Social Sciences has roots in Raffles College. Initially offering just four subjects: English, History, Geography and Economics, the Faculty now offers majors, minors and special programmes across 16 Departments. This includes the Centre for Language Studies, which teaches 13 different languages, and the Office of Programmes, which houses multidisciplinary fields and minor programmes. The South Asian Studies Programme is not officially classified as a department, but as a departmental entity. The Faculty of Science comprises multiple departments, spanning across natural and applied sciences. The first female Dean of the Faculty of Science was [Gloria Lim](/wiki/Gloria_Lim), who was appointed in 1973. She served a four-year term and was reappointed in 1979, but resigned after one year to allow [Koh Lip Lin](/wiki/Koh_Lip_Lin) to continue his post. In 1980, University of Singapore merged with [Nanyang University](/wiki/Nanyang_University) to form NUS, resulting in overlapping posts. ### Integrative Sciences and Engineering The NUS Graduate School for Integrative Sciences and Engineering (NGS) was established in 2003. The principal purpose of NGS is \"to promote integrative PhD research encompassing both laboratory work and coursework programmes which not only transcend traditional subject boundaries but also provides students with a depth of experience about science and the way it is carried out.\" ### Law The NUS Faculty of Law was first established as a Department of Law in the University of Malaya in 1956. The first law students were admitted to the Bukit Timah campus of the university the following year. In 1980, the faculty shifted to the Kent Ridge campus, but in 2006 it relocated back to the Bukit Timah site. The faculty will be relocated to the Kent Ridge campus at the start of 2026, sharing the former Yale-NUS campus with NUS College. The faculty offers LLB, LLM, JD, and PhD programmes, alongside continuing education and graduate certificate programmes. ### Medicine The Yong Loo Lin School of Medicine at NUS was first established as the Straits Settlements and Federated Malay States Government Medical School in 1905. The School uses the British undergraduate medical system, offering a full-time undergraduate programme leading to a [Bachelor of Medicine and Bachelor of Surgery](/wiki/Bachelor_of_Medicine_and_Bachelor_of_Surgery) (MBBS). For Nursing, the Bachelor of Science (Nursing) conducted by the Alice Lee Centre for Nursing Studies is offered. The department also offers postgraduate programmes in nursing, medicine, and medical science. ### Duke–NUS Medical School The Duke–NUS Medical School (Duke–NUS) is a graduate medical school in Singapore. The school was set up in April 2005 as the Duke–NUS Graduate Medical School, Singapore's second medical school, after the [Yong Loo Lin School of Medicine](/wiki/Yong_Loo_Lin_School_of_Medicine), and before the [Lee Kong Chian School of Medicine](/wiki/Lee_Kong_Chian_School_of_Medicine). The Duke–NUS Medical School is a collaboration between [Duke University](/wiki/Duke_University) in North Carolina, United States and the National University of Singapore. ### Music The Yong Siew Toh Conservatory of Music (YSTCM) is a collaboration between NUS and the [Peabody Institute](/wiki/Peabody_Institute) of [Johns Hopkins University](/wiki/Johns_Hopkins_University). Singapore's first conservatory of music, YSTCM was founded as the Singapore Conservatory of Music in 2001. The School was renamed Yong Siew Toh Conservatory of Music after a gift was made by the family of the late Dr Yong Loo Lin in memory of his daughter. ### Public health The Saw Swee Hock School of Public Health is Singapore's first and only tertiary education institution for public health. The school traces its origins to the University of Malaya's Department of Social Medicine and Public Health, formed in 1948. The School of Public health also hosts the [Asia Centre for Health Security](/wiki/Asia_Centre_for_Health_Security). ### Public Policy The Lee Kuan Yew School of Public Policy was established in 2004 as an autonomous graduate school of NUS. Although the School was formally launched in 2004, it inherited NUS's Public Policy Programme, which was established in 1992 in partnership with [Harvard University](/wiki/Harvard_University)'s [Kennedy School of Government](/wiki/Harvard_Kennedy_School). ### Yale-NUS College The Yale-NUS College was a [liberal arts college](/wiki/Liberal_arts_college) in Singapore established in August 2013 as a joint project of [Yale University](/wiki/Yale_University) and the National University of Singapore. It was an autonomous college within NUS, allowing it greater freedom to develop its own policies while tapping on the existing facilities and resources of the main university. Students who graduated received a degree awarded by NUS. [Pericles Lewis](/wiki/Pericles_Lewis), a former professor at Yale, was appointed as the founding president in 2012. In August 2021, NUS announced that it was going to merge Yale-NUS College with the University Scholars Programme to form a new honours college, NUS College, by 2025. The merger marked the dissolution of NUS' partnership with Yale University. The last class of Yale-NUS College students were admitted in 2021, following which Yale-NUS operated until 2025. ## Teaching centres NUS has a variety of teaching centres including: - Centre for Development of Teaching and Learning (CDTL) - Centre for Instructional Technology (CIT) - Centre for English Language Communication (CELC) - [Institute of Systems Science](/wiki/Institute_of_Systems_Science) (ISS), which offers professional IT continuing education - Centre for Teaching and Learning CTL at Yale-NUS College ### NUS High School of Mathematics and Science\n",
  "language": "en",
  "processed_at": "2026-01-12T11:36:38.874643",
  "title": "National University of Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/National_University_of_Singapore"
}