{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:36:33.564092"
  },
  "content": "* *This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **is an orphan, as no other articles link to it**. Please introduce links to this page from related articles. *(December 2025)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"National Robotics Competition\" Singapore – news **·** newspapers **·** books **·** scholar **·** JSTOR *(October 2010)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* **National Robotics Competition (NRC)** is a robotics competition jointly organised by [Singapore Science Centre](/wiki/Science_Centre,_Singapore) and Duck Learning Education, with support from the [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)) and the [Agency for Science, Technology and Research](/wiki/Agency_for_Science,_Technology_and_Research). It aims to help nurture a new generation of youths with interest in Science, Technology, Engineering and Mathematics (STEM) to aspire in improving the lives of people, and encourages students to develop [problem solving](/wiki/Problem_solving) skills, entrepreneurial skills, creative thinking skills and team spirit. ## History National Robotics Competition was first organised in 1999 as National Junior Robotics Competition (NJRC) with 167 teams from 70 schools. In the competition, teams of not more than 5 students build a robot using the [Lego Mindstorms](/wiki/Lego_Mindstorms) robotics system. Competitors are divided into three categories: Upper Primary Division, for Primary 3 to Primary 6 students, Secondary Division for secondary or equivalent level, and Tertiary Division, for 1st and 2nd year ITE/JC/Poly students. In 2007, 13 schools participated in the competition, sending a total of 37 teams. In 2016, a holistic review is made to the competition following an announcement during the closing ceremony of the competition that year. NJRC was officially renamed as National Robotics Competition (NRC) in 2017. An additional category for children aged six to eight years is added, along with other new elements such as the robotic arm [hackathon](/wiki/Hackathon). ## National Junior Robotics Competition milestones This section **does not cite any sources**. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed. *(June 2017)* *(Learn how and when to remove this message)* ### 2024 - Woodlands Ring Secondary School won the Overall Championship (Secondary, Team Mavericks, Team S147) despite not winning any other awards. ### 2023 - Rulang Primary School won the Overall Championship (Upper Primary, team KCZ comprising Chee Yan Luck and Zheng Kaixin), Best Robot Performance Award (1st, Upper Primary, team KCZ), Best Research Award (2nd, Lower Primary, team CMY comprising Chee Yan Kai and Meng Yuan) and Best Engineering Design Award (3rd, Lower Primary, team CMY). - The champion from Rulang Primary School proceeded to represent Singapore, and also won the championship (Upper Primary, team KCZ) in the Global Robotics Games held in Singapore from 15 to 17 Nov 2023. ### 2022 - Raffles Girls' School won the Championship in the Secondary (Junior High) Category for the first time, also winning the Best Presentation Award (1st) and Best Content Award (1st and 2nd). - Raffles Institution won the Championship in the Tertiary (Senior High) Category for the second time, also winning the Judges Award (Best Learning Journey), Best Presentation Award (3rd), Best Content Award (1st and 2nd), and Best Robot Performance Award (1st, 2nd). ### 2017 - The introduction of the Robot Arm Category, won by Raffles Girls' School ### 2015 - Raffles Institution won the championship in the Tertiary category for the first time, also winning the Best Programming Award (1st), Best Research Award (1st), Best Presentation (2nd) and Best Journal (2nd). ### 2013 - Mission for primary school requires the use of colour sensor. - Missions are similar to challenges in WRO 2013 - Surprise mission in primary school preliminaries day 1 needs two colour sensors; one for detecting colour of cubes, one for detecting colour of bins (which was decided through throwing of dice) - Nan Hua Primary School won the championship in the Primary School category for the first time. - ITE College Central won the championship in the Tertiary category for the first time. ### 2008 - The first mission of the challenge involves knocking down drink cans of 330ml each. - The mission also involves a second mission which is a secret mission. They are made known to the Pri and Sec Sch teams a few days before the actual challenge. The tertiary teams only know the secret mission on the actual day of the challenge. - 10th anniversary of National Junior Robotics Competition - [Hwa Chong Institution](/wiki/Hwa_Chong_Institution) won the National Junior Robotics Competition Championship for 2 years consecutively in the Tertiary Division, and also clinched the Best Robot Performance Award in the Tertiary Division. - River Valley High won the championship for secondary division for the first time. - Rulang Primary School reclaimed their status as the robotics champion for upper primary division from Chua Chu Kang Primary School, which won the championship for 2006 and 2007. ### 2007 - The introduction of the [Lego Mindstorms NXT](/wiki/Lego_Mindstorms_NXT) system - The mission had two storeys - The teams had to present a video footage to showcase the team's entire learning journey instead of the usual journal - The introduction of new category involving ITE/JC/Poly(1st year & 2nd year) students - For the first time in National Junior Robotics Competition's history, the judges allowed Admiralty Secondary School to have a rerun for the mission. This was because the playfield was not up to standard as structural errors were experienced. The playfield which Admiralty Secondary School ran on had its deformities, resulting in the playfield's base to be unbalanced. Thus, many of Admiralty Secondary School's robots were unable to complete the missions during the first run. It was after several deliberations and negotiations before the decision was announced to allow Admiralty Secondary School a second run for the mission so as to make sure the teams are playing under fair grounds. - Chua Chu Kang Primary School won the championship award for the upper primary category for 2 years consecutively, with full marks for the surprise mission during the Grand Finals. ### 2006 - Robots have to travel in 5 cm deep waters - The mission had an [elevator](/wiki/Elevator) - The playing field was constructed using [acrylic](/wiki/Acrylic_glass) - Admiralty Secondary School won the National Junior Robotics Competition Championship for 4 years consecutively. ### 2005 - The mission had three storeys - The mission had [stairs](/wiki/Stairway) - Admiralty Secondary School won the National Junior Robotics Competition Championship for 3 years consecutively. ### 2004 - Teams were given 7 missions to work on - Mobile phones were not allowed to be used by competitors during competition - Teams were not provided with the playing field to use at their own home ground. Only selected schools were provided - All teams in the Primary school section achieved zero points in the surprise mission - \"The Best Robot Performance Award\" was decided from the interview sessions. - Admiralty Secondary School won the National Junior Robotics Competition Championship for 2 years consecutively. ### 2003 - The mission features double level playfields ### 2002 - Non-competitors were not allowed in the pit areas to prevent unfair advantages - The playing mat was made out of printed paper and not black sticky tape - The \"Surprise mission\" was revealed on the Finals itself. ### 2001 - Teams were allowed to use two light sensors and one rotation sensor - The \"Surprise mission\" was introduced. The surprise mission was revealed the day before the Finals. ### 2000 - Teams were given objects to collect and deliver - The competition had two missions - The mission had [ramps](/wiki/Inclined_plane) ### 1999 - First held at the World Trade Centre (current Harbourfront Centre) - Description Website on NRC\n",
  "language": "en",
  "processed_at": "2026-01-12T11:36:33.563786",
  "title": "National Robotics Competition (Singapore)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/National_Robotics_Competition_(Singapore)"
}