{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:36:43.487713"
  },
  "content": "Compulsory service in Singapore [Singapore](/wiki/Singapore) maintains an active [conscription](/wiki/Conscription) system in accordance with the regulations set by the [Government of Singapore](/wiki/Government_of_Singapore), known as **National Service** (**NS**). This requires all qualified male Singaporean citizens and second-generation permanent residents to serve a period of [active duty](/wiki/Active_duty) [military service](/wiki/Military_service) in the uniformed services. Conscription was first instituted in Singapore in 1967 to help build the country's armed forces having just gained its independence two years prior in 1965. The government's rationale was that a strong military is an indispensable guarantor of the country's continued sovereignty, and has since been expanded to involve its police force and civil defence force. Upon enlistment, male citizens and second-generation permanent residents serve two years in [active duty](/wiki/Active_duty) as full-time national servicemen (NSFs) in the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces) (SAF), [Singapore Police Force](/wiki/Singapore_Police_Force) (SPF) or [Singapore Civil Defence Force](/wiki/Singapore_Civil_Defence_Force) (SCDF), following which they transit to an operationally-ready [reservist](/wiki/Reservist) state as operationally-ready national servicemen (NSmen). The majority of NSFs serve in the [Army](/wiki/Singapore_Army). The reasons for this include the larger relative manpower needs of the Army compared to the [Republic of Singapore Navy](/wiki/Republic_of_Singapore_Navy), [Republic of Singapore Air Force](/wiki/Republic_of_Singapore_Air_Force), [Digital and Intelligence Service](/wiki/Digital_and_Intelligence_Service), [Singapore Police Force](/wiki/Singapore_Police_Force) and [Singapore Civil Defence Force](/wiki/Singapore_Civil_Defence_Force). Moreover, as compared to the Army, the [Navy](/wiki/Republic_of_Singapore_Navy), [Air Force](/wiki/Republic_of_Singapore_Air_Force) & [DIS](/wiki/Digital_and_Intelligence_Service) are smaller armed services composed primarily of professional regular servicemen. Additionally, manpower requirements of the [Navy](/wiki/Republic_of_Singapore_Navy) and [Air Force](/wiki/Republic_of_Singapore_Air_Force) tend to be more specialised. The statutory age cap for reservist obligations is 40 for warrant officers, specialists and enlistees, and 50 for commissioned officers. ## History The British authorities attempted to introduce conscription for males aged 18 to 20 in 1954, during the [Malayan Emergency](/wiki/Malayan_Emergency). However, opposition riots meant that this never went into effect.: 77 In 1964, when Singapore was [part of Malaysia](/wiki/State_of_Singapore_(Malaysia)), the National Service (Amendment) Act led to around 400 Singaporeans being conscripted.: 79 The National Service (Amendment) Bill was passed on 14 March 1967, making National Service (NS) compulsory for all 18-year-old male Singapore citizens and permanent residents. The [Singapore government](/wiki/Government_of_Singapore) felt that it was necessary to build a substantial military force to defend the country, which had only about 1,000 soldiers when it became independent in 1965. In the late 1960s, the [British government](/wiki/Government_of_the_United_Kingdom) had decided to withdraw troops and bases [East of Suez](/wiki/East_of_Suez), including troops stationed in Singapore. That prompted the Singapore government to implement a conscription programme for the country's defence needs. It adopted a conscription model drawing on elements from the [Israeli](/wiki/Conscription_in_Israel) and [Swiss](/wiki/Conscription_in_Switzerland) national conscription schemes. About 9,000 young men born between 1 January and 30 June 1949 became the first batch of enlistees to be drafted for national service. Singapore had sought assistance through official diplomacy from other countries, but their refusal to provide help prompted Israeli diplomats to extend a helping hand to Singapore in the establishment of the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces). The stated rationale behind conscription is two-fold. Firstly, because Singapore has a population of about 5.5 million (as of 2014), an army consisting of only [regulars](/wiki/Regular_army) would not be sufficient to defend the country.[*citation needed*] Secondly, national service is supposed to promote racial harmony among the [Chinese](/wiki/Chinese_Singaporean), [Malay](/wiki/Malays_in_Singapore) and [Indian](/wiki/Indians_in_Singapore) communities.[*citation needed*] From 1971 to 2004, the duration of the conscription was either two years or two and half years, depending on the conscript's educational qualifications. By December 2004, the duration had been reduced to two years, driven by the evolution of the Singapore Armed Forces into the \"Third Generation Singapore Armed Forces\" and the increase in the number of enlistees over the next ten years. As a bonus incentive, the national service duration can also be reduced by a further two months for combat-fit enlistees ([PES](/wiki/PULHHEEMS) A or B1) who pass the [Individual Physical Proficiency Test (IPPT)](/wiki/Individual_Physical_Proficiency_Test) prior to enlistment. Non-combat-fit enlistees (PES B2 and below) will still serve the full 24 months of national service. PeriodRankFull-time National Service duration1Educational qualificationsNotes1971 – November 2004[Lance corporal](/wiki/Lance_corporal) or lowerTwo years[GCE O Level](/wiki/Singapore-Cambridge_GCE_Ordinary_Level), [GCE N Level](/wiki/Singapore-Cambridge_GCE_Normal_Level), [NITEC](/wiki/Institute_of_Technical_Education), or lower1971 – May 2004[Corporal](/wiki/Corporal) or higherTwo years and six months[GCE A Level](/wiki/Singapore-Cambridge_GCE_Advanced_Level), [Polytechnic](/wiki/Institute_of_technology#Singapore) [Diploma](/wiki/Diploma), or higherWill be administratively promoted to at least the rank of corporal.June 2004 – November 2004Corporal or higherTwo years and two monthsGCE A Level, Polytechnic Diploma, or higherFull-time National Servicemen serving national service during this time had a two-month reduction from their national service duration to compensate them for the policy changeDecember 2004 – presentAll ranksTwo yearsAll qualificationsPerformance-based system1. Combat-fit (PES A/B1) pre-enlistees who pass the [IPPT](/wiki/Individual_Physical_Proficiency_Test) before enlisting will have their full-time National Service duration reduced to one year and ten months. ## Personnel In 2022-23, the approximate headcount of Singapore Armed Forces personnel across 3 categories is as follows: - NSFs - National Servicemen Full-time, nearly 20,000 conscripted every year for 2 years full-time service: This is the number of eligible males who reach the mandatory military age annually. In 2022, nearly 10% were [new citizens](/wiki/Singaporean_nationality_law) and another 10% were [permanent residents](/wiki/Permanent_residency_in_Singapore). - NSmen - National Servicemen part-time [reservists](/wiki/Reservists), total 352,500: After 2 years full time service the NSFs become part of the NSmen part-time reservists force, where they serve part time for 10 years which is called ORNS (Operationally Ready National Service) period. ## Enlistment **This article is part of a series on**[Conscription](/wiki/Conscription)1780 caricature of a [press gang](/wiki/Press_gang)Related concepts - [Alternative civilian service](/wiki/Alternative_civilian_service) - [Civil conscription](/wiki/Civil_conscription) - [Conscientious objector](/wiki/Conscientious_objector) - [Conscription crisis](/wiki/Conscription_crisis) - [Counter-recruitment](/wiki/Counter-recruitment) - [Draft-card burning](/wiki/Draft-card_burning) - [Draft evasion](/wiki/Draft_evasion) - [Economic](/wiki/Economic_conscription) - [For autistic people](/wiki/Military_service_and_conscription_for_autistic_people) - [Impressment](/wiki/Impressment) - [Levée en masse](/wiki/Lev%C3%A9e_en_masse) - [Male expendability](/wiki/Male_expendability) - [Military service](/wiki/Military_service) - [National service](/wiki/National_service) - [Of people with disabilities](/wiki/Conscription_of_people_with_disabilities) - [Penal military unit](/wiki/Penal_military_unit) - [Sexism](/wiki/Conscription_and_sexism) - [War resister](/wiki/War_resister) By historical country - [Ottoman Empire](/wiki/Conscription_in_the_Ottoman_Empire) - [Rhodesia](/wiki/Conscription_in_Rhodesia) - [Russian Empire](/wiki/Conscription_in_the_Russian_Empire) - [Soviet Union](/wiki/Conscription_in_the_Soviet_Union) [By modern country](/wiki/Conscription#By_country) - [Argentina](/wiki/Conscription_in_Argentina) - [Australia](/wiki/Conscription_in_Australia) - [Azerbaijan](/wiki/Conscription_in_Azerbaijan) - [Bermuda](/wiki/Military_service#Bermuda) - [Brazil](/wiki/Conscription_in_Brazil) - [Canada](/wiki/Conscription_in_Canada) - [China](/wiki/Conscription_in_China) - [DR Congo](/wiki/Conscription_in_the_Democratic_Republic_of_the_Congo) ([child soldiers](/wiki/Child_soldiers_in_the_Democratic_Republic_of_the_Congo)) - [Cuba](/wiki/Conscription_in_Cuba) - [Cyprus](/wiki/Conscription_in_Cyprus) ([reduction](/wiki/Reduction_of_military_conscription_in_Cyprus)) - [Denmark](/wiki/Conscription_in_Denmark) - [Egypt](/wiki/Conscription_in_Egypt) - [Eritrea](/wiki/Conscription_in_Eritrea) - [Finland](/wiki/Conscription_in_Finland) - [France](/wiki/Conscription_in_France) - [Georgia](/wiki/Conscription_in_Georgia) - [Germany](/wiki/Conscription_in_Germany) - [Greece](/wiki/Conscription_in_Greece) - [Israel](/wiki/Conscription_in_Israel) - [Iran](/wiki/Conscription_in_Iran) - [Ireland](/wiki/Conscription_in_Ireland) - [North Korea](/wiki/Conscription_in_North_Korea) - [South Korea](/wiki/Conscription_in_South_Korea) - [Latvia](/wiki/Latvian_National_Armed_Forces#Conscription) - [Lithuania](/wiki/Lithuanian_Armed_Forces#Conscription) - [Myanmar](/wiki/Conscription_in_Myanmar) - [the Netherlands](/wiki/Conscription_in_the_Netherlands) - [New Zealand](/wiki/Compulsory_military_training_in_New_Zealand) - [Norway](/wiki/Conscription_in_Norway) - [Mexico](/wiki/Conscription_in_Mexico) - [Monaco](/wiki/Conscription_in_Monaco) - [Mozambique](/wiki/Conscription_in_Mozambique) - [the Philippines](/wiki/Conscription_in_the_Philippines) - [Russia](/wiki/Conscription_in_Russia) - [Serbia](/wiki/Conscription_in_Serbia) - Singapore - [South Africa](/wiki/Conscription_in_South_Africa) - [Sri Lanka](/wiki/Conscription_in_Sri_Lanka) - [Sudan](/wiki/Conscription_in_Sudan) - [Sweden](/wiki/Conscription_in_Sweden) - [Switzerland](/wiki/Conscription_in_Switzerland) - [Taiwan](/wiki/Conscription_in_Taiwan) - [Turkey](/wiki/Conscription_in_Turkey) - [United Arab Emirates](/wiki/Conscription_in_the_United_Arab_Emirates) - [United Kingdom](/wiki/Conscription_in_the_United_Kingdom) - [United States](/wiki/Conscription_in_the_United_States) - [Ukraine](/wiki/Conscription_in_Ukraine) - [Vietnam](/wiki/Conscription_in_Vietnam) - v - t - e According to the Enlistment Act 1970, conscription is mandatory for all \"persons subject to [the] act\", defined as those who are not less than 16.5 years of age and not more than 40 years of age, with some exemptions and with no specific bias to gender (not limited to males). Male Singapore citizens and second-generation permanent residents who have registered for their [National Registration Identity Card (NRIC)](/wiki/National_Registration_Identity_Card) are required to register for national service upon reaching the age of 16 years and six months, during which they would also be required to undergo a mandatory [medical examination](/wiki/PULHHEEMS) to determine their [Physical Employment Standards (PES)](/wiki/PULHHEEMS) status, which in most cases, determines which vocational groups the pre-enlistee is physically able to be posted to. ### Early enlistment There is a voluntary early enlist scheme by the Central Manpower Base (CMPB) for pre-enlistees who opt for early enlistment, with the consent of their parents, to begin their full-time national service at the earliest age of 16 years and six months. ### Mono-intake Mono-intake refers to a type of enlistment where conscripts are directly enlisted into an active battalion unit and undergo their [Basic Military Training (BMT)](/wiki/Military_recruit_training#Singapore) at [Pulau Tekong](/wiki/Pulau_Tekong), an island in eastern Singapore, before returning to their battalion. Exceptions to the mono-intake programme include conscripts enlisted in the [Naval Diving Unit](/wiki/Naval_Diving_Unit_(Singapore)), [Commandos](/wiki/Singapore_Armed_Forces_Commando_Formation) and certain combat vocations. ### Second-generation male permanent residents Second-generation male permanent residents are required by law to serve national service just like male citizens. The rationale is that they too enjoy the socio-economic national benefits of schooling and living in \"peacetime\" Singapore. Their failure to serve national service will be taken into account should they decide to study, work or travel in Singapore in the future. The government advises of such consequences at the point of renunciation. After completing mandatory full-time national service, they can qualify to apply for the accelerated Singapore citizenship scheme. However, citizenship is not guaranteed for all applicants, as there are certain criteria that must be met such as educational qualification, income qualification and national service work performance/ conduct appraisal in the certificate issued upon the completion of full-time national service. From 2006 to 2010, about 2% of 3,000 second-generation permanent residents who have completed full-time national service and applied for Singapore citizenship had their applications rejected. If the person is not granted Singapore citizenship but still holds Singapore permanent residency, he is still obliged by law to serve the national service obligations, i.e. operationally-ready reservist duties/in-camp trainings. Singapore permanent residents who served national service but did not acquire Singapore citizenship will be treated equally to those permanent residents without service obligation; they would not have access to the privileges granted to Singapore citizens. ### Deferment According to the [Ministry of Defence](/wiki/Ministry_of_Defence_(Singapore)), national service in Singapore is based on principles of universality and equity, and these principles must be upheld so as to ensure Singaporeans' important support of and commitment to national service. If Singapore citizens are allowed to choose when they want to serve national service, it would not be fair to the vast majority of national servicemen who have served the country dutifully, and the institutions of national service will be undermined. Pre-enlistees are allowed to defer national service to complete full-time tertiary studies as long as they are pursuing full-time studies and pursuing a course from what they have previously attained, up to the first pre-university qualification bar ([GCE Advanced Level](/wiki/Singapore-Cambridge_GCE_Advanced_Level) or [Polytechnic Diploma](/wiki/Institute_of_technology#Singapore) or their equivalent) before enlistment for [Basic Military Training (BMT)](/wiki/Military_recruit_training#Singapore). Deferment is not granted for all degree courses, even if they have already begun the course. Those granted approval in national sports teams to compete in national/overseas events will be drafted as soon as they return from one of the national-level events. As of July 2018, only three persons (Maximilian Soh, [Joseph Schooling](/wiki/Joseph_Schooling) and [Quah Zheng Wen](/wiki/Quah_Zheng_Wen)) have been granted deferment. ### Disruption Under special circumstances, Singaporean males are allowed to disrupt their national service before the completion of their full-time national service if they fulfil one of the following conditions: 1. Accepted an offer into a local undergraduate medical school ([Lee Kong Chian School of Medicine](/wiki/Lee_Kong_Chian_School_of_Medicine) or [Yong Loo Lin School of Medicine](/wiki/Yong_Loo_Lin_School_of_Medicine)) to begin tertiary studies. Upon completion of the curriculum, as well as a mandatory year of Postgraduate Year 1 work, they will be required to complete the remaining duration of their national service as a Medical Officer after undergoing the Medical Officer Conversion Course. This form of disruption falls under the Local Medicine Disruption scheme, and is offered to those who: - Have more than a year of National Service obligation - Have less than a year of National Service obligation, but must extend their duration of service until a total of one year remains. 2. Are recipients of a [Public Service Commission (PSC)](/wiki/Public_Service_Commission_(Singapore)) Scholarship. Those who are awarded the PSC Overseas Merit Scholarship are granted disruption in the first year of full-time national service to pursue their studies in an overseas university. ### Exemption Medical exemptions are granted through the Central Manpower Base (CMPB) medical screening, which assigns individuals a Physical Employment Standard (PES) grade. In 2022, the National Service Review Committee (NSRC) revised the PES system. The classification shifted from a simple binary of combat fit or non-combat fit to a more nuanced assessment of an individual's \"operational effectiveness.\" Individuals can choose to turn down a medical exemption, and serve NS tailored to their condition. All female Singapore citizens and permanent residents are exempt from NS. Male permanent residents under the \"Professionals/Technical Personnel and Skilled Workers Scheme\" (PTS scheme) or the \"Investor Scheme\" are exempt from NS. #### Discussion about conscientious objection Singapore does not recognize [conscientious objection to military service](/wiki/Conscientious_objector). Conscientious objectors in Singapore usually face an average of 30 months of imprisonment. In its input to the OHCHR reports on conscientious objection to military service at HRC-50, Singapore confirmed that \"HRC resolution 20/2 goes beyond what is prescribed in international law and applicable human rights instruments.\" ### Punishment for refusing enlistment without exemptions Those who are liable to serve national service but refuse to do so are charged under the Enlistment Act. If one is convicted, they may face up to either three years' imprisonment and/or a fine of S$10,000. Some national service pre-enlistees will be denied entry into the country if they are overseas while some pre-enlistees are court-martialled for their failure to enlist or refusal to be conscripted. Most convicts are [Jehovah's Witnesses](/wiki/Jehovah%27s_Witnesses_in_Singapore), who are usually sentenced to three years' imprisonment in the Singapore Armed Forces Detention Barracks, where they are also separated from other conscription offenders and assigned to do mundane tasks such as cooking. The government currently does not consider [conscientious objection](/wiki/Conscientious_objector) to be a legal reason for refusal of national service. ### Defaulting: draft evasion Similarly to enlistees failing to enlist, defaulters would be charged and faced with up to three years' imprisonment and/or a fine of up to S$10,000. In 2006, there was a public outcry over the \"lenient\" sentence which Singaporean-born British pianist [Melvyn Tan](/wiki/Melvyn_Tan) received for defaulting on his national service obligations in the 1970s after obtaining British citizenship. Tan had received a composition fine while other defaulters had been given the maximum fines or imprisonment. Clarity over how judges would sentence a defaulter was clearer in successive landmark cases. In 2010, Seow Wei Sin was initially given an 18-month prison sentence, which was lowered to a fine of S$5,000 on appeal after the courts had determined that Seow had little substantial connection to Singapore except being born there, and thus had a low culpability for committing the default. In 2016, Brian Joseph Chow was initially handed a S$4,500 fine, which was set aside for one-and-a-half month prison sentence upon appeal. Chow had a substantial connection to Singapore, having been born and raised here, thus the prison sentence instead of just a fine. Additionally, by delaying national service obligations, it would violate \"the principles of equity and universality and undermined the fair share agreement,” under which all males had to serve at the same time. In Chow's case, Justice [Chan Seng Onn](/wiki/Chan_Seng_Onn) listed the factors which would determine the sentence given: - the duration for which the defaulter evaded NS; - whether the surrender was voluntary; - one's performance during NS; - whether the defaulter had pleaded guilty during trial. In 2017, the [High Court](/wiki/High_Court_of_Singapore) set out new sentencing benchmarks for defaulters which had been described as \"more onerous\" than the guidelines laid down earlier by Justice Chan Seng Onn. In a written judgment, the court said that the length of sentences should be amplified for those who have defaulted for a longer period of time, to \"reflect the decline in a person's physical fitness with age\" and also to create a \"progressive disincentive\" for defaulters to delay their return. There are four tiers of punishment, which vary in severity according to the length of default period: 1. Those who evade NS for two to six years face a minimum jail sentence of two to four months. 2. Those who evade NS for seven to 10 years face a minimum jail sentence of five to eight months. 3. Those who evade NS for 11 to 16 years face a minimum jail sentence of 14 to 22 months. 4. Those who evade NS for 17 or more years face a minimum jail sentence of two to three years. In 2018, [Minister of Defence](/wiki/Ministry_of_Defence_(Singapore)) [Ng Eng Hen](/wiki/Ng_Eng_Hen) revealed in a parliamentary speech that there were an average of 350 defaulters yearly. #### Notable defaulters - [Benjamin James Davis](/wiki/Ben_Davis_(footballer,_born_2000)), a footballer who chose to continue with a second professions contract with [Fulham Football Club](/wiki/Fulham_Football_Club) in 2018, and default on his enlistment in 2019 after failing in his applications for deferment. - [Kevin Kwan](/wiki/Kevin_Kwan), author of the novel *[Crazy Rich Asians](/wiki/Crazy_Rich_Asians_(novel))* which was adapted into the [2018 film of the same title](/wiki/Crazy_Rich_Asians). Kwan allegedly had entered Singapore multiple times without being arrested, to which the [Ministry of Home Affairs](/wiki/Ministry_of_Home_Affairs_(Singapore)) refuted. - [Lim Ching Hwang](/wiki/Lim_Ching_Hwang), a Malaysian swimmer who became a permanent resident of Singapore. Lim left Singapore in July 2015 and failed to report for national service in November that year. He returned in June 2018 and enlisted in April 2019. - [Melvyn Tan](/wiki/Melvyn_Tan), Singapore-born British musician who defaulted for more than 3 decades. Tan renounced his Singapore citizenship in 1978, but returned to the country to face charges in 2005. He was fined $3,000, with no jail term. - [Amos Yee](/wiki/Amos_Yee), a Singaporean convicted sex offender and former blogger, YouTuber, and child actor, who was charged for wounding religious feelings over a series of blog posts. He left Singapore to seek asylum in the United States before he could be called up for National Service. While living in [Illinois](/wiki/Illinois), he was convicted and imprisoned for solicitation of a 14-year-old girl and possessing child pornography. - Jonathan Lee Han Wen, a graduate who is born in Singapore but brought up in Hong Kong was sentenced to 3 weeks imprisonment in 2019. ## Types of service ### Military service There are several types of [Basic Military Training (BMT)](/wiki/Military_recruit_training#Singapore) conducted by the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces) at the [Basic Military Training Centre (BMTC)](/wiki/Basic_Military_Training_Centre) at [Pulau Tekong](/wiki/Pulau_Tekong), or at the camps of units which directly draft mono-intake recruits. Combat-fit national servicemen with higher education undergo a nine-week enhanced BMT programme, while those with other educational qualifications and mono-intake recruits undergo the standard BMT programme. Recruits who perform well in BMT will be sent to the [Specialist Cadet School](/wiki/Specialist_Cadet_School) (SCS) or [Officer Cadet School](/wiki/Officer_Cadet_School_(Singapore)) (OCS) for further training to be [specialists](/wiki/Specialist_(Singapore)) (with the rank of [Third Sergeant](/wiki/Sergeant#Singapore)) or [commissioned officers](/wiki/Officer_(armed_forces)) (with the rank of [Second Lieutenant](/wiki/Second_lieutenant#Singapore)) respectively. A handful of high-performing candidates are also selected for a nine-month advanced training programme at the [Home Team Academy](/wiki/Home_Team_Academy) to become [Inspectors](/wiki/Inspector#Singapore) in the [Singapore Police Force](/wiki/Singapore_Police_Force) or [Lieutenants](/wiki/Lieutenant#Singapore) in the [Singapore Civil Defence Force](/wiki/Singapore_Civil_Defence_Force). Some national servicemen who have at least [NITEC certificates](/wiki/Institute_of_Technical_Education) and perform exceptionally well can take the Situational Test to assess their suitability for command positions. A two-month reduction in full-time national service is offered to all pre-enlistees who are able to pass their three-station [Individual Physical Proficiency Test](/wiki/Individual_Physical_Proficiency_Test) (IPPT) consisting of push-ups, sit-ups and a 2.4 km (1.5 mi) run, with a minimum of 61 points. Before April 2015, the IPPT consisted of six stations: the 2.4 km (1.5 mi) run, sit-ups, pull-ups, standing-broad jump, sit-and-reach stretch and shuttle-run. National servicemen whose [Physical Employment Status (PES)](/wiki/PULHHEEMS) is C or E, meaning they are non-combat-fit, undergo a nine-week modified BMT which trains them for combat service support vocations. National servicemen who PES is A or B1 and do not pass the [Individual Physical Proficiency Test (IPPT)](/wiki/Individual_Physical_Proficiency_Test) before enlistment will have to undergo an additional four-week Physical Training Phase (PTP), making their entire BMT duration 17 weeks instead of nine weeks. Conscripts who are considered medically [obese](/wiki/Obesity) undergo a 19-week BMT programme aimed at helping them lose weight. The obesity of a conscript is determined by his [body mass index](/wiki/Body_mass_index) (BMI) during the pre-enlistment medical examination. A BMI of above 27 is considered indicative of obesity, as opposed to the [World Health Organization](/wiki/World_Health_Organization)'s guideline of 30 and above.[*citation needed*] ### Police service National servicemen serving in the [Singapore Police Force](/wiki/Singapore_Police_Force) (SPF) undergo training at the [Home Team Academy](/wiki/Home_Team_Academy), where they study the [Penal Code](/wiki/Penal_Code_(Singapore)) and standard police protocol. After training at the Academy, they will be posted to various departments such as [Special Operations Command](/wiki/Special_Operations_Command_(Singapore)) (SOC), Logistics, Land Divisions and [Airport Police Division](/wiki/Airport_Police_Division) (APD). Those posted to the [Police Coast Guard](/wiki/Police_Coast_Guard) (PCG) or [Protective Security Command](/wiki/Protective_Security_Command) (ProCom) will undergo further training. Selection of officer cadets to undergo the NS Probationary Inspector Course (NSPI) is a stringent process for full-time police national servicemen. A very small number, usually those who receive the Best Trainee Award, from each cohort will be selected. The majority of the officer cadets are chosen from candidates who have completed the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces)' [Basic Military Training](/wiki/Military_recruit_training#Singapore) programme. The national service ranks in the Singapore Police Force differ slightly from those of the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces) and [Singapore Civil Defence Force](/wiki/Singapore_Civil_Defence_Force). Official correspondence in the Singapore Police Force clearly differentiates a national serviceman from a regular serviceman. ### Civil defence service National servicemen serving in the [Singapore Civil Defence Force](/wiki/Singapore_Civil_Defence_Force) (SCDF) undergo four weeks of training at the National Service Training Centre (NSTC), where they are given Basic Rescue Training (BRT), exposed to regimental discipline, and trained to maintain the same level of fitness as their counterparts in the armed forces and police force. National servicemen who complete the four-week training at the NSTC are posted out to be trained as [firefighters](/wiki/Firefighters), medical [orderlies](/wiki/Orderly) (medics), [dog handlers](/wiki/Police_dog), [provosts](/wiki/Military_police), information and communications and logistics specialists. Within the first two weeks of the BRT stage, high-performing national servicemen may be posted to the [Home Team Academy](/wiki/Home_Team_Academy) to undergo the three-month Firefighter Course (FFC) or the five-month Section Commanders Course (SCC), where they are respectively trained to be Firefighters (with the rank of [Lance Corporal](/wiki/Lance_corporal#Singapore)) or Fire & Rescue Specialists (with the rank of [Sergeant](/wiki/Sergeant#Singapore)). Admission into the Section Commanders Course typically requires a minimum educational qualification of [GCE A Level](/wiki/Singapore-Cambridge_GCE_Advanced_Level), [Polytechnic](/wiki/Institute_of_technology#Singapore) [Diploma](/wiki/Diploma), or [Higher NITEC](/wiki/Institute_of_Technical_Education). SCC trainees receive additional rescue and emergency training and undergo a Basic Home Team Course at the [Home Team Academy](/wiki/Home_Team_Academy) as part of the General Command & Control Term to train them for command positions. Firefighters are typically posted out to the various fire stations around Singapore, while Fire & Rescue Specialists become section commanders at territorial divisions, fire stations or at the Special Response Unit. Depending on their rankings at the time of completing the courses, a small number of them may become instructors in the Civil Defence Academy to staff the Command and Staff Training Centre (CSTC), Specialist Training Centre (STC) or Firefighting Training Centre (FFTC). Only the top performing 5–10% of each Section Commanders Course cohort will be selected to undergo the Rota Commanders Course (RCC) to be trained as senior officers (with the rank of [Lieutenant](/wiki/Lieutenant#Singapore)), as the majority of officer cadets originate from the Singapore Armed Forces Basic Military Training Programme before being seconded to the Force. The national service ranks in the Singapore Civil Defence Force is a combination from those of the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces) and [Singapore Police Force](/wiki/Singapore_Police_Force). ## Issues ### Exclusion of Malays [Malay Singaporeans](/wiki/Malay_Singaporeans) were *[de facto](/wiki/De_facto)* not required to serve national service from the beginning of the draft in its initial years from 1967 until 1977, largely due to cultural and racial sensitivities with the country's immediate neighbours [Indonesia](/wiki/Indonesia) and [Malaysia](/wiki/Malaysia). In 1987, [Lee Hsien Loong](/wiki/Lee_Hsien_Loong), then the [Second Minister for Defence](/wiki/Ministry_of_Defence_(Singapore)), stated that the Singapore Armed Forces (SAF) aimed to prevent situations where soldiers might face a conflict between loyalty to the nation and their religious beliefs. His remarks drew varied responses, including criticism from Malaysia and Indonesia, while others defended his position as pragmatic, viewing it as an assertion of Singapore's right to pursue an independent domestic policy. After Malays were eventually conscripted into national service from the 1980s and beyond, they are mostly assigned to serve in either the [Police Force](/wiki/Singapore_Police_Force) (SPF) or the [Civil Defence Force](/wiki/Singapore_Civil_Defence_Force) (SCDF), but not in the SAF branches of the [Army](/wiki/Singapore_Army), [Navy](/wiki/Republic_of_Singapore_Navy) or [Air Force](/wiki/Republic_of_Singapore_Air_Force). In 2007, American military analyst Sean Walsh wrote that \"official discrimination against the Malay population in the military remains an open secret\". The [Ministry of Defence](/wiki/Ministry_of_Defence_(Singapore)) has refuted Walsh's claims, noting that there are \"Malay pilots, [commandos](/wiki/Singapore_Armed_Forces_Commando_Formation) and air defence personnel\" and stating that \"the proportion of eligible Malays selected for [specialist](/wiki/Specialist_(Singapore)) and [officer](/wiki/Officer_(armed_forces)#Singapore) training is similar to the proportion of eligible non-Malays.\" Malays make up [13% of the resident population](/wiki/Demographics_of_Singapore) of Singapore. ### Alleged preferential treatment [Janil Puthucheary](/wiki/Janil_Puthucheary), an elected Member of Parliament from the governing [People's Action Party](/wiki/People%27s_Action_Party) (PAP), was exempted from national service as he is a first-generation naturalised Singapore citizen. Puthucheary, who made his debut as a PAP candidate in the [2011 general election](/wiki/2011_Singaporean_general_election), was unfavourably compared to [Chen Show Mao](/wiki/Chen_Show_Mao), a candidate from the opposition [Workers' Party](/wiki/Workers%27_Party_(Singapore)) (WP) who had volunteered for national service before becoming a naturalised Singapore citizen. When Puthucheary pointed out that he had spent his career saving children's lives as a paediatrician, he was criticised for equating his profession with national service when a paediatrician is paid more than an average national serviceman. His candidacy led WP chief [Low Thia Khiang](/wiki/Low_Thia_Khiang) to call for an amendment to the [Singapore constitution](/wiki/Constitution_of_Singapore) to allow only male candidates who have served their national service to run for elections. In March 2015, Puthucheary joined the first intake of the [SAF Volunteer Corps](/wiki/SAF_Volunteer_Corps). During the lead-up to the [2011 presidential election](/wiki/2011_Singaporean_presidential_election), it was alleged that Patrick Tan, a son of presidential candidate [Tony Tan](/wiki/Tony_Tan), had received preferential treatment because of his father's status as a PAP member of parliament and cabinet minister. Patrick Tan had been granted a 12-year disruption from full-time national service, and had been deployed as a medical scientist in the Defence Medical Research Institute when he resumed national service. The [Ministry of Defence](/wiki/Ministry_of_Defence_(Singapore)) refuted the allegation of preferential treatment and explained that Patrick Tan had been granted exemption along with 86 candidates between 1973 and 1992, under a scheme to train medical professionals. ## Women in national service Female Singaporeans are not required to enroll in compulsory national service. However, voluntary participation is encouraged, and many women serve as volunteers and regulars. Since 2015, there have been over 1,600 servicewomen in the [SAF](/wiki/Singapore_Armed_Forces) and more than 500 volunteers in the [SAF Volunteer Corps (SAFVC)](/wiki/SAF_Volunteer_Corps). Women may also serve in SPF and SCDF. ### Debate about women's conscription Social studies have shown that more than 20% women are willing to serve a full-term NS, while almost 10% women Singaporeans are willing to conscript themselves. During a debate on the [White Paper](/wiki/White_paper) on Singapore Women's Development, Members of Parliament, [Carrie Tan](/wiki/Carrie_Tan) (Nee Soon GRC) and [Poh Li San](/wiki/Poh_Li_San) (Sembawang GRC) raised concerns about the recruitment of women into the SAF, alongside other initiatives aimed at enhancing gender equality. Non-profit organization [AWARE](/wiki/Association_of_Women_for_Action_and_Research) also advocated for expanding NS beyond military roles, emphasizing the importance of offering both men and women choices in their service, whether in the military or other forms of community engagement. They argue that NS should not be determined by gender but should provide diverse opportunities for all citizens. The Singapore Defence Minister Ng Eng Hen stated \"the societal cost of enlisting women into NS now would far outweigh the benefits.\" In response to calls for expanding NS's scope, Ng emphasized that the primary objective of the SAF remains to \"train soldiers capable of defending Singapore.\" Therefore, proposals advocating for the recruitment of women into healthcare roles or promoting gender equality are deemed \"far from feasible.\" He expressed concerns that enlistment would delay women's entry into the workforce, leading to [manpower shortages](/wiki/Shortage) and impacting families, children, spouses, and society at large. According to Ng, the societal costs outweigh the benefits of reversing gender equality in this context. ## Allegation of gender equality violation ### Background \"Purple Light\" is a marching song that has been popular among National Servicemen (NSmen). The song, among many other army songs, is often sung during route marches and physical training sessions to build bondings and boost morale. The original lyrics of the song include: \"*Booking out, saw my girlfriend / Saw her with, another man / Scold the man, dump my girlfriend (With my rifle and my buddy and me)*.” A former NSman described the original \"Purple Light\" as a “stupid and fun” song. However, in 2013, several NSmen raised concerns to AWARE about an offensive verse in the song. The problematic lyrics, which suggested misogynist values and \"sexist violence against women,\" were: “*Booking out, see my girlfriend/ Saw her with another man/ Kill the man, rape my girlfriend (With my rifle and my buddy and me)*.” ### Public reaction AWARE brought the issue to the attention of the MINDEF and SAF, who immediately halted the singing of the offensive lyrics to prevent the use of offensive language in camps. The news of the ban on the offensive lyrics, published by AWARE, quickly went viral online, drawing mixed reactions from netizens. Some servicemen argued that army song lyrics are often modified and should not be taken seriously, condemning AWARE’s actions as an over-reaction; while others criticized the violent content of the lyrics, emphasizing the importance of respecting women's roles in society and within the SAF. ### Official response On 18 November 2013, MINDEF issued a response to the public discussion: \"...*We understand that there have been some concerns about a ban on the popular marching song Purple Light because of an offensive verse. We would like to clarify that Purple Light has not been banned. However, steps have been taken to stop the offensive verse from being sung in the SAF, as it runs contrary to the values of our organisation and should not be condoned. The original verse uses the following lyrics \"Booking out, saw my girlfriend / Saw her with another man / Broken heart, back to Army / With my rifle and my buddy and me\". The modifications were done independently by some groups during their march, and are not authorised.*\" - [Singapore Armed Forces](/wiki/Singapore_Armed_Forces) (SAF) - [Singapore Police Force](/wiki/Singapore_Police_Force) (SPF) - [Singapore Civil Defence Force](/wiki/Singapore_Civil_Defence_Force) (SCDF) - [1954 National Service riots](/wiki/1954_National_Service_riots) – Chinese opposition to conscription service during British rule - [List of Singapore Armed Forces bases](/wiki/List_of_Singapore_Armed_Forces_bases) - Singapore Statutes Chapter 93: Enlistment Act (1967), archived in the Attorney General Chamber (AGC) of Singapore. Archived 2 July 2017 at the [Wayback Machine](/wiki/Wayback_Machine) - Enlistment Act Archived 5 September 2008 at the [Wayback Machine](/wiki/Wayback_Machine)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:36:43.487368",
  "title": "National service in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/National_service_in_Singapore"
}