{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:36:07.224059"
  },
  "content": "Public holiday in Singapore **National Day**,[a] sometimes known internationally as **Singapore Independence Day**,[b] is a major public holiday in Singapore commemorating the establishment of an independent and [sovereign](/wiki/Sovereign_state) [Republic of Singapore](/wiki/Republic_of_Singapore). Observed annually on [9 August](/wiki/Independence_of_Singapore_Agreement_1965) since 1965, it marks the date when Singapore became fully sovereign following its [separation from Malaysia](/wiki/Independence_of_Singapore_Agreement_1965). The day is a statutory [public holiday](/wiki/Public_holidays_in_Singapore) and features the [National Day Parade](/wiki/Singapore_National_Day_Parade) (NDP), a National Day Message by the [Prime Minister of Singapore](/wiki/Prime_Minister_of_Singapore) and [fireworks celebrations](/wiki/Singapore_Fireworks_Celebrations), among other festivities. The NDP is a large-scale event featuring [military](/wiki/Singapore_Armed_Forces) and [civil](/wiki/Singapore_Civil_Defence_Force) contingents, cultural performances and aerial displays. Alongside the parade, the Prime Minister delivers an annual message reflecting on national progress and future challenges. The holiday originates from the formal [proclamation of Singapore](/wiki/Proclamation_of_Singapore)'s independence on 9 August 1965 that was drafted by the [Minister for Law](/wiki/Ministry_of_Law_(Singapore)#Ministers) [Edmund W. Barker](/wiki/Edmund_W._Barker) and signed by prime minister [Lee Kuan Yew](/wiki/Lee_Kuan_Yew). Since then, National Day has become a focal point for national identity and unity among [Singaporeans](/wiki/Singaporeans). ## History ### Date of National Day #### 1960–1964 Singapore initially had a different date for National Day prior to 9 August, when it commemorated 3 June after achieving full internal self-governance from the [United Kingdom](/wiki/United_Kingdom) in 1959. Between 1960 and 1964, Singapore celebrated National Day on 3 June to mark this occasion and the end of colonial rule. ## Festivities ### National Day Parade The Singapore National Day Parade is a national ceremony that is usually held at [The Float @ Marina Bay](/wiki/The_Float_@_Marina_Bay), the [National Stadium](/wiki/National_Stadium,_Singapore) at the [Singapore Sports Hub](/wiki/Singapore_Sports_Hub), or the [Padang](/wiki/Padang,_Singapore). In 2007, the Parade was held at The Float @ Marina Bay for the first time, and in 2016, it was held at the Singapore Sports Hub. The parade includes performances that depict the yearly theme. ### National Day Message The National Day Message is an annual tradition on 9 August since 1966. In each year's recorded message, the [Prime Minister of Singapore](/wiki/Prime_Minister_of_Singapore) \"examine[s] domestic and global developments, review[s] economic performance and outlook, and outline[s] national priorities and government plans as [he inspires] Singaporeans to move forward with a unified sense of purpose\". ### National Day Rally On the first or second Sunday following National Day, the prime minister gives an address to the nation at a National Day Rally, which usually features discussions of the country's status and accomplishments, and announcements of future plans and policy changes. ### Firework celebrations National Day celebrations also include [fireworks](/wiki/Firework) celebrations. They feature several local and foreign teams which launch [fireworks](/wiki/Firework) displays on different nights. First held in 2004 at [Marina Bay](/wiki/Marina_Bay,_Singapore), the event was initially known as the Singapore Fireworks Festival and organised by Unusual Productions. The amount of fireworks used has grown in magnitude over the past three years, from 4,000 rounds used in 2004 to over 9,000 in 2006. In 2012, a [Mentos commercial](/wiki/National_Night) encouraged [procreation](/wiki/Procreation) during the same time as the fireworks celebration. - [List of Singaporean patriotic songs](/wiki/List_of_Singaporean_patriotic_songs) ## Notes Media related to National Day of Singapore at Wikimedia Commons Portals: - Holidays - Singapore\n",
  "language": "en",
  "processed_at": "2026-01-12T11:36:07.223796",
  "title": "National Day (Singapore)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/National_Day_(Singapore)"
}