{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:36:13.596779"
  },
  "content": "The **National Grid Office** (NGO) was an entity in [Singapore](/wiki/Singapore) which was established on 2 January 2003 to fulfill the mission of the National Grid and promote the adoption of [Grid computing](/wiki/Grid_computing) in Singapore. The National Grid has the mission of transforming Singapore into a nation where [computer resources](/wiki/Computing_resource) can be interconnected via a next-generation [cyberinfrastructure](/wiki/Cyberinfrastructure) that allows the sharing of computing resources in a secure, reliable, and efficient manner by authenticated users for [education](/wiki/Education), commerce entertainment, [R&D](/wiki/R%26D), and [national security](/wiki/National_security). It aims to improve the [economic](/wiki/Economics) and [technological](/wiki/Technology) competitiveness of the country. ## History NGO was established under the [Agency for Science, Technology And Research](/wiki/Agency_for_Science,_Technology_and_Research) (A*STAR) and guided by the National Grid Steering Committee (NGSC). NGSC provided the oversight and directions for the National Grid effort. NGSC was chaired by career civil servant Peter Ho, then Permanent Secretary for Defence. Dr. [Sydney Brunner](/wiki/Sydney_Brenner), who headed A*STAR's Biomedical Research Council was the Vice-Chairman. This 2-member committee was drawn from government agencies who were the potential users of grid computing as well as owners of large computation resources in Singapore. Under the National Grid Pilot Platform (NGPP), two pilot grid projects were rolled out to explore the possibility of linking all the supercomputing resources in Singapore, letting users submit their computational jobs through an online [scheduler](/wiki/Scheduling_(computing)). One finding between April 2005 and June 2006 highlighted that 60 percent of the resources were used by defence R&D, 36 per cent by life sciences, with the remainder by physical science and digital media industries. The pilots demonstrated that the grid concept was workable. However, due to the heterogeneous nature of the hardware, many issues had to be addressed. The [HPC clusters](/wiki/HPCC) and supercomputers were of different brands and ran different operation systems. Some software could run on a few machines, others needed to be modified. The biggest impediment was licensing. The supercomputing software was licensed to the research institutes (RIs) and universities, not to other users hooked up to the grid network. Commercial software at that time was not ready for pay-for-use. While the RIs and universities bought into the grid computing concept, there was an underlying tension. They had bought their own supercomputing resources. Centralising the supercomputing resources meant taking away parts of their budgets. Perhaps, this was not socially acceptable. From the pilots, it was clear that the resource-poor researchers were very willing to make use of the grid resources - although the grid tools were far from production quality - but the resource owners were not so willing to share. The NGSC saw the potential of how industries and enterprises could reap IT cost savings and benefits that grid computing promises. This aligns with the observation that concepts in grid computing such as utility business models, Software-as-a Service (SaaS), advancement in [virtualisation](/wiki/Virtualization) have grown popular with industry and business users, beyond scientific users. With the rise of [cloud computing](/wiki/Cloud_computing), the grid computing platform faded away. As cloud computing gained market share, NGO gave way to the National Cloud Computing Office under the Info-communications Development Authority of Singapore (IDA).\n",
  "language": "en",
  "processed_at": "2026-01-12T11:36:13.596449",
  "title": "National Grid Office",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/National_Grid_Office"
}