{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:36:29.257499"
  },
  "content": "Uniformed group in SingaporeThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"National Police Cadet Corps\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(May 2022)* *(Learn how and when to remove this message)*Law enforcement agency The **National Police Cadet Corps** (**NPCC**) is one of the national uniformed groups for youths between the ages of 13 to 17 in [Singapore](/wiki/Singapore). The organisation is supported by the [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)) and the [Ministry of Home Affairs](/wiki/Ministry_of_Home_Affairs_(Singapore)). Established in 1959, it trains young boys and girls in the values of law enforcement and public safety. While NPCC adopts police-style training and structure, it holds no actual police authority and primarily serves as an educational and character-building experience through structured simulations and drills. ## Brief history Following Singapore's successful elections of 1959, the new government, among other policies, began to pressure the Singapore Police Force (SPF) to form a youth unit on the lines of the long serving military cadet organisations of the island. On 8 May that year, the NPCC was born with then-Commissioner E Alan G Blades approving the formation of the first police cadet unit, this day is annually marked as NPCC Day. The first platoon of 30 cadets, based in Bartley Secondary School, proved to be a success for the young organisation. In 1961, Parliament passed the Police Cadet Corps Ordinance, officially endorsing the Corps as a national organisation dedicated to training the young in the values of security in their communities even at a young age, affiliated to the SPF. Two years later, the first female cadets were admitted into the organisation. Since 1961, the NPCC (then named the PCC, or Police Cadet Corps, from 1969 to 1972 as part of the integration of all national youth cadet organisations) has grown with the nation. During the brief period of Singapore being a part of Malaysia, the PCC was affiliated to the [Royal Malaysia Police](/wiki/Royal_Malaysia_Police), which has since established its own [National Police Cadet (Malaysia)](/wiki/National_Police_Cadet_(Malaysia)). ## Ranks As NPCC is affiliated with the [Singapore Police Force](/wiki/Singapore_Police_Force) (SPF), the ranks of NPCC are similar. NPCC ranks have the suffix '(NPCC)' to distinguish their ranks from the SPF ranks. Honorary Officers (HO), who are appointed volunteer adult leaders, have the prefix 'H/' in their rank, which stands for 'Honorary', to distinguish it from that of Teacher Officers (TO). TOs and HOs appointed to higher levels of leadership, such as an Assistant Commandant (AC) or HQ staff officer, but have not yet officially been promoted to a respective rank, will have the prefix 'A/' in their rank, which stands for 'Acting', to denote their status. In addition, the Commandant of NPCC holds the rank of Superintendent of Police (SUPT), and is a senior officer of the SPF who reports to the commander of SPF's Training Command (TRACOM). Ranks of the National Police Cadet Corps Rank**Notes**Cadet (NPCC) [CDT (NPCC)] All cadets start off with this rank upon joining the Corps.Lance Corporal (NPCC) [LCP (NPCC)] Most cadets will be promoted to this rank after 1 year of membership in the Corps.Corporal (NPCC) [CPL (NPCC)] Most cadets will be promoted to this rank after 2 years of membership in the Corps, and will start their leadership duties as cadet leaders.Sergeant (NPCC) [SGT (NPCC)] Most cadets will be promoted to this rank after 3 years of membership in the Corps.Staff Sergeant (NPCC) [SSGT (NPCC)] Most cadets will graduate with this rank after 4/5 years of active membership in the Corps.Station Inspector (NPCC) [SI (NPCC)] Only cadets who are nominated by their unit and pass an interview will be promoted to this rank. All who rank Station Inspector and above, are addressed as 'Sir/Ma'am'.Cadet Inspector (NPCC) [CI (NPCC)] Only former cadets who have graduated with the rank of at least Staff Sergeant and have fufilled selection, training, and probation requirements may be promoted to this rank. Cadet Inspectors (CI) are appointed as volunteer youth leaders in the Corps.Senior Cadet Inspector (NPCC) [SCI (NPCC)] Only CIs who have served a minimum of 2 years, are nominated, have made significant contributions, and demonstrated a high level of commitment will be promoted to this rank.Inspector (NPCC) [INSP (NPCC)] This rank and all ranks above it can only be held by TOs, who are attached to the NPCC unit of each school. TOs must pass the Officer Basic Training Course to be promoted to this rank.Assistant Superintendent of Police (NPCC) [ASP (NPCC)] Most Officers-in-Charge Unit (OC Unit), who are TOs that are appointed to take charge of the school's NPCC unit, are promoted to this rank after certain years of service.Deputy Superintendent of Police (NPCC) [DSP (NPCC)] Only NPCC HQ Staff Officers, who are Character and Citizenship Education officers under the Ministry of Education, and ACs, who are TOs appointed to take charge of a NPCC area, are promoted to this rank after certain years of service. ## Activities Training may be held once or twice a week, depending on the school unit. Cadets can attain proficiency badges after completing the courses. They may also participate in Area level activities, such as area-based camps at Camp Resilience, or even international activities, such as at the overseas educational visits to Brunei or Hong Kong. - [Singapore Police Force](/wiki/Singapore_Police_Force) - [National service in Singapore](/wiki/National_service_in_Singapore) - [National Cadet Corps (Singapore)](/wiki/National_Cadet_Corps_(Singapore)) - [National Civil Defence Cadet Corps](/wiki/National_Civil_Defence_Cadet_Corps) - National Police Cadet Corps Singapore 1°22′25.58″N 103°43′21.58″E﻿ / ﻿1.3737722°N 103.7226611°E﻿ / 1.3737722; 103.7226611\n",
  "language": "en",
  "processed_at": "2026-01-12T11:36:29.257137",
  "title": "National Police Cadet Corps",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/National_Police_Cadet_Corps"
}