{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:36:03.187314"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"National Council of Social Service\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(October 2022)* *(Learn how and when to remove this message)* The **National Council of Social Service** (**NCSS**) is a [statutory board](/wiki/Statutory_boards_of_the_Singapore_Government) under the [Ministry of Social and Family Development](/wiki/Ministry_of_Social_and_Family_Development) of the [Government of Singapore](/wiki/Government_of_Singapore). The organisation is the national coordinating body for Social Service Agencies (SSAs) in Singapore. SSAs are non-profit organisations that provides welfare or social service to vulnerable or disadvantaged groups in Singapore, and in 2018 were renamed from the term [Voluntary Welfare Organisations](/wiki/Voluntary_Welfare_Organisations) (VWOs). SSAs are members of NCSS. A SSA is therefore not a legal structure (they can be registered as societies or companies limited by guarantee), but a classificatory category used to describe a subset of voluntary organisations in the business of providing direct welfare services. The Social Service Institute and the [Community Chest](/wiki/The_Community_Chest_of_Singapore) are part of the National Council of Social Service. - [List of social service agencies in Singapore](/wiki/List_of_social_service_agencies_in_Singapore) - 2. Survey of the Social Service Sector This Singaporean organisation article is a stub. You can help Wikipedia by expanding it. - v - t - e This article about government in Asia is a stub. You can help Wikipedia by expanding it.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:36:03.187011",
  "title": "National Council of Social Service",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/National_Council_of_Social_Service"
}