{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:36:27.834577"
  },
  "content": "Oath of allegiance to Singapore The **National Pledge** is an [oath of allegiance](/wiki/Oath_of_allegiance) to the [Republic of Singapore](/wiki/Republic_of_Singapore). It is commonly recited by Singaporeans in unison at public events, especially in schools, in the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces) and during the [National Day Parade](/wiki/Singapore_National_Day_Parade). ## Origin The National Pledge was written by [Sinnathamby Rajaratnam](/wiki/Sinnathamby_Rajaratnam) in 1966 shortly after [Singapore's independence](/wiki/History_of_Singapore). Rajaratnam revealed that the dream was to build \"a Singapore we are proud of\". He believed that [language](/wiki/Language), [race](/wiki/Race_(classification_of_human_beings)) and [religion](/wiki/Religion) were divisive factors, but the Pledge emphasises that these differences can be overcome if Singaporeans cared enough about their country. The draft text was handed to the then [Prime Minister](/wiki/Prime_Minister_of_Singapore) [Lee Kuan Yew](/wiki/Lee_Kuan_Yew), who polished the text before submitting it to the [Cabinet](/wiki/Cabinet_of_Singapore). The finalised pledge was first recited on 24 August 1966 by students of all state schools. ## Guidelines for usage The Singapore government's guidelines for the use of the pledge are: 1. The National Pledge is recited in schools on all school days, either in the morning or afternoon, during SAF Day, during the National Day Parade, and at National Day Observance Ceremonies. 2. Individuals reciting the Pledge shall clench their right fists to the left side of their chests as a gesture to symbolise loyalty to the nation. 3. When taking the National Pledge, individuals should recite the National Pledge in full. 4. The National Pledge should not be used for any commercial purpose unless prior approval is given. 5. The National Pledge should not be used in a disrespectful manner. - [Declaration of Religious Harmony](/wiki/Declaration_of_Religious_Harmony)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:36:27.834315",
  "title": "National Pledge (Singapore)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/National_Pledge_(Singapore)"
}