{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:36:00.443761"
  },
  "content": "1°19′00″N 103°49′02″E﻿ / ﻿1.3167°N 103.8171°E﻿ / 1.3167; 103.8171 The **National Biodiversity Centre** ([abbr.](/wiki/Abbreviation): **NBC**; [Chinese](/wiki/Simplified_Chinese): 国家生物多样性中心; [Malay](/wiki/Malay_language): *Pusat Kepelbagaian Bio Nasional*; [Tamil](/wiki/Tamil_language): தேசிய பல்வகை உயிரியல் நிலையம்) is a branch of the [National Parks Board](/wiki/National_Parks_Board) and serves as [Singapore](/wiki/Singapore)'s one-stop centre for biodiversity-related information and activities. It manages all available information and data on biodiversity in Singapore. Diverse biodiversity-related information and data are currently generated, stored and updated by different organisations and individuals. The National Biodiversity Centre will maximize the usefulness of such information and data by linking them in a single meta-database. Having complete and up-to-date information is crucial for many decision-making processes involving biodiversity. This hub of biodiversity information and data at the National Biodiversity Centre will also allow knowledge gaps to be better identified and addressed. The National Biodiversity Centre takes responsibility for the conservation of both terrestrial and marine flora and fauna in Singapore and represents the [National Parks Board](/wiki/National_Parks_Board) in its role as the government's scientific authority on nature conservation. The National Biodiversity Centre will also represent Singapore in various biodiversity-related international and regional conventions, including the [Convention on Biological Diversity](/wiki/Convention_on_Biological_Diversity), [ASEAN Center for Biodiversity](/wiki/ASEAN_Center_for_Biodiversity), ASEAN Working Group on Nature Conservation and Biodiversity and ASEANET. ## History The National Biodiversity Centre was formerly the Conservation Branch of National Parks Board. On 1 April 2003, it was renamed as the Biodiversity Centre. On 22 May 2006, the National Biodiversity Reference Centre was established. It was first mentioned to the public at the Biodiversity of Singapore Symposium in 2003 by [Vivian Balakrishnan](/wiki/Vivian_Balakrishnan). In January 2008, it was renamed as the National Biodiversity Centre. ## Organisation structure The National Biodiversity Centre is a branch of the Conservation Division of National Parks Board. NBC consists of four departments; the Coastal and Marine Environment Program Office, International Relations, Marine and Terrestrial. ### Coastal and Marine Environment Program Office The Coastal and Marine Environment Program Office (CMEPO) was established in April 2008 in order to foster greater inter-agency coordination on coastal and marine environment issues and also to strengthen Singapore's strategic capacity in areas related to the coastal and marine environment. The government agencies involved include [Ministry of Foreign Affairs (Singapore)](/wiki/Ministry_of_Foreign_Affairs_(Singapore)), [Ministry of the Environment and Water Resources](/wiki/Ministry_of_the_Environment_and_Water_Resources), [National Environment Agency](/wiki/National_Environment_Agency), [Ministry of Transport (Singapore)](/wiki/Ministry_of_Transport_(Singapore)), [Maritime and Port Authority of Singapore](/wiki/Maritime_and_Port_Authority_of_Singapore), [Ministry of National Development (Singapore)](/wiki/Ministry_of_National_Development_(Singapore)) and [National Parks Board](/wiki/National_Parks_Board). CMEPO works to provide Singapore with a strong basis in coastal and marine environment related policy, management and research-direction issues, consistent with Singapore's long-term economic and sustainable development goals. The CMEPO undertakes a wide range of technical projects in areas such as ecology and the environment, coastal dynamics, legislation and regulations, and other technical areas of coastal and marine environment concern. ### International Relations The International Relations department administers regional and international environmental agreements, provides policy analysis of environmental agreements and monitors regional and international developments relevant to biodiversity conservation. It coordinates both the work related to the Convention on Biological Diversity and [ASEAN Cooperation](/wiki/ASEAN) on nature conservation and biodiversity and also inter-agency positions on biodiversity-related topics. It also provides policy support to the work of the National Biodiversity Centre and is currently assuming the role of Secretariat in the development of the Cities Biodiversity Index (CBI). ### Marine The Marine department has a mandate and responsibility to ensure that Singapore's rich but limited marine biodiversity is conserved as part of her natural heritage. The Marine department regularly establishes and reviews policies related to marine conservation in Singapore and provides up-to-date baseline information on marine biodiversity for decision-making. Development proposals that have potential impacts on marine biodiversity will also be analysed and mitigation measures implemented. The Marine department promotes awareness of the importance of marine biodiversity and its conservation. ### Terrestrial The Terrestrial department conducts regular field surveys in Singapore's nature reserves, nature parks, park connectors and nature areas in order to increase the baseline on biodiversity-related data in Singapore's terrestrial and freshwater ecosystems. Key projects include the Banded Leaf Monkey Conservation Programme. ## Initiatives and products ### National Biodiversity Strategy and Action Plan The National Biodiversity Strategy and Action Plan (NBSAP) is a document published by the National Biodiversity Centre that maps out Singapore's master plan for biodiversity conservation. It aims to promote biodiversity conservation by adopting a pragmatic approach to conservation and develop unique solutions to her challenges as Singapore is a densely populated country with no hinterland. It intends to establish both policy frameworks and specific measures to ensure better planning and co-ordination in the sustainable use, management and conservation of Singapore's biodiversity. Inputs from various public sector agencies and nature groups have been taken into consideration in the preparation of the NBSAP. This master plan also fulfils Singapore's regional and international commitments, primarily the [Convention on Biological Diversity](/wiki/Convention_on_Biological_Diversity). ### Singapore Red Data Book The Singapore Red Data Book contains in-depth information of all threatened flora and fauna species in Singapore. This book is the result of collaborative efforts from various governmental and non-governmental organisations. It was first published in 1994, and revised in 2008 with more relevant and authoritative information provided by a wide range of expert contributors from organisations, such as the National Biodiversity Centre of [National Parks Board](/wiki/National_Parks_Board), [National University of Singapore](/wiki/National_University_of_Singapore) and the [Nature Society (Singapore)](/wiki/Nature_Society_(Singapore)) with sponsorship from Shell Singapore. ### The Singapore Index on Cities' Biodiversity Global demographic trends indicate that the degree of urbanisation will increase and that more people will live in cities. In 2008, more than half of the world's population lived in cities. [Singapore](/wiki/Singapore), though being a highly urbanised island-city-state, retain a rich array of biodiversity by virtue of its geographical location within a biodiversity hotspot. Therefore, Singapore is well suited and equipped with relevant expertise to establish a cities' biodiversity index. Hence, Singapore's Minister for National Development, Mr [Mah Bow Tan](/wiki/Mah_Bow_Tan), proposed the establishment of an index to measure biodiversity in cities at the 9th Meeting of the Parties to the [Convention on Biological Diversity](/wiki/Convention_on_Biological_Diversity) in [Bonn](/wiki/Bonn), [Germany](/wiki/Germany) in May 2008. To lay out the details for the index, the Secretariat of the [Convention on Biological Diversity](/wiki/Convention_on_Biological_Diversity) and the [National Parks Board](/wiki/National_Parks_Board) of Singapore jointly organised a Technical Expert Workshop on **The Singapore Index on Cities' Biodiversity**. 17 technical experts on biodiversity indicators as well as city executives responsible for implementation and management of biodiversity and urban projects attended the workshop. The Singapore Index on Cities' Biodiversity would measure performance and assign scores based on three categories.[*unreliable source?*] - Biodiversity – the number of plant, animal and other species that exist in a city - The services that these plants and animals provide, such as pollination and as carbon sinks - How well a city manages its biodiversity – for instance, by setting up a conservation agency or a museum to document species and habitats The Index will be presented for endorsement during the 10th Meeting of the Parties to the [Convention on Biological Diversity](/wiki/Convention_on_Biological_Diversity) in [Nagoya](/wiki/Nagoya), [Japan](/wiki/Japan) in October 2010. A User's Manual for the Singapore Index on Cities’ Biodiversity is available online. ## Key conservation activities and initiatives ### Comprehensive Marine Biodiversity Survey of Singapore A three-year national-scale comprehensive survey of marine biodiversity will be conducted in Singapore from August 2010 and onwards, with The National Parks Board and National Biodiversity Centre's coordinating agencies. Marine habitats and ecosystems to be surveyed include the mangrove mudflats, inter-tidal areas, offshore coral reefs, seagrass lagoons and the sea floor. The data gathered will be stored in a national, public database. This scientific knowledge will be used to support policy recommendations regarding protected areas and generate recommendations on how industries can be developed with minimal impacts to marine life. ### Coastal protection and restoration at Pulau Tekong The [National Parks Board](/wiki/National_Parks_Board) (NParks) will be conducting coastal protection and restoration works at the north-eastern coastline of Pulau Tekong which suffers from coastal erosion. NParks' National Biodiversity Centre stated that the erosion resulted from the movements of ships and strong waves in the area. A study NParks commissioned in 2006 found that 1.65 km of the north-eastern shore is most severely affected. The coastal erosion poses a threat to the 92 hectares of mangroves in Pulau Tekong which is one of the largest remaining mangrove areas in Singapore with a mature and undisturbed habitat. ### \"BiodiverCity\" \"BiodiverCity\" is a photo competition and exhibition organised to support the International Year of Biodiversity by celebrating the rich biodiversity found in Singapore's urban environment. The National Biodiversity Centre and the Photographic Society of Singapore hope to show that it is also a haven for biodiversity. ### Coral Nursery Project In order to enhance and restore the current coral cover in Singapore, a coral nursery was established off Pulau Semakau in 2007. It is the first coral nursery in the region to utilise \"corals of opportunity\" as seed corals for growth and transplantation. Unlike other commercial methods which breaks up healthy coral colonies for planting, this method uses coral fragments that lie free on the reef having been naturally fragmented by wave impacts. Coral fragments that have been successfully grown in the coral nursery are then transplanted onto the degraded reef sites off the southern coast of Singapore. This project is spearheaded by the National Biodiversity Centre and the [National University of Singapore](/wiki/National_University_of_Singapore) with sponsorship from [Keppel Corporation](/wiki/Keppel_Corporation) and support from the [National Environment Agency](/wiki/National_Environment_Agency). ### Study on dragonflies A two-year field study initiated by the National Biodiversity Centre revealed that 40 of the more than 120 species in Singapore are living in park ponds, with the majority found at [Bishan Park](/wiki/Bishan_Park), [Kent Ridge Park](/wiki/Kent_Ridge_Park), and [Toa Payoh Town Park](/wiki/Toa_Payoh_Town_Park) outside of the nature reserves. This study will help the National Parks Board further enhance and protect dragonflies, and create new habitats for them. Since a dragonfly larvae lives in water and requires that the water is unpolluted to survive, the National Biodiversity Centre aims to use dragonflies as a bio-indicator of a good fresh water ecosystem. ### Hornbill Conservation Project The National Biodiversity Centre, in partnership with Wildlife Reserves Singapore, [Nanyang Technological University](/wiki/Nanyang_Technological_University), and researchers Marc Cremades and Ng Soon Chye, implemented the Hornbill Conservation Project to aid in the breeding and recovery of the [Oriental pied hornbill](/wiki/Oriental_pied_hornbill) (*Anthracoceros albirostris*) which had previously become extinct in Singapore but has since started to re-establish itself. Hornbills require tree cavities to nest in. However, tree cavities of sufficient size to accommodate the female hornbill and her young are not common in Singapore. The implementation of artificial nest boxes have been successful and video cameras are even installed within the nest boxes to provide a better understanding of the behavioural and feeding patterns of these birds. ### Banded leaf monkey conservation The National Biodiversity Centre, in partnership with the Evolution Lab of the National University of Singapore, initiated an ecological study of [banded leaf monkeys](/wiki/Banded_leaf_monkey) (*Presbytis femoralis*) in order to propose conservation management recommendations and maintain a viable population in the long term. Comprehensive surveys were conducted to determine the population number, demography, home range, behaviour and communication, food choices, habitat and also anthropogenic interferences on the banded leaf monkeys. The banded leaf monkey is one of four primate species native to Singapore. However, rapid urbanisation and habitat loss exterminated the population at [Bukit Timah Nature Reserve](/wiki/Bukit_Timah_Nature_Reserve). Today, they are restricted to a small area within the Central Catchment Nature Reserve with a population size of about 40 individuals. ### Seagrass monitoring The [National Parks Board](/wiki/National_Parks_Board), [National Biodiversity Centre](/wiki/National_Biodiversity_Centre), TeamSeagrass and volunteers from the public regularly conduct surveys and monitoring of the seagrasses found in Singapore, in inter-tidal areas such as [Chek Jawa](/wiki/Chek_Jawa) and [Pulau Semakau](/wiki/Pulau_Semakau). These surveys are part of Seagrass-Watch, a global seagrass assessment and monitoring programme spanning 18 countries with more than 200 monitoring sites worldwide. Non-destructive scientific surveying methods developed by Seagrass-Watch are adopted. Data gathered is then fed back to Seagrass-Watch headquarters, which then analyses the trends and condition of seagrass habitats at the local, regional and global scale. - Biodiversity Centre (2006). *Third National Report under the Convention on Biological Diversity* (PDF). pp. 1–130.[*permanent dead link*] - Chan, L.; Djoghlaf, A. (2009). \"Invitation to help compile an index of biodiversity in cities\". *Nature*. **460** (7251): 33. [Bibcode](/wiki/Bibcode_(identifier)):2009Natur.460...33C. [doi](/wiki/Doi_(identifier)):10.1038/460033a. [PMID](/wiki/PMID_(identifier)) 19571865. - Cheong, L. F.; Tang, H. B.; Ngiam, R. W. J. (2009). \"New Records for Singapore Dragonflies\" (PDF). *Agrion*. **13** (1): 8–13. Archived from the original (PDF) on 20 July 2011. Retrieved 26 May 2010. - Davison, G. W. H.; Ng, P. K. L.; H. C., Ho (2008). *The Singapore Red Data Book: Threatened Plants & Animals of Singapore*. Singapore: Nature Society of Singapore. p. 286. - Tan, K. S.; Chan, L.; Chou, L. M.; Ng, P. K. L. (2009). \"Fourteenth International Marine Biology Workshop 2006: The Marine Flora and Fauna of Singapore\". *[Raffles Bulletin of Zoology](/wiki/Raffles_Bulletin_of_Zoology)* (22): 1–3. - National Biodiversity Centre, Singapore - National Parks Board, Singapore - The Singapore Index on Cities' Biodiversity\n",
  "language": "en",
  "processed_at": "2026-01-12T11:36:00.443468",
  "title": "National Biodiversity Centre (Singapore)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/National_Biodiversity_Centre_(Singapore)"
}