{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:36:36.320806"
  },
  "content": "Singaporean political partyThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"National Solidarity Party\" Singapore – news **·** newspapers **·** books **·** scholar **·** JSTOR *(June 2019)* *(Learn how and when to remove this message)* The **National Solidarity Party** ([abbreviation](/wiki/Abbreviation): **NSP**) is a [political party](/wiki/List_of_political_parties_in_Singapore) in [Singapore](/wiki/Singapore). It has participated in all parliamentary elections since the [1988 general election](/wiki/1988_Singapore_general_election). ## History ### Beginnings The NSP was founded by a group of middle-class businesspeople on 6 March 1987. The founding president and secretary-general of the party were Kum Teng Hock and Soon Kia Seng respectively. Kum was a former member of the ruling [People's Action Party](/wiki/People%27s_Action_Party) (PAP) while Soon was the ex-chairman of the [Singapore Democratic Party](/wiki/Singapore_Democratic_Party). According to its 1995 manifesto, the main political objective of the NSP was to organise and maintain a democratic movement that would ensure the solidarity and establishment of a just political system and standard of living. The party believed in a multi-party political system so that the rights and interests of the people could be proportionately represented. The NSP also aimed to establish an open and freely competitive economic environment that would provide sufficient opportunities for local enterprises. Today, the NSP continues to strive for these values. It continues to promote the establishment of a multi-party political system as well as a pro-business economic environment. NSP made their political debut in the [1988 general election](/wiki/1988_Singapore_general_election), and has contested in every election since. NSP also had contested in the [1992 by-election](/wiki/1992_Singaporean_by-election) for the constituency of [Marine Parade GRC](/wiki/Marine_Parade_GRC), which was led by [Prime Minister](/wiki/Prime_Minister_of_Singapore) [Goh Chok Tong](/wiki/Goh_Chok_Tong). ### As member of Singapore Democratic Alliance Ahead of the [2001 general election](/wiki/2001_Singapore_general_election), the NSP became a founding member of the [Singapore Democratic Alliance](/wiki/Singapore_Democratic_Alliance) (SDA), along with the [Singapore Justice Party](/wiki/Singapore_Justice_Party) (SJP), the [Singapore People's Party](/wiki/Singapore_People%27s_Party) (SPP) and the [Singapore Malay National Organization](/wiki/Singapore_Malay_National_Organization) (PKMS). The Chairman of the alliance was the SPP leader and Member of Parliament (MP) for [Potong Pasir](/wiki/Potong_Pasir_Single_Member_Constituency), [Chiam See Tong](/wiki/Chiam_See_Tong) (who was the SDA's only candidate-elect until 2011). On the polling day, the party's secretary General [Steve Chia](/wiki/Steve_Chia), who contested the [Chua Chu Kang Single Member Constituency](/wiki/Chua_Chu_Kang_Single_Member_Constituency) but defeated with a vote share of 34.6%, was the highest percentage secured by a losing opposition candidate at the election, and Chia assumed his [Non-Constituency Member of Parliament](/wiki/Non-Constituency_Member_of_Parliament) (NCMP) post, becoming the first non [Workers' Party](/wiki/Workers%27_Party_(Singapore)) (WP) NCMP to do so. In the [2006 general election](/wiki/2006_Singapore_general_election), Chia lost his election but increased his margin to 39.63%. Despite this, he lost his position as a NCMP and did not return to Parliament (the highest percentage among losing candidates was for the WP team of [Aljunied GRC](/wiki/Aljunied_Group_Representation_Constituency) at 43.9%; party's chairman [Sylvia Lim](/wiki/Sylvia_Lim) succeeded Chia for the NCMP role). ### Party rebuild and the 2011 general election In 2007, the NSP decided to withdraw from the SDA with a view to \"explore new possibilities through wider latitude to manoeuvre, re-engineer, and rebuild the NSP\". Sebastian Teo also took over the leadership of the party from Chia. The party acquired a new collective colour of orange for their activity jersey as a sign of vitality, rebirth and unity, and the newsletter underwent a transformation and adopted the new name *North Star*. In the [2011 election](/wiki/2011_Singaporean_general_election), the party fielded the most candidates of all Opposition parties for the election, with 24 candidates contesting in four Group Representation Constituencies ([Chua Chu Kang GRC](/wiki/Chua_Chu_Kang_GRC), [Jurong GRC](/wiki/Jurong_GRC), [Marine Parade GRC](/wiki/Marine_Parade_GRC) and [Tampines GRC](/wiki/Tampines_GRC)), and four Single Member Constituencies ([Mountbatten SMC](/wiki/Mountbatten_SMC), [Pioneer SMC](/wiki/Pioneer_SMC), [Radin Mas SMC](/wiki/Radin_Mas_SMC) and [Whampoa SMC](/wiki/Whampoa_SMC)). This election saw a boost in electoral support for the NSP, notably receiving endorsement from the newly formed [Reform Party](/wiki/Reform_Party_(Singapore)) along their supporters. The party was led by Secretary-General [Goh Meng Seng](/wiki/Goh_Meng_Seng) (a former WP candidate), and saw introductions to prominent candidates, which include [Nicole Seah](/wiki/Nicole_Seah), [Hazel Poa](/wiki/Hazel_Poa), [Tony Tan Lay Thiam](/wiki/Tony_Tan_Lay_Thiam) and [Jeanette Chong-Aruldoss](/wiki/Jeannette_Chong-Aruldoss). However, despite fielding notable candidates such as former MP [Cheo Chai Chen](/wiki/Cheo_Chai_Chen) and entrepreneur Poa, the party was defeated in all the contested constituencies; Goh resigned from his post shortly after the election. ### General Election 2015 The party expressed intention to contest five constituencies ([MacPherson](/wiki/MacPherson_Single_Member_Constituency), Marine Parade, Pioneer, Sembawang and Tampines), but the party shortly dropped out on MacPherson and Marine Parade, citing the possibility of multi-cornered contests that were likely to dilute the votes from the incumbent opposition WP and reducing the chance for a more diverse Parliament. The party later changed their mind a few days later, and announced their intention to contest MacPherson SMC citing closeness with the constituency as they had contested there in the prior election. In a response, a few party members, such as acting secretary-general Poa and a CEC member Fazli Talip, resigned from NSP, citing that they were strongly opposed to the controversial decision to contest MacPherson. The party initially fielded Chia as the candidate, but he later withdrew on 23 August due to the online abuse that received from him, and the party eventually chose Cheo as a candidate. [Lim Tean](/wiki/Lim_Tean) was appointed as acting-secretary general following Poa's resignation. Prior to the election, a few prominent members, such as Seah and Chong-Aruldoss, left the party. Seah and Chong-Aruldoss later joined WP and SPP, respectively. During the campaigning period, Cheo drew public outcry on an interview citing MacPherson's incumbent [Tin Pei Ling](/wiki/Tin_Pei_Ling)'s status as a new mother was \"her weakness\" and saying that she might spend more time focusing on her child than on her constituents, and later claimed it as a joke. On 8 September, Tampines GRC candidate Choong Hon Heng's rally on [booing](/wiki/Booing) PAP had gone viral. The party failed to win any of the constituencies, and Cheo had his S$14,500 [electoral deposit](/wiki/Deposit_(politics)) forfeited as a consequence of garnering less than 12.5% of the valid votes cast for MacPherson (215 or 0.82%). Lim resigned from his post and left NSP in May 2017, and formed his new party, [Peoples Voice](/wiki/Peoples_Voice_(Singapore)), in October 2018. ### General Election 2020 The party fielded a total of 10 candidates and contested Sembawang and Tampines in the [2020 elections](/wiki/2020_Singaporean_general_election). The party also expressed interest in contesting MacPherson and Pioneer, but both withdrew and respectively backed the [People's Power Party](/wiki/People%27s_Power_Party_(Singapore)) and [Progress Singapore Party](/wiki/Progress_Singapore_Party). Ahead of elections, Chia resigned from NSP and joined the [Singapore People's Party](/wiki/Singapore_People%27s_Party) and became the new secretary-general a year later. On polling day on 10 July, the party failed to win any GRCs, but improved their vote share for each GRC. ### The Coalition In October 2023, NSP joined [Singapore United Party](/wiki/Singapore_United_Party), [Red Dot United](/wiki/Red_Dot_United) and former SDA partner SPP to form a political alliance, [The Coalition](/wiki/The_Coalition_(Singapore)). The alliance was not officially registered, but partners were to contest the [next election](/wiki/2025_Singaporean_general_election) under their own party tickets while collaborating their efforts to avoid 3-cornered contests among Coalition partners. ### General Election 2025 #### GE2025 Outcomes Slate of Candidates and Electoral Results ConstituencyCandidatesVotesPercentageNumberSembawang GRC (lost $67,500 deposit)Spencer Ng2.32%2,878Raiyian ChiaLee WeiVerina OngYadzeth HarisTampines GRC (lost $67,500 deposit)Reno Fong0.18%249Ridzwan MohammadZee PhayThamilselvam KaruppayaYeo Ren-Yuan #### Pre-Election In the [2025 election](/wiki/2025_Singaporean_general_election), the party contested in both Sembawang and Tampines GRCs. Both of these were multi-cornered fights, with a three-cornered fight against the SDP and incumbent PAP in Sembawang GRC, and a four-cornered fight against the PAP, WP and PPP in Tampines GRC. The NSP had also declined to contest in Sembawang West SMC and Tampines-Changkat SMC, instead choosing to yield to the SDP and WP respectively. #### Election results Ultimately, the NSP won neither of the constituencies and suffered its heaviest defeats since the party's inception, as both its teams lost their $67,500 deposits. The NSP's Tampines GRC team also garnered Singapore's lowest-ever vote share in any election since independence, securing just 0.18% of the votes, or 249 votes. Their Sembawang team did not fare much better, securing just 2.32%, or 2,878 votes. Following the party's dismal performance in GE2025, NSP Secretary-General [Spencer Ng](/wiki/Spencer_Ng) declared that the NSP was \"not going to abide by … gentlemen's rules anymore\", and decried the idea of \"opposition unity\" as a mere \"illusion.\" This was presumably a reference to how the NSP had earlier yielded to the SDP and WP in two SMCs. Moreover, according to Ng, the results also showed that Singaporean voters had rejected more \"centralised and moderate\" parties such as the NSP in favour of other more \"radical\" opposition parties. ## Political positions NSP has described itself as a centrist party that believes in \"fair competition, low unemployment and wealth redistribution.\" For the 2025 general election, NSP published their manifesto titled \"Your Future, Our Priority\". ### Economic policy NSP is opposed to [trickle-down economics](/wiki/Trickle-down_economics), instead proposing a minimum wage and green transition fund. ### Government transparency In its 2025 manifesto, NSP stated that they would hold institutions accountable and conduct independent reviews of government policies. The party also opposes top-down governance and commits to be Singapore’s independent conscience in Parliament. ### Youth NSP supports mandatory youth representation in national advisory councils, and proposes for the formation of a platform named Youth Assembly SG. In this proposed platform, young Singaporeans can table and vote on policy ideas with a parliamentary response. ## Leadership The NSP is led by the president while the secretary-general is the second-in-command. ### List of secretaries-general NoNameYears1Soon Kia Seng19872Ken Sunn19883Rasiah Thiagarajah1988–19894Ken Sunn1989–19935Yip Yew Weng1993–20016[Steve Chia](/wiki/Steve_Chia)2001–20057Law Sin Ling2006–20088Ken Sunn2008–20099[Goh Meng Seng](/wiki/Goh_Meng_Seng)2010–201110[Hazel Poa](/wiki/Hazel_Poa)2011–201311[Jeannette Chong-Aruldoss](/wiki/Jeannette_Chong-Aruldoss)2013–201512Tan Lam Siong201513Hazel Poa201514[Lim Tean](/wiki/Lim_Tean)2015–201715[Spencer Ng](/wiki/Spencer_Ng)2017–present ### 19th Central Executive Council TitleNamePresidentReno FongVice-PresidentRidzuan MohamedSecretary-General[Spencer Ng](/wiki/Spencer_Ng)Assistant Secretary-GeneralEugene YeoTreasurerRaymond ChuaAssistant TreasurerIvan YeoOrganising SecretarySean M.MemberSebastian TeoMemberYip Yew WengMemberOng Hock SiongMemberYadzeth Haris ## Electoral performance ### Parliament Due to a merger with the [Singapore Democratic Alliance](/wiki/Singapore_Democratic_Alliance) (SDA) in the 2001 and 2006 elections, collective figures represent the SDA total inclusive of the NSP, while figures in parenthesis/brackets refer to the NSP only. ElectionLeaderVotes%SeatsNCMPsPositionResultContestedTotal+/–SeatsWonLost(/wiki/1988_Singaporean_general_election)Kum Teng Hock50,4323.8%8080 / 810 / 2 4thNo seats(/wiki/1991_Singaporean_general_election)Rasiah Thiagarajah57,3067.3%8080 / 81—N/aNo seats(/wiki/1997_Singaporean_general_election)Tan Chee Kien48,3226.7%7070 / 830 / 1No seats(/wiki/2001_Singaporean_general_election)[Chiam See Tong](/wiki/Chiam_See_Tong)[a]75,24812.0%13 (9)1 (0)12 (9)1 / 84 11 / 1 2ndOpposition(/wiki/2006_Singaporean_general_election)145,62813.0%20 (11)1 (0)19 (11)1 / 840 / 1 3rdOpposition(/wiki/2011_Singaporean_general_election)[Goh Meng Seng](/wiki/Goh_Meng_Seng)244,68212.04%240240 / 87 10 / 3No seats(/wiki/2015_Singaporean_general_election)[Lim Tean](/wiki/Lim_Tean)79,8263.53%120120 / 890 / 3 4thNo seats(/wiki/2020_Singaporean_general_election)[Spencer Ng](/wiki/Spencer_Ng)93,6533.75%100100 / 930 / 2 5thNo seats(/wiki/2025_Singaporean_general_election)3,1210.13%100100 / 970 / 2 12thNo seats #### Seats contested Constituencies won are in **bold** ElectionConstituencies contestedContested vote %+/–(/wiki/1988_Singaporean_general_election)[3-member GRC](/wiki/Group_representation_constituency): [Tampines](/wiki/Tampines_Group_Representation_Constituency); [SMC](/wiki/Constituencies_of_Singapore): [Ang Mo Kio](/wiki/Ang_Mo_Kio_Single_Member_Constituency), [Kebun Bahru](/wiki/Kebun_Baru_Single_Member_Constituency), [MacPherson](/wiki/MacPherson_Single_Member_Constituency), [Whampoa](/wiki/Whampoa_Single_Member_Constituency), [Yio Chu Kang](/wiki/Yio_Chu_Kang_Single_Member_Constituency)34.6%—N/a(/wiki/1991_Singaporean_general_election)4-member GRC: [Cheng San](/wiki/Cheng_San_Group_Representation_Constituency), Tampines37.9% 3.3%(/wiki/1997_Singaporean_general_election)5-member GRC: [Hong Kah](/wiki/Hong_Kah_Group_Representation_Constituency); SMC: [Boon Lay](/wiki/Boon_Lay_Single_Member_Constituency), [Chua Chu Kang](/wiki/Chua_Chu_Kang_Single_Member_Constituency)30.1% 7.8%(/wiki/2001_Singaporean_general_election)5-member GRC: [Jalan Besar](/wiki/Jalan_Besar_Group_Representation_Constituency), Tampines; SMC: [Bukit Timah](/wiki/Bukit_Timah_Single_Member_Constituency), Chua Chu Kang, [**Potong Pasir**](/wiki/Potong_Pasir_Single_Member_Constituency)27.6%—N/a(/wiki/2006_Singaporean_general_election)6-member GRC: [Pasir Ris-Punggol](/wiki/Pasir_Ris%E2%80%93Punggol_Group_Representation_Constituency); 5-member GRC: Jalan Besar, Tampines; SMC: Chua Chu Kang, MacPherson, **Potong Pasir**, Yio Chu Kang32.5% 4.9%(/wiki/2011_Singaporean_general_election)5-member GRC: Chua Chu Kang, [Jurong](/wiki/Jurong_Group_Representation_Constituency), [Marine Parade](/wiki/Marine_Parade_Group_Representation_Constituency), Tampines; SMC: [Mountbatten](/wiki/Mountbatten_Single_Member_Constituency), [Pioneer](/wiki/Pioneer_Single_Member_Constituency), [Radin Mas](/wiki/Radin_Mas_Single_Member_Constituency), Whampoa39.3%—N/a(/wiki/2015_Singaporean_general_election)5-member GRC: [Sembawang](/wiki/Sembawang_Group_Representation_Constituency), Tampines; SMC: MacPherson,[b] Pioneer25.3% 14.0%(/wiki/2020_Singaporean_general_election)5-member GRC: Sembawang, Tampines33.2% 7.9%(/wiki/2025_Singaporean_general_election)5-member GRC: Sembawang,[b] Tampines[b]1.2%[c] 32.0% ### By-election ElectionLeaderConstituency contestedVotes%SeatsResultContestedTotal+/–WonLost(/wiki/1992_Singaporean_by-election)Ken Sunn[Marine Parade GRC](/wiki/Marine_Parade_GRC)9501.4%040 / 4Lost - [List of political parties in Singapore](/wiki/List_of_political_parties_in_Singapore) - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:36:36.320469",
  "title": "National Solidarity Party (Singapore)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/National_Solidarity_Party_(Singapore)"
}