{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:35:57.287184"
  },
  "content": "Statutory board for Singapore**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"National Arts Council, Singapore\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(April 2016)* *(Learn how and when to remove this message)*This article **relies excessively on references to primary sources**. Please improve this article by adding secondary or tertiary sources. *Find sources:* \"National Arts Council, Singapore\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(March 2018)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* The **National Arts Council** (**NAC**) is a [statutory board](/wiki/Statutory_boards_of_the_Singapore_Government) established on 15 October 1991 to oversee the development of arts in [Singapore](/wiki/Singapore). It is under the purview of the [Ministry of Culture, Community and Youth](/wiki/Ministry_of_Culture,_Community_and_Youth). The NAC provides grants, scholarships, awards and platforms for arts practitioners, as well as arts education and programmes for the general public. ## History In 1989, the Advisory Council on Culture and the Arts, chaired by Deputy Prime Minister [Ong Teng Cheong](/wiki/Ong_Teng_Cheong), produced a report assessing the status of various aspects of arts in Singapore. The report would form the blueprint for cultural policy in Singapore, and led to the establishment of the National Arts Council and [National Heritage Board](/wiki/National_Heritage_Board_(Singapore)) to spearhead the development of arts in Singapore. In 1991, the National Arts Council (NAC) was formed from the amalgamation of the Singapore Cultural Foundation, Cultural Division of Ministry of Community Development, Festival of Arts Secretariat and the National Theatre Trust. ## Organisation structure The NAC is made up of the following departments: Education and Development, Engagement and Participation, Strategic Planning and International Relations, Research, Sector Development and Precinct Development. They are supported by the Communications & Marketing, Information Technology, Human Resource & Administration and Finance departments. The current chairman for the NAC is Ms Goh Swee Chen. ## Supporting the industry The NAC provides funding infrastructure for Singapore's arts community. Each year, through its grants framework, the NAC aims to develop new and existing arts organisations, encourage production of, presentation of and participation in the arts, as well as provide training, research & development for market and audience development needs, both locally and internationally. NAC provides artists and arts groups with accessible performing venues for their productions, and to sustainable platforms where artists can collaborate with each other and interact with the wider public. The NAC also organises large scale festivals, providing a platform on an international scale to host artists' collaborations and interaction, concurrently engaging the public. The NAC is the sole organiser for Singapore Art Week. ## Community engagement The NAC works with other agencies to bring arts to the wider public. Through initiatives such as Arts & Disability Forum, Arts In Your Neighbourhood, Art Reach, National Arts Council - Arts Education Programme (NAC-AEP), Noise Singapore, Patron of the Arts Awards, and Silver Arts. ## Programmes The NAC organises and supports a range of nationwide and international events to grow and showcase Singapore's artistic talents: - [Cultural Medallion](/wiki/Cultural_Medallion) and [Young Artist Award](/wiki/Singapore_Young_Artist_Award) - Golden Point Award - Got To Move - Arts Weekend Civic District - Music Competitions (National Indian Music Competition, National Chinese Music Competition, National Piano & Violin Competition) - Singapore Art Week - [Singapore International Festival of Arts](/wiki/Singapore_International_Festival_of_Arts) - Singapore Writers Festival ## Controversies After artist [Josef Ng](/wiki/Josef_Ng)'s 1994 performance *Brother Cane*, in which he bared his buttocks and trimmed his pubic hair to protest media coverage of an anti-gay operation in 1992, for the years 1994 to 2004, the NAC withdrew funding support for the scriptless art forms of performance art as well as forum theatre. Condemning the expressions by both Ng and fellow performer Shannon Tham, who had vomited into a bucket as part of his act, the NAC stated: \"By no stretch of the imagination can such acts be construed and condoned as art.\" Ng and Tham were consequently banned by the NAC from ever performing in Singapore again. In 2000, the NAC objected to theatre group Agni Kootthu's planned staging of [Elangovan](/wiki/Elangovan)'s play *Talaq*, a one-woman show about an Indian Muslim woman's divorce, which had already been staged twice. They suggested that Agni Kootthu arrange a preview of the play for selected persons so that their recommendations would help the Public Entertainment Licence Unit (PELU) of the [Singapore Police Force](/wiki/Singapore_Police_Force) to decide on the licence application. When PELU refused to grant a licence, the NAC supported the staging of the play subject to some changes being made. Agni Kootthu instead decided to hold an invitation-only rehearsal to document the play at the Drama Centre, which it had booked beforehand. NAC, as the Drama Centre's landlord, decided to close the Drama Centre on those days, resulting in a four-hour standoff when S. Thenmoli, president of Agni Kootthu, arrived. The then-Executive Director of NAC called the police and Thenmoli was arrested for alleged trespassing. In the same year, the NAC withdrew funding of $8,000 from theatre group Drama Box's staging of *The VaginaLogue*, a one-woman show by Li Xie, because the group's artistic director [Kok Heng Leun](/wiki/Kok_Heng_Leun) declined to take down a projected image of a vagina that was used as a backdrop. As a result, the group lost money on the production. Three years later, the NAC declined to fund Drama Box's re-staging of the same play. In 2002, the NAC demanded that lines from [Alfian Sa'at](/wiki/Alfian_Sa%27at)'s play *Causeway*, staged by Teater Ekamatra, be removed due to its supposed incitement of cross-strait and racial tensions. In 2003, the NAC withdrew its funding of the journal *FOCAS: Focus on Contemporary Art and Society Vol. 5: Second FRONT* three days before it went to print. The suspected reason was playwright-poet [Alfian Sa'at](/wiki/Alfian_Sa%27at)'s essays, “The Racist’s Apology”, about being an indigenous Malay in Singapore, and one on NAC's censorship in previous issues of the journal. In 2006, the NAC informed an unnamed artist invited to the [Singapore Biennale](/wiki/Singapore_Biennale) that he would need a lawyer for his project, and that he would be held responsible if anything should go wrong in the project. He was also told that he would not receive further support unless he had engaged a lawyer which was not possible as a lawyer would have required half of the budget given. The proposed work had intended to interview 5 individuals who have been active in the arts scene in Singapore and the video recording would be presented as a 5-hour long screening during the Singapore Biennale 2006. The work was not completed and not presented at the Biennale. In 2007, the NAC removed artist-writer Jason Wee's essay, \"Raising the Subject\", from the catalogue for \"Raised\", an art festival that was part of the Singapore Art Show 2007 which thematically focused on migrant labor, reportedly because it included references to [Operation Spectrum](/wiki/Operation_Spectrum). In May 2010, the NAC cut the annual grant given to local theatre company [W!LD RICE](/wiki/W!LD_RICE). It got $170,000, down from $190,000 the year before. It is the lowest annual grant that the company has received from the council. Artistic director [Ivan Heng](/wiki/Ivan_Heng) says the council told him funding was cut because its productions promoted so-called \"alternative lifestyles\", were critical of government policies, and satirised political leaders. Veteran theatre company [TheatreWorks](/wiki/TheatreWorks_(Singapore)) also had its funding cut, from $310,000 to $280,000. Its artistic director [Ong Keng Sen](/wiki/Ong_Keng_Sen) was told that the company had to have more \"local presence\". In early 2011, the NAC revoked its publishing grant for playwright Chong Tze Chien's book *Four Plays* as it included the controversial play *Charged*. In late 2011, following a private preview, the [Singapore Art Museum](/wiki/Singapore_Art_Museum) removed Japanese-British artist [Simon Fujiwara](/wiki/Simon_Fujiwara)’s work, *Welcome to the Hotel Munber* (2010), which featured homoerotic content, despite appropriate advisory notices put up by the museum and the [Singapore Biennale](/wiki/Singapore_Biennale), organised by the NAC. This censorship was committed without any consultation with or notification of the artist. In May 2015, it withdrew $8,000 worth of funding after it deemed that the best-selling graphic novel *[The Art of Charlie Chan Hock Chye](/wiki/The_Art_of_Charlie_Chan_Hock_Chye)* by [Sonny Liew](/wiki/Sonny_Liew), which it had previously read in full in draft form and approved of, had \"sensitive content\" and the potential to \"undermine the authority and legitimacy of the government\". This led to a heated debate between artists and the council. From November to December 2015, NAC was involved in a fracas with local artists and academics after its CEO Kathy Lai and Chairman [Chan Heng Chee](/wiki/Chan_Heng_Chee) argued for the need for and defended NAC's use of censorship. This prompted calls to boycott the NAC. The NAC has also drawn criticisms for paying $410,000 in consultancy fees to undertake a study on a refuse collection centre for Victoria Theatre and [Victoria Concert Hall](/wiki/Victoria_Concert_Hall) in 2016, when the eventual bin centre cost $470,000 to build. National Development Minister [Lawrence Wong](/wiki/Lawrence_Wong) argued that an extensive study had to be done due to the location of the bin centre within the Civic District and that the project was \"delivered satisfactorily and at an acceptable cost\". In September 2023, *Today* published an article reporting on a queer-themed art performance to celebrate the 10th anniversary of [Nanyang Technological University Centre for Contemporary Arts](/wiki/Nanyang_Technological_University) (NTU CCA) Singapore. The article was originally published with the headline, \"LGBTQ-themed arts performances in public spaces in line with the times: National Arts Council Chief\" but later amended to \"LGBTQ-themed arts performances in public spaces in line with the times, says arts community\" after being accused by the NAC for misreporting comments made by Chief Low Eng Teong. Several back-to-back statements were released from both parties. *Today* in an editor's note accepted NAC's clarification and apologised for the published article. It had also changed the original article title. - National Arts Council Singapore - A page that showcase the murals in Singapore. Portal created by [http://www.socialcreatives.com Social Creatives. NGO that does Community Art to make society colourful visually and emotionally - Singapore Writers Festival - Noise Singapore Archived 2017-07-07 at the [Wayback Machine](/wiki/Wayback_Machine) - Singapore Arts Festival - National Arts Council - Arts Education Programme (NAC-AEP)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:35:57.286793",
  "title": "National Arts Council, Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/National_Arts_Council,_Singapore"
}