{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:36:11.526942"
  },
  "content": "Government agency of Singapore**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article's **tone or style may not reflect the encyclopedic tone used on Wikipedia**. See Wikipedia's guide to writing better articles for suggestions. *(October 2009)* *(Learn how and when to remove this message)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"National Environment Agency\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(September 2014)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* **National Environment Agency** (**NEA**) is a [statutory board](/wiki/Statutory_boards_of_the_Singapore_Government) under the [Ministry of Sustainability and the Environment](/wiki/Ministry_of_Sustainability_and_the_Environment) of the [Government of Singapore](/wiki/Government_of_Singapore). The NEA is responsible for improving and sustaining a clean and green environment in Singapore. Its role is to fight pollution, maintain public health, and provide meteorological information. On 1 April 2019, NEA's food related duties were absorbed by its successor [Singapore Food Agency](/wiki/Singapore_Food_Agency) (SFA) which also absorbed the food related duties of two other statutory boards namely [Agri-Food and Veterinary Authority of Singapore](/wiki/Agri-Food_and_Veterinary_Authority_of_Singapore) (AVA) and [Health Sciences Authority](/wiki/Health_Sciences_Authority) (HSA). SFA is a statutory board under the Ministry of Sustainability and the Environment. ## Organization NEA comprises three operational divisions: - Environmental Public Health - Environmental Protection - Meteorological Service Singapore ### Environmental Public Health Divisions The Environmental Public Health Division conducts comprehensive ground surveillance and takes preventive measures to ensure a high standard of [public health](/wiki/Public_health) and [hygiene](/wiki/Hygiene). It is responsible for the overall cleanliness in Singapore and imposes a high standard of hygiene requirements on the food retail industry. It also implements the [Hawker Centres](/wiki/Hawker_Centre) Upgrading Programme (HUP) and the Clean [Public Toilets](/wiki/Public_Toilet) Programme. It enforces smoking ban in places such as hawker centres, food shops, shopping centres, factories and offices; and conducts vector control against mosquitoes and rats. ### Environmental Protection Divisions The Environmental Protection Division is responsible for implementing programmes to monitor, reduce and prevent environmental pollution. It is also responsible for providing refuse disposal services through four waste-to-energy [incineration](/wiki/Incineration) plants and an off-shore sanitary landfill. To conserve energy resources and landfill space, the division implements programmes to minimise waste generation, and maximise recycling and energy conservation. ### Meteorological Service Singapore The [Meteorological Service Singapore](/wiki/Meteorological_Service_Singapore) (MSS) provides weather information to support public health and socio-economic activities. It also issues [haze](/wiki/2006_Southeast_Asian_haze) alerts and provides vital [meteorological services](/wiki/Meteorology) to the [aviation](/wiki/Aviation) and [maritime](/wiki/Sea) communities and the military. MSS is also on tsunami watch as part of a regional network set up after several coastal areas in Asia were devastated by the [2004 Indian Ocean earthquake and tsunami](/wiki/2004_Indian_Ocean_earthquake_and_tsunami). ## Highlights of environmental activities ### Dengue fever NEA adopts a multi-pronged approach – which includes surveillance and enforcement, community outreach and education, and research, to tackle vector-borne diseases such as [dengue fever](/wiki/Dengue_fever). Most recently, it rolled out educational home visits, where NEA officers visit homes in areas where there are less than 10 dengue cases, to educate residents on how to prevent mosquitoes from breeding in their homes. During these visits, the officers will highlight all potential mosquito breeding grounds in that particular home and the corrective measures the resident needs to undertake. No enforcement action will be taken against the resident for any mosquito breeding found on such visits. This approach has yielded good results, with Singapore successfully avoiding a serious dengue outbreak, as experienced in 2005 when 14,209 people were infected with the fever. From 2007 to 2011, the number of dengue cases were 8,826; 7,031; 4,497; 5,363; and 5,330 respectively. ### Public hygiene and cleanliness NEA plays an important role in overseeing the cleansing of public areas in Singapore. NEA takes a three-pronged approach to keeping our environment clean, which includes: Public Cleansing; Public Education and Enforcement. NEA maintain an effective system of public cleansing to keep Singapore clean and prevent environment-related diseases. The cleansing of public roads and pavements is largely carried out by contractors engaged by the NEA. The NEA works closely with their \"3P Partners\" (the people, public and private sectors) to promote anti-littering practices and to encourage members of the community to take ownership of their [litter](/wiki/Litter) and keep their surroundings clean. Regular checks on food establishments, swimming pools and public toilets are carried out to ensure that a high standard of hygiene is maintained. ### Climate change and energy efficiency In April 2006, Singapore announced accession to the [Kyoto Protocol](/wiki/Kyoto_Protocol). As a non-Annex I country, Singapore does not have targets set under KP, but it is eligible to participate in carbon credit exchanges arising from approved Clean Development Mechanism projects conducted in the country. The National Environment Agency is the designated authority coordinating CDMs. It is also spearheading ongoing measures to encourage [energy efficiency](/wiki/Efficient_energy_use) and lower carbon emissions. In April 2008, NEA launched the 10% Energy Challenge to get households to cut their electricity consumption by at least 10%. As part of this campaign, NEA collaborated with grassroots organizations and charities to train volunteers to conduct energy audits and identify wasteful energy consumption habits. On 11 September 2009, NEA signed a landmark Voluntary Agreement with 16 major retailers and suppliers, to provide more energy efficient appliances and encourage more Singapore households to purchase them. Under the Voluntary Agreement, participating retailers and suppliers will voluntarily commit to achieving targets set out by the NEA, including retiring stock of energy inefficient models and introducing more 3- and 4-tick models, so that energy efficient models form at least 50% of their model range after six months, and 60% of their model range after one year. Signatories also voluntarily commit to promote energy efficient appliances, as well as improve the availability and affordability of energy efficient appliances available in their stores. ### Waste management Since independence, Singapore's growing population and economy have resulted in a large increase in solid waste. In 1970, about 1,300 tonnes per day of [solid waste](/wiki/Solid_waste) were disposed of. This increased to 7,000 tonnes per day by 2006, a six-fold increase from 1970. To address the solid waste problem, Singapore has put in place an integrated [solid waste management](/wiki/Solid_waste_management) system that ensures that all waste that are not recycled, are collected and disposed of safely at [waste-to-energy](/wiki/Waste-to-energy) incineration plants or at the offshore sanitary landfill ([Semakau Landfill](/wiki/Semakau_Landfill)) in the case of non-incinerable waste. As a result, overall recycling rate has increased from 40% in 2000 to 56% in 2008. Waste growth has also been curtailed. The total waste (domestic and non-domestic) disposed of in 2008 was 7,179 tonnes per day, a 6% reduction as compared to 2000. As a result, the lifespan of Semakau Landfill has increased from 25–30 years to 35–40 years. - [Nature Society (Singapore)](/wiki/Nature_Society_(Singapore)) - [National Biodiversity Centre](/wiki/National_Biodiversity_Centre) - Official Website - Official Facebook Page - NEA Annual Report 2008/2009 - NEA Annual Report 2009/2010 - NEA Annual Report 2010/2011 - NEA Annual Report 2011/2012\n",
  "language": "en",
  "processed_at": "2026-01-12T11:36:11.526636",
  "title": "National Environment Agency",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/National_Environment_Agency"
}