{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:36:39.586161"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"National Youth Council Singapore\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(September 2016)* *(Learn how and when to remove this message)* The **National Youth Council** (**NYC**) is an autonomous agency under the [Ministry of Culture, Community and Youth](/wiki/Ministry_of_Culture,_Community_and_Youth) set up by the [Government of Singapore](/wiki/Government_of_Singapore) as the national co-ordinating body for youth affairs in [Singapore](/wiki/Singapore). ## Background The National Youth Council (NYC) was established on 1 November 1989 to be the central body responsible for the planning, coordination and management of youth affairs, based on the recommendations of the Advisory Council on Youth (Feb 1988 – Feb 1989) chaired by [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) and approved by then First Deputy Prime Minister [Goh Chok Tong](/wiki/Goh_Chok_Tong). It was expanded from the National Youth Coordinating Committee that was a non-executive body with no policy making powers, and would be placed under [People's Association](/wiki/People%27s_Association) (PA). On 1 January 2015, NYC was taken out of PA and restructured as an autonomous agency under the [Ministry of Culture, Community and Youth](/wiki/Ministry_of_Culture,_Community_and_Youth) (MCCY) with the addition of two operational divisions – [Outward Bound Singapore](/wiki/Outward_Bound_Singapore), which conducts national-level outdoor adventure-based education and leadership programmes, and the Youth Corps Singapore which runs youth volunteering and service leaders programmes. This would serve to strengthen NYC's national role as the central agency for youth development and engagement, broadening its reach to more diverse young people and partnering with youth sector organisations. [Edwin Tong](/wiki/Edwin_Tong), Minister for Culture, Community and Youth is the chairperson of the 16th Council. The Council comprises members from various government ministries, youth organisations, academic institutions, voluntary welfare organisations, media and private sector organisations. David Chua is the current chief executive officer of the organisation. - National Youth Council This Singaporean organisation article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:36:39.585789",
  "title": "National Youth Council Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/National_Youth_Council_Singapore"
}