{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:36:01.219676"
  },
  "content": "Military youth organizationThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"National Cadet Corps\" Singapore – news **·** newspapers **·** books **·** scholar **·** JSTOR *(March 2020)* *(Learn how and when to remove this message)*Military unit The **National Cadet Corps** (**NCC**) is a military-themed youth organisation supported by the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces) (SAF) and the [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)) (MOE). As of 2020, it had more than 11,000 members, including officers, cadet officers and cadets. The Corps is represented in 125 secondary schools with a total of 146 \"units\" comprising 108 \"Land units\", 20 \"Air units\" and 18 \"Sea units\". Formed in 1901, it is one of the country's oldest youth organisations. While NCC adopts military-style training and structure, it holds no actual military authority and primarily serves as an educational and character-building experience through structured simulation and drills. ## History The NCC traces its origins to the [Raffles Institution](/wiki/Raffles_Institution) Cadet Corps, as well as its rival [Saint Joseph's Institution](/wiki/St._Joseph%27s_Institution,_Singapore) Cadet Corps, the first military cadet organizations established in 1901 and 1906 respectively during these early days as a British colony. Originally affiliated to British Armed Forces units stationed in the island and later on the [Malaysian Armed Forces](/wiki/Malaysian_Armed_Forces), the current tri-service character of the Corps dates from January 1969, when the NCC was formalized as the country's sole military cadet organization. In April 1973, the NCC Act was passed, emphasizing the NCC's importance as a national institution. On 30 May 2001, the NCC HQ was opened at Amoy Quee Camp in an effort to move Headquarters NCC and its Land District Headquarters from Haig Road, Springleaf and Jalan Teck Whye Camps as part of the Corps Centennial. In 2021, the NCC celebrated its 120th anniversary. ## Activities ### Training Days Every unit conducts training at least once a week. Training days begin by the calling in of all cadets into their respective platoon by either the Unit Sergeant Major or Assistant Sergeant Major. Upon falling in, the Platoon Commander or Platoon Sergeants will conduct attendance taking. After all platoons have completed both attendance taking, a typical training day includes arms drills and marching drills. ### Technical Handling All cadets have to go through Technical Handling (Trainfire) lessons as part of the NCC Basic Trainfire Package in order to learn the proper procedures of handling the [SAR 21](/wiki/SAR_21). Lessons are conducted by SAF soldiers and NCC cadet officers. The Basic Trainfire Package includes stripping and assembly, marksmanship fundamentals, stoppages and remedies, and weapon reloading. Cadets have the opportunity of firing a [SAR 21](/wiki/SAR-21) rifle on firing ranges. Cadets first train on a computerised simulation before progressing on to shoot at live firing ranges. ### Drills All NCC units practice [drills](/wiki/Parade_(military)). Every year selected cadets are given the opportunity to attend the prestigious Advanced Drills Course (ADC), where they would learn advanced drills such as: Advanced Foot Drills, Rifle Drills, Flag Drills, Pace Stick Drills, and Sword Drills. Cadets who complete the course, will be able to proficiently impart drill knowledge to their unit. ### Teacher Officer Course The Teacher Officer Course is a 2-week course, designed for newly appointed NCC teachers-in-charge. The course provides the teachers with an understanding of the NCC curriculum and training sessions. Upon graduation, the teachers will graduate as NCC Second Lieutenants, or a higher rank depending on their military reservist rank, and are thereafter appointed as teacher officers. The highest achievable rank for a teacher officer is Major (MAJ), and all ranks have the suffix ‘NCC’ to distinguish them from the ranks of the SAF. ### Unit Every NCC Unit has four platoons: junior cadet, senior cadet, cadet leader and senior cadet leader. Every cadet that joins NCC is placed in the junior cadet platoon. Junior cadets have no rank when first joining, only receiving their first rank, Lance Corporal, after completing the Junior Cadet Proficiency Test. When a cadet reaches Secondary 2, they join the senior cadet platoon. Senior Cadets are able to attain the rank of Corporal by completing the Senior Cadet Proficiency Test. In Secondary 3, cadets join the cadet leader platoon, and may attain the rank of Third Sergeant by completing the Specialist Assessment. Four cadets from each unit are selected each year to attend the Senior Specialist Leadership Course, being promoted to the rank of First Sergeant upon course completion. In Secondary 4, cadets join the senior cadet leader platoon. One cadet from each NCC unit is selected each year to become the unit Sergeant Major or unit Assistant Sergeant Major, with the rank of Master Sergeant or Staff Sergeant. Cadets can return to their units after graduating from secondary school as cadet officers and are able to achieve the same ranks as teacher officers, however with a “C” prefix attached to their rank. ### Adventure Training Cadets have opportunities to attend adventure courses locally and overseas. NCC cadets are also able to attend courses such as the Basic Diving Course conducted by the RSN [Naval Diving Unit](/wiki/Naval_Diving_Unit_(Singapore)), as well as the Basic Airborne Course conducted by the [Singapore Armed Forces Commando Formation](/wiki/Singapore_Armed_Forces_Commando_Formation) ### International Cadet Exchange Programmes Every year selected cadets are given the opportunity to participate in various international exchanges with cadets from countries such as [Australia](/wiki/Australia), [Brunei](/wiki/Brunei), [Canada](/wiki/Canada), [New Zealand](/wiki/New_Zealand), the [United Kingdom](/wiki/United_Kingdom), the [United States of America](/wiki/United_States_of_America), [Hong Kong](/wiki/Hong_Kong), [India](/wiki/India) and [China](/wiki/China). This programme would be either done locally or overseas in the host country. ## The Singapore National Cadet Corps Command Band The Singapore National Cadet Corps Command Band is the musical unit of the NCC and a premier CCA in Swiss Cottage Secondary School. Serving the Corps since 1999, the Command Band's mission is to provide musical support for HQ NCC's military occasions such as the Teacher Officer Course Graduation Parade, Cadet Officer Course Graduation Parade, and Affirmation Ceremonies. In addition to serving HQ NCC, the Command Band has also provided musical support for the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces) and [Singapore Civil Defence Force](/wiki/Singapore_Civil_Defence_Force). Other military-related ceremonies which the Command Band is also involved in would include the Remembrance Day and War Memorial Services organised by the SAF Veterans League and the Singapore Chinese Chamber of Commerce and Industry. Since 2010, the Singapore NCC Command Band has been part of the Combined Band, providing the parade music for the Parade and Ceremony Segment of the National Day Parade. The Director of Music is MAJ (NCC) Anthony Chew. ## People ### Commandants - LTC J P Durcan (January 1969 – June 1970) - LTC Mohd Salleh (June 1970 – December 1970) - MAJ Syed Hashim Aljoffrey (January 1971 – March 1972) - MAJ Yeo Peck Chua (April 1972 – January 1980) - COL John Morrice (February 1980 – February 1981) - MAJ Yeo See Cheh (March 1981 – April 1983) - LTC Toh Chee Keong (1 May 1983 – 31 December 1990) - LTC George Ho Yat Yuen (1 January 1991 – 16 October 1994) - LTC Swee Boon Chai (17 October 1994 – 30 June 1997) - LTC Yeo Yoon Soon (1 July 1997 – 31 March 2000) - LTC Phua Puay Hiong (1 April 2000 – 10 January 2003) - LTC Lim Teong Lye (11 January 2003 – 16 December 2004) - LTC Colin Wong (17 December 2004 – 8 June 2007) - LTC Stuart Khoo (8 June 2007 – 3 December 2008) - LTC Adrian Koh (3 December 2008 – 10 January 2013) - LTC Johnny Yeo Yew Kuan (10 January 2013 – 5 February 2016) - LTC Richard Koh Ban Chuan (5 February 2016 – 21 November 2019) - LTC Joey Wong (21 November 2019 – 11 January 2023) - LTC Ong Siong Beng (11 January 2023 – 6 December 2024) - SLTC Mohd Nizam Bin Yahya (6 December 2024 – present) ### Regimental Sergeant Major - 1WO Christopher Bryan (February 2003 – 13 October 2017) - 1WO Pheong Siew Shya (13 October 2017 – 29 September 2021) - 1WO Susan Lee Siok San (29 September 2021 – Present) ### Director of Music - MAJ (NCC) Anthony Chew (1999–present) - [National Police Cadet Corps](/wiki/National_Police_Cadet_Corps) - [National Civil Defence Cadet Corps](/wiki/National_Civil_Defence_Cadet_Corps) - National Cadet Corps Act\n",
  "language": "en",
  "processed_at": "2026-01-12T11:36:01.219410",
  "title": "National Cadet Corps (Singapore)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/National_Cadet_Corps_(Singapore)"
}