{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:36:25.234627"
  },
  "content": "Physical fitness test for students in Singapore The **National Physical Fitness Award** (**NAPFA**) is a standard [physical fitness](/wiki/Physical_fitness) [test](/wiki/Physical_fitness_test) for [Singaporeans](/wiki/Singaporeans) as part of Singapore's Sports For Life programme. NAPFA was launched in January 1982 as a standardised assessment of overall fitness for the general population. All [primary](/wiki/List_of_primary_schools_in_Singapore) and [secondary](/wiki/List_of_secondary_schools_in_Singapore) schools in Singapore are required to participate in NAPFA tests on alternate years, in April for secondary schools and in August for primary schools respectively. It is one of the three criteria for banding for the [Trim and Fit](/wiki/Trim_and_Fit) (TAF) Awards, other than the [fitness](/wiki/Physical_fitness) index and the percentage of [overweight](/wiki/Overweight) students. Singaporeans studying within Singapore's tertiary education system, or those who have graduated from the education system are not required to participate, but are strongly encouraged to do so. Despite the requirement for mandatory participation, failing to achieve at least a passing grade (E) usually does not carry any academic consequences for primary and secondary school students, although students are still strongly encouraged to pass. Exceptions include sports-based schools such as the [Singapore Sports School](/wiki/Singapore_Sports_School), and might yield non-academic consequences, such as the requirement to further retake the tests or the required participation in the Trim and Fit programme. Before the changes to the [IPPT](/wiki/Individual_physical_proficiency_test), a minimum of a silver grade allowed Singaporean males who have reached the age of 18 to perform just 9 weeks of [Basic Military Training](/wiki/National_Service_in_Singapore#Military_service) (BMT) in their [National Service](/wiki/National_Service_in_Singapore) (NS) period, instead of the usual 17 weeks if the silver grade is not attained. Those without at least a NAPFA Silver have to undergo an extra eight-week Physical Training Phase (PTP) prior to their nine-week BMT. In addition, medically fit servicemen who have attained a silver grade enjoy a two-month exemption at the end of their full-time NS period because exemption from PTP would mean a reduction of two months of NS, making the entire NS shortened to one year and ten months. With the new IPPT system, the exemption criteria for PTP is now 61 points based on sit-up, push-up and 2.4 km run done in a single session, graded according to the IPPT scoring system. According to data from the [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)), the percentage of students passing NAPFA has been increasing steadily over the years, from 58% in 1992 to 74% in 1998, and further to 80% in 2007. ## Testing NAPFA involves a series of five stations and a 2.4-km (1.5-mile) Walk-Run for secondary school students and above or a 1.6-km (1-mile) Walk-Run for primary school students. All of the 5 station tests are attempted on the same day, with a 2–5-minute rest period permitted between stations. The Walk-Run item is usually attempted on a different day, although sometimes a 2-week window limit is set. The test items are: 1. **Sit-ups**: Maximum in one minute 2. **Pull-ups (secondary schools)/Push-ups (ITE/Poly/JC/MI)** (for males 15 years old and above) or **Inclined Pull-ups** (for females and males below 15 years old): Maximum in half-a-minute 3. **Sit-and-Reach**: Maximum distance 4. **Shuttle Run**: Minimum time for two laps of fixed distance 5. **Standing Broad Jump**: Maximum distance 6. **2.4-km Run (1.5-mile Run) [1.6-km Run (1-mile run) for primary schools]**: Minimum time on firm and level surface Performances are then compared to a chart and the grades from A to F for each test item. An A grade constitutes excellent performance and an E grade constitutes barely passing. On the other hand, an F grade indicates that the participant has failed that test item. There are points awarded for each station based on the grades that the participant gets for the particular station. The points are then totalled up, resulting in either of the three awards, bronze, silver and gold. - Singapore Sports Council Official Website - Fitness Score Sheets and Guidelines - Singapore Ministry of Education Press Release: *The Trim and Fit and MINDEF Physical Fitness Performance Awards 2004*\n",
  "language": "en",
  "processed_at": "2026-01-12T11:36:25.234230",
  "title": "National Physical Fitness Award",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/National_Physical_Fitness_Award"
}