{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:36:31.331957"
  },
  "content": "National identity card of Singapore The **National Registration Identity Card** (**NRIC**), colloquially known as \"**IC**\" ([Malay](/wiki/Malay_language): *Kad Pengenalan Pendaftaran Negara*; [Chinese](/wiki/Chinese_language): 身份证; [pinyin](/wiki/Pinyin): *Shēnfèn Zhèng*; [Tamil](/wiki/Tamil_language): அடையாள அட்டை, romanized: *Aṭaiyāḷa Aṭṭai*), is a compulsory [identity document](/wiki/Identity_document) issued to [citizens](/wiki/Singaporean_nationality_law) and [permanent residents](/wiki/Permanent_residency_in_Singapore) of [Singapore](/wiki/Singapore). People must register for an NRIC within one year of attaining the age of 15, or upon becoming a citizen or permanent resident. Re-registrations are required for persons attaining the ages of 30 and 55, unless the person has been issued with an NRIC within ten years prior to the re-registration ages. The National Registration Act 1965 (last amendment in 2016) legislates the establishment of a national registry, as well as the issuance and usage of NRICs. The government agency responsible for the national registry and issuance of NRICs is the [Immigration and Checkpoints Authority](/wiki/Immigration_and_Checkpoints_Authority) (ICA), a department under the [Ministry of Home Affairs](/wiki/Ministry_of_Home_Affairs_(Singapore)). ## Types and design of NRIC Singaporean citizenshipThis article is part of a seriesCitizenship - [Citizenship of Singapore](/wiki/Citizenship_of_Singapore) - National Registration Identity Card Immigration - [Immigration to Singapore](/wiki/Immigration_to_Singapore) - [Permanent resident card](/wiki/Permanent_residency_in_Singapore) [Singaporean nationality law](/wiki/Singaporean_nationality_law) - [History of nationality law](/wiki/Singaporean_nationality_law) - [Singapore Citizenship Ordinance 1957](/wiki/Singaporean_nationality_law) - [Citizenship Act 1965](/wiki/Singaporean_nationality_law) - [Oath of Citizenship](/wiki/Singapore_National_Pledge) Agencies - [Immigration and Checkpoints Authority](/wiki/Immigration_and_Checkpoints_Authority) Citizenship classes - [Honorary citizenship](/wiki/Honorary_citizenship) - [Commonwealth citizen](/wiki/Commonwealth_citizen) [Demographics of Singapore](/wiki/Demographics_of_Singapore) - [Singaporeans](/wiki/Singaporeans) - [Population by year](/wiki/Demographics_of_Singapore#Population_growth) - [Ethnic origins](/wiki/Singaporeans#Racial_and_ethnic_groups) - v - t - e The current NRIC takes the form of a credit card-size polycarbonate card. The polycarbonate cards were first issued in the 1990s, replacing the larger laminated cards issued since 1966. The NRIC comes in two main colour schemes: pink for Singaporean citizens and blue for permanent residents (PR). Each card is identified by an NRIC number (\"Identity Card Number\"), which is a unique set of nine alpha-numerics given to each citizen or PR. Biometric data collected during card registration includes the person's left and right thumbprints, and since 2017, [iris images](/wiki/Iris_recognition). Any change or error in the information on the NRIC (apart from change of address) must be reported within 28 days to ICA for a replacement card. A change of address does not require a replacement card, but must be reported within 28 days to ICA. Since 1 October 2020, reporting a change in address is done via an online e-service at the ICA website. For verification, a 6-digit PIN is mailed to the new address, and the applicant is asked to enter the PIN into the e-service. After successful verification, a sticker showing the new address will be mailed to the applicant, who then must paste the sticker over the old address on the NRIC. ### Front side The front side of the card features the words \"REPUBLIC OF SINGAPORE\" and the [coat of arms of Singapore](/wiki/Coat_of_arms_of_Singapore) across the top, and contains the following information: - Identity Card No. - Non-colour photograph of the holder - Name (in English) - (Optional) Name in [Pinyin](/wiki/Pinyin) and/or ethnic characters ([Chinese characters](/wiki/Chinese_characters), [Jawi script](/wiki/Jawi_script) or [Tamil script](/wiki/Tamil_script)). For citizens and PRs born in Singapore, the ethnic names if included are identical to those on their birth certificates. - Race - Date of Birth - Sex - Country/Place of Birth A number of security features can be found on the front side of the card. The words \"REPUBLIC OF SINGAPORE\" change colour when the card is tilted. A window containing a smaller photograph of the holder is located below the main photograph; the window photograph can also be viewed from the reverse side of the card under light. A multiple laser image on the bottom right alternates between the holder's NRIC no. and the [lion head symbol](/wiki/Lion_head_symbol_of_Singapore) when viewed from different angles. ### Rear side The rear side of the card has the following information: - Barcode of the NRIC number - Right thumbprint of the holder - (for PRs only) Nationality - Date of Issue - Address Until 29 September 2002, NRICs indicated its holder's blood group. This information was subsequently removed due to the widespread availability of quick blood group tests that are conducted during medical emergencies. ## Long Term Pass cards Since 2008, foreigners residing in Singapore on long-term passes are issued green-coloured polycarbonate Long Term Pass cards, replacing the formerly issued green paper-laminated cards and stamp endorsement on travel documents. Unlike the NRIC, all pass holders regardless of age must register for a Long Term Pass card, although fingerprinting is optional for persons ages 6 to 14 and not applicable for children age 5 and below. Employment-related passes and passes for family members of work pass holders are issued by the [Ministry of Manpower](/wiki/Ministry_of_Manpower_(Singapore)) (MOM), while student's passes and other long-term visit passes are issued by the [Immigration and Checkpoints Authority](/wiki/Immigration_and_Checkpoints_Authority) (ICA). In addition to its use as identification and proof of immigration status in Singapore, the Long Term Pass card also serves to facilitate travel to Singapore and acts as a [visa](/wiki/Travel_visa) for [visa nationals](/wiki/Visa_policy_of_Singapore). The Long Term Pass card is issued with a date of expiry, conditional on the card holder holding a valid [passport](/wiki/Passport). From 27 February 2023, ICA ceased issuing physical Long-Term Pass cards. Only digital Long-Term Passes are issued to ICA-issued Long-Term Visit Pass holders and Student’s Pass holders, and Dependant’s Pass holders granted by the [Ministry of Social and Family Development](/wiki/Ministry_of_Social_and_Family_Development). The digital Long-Term Pass can be accessed via the MyICA mobile app, the MyICA e-Service on the ICA website, or FileSG. Singpass users can also view their Long-Term Pass details on the Singpass app. Foreigners holding long-term passes are uniquely identified by a \"Foreign Identification Number\" (FIN) which is similar in format to the NRIC number. The FIN is transferable between pass types and remains valid for life, until the foreigner attains Singapore citizenship or permanent residency and obtains an NRIC number. ### Front side The front side of the Long Term Pass card differs by pass type. Non-work passes issued by ICA and MOM are similar in design to the NRIC, except they are green in colour and use the FIN instead of the NRIC number, and contain the holder's photograph, name, date of birth, sex and nationality. Work passes issued by MOM have the MOM logo, type of work pass and the words \"Employment of Foreign Manpower Act (Chapter 91A) Republic of Singapore\" across the top of the card, and contain the following information: - The holder's photograph - Employer/company (absent on Work Permit for domestic workers, Personalised Employment Pass and Work Holiday Pass) - Name - Work Permit No./S Pass No. and sector (for Work Permit and S Pass holders), or FIN (for other work passes) - Barcode of Work Permit No./S Pass No./FIN with date of issue ### Rear side The rear side of the Long Term Pass card contains the following information: - Type of immigration pass issued under the Immigration Regulations (\"Student's Pass\" for Student's Pass holders, \"Dependant's Pass\" for Dependant's Pass holders, \"Visit Pass\" for work pass holders and Long-Term Visit Pass holders). - Personal information: - Non-work passes: thumbprint and FIN - Work passes: name, thumbprint, FIN, date of birth, sex and nationality - Pass validity information: - ICA-issued passes: the date of issue and date of expiry are printed on the card - MOM-issued passes: instead of printed dates, cards issued from 15 September 2017 onward contain a [QR code](/wiki/QR_code), which returns pass validity information from the MOM database when scanned by the SGWorkPass app developed by MOM. - Barcode of FIN with date of issue and (for ICA-issued passes) abbreviation of pass type - (for [visa nationals](/wiki/Visa_policy_of_Singapore) only) \"MULTIPLE-JOURNEY VISA ISSUED\" endorsement. ICA-issued passes are also printed with an instruction to surrender the card upon cancellation or expiration (for Student's Pass holders, within 7 days of cessation of studies), or when a new card is issued to the holder. The instruction is omitted from MOM-issued passes following the implementation of the QR code status check. ## Structure of the NRIC number/FIN The structure of the NRIC number/FIN is ***@xxxxxxx#***, where: **@** is a letter that can be \"S\", \"T\", \"F\", \"G\" or \"M\" depending on the status of the holder. Singapore citizens and permanent residents born before 1 January 2000 are assigned the letter \"S\". Singapore citizens and permanent residents born on or after 1 January 2000 are assigned the letter \"T\". Foreigners issued with long-term passes before 1 January 2000 are assigned the letter \"F\". Foreigners issued with long-term passes from 1 January 2000 to 31 December 2021 are assigned the letter \"G\". Foreigners issued with long-term passes on or after 1 January 2022 are assigned the letter \"M\". Before 1 January 2000, it was commonly thought that \"S\" stood for \"**S**ingapore\" and \"F\" for **F**oreign. In 2000, the \"T\" and \"G\" ranges (which are one letter after \"S\" and \"F\" respectively) were introduced to avoid conflicts with previously issued numbers. As \"S\" is the 19th letter of the alphabet, it was reinterpreted as denoting that the person was born or registered in the 1900s (1900–1999), \"T\" is the 20th letter of the alphabet, denoting that the person was born in the years 2000 to 2099. **xxxxxxx** is a 7-digit serial number assigned to the document holder. Singapore citizens and permanent residents born on or after 1 January 1968 are issued NRIC numbers starting with their year of birth, e.g. S71xxxxx# for a person born in 1971 and T02xxxxx# for a person born in 2002. For those born in Singapore, these numbers are identical to the birth registration number on their [birth certificates](/wiki/Birth_certificate), which are automatically transferred to the NRIC at age 15 and above. For Singapore citizens and permanent residents born on or before 31 December 1967, the NRIC numbers commonly begin with 0 or 1, which do not relate to year of birth but are assigned in order of issuance. Non-native residents born before 1968 are assigned the heading numbers 2 or 3 upon attaining permanent residency or citizenship. FINs for foreigners holding long-term passes are randomly assigned and do not relate to the holder's year of birth or year of issuance in any way. **#** is the [checksum](/wiki/Checksum) letter calculated with respect to @ and xxxxxxx. The algorithm to calculate the checksum of the NRIC is not publicly available; as of 1999, the [Ministry of Home Affairs](/wiki/Ministry_of_Home_Affairs_(Singapore)) has only sold the algorithm to Singapore-based organisations demonstrating a \"legitimate need\" for it. That said, the checksum algorithms for the NRIC (S- and T-series) and the FIN have been easily [reverse-engineered](/wiki/Reverse_engineering). The first seven NRIC numbers were issued to the following notable people of the country: - S0000001I — [Yusof bin Ishak](/wiki/Yusof_bin_Ishak), first [President of Singapore](/wiki/President_of_Singapore) - S0000002G — [Wee Chong Jin](/wiki/Wee_Chong_Jin), first [Chief Justice of Singapore](/wiki/Chief_Justice_of_Singapore) - S0000003E — [Lee Kuan Yew](/wiki/Lee_Kuan_Yew), first [Prime Minister of Singapore](/wiki/Prime_Minister_of_Singapore) - S0000004C — [Kwa Geok Choo](/wiki/Kwa_Geok_Choo), wife of Lee Kuan Yew - S0000005A — [Toh Chin Chye](/wiki/Toh_Chin_Chye), first [Deputy Prime Minister of Singapore](/wiki/Deputy_Prime_Minister_of_Singapore) - S0000006Z — [Goh Keng Swee](/wiki/Goh_Keng_Swee), second Deputy Prime Minister of Singapore - S0000007H — [S Rajaratnam](/wiki/S_Rajaratnam), held various ministries but most notably as the first [Minister for Foreign Affairs](/wiki/Ministry_of_Foreign_Affairs_(Singapore)) ## Offences and penalties There are a variety of offences listed in the National Registration Act and its implementing legislation. These include: - failure to register when required; - giving a false address or failure to report a change of residence; - possession of one or more identity cards without lawful authority or reasonable excuse; - unlawfully depriving any person of an identity card; - defacing, mutilation or destruction of an identity card. These offences on conviction could result in a fine of up to $5,000 or to imprisonment for a term not exceeding 5 years or to both. The Act also provides for a second category of offences which carry more significant penalties of a fine of up to $10,000, imprisonment for up to 10 years or both. These relate to offences involving forgery or fraud in respect of an identity card. Failure to comply with the NRIC regulations is an offence and if convicted, could result in imprisonment for a term not exceeding 2 years or to a fine not exceeding $3,000 or to both. ## Use Holders of an NRIC are responsible for the card's custody but are not required to carry the card on their person. Areas that will require NRICs to be verified include passports (immigration officers) and polling stations (police officers). Full-Time National Servicemen undergoing National Service in the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces), [Singapore Police Force](/wiki/Singapore_Police_Force) and [Singapore Civil Defence Force](/wiki/Singapore_Civil_Defence_Force) are issued the SAF 11B Card or the Home Team National Service Identity Card during the course of their Full-Time National Service together with their NRIC. Notwithstanding this, if no identification can be produced the police may detain suspicious individuals until such identification can be produced either in person or by proxy. Production of an NRIC is also required for any person seeking accommodation at any hotel, boarding house, hostel or similar dwelling place and for any person offering to pawn an article at a pawnbroker. In the case of hotels, boarding houses, etc., if a person is not in possession of, or fails to produce, an NRIC, the owner, manager or other person in charge of such business must notify the nearest police station of the fact immediately. The NRIC is also sometimes a required document for certain government procedures or in commercial transactions such as the opening of a bank account. In addition, many businesses and other organisations in Singapore habitually request sight of an NRIC to verify identity or to allow a person entry to premises by surrendering or exchanging it for an entry pass. There is no legal requirement to produce the NRIC in these situations and often either providing any other form of identification (such as credit card, work or office pass, card with a photo on it) or simply providing an NRIC number (without producing the card itself) will suffice. From 1 September 2019, organisations can no longer request and store NRIC numbers for such purposes, unless mandated by various laws. The NRIC is also available in digital format through the Singpass app. From 1 November 2021, the Digital IC is accepted for transactions at all government agencies, with some exceptions such as when the law requires the presentation of a physical identity document. The Digital IC does not replace the requirement to register for a physical NRIC, and any loss or damage to the physical NRIC must still be reported to ICA for a replacement. NRIC being accepted as a [travel document](/wiki/Travel_document) other countries may be limited by the countries' laws and regulations. [Albania](/wiki/Albania) is, if not the only, one of the few countries which accepts the usages of NRIC as a travel document for entry into the nation for a stay of up to 90 days within 180 days. [Montserrat](/wiki/Montserrat) also accepts NRIC for stay no longer than 14 days. ### Privacy issues For years, the NRIC number has been used by both government and commercial organisations as an unambiguous and \"tidy\" identifier for Singaporeans. Full NRIC numbers have been listed to identify winners of lucky draws. It is possible to borrow books from the [National Library Board](/wiki/National_Library_Board) simply by scanning the [barcode](/wiki/Barcode) on a borrower's NRIC card at self-service kiosks, without requiring further authentication. Such instances have led to questions of possible fraud and [identity theft](/wiki/Identity_theft). In response to such concerns, only the last three or four digits and the letters are publicly displayed or published as the first three digits can easily give away a person's age. This is known as a \"masked NRIC number\". Tighter privacy advice to stop indiscriminate collection and storage of NRIC numbers was issued in September 2018 by the [Personal Data Protection Commission](/wiki/Personal_Data_Protection_Act_2012_(Singapore)). It also encouraged organisations to develop alternative methods to identify and verify individuals. In December 2024, the Singaporean government announced a significant policy shift regarding NRIC numbers, moving away from masked NRIC numbers towards treating them as public identifiers, similar to names. This change was prompted by concerns that the current practice of masking NRIC numbers creates a \"false sense of security\" and leaves citizens vulnerable to potential misuse. The [Ministry of Digital Development and Information](/wiki/Ministry_of_Digital_Development_and_Information) (MDDI) emphasised that NRIC numbers should be used strictly for identification purposes and not for authentication. The policy shift was initially highlighted when the [Accounting and Corporate Regulatory Authority](/wiki/Accounting_and_Corporate_Regulatory_Authority) (ACRA) launched its new Bizfile portal that displayed full unmasked NRIC numbers in search results. Following public concern, ACRA temporarily suspended the search function and later reinstated it with modifications, requiring users to pay a fee to view full NRIC numbers. In response to these changes, the Association of Banks in Singapore (ABS) announced that banks would conduct a thorough review of their practices regarding NRIC usage, particularly emphasising that NRIC numbers alone cannot be used for financial transactions and that multi-factor authentication would continue to be required for online banking services. The Personal Data Protection Commission (PDPC) has indicated that it will update its guidelines following consultations with industry stakeholders and the public regarding the new policy direction on NRIC numbers. - [Singaporean nationality law](/wiki/Singaporean_nationality_law) - [Singaporean passport](/wiki/Singaporean_passport) - [Singapore Certificate of Identity](/wiki/Singapore_Certificate_of_Identity) - [Identity document](/wiki/Identity_document)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:36:31.331488",
  "title": "National Registration Identity Card",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/National_Registration_Identity_Card"
}