{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:36:05.665643"
  },
  "content": "The **National Courtesy Campaign** was a campaign launched in June 1979 by the [Ministry of Culture](/wiki/Ministry_of_Information,_Communications_and_the_Arts) of Singapore as a means of encouraging Singaporeans to be kinder and more considerate to each other, so as to create a pleasant social environment. The courtesy campaign was to be an annual effort by the government to encourage the people to adopt a more courteous attitude and lifestyle. It was seen as a means of ensuring a smooth transition to a new Singapore which would be densely populated, where people lived and worked in [high rise](/wiki/High_rise) towns, offices and factories, while travelling in crowded buses and lifts. In 1997, the campaign was subsumed by the [Singapore Kindness Movement](/wiki/Singapore_Kindness_Movement). ## Origins The National Courtesy Campaign was not actually the first of its kind to instill values of courtesy to Singaporeans, though earlier campaigns were not conducted on as large a scale as the National Courtesy Campaign over such a long period. More than 10 years prior to the introduction of the National Courtesy Campaign, there was already a Bus Safety and Courtesy Campaign, which was held in 1968, as well as the National Safety First Council Road Courtesy Campaigns and the Safety and Courtesy Campaign Week, which were held between 1972 and 1973, among others. The forerunner of the National Courtesy Campaign is usually recognised as the courtesy campaign that was conducted by the [Singapore Tourist Promotion Board](/wiki/Singapore_Tourism_Board) (STPB). The courtesy campaign conducted by the STPB was meant to teach Singaporeans to be polite only to tourists for the benefit of the tourist industry. Then Prime Minister [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) had followed the courtesy campaigns by the STPB with \"interest and amusement: interest because most people were responsive to the campaign; amusement because no one protested that it was absurd to teach Singaporeans to be polite to tourists\". In his speech, he stressed the importance of being courteous in one's everyday life as it would make life better for everyone. It was a desirable attribute which could be found in all cultivated societies, and something which Singaporeans should practice for Singapore's own self-esteem. If tourists did find Singapore a courteous nation, it was because it was \"incidental\". This \"prodding\" by Lee Kuan Yew resulted in the birth of the National Courtesy Campaign, which became a recurrent, annual campaign that was a long-term project to imbue values of courtesy into Singaporeans within a period of 10 years. ## Publicity Numerous measures were taken to ensure there was a great degree of publicity to match the ambition of the campaign. It was the first Singapore campaign to adopt a mascot in the form of \"Singa, the Courtesy Lion\" in 1982. In addition, the profile of the campaign was sustained through the use of radio, televisions and newspapers, where the campaign is highlighted in articles, documentaries, jingles, songs and other programmes. Posters and banners were hung up at prominent public places like bus stops, shopping centres and open-air markets. Debates, contests, talks, exhibitions, courtesy courses, where leaflets, handbooks and pamphlets would be handed out, were also arranged to further educate the people. To reach out to children, essay-writing competitions in all four national languages were arranged with \"the objective of getting members and employees of unions and co-operatives and their children to think about and express their views on the importance of courtesy\". Bills and correspondence from government and statutory bodies had courtesy slogans in them. In later years, additional items in the form of stickers, badges, T-shirts, mugs, keychains, vases, notepads and even a musical coin bank that played jingles composed for the courtesy month were amongst an assortment of memorabilia served to continuously remind the public of the ongoing need for Singaporeans to have courtesy ingrained into their lifestyle. Courtesy songs, [fables](/wiki/Fable) and a website were introduced into the campaign as it entered the 80s and 90s. ### Singa the Courtesy Lion Represented by a Smiley logo as the campaign kick started, the National Courtesy Campaign had Singa the Courtesy Lion replace the Smiley logo in 1982. The lion was chosen because, in addition to the fact that Singapore was a 'lion city', it was believed to paint the picture of the ideal, courteous Singaporean: warm and friendly. In addition, using the race-neutral lion overcame the issue of racial representation. Singa the Lion is the familiar icon for courtesy that most Singaporeans grew up with. Since then, the Singapore Kindness Movement has adopted Singa as their mascot to promote messages of kindness. On 15 May 2013, the Singapore Kindness Movement retired the mascot, by publishing a resignation letter written by the mascot, which was later revealed to be a media campaign to inspire kindness among the online communities in Singapore, but instead had thrown ire from the intended audience. ### Courtesy Campaign website The Courtesy Campaign website was set up as a means of reaching out and staying relevant to a new generation of Singaporeans that used the computer and the Internet regularly. Additionally, this new generation of Singaporeans is seen to actively use [Singlish](/wiki/Singlish), an English-based creole language that has strong Malay and Mandarin influences native to Singapore, as a means of casual communication with one another. It is thus unsurprising that the choice of language on the website being only English, would be deemed sufficient to reach out to the younger Singaporeans. Still, this is a departure from previous efforts in the campaign where English, Mandarin, Malay and Tamil would be used to get the message across. Nonetheless, there is equal racial representation on the website where under 'Courtesy Fables', stories with moral values and lessons of courtesy and consideration can be found stemming from the 4 recognised racial groupings can be found. This idea of English as a means to communication and one's mother tongue to inculcate desirable values and morals fall in line with the government's language policy on English as a means of communication through racial barriers, while the \"imparting of moral values and cultural traditions is best done in the student's own mother tongue\". Also, on the website there is a section on cyber courtesy, a testament to the campaign's drive to stay current and relevant with a list is a list of dos and don'ts. Additional such evidence can be found in the form of content exclusively for use on the computer can being available for download on the website as well, like screensavers, wallpapers and a Singa cursor for download. ## Activities Upon the launch of the Courtesy Campaign at the national level, a range of activities are started. Various members of the National Courtesy Campaign Working Committee in both the private and public sector also initiate and embark on their own activities. Different activities were aimed at promoting a courteous lifestyle amongst people of different ages. ### Activities aimed at youths Various competitions were held at school-level to encourage students to think and express themselves on courtesy. - **Essay-writing competitions** were arranged with \"the objective of getting members and employees of unions and co-operatives and their children to think about and express their views on the importance of courtesy\". - There was also the **Courtesy Cheer Competition**, as a way to \"inject fun into the campaign\", where \"students were encouraged to freely express what courtesy meant to them through a combination of innovative cheers, elaborate routines and choreography\". - The **Friend of Singa Award** was the brain child of Vincent Lam, a member of the Singapore Courtesy Council in 1991 as a means to recognise courteous conduct by students, and to function symbiotically with the school's efforts to teach courteous behaviour within students as well. It was established with the hope that other students would see winners of the Friend of Singa Award as role models, and follow the example set by them as well. The award, opened to any school in Singapore, involved the nomination of a student from each school by recounting the respective student's act of kindness and courtesy. Among all the nominations, a student would then be chosen for the Most Courteous Student Award and 10 other students for Merit Awards. - Vincent Lam has also organised a **Courtesy Photo Competition** where students were challenged to \"capture acts of courtesy being performed in public... to [demonstrate] one important thing: that our behavior and our actions are visible and are always observed by people around us\". - A **courtesy camp** was also initiated by Vincent Lam and it required participants to be involved in various \"camp projects, community service and daily chores\" in an environment where people of the same age group are all together since \"young people are usually more effectively influenced by their peers\". - 1989 also marked the year Lam organised a **Courtesy Meet**, which aimed to get students to \"exchange ideas on how to promote courtesy\" . ### Activities aimed at adults Activities aimed at improving workspace courtesy and etiquette were mostly a result of the Ministry of Council (and subsequently the Singapore Courtesy Council) working with organisations such as hotels and transport companies to encourage a courteous disposition and attitude amongst the workers. Examples of such activities include the education of taxi drivers and civil servants through the use of training films, the Retail Merchants Association (RMA) organising role-playing dramatisation of courteous and discourteous scenarios by sales staff and poster-design, jingle and song-writing competitions. Just like students, awards and recognition were also given to adults. Known as the Service Gold – The National Courtesy Award, it serves as a platform to recognise the efforts put in by various hotel staff \"who have gone out of the way to help others, be it colleague or guest\", and it opened to all members of the Singapore Hotel Association (SHA). The award that was bestowed upon the recognised staff came in the form of a certificate and a 23K gold-plated Service Gold pin, which they would wear at work. To assess how courteous civil servants were in dealing with the public, the government would hire private companies to perform undercover courtesy auditor. ### Activities held at constituency-levels Activities were also organised at the constituency level, to target [hawkers](/wiki/Hawker_(trade)), shopkeeper and people gathered at public places. Campaign tours are conducted by various members of parliament (MP) to public places, as well as \"the distribution of pamphlets and stickers, contests to find the most courteous shopkeeper, hawker and bus crew, exhibitions, posters and sport art competitions are some of the activities held during the campaign\". Residents are thought not to be an important target when constituency-level activities are carried out, as it is believed that regularly held neighbourhood gatherings have already helped to create the friendly and neighbourly environment through which the campaign messages and values are disseminated. Such an assumption, however, is questioned as neighbourhoods gatherings might only be attended by a small number of constituents. However, it has been noted that the regular visits by the MP during the Courtesy Campaign have allowed the MPs to come into more regular contact with the constituents, widening his or her scope of contact, ultimately creating a closer working relationship between the MPs, representing the government and the people. ## Timeline Time SpanTargetSlogan1979–1980Public, government and service sector\"Courtesy is our way of life. Make courtesy our way of life.\"1981Public, workers\"Courtesy is part of our tradition, it's so nice to be courteous.\"1982Public, employers and employees\"Courtesy is part of our tradition, it's so nice to be courteous.\"1983Public\"Courtesy and social responsibility, let's go the courtesy way.\"1984Public\"Courtesy is in us. Let's show it.\"1985Public\"A little thought means so much. Bring on a smile. Say 'Please/Thanks'.\"1986–1991Public1986: \"A little thought means so much.\" 1987–1988: \"Courtesy. It begins with me.\" 1989: \"Courtesy begins with me.\" 1990: \"Courtesy begins with me. Go on, be the first.\" 1991: \"Courtesy begins with me.\"1992Public and transport\"Courtesy begins with me. Pass it on.\"1993–1994Singaporeans working, studying or living overseas and public\"Let courtesy show, wherever we go.\"1995Youth and public\"Courtesy. That's my kind of help.\"1996–1997General public\"Courtesy. Try a little kindness.\"1998[Handphone](/wiki/Mobile_phone), [pagers](/wiki/Pager) and internet users and public\"Courtesy. Try a little kindness.\"1999Transport sector, transport users and public\"Let's move with courtesy\"2000Handphone users and public\"Let's use handphones with courtesy.\" - [*Stop at Two*](/wiki/Eugenics_in_Singapore#Stop_at_Two) - [*Have Three or More (if you can afford it)*](/wiki/Eugenics_in_Singapore#Have_Three_or_More_(if_you_can_afford_it)) - [Singapore Kindness Movement](/wiki/Singapore_Kindness_Movement)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:36:05.665392",
  "title": "National Courtesy Campaign (Singapore)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/National_Courtesy_Campaign_(Singapore)"
}