{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:36:10.652900"
  },
  "content": "Centre for promoting design in Singapore The **National Design Centre** of [Singapore](/wiki/Singapore) is located in the arts, cultural, learning and entertainment [district](/wiki/Administrative_divisions_of_Singapore) of [Bras Basah–Bugis](/wiki/Bras_Basah_Road). The complex is a focal point for all things design in Singapore and a space where designers and businesses can exhibit their products, exchange ideas, and even work. It also invites the public to learn about design through its exhibitions and programmes. The centre has two galleries and houses three design labs – IDA Labs, the Materials Design Lab, and the Prototyping Lab. The NDC occupies the 120-year-old premises of the former St Anthony's Convent. The development of the NDC involved the [restoration](/wiki/Building_restoration) and [adaptive reuse](/wiki/Adaptive_reuse) of the [conserved](/wiki/Conservation_(cultural_heritage)) buildings, consisting of three pre–World War II [Art Deco](/wiki/Art_Deco) blocks and one post-war [modern](/wiki/Modern_architecture) block. The NDC is also home to the [DesignSingapore Council](/wiki/DesignSingapore_Council), which was formed in 2003 as the national agency for design under the [Economic Development Board](/wiki/Economic_Development_Board). The Council develops the design sector, and helps Singapore to use design for innovation and growth, making lives better. - DesignSingapore Council - Ministry of Communications and Information - IDA Labs Programmes 1°17′56.16″N 103°51′11.04″E﻿ / ﻿1.2989333°N 103.8530667°E﻿ / 1.2989333; 103.8530667 This article about a Singapore building or structure is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:36:10.652597",
  "title": "National Design Centre",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/National_Design_Centre"
}