{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:35:53.921252"
  },
  "content": "The **National Aerated Water Company Factory** is a factory which belonged to the National Aerated Water Company. The building was integrated into the Jui Residences condominium. ## Architecture The design of the factory was inspired by [Art Deco](/wiki/Art_Deco). The factory was two-storeys tall and occupied an area of roughly 6,555 sq ft. It was L-shaped. The factory features a [Saw-tooth roof](/wiki/Saw-tooth_roof) structure and was designed to allow daylight into the building, thus minimising the reliance on electricity. It also features a signange tower, a balcony with fair faced brick parapets, timber transom panels and a sun-shading ledge made of concrete which spiralled out of a circular window. It has been considered \"one of the last few vestiges of Singapore's industrial past\". ## History After National Aerated Water Company obtained the franchise for [Sinalco](/wiki/Sinalco) in 1952, it was decided that a new factory would be built. The National Aerated Water Company moved into the factory after its completion in 1954. The factory was designed by architect K.K. Tan. It could produce 48,000 bottles in a day, which was twice the number of bottles the company's previous factory could produce in a day. However, after losing a breach of contract suit in 1999, the National Aerated Water Company ceased production and the factory was closed. The factory was sold to Selangor Dredging Berhad for $47 million in December 2016. In response to the sale of the factory, a [Facebook](/wiki/Facebook) page called \"Save The National Aerated Water Company Building\" was set up. The [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) announced on 15 December 2017 that the factory would be gazetted for conservation. The conservation gazetting of the factory received support from Selangor Dredging. However, one of the corners of the factory were demolished to allow for vehicular access to the rear of the site. It was put up for sale in August 2021. However, despite receiving multiple bids, none of them were up to expectations. It was relaunched for sale in April 2022. 1°19′34″N 103°51′51″E﻿ / ﻿1.3262°N 103.8643°E﻿ / 1.3262; 103.8643\n",
  "language": "en",
  "processed_at": "2026-01-12T11:35:53.920927",
  "title": "National Aerated Water Company Factory",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/National_Aerated_Water_Company_Factory"
}