{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:36:50.115765"
  },
  "content": "Nongovernmental and nonprofit organization The **Nature Society Singapore** (**NSS**) is a non-government, non-profit organisation centered towards the preservation and appreciation of [Singapore](/wiki/Singapore)'s natural heritage, as well as that of the surrounding region. Run by volunteers, the NSS depends financially on its members' contributions as well as companies, institutions and individuals. ## History NSS has its origin in 1940 when a handful of colonial civil servants got together to form the [Malayan Nature Society](/wiki/Malayan_Nature_Society) (MNS). Its activities were mainly educational - organising talks by visiting scientists, conducting nature walks, etc. Headquartered in today's Malaysia, the Singapore group became known as the Malayan Nature Society (Singapore Branch). It had its headquarters in the [National University of Singapore](/wiki/National_University_of_Singapore) as most office holders were from the then Departments of Botany and Zoology, now merged into the Department of Biological Sciences. As such, there were always close collaborations with academics, who had the necessary scientific background. In 1991 the society split from MNS and re-registered itself as NSS. Following the re-registration, NSS moved its base from NUS leading to a decline in the number of academic members of the society. The society has recently reinforced its links with academics. The Patron of the Nature Society is [Tommy Koh](/wiki/Tommy_Koh). The current President is Dr Yeo Seng Beng. ### Data breach (2020) In November 2020, the Nature Society discovered that it had suffered a data breach. According to investigations carried out by the Personal Data Protection Commission of Singapore (PDPC), the personal data of 5,131 individuals who had created user accounts on the society's website had their personal data affected, and potentially exfiltrated and made available on hacking forums. The PDPC found that the Nature Society had not complied with its data protection obligations under the Personal Data Protection Act (PDPA) because, amongst other matters, it had not designated any individuals responsible for compliance with the PDPA and, had not developed and implemented any data protection policies prior to the incident, and had failed to put in place reasonable measures to protect personal data. The society's website had been designed and developed by an external vendor in 2011, but following that, the society had not engaged any party to maintain the website's security, and did not take any steps to ensure the security of its website itself. The Nature Society was fined a total SGD14,000 for its non-compliance with the PDPA. ## Major conservation issues Activities had always been education-related until about the 1980s when members found themselves thrust into the role of environmental activists. The Serangoon estuary, home to tens of thousands of [migratory birds](/wiki/Migratory_birds), had just been reclaimed for development. Members were yet to be sensitised to conservation and only journalist Ilsa Sharp wrote a piece in *[The Straits Times](/wiki/The_Straits_Times)* protesting its demise. The society only got seriously involved in conservation soon after when its Conservation Committee led by Richard Hale successfully persuaded government to develop a piece of degraded mangrove in Sungei Buloh into a bird sanctuary. Flushed with success, the Conservation Committee began documenting various nature areas to eventually publish \"A Master Plan for the Conservation of Nature in Singapore\" that was enthusiastically received by government. Subsequently, led by locals who had enthusiasm but no behind-the-scene contacts, the exercise to get these areas protected turned into a series of media confrontations. Eventually, every one of the newly documented areas were rejected. In 1991 the society was presented with the Green Leaf Award by government when the former was still the Malayan Nature Society (Singapore Branch). This complemented the previous year's award when Richard Hale won the individual category. These awards were given to organisations and individuals for outstanding contributions to environmental protection and preservation. To date, the NSS can boast of at least four conservation successes: Sungei Buloh, in persuading government to conserve an area. Lower Peirce, in persuading government not to destroy a piece of mature forest for a golf course. Kranji Marshes Park for cooperative restoration as a wildlife habitat. The Green Corridor in persuading the government to retain the former railway land as a continuous stretch of green public and wildlife space. ### Sungei Buloh In 1986, Richard Hale, a banker and birder, stumbled on a degraded mangrove area rich in migratory birds when out birdwatching. However, the area was also scheduled for development. Hale led a group of members documenting the richness of the birdlife and setting out suggestions for its conservation. This was the first conservation proposal by the newly formed Conservation Committee headed by Hale. Key government officials like the late President, [Wee Kim Wee](/wiki/Wee_Kim_Wee), then Deputy Prime Minister, [Goh Chok Tong](/wiki/Goh_Chok_Tong) and then Minister of National Development, [S. Dhanabalan](/wiki/S._Dhanabalan) were personally escorted to the site. This convinced government and so in 1989 the Sungei Buloh Nature Park came into being, now [Sungei Buloh Wetland Reserve](/wiki/Sungei_Buloh_Wetland_Reserve). ### Lower Peirce NSS's other success was in persuading government not to destroy a patch of mature forest in the Lower Peirce water catchment for a golf course. Unlike the Sungei Buloh affair which Francesch-Huidobro refers to as \"the power of persuasion\", the Lower Peirce was \"the power of protestation\". This catchment has always been a legally protected nature reserve and the announcement to clear a 142-ha area of forest for a golf course saw members up in arms. A report was hastily put together in 1992 detailing the biodiversity and the damage a golf course could do to the water quality in particular and the environment in general. When this 80-page \"[environmental impact assessment](/wiki/Environmental_impact_assessment)\" failed to get any response from government, a signature campaign was organized that resulted in thousands of signatures. The almost daily media confrontations led to increasing public support against the construction of the golf course. Eventually, government shelved the proposal. ### Chek Jawa The controversy of [Chek Jawa](/wiki/Chek_Jawa) surfaced in 2001 when the discovery of its rich marine biodiversity coincided with the planned reclamation of this intertidal area. NSS was by then working closely with government and as the reclamation was already decided, it kept a low profile. However, individuals like Joseph Lai, Ria Tan and N. Sivasothi organised a team of volunteers to help document the biodiversity of the area. Among the volunteers were many NSS members, but they came as individuals. And the NSS's Conservation Committee declined to participate, as its focus is birds, not marine organisms, and the NSS had already decided not to officially get involved in the controversy. The resulting media and internet publicity attracted thousands of visitors, most unaware that such rich marine life could still be seen in a highly urbanized Singapore. The then Minister for National Development, [Mah Bow Tan](/wiki/Mah_Bow_Tan), visited the area and was surprised at the number of Singaporeans visiting it. The groundswell of public opinion was too strong for government to proceed with the reclamation and at the last moment it agreed to give the area a reprieve. The decision took everyone by surprise. It was only then that the NSS was roped in, together with other [NGOs](/wiki/Non-governmental_organization), to assist in developing the area for public visits. ### Kranji Marshes Park A freshwater marshland, derived from the damming of the Kranji River to form a reservoir, became seen as an important habitat. NSS drafted a proposal highlighting its conservation value in 1990. This was accepted and included in the government Singapore Green Plan 1993. The 54-hectare (130-acre) site includes woodland and wetlands. NSS adopted the stretch of wetlands in 2008 and supported by sponsorship carried out a restoration program in cooperation with PUB and NParks. It was in 2005 that the area was re-categorised as a park and named [Kranji Marshes](/wiki/Kranji_Marshes) Park. The parkland is now open to the general public. NSS has published a guide \"Introduction to Kranji Marshes Park\". ### The Green Corridor A Proposal to Keep the Railway Lands as a Continuous Green Corridor. Presented to the Singapore Government 9 October 2010. In July 2011 a government spokesman assured the public that the greenery surrounding the railway line would be preserved and subsequently appeared in the 2013 URA ([Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority)) Master Plan. An exhibition jointly organised by NSS and Friends of the Rail Corridor and supported by URA was held at the URA Centre in October 2011 titled \"Re-Imagining the Rail Corridor\" January 2012 The Rail Corridor Reopens for Public Visits. August 2013: The Green Corridor Monitoring and Support Group. A group of volunteers supported by NSS regularly monitor the corridor status for issues and file reports directly to the [Singapore Land Authority](/wiki/Singapore_Land_Authority) in case remedial actions need to be taken.March 2015 The Urban Redevelopment Authority (URA) launched a request for proposals from design professionals to develop a Concept Master Plan and concept proposals for Singapore's Rail Corridor which retain its identity as a \"green corridor\" for relief, respite and recreation. NSS has published a guide \"Green Rail Corridor - a guide to the ecology and heritage of the former railway land\" in cooperation with Singapore Heritage Society. ## Committees ### Conservation Committee This committee was initiated by the Bird Group in the late 1980s with Richard Hale as chairman and R. Subaraj, Dr. Rexon Ngim and Dr Ho Hua Chew as members. It successfully lobbied for the conservation of Sungei Buloh (see Sungei Buloh above) before the chairmanship was passed on to Ho. Subsequently, the areas listed in the society's masterplan were systematically surveyed and reports prepared. Government was lobbied for their conservation through media confrontations, with the fight for Marina South ending with the group losing credibility. Marina South was, after all, a piece of reclaimed land that turned into a wetland as a result of poor drainage with waterfowl taking up residence soon after. For the next few years the group laid low, providing feedbacks to government agencies, assisting in the review of the Singapore Green Plan, etc. In 2008 the Kranji marsh was adopted, followed by the Jalan Halus wetland. Here, the society undertook habitat enhancement, conducted biodiversity surveys and guided nature walks. At the same time the group worked with the National Parks Board and the National University of Singapore to revise *The Singapore Red Data Book: Threatened Plants & Animals of Singapore*, to bring out an updated edition. A major project was the island-wide survey of horseshoe crabs in 2009. Under the leadership of Dr. Hsu Chia Chi, it was to establish the population of the two local species, *[Carcinoscorpius rotundicauda](/wiki/Mangrove_horseshoe_crab)* and *[Tachypleus gigas](/wiki/Tachypleus_gigas)*. A year later the researchers started using electronic tagging equipment to study their movements, homing instinct and hopefully locate their spawning sites. ### Education Committee In existence since the 1990s, the Education Group was low-key in its outreach activities until 2000 when Vilma Ann D’Rozario took over the leadership. Working closely with schools, she encouraged teachers to make use of the outdoors as a living classroom. She initiated the setting up of eco-ponds and butterfly gardens in schools for hands-on interaction with nature. Students were encouraged to chart out nature trails in neighbouring parks, produce their own nature brochures and be proficient nature guides so as to instill the love of nature to others. Brought up in a totally urban environment and housed in high-rise apartment buildings, most children were then totally divorced from nature. And most reacted negatively to insects, even to butterflies. Through a series of workshops with catchy titles like Fun with Frogs, Mad about Monkeys and Stuck with Sticks (insects), children were given a chance to interact closely with various animals, sometimes actually handling them, to remove their fear of the unfamiliar. A roving nature exhibition entitled Singapore's Amazing Wildlife, was set up in 2004 that toured primary schools in order to reach out to students and receive their feedback. A Circle of Life exhibition of digital art paintings depicting the native flora and fauna was launched in 2004 to celebrate the society's 50th anniversary. This was followed by a celebration of the country's biodiversity where each participant, mostly children from various schools, held a Life Card, each depicting a native plant or animal. This was follower by activities showcasing the nation's biodiversity. In 2008 Vilma passed on the leadership to Gloria Seow so that she could spend more time with the educational based Cicada Tree Eco-place, the NGO that she set up earlier. ## Special interest groups Activities of the society have always been generated by special interest groups. Such groups arise spontaneously as and when enthusiastic members come forward to lead and organise activities for other members to participate. Through the years these groups may form and disband, depending on the enthusiasm and willingness of leaders to continue leading. ### Bird Group The Bird Group was formed in 1984 by the late Clive Briffett. Under his leadership, guided walks, bird race, bird surveys, water bird census and bird counts were introduced. A monthly in-house newsletter, *Singapore Avifauna*, was started to record bird sightings and an updated checklist of birds was published. In 1992 the group published a book on locally extinct birds, a field guide in 1997, and a pocket checklist in 2007. In 2009 *The Avifauna of Singapore* was published. The raw data from this book formed a major part of the data in the Annotated Checklist of Birds of Singapore. In 2004 the group participated in [BirdLife International](/wiki/BirdLife_International)’s Important Bird Areas project for Asia, contributing a piece on Singapore. By then the society had become an affiliate of BirdLife. Currently, the Bird Group continues to raise awareness on birds and encourage birdwatching through many activities for members as well as the public. In the preceding years, under the leadership of Alan Owyong, the bird group leveraged on the internet and adopted digitisation to reach a greater audience. The Birds of Singapore, an Android app, was officially launched on 6 December 2014, developed by the SMU student team PentaxMatrix and Carl Zeiss Pte. Ltd. under guidance from the NSS Bird Group. The iOS version was also developed. ### Butterfly & Insect Group The Butterfly & Insect Group, formerly known as the Butterfly Interest Group, got its start when Project Painted Wings was launched in 1996. Talks and guided walks were conducted and field guides planned. The group was soon formalised under the leadership of Steven Neo who brought forth the first guidebook on local butterflies. Subsequently, posters, brochures and field guides on butterflies were produced. Members offered their expertise to set up butterfly gardens, especially in schools. In 2002 a garden was set up in [Alexandra Hospital](/wiki/Alexandra_Hospital), followed by one in the [Singapore Changi Airport](/wiki/Singapore_Changi_Airport) (Terminal 3) in 2007. The airport's open-air enclosure garden, accessible to transit passengers, houses about 2,000 butterflies of 47 species at any one time. A 4 km butterfly trail is in the making at Orchard, the heart of Singapore's tourist belt since 2010 in collaboration with [National Parks Board](/wiki/National_Parks_Board), [Singapore Tourism Board](/wiki/Singapore_Tourism_Board) and Orchard Road Business Administration. Starting from the [Singapore Botanical Gardens](/wiki/Singapore_Botanical_Gardens), it moves along Orchard Road to end in Fort Canning. Along the way are 15 butterfly spots where, hopefully, the various host plants can attract some 50 species. The trail has an open-concept and is freely accessible to the public anytime of the day. The trail map brochure can be downloaded from Nature Society's website. In 2010 the group collaborated with [Singapore Post](/wiki/Singapore_Post) to produce a series of butterfly stamps. In 2015 the group organised an online vote for \"Singapore's National Butterfly\" which allowed the public to vote for a butterfly from a suggested selection online. ### Jalan Hijau Jalan Hijau (Green Path) started as an independent group of individuals of diverse background united in their concern for the environment. It became affiliated to the society in 1992 as an environmental group, complementing the society's traditional focus on nature appreciation and conservation. Under the leadership of Cynthia-Wee Hoefer, activities centered on brown issues like recycling, waste minimisation and green consumerism. The group also published Singapore's first Green Directory. This was at a time when such issues were not in vogue and the Singapore Environment Council, labeled as \"government NGO\" or GONGO, had yet to be formed. In 1999 the group was revived as a youth group, working closely with other NGOs and becoming involved in various outreach initiatives like saving dolphins. ### Marine Conservation Group In 1991 the Marine Group, under the leadership of Helen Newman, initiated a coral rescue project that relocated hard corals from areas destined for reclamation. The first project involved 140 volunteers that worked on the [fringing reef](/wiki/Fringing_reef) around Buran Darat, off Sentosa island. The corals were transferred to the southern coast of Sentosa. The second project was more ambitious, lasting from mid-1993 to early 1995 and involving over 450 divers from six diving clubs. Corals were moved from reefs off the southern coast of Pulau Ayer Chawan, now part of the [Jurong Island](/wiki/Jurong_Island) landmass. Again, they were relocated to southern Sentosa. Survival rate was a low 10 percent, due to the absence of proper securing of the translocated corals at the new site. Only in 2006 did marine enthusiasts become seriously concerned about the lack of protection for the marine habitats. This led to the formation of the Marine Roundtable forum and the eventual drafting of the Singapore Blue Plan during the International Year of the Reef in 2008. Besides being involved in this roundtable, the group also provided feedback to the various government agencies as and when requited. Earlier the group published a coffee table book, *Singapore Waters – Unveiling Our Seas, highlighting the state of the marine biodiversity*. It contributed feedback on the remaining marine habitats to the [Singapore Green Plan](/wiki/Singapore_Green_Plan) 2002, Urban Redevelopment Authority's Parks and Waterbodies Plan 2002 and URA Masterplan. In 2006 the group got the society involved in Project Noah (Nurturing Our Aquatic Heritage), initiated by the Singapore Underwater Federation. The plan was to provide a so-called clear underwater paradise at the offshore island of Pulau Hantu. The subsequent uproar by marine biologists, claiming that the project would actually destroy the thriving marine biodiversity forced the society to withdraw its involvement from the project. The society threw in its support based on advice from the group, all of whom were recreational divers, as well as from the Conservation Committee, whose expertise has always been on birds rather than marine biology. This is one example of the danger of the society not collaborating with academics from the local universities. ### Plant Group Formed in 1999 to encourage plant appreciation among members, the group spawned a small number of fig enthusiasts popularly known as Figgies after a talk one evening by the then chairman, Dr. Shawn Lum. Thus began their monthly field trips scouring the country to locate the nearly 50 species of figs (*Ficus* spp.) recorded for Singapore. After nearly five years of searching, photographing, studying and documenting figs, they managed to compile their findings into a useful pocket-sized guide on local figs. Angie Ng, the live wire behind the project is currently helming the group. ### Vertebrate Study Group This group was formed in 1993 under the leadership of R. Subaraj. Members share an interest in the higher animals: mainly mammals, reptiles, amphibians and freshwater fishes. These groups of vertebrate were well documented during the colonial days. However, development during subsequent decades saw to the disappearance of most of the original forests. Many forest vertebrate species were thought to be locally extinct. Detailed surveys conducted by group members showed that many were still around, albeit rare. These include [banded leaf monkey](/wiki/Banded_leaf_monkey) (*Presbytis femoralis*), [Sunda slow loris](/wiki/Sunda_slow_loris) (*Nycticebus coucang*), [Malayan porcupine](/wiki/Malayan_porcupine) (*Hystrix brachura*). [leopard cat](/wiki/Leopard_cat) (*Prionailurus bengalensis*) and five-banded [flying dragon](/wiki/Flying_dragon) (*Draco quinquefasciatus*). Findings have now been compiled into a pocket guide under the editorship of Nick Baker and Kelvin Lim. *A Photographic Guide to Mammals, Reptiles, Amphibians and Freshwater Fishes* is fully illustrated with most of the images taken in or adjacent to the animals’ natural habitats. The guide also includes a checklist of freshwater fishes, amphibians, terrestrial reptiles and terrestrial mammals of Singapore. ## Former special interest groups ### Bird Ecology Study Group The Bird Ecology Study Group (BESG) was formed in 2005 to encourage the study of birds and their links with all aspects of the natural environment. With Wee Yeow Chin, R. Subaraj and Richard Hale leading the group, the group was to complement the existing Bird Group, whose activities the BESG founders felt had by then become totally recreational. BESG founders felt that local birdwatchers had already acquired the necessary skills to identify birds in the field but knowledge of bird ecology and behaviour was sadly lacking. Through close collaboration with the many photographers that were then seeking out birds as their subjects, new insights into bird behavior, from food birds take to nesting habits and inter specific relations, were showcased through crisp digital images and scientific interpretation in the group's website. In 1988, when a [Javan myna](/wiki/Javan_myna) (*Acridotheres javanicus*) was observed picking up ants and placing them on its feathers, BESG thought that no one knew what was going on. BESG thought that the use of ants to rid the feathers of ectoparasites, known as anting, was only well known among western birdwatchers when the behaviour was already published in books and shown on documentaries. It was only 17 years later, BESG believes, when the phenomenon was posted on the BESG's website that local birdwatchers understood the significance of this behaviour. BESG also thinks that birdwatchers were made aware through the website that species other than raptors and [owls](/wiki/Owls) regularly cast pellets. These were only two of the many aspects of behaviour that the website believes it made birdwatchers aware of. [Citizen science](/wiki/Citizen_science), then in its doldrums after more than a decade of recreational birding, saw a revival as a result of the many interesting postings. Citizen scientists began contributing snippets of bird behaviour they encountered in the field. But contributions were not always casual observations. There were instances of quality observations that resulted in papers published in [peer review](/wiki/Peer_review) journals and popular publications. On 1 January 2012, the BESG broke away from the NSS and operated as an independent group. Wee was the main person in running the BESG website for 15 years but on 1 January 2020, the BESG website was discontinued. However, in July 2021 the BESG website was revived when Teo Lee Wei and Wong Kais volunteered to take over the running of the website. ### Photo Group As far back as the early 1980s there was a small group of enthusiastic nature photographers who were documenting all aspects of the local nature. The public was then more familiar with foreign flora and fauna than their local counterparts. This was a time when textbooks had few local examples and popular nature books were on foreign plants and animals. History was made when the first colour coffee-table book on regional insects was published. This was followed a decade later by one on local natural history. Locals were then slowly becoming aware of the thriving nature within the concrete jungle they were living in. Chua Ee Kiam generously donated the proceeds from his book ($52,000) to the society for its conservation work. The author subsequently went on to published three other nature books. When digital photography came onto the scene around the early 2000, a group of enthusiastic nature photographers approached the society to reactivate the Photo Group which was then in dormancy. The society rejecting the initiative and as a result, the Nature Photographic Society (Singapore) was formed.[*failed verification*] - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:36:50.115416",
  "title": "Nature Society (Singapore)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Nature_Society_(Singapore)"
}