{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:36:59.755350"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Neighbourhood Renewal Programme\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(November 2007)* *(Learn how and when to remove this message)* The **Neighbourhood Renewal Programme (NRP)**, was introduced by [HDB](/wiki/Housing_and_Development_Board) during the [National Day Rally](/wiki/National_Day_Rally) in August 2007. It replaced the Interim Upgrading Programme IUP Plus, and focuses on block and neighbourhood improvements, with full funding by the government. Flats built up to 1989 which have not undergone major upgrading programmes are eligible for NRP. NRP is implemented on a larger area basis of 2 or more contiguous precincts. There will be greater local consultation on the design proposal and facilities to be provided through public forums such as town hall meetings, surveys and dialogue sessions where residents will be able to voice their views and also hear the concerns of their fellow residents. From FY2015 onwards, the programme will be extended to include blocks built up to 1995. ## Scope of Works Items that may be considered for upgrading works: ### Block-level items - New letterboxes - Residents’ corners - Seating area at void decks - Lift lobby tiling & rescreeding ### Neighbourhood-level items - Drop-off porch - Covered linkways - Playground - Footpath/Jogging track - Fitness corner - Street soccer pitch - Pavilion/Shelter - Landscaping Where feasible, other improvement works or upgrading programmes with separate funding may also be carried out in tandem with NRP to minimise inconvenience to the residents, e.g. Revitalization of Shops Scheme (ROS), upgrading of neighbourhood park and works to improve barrier-free accessibility. ## Consensus Gathering NRP will proceed only if at least 75% of the eligible flat owners in the neighbourhood indicate their support for it at the Consensus Gathering Exercise. - HDB InfoWEB, Neighbourhood Renewal Programme(NRP)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:36:59.755079",
  "title": "Neighbourhood Renewal Programme",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Neighbourhood_Renewal_Programme"
}