{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:37:01.604477"
  },
  "content": "British author (born 1974)This biography of a living person **needs additional citations for verification**. Please help by adding reliable sources. Contentious material about living persons that is unsourced or poorly sourced **must be removed immediately** from the article and its talk page, especially if potentially libelous. *Find sources:* \"Neil Humphreys\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(March 2015)* *(Learn how and when to remove this message)* **Neil John Humphreys** (born 5 December 1974) is a British author and columnist based in Singapore. He has written 30 books. Brought up in [Dagenham](/wiki/Dagenham), [London](/wiki/London), [England](/wiki/England), Humphreys migrated to Singapore in 1996, left for Australia in 2006 and came back to Singapore in 2011. He worked as a humour columnist, first at *[TODAY](/wiki/Today_(American_TV_program))* and then *[The Straits Times](/wiki/The_Straits_Times)* and *The New Paper*. Humphreys continues to write for newspapers, magazines and websites in Singapore, Malaysia, Japan, Australia, and the UK. His humour, football and lifestyle columns have appeared in *FourFourTwo, Esquire, The New Paper, The Age, The Straits Times* and *TODAY*. He now writes for [Yahoo](/wiki/Yahoo) and hosts an award-winning football podcast. Humphreys is currently working on an Abbie Rose and the Magic Suitcase TV series and his Inspector Low crime novels are also being developed for TV . ## Career Humphreys began as a speech and drama teacher, teaching at primary and secondary schools across Singapore, including [Victoria School](/wiki/Victoria_School). Humphreys was a humour columnist with local newspaper *[Today](/wiki/Today_(Singapore_newspaper))*. He contributed to its sports section, mostly with news related to the [English Premier League](/wiki/FA_Premier_League), and its entertainment section, with regular movie reviews. He later wrote for The Straits Times. He now writes for [Yahoo](/wiki/Yahoo). But he was best known for his humorous columns poking fun at various facets of life in Singapore, and revealing aspects of his childhood in working-class [London](/wiki/London). He once said that he speaks with a [Cockney](/wiki/Cockney) accent. ## Migration Neil Humphreys left Singapore for Australia with his wife in 2006. He lived in Victoria for five years. In 2007, he started writing for *The Straits Times*, *ARENA Singapore*, Tiger Airways' in-flight magazine and *Young Parents*. In August 2011, Humphreys returned to Singapore and kicked off a new humour column with *The New Paper.* He also released a new book, *Return to a Sexy Island*, humorously describing how Singapore had changed while he was away. ## Personal life Humphreys is married. He writes about his wife frequently in his columns and books. They have a daughter. Humphreys' mother lives in [Kent](/wiki/Kent), [England](/wiki/England). ## Works ### Books - Notes From an Even Smaller Island (2001) - Scribbles from the Same Island (2003) - Final Notes from a Great Island (2006) - Complete Notes From Singapore The Omnibus Edition (2007) - Be My Baby: on the Road to Fatherhood (2008) - Match Fixer (2010) - Premier Leech (2011) - Return to a Sexy Island: Notes from New Singapore (2012) - Secrets of the Swamp (2013) - Marina Bay Sins (2014) - Saving a Sexier Island: Notes from Old Singapore (2015) - The Hunt for the Green Boomerang (2015) - Rich Kill Poor Kill (2016) - Abbie Rose and the Magic Suitcase (2012–2018) - Princess Incognito series (2018-2023) - Bloody Foreigners (2021) - The Pet Adventure (2022) - Lost Women (2023) ### TV - Singtel Mio Football TV (2012–2014) - Return to a Sexy Island (2013) - Eleven Sports' The Social (2017) - Neil Humphreys on [Twitter](/wiki/Twitter)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:37:01.604135",
  "title": "Neil Humphreys",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Neil_Humphreys"
}