{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:37:04.620918"
  },
  "content": "Singaporean basketball player and coach **Neo Beng Siang** ([Chinese](/wiki/Chinese_language): 梁明祥; [pinyin](/wiki/Pinyin): *liáng míng xiáng*) is a professional [basketball](/wiki/Basketball) coach from [Singapore](/wiki/Singapore). He is currently the head coach of the [Singapore Slingers](/wiki/Singapore_Slingers) in the [Asean Basketball League](/wiki/Asean_Basketball_League) (ABL). He was the head coach of the [Singapore national basketball team](/wiki/Singapore_national_basketball_team) from 2003 until his resignation in 2016 ## Career ### Playing career Neo was initially into football when he was in primary school. He initially played in the goalkeeper position but moved to the forward position due to his quickness. He was retained for a year in Primary 6 due to neglecting his studies. In secondary school, Neo switched to basketball. Following his participation at an inter-house basketball competition in Sec 2, the Toh Tuck Secondary School invited him to take a trial for a chance for him to secure a position at their team. Neo made it but after a year he got accepted in the school's team he followed his seniors and switched to playing for the Yuan Ching secondary school team. Yuan Ching was nearer to Neo's home in [Boon Lay](/wiki/Boon_Lay). Neo played for the [Singapore Armed Forces Sports Association](/wiki/Singapore_Armed_Forces) turning down a chance to become a commando section leader while serving [National Service](/wiki/National_service_in_Singapore). #### International Neo managed to secure a place at the Singapore national under-18 team in 1985. Four years later, in 1989, Neo joined the [senior national team](/wiki/Singapore_national_basketball_team) and played for them for a decade. ### Coaching The Police Sports Association approached him to lead their 3rd-tier side as coach after he retired as a player in 1999. He helped the side achieve promotions to the National Basketball League Division One. His stint with the Police helped him secure a job as head coach of the [Singapore national basketball team](/wiki/Singapore_national_basketball_team) in 2003. He helped the national team achieve a bronze medal at the [2013 Southeast Asian Games](/wiki/Basketball_at_the_2013_Southeast_Asian_Games_%E2%80%93_Men%27s_tournament) the first medal for the national team since (/wiki/1979_Southeast_Asian_Games). The team also won another bronze at the [SEA Games in 2015](/wiki/Basketball_at_the_2015_Southeast_Asian_Games_%E2%80%93_Men%27s_tournament). He retired from his post with the national team to spend more time with his family. He has also coached the [Singapore Slingers](/wiki/Singapore_Slingers) of the [ASEAN Basketball League](/wiki/ASEAN_Basketball_League) since 2011. At the [2015–16 ABL season](/wiki/2015%E2%80%9316_ABL_season), Neo was conferred with the Coach of the Year award after leading his team to the final two, a first for the Singaporean side.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:37:04.620518",
  "title": "Neo Beng Siang",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Neo_Beng_Siang"
}