{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:37:07.621516"
  },
  "content": "People of Nepali origin settled in SingaporeEthnic group There is a large community of **Nepalese in Singapore**, consisting mostly of [Gurkhas](/wiki/Gurkhas) recruited from [Nepal](/wiki/Nepal) and their families. ## Overview ### Gurkhas The **Gurkha Contingent** was formed in Singapore on 9 April 1949 in the wake of [Indian independence](/wiki/Indian_Independence_Movement) from the [British Empire](/wiki/British_Empire), where [Gurkhas](/wiki/Gurkha) battalions from the [British Indian Army](/wiki/British_Indian_Army) were divided between the Indian Army and the British Army. Those transferred to the British Army were posted to other remaining British Colonies. In [Malaya](/wiki/Federation_of_Malaya) and [Singapore](/wiki/Singapore), their presence was badly needed to battle the worsening [communist](/wiki/Communism) [threat](/wiki/Malayan_Emergency), and to replace the [Sikh](/wiki/Sikh#Sikhs_in_the_Indian_and_British_armies) unit in Singapore which reverted to the Indian Army on Indian independence. Just a year after their formation, their presence became an asset when racial riots between the Malay and European communities broke out over the [disputed custody of Maria Hertogh](/wiki/Maria_Hertogh_riots). The GC troopers were again activated when major rioting erupted all over the country between the ethnic Malays and Chinese on Prophet [Mohammed](/wiki/Mohammed)'s birthday from 21 July 1964 till September that same year. Ultimately, the officers know they are here only on a temporary basis, further enforced by the fact that they are disallowed from integrating too much with local society. Due to their chief purpose as a neutral presence here, they are not allowed to marry Singaporean women, hence the allowance to bring their wives and children from Nepal to their base camp in [Mount Vernon](/wiki/Mount_Vernon,_Singapore). At the end of their contract, they are expected to return to their country and most of them start their own business and get along with their lives. Only a handful have ever been known to have broken this tradition and chosen to stay in the city-state. ### Other groups There are Nepalese who were born in Singapore, of Nepali migrants who came after the 2nd World War. They are Singaporean Nepalis. They are Singapore Citizens by birth, attended local schools and the men served their National Service. A small number of Nepalese in Singapore also consists of domestic helpers from Nepal. Nepalese helpers, along with Sri Lankan and Burmese helpers, lack any sort of cohesive organization and are usually exploited both by their employers and the agencies that recruit them compared to Filipino and Indonesian helpers. ## Notable people - Paras, Ex-Crown Prince of Nepal – Former Nepalese prince in exile - [Prabal Gurung](/wiki/Prabal_Gurung) – Nepalese-American fashion designer (born in Singapore) - [Gurkha Contingent](/wiki/Gurkha_Contingent) - [Indians in Singapore](/wiki/Indians_in_Singapore) Portals: - Nepal - Singapore\n",
  "language": "en",
  "processed_at": "2026-01-12T11:37:07.621180",
  "title": "Nepalis in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Nepalis_in_Singapore"
}