{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:37:09.372260"
  },
  "content": "Singaporean shipping company **Neptune Orient Lines Limited** (**NOL**) was a Singaporean [container shipping](/wiki/Container_shipping) company. It was founded in 1968 as Singapore's national [shipping line](/wiki/Shipping_line), but was later sold as a subsidiary to French shipping company [CMA CGM](/wiki/CMA_CGM) in 2016. On 1 October 2020, NOL was [restructured](/wiki/Restructuring) into a regional hub and was renamed to **CMA CGM Asia Pacific Limited**. ## History In December 1968, Neptune Orient Lines was started as Singapore's national shipping line. Wholly owned by the Singapore Government, it was formed in an effort to develop and support Singapore's economy. ### Containerization In the 1970s, [containerization](/wiki/Containerization) was introduced. In the mid-1970s, NOL's managing director was [Goh Chok Tong](/wiki/Goh_Chok_Tong), who went on to become Singapore's second Prime Minister. In 1975, NOL then entered the Asia-Europe trade as part of the ACE Group consortium with partners [OOCL](/wiki/OOCL), [K Line](/wiki/K_Line), [COSCO](/wiki/COSCO) and Franco-Belgian Services, known as the \"third force\" in the container-shipping world. Meanwhile, it entered the key Trans-Pacific Trade with a standalone service. ### Merger with APL In 1997, NOL made a US$825 million acquisition of [American President Lines](/wiki/American_President_Lines) (APL), whose heritage dates back to 1848. Following the merger, the APL name was adopted as the public brand name. The NOL name was retained for the [holding company](/wiki/Holding_company), which was listed on the [Singapore Exchange](/wiki/Singapore_Exchange) and was well known to its investors. The company focused on managing global supply chains in 2001 when [APL Logistics](/wiki/APL_Logistics) was established as a separate business unit. In 1998, during the [Asian economic crisis](/wiki/Asian_economic_crisis), NOL saw losses mount to US$460 million, while its debt was more than US$4 billion. The company sold off assets to clear the debt and by 1999 was profitable again. In 2003, NOL completed the divestment of its tankering businesses AET and NAS, to concentrate on the company's core container shipping and logistics services. On 1 October 2011, [Ng Yat Chung](/wiki/Ng_Yat_Chung) was appointed as CEO of NOL, replacing Ron Widdows. On 17 February 2015, APL Logistics was sold to [Kintetsu World Express](/wiki/Kintetsu_World_Express), Inc. for US$1.2 billion. ### Sale of NOL to France's CMA CGM On 9 June 2016, it was announced that Temasek will tender its NOL shares to shipping company [CMA CGM](/wiki/CMA_CGM). CMA launched an all-cash voluntary conditional general offer for outstanding NOL shares at SG$1.30 a piece. The deal is worth SG$3.38 billion and eventually will be delisted from the Singapore Exchange. The company announced in May 2016 reported net losses of US$105.1 million (SG$142 million) for the first quarter ended 31 March, higher than the US$10.8 million a year earlier. Former CEO [Ng Yat Chung](/wiki/Ng_Yat_Chung) acknowledged that the company had been \"a bit slow and reluctant to change\". On 28 June 2016, CMA CGM said it will proceed to delist NOL, after it crossed the 90 per cent ownership threshold in the company and NOL was subsequently delisted on 5 September 2016. In May 2017, less than a year after the NOL acquisition, CMA reported turning a net profit of $26 million from the NOL business in the first quarter of the year. ### Restructuring to CMA CGM Asia Pacific Limited On 7 July 2020, CMA CGM announced a [restructuring](/wiki/Restructuring) of its services in the [Asia-Pacific](/wiki/Asia-Pacific) region. NOL and CMA's regional office was reorganized into a regional hub and renamed to CMA CGM Asia Pacific Limited on 1 October 2020. - [List of largest container shipping companies](/wiki/List_of_largest_container_shipping_companies) Library resources about **Neptune Orient Lines** - Resources in your library - Resources in other libraries\n",
  "language": "en",
  "processed_at": "2026-01-12T11:37:09.371740",
  "title": "Neptune Orient Lines",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Neptune_Orient_Lines"
}