{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:37:11.345346"
  },
  "content": "Singaporean company **NetLink Trust**, formerly known as **OpenNet**, is the owner, designer, builder and operator of the passive fibre network structure (comprising ducts, manholes, fibre cables and central offices) of Singapore's Next Generation Nationwide Broadband Network (NGNBN). The NGNBN is a project under the Intelligent Nation 2015 master plan by the [Infocomm Media Development Authority of Singapore](/wiki/Infocomm_Media_Development_Authority), which seeks to transform Singapore into an intelligent nation and global city, powered by info-communications. NetLink Trust held an [initial public offering](/wiki/Initial_public_offering) in 2017, under the name NetLink NBN Trust, at which point it was a subsidiary of [Singtel](/wiki/Singtel). NetLink NBN Trust is registered as a business trust under the Business Trusts Act, Chapter 31A of Singapore, and was listed on the Main Board of the [Singapore Exchange](/wiki/Singapore_Exchange) Securities Trading Limited on 19 July 2017. ## History In 2008, OpenNet, a consortium comprising [Axia NetMedia Corporation](/wiki/Axia_NetMedia), [Singtel](/wiki/Singtel), [Singapore Press Holdings](/wiki/Singapore_Press_Holdings) and SP Tel, is selected as the Network Company to design, build and operate the passive infrastructure for the Next Gen NBN. In 2009, OpenNet is issued a Facilities-Based Operator Licence for it to commence the roll-out of the Next Gen NBN. Starting 2010, OpenNet began rolling out optical fibre to homes, offices and buildings in Singapore. In 2011, Singtel established NetLink Trust as part of the commitments made by the OpenNet consortium, and appoints CityNet Infrastructure Management Pte Ltd to carry out the business of establishing, installing, operating and maintaining the assets transferred from SingTel to support the operations of OpenNet. In 2012, OpenNet rolled out fibre coverage to 95% of all residential homes and non-residential premises in Singapore. In 2013, OpenNet is acquired by CityNet, which will act as a Trustee-Manager for NetLink Trust. In 2014, OpenNet was fully integrated into NetLink Trust. ## Network and infrastructure The extensive Next Gen NBN, which delivers ultra-high-speed internet access of 1 Gbit/s and above throughout mainland Singapore, covers all residential homes and non-residential premises, and its connected islands. It comprises three distinct layers to provide effective open access to downstream operators. ## Awards and accolades - Achieved the top ranking in its first year of being included in the Governance Index for Trusts (GIFT). - Named Most Transparent Company, REITs & Business Trust Category, at the SIAS 20th Investors' Choice Awards. ## Incident In 2014, OpenNet was fined $240,000 by the [Infocomm Development Authority Of Singapore](/wiki/Infocomm_Media_Development_Authority), for failing to provide fibre broadband services to non-residential users on time.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:37:11.344890",
  "title": "NetLink Trust",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/NetLink_Trust"
}