{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:35:19.033398"
  },
  "content": "Singaporean electronic payment service provider **Network for Electronic Transfers**, colloquially known as **NETS**, is a [Singaporean](/wiki/Singapore) [electronic payment service provider](/wiki/EFTPOS). Founded in 1986 by a consortium of local banks, it aims to establish the [debit](/wiki/Debits_and_credits) network and drive the adoption of [electronic payments](/wiki/E-commerce_payment_system) in [Singapore](/wiki/Singapore). It is owned by [DBS Bank](/wiki/DBS_Bank), [OCBC Bank](/wiki/OCBC_Bank) and [United Overseas Bank (UOB)](/wiki/United_Overseas_Bank). The NETS Group (comprising NETS, BCS and BCSIS) provides a full suite of payments and financial processing services including direct debit and credit payments at point-of-sale (NETS) and online (eNETS), mobile payments (NETSPay), card services (CashCard, FlashPay card), electronic funds transfer (FAST, [PayNow](/wiki/PayNow), GIRO) and payment and clearing services (Real-Time Gross Settlement, Cheque Truncation System). NETS is also a member of the Asian Payment Network (APN) and a council member of [UnionPay](/wiki/UnionPay) International. ## History NETS was first introduced to the public on 27 June 1985 as a 2-month pilot project involving 10,000 ATM card holders from the five local banks, namely [DBS Bank](/wiki/DBS_Bank), [OCBC Bank](/wiki/OCBC_Bank), [UOB](/wiki/United_Overseas_Bank), [POSB Bank](/wiki/POSB_Bank) and [OUB](/wiki/Overseas_Union_Bank) through 64 terminals installed at participating government offices, supermarkets, department stores and petrol kiosks. The service was officially launched on 18 January 1986, allowing 1.3 million ATM card holders to make transactions through the initial NETS network of 195 terminals located in various retail outlets and by 1993, [consumer spending](/wiki/Consumer_spending) through NETS reached [S$](/wiki/Singapore_dollar)1.14 billion. In 2020, NETS Group signed a long-term lease to two full floors and a ground-floor unit, at [Boustead Projects'](/wiki/Boustead_Singapore) development, 351 on Braddell. ## Acceptance NETS operates Singapore's national debit scheme enabling customers of [DBS Bank](/wiki/DBS_Bank), [POSB](/wiki/POSB_Bank), [HSBC](/wiki/HSBC_(Hong_Kong)), [Maybank](/wiki/Maybank), [OCBC Bank](/wiki/OCBC_Bank), [Standard Chartered Bank](/wiki/Standard_Chartered), [CIMB](/wiki/CIMB) and [UOB](/wiki/United_Overseas_Bank) to make payments using their physical/contactless ATM cards or mobile devices at more than 120,000 acceptance points in Singapore including major retailers, food courts, hawker centres, convenience stores and supermarkets.[*citation needed*] The nationwide acceptance infrastructure is the largest in Singapore and includes 54,000 Unified Point-of-Sale (Unified POS) terminals (which accept NETS, NETS FlashPay, debit and credit cards such as [VISA](/wiki/Visa_Inc.), [Mastercard](/wiki/Mastercard), [American Express](/wiki/American_Express), [UnionPay](/wiki/UnionPay), [RuPay](/wiki/RuPay) and [JCB](/wiki/JCB_(credit_card_company))) and 94,000 QR acceptance points (for payments via NETSPay, PayLah!, Pay Anyone and Mighty). In 2011, NETS' debit system was designated as national payment system by the [Monetary Authority of Singapore](/wiki/Monetary_Authority_of_Singapore) (MAS). In November 2018, it was announced that NETS can be used at 4,500 acceptance points in Malaysia, allowing users of NETS enabled cards issued by [DBS](/wiki/DBS_Bank), [POSB](/wiki/POSB_Bank), [OCBC Bank](/wiki/OCBC_Bank) and [United Overseas Bank](/wiki/United_Overseas_Bank). ## Card services ### CashCard NETS introduced the 1st generation **chip-based CashCard** in 1995. The CashCard is a stored value card that is predominantly used as a payment mode for Singapore's Electronic Road Pricing (ERP) and car park charges since the introduction of the in-vehicle unit in 1997. The CashCard can also be used for retail purchases. #### vCashCard In May 2015, NETS launched **vCashCard**, a virtual wallet for road tolls payment that allows motorists to drive through Singapore's Electronic Road Pricing (ERP) gantries seamlessly. Road toll payments are automatically charged to their bank accounts or debit/credit cards. With NETS vCashCard, motorists do not need to worry about forgetting to insert a physical CashCard/FlashPay into the in-vehicle unit or having insufficient value in the CashCard/FlashPay and paying unnecessary ERP admin fees. Motorists can sign up for auto top-up service and view their ERP transactions at the vCashCard website or NETS vCashCard app from App Store or Google Play. #### Contactless CashCard In May 2018, the 2nd generation **contactless CashCard** was released. The CEPAS CashCard card is based on the same specifications as the **CEPAS FlashPay** card, thus both cards can be used interchangeably. The Contactless CashCard was rebranded **NETS Motoring Card** in March 2021. ### FlashPay The Singapore Government launched [CEPAS](/wiki/CEPAS) 2.0 (Contactless e-Purse Application), a Singaporean specification of a common standard for electronic money smart card, in 2009. The transit market was opened to more issuers, enabling NETS to participate and subsequently launch the NETS FlashPay card on 9 October 2009. **FlashPay** is a multipurpose contactless stored value smart card that can be used for a huge variety of quick payments at/on – MRT/LRT, public buses, taxis, ERP gantries (with the dual-mode in-vehicle unit), car parks (which have been upgraded to accept CEPAS-compliant cards), and 102,000 retail acceptance points island-wide. It is comparable to the [Octopus card](/wiki/Octopus_card) in Hong Kong. Compared to EZ-Link, FlashPay is accepted at more retail shops, including most convenience stores, supermarkets, and fast food restaurants. In October 2010, NETS launched the Auto Top Up service for the NETS FlashPay card, allowing commuters to automatically top up the value on their cards to a predetermined amount (S$30, S$40 or S$50) when it runs low or when there is insufficient stored value on the card to make payment at all MRT and LRT stations, public buses, ERP gantries and EPS (upgraded) carparks. The **FlashPay Reader** app was released in February 2016 for Android devices with NFC capabilities. It allows topping up of FlashPay cards using NFC-enabled Android phones, with debit cards and credit cards as payment options. Cardholders can also check their card balance, card expiry date, view the last 30 transactions, register for Auto Top-Up by Credit/Debit Card and view RSVP balance with the FlashPay Reader. ### Prepaid Card In November 2022, NETS launched the **Prepaid Card**. The NETS Prepaid Card can be used by tourists, who do not have a Singapore-based bank account, to make payments at retail merchants that accept NETS. Unlike the FlashPay card, the Prepaid Card uses online account-based ticketing, which works with the SimplyGo ticketing system. It is however not compatible with the [ERP](/wiki/Electronic_Road_Pricing). On 10 January 2024, LTA announced that NETS FlashPay cards will no longer be accepted for public transport fare payment from 1 June 2024, due to phasing out of the legacy card-based ticketing system. Commuters with NETS FlashPay Cards may exchange their current card for a free NETS Prepaid Card at SimplyGo Ticket Offices or Ticketing Service Centres. Due to bottlenecks, high transaction volume, and technical issues with the SimplyGo transition on both EZ-Link and NETS payment networks, NETS announced that the free exchange for NETS Prepaid Cards which was planned to commence on 19 January 2024 has been postponed until further notice. ## Payment types ### NETS EFTPOS NETS EFTPOS is a nationwide infrastructure that enables DBS, HSBC, [Maybank](/wiki/Maybank), OCBC, POSB, UOB and Standard Chartered Bank customers to make purchases at points-of-sale using their ATM cards. The NETS EFTPOS service is available at more than 130,000 acceptance points throughout Singapore. ### NETS Unified POS NETS Unified POS was introduced to accept contact/contactless, credit and debit payments on one terminal. The terminal accepts NETS, NETS FlashPay, debit and credit schemes such as VISA, MasterCard, American Express, UnionPay and JCB, cards issued by partnering banks (e.g. BCA bank), as well as NFC-enabled mobile wallets like Apple Pay, Android Pay and Samsung Pay. NETS Unified POS can be integrated with loyalty programmes, prepaid services and point-of-sale via Electronic Cash Register interface. ### eNETS eNETS is an online payment gateway services. It enables payment from all major credit cards and currencies as well as Direct Debit (internet banking payments) from the major banks in Singapore and China, including DBS (Singapore and Hong Kong), UOB, OCBC, Citibank and BNU. ### NETS eCommerce NETS eCommerce was launched in 2016 to provide a quick and affordable end-to-end service to set up webstores. It is integrated with secured payment options using eNETS Debit and Credit. ### NETS Contactless, NETS QR, and NETSPay **NETSPay** is a [digital wallet](/wiki/Digital_wallet) app. Launched in October 2017, it introduces 2 new payment options for NETS debit, **NETS Contactless** and **NETS QR**. NETS Contactless is supported on [Android](/wiki/Android_(operating_system)) devices via [NFC](/wiki/Near_field_communication) and [HCE](/wiki/Host_card_emulation), and NETS QR is supported on Android & [iOS](/wiki/IOS) devices via [QR code](/wiki/QR_code). ATM cardholders can digitise their bankcards with the app, replacing the debit card [chip and PIN](/wiki/Chip_and_PIN) transaction at [point-of-sale terminals](/wiki/Point-of-sale_terminal) that have been upgraded to accept contactless and QR code payments. Fingerprint ID or passcode authentication is required to access the app, with a user configurable session timeout. No PIN is required for transactions below $100. NETS Contactless ATM cards were launched from the first quarter of 2018. In December 2018, NETS Contactless cards issued by DBS/POSB, UOB, OCBC began to be accepted for LTA's public transport account-based ticketing trial. In May 2023, the NETS Contactless functionality was extended to Mastercard and Visa debit cards, in addition to the chip and PIN transaction method. The NETSPay wallet was discontinued on 1 December 2020 and the NETSPay app was discontinued on 31 October 2023. On 20 June 2025, NETS partnered with [Shopee](/wiki/Shopee) to allow ShopeePay users to make payments by scanning NETS QR codes on SGQR labels. (This currently excludes dynamically-generated NETS QR codes on POS terminals.) ### SGQR QR payments In September 2018, it was announced that the Singapore government has appointed NETS as the master acquirer to unify and roll out e-payments to all 12,000 stalls at hawker centres, canteens and coffee shops in Singapore. The Government will cover transaction fees of 0.5% payable by merchants until 31 December 2024. The initiative began its roll out to hawker stalls starting from June 2019 under SGQR, a single standardised QR code for e-payments. The participating payment schemes for the NETS unified e-payment system at hawkers centres include: ActiveSG, Alipay, American Express, Singtel Dash, DBS PayLah, Diners Club International, Discover, EZ-Link, GrabPay, SLIDE Wallet, LifeUp Pay, LiquidPay, NETSPay, OCBC PayAnyone, RazerPay, Standard Chartered, UnionPay, UOB Mighty, VIA by Singtel, WeChat Pay, Aby Pay, Shopee Pay, XNAP.[*citation needed*] In November 2023, the [Monetary Authority of Singapore](/wiki/Monetary_Authority_of_Singapore) announced a proof of concept for SGQR+, an upgraded version of SGQR that provides interoperability among a wide variety of payment schemes in a convenient and cost-effective way, through a single merchant acquirer. Merchants only need to maintain a relationship with a single preferred primary acquirer to accept multiple payment schemes, instead of multiple acquirers under the existing system. Examples of similar [integrated QR code payment systems](/wiki/QR_code_payment#Integrated_QR_code_payment_systems) in [ASEAN](/wiki/ASEAN) include: [QRIS](/wiki/QRIS) in Indonesia, DuitNow in Malaysia, Thai QR in Thailand. Under the SGQR+ Proof of Concept, the stakeholders include Liquid Group (as Switch Operator) and NETS (as Master Merchant Acquirer). The participating payment schemes for SGQR+ Proof Of Concept include: ActiveSG, Alipay, Alipay+, Changi Pay, Diners, Discover, DuitNow, EZ-Link, GLN, Google Pay (via XNAP), GrabPay, iAPPS, LiquidPay, Mastercard, Moolahgo, NETS, PromptPay, ShopeePay, Singtel Dash, UnionPay, Visa, WeChat, XNAP. ### Payment terminals These terminals are issued to retailers to accept NETS debit, NETS FlashPay/CashCard, debit/credit card payments. Countertop ModelPin Pad ModelRetailersContactless PaymentQR Code PaymentRemarks[Verifone](/wiki/Verifone) VX520[Verifone](/wiki/Verifone) 1000SEDefault terminal issued to most retail outlets from 2014 to 2017. Phased out in 2023 and replaced by Ingenico Desk 5000 Depends (might not detect some NFC devices/cards)Printed on paper roll - Terminals with firmware that has not been updated do not support NETS Contactless and NETS QR, only NETS debit Chip-and-PIN and NETS FlashPay. - As the terminal screen is too small, a QR code has to be generated and printed on receipt paper for each NETS QR code transaction. [Ingenico](/wiki/Ingenico) ICT220[Ingenico](/wiki/Ingenico) IPP310Most retail outlets with explicit support for NETS QR and NETS Contactless. (2018-present)YesYes - Supports NETS debit (Chip-and-PIN, contactless, [dynamic QR code](/wiki/Dynamic_QR_code)) and NETS FlashPay. - NETS QR code is generated dynamically and displayed on terminal screen. - Capable of accepting Visa PayWave, MasterCard PayPass, Amex ExpressPay*, UnionPay QuickPass*, JCB QUICPay* (*dependent on merchant) [Ingenico](/wiki/Ingenico) iWL250n/aRetailers that require a portable terminal. (e.g. atrium fairs, roadshows) Replaced by Ingenico Move 5000 YesYes[Ingenico](/wiki/Ingenico) ISC250n/a[7-Eleven](/wiki/7-Eleven), [Isetan](/wiki/Isetan), [Starbucks](/wiki/Starbucks) Self-checkout counters at [Cold Storage](/wiki/Cold_Storage_(supermarket)), [Giant Hypermarket](/wiki/Giant_Hypermarket) (2018-2025) Gradually replaced by Ingenico Desk 5000 in mid-2025. YesYes[Ingenico](/wiki/Ingenico) ICT250n/a[Koufu food court](/wiki/Koufu_(company)) (2018-2023) Self-ordering kiosks at [Burger King](/wiki/Burger_King) (2018-2023), [KFC](/wiki/KFC) (2018-2025), KOI Thé, [Pepper Lunch](/wiki/Pepper_Lunch) (2018-2023), etc.YesYes[Verifone](/wiki/Verifone) VX820n/aNTUC Unity Healthcare (2018-2023), Cheers (2018-2023) Self-checkout counters at [McDonald's](/wiki/McDonald%27s) (2018-2023), [NTUC FairPrice](/wiki/NTUC_FairPrice) (2018-2023) Phased out in 2023-2024 and replaced by Ingenico Desk 5000 Depends (might not detect some NFC devices/cards)YesCastles VEGA3000n/aThis terminal is issued to hawker centres. (2019-present)YesYes[Ingenico](/wiki/Ingenico) Desk 5000n/aThis is the default terminal is issued to most retail outlets since 2020-2021. Current retailers as of 2024 include: [Koufu food court](/wiki/Koufu_(company)), [Burger King](/wiki/Burger_King), [McDonald's](/wiki/McDonald%27s), [Daiso](/wiki/Daiso), [NTUC FairPrice](/wiki/NTUC_FairPrice) (upgraded counters) Retailers that support NETS/NETS FlashPay/NETS QR single selection for cashier: [Yoshinoya](/wiki/Yoshinoya), [Watsons](/wiki/Watsons), [Breadtalk](/wiki/Breadtalk), [Bengawan Solo](/wiki/Bengawan_Solo_(company)) YesYes[Ingenico](/wiki/Ingenico) Move 5000n/aRetailers that require a portable terminal. (e.g. atrium fairs, roadshows) (2022-present)YesYesCastles UPT1000Fn/aThis terminal is installed at some carpark gantries and vending machines since 2022-2023.Yes—N/a[Verifone](/wiki/Verifone) VX680n/aFood Junction (2018-2023) Phased out in 2023-2024 and replaced by Ingenico Desk 5000 FlashPay RSVP—N/a - Used for NETS FlashPay RSVP (Retailer Stored Value Programme) payment. The NETS FlashPay RSVP private wallet will be discontinued on 19 November 2023. The launch of NETS QR and NETS Contactless in October 2017 required merchants' payment terminals to undergo a software update, as previously only chip-and-pin NETS debit payment was available. Merchants may display decals in stores to advertise acceptance of QR and contactless payments. Customers can identify if NETS QR and NETS Contactless are accepted by looking at the options listed on the payment terminal's menu. OptionTerminal with new firmware ([Ingenico](/wiki/Ingenico) ICT220)Terminal with old firmware ([Verifone](/wiki/Verifone) VX520)F1NETS FlashPayNETS FlashPayF2NETS (will prompt \"Tap/Insert Bank Card\")NETS (will prompt \"Insert Bank Card\")F3Credit Card/UPIInternational CardF4NETS QRCredit Card On the Castles VEGA3000 and [Ingenico](/wiki/Ingenico) Desk/Move5000 terminals issued since late 2022-2023, the \"NETS EFTPOS Debit\" and \"NETS FlashPay\" payment modes are combined into a single menu item as \"NETS\". Hence, the cashier only has to press a single selection for NETS on the newer terminals, instead of pressing separate selections for NETS EFTPOS Debit and NETS FlashPay payment on previous terminals. For purchase transactions that are not entered manually on the payment terminal, and are generated automatically by some integrated [point-of-sale](/wiki/Point-of-sale) (POS) systems, the payment mode (NETS, NETS FlashPay, NETS QR) still needs to be selected separately on the POS system by the cashier. Auto-generated purchase transactions can be identified by a light blue background on the payment terminal's payment screen. Payment ModeDevice Navigation ([Ingenico](/wiki/Ingenico) Desk/Move5000) - NETS EFTPOS Debit - upgraded debit cards & ATM cards with NETS contactless feature - NETS Prepaid Card - NETS FlashPay - NETS Motoring Card –Enter purchase amount on the terminal –Select \"NETS\" payment mode –Tap and hold card/smartphone on the terminal for about 5 seconds, until a beep is heard - NETS QR –Enter purchase amount on the terminal –Select \"NETS\" payment mode –Press \"Select to pay by NETS QR\" –Scan NETS QR code with NETSPay, DBS PayLah, OCBC PayAnyone, or UOB TMRW mobile app ## Comparison of payment modes ### Card payments – linked to bank account Payment ModeDescriptionYear IntroducedRegistration Requirement[Magnetic Stripe](/wiki/Magnetic_Stripe)[Chip and PIN](/wiki/Chip_and_PIN)[Contactless payment](/wiki/Contactless_payment)Top Up Locations• NETS Bank Card ([EFTPOS](/wiki/EFTPOS) Debit) Direct debit from bank account.1985: Magnetic stripe card 2014: EMV card 2017: Tap-to-pay (with contactless ATM cards & NETSPay mobile app) 2023: Tap-to-pay (with co-branded VISA debit cards) The card is tied to user's bank account.No (deprecated in 2014)YesYes (With a contactless ATM card at upgraded terminals; some cards still do not have contactless functionality.) (PIN required for ≥ $100)—N/a• NETS Prepaid Card for SimplyGo (Account-based Online Debit) Online account-based ticketing wallet, for retail and public transport payments. It functions similarly to the NETS EFTPOS Debit card. As the card information is stored on a central server, the card balance can be topped up without presence of physical card. ✓ It is compatible with the SimplyGo system for remote management of public transport cards. ✗ Fare cost and card balance will not be displayed at the gantry. Commuters have to create an account and sign in to the SimplyGo website or app, to view their travel history and its related fares. ✗ It is not compatible with ERP and carpark payments. 2022Email address and phone number (international numbers are allowed) are required for registering an online account on the NETS mobile app. The prepaid card is non-transferrable, after it has been registered to a user's online account. NoYes (card may need to be inserted for transactions ≥ $100 on older terminals, but PIN is not required)Yes (No authentication required)Top-ups can currently only be done online with a NETS Bank Card (linked to a local bank account), or Visa/Mastercard/Amex cards (international cards are allowed) on the NETS mobile app. Top-ups are currently unavailable at self-help machines. ### Card payments – stored-valued cards Payment ModeDescriptionYear IntroducedRegistration Requirement[Magnetic Stripe](/wiki/Magnetic_Stripe)[Chip and PIN](/wiki/Chip_and_PIN)[Contactless payment](/wiki/Contactless_payment)Top Up Locations• NETS CashCard (1st generation) (Card-based Offline Debit) Card-based stored-value wallet, superseded by FlashPay/Contactless CashCard/Motoring Card. It is the only stored-valued card which is compatible with 1st gen in-vehicle units and old carpark gantries that have not been upgraded since the release of the CEPAS specification in 2009. 1995 (discontinued in 2022)No registration required. Card is transferrable. No (deprecated in 2014)Yes (No authentication required)NoTop-ups can be made with cash or NETS EFTPOS cards. - NETS Self Service Stations, Top Up Machines - Local bank ATMs (DBS/POSB, OCBC and UOB) - 7-Eleven stores* - Cheers* and FairPrice Xpress* (* a service fee is chargeable) • NETS **FlashPay** (also branded as: NETS **Motoring Card**) (Card-based Offline Debit) Card-based stored-value wallet, based on [CEPAS](/wiki/CEPAS) standard for retail (convenience stores, supermarkets, vending machines, fast food restaurants), public transport, and motoring payments. ✓ It can be used for retail and public transport payments, without remote management functionality. It was originally announced that public transport payments would be phased-out on 1 June 2024, but the decision has since been reversed. ✓ Commuters can see their fare cost and card balance at the gantry. ✓ It is compatible with dual mode in-vehicle units for ERP and carpark payments. 2009: NETS FlashPay 2018: NETS Contactless CashCard (2nd generation) 2021: NETS Motoring Card Sales of **NETS FlashPay cards** at TransitLink Ticket Offices were stopped on 15 March 2022, to encourage adoption of the SimplyGo account-based system. After LTA's decision on 22 January 2024 to extend the existing adult card-based ticketing system, NETS has announced that they will resume sales of NETS FlashPay cards at SimplyGo Ticket Offices and convenience stores. NETS FlashPay cards are also sold under an alternate branding, **NETS Motoring cards** (previously **Contactless CashCard**), at petrol stations and convenience stores. NoNoYes (No authentication required)Top-ups can be made with cash, NETS EFTPOS cards, Visa/Mastercard/JCB cards. - Add Value Machine Plus (AVM+), General Ticketing Machines (GTMs) - TransitLink Ticket Office - NETS Self Service Stations, Top Up Machines - Local bank ATMs (DBS/POSB, OCBC and UOB) - 7-Eleven stores* - Cheers* and FairPrice Xpress* - NETS FlashPay Reader App* (* a service fee is chargeable) ### App payments Payment ModeDescriptionYear IntroducedRegistration Requirement[Contactless payment](/wiki/Contactless_payment)[QR code payment](/wiki/QR_code_payment)Other Info• NETSPayStores digitised NETS EFTPOS Debit cards. Includes a prepaid wallet for peer-to-peer money transfers and [UnionPay](/wiki/UnionPay) support. 2017 The NETSPay app was discontinued on 31 October 2023. The card is tied to user's bank account.Yes (with an NFC-enabled phone at upgraded terminals, PIN required for ≥ $100)Yes (at upgraded terminals, PIN required for ≥ $100)Direct deduction from bank account for topping up UnionPay wallet. (discontinued on 1 Dec 2020)• NETS QRDirect debit from bank account or mobile wallet. 2017 (banking apps) 2025 (mobile wallets) iBanking account or mobile wallet accountNoYes Support for banking apps was introduced to: DBS PayLah, OCBC app, UOB TMRW. Support for mobile wallets was introduced to: ShopeePay, Singtel Dash. Overseas wallets include: Alipay+, BHIM app, Indonesian digital payment apps, Malaysian digital payment apps, Thai Bank apps, UnionPay app, WeChat Pay. Currently, ShopeePay and Singtel Dash only support static NETS QR codes on printed SGQR labels, not dynamically-generated NETS QR codes on POS terminals. ### Online payments Payment ModeDescriptionYear IntroducedRequired InformationStored Payment DetailsSupported PlatformsPayment Process• eNETSAn online payment gateway for online payments via bank account direct debit. It can be used at merchants such as Singapore government services, airlines bookings, bill payments at AXS online. 2001• iBanking login details • Hardware token or bank mobile app to authenticate each transaction No iBanking login & authentication required each time.**Mobile:** Web Browser **Desktop:** Web Browser While making payment on a merchant's app/website, the user will be redirected to the eNETS website. The user has to login with their iBanking login details and authenticate the transaction with a hardware token or mobile app by the bank.• NETSPayA digital wallet app that stores digitised NETS EFTPOS Debit cards. It can be used for both physical and online purchases, at merchants such as AXS Payment, Qoo10. 2017 The NETSPay app was discontinued on 31 October 2023. • ATM card number (last 4 digits) • NRIC number • SMS OTP verification (one-time setup) Up to 10 bank cards**Mobile:** Android, iOS app. Screen lock required on mobile device. **Desktop:** Web Browser (needs to be used with mobile device that has the NETSPay app and a camera) **Mobile:** While making payment on a merchant's app/website, the user will be automatically redirected to the NETSPay app. For purchases ≥ $100, PIN is required. **Desktop:** The user has to open the NETSPay app on a mobile device to scan the QR code shown on the website on the desktop computer. • NETS ClickAn in-app payment service for NETS EFTPOS Debit cards. It can be used on merchant apps such as CDG Zig, Singtel Prepaid hi!App, AXS Payment. 2019• ATM card number (last 4 digits) • NRIC number • SMS OTP verification (one-time setup) Only 1 bank card**Mobile:** Merchant apps with NETS Click integration on Android, iOS. **Desktop:** Unavailable **Mobile:** After adding a bank card, the user can make mobile payments on selected merchants' mobile apps with just a click. ## ATM switching services NETS provides local and regional ATM switching services for banks. NETS partnered with Malaysian Electronic Payment System (MEPS) in Malaysia to enable bilateral cross-border ATM withdrawal services, and UnionPay in China to enable its cardholders to make purchases and withdraw cash from ATMs in Singapore. India also made a deal in 2018 wherein Indian RuPay Cards have acceptance in Singapore and same for the Singaporean counterpart in India. ## Gallery - Payment Terminals - Payment Cards/Logos - [Monetary Authority of Singapore](/wiki/Monetary_Authority_of_Singapore)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:35:19.033039",
  "title": "NETS (company)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/NETS_(company)"
}