{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:37:20.436201"
  },
  "content": "Administrative organization of public housing buildings The **new towns of Singapore** are [planned communities](/wiki/Planned_community) located across [Singapore](/wiki/Singapore) that are designed to be self-contained. Designed to house up to 300,000 residents, these new towns contain areas zoned for housing, recreation and employment, and are composed of multiple neighbourhoods, each of which is further subdivided into multiple precincts. Amenities in these new towns are provided through a multi-tiered system, and based on [Housing and Development Board](/wiki/Housing_and_Development_Board) (HDB) guidelines. As of 2022, the country has 24 new towns. The first new town in Singapore was constructed in the 1950s by the [Singapore Improvement Trust](/wiki/Singapore_Improvement_Trust) (SIT), similar to British planning concepts and at low densities. Named after [Queen Elizabeth II](/wiki/Queen_Elizabeth_II), [Queenstown](/wiki/Queenstown,_Singapore) is Singapore's first new town with a town centre supporting seven neighbourhoods. Subsequently, after the HDB took over [public housing](/wiki/Public_housing) development in the 1960s, the densities of new towns were increased and more amenities were included, and the HDB's first new town, [Toa Payoh](/wiki/Toa_Payoh), contained industrial areas and a town centre with amenities. From the 1970s, new towns were built further from the city centre and were planned according to a new town model, containing neighbourhoods served by neighbourhood centres and a town centre for the entire town. This new town model was revised in the late 1970s as the New Town Structural Model, introducing the concept of precincts and a \"checkerboard model\" in which public housing was interspersed with non-residential developments. From the 1980s, new towns incorporated larger flats, more distinctive layouts and housing block design, to cater to more affluent residents and to make the towns more unique respectively, and shopping malls were developed in town centres from the 1990s. The development of [Punggol 21](/wiki/Punggol) saw the introduction of the Estate Model For New Town Planning, under which new towns comprised mixed-use developments connected together by a light rail system, and from the 2010s, new towns were planned with an increased focus on liveability and identity, through increased integration of technology and the use of the external environment to influence planning. In addition, design guides were introduced for each new town from 2018 in a bid to make new towns more distinctive. The development of new towns within Singapore were in tandem with the construction of public housing in the country – managed by the [Housing and Development Board](/wiki/Housing_and_Development_Board) (HDB) under a [99-year lease](/wiki/99-year_lease). The majority of the residential housing developments in Singapore are publicly governed and developed, and home to approximately 80% of the population. These flats which are located in these new towns are self contained with well-maintained [schools](/wiki/Schools), [supermarkets](/wiki/Supermarkets), [parks](/wiki/List_of_parks_in_Singapore), [shopping centres](/wiki/Shopping_centres), [healthcare services](/wiki/Healthcare_services) and [sports and recreational facilities](/wiki/Leisure_centre). Every new town consists of multiple [Mass Rapid Transit](/wiki/Singapore_MRT) stations (MRT) and [bus stops](/wiki/Bus_transport_in_Singapore) that link residents to other parts of the country. Some new towns are also complemented by smaller [Light Rail Transit](/wiki/Light_Rail_Transit_(Singapore)) stations (LRT). ## History New town development in Singapore began with the construction of the first new town, [Queenstown](/wiki/Queenstown,_Singapore), by the [Singapore Improvement Trust](/wiki/Singapore_Improvement_Trust) (SIT) in the 1950s. Planned along the lines of British planning concepts, the estate was initially built with a low population density. In addition, the 1958 Master Plan called for three self-sufficient new towns to be constructed outside the city centre. After the transfer of the SIT's housing responsibilities to the [Housing and Development Board](/wiki/Housing_and_Development_Board) (HDB) in the 1960s, the population densities of planned residential areas in new towns was increased to facilitate social interaction. For that reason, plans for Queenstown were amended to increase population densities, while additional amenities were provided. In 1965, the HDB started work on its first new town, [Toa Payoh](/wiki/Toa_Payoh). Located about 5–8 km (3.1–5.0 miles) from the city centre, the new town contained a town centre with amenities such as shops and public transport infrastructure, along with several industrial areas to provide jobs to its residents. Multiple new towns were envisioned in the Concept Plan of 1971, surrounding the water catchment area in Singapore's centre and linked together by an [expressway](/wiki/Controlled-access_highway) system and a rail network, and starting with [Ang Mo Kio](/wiki/Ang_Mo_Kio) in 1973, new towns built in the 1970s followed a prototype new town model. This model comprised self-sufficient neighbourhoods served by neighbourhood centres, subcentres and schools, and a town centre for all the neighbourhoods in the new town. Further away from the [Central Area](/wiki/Central_Area,_Singapore), these new towns also included additional amenities such as sports facilities and green spaces, had little variation in terms of layout and housing block design, and distinguished between different neighbourhoods using numbering systems for roads and blocks, and through different paint schemes. A revised new town model, termed the New Town Structural Model, was subsequently introduced in the late 1970s. This model changed the basic planning unit of new towns from the neighbourhood to the precinct, which consisted of several housing blocks and a precinct centre, in a bid to improve community cohesion. In addition, the model introduced a \"checkerboard model\", under which public housing developments were interspersed by non-residential areas and amenities. New town planning was further revised in the 1980s through the incorporation of larger flats to cater to the increased space demands of more affluent residents, and by increasing the variation of housing block designs and the layouts of the new towns in an attempt to give the new towns a unique character. Upgrading and redevelopment schemes were initiated in older new towns to make sure that the facilities of these areas met contemporary planning guidelines, while the upkeep and improvement of the new towns, previously under the purview of the HDB, was handled by [town councils](/wiki/Town_Council_(Singapore)) led by elected officials from 1987. The 1990s saw the development of [shopping centres](/wiki/Shopping_center) in new towns across Singapore. Developed by private enterprises within the town centres of the new towns, these shopping centres offered a variety of retail shops and amenities, such as cinemas and department stores. In addition, the Estate Model For New Town Planning, a revised new town model, was introduced concurrent with the development of [Punggol 21](/wiki/Punggol). Under this model, public housing and amenities like retail and education were consolidated into densely built developments linked by a light rail system. These developments also incorporated a shared open space called the “common green”, and were intended to foster an increased sense of community among residents. New town planning from the 2010s had an increased focus on liveability and identity, with more green spaces and recreation facilities within the new towns, and used the existing environment around the new town to influence its design and layout. New technologies were also increasingly used through the extensive installation of monitoring systems and the use of computer models in the planning process. Moreover, the HDB made attempts to make new towns more distinctive through the introduction of design guides specific to each new town from 2018. These guides laid out specific themes for the new towns, and their respective subdivisions, for future developments to follow. ## Layout Intended to function as independent communities, new towns in Singapore are based upon the provision of land for multiple uses, such as housing, recreation and employment. Generally planned to house up to 300,000 residents, they comprise multiple neighbourhoods, each with around 20,000 to 30,000 residents. Each neighbourhood is in turn divided into multiple precincts, which consist of 1,500 residents in 400 to 800 flats within several blocks. Amenities are provided at multiple levels, and according to guidelines set by the HDB. For the provision of retail, the lowest level of provision consisted of establishments at the ground floor of housing blocks, followed by neighbourhood centres, which had a wider variety of services and markets. Town centres occupied the highest level of retail provision, containing public transport facilities such as bus interchanges and larger shops like [supermarkets](/wiki/Supermarkets) and [department stores](/wiki/Department_stores). Similarly, parks in new towns comprise town parks serving the entire town and neighbourhood parks for individual neighbourhoods. ## Towns and estates As of 2022, there are 24 towns and 3 estates across Singapore. These statistics reflect the boundaries of HDB towns and are not necessarily the same as [planning area statistics](/wiki/Planning_Areas_of_Singapore#List_of_Planning_Areas). ### Towns Name ([English](/wiki/English_language)/[Malay](/wiki/Malay_language))[Chinese](/wiki/Chinese_characters)[Pinyin](/wiki/Pinyin)[Tamil](/wiki/Tamil_language)Total area (km2)Residential area (km2)Dwelling unitsProjected ultimatePopulation[Ang Mo Kio](/wiki/Ang_Mo_Kio)宏茂桥Hóngmàoqiáoஆங் மோ கியோ6.382.8350,72658,000138,200[Bedok](/wiki/Bedok)勿洛Wùluòபிடோ9.374.1862,81679,000187,900[Bishan](/wiki/Bishan,_Singapore)碧山Bìshānபீஷான்6.901.7220,07234,00061,100[Bukit Batok](/wiki/Bukit_Batok)武吉巴督Wǔjíbādūபுக்கிட் பாத்தோக்7.852.9144,28554,000121,400[Bukit Merah](/wiki/Bukit_Merah)红山Hóngshānபுக்கிட் மேரா8.583.1254,22768,000141,400[Bukit Panjang](/wiki/Bukit_Panjang)武吉班让Wǔjíbānràngபுக்கிட் பாஞ்சாங்4.892.1935,32544,000118,900[Choa Chu Kang](/wiki/Choa_Chu_Kang)蔡厝港Càicuògǎngசுவா சூ காங்5.833.0748,90062,000167,200[Clementi](/wiki/Clementi,_Singapore)金文泰Jīnwéntàiகிளிமெண்டி4.122.0326,73039,00069,500[Geylang](/wiki/Geylang)芽笼Yálóngகேலாங்6.782.1430,89250,00086,000[Hougang](/wiki/Hougang)后港Hòugǎngஹவ்காங்13.093.6757,27272,000179,700[Jurong East](/wiki/Jurong_East)裕廊东Yùlángdōngஜூரோங்3.841.6524,12231,00075,400[Jurong West](/wiki/Jurong_West)裕廊西Yùlángxīஜூரோங்9.874.8075,20894,000253,800[Kallang](/wiki/Kallang)/[Whampoa](/wiki/Whampoa,_Singapore)加冷/黃埔Jiālĕng/Huángpǔகாலாங்7.992.1039,93157,000105,200[Pasir Ris](/wiki/Pasir_Ris)巴西立Bāxīlìபாசிர் ரிஸ்6.013.1829,65444,000106,600[Punggol](/wiki/Punggol)榜鹅Bǎng'éபொங்கோல்9.573.7450,66396,000146,900[Queenstown](/wiki/Queenstown,_Singapore)女皇镇Nǚhuángzhènகுவீன்ஸ்டவுன்6.942.1033,16460,00081,200[Sembawang](/wiki/Sembawang)三巴旺Sānbāwàngசெம்பவாங்7.083.3130,02065,00081,500[Sengkang](/wiki/Sengkang)盛港Shènggǎngசெங்காங்10.553.9769,19696,000217,700[Serangoon](/wiki/Serangoon)实龙岗Shílónggāngசிராங்கூன்7.371.6321,63230,00066,800[Tampines](/wiki/Tampines)淡滨尼Dànbīnníதெம்பினிஸ்12.005.4972,683110,000232,700[Tengah](/wiki/Tengah,_Singapore)登加Dēngjiāதெங்கா7.0–––10[Toa Payoh](/wiki/Toa_Payoh)大巴窑Dàbāyáoதோ பாயோ5.562.4839,73761,000103,800[Woodlands](/wiki/Woodlands,_Singapore)兀兰Wùlánஊட்லண்ட்ஸ்11.984.8069,900102,000243,300[Yishun](/wiki/Yishun)义顺Yìshùnயீஷூன்7.783.9865,15884,000198,500 ### Estates Name ([English](/wiki/English_language)/[Malay](/wiki/Malay_language))[Mandarin](/wiki/Standard_Chinese)[Pinyin](/wiki/Pinyin)[Tamil](/wiki/Tamil_language)Total area (km2)Dwelling unitsPopulation[Bukit Timah](/wiki/Bukit_Timah)武吉知马Wūjízhīmǎபுக்கித் திமா17.532,4238,100[Marine Parade](/wiki/Marine_Parade)马林百列Mǎlínbǎilièமரின் பரேட்6.126,53720,800[Central Area](/wiki/Central_Area,_Singapore)新加坡中区Xīnjiāpōzhōngqūசிங்கப்பூர் மாவட்டம்17.8412,57127,200 - Singapore portal - Architecture portal - [Cash-Over-Valuation](/wiki/Cash-Over-Valuation) - [Housing and Development Board](/wiki/Housing_and_Development_Board) - [Public housing in Singapore](/wiki/Public_housing_in_Singapore) ### Bibliography - Hee, Limin; Ooi, Giok Lin (January 2003). \"The Politics of Public Space Planning in Singapore\". *[Planning Perspectives](/wiki/Planning_Perspectives)*. **18** (1): 79–103. [Bibcode](/wiki/Bibcode_(identifier)):2003PlPer..18...79H. [doi](/wiki/Doi_(identifier)):10.1080/0266543032000047413. [S2CID](/wiki/S2CID_(identifier)) 145342576. - Jensen, Rolf (July 1967). \"Planning, Urban Renewal, and Housing in Singapore\". *The Town Planning Review*. **38** (2): 115–131. [doi](/wiki/Doi_(identifier)):10.3828/tpr.38.2.eg304r3377568262. [JSTOR](/wiki/JSTOR_(identifier)) 40102546.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:37:20.435897",
  "title": "New towns of Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/New_towns_of_Singapore"
}