{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:37:17.792158"
  },
  "content": "First day of the year in the Gregorian calendar In the [Gregorian calendar](/wiki/Gregorian_calendar), **New Year's Day** is the first day of the [calendar year](/wiki/Calendar_year), [1 January](/wiki/January_1). Most [solar calendars](/wiki/Solar_calendar), such as the Gregorian and Julian calendars, begin the year regularly at or near the [northern winter solstice](/wiki/December_solstice). In contrast, cultures and religions that observe a [lunisolar](/wiki/Lunisolar) or [lunar calendar](/wiki/Lunar_calendar) celebrate their [Lunar New Year](/wiki/Lunar_New_Year) at varying points relative to the [solar year](/wiki/Solar_year). In pre-Christian Rome, under the [Julian calendar](/wiki/Julian_calendar), the day was dedicated to [Janus](/wiki/Janus), god of gateways and beginnings, for whom January is also named. From Roman times until the mid-18th century, the new year was celebrated at various stages and in various parts of [Christian Europe](/wiki/Christian_Europe) on 25 December, on 1 March, on 25 March and on the [movable feast of Easter](/wiki/Date_of_Easter). In the present day, with most countries now using the Gregorian calendar as their [civil calendar](/wiki/Civil_calendar), 1 January according to Gregorian calendar is among the most celebrated of public holidays in the world, often observed with fireworks at the stroke of midnight following New Year's Eve as the new year starts in each time zone. Other global New Year's Day traditions include making [New Year's resolutions](/wiki/New_Year%27s_resolution) and calling one's friends and family. ## History The ancient [Babylonian calendar](/wiki/Babylonian_calendar) was lunisolar, and around the year 2000 BC began observing a spring festival and the new year during the month of [Nisan](/wiki/Nisan), around the time of the [March equinox](/wiki/March_equinox). The early Roman calendar designated 1 March as the first day of the year. The calendar had just 10 months, beginning with March. That the new year once began with the month of March is still reflected in some of the names of the months. September through to December, the ninth through to the twelfth months of the [Gregorian calendar](/wiki/Gregorian_calendar), were originally positioned as the seventh through to the tenth months. (*Septem* is [Latin](/wiki/Latin) for \"seven\"; *octo*, \"eight\"; *novem*, \"nine\"; and *decem*, \"ten\") [Roman mythology](/wiki/Roman_mythology) usually credits their second [king](/wiki/Roman_Kingdom) [Numa](/wiki/Numa_Pompilius) with the establishment of the two new months of [Ianuarius](/wiki/Ianuarius) and [Februarius](/wiki/Februarius). These were first placed at the end of the year, but at some point came to be considered the first two months instead. The January [kalend](/wiki/Calends) (Latin: *Kalendae* Ianuariae), the start of the month of January, came to be celebrated as the new year at some point after it became the day for the inaugurating new [consuls](/wiki/Roman_consul) in 153 BC as a result of the rebellion in [Hispania](/wiki/Hispania) which began the [second Celtiberian War](/wiki/Second_Celtiberian_War). Romans had long dated their years by [these consulships](/wiki/List_of_Roman_consuls), rather than sequentially, and making the kalends of January start the new year aligned this dating. Still, private and religious celebrations around the March new year continued for some time and there is no consensus on the question of the timing for 1 January's new status. Once it became the new year, however, it became a time for family gatherings and celebrations. A series of disasters, notably including the [failed rebellion](/wiki/Marcus_Aemilius_Lepidus_(consul_78_BC)#Rebellion) of [M. Aemilius Lepidus](/wiki/Marcus_Aemilius_Lepidus_(consul_78_BC)) in 78 BC, established a superstition against allowing Rome's [market days](/wiki/Nundinae) to fall on the [kalends](/wiki/Calends) of January and the [pontiffs](/wiki/Pontifex_maximus) employed [intercalation](/wiki/Intercalation_(timekeeping)) to avoid its occurrence. ### New Year's Day in the older Julian calendar The Julian calendar, proposed by [Julius Caesar](/wiki/Julius_Caesar) in 46 BC, was a reform of the [Roman calendar](/wiki/Roman_calendar). It took effect on 1 January 45 BC, by edict. The calendar became the predominant calendar in the [Roman Empire](/wiki/Roman_Empire) and subsequently, most of the Western world for more than 1,600 years. The Roman calendar began the year on 1 January, and this remained the start of the year after the Julian reform. However, even after local calendars were aligned to the Julian calendar, they started the new year on different dates. The Alexandrian calendar in Egypt started on 29 August (30 August after an Alexandrian leap year). Several local provincial calendars were aligned to start on the birthday of the Emperor [Augustus](/wiki/Augustus), 23 September. The [indiction](/wiki/Indiction) caused the [Byzantine](/wiki/Byzantine_Empire) year, which used the Julian calendar, to begin on 1 September; this date is still used in the [Eastern Orthodox Church](/wiki/Eastern_Orthodox_Church) for the beginning of the liturgical year. At various times and in various places throughout mediaeval [Christian Europe](/wiki/Christian_Europe), the new year was celebrated on 25 December in honour of the birth of Jesus; 1 March in the [old Roman style](/wiki/Roman_calendar); 25 March in honour of [Lady Day](/wiki/Lady_Day) (the [Feast of the Annunciation](/wiki/Feast_of_the_Annunciation), the date of the [conception](/wiki/Fertilisation) of Jesus); and on the [movable feast of Easter](/wiki/Date_of_Easter). #### Christian observance Christians of various denominations (Catholics, Lutherans, Anglicans, and Moravians, among others) often attend a [watchnight service](/wiki/Watchnight_service) (also known as a Watchnight Mass if Holy Communion is celebrated) on the night of New Year's Eve and this liturgy concludes in the morning of New Year's Day. Watchnight services provide the opportunity for Christians to review the year that has passed and [make confession](/wiki/Repentance_(theology)), and then prepare for the year ahead by [praying](/wiki/Christian_prayer) and [resolving](/wiki/New_Year%27s_resolution). The [services](/wiki/Church_service) often include singing, praying, exhorting, preaching, and [Holy Communion](/wiki/Holy_Communion). As a date in the Christian calendar, New Year's Day liturgically marked the [Feast of the Naming and Circumcision of Jesus](/wiki/Feast_of_the_Circumcision_of_Christ), which is still observed as such in the [Lutheran Church](/wiki/Lutheran_Church), [Anglican Church](/wiki/Anglican_Communion), the [Ambrosian](/wiki/Ambrosian_Rite) section of the Catholicism, the [Eastern Orthodox Church](/wiki/Eastern_Orthodox_Church) (Julian calendar, see below) and in [Traditional Catholicism](/wiki/Traditional_Catholics) by those who retain the usage of the [General Roman Calendar of 1960](/wiki/General_Roman_Calendar_of_1960). The mainstream Roman Catholic Church celebrates on this day the [Solemnity of Mary, Mother of God](/wiki/Solemnity_of_Mary,_Mother_of_God). In [Western Christianity](/wiki/Western_Christianity), the Feast of the Naming and Circumcision of Jesus Christ marks the [eighth day](/wiki/Twelve_Days_of_Christmas) (octave day) of [Christmastide](/wiki/Christmastide). In an article in *[Polityka](/wiki/Polityka)*, a Polish weekly periodical, [Aleksander Krawczuk](/wiki/Aleksander_Krawczuk), a professor of history and former [Minister of Culture of Poland](/wiki/Ministry_of_Culture_and_National_Heritage_(Poland)), wrote that ancient Christians in [ancient Rome](/wiki/Ancient_Rome) considered the custom of celebrating the new year to be \"scandalous and thoroughly pagan, alien in form and spirit to the worshipers of enlightened religion\". #### Gift giving Among the 7th-century [pagans](/wiki/Pagan) of [Flanders](/wiki/Flanders) and the [Netherlands](/wiki/Kingdom_of_the_Netherlands), it was the custom to exchange gifts at the [winter solstice](/wiki/Winter_solstice). This custom was deplored by [Saint Eligius](/wiki/Saint_Eligius) (died 659 or 660), who warned the Flemish and Dutch: \"(Do not) make visuals, [little figures of the Old Woman], little deer or iotticos or set tables [for the house-elf, compare [Puck](/wiki/Puck_(folklore))] at night or exchange New Year gifts or supply superfluous drinks [another [Yule](/wiki/Yule) custom].\" On the date that Christians celebrated the Feast of the Circumcision of Christ (January 1), they exchanged Christmas presents because the feast fell within the 12 days of the [Christmas season](/wiki/Christmastide) in the [Western Christian](/wiki/Western_Christianity) liturgical [calendar](/wiki/Calendar); the custom of exchanging Christmas gifts in a Christian context is traced back to the [Biblical Magi](/wiki/Biblical_Magi) who gave gifts to the [Christ Child](/wiki/Christ_Child). In [Tudor England](/wiki/Tudor_England), 1 January (as the Feast of the Circumcision, not New Year's Day), along with Christmas Day and [Twelfth Night](/wiki/Twelfth_Night_(holiday)), was celebrated as one of three main festivities among the [twelve days](/wiki/Twelve_Days_of_Christmas) of [Christmastide](/wiki/Christmastide), and [gift-giving was customary at the royal court](/wiki/New_Year%27s_Day_gift_(royal_courts)). ### Acceptance of 1 January as New Year's Day Most nations of Europe and their colonies officially adopted 1 January as New Year's Day somewhat before they [adopted the Gregorian calendar](/wiki/Adoption_of_the_Gregorian_calendar). Most of Germany changed to 1 January from 1544, the Netherlands did so from 1556 or 1573 according to sect, Spain and Portugal from 1556, France from 1564, Italy ([pre-unification](/wiki/Unification_of_Italy)) on a variety of dates, Sweden, Norway and Denmark from 1599, Scotland from 1600, and Russia from 1700 or 1725. England, Wales, Ireland, and Britain's American colonies adopted 1 January as New Year's Day from 1752. #### Great Britain and the British Empire Until Tuesday, 31 December 1751[a] (except Scotland),[b] the [Kingdom of Great Britain](/wiki/Kingdom_of_Great_Britain) and the [British Empire at the time](/wiki/British_Empire#\"First\"_British_Empire_(1707–1783)) had retained 25 March as the official start of the year, although informal use of 1 January had become common.[c] With the [Calendar (New Style) Act 1750](/wiki/Calendar_(New_Style)_Act_1750), Britain and the Empire formally adopted 1 January as New Year's Day in 1752 and, with the same Act, also discarded the Julian calendar at the end of Wednesday, 2 September of that same year (though the actions are otherwise unrelated). The Act came into effect \"following the last said day of December 1751\".[d] By 1750, adjustments needed to be made for an eleven-day difference between the older Julian calendar and the newer (and more accurate) Gregorian calendar. There was some [religious dissent](/wiki/Calendar_(New_Style)_Act_1750#Religious_dissent) regarding feast days being moved, especially Christmas Day (see [Old Christmas](/wiki/Old_Christmas)), and isolated communities continued the old reckoning to a greater or lesser extent. The years (/wiki/1800) and (/wiki/1900) were [leap years](/wiki/Leap_year) in the Julian calendar but not in the Gregorian, so the difference increased to twelve days, then thirteen. The year (/wiki/2000) was a leap year in both calendars. - In the [Gwaun Valley](/wiki/Gwaun_Valley) in Wales, [the new year is celebrated on 13 January](/wiki/Gwaun_Valley#New_Year_celebrations), still based on the 19th century difference in the calendars. - [Foula](/wiki/Foula), in the [Shetland](/wiki/Shetland) islands celebrates [Yule](/wiki/Yule) ('Old Christmas' rather than the [December solstice](/wiki/December_solstice)) on 6 January and Newerday on 13 January. Again, both dates reflect the 19th century reckoning and were not moved again in 1900. ### Eastern Orthodoxy At various stages during the first half of the twentieth century, all countries in [Eastern Christendom](/wiki/Eastern_Christendom) adopted the Gregorian calendar as their [civil calendar](/wiki/Civil_calendar) but continued, and have continued into modern times, to use the Julian Calendar for ecclesiastical purposes. As 1 January (Julian) equates to 14 January (Gregorian), a religious celebration of the New Year on this date may seem strange to Western eyes. ## New Year's Day in other calendars In cultures and religions that traditionally or currently use calendars other than the Gregorian, New Year's Day is often also an important celebration. Some countries concurrently use Gregorian and another calendar. New Year's Day in the alternative calendar attracts alternative celebrations of that new year: ### African - [Nayrouz](/wiki/Nayrouz) and [Enkutatash](/wiki/Enkutatash) are the New Year's Days of the [Coptic calendar](/wiki/Coptic_calendar) and the [Ethiopian calendar](/wiki/Ethiopian_calendar), respectively. Both occur on 29 August (Julian) or about 11 September (Gregorian). They preserve the legacy of the ancient Egyptian new year *Wept Renpet*, which originally marked the onset of the [Nile](/wiki/Nile) [flood](/wiki/Flooding_of_the_Nile) but which [wandered through the seasons](/wiki/Sothic_cycle) until the introduction of leap years to the [Egyptian calendar](/wiki/Egyptian_calendar) by [Augustus](/wiki/Augustus) in 30–20 BC. In Ethiopia, the new year is held to mark the end of the summer [rainy season](/wiki/Rainy_season). - The [Odunde Festival](/wiki/Odunde_Festival), also called the **African New Year**, is celebrated in [Philadelphia](/wiki/Philadelphia), Pennsylvania in the United States on the second Sunday of June. While the name was based on the [Yoruba](/wiki/Yoruba_language) African culture, its celebration marks the largest African celebration in the world, which more or less was started by a local tradition. - The [Sotho people](/wiki/Sotho_people) of Lesotho and South Africa celebrate **Selemo sa Basotho** on 1 August during the end of the Southern Hemisphere's winter. This is based on the [Sotho calendar](/wiki/Sotho_calendar), and includes observances such as \"Mokete wa lewa\", a celebration that follows the harvest. ### East Asian - [Chinese New Year](/wiki/Chinese_New_Year) is celebrated in some countries in East Asia, including China, and some in Southeast Asia, including Singapore. It is the first day of the traditional [Chinese calendar](/wiki/Chinese_calendar), a lunar calendar that is corrected for the solar changes every three years (i.e. a [lunisolar calendar](/wiki/Lunisolar_calendar)). The holiday normally falls between 20 January and 20 February. The holiday is celebrated with food, family, lucky money (usually in a [red envelope](/wiki/Red_envelope)), and many other red items that are believed to bring good luck. Lion and dragon dances, drums, fireworks, firecrackers, and other types of entertainment fill the streets on this day. In China, 1 January is also a legal holiday, and people celebrate the Gregorian New Year, but it is not as grand as the traditional Chinese New Year. - [Japanese New Year](/wiki/Japanese_New_Year) is celebrated on 1 January in accordance with the Gregorian calendar instead of with the [Chinese calendar](/wiki/Chinese_calendar) (which was in use until 1873). - [Korean New Year](/wiki/Korean_New_Year) is celebrated on the first day of the traditional [Korean calendar](/wiki/Korean_calendar) in South Korea. The first day of this lunisolar calendar, called *Seollal* (설날), is an important national holiday (along with *Chuseok*), with a minimum of three days off work and school. Koreans celebrate New Year's Day by preparing food for their ancestors' spirits, visiting ancestors' graves, and playing Korean games such as *[yunnori](/wiki/Yunnori)* with families and friends. Young children show respect to their parents, grandparents, relatives, and other elders by bowing down in a traditional way and are given good wishes and money by elders. - In addition, South Koreans celebrate the 1 January New Year's Day of the Gregorian Calendar, and as a national holiday, people have the day off. The Gregorian calendar is now the official civil calendar in South Korea, so the populace now considers the 1 January New Year's Day to be the first day of the year. South Koreans calculate their age using the [East Asian age reckoning](/wiki/East_Asian_age_reckoning) method, with all South Koreans adding a year to their age at midnight of the New Year (of the Gregorian, not the Korean calendar). Families enjoy the New Year by counting down to midnight on New Year's Eve on 31 December. - North Koreans celebrate the New Year's Day holiday on the first day of the Gregorian calendar, 1 January. This New Year's Day, also called *Seollal*, is a large holiday in North Korea, while they take a day off on the first day of the Korean calendar.[*clarification needed*] The first day of the Korean calendar is regarded as a day for relaxation, but North Koreans consider the first day of the Gregorian calendar to be more important.[*citation needed*] ### Southeast Asian - [Cambodian New Year](/wiki/Cambodian_New_Year) (Chaul Chnam Thmey) is celebrated on 13 April or 14 April. There are three days for the Khmer New Year: the first day is called \"Moha Songkran\", the second is called \"Virak Wanabat\" and the final day is called \"Virak Loeurng Sak\". During these periods, Cambodians often go to the pagoda or play traditional games. Phnom Penh is usually quiet during Khmer New Year as most Cambodians prefer spending it at their respective hometowns. - [Thai](/wiki/Thai_people) New Year is celebrated on 13 April or 14 April and is called [Songkran](/wiki/Songkran) in the local language. People usually come out to splash water on one another. The throwing of water originated as a blessing. By capturing the water after it had been poured over the Buddhas for cleansing, this \"blessed\" water is gently poured on the shoulder of elders and family for good fortune. - [Thingyan](/wiki/Thingyan), Burmese new year's celebrations, typically begin on 13 April but the actual New Year's Day falls on 17 April in the 21st century. The day has slowly drifted over the centuries. In the 20th century, the day fell on 15 or 16 April while in the 17th century, it fell on 9 or 10 April. - [Vietnamese New Year](/wiki/T%E1%BA%BFt) (Tết Nguyên Đán or Tết), more commonly known by its shortened name Tết or \"Vietnamese Lunar New Year\", is the most important and popular holiday and festival in Vietnam, the holiday normally falls between 20 January and 20 February. It is the Vietnamese New Year marking the arrival of spring based on the Chinese calendar, a lunisolar calendar. The name Tết Nguyên Đán is Sino-Vietnamese for Feast of the First Morning, derived from the Hán nôm characters 節 元 旦. ### South Asian - [Diwali](/wiki/Diwali#New_Year_celebrations) related New Year's celebrations include Marwari new year and Gujarati new year. - [Indian New Year's days](/wiki/Indian_New_Year%27s_days) have several variations depending on the region and are based on the [Hindu calendar](/wiki/Hindu_calendar). - In [Hinduism](/wiki/Hinduism), different regional cultures celebrate the new year at different times of the year. In [Assam](/wiki/Assam), [Bengal](/wiki/Bengal), Kerala, Nepal, [Odisha](/wiki/Odisha), [Punjab](/wiki/Punjab,_India), [Telangana](/wiki/Telangana), Andhra Pradesh, and [Tamil Nadu](/wiki/Tamil_Nadu) households celebrate the new year when the Sun enters [Aries](/wiki/Aries_(astrology)) on the [Hindu calendar](/wiki/Hindu_calendar). This is normally on 14 April or 15 April, depending on the leap year. Elsewhere in northern/central India, the [Vikram Samvat](/wiki/Vikram_Samvat) calendar is followed. According to that, the new year day is the first day of the Chaitra Month, also known as Chaitra Shukla Pratipada or [Gudi Padwa](/wiki/Gudi_Padwa). This is the first month of the Hindu calendar, the first Shukla paksha (fortnight) and the first day. This normally comes around 23–24 March, mostly around the Spring Equinox in Gregorian Calendar. The new year is celebrated by paying respect to elders in the family and seeking their blessings. Celebrants also exchange tokens of good wishes for a healthy and prosperous year ahead. - [Malayalam](/wiki/Malayalam) New Year (Puthuvarsham) is celebrated either on the first day of the month of Medam in mid-April which is known as Vishu, or the first day of the month of [Chingam](/wiki/Chingam), in the [Malayalam Calendar](/wiki/Malayalam_Calendar) in mid-August according to another reckoning. Unlike most other calendar systems in India, the New Year's Day on the [Malayalam Calendar](/wiki/Malayalam_Calendar) is not based on any astronomical event. It is just the first day of the first of the 12 months on the [Malayalam Calendar](/wiki/Malayalam_Calendar). The [Malayalam Calendar](/wiki/Malayalam_Calendar) (called Kollavarsham) originated in 825 AD, based on general agreement among scholars, with the re-opening of the city of [Kollam](/wiki/Kollam) (on [Malabar Coast](/wiki/Malabar_Coast)), which had been destroyed by a [natural disaster](/wiki/Natural_disaster). - [Nepal Sambat](/wiki/Nepal_Sambat) is the Nepalese New Year celebration specially by the [Newar](/wiki/Newar) community. Nepali ethnic groups like [Gurung](/wiki/Gurung), [Sherpa](/wiki/Sherpa_people) and [Tamang](/wiki/Tamang_people) celebrate [Lhosar](/wiki/Lhosar). While officially [Baisakh ek gatey](/wiki/Pohela_Baisakh) is celebrated. However, there is increased demand from Nepalese of all ethnicity to replace [Vikram Sambat](/wiki/Pohela_Baisakh) with [Nepal Sambat](/wiki/Nepal_Sambat) as [Nepal Sambat](/wiki/Nepal_Sambat) is [indigenous](/wiki/Indigenous_peoples) to Nepal while [Vikram Sambat](/wiki/Vikramaditya) came from India. - [Pahela Baishakh](/wiki/Pahela_Baishakh) or Bangla Nabobarsho is the first day of the Bengali Calendar. It is celebrated on 14 April as a national holiday in Bangladesh, and on 14 or 15 April in the Indian states of West Bengal, Tripura, and part of Assam by people of Bengali heritage, irrespective of their religious faith. - The Sikh New Year is celebrated as per the [Nanakshahi calendar](/wiki/Nanakshahi_calendar). The epoch of this calendar is the birth of the first [Sikh Guru](/wiki/The_Sikh_Gurus), [Guru Nanak](/wiki/Guru_Nanak) in 1469. New Year's Day falls annually on what is 14 March in the Gregorian Western calendar. - [Sinhalese New Year](/wiki/Sinhalese_New_Year) is celebrated in Sri Lankan culture predominantly by the Sri Lankan Sinhalese, while the [Tamil](/wiki/Tamil_people) New Year on the same day is celebrated by Sri Lankan Tamils. The Sinhalese New Year (*aluth avurudda*), marks the end of the harvest season, by the month of Bak (April) between 13 and 14 April. There is an astrologically generated time gap between the passing year and the New Year, which is based on the passing of the sun from the Meena Rashiya (House of Pisces) to the Mesha Rashiya (House of Aries) in the celestial sphere. The astrological time difference between the New Year and the passing year (*nonagathe*) is celebrated with several Buddhist rituals and customs that are to be concentrated on, which are exclusive of all types of 'work'. After Buddhist rituals and traditions are attended to, Sinhala and Tamil New Year-based social gatherings and festive parties with the aid of firecrackers, and fireworks would be organized. The exchange of gifts, cleanliness, the lighting of the oil lamp, making *kiribath* (milk rice), and even the Asian Koel are significant aspects of the Sinhalese New Year. - [Tamil](/wiki/Tamil_people) New Year ([Puthandu](/wiki/Puthandu)) is celebrated on 13 April or 14 April. Traditionally, it is celebrated as Chiththirai Thirunaal in parts of Tamil Nadu to mark the event of the Sun entering Aries. [Panchangam](/wiki/Panchangam) ([almanac](/wiki/Almanac)), is read in temples to mark the start of the Year. - [Telugu](/wiki/Telugu_people) New Year ([Ugadi](/wiki/Ugadi)), [Kannada](/wiki/Kannada) New Year ([Yugadi](/wiki/Yugadi)) is celebrated in March (generally), April (occasionally). Traditionally, it is celebrated as Chaitram Chaitra Shuddha Padyami in parts of Andhra Pradesh, Telangana, and Karnataka to mark the event of New Year's Day for the people of the Deccan region of India. It falls on a different day every year because the Hindu calendar is a lunisolar calendar. The Saka calendar begins with the month of Chaitra (March–April) and Ugadi/Yugadi marks the first day of the new year. Chaitra is the first month in Panchanga which is the Indian calendar. [Panchangam](/wiki/Panchangam) ([almanac](/wiki/Almanac)), is read in temples to mark the start of the Year. ### Middle Eastern The major religions of the Middle East are [Islam](/wiki/Islam) and Judaism: their adherents worldwide celebrate the first day of their respective new religious calendar years. #### Islam The two primary sects of Islam are [Sunni Islam](/wiki/Sunni_Islam) and [Shia Islam](/wiki/Shia_Islam). They have different calendars though for both the epoch of the calendar is the [Hijrah](/wiki/Hijrah). - [Islamic New Year](/wiki/Islamic_New_Year) (or \"Hijri New Year\", [Arabic](/wiki/Arabic_language): رأس السنة الهجرية *Ras as-Sanah al-Hijriyah*)) is the day in Sunni Islamic culture that marks the beginning of a new year in the [Lunar Hijri calendar](/wiki/Islamic_calendar). It disregards the [solar year](/wiki/Solar_year): its New Year's Day is on a different Gregorian date each year because it is a [lunar calendar](/wiki/Lunar_calendar) of twelve [lunar months](/wiki/Lunar_month), making it on average 11 to 12 days shorter than a solar year. The first day of the year is observed on the first day of [Muharram](/wiki/Muharram), the first month in this calendar. - [Nowruz](/wiki/Nowruz) marks the first day of spring and the beginning of the year in the [Solar Hijri calendar](/wiki/Solar_Hijri_calendar) (one of the [Iranian calendars](/wiki/Iranian_calendars)). It is celebrated on the day of the astronomical [Northern spring equinox](/wiki/March_equinox), which usually occurs on or about 20 March (Gregorian calendar). Nowruz has been celebrated for over 3,000 years by the [cultural continent of Iran](/wiki/Greater_Iran), including [Kurdistan](/wiki/Kurdistan) and Afghanistan. The holiday is also celebrated and observed by many parts of Central Asia, South Asia, Northwestern China, [Crimea](/wiki/Crimea) and some groups in the [Balkans](/wiki/Balkans). As well as being a [Zoroastrian](/wiki/Zoroastrian) holiday and having significance amongst the Zoroastrian ancestors of modern Iranians, the same time is celebrated in the Indian sub-continent as the new year. The moment the Sun crosses the [celestial equator](/wiki/Celestial_equator) and equalizes night and day is calculated exactly every year and [Iranian](/wiki/Iranian_peoples) families gather together to observe the rituals. #### Judaism - [Rosh Hashanah](/wiki/Rosh_Hashanah) (the Jewish New Year), is celebrated by Jews in Israel and throughout the world. The date is the new moon of [Tishrei](/wiki/Tishrei), which is the seventh month counting from [Nisan](/wiki/Nisan), the first month of Spring. It always falls during September or October. The holiday is celebrated by blasting of [shofar](/wiki/Shofar) trumpets, to signify it as a day of judgment, by [prayers of penitence](/wiki/Selichot), by readings from the law and prophets, and by special meals. The night of 31 December/1 January, the New Year according to the Gregorian calendar, is also celebrated widely in Israel and is referred to as [Sylvester](/wiki/New_Year%27s_Eve#Israel) or the civil new year. ### Martian According to a convention established by [NASA](/wiki/NASA), the Martian year begins on its [Northward equinox](/wiki/Northward_equinox), the spring equinox of its northern hemisphere. Its most recent New Year's Day (of [MY](/wiki/Mars_year) 37) coincided with 26 December 2022 on Earth's Gregorian calendar. New Year's Day of MY 38 coincided with 12 November 2024. ## Traditional and modern celebrations and customs ### New Year's Eve In the [Gregorian calendar](/wiki/Gregorian_calendar), New Year's Eve, also known as Old Year's Day, refers to the evening or the entire day of the last day of the year, 31 December. In many countries, New Year's Eve is celebrated with dancing, eating, drinking, and watching or lighting fireworks. Some Christians attend a [watchnight service](/wiki/Watchnight_service) to mark the occasion. The celebrations generally go on past midnight into New Year's Day, 1 January. The first places to welcome the New Year are the [Line Islands](/wiki/Line_Islands) (part of Kiribati), Samoa and Tonga, in the Pacific Ocean. In contrast, [American Samoa](/wiki/American_Samoa), [Baker Island](/wiki/Baker_Island) and [Howland Island](/wiki/Howland_Island) (part of the [United States Minor Outlying Islands](/wiki/United_States_Minor_Outlying_Islands)) are among the last. The first of January represents the fresh start of a new year after a period of remembrance of the passing year, including on radio, television, and in newspapers, which starts in early December in countries around the world. Publications have year-end articles that review the changes during the previous year. In some cases, publications may set their entire year's work alight in the hope that the smoke emitted from the flame brings new life to the company. There are also articles on planned or expected changes in the coming year. This day is traditionally a [religious feast](/wiki/Religious_festival), but since the [first decade](/wiki/1900%E2%80%931909) of the 20th century has also become an occasion to celebrate the night of 31 December—New Year's Eve—with parties, public celebrations (often involving fireworks shows) and other traditions focused on the impending arrival of midnight and the new year. [Watchnight services](/wiki/Watchnight_service) are also still observed by many. ### New Year's Day The celebrations and activities held worldwide on 1 January as part of New Year's Day commonly include the following: - [Pisan](/wiki/Pisa) New Year's Day celebrations was a particular type of calendar in use in [Pisa](/wiki/Pisa), Italy, and other areas of present-day [Tuscany](/wiki/Tuscany) until the mid-18th century, which started the year on 25 March (the feast of the [Annunciation](/wiki/Annunciation) of the [Virgin Mary](/wiki/Virgin_Mary) according to the liturgical calendar), anticipating its beginning by nine months and seven days compared to the \"modern style\" or \"Circumcision style\", still in use today, which indicates 1 January as the first day of the year; - Several major [parades](/wiki/Parade) are held on New Year's Day, including the [London's New Year's Day Parade](/wiki/London%27s_New_Year%27s_Day_Parade), [Pasadena](/wiki/Pasadena,_California)'s [Tournament of Roses Parade](/wiki/Tournament_of_Roses_Parade) (also known as the \"Rose Parade\"), and Philadelphia's [Mummers Parade](/wiki/Mummers_Parade). In the Bahamas, it is also associated with [Junkanoos](/wiki/Junkanoo). - Beginning in the 2010s, it is also the day that [First Day Hikes](/wiki/First_Day_Hikes) takes place in the [fifty state park systems of the United States](/wiki/State_park#United_States_of_America). - The [Vienna Philharmonic](/wiki/Vienna_Philharmonic) orchestra traditionally performs a [New Year's concert](/wiki/Vienna_New_Year%27s_Concert) on the morning of New Year's Day. - A \"[polar bear plunge](/wiki/Polar_bear_plunge)\" is a common tradition in some countries, where participants gather on beaches and run into the cold water. [Polar Bear Clubs](/wiki/Polar_Bear_Clubs) in many [Northern Hemisphere](/wiki/Northern_Hemisphere) cities have a tradition of holding organized plunges on New Year's Day, and they are often held to raise money for charity. - In Ireland, New Year's Day was called *Lá na gCeapairí*, or the day of the buttered bread. A possible meaning to the consumption of buttered bread was to ward off hunger and famine in the coming year, by placing the buttered bread on the doorstep in the morning. Some traditions saw parties of young people calling from house to house to receive buttered bread and occasionally [Poitín](/wiki/Poit%C3%ADn), or to give out buttered bread in exchange for pennies. This tradition has since died out, having been popular in the 19th century, and waning in the 1930s and 1940s. - In Japan, Korea, and areas inhabited by the [Inuit](/wiki/Inuit), [Yupik](/wiki/Yupik_peoples), [Aleut](/wiki/Aleut), [Chukchi](/wiki/Chukchi_people) and the [Iñupiat](/wiki/I%C3%B1upiat), watching the [first sunrise](/wiki/First_sunrise) is a tradition. - In the United Kingdom and United States, New Year's Day is associated with several prominent sporting events: - In the United States, 1 January is the traditional date for several major post-season college football [bowl games](/wiki/Bowl_games), including the [Citrus Bowl](/wiki/Citrus_Bowl) in [Orlando](/wiki/Orlando,_Florida), the [Outback Bowl](/wiki/Outback_Bowl) in [Tampa](/wiki/Tampa,_Florida), the [Rose Bowl Game](/wiki/Rose_Bowl_Game) in Pasadena, and the [Sugar Bowl](/wiki/Sugar_Bowl) in New Orleans. Since 2025, the Rose and Sugar Bowl games have hosted two of the [College Football Playoff](/wiki/College_Football_Playoff) quarter-finals, but will move to mid-January to host the semi-finals every three years. From 2008 to 2024, the [National Hockey League](/wiki/National_Hockey_League) hosted an annual [outdoor game](/wiki/NHL_outdoor_games), the *[Winter Classic](/wiki/NHL_Winter_Classic)*, on New Year's Day, which rotates between different host teams annually, and usually showcases a major regional [rivalry](/wiki/List_of_NHL_rivalries). - If New Year's Day falls on a Sunday, U.S. sporting events traditionally held on New Year's Day are typically deferred to the following Monday in defense of the [National Football League](/wiki/National_Football_League)—which plays a Sunday game day as normal. Similarly, the Rose Parade has enforced a \"never on Sunday\" rule since 1893, believing that a parade held on Sunday would scare horses and cause them to disrupt Sunday [church services](/wiki/Church_service). The NHL moved the Winter Classic off New Year's Day entirely in 2025 to avoid competition from the expanded College Football Playoff, with the 2025 edition held on New Year's Eve in prime time instead, and the 2026 game scheduled for 2 January. - The [Premier League](/wiki/Premier_League) in English [football](/wiki/Association_football) traditionally holds a fixture of matches on New Year's Day, stemming from the historic tradition of games being played over the Christmas holiday period (including, just as prominently, [Boxing Day](/wiki/Boxing_Day)). - The final of the [PDC World Darts Championship](/wiki/PDC_World_Darts_Championship) typically falls on New Year's Day. - The [Cheltenham Racecourse](/wiki/Cheltenham_Racecourse) holds a New Year's Day fixture, which includes the [Fairlawne Handicap Chase](/wiki/Fairlawne_Handicap_Chase), [Dipper Novices' Chase](/wiki/Dipper_Novices%27_Chase), and [Relkeel Hurdle](/wiki/Relkeel_Hurdle). - New Year's Day is a government and bank holiday in many countries. - In the Southern United States, a variety of foods considered lucky are cooked and consumed on New Year's Day, including [hopping John](/wiki/Hopping_John), red beans and rice, [black-eyed peas](/wiki/Black-eyed_pea) and [collard greens](/wiki/Collard_greens). - In Sweden, pizza orders spike with some pizzerias bringing in extra staff to handle a surge in demand. Swedish media have described it as 'Pizza Day'. ### Music Music associated with New Year's Day comes in both classical and popular genres, and there is also [Christmas song](/wiki/Christmas_music) focus on the arrival of a new year during the [Christmas and holiday season](/wiki/Christmas_and_holiday_season). - [Paul Gerhardt](/wiki/Paul_Gerhardt) wrote the text for a hymn for the turn of the year, \"[Nun lasst uns gehn und treten](/wiki/Nun_lasst_uns_gehn_und_treten)\", first published in 1653. - [Johann Sebastian Bach](/wiki/Johann_Sebastian_Bach), in the [Orgelbüchlein](/wiki/Orgelb%C3%BCchlein), composed three chorale preludes for the new year: *Helft mir Gotts Güte preisen* [\"Help me to praise God's goodness\"] (BWV 613); *Das alte Jahr vergangen ist* [\"The old year has passed\"] (BWV 614); and *In dir ist freude* [\"In you is joy\"] (BWV 615). - *The year is gone, beyond recall* is a traditional Christian hymn to give thanks for the new year, dating back to 1713. - In English-speaking countries, it is traditional to sing [Auld Lang Syne](/wiki/Auld_Lang_Syne) at midnight on New Year's. ### New Year's Day babies A common image used, often as an editorial cartoon, is that of an incarnation of [Father Time](/wiki/Father_Time) (or \"the Old Year\") wearing a sash across his chest with the previous year printed on it passing on his duties to the [Baby New Year](/wiki/Baby_New_Year) (or \"the New Year\"), an infant wearing a sash with the new year printed on it. Babies born on New Year's Day are commonly called *New Year babies*. Hospitals, such as the Dyersburg Regional Medical Center in the US, give out prizes to the first baby born in that hospital in the new year. These prizes are often donated by local businesses. Prizes may include various baby-related items such as baby formula, baby blankets, [diapers](/wiki/Diaper), and [gift certificates](/wiki/Gift_certificate) to stores which specialise in baby-related merchandise. ### Antarctica On New Year's Day in Antarctica, the stake marking the geographic south pole is moved approximately 10 meters to compensate for the movement of the ice. A new marker stake is designed and made each year by staff at the site nearby. - [First Night](/wiki/First_Night) - [List of films set around New Year](/wiki/List_of_films_set_around_New_Year) - [List of winter festivals](/wiki/List_of_winter_festivals) - [Rosh Hashanah](/wiki/Rosh_Hashanah) - [Saint Sylvester's Day](/wiki/Saint_Sylvester%27s_Day) - [New Year's Six](/wiki/New_Year%27s_Six) ## Notes ### Bibliography - [Macrobius](/wiki/Macrobius), *Saturnaliorum Libri VII*. (in Latin) - [Macrobius](/wiki/Macrobius) (2011), Kaster, Robert A. (ed.), *Saturnalia,* Vol. I, *Loeb Classical Library*, No. 510, [Cambridge](/wiki/Cambridge,_Massachusetts): Harvard University Press, [ISBN](/wiki/ISBN_(identifier)) 978-0-674-99649-6. (in English) & (in Latin) - Media related to New Year's Day at Wikimedia Commons - New Year's Around the World – slideshow by *[Life magazine](/wiki/Life_magazine)* - \"New Year's Day\". *[New International Encyclopedia](/wiki/New_International_Encyclopedia)*. 1905. Portals: - Society - Holidays\n",
  "language": "en",
  "processed_at": "2026-01-12T11:37:17.791708",
  "title": "New Year's Day",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/New_Year%27s_Day"
}