{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:35:20.265456"
  },
  "content": "Brand of reclaimed wastewater **NEWater** (pronounced New-Water) is the brand name given to [highly treated reclaimed wastewater](/wiki/Reclaimed_water) produced by [Singapore's](/wiki/Singapore) [Public Utilities Board](/wiki/Public_Utilities_Board). NEWater is produced by further purifying conventionally treated [wastewater](/wiki/Wastewater) through [microfiltration](/wiki/Microfiltration), [reverse osmosis](/wiki/Reverse_osmosis) and ultraviolet radiation. The water is potable quality and can be added to drinking water supply reservoirs where it is withdrawn and treated again in conventional water treatment plants before being distributed to consumers. However, most NEWater is currently used for non-drinking purposes, mostly by industries with production requirements for high purity water. ## History Singapore considered water recycling to augment its limited fresh water supply starting in the 1970s. A Master Plan drafted in 1972 identified water reclamation and desalination as alternatives to reduce dependence on imported water from Malaysia. Subsequently, an experimental water reclamation treatment plant was built in 1974, but the operation was terminated after only one year due to costs and reliability issues. In 1998, the Public Utilities Board (PUB) and the [Ministry of the Environment and Water Resources](/wiki/Ministry_of_the_Environment_and_Water_Resources) (MEWR) initiated the Singapore Water Reclamation Study (NEWater Study). The aim was to determine if NEWater was a viable source of raw water for Singapore's needs. NEWater and [desalination](/wiki/Desalination) both were explored to reduce reliance on water imported from [Malaysia](/wiki/Malaysia), which has long been a source of friction between the Malaysian and Singapore governments. The Malaysian government is treaty-bound to sell water to Singapore until 2061, but it has no obligation to do so after that date. In 2001, PUB initiated efforts to identify non-potable uses of water. NEWater, because of its high quality, became the supply of choice for industry demands. This use provided an outlet for this new water supply without increasing the demand on the limited potable water supply. The PUB launched NEWater to the public in 2003, with the opening of the first two NEWater plants - the Bedok and Kranji plants - as well as the NEWater Visitor Centre. In anticipation of the potential public concerns over the safety of recycled water, NEWater was carefully implemented. The PUB was cautious in its usage of terms, avoiding terms such as 'wastewater' or 'sewage' that carried a negative connotation. Sewage treatment plants were renamed to 'water reclamation plants' and sewage or wastewater were referred to as 'used water'. This contributed to a positive framing of NEWater, enhancing public acceptance of reused water. In addition, the government extensively engaged the public through exhibitions and advertisements to educate them about NEWater. The NEWater Visitor Centre, which allows people to view the NEWater treatment process, was also opened to enhance visitors' understanding of how NEWater is produced. These public engagement efforts were aimed at correcting any misunderstandings people might have towards recycled water and increasing public support for reused water. Also, innovative technologies which was promoted by international industries applied on NEWater, such as LG Chem and [DuPont](/wiki/DuPont) in its reverse osmosis technologies. ## Production The first NEWater plant was completed in May 2000. Singapore currently has four operational NEWater factories, at Bedok, Kranji, Ulu Pandan and Changi. The Bedok and Kranji factories were commissioned in 2002, the Ulu Pandan plant in March 2007 and the Changi plant in August 2009. A plant at Seletar, commissioned in February 2004, was closed in 2011, as the PUB implemented its plan to centralize the treatment of used water, under the Deep Tunnel Sewerage System. In January 2017, a new NEWater plant was launched at [Changi](/wiki/Changi), and is the first plant to be jointly developed by a foreign and local company. The Bedok and Kranji plants are operated by the Public Utilities Board, while the Ulu Pandan and Changi plants are under [DBOO concessions](/wiki/Build%E2%80%93operate%E2%80%93transfer) by Keppel Seghers and [Sembcorp Industries](/wiki/Sembcorp_Industries). There is a Visitor Centre in the NEWater factory in Bedok, near the Singapore Expo [Tanah Merah MRT station](/wiki/Tanah_Merah_MRT_station). The visitor centre was awarded the Best Sightseeing/Leisure/Educational Programme at the 20th Tourism Awards 2005 and the IWA Marketing & Communication Award in 2006. The visitor centre provides multiple free programmes to educate the public regarding the technologies and production of NEWater: - NEWater Scientist Program – Students take on the role of NEWater Scientists and explore the visitor centre - Outdoor Classroom – Host fun activities and experiments that help students learn about reverse osmosis and other NEWater processes - Water Ambassadors – Small workshops that teach uniformed groups (i.e. National Cadet Corps and Scouts Association) skills to be water ambassadors Plant nameLocationDate of commissioningCurrent capacity (Per Day)OperatorBedok NEWater FactoryBedok200219 million imperial gallons (86,000 m3)PUB Kranji NEWater FactoryKranji200212 million imperial gallons (55,000 m3)PUB Seletar NEWater plantSeletar2004Decommissioned in 2011PUB Keppel Seghers NEWater PlantUlu Pandan200733 million imperial gallons (150,000 m3)Keppel SeghersSembcorp NEWater PlantChangi201050 million imperial gallons (230,000 m3)[Sembcorp](/wiki/Sembcorp)BEWG-UESH NEWater PlantChangi201750 million imperial gallons (230,000 m3)BEWG-UESH ### Procedure NEWater source water comes from [effluent](/wiki/Effluent) of [secondary sewage treatment](/wiki/Secondary_treatment) plants. The effluent passes through a multiple-barrier water reclamation process: - The first stage of the NEWater production process uses [microfiltration](/wiki/Microfiltration)/[ultrafiltration](/wiki/Ultrafiltration) to remove suspended solids, colloidal particles, disease-causing bacteria, some [viruses](/wiki/Viruses) and [protozoan](/wiki/Protozoan) [cysts](/wiki/Microbial_cyst). The filtered water after passing through the membrane contains only dissolved salts and organic molecules. - The second stage of the NEWater production process uses [reverse osmosis](/wiki/Reverse_osmosis) (RO). A [semi-permeable membrane](/wiki/Semi-permeable_membrane) filters out contaminants such as bacteria, viruses, [heavy metals](/wiki/Heavy_metals), [nitrates](/wiki/Nitrate), [chlorides](/wiki/Chloride), [sulfates](/wiki/Sulphate), disinfection by-products, aromatic hydrocarbons, and [pesticides](/wiki/Pesticides). NEWater is thus free from viruses and bacteria and contains very low levels of salts and [organic matter](/wiki/Organic_matter). At this stage, the water is of potable quality. - The third stage of the NEWater production process is a safety precaution. [UV disinfection](/wiki/Ultraviolet#Sterilization_and_disinfection) is used to ensure that all organisms are inactivated and the purity of the water can be guaranteed. After adding some alkaline chemicals to restore the [pH balance](/wiki/PH_balance), NEWater is ready for use. - NEWater production process Since 2002, there have been pilot programs to consider replacing the [activated sludge](/wiki/Activated_sludge) process of the secondary sewage treatment and the microfiltration/ultrafiltration stage of the NEWater with a [membrane bioreactor](/wiki/Membrane_bioreactor) process. ## Applications The total capacity of the plants is about 200 million US gallons per day (760,000 m3/d). About 6% of this is used for [indirect potable use](/wiki/Indirect_potable_use), equal to about 1% of Singapore's potable water requirement of 380 million US gallons per day (1,400,000 m3/d). The rest is used at [wafer fabrication](/wiki/Wafer_fabrication) plants and other non-[potable](/wiki/Potable) applications in industries in [Woodlands](/wiki/Woodlands,_Singapore), [Tampines](/wiki/Tampines), [Pasir Ris](/wiki/Pasir_Ris), and [Ang Mo Kio](/wiki/Ang_Mo_Kio). Government figures show that the country's NEWater plans can meet up to 40% of Singapore's current needs, and the figure is expected to go up to 55% by 2060. ### Potability The quality of NEWater consistently exceeds the requirements set by [USEPA](/wiki/United_States_Environmental_Protection_Agency) and [WHO](/wiki/World_Health_Organization) guidelines and is cleaner than other water sources in Singapore. The following table compares the water quality of NEWater to the WHO and USEPA standards. Quality Chart Water Quality ParametersNEWaterUSEPA /WHO StandardsA) PhysicalTurbidity (NTU)<55/5Colour (Hazen Units)<515/15Conductivity (μS/cm)<250Not SpecifiedpH Value7.0–8.56.5–8.5Total Dissolved Solids (mg/L)<150500/1000Total Organic Carbon (mg/L)<0.5-/-Total Hardness (CaCO3)(mg/L)<50Not AvailableB) Chemical (mg/L)Ammoniacal nitrogen (as N)<1.0-/1.2Chloride (Cl)<20250/250Fluoride (F)<0.54/1.5Nitrate (NO3)<1510/11Silica (SiO2)<3-/-Sulphate (SO4)<5250/250Residual Chlorine (Cl, Total)<24/5Total Trihalomethanes (as mg/L)<0.080.08/-C) Metals (mg/L)Aluminum<0.10.05–0.2/0.2Barium<0.12/0.7Boron<0.5-/0.5Calcium4 - 20-/-Copper<0.051.3/2Iron<0.040.3/0.3Manganese<0.050.05/0.4Sodium<20-/200Strontium<0.1-/-Zinc<0.15/3D) BacteriologicalTotal Coliform Bacteria (Counts/100 mL)Not detectableNot detectableEnterovirusNot detectableNot detectableHeterotrophic Plate Count (CFU/mL, 35 °C, 48 h)<300<500/- - [Water supply and sanitation in Singapore](/wiki/Water_supply_and_sanitation_in_Singapore) - Official site\n",
  "language": "en",
  "processed_at": "2026-01-12T11:35:20.264886",
  "title": "NEWater",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/NEWater"
}