{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:37:23.471007"
  },
  "content": "1974 Parliament of Singapore statute The **Newspaper and Printing Presses Act 1974** is a [statute](/wiki/Statute) of the [Parliament of Singapore](/wiki/Parliament_of_Singapore) that enables authorities to license the publication and distribution of newspaper and other printed media such as magazines and journals in Singapore. The law is designed to ensure that there is no foreign control of Singaporean newspapers, and limits the circulation of foreign printed media. ## History ### Background The printing presses in Singapore has been subjected to government regulations since the early days of colonial Singapore. A Printing Presses Bill for the [Straits Settlements](/wiki/Straits_Settlements), was first introduced in 1919, and then enacted in 1920 as the Printing Presses Act. The initial version sought to license the ownership of printing presses. As part of the licensing conditions, only significant changes to the ownership of the presses had to be filed with authorities. This act was amended several times over the years, with the last amendment in 1970. However, the act was deemed insufficient by the authorities in curbing foreign control of local newspapers. ### 1971–1974: Introduction of Newspaper and Printing Presses Act In 1971, [Prime Minister](/wiki/Prime_Minister_of_Singapore) [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) made revelations of foreign interferences in three local newspapers, the *[Singapore Herald](/wiki/Singapore_Herald)*, *[Eastern Sun](/wiki/Eastern_Sun)*, and the *[Nanyang Siang Pau](/wiki/Nanyang_Siang_Pau_(Singapore))* in what he called a 'black operation' against Singapore. *Eastern Sun* had received funding from communists elements, while the *Singapore Herald* would receive funding via a Hong Kong company registered by persons with 'dummy names'. The newspaper would then Lee later alleged that an American agency was involved with the funding of the *Singapore Herald*, of which the [United States Department of State](/wiki/United_States_Department_of_State) denied. *Nanyang Siang Pau* though initially took an anti-communist line, all but to gain a foothold with the local population, would slowly write articles that were more friendly to the Chinese communists thoughts. The *Singapore Herald* was shut down within the year, and majority of its staff were absorbed into other media companies, hotels, and airlines. The Newspaper and Printing Presses Bill was introduced to the Parliament of Singapore on 14 March 1974, the wake of three Singaporean newspaper crises to an earlier closure of two Singaporean newspapers, the *Singapore Herald*, the *Eastern Sun*, and the detention of four *Nanyang Siang Pau* executives. The Bill sought to prevent foreign ownership of Singapore newspapers via the following means: 1. All daily and weekly newspapers have to be published by \"newspaper companies\". 2. All newspaper companies have to be publicly traded. 3. No acceptance of foreign funds. 4. All newspaper companies are to issue two types of shares: management and ordinary shares. 5. All company directors must be Singaporean citizens. 6. Cancellation of the license which allows publication and distribution of newspaper in Singapore. It prevents newspapers from knowingly receiving funds from foreign sources, such as foreign governments or their agents, foreign companies not primarily registered in Singapore, or people with foreign citizenships, without approval from the Singaporean government. The authorised foreign funds may be in form of cash or any other valuable considerations, and must be returned to the sender if received. If the sender could not traced, the fund would be donated to charities. The requirement of management shares for Singaporean companies was struck out earlier in the December 1967 amendment to the [Companies Act](/wiki/Companies_Act#Singapore). The Bill reintroduced this type of share specifically for newspaper companies. Management shares are issued to be appointed persons as directed by the government, and holds an aggregate voting rights that is more than that of ordinary shares. The appointed persons can only be Singaporeans or Singapore corporations. The argument for having provisions for compulsory public ownership and management shares was that there were more independent countries insisting that newspapers have to be owned by nationals, and that the newspapers are not paralysed by shareholder blocs. Decisions under this law made by the Singaporean government can be appeal to the [President of Singapore](/wiki/President_of_Singapore). On 28 March 1974, the Bill was debated further in the Parliament. It was revealed the newspapers had been given notice about the move to make all newspaper companies public as early as January 1973. The Bill was referred to a [select committee](/wiki/Select_committee_(parliamentary_system)) for further review and to seek public views about the Bill. After deliberations, the select committee provided several amendments to the original bill to the Parliament in August 1974. The bill would now include changes such as penalties for not reporting foreign funds; pegging the value of management shares to market prices of ordinary shares; limiting the amount of management shares to 1% of the total shares issues; people holding management shares would have 200 votes per share for resolutions relating to appointment of directors and 1 vote per share for other matters. The Bill was passed on 28 August 1974, and thereafter known as the Newspaper and Printing Presses Act. Subsequently, the government published a set of rules and regulations based on the Act, among which set out that if the newspaper was being published in Malaysia, the Malaysian printer's Malaysian address and a local address for legal matters to be served to had to be printed on every page. ### 1975–81: Immediate impact of regulations The Singapore National Union of Journalists pledged its support for the Act in its 1975 annual general meeting. However, the union had concerns of brain drain in newspapers due to poor management of newspaper companies and lack of personnel departments in certain newspapers. In 1975, the newspaper company, Straits Times Press (Singapore), which published Singapore's [newspaper of record](/wiki/Newspaper_of_record), *[The Straits Times](/wiki/The_Straits_Times)*, among other business interests was restructured into two companies, Straits Times Press (1975) and Times Publishing, in order to meet the changes required by the Act. The STP(1975) would carry on publishing the newspapers that STP(S) had owned, Times Publishing would own STP(S)'s non-newspaper operations. On 14 November 1975, two members of the Singapore Muslim Action Front (SMAF), Abdul Raman bin Mohamed Zin and Syed Ahmad alias Syed Ahmad Dahlan, were charged for publishing a newspaper without permit. SMAF was an unregistered party, which the government had alleged of raising \"certain sensitive religious issues pertaining to Muslim religion [sic] which could confuse the public and arouse racial feelings, if left unanswered.\" The newspaper was found being distributed at various mosques since mid of 1974, and 31 July 1975 at Woodlands checkpoint. The prosecutors charged that despite the publication was in the form of pamphlets, the content could be classified as \"news\". The pair were fined S$2,000 each and a subsequent appeal was dismissed. At the [Socialist International](/wiki/Socialist_International) 1976 convention, [Netherlands' Labour Party](/wiki/Dutch_Labour_Party) and the [British Labour Party](/wiki/Labour_Party_(UK)) sought the removal of [People's Action Party](/wiki/People%27s_Action_Party) (PAP) from the international organisation, with the Act as a medium for press censorship as one of their reasonings. PAP would eventually resigned from SI instead. On 12 October 1976, authorities had revoked the permit for [Singapore Polytechnic](/wiki/Singapore_Polytechnic) student-published Chinese magazine, *Radiance*, due to communist influences. In 1977, further amendments to the Act was introduced to \"break the monopolistic hold of newspapers by a few families and small groups of people\". The amendment forced stakeholders of newspaper companies with share capital of S$4 million or less to limit their shares to no more than 3 per cent of the share capital. This limitation could subsequently be waived with another amendment in 1981, in recognition to the fact that there may be situations that warrant a higher proportion of stake holding, such as establishing a new newspaper company. ### 1986–1990: New regulations on foreign newspapers In 1986, an amendment was introduced and passed to limit the sales of \"declared foreign newspapers\" which were found to be engaging in campaigns to manipulate local opinions on local politics, race and religion issues. Some foreign newspapers such as *[Asian Wall Street Journal](/wiki/Asian_Wall_Street_Journal)* (AWSJ) and *[Far Eastern Economic Review](/wiki/Far_Eastern_Economic_Review)* (FAAR) were dependent on the Singapore market for revenue with 1 in 7 of their total circulation numbers being in Singapore, making them almost like local newspapers. [Prime Minister](/wiki/Prime_Minister_of_Singapore) [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) said the aim of the law was to prevent foreign newspapers from meddling with Singapore's domestic politics, under the guise of freedom of speech, thus increasing their sales. A graduated limit on the circulation would also at least allow the circulation of the offending articles in photocopies. Prior to this amendment, usage of existing laws such as Undesirable Publishing Act, Internal Security Act, Sedition Act, and the Penal Code would effectively ban the identified publication outright. This amendment was soon used on [the *Time* magazine](/wiki/Time_(magazine)) after it refused to published corrections to an article which had stated some facts relating to a 1984 court case involving [J. B. Jeyaretnam](/wiki/J._B._Jeyaretnam), and *Time*'s insistence of editing Prime Minister's Press Secretary, James Fu's letter before publishing. *Time*'s circulation number was halved to 9,000 in October 1986, and was further restricted to 2,000 at the start of 1987. Before the restriction, *Time*'s circulation in Singapore was only 0.3 per cent of its global circulation, suggesting that it did not care about publishing corrections as asked by the government. At the start of 1988, FAAR's weekly circulation was restricted from 9,000 to 500 copies, to which FAAR decided not to circulate anymore in Singapore as long as the restriction exists. The restriction also halted its Singapore printing operation of more than half of its 70,000 copies in total circulation. In response, the government amended the Act to allow gazetted publications to be reproduced by other parties for sale without profit. In these copies, advertisements were also deleted. Eight parties applied to reproduce FAAR for sale, with The Singapore Manual & Mercantile Workers' Union winning the right to reproduce 1,000 copies, and selling it for S$3, below FAAR's news-stand price of S$4. [United States Trade Representative](/wiki/Office_of_the_United_States_Trade_Representative) [Clayton Yeutter](/wiki/Clayton_Yeutter) published a 'letter of protest' in AWSJ that the amendment violated international copyright agreement. The same letter was sent to [Minister of Trade and Industry](/wiki/Ministry_of_Trade_and_Industry_(Singapore)) [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) as well, to which Lee replied that the reproduced copies were for personal use and not for profit and thus not violating Singapore's Copyright Act then, and that it was to ensure that Singaporeans had easy access to restricted foreign publications. ASWJ was similarly restricted from 5,000 to 400 copies in 1987 over a 1986 article on [SESDAQ](/wiki/SESDAQ), the second securities market in Singapore. It challenged the government unsuccessfully in Singapore's [High Court](/wiki/High_Court_of_Singapore) and [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore). It then further challenged the government in the [Privy Council of the United Kingdom](/wiki/Privy_Council_of_the_United_Kingdom) in 1989.[a] However, the Privy Council declined hearing the appeal, citing that for civil cases, both parties had to agree to be heard before the council. ASWJ decided to withdraw from circulation due to the next amendment in 1990. In 1990, an amendment was introduced to require certain foreign newspaper companies to post a bond in order to continue circulation in Singapore at the numbers they want. Three companies, *[Asiaweek](/wiki/Asiaweek)*, *[Yazhou Zhoukan](/wiki/Yazhou_Zhoukan)*, and *Media and Marketing News* were affected. *[Asiaweek](/wiki/Asiaweek)* and *[Yazhou Zhoukan](/wiki/Yazhou_Zhoukan)* posted S$500,000 bond, thus allowing them to freely circulate. AWSJ subsequently applied as well in 1991 and was granted a circulation limit of 2,500 copies. ### 2002–present: New developments An amendment was introduced in 2002 to allow the ownership of 5% per cent of shares by an individual. If an individual would like to hold more than that amount of shares, they have to seek approval from the relevant minister. On 6 May 2021, [Singapore Press Holdings](/wiki/Singapore_Press_Holdings) (SPH) in response to shareholder pressures, had proposed that it would restructure itself and transfer its media business into a [company limited by guarantee](/wiki/Company_limited_by_guarantee) (CLG), which will be privately managed. The new CLG will be initially managed by the holders of SPH current management shareholders: [OCBC Bank](/wiki/OCBC_Bank), [Great Eastern](/wiki/Great_Eastern_Life), [United Overseas Bank](/wiki/United_Overseas_Bank), [DBS Bank](/wiki/DBS_Bank), [Singtel](/wiki/Singtel), [NTUC Income](/wiki/NTUC_Income), [Temasek](/wiki/Temasek_Holdings), the [National University of Singapore](/wiki/National_University_of_Singapore) and the [Nanyang Technological University](/wiki/Nanyang_Technological_University), while still having to issue new management shares of the media business under the CLG as required by NPPA. The government will also lift the shareholder limits on the currently listed SPH entity. This new CLG was named [SPH Media Trust](/wiki/SPH_Media_Trust). - [Mass media in Singapore](/wiki/Mass_media_in_Singapore) ## Notes - Newspaper and Printing Presses Act 1974\n",
  "language": "en",
  "processed_at": "2026-01-12T11:37:23.470614",
  "title": "Newspaper and Printing Presses Act",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Newspaper_and_Printing_Presses_Act"
}