{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:37:31.366811"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Nexus International School Singapore\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(August 2018)* *(Learn how and when to remove this message)*K-12 international school **Nexus International School (Singapore)** (**NISS**) is a [private school](/wiki/Private_school) located in [Singapore](/wiki/Singapore). The campus moved over to Aljunied in January 2020 from its previous location in Ulu Pandan Road off Pandan Valley.[*citation needed*] The school caters from Nursery up to Year 13 (ages 3 to 18). NISS enrolled its first learners in July 2011 and has over 1,550 students from around 60 countries.[*citation needed*] NISS is a member of the Council of International Schools (CIS), an approved [Cambridge International Examinations](/wiki/Cambridge_International_Examinations) (CIE) Centre, EduTrust certified, an Apple Distinguished School, fully accredited by the Western Association of Schools and Colleges (WASC), accredited member of FOBISIA and is also an authorised [International Baccalaureate](/wiki/International_Baccalaureate) (IB) World School, authorised to offer the IB Primary Years Programme (PYP) and Diploma Programme (DP).[*citation needed*] Its facilities include an Olympic-sized swimming pool, two gymnasiums, a two-tiered theatre, double-storey library, and a FIFA and World Rugby specified AstroTurf pitch. Co-curricular activities such as [swimming](/wiki/Swimming), [hip hop dance](/wiki/Hip_hop_dance), [Taekwondo](/wiki/Taekwondo), inline skating, drama, and choir. NISS also participates in sports competitions organised by the Athletic Conference of Singapore International Schools such as rugby, basketball, and football, and has been the official host for the FINA Swimming World Cup Swim Meets since 2017.[*citation needed*] The school has many awards and accolades including Sustainable School of the Year, Best Innovative Learning Environment, Entrepreneaurship in Education and for its architectural design.[*citation needed*] ## New campus In late 2017, the school announced that they would move to a new campus in [Aljunied](/wiki/Aljunied) located at Aljunied Walk off Aljunied Road. The new campus features a 12-storey educational minded design and includes an Olympic-sized swimming pool, FIFA and World Rugby specified Astroturf field, a large auditorium, mega laboratory, two air indoor sports halls and a 2-storey library. The school moved over to their new location in December 2019 and opened its doors in January 2020.[*citation needed*] ## Alumni - [Eleanor Lee](/wiki/Eleanor_Lee), [Singaporean](/wiki/Singaporean) actress and singer currently based in China[*citation needed*] - Official website - Nexus International School Parent Reviews This Singapore school-related article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:37:31.366486",
  "title": "Nexus International School Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Nexus_International_School_Singapore"
}