{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:37:42.235389"
  },
  "content": "This biographical article **is written [like a résumé](/wiki/R%C3%A9sum%C3%A9)**. Please help improve it by revising it to be neutral and encyclopedic. *(October 2023)* **Ng Gim Choo** is a Singaporean businesswoman and the founder and chairwoman of the [EtonHouse International Education Group](/wiki/EtonHouse_International_Education_Group), a global network of international schools headquartered in Singapore. Formerly an auditor at Ernst & Young, Ng entered the education sector in the 1990s.[*citation needed*] ## Career She established the first EtonHouse school in Singapore in 1995, located at Broadrick Road. The school introduced an alternative approach to early years education in Singapore, drawing inspiration from international pedagogies such as the [Reggio Emilia](/wiki/Reggio_Emilia_approach) philosophy. EtonHouse International Education Group grew to encompass more than 100 schools in 9 countries, offering preschool to high school education. The group includes international schools as well as government-affiliated preschools under brands such as E-Bridge. As of 2025, EtonHouse schools serve over 25,000 students globally. One of ECF's key programmes is Joyful Learning, launched in 2021 to foster a love for reading among children aged 3 to 6 from lower-income families. The year-long programme includes weekly 1.5-hour sessions featuring storytelling, arts and crafts, and group activities. Conducted by trained volunteers under the Teacher Everywhere™ initiative, these sessions are designed to enhance literacy, numeracy, self-expression, and motor skills. As of late 2023, Joyful Learning has supported over 100 children across six locations in Singapore, with plans to expand to 20 centres to reach approximately 300 children. In collaboration with KidSTART Singapore and [SP Group](/wiki/SP_Group), ECF co-launched KidSTART Stories in 2022, providing over 1,800 low-income families with mini-libraries comprising bookshelves and age-appropriate books. This initiative aims to create conducive home environments for reading, thereby supporting early language development and parent-child bonding. ECF has also implemented a mindfulness programme targeting at-risk youth in Singapore. Initiated in 2018, the programme offers sessions that incorporate movement and breathing exercises to help participants develop self-awareness, emotional intelligence, and resilience. By 2019, the programme had reached 135 beneficiaries across nine children's homes, earning ECF the Community Cares Award from the [Ministry of Social and Family Development](/wiki/Ministry_of_Social_and_Family_Development). ECF has invested over S$2.7 million in various programmes, impacting more than 16,000 children and youth in Singapore. In 2023, ECF hosted a charity gala titled *Lifting Half the Sky*, which raised over S$1.2 million through donations, book sales, and auctions. The event aimed to support disadvantaged children and empower women and girls through education. ## Awards and recognition Choo has been recognised both in Singapore and internationally for her contributions to education and social development. In 2009, she became the first Singaporean woman to receive the Freedom of the City of London, acknowledging her efforts in advancing international education. Her philanthropic work in China was honoured with the Woman of Benevolence award from Suzhou City in 2004 and the Jiangsu Friendship Award in 2011. In 2019, she received the Ernst & Young Entrepreneur Of The Year Award in the Education category in Singapore. She was featured in Forbes Asia's Power Businesswomen list in 2021, named Her World's Woman of the Year in 2022, and included in [Tatler](/wiki/Tatler) Asia's Most Influential list. In 2023, Ng was featured in Forbes' 50 Over 50: Asia list, highlighting women who have made significant contributions later in life. She also received the UltraLuxe Advocacy Giving Back Award for her commitment to philanthropy and social impact through education, and was honoured in the Large/Listed Companies Category at the Women Entrepreneur Awards. In 2024, she was recognised as an honouree at the Serica AAPI Women’s Gala in the United States, celebrating visionary women leaders who have made outstanding contributions to their fields and society through resilience and perseverance. - [INSEAD](/wiki/INSEAD) Knowledge Episode 707 (2010), \"A passion for education: Ng Gim Choo, founder, EtonHouse\". - [RTHK](/wiki/RTHK) 1-2-3 Show (15 April 2014), \"Ng Gim Choo - EtonHouse / Reenita Malhorta Hora - Asian Threads\"\n",
  "language": "en",
  "processed_at": "2026-01-12T11:37:42.235107",
  "title": "Ng Gim Choo",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Ng_Gim_Choo"
}