{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:37:45.667487"
  },
  "content": "Hospital in SingaporeHospital in Jurong East Street , Singapore **Ng Teng Fong General Hospital** (**NTFGH**) is a 700-bed hospital located in [Jurong East](/wiki/Jurong_East), [Singapore](/wiki/Singapore). Named after the late Singaporean entrepreneur [Ng Teng Fong](/wiki/Ng_Teng_Fong), the hospital is part of an integrated development together with the adjoining [Jurong Community Hospital](/wiki/Jurong_Community_Hospital). It began operations on 30 June 2015 after JurongHealth's move from [Alexandra Hospital](/wiki/Alexandra_Hospital) and was officially opened on 10 October that year. ## History ### Construction Construction of the hospital started in 2012 and had cost about [S$](/wiki/Singapore_dollar)1 billion to build. The hospital was planned together with the Jurong Community Hospital to cater to the residents living in the Western part of Singapore and it will comprise 8 levels of specialist clinics upon completion. ### Delay in completion The completion of the hospital was delayed by 6 months due to problems with the production of materials needed for the exterior of the hospital. Due to the delay, [Alexandra Hospital](/wiki/Alexandra_Hospital), which was due to close temporarily for renovation once the hospital is completed, remained operational till construction of the hospital is complete. Later, it was announced that the hospital would open on 30 June 2015. ### Opening The hospital commenced operations on 30 June 2015. On 10 October that year, Ng Teng Fong General Hospital, along with Jurong Community Hospital, was officially opened at JurongHealth's Health Carnival, by guest-of-honour Prime Minister [Lee Hsien Loong](/wiki/Lee_Hsien_Loong). In late 2015, NTFGH achieved Electronic Medical Record Adoption Model (EMRAM) Stage 6 and then in 2016 achieved Stage 7. In 2020, NTFGH successfully revalidated EMRAM Stage 7. - Ng Teng Fong General Hospital - Ministry of Health Press Release Archived 22 December 2015 at the [Wayback Machine](/wiki/Wayback_Machine) This article about a hospital in Singapore is a stub. You can help Wikipedia by expanding it.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:37:45.667027",
  "title": "Ng Teng Fong General Hospital",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Ng_Teng_Fong_General_Hospital"
}