{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:37:48.295846"
  },
  "content": "Former building in Singapore **Ngee Ann Building** was a building on [Orchard Road](/wiki/Orchard_Road) in Singapore housing both shops and apartments. Built by the [Ngee Ann Kongsi](/wiki/Ngee_Ann_Kongsi) and opened in 1957, the rent collected from the building enabled the organisation to establish the [Ngee Ann College](/wiki/Ngee_Ann_Polytechnic). It was demolished in 1985 to make way for [Ngee Ann City](/wiki/Ngee_Ann_City). ## History The land on which the building stood was once the Tai Shan Ting Cemetery, owned by the Ngee Ann Kongsi. The exhumations began following a ceremony on 1 September. A special shed was built for the ceremony, presided over by Buddhist priest Reverend Miao Chung of the Sam Lim Ji Temple on Kim Keat Road. [Joss sticks](/wiki/Joss_stick) were burnt early in the morning to \"inform the dead of the meeting\". By then, offerings had already been placed within the hut. The reverend climbed to the top of the hill within the cemetery to \"invite the dead\" to the shed. Joss sticks were then burnt and placed on the ground to \"guide the spirits from their resting places.\" Prayers were then offered to deities, after which [paper money](/wiki/Joss_paper) and clothes were burnt. The exhumation of the graves commenced following the conclusion of the ceremony. In the same month, then-Ngee Ann Kongsi chairman Lee Wee Nam announced that there were also plans to demolish the nearby Kampong Teochew to make way for \"better class bungalow buildings.\" By October, over 4,000 graves at the cemetery had been reburied at a Chinese cemetery in [Seletar](/wiki/Seletar). By July 1952, 15,000 out of the 20,000 graves had been exhumed. The remains were later reinterred at the Teochew Memorial Park. The granite from the tombstones and monuments of the cemetery were to be repurposed as the foundations of the new buildings. The project was initially planned to include a \"garden city\" with and a self-contained housing unit accompanied by a shopping centre, with 84 shophouses, 423 flats, 20 bungalows, a hotel, school, cinema, amusement park, electrical substation and a petrol kiosk. However, in July 1952, it was announced that the project would have to be developed by private investors and not by the Ngee Ann Kongsi as initially planned, as the trustees of the organisation were prevented by law from doing so. The first phase of the plan was to see the completion of a five-storey building along Orchard Road with 40 flats and 10 shops. However, by February 1955, before tenders had been called for the project, its architect, [Ng Keng Siang](/wiki/Ng_Keng_Siang), had begun seeking approval from the [Singapore Improvement Trust](/wiki/Singapore_Improvement_Trust) for an alteration to the plans for the first phase, which would add a floor to the building, adding 10 more flats. The project's plans were eventually revised such that it only involved a 10-storey building with 90 flats and 12 shops, as well as a hotel and restaurant next to it. The plans for an entire block of shops and flats were shelved in favour of a car park. Work on the first phase began in August 1955, with the project scheduled to be completed by 1959. In October, it was announced that plans for 25 blocks of 10-storey blocks with housing and shops accompanied by car parks had been finalised, with the first building scheduled to be completed by the end of the following year. Each floor was to have four three-bedroom flats and six two-bedroom flats, all of which had servants' quarters, bathrooms and hot water. Rent for the two-bedroom flats was to range from $320 to $400 while rent for the three-bedroom flats was to range from $420 to $500. There was to be an information office on the ground floor, as well as two automated lifts and one manipulated lift for \"servants\" in every block. The project was to cost $3 million. The building was completed in the middle of 1957. In addition to shops, its ground floor also had a bank. In March, the plot of land which stood at the junction of Orchard Road and Grange Road was put up for sale, as plans made by the Kongsi to develop the land had been shelved in favour of developing the rest of the estate. The land next to the building was then leased off, with construction of the [Wisma Indonesia](/wiki/Wisma_Indonesia) on the site beginning in early 1962. Also in 1962, it was announced that the Ngee Ann Kongsi would be using the rent collected from the building to establish the [Ngee Ann College](/wiki/Ngee_Ann_Polytechnic), now known as the Ngee Ann Polytechnic, which was to begin taking in students in the following year. By then, it was collecting nearly $400,000 a year in rent. Rent was also used to fund the establishing of the Ngee Ann Kongsi Home for the Incurable Sick within two unused wards at the Trafalgar Home in 1979. The building became a \"popular place for expatriates taking long-term apartments in Orchard Road.\" The building housed The Mount D'or Cafe, which was \"among the first coffee houses to open in the town.\" *[The Straits Times](/wiki/The_Straits_Times)* called it \"one of the best things that has happened about town for a long time.\" The coffeehouse's interior was designed by a Swiss firm. In January 1971, it was announced that the building would be demolished to make way for the Orchard Square development. The first phase of the project involved the completion of an office block and an apartment block which the tenants of the Ngee Ann Building would move into before the building's demolition. A shopping centre and a car park would then be erected on the site. In August 1975, it was announced that the building may not be demolished to make way for the project, as there had been alterations to the plans of the project, on which work had yet to begin. In May 1983, the building's tenants, which then included the Mont D'or Coffee House, the Asia Motor Company, the [American Express](/wiki/American_Express) Travel Service and Transmarco, were told to vacate the premises by 14 August. However, by then, the land on which Orchard Square was to be built on had shrunk by over three quarters and construction had yet to begin, with the original plans for the project never materialising. The remaining property was put up for sale in December 1984 with the tender document stipulating that the successful tenderer demolish the building within three months. In July of the following year, it was announced that the building's demolition was to finish by September. [Ngee Ann City](/wiki/Ngee_Ann_City) was opened in 1993.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:37:48.295582",
  "title": "Ngee Ann Building",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Ngee_Ann_Building"
}