{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:37:56.629787"
  },
  "content": "Blind obedience to officialdom in SingaporeThis article needs to be **updated**. Please help update this article to reflect recent events or newly available information. *(August 2025)* **No U-turn syndrome** (**NUTS**) is a term first coined by [Singaporean](/wiki/Singapore) entrepreneur [Sim Wong Hoo](/wiki/Sim_Wong_Hoo) to summarise the social behaviour of [Singaporeans](/wiki/Singaporeans), whom he described as deferring to higher authorities before proceeding with any action due to its strict [legal system](/wiki/Law_of_Singapore) and its [penalties](/wiki/Criminal_law_of_Singapore). He makes a comparison of [traffic rules](/wiki/Traffic_rules) in Singapore to those found overseas, to describe the phenomenon. In Singapore, drivers are not allowed to make a [U-turn](/wiki/U-turn) unless a sign specifically allows them to do so, while in some other countries drivers may make U-turns freely so long as a \"No U-turn\" sign is not present. In a similar manner, this analogy is used to explain the [red tape](/wiki/Red_tape) he has encountered with hard-nosed [bureaucrats](/wiki/Bureaucracy), which in turn stifles the very [creativity](/wiki/Creativity) that the [Singaporean government](/wiki/Government_of_Singapore) has been trying to promote in the recent years. NUTS is also considered one of the major criticisms of the rigid [Singapore education system](/wiki/Education_in_Singapore#Criticisms), where students are taught from a young age to obey instructions in an unquestioning manner, in a society where grades and paper certification are emphasised at the expense of some life skills. In 2003, the term was referred to by Singaporean [MPs](/wiki/Member_of_parliament) during discussions about encouraging entrepreneurship. Five MPs said that \"the biggest hurdle for Singaporeans in creating a pro-enterprise environment is the NUTS mentality.\" This Singapore-related article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:37:56.629468",
  "title": "No U-turn syndrome",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/No_U-turn_syndrome"
}