{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:37:58.170194"
  },
  "content": "2004 Singaporean film ***Nobody's Child*** (simplified Mandarin: 谁来爱我 [pinyin](/wiki/Pinyin): *shuǐ laǐ aì wo*) is a 2004 Singaporean film, directed by Lin Wenhui. ## Story Together with her parents and younger brother, Shuangshuang left Malaysia for Singapore. Danping and her husband rented a food stall. But poor business forced Shuangshuang's father to find a job back in Malaysia, leaving Danping to run the stall with Shuangshuang. Danping never appreciated Shuangshuang's competence. Whenever Shuangshuang made a mistake or she was in a foul mood, she'd take it out on the young girl. Wei, an assistant at a neighbouring coffee stall, would always speak up for Shuangshuang whenever she got abused. He and Shuangshuang became good friends over time. Shuangshuang's father soon stopped remitting money and even had an affair. He asked for a divorce when his lover became pregnant. In her quest to get back at her husband, Danping slept with eating house owner Orbit when the latter's wife was away. Wei tips off Orbit's wife, Orbiang, about the affair. Instead of thanking him, Orbiang chided Wei for not telling her sooner and fired him. The emboldened Danping decided to go on a holiday to Phuket with Orbit. Shuangshuang secretly approached Obit to ask the latter to leave her mother. She even offered herself to Orbit in exchange. Orbit pretended to accede to her request and molested her. Shuangshuang went home to tell her mother about what happened. But Danping didn't believe her, took her luggage and left. Shuangshuang heard on the news about how Phuket was affected by a tsunami. Worried for her mum's safety, she tried calling her in vain. Shuangshuang told Wei about how her mum could be a victim in the tsunami and how Orbit molested her. Wei discovers Orbit didn't go on the vacation with Danping. Enraged, Wei confronted Orbit in the woods. Shuangshuang was stabbed as she tried to separate the two. Obit manages to escape with his life. When Shuangshuang's younger brother realizes she has not come back yet, he asks around for her. The film ends as Wei turns himself in. ## Cast - Heng Lirong as Shuangshuang - [Joshua Ang](/wiki/Joshua_Ang) as Wei-ge - Justin Peng as Dandan - Low Soo Kiang as Orbit - May Oon as Obiang - Kimberly Haley Wang as Rain - Chun Keng Wah as Wei's father - Lee Kwok Toong as Peter - Ong Siew Leng as drink can collector - Gibbson Ang as thug - Nobody's Child on Hollywood Flicks This article related to a Singaporean film is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:37:58.169735",
  "title": "Nobody's Child (2004 film)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Nobody%27s_Child_(2004_film)"
}