{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:37:59.739466"
  },
  "content": "Appointed nonpartisan MPs in Singapore A **Nominated Member of Parliament** (**NMP**)[a] is a [non-partisan](/wiki/Non-partisan) [member](/wiki/Member_of_Parliament) of the [Parliament of Singapore](/wiki/Parliament_of_Singapore) who is appointed by the [president](/wiki/President_of_Singapore) to contribute independent and diverse perspectives to parliamentary debates. They are not affiliated to any [political party](/wiki/List_of_political_parties_in_Singapore) and do not represent any [constituency](/wiki/Constituencies_of_Singapore). The scheme was introduced in 1990 as part of constitutional amendments aimed at broadening the representation in Parliament beyond that provided by elected [Members of Parliament](/wiki/Members_of_Parliament) (MP) and [Non-constituency Members of Parliament](/wiki/Non-constituency_Members_of_Parliament) (NCMP). NMPs are appointed by on the recommendation of a [Special Select Committee of Parliament](/wiki/Select_committee_(parliamentary_system)), which evaluates candidates nominated by the public and various functional groups. While NMPs possess similar parliamentary rights as elected MPs, they are restricted from voting on certain key matters, including [constitutional amendments](/wiki/Constitutional_amendments), [supply bills](/wiki/Supply_bills), [money bills](/wiki/Money_bills) and [motions of no confidence](/wiki/Motions_of_no_confidence) in the government. The NMP scheme, in the government's view, is intended to provide a platform for voices from sectors such as the arts, academia, civil society and business, thereby enriching parliamentary discourse with expertise and viewpoints that may not otherwise be represented. NMPs serve a fixed term of two and a half years, shorter than the maximum five-year term of MPs and NCMPs. In addition, the position is considered part-time in nature, and as such, NMPs receive a substantially lower allowance compared to MPs, as they are expected to retain their primary professional occupations. Since its inception, the NMP scheme has undergone periodic reviews and adjustments, including changes to the number of NMPs allowed and the nomination process. The scheme has attracted both support and criticism. Proponents argue that NMPs strengthen deliberative democracy by contributing specialist knowledge and independent thought, while detractors question the accountability of unelected legislators within a parliamentary system. Despite this, the NMP system remains a distinctive feature of [Singapore's political framework](/wiki/Politics_of_Singapore) not seen in traditional [Westminster system](/wiki/Westminster_system) styles of government. ## Background This article is part of a series on[Politics of Singapore](/wiki/Politics_of_Singapore)[Constitution](/wiki/Constitution_of_Singapore) - [Law](/wiki/Law_of_Singapore) - [Human rights](/wiki/Human_rights_in_Singapore) [Legislature](/wiki/Parliament_of_Singapore) - **[Parliament](/wiki/Parliament_of_Singapore)** - [Speaker](/wiki/Speaker_of_the_Parliament_of_Singapore) [Seah Kian Peng](/wiki/Seah_Kian_Peng) ([PAP](/wiki/People%27s_Action_Party)) - [Leader of the House](/wiki/Leader_of_the_House_(Singapore)) [Indranee Rajah](/wiki/Indranee_Rajah) ([PAP](/wiki/People%27s_Action_Party)) - [Leader of the Opposition](/wiki/Leader_of_the_Opposition_(Singapore)) [Pritam Singh](/wiki/Pritam_Singh_(Singaporean_politician)) ([WP](/wiki/Workers%27_Party_(Singapore))) - [14th Parliament](/wiki/14th_Parliament_of_Singapore) - [Constituencies](/wiki/Constituencies_of_Singapore) [Executive](/wiki/Government_of_Singapore#Composition) - **[President of Singapore](/wiki/President_of_Singapore)** ([list](/wiki/List_of_presidents_of_Singapore)) - [Tharman Shanmugaratnam](/wiki/Tharman_Shanmugaratnam) ([I](/wiki/Independent_politician)) - **[Prime Minister of Singapore](/wiki/Prime_Minister_of_Singapore)** - [Lawrence Wong](/wiki/Lawrence_Wong) ([PAP](/wiki/People%27s_Action_Party)) - [Cabinet](/wiki/Cabinet_of_Singapore) - [Ministries](/wiki/Organisation_of_the_Government_of_Singapore) - [The Reserves](/wiki/Reserves_of_the_Government_of_Singapore) [Judiciary](/wiki/Judicial_system_of_Singapore) - **[Supreme Court of Singapore](/wiki/Supreme_Court_of_Singapore)** - [Chief Justice](/wiki/Chief_Justice_of_Singapore) [Sundaresh Menon](/wiki/Sundaresh_Menon) - **[Court of Appeal](/wiki/Court_of_Appeal_of_Singapore)** - [Prakash](/wiki/Judith_Prakash) - [Tay](/wiki/Tay_Yong_Kwang) - [Chong](/wiki/Steven_Chong) - [Ang](/wiki/Belinda_Ang) - **[High Court](/wiki/High_Court_of_Singapore)** - [State Courts](/wiki/State_Courts_of_Singapore) [Elections](/wiki/Elections_in_Singapore) - [Presidential elections](/wiki/Presidential_elections_in_Singapore) - [General elections](/wiki/General_elections_in_Singapore) Singapore portal - [Other countries](/wiki/Outline_of_political_science#Politics_by_region) - v - t - e The introduction of NMPs in September 1990, effected to bring more independent voices into Parliament, was an important modification of the traditional [Westminster parliamentary system](/wiki/Westminster_system) that Singapore had. NMPs are appointed for a term of two and a half years on the recommendation of a [Special Select Committee](/wiki/Parliament_of_Singapore#Select_committees) chaired by the [speaker of Parliament](/wiki/Speaker_of_the_Parliament_of_Singapore). The Committee may nominate persons who have rendered distinguished public service or who have brought honour to Singapore, and also invites proposals of candidates from community groups in the fields of arts and letters, culture, the sciences, business, industry, the professions, social or community service, and the labour movement. In 2009, [Prime Minister](/wiki/Prime_Minister_of_Singapore) [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) proposed in Parliament that the Committee should also invite nominations from the civil society such as candidates from the environmental movement, young activists, new citizens, and community and grassroots leaders. In addition, the Committee must have regard to the need for NMPs to reflect as wide a range of independent and nonpartisan views as possible. In Parliament, NMPs can participate in debates and vote on all issues except amendments to the [Constitution](/wiki/Constitution_of_Singapore), [motions](/wiki/Motion_(parliamentary_procedure)) relating to public funds, [votes of no confidence](/wiki/Motion_of_no_confidence) in the [Government](/wiki/Government_of_Singapore), and removing the president from office. The NMP scheme has been criticised on the grounds that it is [undemocratic](/wiki/Democracy), and that unelected NMPs have no incentive to express the electorate's views in Parliament. It has also been claimed that the scheme reinforces the governing [People's Action Party](/wiki/People%27s_Action_Party)'s [technocratic](/wiki/Technocracy) and [elitist](/wiki/Elitism) view of politics. On the other hand, it is said that NMPs have placed pressure on PAP MPs to be more competent in Parliament. NMPs have made contributions to Singapore's political landscape. In 1996, the *Maintenance of Parents Act* (Cap. 167B, 1996 Rev. Ed.) became the first [public Act](/wiki/Public_bill) originating from a [private member's bill](/wiki/Private_member%27s_bill) initiated by an NMP, [Walter Woon](/wiki/Walter_Woon). During parliamentary debates, NMPs have also offered critical views on Government policies. The scheme was declared a success by the prime minister in 2009, and NMPs were made a permanent feature of Parliament – before this change, Parliament had to resolve within six months of every [election](/wiki/Parliamentary_elections_in_Singapore) whether NMPs should be appointed. ## Nominated Member of Parliament scheme ### Implementation A Nominated Member of Parliament (NMP) is a [Member of Parliament](/wiki/List_of_Singapore_MPs) (MP) who is not elected, but chosen by a committee of MPs. Introducing the NMP scheme was a progression of the plan by the [Government](/wiki/Government_of_Singapore), the first step of which was the introduction of the [Non-constituency Member of Parliament](/wiki/Non-constituency_Member_of_Parliament) (NCMP) scheme, to increase the number of non-government MPs to enable \"alternative views to be expressed and dissenting voices to be heard\". During a debate in [Parliament](/wiki/Parliament_of_Singapore) on 29 and 30 November 1989, the [First Deputy Prime Minister](/wiki/Prime_Minister_of_Singapore#List_of_deputy_prime_ministers) [Goh Chok Tong](/wiki/Goh_Chok_Tong) set out the Government's reasons for implementing the scheme. The NMP scheme was a move to provide more opportunities for [Singaporeans](/wiki/Singapore) to participate in politics. It was a \"privilege\" extended to Singaporeans who could make valuable contributions to public policy but for good reasons did not desire to enter politics and look after [constituencies](/wiki/Constituencies_of_Singapore). Women were mentioned as an example of people who might be more willing to become NMPs, as many have to handle their families and careers and therefore do not have much spare time. The aim of the scheme was to create a more \"consensual style of government where alternative views are heard and constructive dissent accommodated\". NMPs could play a constructive role in contributing to good governance that the Opposition and MPs of the ruling [People's Action Party](/wiki/People%27s_Action_Party) (PAP) could not provide. While PAP MPs had been encouraged to air opposing views, they were after all Government MPs and were not allowed to vote against the Government unless the [Whip](/wiki/Parliament_of_Singapore#Party_whip) was lifted. Moreover, there were very few Opposition MPs. According to Goh, the Opposition had not been constructive as their objective was to discredit the Government so that they could win office. In contrast, NMPs would not belong to any political party, and could therefore represent the views of people who did not identify themselves with the PAP or the Opposition. Thus, NMPs would be able to concentrate on the \"substance of the debate rather than form and rhetoric\", and provide dissenting and constructive views that would contribute to good government. Furthermore, with NMPs Parliament would be able to better represent the views of the people. While the ruling party attempted to represent the mainstream political opinion in Singapore and fielded as representative a range of candidates as possible during [general elections](/wiki/Parliamentary_elections_in_Singapore), it would inevitably not be able to succeed in completely representing every viewpoint. On the other hand, the Opposition MPs and NCMPs represented anti-establishment voters. Goh expressed the view that people who stood as Opposition candidates usually believed that having the PAP government was bad for Singapore and wished to oust the PAP. Therefore, the range of people likely to be elected to Parliament as Opposition MPs was limited. NMPs could represent the people who disagreed with the PAP but did not wish to oust them from government. Goh also pointed out that at least 20 other countries had nominated Members in their Houses of Representatives, while noting that each variant of the NMP system had to be tailored to the country in which it was implemented. The [bill](/wiki/Bill_(proposed_law)) for amending the [Constitution of the Republic of Singapore](/wiki/Constitution_of_Singapore) to implement the NMP scheme was introduced in Parliament and underwent its [First Reading](/wiki/Parliament_of_Singapore#Passage_of_bills_through_Parliament) on 6 October 1989. On 30 November 1989, the bill was read a second time, and referred to a [select committee](/wiki/Parliament_of_Singapore#Select_committees). The report of the select committee was presented to Parliament on 15 March 1990, and the bill read a third time and enacted as the Constitution of the Republic of Singapore (Amendment) Act 1990 on 29 March 1990. It came into force on 10 September 1990. ### Modifications From 1 September 1997, the maximum number of NMPs in Parliament was increased from six to nine. Introducing a [motion](/wiki/Motion_(parliamentary_procedure)) in Parliament for the second reading of the constitutional amendment bill that was eventually passed to effect the change, the [Minister for Home Affairs](/wiki/Ministry_of_Home_Affairs_(Singapore)) [Wong Kan Seng](/wiki/Wong_Kan_Seng) said that the NMP scheme was now well accepted by practically all MPs as it had proven its usefulness and worth. The Government intended to expand the scheme \"so that more NMPs can be in Parliament to air views which may not be canvassed by the PAP or by the Opposition. ... We are now proposing to increase the number of NMPs so that a wider cross-section of such views can be canvassed and expressed.\" In 2002, an NMP's term of office was extended from two to two and a half years. This was done to avoid the need to select NMPs three times if a particular Parliament lasted its full five-year term. In fact, during the Ninth Parliament, the NMPs had only served 17 days from 1 to 17 October 2001 and attended three sittings before Parliament was dissolved for the [2001 general election](/wiki/2001_Singaporean_general_election). NMPs were made a permanent feature of Parliament with effect from 1 July 2010. Prior to this change, Parliament had to decide within six months after every election whether to appoint NMPs. The rationale for the changes was given by Prime Minister Lee Hsien Loong in Parliament on 27 May 2009. According to him, the main motivation behind having NMPs as a permanent part of the system of government in Singapore was that the scheme had been a great success and had improved the quality of debate in the House: \"The scheme has worked well. The NMPs represent non-partisan alternative views in Parliament, and the NMPs have made effective contributions and raised the quality of debate in Parliament. Sometimes, if I may say so, they may have outshone even the Opposition MPs. This NMP scheme should be a permanent part of our political system.\" ## Appointment, term of office, and powers The Fourth Schedule of the Constitution sets out the process for the appointment of NMPs. A Special Select Committee chaired by the [Speaker of Parliament](/wiki/Speaker_of_the_Parliament_of_Singapore) and consisting of seven other MPs nominates not more than nine persons to be appointed as NMPs by the [president](/wiki/President_of_Singapore). The Committee may nominate persons who have rendered distinguished public service or who have brought honour to Singapore, and also invites the general public and groups in the community to submit the names of persons who may be considered for nomination by the Committee. These community groups are in the fields of arts and letters, culture, the sciences, business, industry, the professions, social or community service, and the labour movement. In 2009, [Prime Minister](/wiki/Prime_Minister_of_Singapore) [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) proposed in Parliament that the Committee should also invite nominations from the people sector such as candidates from the environmental movement, young activists, new citizens, and community and [grassroots](/wiki/Grassroots) leaders. He felt that \"[t]his will give civil society a voice in Parliament and encourage civil society to grow and to mature further\". In addition, nominees may be persons who have rendered distinguished public service or who have brought honour to Singapore, and the Committee must have regard to the need for NMPs to reflect as wide a range of independent and [non-partisan](/wiki/Nonpartisanism) views as possible. However, a person appointed as an NMP is not required to resign from any political party that he or she is a member of. When this issue was considered by a select committee of Parliament, it took the following view: > [T]o formally resign from membership in a political party cannot, in substance, change his political philosophy or his sympathy for the cause of that party. Nor need membership of a political party necessarily affect a person's objectivity. The usual term of office for an NMP is two and a half years from the date of appointment. NMPs must vacate their seats if they stand as candidates for any [political parties](/wiki/Political_parties_in_Singapore) in [elections](/wiki/Parliamentary_elections_in_Singapore), or if they are elected as MPs for any constituencies. In addition, like other MPs, an NMP ceases to be a Member of Parliament when Parliament is [dissolved](/wiki/Parliament_of_Singapore#Sessions), or in a number of situations specified in the Constitution such as ceasing to be a [Singapore citizen](/wiki/Singaporean_nationality_law), resignation or bankruptcy. NMPs can vote in Parliament on any bill or motion, except a bill to amend the Constitution; a [supply bill, supplementary supply bill or final supply bill](/wiki/Parliament_of_Singapore#Financial_control); a [money bill](/wiki/Money_bill); a [vote of no confidence](/wiki/Motion_of_no_confidence) in the Government; and removing the President from office. However, NMPs can still voice their opinions and join debates on the bills and motions they cannot vote on. ## Assessment During the Parliamentary debates that led to the introduction of the NMP scheme, it was argued by a number of PAP MPs such as Arthur Beng, [Tan Cheng Bock](/wiki/Tan_Cheng_Bock), [Dixie Tan](/wiki/Dixie_Tan), and [Aline Wong](/wiki/Aline_Wong) that the scheme is [undemocratic](/wiki/Democracy) in nature given the fact that NMPs are nominated rather than elected by the people for the people. However, in accordance with party discipline, they were eventually required to vote in favour of the constitutional amendment. As Beng said: \"This is the constraint upon us, and I guess I will have to continue to live a schizophrenic political life – speaking against, yet voting for a Bill.\" Secondly, it was argued by [Chiam See Tong](/wiki/Chiam_See_Tong), the [Leader of the Opposition](/wiki/Parliament_of_Singapore#Leader_of_the_Opposition), that since Singapore practices [representative democracy](/wiki/Representative_democracy_in_Singapore), NMPs are useless to the people as, being unelected, they have no incentive to present their views to Parliament. In other words, one should not enjoy the privilege of representing views without bearing the responsibility of serving those whom one represents. The Opposition perceived the scheme as a plan to make it look unnecessary. A similar point has been made by an academic, Chua Beng Huat, who has argued that the NMP scheme co-opts more moderate dissenting voices and is thus an attempt to de-legitimise the need for more aggressive opposition. From the beginning, the process of appointing NMPs has been weighted towards functional representation of discrete interests. For example, [Wong Kan Seng](/wiki/Wong_Kan_Seng), the [Leader of the House](/wiki/Parliament_of_Singapore#Leader_of_the_House), said in Parliament on 5 April 2002: > Over the years, we have ... improved the selection process by having proposal panels to nominate representatives of functional groups as NMPs. So, in 1997, apart from inviting the general public to submit the names of suitable persons, the Special Select Committee on NMPs wrote to organisations representing three major functional groups: (a) business and industry; (b) labour; and (c) the professions – to propose candidates for this Special Select Committee's consideration. At a sitting on 5th June 1997 ... I also said that the Government would consider further improving the NMP selection process, by expanding the number of functional groups invited to submit nominations. [Garry Rodan](/wiki/Garry_Rodan) has expressed the view that, in effect, the NMP scheme reinforces the PAP's [technocratic](/wiki/Technocracy) and [elitist](/wiki/Elitism) view of politics. In support of the scheme, NMP [Paulin Tay Straughan](/wiki/Paulin_Tay_Straughan) said in Parliament on 26 April 2010 that it neither compromises the democratic process nor perpetuates the dominance of the ruling party, because during elections Singaporeans vote for the political parties that best represent their interests and ideals, and the presence of NMPs in the House does not factor into this choice. In her view, NMPs add value to the discourse taking place in Parliament as they are able to \"explore and research the issues from all possible socially significant angles\" without constraint from \"partisan concerns\". She felt personally that she was accountable to all Singaporeans, rather than being unaccountable to anybody. In addition, Ho Khai Leong has opined that the presence of NMPs and their participation in Parliamentary debates have placed pressure on PAP MPs to be less complacent and to be more competent in Parliament. ## Suggestions for improvement [Non-constituency Member of Parliament](/wiki/Non-constituency_Member_of_Parliament) [Sylvia Lim](/wiki/Sylvia_Lim) has stated that it is the [Workers' Party](/wiki/Workers%27_Party_of_Singapore)'s position that the NMP scheme cannot be improved as it goes against the most fundamental democratic ideals of fair representation and elections. Despite such calls to do away entirely with the NMP system, there are also those who believe in the scheme and have raised points for its improvement. NMP [Viswa Sadasivan](/wiki/Viswa_Sadasivan) has expressed the view that the scheme serves a function and purpose in the current socio-political climate, though it should not be viewed as a permanent solution for Singapore. The scheme could evolve into a selection–election hybrid, or the selection process itself could become more transparent with clearer criteria on which candidates and selected NMPs alike could be assessed. It has also been recommended that fringe or minority groups should go through formal, mandatory elections to choose the representatives that will provide them with a voice in Parliament. Thereafter, they may be called \"elected representatives\". The Government may assist by providing guidelines for the conduct of proper elections. Furthermore, the maximum number of NMPs – nine – is said to be far too small to ensure proper representation of minority groups. Hence, it has been recommended that there should not be any limitation on the number of NMPs. ## NMPs The first two NMPs appointed with effect from 22 November 1990 were [cardiologist](/wiki/Cardiology) Professor Maurice Choo and company executive Leong Chee Whye. As of December 2010, one NMP – Professor [Walter Woon Cheong Ming](/wiki/Walter_Woon), a law lecturer at the [National University of Singapore](/wiki/National_University_of_Singapore) – had succeeded in having a [public law](/wiki/Public_bill) enacted based on a [private member's bill](/wiki/Private_member%27s_bill) he or she had initiated. The law in question is the Maintenance of Parents Act, which entitles parents at least 60 years old and unable to maintain themselves adequately to apply to a tribunal for their children to be ordered to pay maintenance to them. The bill was introduced in Parliament by Woon on 23 May 1994, and eventually passed on 2 November 1995. In that year, the first woman NMP, Dr. [Kanwaljit Soin](/wiki/Kanwaljit_Soin), also introduced a Family Violence Bill but it did not pass. Following his term as an NMP, [Gerard Ee](/wiki/Gerard_Ee), a [Roman Catholic](/wiki/Roman_Catholicism_in_Singapore), was invited in November 2002 to join a team of seven parliamentarians of different faiths tasked to refine the [Declaration of Religious Harmony](/wiki/Declaration_of_Religious_Harmony), which was presented as the product of interfaith dialogue and understanding. This is an example of how NMPs have influenced [soft law](/wiki/Soft_law) and the [legal culture](/wiki/Legal_culture) in Singapore. In 2009, the arts community became the first group among the functional groups that NMPs are meant to represent to undertake an open election process to pick the candidates of their choice. It choose Audrey Wong and [Loretta Chen](/wiki/Loretta_Chen), and submitted their names to the authorities. Audrey Wong was selected to become the first \"Arts\" NMP, and served from 2009 to 2011. In 2011, the arts community underwent the same process and elected [Janice Koh](/wiki/Janice_Koh) as its candidate. She was appointed an NMP in 2012. On 25 May 2009 during a debate in Parliament, Siew Kum Hong called for a hybrid Parliament in which a limited number of seats would be allocated by way of [proportional representation](/wiki/Proportional_representation), while the majority would still be filled the way they are now. He felt this would allow for more diverse views in Parliament, adding that it would be \"more consistent with democratic principles than a scheme like the Nominated MP scheme\". Siew also noted that while the act of voting was key to democracy and political participation, a large number of Singaporeans do not get to vote at each election because walkovers are prevalent. NMPs are supposed to be non-partisan but after it had been announced on 7 July 2009 that [Calvin Cheng](/wiki/Calvin_Cheng) would be one of the nine people nominated to be NMPs it was disclosed by *[Today](/wiki/Today_(Singapore_newspaper))* newspaper that he was a member of [Young PAP](/wiki/Young_PAP), the youth wing of the People's Action Party. The following day, Cheng wrote to the newspaper stating that he had formally resigned from Young PAP on 8 July, and that in any case he had been an inactive member, having never collected his membership card or attended any PAP branch activities. This led to a journalist commenting that his attitude had been \"cavalier\" and \"whimsical\", and a Young PAP member writing on the Forum page of *[The Straits Times](/wiki/The_Straits_Times)* that his remarks had raised doubts about the Young PAP's credibility. The Constitution does not explicitly bar NMPs from being members of political parties, and Gerard Ee was also a PAP member when he was an NMP. He did not feel he had to resign, as since he was not subject to the party whip he would not be prevented from expressing independent views in Parliament. Despite these initial criticisms, *[The Straits Times](/wiki/The_Straits_Times)* reported that Cheng \"left the strongest impression on many elected Members of Parliament\", following speeches he made during his maiden budget debate in Parliament in 2010. In his final speech during Budget 2011 before Parliament was dissolved for the [general election](/wiki/2011_Singaporean_general_election) that year, Cheng argued for the Government to educate the Internet generation instead of regulating the Internet to deal with threats such as \"misinformation and disinformation\", calling it \"pointless\". He went on to say that the Internet might be a \"wild card\" during the general election. On 18 August 2009, [Viswa Sadasivan](/wiki/Viswa_Sadasivan) moved a motion for Parliament to reaffirm \"its commitment to the nation building tenets as enshrined in the [National Pledge](/wiki/Singapore_National_Pledge) when debating national policies, especially economic policies\". He identified one of the tenets of the Pledge as the need to strive to become a \"united people, regardless of race, language or religion\", and expressed the view that Singaporean society needed to address \"apparent contradictions and mixed signals\" by unnecessarily emphasising racial differences. He gave examples where this had occurred: the existence of ethnic based self-help groups, [Special Assistance Plan](/wiki/Special_Assistance_Plan) schools and [cultural elitism](/wiki/Ethnocentrism); policies concerning Malay-Muslims in the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces) and maintaining the current racial distribution in the population; and discussions about whether Singapore was ready for an ethnic minority Prime Minister. The next day, [Minister Mentor](/wiki/Minister_Mentor) [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) refuted what he termed Viswa's \"false and flawed\" arguments, saying he wanted to \"bring the House back to earth\" on the issue of racial equality in Singapore. He noted that Articles 152 and 153 of the Constitution, which make it the Government's responsibility to care for racial and religious minorities and to recognise the special position of Malays as the indigenous people of Singapore, explicitly impose a duty on the Government not to treat everyone equally. He felt that the tenet in the Pledge that Viswa had referred to was only an aspiration: \"It is not reality, it is not practical, it will lead to grave and irreparable damage if we work on that principle. ... [W]e are trying to reach a position where there is a level playing field for everybody which is going to take decades, if not centuries, and we may never get there.\" Thus, it was not feasible to dismantle institutions that provided assistance to Singaporeans on an ethnic basis. It was the first time since 2007 that Lee had chosen to speak during a debate in Parliament. ### NMPs turning partisan In 2025, two NMPs, Raj Joshua Thomas and [Syed Harun Alhabsyi](/wiki/Syed_Harun_Alhabsyi) both resigned on 14 February. Their resignations were the first for any NMPs since it was introduced. Both NMPs, in their resignation letters, hinted that they would be joining political parties. This led to former NMPs raising concerns that the NMP scheme should not be another talent hunting ground for political parties and in preserving the non-partisan intent of the scheme, NMPs should finish their NMP term before joining any political parties. [Law Minister](/wiki/Ministry_of_Law_(Singapore)) [K. Shanmugam](/wiki/K._Shanmugam) said that the [Constitution](/wiki/Constitution_of_Singapore) provided for NMP to join political parties after their term. As of April, Thomas had joined the PAP while Syed Harun did not confirm he had joined the PAP. On 17 April, Thomas announced that he will not be running in the [2025 general election](/wiki/2025_Singaporean_general_election). On 3 May, Syed Harun was elected as an MP representing [Nee Soon GRC](/wiki/Nee_Soon_GRC) as part of the PAP. List of NMPs**7th Parliament (22 November 1990 – 13 August 1991)** - Maurice **Choo** - **Leong** Chee Whye **8th Parliament (7 September 1992 – 6 September 1994)** - **Chia** Shi Teck - Robert **Chua** Teck Chew - [Kanwaljit **Soin**](/wiki/Kanwaljit_Soin) - **Toh** Keng Kiat - **Tong** Kok Yeo - [Walter **Woon** Cheong Ming](/wiki/Walter_Woon) **8th Parliament (7 September 1994 – 15 December 1996)** - John **De Payva** - [**Imram** bin Mohamed](/wiki/Imram_bin_Mohamed) - Stephen **Lee** Ching Yen - **Lee** Tsao Yuan - Kanwaljit **Soin** - Walter **Woon** Cheong Ming **9th Parliament (1 October 1997 – 30 September 1999)** - [Claire **Chiang** See Ngoh](/wiki/Claire_Chiang) - **Chuang** Shaw Peng - [Gerard **Ee** Hock Kim](/wiki/Gerard_Ee) - **Lee** Tsao Yuan - Shriniwas **Rai** - Cyrille **Tan** Soo Leng - **Tay** Beng Chuan - [Simon **Tay** Seong Chee](/wiki/Simon_Tay) - **Zulkifli** B. Baharudin **9th Parliament (1 October 1999 – 30 September 2001)** - [Claire **Chiang** See Ngoh](/wiki/Claire_Chiang) - [Gerard **Ee** Hock Kim](/wiki/Gerard_Ee) - **Goh** Chong Chia - Jennifer **Lee** Gek Choo - Noris **Ong** Chin Guan - **Tay** Beng Chuan - Simon **Tay** Seong Chee - [Thomas **Thomas**](/wiki/Thomas_Thomas_(trade_unionist)) - **Zulkifli** B. Baharudin **9th Parliament (1–17 October 2001)** - **Goh** Chong Chia - Jennifer **Lee** Gek Choo - Braema **Mathiaparanam** - Chandra Mohan K. **Nair** - Noris **Ong** Chin Guan - **Tay** Beng Chuan - Simon **Tay** Seong Chee - Thomas **Thomas** **[10th Parliament](/wiki/10th_Parliament_of_Singapore) (2 July 2002 – 1 January 2005)** - **Fang** Ai Lian - **Gan** See Khem - Jennifer **Lee** Gek Choo - [Olivia **Lum** Ooi Lin](/wiki/Olivia_Lum) - Braema **Mathiaparanam** - Chandra Mohan K. **Nair** - A. Nithiah **Nandan** - [**Ng** Ser Miang](/wiki/Ng_Ser_Miang) - [**Ngiam** Tee Liang](/wiki/Ngiam_Tee_Liang) **10th Parliament (2 January 2005 – 19 April 2006)** - Alexander **Chan** Meng Wah - [**Geh** Min](/wiki/Geh_Min) - Lawrence **Leow** Chin Hin - **Loo** Choon Yong - [Eunice Elizabeth **Olsen**](/wiki/Eunice_Olsen) - [**Ong** Soh Khim](/wiki/Ong_Soh_Khim) - [Ivan **Png** Paak Liang](/wiki/Ivan_Png_Paak_Liang) - **Tan** Sze Wee - **Teo** Yock Ngee **[11th Parliament](/wiki/11th_Parliament_of_Singapore) (18 January 2007 – 17 July 2009)** - Gautam **Banerjee** - **Cham** Hui Fong - Edwin **Khew** Teck Fook - **Loo** Choon Yong - Kalyani K. **Mehta** - Eunice Elizabeth **Olsen** - Jessie **Phua née Wong** Wai Chan - **Siew** Kum Hong - [**Thio** Li-ann](/wiki/Thio_Li-ann) **11th Parliament (18 July 2009 – 19 April 2011)** - [Calvin **Cheng** Ern Lee](/wiki/Calvin_Cheng) - Terry **Lee** Kok Hua - [**Viswaroopan** s/o Sadasivan](/wiki/Viswa_Sadasivan) - Mildred **Tan-Sim** Beng Mei - [Paulin **Tay Straughan**](/wiki/Paulin_Tay_Straughan) - **Teo** Siong Seng - Laurence **Wee** Yoke Thong - Audrey **Wong** Wai Yen - [Joscelin **Yeo** Wei Ling](/wiki/Joscelin_Yeo) **[12th Parliament](/wiki/12th_Parliament_of_Singapore) (14 February 2012 – 13 August 2014)** - Ramasamy **Dhinakaran** - [**Faizah** binte Haji Ahmad Jamal](/wiki/Faizah_Jamal) - Nicholas **Fang** Kuo Wei - [Janice **Koh** Yu-Mei](/wiki/Janice_Koh) - Laurence **Lien** Tsung Chern - Mary **Liew** Kiah Eng - [Eugene **Tan** Kheng Boon](/wiki/Eugene_Tan) - [**Tan** Su Shan](/wiki/Tan_Su_Shan) - **Teo** Siong Seng **12th Parliament (26 August 2014 – 25 August 2015)** - [**Chia** Yong Yong](/wiki/Chia_Yong_Yong) - Thomas **Chua** Kee Seng - **Karthikeyan** s/o R. Krishnamurthy - **Kuik** Shiao-Yin - **Mohd. Ismail** bin Hussein - Rita **Soh** Siow Lan - Benedict **Tan** Chi'-Loong - Randolph **Tan** Gee Kwang - [**Tan** Tai Yong](/wiki/Tan_Tai_Yong) **[13th Parliament](/wiki/13th_Parliament_of_Singapore) (22 March 2016 – 21 September 2018)** - **Azmoon** Ahmad - [**Chia** Yong Yong](/wiki/Chia_Yong_Yong) - Thomas **Chua** Kee Seng - **Ganesh** Rajaram - [**Kok** Heng Leun](/wiki/Kok_Heng_Leun) - **Kuik** Shiao-Yin - Mahdev **Mohan** - Randolph **Tan** Gee Kwang - [K. **Thanaletchimi**](/wiki/K._Thanaletchimi) **[13th Parliament](/wiki/13th_Parliament_of_Singapore) (22 September 2018 – 23 June 2020)** - **Arasu** Duraisamy - [Douglas **Foo** Peow Yong](/wiki/Douglas_Foo) - **Ho** Wee San - **Lim** Sun Sun - Abbas Ali Mohamed **Irshad** - [Anthea **Ong** Lay Theng](/wiki/Anthea_Ong) - Irene **Quay** Siew Ching - Walter Edgar **Theseira** - [**Yip** Pin Xiu](/wiki/Yip_Pin_Xiu) **[14th Parliament](/wiki/14th_Parliament_of_Singapore) (21 January 2021 – 23 July 2023)** - Abdul **Samad** Abdul Wahab - Janet **Ang** Guat Har - [Mark **Chay**](/wiki/Mark_Chay) - **Cheng** Hsing Yao - **Hoon** Hian Teck - [**Koh** Lian Pin](/wiki/Koh_Lian_Pin) - Joshua Thomas **Raj** - **Shahira** Abdullah - **Tan** Yia Swam **[14th Parliament](/wiki/14th_Parliament_of_Singapore) (24 July 2023 – 15 April 2025)** - **Chandradas** Usha Ranee - **Chua** Tiang Choon Keith - Mark **Lee** Kean Phi - **Ong** Hua Han - **Parekh** Nimil Rajnikant - Joshua Thomas **Raj** (resigned 14 Feb 2025) - **Razwana** Begum Abdul Rahim - [Jean **See** Jinli](/wiki/Jean_See) - [Syed **Harun** Taha Alhabsyi](/wiki/Syed_Harun_Alhabsyi) (resigned 14 Feb 2025) **[15th Parliament](/wiki/15th_Parliament_of_Singapore) (from 8 January 2026)** - **Azhar** Othman - Kenneth **Goh** Toh Chuan - **Haresh** Singaraju - Terence **Ho** Wai Luen - **Kuah** Boon Theng - Mark **Lee** Kean Phi - **Neo** Kok Beng - Kenneth **Poon** Kin Loong - **Sanjeev** Kumar Tiwari Dates indicate the NMPs' terms of office. The names in bold are surnames, or the personal names of NMPs who do not have surnames. A name struck through indicates that the NMP resigned before the end of their term. ## Notes ### Articles and websites [Constitution of the Republic of Singapore](/wiki/Constitution_of_Singapore) (1985 Rev. Ed., 1999 Reprint). - Lua, Ee Laine; Sim, Disa Jek Sok; Koh, Christopher Theng Jer (1996), \"Principles and Practices of Voting: The Singapore Electoral System\", *Singapore Law Review*, **17**: 244–321 at 267–270. - Rodan, Garry (2009), \"New Modes of Political Participation and Singapore's Nominated Members of Parliament\" (PDF), *Government and Opposition*, **44** (4): 438, [doi](/wiki/Doi_(identifier)):10.1111/j.1477-7053.2009.01297.x. - Tan, Eugene; Chan, Gary (13 April 2009), \"The Legislature\", *The Singapore Legal System*, SingaporeLaw.sg, [Singapore Academy of Law](/wiki/Singapore_Academy_of_Law), archived from the original on 17 October 2010, retrieved 1 December 2010. - Winslow, Valentine S. (1984), \"Creating a Utopian Parliament: The Constitution of the Republic of Singapore (Amendment) Act 1984; the Parliamentary Elections (Amendment) Act 1984\", *Malaya Law Review*, **28**: 268–274. ### Books - Chan, Helena H[ui-]M[eng] (1995), \"Parliament and Law Making\", *The Legal System of Singapore*, Singapore: [Butterworths Asia](/wiki/LexisNexis_Butterworths), pp. 41–68, [ISBN](/wiki/ISBN_(identifier)) 978-0-409-99789-7. - *Report of the Select Committee on the Constitution of the Republic of Singapore (Amendment No. 2) Bill (Bill No. 41/89) [Parl. 4 of 1990]*, Singapore: [Government of Singapore](/wiki/Government_of_Singapore), 1990, [OCLC](/wiki/OCLC_(identifier)) 35566184. - Tan, Kevin Y[ew] L[ee] (2011), \"Making Law: Parliament\", *An Introduction to Singapore's Constitution* (rev. ed.), Singapore: Talisman Publishing, pp. 33–60 at 55–56, [ISBN](/wiki/ISBN_(identifier)) 978-981-08-6456-9. - Tan, Kevin Y[ew] L[ee]; [Thio, Li-ann](/wiki/Thio_Li-ann) (2010), \"The Legislature\", *Constitutional Law in Malaysia and Singapore* (3rd ed.), Singapore: [LexisNexis](/wiki/LexisNexis), pp. 299–360 at 323–324, [ISBN](/wiki/ISBN_(identifier)) 978-981-236-795-2. - Thio, Li-ann (2012), \"The Legislature and the Electoral System\", *A Treatise on Singapore Constitutional Law*, Singapore: [Academy Publishing](/wiki/Singapore_Academy_of_Law), pp. 285–359 at 308–311, [ISBN](/wiki/ISBN_(identifier)) 978-981-07-1515-1. - Official website of the Parliament of Singapore\n",
  "language": "en",
  "processed_at": "2026-01-12T11:37:59.739199",
  "title": "Nominated Member of Parliament",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Nominated_Member_of_Parliament"
}