{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:38:02.281637"
  },
  "content": "MP without constituency in Singapore A **Non-constituency Member of Parliament** (**NCMP**)[a] is a member of an [opposition political party in Singapore](/wiki/Opposition_political_party_in_Singapore) who, as stipulated in Article 39 of the [Constitution](/wiki/Constitution_of_Singapore) and the Parliamentary Elections Act, is declared to have been elected a [Member of Parliament](/wiki/Parliament_of_Singapore) (MP) without constituency representation, despite having lost in a [general election](/wiki/Parliamentary_elections_in_Singapore). To receive the status, they need to have obtained one of the highest vote shares among defeated opposition candidates. NCMPs enjoy all of the privileges of ordinary members of Parliament, apart from the salary, which is substantially lower. The NCMP scheme is a unique feature not seen in traditional [Westminster system](/wiki/Westminster_system) styles of government. The number of NCMPs seats in Singapore has been progressively raised since the scheme's introduction in 1984, starting with a cap of three, increased to six in 1997, nine in 2010 and finally twelve in 2016. On 19 May 2025, the [Elections Department](/wiki/Elections_Department_Singapore) (ELD) announced the appointment of [Andre Low](/wiki/Andre_Low) and [Eileen Chong](/wiki/Eileen_Chong_(politician)) as NCMPs. Both stood as candidates for the [Workers' Party](/wiki/Workers%27_Party_(Singapore)) (WP) in the [2025 general election](/wiki/2025_Singaporean_general_election), Low in [Jalan Kayu SMC](/wiki/Jalan_Kayu_Single_Member_Constituency) and Chong as part of the WP team contesting in [Tampines GRC](/wiki/Tampines_Group_Representation_Constituency) respectively. As the highest-scoring opposition candidates who were not elected, their appointments filled the final two slots of the twelve available under the NCMP scheme, as their party won ten elected seats during the election. ## Overview This article is part of a series on[Politics of Singapore](/wiki/Politics_of_Singapore)[Constitution](/wiki/Constitution_of_Singapore) - [Law](/wiki/Law_of_Singapore) - [Human rights](/wiki/Human_rights_in_Singapore) [Legislature](/wiki/Parliament_of_Singapore) - **[Parliament](/wiki/Parliament_of_Singapore)** - [Speaker](/wiki/Speaker_of_the_Parliament_of_Singapore) [Seah Kian Peng](/wiki/Seah_Kian_Peng) ([PAP](/wiki/People%27s_Action_Party)) - [Leader of the House](/wiki/Leader_of_the_House_(Singapore)) [Indranee Rajah](/wiki/Indranee_Rajah) ([PAP](/wiki/People%27s_Action_Party)) - [Leader of the Opposition](/wiki/Leader_of_the_Opposition_(Singapore)) [Pritam Singh](/wiki/Pritam_Singh_(Singaporean_politician)) ([WP](/wiki/Workers%27_Party_(Singapore))) - [14th Parliament](/wiki/14th_Parliament_of_Singapore) - [Constituencies](/wiki/Constituencies_of_Singapore) [Executive](/wiki/Government_of_Singapore#Composition) - **[President of Singapore](/wiki/President_of_Singapore)** ([list](/wiki/List_of_presidents_of_Singapore)) - [Tharman Shanmugaratnam](/wiki/Tharman_Shanmugaratnam) ([I](/wiki/Independent_politician)) - **[Prime Minister of Singapore](/wiki/Prime_Minister_of_Singapore)** - [Lawrence Wong](/wiki/Lawrence_Wong) ([PAP](/wiki/People%27s_Action_Party)) - [Cabinet](/wiki/Cabinet_of_Singapore) - [Ministries](/wiki/Organisation_of_the_Government_of_Singapore) - [The Reserves](/wiki/Reserves_of_the_Government_of_Singapore) [Judiciary](/wiki/Judicial_system_of_Singapore) - **[Supreme Court of Singapore](/wiki/Supreme_Court_of_Singapore)** - [Chief Justice](/wiki/Chief_Justice_of_Singapore) [Sundaresh Menon](/wiki/Sundaresh_Menon) - **[Court of Appeal](/wiki/Court_of_Appeal_of_Singapore)** - [Prakash](/wiki/Judith_Prakash) - [Tay](/wiki/Tay_Yong_Kwang) - [Chong](/wiki/Steven_Chong) - [Ang](/wiki/Belinda_Ang) - **[High Court](/wiki/High_Court_of_Singapore)** - [State Courts](/wiki/State_Courts_of_Singapore) [Elections](/wiki/Elections_in_Singapore) - [Presidential elections](/wiki/Presidential_elections_in_Singapore) - [General elections](/wiki/General_elections_in_Singapore) Singapore portal - [Other countries](/wiki/Outline_of_political_science#Politics_by_region) - v - t - e ### Rationale The Non-constituency Member of Parliament (NCMP) scheme was introduced to the Singapore Parliament on 30 June 1984. The scheme was first proposed by first organising [People's Action Party](/wiki/People%27s_Action_Party) (PAP) secretary [Goh Chok Tong](/wiki/Goh_Chok_Tong) a month prior, as part of plans to ensure opposition voices in parliament. During the [Second Reading](/wiki/Reading_(legislature)#Second_reading) of the NCMP bill in July 1984, prime minister [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) formally presented to Parliament three main justifications for the NCMP scheme. First, he said that having a minimum number of opposition members in Parliament through the NCMP scheme would provide younger PAP MPs with sparring partners to \"sharpen their debating skills\". Secondly, the presence of opposition members in Parliament would educate the younger generation of voters about the role of a constitutional opposition and the limits of what it can do. He said this was especially important because the younger generation who had not lived and witnessed the conflicts within Parliament in the 1950s and 1960s \"harbour[ed] myths about the role of an Opposition\" and \"had no idea how destructive an Opposition could be\". Thirdly, the presence of non-PAP MPs in Parliament would act as a check and balance against any governmental impropriety. According to Lee, \"some non-PAP MPs will ensure that every suspicion, every rumour of misconduct, will be reported to the non-PAP MPs\". The readiness of non-PAP members to bring forth any allegation of misfeasance, or corruption, or nepotism would \"dispel suspicions of cover-ups of alleged wrongdoings\". More importantly, the NCMP scheme was introduced to \"ensure the representation in Parliament of a minimum number of Members from a political party or parties not forming the Government\". The PAP possessed \"unbroken hegemony\" in Parliament from 1968 until 1981 when [J. B. Jeyaretnam](/wiki/J._B._Jeyaretnam) won a seat in the [Anson](/wiki/1981_Anson_by-election) [by-election](/wiki/By-elections_in_Singapore). As a result of his sole opposition presence in the Parliament, he could not initiate a meaningful debate in Parliament, being unable to find another MP to second his motions. The fact that there was absolutely no opposition representation in Parliament in the four general elections before 1984 (as indicated in the table below) added to the impetus for the inception of the scheme. Year of general electionPercentage of votes won by the PAPPercentage of votes won by the oppositionNumber of seats won by the PAPNumber of seats won by the opposition(/wiki/1968_Singaporean_general_election)86.7%13.3%580(/wiki/1972_Singaporean_general_election)70.4%29.6%650(/wiki/1976_Singaporean_general_election)74.1%25.9%690(/wiki/1980_Singaporean_general_election)77.7%22.3%750 ### Responses Since its introduction, the NCMP scheme received mixed responses. Supporters viewed it as a pragmatic step toward greater political openness, allowing alternative voices in Parliament without disrupting the stability provided by the PAP's dominance. Critics, however, argued that it was a token gesture that undermined genuine [electoral competition](/wiki/Electoral_competition) and discouraged voters from electing opposition candidates, since opposition figures could still enter Parliament without winning at the polls. Some opposition parties, such as the [Workers' Party](/wiki/Workers%27_Party_of_Singapore) (WP) and [Singapore Democratic Party](/wiki/Singapore_Democratic_Party) (SDP), also viewed the scheme with suspicion, seeing it as a way for the ruling party to control the pace of political liberalisation while maintaining its grip on power. When the NCMP scheme was first offered after the [1984 general election](/wiki/1984_Singaporean_general_election), the best-performing losing opposition candidates – M.P.D. Nair of the WP and Tan Chee Kien of the [Singapore United Front](/wiki/Singapore_United_Front) (SUF) – declined the position. Both their parties had viewed the scheme with suspicion and argued that it served to entrench the PAP's dominance while offering only symbolic representation, since NCMPs were not able to represent residents' views and vote on several matters. Nevertheless, in [the subsequent election](/wiki/1988_Singaporean_general_election) held in 1988, [Francis Seow](/wiki/Francis_Seow) and [Lee Siew Choh](/wiki/Lee_Siew_Choh) of WP became the first candidates to accept the NCMP seats when they contested as part of the WP team in the [Eunos Group Representation Constituency](/wiki/Eunos_Group_Representation_Constituency) (GRC). Nevertheless, the NCMP scheme continued to be a subject of criticism, both within the PAP and among opposition MPs and [Nominated Members of Parliament](/wiki/Nominated_Member_of_Parliament) (NMPs). During parliamentary debates in April 2010 on increasing the number of NCMPs from six to nine, several MPs expressed dissatisfaction with what they called the lack of legitimacy and anti-democratic nature of the NCMP concept. For instance, PAP MP [Alvin Yeo](/wiki/Alvin_Yeo) expressed doubts as to whether the NCMP scheme had served to raise the level of debate in Parliament, while NMP [Calvin Cheng](/wiki/Calvin_Cheng) said: > [P]eople who are proposed to be NCMPs are politicians who stood for an election and lost. Sir, they lost. They lost. I do not know how much more emphatic I can be about this. These are politicians who have stood on certain political platforms, for certain political issues and the majority of the electorate have considered these issues, these politicians and have rejected them at the polls. To then allow them into Parliament flies in the face of the logic of a democratic election at best and, at worst, is a slap in the face to the people who have voted against them. The opposition has, from the introduction of the NCMP scheme, decried it as a \"sham\" and a \"toothless\" office. Opposition member J. B. Jeyaratnam questioned whether it was \"a trick or a ploy\" by the ruling party to maintain its dominance in Parliament. It has been argued that the system has placed the opposition at a disadvantage at general elections for a number of reasons. For one, there are restrictions on NCMPs as to what they can or cannot vote on in Parliament. Thus, it has been suggested that the presence of NCMPs in Parliament \"does not seem to extend beyond the decorative and the provision of debating foils for the younger PAP generation unexposed to the gladiatorial quality of parliamentary debate\". Moreover, the effectiveness of the NCMP scheme is limited by the perception that the NCMP is obliged to be adversarial by virtue of being party to the opposition. This is so even if privately the Member can apprehend the benefits of a Government proposal. Finally, the NCMP scheme has been criticised as a ploy to discourage voters from voting in opposition MPs because of the guarantee of at least a number of NCMP seats. This inhibits the natural growth of an elected opposition voice in Parliament as the electorate's motivation to vote in an opposition Member into Parliament is conceivably diluted by the assurance that a default mechanism exists for the \"best losers\". During the 2010 debates, [Sylvia Lim](/wiki/Sylvia_Lim), then the sole NCMP in Parliament, commented that having NCMPs \"make[s] a bad situation better, but increasing NCMPs is not the solution towards a more robust political system\". She identified an NCMP's lack of any official capacity to represent the people or write letters on their behalf as a drawback of the scheme. Moreover, an NCMP has no physical base to organize activities or dialogues with the people. In her view, it would be better for [politics in Singapore](/wiki/Politics_of_Singapore) if the NCMP scheme was regarded merely as a \"stop-gap measure\" to deal with the lack of alternative voices in Parliament as a result of the ruling party's alleged abuse of the GRC system and [gerrymandering](/wiki/Gerrymandering). In 2011, WP's [Low Thia Khiang](/wiki/Low_Thia_Khiang) had cited an NCMP's lack of \"muscle and real grassroot[s] grounding\" as a reason for his refusal to take up an NCMP seat if offered. NCMPs do not represent any constituency and are thus denied of opportunities to expand their influence. In 2011, during a live television forum, Prime Minister [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) refuted claims that NCMPs were not a \"real opposition\" by stating that the PAP had introduced and expanded the scheme \"because it acknowledged both the desire among Singaporeans for alternative voices and the need for an opposition to represent the diverse views in society\". He noted that NCMPs were free to debate issues in Parliament, and that the scheme provided opposition politicians with an opportunity to \"establish themselves and strengthen their positions in subsequent general elections\". ## Position of NCMP A Non-constituency Member of Parliament (\"NCMP\") is a candidate of an opposition [political party](/wiki/List_of_political_parties_in_Singapore) who, despite having lost in a [general election](/wiki/Parliamentary_elections_in_Singapore), is declared elected as a Member of the [Parliament of Singapore](/wiki/Parliament_of_Singapore) (\"MP\") by virtue of provisions in the [Constitution](/wiki/Constitution_of_Singapore) and the Parliamentary Elections Act enabling the unsuccessful candidates who have performed the best to be accorded the status. The NCMP does not represent any [constituency](/wiki/Constituencies_of_Singapore) (or electoral division) in Parliament. The NCMP scheme was introduced on 22 August 1984 by the Constitution of the Republic of Singapore (Amendment) Act 1984 and the Parliamentary Elections (Amendment) Act 1984. Under Article 39(1)(b) of the Constitution which was introduced by the constitutional amendment Act, the maximum number of NCMPs was set at six. However, the actual number that could be declared elected at any general election was fixed at three, less the total number of Opposition MPs elected to Parliament. The [President](/wiki/President_of_Singapore), acting on the advice of the [Cabinet](/wiki/Cabinet_of_Singapore), could order that between four and six NCMPs be declared elected for the purpose of a particular general election. Such an order ceased to have effect at the next [dissolution of Parliament](/wiki/Parliament_of_Singapore#Sessions). On 1 July 2010, the need for a presidential order to increase the number of NCMPs was removed. Instead, the maximum number of NCMPs in Parliament was increased from six to nine, and the actual number that would be declared elected following a general election would be nine sans the number of opposition MPs elected to Parliament. On 9 November 2016, a bill to amend the Constitution was passed to increase the maximum number of NCMPs from nine to 12, and to confer upon NCMPs the same voting powers as elected MPs. NCMPs could exercise their enhanced voting powers with effect from 1 April 2017, while the procedure for electing up to 12 NCMPs after a general election was brought into effect on 2 January 2019. ### Becoming an NCMP NCMPs have been called the \"best losers\" of each general election. As NCMPs are declared elected from candidates who fail to win at general elections, they are subject to the same qualifying criteria as elected MPs: - They must be [Singapore citizens](/wiki/Singaporean_nationality_law) aged 21 or above. - Their names must appear in a current register of electors. - They must have been residents of Singapore for at least ten years. - They must be able to speak, read and write in at least one of the four official languages (English, [Malay](/wiki/Malay_language), [Mandarin](/wiki/Standard_Chinese) and [Tamil](/wiki/Tamil_language)). - They must not be disqualified under Article 45 of the Constitution. The Constitution and the Parliamentary Elections Act provide for a maximum of 12 NCMPs in Parliament. After the polling results for a general election have been released, the opposition candidates receiving the highest percentage of votes in their [electoral divisions](/wiki/Constituencies_of_Singapore) but not elected into Parliament will be offered NCMP seats. However, this is subject to several conditions. There must be fewer than 12 opposition members voted into Parliament, and the candidate must have garnered at least 15% of the total number of votes polled at the election in the contested electoral division. In addition, there can be no more than two NCMPs from one [Group Representation Constituency](/wiki/Group_Representation_Constituency) (\"GRC\") and no more than one NCMP from an electoral division that is not a GRC (that is, a [Single Member Constituency](/wiki/Single-member_district) or SMC). If the number of opposition candidates elected is fewer than 12, losing opposition candidates who have the highest percentage of votes during the election will be declared elected as NCMPs to make up the minimum number of opposition MPs. Hence, the number of NCMP seats offered is 12 minus the number of elected opposition MPs. In the event that a group of candidates contesting in a GRC is offered an NCMP seat, the group must decide within seven days the person or persons to be declared elected as NCMPs and notify the [returning officer](/wiki/Returning_officer#Singapore). Elected NCMP must take an oath of allegiance to Singapore and to \"preserve, protect and defend the Constitution of the Republic of Singapore\". If this is not done at the first or second sitting of Parliament during its first session after the general election, Parliament may by resolution declare that the NCMP's seat has become vacant and that it will be filled by the next succeeding eligible candidate at the general elections, the candidates having priority based on the percentage of votes polled by them. Opposition members who qualify to become NCMPs are allowed to reject their seats in Parliament, as it was the case first seen since [2011 general election](/wiki/2011_Singaporean_general_election), several opposition leaders stated that they would not want to accept NCMP seats, such as [Low Thia Khiang](/wiki/Low_Thia_Khiang), then the Secretary-General of the [Workers' Party](/wiki/Workers%27_Party_(Singapore)), and former PAP MP and [Progress Singapore Party](/wiki/Progress_Singapore_Party) founder [Tan Cheng Bock](/wiki/Tan_Cheng_Bock). Low was re-elected in [Aljunied GRC](/wiki/Aljunied_GRC) in the ensuing [2011 election](/wiki/2011_Singaporean_general_election); Tan lost the election by a narrow margin in [West Coast GRC](/wiki/West_Coast_GRC) in the [2020 election](/wiki/2020_Singaporean_general_election) and subsequently selected two of their fellow team members, [Leong Mun Wai](/wiki/Leong_Mun_Wai) and [Hazel Poa](/wiki/Hazel_Poa), as their NCMPs. There are two such situations to date where the offer was rejected, one after the [1984 election](/wiki/1984_Singaporean_general_election), and former [Punggol East SMC](/wiki/Punggol_East_SMC) MP [Lee Li Lian](/wiki/Lee_Li_Lian) after the (/wiki/2015_Singaporean_general_election) election. ### Parliamentary role Before 1 April 2017, NCMPs could engage in debate in Parliament and were allowed to vote on all bills except the following: - Amendments to the Constitution. - Any [motion](/wiki/Motion_(parliamentary_procedure)) pertaining to a [bill](/wiki/Bill_(proposed_law)) to amend a supply bill, supplementary supply bill or final supply bill. (These are bills authorizing the [Government](/wiki/Government_of_Singapore) to expend public money.) - Any motion pertaining to a Bill to amend a [money bill](/wiki/Money_bill). - A [motion of no confidence](/wiki/Motion_of_no_confidence) in the Government. - Removal of the President from office. With effect from that date, they were conferred the same voting rights as elected MPs. ## Allocation In the [1984 general election](/wiki/1984_Singaporean_general_election), the first held after the NCMP scheme was introduced, as the opposition MPs J. B. Jeyaretnam of the WP and [Chiam See Tong](/wiki/Chiam_See_Tong) of the [Singapore Democratic Party](/wiki/Singapore_Democratic_Party) were elected to Parliament, the single NCMP seat available was allocated to the WP's M. P. D. Nair. However, the WP decided that its defeated candidates should not take up NCMP seats. Jeyaretnam, the WP's Secretary-General, said that the \"real object\" behind the scheme was to persuade the electorate to return the PAP to all the seats in Parliament, which was \"the antithesis of what Parliament is\". The NCMP seat was then allocated to Tan Chee Kien of the [Singapore United Front](/wiki/Democratic_Progressive_Party_(Singapore)), but his party also decided to reject the seat. This was regarded as a \"resignation\", and the NCMP seat was thus not filled. The first NCMP to take up a seat in Parliament, [Lee Siew Choh](/wiki/Lee_Siew_Choh) of the WP, did so following the [1988 general election](/wiki/1988_Singaporean_general_election) at which Chiam See Tong was the only opposition MP elected. The WP's Lee and [Francis Seow](/wiki/Francis_Seow) were declared elected as NCMPs on 16 September 1988. However, on 9 January 1989 the [Speaker of Parliament](/wiki/Speaker_of_the_Parliament_of_Singapore) [Tan Soo Khoon](/wiki/Tan_Soo_Khoon) announced that Seow had lost his seat with effect from 17 December 1988 under Article 45 of the Constitution after he was convicted and fined for tax evasion. In the [general election that followed in 1991](/wiki/1991_Singaporean_general_election), a special provision was made for four instead of three NCMP seats, but none were offered because four opposition members were successful in their respective electoral divisions. In the [1997 general election](/wiki/1997_Singaporean_general_election), number of NCMP seats reverted to three. After two opposition members were elected, one NCMP seat was offered to, and accepted by, J. B. Jeyaratnam. He was declared elected with effect from 14 January 1997. Subsequently, with effect from 23 July 2001, Jeyaretnam fell into bankruptcy due to an unpaid debt and thus lost his seat in Parliament. In the [2001 general election](/wiki/2001_Singaporean_general_election), only one NCMP seat was offered to [Chua Chu Kang SMC](/wiki/Chua_Chu_Kang_SMC)'s candidate [Steve Chia](/wiki/Steve_Chia) of the [Singapore Democratic Alliance](/wiki/Singapore_Democratic_Alliance), who won 34.66% of the votes as the best performing defeated candidate for the election. In the [2006 general election](/wiki/2006_Singaporean_general_election), WP won 43.91% of the votes in [Aljunied GRC](/wiki/Aljunied_GRC), the best performing defeated team for the election. Sylvia Lim was subsequently declared elected as the next NCMP in Parliament on 12 May 2006. Following an increase in the number of NCMP seats in Parliament to nine in 2010, after the WP garnered six seats at the [2011 general election](/wiki/2011_Singaporean_general_election), three NCMP seats were offered. They were taken up by [Lina Loh](/wiki/Lina_Loh) from the [Singapore People's Party](/wiki/Singapore_People%27s_Party), who contested [Potong Pasir Single Member Constituency](/wiki/Potong_Pasir_Single_Member_Constituency) (SMC), and [Yee Jenn Jong](/wiki/Yee_Jenn_Jong) and [Gerald Giam](/wiki/Gerald_Giam) of the WP, who contested [Joo Chiat SMC](/wiki/Joo_Chiat_Single_Member_Constituency) and [East Coast GRC](/wiki/East_Coast_Group_Representation_Constituency), respectively. In the [2015 general election](/wiki/2015_Singaporean_general_election), WP again won six seats, so three NCMP seats were offered. They were offered to [Lee Li Lian](/wiki/Lee_Li_Lian) ([Punggol East SMC](/wiki/Punggol_East_SMC)), [Dennis Tan](/wiki/Dennis_Tan) ([Fengshan SMC](/wiki/Fengshan_Single_Member_Constituency)) and one of the candidates of the [East Coast GRC](/wiki/East_Coast_Group_Representation_Constituency) team. Tan and [Leon Perera](/wiki/Leon_Perera) (of the East Coast GRC team) accepted with Lee declining the seat. WP filled a motion in Parliament to allow [Daniel Goh](/wiki/Daniel_Goh) to take Lee's place as NCMP and the motion was passed by the legislature. Goh was later sworn-in as a NCMP. The amendments in 2016 saw the number of NCMPs seats being increased to 12; in the [2020 general election](/wiki/2020_Singaporean_general_election), after WP won ten seats at that election, two NCMP seats were offered. The [Progress Singapore Party](/wiki/Progress_Singapore_Party) team contesting [West Coast GRC](/wiki/West_Coast_GRC) garnered 48.32% of the votes, was the best-performing defeated team for the election. They were taken up by [Leong Mun Wai](/wiki/Leong_Mun_Wai) and [Hazel Poa](/wiki/Hazel_Poa), and were subsequently declared elected as the NCMPs in Parliament on 16 July 2020. In the [2025 general election](/wiki/2025_Singaporean_general_election), WP won ten seats again, resulting in two NCMPs seats being offered, one to [Andre Low](/wiki/Andre_Low) ([Jalan Kayu SMC](/wiki/Jalan_Kayu_SMC)), and one of the candidates from [Tampines GRC](/wiki/Tampines_GRC) team. It was announced on 19 May 2025 that Low and [Eileen Chong](/wiki/Eileen_Chong_(politician)) (of the Tampines GRC team) would accept the seats. ### List of NCMPs YearOpposition MPsNCMP seat offersRemarksMinimumMP-electsOffered toAcceptedDeclined(/wiki/1984_Singaporean_general_election)32 (1 each from WP and SDP)1 (WP only; later offered to SUF)02Both offers were declined and no further offers were subsequently made.(/wiki/1988_Singaporean_general_election)1 (SDP only)2 (WP only)10One NCMP seat was later declared vacant before the opening of Parliament.(/wiki/1991_Singaporean_general_election)4 (3 from SDP, 1 from WP)0Not offeredNo NCMP seat was offered as number of opposition MPs-elect (4) exceeded minimum number of opposition MPs (3).(/wiki/1997_Singaporean_general_election)2 (1 each from SPP and WP)1 (WP only)10NCMP expelled in July 2001, three months before end of term.(/wiki/2001_Singaporean_general_election)2 (1 each from SDA and WP)1 (SDA only)[b]10(/wiki/2006_Singaporean_general_election)2 (1 each from SDA and WP)1 (WP only)10(/wiki/2011_Singaporean_general_election)96 (WP only)3 (2 from WP, 1 from SPP)30(/wiki/2015_Singaporean_general_election)6 (WP only)3 (WP only)31One candidate declined the offer and was later replaced through a motion in Parliament.(/wiki/2020_Singaporean_general_election)1210 (WP only)2 (PSP only)20(/wiki/2025_Singaporean_general_election)10 (WP only)2 (WP only)20List of NCMPs ParliamentYearNamePartyConstituencyTerm startTerm end**[6th](/wiki/6th_Parliament_of_Singapore)***NCMP seat not taken up after the [1984 general election](/wiki/1984_Singaporean_general_election)***[7th](/wiki/7th_Parliament_of_Singapore)**(/wiki/1988_Singaporean_general_election)[**Lee** Siew Choh](/wiki/Lee_Siew_Choh)[Workers' Party](/wiki/Workers%27_Party_of_Singapore)[Eunos GRC](/wiki/Eunos_Group_Representation_Constituency)16 September 198814 August 1991**[8th](/wiki/8th_Parliament_of_Singapore)***No NCMP seats allotted during the [1991 general election](/wiki/1991_Singaporean_general_election)***[9th](/wiki/9th_Parliament_of_Singapore)**(/wiki/1997_Singaporean_general_election)[Joshua Benjamin **Jeyaretnam**](/wiki/J._B._Jeyaretnam) [Workers' Party](/wiki/Workers%27_Party_of_Singapore)[Cheng San GRC](/wiki/Cheng_San_Group_Representation_Constituency)14 January 199723 July 2001[c]**[10th](/wiki/10th_Parliament_of_Singapore)**(/wiki/2001_Singaporean_general_election)[Steve **Chia**](/wiki/Steve_Chia) [Singapore Democratic Alliance](/wiki/Singapore_Democratic_Alliance)[b][Choa Chu Kang SMC](/wiki/Choa_Chu_Kang_Single_Member_Constituency)5 November 200120 April 2006**[11th](/wiki/11th_Parliament_of_Singapore)**(/wiki/2006_Singaporean_general_election)[Sylvia **Lim**](/wiki/Sylvia_Lim) [Workers' Party](/wiki/Workers%27_Party_of_Singapore)[Aljunied GRC](/wiki/Aljunied_Group_Representation_Constituency)11 May 200619 April 2011**[12th](/wiki/12th_Parliament_of_Singapore)**(/wiki/2011_Singaporean_general_election)[Lina **Loh**](/wiki/Lina_Loh)[Singapore People's Party](/wiki/Singapore_People%27s_Party)[Potong Pasir SMC](/wiki/Potong_Pasir_Single_Member_Constituency)16 May 201125 August 2015[**Yee** Jenn Jong](/wiki/Yee_Jenn_Jong)[Workers' Party](/wiki/Workers%27_Party_of_Singapore)[Joo Chiat SMC](/wiki/Joo_Chiat_Single_Member_Constituency)[Gerald **Giam**](/wiki/Gerald_Giam)[East Coast GRC](/wiki/East_Coast_Group_Representation_Constituency)**[13th](/wiki/13th_Parliament_of_Singapore)**(/wiki/2015_Singaporean_general_election)[Dennis **Tan**](/wiki/Dennis_Tan)[Fengshan SMC](/wiki/Fengshan_Single_Member_Constituency)16 September 201523 June 2020[Leon **Perera**](/wiki/Leon_Perera)[East Coast GRC](/wiki/East_Coast_Group_Representation_Constituency)[Daniel **Goh**](/wiki/Daniel_Goh)29 February 2016**[14th](/wiki/14th_Parliament_of_Singapore)**(/wiki/2020_Singaporean_general_election)[**Leong** Mun Wai](/wiki/Leong_Mun_Wai)[Progress Singapore Party](/wiki/Progress_Singapore_Party)[West Coast GRC](/wiki/West_Coast_Group_Representation_Constituency)16 July 202015 April 2025[Hazel **Poa**](/wiki/Hazel_Poa)**[15th](/wiki/15th_Parliament_of_Singapore)**(/wiki/2025_Singaporean_general_election)[Andre **Low**](/wiki/Andre_Low)[Workers' Party](/wiki/Workers%27_Party_(Singapore))[Jalan Kayu SMC](/wiki/Jalan_Kayu_SMC)19 May 2025*Present*[Eileen **Chong**](/wiki/Eileen_Chong_(politician))[Tampines GRC](/wiki/Tampines_Group_Representation_Constituency)The names in bold are the individuals' [surnames](/wiki/Surname). ## Notable issues raised by NCMPs NCMPs have raised and debated in Parliament a wide range of issues. What follows are some of the more notable issues mentioned. ### Steve Chia In November 2002, NCMP [Steve Chia](/wiki/Steve_Chia) supported a motion by the [Minister for Education](/wiki/Ministry_of_Education_(Singapore)) stating that \"this House ... (1) supports the new JC [[junior college](/wiki/Junior_college#Singapore)] curriculum which will better develop thinking, communication and other process skills and engage students in greater breadth of learning; and (2) endorses greater diversity and opening of new pathways in JC/Upper Secondary education to cater to the different strengths and interests of students.\" He suggested that there should be a focus on \"creative spontaneity\", expressing the view that the education system in 2002 was one that focused on churning out a production line of workers, managers and instruction takers. Given that Singapore had reached the standards of a [First World](/wiki/First_World) economy, Singapore should focus on instilling an inquisitive spirit within students, to encourage students to ask questions. He placed most emphasis on the importance of ensuring that the focus of education should be character building, stating: \"It will be failure of our education system if we are to train our best and brightest with our best resources only to be told that they are going to be the quitters of our society; or that they lack the compassion for the weak and the down; or that they behave in a snobbish class of their own; or behave condescendingly to their peers and followers; or that the elites only care about their own self-interests.\" In 2003, Chia mooted the idea that Singaporeans should be able to borrow from their own [Central Provident Fund](/wiki/Central_Provident_Fund) (CPF) savings to tide over periods of financial difficulty. His rationale was that if individuals could borrow from their own CPF accounts to buy depreciating property and money-losing stocks, there was no reason why they should not be allowed to do so to pay for bills. Ong Seh Hong, MP for Aljunied GRC, opposed the view, stating that it was important and for the good of Singapore that Singaporeans were independent individuals who could assume the risks and successes of their investments and be self-sufficient. With the advent of the [Integrated Resorts](/wiki/Integrated_resort), which are casino-based vacation resorts, in 2005 Chia expressed concern in Parliament over whether the Government had systems and institutions in place to lessen their negative impact such as problem gambling and the spectre of people gambling away family assets. ### Sylvia Lim [Sylvia Lim](/wiki/Sylvia_Lim) was an NCMP from 2006 till Parliament was dissolved in 2011 for the general election held that year, at which she was elected as one of the MPs for Aljunied GRC. While she was an NCMP, Parliament debated the Human Organ Transplant (Amendment) Bill 2009 which would permit an organ donor to receive a reasonable amount of payment as a reimbursement for medical checks, insurance and other medical expenses, and loss of income. Lim spoke of her worry that the bill might lead to a backdoor [organ trading](/wiki/Organ_trade#Illegal_organ_trade) and profiteering. In 2010, Lim mooted the idea that the proportion of each Primary 1 cohort that would be seeking a university education should be increased beyond the 30% by 2015 that the Government was planning. She noted that in [Organisation for Economic Co-operation and Development](/wiki/Organisation_for_Economic_Co-operation_and_Development) countries in 2006 about 37% of each age cohort received a degree-level education, and that a sizeable number of Singaporean students who failed to gain entry into local universities had done well in reputable universities overseas. She also suggested giving concessionary fares to disabled individuals who make up 2% of the adult population under 60 years. Lim expressed concerns about a proposed constitutional amendment introduced in April 2010 that would allow magistrates to hear what are called \"first mentions\" through [video conferencing](/wiki/Video_conferencing). A first mention is a hearing that must be held within 48 hours of a person's arrest. She felt it failed to adequately assure accused people that they were allowed to complain to magistrates about injuries they had sustained or acts of misfeasance against them by the authorities. In response, Deputy Prime Minister and [Minister for Home Affairs](/wiki/Ministry_of_Home_Affairs_(Singapore)) [Wong Kan Seng](/wiki/Wong_Kan_Seng) assured MPs that processes would be in place to ensure that accused people are treated fairly. For example, during a video conference, an accused person will be alone in a room with no police officer, and will be able to see what is happening in the entire courtroom. Secondly, the screen that will be used is large enough for the judge to clearly see whether the accused is under duress. Finally, accused people who have been mistreated can either complain to the police or to the judge when they are later present in court. The following month, during parliamentary debates on major revisions to the Criminal Procedure Code, Lim suggested there was a need to improve pre-trial disclosure procedures and to ensure that victims of crimes received redress. Further, she expressed concerns over the leniency of community-based sentencing. The bill eventually incorporated several of her suggestions. In 2011, Lim noted that the Compulsory Education Act ensures that all children have the opportunity to receive an education. However, she expressed concern that processes for entry to schools for children with [special needs](/wiki/Special_needs) were cumbersome. Furthermore, education for children with special needs was not subject to the same subsidies that students in mainstream schools had. She thus brought to the House's attention the fact that special needs children might have been unintentionally marginalised. These concerns were supported by Penny Low, MP for [Pasir Ris–Punggol GRC](/wiki/Pasir_Ris-Punggol_Group_Representation_Constituency). - [Member of Parliament](/wiki/Member_of_Parliament) - [Nominated Member of Parliament](/wiki/Nominated_Member_of_Parliament) - [Parliament of Singapore](/wiki/Parliament_of_Singapore) - [Parliamentary elections in Singapore](/wiki/Parliamentary_elections_in_Singapore) - [Best Loser System](/wiki/Best_Loser_System), a similar system in [Mauritius](/wiki/Mauritius) that inspired the Non-Constituency Member of Parliament system in Singapore. ## Notes ## Bibliography - [Constitution of the Republic of Singapore](/wiki/Constitution_of_Singapore) (1985 Rev. Ed., 1999 Reprint) - Parliamentary Elections Act (Cap. 218, 2011 Rev. Ed.) (\"PEA\") - Tey, Tsun Hang (December 2008). \"Singapore's Electoral System: Government by the People?\". *[Legal Studies](/wiki/Legal_Studies_(law_journal))*. **28** (4): 610–628. [doi](/wiki/Doi_(identifier)):10.1111/j.1748-121X.2008.00106.x. [S2CID](/wiki/S2CID_(identifier)) 143965283. - [Thio, Li-ann](/wiki/Thio_Li-ann) (1993). \"The Post-colonial Constitutional Evolution of the Singapore Legislature: A Case Study\". *Singapore Journal of Legal Studies*: 80–122. [SSRN](/wiki/SSRN_(identifier)) 965257. ### Articles - [Tan, Eugene](/wiki/Eugene_Tan); Chan, Gary (13 April 2009). \"The Singapore Legal System: §5 The Legislature\". *An Overview of the Singapore Legal System*. [Singapore Academy of Law](/wiki/Singapore_Academy_of_Law). Archived from the original on 17 October 2010. Retrieved 1 December 2010. - Tan, Kevin Yew Lee (1992). \"Constitutional Implications of the 1991 Singapore General Election\". *Singapore Law Review*. **13**: 26–59. - [Thio, Li-ann](/wiki/Thio_Li-ann) (2002). \"The Right to Political Participation in Singapore: Tailor-making a Westminster-modelled Constitution to Fit the Imperatives of Asian Democracy\". *Singapore Journal of International and Comparative Law*. **6**: 181–243. - Winslow, Valentine S. (1984). \"Creating a Utopian Parliament: The Constitution of the Republic of Singapore (Amendment) Act 1984; the Parliamentary Elections (Amendment) Act 1984\". *Malaya Law Review*. **28**: 268–274. ### Books - Chan, Helena H[ui-]M[eng] (1995). \"The Legislature\". *The Legal System of Singapore*. Singapore: [Butterworths Asia](/wiki/LexisNexis_Butterworths). pp. 30–40. [ISBN](/wiki/ISBN_(identifier)) 978-0-409-99789-7. - *The Parliament of the Republic of Singapore*. Singapore: Parliament of the Republic of Singapore. 1997. [ISBN](/wiki/ISBN_(identifier)) 978-9971-88-567-0. - Tan, Kevin Y[ew] L[ee] (2011). \"Making Law: Parliament\". *An Introduction to Singapore's cite book* (rev. ed.). Singapore: Talisman Publishing. pp. 33–60. [ISBN](/wiki/ISBN_(identifier)) 978-981-08-6456-9. - Tan, Kevin Y[ew] L[ee]; Thio, Li-ann (2010). \"The Legislature\". *Constitutional Law in Malaysia and Singapore* (3rd ed.). Singapore: [LexisNexis](/wiki/LexisNexis). pp. 299–360. [ISBN](/wiki/ISBN_(identifier)) 978-981-236-795-2. - Thio, Li-ann (1995). \"Government and the State\". *ASEAN Legal Systems*. Singapore: Butterworths Asia for the [ASEAN](/wiki/Association_of_Southeast_Asian_Nations) Law Association. [ISBN](/wiki/ISBN_(identifier)) 978-0-409-99802-3. - Thio, Li-ann (2012). \"The Legislature and the Electoral System\". *A Treatise on Singapore Constitutional Law*. Singapore: [Academy Publishing](/wiki/Singapore_Academy_of_Law). pp. 285–359 at 304–308. [ISBN](/wiki/ISBN_(identifier)) 978-981-07-1515-1. - Loke, Hoe Yeong; [Yee, Jenn Jong](/wiki/Yee_Jenn_Jong) (2024). *Non-constituency Members Of Parliament: What's Next For The Scheme?*. Singapore: [World Scientific](/wiki/World_Scientific). [ISBN](/wiki/ISBN_(identifier)) 9811292957.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:38:02.281244",
  "title": "Non-constituency Member of Parliament",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Non-constituency_Member_of_Parliament"
}