{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:38:04.377193"
  },
  "content": "Prison of war chorale conductor **Norah Chambers** (née **Margaret Constance Norah Hope**; 1905–1989) was a British chorale conductor. ## Early life and education Chambers was born Margaret Constance Norah Hope to engineer James Laidlaw Hope and Margaret Annie Ogilvie Mitchell in 1905, [Singapore](/wiki/Singapore). She was sent to boarding school in [Aylesbury, England](/wiki/Aylesbury,_England) and went on to attend the [Royal Academy of Music, London](/wiki/Royal_Academy_of_Music,_London). Chambers studied piano, the violin, and chamber music. ## Career Chambers performed with the Royal Academy of Music orchestra under Sir [Henry Wood](/wiki/Henry_Wood). In 1943, Chambers founded a vocal orchestra with [Margaret Dryburgh](/wiki/Margaret_Dryburgh), writing out the music from memory. After retirement in Jersey, Chambers composed music for, and directed the St. Mark's Church choir in [St. Helier](/wiki/St._Helier). ## Personal life Chambers married engineer John Lawrence Chambers in 1930 Malaya and they had a daughter Sally in 1933. She taught violin locally. During [World War II](/wiki/World_War_II), Chambers traveled for five days through the jungle from Malaya to Singapore and succeeded in getting her daughter evacuated to [Perth](/wiki/Perth) in Australia. She was also evacuated but her ship, *Vyner Brooke*, was bombed and destroyed. She was interned in a Japanese prisoner of war camp, her husband sent to another. After the war, Chambers was reunited with her family and returned to Malaya. She retired in 1952 to [Jersey](/wiki/Jersey). ## Legacy After the war, her music produced in the camps was performed widely. Her work and time in the camp was the inspiration for the film *[Paradise Road](/wiki/Paradise_Road_(1997_film))*. ## Sources This article on a British conductor or bandleader is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:38:04.376913",
  "title": "Norah Chambers",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Norah_Chambers"
}