{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:38:05.547782"
  },
  "content": "Future expressway and cycling path in Singapore The **North–South Corridor** (**NSC**), originally conceptualised as the **North–South Expressway (NSE)**, is an under-construction expressway in [Singapore](/wiki/Singapore) that will be the country's 11th [network](/wiki/Expressways_of_Singapore) of [expressways](/wiki/Controlled-access_highway) when completed. The NSC will serve traffic along the north-south corridor that is currently served by the [Central Expressway](/wiki/Central_Expressway,_Singapore) (CTE). The 21.5 kilometres (13.4 mi) expressway is expected to cost about [S$](/wiki/Singapore_dollar)7.47 billion when fully completed in 2029 and will connect the [East Coast Parkway](/wiki/East_Coast_Parkway) (ECP) with the [northern parts](/wiki/North_Region,_Singapore) of Singapore. The NSC will have a total of 16 entrances and 17 exits to connect towns along – [Woodlands](/wiki/Woodlands,_Singapore#Woodlands), [Sembawang](/wiki/Sembawang), [Yishun](/wiki/Yishun), [Ang Mo Kio](/wiki/Ang_Mo_Kio), [Bishan](/wiki/Bishan,_Singapore) and [Toa Payoh](/wiki/Toa_Payoh) – with the [city-centre](/wiki/Central_Area,_Singapore). The NSC will also provide links to existing expressways, including the [Seletar Expressway](/wiki/Seletar_Expressway) (SLE), [Pan-Island Expressway](/wiki/Pan-Island_Expressway) (PIE) and [East Coast Parkway](/wiki/East_Coast_Parkway) (ECP). The NSC will be Singapore's first expressway conceived as an \"integrated transport corridor\", featuring dedicated [bus lanes](/wiki/Bus_lane) and [cycling trunk routes](/wiki/Cycling_infrastructure) integrated with a traditional expressway. It will consist of a 8.8 km (5.5 mi) [viaduct](/wiki/Viaduct) in the north running from Admiralty Road West to [Lentor Avenue](/wiki/Lentor), a 0.4 km (0.25 mi) at-grade section at Lentor Avenue and a 12.3 km (7.6 mi) underground tunnel portion that runs until the ECP. Additionally, the surface streets that run along the underground tunnel of the NSC will see road lanes reprioritised for walking, cycling, public transport and community spaces. According to the [Land Transport Authority](/wiki/Land_Transport_Authority) (LTA), the continuous bus lanes along the NSC will be able to reduce bus travelling times from Woodlands, Sembawang, Yishun and Ang Mo Kio to the city by up to 30 to 45 minutes through morning and evening peak express bus services and also make bus connections between residential towns along the NSC faster by allowing intra-town buses to leverage the ramps and bus lanes on the surface. A cycling path along the entire stretch of the highway will link up the [Park Connector Networks](/wiki/Park_Connector_Network) (PCN) and dedicated cycling path networks within [new towns](/wiki/New_towns_of_Singapore) along the entire corridor to the city-centre. First conceptualised in 2011, the NSE was initially targeted to be ready by 2020. In January 2016, the NSE was then reconfigured to instead be part of the NSC, with a new completion date of 2026 set for the NSC. However, due to significant delays in construction that was exacerbated by the [COVID-19 pandemic](/wiki/COVID-19_pandemic) from 2020 to 2022, the deadline was pushed further. It is now expected for the viaduct (at the northern terminus of the expressway) to be opened in 2027 and the underground tunnels (at the southern terminus of the expressway) to be opened in 2029. ## History ### Plans On 30 January 2008, the expressway was first announced by then-[Minister for Transport](/wiki/Ministry_of_Transport_(Singapore)) [Raymond Lim](/wiki/Raymond_Lim) as the North–South Expressway (NSE), as part of a major review of Singapore's transport network by the Land Transport Authority (LTA). It was then expected that the NSE would be completed by 2020, and would reduce travel time to the city for residents in the north by up to 30% On 19 January 2011, the government gave the go-ahead for the alignment of the northern section consisting of viaducts, surface, and tunnel from Admiralty Road West to Toa Payoh Rise, which is expected to complete in 2020, construction is expected to start in 2013 with the easiest acquisition. On 15 November 2011, the government gave the go-ahead for the alignment of southern section consisting of the full tunnel to ECP, and the construction was further delayed, to \"after the demolition of Rochor Centre\" in 2017 and construction is expected to begin in 2018 for completion in 2025, then subsequently delayed to 2026 during the groundbreaking ceremony of North–South Corridor and further delayed to 2028 due to COVID-19 pandemic. Then Minister for Transport [Khaw Boon Wan](/wiki/Khaw_Boon_Wan) outlined the ministry's plans to reconfigure the NSE as part of the North–South Corridor (NSC), an integrated transport corridor with one lane out of the three-lane highway to be dedicated for express bus services, as well as to have cycling and pedestrian paths that run along the NSC. ### Land acquisitions and demolitions The North–South Corridor entails the acquisition of Marymount Terrace terraced houses and [Rochor Centre](/wiki/Rochor_Centre) in the initial phase. Terraced houses were the easiest to move, HDB flats requires the construction of the replacement which is due to the construction delays for North–South Corridor. A total of 567 flats and 187 rental shops and eating houses were vacated by 31 December 2016. The four blocks of HDB flats eventually began demolition on 26 June 2018, and was targeted to finish by April 2019. In August 2016, several units in the [Ellison Building](/wiki/Ellison_Building) which was built in 1924, was considered for partial demolition and reconstruction after the completion of the NSC, despite its previous conservation gazette in 2008 by the URA. This sparked concerns from several heritage groups in Singapore including the Singapore Heritage Society and [International Council on Monuments and Sites (Singapore)](/wiki/International_Council_on_Monuments_and_Sites), slamming the decision to reconstruct as it would be equivalent to the \"falsification of historical artefacts\", while also bringing the efficacy of conservation gazettes into question. The URA then came up with a revised plan in February 2018 to instead demolish and reconstruct part of the façade of only one unit, compared to the original plan of demolishing and reconstructing three full units in the building. In April 2021, another four-storey building along [Thomson Road](/wiki/Thomson_Road,_Singapore), comprising 12 residential units and 4 shops, was acquired to make way for construction of the NSC. Unit owners were initially instructed to vacate the premises temporarily for a period of two years until excavation works were completed for safety reasons, but it was found that the building's concrete strength was lower than safely required in order to withstand excavation works for the tunnel beneath the building, and thus was instead chosen to be acquired and demolished. This sparked some unhappiness with the unit owners who were looking forward to a collective sale on the open market, since the proceeds were expected to be higher than the compensation that they would have received from the land acquisition. ### Construction The first contract for the NSC was awarded in November 2017, which expected the construction for the section of the tunnel between Toa Payoh Rise and Novena Rise to commence in 2018. Several other contracts were also awarded for the construction of various sections of the underground tunnel throughout the whole of 2018 to January 2019. The contracts for the viaduct portion of the NSC were awarded later, with three contracts awarded in December 2019, with works expecting to begin in early 2020. On 1 July 2023, it was announced that the NSC will be completed in two phases instead, starting with the viaduct segment which would be completed by the previous expected completion date of 2027, followed by the underground tunnel segment which would be delayed by another two years and completed by 2029 instead. Reasons cited for the delay include the COVID-19 pandemic along with challenging soil conditions. On 17 September 2023, an accident occurred resulting in the death of a 41-year-old construction worker at the worksite of Cavenagh Road when a pallet of gas cylinders toppled. ### Impact during construction In order to support the construction of the North–South Corridor, several roads were temporarily rerouted or diverted during the process: - With the demolition of the underpasses around the Novena area, the major traffic junction linking Newton Road, Moulmein Road, and Thomson Road, was adjusted to make way for the construction of expressway tunnels. - On 30 April 2023, the traffic junction between Marymount Road, Sin Ming Avenue, and Bishan Street 22 was converted into a temporary signalised roundabout to speed up construction of the underground road tunnel beneath the junction. It was reverted back to a cross junction in 2024. - Since 8 October 2023, Marymount Flyover has been closed for construction works till 2029. - On 18 August 2024, the cross junction between Ang Mo Kio Avenue 5 and 6 was similarly converted to a temporary signalised roundabout, which is scheduled to be reverted in July 2025. During the construction, noise complaints were received by the LTA that construction works did not adhere to requirements to cease after 10 pm and during weekends. In response, the LTA mentioned that there may be exceptions to the stoppage requirement in the case of \"safety critical works\". In addition, more noise barriers were deployed in the Novena area following the complaint. ## Route Based on the plans released by LTA as of the NSE alignment released in November 2011, the route that the 21.5 km (13.4 mi) NSC expressway will take is as follows: - **Viaduct**: 8.8 km (5.5 mi) running from Admiralty Road West to Lentor Avenue/[SLE](/wiki/Seletar_Expressway) - The northern terminus of the NSC commences at Admiralty Road West, and runs southwards along Woodlands Avenue 8/Gambas Avenue/Sembawang Road, before joining Lentor Avenue. - The portion of the viaduct that runs along Lentor Avenue is also expected to run parallel to the [North–South MRT line](/wiki/North%E2%80%93South_Line_(Singapore)). - [**At-grade**](/wiki/At-grade_crossing): 0.4 km (0.25 mi) intersecting at Lentor Avenue/[SLE](/wiki/Seletar_Expressway) - Three off-ramps are planned, with two off-ramps going north/south-wards along Lentor Avenue, and one off-ramp going westwards towards SLE/[BKE](/wiki/Bukit_Timah_Expressway). - One on-ramp is planned from the SLE traveling westwards to join NSC towards the north. - **Tunnel**: 12.3 km (7.6 mi) running from Lentor Avenue/SLE to ECP, Republic Avenue, Nicoll Highway - The underground tunnel starts at Lentor Avenue/SLE and runs southwards along Ang Mo Kio Avenue 6/Marymount Road, passing Toa Payoh Rise, before joining [Thomson Road](/wiki/Thomson_Road,_Singapore) and [Bukit Timah Road](/wiki/Bukit_Timah_Road) running parallel to the Central Expressway, continuing along [Ophir Road](/wiki/Ophir_Road), before joining ECP, Republic Avenue, and Nicoll Highway at its southern terminus of the NSC. - On Marymount Road, the tunnel will be integrated with the MRT station box for the [Teck Ghee station](/wiki/Teck_Ghee_station) on the upcoming [Cross Island MRT line](/wiki/Cross_Island_Line). - One on-ramp is planned from the PIE traveling eastwards to join NSC towards the south, as well as one off-ramp going northwards to join the PIE traveling westwards. - Also, the cycling lane will go from [Bugis MRT station](/wiki/Bugis_MRT_station) to [Novena MRT station](/wiki/Novena_MRT_station). ## Planned road interchanges The following are the planned road interchanges announced by the Land Transport Authority and final configuration is subject to change. LocationDestinationsNotes[Sembawang](/wiki/Sembawang)/[Woodlands](/wiki/Woodlands,_Singapore)*Start of NSC elevated viaduct section*Admiralty Road WestNorthern terminus; northbound exit to Admiralty Road West (Eastbound) onlyWoodlands Avenue 8 (Northbound)Northbound exit only[Sembawang](/wiki/Sembawang)Gambas Avenue (towards Woodlands Avenue 12)Northbound exit and southbound entrance only[Yishun](/wiki/Yishun)Sembawang Road (Northbound)Sembawang Road (Southbound), Yishun Avenue 1 and Mandai AvenueSouthbound entrance only[Yishun](/wiki/Yishun)/[Ang Mo Kio](/wiki/Ang_Mo_Kio) [SLE](/wiki/Seletar_Expressway) (towards [CTE](/wiki/Central_Expressway,_Singapore) & [TPE](/wiki/Tampines_Expressway))Southbound exit and northbound entrance only*End of NSC elevated viaduct section Start of NSC at-grade section*Lentor Avenue (Northbound)Northbound exit onlyLentor Avenue (Southbound)Southbound exit only*End of NSC at-grade section Start of NSC underground tunnel section* [SLE](/wiki/Seletar_Expressway) (towards [BKE](/wiki/Bukit_Timah_Expressway))Northbound exit only[Ang Mo Kio](/wiki/Ang_Mo_Kio)Ang Mo Kio Avenue 6 (Northbound)Northbound entrance only[Bishan](/wiki/Bishan,_Singapore)Marymount Road[Toa Payoh](/wiki/Toa_Payoh)[Thomson Road](/wiki/Thomson_Road,_Singapore) (Northbound)Northbound exit and southbound entrance only[Novena](/wiki/Novena,_Singapore) [PIE](/wiki/Pan_Island_Expressway) (towards Tuas)[Novena](/wiki/Novena,_Singapore)/[Kallang](/wiki/Kallang)[Bukit Timah Road](/wiki/Bukit_Timah_Road)Northbound exit and both bounds entrance onlyKeng Lee Road (towards Kampong Java Road and [Bukit Timah Road](/wiki/Bukit_Timah_Road))Southbound exit only[Rochor](/wiki/Rochor)[Ophir Road](/wiki/Ophir_Road)Southbound exit to Ophir Road Northbound entrance from Rochor Road[Downtown Core](/wiki/Downtown_Core)[Nicoll Highway](/wiki/Nicoll_Highway) (Eastbound)Northbound entrance onlyRepublic Avenue & Republic BoulevardSouthbound Exit Only [ECP](/wiki/East_Coast_Parkway) (towards Changi) [ECP](/wiki/East_Coast_Parkway) (towards Sheares Avenue)Southern terminus*End of NSC underground tunnel section* - [Incomplete access](/wiki/Interchange_(road)#Complete_and_incomplete_interchanges) - Media related to North–South Corridor (Singapore) at Wikimedia Commons 1°24′25″N 103°49′28″E﻿ / ﻿1.4070182°N 103.8245297°E﻿ / 1.4070182; 103.8245297\n",
  "language": "en",
  "processed_at": "2026-01-12T11:38:05.547368",
  "title": "North–South Corridor, Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/North%E2%80%93South_Corridor,_Singapore"
}