{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:38:19.487579"
  },
  "content": "* *This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **is an orphan, as no other articles link to it**. Please introduce links to this page from related articles. *(December 2025)*This article **contains promotional content**. Please help improve it by removing promotional language and inappropriate external links, and by adding encyclopedic text written from a neutral point of view. *(October 2018)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* **Novena Global Lifecare Group** is a Singapore based [medical](/wiki/Clinic) and aesthetic group operating in [Asia](/wiki/Asia). The group provides skin and body care and wellness services and products. Presently, the group has 100 clinics in [Singapore](/wiki/Singapore), China, [Hong Kong](/wiki/Hong_Kong), [Taiwan](/wiki/Taiwan), [Korea](/wiki/Korea), [Indonesia](/wiki/Indonesia), [India](/wiki/India) and Malaysia. ## History Novena Global Lifecare Group was founded in 2016 by cousins Terence Loh and Nelson Loh, both former investment bankers at J.P. Morgan. Nelson found the idea of forming a medical aesthetic group when he found that his mother’s medical aesthetic bills running into thousands of dollars. One of their early investments was a [KOSDAQ](/wiki/KOSDAQ)-listed medical equipment manufacturer in South Korea to develop their own research and manufacturing arm of the group. They also took interests in healthcare companies in Taiwan as well as the PPP chain of clinics in Singapore, renaming it to NOVU and NOVU Genesis. Prior to founding Novena Global, Terence and Nelson co-founded DORR Group, an Asia-based private equity group which invested in the consumer, internet, media and healthcare spaces. BT had reported that at least two entities - Novena Global Healthcare Pte Ltd and Novena Life Sciences Pte Ltd - set up in 2016 and 2018 respectively, have not filed annual returns, which include financial statements, since they were incorporated.[*citation needed*] In July 2017, the company announced plans for a potential future US$150mm Taiwan [IPO](/wiki/Initial_public_offering). In January 2018, China's Sinopharm Capital and Cedarlake Huarong Investment acquired a stake in Novena Global Lifecare for US$20 million. In 2019, Novena Global Healthcare Group appointed Lim Cheok Peng as Senior Advisor and Kenneth Thean as Senior Medical Director. ## Overview The Group provides predictive care through health screenings for early detection of diseases and nutritional supplements. In November 2017, the company acquired four specialist eyecare centers in Singapore. Two of the centers, Total EyeCare Center at Orchid Hotel and a branch in Jurong East, were owned by Gerard Chuah, a private eye surgeon specializing in vitreoretinal surgery. The other two clinics, Specialist Eye and Eyelids Clinic at Novena and The Eye and Aesthetics Clinic in Suntec City, were previously owned by Chuah Chin Tek. In November 2017, the group announced that it will acquire majority stake of Taiwan healthcare provider, Hexin Group, the third-largest healthcare screening provider in Taipei, to manage the health screening services at Taipei Medical University Hospital, Taoyuan General Hospital, China Medical University Hospital and Taipei Beitou Hospital. ### Rejuvenating care Novena Global provides rejuvenating care through aesthetic and wellness services, skin and body care products and post-natal care. Its flagship brand is NOVU Medical Aesthetic Clinic, with 50 clinics in Singapore, Malaysia, Indonesia, China, Korea and Spain In May 2017, the group partnered with Australian model and actress [Jessica Gomes](/wiki/Jessica_Gomes) to launch Equal Beauty, a fragrance free line of skincare products designed for all skin types and races. Equal Beauty is a luxury Australian travel skincare brand suited for the modern jet setting woman. In November 2017, Novena Global opened a clinic in Madrid in Spain under the NOVU brand. In January 2018, Novena Global launched its new flagship clinic concept, NOVU Genesis. \"NGHG is not wholly owned by the Lohs. The majority of the beneficial interest in NGHG is ultimately held by individual, private and institutional investors,\" said the board, adding that the firm is \"wholly unconnected and unrelated to the Bellagraph Nova Group or Axington Ltd, and any of the allegations made in relation to the conduct of Nelson and Terence Loh\" in the management of these entities. ## NOVU Medical Aesthetic Clinic NOVU is the flagship brand of Novena Global Lifecare Group with over 40 clinics in Asia including Singapore, Malaysia, Indonesia, China, South Korea, Myanmar and Spain. The clinic chain specialises in providing aesthetic and wellness services to the masses. It also manufactures and distributes a range of skin and body care products. ## Controversies The Group and its founders have been involved in many publicly reported controversies in 2020, from doctoring Obama photos used in publicity materials, to having police reports filed by a public accounting firm on alleged falsified signatures on financial statements. Due to the controversy, investors pull out their investments in entities under the Novena Global Healthcare Group. Its cofounder Nelson Loh has been approached by the Singapore Police and has yet to respond publicly. Responding to a query by *[The Straits Times](/wiki/The_Straits_Times)*, [Accounting and Corporate Regulatory Authority](/wiki/Accounting_and_Corporate_Regulatory_Authority) (Acra) is investigating all the Group-related entities. Terence Loh gave a statement to the police. The police had also visited his home for investigation.[*citation needed*] Accounting film, [Ernst & Young](/wiki/Ernst_%26_Young) lodged a police report alleging unauthorized use of its signatures on Novena Global Cayman Group's financial statements. The Singapore police has said it is looking into the matter. NGHG's board said that it plans to appoint solicitors and will fully cooperate with the authorities investigating the allegations. Nelson Loh and Terence Loh has since parted ways and gone on to their own separate businesses. Both have announced in October 2020 that Nelson Loh is no longer involved in Novena Global Lifecare Group in any capacity. - Official website - NOVU Medical Aesthetic Clinic\n",
  "language": "en",
  "processed_at": "2026-01-12T11:38:19.487176",
  "title": "Novena Global Lifecare",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Novena_Global_Lifecare"
}