{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:35:23.391358"
  },
  "content": "Supermarket chain in Singapore **NTUC FairPrice** is the largest supermarket chain in [Singapore](/wiki/Singapore). The company is a co-operative of the [National Trades Union Congress](/wiki/National_Trades_Union_Congress) (NTUC). The group has more than 100 supermarkets across the island, with over 160 outlets of Cheers convenience stores island-wide. NTUC FairPrice has partnered with [ExxonMobil](/wiki/ExxonMobil) to run several stations with a FairPrice branding at the [minimarts](/wiki/Superette) at their [stations](/wiki/Petrol_station). The supermarket has the slogan \"Singapore's very own\". ## History In November 1972, [NTUC](/wiki/National_Trades_Union_Congress) announced its new consumer co-operative named Welcome, which opened in February 1973. On 22 July 1973, [Prime Minister](/wiki/Prime_Minister_of_Singapore) [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) opened the first supermarket at Block 192, [Toa Payoh](/wiki/Toa_Payoh) Lorong 4, and it was the first of its kind. In August 2007, FairPrice opened its upmarket outlet at Bukit Timah Plaza named FairPrice Finest, after five months of refurbishment.[*citation needed*] The move was to cater to the changing tastes of Singaporeans who are increasingly well-travelled. The 4,000 square metres (43,000 sq ft), two-storey outlet has an offering of products different from other FairPrice stores, and also features a Swiss-style [delicatessen](/wiki/Delicatessen), a [wine cellar](/wiki/Wine_cellar) and a European bakery. ### International operations FairPrice has attempted to expand into other countries. Its first attempt was Malaysia in 1994, operating as a 60:40 joint venture with Hong Leong Industries Berhad under Quayline FairPrice. Its competitors were Parkson and Jaya Jusco. The first outlet was at Ampang Point, which opened on 3 January 1994. Despite no longer operating in [Malaysia](/wiki/Malaysia), FairPrice had no plans to restart its operations in the country. In 2003, it entered a joint venture with DBS Private Equity, [New Hope Group](/wiki/New_Hope_Group), Silver Tie and [Taiwan](/wiki/Republic_of_China)'s Apex Group, known as Nextmall.[*citation needed*] The venture provided merchandising, management and [logistics](/wiki/Logistics) for a fee to Nextmart which is a [China](/wiki/China) incorporated [hypermarket](/wiki/Hypermarket). Seven [hypermarkets](/wiki/Hypermarket) were opened in [China](/wiki/China), with its first in [Shaoxing](/wiki/Shaoxing), [Zhejiang](/wiki/Zhejiang). Nextmall closed in 2005 after incurring a total of $80 million in debts and over $40 million in losses. A supermarket in [Vietnam](/wiki/Vietnam) was opened in 2013 under a joint venture with Saigon Union of Trading Co-operatives, known as Co.opXtra Plus. FairPrice also operated Cheers convenience stores in [Vietnam](/wiki/Vietnam) as of 2018. ## Retail formats - **FairPrice Shop** – A small heartland store chain catering to basic needs.**[*citation needed*]** - **FairPrice Xpress** – A collaboration between [ExxonMobil](/wiki/ExxonMobil) and Fairprice, this 24-hour convenience store chain offers similar facilities to Cheers by FairPrice and its rival [7-Eleven](/wiki/7-Eleven). - **FairPrice Finest** – This is a separate store offering up-market food supplies. It was officially opened in September 2007, and also it merged the former Liberty Market. Stores include [Bedok Mall](/wiki/Bedok_Mall), [Waterway Point](/wiki/Waterway_Point), [Century Square](/wiki/Century_Square,_Singapore), [Junction 8](/wiki/Junction_8), [Causeway Point](/wiki/Causeway_Point) and [Seletar Mall](/wiki/Seletar_Mall). - **FairPrice Xtra** – A [hypermarket](/wiki/Hypermarket) chain which combines a normal supermarket and the FairPrice Homemart in one store. It sells items such as electronics, clothing and household merchandise in addition to the regular supermarket items, and also it merged the former FairPrice Homemart, together with former Carrefour stuffs. Stores include [AMK Hub](/wiki/Ang_Mo_Kio), [Jurong Point](/wiki/Jurong_Point), UE BizHub East, [Kallang Wave](/wiki/Kallang_Wave_Mall), [Jem](/wiki/Jem,_Singapore) and [Nex](/wiki/Nex,_Singapore). - **Warehouse Club** – Operating between 2014 and 2024, the Warehouse Club was modelled on American [warehouse club](/wiki/Warehouse_club) chain [Costco](/wiki/Costco) and access was only available through membership. It offered bulk purchases with discounts. The only branch closed permanently on 21 March 2024 and was replaced by a regular FairPrice store. - **Unity Pharmacy** - A pharmacy chain offering pharmaceutical supplies at affordable prices. Usually located outside Fairprice supermarkets.**[*citation needed*]** - **Cheers** - A a convenience store chain to fulfil everyday needs, which was first opened in 1998. Every year, FairPrice offers [NTUC Union Members](/wiki/National_Trades_Union_Congress) (NTUC cardholders) and FairPrice shareholders dividends, along with cash-back rebates for all purchases made at FairPrice supermarkets island-wide. ## Union Employees of NTUC FairPrice are represented by the Food, Drinks and Allied Workers' Union (FDAWU), an affiliate of the [National Trades Union Congress](/wiki/National_Trades_Union_Congress). - Media related to NTUC FairPrice at Wikimedia Commons Portals: - Supermarkets - Companies\n",
  "language": "en",
  "processed_at": "2026-01-12T11:35:23.390824",
  "title": "NTUC FairPrice",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/NTUC_FairPrice"
}