{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:35:26.290418"
  },
  "content": "The **NUS Museum** is the oldest university museum in Singapore. It is located within the main campus of the [National University of Singapore](/wiki/National_University_of_Singapore) in southwest Singapore at [Kent Ridge](/wiki/Kent_Ridge). The collections include Chinese, Indian and Southeast Asian materials, consisting of traditional sculptures and paintings, bronzes, jades, ceramics, textiles, and modern and contemporary art. Since 2006, Ahmad Mashadi has been the head of the museum. ## History The roots of NUS Museum can be traced back to the establishment in 1955 of the University Art Museum at the then [University of Malaya](/wiki/University_of_Malaya), located at the Bukit Timah Campus. The status of the Museum and its collections evolved over time, before arriving at its current form. ## Timeline YearDescription1954An art museum was proposed for the then University of Malaya, in Singapore.1955[Michael Sullivan](/wiki/Michael_Sullivan_(art_historian)) (1955–1960) appointed as its first Curator. The University Art Museum opens with initial objects acquired through donations and archaeological digs. 1959The museum received a major donation of Indian art from the Government of India.1961–1973As two autonomous national universities in Singapore and Kuala Lumpur were to be established, by 1973, the collection was split into two separate collections.1963[William Willetts](/wiki/William_Willetts_(art_historian)) was appointed as Curator for the University Art Museum (1963–1973). The collections of Southeast Asian ceramics grew in prominence.1973The University Art Museum closed and the collections moved to the National Museum of Singapore.1980Nanyang University and University of Singapore merged to form the National University of Singapore (NUS). The Lee Kong Chian Museum, established in 1970, was subsequently moved to the NUS Kent Ridge Campus. 1980s – 1990sThe University Art Museum collection was brought back from the National Museum to NUS but remained in storage.1997–2000Singapore sculptor Ng Eng Teng donated more than 1,000 works to NUS.2002NUS Museums opens reintroducing collections from the Lee Kong Chian Art Museum, University Art Museum and Ng Eng Teng donation. ## Permanent collection The NUS Museum has over 8,000 artefacts and artworks divided across four collections. Donors to the collection include Lee Seng Tee and the late Ng Eng Teng. Other donations include the Straits Chinese materials received from Ms Agnes Tan. They consist of furniture, ceramics, paintings, and items related to the social history of the [Peranakans](/wiki/Peranakan). ## Lee Kong Chian Art Museum collection The [Lee Kong Chian](/wiki/Lee_Kong_Chian) collection came from the Lee Kong Chian Art Museum formerly established at the [Nanyang University](/wiki/Nanyang_University) in 1970. The collection of Chinese materials mainly included bronzes, jade ceramics and classical paintings, collectively represent the vast and rich history of Chinese art. In 1980, when National University of Singapore was formed, the collection was combined with the former University of Singapore collection. ## South and Southeast Asian collection The seed collection of its South and Southeast Asian collection originated from University of Malaya Art Museum (1955–1961). It contains Indian classical sculptures and miniatures, Southeast Asian ceramics, textiles and modern art. In 1973, part of the earliest collection reallocated to University of Malaya in Kuala Lumpur. Since 1997, the collection was developed and expanded to include modern and contemporary art of Southeast Asia. ## Ng Eng Teng collection In the late 1990s, the [Ng Eng Teng](/wiki/Ng_Eng_Teng) Collection was added into the NUS Museum's collection. It encompasses over 1,000 artefacts, including paintings, sketches, sculptures and macquettes. This collection tracks the style and development of the late artist in Singapore spanning over four decades since the late 1950s. ## Straits Chinese collection The Straits Chinese collection is housed at the NUS [Baba House](/wiki/Baba_House), located at 157 Neil Road. It is one of the last surviving Straits Chinese residential townhouses in Singapore with the interior spaces and architectural ornamentation conserved. The Baba House was launched in September 2008 after research and restoration work done in partnership with the NUS Department of Architecture and the Urban Redevelopment Authority. The Baba House project was made possible through a donation from Ms Agnes Tan, of [Peranakan](/wiki/Peranakan) Chinese descent, to the University. The third floor of the Baba House has been converted into an art gallery to host exhibitions that explore an evolving discourse on the Straits Chinese, cultural encounters and hybridity, and urban developments in Singapore. - [List of museums in Singapore](/wiki/List_of_museums_in_Singapore) - [Baba House](/wiki/Baba_House) - [Peranakan Museum](/wiki/Peranakan_Museum) - [Ng Eng Teng](/wiki/Ng_Eng_Teng) - Official website - NUS Centre for the Arts - NUS Baba House - NUS Museum Blog - NUS Museum Facebook\n",
  "language": "en",
  "processed_at": "2026-01-12T11:35:26.290108",
  "title": "NUS Museum",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/NUS_Museum"
}