{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:35:27.398129"
  },
  "content": "Title at the National University of Singapore The title of **university professor** at the [National University of Singapore](/wiki/National_University_of_Singapore) (NUS) is given to a small number of faculty members for outstanding scholarship and distinguished service to the university. The title was first awarded to [Lim Pin](/wiki/Lim_Pin) in 2000. Presently, there are only six university professors in NUS. ## Present National University of Singapore university professors - [Chong Chi Tat](/wiki/Chong_Chi_Tat), mathematician in recursion/computability theory; former deputy vice chancellor, deputy president and provost of the National University of Singapore from 1996 to 2004. - [Lim Pin](/wiki/Lim_Pin), longest-serving [vice chancellor](/wiki/Vice_chancellor) - [Shih Choon Fong](/wiki/Shih_Choon_Fong), fracture mechanics expert; former president of the National University of Singapore and the [King Abdullah University of Science and Technology](/wiki/King_Abdullah_University_of_Science_and_Technology)[*citation needed*] - [Tan Chorh Chuan](/wiki/Tan_Chorh_Chuan), former president of the National University of Singapore from 2008 to 2017; inaugural Chief Health Scientist and Executive Director of the new Office for Healthcare Transformation in Singapore’s Ministry of Health. - [Wang Gungwu](/wiki/Wang_Gungwu), historian of China and Southeast Asia; former chairman of the [East Asian Institute](/wiki/East_Asian_Institute_(Singapore)) and chairman of the managing board of the [Lee Kuan Yew School of Public Policy](/wiki/Lee_Kuan_Yew_School_of_Public_Policy), National University of Singapore; former vice chancellor of the [University of Hong Kong](/wiki/University_of_Hong_Kong). - [Teck-Hua Ho](/wiki/Teck-Hua_Ho), behavioural scientist; former senior deputy president and provost of the National University of Singapore (NUS); current president of [Nanyang Technological University](/wiki/Nanyang_Technological_University). This Singaporean university, college or other education institution article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:35:27.397755",
  "title": "NUS university professor",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/NUS_university_professor"
}