{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:39:11.003781"
  },
  "content": "* **Oakwell Engineering Ltd v Enernorth Industries Inc*** was an appeal to the [Court of Appeal for Ontario](/wiki/Court_of_Appeal_for_Ontario) by Enernorth Industries Inc. (Enernorth), a Canadian company, from a judgment of the [Ontario Superior Court of Justice](/wiki/Ontario_Superior_Court_of_Justice) granting an application brought by Oakwell Engineering Limited (Oakwell), a Singaporean company, for an order recognizing and enforcing in Ontario a judgment granted against Enernorth by the [High Court of Singapore](/wiki/High_Court_of_Singapore) on October 16, 2003 and affirmed by the [Court of Appeal of Singapore](/wiki/Court_of_Appeal_of_Singapore) on April 27, 2004. The case is notable because Enernorth claimed that the Singapore judgment should not be recognized in Canada because [judicial standards in Singapore](/wiki/Judicial_independence_in_Singapore) were not the same as those in Canada. Among other things, Enernorth alleged that links between the judiciary, business and the executive arm in Singapore suggested a real risk of bias. According to analyst [Michael Backman](/wiki/Michael_Backman), if Enernorth's appeal to the Ontario Court of Appeal had succeeded, this might have had the effect of dissuading companies from using Singaporean law for arbitration and trial, and calling into question the fairness of the Singaporean legal system. However, Enernorth lost its appeal before the Court of Appeal, and was refused leave to appeal to the [Supreme Court of Canada](/wiki/Supreme_Court_of_Canada). ## History of case Oakwell and Enernorth formed a joint venture in June 1997 to build two barge-mounted power stations in [Andhra Pradesh](/wiki/Andhra_Pradesh), India. However, the licenses necessary for the project were never obtained, and a new Indian government requirement to use natural gas instead of furnace oil made the project infeasible. Oakwell commenced [arbitration](/wiki/Arbitration) against Enernorth for failure to release the funds for the project. The two sides signed a Settlement Agreement in December 1998, agreeing that the earlier contract was \"terminated\" and \"discharged\", and that Enernorth was \"released\" from any obligations under the contract. Oakwell sold its stake in the venture to Enernorth. Enernorth paid an initial sum to Oakwell and agreed to pay the remainder within 30 days of \"financial closure\". However, Enernorth later posited that as the Indian government had not granted the licenses necessary, the project had not achieved \"financial closure\", and according to Enernorth's lawyers, the Agreement \"did not contain any express obligation on Enernorth to procure financial closure\". Enernorth sold its remaining stake to an Indian company in 2000. ## Court cases in Singapore In 2002, Oakwell sued Enernorth in the [High Court of Singapore](/wiki/High_Court_of_Singapore) to obtain the further payment. The court found in Oakwell's favor, with Justice [Lai Kew Chai](/wiki/Lai_Kew_Chai) ruling that Enernorth had an \"implied\" obligation to obtain financial closure within six months, and awarding Oakwell the sum of [S$](/wiki/Singapore_dollar)4.39 million. The case was appealed to Singapore's [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore), but [Chief Justice](/wiki/Chief_Justice_of_Singapore) [Yong Pung How](/wiki/Yong_Pung_How) upheld Justice Lai's ruling. ## Court cases in Canada ### Superior Court of Ontario As Enernorth had no seizable assets in Singapore, Oakwell brought the case against Enernorth to Canada. Justice Gerald Day of the [Ontario Superior Court of Justice](/wiki/Ontario_Superior_Court_of_Justice) allowed Oakwell's claim to be enforced. ### Ontario Court of Appeal However, Enernorth appealed to the Ontario Court of Appeal on the grounds that the lower court erred. According to Enernorth, the Superior Court had considered only whether there was bias against Enernorth in this *particular* case, but enforcing the judgment would require that Oakwell prove to the court that the standard of justice in Singapore *in general* must \"meet Canadian constitutional standards\". As evidence, Enernorth obtained the testimony of expert witnesses, including [Ross Worthington](/wiki/Ross_Worthington), Adjunct Professor of Governance at the National Key Centre for Ethics, Law, Justice and Governance at [Griffith University](/wiki/Griffith_University), Australia; and [Francis Seow](/wiki/Francis_Seow), former [Solicitor-General of Singapore](/wiki/Solicitor-General_of_Singapore). In his affidavit, Worthington stated that \"all aspects of the governance of Singapore, including the judiciary, are carefully manipulated and ultimately controlled by a [core executive](/wiki/En_cadre) of individuals who use their powers to maintain their own power and further their own political, economic, social and familial interests.\" Seow's affidavit claimed that the court proceedings in Singapore had not been heard by an independent judiciary due to the \"consuming and controlling power of Singapore's ruling party over all facets of life in Singapore\", and that defamation suits had been used by the [Government of Singapore](/wiki/Government_of_Singapore) to suppress opposition politicians and non-compliant media, citing the example of the prosecution of [J.B. Jeyaretnam](/wiki/J.B._Jeyaretnam). The Singapore [Ministry of Law](/wiki/Ministry_of_Law_(Singapore)) rejected the allegations of bias on the part of the Singapore judiciary as \"spurious\". Enernorth's appeal was dismissed by the [Court of Appeal for Ontario](/wiki/Court_of_Appeal_for_Ontario) in a decision dated June 9, 2006. The judgment supported Justice Day's findings that the evidence of Enernorth's expert witnesses was \"either unreliable ... or too general to prove that there was not a fair trial in this case\". It also supported the findings that \"there was a lack of evidence of corruption or bias [within Singapore legal system] in private commercial cases and no cogent evidence of bias in this specific case\". ### Canadian Supreme Court Enernorth then applied to the [Supreme Court of Canada](/wiki/Supreme_Court_of_Canada) for leave to appeal against the decision of the Ontario Court of Appeal. Before the Supreme Court, Enernorth argued that to recognize judgments such as those from Singapore meant that Canadian judges were \"mere functionaries or sheriffs for foreign legal systems, no matter how corrupt they are\". Oakwell responded that it was for Canadian courts to decide on this, based on the criteria laid out by the courts. Among other things, it pointed out that Enernorth had neither alleged bias nor contested the Singapore courts' jurisdiction when the case was heard in Singapore. When the case was moved to Canada, two of Enernorth's expert witnesses – including Francis Seow – had admitted they were unaware of any commercial case from Singapore that had been attacked as unfair or biased. On January 18, 2007, [Chief Justice](/wiki/Chief_Justice_of_Canada) [Beverley McLachlin](/wiki/Beverley_McLachlin) and Justices [Louise Charron](/wiki/Louise_Charron) and [Marshall Rothstein](/wiki/Marshall_Rothstein), sitting in the Supreme Court, dismissed Enernorth's leave application without providing detailed reasons and ordered it to bear the costs of the application. ## Notes - *Oakwell Engineering Limited v. Enernorth Industries Inc.*, 2005 CanLII 27149, Court File Nos. 04-CV-271121CM3 & 04-CV-274860CM2, (2005) 76 O.R. (3d) 528, [Superior Court of Justice](/wiki/Ontario_Superior_Court_of_Justice) (Ontario, Canada). - *Oakwell Engineering Ltd. v. Enernorth Industries Inc.*, 2006 CanLII 19327, Docket No. C43898, [Court of Appeal](/wiki/Court_of_Appeal_for_Ontario) (Ontario, Canada) (\"*Oakwell v. Enernorth* (C.A.)\"). - *Enernorth Industries Inc. v. Oakwell Engineering Limited* 2007 CanLII 1145, [Supreme Court](/wiki/Supreme_Court_of_Canada) (Canada). - [Rodan, Garry](/wiki/Garry_Rodan) (October 2006), \"Singapore's founding myths vs. freedom\", *[Far Eastern Economic Review](/wiki/Far_Eastern_Economic_Review)*, archived from the original on April 30, 2013. - Sullivan, John P.; Woolley, Johnathan M. [S.] (2006), \"*Oakwell Engineering Limited v. Enernorth Industries Inc.*: Questions of Burden and Bias in the Enforcement of Foreign Judgments\", *[Canadian Bar Review](/wiki/Canadian_Bar_Review)*, **85**: 605–632, archived from the original (PDF) on April 20, 2013.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:39:11.003462",
  "title": "Oakwell Engineering Ltd v Enernorth Industries Inc",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Oakwell_Engineering_Ltd_v_Enernorth_Industries_Inc"
}