{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:38:22.685803"
  },
  "content": "Marker to denote what topics are permissible for public discussionThis article's lead section **contains information that is not included elsewhere in the article**. If this information is appropriate for the lead, it should also be included in the article's body. Relevant discussion may be found on the talk page. *(May 2023)* *(Learn how and when to remove this message)*This article's **factual accuracy may be compromised due to out-of-date information**. Please help update this article to reflect recent events or newly available information. *(September 2022)* An **OB marker**, short for \"**[out of bounds](/wiki/Out_of_bounds) marker**\", is used in [Singapore](/wiki/Singapore) to denote what topics are permissible for public discussion. Discussion topics that go beyond the OB marker, are considered to be either societal, cultural or political [taboos](/wiki/Taboo). The entire phrase \"out of bounds marker\", however, is rarely used within the political landscape. ## Etymology The term is adopted from [golf](/wiki/Golf), where an out of bounds marker denotes the area beyond which playing is forbidden and not allowed. However, unlike golf, the OB markers of Singaporean political discourse are not visible. The term \"OB markers\" was first used in 1991 by the then-[Minister for Information and the Arts](/wiki/Minister_for_Information_and_the_Arts) [George Yeo](/wiki/George_Yeo) to describe the boundaries of acceptable political discourse. ## Considerations An additional complication is introduced by the fact that OB markers may shift depending on the political climate, so a topic that was previously permissible may be banned in the future, and *vice versa*. In 1999, George Yeo said that it is difficult to define exactly what the OB markers are in advance. *[Straits Times](/wiki/Straits_Times)* editor-in-chief Cheong Yip Seng found OB markers \"bewildering\", stating that topics deemed off-limits during his tenure included stories about a stamp dealer, carpet auctions, [monosodium glutamate](/wiki/Monosodium_glutamate), [feng shui](/wiki/Feng_shui) and unflattering pictures of politicians. In 2003, a Remaking Singapore sub-committee, chaired by [Raymond Lim](/wiki/Raymond_Lim), described OB markers as \"action and speech that engage directly in electioneering and party politics; that is, within the arena of the contest for political power\". ## Notable cases There are several notable cases where the Singaporean government has flagged OB markers. ### Catherine Lim In 1994, author [Catherine Lim](/wiki/Catherine_Lim) published an essay *[The PAP and the people - A Great Affective Divide](/wiki/The_PAP_and_the_people_-_A_Great_Affective_Divide)* suggesting that the [People's Action Party](/wiki/People%27s_Action_Party) is not representative of the people. Then-Prime Minister [Goh Chok Tong](/wiki/Goh_Chok_Tong) warned her to join a political party if she wanted to air political views in public, and stated that \"demolishing the respect for and standing of the Prime Minister and his government by systematic contempt and denigration in the media\" was out of bounds. ### 2005 White Elephant incidents The lack of clear definition of OB marker resulted in mixed responses by the police and the government during the [\"White Elephant\" incidents](/wiki/Buangkok_MRT_station#First_white_elephant_incident) at [Buangkok MRT station](/wiki/Buangkok_MRT_station) in 2005. An undisclosed person posted a series of cut-outs of elephants to criticise the delayed opening of the mass transit station. This led to a police investigation. Although the person was later let off with a stern warning, Deputy Prime Minister [Wong Kan Seng](/wiki/Wong_Kan_Seng) commented that \"we cannot apply the law to some and turn a blind eye to others. If we do, then the law becomes the real white elephant.\" Later, a group of students from [Raffles Girls' School](/wiki/Raffles_Girls%27_School) were preparing to sell T-shirts bearing the phrase \"Save the White Elephants\" to raise fund for a charity. This prompted a warning from the police, but later Wong admitted that the police had over-reacted. ### mrbrown In 2006, blogger [mrbrown](/wiki/Mrbrown) wrote the article \"S'poreans are fed, up with progress!\", for his weekly opinion column in *[Today](/wiki/Today_(Singapore_newspaper))* concerning the rising costs of living in Singapore. The [Ministry of Information, Communications and the Arts](/wiki/Ministry_of_Information,_Communications_and_the_Arts) labelled him a \"partisan player\" whose views \"distort the truth\", and his column was suspended by the paper. ## Criticism [James Gomez](/wiki/James_Gomez_(politician)), a Singaporean political science academic and member of the [Singapore Democratic Party](/wiki/Singapore_Democratic_Party), has described OB markers as \"unconstitutional: by subscribing to the idea of OB markers, people abandon their constitutional rights or risk having such rights abused.\" He described adherence to OB markers as a form of [self-censorship](/wiki/Self-censorship). The Southeast Asian Press Alliance has described the OB marker system as \"a suffocating environment where the limits of one's freedom to express is defined by citizens themselves.\" ## Other related restriction on speech While OB Marker usually refers to the restriction on political discourse, there are other forms of restriction on speech in Singapore. ### Race and religion Under the [Singapore Sedition Act](/wiki/Sedition_Act_(Singapore)), topics known to be permanently out of bounds are comments that might produce ill-will and hostility between different races and religious groups. This applies to the Internet as well, where 3 people were arrested and charged under the [Sedition Act](/wiki/Sedition_Act_(Singapore)) for posting racist comments on the Internet, and two subsequently sentenced to [imprisonment](/wiki/Imprisonment) in September 2005. At Singapore's [Speakers' Corner](/wiki/Speakers%27_Corner,_Singapore), the rules state that: > The speech should not be religious in nature, and should not have the potential to cause feelings of enmity, hatred, ill-will or hostility between different racial or religious groups. ### Homosexuality Homosexuality has long been a taboo subject in Singapore. For example, in 2005, an overseas-located gay website was banned by the [Media Development Authority](/wiki/Media_Development_Authority). However, in 2007, the proposal to repeal [sections 377 and 377A of the Penal Code](/wiki/Sections_377_and_377A_of_the_Penal_Code_(Singapore)) received a very public airing. This led to a local journalist, [Sumiko Tan](/wiki/Sumiko_Tan), suggesting that the OB markers have been redefined. Section 377 was eventually repealed in 2023. ### Others Other past and present topics widely considered out of bounds include: - Corruption or other alleged failings in government, such as in *[Lee v. FEER](/wiki/Far_Eastern_Economic_Review#Legal_issues)* - Singapore portal - Politics portal - [Censorship in Singapore](/wiki/Censorship_in_Singapore) - [Politics of Singapore](/wiki/Politics_of_Singapore) - [Third rail (politics)](/wiki/Third_rail_(politics)) - [Overton window](/wiki/Overton_window) - [Koh Buck Song](/wiki/Koh_Buck_Song), \"Internet OB Markers Should Protect Nation\", *The Straits Times*, 5 August 1996, Life, pg 4.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:38:22.685435",
  "title": "OB marker",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/OB_marker"
}