{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:39:14.725605"
  },
  "content": "* *Objectifs** is an independent non-profit visual arts space in [Singapore](/wiki/Singapore) that aims to cultivate original voices in visual storytelling, and to inspire and broaden perspectives through the power of images. It presents a year round programme of exhibitions, screenings, residencies, developmental programmes, talks and workshops that advance the practice and appreciation of photography and film. ## Background Established in 2003, Objectifs first took root in Liang Seah Street in the Bugis area in [Singapore](/wiki/Singapore). The centre was co-founded by Singaporeans Emmeline Yong and Dawn Teo. It moved to [Arab Street](/wiki/Arab_Street) in 2009 and occupied 4 floors in an art deco influenced shophouse. In June 2015, Objectifs moved to its current location, at 155 Middle Road, [Bugis](/wiki/Bugis,_Singapore), in the arts and heritage district, under the National Arts Council's Arts Housing Scheme. The facilities include a gallery/screening space, two multipurpose spaces, outdoor courtyards and a retail store. ## Programmes - Women in Film & Photography is an annual programme celebrating extraordinary and groundbreaking works by women photographers and filmmakers, highlighting the important contributions that women make to the arts. - Stories That Matter is an annual programme that looks at critical issues and trends in non-fiction visual storytelling. - Curator Open Call is an annual programme that invites Singapore-based curators to submit proposals for exhibitions at Objectifs and aims to broaden perspectives by supporting curatorial research and innovative ways of presenting image-based work. - The Objectifs Documentary Award is awarded to photographers for original voices in visual storytelling in Singapore and the wider region, encouraging them to discover and tell stories about their native communities. ### Gallery The gallery spaces at Objectifs have a strong focus on works by artists from Asia and Singapore.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:39:14.725263",
  "title": "Objectifs",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Objectifs"
}