{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:38:26.842799"
  },
  "content": "Annual mass participation cycling event**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **contains promotional content**. Please help improve it by removing promotional language and inappropriate external links, and by adding encyclopedic text written from a neutral point of view. *(December 2011)* *(Learn how and when to remove this message)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"OCBC Cycle\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(December 2011)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* **OBC Cycle** is an annual mass-participation cycling event held on closed public roads in Singapore. The event is organised by [OCBC Bank](/wiki/OCBC_Bank). The event also hosts the Southeast Asia Speedway Championship which is sanctioned by the [Singapore Cycling Federation](/wiki/Singapore_Cycling_Federation). ## History This section needs to be **updated**. Please help update this article to reflect recent events or newly available information. *(February 2024)* The event has gained popularity each year with more than 5,300 participants in 2009 and 9,000 in 2010. In 2011, over 10,000 participated in OCBC Cycle Singapore 2011.[*citation needed*] Due to [COVID-19 pandemic in Singapore](/wiki/COVID-19_pandemic_in_Singapore), the 2020 and 2021 editions of the event were replaced with \"virtual rides\". In 2022, about 2,000 people took part in the event. Due to the poor weather, the second wave of riders was delayed and the distance shortened from 20 km to 13 km. In 2023, about 7,300 people took part in the event. Due to wet weather, one of the cycling categories had its route of 40 km reduced to 20 km. The 2024 edition was held on 11–12 May 2024. The 2025 edition was converted to virtual due to [2025 Singaporean general election](/wiki/2025_Singaporean_general_election). ## Fund raising OCBC Cycle Singapore also recognises the need to give back to the community and has chosen to support the National Cancer Research Fund and the Singapore Children's Society. - Official website - Search: OCBC Cycle via NewspaperSG\n",
  "language": "en",
  "processed_at": "2026-01-12T11:38:26.842471",
  "title": "OCBC Cycle",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/OCBC_Cycle"
}