{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:38:23.930328"
  },
  "content": "Singaporean multinational banking and financial services corporation **Oversea-Chinese Banking Corporation Limited** ([Chinese](/wiki/Simplified_Chinese_characters): 华侨银行有限公司; [pinyin](/wiki/Pinyin): *Huáqiáo Yínháng Yǒuxiàn Gōngsī*), abbreviated as **OCBC**, is a [Singaporean](/wiki/Singapore) [multinational](/wiki/Multinational_corporation) [banking](/wiki/Bank) and [financial services](/wiki/Financial_services) corporation headquartered at the [OCBC Centre](/wiki/OCBC_Centre). As of 2023, it had [S$](/wiki/Singapore_dollar)581 billion in assets, making it the [second largest bank in Southeast Asia](/wiki/List_of_largest_banks_in_Southeast_Asia) by assets. Globally it operates over 400 branches and representative offices in 19 countries, including [Indonesia](/wiki/Indonesia), [mainland China](/wiki/Mainland_China), [Hong Kong](/wiki/Hong_Kong) and [Macau](/wiki/Macau). OCBC is one of the world's most highly rated banks, with credit ratings of Aa1 from [Moody’s](/wiki/Moody%E2%80%99s) and AA from [Standard & Poor's](/wiki/Standard_%26_Poor%27s). It is also consistently ranked amongst the top three \"safest banks in the world\" by the magazine *[Global Finance](/wiki/Global_Finance_(magazine))*. [The Asian Banker](/wiki/The_Asian_Banker) named OCBC as Singapore's strongest bank for 2018–2019, and the 5th strongest in the [Asia–Pacific](/wiki/Asia%E2%80%93Pacific) region under subsidiary [Bank OCBC NISP](/wiki/Bank_OCBC_NISP), [OCBC Bank (Hong Kong)](/wiki/OCBC_Bank_(Hong_Kong)) and OCBC Bank (Macau) respectively. OCBC was awarded World's Best Bank (Asia-Pacific) in 2019 by [Global Finance Magazine.](/wiki/Global_Finance_(magazine)) It operates on [Malaysia](/wiki/Malaysia) as OCBC Bank (Malaysia) Berhad and is one of Malaysia's largest foreign banks. ## History ### Founding and early years On 31 October 1932, three banks – [Chinese Commercial Bank](/wiki/Chinese_Commercial_Bank) (1912), [Ho Hong Bank](/wiki/Ho_Hong_Bank) (1917), and Oversea-Chinese Bank (1919) – merged and consolidated their strengths to form Oversea-Chinese Banking Corporation under the leadership of [Hoklos](/wiki/Hoklo_people) Tan Ean Kiam (co-founder and managing director of Oversea-Chinese Bank) and [Lee Kong Chian](/wiki/Lee_Kong_Chian), who was then vice-chairman of Chinese Commercial Bank. Lee played a central role in leading the amalgamation and is affectionately known today as the \"founding father\" of OCBC Bank. When OCBC began operation in February 1933, it was already one of the strongest local banks in the [Straits Settlements](/wiki/Straits_Settlements). In 1942 during [World War II](/wiki/World_War_II), all the local banks in Singapore closed briefly during the early days of the Japanese Occupation. By April 1942 most banks, including OCBC, had resumed normal operations. In Indonesia, the Japanese occupation authorities closed OCBC's branches in Sumatra. During the war, the bank moved its head office to Bombay, India and only re-registered back in [Singapore](/wiki/Singapore) after the war ended. OCBC's branch in [Xiamen](/wiki/Xiamen) survived the war and in the 1950s, OCBC was one of only four foreign banks to have branches in China. ### Post-war expansion and operations After the war, OCBC re-established its branches in [Jambi](/wiki/Jambi_(city)), [Jakarta](/wiki/Jakarta), and [Surabaya](/wiki/Surabaya). However, the [1963 conflict](/wiki/Konfrontasi) between Indonesia and [Malaysia](/wiki/Malaysia) (which then included Singapore) resulted in the closure of OCBC's branches there. That same year the [revolutionary government](/wiki/Politics_of_Burma#Military_socialist_era) in Burma nationalized OCBC's two branches there, which became People's Bank No. 14. The bank was criticized for not expanding fast enough to meet the needs of the post-war Chinese business community, especially in the smaller towns of Malaya. One of the critics was Tan Sri [Khoo Teck Puat](/wiki/Khoo_Teck_Puat) (then deputy general manager) who resigned in 1959 after failing to be appointed to the bank’s board of directors, and subsequently set up [Malayan Banking](/wiki/Malayan_Banking) in [Kuala Lumpur](/wiki/Kuala_Lumpur) in 1960 with 80 former OCBC staff. ### Growth in Singapore By 1970, OCBC's total assets exceeded [S$](/wiki/Singapore_dollar)1 [billion](/wiki/1000000000_(number)), making OCBC the largest financial institution with the biggest deposit base in Singapore. By the end of 1981, OCBC’s total assets had grown to over S$7 billion. In December 1972, OCBC acquired Four Seas Communications Bank, the oldest surviving Chinese bank in Singapore. The bank had been founded in 1906 as the Sze Hai Tong Bank and its founders had targeted the [Teochew](/wiki/Teochew_people) community. In 1976, the landmark [OCBC Centre](/wiki/OCBC_Centre), designed by renowned American architect [I. M. Pei](/wiki/I._M._Pei), was completed and serves as OCBC's current headquarters. On 9 May 1989, OCBC took on a new corporate identity by changing its logo and its name to OCBC Bank. ### Overseas expansion The next major acquisition occurred in August 2001, when OCBC acquired Keppel Capital Holdings and all its subsidiaries, including [Keppel TatLee Bank](/wiki/Keppel_TatLee_Bank), Keppel Securities, and Keppel TatLee Finance. By February 2002, both OCBC and Keppel TatLee banks were operationally and legally integrated. On 25 June 2004, OCBC Bank established a wholly owned subsidiary e2 Power Pte Ltd to provide back-office operations and technology support and transaction processing services in Singapore. A similar operating company, e2 Power Sdn Bhd was also set up on 21 July 2004 in Malaysia. On 3 June 2005, OCBC saw the grand opening ceremony of its newly constructed Malaysia headquarters and main branch (Menara OCBC building) in Kuala Lumpur, officiated by then-Malaysian prime minister [Abdullah Ahmad Badawi](/wiki/Abdullah_Ahmad_Badawi), and in July the same year, OCBC opened an off-shore branch in [Brunei](/wiki/Brunei). ### Modern innovations On 11 May 2017, OCBC entered into an agreement to acquire [National Australia Bank](/wiki/National_Australia_Bank)’s private wealth business in Singapore and Hong Kong. The acquisition was completed in November 2017. The deposits and mortgages booked in Hong Kong was transferred to [OCBC Bank (Hong Kong)](/wiki/OCBC_Bank_(Hong_Kong)) while those booked in Singapore was transferred to OCBC Bank. In March 2020, OCBC announced its partnership with [Xero](/wiki/Xero_(company)), a [New Zealand](/wiki/New_Zealand)-based cloud accounting software, to help [small and medium-sized enterprise](/wiki/Small_and_medium-sized_enterprises) customers digitise their operations. In July 2020, OCBC launched HealthPass, a healthcare mobile application that aims to connect patients with medical doctors in Singapore via online consultation. On 3 September 2024, OCBC announced that it would soon allow children aged 7 to 15 (which it described as \"Generation Alpha\") to have their own bank account, operate their bank account digitally, and to have their own debit card. It stated that this OCBC MyOwn Account would be registered solely in the name of the child, but would only be operable \"within boundaries and controls set by parents\". The service would be launched less than a month later on 20 October 2024. ## Shareholders The ten largest shareholders as of 8 March 2021 were: Name of ShareholdersNo. of shares held%*1.Citibank Nominees Singapore Pte Ltd705,234,45915.762.DBS Nominees (Pte) Ltd481,599,60710.763.Selat (Pte) Ltd466,981,88210.434.DBSN Services Pte Ltd288,391,3246.445.HSBC (Singapore) Nominees Pte Ltd209,467,3544.686.Lee Foundation198,210,2574.437.Singapore Investments Pte Ltd157,007,5263.518.Lee Rubber Company (Pte) Ltd141,656,3643.179.Herald Investment (Pte) Ltd101,975,4112.2810Raffles Nominees (Pte) Ltd79,791,3561.78 ** Percentage is calculated based on the total number of issued ordinary shares, excluding treasury shares.* ## Subsidiaries ### OCBC Securities OCBC Securities Private Limited is a wholly owned subsidiary of OCBC Bank, and is a member of the Singapore Exchange Securities Trading Limited (SGX-ST) and the Singapore Exchange Derivatives Trading Limited (SGX-DT). It was established in 1986. ### Great Eastern Holdings In 2004, OCBC acquired [Great Eastern Holdings](/wiki/Great_Eastern_Life) (GEH) following a voluntary cash offer. GEH had S$53.1 billion in assets and 3.8 million policyholders as at 30 September 2010. GEH operates two distribution channels – the tied agency force and bancassurance. The company also operates in Malaysia, Indonesia and Brunei. In October 2024, OCBC upped its stake in insurance arm Great Eastern Holdings to 93.72% after making a privatisation bid for the insurer. ### Lion Global Investors (LGI) In September 2005, OCBC Asset Management Limited (the asset management arm of OCBC Bank) and Straits Lion Asset Management Limited (the asset management arm of Great Eastern) merged to form Lion Capital Management. In 2008, Lion Capital Management was renamed as Lion Global Investors. The Brunei Branch of Lion Global Investors also began operations. Lion Global Investors had total assets under management of S$69.9 billion as of 31 March 2023. Lion Global Investors Limited is 70% owned by Great Eastern Holdings Limited and 30% owned by Orient Holdings Private Limited, a wholly owned subsidiary of OCBC Bank. ### Bank of Singapore Bank of Singapore, (formerly ING Asia Private Bank), is a wholly owned private banking subsidiary of OCBC. Following OCBC's acquisition of ING Asia Private Bank in October 2009, Bank of Singapore was formed on 29 January 2010 from the combination of ING Asia Private Bank and OCBC Private Bank. With branches in Hong Kong and Dubai and a representative office in Makati City, Bank of Singapore serves [high-net-worth individuals](/wiki/High-net-worth_individual) and wealthy families of Singapore, Indonesia, Malaysia, Philippines, mainland China, Hong Kong, Taiwan, the Middle East and Europe, as well as global Non-Resident Indians. ### Singapore Island Bank Singapore Island Bank was formerly known as Bank of Singapore which housed the division, finatiQ, set up by OCBC Bank in 2000 as a self-service [online bank](/wiki/Online_banking) during the [dot-com bubble](/wiki/Dot-com_bubble). On 29 January 2010, OCBC completed its acquisition of ING Asia Private Bank and renamed it Bank of Singapore. Therefore, OCBC renamed the bank that housed finatiQ, Singapore Island Bank to differentiate these two separate businesses to avoid confusion. As an online-only service provider of OCBC Bank, finatiQ could no longer meet the growing needs of the bank's customers and had ceased business on 30 June 2011. ### Bank OCBC NISP In 2004, OCBC Bank acquired a 22.5% stake in PT Bank NISP Tbk (\"Bank NISP\"), its joint-venture partner in PT OCBC Indonesia since 1996. With the completion of this transaction, Bank NISP became an associate company of OCBC Bank. Bank NISP was ranked the 11th largest Indonesian bank by assets and had a network of 135 branches and offices and, over 3,000 shared [ATMs](/wiki/Automated_teller_machine). In the same year, OCBC Bank purchased an additional 28.5% stake in Bank NISP, raising its shareholding in Bank NISP to 51%. OCBC Bank subsequently raised its stake to 70.62% in 2005. By 2008, it had increased its stake in Bank NISP to 74.73%. In 2008, Bank NISP changed its name to Bank OCBC NISP. As of 30 September 2010, Bank OCBC NISP had 5,995 employees, total assets of Rp 40.2 trillion, and served customers through a network of 411 offices in 62 cities and 576 ATMs throughout Indonesia. Its customers could also use more than 37,500 ATMs (including ATMs belonging to [ATM Bersama](/wiki/ATM_Bersama), [Bank Central Asia](/wiki/Bank_Central_Asia), OCBC Bank in Singapore, and BankCard in Malaysia). Subsequently, in November 2010, OCBC Indonesia merged with OCBC NISP. ### OCBC Al-Amin Bank Berhad OCBC wholly owns OCBC Al-Amin Bank, its Islamic banking subsidiary, which offers Islamic banking products and services in Malaysia. OCBC Al-Amin Bank Berhad was the first Singapore-based Islamic Bank established in Malaysia in 2008 to provide a full range of Shariah-compliant financial solutions based on the applicable Shariah contract and with the endorsement of the Shariah Advisory Committee. ### OCBC China Headquartered in [Shanghai](/wiki/Shanghai), OCBC China employs around 1,500 staff at its head office and 16 branches and sub-branches across 14 cities in China's mainland, covering Shanghai, [Suzhou](/wiki/Suzhou,_Jiangsu), [Shaoxing](/wiki/Shaoxing), [Shenzhen](/wiki/Shenzhen), [Guangzhou](/wiki/Guangzhou), [Foshan](/wiki/Foshan), [Xiamen](/wiki/Xiamen), [Zhuhai](/wiki/Zhuhai), [Chongqing](/wiki/Chongqing), [Chengdu](/wiki/Chengdu), [Wuhan](/wiki/Wuhan), [Beijing](/wiki/Beijing), [Tianjin](/wiki/Tianjin) and [Qingdao](/wiki/Qingdao). OCBC Group established its first presence in mainland China in 1925 with the opening of Xiamen branch, after which it has been operating without interruption in mainland China for nearly 100 years. In 2007, OCBC Group incorporated its local entity in Shanghai. In 2014, OCBC Group completed acquisition of the former Wing Hang Bank and established OCBC Wing Hang China on 18 July 2016. The bank officially changed its name to OCBC Bank Limited and launched OCBC China as its new brand name on 6 December 2023. ### OCBC Bank (Hong Kong) In March 2014, OCBC Bank offered to pay nearly US$5 Billion for **Wing Hang Bank**, one of Hong Kong's last family-owned banks. Wing Hang was the eighth-largest lender in Hong Kong. Under the Hong Kong Companies Ordinance, OCBC Bank, with 97.52 percent of Wing Hang's shares, compulsorily acquired Wing Hang on 29 July 2014. On 1 October 2014, Wing Hang Bank was rebranded as OCBC Wing Hang Bank to reflect its integration into the OCBC family. On 3 July 2023, OCBC Wing Hang Bank Limited has further changed its name to \"OCBC Bank (Hong Kong) Limited\" and in Macau, \"Banco OCBC Weng Hang, S.A.\" has changed its name to **\"Banco OCBC (Macau), S.A.\"**. \"Wing Hang\" or \"Weng Hang\" is no longer in the legal names of both OCBC's Hong Kong and Macau subsidiaries. ## Equity investment ### Ningbo Commercial Bank In 2006, OCBC Bank first acquired a 12.2% equity holding in China's Ningbo Commercial Bank. OCBC subsequently raised its stake in the renamed [Bank of Ningbo](/wiki/Bank_of_Ningbo) to 20% (the maximum allowed) in 2014. ## Controversies ### Phishing scams (2021) In December 2021, nearly 470 customers of OCBC lost a combined [S$](/wiki/Singapore_dollar)8.5 million after fallen prey to [phishing](/wiki/Phishing) scams involving OCBC, when scammers took advantage of old [short message service](/wiki/SMS) (SMS) technology to impersonate the bank to send unsolicited SMSes and dupe victims into handing over their [online banking](/wiki/Online_banking) log-in details. OCBC later announced in January 2022 that it will make \"full goodwill payouts\" to all victims. ### Wirecard scandal (2023) In June 2023, OCBC was fined [S$](/wiki/Singapore_dollar)600,000 by the [Monetary Authority of Singapore](/wiki/Monetary_Authority_of_Singapore) (MAS) for breaching anti-[money laundering](/wiki/Money_laundering) and anti-[terrorism financing](/wiki/Terrorism_financing) rules, in a matter related to the [German](/wiki/Germany) payments provider [Wirecard](/wiki/Wirecard) scandal between June 2015 and January 2016 relating to accounts maintained by one corporate customer. OCBC had failed to inquire into the background and purpose of [transactions](/wiki/Financial_transaction) that were not consistent with its knowledge of the customer, or were unusually large and exhibited an unusual pattern that had no apparent economic purpose. The bank also failed to probe into the customer’s ownership and control structure when its declared [beneficial owner](/wiki/Beneficial_owner) was not named in its corporate registration documents. ### Banking disruptions (2023 - 2024) On 28 August 2023, OCBC's banking services were disrupted by a technical problem at about 8.33am, which affected both consumer and banking customers. The affected services included the bank's internet and mobile banking platforms, the PayNow service, ATMs, cards, and Velocity, the bank's digital business banking platform. All banking services were restored at about 12.20pm. According to media reports, OCBC shares gained 1.05% in afternoon trading that day. On 7 November 2023, the bank's services were affected by \"intermittent technical issues\" around noontime. The services affected included digital banking services, fund transfer services, PayNow services, and SMS one-time passcode services. According to media reports, some OCBC customers who contacted the bank's customer support were told that the service was fine, and were advised to uninstall and reinstall the app. The services were restored at about 2.30pm. On 1 September 2024, at about 11.50am, OCBC acknowledged that some users were having difficulties using its internet and mobile banking services. Some users reported being unable to make payments, such as via PayNow. The bank stated that no customer data had been compromised and its customers' funds remained safe. It announced at 3.22pm that the services had returned to normal. On 28 September 2024, it was reported that some internet and mobile banking users were not able to view their account balances and transaction history, or could not log in or carry out transactions. OCBC acknowledged at 5.03pm that day that there was a disruption to its services. It subsequently announced at 7.04pm that its internet and mobile banking services were restored. ## Citations and references CitationsReferences - Turnell, Sean (2009) *Fiery Dragons: Banks, Moneylenders and Microfinnance in Burma*. (NAIS Press). [ISBN](/wiki/ISBN_(identifier)) 9788776940409 - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:38:23.929920",
  "title": "OCBC Bank",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/OCBC_Bank"
}