{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:39:17.986823"
  },
  "content": "Television programming block in SingaporeTelevision channel **Okto** is a Singaporean children's [programming block](/wiki/Programming_block) broadcast by [Mediacorp](/wiki/Mediacorp)'s [Channel 5](/wiki/Channel_5_(Singaporean_TV_channel)) in [English](/wiki/Singapore_English) and [Channel 8](/wiki/Channel_8_(Singaporean_TV_channel)) in [Mandarin Chinese](/wiki/Mandarin_Chinese). The brand originally operated as a standalone [free-to-air](/wiki/Free-to-air) channel from 19 October 2008 to 1 May 2019, having been spun off from the Kids Central and Arts Central strands aired by [Central](/wiki/Central_(TV_channel)) (whose [Tamil language](/wiki/Tamil_language) programming had been concurrently spun off as the new channel [Vasantham](/wiki/Vasantham_(TV_channel))). The channel also occasionally aired sports programming; from 2017, arts programming was subsumed by other Mediacorp channels, resulting in the primetime block primarily airing sports programming. On 1 May 2019, the channel was discontinued, and Okto transitioned to becoming a children's block on [Channel 5](/wiki/Channel_5_(Singaporean_TV_channel)), and a content brand on [MeWatch](/wiki/MeWatch). The brand was later extended to [Channel 8](/wiki/Channel_8_(Singaporean_TV_channel)) in Chinese. ## History In March 2008, MediaCorp announced that it would split its channel [Central](/wiki/Central_(TV_channel)) into two separate channels; a channel serving the [Indian](/wiki/Indian_Singaporeans) community, and a channel focused on arts and children's programming. On 19 October 2008, the channel officially launched as Okto, alongside the new Tamil channel [Vasantham](/wiki/Vasantham_(TV_channel)). The name Okto was derived from the [Greek](/wiki/Greek_language) numeral for \"eight\", as the channel was on [StarHub TV](/wiki/StarHub_TV) channel 8 (the former EPG slot and channel allotments of the defunct [Channel i](/wiki/Channel_i_(Singaporean_TV_channel))) and [Singtel Mio TV](/wiki/Singtel_TV) channel 108. Okto was split into two [strands](/wiki/Block_programming); children's programming (later branded as *Okto Jr.)* occupied most of the schedule, while programming from evening to closedown focused on arts and cultural programming. In June 2014, coinciding with its rights to selected matches of the [FIFA World Cup](/wiki/2014_FIFA_World_Cup), the *Sports on Okto* brand was introduced. In 2017, arts programming was dispersed from Okto to other Mediacorp channels, in favour of expanding the nightly *OktoSports* block. On 1 May 2019, Okto was discontinued as a television channel, with its children's programming becoming a daytime [block](/wiki/Block_programming) on [Channel 5](/wiki/Channel_5_(Singaporean_TV_channel)) under the *Okto on 5* branding, and a content brand on Mediacorp's streaming platform Toggle (now [MeWatch](/wiki/MeWatch)); previously, Channel 5's daytime programming largely consisted of a simulcast of Mediacorp's news channel [CNA](/wiki/CNA_(TV_network)). Okto's sports programming was also moved to Toggle and Channel 5. Okto's channel license was subsequently surrendered to the [Infocomm Media Development Authority](/wiki/Infocomm_Media_Development_Authority) (IMDA). On 6 February 2021, the Okto brand was extended to [Channel 8](/wiki/Channel_8_(Singaporean_TV_channel))'s children's programming block 乐乐窝 (Lè Lè Wō), which was rebranded as **‘Okto尽在8' (Okto on 8)**. ## Programming Since its standalone channel era, Okto mostly aired English-language programmes, with selected series being broadcast in their original language. The channel aired mostly children's programmes, as well as some arts and sports programmes. The channel's target audiences were children aged 4–13, and adults aged 18–39. From June 2014 to 30 April 2019, Sports on Okto (later renamed OktoSports) was introduced which showed sporting events live as well as recorded and delayed coverage. It occupied the nightly schedule from 9pm to closedown every night from 2017 to 2019. In September 2024, expanding upon existing agreements with the company, Mediacorp made its largest-ever acquisition of children's programmes from [BBC Studios](/wiki/BBC_Studios), covering 150 hours of programming (including series such as *[Go Jetters](/wiki/Go_Jetters)*, *[Hey Duggee](/wiki/Hey_Duggee)* and *[JoJo & Gran Gran](/wiki/JoJo_%26_Gran_Gran)*) to be carried by Okto and MeWatch. - Official website (archived)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:39:17.986441",
  "title": "Okto",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Okto"
}