{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:39:28.340182"
  },
  "content": "Historical building in Singapore The **Old Tao Nan School**[a] is a historic building in [Singapore](/wiki/Singapore), located along [Armenian Street](/wiki/Armenian_Street,_Singapore) in the [Museum Planning Area](/wiki/Museum_Planning_Area), within the [Central Area](/wiki/Central_Area,_Singapore). The building was originally built for the [Tao Nan School](/wiki/Tao_Nan_School) to serve the local [Hokkien](/wiki/Hokkien_people) community, but the school has since been relocated to its current location in [Marine Parade](/wiki/Marine_Parade). The building was then used as a wing of the [Asian Civilisations Museum](/wiki/Asian_Civilisations_Museum), and now houses the [Peranakan Museum](/wiki/Peranakan_Museum). It was gazetted as a [national monument](/wiki/National_Monuments_of_Singapore) on 27 February 1998. ## History [Tao Nan School](/wiki/Tao_Nan_School) was set up by the [Singapore Hokkien Association](/wiki/Singapore_Hokkien_Huay_Kuan) (Singapore Hokkien Huay Kuan) on 18 November 1906 to provide modern education for Hokkien Chinese children. It was the first Chinese school in Singapore to adopt modern subjects in its syllabus such as such as geography, history and physical education, in addition to traditional Chinese subjects such as Confucian classics that would help promote and preserve [Chinese culture](/wiki/Chinese_culture) and values. Although it was originally set up to serve the Hokkien community, it began to accept speakers of other Chinese languages in 1909, the first Chinese school to operate such inclusive policy. Lessons were initially conducted in [Hokkien](/wiki/Hokkien) with some Mandarin classes, but English lessons were also introduced in 1914. In 1916, the school became the first Chinese school in Singapore switched its medium of [education](/wiki/Education) from [Hokkien](/wiki/Min_Nan) to [Mandarin](/wiki/Mandarin_Chinese). The idea for the school was first mooted by [Tan Boo Liat](/wiki/Tan_Boo_Liat), and it gained the support of the Hokkien community. Funds for the school were raised, and the Siam House on [North Bridge Road](/wiki/North_Bridge_Road) was chosen as the premise for the school. The Singapore Hokkien Association also provided an annual subsidy for the school. The school was initially named Tao Nan Study Hall,[b] the name Tao Nan being short for *wu dao qi nan*,[c] meaning 'My code of behaviour is promulgated in Southeast Asia'. It had 90 students in its first year. As the number of pupils grew, [Tan Kah Kee](/wiki/Tan_Kah_Kee) proposed that a new building be constructed, and $40,000 was raised by the Hokkien community for the building fund, to which Tan contributed $2,000. The sugar tycoon [*Majoor* Oei Tiong Ham](/wiki/Oei_Tiong_Ham) also gave $10,000 for the purchase of the land on [Armenian Street](/wiki/Armenian_Street,_Singapore) on which Tao Nan School was built. Construction began 1910, and the school relocated to the new school building when it was completed in 1912. The school was then renamed Tao Nan School (Daonan Xuexiao). Tan Kah Kee served for 12 years as the school's president. When the school switched to Mandarin as the medium of instruction, the Mandarin syllabus was implemented by its first non-Hokkien principal, Xiong Shangfu, a native of Hunan province. The school was closed during the [Japanese Occupation](/wiki/Japanese_Occupation_of_Singapore) from 1942 to 1945 when the Japanese took over the school and said to have used it as a military headquarters. After the war, the student population increased rapidly and classes were held in two separate sessions. In 1958, the school then became a government-aided school and also began to emphasize Malay, Chinese, Tamil and English languages in its syllabus in the 1950s and 60s. However, the school's population had declined by the mid-1970s as families moved out of the [city center](/wiki/Downtown_Core) to the newly established [housing estates](/wiki/New_town) in the suburbs, and in 1976, it was decided that the school should be re-located to [Marine Parade](/wiki/Marine_Parade) to cater for the suburban population there. In 1982, Tao Nan School moved to its new campus in Marine Parade, where it remains today. Also in 1982, English became its main medium of instruction. Throughout its history, the school has produced many prominent Chinese leaders among its alumni, among them [Lee Kong Chian](/wiki/Lee_Kong_Chian). The school was refurbished and became a wing of the [Asian Civilisations Museum](/wiki/Asian_Civilisations_Museum) in 1994, and was officially opened on 21 April 1997. The Old Tao Nan School building was [gazetted](/wiki/Gazette) as a [national monument](/wiki/National_Monuments_of_Singapore) on 27 February 1998. When the Asian Civilisations Museum was established in [Empress Place Building](/wiki/Empress_Place_Building) in 2006 after its renovation, the Old Tao Nan School was repurposed as the Peranakan Museum which opened on 25 April 2008. ## Architecture The Old Tao Nan School building was designed by the Municipal Engineer's Office of Singapore in an [eclectic](/wiki/Eclecticism_in_architecture) [classical style](/wiki/Neo-Classical_architecture) with elements of the [French Renaissance](/wiki/French_Renaissance). The front facade features [Corinthian](/wiki/Corinthian_order) fluted pilasters, with large wide [verandahs](/wiki/Verandah) designed to accommodate the [tropical climate](/wiki/Tropical_climate) of Singapore. It also has large windows and high [ceilings](/wiki/Ceiling) for better [ventilation](/wiki/Ventilation_(architecture)) in a hot climate. A pair of black cast-iron eagles, said to ward off evil, guard the entrance to the school. The building is three-storey high, with a square central [atrium](/wiki/Atrium_(architecture)) topped with a [skylight](/wiki/Skylight_(window)). The classrooms, now converted into galleries, were located on all three floors, and can be accessed via [symmetrical](/wiki/Symmetrical) [staircases](/wiki/Staircase) on either side of the atrium leading up to the corridors on the upper floors. ## Peranakan Museum Today, the Old Tao Nan School building houses the [Peranakan Museum](/wiki/Peranakan_Museum) which was opened in April 2008 by Singapore's Prime Minister [Lee Hsien Loong](/wiki/Lee_Hsien_Loong). The Museum explores the main themes of Peranakan life in ten permanent galleries. Displays include the twelve-day Peranakan wedding and the role of the Nyonyas (female Peranakans). ## Notes - Norman Edwards, Peter Keys (1996), *Singapore – A Guide to Buildings, Streets, Places*, Times Books International, [ISBN](/wiki/ISBN_(identifier)) 9971-65-231-5 - Official website for Peranakan Museum - Singapore Hokkien Huay Kuan\n",
  "language": "en",
  "processed_at": "2026-01-12T11:39:28.339787",
  "title": "Old Tao Nan School",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Old_Tao_Nan_School"
}