{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:39:22.271749"
  },
  "content": "Singaporean food and beverage chain **Old Chang Kee Ltd.** is a [Singaporean](/wiki/Singapore) multinational [snack](/wiki/Snack), food and beverage chain specialising in [curry puffs](/wiki/Curry_puff) and other local snacks. Headquartered in [Woodlands](/wiki/Woodlands,_Singapore), it is listed on the [Singapore Exchange](/wiki/Singapore_Exchange). ## History Old Chang Kee began as a stall outside Rex Cinema at MacKenzie Road. It was acquired by Han Keen Juan in 1986. The company started the process to become [halal](/wiki/Halal) in 2004. Following the completion of their documentation, the Halal certification application was submitted in late October 2004. Old Chang Kee products, outlets, and 2 central kitchens were officially certified *Halal* by [MUIS](/wiki/Majlis_Ugama_Islam_Singapura) on 7 January 2005. The company's main production facility is located at Woodlands Terrace. Old Chang Kee was one of six winners of the SPBA Distinctive Brand Awards 2005 and also a recipient of the Singapore Brand Award Heritage Award in 2005. As of 2017, there are over eighty outlets operating across Singapore, with additional locations in [Australia](/wiki/Australia) (one), [Indonesia](/wiki/Indonesia) (twenty), [Malaysia](/wiki/Malaysia) (two), and the [United Kingdom](/wiki/United_Kingdom) (two). The company was incorporated in Singapore on 16 December 2004 as a private limited company named Old Chang Kee Singapore Pte Ltd. On 22 November 2007, the company changed its name to Old Chang Kee Ltd. upon converting into a public limited company. It was listed on the Catalist-NS board on 16 January 2008. ## Products Old Chang Kee is known for its [curry puffs](/wiki/Curry_puff) and has introduced various other types of curry puffs and snacks. In 2008, the products underwent rebranding, with its curry puffs renamed as Curry'O. In addition to curry and sardine puffs, the company offers a variety of other snacks and finger foods, including [spring rolls](/wiki/Spring_roll), [yam cakes](/wiki/Yam_cake), carrot cakes, fishballs, [gyoza](/wiki/Gyoza), fried [cuttlefish](/wiki/Cuttlefish), breaded [prawns](/wiki/Prawn), [chicken nuggets](/wiki/Chicken_nuggets), and fried [fish fillets](/wiki/Fish_fillet). - Official website Portal: - Singapore This [Singaporean corporation or company](/wiki/List_of_companies_of_Singapore) article is a stub. You can help Wikipedia by expanding it. - v - t - e This food and/or confectionery corporation or company-related article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:39:22.271290",
  "title": "Old Chang Kee",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Old_Chang_Kee"
}