{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:39:26.037968"
  },
  "content": "Former police academy in SingaporeThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Old Police Academy, Singapore\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(January 2021)* *(Learn how and when to remove this message)* The **Old Police Academy** (abbreviation: OPA; formerly known as the **Police Academy** (alternate: **TRACOM**), **Police Training School** and **Police Depot**) is a defunct police training school-facility located at 1, [Mount Pleasant Road](/wiki/Mount_Pleasant_Road,_Singapore), off [Thomson Road](/wiki/Thomson_Road,_Singapore) in [Singapore](/wiki/Singapore). It was the primary training institute for the [Singapore Police Force](/wiki/Singapore_Police_Force)'s [Training Command](/wiki/Training_Command_(Singapore)) until December 2005, when most of the school's functions moved to the new [Home Team Academy](/wiki/Home_Team_Academy) in [Choa Chu Kang](/wiki/Choa_Chu_Kang). Today, it is being gradually demolished to make way for the upcoming [Mount Pleasant MRT station](/wiki/Mount_Pleasant_MRT_station) as well as for future housing redevelopment and land repurposing. ## History The Police Academy at its [Thomson Road](/wiki/Thomson_Road,_Singapore) location first functioned as the permanent home of what was then known as the Police Depot in 1929. It continued to serve as a police training ground when the Police Depot was renamed the Police Training School in 1945, and during the period from 16 September 1963 to 9 August 1965 when Singapore was part of Malaysia and the school was named Sekolah Latihan Polis before reverting to its former name upon Singapore's independence. As part of the streamlining exercise of the SPF in 1969, the Police Training School was elevated to a full academy and took on the name of \"Singapore Police Academy\" (SPA), when then Minister for Interior and Defence [Lim Kim San](/wiki/Lim_Kim_San) officiated the ceremony on 2 August 1969. The Singapore Police Academy functioned as the operation side of police training, while the staff functions came under the Police Training Department, before the two were formally merged as the Training Command (TRACOM) in 1997. The name \"Police Academy\", however, was retained mainly in reference to the training campus. This [Singapore](/wiki/Singapore) location article is a stub. You can help Wikipedia by expanding it. - v - t - e This [law enforcement](/wiki/Outline_of_law_enforcement)–related article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:39:26.037721",
  "title": "Old Police Academy, Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Old_Police_Academy,_Singapore"
}