{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:39:23.994615"
  },
  "content": "Court building in Outram, Singapore The **Old Ministry of Labour Building** ([Chinese](/wiki/Simplified_Chinese): 前劳工部大厦; [Malay](/wiki/Malay_language): *Bangunan Lama Menteri Pekerja*) is a former building of the [Ministry of Labour](/wiki/Ministry_of_Labour_(Singapore)) located at Havelock Square in the [Outram Planning Area](/wiki/Outram,_Singapore), within the [Central Area](/wiki/Central_Area,_Singapore) of Singapore's [central business district](/wiki/Central_business_district). The building once housed the former [Chinese Protectorate](/wiki/Chinese_Protectorate) which was first established in 1877 to protect and control [Chinese](/wiki/China) [immigrants](/wiki/Immigrants) to Singapore. The building had since been restored in 1990 and currently used as the Family and Juvenile Court of Singapore. ## History After [Singapore](/wiki/Singapore) was established as a [Straits Settlement](/wiki/Straits_Settlement) trading port in 1819, the arrival of the Chinese immigrants, whom mostly constituted of the villagers from [southern China](/wiki/Southern_China) increased steadily. Most were men who had come to look for work as [indentured](/wiki/Indenture) labourers or [coolies](/wiki/Coolie). They were often abused by their agents, who held them indebted for their passage here or for fees of one kind or another. Many of the Chinese women who came ended up in [brothels](/wiki/Brothel). [Laws](/wiki/Law) concerning the welfare of Chinese immigrants were drafted in 1867, though they were weakly implemented. In 1877, the [Chinese Protectorate](/wiki/Chinese_Protectorate) was launched as an intermediary between the colonial government and the Chinese community to try to stem the abuse of Chinese immigrants. [William A. Pickering](/wiki/William_A._Pickering), who was familiar with [Chinese culture](/wiki/Chinese_culture) and understood the problems of the Chinese community, was called to be in charge. The role of Chinese Protectorate was to look after the welfare of the Chinese community, its work involved fighting the exploitation of [prostitutes](/wiki/Prostitute) and [coolies](/wiki/Coolie) by their agents, the regulation of Chinese [societies](/wiki/Secret_society), and the control of [triads](/wiki/Triad_society). The first Chinese Protectorate was in a [shophouse](/wiki/Shophouse) on Canal Road. As the protectorate’s responsibilities and staff strength grew, its office was first relocated to the Upper Macao Street (present day Pickering Street), followed by a new shophouse at [Boat Quay](/wiki/Boat_Quay), and finally to a newly constructed two storey building at the corner of New Bridge Road and Havelock Road in 1886. Under Pickering, the Chinese Protectorate did much to improve the welfare of the Chinese community, which made Pickering a popular figure among the Chinese community. However, due to a near-fatal attack by a [secret society](/wiki/Secret_society) member, he retired in 1888. The former Chinese Protectorate Building was later demolished and new [Neo-Classical](/wiki/Neoclassical_architecture) building was built in 1928 on its former site, with the Chinese Protectorate moved in 1930. The Chinese Protectorate functioned at the building until the outbreak of [World War II](/wiki/World_War_II). After the war, its responsibilities were taken over by the Ministry of Labour and Social Welfare from 1956 and later, the [Ministry of Labour](/wiki/Ministry_of_Labour_(Singapore)) and renamed as Ministry of Labour Building. The former Ministry of Labour Building was later taken over by the Singapore [Ministry of Law](/wiki/Ministry_of_Law_(Singapore)) and had been refurbished as the Family and Juvenile Court Building in 1990. ## National Monument The Old Ministry of Labour Building was [gazetted](/wiki/Gazette) as a [national monument](/wiki/National_Monuments_of_Singapore) on 27 February 1998. - National Heritage Board (2002), *Singapore's 100 Historic Places*, Archipelago Press, [ISBN](/wiki/ISBN_(identifier)) 981-4068-23-3 - Preservation of Monuments Board, *Know Our Monuments* - Subordinate Courts of Singapore\n",
  "language": "en",
  "processed_at": "2026-01-12T11:39:23.994234",
  "title": "Old Ministry of Labour Building",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Old_Ministry_of_Labour_Building"
}