{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:39:33.009117"
  },
  "content": "Singapore environmentalist **Olivia Choong Way Sun** (born 13 February 1979) is an [environmental activist](/wiki/Environmentalism) from [Singapore](/wiki/Singapore). She founded [Green Drinks](/wiki/Green_Drinks) Singapore in November 2007, a non-profit movement that actively raises awareness on pertinent environmental issues, and connects businesses, academia, government, media, Non-Governmental Organisations and individuals for knowledge sharing and collaboration opportunities. She also founded a [public relations](/wiki/Public_relations) consultancy Green PR in April 2010, focusing on environmental small and medium enterprises. In 2013, she received the EcoFriend award for her environmental contributions to Singapore. Prior to Green Drinks, Olivia was with then Hill & Knowlton (now [Hill+Knowlton Strategies](/wiki/Hill%2BKnowlton_Strategies) - a global public relations consulting company) office in Singapore. Her portfolio included financial communications, consumer PR and corporate communications. In recent years, Olivia has also taken a keen interest in urban farming and hobby farming, and started The Tender Gardener to document her [sustainable living](/wiki/Sustainable_living) journey, and now teach gardening-related workshops. In addition, Olivia contributes articles to Eco-Business.com, InTheLoop, LOHASIA, Public House and Green Kampong. She also serves on the board of Avelife, a youth environmental Non-Governmental Organisation. This Singaporean biographical article is a stub. You can help Wikipedia by expanding it. - v - t - e This biographical article about an Asian activist is a stub. You can help Wikipedia by expanding it. - v - t - e This article about an environmental activist or conservationist is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:39:33.008825",
  "title": "Olivia Choong",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Olivia_Choong"
}