{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:39:34.445089"
  },
  "content": "* *Olson Building**, also known as **Block 11A** or **29 Mount Sophia**, is a historic building that was on the campus of the [Methodist Girls' School](/wiki/Methodist_Girls%27_School,_Singapore) on Mount Sophia in Singapore. It has since been repurposed as a condominium clubhouse. ## Description The two-storey building features a high-pitched roof. According to the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority), it \"resembles the former ACS Building by Frank Brewer, with its orderly window openings and clay-tiled canopies at the 1st storey that are well-suited to the tropical climate.\" The canopies are supported by masonry corbels, which were \"carved in an elegant geometric design.\" It also features lattices made of moulded concrete and louvred vents made of concrete, thus allowing for cross-ventilation. ## History The building, which was designed by prominent architect Frank Wilmin Brewer to house six classrooms, was completed in 1928. This made it the oldest remaining building on the campus. The building was named after [Mary E. Olson](/wiki/Mary_E._Olson), who twice served as the principal of the Methodist Girls' School. Classes for students in Primary 4 and Primary 5 were held at the building. There was a \"polished smooth\" concrete slope next to the building that students would slide down on. In addition to classrooms, the building also housed a laboratory and an office. The school moved a newer premises on Blackmore Drive in 1992, leaving the campus buildings, including the Olson Building, vacant. In June 2007, the buildings within the Methodist Girls' School campus, including the Olson Building, underwent a $2.5 million renovation, after which the campus was converted into an \"arts enclave\". However, in 2011, the tenants of the enclave were asked to vacate the premises as the old campus was to be demolished to make way for redevelopment, with the Olson Building being the only campus building to have been gazetted for conservation by the Urban Redevelopment Authority. A spokesperson from the authority stated that the building was \"to be retained and integrated with new developments in the future.\" The building was gazetted for conservation by the Urban Redevelopment Authority in 2012. The authority stated that it was the only building to be gazetted as it was architecturally significant, with several \"unique\" features such as its cross-ventilation. Unsuccessful attempts were made by former students to persuade the authority to gazette the other buildings on the campus, which were later demolished. It was then restored, with its paintwork, a later addition, being removed. The restoration of the Olson Building, the [Trinity Theological College Chapel](/wiki/Trinity_Theological_College_Chapel) and the Former Nan Hwa Girls' School Building won a special mention at the 2018 Urban Redevelopment Authority Architectural Heritage Awards. The building was integrated into the Sophia Hills condominium complex as a clubhouse, while the Former Nan Hwa Girls' School Building was converted into a pre-school. 1°18′03″N 103°50′50″E﻿ / ﻿1.30079°N 103.84736°E﻿ / 1.30079; 103.84736\n",
  "language": "en",
  "processed_at": "2026-01-12T11:39:34.444716",
  "title": "Olson Building",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Olson_Building"
}