{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:39:36.636734"
  },
  "content": "Singaporean tyre manufacturer**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)* **A major contributor to this article appears to have a close connection with its subject.** It may require cleanup to comply with Wikipedia's content policies, particularly neutral point of view. Please discuss further on the talk page. *(July 2021)* *(Learn how and when to remove this message)*This article **contains promotional content**. Please help improve it by removing promotional language and inappropriate external links, and by adding encyclopedic text written from a neutral point of view. *(December 2018)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* **Omni United Pte Ltd** is a tyre designer, manufacturer, and distributor headquartered in [Singapore](/wiki/Singapore). The company develops and produces tyres in collaboration with manufacturing partners in [Thailand](/wiki/Thailand), [Serbia](/wiki/Serbia), [China](/wiki/China), and [India](/wiki/India). It owns several brands including Radar, Patriot, American Tourer, and Tecnica, and also develops other licensed and private brands. The company was founded in 2003 by [G.S. Sareen](/wiki/G._S._Sareen), a former entrepreneur in the [e-commerce](/wiki/E-commerce) industry. Omni United offers tyres for [passenger cars](/wiki/Car), [SUVs](/wiki/SUV), [4x4](/wiki/Four-wheel_drive), [light truck](/wiki/Light_truck), van, [trailer](/wiki/Trailer_(vehicle)), [truck](/wiki/Truck), and [bus](/wiki/Bus). It distributes more than five million tyres annually across 80 countries worldwide. Omni United acquired Interstate Tire Distributor, a California-based wholesaler with six locations in four Western states, in October 2015. In June 2016, the company finalised the acquisition of [Texas](/wiki/Texas)-based A to Z Tire & Battery, Inc. That business has since been renamed Omnisource. ## Brands Omni United owns several brand names under which it offers products for passenger cars, SUVs, 4x4s, light trucks, vans, trailers, and commercial vehicles. - Radar Tyres - Patriot Tires - American Tourer - Tecnica - Roadlux - Timberland Tires ### Radar Tyres The Radar Tyres brand is owned by Omni United and was launched in 2006. The brand offers tyres for passenger cars, SUVs, 4x4s, light trucks, vans, trailers, trucks and buses. ### Patriot Tires The Patriot brand is owned by Omni United and was launched in 2016. The brand offers tyres for SUVs and light trucks. ### American Tourer The American Tourer brand is owned by Omni United and was launched in 2017. The brand offers tyres for passenger cars and CUVs. This brand is primarily sold in the United States by American automotive retail chains, [Pep Boys](/wiki/Pep_Boys). ### Tecnica The Tecnica brand is owned by Omni United and was launched in 2019. The brand offers tyres for passenger cars and SUVs. ### Timberland Tires Timberland Tires is a collaboration between [Timberland](/wiki/The_Timberland_Company) and Omni United. The tyres feature a rubber formulation that is appropriate for the recycling of the tyres at the end of their useful life into outsoles for Timberland shoes. This collaboration is currently inactive. ## Omnisource Omnisource, formerly A to Z Tire and Interstate Tire, was founded in 1926 as Amarillo Bus Company. Omnisource has three distribution centres located in Arlington, Texas; Knoxville, Tennessee and New Jersey serving various distributors in the US. ## Support to Breast Cancer Research Foundation (BCRF) In 2011, Omni United through its Radar Tyres brand, partnered with the Breast Cancer Research Foundation (BCRF), to raise awareness about this cause and fund breast cancer research. To date, Omni has donated over **US $1.4 million**, which has funded approximately **28,000 hours** of breast cancer research. ## Omni United collaboration with GFG Style (Giorgetto & Fabrizio Giugiaro) In December 2021, Omni United entered into a collaboration with Italian automotive design house GFG Style, founded by [Giorgetto and Fabrizio Giugiaro](/wiki/Italdesign_Giugiaro), to enhance the brand appeal of the Radar Tyres brand. Under this collaboration a number of passenger car and light truck tyre ranges have been launched. ## Sports Marketing Programs ### LPGA sponsorship - Jodi Ewart Shadoff In 2016, the company announced sponsorship of [LPGA](/wiki/LPGA) player [Jodi Ewart Shadoff](/wiki/Jodi_Ewart_Shadoff). As part of the agreement with Omni United, English-born Jodi Ewart Shadoff will wear the Radar Tyres brand logo on her golf shirt and other apparel at all tournaments. Jodi continues to represent Radar Tires in the 2020 LPGA season. ### Motorsports In 2013, Radar Tyres entered into the [off-road racing](/wiki/Off-road_racing) and [motorsports](/wiki/Motorsports) world in the [Lucas Oil Off Road Racing Series](/wiki/Lucas_Oil_Off_Road_Racing_Series), [SCORE International](/wiki/SCORE_International) Desert Series and TORC: The Off Road Championship. In these series, the company participates in short-course off-road desert racing and long course [desert racing](/wiki/Desert_racing). Radar's inaugural season featured the brand's Renegade R5 M/T tyre. Radar Tyres won the Class 10 at the SCORE International [Baja 500](/wiki/Baja_500).\n",
  "language": "en",
  "processed_at": "2026-01-12T11:39:36.636347",
  "title": "Omni United",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Omni_United"
}