{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:39:38.639792"
  },
  "content": "* *This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **contains promotional content**. Please help improve it by removing promotional language and inappropriate external links, and by adding encyclopedic text written from a neutral point of view. *(December 2017)* *(Learn how and when to remove this message)* **A major contributor to this article appears to have a close connection with its subject.** It may require cleanup to comply with Wikipedia's content policies, particularly neutral point of view. Please discuss further on the talk page. *(December 2017)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* **On Cheong Jewellery** (安昌) is a jewellery manufacturing company based in [Singapore](/wiki/Singapore). On Cheong Jewellery is a member of the Singapore Jewellers Association (SJA), a non-profit representing jewellery operators in Singapore. ## History On Cheong Jewellery was founded in 1936 by Ho Yew Ping, an emigrant of [Guangdong](/wiki/Guangdong) [Shunde](/wiki/Shunde_District) province of [China](/wiki/China). The name of the company is derived from the phrase \"平安昌盛\", meaning peace and prosperity. On Cheong moved to its current location, a shophouse on South Bridge Road, in 1941. In the 1940s On Cheong acquired Kwong Yik and Nan Jing Goldsmiths as part of an expansion and was formally incorporated in 1949. Ho Yew Ping’s wife and the eldest son took over the operations of the business after Ping's death in 1965. Ho Nai Chuen, the youngest of Ho's children, joined the family business in 1985 and is currently the Managing Director of On Cheong. During the [2008 financial crisis](/wiki/2008_financial_crisis), sales of gold jewellery fell. In response On Cheong shifted from [mass-produced](/wiki/Mass_production) jewellery to customized pieces. The firm also placed additional emphasis on jade jewellery. ## Products On Cheong offers a variety of products including [gold](/wiki/Gold), [diamonds](/wiki/Diamond), [jadeite](/wiki/Jadeite) and gem-set jewellery. ## Awards On Cheong has been noted for its practice in retaining older staff. The company was one of the five employers listed by the Tripartite Alliance for Fair Practices in 2012. ## Locations On Cheong’s flagship store is located at South Bridge Road while its branch is located at New Bridge Road. - Official Website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:39:38.639374",
  "title": "On Cheong Jewellery",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/On_Cheong_Jewellery"
}