{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:39:40.135898"
  },
  "content": "Subzone of Queenstown Planning Area in Central Region, Singapore **one-north** is a subzone of [Queenstown](/wiki/Queenstown,_Singapore), [Singapore](/wiki/Singapore), first developed by [JTC Corporation](/wiki/JTC_Corporation) as the country's [research and development](/wiki/Research_and_development) and high technology cluster. It was first conceptualised in 1991 as part of the National Technology Plan and officially launched on 4 December 2001 by then Deputy Prime Minister [Tony Tan Keng Yam](/wiki/Tony_Tan_Keng_Yam). The precinct is split into 9 main developments: [Biopolis](/wiki/Biopolis), [Fusionopolis](/wiki/Fusionopolis), Mediapolis, Vista, LaunchPad @ one-north, Nepal Hill, Rochester Park, Wessex, and Pixel. Many parts of one-north was designed and master planned by [Zaha Hadid](/wiki/Zaha_Hadid) Architects. It's located near educational and research institutes such as [National University of Singapore](/wiki/National_University_of_Singapore) (NUS), [INSEAD](/wiki/INSEAD), [Singapore Polytechnic](/wiki/Singapore_Polytechnic) and the [Singapore Science Parks](/wiki/Singapore_Science_Park). In 2012, [ESSEC Business School](/wiki/ESSEC_Business_School) set up its Asian campus in one-north, for a total investment of [S$](/wiki/Singapore_dollar)40 million. The district also has easy accessibility to various social and recreational facilities due to its close proximity to the city-centre. Besides being a \"science hub\" as it was first described, the government's aim for one-north is to create a community whereby Singaporeans can gather to live, work and relax together. As such, one-north was not envisioned as being strictly a public sector project, but also one whereby private sectors may also contribute to provide the social and recreational amenities for the people working and living there. Today, one-north serves as a local, regional and global centre for [high technology](/wiki/High_technology) and high-tech [innovation](/wiki/Innovation). Many high-tech companies and [multinational companies](/wiki/Multinational_companies) were established across the subzone, such as [Google](/wiki/Google), where it serves as its [Asia-Pacific](/wiki/Asia-Pacific) headquarters. The headquarters of the [Asia-Pacific Economic Cooperation](/wiki/Asia-Pacific_Economic_Cooperation) (APEC), [Grab](/wiki/Grab_(company)), [Razer](/wiki/Razer_Inc.), [Shopee](/wiki/Shopee) and [Ubisoft Singapore](/wiki/Ubisoft_Singapore) are also located at one-north. ## Etymology The significance of the name one-north is from the fact that Singapore is located one-degree to the north of the [equator](/wiki/Equator). As part of the survey, the [one-north MRT station](/wiki/One-north_MRT_station) was initially named 'Portsdown'. The options had involved 'one-north', 'Portsdown' and 'Ayer Rajah'. In the end, one-north was selected in January 2006. Construction began on 12 March that year. The station was opened on 8 October 2011, along with Stages 4 and 5 of the [Circle Line](/wiki/Circle_Line_(Singapore)). ## Biopolis Biopolis is a biomedical R&D hub at one-north. It houses public research institutes and private research organisations. This campus is dedicated to providing space for biomedical research and development activities and promoting [peer review](/wiki/Peer_review) and [collaboration](/wiki/Collaboration) among the private and public [scientific community](/wiki/Scientific_community). In May 2021, [Wilmar International](/wiki/Wilmar_International) relocated its global headquarters to the Biopolis precinct. ## Fusionopolis Occupying 30 hectares of land within one-north, Fusionopolis is envisioned to be an R&D hub for infocomm technology, media, physical sciences and engineering industries. It houses various research organizations, high-tech companies, government agencies, retail outlets, and serviced apartments in one location. It is served by the [one-north MRT station](/wiki/One-north_MRT_station) connected to the basement of the building. On 26 October 2021, [Razer](/wiki/Razer_Inc.) officially opened its Southeast Asia headquarters in one-north. Aside from its offices, the seven-storey headquarters also houses the first RazerStore and RazerCafe in Singapore where visitors are able to view the company's latest products and order a drink prepared by a robotic barista arm. ## Mediapolis A 19-hectare hub created for the infocomm, media, physical sciences and engineering sectors, Mediapolis plays a vital role in Singapore's infocomm and media ecosystem. When fully completed, the hub will house a media ecosystem housing soundstages with green screen capabilities, digital production and broadcasting facilities, facilities for interactive digital media and R&D activities, facilities for computer-generated imagery and visual effects, post-production facilities, games and animation facilities, digital media schools, business parks, work lofts and incubators, and intellectual property creation and digital rights management. Opened on 15 January 2014, Infinite Studios is a 1.2-hectare soundstage facility and is Singapore's first such facility. On 8 December 2015, [Mediacorp](/wiki/Mediacorp) moved from the old Mediacorp Caldecott Broadcasting Centre to the new 800,000 square feet (74,000 m2) 12-storey Mediacorp Campus, which is branded as an architectural landmark in Mediapolis. In the heart of Mediapolis, ALICE@MEDIAPOLIS is a business park created for startups and as a base for established organisations. It offers startup spaces, shared media facilities, flexible work-live-play-learn spaces, a childcare centre, and retail outlets. The [Deliveroo](/wiki/Deliveroo) Food Market is also housed in the building, featuring 10 kitchens and a 40-seat dining space, all based on a fully automated ordering system. On 11 August 2022, [Grab](/wiki/Grab_(company)) officially opened its 9-storey headquarters located across Mediapolis. With an area of more than 42,000 square metres (450,000 sq ft), the new Grab HQ houses approximately 3,000 employees, an R&D centre, and the first GrabMerchant centre. In 2024, the government released 2 plots of land for tender in Media Circle Road for residential development to bring in people to live in the Mediapolis region. One of the condominium is Bloomsbury Residences by Qingjian Realty that will see 358 condominium units. ## Vista As the corporate and business support cluster of the one-north precinct, Vista houses high-rise offices, business hotels, retail-cum-entertainment centres, and residential developments. It is close to the [Buona Vista MRT station](/wiki/Buona_Vista_MRT_station). ### Metropolis Completed in the third quarter of 2013, Metropolis is a pair of Grade A office towers (23 storeys and 21 storeys), offering a total of 110,000 square metres of office space. It currently houses multinational corporations such as [Shell](/wiki/Royal_Dutch_Shell) and [P&G](/wiki/Procter_%26_Gamble). ### The Star The Star is a 15-storey [mixed use](/wiki/Mixed-use_development) complex integrating a [shopping mall](/wiki/Shopping_mall), The Star Vista, and a [performing arts centre](/wiki/Performing_arts_centre) known as The Star Performing Arts Centre. It is located near [Buona Vista MRT station](/wiki/Buona_Vista_MRT_station) on the [East West line](/wiki/East_West_MRT_line). ### GSK Asia House Housing the regional headquarters for [GlaxoSmithKline's](/wiki/GlaxoSmithKline) Pharmaceutical, Vaccines and Consumer Healthcare businesses in the Asia region, GSK Asia House is a 14,000 square metre, 8-storey building, that has a capacity of up to 1,000 employees. ### Ministry of Education (MOE) Headquarters The headquarters of the [Ministry of Education (MOE)](/wiki/Ministry_of_Education_(Singapore)) is located in this area, adjacent to the Metropolis. ## JTC LaunchPad @ one-north BLOCK71 Singapore, a decades-old flatted factory within Ayer Rajah Industrial Estate, was repurposed in 2010 by the [Media Development Authority](/wiki/Media_Development_Authority) to be part of one-north. Externally, as the oldest building in one-north, it lacks architectural consistency with the rest of the development. Internally, however, it is one of Singapore's high-tech hubs, with dozens of digital startups and VC funds sited directly across the street from [Fusionopolis](/wiki/Fusionopolis) and the [one-north MRT Station](/wiki/One-north_MRT_station). In March 2014, its landlord that the cluster of flatted factories would be expanded to JTC LaunchPad @ one-north, a start-up cluster also comprising Block 79 (previously the JVC building) and Block 73 (new modular temporary construction). The start-up cluster hosts the Action Community for Entrepreneurship's International Centre (ACEIC) which helps Singapore start-ups expand overseas by providing resources, advice and access to new networks and markets. ## Nepal Hill Envisioned as a global centre for leadership training and talent development, Nepal Hill will house business schools, corporate universities, and professional service companies. Other than colonial bungalows, the area currently comprises [ESSEC Business School](/wiki/ESSEC_Business_School) and [Unilever](/wiki/Unilever) Four Acres Campus. On 11 April 2022, [The Ascott Limited](/wiki/The_Ascott_Limited) officially opened the 324-unit lyf one-north Singapore. Split across two buildings, the property comprises a hotel, serviced residences, and co-living services. Featuring a seven-storey mural art on one of its external walls, lyf one-north Singapore houses the tallest art wall in Singapore. ## Rochester Park Launched in early 2006, Rochester Park, a part of one-north, is a heritage site located off North Buona Vista Road, featuring several double-storey black-and-white colonial bungalows, a symbol of Singapore's colonial past. The estate has a long history with the 40 black-and-white bungalows built in the 1940s to accommodate [British military](/wiki/Military_of_the_United_Kingdom) soldiers stationed at Pasir Panjang Military Complex and their families. After the British military pulled out of Singapore in late 1971, the bungalows were handed over to the Singapore government who rented them out mainly to non-Singaporeans. ### Rochester Mall To provide cultural and recreational facilities for the people in one-north in the present day, Rochester Park has been revitalised into a dining and lifestyle retail hub known as the **Rochester Mall**. The old black-and-white colonial bungalows in Rochester Park have been preserved under the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority)'s conservation guidelines and are now leased to over 30 food and beverage and lifestyle retail tenants. ### Rochester Commons Rochester Commons is a 17-storey mixed-use tower housing a 5,000 square metre shared executive learning centre, a 135-room business hotel named [Citadines](/wiki/Citadines), offices, a sky garden, and an amenities deck. The development is connected with the surrounding greenery and 12 heritage bungalows, with 5 bungalows having been restored and repurposed as F&B and retail establishments, by a 'Knowledge Trail' on an elevated pedestrian deck. ### Rochester Park 11 Rochester Park 11 has 11 colonial bungalows turned into a dining and lifestyle retail hub consisting of restaurants, galleries, and spas. Nine units are taken up by restaurants and bars and a holistic healthcare centre. ### Rochester Park 20 Rochester Park 20 is still in the midst of development but has set aside 20 of the colonial bungalows to become a serviced villa resort with retail facilities. ## Wessex A large area off Portsdown Road, Wessex is a dominantly residential area within one-north. Built in the 1940s, the colonial style residential estate comprises 26 blocks of walk-up apartments and 58 semi-detached houses. People working in the one-north region are given priority for residences in the estate. An international school known as [Tanglin Trust School](/wiki/Tanglin_Trust_School) is located in the area. ## Pixel A 5,000 square metre facility, Pixel primarily caters to the digital media sector, serving as a resource centre and focal point for content creators, owners, and game developers, to foster cross-sector collaborations in content creation, delivery, and communication. ## Parks ### one-north Park one-north Park is a [community park](/wiki/Community_park) that is situated in the northern zone of one-north, near the [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)) (MOE) at [Buona Vista](/wiki/Buona_Vista). The last phase of development was completed in 2017. In the vicinity of one-north Park is Portsdown Swamp, which is a freshwater swamp where [white-throated kingfishers](/wiki/White-throated_kingfisher), [yellow bitterns](/wiki/Yellow_bittern), [ducks](/wiki/Duck), and other wildlife have been spotted. - One-north on the JTC Corporation website Portal: - Singapore\n",
  "language": "en",
  "processed_at": "2026-01-12T11:39:40.135479",
  "title": "one-north",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/One-north"
}