{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:39:44.400518"
  },
  "content": "Singaporean fashion label **Ong Shunmugam** is a [Singapore](/wiki/Singapore)-based contemporary [womenswear](/wiki/Womenswear) label founded by designer [Priscilla Shunmugam](/wiki/Priscilla_Shunmugam). It is designed and made across [Asia](/wiki/Asia) and offers [ready-to-wear](/wiki/Ready-to-wear) ranges and [bespoke](/wiki/Bespoke) designs. Known for its innovative take on the [cheongsam](/wiki/Cheongsam) and integrating traditional textiles and Asian-inspired designs in its collections, Ong Shunmugam has been described as being \"a thoughtful reinterpretation of traditional [Asian](/wiki/Asia) ethnic wear... designed for an intelligent woman\". ## History In December 2010, **Ong Shunmugam** launched with its first [ready-to-wear](/wiki/Ready-to-wear) collection *Orientalism*, and in September 2011, debuted its first [cheongsam](/wiki/Cheongsam) collection *Guardianship*. The label's first permanent shop space, Atelier Ong Shunmugam, officially opened its doors in November 2011 in [Raffles Place](/wiki/Raffles_Place), [Singapore](/wiki/Singapore). Prior to this, Ong Shunmugam retailed exclusively through its online store or by appointment only. In March 2012, the label collaborated with the [National Museum of Singapore](/wiki/Business_Times_(Singapore)) for the *In the Mood for Cheongsam* exhibition, where Ong Shunmugam became the first womenswear label to retail at the museum. In addition to a showcase of the *Guardianship* collection at the exhibition's opening night fundraiser, designer [Priscilla Shunmugam](/wiki/Priscilla_Shunmugam) and *Guardianship* [cheongsams](/wiki/Cheongsam) were also featured in the museum-produced book of the same name. In August 2012, the label launched its third collection *Prints Charming*, which received numerous positive press reviews and extensive media coverage in [The Business Times Singapore](/wiki/Business_Times_(Singapore)), Elle Magazine Singapore, [The Straits Times](/wiki/The_Straits_Times) Urban, [Her World Plus](/wiki/Her_World_Plus) and Juice Magazine Singapore. Ong Shunmugam was one of only two [Singapore](/wiki/Singapore) labels selected by the platform Future Fashion Now to show its Spring/Summer’13 collection at [Paris Fashion Week](/wiki/Paris_Fashion_Week) in October 2012. It was also awarded *Breakthrough Local Label* by [Cleo Magazine Singapore](/wiki/Cleo_(magazine)) at its 2012 Cleo Fashion Awards and designer [Priscilla Shunmugam](/wiki/Priscilla_Shunmugam) was named Designer of the Year at the 2012 Elle Awards in Singapore. In December 2013, Ong Shunmugam won the Grand Award at the Design for Asia Awards 2013. It was one of five Singaporean labels selected to have solo shows at the Audi Fashion Festival 2014. In 2017, the designer dedicated her ninth ready-to-wear collection to Malay women’s clothing, bringing her contemporary twist to traditional outfits like the Baju Kurung and the Kebaya. “This is our way of continuing to take the stand that we have intuitively held: that fashion design should be inclusive, that it can and should be thinking of all women, all skin tones, all faiths,” she said. In 2019, Ong Shunmugam introduced its homeware line, Suvarnabumi, which includes porcelain tableware. ## Collections - *Orientalism*, Dec 2010 - *Guardianship*, Sep 2011 - *Prints Charming*, Aug 2012 - *Spring/Summer 2013*, January 2013 - Ong Shunmugam website - Future Fashion Now website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:39:44.400067",
  "title": "Ong Shunmugam",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Ong_Shunmugam"
}