{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:40:02.704612"
  },
  "content": "* *Operation Thunderstorm** was the codename for the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces)'s operation to contain refugees fleeing [South Vietnam](/wiki/South_Vietnam) following the [fall of Saigon](/wiki/Fall_of_Saigon) in 1975. The operation was oversaw by [Wong Kan Seng](/wiki/Wong_Kan_Seng). ## Background Following the fall of Saigon on 30 April 1975, large numbers of South Vietnamese begun to flee Vietnam for fear of persecution, heralding the arrival of the [Vietnamese boat people](/wiki/Vietnamese_boat_people). On 2 May 1975, the first wave of 300 refugees arrived in Singapore waters on board the vessel *Truong Hai*. A total of up to 8,355 refugees was believed to have entered Singapore waters during this period until 14 May 1975. During this period, Operation Thunderstorm was activated by [MINDEF](/wiki/Ministry_of_Defence_(Singapore)), making Singapore one of the first countries to stop refugees from entering its coastlines. The operation involved the [Republic of Singapore Air Force](/wiki/Republic_of_Singapore_Air_Force), [Republic of Singapore Navy](/wiki/Republic_of_Singapore_Navy), [Singapore Army](/wiki/Singapore_Army) and the then-[Marine Police](/wiki/Police_Coast_Guard) (now the Police Coast Guard) as well as various government authorities and agencies. ## Objectives The primary objective of the operation was to contain, quarantine and prevent refugees from entering and staying in Singapore. ## Execution The Republic of Singapore Navy and the [Police Coast Guard](/wiki/Police_Coast_Guard) was tasked to intercept and detain all Singapore bound refugee boats. Quarantine areas were set up along the beaches of [Marine Parade](/wiki/Marine_Parade) and a SAF Field Hospital was deployed to [Bedok Jetty](/wiki/Bedok_Jetty) to provide first aid and other essential medical services. The Navy sent its technicians and engineers to inspect and repair the refugee boats. Food, water, fuel oil and other provisions were given in order to ensure the departure of the vessels. A number of weapons were also confiscated from the refugee boats. - [Pushback (migration)](/wiki/Pushback_(migration))\n",
  "language": "en",
  "processed_at": "2026-01-12T11:40:02.704288",
  "title": "Operation Thunderstorm",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Operation_Thunderstorm"
}