{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:39:56.625373"
  },
  "content": "1943 Allied commando raid in SingaporeThis article includes a list of general references, but **it lacks sufficient corresponding inline citations**. Please help to improve this article by introducing more precise citations. *(August 2011)* *(Learn how and when to remove this message)* **Operation Jaywick** was a special operation undertaken in the [Second World War](/wiki/Second_World_War). In September 1943, 14 [commandos](/wiki/Commando) and [sailors](/wiki/Sailor) from the [Allied](/wiki/Allies_of_World_War_II) [Z Special Unit](/wiki/Z_Special_Unit) raided [Japanese](/wiki/Empire_of_Japan) shipping in [Singapore](/wiki/Singapore) Harbour, sinking three ships and damaging three more using [limpet mines](/wiki/Limpet_mine). ## Background [Special Operations Australia](/wiki/Special_Operations_Australia) (SOA), a combined Allied [military intelligence](/wiki/Military_intelligence) organisation, was established in March 1942. SOA operated under the cover name Inter-Allied Services Department (IASD). It contained several British [SOE](/wiki/Special_Operations_Executive) officers who had escaped from [Japanese occupied Singapore](/wiki/Japanese_Occupation_of_Singapore), and they formed the nucleus of the IASD, which was based in [Melbourne](/wiki/Melbourne). In June 1942, a commando arm was organised as [Z Special Unit](/wiki/Z_Special_Unit) (which was later commonly known as Z Force). It drew its personnel primarily from the [Australian Army](/wiki/Australian_Army) and [Royal Australian Navy](/wiki/Royal_Australian_Navy). In 1943, a 28-year-old British officer, Captain (later Major) [Ivan Lyon](/wiki/Ivan_Lyon) (of the [Allied Intelligence Bureau](/wiki/Allied_Intelligence_Bureau) and [Gordon Highlanders](/wiki/Gordon_Highlanders)), and a 61-year-old Australian civilian, Bill Reynolds, devised a plan to attack Japanese shipping in [Singapore](/wiki/Singapore) Harbour. Commandos would travel to the harbour in a vessel disguised as an Asian fishing boat. They would then use [folboats](/wiki/Folding_kayak) (collapsible canoes) to attach [limpet mines](/wiki/Limpet_mine) to Japanese ships. Initial training for the raid was organised and carried out by Major Lyon and Captain Davidson at Refuge Bay. The site selected was a remote, inaccessible area along the Hawkesbury River, New South Wales and named Camp X. Folboats were essential for training the prospective operatives but only two, a one-man and a two-man were found to be suitable after a thorough search in Australia by military personnel. These were bought on the spot from the folboat builder Walter Hoehn after a test run on the Yarra River, Alphington by the head of the Inter Allied Services Department, Colonel Mott and Major Moneypenny. A wooden rigid canoe was also built for Camp X by trainees under the supervision of Davidson. Reynolds was in possession of a 21.3-metre (70 ft) Japanese coastal fish carrier, [*Kofuku Maru* 幸福丸](/wiki/MV_Krait), which he had used to [evacuate](/wiki/Fall_of_the_Riau_Islands#From_Syonanto_to_Batam) refugees from Singapore and its neighboring islands. Lyon ordered that the boat be shipped from [India](/wiki/India) to Australia. Upon its arrival, he renamed the vessel [*Krait*](/wiki/MV_Krait), after the [krait](/wiki/Krait) a small but deadly Asian snake. ## The attack In mid-1943, *Krait* travelled from a training camp at [Broken Bay](/wiki/Broken_Bay), [New South Wales](/wiki/New_South_Wales) to [Thursday Island](/wiki/Thursday_Island). Aboard was a complement from Z Special Unit of three British and eleven Australian personnel, comprising: - Major [Ivan Lyon](/wiki/Ivan_Lyon) (Mission Commander) - Lieutenant Hubert Edward Carse (*Krait*'s captain) - Lieutenant Donald Montague Noel Davidson - Lieutenant [Robert Charles Page](/wiki/Robert_Page_(soldier)) - Corporal Andrew Anthony Crilly - Corporal Ronald George \"Taffy\" Morris - Leading Seaman Kevin Patrick Cain - Leading Stoker James Patrick McDowell - Leading Telegraphist Horace Stewart Young - Able Seaman Walter Gordon Falls - Able Seaman Mostyn Berryman - Able Seaman Frederick Walter Lota Marsh - Able Seaman Arthur Walter Jones - Able Seaman Andrew William George Huston On 13 August 1943, *Krait* left Thursday Island for [Exmouth Gulf](/wiki/Exmouth_Gulf), [Western Australia](/wiki/Western_Australia), where it was refuelled and repairs were undertaken. The repairs caused delays in departure and the folboats, manufactured by Harris Lebus, called model MKI**, which had been specially ordered for the attack by Lyon from England only arrived at the last minute. They were found to be faulty, lacked some important parts and were not according to the design that Davidson had specified. They had to undergo many changes to make each framework fit together and then fit correctly into the outer skins. This left the crew little time to get accustomed to them before being loaded on to *Krait*. On 1 September 1943, *Krait* left Exmouth Gulf and departed for Singapore. The team's safety depended on maintaining the disguise of a local fishing boat. The men stained their skin brown with dye to appear more Asiatic and were meticulous in what sort of rubbish they threw overboard, lest a trail of European garbage arouse suspicion. During the journey, they suffered a snapped propeller shaft, which had to be repaired by a passing US submarine, while the heavily laden craft was later almost sunk by a force nine gale. *Krait* arrived off Singapore on 24 September. That night, six men left the boat and paddled 50 km (31 mi) with folboats, to establish a forward base in a cave on a small island near the harbour. On the night of 25/26 September 1943, they paddled into the harbour and placed limpet mines on several Japanese ships before returning to their hiding spot. The mines exploded early on 26 September, and were reported to have sunk seven Japanese transport ships, comprising over 39,000 [GRT](/wiki/Gross_register_tonnage) between them. The commandos waited until the commotion over the attack had subsided and then returned to *Krait*, which they reached on 2 October. Their return to Australia was mostly uneventful, except for a tense incident in the [Lombok Strait](/wiki/Lombok_Strait) when the ship was closely approached by Japanese auxiliary minesweeper *Wa-102* on patrol but *Krait* was not challenged. On 19 October, the ship and crew arrived safely back at Exmouth Gulf. ## Aftermath ### Casualties The raid took the Japanese authorities in Singapore by surprise. Not suspecting such an attack could be mounted from Australia, they assumed it had been carried out by local saboteurs, most likely pro-[Communist Chinese](/wiki/Communist_Party_of_China) guerillas. In their efforts to uncover the perpetrators, a wave of arrests, torture and executions began. Local Chinese and Malays, interned POWs and European civilians were attacked. The incident became known as the [Double Tenth](/wiki/Double_Tenth_incident), for 10 October, the day that Japanese secret police began the mass arrests. Given the effects inflicted upon the local population by the Japanese, criticism has arisen as to whether Operation Jaywick was justified, especially with its relatively limited strategic results. After the raid the Allies never claimed responsibility for the attack on shipping, most likely because they wanted to preserve the secret of *Krait* for similar missions. The Japanese did not divert significant military resources to defending against such attacks, instead used the secret police to inflict reprisals on civilians. Recent analysis of Japanese records and radio decrypts have identified only six ships sunk or damaged. Japanese radio messages reference only six ships attacked and it is highly probable the attack on the seventh failed. ShipAttackerTarget[GRT](/wiki/Gross_register_ton)ConfigurationNotes1Lyon, Huston*Shosei Maru*5,698Engines aft tankerDamaged2Davidson, Falls*Nichiren Maru*5,4603 island cargoDamaged3Davidson, FallsUnknownNAEngines aft cargoNA4Davidson, Falls*Arare Maru*2,770Engines aft tankerSunk, salvaged5Page, Jones*Hakusan Maru*2,1973 island cargoSunk6Page, Jones*Nasusan Maru*4,399Engines aft tankerDamaged7Page, Jones*Kizan Maru*5,0713 island cargoSunk The oft-repeated claim that the saboteurs sank the large high speed tanker *Shinkoku Maru* (Sinkoku Maru in kokutai spelling) is not supported by Japanese records that clearly show the ship leaving [Truk (Chuuk)](/wiki/Chuuk_Lagoon), Carolines Islands on the day of the attack. ### Subsequent operations Operation Jaywick was followed by [Operation Rimau](/wiki/Operation_Rimau). Although three ships are sometimes claimed as sunk in this raid, no corroboration of this has been found and in all likelihood no vessels were sunk; the participants, including Lyon, were either killed in action or captured and executed. - [Operation Frankton](/wiki/Operation_Frankton) ### Cited works - Cundall, Peter (2018) \"Operation Jaywick: A Reassessment of Results\", *The Log: Quarterly Journal of Nautical Association of Australia*, Vol 51, No.2, Issue 212, p.68. Also published as \"Operation Jaywick: A Reassessment of Results\" on Combined Fleet website - Hoehn, John. (2011). *Commando Kayak: The Role of Australian Folboats in the Pacific Campaign*. Hirsch Publishing. [ISBN](/wiki/ISBN_(identifier)) 978-3-033-01717-7 - National Archives of Australia, *A3269, E2A*, 1944, p. 34. - Silver, Lynette Ramsay. (2001). *Krait: The Fishing Boat that Went to War*. Cultured Lotus. [ISBN](/wiki/ISBN_(identifier)) 981-04-3675-0. - Wynyard, Noel. (1947). \"Winning Hazard\". Sampson Low, Marston & Co. [OCLC](/wiki/OCLC_(identifier)) 265940745 - \"The Official History of the Operations and Administration of] Special Operations - Australia [(SOA), also known as the Inter-Allied Services Department (ISD) and Services Reconnaissance Department (SRD)] Volume 2 - Operations Part 5 page 2-10\". *National Archives of Australia*. p. 534-550. - Peter Dunn, 2005, \"'Z' Special Unit in Australia During WW2\" (ozatwar.com) - Interview with Horrie Young in the Australians At War Film Archive - HNSA Ship Page: Krait - Operation Jaywick, Australian War Memorial 1°17′14″N 103°51′55″E﻿ / ﻿1.28722°N 103.86528°E﻿ / 1.28722; 103.86528\n",
  "language": "en",
  "processed_at": "2026-01-12T11:39:56.625013",
  "title": "Operation Jaywick",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Operation_Jaywick"
}