{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:40:00.364866"
  },
  "content": "Covert security operation in SingaporeThis article includes a list of general references, but **it lacks sufficient corresponding inline citations**. Please help to improve this article by introducing more precise citations. *(June 2025)* *(Learn how and when to remove this message)*Part of a series on the[History of Singapore](/wiki/History_of_Singapore)[Early history](/wiki/Early_history_of_Singapore) (pre-1819)[Srivijaya](/wiki/Srivijaya)650–1377[Temasek](/wiki/Temasek), [Long Ya Men](/wiki/Long_Ya_Men), [Ban Zu](/wiki/Ban_Zu)c.14th century[Kingdom of Singapura](/wiki/Kingdom_of_Singapura)1299–1398[Majapahit](/wiki/Majapahit)1398–1400[Malacca Sultanate](/wiki/Malacca_Sultanate)1400–1528[Johor Sultanate](/wiki/Johor_Sultanate)1528–1819British colonial era (1819–1942)[Founding](/wiki/Founding_years_of_modern_Singapore)1819–1826[Straits Settlements](/wiki/Singapore_in_the_Straits_Settlements)1826–1867[Crown colony](/wiki/Singapore_in_the_Straits_Settlements#Crown_colony_(1867–1942))1867–1942[Japanese Occupation](/wiki/Japanese_occupation_of_Singapore) (1942–1945)[Fall of Singapore](/wiki/Fall_of_Singapore)1942[Sook Ching](/wiki/Sook_Ching)1942[Double Tenth incident](/wiki/Double_Tenth_incident)1943[Post-war period](/wiki/Colony_of_Singapore) (1945–1962)[First Legislative Council](/wiki/History_of_Singapore#First_Legislative_Council_(1948–1951))1948–1951[Maria Hertogh riots](/wiki/Maria_Hertogh_riots)1950[Second Legislative Council](/wiki/History_of_Singapore#Second_Legislative_Council_(1951–1955))1951–1955[Anti-National Service Riots](/wiki/1954_National_Service_riots)1954[Internal self-government](/wiki/Self-governance_of_Singapore) (1955–1963)[Hock Lee bus riots](/wiki/Hock_Lee_bus_riots)1955[Singapore Glass Factory strikes](/wiki/Singapore_Glass_Factory_strikes)1960[Pulau Senang prison riots](/wiki/Pulau_Senang_prison_riots)1963[Merger with Malaysia](/wiki/History_of_the_State_of_Singapore_(Malaysia)) (1963–1965)[Singaporean referendum](/wiki/1962_Singaporean_integration_referendum)1962[Operation Coldstore](/wiki/Operation_Coldstore)1963[Race riots in Singapore](/wiki/1964_race_riots_in_Singapore)1964[MacDonald House bombing](/wiki/MacDonald_House_bombing)1965[Republic of Singapore](/wiki/History_of_the_Republic_of_Singapore) (1965–present)[ASEAN Declaration](/wiki/ASEAN_Declaration) ([ASEAN](/wiki/Association_of_Southeast_Asian_Nations))1967[1969 race riots of Singapore](/wiki/1969_race_riots_of_Singapore)1969[Laju incident](/wiki/Laju_incident)1974Operation Spectrum1987[Asian financial crisis](/wiki/1997_Asian_financial_crisis#Singapore)1997[Embassies attack plot](/wiki/Singapore_embassies_attack_plot)2001[H1N1 pandemic](/wiki/2009_swine_flu_pandemic_in_Asia#Singapore)2009–2010[Bus drivers' strike](/wiki/2012_Singapore_bus_drivers%27_strike)2012[Little India riot](/wiki/2013_Little_India_riot)2013[2018 North Korea–United States Singapore Summit](/wiki/2018_North_Korea%E2%80%93United_States_Singapore_Summit)2018[COVID-19 pandemic](/wiki/COVID-19_pandemic_in_Singapore)2020–2022By topic - [Timeline](/wiki/Timeline_of_Singaporean_history) - [Riots](/wiki/List_of_riots_in_Singapore) - [Military](/wiki/Military_history_of_Singapore) Singapore portal - v - t - e **Operation Spectrum**, also known as the **1987 \"Marxist Conspiracy\"**, was the code name for a covert [anti-communist](/wiki/Anti-communist) security operation that took place in [Singapore](/wiki/Singapore) on 21 May 1987. Sixteen people were arrested and detained without trial under Singapore's [Internal Security Act](/wiki/Internal_Security_Act_(Singapore)) (ISA) for their alleged involvement in \"a Marxist conspiracy to subvert the existing social and political system in Singapore, using [communist](/wiki/Communist) united front tactics, with a view to establishing a [Marxist state](/wiki/Marxism).\" On 20 June 1987, six more people were arrested, bringing the total number of detainees to 22. The mostly English-educated group was a mix of Catholic lay workers, social workers, overseas-educated graduates, theatre practitioners and professionals. According to the Singapore government allegations, Operation Spectrum was conducted to \"nip communist problem(s) in the bud\". The mastermind behind the alleged Marxist plot was [Tan Wah Piow](/wiki/Tan_Wah_Piow), a former [University of Singapore](/wiki/National_University_of_Singapore) Students' Union president who had been in *de facto* exile in London since 1976. His \"key man\" in Singapore was [Vincent Cheng Kim Chuan](/wiki/Vincent_Cheng_Kim_Chuan), a full-time Catholic Church worker in the [Justice and Peace Commission](/wiki/Pontifical_Council_for_Justice_and_Peace). Cheng was alleged to have used the [Archdiocese of Singapore](/wiki/Archdiocese_of_Singapore) as a \"ready cover\", organising the infiltration of disparate groups of influence that included the [Law Society](/wiki/Law_Society_of_Singapore), the opposition [Workers' Party](/wiki/Workers%27_Party_(Singapore)) and various student bodies. These would allegedly become pressure groups on course to openly confront the government. By December 1987, all the detainees had been released except for Cheng. However, in April 1988, nine of the released detainees issued a joint statement accusing the government of ill treatment and torture while under detention. They also denied involvement in any conspiracy and alleged that they were pressured into making confessions. Eight of the nine were re-arrested and detained for a second time. They were eventually released after they signed statutory declarations denying everything they had said in their press statement. The truth of the allegations is contentious and undetermined. Historians [Mary Turnbull](/wiki/Mary_Turnbull) and Michael D. Barr have described the conspiracy as possibly \"myths\" and a \"fanciful narrative\", arguing that the arrests were likely politically motivated. In an interview with *[The Straits Times](/wiki/The_Straits_Times)* on 14 December 2001, then-Senior Minister of State [Tharman Shanmugaratnam](/wiki/Tharman_Shanmugaratnam) said that \"although I had no access to state intelligence, from what I knew of them, most were social activists but were not out to subvert the system.\" Nevertheless, the [People's Action Party](/wiki/People%27s_Action_Party) (PAP) government maintained its stand that the ex-detainees \"were not detained for their political beliefs, but because they had involved themselves in subversive activities which posed a threat to national security.\" ## Alleged Marxist conspiracy On 21 May 1987, 16 people were arrested in a pre-dawn raid carried out by the [Internal Security Department](/wiki/Internal_Security_Department_(Singapore)). They were [Vincent Cheng Kim Chuan](/wiki/Vincent_Cheng_Kim_Chuan), Teo Soh Lung, Kevin Desmond de Souza, Wong Souk Yee, Tang Lay Lee, Ng Bee Leng, Jenny Chin Lai Ching, Kenneth Tsang Chi Seng, Chung Lai Mei, Mah Lee Lin, Low Yit Leng, Tan Tee Seng, Teresa Lim Li Kok, [Tang Fong Har](/wiki/Tang_Fong_Har), Chia Boon Tai, Tay Hong Seng and William Yap Hon Ngian. Over the next two months, Singapore's national broadsheet *[The Straits Times](/wiki/The_Straits_Times)* published numerous articles about the unravelling of what the [Ministry of Home Affairs](/wiki/Ministry_of_Home_Affairs_(Singapore)) described as a \"Marxist conspiracy\" to \"subvert the existing system of government and to seize power in Singapore.\" According to the paper, the conspirators were \"hybrid pro-communist types who...augment traditional CPM (Communist Party of Malaya) tactics with new techniques and methods, using the Catholic church and religious organisations.\" ## Catholic Church and the state The Catholic organisations that were named by the government as having been used by Cheng to further the Marxist cause included the [Justice and Peace Commission](/wiki/Pontifical_Council_for_Justice_and_Peace) (of which Cheng was the executive secretary), the Student Christian Movement of Singapore, the Young Christian Workers Movement and the Catholic Welfare Centre, which assisted foreign workers and maids working in Singapore. The government also said that the detainees had links with Filipino leftists and advocates of [liberation theology](/wiki/Liberation_theology) as well as Sri Lankan separatists. Several members and alleged conspirators had trained with the [Tamil Eelam Liberation Organisation](/wiki/Liberation_Tigers_of_Tamil_Eelam), a Sri Lankan terrorist group. Several pictures, especially of Chung Lai Mei, were published, showing her holding a gun, as well as participating in military training. Documents and witnesses said that several of them had gone through weapon training courses and forms of military training by Marxist-affiliated or terrorist-linked groups. ### Initial reaction Following the arrests, Archbishop [Gregory Yong](/wiki/Gregory_Yong), the head of the Catholic Church in Singapore, issued a joint statement with his priests that expressed support for the four full-time church workers and six volunteers who were detained. It also affirmed that \"the Catholic Church... must continue its mission of spreading its teachings on matters pertaining to justice as they apply to social, economic and political issues.\" The joint statement and a pastoral letter supporting the Church workers were read in all Catholic churches on 31 May 1987. The Church also held a special Mass for the detainees and their families. All this led to a build-up of tension between the Church and the government. ### Meeting with Lee Kuan Yew On 2 June 1987, a meeting was arranged between Prime Minister [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) and Archbishop Gregory Yong as well as nine other Catholic Church representatives who had been cleared by the Internal Security Department. Lee was concerned about the reaction of the Catholic community to the detentions. When Yong asked for proof that nine of the detained church workers had been involved in a clandestine communist network, Lee interrupted him by saying, \"It is not a practice, nor will I allow subversives to get away by insisting that I've got to prove everything against them in a court of law or evidence that will stand up to the strict rules of evidence of a court of law.\" In a press conference given immediately after the meeting, Yong said that he accepted the Internal Security Department's evidence against Cheng and was satisfied that the government had nothing against the Catholic Church when they arrested him. Yong said, \"That the man himself [Vincent Cheng] admitted that he was using the Church...I think this is one of the biggest reasons why I have to accept the Government's statement. ...After going through the depositions made by the person concerned himself, I have no way of disproving this statement.\" Lee stressed that the government upheld freedom of religion but would not tolerate the use of religion for subversive activities. However, two years later in 1989, speaking in court during the defamation suit launched by the government against the *[Far Eastern Economic Review](/wiki/Far_Eastern_Economic_Review)*, Father Joachim Kang gave a different account of the meeting. One of the Catholic priests who was present at the meeting, Kang said that Lee Kuan Yew was dismissive of Vincent Cheng and the detainees, saying they were \"stupid novices\" and calling Tan Wah Piow a \"simpleton\". Instead, Lee turned the spotlight on four priests: Fathers Edgar de Souza, Joseph Ho, Patrick Goh and Guillaume Arotcarena. Edgar D'Souza was the associate editor of *The Catholic News* and press liaison officer of the Church; Joseph Ho was the chairman of the Justice and Peace Commission; Patrick Goh was the national chaplain of the Young Christian Workers' Movement and a commission member; and Guillaume Arotcarena was the director of the Catholic Centre for Foreign Workers. Lee criticised them for venturing into the political arena and gave the impression that he considered the priests to be \"subversives, Marxists or communists\", and mentioned that the government had full rights under the Internal Security Act to arrest them. It left Kang feeling \"dead worried\" about the fate of the priests and the Church. Kang also said that he got the impression that the real target of the government's action was not the 16 detainees but the four priests. ### Subsequent actions Following the press conference, Archbishop Gregory Yong implemented measures that were an about-turn from his earlier stance. He withdrew the most recent issue of *The Catholic News* which focused on the Church's support for the detainees and accepted the resignation of the four priests involved with the organisations named in the conspiracy as well as suspended them from their preaching duties. He also ordered his priests not to mix politics and religion in sermons and shut down the Justice and Peace Commission and the Catholic Centre for Foreign Workers. ## Confessions on television During their time in prison, all the detainees eventually signed confessions of their involvement in the alleged Marxist plot. Most of them also made confessions on television as it had become customary for the government to televise confessions of those held without trial under the Internal Security Act. An interview with Vincent Cheng was broadcast on 9 June 1987, some 19 days after his arrest. For two hours, Cheng answered questions from four journalists about his role in the Marxist plot. Over the next few days, the Singapore press published lengthy extracts from the interview. In a two-part television documentary titled *Tracing The Conspiracy*, broadcast on 28 June 1987, other detainees spoke of the purported roles they played in the conspiracy. Tang Lay Lee and Teo Soh Lung said that they targeted the [Law Society](/wiki/Law_Society_of_Singapore) as a pressure group to oppose the government. Wong Souk Yee spoke of how the drama group, Third Stage, used plays as a tool to portray Singapore's social and political system in an unfavourable light. Low Yit Leng, Chung Lai Mei and Tan Tee Seng talked about their student activist days. The detainees said Tan Wah Piow had insisted that they infiltrate the [Workers' Party](/wiki/The_Workers%27_Party_(Singapore)), which was why they helped to print and distribute Workers' Party pamphlets during the [1984 General Elections](/wiki/1984_Singaporean_general_election). After the elections, they said, Kenneth Tsang Chi Seng and Tan Tee Seng moved into positions of influence within the party, and later took control of the party's publication, *The Hammer*, and used it as a channel to propagate anti-government sentiments and influence public opinion against the government. ## International response Reactions to the news of the arrests arrived swiftly from abroad. [Senior Minister](/wiki/Senior_Minister_of_Singapore) [S. Rajaratnam](/wiki/S._Rajaratnam) stated that the detentions had drawn protests from about 200 organisations in the United States, Europe, Thailand, Philippines, Australia, New Zealand, Malaysia and Hong Kong. Major Asian news publications such as the *[Far Eastern Economic Review](/wiki/Far_Eastern_Economic_Review)*, *[Asiaweek](/wiki/Asiaweek)* and *[The Star](/wiki/The_Star_(Malaysia))* followed the affair closely and offered minute analyses, generally taking a critical tone with regard to the actions of Singaporean authorities. Prominent examples of external organisations that challenged the [People's Action Party](/wiki/People%27s_Action_Party) during the 1987 Internal Security Act arrests are the [International Commission of Jurists](/wiki/International_Commission_of_Jurists) (ICJ), [Amnesty International](/wiki/Amnesty_International), [World Council of Churches](/wiki/World_Council_of_Churches) and Asia Watch. Amnesty International sent a group to Singapore to investigate the case, later adopting all twenty-two detainees as [prisoners of conscience](/wiki/Prisoner_of_conscience). The ICJ also sent a mission to Singapore. Its report on 12 October 1987 stated that there was no evidence which justified the detainees being labelled 'Marxists' or 'Communists'; that the treatment of the detainees by the Internal Security Department amounted to \"clear and grave violations of human rights\"; and that \"the Mission's report endorses world opinion that the real motive for these detentions is to quash internal opposition and criticism of the Singapore government.\" The affair was also brought to the attention of the [European Parliament](/wiki/European_Parliament). On 4 July 1987, fifty-five members of the [United States Congress](/wiki/United_States_Congress), among whom were several presidents of Justice Commissions, signed a letter demanding that legal procedures begin or else that the detainees be set free. At a meeting, the foreign affairs ministers of the United States, Canada, New Zealand and Australia asked their Singapore counterpart for explanations of the affair. Fifteen deputies of Japan's [National Diet](/wiki/National_Diet) also sent a letter to Prime Minister [Lee Kuan Yew](/wiki/Lee_Kuan_Yew). ## Joint statement and re-arrests of 1988 With the exception of Vincent Cheng, all the detainees were released, on various dates, before the end of 1987. On 18 April 1988, nine of the ex-detainees released a joint statement to the press. In the statement, Teo Soh Lung, Kevin Desmond de Souza, Tang Lay Lee, Ng Bee Leng, William Yap Hon Ngian, Kenneth Tsang Chi Seng, Wong Souk Yee, Chng Suan Tze, and [Tang Fong Har](/wiki/Tang_Fong_Har) said that even though they had hitherto kept a \"fearful silence\", they decided to release a statement because of \"the constant barrage of Government taunts and its public invitation to speak the truth\". The following are extracts from the statement: > We categorically deny the Government's accusation against us. We have never been Marxist conspirators involved in any conspiracy. > > ...we were subjected to harsh and intensive interrogation, [deprived of sleep](/wiki/Sleep_deprivation) and rest, some of us for as long as 70 hours inside freezing cold rooms. > > Under these conditions, one of us was repeatedly doused with cold water during interrogation. > > Most of us were hit hard in the face, some of us for not less than 50 times, while others were assaulted on other parts of the body, during the first three days of interrogation. > > We were threatened with arrests, assault and battery of our spouses, loved ones and friends. We were threatened with INDEFINITE detention without trial. [Chia Thye Poh](/wiki/Chia_Thye_Poh), who is still in detention after twenty years, was cited as an example. We were told that no one could help us unless we \"cooperated\" with the ISD. > > These threats were constantly on our minds during the time we wrote our respective \"statements\" in detention. > > We were compelled to appear on television and warned that our release would depend on our performances on TV. We were coerced to make statements such as \"I am Marxist-inclined...\"; \"My ideal society is a classless society...\"; \" so-and-so is my mentor...\"; \"I was made use of by so-and-so...\" to incriminate ourselves and other detainees. One day after release of the statement, all the signatories except Tang Fong Har, who was in the United Kingdom at the time, were re-arrested. Patrick Seong Kwok Kei, a [Law Society](/wiki/Law_Society_of_Singapore) Council member and one of the lawyers who had acted for several of the detainees in 1987, was also arrested on the same day. On 6 May 1988, lawyer [Francis Seow](/wiki/Francis_Seow), who was representing Teo Soh Lung and Patrick Seong Kwok Kei, was arrested under the Internal Security Act while waiting inside the Internal Security Department's headquarters to meet his clients. He was supposed to have filed for writs of *[habeas corpus](/wiki/Habeas_corpus)* for his clients on the same day. The government accused him of \"colluding with foreign diplomats and officials to lead a group of opposition lawyers and professionals into Parliament.\" He was alleged to have misused his status as a legal counsel as a cover for political propaganda and agitation. Seow was held in detention for 72 days and was released, subject to restrictions on his freedom of movement and association, as a result of pressure by international human rights organisations. He was later charged and convicted *[in absentia](/wiki/Trial_in_absentia)* for [tax evasion](/wiki/Tax_evasion), having left Singapore to live in exile in the United States where he became a Fellow at the Department of Asian Studies at [Harvard University](/wiki/Harvard_University). During the 28th year of his exile, Seow died at the age of 87 in January 2016. In response to the ex-detainees' allegations of ill-treatment, the [Ministry of Home Affairs](/wiki/Ministry_of_Home_Affairs_(Singapore)) announced on 19 April that a Commission of Inquiry would be held to determine if the Marxist conspiracy was a government fabrication and whether the detainees were assaulted and tortured. [Trade and Industry Minister](/wiki/Ministry_of_Trade_and_Industry_(Singapore)) [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) said that \"the Government does not ill-treat detainees. It does however apply psychological pressure to detainees to get to the truth of the matter... the truth would not be known unless psychological pressure was used during interrogation.\" [Ow Chin Hock](/wiki/Ow_Chin_Hock), Member of Parliament for [Leng Kee](/wiki/Leng_Kee_Single_Member_Constituency), revealed later that Singaporeans, notably intellectuals, had \"harped on the need to protect detainees' rights\". The ex-detainees who were arrested eventually signed statutory declarations (SDs) reaffirming their original statements to the Internal Security Department. Five of the detainees said that they were not ill-treated. In Patrick Seong Kwok Kei's SD, he admitted to encouraging the release of the joint statement as he saw it as \"an opportunity to discredit the Government and embarrass it externally\", as well as feeding information to foreign correspondents to generate \"hostile publicity\" to pressure govt to release the detainees. He was released after 30 days in detention together with Tang Lay Lee and Ng Bee Leng. Vincent Cheng was conditionally released after three years in mid-June 1990. He had to abide by six restrictive conditions, one of which was not to engage or get involved in any activity that advocated a political cause. Even after the signing of the SDs, there were continued calls for a public inquiry. Minister for Home Affairs [S. Jayakumar](/wiki/S._Jayakumar_(Singaporean_politician)) stated that there was no longer a need to hold a Commission of Inquiry as investigations had showed that the ex-detainees \"were not... seeking judicial or legal redress but were acting as political propagandists out to discredit the Government.\" He also claimed that the foreign press had \"hysterical\" reactions to the news of the re-arrests, which \"did not come as a surprise\" to the government. ### *Habeas corpus* *See Changes to the law* After the re-arrests, four of the detainees – Teo Soh Lung, Kenneth Tsang Chi Seng, Wong Souk Yee and Kevin Desmond de Souza – were issued with one-year detention orders. They engaged [Anthony Lester](/wiki/Anthony_Lester,_Baron_Lester_of_Herne_Hill) and [Geoffrey Robertson](/wiki/Geoffrey_Robertson), [Queen's Counsels](/wiki/Queen%27s_Counsel) (QC) from the United Kingdom, to apply to the [High Court](/wiki/High_Court_of_Singapore) for writs of *[habeas corpus](/wiki/Habeas_corpus)*, a legal action that requires a person under arrest to be brought before a judge to challenge detention lacking sufficient cause or evidence. They were unsuccessful. They then appealed to the [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore). In a landmark ruling, the Court of Appeal ordered the four detainees to be released[*citation needed*] but they were immediately re-arrested under new detention orders. The detainees filed fresh applications for writs of *habeas corpus*, but – with the exception of Teo – later withdrew their applications and were released. Teo's application was dismissed by the High Court after the government amended the [Constitution](/wiki/Constitution_of_Singapore) and the Internal Security Act to reverse the Court of Appeal's earlier decision. The amendments were expressed to operate retroactively. The legality of these amendments was unsuccessfully challenged by Teo in *Teo Soh Lung v. Minister for Home Affairs (1989–1990)* and Vincent Cheng in *Cheng Vincent v. Minister for Home Affairs (1990)*. ## Impact of Operation Spectrum ### Changes to the law The legal challenges mounted by the detainees led the Singapore government to introduce bills in [Parliament](/wiki/Parliament_of_Singapore) to amend the [Constitution](/wiki/Constitution_of_Singapore) and the [Internal Security Act](/wiki/Internal_Security_Act_(Singapore)) to remove the power of the judiciary in cases related to internal security. Although the [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore) held in the seminal 1988 case *Chng Suan Tze v. Minister for Home Affairs* that the courts could review the legality of detentions under the Act, the government reversed the effect of the case less than two weeks later, announcing that it would restore the law to its pre-Chng Suan Tze state. Bills seeking to amend the Constitution and the Internal Security Act were introduced and enacted by Parliament on an urgent basis, and they came into force on 25 January 1989. The legality of the amendments was challenged by Teo in *Teo Soh Lung v. Minister for Home Affairs* (1989–1990) and Cheng in *Cheng Vincent v. Minister for Home Affairs* (1990) but they were unsuccessful. The amendments were determined to be effective by the [High Court](/wiki/High_Court_of_Singapore) and Court of Appeal in 1989 and 1990 respectively, with the Court of Appeal holding that Parliament had effectively turned back the clock to 1971, and so it could not consider whether there were objective grounds for the detention. The Internal Security Act is now shielded from unconstitutionality by Article 149 of the Constitution. Appeals to the United Kingdom's [Privy Council](/wiki/Judicial_Committee_of_the_Privy_Council) were also abolished because the government averred that only the local courts should be involved in matters that involved Singapore's national security. Following this episode, the [Maintenance of Religious Harmony Act](/wiki/Maintenance_of_Religious_Harmony_Act) was passed in 1990 as an additional legal instrument to keep politics and religion separate in Singapore. The law gives the [Minister for Home Affairs](/wiki/Ministry_of_Home_Affairs_(Singapore)) the power to issue restraining orders against any religious leader whose sermons, speeches or actions threaten Singapore's religious harmony. ### Gazetting of foreign media The *[Far Eastern Economic Review](/wiki/Far_Eastern_Economic_Review)*, a weekly news publication under [Dow Jones Inc.](/wiki/Dow_Jones_%26_Company), was gazetted[*further explanation needed*] and its circulation restricted as a result of an article about the Marxist conspiracy, \"New Light on Detentions\", that offended the Singapore government. Its circulation was reduced from 9,000 copies to 500 copies per issue per week. In addition, Prime Minister [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) commenced a personal action for defamation against the *Far Eastern Economic Review*, its editor, the reporter, and all those connected with its publication. *[Asiaweek](/wiki/Asiaweek)*, a regional weekly owned by [Time Inc.](/wiki/Time_Inc.), was also gazetted due to its refusal to publish two letters from the government concerning the magazine's cover story on the detentions. The magazine's circulation was reduced from 10,000 copies to 500 copies per week. When *Asiaweek* softened its stance against the government, its circulation was raised to 5,000 copies, but not before its resident correspondent, [Lisa Beyer](/wiki/Lisa_Beyer), was transferred out to Hong Kong. Beyer had written articles relating to the 1987 arrests. When she chose to resign, the circulation of *Asiaweek* was raised to 7,500 copies weekly per issue. ## Views of the Marxist conspiracy The existence of the conspiracy is contentious among many political commentators, academics and members of Singapore's ruling elite. British historian [Mary Turnbull](/wiki/Mary_Turnbull) wrote that \"the alleged Marxist conspiracy and the Liberation Theology menace turned out to be myths.\" Michael D. Barr, a historian at [Flinders University](/wiki/Flinders_University), called the conspiracy a \"fanciful narrative\". [Goh Chok Tong](/wiki/Goh_Chok_Tong) revealed in his interviews for *Men in White: The Untold Stories of the PAP* that former [Minister for National Development](/wiki/Ministry_of_National_Development_(Singapore)) [S. Dhanabalan](/wiki/S._Dhanabalan) left the [Cabinet](/wiki/Cabinet_of_Singapore) in 1992 because he was not comfortable with the way the government had dealt with the 1987 Marxist conspiracy. Goh said, \"At that time, given the information, he was not fully comfortable with the action we took... he felt uncomfortable and thought there could be more of such episodes in future. So he thought since he was uncomfortable, he'd better leave the Cabinet. I respected him for his view.\" Law lecturer [Walter Woon](/wiki/Walter_Woon), who would later assume the post of [Attorney-General](/wiki/Attorney-General_of_Singapore), said in a 1991 interview with *[The Straits Times](/wiki/The_Straits_Times)* that \"As far as I am concerned, the government's case is still not proven. I would not say those fellows were Red, not from the stuff they presented. I think a lot of people have this scepticism.\" There is evidence that Prime Minister [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) himself did not believe that those arrested were part of any Marxist conspiracy. According to notes taken by the Internal Security Department at a private meeting in the [Istana](/wiki/Istana_(Singapore)) on 2 June 1987 at 1500 hours between Lee and Catholic church leaders, Lee said that he was \"not interested in Vincent Cheng and his group\", that he \"did not believe Tan Wah Piow was in control,\" and that he regarded the detainees as nothing more than \"do-gooders, who wanted to help the poor and dispossessed\". According to Catholic priest Joachim Kang, who was present at the same meeting, Lee also dismissed Vincent Cheng and the others as \"stupid novices\" and called Tan Wah Piow a \"simpleton\". ## 30th anniversary In May 2017, the ex-detainees launched a book, *1987: Singapore's Marxist conspiracies 30 years on*, to mark the 30th anniversary of Operation Spectrum and called for the abolition of the ISA. On 3 June, eight blindfolded protesters led by [Jolovan Wham](/wiki/Jolovan_Wham) entered an [MRT](/wiki/Mass_Rapid_Transit_(Singapore)) train holding up the published book as part of a silent protest against Operation Spectrum. During the protest, Wham also pasted two sheets of A4 paper on an MRT train panel, for which he was charged with vandalism in addition to organising public assemblies without a permit. He was fined. - [National Arts Council (Singapore) § Operation Spectrum](/wiki/National_Arts_Council_(Singapore)#Operation_Spectrum) - [Operation Coldstore](/wiki/Operation_Coldstore) - [Operation Lalang](/wiki/Operation_Lalang) ## Notes - Francis T. Seow (1994), *To Catch a Tartar: A Dissident in Lee Kuan Yew's Prison*, (Monograph 42/Yale Southeast Asia Studies), [ISBN](/wiki/ISBN_(identifier)) 0-938692-56-9. - Haas, Michael (1999). *The Singapore puzzle* (1. publ. ed.). Westport, Conn. [u.a.]: Praeger. [ISBN](/wiki/ISBN_(identifier)) 978-0275963798. - Michael D. Barr (2008), \"Singapore's Catholic Social Activists\", in Michael D. Barr and [Carl A. Trocki](/wiki/Carl_A._Trocki), eds., *Paths not taken: political pluralism in post-war Singapore*, Singapore: NUS Press, [ISBN](/wiki/ISBN_(identifier)) 9789971693787. - Michael D. Barr (2010), \"Marxists in Singapore? Lee Kuan Yew's Campaign against Catholic Social Justice Activists in the 1980s\", *Critical Asian Studies*, 43(3), 335–362. - Tan Wah Piow; foreword by G.Raman (2012). *Smokescreens & mirrors : tracing the \"Marxist Conspiracy\"*. Singapore: Function 8 Limited. [ISBN](/wiki/ISBN_(identifier)) 9789810721046. - Teo Soh Lung (2010), \"*Beyond the Blue Gate: Recollections of a Political Prisoner*\", Petaling Jaya, Selangor, Malaysia: Strategic Information and Research Development Centre, [ISBN](/wiki/ISBN_(identifier)) 9789810882150. - Timeline of the \"plot\" - Fang, Hoe (2012). *That we may dream again* (2nd ed.). Singapore: [Ethos Books](/wiki/Ethos_Books). [ISBN](/wiki/ISBN_(identifier)) 9789810708672. - Low, Yit Leng; Teo, Soh Leng (2012). *Escape from the lion's paw : reflections of Singapore's political exiles*. Singapore: Function 8. [ISBN](/wiki/ISBN_(identifier)) 978-981-07-2103-9. - Rerceretnam, Marc. \"International response to 'Marxist conspiracy' arrests\" (PDF). *Asia Rights* (Five). Archived from the original (PDF) on 6 October 2008. Retrieved 2 June 2006. - Tang Fong Har's account of her arrest - Vincent Cheng's speech at SDP's Pre-Election Rally in 2010 Part 1 and Part 2 - Transcript of Francis Seow's interview with *The Straits Times* - 'Marxist Conspiracy' anniversary remembered - 15th Anniversary of May 21 ISA Arrests - Geoffrey Robertson, \"Torture: the human-rights answer\" - That We May Dream Again (Function 8 website) Portals: - Communism - Singapore\n",
  "language": "en",
  "processed_at": "2026-01-12T11:40:00.364352",
  "title": "Operation Spectrum",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Operation_Spectrum"
}