{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:39:54.340284"
  },
  "content": "Covert security operation in Singapore **Operation Coldstore** was the [code name](/wiki/Code_name) for a large-scale internal security operation carried out in [Singapore](/wiki/Colony_of_Singapore) on 2 February 1963, during the period when it was an [internally self-governing state](/wiki/Self-governance_of_Singapore) within the [British Empire](/wiki/British_Empire). The operation led to the arrest and [detention without trial](/wiki/Detention_without_trial) of 113 individuals under the Preservation of Public Security Ordinance 1955 (PPSO). These included leaders and members of the left-wing [Barisan Sosialis](/wiki/Barisan_Sosialis) (BS), [trade unionists](/wiki/Trade_unionists), students and activists accused of involvement in [communist](/wiki/Communist) front organisations. The operation was approved by the [Internal Security Council](/wiki/Internal_Security_Council), a body composed of representatives from the [British government](/wiki/British_government), the [Singaporean government](/wiki/Government_of_Singapore) and the [Malayan federal government](/wiki/Government_of_Malaysia). The operation was initiated by the [People's Action Party](/wiki/People%27s_Action_Party) (PAP) government led by [Prime Minister](/wiki/Prime_minister_of_Singapore) [Lee Kuan Yew](/wiki/Lee_Kuan_Yew), who viewed BS as a serious political threat ahead of the [1963 general election](/wiki/1963_Singaporean_general_election). Officially, Operation Coldstore was presented as a measure to protect internal security by neutralising communist influence from the [Malayan Communist Party](/wiki/Malayan_Communist_Party) (MCP). However, critics have argued that it was politically motivated and aimed at eliminating the PAP's most effective opponents. Several of those arrested, including [Lim Chin Siong](/wiki/Lim_Chin_Siong) and [Poh Soo Kai](/wiki/Poh_Soo_Kai), denied any involvement in communist activities. In the years since, Operation Coldstore has continued to be a topic of contention among historians, former detainees and political commentators. Its proponents maintain that it was a necessary step to counter communist subversion and preserve national stability during a time of considerable unrest. The region was still dealing with the aftermath of the [Malayan Emergency](/wiki/Malayan_Emergency) and the rising tensions of the *[Konfrontasi](/wiki/Konfrontasi)* with [Sukarno](/wiki/Sukarno)'s [Guided Democracy](/wiki/Guided_Democracy_in_Indonesia) government in [Indonesia](/wiki/Indonesia), which, although not explicitly communist, was widely viewed as sympathetic to communist causes. Supporters argue that those detained were part of a larger network of subversive forces aligned with communist movements that aimed to destabilise both Singapore and the surrounding region. Detractors regard it as a preemptive political purge that hindered the development of democracy in Singapore. They argue that the operation severely weakened the opposition and facilitated the PAP's consolidation of power with the backing of the British prior to their eventual withdrawal, influencing the course of Singapore's political landscape for many years thereafter. ## Background and contexts Part of a series on the[History of Singapore](/wiki/History_of_Singapore)[Early history](/wiki/Early_history_of_Singapore) (pre-1819)[Srivijaya](/wiki/Srivijaya)650–1377[Temasek](/wiki/Temasek), [Long Ya Men](/wiki/Long_Ya_Men), [Ban Zu](/wiki/Ban_Zu)c.14th century[Kingdom of Singapura](/wiki/Kingdom_of_Singapura)1299–1398[Majapahit](/wiki/Majapahit)1398–1400[Malacca Sultanate](/wiki/Malacca_Sultanate)1400–1528[Johor Sultanate](/wiki/Johor_Sultanate)1528–1819British colonial era (1819–1942)[Founding](/wiki/Founding_years_of_modern_Singapore)1819–1826[Straits Settlements](/wiki/Singapore_in_the_Straits_Settlements)1826–1867[Crown colony](/wiki/Singapore_in_the_Straits_Settlements#Crown_colony_(1867–1942))1867–1942[Japanese Occupation](/wiki/Japanese_occupation_of_Singapore) (1942–1945)[Fall of Singapore](/wiki/Fall_of_Singapore)1942[Sook Ching](/wiki/Sook_Ching)1942[Double Tenth incident](/wiki/Double_Tenth_incident)1943[Post-war period](/wiki/Colony_of_Singapore) (1945–1962)[First Legislative Council](/wiki/History_of_Singapore#First_Legislative_Council_(1948–1951))1948–1951[Maria Hertogh riots](/wiki/Maria_Hertogh_riots)1950[Second Legislative Council](/wiki/History_of_Singapore#Second_Legislative_Council_(1951–1955))1951–1955[Anti-National Service Riots](/wiki/1954_National_Service_riots)1954[Internal self-government](/wiki/Self-governance_of_Singapore) (1955–1963)[Hock Lee bus riots](/wiki/Hock_Lee_bus_riots)1955[Singapore Glass Factory strikes](/wiki/Singapore_Glass_Factory_strikes)1960[Pulau Senang prison riots](/wiki/Pulau_Senang_prison_riots)1963[Merger with Malaysia](/wiki/History_of_the_State_of_Singapore_(Malaysia)) (1963–1965)[Singaporean referendum](/wiki/1962_Singaporean_integration_referendum)1962Operation Coldstore1963[Race riots in Singapore](/wiki/1964_race_riots_in_Singapore)1964[MacDonald House bombing](/wiki/MacDonald_House_bombing)1965[Republic of Singapore](/wiki/History_of_the_Republic_of_Singapore) (1965–present)[ASEAN Declaration](/wiki/ASEAN_Declaration) ([ASEAN](/wiki/Association_of_Southeast_Asian_Nations))1967[1969 race riots of Singapore](/wiki/1969_race_riots_of_Singapore)1969[Laju incident](/wiki/Laju_incident)1974[Operation Spectrum](/wiki/Operation_Spectrum)1987[Asian financial crisis](/wiki/1997_Asian_financial_crisis#Singapore)1997[Embassies attack plot](/wiki/Singapore_embassies_attack_plot)2001[H1N1 pandemic](/wiki/2009_swine_flu_pandemic_in_Asia#Singapore)2009–2010[Bus drivers' strike](/wiki/2012_Singapore_bus_drivers%27_strike)2012[Little India riot](/wiki/2013_Little_India_riot)2013[2018 North Korea–United States Singapore Summit](/wiki/2018_North_Korea%E2%80%93United_States_Singapore_Summit)2018[COVID-19 pandemic](/wiki/COVID-19_pandemic_in_Singapore)2020–2022By topic - [Timeline](/wiki/Timeline_of_Singaporean_history) - [Riots](/wiki/List_of_riots_in_Singapore) - [Military](/wiki/Military_history_of_Singapore) Singapore portal - v - t - e ### Post-war conditions and the rise of left-wing movements The post-war conditions in Singapore were harsh for the working class as they had to grapple with poor working conditions. In the same period, British decolonisation of Singapore resulted in the installation of a new constitution in 1955 which encouraged \"local participation in politics\". The liberalisation of Singapore’s political environment led to the emergence of \"pro-labour left-wing movements\" which purported to represent the rights of the working class. The [Barisan Sosialis](/wiki/Barisan_Sosialis) would emerge as a prominent and popular left-wing group in 1961 along with Jamit Singh. Many of the left-wing groups organised demonstrations, ostensibly to achieve concessions for the workers, but also in service of the [Popular Front](/wiki/Popular_Front) strategy of the Communist movement. Some of these labour movements evolved into movements espousing national self-determination and independence from the British in the name of economic progress. They drew inspiration from global anti-colonial and [Third-Worldist](/wiki/Third-Worldist) struggles across Asia and Africa occurring in the post-war era. Against the backdrop of British imperial decline, the [Communist Party of Malaya](/wiki/Malayan_Communist_Party) (MCP) emerged in Malaya. The British and Malayan leaders' efforts to contain Communism led to a terrorist uprising known as the [Malayan Emergency](/wiki/Malayan_Emergency). Under the emergency conditions that the government imposed, individuals suspected to be involved in Communist activities could be detained without trial. This restricted and regulated environment was replicated in Singapore which facilitated the execution of Operation Coldstore in 1963 under the provisions of the Preservation of Public Security Ordinance (PPSO). The experiences from fighting the MCP in the 1950s led the British and Malayan leaders to formulate the view that many ethnic Chinese were linked to Communist movements and were seen as proxies of Communist China. As a result, the emergence of left-wing movements that were largely led by ethnic Chinese students and workers were seen as inimical. ### Political situation in Singapore In the [1959 Singapore General Elections](/wiki/1959_Singaporean_general_election), the [People's Action Party](/wiki/People%27s_Action_Party) (PAP) led by [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) contested and emerged victorious by winning 43 out of 51 constituencies. However, victory was short-lived as they were later defeated in the [Hong Lim by-election](/wiki/1961_Singaporean_by-elections) in April 1961 and the [Anson by-election](/wiki/1961_Singaporean_by-elections) in July 1961. The PAP candidates lost to [Ong Eng Guan](/wiki/Ong_Eng_Guan) and [David Marshall](/wiki/David_Marshall_(Singaporean_politician)) in both by-elections. The PAP was also increasingly divided, and its internal schisms became visible between 1960 and 1961. On 20 July 1961, left-wing members of the PAP defected from the PAP after Lee Kuan Yew's call for a motion of confidence in the government. Most of these members later formed the [Barisan Sosialis](/wiki/Barisan_Sosialis) (Barisan) on 30 July 1961, led by [Lim Chin Siong](/wiki/Lim_Chin_Siong). As many of the members who defected to the Barisan were prominent grassroots leaders, the Barisan had a strong support base and became a strong opposition party to the PAP. Given the Barisan's large support base, political onlookers speculated that the Barisan could potentially win the [1963 General Election](/wiki/1963_Singaporean_general_election). The British colonial records revealed that Lee Kuan Yew felt threatened by the powerful left-wing movements and had on several occasions tried to remove his opponents by invoking the PSSO to detain his opponents. ### Decolonisation and the formation of Malaysia The British believed that independence for Singapore should be granted with a merger with Malaya so that economic resources could be shared and that their concerns of Singapore becoming an \"independent, predominantly Chinese polity\" could be alleviated. The PAP, which was led by the English-educated Lee Kuan Yew, temporarily eased their fears in 1959. Lee Kuan Yew and the PAP also favoured merger with Malaya because the assistance of Malaya was required to suppress the growing left-wing which challenged the PAP, particularly in the wake of losing the two by-elections in 1961. Lee was adamant that communism could only be eradicated through merger. In his memoirs, Lee believed that the communist threat was real throughout the 1950s and 1960s in Singapore, and also perceived that Lim Chin Siong was one of the key communist leaders. Such sentiments were also evident in the Malayan government and it feared that a weakened PAP would become replaced by the radical Chinese left-wing groups and pose a threat to neighbouring Malaya which was predominantly Malay. Thus, Malaya slowly agreed to merger with Singapore, but on the pre-condition that Communist sympathisers from the left-wing movements be arrested. On 27 May 1961, following the PAP's defeats in the two by-elections, Malayan Prime Minister [Tunku Abdul Rahman](/wiki/Tunku_Abdul_Rahman) announced that \"sooner or later Malaya, Singapore and the Borneo territories should work together for close political and economic cooperation.\" ## Developments leading to Operation Coldstore ### Disagreements over specifics of arrests By 1962, it was clear that the Malayan government considered the arrests of Singapore's left-wing groups, which they perceived as communist breeding grounds, as one of the two pre-conditions for the creation of Malaysia. The debates over the specifics of the arrests resulted in a power struggle in 1961 between the British, Singapore and Malayan leaders. In February 1962, the Malayans insisted on the apprehension of opposition leaders in Singapore and warned that they would pull out from the [Internal Security Council](/wiki/Internal_Security_Act_(Singapore)) if their requests were ignored. However, the British officials in Singapore opposed such oppressive measures and argued that evidence had to be presented before arrests could be made. Observing that the Malayans were pushing for an arrest programme, [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) jumped onto the bandwagon in March 1962. The Malayans' call for arrests could revive Lee's earlier attempts in 1960 to remove \"certain communists close to [Lim Chin Siong](/wiki/Lim_Chin_Siong)\" by invoking the PSSO. In May 1962, a joint report was produced by Singapore and Malaya and presented to the Malayan, Singapore and British governments. The report advocated for an \"intensification of efforts to expose the communist, and deny them facilities, culminating in the detention of those shown to be Communist conspirators ... with Lim Chin Siong at the top of the list ...\". The [Earl of Selkirk](/wiki/George_Douglas-Hamilton,_10th_Earl_of_Selkirk) disagreed with the report's recommendations by highlighting that \"the Singapore Special Branch have virtually failed to identify directly any communist threats during the last three years\" and opined that \"Lee Kuan Yew is quite clearly attracted by the prospect of wiping out his main political opposition before the next general elections\". Therefore, cautioning against using the PSSO for political rather than security reasons. By 28 June 1962, the absence of concrete arrests led [Geofroy Tory](/wiki/Geofroy_Tory), the British representative in [Kuala Lumpur](/wiki/Kuala_Lumpur), to report that the Malayans were on the verge of withdrawing from merger if the pre-condition for arrests was unmet. This inaction was in part due to the Earl of Selkirk and [Philip Moore](/wiki/Philip_Moore,_Baron_Moore_of_Wolvercote)'s continued belief that insufficient evidence existed to demonstrate the existence of subversive communist activities. Moore, the Acting British Commissioner for Singapore, reasoned that Lim Chin Siong's political actions were constitutional and could not warrant an arrest. In July 1962, Moore opined that \"Lim is working very much on his own and that his primary objective is not the communist millennium ... It is far from certain that having attained this objective, Lim would necessarily prove a compliant tool of [Peking](/wiki/Beijing) or [Moscow](/wiki/Moscow).\" Distrust continued to mount between the British, Singapore and Malayans leaders over the specifics of the arrest as Selkirk reported to Sandys that \"the Malays talk of arrested 25 for security reasons; Lee Kuan Yew talks of arrested 250 for security and political reasons; in fact, I believe both of them wish to arrest effective political opposition and blame us for doing so.\" The leaders disagreed on who would assume responsibility for the impending arrests. However, while the pre-conditions remained unresolved, the issue of citizenship for merger had been decided. Malaya and Singapore agreed that with merger, internal security would come under the purview of the federal government. Singapore's citizens will also attain Malaysian citizenship, but they were not entitled to vote or run for elections across the causeway. Meanwhile, as discussions for merger and the arrests were underway, the discussed terms of the merger were disclosed in August 1961 in Singapore. Left-wing groups such as the Barisan were appalled as they perceived merger terms to be discriminatory and deprived Singaporeans of their voting rights in the federal elections. In addition, internal security would come under the purview of the federal government which Singaporeans could not vote for. The Barisan vehemently questioned the terms of the merger and encouraged their supporters to cast blank votes in upcoming referendum on the merger. The Barisan also argued that merger was a neo-colonial construct because it was conceived under the auspices of the British. However, Lee Kuan Yew wrote in his memoirs that these were \"delaying tactics\" that directed \"people to concentrate first on the anti-colonial struggle\" and conflating the Barisan with the communist, Lee wrote that Barisan's larger goal was communist subversion. To the dismay of the left-wing, the referendum results of the merger revealed that the PAP's merger scheme had won 71 percent of the votes. The results encouraged Lee to believe that he now had the mandate to pursue merger and remove the left-wing groups. ### Breakthrough with the Brunei Revolt The breakthrough in the discussion on the arrests came when a rebellion led by [A. M. Azahari](/wiki/A._M._Azahari) from the Party Rakyat occurred in [Brunei](/wiki/Brunei) on 8 December 1962. [Lim Chin Siong](/wiki/Lim_Chin_Siong) and the [Barisan Sosialis](/wiki/Barisan_Sosialis) expressed their support for the movement as an anti-colonial struggle but it was unclear if they were directly involved in the revolt. In any case, it was quickly discovered that on 3 December 1962, Azahari had had a rendezvous with Lim. Colonial records reveal that in a conversation with Moore, that Lee Kuan Yew had described the rebellion as a \"heaven-sent opportunity\" to legitimise the arrests of Lim Chin Siong and left-wing groups. In response to the rebellion, the Malayan government called for an Internal Security Council meeting to discuss the arrest of the Barisan leaders. While the meeting of Lim Chin Siong and Azahari reinforced the Singapore Special Branch's belief in an imminent communist subversion, the [Earl of Selkirk](/wiki/George_Douglas-Hamilton,_10th_Earl_of_Selkirk) still had his reservations about making the arrests. However, Sandys, the Colonial and Common Wealth Secretary pressured Selkirk to \"take advantage of the Barisan's declaration of support for the Indonesian-sponsored insurrection in Brunei. Selkirk was to push through the arrest under the cover of the Brunei emergency.\" The arrests were approved by the British Prime Minister, [Harold Macmillan](/wiki/Harold_Macmillan), on 12 December 1962 and the Internal Security Council promptly reconvened on 13 December to firm up details of the arrests. ### Failure of the first Operation Coldstore The arrests were scheduled for 16 December 1962 at 0200 hours but shortly before the scheduled date [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) expanded the list of arrestees to include Malayan parliamentarians Lim Kean Siew and [Ahmad Boestaman](/wiki/Ahmad_Boestaman) because they were opposed to merger. Lee also wanted the Malayan government to assume joint responsibility for the arrests and even composed a draft public statement for them to present in the federal parliament. Malayan Prime Minister [Tunku Abdul Rahman](/wiki/Tunku_Abdul_Rahman) rejected Lee's demands on the grounds that insufficient evidence existed to justify the arrest of the Malayan parliamentarians. In preparation for the arrests, a meeting was held at the Tunku's office on 15 December 1962 at 2200 hours. Lee continued to insist that the Malayan parliamentarians had to be arrested and was compelled to cancel the Singapore operation if his request was not granted. The Tunku, who was \"holding a party next door\" did not accede to Lee's request and said that Lee was trying to \"use him to justify the arrest of Singapore opposition.\" Lee, on the other hand, was worried that if only the radical left were put away, the Tunku would no longer have any incentive for Singapore to merge with Malaya. Consequently, the operation fell apart with grievous consequences. The Tunku was 'almost persuaded that Malaya's interest would be best served by taking North Borneo and Sarawak ... into the new Federation and leaving Singapore out', while Lee was coldly resigned to this and left for a vacation in [Cameron Highlands](/wiki/Cameron_Highlands) – unless the Federation took the initiative, the Singapore government would not bear joint responsibility for any arrests. On 17 December 1962, the Federation withdrew from the Internal Security Council, leaving the British aghast. On 28 December 1962, [Selkirk](/wiki/George_Douglas-Hamilton,_10th_Earl_of_Selkirk) cabled Sandys, warning him of the real danger that the Tunku would not be prepared to include Singapore in Malaysia, and that a compromise would have to be reached. ### Negotiations and compromises Selkirk was also uncomfortable with the presence of the \"communist united front members continuing to work in Singapore in the light of Indonesian activities in Borneo\". Thus, he repositioned his stance and wrote to the Secretary of State for Colonies advocating for prompt round-up of Communists in Singapore and estimated around 70 arrestees to be apprehended. The Malayan leaders were also anxious to employ the [Brunei rebellion](/wiki/Brunei_Revolt) as to make the arrests, but [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) remained uncontactable in Cameron Highlands. Colonial records reveal that [Goh Keng Swee](/wiki/Goh_Keng_Swee) had mentioned that \"there was no need for the Singapore government to do anything since the British would be forced by [the Tunku](/wiki/Tunku_Abdul_Rahman) to take action.\" In January 1963, the Tunku was alarmed when Lee Kuan Yew continued to expand the arrest list to include \"some members of Marshall's and Ong's parties\" despite \"protestations of Singapore Special Branch.\" Nevertheless, on 18 January 1963, the Malayan government agreed on the specifics of the arrests \"except for two matters ... the UPP members and the proposal that Lim be offered by Lee the opportunity to leave Singapore after the arrest.\" However, Tunku warned [Geofroy Tory](/wiki/Geofroy_Tory), the [British High Commissioner in Kuala Lumpur](/wiki/List_of_High_Commissioners_of_the_United_Kingdom_to_Malaysia) on 30 January 1963, that 'if this operation failed, merger with Singapore was off'. Tory, in turn warned everyone else, particularly his British colleagues and especially Lord Selkirk, to put their reservations aside as 'this was positively the last time'. All parties finally agreed to proceed, and 2 February 1963 was selected for the commencement of Operation Coldstore. Lee opted for this day because holding the Operation \"before the [Chinese New Year](/wiki/Chinese_New_Year) celebrations ... would dampen any adverse reaction.\" ## Operation Coldstore Operation Coldstore commenced at 0215 hours on 2 February 1963. The police and Special Branch officers gathered in [Johor](/wiki/Johor) before heading out to Singapore at 0315 hours to round up suspected communist sympathisers. A total of 113 people were arrested. Those detained included \"31 in the political sphere ... 40 trade union leaders, 18 from the education sphere, 11 from cultural circles, 7 members of rural committees of hawkers, nine people only identified as members of the MCP and 14 others.\" Among those arrested from the political sphere were 24 members from the [Barisan Sosialis](/wiki/Barisan_Sosialis). The arrests were defended by invoking the PSSO with claims that the arrestees had \"the long-term aim of the [Malayan Communist Party](/wiki/Malayan_Communist_Party) to infiltrate and take over left-wing political parties, workers' associations and trade unions in the colony in order to foment violent unrest.” A representative from the [People's Action Party](/wiki/People%27s_Action_Party), [S. Rajaratnam](/wiki/S._Rajaratnam), justified the operation by stating that \"action was taken not because they are Communists but because the danger of subversion and violence by communist in aid of these alien interventions.\" The Internal Security Council report stated that those arrested were \"hard core organisers and their collaborators of the Communist conspiracy in Singapore believed that the armed struggle remains a weapon to be employed whenever the opportunity arises.\" **Selected list of detainees:** 113 people, including: Name of detaineePositionPolitical party/organisation[Lim Chin Siong](/wiki/Lim_Chin_Siong)Secretary-General[Barisan Sosialis](/wiki/Barisan_Sosialis)[Sandrasegaran Woodhull](/wiki/Sandrasegaran_Woodhull)Vice-ChairmanBarisan Sosialis[Fong Swee Suan](/wiki/Fong_Swee_Suan)Secretary-General Executive Committee MemberSingapore Association of Trade Unions Barisan Sosialis[James Puthucheary](/wiki/James_Puthucheary)Legal AdvisorBarisan SosialisDominic PuthuchearyCommittee Member Committee Member Vice-presidentSingapore Association of Trade Unions Barisan Sosialis Singapore General Employees' Union[Poh Soo Kai](/wiki/Poh_Soo_Kai)Assistant Secretary GeneralBarisan Sosialis[Lim Hock Siew](/wiki/Lim_Hock_Siew)Committee MemberBarisan SosialisA. Wahab ShahChairmanParty RakyatTan Teck WahPresident Vice-PresidentSingapore General Employees' Union Singapore Association of Trade Unions[Said Zahari](/wiki/Said_Zahari)Editor*[Utusan Melayu](/wiki/Utusan_Melayu)*Jamit Singh[Linda Chen](/wiki/Linda_Chen)Lim Shee PingCommittee MemberBarisan SosialisTan Yam SengCommittee MemberBarisan Sosialis ## Aftermath ### Official representations Official accounts represent Operation Coldstore as a tough but necessary action to safeguard the internal security of Singapore as well as those of Singapore's neighbouring countries. At a press conference on 4 February 1963, [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) claimed that the \"open front communist organisations were ready to mount violent agitation to coincide with events outside Singapore\" which could also \"endangered the security of Malaysia.\" He also stated that \"if left alone without outside factors, Singapore would never have contemplated such sweeping actions.\" However, Lee's comments were not well received by the British and the Malayan governments as it shifted the responsibility for arrests on them while denying Lee's active involvement in the events leading up to the operation. ### Protest movements The execution of Operation Coldstore was followed by a series of protests and demonstrations. On 22 April 1963, four [Barisan Sosialis](/wiki/Barisan_Sosialis) leaders, along with [Lee Siew Choh](/wiki/Lee_Siew_Choh), demonstrated against Operation Coldstore at the Prime Minister's Office but were later apprehended and \"charged with abetment to overawe the government by force\". Operation Coldstore led to the arrests of [Nanyang University](/wiki/Nanyang_University) students who had been involved in opposing the referendum in 1962, and the termination of the Nanyang University student publication permit. These actions triggered widespread student protests against the repressive PSSO. In addition, the student unions of polytechnics, Nanyang University and the [University of Malaya](/wiki/University_of_Malaya) jointly produced a proclamation against the arrests and termination of their publication permit. [Amnesty International](/wiki/Amnesty_International) came to the fore and campaigned against Operation Coldstore from its headquarters in [London](/wiki/London), although their efforts were not successful. ### Operation Pechah Several people who escaped Operation Coldstore were arrested a few months later in Operation Pechah. ### Criticisms of treatment of detainees The conditions under which the detainees were held came under scrutiny by the Singapore Assembly when it was revealed that the detainees were kept in \"solitary confinement until their interrogation had been completed\" while \"the interrogation process itself appeared to be unnecessarily protracted.\" The extended length of interrogations also alarmed the British. In addition, in late May 1963, the British investigating team of Members of Parliament from the [Labour Party](/wiki/Independent_Labour_Party), which included [Fenner Brockway](/wiki/Fenner_Brockway,_Baron_Brockway), questioned the manner in which the detainees were treated. ### 1963 Singapore general elections and formation of Malaysia The [Barisan Sosialis](/wiki/Barisan_Sosialis) was the [People's Action Party](/wiki/People%27s_Action_Party)'s strongest opposition in politics. However, Operation Coldstore had substantially weakened the Barisan as most of its key personnel had been detained. According to Matthew Jones, \"the Barisan never recovered from the combined effects of the outcome of the referendum result and the 'Coldstore' detentions.” Jones also highlights that numerous Barisan leaders and members were bogged down with lawsuits and its followers were \"demoralised\". In addition, Tan Jing Quee mentions that \"the two main pillars of the left-wing movement in Singapore, the Barisan Sosialis and SATU, were decapitated,\" following Operation Coldstore. Operation Coldstore also set off the May Day rally in Farrer Park which was popularly supported by 39 left-wing unions and amassed a crowd of approximately 10,000 people. The rally was accompanied by a call by ST Bani, the president of SATU, who \"urged that a general election be held in Singapore under United Nations auspices\". In the end, the People's Action Party won the [1963 general elections](/wiki/1963_Singaporean_general_election) and Singapore merged with Malaya, Sarawak and North Borneo to form Malaysia on 16 September 1963. ## Debates and controversies ### Extent of communist presence An ongoing debate on Operation Coldstore is whether the extent of communist presence in Singapore had been inflated in the 1950s and 1960s. Individuals such as [Said Zahari](/wiki/Said_Zahari) and [Chin Peng](/wiki/Chin_Peng) suggested that the communist presence could have been exaggerated. Zahari, a journalist and one of those arrested during Operation Coldstore, said that the operation was not about arresting the communists as \"the [Communist Party of Malaya](/wiki/Communist_Party_of_Malaya) in Singapore was no longer active\", and that the operation was instead used to weaken the opposition to the [People's Action Party](/wiki/People%27s_Action_Party). Chin Peng, then the secretary-general of the Communist Party of Malaya said in his memoirs, \"Contrary to countless allegations made over the years by Singapore leaders, academics and the Western Press, we never controlled Barisan Socialists (sic)\", but also wrote, \"Operation Cold Store shattered our underground network throughout the island. Those who escaped the police net went into hiding. Many fled to Indonesia\". Scholars have likewise been split on the issue, with prominent historian [Thum Ping Tjin](/wiki/Thum_Ping_Tjin) arguing that the PAP had utilised the operation for political capital. Fellow historian Kumar Ramakrishna on the other hand, asserts that the communist threat was real and argues that the absence of subversive communist activities was caused by the clever strategy that had been adopted of working within the constitution to push Singapore in the direction of communism. ### Declassification of official documents The maturation of the 30-year rule has led to the release of declassified British archival documents pertaining to Operation Coldstore. However, the documents in the Internal Security Department archives of Singapore remain classified. Privilege access to these classified documents has been granted to scholars such as Kumar Ramakrishna. This situation has prompted historians such as [Tan Tai Yong](/wiki/Tan_Tai_Yong) to urge the government to \"widen access to the archives\" as \"such access should not hinge on who is asking for them\" so that historians can \"offer different perspectives.\" - [Operation Spectrum](/wiki/Operation_Spectrum), another covert anti-communist security operation that took place 24 years later - [Singaporean Internal Security Act](/wiki/Internal_Security_Act_(Singapore)) - [Malaysian Internal Security Act](/wiki/Internal_Security_Act_(Malaysia)) ## Recommended Readings - Hussin Mutalib (2004). Parties and Politics. A Study of Opposition Parties and the PAP in Singapore. Marshall Cavendish Adademic. [ISBN](/wiki/ISBN_(identifier)) 981-210-408-9 - Lee Kuan Yew. (1998). *The Singapore Story*. Federal Publications. [ISBN](/wiki/ISBN_(identifier)) 0-13-020803-5 - Mathew Jones, “Creating Malaysia: Singapore Security, the Borneo Territories and the Contours of British Policy, 1961-1963” in Journal of Imperial and Commonwealth History, Vol. 28, No. 2, May 2000. pp. 85–109 - Ball, S.J. (1997). \"Selkirk in Singapore\". *Twentieth Century British History*. **10** (2): 162–191. [doi](/wiki/Doi_(identifier)):10.1093/tcbh/10.2.162. - Liew, Kai Khiun (2004). \"The Anchor and the Voice of 10,000 Waterfront Workers: Jamit Singh in the Singapore Story\". *Journal of Southeast Asian Studies*. **35** (3). [doi](/wiki/Doi_(identifier)):10.1017/s0022463404000232. - Jones, Matthew (2000). \"Creating Malaysia: Singapore Security, the Borneo Territories, and the Contours of British policy\". *The Journal of Imperial and Commonwealth History*. **28** (2): 85–109. [doi](/wiki/Doi_(identifier)):10.1080/03086530008583091. - Thum, Pingtjin. “‘The Fundamental Issue is Anti-colonialism, Not Merger’: Singapore’s “progressive left,” Operation Coldstore, and the Creation of Malaysia,” in *Asia Research* *Institute, Working Paper Series No.* 211: 1 – 25. Portals: - Communism - Singapore - British Empire\n",
  "language": "en",
  "processed_at": "2026-01-12T11:39:54.339903",
  "title": "Operation Coldstore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Operation_Coldstore"
}