{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:40:05.409373"
  },
  "content": "* *Opium** was first recorded **in Singapore** by a written document that recorded [Stamford Raffles](/wiki/Stamford_Raffles) gifting [opium](/wiki/Opium) to a local ruler in 1819 to establish Singapore. Opium then became accessible through trading in the 19th century. It was one of the most traded goods along the Sea Trade route after the end of the Opium Wars. With the rise of opium farms in Singapore, they acted as the middleman that helped to process raw opium imported from British India, Persia, and Turkey to consumable opium and retail them to the Chinese coolies in local. In 1946, opium, including the tools (opium pipes and opium lamps), and opium dens were completely banned in Singapore. To treat the opium addicts, an Opium Treatment Centre was opened in 1955 and in 1989, and the Singapore government extended the death penalty for opium traffickers. ## Early history Historical accounts suggest that the first appearance of [opium](/wiki/Opium) (*Papaver somniferum)* in Singapore was in a written document that stated [Stamford Raffles](/wiki/Stamford_Raffles) offered the ruler [Temenggong Abdul Rahman](/wiki/Temenggong_Abdul_Rahman) opium as a gift after signing a treaty with him to establish Singapore in 1819. Prior to this, opium was legalised and commonly used in Europe, Middle East, US, and China for centuries as a form of medicine; while opium smoking was seen as a common practice. ## 1819-1942: Colonial rule Opium prohibition in China started in 1729 but there was still the use of opium due to smuggling of opium from the British as they had an increasing urge to trade opium with China for the demands of Chinese teas. To put a complete stop on opium use, [destruction of opium](/wiki/Destruction_of_opium_at_Humen) was enacted under the command of the Daoguang Emperor. This led to the outbreak of [opium wars](/wiki/Opium_Wars). When the wars ended, the British signed treaties with China, promising the trade of opium. After this, opium trading was common in the Sea trade route from Britain to China. When Singapore became a trading port of Britain, it removed the policy of [free trade](/wiki/Free_trade). Singapore then imported and exported large amounts of opium from British India, Persia (now Iran), and Turkey to China and Britain which made it one of the most traded item along the Sea trade route. Subsequently, when Singapore opened up for settlement, Chinese immigrants and British Indians formed new labour forces for the economic activities in Singapore. However, the Chinese immigrants had previously been introduced to opium back in China and continued the habit of opium-smoking in Singapore. Opium thus became a commodity locally and was popular among the immigrant Chinese population. At that time, not only was opium legal, opium-smoking was also seen as a common social practice for both the rich and the poor Chinese immigrants; offering opium pipes was like serving tea. Singapore as a trading port traded 1285 chests of opium in 1836 and increased to 4689 chests of opium in 1856. ### Opium farms Before 1819, there were existing similar opium farms in earlier settlements of Penang and Melaka; it was common throughout the colonised states in Asia as a way for colonial countries to generate revenue from the foreign population. After turning Singapore into a trading port, the British deployed an opium [tax farming](/wiki/Tax_farming) system to gain revenue; in 1830, the Opium Regulation was passed. The Singapore farms however, did nothing related to agriculture. The farmers purchased raw opium which was imported from other states, processed it into [chandu](/wiki/Chandu_(opium)), and distributed it to local opium shops for retail consumption by the Chinese coolies population. Before the 1840s, no exact record of opium farms was found. In 1845 to 1860, there were records of opium farms under Tay Eng Long, Lao Joon Teck, and Cheang Sam Teo. Between 1847 and 1853, the Temenggong was receiving $350 per month as rental fees for his opium and spirit farms. However, seeing the growth in population in Singapore and the demand for opium, they raised the rental fees for every new contract negotiation. In 1860, the rental fees increased to $8,000 per month. From 1860s onwards, there was increasing competition for opium farms; forces of Johor farmers and Singapore farmers were openly fighting each other. Opium dens controlled by the farmers spurred up rapidly with the secret societies. #### Opium preparation The Chinese farms had a procedure of making opium into chandu, making raw opium into consumable opium. The process was described as: > Two balls of opium are cut open and their contents put into an iron pan which is placed on a slow fire; a man keep stirring it with a piece of wood till the whole is dissolved; it is then divided and placed in two pans, these are inverted over the fire and baked till all moisture is absorbed. The opium can then be peeled off in slices. The hide or skin which was stripped off the ball is boiled in water till all of the opium is extracted from it. The water is then strained and poured over the slices of opium which are placed in pans. Baskets are now prepared by lining them with several layers of common China paper, and they are filled with the slices of opium and placed over pans... the pans are then taken off the fire, placed on the ground and the chandu cooled with fans. When quite cooled it is poured into boxes ready for sales. #### Opium revenue Singapore was one of the biggest distributors of opium and it became the central economy of Singapore. Opium was seen as the most valuable commodity, which generated about fifty percent of the total revenue from 1820 to 1860. From 1896 to 1906, the average annual revenue from opium was 49 percent of the total income of the [Straits Settlements](/wiki/Straits_Settlements), of which Singapore was a part. #### Local consumption In the early 19th century, due to the abolishment of slavery in Europe, a new labour force emerged to fill in the need. Combined with the political unrest and economic instability in China, many Chinese went overseas to search for opportunities. These Chinese labourers eventually landed in Singapore with the support of the British, and became known as [coolies](/wiki/Coolie). The Chinese coolies became the working class and occupied a huge population in Singapore. Many of these coolies were bachelors and had no activities during their free time, hence, they were attracted to opium dens and brothels where drugs were commonly smoked. Opium was also used as a method to control the Chinese coolies. Chinese merchants and farmers would encourage the habit of opium smoking and allow purchases of opium on credit for the coolies. Opium cost two-third of the coolies' wages and thereby making sure the coolies had to continue working for them to pay off their credits. ### Opposition to opium In 1906, the Chinese associations and social reformers such as [Chen Su Lan](/wiki/Chen_Su_Lan) and [Lim Boon Keng](/wiki/Lim_Boon_Keng) formed the Singapore Anti-Opium Society to help opium addicts to wean off the drug. The society had western educated Strait-Chinese figures which acted as moral guidelines to advocate the elimination of opium smoking. Chen Su Lan, a member of the society and a medical doctor, established an Anti-Opium Clinic on Kampong [Java Road](/wiki/Java_Road) in May 1933 with the support of the Singapore Anti-Opium Society. ## 1942-1955: Japanese Occupation and post war During the Japanese Occupation (1942–1945), opium smoking was encouraged by the Japanese, as a politicised tool to ensure the Chinese population remained servile and did not collectively resist the occupation. After the Japanese Occupation, in October 1945, the British Military Administrative announced the banning of opium in Malaya. The population addicted to opium were approximately 16,000 in 1946, and even more before the war. Before the war, the addicts got their supplies from the government monopoly; however, following the execution of the ban, the individuals could only obtain opium for medical purposes or through illicit markets. Opium trafficking continued from 1947 to 1958 with the syndicates having agents as crew members on ships to transport opium. Traffickers continued to succeed, mainly due to 1. The inability of the Customs Department as the sole enforcement authority, with its limited resources, to meet the challenge of both illicit import and domestic consumption; 2. The preoccupation of senior customs officers with problems of reconstruction after the war; 3. Corruption amongst subordinate staff. Opium dens also operated illegally, with 1,571 opium saloons recorded in 1949. The [Singapore police force](/wiki/Singapore_Police_Force) carried out a total number of 14,556 raids on opium dens from 1952 to 1955, with 2,209 raids in 1952 (July-Dec), 4,831 in 1953, 3,796 in 1954, and 3,720 in 1955. During the raids, they arrested both the addicts and owners, seized opium pipes, opium lamps, and raw and processed opium. Opium addicts caught in raids were charged in court and sent to prison. In 1954, a bill amending the Dangerous Drugs Ordinance was raised in the Legislative Council to provide for the establishment of an opium treatment centre. The Narcotics Bureau also known as the Central Narcotics Intelligence Bureau was a newly formed department within the Customs department to assist the campaign against trafficking. It had an extensive network, exchanging information with twenty-six countries. The establishment of the Narcotics Bureau led to the seizures of opium. In 1954 and 1955, twelve leading traffickers were either banished or imprisoned, while others fled the country. ## 1955-present The Opium Treatment Centre established by the Legislative Council for the treatment and rehabilitation of addicts was located on [St. John's Island](/wiki/Saint_John%27s_Island) and started its operations in February 1955; the medical officer in charge was Leong Hon Koon. The treatment and rehabilitation were done in concert with proper ethics, that is the addict would be seen as a patient to be treated medically instead of an ill-doer. > The total treatment of the addict consists of three phases: > > 1. The withdrawal phase. > 2. The phase of rehabilitation and re-education. > 3. The follow-up phase - a continuation of the first two phases. On 30 November 1989, the Singapore government passed a bill to extend the death penalty to cocaine, cannabis and opium traffickers including manufacturers, importers and exporters.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:40:05.409001",
  "title": "Opium in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Opium_in_Singapore"
}