{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:40:10.652213"
  },
  "content": "Malaysian nobility title **Orang Kaya Indera Perba Jelai** is a nobility title in [Pahang Sultanate](/wiki/Pahang) and one of the four highest ranking nobles below the [monarch](/wiki/Monarch). The title traces its origin from the times of the [Old Pahang Sultanate](/wiki/Pahang_Sultanate), and was historically known as *Seri Maharaja Perba*. The traditional *pegangan* ('fief') of the nobility is the land from Tanjung Lindung, the entire [Jelai River](/wiki/Jelai_River) basin (roughly covering the [Cameron Highlands](/wiki/Cameron_Highlands) and [Kuala Lipis](/wiki/Kuala_Lipis) constituencies), to the borders of Perak and Kelantan, excluding the Tembeling. It is the largest fief in size and the farthest in distance from the royal court in Pekan, thus making the Maharaja Perba the most powerful among the four major chiefs. During the reign of [Raja Bendahara](/wiki/Raja_Bendahara) [Tun Ali](/wiki/Tun_Ali_of_Pahang), with the gradual centralisation of the royal court, the title was renamed 'Orang Kaya Indera Maharaja Perba' with the added 'Orang Kaya Indera' prefixes. In modern times, it was again renamed 'Orang Kaya Indera Perba Jelai'. ## Role Historically, the Orang Kaya Indera Perba was part of the *Orang Besar Berempat* ('four major chiefs') that wielded very wide powers in Pahang. They had the authority to impose taxation and to decide all criminal and civil cases except those which involved capital punishment. In fact, their power was limited only by the capacity of the monarch to restrain them, and it varied according to their proximity to Pekan, the further from the court, the greater their authority. They were obliged to appear at Pekan once a year to *menjunjung duli* ('pay homage'). They had to pay a form of tribute called *banchi* to the monarch. Their districts were subject to *serahan*; the obligation to buy, at exorbitant prices, goods the monopoly for the sale of which, in certain localities the ruler was in the habit of granting to one of his favourites. In the month of [Muharram](/wiki/Muharram). they appeared at court with offerings. In the time of war they were required to take the field with men, arms and food. The installation of the monarch was incomplete unless the *Orang Besar Berempat* assisted thereat. The Pahang constitutional theory was that the *Orang Besar Berempat* and, to a lesser degree, the other chiefs were the foundation upon which the monarch's authority rested. During the time of [Johor Empire](/wiki/Johor_Empire), the four major chiefs gave allegiance to the Bendahara as representing the [Sultan](/wiki/Sultan_of_Johor), but, in time, the sovereign being to them a nebulous figure, their allegiance tended to become more and more a matter of loyalty to the Bendahara personally. This became formally sealed with the establishment of [Pahang Kingdom](/wiki/Pahang_Kingdom) in the late 18th century. ## Succession The titles of the *Orang Besar Berempat* were hereditary. When a chief died, his successor, before approval of his appointment, was required to make a ceremonial offering to the monarch. This usually took the shape of gold-hilted [kris](/wiki/Kris), but other forms of offering were permissible. If the eldest son of a deceased chief were unfitted for the succession, it was proper to appoint a younger son, a brother, or a nephew to the chieftaincy. ## Genealogical tree There are varying genealogical accounts extant of the powerful family of the Jelai Chiefs. One of which, the oldest, was at one time in the possession of one of the eight nobles, Orang Kaya Maharaja Setia Raja Haji Wan Daud. It lay claim that the Jelai Chiefs family were of [Minangkabau](/wiki/Minangkabau_people) origin. Another account, collected by Arthur Furley Worthington from Che Sat of Penjom, attributes the family to Perak origin. According to another account possessed by the Jelai Chief family itself, which doesn't specify the family's origin, the first Maharaja Perba was said to have purchased from the Sultan of Johor territory in Pahang extending from Tanjong Lindong (above modern day [Jerantut](/wiki/Jerantut)) to the boundaries of [Perak](/wiki/Perak) and [Kelantan](/wiki/Kelantan). The price was a levelled (or full) *gantang* of gold, a coconut-shaped vessel filled with gold, and an arm-sleeveful of gold. This account is taken as the most faithful so far, since it is corroborated by Pahang tradition emanating from another source, *Hikayat Pahang serta Johor*. The authenticated descent of the family of Maharaja Perba follows: Family tree of Orang Kaya Indera Perba Jelai*Seri Maharaja Perba I* 1592-1638Wan Muhammad *Seri Maharaja Perba II* 'Maharaja Dalam' or 'Raja Muda' 1663-1688Wan Ismail *Seri Maharaja Perba III* 1688-1699Wan Muhammad *Seri Maharaja Perba IV* 1699-1797Wan Pahang *Panglima Perang*Wan Idris *Orang Kaya Indera Maharaja Perba Jelai V* 1797-1882Wan Daud *Dato' Maharaja Setia Raja*Wan Bong *Panglima Perang Kiri*Wan Muhammad *Orang Kaya Indera Maharaja Perba Jelai VI* 1882-1919Wan Da♀ a daughterWan Chik *Orang Kaya Indera Maharaja Perba Jelai VII* 1919Wan Tanjung *Orang Kaya Indera Maharaja Perba Jelai VIII* 1919-1935Wan Ali *Orang Kaya Indera Maharaja Perba Jelai IX* 1935-1957Wan Ibrahim *Orang Kaya Indera Maharaja Perba Jelai IX* 1957-1991Wan Badiuzzaman *Orang Kaya Indera Maharaja Perba Jelai XI* 1991-2008Wan Abdul Rahman *Orang Kaya Indera Maharaja Perba Jelai XII* 2008- - [Orang Kaya Indera Pahlawan](/wiki/Orang_Kaya_Indera_Pahlawan) - [Orang Kaya Indera Segara](/wiki/Orang_Kaya_Indera_Segara) - [Orang Kaya Indera Shahbandar](/wiki/Orang_Kaya_Indera_Shahbandar) ## Bibliography - Linehan, William (1973), *History of Pahang*, Malaysian Branch Of The Royal Asiatic Society, Kuala Lumpur, [ISBN](/wiki/ISBN_(identifier)) 978-0710-101-37-2 - Ahmad Sarji Abdul Hamid (2011), *The Encyclopedia of Malaysia*, vol. 16 - The Rulers of Malaysia, Editions Didier Millet, [ISBN](/wiki/ISBN_(identifier)) 978-981-3018-54-9 - Wan Haji Abdul Wahid Bin Haji Wan Hassan (2016), *Pengenalan Orang Besar Berempat (Introduction to the four major chiefs)*, Portal Diraja Pahang. Pejabat KDYTM Tengku Mahkota Pahang, archived from the original on 2023-12-10, retrieved 2017-03-16\n",
  "language": "en",
  "processed_at": "2026-01-12T11:40:10.651834",
  "title": "Orang Kaya Indera Perba Jelai",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Orang_Kaya_Indera_Perba_Jelai"
}