{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:40:12.841074"
  },
  "content": "* *Orang Kaya Indera Segara** is a nobility title in [Pahang Sultanate](/wiki/Pahang) and one of the four highest-ranking nobles below the [monarch](/wiki/Monarch). The title traces its origin from the times of the [Old Pahang Sultanate](/wiki/Pahang_Sultanate), and was historically known as *Maharaja Indera Putera*. The traditional *pegangan* ('fief') of the nobility is [Temerloh](/wiki/Temerloh), as well as the entire land between the Triang river basin to the borders of [Selangor](/wiki/Selangor) and [Rembau](/wiki/Rembau_District) in [Negeri Sembilan](/wiki/Negeri_Sembilan) (approximately the constituencies of [Bera](/wiki/Bera_District) and [Bentong](/wiki/Bentong)). During the reign of [Raja Bendahara](/wiki/Raja_Bendahara) [Tun Ali](/wiki/Tun_Ali_of_Pahang), the title was renamed 'Orang Kaya Indera Segara'. The title is the second-most influential among the four major chiefs, as his territory is the second-farthest from the capital. ## Role Historically, the Orang Kaya Indera Segara was part of the *Orang Besar Berempat* ('four major chiefs') that wielded very wide powers in Pahang. They had the authority to impose taxation and to decide all criminal and civil cases except those which involved capital punishment. In fact, their power was limited only by the capacity of the monarch to restrain them, and it varied according to their proximity to Pekan, the further from the court, the greater their authority. They were obliged to appear at Pekan once a year to *menjunjung duli* ('pay homage'). They had to pay a form of tribute called *banchi* to the monarch. Their districts were subject to *serahan*; the obligation to buy, at exorbitant prices, goods the monopoly for the sale of which, in certain localities the ruler was in the habit of granting to one of his favourites. In the month of [Muharram](/wiki/Muharram). they appeared at court with offerings. In the time of war they were required to take the field with men, arms and food. The installation of the monarch was incomplete unless the *Orang Besar Berempat* assisted thereat. The Pahang constitutional theory was that the *Orang Besar Berempat* and, to a lesser degree, the other chiefs were the foundation upon which the monarch's authority rested. During the time of [Johor Empire](/wiki/Johor_Empire), the four major chiefs gave allegiance to the Bendahara as representing the [Sultan](/wiki/Sultan_of_Johor), but, in time, the sovereign being to them a nebulous figure, their allegiance tended to become more and more a matter of loyalty to the Bendahara personally. This became formally sealed with the establishment of [Pahang Kingdom](/wiki/Pahang_Kingdom) in the late 18th century. ## Succession The titles of the *Orang Besar Berempat* were hereditary. When a chief died, his successor, before approval of his appointment, was required to make a ceremonial offering to the monarch. This usually took the shape of gold-hilted [kris](/wiki/Kris), but other forms of offering were permissible. If the eldest son of a deceased chief were unfitted for the succession, it was proper to appoint a younger son, a brother, or a nephew to the chieftaincy. ## Genealogical tree Five generations of chiefs are traditionally holding the title, until the Orang Kaya Indera Segara V, Tahir. After the death of Tahir, the title was allowed to lapse, but it has again been revived, though not in the same family, in the person Che Engku Abdul Jamal, who is a grandson of [Tun Ali](/wiki/Tun_Ali_of_Pahang). From here onwards, the title has always been bestowed to a member of [Pahang royal family](/wiki/Bendahara_dynasty).[*citation needed*] Muhammad *Orang Kaya Indera Segara I*Aji *Orang Kaya Indera Segara II*Hasan *Orang Kaya Indera Segara III*[Tun Ali](/wiki/Tun_Ali_of_Pahang) *[Raja Bendahara](/wiki/Raja_Bendahara)*Ahmad *Orang Kaya Indera Segara IV*Engku Muda Mansur[Ahmad al-Muadzam Shah](/wiki/Sultan_Ahmad_al-Muadzam_Shah) *[Sultan of Pahang](/wiki/Sultan_of_Pahang)*[Tun Mutahir](/wiki/Tun_Mutahir_of_Pahang) *[Raja Bendahara](/wiki/Raja_Bendahara)*Tahir *Orang Kaya Indera Segara V*Engku Abdul Jamal *Orang Kaya Indera Segara VI*[Abdullah al-Mu'tassim Billah](/wiki/Abdullah_al-Mu%27tassim_Billah) *[Sultan of Pahang](/wiki/Sultan_of_Pahang)*[Mahmud Shah](/wiki/Mahmud_of_Pahang) *[Sultan of Pahang](/wiki/Sultan_of_Pahang)*Tengku MuhammadTengku Ismail *Orang Kaya Indera Segara VII*Tengku Ahmad *Orang Kaya Indera Segara VIII*Tengku Abdul Khalid *Orang Kaya Indera Segara IX**Tengku Husain*Tengku Ibrahim *Orang Kaya Indera Segara X*Tengku Asmawi *Orang Kaya Indera Segara XI* - [Orang Kaya Indera Pahlawan](/wiki/Orang_Kaya_Indera_Pahlawan) - [Orang Kaya Indera Perba Jelai](/wiki/Orang_Kaya_Indera_Perba_Jelai) - [Orang Kaya Indera Shahbandar](/wiki/Orang_Kaya_Indera_Shahbandar) ## Bibliography - Linehan, William (1973), *History of Pahang*, Malaysian Branch Of The Royal Asiatic Society, Kuala Lumpur, [ISBN](/wiki/ISBN_(identifier)) 978-0710-101-37-2 - Ahmad Sarji Abdul Hamid (2011), *The Encyclopedia of Malaysia*, vol. 16 - The Rulers of Malaysia, Editions Didier Millet, [ISBN](/wiki/ISBN_(identifier)) 978-981-3018-54-9 - Wan Haji Abdul Wahid Bin Haji Wan Hassan (2016), *Pengenalan Orang Besar Berempat (Introduction to the four major chiefs)*, Portal Diraja Pahang. Pejabat KDYTM Tengku Mahkota Pahang, archived from the original on 2023-12-10, retrieved 2017-03-15\n",
  "language": "en",
  "processed_at": "2026-01-12T11:40:12.840763",
  "title": "Orang Kaya Indera Segara",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Orang_Kaya_Indera_Segara"
}