{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:40:17.335161"
  },
  "content": "Ethnic group of Southeast AsiaYou can help **expand this article with text translated from the corresponding article in German**. *(September 2017)* Click [show] for important translation instructions. - View a machine-translated version of the German article. - Machine translation, like DeepL or Google Translate, is a useful starting point for translations, but translators must revise errors as necessary and confirm that the translation is accurate, rather than simply copy-pasting machine-translated text into the English Wikipedia. - Consider **adding a topic** to this template: there are already 1,833 articles in the main category, and specifying`|topic=` will aid in categorization. - Do not translate text that appears unreliable or low-quality. If possible, verify the text with references provided in the foreign-language article. - You **must** provide copyright attribution in the edit summary accompanying your translation by providing an interlanguage link to the source of your translation. A model attribution edit summary is `Content in this edit is translated from the existing German Wikipedia article at [[:de:Orang Laut]]; see its history for attribution.` - You may also add the template `{{Translated|de|Orang Laut}}` to the talk page. - For more guidance, see Wikipedia:Translation. Ethnic group The **Orang Laut** are several seafaring [ethnic groups](/wiki/Ethnic_group) and tribes living around [Singapore](/wiki/Singapore), [Peninsular Malaysia](/wiki/Peninsular_Malaysia) and the [Indonesian](/wiki/Indonesia) [Riau Islands](/wiki/Riau_Islands). The Orang Laut are commonly identified as the [Orang Seletar](/wiki/Orang_Seletar) from the [Straits of Johor](/wiki/Straits_of_Johor), but the term may also refer to any [Malayic](/wiki/Malayic_languages)-speaking people living on coastal islands, including those of the [Mergui Archipelago](/wiki/Mergui_Archipelago) in [Myanmar](/wiki/Myanmar) and [Thailand](/wiki/Thailand), commonly known as [Moken](/wiki/Moken). The population of the tribe in the 21st century is estimated to be 420,000 people. ## Etymology The [Malay](/wiki/Malay_language) term *orang laut* literally means 'sea peoples'. The Orang Laut live and travel in their boats on the sea. They made their living from fishing and collecting sea products. Another Malay term for them, *Orang Selat* (literally '[Straits](/wiki/Strait_of_Malacca) people'), was brought into European languages as *Celates*. ## Distribution Broadly speaking, the term encompasses the numerous tribes and groups inhabiting the islands and estuaries in the Ria Archipelago, the Pulau Tujuh Islands, the [Batam](/wiki/Batam) Archipelago, and the coasts and offshore islands of eastern [Sumatra](/wiki/Sumatra), the southern Malay Peninsula and Singapore. ## History Historically, the Orang Laut played major roles in [Srivijaya](/wiki/Srivijaya), the [Sultanate of Malacca](/wiki/Sultanate_of_Malacca), and the [Sultanate of Johor](/wiki/Sultanate_of_Johor). They patrolled the adjacent sea areas, repelling pirates, directing traders to their employers' ports and maintaining those ports' dominance in the area. In return, the ruler gave the Orang Laut leaders prestigious titles and gifts. The earliest description of the Orang Laut may have been by the 14th century Chinese traveler [Wang Dayuan](/wiki/Wang_Dayuan) who described the inhabitants of [Temasek](/wiki/Temasek) (present day Singapore) in his work *[Daoyi Zhilüe](/wiki/Daoyi_Zhil%C3%BCe)*. ## Popular culture In the story *The Disturber of Traffic* by [Rudyard Kipling](/wiki/Rudyard_Kipling), a character called Fenwick misrenders the Orang Laut as \"Orange-Lord\" and the narrator character corrects him that they are the \"Orang-Laut\". - Indonesia portal - Malaysia portal - Singapore portal - [Piracy in the Strait of Malacca](/wiki/Piracy_in_the_Strait_of_Malacca) - [Orang Laut in Singapore](/wiki/Malays_in_Singapore#The_Orang_Laut_(Sea_Nomads)) - [Urak Lawoi’ people](/wiki/Urak_Lawoi%E2%80%99_people) - [Sampan panjang](/wiki/Sampan_panjang), Orang Laut racing boat - [Loncong language](/wiki/Loncong_language) - Pirates of the East - Where the spirits roam - Riau in Transition - 1400s - The Orang Laut Warriors - a short documentary about the Orang Laut in the 15th - 17th century, produced for the Singapore Bicentennial in 2019.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:40:17.334711",
  "title": "Orang Laut",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Orang_Laut"
}