{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:40:15.387229"
  },
  "content": "Noble title in the Pahang State of Malaysia, a sultanate ***Orang Kaya Indera Shahbandar*** ('Mighty Noblemen Shahbandar', [Jawi](/wiki/Jawi_script): اورڠ كاي ايندرا شهبندر) is a nobility title in [Pahang Sultanate](/wiki/Pahang) and one of the four highest-ranking nobles below the [monarch](/wiki/Monarch) — equivalent to [Duke](/wiki/Duke) in some European peerage. The title traces its origin from the times of the [Old Pahang Sultanate](/wiki/Pahang_Sultanate), and was historically known simply as *[Shahbandar](/wiki/Shahbandar)* ('harbourmaster'). The territory under the jurisdiction of the Shahbandar was the royal capital, [Pekan](/wiki/Pekan), and its surrounding area stretching from Bebar river to Kuala Lepar, which mostly lies within the Pekan constituency. During the reign of [Raja Bendahara](/wiki/Raja_Bendahara) [Tun Ali](/wiki/Tun_Ali_of_Pahang), the title was renamed with the additional prefixes *Orang Kaya Indera* ('Mighty' or 'powerful nobleman'), thus it was later known as 'Orang Kaya Indera Shahbandar'. The title is the fourth most influential among the four major chiefs, because the Shahbandar lived in the vicinity of the capital, and tended to become the monarch's minister or chief executive officer. ## Role Historically, the *Orang Kaya Indera Shahbandar* was one of four major chiefs ([Malay](/wiki/Malay_language): *Orang Besar Berempat*) who wielded very wide powers in [Pahang](/wiki/Pahang). They had the authority to impose taxation, and to decide all criminal and civil cases except those which involved capital punishment. Their power was limited only by the capacity of the monarch to restrain them, which varied according to their proximity to Pekan — the further from the court, the greater their authority. Their districts were subject to the ruler granting [monopolies](/wiki/Monopoly) ([Malay](/wiki/Malay_language): *serahan*) on certain goods. They were obliged to appear at Pekan once a year in the month of [Muharram](/wiki/Muharram) to pay the monarch homage ([Malay](/wiki/Malay_language): *menjunjung duli*) and a form of tribute ([Malay](/wiki/Malay_language): *banchi*). During wartime, they were required to be taken to the field with men, arms, and food. The installation of the monarch was incomplete unless the *Orang Besar Berempat* assisted. The Pahang constitutional theory was that the *Orang Besar Berempat* and, to a lesser degree, the other chiefs were the foundation upon which the monarch's authority rested. During the time of the [Johor Empire](/wiki/Johor_Empire), the four major chiefs gave allegiance to the [Sultan of Johor](/wiki/Sultan_of_Johor) through his [viceroy](/wiki/Viceroy), the [Bendahara](/wiki/Bendahara#Bendaharas_of_Malacca_and_Johore). In time, with the sovereign being a distant figure, their allegiance tended to become more a matter of loyalty to the Bendahara personally. This became formally sealed with the establishment of the [Pahang Kingdom](/wiki/Pahang_Kingdom) in the late 18th century. ## Titles and style The full title and style for this peerage in the Malay language is *Yang DiHormat Orang Kaya Indera Shahbandar*. It placed at the front of the holder's name and his other [Malay styles and titles](/wiki/Malay_styles_and_titles). For example, **Yang DiHormat Orang Kaya Indera Shahbandar ke-10 [Tun](/wiki/Malay_styles_and_titles#Federal_titles) [Abdul Razak Hussein](/wiki/Abdul_Razak_Hussein)**. This is different from [Peerages in the United Kingdom](/wiki/Peerages_in_the_United_Kingdom) where the title and style placed at the back of the name. The first wife of the holder will carry the full title and style — Toh Puan Indera. ## Succession The titles of the *Orang Besar Berempat* were hereditary. When a chief died, his successor was required to make a ceremonial offering to the monarch before his appointment was approved. This usually took the shape of gold-hilted [kris](/wiki/Kris), but other forms of offering were permissible. If the eldest son of a deceased chief were unfit for the succession, it was proper to appoint a younger son, a brother, or a nephew to the chieftaincy. ## Shahbandar family The present members of the Shahbandar family claim [matrilineal](/wiki/Matrilineal) descent from To' Tuan, a [Bugis](/wiki/Bugis_people) chief who settled in Pahang about 1722, married a Pahang lady, and was said to have improved the art of [silk weaving](/wiki/Silk_weaving) in his adopted country. The [patrilineal](/wiki/Patrilineal) ancestor of the family is To' Tondek, the first *Orang Kaya Indera Shahbandar*. Furthermore, the lineage also can be traced back to the royal family of [Gowa](/wiki/Sultanate_of_Gowa), through To' Tuan (whose real name was “Karaeng Aji”) who was the grandson of *I Mappadulung Daeng Mattimung Karaeng Sanrobone* known as *Abdul Jalil*, its 19th ruler. After the death of Ali, the seventh *Orang Kaya Indera Shahbandar*, the title went to a non-family member Che Osman, son of Imam Perang Indera Mahkota Gendut. On Che Osman's death, the chieftaincy reverted to the old family in the person of Dato' Hussein. The incumbent titleholder is [Najib Razak](/wiki/Najib_Razak), who is the former [Prime Minister of Malaysia](/wiki/Prime_Minister_of_Malaysia). The surviving genealogical record of the Shahbandar family is: To' TuanTo' PongkengTo' PondokTo' Tondek *Orang Kaya Indera Shahbandar I*♀To' MasJenal *Orang Kaya Indera Shahbandar II*Bediman *Orang Kaya Indera Shahbandar III*♀To' EmbongJahidin *Orang Kaya Indera Shahbandar V*Ismail of Pedah *Orang Kaya Indera Shahbandar IV*Husain *Orang Kaya Indera Shahbandar VI*♀Che Sawiah♀Che PerakChe HusohAli *Orang Kaya Indera Shahbandar VII*Haji Andak (Tuan Hakim)Che LambakMuhammad TaibChe MatHussein *Orang Kaya Indera Shahbandar IX*Che NgahChe Mahmud[Abdul Razak](/wiki/Abdul_Razak_Hussein) *Orang Kaya Indera Shahbandar X*♀[Rahah Noah](/wiki/Rahah_Noah)Abdul AzizAbdul RaniAbdul Karim[Najib](/wiki/Najib_Razak) *Orang Kaya Indera Shahbandar XI*JohariNizamNazim[Nazir](/wiki/Nazir_Razak) Members of *Orang Besar Berempat* besides the Orang Kaya Indera Shahbandar: - [Orang Kaya Indera Pahlawan](/wiki/Orang_Kaya_Indera_Pahlawan) - [Orang Kaya Indera Perba Jelai](/wiki/Orang_Kaya_Indera_Perba_Jelai) - [Orang Kaya Indera Segara](/wiki/Orang_Kaya_Indera_Segara) ## Bibliography - Linehan, William (1973), *History of Pahang*, Malaysian Branch Of The Royal Asiatic Society, Kuala Lumpur, [ISBN](/wiki/ISBN_(identifier)) 978-0710-101-37-2 - Ahmad Sarji Abdul Hamid (2011), *The Encyclopedia of Malaysia*, vol. 16 - The Rulers of Malaysia, Editions Didier Millet, [ISBN](/wiki/ISBN_(identifier)) 978-981-3018-54-9 - Wan Haji Abdul Wahid Bin Haji Wan Hassan (2016), *Pengenalan Orang Besar Berempat (Introduction to the four major chiefs)*, Portal Diraja Pahang. Pejabat KDYTM Tengku Mahkota Pahang, archived from the original on 10 December 2023, retrieved 13 March 2017\n",
  "language": "en",
  "processed_at": "2026-01-12T11:40:15.386942",
  "title": "Orang Kaya Indera Shahbandar",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Orang_Kaya_Indera_Shahbandar"
}