{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:40:18.701688"
  },
  "content": "Indigenous ethnic group in Malaysia and SingaporeThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Orang Seletar\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(November 2023)* *(Learn how and when to remove this message)*Ethnic group **Orang Seletar** (also known as **Selitar** or **Slitar**) are one of the 18 [Orang Asli](/wiki/Orang_Asli) ethnic groups in [Malaysia](/wiki/Malaysia). They are classified under the [Proto-Malay](/wiki/Proto-Malay) people group, which forms the three major people group of the [Orang Asli](/wiki/Orang_Asli). The Orang Seletar are also considered as part of the [Orang Laut](/wiki/Orang_Laut), natives of the [Straits of Johor](/wiki/Straits_of_Johor); separating [Singapore](/wiki/Singapore) from [Peninsula Malaysia](/wiki/Peninsula_Malaysia). Despite their proximity to developed countries, the Orang Seletar largely retain a traditional way of life. In [Singapore](/wiki/Singapore), the Seletar people are considered to be part of the Malay community. In [Malaysia](/wiki/Malaysia), the government considers the Orang Seletar to be one of the 18 [Orang Asli](/wiki/Orang_Asli) officially registered tribes. As [Orang Asli](/wiki/Orang_Asli), the Seletar people are protected by the [Department of Orang Asli Development](/wiki/Department_of_Orang_Asli_Development) (JAKOA), which was previously known as the Department of Orang Asli Affairs (*Jabatan Hal Ehwal Orang Asli*, JHEOA) until 2011. The purpose of JAKOA is to raise the standard of living of the indigenous population to meet the average indicators of the country. Although the Orang Seletar were originally classed as part of the [Orang Laut](/wiki/Orang_Laut), the Malaysian government and JAKOA classifies Seletar people as one of the indigenous [Proto-Malay](/wiki/Proto-Malay) tribes, one of the three [Orang Asli](/wiki/Orang_Asli) subgroups today. They are one of the few indigenous peoples of [Peninsular Malaysia](/wiki/Peninsular_Malaysia), whose lifestyle is connected with the sea, not with the tropical forest. The Seletar people refer to themselves as **Kon Seletar** with the prefix \"Kon-\" or simply **Kon**; which is believed to have [Mon-Khmer language](/wiki/Mon-Khmer_language) origins. For comparison, in the [Old Mon language](/wiki/Old_Mon_language) and Middle [Mon language](/wiki/Mon_language), *Kon* means \"a person belonging to a certain ethnic or social group\". The Seletar people speak their own [Orang Seletar language](/wiki/Orang_Seletar_language) which is closely related to Malay. ## Settlement area For a long time, the Seletar people have been practicing a nomadic way of life within the mangrove forests and marshes along the [Tebrau Reach](/wiki/Tebrau_Reach), as well as at the mouths of rivers that flows into it. They lived on both sides of the strait, freely moving from one shore to the other, despite the existence of a border between [Singapore](/wiki/Singapore) and [Malaysia](/wiki/Malaysia). The width of the [Straits of Johor](/wiki/Straits_of_Johor) in any place does not exceed 2 km, and in some places does not exceed 500 meters. Such a narrow strip of water has never been a hindrance to sea nomads. At the end of the 19th century, mangrove forests dominated most of the coastal areas and in the estuaries of the rivers in northern Singapore, at the time of the arrival of the [British colonial](/wiki/British_Empire) here, they accounted for about 13% of the island. It was here that most of the Seletar people lived. Mangrove is a unique repository of rich and diverse aquatic plant and natural resources, the operation of which has built a traditional economic complex of this people. During the 20th century, mangrove forests in Singapore were cleared, and the Seletar people were forced to leave the region. Now they live only on the Malaysian side. They have largely abandoned the nomadic way of life and started living in a more organized settlement areas located on the south coast of [Johor](/wiki/Johor) where there are 9 villages namely, Kampung Teluk Kabung, Kampung Simpang Arang, Kampung Sungai Temun, [Kampung Bakar Batu](/wiki/Kampung_Bakar_Batu), Kampung Pasir Salam, [Kampung Pasir Putih](/wiki/Kampung_Pasir_Putih), Kampung Kuala Masai, Kampung Teluk Jawa and Kampung Kong Kong. Some of these villages are farther from the coast. On the north coast of Singapore in the 1980s there were 3 villages, but now they are no longer found. Some of the Seletars currently living on the south coast of [Johor](/wiki/Johor) can see a historical relationship with Singapore, while others have integrated into the Malay community in Singapore. ## Population The dynamics of the population in [Malaysia](/wiki/Malaysia) is as follows:- Year196019651969197419771980199319962000200320042010Population2522902773745144978018011,0371,4071,4071,042 Data from the 1996 census of the JHEOA recorded 801 Seletar people, of which 796 were in the state of [Johor](/wiki/Johor), and another five were in [Selangor](/wiki/Selangor). Some sources, such as Ethnologue or Joshua Project, still report data on the presence of Seletar people in [Singapore](/wiki/Singapore), but this is may not be accurate. According to Ariffin, in his general assessment of the population, speaks of 6 or 7 families of Seletar people remaining in [Singapore](/wiki/Singapore), which is about 32-38 people; in [Johor](/wiki/Johor), he counted 514 Seletar people as of 1977. Today in [Singapore](/wiki/Singapore), there are almost no more Seletar people remaining at all. ## Language They speak in the [Orang Seletar language](/wiki/Orang_Seletar_language), which belongs to the Malay group of [Austronesian languages](/wiki/Austronesian_languages). The Ethnologue project assigns it to the [Malay (macrolanguage)](/wiki/Malay_(macrolanguage)). French researcher Christian Pelras in 1972, conducted an analysis of the language at that time with the available [Orang Seletar language](/wiki/Orang_Seletar_language) dictionary. He came to the conclusion that it was only a dialect of the [Malay language](/wiki/Malay_language), since 85% of the Seletar words were Malay, and another 5% of the words are also present in Malay but have a slightly different meaning. 10% of the remaining words have no analogues in the [Malay language](/wiki/Malay_language). Some of this latter group seems to have matches in the languages commonly used on the island of [Kalimantan](/wiki/Kalimantan). However, there are also words of which Pelras could not find analogues in other [Austronesian languages](/wiki/Austronesian_languages). Among the 15% of the non-Malay words in the [Orang Seletar language](/wiki/Orang_Seletar_language) there are almost no words common in the neighboring [Duano' language](/wiki/Duano%27_language). Fresh data from field research that was published in 2015 by Kevin Blissett and Dirk Elling. As a result of a survey on the [Orang Seletar language](/wiki/Orang_Seletar_language) media was a list of general vocabulary drawn up corresponding to the generally accepted conventional [Swadesh list](/wiki/Swadesh_list). Answers of respondents were recorded on a digital voice recorder, and then decoded with the [International Phonetic Alphabet](/wiki/International_Phonetic_Alphabet). It provides valuable information on how to actually say spoken words. However, this is only the beginning of the research. This language still requires a huge amount of additional study and records before it is stored to a large extent. Like the findings of Pelras, these data capture the close lexical affinity of the [Orang Seletar language](/wiki/Orang_Seletar_language) with the [Malay language](/wiki/Malay_language). Many words are exactly the same as their correspondences in the [Malay language](/wiki/Malay_language); others can be derived from Malay words by simple phonological changes. A small group of words seems to be unique to the [Orang Seletar language](/wiki/Orang_Seletar_language), without apparent connection with the [Malay language](/wiki/Malay_language). Such characteristics indicates it as a Malay dialect, but not as an entirely independent language. However, there are also strong counter arguments. Firstly, the [Orang Seletar language](/wiki/Orang_Seletar_language) is not understandable to the Malay people. Secondly, both the Malay and the Seletar people considers the [Malay language](/wiki/Malay_language) and [Orang Seletar language](/wiki/Orang_Seletar_language) as separate languages. In addition, it appears to have a significant grammatical differences between these two languages. There is an alarming situation with the state of the [Orang Seletar language](/wiki/Orang_Seletar_language). So far, representatives of senior and middle aged generations communicate with each other exclusively or mainly in their native language, but younger generations and people living outside the community are more likely to use [Malay language](/wiki/Malay_language). This is a situation where, with each generation, the caretakers of the [Orang Seletar language](/wiki/Orang_Seletar_language) become increasingly few, and what is even more disturbing is that few Seletar people teach their mother tongue to their own children. Thus, there is a tendency towards the gradual displacement of the [Orang Seletar language](/wiki/Orang_Seletar_language), similar to the languages of other indigenous [Orang Asli](/wiki/Orang_Asli) peoples of [Peninsular Malaysia](/wiki/Peninsular_Malaysia), by standard [Malay language](/wiki/Malay_language). It is no surprise that [UNESCO](/wiki/UNESCO) includes the [Orang Seletar language](/wiki/Orang_Seletar_language) in the list of languages that are at serious risk of disappearance. There is no writing system in the [Orang Seletar language](/wiki/Orang_Seletar_language). ## Religion Although the Seletar people are very close to the [Malay language](/wiki/Malay_language), they have remained animists up to the 1980s. The missionary activities of the Malaysian authorities from the Department of Islamic Development Malaysia were not active in those days, and the Seletar people themselves do not really perceive the basic principles of [Islam](/wiki/Islam). The postulates of religion offered by the Malay people looked too abstract for them. For these sea nomads, these are just texts that are separated from real life. The Muslim religion does not have meaning and practical functions for them. The concept of [the only God](/wiki/Monotheism) is too inaccessible, and, unlike the spirits of nature, can not affect specific events. As before, the Seletar people worship the numerous spirits (*mambang*) that they believe are inhabited everywhere: they live on trees, under water, in rocks, in caves, in the air and so forth. At the conviction of the Seletar people, when not respecting the environment; that is the abode of spirits, mishaps like illnesses, conflicts and death will occur. The only way to treat them is through exorcism and appeasement of the spirits. Deaths and illnesses of the Seletar people are connected with the land. They would go to the shore to cure a patient or to bury the dead. The situation has changed in the 1980s, when the Malaysian government began to work to strengthen the country's position on [Islam](/wiki/Islam). Muslim missionaries engaged in the conversion of [Islam](/wiki/Islam) to the pagan indigenous [Orang Asli](/wiki/Orang_Asli) peoples of the country. In 1997, according to JHEOA statistics, there were already 240 Muslim on the territory of the state of [Johor](/wiki/Johor). That is about a quarter of the Seletar people's population. According to [Joshua Project](/wiki/Joshua_Project), 5% of the Seletar people are Christians. Due to the fact that the majority of the Seletar people are not Muslims and still practice [animism](/wiki/Animism), they are not perceived by society as Malay. ## History ### Pre-colonial period [Orang laut](/wiki/Orang_laut) were among the first inhabitants of the coastal areas of the [Strait of Malacca](/wiki/Strait_of_Malacca). The Orang Seletar were once part of the sea nomads [Orang Laut](/wiki/Orang_Laut) that lived in boats at the sea, islands, coastal areas and estuaries. Thus, when a Malay prince [Parameswara](/wiki/Parameswara_(king)), the future ruler of the [Malacca Sultanate](/wiki/Malacca_Sultanate), appeared in [Malacca](/wiki/Malacca) with his supporters, at this point there was already a small fishing village, whose population were the [Orang laut](/wiki/Orang_laut). [Parameswara](/wiki/Parameswara_(king)) then established ties with them by including the leaders of the [Orang laut](/wiki/Orang_laut) in the political hierarchy of his kingdom and through prudent marriages in the royal family itself. Excellent knowledge of the countless islands and treacherous seas, made from the [Orang laut](/wiki/Orang_laut) of skilled navigators and naval commanders. Despite the fact that they were not Muslims, their people were serving in the Malay [Malacca Sultanate](/wiki/Malacca_Sultanate), and later the [Johor Sultanate](/wiki/Johor_Sultanate). For example, [Hang Tuah](/wiki/Hang_Tuah), the most famous figure in the history of Malay Admiral and a classic example of warrior-knight in Malay folklore, was among the [Orang laut](/wiki/Orang_laut). For hundreds of years, the loyalty of the [Orang laut](/wiki/Orang_laut) to the Malay rulers of the [Malacca Sultanate](/wiki/Malacca_Sultanate) was a decisive factor in the preservation and prosperity of the kingdom. The [Orang laut](/wiki/Orang_laut) of Malacca, or as they were called *Orang Selat* (\"Strait people\" or \"People of the Straits\"), were well known to the first European colonizers. Portuguese sources, in particular, refer to them as \"Celates\" or \"Selates\". A 16th century Portuguese historian, [João de Barros](/wiki/Jo%C3%A3o_de_Barros) calls them \"low and vile\" people prone to piracy and raiding. ### Under British rule By the middle of the nineteenth century, the [British Malaya](/wiki/British_Malaya) and [Orang laut](/wiki/Orang_laut) engagement in maritime trade was abolished by the British colonial and piracy was done away with. The [Orang laut](/wiki/Orang_laut) were then forced to change their way of life. Some of them accepted [Islam](/wiki/Islam) and became part of the Malay people. While the others went on with primitive life at the expense of being seafarers and went to the outskirts of society. The Orang Seletar is believed to have originated from [Pulau Seletar](/wiki/Pulau_Seletar) and [Seletar](/wiki/Seletar), [Singapore](/wiki/Singapore). They were the natives of [Singapore](/wiki/Singapore) and among the earliest settlers on the island. The Seletar people settled among the mangroves in the northern region of the island of [Singapore](/wiki/Singapore). Formally, they remained the subjects of [Sultan of Johor](/wiki/Sultan_of_Johor), while the Malay people disregarded of such groups. The British colonial, in general, perceived them as savages; which in their way of life are more like uncivilized people. Among the mangroves in northern [Singapore](/wiki/Singapore), the founder of the city of [Singapore](/wiki/Singapore), Sir [Thomas Stamford Raffles](/wiki/Thomas_Stamford_Raffles) who visited the island in 1819 to address his affiliation with [British possessions](/wiki/British_possessions). It is estimated that at that time in [Singapore](/wiki/Singapore) there were about 200 Seletar people who lived in about 30 boats. From the once proud military sailors and the guards of the seas, they turned into an all forgotten people, over which the state and their neighbors were abusing. The European colonial powers relied more heavily on industrial development and the development of commodity to crop production. There were no place in this system for such people as the Seletar people. In the middle of the 19th century, tropical forests in the north of [Singapore](/wiki/Singapore) began to be cleared up for rubber plantations. In 1923, 600 acres of land in the district of [Seletar](/wiki/Seletar) were set aside for the construction of a military air base. Many Seletar people then moved to [Johor](/wiki/Johor). With the consent of the former Sultan [Abu Bakar of Johor](/wiki/Abu_Bakar_of_Johor) (1886-1895), they were allowed to settle along the [Pulai River](/wiki/Pulai_River) in the southwest of the country. ### Resettlement from Singapore to Malaysia In the 1950s / 60s, [Singapore](/wiki/Singapore)'s rapid economic development began. There is new development and opening of new lands. In addition, the [Singapore](/wiki/Singapore) government, which had just gained independence in 1965, expressed fears that the nomadic tribe, which freely crossed the state border, was potentially at risk of smuggling. For in this period there is a significant new migration of Seletar people on the southern coast of [Johor](/wiki/Johor), into [Malaysia](/wiki/Malaysia). The Seletar people would recall the times when many civil servants and police appeared, asking them different questions. Back then they did not have passports nor do they have citizenship, and therefore they were scared to think that they might end up getting arrested. As a result, a significant part of the Seletar people at their own will moved to [Johor](/wiki/Johor). This incident happened around 1967. In the end, the entire tribe was resettled in [Johor](/wiki/Johor) in accordance with intergovernmental agreements. All the Seletar people have become Malaysian citizens. However, by the end of 1987, they had been allowed to move freely through the [Straits of Johor](/wiki/Straits_of_Johor) unofficially without having to go through the immigration checkpoints. The attachment of the Malaysian authorities to the Seletar people, apparently, is due to their long-standing relations in the pattern of \"[patron-client](/wiki/Clientelism)\" with the [Sultan of Johor](/wiki/Sultan_of_Johor). They collected forest and mangrove products for the Sultan, performed traditional dances on Malay holidays, and they were invited to hunt with the Sultan for deer and wild boar. Therefore, they had the right to collect forest products in [Johor](/wiki/Johor) without any restrictions. In the 1970s, the Seletar people who were still living in boats began to settle on land. In the Sungai Landas on the southern coast of [Johor](/wiki/Johor), the government of [Malaysia](/wiki/Malaysia) specifically allocated plots of land for the Singaporean Seletar people. There are three Seletar villages that are on the north coast of [Singapore](/wiki/Singapore). Two of the three villages are Kampong Tanjong Irau in the area [Sembawang](/wiki/Sembawang) and Kampong Wak Sumang in [Punggol](/wiki/Punggol) east of the [Johor Causeway](/wiki/Johor_Causeway). This group of Seletar people had to leave the country in April 1986 in order to make way for further development projects. Subsequently, the remnants of Singaporean Seletar people were assimilated into a wider Malaysian community, and the main community continued its life on the other side of the [Johor River](/wiki/Johor_River). Today they have settled inland of [Peninsular Malaysia](/wiki/Peninsular_Malaysia) and have their own settlements. ### Modernity Now the Seletar people live in 9 villages along the southern coast of [Johor](/wiki/Johor), and some of these villages are pushed farther from the sea. Development has reached them at their door step. [Johor](/wiki/Johor), located on the southern tip of the [Malay Peninsula](/wiki/Malay_Peninsula), is a rapidly developing state. The development takes place throughout the state, but especially in the coastal region, due to its proximity to [Singapore](/wiki/Singapore). Southern [Johor](/wiki/Johor) joined the ambitious project of [Iskandar Malaysia](/wiki/Iskandar_Malaysia), launched in 2006. The Chinese economic zone of [Shenzhen](/wiki/Shenzhen), which is in close contact with [Hong Kong](/wiki/Hong_Kong), was taken as a model. So too, [Iskandar Malaysia](/wiki/Iskandar_Malaysia) has to interact closely with [Singapore](/wiki/Singapore). The project is one of the central places in Malaysia's Ninth Development Plan. Seven of the nine village villages are located in the [Iskandar Malaysia](/wiki/Iskandar_Malaysia) area of [Malaysia](/wiki/Malaysia). The new construction not only destroys the mangrove swamps, but is already being adjusted to the villagers' homes. People feel that such actions simply force them to flee, but they are nowhere to escape. Other developments such as land reclamation in mangrove swamp areas has affected the livelihood of the Seletar villagers in the area, thus forcing them further out into Singapore's clearer waters for fishing. The complexity of the situation is also that only two settlement villages, namely Bakar Batu in the [Johor Bahru District](/wiki/Johor_Bahru_District) and Simpang Arang in the [Gelang Patah](/wiki/Gelang_Patah) district were partially officially declared as [Orang Asli](/wiki/Orang_Asli) reserves under the Aboriginal peoples Act 1954. The rest are living on land owned by the government or private individuals. Not having the permanent status of their settlements, at any time, at any time from any village, the Seletar people can be evicted if this is required by the needs of the region's development. 188 Seletar people, whom are residents of the villages of Bakar Batu and Sungai Temun, sued the High Court of the city of [Johor Bahru](/wiki/Johor_Bahru) against 13 defendants because of the invasion of their customary lands. They claim that they have acquired rights to their customary territories from at least the 1950s and therefore consider the further alienation of their territory to be illegal and void. Residents of one of the named villages in 2012 found 10 destroyed graves, which, in their opinion, was associated with the clearance of land for construction. This fact also appears in the lawsuit. The Seletar people in court were represented by a group of lawyers from the Bar Council's Committee on Orang Asli Rights. The piquancy of the situation is that among the respondents is not only the construction companies, but also the [Iskandar Regional Development Authority](/wiki/Iskandar_Regional_Development_Authority) (IRDA), the [Department of Orang Asli Development](/wiki/Department_of_Orang_Asli_Development) (JAKOA), the federal government of [Malaysia](/wiki/Malaysia) and the [Johor](/wiki/Johor) state government. Therefore, the hearing was delayed for several years. In December 2013, the High Court of [Johor Bahru](/wiki/Johor_Bahru) decided to stop the illegal incursion of the customary territory of the Seletar people and stop all work there until the matter is resolved. On 24 June 2014, the Appeal Court dismissed two of the 13 defendants to abolish the ban. No matter how the trial ended, stopping the implementation of the [Iskandar Malaysia](/wiki/Iskandar_Malaysia) project is no longer possible. Most villages are located not far from the sea, and these areas are the most attractive for commercial construction. In addition, there is an active cleansing of mangroves, causing the sea is becoming increasingly polluted. Thus, the Seletar people lose their traditional resources, which still needed to ensured their survival. The government is trying to resolve this issue in a delicate form by offering alternative forms of employment to the Seletar people. Individuals who are not indifferent are trying to draw attention to the fate of the people, the real threat of the loss of their unique traditional knowledge. Related publications were published in the media and on the Internet. In 2011, a 20-minute documentary about the \"*Lot, Umah Am*\" , which is translated as \"Sea, my home\" , was released. It gives the opportunity to look into the little known life of the indigenous people, who for several generations called the [Straits of Johor](/wiki/Straits_of_Johor) their home. Also in 2001, in the village of Sungai Temun, supported by private sponsors, opened a Seletar Cultural Centre with its own museum exhibition, which aims to preserve cultural heritage in the hope that the younger generations will not forget the about their roots. ## Culture ### Lifestyle and traditional socioeconomics The coastal zone of the islands in the [Malay Archipelago](/wiki/Malay_Archipelago) is marked by the wealth of marine flora and fauna. Still relatively recently, thick mangrove forests covered the shores of the [Straits of Johor](/wiki/Straits_of_Johor). Traditionally, the Orang Seletar are heavily dependent on sea produce. It is on their natural resources that the traditional socioeconomic of the Seletar people is oriented. They always considered themselves part of nature and were in harmony with it. The pressure on nature was minimal, people took only what they needed for daily requirements, and this did not prevent the replenishment of natural resources. Among the mangrove jungle, the Seletar people remained virtually lost to the outside world. They wandered through the straits, a labyrinth of narrow streams, changing their location depending on the tides and season. To a large extent, they still retain this way of life nowadays, but their traditional living space has declined significantly. The Seletar people also enter in estuaries and climb up above the rivers that flow into the [Straits of Johor](/wiki/Straits_of_Johor). At the same time, they do not risk leaving into the open sea and never leave the waters of the narrow, shallow, and calm [Straits of Johor](/wiki/Straits_of_Johor). Until recently, the Seletar people lived in boats, which they called the *da'm pa'u*, or *sampan* in [Malay language](/wiki/Malay_language). Each boat was a real floating hut, designed for one family. Therefore, the boats were still called *satu kelamin*, meaning \"one married couple\". Despite the small size of the boat, all their lives took place here. In the boat, the Seletar people would prepare and yet cook food, and eat there, and also they would rest there. In the boat is where children are born and raised. Traditional Seletar boats are simple dugouts, which they had done before. This boat has a roof, called *kajang*, which functions as the role of a canvas, covered with palm leaves. When it rains, such roofing would leak. It is very difficult in such conditions and sometimes it puts out the fire for cooking. Previously, only firewood are used for burning, but now they buy kerosene. In bad weather people find themselves a safe shelter among the protected mangroves. Due to the deforestation, the Seletar people no longer have the necessary materials to build their boats. Therefore, now they buy boats, by the way, of much better quality. People use their old skills to make models of traditional boats for sale to tourists. The basis of the traditional socioeconomic of the Seletar people is the fishing of crustaceans (shrimp, crabs, etc.). In doing so, they use primitive equipment in the form of cans traps with holes, which are placed at the bottom by using iron hooks with a long wooden handle. The same primitive method was used until recently as their fishing equipment. The main instrument for fishing (more precisely, hunting) was a bamboo spear, jagged at the tip; it is called *tikam*. The important thing here is not the strength of the weapon, but the skill of the hunter in using with the spear, when he swims under water. By the way, the Seletar people can fish with their bare hands. [Handline fishing](/wiki/Handline_fishing), which is called *pancing*, are often used. Another livelihood of the Seletar people is saltwater mussel farming, most notably in Kampung Sungai Temon, near [Danga Bay](/wiki/Danga_Bay), [Johor](/wiki/Johor). Up till today, they have practiced natural livelihood, and only sometimes they would go to the shore to exchange their catches of fish for rice and other products. Previously, they practiced barter operations exclusively, but now they use money to buy more rice, and even chicken, meat, sugar, coffee and, of course, clothing and kerosene. They do not need to buy vegetables. They have their own fish, shrimp and crabs. The basis of nutrients are made up of crabs and [tapioca](/wiki/Tapioca), which they call *ubi kayu*. In addition to products, the mangroves provides a large reserves of valuable wood species. So the leaves of [Nipah palm](/wiki/Nypa_fruticans) are used for the construction of straw roofs and sugar is obtained from the juice of this plant. [Pandan leaves](/wiki/Pandanus_amaryllifolius) goes on mats and coverings for canopy. On woods goes to [Gelam](/wiki/Melaleuca_leucadendra) tree and other kind of mangroves [Rhizophora](/wiki/Rhizophora) with local names such as *kayu bakau* and *kayu rikau*. Another useful plant is *[Nibong](/wiki/Oncosperma_tigillarium)* from which fishing pins are made. They also collect various varieties of rattan. Some of these plant species are under protection, and only the Seletar people are free to collect them. Most of these products were not used by them, but were swapped from the Malaysian coastal regions for other goods. With years of depleting fish along the [Straits of Johor](/wiki/Straits_of_Johor) and [Singapore](/wiki/Straits_of_Singapore), they have become dependent on selling [Bakau](/wiki/Rhizophora) wood from the mangrove. Hence, the need for them to live a nomadic lifestyle. However, the changes in their socioeconomic have changed their way of living. There are those among them that have worked in industrial factories. Orang Seletar fisherman have also adapted modern equipment for fishing. There are even some of those that run seafood restaurants. ### Social structure The social organization and the kinship structure of the Seletar people do not reveal any signs of hierarchy. However, they must have an elder that functions as a village head called *Batin*; who is officially appointed by the authorities to represent the local community in dealing with the Malay people. Family relations within the Seletar people are [egalitarian](/wiki/Egalitarianism) and therefore by nature, they do not have a clear division of labour by gender. Man and woman are equally engaged in harvesting and fishing, and in contact with outsiders. The members of the custodial family are very devoted to each other, and they all work together. They do not go out to fish until all the members of the family come together. This is understandable, because, as a rule, three generations of the family always live together in the same boat. This situation raises some problems with the schooling of the Seletar's children, which is being implemented lately. Schoolchildren are forced to stay on the beach when their family leaves for the sea. As a way out, they use the help of their neighbours that remained behind at this time in the village. They stay close, so that they can look after the children while their family is absent. For the children, assistance to parents or grandparents in fisheries is not considered a routine, instead this is a form of recreation for them as they can then jump into the water and get out of the boat. Children aged 3 years are taught to swim, by simply throwing them into the sea. If children who are 4 years old are not yet able to swim, the mother would then feed them with fried sand shark meat; this, as they believe, should help the children to be able to learn to swim. Consequently, for Seletar children, to be able to swim is considered natural and, when they grow up, they can already swim under water without using an oxygen mask for more than ten minutes. They are able to see the fish under water and can catch it with bare hands. The Seletar people believe that seawater is rejuvenating, as opposed to freshwater. They prefer taking a bath using seawater, because they then feel more energetic, and freshwater is considered to weaken the activity of their body. ### Legends There is a legend among the Seletar people that is similar to the Biblical story of the [World Flood](/wiki/Flood_myth). The Seletar legend has it that one day, there was a long rain in [Johor](/wiki/Johor) that poured out for 40 days and 40 nights. The water level has risen up to the foothill of the [Pulai mountain](/wiki/Pulai_(federal_constituency)). In order to withstand the strong flow of water current, the Seletar people bound together all their floating huts. But, unfortunately, the rope broke off. Some of them were lost to the flood. ### Relations with neighbouring people The Seletar people have a very vague idea of the existence of other groups of sea nomads. Moreover, they do not feel affinity with them. Instead, they have a certain affinity with [Jakun people](/wiki/Jakun_people), the \"Malay natives\" of the inland areas of [Peninsular Malaysia](/wiki/Peninsular_Malaysia). They say, for example, that they and the inhabitants of the [Kluang District](/wiki/Kluang_District) understand the language of each other, and these languages have 70% of common elements, although this statement is not verified. In [Segamat District](/wiki/Segamat_District), located in the interior of [Johor](/wiki/Johor), is a sacred place called *kramat*, where the revered mythical \"queen\" or *raja peremption*, which, according to tradition, in the past were subject to the Seletar people. Another legitimate ruler whom they consider for advice, lived \"on the coast of Java\". Rulers of the [Johor Sultanate](/wiki/Johor_Sultanate) are not legitimate rulers for them, but only temporary hosts or *penumpang*. In addition, they regard the Malay people as relatively recent migrants. Therefore, Seletar people recognize themselves as part of a genuine indigenous population at the same level as the [Orang Asli](/wiki/Orang_Asli) inhabitants of the country. Because of this, they positively refer to the name \"[Orang Asli](/wiki/Orang_Asli)\", which also officially applies to them. On the other hand, the Malay people, despite their ethnic affinity, do not strongly accept the Seletar people as part of the Malay society. Here, it is not on the basis of ethnicity, but rather cultural identity. The Seletar people are not adherents of [Islam](/wiki/Islam), and it pushes them away from the Malay society. The habits of the Seletar people are also different from the Malay people. They live in boats, carry a nomadic way of life, keep dogs in boats, and eat [*haram* food](/wiki/Islamic_dietary_laws) that are forbidden. Malay people draw attention to the bad hygiene of the Seletar people, due to these factors. All these complexity fixed a stereotypical view of the Malay people towards the Seletar people, as people \"dirty\" and \"unclean\". Another misunderstanding of the Malay people in regards to the Seletar people's way of life was also attributed to the mystical superstitions of the Seletar people. They believe that sea nomads have a powerful magic that can harm other people. The stories about the Chinese and the Malay people suffered in this way are often narrated. The Seletar people, in turn, are also reluctant to [become Malay people](/wiki/Malayisation). They are afraid of losing their own culture and, most importantly, of personal freedom, and want to get hired for work. They want, like their ancestors, to be able eat pork and to do what they like. The Seletar people are exposed by the outrageous [ostracism](/wiki/Ostracism) by the Malay people. Instead, they maintain good relations with the local [Chinese people](/wiki/Malaysian_Chinese). Seletar people trust Chinese traders more than their Malay neighbours. Marriages between these two ethnic groups are not uncommon. In doing so, the [Chinese people](/wiki/Malaysian_Chinese) even become members of the Seletar community, taking on their lifestyle. The close relationship with the [Chinese people](/wiki/Malaysian_Chinese) and Seletar people is also explained by the fact that \"both of them and others eat pork\". During the [Second World War](/wiki/Second_World_War), many Chinese children were hidden by their parents among the Seletar people, and they looked after them. They rubbed the face of the little Chinese children with dirt, so that they looked like Seletar children. Now, with the help of the [Chinese people](/wiki/Malaysian_Chinese), the Seletar people, in particular, could open their own seafood restaurants. ### Changes in the lives of the Seletar people Life in the region of the [Johor](/wiki/Johor) is rapidly changing, and the lives of the Seletar people are changing. As early as the 1970s, some of them settled on land. This group grows a [cempedak](/wiki/Artocarpus_integer) and [jackfruit](/wiki/Jackfruit), as well as [yams](/wiki/Yam_(vegetable)) and [sweet potato](/wiki/Sweet_potato). They also collect [mangrove wood](/wiki/Rhizophora) for a Chinese-owned charcoal fuel company. Encouraging the transition of the Seletar people to permanent settlements, the Malaysian government set up new villages on the coast for them. Now they live in special huts for them that are built on stilts above the water. Government officials have chosen this kind of settlements, taking into account the traditional way of life of these sea nomads and the fact that these people cannot live without the sea. At least once a day, the Seletar people continue to go out into the sea, and at night they bring home everything they could get during the day. The Seletar people say that they cannot fall asleep without having not see the sky above their heads. Therefore, only some among them completely settled on the land. At the same time, the Seletar people have now adopted some new methods of fishing, with the use nets and [trolling](/wiki/Trolling_(fishing)), and also the use of motor boats. Malay people perceive such changes as the willingness of the Seletar people to \"become civilized\" (*dah tamadun*), and to learn to live like the Malay people. However, the Seletar people continue to cling to their nomadic life, which gives them a certain degree of personal freedom. For this reason, they do not want to enter into a structured society, their children have problems with attending school, and the adults bogged with religious practices. Civilization is rapidly and steadily advancing onto the traditional life of the Seletar people, and they are unable to stop this oncoming. In order to survive in the context of urbanisation and social change, they must master new skills and new means of generating income. The best way to help them adapt and live a normal life would be to implement programmes and projects that would use the existing knowledge and traditions of the people in favour of the community, without moving them to other regions. While all this is only at the level of ideas, the Seletar people remained as one of the poorest peoples in [Malaysia](/wiki/Malaysia). A possible way out of poverty for them may be in the restaurant and tourism business. Already, the Sungai Temun village has several seafood restaurants. The largest group of their clients is the local [Chinese people](/wiki/Malaysian_Chinese), and dishes are also cooked according to Chinese style cuisine. Very few of the Seletar people have advanced far more in education. It happens when their children in schools are often mocked because of their prominent appearance and accent. Many Seletar children do not finish school. As a result, without proper education, young people can not get decent work, and this condemns them to a difficult life as the outcast of Malaysian society. Losing their traditional natural resources, the Seletar people also lose their identity and skills acquired for centuries that are not transferred to the new generation. As a result, the question arises concerning the loss of the people's own national identity. Realizing the situation, the Seletar people created the Seletar Tourism and Cultural Society, which aims to preserve aspects of their traditional culture and the creation of alternative sources of livelihood. With researchers of the Malaysian Society of Marine Science (MSMS), the local [Chinese people](/wiki/Malaysian_Chinese) who fell in love with these people and their way of life in the Sungai Temun village, opened the Seletar Cultural Center. The centre occupies an area of 232 m2. The project was funded by the Global Environment Facility. Among them are the exhibition of old black and white photographs made by English photographer, [Dr. Ivan Polunin](/wiki/Ivan_Polunin), archival documents and maps that tell about the history of the Seletar people, the model of their traditional boats and types of hunting instruments used in this tribal community. The Seletar Cultural Center has its own page on Facebook. - Malaysia portal\n",
  "language": "en",
  "processed_at": "2026-01-12T11:40:18.701396",
  "title": "Orang Seletar",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Orang_Seletar"
}