{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:40:31.452017"
  },
  "content": "Historic site **Orchard Road Market**, also known as **Tang Leng Pa Sat** and **Tanglin Pa Sat**, was a [market](/wiki/Marketplace) on [Orchard Road](/wiki/Orchard_Road) in Singapore. Built in 1891, the market was demolished in 1982 to make way for redevelopments along Orchard Road. ## History The market was built in 1891 as a replacement of the Orchard Road Municipal Market, originally known as Koek's Market after its original owner, lawyer Edwin Koek, which was found to be inadequate. The new market only had one [wing](/wiki/Wing_(building)). In 1902, a six-metre-tall cast-iron fountain made in [Glasgow](/wiki/Glasgow) was placed in the market. An expansion was made to the market in 1910, adding another wing and a concrete frontage. The structure was raised a few years later due to frequent flooding. A second building was constructed in 1930, costing $25,000. In 1948, members of the [Municipal Commission of Singapore](/wiki/Municipal_Commission_of_Singapore) began contemplating adding a second floor to the market, as the market was too small to serve the increasing population of the district. In September 1950, a proposal for the rebuilding of the market into a two-storey building, which would cost $250,000, was rejected on the grounds that it was not an urgent requirement. Instead, essential repairs were made to the market, costing $5,000. An $18,000 expansion was made to the fish section of the market in 1954. In 1978, the market was earmarked for redevelopment by the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority), with the market's hawkers being relocated to the then newly built Cuppage Centre. The market was demolished in 1979 and was replaced by [Orchard Point](/wiki/Orchard_Point). The former site of the market has been included in the Orchard Heritage Trail by the [National Heritage Board](/wiki/National_Heritage_Board_(Singapore)). This article about a Singapore building or structure is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:40:31.451611",
  "title": "Orchard Road Market",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Orchard_Road_Market"
}