{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:40:24.528798"
  },
  "content": "Public library in Singapore **Orchard Library** ([Chinese](/wiki/Simplified_Chinese): 乌节图书馆) is a [public library](/wiki/Public_library) under the [National Library Board](/wiki/National_Library_Board) (NLB) of Singapore. Initially located on level 5 of [Ngee Ann City](/wiki/Ngee_Ann_City) on [Orchard Road](/wiki/Orchard_Road) in the [Central Area](/wiki/Central_Area,_Singapore) of Singapore, Orchard Library was opened by [Lee Yock Suan](/wiki/Lee_Yock_Suan), [Minister for Information and the Arts](/wiki/Ministry_of_Information,_Communications_and_the_Arts_(Singapore)) on 21 October 1999. It closed on 30 November 2007 after its lease at Ngee Ann City was not renewed. It reopened on 23 October 2014 at a new location on levels 3 and 4 of [Orchard Gateway](/wiki/Orchard_Gateway) on [Orchard Road](/wiki/Orchard_Road) by [Yaacob Ibrahim](/wiki/Yaacob_Ibrahim), Minister for Communications and Information, next to [Somerset MRT station](/wiki/Somerset_MRT_station). ## History ### Establishment In April 1999, the [National Library Board](/wiki/National_Library_Board) (NLB) announced that it will be opening a 1,500 square metres (1,800 sq yd) library at the fifth floor of [Ngee Ann City](/wiki/Ngee_Ann_City), which was used as a carpark at the time, in August. According to an NLB representative, the library was conceptualised for 18–30 year olds as the NLB found out that visitorship to its libraries decreased due to students graduating from secondary school. However, there was speculation from *[The Straits Times](/wiki/The_Straits_Times)* that the library would have to compete against [Kinokuniya](/wiki/Books_Kinokuniya), which was also opening an outlet below the library in August. Although Kinokuniya was unaware of the NLB's interests, the managing director of the Ngee Ann City branch believed that the library would \"complement\" the book store, adding that \"the library's function is to promote reading habits. But we are there for book lovers who aspire to build their own libraries at home\". An NLB representative also agreed, believing that \"both [Kinokuniya and the library] to be complementary, not competitors\". Created as a [boutique](/wiki/Boutique) library, library@orchard, together with [library@esplanade](/wiki/Library@esplanade), was used as a test bed for NLB to introduce new services and products which could then be adapted for future projects. The library's location within the [Orchard Road](/wiki/Orchard_Road) shopping belt was intended to attract the [youth](/wiki/Youth) segment of the population.[*citation needed*] library@orchard was created based on feedback in the National Reading Survey. Initially, the NLB had concerns about setting up a library that catered only to young adults as they were used to libraries that served everyone—from children to [senior citizens](/wiki/Senior_citizens). However, this uncertainty was assuaged after NLB's development team discussed the concept with focus groups made up of its target customers—[young adults](/wiki/Adolescence).[*citation needed*] library@orchard became popular with young adults. Its success paved the way for more innovations, such as the *music@orchard* series of programmes that saw [rap](/wiki/Hip_hop_music) artistes and rock bands entertaining huge crowds. Another innovation was *comics@orchard* where [comics](/wiki/Comics) went on loan in Singapore's public libraries for the first time. At its peak, the library had 120,000 items, with more than 33% of its total collection comprising English language novels. With an appealing ambiance, and the presence of music booths and a café, library@orchard managed to double its outreach since its establishment, with an average of more than 1.4 million visitors per year. The success of the first niche library developed for a specific audience led NLB to set up Singapore's first public [performing arts](/wiki/Performing_arts) library—the library@esplanade at [Esplanade - Theatres on the Bay](/wiki/Esplanade_-_Theatres_on_the_Bay). ### Closure and relocation On 25 July 2007, the National Library Board announced that library@orchard will be closed on 30 November that year because the [lease](/wiki/Lease) on the premises at Ngee Ann City would not be renewed. It was subsequently closed on that date. [Macquarie](/wiki/Macquarie_Bank) Pacific Star Prime Reit Management, which handled the library's lease, stated that the board paid [rent](/wiki/Renting) that was below prevailing [market](/wiki/Market_(economics)) rates for the 1,580 square metre (17,000 square feet) space. NLB was told in March 2005 that the lease would not be renewed beyond expiry in February 2008. The vacated space would house fashion, beauty and [wellness](/wiki/Wellness_(alternative_medicine)) retailers. Rents in the Orchard Road shopping belt had increased 5–7% in the first half of 2007, and was estimated to go up by another 5–6% by end of that year. To mark the relocation of library@orchard, NLB held a series of public events and programmes, such as [exhibitions](/wiki/Art_exhibition), film screenings, talks and even \"[live](/wiki/Live_music)\" performances by local bands and musicians, in the months leading to the closure. A \"Moving On\" party was then held on the closure date. ### Re-opening The library@orchard re-opened on 23 October 2014 at [Orchard Gateway](/wiki/Orchard_Gateway), a new shopping mall built at the site of the old [Specialists' Shopping Centre](/wiki/Specialists%27_Shopping_Centre). The new library is slightly bigger than its predecessor at 1,700 square metres and spans two floors of the mall, described as The Studio and The Loft. 45% of the 100,000 item collection focuses on design and the NLB worked with students and lecturers from [Singapore Polytechnic](/wiki/Singapore_Polytechnic) to develop ideas for the branch, focused as it is on young adults. ## Notes - \"Sip coffee and borrow a book at Ngee Ann City\", *[The Straits Times](/wiki/The_Straits_Times)*, 6 April 1999 - \"Evolution of the boutique library\". *\"Challenge\", Prime Minister's Office (Singapore)*. Archived from the original on 29 September 2007. Retrieved 25 July 2007. - National Library Board - library@orchard blog - Media Conference on the Relocation of library@orchard\n",
  "language": "en",
  "processed_at": "2026-01-12T11:40:24.528371",
  "title": "Orchard Library",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Orchard_Library"
}