{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:40:28.383562"
  },
  "content": "Planning Area in Central Region, Central Area, SingaporeThis article **contains promotional content**. Please help improve it by removing promotional language and inappropriate external links, and by adding encyclopedic text written from a neutral point of view. *(September 2023)* *(Learn how and when to remove this message)*Planning Area in Central Region, Singapore **Orchard Road**, often known colloquially as simply **Orchard**, is a major 2.5 km (1.6 mi)-long road in the [Central Area](/wiki/Central_Area,_Singapore) of [Singapore](/wiki/Singapore). A famous [tourist attraction](/wiki/Tourist_attraction), it is an upscale shopping area, with numerous [department stores](/wiki/Department_store), [shopping malls](/wiki/Shopping_mall), [restaurants](/wiki/Restaurant), and [coffeehouses](/wiki/Coffeehouse) located in its vicinity. It has been described as a popular hotspot in Singapore, especially at night, attracting urban youth. The **Orchard Planning Area** is a [planning area](/wiki/Planning_Areas_of_Singapore) as specified by the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority). It is part of the Central Area located within the [Central Region](/wiki/Central_Region,_Singapore). Orchard is bordered by [Newton](/wiki/Newton,_Singapore) in the east and north, [Tanglin](/wiki/Tanglin) in the west, [River Valley](/wiki/River_Valley,_Singapore) in the south and [Museum](/wiki/Museum_Planning_Area) to the southeast. It consists of three subzones, Orchard, Somerset and Tanglin (not to be confused with its neighbouring planning area). ## Toponymy Orchard Road got its name from the [nutmeg](/wiki/Nutmeg), [pepper](/wiki/Black_pepper), and [fruit orchards](/wiki/Orchard) or [plantations](/wiki/Plantation) that the road once led to. Such plantations were common in the area in the 19th century. Previously, it was known in [Hokkien](/wiki/Hokkien) as \"Tang Leng Pa Sat Koi\" ([simplified Chinese](/wiki/Simplified_Chinese_characters): 东陵巴刹街; [traditional Chinese](/wiki/Traditional_Chinese_characters): 東陵巴剎街; [Pe̍h-ōe-jī](/wiki/Pe%CC%8Dh-%C5%8De-j%C4%AB): *Tang-lêng Pa-sat-koe*; lit. '[Tanglin](/wiki/Tanglin) Market Street'), and in Tamil, it was known as \"Vairakimadam\" (Tamil: வயிராகி மடம், romanized: *Vayirāki maṭam*, lit. 'Fakir's place') inside town limits and \"Māttu Than\" (மேட்டு தான், *Mēṭṭu tāṉ*, 'High Ground') from Koek's Market to Upper Tanglin. ## Geography After more than a century as a two-way thoroughfare, Orchard Road became a one-way street east of [Scotts Road](/wiki/Scotts_Road) in 1974. and entirely in 1977 when Orchard Boulevard was completed. Orchard Road starts at the junction with Orange Grove Road, which is the location of the Orchard Hotel. It then stretches southeast across the Scotts Road–Paterson Hill junction, [Orchard MRT station](/wiki/Orchard_MRT_station), Bideford Road, [Somerset MRT station](/wiki/Somerset_MRT_station), [Central Expressway](/wiki/Central_Expressway_(Singapore)), [Dhoby Ghaut MRT station](/wiki/Dhoby_Ghaut_MRT_station), and ends at the junction with Handy Road (just before Prinsep Street), where it becomes [Bras Basah Road](/wiki/Bras_Basah_Road). It has extensive underground infrastructure, including underground pedestrian walkways between the malls running underneath the street and other streets in the vicinity. The numbers begin at Handy Road and end at Orange Grove Road. ## History ### British administration Orchard Road was already cut in the 1830s, though the new road was not named in [George Coleman](/wiki/George_Drumgoole_Coleman)'s 1836 *Map of Singapore*. In the 1830s the Orchard Road area was the scene of [gambier](/wiki/Uncaria) and pepper plantations. Later, nutmeg plantations and fruit orchards predominated, hence its name. By 1846, the spread of houses had reached up to Tank Road. There were none on the left side and only three or four houses went past Tank Road on the right side of Orchard Road. One major sight during this period was a Dr. Jun tending his garden, which helped endorse the road's name. He had a garden and plantation at the corner of what is now Scotts Road and Orchard Road. Towards the later part of the 1840s, graveyards began to appear along the road. By 1846, the Chinese had a large graveyard around what is now the [Hilton Singapore Orchard](/wiki/Hilton_Singapore_Orchard) and Ngee Ann City, while the [Sumatrans](/wiki/Sumatra) from [Bencoolen](/wiki/Bencoolen_(city)) had their burial ground where the current Hotel Grand Central stands. Later a [Jewish](/wiki/Jewish) cemetery was established; it was located where Dhoby Ghaut MRT station is now and was demolished in 1984. In the 1860s, Orchard Road had a great number of private houses and [bungalows](/wiki/Bungalow) on hills looking down through the valley where the road passed through. Early in the 1890s, [King Chulalongkorn](/wiki/King_Chulalongkorn), the then [King of Siam](/wiki/King_of_Siam), acquired \"Hurricane House\" in the vicinity of Orchard Road through [Tan Kim Ching](/wiki/Tan_Kim_Ching), the Thai Consul in Singapore. Two further pieces of adjoining property fronting onto Orchard Road were purchased in 1897. These subsequently became the site of the Royal Thai Embassy at 370 Orchard Road. Hurricane House was sold off around 1909 shortly before the King's death. In the early 20th century, it was noted that Orchard Road \"present[ed] the appearance of a well-shaded avenue to English mansion[s],\" comparable in its \"quiet but effective beauty to [Devonshire](/wiki/Devon) lanes.\" In the 1960s, a group of Indonesian forces [bombed](/wiki/MacDonald_House_bombing) the [MacDonald House](/wiki/MacDonald_House) in Singapore, just a few months before Singapore got its independence from Malaysia. A number of people were killed and the police managed to execute the two military officers responsible for this. ### Smoking ban Orchard Road was initially designated to be completely smoke-free with the exception of designated smoking areas by 1 July 2018. However, the implementation was pushed back to 31 December 2018, as businesses will need more time to identify appropriate locations and set up designated areas for smoking, according to the [National Environment Agency](/wiki/National_Environment_Agency) (NEA). Food establishments that currently have smoking corners within the no-smoking zones will also be given the same extension to remove them. As of 2018, around 40 designated smoking areas have been set up, including five public ones at Orchard Towers, Far East Plaza, The Heeren, Cuppage Terrace, and behind Somerset MRT station. Since its announcement, NEA has said that the majority of stakeholders have been supportive of this initiative. As of 1 January 2019, Orchard Road was officially declared as a strictly smoke-free zone except within the designated smoking areas. ## Notable past and present landmarks At Orchard Road's eastern end is the official residence and office of the [President of Singapore](/wiki/President_of_Singapore), the [Istana](/wiki/Istana_Singapore), marked with Nibong [palms](/wiki/Palm_tree) and a [plaque](/wiki/Commemorative_plaque) that reads, \"As the nibong is a [mangrove](/wiki/Mangrove) palm, this site must have once been a [mangrove swamp](/wiki/Mangrove_swamp).\"[*citation needed*] On the western side of Orchard Road is the [Singapore Botanic Gardens](/wiki/Singapore_Botanic_Gardens), the only tropical garden in the world that is a [UNESCO World Heritage Site](/wiki/World_Heritage_Site).[*citation needed*] About halfway down Orchard Road are Cairnhill and [Emerald Hill](/wiki/Emerald_Hill,_Singapore), which are mainly private residential areas. Next to Emerald Hill is [Centrepoint](/wiki/Centrepoint_Shopping_Centre), which houses the supermarket [Cold Storage](/wiki/Dairy_Farm_International_Holdings_Limited), the oldest surviving business establishment in the area. [Amber Mansions](/wiki/Amber_Mansions), one of the earliest apartment blocks in Singapore, which was built around the turn of the 20th century, was torn down in the 1980s to make way for the Dhoby Ghaut MRT station.[*citation needed*] [Specialists' Shopping Centre](/wiki/Specialists%27_Shopping_Centre) was one of the earliest redevelopment projects on Orchard Road. It occupied the site of the former Pavilion Cinema, which was demolished in 1979. Specialists' Shopping Centre was itself demolished in 2007 to make way for new development, called [Orchard Gateway](/wiki/Orchard_Gateway).[*citation needed*] Elsewhere just off Orchard Road is Scotts Road. [Scotts Shopping Centre](/wiki/Scotts_Shopping_Centre) housed Singapore's first [food court](/wiki/Food_court), which sat below the Ascott Singapore. It was torn down in June 2007 to make way for Scotts Square.[*citation needed*] ## Shopping The first shop of note on Orchard Road was [Tangs](/wiki/Tangs) founded in 1934 and established on Orchard Road in the 1950s. Shopping malls in the area include [ION Orchard](/wiki/ION_Orchard), [Wisma Atria](/wiki/Wisma_Atria), [Ngee Ann City](/wiki/Ngee_Ann_City), [Orchard Central](/wiki/Orchard_Central), Orchard Gateway, 313 @ Somerset, Orchard Plaza, [Plaza Singapura](/wiki/Plaza_Singapura), [The Centrepoint](/wiki/The_Centrepoint), The Heeren, Mandarin Gallery, Cathay Cineleisure Orchard, [Wheelock Place](/wiki/Wheelock_Place), [Liat Towers](/wiki/Liat_Towers), Shaw House and Scotts Square. ## Transport ### Public transport #### Trains There are four major [MRT](/wiki/Mass_Rapid_Transit_(Singapore)) stations in the Orchard Road vicinity: Orchard, [Orchard Boulevard](/wiki/Orchard_Boulevard_MRT_station), Somerset and Dhoby Ghaut MRT stations. These stations are important hubs for commuters, locals, students and tourists who travel to the shopping and business district of Orchard.[*citation needed*] #### Buses Bus services provided by [SBS Transit](/wiki/SBS_Transit), [SMRT Buses](/wiki/SMRT_Buses), [Tower Transit Singapore](/wiki/Tower_Transit_Singapore) and [Go-Ahead Singapore](/wiki/Go-Ahead_Singapore) provide access to Orchard Road. Bus stops are staggered to avoid causing congestion, with the scheme being implemented on 13 May 2004 (1st Phase, Mandarin Orchard Singapore) and 28 May 2004 (2nd Phase, Midpoint Orchard). A bus lane was introduced in 2005, operational from 7.30 am to 8 pm, Monday to Saturday. It was extended to 24 hours in 2016. Westbound passengers can board their buses at Penang Road (Dhoby Ghaut Station), Somerset Road (Somerset Station), Orchard Turn (opp Ngee Ann City/Takashimaya), Orchard Turn (Orchard Station), Orchard Boulevard (opp Orchard Station) and Orchard Boulevard (Wheelock Place).[*citation needed*] #### Taxi Orchard Road has numerous [taxi](/wiki/Taxicab) stands, which are mostly found at shopping centres and hotels. It is prohibited to hail taxis at locations other than these official stands.[*citation needed*] ### Vehicular access Those driving into Orchard Road may enter from the west via Tanglin Road. Vehicles from [Bukit Timah Road](/wiki/Bukit_Timah_Road) or Newton Road that travel via Scotts Road can turn left into Orchard Road at the Marriott Hotel junction. Vehicles coming from the opposite direction on Paterson Road can enter Orchard Road by turning right. There are also a number of other roads leading into Orchard Road. Orchard Road is one-way heading south and leads into Bras Basah Road which is a one-way street heading south.[*citation needed*] ## Politics Since the [2011 general election](/wiki/2011_Singaporean_general_election), Orchard Road has been under the [Tanjong Pagar GRC](/wiki/Tanjong_Pagar_Group_Representation_Constituency). The area has been represented by various MPs, and since 2020 has been represented by [Alvin Tan](/wiki/Alvin_Tan_(politician)) of the [People's Action Party](/wiki/People%27s_Action_Party).[*citation needed*] - [List of upscale shopping districts](/wiki/List_of_upscale_shopping_districts) - [Anlene Orchard Mile](/wiki/Anlene_Orchard_Mile) ## Sources - National Heritage Board (2002), *Singapore's 100 Historic Places*, Archipelago Press, [ISBN](/wiki/ISBN_(identifier)) 981-4068-23-3 - RedDot Publishing Inc (2005), *The Official Map of Singapore*, RedDot Publishing Inc. - Thulaja, Naidu Ratnala (22 May 2002), *Amber Mansions*, Singapore Infopedia, archived from the original on 26 October 2009, retrieved 28 July 2009 - 100mm of rain fell within 3 hours, causing floods, https://web.archive.org/web/20100619102022/http://news.xin.msn.com/en/singapore/article.aspx?cp-documentid=4153228 - Evolution of a Retail Streetscape: DP Architects on Orchard Road (2012), Images Publishing, [ISBN](/wiki/ISBN_(identifier)) 1-86470-462-4, Google Books - The Straits Times | Who's Who of Orchard Road, http://graphics.straitstimes.com/STI/STIMEDIA/Interactives/2015/07/who-owns-orchard-road/index.html **KML file** (edit • help)Template:Attached KML/Orchard RoadKML is from Wikidata\n",
  "language": "en",
  "processed_at": "2026-01-12T11:40:28.383135",
  "title": "Orchard Road",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Orchard_Road"
}