{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:40:38.428202"
  },
  "content": "Statute of the Parliament of SingaporeThis article **possibly contains original research**. Please improve it by verifying the claims made and adding inline citations. Statements consisting only of original research should be removed. *(March 2016)* *(Learn how and when to remove this message)* The **Organised Crime Act 2015** is a [statute](/wiki/Statute) of the [Parliament of Singapore](/wiki/Parliament_of_Singapore) that empowers the law enforcement authorities to detect, investigate, prevent and disrupt organised criminal activities, and to deprive persons involved in such activities of the benefits of their crime, as well as to make consequential and related amendments to certain other Acts. The law is designed specifically to grant the [Government of Singapore](/wiki/Government_of_Singapore) more empowerment in fighting crime especially against masterminds who instruct and intimate others into criminal acts. ## Overview An Organised Crime Group (OCG) is defined in Singapore as three or more people involved in serious crimes, such as [drug trafficking](/wiki/Drug_trafficking) and [money laundering](/wiki/Money_laundering) with the aim of material or financial benefit. The Organised Crime Act further empowers the [Government of Singapore](/wiki/Government_of_Singapore) in fighting crime. With the new law: - Civil Confiscation: The [public prosecutor](/wiki/Public_prosecutor) may apply to the High Court for confiscation of material gains from activities of OCGs even without a criminal conviction. If the public prosecutor is capable of demonstrating that the crime most probably took place, the courts can confiscate the ill-gotten benefits before sentencing. - Preventive Orders: The public prosecutor would also be able to apply for the following three preventive orders: 1. Organised Crime Prevention Order, allows the court to restrict the activities and electronically monitor the movements of a suspect over a period of five years. This order can be issued without the suspect being found guilty. 2. Financial Reporting Order, requires suspect to furnish the authorities with financial reports, which can last throughout his term of imprisonment with an additional of five years. This order can be issued without the suspect being found guilty. 3. Disqualification Order, bars the accused from acting as a director of a company after being found guilty. ## Uses of the Act This section **needs expansion**. You can help by expanding it. *(February 2016)* While crime situation in Singapore remains under control, the new law offers law enforcers an extra advantage especially against masterminds who instruct and intimate others into criminal acts. Becoming a member or recruiting members to join an OCG is also now a punishable offence. For example, in 2020, eight persons were arrested due to their suspected involvement with criminal syndicates, and charged under the Organised Crime Act in 2023, among others. - [S. Iswaran](/wiki/S._Iswaran) - Organised Crime Bill Archived 2016-03-14 at the [Wayback Machine](/wiki/Wayback_Machine)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:40:38.427833",
  "title": "Organised Crime Act 2015",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Organised_Crime_Act_2015"
}