{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:40:38.555594"
  },
  "content": "1994 murder of a Japanese tourist in Singapore The **Oriental Hotel murder** occurred on 6 June 1994, when two [Japanese](/wiki/Japanese_people) tourists were robbed and attacked by two men in their shared room in the Oriental Hotel in [Singapore](/wiki/Singapore). One of them was brutally assaulted and died, while the other survived. The case, known as the **Oriental Hotel murder**, was classified as [murder](/wiki/Murder) by the police. The perpetrators were eventually caught two years later and they were subsequently sentenced to serve lengthy jail terms with caning for their part in the robbery and assault of the two tourists, as well as for unrelated offences committed before their arrests. ## Murder On 6 June 1994, two men – 25-year-old **Abdul Nasir bin Amer Hamsah** and 32-year-old **Abdul Rahman bin Arshad** (alias Azman) – barged into the room shared by two Japanese tourists, Isae Fujii (滕井 勇惠, *Fujii Isae*), 49, and Miyoko Takishita (泷下 美代子, *Takishita Miyoko*), 56. Earlier on that day itself, the two men, who were acquaintances, went to the Oriental Hotel for a job interview when they both spotted the Japanese tour group which both Fujii and Takishita were with. Seeing this, the two men, who were short of money, decided to rob the Japanese tourists, who were workers and cleaners going on a holiday trip sponsored by their company. The two men then followed the tour group who went to check in their own rooms and later targeted both Fujii and Takishita after they were the only ones left in the corridor. Once the women opened their hotel room doors, both men emerged from behind and began to rob and assault the two women; Takishita was assaulted by Abdul Rahman and she pretended to faint to escape further injury. When Abdul Nasir attempted to escape after severely assaulting and robbing Fujii, he lost his balance and accidentally stepped onto Fujii's face as he held onto the wall to try to steady himself (which left behind a bloodstained [palm print](/wiki/Palm_print)), causing a facial fracture which obstructed her breathing and caused her death. The men managed to get a [Seiko](/wiki/Seiko) watch worth 70,000 yen (then [S$](/wiki/S$)1,000), a camera, a [Japanese passport](/wiki/Japanese_passport) and 65,000 [yen](/wiki/Yen) in cash (then S$950). They later converted the Japanese yen and divided the loot between themselves. Police were contacted and the case was assigned to prominent detective [Richard Lim Beng Gee](/wiki/Richard_Lim_Beng_Gee). The police also managed to extract [fingerprints](/wiki/Fingerprint) from the bloodstained palm print left behind by Abdul Nasir on the wall, but they could not trace any matching fingerprints from their database (since at that time, only the convicted criminals' fingerprints were recorded in the database). The police also managed to get a description from Takishita that her two attackers were racially of either [Malay](/wiki/Malay_people) or [Tamil](/wiki/Tamil_people) descent (both Abdul Nasir and Abdul Rahman were Malay). Takishita returned to Japan the next day with her tour group (she would return to Singapore two years later to testify against one of her attackers in the court). Despite the appeals for witnesses and information with offers of rewards and a police sketch of the robbers being published on newspapers, the case went unsolved for the next 18 months. ## Arrests and trials ### Arrests of Abdul Nasir and Abdul Rahman On 25 January 1996, Abdul Nasir was arrested for attempting to rob and murder a taxi driver, and while he was undergoing investigations for this particular case, Abdul Nasir's fingerprints were taken and found to match those found in Fujii and Takishita's room. Abdul Nasir later confessed that he was involved in the robbery, and named Abdul Rahman as his accomplice. Abdul Rahman was later found to be in prison serving a 20-month jail sentence for theft. Both men – Abdul Nasir and Abdul Rahman – were charged with murder on 30 January and 31 January 1996 respectively. The crime of murder was considered a capital offence at that time under Singapore law, which warrants the [mandatory death penalty](/wiki/Mandatory_death_penalty). While Abdul Nasir was in remand pending trial for murdering Fujii, a 17-year-old teenager who assisted Abdul Nasir in the taxi robbery case was jailed for two years and received six strokes of the cane for one count of attempted robbery. ### Fate of Abdul Rahman However, when further investigations revealed that it was solely Abdul Nasir who assaulted and killed Fujii, Abdul Rahman's charge was promptly reduced to one of robbery with hurt, and he pleaded guilty. On 6 June 1996, exactly two years after the incident, Abdul Rahman was sentenced by [Judicial Commissioner](/wiki/Judicial_commissioner) (JC) Amarjeet Singh to 10 years' imprisonment with 16 strokes of the cane. It can be confirmed that since June 2006, Abdul Rahman is out of prison after serving his sentence. The reduction of Abdul Rahman's charge left Abdul Nasir the sole person to face trial for murder. ### Abdul Nasir's trial The trial of Abdul Nasir started on 24 June 1996. The trial received considerable media coverage on the Japanese news, as well as in the news of Singapore, as Japan was very upset about the incident. At the murder trial, the prosecution, led by Deputy Public Prosecutor (DPP) Francis Tseng, argued that Abdul Nasir had intentionally stamped onto the face of Fujii Isae to prevent her from being able to recognise him, and the bloodstained palm print on the wall was due to him balancing himself in order to stamp on the feet. They relied squarely on forensic evidence and Abdul Nasir's police statements (in which he said he stamped his feet) to prove its case, which was in contrast to Abdul Nasir's defence that he accidentally stepped onto Fujii's face. Abdul Nasir's lawyer [Subhas Anandan](/wiki/Subhas_Anandan) extensively cross-examined the police interpreter who recorded the statements; the female police interpreter admitted on the stand that Abdul Nasir did not say the word \"stamp\", and instead he said the word \"step\", but she wrote stamp because Abdul Nasir demonstrated to his police interrogators a stamping action. According to Mr Subhas in his memoir *The Best I Could*, he wrote that the interpreter conceded that it was not her business to interpret the actions but to interpret what a person said. ### Abdul Nasir's final sentence At the end of Abdul Nasir's murder trial on 4 July 1996, the presiding judge, Judicial Commissioner (JC) [Choo Han Teck](/wiki/Choo_Han_Teck) accepted Abdul Nasir's defence that he accidentally stepped onto Fujii's face while he rejected the prosecution's argument that Abdul Nasir intentionally stamped onto Fujii's face to kill her; he cited in his judgement that the physically big-sized Abdul Nasir's height of 1.8 m and weight of 76 kg, compared to Fujii Isae's height of 1.5 m and weight of 51 kg, made it possible for an accidental step being the causation of the injuries on the victim's face. JC Choo also said that the prosecution's case was also not strong enough to prove the charge of murder beyond a reasonable doubt. For this, Abdul Nasir was [acquitted](/wiki/Acquitted) of murder, and he was instead convicted of the other charge of robbery with hurt. Consequently, Abdul Nasir was sentenced to 18 years' imprisonment and 18 strokes of the cane. According to Abdul Nasir's lawyer, Abdul Nasir's family, including his two sisters were grateful to him for helping Abdul Nasir escape the murder charge, and Abdul Nasir was also relieved that he would not be hanged after all. Later, the prosecution appealed against Abdul Nasir's acquittal, in which the appeal was heard before three judges of Appeal: Justice M. Karthigesu, Justice Goh Joon Seng and Justice Thean Lip Ping (also known as L P Thean). However, by a split decision of 2–1, the Court of Appeal dismissed the appeal based on the majority decision in October 1996, with two judges – Justice Karthigesu and Justice Goh – upholding the decision of the High Court while Justice Thean dissented. This marked the first time a split decision was made in an appeal regarding a murder case in the Court of Appeal. ## Aftermath ### Abdul Nasir's kidnapping trial and landmark appeal The conclusion of the murder trial did not mark an end to Abdul Nasir's ordeal, as he had to go back to court to face a kidnapping charge, which he committed during the time of his remand. On 3 February 1996, Abdul Nasir, together with his cellmate and drug trafficker Low Theng Gee (who was later executed on 7 July 1997 for drug trafficking) briefly kidnapped two police officers for a ransom of a car, two guns, money and eight bullets before being subdued by the police reinforcements. Under Singapore law, kidnapping (with the intent of ransoming the victim) carries a sentence of either [life imprisonment](/wiki/Life_imprisonment_in_Singapore) or [death](/wiki/Capital_punishment_in_Singapore) (the offender would also be liable for caning if he was not sentenced to death). Once again, Abdul Nasir engaged his original lawyer Subhas Anandan for his defence. Abdul Nasir stood trial alone, as by the time he was convicted in the Oriental Hotel case, the co-perpetrator, Low Theng Gee had been sentenced and incarcerated on death row for his drug trafficking offence. In his memoir, Anandan revealed that there were initially two more prisoners, who were being remanded for illegal possession of firearms, joining in to help Abdul Nasir and his accomplice to kidnap the police officers but they later backed out at the last moment. Anandan would, coincidentally, represent one of them in an unrelated case. Abdul Nasir was found guilty of kidnapping on 3 March 1997. On the same day of Abdul Nasir's conviction itself, and despite the urgings of the prosecution to sentence Abdul Nasir to death, High Court judge [T. S. Sinnathuray](/wiki/T._S._Sinnathuray) sentenced Abdul Nasir to [life imprisonment](/wiki/Life_imprisonment_in_Singapore) and [12 strokes of the cane](/wiki/Caning_in_Singapore), given the fact that it was Low Theng Gee who masterminded the kidnapping plot and took it upon himself to demand a ransom, and that Abdul Nasir neither harmed nor threatened the lives of the hostages. However, Justice Sinnathuray ordered that the life sentence should run consecutively with the 18-year imprisonment sentence which Abdul Nasir received for robbing Fujii, for a total of 38 years' imprisonment. At that time, life imprisonment in Singapore was defined as a jail term of 20 years, with a one-third remission for good behaviour. In his judgement (which was referred to by the Court of Appeal), Justice Sinnathuray stated that Abdul Nasir had committed two serious offences, one of which was why he was initially remanded and that he committed the other offence while trying to make his escape from his cell. Sinnathuray J also stated that since the kidnapping charge was a separate and distinct offence from the first Abdul Nasir had committed at Oriental Hotel with Abdul Rahman, Sinnathuray J decided that Abdul Nasir would only begin to serve his sentence of life imprisonment when he finished the sentence of 18 years for the Oriental Hotel murder case. Despite the advice of his lawyer [Subhas Anandan](/wiki/Subhas_Anandan) not to appeal, Abdul Nasir took upon himself to file an appeal for the two jail terms to run concurrently and argued the appeal on his own. The Court of Appeal dismissed his appeal on 20 August 1997. [Chief Justice](/wiki/Chief_Justice_of_Singapore) [Yong Pung How](/wiki/Yong_Pung_How), who led the three-judge panel (also included M Karthigesu and L P Thean) in the appellate court, decided that life imprisonment would no longer be considered as a jail term of 20 years, with a one third remission for good behaviour but as a term of incarceration for the remainder of a convicted prisoner's natural life, with the possibility of parole only after serving at least 20 years. Yong CJ ruled that this amendment would only apply to future cases **after** 20 August 1997 and thus Abdul Nasir's life sentence would not be affected. Regarding his second sentence, the three-judge panel held that due to the lack of any significant mitigating factors in Abdul Nasir's case, Justice Sinnathuray (who would retire from the Bench a month later on 23 September 1997) had not erred in sentencing Abdul Nasir to serve his sentences consecutively. The Court of Appeal further held that, due to the grievous nature of the crimes, a concurrent sentence would not be sufficiently deterrent to other would-be perpetrators. As, according to his current sentence, Abdul Nasir would only serve the maximum 20 years for his life sentence, the Court of Appeal held that it would be not be manifestly excessive for Abdul Nasir to serve his next term of 18 years. However, were Abdul Nasir to have been sentenced to the life sentence under the newer definition i.e. for the rest of his natural life, the Court of Appeal opined that it would have been more appropriate for his sentences to run concurrently rather than consecutively. As such, they dismissed the appeal. The earliest possible release date for Abdul Nasir is thus sometime between May 2021 to November 2021 (presuming a one third remission for good behaviour.) By which time, Abdul Nasir would have served at least two-thirds of his overall sentence (25 years and 4 months). At such time, Abdul Nasir would be at least 52 years old. The appeal of Abdul Nasir, titled \"*Abdul Nasir bin Amer Hamsah v Public Prosecutor SGCA 38*\", was since regarded as a landmark in Singapore's legal history as it changed the definition of life imprisonment from \"life\" to \"natural life\" under the law. This ruling also extensively made impacts on future cases after 20 August 1997 involving a convict sentenced to life imprisonment, including [Muhamad Hasik bin Sahar](/wiki/Muhamad_Hasik_bin_Sahar) for the [manslaughter](/wiki/Manslaughter) of a football player **(31 May 2001)**, [Tony Anak Imba](/wiki/Tony_Anak_Imba) for the robbery-murder of an Indian construction worker **(30 May 2010)**, and [Yong Vui Kong](/wiki/Yong_Vui_Kong) for [drug trafficking](/wiki/Drug_trafficking) **(14 November 2013)**. ### Re-enactments and publication This case was re-enacted in a Singaporean crime show named *[True Files](/wiki/True_Files)*. It first aired as the eleventh and [penultimate](/wiki/Penultimate) episode of the show's third season on 3 January 2005. In 1997, the annual season of Singaporean crime show *[Crimewatch](/wiki/Crimewatch_(Singaporean_TV_series))* featured the Oriental Hotel murder as its eighth episode. This case was also recorded in Subhas Anandan's memoir *The Best I Could*, which features his early life, career and his notable cases. The memoir was adapted into a TV show of the same name, which runs for two seasons. Abdul Nasir's case was re-enacted and aired as the sixth and final episode of the show's first season (though some aspects of the case were altered for dramatic purposes). - [Capital punishment in Singapore](/wiki/Capital_punishment_in_Singapore) - [Life imprisonment in Singapore](/wiki/Life_imprisonment_in_Singapore) - [Caning in Singapore](/wiki/Caning_in_Singapore) - Anandan, Subhas (2009). *The Best I Could*. Marshall Cavendish. [ISBN](/wiki/ISBN_(identifier)) 978-9812619587. 1°17′27″N 103°51′30″E﻿ / ﻿1.2907°N 103.8582°E﻿ / 1.2907; 103.8582\n",
  "language": "en",
  "processed_at": "2026-01-12T11:40:38.555166",
  "title": "Oriental Hotel murder",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Oriental_Hotel_murder"
}