{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:40:40.566222"
  },
  "content": "Electrical and household appliance companyThis article **may have been created or edited in return for undisclosed payments**, a violation of Wikipedia's terms of use. It may require cleanup to comply with Wikipedia's content policies, particularly neutral point of view. *(January 2023)* **OSIM International Pte Ltd** ([Chinese](/wiki/Simplified_Chinese_characters): 傲胜国际企业; [pinyin](/wiki/Pinyin): *Àoshèng guójì qǐyè*) is a Singapore-based company that manufactures wellness technology and lifestyle products such as well being chairs, [massage chairs](/wiki/Massage_chair) and sofas, slimming belts, and [pulse massagers](/wiki/Pulse_massager). The company also recently ventured to manufacturing [gaming chairs](/wiki/Gaming_chair) and electronic products related to gaming, [virtual reality](/wiki/Virtual_reality) and beauty and fitness. ## Company History In 1980, Singaporean entrepreneur Ron Sim founded R Sim trading, a company dedicated to the sale of home goods, kitchen utensils, wooden massagers and reflexology rollers in [Singapore](/wiki/Singapore). In 1983, the company opened its first store. Subsequently, the company expanded its operations to Hong Kong, Taiwan and Malaysia. In 1993, the company officially launched the brand name OSIM, a combination of Sim, the surname of its founder, and 'O' which stands for the globe. After rebranding, OSIM focused on health and lifestyle products and continued to expand across Asia. OSIM was listed on the [Singapore Exchange](/wiki/Singapore_Exchange) in July 2000, selling 25% of the company's shares at the time of listing. The company subsequently de-listed in 2016. In March 2016, Ron Sim, offered to buy out shares of OSIM to take the company private once again. This followed a significant drop in the company's net income. In 2018, OSIM applied to be listed in the [Hong Kong Stock Exchange](/wiki/Hong_Kong_Stock_Exchange). However, the plan was aborted due to perceived intense volatility in the market. In 2021, OSIM was recognized by [Deloitte](/wiki/Deloitte) as one of the Best Managed Companies in Singapore. Also in 2021, OSIM expanded to new product categories such as in beauty and gaming. In March 2022, OSIM International, under the V3 Group, filed for listing on the Hong Kong Stock Exchange. ## Product Categories - Well-being Chairs, Massage Chairs & Sofas - Gaming Chairs - Fitness and Health Monitors - Lower Body Massagers - Upper Body Massagers - Portable Massagers - Air Purifiers, Humidifiers and Water Purifiers - Electronic Beauty Products Series ## Ambassadors - Andy Tan - [Andy Lau](/wiki/Andy_Lau) - [JJ Lin](/wiki/JJ_Lin) - [Jeanette Aw](/wiki/Jeanette_Aw) - [Lin Chi-ling](/wiki/Lin_Chi-ling) - [Fan Bingbing](/wiki/Fan_Bingbing) - [Lee Min-ho](/wiki/Lee_Min-ho) - [Sammi Cheng](/wiki/Sammi_Cheng) - [Son Seok-goo](/wiki/Son_Suk-ku) - [Hyun Bin](/wiki/Hyun_Bin) - Fong Jun Yang ## Awards - Red Dot Design Award 2016, Honourable Mention - OSIM International - uPamper 2 - ELLE Deco Best of 2020, Best Immersive Technology - OSIM International - uDream - DFA Design for Asia Awards 2021, Merit Award, Product & Industrial Design, Leisure & Entertainment Product - OSIM International - uDream - [Red Dot](/wiki/Red_Dot_Design_Award) Design Award Winner 2021, OSIM International - uDream - Deloitte Best Managed Companies Awards 2021 Singapore, OSIM International - Deloitte Best Managed Companies Awards 2022 Singapore, OSIM International - CES Innovation Award 2022 - [Consumer Electronics Show (CES)](/wiki/Consumer_Electronics_Show) Innovation Award 2022 Honoree, OSIM International - Smart DIY Massage Chair ## Extension Programs - 2005-2006, OSIM International was the sponsor of the Beijing Triathlon - In 2008, OSIM International sponsored the Hong Kong [ITU](/wiki/World_Triathlon) Triathlon Asian Cup - In 2010, OSIM sponsored the Singapore Triathlon - In 2010, OSIM International Co-sponsored the inaugural [Standard Chartered Marathon Singapore](/wiki/Standard_Chartered_Marathon_Singapore) - From 2011 up to 2014, OSIM International was the Title Sponsor of the [Badminton World Federation](/wiki/Badminton_World_Federation) (BWF) World Super Series for all 13 events of the series. - In 2015, OSIM International became a sponsor of Singapore [Sundown Marathon](/wiki/Sundown_Marathon) - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:40:40.565822",
  "title": "Osim International",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Osim_International"
}