{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:40:49.194533"
  },
  "content": "Community hospital in Bukit Merah, SingaporeHospital in Singapore , Singapore The **Outram Community Hospital** (OCH) is a 545-bed [community hospital](/wiki/Community_hospital) in [Bukit Merah](/wiki/Bukit_Merah), [Singapore](/wiki/Singapore). It is located adjacent to, and complements, the [Singapore General Hospital](/wiki/Singapore_General_Hospital) (SGH). ## History The Outram Community Hospital was first announced by Minister for Health Mr [Gan Kim Yong](/wiki/Gan_Kim_Yong) as part of the Healthcare 2020 plan during the Committee of Supply (COS) speech in 2012, which aims to increase the number of hospital beds by 3,700 around Singapore by 2020, of which 1,800 will be Community Hospital beds. The hospital is located within the [Singapore General Hospital](/wiki/Singapore_General_Hospital) campus. On 21 May 2015, the hospital held its ground-breaking ceremony with the actual details unveiled. There will be 550 beds, of which 500 are for sub-acute patients with 50 beds for [palliative care](/wiki/Palliative_care) patients. The hospital opened its doors on 7 December 2019, with the rest of the hospital opening fully over the next three years. The SingHealth Tower and Outram Community Hospital held their opening ceremony on 24 January 2022, with a speech by Health Minister [Ong Ye Kung](/wiki/Ong_Ye_Kung). ## Key Milestones - 6 March 2012: Announcement of community hospital in Outram - 21 May 2015: Groundbreaking ceremony of Outram Community Hospital - 7 December 2019: Opening of Outram Community Hospital - SingHealth Community Hospitals This article about a hospital in Singapore is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:40:49.194258",
  "title": "Outram Community Hospital",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Outram_Community_Hospital"
}