{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:40:47.235225"
  },
  "content": "Planning area in Central Area, SingaporePlanning Area in Central Region, Singapore **Outram** (/ˈuːtrəm/ *OO-trəm*[a]) is a [planning area](/wiki/Planning_Areas_of_Singapore) located within the [Central Area](/wiki/Central_Area,_Singapore) of the [Central Region](/wiki/Central_Region,_Singapore) of [Singapore](/wiki/Singapore). The area is bordered by these planning areas: [Singapore River](/wiki/Singapore_River) to the north, the [Downtown Core](/wiki/Downtown_Core) to the east and south, and [Bukit Merah](/wiki/Bukit_Merah) to the west. Outram comprises four subzones, China Square, [Chinatown](/wiki/Chinatown,_Singapore), People's Park and [Pearl's Hill](/wiki/Pearl%27s_Hill). Outram is home to several key [municipal](/wiki/Municipal) buildings, such as [Singapore General Hospital](/wiki/Singapore_General_Hospital) (SGH) and several other specialist [health](/wiki/Health) centres operated by [Singapore Health Services](/wiki/Singapore_Health_Services) (SingHealth) as well as the [Central Narcotics Bureau](/wiki/Central_Narcotics_Bureau) and the [Police Cantonment Complex](/wiki/Police_Cantonment_Complex). [Outram Secondary School](/wiki/Outram_Secondary_School) is situated in nearby York Hill. Across the Outram Road from the [Outram Park MRT station](/wiki/Outram_Park_MRT_station) is the [Health Sciences Authority](/wiki/Health_Sciences_Authority) building. Along the same side of the road further down towards College Road, is Block 9 where Mortuary@HSA is located. At the junction of Outram Road and College Road stands the Alumni Building which at one time housed the Department of Scientific Services (DSS) before it was relocated to its present location in HSA Building. ## Etymology [Outram Road](/wiki/Outram_Road) was named by the Municipality in 1858 after a [British](/wiki/United_Kingdom_of_Great_Britain_and_Ireland) general, [Sir James Outram](/wiki/Sir_James_Outram,_1st_Baronet) (1803–1863), of the [Indian rebellion of 1857](/wiki/Indian_rebellion_of_1857) fame. The nearby Havelock Road was named in reference to Major-General Sir [Henry Havelock](/wiki/Henry_Havelock). General Outram and General Havelock were two of the leaders in the British army during the Indian rebellion of 1857. ## History Known as *si pai poh* in [Hokkien](/wiki/Min_Nan), which means \"[Sepoy](/wiki/Sepoy) plain\". The Sepoy Lines and police station and parade ground are at one end of Outram Road. Both designations of Sepoy Plain and Sepoy Lines refer to the public shooting of 47 sepoys at the wall of Outram Prison in 1915. This was in the aftermath of the [1915 Singapore Mutiny](/wiki/1915_Singapore_Mutiny), which was quelled by local and British military forces. Outram was once home to one of the earliest civil prisons in Singapore, [Outram Prison](/wiki/Outram_Prison). Located at the foot of Pearl's Hill, it was built in 1847 by Charles Edward Faber of the [Madras Engineers](/wiki/Madras_Engineer_Group). During the [Japanese occupation](/wiki/Japanese_occupation_of_Singapore) in 1942, Outram Prison was briefly controlled by the Japanese and was used to hold prisoners of war. The prison was subsequently handed to the British forces following the end of the occupation. Outram Prison was eventually demolished in 1966 to make way for a housing project, Outram Park Complex, which was completed in 1970. It consisted of twelve 16-storey blocks together with a shopping complex. Outram Park Complex was selected for SERS in 1998 and was demolished by 2003, with its residents being relocated to Cantonment Towers in [Everton Park](/wiki/Everton_Park,_Singapore). The land currently remains vacant and there are plans to revitalise Pearl's Hill, which includes building an integrated mixed-use development consisting of 6000 residential units, by the 2030s. ## Infrastructure ### Transportation #### Road Main roads in Outram include: - [Eu Tong Sen Street](/wiki/Eu_Tong_Sen_Street), [New Bridge Road](/wiki/New_Bridge_Road), [South Bridge Road](/wiki/South_Bridge_Road), and [Neil Road](/wiki/Neil_Road) – These parallel, one-way roads run north-south and align with the [North East line](/wiki/North_East_Line). - Havelock Road, Upper Pickering Street, and [Upper Cross Street](/wiki/Upper_Cross_Street) – These roads run east-west provide access to Chinatown and the Downtown Core, linking to the Central Expressway (CTE). - Outram Road – An alternative road connecting the Downtown Core to Bukit Merah and the CTE. #### Mass Rapid Transit Outram is served by four MRT stations, including: - [Outram Park MRT station](/wiki/Outram_Park_MRT_station) – A triple-line interchange ([East West line](/wiki/East%E2%80%93West_Line_(Singapore)), [North East line](/wiki/North_East_Line), and [Thomson-East Coast line](/wiki/Thomson%E2%80%93East_Coast_Line)) located at the boundary of Pearl’s Hill and Bukit Merah. - [Chinatown MRT station](/wiki/Chinatown_MRT_station) – A major interchange station between the North East line and [Downtown line](/wiki/Downtown_Line), serving the Chinatown subzone. - [Maxwell MRT station](/wiki/Maxwell_MRT_station) – A Thomson-East Coast line station serving Chinatown and Maxwell. - [Telok Ayer MRT station](/wiki/Telok_Ayer_MRT_station) – A Downtown line station on Cross Street, situated at the boundary between Outram and the Downtown Core. ### Education Outram is home to [Outram Secondary School](/wiki/Outram_Secondary_School), the only government educational institution in the area until 2027. It is located on York Hill in the Pearl’s Hill subzone. ### Tourist attractions Outram features many historical and cultural landmarks, centered around Chinatown. Notable attractions include: - [Buddha Tooth Relic Temple](/wiki/Buddha_Tooth_Relic_Temple_and_Museum) – A Buddhist temple and museum built in the [Tang dynasty](/wiki/Tang_dynasty) architectural style. - [Sri Mariamman Temple](/wiki/Sri_Mariamman_Temple,_Singapore) – Singapore’s oldest Hindu temple, established in 1827, known for its elaborate *gopuram* (entrance tower). - Chinatown Heritage Centre – Museum showcasing the history of early Chinese immigrants in Singapore. ### Commercial Outram’s commercial areas concentrated around Chinatown, with several shopping malls and mixed-use developments, including: - [Chinatown Point](/wiki/Chinatown_Point) - [People’s Park Centre](/wiki/People%27s_Park_Centre) - [People’s Park Complex](/wiki/People%27s_Park_Complex) - OG People’s Park ## Housing While much of Outram’s land is zoned for commercial use, several residential precincts exist within the district, including Duxton, Kreta Ayer, York Hill, and Upper Cross Street. Housing developments in Outram comprise a mix of Housing and Development (HDB) flats and private condominiums. Notable housing projects in Outram include [The Pinnacle@Duxton](/wiki/The_Pinnacle@Duxton), a 50-storey residential development. The Pinnacle@Duxton is notably one of the tallest public housing developments in Singapore and has won multiple architectural awards. Other public housing areas in Outram include older HDB flats around York Hill and Upper Cross Street. In addition to public housing, Outram features several private residential developments. One Pearl Bank, a 39-storey condominium completed in 2024, replaces the iconic [Pearl Bank Apartments](/wiki/Pearl_Bank_Apartments). [People’s Park Complex](/wiki/People%27s_Park_Complex), completed in 1973, is a mixed-use development located in the heart of Chinatown, next to Chinatown MRT station. ## Politics Outram is divided into two constituencies, [Tanjong Pagar Group Representation Constituency](/wiki/Tanjong_Pagar_Group_Representation_Constituency) and [Jalan Besar Group Representation Constituency](/wiki/Jalan_Besar_Group_Representation_Constituency). The residential precincts in Tanjong Pagar and Duxton Plain of Chinatown subzone fall under Tanjong Pagar-Tiong Bahru division of Tanjong Pagar GRC while the rest of Outram falls under the Kreta Ayer-Kim Seng division of the Jalan Besar GRC. The current Members of Parliament (MP) are [Indranee Rajah](/wiki/Indranee_Rajah) of Tanjong Pagar GRC and [Josephine Teo](/wiki/Josephine_Teo) of Jalan Besar GRC. ## Notes - Victor R. Savage, Brenda S. A. Yeoh (2003), *Toponymics: A Study of Singapore Street Names*, Eastern Universities Press, [ISBN](/wiki/ISBN_(identifier)) 981-210-364-3 - Media related to Outram at Wikimedia Commons\n",
  "language": "en",
  "processed_at": "2026-01-12T11:40:47.234947",
  "title": "Outram, Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Outram,_Singapore"
}