{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:40:51.368957"
  },
  "content": "Singaporean branch of Outward BoundThis article's **tone or style may not reflect the encyclopedic tone used on Wikipedia**. See Wikipedia's guide to writing better articles for suggestions. *(November 2022)* *(Learn how and when to remove this message)* **Outward Bound Singapore** (**OBS**; [Malay](/wiki/Malay_language): *Pusat Bina Semangat Singapura*; [Chinese](/wiki/Simplified_Chinese_characters): 新加坡外展训练中心; [Tamil](/wiki/Tamil_language): சிங்கப்பூர் வெளிப்புற நடவடிக்கை) is part of the network of [Outward Bound](/wiki/Outward_Bound) centres worldwide. Established in 1967 as **Outward Bound School of Singapore** (**OBSS**), OBS has a [campus](/wiki/Campus) located on the island of [Pulau Ubin](/wiki/Pulau_Ubin). ## History Initially named the Outward Bound School of Singapore, it was founded by then [Minister of the Interior and Defence](/wiki/Ministry_of_Defence_(Singapore)), [Goh Keng Swee](/wiki/Goh_Keng_Swee) at [Pulau Ubin](/wiki/Pulau_Ubin) in Singapore in 1967. OBSS was initially managed by the [People's Association](/wiki/People%27s_Association) (PA) before the Ministry of the Interior and Defence took over to use it as a facility to prepare young men for compulsory [national service](/wiki/National_Service_in_Singapore). In April 1991, OBSS was returned to the People's Association and was renamed Outward Bound Singapore. The number of participants has grown since 1991 and it is currently the largest [Outward Bound](/wiki/Outward_Bound) centre worldwide. Secondary school students are strongly encouraged to attend a week's programme at Outward Bound Singapore's Pulau Ubin centre. The programme can be conducted indoor or outdoor, depending on the weather conditions. Over the years, OBS has evolved to play a more active role in community building through its OBS Alumni & the Leadership & Service Award. OBS has also partnered with overseas Outward Bound centres such as Oman & South Africa to provide more global programmes for youths. Recently announced at the Singapore Youth Conference 2014, OBS was restructured to be part of the new strengthened [National Youth Council](/wiki/National_Youth_Council_Singapore) (NYC) Autonomous Agency. As one of the National Youth Developer, OBS will co-drive the national youth volunteer programme, Youth Corps Singapore with NYC. ### Outward Bound Philosophy The Outward Bound philosophy is summarised by co-founder, [Kurt Hahn](/wiki/Kurt_Hahn), as \"The aim of education is to impel people into value-forming experiences, to ensure the survival of these qualities: an enterprising curiosity, an indefatigable spirit, tenacity in pursuit, readiness for sensible self, and above all, compassion.\" The development-by-challenge' approach combats the Six Declines of Modern Youth to produce positive psychological and social outcomes. Outward Bound programmes are designed to empower people with self-awareness, responsibility, perseverance, interpersonal skills, confidence, compassion and the ability to create positive impact for the community. Programmes follow the Outward Bound process model: ## Key Programmes **Youth Corps Singapore** As one of the National Youth Developer, OBS will co-drive the new national youth volunteer programme, Youth Corps Singapore with NYC. Shortlisted applicants will attend a 5-day residential leadership programme at OBS for training and team bonding. The Youth Corps programme will match youth volunteers with critical community needs, and help them make sustained and meaningful contributions to society. **MOE-OBS Challenge Programme** Under the National Outdoor Adventure Education Masterplan, the MOE-OBS Challenge Programme seeks to develop ruggedness, resilience, and build cohesion amongst Secondary 3 students. The programme comprises a series of school-based Physical Education and Character and Citizenship Education lessons facilitated by teachers as well as a 5-day expeditionary course at Outward Bound Singapore (OBS). **21-Day Leadership & Service Award** (LSA) Started in 2011, this award was created for youths aged 17 – 35 with a passion for community service. Selected individuals are awarded the LSA with a scholarship to attend the 21-day course in Pulau Ubin. Awardees participate in a multi-element leadership and service challenge programme designed to broaden their horizons while being out of their comfort zones, build resilience, and inspire them to undertake bigger endeavours to the community. Besides adventure learning, organising and planning of community service projects are also key components of the LSA programme. LSA graduates become part of the OBS Alumni upon completion of the programme. **Global Adventures** Global programmes are conducted with sister Outward Bound centres in various regions and combine both adventure and cultural learning. The 11-day Global Adventure Oman spans the Omani desert, trekking across the Jabel Akhder Mountain in the day and camping under the Arabian stars at night. Another global programme is the 18-day Global Adventure South Africa which includes exploring the sandstone foothills of the spectacular Drakensberg. These programmes are open to youths above 17. ## OBS Alumni Since its establishment in 2012 with the aim of giving graduates of OBS programme a platform to serve the community, the OBS Alumni has partnered several community stakeholders for various causes ranging from helping under-privileged families to environment conservation. - 1-day Nurture @ Adventure programme @ East Coast Campus for about 500 needy children & their families on Father's day - Partnered with Central Singapore Community Development Council to conduct the Trust Journey programme with the aim of fostering racial harmony ties between students from the Global Indian International Schools & local M.O.E school, Queensway Secondary School - Collaborated with International Coastal Clean Up to clean up the coastal shores of Pulau Ubin - Alumni volunteers at the soup kitchen, Willing Hearts where they helped prepare meals for needy Singaporeans - Partnered with South East Community Development Council, 'Yifon Skips for Nutritional Wellness @ South East 2013' campaign to earn 600 Yifon food products for the needy by conducting 'The Giant Team Skip' - Co – organised a special outdoor camp with Central Singapore Community Development Council, Camp Include, for students from MINDS who were paired with Alumni volunteers to go thru the outdoor activities such as high rope course, tunnel cave maze etc. - Organised the first Merlion abseil @ Sentosa for the public to raise awareness and funds for Life Community, a children's charity - On 19 March 2014, the volunteers were awarded for their community efforts at the inaugural OBS Volunteers Appreciation Ceremony. Alumni mentors were also appointed to guide younger volunteers in their community impact projects ## Facilities ### Pulau Ubin Camp 1 & 2 When Outward Bound first started in 1967, its facilities were spartan. Currently, OBS has two campuses at Pulau Ubin. Using up approximately 9 hectares of land, some of the climbing facilities are the *Peak Ascent Tower*, inverse and [tripod](/wiki/Tripod) towers, Vertical Challenge Activities, The Indiana, [rock climbing](/wiki/Rock_climbing) walls, and non-height activities such as the Tunnelling and Caving system. Other facilities include teaching rooms and a 25-metre swimming pool for [kayaking](/wiki/Kayak). The Pulau Ubin campus is located at two locations, with Camp 1 being larger than Camp 2. Depending on the course, Residential or Mobile, the campers either stay in the [dormitories](/wiki/Dormitory) provided on campus or in [tents](/wiki/Tents) on the centre's ground respectively. ### OBS@Coney This article needs to be **updated**. Please help update this article to reflect recent events or newly available information. *(December 2025)* A new OBS campus will be located on Coney Island, as part of the National Outdoor Education Masterplan. When the campus eventually opens in 2021, OBS@Coney will augment the existing facilities at Pulau Ubin, towards an annual capacity of 45,000 participants. The campus will feature new outdoor adventure education facilities, such as advanced challenge ropes courses, abseiling, rock-climbing and artificial caving systems. - [Outdoor education](/wiki/Outdoor_education) - OBS Homepage\n",
  "language": "en",
  "processed_at": "2026-01-12T11:40:51.368594",
  "title": "Outward Bound Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Outward_Bound_Singapore"
}