{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:40:54.148985"
  },
  "content": "* *Oyika** is a [Singapore](/wiki/Singapore)-based [multi-national company](/wiki/Multi-national_company) that provides Battery-as-a-Service (BaaS) solutions for electric motorbikes in Southeast Asia, offering battery swapping stations to make EV adoption more accessible and convenient. The company aims to promote sustainable urban mobility and reduce air pollution through affordable and efficient electric transportation options. Founded in 2018, Oyika has become a market leader across the Southeast Asia region in advocating for electric vehicles. In 2023, the company secured US$8.75 million in Series B funding from Banpu NEXT, an arm of Thailand's Banpu Group, to expand its battery swapping infrastructure. Oyika partners the [United Nations Development Programme](/wiki/United_Nations_Development_Programme) (UNDP) to introduce battery-swapping services in Cambodia as part of a rural mobility initiative. ## History Oyika Private Limited was founded in 2018 in Singapore to promote the adoption of electric mobility across Southeast Asia. In October 2020, Oyika unveiled plans to extend its battery-sharing services to rural communities in Cambodia, aiming to reduce the costs of e-motorbikes and decrease the reliance on traditional internal combustion engine (ICE) motorbikes. This complemented the company's Go2 programme, a pay-as-you-go, no-contract, no-deposit e-motorbike ride-sharing service that was launched in May 2020 in Cambodia and received positive uptake since launch. In June 2021, Malaysian-based Yinson Green Tech announced its investment in Oyika, with the objective to accelerate electric vehicles (EV) adoption in Southeast Asia, through realisation of Oyika's affordable, app-based solution and battery swap infrastructure. In May 2023, Banpu NEXT, a smart energy solutions provider in Asia-Pacific region, and a subsidiary of Thai energy solutions firm Banpu Infinergy (BPIN), announced a strategic investment in Oyika valuing 10.8 million USD, supporting its expansion of footprint in Thailand and Southeast Asia. In May 2024, Oyika introduced its swappable and direct fast charging 60v and 72v batteries across its markets, and officially rolled out operations in Thailand. The roll out was complemented by 70 battery swapping stations capable of direct fast charging in Bangkok and Phuket, and was planned with expansion to a network of 300 such stations across Thailand. ## Products and Services ### Oyika Battery Swapping Network Oyika provides a Battery-as-a-Service (BaaS) system for electric motorbikes. Its platform allows riders to swap depleted batteries for fully charged ones at designated stations, typically in under a minute. This approach addresses common barriers to EV adoption such as long charging times and high upfront costs. First launched with technological collaborations with Chinese-based technology companies Wondware and ScinPower, the company offers several subscription models, including daily, weekly, and monthly plans, bundled with battery swaps and electric motorbike usage. Its services are available via a mobile app, which lets its users know where nearby stations are located and if they have the available capacity. Oyika's batteries are designed to be bike-agnostic, making it easily compatible with most of the mass-market electric motorcycles across Southeast Asia. This provided flexibility and ease for bike manufacturers to integrate existing electric motorcycle models with Oyika's batteries. This provided cost and technologically effective solution to on-board electric two-wheeler firms to Oyika's network of battery charging and swapping stations located in [Cambodia](/wiki/Cambodia), [Indonesia](/wiki/Indonesia), [Malaysia](/wiki/Malaysia), and [Thailand](/wiki/Thailand). In addition, these batteries are in-built with [Internet of Things](/wiki/Internet_of_things) (IoT) capabilities, enabling [4G](/wiki/4G) cellular [telematics](/wiki/Telematics) tracking of vehicle speed and location, battery [condition monitoring](/wiki/Condition_monitoring) (including voltage, current, charge/discharge rate, temperature, vibration, and humidity), as well as [Global Positioning System](/wiki/Global_Positioning_System) (GPS)-enabled security and safety measures.Currently, Oyika batteries are integrated with renowned electric motorcycle brands such as Tailg, Okla, Yadea, Niu, Gesits, as well as several Indonesian local brands such as Selis, Rakata, Alessa. Oyika launched its battery swapping network in Malaysia in December 2023 in partnership with RydeEV, which begun rolling out electric motorcycles on a lease-to-own basis. The initial battery swapping network consisted of 15 battery swapping stations throughout Klang Valley, which was expanded to 100 stations by the end of 2023. Concurrently, Oyika has established more than 200 battery swapping stations in Indonesia, with a major network density within [Jabodetabek](/wiki/Jabodetabek). At present, there are at least 250 battery swapping cabinets in Jakarta, Indonesia, allowing accessibility to the network within every 3 kilometres in the city and catering for at lease 1000 electric motorcycles running on Oyika batteries. ### Infrastructure Oyika is part of the Acceleration Program of Battery Electric Vehicles in Indonesia, and is one of the pioneering companies in Indonesia supporting the establishment of *Stasiun Penukaran Baterai Kendaraan Listrik Umum* (Public Electric Vehicle Battery Swap Station, or SPBKLU) in Indonesia. As of February 2023, Oyika operates at least 112 SPBKLU stations spread across various townships in the outskirts of Jakarta, including Bogor, Depok, Tangerang, and Bekasi. These stations are integrated with the Oyika application. allowing users to easily locate the nearest exchange station point and swap for a fully charged battery. In 2024, Oyika joined [Perusahaan Listrik Negara](/wiki/Perusahaan_Listrik_Negara) (PLN) along with a list of 28 business entity partners, including other major players such as Electrum, Swap, Volta, to jointly develop SPBKLU for electric vehicle battery-swapping, Stasiun Pengisian Kendaraan Listrik Umum (Public Electric Vehicle Charging Stations, or SPKLU) for electric vehicle direct charging, in addition to developments for Home-based Charging. The programme aimed to create more opportunities for increased capacity building in electric vehicle adoption in Indonesia, and is set to install 3,000 SPKLU units and 250 SPBKLU units by end of 2024. ## Partnerships In July 2024, Oyika signed an agreement with Thunder Plus, with plans to integrate its range of two-wheeler and three-wheeler fast chargers into Oyika's battery swapping stations across the Southeast Asia region. - Cars portal - Renewable energy portal - [List of companies of Singapore](/wiki/List_of_companies_of_Singapore) - [Battery electric vehicle](/wiki/Battery_electric_vehicle) - [Battery swapping](/wiki/Battery_swapping) - Oyika Pte. Ltd. Official Website - PT Oyika Energi Indonesia Official Website - Oyika Thailand Co. Official Website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:40:54.148653",
  "title": "Oyika",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Oyika"
}