{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:41:06.011895"
  },
  "content": "Singaporean shipping company **Pacific International Lines** (**PIL**) is a [Singaporean](/wiki/Singapore) [shipping company](/wiki/Shipping_company) incorporated in Singapore on 16 March 1967. It was founded by Singaporean entrepreneur [Chang Yun Chung](/wiki/Chang_Yun_Chung), who was the world's oldest billionaire until he died at 102 in September 2020. ## History When the company was founded in March 1967, the company originally operated just two ships, but constantly expanded to finally celebrate its first 50 years of history in 2017, and ranking within the first 10 largest container shipping lines. In March 2015, PIL partially took over the ownership of Singapore's Mariana Express Lines (MELL). According to the deal, PIL assumed the majority shareholding. MELL has continued to operate under its own brand and pre-existing business, as agreed internally at the time of the purchase. In June 2017, PIL and [COSCO](/wiki/COSCO) entered into a mutual chartering agreement, to supply and exchange vessels during shipping demand peak times. In February 2018, as forerunner in IT improvements, PIL has implemented a [blockchain](/wiki/Blockchain) supply platform to share established data with [DP World](/wiki/DP_World) - [Port of Singapore](/wiki/Port_of_Singapore) via [IBM](/wiki/IBM) systems. ## Fleet PIL has a fleet of around 101 vessels ([container vessels](/wiki/Container_ship)) with a capacity of more than 300,000 [twenty-foot equivalent units](/wiki/Twenty-foot_equivalent_unit) (TEUs). PIL has also taken delivery of 12 vessels of 11,800 TEU. The company employs over 6900 staff globally, regularly serving about 500 ports in nearly 100 countries worldwide. Container ship classes of Pacific International Lines Ship classBuiltCapacity (TEU)Ships in classNotes[P-class](/wiki/PIL_P-class_container_ship)2015 onwards11,9234O-class2024 onwards83504E-class2023 onwards14,0004M-class2012 onwards35604C-class2010 onwards66066L-class2007 onwards425313R-class1997 onwards777 - 94311K-class200430813S-class2013 onwards388912G-class20122754 - 28004TBATBA13,0005 - [List of largest container shipping companies](/wiki/List_of_largest_container_shipping_companies) - Official website This [Singaporean corporation or company](/wiki/List_of_companies_of_Singapore) article is a stub. You can help Wikipedia by expanding it. - v - t - e This transport corporation-related article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:41:06.011539",
  "title": "Pacific International Lines",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Pacific_International_Lines"
}