{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:41:33.502129"
  },
  "content": "Hybrid orchidPart of a series on the[Culture of Singapore](/wiki/Culture_of_Singapore)[History](/wiki/History_of_Singapore) - [Singaporeans](/wiki/Singaporeans) - [Immigration](/wiki/Immigration_to_Singapore) - [Holidays](/wiki/Public_holidays_in_Singapore) - [Languages](/wiki/Languages_of_Singapore) - [Multiculturalism](/wiki/Demographics_of_Singapore) - [Symbols](/wiki/National_symbols_of_Singapore) - [Women](/wiki/Women_in_Singapore) [Topics](/wiki/Outline_of_Singapore) - [Architecture](/wiki/Architecture_of_Singapore) - [Art](/wiki/Visual_art_of_Singapore) - [Cinema](/wiki/Cinema_of_Singapore) - [Cuisine](/wiki/Singaporean_cuisine) - [Festivals](/wiki/List_of_festivals_in_Singapore) - [Hawker centre](/wiki/Hawker_centre) - [Literature](/wiki/Singaporean_literature) - [Media](/wiki/Media_of_Singapore) - [Music](/wiki/Music_of_Singapore) - [National Service](/wiki/National_service_in_Singapore) - [Politics](/wiki/Politics_of_Singapore) - [Religion](/wiki/Religion_in_Singapore) - [Sports](/wiki/Sports_in_Singapore) - [Singlish](/wiki/Singlish) - [Television](/wiki/Television_in_Singapore) Research - [Bibliography](/wiki/Bibliography_of_Singapore) Symbols - [Anthem](/wiki/Majulah_Singapura) - [Flag](/wiki/Flag_of_Singapore) - Flower - [Symbol](/wiki/Merlion) - [Oath Of Allegiance](/wiki/Singapore_National_Pledge) - Singapore portal - v - t - e ***Papilionanthe* Miss Joaquim**, also known as the **Singapore orchid**, the **Princess Aloha orchid,** and commonly known by its original name ***Vanda* Miss Joaquim**, is a hybrid [orchid](/wiki/Orchid) (a [grex](/wiki/Grex_(horticulture))) that is the [national flower](/wiki/Floral_emblem) of [Singapore](/wiki/Singapore). For its resilience and year-round blooming quality, it was chosen on 15 April 1981 to represent Singapore's uniqueness and [hybrid culture](/wiki/Culture_of_Singapore). This orchid is the first registered plant hybrid from Singapore. ## History In the June 1893 [Gardeners' Chronicle](/wiki/The_Gardeners%27_Chronicle), then scientific director of the [Singapore Botanic Garden](/wiki/Singapore_Botanic_Gardens) [Henry Nicholas Ridley](/wiki/Henry_Nicholas_Ridley) announced that a few years prior, Ashkhen Hovakimian ([Agnes Joaquim](/wiki/Agnes_Joaquim)), \"...a lady residing in Singapore, well known for her success as a horticulturist, succeeded in crossing *Vanda hookeriana* Rchb. f., and *V. teres*, two plants cultivated in almost every garden in Singapore.\" A decorated horticulturalist from a family with a strong interest in plants, Joaquim won about 70 awards \"...for cultivating varied specimens such as radishes, custard apples, dahlias and begonias in Singapore between 1881 and 1899,\" and *Vanda* Miss Joaquim would win first prize for the rarest orchid in a reportedly crowded field at Singapore's 1899 Flower Show. Miss Agnes Joaquim did not exhibit VMJ until long after it came into being and the award was for the rarest (only rarest, nothing else) orchid. The great majority of orchid scientists and experts do not accept the theory strongly favored by a someone who is not an orchid expert that Miss Agnes Joaquim intentionally made the cross which produced VMJ. The orchid experts accept a report by Miss Joaquim's nephew that she found the plant in a clump of bamboo. This nephew was present when in happened (for a detailed accound see Arditti and Hew, 2007 which contains full details an many citations. Joaquim was likely encouraged to take the orchid to Ridley by her younger brother Joseph P. Joaquim, \"a prominent lawyer, horticulturist and member of the Botanic Gardens Committee\", and she or possibly her brother showed the plant to Ridley in early 1893. A specimen sheet from the Gardens recording the artificial hybrid is dated April 1893. On 15 April 1981, Singapore Minister for Culture [S. Dhanabalan](/wiki/S._Dhanabalan) proclaimed the species to be Singapore's national flower. In 2016, the [National Parks Board](/wiki/National_Parks_Board) and [National Heritage Board](/wiki/National_Heritage_Board_(Singapore)) of Singapore officially acknowledged Joaquim created the orchid after an NHB \"review of all historical source materials\" rejected persistent claims that the plant actually came about as a natural hybrid. The scientific name as of 2019 is *Papilionanthe* Miss Joaquim, as both parent species are now placed in the genus *[Papilionanthe](/wiki/Papilionanthe)*. ## Features *Vanda* Miss Joaquim is a cross between the Burmese *Vanda teres* (now called *[Papilionanthe teres](/wiki/Papilionanthe_teres)*) and the Malayan *Vanda hookeriana* (now called *[Papilionanthe hookeriana](/wiki/Papilionanthe_hookeriana)*). Though in the original crossing no record was kept of which of the two species originally produced the seeds and which one provided the pollen, DNA sequences from maternally inherited [chloroplast](/wiki/Chloroplast) DNA have been used to determine that the pod parent was *P. teres* var. *andersonii* and, by exclusion, the pollen parent is *P. hookeriana*. It is a [free-flowering](/wiki/Free-flowering) plant and each inflorescence can bear up to 12 buds, and usually 4 flower blossom at a time. Each flower measures 5 cm across and 6 cm tall. The petals are twisted such that the back surface faces the front like its parents. The two petals on the top and the top sepal are rosy-violet, while the 2 lateral sepals on the lower half are pale mauve. The large and board lip of the orchid which looks like a fan is colored violet-rose, and merges into a contrasting fiery orange that are finely spotted with dark purple center. *Papilionanthe* Miss Joaquim is a robust sun loving plant that requires heavy fertilizing, vertical support to enable it to grow straight and tall along with free air movement and high humidity. It starts blossoming after its stem rises 40 to 50 cm above the support. ### Works cited - Arditti, J., and C. S. Hew. 2007. The origin of Vanda Miss Jaoquim. Pages 261–309 in K. M. Cameron, J. Arditti and T. Kull (eds.), Orchid Biology, Reviews and Perspectives, Vol. IX, The New York Botanical Garden Press, New York. - Johnson H. and N. Wright, 2008 Vanda Miss Joaquim: Singapore's National Flower and the Legacy of Agnes and Ridley, Suntree Media Pte Ltd, Singapore. [ISBN](/wiki/ISBN_(identifier)) 978-981-08-0333-9 - Teoh, E.S. (2005). *Orchids of Asia*. Times Editions- Marshall Cavendish. [ISBN](/wiki/ISBN_(identifier)) 978-981-261-015-7. - Wright N. H. 2000. The Origins of Vanda Miss Joaquim. Malayan Orchid Review 34; 70–73. - Wright N. H. 2003 Respected Citizens: the History of Armenians in Singapore and Malaysia, Amassia Publishing, Middle Park, Australia. - Wright N. H. 2004. After a re-examination of the origins of Vanda Miss Joaquim. Orchid Review 112: 292–2988. - Yam, T. W. 1999. A possible solution to the parentage riddle Library resources about **Papilionanthe Miss Joaquim** - Resources in your library - Resources in other libraries - National Parks Board Archived 8 October 2019 at the [Wayback Machine](/wiki/Wayback_Machine) - National Library Board\n",
  "language": "en",
  "processed_at": "2026-01-12T11:41:33.501852",
  "title": "Papilionanthe Miss Joaquim",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Papilionanthe_Miss_Joaquim"
}