{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:41:35.315122"
  },
  "content": "Network of park/greenspace connecting paths in Singapore The **Park Connector Network (PCN)** are a network of walking/running/cycling paths in [Singapore](/wiki/Singapore) that connects the various parks and other green spaces throughout the country. Both the parks and the PCN are managed by [National Parks Board](/wiki/National_Parks_Board) (NParks). As part of the National Cycling Plan to promote cycling, the [Land Transport Authority](/wiki/Land_Transport_Authority) (LTA) is also constructing networks of cycling paths within [residential towns](/wiki/New_towns_of_Singapore). These cycling paths connect with the PCN, enabling people to cycle both intra-town (e.g., from home to [Mass Rapid Transit](/wiki/Mass_Rapid_Transit_(Singapore)) (MRT) stations) and inter-town (longer distance cycling). As of 2025[update], there are currently 94 park connectors in Singapore. ## History The proposal to form a park connector network was approved in 1991 by The Garden City Action Committee. In 1995, The Kallang Park Connector became the first park connector to be implemented. Stretching over nine kilometres, the park connector links two regional parks: [Bishan Park](/wiki/Bishan-Ang_Mo_Kio_Park) and [Kallang Riverside Park](/wiki/Kallang_Riverside_Park). In December 2007, the Eastern Coastal Loop, a 42-kilometre loop, was completed, providing a link from [East Coast Park](/wiki/East_Coast_Park) to [Changi Beach Park](/wiki/Changi_Beach_Park). By January 2012, 200 kilometres of the PCN had been completed. In 2015, NParks had completed 300 kilometres of the PCN, along with the Central Urban Loop. ## Loops - Central Urban Loop - Eastern Coastal Loop - Northern Explorer Loop - North Eastern Riverine Loop - Southern Ridges Loop - Western Adventure Loop - [List of parks in Singapore](/wiki/List_of_parks_in_Singapore) - [Urban planning in Singapore](/wiki/Urban_planning_in_Singapore) - [Rail Corridor (Singapore)](/wiki/Rail_Corridor_(Singapore)) - Official site Archived 22 April 2022 at the [Wayback Machine](/wiki/Wayback_Machine) - National Parks Board, Singapore - A Green Network for Singapore, Kiat W. Tan Archived 14 April 2016 at the [Wayback Machine](/wiki/Wayback_Machine)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:41:35.314834",
  "title": "Park Connector Network",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Park_Connector_Network"
}