{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:41:41.405204"
  },
  "content": "Night market found in Brunei, Indonesia, Malaysia and Singapore ***Pasar malam*** is a [Malay](/wiki/Malay_language) word that literally means \"[night market](/wiki/Night_market)\" (the word *pasar* comes from *[bazaar](/wiki/Bazaar)* in [Persian](/wiki/Persian_language)). A *pasar malam* is a [street market](/wiki/Street_market) in [Indonesia](/wiki/Indonesia), [Malaysia](/wiki/Malaysia), [Brunei](/wiki/Brunei) and [Singapore](/wiki/Singapore) that opens in the evening, usually in residential neighbourhoods. Pasar malams are culturally very similar to night markets in Asian countries such as China (Nanluoguxiang, Shuang'an Night Markets), Thailand ([Chatuchak Market](/wiki/Chatuchak_Weekend_Market)), Taiwan ([Shilin Market](/wiki/Shilin_Night_Market)), Vietnam (Hanoi's Old Quarter), South Korea (Namdaemum Market) and India (Mangal Bazaar). The pasar malam may be held in a fixed location or itinerant, offering a variety of products such as [street food](/wiki/Street_food), [snacks](/wiki/Snack), desserts, produce, apparel, accessories, handmade crafts, houseware, gadgets, toys, knick-knacks, and ornaments at cheap or reasonable prices. Counterfeit goods such as fake branded wearables and pirated CDs may also be sold at a pasar malam. Pasar malam might resemble a night festival or a [fairground](/wiki/Fair), where fair games and kiddy rides, like a mini [carousel](/wiki/Carousel) or mini train ride, may also be present. Several quintessential fair snacks like [cotton candy](/wiki/Cotton_candy), [ice cream](/wiki/Ice_cream), [hot dogs](/wiki/Hot_dog), and grilled sausages are also popular, next to the offerings of traditional local delicacies. A pasar malam often takes place only one to a few days of the week, as the traders rotate around different neighbourhoods on different days of the week. [Haggling](/wiki/Bargaining) over prices is a common practice at such markets. ## Etymology \"Pasar Malam\" translates to \"Night Market\" in English. The term is derived from the Malay language, where \"pasar\" means \"market\" and \"malam\" means \"night.\" ## History In the Indonesian archipelago, markets are traditionally held on different days with locations rotating among participating villages. This traditional economic custom is known as *Hari Pasaran* (lit. \"market days\") in [Javanese](/wiki/Javanese_language). After being further developed, the market was established more permanently like it is today. The night market is regarded as the continuation of this non-permanent market culture. Night markets are usually held during special occasions or festivals, such as [Sekaten](/wiki/Sekaten) festival in Java, or held on [Ramadhan](/wiki/Ramadhan) nights, approximately a week before [Lebaran](/wiki/Lebaran). Among traditional night markets, one of the earliest and biggest was the annual [Lunar New Year](/wiki/Lunar_New_Year) night market in [Batavia](/wiki/Batavia,_Dutch_East_Indies), the capital of the [Dutch East Indies](/wiki/Dutch_East_Indies). Held three days before the Lunar New Year, this night market began in the late 1820s as an initiative of [Tan Eng Goan, the 1st *Majoor der Chineezen*](/wiki/Tan_Eng_Goan) of Batavia, and became a prototype for similar night markets. After the discovery of electricity and [lightbulbs](/wiki/Lightbulb), night markets were held more frequently in colonial Dutch East Indies in the early 20th century. The most notable one is [Pasar Gambir](/wiki/Pasar_Gambir), a night market fair held in 1906 and yearly from 1921 until the outbreak of [World War II](/wiki/World_War_II) in 1942, in the Koningsplein, Batavia, [Dutch East Indies](/wiki/Dutch_East_Indies) (now [Merdeka Square](/wiki/Merdeka_Square,_Jakarta), Jakarta, Indonesia) to celebrate the birthday of [Queen Wilhelmina of the Netherlands](/wiki/Wilhelmina_of_the_Netherlands). It has become the predecessor of the annual [Jakarta Fair](/wiki/Jakarta_Fair) and [Den Haag](/wiki/The_Hague)'s [Tong Tong Fair](/wiki/Tong_Tong_Fair) which are a night market and festival held for several weeks. ## Indonesia In [Java](/wiki/Java), especially in the [Javanese](/wiki/Javanese_people) royal cities [Yogyakarta](/wiki/Yogyakarta) and [Surakarta](/wiki/Surakarta), the grand week-long pasar malam is usually held annually during the [Sekaten](/wiki/Sekaten) festival to celebrate [Mawlid](/wiki/Mawlid), or the birthday of [Muhammad](/wiki/Muhammad). During colonial [Dutch East Indies](/wiki/Dutch_East_Indies), the annual Pasar Malam was held in [Pasar Gambir](/wiki/Pasar_Gambir) (today [Merdeka Square](/wiki/Merdeka_Square,_Jakarta)) and became the predecessor of modern [Jakarta](/wiki/Jakarta)'s annual [Jakarta Fair](/wiki/Jakarta_Fair). Today, several *[kecamatan](/wiki/Kecamatan)* (districts) in Jakarta and also other provinces in Indonesia, hold weekly pasar malam, usually every Saturday night in a nearby *[alun-alun](/wiki/Alun-alun)* square, open fields, or marketplaces. In Indonesia, pasar malam has become a weekly recreational place for local families. Other than selling a variety of goods and foods, some pasar malam also offer kiddy rides and carnival games, such as mini [carousels](/wiki/Carousel) or mini train rides. In [Palembang](/wiki/Palembang), a popular pasar malam is located on the front of Kuto Besak Fort on the bank of the [Musi River](/wiki/Musi_River_(Indonesia)). This pasar malam sells local dishes and snacks such as [pempek](/wiki/Pempek), lenggang, and tekwan, and also offers souvenirs and handy crafts. ## Brunei Pasar Malam can be found in various locations throughout Brunei. Some of the most notable ones include: - Gadong Night Market: Located in the heart of [Gadong](/wiki/Gadong,_Brunei), this night market is one of the largest and most popular in Brunei. It features numerous stalls selling a wide range of food, including local delicacies, fresh produce and snacks. The Gadong Night Market is particularly famous for its vibrant atmosphere and diverse culinary offerings. - Food Street Yayasan: located within the Yayasan Sultan Haji Hassanal Bolkiah Complex in [Bandar Seri Begawan](/wiki/Bandar_Seri_Begawan), is a lively night market that offers a diverse array of culinary delights, from [traditional Bruneian dishes](/wiki/Bruneian_cuisine) to international cuisine. Operating primarily in the evenings, this vibrant food street serves as a bustling hub for locals and tourists to enjoy a variety of food, such as [Nasi Katok](/wiki/Nasi_katok), Ambuyat, Satay, Kuih and Laksa. This lively food street generally operates for several months each year in recurring cycles, with new vendors featured in each cycle. ## Malaysia In Malaysia, Pasar Malam is normally set as a temporarily closed street for vehicles and open for pedestrians from evening until late night weekly. At certain locations due to frequency or a few times a week, narrow and busy streets also safety reasons, Pasar Malam will open at Tapak Pasar Malam at nighttime which describes an allocation space that converts a parking space during the daytime. Due to the hot Malaysian weather during the daytime, the Pasar Malam has become a nightlife activity that attracts the local community after working time and the tourist crowd to shop with moderate night temperatures looking for cheap hot foods, clothing, groceries, etc. The vendor licences are obtained from local authorities under the local council area. The majority of the local vendors sell plenty types of drinks, hot foods, and local delicacies from Malay, Malaysian Chinese, and Indian backgrounds which are famous and also difficult to find, fresh fruits and vegetables, fresh fish and seafood, fresh meat and poultry, toys, family range of clothes and accessories. Some local vendors also sell live pets or even phone accessories. ## Singapore In Singapore, the pasar malams of old were phased out in 1978 due to regulation but were fractionally revived in housing estates in 1991 as a cultural selling point. Notable pasar malams of old included the Woodlands Pasar Malam which attracted crowds from Johor Bahru and the People's Park Pasar Malam in Chinatown. Present-day pasar malams are organised at specific locations on a temporary lease, usually before festive occasions such as Lunar New Year, Hari Raya Puasa, and Deepavali. The organisers are required to submit a tender bid to the [People's Association](/wiki/People%27s_Association) for the right to host the Pasar Malam. Food hawkers are licensed by the [NEA](/wiki/National_Environment_Agency) and required to pass a food hygiene course. Pasar malams are reported to face sustainability challenges due to rising rental costs. ## The Netherlands In the [Netherlands](/wiki/Netherlands), a yearly [Indo-Eurasian](/wiki/Indo_people) festival was held in [The Hague](/wiki/The_Hague) under the name *[Tong Tong Fair](/wiki/Tong_Tong_Fair)*, formerly known as the *Pasar Malam Besar* (*besar* meaning \"big\"). After 63 editions, the festival closed down in 2024 due to financial difficulties Due to the high number of Indo-Eurasians and the successive success of this event since 1959, dozens of pasar malam are held each year in the Netherlands. Recently the Indonesian embassy has started sponsoring a yearly *Pasar Malam Indonesia*, mainly to promote Indonesian business and enhance Dutch-Indonesian relations. - [Bazaar](/wiki/Bazaar) - [Hawker centre](/wiki/Hawker_centre), open-air complexes in Malaysia and Singapore housing many stalls that sell a variety of inexpensive food - *[Kopi tiam](/wiki/Kopi_tiam)*, literally a \"coffee shop\" - [Market (place)](/wiki/Market_(place)) - *[Pasar pagi](/wiki/Pasar_pagi)*, (morning market) - Retail - [Wet market](/wiki/Wet_market) - [Farmers' market](/wiki/Farmers%27_market) - MyPasarMalam – Malaysia pasar Malam directory - Pasar malam business - Pasar Malam SG\n",
  "language": "en",
  "processed_at": "2026-01-12T11:41:41.404925",
  "title": "Pasar malam",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Pasar_malam"
}