{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T10:03:53.103568"
  },
  "content": "Planning area and residential town in East Region, SingaporeThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Pasir Ris\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(September 2014)* *(Learn how and when to remove this message)*Planning Area and HDB Town in East Region, Singapore **Pasir Ris** ([IPA](/wiki/International_Phonetic_Alphabet): /ˌpɑːsər ˈrɪs, -seɪ-/ *pah-sir RISS* or *pah-say RISS*) is a [planning area](/wiki/Planning_Areas_of_Singapore) and [residential town](/wiki/New_towns_of_Singapore) located in the [East Region](/wiki/East_Region,_Singapore) of [Singapore](/wiki/Singapore). It is bordered by [Tampines](/wiki/Tampines) and [Paya Lebar](/wiki/Paya_Lebar) to the south, [Sengkang](/wiki/Sengkang) to the southwest and [Changi](/wiki/Changi) to the east. The planning area also shares riverine boundary with [Punggol](/wiki/Punggol) to the west, separated by the [Serangoon River](/wiki/Serangoon_River), as well as having a maritime boundary with the [North-Eastern Islands](/wiki/North-Eastern_Islands) planning area, across the [Straits of Johor](/wiki/Straits_of_Johor). Like other new towns, public transport facilities were factored into the development of Pasir Ris. Pasir Ris is easily accessible via bus services at [Pasir Ris Bus Interchange](/wiki/Pasir_Ris_Bus_Interchange) and the [Mass Rapid Transit](/wiki/Mass_Rapid_Transit_(Singapore)) at [Pasir Ris MRT station](/wiki/Pasir_Ris_MRT_station). Today, landmarks in the area include the [NTUC Downtown East](/wiki/NTUC_Downtown_East), [Pasir Ris Beach Park](/wiki/Pasir_Ris_Park) and [White Sands Shopping Mall](/wiki/White_Sands_Shopping_Mall,_Singapore). ## Etymology The first reference to a village of *Pasir Ris*, *Passier Reis* (or *Passier Rice*), appeared in early 1800s. The second part of the city name, *Ris*, in Malay, means *[bolt rope](/wiki/Bolt_rope)*. Pasir Ris may also mean \"white sand\" in Malay. Pasir Ris Town is named after the long stretch of sandy white beach along the north-east coastline of Singapore, facing [Pulau Ubin](/wiki/Pulau_Ubin). ## History Pasir Ris was originally a low lying, undeveloped area with [Malay](/wiki/Malays_(ethnic_group)) kampongs like Kampong Pasir Ris, Kampong Bahru and Kampong Loyang Besar, and the various Chinese kampongs along Elias Road. The area was well known for its many plantation estates including the Singapore United Plantations, Loh Lam Estate, Hun Yeang and Thai Min Estates. The beach was a popular resort for water skiing in the 1950s. There was also the Pasir Ris Hotel, venue of many memorable parties and picnic gatherings in the 1950s, 1960s and early 1970s. The development of Pasir Ris Town began in 1983 with Phase 1 being an Elias Road/Pasir Ris Estate, followed by Loyang N1 and N2 by 1989–90, N4 from 1992 to 1993, N5 from 1995 and N6 in 1997 together with N7.[*citation needed*] Pasir Ris Neighbourhood 8 will begin construction after the announcement of Elias MRT station in 2021, of which MINDEF is giving up the land. Today, White Sands Shopping Centre, located next to [Pasir Ris MRT station](/wiki/Pasir_Ris_MRT_station), embodies the local place name. As part of the Remaking Our Heartland 3 (ROH3) plans, the town will be rejuvenated and envisioned as 'Our Urban Sanctuary' within the next five to ten years. The plans will focus on four key areas: Town Centre, park spaces and building homes close to parks, creating new spaces, and enhancing the walking and cycling experience within the town. A 1.2 km 'Central Greenway' is planned from [Pasir Ris Park](/wiki/Pasir_Ris_Park), through the town centre, and ends near Costa Ris, a housing estate near the end of the [Tampines Expressway](/wiki/Tampines_Expressway). Approximately 500m will be elevated above ground, with ramps connecting it to the ground level, without having to stop and wait at the traffic lights. On top of pedestrian walkways, the 'Central Greenway' will also feature bicycle paths for cyclists. This will be a feature unique only to Pasir Ris and make Pasir Ris Park even more readily accessible. The [Housing and Development Board](/wiki/Housing_and_Development_Board) (HDB) plans to develop 2,000 public housing units adjacent to the Pasir Ris Park, offering views of the park and Sungei Api Api. The first batch of flats have been released for sale as part of the August 2020 BTO exercise. The development is named Costa Grove and offers a total of 1,070 units, housed in nine residential blocks with varying heights from nine to eighteen storeys. Upgrading works for the existing four neighbourhood centres will also be carried out as well as improvements in the neighbourhood parks with more amenities such as new playgrounds, sheltered linkways, and fitness corners. The neighbourhood centres up for upgrading are Loyang Point, Elias Mall, Pasir Ris West Plaza, and Neighbourhood 4 NC. A new town centre is also in the plans where there will be a mixed development in the area, comprising residential, retail, and food and beverage outlets. This development, named Pasir Ris 8, will also be integrated with the new [Pasir Ris Bus Interchange](/wiki/Pasir_Ris_Bus_Interchange), where it will be equipped with a dedicated pick-up and drop-off point for full-time [servicemen](/wiki/National_Service_in_Singapore) undergoing military training on [Pulau Tekong](/wiki/Pulau_Tekong). Other than a bus interchange, the integrated development will also house a polyclinic and a town plaza, serving as a community focal point for the town. The site has been awarded to a joint venture between [Allgreen Properties](/wiki/Allgreen_Properties) and [Kerry Properties](/wiki/Kerry_Properties). ## Geography Loyang Industrial Estate encompasses of three subzones, Loyang West, Loyang East and Flora Drive. The Town of Pasir Ris contains within it, four subzones, Pasir Ris Central, Pasir Ris West, Pasir Ris Drive and Pasir Ris Park. Although Pasir Ris Wafer Fabrication Park is not a part of the Loyang Industrial Estate, it still functions as its own individual subzone nonetheless. In total, the entire planning area has eight subzones. Pasir Ris has some hills less than 40 metres in height. Since 2014, these hills have been flattened to make way for upcoming residential development. ### Political boundaries Pasir Ris comes politically under the [Pasir Ris-Punggol Group Representation Constituency](/wiki/Pasir_Ris-Punggol_Group_Representation_Constituency) from 2001 to 2025 (later replaced by [Pasir Ris-Changi GRC](/wiki/Pasir_Ris-Changi_Group_Representation_Constituency)) and [Pasir Ris Group Representation Constituency](/wiki/Pasir_Ris_Group_Representation_Constituency) from 1997 to 2001. After the [general election in 2001](/wiki/2001_Singapore_general_election), a large part of the former Pasir Ris Central Division and the Pasir Ris-Loyang Division came together as Pasir Ris East with [Mohamed Sharael Taha](/wiki/Mohamed_Sharael_Taha) as the Member of Parliament (MP) since 2020. Pasir Ris West consists of Elias housing estate and the western area of Pasir Ris and its Member of Parliament being Minister in Prime Minister's Office [Indranee Rajah](/wiki/Indranee_Rajah) after the retirement of [Teo Chee Hean](/wiki/Teo_Chee_Hean) in 2025. In conjunction with the expansion of Pasir Ris-Punggol Group Representation Constituency (GRC), a Community Club scaling six storeys high, was built in Pasir Ris East. In October 2004, Pasir Ris West also saw the completion of [Pasir Ris Elias Community Club](/wiki/Pasir_Ris_Elias_Community_Club). Portions of the Pasir Ris West (notably White Sands and [Pasir Ris Park](/wiki/Pasir_Ris_Park)) were also carved ahead of the [2020 elections](/wiki/2020_Singapore_general_election) and formed the Pasir Ris Central division, in which [Desmond Tan](/wiki/Desmond_Tan_(politician)) was the MP. Portions of Pasir Ris East (which is just at the last end of Loyang) were carved ahead of 2025 elections and formed the Changi division, in which [Valerie Lee](/wiki/Valerie_Lee) is the MP. ## Architecture The architecture of [Housing and Development Board](/wiki/Housing_and_Development_Board) (HDB) blocks in Pasir Ris is inspired by the nearby beach and sea elements. This can be seen in the lighthouse-shaped turrets formed by columns of balconies, void deck and precinct boundary walls with porthole-shaped openings, and windows/balconies framed within clam-shaped openings. ## Amenities ### Recreation In proximity to the sea, Pasir Ris has several [recreation](/wiki/Recreation) areas such as the [NTUC Downtown East](/wiki/NTUC_Downtown_East), [chalets](/wiki/Chalet), [Wild Wild Wet](/wiki/Wild_Wild_Wet), a park for pets and pet owners and [Pasir Ris Park](/wiki/Pasir_Ris_Park). There is also another park by the name of [Pasir Ris Town Park](/wiki/Pasir_Ris_Town_Park), close to where [White Sands Shopping Mall](/wiki/White_Sands_Shopping_Mall,_Singapore) is located. The park sports a park connector, a playground, an eatery and a fishing pond. However, a section of the park has been removed to build the Pasir Ris Central Hawker Center and Pasir Ris Sports Centre with facilities such as swimming pools, a sports hall to be used mainly for [badminton](/wiki/Badminton), a street soccer court, and also a [gym](/wiki/Gym). #### Downtown East As Singapore's premier and largest lifestyle and recreational hubs, [Downtown East](/wiki/NTUC_Downtown_East) is a one-stop leisure, lifestyle, and dining destination for the public to enjoy a wide variety of entertainment options at affordable prices. Downtown East currently comprises D'Resort, [Wild Wild Wet](/wiki/Wild_Wild_Wet), Market Square (E!Avenue and E!Hub), and MUCE (Membership & Union Community Engagement). E!Hub, a four-storey shopping and entertainment complex with a cinema, was completed in 2008. The site was previously a bowling alley building. As of 2019, the Orchid Bowl bowling alley in E!Hub has been closed to expand the retail floor of the complex. Aside from Wild Wild Wet, the area previously had another theme park, [Escape Theme Park](/wiki/Escape_Theme_Park), which opened in 2000. However, it ceased operations in 2011 to make way for the expansion of Wild Wild Wet and Singapore's first nature-inspired resort - D'Resort. Other than Escape Theme Park, Costa Sands Resort (Downtown East) also ceased operations after 25 years to make way for the expansion. #### Lorong Halus Wetland Formally a sewage disposal centre and landfill, the [Public Utilities Board](/wiki/Public_Utilities_Board_(Singapore)) (PUB) converted a portion of the site into a [wetland](/wiki/Wetland) in 2011 in tandem with the construction of the [Serangoon Reservoir](/wiki/Serangoon_Reservoir). The Lorong Halus Wetland is located along the eastern bank of the reservoir and acts as a \"facility\" by collecting and treating water passing through the former landfill, preventing it from flowing into the clean reservoir, therefore helping to safeguard the quality of the water in the reservoir. The wetland is a favourite bird-watching spot in the eastern side of Singapore, where there are guided walks for participants to bird-watch while discovering the relationship between clean water and a thriving wildlife. The \"Instagram-famous\" Lorong Halus Red Bridge is also located in the area, linking the wetland to the [Punggol Waterway](/wiki/Punggol_Waterway_Park) in [Punggol](/wiki/Punggol), across the [Serangoon River](/wiki/Serangoon_River). ### Industry Pasir Ris is also part of the [Jurong Town Corporation](/wiki/Jurong_Town_Corporation)'s plan to develop [wafer](/wiki/Wafer_(electronics)) fabrication facilities in Singapore. The other two locations are [Tampines](/wiki/Tampines) and [Woodlands](/wiki/Woodlands,_Singapore). Presently, there are two major wafer fabrication parks in Pasir Ris. Companies situated there include [United Microelectronics Corporation](/wiki/United_Microelectronics_Corporation) and [SSMC](/wiki/Systems_on_Silicon_Manufacturing). ### Education As of 2019[update], the area has a total of 6 primary schools, 4 secondary schools and Tampines Meridian Junior College. As part of a rationalisation exercise, Coral Primary School merged with White Sands Primary School in 2019, and Loyang Primary School merged with Casuarina Primary School in the same year. Three secondary schools, Coral Secondary School, Greenview Secondary School, and Siglap Secondary School were closed down and merged with existing schools as a result of a rationalisation exercise since March 2016. There is one international school, Overseas Family School. #### Primary schools - Casuarina Primary School - Elias Park Primary School - Meridian Primary School - Park View Primary School - Pasir Ris Primary School - White Sands Primary School #### Secondary schools - [Hai Sing Catholic School](/wiki/Hai_Sing_Catholic_School) - [Loyang View Secondary School](/wiki/Loyang_Secondary_School) - [Meridian Secondary School](/wiki/Meridian_Secondary_School) - [Pasir Ris Crest Secondary School](/wiki/Pasir_Ris_Crest_Secondary_School) #### Tertiary institutions - [Tampines Meridian Junior College](/wiki/Tampines_Meridian_Junior_College) #### International schools - [Overseas Family School](/wiki/Overseas_Family_School) #### Defunct schools - Coral Primary School - Loyang Primary School - Coral Secondary School - Greenview Secondary School - Siglap Secondary School ### Places of worship As of 2019[update], the area has two Buddhist temples, one Chinese temple, one Catholic church, one mosque and five churches of other Christian denominations. #### Buddhist temples - Sakya Tenphel Ling Temple - [Tzu Chi Singapore](/wiki/Tzu_Chi_Singapore) #### Chinese temple - [Loyang Tua Pek Kong Temple](/wiki/Loyang_Tua_Pek_Kong_Temple) #### Churches - Bethesda Pasir Ris Mission Church - Carmel Presby Church - Church of Divine Mercy - Riverlife Church - Shalom Bible-Presbyterian Church - Pentecost Methodist Church #### Mosque - Masjid Al-istighfar ### Commercial services As of 2024[update], the area has three shopping malls and four neighbourhood plazas; [White Sands Shopping Mall](/wiki/White_Sands_Shopping_Mall,_Singapore), [NTUC Downtown East](/wiki/NTUC_Downtown_East), Pasir Ris Mall, Loyang Point, Pasir Ris Drive 6 Neighbourhood Centre, Elias Mall and Pasir Ris West Plaza. In addition, there are two community centres, Pasir Ris East and Pasir Ris Elias (Pasir Ris West). Pasir Ris Central Hawker Center, which opened in January 2018, has 42 stalls and is the home-ground of traditional street food and hipster kitchens. ## Transportation ### Road network The [Tampines Expressway](/wiki/Tampines_Expressway) (TPE), which borders the area at the south, and arterial roads allows for easy movement within the town and link it to other parts of the country. There are two major roads in the area, namely Pasir Ris Drive 1 and Pasir Ris Drive 3, which cuts across the entire town with several bus services plying along the two roads. To provide ease of access for residents travelling between Pasir Ris and [Punggol](/wiki/Punggol), Pasir Ris Industrial Drive 1 was extended in end-2019 to link up with the interchange expansion between the [Kallang-Paya Lebar Expressway](/wiki/Kallang%E2%80%93Paya_Lebar_Expressway) (KPE) and Tampines Expressway (TPE). This new link road provides an additional and more direct route between the two towns and helps to ease traffic flow on the TPE. ### Mass Rapid Transit There is currently one [MRT](/wiki/Mass_Rapid_Transit_(Singapore)) station, Pasir Ris MRT station, serving the planning area across one line, [East West line](/wiki/East_West_MRT_line). By 2030, as part of the [Cross Island line](/wiki/Cross_Island_Line) Phase 1, Pasir Ris MRT station will be an interchange with the Cross Island line. The town will also see the addition of two new stations: [Loyang](/wiki/Loyang_MRT_station) and [Pasir Ris East](/wiki/Pasir_Ris_East_MRT_station), as part of the Cross Island line Phase 1. As part of the Cross Island line's Punggol Extension, Pasir Ris MRT station will also be the terminus for the extension when completed by 2032. As part of the extension, the town will also see the addition of one new station: [Elias](/wiki/Elias_MRT_station). ### Bus #### Bus interchange The planning area has one bus interchange, Pasir Ris Bus Interchange, serving the residents. The interchange has also been utilised as a shuttle pick-up/drop-off point for [NSmen](/wiki/NSmen) undergoing military training on [Pulau Tekong](/wiki/Pulau_Tekong). It is currently operated by [Go-Ahead Singapore](/wiki/Go-Ahead_Singapore) as part of the Loyang Bus Package under the [Bus Contracting Model](/wiki/Bus_contracting_model_of_Singapore) (BCM). As part of the Remaking Our Heartland 3 (ROH3) plans, part of the old bus interchange was demolished and replaced with a reconfigured interim interchange in July 2021 to allow works for the integrated development in the town centre. The construction of the air conditioned Pasir Ris Bus Interchange was completed in 2025 and opened on 27th April. #### Bus depot As part of the [Bus Contracting Model](/wiki/Bus_contracting_model_of_Singapore) (BCM), Loyang Bus Depot is built to house the operations of the Loyang Bus Package. The depot is currently operated by [Go-Ahead Singapore](/wiki/Go-Ahead_Singapore) and houses a total of 30 bus services mainly from [Pasir Ris Bus Interchange](/wiki/Pasir_Ris_Bus_Interchange) and [Punggol Bus Interchange](/wiki/Punggol_Temporary_Bus_Interchange), and a selected few from [Changi Village Bus Terminal](/wiki/Changi_Village_Bus_Terminal) and [Changi Airport PTB2 Bus Terminal](/wiki/Changi_Airport_PTB_1_%26_2_Bus_Terminal).\n",
  "language": "en",
  "processed_at": "2026-01-12T10:03:53.103190",
  "title": "Pasir Ris",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Church_of_Divine_Mercy,_Pasir_Ris"
}