{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:41:53.418179"
  },
  "content": "Bus interchange in Pasir Ris, Singapore **Pasir Ris Bus Interchange** is an air-conditioned [bus interchange](/wiki/Bus_station) located at [Pasir Ris](/wiki/Pasir_Ris) Town Centre, located inside the Pasir Ris 8 mixed-use development and is integrated with the Pasir Ris Mall. Apart from housing a bus interchange, the mixed-use development comprises a retail mall, condominium, town plaza, polyclinic and childcare facilities. It is located off Pasir Ris Drive 3, adjacent to [Pasir Ris MRT station](/wiki/Pasir_Ris_MRT_station) and near [White Sands Shopping Centre](/wiki/White_Sands_Shopping_Mall,_Singapore). It also serves as a pick-up/drop-off point for shuttle buses ferrying [NSFs](/wiki/Conscription_in_Singapore) heading to the SAF Ferry Terminal for their shuttle ferry to [Pulau Tekong](/wiki/Pulau_Tekong). ## History The interchange was built at a cost of S$2.7 million and opened on 10 December 1989, along with the [Eunos Bus Interchange](/wiki/Eunos_Bus_Interchange). The interchange provides bus connections around the Pasir Ris estate. Bus Service 403 was the first bus route in Pasir Ris from 1979, which previously terminated at Tampines Road terminus before being amended to the current route of looping at Pasir Ris Road. ## Bus Contracting Model Under the [Bus Contracting Model](/wiki/Bus_contracting_model_of_Singapore), all bus services operating from Pasir Ris Bus Interchange were divided into 5 Bus Packages, operated by two different bus operators. Bus Services under Loyang Bus Package started operations on 18 September 2016. ### List of Bus Services OperatorPackageRoutes**Go-Ahead Singapore**Loyang3 (on-route), 6, 12, 12e, 15, 17, 68, 354, 358, 358T, 359, 359T, 403, 518, 518A**SBS Transit**Bedok46Bishan-Toa Payoh21, 88Bukit Merah5Serangoon-Eunos58 ## Redevelopment Redevelopment of Pasir Ris Bus Interchange has started since 2019. The bus interchange underwent a reconfiguration on 3 July 2021, after which the western half of the old bus interchange will be demolished to facilitate the construction of the Pasir Ris Integrated Transport Hub (ITH) and Pasir Ris Rail Turnback, which will be completed by 2025, five years before the [Cross Island MRT line](/wiki/Cross_Island_Line) starts operations. The reconfigured interchange began operations on 3 July 2021 with inclusive facilities built as part of the relocation, and closed on 27 April 2025, in tandem with the opening of the Pasir Ris ITH. - Interchanges and Terminals (SBS Transit) This article related to bus transport is a stub. You can help Wikipedia by expanding it. - v - t - e This [Singapore](/wiki/Singapore) location article is a stub. You can help Wikipedia by expanding it. - v - t - e This article about transport in [Singapore](/wiki/Singapore) is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:41:53.417909",
  "title": "Pasir Ris Bus Interchange",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Pasir_Ris_Bus_Interchange"
}