{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:41:45.150083"
  },
  "content": "Subzone of Queenstown Planning Area, Singapore**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Pasir Panjang\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(March 2019)* *(Learn how and when to remove this message)*This article includes a list of general references, but **it lacks sufficient corresponding inline citations**. Please help to improve this article by introducing more precise citations. *(August 2021)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)*Subzone of Queenstown Planning Area **Pasir Panjang**[note 1] is an area located at the southern part of [Queenstown](/wiki/Queenstown,_Singapore) in [Singapore](/wiki/Singapore). [Kent Ridge Park](/wiki/Kent_Ridge_Park) is a topographical feature which runs adjacent to Pasir Panjang. ## History Pasir Panjang Road, which once hugged the [coastline](/wiki/Coastline), was laid down as far as the Jurong River by [John Turnbull Thomson](/wiki/John_Turnbull_Thomson) by 1850. Thomson was Government [Surveyor](/wiki/Surveyor_(surveying)) of Singapore from 1841 to 1853. In 1910, the Government took over the [opium](/wiki/Opium) industry and a state-owned factory was established at Pasir Panjang. In February 1942, the [Battle of Pasir Panjang](/wiki/Battle_of_Pasir_Panjang) took place here. This was one of Singapore's last major battle between the Japanese and the British armed forces. The Japanese victory resulted in the [Fall of Singapore](/wiki/Fall_of_Singapore). Many soldiers from the [1st Malaya Infantry Brigade](/wiki/1st_Malaya_Infantry_Brigade) such as [Adnan bin Saidi](/wiki/Adnan_bin_Saidi) died here. Since the late 1960s, the whole length of the coast, from the [Singapore River](/wiki/Singapore_River) to [Jurong](/wiki/Jurong), has been [reclaimed](/wiki/Land_reclamation) for [wharves](/wiki/Wharves), almost entirely devoted to [containerisation](/wiki/Containerization). The coastal area at Pasir Panjang has also been extensively reclaimed for the Pasir Panjang Terminal of the [Port of Singapore](/wiki/Port_of_Singapore). ## Highlights ### Pasir Panjang Pillbox [Pasir Panjang Pillbox](/wiki/Pasir_Panjang_Pillbox) is a concrete machine-gun pillbox built before the Japanese invasion of Malaya and Singapore and sits beside Pasir Panjang Road. During the war, it was on the coast; however, due to post war land reclamation, it is now .75 km from the sea. ### Pasir Panjang Terminal In 1993, the Port of Singapore Authority (PSA), now [corporatised](/wiki/Corporatization) as [PSA International](/wiki/PSA_International), started constructing a new [container terminal](/wiki/Container_terminal) at Pasir Panjang, the Pasir Panjang Terminal. it is located approximately 7 km west of the company's other container terminals at [Keppel Harbour](/wiki/Keppel_Harbour). This new, [S$](/wiki/S$)7 billion terminal, represents an immense expansion of PSA's container port. When fully completed in 2009, it is expected to raise PSA's container handling capacity by a further 18 million [twenty-foot equivalent units](/wiki/Twenty-foot_equivalent_unit) (TEU) per year. The terminal's first four [berths](/wiki/Berth_(moorings)), of the planned 26, opened in 1998, with two more berths becoming operational by the time of the terminal's official opening in March 2000. The terminal is slated to cease operations by the year 2040 when the Tuas Megaport is completed and all of PSA assets will be transferred to the new port. [COSCO Shipping Ports](/wiki/COSCO_Shipping_Ports), formerly [COSCO Pacific](/wiki/COSCO_Pacific), is a co-investor. ### Old Pasir Panjang Police Sub-station In 1986, the old [Singapore Police Force](/wiki/Singapore_Police_Force) Pasir Panjang Police Sub-station was vacated after almost four decades of service, its duty and areas of jurisdiction taken over by Pasir Panjang NPP and West Coast NPP respectively. Originally constructed in 1950, its location near the crossroad junction of Clementi Road, Pasir Panjang Road and West Coast Road provided the local residents of the many Malay kampungs dotted around the road and area with the security of a police presence. The old building was torn down in 1991 and the land levelled. The site is now a new condominium apartment – *The Spectrum*, which is built directly over the old police building and the surrounding land. ### Poh Ern Shih Temple [Poh Ern Shih Temple](/wiki/Poh_Ern_Shih_Temple) (报恩寺) was built in 1954 by the famous businessman and devoted Buddhist, Mr [Lee Choon Seng](/wiki/Lee_Choon_Seng). The Buddhist temple was dedicated to [Kṣitigarbha](/wiki/K%E1%B9%A3itigarbha) [Bodhisattva](/wiki/Bodhisattva) and was built as a memorial to those who lost their lives during the Battle of Pasir Panjang in 1942. It is located on a small hilltop at Chwee Chian Road, off Pasir Panjang Road, along Singapore's southern coast. ## Notes - Victor R Savage, Brenda S A Yeoh (2003), *Toponymics – A Study of Singapore Street Names*, Eastern Universities Press, [ISBN](/wiki/ISBN_(identifier)) 981-210-205-1 - Norman Edwards, Peter Keys (1996), *Singapore – A Guide to Buildings, Streets, Places*, Times Books International, [ISBN](/wiki/ISBN_(identifier)) 9971-65-231-5 - National Heritage Board (2002), *Singapore's 100 Historic Places*, Archipelago Press, [ISBN](/wiki/ISBN_(identifier)) 981-4068-23-3 - Pasir Panjang Heritage webpage. – Habitatnews webpage on history and nature of the area\n",
  "language": "en",
  "processed_at": "2026-01-12T11:41:45.149783",
  "title": "Pasir Panjang",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Pasir_Panjang"
}