{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:42:02.557613"
  },
  "content": "This article **relies largely or entirely on a single source**. Relevant discussion may be found on the talk page. Please help improve this article by introducing citations to additional sources. *Find sources:* \"Paul Abisheganaden\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(July 2018)*Musical artist **Paul Selvaraj Abisheganaden** (27 March 1914 in [Penang](/wiki/Penang) – 31 August 2011 in [Singapore](/wiki/Singapore)) was a [Singaporean](/wiki/Singapore) [conductor](/wiki/Conducting) and 1986 [Cultural Medallion](/wiki/Cultural_Medallion) recipient for his contributions to music. ## Education Abisheganaden was educated at Serangoon English School and [St Andrew's School](/wiki/Saint_Andrew%27s_School,_Singapore), passing his Senior Cambridge examinations in 1931. He studied arts subjects at [Raffles College](/wiki/Raffles_College) and graduated with a Diploma in the Arts in 1934. ## Career Abisheganaden joined the education service and taught at the Geylang English School, where he composed the music and lyric for what was to be the first school anthem, entitled the \"Geylang English School Song\". Paul is credited with championing and reviving [classical music](/wiki/Classical_music) in Singapore during the 1940s and 1950s. He founded one of the country's first string ensembles. As an educator, he was the principal of [Victoria School](/wiki/Victoria_School) from 1959 to 1961 and the principal of Teacher's Training College from 1963 to 1968. He later taught in the music department of the [National University of Singapore](/wiki/National_University_of_Singapore) for decades. ## Personal life Abisheganaden died on 31 August 2011, at [National University Hospital](/wiki/National_University_Hospital) in Singapore at the age of 97. He was survived by three daughters, eight grandchildren and ten great-grandchildren. He was predeceased by his wife. His younger brother, [Alex Abisheganaden](/wiki/Alex_Abisheganaden), was a [classical guitarist](/wiki/Classical_guitarist). Abisheganaden's funeral service was held on 3 September 2011, at [St Andrew's Cathedral](/wiki/St_Andrew%27s_Cathedral,_Singapore), where he served as choir master. - Singapore National Library: Paul Abisheganaden\n",
  "language": "en",
  "processed_at": "2026-01-12T11:42:02.557306",
  "title": "Paul Abisheganaden",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Paul_Abisheganaden"
}