{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:42:19.693161"
  },
  "content": "Residential skyscraper in SingaporeThis article includes a list of general references, but **it lacks sufficient corresponding inline citations**. Please help to improve this article by introducing more precise citations. *(September 2022)* *(Learn how and when to remove this message)* **Pearl Bank Apartments** ([Chinese](/wiki/Simplified_Chinese_characters): 珍珠苑; [pinyin](/wiki/Pinyin): *Zhēnzhū yuàn*) was a high-rise private [residential building](/wiki/Residential_building) on [Pearl's Hill](/wiki/Pearl%27s_Hill) in [Outram](/wiki/Outram,_Singapore), near the [Chinatown](/wiki/Chinatown,_Singapore) area of Singapore. As the tallest and densest residential building in Singapore when completed in June 1976, Pearl Bank Apartments was one of Singapore's pioneers of high-rise high-density living and influenced urban development in Singapore and other cities across Southeast Asia. ## History The Pearl Bank Apartments was the first all-housing project to be undertaken in the [Urban Renewal](/wiki/Urban_renewal) Department of the [Housing and Development Board](/wiki/Housing_and_Development_Board)'s Sale of Sites programme. It was the programme's third sale in 1969, aimed at rejuvenating the Central Area and providing more residential options for the middle and upper-middle families. Pearl Bank Apartments was one of the responses and initiatives introduced to intensify land use for residential purposes, alongside [People's Park Complex](/wiki/People%27s_Park_Complex) located just nearby in Chinatown and [Golden Mile Complex](/wiki/Golden_Mile_Complex) on the eastern edge of Singapore's Central Business District (CBD). With a height of 113 m (371 ft), the Pearl Bank Apartments was the tallest residential building in Singapore when it was completed in June 1976. It sat on a 8,000 m2 (86,000 sq ft) 99-year [leasehold](/wiki/Leasehold) site. ### Sale of Site On 4 August 2007, the Pearl Bank Apartments site was put up for an *en bloc* sale. The tender closed on 18 September 2007, but fetched no bids. Another tender closed on 19 February 2008, failing again, and the collective sale agreement lapsed on 1 August 2008. On 13 February 2018, Pearl Bank Apartments was finally sold to [CapitaLand](/wiki/CapitaLand) for $728 million in a private treaty collective sale at the residents' reserved price. Owners received their payouts as well as a notice to move out of Pearl Bank Apartments by end-April 2019. Whereas the existing blocks had only 280 units of generally larger sizes, CapitaLand said it planned for around 800 units for the replacement. There was no mention of preserving the old structure. ## Architecture The architecture of the building is observed to be influenced by [Brutalism](/wiki/Brutalist_architecture), a popular [architectural style](/wiki/Architectural_style), not just in Singapore but around the world, during the 1970s. It was designed by Singaporean architect [Tan Cheng Siong](/wiki/Tan_Cheng_Siong_(architect)) of Archurban Architects Planners who took inspiration in the resemblance of the site to an airplane tail (the area of Pearl Bank Apartments is roughly in the shape of a triangle when viewed from the sky looking down). It would eventually lead to the idea of a high-rise tower that rivals the peak of [Bukit Timah Hill](/wiki/Bukit_Timah_Hill) (the tallest natural point on the island) to take advantage of the panoramic view of Singapore. The Pearl Bank Apartments consisted of a 38-storey hollow ¾ cylindrical tower, resembling a horseshoe, designed for a total occupancy of 1,500 persons. When completed in 1976, the building had the largest number of apartments contained in a single block, a grand total of 280, and had the highest density of any private modern residential building at 1,853 persons per [hectare](/wiki/Hectare). The horseshoe shape of the tower was designed for efficiency as it was economical in terms of material used, offering the smallest wall-to-floor ratio. Its cylindrical shape allowed for daylight, ventilation and maximum panoramic views to all its units and connected residents to their neighbours; the opening in the circular structure faced west and minimised direct penetration of heat and light from the afternoon sun into the building. The slits in the circular slab also allowed for effective ventilation into the internal courtyard. The tower enveloped an inner void spanning 30 m facing the building's internal central courtyard. The building's facade bears striking resemblance to the [Lai Tak Tsuen](/wiki/Lai_Tak_Tsuen) apartments in Hong Kong. The 280-unit apartment block comprised three types of [split-level](/wiki/Split-level) units – 48 two-bedroom (130 m2 (1,400 sq ft)), 184 three-bedroom (176.5 m2 (1,900 sq ft)) and 40 four-bedroom (213.7 m2 (2,300 sq ft)) dwellings, with eight units to each floor – and an additional eight [penthouses](/wiki/Penthouse_apartment). There was a shopping area with seven units on the first storey and the building had a four-storey carpark located next to the [driveway](/wiki/Driveway) leading to the building's lobby on Pearl Bank. The 28th storey was devoted for community use, known as the \"Sky Park\", similar to a [void deck](/wiki/Void_deck) in HDB flats all around Singapore. The effect of the split-level architectural approach in the spatial planning was expressed as an important facet of the building. Each apartment unit is further zoned into \"public\" and \"private\" areas to offer maximum exclusivity and views to the occupants. The dry areas such as the bedrooms and living rooms were located on the outer rim whereas the utilities and service areas were located at the rear of the apartments, overlooking the building's central courtyard, to avoid any obstruction of the view. The building's structure comprised ten radiating [shear walls](/wiki/Shear_wall) which also served as [party walls](/wiki/Party_wall) between the units. These elements, along with the additional structural columns and lift cores, followed the radial form of the building and enhanced the façade. Shanghai plaster was used on the outer rim of the building and painted plastered walls on the inner rim. Originally unpainted on the outer façade, with the raw concrete visibly showing, the building was painted cream with orange details (such as the inner-rim connecting staircases) in 2008. ### Construction difficulties > \"Pearl Bank was completed in 1976 because it took a bit of time, with difficulties in construction and financing; building such a building in those days was rather taxing, especially when many new technologies needed to be employed. Because there was no precedent to the construction of such a high building locally, financing the project involved great risks. As architects, we had to struggle to work with the developer to reduce the costs, making sure things worked economically, and convince the bankers of our methods.\" — Tan Cheng Siong, architect of Pearl Bank Apartments In a bid to complete the construction of the apartments in the shortest time possible in the 1970s and without any local precedents found for such high-rise buildings, new technologies were employed. Particularly, the [slip-form](/wiki/Slip_forming) construction technique was employed on a residential development in Singapore for the first time. With the specified construction method, a building speed of two days per storey, which was quite fast for the time, was achievable. However, the speed of construction of the vertical members were erected in such short time that the horizontal members experienced a hard time catching up. Furthermore, the wooden slip-platform caught fire in an accident as well, further delaying the construction for a few months. After piling started in the early 1970s in midst of a property boom, construction was further delayed as well due to material and labour shortages. However, by the end of the early 1970s, everything was almost back on track, leading to the building's completion in 1976. ## Conservation Efforts The Singapore [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) (URA) had previously agreed that there were merits to conserving the apartments as it had been one of the pioneering high-rise residential projects of a developing Singapore as well as being the precedent of future high-rise residential developments. Conservation efforts were spearheaded by architects, the owners, heritage-lovers as well as students to preserve Pearl Bank Apartments for its high architectural and historical significance and value. American architect Ed Poole, who moved into a penthouse unit in the apartments in 2000, started rallying against the multiple en-bloc attempts by opening the website, pearlbankapartments.com, which is now defunct. Poole was determined to transform the image of Pearl Bank Apartments which had become known as a dormitory for foreign workers into the residential heritage icon it was claimed to be. Various media publications were published as well exploring the narrative and the significance of the apartments for the country's historical and architectural advancement as well as the residents' emotional attachments to the unique architecture, which can almost never be found elsewhere in the world. Many of the residents' stances that lead towards en-bloc is mostly due to the looming expiry of the 99-year land-lease as well as the apparent deterioration of the building. Residents cited many of the building's infrastructure had been failing, such as water and piping leakage, the general unfriendly physical environment for elderly (and the disabled), lifts often breaking down and rat infestations. While many were reluctant to move and would choose to stay if they could, the uncertainty of the building ever getting any better was looming. The value of the property decreases as more time goes by as well. In 2012, the building's principal architect Tan Cheng Siong and the owners proposed a voluntary conservation project. As concerns were that the apartments did not meet the conditions of \"land use intensification or urban rejuvenation\" as well as the deteriorating conditions of the building, Tan had proposed to increase the gross floor area of Pearl Bank Apartments. The proposal was to build on top of the four-storey carpark and build a new block of 150 apartments and to include additional communal spaces such as an [infinity pool](/wiki/Infinity_pool) and refurbish the current tower. The sale of the apartments would pay for both the refurbishments and the topping up of the apartment's 99-year lease and hence would not require any money from the tenants. Although about 91% of the tenants signed up for the project, it fell short of the 100% approval needed by URA to proceed with the conservation. This created a dissatisfaction among the pro-conservation group as en-bloc only requires 80% of the consensus to proceed. As such, the voluntary conservation project was not able to proceed and was scrapped. After en-bloc, Pearl Bank Management Corporation Strate Title (MCST) chairman Cecilia Seet noted that there was no conservation mentioned in the collective sale agreement. Thus, possibly to the chagrin of those in favour of holding on to Pearl Bank Apartments, it was unlikely for the building to be conserved. Instead, CapitaLand promised to incorporate and blend \"heritage elements with modern aesthetics\" to reflect the culture of [Chinatown](/wiki/Chinatown,_Singapore) stemming from the existing structure. ### Redevelopment of site In May 2019, a 39-storey condominium to be named **One Pearl Bank** was unveiled by CapitaLand as its replacement by 2023. It features two curved towers at 178m, connected by a \"halo\" sky bridge that will light up like a beacon at night. One Pearl Bank is designed by Serie+Multiply, a joint venture between London-based Serie Architects and Singapore-based Multiply Architects. The development will house a total of 774 apartments. - Wong Yunn Chii (2005), *Singapore 1:1 City: A Gallery of Architecture & Urban Design*, [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority), [ISBN](/wiki/ISBN_(identifier)) 981-05-4467-7 - Norman Edwards, Peter Keys (1996), *Singapore – A Guide to Buildings, Streets, Places*, Times Books International, [ISBN](/wiki/ISBN_(identifier)) 9971-65-231-5 - \"Singapore Infopedia: Pearl's Hill\". [National Library Board](/wiki/National_Library_Board). Archived from the original on 4 July 2007. Retrieved 9 August 2007. - \"Singapore 1:1 City: Pearl Bank Apartments\". *[Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority)*. Archived from the original on 13 August 2007. Retrieved 9 August 2007. - \"Saving Pearl Bank Apartments\". Zhuang, Justin. BiblioAsia. Retrieved 7 March 2019. - Geraldine Quek C.T., Neo J. H. Kevin Josiah, Lim Y. L. Teri (2015), *Conservation Conversations - Pearl Bank Apartments (2015)*, [ISBN](/wiki/ISBN_(identifier)) 978-981-09-7016-1 - One Pearl Bank Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:42:19.692888",
  "title": "Pearl Bank Apartments",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Pearl_Bank_Apartments"
}