{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:42:22.946753"
  },
  "content": "1992 novel by Johann S. Lee**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Peculiar Chris\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(November 2018)* *(Learn how and when to remove this message)*The topic of this article **may not meet Wikipedia's notability guideline for books**. Please help to demonstrate the notability of the topic by citing reliable secondary sources that are independent of the topic and provide significant coverage of it beyond a mere trivial mention. If notability cannot be shown, the article is likely to be merged, redirected, or deleted. *Find sources:* \"Peculiar Chris\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(November 2018)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* ***Peculiar Chris*** is a novel which deals with [gay](/wiki/Gay) themes by Johann S. Lee, published in Singapore by Cannon International in 1992. Lee wrote the book, his first novel,: 54 while doing his [National Service](/wiki/National_Service) in Singapore at the age of 19. It was published a year later. The book recounts the coming of age, and coming out, of Chris through his experience with the deaths of his father and his lover Samuel,: 54 the latter from [AIDS](/wiki/AIDS). Chris meets his first lover, Kenneth, in Singapore, where Kenneth has traveled from Indonesia to study; he meets his second lover, Jack, in Sydney after he travels to Australia to come out, and leaves for London, the birthplace of *[Maurice](/wiki/Maurice_(novel))*, after Samuel's death. It is also noteworthy for documenting how the military bureaucracy reacts when a soldier comes out in Singapore. The book was translated into Italian in 1997, under the shortened title of 'Chris'. Singaporean playwright [Alfian Sa'at](/wiki/Alfian_Sa%27at) adapted the novel into the play *Happy Endings: Asian Boys Vol. 3*. It was staged by [W!LD RICE](/wiki/W!LD_RICE), a Singapore theatre company, from 11 to 29 July 2007. It was reprinted in 2008. This article about a novel of the 1990s with a [lesbian](/wiki/Lesbian), [gay](/wiki/Gay), [bisexual](/wiki/Bisexuality), [transgender](/wiki/Transgender), or [queer](/wiki/Queer) theme is a stub. You can help Wikipedia by expanding it. See guidelines for writing about novels. Further suggestions might be found on the article's talk page. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:42:22.946445",
  "title": "Peculiar Chris",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Peculiar_Chris"
}