{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:42:40.468908"
  },
  "content": "Singaporean political party The **People's Power Party** (**PPP**) is a [political party](/wiki/List_of_political_parties_in_Singapore) in Singapore. Founded in 2015 by politician [Goh Meng Seng](/wiki/Goh_Meng_Seng), the PPP first contested in [Chua Chu Kang Group Representation Constituency](/wiki/Chua_Chu_Kang_Group_Representation_Constituency) (GRC) in the [2015 general election](/wiki/2015_Singaporean_general_election), being unsuccessful following their loss to the [People's Action Party](/wiki/People%27s_Action_Party) (PAP). Ahead of the [2020 general election](/wiki/2020_Singaporean_general_election), the PPP had discussed forming a coalition with other opposition parties in 2018, and attempted to join the [Singapore Democratic Alliance](/wiki/Singapore_Democratic_Alliance) in 2020. Later during the 2020 general election, the PPP only fielded one candidate, Goh, who was unsuccessful against PAP's [Tin Pei Ling](/wiki/Tin_Pei_Ling) in [MacPherson Single Member Constituency](/wiki/MacPherson_Single_Member_Constituency) (SMC). In 2024, they formed the [People's Alliance for Reform](/wiki/People%27s_Alliance_for_Reform) with the [Democratic Progressive Party](/wiki/Democratic_Progressive_Party_(Singapore)), [Reform Party](/wiki/Reform_Party_(Singapore)), and [Peoples Voice](/wiki/Peoples_Voice_(Singapore)), but left the coalition following differences in strategies. During the [2025 general election](/wiki/2025_Singaporean_general_election), they contested in two constituencies – [Ang Mo Kio](/wiki/Ang_Mo_Kio_Group_Representation_Constituency) and [Tampines GRCs](/wiki/Tampines_Group_Representation_Constituency) – but were highly unsuccessful in either of them, and lost a total of [S$](/wiki/Singapore_dollar)135,000 in [election deposits](/wiki/Election_deposit) as they did not meet the 12.5% vote threshold.[a] They are known for their [anti-vaccine stance](/wiki/Anti-vaccine_stance) during the [COVID-19 pandemic](/wiki/COVID-19_pandemic_in_Singapore) and [anti-LGBTQ rhetoric](/wiki/Anti-LGBTQ_rhetoric) during the 2025 general election. Goh has served as the leader of the PPP since its founding. The PPP has been characterised as a \"mosquito party\", a local term used to describe [frivolous political parties](/wiki/List_of_frivolous_political_parties) in Singapore that lack meaningful public support, with their candidates and members frequently attracting ridicule rather than serious consideration from voters. ## History and political development ### 2015: Formation and first election contest The PPP was formed by politician [Goh Meng Seng](/wiki/Goh_Meng_Seng) on 16 July 2015 just a few months prior to the [election](/wiki/2015_Singaporean_general_election) held that year. He advocated a governance system based on [Sun Yat-sen](/wiki/Sun_Yat-sen)'s principles of the [Separation of Five Powers](/wiki/Constitution_of_the_Republic_of_China#Separation_of_Five_Powers_(Yuan)). Goh had previously served as a member of the [Worker's Party](/wiki/Workers%27_Party_of_Singapore) (WP) and [National Solidarity Party](/wiki/National_Solidarity_Party_(Singapore)) (NSP), in (/wiki/2006_Singaporean_general_election) and (/wiki/2011_Singaporean_general_election), respectively. In the aftermath of the 2011 election, Goh resigned from the NSP's secretary-general position and relinquished his party membership. The PPP first contested in [Singapore's general elections](/wiki/General_elections_in_Singapore) in the [2015 general election](/wiki/2015_Singaporean_general_election). It contested the four-member [Chua Chu Kang Group Representation Constituency](/wiki/Chua_Chu_Kang_Group_Representation_Constituency) (GRC), with a team consisting of Goh, Lee Tze Shih, Low Wai Choo, and former NSP member Syafarin Sarif, against the [People's Action Party](/wiki/People%27s_Action_Party) (PAP) team of [Gan Kim Yong](/wiki/Gan_Kim_Yong), [Low Yen Ling](/wiki/Low_Yen_Ling), [Zaqy Mohamad](/wiki/Zaqy_Mohamad) and Yee Chia Hsing. The PPP team lost the contest with 25,460 votes, a vote share of 23.11%. Goh was surprised by the number of voters that turned out to vote for the PPP, as they were among the worst performing candidates in the election despite his status as a veteran politician. He claimed that this was as his party lacked media coverage. Shortly after the election, he returned to [Hong Kong](/wiki/Hong_Kong) to reside with his family. ### 2016–2023: Political alliance and 2020 general election In 2018, PPP along with six other opposition parties: [Democratic Progressive Party](/wiki/Democratic_Progressive_Party_(Singapore)) (DPP), NSP, [Reform Party](/wiki/Reform_Party_(Singapore)) (RP), [Singapore Democratic Party](/wiki/Singapore_Democratic_Party) (SDP), [Singaporeans First](/wiki/Singaporeans_First) (SF), and [Peoples Voice](/wiki/Peoples_Voice_(Singapore)) (PV), and led by former PAP member of parliament and presidential candidate [Tan Cheng Bock](/wiki/Tan_Cheng_Bock), discussed the possibility of forming a coalition for the next election. In March 2020, the PPP, SF, RP and DPP applied to join the [Singapore Democratic Alliance](/wiki/Singapore_Democratic_Alliance) (SDA). The PPP participated in the [2020 general election](/wiki/2020_Singaporean_general_election), fielding their only candidate Goh to contest the [MacPherson Single Member Constituency](/wiki/MacPherson_SMC) (SMC). On 27 June, Goh confirmed that this was to be his final election, reiterating his belief that he could contribute more to Parliament as an opposition member if elected, while praising the incumbent [Tin Pei Ling](/wiki/Tin_Pei_Ling) for her dedication. Goh was defeated by a 71.74% to 28.26% vote share. ### 2024–present: 2025 general election In May 2024, PPP suggested to temporarily suspend [COVID-19 vaccination in Singapore](/wiki/COVID-19_vaccination_in_Singapore) \"in response to an increasing number of reports indicating significant adverse effects\" of such vaccines. [Ministry of Health of Singapore](/wiki/Ministry_of_Health_(Singapore)) rejected the calls, citing works referred by PPP had either been debunked or not written by authors cited by PPP. By 21 November 2024, the PPP had formed the [People's Alliance for Reform](/wiki/People%27s_Alliance_for_Reform) (PAR) with three other parties: DPP, RP, and PV. On 23 February 2025, it was announced that the PPP had withdrawn from the coalition, citing strategic differences, though it was stated that the PPP would remain open to future collaboration with PAR. After the [release of the new electoral boundaries](/wiki/Electoral_boundary_changes_of_the_2025_Singaporean_general_election), Goh reversed his commitment not to contest [the election](/wiki/2025_Singaporean_general_election). On 3 March 2025, he announced on a Facebook post that the PPP would be contesting [Nee Soon GRC](/wiki/Nee_Soon_GRC) due to believing that PAP might field a \"well known LGBTQ activist\" in the area. Goh stated that his party took a \"firm stance\" against the \"LGBTQ agenda\", as they viewed it as a threat to the \"sustainability\" of Singapore’s population growth. It was also announced that the party would be running in [Tampines GRC](/wiki/Tampines_GRC), [Ang Mo Kio GRC](/wiki/Ang_Mo_Kio_GRC), [Tampines Changkat SMC](/wiki/Tampines_Changkat_Single_Member_Constituency), and [Jalan Kayu SMC](/wiki/Jalan_Kayu_SMC). This appeared to conflict with the plans of other opposition parties, such as [Red Dot United](/wiki/Red_Dot_United) (RDU) and PAR. Later on 16 March, Goh revealed he would be \"glad\" to withdraw from the competition in Nee Soon GRC, provided the PAP did not field the aforementioned activist. Subsequently, the PPP did so on 22 March under an agreement that would allow RDU to have a \"clean fight\" with the PAP team there. On 22 April, PPP announced they would withdraw from contesting Jalan Kayu and Tampines Changkat SMCs while continuing to contest both Tampines and Ang Mo Kio GRCs. During the rallies for the election, Goh also attacked other opposition parties. He repeatedly accused the [Workers' Party](/wiki/Workers%27_Party_(Singapore)) (WP) and [Pritam Singh](/wiki/Pritam_Singh), secretary-general of WP, of \"betraying voters\" of [Marine Parade–Braddell Heights](/wiki/Marine_Parade%E2%80%93Braddell_Heights_Group_Representation_Constituency) by not contesting in said GRC at the last minute without informing the other opposition parties. In one rally, he also abruptly stated that he would like to not be asked about Singh again, stating \"I'm not interested in him. I'm not gay.\" Other speakers at PPP's rallies also alluded WP of being in \"alliance with the PAP\" that electing WP would have elected PAP but in blue. The 2025 general election saw the PPP losing in both Ang Mo Kio and Tampines GRCs. In Ang Mo Kio GRC, PPP received slightly over 10 percent of the votes, similar to the [Singapore United Party](/wiki/Singapore_United_Party) (SUP), while PAP won a decisive victory of almost 80 percent of the votes. The party received less than 1% of the votes in Tampines GRC, similar to the NSP, while the PAP and WP garnered 52% and 47% respectively. As a result, both teams forfeited their $67,500 deposit each (a total of $135,000) for polling less than 12.5% of valid votes in their respective contested constituencies. With the release of the results, Goh was reportedly demoralised, having sold his property to finance the PPP's campaign and stated that he did not plan to return to politics until he amassed enough money to contest again. ## Manifesto ### Policies The PPP firmly believes that democracy provides the necessary balance of powers needed for the long-term stability of Singapore. This is achieved through the distinct separation of five powers, which are: 1. Executive 2. Legislative 3. Judiciary 4. Impeachment 5. Selection The PPP finds that in order to achieve an effective and functioning democracy via separation of these five powers, the [President of Singapore](/wiki/President_of_Singapore) should be empowered to effectively oversee the faculties of *Impeachment* and *Selection* in the form of: - [Corruption Practice Investigation Bureau (CPIB)](/wiki/Corrupt_Practices_Investigation_Bureau) - Ombudsman Commission - Equal Opportunity Commission - [Elections Department (ELD)](/wiki/Elections_Department_Singapore) - [Public Service Commission (PSC)](/wiki/Public_Service_Commission_(Singapore)) In contrast, there are only three branches (Judiciary, Executive and Legislative) of the state as of 2025, and the [President](/wiki/President_of_Singapore), as head of state, does not fall into any of the branches. For the 2025 general elections, the PPP had published an eight-point manifesto: 1. Singaporean-First Policy 2. Medical Freedom and Rights 3. Lower Cost of Living 4. Housing & CPF Reform 5. Affordable Healthcare 6. Population Policy 7. Stronger Families 8. Better Governance ## Controversies and ridicule The PPP is commonly labelled a \"mosquito party\", a local expression for [frivolous political parties](/wiki/List_of_frivolous_political_parties) in Singapore that attract little genuine backing, with their candidates and members often treated more as objects of mockery than as serious political contenders. ### Samuel Lee In late April 2025, PPP candidate Samuel Lee became famous on the internet after a video of him lamenting his struggle to find a \"career oath\" through singing parodies of the Chinese song 我是一只小小鸟 (I am just a tiny bird) in English and Chinese went viral. Lee was fielded in Ang Mo Kio GRC as a candidate. During the campaign period, it was found that Lee had previously been arrested for committing a rash act while driving and was handed a six-week jail term. The PPP said that Lee had been remorseful and taken full responsibility for his actions. Eventually, Lee's team lost their deposit, receiving only 10.20% of the vote. ### William Lim During a rally speech on 29 Apr 2025 at [Yio Chu Kang Stadium](/wiki/Yio_Chu_Kang_Stadium), Lim, who was a limousine driver, claimed that \"[LTA](/wiki/Land_Transport_Authority) [said] they have no manpower, they do not have 24 hours service\", referring to LTA enforcers. Lim then elaborated to compare LTA to the police and the \"fire people\", stating that if the latter two did not have 24 hour service, the consequences would be drastic. Lim's speech went viral on the Internet due to his poor command of English and his dramatisation of the issue. ## Leadership The PPP's leader is its Secretary-General, [Goh Meng Seng](/wiki/Goh_Meng_Seng). As a veteran opposition politician, Goh had contested [Aljunied GRC](/wiki/Aljunied_Group_Representation_Constituency) under the [WP](/wiki/Workers%27_Party_of_Singapore) in a team which included [Sylvia Lim](/wiki/Sylvia_Lim) and [James Gomez](/wiki/James_Gomez_(politician)) in the [2006 general election](/wiki/2006_Singaporean_general_election). He also contested [Tampines GRC](/wiki/Tampines_Group_Representation_Constituency) while leading the [NSP](/wiki/National_Solidarity_Party_(Singapore)) in the [2011 general election](/wiki/2011_Singaporean_general_election). ### List of secretaries-general NoYearsName12015 - Incumbent[Goh Meng Seng](/wiki/Goh_Meng_Seng) ### Current CEC members The PPP announced its 5th Central Executive Committee members on 7 November 2024, which are as follows: TitleNameNotesHonorary Chairman & Advisor to CECSyafarin bin Sariff-ChairmanDerrick Sim-Vice-ChairmanSharon Lin YihuiLeft the party and contested GE2025 as a member of Red Dot UnitedSecretary-GeneralGoh Meng Seng-Assistant Secretary GeneralMichael Fang AminLeft the party and contested GE2025 as a member of the People's Allance for ReformTreasurerLim Lian Chin William-Organizing SecretaryJames Boo Cheng Hoe@James Care-Assistant Organizing SecretaryTan Meng Lock-Media TeamLee Yu Ru SamuelLeft the party following GE2025Soh Ying Ping Jonathan-MemberMartinn Ho Yuen Liung-Ray Chan Swee Cheong- ## Election results ### Parliament ElectionLeaderVotes%SeatsNCMPsPositionResultContestedTotal+/–SeatsWonLost(/wiki/2015_Singaporean_general_election)[Goh Meng Seng](/wiki/Goh_Meng_Seng)25,4751.13%4040 / 890 / 3 9thNo seats(/wiki/2020_Singaporean_general_election)7,4890.3%1010 / 930 / 2 11thNo seats(/wiki/2025_Singaporean_general_election)15,4940.65%100100 / 970 / 2 10thNo seats #### Seats contested ElectionConstituencies contestedContested vote %+/–(/wiki/2015_Singaporean_general_election)[4-member GRC](/wiki/Group_representation_constituency): [Chua Chu Kang](/wiki/Chua_Chu_Kang_Group_Representation_Constituency)23.09%—N/a(/wiki/2020_Singaporean_general_election)[SMC](/wiki/Constituencies_of_Singapore): [MacPherson](/wiki/MacPherson_Single_Member_Constituency)28.26% 5.17%(/wiki/2025_Singaporean_general_election)5-member GRC: [Ang Mo Kio](/wiki/Ang_Mo_Kio_Group_Representation_Constituency), [Tampines](/wiki/Tampines_Group_Representation_Constituency)5.47% 22.79% ## Notes\n",
  "language": "en",
  "processed_at": "2026-01-12T11:42:40.468595",
  "title": "People's Power Party (Singapore)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/People%27s_Power_Party_(Singapore)"
}