{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:42:33.417612"
  },
  "content": "Singaporean statutory board**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **contains promotional content**. Please help improve it by removing promotional language and inappropriate external links, and by adding encyclopedic text written from a neutral point of view. *(July 2010)* *(Learn how and when to remove this message)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"People's Association\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(September 2017)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* The **People's Association** (**PA**) ([Chinese](/wiki/Chinese_language): 人民协会; [pinyin](/wiki/Pinyin): *Rénmín xiéhuì*) is a [statutory board](/wiki/Statutory_boards_of_the_Singapore_Government) under the [Ministry of Culture, Community and Youth](/wiki/Ministry_of_Culture,_Community_and_Youth) (MCCY) of the [Government of Singapore](/wiki/Government_of_Singapore) that oversees neighbourhood communities and social organisations. Established in 1960, it was part of a [nation-building](/wiki/Nation-building) programme to promote social cohesion and [multiracialism](/wiki/Multiracialism). ## History To counter racial and political tensions in Singapore during the 1950s and 1960s, and foster closer ties among different ethnic groups through centralised control, the [Government of Singapore](/wiki/Government_of_Singapore) established the People's Association (PA) through an [Act of Parliament](/wiki/Act_of_Parliament), the *People's Association Act 1960* and the statutory board came into being on 1 July 1960. Initial activities by the PA were to gain for grassroots support among citizens and to compete with activities by left-wing unions and associations. Minister of State for the Ministry of Culture, Andrew Fong said that the residents' committees are \"our democratic united front against the communist [united front](/wiki/United_front)\". PA has also actively sought cooperation with other organisations and companies to expand its outreach. It introduced the PAssion mastercard in collaboration with [DBS](/wiki/DBS_Bank) in 2014. ## Management According to the People's Association Act, the Association consists of: 1. the [Prime Minister](/wiki/Prime_Minister_of_Singapore), who is Chairman of the Association; 2. a Minister (typically a member of the [Cabinet of Singapore](/wiki/Cabinet_of_Singapore)) who is to be appointed by the Chairman as Deputy Chairman; 3. eight other members to be appointed by the Chairman; and 4. one member to be appointed by the Chairman in consultation with each of the organisations mentioned in the First Schedule to the Act. More than 80 civic organisations are listed in the First Schedule, ranging from the [Football Association of Singapore](/wiki/Football_Association_of_Singapore), to the National University of Singapore Society, to the Singapore Stamp Club. The powers of the PA and the management and control of the Association and its property and affairs are vested in the Board of Management. The Board consists of the persons mentioned in the first three categories listed above, and four members who are elected from among themselves by the persons mentioned in the fourth category at a general meeting of the Association. The Secretary-Treasurer of the Association is also the Secretary-Treasurer of the Board. ### Concerns on partisanship Concerns have been raised as to whether the management of the PA, a statutory board, should be less politicised. The governing [People's Action Party](/wiki/People%27s_Action_Party) (PAP) has traditionally fielded candidates who are leaders and advisors active in PA grassroots organisations before each general election, and Residents' Committees and Community Clubs have encouraged the public to support PAP candidates at rallies and electoral events. Opposition MPs were not allowed to be advisors to government-run grassroots bodies. A spokesperson for the People's Association clarified on a newspaper forum in 2011 that grassroots advisers are appointed by the government; advisors are expected to support and execute its programmes, and the opposition members were not expected to do so. In 2011, after the [Aljunied GRC](/wiki/Aljunied_GRC) was won by the [Workers Party](/wiki/Workers%27_Party_(Singapore)) (WP) in the general elections, WP chairman [Sylvia Lim](/wiki/Sylvia_Lim) noted that the [Housing and Development Board](/wiki/Housing_and_Development_Board) (HDB) had informed the incoming Aljunied–Hougang Town Council (won by the WP) that it had leased 26 public sites, including fields and hard courts, to the People's Association, and that the PA has informed them that \"booking by WP will not be allowed\". She argued that the move is a move to curtail the \"ground presence\" of the elected Members of Parliament (MP) in the opposition-held wards. Opposition leader Low Thia Khiang added that temples were allowed to hold activities in his constituency only if they have supporting letters from the grassroots organisations, and not from him as the elected MP. Non-PAP endorsed politicians such as [Chen Show Mao](/wiki/Chen_Show_Mao) and Tan Cheng Bock (for the presidential elections) were uninvited to PA events. In response to allegations of partisanship of the association, the minister in the [Prime Minister's Office](/wiki/Prime_Minister%27s_Office_(Singapore)) and deputy chairman of the PA [Chan Chun Sing](/wiki/Chan_Chun_Sing) stated in 2016 that the PA \"executes the directions for the Government of the day, as per any statutory board. The PA does not allow any political activity or canvassing on our premises or in our activities. And we certainly do not mobilise anyone for any political party.\" In the lead-up to the [2025 Singaporean general election](/wiki/2025_Singaporean_general_election), further criticism was levelled at the PA by [Leader of the Opposition](/wiki/Leader_of_the_Opposition_(Singapore)) [Pritam Singh](/wiki/Pritam_Singh), who described the organisation as an instrument of political partisanship that systematically excluded elected opposition MPs from grassroots and community engagement. Singh highlighted longstanding practices such as denying opposition MPs access to community clubs, withholding information that would help engage with their constituents, and assigning losing PAP candidates as grassroots advisers in opposition-held wards. He also cited the historical requirement for town councils to seek Community Improvement Projects Committee (CIPC) funding through Citizens' Consultative Committees (CCCs) under the PA, which were typically chaired by PAP-affiliated advisors — a practice that was only reformed in 2021. ### Lapses in governance On 15 July 2015, the Auditor-General's Office (AGO) annual audit report flagged lapses in governance. It highlighted that 35 of 91 Community Club/Centre Management Committees (CCMCs) had awarded $17.78 million worth of tenancy contracts without proper approval. In another case, Admiralty CCC's Chairman had approved $114,767 worth of claims to himself and two contracts worth $32,000 of which he had a conflict of interest; he has resigned voluntarily. PA deputy chairman Lim Swee Say told Parliament that most of the non-compliance flagged shows no systemic irregularity. He explained many of the cases while accepting that processes can be reviewed. ## Grassroots organisations Starting with 28 community centres, the PA has over 1,800 grassroots organisations (GROs) with more than 25,000 volunteer grassroots leaders as of 2017. Grassroots volunteers visit residents to encourage community involvement, raise awareness about community issues, explain government policies and gather feedback, as well as help those in need. It has since grown to 109 Community Centres islandwide as of 2020. Grassroots volunteers and leaders who have volunteered for more than two years qualify for various benefits, such as priority for their children's primary school placement, priority in the application for flats, special parking label at government housing estates (for grassroots work related), and free courses paid by the government (under NACLI, this is to impart knowledge of what they have learnt to the ground, and to re-enforce their required skills in times of crisis). Prior to each general election, prospective candidates of the People's Action Party are sometimes attached to the member of parliament for each constituency to do grassroots work at various GROs, if they were not PAP branch activists, or had not worked with the National Trade Union Congress and government-linked grassroots previously. ### Citizens' Consultative Committees Citizens' Consultative Committees (CCC) are the umbrella grassroots organisation in a [constituency](/wiki/Constituency) in Singapore. CCCs plan and lead grassroots activities in a constituency, they oversee community and welfare programmes and they also act as a feedback channel between the government and the people. The first CCC was established in January 1965. The CCC's objective is to keep the government informed on the needs of the people, and the people informed of government action and policy in these matters. It is also to promote good citizenship amongst the people. Following the [1964 race riots in Singapore](/wiki/1964_race_riots_in_Singapore), village and clan leaders in the CCCs were mobilised to help maintain racial harmony. The committee helps to execute government campaigns such those for as dengue prevention, cleanliness and recycling, racial and communal cohesion. They also organise community forums and administer welfare assistance. Members in the CCC are volunteers appointed by the chairman once every two years and this appointment has to be approved by the adviser, which is the member of parliament for each constituency. In the case of an opposition-held ward, where the sitting MP is prohibited from being an adviser to the PA, the governing party candidate for the next general election will be made the adviser to the GRO. Members usually have a background in politics, or are significant contributors in the Singapore political scene. In 2015, the Singapore Auditor-General's Office flagged several financial irregularities in procurement and payment in multiple CCCs. The Admiralty CCC chairman had approved his own monetary claims of S$114,767, three of which had no supporting documents. He was also involved in approving of two contracts to a company where he held a senior management position. Another CCC member who was in charge of approval process was both a director and a shareholder of the company. PA deputy chairman and cabinet minister [Lim Swee Say](/wiki/Lim_Swee_Say) defended the financial non-compliance by these grassroots leaders and said these irregularities were borne out of \"good intentions\". ### Community Club Management Committees Community Club Management Committees provide recreational activities and learning opportunities. Each CC serves about 15,000 households or an average of 50,000 people. The CCMCs manage and oversees all the CCs. CCMCs are made up of volunteers who work with full-time staff to manage the CCs. ### Residents' Network Residents' Committees (RCs) were first established in 1978 in two constituencies in Singapore (Tanjong Pagar and Marine Parade) with the aim of promoting neighbourly interaction, good communal relations and overall cohesion. RCs also serve as channels of communication between residents and the Government. RCs, like CCCs, initially came under the [Prime Minister's Office](/wiki/Prime_Minister_of_Singapore), and later, the [Ministry of Community Development](/wiki/Ministry_of_Community_Development,_Youth_and_Sports). In 1993, RCs and CCCs came under the purview of the PA. Currently, there are over 650 RCs. Each RC has an RC Centre to conduct meetings and programmes and activities for residents. RCs organise residents' parties, conduct house visits and other neighbourhood activities to reach out to residents. They also work closely with the government agencies to improve the living environment, safety and security of their estates. The Residents' Committee are run by volunteers. The committee has since changed its name to Residents Network (RN). Existing Residents Committee may continue to use its current name. ## PA Talents PA Talents is an umbrella group for more than 300 part-time musicians and dancers performing traditional, ethnic art forms. In 2006, [Cultural Medallion](/wiki/Cultural_Medallion) recipient [Dick Lee](/wiki/Dick_Lee) was appointed its creative director. Formerly known as the PA Cultural Talents, it was set up in 1965 as a performing unit with full-time performers to bring arts and cultural performances to the masses by performing in community centres. It was one of the first groups in Singapore to create multi-ethnic performances in the early 1980s. In 1997, following a strategic review, the group ceased having full-time performers due to limited resources and now relies on a pool of part-timers. PA Talents consists of ten groups: five orchestras (Orkestra Melayu Singapura, the PA Youth Chinese Orchestra, the Singapore Indian Orchestra and Choir, the Singapore Pipe Band and the Singapore Pop Orchestra), and five dance groups (the Chinese, Indian, Malay and Modern Dance Groups, and a [hip-hop](/wiki/Hip-hop_music) club). About a hundred performances are staged each year in national and grassroots shows such as the [National Day Parade](/wiki/Singapore_National_Day_Parade) and [Chingay Parade](/wiki/Chingay_Parade), in commercial shows for corporations, and in cultural and diplomatic events in Singapore and abroad. ## Reception ### Purpose According to the [Central Intelligence Agency](/wiki/Central_Intelligence_Agency) (CIA), the People's Association (PA) had its origins as a national building programme 'designed to wean pro-Communist voters away from the opposition'. Besides serving as a communication channel between the government and governing party at the top and the people below, it was also intended for the PA to blur the boundaries between the government and the party, such that 'the people tended to praise the party for activities undertaken by the government'. ### Radin Mas Incident On 28 May 2021, a Singapore citizen, made a post on Instagram stating that People's Association permitted the use of her and her husband's wedding photo for a [Hari Raya](/wiki/Hari_Raya) decoration without their knowledge. An external vendor was responsible for its design while the [Radin Mas](/wiki/Radin_Mas_Single_Member_Constituency) Constituency Office installed the work at its Tiong Bahru Orchid estate. The office, vendor, and deputy chairperson later apologised. The citizen claimed that the use of her and her husband's likeness was culturally superficial. Library resources about **People's Association** - Resources in your library - Resources in other libraries **By People's Association** - Resources in your library - Resources in other libraries - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:42:33.417318",
  "title": "People's Association",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/People%27s_Association"
}