{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:42:45.668973"
  },
  "content": "Peranakan traditional beadwork **Peranakan beaded slippers**, also known as **Kasut Manik**, literally meaning \"beaded shoes\", is a type of [shoe](/wiki/Shoe) that dates back to the early twentieth century Malaya. It refers to beaded [slippers](/wiki/Slippers) worn by a [nyonya](/wiki/Nyonya) to complete her [Sarong](/wiki/Sarong) [Kebaya](/wiki/Kebaya) outfit, together with chained [brooches](/wiki/Brooch) (kerosang) and a silver belt (tali pending). The slippers are made of [Peranakan cut beads](/wiki/Peranakan_cut_beads) (Manik Potong), which are treasured as these beads are no longer available. Vintage Kasut Maniks are intricate and finely stitched, a testimony to the fine workmanship of yesteryears. The intricacy and fine workmanship of a pair of the beaded slipper is also a hallmark of highly accomplished [Peranakan](/wiki/Peranakan) women, also known as Nyonya, whose skills in [embroidery](/wiki/Embroidery) and [beadwork](/wiki/Beadwork) are highly valued. ## Description The beaded slippers were worn by both the Peranakan males ([baba](/wiki/Peranakan)) and females ([nyonya](/wiki/Nyonya)) and were popular in the 1930s. Nowadays, the beaded slippers are more commonly worn by women only. The beaded slippers were made for two types of occasions. For happy occasions, like the [Chinese New Year](/wiki/Chinese_New_Year) or birthdays, these beaded slippers used colorful beads with intricate patterns. For sad occasions, the beads used were likely to be in black, white or blue colors (Chinese mourning colors), and the patterns were simple. The beaded slippers were either opened face ([peep-toe](/wiki/Peep-toe_shoe)) or covered face. The popular motifs used for the patterns were flowers, birds, butterflies, and fruits. These motifs, likely to appeal to the femininity of the Peranakan women, had both [European](/wiki/Europe) and [Chinese](/wiki/China) influence. The sample patterns were likely to be [cross-stitched](/wiki/Cross_stitch), with each stitch representing a bead. The beads were then used in the actual beading of the slippers. The Peranakan pattern for the beaded slipper is unique in that even the background is quite ornate resulting in a colorful patterned mosaic with a well-defined border. To sew the pattern, a laced-up wooden frame (pidangan) is used to provide the right tension for the beading. The beading process starts from the center of the pattern, moving to the right then left. The main motif of the pattern is first beaded, followed by the background and then the border. The border may have a smooth or scallop-edge. When the beaded pattern is completed, it would be sent to the cobbler to be made into slippers. Leather is usually the preferred material for the beaded slippers, and may be either made with low or high heels. - Clothing portal - Fashion portal - Malaysia portal - [List of shoe styles](/wiki/List_of_shoe_styles) - [Malaysian cultural outfits](/wiki/Malaysian_cultural_outfits) - [Culture of Malaysia](/wiki/Culture_of_Malaysia)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:42:45.668683",
  "title": "Peranakan beaded slippers",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Peranakan_beaded_slippers"
}