{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:42:43.689138"
  },
  "content": "Row of shophouses in SingaporeThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Peranakan Place\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(November 2017)* *(Learn how and when to remove this message)* **Peranakan Place** (also known as **Peranakan Place Complex**), formerly known as **Peranakan Corner**, is a row of six two-storey [shophouses](/wiki/Shophouse) facing Orchard Road, built around 1902 at the intersection of [Emerald Hill Road](/wiki/Emerald_Hill,_Singapore) and [Orchard Road](/wiki/Orchard_Road) in the planning area of [Newton](/wiki/Newton,_Singapore) in [Singapore](/wiki/Singapore). It forms part of the Emerald Hill Conservation Area within the Orchard district in central Singapore. In 1895, it became the pilot restoration and development project conducted by the [Urban Development Authority](/wiki/Urban_Redevelopment_Authority) (URA). It is now used as a commercial building that contains a variety of developments. The shophouse is an iconic [South-East Asian](/wiki/South-East_Asian) design that was popular in the 1960s and has experienced a revival due to the growing focus on historical preservation. The entrance is on Emerald Hill Road at the Orchard Road junction. ## History ### Origins of the land From 1836 to 1900s, the [Emerald Hill](/wiki/Emerald_Hill,_Singapore) estate was held under successive, single ownerships. William Cuppage, one of the early European settlers in Singapore was the first legal owner and occupant of the land, and after his death, it was his son-in-law, Edwin Koek. It was later in 1900 that two enterprising business men, Seah Boon Kang and Seah Eng Kiat subdivided the land into 28 building lots and sold most of them. And that was how Emerald Hill and where Peranakan Place would eventually begin. Prominent late architect and conservationist Lee Kip Lin in his publication Emerald Hill: The story of a street in words and pictures (1984) reckoned that around 40 percent of the occupants in the 1930s were Peranakan, noting its popularity as a place of residence. ### Pedestrianising the intersection Before the 1980s, Emerald Hill Road was then linked to the main Orchard Road. In the early 1980s, proposals were put forth to consider the conservation and integrity of the Emerald Hill buildings. This led to the subsequent pedestrianisation of the road in 1981 starting from the intersection at Orchard Road. The overhead gantry of the now defunct Area Licensing Scheme (ALS), was removed with this road closure (the ALS was started in mid-1975 to control the traffic entering the downtown area and has now been replaced by the [Electronic Road Pricing](/wiki/Electronic_Road_Pricing) (ERP)). On the ground level, the existing tarmac road was replaced with pre-cast concrete paving blocks, and the back lanes tiled. In August 1985, the Urban Redevelopment Authority designated the Emerald Hill site as a conservation area, and with the setting-up cost of $2.2 million, restored 6 two-storey shophouses facing Orchard Road. They renamed the pilot restoration project Peranakan Place. ### The beginnings of Peranakan Place The URA awarded the tenancy en bloc to a group of individuals on 28 November 1984. The authority said that it decided to lease en bloc the preservation project to ensure that the various aspects of Peranakan culture and the centre's activities would be well coordinated. The group of individuals formed a company named Peranakan Place Complex Pte Ltd hit upon some new and exciting ideas for both Singaporeans and tourists to make Peranakan Place, formerly called Peranakan Corner, an authentic showpiece of Peranakan culture. The renaming of the place was a unanimous decision agreed on by both parties, according to the authority. Peranakan Place was deemed more suitable because it denoted something larger and more established than a mere Corner. Instead of a display centre for cultural activities, the group set up a traditional Baba coffee shop or *kedai kopi*, complete with laksa, mee-siam and satay stalls, set amid marble-topped tables and aged advertisements of Milo. A coffee shop extension also allowed diners eating outside in an arbour-like alley to enjoy the landscaped Emerald Hill Road with its coconut and banana trees. ### The Peranakan Show House In the 1984, Peranakan Place, Singapore's first \"Peranakan Museum\" called the Peranakan Place Show House. The show house offered a glimpse of \"A Day in the Life of a Baba\" and was styled to resemble a typical Peranakan household. Tours were conducted at the Show House with a tour guide explaining the significance of the decor, the numerous artefacts such as old pieces of porcelain and even the utensils used in the kitchen. The two storey shophouse depicted the traditional Straits Chinese home and included a traditional altar, and rafters with cake baskets and hanging bird cages in the kitchen. On the second storey was a bridal chamber with a huge red and gold lacquer bridal bed, completed with silk curtains, tapestries and silk covered pillows. On the floor is a peep hole over the front door of the house for which the bride could peek at her future husband-to-be. Amongst the artefacts, only the peep hole and a wedding gown remains today on the second storey. The museum was later replaced by other developments and the new [Peranakan Museum](/wiki/Peranakan_Museum) has since found its way to the old Tao Nan School site on Armenian Street and was opened in 2008. ## Present day With its historic colonnaded covered walkways, Peranakan Place is currently an attraction on [Orchard Road](/wiki/Orchard_Road) for tourists and locals alike. It is closed off to traffic, and has commercial spaces as well as food and beverage outlets. Peranakan Place as it stands today is a commercial development that holds businesses ranging from F&B to retail. As the front faces the main shopping district of Orchard Road, the historic building receives a higher volume of traffic as compared to the quieter housing areas further in on Emerald Hill Road. The owners and tenants are thus required to abide by strict conservation standards set by the URA to ensure that the integrity of the building is preserved. The display of a [Chinese Baroque](/wiki/Chinese_Baroque) style of architecture, which uses a mélange of Chinese and European influences, can still be seen from the colourful yet structured façade. ## Key developments and preservation of architecture ### Restoration In 1985, the URA announced that Emerald Hill would be a conservation area, the first in Singapore, in order to conserve some of the best examples of Straits Chinese style of dwellings. The conservation area also includes the development known as ‘Peranakan Place’, which is a row of 6 two-storey shophouses (circa 1902) fronting Orchard Road. This was a pilot restoration and development project carried out by the URA in 1985. Restored at a cost of $2.2 million in 1985, the original two-storey shophouses that line Peranakan Place date back to as early as 1902. The shophouses had a variety of architectural styles (ranging from Transitional, Late to Art-Deco) and elaborate plaster work and wood carvings combined to create an architectural hybrid that is also referred to as ‘Chinese Baroque’. During the restoration, the facade and ceramic tile-work were preserved, and features like fluted columns and arches, were rebuilt by the [URA](/wiki/Urban_Redevelopment_Authority). For the first time in any restoration work, the URA had allowed the contractor to use fibreglass reconstructions of original features like motifs, cornices and column capitals to replace those damaged by age. In some cases up to 70 per cent of the original features had been substituted with a material known as poly-marble, which unlike the original bricks and plaster, has an almost unlimited life. During the process of restoration, the interiors of the terrace shophouses were torn down, leaving the exteriors remaining. They were then rebuilt to include more room for business occupants. The tenants included Bibi's, a night-spot that offered Peranakan food and theatre entertainment; a museum; and a shop selling Peranakan antiques, cooking utensils, ingredients and cookbooks. ### Change of ownership Peranakan Place Complex Pte Ltd had sold their entire shareholdings to a group of local entrepreneurs with Peranakan heritage 1988. Renovations to Bibi's Restaurant in Peranakan Place started in November 1988 to convert it into a cultural complex for Singapore's artistes to stage plays and perform music. The complex was renovated at a cost of $500,000. The new design included a bar, a stage and some cosy reading rooms with local books and magazines for customers. In the past, the complex was seen as a centre for only traditional Peranakan activities, but the new owners wanted to widen the scope. Known simply as Bibi's, the outlet took on the interior of a rich Peranakan home. Local and western influences were highlighted in the architecture while additional artefacts, fabrics and furnishings complemented the overall design. The coffeeshop, Keday Kopi had been given an overall sprucing up and redesignated as a restaurant called Keday Kopi Peranakan Restaurant. It was officially opened on 3 July with great fanfare complete with lion dances. It boasted a fairly large menu of 50 items, many of which were all-time favourites such as hee-pioh (fish maw) soup, ayam buah keluak and babi pontay.[*citation needed*] ### The first renovation In April 1991, the complex was closed for renovation to become a fully airconditioned shopping complex. The renovations, costing $1.5 million, continued to preserve the Peranakan style facade, and reorganised the interior to feature more shop spaces. The renovation was completed in July. Further, the original alley that separated the 180 Orchard Road plot and 2 Emerald Hill plot was roofed and transformed in 1999 to incorporate the food and beverage nightlife spot, Alley Bar, showcasing the unique usage of land space in the highly sought-after conservation area. ### The facade's colours The colour scheme of the complex has been through many changes over the years, but the owners of the building have always sought to do research on the authenticity of the colours before restoring it to capture the very essence of [Baba culture](/wiki/Peranakan), including their colour sense. In 1985, Peranakan Place was redone in carefully chosen shades of pink, green, and blue - replacing the colours of black and white which were considered as mourning colours by the Peranakan. In 2009, it was a classic grey and white wash with green and pink accents, and in 2015 it was repainted to a bright yellow, emerald, shades of pinks and purple and a bright blue. In 2018, the building was repainted to hues of pastel pink, green and white. [*citation needed*] ## Literature on the Emerald Hill area Aside from the fictional stories written by local Singaporean writers inspired by the area, such as Emily of Emerald Hill by Stella Kon, much has been written about the history and conservation of Emerald Hill and Peranakan Place. These include several of the late academic and conservationist Lee Kip Lin's publications.[*citation needed*] - Peranakan Place website - Urban Redevelopment Authority website 1°18′05″N 103°50′13″E﻿ / ﻿1.3014°N 103.8370°E﻿ / 1.3014; 103.8370\n",
  "language": "en",
  "processed_at": "2026-01-12T11:42:43.688789",
  "title": "Peranakan Place",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Peranakan_Place"
}