{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:42:50.411630"
  },
  "content": "School principal (1900–1969) **Percival Frank Aroozoo** (13 April 1900 *–* 15 March 1969) was the principal of the [Gan Eng Seng School](/wiki/Gan_Eng_Seng_School) in Singapore from 1938 to 1951. ## Early life and education Aroozoo was born on [Waterloo Street](/wiki/Waterloo_Street) in central Singapore on 13 April 1900. A [Eurasian](/wiki/Eurasian_Singaporeans) of Portuguese descent, he was the grandson of Simon Aroozoo, a prominent member of the local Eurasian community. He studied at the [St. Joseph's Institution](/wiki/St._Joseph%27s_Institution,_Singapore) and passed the [Cambridge Local Examinations](/wiki/Cambridge_Local_Examinations) in 1916. In the following year, he qualified as a \"normal class\" teacher. ## Career Aroozoo began teaching at the [Outram School](/wiki/Outram_Secondary_School) in 1918. In 1925, he established the *Outram School Magazine* and began serving as its editor, a role which he held until 1938 when he was promoted to a superscale 'B' post. From 1930 until his promotion, he also funded the annual school play. On 1 January 1939, he began serving as the principal of the [Gan Eng Seng School](/wiki/Gan_Eng_Seng_School) on [Telok Ayer Street](/wiki/Telok_Ayer_Street). However, the school soon closed as a result of the [Japanese occupation of Singapore](/wiki/Japanese_occupation_of_Singapore), during which he lost his hearing in his right ear. He continued to serve as the school's principal after the war and oversaw the school's move from its temporary premises at Outram School to another temporary premises at the Japanese National School on Waterloo Street, as well as its reopening on [Anson Road](/wiki/Anson_Road) in 1951. As the school's principal, he founded *Onward*, the school magazine, and redesigned the school crest. He also offered scholarships to poorer students. He retired as principal of the school in 1955. He was conferred the [MBE](/wiki/Order_of_the_British_Empire) for his contributions to education in Singapore. The school named the library after him in 1996. Aroozoo was a prominent member of the Singapore Teachers' Association and served as the stage manager for several teachers' productions. He also served as the editor of *Chorus*, the association's journal. In 1956, he started a Portuguese language class at the Portuguese Mission of Singapore. The Portuguese Group of Singapore was formed on 16 November 1957 to promote the Portuguese language and culture in Singapore as a result of his initiative. In 1959, he established a fund for books and scholarships for poor children. He wrote the lyrics to the 1953 Singapore City Day song, which was composed by [David Apel](/wiki/David_Apel). He served as a server at the [Saint Joseph's Church](/wiki/Saint_Joseph%27s_Church,_Victoria_Street) on [Victoria Street](/wiki/Victoria_Street,_Singapore) and as a promoter of the Apostleship of Prayer. He was also a founding member of the Singapore branch of the [Society of Saint Vincent de Paul](/wiki/Society_of_Saint_Vincent_de_Paul), a co-founder of the Catholic Young Men's Association and a member of the local branch of the [Catholic Action Movement](/wiki/Catholic_Action). He also founded the *Rally*, a monthly magazine which served as the official organ of the local Portuguese Mission. ## Personal life and death Aroozoo married Agnes Danker, whom he had met during a trip to a rifle shooting range in [Johor Bahru](/wiki/Johor_Bahru), in 1926. They had one son and four daughters, [National Library](/wiki/National_Library,_Singapore) director [Hedwig Anuar](/wiki/Hedwig_Anuar), [CHIJ Katong Convent](/wiki/CHIJ_Katong_Convent) principal [Marie Bong](/wiki/Marie_Bong) and [LASALLE College of the Arts](/wiki/LASALLE_College_of_the_Arts) librarian Eleanor Smith and journalist Lydia Aroozoo. He remarried in 1960 following Danker's death. Aroozoo died of a heart disease on 15 March 1969 and was buried at the [Bidadari Cemetery](/wiki/Bidadari_Cemetery).\n",
  "language": "en",
  "processed_at": "2026-01-12T11:42:50.411252",
  "title": "Percival Frank Aroozoo",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Percival_Frank_Aroozoo"
}