{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:42:54.405453"
  },
  "content": "2004 Singaporean film ***Perth: The Geylang Massacre*** is a 2004 Singaporean drama film written and directed by Djinn (the [pseudonym](/wiki/Pseudonym) of Ong Lay Jinn). It stars [Lim Kay Tong](/wiki/Lim_Kay_Tong) as Harry Lee, a part-time [security guard](/wiki/Security_guard) and [taxicab driver](/wiki/Taxicab_driver) in [Singapore](/wiki/Singapore). He is a self-described \"simple man\" whose life becomes complicated when he finds work as a driver for an [escort service](/wiki/Escort_service). Its title refers to [the Australian city](/wiki/Perth,_Western_Australia), which is where he dreams of retiring and considers a paradise. ## Reception Todd Konrad of the *Independent Film Quarterly*: > Upon first viewing, the film bears more than a striking resemblance to *[Taxi Driver](/wiki/Taxi_Driver_(film))* in both story and tone. Its themes of loneliness and redemption through violence shine through brightly. However, upon further examination both works begin to diverge. Harry, unlike [Travis Bickle](/wiki/Travis_Bickle), is an individual nearing the end of the line both spiritually and physically as he watches the world move without him. Lim plays Harry with a world-weary resolve that is both calming and all the more disturbing when he lashes out in quick, violent bursts of aggression. Brian Holcomb of 'Pop Matters' : > While it has been compared to Martin Scorsese’s 1976 classic, Taxi Driver, Perth is really quite different. It’s clear that Djinn knows that he is making a similar story and he plays a subtle game with his predecessor the way [Stephen King](/wiki/Stephen_King) played with the template of Bram Stoker’s “Dracula” in his novel, *[Salem's Lot](/wiki/Salem%E2%80%99s_Lot_(film))*. But the key difference is that Travis Bickle was a cipher living only in the present, while Harry Lee is a man defined by his past. ## Cast - [Lim Kay Tong](/wiki/Lim_Kay_Tong) as Harry Lee - A. Panneeirchelvam as Selvam - Sunny Pang as Angry Boy Lee - Ivy Cheng as Mai - *Perth* at [IMDb](/wiki/IMDb_(identifier)) - PopMatters review This article related to a Singaporean film is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:42:54.405138",
  "title": "Perth (film)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Perth_(film)"
}