{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:43:08.340016"
  },
  "content": "British Navy lieutenant (1802–1879) **Philip Jackson** (24 September 1802, [Durham](/wiki/Durham,_England) – 1879) was a British [Royal Navy](/wiki/Royal_Navy) lieutenant in the Bengal Regiment Artillery. Jackson has also served as assistant engineer, executive officer and surveyor of public lands in colonial Singapore and laid out the city plan (the [Jackson Plan](/wiki/Jackson_Plan)) for [Singapore](/wiki/Singapore) in 1822. He was a key person in Raffles plans for the settlement and the [Elgin Bridge](/wiki/Elgin_Bridge_(Singapore)) in Singapore was once named in his honour. ## Early life At the age of 16, Jackson became a cadet in the East India Company’s army, and went to India to join the famous Bengal Artillery Regiment. He was subsequently posted to Singapore to defend the town in case of an attack and arrived on the island on 22 January 1822. The attack, however, never materialised. ## Career ### Assistant Engineer and Surveyor of Public Lands When [Stamford Raffles](/wiki/Stamford_Raffles) was on his third and final visit to Singapore in October 1822, he sought able men to help him build the town of Singapore as he was dissatisfied with the way [William Farquhar](/wiki/William_Farquhar), the first British resident and commandant of Singapore, had developed the settlement. Raffles appointed Jackson as assistant engineer on 29 October 1822 to remodel and rebuild Singapore according to his own plan and formed a Town Committee on 4 November 1822 with Jackson assigned to assist it. Jackson spent five years in Singapore as assistant engineer, executive officer and surveyor of public lands, helping in the redevelopment of the fledgling town. Jackson oversaw the construction of the first bridge that spanned the banks of the Singapore River in 1822, at the site where the Elgin bridge now stands. The wooden footbridge, called Presentment Bridge, was also known as Monkey Bridge. It served as the only means of crossing the river until 1840, when [Coleman Bridge](/wiki/Coleman_Bridge,_Singapore) was built further upstream. On 6 December 1822, the Town Committee reported that a draft outline of the streets was ready, and by February 1823, the plan had taken definite shape, with proposals for Singapore’s future progress. With this, named [Jackson Plan](/wiki/Jackson_Plan) or Raffles Town Plan, the construction programme went into full swing. Although the plan was not an actual survey but an outline of the town, it nonetheless followed Raffles’s instructions concerning government, military and commercial locations. The plan also clearly demarcated the locations of residential clusters to house the island’s different ethnic communities. In a sketch drawing of Singapore dated 5 June 1823, the town was depicted to the east of the Singapore River with [Fort Canning Hill](/wiki/Fort_Canning_Hill) in the background, as viewed from the sea. Jackson was known to have drawn other maps and plans for Raffles. On 1 February 1826, Jackson was appointed surveyor of public lands and his responsibilities included surveying lands and registering grants and transfers. ### Singapore Institution As per Raffles’s instructions on 12 January 1823, Jackson prepared plans for the construction of the Singapore Institution (later renamed Raffles Institution) building. This was in accordance with Raffles’s wish to bring in the best Western education for the benefit of Southeast Asian students in Singapore. With Jackson as the architect and engineer, work commenced that year based on a rudimentary design centred on a rusticated base, with carriage porches and colonnaded piers. Tall and rectangular louvered windows were separated by simple Doric pilasters that lined the first storey. It was originally built in the shape of a cross, with wings to be added to each arm. However, construction was shoddy and by 1832, the building was unfinished. It remained in an unfinished state for several years until [George Coleman](/wiki/George_Drumgoole_Coleman), government superintendent of public works, was appointed in 1835 as the new architect and completion of the building in May 1839 according to Jackson’s original plan.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:43:08.339471",
  "title": "Philip Jackson (surveyor)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Philip_Jackson_(surveyor)"
}