{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:43:10.063820"
  },
  "content": "Company **PhillipCapital** is an [investment](/wiki/Investment) and [wealth management](/wiki/Wealth_management) firm, founded in 1975. It offers a wide range of products and services to individuals and institutional clients. It is headquartered in [Singapore](/wiki/Singapore) and operates in 15 locations including the financial hubs of [Chicago](/wiki/Chicago), [London](/wiki/London), [Tokyo](/wiki/Tokyo), [Hong Kong](/wiki/Hong_Kong) and [Singapore](/wiki/Singapore). PhillipCapital serves over 1.5 Million clients with Assets Under Custody exceeding USD 65 Billion. It manages retail and high net worth individuals, family offices, corporate and institutional customers. ## History PhillipCapital was founded as a brokerage firm in 1975. In 1996, it introduced the first [Internet](/wiki/Internet) trading platform in [Singapore](/wiki/Singapore), POEMS. The platform has trading access to many other exchanges. In August 2014, PhillipCapital Group bought Hwang-DBS Commercial Bank in [Cambodia](/wiki/Cambodia) for US$40 million and rebranded it as Phillip Bank. It is the third-largest commercial bank branch network in [Cambodia](/wiki/Cambodia), after the [National Bank of Cambodia](/wiki/National_Bank_of_Cambodia) and [Ministry of Commerce](/wiki/Ministry_of_Commerce,_Cambodia) (MoC) approved the merger between Phillip Bank Plc and Kredit MFI in 2020. In June 2020, the Australian arm of PhillipCapital Group was acquired by Sequoia Wealth Management. In January 2022, PhillipCapital Malaysia acquired the securities broking business from Alliance Bank Malaysia, solidifying its presence in the Malaysian financial sector. In March 2022, PhillipCapital introduced \"US Asian Hours\", Singapore’s first trading service allowing clients to trade specific US equities during Asian market hours, enhancing market accessibility. In June 2022, PhillipCapital co-lead the financing round for Singapore-based fintech [Helicap](/wiki/Helicap). In February 2023, Phillip Securities Japan signed a comprehensive partnership agreement with Ashikaga City, focusing on promoting financial literacy. In April 2023, the company launched PCI - US Equity Options and PCI & PST - Fractional US Share trading, providing diversified investment solutions. In November 2023, Phillip Trustee Cambodia obtained its licence, further expanding the company’s footprint in trust services. ## Awards and recognition - PhillipCapital was named Best Retail Broker at the Sias 18th Investors' Choice Awards by the Securities Investors Association (Singapore) in 2017. - The company's founder Lim Hua Min was named Businessman of the Year at the 2018 Singapore Business Awards in April 2018. - PhillipCapital UAE won the MENA Fund Manager Services Award in 2018. - In September 2019, it won the Best Retail Broker Award at the Securities Investors' Association of Singapore's (Sias) Investors' Choice Awards 2019. - Between 2018 and 2022, PhillipCapital Malaysia was acknowledged as the Best Institutional Derivatives Trading Participant - 1st Runner Up multiple times, demonstrating its strength in the derivatives market. - In 2021, Phillip Nova received the Overseas Intermediary Outstanding Market Contribution Award from the India International Exchange (INE), recognising its impact in global financial markets. - The company's innovation in financial services was highlighted again in 2022, with its India-based \"Phillip Signature India Portfolio\" earning a 4-star rating by CRISIL and PMS Bazaar for being one of the best MultiCap Portfolio Management Service strategies. - In 2023, PhillipCapital was awarded the Financial Advisory of the Year Award at the SingLife Gala and the Top Financial Advisory Partner Award at Tokio Marine Life Insurance. - PT Phillip Futures (Indonesia) was recognised as Best Broker by the Indonesia Commodity and Derivatives Exchange (ICDX) in 2023. - Phillip Trustee (Cambodia) received the Outstanding Trust Service Provider Award at the Cambodia Trust Forum in 2024. - PhillipCapital received the Best Retail Broker Award at the SIAS Investors' Choice Awards in 2024. - Companies portal - [Phillip Securities](/wiki/Phillip_Securities_Indonesia,_PT) - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:43:10.063529",
  "title": "PhillipCapital",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/PhillipCapital"
}