{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:43:24.314045"
  },
  "content": "Asian small pastries filled with pineapple jam **Pineapple tart** is a small, bite-size tart filled or topped with [pineapple](/wiki/Pineapple) [jam](/wiki/Jam), commonly found throughout different parts of Southeast Asia such as [Indonesia](/wiki/Indonesia) (*kue nastar*), [Malaysia](/wiki/Malaysia) ([Baba Malay](/wiki/Malay_trade_and_creole_languages#Baba_Malay): *kueh tae* or *kuih tair*, [Malay language](/wiki/Malay_language): *kuih tat nanas*; [Jawi](/wiki/Jawi_script): تت نانس/ننس‎), [Brunei](/wiki/Brunei) and [Singapore](/wiki/Singapore) in various forms. The pineapple tart may have been invented in the 16th century. This is around the time the pineapple, a fruit native to South America, was introduced to Asia and the [Malay Peninsula](/wiki/Malay_Peninsula) by Portuguese merchants. ## General description The pastry consists of a large proportion of [butter](/wiki/Butter) and [egg yolk](/wiki/Egg_yolk), and some [corn starch](/wiki/Corn_starch), giving it a rich, buttery, tender and melt-in-the-mouth texture. The pineapple jam is usually made through a slow reduction of grated fresh pineapple that is caramelized with a mix of sugar and spices, usually [cinnamon](/wiki/Cinnamon), [star anise](/wiki/Star_anise) and [cloves](/wiki/Clove). Typical shapes include a flat, open tart topped with pineapple jam under a lattice of pastry, rolls filled with jam that are open at the ends, and jam-filled spheres or elongated shapes. ## Regions ### Indonesia In [Indonesia](/wiki/Indonesia), it is called *nastar* which is contraction of *nanas tart* (*[Ananas](/wiki/Ananas)* or pineapple tart), is a popular cookie or *[kue](/wiki/Kue) kering* during festive occasions of *[Lebaran](/wiki/Lebaran)*, *[Natal](/wiki/Christmas_in_Indonesia)* and *[Imlek](/wiki/Chinese_New_Year)*. Just like many of Indonesian *[kue kering](/wiki/Kue#Kue_kering)* (cookies), its origin comes from the [Dutch](/wiki/Dutch_cuisine) influence on Indonesian pastry, cake and cookies tradition. Most *nastar* is made as a round shape with a diameter of about 2 cm. The pineapple jam is filled inside instead of spread on top. ### Malaysia and Singapore Considered a \"festive cookie\", pineapple tarts are especially popular during [Hari Raya](/wiki/Hari_Raya), [Chinese New Year](/wiki/Chinese_New_Year) and [Deepavali](/wiki/Deepavali) celebrations in Singapore and Malaysia. They are also sold all year round by commercial bakeries and souvenir stores serving tourists. ### Taiwan The Taiwanese version of pineapple tart is known as *fènglísū* (鳳梨酥). The filling is fully enclosed within a rectangular tart. Generally the taste is sweet due to sugar added. However, many bakers add or even substitute pineapple with [winter melon](/wiki/Winter_melon) to make the jam less tart as well giving a less fibrous texture to the filling. ### Australia In [Australia](/wiki/Australia) the term often refers to a variation on the [neenish tart](/wiki/Neenish_tart), with pineapple jam below the filling, and [passionfruit](/wiki/Passiflora_edulis) icing. - Food portal - Indonesia portal - Malaysia portal - Singapore portal - [Kue](/wiki/Kue) - [Putri salju](/wiki/Putri_salju)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:43:24.313681",
  "title": "Pineapple tart",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Pineapple_tart"
}