{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:43:45.927444"
  },
  "content": "* *Pixelmetrix Corporation** is a company that develops preventive [monitoring](/wiki/Network_monitoring) products for [terrestrial](/wiki/Terrestrial_television), [satellite](/wiki/Satellite_television), [cable](/wiki/Cable_television), and [IPTV](/wiki/IPTV) networks. The company is known for its DVStation product, and also provides equipment and [network intelligence](/wiki/Network_intelligence) systems to [television broadcasters](/wiki/Broadcasting) for the management and monitoring of [quality of service](/wiki/Quality_of_service) and [quality of experience](/wiki/Quality_of_experience). Pixelmetrix is headquartered in Singapore, and also has offices in the United States and Europe. Following a liquidation exercise starting in 2014, the Pixelmetrix legal entity was dissolved in 2017. From 2014, full hardware and software support for all Pixelmetrix product lines has been provided by Torque Video Systems. ## Corporate history In 1999, Danny Wilson and Ben Lim founded Pixelmetrix Corporation in [Singapore](/wiki/Singapore) as a privately held limited company, recruiting Tom Orlowski and Hideki Takahashi to complete the start-up team. The name “Pixelmetrix“ was derived from the combination of the words \"pixel\" and \"metrics\", loosely suggesting that the company \"measures pixels\". Pixelmetrix released its first product, DVStation, in 2000. DVStation is a [modular](/wiki/Modularity) multi-player system that can simultaneously monitor up to 21 ports and multiple layers of the [video transmission](/wiki/Broadcasting) chain. In 2002, Japan Telecom and Korea Telecom selected DVStation for end-to-end [signal quality](/wiki/Signal_integrity) monitoring during the [FIFA World Cup](/wiki/FIFA_World_Cup) Football games in Japan and Korea. In 2004 the DVStor and DVShift Compliance Recording product lines were introduced to target [disaster recovery](/wiki/IT_disaster_recovery). With the emergence of [IPTV](/wiki/IPTV), Pixelmetrix launched DVStation-IP3 in 2006 for IPTV test and monitoring. The following year, it brought on the Electronic Couch Potato and Consolidator to monitor true customer viewing to ensure \"[Quality of Experience](/wiki/Quality_of_Experience)\". By October 2001, Pixelmetrix had opened an office in Switzerland and established a sales office in Florida. The company added a support office in Barcelona, Spain in 2010. ## Finance The company has pursued external funding and today is backed by several [private](/wiki/Angel_investor), [venture capital](/wiki/Venture_capital) and [institutional investors](/wiki/Institutional_investor) including OWW Capital Partners, UOB Ventures, Enspire Capital and [Singapore Economic Development Board](/wiki/Singapore_Economic_Development_Board) Technopreneur Investment Fund. Revenues have grown year on year and the company has been profitable throughout the years. ## Awards Pixelmetrix has been conferred the TV Technology STAR Awards (Superior Technology Award Recipient) 2012, 2009, 2007, 2004 and 2000, Cable & Satellite International Highly Commended Product of the Year Award 2010, Frost & Sullivan Industrial Technologies Award (2009), C+T Technology Development Award 2009, Cable & Satellite International Product of the Year Award 2008, Engineering & Technology [Emmy Award](/wiki/Emmy_Award) (2007), Broadcast Engineering publication Pick Hit Awards 2008 and 2005, BIRTV Product of the Year Award 2006, Cable-Satellite/Mediacast Product of the Year Awards 2004 and 2003, as well as the [IABM](/wiki/International_Association_of_Broadcasting_Manufacturers) Peter Wayne Award for Best Design and Innovation (2000). ## Product lines Pixelmetrix has five major product lines: - DVStation Monitoring Platforms - DVStor - Compliance Recording, Disaster Recovery, House of Worship Solution - DVStation-IP3 - IPTV Monitoring Platform - Electronic Couch Potato (ECP) - Consolidator - Network Management System - OTT Media Grinder (OMG) - Validation System for Over-The-Top Delivery Infrastructure - Pelican Video Encoders - Official website - New York Times Article on Pixelmetrix\n",
  "language": "en",
  "processed_at": "2026-01-12T11:43:45.927221",
  "title": "Pixelmetrix",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Pixelmetrix"
}