{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:43:55.844029"
  },
  "content": "This article **relies largely or entirely on a single source**. Relevant discussion may be found on the talk page. Please help improve this article by introducing citations to additional sources. *Find sources:* \"Police National Service Full-time Light Strike Force\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(December 2009)* 1°17′42.41″N 103°48′01.76″E﻿ / ﻿1.2951139°N 103.8004889°E﻿ / 1.2951139; 103.8004889 The **Police National Service Full-time Light Strike Force** (PNSF LSF) was part of [Special Operations Command](/wiki/Special_Operations_Command_(Singapore)), a division of [Singapore Police Force](/wiki/Singapore_Police_Force), located at [Queensway Base](/wiki/Queensway_Base) in [Singapore](/wiki/Singapore) from 1998 to 2005. ## History and nature The Police Full-time LSF was established in June 1998. In the beginning, there were 4 squads, namely LSF A, LSF B, LSF C and LSF D. Each squad consisted of at least 20 men then, led by a senior officer holding a rank of [inspector](/wiki/Inspector) or above. He was assisted by a [National Service](/wiki/National_Service) Inspector (NSI). These squads were trained mainly in [riot control](/wiki/Riot_control) and every squad was capable of undertaking the task of quelling any riot which involves 80 people or less. Officers were also equipped with [T-batons](/wiki/T-baton), shields and other riot gear. They had to maintain a higher level of physical fitness than normal officers, and to be alert at all times so that they would always beready to respond within minutes to any serious emergency that may arise. During peacetime however, officers periodically performed standby, patrol, covert ([plain clothes](/wiki/Undercover_operation#Plainclothes_law_enforcement)) and some other policing duties with other [Special Operations Command](/wiki/Special_Operations_Command_(Singapore)) units or various police divisions. This law enforcement agency article is a stub. You can help Wikipedia by expanding it. - v - t - e This Singaporean organisation article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:43:55.843723",
  "title": "Police National Service Full-time Light Strike Force",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Police_National_Service_Full-time_Light_Strike_Force"
}