{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:43:53.859322"
  },
  "content": "Law enforcement agency 1°19′27.56″N 103°50′43.24″E﻿ / ﻿1.3243222°N 103.8453444°E﻿ / 1.3243222; 103.8453444 The **Police Intelligence Department** (**PID**) is a staff department of the [Singapore Police Force](/wiki/Singapore_Police_Force) (SPF). Its primary purpose is to collate and analyse information obtained from the various departments of the SPF, as well as other sources, to support law enforcement activities in [Singapore](/wiki/Singapore). The department is also the staff authority on matters relating to intelligence in the Singapore Police Force (SPF). ## History On 1 April 1973, the Criminal Intelligence Unit ([Abbreviation](/wiki/Abbreviation): **CIU**) was set up within the [Criminal Investigation Department](/wiki/Criminal_Investigation_Department_(Singapore)) ([Abbreviation](/wiki/Abbreviation): **CID**) to support CID's investigation efforts. It was then realised that there was a tremendous amount of valuable information that can be obtained from the land divisions. In October 1988, the Intelligence Division was set up within the CID following a reorganisation of the CIU structure. On 28 March 1996, the Intelligence Division was upgraded to a full-fledged department in the SPF, marking the division's progress and reflecting its value and contribution in the fight against [crime](/wiki/Crime). Past directors include Hoong Wee Teck, who is the incumbent Police Commissioner. ## Present Day Key contact numbers, with an [international dialling code](/wiki/International_dialling_code) of +(65), remain offered by the [Singapore Police Force](/wiki/Singapore_Police_Force) as they were: - Emergencies 999 - Police Hotline 1800 - 255 0000 - Traffic Hotline 6 547 0000 This Singaporean organisation article is a stub. You can help Wikipedia by expanding it. - v - t - e This [law enforcement](/wiki/Outline_of_law_enforcement)–related article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:43:53.859053",
  "title": "Police Intelligence Department",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Police_Intelligence_Department"
}