{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:44:00.667544"
  },
  "content": "* *This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article needs to be **updated**. Please help update this article to reflect recent events or newly available information. *(January 2026)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Politics of Singapore\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(January 2026)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)*This article is part of a series onPolitics of Singapore[Constitution](/wiki/Constitution_of_Singapore) - [Law](/wiki/Law_of_Singapore) - [Human rights](/wiki/Human_rights_in_Singapore) [Legislature](/wiki/Parliament_of_Singapore) - **[Parliament](/wiki/Parliament_of_Singapore)** - [Speaker](/wiki/Speaker_of_the_Parliament_of_Singapore) [Seah Kian Peng](/wiki/Seah_Kian_Peng) ([PAP](/wiki/People%27s_Action_Party)) - [Leader of the House](/wiki/Leader_of_the_House_(Singapore)) [Indranee Rajah](/wiki/Indranee_Rajah) ([PAP](/wiki/People%27s_Action_Party)) - [Leader of the Opposition](/wiki/Leader_of_the_Opposition_(Singapore)) [Pritam Singh](/wiki/Pritam_Singh_(Singaporean_politician)) ([WP](/wiki/Workers%27_Party_(Singapore))) - [14th Parliament](/wiki/14th_Parliament_of_Singapore) - [Constituencies](/wiki/Constituencies_of_Singapore) [Executive](/wiki/Government_of_Singapore#Composition) - **[President of Singapore](/wiki/President_of_Singapore)** ([list](/wiki/List_of_presidents_of_Singapore)) - [Tharman Shanmugaratnam](/wiki/Tharman_Shanmugaratnam) ([I](/wiki/Independent_politician)) - **[Prime Minister of Singapore](/wiki/Prime_Minister_of_Singapore)** - [Lawrence Wong](/wiki/Lawrence_Wong) ([PAP](/wiki/People%27s_Action_Party)) - [Cabinet](/wiki/Cabinet_of_Singapore) - [Ministries](/wiki/Organisation_of_the_Government_of_Singapore) - [The Reserves](/wiki/Reserves_of_the_Government_of_Singapore) [Judiciary](/wiki/Judicial_system_of_Singapore) - **[Supreme Court of Singapore](/wiki/Supreme_Court_of_Singapore)** - [Chief Justice](/wiki/Chief_Justice_of_Singapore) [Sundaresh Menon](/wiki/Sundaresh_Menon) - **[Court of Appeal](/wiki/Court_of_Appeal_of_Singapore)** - [Prakash](/wiki/Judith_Prakash) - [Tay](/wiki/Tay_Yong_Kwang) - [Chong](/wiki/Steven_Chong) - [Ang](/wiki/Belinda_Ang) - **[High Court](/wiki/High_Court_of_Singapore)** - [State Courts](/wiki/State_Courts_of_Singapore) [Elections](/wiki/Elections_in_Singapore) - [Presidential elections](/wiki/Presidential_elections_in_Singapore) - [General elections](/wiki/General_elections_in_Singapore) Singapore portal - [Other countries](/wiki/Outline_of_political_science#Politics_by_region) - v - t - e [Singapore](/wiki/Singapore) is a [parliamentary](/wiki/Parliamentary_system) [representative democratic](/wiki/Representative_democracy) [republic](/wiki/Republic) in which the [President of Singapore](/wiki/President_of_Singapore) is the [head of state](/wiki/Head_of_state), the [prime minister of Singapore](/wiki/Prime_minister_of_Singapore) is the [head of government](/wiki/Head_of_government), and of a [multi-party system](/wiki/Multi-party_system). [Executive power](/wiki/Executive_power) is exercised by the [Cabinet](/wiki/Cabinet_of_Singapore) from the parliament, and to a lesser extent, the [president](/wiki/President_of_Singapore). Cabinet has the general direction and control of the government and is [accountable](/wiki/Accountable) to Parliament. There are three separate branches of government: the [legislature](/wiki/Legislature), [executive](/wiki/Executive_(government)) and [judiciary](/wiki/Judiciary) resembling by the [Westminster system](/wiki/Westminster_system). [Legislative power](/wiki/Legislative_power) is vested in both the government and the [Parliament of Singapore](/wiki/Parliament_of_Singapore). The [legislature](/wiki/Legislature) is the [parliament](/wiki/Parliament), which consists of the president as its head and a single chamber whose members are elected by popular vote. The role of the president as the [head of state](/wiki/Head_of_state) has been, historically, largely ceremonial although the constitution was amended in 1991 to give the president some veto powers in a few key decisions such as the use of the [national reserves](/wiki/Reserves_of_the_Government_of_Singapore) and the appointment of key [judiciary](/wiki/Judiciary), [civil service](/wiki/Singapore_Civil_Service) and [Singapore Armed Forces](/wiki/Singapore_Armed_Forces) (SAF) posts. They also exercise powers over civil service appointments and [national security](/wiki/National_security) matters. Singapore has been governed by the [People's Action Party](/wiki/People%27s_Action_Party) (PAP) since 1959; consequently it has been described as being a *[de facto](/wiki/De_facto)* [one-party state](/wiki/Dominant-party_system) under the PAP. In the [last general election held in 2025](/wiki/2025_Singaporean_general_election), the PAP won 87 out of 97 seats and 65.57% of the popular vote, meaning the PAP won its 16th consecutive term in government. ## Political background ### Domination of the People's Action Party (PAP) Singaporean politics have been dominated by the [People's Action Party](/wiki/People%27s_Action_Party) (PAP) since the [1959 general election](/wiki/1959_Singaporean_general_election) when [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) became Singapore's first prime minister, when the territory was then a self-governing state within the [British Empire](/wiki/British_Empire). The PAP has been the only ruling party to form the government since then. Singapore became a [state of Malaysia](/wiki/State_of_Singapore_(Malaysia)) in 1963 but regained its independence in 1965 after being expelled. During Singapore's time in Malaysia, the PAP was the state government and [often clashed](/wiki/PAP%E2%80%93UMNO_relations) with the federal government, which was then led by [UMNO](/wiki/UMNO). To a large extent, \"bread-and-butter\" politics are used to maintain ideological hegemony, and reflect the basic materialistic orientation of Singapore politics. Opposition parties are used to contesting the PAP under these similar parameters. In spite of the ideological hegemony, a survey by [Pew Research](/wiki/Pew_Research_Center) has demonstrated an increase in perceived political division between people who support different political parties since 2021. In the last [general election](/wiki/2025_Singaporean_general_election), the PAP won 87 out of 97 elected seats in the [Parliament of Singapore](/wiki/Parliament_of_Singapore). The remaining seats were won by the [Workers' Party](/wiki/The_Workers%27_Party_(Singapore)) (WP), which won 10 elected seats along with two [non-constituency](/wiki/Non-constituency_Member_of_Parliament) seats. ### Reception Singapore has consistently been rated as the [least-corrupt](/wiki/Corruption_in_Singapore) country in Asia and amongst the top ten cleanest in the world by [Transparency International](/wiki/Transparency_International). The World Bank's governance indicators have also rated Singapore highly on rule of law, control of corruption and government effectiveness. However, it is widely perceived that some aspects of the political process, civil liberties, and political, labour and human rights are lacking. The [Economist Intelligence Unit](/wiki/Economist_Intelligence_Unit) rated Singapore a \"[flawed democracy](/wiki/Democracy_Index#Definitions)\" in 2024.[*needs update*] [Freedom House](/wiki/Freedom_House) deemed Singapore \"partly free\" in 2025, at 48/100 — 19/40 for political rights, 29/60 for civil liberties. [Reporters Without Borders](/wiki/Reporters_Without_Borders) ranked Singapore 123rd in the world for press freedoms in 2025, citing the tight media landscape as well as lawsuits against political opponents, along with attempts at making critical journalists unemployable. ## Political climate ### Factors There has been some analysis over the reasons as to why the PAP has continuously held power for so long, an uncommon longevity for a nominal [liberal democracy](/wiki/Liberal_democracy). One commonly cited reason is the use of defamation lawsuits by the PAP to bankrupt political opponents and disqualify them from running for office when accusations were made against PAP politicians. Cases include former leader of the WP [J. B. Jeyaretnam](/wiki/J._B._Jeyaretnam) and leader of the [Singapore Democratic Party](/wiki/Singapore_Democratic_Party) (SDP) [Chee Soon Juan](/wiki/Chee_Soon_Juan), who were bankrupted in 2001 and 2011 respectively. Another reason given is the pursuit of legal action against journalists and bloggers critical of the PAP and its policies. Singapore's media landscape is tightly controlled by the PAP government, which maintains strict regulations and oversight over press and broadcast content. The government exercises control through licensing laws, majority ownership of major media outlets such as [Mediacorp](/wiki/Mediacorp) and [SPH Media Trust](/wiki/SPH_Media_Trust), consequently creating a climate where [self-censorship](/wiki/Self-censorship) is widespread. Journalists and editors often avoid controversial topics or criticism of government policies to maintain compliance, job security or avoid potential legal repercussions. As a result, while Singapore's media is known for its polished and orderly presentation, it often lacks the investigative depth and critical scrutiny found in more liberal media environments, particularly of local politics. In 2019, the [Protection from Online Falsehoods and Manipulation Act](/wiki/Protection_from_Online_Falsehoods_and_Manipulation_Act) (POFMA) was enacted, which allows the government to order corrections or removals of online content it deems \"false and harmful\". While the government defends it as a tool to protect public interest, critics argue it grants excessive power to authorities, risks censorship, and has highlighted its [chilling effect](/wiki/Chilling_effect) on free speech and democratic discourse. The PAP has in the past threatened voters by saying that constituencies voting for opposition MPs would be put at the bottom of the list for public housing programs. In 1998, then-PAP secretary-general, [Goh Chok Tong](/wiki/Goh_Chok_Tong) said, \"By linking the priority of upgrading to electoral support, we focus the minds of voters on the link between upgrading and the people whose policies make it possible. This has the desired result.\". In 2011, then-prime minister [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) expressed that there has to be a distinction between opposition wards and the ones that voted for the PAP in terms of housing upgrades. The boundaries of electoral constituencies in Singapore are decided by the [Elections Department](/wiki/Elections_Department), which is under the control of the [Prime Minister's Office](/wiki/Prime_Minister%27s_Office_(Singapore)). Electoral boundaries are redrawn just a few weeks before the general election, leaving little time for opposition parties to prepare. There have been accusations of [gerrymandering](/wiki/Gerrymandering) via the dissolving and redrawing of marginal constituencies with relatively stronger opposition support, such as [Cheng San GRC](/wiki/Cheng_San_Group_Representation_Constituency) and [Eunos GRC](/wiki/Eunos_Group_Representation_Constituency). The [Group Representation Constituency](/wiki/Group_Representation_Constituency) (GRC) system, which requires teams of candidates (including at least one from a minority group) to contest in larger electoral areas, has also been criticised for making it more difficult for smaller or newer opposition parties to compete effectively. While the government maintains that these changes are made to reflect population shifts and ensure minority representation, the lack of transparency fuels ongoing concerns about the integrity of the electoral process. Although Singapore's laws are largely inherited from [English common law](/wiki/English_common_law) due to its history as a former colony of the [British Empire](/wiki/British_Empire), the PAP government is also critical of fully embracing [liberal democratic values](/wiki/Liberal_democracy), which it typifies as a \"[Western](/wiki/Western_world) concept\" and claims that there should not be a 'one-size-fits-all' solution to a democracy. For example, laws restricting [freedom of speech](/wiki/Freedom_of_speech) exist to prohibit speech that may breed ill will or cause disharmony within Singapore's [multiracial](/wiki/Demographics_of_Singapore), [multi-religious](/wiki/Religion_in_Singapore) society. For example, in 2005, three [bloggers](/wiki/Blog) were convicted of [sedition](/wiki/Sedition) for posting [racist](/wiki/Racism) remarks targeting minorities. In 2021, a former [Ngee Ann Polytechnic](/wiki/Ngee_Ann_Polytechnic) [senior lecturer](/wiki/Senior_lecturer) was sentenced to five weeks' jail and a $6,000 fine for making racist remarks to an inter-ethnic couple in public. [Public demonstrations in Singapore](/wiki/Public_demonstrations_in_Singapore) are tightly controlled under the Public Order Act, requiring police permits for public gatherings. Even at the designated [Speakers' Corner](/wiki/Speakers%27_Corner,_Singapore), strict rules apply. The government justifies these controls as necessary for maintaining public order and harmony in a multi-ethnic society, but critics argue that the laws severely limit freedom of expression and assembly. In addition, some offences that could be deemed as minor crimes in other countries such as [vandalism](/wiki/Vandalism) can lead to heavy fines or [corporal punishment](/wiki/Caning_in_Singapore) (caning). In addition, [the death penalty](/wiki/Capital_punishment_in_Singapore) for [murder](/wiki/Murder) and [drug trafficking](/wiki/Illegal_drug_trade) remains in force. Critics have also accused the PAP of ruling Singapore like a [nanny state](/wiki/Nanny_state), making Singaporeans having a \"sheltered\" perspective of the world.[*citation needed*] ## Executive In order to become president, the candidate: - Must not be a member of any [political party](/wiki/List_of_political_parties_in_Singapore) on the date of their nomination for election. - Must have for a period of no fewer than three years held office — - as [Minister](/wiki/Cabinet_of_Singapore#Responsibilities_of_Ministers), [Chief Justice](/wiki/Chief_Justice_of_Singapore), [Speaker](/wiki/Speaker_of_the_Parliament_of_Singapore), [Attorney-General](/wiki/Attorney-General_of_Singapore), Chairman of the [Public Service Commission](/wiki/Public_Service_Commission_(Singapore)), Auditor-General, Accountant-General or [Permanent Secretary](/wiki/Permanent_Secretary); - as [chief executive officer](/wiki/Chief_executive_officer) (CEO) of a key statutory board or government company: the [Central Provident Fund Board](/wiki/Central_Provident_Fund_Board), the [Housing and Development Board](/wiki/Housing_and_Development_Board), the [Jurong Town Corporation](/wiki/JTC_Corporation), the [Monetary Authority of Singapore](/wiki/Monetary_Authority_of_Singapore), [Temasek Holdings](/wiki/Temasek_Holdings), or [GIC Private Limited](/wiki/GIC_Private_Limited) (formerly known as the Government of Singapore Investment Corporation); - as CEO of a company with an average of $500 million in [shareholders' equity](/wiki/Equity_(finance)#shareholders'_equity) for the most recent three years in that office, and which is profitable after [taxes](/wiki/Corporate_tax); or - in any other similar or comparable position of seniority and responsibility in any other organisation or department of equivalent size or complexity in the [public](/wiki/Public_sector) or [private sector](/wiki/Private_sector) which has given him or her such experience and ability in administering and managing financial affairs as to enable him or her to carry out effectively the functions and duties of the office of President. The president now exercises powers over the following: - appointment of public officers - government budgets - examine government's exercise of its powers under the Internal Security Act - examine government's exercise of its powers under religious harmony laws - investigate cases of corruption However, the president must consult the Council of Presidential Advisers before taking a decision on some of these matters. The council consists of - two members appointed at the personal discretion of the president - two members appointed by the president on the advice of the prime minister - one member appointed by the president on the advice of the chief justice - one member appointed by the president on the advice of the chairman of the Public Service Commission A member of the council serves a six-year term and is eligible for re-appointment for further terms of four years each. Similar to the [Speech from the Throne](/wiki/Speech_from_the_Throne) given by the heads of state in other parliamentary systems, the president delivers an address written by the government at the opening of parliament about what kind of policies to expect in the coming year. The current president is [Tharman Shanmugaratnam](/wiki/Tharman_Shanmugaratnam). ### Cabinet The cabinet forms the executive of the government and it is answerable to parliament. It consist of sitting members of parliament and is headed by a prime minister, the head of government. The current prime minister is [Lawrence Wong](/wiki/Lawrence_Wong). Neither the prime minister nor members of the cabinet are elected by parliament. The prime minister is appointed by the president, then Cabinet members, also known as ministers, are appointed by the president on the advice of the prime minister. The cabinet in Singapore collectively decides the government's policies and has influence over lawmaking by introducing bills. Ministers in Singapore are the highest paid politicians in the world, receiving a 60% salary raise in 2007 and as a result Prime Minister Lee Hsien Loong's pay jumped to S$3.1 million, five times the US$400,000 earned by [US President](/wiki/US_President) [Barack Obama](/wiki/Barack_Obama). Although there was a public outcry regarding the high salary in comparison to the size of the country governed, the government's firm stance was that this raise was required to ensure the continued efficiency and corruption-free status of Singapore's \"world-class\" government. On 21 May 2011, following the 2011 general election, the Prime Minister announced that a committee would be appointed to [review politicians' remuneration](/wiki/Cabinet_of_Singapore#2011_review), and that revised salaries would take effect from that date. ## Legislative ### Parliament The [unicameral](/wiki/Unicameral) Singaporean parliament is the legislature in Singapore with the president as its head. Before independence in 1965, it was known as the [Legislative Assembly](/wiki/Legislative_Assembly). It currently consists of 93 members of parliament. The maximum term of any one parliament is five years, after which a [general election](/wiki/General_election) must be held within three months of the [dissolution of parliament](/wiki/Dissolution_of_parliament). The 93 elected members of parliament (MPs) are elected on a [plurality voting](/wiki/Plurality_voting_system) basis and represent either single-member [constituencies](/wiki/Constituencies_of_Singapore) (SMCs) or group representation constituencies (GRCs). In GRCs, political parties field a team of between three and six candidates. At least one candidate in the team must belong to a minority race. Formerly, there were no GRCs, and all constituencies of Singapore were represented by one member, but amendments to the [Parliamentary Elections Act](/wiki/Parliamentary_Elections_Act) in 1991 led to the creation of GRCs, thus creating a plurality voting system in the process. This development has led to complaints from opposition parties that they are often unable to field one, let alone three or more candidates. Out of the 93 members of parliament, 26 are female. In the (/wiki/2001_Singaporean_general_election) and (/wiki/2006_Singaporean_general_election) general election, the incumbent People's Action Party (PAP) won the same configuration of 82 out of the 84 seats. The final results of the [2020 general election](/wiki/2020_Singaporean_general_election) saw a 8.62% swing against the PAP from the [2015 elections](/wiki/2015_Singaporean_general_election) of 69.86%. The constitution also allows for the appointment of additional members of parliament who are not elected during an election. Up to six [non-constituency members of parliament](/wiki/Non-Constituency_Member_of_Parliament) from the opposition political parties can be appointed. Currently, there are two non-constituency members of parliament. A constitutional provision for the appointment of up to nine [nominated members of parliament](/wiki/Nominated_Member_of_Parliament) (NMPs) was made in 1990. NMPs are appointed by the president for a term of two and a half years on the recommendation of a [select committee](/wiki/Select_committee_(United_Kingdom)) chaired by the [speaker of Parliament](/wiki/List_of_Speakers_of_the_Parliament_of_Singapore) and are not connected to any political parties. The youngest NMP to be sworn into parliament was 26 years old, [Yip Pin Xiu](/wiki/Yip_Pin_Xiu). In 2018, nine NMPs were sworn in, out of which five were female. Both non-constituency and nominated members of parliament cannot vote on the following issues: - [amendment of the constitution](/wiki/Constitutional_amendment) - [public funds](/wiki/Budget) - [vote of no confidence](/wiki/Vote_of_no_confidence) in the government - removing the president from office ### Legislative process Before any law is passed, it is first introduced in parliament as a draft known as a bill. Bills are usually introduced by a minister on behalf of the cabinet, known as government bills. However, any member of parliament can introduce a bill, known as a private member's bill. All bills must go through three readings in parliament and receive the president's assent to become an [act of Parliament](/wiki/Act_of_Parliament). Each bill goes through several stages before it becomes a law. The first stage is a mere formality known as the [first reading](/wiki/First_reading), where it is introduced without a debate. This is followed by the [second reading](/wiki/Second_reading), where members of parliament debate on the general principles of the bill. If parliament opposes the bill, it may vote to reject the bill. If the bill goes through the second reading, the bill is sent to a select committee where every clause in the bill is examined. Members of parliament who support the bill in principle but do not agree with certain clauses can propose amendments to those clauses at this stage. Following its report back to parliament, the bill will go through its [third reading](/wiki/Third_reading) where only minor amendments will be allowed before it is passed. Most bills passed by parliament are scrutinised by the [Presidential Council for Minority Rights](/wiki/Presidential_Council_for_Minority_Rights) which makes a report to the speaker of Parliament stating whether there are clauses in a bill which affects any racial or religious community. If approved by the council, the bill will be presented for the president's assent. The last stage involves the granting of assent by the president, before the bill officially becomes a law. ### Constitution The Constitution of Singapore is the supreme law of [Singapore](/wiki/Singapore) and it is a [codified constitution](/wiki/Codified_constitution). The constitution cannot be amended without the support of more than two-thirds of the members of parliament on the second and third readings. The president may seek opinion on constitutional issues from a tribunal consisting of not less than three judges of the [Supreme Court](/wiki/Supreme_Court_of_Singapore). Singaporean courts, like the courts in Australia, cannot offer [advisory opinion](/wiki/Advisory_opinion) on the constitutionality of laws. Part IV of the constitution guarantees the following: 1. [liberty of a person](/wiki/Individual_liberty) 2. prohibition of [slavery](/wiki/Slavery) and [forced labour](/wiki/Forced_labour) 3. protection against [retrospective criminal laws](/wiki/Ex_post_facto_law) and [repeated trials](/wiki/Double_jeopardy) 4. [equal protection](/wiki/Equal_protection) 5. prohibition of [banishment](/wiki/Exile) and [freedom of movement](/wiki/Freedom_of_movement) 6. [freedom of speech](/wiki/Freedom_of_speech), [assembly](/wiki/Freedom_of_assembly) and [association](/wiki/Freedom_of_association) 7. [freedom of religion](/wiki/Freedom_of_religion) 8. [right to education](/wiki/Right_to_education) The sections on liberty of the person and freedoms of speech, assembly, movement, association and religion are all qualified by allowing Parliament to restrict those freedoms for reasons including national security, public health, and \"public order or morality\". In practice, the courts have given complete discretion to the government in imposing such restrictions. Part XII of the constitution allows the [Parliament of Singapore](/wiki/Parliament_of_Singapore) to enact legislation designed to stop or prevent [subversion](/wiki/Subversion_(political)). Such legislation is valid even if it is inconsistent with Part IV of the constitution. The [Internal Security Act](/wiki/Internal_Security_Act_(Singapore)) (ISA) is a legislation under such provision. In 1966, [Chia Thye Poh](/wiki/Chia_Thye_Poh) was detained under the ISA and was imprisoned for 23 years without trial. Afterwards, he was placed under conditions of house arrest for another nine years. ## Judiciary **This section is empty.** You can help by adding to it. *(June 2025)* ## Elections and political parties Voting has been [compulsory](/wiki/Compulsory_voting) in Singapore since 1959 and there is [universal suffrage](/wiki/Universal_suffrage). The legal voting age is 21. The [Elections Department Singapore](/wiki/Elections_Department_Singapore) (ELD) is responsible for the planning, preparation and conduct of presidential and parliamentary elections and of any national referendum in Singapore. It is a department under the [Prime Minister's Office](/wiki/Prime_Minister%27s_Office_(Singapore)) (PMO). Paper [ballots](/wiki/Ballot) are used in Singapore. Voting is secret, while ballot papers have serial numbers on them to safeguard against counterfeiting and voter impersonation. As stated in the Elections Department website: ballot papers can be examined only under strict conditions, and there are safeguards that make it extremely difficult to find out how any particular voter voted. After the count, all ballot papers and their counterfoils have to be sealed in the Supreme Court vault for six months, after which all the ballot papers and other election documents are destroyed. During those six months, these documents can only be retrieved by court order. The court will issue such an order only if it is satisfied that a vote has been fraudulently cast and the result of the election may be affected as a result. Our courts have issued no such order since elections have been held here since 1948. ### Other major political parties in Singapore #### Workers' Party (WP) The [Workers' Party (WP)](/wiki/Workers%27_Party_(Singapore)) is the largest and oldest opposition party. The party achieved a significant milestone in 1981 when [J.B. Jeyaretnam](/wiki/J._B._Jeyaretnam) won the [Anson by-election](/wiki/1981_Anson_by-election), becoming the first opposition Member of Parliament since 1965. In 2011, the party won Aljunied Group Representation Constituency (GRC), marking the first-ever opposition victory in a GRC. This was followed by another breakthrough in 2020 with the Sengkang GRC. The WP claims to advocate for a balanced political landscape, offering constructive and responsible alternatives to the ruling party while championing the rights of Singaporeans. #### Progress Singapore Party (PSP) The [Progress Singapore Party](/wiki/Progress_Singapore_Party) (PSP), founded on 28 March 2019 by former presidential candidate Tan Cheng Bock, is a major opposition party in Singapore. PSP contested its first General Election in 2020, fielding 24 candidates across nine constituencies. While the party did not win any seats, its West Coast GRC team achieved a close 48.31% vote share.This entitled PSP to two Non-Constituency Member of Parliament (NCMP) seats, currently held by Hazel Poa and Leong Mun Wai. #### Minor opposition parties There are other major opposition parties such as the [Singapore People's Party](/wiki/Singapore_People%27s_Party) (SPP), [Reform Party](/wiki/Reform_Party_(Singapore)) (RP) and the [Singapore Democratic Party](/wiki/Singapore_Democratic_Party) (SDP), that do not hold a seat in parliament. Despite acquiring an increasing percentage of the popular vote—34% overall in 2006—opposition parties gained small numbers of seats in the general elections of 1984 (2 seats of 79), 1988 (1 seat of 81), 1991 (4 seats of 81), 1997 (2 seats of 83) and 2001 (2 seats of 84). Most opposition parties have attributed the disproportionate results to the nature of the GRC system.[*citation needed*] ### Women's participation in politics This section needs to be **updated**. Please help update this article to reflect recent events or newly available information. *(January 2026)* Women traditionally played a significantly smaller role than their male counterparts in Singapore. Nonetheless, in recent years, there is an increasing level of female participation in the Singapore political arena. On 11 July 2020, [He Ting Ru](/wiki/He_Ting_Ru) and [Raeesah Khan](/wiki/Raeesah_Khan) became the third and fourth woman from an opposition party to win a seat in parliament by 4,922 votes over the ruling party's candidates in the 2020 general election for the [Sengkang Group Representation Constituency](/wiki/Sengkang_Group_Representation_Constituency) (GRC). The team was led by He Ting Ru and was first timer Raeesah Khan who proceeded to become the youngest MP in Singapore's parliamentary history. [Lee Li Lian](/wiki/Lee_Li_Lian) was the second woman from an opposition party to win a seat in Parliament with 54.50% of the votes but lost in the following [2015 general election](/wiki/2015_Singaporean_general_election) by a slim margin. [Sylvia Lim Swee Lian](/wiki/Sylvia_Lim), currently the Chairperson of the opposition Workers' Party (WP) and Member of Parliament (MP) representing Aljunied GRC whose team won 54.71% of the votes (54.72% including overseas votes), was the first time that an opposition party won a GRC since the system's introduction on 1 June 1988. In September 2017, [Halimah Yacob](/wiki/Halimah_Yacob) was inaugurated as Singapore's first female President, the only candidate certified as eligible in [the election](/wiki/2017_Singaporean_presidential_election). ### Shirt colours The candidates and supporters of the various political parties tend to wear the following shirt colours while making their rounds in various wards or campaigning. PartyShirt Colour[People's Action Party](/wiki/People%27s_Action_Party)White[Workers' Party](/wiki/Workers%27_Party_of_Singapore)Light Blue[Progress Singapore Party](/wiki/Progress_Singapore_Party)Red and White[Singapore People's Party](/wiki/Singapore_People%27s_Party)[Singapore Democratic Party](/wiki/Singapore_Democratic_Party)Red[National Solidarity Party](/wiki/National_Solidarity_Party_(Singapore))Orange[Reform Party](/wiki/Reform_Party_(Singapore))Yellow[Singapore Democratic Alliance](/wiki/Singapore_Democratic_Alliance)Bright Green[Democratic Progressive Party](/wiki/Democratic_Progressive_Party_(Singapore))White and Orange[People's Power Party](/wiki/People%27s_Power_Party_(Singapore))Light Purple[Peoples Voice](/wiki/Peoples_Voice_(Singapore))Purple and Black[Red Dot United](/wiki/Red_Dot_United)Navy Blue - Singapore portal - [Corruption in Singapore](/wiki/Corruption_in_Singapore) - [Dominant party system](/wiki/Dominant_party_system) - [Constituencies of Singapore](/wiki/Constituencies_of_Singapore) - [Human rights in Singapore](/wiki/Human_rights_in_Singapore) - [Laws of Singapore](/wiki/Laws_of_Singapore) - [Lists of members of parliament in Singapore](/wiki/Lists_of_members_of_parliament_in_Singapore) - [Nepotism in Singapore politics](/wiki/Nepotism#Singapore)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:44:00.667267",
  "title": "Politics of Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Politics_of_Singapore"
}