{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:43:57.753709"
  },
  "content": "Political views of the first Prime Minister of Singapore [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) (1923–2015) was the first [Prime Minister of Singapore](/wiki/Prime_Minister_of_Singapore) (1959–1990). A founding member of the governing [People's Action Party](/wiki/People%27s_Action_Party) (PAP), he is often credited for transforming [Singapore](/wiki/Singapore) from a [third-world](/wiki/Third_World) to a [first-world](/wiki/First_World) country. He was known for practising [political pragmatism](/wiki/Pragmatism) in his governance of Singapore, but has been criticised for using authoritarian and heavy-handed policies. However, others argue his actions as having been necessary for the country's early development, and that he was a [benevolent dictator](/wiki/Benevolent_dictatorship). His philosophy is considered by some to be a [Third Way](/wiki/Third_Way) one. Lee was elected Prime Minister of Singapore for 31 years, making him the longest-serving prime minister in the world at the time. Many world leaders have affirmed Lee's political knowledge as being insightful. Such supporters include former [Prime Minister of the United Kingdom](/wiki/Prime_Minister_of_the_United_Kingdom) [Margaret Thatcher](/wiki/Margaret_Thatcher), who remarked that Lee was \"never wrong\", and former [US Secretary of State](/wiki/United_States_Secretary_of_State) [Henry Kissinger](/wiki/Henry_Kissinger). Former [President of the United States](/wiki/President_of_the_United_States) [Barack Obama](/wiki/Barack_Obama) stated that he \"personally appreciated [Lee's] wisdom.\" Former [Prime Minister of Japan](/wiki/Prime_Minister_of_Japan) [Shinzo Abe](/wiki/Shinzo_Abe) stated that Lee was \"one of the greatest leaders of modern times that Asia has ever produced.\" [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) himself admired leaders like [Mao Zedong](/wiki/Mao_Zedong) and [Deng Xiaoping](/wiki/Deng_Xiaoping) during interviews and speeches. ## Foreign policy ### Malaysia Lee initially believed that Singapore and [Malaya](/wiki/Federation_of_Malaya) were culturally, politically, economically, and socially similar, stating that \"my generation had always believed that Singapore and Malaya were one\". This led him to campaign for merger with Malaya from 1959 to 1963, including delivering a series of radio talks from 13 September to 9 October in 1961 defending the concept of merger, later dubbed the *Battle for Merger*. Subsequently, however, racial tensions between the ethnic Chinese and Malays led Lee to announce Singapore's separation from Malaysia on 9 August 1965, citing [Malaysian Prime Minister](/wiki/Prime_Minister_of_Malaysia) [Tunku Abdul Rahman](/wiki/Tunku_Abdul_Rahman)'s statement that \"Singapore had to leave Malaysia or there would be bloodshed\". Lee said that this was \"a moment of anguish\" for him because \"all my life... I have believed in merger and the unity of these two territories. You know, it's a people, connected by geography, economics, and ties of kinship\". Since 1965, Lee criticised Malaysia's race-based policies such as [the enshrinement of Malay privileges](/wiki/Bumiputera_(Malaysia)#Contentious_policy), which he argues has \"place[d] the country at a disadvantage\", citing the country's failure to retain [Malaysian Chinese](/wiki/Malaysian_Chinese) businesspeople and talent. Lee wrote that \"Singapore and Malaysia have chosen two entirely different ways of organising our societies\", and in 2013 argued that the coexistence of both states \"separately but amicably\" was the inevitable course of their relations. ### Hong Kong Lee believed that the [Sino-British Joint Declaration](/wiki/Sino-British_Joint_Declaration) signed in 1984 was the best agreement possible for Hong Kong. Lee said Hong Kongers had to come to terms with the reality that there would be \"nothing to stop Beijing from doing what it wanted\" after the 1997 [handover](/wiki/Handover_of_Hong_Kong). He advised British diplomats stationed in Singapore in July 1989 following the [1989 Tiananmen Square protests and massacre](/wiki/1989_Tiananmen_Square_protests_and_massacre) that Beijing would reject any assertion of a separate and democratically based Hong Kong identity. In his memoir, *From Third World to First: The Singapore Story*, he stated that there was a \"wide and deep gap\" between what Hong Kong people wanted and expectations of China's leaders. He reinforced this view in *One Man's View of the World* when he stated that, in contrast to the Hong Kong people, \"I don't believe the Chinese people themselves believe that with 1.3 billion people you can have one man, one vote for a president\". ### Europe Lee observed that the [United Kingdom](/wiki/United_Kingdom) wanted a [European Union](/wiki/European_Union) more focused on the economic aspect of the [single market](/wiki/Single_market), and not as a political integration project. Lee was also pessimistic about the euro and the European Union when he was interviewed for *One Man's View of the World*, stating that without real fiscal integration, the euro was doomed, and that without deeper integration into a [United States of Europe](/wiki/European_Federation), \"Europe will be reduced to the role of supporting actor\". Lee added that the EU was likely to fail because of \"too fast an enlargement\" and that the euro in its \"present form\" cannot be saved because “you cannot have monetary integration without fiscal integration”. ### Leaked diplomatic cables In [leaked diplomatic cables](/wiki/United_States_diplomatic_cables_leak) to the US, Lee described the North Korean regime as \"psychopathic\", described then [Vice-President of the People's Republic of China](/wiki/Vice_President_of_the_People%27s_Republic_of_China) [Xi Jinping](/wiki/Xi_Jinping) as a \"princeling\" and expressed his belief that the Japanese government may develop nuclear technologies in the future. ### Vietnam Lee supported the [Vietnam War](/wiki/Vietnam_War). Regarding the [Fall of Saigon](/wiki/Fall_of_Saigon) Lee expressed \"astonishment and alarm at the rapidity with which the situation fell apart\" He remarked that \"the battle was not fought in Vietnam alone; it was fought in Washington\". He would later express more critical attitudes to the war saying America \"made a mess\" out of the war. In 1967 he said \"Let us hope that all countries persevere and strive for a fair solution to this tragic conflict in Vietnam, so that the enormous sacrifices that have been and are still being made, will be worthwhile—namely by securing a more peaceful Asia, where both the non-communist and communist parts of it learn to live with each other, and to leave each other’s political systems alone\". ## Domestic policy ### Economics Originally Lee was influenced by the [Fabian Society](/wiki/Fabian_Society) and years after returning from Singapore he continued to subscribe to their magazines and newspapers. Lee believed that balance was needed in economic policy - \"A society to be successful must maintain a balance between nurturing excellence and encouraging the average to improve\". Lee stated that there must be both \"cooperation and competition between people\" which he asserted was a middle way between communism which relied too much on cooperation, and American capitalism which he considered to rely too much on competition. Regarding the [welfare state](/wiki/Welfare_state) Lee was critical. He thought it promoted inexertion and dependency - \"The principle is that you must work. We are not going to pay you for lying around\". He described Singapore as a \"fair, not welfare, society\". Welfare states were said to harm competition and economic growth by creating a reliance on others instead of self-reliance and hard work. ### Democracy Lee did not believe that \"democracy necessarily leads to development\" and that \"the exuberance of democracy leads to undisciplined and disorderly conditions which are inimical to development\". > So when people say, 'Oh, ask the people!' It's childish rubbish. We are leaders. We know the consequences. You mean that ice-water man knows the consequences of his vote? They say people can think for themselves? Do you honestly believe that the chap who can't pass primary six knows the consequences of his choice when he answers a question viscerally on language, culture and religion? —Lee Kuan Yew, 1998. Lee was an outspoken critic of Western ideals of democracy, stating that \"with a few exceptions, democracy has not brought good government to developing countries.\" He argued that in states such as China, the concept of democracy was simply \"not workable\", because of the large population size that had to be canvassed, while in India, the results of democracy \"have not been spectacular\". He believed in the state interference of the media and personal lives of citizens. He has been criticised for using his political power to wage lawsuits to bankrupt and imprison his political opponents, as in the case of [J. B. Jeyaretnam](/wiki/J._B._Jeyaretnam) and [Chee Soon Juan](/wiki/Chee_Soon_Juan). [Francis Seow](/wiki/Francis_Seow), the former solicitor-general of Singapore, has described Lee as such: > [T]he prime minister uses the courts… to intimidate, bankrupt, or cripple the political opposition. Distinguishing himself in a caseful of legal suits commenced against dissidents and detractors for alleged defamation…, he has won them all. ### Press Regarding the press Lee remarked that \"freedom of the news media must be subordinated to the overriding needs of Singapore, and to the primacy of purpose of an elected government.\" Lee's views on the press were shaped by his early experiences in Malayan and Singaporean politics, as a result of which he developed a pessimistic view of the press, declaring that \"the freedom of the press was the freedom of its owners to advance their personal and class interests\" in contrast to the press' claims that they were \"the defender of truth and freedom of speech\". Lee was critical of Western notions of the press. He said \"I do not subscribe to the Western practice that allows a wealthy [press baron](/wiki/Media_proprietor) to decide what voters should read day after day\". As such he made it law that no person shall own a [controlling interest](/wiki/Controlling_interest) in a newspaper. He also spoke critically of applying the \"American concept of the 'marketplace of ideas'\" to Singapore, as due to Singapore's ethnic and religious diversity this principle had often led to \"riots and bloodshed\". Lee opposed the influence of foreign news media on Singapore, foreign media were allowed in Singapore \"in order to report Singapore to their fellow countrymen\" but they cannot be allowed to become \"that of invigilator, adversary and inquisitor of the administration\". He allowed the selling of foreign newspapers in Singapore so that Singaporeans \"can know what foreigners are reading about us\" but was critical of their influence, believing they could \"radically change the nature of Singaporean society\". ### Race Lee's policies and views on race have drawn both praise for their political pragmatism and success as well as criticism for being racially prejudiced; in 1997 he stated, for instance, that \"the blacks on average score 85 per cent on IQ and it is accurate, nothing to do with culture. The whites score on average 100. Asians score more … the Bell curve authors put it at least 10 points higher\". Lee's policies on race are regarded to have quashed historical [racial tensions](/wiki/1964_race_riots_in_Singapore) in Singapore, placing emphasis on [multiracialism](/wiki/Multiracialism) and equal protection under the law in the face of advocacy for [special privileges granted to certain races](/wiki/Article_153_of_the_Constitution_of_Malaysia). As prime minister, Lee aggressively promoted racial integration through his policies on language and culture, which many have described as [social engineering](/wiki/Social_engineering_(political_science)). ### Jury system Under Lee's tenure as prime minister, the judicial system was revamped. In 1959, the PAP submitted a bill in parliament to abolish jury trials for all cases except those involving [capital punishment](/wiki/Capital_punishment). In a speech on the bill, Lee criticised juries for being unrepresentative of the true populace of Singapore on the basis that only those fluent in the English language could understand and participate. Trials by jury were totally abolished in 1969. In his later years, Lee expressed that he disliked jury systems since his early days as a lawyer, and had \"no faith in a system that allowed the superstition, ignorance, biases, and prejudices of seven jurymen to determine guilt or innocence.\" ### Internal Security Act Lee has been criticised for his \"free use\" of the [Internal Security Act](/wiki/Internal_Security_Act_(Singapore)) (ISA), a statute that allows for detention without trial of any individual deemed dangerous to society. In response, he has stated that Singapore has \"to lock up people, without trial... [or] the country would be in ruins.\" In 1963, he initiated and executed [Operation Coldstore](/wiki/Operation_Coldstore), a security operation that utilised the Preservation of Public Security Ordinance, a precursor to the ISA, to arrest 113 suspected communists and communist sympathisers. The legacy of Coldstore remains contentious, with historian [PJ Thum](/wiki/Thum_Ping_Tjin) stating in a parliamentary committee that \"Coldstore was fundamentally motivated by political, not security, reasons.\" ### Population planning It is said that Lee's policy in the 1960s and 1970s ([stop at two](/wiki/Population_planning_in_Singapore)) worked too well and the birth rate declined at a rapid rate and resulted in an [ageing population](/wiki/Ageing_population). In 2008, Lee said he was 'not quite sold' on idea of 6.5 million population for Singapore in a news article published in *The Straits Times* on 2 February 2008. He said he felt a population of 5.5 million would be the maximum that could live comfortably in the available space. ### Environmentalism Lee envisioned Singapore as a [garden city](/wiki/Garden_city_movement), declaring that \"no other hallmark of success will be more distinctive than that of achieving our position as the cleanest and greenest city in [South Asia](/wiki/South_Asia)\". He would later say that \"[greening](/wiki/Greening) is the most cost-effective project I have launched\". Lee set up an 'Anti-Pollution Unit' stating that its importance resided in giving citizens \"respite from city centres\" and in the small size of Singapore which made it necessary to \"preserve a clean and gracious environment for rich and poor alike\". In 1995 Lee declared \"I have always believed that a blighted urban landscape, a concrete jungle, destroys the human spirit. We need the greenery of nature to lift our spirits\". Lee saw this as a means of attracting tourists and businesspeople to the city. He wrote that \"without a word being said, they would know that Singaporeans were competent, disciplined, and reliable, a people who would learn the skills they required soon enough\". After independence Lee sought for \"some dramatic way to distinguish ourselves from other Third World countries. I settled for a clean and green Singapore\" because \"if we had [First World](/wiki/First_World) standards then business people and tourists would make us a base for their business and tours of the region\". ### Political philosophy Lee was a stern advocate of pragmatism, stating that he was not \"enamoured with ideology\" but instead with what works. For Lee \"the ultimate test of the value of a political system\" was \"whether it helps that society to establish conditions which improve the [standard of living](/wiki/Standard_of_living) for the majority of its people\". Lee championed [Asian values](/wiki/Asian_values) which he described as the \"primacy of group interests over individual interests\" which \"support the total group effort necessary to develop rapidly\". He described the difference between Asian values and Western values as such - \"The main object is to have a well-ordered society so that everybody can have maximum enjoyment of his freedoms. This freedom can only exist in an ordered state and not in a natural state of contention and anarchy\". Lee believed that \"the rights of the society as a whole must, in my view, to make Singapore work, be placed above the rights of the individual, otherwise it will not work. If everybody is out after his own interests, regardless of everybody else, the society will just disintegrate. In an interview in the *[Straits Times](/wiki/Straits_Times)* in 1987, Lee said: > I am often accused of interfering in the private lives of citizens. Yes, if I did not, had I not done that, we wouldn’t be here today. And I say without the slightest remorse, that we wouldn’t be here, we would not have made economic progress, if we had not intervened on very personal matters–who your neighbour is, how you live, the noise you make, how you spit, or what language you use. We decide what is right. Never mind what the people think. Lee stated that he started off believing everybody was equal but that \"because millions of years have passed over evolution, people have scattered across the face of this earth, been isolated from each other, developed independently, had different intermixtures between races, peoples, climates, soils\" which meant that this was \"the most unlikely thing ever to have been\". Lee said that the size of a nation does not alone make it great, he emphasized \"the will, the cohesion, the stamina, the discipline of its people and the quality of their leaders\" and that \"what we lack in numbers, we will make up for in quality: in the standards of discipline, training, dedication and leadership\". He contended that the role of a leader was to \"inspire and to galvanize\", instead of sharing \"your distraught thoughts\" which can demoralize a people and this is important not to do as \"the art of government is the art of building up [team spirit](/wiki/Team_spirit)\". He stated that after the [independence of Singapore](/wiki/Independence_of_Singapore) he feared for Singapore's future but kept these fears to himself as his job was to give people hope. ### LGBT rights Under Lee's tenure as prime minister, homosexuals were arrested and prosecuted under [section 377A](/wiki/Section_377A_(Singapore)) of the penal code. In his later years, Lee appeared to become more supportive of LGBT issues, expressing a belief that homosexuality was genetic and questioning the rationale behind its criminalisation, asking \"Why should you criminalize it? It's a genetic variation.\" He believed that homosexuality would eventually be accepted in Singapore, but advocated for a measured and \"pragmatic approach\" toward the matter \"to maintain social cohesion.\" During a [CNN](/wiki/CNN) radio interview in 1998, Lee was asked about [LGBT rights in Singapore](/wiki/LGBT_rights_in_Singapore). The question was posed by an unnamed homosexual man in Singapore who asked about the future of LGBT people there. Lee replied that it was not for the government to decide whether or not homosexuality was acceptable but for the Singaporean society to decide. He also said he did not think an \"aggressive gay rights movement\" would change people's minds on the issue. He added that the government would not interfere or harass anybody, whether heterosexual or otherwise. Saying he took a \"purely practical view\" on the issue, Lee said, \"Look, homosexuality will eventually be accepted. It's already been accepted in China. It's only a matter of time before it is accepted here. If we get a Cabinet full of Christians, we're going to get an intolerant Cabinet. We're not going to allow that.\" Asked whether Singapore was ready for a gay member of parliament, Lee said, \"As far as I'm concerned, if she does her work as an MP, she looks after her constituents, she makes sensible speeches, she's making a contribution, her private life is her life, that's that.\" At a Young PAP meeting in 2007, [Loretta Chen](/wiki/Loretta_Chen), an openly lesbian young PAP member and a theatre director in Singapore, asked Lee if the current censorship rules in Singapore were too equivocal and where censorship was headed in the next two decades. Chen referred to a controversial play about Singaporean porn actress [Annabel Chong](/wiki/Annabel_Chong) which explored pornography and alternative sexuality. Lee was then asked if he believed homosexuality was a product of nature or nurture. He replied that he had asked doctors about homosexuality and had been told that it was caused by a genetic random transmission of genes. In a wide-ranging interview conducted on 24 August 2007 at the [Istana](/wiki/The_Istana) with Leonard M. Apcar, deputy managing editor of the [International Herald Tribune](/wiki/International_Herald_Tribune), Singapore correspondent Wayne Arnold, and Southeast Asia bureau chief Seth Mydans, Lee said, \"we take an ambiguous position. We say, O.K., leave them alone but let's leave the law as it is for the time being and let's have no gay parades.\" In Lee's book *Hard Truths to Keep Singapore Going*. Lee stated that if one of his grandchildren turned out to be homosexual, he would accept his grandchild because he believed that homosexuality was genetic. He also questioned if LGBT people were suited to bringing up a child as they have no maternal instinct aroused by the process of pregnancy. In May 2019, Lee's grandson and son of [Lee Hsien Yang](/wiki/Lee_Hsien_Yang), Li Huanwu ([Chinese](/wiki/Chinese_language): 李桓武), who is homosexual, married his partner in [South Africa](/wiki/South_Africa).\n",
  "language": "en",
  "processed_at": "2026-01-12T11:43:57.753395",
  "title": "Political positions of Lee Kuan Yew",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Political_positions_of_Lee_Kuan_Yew"
}