{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:44:02.803371"
  },
  "content": "Index to describe air quality[Southeast Asian haze](/wiki/Southeast_Asian_haze) seriesHaze in [Borneo](/wiki/Borneo), (/wiki/2019_Southeast_Asian_haze)History1990s - [1997 Southeast Asian haze](/wiki/1997_Southeast_Asian_haze) - [1997 Indonesian forest fires](/wiki/1997_Indonesian_forest_fires) 2000s - [2005 Malaysian haze](/wiki/2005_Malaysian_haze) - [2006 Southeast Asian haze](/wiki/2006_Southeast_Asian_haze) - [2009 Southeast Asian haze](/wiki/2009_Southeast_Asian_haze) 2010s - [2010 Southeast Asian haze](/wiki/2010_Southeast_Asian_haze) - [2013 Southeast Asian haze](/wiki/2013_Southeast_Asian_haze) - [2015 Southeast Asian haze](/wiki/2015_Southeast_Asian_haze) - [2016 Malaysian haze](/wiki/2016_Malaysian_haze) - [2016 Southeast Asian haze](/wiki/2016_Southeast_Asian_haze) - [2017 Southeast Asian haze](/wiki/2017_Southeast_Asian_haze) - [2019 Southeast Asian haze](/wiki/2019_Southeast_Asian_haze) Key topics - [Chemical equator](/wiki/Chemical_equator) - Deforestation - [in Borneo](/wiki/Deforestation_in_Borneo) - [in Indonesia](/wiki/Deforestation_in_Indonesia) - [Mega Rice Project](/wiki/Mega_Rice_Project) - [Peat swamp forest](/wiki/Peat_swamp_forest) - [Borneo](/wiki/Borneo_peat_swamp_forests) Responses - [ASEAN Agreement on Transboundary Haze Pollution](/wiki/ASEAN_Agreement_on_Transboundary_Haze_Pollution) - [Operation Haze](/wiki/Operation_Haze) - [Transboundary Haze Pollution Act 2014](/wiki/Transboundary_Haze_Pollution_Act_2014) - [People's Movement to Stop Haze](/wiki/People%27s_Movement_to_Stop_Haze) See also - [Air pollution in Malaysia](/wiki/Air_pollution_in_Malaysia) - [API](/wiki/Air_Pollution_Index) - Singapore PSI - [Social and environmental impact of palm oil](/wiki/Social_and_environmental_impact_of_palm_oil) Category - v - t - e The **Pollutant Standards Index** (**PSI**) is a type of [air quality index](/wiki/Air_quality_index) used in [Singapore](/wiki/Singapore), which is a number used to indicate the level of pollutants in air. Initially PSI was based on five air pollutants, but since 1 April 2014 it has also included fine [particulate matter](/wiki/Particulates) (PM2.5). In addition to the PSI derived by averaging data collected for the past 24 hours, Singapore also publishes 1-hr PM2.5 concentrations are also published every hour. Besides Singapore, some other countries also use air quality indices. However, the calculations used to derive their air quality indices may differ. Different countries also use different names for their indices such as Air Quality Health Index, Air Pollution Index and Pollutant Standards Index. ## History The PSI is based on a scale devised by the [United States Environmental Protection Agency](/wiki/United_States_Environmental_Protection_Agency) (EPA) to provide a way for broadcasts and newspapers to report air quality on a daily basis. The PSI has been used in a number of countries including the United States and Singapore. Since 1999, the US EPA has replaced the Pollution Standards Index (PSI) with the [Air Quality Index](/wiki/Air_quality_index#United_States) (AQI) to incorporate new [PM2.5](/wiki/Particulate) and [ozone](/wiki/Ozone) standards. Prior to 1 April 2014, Singapore published the PSI and the 1-hour PM2.5 reading separately. This 3-hour PSI is unique to Singapore and was introduced in 1997 to provide additional air quality information which would better reflect a more current air quality situation. In 2016, the 3-hour PSI was phased out on the grounds that the 1-hour PM2.5 reading was a better indicator of the current air quality. ## Definition of the PSI used in Singapore The PSI considers six air pollutants: sulphur dioxide (SO2), particulate matter (PM10), fine particulate matter (PM2.5), nitrogen dioxide (NO2), carbon monoxide (CO) and ozone (O3). The concentrations of these pollutants in the ambient air are measured via a network of air monitoring stations located around Singapore. A sub-index value is computed for each pollutant based on the pollutant's ambient air concentration. The highest sub-index value is then taken as the PSI value. In other words, the PSI is determined by the pollutant with the most significant concentration. During [haze](/wiki/Southeast_Asian_haze) episodes, PM2.5 is the most significant pollutant. The PSI is reported as a number on a scale of 0 to 500. The index figures enable the public to determine whether the air pollution levels in a particular location are good, unhealthy, hazardous or worse. The following PSI table is grouped by index values and descriptors, explaining the effects of the levels, according to Singapore's [National Environment Agency](/wiki/National_Environment_Agency) (NEA). PSIDescriptorGeneral Health Effects0–50GoodNone51–100ModerateFew or none for the general population101–200UnhealthyEveryone may begin to experience health effects; members of sensitive groups may experience more serious health effects. To stay indoors.201–300Very unhealthyHealth warnings of emergency conditions. The entire population is more likely to be affected.301+HazardousHealth alert: everyone may experience more serious health effects Note: This chart reflects the guidelines used in Singapore and may differ from other countries. Health advisories are based on the US EPA's guidelines. Only the 24-hour PSI value and not the 3-hour PSI value is correlated to the health effects outlined in NEA's advisories. ### Record values of the PSI Singapore has been regularly hit by [smoke haze](/wiki/Southeast_Asian_haze) from forest fires in nearby [Sumatra](/wiki/Sumatra), [Indonesia](/wiki/Indonesia), brought over by wind. These forest fires have been attributed to the [slash-and-burn](/wiki/Slash-and-burn) method favoured by several large plantation owners to clear their land, as opposed to a more expensive and inconvenient mechanical approach using excavators and bulldozers. In June 2013, severe [haze](/wiki/Haze) hit [Singapore](/wiki/Singapore), pushing the nation's PSI into *Hazardous* levels for the first time in its history. Presently, the highest 3-hour PSI reading on record in Singapore is 471 on 20 October 2015 at 11 pm (GMT+8). ### Association with health outcomes Singapore's computation of PSI and NEA's definitions of PSI ranges have been shown to correlate with a number of health outcomes including all-cause mortality. For sudden cardiac deaths, every increment of 30 units in PSI correlated with 8.15% increased risk of out-of-hospital cardiac arrest on the same day of exposure. This risk was found to remain elevated for 1–5 days after exposure. Similar short-term associations were subsequently found for acute myocardial infarction and acute ischemic stroke in analyses of national registries. In terms of healthcare utilization, both country-wide Emergency Department visits and hospital admissions were increased per unit increase in PSI. - Past and present PSI readings in Singapore published by the NEA\n",
  "language": "en",
  "processed_at": "2026-01-12T11:44:02.802931",
  "title": "Pollutant Standards Index",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Pollutant_Standards_Index"
}