{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:44:07.845878"
  },
  "content": "Chinese food often eaten at Ching Ming Festival **Popiah** ([Pe̍h-ōe-jī](/wiki/Pe%CC%8Dh-%C5%8De-j%C4%AB): *po̍h-piáⁿ*, [Teochew Peng'im](/wiki/Peng%27im): boh⁸ bian²) is a [Fujianese](/wiki/Fujianese_cuisine)/[Teochew-style](/wiki/Teochew_cuisine) fresh [spring roll](/wiki/Spring_roll) filled with an assortment of fresh, dried, and cooked ingredients, eaten during the [Qingming Festival](/wiki/Qingming_Festival) and other celebratory occasions. The dish is made by the people and [diaspora](/wiki/Diaspora) of [Fujian](/wiki/Fujian) province of China (in [Quanzhou](/wiki/Quanzhou), [Xiamen](/wiki/Xiamen), and [Zhangzhou](/wiki/Zhangzhou)), neighbouring [Chaoshan](/wiki/Chaoshan) district, and by the [Teochew](/wiki/Teochew_people) and [Hoklo](/wiki/Hoklo_people) [diaspora](/wiki/Diaspora) in various regions throughout [Southeast Asia](/wiki/Southeast_Asia) and in [Taiwan](/wiki/Taiwan) (due to the majority of Taiwanese being Hoklo), The origin of popiah dates back to the 17th century. ## Etymology In the [Chaoshan dialect](/wiki/Chaoshan_dialect) and [Hokkien language](/wiki/Hokkien), *popiah* is pronounced as /poʔ˩piã˥˧/ (薄餅), which means \"thin flatbread/cake\". Depending on the regions in Fujian, it is also commonly referred to as /lun˩piã˥˧/ (潤餅), which is the etymological origin of \"[lumpia](/wiki/Lumpia)\" in the Philippines and Indonesia. It is referred to as *rùnbǐng* (潤餅) or *báobǐng* (薄餅) in [Mandarin](/wiki/Standard_Mandarin), and also as *bópíjuǎn* (薄皮卷). ## Wrapper and fillings A *popiah* \"skin\" (薄餅皮) is a soft, thin paper-like [crêpe](/wiki/Cr%C3%AApe) or pancake made from wheat flour. The method of producing the wrapper involves making an extremely wet and viscous dough. A ball of this dough is held to the right hand, then quickly \"rubbed\" (擦薄餅皮, [Hokkien](/wiki/Hokkien): chhat po̍h-piáⁿ phê, literally \"to rub a popiah crepe\") against a hot steel plate in a circular fashion, and lifted. Through this process, a very thin layer of the wet dough adheres to the plate and begins to cook. The upper surface of the crêpe is then usually cleaned of excess pieces of dough using the dough ball through a dabbing process. When the dough has been cooked to completion, it is peeled off from the hot steel plate before being removed. The rubbing is typically done over two or three plates at once, which allows the baker to continuously produce crepes and gives enough time for each crepe to be properly cooked. It is eaten in accompaniment with a sweet sauce (often a bean sauce), a blended [soy sauce](/wiki/Soy_sauce) or [hoisin sauce](/wiki/Hoisin_sauce) or a [shrimp paste](/wiki/Shrimp_paste) sauce (蝦膎, hae-ko, [Pe̍h-ōe-jī](/wiki/Pe%CC%8Dh-%C5%8De-j%C4%AB): *hê-ko*, [Tâi-lô](/wiki/T%C3%A2i-u%C3%A2n_L%C3%B4-m%C3%A1-j%C4%AB_Phing-im_Hong-%C3%A0n): *hê-kê*), and optionally with hot [chilli sauce](/wiki/Chilli_sauce) before it is filled. The filling is mainly finely grated and steamed or stir-fried [turnip](/wiki/Turnip), [jicama](/wiki/Jicama) (known locally as *bangkuang*, 芒光, [Tâi-lô](/wiki/T%C3%A2i-l%C3%B4): bâng-kuang), which has been cooked with a combination of other ingredients such as [bean sprouts](/wiki/Bean_sprout), [French beans](/wiki/French_bean), and lettuce leaves, depending on the individual vendor, along with grated [carrots](/wiki/Carrots), slices of [Chinese sausage](/wiki/Chinese_sausage), thinly sliced fried [tofu](/wiki/Tofu), chopped peanuts or peanut powder, fried shallots, and shredded [omelette](/wiki/Omelette). Other common variations of popiah include pork (lightly seasoned and stir-fried), shrimp or crab meat. Seaweed is often included in the Xiamen (Amoy) versions. Some hawkers in Malaysia and Singapore, especially in non-[halal](/wiki/Halal) settings, will add fried pork lard. As a fresh spring roll, the *popiah* skin itself is not fried. Two common ways of eating this are holding them like a burrito, which some prefer, while others cut the popiah roll into slices and pick them up with chopsticks. It requires some skill to pick the pieces up with chopsticks. Spoons are seldom provided at the establishments. ## Types In China, Taiwan, Singapore and Malaysia there are \"*popiah* parties\" at home, where the ingredients are laid out and guests make their own *popiah* with proportions of ingredients to their own personal liking. ### Taiwanese In Taiwan, *popiah* is called *runbing* (潤餅) in Mandarin, *jūn-piánn(-kauh)* in [Taiwanese Hokkien](/wiki/Taiwanese_Hokkien). The stuffing itself is quite diverse among different places. The basic stuffing includes vegetables that grow in spring, meat and thinly shredded omelette. In some places, they also add noodles, Chinese sausages, stewed vegetables instead of blanched ones, tofu, seafood, sticky rice, and so on. Furthermore, the way of cooking the stuffing is very different as well. In northern Taiwan, the stuffing is flavoured, stir-fired, sometimes it goes with peanut powder, and the sauce is salty. In southern Taiwan, the popiah stuffing is water blanched without additional seasoning, and flavoured primarily with sugar and peanut powder. For people who live in southern Taiwan, the addition of sufficient sugar is key for popiah. Moreover, some people like to heat or steam the spring roll again after it is made. Some food stalls serve popiah filled with ice cream. This is a sweet and savory treat - the ice cream is commonly pineapple, peanut and taro flavored, or these three flavors swirled together. The vendor will have a giant block of peanut candy nearby. They will shave this in front of you to create a bed of peanut shavings on the popiah skin. Then the three scoops of ice cream are placed on the bed. It is customary to add a piece of cilantro before the whole thing is wrapped up and handed to you. Some people have dubbed it an ice-cream burrito. ### Southeast Asian In Malaysia and Singapore, *popiah* is part of [Chinese cuisine](/wiki/Chinese_cuisine) of these two countries. However, in both countries, as well as in [Brunei](/wiki/Brunei), *popiah* (especially the fried variant) is also popular as part of local street food. In Vietnam, *bò bía* is the [Vietnamese](/wiki/Vietnamese_cuisine) variant of popiah, introduced by [Teochew](/wiki/Teochew_people) immigrants. It is common to see an old Teochew man or woman selling *bò bía* at their roadside stand. In [Cambodian cuisine](/wiki/Cambodian_cuisine), *popiah* is known as *num por pia* ([Khmer](/wiki/Khmer_language): នុំពពៀ). In [Thai cuisine](/wiki/Thai_cuisine), two types of *popia* ([Thai](/wiki/Thai_language): เปาะเปี๊ยะ) are popular: *popia sot* (fresh spring roll) and *popia thot* (deep-fried spring roll). In addition, Thai cuisine has also incorporated the Vietnamese *[summer roll](/wiki/Summer_roll)* under the name *kuaitiao lui suan* ([Thai](/wiki/Thai_language): ก๋วยเตี๋ยวลุยสวน). While in [Burma](/wiki/Burma)/[Myanmar](/wiki/Myanmar), it is known as *kawpyan* (ကော်ပြန့်). Similar foods in other cuisines include the [Filipino](/wiki/Filipino_cuisine) *[lumpiang sariwa](/wiki/Lumpia#Lumpiang_Sariwa)* and the [Indonesian](/wiki/Indonesian_cuisine) *[Lumpia](/wiki/Lumpia) Basah* spring rolls which are served with [peanut sauce](/wiki/Peanut_sauce), etymologically derived from the Hokkien name Lum Pia. Majority of ethnic Chinese in both countries are of Hokkien origin. - [Lumpia](/wiki/Lumpia) (the Philippines and Indonesia) - [Chinese pancake](/wiki/Chinese_pancake) - [Burrito](/wiki/Burrito) - [Fajitas](/wiki/Fajitas) - [Summer roll](/wiki/Summer_roll) - Popiah Recipe - Yeo's Teochew Popiah Recipe\n",
  "language": "en",
  "processed_at": "2026-01-12T11:44:07.845580",
  "title": "Popiah",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Popiah"
}