{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:44:09.722359"
  },
  "content": "Singaporean bookstore company **Popular Holdings Limited**, more commonly known as just **Popular** (stylized in [all caps](/wiki/All_caps)) or colloquially as the **Popular Bookstore**, is a [Singaporean](/wiki/Singapore) multinational bookstore chain. Aside from Singapore, it also has subsidiaries in countries such as [Canada](/wiki/Canada), [China](/wiki/China) (including [Hong Kong](/wiki/Hong_Kong) and [Macau](/wiki/Macau)), [Taiwan](/wiki/Taiwan), [Malaysia](/wiki/Malaysia), [United Kingdom](/wiki/United_Kingdom), and the [United States](/wiki/United_States). During the [financial year](/wiki/Financial_year) of 2011, it had a [turnover](/wiki/Revenue) of approximately [S$](/wiki/Singapore_dollar)735.9 million. ## Overview The first Popular Bookstore was set up in 1924 by Chou Sing Chu in Singapore, initially focusing on retailing Chinese books and stationery. In March 2006, Popular Holdings was the main organiser of BookFest@Singapore, the first [Chinese-language](/wiki/Chinese_language) book fair ever held outside of China. In May 2006, Popular Holdings staged the inaugural BookFest@Malaysia in Kuala Lumpur. It is a platform for established publishers to showcase their latest publications and renowned authors to meet and interact with the readers. The inaugural BookFest@Hong Kong was organized in 2008. By 2009, the annual BookFest has become a major event of the book industries in Singapore, Malaysia and Hong Kong. The company was founded with the intention to publish, distribute and retail Chinese language books or books catering to the interests of [Singaporeans](/wiki/Singaporeans). Ever since, one of the company's goals has been to cater to the interests of a wider, more diverse clientele. ## Board of directors Popular is headed by Dr Yiu Chi Shing, who is the Chairman & Group CEO of POPULAR.Mr Shen Zheqing Simon is Director.Ms Yiu Nga Yu Emily is Chief Executive Officer, Singapore. Mr Poon Chi Wai Ponch is Chief Executive Officer, Greater China And Canada. Ms Lim Lee Ngoh Executive Director, Malaysia. ## Group of Companies The Group currently carries out its publishing activities through subsidiaries operating in Singapore, Malaysia, Hong Kong, Macau, Taiwan and Canada. Its bookstore operations currently have a network of over 130 Popular Bookstores in Singapore, Malaysia and Hong Kong. It now has its core businesses in retail, distribution, publishing and e-learning. ## Retail Back in 1936, Popular focused on the retailing of Chinese books and stationery. It has now expanded its product offerings to include English books, Malay books, textbooks and assessment books, Gadgets & IT products, household appliances, titbits, stationery, multimedia products and many more. It currently has stores in Singapore, Malaysia and Hong Kong. ## Bookfest POPULAR held its first BookFest in 2006. It had started out with the objective of promoting the reading of Chinese across regions and bringing in the foremost works of Chinese literature. ## Distribution and Publishing In 1999, POPULAR Group set up a purchasing office in Taiwan to purchase Chinese books for Singapore, Malaysia and Hong Kong. With the expansion of the business, Popular Book Company Ltd was established in 2003 as a subsidiary of POPULAR Group. POPULAR Group now exports Chinese books in Taiwan, distributes books to Singapore, Malaysia, and Hong Kong through around 188 POPULAR outlets. Novum Organum, also a subsidiary of POPULAR, is the distributor for the Group’s house brands and focuses on the book markets in Singapore and Malaysia. ## E-Learning POPULAR made an early foray into e-Learning in Hong Kong, with the establishment of Popular e-Learning (HK) Ltd. (‘PeLH’) in 2000. It provides e-Learning software and solutions to schools in Hong Kong, South East Asia and Taiwan. In 2001, Guangzhou Cyber Progress Information Technology Limited (GCPIT) was established to support PeLH in its efforts. ## Subsidiaries The list of its subsidiaries is listed below: - Active & Independent Education Limited - Ampress Limited - Arajasa Corporation Sdn Bhd - CD Rama Limited - CD Rama Sdn Bhd - Cyber Progress Technology Limited - Educational Publishing House Limited - Educational Publishing House Pte Ltd - Educational Publishing House, Limited - Eduland Pte Ltd - EduSmart Company Limited - English Language Publishing Limited - EPH Publishing (M) Sdn Bhd - Epilogue Catering Ptd Ltd - Guangzhou Cyber Progress Information Technology Limited - Guangzhou Pan Lloyds Information Technology Development Company Limited - Harris Book Company (M) Sdn Bhd - Harris Book Company Limited - Harris Book Company Pte Ltd - Kam Pui Enterprises Limited - Kinder Education Press Limited - New Chapter Book Company Pte Ltd - Novum Organum Publishing House (M) Sdn Bhd - Novum Organum Publishing House Pte Ltd - Pan Lloyds Education Limited - Pan Lloyds Publishers Limited - Popular Book Company (Canada) Limited - Popular Book Company Limited - Popular Book Company Pte Ltd - Popular Book Co. (Malaysia) Sdn Bhd - Popular e-Learning (Beijing) Ltd - Popular e-Learning (H.K.) Limited - Popular e-Learning Holdings Pte Ltd - Popular Land Investment Pte Ltd - Popular Land Pte Ltd - Popular Modern Books Company Limited - Popular Warehouse and Distribution Pte Ltd - PopularWorld (Beijing) Limited - PopularWorld.com Pte Ltd - Prologue Publishing Pte Ltd - Seashore Publishing (M) Sdn Bhd - Smart English Company Limited Portals: - Singapore - Companies\n",
  "language": "en",
  "processed_at": "2026-01-12T11:44:09.722090",
  "title": "Popular Holdings",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Popular_Holdings"
}