{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:44:11.650428"
  },
  "content": "Singapore government white paper on population ***A Sustainable Population for a Dynamic Singapore: Population White Paper***, commonly referred to as the **Population White Paper** (PWP), was a controversial [white paper](/wiki/White_paper) released by the [government of Singapore](/wiki/Government_of_Singapore) under the [People's Action Party](/wiki/People%27s_Action_Party) (PAP) in 2013, projecting [Singapore](/wiki/Singapore)'s population to reach 6.9 million by 2030. ## Background The PWP argued that up to 30,000 new [permanent residents](/wiki/Permanent_resident) and 25,000 [naturalized citizens](/wiki/Naturalized_citizen) each year are needed to sustain Singapore's population due to the falling birth rates in Singapore. The PWP projects an increase of 1.6 million people from 2013, or an average of 100,000 more people in Singapore each year. It also justified [immigration](/wiki/Immigration_to_Singapore) and [presence of foreign workers](/wiki/Immigrant_workers_in_Singapore) as helping local businesses thrive and \"create good jobs for Singaporeans\". The PWP also included additional measures to encourage marriage and increase the birth rate. The motion was carried by a vote of 77 to 13 in the [People's Action Party](/wiki/People%27s_Action_Party) (PAP)–[dominated Parliament](/wiki/12th_Parliament_of_Singapore), after amendments were made to remove the phrase \"population policy\" and to place stronger emphasis on infrastructure and transport development. Opposition came from non–PAP parliamentarians, including all seven MPs from the [Workers' Party](/wiki/Workers%27_Party_of_Singapore) (WP). Three [Non-constituency Members of Parliament](/wiki/Non-constituency_Members_of_Parliament) (NCMPs) also voted against the motion, comprising two from the WP and one from the [Singapore People's Party](/wiki/Singapore_People%27s_Party) (SPP). Among the [Nominated Members of Parliament](/wiki/Nominated_Member_of_Parliament) (NMPs), three opposed it while one abstained. ## Reception Several opposition parties opposing the PWP have taken it to be a targeted increase of Singapore's population to 6.9 million. Even some politicians within the PAP opposed the target, with [backbencher](/wiki/Backbencher) MP [Inderjit Singh](/wiki/Inderjit_Singh_(Singaporean_politician)) speaking out against the white paper and rebutting [Minister of National Development](/wiki/Ministry_of_National_Development_(Singapore)) [Khaw Boon Wan](/wiki/Khaw_Boon_Wan)'s analogy comparing population planning to catering for guests at a wedding banquet. In an 8 February 2013 speech in support of the PWP, Prime Minister [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) said that he expected the 2030 population to be \"significantly below\" the 6.9 million figure, but that 6 million would not be enough, because of the declining birth rate and the needs of aging people. Many Singaporeans responded to the PWP with shock and anger. On 16 February 2013, about 4,000 Singaporeans assembled at the [Speakers' Corner](/wiki/Speakers%27_Corner,_Singapore) in [Hong Lim Park](/wiki/Hong_Lim_Park) to demonstrate against the PWP. Protesters expressed fears that the proposed population growth would overburden public services and further raise the cost of living. It was regarded as the largest anti government protest held at the Speakers' Corner since its opening in 2000. Many Singaporeans have attributed the government's liberal population and immigration policies to issues such as overcrowding, declining reliability of public transport due to overuse, rising property prices, suppressed wages, greater competition for jobs particularly for professionals, managers, executives and technicians (PMETs) as well as challenges in education, growing income inequality, higher crime rates and other social problems. Academics have also criticised the PWP as being \"overly mechanistic, economically simplistic and astonishingly sociologically and politically naive\". ## Legacy The PWP and population-related issues have since become some of the most debated political topics between the governing PAP and opposition parties in subsequent general elections, including in (/wiki/2015_Singaporean_general_election) and (/wiki/2020_Singaporean_general_election), which included another controversy concerning proposals to further increase the population to 10 million. Singapore's population crossed the 6 million mark in 2024. - [Immigration to Singapore](/wiki/Immigration_to_Singapore) - [Chinese nationals in Singapore](/wiki/Chinese_nationals_in_Singapore) - [Filipinos in Singapore](/wiki/Filipinos_in_Singapore) - [India–Singapore Comprehensive Economic Cooperation Agreement](/wiki/India%E2%80%93Singapore_Comprehensive_Economic_Cooperation_Agreement) - [Demographics of Singapore](/wiki/Demographics_of_Singapore) - population.sg website - *A Sustainable Population for a Dynamic Singapore: Population White Paper*\n",
  "language": "en",
  "processed_at": "2026-01-12T11:44:11.650153",
  "title": "Population White Paper",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Population_White_Paper"
}