{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:44:15.771892"
  },
  "content": "Port in Singapore The **Port of Singapore** is a collection of facilities and [terminals](/wiki/Container_terminal) that conduct maritime trade and handle [Singapore](/wiki/Singapore)'s harbours and shipping. Since 2015, it has been ranked as the world's top maritime capital. Currently, it is ranked as the [world's second-busiest port](/wiki/List_of_busiest_ports_by_cargo_tonnage) in terms of total shipping tonnage, while also [transshipping](/wiki/Transshipment) a fifth of the world's [shipping containers](/wiki/Intermodal_container), and half of the world's annual [crude oil](/wiki/Crude_oil) supplies, alongside being ranked as the world's busiest transshipment port. Furthermore, it was also ranked as the world's busiest port in terms of [total cargo tonnage handled](/wiki/List_of_world%27s_busiest_ports_by_cargo_tonnage) until 2010, when it was surpassed by the [Port of Shanghai](/wiki/Port_of_Shanghai). Due to the city-state's strategic location, Singapore has served as a significant [entrepôt](/wiki/Entrep%C3%B4t) and [trading post](/wiki/Trading_post) on an international level for at least two centuries. During the contemporary era, its ports have been regarded not merely as an economic boon for the country, but as vitally important for the country's economic development since Singapore lacks [land](/wiki/Landform) and [natural resources](/wiki/Natural_resources). Additionally, the port is regarded as particularly important for importing natural resources, and then later re-exporting products after they have been domestically refined and shaped in some manner, for example, [wafer fabrication](/wiki/Wafer_fabrication) or [oil refining](/wiki/Oil_refining) to generate [value-added](/wiki/Value_added) revenue. The Port of Singapore is also the world's largest [bunkering](/wiki/Bunkering) port. Moreover, the majority of ships that pass between the [Indian Ocean](/wiki/Indian_Ocean) and the [Pacific Ocean](/wiki/Pacific_Ocean) go through the Singapore Strait. The [Straits of Johor](/wiki/Straits_of_Johor) on the country's north are impassable for ships due to the [Johor-Singapore Causeway](/wiki/Johor-Singapore_Causeway), built in 1923, which links the town of Woodlands, Singapore, to the city of Johor Bahru in Malaysia. ## History ### Before 1819 In the late 13th century, a Kingdom known as [Singapura](/wiki/Kingdom_of_Singapura) was established on the north bank of the [Singapore River](/wiki/Singapore_River) around what was called the Old Harbour. It was the only port in the southern part of the [Strait of Malacca](/wiki/Strait_of_Malacca), servicing ships and traders in the region, competing with other ports along the coast of the Malacca Strait such as [Jambi](/wiki/Jambi), Kota Cina, Lambri, Semudra, [Palembang](/wiki/Palembang), [South Kedah](/wiki/Kedah), and Tamiang. The port had two functions. First, it made available products that were in demand by international markets; according to the *[Daoyi Zhilüe](/wiki/Daoyi_Zhil%C3%BCe)* (*Brief Annals of Foreign Islands*, 1349) by Chinese trader [Wang Dayuan](/wiki/Wang_Dayuan) (born 1311, *[fl.](/wiki/Floruit)* 1328–1339), these included top-quality [hornbill](/wiki/Hornbill) casques, [lakawood](/wiki/Lakawood), and cotton. Although these goods were also available from other Southeast Asian ports, those from Singapore were regarded as unique in terms of their quality. Secondly, Singapore acted as a gateway into the regional and international economic system for its immediate region. [South Johor](/wiki/Johor) and the [Riau Archipelago](/wiki/Riau_Archipelago) supplied products to Singapore for export elsewhere, while Singapore was the major source of foreign products that were imported to the region. Archaeological artefacts, such as ceramics and glassware, discovered in the Riau Archipelago confirm this. Additionally, cotton was [transshipped](/wiki/Transshipment) from Java or India through Singapore. In 1984, an archaeological excavation began at Fort Canning Hill, led by the archaeologist Dr [John Miksic](/wiki/John_N._Miksic). Eventually, a wide range of artefacts, including earthenware, ceramic, and porcelain pieces, were discovered, serving as evidence of Singapore's role as an active international trading port in the 14th century. By the 15th century, Singapore had declined as an international trading port due to the ascendance of the [Malacca Sultanate](/wiki/Malacca_Sultanate). Local trade continued on the island. A map of Singapore by Portuguese mathematician [Manuel Godinho de Eredia](/wiki/Manuel_Godinho_de_Eredia) showed the location of *Xabandaria* or the office of a *[shahbandar](/wiki/Shahbandar)*, the [Malay](/wiki/Malays_(ethnic_group)) official responsible for international trade. Shards of 15th-century [Siam](/wiki/Siam) ceramics and late 16th – or early 17th-century Chinese blue and white porcelain have been found at the Singapore and [Kallang Rivers](/wiki/Kallang_River). Singapore also supplied other regional ports with local products demanded by international markets. For instance, blackwood (a generic term used by [Europeans](/wiki/European_ethnic_groups) to refer to [rosewood](/wiki/Rosewood_(timber))) was exported from Singapore to [Malacca](/wiki/Malacca), and was in turn purchased by Chinese traders and shipped to China for furniture-making:) In the early 17th century, Singapore's main settlement and its port were destroyed by a punitive force from [Aceh](/wiki/Aceh). After this incident, there was no significant settlement or port at Singapore until 1819. ### 1819–1960 In 1819, [Stamford Raffles](/wiki/Stamford_Raffles), a British colonial official, excited by the deep and sheltered waters in [Keppel Harbour](/wiki/Keppel_Harbour), established for the British Empire a new settlement and international trading port on the island. Keen to attract Asian and European traders to the new port, Raffles directed that land along the banks of the Singapore River, particularly the south bank, be reclaimed where necessary and allocated to Chinese and English country traders to encourage them to establish a stake in the port settlement. As a consequence of their frequent commercial interactions with Southeast Asian traders throughout the year, Chinese traders established their trading houses along the lower reaches of the river, while English country traders, who depended on the annual arrival of trade from India, set up warehouses along the upper reaches. The port relied on three main networks of trade that existed in Southeast Asia at that time: the Chinese network, which linked Southeast Asia with the southern Chinese ports of [Fujian](/wiki/Fujian) and [Guangdong](/wiki/Guangdong); the Southeast Asian network, which linked the islands of the [Indonesian archipelago](/wiki/Malay_Archipelago); and the European and Indian Ocean network, which linked Singapore to the markets of Europe and the Indian Ocean [littoral](/wiki/Littoral). These networks were complementary, and positioned Singapore as the transshipment point of regional and international trade. By the 1830s, Singapore had overtaken Batavia (now [Jakarta](/wiki/Jakarta)) as the centre of the Chinese [junk](/wiki/Junk_(ship)) trade, while it also became the centre of English country trade in Southeast Asia. This was because Southeast Asian traders preferred the [free port](/wiki/Free_port) of Singapore to other major regional ports, which had cumbersome restrictions. Singapore had also supplanted [Tanjung Pinang](/wiki/Tanjung_Pinang) as the export gateway for the [gambier](/wiki/Uncaria) and pepper industry of the [Riau](/wiki/Riau_Islands)–[Lingga](/wiki/Lingga_Islands) Archipelago by the 1830s, and South Johor by the 1840s. Additionally, it had also become the centre of the [Teochew](/wiki/Chaozhou) trade in marine produce and rice. As the volume of its maritime trade increased in the 19th century, Singapore became a key port of call for [sailing](/wiki/Sailing_ship) and [steam vessels](/wiki/Steamboat) in their passage along Asian sea routes. From the 1840s, Singapore became an important [coaling station](/wiki/Coaling_station) for steam shipping networks that were beginning to form. Towards the late 19th century, Singapore developed into a [staple port](/wiki/Staple_port) servicing the geographical [hinterland](/wiki/Hinterland) of the [Malay Peninsula](/wiki/Malay_Peninsula). Following the institution of the British Forward Movement, Singapore became the administrative capital of [British Malaya](/wiki/British_Malaya). Roads and railways were developed to transport primary materials such as crude oil, rubber and tin from the Malay Peninsula to Singapore to be processed into staple products, and then shipped to Britain and other international markets. During the colonial period, this was considered the most significant role of the port of Singapore. ### 1963–2021 Singapore ceased to be part of the [British Empire](/wiki/British_Empire) when it merged with [Malaysia](/wiki/Malaysia) in 1963. Singapore lost its hinterland and was no longer the administrative or economic capital of the Malay Peninsula. The processing of raw materials extracted from the Peninsula in Singapore was significantly reduced due to the lack of a [common market](/wiki/Single_market) between Singapore and the Peninsular states. Since [Singapore's full independence](/wiki/History_of_the_Republic_of_Singapore) in 1965, it has sought an edge to compete with other regional ports to attract shipping and trade to its port. It has succeeded in doing so by developing an export-oriented economy based on value-added manufacturing. It obtains raw or partially manufactured products from regional and global markets and exports value-added products back to these markets through market access agreements such as [World Trade Organization](/wiki/World_Trade_Organization) directives and [free trade agreements](/wiki/Free_trade_agreement). By the 1980s, maritime trading activity had ceased in the vicinity of the Singapore River except in the form of passenger transport, as other terminals and harbours took over this role. Keppel Harbour is now home to three [container terminals](/wiki/Container_terminal). Other terminals were constructed in [Jurong](/wiki/Jurong) and [Pasir Panjang](/wiki/Pasir_Panjang), as well as in [Sembawang](/wiki/Sembawang) in the north. Today, the port operations in Singapore are handled by two service contractors: [PSA International](/wiki/PSA_International) (formerly the Port of Singapore Authority) and [Jurong Port](/wiki/Jurong_Port), which collectively operate six container terminals and three general-purpose terminals around Singapore. In the 1990s, the port became more well-known and overtook Yokohama, and eventually became the busiest port in terms of shipping tonnage.[*citation needed*] Singapore is part of the Maritime [Silk Road](/wiki/Silk_Road) that runs from the Chinese coast to the southern tip of India, to [Mombasa](/wiki/Mombasa), from there through the Red Sea via the [Suez Canal](/wiki/Suez_Canal) to the Mediterranean, to the Upper Adriatic region of the northern Italian hub [Trieste](/wiki/Trieste) with its rail connections to [Central Europe](/wiki/Central_Europe) and the [North Sea](/wiki/North_Sea). ### Since 2022 The Tuas mega port is projected to be the only port in Singapore after the PSA city terminals and Pasir Panjang Terminal are closed in 2027 and 2040, respectively, ending an era of port operations in the city area which began in 1819. The Sea Transport Industry Transformation Map (ITM) launched by the [Maritime and Port Authority of Singapore](/wiki/Maritime_and_Port_Authority_of_Singapore) (MPA) aims to increase the value-added industries by $4.5 billion and create more than 5,000 new jobs by 2025. [Automation](/wiki/Automation) will be a key part of the new port, with over 1,000 battery-powered driverless vehicles and a fleet of almost 1,000 automated yard cranes to be developed for the port. Nelson Quek, PSA Singapore's head of Tuas planning, stated that \"Tuas, when it's fully developed, is going to be the single largest fully-automated terminal in the world.\" It will also be able to cater to the demands of the world's largest container ships, with 26 km of deep-water berths. Besides just handling containers, the port will have space set aside for companies to be located, a move that aims to improve the links between the port and businesses. It is projected to be twice the size of Ang Mo Kio's new town. Operations at the Tuas mega port began in September 2021, and the port officially opened on 1 September 2022, with three berths fully operational. Eight more berths commenced service by February 2025, bringing the total number of operational berths to eleven. When completed in 2027, phase 1 of the mega port will have twenty-one berths. ## Operations This section needs to be **updated**. Please help update this article to reflect recent events or newly available information. *(September 2019)* The port is the [world's busiest port](/wiki/List_of_busiest_ports_by_cargo_tonnage) in terms of shipping tonnage handled, with 1.15 [billion](/wiki/1000000000_(number)) [gross tons](/wiki/Gross_ton) (GT) handled in 2005. In terms of cargo tonnage, Singapore is behind Shanghai with 423 million freight tons handled. In 2005, the port retained its position as the world's busiest hub for [transshipment](/wiki/Transshipment) traffic, and is also the world's biggest bunkering hub, with 25 million tonnes sold in the same year. In 2005, Singapore was ranked first globally in terms of [containerised](/wiki/Container_(cargo)) traffic, with 23.2 million [Twenty-foot equivalent units](/wiki/Twenty-foot_equivalent_unit) (TEUs) handled. High growth in containerised traffic has seen the port overtaking Hong Kong since the first quarter of 2005, and has led the race ever since, with an estimated 19,335 kTEUs handled in the year up to October, compared to 18,640 kTEUs handled in Hong Kong in the same period. A rise in regional traffic consolidating the port's position in Southeast Asia, and increases in transshipment traffic using the strategic East Asia-Europe route via Singapore, assisted the port to emerge at the top at the end of the year, a title it had not held since overtaking Hong Kong once in 1998. Port of Singapore statistics YearVessel Arrival Tonnage (billion GT)Container Throughput (million TEUs)Cargo Throughput (million tonnes)Bunker Sale Volume (million tonnes)Tonnage under Singapore Registry of Ships (million GT)20101.9228.4503.340.948.820112.1229.9531.243.257.420122.2531.6538.042.765.020132.3332.6560.942.773.620142.3733.9581.342.482.220152.5030.9575.845.286.320162.6630.9593.348.688.020172.8033.7627.750.688.820182.7936.6630.049.890.920192.8537.2626.247.597.320202.9036.9590.749.895.020212.8137.6599.650.092.320222.8337.3578.247.995.520233.0939.0592.051.899.620243.1141.1622.954.9108.0 ## Operators PSA Singapore's container facilities are as follows: - Container berths: 52 - Quay length: 15,500 m - Area: 600 hectares - Max draft: 16 m - Quay cranes: 190 - Designed capacity: 35,000 kTEU PSA Singapore has 13 berths which are part of the Pasir Panjang Container Terminal's Phase Two which are due for completion by 2009. Phase Three and Four will add another 16 berths and are expected to be completed by 2013. Jurong Port's facilities are as follows: - Berths: 32 - Berth length: 5.6 km - Maximum vessel draft: 15.7 m - Maximum vessel size: 150,000 tonnes [deadweight](/wiki/Deadweight_tonnage) (DWT) - Area: 127 Hectares Free Trade Zone, 28 Hectares non-Free Trade Zone - Warehouse facilities: 178,000 m2 PSA Singapore also has a 40-year contract to operate the tax-free [Gwadar Port](/wiki/Gwadar_Port) on the southwestern coast of Pakistan. Gwadar started operation in March 2008, with 3 multi-purpose berths, a 602-meter quay, and 12.5-meter depth. Another 9 berths are under construction, with a 20-meter depth. In 2015, it was announced that the port would be leased to the Chinese till 2059 and further developed under the [China-Pakistan Economic Corridor](/wiki/China-Pakistan_Economic_Corridor). ## Terminals PortOperatorTypeBerthsQuay length (m)Quay cranesArea (Ha)Capacity (kTEU)Brani (BT)PSAContainer82,3252684Cosco-PSA (CPT)[Cosco](/wiki/Cosco)/PSA272022.8>1,000[Jurong](/wiki/Jurong_Port)JTCMulti-Purpose325,600155Jurong Island Terminal (JIT)PSAContainer22Keppel (KT)143,16427105[Pasir Panjang](/wiki/Pasir_Panjang_Container_Terminal) (PPT 1)62,1451985Pasir Panjang (PPT 2)92,97236139Pasir Panjang (PPT 3)82,6553194Pasir Panjang (PPT 4)31,2641370Pasir Panjang (PPT 5)62,1602483Pasir Panjang (PPT 6)62,2512480Pasir Panjang Automobile TerminalRo-Ro31,01025Sembawang WharvesGeneral466028Tanjong Pagar (TPT) (decommissioned)Container72,097079.5Tuas Megaport Finger 2 (Tuas F2)1143 - [Jurong Island](/wiki/Jurong_Island) - [List of ports and harbors of the Pacific Ocean](/wiki/List_of_ports_and_harbors_of_the_Pacific_Ocean) - [List of busiest container ports](/wiki/List_of_busiest_container_ports) - [Pulau Bukom](/wiki/Pulau_Bukom) ### History - Sinnappah Arasaratnam (1972). *Pre-modern Commerce and Society in Southern Asia : An Inaugural Lecture Delivered at the University of Malaya on December 21, 1971*. Kuala Lumpur: [University of Malaya](/wiki/University_of_Malaya). - Borschberg, Peter (2018). \"Three questions about maritime Singapore, 16th and 17th Centuries\", Ler História, 72: 31-54. https://journals.openedition.org/lerhistoria/3234 - Braddell, Roland (1980). *A Study of Ancient Times in the Malay Peninsula and the Straits of Malacca and Notes on Ancient Times in Malaya / by Dato Sir Roland Braddell. Notes on the Historical Geography of Malaya / by Dato F.W. Douglas (MBRAS reprints; no. 7)*. Kuala Lumpur: Printed for the Malaysian Branch of the Royal Asiatic Society by Art Print. Works. - Chiang, Hai Ding (1978). *A History of Straits Settlements Foreign Trade, 1870–1915 (Memoirs of the National Museum; no. 6)*. Singapore: [National Museum](/wiki/National_Museum_of_Singapore). - Hall, Kenneth R. (1985). *Maritime Trade and State Development in Early Southeast Asia*. Honolulu, Hi.: [University of Hawai'i Press](/wiki/University_of_Hawaii_Press). [ISBN](/wiki/ISBN_(identifier)) 0-8248-0959-9. - Ishii, Yoneo, ed. (1998). *The Junk Trade from Southeast Asia : Translations from the Tosen Fusetsu-gaki, 1674–1723*. Singapore: Institute of Southeast Asian Studies (ISEAS); Research School of Pacific and Asian Studies, Australian National History, [Australian National University](/wiki/Australian_National_University). [ISBN](/wiki/ISBN_(identifier)) 981-230-022-8. - [Miksic, John N.](/wiki/John_N._Miksic) (1985). *Archaeological Research on the \"Forbidden Hill\" of Singapore : Excavations at Fort Canning, 1984*. Singapore: [National Museum](/wiki/National_Museum_of_Singapore). [ISBN](/wiki/ISBN_(identifier)) 9971-917-16-5. - Miksic, John N.; Cheryl-Ann Low Mei Gek (gen. eds.) (2004). *Early Singapore 1300s–1819 : Evidence in Maps, Text and Artefacts*. Singapore: [Singapore History Museum](/wiki/National_Museum_of_Singapore). [ISBN](/wiki/ISBN_(identifier)) 981-05-0283-4. - Ooi, Giok Ling; Brian J. Shaw (2004). *Beyond the Port City : Development and Identity in 21st Century Singapore*. Singapore: [Prentice Hall](/wiki/Prentice_Hall). [ISBN](/wiki/ISBN_(identifier)) 0-13-008381-X. - Trocki, Carl A. (1979). *Prince of Pirates : The Temenggongs and the Development of Johor and Singapore, 1784–1885*. Singapore: Singapore University Press. [ISBN](/wiki/ISBN_(identifier)) 9971-69-376-3. ### Present day - Yap, Chris (1990). *A Port's Story, A Nation's Success*. Singapore: Times Editions for [Port of Singapore Authority](/wiki/PSA_International). - Ho, David K[im] H[in] (1996). *The Seaport Economy: A Study of the Singapore Experience*. Singapore: Singapore University Press. [ISBN](/wiki/ISBN_(identifier)) 9971-69-199-X. - *Singapore Shipping: Past, Present & Future*. Singapore: Singapore Shipping Association. 2000. - Danam, Jacqueline, ed. (2003). *PSA: Full Ahead*. Singapore: [PSA Corporation](/wiki/PSA_International). [ISBN](/wiki/ISBN_(identifier)) 981-4068-47-0. - Live Camera to Port of Singapore - Official website of the Maritime and Port Authority of Singapore - Port operational statistics - Landow, George P. \"Singapore Harbor from its Founding to the Present : A Brief Chronology\". Postcolonial Web. Archived from the original on 24 August 2007. Retrieved 1 September 2007. - SG Bicentennial: A Port's Story - a video series about the history of the port of Singapore, produced by [PSA Singapore](/wiki/PSA_International) in 2019 to commemorate Singapore's Bicentennial.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:44:15.771588",
  "title": "Port of Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Port_of_Singapore"
}