{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:41:00.998037"
  },
  "content": "Singaporean bank **POSB Bank**, often known as **POSB**, is a [Singaporean](/wiki/Singapore) [bank](/wiki/Bank) offering [consumer banking](/wiki/Retail_banking) services. It is the largest and [oldest local bank in continuous operation](/wiki/List_of_oldest_banks_in_continuous_operation#Banks_established_in_the_19th_century) in Singapore with over four million customers. Established on 1 January 1877 as the **Post Office Savings Bank** ([Chinese](/wiki/Chinese_language): 郵政儲蓄銀行; [pinyin](/wiki/Pinyin): *Yóuzhèngchǔxù Yínháng*), POSB currently operates as part of [DBS Bank](/wiki/DBS_Bank) after being acquired on 16 November 1998. Having served generations of [Singaporeans](/wiki/Singaporeans) for more than 145 years, it is known as the \"People’s Bank\", and prides itself on being \"neighbours first, bankers second\". ## History Founded on 1 January 1877 as the Post Office Savings Bank (POSB), the bank was part of the Postal Services Department in the [Straits Settlements](/wiki/Straits_Settlements). It was set up by the colonial government to provide banking services for lower-income citizens within the Straits Settlement. Headquartered in the [General Post Office Building](/wiki/The_Fullerton_Hotel_Singapore), in [Raffles Place](/wiki/Raffles_Place), the bank was under the administration of the Postmaster General and bank policies were decided by a board of trustees, which was designated by the [Governor of the Straits Settlements](/wiki/List_of_governors_of_the_Straits_Settlements). From 1877 to 1940, the number of accounts opened increased from 211 to 57,000 and the total deposits increased from 19,862 to 14.3 million [Straits dollars](/wiki/Straits_dollars) during the same period of time. Following the end of the [Second World War](/wiki/Second_World_War) and the dissolution of the Straits Settlements, the 1948 Savings Bank Ordinance came into effect and in 1949, POSB was separated from the other post office savings banks in [Malaya](/wiki/Federation_of_Malaya), with the bank's assets and liabilities split between [Singapore](/wiki/Colony_of_Singapore) and Malaya. The Malayan branch eventually became [Bank Simpanan Nasional](/wiki/Bank_Simpanan_Nasional) in 1974. After the separation from 1949 to 1955, the total deposits of the bank increased from M$27.4 million to M$57.6 million and in 1951, the bank had its 100,000th depositor. ### Decline and revival Reaching its peak in 1955, the bank had a slow decline from 1957 to 1966, where the total deposits decreased to M$37.4 million. After [Singapore's independence](/wiki/History_of_the_Republic_of_Singapore) in 1965, the country went through a rapid [industrialisation](/wiki/Industrialisation) programme. To develop the infrastructure of the infant city-state, [Minister for Finance](/wiki/Ministry_of_Finance_(Singapore)#Ministers) [Goh Keng Swee](/wiki/Goh_Keng_Swee) set up a savings bank committee, which was later reconstituted into a permanent advisory committee within the bank to promote domestic savings through POSB to provide the Singapore government with a non-inflationary source of funds for the development of the country. Following the recommendations of the savings bank committee, withdrawal limits of accounts were raised from S$200 once every seven days to S$500 once every three days, longer operating hours, exempting interest earned on savings accounts from taxable income, and accepting non-romanised signatures for opening accounts. Savings competitions were also organised among all public and government-aided schools to encourage students to open an account with the bank. From 1966 to 1969, the number of accounts opened increased from 10,596 to 174,506 with deposits totaling S$57.7 million in 1969. ### Statutory board, new services and facilities In 1971, it was announced that the bank would become a [statutory board](/wiki/Statutory_boards_of_the_Singapore_Government) under the [Ministry of Communications](/wiki/Ministry_of_Information,_Communications_and_the_Arts_(Singapore)). The Post Office Savings Bank Bill was passed in Parliament on 30 July 1971 and the bank ceased to be a branch of the Postal Services Department on 1 January 1972 after the 1971 Post Office Savings Bank of Singapore Act came into effect in that year. The first chairman was [Tan Chok Kian](/wiki/Tan_Chok_Kian). In 1974, the bank was transferred to become part of the [Ministry of Finance](/wiki/Ministry_of_Finance_(Singapore)) and Credit POSB Pte Ltd was established in the same year to provide custom-tailored loans relating to HDB housing ownership. By 1976, POSB had one million depositors, while deposits crossed the S$1 billion mark. In 1980, it introduced the Passcard, and set-up the Principal Branch. In 1981, its first Cash-On-Line [ATM](/wiki/Automated_teller_machines) opened at the Newton Branch. In 1982, it was announced that the bank will introduce branches served by only ATMs, reducing manpower needs. In 1983, its headquarters were shifted to the new 8-storey complex, the POSB Bank Centre at [Bras Basah Road](/wiki/Bras_Basah_Road). In 1984, the current account facility was introduced, and by 1986, deposits crossed the S$10 billion mark. In March 1990, the Post Office Savings Bank was renamed as POSBank. ### Acquisition by DBS Bank On 24 July 1998, the [Ministry of Finance](/wiki/Ministry_of_Finance_(Singapore)) announced the acquisition of POSBank by [DBS Bank](/wiki/DBS_Bank), which was fully acquired on 16 November 1998 for [S$](/wiki/Singapore_dollar)1.6 billion, at the same time, ceased to exist as a statutory board under the Ministry of Finance. The merger was seen to enable POSBank to compete better with full-fledged commercial banks, to better serve more sophisticated customers, and in line with the government's call for local banks to merge and create larger and stronger banks to compete internationally. Prior to its acquisition, POSBank was already the largest local bank offering low-cost banking services to Singaporeans. It attempts to continue this tradition by promising to keep costs low for basic savings accounts, and to exempt children, full-time students below the age of 21 years. POSB still operates one of the highest number of bank branches in Singapore, especially in the suburban heartland [neighbourhoods](/wiki/Neighbourhood), and operates the highest number of ATM outlets throughout Singapore. The integration of both banks allowed customers of either bank to share the facilities; DBS Bank depositors may use the Cash Deposit Machine installed island-wide in POSB branches and vice-versa for POSB Bank depositors. ## Senior leadership - *Chairman:* Peter Seah (since May 2010) - *Chief Executive:* Tan Su Shan (since March 2025) ### List of former chairmen 1. [Hon Sui Sen](/wiki/Hon_Sui_Sen) (1968–1970) 2. [Howe Yoon Chong](/wiki/Howe_Yoon_Chong) (1970–1979) 3. [J. Y. Pillay](/wiki/J._Y._Pillay) (1979–1985) 4. [Howe Yoon Chong](/wiki/Howe_Yoon_Chong) (1985–1990) 5. Ngiam Tong Dow (1990–1998) 6. [S. Dhanabalan](/wiki/S._Dhanabalan) (1999–2005) 7. [Koh Boon Hwee](/wiki/Koh_Boon_Hwee) (2006–2010) ### List of former CEOs 1. Patrick Yeoh Khwai Hoh (1993–1995) 2. John Olds (1998–2001) 3. Philippe Paillart (2001–2002) 4. Jackson Tai (2002–2007) 5. Richard Stanley (2008–2009) 6. [Piyush Gupta](/wiki/Piyush_Gupta) (2009–2025) - [DBS Bank](/wiki/DBS_Bank) - [Bank Simpanan Nasional](/wiki/Bank_Simpanan_Nasional) – formerly the Malayan branch of the Post Office Savings Bank - [National Heritage Board (Singapore)](/wiki/National_Heritage_Board_(Singapore)) (2006). \"POSBank\". In [Tommy T.B. Koh](/wiki/Tommy_Koh) et ali. (ed.). *Singapore: The Encyclopedia*. Singapore: Editions Didier Millet. p. 419. [ISBN](/wiki/ISBN_(identifier)) 981-4155-63-2. - POSBank - DBS Bank\n",
  "language": "en",
  "processed_at": "2026-01-12T11:41:00.997797",
  "title": "POSB Bank",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/POSB_Bank"
}