{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:44:17.939508"
  },
  "content": "This article includes a list of references, related reading, or external links, **but its sources remain unclear because it lacks inline citations**. Please help improve this article by introducing more precise citations. *(July 2013)* *(Learn how and when to remove this message)*You can help **expand this article with text translated from the corresponding article in Russian**. *(February 2015)* Click [show] for important translation instructions. - View a machine-translated version of the Russian article. - Machine translation, like DeepL or Google Translate, is a useful starting point for translations, but translators must revise errors as necessary and confirm that the translation is accurate, rather than simply copy-pasting machine-translated text into the English Wikipedia. - Consider **adding a topic** to this template: there are already 1,053 articles in the main category, and specifying`|topic=` will aid in categorization. - Do not translate text that appears unreliable or low-quality. If possible, verify the text with references provided in the foreign-language article. - You **must** provide copyright attribution in the edit summary accompanying your translation by providing an interlanguage link to the source of your translation. A model attribution edit summary is `Content in this edit is translated from the existing Russian Wikipedia article at [[:ru:История почты и почтовых марок Стрейтс-Сетлментса]]; see its history for attribution.` - You may also add the template `{{Translated|ru|История почты и почтовых марок Стрейтс-Сетлментса}}` to the talk page. - For more guidance, see Wikipedia:Translation. The [Straits Settlements](/wiki/Straits_Settlements) of the [Malayan Peninsula](/wiki/Malayan_Peninsula) have a [postal history](/wiki/Postal_history) distinct from the other Malayan areas. ## Early postal arrangements Mail was originally handled privately by passing ships; the earliest known [postal markings](/wiki/Postal_marking) date from around 1806, used by a [post office](/wiki/Post_office) on Prince of Wales Island (now [Penang](/wiki/Penang)). ## Stamps of British India and Burma Service was regularised by the Indian Post Office Act of 1837, by which the East India Company was granted a monopoly of the mail services. All private vessels were required to carry letters at prescribed rates for postage. Handstamps were applied to preadhesive ship letters. [Postage stamps](/wiki/Postage_stamp) of [India](/wiki/Postage_stamps_and_postal_history_of_India) were used from 1854, the Settlements being considered part of the \"Bengal circle\", then from 1861 they became part of the \"Burma circle\". The [cancellations](/wiki/Cancellation_(mail)) used were B/109 at [Malacca](/wiki/Malacca), B/147 at Penang, and B/172 at [Singapore](/wiki/Singapore). ## First stamps When the Settlements became a [crown colony](/wiki/Crown_colony) in 1867, they began issuing their own stamps, not least because they adopted a currency based on 96 cents to a silver dollar. Beginning on 1 September 1867, nine types in the existing stocks of Indian stamps were [overprinted](/wiki/Overprint) with a crown and a new value in cents. Then, stamps printed by [De La Rue](/wiki/De_La_Rue) for the Settlements started arriving in December; they are notable for a prominent white frame around the profile of Victoria, inscribed \"STRAITS SETTLEMENTS POSTAGE\". The set of nine values, 2c to 96c, appeared gradually, with the 30c value not being issued until 1872. Shortages from 1879 through 1882 necessitated the production of various [surcharges](/wiki/Overprint), until new 5c and 10c stamps arrived in January 1882. Additional surcharges appeared regularly until the end of the century. ## Key plates In 1892, [key plate stamps](/wiki/Key_plate_stamp) went on sale, a number of them printed in two colours. A notable feature of this issue is the $5 stamp issued in 1898. The accession of King [Edward VII](/wiki/Edward_VII_of_the_United_Kingdom) necessitated new stamps in 1902, still in a key plate design, supplemented in 1903 with a design using oval vignette. ## Twentieth century The island of [Labuan](/wiki/Labuan) was incorporated into the colony in 1907, the remainder of [Labuan Colony](/wiki/Crown_Colony_of_Labuan)'s stamps were overprinted \"STRAITS SETTLEMENTS.\", some with new denominations. In 1910 new stamps appeared with values of $25 and $500 (although available for postage, their more usual use was fiscal). George V replaced Edward VII on stamps beginning in 1912, reusing the frames and replacing only the [vignettes](/wiki/Vignette_(philately)). These stamps were overprinted in 1922 to mark the [Malaya-Borneo Exhibition](/wiki/Malaya-Borneo_Exhibition). The Straits Settlements also joined in the [Silver Jubilee](/wiki/Silver_Jubilee) issue for George V in 1935. The last issue of the Straits Settlements was the 1937 George VI series. ## World War II In March 1942, [Japan](/wiki/Japan) issued stamps for their occupation, by overprinting existing stamps with Japanese inscriptions. After the Japanese surrendered in 1945, the [British military administration](/wiki/British_Military_Administration_(Malaya)) issued provisionals by overprinting Straits Settlements stamps with \"BMA / MALAYA\". These stamps were used until 1948, when stamps were produced for [Singapore](/wiki/Singapore), [Penang](/wiki/Penang) and [Malacca](/wiki/Malacca). The Straits Settlements was dissolved in 1946, with Singapore becoming a separate Crown colony, while Penang and Malacca joined the new [Malayan Union](/wiki/Malayan_Union). - [Postage stamps and postal history of Malaysia](/wiki/Postage_stamps_and_postal_history_of_Malaysia) - [Postage stamps and postal history of Singapore](/wiki/Postage_stamps_and_postal_history_of_Singapore) ## References and sources ReferencesSources - AskPhil – Glossary of Stamp Collecting Terms - Encyclopaedia of Postal History - [Lowe, Robson](/wiki/Robson_Lowe). (1951) *The Encyclopedia of British Empire Postage Stamps Volume III*. London: Robson Lowe, pp. 296–321. - [Rossiter, Stuart](/wiki/Stuart_Rossiter) & John Flower. (1986) *The Stamp Atlas*. London: Macdonald. [ISBN](/wiki/ISBN_(identifier)) 0-356-10862-7 - British Malaya Security Markings: Firm Chops, PERFINS, Forwarding Agents Chops etc. - [Francis E. Wood](/wiki/F._E._Wood), \"Straits Settlements and native protected states with special reference to stamps of doubtful catalogue status\" in [The London Philatelist](/wiki/The_London_Philatelist), Feb/Mar 1939. - [Francis E. Wood](/wiki/F._E._Wood), *Straits Settlements postage stamps*. Betws-y-Coed: 1945 or 1948. (Reprinted: Kuala Lumpur, Malaya, Selangor Stamp Club, 1961.) - Lockhart, R.H.D. *The Postage Stamps of The Straits Settlements.* London: Sefi, Pemberton & Company, 1925 40p. Series Title: Series of studies in philately no. 3. - [Ted Proud](/wiki/Ted_Proud), *Postal History of British Malaya: Straits Settlements.* [ISBN](/wiki/ISBN_(identifier)) 1872465021 - Wood, F. E. *Straits Settlements Postage Stamps.* Kuala Lumpur: Selangor Stamp Club, (1948) reprinted 1961 136p. - Malaya Study Group\n",
  "language": "en",
  "processed_at": "2026-01-12T11:44:17.939177",
  "title": "Postage stamps and postal history of the Straits Settlements",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Postage_stamps_and_postal_history_of_the_Straits_Settlements"
}