{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:44:19.699786"
  },
  "content": "Region in SingaporeThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Potong Pasir\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(September 2023)* *(Learn how and when to remove this message)*Subzone of Toa Payoh Planning Area & Housing Estate in Singapore **Potong Pasir** ([IPA](/wiki/International_Phonetic_Alphabet): /ˈpoʊtɒŋ ˌpɑːseɪ/ *POH-tong PAH-say*[note 1]) is a housing estate located between [Toa Payoh](/wiki/Toa_Payoh) and Sennett Estate in the [Central Region of Singapore](/wiki/Central_Region,_Singapore). For urban planning purposes, it is classified under the Toa Payoh area. ## History From 1910 to 1937, it was dominated by sand-quarries, hence giving it its present name, which means 'cut sand' in [Malay](/wiki/Malay_language). These mining activities created four ponds linked to the [Kallang River](/wiki/Kallang_River), although they were reduced to two due to massive flooding in 1968. The ponds provided a good source of food for the local monkeys, until pollution set in later. In the mid 1950s, Potong Pasir was one of the most important vegetable growing areas in Singapore. The land here had been cultivated since the 1830s. The farmers there were almost all Cantonese and they used traditional methods with great success. Leafy vegetables were grown on farms located in lowland areas such as Potong Pasir, [Changi](/wiki/Changi), [Ponggol](/wiki/Ponggol), and [Sembawang](/wiki/Sembawang). Watercress was the most important type of vegetable grown in Potong Pasir. A small portion of farmland was used for planting coconut palms. Vegetable farming in Singapore was a family business. Farmers of Potong Pasir lived in attap houses, in zinc roof and semi-concrete houses. The general condition of the rural roads was poor. Most farmers in the area leased their land from the Government. During the early years, Potong Pasir was also a site of regular flooding. Villagers would take refuge in nearby St Andrew's School, which was on Woodsville Hill. Rapid change took place for the past five decades, with the building of a bridge across the ponds in the 1950s, a venue for education introduced in the form of a village community centre in 1952, piped water and electricity in the 1960s, and by the 1970s, most of the villagers had already started to move out as the land was acquired by the government for massive redevelopment. Hence, a public housing estate, Potong Pasir Estate, began to take shape in the 1980s, with construction commencing in 1982, and the first blocks completed two years later. The sloping roof of some blocks became the most recognisable icon of Potong Pasir. From then till now, the ward has managed to retain its idyllic feel even as the pace of urbanisation has caught up with other areas. Historically, a road called \"**Jalan Potong Pasir**\" used to cut through the area. This historic road has since ceased to exist, but it defined the lines of the [Potong Pasir Single Member Constituency](/wiki/Potong_Pasir_Single_Member_Constituency) as it started the current Lorong 8 Toa Payoh at Braddell Road and ending at Potong Pasir Avenue 1 at [Upper Serangoon Road](/wiki/Upper_Serangoon_Road). ## Political history Potong Pasir was formed in the [1968 election](/wiki/1968_Singaporean_general_election) on its redistricting from its former [Aljunied Constituency](/wiki/Aljunied_Constituency), and has remained as a SMC since its presence as of the recent [2025 General Elections](/wiki/2025_Singapore_general_election). Its current Member of Parliament is [People's Action Party](/wiki/People%27s_Action_Party)'s [Alex Yeo](/wiki/Alex_Yeo), a former branch secretary for Potong Pasir and former [Aljunied GRC](/wiki/Aljunied_GRC) candidate in the [2020 election](/wiki/2020_Singaporean_general_election). Its Town Council was standalone as a SMC until 2015 where it was now part of the Jalan Besar Town Council, with [Jalan Besar GRC](/wiki/Jalan_Besar_GRC). The boundaries was also intact until 2020 where portions of eastern [Toa Payoh](/wiki/Toa_Payoh) was ceded to [Bishan-Toa Payoh GRC](/wiki/Bishan-Toa_Payoh_Group_Representation_Constituency) in exchange of [Bidadari](/wiki/Bidadari,_Singapore) from [Marine Parade GRC](/wiki/Marine_Parade_GRC). The constituency was famous for being its former opposition [safe seat](/wiki/Safe_seat) where then-longest serving opposition Member of Parliament (MP) and Secretary-General of the [Singapore People's Party](/wiki/Singapore_People%27s_Party) (SPP) (previously [Singapore Democratic Party](/wiki/Singapore_Democratic_Party) (SDP) until 1994, and part of [Singapore Democratic Alliance](/wiki/Singapore_Democratic_Alliance) (SDA) between 2001 and 2010), [Chiam See Tong](/wiki/Chiam_See_Tong), was an MP in his constituency for 26 years from 1984 to (/wiki/2011_Singaporean_general_election), a then-record for its longest tenure of any opposition party (the record has since superseded by [Workers' Party](/wiki/Workers%27_Party_(Singapore))'s currently-held stronghold of [Hougang](/wiki/Hougang_Single_Member_Constituency), which was claimed in 1991 and had broken the record in 2017). After Chiam vacated his seat to contest in the neighboring Bishan-Toa Payoh GRC in 2011, his wife [Lina Loh](/wiki/Lina_Loh) was named the successor; however, neither Chiam's team nor his wife Loh were successful, with the latter being unsuccessful in defending the constituency despite a razor-thin margin of 114 votes against her three-time rival, [Sitoh Yih Pin](/wiki/Sitoh_Yih_Pin), who first contested there in (/wiki/2001_Singaporean_general_election); Sitoh served as the MP for three terms before retiring in 2025 and Potong Pasir remained in PAP-fold since. ## Transportation Potong Pasir is currently served by one MRT station along the [North East Line](/wiki/North_East_Line): - **NE10** [Potong Pasir](/wiki/Potong_Pasir_MRT_Station) ## Schools Potong Pasir estate is home to [St Andrew's Village](/wiki/Saint_Andrew%27s_Village), a cluster of schools part of The Saints Family. It comprises [St Andrew's Junior School](/wiki/Saint_Andrew%27s_Junior_School), [Saint Andrew's Secondary School](/wiki/Saint_Andrew%27s_Secondary_School), [Saint Andrew's Junior College](/wiki/Saint_Andrew%27s_Junior_College); together forming [St. Andrew's School](/wiki/Saint_Andrew%27s_School,_Singapore). The name of the school is usually abbreviated as SA or SAS. Its students and alumni ('Old Boys' and 'Old Girls') are referred to as Saints. In the 2000s, as part of the [St Andrew's Village](/wiki/Saint_Andrew%27s_Village) project, all three schools were planned to reunite in Potong Pasir. Renovation and expansion of the Junior School started in 2003, and the new buildings opened in December 2004. Construction of a new Secondary School started in 2003, opposite the Junior School along Francis Thomas Drive, and opened in December 2004. Construction of the Junior College started in June 2003 after the secondary school vacated the site and shifted to its holding location. The Junior College opened in December 2005 and a ceremony was held to mark its return to Potong Pasir. The Village was officially opened on 26 August 2006, with the ceremony being held at the 1000-seater Cultural Centre in the Junior College. ## Notes\n",
  "language": "en",
  "processed_at": "2026-01-12T11:44:19.699393",
  "title": "Potong Pasir",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Potong_Pasir"
}