{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:44:24.202796"
  },
  "content": "The **powers of the president of Singapore** are divided into those which the [president](/wiki/President_of_Singapore) may exercise at their own discretion, and those they must exercise in accordance with the [advice](/wiki/Advice_and_Consent) of the [Cabinet of Singapore](/wiki/Cabinet_of_Singapore) or of a minister acting under the general authority of the Cabinet. In addition, the president is required to consult the Council of Presidential Advisers (CPA) when performing some of their functions. In other cases, the president may consult the CPA if they wish to but is not bound to do so. In 1991, the [Constitution of Singapore](/wiki/Constitution_of_Singapore) was amended to transform the office of president, which was previously [indirectly elected](/wiki/Indirect_election) by [Parliament](/wiki/Parliament_of_Singapore), into an office [directly elected](/wiki/Direct_election) by its citizens. The amendment conferred on the president certain executive functions to block attempts by the [government](/wiki/Government_of_Singapore) of the day to draw down past reserves that it did not accumulate. Thus, a guarantee may only be given or a loan raised by the government if the president concurs, and their approval is also needed for budgets of specified [statutory boards](/wiki/Government_of_Singapore#Statutory_boards) and state-owned companies that draw on their past reserves. The president also possesses personal discretion to withhold assent to any bill in Parliament providing directly or indirectly for the direct or indirect variation, changing or increase in powers of the [Central Provident Fund Board](/wiki/Central_Provident_Fund_Board) to invest moneys belonging to it; and the borrowing of money, the giving of any guarantee or the raising of any loan by the Government if in the president's opinion the bill is likely to draw on reserves not accumulated by the government during its current term of office. In addition, the president may withhold assent to any Supply Bill, Supplementary Supply Bill or Final Supply Bill for any financial year if in his opinion the estimates of revenue and expenditure, supplementary estimates or statement of excess are likely to lead to a drawing on past reserves. The president is also empowered to approve changes to key political appointments, such as the [Chief Justice](/wiki/Chief_Justice_of_Singapore), the [attorney-general](/wiki/Attorney-General_of_Singapore), chairman and members of the [Public Service Commission](/wiki/Public_Service_Commission_(Singapore)), [chief of Defence Force](/wiki/Chief_of_Defence_Force_(Singapore)) and the [commissioner of Police](/wiki/Commissioner_of_Police_(Singapore)). The president also appoint the [prime minister](/wiki/Prime_Minister_of_Singapore), a [Member of Parliament](/wiki/Parliament_of_Singapore) (MP) who, in their personal judgment, is likely to command the confidence of a majority of MPs. The president has certain powers of oversight over the [Corrupt Practices Investigation Bureau](/wiki/Corrupt_Practices_Investigation_Bureau) and decisions of the Executive under the [Internal Security Act](/wiki/Internal_Security_Act_(Singapore)) and the [Maintenance of Religious Harmony Act](/wiki/Maintenance_of_Religious_Harmony_Act). Under the Singapore Armed Forces Act, the president has the authority to raise and maintain the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces) (SAF). The president also has the power to form, disband or amalgamate units within the SAF. The term of office of the first elected president, [Ong Teng Cheong](/wiki/Ong_Teng_Cheong), was marked by differences between him and the government concerning the extent of his discretionary fiscal powers. Discussions culminated in the Government issuing a non-binding [white paper](/wiki/White_paper#Government_white_papers) entitled *The Principles for Determining and Safeguarding the Accumulated Reserves of the Government and the Fifth Schedule Statutory Boards and Government Companies* (1999). The president grants attempts by the [government](/wiki/Government_of_Singapore) of the day to draw down past reserves that it did not accumulate, during economic downturns. In 2009, in response to the [2008 financial crisis](/wiki/2008_financial_crisis) and the [Great Recession](/wiki/Great_Recession), the government requested approval from President [S. R. Nathan](/wiki/S._R._Nathan) to draw [S$](/wiki/Singapore_dollar)4.9 billion from past financial reserves to meet current budget expenditure, the first time it had done so. The sum was used to fund the government's Resilience Package consisting of two schemes aimed at preserving jobs and businesses due to the [2008 financial crisis](/wiki/2008_financial_crisis) and the [Great Recession](/wiki/Great_Recession). Eventually, the government drew just $4 billion, all of which was returned to the national reserves in 2011. In response to the economic crisis that occurred as a result of the [COVID-19 pandemic in Singapore](/wiki/COVID-19_pandemic_in_Singapore), President [Halimah Yacob](/wiki/Halimah_Yacob) granted approval for the government of the day to draw S$21 billion in April 2020—for the Resilience and Solidarity Budgets, S$31 billion (in May 2020; for the Fortitude Budget), S$11 billion (in March 2021; for the Covid-19 Resilience Package contained within the 2021 Annual Budget), and S$6 billion in March 2022—for the financial support of the nation's Covid-19 public health expenditure contained within the 2022 Annual Budget. In 2020, President Halimah described the pandemic as a \"very exceptional circumstance\" that necessitated the emergency use of past reserves, in order to *\"take care of the people in terms of health and safety... and ensure that they continue to have income\"*, as the pandemic gave rise to *\"[...] a situation where our own survival and existence are at stake.\"* Nevertheless, the cumulative draw on past reserves over the two financial years of 2020 and 2021 was up to $42.9 billion, lower than the approved draw of $52 billion that was originally agreed on for financial year 2020. Whether the president may speak publicly on issues without the government's approval was discussed heavily during the [2011 presidential election](/wiki/2011_Singaporean_presidential_election). While some presidential candidates and members of the public suggested that the president has power to do so, [Minister for Law](/wiki/Ministry_of_Law_(Singapore)#Ministers) [K. Shanmugam](/wiki/K._Shanmugam) stated that the president's ability to speak freely is limited to those matters that, according to the Constitution, they exercises discretionary powers over. They should not act as a political centre distinct from the government. A difference of opinion also exists over whether the president exercises [soft power](/wiki/Soft_power). ## Grant of powers to the president Prior to 1991, the [Constitution of Singapore](/wiki/Constitution_of_Singapore) contained no provisions preventing the [government](/wiki/Government_of_Singapore) from funding spending from national reserves. There were also no safeguards against the government appointing unsuitable persons to key [Civil Service](/wiki/Singapore_Civil_Service) positions. The government concluded that a constitutional safeguard was necessary to preserve both the integrity of the public service, as well as Singapore's national reserves which should be prevented from falling into the hands of a future irresponsible government. The government took the view that the safeguards could be achieved by providing the [direct election](/wiki/Direct_election) of the president, thus making the president directly accountable to its citizens, and enabling them to serve as a [check](/wiki/Separation_of_powers#Checks_and_balances) against the government by increasing their discretionary powers. The Constitution of the Republic of Singapore (Amendment) Act 1991 granted the president certain executive functions to block attempts by the government of the day to draw down past reserves that it had not accumulated, and to approve changes to key Civil Service positions. The president also had certain powers of oversight over the [Corrupt Practices Investigation Bureau](/wiki/Corrupt_Practices_Investigation_Bureau) and decisions of the Executive under the [Internal Security Act](/wiki/Internal_Security_Act_(Singapore)) and the [Maintenance of Religious Harmony Act](/wiki/Maintenance_of_Religious_Harmony_Act). The office of the president is one of Singapore's most heavily altered institutions, and it is still being re-made today. As of 2007, almost one-third of all the constitutional amendments since Singapore became [independent](/wiki/History_of_the_Republic_of_Singapore#Independence_from_Malaysia) in 1965 consisted of changes to the president's office. Approximately half of the amendments implemented were to alter the president's fiscal powers. ## Powers The powers of the president are divided into those he may exercise in his own discretion, and those he must exercise in accordance with the advice of the [Cabinet](/wiki/Cabinet_of_Singapore) or of a [minister](/wiki/Cabinet_of_Singapore#Appointment_of_Cabinet) acting under the general authority of the Cabinet. In addition, the president is required to consult the Council of Presidential Advisers (CPA) when performing some of his functions. In other cases, he may consult the CPA if he wishes to but is not bound to do so. After amendments to the Constitution took effect in 2017, the CPA was enlarged. The CPA now consists of eight full members (three appointed at the personal discretion of the president, three on the advice of the prime minister, one on the advice of the chief justice, and one on the advice of the chairman of the [Public Service Commission](/wiki/Public_Service_Commission_(Singapore))) and two alternate members (one appointed at the personal discretion of the president, and one on the advice of the prime minister in consultation with the chief justice and chairman of the [Public Service Commission](/wiki/Public_Service_Commission_(Singapore))). The president also has discretion to appoint one of the members of the council as chairman. Full members serve six-year terms, and are staggered into three groups with one group's term expiring every two years in an arrangement similar to the US [Senate](/wiki/Classes_of_United_States_senators), while alternate members serve four-year terms. As of 17 February 2022, the Chairman of the CPA was [Eddie Teo](/wiki/Eddie_Teo), former Chairman of the [Public Service Commission](/wiki/Public_Service_Commission_(Singapore)), and the other full members were former Government minister and [Temasek Holdings](/wiki/Temasek_Holdings) chairman [S. Dhanabalan](/wiki/S._Dhanabalan); former Government minister and [Keppel Corporation](/wiki/Keppel_Corporation) chairman Lim Chee Onn; founder, chairman and CEO of Ho Bee Group Chua Thian Poh; Bank of Singapore CEO [Bahren Shaari](/wiki/Bahren_Shaari); former [Singtel](/wiki/Singtel) group chief executive [Chua Sock Koong](/wiki/Chua_Sock_Koong); chairman of DBS Group Peter Seah Lim Huat and former managing director at [Ernst & Young](/wiki/Ernst_%26_Young) Advisory Mildred Tan-Sim Beng Mei. The two alternate members were vice-chairman of the [Singapore Business Federation](/wiki/Singapore_Business_Federation) and ExxonMobil Asia-Pacific chairman and managing director Gan Seow Kee and PAVE executive director Sudha Nair. The CPA conducts proceedings in private, and its members are required to take an oath of secrecy. Powers exercisable by the president Presidential powerProvisions of ConstitutionWhether personal discretionWhether CPA must be consulted**Financial powers**Withholding of assent to bill varying, changing or increasing powers of [Central Provident Fund Board](/wiki/Central_Provident_Fund_Board) to invest moneys belonging to itArts. 21(2)(c), 22EYesYesWithholding of concurrence to guarantee or loan given or raised by Government; and withholding of assent to bill for borrowing of money, giving of guarantee or raising of loan by the Government if likely to draw on reserves not accumulated by Government during current term of officeArts. 21(2)(c) and (d), 144 (1) and (2)YesYesWithholding of assent to Supply Bill, Supplementary Supply Bill or Final Supply Bill for any [financial year](/wiki/Fiscal_year) if estimates of revenue and expenditure, supplementary estimates or statement of excess likely to lead to drawing on reserves not accumulated by Government during current term of officeArts. 21(2)(c), 148AYesYesWithholding of concurrence and approval to appointments and budgets of [statutory boards](/wiki/Government_of_Singapore#Statutory_boards) and Government companies specified in Fifth Schedule to ConstitutionArts. 21(2)(e), 22A, 22B, 22C, 22DYesYesDisapproval of proposed transactions of specified statutory boards and Government companies, or Government itself, likely to draw on reserves accumulated by board, company or Government before Government's current term of officeArts. 21(2)(f), 22B(7), 22D(6), 148GYesYesConcurring with advice of [Minister for Finance](/wiki/Ministry_of_Finance_(Singapore)) on long-term real [rates of return](/wiki/Rate_of_return) expected to be earned on assets so equivalent amount may be excluded from reserves not accumulated by Government during current term of officeArt. 142(1A)YesYesConcurring with Parliament to authorize expenditure by resolution approving estimates containing a vote on account before passing of a Supply law for a particular year, or by resolution approving a vote of credit because of magnitude or indefinite character of any service or in circumstances of unusual urgencyArt. 148BYesYes**Powers relating to key office holders**Appointing the [Prime Minister](/wiki/Prime_Minister_of_Singapore)Arts. 21(2)(a), 25YesNoRefusing to make or revoke an appointment to specified key offices (for instance, the [Chief Justice](/wiki/Chief_Justice_of_Singapore), the [Attorney-General](/wiki/Attorney-General_of_Singapore), the chairman and members of the [Public Service Commission](/wiki/Public_Service_Commission_(Singapore)), the [Chief of Defence Force](/wiki/Chief_of_Defence_Force_(Singapore)) and the [Commissioner of Police](/wiki/Commissioner_of_Police_(Singapore))) if the president does not concur with the advice or recommendation of a relevant authority that he is required to consultArts. 21(2)(i), 22YesYesAppointing chairman and members of advisory board constituted to determine if person should continue to be preventively detained without trial for security reasonsArt. 151(2)NoNo, but must consult Chief Justice before appointing members other than chairman**Other powers**Withholding of consent to a request for [dissolution of Parliament](/wiki/Dissolution_of_Parliament)Arts. 21(2)(b), 65(3)YesNoWithholding of assent to bill seeking to circumvent or curtail President's discretionary powers, whether this proposes to amend the Constitution or relates to ordinary legislationArts. 5A (*not yet in force*), 21(2)(c), 22HYesNoWithholding of concurrence in relation to the detention of person under law passed against [subversion](/wiki/Subversion)Arts. 21(2)(g), 151(4); Internal Security Act, s. 13AYesNo, but must consider recommendations of advisory board considering detainee's representations against detentionCancelling or confirming restriction order under [Maintenance of Religious Harmony Act](/wiki/Maintenance_of_Religious_Harmony_Act), if Cabinet's advice contrary to the recommendation of the Presidential Council for Religious HarmonyArts. 21(2)(h), 22I; Maintenance of Religious Harmony Act, s. 12.YesNo, but must consider recommendations of Presidential Council for Religious HarmonyDirecting that any bill seeking to amend specified clauses of the Constitution shall not be passed by Parliament unless supported at national referendum by not less than two-thirds of total number of votes cast by electorsArts. 5(2A) (*not yet in force*), 21(2)(i)YesNoConcurring with Director of the [Corrupt Practices Investigation Bureau](/wiki/Corrupt_Practices_Investigation_Bureau) for investigation to take place even if Prime Minister refuses consent for Director to investigateArts. 21(2)(i), 22GYesNoAppointing two members of CPA, and a member of the council as chairmanArts. 21(2)(i), 37B(1)(a) and (2)YesNoGranting of [pardons](/wiki/Pardon) and reprieves for offences or execution of sentences, and remissions of sentencesArt. 22PNoNoDeclaring [electoral constituencies](/wiki/Constituencies_of_Singapore) to be [group representation constituencies](/wiki/Group_representation_constituency), the number of candidates required, additional qualifications, and whether such constituencies shall require at least one Malay, or one Indian or other, candidate.Art. 39ANoNoReferring question as to effect of provision of Constitution to tribunal of Supreme Court judges for opinionArt. 100NoNoIssuing Proclamations of [Emergency](/wiki/State_of_emergency) and promulgating emergency ordinancesArt. 150NoNo ### Financial powers As the fiscal guardian for the nation's past reserves (that is, reserves not accumulated by the Government during its current term of office), the president's concurrence is required for a number of financial transactions that the Government may wish to enter into. A guarantee may only be given or a loan raised by the Government if the president concurs, whether the transaction is authorized by a [resolution](/wiki/Resolution_(law)) of Parliament or is made under one of eight specified statutes. The president's approval is also needed for budgets of specified [statutory boards](/wiki/Government_of_Singapore#Statutory_boards) and Government companies that draw on their past reserves. The statutory boards that come under the president's purview are the [Central Provident Fund Board](/wiki/Central_Provident_Fund_Board) (CPF Board), the [Housing and Development Board](/wiki/Housing_and_Development_Board), [JTC Corporation](/wiki/JTC_Corporation) and the [Monetary Authority of Singapore](/wiki/Monetary_Authority_of_Singapore), while the Government companies are the [Government of Singapore Investment Corporation Pte. Ltd.](/wiki/Government_of_Singapore_Investment_Corporation), MND Holdings Pte. Ltd., and [Temasek Holdings Pte. Ltd.](/wiki/Temasek_Holdings) Before the start of its financial year, every statutory board and the board of directors of every Government company must present its budget for that financial year to the president, together with a declaration by the statutory board's chairman and [chief executive officer](/wiki/Chief_executive_officer) (CEO), or the Government company's chairman of the board of directors and the CEO, as to whether the budget is likely to draw upon past reserves. If so, the president may exercise personal discretion to disapprove the budget. If he approves the budget even though he is of the opinion that the budget is likely to draw upon past reserves, the decision and opinion must be published in the *Government Gazette*. Similarly, statutory boards and Government companies are bound to inform the president of financial transactions that are likely to draw on past reserves, and the president has personal discretion as to whether such transactions should be approved. In addition, the president possesses personal discretion to withhold his assent to any [bill](/wiki/Bill_(proposed_law)) in Parliament providing directly or indirectly for: - the direct or indirect variation, changing or increase in powers of the CPF Board to invest moneys belonging to it; and - the borrowing of money, the giving of any guarantee or the raising of any loan by the Government if in the president's opinion the bill is likely to draw on reserves not accumulated by the Government during its current term of office. The president may withhold assent to any Supply Bill, Supplementary Supply Bill or Final Supply Bill for any financial year if in his opinion the estimates of revenue and expenditure, supplementary estimates or statement of excess are likely to lead to a drawing on past reserves. However, if his decision to do so is contrary to the CPA's recommendation, the refusal to concur may be overridden by a Parliamentary resolution passed by not less than two-thirds of all the elected [Members of Parliament](/wiki/Members_of_the_Singapore_Parliament) (MPs). #### Changes to the president's financial powers ##### Transfer of surpluses from statutory boards and Government companies Initially, the president had the power to disapprove transactions that were likely to draw on reserves, including all transfers of funds from the Government, and from statutory boards and Government companies specified in the Fifth Schedule to the Constitution, to any other entity within or outside that group. In 1994, the Constitution was amended to allow statutory boards and Government companies to transfer their reserves to the Government, provided that the Minister for Finance gave a written undertaking that these sums would be added to past reserves. This effectively excluded such transfers from the president's scrutiny while at the same time adding another safeguard in the form of the Minister's undertaking. The Constitution was further amended in 2002, allowing a transfer or proposed transfer of reserves between statutory boards upon the passing of a resolution by the statutory board to add those reserves to its past reserves. Finally, following amendments in 2004, statutory boards and Government companies are now allowed to transfer their surpluses either to the Government or to each other without the president's scrutiny. A new Article 148I was also added, enabling the Government to transfer its past reserves to any statutory boards and Government companies without the president's consent. ##### Removal of Singapore Technologies and POSB from Constitution Singapore Technologies (now [ST Engineering](/wiki/ST_Engineering)) was formerly a Government company and the [Post Office Savings Bank](/wiki/POSB_Bank) (POSB, now [POSB Bank](/wiki/POSB_Bank)) a statutory board the budgets of which were under the president's scrutiny. They were removed from lists of statutory boards and Government companies in the Fifth Schedule to the Constitution in 1994 and 1998 respectively. The change of status of POSB allowed for its sale to [DBS Bank](/wiki/DBS_Bank) to be effected without the president having to be informed of the matter. Although both ST Engineering and DBS Bank (parent of POSB Bank) are freely traded as [public companies](/wiki/Public_company) on the [Singapore Exchange](/wiki/Singapore_Exchange), both the companies have large percentages of equity being continuously owned by [Temasek Holdings](/wiki/Temasek_Holdings), a state holding company owned by the [Government of Singapore](/wiki/Government_of_Singapore). ##### Removal of veto powers over defence and security measures A provision, Article 151A, that was inserted into the Constitution in 1994 removed the president's [veto](/wiki/Veto) powers over \"any defence and security measure\". A *defence and security measure* is defined as > ... any liability or proposed transaction which the Prime Minister and the Minister responsible for defence, on the recommendations of the Permanent Secretary to the [Ministry of Defence](/wiki/Ministry_of_Defence_(Singapore)) and the Chief of Defence Force, certify to be necessary for the defence and security of Singapore. When proposed in Parliament, the change was met with strong criticism from legislators that the provision was so wide that it was open to abuse by unscrupulous politicians. [Nominated Member of Parliament](/wiki/Nominated_Member_of_Parliament) (NMP) [Walter Woon](/wiki/Walter_Woon) argued that such a change would make it too easy for a rogue government to circumvent the constitutional safeguards since \"national security\" was \"such a wide thing that it would be possible to fit any sort of handouts within the rubric\". The Government's response was that since it was the prime minister and Cabinet's job to decide whether Singapore goes to war, they must have the full powers to execute such a decision and Singapore cannot risk a tussle between the prime minister and the president. ##### Changes to the Monetary Authority of Singapore Act Before 30 June 2007, the [Monetary Authority of Singapore](/wiki/Monetary_Authority_of_Singapore) (MAS) could only purchase and sell [securities](/wiki/Security_(finance)) authorized by the president and with the recommendation of the Authority's board of directors. Following a 2007 amendment to the Monetary Authority of Singapore Act, the president's approval was no longer required. The reason for the change cited by the [Minister for Trade and Industry](/wiki/Ministry_of_Trade_and_Industry_(Singapore)) [Lim Hng Kiang](/wiki/Lim_Hng_Kiang) was that since the range of new securities and assets was getting wider and more complex, this made it \"very cumbersome\" for the president to have to approve every new recommendation for such purchases. ##### Changes in the definition of net investment income The president's scope of scrutiny over Singapore's net investment income (NII) derived from both current and past reserves depends on whether such NII is considered \"past reserves\". The Constitution was amended in 2001 to state that all the NII in a financial year certified by the Government to be derived from its current reserves (that is, reserves accumulated by the Government during its current term of office) returns to current reserves. If no certification is made, at least 50% of the NII of the financial year derived from past reserves has to be classified as past reserves. These changes, however, do not apply to the NII earned by specified statutory boards and Government companies. Their NII is considered as part of normal income and is excluded from the president's scrutiny. #### Differences between Government and first directly elected President On 1 September 1993, [Ong Teng Cheong](/wiki/Ong_Teng_Cheong) became Singapore's first directly elected president. During his term of office, some differences arose between him and the Government concerning the extent of his discretionary fiscal powers. At a press conference on 16 July 1999, the president announced he would not be seeking re-election, and referred to what he termed a \"long list\" of problems he had experienced when trying to protect the nation's past reserves. In particular, he mentioned: - that the Accountant-General had informed him it would take 52 [man-years](/wiki/Man-hour#Similar_units) to provide him with a list of the Government's physical assets; - an \"unpleasant\" encounter in which he had felt compelled to withhold approval of the budget of the [Central Provident Fund Board](/wiki/Central_Provident_Fund_Board) (CPF Board) as it would have drawn on its past reserves; - a disagreement regarding whether net investment income (NII) should be treated as current or past reserves; and - his \"disappointment\" that the Government had changed its treatment of NII so as not to require him to approve the use of past reserves to finance its package of cost-cutting measures aimed at combating the effects of the [1997 Asian financial crisis](/wiki/1997_Asian_financial_crisis). The [Minister for Finance](/wiki/Ministry_of_Finance_(Singapore)) [Richard Hu Tsu Tau](/wiki/Richard_Hu) and the Prime Minister [Goh Chok Tong](/wiki/Goh_Chok_Tong) made ministerial statements in Parliament on 17 August 1999 explaining the Government's views on the points raised. Access to information To exercise his constitutional functions, the president is entitled to request information about the Government which is available to the Cabinet, and about the statutory boards and Government companies listed in the Fifth Schedule to the Constitution which is available to the board's members or the company's directors. The president may also ask any Minister, senior officer of a ministry or a government department, CEO and members of the governing board of a statutory board, and directors of any Government company to furnish information concerning the reserves of the Government, a statutory board or a Government company. At a meeting with the Accountant-General in August 1996, the president, having been given a list of the Government's physical assets, had commented that the monetary value of the assets should have been stated. The Accountant-General had then stated it would take 56 (not 52) man-years to value the properties. The Minister for Finance explained that his Ministry had asked the Attorney-General to advise it as to whether such a valuation was necessary. The Attorney-General's Chambers subsequently stated that the Constitution did not require Government property to be revalued, as the issue of whether past reserves were being drawn upon did not arise unless ownership of a piece of property was about to be transferred. In addition, a revaluation would lead to unnecessary expense since much state land would remain as such, and the value of each piece of land depended on planning and zoning restrictions which the Government could change. Withholding of approval for CPF Board's budget In December 1996, the CPA informed the president that for 1997 the CPF Board had budgeted for [capital expenditure](/wiki/Capital_expenditure) of [S$](/wiki/Singapore_dollar)27 million, which exceeded its [operating surplus](/wiki/Operating_surplus) of $23 million. Although the intention was for the excess of $4 million to be funded out of the Board's accumulated surpluses, because a general election was due in 1997 the Board's accumulated surpluses would become past reserves and require the president's approval to be drawn upon. The Government explained that the CPF Board's accounts were prepared on an [accrual basis](/wiki/Comparison_of_Cash_Method_and_Accrual_Method_of_accounting). Thus, capital expenditure was [depreciated](/wiki/Depreciation) over the useful life of each [asset](/wiki/Asset) and not indicated as a [lump sum](/wiki/Lump_sum) in the year of expenditure. The Board's operating surplus of $23 million had been computed on the basis of annual depreciation of $11 million being charged against the year's income. Hence, no drawdown on past reserves was required. The president expressed concern that accrual accounting would \"allow a profligate Government to hide its lavish spending under the guise of capital expenditures\". The Government disagreed, taking the view that accrual accounting was well established. Definition of net investment income The president informed Government that he had been told that net investment income (NII) should be classified as current reserves, though he was not certain as he was not an accountant. The Government, having taken the Attorney-General's advice on the matter, said that NII was correctly treated as current income, as it is the [interest](/wiki/Interest) and [dividend](/wiki/Dividend) [income](/wiki/Passive_income) earned from investing the Government's reserves, less expenses on investment and debt servicing. It does not include [capital gains](/wiki/Capital_gain) or [losses](/wiki/Capital_loss) from the disposal of investments, which are regarded as investment adjustments. Since the Constitution provides that the president has only custodial powers over past reserves, these powers do not extend to NII as they are accumulated during the current term of office of the Government, even when the NII stems from the investment of past reserves that are themselves \"locked up\". Nonetheless, the Government would take into consideration a suggestion from the president and the CPA to lock away half of the NII derived from past reserves as past reserves. In 2001, as indicated above, the Government amended the Constitution to redefine how NII should be treated. Government's change in treatment of NII Finally, the Government disagreed with the president that it had changed the way it treated NII. Furthermore, it had not been necessary to ask him to sanction the use of past reserves for its financial packages and the [budget deficit](/wiki/Government_budget_deficit) as it had enough budget surpluses built up within its current term of office. Following discussions between the president and the Government, in 1999 the Government issued a non-binding [white paper](/wiki/White_paper#Government_white_papers) entitled *The Principles for Determining and Safeguarding the Accumulated Reserves of the Government and the Fifth Schedule Statutory Boards and Government Companies*. Speaking in Parliament on 17 August 1999, the Prime Minister said: > The Government does not expect the President to agree with it on every issue where he exercises custodial powers. That from time to time the two should hold different opinions on these issues is healthy, and to be expected. ... I would like to place on record before this House President Ong Teng Cheong's significant contributions as Singapore's first elected President. He took his job seriously. He has helped us to test the powers and workings of the new institution, and iron out ambiguities in the powers of the President vis-à-vis the Government. ... Most important of all, he has demonstrated that the two-key system to safeguard Singapore's reserves and key public sector appointments can be made to work. Six months after his term of office ended, Ong gave an interview to *[Asiaweek](/wiki/Asiaweek)* magazine, during which he reiterated that he had only been given an incomplete list of the Government's [immovable assets](/wiki/Real_estate) halfway through his term. In addition, he claimed not to have been informed about \"some ministerial procedures\" as he had learned of the sale of the assets of the Post Office Savings Bank, a statutory board the reserves of which he was supposed to protect, to [DBS Bank](/wiki/DBS_Bank) from the newspapers instead of being informed first. He mentioned: \"[the Prime Minister] said that my statements, and his rebuttal in parliament, were probably a good thing. They showed the transparency of the system. I stand by what I said.\" #### First use of financial powers during the 2008 financial crisis In January 2009, the Government requested approval from President [S. R. Nathan](/wiki/S._R._Nathan) to draw $4.9 billion from past financial reserves to meet current budget expenditure, the first time it had done so. The sum was used to fund the Government's Resilience Package consisting of two schemes aimed at preserving jobs and businesses due to the [2008 financial crisis](/wiki/2008_financial_crisis) and the [Great Recession](/wiki/Great_Recession): the Jobs Credit scheme, which provided employers with financial assistance to pay employees' salaries; and the Special Risk-Sharing Initiative, which helped mid-sized companies to obtain credit. The president gave in-principle approval 11 days later on 21 January. During this time, the Government briefed him and the Council of Presidential Advisers (CPA), and the CPA considered the request and provided the president with its recommendation. Subsequently, at a press conference on 17 February, the president explained that when the Prime Minister had broached the subject informally on 10 January, he had agreed at that stage to give every consideration to the proposal as he and the CPA were already aware of the [Great Recession](/wiki/Great_Recession) and how it was impacting the country. He commented that he was not an Executive President and that the Executive was really the Government. It was for them to find solutions to the nation's problems and come out with proposals: \"As to whether the proposals were right or wrong, we don't micro-manage Government. And it's for the Government in power to determine what is to be done.\" However, \"[i]f they came with scatterbrained proposals I would have said no.\" Eventually, the Government drew just $4 billion, all of which was returned to the reserve pot in 2011. #### Repeated continued use of financial powers during the COVID-19 pandemic In response to the economic crisis that occurred as a result of the [COVID-19 pandemic in Singapore](/wiki/COVID-19_pandemic_in_Singapore) (which began in early 2020), President [Halimah Yacob](/wiki/Halimah_Yacob) granted approval for the government of the day to draw S$21 billion (in April 2020; for the Resilience and Solidarity Budgets), S$31 billion (in May 2020; for the Fortitude Budget), S$11 billion (in March 2021; for the Covid-19 Resilience Package contained within the 2021 Annual Budget), and S$6 billion (in March 2022; for the financial support of the nation's Covid-19 public health expenditure contained within the 2022 Annual Budget). In 2020, the President described the pandemic as a \"very exceptional circumstance\" that necessitated the emergency use of past reserves, in order to \"take care of the people in terms of health and safety... and ensure that they continue to have income\", as the pandemic gave rise to \" [...] a situation where our own survival and existence are at stake.\" Nevertheless, the cumulative draw on past reserves over the two financial years of 2020 and 2021 was up to $42.9 billion, lower than the approved draw of $52 billion that was originally agreed on for financial year 2020. ### Powers relating to key office holders A 1988 White Paper issued by the Government stated that the success of Singapore could be attributed to the stable public sector, and that its stability might be diluted if an irresponsible government made key appointments based on considerations other than merit as \"nepotism and corruption may result and the public service will collapse\". For this reason, the Constitution provides that the president, acting in his discretion, may refuse to make an appointment to any of a number of key offices, or to revoke an appointment if he does not concur with the authority on whose advice he is required by law to act. The offices are: - the [Chief Justice, Judges and Judicial Commissioners of the Supreme Court](/wiki/Judicial_officers_of_the_Republic_of_Singapore#The_Chief_Justice,_Judges_of_Appeal,_Judges_and_Judicial_Commissioners); - the [Attorney-General](/wiki/Attorney-General_of_Singapore); - the chairman and members of the [Presidential Council for Minority Rights](/wiki/Presidential_Council_for_Minority_Rights); - the chairman and members of the Presidential Council for Religious Harmony; - the chairman and members of an advisory board constituted to determine if a person should continue to be placed in preventive detention without trial for security reasons; - the Chairman and members of the Public Service Commission; - members of the Legal Service Commission; - the Chief Valuer; - the Auditor-General; - the Accountant-General; - the [Chief of Defence Force](/wiki/Singapore_Armed_Forces); - the Chiefs of the [Air Force](/wiki/Republic_of_Singapore_Air_Force), [Army](/wiki/Singapore_Army) ,[Navy](/wiki/Republic_of_Singapore_Navy) and [Digital and Intelligence Service](/wiki/Digital_and_Intelligence_Service) ; - members of the Armed Forces Council; - the [Commissioner of Police](/wiki/Commissioner_of_Police_(Singapore)); and - the Director of the Corrupt Practices Investigation Bureau. As a result of changes to the Constitution effected in 1996, Parliament may overrule the president's decision with a resolution passed by not less than two-thirds of all elected MPs if he refuses to make or revoke an appointment contrary to the CPA's recommendation. The president exercises similar powers as regards the appointment or revocation of appointment of the chairman, members or CEO of specified statutory boards and the directors or CEOs of Government companies, and his decisions in this respect may be overruled by Parliament in the same manner as decisions relating to the key office holders referred to above. This constitutional amendment reduced the power of the president to veto executive appointments. The president appoints as Prime Minister an MP who, in his personal judgment, is likely to command the confidence of a majority of MPs. ### Other powers #### Maintenance of Religious Harmony Act The Maintenance of Religious Harmony Act authorizes the Minister for Home Affairs to make a restraining order for up to two years against a person in a position of authority in, or a member of, any religious group or institution where the Minister is satisfied that the person is attempting to commit or has committed any of the following acts: - causing feelings of enmity, hatred, ill-will or hostility between different religious groups; - carrying out activities to promote a political cause, or a cause of any political party while, or under the guise of, propagating or practising any religious belief; - carrying out subversive activities under the guise of propagating or practising any religious belief; or - exciting disaffection against the president or the Government while, or under the guise of, propagating or practising any religious belief. A restraining order can prevent a person from addressing orally or in writing any congregation, parish or group of worshippers or members of any religious group or institution on any subject, restrain him or her from assisting or contributing to any publication produced by any religious group, or prevent him from holding office in an editorial board or a committee of a publication of any religious group without the Minister's prior permission. The Minister may also make a restraining order against a person other than those mentioned above who has committed or is attempting to commit an act causing feelings of enmity, hatred, ill-will or hostility between different religious groups; or who is inciting, instigating or encouraging a religious group or institution, or a leader or member of such a group or institution to do so. Such an order may restrain the person from addressing or advising any religious group or institution or any of its members, or making any statement or causing any statement to be made concerning or affecting relations between that religious group or institution and the Government or any other religious group or institution. Once a restraining order is made, it must be referred to the Presidential Council for Religious Harmony, which must recommend to the president whether the order should be confirmed, cancelled or varied in some way. The president is required to consider the council's recommendations and to decide whether the order should be cancelled or confirmed, and if confirmed whether any variations are necessary. He is required to act in accordance with Cabinet's advice on the matter, unless this conflicts with the council's recommendation, in which case he may exercise personal discretion. #### Internal Security Act The [Internal Security Act](/wiki/Internal_Security_Act_(Singapore)), among other things, authorizes the Minister for Home Affairs to make an order directing that a person be detained for up to two years at a time if the president is satisfied that the detention is necessary to prevent the person from acting in a manner prejudicial to the security of Singapore or the maintenance of public order or essential services. A detained person is entitled to make representations to an advisory board made up of a chairman appointed by the president who is or has been, or is qualified to be, a Supreme Court Judge, and two other members appointed by the president after consulting with the Chief Justice. An advisory board must consider the representations and make recommendations to the president within three months from the date of detention. If an advisory board recommends that a detainee be released, and the government authority on whose advice or order the person was detained disagrees with the board's recommendation, the president has a personal discretion as to whether the person should continue to be detained. The president's power in this area is restricted by the requirement that the board must recommend the detainee's release; if further detention is recommended, the president has no power to direct otherwise. #### Corrupt Practices Investigation Bureau investigations The Director of the [Corrupt Practices Investigation Bureau](/wiki/Corrupt_Practices_Investigation_Bureau) may seek the president's assent to inquire or carry out investigations regarding information received about the conduct of any person, or any allegation or complaint made against any person. The president is permitted to proceed with the investigations, notwithstanding the Prime Minister's refusal to consent, by concurring with the Director. This is one of the few instances where the president's power is not limited by some other body. #### Granting of pardons, reprieves and remissions Subject to Cabinet's advice, the president is empowered to [pardon](/wiki/Pardon) offenders, or accomplices who provide information leading to the conviction of principal offenders in crimes. He may also grant offenders a reprieve or respite from the execution of any sentence; and wholly or partially remit an imposed sentence, penalty or forfeiture. In the case of death sentences, the president must call for reports made to him by the judge who tried the case and the Chief Justice or other presiding judge of the appellate court which heard the appeal in the matter to be forwarded to the Attorney-General. The reports, along with the Attorney-General's opinion on the case, are then forwarded to Cabinet which then advises the president as to whether to exercise his powers. #### Preventing certain constitutional amendments and circumvention or curtailment of powers ##### Article 5(2A) – the sleeping provision Article 5(2A) of the Constitution allows the president to direct that any bill seeking to amend certain important clauses of the Constitution shall not be passed by Parliament unless it has been supported at a national [referendum](/wiki/Referendum) by not less than two-thirds of the total number of votes cast by the electors. The clauses which Article 5(2A) applies to are: - Article 5(2A) itself, and Article 5A which confers discretion on the president to withhold assent to a bill seeking to amend the Constitution that provides for the circumvention or curtailment of his discretionary powers; - the [fundamental liberties](/wiki/Human_rights_in_Singapore) in Part IV; - provisions dealing with the president in Chapter 1 of Part V, and Article 93A which confers jurisdiction on the Supreme Court to determine questions relating to the validity of a [presidential election](/wiki/Presidential_elections_in_Singapore); - Articles 65 and 66, which mandate the dissolution of Parliament every five years and the holding of a [general election](/wiki/Parliamentary_elections_in_Singapore) thereafter; and - other provisions in the Constitution which authorize the president to act in his or her discretion. This provision, however, was not immediately brought into force when enacted, as the Government stated at the time that a grace period of at least four years was needed for modifications and refinements to the Elected President scheme to resolve unforeseen problems that arose upon implementation. As of early 2014, Article 5(2A) had still not been brought into force. On 21 October 2008, in response to a question by NMP [Thio Li-ann](/wiki/Thio_Li-ann), the Prime Minister [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) said: > Our clear and stated intention is to refine the scheme and to iron out the issues that can arise in the light of experience, before we bring the entrenchment provisions into operation and entrench the rules. ... While we have delayed entrenching the scheme, we have, over the years, made a practice of consulting the President on any amendment which affects his powers, and informing Parliament of the President's view in the Second Reading speech. With one exception, in practice, the President has supported all the amendments which affected his powers. Over the last two decades, we have fine-tuned and improved the system of the Elected President in many ways. ... If after five years, no further major changes are necessary, we will consider entrenching the provisions concerning the President's custodial powers. ##### Articles 5A and 22H The original Article 22H of the Constitution provided the president with personal discretion to withhold assent to any bill (other than a bill to which Article 5(2A) applies) which provided directly or indirectly for the circumvention or curtailment of the discretionary powers conferred upon the president by the Constitution. At that time, Article 5(2A) provided that the president could prevent Parliament from passing a bill seeking to amend certain specified clauses of the Constitution, including those dealing with the president's powers, unless it had been supported by not less than two-thirds of the votes cast at a national referendum. However, as Article 5(2A) was not yet in force, a question arose as to whether the Government was entitled to amend the Constitution in a way that circumvented or curtailed the president's discretionary powers, or whether Article 22H prohibited this entirely. To resolve the issue, Article 100 was inserted into the Constitution to enable the president to refer to the [Constitution of the Republic of Singapore Tribunal](/wiki/Constitution_of_the_Republic_of_Singapore_Tribunal) any question as to the effect of any constitutional provision. President Ong Teng Cheong then referred to the Tribunal, which consisted of three Supreme Court judges, the issue of whether he had the power under Article 22H(1) to withhold assent to any bill seeking to amend any of the provisions referred to in Article 5(2A), and specifically to any bill seeking to amend Article 22H to restrict the application of the president's powers under that Article to non-constitutional bills. In a judgment delivered on 20 April 1995, the Tribunal held that even though Article 5(2A) was not in force, the Government's intent in including it as part of the Constitution had to be considered. Looking at it in this way, it was clear that Article 5(2A) was intended to deal with bills seeking to amend the Constitution, while Article 22H covered only ordinary bills. Therefore, the president had no power under Article 22H to withhold his assent to any bill seeking to amend the Constitution, and in particular any of the provisions referred to Article 5(2A). In 1996, Article 5A was inserted into the Constitution and Article 22H was amended; these changes clarified the situation by providing different procedures for circumventing or curtailing the president's discretionary power, depending on whether the Government seeks to do so by way of an ordinary bill or a bill seeking to amend the Constitution. Article 22H deals with attempts to alter the president's powers by introducing an ordinary bill. If this occurs, the president may exercise personal discretion to withhold assent to the bill. The Cabinet may, if it wishes, advise the president to refer to the Constitution Tribunal the question whether the bill in fact has the effect of circumventing or curtailing his discretionary powers. If the Tribunal determines that the bill does not have that effect, the president is deemed to have assented to the bill on the day following the day when the Tribunal's opinion is pronounced [in open court](/wiki/In_open_court). On the other hand, Article 5A deals with attempts to alter the president's power by amending the Constitution itself. When the provision is brought into force, the president will also be able to decline to assent to a bill seeking to amend the Constitution that has a direct or indirect effect of circumventing or curtailing his discretionary powers. In this case, the Cabinet may also advise the president to refer to the Tribunal the question of whether the bill indeed has this effect. If the Tribunal rules that the bill does not have this effect, the president is deemed to have assented to the bill on the day immediately following the day when the Tribunal pronounces its opinion in open court. On the other hand, if the Tribunal decides to the contrary and the Government wishes to push the amendment through in the face of the president's opposition to it, the Prime Minister may opt to submit the bill to the electorate. If the bill is supported at a national referendum by not less than two-thirds of the total number of votes cast, the president is deemed to have assented to the bill on the day immediately following the day when the results of the referendum have been published in the *Government Gazette*. ### Public expressions of opinion #### Views of presidential candidates and Government The issue of whether the president has power to speak up publicly on issues that he or she may have with the Government without Cabinet approval surfaced during the [2011 presidential election](/wiki/2011_Singaporean_presidential_election). One candidate, [Tan Kin Lian](/wiki/Tan_Kin_Lian), sparked off the debate by saying that the president should be entitled to do so as the president \"represents the views of the people\". Similarly, another candidate, [Tan Jee Say](/wiki/Tan_Jee_Say), promised to be the \"conscience of the people\" and commented that for controversial issues such as the building of casinos the president's views should be taken into consideration and that he should be allowed to air them in public. Candidate [Tan Cheng Bock](/wiki/Tan_Cheng_Bock) expressed his opinion in a Facebook posting that read: \"[T]he president must be seen not as a figurehead but as somebody the people can look to for support for some of the issues, national problems and so on. ... I would like to play a much bigger role to engage Singaporeans and have them come to talk to the president\". [Tony Tan Keng Yam](/wiki/Tony_Tan_(Singaporean_president)), who was eventually elected president, took a more conservative view and stated that the president ought to work within the Constitution. The controversy drew sharp rebuttals from [Law](/wiki/Ministry_of_Law_(Singapore)) and [Foreign Affairs Minister](/wiki/Ministry_of_Foreign_Affairs_(Singapore)) [K. Shanmugam](/wiki/K._Shanmugam). In a speech at a forum organized by the [Institute of Policy Studies](/wiki/Institute_of_Policy_Studies_(Singapore)), he argued that voters elect the president for the purpose of enabling him to exercise the discretionary powers granted to him under the Constitution, which means the president's accountability to the electorate is restricted to these matters. He then raised the argument that since Article 21(1) states that the president shall, \"in the exercise of his functions under this Constitution or any other written law, act in accordance with the advice of the Cabinet or of a Minister acting under the general authority of the Cabinet\", it would be unconstitutional for the president to speak on his own volition in the absence of Cabinet's advice. He also said that the president's constitutional position is similar to that of the [British Monarch](/wiki/Monarchy_of_the_United_Kingdom), quoting a letter of 4 December 1963 from the [British Prime Minister](/wiki/Prime_Minister_of_the_United_Kingdom) [Stanley Baldwin](/wiki/Stanley_Baldwin) to [King Edward VIII](/wiki/Edward_VIII) in which it was stated that \"Ministers are willing to give an experienced Monarch who thoroughly understands and has always strictly observed constitutional limitations, a discretion to what he would say, and are content to take full responsibility knowing well that the Monarch will say nothing of which his Ministers would not approve\". Shanmugam posed the question: \"If the purpose is to influence the Government, would the best approach be to go public, or would it be to speak to the Prime Minister – as is generally done?\" However, Shanmugam expressed the view that where an issue concerns the discretionary powers that the president is explicitly endowed with, such as fiscal reserves and appointment of key public holders, it is appropriate for the president to speak up publicly even without the Cabinet's sanction. This is in line with the views expressed in Parliament in 1999 by [Goh Chok Tong](/wiki/Goh_Chok_Tong) on Ong Teng Cheong's press conference. Goh said: \"We should not regard it as unusual for the President to publicly acknowledge differences between him and the Government. It shows the independence of the presidency in the two areas in which he is vested with custodial powers, and this will help future presidents\". Also, in response to NMP Zulkifli bin Baharudin, who had inquired about the legitimacy of the president's actions, PM Goh stated that it was for the president to choose the means to communicate these issues to Singaporeans. Without elaborating, Shanmugam pointed out that if the president acts [unconstitutionally](/wiki/Constitutionality), there will be various consequences. The Constitution provides a procedure for Parliament to remove the president from office on various grounds, including intentional violation of the Constitution. #### Other views In the lead-up to the 2011 presidential election, in addition to the views expressed by the candidates and the Government, [Singapore Management University](/wiki/Singapore_Management_University) (SMU) Chairman and [Banyan Tree Holdings](/wiki/Banyan_Tree_Holdings) founder [Ho Kwon Ping](/wiki/Ho_Kwon_Ping) argued that because of the mandate given to the president as a result of being directly elected by the people, the president can be \"the moral voice of the nation and the people\". Ho compared this to the [president of Ireland](/wiki/President_of_Ireland) who, like the Singapore president, is directly elected by the people but plays a largely ceremonial role. The [Constitution of Ireland](/wiki/Constitution_of_Ireland) states that before addressing the nation on any matter of national or public importance, the Irish president must consult the [Council of State](/wiki/Council_of_State_(Ireland)), a body that advises the president in the exercise of many of his or her discretionary powers. Such a message or address must also have received the approval of the Government. Ho wrote, \"Ireland's directly elected but largely ceremonial president is explicitly compelled to get government approval for speeches on specific formal occasions, but is otherwise free to speak his mind. And Irish presidents have taken to TV interviews and radio talk shows to expound their views on many subjects, so long as they do not directly criticise the government.\" In response, SMU academic Wan Wai Yee opined that if the president were to be involved in public discussions, \"it is not clear how he would implement his views, and how he would be held accountable\". More importantly, there would be a tension in the [separation of powers](/wiki/Separation_of_powers_in_Singapore), as the Constitution explicitly vests power to run the Government in the Prime Minister and his Cabinet and makes them accountable to Parliament. \"[P]roblems would arise as to how the differences can be resolved and who would be held responsible for the outcome\", and \"[i]f the EP [Elected President] takes sides on political issues, the institution will inevitably become politicised, and with the high risk that it would be diminished as a result\". ## Soft power First coined by [Joseph Nye](/wiki/Joseph_Nye), the term *[soft power](/wiki/Soft_power)* is used, in contrast with hard or coercive powers such as military power, to describe a new means of international influence by \"attraction\" – \"the ability of a country to structure a situation so that other countries develop preferences or define their interests in ways consistent with its own\". During the 2011 presidential election, Ho Kwon Ping suggested that while the president's \"hard powers\" are his constitutional duties, he also exercises soft power which manifests in three domains. At the private level, the president may consult the prime minister on certain issues; at the bureaucratic level, the president may take an \"activist, inquisitive\" role towards civil servants; and most contentiously, in the public domain, it is up to the people (whose mandate confers such soft powers upon the elected president) to decide how much of a voice the president should have. Ho later clarified his stance, explaining his point was that \"by virtue of being directly elected, the Elected President (EP) will possess the popular mandate to speak out on issues, so long as they are not politically partisan views\". Thio Li-ann expressed a preference for calling it \"influence\" rather than soft power which is an \"imprecise term\". She said it is \"influence [that] comes not from the Constitution but from the symbolism of the office of the head of state\". The degree and effectiveness of such power has been the subject of much debate, with varying opinions among academics, politicians, presidential candidates, the public, and most importantly even between Presidents and the Cabinet. ### Arguments supporting the existence of soft power The arguments for the existence of the president's soft power include his influence in policy-making and his involvement in non-political affairs. Opponents of the idea that such soft powers exist rely on a strict interpretation of the Constitution, arguing that the usage of soft powers by the president will result in politicization of the office. While the existence and extent of the president's soft power have not been officially recognized, such power has been acknowledged as not insignificant. The president is the \"voice of the people\", and serves a function as a check and balance against the executive government. As such, the presence of such soft powers makes the president more than merely a ceremonial figurehead. The Government has so far only appeared to implicitly endorse, and not oppose, two categories of soft power: the president's private influence in politics, and his public involvement in non-political affairs. Minister for Law [K. Shanmugam](/wiki/K._Shanmugam) has stated that \"the quality of the advice given by the President ... would depend on the quality of the person giving the advice\". He referred to the president's ability to speak to the Prime Minister in private – in this way he may be able to influence policy to some extent. The Prime Minister, however, will only give due weight to the president's opinions and advice if \"the president has had substantial experience, is wise, knowledgeable and is trusted and respected by the PM\". If the president is one who \"commands little or no respect from the PM\", then his influence would likely be \"limited\". However, the president must keep these discussions confidential, or risk losing the confidence of the Prime Minister. President Ong Teng Cheong clearly influenced the issuance of the 1999 white paper by the Government which set out guidelines for interaction between the two institutions on matters relating to the nation's past reserves. The office of the president may also have some influence in developing the law. For example, S. R. Nathan persuaded the Government to reappoint Council of Presidential Advisers members for shorter terms. Nathan has also commented favourably on his relationship with the Government, saying that he queried decisions and that senior members of the Government \"showed deference\" to him. Prime Minister Lee Hsien Loong has mentioned that he and Nathan had frequent meetings in which the president would comment on matters and he would consider his views. The president also exercises soft power by championing good causes. Examples include the creation of the President's Star Charity by Ong Teng Cheong, and the launch of the [President's Challenge](/wiki/President%27s_Challenge) by S. R. Nathan. Nathan also acted as patron of and supported various charity organizations by attending fund-raising and volunteer appreciation events. This may be seen as a convention allowing the president to engage in charitable or community welfare work without government objection. ### Arguments against the existence of soft power Most of the arguments that the president does not possess soft power stem from a strict interpretation of the Constitution and what are regarded as the traditional roles of the president. First, unless the Constitution states otherwise, the default position is that when exercising his functions the president has to act according to the advice of the Cabinet. In the context of the Constitution, the word *advice* does not carry its typical meaning of mere opinion or suggestion. The president is obliged to follow the Cabinet's advice. Thus, the president does not have any liberty to exercise soft power. Furthermore, it has been argued that since the president is elected to exercise the powers defined in the Constitution, the concept of \"[political legitimacy](/wiki/Legitimacy_(political))\" posited by proponents would appear to be undermined by soft power, which has an unspecified and ambiguous scope. Secondly, the president serves the important symbolic function of representing the nation. The relationship between the Cabinet and the president may be compared with that between the [Cabinet of the United Kingdom](/wiki/Cabinet_of_the_United_Kingdom) and the [monarchy](/wiki/Monarchy_of_the_United_Kingdom). [Vernon Bogdanor](/wiki/Vernon_Bogdanor) has drawn a distinction between the \"efficient\" and \"dignified\" elements of the [Constitution of the United Kingdom](/wiki/Constitution_of_the_United_Kingdom). The former element is represented by the Cabinet which makes and executes policies, while the latter, represented by the monarchy, has little effective power but serves as a symbol around which citizens can unite. The [head of state](/wiki/Head_of_state) can only properly embody the dignified element of the constitution if he or she is separated from the actual exercise of power, as the latter is virtually always controversial. Therefore, if the president exercises soft power, he would inevitably take sides and politicize his office. This would undermine the traditional role played by the president. ## Notes ### Legislation - [Constitution of the Republic of Singapore](/wiki/Constitution_of_Singapore) (1985 Rev. Ed., 1999 Reprint). - [Internal Security Act](/wiki/Internal_Security_Act_(Singapore)) (Cap. 143, 1985 Rev. Ed.) (\"ISA\"). - [Maintenance of Religious Harmony Act](/wiki/Maintenance_of_Religious_Harmony_Act) (Cap. 167A, 2001 Rev. Ed.) (\"MRHA\"). ### Other works - [Bogdanor, Vernon](/wiki/Vernon_Bogdanor) (July 1996), \"The Monarchy and the Constitution\", *[Parliamentary Affairs](/wiki/Parliamentary_Affairs)*, **49** (3): 407–422, [doi](/wiki/Doi_(identifier)):10.1093/pa/49.3.407. - [Ho, Kwon Ping](/wiki/Ho_Kwon_Ping) (7 July 2011), \"Soft powers of a president\" (PDF), *[The Straits Times](/wiki/The_Straits_Times) (reproduced on the [Singapore Management University](/wiki/Singapore_Management_University) (SMU) website)*, p. A27, archived from the original (PDF) on 6 January 2014. - [Hu, Richard Tsu Tau](/wiki/Richard_Hu) ([Minister for Finance](/wiki/Ministry_of_Finance_(Singapore))), \"Issues Raised by President Ong Teng Cheong at his Press Conference on 16th July 1999 (Statements by the Prime Minister and Minister for Finance)\", *Singapore Parliamentary Debates, Official Report* (17 August 1999), vol. 70, cols. 2018–2061 (\"Ministerial Statement\"). - [K. Shanmugam](/wiki/K._Shanmugam) (5 August 2011), *Speech by Minister for Foreign Affairs and Law, Mr K Shanmugam, at the Institute of Policy Studies Forum on the Elected Presidency*, [Ministry of Law](/wiki/Ministry_of_Law_(Singapore)), archived from the original on 7 April 2012. - Tan, Kevin Y[ew] L[ee]; [Thio, Li-ann](/wiki/Thio_Li-ann) (2010), *Constitutional Law in Malaysia and Singapore* (3rd ed.), Singapore: [LexisNexis](/wiki/LexisNexis), pp. 420–431, [ISBN](/wiki/ISBN_(identifier)) 978-981-236-795-2. - Wan, Wai Yee (21 July 2011), \"Don't politicise role of President\" (PDF), *The Straits Times (reproduced on the SMU website)*, p. A25, archived from the original (PDF) on 2 January 2014. ### Articles - Lee, Yvonne C[hing] L[ing] (December 2007), \"Under Lock and Key: The Evolving Role of the Elected President as a Fiscal Guardian\", *Singapore Journal of Legal Studies*: 290–322, [SSRN](/wiki/SSRN_(identifier)) 1139305. - Tan, Kevin Y[ew] L[ee] (2009), \"Constitutionalism in Times of Economic Strife: Developments in Singapore\" (PDF), *National Taiwan University Law Review*, **4** (3): 115–139, archived from the original (PDF) on 17 July 2011. - Wan, Wai Yee (1994), \"Recent Changes to the Westminster System of Government and Government Accountability\", *Singapore Law Review*, **15**: 297–332. ### Books - Chan, Helena H[ui-]M[eng] (1995), \"The Executive\", *The Legal System of Singapore*, Singapore: [Butterworths Asia](/wiki/LexisNexis_Butterworths), pp. 22–29, [ISBN](/wiki/ISBN_(identifier)) 978-0-409-99789-7. - Ho, Khai Leong (2003), *Shared Responsibilities, Unshared Power: The Politics of Policy-making in Singapore*, Singapore: Eastern Universities Press, [ISBN](/wiki/ISBN_(identifier)) 978-981-210-218-8. - Low, Linda; Toh, Mun Heng (1989), *The Elected Presidency as a Safeguard for Official Reserves: What is at Stake? [IPS occasional paper; no. 1]*, Singapore: Times Academic Press in association with the [Institute of Policy Studies](/wiki/Institute_of_Policy_Studies_(Singapore)), [ISBN](/wiki/ISBN_(identifier)) 978-981-00-1014-0. - *Report of the Select Committee on the Constitution of the Republic of Singapore (Amendment No. 3) Bill (Bill No. 23/90) [Parl. 9 of 1990]*, Singapore: Printed for the [Government of Singapore](/wiki/Government_of_Singapore) by Singapore National Printers, 1990, [OCLC](/wiki/OCLC_(identifier)) 212400288. - [*Safeguarding Financial Assets and the Integrity of the Public Services: The Constitution of the Republic of Singapore (Amendment No. 3) Bill [Cmd. 11 of 1990]*](/wiki/Command_paper), Singapore: Printed for the Government of Singapore by Singapore National Printers, 1990, [OCLC](/wiki/OCLC_(identifier)) 39716236. - Tan, Kevin [Yew Lee]; Lam, Peng Er (1997), *Managing Political Change in Singapore: The Elected Presidency*, Singapore: [Routledge](/wiki/Routledge), [ISBN](/wiki/ISBN_(identifier)) 978-0-415-15632-5. - Tan, Kevin Y[ew] L[ee] (2009), \"State and Institution Building through the Singapore Constitution 1965–2005\", in [Thio, Li-ann](/wiki/Thio_Li-ann); Tan, Kevin Y[ew] L[ee] (eds.), *Evolution of a Revolution: Forty Years of the Singapore Constitution*, London; New York, N.Y.: [Routledge-Cavendish](/wiki/Routledge), pp. 50–78 at 68–71, [ISBN](/wiki/ISBN_(identifier)) 978-0-415-43862-9. - Official website of Istana Singapore: Office of the President of the Republic of Singapore\n",
  "language": "en",
  "processed_at": "2026-01-12T11:44:24.202540",
  "title": "Powers of the president of Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Powers_of_the_president_of_Singapore"
}