{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:44:21.756469"
  },
  "content": "Radio station in Singapore **Power 98** is an English-language [internet radio](/wiki/Internet_radio) station (until 2025, an FM radio station) operated by [So Drama! Entertainment](/wiki/So_Drama!_Entertainment) in [Singapore](/wiki/Singapore). Formerly broadcast on 98 megacycles, it broadcasts 24 hours a day, featuring contemporary pop music, entertainment news, and sports updates. ## History Plans for Power 98 were announced in January 1994 at the opening of Safra Resort and Country Club, with a start-up cost of $3.3 million from the [Ministry of Defence](/wiki/Ministry_of_Defence_(Singapore)). The station targeted male listeners aged 18 to 35, considered an under-served market. It initially recruited seven deejays, all in their twenties, with experience in hosting programs at private events and nightclubs. Power 98 initially broadcast from 6 am to 12 am, with music comprising four-fifths of its programming, mainly hits from the 1980s and 1990s, alongside news, defence-related information, and entertainment segments. A bilingual lunch-time show, Power Lunch, allowed listeners to request Mandarin songs. The station launched on 31 October 1994 at 7 am, officiated by Minister [Lee Boon Yang](/wiki/Lee_Boon_Yang). On 19 March 2012, Power 98 underwent its first major revamp in 18 years, adopting the slogan \"Hear The Difference,\" with a new lineup of DJs and programs. In 2019, it rebranded as Power 98 Love Songs, alongside two [internet radio](/wiki/Internet_radio) services: Power 98 Raw ([contemporary](/wiki/Contemporary_hit_radio) hits) and Power 98 Retro ([adult hits](/wiki/Adult_hits)).[*citation needed*] In June 2025, So Drama! Entertainment announced that it would close its FM radio stations on 30 October 2025 at 11:59 p.m. and shift exclusively to internet radio via its newly-rebranded Kakee app, with its [broadcasting license and franchise to own and operate radio stations](/wiki/Broadcast_law) was cancelled and surrendered to, and the former frequencies were recalled by [IMDA](/wiki/Infocomm_Media_Development_Authority). - [MOR Philippines](/wiki/MOR_Entertainment) [stations](/wiki/List_of_ABS-CBN_Corporation_channels_and_stations#My_Only_Radio_(defunct)) - [DWRR-FM](/wiki/DWRR-FM) - [List of radio stations in Singapore](/wiki/List_of_radio_stations_in_Singapore) - POWER 98 Official Website This article about a radio station in Asia is a stub. You can help Wikipedia by expanding it. - v - t - e This article about media in Singapore is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:44:21.756164",
  "title": "Power 98 (radio station)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Power_98_(radio_station)"
}