{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:44:26.024580"
  },
  "content": "American fashion designer (born 1974) **Prabal Gurung** ([Nepali](/wiki/Nepali_language): प्रवल गुरुङ) (born 1974) is a [Nepalese American](/wiki/Nepalese_Americans) [fashion designer](/wiki/Fashion_designer) based in New York City. He launched his own [eponymous](/wiki/Eponym) label in 2009. Since 2017, he has also been the creative director for Japanese jewelry house Tasaki. Gurung is a co-founder of the [House of Slay](/wiki/House_of_Slay). As of December 2024, he is vice chairman of the [Council of Fashion Designers of America](/wiki/Council_of_Fashion_Designers_of_America) (CFDA). His memoir, *Walk Like a Girl*, was released in May 2025. ## Early life and education Gurung was born in 1974, in Singapore to Nepali parents and raised in [Kathmandu](/wiki/Kathmandu), Nepal. His mother, Durga Rana, was a former boutique owner. His older brother, Pravesh Rana Gurung, is an Indian film director, and his older sister, Kumudini Shrestha, is a teacher and social worker. He went to a Jesuit school, [St. Xavier's School](/wiki/St._Xavier%27s_School,_Jawalakhel) in [Jawalakhel](/wiki/Jawalakhel). Before entering the fashion world, he earned a bachelor's degree in hotel management from the National Council of Hotel Management, Catering Technology and Applied Nutrition. He had always been interested in clothing and colors and was introduced to the world of fashion when he moved to New Delhi. There, he attended the [National Institute of Fashion Technology](/wiki/National_Institute_of_Fashion_Technology). In India, Gurung apprenticed for local fashion houses and started designing with [Manish Arora](/wiki/Manish_Arora). He has stated, \"From the brilliance of Bollywood to the fabrics, embroideries, and textures you can find at [Chandni Chowk](/wiki/Chandni_Chowk) to the fast-paced streets of Mumbai, it's an incredible place.\" For seven years, Gurung traveled to Australia and England, assisting stylists and editors with fashion shows and photo shoots. He then returned to Nepal. In 1999, Gurung moved to New York City, where he completed his studies at the [Parsons School of Design](/wiki/Parsons_School_of_Design). ## Career While studying at Parsons School of Design, Gurung had an internship with [Donna Karan](/wiki/Donna_Karan_International). He then spent two years on the design and production team at [Cynthia Rowley](/wiki/Cynthia_Rowley). In 2004, he was appointed design director at [Bill Blass](/wiki/Bill_Blass_Group), where he remained for five years. ### Prabal Gurung In February 2009, launched his own label, PRABAL GURUNG, during [New York Fashion Week](/wiki/New_York_Fashion_Week). His eponymous label has become known for its gowns and dresses. His many fans include former First Lady [Michelle Obama](/wiki/Michelle_Obama); former Vice President [Kamala Harris](/wiki/Kamala_Harris); the Duchess of Cambridge, [Kate Middleton](/wiki/Kate_Middleton); multihyphenate [Oprah Winfrey](/wiki/Oprah_Winfrey); and actresses [Sarah Jessica Parker](/wiki/Sarah_Jessica_Parker), [Anne Hathaway](/wiki/Anne_Hathaway), and [Demi Moore](/wiki/Demi_Moore). His collections are known for taking inspiration from a diverse range of cultural influences from season to season. These have included his favorite designer, [Yves Saint Laurent](/wiki/Yves_Saint_Laurent_(fashion_house)); erotic photographs by [Nobuyoshi Araki](/wiki/Nobuyoshi_Araki); and the character [Miss Havisham](/wiki/Miss_Havisham) from *[Great Expectations](/wiki/Great_Expectations)* by [Charles Dickens](/wiki/Charles_Dickens). In 2011, Gurung was appointed chief designer for the relaunch of Onward Kashiyama's ICB collections in Europe. Also in 2011, Gurung was commissioned by [Sephora](/wiki/Sephora) to create new uniforms for all its beauty advisers in North America, making it the first change to the retailer's employee wear since 2001. He later worked on collections with [Lane Bryant](/wiki/Lane_Bryant) (2017), Target (2013), and [MAC Cosmetics](/wiki/MAC_Cosmetics) (2014). ## Other activities Aside from his full-time career as a fashion designer, Gurung established the Shikshya Foundation in Nepal, a non-profit program to benefit underprivileged children. This program was created in 2012, and since then has benefited over sixty students. The Shikshya Foundation also funds workshops and orientations for teachers educating students in reading, writing, mathematics, and finance. To raise awareness for his project, he worked with [Toms](/wiki/Toms_Shoes) in 2016. In addition, Gurung has supported [Planned Parenthood](/wiki/Planned_Parenthood), [ACLU](/wiki/ACLU), voter registration, and created a relief fund for victims of the [April 2015 Nepal earthquake](/wiki/April_2015_Nepal_earthquake) which raised almost one million in funds. Gurung also joined the \"[Stop Asian Hate](/wiki/Stop_Asian_Hate)\" campaign, which works to stop the rise in Asian hate-crimes and racism as exacerbated by [COVID-19](/wiki/Coronavirus_disease_2019). ## Awards and honors In 2011, Gurung was the recipient of the Ecco Domani Fashion Fund Award and received a nomination for the 2010 [CFDA](/wiki/Council_of_Fashion_Designers_of_America)/[Swarovski](/wiki/Swarovski) Womenswear Award. He was also chosen by prominent fashion editors, retailers, designers and business people for the CFDA Fashion Incubator for 2010–2012. In November 2010, Gurung was runner-up for the 2010 CFDA/Vogue Fashion Fund. He was listed as a finalist for the [Cooper-Hewitt National Design Award](/wiki/National_Design_Awards) (2012), receiving the CFDA Swarovski Award for Womenswear (2011), winning the Drawing Award from the Creativity Center (2015). ## Personal life Gurung lives in an apartment near [Washington Square Park](/wiki/Washington_Square_Park). - [List of Nepali people](/wiki/List_of_Nepalese_people) - [LGBT culture in New York City](/wiki/LGBT_culture_in_New_York_City) - [List of LGBT people from New York City](/wiki/List_of_LGBT_people_from_New_York_City) - [NYC Pride March](/wiki/NYC_Pride_March) - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:44:26.024303",
  "title": "Prabal Gurung",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Prabal_Gurung"
}