{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:44:29.235520"
  },
  "content": "Singaporean award **Pravasi Express Awards** were introduced in 2013 for appreciating personalities for outstanding contributions to society and endeavours in their chosen field/profession. The awards are overseen by Pravasi Publications from [Singapore](/wiki/Singapore), publishers of the [Pravasi Express](/wiki/Pravasi_Express) Newspaper. ## History The first Pravasi Express Awards were presented on 4 August 2013 in a public function at Spring Auditorium, [Singapore](/wiki/Singapore) with over 400 guests. The Former [Chief Minister](/wiki/Chief_Minister) of [Kerala](/wiki/Kerala) [V. S. Achuthanandan](/wiki/V._S._Achuthanandan) was awarded the first [Pravasi Express](/wiki/Pravasi_Express) \"Life Achievement Award\" in the ceremony. The award ceremony was presided over by [Ambassador-at-Large](/wiki/Ambassador-at-Large) Gopinatha Pillai with the presence of [Malayalam](/wiki/Malayalam) Lyrist [Anil Panachooran](/wiki/Anil_Panachooran) and actor [Unni Mukundan](/wiki/Unni_Mukundan). The second edition of Pravasi Express Awards were presented during the third anniversary celebration of [Pravasi Express](/wiki/Pravasi_Express) held on 5 July 2014 at Nexus Auditorium, [Singapore](/wiki/Singapore). The awards ceremony was presided over by [Ambassador-at-Large](/wiki/Ambassador-at-Large) Gopinatha Pillai and singer [Jayachandran](/wiki/P._Jayachandran) was awarded the \"Life Achievement Award\" for his contribution to music. National Award winner [Priyamani](/wiki/Priyamani) received the \"Youth Icon Award\". There were musical performances from [Jayachandran](/wiki/P._Jayachandran), Chandralekha, Ragesh Brahmanandan and Snehaja. ## Awards Pravasi Express awards are given to Indians from different part of the world, to honor their contributions to society and endeavours in their chosen field/profession. The awards cover different categories including social commitment, business excellence, contribution to [Malayalee](/wiki/Malayalee) diaspora, arts and also to appreciate the emerging champions in all the categories. ### 2020 Awards Pravasi Express Awards 2020 were awarded in a virtual event held on 18 July 2020. [T.P Sreenivasan](/wiki/T._P._Sreenivasan), former IFS Official and Ambassador was awarded the Malayalee Ratna Award. He has served as secretary of legation in Tokyo, Thimphu, Moscow. He has also served as a permanent representative of India to the United Nations. PE Life Time Achievement Award was presented to the renowned dancer, founder and chief mentor / trainer of Baskar's Academy - Mrs Santha Bhaskar for her six-long decade's significant contribution in the field of music and dance. Young talented actor [Tovino Thomas](/wiki/Tovino_Thomas) was awarded the Youth icon award and the award event was followed by musical performance from [Harish Sivaramakrishnan](/wiki/Harish_Sivaramakrishnan). PE Malayalee Ratna Award[T.P Sreenivasan](/wiki/T._P._Sreenivasan), Former IFS Official and AmbassadorPE Life Time Achievement AwardSantha Bhaskar, Renowned dancerPE Youth Icon Award[Tovino Thomas](/wiki/Tovino_Thomas), ActorPE Social Excellence AwardShaji Philip, PhilanthropistPE Young Entrepreneur AwardAnes M.K. ### 2019 Awards Pravasi Express Awards 2019 were awarded in Pravasi Express Nite 2019 held at Shine Auditorium, [Singapore](/wiki/Singapore) with the presence of [Ambassador-at-Large](/wiki/Ambassador-at-Large) Gopinatha Pillai, Dr. V.P. Nair, [Pravasi Express](/wiki/Pravasi_Express) Chief Editor Mr.Rajesh Kumar, [Chengannur](/wiki/Chengannur) [MLA](/wiki/Member_of_the_Legislative_Assembly_(India)) [Saji Cherian](/wiki/Saji_Cherian) and Singapore Kairali Kala Nilayam secretary Mr.Basil Baby. Poet and activist [Sugathakumari](/wiki/Sugathakumari) was honored with the *Pravasi Express Lifetime Achievement Award* for her contribution to [Malayalam Literature](/wiki/Malayalam_literature). Award night was followed by a musical performance from [Shahabaz Aman](/wiki/Shahabaz_Aman) and dance performance by Film actor [Arya Rohit](/wiki/Arya_Rohit). Malayalam comedy actor Ullas Pandalam and team also entertained the guests. Award night also witnessed the inauguration of Singapore Kairali Film Forum (SKFF) by Singapore Film director [K. Rajagopal](/wiki/K._Rajagopal_(director)) which was followed by the screening of the first micro film from SKFF *Godfather*. PE Lifetime Achievement Award[Sugathakumari](/wiki/Sugathakumari), poet and activistPE Music Excellence Award[Shahabaz Aman](/wiki/Shahabaz_Aman), playback singer and composerPE BusinessExcellence Award[Joy Allukas](/wiki/Joy_Alukkas)PE Social Excellence Award[Saji Cherian](/wiki/Saji_Cherian), politicianPE Vanitha Ratnam AwardDr. Lissy ShajahanPE Art and Culture Excellence AwardDr. Chitra KrishnakumarPE Sports Excellence AwardRahul K Raju ### 2018 Awards Pravasi Express Awards 2018 were awarded in Pravasi Express Nite 2018 held at [Kallang Theatre](/wiki/Kallang_Theatre), [Singapore](/wiki/Singapore) with the presence of Mr. Lee Hong Chuang BBM, Advisor Hougang Grassroot Organisation, [Ambassador-at-Large](/wiki/Ambassador-at-Large) Gopinatha Pillai, [Pravasi Express](/wiki/Pravasi_Express) Chief Editor Mr.Rajesh Kumar, [National Film Award](/wiki/National_Film_Award) playback singer Ms.Vani Jayaram and Singapore Kairali Kala Nilayam secretary Mr.Basil Baby. Veteran Playback Singer [Vani Jayaram](/wiki/Vani_Jayaram) was awarded the *Pravasi Express Lifetime Achievement Award* for her contribution to Indian film industry and Malayalam film actor [Suraj Venjaramood](/wiki/Suraj_Venjaramood) was awarded with *Pravasi Express acting Excellence Award* for his contribution to Malayalam film industry . Award night was followed by music from [Vani Jayaram](/wiki/Vani_Jayaram) and actor [Suraj Venjaramood](/wiki/Suraj_Venjaramood) entertained the crowd. Abhijeet Kollam, Vaishnav Girish and Praseeda also sang. PE Lifetime Achievement Award[Vani Jairam](/wiki/Vani_Jairam), playback singerPE Acting Excellence Award[Suraj Venjaramood](/wiki/Suraj_Venjaramood), film actorPE Youth Icon Award[Aishwarya Lekshmi](/wiki/Aishwarya_Lekshmi), film actressPE Vanitha Ratnam AwardAnnie LibuPE BusinessExcellence AwardShera Thampi, Dowser GroupPE BusinessExcellence AwardPhillip Michael, Y AxisPE BusinessExcellence AwardPrabhiraj Natarajan, Aris GroupPE Art and Culture Excellence AwardMM DollahPE Social Excellence AwardC M Ashhraf Ali, MalaysiaPE Award for Best Singer[Abhijith Kollam](/wiki/Abhijith_Kollam) #### Special Categories Other honorable award recipients were Jaleela Niaz (PE Special Awards - Excellence in Visual Arts) and Hema Malini (PE Special Awards - Excellence in Art and Culture). ### 2017 Awards Pravasi Express Awards 2017 took place in Pravasi Express Nite 2017 held at Holiday Inn, [Singapore](/wiki/Singapore) in the presence of [Kerala](/wiki/Kerala) Minister for Culture and Law Mr. AK Balan, Singapore Indian High Commissioner Mr.Javed Ashraf and Pravasi Express Chief Editor Mr.Rajesh Kumar. Minister Mr. AK Balan presided over the function and also inaugurated the 60th anniversary celebrations of Kairalee Kala Nilayam, Singapore. Veteran Film actor [Madhu (actor)](/wiki/Madhu_(actor)) was honored with the Pravasi Express Lifetime Achievement Award for his contribution to [Malayalam](/wiki/Malayalam) film industry and Football Legend [IM Vijayan](/wiki/IM_Vijayan) was awarded with Pravasi Express Lifetime Sports Excellence Award. PE Lifetime Achievement Award[Madhu (actor)](/wiki/Madhu_(actor)), film actorPE Lifetime Sports Excellence Award[IM Vijayan](/wiki/IM_Vijayan), football playerPE Malayalee Ratna AwardSohan RoyPE BusinessExcellence AwardCapt. Rajesh Unni, Synergy GroupPE Film Critic Award[Vinu Mohan](/wiki/Vinu_Mohan), actorPE Youth Icon AwardRajisha Vijayan, actor #### Special Categories Other recipients were D Sudheeran (Literary Award), Shanta Rati (Dance Icon of Singapore), Sangeetha Nambiar (Women Empowerment), Deivani (Community Engagement), Dr.V P Nair (Health Care), Shilpa Krishnan Shukla (Women Achiever), Arun Sundar (Information Technology), Prajith Manikkoth (Young Achiever), Stephan Samuel (Social Excellence), Mallika Girish Panicher (Performing Arts) and Dr. Anitha Devi Pillai (Research Literature), Sooraj & Ann (Critic Award: Acting). ### 2016 Awards Pravasi Express Awards 2016 were presented by [Ambassador-at-Large](/wiki/Ambassador-at-Large) Gopinatha Pillai in “Pravasi Express Nite-2016” held at Kallang Theatre on 6 August 2016. The event was preceded over by [Pravasi Express](/wiki/Pravasi_Express) [Editor-in-Chief](/wiki/Editor-in-Chief) G Rajesh Kumar and [K B Ganesh Kumar](/wiki/Ganesh_Kumar), film actor and former Kerala minister was the guest of honour. The award function was followed by music led by [G Venugopal](/wiki/G_Venugopal) and drama by Singapore Kairalee Kala Nilayam, [Singapore](/wiki/Singapore). PE Lifetime Achievement Award[Daya Bai](/wiki/Daya_Bai), social activistPE Music Excellence Award[G Venugopal](/wiki/G_Venugopal), singerPE Media Excellence AwardMP Shyam Kumar, [Kerala Kaumudi](/wiki/Kerala_Kaumudi), [Kannur](/wiki/Kannur) Unit ChiefPE Social Excellence AwardJayadev UnnithanPE Youth Choice AwardParvathy NambiarPE Yuva Pravasi AwardShaji Philip #### Special Categories Pravasi Express Awards were also presented to Jayakumar Aravindakshan (retail business), Sreenivas Kurupp (IT Business), Ashok Nair (Sports Excellence) and Gangadharan Kunnon (Community engagement) for work in their respective fields. ### 2014 Awards The awards were presented by [Ambassador-at-Large](/wiki/Ambassador-at-Large) Gopinatha Pillai, Actress [Priyamani](/wiki/Priyamani), [All Malaysia Malayalee Association](/wiki/All_Malaysia_Malayalee_Association) president Ravindran Menon and other famous personalities from [India](/wiki/India) and [Singapore](/wiki/Singapore). The award categories are as follows: PE Lifetime Achievement Award[P. Jayachandran](/wiki/P._Jayachandran), singerPE Malayalee Ratna AwardTan Sri Datuk Ravindran Menon, [Malaysia](/wiki/Malaysia)PE Literary AwardM.K Bhasi, Malayalam poet and writer, [Singapore](/wiki/Singapore)PE Youth Icon of the Year[Priyamani](/wiki/Priyamani), National Award winner ActressPE Vanitha Ratna AwardLatha K Namboodiri, Krystal Group, [Bangalore](/wiki/Bangalore)PE Business Excellence AwardAlexander Vadakkedam, [India](/wiki/India)PE Young Entrepreneur AwardReju Kumar, [Singapore](/wiki/Singapore)PE Young Achiever AwardVarun Chandran, Corporate360, [Singapore](/wiki/Singapore). #### Special Categories [Pravasi Express](/wiki/Pravasi_Express) – Rising Star Award was given to outstanding Malayalee youngster in social, arts, sports or academics category. This award was given to Miss. Anjali George for her performance in contemporary art and creative paintings. #### Editorial Excellence Awards The winners of [Pravasi Express](/wiki/Pravasi_Express) – Editorial Excellence Awards 2014 are as follows: PE Journalist of the yearBasil BabyPE Photojournalist of the yearLijesh KarunakaranPE Special AwardMs.Chitra KrishnaKumar, Krishna Lal PV, Panayam Liju, MKV Rajesh and Venmony Bimalraj ### 2013 Awards The awards were presented by [Ambassador-at-Large](/wiki/Ambassador-at-Large) Gopinatha Pillai, lyrist [Anil Panachooran](/wiki/Anil_Panachooran), actor [Unni Mukundan](/wiki/Unni_Mukundan) and many other famous personalities in [Singapore](/wiki/Singapore). The award categories is as follows: PE Lifetime Achievement Award[V. S. Achuthanandan](/wiki/V._S._Achuthanandan), former Chief Minister of KeralaPE Literary Award[Anil Panachooran](/wiki/Anil_Panachooran), Malayalam film lyricist and poetPE Youth Icon of the Year[Unni Mukundan](/wiki/Unni_Mukundan), film actorPE Social Excellence AwardP. K. Koshy, President Singapore Malayalee AssociationPE Business Excellence AwardTony Vincent, Aratt Developers, [Bangalore](/wiki/Bangalore), [India](/wiki/India)PE Young Entrepreneur AwardAjith Kumar T, Singapore Coliseum, [Singapore](/wiki/Singapore)PE Yuva Pravasi AwardSyam Kumar Prabhakaran, Malayalam Educational Society, [Singapore](/wiki/Singapore) #### Special Categories The award ceremony also witnessed the honoring of two eminent Malayalees in [Singapore](/wiki/Singapore). Shekhari Varma, Maharaja of Palaghat and was a freedom fighter for [Indian Independence](/wiki/Indian_independence_movement). Dominic Puthucheary, founding member of the [People Action Party](/wiki/People_Action_Party) in [Singapore](/wiki/Singapore) and Malayalee who participated in shaping of Singapore. Pravasi Express – Rising Star Award was given to outstanding Malayalee youngster in social, sports or academics category. This award was given to Vishal Thaniyath, U-16 Football Player in [Singapore](/wiki/Singapore) [S.League](/wiki/S.League). #### Editorial Excellence Awards [Pravasi Express](/wiki/Pravasi_Express) – Editorial Excellence Awards was introduced to recognize individuals on their contributions in different news arena and the winners were as follows PE Journalist of the yearBasil BabyPE Newspaper Feature Writer of the yearPanayam LijuPE Photojournalist of the yearNivesh ThekkarathPE Special AwardA.R Jose and Mr. Subu IyerEditorial contributionsMs Chitra Krishna Kumar and Ms Suchitthra Vasu - www.pravasiexpress.com - PravasiExpress Channel - Hosting Support : colorvibes - www.pravasiexpress.in\n",
  "language": "en",
  "processed_at": "2026-01-12T11:44:29.235187",
  "title": "Pravasi Express Awards",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Pravasi_Express_Awards"
}