{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:44:33.205944"
  },
  "content": "Early childhood education in Singapore A **preschool**, also known as a **kindergarten** or **child care centre** in [Singapore](/wiki/Singapore), is an [educational establishment](/wiki/School) or [learning space](/wiki/Learning_space) offering [early childhood education](/wiki/Early_childhood_education) to [children](/wiki/Child) before they begin [compulsory education](/wiki/Compulsory_education) at [primary school](/wiki/Primary_school). All Singapore citizens born after 1 January 1996 and living in Singapore must attend a national primary school unless an exemption is granted. A preschool may be publicly or privately operated and may be subsidized by public funds, such as The Baby Bonus Fund. ## Regulated by ECDA All Preschools in Singapore are required to obtain license under the Early Childhood Development Centres Act 2017. The [Early Childhood Development Agency](/wiki/Early_Childhood_Development_Agency) (ECDA), an autonomous agency jointly overseen by the Ministry of Education (MOE) and the Ministry of Social and Family Development (MSF), and hosted under the Ministry of Social and Family Development, serves as the regulatory and developmental authority for the early childhood sector in Singapore, overseeing key aspects of children's development below the age of 7, across both kindergartens and child care centres. ## Preschool Subsidies If a Child Care Centre is licensed by ECDA, or Kindergarten that is registered with ECDA/Committee for Private Education (CPE), it is considered as an Approved Institution (AI) under the Baby Bonus Scheme. List of AI can be found on Singapore government website. Singaporean with Child Development Account (CDA) set up will be able to use the First Step grant ($3,000) to pay for educational and healthcare expenses of all their children immediately. ### Basic Subsidy If a child is a Singapore Citizen and is enrolled in an ECDA-licensed infant care/ child care centre in Singapore, he/she qualifies for Basic Subsidy. If the mother is a working mum (working at least 56 hours per month), the amount is S$600 (Infant Care) and S$300 (Child Care). If the mother is not working (working less than 56 hours per month), the amount is S$150 (Infant Care) and S$150 (Child Care). ### Additional Subsidy In addition to Basic Subsidy, a working mum with Singaporean child enrolled in ECDA-licensed centres will qualify for up to S$440 Additional Subsidy, if their total gross monthly income (including bonuses, commissions, overtime pay, allowances and before CPF deduction) earned by mum and her spouse is less than S$7,500 per month. The income of family members included in the application will also be factored into the total gross monthly income if applying through Per Capita Income. At the National Day Rally on Sunday (18 August 2019), Prime Minister Lee Hsien Loong said that the authorities would raise the income ceiling from S$7,500 to S$12,000 for families seeking to qualify for more preschool subsidies in year 2020. ## Full-Fledged Preschool Professional Preschool teachers in Singapore need to equip themselves with relevant certification from the National Institute of Early Childhood Development (NIEC) or WSQ certification in order to qualify as a full-fledged preschool professional. ## Types of Childcare Centres There are 3 types of childcare centres in Singapore: Premium, Anchor Operators and Partner Operators. ### Premium Operators Premium operators are private-run childcare centres. These childcare centres do not receive government funding, thus they tend to have more expensive school fees of about $1,000 to $2,000 a month. Typically, premium childcare centres have their own curriculum and pedagogy. Some examples include KiddiWinkie Schoolhouse, Mindchamps, White Lodge, EtonHouse and Primus Schoolhouse. Small Wonder Preschool, one of the premium childcare centres in Singapore, offers fees ranging between S$38 and S$1,595 per month, depending on the programme and age group. The preschool provides a proprietary curriculum designed to foster holistic child development. Like other premium operators, Small Wonder does not receive government funding, which explains its higher fee structure. ### Anchor Operators Anchor operators are private-run childcare centres. This makes them similar to premium childcare centres. The main difference is that anchor operators receive funding support from government to keep its monthly fees at a cap of $720, $1,275 and $160 (excluding GST) for full-day child care, full-day infant care and kindergarten respectively. They are funded by the Anchor Operator Scheme (AOP). In 2014, five AOPs were selected and received funding support till 2018, which was then extended to 2022. In 2023, Ministry of Social and Family Development announced that the scheme will be extended to more operators, with more details to be announced in Q2 2023. Since January 2023, children from lower-income families are prioritised for enrolment into AOPs. This applies to children from families with a gross monthly household income of up to S$6,000. In addition, children from families with a gross monthly household income of up to S$3,000 will be given higher priority. In 2023, there are about 600 AOP preschool centres. ### Partner Operators Partner operators function in the same manner as anchor operators. For partner operators, they receive funding under The Partner Operator Scheme (POP). To qualify for the POP scheme, childcare centres must have a minimum size of 300 child care places. This is to encourage economies of scale and career progression for teachers. Partner Operators monthly cap is of $800 and $1,400 (excluding GST) for full-day child care and infant care programme respectively, $600 and $1,000 for half-day child care and infant care programme respectively for Singapore Citizen children. They receive funding support from Year 2016 – 2020. As of 2020, there are 22 partner operators in Singapore. The full list of POPs can be found on ECDA website. ## Child Care/Day Care Centres Childcare (also known as daycare) centres provide child care services and preschool developmental programmes for children aged from 18 months to children below 7 years old. Several centres also provide infant care programmes for infants aged from 2 to 18 months old. Childcare centres provide full-day and half-day care programmes to children below the age of seven, in addition to education programmes. ## Kindergartens Kindergartens provide preschool developmental programmes for children aged about 2 years to children below 7 years of age. The programmes comprise at least Kindergarten 1 and Kindergarten 2. In addition, kindergartens may also provide programmes for Playgroup, Pre-Nursery (or Nursery 1), and Nursery (or Nursery 2) five days a week. Most kindergarten sessions range between 2 and 3 hours for Playgroup and Pre-Nursery, and between 3 and 4 hours for Nursery and Kindergartens 1 & 2. ### MOE Kindergarten There are currently 50 MOE Kindergaretens across Singapore, with a total of 60 more kindergartens to be opened by 2027. Top priority for admissions go to Singaporean children from lower-income households living within 1 km of the MOE kindergarten. - Singapore portal - Education portal - [Education in Singapore](/wiki/Education_in_Singapore) - [List of international schools in Singapore](/wiki/List_of_international_schools_in_Singapore) ## Notes and references\n",
  "language": "en",
  "processed_at": "2026-01-12T11:44:33.205647",
  "title": "Preschool in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Preschool_in_Singapore"
}