{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:44:37.788047"
  },
  "content": "National examination in Singapore The **Primary School Leaving Examination** (**PSLE**; [Malay](/wiki/Malay_language): *Peperiksaan Tamat Sekolah Rendah*; [Chinese](/wiki/Simplified_Chinese_characters): 小六会考; [pinyin](/wiki/Pinyin): *xiǎolìu huìkǎo*; [Tamil](/wiki/Tamil_language): தொடக்கப்பள்ளி இறுதியாண்டுத் தேர்வு, romanized: *Toṭakkappaḷḷi Iṟutiyāṇṭut Tērvu*) is a national examination in [Singapore](/wiki/Singapore) that is administered by the [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)) and taken by all students near the end of their sixth year in primary school before they move on to secondary school. The examination test students' proficiency in the English language, their respective mother tongue languages (typically Chinese, Malay or Tamil), and a higher mother tongue (HMTL) , should the student be taking it, as well as mathematics and science. The paper is split into 2 parts, paper 1 and 2. Paper 1 typically lasts under a half hour, and is an essay for languages, or, in the case of math and science, is slightly easier than paper 2. Paper 1, for math and science, will include a standardized [optical answer sheet](/wiki/Optical_answer_sheet) (OAS) that uses [optical mark recognition](/wiki/Optical_mark_recognition) to detect answers. The languages will provide an answer booklet for the essay. Paper 2 will consist of comprehension and the understanding of the subject. The paper typically lasts under 2 hours. Students will NOT answer on the question booklet itself for certain sections of the paper. The question booklet is for workings and annotations. Answers will be written in the Answer booklet, or the OAS. [*citation needed*] The format of the PSLE and the presence of it in the Singapore education system gives it a part in national culture. PSLE material has also been exported to other countries. Some schools abroad (such as National High Jakarta School in [Jakarta](/wiki/Jakarta), [Indonesia](/wiki/Indonesia)), particularly in [Southeast Asia](/wiki/Southeast_Asia), [India](/wiki/India) and [China](/wiki/China), have their pupils sit the international version of the exam, the iPSLE, to provide a benchmark of their performance, compared to Singapore's standards. In March 2018, calls for the removal of the PSLE was rejected in [parliament](/wiki/Parliament_of_Singapore) by then [Education Minister (Schools)](/wiki/Ministry_of_Education_(Singapore)) [Ng Chee Meng](/wiki/Ng_Chee_Meng), who cited it as a \"useful checkpoint\" in a child's education journey. On 28 September 2018, Education Minister [Ong Ye Kung](/wiki/Ong_Ye_Kung) reiterated his stance on keeping the PSLE while announcing that the ministry will remove several mid-year and year-end exams across the board from primary one up to secondary four with the aim of reducing assessments based on exam results and to encourage students to be \"all-rounders\". ## History and past performance The Primary School Leaving Examination (PSLE) was modeled after the British [eleven plus exam](/wiki/Eleven_plus_exam) (11+) and was first conducted in 1960. Its predecessor was the Secondary School Entrance Examination (SSEE), which was conceived in 1952 when it was known as the Standard Six Entrance Examination up to 1954 and then as Secondary School Entrance Examination when the primary school classes were no longer named as Primary 1 and 2 and the standard 1 to 5 and started from Primary 1 to 6 instead. Promotion was to Form 2 in the secondary school instead of the previous Standard Six starting from January 1955, during the early days of self-government. Though complaints were made about the 2007 PSLE Papers being out of syllabus and too challenging, this continued in the 2008 PSLE Paper. ### Performance In 2005, 51,077 pupils sat for the examination, a 0.4% increase from the previous year. The majority (or roughly 97.8%) of the pupils qualified for secondary school. 62.2% of those who passed were eligible for the Special (Integrated Programme or The International Baccalaureate) or the Express stream (Either one for 4 years only) and the remaining 35.6% were eligible for either the Normal (Academic) or Normal (Technical) courses (Either one for 4 years). 1163 pupils (2.3%) of the cohort assessed were not ready for secondary school in 2006 or were more suited for [vocational training](/wiki/Vocational_training). 39,286 students sat for the PSLE in 2015. The Ministry of Education (MOE) said that a total of 38,610 students (98.3 %) were eligible for secondary school. 66.2 % of the pupils qualified for the Express stream, 21.7 % for Normal (Academic), and 10.4 % qualified for Normal (Technical). The remaining 1.7% did not qualify for the three streams and were offered choices to retake the examination or to move on to specialised vocational schools. ### Controversy on flaws in papers The 2005 mathematics paper for EM1 and EM2 (equivalent to today’s standard stream) students was flawed due to a question having no definite method of working the answer out. The \"Question 13\" was spotted by many and became infamous. The question was mathematically inconsistent in that one will get one set of answers when worked out one way and another set of answers when worked out by a different method. The [Singapore Examinations and Assessment Board](/wiki/Singapore_Examinations_and_Assessment_Board) (SEAB) acknowledged the mistake a few days after the examination, annulling the question and awarding 2 marks to every student for the question. ### Controversy on withholding of result slips In 2019, public debate arose concerning the practice of withholding PSLE result slips from students for failing to pay school fees. This ensued after news claiming that a student was withheld her PSLE result slip, due to being unable to pay school fees, circulated widely on social media. Subsequently, then Education Minister Ong Ye Kung asked for the Ministry of Education to re-evaluate the practice of withholding PSLE result slips from students due to unpaid school fees. ## Other methods of admission to secondary schools ### Direct School Admission [Independent schools](/wiki/List_of_schools_in_Singapore#Independent_schools) and [autonomous schools](/wiki/List_of_schools_in_Singapore#Autonomous_schools) can admit up to 20% and 10% of their students via the Direct School Admission scheme (DSA) respectively. Students apply through exercises conducted by the schools around July and August, receiving notice of the results shortly after. Schools offering the [Integrated Programme](/wiki/Integrated_Programme) (IP) can take in as many students as they want via DSA. Other schools have also been granted permission by the Ministry of Education to take in students specialising in the schools' niche areas up to a maximum of 5% of their total student intake. ### NUS High School The NUS High School of Mathematics and Science opened in 2005 with an intake of 225 Secondary 1 and 3 students, offering a six-year programme leading to the NUS High Diploma. Students will also sit for [Advanced Placement](/wiki/Advanced_Placement) (AP) and [Scholastic Assessment Test](/wiki/Scholastic_Assessment_Test) (SAT) examinations in the senior years for benchmarks for admission into foreign universities. The school offers an accelerated mathematics and science curriculum based on a modular system, also offering languages, humanities, arts, and other elective subjects integrated into its modular system. Students are admitted based on several factors, performance in an application form, interviews, tests, and an admission camp. ### School of Science and Technology, Singapore The School of Science and Technology (SST) is located at Technology Drive, which is about five minutes walk from [Dover MRT station](/wiki/Dover_MRT_station). There is also a bus stop outside the school campus. - Geylang Methodist Primary School *Revised PSLE format for English language* – July 2005, URL accessed 24 November 2005. - Our Story *Educating a nation* – 1998, 2accessed 24 November 2005. - PSLE Results Survey Report, https://web.archive.org/web/20191115194233/http://educationcube.com/psle-results-survey-report Library resources about **Primary School Leaving Examination** - Resources in your library - Resources in other libraries - Primary School Leaving Examination on the SEAB website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:44:37.787744",
  "title": "Primary School Leaving Examination",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Primary_School_Leaving_Examination"
}