{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:44:36.166150"
  },
  "content": "Singaporean food and beverage brand **Prima Taste** ([Chinese](/wiki/Simplified_Chinese_characters): 百胜厨; [pinyin](/wiki/Pinyin): *Bǎishèngchú*; lit. 'hundred victory kitchen'), is a [Singaporean](/wiki/Singaporean) [food](/wiki/Food) and [beverage](/wiki/Beverage) brand managed by Prima Food Pte Ltd, a wholly owned subsidiary of Prima Limited. The brand was designed for Singaporean [expatriates](/wiki/Expatriates) living abroad. Its [Laksa](/wiki/Laksa) sauce kits were recommended by Singaporean chef, [Janice Wong](/wiki/Janice_Wong), as foodie souvenirs to take home during the [2018 North Korea–United States summit](/wiki/2018_North_Korea%E2%80%93United_States_summit). ## History Prima Taste launched in 1998, and is managed by Prima Food Pte Ltd, a subsidiary of Prima Limited which specializes in [flour milling](/wiki/Flour_milling). The brand is available internationally in over 40 countries. ## Products In 2011, Prima Taste launched its Singapore [Laksa](/wiki/Laksa) LaMian, a premium [instant noodle](/wiki/Instant_noodle) product. In 2013, Prima Taste [Laksa](/wiki/Laksa) LaMian and Prima Taste [Curry](/wiki/Curry) LaMian were rated No. 1 and No. 2 [instant noodles](/wiki/Instant_noodles) of all time by The Ramen Rater. Prima Taste's Wholegrain Laksa LaMian was ranked best instant noodles by The Ramen Rater from 2016 to 2018. Prima Taste also launched new [Wholegrain](/wiki/Wholegrain) LaMian flavours such as Prawn Soup [Wholegrain](/wiki/Wholegrain) LaMian. In 2015, Prima Taste launched its Ready Meals. Ready Meals feature rice-and-protein dishes that are sealed in reheatable pouches. In 2017, Talking Point tested three vending machine meals for \"salt, fat and MSG\" as the Health Promotion Board (HPB) \"advises against having too much of\". Prima Taste claims to have no added MSG. While Prima does not add MSG \"it might be naturally present in some of the ingredients used\". Charlotte Ng, head chef of Mamak Malaysian Cafe in [Auckland](/wiki/Auckland), [New Zealand](/wiki/New_Zealand) recommends using Prima Taste instant noodles to get a similar taste to authentic [ramen](/wiki/Ramen). ## Restaurants A Prima Taste concept restaurant was established in Orchard Centrepoint in 2000, serving Prima Taste dishes. By 2003, two more restaurants opened at One Fullerton and The Atrium Orchard. A restaurant at [Changi Airport Terminal 3](/wiki/Changi_Airport_Terminal_3) was operational between 2011 and January 2014. Eight overseas Prima Taste restaurant franchises were opened between 2003 and 2005, including in Jakarta, Indonesia and a flagship in Shanghai, China. A number of overseas restaurants have been closed and the concept restaurants are no longer mentioned on the Prima Taste corporate website. - [List of instant noodle brands](/wiki/List_of_instant_noodle_brands) - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:44:36.165644",
  "title": "Prima Taste",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Prima_Taste"
}