{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:44:40.091073"
  },
  "content": "Supermarket chain in SingaporeThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Prime Supermarket\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(September 2018)* *(Learn how and when to remove this message)* **Prime Supermarket** ([Chinese](/wiki/Simplified_Chinese_Characters):百美超级市场 Bǎi Měi Chāojí Shìchǎng) is a family owned [supermarket chain](/wiki/Supermarket_chain) in [Singapore](/wiki/Singapore). It is under the parent company Prime Group International, which has overseas ventures in the agriculture and hospitality industry. There are currently 25 outlets island-wide that are generally found within the neighbourhood [housing estates](/wiki/Public_housing_in_Singapore), some of which are open 24 hours a day. ## History Prime Supermarket was established in 1984 by Mr Tan Hong Khoon, after his fathers' pig farming business which was inherited from the elder Mr Tan's father, was forced by the government to shut down due to redevelopment plans in the [Punggol](/wiki/Punggol) area. The first grocery store was thus established as an alternative business venture in King George's Avenue. In the following years, the business was then grown and expanded into the supermarket chain that is as seen today, with their own house-brand products being sold too. Prime Group International was also subsequently established for local and overseas ventures, of which in 2016, the Mahota Commune houses were established, which is a mixed retail business that included a supermarket as well. In a nod to the healthy lifestyle that the government has been actively trying to promote, the supermarket has also ensured the overall wellness of its staff by encouraging and promoting healthy living. The original supermarket in King George's Avenue also continues to stand till this day. ## Discount schemes Members of the supermarket membership programme are able to enjoy discounts via \"Fresh points\" that they have earned while shopping with the supermarket. This scheme allows for a reduction of S$1 to be made for every 100 \"Fresh points\" earned, of which 1 \"Fresh point\" is earned for every dollar spent for a minimum of S$10 spent. Membership can be obtained for free from the supermarket by purchasing S$20 worth of products, while the annual membership is renewable for free. There is also a further discount of 3% for senior citizens (aged 60 and above), every Monday and Friday of the week, on most items in the supermarket. ## Online ventures The supermarket has also tapped onto online platforms to grow its business. An [online shopping portal](/wiki/Online_grocer) has been launched with features allowing customers to collect from the physical store after purchasing online for no additional charges if they did not opt for delivery. Additionally, the supermarket has also reached onto social media platforms like [Facebook](/wiki/Facebook) to engage and inform customers about ongoing discounts and sales in the supermarket. - [List of supermarket chains in Singapore](/wiki/List_of_supermarket_chains_in_Asia#Singapore)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:44:40.090610",
  "title": "Prime Supermarket",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Prime_Supermarket"
}