{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:44:42.020938"
  },
  "content": "Building in Queenstown, Singapore 1°16′14.99″N 103°48′33.04″E﻿ / ﻿1.2708306°N 103.8091778°E﻿ / 1.2708306; 103.8091778 The **Princess House** is a building on Alexandra Road in [Queenstown](/wiki/Queenstown,_Singapore), Singapore. The building was initially used as the offices for the [Singapore Improvement Trust](/wiki/Singapore_Improvement_Trust), and later became the first dedicated headquarters of the trust's successor, the [Housing and Development Board](/wiki/Housing_and_Development_Board). ## Description The Princess House is seven storeys tall. The building has a simple design. The articulation of the building's elements follows the [form follows function](/wiki/Form_follows_function) dictum. The roof of the building is \"U-shaped\" and also functions as a viewing deck. ## History The building was built in 1957 as a multi-purpose office building, containing the new offices of the Singapore Improvement Trust, with the offices of the Social Welfare and Licensing departments being housed in the west wing of the building and offices in the east wing of the building to be rented out to the public. The successor of the Singapore Improvement Trust, the Housing and Development Board, moved their main offices from Upper Pickering Street to the Princess House, making the building the first dedicated headquarters of the board. Several departments of the [Ministry of Health](/wiki/Ministry_of_Health_(Singapore)) moved their offices into the building in September 1971. The then newly created [Ministry of Environment](/wiki/Ministry_of_Sustainability_and_the_Environment) moved its offices into the Princess House in September 1972. The Ministry of Environment moved to the Environment Building on [Scotts Road](/wiki/Scotts_Road) in September 1986. By March 1988, the building was still vacant, despite other statutory boards and governments being informed that the building was available, and a tender being put out to the private sector for a short-term tenancy. The Princess House has been visited by [Prince Philip](/wiki/Prince_Philip,_Duke_of_Edinburgh) and [Princess Margaret](/wiki/Princess_Margaret,_Countess_of_Snowdon). The building was also visited by [Putra of Perlis](/wiki/Putra_of_Perlis) during his three-day tour of Singapore in November 1963. The building was gazetted for conservation in 2007 by the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority). The [National Heritage Board](/wiki/National_Heritage_Board_(Singapore)) has placed the building on the [My Queenstown Heritage Trail](/wiki/My_Queenstown_Heritage_Trail) as the fourth landmark on the trail.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:44:42.020644",
  "title": "Princess House",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Princess_House"
}