{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:44:46.979952"
  },
  "content": "Singaporean model **Priyanka Annuncia** (born 7 April 1997) is a [Singaporean](/wiki/Singaporeans) model and beauty pageant titleholder who was crowned [Miss Universe Singapore 2023](/wiki/Miss_Universe_Singapore) at the Amber Lounge during the [Singapore Grand Prix Weekend](/wiki/Singapore_Grand_Prix) on September 16, 2023. She has worked as an entrepreneur and personal trainer since 2017 and has been an investigator since 2020. She holds a degree in law and criminology from [Murdoch University](/wiki/Murdoch_University). Priyanka represented Singapore at the 72nd Miss Universe competition that was held in [El Salvador](/wiki/El_Salvador) on November 18, 2023. ## Background ### Early life Priyanka was born on 7 April 1997, in [Singapore](/wiki/Singapore). In an interview with *[The Straits Times](/wiki/The_Straits_Times)*, she revealed that she has been an investigator for three years which led her to hone her skills. Thus, being able to lend resources to the team in Thailand, assisting them in investigations, rescue and reintegration programmes for victims and survivors. Earlier in 2023, in July, she visited a shelter for trafficking victims in Thailand. During the visit, she was inspired by their resilience, and “reflected on the importance of advocating for better legislation and policies to protect and support trafficking victims”. In an Instagram post she wrote: > I have now ventured into making a difference in the legal justice system specifically in the field of human trafficking. Thailand has been a hot spot for trafficking crimes and, till this day, it still happens to a great extent. With my background in private investigations, I've honed my skills for three years and now lead investigations, rescue missions and reintegration programmes for victims. She added: > When I'm not fighting crime or coaching, you will find me running my clothing line that I started four years ago. I believe that making a difference is not a cliche, but a manifestation of a belief system. She is also working with Alliance Anti-Traffic (AAT), a non-profit organization that aims to protect women and children in the region from sexual exploitation in addition to trafficking. In 2019, she started a body-positive unisex clothing line, Bodsitive. The brand includes a wide range of sizes and stocks innerwear and swimwear too. From January 2019 to August 2019, she worked at CruBox in Singapore as a boxing instructor. In August 2019, she joined Stariffic in Singapore as a public speaking coach. ### Education Annuncia graduated from [Murdoch University](/wiki/Murdoch_University) in business law and [criminology](/wiki/Criminology). ## Pageantry ### Miss Universe Singapore 2023 On September 16, 2023, Priyanka competed against six other Miss Universe Singapore 2023 finalists at Amber Lounge at [Millenia Tower](/wiki/Millenia_Tower) in [Marina Centre](/wiki/Marina_Centre), [Downtown Core](/wiki/Downtown_Core), Singapore during the [2023 Singapore Grand Prix](/wiki/2023_Singapore_Grand_Prix) weekend and won the title. Annuncia is the first beauty queen to represent Singapore in both Miss Supranational and Miss Universe. She represented Singapore at the 72nd Miss Universe competition held in [El Salvador](/wiki/El_Salvador) on November 18, 2023. ### Miss Singapore Supranational 2018 On July 29, 2018, she competed against six other Miss Singapore International 2018 candidates at the Grand Copthorne Waterfront Hotel in [Tiong Bahru](/wiki/Tiong_Bahru), Bukit Merah, Singapore. She ranked second and was crowned Miss Singapore Supranational 2018. On September 7, 2018, she represented Singapore at [Miss Supranational 2018](/wiki/Miss_Supranational_2018) at the Hala Miejskiego Ośrodka Sportu i Rekreacji (MOSiR) Arena in Krynica-Zdrój, [Poland](/wiki/Poland) and competed against 71 other candidates. She was unplaced but she won the Miss Congeniality award. ### Miss Congeniality Prior to her participation in Miss Universe Singapore, Priyanka also took part in [Miss Supranational](/wiki/Miss_Supranational) 2018. During the international beauty pageant, she was crowned Miss Congeniality, and won four other categories in the local competition, such as Miss Photogenic, Miss Popularity, Miss Personality, and Miss Crowning Glory. Since it was her first time entering a beauty pageant, she was impressed by the scale of the competition, and loved the fact that she had the opportunity to fly to Poland for this life-changing experience. On October 17, 2022, she competed against nine other Miss Universe Singapore 2022 candidates at the Alcove at Caldwell House at the Convent of the Holy Infant Jesus Middle Education School (CHIJMES) in the Downtown Core in Singapore where she was unplaced. - Priyanka Annuncia at [IMDb](/wiki/IMDb_(identifier)) Awards and achievementsPreceded byCarissa Yap **[Miss Universe Singapore](/wiki/Miss_Universe_Singapore)** 2023Succeeded byCharlotte Chia\n",
  "language": "en",
  "processed_at": "2026-01-12T11:44:46.979680",
  "title": "Priyanka Annuncia",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Priyanka_Annuncia"
}