{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:44:48.642176"
  },
  "content": "Hybrid computer- and MIDI-keyboard for personal computers in the 2000s **Prodikeys** is a [music](/wiki/Musical_keyboard) and [computer keyboard](/wiki/Computer_keyboard). It was created by [Singaporean](/wiki/Singapore) audio company [Creative Technology](/wiki/Creative_Technology). So far, three different versions of Prodikeys have been launched: Creative Prodikeys, Creative Prodikeys DM and Creative Prodikeys PC-MIDI. The products are [computer keyboards](/wiki/Computer_keyboard), extended by 37 mini-sized [MIDI keyboard](/wiki/MIDI_keyboard) at the bottom. The MIDI keyboard is placed under a detachable palm cover. Prodikeys can also be used as a [MIDI controller](/wiki/MIDI_controller) for third-party MIDI software. It supports [Windows XP](/wiki/Windows_XP), [Windows 2000](/wiki/Windows_2000) and [Linux](/wiki/Linux), but is incompatible with newer versions of [Windows](/wiki/Microsoft_Windows) or [Mac OS](/wiki/MacOS). Prodikeys gained popularity on the Internet after one of its product demonstration videos went viral after its release in 2003; in it, Paul Seow shows the keyboard's keys functioning as [drum pads](/wiki/Drum_pad) by playing a simple [rock beat](/wiki/Rock_beat), but eventually culminating in an unexpected [drum solo](/wiki/Drum_solo). ## Prodikeys Software The products are shipped with an additional software. It includes the following features: - **EasyNotes** is a software to learn to play melodies on the keyboard. It comes with an included song library which can be extended with MIDI files by the user. EasyNotes supports music format in SEQ and MIDI. - **FunMix** can create and record own music with pre-arranged mixes. - **HotKeys Manager** is a tool to customize the keyboard's hotkeys functions to change access to the software suite. - **Mini Keyboard** is a keyboard software with a sound library of more than 100 instrument sounds like piano, flute, guitar and drums. - **Prodikeys Launcher** is a Launcher for the software suite. It also has an interactive tutorial. ## Prodikeys DM The **Prodikeys DM** has one single [mini-DIN connector](/wiki/Mini-DIN_connector) for the [PS/2 port](/wiki/PS/2_port) and is therefore detected as a regular typing keyboard. The included Windows software communicates with the keyboard driver in order to send and receive MIDI data over the PS/2 line. This protocol has been partly reverse-engineered, making it possible to use the Prodikeys DM on a regular USB port using an [Arduino](/wiki/Arduino) microcontroller as an adaptor. This [computer hardware](/wiki/Computer_hardware) article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:44:48.641838",
  "title": "Prodikeys",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Prodikeys"
}