{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:44:54.430239"
  },
  "content": "Singaporean political party The **Progress Singapore Party** ([abbreviation](/wiki/Abbreviation): **PSP**) is a [political party](/wiki/List_of_political_parties_in_Singapore) in Singapore. It was one of the three political parties represented in the [14th Parliament](/wiki/14th_Parliament_of_Singapore), alongside the governing [People's Action Party](/wiki/People%27s_Action_Party) (PAP) and the fellow opposition [Workers' Party](/wiki/Workers%27_Party_of_Singapore) (WP); [Leong Mun Wai](/wiki/Leong_Mun_Wai) and [Hazel Poa](/wiki/Hazel_Poa) represented it as [non-constituency Members of Parliament](/wiki/Non-constituency_Members_of_Parliament) (NCMPs). The PSP was founded in 2019 by 11 members, including former PAP politician [Tan Cheng Bock](/wiki/Tan_Cheng_Bock), allegedly to address PAP leadership decisions; [Lee Hsien Yang](/wiki/Lee_Hsien_Yang), the estranged brother of then-[Prime Minister](/wiki/Prime_Minister_of_Singapore) [Lee Hsien Loong](/wiki/Lee_Hsien_Loong), supported it. It held multiple talks and walkabouts throughout 2019, ahead of the [2020 general election](/wiki/2020_Singaporean_general_election), where it contested in nine constituencies. While defeated in all nine constituencies, the party became eligible for two NCMP seats, which Leong and Poa accepted. The two had been part of the PSP team for [West Coast Group Representation Constituency](/wiki/West_Coast_Group_Representation_Constituency) (GRC), which garnered 48.32% of the vote. In the [2025 general election](/wiki/2025_Singaporean_general_election), the PSP contested in six constituencies and faced a significant decline in support. It garnered 4.88% of the nationwide popular vote, and was not offered NCMP seats. ## History ### Founding This section **contains an excessive amount of intricate detail that may only interest a particular audience**. Please help by removing excessive detail that may be against Wikipedia's inclusion policy. *(October 2025)* *(Learn how and when to remove this message)* The PSP was founded in 2019 by [Tan Cheng Bock](/wiki/Tan_Cheng_Bock) and 11 other members. They, together with [Lee Hsien Yang](/wiki/Lee_Hsien_Yang), the estranged brother of then-[Prime Minister](/wiki/Prime_Minister_of_Singapore) [Lee Hsien Loong](/wiki/Lee_Hsien_Loong), expressed that the existing PAP leadership had \"lost its way\" and deviated from the party's founding principles. The party was officially registered on 28 March 2019 with 12 members after being approved by the Registry of Societies. Tan said that the registration was the result of an erosion of governmental transparency, independence and accountability. Job creation was also cited as a main focus. ### 2020 general election On 29 September 2019, Tan led about 300 party members and volunteers during the PSP's first official island-wide walkabout. The walkabout, named \"29 on 29\", was conducted in 29 [constituencies](/wiki/Constituencies_of_Singapore). In October 2019, the party called for volunteer polling and counting agents. On 4 November, the PSP called for an opposition alliance meeting, privately attended by representatives from seven opposition political parties. According to Tan, the meeting was to discuss future plans and to introduce members of different parties to one another. On 9 November, the party began its second island-wide walkabout, involving about 220 members and volunteers. On 12 January 2020, the party held its second series of door-to-door house visits in [West Coast GRC](/wiki/West_Coast_GRC), led by Tan and joined by more than 200 members and volunteers. The event involved 22 teams and covered 50 residential blocks. A walkabout of about 40 members had been conducted in 2019 within the same [constituency](/wiki/Constituencies_of_Singapore). On 17 January, a reshuffling of leadership was announced at the PSP's new year party. Two members of the central executive commmittee (CEC) exited, replaced by five new members. On 27 January, the PSP officially opened its new headquarters at [Bukit Timah Shopping Centre](/wiki/Bukit_Timah_Shopping_Centre). On 10 July 2020, despite posing strong challenges in among the nine constituencies and fielding the largest slate of candidates this election with 24, none of the contested seats ended up victorious; however, the seat that the party came closest to winning was [West Coast GRC](/wiki/West_Coast_GRC) where Tan lead the team, being defeated by the ruling [People's Action Party](/wiki/People%27s_Action_Party) team led by [S. Iswaran](/wiki/S_Iswaran) in a 51.69%-48.31% of the votes. Due to being the best result among non-elect candidates and 10 opposition politicians having successfully been elected, they were entitled two seats, from the West Coast GRC team, for the [Non-constituency Member of Parliament](/wiki/Non-constituency_Member_of_Parliament) to fulfil the 12-opposition minimum (WP had won 10 seats). Their vote share was higher than the national average (38.76%), having garnered 40.86% of the votes based on the contested constituencies, and 10.18% based on the overall popular vote cast. Prior to the results, Tan earlier revealed that he will decline taking up the NCMP position calling it as a 'ploy', but allows decision to be made by the other team members. On 14 July, PSP revealed [Hazel Poa](/wiki/Hazel_Poa) and [Leong Mun Wai](/wiki/Leong_Mun_Wai) as the two members who would be taking up the NCMP seats. ### 2020–2025: First Representation in Parliament of Singapore with NCMPs After the elections, Poa and Leong stepped down as office bearers to focus on their NCMP duties. Both remained as CEC members and are involved in the party's activities. [Francis Yuen](/wiki/Francis_Yuen) took over as assistant general-secretary, while the vice-chairman post remained vacant. Since then, PSP has formed its women's wing and youth wing to create more targeted policies helping these groups, headed by Tanjong Pagar GRC candidates Wendy Low and Terence Soon respectively. In addition, a Parliamentary Secretariat was formed to help the NCMPs with policy research for their duties, which is headed by both Leong and Poa. The women's wing was officially launched on 30 January 2021. The PSP's CEC underwent a leadership renewal in March 2021; 11 CEC members stepped down and six new CEC members were elected. On 1 April, PSP announced that Yuen has taken over as the secretary-general of the party, with Tan being the chairperson. Wang Swee Chuang hence became the vice-chairperson. Later on 26 April, youth wing head Soon resigned citing career opportunities and family considerations, with newly elected member Jess Chua taking over three days later. On 11 August 2021, party member Brad Bowyer resigned from the party after he made a post comparing differentiated measures for those vaccinated with the [Holocaust](/wiki/Holocaust), sparking controversy and condemnation including from the Israeli Embassy in Singapore. Bowyer has since stood by his views. On 25 October, treasurer and party member Kayla Low resigned from the Party citing frequent travelling requirements as part of her new career, although she would continue to volunteer with the Party. Party member Peggie Chua took over as the new treasurer. The following month, former party member Kala Manickam sued the party over claims of wrongful termination and seeks to have $10,000 reimbursed, to which the party leadership said there was no basis to the lawsuit, listing various events that led to her termination. On 14 February 2022, Kumaran Pillai told party leaders he would step down from the positions of communications chief and party spokesman, taking a \"leave of absence\" for an unspecified period of time due to business ventures and health considerations, including a frozen shoulder sustained during a walkabout in the [2020 general election](/wiki/2020_Singaporean_general_election). Pillai will still be in the central executive committee, with Jonathan Tee taking over as the new communications chief, announced three days later. On 4 April 2023, Leong succeeded Yuen as the new secretary-general after Yuen stepped down, with the party stating in a press release on 26 March that Yuen had \"recently been appointed as executive chairman of an overseas publicly listed company, so his new position will make it difficult for him to lead the party\". The PSP's Vice-Chairman Wang and Head of Youth Wing Chua also stepped down from the CEC, with Poa succeeding as the party's vice-Chairman. The party came under spotlight during the last days of campaigning for the [2023 Singaporean presidential election](/wiki/2023_Singaporean_presidential_election) after the party's founder Tan (along with [Singapore Democratic Party](/wiki/Singapore_Democratic_Party) and former presidential candidate [Tan Jee Say](/wiki/Tan_Jee_Say)) were reported to have given endorsements to a two-time candidate [Tan Kin Lian](/wiki/Tan_Kin_Lian) in his presidential bid. The party responded that it was their discretion to support their candidates, and mentioned they will neither endorse or support any candidate who are non-partisan (a constitution rule where Presidency candidates are not allowed to be affiliated on any party at the time of election), and brought concerns citing that it may negatively impact the party. Prior to the election, Lee Hsien Yang also had expressed his intention to run for candidacy, but ultimately did not collect his application forms. On 23 February 2024, Leong stepped down as secretary-general of PSP after the Singapore government issued a [POFMA order](/wiki/Protection_from_Online_Falsehoods_and_Manipulation_Act_2019) which refuted the falsehoods made by Leong on his Facebook post. He remained on the party's governing body and as an NCMP. ### 2025–present: Electoral setbacks On 6 April 2025, PSP launched their manifesto. The party also announced its intention to contest in [West Coast–Jurong West](/wiki/West_Coast-Jurong_West_GRC) and [Chua Chu Kang](/wiki/Chua_Chu_Kang_Group_Representation_Constituency) GRCs. They fielded fewer candidates in the [2025 general election](/wiki/2025_Singaporean_general_election) compared to 2020. In the election that followed, the party fared worse across the board, securing only 36.25% of the votes it contested and 4.89% of the overall popular votes cast; the PAP's swings across the constituencies including West Coast–Jurong West GRC resulted in PSP not being awarded any NCMPs, ending their parliamentary presence. In their post-election interview, Leong told it was \"shocking\" but vowed to work hard \"seriously and humbly\" in the next election. ## Organisation This section **is in list format but may read better as prose**. You can help by converting this section, if appropriate. Editing help is available. *(July 2020)* ### Central Executive Committee Office-holderNameChairmanA’bas KasmaniSecretary-General[Leong Mun Wai](/wiki/Leong_Mun_Wai)TreasurerAnthony NeoOrganizing SecretaryPhang Yew HuatDeputy Organising Secretary (Logistics)Soh Zheng LongHead, Women's WingWendy LowHead, Youth WingSamuel LimHead, IntercommJoseph WongMemberSani IsmailMemberStephanie TanMemberLawrence Pek ### List of secretaries-general NoNameTook officeLeft officeTenure1[Tan Cheng Bock](/wiki/Tan_Cheng_Bock)28 March 201931 March 20212 years, 3 days2[Francis Yuen](/wiki/Francis_Yuen)1 April 202126 March 20231 year, 359 days3[Leong Mun Wai](/wiki/Leong_Mun_Wai)4 April 202320 February 2024322 days4[Hazel Poa](/wiki/Hazel_Poa)20 February 202420 March 20251 year, 28 days5[Leong Mun Wai](/wiki/Leong_Mun_Wai)26 March 2025*Incumbent*292 days ### List of chairpersons NoNameTook officeLeft officeTenure1Wang Swee Chuang28 March 201931 March 20212 years, 3 days2[Tan Cheng Bock](/wiki/Tan_Cheng_Bock)1 April 20215 July 20254 years, 286 days3A’bas Kasmani5 July 2025*Incubment*191 days ### List of first vice-chairpersons NoNameTook officeLeft officeTenure1Wang Swee Chuang1 April 202126 March 20231 year, 11 months, 26 days2[Hazel Poa](/wiki/Hazel_Poa)4 April 202320 February 2024322 days3Hazel Poa26 March 20255 July 2025292 days ### List of second vice-chairpersons NoNameTook officeLeft officeTenure1A’bas bin Kasmani26 March 202505 July 2025292 days ### List of former CEC members NoNameTook officeLeft officeTenure1Michelle Lee Juen17 January 20205 March 202049 days2Abdul Rahman28 March 201928 March 20212 years3Alex Tan28 March 201928 March 20212 years4Andrew Ng28 March 201928 March 20212 years5Lee Chiu San28 March 201928 March 20212 years6Lee Yung Hwee28 March 201928 March 20212 years7Michael Chua Teck Leong28 March 201928 March 20212 years8Ong Seow Yeong4 August 202028 March 2021236 days9Singam28 March 201928 March 20212 years10S Nallakaruppan28 March 201928 March 20212 years11Tan Chika17 January 202028 March 2021436 days12Wong Chow Seng28 March 201928 March 20212 years13Kayla Low28 March 202125 October 2021211 Days14Taufik Supan28 March 202123 June 20243 years15Kumaran Pillai1 April 202116 February 2022322 Days16[Ang Yong Guan](/wiki/Ang_Yong_Guan)4 April 202320 March 20252 Years ## Members of Parliament ### Current The PSP has no current MPs, having lost its representation in Parliament in 2025. ### Former NameConstituencyDuration[Leong Mun Wai](/wiki/Leong_Mun_Wai)[NCMP](/wiki/Non-constituency_Member_of_Parliament)2020 – 2025[Hazel Poa](/wiki/Hazel_Poa) ## Leadership ### Secretary General NoYearsName12019 – 2021[Tan Cheng Bock](/wiki/Tan_Cheng_Bock)22021 – 2023[Francis Yuen](/wiki/Francis_Yuen)32023 – 2024[Leong Mun Wai](/wiki/Leong_Mun_Wai)42024 – 2025[Hazel Poa](/wiki/Hazel_Poa)52025 – present[Leong Mun Wai](/wiki/Leong_Mun_Wai) ## Issues/proposals raised ### Budget In February 2020, PSP announced its first public policy proposal which includes: a) Broader relief package for businesses, b) Expansionary budget to tide through the current crises, c) Fiscal budget is not a goodie-bag, d) Building a sustainable economy, e) No to GST hike, f) Taxpayers should not be burdened for large infrastructure projects and g) A prudent approach to expenditures. PSP welcomes the Government's immediate short-term relief to assist Singaporeans and local companies in light of the [COVID-19 pandemic](/wiki/COVID-19_pandemic_in_Singapore). The party also called for a more \"broad-based\" approach in helping the transport, retail, and food and beverage industries and conducting a review of the education system. The party is in favour of more permanent plans rather than short-term occasional handouts. ### Climate change On climate change, [Tan Cheng Bock](/wiki/Tan_Cheng_Bock) has suggested that government and government-linked companies should provide incentives for renewable energy usage. ### Employment of foreign manpower [Tan Cheng Bock](/wiki/Tan_Cheng_Bock) has promised to call for the review of the [India–Singapore Comprehensive Economic Cooperation Agreement](/wiki/India%E2%80%93Singapore_Comprehensive_Economic_Cooperation_Agreement) (CECA), one of the terms which allow the free movement of Indian professionals in 127 sectors to enter and work in Singapore. He said that there is a need to ensure job priority for Singaporeans and CECA has brought a lot of unhappiness among Singaporean professionals, managers, executives and technicians (PMETs) who feel vulnerable in their jobs. He calls for the government to publish a balance sheet for CECA, to show how Singapore and Singaporeans have benefited from this agreement, how many local jobs have gone to Indian professionals and how many Singaporeans have gone to India. According to the PSP's manifesto published for the [2020 Singaporean General Election](/wiki/2020_Singaporean_general_election), the PSP wishes to introduce a quota for the number of Employment Passes and to lower the quota for the number of S-Passes and Work Permits. The manifesto also states that the dependence on foreign labour in Singapore has caused problems such as congestion, social strains and depressed wages. By curbing what the PSP describes as the easy supply of foreign manpower, they hope to encourage employers to invest in equipment or processes for higher productivity. ### Protection from Online Falsehoods and Manipulation Act (POFMA) PSP issued a statement on POFMA, stating that the POFMA does not measure up to standards of transparency and accountability and when news involved the government, it also fails the standard of independence. The party views that POFMA should be the prerogative of the Courts of Singapore. The PSP's manifesto released for the 2020 Singaporean General Election states that POFMA should be reviewed. ### Central Provident Fund The PSP wants Medishield Life premiums to be paid for by the Government. They are currently paid for using Medisave. ### Small and medium enterprises The PSP wants to provide assistance to local SMEs by giving them priority in public sector procurements, investing in local SMEs and encouraging cooperation amongst them, direct support to them to restructure their businesses and expand overseas, and reducing business costs for them. ### Taxes In their manifesto for the 2020 Singapore General Election, the PSP stated that they wanted to freeze tax and fee increases until 2025. ### Racial harmony In response to a video by entertainers Preeti and Subjas Nair which lambasted the use of [racial brownface](/wiki/Racial_brownface) in an advertisement, then-Central Executive Committee member Michelle Lee stated that although the siblings had used inappropriate language in their video, she found the police response in the aftermath to be 'high-handed' and 'harsh'. Lee acknowledged the video by the siblings reflected grievances that the minority races held in Singapore, and should not be ignored. The unity of Singaporeans regardless of race, language or religion was one of the principles which the PSP said guided their social policies in their 2020 manifesto. ### Voting age During the party launch ceremony, Michelle Lee called for the lowering of voting age from the current 21 to 18 in line with international standards. In her speech, she criticised the current government policy on voting age as being 'behind the times'. ### Alternative voices in Parliament The PSP's 2020 manifesto states that the over-dominance of the People's Action Party, which has consistently held over 90% of the seats in the [Parliament of Singapore](/wiki/Parliament_of_Singapore), should be reduced. They want stronger alternative voices in Parliament offering different views and suggestions. More alternative voices in Parliament is one of the PSP's priorities in political development stated in the manifesto. ### Public housing One of the PSP's priorities laid out in their 2020 manifesto was to address HDB lease decay. They hope to provide en-bloc redevelopment for all old HDB flats, peg new flat prices to income levels and bring down housing costs for young Singaporeans to make them free to pursue their entrepreneurial goals. ### Income inequality The PSP's 2020 manifesto states that they hope to reduce inequality and improve social mobility. It also states that they wish to exempt basic necessities from the Goods and Services Tax, which is a regressive tax that disproportionately affects the lower-income. ### Other issues In 2019, Michelle Lee commented on the high ministerial salary \"keep ministers in their ivory towers\" which prompted them afraid to take risks, disagree or lose their jobs. She added that the highest-paid minister earns approximately 43 times the average Singaporean and an entry-level minister earns half of that. The PSP's 2020 manifesto states that ministerial salaries should be cut and pegged to the median income. They believe this is a form of personal sacrifice. Lee also pointed out that more Singaporean students are turned away from tertiary education and the government spends almost $130 million on foreign students' scholarships. ## Electoral performance ### Parliament ElectionLeaderVotes%SeatsNCMPsPositionResultContestedTotal+/–SeatsWonLost(/wiki/2020_Singaporean_general_election)[Tan Cheng Bock](/wiki/Tan_Cheng_Bock)253,99610.18%240240 / 932 / 2 3rdNo seats (with NCMPs)(/wiki/2025_Singaporean_general_election)[Leong Mun Wai](/wiki/Leong_Mun_Wai)116,6074.89%130130 / 970 / 2 3rdNo seats #### Seats contested ElectionConstituencies contestedContested vote %+/–(/wiki/2020_Singaporean_general_election)[5-member GRC](/wiki/Group_representation_constituency): [Nee Soon](/wiki/Nee_Soon_Group_Representation_Constituency), [Tanjong Pagar](/wiki/Tanjong_Pagar_Group_Representation_Constituency), [West Coast](/wiki/West_Coast_Group_Representation_Constituency); 4-member GRC: [Chua Chu Kang](/wiki/Chua_Chu_Kang_Group_Representation_Constituency); [SMC](/wiki/Constituencies_of_Singapore): [Hong Kah North](/wiki/Hong_Kah_North_Single_Member_Constituency), [Kebun Baru](/wiki/Kebun_Baru_Single_Member_Constituency), [Marymount](/wiki/Marymount_Single_Member_Constituency), [Pioneer](/wiki/Pioneer_Single_Member_Constituency), [Yio Chu Kang](/wiki/Yio_Chu_Kang_Single_Member_Constituency)40.86%—N/a(/wiki/2025_Singaporean_general_election)5-member GRC: [West Coast-Jurong West](/wiki/West_Coast-Jurong_West_Group_Representation_Constituency); 4-member GRC: Chua Chu Kang; [SMC](/wiki/Constituencies_of_Singapore): [Bukit Gombak](/wiki/Bukit_Gombak_Single_Member_Constituency), Kebun Baru, Marymount, Pioneer36.25% 4.61% - [Elections in Singapore](/wiki/Elections_in_Singapore) - [Politics of Singapore](/wiki/Politics_of_Singapore) - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:44:54.429955",
  "title": "Progress Singapore Party",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Progress_Singapore_Party"
}