{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:44:56.901463"
  },
  "content": "This article needs to be **updated**. The reason given is: As of 2018, Project Griffin is ACT Awareness.. Relevant discussion may be found on the talk page. Please help update this article to reflect recent events or newly available information. *(December 2025)* **Project Griffin** was originally introduced by the [City of London Police](/wiki/City_of_London_Police) and [Metropolitan Police](/wiki/Metropolitan_Police) in April 2004 to help \"London's [financial sector](/wiki/Financial_services) better protect itself against terrorist threats\". It has since spread to businesses and security services as a way to get educated about [counter-terrorism](/wiki/Counter-terrorism) and crime prevention, be the 'eyes and ears' for the police and be prepared for major emergency. The goal of the program is to bring together the police, [fire brigade](/wiki/London_Fire_Brigade), [ambulance services](/wiki/London_Ambulance_Service), private security industry and other government agencies in deterring, disrupting and support operations targeting terrorist and [extremist](/wiki/Extremism) activity. Since its inception, the program has spread across the United Kingdom, Australia, Canada, Singapore, South Africa and the United States. A complementary program called \"**Project Argus**\" is also deployed across the United Kingdom. Project Argus focuses on \"preventing, handling and recovering from a terrorist attack.\" It takes participants through simulated but realistic terrorist attack for participants to learn what would likely happen in an attack, what are the priorities during an attack and to have the necessary plans in place before an attack. ## Components There are 3 components to this program: Awareness Day, Bridge Call and Response. ### Awareness Day This is a one-day seminar where police members will attend to teach course participants various skills. Depending on [jurisdiction](/wiki/Jurisdiction), these may include: [explosives](/wiki/Explosives), threats identification, [crime scene](/wiki/Crime_scene) preservation, [bomb threat](/wiki/Bomb_threat) management, [CBRN](/wiki/CBRN) management, [conflict resolution](/wiki/Conflict_resolution), [reconnaissance](/wiki/Reconnaissance), cordon management, crime reduction strategy and legal matters. Participants who finish the entire course will be presented with a certificate and their name entered into a register in case for a deployment. ### Bridge Call Every week (or regular interval as determined by the police force), a [conference call](/wiki/Conference_call) is placed for all participants to obtain any terrorism issues, crime or security issues. Generally speaking, these information are [police intelligence](/wiki/Police_intelligence) information for registered participants only. ### Response In the event of a major emergency or disaster, trained members will be deployed to support the police. They will be responsible for securing the cordon line and assist in evacuation if necessary. The response phrase differs from each jurisdiction as [liability](/wiki/Legal_liability), health and insurance coverage differ. ## International Adoption ### Australia [Victoria Police](/wiki/Victoria_Police) Counter-Terrorism and Emergency Management Division adopted the project model to train [security officers](/wiki/Security_officers) in threat identification and increase awareness in terrorism. They may be called upon for emergency response in an event of a major incident such as a terrorist attack. These security officers will be responsible for [access control](/wiki/Access_control) and manning the police cordon lines. ### Canada In February 2009, [Vancouver Police Department](/wiki/Vancouver_Police_Department) adopted the project from the United Kingdom. While similar in structure and function, the primary objective for the VPD is [crime prevention](/wiki/Crime_prevention) and crime reduction instead of counter-terrorism. Private security firms, [Community Policing Centre volunteers](/wiki/Vancouver_Police_Department#Community_policing_centres) and other [security screened](/wiki/Criminal_record#Canada) groups will participate on this project to receive the latest crime information and to assist police in an event of a major disaster. ### Singapore Termed 'Project Guardian', private security guards are trained and volunteer their service in case of a major emergency when terrorist targets are likely to occur, such as Exercise Heartbeat. [Singapore Police Force](/wiki/Singapore_Police_Force) disseminates information to registered volunteers on any safety and security development around the country. In an event of a street fight, they will assist police in [crowd control](/wiki/Crowd_control), traffic diversion, [evacuation](/wiki/Emergency_evacuation) and cordon control. ### South Africa [South African Police Service](/wiki/South_African_Police_Service) launched a pilot project in South Africa in 2007 to train private security in crowd control, securing crime scenes, reporting suspect vehicles, participate in weekly police briefings. Project participants will respond in an event of a major disaster. Unlike other jurisdictions, these security guards will also participate in a non-emergency situation. For example, they form part of the security plan for the [2010 FIFA World Cup](/wiki/2010_FIFA_World_Cup). ### United States [New York City Police Department](/wiki/New_York_City_Police_Department) launched the program called 'NYPD SHIELD'. Shield \"is an umbrella program for a series of current and future Police Department initiatives that pertain to private sector security and counterterrorism. This is a public private partnership based on information sharing.\" This program, unlike other jurisdictions, only pertains to information sharing and not the physical intervention in other programs. It was thought information sharing between police and businesses will educate business signs to look for and their potential for being targeted while serving as NYPD's 'eyes and ears'. - City of London Police Project Griffin - Vancouver Police Department Project Griffin - NYPD Shield\n",
  "language": "en",
  "processed_at": "2026-01-12T11:44:56.901215",
  "title": "Project Griffin",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Project_Griffin"
}