{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:45:00.639366"
  },
  "content": "2024 Singaporean corruption case ***Public Prosecutor v S. Iswaran*** was a criminal case brought by the [Attorney-General of Singapore](/wiki/Attorney-General_of_Singapore) against Singaporean former politician [Subramaniam Iswaran](/wiki/S._Iswaran), who faced 35[a] charges of \"obtaining gratification as a public servant\", corruption, and obstructing justice. The lawsuit was precipitated by an investigation of Iswaran's dealings with Malaysian billionaire [Ong Beng Seng](/wiki/Ong_Beng_Seng) by the [Corrupt Practices Investigation Bureau](/wiki/Corrupt_Practices_Investigation_Bureau) (CPIB) that officially began on 11 July 2023 and ended sometime before 9 January 2024. Iswaran announced his resignation from the government on 18 January 2024. The trial began on 24 September 2024 and ended after five hours, with Iswaran pleading guilty to four charges of \"obtaining gratification as a public servant\" and one charge of obstructing justice under Sections 165 and 204A(a) of the [Penal Code](/wiki/Penal_Code_(Singapore)) respectively. He became the first minister to be charged and tried in court since [Wee Toon Boon](/wiki/Wee_Toon_Boon) in 1975; the first minister to be investigated for corruption since [Teh Cheang Wan](/wiki/Teh_Cheang_Wan) in 1986; and the first individual ever to be charged under Section 165 of the Penal Code since [independence](/wiki/Independence_of_Singapore_Agreement_1965) in 1965. On 3 October 2024, Iswaran was sentenced to 12 months of imprisonment. ## Investigation On 29 May 2023, the [Corrupt Practices Investigation Bureau](/wiki/Corrupt_Practices_Investigation_Bureau) (CPIB) alerted [Prime Minister](/wiki/Prime_Minister_of_Singapore) [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) about \"information concerning ([Minister for Transport](/wiki/Ministry_of_Transport_(Singapore)) and [Minister-in-charge of Trade Relations](/wiki/Ministry_of_Trade_and_Industry_(Singapore)) S. Iswaran) that merited investigation\". On 11 July 2023, with Lee's concurrence, the CPIB officially began a criminal investigation into Iswaran's dealings with Malaysian billionaire [Ong Beng Seng](/wiki/Ong_Beng_Seng) and his businesses, including Como Holdings (UK) and [Singapore Grand Prix](/wiki/Singapore_Grand_Prix). Both Iswaran and Ong were arrested on the same day and given bail. The last cabinet minister to be investigated by the CPIB prior to Iswaran was [Teh Cheang Wan](/wiki/Teh_Cheang_Wan) in 1986, who [killed himself](/wiki/Suicide) before charges could be filed. On 2 August 2023, Lee announced that he had instructed Iswaran to take a leave of absence until the conclusion of the CPIB's investigation. Lee also revealed that Iswaran's monthly ministerial pay had been reduced to [S$](/wiki/Singapore_dollar)8,500, although he would continue to receive his full yearly allowance of S$192,500 as a Member of Parliament. On 9 January 2024, [Minister for Education](/wiki/Ministry_of_Education_(Singapore)) [Chan Chun Sing](/wiki/Chan_Chun_Sing) announced on Lee's behalf that the CPIB's investigation had concluded. The [Attorney-General's Chambers](/wiki/Attorney-General_of_Singapore) subsequently began reviewing the case. ## Charges The prosecution, led by Deputy Attorney-General Tai Wei Shyong and also comprising Chief Prosecutor Tan Kiat Pheng, Deputy Chief Prosecutor Jiang Ke-Yue, and Deputy Public Prosecutor Kelvin Chong, presented Iswaran with 36 charges on 16 January 2024, but ultimately proceeded with only 27 charges that were publicly announced at the [Criminal Mentions Court](/wiki/State_Courts_of_Singapore) on 18 January. Iswaran thus became the first minister to be charged and tried in court since [Minister of State for the Environment](/wiki/Ministry_of_Sustainability_and_the_Environment) [Wee Toon Boon](/wiki/Wee_Toon_Boon) in April 1975. Entering the courtroom around 08:15, Iswaran pleaded not guilty to the 27 charges, including 24 charges of \"obtaining gratification as a public servant\" under Section 165 of the [Penal Code](/wiki/Penal_Code_(Singapore)); two charges of corruption under Section 6(a) of the Prevention of Corruption Act; and one charge of obstructing the course of justice under Section 204A(a) of the Penal Code. It was the first time in 153 years (since the introduction of the Penal Code to Singapore in 1871) that a person had been charged under Section 165 of the code. [Davinder Singh](/wiki/Davinder_Singh_(lawyer)) served as defence counsel for Iswaran. The prosecution alleged that between 2015 and 2022, Iswaran had obtained as bribes items valued at more than [S$](/wiki/Singapore_dollar)384,000, including hotel stays, [private jet](/wiki/Private_jet) and [business class](/wiki/Business_class) flights to and from [Doha](/wiki/Doha), as well as tickets to the [Singapore Grand Prix](/wiki/Singapore_Grand_Prix) and various football matches and performances in the United Kingdom. Iswaran was granted bail of S$800,000. The case was transferred to the High Court, with a chambers hearing due to take place on 2 April 2024. On 18 March 2024, Iswaran was served eight additional charges relating to alleged offences that had been committed between November 2021 and November 2022. According to the CPIB, Iswaran had obtained nearly S$19,000 worth of valuables from businessman David Lum Kok Seng, including several bottles of wine and whiskey, [golf clubs](/wiki/Golf_club), and a [Brompton](/wiki/Brompton_Bicycle) bicycle. The new charges were publicly announced on 25 March 2024; arriving in court around 08:20, Iswaran pleaded not guilty to all eight charges. However, the two corruption charges were later amended to two more charges under Section 165 of the Penal Code. On 23 September 2024, Iswaran made a \"voluntary disgorgement\" (returning ill-gotten gains) of S$380,305.95 to the state. The trial began the next day at 10:00, with Judge Vincent Hoong presiding over the case. The prosecution proceeded with only four charges of obtaining valuable items as a public servant and one charge of obstructing the course of justice against Iswaran, who pleaded guilty to all five charges. Iswaran's guilty plea was accepted by the judge and the hearing concluded after some five hours. ## Sentencing On 3 October 2024, Iswaran was sentenced to 12 months of imprisonment by Justice Vincent Hoong, who described the prosecution's request of 6 to 7 months of imprisonment as \"manifestly inadequate\". In addition to the four charges under Section 165 of the Penal Code and one charge of obstructing the course of justice under Section 204A(a) of the Penal Code, 30 other charges under Section 165 of the Penal Code were taken into consideration for the purpose of determining the sentence to be imposed. Members of the courtroom gallery were heard gasping as the sentence was announced, while Iswaran's wife, Kay Mary Taylor, shook her head. Several local lawyers opined that it was rare, but not unprecedented, for the judge to impose a sentence that was more severe than the one that had been requested by the prosecution. ## Imprisonment Iswaran began serving his sentence at [Changi Prison](/wiki/Changi_Prison) on 7 October. On 7 February 2025, after serving four months in prison, Iswaran was transferred to the home detention scheme to continue the rest of his sentence in the community and outside of prison. As Iswaran served with good behaviour and therefore eligible for parole after two-thirds of his stipulated jail term (equivalent to eight months), he was allowed to transition to the home detention scheme halfway through his reduced sentence. The decision was made after the prison authorities took into consideration Iswaran's low propensity to re-offend, his strong familial support and that he did not commit any institutional offence during his incarceration. On 6 June 2025, the Singapore Prison Service said that Iswaran had completed his sentence, though it did not specify when. ## Reactions ### Defendant On 16 January 2024, Iswaran resigned as Cabinet minister, Member of Parliament for the [West Coast Group Representation Constituency](/wiki/West_Coast_Group_Representation_Constituency), and member of the [People's Action Party](/wiki/People%27s_Action_Party). He added that he would voluntarily return all the money that he had earned as a minister and a Member of Parliament since July 2023. Shortly after being charged in court on 18 January, Iswaran declared in a statement to the media: \"I am innocent and will now focus on clearing my name.\" The portfolios for Minister for Transport and Minister-in-charge of Trade Relations were subsequently assumed by [Chee Hong Tat](/wiki/Chee_Hong_Tat) and [Grace Fu](/wiki/Grace_Fu) respectively. [National Development Minister](/wiki/Ministry_of_National_Development_(Singapore)) [Desmond Lee](/wiki/Desmond_Lee_(Singaporean_politician)), also an MP for the West Coast GRC, took over Iswaran's MP duties. Following his sentencing, Iswaran wrote on [Facebook](/wiki/Facebook): \"I accept that as a minister what I did was wrong under Section 165. I accept full responsibility for my actions and apologise unreservedly to all Singaporeans.\" ### People's Action Party In his reply to Iswaran's letter of resignation, Prime Minister Lee wrote: \"I am disappointed and saddened that you are leaving politics in these circumstances. But it is essential that I deal with such matters rigorously in accordance with the law. It is the right thing to do. We must uphold the integrity of the party and the government.\" Deputy Prime Minister [Lawrence Wong](/wiki/Lawrence_Wong) acknowledged that Iswaran's case would dampen party morale, but added: \"The People's Action Party's stance on corruption is non-negotiable and part of its DNA. There can be no compromise, relaxation, or fudging the issue; no matter the political price.\" Following Iswaran's sentencing, Wong—who had since succeeded Lee as Prime Minister—admitted that he was \"disappointed and saddened\", but added that \"as painful as it is to act against a colleague and friend, it is our duty to do so when necessary.\" - [Corruption in Singapore](/wiki/Corruption_in_Singapore) ## Notes\n",
  "language": "en",
  "processed_at": "2026-01-12T11:45:00.639084",
  "title": "Prosecution of S. Iswaran",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Prosecution_of_S._Iswaran"
}