{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:45:02.727870"
  },
  "content": "* *Prostitution in Singapore** in itself is not illegal, but various prostitution-related activities are criminalized. This includes public solicitation, living on the earnings of a prostitute and maintaining a brothel. In practice, police unofficially tolerate and monitor a limited number of brothels. Prostitutes in such establishments are required to undergo periodic health checks and must carry a health card. ## History In the late nineteenth century Singapore had a large gender imbalance, with the male population greatly outnumbering the female. In 1884, the city had a population of only 6,600 Chinese women in total, compared to 60,000 Chinese men. This combined with the city's rapid economic development, resulting in prostitution becoming a flourishing business and brothels a boom industry. An estimated 2,000 of the 6,600 Chinese women in the city in 1884 worked as prostitutes. It is also estimated that 80% of the women and girls coming from China to Singapore in the late 1870s were sold into prostitution. Singapore's prostitutes were primarily Chinese and Japanese, imported as [karayuki-san](/wiki/Karayuki-san). Many of those from China were ethnic [Tanka people](/wiki/Tanka_people) who were regarded as being of a non-[Han ethnicity](/wiki/Han_ethnicity) during the Late [Qing](/wiki/Qing) and [Republican period of China](/wiki/Republic_of_China_(1912%E2%80%931949)). They serviced the men of the overseas Chinese community.[*citation needed*] Singapore was also a destination for Vietnamese women trafficked from their villages. Many Vietnamese girls from [Tonkin](/wiki/Tonkin) were disguised as Chinese when being trafficked out of Vietnam for prostitution. The development of the Japanese enclave in Singapore at [Middle Road, Singapore](/wiki/Middle_Road,_Singapore#Karayuki-san) was connected to the establishment of brothels east of the [Singapore River](/wiki/Singapore_River), namely along Hylam, Malabar, Malay and Bugis Streets during the late 1890s. The Japanese prostitutes on Malabar and Malay streets were favoured by Europeans. By 1905 there were at least 109 Japanese brothels in Singapore. Prostitution was seen by the colonial authorities as a necessary evil but a number of steps were taken to place restrictions on prostitution in the city. The registration of prostitutes and brothels was made compulsory in an attempt to prevent [forced prostitution](/wiki/Forced_prostitution), and an Office to Protect Virtue was set up to help anyone unwillingly involved in prostitution. Shortly after the outbreak of [World War I](/wiki/World_War_I) the colonial authorities banned prostitution by white women, and as a result the white brothels in Singapore (over twenty in 1914) had all closed by 1916. A 1916 report described the misery and indecency of the prostitutes working in the [red-light districts](/wiki/Red-light_district) around Malay Street and Smith Street, and pressure was placed on the [Colonial Office](/wiki/Colonial_Office) in Britain to further restrict licensed prostitution. [Sir Arthur Young](/wiki/Arthur_Young_(colonial_administrator)), governor-general of the [Straits Settlements](/wiki/Straits_Settlements), considered prostitution indispensable for the colony's economy and labour supply but the sale of women and girls into prostitution was banned in 1917. Influential figures in the city's Japanese community who were concerned about dignity and morality put pressure on the Japanese Consulate to end Japanese prostitution. In 1920 the Consulate ordered the banishment of all Japanese prostitutes from Singapore, though some of the women remained as unlicensed prostitutes. The importation of women and girls for prostitution was banned in 1927 and brothels were banned in 1930, though prostitution remained legal. During the [Japanese occupation of Singapore](/wiki/Japanese_occupation_of_Singapore) (1942–45), brothels were set up for the use of Japanese servicemen. There were about twenty such brothels in the city, typically housed in deserted Chinese mansions. By the time of the [surrender of Japan](/wiki/Surrender_of_Japan) in 1945, prostitution was flourishing. In the 1950s [striptease](/wiki/Striptease) acts took place at the city's [getai](/wiki/Getai) shows, performed by specialist travelling dance troupes. The shows developed a sleazy image, partly as a result of stories about performers working as prostitutes. During this decade the city's police organised operations to reduce prostitution and Chief Minister [Lim Yew Hock](/wiki/Lim_Yew_Hock) sought out suggestions as to how prostitution could be limited. Women's rights activist [Shirin Fozdar](/wiki/Shirin_Fozdar) described Singapore as \"one big brothel\" and the city was a regional centre for prostitution. The [People's Action Party](/wiki/People%27s_Action_Party) under the leadership by [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) initially banned prostitution when they came to power in the late 1950s, switching to a strategy of containment in the mid 1960s. From the 1950s to the early 1980s [Bugis Street](/wiki/Bugis_Street) was famous for its nightly adult-themed shows performed by transvestites and groups of prostitutes would also openly solicit there. Neighbouring Johore Road was also part of the red-light district in the 1960s and the 1970s, with transgender prostitutes soliciting for business in the [shophouses](/wiki/Shophouse) and alleys. Suppression of prostitution in the area began in the 1970s, and the trade was dispersed to the surrounding areas such as [Jalan Besar](/wiki/Jalan_Besar). The old Bugis Street was demolished in the mid-1980s, and Johore Road disappeared in the late 1990s. Singapore's economic boom in the 1970s and 1980s, leading to an increase in construction work and foreign construction workers in Singapore, created an increase in demand for sex work, and unskilled women from Malaysia and India migrated to Singapore to take up prostitution alongside the Chinese women already working in the sex industry. In the 1990s, Thai and Korean prostitutes also moved to Singapore to service the single men working in the construction industry. In the designated [red-light districts](/wiki/Red-light_district), sex workers were earning $7–$120 per client in the 1990s. In 1976, the government launched the Medical Surveillance Scheme to control sexually transmitted diseases among commercial sex workers in regulated brothels. These sex workers are required to go for regular screenings for [sexually transmitted infections](/wiki/Sexually_transmitted_infection) and [HIV](/wiki/HIV) at the Department of Sexually Transmitted Infections Control Clinic or other designated clinics. In 2023, [Saw Swee Hock School of Public Health](/wiki/Saw_Swee_Hock_School_of_Public_Health) published a study that there are approximately 8,030 female sex workers in Singapore at any given time. ## Law ### Commercial sex with underaged persons Any person who obtains for consideration the sexual services of a person under 18 years of age (in other words, has commercial sex with such a person) commits an offence and may be punished with imprisonment of up to seven years or a fine or both. The term *sexual services* is defined to mean sexual services involving sexual penetration of the vagina or anus of a person by a part of another person's body other than the penis or by anything else, or penetration of the vagina, anus or mouth of a person by a man's penis. It is also an offence for a person to communicate with another person for the purpose of having commercial sex with a person under 18. These offences apply to acts that take place in as well as outside Singapore. It is a crime for a person to: - Make or organise any travel arrangements for or on behalf of any other person with the intention of facilitating the commission by that other person of an offence under section 376C (that is, offences relating to commercial sex with a minor under 18 outside Singapore), whether or not such an offence is actually committed by that other person; - Transport any other person to a place outside Singapore with the intention of facilitating the commission by that other person of an offence under section 376C, whether or not such an offence is actually committed by that other person; or - Print, publish or distribute any information that is intended to promote conduct that would constitute an offence under section 376C, or to assist any other person to engage in such conduct. A person who is guilty of the offence may be punished with imprisonment of up to ten years, or a fine, or both. ### Pimping It is a criminal offence to: - Sell, let for hire or otherwise dispose of or buy or hire or otherwise obtain possession of any woman or girl with intent that she shall be employed or used for the purpose of prostitution either within or without Singapore, or knowing or having reason to believe that she will be so employed or used; - Procure any woman or girl to have either within or without Singapore carnal connection except by way of marriage with any male person or for the purpose of prostitution either within or without Singapore; - By threats or intimidation procure any woman or girl to have carnal connection except by way of marriage with any male person either within or without Singapore; - Bring into Singapore, receive or harbour any woman or girl knowing or having reason to believe that she has been procured for the purpose of having carnal connection except by way of marriage with any male person or for the purpose of prostitution either within or without Singapore and with intent to aid such purpose; - Knowing or having reason to believe that any woman or girl has been procured by threats or intimidation for the purpose of having carnal connection except by way of marriage with any male person, either within or without Singapore, to receive or harbour her with intent to aid such purpose; - Knowing or having reason to believe that any woman or girl has been brought into Singapore in breach of section 142 of the Women's Charter or has been sold or purchased in breach of section 140(1)(a), to receive or harbour her with intent that she may be employed or used for the purpose of prostitution either within or without Singapore; - Detain any woman or girl against her will on any premises with the intention that she shall have carnal connection except by way of marriage with any male person, or detain any woman or girl against her will in a brothel; - Detain any woman or girl in any place against her will with intent that she may be employed or used for the purpose of prostitution or for any unlawful or immoral purpose; or - Attempt to do any of the above acts. The penalty is imprisonment not exceeding five years and a fine not exceeding $10,000. A male person who is convicted of a second or subsequent offence under the first six offences listed above is liable to be [caned](/wiki/Caning_in_Singapore) in addition to being imprisoned. ## Practice Prostitution occupies an ambivalent position in Singaporean society. Major constraints control its practice despite it being legal. The range of means of procurement used is wide, including prostitutes soliciting in local markets; [streetwalkers](/wiki/Street_prostitution); prostitutes employed by [massage parlors](/wiki/Massage_parlor), bars, nightclubs, [strip clubs](/wiki/Strip_club) and brothels; and [call girls](/wiki/Call_girl) working for [escort agencies](/wiki/Escort_agencies). Freelance prostitutes operate in [dance halls](/wiki/Dance_hall), [nightclubs](/wiki/Nightclub), [karaoke lounges](/wiki/Karaoke_lounge) and [supper clubs](/wiki/Supper_club). The primary centres for prostitution are the designated [red-light areas](/wiki/Red-light_area). The main red-light district in Singapore is located in [Geylang](/wiki/Geylang). Police unofficially tolerate and monitor a limited number of brothels, where the prostitutes are regularly screened for health check-ups. Outside the main red-light district, unregulated prostitution happened at locations such as [Orchard Towers](/wiki/Orchard_Towers), nicknamed the \"Four Floors of Whores\", in Orchard, [Golden Mile Complex](/wiki/Golden_Mile_Complex), before its redevelopment in 2023 for Thai workers in pubs and karaoke rooms, in Beach Road and Desker Road for South Asians. Commercial sex workers can also be found in many \"massage\" or \"spa\" establishments. Some [massage parlors](/wiki/Massage_parlor) offer massages as a pretext for \"special\" sexual services. These activities are illegal, and the operators of such massage establishments risk jail if their activities are exposed by [police raids](/wiki/Police_raid). Other locations include KTV lounges, beauty salons, hair salons, escort agencies. Services are also provided on digital marketplaces such as private chat channels and subscription platforms like [OnlyFans](/wiki/OnlyFans). Vietnamese prostitutes in Singapore charge high prices for their services. ## Policing By the end of 2015 there had been an increase of around 40% in fraud crimes that involved prostitution and sex-related scams involving the [internet](/wiki/Internet). The public was advised to be wary of practices such as [sugar mommies](/wiki/Sugar_momma), credit-for-sex scams and internet [romance scams](/wiki/Romance_scam). [Massage parlours](/wiki/Massage_parlour) that provide sexual services and other commercial sex-related activities were also appearing in suburban areas such as [Joo Chiat](/wiki/Joo_Chiat), [Woodlands](/wiki/Woodlands,_Singapore), [Sembawang](/wiki/Sembawang), [Sengkang](/wiki/Sengkang), [Jurong West](/wiki/Jurong_West), [Yishun](/wiki/Yishun), [Chinatown](/wiki/Chinatown) and [River Valley](/wiki/River_Valley,_Singapore). In response the [Government of Singapore](/wiki/Government_of_Singapore) began looking at various options for regulating and punishing violations such as cases of unlicensed prostitution and the operation of brothels. In 2016, examples of sentencing included the case of a man who was jailed for 85 months and fined S$130,000 for organising online prostitution and evading nearly S$27,000 of income tax. In 2015 there were also reported cases of nightly sex activities involving transvestite prostitutes soliciting at a car park in the old [Woodlands](/wiki/Woodlands,_Singapore) Town Garden which is adjacent to the [Johor-Singapore Causeway](/wiki/Johor-Singapore_Causeway). Some of these were Malaysian transvestites with full-time jobs in Singapore who were making use of this activity as a [side job](/wiki/Side_job) to save money for [gender-affirming surgery](/wiki/Gender-affirming_surgery). In 2016 Member of Parliament [Halimah Yacob](/wiki/Halimah_Yacob) announced a series of proposals involving the [National Parks Board](/wiki/National_Parks_Board) to address concerns about the area. These included upgrading the park and the adjacent shopping malls. The Singapore Police conducts frequent raids against vice-related activities. In June 2024, more than 1,000 multi-agency operations was conducted with 512 arrests made. There are also rare cases of people impersonating policemen in order to rob sex workers. In 2016 the organiser of such a crime was sentenced to two years and seven months in jail and 12 strokes of the cane. ## Sex trafficking There has been an illegal trade in women and girls unwillingly trafficked into Singapore's brothels since the beginning of the nineteenth century. The country's authorities have made numerous attempts to prevent the trade. Singapore is a destination country for women and girls from other Asian countries subjected to [sex trafficking](/wiki/Sex_trafficking) and a source country for Singaporean women and children subjected to sex trafficking. Some of the 965,000 foreign work permit holders that comprise more than one-quarter of Singapore's total labor force are vulnerable to trafficking; most victims migrate willingly. Traffickers compel victims into sex exploitation through illegal withholding of their pay, threats of forced repatriation without pay, restrictions on movement, and physical and sexual abuse. Foreign women sometimes arrive in Singapore with the intention of engaging in prostitution, but under the threat of serious harm or other forms of coercion, they become victims of sex trafficking. The [United States Department of State](/wiki/United_States_Department_of_State) [Office to Monitor and Combat Trafficking in Persons](/wiki/Office_to_Monitor_and_Combat_Trafficking_in_Persons) uprated Singapore to a '[Tier 1](/wiki/Trafficking_in_Persons_Report#Ranking_System)' country in 2020. Notes ### Cited Works - Ho, Hui Lin (29 January 2013). *The 1950s Striptease Debates in Singapore: Getai and the Politics of Culture* (Masters of Arts (History) thesis). **Articles** - Archibald, C.P. [*et al.*] (6–11 June 1993). \"Improved Knowledge but Unchanged Behaviour Following a Safe Sex Intervention among Prostitutes in Singapore\". *International Conference on AIDS*. **9**: 825. Archived from the original on 28 September 2011.. - Lim, K.B. [*et al.*]; Tham, SN; Sng, I; Tan, T (August 1984). \"Screening for Cervical Cancers in Prostitutes\" (PDF). *Singapore Medical Journal*. **28** (4): 300–303. [PMID](/wiki/PMID_(identifier)) 3423794.. - Ratnam, K.V. (December 1986). \"Awareness of AIDS among Transsexual Prostitutes in Singapore\". *Singapore Medical Journal*. **27** (6): 519–521. [PMID](/wiki/PMID_(identifier)) 3589723.. - Ratnam, K.V. (February 1990). \"Efficacy of Health Education Programme on Awareness of AIDS among Transsexuals\" (PDF). *Singapore Medical Journal*. **31** (1): 33–37. [PMID](/wiki/PMID_(identifier)) 2333540.. - Warren, James Francis; Jaschok, Maria; Miers, Suzanne (1994). \"Chinese Prostitution in Singapore: Recruitment and Brothel Organisation\". *Women and Chinese Patriarchy: Submission, Servitude, and Escape*. Hong Kong: [University of Hong Kong](/wiki/University_of_Hong_Kong). pp. 77–107. [ISBN](/wiki/ISBN_(identifier)) 978-1-85649-125-9.. - Warren, James Francis (1990). \"Prostitution and the Politics of Venereal Disease: Singapore, 1870–98\". *Journal of Southeast Asian Studies* (Submitted manuscript). **21** (2): 360–383. [doi](/wiki/Doi_(identifier)):10.1017/S0022463400003283. [JSTOR](/wiki/JSTOR_(identifier)) 20071198. [S2CID](/wiki/S2CID_(identifier)) 74000610.. - Wong, M.L. [*et al.*] (6–11 June 1993). \"A Qualitative Investigation of Condom Use Negotiation among Prostitutes in Singapore\". *International Conference on AIDS*. **9**: 113. Archived from the original on 7 March 2010.. - Wong, Yang Joel (1996). \"Brothels, Pimps and Prostitutes: The Administration of Criminal Justice *vis-à-vis* Prostitution\". *Singapore Law Review*. **17**: 154.. **Books** - Brazil, David (1993). *No Money No Honey*. Singapore: Angsana Books. [ISBN](/wiki/ISBN_(identifier)) 978-981-00-5129-7.. - Tan, Roger (2012). *Singapore Sex Guide 2013*. Singapore.`{{cite book}}`: CS1 maint: location missing publisher (link). - Lai, Ah Eng (1986). *Peasants, Proletarians, and Prostitutes: A Preliminary Investigation into the Work of Chinese Women in Colonial Malaya*. Singapore: Institute of Southeast Asian Studies. [ISBN](/wiki/ISBN_(identifier)) 978-9971-988-38-8.. - Lim, Gerrie (2004). *Invisible Trade: High-class Sex for Sale in Singapore*. Singapore: [Monsoon Books](/wiki/Monsoon_Books). [ISBN](/wiki/ISBN_(identifier)) 978-981-05-1033-6.. - Lim, Gerrie (2008). *Invisible Trade II: Secret Lives and Sexual Intrigue in Singapore*. Singapore: Monsoon Books. [ISBN](/wiki/ISBN_(identifier)) 978-981-05-9209-7.. - Moe, Mekong (2018). *Erotic Singapore: Sex and the City-State*. Singapore: Createspace Books.. - Nicholl-Jones, S.E. (1941). *Report on the Problem of Prostitution in Singapore*. [Singapore]: [s.n.]. - Warren, James Francis (1993), *Ah Ku and Karayuki-san: Prostitution in Singapore, 1870–1940*, Singapore; New York, N.Y.: [Oxford University Press](/wiki/Oxford_University_Press), [ISBN](/wiki/ISBN_(identifier)) 978-0-19-588616-0. Library resources about **Prostitution in Singapore** - Resources in your library - Resources in other libraries - Singaporeans fight sex trade with street lamps - Prostitution wave hits 'squeaky clean' Singapore - Singapore may raise minimum prostitution age to 18 - Country Narrative – Singapore - Prostitution is not illegal in Singapore\n",
  "language": "en",
  "processed_at": "2026-01-12T11:45:02.727604",
  "title": "Prostitution in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Prostitution_in_Singapore"
}