{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:45:04.828711"
  },
  "content": "2016 film by Royston Tan **Provision Shop** ([Chinese](/wiki/Simplified_Chinese_characters): 杂货店) is a Singaporean telemovie commissioned by the [Ministry of Communications and Information](/wiki/Ministry_of_Communications_and_Information) in collaboration with Tribal Worldwide Singapore. It is directed by [Royston Tan](/wiki/Royston_Tan) and stars [Sora Ma](/wiki/Sora_Ma), [Marcus Chin](/wiki/Marcus_Chin), [Li Yinzhu](/wiki/Li_Yinzhu), Siti Khadijah, [Brandon Wong](/wiki/Brandon_Wong_(actor)), Cui Yang, Aden Tan and Sarah Daniel. The telemovie debuted on television on 17 July 2016 on [Mediacorp Channel 8](/wiki/Channel_8_(Singaporean_TV_channel)). ## Plot The film consists of four stories involving shop owner, his daughter, an ice delivery man and a maid. ## Cast - [Sora Ma](/wiki/Sora_Ma) as Gao Ling Ling, the provision shop owner's daughter - [Marcus Chin](/wiki/Marcus_Chin) as the provision shop owner - [Li Yinzhu](/wiki/Li_Yinzhu) as Madam Goh, also nicknamed \"Empress Wu\" - Siti Khadijah as Theresita, Madam Goh's helper - [Brandon Wong](/wiki/Brandon_Wong_(actor)) as an ice-delivery man - Cui Yang as the ice-delivery man's supervisor from China - Aden Tan as Peter, a tertiary student who is a frequent patron of the provision shop - Sarah Daniel as a tertiary student in a budding romance with Peter ## Production The film was done with collaboration with Tribal Worldwide Singapore and the [Ministry of Communications and Information](/wiki/Ministry_of_Communications_and_Information). Tan said it was inspired by Tee Seng Store and the shopowner’s experiences in managing changes over time. The film also explored how people are affected by evolving times and adapting to changes. ## Reception [Prime Minister of Singapore](/wiki/Prime_Minister_of_Singapore) [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) praised the soundtrack of the telemovie and had listened to the full soundtrack twice. - 《杂货店》The Provision Shop on [YouTube](/wiki/YouTube_video_(identifier)) This article related to a Singaporean film is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:45:04.828314",
  "title": "Provision Shop",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Provision_Shop"
}