{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:45:07.487040"
  },
  "content": "The **Provisional Admission Exercise** (**PAE**), colloquially known as the **first three months** among Singapore students, was an interim exercise in which graduating Secondary 4 students in Singapore could choose to join a [junior college](/wiki/Junior_college) or centralised institute for Term 1 in the following [academic year](/wiki/Academic_year), before the official release of the [GCE 'O' level results](/wiki/General_Certificate_of_Education). Students used the score of their respective secondary schools' internal preliminary [examinations](/wiki/Test_(assessment)) to apply under the programme. ## Programme Most pre-university centres' [orientation](/wiki/Student_orientation) programmes during the PAE were longer than those held at the start of the actual pre-university academic year. Students usually made use of this period of time to [socialise](/wiki/Socialise) and enjoy themselves; their workload was greatly reduced, and cases of [skipping classes](/wiki/Truancy) were common. This is in stark contrast to the pressure-cooker [stress](/wiki/Stress_(medicine)) that students usually undergo during a normal school term. Junior colleges in Singapore also made use of this period to organise many activities, with fun as an emphasis, in order to entice students to stay in their respective institutions after the PAE. This is particularly true if the junior college is not prominent for its academic-orientated performance. During the PAE, students were permitted to wear [uniforms](/wiki/School_uniform) of their [secondary schools](/wiki/Secondary_school) instead of those of the pre-university centre. The phenomenon of [gate-crashing](/wiki/Gate-crashing), or colloquially called crashing, arose from this loophole; in an act amounting to trespassing, students not affiliated to a school enter without prior consent from the school administration. Some students gatecrashed to enjoy the prestige of crashing a \"good\" pre-university centre; others did so to join their former schoolmates. It was also common to see students from different secondary schools exchanging their school uniforms with those from schools considered more recognised, mostly for the fun of it or in some cases, to escape the \"neighbourhood school\" stigma presented by their uniforms. Critics claim that some secondary schools give an unfair advantage over their students, by either [inflating grades](/wiki/Grade_inflation) for the internal preliminary examinations or making them easier. Students who choose to remain in the JCs after the PAE are awarded bonus '[loyalty](/wiki/Loyalty)' scores, which cuts off 2 points in their GCE 'O' Level grade, giving them a greater chance of remaining in the pre-university centre. However, the option to reduce one's score by 2 points is only applicable if the student scores an L1R5 of 20 points or less. School administrations struggled to cope with the admission procedures of two student batches in an academic year. It is also argued that in many cases, lessons had to be retaught as many students did not remain in the same pre-university centre after the PAE because some left for other JCs or [polytechnics](/wiki/Institute_of_technology#Singapore).[*citation needed*] ## End of PAE The [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)) had originally announced the consolidation of a single admission batch for pre-university centres from 2006 onwards, but due to administrative problems, the abolishment was delayed until 2009, making 2008 the last year with PAE. This coincides with the arrangement between [SEAB](/wiki/Singapore_Examinations_and_Assessment_Board) and [UCLES](/wiki/University_of_Cambridge_Local_Examinations_Syndicate) to cut short the marking period of papers. - [Culture of Singapore](/wiki/Culture_of_Singapore) - [Education in Singapore](/wiki/Education_in_Singapore) - [Racial Harmony Day](/wiki/Racial_Harmony_Day) - Ministry of Education press release: Single Intake for Junior Colleges and Millennia Institute from 2009\n",
  "language": "en",
  "processed_at": "2026-01-12T11:45:07.485056",
  "title": "Provisional Admission Exercise",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Provisional_Admission_Exercise"
}