{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:45:12.976136"
  },
  "content": "Government agency in charge of water supply **PUB, Singapore's National Water Agency**, commonly known as **PUB**, an [acronym](/wiki/Acronym) for **Public Utilities Board**, is a [statutory board](/wiki/Statutory_boards_of_the_Singapore_Government) under the [Ministry of Sustainability and the Environment](/wiki/Ministry_of_Sustainability_and_the_Environment) of the [Government of Singapore](/wiki/Government_of_Singapore) responsible for ensuring a sustainable and efficient water supply in [Singapore](/wiki/Singapore). PUB regulates and oversees the country's entire water supply system, which comprises the water catchment systems, drainage systems, water works, pipeline network, water reclamation plants and sewage systems. In April 2020, PUB was also appointed Singapore's National Coastal Protection Agency. The nation's demand for water is about 400 million imperial gallons (1.8×10^6 m3) a day, with homes and non-domestic sectors consumption forming 45% and 55% of the demand respectively, and expected to double by 2060. PUB is set to meet 80% of this demand through its [NEWater](/wiki/NEWater) and [desalination](/wiki/Desalination) technologies. PUB's watershed management and treatment processes has ensured a continuous supply of clean and quality water for Singaporeans over the last four decades. The nation's clean and drinkable 'tap water' across the island exceeds the drinking water standards set by the [World Health Organization](/wiki/World_Health_Organization). Singapore is named the top Asian city in water sustainability development in 2015, with the nation boasting the highest drinking water and sanitation standards in the region. ## History The PUB is the statutory board of then Ministry of the Environment and Water Resources responsible for acquiring, producing, disseminating and reclaiming water to ensure a sustainable and efficient water supply for Singapore. It has also been known as the National Water Agency, after it stopped facilitating the supply of electricity and gas. During the colonial period and up to 1961, the supply of water in Singapore was managed by the Municipal Water Department under the guidance of the Municipal Engineer. Three reservoirs in Singapore are named after notable Municipal Engineers [James MacRitchie](/wiki/James_MacRitchie), [Robert Peirce](/wiki/Robert_Peirce_(engineer)) and [David J. Murnane](/wiki/David_J._Murnane). The idea of a Public Utilities Board was first introduced in 1961 when industrialisation was driving up the country's demand for power. However, it was only in 1 May 1963 that the statutory board came into force. Prior to its reconstitution as the National Water Agency on 1 April 2001, the PUB was previously under the [Ministry of Trade and Industry](/wiki/Ministry_of_Trade_and_Industry_(Singapore)) where it facilitated the supply of electricity, water and gas in Singapore. Today, the PUB is solely in charge of water supplies with the management and control of electricity and gas transferred to the [Energy Market Authority](/wiki/Energy_Market_Authority) (EMA). In 2003 and 2005, the PUB launched the first NEWater project and the first desalinated water treatment project respectively. This further diversified water supply in Singapore to four main sources: local catchment water, imported water, NEWater and desalinated water. They are also known as the Four National Taps. ## Operations Singapore faces a problem of water shortage with its limited land area. Long-term [water security](/wiki/Water_security) has been one of the key priorities of the [government of Singapore](/wiki/Government_of_Singapore). As the national water agency, PUB takes control of the entire water chain. From the collection of rainwater to water reclamation, the four main processes involved are collection, production, distribution and reclamation. In the collection process, rainwater is collected through a network of rivers, drains and canals and stored in the reservoirs before undergoing treatment for drinking water purposes. The reservoirs are equipped with pipelines that interlink the collection ponds to manage excess water by controlling the water level in each reservoir. In 2011, rainwater collected on two-thirds of Singapore's land surface is channeled into reservoirs. In the production process, raw water from the reservoirs is piped to the waterworks to be treated with chemical coagulation, [rapid gravity filtration](/wiki/Rapid_gravity_filter) and [chlorine disinfection](/wiki/Water_chlorination). These procedures remove harmful particles and suspended particulate matters from the raw water, making them safe for consumption. The filtered water is stored in water tanks for water quality checks before being distributed to the people. Used water is collected through a sewerage system and treated at water reclamation plants in the reclamation process. The water is purified using NEWater technology to produce NEWater. With the development of the deep tunnel sewerage system (DTSS) aimed for completion in 2022, sewage will be conveniently transported to three water reclamation plants for treatment. ## Four National Taps Compelled by the need for self-reliance and sustainability, PUB has invested in and developed a dynamic, efficient and sustainable water supply system stemming from four different sources, also known as the Four National Taps. The Four National Taps form the backbone of PUB's, and in turn Singapore's, [water management](/wiki/Water_resource_management) strategy. ### Local catchment water Singapore's rainwater is collected and stored in 17 reservoirs using an extensive network of drains, rivers and canals. The 17 reservoirs for rainwater collection are [Pandan Reservoir](/wiki/Pandan_Reservoir), [Kranji Reservoir](/wiki/Kranji_Reservoir), [Jurong Lake](/wiki/Jurong_Lake), [MacRitchie Reservoir](/wiki/MacRitchie_Reservoir), [Upper Peirce Reservoir](/wiki/Upper_Peirce_Reservoir), [Lower Peirce Reservoir](/wiki/Lower_Peirce_Reservoir), [Bedok Reservoir](/wiki/Bedok_Reservoir), [Upper Seletar Reservoir](/wiki/Upper_Seletar_Reservoir), [Lower Seletar Reservoir](/wiki/Lower_Seletar_Reservoir), [Poyan Reservoir](/wiki/Poyan_Reservoir), [Murai Reservoir](/wiki/Murai_Reservoir), [Tengeh Reservoir](/wiki/Tengeh_Reservoir), [Sarimbun Reservoir](/wiki/Sarimbun_Reservoir), [Pulau Tekong Reservoir](/wiki/Pulau_Tekong_Reservoir), [Marina Reservoir](/wiki/Marina_Reservoir), [Serangoon Reservoir](/wiki/Serangoon_Reservoir) and [Punggol Reservoir](/wiki/Punggol_Reservoir). PUB makes use of online sensors and sampling methods to monitor the quality of raw water it is treating. ### Imported water Under the 1962 Water Agreement, Singapore is entitled to draw up to 250 million gallons of water per day from the Johor River. In 2061, the remaining contract between Singapore and Johor will expire. To lessen its reliance on Malaysia, Singapore has introduced new ways of water sources to meet Singapore's demand for water. By diversifying Singapore' s water supply, Singapore has been successful in building up a robust water system. ### NEWater [NEWater](/wiki/NEWater) is a term invented by PUB. It is a high-quality [reclaimed water](/wiki/Reclaimed_water) which is purified using advanced membrane and [ultraviolet germicidal irradiation](/wiki/Ultraviolet_germicidal_irradiation). It is scientifically tested to have surpassed the [World Health Organization](/wiki/World_Health_Organization)'s requirements for safe drinking water. In 2021, [NEWater](/wiki/NEWater) was able to meet 40% of Singapore's need and demand for water. Despite [NEWater](/wiki/NEWater) being tested safe for potable use, PUB blends [NEWater](/wiki/NEWater) with raw reservoir water so that it will undergo the same conventional water treatment process. The process re-introduces trace minerals that had been removed during the production of [NEWater](/wiki/NEWater) and provide additional safety precaution beyond the advanced technologies used to produce [NEWater](/wiki/NEWater). ### Desalinated water [Desalinated water](/wiki/Desalinated_water) is Singapore's fourth National Tap. It was first introduced in September 2005, with the first SingSpring Desalination Plant located in [Tuas](/wiki/Tuas). The plant can produce up to 30 million gallons of water a day (136,000 cubic meters) and is one of the region's largest seawater reverse-osmosis plants. During the pretreatment process, suspended particles in the sea water are removed. The water then undergoes [reverse osmosis](/wiki/Reverse_osmosis); the same technology used in the production of [NEWater](/wiki/NEWater). The pure desalinated water is then blended with treated water before it is supplied to homes and industries. Today, with the addition of four other desalination plants, namely the Tuas South Desalination Plant, Marina East Desalination Plant, Tuas Desalination Plant, and Jurong Island Desalination Plant, desalinated water can meet up to 25% of Singapore's current water demand. ### Active, Beautiful, Clean (ABC) Waters programme The ABC programme is a long term initiative that started in 2006. In developing this programme, PUB seeks the collaboration and advice from the 3P sectors of public, private and people to help them in building a firm relationship with water and develop a joint responsibility for it. PUB also plans to utilize this channel to create awareness of the concept and application of its programmes amongst industry experts in hopes to attract and train professionals to design and implement this project. Thus far, PUB has identified more than 100 potential development regions with 27 already in progress. PUB's proposal has won Singapore the Utility Performance Initiative of the Year at the Global Water Awards 2013 presented at the Global Water Summit in [Seville](/wiki/Seville), Spain. ### Water efficiency management plan Introduced in 2010, the Water Efficiency Management Plan (WEMP) is an initiative introduced by PUB to aid businesses in the efficient management of water usage. It primarily serves to provide a clear breakdown of water usage, identify potential areas for improvement and draft a strategy to improve business operational processes. From 2015, bulk consumers of water, with businesses using more than 60,000 cubic metres of water in the previous year will be required to install water meters to monitor water usage. These businesses will also have to submit their WEMP to PUB annually for the next 3 years to ensure adherence to the requirement. ### Corporate philanthropy PUB has been awarded the Pinnacle Award in 2007 in recognition for its loyal and continued commitment to Community Chest. PUB's employees have been supporting the virtue of corporate philanthropy by consistently and steadily contributing to the Share Programme under the Community Chest since 1986. ## Unions Employees of Public Utilities Board are represented by the Public Utilities Board Employees' Union, a House Union affiliated to the [National Trades Union Congress](/wiki/National_Trades_Union_Congress). ## International awards and achievements YearAward(s)CompetitionNomination2005Outstanding Engineering Achievement Award[Association of Southeast Asian Nations](/wiki/Association_of_Southeast_Asian_Nations)Deep Tunnel Sewerage System2006Water Agency of the YearGlobal Water Awards in DubaiPUB20072007 [Stockholm Industry Water Award](/wiki/Stockholm_Industry_Water_Award)[Stockholm Industry Water Award](/wiki/Stockholm_Industry_Water_Award)PUB2008Environmental Contribution of the YearGlobal Water Awards in London[NEWater](/wiki/NEWater)2008Overall Grand Prize[IPRA Golden World Awards](/wiki/IPRA_Golden_World_Awards) for Excellence in LondonPUB2009Water Project of the YearGlobal Water Awards in Zurich, SwitzerlandDeep Tunnel Sewerage System2011World Class Award under the Not-for-Profit CategoryGlobal Performance Excellence Awards (GPEA)PUB2013Utility Performance Initiative of the YearGlobal Water Awards in Seville, SpainActive, Beautiful, Clean Waters (ABC Waters) Programme under the PUB ## Official mascot Water Wally is the official mascot for PUB. It is blue in colour and takes the form of a water droplet. It helps to spread messages about water preservation and proper water usage to the public in a lively and interactive way. PUB hopes that it will reach out to the masses, especially the young, and encourage everyone to play their part in water sustainability by conserving water and keeping the waterways clean. - [Water supply and sanitation in Singapore](/wiki/Water_supply_and_sanitation_in_Singapore) - [List of dams and reservoirs in Singapore](/wiki/List_of_dams_and_reservoirs_in_Singapore) - [Ministry of the Environment and Water Resources](/wiki/Ministry_of_the_Environment_and_Water_Resources) - [Statutory boards of Singapore](/wiki/Statutory_boards_of_the_Singapore_Government) - [Singapore International Water Week](/wiki/Singapore_International_Water_Week) - [Floods in Singapore](/wiki/Floods_in_Singapore) - Official website - Ministry of the Environment and Water Resources – Official site - NEWater – Official site\n",
  "language": "en",
  "processed_at": "2026-01-12T11:45:12.975798",
  "title": "Public Utilities Board",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Public_Utilities_Board"
}